[
    {
        "englishURN": 1065870,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "1.00",
        "babName": "Eclipse of the sun and moon",
        "hadithNumber": 1460,
        "hadithText": "It was narrated that Abu Bakrah said:\n\"The Messenger of Allah (ﷺ) said: 'The sun and moon are two signs of Allah (SWT), the Most High, and they do not become eclipsed for death or birth of anyone, rather Allah (SWT), the Mighty and Sublime, strikes fear into His slaves through them.'\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1114670,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1065880,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "2.00",
        "babName": "Tasbih, Takbir and supplication while the sun is eclipsed",
        "hadithNumber": 1461,
        "hadithText": "'Abdur-Rahman bin Samurah said:\n\"While I was (practicing) shooting some arrows in Al-Madinah, the sun became eclipsed. I gathered up my arrows and said: 'I want to see what the Messenger of Allah (ﷺ) will say about the eclipse of the sun.' So I came to him from behind when he was in the masjid, and he started to say the tasbih and takbir and to supplicate until the eclipse was over. Then he stood up and prayed two rak'ahs with four prostrations.\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1114680,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1065890,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "3.00",
        "babName": "The command to pray when there is a solar eclipse",
        "hadithNumber": 1462,
        "hadithText": "It was narrated from 'Abdullah bin 'Umar that:\nThe Messenger of Allah (ﷺ) said: \"The sun and moon do not become eclipsed for death or birth of anyone, rather they are two of the signs of Allah (SWT) the Most High, so when you see that then pray.\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1114690,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1065900,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "4.00",
        "babName": "The command to pray when there is a lunar eclipse",
        "hadithNumber": 1463,
        "hadithText": "It was narrated that Abu Mas'ud said:\n\"The Messenger of Allah (ﷺ) said: \"The sun and the moon do not become eclipsed for the death or birth of anyone, rather they are two of the signs of Allah (SWT), the Mighty and Sublime, so when you see that then pray.'\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1114700,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1065910,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "5.00",
        "babName": "The command to pray when there is an eclipse until it is over",
        "hadithNumber": 1464,
        "hadithText": "It was narrated that Abu Bakrah said:\n\"The Messenger of Allah (ﷺ) said: 'The sun and moon are two signs of Allah(ﷺ), and they do not become eclipsed for the death or birth of anyone. If you see that then pray until it (the eclipse) is over.'\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1114710,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1065920,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "5.00",
        "babName": "The command to pray when there is an eclipse until it is over",
        "hadithNumber": 1465,
        "hadithText": "It was narrated that Abu Bakrah said:\n\"We were sitting with the Prophet (ﷺ) when the sun became eclipsed. He leapt up, dragging his garment and prayed two rak'ahs until the eclipse was over.\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1114720,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1065930,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "6.00",
        "babName": "The command to call people to the eclipse prayer",
        "hadithNumber": 1466,
        "hadithText": "It was narrated that 'Aishah said:\n\"The sun was eclipsed during the time of the Messenger of Allah (ﷺ), and the Prophet (ﷺ) commanded a caller to call out that prayer was about to begin in congregation. So they gathered and formed rows, and he led them in prayer, bowing four times in two rak'ahs and prostrating four times.\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1114730,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1065940,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "7.00",
        "babName": "The rows in the eclipse prayer",
        "hadithNumber": 1467,
        "hadithText": "'Urwah bin Az-Zubair narrated that 'Aishah, the wife of the Prophet (ﷺ) said:\n\"The sun was eclipsed during the life of the Prophet (ﷺ). The Messenger of Allah (ﷺ) went out to the masjid and stood and said the takbir, and the people formed rows behind him. He bowed four times and prostrated four times, and the eclipse ended before he finished.\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 1114740,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1065950,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "8.00",
        "babName": "How to perform the eclipse prayer",
        "hadithNumber": 1468,
        "hadithText": "It was narrated from Tawus from Ibn Abbas, that :\nThe Messenger of Allah (ﷺ) prayed when the sun was eclipsed, bowing eight times and prostrating four times.</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 1114750,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1065960,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "8.00",
        "babName": "How to perform the eclipse prayer",
        "hadithNumber": 1469,
        "hadithText": "It was narrated from Tawus from Ibn Abbas that:\nThe Prophet (ﷺ) prayed when there was an eclipse. He recited then he bowed, then he recited then he bowed, then he recited then he bowed, then he recited then he bowed, then he prostrated, and he did the second rak'ahs in same fashion.</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 1114760,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1065970,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "9.00",
        "babName": "Another version of the eclipse prayer, narrated from Ibn Abbas",
        "hadithNumber": 1470,
        "hadithText": "It was narrated from Kathir bin Abbas, from Abdullah bin Abbas that:\nThe Messenger of Allah (ﷺ) prayed on the day the sun was eclipsed, bowing four times in two rak'ahs and prostrating four times.</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 1114770,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1065980,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "10.00",
        "babName": "Another version of the eclipse prayer",
        "hadithNumber": 1471,
        "hadithText": "'Ata said: \"I heard Ubaid bin Umair say:\n'Someone whom I trust'- and I think he meant Aishah- told me: There was an eclipse of the sun during the time of the Messenger of Allah (ﷺ). He led the people in prayer and stood for a very long time, then he bowed, then he stood, then he bowed, then he stood, then he bowed. He prayed two rak'ahs, bowing three times in each rak'ah. After bowing for the third time he prostrated for a long time. Some men fainted on that day and had to be revived by having buckets of water thrown over them, because of having stood for so log. When he bowed, he said: Allahu Akbar, and when he raised his head, he said: Sami' Allahu lima hamidah.He did not finish until the eclipse had ended. Then he stood and praised and glorified Allah (SWT) and said: The sun and moon do not eclipse for the death or birth of anyone, but they are two of the signs of Allah (SWT) with which He strikes fear unto you.  If they are eclipsed then turn to the remembrance of Allah, the Mighty and Sublime, until it (the eclipse) is over.'\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 1114780,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1065990,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "10.00",
        "babName": "Another version of the eclipse prayer",
        "hadithNumber": 1472,
        "hadithText": "It was narrated fom 'Ata from Ibn 'Umair, from Aishah, that:\nThe Prophet (ﷺ) prayed, bowing six times and prostrating four times. \"I said to Mu'adh: 'Is this from the Prophet (ﷺ)?' He said: 'Without a doubt.'\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 1114790,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066000,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "11.00",
        "babName": "Another version narrated from Aishah",
        "hadithNumber": 1473,
        "hadithText": "It was narrated from Ibn Shihab rom 'Urwah bin Az-Zubair, that Aishah said:\n\"The sun was eclipsed during the lifetime of the Messenger of Allah (ﷺ). He stood and said the takbir, and the people formed rows behind him. The Messenger of Allah (ﷺ) recited for a long time, then he said the takbir and bowed for a long time, then he raised his head and said: Sami Allahu liman hamidah, Rabbana wa lakal-hamd. Then he stood and recited for a long time, but it was a shorter recitation than the first recitation, then he said the takbir and bowed but it was shorter than the first bowing. Then he said: Sami Allahu liman hamidah, then he prostrated. In this manner, he bowed four times, and the eclipse ended before he had finished. Then he stood and addressed the people. He praised and glorified Allah (SWT), the Mighty and Sublime, as He deserves, then he said: The sun and moon are two of the signs of Allah (SWT), Most High. They do not become eclipsed for the death or birth of anyone. If you see that (eclipsed) then pray until it ends. And the Messenger of Allah (ﷺ) said: While I was standing just now I saw everything you have been promised. When you saw me moving forward, I wanted to take a cluster of fruit from Paradise. And I saw Hell; parts of it were consuming other parts when you saw me step backward. And I saw therein Ibn Luhayy, who was the first one to establish the Sa'ibah.'\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 1114800,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066010,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "11.00",
        "babName": "Another version narrated from Aishah",
        "hadithNumber": 1474,
        "hadithText": "It was narrated from Az-Zuhri, from 'Urwah, that :\nAishah said: \"The sun was eclipsed during the lifetime of the Messenger of Allah (ﷺ) and it was called out: 'As-salatu jam'iah (prayer is about to begin in congregation).' So the people gathered and the Messenger of Allah (ﷺ) led them in prayer, bowing four times in two rak'ahs and prostrating four times.\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 1114810,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066020,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "11.00",
        "babName": "Another version narrated from Aishah",
        "hadithNumber": 1475,
        "hadithText": "It was narrated from Hisham bin 'Urwah, from his father, that 'Aishah said:\n'The sun was eclipsed during the time of the Messenger of Allah (ﷺ) and the Messenger of Allah (ﷺ) led the people in prayer. He stood for a long time, then he bowed for a long time, then he stood for a long time, but it was shorter than the first standing, then he bowed for a long time but it was shorter than the first bowing. Then he stood up, then he prostrated, then he did the same in the second rak'ah, and when he finished the eclipse had ended. Then he addressed the people; he praised and glorified Allah (SWT), then he said: The sun and the moon are two of the signs of Allah (SWT). They do not become eclipsed for the death or birth of anyone. If you see that then call upon Allah (SWT), the Mighty and Sublime, and magnify Him, and give charity. Then he said: 'O Ummah of Muhammad! There is no one more jealous than Allah (SWT), the Mighty and Sublime, when his male or female slave commits zina. O Ummah of Muhammad! By Allah, if you knew what I know, you would laugh little and weep much.'\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 1114820,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066030,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "11.00",
        "babName": "Another version narrated from Aishah",
        "hadithNumber": 1476,
        "hadithText": "It was narrated from Yahya bin Sa'eed that :\n'Amrah told him that Aishah told her that a Jewish woman came to her and said: \"May Allah protect you from the torment of the grave.\" Aishah said: \"O Messenger of Allah, will people be tormented in the graves?\" The Messenger of Allah (ﷺ) sought refuge with Allah. 'Aishah said: \"The Prophet (ﷺ) went out, and the sun became eclipsed. We went out to another room and the women gathered with us. The Messenger of Allah (ﷺ) came to us and that was at the time of forenoon. He stood for a long time, then he bowed for a long time, then he raises his head and stood for a shorter time than the first one; then he bowed for a shorter time than the first one. Then he prostrated, then he stood up for the second (rak'ah) and did the same again, except that his bowing an prostrating were shorter than in the first rak'ah. Then he prostrated, and the eclipse had ended. When he had finished, he sat on the minbar and one of the things he said was: 'The people will be tried in their graves like the trial of the Dajjal.' Aishah siad: 'After that, we used to hear him seeking refuge with Allah (SWT) from the torment of the grave.\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 1114830,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066040,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "12.00",
        "babName": "Another version",
        "hadithNumber": 1477,
        "hadithText": "Amrah said:\n\"I heard Aishah say: 'A Jewish woman came to me begging, and said: May Allah grant you protection from the torment of the grave.' When the Messenger of Allah (ﷺ) came, I said: 'O Messenger of Allah (ﷺ), will people be tormented in their graves?' He sought refuge with Allah (SWT) and climbed onto his mount. The sun became eclipsed while I was between the apartments with some women. The Messenger of Allah (ﷺ) came from his mount and came to his prayer place, and led the people in prayer.He stood for a long time, then he bowed for a long time, then he raised his head and stood for a long time, then he bowed for a long time, then he raised his head and stood for a long time, then he prostrated for a long time. Then he stood for a shorter time than in the first (rak'ah), then he bowed for a shorter time than the first, then he raised his head and stood for a shorter time than the first, then he bowed for a shorter time than the first, then he raised his head and stood for a shorter time than the first, so he bowed four times and prostrated four times, and the eclipse ended. He said: \"You will be tried in your graves like the trial of the Dajjal.' Aishah said: 'I heard him after that seeking refuge with Allah from the torment of the grave.'\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 1114840,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066050,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "12.00",
        "babName": "Another version",
        "hadithNumber": 1478,
        "hadithText": "It was narrated from Aishah that:\nThe Messenger of Allah (ﷺ) prayed during an eclipse in a shaded area near Zamzam, bowing four times and prostrating four times.</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 1114850,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066060,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "12.00",
        "babName": "Another version",
        "hadithNumber": 1479,
        "hadithText": "It was narrated that Jabir bin 'Abdullah said:\n\"The sun eclipsed during the time of the Messenger of Allah (ﷺ) on a very hot day. The Messenger of Allah (ﷺ) led his companions in prayer, and he stood for so long that they started to fall over. Then he bowed for a long time, then he stood up (and remained standing) for a long time. Then he bowed again for a long time, then he stood up (again) and (remained standing) for a long time. Then he prostrated twice, then he stood up and did the same again. He started to move forward, then he started to step back. He bowed four times and prostrated four times. They used to say that eclipses of the sun and moon only happened when one of their great men died, but they are two of the signs of Allah (SWT) that He shows to you, so when an eclipse happens, pray until it is over.\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 1114860,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066070,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "13.00",
        "babName": "Another version",
        "hadithNumber": 1480,
        "hadithText": "It was narrated that Abdullah bin 'Amr said:\n\"The sun was eclipsed during the time of the Messenger of Allah (ﷺ), so he issued orders that the call be given: 'As-salatu jam'iah. The Messenger of Allah (ﷺ) led the people in prayer, bowing twice and prostrating twice. Then he stood and prayed, bowing twice and prostrating once. 'Aishah said: 'I never bowed or prostrated for so long as that.'\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 1114870,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066080,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "13.00",
        "babName": "Another version",
        "hadithNumber": 1481,
        "hadithText": "It was narrated that 'Abdullah bin 'Amr said:\n\"The sun was eclipsed and the Messenger of Allah (ﷺ) bowed twice and prostrated twice, then he stood up and bowed twice and prostrated twice. Then the eclipse ended. 'Aishah used to say: \"The Messenger of Allah (ﷺ) never prostrated or bowed for so long as that.'\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 1114880,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066090,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "13.00",
        "babName": "Another version",
        "hadithNumber": 1482,
        "hadithText": "Abu Hafs, the freed slave of 'Aishah, narrated that 'Aishah told him:\n\"When the sun was eclipsed during the time of the Messenger of Allah (ﷺ), he performed wudu' and ordered that the call be given: 'As-salatu jami'ah.' He stood for a long time in prayer,\" and 'Aishah said: \"I thought that he recited Surah Al-Baqarah. Then he bowed for a long time, then he said: Sami' Allahu liman hamidah. Then he bowed, then prostrated. Then he stood up and did the same again, bowing twice and prostrating once. Then he sat and the eclipse ended.\"</b>",
        "bookID": "16.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 1114890,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066100,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "14.00",
        "babName": "Another version",
        "hadithNumber": 1483,
        "hadithText": "Abdullah bin 'Amr said:\n\"The sun eclipsed during the time of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) got up to pray, and those who were with him also got up. He stood for a long time, then he bowed for a long time, then he raised his head and (then) prostrated for a long time. Then he raised his head and sat for a long time. Then he prostrated for a long time, then he raised his head and stood up, and he did in the second rak'ah the same as he had done in the first, standing, bowing, prostrating and sitting. He started blowing and weeping at the end of his prostration in the second rak'ah, saying: 'You did not tell me that You would do that while I was still among them; You d not tell me that You would do that while we are asking You for forgiveness.' Then he raised his head and the eclipse ended. The Messenger of Allah (ﷺ) stood and addressed the people. He praised and glorified Allah then he said: \"The sun and moon are two of the signs of Allah (SWT), the Mighty and Sublime. If you see either of them being eclipsed, then hasten to remember Allah (SWT), the Mighty and Sublime. By the One in Whose Hand is the soul of Muhammad, Paradise was brought so near to me that if I had stretched out my hand, I could have taken some of its fruits. And Hell was brought so near to me that I tried to ward it off for fear it may overwhelm you. I saw therein a woman from Himyar who was being punished because of a cat she tied up, not leaving it free to eat of the vermin of the earth, nor feeding it or giving it water, until it died. I saw it biting her when she came and biting her backside when she went. And I saw the owner of the Sabtiyatain, the brother of Banu As-Da'da, being pushed with a  two-pronged stick in the Fire. And I saw the owner of the stick with a crooked end, who used to steal from the Hajj pilgrims with that crooked stick, leaning on his stick in Hell and saying: 'I am the thief with the crooked stick.'\"</b>",
        "bookID": "16.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 1114900,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066110,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "14.00",
        "babName": "Another version",
        "hadithNumber": 1484,
        "hadithText": "It was narrated that Abu Hurairah said:\n\"The sun eclipsed during the time of the Messenger of Allah (ﷺ). He stood and led the people in prayer. He stood for a long time, then he bowed for a long time, then he stood for a long time that was shorter than the first time, then he bowed for a long time that was shorter than the first time. Then he prostrated for a long time, then he sat up, then he prostrated for a long time that was shorter than the first time. Then he stood up and bowed twice again, doing the same again. Then he prostrated twice, doing the same again, until he had finished his prayer. Then he said: 'The sun and the moon are two of the signs of Allah (SWT), and they do not become eclipsed for the death or birth of anyone. If you see that then hasted to remember Allah (SWT) and pray.'\"</b>",
        "bookID": "16.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 1114910,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066120,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "15.00",
        "babName": "Another version",
        "hadithNumber": 1485,
        "hadithText": "Tha'labah bin 'Abbad Al-'Abdi from the people of Al-Basrah narrated that:\nHe attended a Khutbah one day that was delivered by Samurah bin Jundub. In his Khutbah he mentioned a hadith from the Messenger of Allah (ﷺ). Samurah bin Jundub said: \"One day a boy from among the Ansar and I were shooting at two targets of ours, during the time of the Messenger of Allah (ﷺ), when the sun was at a height of two or three spears as it appears to one who is looking at the horizon. The sun turned black, and we said to one another, let us go to the masjid, for by Allah (SWT) this must herald some event concerning the Messenger of Allah (ﷺ) and his ummah. We went to the masjid and we saw the Messenger of Allah (ﷺ) coming out to the people. He went forward and prayed. He stood for the longest time that he had ever stood in any prayer in which he led us, but we did not hear him saying anything. Then he bowed for the longest time that he had ever bowed in any prayer in which he led us, but we did not hear him saying anything. Then he prostrated for the longest time that he had ever prostrated in any prayer in which he led us, but we did not hear him saying anything. The he did likewise in the second rak'ah. And the eclipse ended as he was sitting at the end of the second rak'ah. The he said the salam, then he praised and glorified Allah (SWT), and bore witness that there is none worthy of worship but Allah (SWT) and he bore witness that he was the slave and Messenger of Allah.\" Narrated in abridged form.</b>",
        "bookID": "16.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 1114920,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066130,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "16.00",
        "babName": "Another version",
        "hadithNumber": 1486,
        "hadithText": "It was narrated that An-Nu'man bin Bashir said:\n\"The sun eclipsed during the time of the Messenger of Allah (ﷺ) and he rushed out, dragging his cloak until he came to the masjid. He continued leading us in prayer until the eclipse ended. When it ended, he said: 'People claim that the eclipse of the sun and moon only happen when a great man dies, but that is not so. Eclipses of the sun and the moon do not happen for the death or birth of anyone, but they are signs from Allah (SWT), the Mighty and Sublime. When Allah, the Mighty and Sublime, manifests Himself to anything of His creation, it humbles itself before Him, so if you see that then pray like the last obligatory prayer you did before that.'\"</b>",
        "bookID": "16.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 1114930,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066140,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "16.00",
        "babName": "Another version",
        "hadithNumber": 1487,
        "hadithText": "It was narrated that Qabisah bin Mukhariq Al-Hilali said:\n\"There was an eclipse of the sun and at the time we were with the Messenger of Allah (ﷺ) in Al-Madinah. He rushed out dragging his garment and prayed two rak'ahs, which he made lengthy. The end of his prayer coincided with the end of the eclipse. He praised and glorified Allah (SWT), then he said: 'The sun and the moon are two of the signs of Allah (SWT), and they do not become eclipsed for the death or birth of anyone. If you see anything of that, then pray like the last obligatory prayer you did before that.'\"</b>",
        "bookID": "16.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 1114940,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066150,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "16.00",
        "babName": "Another version",
        "hadithNumber": 1488,
        "hadithText": "It was narrated from Qabisah Al-Hilali:\nThat there was an eclipse of the sun and the Prophet of Allah (ﷺ) prayed two rak'ahs until it ended. Then he said: \"The sun and the moon do not become eclipsed for the death of anyone, but they are two of His creations. Allah, the Mighty and Sublime, causes whatever He wants to happen in His creation. If Allah (SWT), the Mighty and Sublime, manifests Himself to any of His creation, it humbles itself before Him, so if either of them (solar or lunar eclipse) happens, pray until it is over or until Allah causes something to happen.\"</b>",
        "bookID": "16.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 1114950,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066160,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "16.00",
        "babName": "Another version",
        "hadithNumber": 1489,
        "hadithText": "It was narrated from An-Nu'man bin Bashir that :\nThe Prophet (ﷺ) said: \"If there is an eclipse of the sun or the moon, pray like the last obligatory prayer you did before that.\"</b>",
        "bookID": "16.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 1114960,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066170,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "16.00",
        "babName": "Another version",
        "hadithNumber": 1490,
        "hadithText": "It was narrated from An-Nu'man bin Bashir that:\nThe Messenger of Allah (ﷺ) prayed when there was an eclipse of the sun like our prayer, bowing and prostrating.</b>",
        "bookID": "16.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 1114970,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066180,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "16.00",
        "babName": "Another version",
        "hadithNumber": 1491,
        "hadithText": "It was narrated from An-Nu'man bin Bashir that :\nThe Prophet (ﷺ) came rushing out to the masjid one day when the sun eclipsed, and he prayed until the eclipse ended, then he said: \"The people of Jahilliyyah used to say that eclipses of the sun and the moon only happened when some great man on earth died. But eclipses of the sun and the moon do not happen for the death or birth of anyone. Rather they are two of the creations of Allah (SWT) and Allah (SWT) causes to happen in His creation what He wills. Whichever of them becomes eclipsed, pray until it is over or Allah (SWT) causes something to happen.\"</b>",
        "bookID": "16.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 1114980,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066190,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "16.00",
        "babName": "Another version",
        "hadithNumber": 1492,
        "hadithText": "It was narrated that Abu Bakrah said:\n\"We were with the Messenger of Allah (ﷺ) when the sun became eclipsed. The Messenger of Allah (ﷺ) went out dragging his garment, until he came to the masjid, and the people gathered around him. He led us in praying two rak'ahs and when (the eclipse) ended he said: 'The sun and the moon are two of the signs of Allah (SWT) by means of which Allah (SWT), the Mighty and Sublime, strikes fear into His slaves. They do not become eclipsed for the death or birth of anyone. If you see that, then pray until Allah (SWT)r relieves you of fear.' That was because his son named Ibrahim had died, and the people suggested to him that (the eclipse) happened because of that.\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 1114990,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066200,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "16.00",
        "babName": "Another version",
        "hadithNumber": 1493,
        "hadithText": "It was narrated from Abu Bakrah that:\nThe Messenger of Allah (ﷺ) prayed two rak'ahs like this prayer of yours, and he mentioned the eclipse of the sun.</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 1115000,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066210,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "17.00",
        "babName": "Length of recitation for the eclipse prayer",
        "hadithNumber": 1494,
        "hadithText": "It was narrated that 'Abdullah bin Abbas said:\n\"There was an eclipse of the sun and the Messenger of Allah (ﷺ) prayed and the people with him. He stood for long time reciting something like Surah Al-Baqarah, then he raised (his head) and stood for a long time, then he raised (his head) and stood for a long time which was shorter than the first time. Then he bowed for a long time, which was shorter than the first time, then he prostrated. Then he got up and stood for a long time, which was shorter than the first time, then he bowed for a long time, which was shorter than the first time, then he raised (his head) and stood for a long time, which was shorter than the first time. Then he bowed for a long time, which was shorter than the first time, then he prostrated, then he finished (his prayer) and the sun had been clear. He said: 'The sun and the moon are two of the signs of Allah (SWT) and they do not become eclipsed for the death or birth of anyone. If you see that then remember Allah (SWT) the Mighty and Sublime.' They said: 'O Messenger of Allah (ﷺ), we saw you stretching out your hand when you were standing, then we saw you moving backward. He said: 'I saw Paradise-or it was shown to me- and I reached out to a take a bunch of its fruits. If I ha taken it you would have eaten from it for as long as this world lasts. And I saw Hell and I have never seen anything like it, and I saw that most of its inhabitants are women.' They said: \"Why, O Messenger of Allah (ﷺ)? He said: 'Because of their ingratitude.' It was said: 'Are they ungrateful to Allah?' He said: 'They are ungrateful to their husbands and they are ungrateful for kind treatment. If you are kind to one of them for a lifetime, then she sees (one) bad thing from you, she will say: I have never seen anything good from you.'\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 1115010,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066220,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "18.00",
        "babName": "Reciting out loud during the eclipse prayer",
        "hadithNumber": 1495,
        "hadithText": "It was narrated from Aishah that:\nThe Messenger of Allah (ﷺ) prayed, bowing four times, and he recited loudly, and every time he raised his head he said: \"Sami Allahu liman hamidah. Rabbana wa lakal-hamd (Allah hears those who praise Him, Our Lord to You be praise.).\"</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 1115020,
        "last_updated": "2012-11-08 19:20:47"
    },
    {
        "englishURN": 1066230,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "19.00",
        "babName": "Not reciting out loud",
        "hadithNumber": 1496,
        "hadithText": "It was narrated from Samurah that:\nThe Prophet (ﷺ) led them in prayer during an eclipse of the sun, and we did not hear him say anything.</b>",
        "bookID": "16.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 1115030,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066240,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "20.00",
        "babName": "What to say when prostrating during the eclipse prayer",
        "hadithNumber": 1497,
        "hadithText": "It was narrated that Abdullah bin Amr said:\n\"The sun eclipsed during the time of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) prayed and stood for a long time, then he bowed for a long time, then he stood up and (remained standing) for a long time.\" (One of the narrators) Shu'bh said: \"I think he said something similar concerning prostration.\"- \"He started weeping and blowing during his prostration and said: 'Lord, You did not tell me that You would do that while I am asking You for forgiveness; You did not tell me that You would do that while I was still among them.' When he finished praying he said: \"Paradise was shown to me, and if I had stretched forth my hand I could have taken some of its fruits. And Hell was shown to me, so I started blowing for fear that its heat might overwhelm you. I saw therein the thief who stole the two camels of the Messenger of Allah (ﷺ); and I saw therein the brother of Banu As-Du'du; the thief who stole from the pilgrims, and when he was caught he said: The crooked stick did it; and I saw therein a tall black woman who was being punished because of a cat she tied up and did not feed or give it water, and she did not let it eat of the vermin of the earth, until it died. Then sun and the moon do not become eclipsed for the death or birth of anyone, but they are two of the signs of Allah. If one of them becomes eclipsed'- or he said: 'if one of them does anything like that'- 'then hasten to remember Allah, the Mighty and Sublime.'\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 1115040,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066250,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "21.00",
        "babName": "The tashahhud and taslim for the eclipse prayer",
        "hadithNumber": 1498,
        "hadithText": "It was narrated that Aishah said:\n\"There was an eclipse of the sun and the Messenger of Allah (ﷺ) ordered a man to call out: As-salatu jami'ah (prayer is about to begin in congregation). The people gathered and the Messenger of Allah (ﷺ) led them in prayer. He said the takbir, then he recited at length. Then he said the takbir and bowed for a long time, as long as he had recited or longer. Then he raised his head and said: Sami Allahu liman hamidah (Allah hears those who praise Him) Then he recited at length, but it was shorter than the first time, then he said the takbir and bowed for a long time, but it was shorter than the first time. Then he raised his head and said: 'Sami Allahu liman hamidah (Allah hears those who praise Him). Then he said the takbir and prostrated for a long time, as long as he had bowed or longer. Then he said the takbir and raised his head, then he said the takbir and prostrated. Then he said the takbir and stood up, and recited for a long time that was shorter than the first time. Then he said the takbir and bowed for a long time that was shorter than the first time. Then he raised his head and said: Sami' Allahu liman hamidah. (Allah hears those who praise Him). Then he recited for a long time that was shorter than the first recitation in the second standing. Then he said the takbir and bowed for a long time that was shorter than the first time. Then he raised his head and said: Sami Allahu liman hamidah (Allah hears those who praise Him). Then he said the takbir and prostrated for a long time that was shorter than the first time. Then he recited the tashahhud, then he said the taslim. Then he stood before them and praised and glorified Allah, then he said: 'The sun and the moon do not become eclipsed for the death or birth of anyone, but they are two of the signs of Allah (SWT). Whichever of them becomes eclipsed, turn to Allah (SWT), the Mighty and Sublime, and pray.'\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 1115050,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066260,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "21.00",
        "babName": "The tashahhud and taslim for the eclipse prayer",
        "hadithNumber": 1499,
        "hadithText": "It was narrated that Asma' bint Abi Bakr said:\nThe Messenger of Allah (ﷺ) prayed during an eclipse. He stood for a long time, then he bowed for a long time, then he stood up and (remained standing) for a long time, then he bowed for a long time, then he stood up, then he prostrated for a long time, then he stood up and (remained standing) for a long time, then he bowed for a long time, then he stood up, then he prostrated for a long time, then he sat up, then he prostrated for a long time, then he sat up and then he finished.\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 1115060,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066270,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "22.00",
        "babName": "Sitting on the minbar after the eclipse prayer",
        "hadithNumber": 1500,
        "hadithText": "'Aishah said:\n\"The Prophet (ﷺ) went out and the sun became eclipsed. We went out to the apartment and some women gathered around us. The Messenger of Allah (ﷺ) turned to us, and that was at the time of the forenoon. He stood for a long time, then he bowed for a long time, then he raised his head and stood for a shorter time than the first, then he bowed for a shorter time than the first, then he prostrated. Then he stood up again and did the same, except that he stood and bowed for a shorter time than in the first rak'ah. Then he prostrated and the eclipse ended. When he had finished he sat on the minbar and among the things he said was : 'The people will be tried in their graves like the trial of the Dajjal.'\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 1115070,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066280,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "23.00",
        "babName": "How is the Khutbah delivered during an eclipse?",
        "hadithNumber": 1501,
        "hadithText": "It was narrated that Aishah said:\n\"There was an eclipse of the sun during the time of the Messenger of Allah (ﷺ). He stood and prayed, standing for a very long time, then he bowed for a very long time. Then he stood up and (remained standing) for a very long time, but shorter than the first time. Then he bowed for a very long time, but shorter than the first time. Then he prostrated, then he raised his head and stood for a long time, but it was shorter than the first time. The he stood up and (remained standing) for a long time, but it was shorter than the first time. Then he prostrated, and when he finished his prayer, the eclipse had ended. He addressed the people and praised and glorified Allah, then he said: 'The sun and the moon do not become eclipsed for the death or birth of anyone. If you see that then pray, give in charity, and remember Allah, the Mighty and Sublime.' And he said: 'O Ummah of Muhammad! There is no one who is more jealous than Allah (SWT) when His male or female slave commits Zina. O Ummah of Muhammad, if you knew what I know, you would laugh little and weep much.'\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 1115080,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066290,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "23.00",
        "babName": "How is the cheetah delivered during an eclipse?",
        "hadithNumber": 1502,
        "hadithText": "It was narrated from Samurah that:\nThe Prophet (ﷺ) delivered a Khutbah when the sun eclipsed and he said: 'Amma ba'd (to proceed).'\"</b>",
        "bookID": "16.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 1115090,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066300,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "24.00",
        "babName": "The command to supplicated during an eclipse",
        "hadithNumber": 1503,
        "hadithText": "It was narrated that Abu Bakrah said:\n\"We were with the Prophet (ﷺ) and the sun became eclipsed. He got up and went to the masjid, dragging his garment in haste. The people stood with him and he prayed two rak'ahs as they usually prayed. When the eclipse ended he addressed us and said 'The sun and the moon are two of the signs of Allah (SWT), with which He strikes fear into His slaves. They do not become eclipsed for the death or birth of anyone. If you see either of them being eclipsed, then pray and supplicate until it removed it from you.'\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 1115100,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066310,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 16,
        "bookName": "The Book of Eclipses",
        "babNumber": "25.00",
        "babName": "The command to seek forgiveness during an eclipse",
        "hadithNumber": 1504,
        "hadithText": "It was narrated that Abu Musa said:\n\"There was an eclipse of the sun, and the Messenger of Allah (ﷺ) got up in a rush, fearing that it might be the Hour. He went to the masjid, where he stood and prayed, standing, bowing and prostrating for the longest time that I ever saw him do in prayer. Then he said: 'These signs that Allah (SWT) sends do not occur for the death or birth of anyone, but Allah (SWT) sends them to strike fear into His slaves. If you see any of these things, then hasten to remember Him, call upon Him supplicate and ask for His forgiveness.'\"</b>",
        "bookID": "16.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 1115110,
        "last_updated": "2014-01-31 16:11:00"
    }
]