[
    {
        "englishURN": 1066570,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1530,
        "hadithText": "It was narrated that Tha'labah bin Zahdam said:\n\"We were with Sa'eed bin Al-'Asi in Tabaristan, and Hudhaifah bin Al-Yaman was with us. He said: 'Which of you offered the fear prayer with the Messenger of Allah (ﷺ)?' Hudhaifah said: 'I did', and he described it. He said: 'The Messenger of Allah (ﷺ) offered the fear prayer, leading one group who had formed rows behind him in praying one rak'ah, while the other group was between him and the enemy. So he led the group that was near him in praying one rak'ah, then they left and took the place of others, and the others came and he led them in praying one rak'ah.'\"</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1115370,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066580,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1531,
        "hadithText": "It was narrated that Tha'labah bin Zahdam said:\n\"We were with Sa'eed bin Al-'Asi in Tabaristan, and Hudhaifah bin Al-Yaman was with us. He said: 'Which of you offered the fear prayer with the Messenger of Allah (ﷺ)?' Hudhaifah said: 'I did.' So Hudhaifah stood and the people formed two rows behind him, one row behind him and one row facing the enemy. He led those who were behind him in praying one rak'ah, then they went and took the place of the others, and the others came and he led them in praying one rak'ah, and they did not make it up.\"</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1115380,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066590,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1532,
        "hadithText": "Narrated from Zaid bin Thabit:\nA prayer like that of Hudhaifah was narrated from Zaid bin Thabit from the Prophet (ﷺ).</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1115390,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066600,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1533,
        "hadithText": "It was narrated that Ibn Abbas said:\n\"Allah (SWT) enjoined the prayer on the tongue of your Prophet (ﷺ): four (rak'ahs) while a resident, two rak'ahs while traveling, and one rak'ah during times of fear.\"</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1115400,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066610,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1534,
        "hadithText": "It was narrated from Ibn 'Abbas that:\nThe Messenger of Allah (ﷺ) prayed at Dhi Qarad and the people formed two rows behind him, one row behind him and one row facing the enemy. He led those who were behind him in praying one rak'ah, then they went and took the place of the others, and the others came and he led them in praying one rak'ah, and they did not make it up.</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1115410,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066620,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1535,
        "hadithText": "It was narrated from 'Ubaidullah bin Abdullah bin Utbah that:\n'Abdullah bin 'Abbas said: \"The Messenger of Allah (ﷺ) stood and the people stood with him, and he said the takbir and they said the takbir. Then he bowed, and some of them bowed, then he prostrated and they prostrated, then he stood for the second rak'ah and those who had prostrated with him moved back and guarded their brothers, and the other group came and bowed and prostrated with the Prophet (ﷺ). All the people were praying and saying the takbir, but they were guarding one another.\"</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1115420,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066630,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1536,
        "hadithText": "It was narrated that Ibn 'Abbas said:\n\"The fear prayer was no more than two prostrations like the prayer of these guards of yours today behind the Imams of yours, except that it was one group after another. One group stood, although they were all behind the Messenger of Allah (ﷺ), and one group prostrated with him, then the Messenger of Allah (ﷺ) stood up and they all stood with him. Then he bowed and they all bowed with him, then he prostrated and those who had been standing the first time prostrated with him. When the Messenger of Allah (ﷺ) and those who had prostrated with him at the end of their prayer sat, those who had been standing prostrated by themselves, then they sat and the Messenger of Allah (ﷺ) said the taslim with all of them.</b>",
        "bookID": "18.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1115430,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066640,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1537,
        "hadithText": "It was narrated from Salih bin Khawwat, from Sahl bin Abi Hathmah that:\nThe Messenger of Allah (ﷺ) led them in offering the fear prayer. Some formed a row behind him and some formed a row facing the enemy. He led them in praying one rak'ah, then they moved away and the others came, and he led them in praying one rak'ah, then they got up and each (group) made up the other rak'ah.</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 1115440,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066650,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1538,
        "hadithText": "It was narrated from Salih bin Khawwat from one who had prayed the fear prayer with the Messenger of Allah (ﷺ) on the day of Dhat Ar-Riqa' that:\nOne group had formed a row behind him and another group faced the enemy. He led those who were with him in praying one rak'ah, then he remained standing and they completed the prayer by themselves. Then they moved away and formed a row facing the enemy, and the other group came and he led them in praying the rak'ah that was left for him, then he remained sitting while they completed the prayer by themselves, then he said the taslim with them.</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 1115450,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066660,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1539,
        "hadithText": "It was narrated from Salim from his father, that:\nThe Messenger of Allah (ﷺ) led one of the two groups in praying one rak'ah while the other group was facing the enemy, then they moved away and took the place of the others, and the others came and he led them in praying the other rak'ah, then he said the salam and they stood up and made up the other rak'ah, and the others stood up and made up the other rak'ah.</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 1115460,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066670,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1540,
        "hadithText": "Salim bin 'Abdullah narrated that his father said:\n\"I went out on a campaign with the Messenger of Allah (ﷺ) toward Najd. We confronted the enemy and formed ranks facing them. The Messenger of Allah (ﷺ) stood up and led us in prayer. Some of us stood with him and some of us faced the enemy. The Messenger of Allah (ﷺ) bowed and those who were with him bowed, and prostrated twice. Then they moved away and took the place of the others, and the other group who had not prayed came and he led them in bowing once and prostrating twice. Then the Messenger of Allah (ﷺ) said the salam and each of the Muslims stood up and bowed once, and prostrated twice individually.\"</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 1115470,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066680,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1541,
        "hadithText": "It was narrated that Az-Zuhri said:\n\"Abdullah bin 'Umar used to narrate that he offered the fear prayer with the Messenger of Allah (ﷺ). He said: 'The Prophet (ﷺ) said the takbir and one group of us formed a row behind him while the other group faced the enemy. The Prophet (ﷺ) led them in bowing once and prostrating twice, then they moved away and faced the enemy, and the other group came and prayed with the Prophet (ﷺ), doing likewise. Then he said the taslim, then each man of both groups stood and prayed by himself, bowing once and prostrating twice.'\"</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 1115480,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066690,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1542,
        "hadithText": "It was narrated that 'Abdullah bin Umar said:\n\"The Messenger of Allah (ﷺ) offered the fear prayer. He stood and said the takbir, and a group of us prayed behind him while another group was facing the enemy. The Messenger of Allah (ﷺ) bowed once and prostrated twice with them, then they moved away but did not say the taslim. They went to face the enemy and lined up in their places, and the other group came and formed a row behind the Messenger of Allah (ﷺ), and he led them in praying, bowing once and prostrating twice. Then the Messenger of Allah (ﷺ) said the taslim and he had bowed twice and prostrated four times. Then the two groups stood up and each man prayed by himself, bowing once and prostrating twice.\" Abu Bakr IB As-Sunni said: \"Az-Zuhri heard two hadiths from Ibn 'Umar, and he did not hear this from him.\"</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 1115490,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066700,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1543,
        "hadithText": "It was narrated that Ibn 'Umar said:\n\"The Messenger of Allah (ﷺ) offered the fear prayer during one of his battles. One group stood with him and another group faced the enemy. He led those who were with him in praying one rak'ah, then they went away and the others came, and he led them in praying one rak'ah. Then each group made up one rak'ah.\"</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 1115500,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066710,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1544,
        "hadithText": "It was narrated from Marwan bin Al-Hakam that:\nHe asked Abu Hurairah: \"Did you offer the fear prayer with the Messenger of Allah (ﷺ)?\" Abu Hurairah said: \"Yes.\" He asked: \"When?\" He said: \"In the year of the campaign to Najd. The Messenger of Allah (ﷺ) stood up to pray 'Asr and a group stood with him, and another group as facing the enemy, with their backs toward the Qiblah. The Messenger of Allah (ﷺ) said the takbir, and they all said the takbir, those who were with him and those who were with him facing the enemy. Then the Messenger of Allah (ﷺ) bowed once and the group that was with him bowed, then he and the group that was with him prostrated twice, while the others were standing facing the enemy. Then the Messenger of Allah (ﷺ) stood up and the group that was with him stood and went to face the enemy, and the group that had been facing the enemy came and bowed and prostrated while the Messenger of Allah (ﷺ) was standing there. Then they stood up, and the Messenger of Allah (ﷺ) bowed again, and they bowed and prostrated with him. Then the group that had been facing the enemy came and bowed and prostrated, while the Messenger of Allah (ﷺ) and those who were with him were sitting. Then the Messenger of Allah (ﷺ) said the taslim and they all said the taslim. So the Messenger of Allah (ﷺ) had prayed two rak'ahs and each of the two groups had prayed two rak'ahs.\"</b>",
        "bookID": "18.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 1115510,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066720,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1545,
        "hadithText": "Abu Hurairah said:\n\"The Messenger of Allah (ﷺ) was camping between Dajnan and 'Usfan, besieging the idolaters. The idolaters said: 'These people have a prayer that is dearer to them than their sons and daughters. Plan it, then strike them with a single heavy blow.' Jibril, peace be upon him, came and told the Messenger of Allah (ﷺ) to divide his companions into two groups, then lead one group in prayer while the others faced the enemy, on guard and with weapons at the ready. So he led them in praying one rak'ah, then they moved back and the others moved forward, and he led them in praying on rak'ah, so that each one of them had prayed one rak'ah with the Prophet (ﷺ) and the Prophet (ﷺ) had prayed two rak'ahs.\"</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 1115520,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066730,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1546,
        "hadithText": "It was narrated from Jabir bin 'Abdullah that:\nThe Messenger of Allah (ﷺ) led them in offering the fear prayer. One row stood in front of him and another row stood behind him. He led those who were behind in prayer, bowing once and prostrating twice, then they moved forward until they took the place of their companions, and the others came and took their place, and the Messenger of Allah (ﷺ) led them in prayer, bowing once and prostrating twice, then he said the taslim, so the Prophet (ﷺ) had prayed two rak'ahs and they had prayed one.</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 1115530,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066740,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1547,
        "hadithText": "Jabir bin Abdullah said:\n\"We were with the Messenger of Allah (ﷺ) and the Iqamah for prayer was said. The Messenger of Allah (ﷺ) stood up and one group stood behind him while another group faced the enemy. He led those who were behind him in prayer, bowing once and prostrating twice. Then they went and took the place of those who had been facing the enemy, and that group came and the Messenger of Allah (ﷺ) led them in prayer, bowing once and prostrating twice. Then the Messenger of Allah (ﷺ) said the taslim and those who were behind him said the taslim, as did the other group.\"</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 1115540,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066750,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1548,
        "hadithText": "It was narrated that Jabir said:\n\"We witnessed the fear prayer with the Messenger of Allah (ﷺ). We stood behind him in two rows, and the enemy was between us and the Qiblah. The Messenger of Allah (ﷺ) said the takbir. He bowed and we bowed, and he stood up again and we stood up. When he went down in prostration, the Messenger of Allah (ﷺ) and those who were closest to him prostrated, and the second row remained standing until the Messenger of Allah (ﷺ) and the row closest to him stood up. Then the second row prostrated when the Messenger of Allah (ﷺ) had stood up, where they were. Then the row that had been closest to the Prophet (ﷺ) moved back and the second row moved forward, each standing in the place where the other had been. The Prophet (ﷺ) bowed and we bowed, then he stood up and we stood up, and when he went down in prostration, those who were closest to him prostrated and the others remained standing. When the Messenger of Allah (ﷺ) and those who were closest to him sat up, the others prostrated, then he said the taslim.\"</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 1115550,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066760,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1549,
        "hadithText": "It was narrated that Jabir said:\n\"We were with the Prophet (ﷺ) in a palm grove and the enemy was between us and the Qiblah. The Messenger of Allah (ﷺ) said the takbir and we all said the takbir. Then he bowed and we all bowed. Then the Prophet (ﷺ) and the row that was closest to him prostrated, while the others remained standing, guarding us. When we stood up, the others prostrated where we were, then they moved forward and he bowed and they all bowed, then he stood up and they all stood up. Then the Prophet (ﷺ) and the row that was closest to him prostrated, and the others remained standing, guarding them. When they had prostrated and were sitting, the others prostrated where they were, then he said the salam.\" Jabir said: \"As your leaders do.\"</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 1115560,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066770,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1550,
        "hadithText": "Shu'bah narrated from Mansur who said:\n\"I heard Mujahid narrating from Abu Ayyash Az-Zuraqi\"- Shu'bah said: \"He had written it for me, and I read it before him, and I heard him narrating it; rather, I even memorized it.\" Ibn Bashshar said: \"I memorized it from the book\"- \"The Prophet (ﷺ) was drawing up ranks facing the enemy in 'Usfan when the idolaters were led by Khalid bin Al-Walid. The Prophet (ﷺ) led them in praying Zuhr. The idolaters said: 'They have a prayer after this that is dearer to them than their wealth and sons.' Then the Messenger of Allah (ﷺ) led them in praying 'Asr. He divided them into two rows, behind him. He led them all in bowing, then when they raised their heads he led the row that was closest to him in prostrating, while the others remained standing. When they raised their heads from prostration, the second row prostrated, as they had already bowed with the Messenger of Allah (ﷺ). Then the front row moved forward, so each of them took the place of his companion. Then the Messenger of Allah (ﷺ) led them all in bowing, then when they raised their heads from bowing, the row that was closest to him prostrated while the others remained standing, then when they had finished prostrating, the others prostrated, then the Prophet (ﷺ) said the taslim for all of them together.</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 1115570,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066780,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1551,
        "hadithText": "It was narrated that Abu 'Ayyash Al-Zuraqi said:\n\"We were with the Messenger of Allah (ﷺ) in 'Usfan and the Messenger of Allah (ﷺ) led us in praying Zuhr. The idolaters were led that day by Khalid bin Al-Walid, and the idolaters said: 'We have caught them unawares.' Then the fear prayer was revealed between Zuhr and 'Asr. The Messenger of Allah (ﷺ) led us in praying 'Asr and divided us into two groups, a  group that prayed with the Prophet (ﷺ) and a group that guarded him. He said takbir with those who were closest to him and those who were guarding them, then he bowed and both groups bowed with him. Then those who were closest to him prostrated. Then they moved back and the others moved forward and prostrated. Then he stood and led them all in bowing, those who were closest to him and those who were guarding him. Then he led those who were closest to him in prostrating, then they moved back and took the place of their companions and the others came forward and prostrated. Then he said the taslim so each group had prayed two rak'ahs with their imam. And he offered the fear prayer once in the land of Banu Sulaym.\"</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 1115580,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066790,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1552,
        "hadithText": "It was narrated from Abu Bakrah that:\nThe Messenger of Allah (ﷺ) led the people in offering the fear prayer, two rak'ahs. Then he said the taslim and led others in offering the fear prayer, then he said the taslim. So the Prophet (ﷺ) had prayed four rak'ahs.</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 1115590,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066800,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1553,
        "hadithText": "It was narrated from Jabir bin 'Abdullah that:\nThe Prophet (ﷺ) led a group of his companions in praying two rak'ahs, then he said the taslim, then he led some others in praying two rak'ahs, then he said the taslim.</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 1115600,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066810,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1554,
        "hadithText": "It was narrated that Sahl bin Abi Hathmah said concerning the fear prayer:\n\"The imam should stand up facing the Qiblah and some of them should stand with him while the others stand facing the enemy. Then he should pray one rak'ah with them and they should pray another rak'ah by themselves, and prostrate twice where they are. Then they should go to where the others are and the others should  come and he should lead them in bowing once and prostrating twice, so it will be two rak'ahs for him and one for them. Then they should bow once and prostrate twice (by themselves, to make up the other rak'ah).\"</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 1115610,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066820,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1555,
        "hadithText": "Jabir bin 'Abdullah narrated that :\nThe Messenger of Allah (ﷺ) led his companions in offering the fear prayer. One group prayed with him while the other was facing the enemy. He led them in praying two rak'ahs, then they went and took the place of the others, and the others came and he led them in praying two rak'ahs, then he said the taslim.</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 1115620,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1066830,
        "collection": "nasai",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "The Book of the Fear Prayer",
        "babNumber": "1.00",
        "babName": "The narrations mentioned for the Fear Prayer",
        "hadithNumber": 1556,
        "hadithText": "It was narrated from Abu Bakrah that:\nThe Prophet (ﷺ) offered the fear prayer with those who were behind him, praying two rak'ahs (with them) and two rak'ahs with those who came after them, so the Prophet (ﷺ) prayed four rak'ahs and the others each prayed two rak'ahs.</b>",
        "bookID": "18.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 1115630,
        "last_updated": "2014-01-31 16:11:00"
    }
]