[
    {
        "englishURN": 1030960,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "1.00",
        "babName": "The Obligation Of Jihad",
        "hadithNumber": 3087,
        "hadithText": "Narrated It was narrated that Ibn Abbas said:\n“When the Prophet was expelled from Makkah, Abu Bakr said to him: ‘They have driven out their Prophet, verily to Allah we belong and to Him we return. They are surely doomed.’ Then it was revealed: ‘Permission to fight (against disbelievers) is given to those (believers) who are fought against, because they have been wronged; and surely, Allah is able to give them (believers) victory.’ Then I knew that there would be fighting.” Ibn Abbas said: “This is the first Verse that was revealed concerning fighting.”</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1130960,
        "last_updated": "2014-01-31 16:11:00"
    },
    {
        "englishURN": 1030970,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "1.00",
        "babName": "The Obligation Of Jihad",
        "hadithNumber": 3088,
        "hadithText": "Narrated It was narrated from Ibn Abbas:\nthat Abdur-Rahman bin Awf and some of his companions came to the Prophet in Makkah and said: “O Messenger of Allah! We were respected when we were idolaters and when we believed, we were humiliated.” He said: “I have been commanded to pardon, so do not fight.” Then, when Allah caused us to move to Al-Madinah, He commanded us to fight, but they refrained. Then Allah, the Mighty and Sublime, revealed: Have you not seen those who were told to hold back their hands (from fighting) and perform As-Salah”</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1130970,
        "last_updated": "2014-01-31 16:11:01"
    },
    {
        "englishURN": 1030980,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "1.00",
        "babName": "The Obligation Of Jihad",
        "hadithNumber": 3089,
        "hadithText": "Narrated It was narrated that Abu Hurairah said::\n“The Messenger of Allah said: ‘I have been sent with concise speech and I have been supported with fear. While I was sleeping, the keys to the treasures of the Earth were brought to me and placed in my hands.’” Abu Hurairah said: “The Messenger of Allah has gone and you are acquiring them.”</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1130980,
        "last_updated": "2014-01-31 16:11:01"
    },
    {
        "englishURN": 1030990,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "1.00",
        "babName": "The Obligation Of Jihad",
        "hadithNumber": 3090,
        "hadithText": "Narrated It was narrated that Abu Hurairah said::\n“I heard the Messenger of Allah say” a similar Hadith</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1130990,
        "last_updated": "2014-01-31 16:11:01"
    },
    {
        "englishURN": 1031000,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "1.00",
        "babName": "The Obligation Of Jihad",
        "hadithNumber": 3091,
        "hadithText": "Narrated It was narrated from Sa’eed bin Al-Musayyab and Salamah bin Abdur-Rahman that Abu Hurairah said: :\n“I heard the Messenger of Allah said: ‘I have been sent with concise speech,  and I have been supported with fear. While I was sleeping, the keys to the treasures of the Earth were brought to me and placed in my hands.’ Abu Hurairah said: The Messenger of Allah has gone and you are acquiring them.”</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1131000,
        "last_updated": "2014-01-31 16:11:01"
    },
    {
        "englishURN": 1031010,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "1.00",
        "babName": "The Obligation Of Jihad",
        "hadithNumber": 3092,
        "hadithText": "Narrated Sa'eed bin Al-Musayyab narrated that:\nAbu Hurairah told him that the Messenger of Allah said: “I have been commanded to fight the people until they say La ilaha illallah (there is none worthy of worship except Allah). Whoever says La ilaha illallah, his life and his property are safe from me, except by its right (in cases where Islamic laws apply), and his reckoning will be with Allah.”</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1131010,
        "last_updated": "2014-01-31 16:11:01"
    },
    {
        "englishURN": 1031020,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "1.00",
        "babName": "The Obligation Of Jihad",
        "hadithNumber": 3093,
        "hadithText": "Narrated It was narrated that Abu Hurairah said::\n“When the Messenger of Allah died and Abu Bakr was appointed as Khalifah, and some of the Arab’s disbelieved, Umar said: ‘O Abu Bakr! How can you fight the people when the Messenger of Allah said: I have been commanded to fight the people until they say La ilaha illallah (there is none worthy of worship except Allah). Whoever says La ilaha illallah, his life and his property are safe from me, except for its right, and his reckoning will be with Allah?’ Abu Bakr, may Allah be pleased with him, said: ‘By Allah, I will surely fight those who separate prayer and Zakah, for Zakah is what is due on wealth. By Allah, if they withhold from me a small she-goat that they used to give to the Messenger of Allah I will fight them for withholding it.’ (Umar said) ‘By Allah, when I realized that Allah, the Mighty and Sublime, had opened the chest of Abu Bakr to fighting, then I knew that it was the truth.’”</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1131020,
        "last_updated": "2014-01-31 16:11:01"
    },
    {
        "englishURN": 1031030,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "1.00",
        "babName": "The Obligation Of Jihad",
        "hadithNumber": 3094,
        "hadithText": "It was narrated from 'Ubaidullah bin 'Abdullah bin 'Utbah bin Mas'ud that Abu Hurairah said: \"When the Messenger of Allah (ﷺ) died and Abu Bakr (was appointed Khalifah) after him, and some of the 'Arabs disbelieved, 'Umar, may Allah be pleased with him, said: 'O Abu Bakr, how can you fight the people when the Messenger of Allah (ﷺ) said: I have been commanded to fight the people until they say La ilaha illallah (there is none worthy of worship except Allah.) Whoever says La ilaha illallah, his life and his property are safe from me, except for its right, and his reckoning will be with Allah?'\" Abu Bakr, may Allah be pleased with him, said: \"I will surely fight those who separate prayer and Zakah, for Zakah is what is due on wealth. By Allah, if they withhold from me a small she-goat that they used to give to the Messenger of Allah (ﷺ) I will fight them for withholding it.' ('Umar said) 'By Allah, when I realized that Allah, the Mighty and Sublime, had opened the chest of Abu Bakr to fighting, then I knew that it was the truth.'\" The wording is that of Ahmad.</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 1131030,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031040,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "1.00",
        "babName": "The Obligation Of Jihad",
        "hadithNumber": 3095,
        "hadithText": "It was narrated that Abu Hurairah said: \"When Abu Bakr mobilized to fight them, 'Umar said: 'O Abu Bakr, how can you fight the people when the Messenger of Allah (ﷺ) said: \"I have been commanded to fight the people until they say La ilaha illallah (there is none worthy or worship except Allah). Whoever says La ilaha illallah, his life and his property are safe from me, except for its right, and his reckoning will be with Allah?'\" Abu Bakr, may Allah be pleased with me him, said: 'By Allah, I will surely fight those who separate prayer and Zakah, for Zakah is what is due on wealth. By Allah, if they withhold from me a small she-goat that they used to give to the Messenger of Allah (ﷺ) I will fight them for withholding it.' ('Umar said) 'By Allah, when I realized that Allah, the Most High, had opened the chest of Abu Bakr to fighting them, then I knew that it was the truth.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 1131040,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031050,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "1.00",
        "babName": "The Obligation Of Jihad",
        "hadithNumber": 3096,
        "hadithText": "It was narrated that Anas bin Malik said: \"When the Messenger of Allah (ﷺ) died, some of the 'Arabs apostatized. 'Umar said: 'O Abu Bakr, how can you fight the 'Arabs? Abu Bakr said: 'The Messenger of Allah (ﷺ) said: I have been commanded to fight the people until they testify that La ilaha illallah (there is none worthy of worship except Allah) and that I am the Messenger of Allah, and establish prayer and pay Zakah?' By Allah, if they withhold from me a small she-goat that they used to give to the Messenger of Allah (ﷺ) I will fight them for withholding it.' ('Umar siad) 'By Allah, when I realized that (Abu) Bakr was confident about this idea, then I knew that this was teh truth.'\"\nAbu 'Abdur-Rahman (An-Nasa'i) said: 'Imran Al Qattan is not strong in Hadith, and this narration is a mistake. The one that is before it is the correct narration of Az-Zuhri, from 'Ubaidullah bin 'Abdullah bin 'Utbah, from Abu Hurairah.</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 1131050,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031060,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "1.00",
        "babName": "The Obligation Of Jihad",
        "hadithNumber": 3097,
        "hadithText": "Abu Hurairah narrated that the Messenger of Allah (ﷺ) said: \"I have been commanded to fight the people until they say La ilaha illallah (there is non worthy or worship except Allah). Whoever says it, his life and his property are safe from me, except for its right, and his reckoning will be with Allah.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 1131060,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031070,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "1.00",
        "babName": "The Obligation Of Jihad",
        "hadithNumber": 3098,
        "hadithText": "It was narrated from Anas that the Prophet (ﷺ) said: \"Strive against the idolators with your wealth, your hands and your tongues.\" [1]\n\n[1] Its chain has defects while its meaning is supported by other chains.</b>",
        "bookID": "25.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 1131070,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031080,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "2.00",
        "babName": "Stern Warning Against Forsaking Jihad",
        "hadithNumber": 3099,
        "hadithText": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said: \"Whoever dies without having fought or thought of fighting, he dies on one of the branches of hypocrisy.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 1131080,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031090,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "3.00",
        "babName": "Concession Allowing A Person Not To Join A Campaign",
        "hadithNumber": 3100,
        "hadithText": "Abu Hurairah said: \"I heard the Messenger of Allah (ﷺ) say: 'By the One in Whose hand is my soul, were it not for the fact that there are some believing men who would not feel happy to stay behind (when I go out on a campaign) and I do not have the means to provide them with mounts (so that they cn join me), I would not have stayed behind from any campaign or battle in the cause of Allah. By the One in Whose hand is my soul, I wish that I could be killed in the cause of Allah, then brought back to life, then be killed, then be brought back to life, then be killed then be brought back to life, then be killed.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 1131090,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031100,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "4.00",
        "babName": "The Superiority Of The Mujahidin Over Those Who Do Not Go Out To Fight",
        "hadithNumber": 3101,
        "hadithText": "It was narrated that Sahl bin Sa'd said: \"I saw Marwan bin Al-Hakam sitting and I came and sat with him. He told us that Zaid bin Thabit told him, that the following was revealed to Allah's Messenger (ﷺ): (Not equal are those of the believers who sit (at home) and those who strive hard and fight in the cause of Allah), then Ibn Umm Maktum came when he was dictating it to me (Zaid), and said: 'O Messenger of Allah! If I were able to go for Jihad I would go out for Jihad.' Then Allah, the Mighty and Sublime, revealed to him - while his thigh was against mine, and became so heavy that I thought my thigh would break, until (the revelation) stopped -: 'Except those who are disabled (by injury or are blind or lame).'\" [1]\nAbu 'Abdur-Rahman (An-Nasa'i) said: This 'Abdur-Rahman bin Ishaq is tolerable, while 'Abdur-Rahman bin IShaq, from whom reports 'Ali bin Mushir, abu Mu'awiyah, and 'Abdul-Wahid bin Ziyad from An-Nu'man bin Sa'd - he is not trustworthy.\n\n[1] An-Nisa' 4:95.</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 1131100,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031110,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "4.00",
        "babName": "The Superiority Of The Mujahidin Over Those Who Do Not Go Out To Fight",
        "hadithNumber": 3102,
        "hadithText": "It was narrated that Ibn Shihab said: \"Sahl bin Sa'd said: 'I saw Marwan sitting in the Masjid so I went and sat beside him, and he told us that Zaid bin Thabit had told him, that the Messenger of Allah (ﷺ) dictated to him the words: [Not equal are those of the believers who sit (at home) and those who strive hard and fight in the cause of Allah]. Then Ibn umm Maktum came to him while he was dictating it to me (Zaid) and said: 'O Messenger of Allah! If I were able to go for Jihad I would go out for Jihad.' But he was a blind man. Then Allah revealed to His Messenger (ﷺ) - while his thigh was agaisnt my thigh, and (it became so heavy that) I thought my thigh would break, then it was lifted from him, and Allah, the Mighty and Sublime, revealed: 'Except those who are disabled (by injury or are blind or lame).'\" [1]\n\n[1] An-Nisa' 4:95.</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 1131110,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031120,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "4.00",
        "babName": "The Superiority Of The Mujahidin Over Those Who Do Not Go Out To Fight",
        "hadithNumber": 3103,
        "hadithText": "It was narrated from Al-Bara' that the Prophet (ﷺ) said: \"bring me a shoulder blade of a camel, or a tablet, and write: Not equal are those of the believers who sit (at home).\" [1] 'Amr bin Umm Maktum was behind him and he said: \"Is there a concession for me?\" Then the following was revealed: \"Except those who are disabled (by injury or are blind or lame).\" [2]\n\n[1] An-Nisa' 4:95.\n[2] An-Nisa' 4:95.</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 1131120,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031130,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "4.00",
        "babName": "The Superiority Of The Mujahidin Over Those Who Do Not Go Out To Fight",
        "hadithNumber": 3104,
        "hadithText": "It was narrated that Al-Bara' said: \"When the following was revealed: 'Not equal are those of the believers who sit (at home),' [1] Ibn Umm Maktum, who was blind, came and said: 'O Messenger of Allah, what about me? I am blind.' He said: 'He did not leave before the following was revealed: Except those who are disabled (by injury or are blind or lame).'\" [2]\n\n[1] An-Nisa' 4:95.\n[2] An-Nisa' 4:95.</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 1131130,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031140,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "5.00",
        "babName": "Concession Allowing The One Who Has Two Parents To Stay Behind",
        "hadithNumber": 3105,
        "hadithText": "It was narrated that 'Abdullah bin 'Amr said: \"A man came to the Messenger of Allah (ﷺ) and asked him for permission to go for Jihad. He said: 'Are your parents alive?' He said: 'Yes.' He said: 'Then strive for their sake.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 1131140,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031150,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "6.00",
        "babName": "Concession Allowing One Who Has A Mother To Stay Behind",
        "hadithNumber": 3106,
        "hadithText": "It was narrated from Mu'awiyah bin Jahimah As-Sulami, that Jahimah came to the Prophet (ﷺ) and said: \"O Messenger of Allah! I want to go out and fight (in Jihad) and I have come to ask your advice.\" He said: \"Do you have a mother?\" He said: \"Yes.\" He said: \"Then stay with her, for Paradise is beneath her feet.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 1131150,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031160,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "7.00",
        "babName": "The Virtue Of The One Who Strives In The Cause Of Allah With Himself And His Wealth",
        "hadithNumber": 3107,
        "hadithText": "It was narrated from Abu Sa'eed Al-Khudri that a man came to the Messenger of Allah (ﷺ) and said: \"O Messenger of Allah! Which of the people is best?\" He said: \"One who strives with himself and his wealth in the cause of Allah.\" He said: \"Then who, O Messenger of Allah?\" He said: \"Then a believer (isolating himself) in one of the mountain passes, who fears Allah and spares the people his evil.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 1131160,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031170,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "8.00",
        "babName": "The Virtue Of The One Who Strives In The Cause Of Allah On His Feet",
        "hadithNumber": 3108,
        "hadithText": "It was narrated that Abu Sa'eed Al-Khudri said: \"in the year of Tabuk, the Messenger of Allah (ﷺ) addressed the people, while leaning against his mount. He said: 'Shall I not tell you of the best of the people and the worst of the people? Among the best of the people is a man who strives in the cause of Allah on the back of his horse, or on the back of his camel, or on his own two feet, until death comes to him. And among the worst of the people, is an immoral man (Fajir) who reads the Book of Allah but he does not refrain from doing anything bad because of it.'\"</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 1131170,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031180,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "8.00",
        "babName": "The Virtue Of The One Who Strives In The Cause Of Allah On His Feet",
        "hadithNumber": 3109,
        "hadithText": "It was narrated that Abu Hurairah said: \"No man who weeps for fear of Allah will be touched by the Fire until the milk goes back into the udders. And the dust (of Jihad) in the cause of Allah and the smoke of Hell, will never be combined in the nostrils of a Muslim.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 1131180,
        "last_updated": "2015-11-15 10:51:17"
    },
    {
        "englishURN": 1031190,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "8.00",
        "babName": "The Virtue Of The One Who Strives In The Cause Of Allah On His Feet",
        "hadithNumber": 3110,
        "hadithText": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said: \"No man will enter the Fire who weeps for fear of Allah, Most High, until the milk goes back into the udders. And the dust (of Jihad) in the cause of Allah, and the smoke of Hell will never be combined.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 1131190,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031200,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "8.00",
        "babName": "The Virtue Of The One Who Strives In The Cause Of Allah On His Feet",
        "hadithNumber": 3111,
        "hadithText": "It was narrated from Abu Hurairah that The Messenger of Allah (ﷺ) said: \"Two will never be gathered together in the Fire: A Muslim who killed a disbeliever then tried his best and did not deviate. And two will never be gathered together in the lungs of a believer: Dust in the cause of Allah, and the odor of Hell. And two will never be gathered in the heart of a salve: Faith and envy.\"</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 1131200,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031210,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "8.00",
        "babName": "The Virtue Of The One Who Strives In The Cause Of Allah On His Feet",
        "hadithNumber": 3112,
        "hadithText": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (ﷺ) said: 'The dust in the cause of Allah and the smoke of Hell will never be combined in the lungs of a slave, and the stinginess and faith can never be combined in a slave's heart.\"</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 1131210,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031220,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "8.00",
        "babName": "The Virtue Of The One Who Strives In The Cause Of Allah On His Feet",
        "hadithNumber": 3113,
        "hadithText": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said: \"The dust in the cause of Allah and the smoke of Hell will never be combined in a man's face, and stinginess and faith can never be combined in a slave's heart.\"</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 1131220,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031230,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "8.00",
        "babName": "The Virtue Of The One Who Strives In The Cause Of Allah On His Feet",
        "hadithNumber": 3114,
        "hadithText": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (ﷺ) said: 'The dust in the cause of Allah and the smoke of Hell will never be combined in a slave's lungs, and stinginess and faith can never be combined in a slave's heart.'\"</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 1131230,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031240,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "8.00",
        "babName": "The Virtue Of The One Who Strives In The Cause Of Allah On His Feet",
        "hadithNumber": 3115,
        "hadithText": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said: \"The dust in the cause of Allah, the Mighty and Sublime, and the smoke of Hell will never be combined in the nostrils of a Muslim.\"</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 1131240,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031250,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "8.00",
        "babName": "The Virtue Of The One Who Strives In The Cause Of Allah On His Feet",
        "hadithNumber": 3116,
        "hadithText": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (ﷺ) said: 'The dust in the cause of Allah and the smoke of Hell will never be combined in the nostrils of a Muslim, and stinginess and faith will never be combined in a Muslim man's heart.'\"</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 1131250,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031260,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "8.00",
        "babName": "The Virtue Of The One Who Strives In The Cause Of Allah On His Feet",
        "hadithNumber": 3117,
        "hadithText": "It was narrated from Abu Al-'Ala' bin Al-Lajlaj that he heard Abu Hurairah say: \"Allah will never combine the dust in the cause of Allah, the Mighty and Sublime, and the smoke of Hell, in the lungs of a Muslim man, and Allah will never combine faith in Allah, and stinginess in the heart of a Muslim man.\"</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 1131260,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031270,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "9.00",
        "babName": "The Reward Of The One Whose Feet Become Dusty In The Cause Of Allah",
        "hadithNumber": 3118,
        "hadithText": "Yazid bin Abi Mariam said: \"Abayah bin Rafi' met me when I was walking to Friday prayers, and he said: 'Rejoice, for these steps you are taking are in the cause of Allah. I heard Abu 'Abs say: The Messenger of Allah (ﷺ) said: Anyone whose feet become dusty in the cause of Allah, he will be forbidden to the Fire.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 1131270,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031280,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "10.00",
        "babName": "The Reward Of Eyes That Stay Awake At Night In The Cause Of Allah, The Mighty and Sublime",
        "hadithNumber": 3119,
        "hadithText": "Abu 'Ali At-Tujibi (said) that he heard Abu Raihanah say: \"I heard the Messenger of Allah (ﷺ) say: 'The eye that stays awake in the cause of Allah will be forbidden to the Fire.'\"</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 1131280,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031290,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "11.00",
        "babName": "The Virtue Of Going Out Before Noon In The Cause Of Allah, The Mighty and Sublime",
        "hadithNumber": 3120,
        "hadithText": "It was narrated that Sahl bin Sa'd said: \"The Messenger of Allah (ﷺ) said: 'Going out before noon or after noon, in the cause of Allah, the Mighty and Sublime, is better than this world and everything in it.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 1131290,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031300,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "12.00",
        "babName": "The Virtue Of Going Out After Noon In The Cause Of Allah, The Mighty And Sublime",
        "hadithNumber": 3121,
        "hadithText": "It was narrated from Abu 'Abdur-Rahman Al-Hubuli that he heard Abu Ayyub Al-Ansari say: \"The Messenger of Allah (ﷺ) said: 'Going out before noon and after noon, in the cause of Allah, is better than everything on which the sun rises and sets.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 1131300,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031310,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "12.00",
        "babName": "The Virtue Of Going Out After Noon In The Cause Of Allah, The Mighty And Sublime",
        "hadithNumber": 3122,
        "hadithText": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said: \"There are three, all of whom have a promise of help from Allah: 'The Mujahid who strives in the cause of Allah, the Mighty and Sublime; the man who gets married, seeking to keep himself chaste; and the slave who has a contract of manumission and wants to buy his freedom.'\"</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 1131310,
        "last_updated": "2015-04-29 08:28:53"
    },
    {
        "englishURN": 1031320,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "13.00",
        "babName": "The Warriors Are The Guests Of Allah, Most High",
        "hadithNumber": 3123,
        "hadithText": "Abu Hurairah said: \"The Messenger of Allah (ﷺ) said: 'The guests of Allah, the Mighty and Sublime, are three: The warrior, the pilgrim performing Hajj, and the pilgrim performing 'Umrah.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 1131320,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031330,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "14.00",
        "babName": "What Allah, The Mighty And Sublime, Guarantees To One Who Strives In His Cause",
        "hadithNumber": 3124,
        "hadithText": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: \"Allah, the Mighty and Sublime, has guaranteed to the one who strives in His cause, only going out for Jihad in His cause, and believing in His Word, that He will admit him to Paradise, or bring him back to his home from which he emerged, with whatever he has earned of reward, or spoils of war.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 1131330,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031340,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "14.00",
        "babName": "What Allah, The Mighty And Sublime, Guarantees To One Who Strives In His Cause",
        "hadithNumber": 3125,
        "hadithText": "Abu Hurairah said: \"I heard the Messenger of Allah (ﷺ) say: 'Allah has guaranteed: 'For the one who goes out in the cause of Allah, and nothing makes him do that except faith in Me, and Jihad in My cause - that He will admit him to Paradise whether he is killed or he dies, or He will return him to his home from which he departed with whatever he has earned of reward or spoils of war.'\"</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 1131340,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031350,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "14.00",
        "babName": "What Allah, The Mighty And Sublime, Guarantees To One Who Strives In His Cause",
        "hadithNumber": 3126,
        "hadithText": "Abu Hurairah said: \"I heard the Messenger of Allah (ﷺ) say: 'The parable of Mujahid (who strives in the cause of Allah) - and Allah knows best who strives in teh cause of Allah - is that of one who fasts and prays Qiyam (continually). Allah has promised Mujahid (who strives in His cause), that He will either cause him to die and admit him to paradise, or, He will bring him back safely with whatever he had earned of reward or spoils of war.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 1131350,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031360,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "15.00",
        "babName": "The Reward Of The Raiding Party That Fails To Achieve Its Goal",
        "hadithNumber": 3127,
        "hadithText": "'Abdullah bin 'Amr said: \"I heard the Messenger of Allah (ﷺ) say: 'There is no raiding party that goes out in the cause of Allah and acquires some spoils of war, but they have been given two-thirds of their reward in this world instead of in the Hereafter, and there remains one-third (in the Hereafter). And if they do not acquire any spoils of war, then all of their reward (will come in the Hereafter).'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 1131360,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031370,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "15.00",
        "babName": "What Allah, The Mighty And Sublime, Guarantees To One Who Strives In His Cause",
        "hadithNumber": 3128,
        "hadithText": "It was narrated from Ibn 'Umar, from the Prophet (ﷺ), of what he related from his Lord, the Mighty and Sublime: \"And of My slaves who goes out as a Mujahid striving in the cause of Allah, seeking my pleasure, I guarantee that I will bring him back with whatever he had earned as reward or spoils of war, and if I take his (soul) I will forgive him and have mercy on him.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 1131370,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031380,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "16.00",
        "babName": "The Parable Of A Mujahid (Who Strives In The Cause Of Allah, The Mighty And Sublime)",
        "hadithNumber": 3129,
        "hadithText": "It was narrated that Abu Hurairah said: \"I heard the Messenger of Allah (ﷺ) say: 'The parable of a Mujahid who strives in the cause of Allah - and Allah knows best who in His cause - is that of one who fasts, prays Qiyam, focuses with proper humility, bows and prostrates.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 1131380,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031390,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "17.00",
        "babName": "What Is Equal To Jihad In The Cause Of Allah, The Mighty And Sublime?",
        "hadithNumber": 3130,
        "hadithText": "Abu Hurairah said: \"A man came to the Messenger of Allah (ﷺ) and said: 'Tell me of an action that is equal to Jihad.' He said: 'I cannot. When the Mujahid goes out, can you enter the Masjid and stand in prayer and never rest, and fast and never break your fast?' He said: 'Who can do that?'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 1131390,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031400,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "17.00",
        "babName": "What Is Equal To Jihad In The Cause Of Allah, The Mighty And Sublime?",
        "hadithNumber": 3131,
        "hadithText": "It was narrated from Abu Dharr that he asked the prophet of Allah (ﷺ) which deed was best. He said: \"Belief in Allah and Jihad in the cause of Allah, the Mighty and Sublime.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 1131400,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031410,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "17.00",
        "babName": "What Is Equal To Jihad In The Cause Of Allah, The Mighty And Sublime?",
        "hadithNumber": 3132,
        "hadithText": "It was narrated that Abu Hurairah said: \"A man asked the Messenger of Allah (ﷺ) which deed is best. He said: 'Faith in Allah.' He said: 'Then what?' He said: 'Jihad in the cause of Allah.' He said: 'Then what?' He said: 'Hajjun Mabrur.'\" [1]\n\n[1] Hajj, that is accepted, or free of sin.</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 1131410,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031420,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "18.00",
        "babName": "The Status Of A Mujahid (Who Strives In The Cause Of Allah, The Mighty And Sublime)",
        "hadithNumber": 3133,
        "hadithText": "It was narrated from Abu Sa'eed Al-Khudri that the Messenger of Allah (ﷺ) said: \"O Abu Sa'eed! Whoever is content with Allah as Lord, Islam as his religion and Muhammad as Prophet, then he is guaranteed Paradise.\" Abu Sa'eed found this amazing and said: \"Say it to me again, O Messenger of Allah.\" So he did that, then the Messenger of Allah (ﷺ) said: \"And there is something else by means of which a person may be raised one hundred degrees in Paradise, each of which is like that which is between the Heaven and the Earth.\" He said: \"What is it, O Messenger of Allah?\" He said: \"Jihad in the cause of Allah, Jihad in the cause of Allah.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 1131420,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031430,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "18.00",
        "babName": "The Status Of A Mujahid (Who Strives In The Cause Of Allah, The Mighty And Sublime)",
        "hadithNumber": 3134,
        "hadithText": "It was narrated that Abu Ad-Darda' said: \"The Messenger of Allah (ﷺ) said: 'Whoever established Salah, pays Zakah, and dies not associating anything with Allah, he has a right from Allah the Mighty and Sublime, that He will forgive him, whether he emigrated, or died in his birthplace.' We said: 'O Messenger of Allah! Shall we not tell the people about it so that they may rejoice?' He said: 'In Paradise there are one hundred levels, (the distance) between each two of which is like (the distance) between the Heaven and the Earth; Allah has prepared them fro the Mujahidin who strive in His cause. Were it not that it would be too difficult for the believers and I cannot find mounts for them - and they do not like to stay behind if I go out (on a campaign) - I would not have stayed behind from any expedition. I wish that I could be killed then brought back to life, then killed again.'\"</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 1131430,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031440,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "19.00",
        "babName": "What Reward Is There For The One Who Accepts Islam, Emigrates And Strives For Jihad?",
        "hadithNumber": 3135,
        "hadithText": "It was narrated from 'Amr bin Malik Al-Janbi that he heard Fadalah bin 'Ubaid say: \"I heard the Messenger of Allah (ﷺ) say: 'I am a Za'im - and the Za'im is the guarantor - for the one who believes in me and accepts Islam, and emigrates: A house on the outskirts of Paradise and a house in the middle of Paradise. And I am a guarantor, for the one who believes in me and accepts Islam, and strives in the cause of Allah: A house on the outskirts of Paradise and a house in the middle of Paradise and a house in the highest chambers of Paradise. Whoever does that and seeks goodness wherever it is, and avoids evil wherever it is, may die wherever he wants to die.'\"</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 1131440,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031450,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "19.00",
        "babName": "What Reward Is There For The One Who Accepts Islam, Emigrates And Strives For Jihad?",
        "hadithNumber": 3136,
        "hadithText": "It was narrated that Sabrah bin Abi Fakih said: \"I heard the Messenger of Allah (ﷺ) say: 'the Shaitan sits in the paths of the son of Adam. He sits waiting for him, in the path to Islam, and he says: Will you accept Islam, and leave your religion, and the religion of your forefathers? But he disobeys him and accepts Islam. Then he sits waiting for him, on the path to emigration, and he says: Will you emigrate and leave behind your land and sky? The one who emigrates is like a horse tethered to a peg. But he disobeys him and emigrates. Then he sits, waiting for him, on the path to Jihad, and he says: Will you fight in Jihad when it will cost you your life and your wealth? You will fight and be killed, and your wife will remarry, and your wealth will be divided. But he disobeys him and fights in Jihad.' The Messenger of Allah (ﷺ) said: 'Whoever does that, then he had a right from Allah, the Mighty and Sublime, that He will admit him to paradise. Whoever is killed, he has a right from Allah, the Mighty and Sublime, that He will admit him to Paradise. If he is drowned, he has a right from Allah that He will admit him to paradise, or whoever is thrown by his mount and his neck is broken, he had a right from Allah that he will admit him to Paradise.'\"</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 1131450,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031460,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "20.00",
        "babName": "The Virtue Of The One Who Spends On A Pair (Of Things) In The Cause Of Allah, The Mighty And Sublime",
        "hadithNumber": 3137,
        "hadithText": "Abu Hurairah used to narrate that the Messenger of Allah (ﷺ) said: \"Whoever spends on a pair (of things) in the cause of Allah, he will be called in Paradise: 'O slave of Allah, here is prosperity.' Whoever is one of those who pray, he will be called from the gate of Paradise. Whoever is one of those who participated in Jihad, he will be called from the gate of Paradise. Whoever is one of those who fast, he will be called from the gate of Ar-Rayyan.\" Abu Bakr As-Siddiq said: \"O Messenger of Allah! No distress, or need will befall the one who is called from those gates. Will there be anyone who will be called from all these gates? The Messenger of Allah (ﷺ) said: \"Yes, and I hope that you will be one of them.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 1131460,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031470,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "21.00",
        "babName": "Whoever Fights So That The Word Of Allah Will Be Supreme",
        "hadithNumber": 3138,
        "hadithText": "Abu Musa Al-Ash'ari said: \"A Bedouin came to the Messenger of Allah (ﷺ) and said: 'A man fights for fame, or he fights for the spoils of war, or he fights to show off. Who is the one who is fighting in the cause of Allah?' He said: 'The one who fights so that the word of Allah will be supreme is the one who is fighting in the cause of Allah, the Mighty and Sublime.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 1131470,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031480,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "22.00",
        "babName": "The One Who Fights So That It Will Be Said That So-And-So Was Brave",
        "hadithNumber": 3139,
        "hadithText": "It was narrated from Abu Hurairah, that one of the people of Ash-Sham said to him: \"O Shaikh, tell me of a Hadith that you heard from the Messenger of Allah (ﷺ).\" (He said: \"Yes; I heard the Messenger of Allah (ﷺ)) say: 'The first of people for whom judgment will be passed on the Day of Resurrection are three. A man who was martyred. He will be brought and Allah will remind him of His blessings and he will acknowledge them. He will say: What did you do with them? He will say: I fought for Your sake until I was martyred. He will say: You are lying. You fought so that it would be said that so-and-so is brave, and it was said. Then He will order that he be dragged on his face and thrown into the Fire. And (the second will be) a man who acquired knowledge and taught others,and read Qur'an. He will be brought, and Allah will remind him of His blessings, and he will acknowledge them. He will say: What did you do with them? He will say: I acquired knowledge and taught others, and read the Qur'an for Your sake. He will say: You are lying. You acquired knowledge so that it would be said that you were a scholar; and you read Qur'an so that it would be said that you were a reciter, and it was said. Then He will order that he be dragged on his face and thrown into the Fire. And (the third will be) a man whom Allah made rich and gave him all kinds of wealth. He will be brought and Allah will remind him of His blessings, and he will acknowledge them. he will say: What did you do with them? He will say: I did not leave any way that You like wealth to be spent - Abu 'Abdur-Rahman (An-Nasa'i) said: I did not understand \"what You like\" as I wanted to [1] - \"but I spent it.\" He will say: \"You are lying. You spent it so that it would be said that he was generous, and it was said.\" Then he will order that he be dragged on his face and thrown into the Fire.'\"\n\n[1] That is, he did not hear or understand what came after it as well as he wanted to, but it was similar to what follows regarding the spending. Similar was stated by Shaikh 'Abdur-Rahman Al-punjani in his notes on the text, according to Al-Funjani in his commentary At-Ta'iqat As-Salafiyyah (2:51)</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 1131480,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031490,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "23.00",
        "babName": "The One Who Fights In The Cause Of Allah, Intending Only To Get An 'Iqbal [1]",
        "hadithNumber": 3140,
        "hadithText": "It was narrated from Yahya bin Al-Walid bin 'Ubadah bin As-Samit that his grandfather said: \"The Messenger of Allah (ﷺ) said: 'Whoever fights in the cause of Allah intending only to get an 'Iqal, he will have what he intended.\"</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 1131490,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031500,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "23.00",
        "babName": "The One Who Fights In The Cause Of Allah, Intending Only To Get An 'Iqbal",
        "hadithNumber": 3141,
        "hadithText": "It was narrated from 'Ubadah bin As-Samit that the Messenger of Allah (ﷺ) said: \"Whoever fights seeking only an 'Iqbal, then he will have what he intended.\"</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 1131500,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031510,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "24.00",
        "babName": "The One Who Fights Seeking Reward And Fame",
        "hadithNumber": 3142,
        "hadithText": "It was narrated that Abu 'Umamah Al-Bahili said: \"A man came to the Prophet (ﷺ) and said: 'What do you think of a man who fights seeking reward and fame - what will he have?' The Messenger of Allah (ﷺ) said: 'He will not have anything.' He repeated it three times, and the Prophet (ﷺ) said to him: 'He will not have anything.' Then he said: 'Allah does not accept any deed, except that which is purely for Him, and seeking His Face.'\"</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 1131510,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031520,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "25.00",
        "babName": "The Reward Of The One Who Fights In The Cause Of Allah For The Length Of Time Between Two Milkings Of A She-Camel",
        "hadithNumber": 3143,
        "hadithText": "Mu'adh bin Jabal said that he heard the Prophet (ﷺ) say: \"Whoever fights in the cause of Allah, the Mighty and Sublime, for the length of time between two milkings of a she-camel, Paradise is guaranteed for him. Whoever asks Allah to be killed (in Jihad) sincerely, from his heart, then he dies or is killed, he will have the reward of a martyr. Whoever is wounded or injured in the cause of Allah, it will come on the Day of Resurrection bleeding the most it ever bled, but its color will be like saffron, and its fragrance will be like musk. Whoever is wounded in the cause of Allah, upon him is the seal of the martyrs.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 1131520,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031530,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "26.00",
        "babName": "The Reward Of The One Who Shoots An Arrow In The Cause Of Allah, The Mighty And Sublime",
        "hadithNumber": 3144,
        "hadithText": "It was narrated from Shurahbil bin As-Simt that he said to 'Amr bin 'Abasah: \"O 'Amr! Tell us a Hadith that you heard from the Messenger of Allah (ﷺ).\" He said: \"I heard the Messenger of Allah (ﷺ) say: 'Whoever develops one gray hair in the cause of Allah, Most High, it will be light for him on the Day of Resurrection. Whoever shoots an arrow in the cause of Allah, Most High, whether it reaches the enemy or not, it will be as if he freed a slave. Whoever frees a believing slave, it will be a ransom for him from the Fire, limb by limb.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 1131530,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031540,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "26.00",
        "babName": "The Reward Of The One Who Shoots An Arrow In The Cause Of Allah, The Mighty And Sublime",
        "hadithNumber": 3145,
        "hadithText": "It was narrated that Abu Najih As-Sulami said: \"I heard the Messenger of Allah (ﷺ) say: 'Whoever shoots an arrow in the cause of Allah and it hits the target, it will raise him one level in Paradise.' That day I shot sixteen arrows that hit their targets.\" He said: \"And I heard the Messenger of Allah (ﷺ) say: 'Whoever shoots an arrow in the cause of Allah, it is equal to the reward of freeing a slave.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 1131540,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031550,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "26.00",
        "babName": "The Reward Of The One Who Shoots An Arrow In The Cause Of Allah, The Mighty And Sublime",
        "hadithNumber": 3146,
        "hadithText": "It was narrated that Shurahbil bin As-Simt said to Ka'b bin Murrah: \"O Ka'b! Tell us a Hadith from the Messenger of Allah (ﷺ) and be careful.\" He said: \"I heard him say: 'Whoever develops one gray hair in Islam, in the cause of Allah, it will be light for him on the Day of Resurrection.'\" He said to him: \"Tell us about the Prophet (ﷺ) and be careful.\" He said: \"I heard him say: 'Shoot, and whoever hits the enemy with an arrow, Allah will raise him one degree in status thereby.'\" Ibn An-Nahhan said: 'O Messenger of Allah, what is a degree?' He said: 'It is not like the doorstep of your mother; [1] rather (the distance) between two degrees is (that if) a hundred years.'\"\n\n[1] As explained after it; the degree of distance is greater than such a degree in this world.</b>",
        "bookID": "25.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 1131550,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031560,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "26.00",
        "babName": "The Reward Of The One Who Shoots An Arrow In The Cause Of Allah, The Mighty And Sublime",
        "hadithNumber": 3147,
        "hadithText": "It was narrated that Shurahbil bin As-Simt said: \"I said: 'O 'Amr bin 'Abasah! Tell us a Hadith that you heard from the Messenger of Allah (ﷺ) without forgetting or omitting anything.' He said: 'I heard the Messenger of Allah (ﷺ) say: Whoever shoots an arrow in the cause of Allah, and it reaches the enemy, whether it misses or hits, it will be as if he freed slave. Whoever frees a believing slave, that will be a ransom for him, limb by limb, from the Fire of Hell. Whoever develops a gray hair in the cause of Allah, it will be light for him on the Day of Resurrection.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 1131560,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031570,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "26.00",
        "babName": "The Reward Of The One Who Shoots An Arrow In The Cause Of Allah, The Mighty And Sublime",
        "hadithNumber": 3148,
        "hadithText": "It was narrated from 'Uqbah bin 'Amir that the Prophet (ﷺ) said: \"Allah, the Mighty and Sublime, will admit three people into Paradise for one arrow: The one who makes it, intending it to be used for a good cause, the one who shoots it, and one who passes it to him.\"</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 1131570,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031580,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "27.00",
        "babName": "The One Who Is Wounded In The Cause Of Allah, The Mighty And Sublime",
        "hadithNumber": 3149,
        "hadithText": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said: \"No one is wounded in the cause of Allah - and Allah knows best who is wounded in His cause - but he will come on the Day of Resurrection with his wounds bleeding the color of blood, but with the fragrance of musk.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 1131580,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031590,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "27.00",
        "babName": "The One Who Is Wounded In The Cause Of Allah, The Mighty And Sublime",
        "hadithNumber": 3150,
        "hadithText": "It was narrated that 'Abdullah bin Tha'labah said: \"The Messenger of Allah (ﷺ) said: 'Wrap them up with their blood, for there is no wound incurred in the cause of Allah, but he will come on the Day of Resurrection bleeding with the color of blood, but its fragrance will be that of musk.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 1131590,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031600,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "28.00",
        "babName": "What Is To Be Said By The One Who Is Stabbed By The Enemy",
        "hadithNumber": 3151,
        "hadithText": "It was narrated that Jabir bin 'Abdullah said: \"On the day of Uhud, the people ran away, and the Messenger of Allah (ﷺ) was in one position among twelve men of the Ansar, one of whom was Talhah bin 'Ubaidullah. He said: 'Who will face the people?' Talhah said: 'I will.' The Messenger of Allah (ﷺ) said: 'Stay where you are.' One of the Ansar said: 'I will, O Messenger of Allah (ﷺ).' He said: 'You (go ahead).' So he fought until he was killed. Then he turned and saw the idolators. He said: 'Who will face the people?' Talhah said: 'I will'. The Messenger of Allah (ﷺ) said: 'Stay where you are.' One of the Ansar said: 'I will, O Messenger of Allah (ﷺ).' He said: 'You (go ahead).' So he fought until he was killed. This carried on, and each man of the Ansar went out to face them and fought like the one before him, and was killed, until only the Messenger of Allah (ﷺ) and Talhah bin 'Ubaidullah were left. The Messenger of Allah (ﷺ) said: 'Who will face the people?' Talhah said: 'I will.' So Talhah fought like the eleven before him, until his hand was struck, and his fingers were cut off, and he exclaimed in pain. The Messenger of Allah (ﷺ) said: 'If you had said Bismillah (in the Name of Allah), the angels would have lifted you up with the people looking on.' Then Allah drove back the idolators.\"</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 1131600,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031610,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "29.00",
        "babName": "The One Who Fights In The Cause Of Allah And His Sword Recoils Upon Him And Kills Him",
        "hadithNumber": 3152,
        "hadithText": "Salamah bin Al-Akwa' said: \"On the day of Khaibar, my brother fought fiercely alongside the Messenger of Allah (ﷺ), then his sword recoiled upon him and killed him. The Companions of the Messenger of Allah (ﷺ), complaining about that, said: 'A man has died by his own weapon.'\" Salamah said: \"The Messenger of Allah (ﷺ) returned from Khaibar and I said: 'O Messenger of Allah, do you permit me to recite some lines of Rajaz verse to you?' The Messenger of Allah (ﷺ) gave him permission but 'Umar bin Al-Khattab, may Allah be pleased with him, said: \"Think what you are saying.\" \"I said:\n'By Allah, if Allah had not guided us we would not have been guided \nWe would not have given in charity nor prayed' \nThe Messenger of Allah (ﷺ) said: 'You have spoken the truth.' (I continued:)\n 'Send down tranquility upon us, And make us steadfast when we meet the enemy.\n For the idolators have transgressed against us.'\n When I completed my Rajaz verse, the Messenger of Allah (ﷺ) said: 'Who said that?' I said: 'My brother.' The Messenger of Allah (ﷺ) said: 'May Allah have mercy on him.' I said: 'O Messenger of Allah, some people are afraid to offer the (funeral) prayer for him, and they are saying that he is a man who died by his own weapon.' The Messenger of Allah (ﷺ) said: 'He died striving as a Mujahid.'\" Ibn Shihab said: \"Then I asked a son of Salamah bin Al-Akwa', and he narrated a similar report to me from his father, except that he said: 'When I said: Some people are afraid to offer the (funeral) prayer for him, the Messenger of Allah (ﷺ) said: They lied. He died striving as Mujahid, and he will have a twofold reward, and he gestured with two of his fingers.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 1131610,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031620,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "30.00",
        "babName": "Wishing To Be Killed In The Cause Of Allah",
        "hadithNumber": 3153,
        "hadithText": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said: \"Were it not that it would be too difficult for my Ummah, I would not have stayed behind from any expedition. But they could not find mounts, and I could not find any mounts for them, and it would be too hard for them to stay behind when I went out. And I wish that I could be killed in the cause of Allah, then brought back to life, then killed, then brought back to life, then killed,\" three times.</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 1131620,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031630,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "30.00",
        "babName": "Wishing To Be Killed In The Cause Of Allah",
        "hadithNumber": 3154,
        "hadithText": "It was narrated that Abu Hurairah said: \"I heard the Messenger of Allah (ﷺ) say: 'By the One in Whose hand is my soul, were it not that some men among the believers would not like to stay behind when I went out (to fight), and I could not find any mounts for them, I would not have stayed behind from any campaign that fought in the cause of Allah. By the One in Whose hand is my soul, I wish that I could be killed in the cause of Allah, then brought back to life, then killed, then be brought back to life, then killed.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 1131630,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031640,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "30.00",
        "babName": "Wishing To Be Killed In The Cause Of Allah",
        "hadithNumber": 3155,
        "hadithText": "It was narrated from Ibn Abi 'Amirah that the Messenger of Allah (ﷺ) said: \"There is no Muslim soul among the people that is taken by its Lord and wishes it could come back to you, even if it had this world and everything in it, except the martyr.\" Ibn Abi 'Amirah said: \"The Messenger of Allah (ﷺ) said: 'If I were to be killed in the cause of Allah, that would be dearer to me that if all the people of the deserts and the cities were to be mine.'\"[1]\n\n[1] Meaning: If they were all my slaves and I set them free.</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 1131640,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031650,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "31.00",
        "babName": "The Reward Of The One Who Was Killed In The Cause Of Allah",
        "hadithNumber": 3156,
        "hadithText": "It was narrated that 'Amr said: \"I heard Jabir say: 'A man said on the day of Uhud: If I am killed in the cause of Allah, where do you think I will be? He said: In Paradise. He threw down some dates that were in his hand and fought until he was killed.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 1131650,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031660,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "32.00",
        "babName": "The One Who Fights In The Cause Of Allah But Owes A Debt",
        "hadithNumber": 3157,
        "hadithText": "It was narrated that Abu Hurairah said: \"A man came to the Prophet (ﷺ) while he was delivering a Khutbah from the Minbar, and he said: 'If I fight in the cause of Allah with patience and seeking reward, facing the enemy and not running away, do you think that Allah will forgive my sins?' He said: 'Yes.' Then he fell silent for a while. Then he said: 'Where is the one who was asking just now?' The man said: 'Here I am.' He said: 'What did you say?' He said: 'What did you say?' He said: 'I said: I said: If I fight in the cause of Allah with patience and seeking reward,facing the enemy and not running away, do you think that Allah will forgive my sins?' He said: 'Yes, except for debt. Jibril told me that just now.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 1131660,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031670,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "32.00",
        "babName": "The One Who Fights In The Cause Of Allah But Owes A Debt",
        "hadithNumber": 3158,
        "hadithText": "It was narrated from 'Abdullah bin Abi Qatadah that his father said: \"A man came to the Messenger of Allah (ﷺ) and said: 'O Messenger of Allah, if I am killed in the cause of Allah with patience and seeking reward, facing the enemy and not running away, do you think that Allah will forgive my sins?' The Messenger of Allah (ﷺ) said: 'Yes.' When the man turned away, the Messenger of Allah (ﷺ) called him back and said: 'What did you say?' He repeated his question, and the Messenger of Allah (ﷺ) said: 'Yes, except debt. Jibril told me.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 1131670,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031680,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "32.00",
        "babName": "The One Who Fights In The Cause Of Allah But Owes A Debt",
        "hadithNumber": 3159,
        "hadithText": "It was narrated from 'Abdullah bin Qatadah that he heard Abu Qatadah narrate from the Messenger of Allah (ﷺ), that he stood up among them and said that Jihad in the cause of Allah and belief in Allah are the best of deeds. Then a man stood up and said: \"O Messenger of Allah, if I am killed in the cause of Allah, will Allah forgive my sins?\" The Messenger of Allah (ﷺ) said: \"Yes, if you are killed in the cause of Allah, and you are patient and seek reward, and you are facing the enemy, not running way - except for debt. Jibril (peace be upon him) told me that.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 1131680,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031690,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "32.00",
        "babName": "The One Who Fights In The Cause Of Allah But Owes A Debt",
        "hadithNumber": 3160,
        "hadithText": "It was narrated from 'Abdullah bin Abi Qatadah that his father said: \"A man came to the Prophet (ﷺ) when he was on the Minbar and said: 'O Messenger of Allah, do you think that if I wield this sword of mine in the cause of Allah, with patience and seeking reward, facing the enemy, and not running away, will Allah forgive my sins?' He said: 'Yes.' When he turned away, he called him back and said: 'Jibril says: unless you are in debt.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 1131690,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031700,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "33.00",
        "babName": "Hoping To Die In The Cause Of Allah",
        "hadithNumber": 3161,
        "hadithText": "It was narrated from Kathir bin Murrah that the Messenger of Allah (ﷺ) said: \"There is no soul on Earth that dies, and is in a good position before Allah, that would like to come back to you, even if it had all this world, except the one who is killed (in the cause of Allah); he wishes that he could come back and be killed again.\"</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 1131700,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031710,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "34.00",
        "babName": "What The People Of Paradise Wish For",
        "hadithNumber": 3162,
        "hadithText": "It was narrated that Anas said: \"The Messenger of Allah (ﷺ) said: 'A man from among the people of Paradise will be brought and Allah, the Mighty and Sublime, will say: \"O son of Adam, how do you find your place (in Paradise)?\" He would say: \"O Lord, it is the best place.\" He will say: \"Ask and wish (for whatever you want).\" He would say: \"I ask You to send me back to the world so that I may be killed in Your cause ten time\" - because of what be sees of the virtue of martyrdom.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 1131710,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031720,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "35.00",
        "babName": "What The Martyr Feels Of Pain",
        "hadithNumber": 3163,
        "hadithText": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: \"The martyr does not feel the pain of being killed, except as any one of you feels a pinch.\"</b>",
        "bookID": "25.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 1131720,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031730,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "36.00",
        "babName": "Asking For Martyrdom",
        "hadithNumber": 3164,
        "hadithText": "Sahl bin Abi Umamah bin Sahl bin Hunaif narrated from his father, from his grandfather, that the Messenger of Allah (ﷺ) said: \"Whoever asks Allah, the mighty and Sublime, sincerely for martyrdom, Allah will cause him to reach the status of the martyrs even of he dies in his bed.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 1131730,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031740,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "36.00",
        "babName": "Asking For Martyrdom",
        "hadithNumber": 3165,
        "hadithText": "It was narrated from 'Uqbah bin 'Amir that the Messenger of Allah (ﷺ) said: \"There are five things, whoever dies of any of them is a martyr. The one who is killed in the cause of Allah is a martyr; the one who dies of an abdominal complaint in the cause of Allah is a martyr; the one who dies of the plague in the cause of Allah is a martyr; and the woman who dies in childbirth in the cause of Allah is a martyr.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 1131740,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031750,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "36.00",
        "babName": "Asking For Martyrdom",
        "hadithNumber": 3166,
        "hadithText": "It was narrated from Al-'Irbad bin Sariyah that the Messenger of Allah (ﷺ) said: \"The martyrs and those who dies in their beds referred a dispute to our Lord concerning those who dies of the plague. The martyrs said: 'Our brothers were killed as we were killed.' And those who dies in their beds said: 'Our brothers dies on their beds as we died.' Our Lord said: 'Look at their wounds; if their wounds; if their wounds are like the wounds of those who were killed then they are of them and belong with them.' And their wounds were like their (the martyrs') wounds.\"</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 1131750,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031760,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "37.00",
        "babName": "Meeting In Paradise Of The one Who Killed And The One Who Was Killed In The Cause Of Allah",
        "hadithNumber": 3167,
        "hadithText": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said: \"Allah, the Mighty and Sublime, likes it when there are two men, one of whom killed the other, then they both enter Paradise.\" And another time he said: \"He laughs at two men, one of whom killed the other, then they both entered Paradise.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 1131760,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031770,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "38.00",
        "babName": "Explanation of That",
        "hadithNumber": 3168,
        "hadithText": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: \"Allah laughs at two men, one of whom killed the other but they both entered Paradise. The first one fought in the cause of Allah and was killed, then Allah accepted the repentance of the one who killed him, and he fought and was martyred.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 1131770,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031780,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "39.00",
        "babName": "The Virtue Of Ar-Ribat (Guarding The Frontier)",
        "hadithNumber": 3169,
        "hadithText": "It was narrated from Salman Al-Khair that the Messenger of Allah (ﷺ) said: \"Whoever guards Ribat (the frontier) for one day and one night, will be given a reward like that for fasting and praying Qiyam for a month, and whoever dies at Ribat (guarding the frontier) will be rewarded, and he will be given provision, and he will be kept safe from Al-Fattan.\" [1]\n\n[1] According to As-Sindi, the preferred pronunciation is Al-Fattan, plural of Fatan refering to Al-Munkar and An-Nakir, while Al-Fattan would refer to Ash-Shaitan or the like, among the punishment of the grave, or, the angels of chastisement.</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 1131780,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031790,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "39.00",
        "babName": "The Virtue Of Ar-Ribat (Guarding The Frontier)",
        "hadithNumber": 3170,
        "hadithText": "It was narrated that Salman said: \"I heard the Messenger of Allah (ﷺ) say: 'Whoever guards Ribat (the frontier) in the cause of Allah for one day and one night, he will have (a reward) like that of fasting and praying Qiyam for a month. If he dies he will continue to receive reward for what he did, and he will be kept safe from Al-Fattan, and he will be given provision.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 1131790,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031800,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "39.00",
        "babName": "The Virtue Of Ar-Ribat (Guarding The Frontier)",
        "hadithNumber": 3171,
        "hadithText": "It was narrated from Zurah bin Ma'bad: \"Abu Salih, the freed slave of 'Uthman, said: 'I heard 'Uthman bin 'Affan say: I heard the Messenger of Allah (ﷺ) say: Ribat (guarding the frontier) for one day in the cause of Allah is better in rank than a thousand days spent within the residence.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 1131800,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031810,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "39.00",
        "babName": "The Virtue Of Ar-Ribat (Guarding The Frontier)",
        "hadithNumber": 3172,
        "hadithText": "It was narrated that Abu Salih, the freed slace of 'Uthman, said: \"uthman bin 'Affan said: 'I heard the Messenger of Allah (ﷺ) say: A day in the cause of Allah is better than a thousand days doing anything else.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 1131810,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031820,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "40.00",
        "babName": "The Virtue Of Jihad By Sea",
        "hadithNumber": 3173,
        "hadithText": "It was narrated that Anas bin Malik said: \"When the Messenger of Allah (ﷺ) went to Quba' he used to come to Umm Haram bint Milhan and she would feed him. Umm Haram was married to 'Ubadah bint As-Samit. The Messenger of Allah (ﷺ entered upon her and she fed him and checked his head for lice. The Messenger of Allah (ﷺ) fell asleep, then he woke up smiling. She said: 'What is making you smile, O Messenger of Allah?' He said: 'Some people of my Ummah were shown to me, fighting in the cause of Allah and riding across the sea like kings on thrones.' I said: 'O Messenger of Allah, pray to Allah to make me one of them.' So the Messenger of Allah, pray to Allah to make me one of them.' So the Messenger of Allah (ﷺ) prayed for her then he slept again.'\" (One of narrators) Al-Harith, said (in his narration): \"He slept then he woke up smiling. I said to him: 'What is making you smile, O Messenger of Allah?' He said: 'Some people of my Ummah were shown to me, fighting in the cause of Allah and riding across the sea like kings on thrones,' as he had said the first time. I said: 'O Messenger of Allah, pray to Allah to make me one of them.' He said: 'You will be one of the first.' And she traveled by sea at the time of Mu'awiyah, then she fell from her mount when she came out of the sea and died.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 1131820,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031830,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "40.00",
        "babName": "The Virtue Of Jihad By Sea",
        "hadithNumber": 3174,
        "hadithText": "It was narrated from Anas bin Malik that Umm Haram bint Milhan said: \"The Messenger of Allah (ﷺ) came to us and took a nap in our house, then he woke up smiling. I said: 'O Messenger of Allah, may my father and mother be ransomed for you, what has made you smile?' He said: 'I saw some people of my Ummah riding on the sea like kings on thrones.' I said: 'Pray to Allah to make me one of them.' He said: 'You will be one of them.' Then he slept again, and woke up smiling. I asked him and he said the same thing. I said: 'Pray to Allah to make me one of them.' He said: 'You will be one of the first.' Then 'Ubadah bin As-Samit married her, and he traveled by sea, and she traveled with him, but when she came ashore a mule was brought to her and she mounted it, and it threw her off and broke her neck.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 1131830,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031840,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "41.00",
        "babName": "Invading India",
        "hadithNumber": 3175,
        "hadithText": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (ﷺ) promised us (a) battle expedition (in) India. If I live to see that, I will expend myself and my wealth in it. If I am killed, I will be one of the best of the martyrs, and if I come back, I will be Abu Hurairah Al-Muharrar.\" [1]\n\n[1] Al-Muharrar: The one freed (from the Fire).</b>",
        "bookID": "25.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 1131840,
        "last_updated": "2020-10-07 17:35:48"
    },
    {
        "englishURN": 1031850,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "41.00",
        "babName": "Invading India",
        "hadithNumber": 3176,
        "hadithText": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (ﷺ) promised that we would invade India. If I live to see that I will sacrifice myself and my wealth. If I am killed, I will be one of the best of the martyrs, and if I come back, I will be Abu Hurairah Al-Muharrar.\"</b>",
        "bookID": "25.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 1131850,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031860,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "41.00",
        "babName": "Invading India",
        "hadithNumber": 3177,
        "hadithText": "It was narrated that Thawban, the freed slave of the Messenger of Allah (ﷺ), said: \"The Messenger of Allah (ﷺ) said: 'There are two groups of my Ummah whom Allah will free from the Fire: The group that invades India, and the group that will be with 'Isa bin Maryam, peace be upon him.'\"</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 1131860,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031870,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "42.00",
        "babName": "Fighting The Turks And The Ethiopians",
        "hadithNumber": 3178,
        "hadithText": "It was narrated from Abu Sukainah, a man from among the Muharririn,[1] that a man among the Companions of the the Prophet (ﷺ) said: \"When the Prophet (ﷺ) commanded them to dig the trench (Al-Khandaq), there was a rock in their way preventing them from digging. The Messenger of Allah (ﷺ) stood, picked up a pickaxe, put his Rida' (upper garment) at the edge of the ditch and said: 'And the Word of your Lord has been fulfilled in truth and in justice. None can change His Words. And He is the All-Hearer, the All-Knower.' [1] One-third of the rock broke off while Salman Al-Farisi was standing there watching, and there was a flash of light when the Messenger of Allah (ﷺ)struck (the rock). Then he struck it again and said: 'And the Word of your Lord has been fulfilled in truth and in justice. Nonce can change His Words. Ans He is the All-Hearer, the All-Knower' And another third of the rock broke off and there was another flash of light, which Salman saw. Then he struck (the rock) a third time and said: 'And the Word of your Lord has been fulfilled in truth and in justice. None can change His Words. And He is the All-Hearer, the All-Knower.' The last third fell, and the Messenger of Allah (ﷺ) came out, picked up his Rida' and sat down. Salman said: 'O Messenger of Allah, Each time you struck the rock there was a flash of light.' The Messenger of Allah (ﷺ) said to him: 'O Salman, did you see that?' He said: 'Yes, by the One Who sent you with the truth, O Messenger of Allah.' He said: 'When I struck the first blow, the cities of Kisra and their environs were shown to me, and many other cities, and I saw them with my own eyes.' Those of his Companions who were present said: 'O Messenger of Allah, pray to Allah to grant us victory and to give us their land as spoils of war, and to destroy their lands at our hands.' So the Messenger of Allah (ﷺ) prayed for that. (Then he said:) 'Then I struck the second blow and the cities of Caesar and their environs were shown to me, and I saw them with my own eyes.' They said: 'O Messenger of Allah, pray to Allah to grant us victory and to give us their lands as spoils of war, and to destroy their lands at our hands.' So the Messenger of Allah (ﷺ) prayed for that. (Then he said:) 'Then I struck the third blow and the cities of Ethiopia were shown to me, and the villages around them, and I saw them with my own eyes.' But the Messenger of Allah (ﷺ) said at that point: 'Leave the Ethiopians alone so long as they leave you alone, and leave the Turks alone so long as they leave you alone.'\"\n\n[1] An-An'am 6:115.</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 1131870,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031880,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "42.00",
        "babName": "Fighting The Turks And The Ethiopians",
        "hadithNumber": 3179,
        "hadithText": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: \"The Hour will not begin until the Muslims fight the Turks, a people with faces like hammered shields who wear clothes made of hair and shoes made of hair.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 1131880,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031890,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "43.00",
        "babName": "Seeking The Support Of Allah By The Supplications Of The Weak",
        "hadithNumber": 3180,
        "hadithText": "It was narrated from Mus'ab bin Sa'd, from his father, that he thought he was better than other Companions of the Prophet (ﷺ). The Prophet of Allah (ﷺ) said: \"Rather, Allah support this Ummah because of their supplication, their Salah, and their sincerity.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 1131890,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031900,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "43.00",
        "babName": "Seeking The Support Of Allah By The Supplications Of The Weak",
        "hadithNumber": 3181,
        "hadithText": "It was narrated from Jubair bin Nufair Al-Hadrami that he heard Abu Ad-Darda' say: \"I heard the Messenger of Allah (ﷺ) say: 'Bring me the weak, for you only receive provision and Divine support by virtue of your weak ones.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 1131900,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031910,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "44.00",
        "babName": "The Virtue Of The One Who Equips A Warrior",
        "hadithNumber": 3182,
        "hadithText": "It was narrated from Zaid bin Khalid that the Messenger of Allah (ﷺ) said: \"Whoever equips a warrior in the cause of Allah has fought, and whoever looks after his family in his absence has fought.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 1131910,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031920,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "44.00",
        "babName": "The Virtue Of The One Who Equips A Warrior",
        "hadithNumber": 3183,
        "hadithText": "It was narrated that Zaid bin Khalid Al-Juhani said: \"The Messenger of Allah (ﷺ) said: 'Whoever equips a warrior has fought, and whoever looks after his family in his absence has fought.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 1131920,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031930,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "44.00",
        "babName": "The Virtue Of The One Who Equips A Warrior",
        "hadithNumber": 3184,
        "hadithText": "It was narrated that Al-Ahnaf bin Qais said: \"We set out as pilgrims and came to Al-Madinah intending to perform Hajj. While we were in our camping place unloading our mounts, someone came to us and said: 'The people have gathered in the Masjid and there is panis.' So we set out and found the people gathered around a group in the middle of the Masjid, among whom were 'Ali, Zubayr, Talhah and Sa'd bin Abi Waqas. While we were like that, 'Uthman, may Allah be pleased with him, came, wearing a yellow cloak with which he had covered his head. He said: 'Is Talhah here? Is Az-Zubair here? Is Sa'd here?' They said: 'Yes.' He said: 'I adjure you be the One beside Whom there is none worthy of worship, din't the Messenger of Allah (ﷺ) say: Whoever buys the Mirbad [1] of Banu so-and so, Allah will forgive him, and I bought it for twenty or twenty-five thousand, then I came to the Messenger of Allah (ﷺ) and told him, and he said: Add it to our Masjid and the reward for it will be yours?' They said: 'By Allah, yes.' He said: 'I adjure you by the One beside Whom there is none worthy of worship, didn't the Messenger of Allah (ﷺ) say: Whoever buys the well of Rumah, Allah will forgive him, so I bought it for such and such and amount, then I came to the Messenger of Allah (ﷺ) and told him, and he said: Give it to provide water for the Muslims, and the reward for it will be yours?' They said: 'By Allah, yes.' He said: 'I adjure you by the One beside Whom there is none worthy of worship, didn't the Messenger of Allah (ﷺ) say: Whoever equips these (men)- meaning the army of  Al-'Usrah (Tabuk) - Allah will forgive him, so I equipped them until they were not lacking even a rope or a bridle?' They said: 'By Allah, yes.' He said: 'O Allah, bear witness, O Allah, bear witness, O Allah, bear witness.'\"\n\n[1] Mirbad: A place for drying dates.</b>",
        "bookID": "25.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 1131930,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031940,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "45.00",
        "babName": "The Virtue Of Spending In The cause Of Allah",
        "hadithNumber": 3185,
        "hadithText": "It was narrated from Abu Hurairah that the prophet (ﷺ) said: \"Whoever spends on a pair (of things) in the cause of Allah will be called in Paradise: 'O slave of Allah, here is prosperity.' Whoever is one of the people of Salah, he will be called from the gate of Paradise, Whoever is one of the people of jihad, he will be called from the gate of paradise. Whoever is one of the people of charity, he will be called from the gate of Paradise. Whoever is one of the people who fast, he will be called from the gate of Ar-Rayyan.\" Abu Bakr, may Allah be pleased with him, said: \"O Messenger of Allah, no distress or need will befall the one who is called from those gates. Will there be anyone who will be called from all these gates?\" The Messenger of Allah (ﷺ) said: \"Yes, and I hope that you will be one of them.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 1131940,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031950,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "45.00",
        "babName": "The Virtue Of Spending In The cause Of Allah",
        "hadithNumber": 3186,
        "hadithText": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (ﷺ) said: 'Whoever spends on a pair (of things) in the cause of Allah, the gatekeepers of Paradise will call him from the gates of Paradise (saying): O So-and-so, come and enter!' Abu Bakr said: 'O Messenger of Allah, such a person will never perish or be miserable.' The Messenger of Allah (ﷺ) said: 'I hope that you will be one of them.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 1131950,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031960,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "45.00",
        "babName": "The Virtue Of Spending In The cause Of Allah",
        "hadithNumber": 3187,
        "hadithText": "It was narrated that Sa'sa'ah bin Mu'awiyah said: \"I met Abu Dharr and said: 'Tell me a Hadith.' He said. Yes, the Messenger of Allah (ﷺ) said: There is no Muslim worshiper who spends from each type of his wealth on a pair (of things) in the cause of Allah, but the keepers of Paradise will welcome him, all of them calling him to what they have (of reward).' I said: \"How is that?\" He said: \"If it is camels, he gives two, and if it is cows, he gives two.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 1131960,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031970,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "45.00",
        "babName": "The Virtue Of Spending In The cause Of Allah",
        "hadithNumber": 3188,
        "hadithText": "It was narrated that Khuraim bin Fatik said: \"The Messenger of Allah (ﷺ) said: 'Whoever spends in the cause of Allah, it will be recorded for him seven hundred fold.'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 1131970,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031980,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "46.00",
        "babName": "The Virtue Of Charity In The Cause Of Allah",
        "hadithNumber": 3189,
        "hadithText": "It was narrated from Abu Mas'ud that a man gave a bridled camel in charity in the cause of Allah. The Messenger of Allah (ﷺ) said: \"On the Day of Resurrection seven hundred bridled camels will come to you.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 1131980,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1031990,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "46.00",
        "babName": "The Virtue Of Charity In The Cause Of Allah",
        "hadithNumber": 3190,
        "hadithText": "It was narrated from Mu'adh bin Jabal that the Messenger of Allah (ﷺ) said: \"Campaigns are of two types. As for the one who seek the Face of Allah, obeys the imam, spends what is precious to him, is easy-going with his companion and avoids mischief, when he is asleep and when he is awake, it will all bring reward. But as for the one who fights to show off, and he disobeys the imam and does mischief in the land, he will not come back the same as when he left.\" [1]\n\n[1] It was not simply be the case that he comes back with no good deeds to his credit, rather he will have a number of evil deeds on his record.</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 1131990,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1032000,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "47.00",
        "babName": "The Sanctity Of The Wives Of The Mujahidin",
        "hadithNumber": 3191,
        "hadithText": "It was narrated from Sulaiman bin Buraidah that his father said: \"The Messenger of Allah (ﷺ) said: 'The sanctity of the wives of the Mujahidin to those who stay behind is like the sanctity of their mothers. There is no man who takes on the responsibility of looking after the wife of one of the Mujahidin and betrays him with her but he (the betrayer) will be made to stand before him on the Day of Resurrection and he will take whatever he wants of his (good) deeds. So what do you think?'\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 1132000,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1032010,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "48.00",
        "babName": "The One Who Betrays A Warrior With His Wife",
        "hadithNumber": 3192,
        "hadithText": "It was narrated from Sulaiman bin Buraidah, from his father, that the Messenger of Allah (ﷺ) said: \"The sanctity of the wive of the Mujahidin to those who stay behind is like the sanctity of their mothers. If he takes on the responsibility of looking after his wife then betrays him, it will be said to him on the Day of Resurrection: 'This one betrayed you with your wife, so take whatever you want of his good deeds.' So what do you think?\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 1132010,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1032020,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "48.00",
        "babName": "The One Who Betrays A Warrior With His Wife",
        "hadithNumber": 3193,
        "hadithText": "It was narrated from Ibn Buraidah, from his father, that the Messenger of Allah (ﷺ) said: \"The sanctity of the wives of the Mujahidin to those who stay behind is like the sanctity of their mothers. There is no man among those who stay behind who takes on the responsibility of looking after the wife of one of the Mujahidin (and betrays him) but he (the betrayer) will be made to stand before him on the Day Resurrection and it will be said: 'O So-and-so, this is so-and-so, take whatever you want from his good deeds.'\" Then the Prophet (ﷺ) turned to his Companions and said: \"What do you think: Will he leave him any of his good deeds?\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 1132020,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1032030,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "48.00",
        "babName": "The One Who Betrays A Warrior With His Wife",
        "hadithNumber": 3194,
        "hadithText": "It was narrated that Anas said: \"The Messenger of Allah (ﷺ) said: 'Strive in Jihad with your hands, your tongues and your wealth.'\" [1]\n\n[1] See 3098.</b>",
        "bookID": "25.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 1132030,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1032040,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "48.00",
        "babName": "The One Who Betrays A Warrior With His Wife",
        "hadithNumber": 3195,
        "hadithText": "It was narrated from 'Abdullah (may Allah be pleased with him) that the Messenger of Allah (ﷺ) commanded that snakes be killed and he said: \"Whoever fears their vengeance is not one of us.\"</b>",
        "bookID": "25.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 1132040,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1032050,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "48.00",
        "babName": "The One Who Betrays A Warrior With His Wife",
        "hadithNumber": 3196,
        "hadithText": "It was narrated from 'Abdullah bin 'Abdullah bin Jabr, from his father, that the Messenger of Allah (ﷺ) visited Jabr (when he was sick). When he entered he heard the women crying and saying: \"We thought that your death would come when fighting in the cause of Allah.\" He said: \"You think that martyrdom only comes when one is killed in the cause of Allah. In that case your martyrs would be few. Being killed in the  cause of Allah is martyrdom, dying of an abdominal complaint is martyrdom, being burned to death is martyrdom, drowning is martyrdom, being crushed beneath a falling wall is martyrdom, dying of pleurisy is martyrdom, and the woman who dies along with her fetus is a martyr.\" A man said: \"Are you weeping when the Messenger of Allah (ﷺ) is sitting here?\" He said: \"Let them be, but if he dies on one should weep for him.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 1132050,
        "last_updated": "2012-11-08 19:25:10"
    },
    {
        "englishURN": 1032060,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "The Book of Jihad",
        "babNumber": "48.00",
        "babName": "The One Who Betrays A Warrior With His Wife",
        "hadithNumber": 3197,
        "hadithText": "It was narrated from Jabr that he entered with the Messenger of Allah (ﷺ) upon someone who was dying, and the women were weeping. Jabr said: \"Are you weeping when the Messenger of Allah (ﷺ) is sitting here?\" He said: \"Let them weep so long as he is among them, but if he dies no one should weep for him.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 1132060,
        "last_updated": "2012-11-08 19:25:10"
    }
]