[
    {
        "englishURN": 1006300,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "1.00",
        "babName": "How The Adhan Began",
        "hadithNumber": 627,
        "hadithText": "Nafi' narrated that 'Abdullah bin 'Umar used to say: \"When the Muslims arrived in Al-Madinah they used to gather and try to figure out the time for prayer, and no one gave the call to prayer. One day they spoke about that; some of them said: 'Let us use a bell like the Christians do;' others said, 'No, a horn like the Jews have.' 'Umar, may ,Allah be pleased with him, said: 'Why don't you send a man to announce the time of prayer?' The Messenger of Allah (S.A.W) said: 'O Bilal, get up and give the call to prayer.'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1106300,
        "last_updated": "2021-08-25 04:37:07"
    },
    {
        "englishURN": 1006310,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "2.00",
        "babName": "Saying The Phrases of The Adhan Twice",
        "hadithNumber": 628,
        "hadithText": "It was narrated that Anas said: \"The Messenger of Allah (S.A.W) commanded Bilal to say the phrases of the Adhan twice and the phrases of the Iqamah once.\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1106310,
        "last_updated": "2021-08-26 03:22:08"
    },
    {
        "englishURN": 1006320,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "2.00",
        "babName": "Saying The Phrases of The Adhan Twice",
        "hadithNumber": 629,
        "hadithText": "It was narrated that Ibn 'Umar said: \"At the time of the Messenger of Allah (S.A.W) the phrases of the Adhan were said twice and the phrases of the Iqamah were said once, except that you should say: 'Qad Qamatis-Salah, Qad Qamatis-Salah (prayer is about to begin, prayer is about to begin).'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1106320,
        "last_updated": "2021-08-26 03:24:08"
    },
    {
        "englishURN": 1006330,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "3.00",
        "babName": "Lowering The Voice When Saying Some Phrases Of The Adhan The Second Time",
        "hadithNumber": 630,
        "hadithText": "It was narrated from Abu Mahdhurah that the Prophet (S.A.W) sat him down and taught him the Adhan letter by letter. (One of the narrators) Ibrahim said, \"It is like this Adhan of ours\". I said[1]: \"Recite it to me.\" He said, \"Allahu Akbar, Allahu Akbar (Allah is the greatest, Allah is the greatest), Ashhadu an la ilaha illallah (I bear witness that there is none worthy of worship except Allah) - twice. Ashhadu anna Muhammadan Rasulallah (I bear witness that Muhammad is the messenger of Allah) - twice. Then he said in a lower voice which those around him could here: Ashhadu an la ilaha ill-Allah (I bear witness that there is none worthy of worship except Allah) - twice. Ashhadu anna Muhammadan Rasulallah (I bear witness that Muhammad is the messenger of Allah) - twice, Hayya'ala as-salah (come to prayer) - twice, Hayya alal-falah (come to prosperity) - twice, Allahu Akbar Allahu Akbar la ilaha illallah (Allah is the Greatest, Allah is the Greatest, there is none worthy of worship except Allah).\n\n\n[1] Bishir bin Mu'adh who heard it from Ibrahim, and from whom An-Nasa'i is reporting it, is the one who is asking for the Adhan to be recited to him.</b>",
        "bookID": "7.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1106330,
        "last_updated": "2021-08-26 03:28:16"
    },
    {
        "englishURN": 1006340,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "4.00",
        "babName": "How Many Phrases Are There In The Adhan?",
        "hadithNumber": 631,
        "hadithText": "It was narrated from Abu Mahdhurah that the Messenger of Allah (S.A.W) taught him the Adhan with nineteen phrases and the Iqamah with seventeen phrases, then Abu Mahdhurah counted them as nineteen and seventeen.</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1106340,
        "last_updated": "2021-08-26 03:29:05"
    },
    {
        "englishURN": 1006350,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "5.00",
        "babName": "How Is The (Wording Of The) Adhan?",
        "hadithNumber": 632,
        "hadithText": "It was narrated that Abu Mahdhura said: \"The Messenger of Allah (S.A.W) taught me the Adhan and said: 'Allahu Akbar, Allahu akbar, Allahu Akbar, Allahu Akbar; Ashhadu an la ilaha illallah, Ashhadu an la ilaha illallah; Ashhadu anna Muhammadan Rasulallah, Ashhadu anna Muhammadan Rasulallah (Allah is the Greatest,Allah is the Greatest, Allah is the Greatest, Allah is the Greatest; I bear witness that there is none worthy of worship except Allah, I bear witness that there is none worthy of worship except Allah; I bear witness that Muhammad is the Messenger Allah,I bear witness that Muhammad is the Messenger Allah)'. Then he repeated it and said: 'Ashhadu an la ilaha illallah, Ashhadu an la ilaha illallah; Ashhadu anna Muhammadan Rasulallah, Ashhadu anna Muhammadan Rasulallah; Hayya 'alas-salah, Hayya 'ala-salah; Hayya 'alal-falah Hayya 'alal-falah; Allahu Akbar, Allahu Akbar; La ilaha ill-Allah (I bear witness that there is none worthy of worship except Allah, I bear witness that there is none worthy of worship except Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; Come to prayer, come to prayer; come to prosperity, come to prosperity; Allah is the Greatest, Allah is the Greatest; there is none worthy of worship except Allah).'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1106350,
        "last_updated": "2021-08-26 03:31:15"
    },
    {
        "englishURN": 1006360,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "5.00",
        "babName": "How Is The (Wording Of The) Adhan?",
        "hadithNumber": 633,
        "hadithText": "'Abdul-'Aziz bin 'Abdul-Malik bin Abu Mahdhurah narrated that 'Abdullah bin Muhairiz - who was an orphan under the care of Abu Mahdhurah until he prepared him to go to Ash-Sham - informed him: he said: \"I said to Abu Mahdhurah: 'I am going to Ash-Sham and I am afraid that I will be asked about how you say the Adhan. \"'He told me that Abu Mahdhurah said to him, I went out with a group of people and we were somewhere on the road to Hunain when the Messenger of Allah (S.A.W) was coming back from Hunain. The Messenger of Allah met us somewhere on the road and the Muadhdhin of the Messenger of Allah called the Adhan for prayer in the presence of the Messenger of Allah (S.A.W). We heard the voice of the Muadh'dhin and we were careless about it (the Adhan), so we started yelling, immitating and mocking it. The Messenger of Allah (S.A.W) heard us, so he sent some people who brought us to stand in front of him. He said, 'Who is the one whose voice I heard so loud?' The people all pointed to me, and they were telling the truth. He sent them all away, but kept me there and said to me: 'Stand up and call the Adhan for the Prayer.' I stood up and the Messenger of Allah (S.A.W) taught me the Adhan himself. He Said, 'Say:  'Allahu Akbar, Allahu akbar, Allahu Akbar, Allahu Akbar; Ashhadu an la ilaha illallah, Ashhadu an la ilaha illallah; Ashhadu anna Muhammadan Rasulallah, Ashhadu anna Muhammadan Rasulallah (Allah is the Greatest,Allah is the Greatest, Allah is the Greatest, Allah is the Greatest; I bear witness that there is none worthy of worship except Allah, I bear witness that there is none worthy of worship except Allah; I bear witness that Muhammad is the Messenger Allah,I bear witness that Muhammad is the Messenger Allah).' Then he said: 'Then repeat and say in a loud voice:Ashhadu an la ilaha illallah, Ashhadu an la ilaha illallah; Ashhadu anna Muhammadan Rasulallah, Ashhadu anna Muhammadan Rasulallah; Hayya 'alas-salah, Hayya 'ala-salah; Hayya 'alal-falah Hayya 'alal-falah; Allahu Akbar, Allahu Akbar; La ilaha ill-Allah (I bear witness that there is none worthy of worship except Allah, I bear witness that there is none worthy of worship except Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; Come to prayer, come to prayer; come to prosperity, come to prosperity; Allah is the Greatest, Allah is the Greatest; there is none worthy of worship except Allah).' Then he called me when I had finished saying the Adhan, and he\ngave me a bundle in which there was\nsome silver. I said: 'O Messenger of Allah (S.A.W), let me be the one doing the Adhan in Makkah.' He said: 'I command you to do so.' Then I came to 'Attab bin Asid who was the governor of the Messenger of Allah (S.A.W) in Makkah, and I called the\nAdhan for prayer with him upon the orders of the Messenger of Allah (S.A.W).\"</b>",
        "bookID": "7.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1106360,
        "last_updated": "2021-08-26 03:36:14"
    },
    {
        "englishURN": 1006370,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "6.00",
        "babName": "The Adhan When Travelling",
        "hadithNumber": 634,
        "hadithText": "It was narrated that Abu Mahdhurah said: \"When the Messenger of Allah (S.A.W) left Hunain, I was the tenth of a group of ten of the people of Makkah who were trying to catch up with them. We heard them calling the Adhan for the prayer and we started to repeat the Adhan, mocking them. The Messenger of Allah (S.A.W) said, 'I heard among these people the Adhan of one who has a beautiful voice.' He sent for us, and we recited the Adhan one by one, and I was the last of them. When I said the Adhan, he said: 'Come here.' He sat me down in front of him and rubbed my forelock and blessed me three times, then he said, 'Go and give the Adhan at the sacred House.' I said: 'How, O Messenger of Allah?' He taught me as you say the Adhan now: 'Allahu Akbar, Allahu akbar, Allahu Akbar, Allahu Akbar; Ashhadu an la ilaha illallah, Ashhadu an la ilaha illallah; Ashhadu anna Muhammadan Rasulallah, Ashhadu anna Muhammadan Rasulallah, Ashhadu an la ilaha illallah, Ashhadu an la ilaha illallah; Ashhadu anna Muhammadan Rasulallah, Ashhadu anna Muhammadan Rasulallah; Hayya 'alas-salah, Hayya 'ala-salah; Hayya 'alal-falah Hayya 'alal-falah; as-salatu khairun min an-nawm;as-salatu khairun min an-nawm; (Allah is the Greatest, Allah is the Greatest, Allah is the Greatest, Allah is the Greatest; I bear witness that there is none worthy of worship except Allah, I bear witness that there is none worthy of worship except Allah; I bear witness that Muhammad is the Messenger Allah, I bear witness that Muhammad is the Messenger Allah; I bear witness that there is none worthy of worship except Allah, I bear witness that there is none worthy of worship except Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; Come to prayer, come to prayer; come to prosperity, come to prosperity; prayer is better than sleep, prayer is better than sleep)' - in the first (Adhan) for As-Subh (Fajr). And he taught me the Iqamah saying each phrase twice: 'Allahu Akbar, Allahu Akbar, (Allahu Akbar, Allahu Akbar), Ashhadu an la ilaha illallah, Ashhadu an la ilaha illallah; Ashhadu anna Muhammadan Rasulallah, Ashhadu anna Muhammadan Rasulallah; Hayya 'alas-salah, Hayya 'alas-salah; Hayya 'alal-falah, Hayya 'alal-falah; qad qamatis-salah, qad qamati-salah, Allahu Akbar, Allahu Akbar La ilaha illallah (Allah is the Greatest, Allah is the Greatest, (Allah is the Greatest, Allah is the Greatest); I bear witness that there is none worthy of worship except Allah, I bear witness that there is none worthy of worship except Allah ; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; Come to prayer, come to prayer; come to prosperity, come to prosperity; the prayer is about to begin, the prayer is about to begin, Allah is the Greatest, Allah is the Greatest; there is none worthy of worship except Allah).\"\n(One of the narrators) Ibn Juraij said:\n''Uthman narrated this whole report\nto me from his father and from Umm\n'Abdul-Malik bin Abi Mahdhurah,\nand (said that) they heard that from\nAbu Mahdhurah.</b>",
        "bookID": "7.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 1106370,
        "last_updated": "2021-08-26 03:39:45"
    },
    {
        "englishURN": 1006380,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "7.00",
        "babName": "The Adhan Of Two Who Are Alone On A Journey",
        "hadithNumber": 635,
        "hadithText": "It was narrated that Malik bin Al-Huwairith said: \"I came to the Prophet (S.A.W) with a cousin of mine\" - on an another occasion he said: \"with a companion of mine\" - \"and he said: 'When the two of you travel, call the Adhan and the Iqamah, and let the older of you lead the prayer.'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 1106380,
        "last_updated": "2021-08-26 03:40:49"
    },
    {
        "englishURN": 1006390,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "8.00",
        "babName": "The Adhan Of Someone Else Is Sufficient While A Resident",
        "hadithNumber": 636,
        "hadithText": "It was narrated that Malik bin Al-Huwairith said: \"We came to the Messenger of Allah (S.A.W) and we were young men close in age. He let us stay with him for twenty days. The Messenger of Allah (S.A.W) was merciful and compassionate, and he thought that we were missing our families; he asked us about those whom we had left behind of our families, so we told him, and he said: 'Go back to your families, stay with them and teach them. Tell them when the time for prayer comes; let one of you call the Adhan and let the oldest of you lead the prayer.'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 1106390,
        "last_updated": "2021-08-26 03:42:12"
    },
    {
        "englishURN": 1006400,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "8.00",
        "babName": "The Adhan Of Someone Else Is Sufficient While A Resident",
        "hadithNumber": 637,
        "hadithText": "It was narrated from Ayyub, from Abu Qilabah, from 'Amr bin Salamah: \"Abu Qilabah said to me (Ayyub): He ('Amr) is still alive, do you want to meet him?\" I met him and asked him, and he said: \"When Makkah was conquered, all the people hastened to announce their Islam. My father went to announce the Islam of the poeple of our village, and when he came back we went to see him and he said: 'By Allah, I have indeed come to you from the Messenger of Allah (S.A.W)'. He said: 'Pray such and such a prayer at such and such a time, pray such and such a prayer at such and such a time. When the time for prayer comes let one of you call the Adhan and let the one who knows the most Qur'an lead the prayer.'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 1106400,
        "last_updated": "2021-08-26 03:43:35"
    },
    {
        "englishURN": 1006410,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "9.00",
        "babName": "Two Mu'adhdhins In One Masjid",
        "hadithNumber": 638,
        "hadithText": "It was narrated from Ibn 'Umar that the Messenger of Allah (S.A.W) said: \"Bilal calls the Adhan during the night, so eat and drink until Ibn Umm Maktum calls (the Adhan)\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 1106410,
        "last_updated": "2021-08-26 03:44:16"
    },
    {
        "englishURN": 1006420,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "9.00",
        "babName": "Two Mu'adhdhins In One Masjid",
        "hadithNumber": 639,
        "hadithText": "It was narrated from Salim, from his father, that the Prophet (S.A.W) said: \"Bilal calls the Adhan during the night, so eat and drink until you hear Ibn Umm Maktoom calling the Adhan.\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 1106420,
        "last_updated": "2021-08-26 03:44:48"
    },
    {
        "englishURN": 1006430,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "10.00",
        "babName": "Should They Call The Adhan Together or Separately?",
        "hadithNumber": 640,
        "hadithText": "It was narrated that 'Aishah said: \"The Messenger of Allah (S.A.W) said: 'Bilal calls the Adhan during the night, so eat and drink until Ibn Umm Maktum calls the Adhan.\" She said: \"And there was no more between than the time it takes for one to come down and the other to go up.\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 1106430,
        "last_updated": "2021-08-26 03:45:46"
    },
    {
        "englishURN": 1006440,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "10.00",
        "babName": "Should They Call The Adhan Together or Separately?",
        "hadithNumber": 641,
        "hadithText": "It was narrated from Khubaib bin 'Abdur-Rahman that his paternal aunt Unaisah said: \"The Messenger of Allah (S.A.W) said: 'When Ibn Umm Maktum calls the Adhan, eat and drink, and when Bilal calls the Adhan, do not eat nor drink.\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 1106440,
        "last_updated": "2021-08-26 03:47:25"
    },
    {
        "englishURN": 1006450,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "11.00",
        "babName": "The Adhan At Times Other Than The Time For Prayer",
        "hadithNumber": 642,
        "hadithText": "It was narrated from Ibn Mas'ud that the Prophet (S.A.W) said: \"Bilal calls the Adhan during the night to wake those who are sleeping and so that those who are praying Qiyam can return.[1] Not to say it is like this.\" The break of dawn is not like this. [2]\n\n[1] Meaning to finish. Ash-Shawkani said: \"To return to sleeping or return to sitting from praying\" Nail Al-Awtar.\n\n[2] Indicating with an up and down motion. The true dawn is from right to left.</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 1106450,
        "last_updated": "2021-08-26 03:48:34"
    },
    {
        "englishURN": 1006460,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "12.00",
        "babName": "The Time For The Adhan For As-Subh",
        "hadithNumber": 643,
        "hadithText": "It was narrated from Anas that someone asked the Messenger of Allah (S.A.W) about the time of Subh. The Messenger of Allah (S.A.W) commanded Bilal to call the Adhan when dawn broke. Then the next day he delayed Fajr until it was very light, then he told him to call the Adhan and he prayed. Then he said: \"This is the time for the prayer.\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 1106460,
        "last_updated": "2021-08-26 03:49:56"
    },
    {
        "englishURN": 1006470,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "13.00",
        "babName": "What Should The Mu'adhdhin Do While Calling The Adhan?",
        "hadithNumber": 644,
        "hadithText": "It was narrated from 'Awn bin Abi Juhaifah that his father said: \"I came to the Prophet (S.A.W) and Bilal came out and called the Adhan and he started doing like this in his Adhan, turning to his right and left.\"</b>",
        "bookID": "7.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 1106470,
        "last_updated": "2021-08-26 03:50:38"
    },
    {
        "englishURN": 1006480,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "14.00",
        "babName": "Raising The Voice With The Adhan",
        "hadithNumber": 645,
        "hadithText": "'Abdur-Rahman bin 'Abdullah bin 'Abdur-Rahman bin Abi Sa'sa'ah Al-Ansari Al-Mazini narrated that his father told him that Abu Sa'eed Al-Khudri said to him: \"I see that you love sheep and the desert. When you are with your sheep or in the desert and you call the Adhan for prayer, then raise your voice, for no human, Jinn or anything else hears the voice of the Mu'adhdhin as far as it reaches, but it will bear witness for him on the Day of Resurrection.\" Abu Sa'eed said: \"I heard it from the Messenger of Allah (S.A.W).\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 1106480,
        "last_updated": "2021-08-26 03:53:48"
    },
    {
        "englishURN": 1006490,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "14.00",
        "babName": "Raising The Voice With The Adhan",
        "hadithNumber": 646,
        "hadithText": "It was narrated from Abu Hurairah, who heard it from the mouth of the Messenger of Allah (S.A.W): \"The Mu'adhdhin will be forgiven as far as his voice reaches, and every wet and dry thing will bear witness for him.\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 1106490,
        "last_updated": "2021-08-26 03:56:03"
    },
    {
        "englishURN": 1006500,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "14.00",
        "babName": "Raising The Voice With The Adhan",
        "hadithNumber": 647,
        "hadithText": "It was narrated from Al-Bara bin 'Azib that the Prophet of Allah (S.A.W) said: \"Allah and His angels say salah upon the front rows, and the Mu'adhdhin will be forgiven as far as his voice reaches, and whatever hears him, wet or dry, will confirm what he says, and he will have a reward like that of those who pray with him.\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 1106500,
        "last_updated": "2021-08-27 05:08:19"
    },
    {
        "englishURN": 1006510,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "15.00",
        "babName": "Adding The Phrase \"Prayer is Better Than Sleep\" In The Adhan of Fajr",
        "hadithNumber": 648,
        "hadithText": "It was narrated that Abu Mahdhurah said: \"I used to call the Adhan for the Messenger of Allah (S.A.W) and in the first Adhan of Fajr I used to Say: 'Hayya 'ala al-falah, as-salatu khairun minan-nawm, as-salatu khairun minan-nawm, Allahu Akbar Allahu Akbar, la ilaha illallah (Come to prosperity, prayer is better than sleep, prayer is better than sleep, Allah is the Greatest, Allah is the Greatest, there is none worthy of worship except Allah).'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 1106510,
        "last_updated": "2021-08-26 03:59:53"
    },
    {
        "englishURN": 1006520,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "15.00",
        "babName": "Adding The Phrase \"Prayer is Better Than Sleep\" In The Adhan of Fajr",
        "hadithNumber": 649,
        "hadithText": "Sufyan narrated a similar report with the same chain. (One of the narrators) (Abu) 'Abdur-Rahman (An-Nasai) said: \"It is not Abu Ja'far Al-Farra'.\"</b>",
        "bookID": "7.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 1106520,
        "last_updated": "2021-08-26 04:01:11"
    },
    {
        "englishURN": 1006570,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "17.00",
        "babName": "The Adhan Telling People Not To Come To Prayer in Congregation On A Rainy Night",
        "hadithNumber": 654,
        "hadithText": "It was narrated that 'Amr bin Aws said: \"A man of Thaqif told us that he heard the caller of the Messenger of Allah (S.A.W) on a rainy night during a journey saying: 'Hayya 'ala as-salah, Hayya 'ala al'falah, sallu fi rihalikum (Come to prayer, come to prosperity, pray in your dwellings).'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 1106570,
        "last_updated": "2021-08-26 04:03:46"
    },
    {
        "englishURN": 1006530,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "16.00",
        "babName": "The Final Words Of The Adhan",
        "hadithNumber": 650,
        "hadithText": "It was narrated from Al-Aswad that Bilal said: \"The final words of the Adhan are: 'Allahu Akbar, Allahu Akbar; La ilaha illallah (Allah is the Greatest, Allah is the Greatest, there is none worthy of worship except Allah.)'\"</b>",
        "bookID": "7.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 1106530,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 1006540,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "16.00",
        "babName": "The Final Words Of The Adhan",
        "hadithNumber": 651,
        "hadithText": "It was narrated that Al-Aswad said: \"The final words of the Adhan of Bilal were: 'Allahu Akbar, Allahu Akbar, Allahu Akbar; La ilaha illallah (Allah is the Greatest, Allah is the Greatest, there is none worthy of worship except Allah.)'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 1106540,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 1006560,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "16.00",
        "babName": "The Final Words Of The Adhan",
        "hadithNumber": 653,
        "hadithText": "It was narrated that Muharib bin Dithar said: \"Al-Aswad bin Yazid narrated to me from Abu Mahdhurah that the final words of the Adhan are: 'La ilaha illahha (there is none worthy of worship except Allah).'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 1106560,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 1006553,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "16.00",
        "babName": "The Final Words Of The Adhan",
        "hadithNumber": 652,
        "hadithText": "(Another chain) from Ibrahim, from Al-Aswad, with similar narration.</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 1106550,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 1006580,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "17.00",
        "babName": "The Adhan Telling People Not To Come To Prayer in Congregation On A Rainy Night",
        "hadithNumber": 655,
        "hadithText": "It was narrated from Nafi' that Ibn 'Umar gave a call to prayer on a cold and windy night, and he said: \"Pray where you are, for the Prophet (S.A.W)used to order the Mu'adhdhin, if it was a cold and rainy night, to say: 'Pray in your dwellings.'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 1106580,
        "last_updated": "2021-08-26 04:04:44"
    },
    {
        "englishURN": 1006590,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "18.00",
        "babName": "Adhan For One Who Is Combining Two Prayers At The Time Of The Earlier Prayer",
        "hadithNumber": 656,
        "hadithText": "Ja'far bin Muhammad narrated from his father, that Jabir bin 'Abdullah said: \"The Messenger of Allah (S.A.W) traveled until he came to 'Arafah, where he found that the tent had been pitched for him in Namirah, so he stopped there. Then when the sun had passed its zenith he called for Qaswa'[1] and she was saddled for him. Then when he reached the bottom of the valley he addressed the people. Then Bilal called the Adhan, then he said the Iqamah and he prayed Zuhr, then he said the Iqamah and prayed 'Asr, and he did not offer any prayer in between them.\"\n\n[1] The name of the Prophet's (ﷺ) mount which was a she-camel.</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 1106590,
        "last_updated": "2021-08-26 04:06:28"
    },
    {
        "englishURN": 1006600,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "19.00",
        "babName": "The Adhan For One Who Is Combining Two Prayers After The Time Of The First Prayer Has Gone",
        "hadithNumber": 657,
        "hadithText": "It was narrated that Jabir bin 'Abdullah said: \"The Messenger of Allah (S.A.W) moved until he came to Al-Muzdalifah, where he prayed Maghrib and 'Isha' with one Adhan and two Iqamahs, and he did not offer any prayer in between them.\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 1106600,
        "last_updated": "2021-08-26 04:07:16"
    },
    {
        "englishURN": 1006610,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "19.00",
        "babName": "The Adhan For One Who Is Combining Two Prayers After The Time Of The First Prayer Has Gone",
        "hadithNumber": 658,
        "hadithText": "It was narrated that Sa'eed bin Jubair said concerning Ibn 'Umar: \"We were with him (Ibn 'Umar) in Jam' (Muzdalifah), and he called the Adhan, then the Iqamah, then he led us in praying Maghrib. Then he said: 'The prayer,' and he led us in praying 'Isha', two Rak'ahs. I said: 'What is this prayer?' He said: 'This is how I prayed with the Messenger of Allah (S.A.W) in this place.'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 1106610,
        "last_updated": "2021-08-26 04:08:28"
    },
    {
        "englishURN": 1006620,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "20.00",
        "babName": "The Iqamah For One Who Is Joining Two Prayers",
        "hadithNumber": 659,
        "hadithText": "It was narrated from Sa'eed bin Jubair that he prayed Maghrib and 'Isha' in Jam' (Muzdalifah) with one Iqamah, then he narrated that Ibn 'Umar had done that, and Ibn 'Umar narrated that the Prophet (S.A.W) had done that.</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 1106620,
        "last_updated": "2021-08-26 04:09:17"
    },
    {
        "englishURN": 1006630,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "20.00",
        "babName": "The Iqamah For One Who Is Joining Two Prayers",
        "hadithNumber": 660,
        "hadithText": "It was narrated from Ibn 'Umar that he prayed in Jam'a with the Messenger of Allah (S.A.W) with one Iqamah.</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 1106630,
        "last_updated": "2021-08-26 04:10:03"
    },
    {
        "englishURN": 1006640,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "20.00",
        "babName": "The Iqamah For One Who Is Joining Two Prayers",
        "hadithNumber": 661,
        "hadithText": "It was narrated from Salim, from his father, that the Prophet (S.A.W) joined them (Maghrib and 'Isha') in Al-Muzdalifah, and he prayed each of them with an Iqamah, and he did not offer any voluntary prayer before or after either of them.</b>",
        "bookID": "7.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 1106640,
        "last_updated": "2021-08-26 04:10:47"
    },
    {
        "englishURN": 1006650,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "21.00",
        "babName": "Adhan For A Missed Prayer",
        "hadithNumber": 662,
        "hadithText": "It was narrated from 'Abdur-Rahman bin Abi Sa'eed that his father said: \"On the day of Al-Khandaq the idolators kept us from praying Zuhr until the sun had gone down; that was before the revelation concerning fighting was revealed. Then Allah, the Mighty and Sublime, revealed: Allah sufficed for the believers in the fighting.[1] The Messenger of Allah (ﷺ) commanded Bilal to say the Iqamah for Zuhr prayer, and he offered it just as he used to offer it on time. Then he said the Iqamah for 'Asr and he offered it just as he used to offer it on time. Then he called the Adhan for Maghrib and offered it on time.\" \n\n[1] Al-Ahzab 33:25.</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 1106650,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 1006660,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "22.00",
        "babName": "The Acceptability For All Of That With One Adhan And An Iqamah For Each One Of Them",
        "hadithNumber": 663,
        "hadithText": "It was narrated that Abu 'Ubaidah said: \"Abdullah said: 'The idolaters kept the Prophet (S.A.W) from (offering) four prayers on the day of Al-Khandaq, so he commanded Bilal to call the Adhan, then he said the Iqamah and prayed Zuhr, then he said the Iqamah and prayed 'Asr, then he said the Iqamah and prayed the Maghrib, then he said the Iqamah and prayed 'Isha'.'\"</b>",
        "bookID": "7.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 1106660,
        "last_updated": "2021-08-26 04:12:52"
    },
    {
        "englishURN": 1006670,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "23.00",
        "babName": "Sufficing With The Iqamah For Every Prayer",
        "hadithNumber": 664,
        "hadithText": "'Abdullah bin Mas'ud said: \"We were fighting a battle and the idolators kept us from praying Zuhr, 'Asr, Maghrib and 'Isha'. When the idolaters went away, the Messenger of Allah (S.A.W) commanded a caller to say Iqamah for Zuhr prayer, and we prayed. Then he said the Iqamah for 'Asr, and we prayed, and he said the Iqamah for Maghrib and we prayed, and he said the Iqamah for 'Isha' and we prayed. Then we went around among us and said: 'There is no group on Earth who is remembering Allah, the Mighty and Sublime, except you.'\"</b>",
        "bookID": "7.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 1106670,
        "last_updated": "2021-08-26 04:15:10"
    },
    {
        "englishURN": 1006680,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "24.00",
        "babName": "The Iqamah For One Who Forgot A Rak'ah Of The Prayer",
        "hadithNumber": 665,
        "hadithText": "It was narrated that Mu'awiyah bin Hudaij that the Messenger of Allah (S.A.W) prayed one day and said the Taslim when there was still a Rak'ah left of the prayer. A man caught up with him and said: 'You forgot a Rak'ah of the prayer!' So he came back into the Masjid and told Bilal to call the Iqamah for prayer, then he led the people in praying one Rak'ah. I told the people about that and they said to me: 'Do you know who that man was?' I said: 'No, not unless I see him.'. Then he passed by me and I said: 'This is he.' They said: 'This is Talha bin 'Ubaidullah.'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 1106680,
        "last_updated": "2021-08-26 04:17:18"
    },
    {
        "englishURN": 1006700,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "25.00",
        "babName": "The Adhan Of A Shepherd",
        "hadithNumber": 666,
        "hadithText": "It was narrated from 'Abdullah bin Rubayyi'ah that he was with the Messenger of Allah (S.A.W) on a journey and he heard the voice of a man calling the Adhan, and he said what he said. Then he said: \"This is a shepherd or a man who is away from his family.\" So they looked and so it was a shepherd.</b>",
        "bookID": "7.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 1106690,
        "last_updated": "2021-08-26 04:19:22"
    },
    {
        "englishURN": 1006710,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "26.00",
        "babName": "The Adhan For One Who Is Praying Alone",
        "hadithNumber": 667,
        "hadithText": "It was narrated that 'Uqbah bin 'Amir said: \"I heard the Messenger of Allah (ﷺ) say: 'Your Lord is pleased with a shepherd high in the mountains who calls the Adhan for the prayer and prays. Allah says: 'Look at this slave of Mine; he calls the Adhan and Iqamah for the prayer and fears Me. I have forgiven My slave and admitted him to Paradise.'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 1106710,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 1006720,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "27.00",
        "babName": "The Iqamah For One Who Is Praying Alone",
        "hadithNumber": 668,
        "hadithText": "It was narrated from Rifa'ah bin Rafi' that while the Messenger of Allah (S.A.W) was sitting in the row for prayer. The Hadith. [1]\n\n[1]With this chain, At-Tirmidhi recorded it (No. 302) and An-Nasai in Al-Kubra (No. 1631). It is the narration about the man who prayed incorrectly, and in it, the Prophet instructed him: \"Then Tashhad, then say the Iqamah.\" And they say that the meaning of Tashhad here is call the Adhan. An-Nasai recorded the Hadith with different chains (1054, 1137, 1314,1315). Whereas the wording narrated by At- Tirmidhi, and the author in Al-Kubra, mentions what the author mentioned in the chapter, the other cited versions that An-Nasai in this hook quoted do not. So it is as if he narrated the chain here for Hadith, indicating the same version that At-Tirmidhi narrated, and he himself in Al-Kubra, but he did not want to narrate the actual text here. Abu Dawud also narrated it with the order for the Adhan and Iqamah, through a different route of transmission (No. 861). And it is among the proofs used for the view that the Adhan and Iqamah are obligatory - since it has been ordered in the Hadith of the one who prayed incorrectly.</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 1106720,
        "last_updated": "2021-08-26 04:24:18"
    },
    {
        "englishURN": 1006730,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "28.00",
        "babName": "How The Iqamah Is To Be Recited",
        "hadithNumber": 669,
        "hadithText": "It was narrated that Abu Al-Muthanna, the Mu'adhdhin of the Jami' Masjid, said: \"I asked Ibn 'Umar about the Adhan and he said: 'At the time of the Messenger of Allah (S.A.W), the phrases of the Adhan were recited twice and the phrases of Iqamah once, except that you should say (the phrase) Qad qamat is-salah (prayer is about to begin)twice. When we heard 'prayer is about to begin' we would perform Wudu' and go out to pray.'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 1106730,
        "last_updated": "2021-08-26 04:25:54"
    },
    {
        "englishURN": 1006740,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "29.00",
        "babName": "Each Person Saying The Iqamah For Himself",
        "hadithNumber": 670,
        "hadithText": "It was narrated that Malik bin Al-Huwayrith said: \"The Messenger of Allah (S.A.W) said to me and to a companion of mine: 'When the time for prayer comes, let the two of you call the Adhan then the two of you say Iqamah, then let one of you lead the prayer.'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 1106740,
        "last_updated": "2021-08-26 04:26:53"
    },
    {
        "englishURN": 1006750,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "30.00",
        "babName": "The Virtue Of Giving The Call To Prayer",
        "hadithNumber": 671,
        "hadithText": "It was narrated from Abu Hurairah that the Prophet (S.A.W) said: \"When the call for the prayer is given, the Shaitan takes to his heels, passing wind loudly so that he will not hear the call to prayer. When the call to prayer is finished, he comes back. And when the Iqamah is said, he again takes to his heels, and after it is completed, he returns again to interfere between the (praying) person and his heart, saying to him: 'Remember such and such, remember such and such,' - things that he had not remembered - until he does not know how many (Rak'ahs) he has prayed.\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 1106750,
        "last_updated": "2021-08-26 04:28:24"
    },
    {
        "englishURN": 1006760,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "31.00",
        "babName": "Drawing Lots To Decide Who Will Call The Adhan",
        "hadithNumber": 672,
        "hadithText": "It was narrated from Abu Hurairah that the Messenger of Allah (S.A.W) said: \"If the people knew what (virtue) there is in the call to prayer and the first row, and they had no other way but to draw lots concerning them, they would draw lots. If they knew what (virtue) there is in coming early for the prayer, they would compete in doing so. And if they knew what (virtue) there is in 'Atamah and Subh prayer, they would come even if they had to crawl.\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 1106760,
        "last_updated": "2021-08-26 04:30:19"
    },
    {
        "englishURN": 1006770,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "32.00",
        "babName": "Choosing A Mu'adhdhin Who Does Not Accept Any Payment For His Adhan",
        "hadithNumber": 673,
        "hadithText": "It was narrated that 'Uthman bin Abi Al-As said: \"I said: 'O Messenger of Allah (S.A.W), make me the Imam of my people.' He said: 'You are their Imam, so consider the weakest among them and choose a Mu'adhdhin who does not accept any payment for his Adhan.'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 1106770,
        "last_updated": "2021-08-26 04:31:27"
    },
    {
        "englishURN": 1006780,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "33.00",
        "babName": "Saying What The Mu'adhdhin Says",
        "hadithNumber": 674,
        "hadithText": "It was narrated from Abu Sa'eed Al-Khudri that the Messenger of Allah (S.A.W) said: \"When you hear the call, say what the Mu'adhdhin says.\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 1106780,
        "last_updated": "2021-08-26 04:32:59"
    },
    {
        "englishURN": 1006790,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "34.00",
        "babName": "The Reward For Doing That",
        "hadithNumber": 675,
        "hadithText": "An-Nasr bin Sufyan narrated that he heard Abu Hurairah say: \"We were with the Messenger of Allah (S.A.W) and Bilal stood up and gave the call. When he fell silent the Messenger of Allah (ﷺ) said: 'Whoever says the same as this (what the Mu'adhdhin) with certainty, he will enter Paradise.</b>",
        "bookID": "7.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 1106790,
        "last_updated": "2021-08-26 04:33:43"
    },
    {
        "englishURN": 1006800,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "35.00",
        "babName": "Repeating The Testimony Of The Mu'adhdhin",
        "hadithNumber": 676,
        "hadithText": "It was narrated that Mujammi' bin Yahya Al-Ansari said: \"I was sitting with Abu Umamah bin Sahl bin Hunaif when the Mu'adhdhin called the Adhan. He said: 'Allahu akbar; Allahu Akbar (Allah is the Greatest, Allah is the Greatest),' and he (also) pronounced the takbir twice. Then he said: 'Ashhadu an la ialaha ill-Allah (I bear witness that there is none worthy of worship except Allah),' and he also sent the testimony twice.  Then he said: 'Ashhadu anna Muhammadan Rasul-Allah (I bear witness that Muhammad is the Messenger of Allah),' and he (also) sent the testimony twice. Then he said: 'This is what Mu'awiyah bin Abi Sufyan told me, narrating from statement of the Messenger of Allah (S.A.W).'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 1106800,
        "last_updated": "2021-08-26 04:34:49"
    },
    {
        "englishURN": 1006810,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "35.00",
        "babName": "Repeating The Testimony Of The Mu'adhdhin",
        "hadithNumber": 677,
        "hadithText": "It was narrated that Abu Umamah bin Sahl said: \"I heard Mu'awiyah say: 'I heard the Messenger of Allah (S.A.W), when he heard the Mu'adhdhin, repeating what he said.'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 1106810,
        "last_updated": "2021-08-26 04:35:19"
    },
    {
        "englishURN": 1006820,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "36.00",
        "babName": "What Is To Be Said When The Mu'adhdhin Says Hayya 'Alas-Salah, Hayya 'Alal-Falah (Come to Prayer; Come to Prosperity)",
        "hadithNumber": 678,
        "hadithText": "It was narrated that 'Alqamah bin Waqqas said: \"I was with Mu'awiyah when the Mu'adhdhin called the Adhan. Muawiyah said what the Mu'adhdhin said, but when he said: 'Hayya 'alas-salah (come to prayer),' he said: 'La hawla wa la quwwata illa Billah (There is no power and no strength except with Allah);' and when he said: 'Hayya 'alal-falah (come to prosperity),' he said: 'La hawla wa la quwwata illa Billah (There is no power and no strength except with Allah).' After that he said what the Mu'adhdhin said, then he said: 'I heard the Messenger of Allah (S.A.W) saying exactly like that.'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 1106820,
        "last_updated": "2021-08-26 04:36:23"
    },
    {
        "englishURN": 1006830,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "37.00",
        "babName": "Saying Salah Upon The Prophet (PBUH) After The Adhan",
        "hadithNumber": 679,
        "hadithText": "'Abdullah bin 'Amr said: \"I heard the Messenger of Allah (S.A.W) say: 'When you hear the Mu'adhdhin then say what he says, and do Salah upon me, for whoever does Salah upon me once, Allah will Salah upon him ten (times). Then ask Allah to grant me Al-Wasilah, which is a position in paradise which only one of the slaves of Allah will attain, and I hope that I will be the one. Whoever asks for Al-Wasilah for me, will be entitled to my intercession.'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 1106830,
        "last_updated": "2021-08-26 04:37:26"
    },
    {
        "englishURN": 1006840,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "38.00",
        "babName": "The Supplication Following The Adhan",
        "hadithNumber": 680,
        "hadithText": "It was narrated from Sa'd bin Abi Waqqas that the Messenger of Allah (S.A.W) said: \"Whoever says, when he hears the Mu'adhdhin: 'Ashhadu an la ilaha illallah wahdahu la sharika lahu wa anna Muhammadan 'abduhu wa Rasuluhu, raditu Billahi Rabban, wa bil-Islami dinan was bi Muhammadin Rasula (I bear witness that there is none worthy of worship except Allah alone, with no partner or associate, and that Muhammad is the His slave and Messenger; I am content with Allah as my Lord, Islam as my religion and Muhammad as my Messenger),' his sins will be forgiven.\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 1106840,
        "last_updated": "2021-08-26 04:38:39"
    },
    {
        "englishURN": 1006850,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "38.00",
        "babName": "The Supplication Following The Adhan",
        "hadithNumber": 681,
        "hadithText": "It was narrated that Jabir said: \"The Messenger of Allah (S.A.W) said: 'Whoever says, when he hears the call to prayer: \"Allahumma rabba hadhihid-da'wat it-tammah was-salat il-qaimah, ati Muahmmadan al-wasilah wal-fadilah, wab'athu maqaman mahmudan alladhi wa'adtahu (O Allah, Lord of this perfect call and the prayer to be offered, grant Muhammad the privilege (of interceding) and also the eminence, and resurrect him to the praised position that you have promised),' will be granted my intercession on the Day of Resurrection.\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 1106850,
        "last_updated": "2021-08-26 04:39:37"
    },
    {
        "englishURN": 1006860,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "39.00",
        "babName": "Prayer Between The Adhan And The Iqamah",
        "hadithNumber": 682,
        "hadithText": "It was narrated that 'Abdullah bin Mughaffal said: \"The Messenger of Allah (S.A.W) said: 'Between each two Adhans [1] there is a prayer, between each two Adhans there is a prayer, between each two Adhans there is a prayer, for whoever wants to do it.\"\n\n[1]Meaning, between the Adhan and Iqamah.</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 1106860,
        "last_updated": "2021-08-26 04:40:33"
    },
    {
        "englishURN": 1006870,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "39.00",
        "babName": "Prayer Between The Adhan And The Iqamah",
        "hadithNumber": 683,
        "hadithText": "It was narrated that Anas bin Malik said: \"When the Mu'adhdhin called the Adhan, some of the Companions of the Prophet (S.A.W) would get up and rush to the pillars (in the Masjid) and pray until the Prophet (S.A.W) came out and they were like that. They would pray before Maghrib and there was nothing between the Adhan and Iqamah.\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 1106870,
        "last_updated": "2021-08-26 04:41:36"
    },
    {
        "englishURN": 1006880,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "40.00",
        "babName": "The Stern Warning Against Leaving The Masjid After The Adhan",
        "hadithNumber": 684,
        "hadithText": "It was narrated from Ash'ath bin Abi Ash-Sha'tha' that his father said: \"I saw Abu Hurairah, when a man passed by in the Masjid until he parted from it - after the call. Abu Hurairah said: 'This man has indeed disobeyed Abu Al-Qasim (S.A.W).'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 1106880,
        "last_updated": "2021-08-26 04:42:21"
    },
    {
        "englishURN": 1006890,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "40.00",
        "babName": "The Stern Warning Against Leaving The Masjid After The Adhan",
        "hadithNumber": 685,
        "hadithText": "Abu Sakhrah narrated that Abu Ash-Sha'tha' said: \"A man left the Masjid after the call to prayer had been given, and Abu Hurairah said: 'This man has indeed disobeyed Abu Al-Qasim (S.A.W).'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 1106890,
        "last_updated": "2021-08-26 04:42:46"
    },
    {
        "englishURN": 1006900,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "41.00",
        "babName": "The Mu'adhdhins Notifying The Imams Of The Prayer",
        "hadithNumber": 686,
        "hadithText": "It was narrated that 'Aishah said: \"Between the time when he finished 'Isha' prayer and Fajr, the Prophet (S.A.W) used to pray eleven Rak'ahs, saying the Taslim after each two Rak'ahs, then praying Witr as one Rak'ah. He would prostrate for as long as it takes one of you to recite fifty verses, then he would raise his head. When the Mu'adhdhin finished the call to Fajr prayer and he could see the dawn, he would pray two brief Rak'ahs, then he would go out with him.\" Some of these narrators (Ibn Abi Dhi'b, Yunus and 'Amr bin Al-Harith) added some phrases not mentioned by the others in the Hadith.</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 1106900,
        "last_updated": "2021-08-26 04:43:43"
    },
    {
        "englishURN": 1006910,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "41.00",
        "babName": "The Mu'adhdhins Notifying The Imams Of The Prayer",
        "hadithNumber": 687,
        "hadithText": "It was narrated from Makhramah bin Sulaiman that Kuraib - the freed slave of Ibn 'Abbas - told him: \"I asked Ibn 'Abbas: 'How did the Messenger of Allah (S.A.W) pray at night?' He said: 'He prayed eleven Rak'ahs including Witr, then he slept deeply until I could hear him snoring, then Bilal came to him and said: \"The prayer, O Messenger of Allah!\" Then he got up and prayed two brief Rak'ahs then led the people in prayer, and he did not perform Wudu'.'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 1106910,
        "last_updated": "2021-08-26 04:45:48"
    },
    {
        "englishURN": 1006920,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "The Book of the Adhan (The Call to Prayer)",
        "babNumber": "42.00",
        "babName": "The Mu'adhdhin Saying The Iqamah When The Imam Comes Out",
        "hadithNumber": 688,
        "hadithText": "It was narrated from 'Abdullah bin Abi Qatadah that his father said: \"The Messenger of Allah (S.A.W) said: 'When the Iqamah for prayer is said, do not stand up until you see that I have come out.'\"</b>",
        "bookID": "7.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 1106920,
        "last_updated": "2021-08-26 04:46:27"
    }
]