[
    {
        "englishURN": 2058000,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 623,
        "hadithText": "Ibn 'Abbas (RAA) narrated that when the Prophet (ﷺ) sent Mu'adh Ibn Jabal to Yemen (as governor), he said to him: “You are going to a people who are People of the Scripture. Invite them to testify that none has the right to be worshipped but Allah and that l am His Messenger. If they obey you in this, then teach them that Allah, the Glorious One, has enjoined five prayers upon them in every day and night (in twenty-four hours), and if they obey you in this, then tell them that Allah has made it obligatory for them to pay Zakah upon their assets and it is to be taken from the wealthy among them and given to the poor among them.” Related by Al-Bukhari</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 2107250,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058010,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 624,
        "hadithText": "Anas (RAA) narrated that Abu Bakr As-Siddiq (RAA) wrote him this letter, “This is the obligatory Zakah, which the Messenger of Allah (ﷺ) made obligatory for every Muslim, and which Allah, the Almighty had commanded him to observe. ‘For each twenty-four camels, or less, their Zakah is to be paid as sheep; for every live camels, their Zakah is one sheep. When the amount of camels is between twenty -five to thirty- five, the due Zakah is one she-camel ‘bint makhad’ (a camel which is one year old and just starting the second year) or a male camel ‘ibn labun’(a young male camel which is two years old and already starting the third year). However, when the amount of camels reaches thirty-six, the due Zakah is a young she-camel 'bint labun’ (a young female camel, which is two years old and already starting the third year). When they reach forty six to sixty camels, their due Zakah is a she camel ‘hiqqah’ (which is three years old and starting the fourth). When they reach sixty-one to seventy-five, one ‘Jaz'ah’ (a four year old camel already starting its fifth year). When their number is between seventy-six to ninety camels, their due Zakah is two young she camels ‘bint labun’. When they are in the range between ninety-one to one hundred and twenty camels, the Zakah is two young she camels 'hiqqah’. If they are over a hundred and twenty camels, on every forty camels, one 'bint labun’ is due. And for every fifty camels (over one hundred and twenty) a young she-camel ‘hiqqah’ is due, And anyone, who has got only four camels, does not have to pay Zakah unless he (the owner of the camels) wants to give something voluntarily. Regarding the Zakah of grazing sheep, if they are between forty and one hundred and twenty, one sheep is due as Zakah. lf they are between 120 and 200, two sheep are due. If they are between 200 and 300, three sheep are due. If they exceed three hundred sheep, then one sheep is due for every extra hundred grazing heads. If the grazing sheep are less than forty, (even if they are 39) then no Zakah is due on them, unless he (the owner of the camels) wants to give something voluntarily. \nOne should not combine (i.e. gather young animals together) or separate them for fear of paying Zakah. When there is a mixture of cattle shared between two partners, and Zakah is paid jointly between them, then they have to calculate it equally among them (depending on the share of each). Neither an old or a defective animal nor a male goat (a ram used for breeding) may be taken as Zakah, unless the Zakah collector wishes to do so. Concerning silver, the Zakah paid is a quarter of a tenth for each 200 Dirhams. If the amount of silver is less than two hundred Dirhams (even if it is 190) then no Zakah is to be paid for it, unless the owner wishes to do so. If the number of camels reaches the number on which a jaz'ah (a four year old camel already starting its fifth year) is due as Zakah, but he only has a ‘hiqqah’ (a she camel which is three years old and starting the fourth), it should be accepted from him along with two sheep if they were available (to compensate for the difference) or twenty Dirhams. If on the other hand he has to offer a ‘hiqqah’ as Zakah, but he only has a jaz'ah, it is accepted from him, and the Zakah collector will then pay him the difference, which is twenty Dirhams or two female sheep.’ Related by AI-Bukhari.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 2107260,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058020,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 625,
        "hadithText": "Mu’adh bin Jabal (RAA) narrated, ‘When the Messenger of Allah (ﷺ) sent him to Yemen, he commanded him to take a ‘tabi’(young bull) or ‘tabi'ah’ (young cow, which is one year old), as Zakah for every 30 cows. And for every forty cows, a musinnah (two year old cow) is due. Every non-Muslim who attained the age of puberty should pay one Dinar or the equivalent from the Mu'afiri clothes (made in a town in Yemen called Ma'afir).’ Related by the Five Imams and the wording is from Ahmad.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 2107290,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058040,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 627,
        "hadithText": "Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said: “No Zakah is to be paid on one’s horse (that he rides) or one’s slave.” Related by Al-Bukhari. Muslim also has the narration, “There is no Zakah to be paid on one’s slave, except for Zakat-ul-Fitr (which is paid at the end of Ramadan, and a Muslim must pay it on behalf of all of those he is responsible for).”</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 2107320,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058050,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 628,
        "hadithText": "Bahz bin Hakam narrated on the authority of his father, who reported on the authority of his grandfather (RAA) that the Messenger of Allah (ﷺ) said: “For every forty camels, one ‘bint labun’ (a young female camel which is two years old and already starting the third year), is due as Zakah. No camel is to be separated from the rest of the camels (i.e. the jointly owned live stock as mentioned above). Whoever gives it willingly, seeking his reward from Allah, will be rewarded. (However) if someone refrains from paying it, it will be taken from him (by force) along with part of his property (as punishment), for it is a right of Allah. None of it is lawful for the family of Muhammad (ﷺ).\" Related by Ahmad, An-Nasa’i, Abu Dawud and Al-Hakim rendered it Sahih. And Ash-Shafi'ee conditioned ruling by it depending on its authenticity.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 2107340,
        "last_updated": "2020-01-23 11:25:17"
    },
    {
        "englishURN": 2058060,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 629,
        "hadithText": "Ali (RAA) narrated that the Messenger of Allah (ﷺ) said: “When you possess two hundred Dirhams at the end of the year (if you still have all of them), five Dirhams are levied on them as Zakah. There is nothing upon you (to be paid) in gold, until it reaches (the value of) twenty Dinars. When you possess twenty Dinars, at the end of the year, then there is half a Dinar levied on it (as Zakah). Any additional amount will be calculated in the same manner. No Zakah is to be paid on monetary holdings, until they have been owned for one year.” Related by Abu Dawud, who rendered it Hasan.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 2107350,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058070,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 630,
        "hadithText": "Ibn Umar (RAA) narrated, ‘Whoever earns any money, he is not liable to pay Zakah, until the period of a year has passed (while still possessing the same amount of money).’ Related by At-Tirmidhi.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 2107360,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058080,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 631,
        "hadithText": "Ali (RAA) narrated that, ‘There is no Zakah to be paid on working cattle.’ Related by Abu Dawud and Ad-Daraqutni.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 2107370,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058090,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 632,
        "hadithText": "Amro bin Shu’aib narrated on the authority of his father who reported on the authority of his grandfather, on the authority of Abdullah bin 'Amro(RAA) that the Messenger of Allah (ﷺ) said: “One who becomes the guardian of an orphan, who owns property, must trade on his behalf and not leave it (saved and unused) until it is all eaten up by Zakah (which is paid yearly).” Related by At-Tirmidhi and Ad-Daraqutni with a weak chain of narrators.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 2107380,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058100,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 633,
        "hadithText": "Abdullah bin Abi Aufa (RAA) narrated, ‘Whenever a person came to the Messenger of Allah (ﷺ) with their Zakah, he would say, “O Allah! Send your blessings upon them” Agreed upon.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 2107400,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058110,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 634,
        "hadithText": "Ali (RAA) narrated that al-Abbas (RAA) asked the Messenger of Allah (ﷺ) to allow him to pay his Zakah before its due date, and he gave him permission to do so.’ Related by At-Tirmidhi and Al-Hakim.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 2107410,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058120,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 635,
        "hadithText": "Jabir (RAA) narrated that The Messenger of Allah (ﷺ) said: “There is no Zakah to be paid on less than five ounces of silver, less than five camels or less than five Awsuq of dates.” Related by Muslim.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 2107420,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058130,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 636,
        "hadithText": "Abu Said Al-Khudri (RAA) narrated that The Messenger of Allah (ﷺ) said: “There is no Zakah to be paid on any amount of dates or grain less than five Awsuq.” Agreed upon.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 2107430,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058140,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 637,
        "hadithText": "Salim bin ’Abdullah narrated on the authority of his father (RAA) that the Messenger of Allah (ﷺ) said: “A tithe is due as Zakah, on every plant watered by heaven (rain water), springs, or underground water (i.e. watered without effort).While half a tithe is paid on what is watered by irrigation (i.e. machines are used).” Related by Al-Bukhari. Abu Dawud added in his narration, “When it is watered by underground water (close to the surface and keeping the land wet), a tithe is paid, but half a tithe is paid when the land is watered by wheels or animals.”</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 2107450,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058150,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 638,
        "hadithText": "Abu Musa Al-Ash’ari and Mu'adh (RAA) narrated that The Messenger of Allah (ﷺ) said to them, “Do not take any Zakah except on these four crops: barley, wheat, raisins and dates.”Related by At-Tabarani and Al-Hakim.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 2107470,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058160,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 639,
        "hadithText": "Imam Ad-Daraqutni related on the authority of Mu’adh (RAA), ‘As for cucumbers, watermelons, pomegranates, and sugar-cane, the Messenger of Allah (ﷺ) has exempted them from Zakah.’ It is transmitted with a weak chain of narrators.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 2107480,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058170,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 640,
        "hadithText": "Sahl bin Abi Hathmah (RAA) narrated, “We were commanded by the Messenger of Allah (ﷺ), ‘Whenever you assess the amount of something, estimate the [Zakah] and ignore one-third. If you do not, then leave (at least) one fourth.” Related by the five Imams, except for Ibn Majah.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 2107490,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058180,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 641,
        "hadithText": "Attab bin Usaid (RAA) narrated that The Messenger of Allah (ﷺ) commanded us, “Grapevines are to be estimated exactly as palm trees, and its Zakah is taken in raisins.” Related by the five lmams and it has a break in the chain.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 2107500,
        "last_updated": "2020-01-23 11:30:18"
    },
    {
        "englishURN": 2058190,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 642,
        "hadithText": "Amro bin Shu’aib narrated on the authority of his father, who reported on the authority of his grandfather (RAA) that a woman came to the Messenger of Allah (ﷺ) accompanied by her daughter, who wore two heavy gold bangles. He said to her, “Do you pay Zakah on them?” She said, ‘No.’ He then said, “Are you pleased that Allah may put two bangles of fire on your wrist on the Day of Judgment?” She then threw them away. Related by the three Imams with a strong chain of narrators.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 2107510,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058200,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 643,
        "hadithText": "Umm Salamah (RAA) narrated that she was wearing golden ornaments and asked the Messenger of Allah (ﷺ), ‘Is it considered as a treasure?’ He said, “If you pay the due Zakah, then it is not considered as a treasure.” Related by Abu Dawud and Ad-Daraqutni.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 2107530,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058210,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 644,
        "hadithText": "Samurah bin Jundub (RAA) narrated that The Messenger of Allah (ﷺ) used to command us to pay Zakah from (the goods) we had prepared for sale. Related by Abu Dawud with a weak chain of narrators.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 2107540,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058220,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 645,
        "hadithText": "Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) said: “One fifth is compulsory to be paid (as Zakah) on buried Treasure.” Agreed upon.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 2107550,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058230,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 646,
        "hadithText": "'Amro bin Shu'aib narrated on the authority of his father, who reported on the authority of his grandfather (RAA) that the Messenger of Allah (ﷺ) was asked about a treasure that was found by a man in some ruined land, and he said to him, “If you found it in an inhabited village, then you must advertise its having been found. However, if he found it in an uninhabited village, then on it and the rest of the discovered treasure one fifth is payable as Zakah.” Related by Ibn Majah with a reliable chain of narrators.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 2107560,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058240,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 647,
        "hadithText": "Bilal bin Al-Harith (RAA) narrated that The Messenger of Allah (ﷺ) took Zakah from the mines of Qabaliyah.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 2107570,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058250,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 2: Sadaqatul Fitr (Zakah paid at the end of Ramadan)",
        "hadithNumber": 648,
        "hadithText": "Ibn ’Umar (RAA) narrated, The Messenger of Allah (ﷺ) enjoined the payment of one sa” of dates or one sa' of barley as Zakat-ul-fitr on every Muslim, slave or free, male or female, young or old, and he ordered that it be paid before the people went out to offer the 'Id prayer.’ Agreed upon.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 2107580,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058260,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 2: Sadaqatul Fitr (Zakah paid at the end of Ramadan)",
        "hadithNumber": 649,
        "hadithText": "Ibn ’Adi and Ad-Daraqutni also related on the authority of Ibn'Umar but with a weak chain of narrators, “Save them (i.e. the poor) wondering around (in the markets and the streets asking for food) on that day.”</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 2107590,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058270,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 2: Sadaqatul Fitr (Zakah paid at the end of Ramadan)",
        "hadithNumber": 650,
        "hadithText": "Abu Sa'id Al-Khudri (RAA) narrated, “We used to offer it (Zakat-ul-fitr) during the lifetime of the Prophet as one sa’ of food or one sa' of dates, or one sa' of barley or one sa' of raisins’’ Agreed upon. In another narration, “or one sa' of dried cottage cheese.” Abu Sa'id then added, “As for myself, I would continue to give it as I used to give during the time of the Prophet. Abu Dawud also transmitted on the authority of Abu Sa'id, “I would never give but a sa'.”</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 2107600,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058280,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 2: Sadaqatul Fitr (Zakah paid at the end of Ramadan)",
        "hadithNumber": 651,
        "hadithText": "Ibn ’Abbas (RAA) narrated, ‘The Messenger of Allah (ﷺ) enjoined Zakat-ul-fitr on the one who fasts (i.e. fasted during the month of Ramadan) to purify him from any indecent act or speech and for the purpose of providing food for the needy. It is accepted as Zakah for the person who pays it before the Eid prayer and it is Sadaqah (i.e. voluntary charity) for the person who pays it after the Eid prayer.’ Related by Abu Dawud and Ibn Majah and Al-Hakim graded it as Sahih.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 2107640,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058290,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 3: Sadaqat at-Tatawu' or Voluntary Charity",
        "hadithNumber": 652,
        "hadithText": "Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) said: “Seven people will be shaded by Allah under His shade on the day when there will be no shade except His ....” He mentioned the rest of the hadith, which says, “and a man who gives charity so secretly that his left hand does not know what his right hand has given.” (i.e. nobody knows how much he has given in charity). Agreed upon.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 2107650,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058300,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 3: Sadaqat at-Tatawu' or Voluntary Charity",
        "hadithNumber": 653,
        "hadithText": "’Uqbah Ibn ‘Amir (RAA) narrated, ‘I heard the Messenger of Allah (ﷺ) say, “Everybody will be shaded by his Sadaqah (on the Day of Judgment) until it has been judged between the people.” Related by Ibn Hibban and Al-Hakim.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 2107660,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058310,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 3: Sadaqat at-Tatawu' or Voluntary Charity",
        "hadithNumber": 654,
        "hadithText": "Abu Sa'id AI-Khudri (RAA) narrated that The Prophet said, “Any Muslim who clothes another Muslim who is naked, Allah will clothe him from the green garments of Paradise. Any Muslim who feeds a Muslim who is hungry, Allah will feed him from the fruit of Paradise, and any Muslim who gives drink to a Muslim who is thirsty, Allah will give him a drink from the Sealed Nectar.” Related by Abu Dawud with a weak chain of narrators.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 2107670,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058320,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 3: Sadaqat at-Tatawu' or Voluntary Charity",
        "hadithNumber": 655,
        "hadithText": "Hakim bin Hizam (RAA) narrated that The Messenger of Allah (ﷺ) said: ”The upper hand is better than the lower hand (i.e. he who gives in charity is better than he who takes it). One should begin by giving to his dependents. And the best Sadaqah (charity) is that, which is given by a wealthy person (from the money which is left over after his expenses). And whoever abstains from asking others for some financial help, Allah will provide for him and save him from asking others; Allah will make him self-sufficient.” Agreed upon and this version is of al-Bukhari.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 2107680,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058330,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 3: Sadaqat at-Tatawu' or Voluntary Charity",
        "hadithNumber": 656,
        "hadithText": "Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) was asked, ‘Which kind of Sadaqah is better? He replied, “That which is given by one who does not have much property. And begin by giving to your dependents.” Related by Ahmad, and Abu Dawud. Ibn Khuzaimah, Ibn Hibban and AI-Hakim graded it as Sahih.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 2107690,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058340,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 3: Sadaqat at-Tatawu' or Voluntary Charity",
        "hadithNumber": 657,
        "hadithText": "Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) said: “Give Sadaqah.” A man then said, ‘Allah’s Messenger (ﷺ), I have a Dinar.’ He then said to him, “Give it to yourself as Sadaqah.” The man again said, ‘I have another one.’ The Messenger of Allah (ﷺ) said: “Give it to your children as Sadaqah.” He said, ‘I have another one.’ He said, “Give it to your wife as Sadaqah.” The man again said, ‘I have another one.’ The Messenger of Allah (ﷺ) said: “Give it to your servant as Sadaqah.” He said, ‘I have another one.’ The Messenger of Allah (ﷺ) said: “You know better to whom you should give it.” Related by Abu Dawud and An-Nasa’i. Ibn Hibban and Al-Hakim regarded it as Sahih.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 2107700,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058350,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 3: Sadaqat at-Tatawu' or Voluntary Charity",
        "hadithNumber": 658,
        "hadithText": "A’ishah (RAA) narrated that The Messenger of Allah (ﷺ) said: “When a woman gives some of the foodstuff (which she has in her house) in charity without being extravagant (without being wasteful), she will receive the reward for what she has spent, and her husband will receive the reward because of his earning, and the keeper (if any) will be similarly rewarded. The reward of one will not decrease the reward of the others.” Agreed upon.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 2107710,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058360,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 3: Sadaqat at-Tatawu' or Voluntary Charity",
        "hadithNumber": 659,
        "hadithText": "Abu Sa'id (RAA) narrated, ‘Zainab the wife of Ibn Mas’ud came along and said to the Prophet “O Messenger of Allah (ﷺ)! You have commanded us today to give Sadaqah (charity). I have some jewelry of mine and I wanted to give it as Sadaqah, but Ibn Mas'ud claims that he and his children are the most entitled to my Sadaqah. (deserve it more than anyone else.)' The Messenger of Allah (ﷺ) said: “Ibn Mas'ud is right. Your husband and your children are more deserving.’’ Related by Al-Bukhari.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 2107720,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058370,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 3: Sadaqat at-Tatawu' or Voluntary Charity",
        "hadithNumber": 660,
        "hadithText": "Ibn ’Umar (RAA) narrated that The Messenger of Allah (ﷺ) said: “A man who persists in begging people to give him charity, will come on the Day of Judgment and there will not be a piece of flesh on his face.” Agreed upon.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 2107730,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058380,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 3: Sadaqat at-Tatawu' or Voluntary Charity",
        "hadithNumber": 661,
        "hadithText": "Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) said: “He who asks others to give to him in order to increase his own wealth, is akin to one who asks for live coals. He who wishes to have more, let him have it and he who wishes to have less, let him have it.” Related by Muslim.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 2107740,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058390,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 3: Sadaqat at-Tatawu' or Voluntary Charity",
        "hadithNumber": 662,
        "hadithText": "Az-Zubair bin Al-Awwam (RAA) narrated that The Messenger of Allah (ﷺ) said: “It is better for any of you to take a rope and cut some wood (from the forest) and carry it over his back and sell it, to preserve his dignity (as he is earning his own living), rather than ask a person for something and that person may give him or not.” Related by Al-Bukhari.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 2107750,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058400,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 3: Sadaqat at-Tatawu' or Voluntary Charity",
        "hadithNumber": 663,
        "hadithText": "Samurah bin Jundub (RAA) narrated that The Messenger of Allah (ﷺ) said: “begging is like a scratch with which a man scratches his face; unless one is asking the ruler or in the case of dire necessity.” Related by At-Tirmidhi, who regarded it as Sahih.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 2107760,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058410,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 4:Division of Zakah (Zakah recipients)",
        "hadithNumber": 664,
        "hadithText": "Abu Sa'id Al-Khudri narrated that The Messenger of Allah (ﷺ) said: “Zakah is not allowed for the well-off person except for one of the following five: an administrator of Zakah, a man who buys Zakah holdings with his money, a person who is in debt, a fighter in the cause of Allah, or a rich person who is given a present by a needy (miskin) person which the latter had been given as Zakah.” Related by Ahmad, Abu Dawud, Ibn Majah, and Al-Hakim regarded it as Sahih.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 2107770,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058420,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 4:Division of Zakah (Zakah recipients)",
        "hadithNumber": 665,
        "hadithText": "'Ubaidullah bin ’Adi bin Al-Khiyar (RAA) narrated that Two men told him that they had gone to the Messenger of Allah (ﷺ) asking him to give them something from the Zakah money (as he was distributing it at that time). The Messenger of Allah (ﷺ) then looked them up and down and found them to be sturdy and strong. He then said to them, “If you desire, I shall give it to you, but this Zakah is not for one who is rich, neither for the one who is strong and able to earn.” Related by Ahmad, Abu Dawud and An-Nasa'i.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 2107780,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058430,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 4:Division of Zakah (Zakah recipients)",
        "hadithNumber": 666,
        "hadithText": "Qabisah bin Mukhariq Al-Hilali (RAA) narrated that The Messenger of Allah (ﷺ) said: “Asking for (the money of) Zakah, is justified only for the following three: first, a man who is in debt: it is then permissible for him to receive [Zakah] until his difficulty is resolved; second, a man who was struck by calamity, which destroyed his holdings, which also makes it permissible for him to receive [Zakah] until he is in a position to earn his own living; and third, a man who has been reduced to poverty and three persons of caliber from among his people testify to his desperate circumstances. Such will receive until he finds a means of support for himself. Other than these cases, O Qabisah, it is considered as taking suht (unlawful or haram earnings), and the person receiving it (this Zakah) will be consuming forbidden (unlawful) holdings.” Related by Muslim, Abu Dawud, Ibn Khuzaimah and Ibn Hibban.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 2107790,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058440,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 4:Division of Zakah (Zakah recipients)",
        "hadithNumber": 667,
        "hadithText": "’Abdul Muttalib bin Rabi’ah bin Al-Harith narrated that The Messenger of Allah (ﷺ) said: “Indeed, Zakah ought not to be given to the family of Muhammad, it will be like giving them from the impurities of people.” In another narration, “It is not lawful for Muhammad or the family of Muhammad(ﷺ). Related by Muslim.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 2107800,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058450,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 4:Division of Zakah (Zakah recipients)",
        "hadithNumber": 668,
        "hadithText": "Jubair bin Mut’am (RAA) narrated, “Uthman Ibn 'Affan and I went to the Messenger of Allah (ﷺ) &, and said to him, ‘O Messenger of Allah (ﷺ)! You have given the family of Banu Al-Muttalib from the fifth of the war booty of Khaibar and left us out, while we and they are of the same status.’ The Messenger of Allah (ﷺ) replied, “Banu Al-Muttalib and Banu Hashim are one.” Related by al-Bukhari.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 2107820,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058460,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 4:Division of Zakah (Zakah recipients)",
        "hadithNumber": 669,
        "hadithText": "Abu Rafi (RAA) narrated that The Messenger of Allah (ﷺ) appointed a man from Bani Makhzum to collect the Zakah. The man said to Abu Rafi', ‘Accompany me so that you may get a share of it.' Abu Rafi, replied, ‘No! Not until I go to the Prophet and ask him’ He went to the Messenger of Allah (ﷺ) and asked him, and the Prophet replied, “The client (slave) of a certain tribe are like (the members of the tribe) themselves and Zakah is not lawful for us.” Related by Ahmad, the three Imams, Ibn Khuzaimah and Ibn Hibban.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 2107830,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058470,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 4:Division of Zakah (Zakah recipients)",
        "hadithNumber": 670,
        "hadithText": "Salim bin ’Abdullah bin ’Umar narrated on the authority of his father (RAA) that the Messenger of Allah (ﷺ) used to give 'Umar bin Al-Khattab something (some money), but he would say to him, ‘Would you give it to a person, who is more needy than me'? The Messenger of Allah (ﷺ) would then say to him, 'Take it. If you are given something from this property, without your having asked for it or being eager to receive it, and if you are not given, do not go and ask for it.” Related by Muslim.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 2107840,
        "last_updated": "2012-12-23 11:44:24"
    },
    {
        "englishURN": 2058031,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 626,
        "hadithText": "'Amro bin Shu'aib narrated on the authority of his father, who reported on the authority of his grandfather (RAA) that the Messenger of Allah (ﷺ) said: “The Zakah of the Muslims should be collected by their water trough.” Related by Ahmad.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 2107300,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 2058032,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book on Zakah",
        "babNumber": null,
        "babName": "Chapter 1",
        "hadithNumber": 626,
        "hadithText": "Abu Dawud also has the narration, “Their Zakah should only be collected by their dwellings.”</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 2107310,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 2058091,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book of Zakah",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 632,
        "hadithText": "And it has a Shahid (supporting narration) that is Mursal narrated by Ash-Shafi'ee.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 2107390,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 2058191,
        "collection": "bulugh",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "The Book of Zakah",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 2058191,
        "hadithText": "And Al-Hakim graded it Sahih based on the narration of Aisha.</b>",
        "bookID": "4.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 2107520,
        "last_updated": "2020-05-22 18:53:24"
    }
]