[
    {
        "englishURN": 406370,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "1.00",
        "babName": " Sighting the New Moon for Beginning and Ending the Fast of Ramadan",
        "hadithNumber": 1,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nonce mentioned Ramadan and said, \"Do not begin the fast until you see\nthe new moon, and do not break the fast (at the end of Ramadan) until\nyou see it. If the new moon is obscured from you, then work out (when\nit should be).\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506330,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406380,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "1.00",
        "babName": " Sighting the New Moon for Beginning and Ending the Fast of Ramadan",
        "hadithNumber": 2,
        "hadithText": "<p>\nYahya related to me from Malik from Abdullah ibn Dinar from\nAbdullah ibn Umar that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"A month has twenty-nine days in it. Do not\nstart the fast or break it until you see the new moon. If the new moon\nis obscured from you, then work out (when it should be).\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506340,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406390,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "1.00",
        "babName": " Sighting the New Moon for Beginning and Ending the Fast of Ramadan",
        "hadithNumber": 3,
        "hadithText": "<p>\nYahya related to me from Malik from Thawr ibn Zayd ad-Dili from\nAbdullah ibn Abbas that the Messenger of Allah, may Allah bless him\nand grant him peace, once mentioned Ramadan and said, \"Do not start\nthe fast or break it until you see the new moon. If the new moon is\nobscured from you, then complete a full thirty days.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506350,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406400,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "1.00",
        "babName": " Sighting the New Moon for Beginning and Ending the Fast of Ramadan",
        "hadithNumber": 4,
        "hadithText": "<p>\nYahya related to me from Malik that he had heard that once in the\ntime of Uthman ibn Affan the new moon had been seen in the afternoon\nand Uthman did not break his fast until evening had come and the sun\nhad set.\n</p>\n<p>\nYahya said that he had heard Malik say that some one\nwho sees the new moon of Ramadan when he is on his own should start\nthe fast and not break it if he knows that that day is part of\nRamadan. He added, \"Some one who sees the new moon of Shawwal when he\nis on his own does not break the fast, because people suspect the\nreliability of someone among them who breaks the fast. Such people\nshould say, when they sight the new moon, 'We have seen the new moon.'\nWhoever sees the new moon of Shawwal during the day should not break\nhis fast but should continue fasting for the rest of that day. This is\nbecause it is really the new moon of the night that is coming .\"\n</p>\n<p>\nYahya said that he heard Malik say, \"If people are fasting on the\nday of Fitr thinking that it is still Ramadan and then definite\nevidence comes to them that the new moon of Ramadan had been seen one\nday before they began to fast and that they are now into the thirty-\nfirst day, then they should break the fast on that day at whatever\ntime the news comes to them. However, they do not pray the id prayer\nif they hear the news after the sun has begun to decline.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506360,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406420,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "3.00",
        "babName": " Being Quick to Break the Fast",
        "hadithNumber": 6,
        "hadithText": "<p>\nYahya related to me from Malik from Abu Hazim ibn Dinar from Sahl\nibn Sad as Saidi that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"People will remain in good as long as they are\nquick to break the fast.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506390,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406430,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "3.00",
        "babName": " Being Quick to Break the Fast",
        "hadithNumber": 7,
        "hadithText": "<p>\nYahya related to me from Malik from Abd ar-Rahman ibn Harmala al-\nAslami from Said ibn al-Musayyab that the Messenger of Allah, may\nAllah bless him and grant him peace, said, \"People will remain in good\nas long as they are quick to break the fast.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506400,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406440,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "3.00",
        "babName": " Being Quick to Break the Fast",
        "hadithNumber": 8,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab from Humayd ibn\nAbd ar-Rahman that Umar ibn al-Khattab and Uthman ibn Affan would pray\nmaghrib when they saw the night darkening, before they broke their\nfast, and that was during Ramadan.\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506410,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406450,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "4.00",
        "babName": " Fasting When Junub in the Morning during Ramadan",
        "hadithNumber": 9,
        "hadithText": "<p>\nYahya related to me from Malik from Abdullah ibn Abd ar-Rahman\nibn Mamar al-Ansari from Abu Yunus, the mawla of A'isha, from  A'isha\nthat she overheard a man standing at the door saying to the Messenger\nof Allah, may Allah bless him and grant him peace, \"Messenger of\nAllah, I get up in the morning junub, in a state of major ritual\nimpurity, and want to fast,\" and the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"I too get up in the morning\njunub and want to fast, so I do ghusl and fast.\"  The man said to him,\n\"You are not the same as us. Allah has forgiven you all your wrong\nactions that have gone before and those that have come after.\"  The\nMessenger of Allah, may Allah bless him and grant him peace, got angry\nand said, \"By Allah, I hope that I am the most fearful of you with\nrespect to Allah and the most knowledgeable of you in how I have\ntaqwa.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506420,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406460,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "4.00",
        "babName": " Fasting When Junub in the Morning during Ramadan",
        "hadithNumber": 10,
        "hadithText": "<p>\nYahya related to me from Malik from Abd Rabbih ibn Said from Abu\nBakr ibn Abd ar-Rahman ibn al-Harith ibn Hisham from A'isha and Umm\nSalama, the wives of the Prophet, may Allah bless him and grant him\npeace, that the Prophet, may Allah bless him and grant him peace, used\nto get up in the morning  junub from intercourse, not a dream, in\nRamadan, and then he would fast.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506430,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406470,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "4.00",
        "babName": " Fasting When Junub in the Morning during Ramadan",
        "hadithNumber": 11,
        "hadithText": "<p>\nYahya related to me from Malik from Sumayy, the mawla of Abu Bakr\nibn Abd ar-Rahman ibn al-Harith ibn Hisham that he heard Abu Bakr ibn\nAbd ar-Rahman ibn al-Harith ibn Hisham say, \"My father and I were with\nMarwan ibn al Hakam at the time when he was amir of Madina, and\nsomeone mentioned to him that Abu Hurayra used to say, 'If someone\nbegins the morning junub, he has broken the fast for that day.'\nMarwan said, 'I swear to you, Abdar-Rahman, you must go to the two umm\nal muminin, A'isha and Umm Salama, and ask them about it.'\n</p>\n<p>\n''Abd ar-Rahman went to visit A'isha and I accompanied him. He greeted\nher and then said, 'Umm al-muminin, we were with Marwan ibn al Hakam\nand someone mentioned to him that Abu Hurayra used to say that if some\none had begun the morning junub, he had broken the fast for that day.'\nA'isha said, 'It is not as Abu Hurayra says Abd ar-Rahman. Do you\ndislike what the Messenger of Allah, may Allah bless him and grant him\npeace, used to do?', and Abd ar-Rahman said, 'No, by Allah.' A'isha\nsaid, 'I bear witness that the Messenger of Allah, may Allah bless him\nand grant him peace, used to get up in the morning junub from\nintercourse, not a dream, and would then fast for that day.' \"\n</p>\n<p>\nHe continued, \"Then we went and visited Umm Salama, and Abd ar-\nRahman asked her about the same matter and she said the same as A'isha\nhad said. Then we went off until we came to Marwan ibn al-Hakam Abd\nar-Rahman told him what they had both said and Marwan said, 'I swear\nto you, Abu Muhammad, you must use the mount which is at the door, and\ngo to Abu Hurayra, who is on his land at al Aqiq, and tell him this.'\nSo Abd ar-Rahman rode off, and I went with him, until we came to Abu\nHurayra. Abd ar-Rahman talked with him for a while, and then mentioned\nthe matter to him, and Abu Hurayra said, 'I don't know anything about\nit. I was just told that by someone.'\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506440,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406480,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "4.00",
        "babName": " Fasting When Junub in the Morning during Ramadan",
        "hadithNumber": 12,
        "hadithText": "<p>\nYahya related to me from Malik from Sumayy, the mawla of Abu\nBakr, from Abu Bakr ibn Abd ar-Rahman that A'isha and Umm Salama, the\nwives of the Prophet, may Allah bless him and grant him peace, said,\n\"The Messengerof Allah, may Allah bless him and grant him peace, used\nto get up in the morning junub from intercourse, not a dream, and\nwould then fast.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506450,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406490,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "5.00",
        "babName": " Permission for a Fasting Man to Kiss",
        "hadithNumber": 13,
        "hadithText": "<p>\nYahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar that a certain man kissed his wife while he was fasting in\nRamadan. This made him very anxious, and so he sent his wife to the\nProphet, may Allah bless him and grant him peace, to ask him about\nthat for him. She went in and saw Umm Salama, the wife of the Prophet,\nmay Allah bless him and grant him peace, and mentioned the matter to\nher, and Umm Salama told her that the Messenger of Allah, may Allah\nbless him and grant him peace, used to kiss while he was fasting. So\nshe went back and told her husband that, but it only made him find\nfault all the more and he said, \"We are not like the Messenger of\nAllah, may Allah bless him and grant him peace. Allah makes\npermissible for the Messenger of Allah, may Allah bless him and grant\nhim peace, whatever He wishes.\"\n</p>\n<p>\nHis wife then went back to\nUmm Salama and found the Messenger of Allah, may Allah bless him and\ngrant him peace, with her. The Messenger of Allah, may Allah bless him\nand grant him peace, said, \"What's the matter with this woman?\", and\nUmm Salama told him. The Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"Didn't you tell her that I do that myself?\"\nand she said, \"I told her, and she went to her husband and told him,\nbut it only made him find fault all the more and say, 'We are not like\nthe Messenger of Allah, may Allah bless him and grant him peace. Allah\nmakes permissible for His Messenger, may Allah bless him and grant him\npeace, whatever He wishes.' \" The Messenger of Allah, may Allah bless\nhim and grant him peace, got angry and said, \"By Allah, I am the one\nwith the most taqwa of Allah of you all, and of you all the one who\nbest knows His limits.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506460,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406500,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "5.00",
        "babName": " Permission for a Fasting Man to Kiss",
        "hadithNumber": 14,
        "hadithText": "<p>\nYahya related to me from Malik from Hisham ibn Urwa from his\nfather that A'isha, umm al-muminin, may Allah be pleased with her,\nsaid, \"The Messenger of Allah, may Allah bless him and grant him\npeace, used to kiss certain of his wives when fasting,\" and then she\nlaughed.\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506470,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406510,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "5.00",
        "babName": " Permission for a Fasting Man to Kiss",
        "hadithNumber": 15,
        "hadithText": "<p>\nYahya related to me from Malik from Yahya ibn Said that Atika\nbint Zayd ibn Amr ibn Nufayl, the wife of Umar ibn al-Khattab, used to\nkiss Umar ibn al-Khattab's head while he was fasting, and he did not\ntell her not to.\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506480,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406520,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "5.00",
        "babName": " Permission for a Fasting Man to Kiss",
        "hadithNumber": 16,
        "hadithText": "<p>\nYahya related to me from Malik from Abu'n-Nadr, the mawla of Umar\nibn Ubaydullah that A'isha bint Talha told him that she was once with\nA'isha, the wife of the Prophet, may Allah bless him and grant him\npeace, and her husband, who was fasting, came and visited her there.\n(He was Abdullah ibn Abd ar-Rahman ibn Abi Bakras-Siddiq.) A'isha said\nto him, \"What's stopping you from coming close to your wife and\nkissing her and joking with her?\"  He said, \"Can I kiss her when I am\nfasting?\"  She said, \"Yes.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506490,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406530,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "5.00",
        "babName": " Permission for a Fasting Man to Kiss",
        "hadithNumber": 17,
        "hadithText": "<p>\nYahya related to me from Malik from Zayd ibn Aslam that Abu\nHurayra and Sad ibn Abi Waqqas used to say that someone who was\nfasting was allowed to kiss.\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506500,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406550,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "6.00",
        "babName": " Restraint in Kissing when Fasting",
        "hadithNumber": 19,
        "hadithText": "<p>\nYahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar that Abdullah ibn Abbas was asked about people kissing while\nfasting and he said that he allowed it for old men but disapproved of\nit for young men.\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506530,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406560,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "6.00",
        "babName": " Restraint in Kissing when Fasting",
        "hadithNumber": 20,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to forbid kissing and fondling for people who were fasting .\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506540,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406570,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "7.00",
        "babName": " Fasting while Travelling",
        "hadithNumber": 21,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab from Ubaydullah\nibn Abdullah ibn Utba ibn Masud from Abdullah ibn Abbas that the\nMessenger of Allah, may Allah bless him and grant him peace, left for\nMakka in Ramadan during the year of the conquest, and fasted until he\nreached al-Kadid. He then broke the fast, and so everyone else did so\nas well. What people used to do was act according to whatever the\nMessenger of Allah, may Allah bless him and grant him peace, had done\nmost recently.\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506550,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406580,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "7.00",
        "babName": " Fasting while Travelling",
        "hadithNumber": 22,
        "hadithText": "<p>\nYahya related to me from Malik from Sumayy, the mawla of Abu Bakr\nibn Abd ar-Rahman, from Abu Bakr ibn Abd ar-Rahman from one of the\ncompanions of the Messenger of Allah, that the Messenger of Allah, may\nAllah bless him and grant him peace, ordered everyone to break the\nfast on the journey he made in the year of the conquest saying, \"Be\nstrong for your enemy,\" while the Messenger of Allah, may Allah bless\nhim and grant him peace, kept on fasting. Abu Bakr said that the one\nwho related this to him said, \"I saw the Messenger of Allah, may Allah\nbless him and grant him peace, pouring water over his head at al-Arj,\neither from thirst or from the heat. Then some one said to the\nMessenger of Allah, may Allah bless him and grant him peace,\n'Messenger of Allah, a group of people kept on fasting when you did.'\nThen when the Messenger of Allah was at al-Kadid, he asked for a\ndrinking-bowl and drank, and everyone broke the fast.\" \n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506560,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406590,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "7.00",
        "babName": " Fasting while Travelling",
        "hadithNumber": 23,
        "hadithText": "<p>\nYahya related to me from Malik from Humayd at-Tawil that Anas ibn\nMalik said, \"We once travelled with the Messenger of Allah, may Allah\nbless him and grant him peace, in Ramadan, and those who were fasting\ndid not find fault with those who were not, and those who were not\nfasting did not find fault with those who were.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506570,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406600,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "7.00",
        "babName": " Fasting while Travelling",
        "hadithNumber": 24,
        "hadithText": "<p>\nYahya related to me from Malik from Hisham ibn Urwa from his\nfather that Hamza ibn Amr al-Aslami once said to the Messenger of\nAllah, may Allah bless him and grant him peace, \"Messenger of Allah, I\nam a man who fasts. Can I fast when travelling?\"  The Messenger of\nAllah, may Allah bless him and grant him peace, said, \"If you want you\ncan fast, and if you want you can break the fast.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506580,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406610,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "7.00",
        "babName": " Fasting while Travelling",
        "hadithNumber": 25,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that Abdullah ibn Umar\nused not to fast while travelling.\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506590,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406620,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "7.00",
        "babName": " Fasting while Travelling",
        "hadithNumber": 26,
        "hadithText": "<p>\nYahya related to me from Malik that Hisham ibn Urwa said, \"My\nfather, Urwa, used to travel in Ramadan, and we would travel with him,\nand he used to fast while we would break the fast, and he would not\ntell us to fast.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506600,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406630,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "8.00",
        "babName": " What to Do when Returning from a Journey in Ramadan or Intending to Travel in Ramadan",
        "hadithNumber": 27,
        "hadithText": "<p>\n27 Yahya related to me from Malik that he had heard that Umar ibn\nal-Khattab, if he was travelling in Ramadan and knew that he would\nreach Madina at the begining of the day ,would do so fasting.\n</p>\n<p>\nYahya said that Malik said, \"Someone who is travelling and knows that\nhe will be reaching his people in the first part of the day, and then\ndawn breaks before he gets there, should be fasting when he gets\nthere.\"\n</p>\n<p>\nMalik said, \"Someone who intends to go away (on a\njourney) in Ramadan, and then dawn breaks while he is still on his\nland before he has left, should fast that day.\"\n</p>\n<p>\nMalik said\nthat a man who returns from a journey in Ramadan and is not fasting\nmay have sexual intercourse with his wife if he wishes, if she is not\nfasting and she has just become pure after her menses.\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506610,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406640,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "9.00",
        "babName": " The Kaffara (Making Amends) for Breaking the Fast in Ramadan",
        "hadithNumber": 28,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab from Hunayd ibn\nAbd arRahman ibn Awf from Abu Hurayra that a man broke the fast in\nRamadan and the Messenger of Allah, may Allah bless him and grant him\npeace, ordered him to make kaffara by freeing a slave, or fasting two\nconsecutive months, or feeding sixty poor people, and he said, \"I\ncan't do it.\"  Someone brought a large basket of dates to the\nMessenger of Allah, may Allah bless him and grant him peace, and he\nsaid, \"Take this and give it away as sadaqa.\"  He said, \"Messenger of\nAllah, there is no-ne more needy than I am.\"  The Messenger of Allah,\nmay Allah bless him and grant him peace, laughed until his eye-teeth\nappeared, and then he said, \"Eat them.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506620,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406660,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "10.00",
        "babName": " Cupping a Man who is Fasting",
        "hadithNumber": 30,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to be cupped while he was fasting. Nafi said, \"He later stopped\ndoing that, and would not be cupped when he was fasting until he had\nbroken the fast.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506640,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406670,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "10.00",
        "babName": " Cupping a Man who is Fasting",
        "hadithNumber": 31,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab that Sad ibn Abi\nWaqqas and Abdullah ibn Umar used to be cupped while they were\nfasting.\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506650,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406680,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "10.00",
        "babName": " Cupping a Man who is Fasting",
        "hadithNumber": 32,
        "hadithText": "<p>\nYahya related to me from Malik from Hisham ibn Urwa that his\nfather used to be cupped while he was fasting and he would not then\nbreak his fast. Hisham added, \"I only ever saw him being cupped when\nhe was fasting.\"\n</p>\n<p>\nMalik said, \"Cupping is only disapproved of\nfor some one who is fasting out of fear that he will become weak and\nif it were not for that, it would not be disapproved of. I do not\nthink that a man who is cupped in Ramadan and does not break his fast,\nowes anything, and I do not say that he has to make up for the day on\nwhich he was cupped, because cupping is only disapproved of for\nsomeone fasting if his fast is endangered. I do not think that someone\nwho is cupped, and is then well enough to keep the fast until evening,\nowes anything, nor does he have to make up for that day.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506660,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406690,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "11.00",
        "babName": " Fasting on the Day of Ashura ( the 10th of Muharram)",
        "hadithNumber": 33,
        "hadithText": "<p>\nYahya related to me from Malik from Hisham ibn Urwa from his\nfather that A'isha, the wife of the Prophet, may Allah bless him and\ngrant him peace, said, \"The day of Ashura was a day the Quraysh used\nto fast in the jahiliyya, and the Messenger of Allah, may Allah bless\nhim and grant him peace, used also to fast it during the jahiliyya.\nThen when the Messenger of Allah, may Allah bless him and grant him\npeace, came to Madina he fasted it and ordered that it be fasted. Then\nRamadan was made obligatory, and that became the fard instead of\nAshura, but whoever wanted to, fasted it, and whoever did not want to,\ndid not fast it.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506670,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406700,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "11.00",
        "babName": " Fasting on the Day of Ashura ( the 10th of Muharram)",
        "hadithNumber": 34,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab that Humayd ibn\nAbd ar-Rahman ibn Awf heard Muawiya ibn Abi Sufyan say from the mimbar\non the day of Ashura in the year in which he made the hajj, \"People of\nMadina, where are your learned men?  I heard the Messenger of Allah,\nmay Allah bless him and grant him peace, say about this day, 'This is\nthe day of Ashura, and fasting it has not been prescribed for you. I\nam fasting it, and whoever of you wants to fast it can do so, and\nwhoever does not want to, does not have to.' \"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506680,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406710,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "11.00",
        "babName": " Fasting on the Day of Ashura ( the 10th of Muharram)",
        "hadithNumber": 35,
        "hadithText": "<p>\nYahya related to me from Malik that he had heard that Umar ibn\nal-Khattab had sent (the following message) to al-Harith ibn Hisham,\n''Tomorrow is the day of Ashura, so fast (it) and tell your family to\nfast (also).\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506690,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406720,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "12.00",
        "babName": " Fasting the Days of Fitr and Adha and Fasting Continuously",
        "hadithNumber": 36,
        "hadithText": "<p>\nYahya related to me from Malik from Muhammad ibn Yahya ibn Habban\nfrom alAraj from Abu Hurayra that the Messenger of Allah, may Allah\nbless him and grant him peace, forbade fasting on two days, the day of\nFitr and the day of Adha.\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506700,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406730,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "12.00",
        "babName": " Fasting the Days of Fitr and Adha and Fasting Continuously",
        "hadithNumber": 37,
        "hadithText": "<p>\nYahya related to me from Malik that he used to hear the people of\nknowledge say,\"There is no harm in fasting continuously as long as one\nbreaks the fast on the days on which the Messenger of Allah, may Allah\nbless him and grant him peace, forbade fasting, namely, the days of\nMina, the day of Adha and the day of Fitr, according to what we have\nheard.\"\n</p>\n<p>\nMalik said, \"This is what I like most out of what I\nhave heard about the matter.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506710,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406740,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "13.00",
        "babName": " The Prohibition against Fasting for Two Days or More without Breaking the Fast in between (Wisal)",
        "hadithNumber": 38,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nforbade fasting for two days or more without breaking the fast in\nbetween. They said, \"But Messenger of Allah, you practise wisal.\"  He\nreplied, \"I am not the same as you. I am fed and given to drink.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506720,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406750,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "13.00",
        "babName": " The Prohibition against Fasting for Two Days or More without Breaking the Fast in between (Wisal)",
        "hadithNumber": 39,
        "hadithText": "<p>\nYahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Beware of wisal. Beware of wisal.\"  They said, \"But\nyou practise wisal, Messenger of Allah.\" He replied, \"I am not the\nsame as you. My Lord feeds me and gives me to drink.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506730,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406760,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "14.00",
        "babName": " The Fasting of Someone who Kills by Mistake or Pronounces the Dhihar Form of Divorce",
        "hadithNumber": 40,
        "hadithText": "<p>\nYahya related to me, and I (myself) heard Malik say, \"The best\nthat I have heard about some one who has to fast for two consecutive\nmonths because of having killed someone by mistake or having\npronounced the dhihar form of divorce, becoming very ill and having to\nbreak his fast, is that if he recovers from his illness and is strong\nenough to fast, he must not delay doing so. He continues his fast from\nwhere he left off.\n</p>\n<p>\nSimilarly, a woman who has to fast because\nof having killed some one by mistake should not delay resuming her\nfast when she has become pure after her period. She continues her fast\nfrom where she left off.\n</p>\n<p>\nNo one who, by the Book of Allah,\nhas to fast for two consecutive months may break his fast except for a\nreason - illness or menstruation. He must not travel and break his\nfast.\"\n</p>\n<p>\nMalik said, \"This is the best that I have heard about\nthe matter.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 0,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406770,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "15.00",
        "babName": " What a Sick Man Does when Fasting",
        "hadithNumber": 41,
        "hadithText": "<p>\nYahya said that he heard Malik say, \"What I have heard from the\npeople of knowledge is that if a man succumbs to an illness which\nmakes fasting very difficult for him and exhausts him and wears him\nout, he can break his fast. This is the same as with a sick man in the\nprayer, who finds standing to be too difficult and exhausting, (and\nAllah knows better than the slave that it is an excuse for him and\nthat it really cannot be described).  If the man is in such a\ncondition he prays sitting, and the deen of Allah is ease.\n</p>\n<p>\nAllah has permitted a traveller to break the fast when travelling, and\nhe has more strength for fasting than a sick man. Allah, the Exalted,\nsays in His book, 'Whoever among you is ill or on a journey (must\nfast) a number of other days,' and Allah has thus permitted a\ntraveller to break his fast when on a journey, and he is more capable\nof fasting than a sick man.\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 0,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406780,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "16.00",
        "babName": " The Vow to Fast, and Fasting for the Dead",
        "hadithNumber": 42,
        "hadithText": "<p>\nYahya related to me from Malik that he had heard that Said ibn\nal-Musayyab was asked whether a man who had vowed to fast a month\ncould fast voluntarily, and Said said, \"He should fulfil his vow\nbefore he does any voluntary fasting.\"\n</p>\n<p>\nMalik said, \"I have\nheard the same thing from Sulayman ibn Yasar.\"\n</p>\n<p>\nMalik said,\n\"If someone dies with an unfulfilled vow to free a slave or to fast or\nto give sadaqa or to give away a camel, and makes a bequest that his\nvow should be fulfilled from his estate, then the sadaqa or the gift\nof the camel are taken from one third of his estate. Preference is\ngiven to it over other bequests, except things of a similar nature,\nbecause by his vow it has become incumbent on him, and this is not the\ncase with something he donates voluntarily. They (vows and voluntary\ndonations) are settled from a limited one-third of his estate, and not\nfrom the whole of it, since if the dying man were free to dispose of\nall of his estate, he might delay settling what had become incumbent\non him (i.e. his vows), so that when death came and the estate passed\ninto the hands of his heirs, he would have bequeathed such things\n(i.e. his vows) that were not claimed by anyone (like debts). If that\n(i.e. to dispose freely of his property) were allowed him, he would\ndelay these things (i.e. his vows) until when he was near death, he\nwould designate them and they might take up all of his estate. He must\nnot do that.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506741,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406790,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "16.00",
        "babName": " The Vow to Fast, and Fasting for the Dead",
        "hadithNumber": 43,
        "hadithText": "<p>\nYahya related to me from Malik that he had heard that Abdullah\nibn Umar used to be asked, \"an some one fast for some one else, or do\nthe prayer for some one else?\" and he would reply, \"No one can fast or\ndo the prayer for anyone else.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506742,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406800,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "17.00",
        "babName": " Making Up Days Missed in Ramadan, and the Kaffara",
        "hadithNumber": 44,
        "hadithText": "<p>\nYahya related to me from Malik from Zayd ibn Aslam from his\nbrother Khalid ibn Aslam that Umar ibn al-Khattab once broke thefast\non a cloudy day thinking that evening had come and the sun had set.\nThen a man came to him and said, \"Amir al-muminin, the sun has come\nout,'' and Umar said, \"That's an easy matter. It was our deduction\n(ijtihad).\"\n</p>\n<p>\nMalik said, \"According to what we think, and\nAllah knows best, what he was referring to when he said, 'That's an\neasy matter' was making up the fast, and how slight the effort\ninvolved was and how easy it was. He was saying (in effect), 'We will\nfast another day in its place.' \"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506770,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406810,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "17.00",
        "babName": " Making Up Days Missed in Ramadan, and the Kaffara",
        "hadithNumber": 45,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say, \"Someone who breaks the fast in Ramadan because he is ill\nor travelling should make up the days he has missed consecutively.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506780,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406820,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "17.00",
        "babName": " Making Up Days Missed in Ramadan, and the Kaffara",
        "hadithNumber": 46,
        "hadithText": "<p>\nYahya related to me from Malik from Ibr Shihab that Abdullah ibn\nAbbas and Abu Hurayra differed about making up days missed in Ramadan.\nOne of them said that they were done separately and the other said\nthat they were done consecutively. He did not know which one of them\nit was who said that they were done separately.\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506790,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406830,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "17.00",
        "babName": " Making Up Days Missed in Ramadan, and the Kaffara",
        "hadithNumber": 47,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say, \"If some one makes himself vomit while he is fasting he\nhas to make up a day, but if he cannot help vomiting he does not have\nto make up anything.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506800,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406840,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "17.00",
        "babName": " Making Up Days Missed in Ramadan, and the Kaffara",
        "hadithNumber": 48,
        "hadithText": "<p>\nYahya related to me from Malik from Yahya ibn Said that he heard\nSaid ibn al Musayyab being asked about making up days missed in\nRamadan, and Said said, \"What I like best is for days missed in\nRamadan to be made up consecutively, and not separately.\"\n</p>\n<p>\nYahya said that he had heard Malik say, about some one who made up the\ndays he had missed in Ramadan separately, that he did not have to\nrepeat them. (What he had done) was enough for him.  It was, however,\npreferable, if he did them consecutively.\n</p>\n<p>\nMalik said,\n\"Whoever eats or drinks thoughtlessly or forgetfully in Ramadan or\nduring any other obligatory fast that he must do, has to fast another\nday in its place.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506810,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406850,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "17.00",
        "babName": " Making Up Days Missed in Ramadan, and the Kaffara",
        "hadithNumber": 49,
        "hadithText": "<p>\nYahya related to me from Malik that Humayd ibn Oays al-Makki told\nhim, \"I was with Mujahid while he was performing tawaf around the\nKaba, and a man came to him and asked whether the days (of fasting)\nfor kaffara had to be fasted consecutively, or could they be split up.\nI said to him, 'Yes, they can be split up, if the person so wishes.'\nMujahid said, 'He should not split them up, because in Ubayy ibn Kab's\nrecitation they are referred to as three consecutive days.' \"\n</p>\n<p>\nMalik said, \"What I like most is what Allah has specified in the\nQur'an, that is, that they are fasted consecutively.\"\n</p>\n<p>\nMalik\nwas asked about a woman who began the day fasting in Ramadan and\nthough it was outside of the time of her period, fresh blood (i.e. not\nmenstrual blood) flowed from her. She then waited until evening to see\nthe same, but did not see anything.Then, on the next day in the\nmorning she had anotherflow, though less than the first. Then, some\ndays before her period, the flow stopped completely. Malik was asked\nwhat she should do about her fasting and prayer, and he said, \"This\nblood is like menstrual blood. When she sees it she should break her\nfast, and then make up the days she has missed. Then, when the blood\nhas completely stopped, she should do ghusl and fast.\"\n</p>\n<p>\nMalik\nwas asked whether someone who became muslim on the last day of Ramadan\nhad to make up all of Ramadan or whether he just had to make up the\nday when he became muslim, and he said, \"He does not have to make up\nany of the days that have passed. He begins fasting from that day\nonwards. What I like most is that he makes up the day on which he\nbecame muslim.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506820,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406870,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "19.00",
        "babName": " The Fidya (Compensation) of a Man who Breaks the Fast in Ramadan from Weakness",
        "hadithNumber": 51,
        "hadithText": "<p>\nYahya related to me from Malik that he had heard that Anas ibn\nMalik used to pay fidya when he had grown old and could no longer\nmanage to do the fast.\n</p>\n<p>\nMalik said, \"I do not consider that to\ndo so is obligatory, but what I like most is that a man does the fast\nwhen he is strong enough. Whoever pays compensation gives one mudd of\nfood in place of every day, using the mudd of the Prophet, may Allah\nbless him and grant him peace.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506840,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406880,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "19.00",
        "babName": " The Fidya (Compensation) of a Man who Breaks the Fast in Ramadan from Weakness",
        "hadithNumber": 52,
        "hadithText": "<p>\nYahya related to me from Malik that he had heard that Abdullah\nibn Umar was asked about what a pregnant woman should do if the fast\nbecame difficult for her and she feared for her child, and he said,\n\"She should break the fast and feed a poor man one mudd of wheat in\nplace of every day, using the mudd of the Prophet, may Allah bless him\nand grant him peace.\"\n</p>\n<p>\nMalik said, \"The people of  knowledge\nconsider that she has to make up for each day of the fast that she\nmisses as Allah, the Exalted and Glorified, says, 'And whoever of you\nis sick or on a journey should fast an equal number of other days, '\nand they consider her pregnancy and her concern for her child as a\nsickness.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506850,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406890,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "19.00",
        "babName": " The Fidya (Compensation) of a Man who Breaks the Fast in Ramadan from Weakness",
        "hadithNumber": 53,
        "hadithText": "<p>\nYahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nthat his father used to say, \"If someone has to make up for days not\nfasted in Ramadan and does not do them before the next Ramadan comes\nalthough he is strong enough to do so, he should feed a poor man with\na mudd of wheat for every day that he has missed, and he has to fast\nthe days he owes as well.\"\n</p>\n<p>\nYahya related to me from Malik\nthat he had heard the same thing from Said ibn Jubayr.\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506861,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406900,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "20.00",
        "babName": " Making Up For Days Not Fasted in Ramadan in General",
        "hadithNumber": 54,
        "hadithText": "<p>\nYahya related to me from Malik from Yahya ibn Said from Abu\nSalama ibn Abd ar-Rahman that he heard A'isha, the wife of the\nProphet, may Allah bless him and grant him peace, say, \"I used to have\nto make up days from Ramadan and not be able to do them until Shaban\ncame.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506880,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406910,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "21.00",
        "babName": " Fasting The \"Day of Doubt\"",
        "hadithNumber": 55,
        "hadithText": "<p>\nYahya related to me from Malik that he had heard the people of\nknowledge telling people not to fast on the day in Shaban when there\nwas doubt (about whether it was Shaban or Ramadan), if they intended\nby it the fast of Ramadan . They considered that whoever fasted on\nthat day without having seen (the new moon) had to make up that day if\nit later became clear that it was part of Ramadan. They did not see\nany harm in voluntary fasting on that day.\n</p>\n<p>\nMalik said, \"This\nis what we do, and what I have seen the people of knowledge in our\ncity doing.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 0,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406920,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "22.00",
        "babName": " The Fast in General",
        "hadithNumber": 56,
        "hadithText": "<p>\nYahya related to me from Malik from Abu'n Nadr, the mawla of Umar\nibn Ubaydullah, from Abu Salama ibn Abd ar-Rahman that A'isha, the\nwife of the Prophet, may Allah bless him and grant  him peace, said,\n\"The Messenger of Allah, may Allah bless him and grant him peace, used\nto fast for so long that we thought he would never stop fasting, and\nhe would go without fasting for so long that we thought he would never\nfast again. I never saw the Messenger of Allah, may Allah bless him\nand grant him peace, fast for a complete month except for Ramadan, and\nI never saw him do more fasting in any one month than he did in\nShaban.'\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506890,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406930,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "22.00",
        "babName": " The Fast in General",
        "hadithNumber": 57,
        "hadithText": "<p>\nYahya related to me from Malik from Abu'z Zinad from al-A'raj\nfrom Abu Hurayra that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"Fasting is a protection for you, so when you\nare fasting, do not behave obscenely or foolishly, and if any one\nargues with you or abuses you, say, 'I am fasting. I am fasting.' \"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506900,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406940,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "22.00",
        "babName": " The Fast in General",
        "hadithNumber": 58,
        "hadithText": "<p>\nYahya related to me from Malik from Abu'z Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"By the One in Whose hand my self is, the smell of\nthe breath of a man fasting is better with Allah than the scent of\nmusk.' He leaves his desires and his food and drink for My sake.\nFasting is for Me and I reward it. Every good action is rewarded by\nten times its kind, up to seven hundred times, except fasting, which\nis for Me, and I reward it.' \"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506910,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406950,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "22.00",
        "babName": " The Fast in General",
        "hadithNumber": 59,
        "hadithText": "<p>\nYahya related to me from Malik from his paternal uncle Abu Suhayl\nibn Malik from his father that Abu Hurayra said, \"When Ramadan comes\nthe gates of the Garden are opened and the gates of the Fire are\nlocked, and the shayatin are chained.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506920,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406960,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": "22.00",
        "babName": " The Fast in General",
        "hadithNumber": 60,
        "hadithText": "<p>\nYahya related to me from Malik that he had heard that the people\nof knowledge did not disapprove of people fasting using tooth-sticks\nat any hour of the day in Ramadan, whether at the beginning or the\nend, nor had he heard any of the people of knowledge disapproving of\nor forbidding the practice.\n</p>\n<p>\nYahya said that he heard Malik\nsay, about fasting for six days after breaking the fast at the end of\nRamadan, that he had never seen any of the people of knowledge and\nfiqh fasting them. He said, \"I have not heard that any of our\npredecessors used to do that, and the people of knowledge disapprove\nof it and they are afraid that it might become a bida and that common\nand ignorant people might join to Ramadan what does not belong to it,\nif they were to think that the people of knowledge had given\npermission for that to be done and were seen doing it.\n</p>\n<p>\nYahya\nsaid that he heard Malik say, \"I have never heard any of the people of\nknowledge and fiqh and those whom people take as an example forbidding\nfasting on the day of jumua. Fasting on it is good, and I have seen\none of the people of knowledge fasting it, and it seemed to me that he\nwas keen to do so.\"\n</p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 0,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406411,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5,
        "hadithText": "<p> Yahya related to me from Malik from Nafi that Abdullah ibn Umar used to say, \"Only some one who makes the intention to fast before dawn (actually) fasts.\" </p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506370,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406412,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5,
        "hadithText": "<p> Yahya related to me from Malik from Ibn Shihab that A'isha and Hafsa, the wives of the Prophet, may Allah bless him and grant him peace, also said that. </p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506380,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406541,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 18,
        "hadithText": "<p> Yahya related to me from Malik that he had heard that A'isha, the wife of the Prophet, may Allah bless him and grant him peace, would say, when she mentioned that the Messenger of Allah, used to kiss while fasting, \"And who among you is more able to control himself than the Messenger of Allah, may Allah bless him and grant him peace?\" </p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506510,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406542,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 18,
        "hadithText": "<p> Yahya said that Malik said that Hisham ibn Urwa ibn az-Zubayr had said, \"I do not think that kissing invites to good for people who are fasting.\" </p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506520,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406651,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 29,
        "hadithText": "<p> Yahya related to me from Malik from Ata ibn Abdullah al-Khurasani that Said ibn al-Musayyab said, \"A bedouin came to the Messenger of Allah, may Allah bless him and grant him peace, beating his breast and tearing out his hair and saying, 'I am destroyed.' The Messenger of Allah, may Allah bless him and grant him peace, said, 'Why is that?', and he said, 'I had intercourse with my wife while fasting in Ramadan.' The Messenger of Allah, may Allah bless him and grant him peace, asked him, 'Are you able to free a slave?', and the man said, 'No.' Then he asked him, 'Are you able to give away a camel?', and the man replied, 'No.' He said, 'Sit own,' and someone brought a large basket of dates to the Messenger of Allah, may Allah bless him and grant him peace, and he said to the man, 'Take this and give it away as sadaqa.' The man said, 'There is no one more needy than me,' and (the Messenger of Allah, may Allah bless him and grant him peace), said, 'Eat them, and fast one day for the day when you had intercourse.' \" </p> <p> Malik said that Ata said that he had asked Said ibn al-Musayyab how many dates there were in that basket, and he said, \"Between fifteen and twenty sas.'' </p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506630,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406652,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 29,
        "hadithText": "<p> Malik said, \"I have heard people of knowledge saying that the kaffara specified by the Messenger of Allah, may Allah bless him and grant him peace, for a man who has intercourse with his wife during the day in Ramadan is not due from someone who, on a day when he is making up the fast of Ramadan, breaks his fast by having intercourse with his wife, or whatever. He only has to make up for that day.\" </p> <p> Malik said, \"This is what I like most out of what I have heard about the matter.\" </p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 0,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406861,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 50,
        "hadithText": "<p> Yahya related to me from Malik from Ibn Shihab that A'isha and Hafsa, the wives of the Prophet, may Allah bless him and grant him peace, began fasting voluntarily one morning and then food was given to them and they broke their fast with it. Then the Messenger of Allah, may Allah bless him and grant him peace, came in. A'isha said, \"Hafsa asked, anticipating me in speech - she took after her father Umar - 'Messenger of Allah, A'isha and I began the morning fasting voluntarily and then food was given us and we broke the fast with it.' The Messenger of Allah, may Allah bless him and grant him peace, said, 'Fast another day in its place.' \" </p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506830,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406862,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 18,
        "bookName": "Fasting",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 50,
        "hadithText": "<p> Yahya said that he heard Malik say, \"Someone who eats or drinks out of neglect or forgetfulness during a voluntary fast does not have to repeat his fast, but he should continue fasting for the rest of the day in which he eats or drinks while voluntarily fasting, and not stop fasting. Someone to whom something unexpected happens which causes him to break his fast while he is fasting voluntarily does not have to repeat his fast if he has broken it for a reason, and not simply because he decided to break his fast. Just as I do not think that someone has to repeat a voluntary prayer if he has had to stop it because of some discharge which he could prevent and which meant that he had to repeat his wudu.\" </p> <p> Malik said, \"Once a man has begun doing any of the right actions (al-amal as-saliha) such as the prayer, the fast and the hajj, or similar right actions of a voluntary nature, he should not stop until he has completed it according to what the sunna for that action is. If he says the takbir he should not stop until he has prayed two rakas. If he is fasting he should not break his fast until he has completed that day's fast. If he goes into ihram he should not return until he has completed his hajj, and if he begins doing tawaf he should not stop doing so until he has gone around the Kaba seven times. He should not stop doing any of these actions once he has started them until he has completed them, except if something happens such as illness or some other matter by which a man is excused. This is because Allah, the Blessed and Exalted, says in His Book, 'And eat and drink until the white thread becomes clear to you from the black thread of dawn, (and) then complete the fast until night-time,' (Sura 2 ayat 187), and so he must complete his fast as Allah has said. Allah, the Exalted, (also) says, 'And complete the hajj and the umra for Allah,' and so if a man were to go into ihram for a voluntary hajj having done his one obligatory hajj (on a previous occasion), he could not then stop doing his hajj having once begun it and leave ihram while in the middle of his hajj. Anyone that begins a voluntary act must complete it once he has begun doing it, just as an obligatory act must be completed . This is the best of what I have heard.\" </p></b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 0,
        "last_updated": "2012-04-26 14:00:00"
    }
]