[
    {
        "englishURN": 406970,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "I'tikaf in Ramadan",
        "babNumber": "1.00",
        "babName": " Mention of Iltikaf",
        "hadithNumber": 1,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab from Urwa ibn az-\nZubayr from Amra bint Abd ar-Rahman that A'isha, the wife of the\nProphet, may Allah bless him and grant him peace, said,\"When the\nMessenger of Allah, may Allah bless him and grant him peace, did\nitikaf he would bring his head near to me and I would comb it. He\nwould only go into the house to relieve himself.\"\n</p></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506930,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406980,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "I'tikaf in Ramadan",
        "babNumber": "1.00",
        "babName": " Mention of Iltikaf",
        "hadithNumber": 2,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab from Amra bint Abd\nar-Rahman that when A'isha was doing itikaf she would only ask after\nsick people if she was walking and not if she was standing still.\n</p>\n<p>\nMalik said, \"A person doing itikaf should not carry out\nobligations of his, nor leave the mosque for them, nor should he help\nanyone. He should only leave the mosque to relieve himself. If he were\nable to go out to do things for people, visiting the sick, praying\nover the dead and following funeral processions would be the things\nwith the most claim on his coming out.\"\n</p>\n<p>\nMalik said, \"A person\ndoing itikaf is not doing itikaf until he avoids what some one doing\nitikaf should avoid, namely, visiting the sick, praying over the dead,\nand entering houses, except to relieve himself.\"\n</p></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506940,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 406990,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "I'tikaf in Ramadan",
        "babNumber": "1.00",
        "babName": " Mention of Iltikaf",
        "hadithNumber": 3,
        "hadithText": "<p>\nYahya related to me from Malik that he had asked Ibn Shihab\nwhether someone doing itikaf could go into a house to relieve himself,\nand he said, \"Yes, there is no harm in that.\"\n</p>\n<p>\nMalik said,\n\"The situation that we are all agreed upon here is that there is no\ndisapproval of anyone doing itikaf in a mosque where jumua is held.\nThe only reason I see for disapproving of doing itikaf in a mosque\nwhere jumua is not held is that the man doing itikaf would have to\nleave the mosque where he was doing itikaf in order to go to jumua, or\nelse not go there at all. If, however, he is doing itikaf in a mosque\nwhere jumua is not held, and he does not have to go to jumua in any\nother mosque, then I see no harm in him doing itikaf there, because\nAllah, the Blessed and Exalted, says, 'While you are doing itikaf in\nmosques,' and refers to all mosques in general, without specifying any\nparticular kind.\"\n</p>\n<p>\nMalik continued, \"Accordingly, it is\npermissiblefor a man to do itikaf in a mosque where jumua is not held\nif he does not have to leave it to go to a mosque where jumua is\nheld.\"\n</p>\n<p>\nMalik said, \"A person doing itikaf should spend the\nnight only in the mosque where he is doing itikaf, except if his tent\nis in one of the courtyards of the mosque. I have never heard that\nsomeone doing itikaf can put up a shelter anywhere except in the\nmosque itself or in one of the courtyards of the mosque.\n</p>\n<p>\nPart\nof what shows that he must spend the night in the mosque is the saying\nof A'isha, 'When the Messenger of Allah, may Allah bless him and grant\nhim peace, was doing itikaf, he would only go into the house to\nrelieve himself.' Nor should he do itikaf on the roof of the mosque or\nin the minaret.\"\n</p>\n<p>\nMalik said, \"The person who is going to do\nitikaf should enter the place where he wishes to do itikaf before the\nsun sets on the night when he wishes to begin his itikaf, so that he\nis ready to begin the itikaf at the beginning of the night when he is\ngoing to start his itikaf. A person doing itikaf should be occupied\nwith his itikaf, and not turn his attention to other things which\nmight occupy him, such as trading or whatever. There is no harm,\nhowever, if some one doing itikaf tells some one to do something for\nhim regarding his estate, or the affairs of  his family, or tells\nsomeone to sell some property of his, or something else that does not\noccupy him directly. There is no harm in him arranging for someone\nelse to do that for him if it is a simple matter.\"\n</p>\n<p>\nMalik\nsaid, \"I have never heard any of the people of knowledge mentioning\nany modification as far as how to do itikaf is concerned. Itikaf is an\nact of ibada like the prayer, fasting, the hajj, and such like acts,\nwhether they are obligatory or voluntary. Anyone who begins doing any\nof these acts should do them according to what has come down in the\nsunna. He should not start doing anything in them that the muslims\nhave not done, whether it is a modification that he imposes on others,\nor one that he begins doing himself. The Messenger of Allah, may Allah\nbless him and grant him peace, practised itikaf, and the muslims know\nwhat the sunna of itikaf is.\"\n</p>\n<p>\nMalik said, \"Itikaf and jiwar\nare the same, and Itikaf is the same for a village-dweller as it is\nfor a nomad.\"\n</p></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506950,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 407000,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "I'tikaf in Ramadan",
        "babNumber": "2.00",
        "babName": " Things Without Which Itikaf is Not Possible",
        "hadithNumber": 4,
        "hadithText": "<p>\nYahya related to me from Malik that he had heard that al-Qasim\nibn Muhammad and Nafi, the mawla of Abdullah ibn Umar said, \"You\ncannot do itikaf unless you are fasting, because of what Allah, the\nBlessed and Exalted, says in His Book, 'And eat and drink until the\nwhite thread becomes clear to you from the black thread of dawn, then\ncomplete the fast until night-time, and do not have intercourse with\nthem while you are doing itikaf in mosques,' (Sura 2 ayat 187). Allah\nonly mentions itikaf together with fasting.\"\n</p>\n<p>\nMalik said,\n\"That is what we go by here.\"\n</p></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506960,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 407010,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "I'tikaf in Ramadan",
        "babNumber": "3.00",
        "babName": " Leaving Itikaf for the Id",
        "hadithNumber": 5,
        "hadithText": "<p>\nYahya related to me that Ziyad ibn Abd ar-Rahman said, \"Malik\nrelated to us from Sumayy, the mawla of Abu Bakr ibn Abd ar-Rahman,\nthat Abu Bakr ibn Abd ar-Rahman was once doing itikaf and he would go\nout to relieve himself in a closed room under a roofed passage in\nKhalid ibn Walid's house. Otherwise he did not leave his place of\nitikaf until he went to pray at the Id with the muslims.\"\n</p></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506971,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 407020,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "I'tikaf in Ramadan",
        "babNumber": "3.00",
        "babName": " Leaving Itikaf for the Id",
        "hadithNumber": 6,
        "hadithText": "<p>\nYahya related to me from Ziyad from Malik that he saw some of the\npeople of knowledge who, when they did itikaf in the last ten days of\nRamadan, would not go back to their families until they had attended\nthe Id al-Fitr with everybody.\n</p>\n<p>\nZiyad said that Malik said, \"I\nheard this from the people of excellence who have passed away, and it\nis what I like most out of what I have heard about the matter.\"\n</p></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506972,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 407030,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "I'tikaf in Ramadan",
        "babNumber": "4.00",
        "babName": " Making Up for the Itikaf (Not Done)",
        "hadithNumber": 7,
        "hadithText": "<p>\nZiyad related to me from Malik from Ibn Shihab from Amra bint Abd\nar-Rahman from A'isha that the Messenger of Allah, may Allah bless him\nand grant him peace, once wanted to do itikaf, and when he went off to\nthe place where he wanted to do itikaf  he found some tents there,\nwhich were A'isha's tent, Hafsa's tent, and Zaynab's tent. When he saw\nthem he asked about them and someone told him that they were the tents\nof A'isha, Hafsa and Zaynab. The Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Do you think them devout?\" Then he\nleft, and did not do itikaf until Shawwal, when he then did it for ten\ndays.\n</p></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506980,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 407040,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "I'tikaf in Ramadan",
        "babNumber": "4.00",
        "babName": " Making Up for the Itikaf (Not Done)",
        "hadithNumber": 8,
        "hadithText": "<p>\nMalik was asked whether someone who went into a mosque to do\nitikaf for the last ten days of Ramadan and stayed there for a day or\ntwo but then became ill and left the mosque, had to do itikaf for the\nnumber of days that were left from the ten, or not, and if he did have\nto do so, then what month should he do it in, and he replied, \"He\nshould make up whatever he has to do of the itikaf when he recovers,\nwhether in Ramadan or otherwise. I have heard that the Messenger of\nAllah, may Allah bless him and grant him peace, once wanted to do\nitikaf in Ramadan, but then came back without having done so, and then\nwhen Ramadan had gone, he did itikaf for ten days in Shawwal.\n</p>\n<p>\nSome one who does itikaf voluntarily in Ramadan and some one who has\nto do itikaf are in the same position regarding what is halal for them\nand what is haram. I have not heard that the Messenger of Allah, may\nAllah bless him and grant him peace, ever did itikaf other than\nvoluntarily.\"\n</p>\n<p>\nMalik said, that if a woman did itikaf and then\nmenstruated during her itikaf, she went back to her house, and, when\nshe was pure again she returned to the mosque, at whatever time it was\nthat she became pure. She then continued her itikaf from where she\nleft off. This was the same situation as with a woman who had to fast\ntwo consecutive months, and who menstruated and then became pure. She\nthen continued the fast from where she had left off and did not delay\ndoing so.\n</p></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 0,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 407050,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "I'tikaf in Ramadan",
        "babNumber": "4.00",
        "babName": " Making Up for the Itikaf (Not Done)",
        "hadithNumber": 9,
        "hadithText": "<p>\nZiyad related to me from Malik from Ibn Shihab that the Messenger\nof Allah, may Allah bless him and grant him peace, used to go to\nrelieve himself in houses.\n</p>\n<p>\nMalik said, \"Someone doing itikaf\nshould not leave for his parents' funeral or for anything else.\"\n</p></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 506990,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 407060,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "I'tikaf in Ramadan",
        "babNumber": "5.00",
        "babName": " Marriage in Itikaf",
        "hadithNumber": 9,
        "hadithText": "<p>\nMalik said, \"There is no harm in someone who is in itikaf\nentering into a marriage contract as long as there is no physical\nrelationship. A woman in itikaf may also be betrothed as long as there\nis no physical relationship. What is haram for someone in itikaf in\nrelation to his womenfolk during the day is haram for him during the\nnight.\"\n</p>\n<p>\nYahya said that Ziyad said that Malik said, \"It is\nnot halal for a man to have intercourse with his wife while he is in\nitikaf, nor for him to take pleasure in her by kissing her, or\nwhatever. However, I have not heard anyone disapproving of a man, or\nwoman, in itikaf getting married as long as there is no physical\nrelationship. Marriage is not disapproved of for someone fasting.\"\n</p>\n<p>\n\"There is, however, a distinction between the marriage of\nsomeone in itikaf and that of someone who is muhrim, in that some one\nwho is muhrim can eat, drink, visit the sick and attend funerals, but\ncannot put on perfume, whilst a man or woman in itikaf can put on oil\nand perfume and groom their hair, but cannot attend funerals or pray\nover the dead or visit the sick. Thus their situations with regard to\nmarriage are different.\"\n</p>\n<p>\n\"This is the sunna as it has come\ndown to us regarding marriage for those who are muhrim, doing itikaf,\nor fasting.\n</p></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 0,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 407070,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "I'tikaf in Ramadan",
        "babNumber": "6.00",
        "babName": " Laylat al-Qadr",
        "hadithNumber": 10,
        "hadithText": "<p>\nYahya related to me from Malik from Yazid ibn Abdullah ibn al-\nHadi from Muhammad ibn Ibrahim al-Harith at-Taymi from Abu Salama ibn\nAbd ar-Rahman that Abu Said al-Khudri said, \"The Messenger of Allah,\nmay Allah bless him and grant him peace, used to do itikaf in the\nmiddle ten days of Ramadan. One year he was doing itikaf and then,\nwhen it came to the night of the twenty-first, which was the night\nbefore the morning when he would normally have finished his itikaf, he\nsaid, 'Whoever has done i'tikaf with me should continue doing itikaf\nfor the last ten days. I saw a certain night and then I was made to\nforget it. I saw myself prostrating the following morning in water and\nclay. Look for it in the last ten days, and look for it on the odd\ndays.' \"\n</p>\n<p>\nAbu Said continued, \"The sky poured with rain that\nnight and the mosque had a roof (made of palm fronds) and the mosque\nwas soaked. With my own eyes I saw the Messenger of Allah, may Allah\nbless him and grant him peace, leave with traces of water and clay on\nhis forehead and nose, in the morning after the night of the twenty-\nfirst.\"\n</p></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 507000,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 407080,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "I'tikaf in Ramadan",
        "babNumber": "6.00",
        "babName": " Laylat al-Qadr",
        "hadithNumber": 11,
        "hadithText": "<p>\nZiyad related to me from Malik from Hisham ibn Urwa from his\nfather that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Search for Laylat al-Qadr in the last ten days of\nRamadan.\"\n</p></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 507010,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 407090,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "I'tikaf in Ramadan",
        "babNumber": "6.00",
        "babName": " Laylat al-Qadr",
        "hadithNumber": 12,
        "hadithText": "<p>\nZiyad related to me from Malik from Abdullah ibn Dinar from\nAbdullah ibn Umar that the Messenger of Allah, may Allah bless him and\ngrant him peace, said. \"Search for Laylat al-Qadr in the last seven\ndays.\"\n</p></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 507020,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 407100,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "I'tikaf in Ramadan",
        "babNumber": "6.00",
        "babName": " Laylat al-Qadr",
        "hadithNumber": 13,
        "hadithText": "<p>\nZiyad related to me from Malik from Abu'n Nadr, the mawla of Umar\nibn Ubaydullah, that Abdullah ibn Unays al-Juhani said to the\nMessenger of Allah, may Allah bless him and grant him peace,\n\"Messenger of Allah, I am a man whose house is a long way away. Tell\nme one night so that I can stop my journey for it.\" The Messenger of\nAllah, may Allah bless him and grant him peace, said, \"Stop on the\ntwenty-third night of Ramadan.\"\n</p></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 507030,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 407110,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "I'tikaf in Ramadan",
        "babNumber": "6.00",
        "babName": " Laylat al-Qadr",
        "hadithNumber": 14,
        "hadithText": "<p>\nZiyad related to me from Malik from Humayd at-Tawil that 'Anas\nibn Malik said, \"The Messenger of Allah, may Allah bless him and grant\nhim peace, came out to us in Ramadan and said, 'I was shown a certain\nnight in Ramadan and then two men abused each other and it was taken\naway. Look for it on the ninth and the seventh and the fifth.' \"\n</p></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 507040,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 407120,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "I'tikaf in Ramadan",
        "babNumber": "6.00",
        "babName": " Laylat al-Qadr",
        "hadithNumber": 15,
        "hadithText": "<p>\n Ziyad related to me from Malik from Nafi from Ibn 'Umar that\nsome of the companions of the Messenger of Allah, may Allah bless him\nand grant him peace, were shown Laylat al-Qadr in their sleep during\nthe last seven days. The Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"I see that your visions agree about the last\nseven days, so whoever is searching for it should do so in the last\nseven days.\"\n</p></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 507050,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 407130,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "I'tikaf in Ramadan",
        "babNumber": "6.00",
        "babName": " Laylat al-Qadr",
        "hadithNumber": 16,
        "hadithText": "<p>\nZiyad related to me from Malik that he had heard a man he trusted\nof the people of knowledge say, \"The Messenger of Allah, may Allah\nbless him and grant him peace, was shown the lifespans of the people\n(who had gone) before him, or what Allah willed of that, and it was as\nif the lives of the people of his community had become too short for\nthem to be able to do as many good actions as others before them had\nbeen able to do with their long lives, so Allah gave him Laylat al-\nQadr, which is better than a thousand months.\"\n</p></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 507060,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 407140,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "I'tikaf in Ramadan",
        "babNumber": "6.00",
        "babName": " Laylat al-Qadr",
        "hadithNumber": 17,
        "hadithText": "<p>\nZiyad related to me from Malik that he had heard that Said ibn\nal-Musayyab used to say, \"Whoever is present at isha on Laylat al-Qadr\nhas taken his portion from it.\"\n</p></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 507070,
        "last_updated": "2012-04-26 14:00:00"
    }
]