[
    {
        "englishURN": 410350,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 22,
        "bookName": "Vows and Oaths",
        "babNumber": "1.00",
        "babName": " Fulfilling Vows to Walk",
        "hadithNumber": 1,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab from Ubaydullah\nibn Abdullah ibn Utba ibn Masud from Abdullah ibn Abbas that Sad ibn\nUbada questioned the Messenger of Allah, may Allah bless him and grant\nhim peace, and said,\"My mother died while she still had a vow which\nshe had not fulfilled.\" The Messenger of Allah, may Allah bless him\nand grant him peace, said, \"Fulfill it for her.\"\n</p></b>",
        "bookID": "22.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 510120,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410360,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 22,
        "bookName": "Vows and Oaths",
        "babNumber": "1.00",
        "babName": " Fulfilling Vows to Walk",
        "hadithNumber": 2,
        "hadithText": "<p>\nYahya related to me from Malik from\n</p>\n<p>\nAbdullah ibn Abi\nBakr that his paternal aunt related that her grandmother made a vow to\nwalk to the Quba mosque. She died, and did not fulfill it, so Abdullah\nibn Abbas asked her daughter to walk for her.\n</p>\n<p>\nYahya said that\nhe had heard Malik say, \"No one walks for anyone else.\"\n</p></b>",
        "bookID": "22.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 510130,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410370,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 22,
        "bookName": "Vows and Oaths",
        "babNumber": "1.00",
        "babName": " Fulfilling Vows to Walk",
        "hadithNumber": 3,
        "hadithText": "<p>\nYahya related to me from Malik that Abdullah ibn Abi Habiba said,\n\"I said to a man, when I was young, 'A man who only says that he must\nwalk to the House of Allah and does not say that he has vowed to walk,\ndoes not have to walk.' A man said, 'Shall I give you this small\ncucumber?' and he had a small cucumber in his hand and you will say,\n'I must walk to the house of Allah?' I said, 'Yes' and I said it, for\nat that time I was still immature. Then, when I came of age, some one\nsaid to me that I had to fulfill my vow. I went and asked Said ibn al-\nMusayyab about it, and he said to me, 'You must walk.' So I walked.\"\n</p>\n<p>\nMalik said, \"That is the custom among us.\"\n</p></b>",
        "bookID": "22.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 510140,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410380,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 22,
        "bookName": "Vows and Oaths",
        "babNumber": "2.00",
        "babName": " Making Vows to Walk to the House and Not Succeeding",
        "hadithNumber": 4,
        "hadithText": "<p>\nYahya related to me from Malik that Urwa ibn Udhayna al-Laythi\nsaid, \"I went out with my grandmother who had vowed to walk to the\nHouse of Allah. When we had gone part of the way, she could not go on.\nI sent one of her mawlas to question Abdullah ibn Umar and I went with\nhim. He asked Abdullah ibn Umar, and Abdullah ibn Umar said to him,\n'Take her and let her ride, and when she has the strength let her ride\nback, and start to walk from the place from which she was unable to go\non.'~\n</p>\n<p>\nYahya said that he had heard Malik say, \"I think that\nshe must sacrifice an animal.\"\n</p>\n<p>\nYahya related to me from Malik\nthat he had heard that Said ibn al-Musayyab and Abu Salama ibn Abd ar-\nRahman said the same as Abdullah ibn Umar.\n</p></b>",
        "bookID": "22.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 510151,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410390,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 22,
        "bookName": "Vows and Oaths",
        "babNumber": "2.00",
        "babName": " Making Vows to Walk to the House and Not Succeeding",
        "hadithNumber": 5,
        "hadithText": "<p>\nYahya related to me from Malik that Yahya ibn Said said, \"I vowed\nto walk, but I was struck by a pain in the kidney, so I rode until I\ncame to Makka. I questioned Ata ibn Abi Rabah and others, and they\nsaid, 'You must sacrifice an animal.' When I came to Madina I\nquestioned the ulama there, and they ordered me to walk again from the\nplace from which I was unable to go on. So I walked.\"\n</p>\n<p>\nYahya\nsaid that he had heard Malik say, \"What is done among us regarding\nsomeone who makes a vow to walk to the House of Allah, and then cannot\ndo it and so rides, is that he must return and walk from the place\nfrom which he was unable to go on. If he cannot walk, he should walk\nwhat he can and then ride, and he must sacrifice a camel, a cow, or a\nsheep if that is all that he can find.\"\n</p>\n<p>\nMalik, when asked\nabout a man who said to another, \"I will carry you to the House of\nAllah\", answered, \"If he intended to carry him on his shoulder, by\nthat he meant hardship and exhaustion to himself, and he does not have\nto do that. Let him walk by foot and make sacrifice. If he did not\nintend anything, let him do hajj and ride, and take the man on hajj\nwith him. That is because he said, 'I will carry you to the house of\nAllah.' If the man refuses to do hajj with him, then there is nothing\nagainst him, and what is demanded of him is cancelled.\"\n</p>\n<p>\nYahya\nsaid that Malik was asked whether it was enough for a man who had made\na vow that he would walk to the House of Allah a certain (large)\nnumber of times, or who had forbidden himself from talking to his\nfather and brother, if he did not fulfil a certain vow, and he had\ntaken upon himself, by the oath, something which he was incapable of\nfulfilling in his lifetime, even though he were to try every year, to\nfulfil only one or a (smaller) number of vows by Allah? Malik said,\n\"The only satisfaction for that that I know is fulfilling what he has\nobliged himself to do. Let him walk for as long as he is able and draw\nnear Allah the Exalted by what he can of good.\"\n</p></b>",
        "bookID": "22.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 510170,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410400,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 22,
        "bookName": "Vows and Oaths",
        "babNumber": "3.00",
        "babName": " How to Fulfill the Oath of Walking to the Kaba",
        "hadithNumber": 5,
        "hadithText": "<p>\nYahya related to me from Malik that what he preferred of what he\nhad heard from the people of knowledge about a man or woman who vowed\nto walk to the House of Allah, was that they fulfilled the oath when\nperforming umra, by walking until they had done say between Safa and\nMarwa. When they had done say it was finished. If they vowed to walk\nin the hajj, they walked until they came to Makka, then they walked\nuntil they had finished all the rites.\n</p>\n<p>\nMalik said, \"Walking\nis only for hajj or umra.\"\n</p></b>",
        "bookID": "22.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 0,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410410,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 22,
        "bookName": "Vows and Oaths",
        "babNumber": "4.00",
        "babName": " Vows Not Permitted in Disobedience to Allah",
        "hadithNumber": 6,
        "hadithText": "<p>\nYahya related to me from Malik that Humayd ibn Qays and Thawr ibn\nZayd adDili both informed him that the Messenger of Allah, may Allah\nbless him and grant him peace, (and one of them gave more detail than\nthe other),saw a man standing in the sun. The Messenger asked, \"What's\nwrong with him?\" The people said, \"He has vowed not to speak or to\nseek shade from the sun or to sit and to fast.\" The Messenger of\nAllah, may Allah bless him and grant him peace, said, \"Go and tell him\nto speak, seek shade, and sit, but let him complete his fast.\"\n</p>\n<p>\nMalik said, \"I have not heard that the Messenger of Allah, may\nAllah bless him and grant him peace, ordered the man in question to do\nany kaffara. The Messenger of Allah, may Allah bless him and grant him\npeace, only ordered him to complete that in which there was obedience\nto Allah and to abandon that in which there was disobedience to\nAllah.\"\n</p></b>",
        "bookID": "22.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 510180,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410420,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 22,
        "bookName": "Vows and Oaths",
        "babNumber": "4.00",
        "babName": " Vows Not Permitted in Disobedience to Allah",
        "hadithNumber": 7,
        "hadithText": "<p>\nYahya related to me from Malik that Yahya ibn Said heard al-Qasim\nibn Muhammad say, \"A woman came to Abdullah ibn Abbas and said, 'I\nhave vowed to sacrifice my son.' Ibn Abbas said, 'Do not sacrifice\nyour son. Do kaffara for your oath.' An old man with Ibn Abbas said,\n'What kaffara is there for this?' Ibn Abbas said, 'Allah the Exalted\nsaid, \"Those of you who say, regarding their wives.'Be as my mother's\nback' (Sura58 ayat 2) and then He went on to oblige the kaffara for it\nas you have seen.' \"\n</p></b>",
        "bookID": "22.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 510190,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410430,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 22,
        "bookName": "Vows and Oaths",
        "babNumber": "4.00",
        "babName": " Vows Not Permitted in Disobedience to Allah",
        "hadithNumber": 8,
        "hadithText": "<p>\nYahya related to me from Malik from Talha ibn Abi al-Malik al-\nAyli from al-Qasim ibn Muhammad ibn as-Siddiq from A'isha that the\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"Whoever vows to obey Allah, let him obey Him. Whoever vows to disobey\nAllah, let him not disobey Him.\"\n</p>\n<p>\nYahya said that he had heard\nMalik say, \"The meaning of the statement of the Prophet, may Allah\nbless him and grant him peace, 'Whoever vows to disobey Allah, let him\nnot disobey Him' is that for instance a man who vows that, if he\nspeaks to such-and-such a person, he will walk to Syria, Egypt, or any\nother such things which are not considered as ibada, is not under any\nobligation by any of that, even if he did speak to the man or did\nbreak whatever it was he swore, because Allah does not demand\nobedience in such things. He should only fulfill those things in which\nthere is obedience to Allah.\"\n</p>\n<p>\n22.5 Rashness in Oaths\n</p></b>",
        "bookID": "22.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 510200,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410440,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 22,
        "bookName": "Vows and Oaths",
        "babNumber": "4.00",
        "babName": " Vows Not Permitted in Disobedience to Allah",
        "hadithNumber": 9,
        "hadithText": "<p>\nYahya related to me from Malik from Hisham ibn Urwa from his\nfather that A'isha, umm al-muminin said, \"Rashness in oaths is that a\nman says, 'By Allah, No! by Allah!' \" i.e. out of habit.\n</p>\n<p>\nMalik said, \"The best of what I have heard on the matter is that\nrashness in oaths is that a man take an oath on something to show that\nhe is certain that it is like he said, only to find that it is other\nthan what he said. This is rashness.\"\n</p>\n<p>\nMalik said, \"The\nbinding oath is for example, that a man says that he will not sell his\ngarment for ten dinars, and then he sells it for that, or that he will\nbeat his young slave and then does not beat him, and so on. One does\nkaffara for making such an oath, and there is no kaffara in rashness.\"\n</p>\n<p>\nMalik said, \"As for the one who swears to a thing which he\nknows is wicked, and he swears to a lie he knows to be a lie, in order\nto please someone with it or to excuse himself to someone by it or to\ngain money by it, no kaffara that he does for it can cover it.\"\n</p></b>",
        "bookID": "22.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 510210,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410450,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 22,
        "bookName": "Vows and Oaths",
        "babNumber": "5.00",
        "babName": " Oaths for which Kaffara Not Obligatory",
        "hadithNumber": 10,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid, \"Whoever swears by Allah and then says, 'Allah willing' and then\ndoes not do what he has sworn to, has not broken his oath.\"\n</p>\n<p>\nMalik said, \"The best I have heard on this reservation is that it\nbelongs to the statement made if the speaker does not break the normal\nflow of speech before he is silent. If he is silent and breaks the\nflow of speech, he has no exception.\"\n</p>\n<p>\nYahya said, \"Malik said\nthat a man who said that he had disbelieved or associated something\nwith Allah and then he broke his oath, had no kaffara, and he was not\na disbeliever or one who associated something with Allah unless his\nheart concealed something of either of those. He should ask\nforgiveness of Allah and not return to it - for what he did was evil.\"\n</p></b>",
        "bookID": "22.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 510220,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410460,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 22,
        "bookName": "Vows and Oaths",
        "babNumber": "6.00",
        "babName": " Oaths for Which Kaffara is Obligatory",
        "hadithNumber": 11,
        "hadithText": "<p>\nYahya related to me from Malik from Suhayl ibn Abi Salih from his\nfather from Abu Hurayra that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Whoever makes an oath and then sees\nthat something else would be better than it, should do kaffara for his\noath and do what is better.\"\n</p>\n<p>\nYahya said that he heard Malik\nsay, \"Anyone who says that he has a vow but does not mention the name\nof Allah, is still obliged to make the kaffara for an oath (if he\nbreaks it)\".\n</p>\n<p>\nMalik said, \"Emphasis is when a man swears one\nthing several times, repeating the oath in his speech time after time.\nFor instance, the statement, 'By Allah, I will not decrease it from\nsuch-and-such,' sworn three times or more. The kaffara of that is like\nthe kaffara of one oath. If a man swears, 'I will not eat this food or\nwear these clothes or enter this house,' that is all in one oath, and\nhe is only obliged to do one kaffara. It is the same for a man who\nsays to his wife, 'You are divorced if I clothe you in this garment or\nlet you go to the mosque,' and it is one entire statement in the\nnormal pattern of speech. If he breaks any of that oath, divorce is\nnecessary, and there is no breaking of oath after that in whatever he\ndoes. There is only one oath to be broken in that.\"\n</p>\n<p>\nMalik\nsaid, \"What we do about a woman who makes a vow without her husband's\npermission is that she is allowed to do so and she must fulfill it, if\nit only concerns her own person and will not harm her husband. If,\nhowever, it will harm her husband, he may forbid her to fulfill it,\nbut it remains an obligation against her until she has the opportunity\nto complete it.\"\n</p></b>",
        "bookID": "22.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 510230,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410470,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 22,
        "bookName": "Vows and Oaths",
        "babNumber": "7.00",
        "babName": " Behaviour in the Kaffara of the Broken Oath",
        "hadithNumber": 12,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid, \"If someone breaks an oath which he has stressed, he has to free\na slave, or clothe ten poor people. If someone breaks an oath, but has\nnot stressed it, he only has to feed ten poor people and each poor\nperson is fed a mudd of wheat. Some one who does not have the means\nfor that, should fast for three days.\"\n</p></b>",
        "bookID": "22.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 510240,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410490,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 22,
        "bookName": "Vows and Oaths",
        "babNumber": "8.00",
        "babName": " Oaths in General",
        "hadithNumber": 14,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat one time the Messenger of Allah, may Allah bless him and grant\nhim peace, was speaking to Umar ibn al-Khattab while he was travelling\nwith a troop and Umar swore by his father and he (the Messenger) said,\n\"Allah forbids you to swear by your fathers. If anyone swears, let him\nswear by Allah or keep silent.\"\n</p></b>",
        "bookID": "22.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 510270,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410500,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 22,
        "bookName": "Vows and Oaths",
        "babNumber": "8.00",
        "babName": " Oaths in General",
        "hadithNumber": 15,
        "hadithText": "<p>\nYahya related to me from Malik that he had heard that the\nMessenger of Allah, may Allah bless him and grant him peace, used\ntosay, \"No, by the Overturner of hearts.\"\n</p></b>",
        "bookID": "22.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 510280,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410510,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 22,
        "bookName": "Vows and Oaths",
        "babNumber": "8.00",
        "babName": " Oaths in General",
        "hadithNumber": 16,
        "hadithText": "<p>\nYahya related to me from Malik from Uthman ibn Hafs ibn Umar ibn\nKhalda that Ibn Shihab had heard that Abu Lubaba ibn Abd al-Mundhir,\nwhen Allah turned to him said, \"Messenger of Allah, should I leave my\npeople's house in which I committed wrong action and keep your\ncompany, and give away all my property as sadaqa for Allah and His\nMessenger? \"The Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Giving away a third of it is enough for you.\"\n</p></b>",
        "bookID": "22.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 510290,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410520,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 22,
        "bookName": "Vows and Oaths",
        "babNumber": "8.00",
        "babName": " Oaths in General",
        "hadithNumber": 17,
        "hadithText": "<p>\nYahya related to me from Malik from Ayyub ibn Musa from Mansur\nibn Abd ar-Rahman al-Hajabi from his mother that A'isha, umm al-\nmuminin, may Allah be pleased with her, was asked about a man who\ndevoted his property to the door of Kaba. She said, \"Let him do\nkaffara for it with the kaffara of the oath.\"\n</p>\n<p>\nMalik said,\nthat someone who devoted all his property in the way of Allah, and\nthen broke his oath, should put a third of his property in the way of\nAllah, as that was what the Messenger of Allah, may Allah bless him\nand grant him peace, did in the case of Abu Lubaba.\n</p></b>",
        "bookID": "22.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 510300,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410481,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 22,
        "bookName": "Vows and Oaths",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 13,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to do kaffara for a broken oath by feeding ten poor people. Each\nperson got a mudd of wheat. He sometimes freed a slave if he had\nrepeated the oath.\n</p></b>",
        "bookID": "22.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 510250,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410482,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 22,
        "bookName": "Vows and Oaths",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 13,
        "hadithText": "<p>\nYahya related to me from Malik from Yahya\nibn Said that Sulayman ibn Yasar said, \"I understood from people that\nwhen they made the kaffara for a broken oath, they gave a mudd of\nwheat according to the smaller mudd. They thought that that would\ncompensate for them.\"\n</p>\n<p>\nMalik said, \"The best of what I have\nheard about the one who does kaffara for breaking his oath by clothing\npeople is that if he clothes men he clothes them each in one garment.\nIf he clothes women, he clothes them each in two garments, a long\nshift and a long scarf, because that is what is satisfactory for each\nof them in the prayer.\"\n</p></b>",
        "bookID": "22.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 510260,
        "last_updated": "2012-04-26 14:00:00"
    }
]