[
    {
        "englishURN": 410530,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "Sacrificial Animals",
        "babNumber": "1.00",
        "babName": " Animals to Be Avoided as Sacrifices",
        "hadithNumber": 1,
        "hadithText": "<p>\nYahya related to me from Malik from Amr ibn al-Harith from Ubayd\nibn Fayruz from al-Bara ibn Azib that the Messenger of Allah, may\nAllah bless him and grant him peace, was asked what animals should be\navoided as sacrifices. He indicated with his hand and said, \"Four.\"\nAl-Bara pointed with his hand and said, \"My hand is shorter than the\nhand of the Messenger of Allah, may Allah bless him and grant him\npeace. A lame animal whose lameness is evident, a one-eyed animal\nwhich is clearly one-eyed, an animal which is clearly ill, and an\nemaciated animal with no fat on it.\"\n</p></b>",
        "bookID": "23.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 510310,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410540,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "Sacrificial Animals",
        "babNumber": "1.00",
        "babName": " Animals to Be Avoided as Sacrifices",
        "hadithNumber": 2,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that Abdullah ibn Umar\nwould guard against animals and camels which were young or had\nphysical defects as sacrifices.\n</p>\n<p>\nMalik said, \"That is what I\nlike best of what I have heard .\"\n</p></b>",
        "bookID": "23.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 510320,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410550,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "Sacrificial Animals",
        "babNumber": "2.00",
        "babName": " Animals Desirable as Sacrifices",
        "hadithNumber": 3,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that one time Abdullah\nibn Umar wanted to sacrifice an animal at Madina. Nafi said, \"He told\nme to buy him an excellent horned ram, then to sacrifice it on the Day\nof Sacrifice in the place where the people prayed.\" Nafi continued, \"I\ndid so and when the ram was sacrificed, it was carried to Abdullah ibn\nUmar who shaved his head. He was ill, and did not attend the Id with\nthe people.\" Nafi added, \"Abdullah ibn Umar used to say, 'Shaving the\nhead is not obligatory for someone who sacrifices an animal.' Ibn Umar\nwould do so however.\"\n</p></b>",
        "bookID": "23.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 510330,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410560,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "Sacrificial Animals",
        "babNumber": "3.00",
        "babName": " Prohibition against Sacrificing an Animal Before the Imam Departs",
        "hadithNumber": 4,
        "hadithText": "<p>\nahya related to me from Malik from Yahya ibn Said from Bushayr\nibn Yasar that Abu Burda ibn Niyar sacrificed an animal before the\nMessenger of Allah, may Allah bless him and grant him peace,\nsacrificed on the Day of Sacrifice. He asserted that the Messenger of\nAllah, may Allah bless him and grant him peace, ordered him to\nsacrifice another animal, and he, Abu Burda, said, \"What if I can only\nfind an animal less than one year old, Messenger of Allah?\" He had\nsaid, \"If you can only find a young animal, then sacrifice it.\"\n</p></b>",
        "bookID": "23.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 510340,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410570,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "Sacrificial Animals",
        "babNumber": "3.00",
        "babName": " Prohibition against Sacrificing an Animal Before the Imam Departs",
        "hadithNumber": 5,
        "hadithText": "<p>\nYahya related to me from Malik from Yahya ibn Said from Abbad ibn\nTamin that one time Uwaymir ibn Ashqar sacrificed his animal before\nthe prayer on the morning of the Day of Sacrifice, and he mentioned\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nhad ordered him to sacrifice another animal.\n</p></b>",
        "bookID": "23.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 510350,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410580,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "Sacrificial Animals",
        "babNumber": "4.00",
        "babName": " Storing Meat from Sacrificial Animals",
        "hadithNumber": 6,
        "hadithText": "<p>\nYahya related to me from Malik from Abu'z-Zubayr al-Makki from\nJabir ibn Abdullah that the Messenger of Allah, may Allah bless him\nand grant him peace, forbade that the meat from sacrificial animals be\neaten after three days. Then later he said, \"Eat, give sadaqa, provide\nfor yourselves and store up.\"\n</p></b>",
        "bookID": "23.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 510360,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410590,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "Sacrificial Animals",
        "babNumber": "4.00",
        "babName": " Storing Meat from Sacrificial Animals",
        "hadithNumber": 7,
        "hadithText": "<p>\nYahya related to me from Malik from Abdullah ibn Abi Bakr that\nAbdullah ibn Waqid said, \"The Messengerof Allah, may Allah bless him\nand grant him peace, forbade eating the meat from sacrificial animals\nafter three days.\"\n</p>\n<p>\nAbdullah ibn Abi Bakr said, \"I mentioned\nthat to Amra bint Abd ar-Rahman, and she affirmed that he had spoken\nthe truth as she had heard A'isha, the wife of the Prophet, may Allah\nbless him and grant him peace, say, 'Some people from the desert came\nat the time of the sacrifice in the time of the Messenger of Allah,\nmay Allah bless him and grant him peace, so the Messenger of Allah,\nmay Allah bless him and grant him peace, said, 'Store up for three\ndays, and give what is left over as sadaqa.' \"\n</p>\n<p>\nShe said that\nafterwards some one said to the Messenger of Allah, may Allah bless\nhim and grant him peace, that people had been accustomed to make use\nof their sacrificial animals, melting the fat and curing the skins.\nThe Messenger of Allah, may Allah bless him and grant him peace, said,\n\"What about that?\" They said, \"You have forbidden the meat of\nsacrificial animals after three days.\" The Messenger of Allah, may\nAllah bless him and grant him peace, said, \"I only forbade you for the\nsake of the people who were coming to you. Eat, give sadaqa and store\nup.\"\n</p>\n<p>\nBy these people, he meant the poor people who were\ncoming to Madina.\n</p></b>",
        "bookID": "23.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 510370,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410600,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "Sacrificial Animals",
        "babNumber": "4.00",
        "babName": " Storing Meat from Sacrificial Animals",
        "hadithNumber": 8,
        "hadithText": "<p>\nYahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman\nthat Abu Said alKhudri returned from a journey and his family gave him\nsome meat. He asked whether it was meat from the sacrifice. They\nreplied that it was. Abu Said said, \"Didn't the Messenger of Allah,\nmay Allah bless him and grant him peace, forbid that?\" They said,\n\"There has been a new command from the Messenger of Allah, may Allah\nbless him and grant him peace, since you went away.\" Abu Said went out\nand made enquiries about it and was told that the Messenger of Allah,\nmay Allah bless him and grant him peace, had said,\"I forbade you\nbefore to eat meat of the sacrifice after three days, but now eat,\ngive sadaqa and store up. I forbade you before to make nabidh (by\nsoaking raisins or dates in water), but now make nabidh, but remember\nevery intoxicant is haram .I forbade you to visit graves, but now\nvisit them, and do not use bad language.\"\n</p></b>",
        "bookID": "23.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 510380,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410610,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "Sacrificial Animals",
        "babNumber": "5.00",
        "babName": " Sharing Sacrificial Animals and How Many Share a Cow or Camel",
        "hadithNumber": 9,
        "hadithText": "<p>\nYahya related to me from Malik from Abu'z-Zubayr al-Makki that\nJabir ibn Abdullah said, \"We sacrificed with the Messenger of Allah,\nmay Allah bless him and grant him peace, in the year of Hudaybiya, a\ncamel between seven people, and a cow between seven people.\"\n</p></b>",
        "bookID": "23.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 510390,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410620,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "Sacrificial Animals",
        "babNumber": "5.00",
        "babName": " Sharing Sacrificial Animals and How Many Share a Cow or Camel",
        "hadithNumber": 10,
        "hadithText": "<p>\nYahya related to me from Malik from Umara ibn Yasar that Ata ibn\nYasar told him that Abu Ayyub al-Ansari had told him, \"We used to\nsacrifice one sheep, and a man sacrificed for himself and his family.\nThen later on people began to compete with each other and it became\nboasting.\"\n</p>\n<p>\nMalik said, \"The best that I have heard about a\nsingle camel, cow or sheep, is that a man should sacrifice a camel for\nhimself and his family. He sacrifices a cow or sheep which he owns for\nhis family, and shares with them in it. It is disapproved for a group\nof people to buy a camel, cow or sheep, to share for the ritual and\nsacrifices, each man giving a share of its price, and taking a share\nof its meat. We have heard the tradition that people do not share in\nthe ritual. However, it may be that the people of one household can\nshare.\"\n</p></b>",
        "bookID": "23.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 510400,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410630,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "Sacrificial Animals",
        "babNumber": "5.00",
        "babName": " Sharing Sacrificial Animals and How Many Share a Cow or Camel",
        "hadithNumber": 11,
        "hadithText": "<p>\nYahya related to me from Malik that Ibn Shihab said, \"The\nMessenger of Allah, may Allah bless him and grant him peace, only\nsacrificed one camel or one cow for himself and his family.\"\n</p>\n<p>\nMalik said, \"I do not know which of them Ibn Shihab said.\"\n</p></b>",
        "bookID": "23.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 510410,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410640,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "Sacrificial Animals",
        "babNumber": "6.00",
        "babName": " The Sacrificial Animal for the Child in the Womb and Mention of the Days of Sacrifice",
        "hadithNumber": 12,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid, \"The sacrifice can be done up to two days after the Day of\nSacrifice.\"\n</p>\n<p>\nYahya related to me from Malik that he had heard\nthe same from Ali ibn Abi Talib.\n</p></b>",
        "bookID": "23.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 510421,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 410650,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "Sacrificial Animals",
        "babNumber": "6.00",
        "babName": " The Sacrificial Animal for the Child in the Womb and Mention of the Days of Sacrifice",
        "hadithNumber": 13,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that Abdullah ibn Umar\ndid not sacrifice for the child in the womb.\n</p>\n<p>\nMalik said, \"The\nsacrifice is sunna, and it is not obligatory. I prefer that anyone who\nhas the price of the animal should not abandon it.''\n</p></b>",
        "bookID": "23.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 510440,
        "last_updated": "2012-04-26 14:00:00"
    }
]