[
    {
        "englishURN": 401480,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "1.00",
        "babName": " The Call to Prayer",
        "hadithNumber": 1,
        "hadithText": "<p>\nYahya related to me from Malik that Yahya ibn Said said, \"The\nMessenger of Allah, may Allah bless him and grant him peace, had\nwanted to take two pieces of wood to strike them together to gather\npeople for the prayer, and Abdullah ibn Zayd al-Ansari, then of the\ntribe of Harith ibn al-Khazraj, was shown two pieces of wood in his\nsleep. He said, 'These are close to what the Messenger of Allah, may\nAllah bless him and grant him peace, wants.'  Then it was said, 'Do\nyou not call to the prayer?', so when he woke up he went to the\nMessenger of Allah, may Allah bless him and grant him peace, and\nmentioned the dream to him. The Messenger of Allah, may Allah bless\nhim and grant him peace, ordered the adhan.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 501470,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401490,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "1.00",
        "babName": " The Call to Prayer",
        "hadithNumber": 2,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab from Ata ibn Yazid\nal-Laythi from Abu Said al-Khudri that the Messenger of Allah, may\nAllah bless him and grant him peace, said, \"When you hear the adhan,\nrepeat what the muadhdhin says.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 501480,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401500,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "1.00",
        "babName": " The Call to Prayer",
        "hadithNumber": 3,
        "hadithText": "<p>\nYahya related to me from Malik from Sumayy, the mawla of Abu Bakr\nibn Abd ar-Rahman, from Abu Hurayra that the Messenger of Allah, may\nAllah bless him and grant him peace, said, \"If people knew what was in\nthe adhan and the first row of the prayer and could only draw lots for\nit, they would draw lots. And if they knew what was in doing dhuhr\nearly, they would race each other to it. And if they knew what was in\nisha and subh, they would go to them even if they had to crawl.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 501490,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401510,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "1.00",
        "babName": " The Call to Prayer",
        "hadithNumber": 4,
        "hadithText": "<p>\nYahya related to me from Malik from al-Ala ibn Abd ar-Rahman ibn\nYaqub from his father and Ishaq ibn Abdullah that they informed him\nthat they heard Abu Hurayra say, \"The Messenger of Allah, may Allah\nbless him and grant him peace, said, 'When the iqama is called for\nprayer, do not come to it running, but come with calmness. Pray what\nyou catch and complete what you miss. You are in prayer as long as\nyour aim is the prayer.' \"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 501500,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401520,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "1.00",
        "babName": " The Call to Prayer",
        "hadithNumber": 5,
        "hadithText": "<p>\r\nYahya related to me from Malik from Abd arRahman ibn Abdullah ibn\r\nAbd ar-Rahman ibn Abu Sasaca al-Ansari, and later al-Mazini, that his\r\nfather told him that Abu Said al-Khudri had said to him, \"I see that\r\nyou love sheep and the desert. When you are among your sheep or in\r\nyour desert, call the prayer and raise your voice in the adhan,\r\nbecause I heard the Messenger of Allah, may Allah bless him and grant\r\nhim peace, say, 'No jinn or man or anything within range hears the\r\nvoice of the muadhdhin except that it bears witness for him on the day\r\nof rising.' \"\r\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 501510,
        "last_updated": "2013-02-05 00:34:58"
    },
    {
        "englishURN": 401530,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "1.00",
        "babName": " The Call to Prayer",
        "hadithNumber": 6,
        "hadithText": "<p>\nYahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"When the call to prayer is made Shaytan retreats,\npassing wind, so that he will not hear the adhan. When the adhan is\ncompleted he comes back, until, when the iqama is said, he retreats\nagain. When the iqama is completed, he comes back, until he comes\nbetween a man and his self and says, 'Think of such and such, think of\nsuch and such,' which he was not thinking about before, until the man\ndoes not know how much he has prayed.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 501520,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401540,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "1.00",
        "babName": " The Call to Prayer",
        "hadithNumber": 7,
        "hadithText": "<p>\nYahya related to me from Malik from Abu Hazim ibn Dinar that Sahl\nibn Sad as-Saidi said, \"There are two times when the gates of heaven\nare opened, and few who make supplication have it returned to them\nunanswered. They are at the timeof the adhan, and in a rank of people\nfighting in the way of Allah.\"\n</p>\n<p>\nMalik was asked whether the\nadhan on the day of jumua was called before the time had come for the\nprayer and he said, \"It is not called until after the sun has passed\nthe meridian.\"\n</p>\n<p>\nMalik was asked about doubling the adhan and\nthe iqama, and at what point people had to stand when the iqama for\nthe prayer was called. He said, \"I have heard nothing about the adhan\nand iqama except what I have seen people do. As for the iqama, it is\nnot doubled. That is what the people of knowledge in our region\ncontinue to do. As for people standing up when the iqama for the\nprayer is called, I have not heard of any definite point at which it\nis begun, and I consider it rather to be according to people's\n(individual) capacity, for some people are heavy and some are light,\nand they are not able to be as one man .\"\n</p>\n<p>\nMalik was asked\nabout a gathering of people who wished to do the prescribed prayer\ncalling the iqama and not the adhan, and he said, \"lt is enough for\nthem. The adhan is only obligatory in mosques where the prayer is said\nin congregation.\"\n</p>\n<p>\nMalik was asked about the muadhdhin saying\n\"Peace be upon you\" to the imam and calling him to the prayer, and he\nwas asked who was the first person to whom such a greeting was made.\nHe replied, \"I have not heard that this greeting occurred in the first\ncommunity.\"\n</p>\n<p>\nYahya said that Malik was asked whether a\nmuadhdhin who called the people to prayer and then waited to see if\nanyone would come and no one did, so he said the iqama and did the\nprayer by himself and then people came after he had finished, should\nrepeat the prayer with them. Malik said, \"He does not repeat the\nprayer, and whoever comes after he has finished should do the prayer\nby himself.\"\n</p>\n<p>\nYahya said that Malik was asked about a\nmuadhdhin who called the adhan for a group of people, did voluntary\nprayers, and then the group of people wanted to do the prayer with\nsome one else saying the iqama. He said, \"There is no harm in that.\nHis iqama or somebody else's are the same.\"\n</p>\n<p>\nYahya said that\nMalik said, \"The subh prayer is still called before dawn. As for the\nother prayers, we believe that they should only be called after the\ntime has started.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 501530,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401550,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "1.00",
        "babName": " The Call to Prayer",
        "hadithNumber": 8,
        "hadithText": "<p>\nYahya related to me from Malik that he had heard that the\nmuadhdhin came to Umar ibn al-Khattab to call him to the subh prayer\nand found him sleeping, so he said, \"Prayer is better than sleep,\" and\nUmar ordered him to put that in the adhan for subh .\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 501540,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401560,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "1.00",
        "babName": " The Call to Prayer",
        "hadithNumber": 9,
        "hadithText": "<p>\nYahya related to me from Malik from his paternal uncle Abu Suhayl\nibn Malik that his uncle's father said, \"I recognise nothing nowadays\nof what I saw the people (i.e. the companions of the Messenger, may\nAllah bless him and grant him peace ) doing except the call to\nprayer.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 501550,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401570,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "1.00",
        "babName": " The Call to Prayer",
        "hadithNumber": 10,
        "hadithText": "<p>\nYahya related to me from Malik that Abdullah ibn Umar heard the\niqama while he was in Baqi, so he increased his pace of walking to the\nmosque.\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 501560,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401580,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "2.00",
        "babName": " The Adhan During a Journey and Without Wudu",
        "hadithNumber": 11,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that Abdullah ibn Umar\ncalled the adhan on a cold and windy night and included the phrase,\n\"Do the prayer in shelter.\" Then he said, \"The Messenger of Allah, may\nAllah bless him and grant him peace, used to orderthe muadhdhin to\nsay, 'Do the prayerin shelter' when it was a cold, rainy night \"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 501570,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401590,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "2.00",
        "babName": " The Adhan During a Journey and Without Wudu",
        "hadithNumber": 12,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that on a journey\nAbdullah ibn Umar did no more than the iqama, except for subh, when he\ncalled both the adhan and the iqama. Abdullah ibn Umar used to say,\n\"The adhan is for an imam whom people join .\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 501580,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401600,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "2.00",
        "babName": " The Adhan During a Journey and Without Wudu",
        "hadithNumber": 13,
        "hadithText": "<p>\nYahya related to me from Malik from Hisham ibn Urwa that his\nfather said to him, \"When you are on a journey you can, if you wish,\ncall the adhan and the iqama, or, if you wish, the iqama and not the\nadhan.\"\n</p>\n<p>\nYahya said that he heard Malik say, \"There is no harm\nin a man calling the adhan while riding.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 501590,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401610,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "2.00",
        "babName": " The Adhan During a Journey and Without Wudu",
        "hadithNumber": 14,
        "hadithText": "<p>\nYahya related to me from Malik from Yahya ibn Said that Said ibn\nal-Musayyab used to say, \"Whoever prays on waterless, desolate land -\nan angel prays on his right and an angel prays on his left. When he\ncalls both the adhan and the iqama for the prayer, or calls out the\niqama, angels like mountains pray behind him.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 501600,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401620,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "3.00",
        "babName": " The Duration of the Meal before Dawn (Sahur) in Relation to the Adhan",
        "hadithNumber": 15,
        "hadithText": "<p>\nYahya related to me from Malik from Abdullah ibn Dinar from\nAbdullah ibn Umar that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"Bilal calls the adhan whilst it is still night\nso eat and drink until Ibn Umm Maktum calls the adhan.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 501610,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401630,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "4.00",
        "babName": " The Adhan During a Journey and Without Wudu",
        "hadithNumber": 16,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab from Salim ibn\nAbdullah that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Bilal calls the adhan in the night, so eat and drink\nuntil Ibn Umm Maktum calls the adhan.\" Ibn Umm Maktum was a blind man\nwho did not call the adhan until someone said to him, \"The morning has\ncome. The morning has come.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 501620,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401640,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "5.00",
        "babName": " The Opening of the Prayer",
        "hadithNumber": 17,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab from Salim ibn\nAbdullah from Abdullah ibn Umar that the Messengerof Allah, may Allah\nbless him and grant him peace, used to raise his hands to the level of\nhis shoulders when he began the prayer and when he raised his head\nfrom the ruku he raised them in the same way, saying, \"Allah hears\nwhoever praises him, our Lord and praise belongs to You.\" He did not\nraise them in the sujud.\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 501630,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401650,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "5.00",
        "babName": " The Opening of the Prayer",
        "hadithNumber": 18,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab that AIi ibn\nHusayn ibn Ali ibn Abi Talib said, \"The Messenger of Allah, may Allah\nbless him and grant him peace, used to say, 'Allah is greater'\nwhenever he lowered himself and raised himself, and he continued to\npray like that until he met Al lah .\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 501640,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401660,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "5.00",
        "babName": " The Opening of the Prayer",
        "hadithNumber": 19,
        "hadithText": "<p>\nYahya related to me from Malik from Yahya ibn Sa'id from Sulayman\nibn Yasar that the Messenger of Allah, may Allah bless him and grant\nhim peace, used to raise his hands in the prayer.\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 501650,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401670,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "5.00",
        "babName": " The Opening of the Prayer",
        "hadithNumber": 20,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab from Abu Salama\nibn Abdar-Rahman ibn Awf that Abu Hurayra used to lead them in prayer\nand would say \"Allah is greater\" whenever he lowered himself and\nraised himself. When he had finished he would say, \"By Allah, I am the\nperson whose prayer most resembles the prayer of the Messenger of\nAllah, may Allah bless him and grant him peace.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 501660,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401680,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "5.00",
        "babName": " The Opening of the Prayer",
        "hadithNumber": 21,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab from Salim ibn\nAbdullah that Abdullah ibn Umar used to say \"Allah is greater\" in the\nprayer whenever he lowered himself and raised himself.\n</p>\n<p>\nYahya\nrelated to me from Malik from Nafi that Abdullah ibn Umar used to\nraise his hands to the level of his shoulders when he began the prayer\nand when he raised his head from the ruku he would raise them less\nthan that.\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 501671,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401690,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "5.00",
        "babName": " The Opening of the Prayer",
        "hadithNumber": 22,
        "hadithText": "<p>\nYahya related to me from Malik from Abu Nuaym Wahb ibn Kaysan\nthat Jabir ibn Abdullah used to teach them the takbir in the prayer.\nAbu Nuaym said, \"He used to tell us to say 'Allah is greater' whenever\nwe lowered or raised ourselves.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 501690,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401700,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "5.00",
        "babName": " The Opening of the Prayer",
        "hadithNumber": 23,
        "hadithText": "<p>\nYahya related to me from Malik that Ibn Shihab used to say, \"When\na man catches the raka he says, 'Allah is greater' once, and that\ntakbir is enough for him.\"\n</p>\n<p>\nMalik added, \"That is if he\nintended to begin the prayer by that takbir \"\n</p>\n<p>\nMalik was asked\nabout a man who began with the imam but forgot the opening takbir and\nthe takbir of the ruku until he had done one raka. Then he remembered\nthat he had not said the takbir at the opening nor in the ruku,so he\nsaid the takbir in the second raka. He said, \"I prefer that he start\nhis prayer again, but if he forgets the opening takbir with the imam\nand says the takbir in the first ruku, I consider that enough for him\nif he intends by it the opening takbir.\"\n</p>\n<p>\nMalik said, about\nsome one who prayed by himself and forgot the opening takbir, \"He\nbegins his prayer afresh .\"\n</p>\n<p>\nMalik said, about an imam who\nforgot the opening takbir until he had finished his prayer, \"I think\nthat he should do the prayer again, and those behind him, even if they\nhave said the takbir.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 501700,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401710,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "6.00",
        "babName": " The Recitation of Qur'an in the Maghrib and lsha Prayers",
        "hadithNumber": 24,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab from Muhammad ibn\nJubayr ibn Mutim that his father said, \"I heard the Messenger of\nAllah, may Allah bless him and grant him peace, recite at-Tur (Sura\n52) in the maghrib prayer.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 501710,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401720,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "6.00",
        "babName": " The Recitation of Qur'an in the Maghrib and lsha Prayers",
        "hadithNumber": 25,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab from Ubaydullah\nibn Abdullah ibn Utba ibn Masud from Abdullah ibn Abbas that Umm al-\nFadl bint al-Harith heard him reciting al Mursalat (sura 77) and she\nsaid to him, \"My son, you have reminded me by reciting this sura that\nit was what I last heard the Messenger of Allah, may Allah bless him\nand grant him peace, recite in the maghrib prayer.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 501720,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401730,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "6.00",
        "babName": " The Recitation of Qur'an in the Maghrib and lsha Prayers",
        "hadithNumber": 26,
        "hadithText": "<p>\n26 Yahya related to me from Malik from Abu Ubayd, the mawla of\nSulayman ibn Abd alMalik, from Ubada ibn Nusayy from Qays ibn al\nHarith that Abu Abdullah as-Sunabihi said, \"I arrived in Madina in the\nkhalifate of Abu Bakr as-Siddiq, and I prayed maghrib behind him. He\nrecited the umm al Qur'an and two suras from the shorter ones of the\nmufassal in the first two rakas. Then he stood up in the third and I\ndrew so near to him that my clothes were almost touching his clothes.\nI heard him reciting the umm al-Qur'an and this ayat, 'Our Lord, do\nnot make our hearts go astray after You have guided us, and give us\nmercy from Your presence. Surely You are the Giver. ' \" (Sura 3 ayat\n8)\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 501730,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401740,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "6.00",
        "babName": " The Recitation of Qur'an in the Maghrib and lsha Prayers",
        "hadithNumber": 27,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to recite in all four rakas as when he prayed alone - in every\nraka the umm al-Qur'an and another sura from the Qur'an. Sometimes he\nwould recite two or three suras in one raka in the obligatory prayer.\nSimilarly, he recited the umm al-Qur'an and two suras in the first two\nrakas of maghrib.\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 501740,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401750,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "6.00",
        "babName": " The Recitation of Qur'an in the Maghrib and lsha Prayers",
        "hadithNumber": 28,
        "hadithText": "<p>\nYahya related to me from Malik from Yahya ibn Said from Adi ibn\nThabit al-Ansari that al-Barra ibn Azib said, \"I prayed isha with the\nMessenger of Allah, may Allah bless him and grant him peace, and he\nrecited at-Tin (Sura 95) in it.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 501750,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401760,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "7.00",
        "babName": " Behaviour in the Recitation",
        "hadithNumber": 29,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi from Ibrahim ibn\nAbdullah ibn Hunayn from hisfatherfromAliibnAbiTalibthattheMessengerof\nAllah, may Allah bless him and grant him peace, forbade wearing the\nqassi (an Egyptian garment, stripedwithsilk),wearing gold rings, and\nreciting the Qur'an in ruku.\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 501760,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401770,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "7.00",
        "babName": " Behaviour in the Recitation",
        "hadithNumber": 30,
        "hadithText": "<p>\nYahya related to me from Malik from Yahya ibn Said from Muhammad\nibn Ibrahim ibn al Harith at-Taymi from Abu Hazim at-Tammar from al\nBayadi that the Messenger of Allah, may Allah bless him and grant him\npeace, came out to the people while they were praying and their voices\nwere raised in the recitation. He said, \"When you pray you are talking\nconfidentially to your Lord. So look to what you confide to Him, and\ndo not say the Qur'an out loud so that others hear it.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 501770,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401780,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "7.00",
        "babName": " Behaviour in the Recitation",
        "hadithNumber": 31,
        "hadithText": "<p>\nYahya related to me from Malik from Humayd at-Tawil that Anas ibn\nMalik said, \"I stood behind Abu Bakr and Umar and Uthman and none of\nthem used to recite 'In the name of Allah, the Merciful, the\nCompassionate' when they began the prayer.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 501780,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401790,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "7.00",
        "babName": " Behaviour in the Recitation",
        "hadithNumber": 32,
        "hadithText": "<p>\nYahya related to me from Malik from his paternal uncle Abu Suhayl\nibn Malik that his father said, \"We heard the recitation of Umar ibn\nal-Khattab when we were at the home of Abu Jahmin al-Balat.\" (Al-Balat\nwas a place in Madina between the mosque and the market.)\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 501790,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401800,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "7.00",
        "babName": " Behaviour in the Recitation",
        "hadithNumber": 33,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that when Abdullah ibn\nUmar missed anything of the prayer in which the imam recited out loud,\nhe would stand up when the imam had said the taslim and recite what he\nowed out loud to himself.\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 501800,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401810,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "7.00",
        "babName": " Behaviour in the Recitation",
        "hadithNumber": 34,
        "hadithText": "<p>\nYahya related to me from Malik that Yazid ibn Ruman said, \"I used\nto pray next to Nafi ibn Jubayr ibn Mutim and he would nudge me to\nprompt him while we were praying.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 501810,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401820,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "8.00",
        "babName": " The Recitation in the Subh Prayer",
        "hadithNumber": 35,
        "hadithText": "<p>\nYahya related to me from Malik from Hisham ibn Urwa from his\nfather that Abu Bakr as-Siddiq prayed subh and recited suratal-Baqara\nin the two rak'as.\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 501820,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401830,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "8.00",
        "babName": " The Recitation in the Subh Prayer",
        "hadithNumber": 36,
        "hadithText": "<p>\nYahya related to me from Malik from Hisham ibn Urwa that his\nfather heard Abdullah ibn Amir ibn Rabia say, \"We prayed subh behind\nUmar ibn al-Khattab and he recited suraYusuf (Sura 12) and surat al-\nHajj (Sura 22) slowly.\" I (Hisham's father) said, \"By Allah, then it\nmust have been his habit to get up at the crack of dawn.\" He said, \"Of\ncourse.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 501830,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401840,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "8.00",
        "babName": " The Recitation in the Subh Prayer",
        "hadithNumber": 37,
        "hadithText": "<p>\nYahya related to me from Malik from Yahya ibn Said and Rabia ibn\nAbi Abd arRahman from al-Qasim ibn Muhammad that al Furafisa ibn\nUmayral-Hanafi said, \"I only learnt Sura Yusuf (Sura 12) from the\nrecitation of it by Uthman ibn Affan in the subh prayer because of the\ngreat number of times he repeated it to us.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 501840,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401850,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "8.00",
        "babName": " The Recitation in the Subh Prayer",
        "hadithNumber": 38,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to recite the first ten suras of the mufassal in the subh prayer,\nand on a journey he would recite the ummal-Qur'an and a sura in every\nraka.\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 501850,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401860,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "9.00",
        "babName": " The Umm al-Qur'an",
        "hadithNumber": 39,
        "hadithText": "<p>\nYahya related to me from Malik from al-Ala ibn Abd ar-Rahman ibn\nYaqub that Abu Said, the mawla of Amir ibn Kuraz told him that the\nMessenger of Allah, may Allah bless him and grant him peace, called\ntoUbayy ibn Kab while he was praying. When Ubayy had finished his\nprayer he joined the Messenger of Allah, may Allah bless him and grant\nhim peace, and the Messenger of Allah put his hand upon his hand, and\nhe was intending to leave by the door of the mosque, so the Messenger\nof Allah, may Allah bless him and grant him peace, said, \"I hope that\nyou will not leave the mosque until you know a sura whose like Allah\nhas notsentdown in the Tawrah nor in the Injil nor in the Qur'an.\"\nUbayysaid, \"I began to slow down my pace in the hope of that. Then I\nsaid, 'Messenger of Allah, the sura you promised me!' He said, 'What\ndo you recite when you begin the prayer?' I recited the Fatiha (Sura 1\n) until I came to the end of it, and the Messengerof Allah, may Allah\nbless him and grant him peace, said, 'It is this sura, and it is the\n\"seven oft-repeated\" and the Great Qur'an which I was given.' \"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 501860,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401870,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "9.00",
        "babName": " The Umm al-Qur'an",
        "hadithNumber": 40,
        "hadithText": "<p>\nYahya related to me from Malik from Abu Nuaym Wahb ibn Kaysan\nthat he heard Jabir ibn Abdullah say, \"Someone who prays a raka\nwithout reciting the umm al-Qur'an in it has not done the prayer\nexcept behind an imam.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 501870,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401880,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "10.00",
        "babName": " Reciting to Oneself behind the Imam when He does not Recite Aloud",
        "hadithNumber": 41,
        "hadithText": "<p>\nYahya related to me from Malik from al-Ala ibn Abd ar-Rahman ibn\nYa'qub that he heard Abu's-Sa'ib, the mawla of Hisham ibn Zuhra, say\nhe had heard Abu Hurayra say, \"I heard the Messenger of Allah, may\nAllah bless him and grant him peace, say, 'Whoever prays a prayer\nwithout reciting the umm al-Qur'an in it, his prayer is aborted, it is\naborted, it is aborted, incomplete.' So I said, 'Abu Hurayra,\nsometimes I am behind the imam.'Hepulled my forearm and said, 'Recite\nit to yourself, O Persian, for I heard the Messenger of Allah, may\nAllah bless him and grant him peace, say that Allah the Blessed, the\nExalted, said, \"I have divided the prayer into two halves between me\nand my slave. One half of it is for Me and one half of it is for IVly\nslave, and My slave has what he asks.\" ' The Messenger of Allah, may\nAllah bless him and grant him peace, said, \"Recite.\" The slave says,\n'Praise be to AIIah, the Lord of theWorlds.'  Allah the Blessed, the\nExalted, says, 'My slave has praised Me.' The slave says, 'The\nMerciful, the Compassionate.' Allah says, 'My slave has spoken well of\nMe.' The slave says, 'Master of the Day of the Deen.' Allah says, 'My\nslave has glorified Me.' The slave says, 'You alone we worship and You\nalone we askforhelp.'Allahsays,'This ayat is between Me and My slave,\nand for My slave is what he asks. 'The slave says, 'Guide us in the\nstraight Path, the Path of those whom You have blessed, not of those\nwith whom You are angry, nor those who are in error. ' Allah says,\n'These are for My slaves, and for my slave is what he asks . ' \" ' \"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 501880,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401890,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "10.00",
        "babName": " Reciting to Oneself behind the Imam when He does not Recite Aloud",
        "hadithNumber": 42,
        "hadithText": "<p>\nYahya related to me from Malik from Hisham ibn Urwa that his\nfather used to recite behind the imam when the imam did not recite\naloud.\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 501890,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401900,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "10.00",
        "babName": " Reciting to Oneself behind the Imam when He does not Recite Aloud",
        "hadithNumber": 43,
        "hadithText": "<p>\nYahya related to me from Malik from Yahya ibn Said and from Rabia\nibn Abi Abd ar Rahman that al-Qasim ibn Muhammad used to recite behind\nthe imam when the imam did not recite aloud.\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 501900,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401910,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "10.00",
        "babName": " Reciting to Oneself behind the Imam when He does not Recite Aloud",
        "hadithNumber": 44,
        "hadithText": "<p>\nYahya related to me from Malik from Yazid ibn Ruman that Nafi ibn\nJubayr ibn Mutim used to recite behind the imam when hedid not recite\naloud .\n</p>\n<p>\nMalik said, \"That is the most preferable to me of\nwhat I have heard about the matter.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 501910,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401920,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "11.00",
        "babName": " Not Reciting behind the Imam when He Recites Aloud",
        "hadithNumber": 45,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that Abdullah ibn Umar,\nwhen asked if anyone should recite behind an imam, said, \"When you\npray behind an imam then the recitation of the imam is enough for you\nand when you pray on your own you must recite.\" Nafi added, \"Abdullah\nibn 'Umar used not to recite behind the imam.\"\n</p>\n<p>\nYahya said\nthat he heard Malik say, \"The position with us is that aman recites\nbehind the imam when the imam does not recite aloud and he refrains\nfrom reciting when the imam recites aloud.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 501920,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401930,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "11.00",
        "babName": " Not Reciting behind the Imam when He Recites Aloud",
        "hadithNumber": 46,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab from Ibn Ukayma\nal-Laythi from Abu Hurayra that the Messenger of Allah, may Allah\nbless him and grant him peace, finished a prayer in which he had\nrecited aloud and asked, \"Did any of you recite with me just now?\" One\nman said, \"Yes, I did, Messenger of Allah.\" The Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"I was saying to\nmyself, 'Why am I distracted from the Qur'an?' \" When the people heard\nthe Messenger of Allah, may Allah bless him and grant him peace, say\nthat, they refrained from reciting with the Messenger of Allah, may\nAllah bless him and grant him peace, when he recited aloud.\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 501930,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401940,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "12.00",
        "babName": " Saying 'Amin' behind the Imam",
        "hadithNumber": 47,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab that Sa'id ibn al-\nMusayyab and Abu Salama ibn Abd ar-Rahman told him from Abu Hurayra\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"When the imam says 'Amin', say 'Amin', for the one whose 'Amin'\ncoincides with the 'Amin' of the angels - his previous wrong actions\nare forgiven him.\"\n</p>\n<p>\nIbn Shihab said, \"The Messenger of Allah,\nmay Allah bless him and grant him peace, used to say 'Aameen'\n(extending it).\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 501940,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401950,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "12.00",
        "babName": " Saying 'Amin' behind the Imam",
        "hadithNumber": 48,
        "hadithText": "<p>\nYahya related to me from Malik from Sumayy, the mawla of Abu\nBakr, from Abu Salih as Samman, from Abu Hurayra that the Messenger of\nAllah, may Allah bless him and grant him peace, said, \"When the imam\nhas said, 'not of those with whom You are angry nor of those who are\nin error,' say 'Amin', for the previous wrong actions of the one whose\nutterance coincides with that of the angels, are forgiven him.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 501950,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401960,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "12.00",
        "babName": " Saying 'Amin' behind the Imam",
        "hadithNumber": 49,
        "hadithText": "<p>\nYahya related to me from Malik from Abu'z Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"When one of you says 'Amin' and the angels in the\nsky say 'Amin' so that one coincides with the other, his previous\nwrong actions are forgiven him.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 501960,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401970,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "12.00",
        "babName": " Saying 'Amin' behind the Imam",
        "hadithNumber": 50,
        "hadithText": "<p>\nYahya related to me from Malik from Sumayy, the mawla of Abu\nBakr, from Abu Salih as-Samman from Abu Hurayra that the Messenger of\nAllah, may Allah bless him and grant him peace, said, \"When the imam\nsays, 'Allah hears whoever praises Him,' say 'O Allah! Our Lord,\npraise be toYou, 'for the previous wrong actions done by the one whose\nutterance coincides with that of the angels are forgiven.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 501970,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401980,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "13.00",
        "babName": " Behaviour in the Sitting in the Prayer",
        "hadithNumber": 51,
        "hadithText": "<p>\nYahya related to me from Malik from Muslim ibn Abi Maryam that\nAIi ibn Abd ar-Rahman al-Muawi said, \"Abdullah ibn Umar saw me playing\nwith some small pebbles in the prayer. When I finished he forbade me,\nsaying, 'Do as the Messenger of Allah, may Allah bless him and grant\nhim peace, did.' I said, 'What did the Messenger of Allah, may Allah\nbless him and grant him peace, do?' He said, 'When he sat in the\nprayer, he placed his right hand on his right thigh and he closed his\nfist and pointed his index finger, and he placed his left hand on his\nleft thigh. That is what he used to do.' \"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 501980,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 401990,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "13.00",
        "babName": " Behaviour in the Sitting in the Prayer",
        "hadithNumber": 52,
        "hadithText": "<p>\nYahya related to me from Malik from Abdullah ibn Dinar that he\nhad seen Abdullah ibn Umar with a man praying at his side. When the\nman sat in the fourth raka, heput both feet to one side and crossed\nthem. When Abdullah finished, he disapproved of that to him, and the\nman protested, \"But you do the same.\" Abdullah ibn Umar said, \"I am\nill.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 501990,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402000,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "13.00",
        "babName": " Behaviour in the Sitting in the Prayer",
        "hadithNumber": 53,
        "hadithText": "<p>\nYahya related to me from Malik from Sadaqa ibn Yasar that al-\nMughira ibn Hakim saw Abdullah ibn Umar sit back from the two sajdas\nof the prayer onto the top of his feet. When he had finished, al-\nMughira mentioned it to him, and Abdullah ibn Umar explained, \"It is\nnot a sunna of the prayer. I do it because I am ill.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 502000,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402010,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "13.00",
        "babName": " Behaviour in the Sitting in the Prayer",
        "hadithNumber": 54,
        "hadithText": "<p>\nYahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nthat Abdullah ibn Umar told him that he used to see Abdullah ibn Umar\ncross his legs in the sitting position of the prayer.He said, \"So I\ndid the same, and I was young at the time. Abdullah ibn Umar forbade\nme and said, 'The sunna of the prayer is that you keep your right foot\nvertical and lay your left foot down.' I said to him, 'But you do the\nsame (as I did).' He said, 'My feet do not support me.' \"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 502010,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402020,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "13.00",
        "babName": " Behaviour in the Sitting in the Prayer",
        "hadithNumber": 55,
        "hadithText": "<p>\nYahya related to me from Malik from Yahya ibn Said that al-Qasim\nibn Muhammad showed them how to sit in the tashahhud, and he kept his\nright foot vertical and laid his left foot down, and sat on his left\nhaunch not on his foot. Then he said, \"Abdullah ibn Abdullah ibn Umar\nsaw me doing this and related to me that his father used to do the\nsame thing.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 502020,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402030,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "14.00",
        "babName": " Tashahhud in the Prayer",
        "hadithNumber": 56,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab from Urwa ibn az-\nZubayr from Abd ar-Rahman ibn Abd al-Qari that he heard Umar ibn al-\nKhattab say, while he was teaching people the tashahhud from the\nmimbar, \"Say, Greetings belong to Allah. Pure actions belong to Allah.\nGood words and prayers belong to Allah. Peace on you, Prophet, and the\nmercy of Allah and His blessings. Peace be upon us and on the slaves\nof Allah who are salihun. I testify that there is no god except Allah.\nAnd I testify that Muhammad is His slave and His messenger.\"\n</p>\n<p>\n'At-tahiyatu lillah, az-zakiyatu lillah, at-tayibatu wa's-salawatu\nlillah. As-salamu alayka ayyuha'nnabiyyu wa rahmatu'llahi wa\nbarakatuhu. As-salamu alayna wa ala ibadi'llahi s-salihin. Ash-hadu an\nla ilaha illa 'llah wa ash-hadu anna Muhammadan abduhu wa rasuluh.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 502030,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402040,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "14.00",
        "babName": " Tashahhud in the Prayer",
        "hadithNumber": 57,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say the tashahhud saying, \"In the name of Allah. Greetings\nbelong to Allah. Prayers belong to Allah. Pure actions belong to\nAllah. Peace be on the Prophet and the mercy of Allah and His\nblessings. Peace be on us and on the slaves of Allah who are salihun.\nI testify that there is no god except Allah. I testify that Muhammad\nis the Messenger of Allah.\"\n</p>\n<p>\n\"Bismillah, at-tahiyatu lillah,\nas-salawatu lillah, az-zakiyatu lillah. As-salamu ala'n-nabiyyi wa\nrahmatullahi wa barakatuhu. As-salamu alayna wa ala\nibadi'llahi's-salihin. Shahidtu an la ilaha illallah. Shahidtu anna\nMuhammadu'r-rasulu'llah.\"\n</p>\n<p>\nHe used to say this after the first\ntwo rakas and he would make supplication with whatever seemed fit to\nhim when the tashahhud was completed. When he sat at the end of the\nprayer, he did the tashahhud in a similar manner, except that after\nthe tashahhud he made supplication with whatever seemed fit to him.\nWhen he had completed the tashahhud and intended to say the taslim, he\nsaid, \"Peace be on the Prophet and His mercy and blessings. Peace be\nupon us and on the slaves of Allah who are salihun.\"\n</p>\n<p>\n\"As-\nsalamu ala'n-nabiyyi wa rahmatu'llahi wa barakatuhu. As-salamu alayna\nwa ala ibadi'llahi'ssalihin .\"\n</p>\n<p>\nHe then said, \"Peace be upon\nyou\" to his right, and would return the greeting to the imam, and if\nanyone said \"Peace be upon you\" from his left he would return the\ngreeting to him.\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 502040,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402050,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "14.00",
        "babName": " Tashahhud in the Prayer",
        "hadithNumber": 58,
        "hadithText": "<p>\nYahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nfrom his father that A'isha, the wife of the Prophet, may Allah bless\nhim and grant him peace, used to say in the tashahhud, \"Greetings,\ngood words, prayers, pure actions belong to Allah. I testify that\nthere is no god except Allah, alone without partner, and that Muhammad\nis His slave and His Messenger. Peace be on you, Prophet, and the\nmercy of Allah and His blessings. Peace be on us and on the slaves of\nAllah who are salihun. Peace be upon you.\"\n</p>\n<p>\n\"At-tahiyatu, at-\ntayibatu, as-salawatu, az-zakiyatu lillah. Ash-hadu an la ilaha\nilla'llah, wahdahu la sharika lah wa anna Muhammadan abduhu wa\nrasuluhu. As-salamu alayka ayyuha-n-nabiyyu wa rahmatu-llahi wa\nbarakatuhu. As-salamu alayna wa ala ibadi-llahi's-salihin. As-salamu\nalaykum.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 502050,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402060,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "14.00",
        "babName": " Tashahhud in the Prayer",
        "hadithNumber": 59,
        "hadithText": "<p>\nYahya related to me from Malik from Yahya ibn Said al-Ansari that\nal-Qasim ibn Muhammad ibn Muhammad told him that A'isha, the wife of\nthe prophet, may Allah bless him and grant him peace, used to say in\nthe tashahhud, \"Greetings, good words, prayers, pure actions belong to\nAllah. I testify that there is no god except Allah, alone without\npartner, and I testify that Muhammad is the slave of Allah and His\nMessenger. Peace be upon you, Prophet, and the mercy of Allah and His\nblessings. Peace be upon us and on the slaves of Allah who are salihun\n. Peace be upon you . \"\n</p>\n<p>\n\"At-tahiyatu, at-tayibatu, as-\nsalawatu, az-zakiyatu lillah. Ash-hadu an la ilaha illa'llah, wahdahu\nla sharika llah wa ash-hadu anna Muhammadan abduhu wa rasuluhu. As-\nsalamu alayka ayyuha-n-nabiyyu wa rahmatu-llahi wa barakatuhu. As-\nsalamu alayna wa ala ibadi-llahi's-salihin. As-salamu alaykum.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 502060,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402070,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "14.00",
        "babName": " Tashahhud in the Prayer",
        "hadithNumber": 60,
        "hadithText": "<p>\nYahya related to me from Malik that he asked Ibn Shihab and Nafi,\nthe mawla of Ibn Umar, whether a man who joined an imam who had\nalready done a raka should say the tashahhud with the imam in the\nsecond and fourth rakas, even though these were odd for him? They\nsaid, \"He should say tashahhud with him.\"\n</p>\n<p>\nMalik said, \"That\nis the position with us.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 502070,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402080,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "15.00",
        "babName": " What to Do If One Raises One's Head Before the Imam",
        "hadithNumber": 61,
        "hadithText": "<p>\nYahya related to me from Malik from Muhammad ibn Amr ibn AIqama\nfrom Malik ibn Abdullah as-Sadi that Abu Hurayra said, \"The one who\nraises his head and lowers it before the imam - his forelock is in the\nhand of a shaytan.\"\n</p>\n<p>\nMalik said, concerning someone who forgot\nand raised his head before the imam in ruku or sujud, \"The sunna of\nthat is to return to bowing or prostrating and not to wait for the\nimam to come up. What he has done is a mistake, because the Messenger\nof Allah, may Allah bless him and grant him peace, said, 'The imam is\nappointed to be followed as a leader, so do not oppose him.' Abu\nHurayra said, 'The one who raises his head and lowers it before the\nimam - his forelock is in the hand of a shaytan.' \"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 502080,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402090,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "16.00",
        "babName": " What to Do if through Forgetfulness One Says the Taslim after Two Rakas",
        "hadithNumber": 62,
        "hadithText": "<p>\nYahya related to me from Malik from Ayyub ibn Abi Tamima as-\nSakhtayani from Muhammad ibn Sirin from Abu Hurayra that the Messenger\nof Allah, may Allah bless him and grant him peace, finished the prayer\nafter two rakas and Dhu'l-Yadayn said to him, \"Has the prayer been\nshortened or have you forgotten, Messenger of Allah?\" The Messenger of\nAllah, may Allah bless him and grant him peace, said, \"Has\nDhu'l-Yadayn spoken the truth?\"  The people said, \"Yes,\" and the\nMessenger of Allah, may Allah bless him and grant him peace, stood and\nprayed the other two rakas and then said, \"Peace be upon you.\" Then he\nsaid, \"Allah is greater\" and went into a sadja as long as his usual\nprostrations or longer. Then he came up and said, \"Allah is greater\"\nand went into a sajda as long as his usual prostrations or longer and\nthen came up.\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 502090,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402100,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "16.00",
        "babName": " What to Do if through Forgetfulness One Says the Taslim after Two Rakas",
        "hadithNumber": 63,
        "hadithText": "<p>\nYahya related to me from Malik from Da'ud ibn al-Husayn that Abu\nSufyan, the mawla of Ibn Abi Ahmad, said that he heard Abu Hurayra\nsay, \"The Messenger of Allah, may Allah bless him and grant him peace,\nprayed asr and said the taslim after two rakas. Dhu'l-Yadayn stood up\nand said, 'Has the prayer been shortened, Messenger of Allah, or have\nyou forgotten?' The Messenger of Allah, may Allah bless him and grant\nhim peace, stood up and completed what remained of the prayer, and\nthen, remaining sitting after saying the taslim, he made two\nprostrations.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 502100,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402110,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "16.00",
        "babName": " What to Do if through Forgetfulness One Says the Taslim after Two Rakas",
        "hadithNumber": 64,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab that Abu Bakr ibn\nSulayman ibn Abi Hathma said, \"I have heard that the Messenger of\nAllah, may Allah bless him and grant him peace, prayed two rakas of\none of the two day-ti me prayers, dhuhr or asr, and said the taslim\nafter two rakas. Dhu'sh-Shamalayn said to him, 'Has the prayer been\nshortened, Messenger of Allah, or have you forgotten?' The Messenger\nof Allah, may Allah bless him and grant him peace, said, 'The prayer\nhas not been shortened and I have not forgotten.' Dhu'shShamalayn\nsaid, 'It was certainly one of those, Messenger of Allah.' The\nMessenger of Allah, may Allah bless him and grant him peace,\napproached the people and said, 'Has Dh u'sh-Shamalayn spoken the\ntruth?' They said, 'Yes, Messenger of Allah,' and the Messenger of\nAllah, may Allah bless him and grant him peace, completed what\nremained of the prayer, and then said, 'Peace be upon you.' \"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 502110,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402120,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "16.00",
        "babName": " What to Do if through Forgetfulness One Says the Taslim after Two Rakas",
        "hadithNumber": 65,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab from Said ibn al-\nMusayyab, and from Abu Salama ibn Abd ar-Rahman, the same as that.\n</p>\n<p>\nMalik said, \"Every forgetfulness which decreases from the\nprayer, prostrations for it come before the greeting, and every\nforgetfulness which is an addition to the prayer, prostrations for it\ncome after the greeting.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 502120,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402130,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "17.00",
        "babName": " Completing what is Recalled When Uncertain how much has been Prayed",
        "hadithNumber": 66,
        "hadithText": "<p>\nYahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"If you are uncertain in the prayer and do not know\nwhether you have prayed three or four rakas, then pray a raka and make\ntwo prostrations from the sitting position before the taslim. If the\nraka that you prayed was the fifth, then you make it even by these two\nsajdas, and if it was the fourth, then the two prostrations spite\nShaytan.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 502130,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402140,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "17.00",
        "babName": " Completing what is Recalled When Uncertain how much has been Prayed",
        "hadithNumber": 67,
        "hadithText": "<p>\nYahya related to me from Malik from Umar ibn Muhammad ibn Zayd\nfrom Salim ibn Abdullah that Abdullah ibn Umar used to say, \"If you\nare uncertain in the prayer, estimate what you think you have\nforgotten of the prayer and repeat it, then do the two sajdas of\nforgetfulness from the sitting position.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 502140,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402150,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "17.00",
        "babName": " Completing what is Recalled When Uncertain how much has been Prayed",
        "hadithNumber": 68,
        "hadithText": "<p>\nYahya related to me from Malik from Afif ibn Amr as-Sahmi that\nAta ibn Yasar said, \"I asked Abdullah ibn Amr ibn al-As and Kab al\nAhbar about someone who was uncertain in his prayer, and did not know\nwhether he had prayed three or four rakas. Both of them said, 'He\nshould pray another raka and then do two sajdas from the sitting\nposition.' \"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 502150,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402160,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "17.00",
        "babName": " Completing what is Recalled When Uncertain how much has been Prayed",
        "hadithNumber": 69,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that Abdullah ibn Umar,\nwhen questioned about forgetfulness in the prayer, said, \"If you think\nthat you have forgotten part of the prayer, then pray it.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 502160,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402170,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "18.00",
        "babName": " What to Do if One Stands After the Completion of the Prayer or After Two Rakas",
        "hadithNumber": 70,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab from al-Araj that\nAbdullah ibn Buhayna said, \"The Messenger of Allah, may Allah bless\nhim and grant him peace, prayed two rakas with us and then stood\nwithout sitting and the people stood with him. When he had finished\nthe prayerand we had seen him say the taslim, he said 'Allah is\ngreater' and did two sajdas from the sitting position and then said\nthe taslim again.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 502170,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402180,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "18.00",
        "babName": " What to Do if One Stands After the Completion of the Prayer or After Two Rakas",
        "hadithNumber": 71,
        "hadithText": "<p>\nYahya related to me from Malik from Yahya ibn Said from Abd ar-\nRahman ibn Hurmuz that Abdullah ibn Buhayna said, \"The Messengerof\nAllah, may Allah bless him and grant him peace, prayed dhuhr with us\nand he stood straight up after two rakas without sitting. When he had\nfinished the prayer, he did two sajdas and then said the taslim after\nthat.\"\n</p>\n<p>\nMalik said, concerning someone who forgot in his\nprayer and stood up after he had completed four rakas and recited and\nthen went into ruku and then, when he raised his head from ruku,\nremembered that he had already completed (his prayer), \"He returns to\na sitting position and does not do any sajda. If he has already done\none sajda I do not think he should do the other. Then when his prayer\nis finished he does two sajdas from the sitting position after saying\nthe taslim.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 502180,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402190,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "19.00",
        "babName": " Looking in the Prayer at What Distracts You from It",
        "hadithNumber": 72,
        "hadithText": "<p>\nYahya related to me from Malik from AIqama ibn Abi AIqama from\nhis mother that A'isha, the wife of the Prophet, may Allah bless him\nand grant him peace, said, \"Abu Jahm ibn Hudhayfa gave the Messenger\nof Allah, may Allah bless him and grant him peace, a fine striped\ngarment from Syria and he did the prayer in it. When he had finished\nhe said, 'Give this garment back to Abu Jahm. I lookedat its stripes\nin the prayer and they almost distracted me.' \"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 502190,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402200,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "19.00",
        "babName": " Looking in the Prayer at What Distracts You from It",
        "hadithNumber": 73,
        "hadithText": "<p>\nMalik related to me from Hisham ibn Urwa from his father that the\nMessenger of Allah, may Allah bless him and grant him peace, wore a\nfine striped garment f rom Syria, and then gave it to Abu Jahm and\ntook a plain, rough, garment in return. Abu Jahm asked, \"Messenger of\nAllah! Why?\" He said, \"I looked at its stripes in the prayer.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 502200,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402210,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "19.00",
        "babName": " Looking in the Prayer at What Distracts You from It",
        "hadithNumber": 74,
        "hadithText": "<p>\nMalik related to me from Abdullah ibn Abi Bakr that Abu Talha al-\nAnsari was praying in his garden when a wild pigeon flew in and began\nto fly to and fro trying to find a way out. The sight was pleasing to\nhim and he let his eyes follow the bird for a time and then he went\nback to his prayer but could not remember how much he had prayed. He\nsaid, \"A trial has befallen me in this property of mine.\" So he came\nto the Messenger of Allah, may Allah bless him and grant him peace,\nand mentioned the trial that had happened to him in his garden and\nsaid, \"Messenger of Allah, it is a sadaqa for Allah, so dispose of it\nwherever you wish.\"\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 502210,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 402220,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer",
        "babNumber": "19.00",
        "babName": " Looking in the Prayer at What Distracts You from It",
        "hadithNumber": 75,
        "hadithText": "<p>\nYahya related to me from Malik from Abdullah ibn Abi Bakr that a\nman from the Ansar was praying in a garden of his in Quff, one of the\nvalleys of Madina, during the date season and the palms' branches were\nweighed down with fruit on all sides. He looked at them and what he\nsaw of their fruits amazed him. Then he went back to his prayer and he\ndid not know how much he had prayed. He said, \"A trial has befallen me\nin this property of mine.\" So he went toUthman ibn Affan, who was the\nkhalifa at the time, and mentioned it to him and said, \"It is sadaqa,\nso give it away in the paths of good.\" Uthman ibn Affan sold it for\nfifty thousand and so that property became known as the Fifty.\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 502220,
        "last_updated": "2012-04-26 14:00:00"
    }
]