[
    {
        "englishURN": 412960,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 30,
        "bookName": "Suckling",
        "babNumber": "1.00",
        "babName": " Suckling of the Young",
        "hadithNumber": 1,
        "hadithText": "<p>\nYahya related to me from Malik from Abdullah ibn Abi Bakr from\nAmra bint Abd ar-Rahman that A'isha, umm al-muminin informed her that\nthe Messenger of Allah, may Allah bless him and grant him peace, was\nwith her and she heard the voice of a man asking permission to enter\nthe room of Hafsa. A'isha said that she had said, \"Messenger of Allah!\nThere is a man asking permission to enter your house!\" The Messenger\nof Allah, may Allah bless him and grant him peace, said, \"I think it\nis so-and-so\" (referring to a paternal uncle of Hafsa by suckling).\nA'isha said, \"Messenger of Allah! If so-and-so were alive (referring\nto her paternal uncle by suckling) could he enter where I am?\" The\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"Yes. Suckling makes haram as birth makes haram.\"\n</p></b>",
        "bookID": "30.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 512740,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 412970,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 30,
        "bookName": "Suckling",
        "babNumber": "1.00",
        "babName": " Suckling of the Young",
        "hadithNumber": 2,
        "hadithText": "<p>\nYahya related to me from Malik from Hisham ibn Urwa from his\nfather that A'isha, umm al-muminin said, \"My paternal uncle by\nsuckling came to me and I refused to give him permission to enter\nuntil I had asked the Messenger of Allah, may Allah bless him and\ngrant him peace, about it. The Messenger of Allah, may Allah bless him\nand grant him peace, came and I asked him about it. He said, 'He is\nyour paternal uncle, so give him permission.' So I said, 'Messenger of\nAllah! The woman nursed me not the man.' He said, 'He is your paternal\nuncle, so let him enter.' \"\n</p>\n<p>\nA'isha said, \"That was after the\nveil had been imposed on us.\"\n</p>\n<p>\nA'isha added, \"What is haram by\nbirth is made haram by suckling.\"\n</p></b>",
        "bookID": "30.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 512750,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 412980,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 30,
        "bookName": "Suckling",
        "babNumber": "1.00",
        "babName": " Suckling of the Young",
        "hadithNumber": 3,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab from Urwa ibn az-\nZubayr that A'isha umm al-muminin told him that Aflah, the brother of\nAbu'l-Quays came and asked permission to visit her after the veil had\nbeen lowered, and he was her paternal uncle by suckling. She said, \"I\nrefusedto give him permission to enter. When the Messenger of Allah,\nmay Allah bless him and grant him peace, came, I told him about what I\nhad done, and he ordered me to give him permission to enter.\"\n</p></b>",
        "bookID": "30.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 512760,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 412990,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 30,
        "bookName": "Suckling",
        "babNumber": "1.00",
        "babName": " Suckling of the Young",
        "hadithNumber": 4,
        "hadithText": "<p>\nYahya related to me from Malik from Thawr ibn Zayd ad-Dili that\nAbdullah ibn Abbas said, \"The milk which a child under two years old\nsucks, even if it is only one suck, makes the foster relatives haram.\"\n</p></b>",
        "bookID": "30.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 512770,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 413000,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 30,
        "bookName": "Suckling",
        "babNumber": "1.00",
        "babName": " Suckling of the Young",
        "hadithNumber": 5,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab from Amr ibn ash-\nSharid that Abdullah ibn Abbas was asked whether, if a man had two\nwives, and one of them nursed a slave-boy, and the other had nursed a\nslave-girl, could the slave-boy marry the slave-girl. He said, \"No.\nThe husband is the same.\"\n</p></b>",
        "bookID": "30.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 512780,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 413010,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 30,
        "bookName": "Suckling",
        "babNumber": "1.00",
        "babName": " Suckling of the Young",
        "hadithNumber": 6,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid, \"There is no kinship by suckling except for a person who is\nnursed when he is small. There is no kinship by suckling over the age\nof two years.\"\n</p></b>",
        "bookID": "30.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 512790,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 413020,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 30,
        "bookName": "Suckling",
        "babNumber": "1.00",
        "babName": " Suckling of the Young",
        "hadithNumber": 7,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that Salim ibn Abdullah\nibn Umar informed him that A'isha umm al-muminin sent him away while\nhe was being nursed to her sister Umm Kulthum bint Abi Bakr as-Siddiq\nand said, \"Suckle him ten times so that he can come in to see me.\"\n</p>\n<p>\nSalim said, \"Umm Kulthum nursed me three times and then fell\nill, so that she only nursed me three times. I could not go in to see\nA'isha because Umm Kulthum did not finish for me the ten times.\"\n</p></b>",
        "bookID": "30.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 512800,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 413030,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 30,
        "bookName": "Suckling",
        "babNumber": "1.00",
        "babName": " Suckling of the Young",
        "hadithNumber": 8,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that Safiyya bint Abi\nUbayd told him that Hafsa, umm al-muminin, sent Asim ibn Abdullah ibn\nSad to her sister Fatima bint Umar ibn al-Khattab for her to suckle\nhim ten times so that he could come in to see her. She did it, so he\nused to come in to see her.\n</p></b>",
        "bookID": "30.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 512810,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 413040,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 30,
        "bookName": "Suckling",
        "babNumber": "1.00",
        "babName": " Suckling of the Young",
        "hadithNumber": 9,
        "hadithText": "<p>\nYahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nthat his father told him that A'isha, the wife of the Prophet, may\nAllah bless him and grant him peace, admitted those whom her sisters\nand the daughters of her brother had nursed, and she did not admit\nthose who were nursed by the wives of her brothers.\n</p></b>",
        "bookID": "30.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 512820,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 413050,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 30,
        "bookName": "Suckling",
        "babNumber": "1.00",
        "babName": " Suckling of the Young",
        "hadithNumber": 10,
        "hadithText": "<p>\nYahya related to me from Malik that Ibrahim ibn Uqba asked Said\nibn al-Musayyab about suckling. Said said, \"All that occurs in the\nfirst two years, even if it is only a drop, makes haram. Whatever is\nafter two years, is only food that is eaten.\"\n</p>\n<p>\nIbrahim ibn\nUqba said, ''Then I asked Urwa ibn az-Zubayr and he told me the same\nas what Said ibn al-Musayyab said.\"\n</p></b>",
        "bookID": "30.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 512830,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 413070,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 30,
        "bookName": "Suckling",
        "babNumber": "2.00",
        "babName": " Suckling of Older People",
        "hadithNumber": 12,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab that he was asked\nabout the suckling of an older person. He said, ''Urwa ibn az-Zubayr\ninformed me that Abu Hudhayfa ibn Utba ibn Rabia, one of the\ncompanions of the Messenger of Allah, may Allah bless him and grant\nhim peace, who was present at Badr, adopted Salim (who is called\nSalim, the mawla of Abu Hudhayfa) as the Messenger of Allah, may Allah\nbless him and grant him peace, adopted Zayd ibn Haritha. He thought of\nhim as his son, and Abu Hudhayfa married him to his brother's sister,\nFatima bint al-Walid ibn Utba ibn Rabia, who was at that time among\nthe first emigrants. She was one of the best unmarried women of the\nQuraysh. When Allah the Exalted sent down in His Book what He sent\ndown about Zayd ibn Haritha, 'Call them after their true fathers. That\nis more equitable in the sight of Allah. If you do not know who their\nfathers were then they are your brothers in the deen and your mawali,'\n(Sura 33 ayat 5) people in this position were traced back to their\nfathers. When the father was not known, they were traced to their\nmawla.\n</p>\n<p>\n\"Sahla bint Suhayl who was the wife of Abu Hudhayfa,\nand one of the tribe of Amr ibn Luayy, came to the Messenger of Allah,\nmay Allah bless him and grant him peace, and said, 'Messenger of\nAllah! We think of Salim as a son and he comes in to see me while I am\nuncovered. We only have one room, so what do you think about the\nsituation?' The Messenger of Allah, may Allah bless him and grant him\npeace, said, 'Give him five drinks of your milk and he will be mahram\nby it.' She then saw him as a foster son. A'isha umm al-muminin took\nthat as a precedent for whatever men she wanted to be able to come to\nsee her. She ordered her sister, Umm Kulthum bint Abi Bakr as-Siddiq\nand the daughters of her brother to give milk to whichever men she\nwanted to be able to come in to see her. The rest of the wives of the\nProphet, may Allah bless him and grant him peace, refused to let\nanyone come in to them by such nursing. They said, 'No! By Allah! We\nthink that what the Messenger of Allah, may Allah bless him and grant\nhim peace, ordered Sahla bint Suhayl to do was only an indulgence\nconcerning the nursing of Salim alone. No! By Allah! No one will come\nin upon us by such nursing!'\n</p>\n<p>\n\"This is what the wives of the\nProphet, may Allah bless him and grant him peace, thought about the\nsuckling of an older person.\"\n</p></b>",
        "bookID": "30.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 512860,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 413080,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 30,
        "bookName": "Suckling",
        "babNumber": "2.00",
        "babName": " Suckling of Older People",
        "hadithNumber": 13,
        "hadithText": "<p>\nYahya related to me from Malik that Abdullah ibn Dinar said, \"A\nman came to Abdullah ibn Umar when I waswith him at the place where\njudgments were given and asked him about the suckling of an older\nperson. Abdullah ibn Umar replied, 'A man came to Umar ibn al-Khattab\nand said, 'I have a slave-girl and I used to have intercourse with\nher. My wife went to her and suckled her. When I went to the girl, my\nwife told me to watch out, because she had suckled her!' Umar told him\nto beat his wife and to go to his slave-girl because kinship by\nsuckling was only by the suckling of the young.' \"\n</p></b>",
        "bookID": "30.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 512870,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 413090,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 30,
        "bookName": "Suckling",
        "babNumber": "2.00",
        "babName": " Suckling of Older People",
        "hadithNumber": 14,
        "hadithText": "<p>\nYahya related to me from Malik from Yahya ibn Said that a man\nsaid to Abu Musa al-Ashari, \"I drank some milk from my wife's breasts\nand it went into my stomach.\" Abu Musa said, \"I can only but think\nthat she is haram for you.\" Abdullah ibn Masud said, \"Look at what\nopinion you are giving the man.\" Abu Musa said, \"Then what do you\nsay?\" Abdullah ibn Masud said, \"There is only kinship by suckling in\nthe first two years.\"\n</p>\n<p>\nAbu Musa said, \"Do not ask me about\nanything while this learned man is among you.\"\n</p></b>",
        "bookID": "30.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 512880,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 413100,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 30,
        "bookName": "Suckling",
        "babNumber": "3.00",
        "babName": " Suckling in General",
        "hadithNumber": 15,
        "hadithText": "<p>\nYahya related to me from Malik from Abdullah ibn Dinar from\nSulayman ibn Yasar and from Urwa ibn az-Zubayr from A'isha umm al-\nmuminin, that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \" What is haram by birth is haram by suckling.\"\n</p></b>",
        "bookID": "30.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 512890,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 413110,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 30,
        "bookName": "Suckling",
        "babNumber": "3.00",
        "babName": " Suckling in General",
        "hadithNumber": 16,
        "hadithText": "<p>\nYahya related to me from Malik that Muhammad ibn Abd ar-Rahman\nibn Nawfal said, ''Urwa ibn az-Zubayr informed me from A'isha umm al-\nmuminin that Judama bint Wahb al-Asadiyya informed her that she heard\nthe Messenger of Allah, may Allah bless him and grant him peace, say,\n'I intended to prohibit ghila but I remembered that the Greeks and\nPersians do that without it causing any injury to their children.' \"\n</p>\n<p>\nMalik explained, \"Ghila is that a man has intercourse with\nhis wife while she is suckling.\"\n</p></b>",
        "bookID": "30.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 512900,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 413120,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 30,
        "bookName": "Suckling",
        "babNumber": "3.00",
        "babName": " Suckling in General",
        "hadithNumber": 17,
        "hadithText": "<p>\nYahya related to me from Malik from Abdullah ibn Abi Bakr ibn\nHazm from Amra bint Abd ar-Rahman that A'isha, the wife of the\nProphet, may Allah bless him and grant him peace, said, \"Amongst what\nwas sent down of the Qur'an was 'ten known sucklings make haram' -\nthen it was abrogated by 'five known sucklings'. When the Messenger of\nAllah, may Allah bless him and grant him peace, died, it was what is\nnow recited of the Qur'an.\"\n</p>\n<p>\nYahya said that Malik said, \"One\ndoes not act on this.\"\n</p></b>",
        "bookID": "30.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 512910,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 413061,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 30,
        "bookName": "Suckling",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 11,
        "hadithText": "<p>\nYahya related to me from Malik that Yahya ibn Said said that he\nheard Said ibn al-Musayyab say, \"Suckling is only while the child is\nin the cradle. If not, it does not cause flesh and blood relations.\"\n</p></b>",
        "bookID": "30.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 512840,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 413062,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 30,
        "bookName": "Suckling",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 11,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab that he said,\n\"Suckling however little or much, makes haram. Kinship by suckling\nmakes men mahram.\"\n</p>\n<p>\nYahya said that he had heard Malik say,\n\"Suckling, however little or much when it is in the first two years,\nmakes haram. As for what is after the first two years, little or much,\nit does not make anything haram. It is like food.\"\n</p></b>",
        "bookID": "30.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 512850,
        "last_updated": "2012-04-26 14:00:00"
    }
]