[
    {
        "englishURN": 415740,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "1.00",
        "babName": " Stoning",
        "hadithNumber": 1,
        "hadithText": "<p>\nMalik related to me from Nafi that Abdullah ibn Umar said, \"The\nJews came to the Messenger of Allah, may Allah bless him and grant him\npeace, and mentioned to him that a man and woman from among them had\ncommitted adultery. The Messenger of Allah, may Allah bless him and\ngrant him peace, asked them, 'What do you find in the Torah about\nstoning?' They said, 'We make their wrong action known and flog them.'\nAbdullah ibn Salam said, 'You have lied! It has stoning for it, so\nbring the Torah.' They spread it out and one of them placed his hand\nover the ayat of stoning. Then he read what was before it and what was\nafter it. Abdullah ibn Salam told him to lift his hand. He lifted his\nhand and there was the ayat of stoning. They said, 'He has spoken the\ntruth, Muhammad. The ayat of stoning is in it.' So the Messenger of\nAllah, may Allah bless him and grant him peace, gave the order and\nthey were stoned . \"\n</p>\n<p>\nAbdullah ibn Umar added, \"I saw the man\nleaning over the woman to protect her from the stones.\"\n</p>\n<p>\nMalik\ncommented, \"By leaning he meant throwing himself over her so that the\nstones fell on him.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515020,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415750,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "1.00",
        "babName": " Stoning",
        "hadithNumber": 2,
        "hadithText": "<p>\nMalik related to me from Yahya ibn Said from Said ibn al-Musayyab\nthat a man from the Aslam tribe came to Abu Bakr as-Siddiq and said to\nhim, \"I have committed adultery.\" Abu Bakr said to him, \"Have you\nmentioned this to anyone else?\" He said, \"No.\" Abu Bakr said to him,\n\"Then cover it up with the veil of Allah. Allah accepts tawba from his\nslaves.\" His self was still unsettled, so he went to Umar ibn al-\nKhattab. He told him the same as he had said to Abu Bakr, and Umar\ntold him the same as Abu Bakr had said to him. His self was still not\nsettled so he went to the Messenger of Allah, may Allah bless him and\ngrant him peace, and said to him, \"I have committed adultery,\"\ninsistently. The Messenger of Allah, may Allah bless him and grant him\npeace, turned away from him three times. Each time the Messenger of\nAllah, may Allah bless him and grant him peace, turned away from him\nuntil it became too much. The Messenger of Allah, may Allah bless him\nand grant him peace, questioned his family, \"Does he have an illness\nwhich affects his mind, or is he mad?\" They said, \"Messenger of Allah,\nby Allah, he is well.\" The Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"Unmarried or married?\" They said, \"Married,\nMessenger of Allah.\" The Messenger of Allah, may Allah bless him and\ngrant him peace, gave the order and he was stoned.\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515030,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415760,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "1.00",
        "babName": " Stoning",
        "hadithNumber": 3,
        "hadithText": "<p>\nMalik related to me from Yahya ibn Said that Said ibn al-Musayyab\nsaid, \"I have heard that the Messenger of Allah, may Allah bless him\nand grant him peace, said to a man from the Aslam tribe called Hazzal,\n'Hazzal, had you veiled him with your cloak, it would have been better\nfor you.' \"\n</p>\n<p>\nYahya ibn Said said, \"I related this hadith in an\nassembly among whom was Yazid ibn Nuaym ibn Hazzal al-Aslami. Yazid\nsaid, 'Hazzal was my grandfather. This hadith is true.' \"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515040,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415770,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "1.00",
        "babName": " Stoning",
        "hadithNumber": 4,
        "hadithText": "<p>\nMalik related to me that Ibn Shihab informed him that a man\nconfessed that he had committed adultery in the time of the Messenger\nof Allah, may Allah bless him and grant him peace, and he testified\nagainst himself four times, so the Messenger of Allah, may Allah bless\nhim and grant him peace, gave the order and he was stoned.\n</p>\n<p>\nIbn Shihab said, \"Because of this a man is to be taken for his own\nconfession against himself.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515050,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415780,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "1.00",
        "babName": " Stoning",
        "hadithNumber": 5,
        "hadithText": "<p>\nMalik related to me from Yaqub ibn Zayd ibn Talha from his father\nZayd ibn Talha that Abdullah ibn Abi Mulayka informed him that a woman\ncame to the Messenger of Allah, may Allah bless him and grant him\npeace, and informed him that she had committed adultery and was\npregnant. The Messenger of Allah, may Allah bless him and grant him\npeace, said to her, \"Go away until you give birth.\" When she had given\nbirth, she came to him. The Messenger of Allah, may Allah bless him\nand grant him peace, said to her, \"Go away until you have suckled and\nweaned the baby.\" When she had weaned the baby, she came to him. He\nsaid, \"Go and entrust the baby to someone.\" She entrusted the baby to\nsomeone and then came to him. He gave the order and she was stoned.\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515060,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415790,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "1.00",
        "babName": " Stoning",
        "hadithNumber": 6,
        "hadithText": "<p>\nMalik related to me from Ibn Shihab from Ubaydullah ibn Abdullah\nibn Utba ibn Masud that Abu Hurayra and Zayd ibn Khalid al-Juhani\ninformed him that two men brought a dispute to the Messenger of Allah,\nmay Allah bless him and grant him peace. One of them said, \"Messenger\nof Allah! Judge between us by the Book of Allah!\" The other said, and\nhe was the wiser of the two, \"Yes, Messenger of Allah. Judge between\nus by the Book of Allah and give me permission to speak.\" He said,\n\"Speak.\" He said, \"My son was hired by this person and he committed\nfornication with his wife. He told me that my son deserved stoning,\nand I ransomed him for one hundred sheep and a slave-girl. Then I\nasked the people of knowledge and they told me that my son deserved to\nbe flogged with one hundred lashes and exiled for a year, and they\ninformed me that the woman deserved to be stoned.\" The Messenger of\nAllah, may Allah bless him and grant him peace, said, \"By him in whose\nHand myself is, I will judge between you by the Book of Allah. As for\nyour sheep and slave girl, they should be returned to you. Your son\nshould have one hundred lashes and be exiled for a year.\" He ordered\nUnays al-Aslami to go to the wife of the other man and to stone her if\nshe confessed . She confessed and he stoned her.\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515070,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415800,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "1.00",
        "babName": " Stoning",
        "hadithNumber": 7,
        "hadithText": "<p>\nMalik related to me from Suhayl ibn Abi Salih from his father\nfrom Abu Hurayra that Sad ibn Ubada said to the Messenger of Allah,\nmay Allah bless him and grant him peace, \"What do you think I should\ndo if I were to find a man with my wife? Should I leave him there\nuntil I had brought four witnesses?\" The Messenger of Allah, may Allah\nbless him and grant him peace, said, \"Yes.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515080,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415810,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "1.00",
        "babName": " Stoning",
        "hadithNumber": 8,
        "hadithText": "<p>\nMalik related to me from Ibn Shihab from Ubaydullah ibn Abdullah\nibn Utba ibn Masud that Abdullah ibn Abbas said, \"I heard Umar ibn al-\nKhattab say, 'Stoning is in the Book of Allah for those who commit\nadultery, men or women when they are muhsan and when there is clear\nproof of pregnancy or a confession.' \"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515090,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415820,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "1.00",
        "babName": " Stoning",
        "hadithNumber": 9,
        "hadithText": "<p>\nMalik related to me from Yahya ibn Said from Sulayman ibn Yasar\nfrom Abu Waqid al-Laythi that a man came to Umar ibn al-Khattab while\nhe was in ash-Sham . He mentioned to him that he had found a man with\nhis wife Umar sent Abu Waqid al-Laythi to the wife to question her\nabout that. He came to her while there were women around her and\nmentioned to her what her husband had mentioned to Umar ibn al-\nKhattab, and informed her that she would not be punished on his word\nand began to suggest to her by that, that she should retract. She\nrefused to retract and held firm to confession. Umar gave the order\nand she was stoned.\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515100,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415830,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "1.00",
        "babName": " Stoning",
        "hadithNumber": 10,
        "hadithText": "<p>\nMalik related to me that Yahya ibn Said heard Said ibn al-\nMusayyab say, \"When Umar ibn al-Khattab came from Mina, he made his\ncamel kneel at al-Abtah, and then he gathered a pile of small stones\nand cast his cloak over them and dropped to the ground. Then he raised\nhis hands to the sky and said, 'O Allah! I have become old and my\nstrength has weakened. My flock is scattered. Take me to You with\nnothing missed out and without having neglected anything.' Then he\nwent to Madina and addressed the people. He said, 'People! Sunan have\nbeen laid down for you. Obligations have been placed upon you. You\nhave been left with a clear way unless you lead people astray right\nand left.' He struck one of his hands on the other and then said,\n'Take care lest you destroy the ayat of stoning so that one will say,\n\"We do not find two hadds in the Book of Allah.\" The Messenger of\nAllah, may Allah bless him and grant him peace, stoned, so we have\nstoned. By He in Whose Hand my self is, had it not been that people\nwould say that Umar ibn al-Khattab has added to the Book of Allah ta-\nala, we would have written it, \"The full-grown man and the full-grown\nwoman, stone them absolutely.\" We have certainly recited that.'\"\n</p>\n<p>\nMalik said, \"Yahya ibn Said said Said ibn al-Musayyab said,\n'Dhu'l-Hijja had not passed before Umar was murdered, may Allah have\nmercy on him.' \"\n</p>\n<p>\nYahya said that he had heard Malik say, \"As\nfor his words 'The full-grown man and the full-grown woman' he meant,\n'The man and the woman who have been married, stone them absolutely.'\n\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515110,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415840,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "1.00",
        "babName": " Stoning",
        "hadithNumber": 11,
        "hadithText": "<p>\nMalik related to me that he had heard that Uthman ibn Affan was\nbrought a woman who had given birth after six months and he ordered\nher to be stoned. Ali ibn Abi Talib said to him, \"She does not deserve\nthat. Allah, the Blessed, the Exalted, says in His Book, 'Their\ncarrying and weaning is thirty months,' (Sura 46 ayat 15) and he said,\n'Mothers suckle their children for two full years for whoever wishes\nto complete the suckling.' (Sura 2 ayat 233) Pregnancy can then be six\nmonths, so she does not deserve to be stoned.\" Uthman ibn Affan sent\nfor her and found that she had already been stoned.\n</p>\n<p>\nMalik\nrelated to me that he asked Ibn Shihab about someone who committed\nsodomy. Ibn Shihab said, \"He is to be stoned, whether or not he is\nmuhsan.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515120,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415850,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "2.00",
        "babName": " Self-Confession of Fornication",
        "hadithNumber": 12,
        "hadithText": "<p>\nMalik related to me from Zayd ibn Aslam that a man confessed to\nfornication in the time of the Messenger of Allah, may Allah bless him\nand grant him peace. The Messenger of Allah, may Allah bless him and\ngrant him peace, called for a whip, and he was brought a broken whip.\nHe said, \"Above this,\" and he was brought a new whip whose knots had\nnot been cut yet. He said, \"Below this,\" and he was brought a whip\nwhich had been used and made flexible. The Messenger of Allah, may\nAllah bless him and grant him peace, gave the order and he was\nflogged. Then he said, \"People! The time has come for you to observe\nthe limits of Allah. Whoever has had any of these ugly things befall\nhim should cover them up with the veil of Allah. Whoever reveals to us\nhis wrong action, we perform what is in the Book of Allah against\nhim.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515130,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415860,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "2.00",
        "babName": " Self-Confession of Fornication",
        "hadithNumber": 13,
        "hadithText": "<p>\nMalik related to me from Nafi that Safiyya bint Abi Ubayd\ninformed him that a man who had had intercourse with a virgin slave-\ngirl and made her pregnant was brought to Abu Bakr as-Siddiq. He\nconfessed to fornication, and he was not muhsan. Abu Bakr gave the\norder and he was flogged with the hadd punishment. Then he was\nbanished to Fadak, (thirty miles from Madina).\n</p>\n<p>\nMalik spoke\nabout a person who confessed to fornication and then retracted it and\nsaid, \"I didn't do it. I said that for such-and-such a reason,\" and he\nmentioned the reason. Malik said, \"That is accepted from him and the\nhadd is not imposed on him. That is because the hadd is what is for\nAllah, and it is only applied by one of two means, either by a clear\nproof which establishes guilt or by a confession which is persisted in\nso that the hadd is imposed. If someone persists in his confession,\nthe hadd is imposed on him.\"\n</p>\n<p>\nMalik said, \"I have not seen the\npeople of knowledge exiling slaves who have committed adultery.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515140,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415870,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "3.00",
        "babName": " The Hadd for Fornication",
        "hadithNumber": 14,
        "hadithText": "<p>\nMalik related to me from Ibn Shihab from Ubaydullah ibn Abdullah\nibn Utba ibn Masud from Abu Hurayra and Zayd ibn Khalid al-Juhani that\nthe Messenger of Allah, may Allah bless him and grant him peace, was\nasked about a slave-girl who committed fornication and was not\nmuhsana. He said, \"If she commits fornication, then flog her. If she\ncommits fornication again, then flog her, and if she commits\nfornication again, then sell her, if only for a rope.\"\n</p>\n<p>\nIbn\nShihab added, \"I don't know whether it was three or four times.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515150,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415880,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "3.00",
        "babName": " The Hadd for Fornication",
        "hadithNumber": 15,
        "hadithText": "<p>\nMalik related to me from Nafi that a slave was in charge of the\nslaves in the khumus and he forced a slave-girl among those slaves\nagainst her will and had intercourse with her. Umar ibn al-Khattab had\nhim flogged and banished him, and he did not flog the slave-girl\nbecause the slave had forced her.\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515160,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415890,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "3.00",
        "babName": " The Hadd for Fornication",
        "hadithNumber": 16,
        "hadithText": "<p>\nMalik related to me from Yahya ibn Said that Sulayman ibn Yasar\ninformed him that Abdullah ibn Abbas ibn Abi Rabia al-Makhzumi said,\n\"Umar ibn al-Khattab gave me orders about the slaves of Quraysh and we\nflogged some of the slave-girls of the muslim lands fifty times each\nfor fornication.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515170,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415900,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "4.00",
        "babName": " Rape",
        "hadithNumber": 16,
        "hadithText": "<p>\nMalik said, \"The position with us about a woman who is found to\nbe pregnant and has no husband and she says, 'I was forced,' or she\nsays, 'I was married,' is that it is not accepted from her and the\nhadd is inflicted on her unless she has a clear proof of what she\nclaims about the marriage or that she was forced or she comes bleeding\nif she was a virgin or she calls out for help so that someone comes to\nher and she is in that state or what resembles it of the situation in\nwhich the violation occurred.\" He said, \"If she does not produce any\nof those, the hadd is inflicted on her and what she claims of that is\nnot accepted from her.\"\n</p>\n<p>\nMalik said, \"A raped woman cannot\nmarry until she has restored herself by three menstrual periods.\"\n</p>\n<p>\nHe said, \"If she doubts her periods, she does not marry until she\nhas freed herself of that doubt.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 0,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415910,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "5.00",
        "babName": " The Hadd for Slander, Denial and Insinuation",
        "hadithNumber": 17,
        "hadithText": "<p>\nMalik related to me from Abu'z-Zinad that he said, ''Umar ibn Abd\nal-Aziz flogged a slave with eighty lashes for slander.\"\n</p>\n<p>\nAbu'z-Zinad said, \"I asked Abdullah ibn Amir ibn Rabia about that. He\nsaid, 'I saw Umar ibn al-Khattab, Uthman ibn Affan, the Khalifs, and\nso on, and I did not see any of them flog a slave more than forty\nlashes for slander.' \"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515180,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415920,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "5.00",
        "babName": " The Hadd for Slander, Denial and Insinuation",
        "hadithNumber": 18,
        "hadithText": "<p>\nMalik related to me from Zurayq ibn Hakim al-Ayli that a man\ncalled Misbah asked his son for help and he thought him unnecessarily\nslow. When the son came, his father said to him, \"O fornicator.\"\nZurayq said, \"So the son asked me to help him against the father. When\nI wanted to flog him, his son said, 'By Allah, if you flog him, I will\nacknowledge that I have committed fornication.' When he said that, the\nsituation was confused for me, so I wrote about it to Umar ibn Abd al-\nAziz who was the governor at that time, and I mentioned it to him.\nUmar wrote me to permit his pardon.\"\n</p>\n<p>\nZurayq said, \"I wrote to\nUmar ibn Abd al-Aziz also, 'What do you think about a man who is\nslandered or his parents are slandered and both or only one of them\nare dead?' He said, Umar wrote to me, 'If he forgives, his pardon is\npermitted for himself. If his parents are slandered and one or both of\nthem are dead, take the judgement of the Book of Allah for it unless\nhe wants to veil it.' \"\n</p>\n<p>\nYahya said, \"I heard Malik say, 'That\nis because the slandered man might fear that if that is unveiled about\nhim, a clear proof might be established. If it is according to what we\nhave described, his pardon is permitted.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515190,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415930,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "5.00",
        "babName": " The Hadd for Slander, Denial and Insinuation",
        "hadithNumber": 19,
        "hadithText": "<p>\nMalik related to me from Hisham ibn Urwa that his father said\nthat there was only one hadd against a man who slandered a group of\npeople.\n</p>\n<p>\nMalik said, \"If they are on separate occasions there\nis still only one hadd against him.\"\n</p>\n<p>\nMalik related to me from\nAbu'r-Rijal Muhammad ibn Abd ar-Rahman ibn Haritha ibn an-Numan al-\nAnsari, then from the Banu'n-Najar from his mother Amra bint Abd ar-\nRahman that two men cursed each other in the time of Umar ibn al-\nKhattab. One of them said to the other, \" By Allah, my father is not\nan adulterer and my mother is not an adulteress.\" Umar ibn al-Khattab\nasked advice about that. One person said, \"He has praised his father\nand mother.\" Another said, \"His father and mother have praise other\nthan this. We think that he is to be flogged with the hadd.\" So Umar\nflogged him with the hadd of eighty lashes.\n</p>\n<p>\nMalik said,\n\"There is no hadd in our view except for slander, denial or\ninsinuation, in which one sees that the speaker intends by that denial\nor slander. Then the hadd is completely imposed on the one who said\nit.\"\n</p>\n<p>\nMalik said, \"What is done in our community when a man\ndenies that another man is from his father, is that he deserves the\nhadd. If the mother who is denied is a slave, then he deserves the\nhadd as well. '\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515201,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415940,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "6.00",
        "babName": " What has No Hadd for It",
        "hadithNumber": 19,
        "hadithText": "<p>\nMalik said, \"The best of what is heard about a slave-girl whom a\nman has intercourse with while he has a partner in her is that the\nhadd is not inflicted on him and the child is connected to him. When\nthe slave-girl becomes pregnant, her value is estimated and he gives\nhis partners their shares of the price and the slave-girl is his. That\nis what is done among us.\"\n</p>\n<p>\nMalik said about a man who made\nhis slave-girl halal to a man that if the one for whom she was made\nhalal had intercourse with her, her value was estimated on the day he\nhad intercourse with her and he owed that to her owner whether or not\nshe conceived. The hadd was averted from him by that. If she conceived\nthe child was connected to him.\n</p>\n<p>\nMalik said about a man who\nhad intercourse with his son's or daughter's slave-girl, \"The hadd is\naverted from him and he owes the estimated value of the slave-girl\nwhether or not she conceives.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 0,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415950,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "6.00",
        "babName": " What has No Hadd for It",
        "hadithNumber": 20,
        "hadithText": "<p>\nMalik related to me from Rabia ibn Abi Abd ar-Rahman that Umar\nibn al-Khattab spoke about a man who went out with his wife's slave-\ngirl on a journey and had intercourse with her and then the wife\nbecame jealous and mentioned that to Umar ibn al-Khattab. Umar\nquestioned him about it. He said, \"She gave her to me.\" Umar said,\n\"Bring me a clear proof or I will stone you.\" Rabia added, \"The wife\nconfessed that she had given her to him.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515220,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415960,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "7.00",
        "babName": " What Obliges Cutting Off the Hand",
        "hadithNumber": 21,
        "hadithText": "<p>\nMalik related to me from Nafi from Abdullah ibn Umar that the\nMessenger of Allah, may Allah bless him and grant him peace, cut off\nthe hand of a man who stole a shield whose price was three dirhams.\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515230,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415970,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "7.00",
        "babName": " What Obliges Cutting Off the Hand",
        "hadithNumber": 22,
        "hadithText": "<p>\nYahya related to me from Malik from Abdullah ibn Abd ar-Rahman\nabu Husayn al-Makki that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"The hand is not cut off for fruit hanging\non the tree and for sheep kept in the mountains. So when they are\ntaken from the fold or the place where the fruit is dried, a hand is\ncut off for whatever reaches the price of a shield.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515240,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415980,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "7.00",
        "babName": " What Obliges Cutting Off the Hand",
        "hadithNumber": 23,
        "hadithText": "<p>\nYahya related to me from Malik from Abdullah ibn Abi Bakr from\nhis father from Amra bint Abd ar-Rahman that a thief stole a citron in\nthe time of Uthman Uthman ibn Affan ordered its value to be estimated\nand it was estimated at three dirhams at the rate of exchange of\ntwelve dirhams for the dinar, so Uthman cut off his hand.\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515250,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 415990,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "7.00",
        "babName": " What Obliges Cutting Off the Hand",
        "hadithNumber": 24,
        "hadithText": "<p>\nYahya related to me from Malik from Yahya ibn Said from Amra bint\nAbd ar-Rahman that A'isha, the wife of the Prophet, may Allah bless\nhim and grant him peace, said, \"It has not been a long time for me and\nI have not forgotten. A thief's hand is cut off for a quarter of a\ndinar and upwards.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515260,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 416000,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "7.00",
        "babName": " What Obliges Cutting Off the Hand",
        "hadithNumber": 25,
        "hadithText": "<p>\nYahya related to me from Malik from Abdullah ibn Abi Bakr ibn\nHazim that Amra bint Abd ar-Rahman said, \"A'isha, the wife of the\nProphet, may Allah bless him and grant him peace, went out to Makka\nand she had two girl mawlas of hers and a slave belonging to the sons\nof Abdullah ibn Abi Bakr as-Siddiq . She sent a figured cloak with the\ntwo mawlas which was sewn up in a piece of green cloth.\"\n</p>\n<p>\nAmra\ncontinued, \"The slave took it and unstitched it and took out the\ncloak. In its place, he put some felt or skin and sewed it up again.\nWhen the mawla girls came to Madina, they gave it to his people. When\nthey opened it, they found felt in it and did not find the cloak. They\nspoke to the two women and they spoke to A'isha, the wife of the\nProphet, may Allah bless him and grant him peace, or they wrote to her\nand suspected the slave. The slave was asked about it and confessed.\nA'isha, the wife of the Prophet, may Allah bless him and grant him\npeace, gave the order and his hand was cut off. A'isha said, 'A\nthief's hand is cut off for a quarter of a dinar and upwards.' \"\n</p>\n<p>\nMalik said, \"The limit I prefer above which cutting off the hand\nis obliged is three dirhams, whether the exchange is high or low. That\nis because the Messenger of Allah, may Allah bless him and grant him\npeace, cut off the hand of a thief for a shield whose value was three\ndirhams, and Uthman ibn Affan cut off the hand of a thief for a citron\nwhich was estimated at three dirhams. This is what I prefer of what I\nhave heard on the matter.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515270,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 416010,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "8.00",
        "babName": " Cutting Off the Hands of Runaway Slaves Who Steal",
        "hadithNumber": 26,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that a slave of Abdullah\nibn Umar stole while he was a runaway. Abdullah ibn Umar sent him to\nSaid ibn al-As, who was the amir of Madina, to cut off his hand. Said\nrefused to cut off his hand. He said, \"The hand of a runaway slave is\nnot cut off when he steals.\" Abdullah ibn Umar said to him, \"In what\nBook of Allah did you find this?\" Then Abdullah ibn Umar gave the\norder, and his hand was cut off.\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515280,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 416020,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "8.00",
        "babName": " Cutting Off the Hands of Runaway Slaves Who Steal",
        "hadithNumber": 27,
        "hadithText": "<p>\nYahya related to me from Malik that Zurayq ibn Hakim informed him\nthat he had a runaway slave who had stolen. He said, \"The situation\nwas obscure for me, so I wrote to Umar ibn Abd al-Aziz to ask him\nabout it. He was the governor at that time. I informed him that I had\nheard that if a runaway slave stole while he was a fugitive, his hand\nwas not cut off. 'Umar ibn Abd al-Aziz wrote to contradict my letter,\n'You wrote to me that you have heard that when the runaway slave\nsteals, his hand is not cut off. Allah, the Blessed, the Exalted, says\nin His Book, 'The thief, male and female, cut off the hands of both,\nas a recompense for what they have earned, and an exemplary punishment\nfrom Allah. Allah is Mighty, Wise.' (Sura 5 ayat 41) When his theft\nreaches a quarter of a dinar, and upwards, his hand is cut off.' \"\n</p>\n<p>\nYahya related to me from Malik that he had heard that al-\nQasim ibn Muhammad and Salim ibn Abdullah and Urwa ibn az-Zubayr said,\n\"When a runaway slave steals something for which cutting off the hand\nis obliged, his hand is cut off.\"\n</p>\n<p>\nMalik said, \"The way of\ndoing things amongst us about which there is no dispute is that when\nthe runaway slave steals that for which cutting off the hand is\nobliged, his hand is cut off.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515291,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 416030,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "9.00",
        "babName": " Intercession Cut Off for Thieves when Cases Reach the Sultan",
        "hadithNumber": 28,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab from Safwan ibn\nAbdullah ibn Safwan that it was said to Safwan ibn Umayya, \"Whoever\ndoes not do hijra is ruined.\" So Safwan ibn Umayya went to Madina and\nslept in the mosque with his cloak as a pillow. A thief came and took\nhis cloak and Safwan grabbed hold of the thief and brought him to the\nMessenger of Allah, may Allah bless him and grant him peace. The\nMessenger of Allah, may Allah bless him and grant him peace, said to\nhim, \"Did you steal this cloak?\" He said, \"Yes.\" So the Messenger of\nAllah, may Allah bless him and grant him peace, ordered that his hand\nbe cut off. Safwan said to him, \"I did not intend this. It is his as\nsadaqa.\" The Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Why didn't you do it before bringing him to me?\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515310,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 416040,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "9.00",
        "babName": " Intercession Cut Off for Thieves when Cases Reach the Sultan",
        "hadithNumber": 29,
        "hadithText": "<p>\nYahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman\nthat az-Zubayr ibn al-Awwam came across a man who had taken hold of a\nthief and was intending to take him to the Sultan. Az-Zubayr ibn al-\nAwwam interceded for him to let him go. He said, \"No. Not until I take\nhim to the Sultan.\" Az-Zubayr said, \"When you reach the Sultan with\nhim, Allah curses the one who intercedes and the one who accepts the\nintercession.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515320,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 416050,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "10.00",
        "babName": " General Section on Cutting Off the Hand",
        "hadithNumber": 30,
        "hadithText": "<p>\nYahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nfrom his father that a man from Yemen who had his hand and foot cut\noff came and went before Abu Bakr as-Siddiq and complained to him that\nthe governor of the Yemen had wronged him, and the man used to pray\npart of the night. Abu Bakr said, \"By your father, your night is not\nthe night of a thief.\" Then they missed a necklace of Asma bint Umays,\nthe wife of Abu Bakr as-Siddiq. The man came to go around with them\nlooking for it. He said, \"O Allah! You are responsible for the one who\ninvaded the people of this good house by night!\" They found the\njewelry with a goldsmith. He claimed that the maimed man had brought\nit to him. The maimed man confessed or it was testified against him.\nAbu Bakr as-Siddiq ordered that his left hand be cut off. Abu Bakr\nsaid, \"By Allah! His dua against himself is more serious, as far as I\nam concerned, than his theft.\"\n</p>\n<p>\nYahya said that Malik said,\n\"What is done among us about the person who steals several times and\nis then called to reckoning, is that only his hand is cut off for all\nhe stole when the hadd has not been applied againsthim. If the hadd\nhas been applied against him before that, and he steals what obliges\ncutting off, then the next limb is cut off.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515330,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 416060,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "10.00",
        "babName": " General Section on Cutting Off the Hand",
        "hadithNumber": 31,
        "hadithText": "<p>\nYahya related to me from Malik that Abu'z-Zinad informed him that\na governor of Umar ibn Abd al-Aziz took some people in battle and had\nnot killed any of them. He wanted to cut off their hands or kill them,\nso he wrote to Umar ibn Abd al-Aziz about that Umar ibn Abd al-Aziz\nwrote to him, \"Better to take less than that.\"\n</p>\n<p>\nYahya said\nthat he heard Malik say, \"What is done among us about a person who\nsteals the goods of people which are placed under guard in the\nmarkets, and their owners put them in their containers and store them\ntogether is that if anyone steals any of that from where it is kept,\nand its value reaches that for which cutting off the hand is obliged,\nhis hand must be cut off, whether or not the owner of the goods is\nwith his goods and whether it is night or day.\"\n</p>\n<p>\nMalik said\nabout some one who stole something for which cutting off the hand was\nobliged and then what he stole was found with him and he returned it\nto its owner, \"His hand is cut off.\"\n</p>\n<p>\nMalik said, \"If someon\nsays, 'How can his hand be cut off when the goods have been taken from\nhim and returned to their owner?', it is because he is in the same\nposition as the wine drinker when the smell of the wine is found on\nhis breath and he is not drunk. He is flogged with the hadd.\n</p>\n<p>\n\"The hadd is imposed for drinking wine even if it does not make the\nman intoxicated. That is because he drank it to become intoxicated. It\nis the same as that with cutting off the hand of the thief for theft\nwhen it is taken from him, even if he has not profited from it and it\nwas returned to its owner. When he stole it, he stole it to take it\naway.\"\n</p>\n<p>\nMalik said that if some people came to a house and\nrobbed it together, and then they left with a sack or box or a board\nor basket or the like of that which they carried together, and when\nthey took it out of its guarded place, they carried it together, and\nthe price of what they took reached that for which cutting off the\nhand was obliged, and that was three dirhams and upwards, each of them\nhad his hand cut off.\n</p>\n<p>\n\"If each of them takes out something by\nhimself, whoever of them takes out something whose value reaches three\ndirhams and upwards must have his hand cut off. If any of them takes\nout something whose value does not reach three dirhams, he does not\nhave his hand cut off.\"\n</p>\n<p>\nYahya said that Malik said, \"What is\ndone among us is that when a man's house is locked and he is the only\none living in it, cutting off the hand is not obliged against the one\nwho steals something from it until he takes it out of the house\ncompletely. That is because all of the house is a place of custody. If\nsomeone other than him lives in the house and each of them locks his\ndoor, and it is a place of custody for each of them, whoever steals\nanything from the apartments of that house must have his hand cut off\nwhen he leaves the apartment and goes into the main house. He has\nremoved it from its place of custody to another place and he must have\nhis hand cut off.\"\n</p>\n<p>\nMalik said, \"What is done in our community\nabout a slave who steals from the property of his master is that if he\nis not in service and among those trusted in the house and he enters\nsecretly and steals from his master something that for which cutting\noff the hand is obliged, his hand is not cut off. It is like that with\na slave-girl when she steals from her master's property. Her hand is\nnot cut off.\"\n</p>\n<p>\nMalik then spoke about a slave who was not in\nservice and not one of those trusted in the house, and he entered\nsecretly and stole from the property of his master's wife that for\nwhich cutting off the hand was obliged. He said, \"His hand is cut\noff.\"\n</p>\n<p>\n\"It is like that with the wife's slave-girl when she\ndoes not serve her or her husband nor is she trusted in the house and\nshe enters secretly and steals from her mistress's property that for\nwhich cutting off the hand is obliged. Her hand is not cut off.\"\n</p>\n<p>\n\"It is like that with the wife's slave-girl who is not in her\nservice and is not trusted in the house and she enters secretly and\nsteals from the property of her mistress's husband something for which\ncutting off the hand is obliged. Her hand is cut off.\"\n</p>\n<p>\nIt is\nlike that with the man who steals from his wife's goods or the wife\nwho steals from her husband's goods something for which cutting off\nthe hand is obliged. If the thing which one of them steals from his\nspouse's property is in a room other than the room which they both\nlock for themselves, or it is in a place of custody in a room other\nthan the room which they are in, whichever of them steals something\nfor which cutting off the hand is obliged, their hand should be cut\noff.\"\n</p>\n<p>\nMalik spoke about a small child and a foreigner who\ndoes not speak clearly. He said, \"If they are robbed of something from\nits place of custody or from under a lock, the one who stole it has\nhis hand cut off. If the property is outside of its place of custody\nor locked room(when it is stolen), the one who robbed them does not\nhave his hand cut off. It is then in the position of sheep stolen from\nthe mountain and uncut fruit hanging on the trees \"\n</p>\n<p>\nMalik\nsaid, \"What is done among us about a person who robs graves is that if\nwhat he takes from the grave reaches what cutting off the hand is\nobliged for, his hand is cut off . That is because the grave is a\nplace of custody for what is in it just as houses are a place of\ncustody for what is in them. \"\n</p>\n<p>\nMalik added, \"Cutting off the\nhand is not obliged for him until he takes it out of the grave.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515340,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 416070,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "11.00",
        "babName": " Things for Which the Hand is Not Cut Off",
        "hadithNumber": 32,
        "hadithText": "<p>\nYahya related to me from Malik from Yahya ibn Said from Muhammad\nibn Yahya ibn Habban that a slave stole a small palm from a man's\ngarden and planted it in the garden of his master. The owner of the\npalm went out looking for the palm and found it. He asked for help\nagainst the slave from Marwan ibn al-Hakam. Marwan jailed the slave\nand wanted to cut off his hand. The master of the slave rushed off to\nRafi ibn Khadij and asked him about it. Rafi informed him that he\nheard the Messenger of Allah, may Allah bless him and grant him peace,\nsay, \"The hand is not cut off for fruit or palm pith.\" The man said,\n\"Marwan ibn al-Hakam has taken a slave of mine and wants to cut off\nhis hand. I would like you to go with me to him so you can tell him\nwhat you heard from the Messenger of Allah, may Allah bless him and\ngrant him peace.\" So, Rafi went with him to Marwan ibn al-Hakam. He\nsaid, \"Did you arrest a slave for this?\" He said, \"Yes.\" He said,\n\"What will you do with him?\" He said, \"I want to cut off his hand.\"\nRafi said to him, \"I heard the Messenger of Allah, may Allah bless him\nand grant him peace, say, 'The hand is not cut off for dates or palm\npith.' Marwan therefore ordered the slave to be released.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515350,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 416080,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "11.00",
        "babName": " Things for Which the Hand is Not Cut Off",
        "hadithNumber": 33,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab from as-Sa'ib ibn\nYazid that Abdullah ibn Amr ibn al-Hadrami brought a slave of his to\nUmar ibn al-Khattab and said to him, \"Cut off the hand of this slave\nof mine. He has stolen.\" Umar said to him, \"What did he steal?\" He\nsaid, \"He stole a mirror belonging to my wife. Its value was sixty\ndirhams.\" Umar said, \"Let him go. His hand is not to be cut off. He is\nyour servant who has stolen your belongings.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515360,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 416090,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "11.00",
        "babName": " Things for Which the Hand is Not Cut Off",
        "hadithNumber": 34,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab that Marwan ibn\nal-Hakam was brought a man who had snatched some goods and he wanted\nto cut off his hand. He sent to Zayd ibn Thabit to ask him about it.\nZayd ibn Thabit said to him, \"The hand is not cut off for what is\nstolen by chance, openly, in haste.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515370,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 416100,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "Hudud",
        "babNumber": "11.00",
        "babName": " Things for Which the Hand is Not Cut Off",
        "hadithNumber": 35,
        "hadithText": "<p>\nYahya related to me from Malik that Yahya ibn Said said that Abu\nBakr ibn Muhammad ibn Amr ibn Hazm informed him that he had taken a\nNabatean who had stolen some iron rings and jailed him in order to cut\noff his hand. Amra bint Abd ar-Rahman sent a girl mawla to him called\nUmayya. Abu Bakr said that she had come to him while he was among the\npeople and said that his aunt Amra sent word to him saying, \"Son of my\nbrother! You have taken a Nabatean for something insignificant which\nwas mentioned to me. Do you want to cut off his hand?\" He had said,\n\"Yes.\" She said, ''Amra says to you not to cut off the hand except for\na quarter of a dinar and upwards.\"\n</p>\n<p>\nAbu Bakr added, \"So I let\nthe Nabatean go.\"\n</p>\n<p>\nMalik said, \"The generally agreed on way of\ndoing things among us about the confession of slaves is that if a\nslave confesses something against himself, the hadd and punishment for\nit is inflicted on his body. His confession is accepted from him and\none does not suspect that he would inflict something on himself.\"\n</p>\n<p>\nMalik said, \"As for the one of them who confesses to a matter\nwhich will incur damages agains this master, his confession is not\naccepted against his master.\"\n</p>\n<p>\nMalik said, \"One does not cut\noff the hand of a hireling or a man who is with some people to serve\nthem, if he robs them, because his state is not the state of a thief.\nHis state is the state of a treacherous one. The treacherous one does\nnot have his hand cut off.\"\n</p>\n<p>\nMalik said about a person who\nborrows something and then denies it, \"His hand is not cut off. He is\nlike a man who owes a debt to another man and denies it. He does not\nhave his hand cut off for what he has denied.\"\n</p>\n<p>\nMalik said,\n\"The generally agreed-on way of dealing among us, with the thief who\nis found in a house and has gathered up goods and has not taken them\nout, is that his hand is not cut off. That is like the man who places\nwine before him to drink it and does not do it. The hadd is not\nimposed on him. That is like a man who sits with a woman and desires\nto have haram intercourse with her and does not do it and he does not\nreach her. There is no hadd against that either.\"\n</p>\n<p>\nMalik said,\n\"The generally agreed-on way of doing things among us is that there is\nno cutting off the hand for what is taken by chance, openly and in\nhaste, whether or not its price reaches that for which the hand is cut\noff.\"\n</p></b>",
        "bookID": "41.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 515380,
        "last_updated": "2012-04-26 14:00:00"
    }
]