[
    {
        "englishURN": 417910,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 51,
        "bookName": "Hair",
        "babNumber": "1.00",
        "babName": " The Sunna on Hair",
        "hadithNumber": 1,
        "hadithText": "<p>\nYahya related to me from Malik from Abu Bakr ibn Nafi from his\nfather Nafi from Abdullah ibn Umar that the Messenger of Allah, may\nAllah bless him and grant him peace, ordered the moustache to be\ntrimmed and the beard to be left.\n</p></b>",
        "bookID": "51.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 517130,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 417920,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 51,
        "bookName": "Hair",
        "babNumber": "1.00",
        "babName": " The Sunna on Hair",
        "hadithNumber": 2,
        "hadithText": "<p>\nYahya related to me from Malik from Ibn Shihab that Humay ibn Abd\nar-Rahman ibn Awf heard Muawiya ibn Abi Sufyan say from the mimbar in\nthe year that he performed the hajj, holding a lock of hair (i.e. a\nhairpiece) which he took from one of his guards, \"People of Madina!\nWhere are your learned men? I heard the Messenger of Allah, may Allah\nbless him and grant him peace, forbid the like of this, saying, 'The\nBanu Israil were destroyed when their women started to use this.' \"\n</p></b>",
        "bookID": "51.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 517140,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 417930,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 51,
        "bookName": "Hair",
        "babNumber": "1.00",
        "babName": " The Sunna on Hair",
        "hadithNumber": 3,
        "hadithText": "<p>\nYahya related to me from Malik that Ziyad ibn Sad heard Ibn\nShihab say, \"The Messenger of Allah, may Allah bless him and grant him\npeace, let his hair hang down his forehead as Allah willed, and\nafterwards he parted it.\"\n</p>\n<p>\nMalik said, \"There is no harm in a\nman's looking at the hair of his son's wife or the hair of his wife's\nmother.\"\n</p></b>",
        "bookID": "51.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 517150,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 417940,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 51,
        "bookName": "Hair",
        "babNumber": "1.00",
        "babName": " The Sunna on Hair",
        "hadithNumber": 4,
        "hadithText": "<p>\nYahya related to me from Malik from Nafi that Abdullah ibn Umar\ndisapproved of castration and said, \"The completeness of the created\nform is in the testicles.\"\n</p></b>",
        "bookID": "51.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 517160,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 417950,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 51,
        "bookName": "Hair",
        "babNumber": "1.00",
        "babName": " The Sunna on Hair",
        "hadithNumber": 5,
        "hadithText": "<p>\nYahya related to me from Malik that Safwan ibn Sulaym heard that\nthe Prophet, may Allah bless him and grant him peace, said, \"I and the\none who guards the orphan, whether for himself or for someone else,\nwill be like these two in the Garden, when he has taqwa,\" indicating\nhis middle and index fingers.\n</p></b>",
        "bookID": "51.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 517170,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 417960,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 51,
        "bookName": "Hair",
        "babNumber": "2.00",
        "babName": " Caring for the Hair",
        "hadithNumber": 6,
        "hadithText": "<p>\nYahya related to me from Malik from Yahya ibn Said that Abu\nQatada al-Ansari said to the Messenger of Allah, may Allah bless him\nand grant him peace, \"I have a lot of hair which comes down to my\nshoulders, shall I comb it?'' The Messenger of Allah. may Allah bless\nhim and grant him peace, said, \"Yes, and honour it.\" Sometimes Abu\nQatada oiled it twice in one day because the Messenger of Allah, may\nAllah bless him and grant him peace, said to him. \"Honour it.\"\n</p></b>",
        "bookID": "51.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 517180,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 417970,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 51,
        "bookName": "Hair",
        "babNumber": "2.00",
        "babName": " Caring for the Hair",
        "hadithNumber": 7,
        "hadithText": "<p>\nYahya related to me from Malik from Zayd ibn Aslam that Ata ibn\nYasar told him that the Messenger of Allah, may Allah bless him and\ngrant him peace, was in the mosque when a man came in with dishevelled\nhair and beard. The Messenger of Allah. may Allah bless him and grant\nhim peace, motioned with his hand that he should be sent out to groom\nhis hair and beard. The man did so and then returned. The Messenger of\nAllah, may Allah bless him and grant him peace, said, \"Isn't this\nbetter than that one of you should come with his head dishevelled, as\nif he were a shaytan?\"\n</p></b>",
        "bookID": "51.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 517190,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 417980,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 51,
        "bookName": "Hair",
        "babNumber": "3.00",
        "babName": " Dyeing the Hair",
        "hadithNumber": 8,
        "hadithText": "<p>\nYahya related to me from Malik that Yahya ibn Said said that\nMuhammad ibn Ibrahim at-Taymi had informed him that Abu Salama ibn Abd\nar-Rahman said \"Abd ar-Rahman ibn al-Aswad ibn Abdal-Yaghuth used to\nsit with us and he had a white beard and hair. One day he came to us\nand he had dyed them red, and the people said to him, 'This is\nbetter.' He said. 'A'isha the wife of the Prophet, may Allah bless him\nand grant him peace, sent her slave girl Nukhayla to me yesterday. She\nswore that my hair would be dyed and she informed me that Abu Bakr as-\nSiddiq used to dye his hair.' \"\n</p>\n<p>\nYahya said that he heard\nMalik say about dyeing the hair black, 'I have not heard anything\ncertain on that, and other colours than that are preferable to me.\"\n</p>\n<p>\nYahya said, \"Not to dye at all is permitted, Allah willing,\nand there is no constraint on people concerning it.\"\n</p>\n<p>\nYahya\nsaid that he had heard Malik say, \"There is no clear indication in\nthis hadith that the Messenger of Allah, may Allah bless him and grant\nhim peace, did not dye his hair. Had the Messenger of Allah, may Allah\nbless him and grant him peace, dyed his hair, A'isha would have sent a\nmessage to that effect to Abd ar-Rahman ibn al-Aswad.\"\n</p></b>",
        "bookID": "51.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 517200,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 417990,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 51,
        "bookName": "Hair",
        "babNumber": "4.00",
        "babName": " Taking Refuge",
        "hadithNumber": 9,
        "hadithText": "<p>\nYahya related to me from Malik that Yahya ibn Said said that he\nhad heard that Khalid ibn al-Walid said to the Messenger of Allah, may\nAllah bless him and grant him peace, \"I have nightmares.\" The\nMessenger of Allah, may Allah bless him and grant him peace, said to\nhim, \"Say, 'I seek refuge with the complete words of Allah from His\nanger and His punishment and the evil of His slaves, and from the evil\nsuggestions of the shayatin and from their being present (at death).'\n\"\n</p>\n<p>\nAudhu bi kalimati' llahi't-tammati min ghadabihi wa iqabihi\nwa sharri ibadihi wa min hamazati' sh-shayatin wa an yahdurun.\n</p></b>",
        "bookID": "51.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 517210,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 418000,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 51,
        "bookName": "Hair",
        "babNumber": "4.00",
        "babName": " Taking Refuge",
        "hadithNumber": 10,
        "hadithText": "<p>\nYahya related to me from Malik that Yahya ibn Said said, \"When\nthe Messenger of Allah, may Allah bless him and grant him peace, was\ntaken on the Night Journey, he saw an evil jinn seeking him with a\ntorch of fire. Whenever the Messenger of Allah, may Allah bless him\nand grant him peace, turned, he saw him. Jibril said to him, 'Shall I\nteach you some words to say? When you say them, his torch will be put\nout and will fall from him.' The Messenger of Allah, may Allah bless\nhim and grant him peace, said, 'Yes, indeed.' Jibril said, 'Say, 'I\nseek refuge with the Noble Face of Allah and with the complete words\nof Allah which neither the good person nor the corrupt can exceed,\nfrom the evil of what descends from the sky and the evil of what\nascends in it, and from the evil of what is created in the earth and\nthe evil of what comes out of it, and from the trials of the night and\nday, and from the visitations of the night and day, except for one\nthat knocks with good, O Merciful!\" \"'\n</p>\n<p>\nAudhu bi wajhi'llahi'\nl-karim wa bi kalimati'llahi't-tammati. Allati la yujawazu hunna barra\nwa la fajir, min sharri ma yanzil min as-sama, wa sharri ma yaruju\nfiha, wa sham ma dhara' fi'l-ard, wa sharri ma yakhruju minha, wa min\nfitani'l-layli wa'n-nahar, wa min tawariqi'l-layli wa'n-nahar illa\ntariqan yatruq bikhayr ya Rahman!\n</p></b>",
        "bookID": "51.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 517220,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 418010,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 51,
        "bookName": "Hair",
        "babNumber": "4.00",
        "babName": " Taking Refuge",
        "hadithNumber": 11,
        "hadithText": "<p>\nYahya related to me from Malik from Suhayl ibn Abi Salih from his\nfather from Abu Hurayra that a man of the Aslam tribe said, \"I did not\nsleep last night.\" The Messenger of Allah, may Allah bless him and\ngrant him peace, said to him, \"For what reason?\" He said, \"A scorpion\nbit me.\" The Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Had you said in the evening, 'I seek refuge with the\ncomplete words of Allah from the evil of what He has created, 'it\nwould not have happened.\"\n</p>\n<p>\nAudhu bi kalimati'llahi't-tammati\nmin sharri ma khalaq .\n</p></b>",
        "bookID": "51.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 517230,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 418020,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 51,
        "bookName": "Hair",
        "babNumber": "4.00",
        "babName": " Taking Refuge",
        "hadithNumber": 12,
        "hadithText": "<p>\nYahya related to me from Malik from Summayy, the mawla of Abu\nBakr from al-Qa'qa ibn Hakim that Kab al-Ahbar said, \"Had it not been\nfor some words which I said, the jews would have made me into a\ndonkey.\" Someone asked him what they were. He said, \"I seek refuge\nwith the immense Face of Allah - there is nothing greater than it -\nand with the complete words of Allah which neither the good person nor\nthe corrupt can exceed and with all the most beautiful names of Allah,\nwhat I know of them and what I do not know, from the evil of what He\nhas created and originated and multiplied.\"\n</p>\n<p>\nAudhu bi\nwajhi'llahi l-adheem aladhee laysa shay'un adham minh, wa bi\nkalimati'llahi't-tammati, alatee la yujawizu hunna barra wa la fajir,\nwa bi asma'illahi'l-husna kulliha ma alamtu minha wa ma lam alam, min\nsharri ma khalaqa wa bara'a wa dhara'a.\n</p></b>",
        "bookID": "51.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 517240,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 418030,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 51,
        "bookName": "Hair",
        "babNumber": "5.00",
        "babName": " Those who Love Each Other in Allah",
        "hadithNumber": 13,
        "hadithText": "<p>\nYahya related to me from Malik from Abdullah ibn Abd ar-Rahman\nibn Mamar from Abu'l-Hubab Said ibn Yasar that Abu Hurayra said, \"The\nMessenger of Allah, may Allah bless him and grant him peace, said,\n'Allah, the Blessed, the Exalted, will say on the Day of Rising,\n\"Where are those who loved each other for My majesty? Today I will\nshade them in My shade on the day when there is no shade except My\nshade.\" \"'\n</p></b>",
        "bookID": "51.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 517250,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 418040,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 51,
        "bookName": "Hair",
        "babNumber": "5.00",
        "babName": " Those who Love Each Other in Allah",
        "hadithNumber": 14,
        "hadithText": "<p>\nYahya related to me from Malik from Khubayb ibn Abd ar-Rahman al-\nAnsari from Hafs ibn Asim that either Abu Said al-Khudri or Abu\nHurayra said, \"The Messenger of Allah, may Allah bless him and grant\nhim peace, said, 'There are seven whom Allah will shade in His shade\non the day on which there is no shade except His shade: a just imam, a\nyouth who grows up worshipping Allah, a man whose heart is attached to\nthe mosque when he leaves it until he returns to it, two men who love\neach other in Allah and meet for that and part for that, a man who\nremembers Allah when he is alone and his eyes overflow with tears, a\nman who refuses the approaches of a noble, beautiful woman, saying \"I\nfear Allah,\" and a man who gives sadaqa and conceals it so that his\nleft hand does not know what his right hand gives.' \"\n</p></b>",
        "bookID": "51.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 517260,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 418060,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 51,
        "bookName": "Hair",
        "babNumber": "5.00",
        "babName": " Those who Love Each Other in Allah",
        "hadithNumber": 16,
        "hadithText": "<p>\nYahya related to me from Malik that he had heard that Abdullah\nibn Abbas said, \"Equanimity, gentleness, and good behaviour are one\ntwenty-fifth of prophecy.\"\n</p></b>",
        "bookID": "51.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 517290,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 418051,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 51,
        "bookName": "Hair",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 15,
        "hadithText": "<p>\nYahya related to me from Malik from Suhayl ibn Abi Salih from his\nfather from Abu Hurayra that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"If Allah loves a slave, he says to\nJibril, 'I love so-and-so, so love him,' so Jibril loves him and then\ncalls out to the people of heaven, 'Allah loves so-and-so, so love\nhim,' and the people of heaven love him, and then acceptance is placed\nin the Earth for him.\" When Allah is angry with a slave, Malik said,\n\"I consider that he says the like of that about His anger.\"\n</p></b>",
        "bookID": "51.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 517270,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 418052,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 51,
        "bookName": "Hair",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 15,
        "hadithText": "<p>\nYahya related to me from Malik from Abu Hazim ibn Dinar that Abu Idris\nal-Khawlani said, \"I entered the Damascus mosque and there was a young\nman with a beautiful mouth and white teeth sitting with some people.\nWhen they disagreed about something, they referred it to him and\nproceeded from his statement. I inquired about him, and it was said,\n'This is Muadh ibn Jabal.' The next day I went to the noon-prayer, and\nI found that he had preceded me to the noon prayer and I found him\npraying.\"\n</p>\n<p>\nAbu Idris continued, \"I waited for him until he had\nfinished the prayer. Then I came to him from in front of him and\ngreeted him and said, 'By Allah! I love you for Allah!' He said, 'By\nAllah?' I said, 'By Allah.' He said, 'By Allah?' I said, 'By Allah.'\nHe said, 'By Allah?' I said, 'By Allah.' \"\n</p>\n<p>\nHe continued, \"He\ntook me by the upper part of my cloak and pulled me to him and said,\n'Rejoice! I heard the Messenger of Allah, may Allah bless him and\ngrant him peace, say, \"Allah, the Blessed and Exalted, said, 'My love\nis obliged for those who love each other in Me, and those who sit with\neach other in Me, and those who visit each other in Me, and those who\ngive to each other generously in Me.' \" ' \"\n</p></b>",
        "bookID": "51.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 517280,
        "last_updated": "2012-04-26 14:00:00"
    }
]