[
    {
        "englishURN": 1800010,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
        "babNumber": "1.00",
        "babName": "Chapter 01. The Noble Features Of Rasoolullah",
        "hadithNumber": 1,
        "hadithText": "Anas ibn Malik (ra) reports:\n“Allah’s Messenger (Allah bless him and give him peace) was neither very tall of stature, nor short. His skin was neither pale white, nor tawny, and his hair was neither crisply curled, nor lank. Allah (Exalted is He) sent him [to serve as His Messenger] at the end of forty years of life, so he stayed in Mecca for ten years and in Medina for ten years, and Allah took him unto Himself at the end of sixty years, with fewer than twenty white hairs on his head and his beard.”</b>",
        "bookID": "1.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "Sayyidina Rasullullah (Sallallahu alaihe wasallam) was of a medium stature, but slightly taller. This has been reported in a narration from Sayyidina Hind bin Abi Haalah (Radiallahu Anhu) and others. An objection may arise concerning these two hadeeth, that it is stated in one hadeeth that when Sayyidina Rasullullah (Sallallahu alaihe wasallam) used to stand up in a group, he appeared to be the tallest among them. This was not due to his height, but was a result of a Mu'jizah (Miracle). In the manner that no one had reached a higher status than Sayyidina Rasullullah (Sallallahu alaihe wasallam) in `Kamalaate Ma'nawiyyah', (super intellectual status) likewise in the `Surah Zaahiri' (outward appearance) no one could excel him.It is stated in the hadeeth under discussion that Sayyidina Rasullullah (Sallallahu alaihe wasallam) lived for ten years in Makkah Mukarramah after nubuwwah (prophethood). For this reason it is stated that he attained the age of sixty years. This is contrary to what has been reported in the other ahaadith, where it is stated that Sayyidina Rasullullah (Sallallahu alaihe wasallam) lived there for thirteen years and attained the age of sixty three years. In some ahaadith it is stated that Sayyidina Rasullullah (Sallallahu alaihe wasallam) attained the age of sixty five years. At the end of this kitaab all three ahaadith will be quoted. Imaam Bukhari (R.A.) says:\"Most narrations show that Rasullullah (Sallallahu alaihe wasallam) lived for sixty three years.\" The ulama (scholars) have summed up these ahaadith in two ways. First, that Sayyidina Rasullullah (Sallallahu alaihe wasallam) received nubuwwah (prophethood) at the age of forty and risaalah three years thereafter, and after that he lived for ten years in Makkah Mukaraamah. According to this, the three years between nubuwwah and risaalah have been in the hadeeth under discussion.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1900010,
        "last_updated": "2021-01-08 12:21:15"
    },
    {
        "englishURN": 1800020,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
        "babNumber": "1.00",
        "babName": "Chapter 01. The Noble Features Of Rasoolullah",
        "hadithNumber": 2,
        "hadithText": "Anas ibn Malik said:\n‘Allah’s Messenger (Allah bless him and give him peace) was of medium height, neither tall nor short. He was of handsome physique, and his hair was neither crisply curled nor smooth, brown of color. When he walked, he used to stride confidently ”</b>",
        "bookID": "1.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "In this hadeeth Sayyidina Anas (Radiallhu Anhu) states that the complexion of Rasullullah (Sallallahu alaihe wasallam) was wheat coloured. In the previous hadith, also narrated by Sayyidina Anas (Radiallahu Anhu), he states that Sayyidina Rasullullah (Sallallahu alaihe wasallam) did not have a wheat-coloured complexion. This has been mentioned in the translation of the hadeeth. Actually, what is derived from the two hadeeth is that Sayyidina Rasullullah (Sallallahu alaihe wasallam) was not of such a dark complexion that decrease the lightness and beauty of a person, but had a radiant and light colour, which slightly wheat-coloured.<br><br>In this hadeeth the word `Yata-kaf-fa-oo' is used regarding the walking of Sayyidina Rasullullah (Sallallahu alaihe wasallam). The scholars interpret this word in several ways. Some say it means to walk at a fast pace. Some are of the opinion that it means to lean a bit forward while walking. Some say it means to lift the leg with force. All three explanations are correct because the walk of Sayyidina Rasullullah (Sallallahu alaihe wasallam) fulfilled all three descriptions and the word also conveys these three meanings. Sayyidina Rasullullah (Sallallahu alaihe wasallam) walked quickly and not like the Romeos of this age who walk like women. It was also the noble habit of Sayyidina Rasullullah (Sallallahu alaihe wasallam) to walk with slight forward inclination of the head and shoulders. He did not walk with chest pushed out with pride. He lifted his legs as men do while walking and did not drag his legs on the ground.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1900020,
        "last_updated": "2021-01-10 16:52:53"
    },
    {
        "englishURN": 1800030,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
        "babNumber": "1.00",
        "babName": "Chapter 01. The Noble Features Of Rasoolullah",
        "hadithNumber": 3,
        "hadithText": "Ibn Ishaq said: “I heard al-Bara’ ibn 'Azib say:\n\"Allah’s Messenger(Allah bless him and give him peace)was neither curly nor lank-haired, of medium height, broad-shouldered, with luxuriant hair reaching the lobes of his ears, wearing a red suit of clothes. I have never seen anything more beautiful than him!”</b>",
        "bookID": "1.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": ":<br>In this hadeeth the word `Rajulun Marbu'un' is used, which if the letter `Jeem' has a dammah (pesh), means a man. This could be correct. This type of word is used in the Arabic language for connecting words, but because no special quality or attribute is derived, some Muhadditheen (scholars of hadeeth) are of the opinion that if the letter `Jeem' has a fatah (zabar) on it, it means something that is between straight and bent. It may also be possible that in this case it refers to the description of the hair of Sayyidina Rasullullah (Sallallahu alaihe wasallam), and as described before, his mubarak (blessed) hair had a slight curl in it. From this hadeeth, some scholars are of the opinion that it is permissible for men to wear red coloured clothing. According to the Hanafis there is a detailed explanation on this subject. Before selecting red clothing, the scholars should be consulted regarding its permissibility.<br><br>The scholars have written that in this hadeeth the Sahabi did not see `anything' more handsome and beautiful than Sayyidina Rasullullah (Sallallahu alaihe wasallam). This is said because besides human beings, the moon, sun, etc. are also included.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1900030,
        "last_updated": "2021-01-10 16:55:59"
    },
    {
        "englishURN": 1800040,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
        "babNumber": "1.00",
        "babName": "Chapter 01. The Noble Features Of Rasoolullah",
        "hadithNumber": 4,
        "hadithText": "Al-Bara’ ibn 'Azib said: \"I have never seen anyone endowed with a lock of hair flowing below the ears, wearing a red suit of clothes, more handsome than Allah’s Messenger (Allah bless him and give him peace). He had some hair touching his shoulders. Broad-shouldered, he was neither short nor tall.”</b>",
        "bookID": "1.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "The description of the hair of Sayyidina Rasullullah (Sallallahu alaihe wasallam) in this hadeeth is different one mentioned before. There it is stated that his hair reached his ear-lobes. In reality there is no difference between the two hadeeth, as the hair does not remain the same length but grows. Sometimes the hair was shortened, sometimes longer hair was kept.",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1900040,
        "last_updated": "2021-01-10 16:57:55"
    },
    {
        "englishURN": 1800050,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
        "babNumber": "1.00",
        "babName": "Chapter 01. The Noble Features Of Rasoolullah",
        "hadithNumber": 5,
        "hadithText": "Ali ibn Abi Talib said: “The Prophet (Allah bless him and give him peace) was neither tall nor short, endowed with sturdy hands and feet, stout head and limbs, and lengthy hair on the chest. When he walked, he inclined forward, as if he were descending a downward slope. I have never seen the like of him, neither before him nor after him.”</b>",
        "bookID": "1.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": ":<br>The use of a sentence like: \"I have not seen anyone like him\", is primarily for emphasis. By describing Sayyidina Rasulullah (Sallallahu alaihe wasallam) in this manner, there is however no exaggeration because the complete beauty of appearance of Sayyidina Rasulullah (Sallallahu alaihe wasallam) cannot be fully described. Munaawi wrote that every person is required to believe that with whatever physical qualities and attributes of Sayyidina Rasulullah (Sallallahu alaihe wasallam) is described, no other person can compare with it. This is not merely a belief. Books on Seerah (History of the Prophet peace be upon him) and ahadeeth are replete with descriptions of his beautiful qualities. Therein it is stated that Allah Ta'aala bestowed fully on the Prophet (peace be upon him) all the inner kamaalat (perfection) and Zaahiri (apparent) beauty. Two verses (couplets) are narrated from Sayyiditina Aa'ishah (Radiallahu Anha), the meaning of which is: \"that if the friends of Zulaikha could see the blessed face of Rasulullah (Sallallahu alaihe wasallam), they would have cut their hearts instead of their hands\". How true! If you wish to read more about the love of the Sahabah (Radiallahu Anhum... male and female... for Sayyidina Rasulullah (Sallallahu alaihe wasallam) read Chapter Eight of my book `Stories of the Sahabah' (Radiallahu Anhum).",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1900050,
        "last_updated": "2021-01-10 17:00:04"
    },
    {
        "englishURN": 1800060,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
        "babNumber": "1.00",
        "babName": "Chapter 01. The Noble Features Of Rasoolullah",
        "hadithNumber": 6,
        "hadithText": "On the authority of 'Umar ibn 'Abdi’llah, the Mawla of Ghufra: 1 have been told by Ibrahim ibn Muhammad, one of the offspring of 'Ali ibn Abi Talib (may Allah be well pleased with him): “When 'Ali described Allah’s Messenger (Allah bless him and give him peace),he said:\n\"Allah’s Messenger (Allah bless him and give him peace) was neither assertively tall, nor reticently short, and he was an average-sized member of the population. His hair was neither crisply curled nor lank; it was loosely curled. He was neither plump nor chubby-cheeked, and in his face there was a rounded quality. He was white with a reddish tinge, dark black-eyed, with long eyelashes. He had splendid kneecaps, elbow joints and shoulder blades, free from hair. He had a strip of hair from the top of the chest to the navel. The palms of his hands and the soles of his feet were thickset. When he walked, he moved as if he were descending a declivity, and when he looked around, he looked around altogether. Between his shoulders was the Seal of Prophethood, for he is the Seal of the Prophets. He was the best of the people in generosity, the most truthful of the people in speech, the gentlest of them in temperament, and the noblest of them in social intercourse. If someone saw him unexpectedly, he was awestruck by him, and if someone came to know him, he loved him. His describer says: “I have never seen the like of him (Allah bless him and give him peace), neither before him nor after him.”</b>",
        "bookID": "1.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1900070,
        "last_updated": "2021-01-12 11:44:16"
    },
    {
        "englishURN": 1800070,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
        "babNumber": "1.00",
        "babName": "Chapter 01. The Noble Features Of Rasoolullah",
        "hadithNumber": 7,
        "hadithText": "Al-Hasan ibn 'Ali (may Allah be well pleased with him and his father) said: “My maternal aunt Hind asked the son of Abu Hala, who was a describer of the finery of Allah’s Messenger (Allah bless him and give him peace), to describe something of it that would be of interest to me, so he said:\nAllah’s Messenger (Allah bless him and give him peace) was an honored dignitary, whose face shone with the radiance of the moon on the night of the full moon. He was taller than medium-sized, and shorter than the slender giant. His head was grand and impressive, with loosely curled hair. If his forelock became divided, he would part it. Otherwise his hair would not cross over his earlobes, and he would let it grow plentiful and long. He was bright of color, broad of forehead, endowed with arched eyebrows, perfect without being conjoined, with a vein between them that anger would cause to pulsate. The bridge of his nose was curved. He had a light that would rise over him, and someone who did not reflect on him would consider him haughty. He was thickly bearded, endowed with smooth cheeks, a wide mouth, cleft teeth, and a delicate strip of hair from the top of the chest to the navel. It was as if his neck were the neck of a statue shaped in pure silver. He was well proportioned in physique, firmly cohesive, with the stomach and the breast in even balance. He was wide-chested, broad-shouldered, endowed with stout limbs and very shiny bare skin. Between the top of the chest and the navel by a strip of hair like a line of writing, while his breasts and stomach were bare apart from that. He had hair on his arms and shoulders and the upper parts of his chest. His forearms were long. He had a sensitive touch of the hand. The palms of his hands and the soles of his feet were thickset. His extremities were well formed [sa’il (or he may have said sha’il)]. The hollows of his soles were very deep-set. His feet were so smooth that water bounced off them. When he left a place, he would go away striding decisively. He would tread inclining forward and walk comfortably. His gait was brisk. When he walked, it was as if he were descending a declivity, and when he looked around, he looked around altogether. He lowered his eyesight, and he spent more time looking at the ground than he did looking at the sky. The majority of his looking was observation. He would urge his Companions to proceed ahead of him, and he would be the first to greet anyone he encountered with the salutation of peace.”</b>",
        "bookID": "1.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": ":<br>The Ulama say that Sayyidina (Sallallahu alaihe wasallam) walked at the back because of his humbleness. According to this humble servant, if this is applied to his journeys it will be more appropriate. It was the noble habit of Sayyidina Rasulullah (Sallallahu alaihe wasallam) are described. Imam Tirmidi has mentioned this Hadith in many chapters where the speech and humility of Sayyidina Rasulullah (Sallallahu alaihe wasallam) are described.",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1900080,
        "last_updated": "2021-01-12 11:50:54"
    },
    {
        "englishURN": 1800080,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
        "babNumber": "1.00",
        "babName": "Chapter 01. The Noble Features Of Rasoolullah",
        "hadithNumber": 8,
        "hadithText": "Simak ibn Harb said: “I heard Jabir ibn Samura say:\n\"Allah’s Messenger (Allah bless him and give him peace) was dali al-fam, ashkal al-'ain, manhus al-'aqib.”\nShu'ba said: “I asked Simak: ‘What is dali al-fam?\" He replied:\"[It means] endowed with a grand and impressive mouth.\" I asked: \"What is ashkal al 'ain?\" He replied: \"[It means] long in the slit of the eye.\" I asked: \"What is manhus al-'aqib?\" He said: \"[It means] endowed with a lean heel.”</b>",
        "bookID": "1.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "It is desirable for Arab men to have wide mouths. According to some a wide mouth means eloquence (fluency of language). The translation adopted in the description of the eyes has been taken from accepted sayings. However in this Hadith, Imam Tirmidi has translated this to mean wide eyes, as a narrator of this hadith has done, which according to the linguists is not correct.",
        "ourHadithNumber": 8,
        "matchingArabicURN": 1900090,
        "last_updated": "2021-01-12 11:57:17"
    },
    {
        "englishURN": 1800090,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
        "babNumber": "1.00",
        "babName": "Chapter 01. The Noble Features Of Rasoolullah",
        "hadithNumber": 9,
        "hadithText": "Jabir ibn Samura said:\n\"I saw Allah’s Messenger (Allah bless him and give him peace) on a cloudless night, and he was wearing a red suit of clothes, so I started looking at him as well as at the moon, for he is indeed more beautiful, in my opinion, than the moon!”</b>",
        "bookID": "1.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 1900100,
        "last_updated": "2021-01-12 11:59:25"
    },
    {
        "englishURN": 1800100,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
        "babNumber": "1.00",
        "babName": "Chapter 01. The Noble Features Of Rasoolullah",
        "hadithNumber": 10,
        "hadithText": "Abu Ishaq said: A man asked al-Bara’ ibn 'Azib: “Was the face of Allah’s Messenger (Allah bless him and give him peace) like the sword?” He said: “No, it was rather like the moon!”</b>",
        "bookID": "1.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "In making a comparison with a sword, it may have meant that Sayyidina Rasulullah (Sallallahu alaihe wasallam) had a long face. However the glitter of a sword has more whiteness than being luminous. For this reason Sayyidina Baraa (Radiallahu anhu) gave the similarity of the full moon, and not that of a sword. All these similarities are approximate descriptions, otherwise even a thousand moons cannot give the brightness of Sayyidina Rasulullah (Sallallahu alaihe wasallam). An Arab poet says: \"If you want to describe a shortcoming of a beloved, then give the beloved a similitude of a full moon. This is enough to insult him.\"",
        "ourHadithNumber": 10,
        "matchingArabicURN": 1900110,
        "last_updated": "2021-01-12 12:00:49"
    },
    {
        "englishURN": 1800110,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
        "babNumber": "1.00",
        "babName": "Chapter 01. The Noble Features Of Rasoolullah",
        "hadithNumber": 11,
        "hadithText": "Abu Huraira (may Allah be well pleased with him) said:\n\"Allah’s Messenger (Allah bless him and give him peace) was white, as if he were fashioned from silver, with loosely curled hair.\"</b>",
        "bookID": "1.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "In the first narration mentioned by Sayyidina Anas (Radiallahu anhu), it is denied that Sayyidina Rasulullah (Sallallahu alaihe wasallam) was very white. From the above hadith, it does not mean that he had white complexion like silver; rather he had a white and reddish complexion, in which the beauty and brightness was overwhelming.",
        "ourHadithNumber": 11,
        "matchingArabicURN": 1900120,
        "last_updated": "2021-01-12 12:01:54"
    },
    {
        "englishURN": 1800120,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
        "babNumber": "1.00",
        "babName": "Chapter 01. The Noble Features Of Rasoolullah",
        "hadithNumber": 12,
        "hadithText": "On the authority of Jabir ibn ‘Abdi’llah, that Allah’s Messenger said (Allah bless him and give him peace):\n\"The Prophets were presented to me, and there was Moses (peace be upon him), a specimen of the men of distinction, as if he were among the men of pure lineage and manly virtue [shanu’a]. I also saw Jesus the son of Mary (peace be upon him), and the nearest I have seen in resemblance to him is 'Urwa ibn Mas’ud. I also saw Abraham (peace be upon him), and the nearest I have seen in resemblance to him is your Companion (meaning himself). I also saw Gabriel (peace be upon him), and the nearest I have seen in resemblance to him is Dihya.”</b>",
        "bookID": "1.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "This was on the night of mi'raaj or in a dream. Imaam Bukhaari (Rahmatullahi alaihe) has narrated both, on the night of mi'raaj and also in a dream. There is no confusion or difficulty in these differences, because he may have seen them on both occasions. The translation of the description of Sayyidina Musa (Alaihis salaam) as having a light body, in my opinion, is made from more accurate sayings. Some Ulama in the translation of this sentence, have expressed other opinions. These three Ambiyaa (Prophets) were described because Sayyidina Musa (Alaihis salaam) and Sayyidina Esa (Alaihis salaam) are the nabis of the Bani Israel and Sayyidina Ebrahim (Alaihis salaam), besides being the great grandfather of Sayyidina Rsulullah (Sallallahu alaihe wasallam), was also accepted by all Arabs.",
        "ourHadithNumber": 12,
        "matchingArabicURN": 1900130,
        "last_updated": "2021-01-12 12:04:05"
    },
    {
        "englishURN": 1800130,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
        "babNumber": "1.00",
        "babName": "Chapter 01. The Noble Features Of Rasoolullah",
        "hadithNumber": 13,
        "hadithText": "Sa'id al-Jariri said: 'I heard Abu Tufail say:\n“I saw the Prophet (Allah bless him and give him peace), and there is no one left on the face of the earth who has seen him, apart from me.” I said: “Describe him for me!” He said: “He was white, handsome, of medium size.”</b>",
        "bookID": "1.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "Sayyidina Abu Tufayl (Radiallahu anhu) was the last one among the Sahabah (Radiallahu anhum) to pass away. He died in the year 110 Hijri. That is why he said, that there was no one left besides him who had seen Rasulullah (Sallallahu alaihe wasallam). The ulama say that he used the phrase `face of the earth' because Sayyidina Esa (Alaihis salaam) is also from the ones who had seen Sayyidina Rasulullah (Sallallahu alaihe wasallam), and is present in the skies (heavens).",
        "ourHadithNumber": 13,
        "matchingArabicURN": 1900140,
        "last_updated": "2021-01-12 12:05:46"
    },
    {
        "englishURN": 1800140,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": "Chapter 01. The Noble Features Of Rasoolullah",
        "babNumber": "1.00",
        "babName": "Chapter 01. The Noble Features Of Rasoolullah",
        "hadithNumber": 14,
        "hadithText": "Ibn 'Abbas said:\nAllah’s Messenger (Allah bless him and give him peace) had a gap between the medial pair of teeth. When he spoke, it seemed as if light were emerging from between his middle teeth.\"</b>",
        "bookID": "1.0",
        "grade1": "Sanad Da'if Jiddan",
        "grade2": "",
        "comments": "According to the Ulama, it is a well known fact that it was something similar to nur which emitted from his teeth. The opinions of Allaamah Munaawi is that it was something sensory, and not a similarity, which emitted miraculously from between the teeth of Rasulullah (Sallallahu alaihe wasallam).<br><br>Everything of his noble features was perfect and beautiful. In the manner that is real and intrinsic beauty had reached its last stage, in the same manner his zaahiri (apparent) beauty had also reached its fullest and proper stage. Allahumma sali 'alaa Sayyidina Muhammadiw wa 'alaa aalihi biqadri husnihi wa jamaalihi.",
        "ourHadithNumber": 14,
        "matchingArabicURN": 1900150,
        "last_updated": "2021-01-12 12:07:19"
    }
]