[
    {
        "englishURN": 1800820,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 11,
        "bookName": "Chapter 11. The Mubarak Ring Of Rasoolullah",
        "babNumber": "11.00",
        "babName": "Chapter 11. The Mubarak Ring Of Rasoolullah",
        "hadithNumber": 82,
        "hadithText": "Anas ibn Malik said:\n“The signet ring of the Prophet (Allah bless him and give him peace) consisted of silver, and its stone was Abyssinian.”</b>",
        "bookID": "11.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "According to the majority of the 'ulama it is permissible to wear a ring made of silver. The Hanafis say it is not permissible to wear a ring made of bronze. iron, steel etc. In the early stages, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam did not have a ring made, until it was known that the kings of Persia and other countries did not accept or take into consideration letters that had no seal (stamp) on them. He had begun sending letters to the kings inviting them to Islaam. A seal (stamp) was made in the sixth or seventh year hijri. The 'ulama give different opinions on the wearing of the ring. Some 'ulama say that it is makruh for any person besides the king and judge to wear a ring. The research of the Hanafi 'ulama (may Allah Increase their number and accept their efforts) in this matter, according to the saying of 'Shaami' is, that it is sunnah for the kings, judges, trustees and those who need a seal. Besides them it is permissible for others, but better not to use it. The reason is evident that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam only made one when it became necessary, before he began sending letters to the kings. This will be mentioned in hadith number six in this chapter. Abu Daawud and others have stated that besides the kings, others are prohibited from wearing a ring. Since it has been proven that many Sahaabah Radiyallahu 'Anhum wore a ring in the presence of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, and in other ahaadith that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam had permitted it, this prohibition will be taken as that which is contrary to a more meritorious and desired act.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1900870,
        "last_updated": "2021-01-20 16:15:17"
    },
    {
        "englishURN": 1800830,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 11,
        "bookName": "Chapter 11. The Mubarak Ring Of Rasoolullah",
        "babNumber": "11.00",
        "babName": "Chapter 11. The Mubarak Ring Of Rasoolullah",
        "hadithNumber": 83,
        "hadithText": "Ibn 'Umar said:\n\"The Prophet (Allah bless him and give him peace) chose a signet ring of silver, so he used to seal [letters] with it, and he would not wear it.”</b>",
        "bookID": "11.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "Sayyidina Rasulullah sallallahu alayhe wasallam wore a ring as has been stated in the ahaadith. The ulama give a few explanations to this hadith. Some have explained that it meant that he did not wear it continuously. Some are of the opinion that Sayyidina Rasulullah sallallahu alayhe wasallam possessed two rings, one had the seal and was used to put a stamp on letters etc. and he did not wear this ring. The other ring was used for wearing. In the same manner, the 'ulama have given many other explanations. According to this humble servant the most accepted explanation is that he did not wear it always.<br><br>It is reported in the hadith that Sayyidina Rasulullah sallallahu alayhe wasallam was once performing salaah, he was wearing a ring on the right hand. While performing salaah, his eyes fell on the ring. After that he stopped wearing the ring.<br><br>In the ahaadith a similar incident is mentioned regarding a printed cloth. While in salaah his sight fell on it. Sayyidina Rasulullah sallallahu alayhe wasallam removed this cloth and wore another one.<br><br>Since the ring was of importance it could not be discarded completely. Therefore he did not generally wear it. This is the nearest (most correct). It will be stated in the sixth hadith of the next chapter that the ring was mostly kept by Sayyidina Mu'ayqeeb radiallahu anhu.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1900880,
        "last_updated": "2021-01-20 16:16:38"
    },
    {
        "englishURN": 1800840,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 11,
        "bookName": "Chapter 11. The Mubarak Ring Of Rasoolullah",
        "babNumber": "11.00",
        "babName": "Chapter 11. The Mubarak Ring Of Rasoolullah",
        "hadithNumber": 84,
        "hadithText": "Anas ibn Malik said:\n“The signet ring of the Prophet (Allah bless him and give him peace) consisted of silver, including its stone.”</b>",
        "bookID": "11.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "This hadith seems to contradict the one where it is mentioned that an Abyssinian stone was inlaid.<br><br>Those who are of the opinion that Sayyidina Rasulullah sallallahu alayhe wasallam had two rings, say that this hadith in context is similar to it being two rings. Bayhaqi and others also hold the same view, and according to him there no is complication.<br><br>Those who are of the opinion that Sayyidina Rasulluahsallallahu alayhe wasallam had one ring, give the explanation, that by Habshi (Abyssinian) it is meant Habshi colour or Habshi style, or the maker of it was a Habshi.<br><br>According to this humble servant the explanation is that there was more than one ring seems correct, because from the hadith it has been proved that at different times Sayyidina Rasulullah sallallahu alayhe wasallam had different rings. Sayyidina Rasulluahsallallahu alayhe wasallam had a ring made for himself. His servant gave him one as a present as is evident from different narrations stated in the book of 'Jam'ul Wasaa-il'.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1900890,
        "last_updated": "2021-01-20 16:17:25"
    },
    {
        "englishURN": 1800850,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 11,
        "bookName": "Chapter 11. The Mubarak Ring Of Rasoolullah",
        "babNumber": "11.00",
        "babName": "Chapter 11. The Mubarak Ring Of Rasoolullah",
        "hadithNumber": 85,
        "hadithText": "Anas ibn Malik said:\n“When Allah’s Messenger (Allah bless him and give him peace) wished to write to the non-Arabs, he was told: ‘The non-Arabs will not accept a letter unless it bears a seal.’\nHe therefore created a signet, and [even now] I can see its whiteness in the palm of his hand.”</b>",
        "bookID": "11.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "The last sentence shows that he remembers this incident well. By whiteness the silver in the ring is referred to.",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1900900,
        "last_updated": "2021-01-20 16:18:25"
    },
    {
        "englishURN": 1800860,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 11,
        "bookName": "Chapter 11. The Mubarak Ring Of Rasoolullah",
        "babNumber": "11.00",
        "babName": "Chapter 11. The Mubarak Ring Of Rasoolullah",
        "hadithNumber": 86,
        "hadithText": "Anas ibn Malik said:\n“The inscription engraved [in Arabic script] on the signet ring of Allah’s Messenger (Allah bless him and give him peace) was: Muhammadun forming one line, Rasulu forming one line, and Allahi forming one line.”</b>",
        "bookID": "11.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "Some 'ulama have written that 'Muhammad Rasulullah' was engraved in such a manner, that the word 'Allah' was engraved on the top. This stamp was round, and was read from the bottom. The muhaqqiqeen (research scholars) write that this is not proven from any hadith, but from the apparent words we find it was written thus: Muhammad... Rasul... Allah.",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1900910,
        "last_updated": "2021-01-20 16:19:19"
    },
    {
        "englishURN": 1800870,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 11,
        "bookName": "Chapter 11. The Mubarak Ring Of Rasoolullah",
        "babNumber": "11.00",
        "babName": "Chapter 11. The Mubarak Ring Of Rasoolullah",
        "hadithNumber": 87,
        "hadithText": "Anas ibn Malik said:\n\"The Prophet (Allah bless him and give him peace) wrote to Chosroes, Caesar and the Negus, whereupon he was told: 'The non-Arabs will not accept a letter unless it bears a seal.' Allah’s Messenger (Allah bless him and give him peace) therefore cast a signet which had a silver ring, and on which was engraved; “Muhammad is the Messenger of Allah.”</b>",
        "bookID": "11.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "Kisra is the title of the Persian kings. Qaysar (Ceasar) that of the Romans and Najaashi that of the Abyssinian kings. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam sent a letter to Kisra with Sayyidina Abdullah bin Hudhaa-fah Radiyallahu 'Anhu. Kisra tore the letter of Sayyidina Rasulullah Sallallahu- 'Alayhi Wasallam to pieces. When Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam heard this he said. 'May Allah tear his kingdom to pieces', and so did it happen. The letter to the king of the Romans was sent with Sayyidina Dihyah bin Khalifah Kalbi Radiyallahu 'Anhu. Although accepting the prophethood of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, he did not accept Islaam. The letter to Najaashi, the king of Abyssinia was sent with Sayyidina 'Amr bin Urnayyah Damri Radiyallahu 'Anhu, as is mentioned in 'Mawaahib Ladunniyyah' and other kitaabs. This is not the Najaashi that has been mentioned previously, and for whom Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam had performed janaazah salaah. This was another Najaashi. It is not known whether he had accepted Islaam or not, as Mulla'Ali Qaari has written in his kitaab. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam wrote many letters which have been discussed in detail in the books of hadith and history. Special books have been written on this subject. In the above hadith, three letters are mentioned, of which a brief account seems appropriate here. One letter was written to Kisra, which is the title of the kings of Persia. The name of this Kisra was Aparvez, who was the grandson of Naw-sherwaan. The contents of the letter to him were as follows: In the Name of Allah, the Most Beneficent the Most Merciful From Muhammad, Allah's Messenger, to the great ruler of Persia. Peace be upon the one who follows (accepts) righteousness and reposes a faith (imaan) in Allah and His Rasul, and bears witness that none is to be worshipped besides Allah, Who has no partners and that Muhammad is His servant and Messenger. I call you towards Allah, for I am Allah's true Messenger, who has been sent to the whole world to warn those whose hearts are alive (because they have a little understanding-a man without sense is like a dead person), and complete the proof of Allah (Allah's existence) to non-believers (so that they may not say on the day of qiyaamah that we did not know). Accept Islaam so that you may live in peace. If you reject then the sin of all the fire-worshippers will be upon you, for they will be led astray by following you.Sayyidina 'Abdullah bin Hudhaa-fah Radiyallahu 'Anhu was given this letter and instructed to give it to a governor of Kisra who was living in Bahrain. The letter was to be sent to Kisra through him. It was then delivered to Kisra with the governor's assistance. Kisra had this letter read out to him where after he tore it to pieces and threw it away. When Sayyidina Rasulullah Sallallahu'Alayhi Wasallam was informed of this he cursed Kisra. Later the son of Kisra, Sherwiyyah, killed him in a very brutal manner. This incident is written in the books of history. The second letter mentioned in the hadith was sent to Qaysar (Ceasar), the king of the Romans. According to historians his name was Hiraql. This letter was sent with Sayyidina Dihyah Kalbi Radiyallahu 'Anhu. Although the Qaysar did not accept Islaam, he respected the letter and kept it safely. When Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam heard of this he said: 'Kisra tore his country to pieces, and Qaysar guarded his'. The contents of the letter were as follows: In the Name of Allah, the Most Beneficent the Most Merciful From Muhammad, Allah's servant and Messenger, to Hiraql, the great (ruler) of the Romans. Peace be upon the one that follows righteousness. After praise and salutations, I call you towards the Kalimah (Laa liaha illlallah Muhamamdur Rasulullah) of Islaam. Accept Islaam that you may live in peace. Allah will grant you a double reward, (because the Ahlul-Kitaab will receive double reward if they accept Islaam, as is mentioned in the Qur-aan at the end of Surah Hadid), and if you reject then the sin of the tillers of the land (farmers) who are under you, will be upon you. Oh People of the Book, come towards the kalimah, that is the same between us and you, and that is tauheed (the oneness of Allah), that we shall not worship anyone besides Allah and shall not make any partner unto Him, and that we shall not make anyone from among ourselves a god besides Allah (like the monks and priests are made gods) and if they reject (Oh you Muslims) then say to them that bear witness that we are Muslims (we openly proclaim our religion and now you are responsible for yourselves). -Bukhaari, I'laamus Saa-i-leen. The portion from, 'Oh People of the Book, come towards ... to the end, is an aayah of the Qur-aan in Surah Aali 'Imraan.When Sayyidina Dihyah Kalbi Radiyallahu 'Anhu delivered this letter and it was read before the Qaysar, his nephew who was present, became very angry, and began saying, give this letter to me. The uncle (Qaysar) asked: 'What will you do with it?\" He replied: 'This letter is not worth reading, your name was not mentioned first in the letter, but that of his (Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam). Instead of emperor he addresses you as a ruler etc. etc'. The Qaysar replied: 'You are stupid. Do you want me to throw away such a letter from a person to whom the Great Jibra-eel ('Alayhis Salaam) comes. If he is a prophet then he should write like this'. Sayyidina Dibyah Radiyallahu 'Anhu was accommodated with great honour and respect. The Qaysar was on a tour there at that time. When he was returning he called all the ministers of his kingdom, and said to them that, \"I wish to bring your, attention to such a thing that is full of goodness and prosperity. And is a means to keep your country for long. Verily this person (i.e. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam) is a prophet, follow him and pay allegiance to him\". He delivered this long speech in a room where all the doors and windows were closed and locked. The ministers and others became so rash with anger that they caused a commotion and began jumping about violently, trying to run out. Since all the doors and windows were locked, this situation carried on for a while. The Qaysar calmed all those present and delivered another speech, and said: 'A person who has claimed prophethood has appeared. I was 'testing your reaction that how firm are you on you religion, and now I have gauged it'. As was normal all began prostrating before him. Thereafter he praised them and let them leave. In some narrations it is stated that he kissed the letter and put it on his head. He then covered it with silk and put it safely away. He sent for the pope and discussed this matter with him. The pope said: 'Verily this is the last of the Prophets, the good news of which has been mentioned in our Holy Books'. The Qaysar said: 'I also believe this, but there is one problem, if I become a Muslim these people will kill me, and I will lose my kingdom'. I'laamus Saa-i leen.The Qaysar was on a pilgrimage to Baytul Muqaddas when this letter, reached him. A trading caravan from Makkah was also there at that time. To investigate this matter the Qaysar called the leader of the Makkan traders. Details of this event are mentioned in Bukhaari. This incident took place at the time when Sayyidina Rasulullah Sallallahu 'alayhi, Wasallam had signed a peace treaty for a few years with the Makaans at Hudaybiyyah. An agreement was drawn up that there would be no war, between the Muslims and the Makkans. Abu Sufyaan, who had not yet; accepted Islaam, said: 'I once went to Shaam (Syria) during this period, of peace. At that time Hiraql received Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam's letter inviting him to accept Islaam. Upon receiving, this letter, which was delivered by Dihyah' Kalbi, he asked the local people if there was anybody in the town who knew this person claiming prophethood. They said: 'Yes, there are some people who have recently, arrived'. Thereupon we were asked to appear before the king. A few of my companions and myself from the Quraysh went to the king. He made us all sit near him and then asked: 'Who of you is the nearest in relationship to the person that has claimed prophethood?' I replied that I was the most closely related. He asked me to come nearer to him motioning my companions to sit behind me, and said to them: 'I am to ask him some questions. If he gives false information, inform me. Abu Sufyaan had not yet accepted Islaam and was a staunch enemy of Rasulullah Sallallahu'Alayhi Wasallam. He said: 'I swear that if I had not been afraid that the people would later say that I was a liar, and disgrace me, then I would have surely given false information, but fear of disgrace made me speak the truth'. He then began asking me through his interpreter the following questions:\r\n\r\nQ. The person who has claimed prophethood, how is he regarded amongst you according to his family lineage?A. He hails from a great family and is of a noble lineage amongst us.Q. Was anyone amongst his ancestors a king?A. There was none.Q. Before claiming prophethood, was he ever accused of falsehood?A. Never.Q. Those who follow him, are they from the elite, or are they from the ordinary people?A. From the ordinary people.Q. Are his followers increasing or decreasing?A. They are increasing.Q. Those who adopt his religion, does anyone among them become frustrated and turn away?A. No.Q. Did you go to war with him?A. Yes.Q. What were the results of the war?A. Sometimes they were victorious, at other times we were victorious.Q. Does he ever break his promises?A. No. These days we have an agreement between us. We do not know if he will fulfil it or not. Abu Sufyaan said: 'I did not have a chance to say anything from my own side besides this sentence'.Q. Did anyone claim prophethood before him?A. No.In some narrations it stated that Hiraql asked Abu Sufyaan: 'Why do you fear that he will dishonour the treaty?' Abu Sufyaan replied: 'My People have helped our allies against their allies'. Hiraql said you have been dishonest'. Thereafter Hiraql continued the conversation and said: 'I asked you about his lineage. You replied that he was of noble lineage. The prophets are from the noble families of their people. I asked if any of his ancestors were kings? You said: 'No'. I thought that he wanted to regain the control of kingship. I asked if his followers were from the high class or common and weak people. All those who followed the earlier prophets, were from among such people (The high class felt it a shame to follow others). I asked if he was ever accused of falsehood before he claimed prophethood. You' denied it. I thought that by lying to people he would begin to lie about Allah (Na'udhu billah). (The person who does not lie to people, how can he lie about Allah). I asked if anyone accepted his message and thereafter became disillusioned and turned away from it (became a murtad-apostate). You replied in the negative. This is a peculiarity of imaan, that the love and happiness of it enters the heart. I enquired if their number increased or decreased? You replied that they were increasing. The peculiarity of good imaan is this till its completion. I asked about war against him? You said sometimes he gained victory, sometimes you. This was the case with all the prophets, but the best results were always in favour of them. I queried about his breaking promises? You said no. This is the quality of a prophet, for, he does not break promises. I asked did anyone claim, prophethood before him? You denied it. I thought if someone had claimed prophethood before, then he might be trying to imitate them. Hiraql thereafter asked these people: 'What are his teachings?' The people replied: 'To perform salaah, give zakaah and to uphold relationship with one's relatives. To keep one's chastity and modesty'. Hiraql said: 'If all that you have said is true, then verily he is a nabi (prophet). I was certain that he was to be born shortly, but not certain that he would be amongst you. If I were sure that I could go to him, I would surely have gone to meet him. (But cannot go because of the fear that I will lose my kingdom and my life). If I were in his presence I would have washed his feet. There is no doubt that his rule will reach till where I am'. There are many other incidents about Hiraql related in the books of hadith. He was well versed in their holy books and was also an expert in astronomy. He therefore thought on these lines, and did some research on it too. In some narrations it is related that he kept the letter of Sayyidina Rasulullah Sallallahu'Alayhi Wasallam very carefully with respect in a golden case. This was kept safely by his children and then their offspring for many generations. The third letter which is mentioned in the above hadith was sent to Najaashi.It has already been stated that the Abyssinian kings were called. Najaashi. in the lifetime of Sayyidina Rasulullah Sallallahu Alayhi Wasallam there were two kings of Abyssinia. The name of the first was As-hamah who accepted Islaam. The Muslims had migrated to Abyssinia under his rule. At that time he had not yet accepted Islaam. This incident has been briefly narrated in the first chapter of 'Stories of the Sahaabah Radiyallahu 'Anhu'. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam sent a letter to the second Najaashi with Sayyidina 'Amr bin Umayyah Damri Radiyallahu 'Anhu. The contents of the letter reads as follows: In the Name of Allah, the Most Beneficent the Most Merciful. From Muhammad, the Messenger of Allah to Najaashi, the king of Abyssinia. You love peace. I convey to you the praises of that Allah, besides whom there is none worthy of worship. He is the King, and is free from all faults. He is free from all shortcomings (or the creation is safe from His oppression). He grants peace; He guards (He saves the creation from all calamities); And I bear witness that 'Eesa 'Alayhis Salaam is one of Allah's Ruhs, and was the Kalimah of Allah which was sent to the pure, clean and virgin Maryam, thus she conceived. Allah Ta'aala created 'Eesa'Alayhis Salaam from one of his special ruh's, and put life into him, as he had created Sayyidina Aadam 'Alayhis Salaam with His hands (without a father). I call you towards the worship of the One Who is alone and has no partner and call you to assist in obeying His commands. I invite you to accept imaan (faith), and follow the shari'ah with which I am sent. Without doubt I am the Messenger of Allah. I invite you and your army towards Allah. I have conveyed the truth to you and have advised you. Accept my advice. Peace be on the one who follows the right path. A group among the muhadditheen have ascertained that this Najaashi had already accepted Islaam. After receiving this letter of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam he publicly declared that he was a Muslim. Some are of the opinion that he accepted Islaam after receiving the letter. He replied to the letter confirming that he had accepted Islaam, and that whatever was written of Sayyidina 'Eesa 'Alayhis Salaam was word for word, true. He sent the reply with his son, accompanied by a group of seventy people, to Sayyidina Rasulullah Sallallahu'Alayhi Wasallam, but unfortunately the boat that they were travelling in sank in the sea and none among them reached Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. Najaashi passed away during the life-time of Sayyidina Rasulullah Sallallahu 'Alayhi wasallam. Sayyidina Rasulullah Sallallahu'Alayhi Wasallam performed janaazah salaah for him. (To perform janaazah salaah for an absent person is a fiqhi mas-alah. Due to many reasons it had its peculiarities according to the Hanafis).After the death of this Najaashi, another Najaashi was crowned as a ruler. Another letter was written to him which read as follows: This letter is from Allah's Nabi Sallallahu 'Alayhi Wasallam to the, Najaashi, great (ruler) of Abyssinia. Peace be on the one that follows the straight path, and reposes his faith in Allah and His Rasul, and bears witness that none is worthy of worship save Allah; He is One; He has no partners nor any wife, nor any child; And also bears witness that Muhammad Sallallahu 'Alayhi Wasallam is His servant and Messenger. I invite you to the Kalimah (Laa ilaha illahah, Muhammadur Rasulullah) of Allah. Accept Islaam and you shall remain in peace. Oh People of the Book, come to the word that is common between us and you, that we shall not worship anyone besides Allah, and we shall not make anyone from amongst ourselves a god besides Allah. And if they reject (Oh Muslims) then say to them, bear witness that we are Muslims (openly announce their imaan). If you do not accept my invitation (to Islaam) and reject it, the sin of the Christians (as they are your followers) shall fall on you. At the beginning of the letter, as is customary, Bismillah must have been written. But Bismillah was not written in the copy from where I have taken this. It has not been confirmed whether this Najaashi had accepted Islaam or not, or what his name was. The opinion of the majority of the muhadditheen is that the third letter in this hadith, which is to Najaashi, is the same Najaashi. In some narrations with the name Najaashi, it is also stated that this was not the Najaashi for whom Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam had performed janaazah salaah. This is a more correct explanation. A few muhadditheen have only mentioned the letter to the first Najaashi, and a few have only mentioned the second letter. ",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1900920,
        "last_updated": "2021-01-20 16:20:49"
    },
    {
        "englishURN": 1800880,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 11,
        "bookName": "Chapter 11. The Mubarak Ring Of Rasoolullah",
        "babNumber": "11.00",
        "babName": "Chapter 11. The Mubarak Ring Of Rasoolullah",
        "hadithNumber": 88,
        "hadithText": "Anas said:\n\"When the Prophet (Allah bless him and give him peace) entered the toilet, he used to remove his signet ring.”</b>",
        "bookID": "11.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "As the name of Allah Jalla Jalaaluhu was engraved on it, he never went to the toilet with it. For this reason the 'ulama have written that it is makruh to go to the toilet with anything that has a venerable name or sentence on it.",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1900930,
        "last_updated": "2021-01-20 16:21:34"
    },
    {
        "englishURN": 1800890,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 11,
        "bookName": "Chapter 11. The Mubarak Ring Of Rasoolullah",
        "babNumber": "11.00",
        "babName": "Chapter 11. The Mubarak Ring Of Rasoolullah",
        "hadithNumber": 89,
        "hadithText": "Ibn 'Umar said:\n“Allah’s Messenger (Allah bless him and give him peace) chose a signet ring of silver, so it was in his possession. Then it was in the possession of Abu Bakr and the possession of 'Umar. Then it was in the possession of 'Uthman, until it fell into the well of Aris. Its engraved inscription was: ‘Muhammad is the Messenger of Allah.”</b>",
        "bookID": "11.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 1900940,
        "last_updated": "2021-01-20 16:22:41"
    }
]