[
    {
        "englishURN": 1800900,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Chapter 12. Stating That Rasoolullah Wore The Ring On His Right Hand",
        "babNumber": "12.00",
        "babName": "Chapter 12. Stating That Rasoolullah Wore The Ring On His Right Hand",
        "hadithNumber": 90,
        "hadithText": "'Ali ibn Abi Talib said (may Allah be well pleased with him):\n“The Prophet (Allah bless him and give him peace) used to wear his signet ring on his right hand.”</b>",
        "bookID": "12.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "Various narrations have been quoted regarding whether Sayyidina Rasulullah Sallallahu'Alayhi Wasallam wore the ring on his right or the left hand. A group of muhadditheen have preferred the view that he wore the ring on his right hand. This is also the view of Imaam Bukhaari, Imaam Tirmidhi, and other muhadditheen.' A few of the 'ulama have concluded that he wore it on the right hand, but sometimes wore it on the left. The 'ulama differ as to which hand it is best to wear a ring. Among the Hanafi 'ulama there are different opinions. A few say it is best to wear it on the left hand and others say both hands are equal. Shaami has quoted both views. Mulla 'Ali Qaari has quoted a saying of the Hanafis, that it is best to wear it on the right hand. According to the madhhab, the view stated by Shaami is more reliable (acceptable). Imaani Nawawi has stated that it is permissible according to the majority of the 'ulama, to wear it on either hand without karaahah. The Maalikis state it is better to wear it on the left hand. In short both are proven from the hadith. The 'ulama have also given preference to both. It is mentioned in Durri Mukhtaar from Qahistani that it has become a symbol of the Rawaafid (Shi'as) to wear a ring on the right hand, therefore it is waajib to abstain from wearing it on the right hand. The author of Durri Mukhtaar says that it is possible that it was the symbol of the Rawaafid at that time and now it is not. Maulana Cangohi writes in his kitaab 'Kaukabi Durri' that because the wearing of the ring on the left hand is the symbol of the Rawaafid, it is makruh to do so. Maulana (Khalil Ahmad) Saharanpuri has given the same view in his 'Badh-lul Majhud' and has also written that although there is a difference of opinion whether the Rawaafid are Muslims or non-Muslims, there is no difference of opinion in that they are faasiqs. It is very important to save one's self from imitating the fussaaq (plural of faasiq). (Now after the Iranian revolution the belief of the Rawaafid (Shi'ah) has been openly propagated and made known. They reject the fundamental beliefs of Islaam and hence are apostates and out of the fold of Islaam).",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1900950,
        "last_updated": "2021-01-21 10:14:39"
    },
    {
        "englishURN": 1800910,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Chapter 12. Stating That Rasoolullah Wore The Ring On His Right Hand",
        "babNumber": "12.00",
        "babName": "Chapter 12. Stating That Rasoolullah Wore The Ring On His Right Hand",
        "hadithNumber": 91,
        "hadithText": "Hammad ibn Salama said: \"I saw Ibn Abi Rafi' wearing a signet ring on his right hand, so I asked him about that and he said: 'I saw 'Abdu llah ibn Ja'far wearing a signet ring on his right hand', and 'Abdullah ibn Ja'far said:\n'Allah’s Messenger (Allah bless him and give him peace) used to wear a signet ring on his right hand'.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1900970,
        "last_updated": "2021-01-21 10:17:30"
    },
    {
        "englishURN": 1800920,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Chapter 12. Stating That Rasoolullah Wore The Ring On His Right Hand",
        "babNumber": "12.00",
        "babName": "Chapter 12. Stating That Rasoolullah Wore The Ring On His Right Hand",
        "hadithNumber": 92,
        "hadithText": "Abdullah ibn Ja'far said:\n“He (Allah bless him and give him peace) used to wear a signet ring on his right hand.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "In a hadith it has also been stated that beauty and elegance is more appropriate to the right hand. Therefore Ibn Hajar, who is an Imam of the science of hadith says, \"After studying that hadith, I have found that if it is worn for elegance and beauty, it should be worn on the right hand, and if it is worn for use as a seal or stamp it should be worn on the left hand, as it is easier to remove from the left hand when using it.\"<br><br>It is mentioned in the ahaadith that the ring was worn on both hands (right and left).",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1900980,
        "last_updated": "2021-01-21 10:18:31"
    },
    {
        "englishURN": 1800930,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Chapter 12. Stating That Rasoolullah Wore The Ring On His Right Hand",
        "babNumber": "12.00",
        "babName": "Chapter 12. Stating That Rasoolullah Wore The Ring On His Right Hand",
        "hadithNumber": 93,
        "hadithText": "Jabir ibn ‘Abdi’llah said:\n\"The Prophet (Allah bless him and give him peace) used to wear a signet ring on his right hand.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1900990,
        "last_updated": "2021-01-21 10:19:29"
    },
    {
        "englishURN": 1800940,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Chapter 12. Stating That Rasoolullah Wore The Ring On His Right Hand",
        "babNumber": "12.00",
        "babName": "Chapter 12. Stating That Rasoolullah Wore The Ring On His Right Hand",
        "hadithNumber": 94,
        "hadithText": "‘As-Salt ibn 'Abdi’llah said: “Ibn 'Abbas used to wear a signet ring on his right hand, without adornment, and he said: 'Allah’s Messenger (Allah bless him and give him peace) used to wear a signet ring on his right hand'.”</b>",
        "bookID": "12.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "Imam Tirmizi has written this hadith briefly. It is mentioned with more detail in the Abu Daud. Ibn Ishaq says, \"I have seen Salt wear a ring on the smallest finger of his right hand (this is known as the chungla finger in Urdu). I enquired the reason from him. He replied, \"I have seen Hazrat Ibn Abbas radiyallahu anhu wearing it in this manner. The top part of the ring was facing outwards, as far as I can recall he was talking about the Prophet of Allah sallallahu alaihe wasallam and said that the Prophet of Allah sallallahu alaihe wasallam wore it in the same manner.\"<br><br>Two things are mentioned in this hadith. One is that the top part was kept on the outer side of the finger. It is stated in the 'Badh-lul-Majhud' and 'Mirqaatus-Su'ud' that it is more correct to wear the top part of the ring facing the inside (towards the palms). This has also been stated in many narrations. This is also mentioned in the hadith appearing hereafter. Allamah Munaawi says that this is best because it protects the stone and saves one from pride and high mindedness. The second matter referred to is the wearing of the ring on the smallest finger. Imam Nawawi says that it is sunnah to do so according to the Ijmaa'. Allamah Shaami states that the ring should be on this finger, and the stone should face towards the palm for men, and towards the outside for women, as they wear it for beauty and elegance.",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1901000,
        "last_updated": "2021-01-21 10:21:06"
    },
    {
        "englishURN": 1800950,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Chapter 12. Stating That Rasoolullah Wore The Ring On His Right Hand",
        "babNumber": "12.00",
        "babName": "Chapter 12. Stating That Rasoolullah Wore The Ring On His Right Hand",
        "hadithNumber": 95,
        "hadithText": "Ibn 'Umar said:\n\"The Prophet (Allah bless him and give him peace) chose a signet ring of silver, and put its stone in the part close to the\npalm of his hand. On it he engraved: “Muhammad is the Messenger of Allah,” and he forbade anyone [else] to engrave on it. It is the one that fell from Mu'aiqib into the well of Aris.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "The reason for the Prophet of Allah sallallahu alaihe wasallam prohibiting the Sahabah radiyallahu anhum to make the same inscription on their rings is because the Sahabah radiyallahu anhum followed and imitated the Prophet of Allah sallallahu alaihe wasallam in every sphere of life, and by doing so it was feared that there would be a confusion with the original seal. Hazrat Mu'ayqib radiyallahu anhu was a Sahabi and the guardian (keeper) of the ring of the Prophet of Allah sallallahu alaihe wasallam. When the Prophet of Allah sallallahu alaihe wasallam did not wear the ring it was kept by Hazrat Mu'ayqib radiyallahu anhu. In the same manner it was kept by him during the reign of Hazrat Abubakr, Hazrat Umar and Hazrat Uthman radiyallah anhum. During the reign of Hazrat Uthman radiyallahu anhu, while sitting at the well of Arees, Hazrat Mu'ayqib radiyallahu anhu was giving the ring to Hazrat Uthman radiyallah anhu or was taking it from him and it accidentally fell into the well. This incident is mentioned in many ahaadith. As to whether it fell from the hands of Hazrat Uthman radiyallahu anhu or from the hands of Mu'ayqib radiyallahu anhu, the Ulama have adopted the view that it was the latter. Both ahaadith agree that it happened between them.",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1901010,
        "last_updated": "2021-01-21 10:23:35"
    },
    {
        "englishURN": 1800960,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Chapter 12. Stating That Rasoolullah Wore The Ring On His Right Hand",
        "babNumber": "12.00",
        "babName": "Chapter 12. Stating That Rasoolullah Wore The Ring On His Right Hand",
        "hadithNumber": 96,
        "hadithText": "Ja'far ibn Muhammad reports that his father said:\n\"Al-Hasan and al-Husain used to wear signet rings on their left hands.\"</b>",
        "bookID": "12.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "This hadith is contrary to the ones mentioned at the beginning of the chapter by Imam Tirmizi. It is stated there that the ring was worn on the right hand. An explanation can be given that the intention here is to indicate that after mentioning all the ahaadith, this narration that is contrary to the others may be of a weak chain. According to this humble servant, the mentioning of the right hand shows that this is the preferred method. This narration (under discussion) indicates that this too is permissible. Some of the learned have explained that in translations, according to the practice of the Muhadditheen, the word, 'am fee yasaarihi' has been removed i.e. the Prophet of Allah sallallahu alaihe wasallam used to wear the ring on the right hand or the left. According to this explanation no narration will be different from a translation.",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1901020,
        "last_updated": "2021-01-21 10:24:51"
    },
    {
        "englishURN": 1800970,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Chapter 12. Stating That Rasoolullah Wore The Ring On His Right Hand",
        "babNumber": "12.00",
        "babName": "Chapter 12. Stating That Rasoolullah Wore The Ring On His Right Hand",
        "hadithNumber": 97,
        "hadithText": "Anas ibn Malik said:\n“He (Allah bless him and give him peace) used to wear a signet ring on his right hand.”</b>",
        "bookID": "12.0",
        "grade1": "Sanad Da'if wal-Hadīth Sahih",
        "grade2": "",
        "comments": "The findings of Imam Tirmizi are that both these hadith are incorrect, which would mean that Hazrat Anas radiyallahu anhu could not ascertain the correct hand. The Muhadditheen take great precautions and study each part of a hadith in detail to determine which portion is correct, and which is incorrect in that hadith, although in other ahaadith this has been ascertained to be correct consequently, today, the subject of hadith has been carefully preserved and has spread in the world with 'noor'. Many ahaadith prove that the Prophet of Allah sallallahu alaihe wasallam wore the ring on both the right or the left hand. The ahaadith where he wore it on the right hand have been mentioned in this chapter. The ahaadith regarding his wearing it on the left hand are stated in the Abu Daud and Muslim etc. Imam Nawawi informs that both type of ahaadith are correct. It is a practice of the Muhadditheen, that although if three ahaadith are correct (on a subject) and due to some special rule it does not comply with the standard, they will mention their views on this special rule. Therefore, Imam Tirmizi has made a comment here.",
        "ourHadithNumber": 8,
        "matchingArabicURN": 1901030,
        "last_updated": "2021-01-21 10:25:39"
    },
    {
        "englishURN": 1800980,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Chapter 12. Stating That Rasoolullah Wore The Ring On His Right Hand",
        "babNumber": "12.00",
        "babName": "Chapter 12. Stating That Rasoolullah Wore The Ring On His Right Hand",
        "hadithNumber": 98,
        "hadithText": "Ibn 'Umar said:\n\"Allah’s Messenger (Allah bless him and give him peace) chose a signet ring of gold, and he used to wear it on his right hand. The people therefore chose signet rings of gold, so he threw it away (Allah bless him and give him peace) and said: 'I shall never wear it!' The people therefore threw their signet rings away.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "It was permissible to wear gold in the early periods of Islam. Subsequently, this was ordained haraam for men. All the Ulama are unanimous in that it is haraam for men to wear gold. Imam Nawawi has also stated the unanimous verdict of the Ulama in this respect. This subject is discussed at length in the books of fiqh. It will not be appropriate to discuss it here.",
        "ourHadithNumber": 9,
        "matchingArabicURN": 1901040,
        "last_updated": "2021-01-21 10:26:48"
    }
]