[
    {
        "englishURN": 1801030,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 14,
        "bookName": "Chapter 14. The Armor Of Rasoolullah",
        "babNumber": "14.00",
        "babName": "Chapter 14. The Armor Of Rasoolullah",
        "hadithNumber": 103,
        "hadithText": "Az-Zubair ibn al-'Awwam said:\n\"The Prophet (Allah bless him and give him peace) wore two coats of mail on the Day of \nUhud, so he tried to climb the boulder but was not able. He therefore made Talha sit\nbeneath him, and the Prophet (Allah bless him and give him peace), climbed up until he stood upright on the rock.\" He said: \"I heard the Prophet say (Allah bless him and give\nhim peace): 'Talha performed a deed worthy of reward'!”</b>",
        "bookID": "14.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "The situation of the war in the Battle of Uhud was very serious. Some people began to fear that the Prophet of Allah sallallahu alaihe wasallam had passed away. The reason for the Prophet of Allah sallallahu alaihe wasallam climbing this hill was that the Sahabah radiyallahu anhum could see him (being alive) and be reassured. Some of the learned say he climbed the hill to survey the enemy.<br><br>Hazrat Talhah radiyallahu anhu very bravely accompanied and protected the Prophet of Allah sallallahu alaihe wasallam on this day. Whenever the Sahabah radiyallahu anhum discussed the Battle of Uhud, they would say that, that day belonged to Hazrat Talhah radiyallahu anhu. Hazrat Talhah radiyallahu anhu shielded the Prophet of Allah sallallahu alaihe wasallam with his body. He received more than eighty wounds on his body and yet he did not leave the side of the Prophet of Allah sallallahu alaihe wasallam, even though his hand became paralysed.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1901100,
        "last_updated": "2021-01-21 10:52:05"
    },
    {
        "englishURN": 1801040,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 14,
        "bookName": "Chapter 14. The Armor Of Rasoolullah",
        "babNumber": "14.00",
        "babName": "Chapter 14. The Armor Of Rasoolullah",
        "hadithNumber": 104,
        "hadithText": "As-Sa’ib ibn Yazid said:\n\"Allah’s Messenger (Allah bless him and give him peace) wore on the Day of Uhud two coats of mail between which he rendered support.”</b>",
        "bookID": "14.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "It was not against tawakkul (having complete trust in Allah) for the Prophet of Allah sallallahu alaihe wasallam to wear two armours. Firstly, according to the sufis, 'Kamaali Suluk' (The perfection of seeking) is to return to bidaayah (the beginning), that is, in general dealings to behave like the common people, and the following of the Shari'ah must become a habit. Secondly, the Prophet of Allah sallallahu alaihe wasallam did these things to teach the ummah. Thirdly, Allah Ta'ala says in the Qur'aan, \"Oh you who believe (when fighting the non-believers) protect yourselves (against their blows, etc., and also by wearing armour etc.). Then (to fight them) come out singly or collectively (as the necessity arises).\" (4; 71) Therefore in preparing arms for protection, one will be following the injunctions of the Qur'aan. And who else can obey the commands of Allah Ta'ala more than the Prophet of Allah sallallahu alaihe wasallam? By this, the use of all forms of protection is intended.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1901110,
        "last_updated": "2021-01-21 10:52:56"
    }
]