[
    {
        "englishURN": 1801050,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "Chapter 15. The Helmet Of Rasoolullah",
        "babNumber": "15.00",
        "babName": "Chapter 15. The Helmet Of Rasoolullah",
        "hadithNumber": 105,
        "hadithText": "Anas ibn Malik said:\n\"The Prophet (Allah bless him and give him peace) entered Mecca wearing a helmet. He was told: 'This Ibn Khatal [son of corrupt speech] is clinging to the curtains of the Ka'ba so he said: 'Kill him!'\"</b>",
        "bookID": "15.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "When the Prophet of Allah sallallahu alaihe wasallam entered Makkah Mukarramah as a conqueror, the people of Makkah became frightened. There was no place to live nor a path to walk. The Prophet of Allah sallallahu alaihe wasallam who is well known for being merciful and generous, announced that the person who entered the House of Allah (Ka'bah) was safe, and those who remained in their homes were also safe. The one who laid down his arms was also safe, etc. There were eleven men and six women whose crimes could not be forgiven. These people were not included in the general amnesty. It was announced that there was no mercy for these people. Among these criminals seven men and two women embraced Islam and were pardoned. The remaining four men and four women were killed. Ibn Khatl was one of the eight that were punished.<br><br>He had first come to Madinah Munawwarah where he accepted Islam and kept the name Abdullah. The Prophet of Allah sallallahu alaihe wasallam sent him to a tribe to collect zakah. He killed a Muslim slave just because he had not prepared meals on time. Fearing that if he returned to Madinah Munawwarah he would be punished by death, he became a murtad (apostate) and went to Makkah. In Makkah he used to abuse the Prophet of Allah sallallahu alaihe wasallam. He purchased two slave girls, who sang songs in which the Prophet of Allah sallallahu alaihe wasallam was satirized. This made him feel happy. For this reason, despite of entering the Baytullah (Ka'bah), he was killed.<br><br>There are many versions according to the Muhadditheen as to who the person was that killed him. A fiqhi mas'alah may also arise from this hadith that punishment and revenge is permissible in the Haram. The question needs a lengthy explanation, and there is no need for it here. It is omitted to keep the subject matter brief. These matters are referred to so that those who love to acquire knowledge and also students after reading it, will seek more information from their Mashaa'ikh. From this we also find a question of entering Makkah Mukarramah without Ihram, which is discussed in the hadith that follows.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1901120,
        "last_updated": "2021-01-21 10:54:32"
    },
    {
        "englishURN": 1801060,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "Chapter 15. The Helmet Of Rasoolullah",
        "babNumber": "15.00",
        "babName": "Chapter 15. The Helmet Of Rasoolullah",
        "hadithNumber": 106,
        "hadithText": "Anas ibn Malik reported:\n“Allah’s Messenger (Allah bless him and give him peace) entered Mecca in the Year of Victory with the helmet on his head. When he took it off, a man came to him and told him: ‘Ibn Khatal [the son of corrupt speech] is clinging to the curtains of the Ka'ba,’ so he said: ‘Kill him!’ Ibn Shihab said: ‘It has also reached me that Allah’s Messenger (Allah bless him and give him peace) was not in the state of ritual consecration on that day.’”</b>",
        "bookID": "15.0",
        "grade1": "Sahih Muttafaq 'alay",
        "grade2": "",
        "comments": "The last sentence in the above hadith by Imam Zuhri refers to a fiqhi mas'alah. According to the Hanafi's it is not permissible to enter Makkah Mukarramah without Ihraam, because it is mentioned in the hadith that it is not permissible to cross the meeqaat boundary without wearing Ihraam. On the strength of the above hadith the Shafi'is say it is permissible. According to the Hanafi's this hadith cannot be used as an argument, because the prohibition was specially lifted for the Prophet of Allah sallallahu alaihe wasallam on this particular occasion. Imam Bukhari and others have quoted narrations wherein the Prophet of Allah sallallahu alaihe wasallam has said, \"This was permissible for me today (not wearing Ihraam) and not for any other person.\"<br><br>It may be possible that Ibn Khatl went to hold the cover of the Ka'bah to repent and make supplications, since he knew that there was no amnesty for him. He remembered all his past deeds, turning apostate, and all that he had committed since. He may have done this to make a supplication, as these people also venerated and respected the Ka'bah. The simplest explanation seems to be that according to the old custom, he may have hoped for an amnesty, because of the sanctity and reverence for the Ka'bah, criminals were not killed in this state.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1901130,
        "last_updated": "2021-01-21 10:55:55"
    }
]