[
    {
        "englishURN": 1801120,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 17,
        "bookName": "Chapter 17. The Lungi Of Rasoolullah",
        "babNumber": "17.00",
        "babName": "Chapter 17. The Lungi Of Rasoolullah",
        "hadithNumber": 112,
        "hadithText": "Abu Burda reported that his father said:\n“'A'isha (may Allah be well pleased with her) brought out to us a tangled garment and a coarse loincloth, then she said: ‘The spirit of Allah’s Messenger (Allah bless him and give him peace) was taken in these two'.”</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "It was a habit of Sayyidina Rasoolullah sallallahu alaihe wasallam to wear simple clothing right up to the time of his demise, even though the standard of living had generally improved. After the conquest of Khaibar the economic situation of the Muslims became better. After the conquest of Makkah, the kings of other countries also began sending presents etc.. Despite this, Sayyidina Rasoolullah sallallahu alaihe wasallam did not change his standard of living. He lived simply and whatever was sent to him was distributed to others. A few examples have been mentioned in the book 'Stories of the Sahabah radiyallahu anhum'.<br><br>Imam Nawawi says that this hadith and other similar ones point to the fact that Sayyidina Rasoolullah sallallahu alaihe wasallam loved the Hereafter and stayed away from luxuries. Thick and coarse clothing makes one feel humble and simple, while the wearing of fine clothing makes one feel great and proud.<br><br>My saint, Maulana Hakim Jameelud-Deen Naginwi Ad-Dehlawi related an incident of Maulana Gangohi that when he went for Haj and while performing tawaaf, a blind saint was sitting on the outer side of the Mataaf. Whenever Maulana passed by him, he said softly, \"Wear the clothing of the pious.\"<br><br>When Maulana completed the tawaaf and went to the side where the blind saint was sitting, he heard him say, \"Khashin, khashin (coarse, coarse),\" by which it was meant that the clothing of the pious was made of coarse material.<br><br>Sayyidina Rasoolullah sallallahu alaihe wasallam generally wore coarse clothing. There is also evidence that he, sometimes, wore clothing made of fine material due to some religious benefit, if it was available. He normally did not wear clothing made of fine cloth.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1901190,
        "last_updated": "2021-01-22 14:03:00"
    },
    {
        "englishURN": 1801130,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 17,
        "bookName": "Chapter 17. The Lungi Of Rasoolullah",
        "babNumber": "17.00",
        "babName": "Chapter 17. The Lungi Of Rasoolullah",
        "hadithNumber": 113,
        "hadithText": "Al-Ash'ath ibn Sulaim said: \n\"I heard my maternal aunt relate, on the authority of her paternal uncle; 'While I was walking in Medina, someone behind me said: ‘Raise your loincloth, for that is more pious and conducive to longer wear.’ Lo and behold, he was Allah’s Messenger (Allah bless him and give him peace)', so I said: ‘O Messenger of Allah, it is simply a black garment with white stripes!’ He said: ‘Do you not have an example in me?’ so I looked and noticed that his loincloth was to half his shins'.”</b>",
        "bookID": "17.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "We have been warned strictly in the ahaadith on the wearing of a lungi or trousers below the ankle. All those parts that droop below the ankles will be burnt in the fire. Abdur-Rahman says, \"I asked Abu Saeed Khudri radiyallahu anhu regarding the lungi. He replied, \"You have a very meaningful question. Rasoolullah sallallahu alaihe wasallam has said, \"The lungi of a Muslim should reach till the middle of the shin, and there is no harm if it reaches above his ankles. But those portions that droop below the ankles will burn in the fire of jahannam. The one that lets his clothes droop below his ankles in pride, Allah Most High will not look at him on the Day of Judgement.\" (Abu Dawud).<br><br>Warnings like these have been given in other ahaadith too. One should take strict care of this. In our time it has become a fashion to let the clothing droop below the ankles, so much so, that we treat it to be something petty and pay no heed to the warning of Sayyidina Rasoolullah sallallahu alaihe wasallam. To Allah is our complaint.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1901200,
        "last_updated": "2021-05-20 19:57:59"
    },
    {
        "englishURN": 1801140,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 17,
        "bookName": "Chapter 17. The Lungi Of Rasoolullah",
        "babNumber": "17.00",
        "babName": "Chapter 17. The Lungi Of Rasoolullah",
        "hadithNumber": 114,
        "hadithText": "llyas ibn Salama al-Akwa reported that his father said:\n\"'Uthman ibn 'Affan used to wear a loincloth reaching the middle parts of his shins, and he said: 'In this manner was the loincloth of my Companion', meaning the Prophet (Allah bless him and give him peace).”</b>",
        "bookID": "17.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1901210,
        "last_updated": "2021-01-22 14:08:33"
    },
    {
        "englishURN": 1801150,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 17,
        "bookName": "Chapter 17. The Lungi Of Rasoolullah",
        "babNumber": "17.00",
        "babName": "Chapter 17. The Lungi Of Rasoolullah",
        "hadithNumber": 115,
        "hadithText": "Hudhaifa ibn al-Yuman said:\n\"Allah’s Messenger (Allah bless him and give him peace) took hold of the calf of my legs or his leg, and he said: 'This is the position of the loincloth, and if you object, then somewhat lower down, but if you object, the loincloth has no right to the ankles'.”</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "It is haraam to cover the ankles when wearing a lungi or an izaar etc.. The Ulama say that only those people are exempted who have a boil or a sore on the ankle, which will cause flies etc. to sit on it. Only then shall it be permissible to cover it with a lungi or izaar etc., with the object of safeguarding it till it heals.",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1901220,
        "last_updated": "2021-01-22 14:10:10"
    }
]