[
    {
        "englishURN": 1801200,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 20,
        "bookName": "Chapter 20. The Sitting Of Rasoolullah",
        "babNumber": "20.00",
        "babName": "Chapter 20. The Sitting Of Rasoolullah",
        "hadithNumber": 120,
        "hadithText": "'Abdu’llah ibn Hassan reported on the authority of his grandmothers:\nQaila bint Makhrama said that she saw Allah’s Messenger (Allah bless him and give him peace) in the mosque squatting on his heels. She said: \"When I saw Allah’s Messenger (Allah bless him and give him peace) displaying humility in the mosque, I trembled with fright.\"</b>",
        "bookID": "20.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "The 'ulama differ in the explanation of the word 'qarfasaa'. The most commonly known is, that while sitting on the ground, to lift both thighs in an upright position, and fold both arms around the legs. It is also termed in the Urdu language as sitting 'Gowt maar ke'. The reason for the awe was, that at this moment Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was in some deep thought and worry. He never worried over little things. He feared that perhaps a punishment or calamity might descend on the ummah. This seems to be the hadith that has been mentioned briefly in hadith number twelve in the Chapter on the dressing of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. This hadith has another portion which the author has shortened, where it continues that one among those present, after seeing Sayyiditina Qaylah Radiyallahu 'Anha shivering said: 'Oh Rasulullah, this poor woman is trembling'. Sayyiditina Qaylah Radiyallahu 'Anha says: 'I was behind Rasuluilah Sallailahu 'Alayhi Wasallam, and he did not look towards me. He only said: 'Oh poor woman, be calm'. As soon as Rasulullah Sallallahu 'Alayhi Wasallam said this all the fear in me vanished'. In some narrations this incident is narrated of a man, as has been mentioned in the chapter on the 'Dressing of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam'.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1901270,
        "last_updated": "2021-01-22 14:17:19"
    },
    {
        "englishURN": 1801210,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 20,
        "bookName": "Chapter 20. The Sitting Of Rasoolullah",
        "babNumber": "20.00",
        "babName": "Chapter 20. The Sitting Of Rasoolullah",
        "hadithNumber": 121,
        "hadithText": "'Abbad ibn Tamim reported:\nHis paternal uncle said that he saw the Prophet (Allah bless him and give him peace) lying on his back in the mosque, placing one of his legs over the other.</b>",
        "bookID": "20.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "In a narration of Sahih Muslim it has been prohibited to sleep in this manner. The ulma have summed up both narrations in different ways. A simple explanation is that there are two different postures of sleeping referred to in this manner, both of which have been verified in separate ahaadith. The first is to put the legs flat and rest the one leg on the other. This manner has been mentioned in the 'Shamaa-il', and there is no harm in adopting it. The second manner is to lie with both knees raised, then rest on leg on another. This verifies the narration of Sahih Muslim. The reason for Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam prohibiting the second manner is because the lungi was generally worn in 'Arabia at that time, and it is very likely that the private parts would be exposed in this manner. It has also been argued here that this hadith is not relevant to the sitting of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. The ulama give different reasons for this. The simplest one is that in this chapter on sitting, the general meaning of both sitting and lying down is taken, although some of the narrations on lying down will be mentioned in the chapter on sleeping. It may also be possible, as Ibn Hajar has explained, that this type of sleeping (despite being prohibited in the narration) is permissible in the masjid. Therefore to sit in different postures should also be permissible.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1901280,
        "last_updated": "2021-01-22 14:19:05"
    },
    {
        "englishURN": 1801220,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 20,
        "bookName": "Chapter 20. The Sitting Of Rasoolullah",
        "babNumber": "20.00",
        "babName": "Chapter 20. The Sitting Of Rasoolullah",
        "hadithNumber": 122,
        "hadithText": "Abu Sa'id al-Khudri said:\n“When Allah’s Messenger (Allah bless him and give him peace) sat in the mosque, he pressed his legs against his stomach with his hands.”</b>",
        "bookID": "20.0",
        "grade1": "Sanad Da'if Jiddan",
        "grade2": "",
        "comments": "By Qarfasaa' ('Gowt maar ke' in Urdu) is meant to sit on the buttocks with both thighs raised, and both arms folded around the thighs. Sometimes instead of the arms a cloth, lungi or a turban is tied around the back, both thighs and legs. This manner of sitting displays humbleness and peacefulness. For this reason, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallain many a time sat in this posture. The Sahaabah Radiyallahu 'Anhum also sat in this manner, but it was not the object to always sit in this manner. This does not contradict the narration mentioned in Abu Daawud. from which we gather that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallarn sat crossed-legged from after fajr till ishraaq (sunrise) in the masjid. It also does not contradict the other ahaadith narrated on this subject. By sitting in the posture described in the hadith under discussion, besides showing humbleness, one gains rest also. It is said that sitting in a qarfasaa posture is like leaning on a wall for the 'Arabs. This is because in the wilderness there are no walls to lean upon, therefore this manner of sitting is in place of leaning on a wall. Many a time instead of the hands a cloth was tied around (the body and legs) thus affording more rest.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1901290,
        "last_updated": "2021-01-22 14:20:17"
    }
]