[
    {
        "englishURN": 1801230,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 21,
        "bookName": "Chapter 21. The Pillow Of Rasoolullah",
        "babNumber": "21.00",
        "babName": "Chapter 21. The Pillow Of Rasoolullah",
        "hadithNumber": 123,
        "hadithText": "Jabir ibn Samura said:\n\"I saw Allah’s Messenger (Allah bless him and give him peace) leaning on a cushion on his left side.”</b>",
        "bookID": "21.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "It is permissible to put a pillow on both the right and left as stated in the hadith. The left is mentioned but only incidentally according to the rules and regulations of the muhadditeen (hadith scholars) the left side is not mentioned in the well -known narrations. Imam tirmizi has for this reason commented on this at the end of the chapter.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1901300,
        "last_updated": "2021-01-23 08:18:19"
    },
    {
        "englishURN": 1801240,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 21,
        "bookName": "Chapter 21. The Pillow Of Rasoolullah",
        "babNumber": "21.00",
        "babName": "Chapter 21. The Pillow Of Rasoolullah",
        "hadithNumber": 124,
        "hadithText": "'Abd ar-Rahman ibn Abi Bakra reported that his father Abu Bakra said:\n“Allah’s Messenger said (Allah bless him and give him peace): ‘Should I tell you about the greatest of the major sins?’ They said: ‘Yes indeed, O Messenger of Allah!’ He said: ‘Associating partners with Allah, and recalcitrance against parents.’ Allah’s Messenger (Allah bless him and give him peace) sat down, and he was leaning on a support. He added: '...and false testimony’ or: ‘false speech.’ Allah’s Messenger (Allah bless him and give him peace) went on speaking until we said: ‘If only he would keep silent!”</b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "The reason for the sahaabah radiyallhu anhum wishing that Sayyidina Rasoolullah sallallahu alaihe wasallam should stop repeating it, is because of their love for Sayyidina Rasoolullah sallallhu alaihe wasallam, and there fear that he would become tired. It is enough to say a thing once. It could be possible that he might have become angry, or that in anger, Sayyidina Rasoolullah sallallahu aliahe wasallam might say something that would become a cause of loss to the ummah. Those who attend these type of religious or wordly assemblies are well aware of such situations. Sayyidina Rasoolullah sallallhu alaihe wasallam repeated it to show its importance. Lies and falsehood inevitably gets a person involved in adultery, murder and many other sins. Sayyidina Rasoolullah sallallahu alaihe wasallam also said, \"When a person lies, the angels stay a distance of a mile away from him because odour it causes in person's mouth\". He has also said, \"A believer cannot be a liar\". Sayyidina Abu Bakr Siddique radiyallahu Anhu says, \"Stay away from lies, because lies keep away Imaan.\" (Al-Itidaal)",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1901310,
        "last_updated": "2021-01-23 08:21:39"
    },
    {
        "englishURN": 1801250,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 21,
        "bookName": "Chapter 21. The Pillow Of Rasoolullah",
        "babNumber": "21.00",
        "babName": "Chapter 21. The Pillow Of Rasoolullah",
        "hadithNumber": 125,
        "hadithText": "Abu Juhaifa said:\n\"Allah’s Messenger said (Allah bless him and give him peace):‘As for me, I do not eat while leaning on a support!’”</b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "This manner of eating is against humility, and it drives one to eat more. Soem people are of the opinion that it results in creating a large tummy, and the food also does not digest quickly. Sayyidina Rasulullah sallallahu alaihe wasallam mentions himself so that he may be emulated. The Ulama write that there are four methods of leaning, and all four are included here. The first is to lean with either side of the body on a wall, pillow, etc. The second is to lean with the palms on the ground. The third is to sit cross legged on a pillow. The fourth method is to lean with the back on a large pillow or wall. All these postures are included in the above prohibition.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1901320,
        "last_updated": "2021-01-23 08:22:29"
    },
    {
        "englishURN": 1801260,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 21,
        "bookName": "Chapter 21. The Pillow Of Rasoolullah",
        "babNumber": "21.00",
        "babName": "Chapter 21. The Pillow Of Rasoolullah",
        "hadithNumber": 126,
        "hadithText": "Jabir ibn Samura said:\n\"I saw Allah’s Messenger (Allah bless him and give him peace) leaning on a cushion.”</b>",
        "bookID": "21.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "This is the same Hadith mentioned at the beginning of the chapter. The author wanted to comment on this Hadith, therefore it is mentioned here.",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1901340,
        "last_updated": "2021-01-23 08:24:08"
    },
    {
        "englishURN": 1801251,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 21,
        "bookName": "The Pillow Of Rasoolullah",
        "babNumber": "21.00",
        "babName": "Chapter 21. The Pillow Of Rasoolullah",
        "hadithNumber": 125,
        "hadithText": "Abu Juhaifa said:\n\"Allah’s Messenger said (Allah bless him and give him peace): 'I do not eat while leaning on a support! I do not eat while leaning on a support'!”</b>",
        "bookID": "21.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1901330,
        "last_updated": "2021-01-23 08:23:33"
    }
]