[
    {
        "englishURN": 1801290,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "Chapter 23. Description Of The Eating Of Rasoolullah",
        "babNumber": "23.00",
        "babName": "Chapter 23. Description Of The Eating Of Rasoolullah",
        "hadithNumber": 130,
        "hadithText": "Reported on the authority of Ibn al-Ka'b ibn Malik, that his father said:\n\"The Prophet (Allah bless him and give him peace) used to lick his fingers three times.”</b>",
        "bookID": "23.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "After eating it is mustahab to lick the fingers before washing the hands. According to some authorities, due to this narration it is mustahab to lick the fingers thrice. Mulla 'Ali Qaari says three times is not meant here, but that three-fingers should be licked, as will be stated in another narration. Therefore, another narration of Sayyidina Kaa'b bin Maalik Radiyallahu 'Anhu is also mentioned in this chapter. Some commentators of the hadith say that it is a separate etiquette to lick the fingers thrice, so that it becomes completely clean, and in another narration where three fingers are mentioned, is also one of the etiquettes.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1901370,
        "last_updated": "2021-01-26 14:24:09"
    },
    {
        "englishURN": 1801300,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "Chapter 23. Description Of The Eating Of Rasoolullah",
        "babNumber": "23.00",
        "babName": "Chapter 23. Description Of The Eating Of Rasoolullah",
        "hadithNumber": 131,
        "hadithText": "Anas said:\n“When the Prophet (Allah bless him and give him peace) ate a meal, he used to lick his three fingers [the thumb, the index finger and the middle finger].”</b>",
        "bookID": "23.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "It was the noble habit of Sayydina Rasulullah Sallallahu 'Alayhi Wasallam to eat with three fingers only. Although we find in a few narrations that he used five fingers also. In most narrations the three fingers; thumb, and middle fingers are mentioned. The benefit of eating with three fingers is that the amount taken (morsel) will be less, and one will not eat more. Imaam Nawawi says: 'We gather from these ahaadith that it is mustahab to eat with three fingers'. For this reason the fourth and fifth fingers should not be used unnecessarily. But if such food is eaten, where it is difficult to use only the three fingers, then there is no harm in using more. Mulla 'Ali Qaari has written that to eat with five fingers is a sign of greediness. Many a time due to the morsel being big, it results in the stomach being unnecessarily strained, it is also the reason for food getting stuck in the throat.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1901380,
        "last_updated": "2021-01-26 14:24:55"
    },
    {
        "englishURN": 1801310,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "Chapter 23. Description Of The Eating Of Rasoolullah",
        "babNumber": "23.00",
        "babName": "Chapter 23. Description Of The Eating Of Rasoolullah",
        "hadithNumber": 132,
        "hadithText": "Abu Juhaifa said:\n“The Prophet said (Allah bless him and give him peace): 'As for me, I do not eat while leaning on a support'!”</b>",
        "bookID": "23.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "This hadith has been discussed in a previous chapter.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1901390,
        "last_updated": "2021-01-26 14:26:36"
    },
    {
        "englishURN": 1801320,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "Chapter 23. Description Of The Eating Of Rasoolullah",
        "babNumber": "23.00",
        "babName": "Chapter 23. Description Of The Eating Of Rasoolullah",
        "hadithNumber": 133,
        "hadithText": "Ibn al-Ka'b ibn Malik reported that his father said:\n\"Allah’s Messenger (Allah bless him and give him peace) used to eat with his three fingers and afterwards he would lick them.”</b>",
        "bookID": "23.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "It has been mentioned in some narrations that he first licked the middle finger, then the sha-haadah finger, then the thumb. It was the noble habit of the master to use these three fingers. The 'ulama have mentioned many benefits in this method (sequence). The first is that the licking of the fingers will run in a manner where it goes to the right. The Sha-haadah finger will be on the right of the middle finger. The second is that the middle finger is long, therefore it will be more contaminated. For this reason it is appropriate to begin with this finger. Khattaabi says: 'Some foolish people do not like to lick the fingers, and think it disgraceful, but they do not reason that the food that is on the finger is the same that they have been eating, there is nothing new on it'. Ibn Hajar says: 'If someone thinks of his own deed as disgraceful, it could be discussed. But to think of any act of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallasm as disgraceful, could be dangerous and may even lead to kufr (disbelief) - Jam'ul Wasaa-il. In reality these things have alot to do with habit. If one has a habit of something, it does not matter, and one will not even take notice of it. This is why if one naturally feels these deeds to be disgraceful, then too one should try to form a habit of it, (and should remind one's self that it is sunnah of Sayyidina Rasulullah (Sallallahu 'Alayhi Wasallam)). Once when this humble servant went to Hijaaz (Saudi Arabia), a few who had not been to India asked me surprisingly and with great astonishment, that we hear that there is a fruit in India known as the Mango. We hear such disgusting things about it that it surprises us. It is put to the mouth and sucked, it is removed then put to the mouth and sucked again, It is again removed looked at, and sucked again. They were describing it with such disgust that it seemed they were about to vomit. An Indian will not feel anything disgusting about it. There are many such examples. One takes a spoonful of custard and puts it into the mouth, then puts the same spoon which has some saliva on it, into the plate again, eating from it a second and third time. There are countless other instances where a person is used to a certain way and manner and does not feel the least disgusted about it.",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1901410,
        "last_updated": "2021-01-26 14:29:41"
    },
    {
        "englishURN": 1801330,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "Chapter 23. Description Of The Eating Of Rasoolullah",
        "babNumber": "23.00",
        "babName": "Chapter 23. Description Of The Eating Of Rasoolullah",
        "hadithNumber": 134,
        "hadithText": "Anas ibn Malik say:\n\"Allah’s Messenger (Allah bless him and give him peace) was brought some dried dates, and I saw him eat while he was hunched over from hunger.”</b>",
        "bookID": "23.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "That means he was supporting his back on a wall or something. It has been prohibited in the Ahaadith to lean on something and eat. Here it was due to weakness, therefore it cannot be said that it is contrary to the ahaadith prohibiting it, nor can it be reasoned from this hadeeth that it is permissible to lean and eat.",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1901420,
        "last_updated": "2021-01-26 14:30:27"
    }
]