[
    {
        "englishURN": 1801340,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": "Chapter 24. The Bread Of Rasoolullah",
        "babNumber": "24.00",
        "babName": "Chapter 24. The Bread Of Rasoolullah",
        "hadithNumber": 135,
        "hadithText": "'A’isha said:\n\"The family of Muhammad (Allah bless him and give him peace) did not satisfy their appetite with barley-bread for before even two consecutive days until Allah’s Messenger (Allah bless him and give him peace) was taken from this world.”</b>",
        "bookID": "24.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "It is Possible that they may have eaten a full stomach of dates, but not of bread, where they did not eat it for two consecutive days. A question may arise, that it is evident from the ahadith that Sayidinah Rasulullah Sallalahu 'Alayhi Wasallam gave his wives their expenses for a year.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1901430,
        "last_updated": "2021-01-26 14:33:06"
    },
    {
        "englishURN": 1801350,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": "Chapter 24. The Bread Of Rasoolullah",
        "babNumber": "24.00",
        "babName": "Chapter 24. The Bread Of Rasoolullah",
        "hadithNumber": 136,
        "hadithText": "Abu Umama al-Bahili say:\n\"There was never more than a bare sufficiency of barley- bread for the people of the household of Allah’s Messenger (Allah bless him and give him peace).”</b>",
        "bookID": "24.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "Whenever bread made of barley was prepared, the quantity was so little that there were none left over. There was not enough to fill the stomach. Also Sayyidina Rasulullah Saliallahu 'Alayhi Wasallam used to have many guests and the As-haabus Suffah were permanent guests of Sayyidina Rasuluilah Sallallahu 'Alayhi Wasallam.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1901440,
        "last_updated": "2021-01-26 14:34:25"
    },
    {
        "englishURN": 1801360,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": "Chapter 24. The Bread Of Rasoolullah",
        "babNumber": "24.00",
        "babName": "Chapter 24. The Bread Of Rasoolullah",
        "hadithNumber": 137,
        "hadithText": "Ibn 'Abbas said:\n\"Allah’s Messenger (Allah bless him and give him peace) used to spend night after night starving. He and his family would not have any supper to eat, and most of their bread was barley-bread.”</b>",
        "bookID": "24.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "Although there were among the Sahaabah Radiyallahu 'Anhum, a few who were wealthy, Sayyidina Rasulullah Sallailahu 'Alayhi Wasallam did not let anyone know, nor did his family members let anyone know, of their state.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1901450,
        "last_updated": "2021-01-26 14:36:15"
    },
    {
        "englishURN": 1801370,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": "Chapter 24. The Bread Of Rasoolullah",
        "babNumber": "24.00",
        "babName": "Chapter 24. The Bread Of Rasoolullah",
        "hadithNumber": 138,
        "hadithText": "Sahl ibn Sa'd said that he was asked:\n“Did Allah’s Messenger (Allah bless him and give him peace) eat the finest flour, meaning white bread?” Sahl said: “Allah’s Messenger (Allah bless him and give him peace) did not see the finest flour until he met Allah (Almighty and Glorious is He).” Then he was asked: “Did you have sieves in the time of Allah’s Messenger (Allah bless him and give him peace)?” He said: “We did not have sieves.” He was asked: “How did you treat barley?” He said: “We used to blow on it, so whatever flew would fly off it, and then we would knead it.”</b>",
        "bookID": "24.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "He replied: \"No, it was not\". The questioner then asked: \"How was bread from barley prepared?\" (because it has more particles in it). Sahl Radiyallahu Anhu replied: \"We used to blow into the flour and the big particles flew out. The rest was made into dough\".",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1901460,
        "last_updated": "2021-01-26 14:38:46"
    },
    {
        "englishURN": 1801380,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": "Chapter 24. The Bread Of Rasoolullah",
        "babNumber": "24.00",
        "babName": "Chapter 24. The Bread Of Rasoolullah",
        "hadithNumber": 139,
        "hadithText": "Anas ibn Malik said:\n“Allah’s Prophet (Allah bless him and give him peace) did not eat food on a table, nor in a bowl, and no bread rolled thin and flat was baked for him. I asked Qatada: ‘So on\nwhat were they used to eating?’ He said: ‘On these pieces of skin [on which food for the journey is put].”</b>",
        "bookID": "24.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "Sayyidina Yunus Radiyallahu 'Anhu and Sayyidina Qataadah Radiyallahu 'Anhu who are mentioned in the translation are two narrators in the chain of this hadith. 'Allaamah Munaawi and Mulla 'Ali Qaari say that it has always been the custom of proud people to eat on a table. It has been stated in the 'Kaukabe Durri' that in our times because it is also an imitation of the Christians, therefore it is rnakruh tahreermi.",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1901470,
        "last_updated": "2021-01-26 14:40:20"
    },
    {
        "englishURN": 1801390,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": "Chapter 24. The Bread Of Rasoolullah",
        "babNumber": "24.00",
        "babName": "Chapter 24. The Bread Of Rasoolullah",
        "hadithNumber": 140,
        "hadithText": "Masruq said:\n\"I went in to see 'A'isha, so she ordered a meal for me, and she said: “I do not eat my fill from a meal, for I feel like weeping, if I have not wept.” I said: “Why?” She said:\n“I remember the state in which Allah’s Messenger (Allah bless him and give him peace) departed from this world. By Allah, he did not eat his fill of bread and meat twice in one day!”</b>",
        "bookID": "24.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1901480,
        "last_updated": "2021-01-26 14:41:55"
    },
    {
        "englishURN": 1801400,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": "Chapter 24. The Bread Of Rasoolullah",
        "babNumber": "24.00",
        "babName": "Chapter 24. The Bread Of Rasoolullah",
        "hadithNumber": 141,
        "hadithText": "'A’isha said:\n\"Allah’s Messenger (Allah bless him and give him peace) did not eat his fill of barley-bread for two days in a row until he died.”</b>",
        "bookID": "24.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "This is the same hadith that was mentioned in the beginning of the chapter. The only difference is, there the whole household was mentioned, here only Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam himself is mentioned. The aim is the same. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam preferred a simple life for himself and his family. There was not so much, that all could fill their stomachs. Even if there was something available it was given to the poor.",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1901490,
        "last_updated": "2021-01-26 14:43:32"
    },
    {
        "englishURN": 1801410,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": "Chapter 24. The Bread Of Rasoolullah",
        "babNumber": "24.00",
        "babName": "Chapter 24. The Bread Of Rasoolullah",
        "hadithNumber": 142,
        "hadithText": "Anas said:\n“Allah’s Messenger (Allah bless him and give him peace) did not eat food on a table, and he did not eat bread rolled thin and flat, until he died.”</b>",
        "bookID": "24.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "This hadith is also mentioned in hadith number five of this chapter. It is clear from the narrations that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam preferred a simple life. Whenever Allah Ta'aala sent an angel to ask Sayyidina Rasulullah Sallailahu 'Alayhi Wasallam if he preferred to live a simple life with poverty and hunger or a life with wealth and pomp, he always replied that he preferred the first (simple life). Many ahaadith are mentioned on this subject. The 'ulama give two explanations for this. The first is that because Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam preferred a simple way of life, only that much was made available as has been previously mentioned. Or that although it was available, in humbleness he did not consume it but distributed it.",
        "ourHadithNumber": 8,
        "matchingArabicURN": 1901500,
        "last_updated": "2021-01-26 14:44:19"
    }
]