[
    {
        "englishURN": 1801420,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 143,
        "hadithText": "'A’isha said:\n“Allah’s Messenger said (Allah bless him and give him peace): ‘What an excellent condiment vinegar is'!”</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "The reason being there is not much trouble in it. Bread can easily be eaten with it. It is always easily available. It also keeps away formalities. Besides one lives in this world for a little while. Vinegar has many benefits in it. It is an antidote for poison. It stops phlegm and gall. It helps digest food, kills the worms of the stomach and creates a good appetite. Due to its cold effect, it may not be good for some people. But it surely is a good curry which is obtained easily. In whatever way it is praised, its full benefits cannot be emphasised. It is stated in a hadith that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam ate it and said: 'What a wonderful curry it is'. In another hadith it is stated that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam made du'aa for barakah in it and said: \"It was the curry of the previous Ambiyaa also'. In one hadith it is stated, 'The house that has vinegar in it, will not be in need' i.e. That house will not be in need of curry. These narrations have been mentioned in the Jam 'ule Wasaa-il from Ibn Maajah.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1901510,
        "last_updated": "2021-01-29 15:48:42"
    },
    {
        "englishURN": 1801430,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 144,
        "hadithText": "An-Nu'man ibn Bashir said:\n“Do you not have what you want in the way of food and drink? I have seen your Prophet (Allah bless him and give him peace), and the poor-quality dates [daqal] that he finds are what fills his stomach.\"</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "The Sahaabi's intention is to persuade one to follow the simple life of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam and that one lives in this world for only a short period. When in the hadith it is denied that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam did not have ordinary dates to fill his stomach then what about bread and curry?",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1901520,
        "last_updated": "2021-01-29 15:50:16"
    },
    {
        "englishURN": 1801440,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 145,
        "hadithText": "Jabir ibn 'Abdi’llah said:\nAllah’s Messenger said (Allah bless him and give him peace): 'What an excellent condiment vinegar is!’”</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "It is possible that when Sayyidina Rasulullah Sallallahu 'Alayihi Wasallam said this, both Sayyiditina'Aayishah Radiyallahu 'Anha and Sayyidina Jaabir Radiyallahu'Anhu were present. It is more correct that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam said this on different occasions.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1901530,
        "last_updated": "2021-01-29 15:51:37"
    },
    {
        "englishURN": 1801450,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 146,
        "hadithText": "Zahdam al-Jarmi said:\n\"We were in the presence of Abu Musa al- Ash'ari when he was brought some chicken meat. A man among the people thereupon turned away, so he asked him: 'What is the matter?' He replied: 'I saw it eating something putrid, so I swore that I would not eat it.' He [Abu Musa] said: 'Draw near, for I have seen Allah’s Messenger (Allah bless him and\ngive him peace) eating the meat of chickens'!”</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "The object is that something which is permissible in shari'ah must not be prohibited. Break the oath and give kaffaarah. Eating of the fowl is permissible according to all the Imaams. The 'ulama have only stated that it is makruh to eat the Jalalah type of fowl. (Because it eats dirt). The effect of the fowl is hot and moist (according to the physicians). It digests quickly, creates good humour (body fluids) in the body. It strengthens the brain and the main parts of the body, clears the voice, and gives the body a good complexion. It strengthens the senses too.",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1901540,
        "last_updated": "2021-01-29 15:53:58"
    },
    {
        "englishURN": 1801460,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 147,
        "hadithText": "Ibrahim ibn 'Umar ibn Safina, on the authority of his father reported that his grandfather said: \"I ate together with Allah’s Messenger (Allah bless him and give him peace) the meat of a bustard.”</b>",
        "bookID": "25.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "Hubaa-raa is a type of a bird. The 'ulama differ on its meaning. Some say it is Ta'dha-ri. Some say it is Batera (quail), others say it is Sarkhaab. Some translations say it is Chaka Chakoi. It is written in the 'Muheet Aa'zam' that Hubaa-raa is called Ho-barah, Shawaat and Sha-waal in Persian. In Turkish it is called Tau'adh-ri, and in Hindi Charz. It is a wild bird and has a greyish colour, a large neck and long legs, the beak is also slightly large, and it flies at a speed. It is also known as jarj. The Greeks call it Ghalofas. In size it is between a Heron and a water fowl. The author of 'Lughatus Sa-raah' has also translated Hubaa-raa as Shawaat. In Mazaahire Haq it is translated as Ta'dhari. Other authors have also translated it as Ta'dhari. For this reason Ta'dhari is more correct. The author of 'Ghayaath' has written both Ta'dhari and Charz. -The author of 'Babrul Jawaahir' has also translated it as Ta'dhari and Charz. He writes that it is also called Sarkhaab. But the author of 'Muheet' has written that Sarkhaab, which is also called Chakwa is another type of bird. The author of 'Nafaa'is' say the 'Arabic of Chakwa and Sarkhaab is Nahaam. Therefore it is more correct that Sarkhaab is another bird.",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1901550,
        "last_updated": "2021-01-29 15:57:32"
    },
    {
        "englishURN": 1801470,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 148,
        "hadithText": "Zahdam al-Jarmi said:\n\"We were in the presence of Abu Musa al-Ash'ari. Among the people there was a man from the Banu Taimi’llah, ruddy as if he were a freed slave, and he did not draw near, so Abu Musa said to him: 'Draw near, for I saw Allah’s Messenger (Allah bless him and give\nhim peace) eat some of it,' but he said: 'I saw it eat something and I found it loathsome, so I swore that I would never taste it'!”</b>",
        "bookID": "25.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "This is the same hadith that has been mentioned previously. Because of the difference in the chain of narrators, there is also a difference in the describing of the narration. Both ahaadith are described in brief in the Shamaa-il. This incident is mentioned in detail in the Bukhaari, where it is stated that in the end Sayyidina Abu Musa Ash'ari Radiyallahu 'Anhu told him to partake of the fowl and give a kaffaarah for the oath. What does it mean, or what is derived by swearing an oath not to eat a thing which is halaal?",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1901560,
        "last_updated": "2021-01-29 16:00:15"
    },
    {
        "englishURN": 1801480,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 149,
        "hadithText": "Ata’ ibn Abi Asid, said:\n“Allah’s Messenger said (Allah bless him and give him peace): ‘Eat [olive] oil, and anoint with it, for it is from a blessed tree!’”</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "The blessedness of this tree has been mentioned in the Qur-aan in the aayah \"... from a blessed tree, an olive neither of the East nor of the West... \"- Suralt An Nur, 35. The 'ulama have mentioned different reasons for its blessedness. Some say it is mostly grown in Syria and the earth of Syria is blessed because seventy prophets were sent to it. Some say it is blessed because of its many benefits. Abu Nu'aym says: 'It has a cure for seventy diseases of which one is leprosy'. Sayyidina Ibn 'Abbaas Radiyallahu 'Anhu says: 'Every part of the olive is beneficial. The oil is used for burning and cooking. It is also used for tanning. Its wood is used for firewood. The ash of the olive is -especially good for washing silk'. It is said that the olive tree has a long life. It bears fruit after forty years and has a life span of a thousand years. It's numerous benefits are mentioned in the books of tibb.",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1901570,
        "last_updated": "2021-01-29 16:01:31"
    },
    {
        "englishURN": 1801490,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 150,
        "hadithText": "'Umar ibn al-Khattab (may Allah the Exalted be well pleased with him) said:\n“Allah’s Messenger said (Allah bless him and give him peace): ‘Eat oil, and anoint with it, for it is from a blessed tree'!”</b>",
        "bookID": "25.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "The reason for mentioning this hadith in the practices of Sayyidina Rasulullah Sallallahu'Alayhi Wasallam is, that if he encouraged the use of olives, he must have used it himself.",
        "ourHadithNumber": 8,
        "matchingArabicURN": 1901580,
        "last_updated": "2021-01-29 16:02:42"
    },
    {
        "englishURN": 1801500,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 151,
        "hadithText": "Anas ibn Malik said:\n“The Prophet (Allah bless him and give him peace) used to admire the gourd, so when he was brought a meal or invited to one, I would seek it out and set it in front of him, because I knew that he liked it.”</b>",
        "bookID": "25.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "We gather from this that if there are many things in a plate, then it is permissible to take a thing which one likes from the other side of the plate, provided the next person does not feel offended. The reason for searching for pieces of gourd is because it was the custom to have more gravy in the curry. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam also advised us to have more gravy in the curry so that the neighbours may also benefit.",
        "ourHadithNumber": 10,
        "matchingArabicURN": 1901600,
        "last_updated": "2021-01-29 16:04:33"
    },
    {
        "englishURN": 1801510,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 152,
        "hadithText": "Hakim ibn Jabir reported that his father said:\n\"I entered the presence of the Prophet (Allah bless him and give him peace), and I saw beside him a gourd being carved into pieces, so I said: 'What is this?' He said: 'We use it to augment our meal'.\"</b>",
        "bookID": "25.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "The 'ulama have mentioned many benefits of gourd (dubba-dodhi- kadu). Its benefits are also mentioned in the books of tibb. It strengthens the brain and senses.",
        "ourHadithNumber": 11,
        "matchingArabicURN": 1901610,
        "last_updated": "2021-01-29 16:06:23"
    },
    {
        "englishURN": 1801520,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 153,
        "hadithText": "Anas ibn Malik said: \n“A tailor invited Allah’s Messenger (Allah bless him and give him peace) to a meal he had made, so I went with Allah’s Messenger (Allah bless him and give him peace) to that meal. He presented Allah's Messenger (Allah bless him and give him peace) with some barley-bread and broth containing a gourd and jerked meat. Then I saw the Prophet (Allah bless him and give him peace) looking for chunks of gourd all around the bowl, and and I've loved gourd ever since.”</b>",
        "bookID": "25.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "Sayyidina Anas Radiyalahu 'Anhu may have also been invited or may have accompanied Sayyidina Rasululluh Sallallahu 'Alayhi Wasallam. There is no harm if one accompanies an invited guest to an invitation provided the host does not feel offended.",
        "ourHadithNumber": 12,
        "matchingArabicURN": 1901620,
        "last_updated": "2021-01-29 16:08:11"
    },
    {
        "englishURN": 1801530,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 154,
        "hadithText": "'A’isha said:\n\"The Prophet (Allah bless him and give him peace) used to love sweets and honey.”</b>",
        "bookID": "25.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "Halva here apparently means anything sweet. Some are of the opinion that it is a special type of halva that is made of sweetmeats and ghee The first person to present halva to Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. was Sayyidina 'Uthman Radiyallahu. 'Anhu. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam liked it. This halva was made of flour, ghee and honey. Sugar was not commonly used in those times. Sweetening agents were derived from honey or dates.",
        "ourHadithNumber": 13,
        "matchingArabicURN": 1901630,
        "last_updated": "2021-01-29 16:09:04"
    },
    {
        "englishURN": 1801540,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 155,
        "hadithText": "Umm Salama informed 'Ata ibn Yasar that she served Allah’s Messenger (Allah bless him and give him peace) a grilled flank, so he ate from it, then embarked on the ritual prayer and did not perform the minor ritual ablution.</b>",
        "bookID": "25.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "It is found in some ahaadith that things cooked on fire nullifies the wudhu. This was also the madh-hab of the 'ulama mutaqaddimeen. The madh-hab of the Khulafaa-rashideen, the four imaams and the majority of the Ulema is that those ahaadeeth wherein the necessity of Wudu is mentioned has been abrogated. This hadith of Sayyiditina Umm Salamah Radiyallahu 'Anha also supports the madh-hab of the majority that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam did not perform wudhu again (after eating the cooked meat) before salaah.",
        "ourHadithNumber": 14,
        "matchingArabicURN": 1901640,
        "last_updated": "2021-01-29 16:11:05"
    },
    {
        "englishURN": 1801550,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 156,
        "hadithText": "'Abdu’llah ibn al-Harith said:\n\"Together with Allah’s Messenger (Allah bless him and give him peace), we ate grilled meat in the mosque.”</b>",
        "bookID": "25.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "From this we find that it is permissible to eat and drink in the masjid, on condition that the masjid does not become untidy, otherwise it is makruh to do so. It is possible that this was at the time of i'tikaaf (in Ramadaan). It was the practice of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam to observe i'tikaaf every year, and at that time it is obvious that one eats in the masjid.",
        "ourHadithNumber": 15,
        "matchingArabicURN": 1901650,
        "last_updated": "2021-01-29 16:11:46"
    },
    {
        "englishURN": 1801560,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 157,
        "hadithText": "Al-Mughira ibn Shu'ba said:\n“I was a guest one night together with Allah’s Messenger (Allah bless him and give him peace), so he was brought a grilled flank. Then he took the blade and set about carving, and he carved some for me. Bilal arrived calling him to prayer, so he threw the blade away, and he said: ‘Why have his hands been soiled?’ His mustache hung down close to his mouth, so he said to him: ‘I shall clip it for you over a tooth-stick,’ or: ‘Clip it over a tooth-stick'!”</b>",
        "bookID": "25.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "There are a few important matters to be discussed here. The first is that Sayyidina Mughirah Radiyallahu 'Anhu became a guest of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. The 'ulama give two meanings to this. This is also strengthened by other narrations. One is that the word 'together' (with) is extra. The object is that I became a guest of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. As a host he had a side portion roasted and cut pieces from the meat and gave me to eat. The narration in Tirmidhi is more appropriate to this subject. The narration in Abu Daawud on this is clear and the words mentioned are this: 'I became a guest of Rasulullah Sallallahu 'Alayhi Wasallam'. The, second meaning is that Sayyidina Rasulullah Sallailahu 'Alayhi Wasallam and I were the guests of a third person. The word 'together, in the narration supports this. In this case, for Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam to cut the meat and feed the guest was to create love and brotherhood.",
        "ourHadithNumber": 16,
        "matchingArabicURN": 1901660,
        "last_updated": "2021-01-29 16:13:54"
    },
    {
        "englishURN": 1801570,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 158,
        "hadithText": "Abu Huraira said:\n‘The Prophet (Allah bless him and give him peace) was brought some meat, so the foreleg was set before him, and he liked it, so he took a bite of it.”</b>",
        "bookID": "25.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam has encouraged the use of the teeth to eat. It is related in the hadith, that it should be torn and eaten, because it digests properly and it is more suitable to the body.",
        "ourHadithNumber": 17,
        "matchingArabicURN": 1901670,
        "last_updated": "2021-01-29 16:15:13"
    },
    {
        "englishURN": 1801580,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 159,
        "hadithText": "Ibn Mas'ud said:\n\"The Prophet (Allah bless him and give him peace) used to like the foreleg [of the cooked sheep].\" He [Ibn Mas'ud] also said: \"He was poisoned with a foreleg, however, as he used to believe that the Jews had poisoned him.”</b>",
        "bookID": "25.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "Aafter -Khaybar was conquered, a Jewess living there, came to know that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam loved the dhiraa portion of the meat. She roasted the meat of a goat and mixed a poison in it, and especially put more in the dhiraa part. She invited Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam and served the meat. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam took a bite but did not swallow it, or may have swallowed a bit of it then spat it out and said. 'I have been informed by this meat that there is poison in it\", some of the poison affected him. The poisonous effect sometimes became severe, and at the time of his demise it began to take effect again and was the cause of his martyrdom. In this hadith it is mentioned that the meat itself informed Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam that there was poison in it. In other narrations it is stated that Jibra'eel 'Alayhis Salaam informed him of this. There is no contradiction, is both are possible, first the meat must have informed him as a mu'jizah (miracle), thereafter Jibra'eel 'Alayhis Salaam came and affirmed it After receiving the information, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam stopped eating it and prohibited the Sahaabah Radiyallahu 'Anhum from eating it too. Later the woman was called and asked if poison was mixed in the meat? She confessed that she had poisoned the meat. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam did not avenge himself and the woman was pardoned at that time. But later Sayyidina Bishr bin Baraa Radiyallahu 'Anhu was martyred due to eating the poisoned meat. We find in a few narrations that the woman was later killed as a punishment, or as an example to others. There are different narrations from which we gather that she was punished. In others that she was not punished. Both are correct, as is gathered from the original incident. According to the shari'ah for such a deed it is waajib to punish the murderer or blood money taken. This is a fiqhi question and the 'ulama hold different opinions, which needs an academic discussion, therefore, it is omitted here. Sayyidina Ibn Mas'ud Radiyallahu 'Anhu\" saying that it is suspected that the Jewess poisoned the meat, is according to his thoughts, it seems he did not investigate this incident, otherwise the original incident has been ascertained. The Jewess also confessed her crime as is mentioned in other narrations.",
        "ourHadithNumber": 18,
        "matchingArabicURN": 1901680,
        "last_updated": "2021-01-29 16:17:31"
    },
    {
        "englishURN": 1801590,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 160,
        "hadithText": "Abu 'Ubaid said:\n\"I cooked a dish for the Prophet (Allah bless him and give him peace), and he used to take great pleasure in the foreleg [of the cooked sheep],so I passed him the foreleg. Then he said: 'Pass me the foreleg,' so I passed it to him. Then he said: 'Pass me the foreleg,' so I said: 'O Messenger of Allah, how many forelegs does a sheep have?' He said: 'By the One in whose Hand is my soul, if you kept silent, you would surely pass me the foreleg whenever I asked for it!’”</b>",
        "bookID": "25.0",
        "grade1": "Sanad Da'if wal-Hadīth Hasan",
        "grade2": "",
        "comments": "This was a mu'jizah (miracle) of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. In Musnad Ahmad, a similar incident is narrated from Sayyidina Abu Raafi' Radiyallahu 'Anhu. This incident apparently happened to both of them. There is nothing surprising because there are many such incidents found in the life of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, which Qaadi 'Iyaad has mentioned in his book 'Shifaa'. Sayyidina Abu Ayyub Ansaari Radiyallahu 'Anhu once invited Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam and Sayyidina Abubakr Radiyallahu 'Anhu and prepared food that was enough for two people only. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam requested him to invite thirty respected people from among the Ansaar. He invited them and after they had eaten, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam said: 'Now invite sixty people'. After they had eaten, others were invited. In short, the food was enough for one hundred and eighty people.",
        "ourHadithNumber": 19,
        "matchingArabicURN": 1901690,
        "last_updated": "2021-01-29 16:19:12"
    },
    {
        "englishURN": 1801600,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 161,
        "hadithText": "'A’isha said (may Allah be well pleased with her):\n“The foreleg was not the meat dearest to Allah’s Messenger (Allah bless him and give him peace), but he only got to have meat occasionally, so he would rush to it, because it was the part that got done the most quickly.”</b>",
        "bookID": "25.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "In the narration, it is stated that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam liked the dhiraa part of the meat. It is possible there were many reasons for him liking this portion. Among them is also the one related by Sayyiditina 'Aayeshah Radiyallahu 'Anha. Sayyiditina 'Aayeshah Radiyallahu 'Anha denies Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam liked the dhiraa portion and this denial apparently seems to be that it appears the liking of the dhiraa portion because of greed and desire, which is against the dignity of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, otherwise there is no denial of his liking only that portion of the meat.",
        "ourHadithNumber": 20,
        "matchingArabicURN": 1901700,
        "last_updated": "2021-01-29 16:20:40"
    },
    {
        "englishURN": 1801610,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 162,
        "hadithText": "'Abdu’llah ibn Ja'far said: \n“I heard Allah’s Messenger say (Allah bless him and give him peace): ‘The best of the meat is the back'.”</b>",
        "bookID": "25.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "There is no contradiction between this and other narrations in which it is mentioned that he liked the meat of the dhiraa portion. Due to different reasons and the quality, both can be good. For example, strengthwise or it having less fibre, more fat etc. Therefore due to different aspects, both could be preferred and also be excellent.",
        "ourHadithNumber": 21,
        "matchingArabicURN": 1901710,
        "last_updated": "2021-01-29 16:21:50"
    },
    {
        "englishURN": 1801620,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 163,
        "hadithText": "'A’isha said (may Allah be well pleased with her):\n\"The Prophet said (Allah bless him and give him peace): 'What an excellent condiment vinegar is'!”</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "This has been mentioned in a few hadith in this chapter.",
        "ourHadithNumber": 22,
        "matchingArabicURN": 1901720,
        "last_updated": "2021-01-29 16:22:50"
    },
    {
        "englishURN": 1801630,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 164,
        "hadithText": "Umm Hani said:\n\"The Prophet (Allah bless him and give him peace) entered my presence and said: 'Do you have anything in your possession?' I said: 'No, apart from some dry bread and vinegar', so he said: 'Give me some! A household in which there is vinegar is not devoid of seasoning'!”</b>",
        "bookID": "25.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 1901730,
        "last_updated": "2021-01-29 16:24:16"
    },
    {
        "englishURN": 1801640,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 165,
        "hadithText": "Abu Musa al-Ash'ari said that the Prophet said (Allah bless him and give him peace):\n“The superiority of 'Aisha over all other women is like the superiority of tharid [a dish of sopped bread, meat and broth] over all other food.”</b>",
        "bookID": "25.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "From this hadith we learn the excellence and superiority of Sayyidatina Aishah radiyallahu anha over the other women, and thareed over other foods. Thareed is a delicacy in which bread is mixed with gravy. Besides being tasty and nourishing, it digests quickly and easily, and has other benefits too. It is a custom in Arabia to eat this delicacy, and was counted amongst the best foods.",
        "ourHadithNumber": 24,
        "matchingArabicURN": 1901740,
        "last_updated": "2021-01-29 16:25:45"
    },
    {
        "englishURN": 1801650,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 166,
        "hadithText": "Anas ibn Malik said: “Allah’s Messenger said (Allah bless him and give him peace):‘The superiority of 'A'isha over all other women is like the superiority of tharid [a dish of sopped bread, meat and broth] over all other food'.”</b>",
        "bookID": "25.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "The object of Imam Tirmizi in mentioning this narration is to show that Sayyidina Rasoolullah sallallahu alaihe wasallam loved thareed. We gather from different narrations that Sayyidina Rasoolullah sallallahu alaihe wasallam ate thareed regularly.",
        "ourHadithNumber": 25,
        "matchingArabicURN": 1901750,
        "last_updated": "2021-01-29 16:27:34"
    },
    {
        "englishURN": 1801660,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 167,
        "hadithText": "Abu Huraira (may Allah be well pleased with him) said that he saw Allah’s Messenger (Allah bless him and give him peace) perform the minor ritual ablution because of eating cottage cheese. Then he saw him eat from the flank of a sheep, and then perform the ritual prayer without performing the minor ritual ablution.</b>",
        "bookID": "25.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "In the early stages of Islam, wudhu would become nullified after taking food and drink cooked on fire. Later this law was abrogated. It is possible that Sayyidina Rasoolullah sallallahu alaihe wasallam performed wudhu after eating cheese in the days when wudhu became nullified after eating things that were cooked on fire, or he may have performed wudhu due to some other reason. For example, he may have performed wudhu again whilst still being in the state of wudhu, or due to some reason the wudhu may have become invalid. From the explanation given by Sayyidina Abu Hurairah radiyallahu anhu we gather that in the early stages of Islam, Sayyidina Rasoolullah sallallahu alaihe wasallam performed wudhu after eating things cooked on fire. Later this law was abrogated, that is why he did not perform wudhu after eating the mutton.",
        "ourHadithNumber": 26,
        "matchingArabicURN": 1901760,
        "last_updated": "2021-01-29 16:28:39"
    },
    {
        "englishURN": 1801670,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 168,
        "hadithText": "Anas ibn Malik said:\n\"Allah’s Messenger (Allah bless him and give him peace) gave a wedding banquet for Safiyya consisting of dried dates and parched barley.”</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "Saweeq (sattu) is a drink made of parched barley. Sayyidatina Safiyyah bint Huyay ibn Akhtab radiyallahu anha was from a Jewish family and from among the offsprings of Haroon alaihis salaam. In the year AH 7, after the Battle of Khaibar, she was taken as a slave.",
        "ourHadithNumber": 27,
        "matchingArabicURN": 1901770,
        "last_updated": "2021-01-29 16:31:18"
    },
    {
        "englishURN": 1801680,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 169,
        "hadithText": "Salma said that al-Hasan ibn 'Ali, Ibn 'Abbas and Ibn Ja'far came to her and said to her: \"Make us a meal consisting of that which used to delight Allah’s Messenger (Allah bless him and give him peace), and which used to make his food more palatable!\" She replied: ‘O my dear son, do not wish for it today!’ He said: ‘Oh yes, you must make it for us!’ She therefore got up, took some barley and ground it. Then she put it into a pot, poured some oil over it, crushed the pepper and the spices, and presented it to them. She said: \"This is some of that which used to delight Allah’s Messenger (Allah bless him and give him peace), and which used to make his food \nmore palatable!”</b>",
        "bookID": "25.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 1901780,
        "last_updated": "2021-01-29 16:33:54"
    },
    {
        "englishURN": 1801690,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 170,
        "hadithText": "Jabir ibn 'Abdi’llah said:\n“The Prophet (Allah bless him and give him peace) came to us in our house, so we slaughtered a sheep for him, and he said: ‘It is as if they knew that we love meat'!\" (This\ntradition is part of a longer story).</b>",
        "bookID": "25.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "It is said that this is a part of the incident which is mentioned in the books of hadith on the subject of the Battle of Khandaq, wherein a miracle of Rasoolullah sallallahu alaihe wasallam is also mentioned. Sayyidina Jabir radiyallahu anhu says, I saw the sign of hunger on Rasoolullah sallallahu alaihe wasallam. I went home and asked if there was some food. We had a lamb, and some barley in a bag. I slaughtered the lamb and my wife ground the barley into flour. The meat was put in a pot to cook and I went to Rasoolullah sallallahu alaihe wasallam and quietly said to him, â€˜Some food is ready.â€™ I invited Rasoolullah sallallahu alaihe wasallam and a few companions.",
        "ourHadithNumber": 29,
        "matchingArabicURN": 1901790,
        "last_updated": "2021-01-29 16:40:31"
    },
    {
        "englishURN": 1801700,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 171,
        "hadithText": "Jabir said:\n“Allah’s Messenger (Allah bless him and give him peace) went out and I went with him, then he went in to see a woman from among the Helpers [al-Ansar], so she slaughtered a sheep for him and he ate some of it. She also brought him a dish of ripe dates, and he ate some of them. Then he performed the minor ritual ablution for the noon prayer, and performed it. Then he departed, and she\nbrought him a leftover from the remnant of the sheep, and he ate. Then he performed the afternoon ritual prayer but did not perform the minor ritual ablution.”</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "It can be argued from this hadith that it is not necessary to perform wudhu after eating something that has been cooked on a fire. Proof may also be obtained from this hadith that Sayyidina Rasoolullah sallallahu alaihe wasallam ate twice in a day. For this reason it could be said that where it has been narrated that Sayyidina Rasoolullah sallallahu alaihe wasallam ate only once a day, it may have been said according to the knowledge of the narrator. It may also be said that in those narrations, the filling of the stomach twice has been denied, but eating twice has not been denied. A little may have been eaten the second time.",
        "ourHadithNumber": 30,
        "matchingArabicURN": 1901800,
        "last_updated": "2021-01-29 16:43:36"
    },
    {
        "englishURN": 1801710,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 172,
        "hadithText": "Umm al-Mundhir said:\n“Allah’s Messenger (Allah bless him and give him peace) came to see me with 'Ali. We had some suspended clusters of grapes, so Allah’s Messenger (Allah bless him and give him peace) started to eat, and 'Ali was eating with him. Allah’s Messenger (Allah bless him and give him peace) therefore said to 'Ali: ‘Take it easy, O ‘Ali, for you are a convalescent!’ So 'Ali sat down while the Prophet (Allah bless him and give him peace) ate, and I offered them some chard and barley. The Prophet (Allah bless him and give him peace) said to 'Ali: ‘Eat some of this, for this is more appropriate for you'!”</b>",
        "bookID": "25.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "From this hadith we derive that to give consideration to the asbaab (causes) is not against tawakkul (complete faith and reliance in Allah). This has been discussed in detail in (Imam Ghazaliâ€™s) Ihyaa-ul-Uloom. Those who wish may refer to it there.",
        "ourHadithNumber": 31,
        "matchingArabicURN": 1901810,
        "last_updated": "2021-01-29 16:45:53"
    },
    {
        "englishURN": 1801720,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 173,
        "hadithText": "'A’isha, the Mother of the Believers (may Allah be well pleased with her), said:\n\"The Prophet (Allah bless him and give him peace) used to come to me and say: “Do you have something for lunch?” I would say: “No,” so he would say: “I am fasting.” When he came to me one day, I said: “O Messenger of Allah, we have been given a gift!” He said: “What is it?” I said: “It is a meal of dates mixed with butter and curds.” He said: “As for me,\nI began the day fasting.” But then he ate.”</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "Two mas’alahs are derived from this hadith. One is that the intention of a nafl fast could be made any time before half of the day has passed, on condition that nothing that nullifies the fast had been committed. Sayyidina Rasoolullah sallallahu alaihe wasallam made the intention (of fasting) after enquiring from Syyidatina Aishah radiyallahu anha. This is the Madh’hab of the Hanafis and Shafi’is. The Madh’hab of Imam Malik rahmatullahi alaihe is that intention of a nafl fast is necessary from night. In this mas’alah we gain support from the above hadith. But because it is against the Madh’hab of a reputed Imam, it is better if the intention of nafl fast is made during the night. If due to circumstances this could not be done, there is no harm if the intention is made a little before Zuhr on that day.  \r\nThe second mas’alah is, if one has observed a nafl fast, one has the option of breaking it. This is the Madh’hab of Imam Shafi’i. According to the Hanafisit is impermissible to break a fast or salaah, because of the verse, ‘Do not nullify your deeds.’ (47:32) But since we find from this hadith the breaking of the fast, we may act on both in the following manner. Due to an important factor or necessity we may regard it as a concession from this hadith, normally it is impermissible to break the fast without a reason. It is also clear from the hadith that this was the reason of Sayyidina Rasoolullah sallallahu alaihe wasallam breaking the fast. Some Ulama have explained that this sentance, “I made an intention of fasting,” was not a firm intention but just a thought that I shall fast today. According to this humble servant the first explanation is correct.  \r\nMas’alah: According to the Hanafis, because of some necessity, if a nafl fast is broken, then it will be wajib to observe a recompensation. It has been narrated in a hadith from Sayyidatina Aishah radiyallahu anha wherein Sayyidina Rasoolullah sallallahu alaihe wasallam told her to observe a recompensation on another day.  ",
        "ourHadithNumber": 32,
        "matchingArabicURN": 1901820,
        "last_updated": "2021-01-29 16:47:07"
    },
    {
        "englishURN": 1801730,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 174,
        "hadithText": "Yusuf ibn 'Abdi’llah ibn Salam said:\n“I saw the Prophet (Allah bless him and give him peace) take a slice of barley-bread. Then he put a dried date on it and said: ‘This is the condiment for this,’ and he ate it.”</b>",
        "bookID": "25.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "Because dates were not regarded as a curry, Sayyidina Rasoolullah sallallahu alaihe wasallam suggested that dates could be used in place of curry. The few days of oneâ€™s life could also be covered in this manner. One should spend oneâ€™s life in things that will benefit in the Hereafter and forever. It should be pondered upon, and all of oneâ€™s time should not be wasted in maintaining and nourishing the stomach. It is very foolish to do so, because the few days we are granted in this world will, in any way pass. Death brings an end to all difficulties. We should ponder on those things that even death cannot bring an end to.",
        "ourHadithNumber": 33,
        "matchingArabicURN": 1901830,
        "last_updated": "2021-01-29 16:48:02"
    },
    {
        "englishURN": 1801740,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 175,
        "hadithText": "Anas said about Allah’s Messenger (Allah bless him and give him peace):\n\"He used to like the dregs [ath-thufl].” 'Abdullah said: “That means what is left over from the meal.”</b>",
        "bookID": "25.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "This is the sign of the complete humbleness of Sayyidina Rasoolullah sallallahu alaihe wasallam. He first fed others, then chose for himself what was left over. There are many instances in the ahaadith that inform us of this. Some Ulama state that the reason for this is because food at the bottom is less fatty and also digests quickly.",
        "ourHadithNumber": 34,
        "matchingArabicURN": 1901840,
        "last_updated": "2021-01-29 16:49:03"
    },
    {
        "englishURN": 1801491,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 25,
        "bookName": "Description Of The Curry Of Rasoolullah",
        "babNumber": "25.00",
        "babName": "Chapter 25. Description Of The Curry Of Rasoolullah",
        "hadithNumber": 150,
        "hadithText": "Another chain reports similar to the previous narration and it did not mention \"related from 'Umar (RA)\"</b>",
        "bookID": "25.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 1901590,
        "last_updated": "2020-07-02 07:50:37"
    }
]