[
    {
        "englishURN": 1801750,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 26,
        "bookName": "Chapter 26. Rasoolullah Performing Wudu At The Time Of Eating",
        "babNumber": "26.00",
        "babName": "Chapter 26. Rasoolullah Performing Wudu At The Time Of Eating",
        "hadithNumber": 176,
        "hadithText": "Ibn Abbas said:\n\"Allah’s Messenger (Allah bless him and give him peace) emerged from the toilet, whereupon the meal was presented to him and they said: 'Should we not bring you water for the minor ritual ablution?' He replied: 'I have only been commanded to perform the minor ritual ablution when I get ready for the ritual prayer'.”</b>",
        "bookID": "26.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "Technical wudu is only waajib for salaah. It is not necessary to perform wudu before eating or immediately after relieving one's self. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam did not perform wudu for it must not be thought that wudu is compulsory after visiting the toilet.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1901850,
        "last_updated": "2021-01-30 15:57:30"
    },
    {
        "englishURN": 1801760,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 26,
        "bookName": "Chapter 26. Rasoolullah Performing Wudu At The Time Of Eating",
        "babNumber": "26.00",
        "babName": "Chapter 26. Rasoolullah Performing Wudu At The Time Of Eating",
        "hadithNumber": 177,
        "hadithText": "Ibn 'Abbas said:\n\"Allah’s Messenger (Allah bless him and give him peace) emerged from having a bowel movement and he was brought a meal, so he was asked: 'Will you not perform the minor\nritual ablution?' He replied: “Am I about to perform the ritual prayer, so that I should perform the minor ritual ablution'?”</b>",
        "bookID": "26.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "It has been mentioned in the previous hadith, that it is not mustahab to perform wudu before eating. It is better to be in the state of wudu at all times. Physical cleanliness has an effect on spiritual cleanliness. It is therefore recommended that wudhu be performed after visiting the toilet.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1901860,
        "last_updated": "2021-01-30 15:58:57"
    },
    {
        "englishURN": 1801770,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 26,
        "bookName": "Chapter 26. Rasoolullah Performing Wudu At The Time Of Eating",
        "babNumber": "26.00",
        "babName": "Chapter 26. Rasoolullah Performing Wudu At The Time Of Eating",
        "hadithNumber": 178,
        "hadithText": "Salman said:\n“I read in the Torah that the blessing of the meal is the minor ritual ablution after it, so I mentioned this to the Prophet (Allah bless him and give him peace), and I informed him of what I had read in the Torah. Allah’s Messenger (Allah bless him and give him peace) then said: ‘The blessing of the meal is the minor ritual ablution before it and the minor ritual ablution after it'!”</b>",
        "bookID": "26.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "It may be possible that only the time (after eating) is mentioned in the Tauraah. In this manner the other time (before eating) was added to the shari'ah of Muhammad Sallailahu 'Alayhi Wasallam. Many laws have been revealed that were not in the shari'ah of the previous ambiyaa. It is possible that both times are mentioned in the Tauraah, and since changes have been made to it, the law of washing the hands before eating, may have been removed from it. The 'ulama have stated that by 'Barakah (blessings) in washing the hands before eating', means increase in the food, and filling of the stomach. The 'Barakah of washing the hands after eating', means that the benefits and intention of eating is fulfilled. i.e. It becomes part of the body, creates energy and stamina, assists in strengthening one to perform 'ibaadah, and to possess good manners.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1901870,
        "last_updated": "2021-01-30 16:00:09"
    }
]