[
    {
        "englishURN": 1801780,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 27,
        "bookName": "Chapter 27. The Words That Of Rasoolullah Said Before and After Eating",
        "babNumber": "27.00",
        "babName": "Chapter 27. The Words That Of Rasoolullah Said Before and After Eating",
        "hadithNumber": 179,
        "hadithText": "Abu Ayyub Al-Ansari said:\n\"We were in the home of the Prophet (Allah bless him and give him peace) one day, and he served a meal. I had never seen a meal from which greater blessing was obtained at the beginning of our eating, nor less blessing at the end of it, so we said: 'O Messenger of Allah, how is this?' He said: 'We mentioned the Name of Allah when we ate. Then someone who ate sat down and did not pronounce the Name of Allah (Exalted is He), so Satan ate with him!’”</b>",
        "bookID": "27.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "According to the majority of the 'ulama, by the word 'Sh'aytaan eating the actual meaning is intended. It is not impossible for the shaytaan to eat and drink. In this hadith only Bismillah is mentioned, therefore the 'ulama say, if one only recites Bisrnillah before eating, it will suffice, but it is better and recommended that the full 'Bismillahir Rahmanir Rahim' be recited. The 'ularna have also written that it is better to say the bismillah audibly so that others who may have forgotten may also remember it.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1901880,
        "last_updated": "2021-01-30 16:04:51"
    },
    {
        "englishURN": 1801790,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 27,
        "bookName": "Chapter 27. The Words That Of Rasoolullah Said Before and After Eating",
        "babNumber": "27.00",
        "babName": "Chapter 27. The Words That Of Rasoolullah Said Before and After Eating",
        "hadithNumber": 180,
        "hadithText": "'A’isha said:\n“Allah’s Messenger said (Allah bless him and give him peace): ‘If one of you eats and forgets to mention Allah (Exalted is He) during his meal, let him say: B'ismillah awwalahu wa akhirahu, which means, 'In the name of Allah at its beginning and at its end'.”</b>",
        "bookID": "27.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1901890,
        "last_updated": "2021-01-30 16:05:52"
    },
    {
        "englishURN": 1801800,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 27,
        "bookName": "Chapter 27. The Words That Of Rasoolullah Said Before and After Eating",
        "babNumber": "27.00",
        "babName": "Chapter 27. The Words That Of Rasoolullah Said Before and After Eating",
        "hadithNumber": 181,
        "hadithText": "'Umar ibn Abi Salama said that he went in to see Allah’s Messenger (Allah bless him and give him peace), who had a meal before him, so he said to him: 'O my dear son, pronounce\nthe Name of Allah(Exalted is He), eat with your right hand, and eat what is directly in front of you!’”</b>",
        "bookID": "27.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "The 'ulama are unanimous that it is sunnah to recite 'Bismillah'. According to the majority it is sunnah to eat with the right hand, and some say it is waajib. The reason being Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam cursed a person who ate with his left hand, subsequently that persons hand became paralysed. This exemplary incident is mentioned in the kitaabs of hadith,that a person was eating with the left hand. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam advised him to eat with the right hand. He replied: 'I cannot eat with the right hand'. Sayyidina Rasulullah Saliallahu 'Alayhi Wasallam said: 'You will not be able to eat with it in the future also'. After that, his right hand did not reach his mouth. In another narration it is related that Sayyidina RasulIullah Sallallahu 'Alayhi Wasallam once saw a woman eating with her left hand. 'Sayidina Rasulullah Sallallahu 'Alayhi Wasallam cursed her, the woman died in a plague. It is stated in Ibn Maajah that Sayyidina Rasulullah Sallailahu 'Alayhi Wasallam said: 'The shaytaan eats with the left hand, therefore do not eat with the left hand'. According to some 'ulama, because of this narration, it is waajib to eat with the right hand. The majority of the 'ulama say it is sunnaah. Nevertheless, due to these ahaadith strict importance should be paid to eating with the right hand. Nowadays people do not pay head to this, especially when drinking water (and tea). This disease has spread wildly. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam has commanded, 'Eat with the right hand and drink with the right hand because the shaytaan eats and drinks with the left hand'. In the same manner according to some 'ulama it is waajib to eat from one's ownside (the food that is before one), but according to the majority it is sunnah.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1901900,
        "last_updated": "2021-01-30 16:09:32"
    },
    {
        "englishURN": 1801810,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 27,
        "bookName": "Chapter 27. The Words That Of Rasoolullah Said Before and After Eating",
        "babNumber": "27.00",
        "babName": "Chapter 27. The Words That Of Rasoolullah Said Before and After Eating",
        "hadithNumber": 182,
        "hadithText": "Abu Sa‘id al-Khudri said:\n“Allah’s Messenger (Allah bless him and give him peace) used to say, when he had finished his meal: ‘Praise be to Allah, who has fed us and quenched our thirst, and has made us Muslims'!”</b>",
        "bookID": "27.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1901910,
        "last_updated": "2021-01-30 16:11:25"
    },
    {
        "englishURN": 1801820,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 27,
        "bookName": "Chapter 27. The Words That Of Rasoolullah Said Before and After Eating",
        "babNumber": "27.00",
        "babName": "Chapter 27. The Words That Of Rasoolullah Said Before and After Eating",
        "hadithNumber": 183,
        "hadithText": "Abu Umama said:\n“When the table was removed from in front of him, Allah’s Messenger (Allah bless him and give him peace) used to say: ‘Much fine blessed praise to Allah! It is neither the last of our food, nor can it be dispensed with, O our Lord'!”</b>",
        "bookID": "27.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1901920,
        "last_updated": "2021-01-30 16:12:30"
    },
    {
        "englishURN": 1801830,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 27,
        "bookName": "Chapter 27. The Words That Of Rasoolullah Said Before and After Eating",
        "babNumber": "27.00",
        "babName": "Chapter 27. The Words That Of Rasoolullah Said Before and After Eating",
        "hadithNumber": 184,
        "hadithText": "'Aisha said:\n\"The Prophet (Allah bless him and give him peace) was eating with six of his Companions, when a Bedouin came and devoured it in two mouthfuls, so Allah’s Messenger said (Allah bless him and give him peace): 'If he had invoked the Name of Allah, it would have been enough for you all'!”</b>",
        "bookID": "27.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "Because the badawi did not recite Bismillah, the shaytaan joined and finished everything. The barakah of the food vanished.",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1901930,
        "last_updated": "2021-01-30 16:13:52"
    },
    {
        "englishURN": 1801840,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 27,
        "bookName": "Chapter 27. The Words That Of Rasoolullah Said Before and After Eating",
        "babNumber": "27.00",
        "babName": "Chapter 27. The Words That Of Rasoolullah Said Before and After Eating",
        "hadithNumber": 185,
        "hadithText": "Anas ibn Malik said:\n\"Allah’s Messenger said (Allah bless him and give him peace): 'Allah is surely well pleased with the servant’s eating and praising Him for the food, or drinking and praising Him for the drink'!”</b>",
        "bookID": "27.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1901940,
        "last_updated": "2021-01-30 16:15:06"
    }
]