[
    {
        "englishURN": 1802120,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 33,
        "bookName": "Chapter 33. The Speech Of rasoolullah",
        "babNumber": "33.00",
        "babName": "Chapter 33. The Speech Of rasoolullah",
        "hadithNumber": 213,
        "hadithText": "'A’isha said (may Allah the Exalted be well pleased with her):\n\"Allah’s Messenger (Allah bless him and give him peace) would not speak on and on the way you do. Rather, he would pause periodically, so that those who sat with him would remember what he said.”</b>",
        "bookID": "33.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "The speech of Sayyidina Rasoolullah sallallahu alaihe wasallam was not of an abridged nature or was it fast, that nothing could be understood. He spoke calmly and clearly, word for word. A person sitting by him remembered what he said.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1902230,
        "last_updated": "2021-02-04 08:11:20"
    },
    {
        "englishURN": 1802130,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 33,
        "bookName": "Chapter 33. The Speech Of rasoolullah",
        "babNumber": "33.00",
        "babName": "Chapter 33. The Speech Of rasoolullah",
        "hadithNumber": 214,
        "hadithText": "Anas ibn Malik said:\n\"Allah’s Messenger (Allah bless him and give him peace) used to repeat each expression three times in order to make himself understood.”</b>",
        "bookID": "33.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "If what he was explaining was difficult or it was something that had to be given a thought, or if there were many people, he faced all three sides and repeated it to every side, so that those present understood well what he was said. Repeating a thing thrice was maximum. If saying a thing twice only sufficed, he only said it twice.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1902240,
        "last_updated": "2021-02-04 08:12:03"
    },
    {
        "englishURN": 1802140,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 33,
        "bookName": "Chapter 33. The Speech Of rasoolullah",
        "babNumber": "33.00",
        "babName": "Chapter 33. The Speech Of rasoolullah",
        "hadithNumber": 215,
        "hadithText": "Al-Hasan ibn 'Ali said (may Allah the Exalted be well pleased with him and his father):\n“I said to my maternal uncle, Hind ibn Abi Hala, who was skilled at describing people: ‘Describe for me the manner of speech Allah’s Messenger (Allah bless him and give him peace)!’ He said: Allah’s Messenger (Allah bless him and give him peace) was constantly sympathetic with sorrows, persistent in thought, having no repose, prolonged in silence. He would not speak unnecessarily. He would introduce and conclude his speech with: 'Bismillahi ta'ala [In the Name of Allah, Exalted is He]!' He would speak using simple words bearing many profound meanings [bi-jawami'i ’l-kalim]. His speech was concise, neither excessive nor abridged. It was neither uncouth nor contemptible. He would extol a blessing, however small, and he would not find fault with any aspect of it. He neither condemned nor praised those who enjoyed food and drink, and he would not be angered by this world. If the truth were overstepped, he would be so furious that he could do nothing but right the wrong. He would not be angry for his own sake or come to his own defense. When he beckoned, he beckoned with the whole of the palm of his hand, and when he was astonished, he turned it over, and when he spoke, he gestured with his hands, and placed his right palm over the base of his left thumb. When he was angry, he turned away and averted his face, and when he was happy, he lowered his gaze. Most of his laughter was in the form of a smile that revealed teeth as white as hailstones'.”</b>",
        "bookID": "33.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "This hadith is the remaining portion of the seventh hadith mentioned in the first chapter. Every sentence of it should be read carefully and one should try to emulate them as much as possible. Every action of Sayyidina Rasoolullah sallallahu alaihe wasallam is complete in humbleness and etiquette. Sayyidina Hind ibn Abi Haalah radiyallahu anhu is a step brother of Sayyiditina Faatimah radiyallahu anha.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1902250,
        "last_updated": "2021-02-04 08:15:49"
    }
]