[
    {
        "englishURN": 1802410,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 38,
        "bookName": "Chapter 38. The Sleeping Of Rasoolullah",
        "babNumber": "38.00",
        "babName": "Chapter 38. The Sleeping Of Rasoolullah",
        "hadithNumber": 242,
        "hadithText": "Al-Bara’ ibn 'Azib said:\n“When the Prophet (Allah bless him and give him peace) lay down to sleep, he placed the palm of his right hand under his right cheek and said: ‘O my Lord, preserve me from Your torment on the day when You resurrect Your servants!'”</b>",
        "bookID": "38.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "It is stated in the Hisn Haseen that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam recited this du'aa thrice. This has also been reported by 'Abdullah bin Mas'ud Radiyallahu 'Anhu in a narration. We find that this was the general Practice of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, which many Sahaabah Radiyallahu 'Anhum had witnessed. Although Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was sinless, he recited these types of du'aas (supplications) to express his humbleness and bond-manship. It is proper that a devoted worshipper asks only his creator, or this was done to educate the ummah. It is clear, from this hadith that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam slept on his right side. This was his noble practice. Therefore it is mustahab to sleep on the right side. A special benefit may be derived from this. The heart is on the left side of the chest, and by sleeping on the right side, the heart remains on the top side. One will not have a deep sleep, but will sleep lightly. If one sleeps on the left side, the heart will be at the bottom, which will result in a deep slumber. Some physicians have for this reason said, that it is good to sleep on the left side, because if one has a deep sleep, the food digest better. This is a fact. But there is a harm too, which has not be taken into consideration. If the heart is at the bottom, the weight of the whole body will be on it and this will affect it. The heart is one of the main organs of the body. Putting a little pressure on it may cause many diseases. Therefore, medically speaking, if it is good to sleep on the left, then too it is detrimental, from which one should at all times take precaution. In this respect, from the medical point of view it is important to sleep on the right side. Besides, sleeping on the right side reminds one of the grave. We have been commanded to remember death regularly. Many worldly and religious benefits are derived by constantly remembering death. One should constantly remember the breaker of all pleasures. The fact is this, how can one forget a thing that every being will experience which is sure to come and it is not known when it shall take place?",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1902540,
        "last_updated": "2021-02-07 12:05:11"
    },
    {
        "englishURN": 1802420,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 38,
        "bookName": "Chapter 38. The Sleeping Of Rasoolullah",
        "babNumber": "38.00",
        "babName": "Chapter 38. The Sleeping Of Rasoolullah",
        "hadithNumber": 243,
        "hadithText": "Hudhaifa said:\n“When the Prophet (Allah bless him and give him peace) went to his mattress, he would say: ‘O Allah, in Your Name I shall die and live,’ and when he woke up, he would say:\n‘Praise be to Allah, who has revived us after He caused us to die, and to Him is the resurrection!'”</b>",
        "bookID": "38.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "Sleep is synonymous with death. That is why sleep has been linked to death, and waking with life. For this reason too one should sleep on the right side, as sleeping is an example of death. Because sleep is likened to death, and waking up is becoming alive again. The 'ulama have written, it is a thing that should be pondered upon, that, after dying in this manner on the day of qiyaamah one will be given life again. In reality Allah 'Ta'aala has made this world a little replica of the hereafter. An example of everything has been made in this world so that one may ponder and take heed of things to come. The life in this world is not more than a dream. A person is happy, affluent, possessing all types of luxuries and does not experience any sort of trouble. If this person sees in a dream that he is being taken to jail and flogged, and is experiencing all types of calamities, not realising that it is a dream, he is distressed, and crying too. Suddenly the eyes open and all the tranquillity and happiness returns. The troubles of this dream does not remain nor are its effects felt. In the same manner, this is the state of a pious person. All the difficulties that are experienced in this world, are like a dream. After opening the eyes when all the happiness is experienced, what effect shall the dream have? But imagine the opposite? If one is experiencing luxuries in a dream, then on awakening one finds oneself in jail with all its punishments, what taste shall remain of a sweet dream? If a detainee that is sentenced to hard labour, sees in a dream that he has become king of the worlds, but after awakening finds himself chained in the dark dungeons, of what benefit will this king-manship be to him? The Sahaabah Radiyallahu 'Anhum understood this, they pleasantly endured all hardships, remembering that this life is but like a dream. May the Almighty Allah through His Infinite Mercy also grant us this valuable treasure. His Mercy is widespread.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1902560,
        "last_updated": "2021-02-07 12:06:06"
    },
    {
        "englishURN": 1802430,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 38,
        "bookName": "Chapter 38. The Sleeping Of Rasoolullah",
        "babNumber": "38.00",
        "babName": "Chapter 38. The Sleeping Of Rasoolullah",
        "hadithNumber": 244,
        "hadithText": "'A’isha said:\n\"When Allah’s Messenger (Allah bless him and give him peace) went to his mattress each night, he joined the palms of his hands, then breathed into them and recited into them: “Say: ‘He is Allah, One [qul Huwa'llahu Ahad]!' (Al-Qur'an;112:1), and: “Say: ‘I take refuge with the Lord of the Daybreak [qul a'udhu bi-Rabbil-falaq]!' (Al-Qur'an;113:1), and: “Say: ‘I take refuge with the Lord of humankind [qul a'udhu bi-Rabbi’n-nas]!' (Al-Qur'an;114:1), Then he passed them over as much of his body as he could, beginning with his head and his face and the front of his body, doing that three times.”</b>",
        "bookID": "38.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "The ahaadith state that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam recited different du'aas before he went to bed. He also recited different surahs and aayaat of the Qur-aan. It is reported from Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam that if one recites a portion of the Qur-aan before sleeping, an angel is appointed to protect one till one awakens. From the above hadith it is found that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam himself recited the three surahs mentioned. Besides these, it has been narrated that he recited the musabbihaat. i.e. those surahs that begin with Sabbaha, Yusabbibu, Subhaana etc. He also regularly recited the Surahs of (Alif Laam) Sajdah and Surah Mulk (Tabaarak). The ahaadith state that he also recited the Aayatul Kursi and the last two aayahs of Suratul Baqarah. A sahabi reports that, Sayidina Rasulullah Sallallahu 'Alayhi Wasallam Advised him to recite Suratul Kaafirun (Qul yaa ayyuhal kaafirun) before retiring to bed. Besides these, other du'aas have been narrated that were read by Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam before sleeping. - Fathul Baari.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1902570,
        "last_updated": "2021-02-07 12:09:43"
    },
    {
        "englishURN": 1802440,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 38,
        "bookName": "Chapter 38. The Sleeping Of Rasoolullah",
        "babNumber": "38.00",
        "babName": "Chapter 38. The Sleeping Of Rasoolullah",
        "hadithNumber": 245,
        "hadithText": "Ibn 'Abbas said:\n“Allah’s Messenger (Allah bless him and give him peace) slept until he gasped for breath, and he had gasped for breath while he was sleeping, so Bilal came to him and called him\nto the ritual prayer, whereupon he got up and performed the ritual prayer, and he did not perform the minor ritual ablution. And there is a story behind this tradition.\"</b>",
        "bookID": "38.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "It is a peculiarity of the Ambiyaa that their wudu does not become invalid by sleeping. For this reason Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam did not perform wudu. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam informed us of the reason. When the Ambiyaa sleep their hearts and minds do not sleep, only their eyes sleep. The dreams of the Ambiyaa are also revelations. They are protected from the influence of the shaytaan. The incident that Imaam Tirmidhi refers to took place at the House of the aunt of Sayyidina ibn 'Abbaas Radiyallahu 'Anhu. It will be discussed in the fifth hadith of the ensuing chapter. The subject was not relevant to this chapter, therefore the author omitted it here.",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1902580,
        "last_updated": "2021-02-07 12:11:39"
    },
    {
        "englishURN": 1802450,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 38,
        "bookName": "Chapter 38. The Sleeping Of Rasoolullah",
        "babNumber": "38.00",
        "babName": "Chapter 38. The Sleeping Of Rasoolullah",
        "hadithNumber": 246,
        "hadithText": "Anas ibn Malik said:\n“When Allah’s Messenger (Allah bless him and give him peace) went to his mattress, he would say: ‘Praise be to Allah, who has fed us and quenched our thirst, and has sufficed us\nand sheltered us, for how many there are without a provider of sufficiency and without a provider of shelter!'”</b>",
        "bookID": "38.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "The law of Allah is that when one leaves one's work to Allah, Allah Ta'aala also takes care and fulfils one's work through an unknown source. And whosoever keepeth his duty to Allah, Allah will appoint a way out for him. - Surah Talaq, 3.<br><br>And this is certainly completed on Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. Therefore the sufficing is of a complete nature. Thereafter, the more one relies and has trust in Allah, so much more does Allah fulfil one's needs. This has been mentioned in many ahaadith under different headings.<br><br>It is reported in a hadith: 'To whom poverty reaches and that person asks the people for rescue from starvation, then the persons needs are not fulfilled. If one puts forward one's request to Allah Ta'aala, then soon in someway or the other, that need is fulfilled'. In another hadith it is reported that Allah Ta'aala says: \"O son of man. If you free yourself (from all things) for the sake of My worship. I will fulfil your needs and fill you with richness (from all wants). Otherwise I will fill your hearts with problems and I will not let your needs be fulfilled\". Those who wait for their material needs to be fulfilled, so that they can spend their time for religious activities, should take heed from this. The only way to fulfil religious needs is to make oneself free from material needs, and concentrate on the path of Allah. The du'aa of the above hadith has been mentioned by Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam so that one may be reminded to express gratitude to Allah. It is important that everyone thank Allah according to one's capacity. The more one thanks Allah, the more one receives of His blessings. Allah Ta'aala says in the Qur-aan: \"If ye give thanks, 1 will give you more...\" - Surah Ebrahim, 7.<br><br>Allah Ta'aala has also commanded that one should remember those who are less fortunate, so that thanks may emit from the heart. How many people are there in the world who have no food and are starving? They do not have someone to aid them in their difficulties. How great is Allah Ta'aala's Mercy, that He has bestowed upon us such great bounties.",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1902590,
        "last_updated": "2021-02-07 12:12:30"
    },
    {
        "englishURN": 1802460,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 38,
        "bookName": "Chapter 38. The Sleeping Of Rasoolullah",
        "babNumber": "38.00",
        "babName": "Chapter 38. The Sleeping Of Rasoolullah",
        "hadithNumber": 247,
        "hadithText": "Abu Qatada said:\n“When the Prophet (Allah bless him and give him peace) alighted for rest at night, he would recline on his right side, and when he alighted for rest shortly before the morning, he would raise his forearm and place his head on the palm of his hand.”</b>",
        "bookID": "38.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "The reason being that if there was more time he lay flat and slept. His noble habit was to sleep on the right side. But if time was short, he lifted his arm and slept on it for a little while. In such circumstances he did not lie flat and sleep, as this might result in a deep slumber, and the time for the salaah would pass.<br></div>",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1902600,
        "last_updated": "2021-02-07 12:13:18"
    }
]