[
    {
        "englishURN": 1800310,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "Chapter 04. The Combing Of The Hair Of Rasoolullah",
        "babNumber": "4.00",
        "babName": "Chapter 04. The Combing Of The Hair Of Rasoolullah",
        "hadithNumber": 31,
        "hadithText": "A’isha said:\n“I used to comb the hair of Allah’s Messenger (Allah bless him and give him peace) while I was menstruating.”</b>",
        "bookID": "4.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "The Ulama prove from this Hadith that it permissible for a woman in her periods to look after and serve her husband. Because of the menstruation the whole body of a woman does not become najis (naapak-unclean). It is forbidden to have intercourse with her during her menstruation.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1900320,
        "last_updated": "2021-01-16 09:04:30"
    },
    {
        "englishURN": 1800320,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "Chapter 04. The Combing Of The Hair Of Rasoolullah",
        "babNumber": "4.00",
        "babName": "Chapter 04. The Combing Of The Hair Of Rasoolullah",
        "hadithNumber": 32,
        "hadithText": "Anas ibn Malik said:\n“Allah’s Messenger (Allah bless him and give him peace) made a frequent practice of oiling his head and combing his beard, and he often wore the head veil, so it was as if his\nrobe was the robe of an oil dealer.”</b>",
        "bookID": "4.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "The clothing becomes oiled due to the use of oil, and this was against the noble habit of Sayyidina Rasulullah (Sallallahu alaihe wasallam), who liked cleanliness. He put a cloth over his head so that the amaamah (turban) etc. did not become stained.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1900330,
        "last_updated": "2021-01-16 09:05:16"
    },
    {
        "englishURN": 1800330,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "Chapter 04. The Combing Of The Hair Of Rasoolullah",
        "babNumber": "4.00",
        "babName": "Chapter 04. The Combing Of The Hair Of Rasoolullah",
        "hadithNumber": 33,
        "hadithText": "'A’isha said:\n“Allah’s Messenger (Allah bless him and give him peace) used to love tayammun [beginning with his right hand, his right side and his right foot] in his ritual purification when\nhe purified himself, in his combing when he combed his hair, and putting on his shoes when he donned them.”</b>",
        "bookID": "4.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "(Also in every other deed, he first began with the right then the left).This (beginning from the right) is not confined to the three acts mentioned in this Hadith. Sayyidina Rasulullah (Sallallahu alaihe wasallam) began everything with the right, that is why every other deed' has been added in the translation of the Hadith. The basic rule is, that all those things that reflect dignity and elegance, while putting on these the right is preferred, and when removing them the left is begun with, as when putting on clothes, shoes etc. When one enters the Masjid, one enters with the right foot and leaves with the left foot first, as this is the place of dignity and greatness. Contrary to this, in those things that do not have elegance in them, for instance when entering the toilet.\r\n",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1900340,
        "last_updated": "2021-01-16 09:06:44"
    },
    {
        "englishURN": 1800340,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "Chapter 04. The Combing Of The Hair Of Rasoolullah",
        "babNumber": "4.00",
        "babName": "Chapter 04. The Combing Of The Hair Of Rasoolullah",
        "hadithNumber": 34,
        "hadithText": "'Abdullah ibn Mughaffal said:\n\"Allah’s Messenger (Allah bless him and give him peace) forbade combing except at intervals.”</b>",
        "bookID": "4.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "Qazi Iyaz says that occasionally means after every three days. In Abu Daud a Hadith has been reported, wherein Sayyidina Rasulullah (Sallallahu alaihe wasallam) prohibited the combing of hair daily. The Ulama have written that it is prohibited at such times when there is no necessity for it, otherwise there is no harm in it. The prohibition is karahate tanzihi. It is specially for the hair that has no dirt in it and does not need grooming. When the hair is dirty, there is no karaaha (i.e. not makruh) in combing the hair daily.\r\n",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1900350,
        "last_updated": "2021-01-16 09:08:35"
    },
    {
        "englishURN": 1800350,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "Chapter 04. The Combing Of The Hair Of Rasoolullah",
        "babNumber": "4.00",
        "babName": "Chapter 04. The Combing Of The Hair Of Rasoolullah",
        "hadithNumber": 35,
        "hadithText": "Humaid ibn 'Abd ar-Rahman relates on the authority of a man from among the Companions of the Prophet (Allah bless him and give him peace):\n\"The Prophet (Allah bless him and give him peace) used to comb his hair at intervals.”</b>",
        "bookID": "4.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1900360,
        "last_updated": "2021-01-17 14:03:42"
    }
]