[
    {
        "englishURN": 1802470,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 248,
        "hadithText": "Al-Mughira ibn Shu'ba said (may Allah be well pleased with him):\n\"Allah’s Messenger (Allah bless him and give him peace) performed the ritual prayer until his feet became swollen, so he was asked: 'Must you burden yourself with this, when\nAllah has already forgiven you your former and your latter sins?' He replied: 'Shall I not be a thankful servant?'”</b>",
        "bookID": "39.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "Apparently the questioner thought that prayers are for the forgiveness of sins. When Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam is sinless, how could he commit sin? Why should he voluntarily undergo such difficulties? Sayydina Rasulullah Sallallahu 'Alayhi Wasallam replied the object of worship is not only this, but has several reasons. When Allah Ta'aala has forgiven all my sins, then the correct and most appropriate thing is that I constantly worship Him and thank Him for His grace and blessings.Sayyidina 'Ali Radiyallahu 'Anhu says: \"Ibaadah is something performed because the object is Jannah, that is a businessman's 'ibaadah. The 'ibaadah is meant for purchasing. The price is paid here and the articles obtained there. Sometimes 'ibaadah is because of fear this is a slave's 'ibaadah. Ibaadah is performed for fear of punishment, as is the custom of the servant. One 'ibaadah is that which is performed without any future need or fear. It is solely for the gratitude of Allah's abudant blessings\".<br><br>It is mentioned in the above hadith that Allah Ta'aala has forgiven all the sins of Sayydina Rasullullah Sallallahu 'Alayhi Wasallam. A doubt may arise here, that he committed a sin, but Allah Ta'aala forgave him. Whereas all the Ambiyaa (prophets) are sinless. They do not commit sins. The 'ulama have given many answers to this question, which are mentioned in their respective places. Especially many answers have been given in tafseer (commentary) Sura Fath. According to this Humble servant the easiest is: The deeds of the pious are regarded as a sin for the near one's to Allah. One commits a sin according to one's status. According to the status of Sayydina Rasulullah Sallallahu 'Alayhi Wasallam, that which is considered to be shortcoming, is of such a nature, that for the rest of us they are the very essence of devotion. As an example: Sayydina Rasulullah Sallallahu 'Alayhi Wasallam was conferring with the leaders of the kuffar (non believers) in the hope that they might except Islaam. Which in essence is the core of the deen. At that moment a blind Sahaabi, Sayydina Ibn Ummi Maktum Radiyallahu 'Anhu came to Sayyidina Rasulullah Sallallahu 'Alayhi Wasallamand said something. Due to the importance of the discussion, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam felt annoyed at the Sahaabi's intrusion. On that Allah Ta'aala admonished Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam in the Sura of 'Abas. In the same manner after the Battle of Badr, Sayyidina Rasulullah Sallallhu 'Alayhi Wasallam treated the prisoners of war with great kindness and mercy, in the hope that they would accept Islaam, or their offspring would accept Islaam. He took fidyah (ransom) from them and freed them. He was cautioned in the Qur-aan on this. These are such cases, which due to high rank of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, are regarded as shortcomings.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1902610,
        "last_updated": "2021-02-07 12:15:20"
    },
    {
        "englishURN": 1802480,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 249,
        "hadithText": "Abu Huraira said (may Allah be well pleased with him):\n\"Allah’s Messenger (Allah bless him and give him peace) used to perform the ritual prayer until his feet had begun to swell, so he was asked: 'Must you do this, when it has come to you that Allah has already forgiven you your former and your latter sins?’ He replied: 'Shall I not be a thankful servant?'”</b>",
        "bookID": "39.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "A detailed narration has been narrated from Sayyiditina 'Aayeshah Radiyallhu 'Anha regarding this thanks-giving. Sayyidina 'Ataa Radiyallahu 'Anhu says: \"I once requested 'Aayeshah to a surprising incident of Rasulullah Sallallhu 'Alayhi Wasallam?. 'She replied: 'Which act of Rassulullah Sallallahu 'Alayhi Wasallam was such that it was not surprising'. Thereafter she said: 'One night Rasulullah Sallallhu 'Alayhi Wasallam returned home to sleep and slept with me in my blanket. After a little while, as he was sleeping he said: 'Forget it, let me worship my creator'. Saying this he got up, performed wudhu and began to perform salaah. He began weeping till the tears flowed on to his mubaarak chest. He then performed ruku', and continued crying in this posture. Then performed sajdah and kept on weeping in this posture too. He stood up from the sajdah and remained crying. He remained in this state till the morning when Bilaal came to call out the adhaan. I said: O Messenger of Allah, why did you cry so much? Allah Ta'aala has forgiven all your past and future sins'. Sayyidina Rasulullah Sallallhu 'Alayhi Wasallam replied: 'Should I not be a thankful servant of Allah? Then said: 'Why should I not do so, when these aayaat were revealed to me today, and recite the aayaat of the last ruku' of Sura Aali 'Imran'\".",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1902620,
        "last_updated": "2021-02-07 12:16:29"
    },
    {
        "englishURN": 1802490,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 250,
        "hadithText": "It is also reported from Abu Huraira, may Allah be well pleased with him that:\nAllah’s Messenger (Allah bless him and give him peace) used to stand performing the ritual prayer until his feet had begun to swell, so he would be asked: “O Messenger of Allah, must you do this, when Allah has already forgiven you your former and your latter sins?” He replied: “Shall I not be a thankful servant?”</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "Due to its importance Imaan Tiridhi had mentioned this hadith from three sources. A question may arise on these narrations that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam had many a time forbidden that one should exert one's self more than one can bear. The fact is, that humans have been created solely for the worship of Allah. Allah Ta'aala says in the Qur-aan 'I created the jinn and mankind only that they might worship Me'. - Surah Dhaariyaat,56. When this is the sole reason for creating man, then the more importance it is given and the more one worships, the more will it be desirable and praiseworthy. Whenever it was prohibited, it was because of some obstacle and trouble. Where it creates an obstacle or an obstacle exists, there it is undesirable. Among such obstacle may be boredom, confusion and perplexity, as a result it is left to altogether. There is a famous proverb in Urdu. 'Do not run and walk. nor tear up and fall'. The ahaadith wherein it has been prohibited are because of the reason mentioned already. Sayyidina Rasulullah Sallallhu 'Alayhi Wasallam has said: 'Practice only the amount that can be borne'. Allah Ta'aala does not withhold the granting of ajr (thawaab-reard) till one does not become bored of 'amal (practice). For this reason the 'ulama prohibit one from exerting one's self. It is possible that one will become bored and leave it completely. The attributes and qualities of Sayyidina Rasulullah Sallallhu 'Alayhi Wasallam is much higher than this. There was no probability of his becoming bored or tired. Sayyidina Rasulullah Sallallhu 'Alayhi Wasallam has said: 'The coolness of my eyes is in salaah'. Why should it not be, when salaah is a secret link with Allah? The amount of enjoyment a pious and sincere person like Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam may experience, cannot be imagined. Only those who are unlucky become bored.<br><br>In the same manner the second prohibition that has been mentioned in the ahaadith, is because of negligence in fulfilling the compulsory rights and duties. By exerting one's self, weakness is felt. As a result one becomes negligent in fulfilling the rights of others. The question does not rise for Sayyidina Rasulullah Sallallhu 'Alayhi Wasallam, for such a great and venerated holy personage, who while performing such great endeavours and eating less, could also fulfil the desires of nine wives.<br><br>Therefore the question of weakness does not arise. Likewise, this is the case with all other obstacles. Which benefited Sayyidina Rasulullah Sallallahu'Alayhi Wasallam. Therefore there are no perplexities in these types of ahaadith.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1902630,
        "last_updated": "2021-02-07 12:19:42"
    },
    {
        "englishURN": 1802500,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 251,
        "hadithText": "Al-Aswad ibn Yazid said:\n“I asked 'A'sha (may Allah be well pleased with her) about the nighttime ritual prayer of Allah’s Messenger (Allah bless him and give him peace), so she said: ‘He used to sleep at the beginning of the night. Then he would get up, and when it was the time before daybreak, he performed a witr [a ritual prayer with an odd number of cycles]. Then he came to his\nmattress, and if he had a need, he had sexual intercourse with his wife. When he heard the call to prayer, he sprang up, and if he was in a state of major ritual impurity, he poured\nwater over himself, and if not, he performed the minor ritual ablution and went out to the ritual prayer.”</b>",
        "bookID": "39.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "The physicians say the best time for intercourse is the last part of the night. At that time the stomach is mild and both parties are fresh with regained strength. In the first part of the night, the stomach is full. In such a state it is detrimental to have intercourse. It is more detrimental when one is hungry. In the last portion of the night the stomach is not too full, nor is it very empty so that one feels hungry. All this is medically speaking. In the shari'ah it is permissible to have intercourse with the wife at other times. This is evident that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam had relations in the first part of the night and at different times of the day. Some mashaa-ikh have written that if one has intercourse with the wife at the time of salaah, resulting in her falling pregnant, the child from that union will be disobedient to the parents. (Because of the disobedience of the parents in not fulfilling salaah).",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1902640,
        "last_updated": "2021-02-07 12:23:49"
    },
    {
        "englishURN": 1802510,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 252,
        "hadithText": "Ibn 'Abbas informed him that he spent the night in the home of Maimuna, his maternal aunt and he said:\n\"I reclined across the cushion and Allah’s\tMessenger (Allah bless him and give him peace) reclined lengthwise, whereupon Allah’s Messenger (Allah bless him and give him peace) slept until the middle of the night, or a little while before or after it. Allah’s Messenger (Allah bless him and give him peace) then woke up, wiped the sleep off his face, and recited the final ten verses of the Sura of the Family of ‘Imran\n[Al 'Imran]. Then he approached a suspended waterskin, performed the minor ritual ablution and performed it well, after which he performed the ritual prayer.”\nAbdullah ibn 'Abbas said: “I got up and stood by his side, whereupon Allah’s Messenger (Allah bless him and give him peace) placed his right hand on my head, gripped my right ear and twisted it. After this he performed two cycles of ritual prayer, then two more cycles, then two more cycles, then two more cycles, then two more cycles, then two more cycles..” He (Ma'an) said: “... six times, after which he performed an odd-numbered cycle. Then he reclined until the muezzin came to him, whereupon he got up and performed two abbreviated cycles. Then he went out and performed the early-morning ritual prayer\".</b>",
        "bookID": "39.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "It is stated that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam performed different amounts of rak'ahs in tahajjud. These are according to different times. If there was time he performed more rak'ahs, otherwise less rak'ahs were performed. There are no specified amount of rak'ahs for tahajjud. Many a time Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam performed less rak'ahs, although there was time to Perform more rak'ahs. He certainly recited lengthy portions from the Qur-aan, as is mentioned in the different ahaadith in this chapter.",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1902650,
        "last_updated": "2021-02-07 12:27:45"
    },
    {
        "englishURN": 1802520,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 253,
        "hadithText": "Ibn 'Abbas said:\n\"The Prophet (Allah bless him and give him peace) used to perform thirteen cycles of ritual prayer during the night.”</b>",
        "bookID": "39.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "He performed ten rak'ahs of tahajjud and three rak'ahs witr salaah. Some of the 'ulama have included the two sunnahs of fajr salaah too. In that case tahajjud will be eight rak'ahs.",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1902660,
        "last_updated": "2021-02-07 12:28:36"
    },
    {
        "englishURN": 1802530,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 254,
        "hadithText": "A’isha said:\n\"If the Prophet (Allah bless him and give him peace) did not perform the ritual prayer during the night, because sleep had prevented him, or his eyes had been too weary, during the daytime, he would perform twelve cycles of ritual prayer during the daytime.”</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "If tahajjud was fard on Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam then it is apparent that he performed qadaa. If it was not fard then he performed qadaa because of it being meritorious and full of virtue.' In the Sahih Muslim, Sayyidina 'Umar Radiyallahu 'Anhu relates a saying of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam that 'If a person could not fulfil his wird (daily practices) and ma'mul (regular practices) at night, one should complete them anytime in the morning before noon. It will be just as if he had completed them at night'. The mashaa-ikh of suluk (spiritual guides) take from this that if one cannot get through one's daily and regular practices at night, one should complete them in the morning. Because of the time passing by, one should not ignore it, otherwise the nafs will become accustomed to it.",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1902670,
        "last_updated": "2021-02-07 12:29:22"
    },
    {
        "englishURN": 1802540,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 255,
        "hadithText": "Abu Huraira said:\n\"The Prophet said (Allah bless him and give him peace): 'If one of you gets up during the night, let him begin his ritual prayer with two abbreviated cycles.'”</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "So that one may not become tired quickly by beginning to perform lengthy rak'ahs. Some 'ulama have written that these two rak'ahs are that of tahiyyatul wudu, it is preferable to shorten these rak'ahs as we have been commanded to do. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam also shortened the rak'ahs of this prayer. Haafiz Ibn Hajar has written a fine point in his commentary on the Bukhaari. He says that it is stated in a hadith that when a man sleeps, the shaytaan fastens three knots in the hair like a magician, in which this spell is cast that the night is still very long, keep on sleeping. When one gets up and recites the name of Allah, i.e. a du'aa etc., the first knot loosens. When wudu is performed the second knot opens. Therefore it has been commanded that two short rak'ahs be performed, so that the third knot also opens. The remaining portion of the salaah will be performed, whilst one is free from the deceits of the shaytaan. Sayyidina Rasulullah Sallallahu' Alayhi Wasallam was free from the guile of the shaytaan, but as an example for the ummah, he considered their necessities and to teach them, many a time he shortened these rak'ahs as has been mentioned in the narrations.",
        "ourHadithNumber": 8,
        "matchingArabicURN": 1902680,
        "last_updated": "2021-02-07 12:30:19"
    },
    {
        "englishURN": 1802550,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 256,
        "hadithText": "Zaid ibn Khalid al-jahuhani said:\n“Determined to contemplate the ritual prayer of the Prophet (Allah bless him and give him peace) intently, for I laid my head on his doorstep or [the entrance to] his hair tent. Allah’s Messenger (Allah bless him and give him peace) then performed two brisk cycles of ritual prayer. After this he performed two long, long, long cycles. Then he performed two cycles that were shorter than the two before them. Then he performed two cycles that were shorter than the two that were before them. Then he performed two cycles that were shorter than the two that preceded them. Then he performed two cycles that were shorter than the two that were before them. Finally he performed a single-numbered cycle, which added up to a total of thirteen cycles.”</b>",
        "bookID": "39.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "Those who are of the opinion that witr is one rak'ah, say that two rak'ahs nafl were performed six times and one rak'ah witr. The total of which is thirteen. Those who are of the opinion that witr is three rak'ahs, say that a total of fifteen rak'ahs were performed. Thirteen rak'ahs are counted in this manner, that the first two rak'ahs of tahiyyatul wudu are not included in a few narrations. \"Then he Performed two rak'ahs shorter than the previous one\". This instead of being mentioned four times, is only mentioned thrice. In this case besides the two short rak'ahs of tahiyyatul wudu which is mentioned in the beginning, the total amounts to ten nafl rak'ahs. In such a case there is no other way but to accept witr as three rak'ahs. If witr is taken to be one rak'ah, then the total shall not amount to thirteen rak'ahs.<br><br>In this hadith it is mentioned that Sayyidina Zayd bin Khaalid, ,AI-Juhani -Radiyallahu 'Anhu slept on the threshold of the house or a tent of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. A narrator of this hadith is in doubt that did the teacher say the threshold of the house or that of the tent. The muhadditheen always took great care to convey the correct wordings. When in a little doubt, they always made this clear. It is evident that this was on the threshold of a tent, as this incident took place on a journey. When Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was in Madina, he slept at the house of one of his wives, and Sayyidina Zayd bin Khaalid Radiyallahu 'Anhu did not get a chance to observe this here. On a journey Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam may have slept alone in a tent, it is possible that none of his wives were accompanying him. In such as instance this probability is understood. Therefore this is most correct. The majority of the 'ulama say, this incident was at the time of a journey.",
        "ourHadithNumber": 9,
        "matchingArabicURN": 1902690,
        "last_updated": "2021-02-07 12:31:47"
    },
    {
        "englishURN": 1802560,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 257,
        "hadithText": "Abu Salama ibn 'Abd ar-Rahman asked 'A’isha (may Allah the Exalted be well pleased with her): \n“How was the ritual prayer of Allah’s Messenger (Allah bless him and give him peace) during Ramadan?” so she said: “Neither in Ramadan nor in any other month would Allah’s Messenger (Allah bless him and give him peace) add to the total of eleven cycles of [nighttime] ritual prayer. He would perform four — do not ask about their excellence or their length — then he would perform four — do not ask about their excellence or their length — and then he would perform three.”\n‘A'isha said (may Allah the Exalted be well pleased with her): “I said: ‘O Messenger of Allah, do you sleep before you perform the odd-numbered ritual prayer [witr]?' He said: ‘O 'A'isha, my eyes may sleep, but my heart does not sleep!’”</b>",
        "bookID": "39.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "There are very few important points in this hadith, of which two have been discussed already. Firstly, that Sayyidina Aayesha Radiyallahu 'Anha says that Sayyidina Rasullullah Sallallhu 'Alayhi Wasallam did not perform more than elevn ra'kahs in tahajjud in Ramadhaan or out of Ramadhaan. Whereas in the narration of Sayyidina ibn Abbas Radiyallahu 'Anhu, Sayyidina Zayd bin Khaalid Radiyallahu 'Anhu and other Sahaabah Radiyallahu 'Anhum, it s stated that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam performed thirteen ra'kahs. In a narration mentioned in Abu Daawud, Sayyiditina Aayesha Radiyallahu 'Anha in reply to a question from Sayyidina 'Abdullah bin Abi Qays Radiyallahu 'Anhu himself counted the rak'ahs of tahajjud as follows: that four and two is six, and two equals eight, and two ten, plus three is thirteen. It is even narrated by Sayyiditina Aayesh Radiyallahu 'Anha herself that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam performed thirteen rak'ahs. Abu Daawud informs us in a narration that it is reported from Sayyiditina 'Aayeshah Radiyallahu 'Anha that: \"Rasulullah Sallallahu 'Alayhi Wasallam did not perform (tahajjud) less than seven rak'ahs, or more than thirteen rak'ahs\". In the Muwatta Imaam Maalik, it is narrated that Sayyiditina Aayeshah Radiyallahu 'Anha said: \"Rasulullah Sallallahu 'Alayhi Wasallam performed thirteen rak'ahs at night. Then performed two short rak'ahs after the adhaan for the morning prayers were heard\". Some'ulama, after having seen the various ahaadith on this subject said the ahaadith of Sayyiditina 'Aayeshah Radiyallahu 'Anha on this subject is confusing, which means it is weak. There is no necessity to say they are confusing. What perplexity can there be if eleven rak'ahs. Were performed generally? Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam may have at times performed more, or less rak'ahs than these, as is evident from a few ahaadith.<br><br>The second discussion is that a few people derive the mas'alah from this hadith, that taraweeh is eight rak'ahs. Whereas from this narration it also cannot be said that tahajjud is only eight rak'ahs, as has been mentioned previously. This hadith has nothing to do with Taraweeh. The literal meaning of salaatul layl is the prayers of the night. By it nothing besides tahajjud is meant. If every prayer of the night is intended, then with the taraweeh, the faraa-id and sunan of maghrib and 'eshaa, all will be excluded, of which no solution can be found. In this only the tahajjud is mentioned, and the question is only intended for this salaah, which Sayyiditina 'Aayeshah Radiyallahu 'Anha kindly replied. The reason for asking is clear, that did Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam perform more acts of worship in Ramadaan than at normal times, as has been mentioned in several narrations. Therefore Sayyidina Abu Salamah Radiyallahu 'Anhu thought that it might be possible that more rak'ahs of tahajjud were performed. Upon inquiring, Sayyiditina 'Aayeshah Radiyallahu 'Anha replied in the negative. Otherwise it was also not the intention of Sayyiditina 'Aayeshah Radiyallahu 'Anha to leave aside the taraweeh. The rak'ahs of tahajjud were never more than eleven rak'ahs. The performing of thirteen rak'ahs has been confirmed Sayyiditina 'Aayeshah Radiyallahu 'Anha herself. On the subject of taraweeh, Maulana-Rashid-Ahmad Gangohi has written a detailed booklet 'Ar Ra'y an Najeeh in Urdu. Those who wish may refer to it. Briefly, in the ahaadith tahajjud is termed as salaatul layl (The prayer of the night), and taraeeh as Qiyaami Ramadhaan (The standing-in prayer-of Ramadhaan). These are two separate prayers. The consensus of many 'ulama is that by Qiyaami Ramadhaan, taraweeh is meant. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam paid much importance to the Qiyaam of Ramadhaan. In many ahaadith the importance of it has been stressed and practised also. Sayyidina Rasulullah Sallallhu 'Alayhi Wasallam has said: \"The one that stands in prayer in Ramadhaan with sincere faith and hope, all his sins are forgiven\". ('The ulama say by sins only the minor ones are intended).<br><br>Sayyidina Abu Hurayrah Radiyallahu 'Anhu reports that Sayyidina Rasulullah Sallallhu 'Alayhi Wasallam did not enforce a command that qiyaam should be made in Ramadhaan, but rather persuaded or commanded one to do so. Sometimes Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam performed this salaah (Taraweeh) with a large congregation, and excused himself for not performing it continuously, saying that it become fard. There are many reason for it possibly becoming fard by Sayyidina Rasulullah Sallallhu 'Alayhi Wasallam performing it regularly. Certainly the Sahaabah Radiyallahu Anhum, some individually and some in congregation performed this salaah till about the middle of the night, and at times a little longer. Sayyidina Umar Radiyallahu 'Anhu instructed the people in the time of his khilaafah to perform taraweeh with jamaa'ah (congregation) and not individually to avoid confusion. Sayyidina Saa-ib Radiyallahu 'Anhu says: \"The Imaam generally recited those surahs that consists of a hundred aayaat. We use to lean on something because of the standing for lengthy period and the tiredness that resulted. This salaah ended before suhur (sehri)\". Many 'ulama have written the consensus of the Ahlus-Sunnah wal Jamaa'ah that tarweeh is sunnah. From among the Ahlul-Qiblah (The people of the Qibila) none besides tha Rawaafid (Shi'ah) deny this. The four Imaams, viz Imaam Abu Hanifa RA, Imaam Shaafi'ee RA, Imaam Maalik RA, Imaam Humbal RA, all have mentioned this in their kitaabs of Fiqh (jurisprudence), that tarawee is twenty rak'ahs sunnah mu-akkidah. Acording to Imaam Maalik RA, a famous saying of his is that tarawee is thirty six rak'ahs.In the 'Mughni' a famous kitaab on Humbali fiqh, it is stated that the view of Ahmed bin Humbal RA is, that the most accepted saying is that taraweeh is twenty rak'ahs. This is also the madh-hab of Sufyaan Thaury RA, Imaam Abu Hanifa RA, and Imaam Shafi'ee RA. The madh-hab of Imaam Malik RA, is that it is thirty six rak'ahs. Imaam Malik RA said: \"An envoy of the king came to me, that a concession be given in the rak'ahs of taraweeh. I rejected this \". A student of Imaam Maalik RA says : \"Thirty nine rak'ahs were performed in Madinah. i.e. Thirty six for taraweeh, and three witr\". This subject has been discussed in detail in the kittab 'Awjaz'. My respected tutors said: 'The thirty six rak'ahs that were performed in Madina, of those, twenty were of taraweeh, between every Sayyidina (stop after every four rak'ahs) it is mustahab to rest the time it too to complete the four rak'ahs. Therefore the people performed four rak'ahs nafl in the Sayyidina. Hence the sixteen rak'ahs performed in the four taraweehs become extra. Anyhow, this is the madh-hab of the Maaliki's. The most accepted adh-hab of the remaining three Imaams are that it is twenty rak'ahs.",
        "ourHadithNumber": 10,
        "matchingArabicURN": 1902700,
        "last_updated": "2021-02-07 12:35:45"
    },
    {
        "englishURN": 1802570,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 258,
        "hadithText": "'A’isha said (may Allah be well pleased with her):\n“Allah’s Messenger (Allah bless him and give him peace) used to perform eleven cycles of ritual prayer during the night, making one of them odd-numbered [witr], and when he had finished, he would recline on his right side.”</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "This hadith contradicts the previous one, in which eight rak'ahs have been mentioned. For this reason some 'ulama have commented on the ahaadith of Sayyiditina 'Aayesha Radiyallahu 'Anha on this subject, which has already been discussed in the previous hadith. As a further explanation, this could also be said that this happened at different occasions. At a time Sayyidina Rasulullah Salallahu 'Alayhi Wasallam performed eight rak'ahs and a time more or less. The second question is about witr been mentioned as one rak'ah. There exists some differences regarding this salaah, the first is in its ordinance. The Hanafis say it is waajib and some Imaams say it is mustahab. As the hadith does not mention this, this question is omitted. Another difference is regarding the rak'ahs of witr. The madh-hab of Imaam Abu Hanifa RA is that witr consists of three collective rak'ahs with one salaam. Other Imaams are of the opinion that it is performed in a single rak'ah. Some say it is one rak'ah with two separate wajib rak'ahs and a salaam before it. Various narrations have been mentioned regarding this. The difference among the a-immah are, on which of these is preferable. The Hanafis support their view with a few ahaadith:The narration of Sayyidina 'Abdullah bin Abi Qays Radiyallahu 'Anhu that has been mentioned by Abu Daawud and others, which has been discussed already in the previous hadith, where Sayyiditina 'Aayesha Radiyallahu 'Anha has mentioned that the salaah of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam consisted of four and three, six and three, eight and three and ten and three. To mention this with such trouble and at every place mention three without increasing or decreasing the number of witr rak'ahs, is a clear proof that in this salaah there is no increase or decrease and remains three rak'ahs. Otherwise Sayyiditina 'Aayeshah Radiyallahu 'Anha would have said seven, nine, eleven, and not six and three etc.Mulla'Ali Qaari has written that the proof of the Hanafiyyah is that there is a consensus among the Sahaabah Radiyallahu 'Anhum that it is jaa-iz (permissible) and preferable that witr is three rak'ahs and there is a difference of opinion in rak'ahs less than this. Some say one rak'ah is also jaa-iz, others say it is altogether not jaa-iz. It is apparent that the consensus of the Sahaabah Radiyallahu 'Anhum is stronger and better than the one wherein there exist discordant views. Sayyidina Hasan Basri Radiyallahu 'Anhu, a famous muhaddith and one of the great sufis, say that there is a consensus among the Muslims that witr consists of three rak'ahs. Umar bin 'Abdul'aziz RA. - the second 'Umar- passed a law after consulting the 'ulama of Madinah, that witr must be performed in three rak'ahs. Hasan RA. was asked a question that 'Abdullah bin 'Umar performed three rak'ahs of witr with a salaam at the end of the second rak'ah and performed the third rak'ah separately? He replied: \"His father 'Umar performed the three rak'ahs of witr with one salaam, and he (Sayyidina'Umar Radiyallahu'Anhu) was more learned\".It has been prohibited in the ahaadith to perform only a single rak'ah. Sayyidina 'Abdullah bin Mas'ud Radiyallahu 'Anhu was informed that Sayyidina Sa'd Radiyallahu 'Anhu performed only a single rak'ah of witr. He said: \"A single rak'ah is not valid in salaah\". The Hanafis put forth many proofs from different sources. The 'ulama have written many books on it. In this chapter the fiqhi angle has not been discussed. It is briefly and sufficiently highlighted.",
        "ourHadithNumber": 11,
        "matchingArabicURN": 1902710,
        "last_updated": "2021-02-07 12:37:16"
    },
    {
        "englishURN": 1802580,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 259,
        "hadithText": "'A’isha said:\n\"Allah’s Messenger (Allah bless him and give him peace) used to perform nine cycles of ritual prayer during the night.”</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "In the madh-hab of the Hanafis this is six rak'ahs tahajjud and three rak'ahs witr. In a narration from Sayyidina 'Abdullah bin Abi Qays Radiyallahu 'Anhu, Sayyiditina 'Aayeshah Radiyallahu 'Anha herself has said the words: 'Six and three'.",
        "ourHadithNumber": 13,
        "matchingArabicURN": 1902730,
        "last_updated": "2021-02-07 12:46:46"
    },
    {
        "englishURN": 1802590,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 260,
        "hadithText": "Hudhaifa ibn al-Yaman (may Allah be well pleased with him) performed the ritual prayer with the Prophet (Allah bless him and give him peace) during the night, and he said:\n“When he entered into the ritual prayer, he said: ‘Allah is Supremely Great [Allahu Akbar], the Lord of power [jabarut], sovereignty [malakut], magnificence [kibriya’] and sublimity ['azama]! Then he recited the Sura of the Cow [al-Baqara]. Then he bowed down, and he bowed for approximately as long as he had stood erect, saying: ‘Glory be to my Lord, the Almighty! Glory be to my Lord, the Almighty!’ Then he raised his head, and he stood erect for approximately as long as he had bowed, saying: ‘To my Lord belongs the praise! To my Lord belongs the praise!’ Then he prostrated himself, and he prostrated for approximately as long as he had stood erect, saying: ‘Glory be to my Lord, the Most High! Glory be to my Lord, the Most High!’ Then he raised his head, and the pause between the two prostrations was approximately as long as the prostrations. During the pause he said: ‘My Lord, forgive me! My Lord, forgive me,’ until he recited the Suras of the Cow [al-Baqara], the Family of Imran [Al 'Imran], Women [an-Nisa’] and the Table Spread [al-Maida], or Cattle [al-An'am].”\nAccording to Abu 'Isa: “Shu'ba is the one who entertained doubts about [the Qur’anic Suras] al-Ma'ida and al- Anam.\"</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "This hadith apparently indicates that these four surahs were recited in four rak'ahs. The narration of Abu Daawud is more detailed and it is stated therein that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam performed four rak'ahs wherein he recited these four surahs. But in a narration of Sahih Muslim and others it is mentioned that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam recited Surah Baqarah, Surah Nisaa and Surah Aali 'Imraan, all three in one rak'ah. The narration of Abu Daawud and Muslim apparently seem to be on different occasions. Although it may also be possible that this is the same event and an error may have occurred in transmission. It is not necessary to suppose it is an error, as Sayyidina. Rasulullah Sallallahu 'Alayhi Wasallam daily performed lengthy prayers. There could be no perplexity if four surah' were recited in four rak'ahs once, and three surahs in one rak'ah at another time.",
        "ourHadithNumber": 14,
        "matchingArabicURN": 1902750,
        "last_updated": "2021-02-07 12:51:38"
    },
    {
        "englishURN": 1802600,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 261,
        "hadithText": "'A’isha said (may Allah be well pleased with her):\n\"Allah’s Messenger (Allah bless him and give him peace) spent one whole night reciting a verse from the Qur’an.”\n\n\nCommentary:\nThe aayah is the last aayah of Surah Maa-idah:<br><br>In tu-adh-dhib-hum fa-innahum 'ibaaduk. Wa in tagh-fir lahum fa-innaka antal azizul hakim.<br><strong>Translation</strong>: \"If Thou punish them, lo! they are Thy slaves, and if Thou forgive them, (lo! the are Thy slaves).Lo! Thou, only Thou, art Mighty, the wise\".Surah Maa-idah, 118.<br><br>The Being that possesses great power, if He wills, He may forgive the criminal. The One that is all Wise, there is Wisdom and benefit in every act of His. The reason for Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam reciting this aayah while standing and also in the ruku and sajdah, and repeating it many times, is to bring to mind the two attributes of Allah, namely the attributes of justice and forgiveness. The whole scene on the day of qiyaamah will be of these two things. It is stated that Imaam Aa'zam Abu Hanifah RA. also recited the following aayah the whole night:<br><br>Wamtaazul yauma ayyuhal mujrimun.<br><strong>Translation</strong>: \"But avaunt ye, O ye guilty, this day!\" Surah Yaseen, 58.<br><br>In this aayah too the scene of qiyaamah is portrayed. That today the sinners should separate and distinguish themselves. What a severe and nerve-chilling command this is. Today they are together with the pious and holy people and benefiting from the barakaat (blessings) they receive, but at this moment the sinners will be separated from them. May the Most Merciful Allah with His Grace keep those pious souls under His shadow, otherwise it is really a time for great trials.</b>",
        "bookID": "39.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 1902760,
        "last_updated": "2021-02-07 12:52:29"
    },
    {
        "englishURN": 1802610,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 262,
        "hadithText": "'Abdullah said:\n“I performed the ritual prayer one night with Allah’s Messenger (All^ bless him and give him peace), and he remained standing until I almost did something bad.” He was asked: “What did you almost do?” He replied: “I nearly sat down and left the Prophet (Allah bless him and give him peace) in the lurch!”</b>",
        "bookID": "39.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "This may have two meanings. If I sit and perform salaah Sayyidina Rasulullah Sallallahu'Alayhi Wasallam will remain standing alone. This was said to be a bad action and a sign of disrespect. There is a possibility that by saying 'sit down, he meant ending his prayer. It is clear that this is rude, bad and shows disrespect and carelessness, that while performing salaah with Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam to end the niyyah and sit down. While standing he became tired, then this type of thoughts entered his mind.",
        "ourHadithNumber": 16,
        "matchingArabicURN": 1902770,
        "last_updated": "2021-02-07 12:53:27"
    },
    {
        "englishURN": 1802620,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 263,
        "hadithText": "'A’isha said (may Allah be well pleased with her):\n“The Prophet (Allah bless him and give him peace) used to perform the ritual prayer sitting down, so he would also recite the Qur’an while he was seated. If the amount of his recitation remaining was thirty or forty verses, he would rise and recite standing up, and then he would bow and prostrate. Then he would do likewise in the second cycle.”</b>",
        "bookID": "39.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "A group among the 'Ulama have stated that it is not jaa-iz for a person performing salaah in a sitting posture to stand up - then perform the ruku'and sajdah. The majority of the 'ulama including the four a-immah say it is jaa-iz (permissible) to do so. Likewise it is also jaa-iz to stand and perform these. This applies only to nafl salaah. It is not permissible for the able-bodied who can stand, to sit and perform the fard salaah.",
        "ourHadithNumber": 17,
        "matchingArabicURN": 1902790,
        "last_updated": "2021-02-07 12:54:15"
    },
    {
        "englishURN": 1802630,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 264,
        "hadithText": "'Abdullah ibn Shaqiq said: \n“I asked 'A’isha (may Allah be well pleased with her) about the voluntary ritual prayers of Allah’s Messenger (Allah bless him and give him peace), and she said: ‘He used to spend a long night performing the ritual prayer while standing, and a long night while sitting, so if he recited the Qur’an while standing, he would bow and prostrate from a standing position, and if he recited while sitting, he would bow and prostrate from a sitting position.”</b>",
        "bookID": "39.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "The 'ulama give two meanings of the phrase 'long part of the night'. One is that a long portion was recited whilst standing and a long portion whilst sitting. The second is that this is the description of different nights. On some nights he recited lengthy sections whilst standing and on some nights he recited lengthy sections whilst sitting. The second explanation is more appropriate, which means it was the practice of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam always to recite lengthy sections in the rak'ahs of tahajjud. If he sometimes felt weak he sat and performed the tahajjud, otherwise he stood and performed it.<br><br>The last section of this hadith seems to contradict the previous one. The 'ulama have mentioned that both incidents are on separate occasions. The stipulation of nawaafil is on strength, willingness and happiness. Whatever strength and temperament was experienced at the time, salaah was performed accordingly. Besides, many acts of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam were meant to educate. He performed many deeds to let the people know that certain deeds could be performed in a particular manner. This is known as bayan jawaaz (sign of permissibility). Therefore Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam received the full reward for performing salaah in a sitting posture. Others will receive full reward for performing salaah in a standing posture and only half for sitting and performing salaah. The reason being that by Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam sitting and performing salaah, he was fulfilling an object of the nubuwwah (prophethood). The aim and mission of a nabi is to give a practical demonstration on how deeds are to be performed.",
        "ourHadithNumber": 18,
        "matchingArabicURN": 1902800,
        "last_updated": "2021-02-07 12:56:00"
    },
    {
        "englishURN": 1802640,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 265,
        "hadithText": "Hafsa, the wife of the Prophet (Allah bless him and give him peace), said:\n“Allah’s Messenger (Allah bless him and give him peace) used to perform voluntary ritual prayer sitting down , and he would recite the Sura and pronounce it slowly, so that it would seem to be longer than one that was actually longer than it.”</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "A small surah recited with tarteel and qira-ah, can take the same time as it takes to recite a longer surah (if recited in an ordinary manner). Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam recited the Qur-aan with calmness and little by little. He did not recite with haste. The time it took him to recite a small surah, takes another person the same time to recite a long surah. The reason his feet swelled, was due to standing for long periods.",
        "ourHadithNumber": 19,
        "matchingArabicURN": 1902810,
        "last_updated": "2021-02-07 12:56:51"
    },
    {
        "englishURN": 1802650,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 266,
        "hadithText": "A’isha said (may Allah be well pleased with her):\n“By the time the Prophet (Allah bless him and give him peace) died, he was performing most of his ritual prayers from a sitting position.”</b>",
        "bookID": "39.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "This was the period when Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam had become weak and he recited lengthy portions of the Qur-aan, as has been mentioned previously. He performed the major part of the nafl salaah whilst sitting for this reason. The ajr (thawaab- reward) for sitting and performing salaah is half that of performing salaah in a standing posture. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam is exempted from this rule. For Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam to sit and perform salaah, is the same in reward as that of standing and performing salaah as mentioned above. A narration has been mentioned in the Abu Daawud and other kitaabs that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam has said: \"I am not like you in this manner. I receive the same amount of ajr (thawaab-reward) when sitting and performing salaah\".",
        "ourHadithNumber": 20,
        "matchingArabicURN": 1902820,
        "last_updated": "2021-02-07 12:57:34"
    },
    {
        "englishURN": 1802660,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 267,
        "hadithText": "Ibn ‘'Umar said (may Allah be well pleased with him and his father):\n\"I performed two cycles of ritual prayer with Allah’s Messenger (Allah bless him and give him peace) before the noon prayer, and two cycles after it, and two cycles after the sunset prayer in his house, and two cycles after the evening prayer in his house.”</b>",
        "bookID": "39.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "The sunnah prayers are mentioned in this hadith. The importance of sunnah mu-akkidah according to the Hanafis are the same as that mentioned in the hadith of Sayyidina Ibn 'Umar Radiyallahu 'Anhu. The sunnah of zuhr are four instead of two according to the Hanafis. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam has said in many ahaadith: \"The one that continually and habitually performs twelve rak'ahs every day and night, Allah Ta'aala creates for him a house in Jannah\". The. details of the twelve rak'ahs have been mentioned in many ahaadith from Sayyiditina 'Aayeshah Radiyallah 'Anha and Sayyiditina Umm Habibah Radiyallahu'Anha, in which the same view is mentioned as the one narrated by Sayyidina Ibn 'Umar Radiyallahu 'Anhu. Certainly in these narrations it is stated that four rak'ahs were performed before the zuhr fard. It is reported in a hadith: \"The one that performs four rak'ahs with one salaam before zuhr, the doors of the heavens open up for that person\", which means it is quickly accepted. Bukhaari and Muslim narrate a hadith that Sayyidina Rasulullah Sallallahu'Alayhi Wasallam never omitted the four rak'ahs before zuhr. Musnad Ahmad, Abu Daawud and others have written a hadith of Sayyiditina 'Aayeshah Radiyallahu 'Anha that: \"Rasulullah Sallallahu 'Alayhi Wasallam performed four rak'ahs in the house before going for salaah\". Apparently it seems Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam performed the sunan at home, then went into the masjid, as mentioned by Sayyiditina 'Aayeshah Radiyallahu 'Anha and others. A detailed narration of Sayyiditina 'Aayeshah Radiyallahu 'Anha is mentioned in the Abu Daawud, wherein she states: \"Rasulullah Sallallahu 'Alayhi Wasallam performed four rak'ahs in my house, then went to the masjid and led the fard salaah. Thereafter he returned to the house and performed two rak'ahs'. He came to my house after maghrib salaah and performed two rak'ahs. He also came after the 'eshaa salaah and performed two rak'ahs, and after the subh saadiq performed two rak'ahs, then went for (the fajr) salaah\". From this detailed hadith we find that the sunan were often performed at home. When he did come to the masjid, it is probable that the tahiyyatul masjid was performed. Sayyidina Ibn 'Umar Radiyallahu 'Anhu reports, and this may be possible, that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam some- times because of necessity may have performed only two rak'ahs sunnah. Sayyidina Ibn 'Umar Radiyallahu 'Anhu saying in the hadith under discussion: \"That he performed salaah with Rasulullah Sallallahu 'Alayhi Wasallam\", does not mean that he performed them with jamaa'ah (in congregation). Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam performed his sunan and I (Sayyidina Ibn'Umar Radiyallahu 'Anhu) also performed my sunan. It has not been ascertained that sunnah prayers were performed with jamaa'ah (besides the taraweeh in Ramadaan).",
        "ourHadithNumber": 21,
        "matchingArabicURN": 1902830,
        "last_updated": "2021-02-07 12:58:29"
    },
    {
        "englishURN": 1802670,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 268,
        "hadithText": "Ibn 'Umar said (may Allah be well pleased with him and his father): “Hafsa said:\n'Allah’s Messenger (Allah bless him and give him peace) used to perform two cycles of ritual prayer when the dawn was rising, and the caller [to prayer] was calling'. And Ayyub said, “I think he described the two prayer cycles as abbreviated.”</b>",
        "bookID": "39.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "Regarding the sunnah of fajr, it has been stated in most of the narrations that Sayyidina Rasulullah Sallallahu'Alayhi Wasallam shortened its rak'ahs. To the extent that some 'ulama say, only the Faatiha (Alhamdu) should be recited and it is not necessary to add a surah to it. The fact is, that it has been ascertained that Sayyidina Rasulullah sallallahu'Alayhi Wasallam recited a surah therein. Certainly it is better to recite a short surah. A narration in the Sahih Muslim is mentioned that Sayyidina Rasullullah Sallallahu 'Alayh Wasallam recited the surahs of Kaafirun and AI-Ikhlaas in this sunnah. Other surahs have also been reported in the ahaadith. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam has said. \"How wonderful these two surahs are, that they are recited in the sunnahs of the fajr salaah\".",
        "ourHadithNumber": 22,
        "matchingArabicURN": 1902840,
        "last_updated": "2021-02-07 12:59:58"
    },
    {
        "englishURN": 1802680,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 269,
        "hadithText": "Ibn 'Umar said (may Allah be well pleased with him and his father):\n\"I recall eight cycles performed by Allah’s Messenger (Allah bless him and give him peace): two cycles before the noon prayer and two cycles after it, two cycles after the sunset prayer, and two cycles after the evening prayer.”\nIbn ‘Umar said: “Hafsa also told me about the two cycles of the early-morning prayer [al-ghad], but I did not see them performed by the Prophet (Allah bless him and give him peace).”</b>",
        "bookID": "39.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "Since these two rak'ahs were almost always performed in the house and mostly at the time of fajr the mind is not attentive, therefore, it is not impossible for Sayyidina Ibn 'Umar Radiyallahu 'Anhu to say this. Some 'ulama are of the opinion that the meaning of 'not observing it', is that he had not seen it at the time Sayyiditina Hafsah Radiyallahu 'Anha had seen it. He had the opportunity of observing it later as we find in a few narrations, where Sayyidina Ibn'Umar Radiyallahu 'Anhu describes his observance of these sunan. Of all the sunan, the one of the fajr is the most emphasised. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam many a time emphasised its importance. For this reason some 'ulama have declared it waajib. Particular importance should therefore be attached to it.",
        "ourHadithNumber": 23,
        "matchingArabicURN": 1902850,
        "last_updated": "2021-02-07 13:01:34"
    },
    {
        "englishURN": 1802690,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 270,
        "hadithText": "Abdullah ibn Shaqiq said: \n\"I asked 'A’isha (may Allah be well pleased with her) about the ritual prayer of Allah’s Messenger (Allah bless him and give him peace), and she said: 'He used to perform two cycles of ritual prayer before the noon prayer and two cycles after it, two cycles after the\nsunset prayer, two cycles after the evening prayer, and two before the dawn prayer.’”</b>",
        "bookID": "39.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "Besides the two rak'ahs before the zuhr, the rak'ahs mentioned are the same as that of the Hanafi madh-hab. The view of the Hanafis is that the sunnah before zuhr consists of four rak'ahs. This has been mentioned previously in the commentary of the hadith narrated by Sayyidina Ibn 'Umar Radiyallahu 'Anhu. A hadith of Sayyiditina, 'Aayeshah Radiyallahu 'Anha is mentioned in the Bukhaari that: \"Rasulullah Sallallahu 'Alayhi Wasallam did not neglect the performing of four rak'ahs before zuhr, and two rak'ahs before fajr\". Meaning he performed them regularly. Therefore, it shall be said that this (performing of two rak'ahs) was because of some necessity.",
        "ourHadithNumber": 24,
        "matchingArabicURN": 1902860,
        "last_updated": "2021-02-07 13:03:37"
    },
    {
        "englishURN": 1802700,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 271,
        "hadithText": "'Asim ibn Damra said: \n“We asked 'Ali (may Allah ennoble his countenance) about the ritual prayer of Allah’s Messenger (Allah bless him and give him peace) in the daytime, and he said:\n‘You would be incapable of that,’ so we said: Anyone of us who is capable of that will perform it!’ He therefore said: ‘When the sun was from over here [pointing eastward], like its appearance from over here [pointing westward], at the time of the afternoon prayer, he used to perform two cycles of ritual prayer, and when the sun was from over here, like its appearance from over here, at the time of the midday prayer, he would perform four. He would also perform four cycles before the midday prayer and two after it, and four before the afternoon prayer, separating each pair of cycles with the salutation of peace upon the angels drawn near, and upon the Prophets and the believers and Muslims who follow them'.”</b>",
        "bookID": "39.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "The tashahhud (At-tahiyyaat) may be referred to here, as in it the words \"Assalamu'al'ayka ayyuhan nabiyu are mentioned. In this case where four rak'ahs are mentioned, all are included herein. This may also be possible that it means salaam was made after two rak'ahs. The aim will then be that in the four rak'ahs before 'asr two salaarns were made. It has been ascertained that both types, two and four rak'ahs were performed before 'asr. Sayyidina 'Ali Radiyallahu 'Anhu has himself also narrated both hadith.",
        "ourHadithNumber": 25,
        "matchingArabicURN": 1902870,
        "last_updated": "2021-02-07 13:06:48"
    },
    {
        "englishURN": 1802571,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Worship And Devotion Of Rasoolullah",
        "babNumber": "39.00",
        "babName": "Chapter 39. Worship And Devotion Of Rasoolullah",
        "hadithNumber": 258,
        "hadithText": "Two other chains have narrations similar to the previous one.</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 1902720,
        "last_updated": "2012-04-26 14:00:00"
    }
]