[
    {
        "englishURN": 1802710,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
        "babNumber": "40.00",
        "babName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
        "hadithNumber": 272,
        "hadithText": "Mu'adha said: \n\"I asked ‘A'isha (may Allah the Exalted be well pleased with her): “Did the Prophet (Allah bless him and give him peace) perform the mid-morning ritual prayer?” She said: “Yes, four cycles, and he used to add whatever Allah wished (Almighty and Glorious is He).”</b>",
        "bookID": "40.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "Salaatut duha is a nafl devotion, therefore at least two rak'ahs could be performed. More could be added to it, if the heart wills, which has no end. It has been ascertained that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam performed up to twelve rakahs. Some are of the opinion, that it has been ascertained that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam only performed eight rak'ahs. But one has certainly been encouraged in a narration to perform up to twelve rak'ahs.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1902880,
        "last_updated": "2021-02-08 15:47:28"
    },
    {
        "englishURN": 1802720,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
        "babNumber": "40.00",
        "babName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
        "hadithNumber": 273,
        "hadithText": "Anas ibn Maik said:\n“The Prophet (Allah bless him and give him peace) used to perform the mid-morning ritual prayer in six cycles.”</b>",
        "bookID": "40.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "Due to different times, different number of rak'ahs have been narrated regarding the salaatut duha of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. Therefore there will be no contradiction between them. For this reason the 'ulama have written that at least two rak'ahs, and it is best that eight or twelve rak'ahs be performed. It has been narrated that Sayyidina Rasulullah Sallallahu 'Alahi Wasallam usually performed eight rak'ahs.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1902890,
        "last_updated": "2021-02-08 15:48:42"
    },
    {
        "englishURN": 1802730,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
        "babNumber": "40.00",
        "babName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
        "hadithNumber": 274,
        "hadithText": "'Abd ar-Rahman ibn Abi Laila said:\n“I have never heard anyone mention seeing the Prophet (Allah bless him and give him peace) performing the mid¬morning ritual prayer except Umm Hani (may Allah the Exalted be well pleased with her). “She related that Allah’s Messenger (Allah bless him and give him peace) entered her house on the Day of the Conquest of Mecca, whereupon he performed the major ritual ablution and glorified Allah in eight cycles. I never saw him (Allah bless him and give him peace) perform a ritual prayer in a more abbreviated form than that, even though he completed the bowing [ruku] and the prostration [sujud]!”</b>",
        "bookID": "40.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "'Abdurrahmaan RA. saying that none besides Sayyiditina Ummi Haani Radiyallahu 'Anha narrated this hadith, does not necessarily mean that no other Sahaabi knew about this. In this chapter the narration of a few Sahaabah Radiyallahu 'Anhum are mentioned. Ibn Jareer RA. says: 'So many ahaadith have been narrated on salaatut duha that it reached the stage of tawaatur (unbroken chain of authentic narrators). It has already been stated that nineteen Sahaabah Radiyallahu 'Anhum narrated about this salaah. It may be that those people did not have information that from whom did 'Abdurrahmaan RA. investigate about this salaah. There is no perplexity in this. Some 'ulama are of the opinion that the salaah mentioned in the hadith under discussion, was not the salaatut duha, but a prayer of thanks on the conquering of Makkah. It was the practice of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam when an event of happiness occurred, to perform salaatus shukr (prayer of thanks-giving). It may also be possible that these eight rak'ahs included both the Salaatut duha and salaatus shukr.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1902900,
        "last_updated": "2021-02-08 15:51:00"
    },
    {
        "englishURN": 1802740,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
        "babNumber": "40.00",
        "babName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
        "hadithNumber": 275,
        "hadithText": "'Abdu’llah ibn Shaqiq said:\n“I asked 'A'isha (may Allah the Exalted be well pleased with her): ‘Was the Prophet (Allah bless him and give him peace) used to performing the mid-morning ritual prayer?’ She said: ‘No, except when he was coming back from an absence.'\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "It was the noble habit of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam that whenever he returned to Madinah Munawwarah, he entered the city in the morning. He first entered the masjid and performed nafl prayers. This reply of Sayyiditina 'Aayeshah Radiyallahu 'Anha is the opposite of what was given in reply to a question of Sayyiditina Mu'aadhah Radiyallahu 'Anha mentioned at the beginning of this chapter. The 'ulama-have therefore given different explanations to this. Imaam Bayhaqi has given this explanation, that in the hadith where it has been denied, the denial is of it not being performed regularly, which is not refuting that it was performed occasionally. Meaning he did not perform it regularly. In the hadith where the affirmative is mentioned, i.e. that he performed this salaah, it will be taken to be performed more often. Some of the 'ulama have summed it up thus, that he only performed this salaah in the masjid when he returned from a journey, otherwise at ordinary times he performed it in the home. In this hadith (under discussion) the object is the denial that this salaah was performed in the masjid. It was only performed in the masjid when he returned from a journey, as mentioned in the above hadith.",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1902910,
        "last_updated": "2021-02-08 15:52:34"
    },
    {
        "englishURN": 1802750,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
        "babNumber": "40.00",
        "babName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
        "hadithNumber": 276,
        "hadithText": "Abi Sa'id al-Khudri said (may Allah the Exalted be well pleased with him):\n\"The Prophet (Allah bless him and give him peace) would perform the mid-morning ritual prayer so often that we would say: “He does not omit it,” and he would omit it so often that we would say: “He does not perform it!”</b>",
        "bookID": "40.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "\"Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam taking the ummah into consideration, discontinued many devotions, of which there are many examples. Sayyiditina 'Aayeshah Radiyallahu 'Anha says: 'Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam very much liked to do a few things, but did not do it, fearing it would become fard on the ummah'\".",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1902920,
        "last_updated": "2021-02-08 15:53:49"
    },
    {
        "englishURN": 1802760,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
        "babNumber": "40.00",
        "babName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
        "hadithNumber": 277,
        "hadithText": "Abu Ayyub al-Ansari said (may Allah the Exalted be well pleased with him):\n“The Prophet (Allah bless him and give him peace) used to devote himself to four cycles [of ritual prayer] at high noon, so I said: ‘O Messenger of Allah, you devote yourself to these four cycles at high noon!’ He explained: ‘The gates of heaven are opened at high noon, then they are unlocked until the midday ritual prayer is performed, so I love to have a good deed ascend on my behalf during that time!’ I said: ‘Is there a Qur’anic recitation in each of them [the four cycles]?’ He said: ‘Yes!’ I said: ‘Do they contain a separating salutation of peace?’ He said: ‘No!'”\n<br><br>\nAnother chain reports a similar narration.</b>",
        "bookID": "40.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "The sufis name this salaah as salaatuz zawaal, and this is included in the mustahab prayers. According to the majority of the muhadditheen this is the four sunan of zuhr salaah. The reason being, besides the sunan of zuhr, there is no other nafl prayer after zawaal (midday) that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam performed regularly. In both cases according to both sayings this hadith and the ensuing one has no apparent relevance with the salaatut duha.<br><br>It is perplexing that Imaam Tirmidhi has mentioned this hadith in this chapter. The mashaa-ikh have given a few explanations regarding this. The first is that this was the ending time for chast, therefore it was naturally included here, and a separate chapter was not created. Some are of the opinion that this is due to an error committed by the copier (calligrapher), which resulted in this being mentioned here. Otherwise its original place was in the previous chapter. It is said that in a few copies of this kitaab, this hadith is mentioned under the previous chapter, and not in this chapter. Some have given other explanations too.",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1902930,
        "last_updated": "2021-05-22 15:16:49"
    },
    {
        "englishURN": 1802770,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
        "babNumber": "40.00",
        "babName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
        "hadithNumber": 278,
        "hadithText": "'Abdu’llah ibn as-Sa’ib said:\n“Allah’s Messenger (Allah bless him and give him peace) used to perform four cycles of ritual prayer after the sun had passed its zenith before the noon prayer, and he said: 'It is a time in which the gates of heaven are opened, so I love to have a righteous deed ascend for me then!'”</b>",
        "bookID": "40.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "What deed can there be more pious and better than salaah, as this is the best among all devotions. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam has said: \"The coolness of my eye is in salaah\". In another hadith it is stated: \"The one that performs salaah, is like one having a private conversation with Allah\".",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1902950,
        "last_updated": "2021-02-08 15:56:42"
    },
    {
        "englishURN": 1802780,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
        "babNumber": "40.00",
        "babName": "Chapter 40. Salaatut Duha (Chaast Prayers)",
        "hadithNumber": 279,
        "hadithText": "‘Ali said: \n\"He used to perform four cycles of ritual prayer before noon\", and he mentioned that Allah’s Messenger (Allah bless him and give him peace) used to perform them at the time of the sun's zenith, and he used to prolong them.</b>",
        "bookID": "40.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "Imaam Ghazaali has stated in his Ihya 'Ulumid Deen, that it is desirable to recite the Surah Baqarah in these four rak'ahs, or a similar surah which consists of more than a hundred aayaat, so that a sunnah of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam could be practised in reciting a lengthy portion.",
        "ourHadithNumber": 8,
        "matchingArabicURN": 1902960,
        "last_updated": "2021-02-08 15:58:46"
    }
]