[
    {
        "englishURN": 1802800,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "babNumber": "42.00",
        "babName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "hadithNumber": 281,
        "hadithText": "Abdullah ibn Shaqiq said:\n\"I asked 'A'isha (may Allah the Exalted be well pleased with her) about the fasting of Allah’s Messenger (Allah bless him and give him peace). She said: “He used to fast until we would say: ‘He has fasted,’ and he used to break fast until we would say: ‘He has broken fast.’” She also said: “Allah’s Messenger (Allah bless him and give him peace) did not fast for a whole month after arriving in Medina, with the exception of Ramadan.’</b>",
        "bookID": "42.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "(In this manner, the passing of the whole month without fasting was not observed. As mentioned in Abu Daawud. This practice of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam will be mentioned in the commentary of hadith number three in detail).\r\n",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1902980,
        "last_updated": "2021-02-11 14:43:12"
    },
    {
        "englishURN": 1802810,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "babNumber": "42.00",
        "babName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "hadithNumber": 282,
        "hadithText": "Humaid ibn Anas ibn Malik reported that he was asked about the fasting of the Prophet (Allah bless him and give him peace), so he said:\n\"He used to fast during the month until we would assume that he did not intend to break fast during it, and he used to break fast until we would assume that he did not intend to fast during any of it. You would not wish to assume that he was performing the ritual prayer during the night, unless you saw him performing the ritual prayer, nor that he was sleeping, unless you saw him sleeping.”</b>",
        "bookID": "42.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "The object here is that the noble habit of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was not to sleep the whole night, neither to remain awake the full night, but adopt a middle course, wherein the rights of the nafs were considered, and also the 'ibaadaat were given its full importance.<br><br>Therefore it was possible to observe his sleep at night as he retired for a portion of the night, and also observed the salaah, as part of the night was devoted to prayers. Some of the 'ulama have given another explanation to this, that the noble habit of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam varied in this respect. At times he performed the nawaafil in the first portion of the night. Sometimes in the middle portion of the night. At times in the last portion of the night. Therefore, if one wanted to observe sleep or salaah at a special time of the night, this too was possible. If one feels that one would like to observe the salaah of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam at a certain part of the night, then this opportunity could also be obtained, and if one wished to observe the sleep at this time an opportunity could also be obtained at some time. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam would rotate the time spent in prayer to every portion of the night on different days. We understand two benefits of this. The first is that the main object is worship, and man was created for this reason, resulting in attaining the pleasure of Allah. On every portion of the night, at one time or another, the blessings will be obtained. The second is, that when 'Ibaadah (devotion) is confined to an appointed time, it becomes a sort of habit, then the taste and pleasantness of hardship does not remain. When 'ibaadah is performed at different times of the night it will not become a habit.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1902990,
        "last_updated": "2021-02-11 14:45:11"
    },
    {
        "englishURN": 1802820,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "babNumber": "42.00",
        "babName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "hadithNumber": 283,
        "hadithText": "Ibn Abbas said:\n\"The Prophet (Allah bless him and give him peace) used to fast until we would say: “He does not intend to break fast [during the month],” and he used to break fast until we would say: “He does not intend to fast during it.” He did not fast for a whole month after arriving in Medina, with the exception of Ramadan.”</b>",
        "bookID": "42.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "The practice of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam has been mentioned in many narrations. There are two reasons for this. The first one has already been mentioned in the beginning of the chapter, that in reality saum is an antidote, and at times it is a medicine for spiritual fulfilment and other benefits. In this manner according to the general rules of medicine, at times it is necessary to use medicine continuously, and at times there is no need for it, or if it is casually needed, then due to some timely obstacles it is necessary to abstain from it. This is common among physicians. Who can reach the state of a spiritual doctor more than Sayyidina Rasulullah Sallallahu 'Alayhi wasallam, therefore, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam many a time fasted continuously for some timely necessities, and at times did not fast. The spiritual doctors of the ummah, may determine for the sake of spiritual benefit, when should one fast and when should one not fast. Those who are not spiritual doctors themselves, should consult those who are and benefit from them. The second reason is this that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam has a few special practices. For example, the fasting on the days of Monday and Thursday; three days in every month; the ayyamul beed (i.e. the 13th 14th 15th day of the Islamic lunar month); tenth of Muharram and the tenth of Dhul Hijjah etc. Many times because of being on a journey, or due to some obstacles these fasts were not kept. When the obstacles were overcome he kept these missed fast as qadaa, and also to complete his special practices. It was also from the special habit of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam that whenever he began a devotion he continually kept up the practice. Therefore whenever any fast were missed from his special practices, he completed them by observing continuous fasts. O Allah grant us the strength to follow his noble path.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1903000,
        "last_updated": "2021-02-11 14:46:33"
    },
    {
        "englishURN": 1802830,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "babNumber": "42.00",
        "babName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "hadithNumber": 284,
        "hadithText": "Umm Salama said:\n\"I did not see the Prophet fast (Allah bless him and give him peace) for two consecutive months, other than Sha'ban and Ramadan.”</b>",
        "bookID": "42.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "Apparently this hadith seems to contradict all the previous ahaadith. Till now all the ahaadith were unanimous that besides Ramadhaan Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam did not fast for a complete month. In this hadith the month of Sha'baan has also been added. The 'ulama have reconciled both in many ways. The first is that in this hadith the whole of Sha'baan is mentioned as an exaggeration. The noble habit of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was to fast for most part of the month. This has accordingly been made clear in a hadith from Sayyiditina Aayeshah Radiyallahu 'Anha which will be mentioned in the ensuing hadith. The second is that it may be possible, at some time Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam by chance kept fast for the whole month of Sha'baan, the news of which reached Sayyiditina Ummi Salamah Radiyallahu 'Anha and did not reach the others. The third is that in the narrations of Sayyiditina Aayesha Radiyallahu 'Anha, Sayyidina Ibn Abbas Radiyallahu 'Anhu, and others, the habit of doing so is denied, that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam did not fast for consecutive days in any month besides that of Ramadhaan. It will not contradict this statement if by chance fasts are kept for the full period of any other month. Therefore if for some reason Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam fasted for the whole month of Sha'baan in some year, -and since this was not his normal practice, -for this reason Sayyiditina 'Aayeshah Radiyallahu 'Anha and others did not mention it, and Sayyiditina Ummi Salamah Radiyallahu 'Anha mentioned he did, because he fasted for the whole month. There is no contradiction here. The fourth explanation is that in the beginning Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam fasted for the whole month of Sha'baan and in the later years because of weakness, lessened the amount of days. Therefore, whoever mentions the later deeds, said this because it was towards the end, and said he fasted for most of the month. The one that thought that this was because of some reason or obstacle, says the original practice was to fast for the whole month. Some are of the opinion that it is the opposite, in the beginning he fasted for most of the month and in later days he began fasting for the full month.",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1903010,
        "last_updated": "2021-02-11 14:57:36"
    },
    {
        "englishURN": 1802840,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "babNumber": "42.00",
        "babName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "hadithNumber": 285,
        "hadithText": "'A’isha said:\n\"I did not see Allah’s Messenger (Allah bless him and give him peace) fast in any month more than his fasting for Allah’s sake in Sha'ban. He used to keep fast through all but a little of Sha'ban; no indeed, he used to keep fast through all of it!”</b>",
        "bookID": "42.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "This goes a bit further where Sayyiditina 'Aayeshah Radiyallahu 'Anha clearly mentions the fasting of the full month of Sha'baan, by this, an exaggeration is indicated. The reason for fasting the major portion of Sha'baan is mentioned by Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam himself that, 'In this month, there is also that day wherein the deeds of the year are presented before Allah. I love that my deeds should be presented whilst I am fasting'. Besides this many other reasons are narrated in the ahaadith. It is possible that at a certain time it is for a particular reason and at another time it is for some other reason. The combining of many reasons at one time has also been mentioned by Sayyiditina 'Aayeshah Radiyallahu 'Anha, that the Practice of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was to fast for three days in every month. At times, due to unforeseen circumstances these were not observed. The total qadaa (of missed fasts) were combined and kept in Sha'baan by Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. In another narration it is mentioned that it was the practice of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam to fast on every Monday and Thursday. In this manner during the course of the year, due to circumstances the fasts of two or three months could not be observed. It could be possible for these to add up to a full month. In one narration it has been stated that because of the sanctity and greatness of Ramadaan the fasts of Sha'baan are meritorious. i.e. In the manner that sunan are performed before the fard salaah, likewise there are nafl fasts before Ramadaan. Weakness due to fasting did not affect Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, therefore at times he fasted for consecutive days. It is stated in the hadith that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was once asked the reason for fasting so many days of Sha'baan. He replied: 'The names of all those who are going to die during the course of the year, are written down in this month. I desire that my death be written in a state when I am fasting'. Some of the 'ulama have written that it was a special practice of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam to observe nafl saum in every month, and there was no way to observe nafl saum in the month of Ramadaan, therefore those nafl portions of Ramadhaan were kept in advance in the month of Sha'baan. For this reason if the fasts of both Sha'baan and Ramadaan are combined, it will cover most of the month.",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1903020,
        "last_updated": "2021-02-11 14:58:41"
    },
    {
        "englishURN": 1802850,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "babNumber": "42.00",
        "babName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "hadithNumber": 286,
        "hadithText": "'Abdu’llah said:\n\"Allah’s Messenger (Allah bless him and give him peace) used to fast three days at the beginning of every month, and he would seldom break fast on Friday, the Day of the Congregation [jumuah].”</b>",
        "bookID": "42.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "One has been persuaded in many ahaadith to observe saum for three days in every month. The thawaab (reward) for every good deed is tenfold, therefore the fasting of three days will add up to the thawaab of thirty days. In this manner it will be as if one has fasted for one's whole life. Many ahaadith have been mentioned regarding the fixing of the three days. There are no differences in this. At times on every Monday and Thursday. Sometimes on the thirteenth, fourteenth and fifteenth. In the same way he fasted at other times too. It is mentioned in an ensuing hadith by Sayyiditina 'Aayeshah Radiyallahu 'Anha that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam did not fix special days for fasting. Sayyidina Ibn 'Abbaas Radiyallahu 'Anhu says: 'Rasulullah Sallallahu 'Alayhi Wasallam did not omit the fasting of the ayyaami beed (13th, 14th and 15th day of the Islaamic lunar month) at home or while on his travels'. The second point in the above hadith is the fasting on Fridays. From this hadith it is found that the fast of Fridays were given importance, but in another hadith it has been prohibited to fast on friday only. For this reason some of the 'ulama, due to the above hadith are of the opinion that it is mustahab to fast on friday and some 'ulama due to the hadith wherein it has been prohibited, are of the opinion that it is makruh to fast on friday only. The Hanafis hold both opinions.",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1903030,
        "last_updated": "2021-02-11 15:00:30"
    },
    {
        "englishURN": 1802860,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "babNumber": "42.00",
        "babName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "hadithNumber": 287,
        "hadithText": "'A’isha said:\n\"The Prophet (Allah bless him and give him peace) was devoutly committed to fasting every Monday and Thursday.”</b>",
        "bookID": "42.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "In some narrations the reason for giving importance to these days are mentioned. One reason will be mentioned in a hadith of Sayidina Abu Hurayrah Radhiyallahu anhu which follows in this chapter, that deeds are presented on these days. In a narration in Sahih Muslim regarding Monday, it has been stated that \"I was born on a Monday, the revealing of the Quran to me also began on a Monday\". In one hadith it stated that \"Allah Ta'alah forgives the sins of every Muslim (provided the rules apply) on Mondays and Thursdays\". It is said regarding those two people who are on bad terms \"hold the granting of their forgiveness till they reconcile among themselves\". ",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1903040,
        "last_updated": "2021-02-11 15:01:07"
    },
    {
        "englishURN": 1802870,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "babNumber": "42.00",
        "babName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "hadithNumber": 288,
        "hadithText": "Abu Huraira said:\n\"The Prophet said (Allah bless him and give him peace): “Works are reviewed on Monday and Thursday, so I would like my work to be reviewed while I am fasting!”</b>",
        "bookID": "42.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "Making it possible for these to be easily accepted. The question may arise regarding the presenting of deeds. The gist of a hadeeth mentioned in Sahih Muslim show that deeds are presented daily in the morning and evenings. What is meant by the deeds being presented on Mondays and Thursday? The Muhaditheen sum both up in different ways. The easiest is that the deeds of the day and night are presented in details twice a day. The deeds of the night separately and the ones of the day separately. On Mondays and Thursdays they are presented briefly. The deeds of the whole year are summed up in Sha'baan and Laylatul Qadar and presented before Allah the Almighty. One benefit among the many benefits of presenting the deeds repeatedly are that the honour of the pious are made evident before the angels. The angels raised a question when Allah Ta'aala created humans, that 'You are creating such a being that will spread bloodshed and turmoil in the world'. Allah Ta'aala knows at every moment the deeds committed by every person, therefore it is not necessary that deeds be presented to Him.",
        "ourHadithNumber": 8,
        "matchingArabicURN": 1903050,
        "last_updated": "2021-02-11 15:01:50"
    },
    {
        "englishURN": 1802880,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "babNumber": "42.00",
        "babName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "hadithNumber": 289,
        "hadithText": "'A’isha said;\n“The Prophet (Allah bless him and give him peace) used to fast on the Saturday of one month, and on the Sunday and the Monday, as well as on the Tuesday, Wednesday and Thursday of another month.”</b>",
        "bookID": "42.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "So that in this manner all the days of the week are covered. The days of Friday were intentionally omitted as stated in some ahaadith that this day had been proclaimed as an 'Eid. Other important matters were fulfilled on this day. Or Friday has not been mentioned in this narration and may have been mentioned in other narrations.",
        "ourHadithNumber": 9,
        "matchingArabicURN": 1903060,
        "last_updated": "2021-02-11 15:20:43"
    },
    {
        "englishURN": 1802890,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "babNumber": "42.00",
        "babName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "hadithNumber": 290,
        "hadithText": "'A’isha said:\n“Allah’s Messenger (Allah bless him and give him peace) would not fast in any month more than he did in Sha'ban.”</b>",
        "bookID": "42.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "This has already been explained in detail.",
        "ourHadithNumber": 10,
        "matchingArabicURN": 1903070,
        "last_updated": "2021-02-11 15:37:17"
    },
    {
        "englishURN": 1802900,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "babNumber": "42.00",
        "babName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "hadithNumber": 291,
        "hadithText": "Mu'adha said:\n\"I said to 'A'sha: “Was Allah’s Messenger (Allah bless him and give him peace) used to fasting three days out of every month?” She said; “Yes!” I said: “Which days did he fast?” She said: “He was not concerned about which days he fasted.”</b>",
        "bookID": "42.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "At certain times it was the practice of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam not to give importance to fixing certain days. At times he fixed certain days. For example, fasting on the first three days of the month, or sometimes on the last three days of the month, or in some months on Saturday, Sunday and Monday, and in another month on Tuesdays, Wednesdays and Thursdays. Therefore different ahaadith have been narrated on this subject, and Sayyiditina 'Aayeshah, Radhiyallahu 'Anha refused to specify a certain day.",
        "ourHadithNumber": 11,
        "matchingArabicURN": 1903080,
        "last_updated": "2021-02-11 16:39:52"
    },
    {
        "englishURN": 1802910,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "babNumber": "42.00",
        "babName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "hadithNumber": 292,
        "hadithText": "A’isha said:\n\"‘Ashura' was a day on which Quraish used to fast in the pagan era [al-jahiliyya], and Allah’s Messenger (Allah bless him and give him peace) used to keep it as well. Hence, when he arrived in Medina, he kept its fast and commanded its observance. Then, when Ramadan was decreed, [the fast of] Ramadan became the obligatory religious duty, and 'Ashura' was omitted, so one is free to fast this day or not to fast it.”</b>",
        "bookID": "42.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "Many narrations have been narrated on the virtues of the saum (fast) of 'Aa-shura. It is stated in a narration in Sahih Muslim that by observing the saum of 'Arafah the sins of two years are forgiven, and by observing the fast of 'Aa-shura the sins of one year are forgiven. Some commentators write that on the day of 'Aa-shura, the taubah (repentance) of Sayyidina Aadam 'Alayhis Salaam was accepted; The boat of Sayyidina Nuh 'Alayhis Salaam docked (after the great floods); Sayyidina Musa 'Alayhis Salaam was saved from Firown, and Firown drowned on this day; Sayyidina 'Eesa 'Alayhis Salaam was born, and raised to the heavens on this day; On this day Sayyidina Yunus 'Alayhis Salaam was freed from the stomach of the fish, and his ummah forgiven; On this day Sayyidina Yusuf 'Alayhis Salaam was taken out of the well; On this day Sayyidina Ayyub 'Alayhis Salaam was cured from his illness; On this day Sayyidina Idriss 'Alayhis Salaam was raised to the sky; On this day Sayyidina Ebrahim 'Alayhis Salaam was born; On this day Sayyidina Sulaymaan 'Alayhis Salaam was given the powers to rule a country; Besides these many other karaamaat (miracles) are mentioned in the commentaries of the ahaadith and books on seerah. Although according to the muhadditheen many questions have been raised on these incidents, there are numerous miracles that have been ascertained. It is said that the wild animals also fast on this day. Allahu Akbar! What a blessed day this is? Yet we waste it in amusements and useless pastimes. Probably it is from among these reasons that, the virtues of this day was well known in the days of jaahiliyyah. Therefore the Quraysh must have observed this fast before the advent of Islaam. When Sayidina Rasulullah Sallallahu 'Alayhi Wasallam came to Madinah Munawwarah, he observed that the Jews, who are from the Ahlul-Kitaab, also observing the fast of Aa-shurah. Sayidina Rasulullah Sallallahu 'Alayhi Wasallam inquired from them the reason for fasting on this day. They replied: 'Allah Ta'alah saved Musa Alayhis salaam on this day from the oppression of Firown (Pharaoh) and also Firown was drowned on this day. In gratitude and happiness Musa Alayhis salaam fasted on this day'. Sayidina Rasulullah Sallallahu 'Alayhi Wasallam replied: \"We are more entitled than you to follow Musa Alayhis Salaam\". Therefore, Sayidina Rasulullah Sallallahu 'Alayhi Wasallam himself fasted on this day and commanded the Ummah also to fast on this day. This incident is mentioned in the Sahih Muslim. For this reason the Hanafis say this saum (fast) was fard before the command of Ramadhaan was revealed. When the fast of Ramadhaan was ordained these were abrogated. Its merits and the virtues for the forgiveness of one years sins still remain.<br><br><strong>Masha-Allah</strong>: The original day for the observance of the fast of Aa-shurah is the tenth. In the early periods of Islaam, Sayidina Rasulullah Sallallahu 'Alayhi Wasallam was in agreement with the ahlul-kitaab, as their belief was also from the heavenly revealed religions, and was better than the religion of the mushriqeen, but in the later years the ahlul-kitaab were also opposed in words and deeds, which was necessary due to many factors. Once a sahabi brought this to the notice of Sayidina Rasulullah Sallallahu 'Alayhi Wasallam were upon he replied: \"If I remain alive next year I will surely fast on the ninth next year\". In another narration it is stated: \"Oppose the Jews, observe the fast of the ninth or eleventh\" i.e. add a fast to that of the tenth. With this no resemblance or imitation will remain. Therefore, it is advisable not to observe the fast of the tenth only, it is preferable that the fast of the ninth be also added to it, so that one will be fulfilling the commands of both hadith. If the ninth could not be observed then the eleventh should be added.",
        "ourHadithNumber": 12,
        "matchingArabicURN": 1903090,
        "last_updated": "2021-02-11 16:42:13"
    },
    {
        "englishURN": 1802920,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "babNumber": "42.00",
        "babName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "hadithNumber": 293,
        "hadithText": "'Alqama said:\n“I asked 'A'isha (may Allah be well pleased with her): ‘Was Allah’s Messenger (Allah bless him and give him peace) used to singling out any of the days?’ She said: ‘His work was perpetual. Who of you would be capable of doing what Allah’s Messenger (Allah bless him and give him peace) used to be do?”</b>",
        "bookID": "42.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "That meant to set aside a day for some special devotion. For example, to specify Monday for fasting. Fast is observed on every Monday and nothing is ever eaten on this day. Or besides Monday, fast are not observed on other days. Both these were not found, but it was certainly the practice of Sayidina Rasulullah Sallallahu 'Alayhi Wasallam that, whatever deed he began observing, he punctually continued its practice. You do not possess the strength and cannot fulfil these with such punctuality as that of Rasulullah Sallallahu 'Alayhi Wasallam'. He punctually completed his prescribed practices. If for any reason it could not be fulfilled, he completed it at a later time, as has been mentioned in the fasts of Sha'baan. The gist of this is, that it was not given such importance that, the deed was observed only on a particular day, and no other deed was observed on that day. He certainly fulfilled his prescribed practices with care among which are included the fasting on special days. No doubt remains on this commentary, that Sayyiditina 'Aayeshah Radiyallahu 'Anha, has mentioned in hadith number eight, that special attention was given to the fasting on Mondays and Thursdays. The findings of Haafizul Hadith (one who has memorised a minimum of 100 000 ahaadith with its chain of narrators), Ibn Hajar RA is that this question and answer is regarding these three fasts, it was the practice of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam to observe these fasts every month. This has already been mentioned in hadith number seven. According to this explanation there is no confusion.",
        "ourHadithNumber": 13,
        "matchingArabicURN": 1903100,
        "last_updated": "2021-02-11 16:43:22"
    },
    {
        "englishURN": 1802930,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "babNumber": "42.00",
        "babName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "hadithNumber": 294,
        "hadithText": "A’isha said:\n\"Allah’s Messenger (Allah bless him and give him peace) entered my presence, and there was a woman with me, so he said: “Who is this?” I said: “So-and-so, who does not sleep at night.” Allah’s Messenger (Allah bless him and give him peace) then said: 'Incumbent upon you are the works of which you are capable, for, by Allah, Allah will not become weary until you become weary!” The work dearest to Allah’s Messenger (Allah bless him and give him peace) was that in which his Companion would persevere.'\"</b>",
        "bookID": "42.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "This Sahaabiyyah was Sayyiditina Kholaa bint Tuwayt bin Habib Radiyallahu 'Anha. She had the fervour and intense desire to perform 'ibaadah. Many incidents of this type are mentioned in the ahaadith, Where the zeal of the Sahaabah Radiyallahu 'Anhu was so intense, it compelled them to perform 'ibaadah more than normal. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam advised them to observe moderation. Sayyidina 'Abdullah bin 'Amr ibnul 'Aas Radiyallahu 'Anhu, a famous Sahaabi says: \"I once made up my mind, that I would strive to intensify my devotions. I would always fast during the day. I would complete the recitation of the whole Quran (khatm) every night. My father got me married to a honourable woman. Once my father inquired from my wife about my state of affairs? She replied: 'He is very pious man, he does not come to bed the whole night. He does not have anything to do with anyone'. My father became very angry with me, that I had got you married to an honourable woman, and you have left her hanging. Due to my intense desire for devotions this did not effect me. My father complained to Rasulullah Sallallahu Alayhi Wasallam about my state of affairs. Rasulullah Sallallahu Alayhi Wasallam asked me: 'I have heard you always fats during the day, and stand in prayer the whole night?' I replied: 'yes'. Rasulullah Sallallahu Alayhi Wasallam said: 'Do not do so, but fast sometimes, and abstain sometimes. In the same manner do perform salaah at night, and sleep too. Your body also has a right on you. Your eyes also have a right on you, it will become weak due to staying awake the whole night. Your wife also has a right on you. Your children also have a right on you. Those who meet you also have a right on you'\".",
        "ourHadithNumber": 14,
        "matchingArabicURN": 1903110,
        "last_updated": "2021-02-11 16:44:57"
    },
    {
        "englishURN": 1802940,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "babNumber": "42.00",
        "babName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "hadithNumber": 295,
        "hadithText": "Abu Salih said:\n\"I asked 'A'isha and Umm Salama: “Which work was dearest to Allah’s Messenger (Allah bless him and give him peace)?” They said: “That which a person perseveres in, even if the amount of work done is small.”</b>",
        "bookID": "42.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "The object of all these ahadeeth are that saum, and likewise all other nafl deeds, even if it be a little, or whatever could be done should be practised continuously and with care. One should not forsake these with the thought that it cannot be practised constantly because the nawafil are the only acts that compensate the short comings of the faraa'id (compulsory act). Therefore one should endeavour to observe and practise as much as one possible can.",
        "ourHadithNumber": 15,
        "matchingArabicURN": 1903120,
        "last_updated": "2021-02-11 16:45:54"
    },
    {
        "englishURN": 1802950,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "babNumber": "42.00",
        "babName": "Chapter 42. The Fasting Of Sayyidina Rasoolullah",
        "hadithNumber": 296,
        "hadithText": "Awf bin Malik said:\n\"When I was together with Allah’s Messenger (Allah bless him and give him peace) one night, he cleaned his teeth, then performed the minor ablution, then performed the ritual prayer. I stood up with him, whereupon he began with the Sura of the Cow [al-Baqara], and whenever he came to a verse referring to a mercy, he would pause and ask [for that mercy], and whenever he came to a verse referring to a torment, he would pause and seek refuge [from that torment]. Then he bowed down and remained bowing for as long as he had remained standing upright, saying: “Glory be to the Lord of power [jabarut], sovereignty [malakut], magnificence [kibriya'] and sublimity ['azama]!” Then he prostrated for as long as he had bowed, saying: ““Glory be to the Lord of power, sovereignty, magnificence and sublimity!” Then he recited the Sura of the Family of 'Imran [Al 'Imran] followed by another Sura, and he did this in every cycle of the ritual prayer.”</b>",
        "bookID": "42.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "How lengthy these rak'ahs must have been, is evident from the saying (of the above narration). The Surah Baqarah covers about two and half Juz, and then sayyidina Rasulullah Sallallahu Alayhi wasallam recited with care, every word was recited clearly and distinctly. A pause was with made at every aayah where mercy and punishment are mentioned du'aa was made. Thereafter a long ruku', the same length as that of the standing was performed and likewise was the sajdah. This is one rakah. In this manner it will be difficult to complete four rak'ahs in the whole night. But due to the intense desire and zeal, especially for such a noble personality, whose coolness of the eye was in salaah, such a deed was not difficult. Apparently the last few ahaadith have no relation with the subject on the fasting of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. In (some) editions of the Shamaa-il these are included not only in the chapter on salaatud duha, saum etc., but in every chapter on the devotions of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. There is no perplexity in this, but in those editions where these different chapters exist, a minute point is derived, that generally those who have a strong zeal for fasting, it is observed that, they begin to exert themselves so much that they tend to become lax in the rights of others. For this reason, Imaam Tirmidhi has in the beginning mentioned the ahaadith on moderation, and in the end has indicated that when in zeal one sometimes exceeds one's normal practice, there is no harm. It must not be of such a nature that an indifference and weariness for 'Ibaadah (devotions) is created as a result of this.",
        "ourHadithNumber": 16,
        "matchingArabicURN": 1903130,
        "last_updated": "2021-02-11 16:49:28"
    }
]