[
    {
        "englishURN": 1802960,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 43,
        "bookName": "Chapter 43. The Recital Of Sayyidina Rasoolullah",
        "babNumber": "43.00",
        "babName": "Chapter 43. The Recital Of Sayyidina Rasoolullah",
        "hadithNumber": 297,
        "hadithText": "Ibn Abi Mulaika reported:\nYa'la ibn Mamlak asked Umm Salama about the Qur’anic recitation of Allah’s Messenger (Allah bless him and give him peace), whereupon she described a Qur’anic recitation that was explained letter by letter.</b>",
        "bookID": "43.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "When Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam recited he uttered every word distinctly and clearly. Sayyiditina Ummi Salamah Radiyallahu 'Anha may have described this verbally, it may also be possible that she demonstrated the manner in which Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam recited, where from this explanation is apparent. The commentators on hadith give two explanations. The second explanation seems more appropriate. A hadith of this nature is mentioned by Sayyiditina Ummi Salamah Radiyallahu 'Anha in hadith number three of this chapter, wherein she demonstrates how Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam recited.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1903140,
        "last_updated": "2021-02-11 16:55:35"
    },
    {
        "englishURN": 1802970,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 43,
        "bookName": "Chapter 43. The Recital Of Sayyidina Rasoolullah",
        "babNumber": "43.00",
        "babName": "Chapter 43. The Recital Of Sayyidina Rasoolullah",
        "hadithNumber": 298,
        "hadithText": "Qatada said:\n“I said to Anas ibn Malik: 'How was the Qur’anic recitation of Alla’s Messenger (Allah bless him and give him peace)?’ He said: ‘With the voice drawn out over the long vowels.'”</b>",
        "bookID": "43.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "The words that are to be recited with madd were recited with a madd (long intonation). This can only be done if one recites steadily, and with care. It is difficult to pronounce the madd if one recites hastily. From this, both things are apparent. One should recite steadily, and recite the madds, where they appear. The commentators of hadith have written that there are laws governing the recital of the rnadd. These are described fully in the books of tajweed. It is necessary to implement them. In our times the Qurraa (Qaaris) stretch the madd so much, overdoing it. Only the things that are done according to its laws and fundamentals are correct. Excess or deficiency are both abhorred.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1903150,
        "last_updated": "2021-02-11 16:57:19"
    },
    {
        "englishURN": 1802980,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 43,
        "bookName": "Chapter 43. The Recital Of Sayyidina Rasoolullah",
        "babNumber": "43.00",
        "babName": "Chapter 43. The Recital Of Sayyidina Rasoolullah",
        "hadithNumber": 299,
        "hadithText": "Umm Salama said:\n\"The Prophet (Allah bless him and give him peace) used to interrupt his Qur’anic recitation. He would say: “Praise be to Allah, the Lord of all the worlds [al-hamdu li-llahi Rabbi ’l-'alamin], then he would pause, then he would say: “The All-Merciful, the All-Compassionate [ar-Rahmani r-Rahim],” then he would pause and recite: “Master of the Day of Reckoning [Maliki yawm-id'deen].”</b>",
        "bookID": "43.0",
        "grade1": "Sanad Da'if wal-Hadīth Hasan",
        "grade2": "",
        "comments": "Briefly, he recited every aayah distinctly, and with ease. There is a difference of opinion among the Qurraa, that is it afdal (better) to take a breath after the recital of every aayah or not? Maulana Gangohi has written a special booklet 'Raddut Tughyaan fi Awqaafil Qur-aan' in Urdu, which is quite comprehensive. This book is beneficial for the rnasaa-il of this nature.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1903160,
        "last_updated": "2021-02-11 16:59:07"
    },
    {
        "englishURN": 1802990,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 43,
        "bookName": "Chapter 43. The Recital Of Sayyidina Rasoolullah",
        "babNumber": "43.00",
        "babName": "Chapter 43. The Recital Of Sayyidina Rasoolullah",
        "hadithNumber": 300,
        "hadithText": "'Abdu’llah ibn Abi Qais said:\n\"I asked \"A'isha (may Allah be well pleased with her) about the Qur’anic recitation of the Prophet (Allah bless him and give him peace): “Was he used to whispering the recitation, or pronouncing it audibly?” She said: “He used\nto do both. He would sometimes whisper and sometimes speak audibly.” I therefore said: “Praise be to Allah, who has granted us flexibility in the matter!”</b>",
        "bookID": "43.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "This question, as has been mentioned in the jaami' Tirmidhi, is regarding the recital at the time of tahajjud. Sayyiditina 'Aayeshah Radiyallahu 'Anha replying that he recited both softly, and audibly, may also mean that he recited both tones in the same night.<br><br>This is also correct that in one night he recited the entire salaah audibly, and on another night he recited the entire salaah softly. Both are correct, and there is no harm in reciting in both manners. At times it is better to recite audibly, especially where it is intended to persuade others, or it will create strength to recite. Where there is a possibility that one will be troubled, or where it is doubted that this will create pride, it is better not to recite audibly as it is important to consider those present. When sometimes both are of the same nature, then it is advisable to recite in a slightly audible tone. It was the practice of Sayyidina Abubakr Radiyallahu 'Anhu to recite softly in the tahajjud. Sayyidina 'Umar Radiyallahu 'Anhu used to recite audibly. Once Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam passed both at night and witnessed the practices of both. When they attended the noble gathering of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam in the morning Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam discussed this. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallarn said to Sayyidina Abubakr Radiyallahu 'Anhu. \"When I passed you, you were reciting softly\". He replied: \"That great being with whom I was conversing was listening\". Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam then said to Sayyidina 'Umar Radiyallahu 'Anhu: \"When I passed you, you were reciting loudly\". Sayyidina 'Umar Radiyallahu 'Anhu replied: \"The intention was to awaken those who were carelessly sleeping, and to keep away the shaytaan\". Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam approved the explanations of both, and said to Sayyidina Abubakr Radiyallahu 'Anhu \"Raise your voice a little\" and to Sayyidina 'Umar Radiyallahu 'Anhu: \"Lower your voice a little\".",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1903170,
        "last_updated": "2021-02-11 17:00:22"
    },
    {
        "englishURN": 1803000,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 43,
        "bookName": "Chapter 43. The Recital Of Sayyidina Rasoolullah",
        "babNumber": "43.00",
        "babName": "Chapter 43. The Recital Of Sayyidina Rasoolullah",
        "hadithNumber": 301,
        "hadithText": "Umm Hani' said:\n“I used to hear the Qur’anic recitation of the Prophet (Allah bless him and give him peace) during the night while I was on my pallet.”</b>",
        "bookID": "43.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "This will mean that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam recited very clearly and with an audible tone, that I could hear it on the rooftop of my house. Normally at night due to quietness the voice travels quite a distance. On the rooftop which is open it could be heard better, especially when the house is near.",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1903180,
        "last_updated": "2021-02-11 17:00:57"
    },
    {
        "englishURN": 1803010,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 43,
        "bookName": "Chapter 43. The Recital Of Sayyidina Rasoolullah",
        "babNumber": "43.00",
        "babName": "Chapter 43. The Recital Of Sayyidina Rasoolullah",
        "hadithNumber": 302,
        "hadithText": "Abdu’llah ibn Mughaffal said:\n\"I saw the Prophet (Allah bless him and give him peace) on his she-camel on the Day of Victory, and he was reciting: “We have surely given you a clear victory, so that Allah may forgive you your former and your latter sins [innafatahna la-kafat'han mubina li-yaghfira la-ka ’llahu ma taqaddama min dhanbi-ka wa ma ta’akhkhara].” (Al Qur'an 48:1-2) He recited in a quivering voice.”</b>",
        "bookID": "43.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "According to the 'Arabic language tar-jee' means to return or repeat. It means that the sound is repeated. The tafseer (commentary) of it is related by Sayyidina 'Abdullah bin Mughaffal Radiyallahu 'Anhu himself as Aa-Aa. Some of the 'ulama state this means to clear the voice and recite. Sayyidina Rasulullah Sallallhu 'Alayhi Wasallam was very happy on the conquest of Makkah, and it becoming Darrul Islaam, therefore he was reciting with enjoyment. The research of my late father - May Allah fill his grave with nur-is that since Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was sitting on a camel, its walking and moving made it seem that the sound was being repeated. For this reason Sayyidina 'Abdullah bin Mughaffal Radiyallahu 'Anhu explained is as Aa-Aa and Sayyidina Mu'aawiyah Radiyallahu 'Anhu did not attempt to demonstrate it, because he feared people would begin gathering around him. According to this explanation it will not contradict the following hadith. This humble servant prefers this explanation, because according to the first explanation it will mean to recite clearly and with a good melodious voice, then what fear shall there be of people gathering around. It is necessary to recite the Qur-aan correctly, wherein there is no singing tune. In many ahaadith under different headings it has been stressed that the Qur-aan must be recited with tarteel and a good intonation. I have compiled some of these ahaadith in my kitaab 'Chehl Hadith. Those who are interested may read it.",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1903190,
        "last_updated": "2021-02-11 17:02:44"
    },
    {
        "englishURN": 1803020,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 43,
        "bookName": "Chapter 43. The Recital Of Sayyidina Rasoolullah",
        "babNumber": "43.00",
        "babName": "Chapter 43. The Recital Of Sayyidina Rasoolullah",
        "hadithNumber": 303,
        "hadithText": "Qataadah said:\n\"Allah has not sent a Prophet unless he was endowed with a handsome face and a beautiful voice, and your Prophet (Allah bless him and give him peace) was endowed with a handsome face and a beautiful voice, and he did not chant in a quavering tone.”</b>",
        "bookID": "43.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "Apparently this hadith seems to contradict the previous one, explained in the commentary of the previous hadith. It means that he did not repeat the sound whilst reciting. Some of the 'ulama take this to mean as singing and reciting, and that it has been prohibited in many ahaadith to recite with a singing tone.",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1903200,
        "last_updated": "2021-02-11 17:03:45"
    },
    {
        "englishURN": 1803030,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 43,
        "bookName": "Chapter 43. The Recital Of Sayyidina Rasoolullah",
        "babNumber": "43.00",
        "babName": "Chapter 43. The Recital Of Sayyidina Rasoolullah",
        "hadithNumber": 304,
        "hadithText": "Ibn Abbas said (may Allah be well pleased with him and his father)::\n“The Qur’anic recitation of the Prophet (Allah bless him and give him peace) was sometimes heard by those in the chamber, while he was in the house.”</b>",
        "bookID": "43.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "The voice did not reach beyond the courtyard. The reciting of the Qur-aan softly and audibly are both better according to the circumstances. On a correct and suitable occasion, or where for a reason it is desirable to recite audibly, there one should recite audibly. If there exists a fear that it will create show etc., there one should recite softly. The object is that according to circumstances it keeps changing, therefore, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam has said the one that recites the Qur-aan audibly is like the one that openly gives sadaqah, and the one who recites softly is like the one who gives sadaqah secretly. Concerning sadaqah, at times it is better to openly reveal the giving of it and at times it is better to conceal it. Circumstances should be taken into consideration, which change from time to time. This rule applies to the reciting of the Qur-aan also.",
        "ourHadithNumber": 8,
        "matchingArabicURN": 1903210,
        "last_updated": "2021-02-11 17:04:37"
    }
]