[
    {
        "englishURN": 1803040,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 44,
        "bookName": "Chapter 44. The Weeping Of Sayyidina Rasoolullah",
        "babNumber": "44.00",
        "babName": "Chapter 44. The Weeping Of Sayyidina Rasoolullah",
        "hadithNumber": 305,
        "hadithText": "'Abdullah ibn ash-Shikh-khir reported that his father said:\n\"I came to Allah’s Messenger (Allah bless him and give him peace) while he was performing the ritual prayer, and his inner body [jauf] was producing a humming sound like the humming of the cauldron due to his weeping.”</b>",
        "bookID": "44.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "This was due to the total humbleness of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. Some mashaa-ikh have written that this state of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam occurred when both the jalaali and jamaali attribute of Allah appeared together. None can control the jalaali attributes. Certainly, when the jamaali attributes appeared, at that time a sort of happiness and contentment became apparent. Through the tufayl (mediation/means) of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam the mashaa-ikh of suluk also experience these two conditions.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1903220,
        "last_updated": "2021-02-12 07:31:04"
    },
    {
        "englishURN": 1803050,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 44,
        "bookName": "Chapter 44. The Weeping Of Sayyidina Rasoolullah",
        "babNumber": "44.00",
        "babName": "Chapter 44. The Weeping Of Sayyidina Rasoolullah",
        "hadithNumber": 306,
        "hadithText": "'Abdu’llah ibn Mas'ud said (may Allah be well pleased with him):\n“Allah’s Messenger (Allah bless him and give him peace) told me: ‘Recite the Qur’an to me,’ so I said: ‘O Messenger of Allah, shall I recite the Qur’an to you when it was to you that it was revealed?’ He said: ‘I like to hear it from someone other than myself,’ so I recited the Sura of the Women [Surat an-Nisa’] until the place that reads: And We bring you as a witness against these [wa ji'na bi-ka 'ala ha'ula'i shahida]' (Al-Qur'an; 4:41). Then I saw the eyes of Allah’s Messenger bathed in tears.”</b>",
        "bookID": "44.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "This crying of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was due to the listening of the words of Allah, and this befits the dignity of the Qur-aan. Imaam Nawawi writes that to cry whilst reciting the Qur-aan is the quality of the 'aarifeen and a sign of the saaliheen. Allah Ta'aala has praised these people in the Qur-aan at many places. Allah Ta'aala says: \"When the revelations of the Beneficent were recited unto them, they fell down (into sajdah), adoring and weeping\". - Surah Maryam, 58.<br><br>\"Lo! those who were given knowledge before it, when it is read unto them, fall down prostrate on their faces, adoring\".-Surah Israa (Bani Israa-eel), 107.<br><br>By this it.is clear that who can confirm more to these aayaat than Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. It is not imaginable that the crying of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was due to the greatness and Jalal of the Qur-aan. In this case, it is possible that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam must have been crying from before and Sayyidina 'Abdullah bin Mas'ud Radiyallahu 'Anhu must have observed it only after Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam had been crying for some time. It may also be possible that he began crying specially after the reciting of the aayah. The translation of this aayah is: \"But how (will it be with them) when We bring of every people a witness, and We bring thee (0 Muhammad) a witness against these?' - Suratun Nisaa, 41.<br><br>Sayyidina Rasulullah Saliallahu 'Alayhi Wasallam will be called to give evidence on these people. This is the scene of qiyaamah. On that day every nabi will be called upon to give evidence as a witness. The events of which are described in detail in the ahaadith of the day of mah-shar. In this manner it is possible that this crying of Sayyidina Rasuluilah Sallallahu 'Alayhi Wasallam will be due to the difficult times on the day of qiyaamah and mah-shar. Every person will be engrossed and worried of one's self only. It is possible that in this aayah Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam is being commanded to appear as a witness. And he fears the intense burden of being called up as a witness. It is stated in a hadith that at the time when this aayah was revealed, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam said: 'O Allah, how can I be a witness of those who were not in my presence?' Some of the 'ulama have written that at the mentioning of this aayah, the scene of qiyaamah came before him, and the fikr of the ummah was always with Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. He may have cried because of the sins of the ummah. For this, every event is such, that it can be the cause of crying. All this and besides this, there could be other reasons too for his crying.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1903230,
        "last_updated": "2021-02-12 07:34:17"
    },
    {
        "englishURN": 1803060,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 44,
        "bookName": "Chapter 44. The Weeping Of Sayyidina Rasoolullah",
        "babNumber": "44.00",
        "babName": "Chapter 44. The Weeping Of Sayyidina Rasoolullah",
        "hadithNumber": 307,
        "hadithText": "'Abdullah ibn ‘Uamr said:\n\"The sun was eclipsed one day in the era of Allah’s Messenger (Allah bless him and give him peace), so Allah’s Messenger (Allah bless him and give him peace) stood performing the ritual prayer, until he could hardly bow down, then he bowed down and could hardly raise his head, then he raised his head and could hardly prostrate himself, then he prostrated himself and could hardly raise his head, so he began to gasp and weep, saying: 'O my Lord, have You not promised me that You will not torment them while I am among them? O my Lord, have You not promised me that You will not torment them while they and we are appealing to You for forgiveness?' Then, once he had performed two cycles of ritual prayer, the sun became visible, so he stood up, praised Allah (Exalted is He) and extolled Him. Then he said: 'The sun and the moon are among the signs of Allah. They are not eclipsed because of someone’s death, nor because of his coming to life, so when they are eclipsed, you must seek refuge in the remembrance of Allah (Exalted is He)!'”</b>",
        "bookID": "44.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "The reason for delivering this sermon was that in the days of jaahiliyyah it was a general understanding that the eclipse of the sun and moon were due to the death or birth of a great personality. Coincidently it so happened that when Sayyidina Ebrahim Radiyallahu 'Anhu, the son of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam passed away, an eclipse took place. Therefore this nurtured the view held during the days of jaahiliyyah. People began saying that the eclipse was the result of the death of Sayyidina Ebrahim Radiyallahu 'Anhu. The a-immah differ in that during the solar eclipse should one or more than one ruku' be performed in one rak'ah. The Hanafis say that only one ruku' should be performed (in one rak'ah). This hadith strengthens their view. However scholarly differences and the proofs of the opposing schools are not relevant here.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1903240,
        "last_updated": "2021-02-12 07:37:10"
    },
    {
        "englishURN": 1803070,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 44,
        "bookName": "Chapter 44. The Weeping Of Sayyidina Rasoolullah",
        "babNumber": "44.00",
        "babName": "Chapter 44. The Weeping Of Sayyidina Rasoolullah",
        "hadithNumber": 308,
        "hadithText": "Ibn Abbas said:\n“Allah’s Messenger (Allah bless him and give him peace) took hold of a daughter of his who was dying, then embraced her and she died in his arms. Umm Aiman cried, so he, meaning the Prophet (Allah bless him and give him peace), said: 'Are you weeping in the presence of Allah’s Messenger?’ She replied: 'Am I not seeing you weep?’ He said: 'I am not weeping. It is actually a mercy. The believer has every benefit in every situation. His soul is removed within him as he praises Allah (Almighty and Glorious is He)!'”</b>",
        "bookID": "44.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "The 'Ulama differ in that with which daughter did this incident take place. According to the muhadditheen and historians this did not take place with any of his daughters but with that of a grandson or granddaughter. It is also possible that this took place with one of the sons. Such incidents took place with his male offspring. With whomsoever this incident may have taken place, the object here is to describe the soft-heartedness of Sayyidina Rasulullah Sallallahu 'Alayhi 'Wasallam, and that stone heartedness is contrary to kindness. To have natural love for children is not against the dignity and sanctity of Prophethood. To be soft hearted is praiseworthy.",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1903250,
        "last_updated": "2021-02-12 07:38:55"
    },
    {
        "englishURN": 1803080,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 44,
        "bookName": "Chapter 44. The Weeping Of Sayyidina Rasoolullah",
        "babNumber": "44.00",
        "babName": "Chapter 44. The Weeping Of Sayyidina Rasoolullah",
        "hadithNumber": 309,
        "hadithText": "'A’isha said (may Allah be well pleased with her):\n“Allah’s Messenger (Allah bless him and give him peace) kissed 'Uthman ibn Maz'un when he was dead, and he was weeping.\" (or: “his eyes were shedding tears”).”</b>",
        "bookID": "44.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "This great Sahaabi was a foster brother of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. He was the thirteenth person to accept Islaam in its early stages. He first migrated to Abyssynia then to Madinah. He was very pious and devoted. At the time when it was still lawful to drink intoxicants, he had already abstained from imbibing it, He was the first among the Muhaajireen to pass away. He passed away in Sha'baan in the second year hijri and was buried in the Jannatul Baqi.",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1903260,
        "last_updated": "2021-02-12 07:40:08"
    },
    {
        "englishURN": 1803090,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 44,
        "bookName": "Chapter 44. The Weeping Of Sayyidina Rasoolullah",
        "babNumber": "44.00",
        "babName": "Chapter 44. The Weeping Of Sayyidina Rasoolullah",
        "hadithNumber": 310,
        "hadithText": "Anas ibn Malik said:\n“We saw Allah’s Messenger (Allah bless him and give him peace), sitting on the tomb of a daughter of his, and I saw his eyes shedding tears. Then he said: 'Is there any man among you who has not had intercourse with his wife tonight?’ Abu Talha said: ‘I haven't!’ He told him: ‘Come down,’ so he came down into her tomb.”</b>",
        "bookID": "44.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "It is said that this was an obscure hint to Sayyidina 'Uthmaan Radiyallahu 'Anhu and that is, although his wife, the daughter of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam being very ill, that she passed away that same day, he was with one of his slave girls that night. Some 'ulama did not translate the word 'Lam Yuqaarif' as 'the one who did not commit sexual relations' but as 'the one who did not commit a sin'. Some 'ulama have translated it as 'did not speak' as Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam did not like to speak after 'eshaa. The most famous explanation is the one used above. There is no difficulty in explaining 'Ta'reed' (an obscure hint) too, a person does hint to one with whom one has a strong relationship. If Sayyidina 'Uthmaan Radiyallahu 'Anhu did this because of a strong urge, then there is no harm, also who knows when one will die. It is possible that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam wanted to mildly bring it to his notice, but not scold him. It may not be surprising that the reason for this is that the marriage of Sayyiditina Ummi Kulthum Radiyallahu 'Anha was important, as this took place at the commandment of Allah Ta'aala. When the first wife of Sayyidina 'Uthmaan Radiyallahu 'Anhu, the elder sister of Siyyiditina Ummi Kulthum Radiyallahu 'Anha passed away, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam said: 'if I had a hundred daughters, and if every one died one after another, I would have married each one of them one after the other to 'Uthmaan. 'Jibra-eel 'Alayhis Salaam says that Allah Ta'aala has commanded that I give the hand of Sayyidtina Ummi Kulthum Radiyallahu 'Anha in the marriage of Sayyidina 'Uthmaan Radiyallahu 'Anhu.' In this manner it will surely warrant that at the time of the illness of such a wife like Sayyiditina Ummi Kulthum Radiyallahu 'Anha, a mild and obscure hint be given. And Allah knows best.",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1903270,
        "last_updated": "2021-02-12 07:40:56"
    }
]