[
    {
        "englishURN": 1803120,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 46,
        "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "babNumber": "46.00",
        "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "hadithNumber": 313,
        "hadithText": "'Umar ibn al-Khattab said:\n“Allah’s Messenger said (Allah bless him and give him peace): ‘Do not extol me as the Christians extolled [Jesus] the son of Mary. I am merely a servant,’ so say: '[He is] Allah’s servant and His Messenger.’”</b>",
        "bookID": "46.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "Do not praise me in such a manner which is contrary to the bonds-manship of Allah where shirk (partnership) is created with Allah. A bondsman is a bondsman. Do not praise in such a manner that does not befit, and is contrary to the mission of a Rasul and Messenger of Allah.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1903300,
        "last_updated": "2021-02-12 07:46:08"
    },
    {
        "englishURN": 1803130,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 46,
        "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "babNumber": "46.00",
        "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "hadithNumber": 314,
        "hadithText": "Anas ibn Malik said (may Allah be well pleased with him):\n\"A woman came to the Prophet (Allah bless him and give him peace) and said to him: 'I am in need of you,' so he said: 'Sit in whichever road of the city you wish, and I shall sit with you!'\"</b>",
        "bookID": "46.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "In some narrations it is stated that this woman was a bit mentally retarded. Despite this, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam gave her a hearing. Some 'ulama say the reason for saying 'Sit in any street', is because he will not be alone with a strange woman. Some have written, because she was a bit mentally retarded, it is apparent that she may be walking around in the alleys, therefore Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam said, he would go into the street and listen to her. According to this humble servant, it is possible that if he had called her at the women's quarters of his house, the womenfolk would have been inconvenienced, as is witnessed many a time. For this reason, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam listened to her request on the street.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1903310,
        "last_updated": "2021-02-12 07:47:06"
    },
    {
        "englishURN": 1803140,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 46,
        "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "babNumber": "46.00",
        "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "hadithNumber": 315,
        "hadithText": "Anas ibn Malik said (may Allah be well pleased with him):\n\"Allah’s Messenger (Allah bless him and give him peace) used to visit the sick, attend funerals, ride a donkey, and accept invitations from slaves. On the Day of Banu Quraiza, he was mounted on a donkey bridled with a rope of palm- tree fibers and saddled with palm-tree fibers.”</b>",
        "bookID": "46.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "</u><br>In Arabia, there is special type of donkey, which is bigger than the local (Indian) mules. They run faster than the ordinary ponies. Two or three people can easily ride them. They are better than the ordinary local (Indian) horses. It is possible that these' donkeys existed in the time of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. It is regarded as an inferior class of conveyance than that of horses. The object here is to show that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam despite being of such a high status, and who possessed the leadership of both worlds did not feel belittled by riding a donkey. In the same manner, he visited the sick, be that person a respectable or an ordinary person. He even visited the sick non-Muslims. A Jewish lad used to attend the assemblies of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. At times he assisted in some work too. When he became ill, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam went to visit him. It was his last moments. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam fulfilled his duties of kindness towards him, and presented to him the Message Islaam. The lad looked at his father, the father signalled his agreement. He accepted Islaam. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam thanked Allah, as only Allah is worthy of hamd, who had saved this lad from the punishment of hell through him. Not only this, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam also went to visit the leader of the hypocrites, 'Abdullah bin Ubay, when he became ill, whereas, he had troubled and harassed Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam many a time. In this manner we find in the ahaadith that he attended the funerals of many ordinary people.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1903320,
        "last_updated": "2021-02-12 07:48:23"
    },
    {
        "englishURN": 1803150,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 46,
        "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "babNumber": "46.00",
        "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "hadithNumber": 316,
        "hadithText": "Anas ibn Malik said (may Allah be well pleased with him):\n\"The Prophet (Allah bless him and give him peace) used to be invited to a meal of barley bread and rancid oil, and he would accept the invitation. He once had a breastplate which was being held in pledge by a certain Jew, and he (the Prophet) died before he could repay the debt so as to release it from the Jew's possession.”</b>",
        "bookID": "46.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "When fat becomes stale it begins to smell. The serving of bread made of barley and stale fat could be ascertained from the status of the person or from experience, or even by the host himself saying this. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam never made an excuse in accepting an invitation. The last sentence about the debt has been mentioned co-incidentally as it is part of the hadith. Some 'ulama state that this is also a sign of humility. This was the reason of his poverty. Allah Ta'aala had given him the option of two things, if he wanted to become a Rasul with humbleness or become a Rasul with kingdom. Sayyidina Rasulullah Sallallhu 'Alayhi Wasallam on his own accord chose the first one.",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1903330,
        "last_updated": "2021-02-12 07:49:39"
    },
    {
        "englishURN": 1803160,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 46,
        "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "babNumber": "46.00",
        "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "hadithNumber": 317,
        "hadithText": "Anas ibn Malik said (may Allah be well pleased with him):\n“Allah’s Messenger (Allah bless him and give him peace) performed the Pilgrimage on a shabby camel saddle, on which there was a velvet sheet worth less than four silver coins, so he said: ‘O Allah, make it a Pilgrimage devoid of hypocritical ostentation and no notoriety!'”</b>",
        "bookID": "46.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "This was recited to educate the ummah, or shows the complete humbleness and utmost devotion of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. Although there can be no question of show and fame in any act of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, then too Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam made this d'uaa and beseeched Allah to keep this haj free from show and fame. The sheet that was on the mubaarak body or on the pack saddle of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was of such an ordinary quality that its value was less than a rupee (about twenty cents). This was the result of his complete humbleness, which was his usual habit. Although due to some considerations Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam at time's wore expensive clothing, but normally did not do so.",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1903340,
        "last_updated": "2021-02-12 07:50:42"
    },
    {
        "englishURN": 1803170,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 46,
        "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "babNumber": "46.00",
        "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "hadithNumber": 318,
        "hadithText": "Anas ibn Malik (may Allah be well pleased with him) said:\nthat there was no person dearer to them than Allah’s Messenger (Allah bless him and give him peace). He said: \"Nevertheless, when they saw him they would refrain from standing, because they knew how he abhorred having people rise for him.”</b>",
        "bookID": "46.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "This was also the result of the complete humbleness of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. Despite his high status and being the leader of both worlds, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam did not approve this. For this reason the Sahaabah, although possessing a great love for him, and knowing that he disapproved of it, did not stand up for him as is the requirement from this hadith. Rarely, due to their intense love, they stood up. A hadith has been mentioned in the Abu Daawud that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was sitting with us in the masjid and talking. When he stood up, we all stood up till he went into the house. In this manner many ahaadith are narrated on this subject in the books of hadith, to the extent that in some ahaadith it has been strongly prohibited to stand up, and in some ahaadith it has been commanded to stand up for a few visitors. The 'ulama differ in the permissibility of standing or not standing. The majority of the researchers say there is no contradiction, as there are many reasons for standing up, therefore different commands are mentioned in the ahaadith. Abul Walid bin Rashid says there are four ways and reasons for standing up. (a). Not permissible: This is standing up for such a person who likes this due to pride, that when he enters, people should stand up. (b). Makruh: To stand up for a person who has no pride, but it is feared if one is treated in this manner, pride will enter in that person. (c). Permissible: This is for that person this fear does not exist. (d). Mustahab: To stand up for a person who returns from a journey. To stand in happiness on one's return. Imam Nawawi says: ''It is mustahab to stand for the Ahlul-Ilm, Ahlul-Fadl and Ahlul-Sharaf''. Qaadi 'Iyaad says the prohibition is for that standing, where a great person remains seated and the people continue standing in his presence. In the ahaadith where standing has been prohibited it is stated that: ''One should not stand in the manner that the 'ajami people stand for their leaders\". The research of Maulana Gangohi, which has been mentioned in the Badh-lul-Majhud through my late father, is that standing in itself is permissible, till such an obstacle does not appear which prohibits it. For example, a person will fall into mischief if one stands up for a certain person. Pride etc. will form in one, which will be detrimental to that person's religious well-being. In the same manner, to stand up hypocritically, where there does not exist in the heart any feeling or respect, but for the sake of show and hypocrisy one stands up. Both these are not permissible, but, if one fears that by doing so, one will have to bear financial and physical consequences, then in this case it will be permissible to stand up to deter oppression.",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1903350,
        "last_updated": "2021-02-12 07:52:46"
    },
    {
        "englishURN": 1803180,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 46,
        "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "babNumber": "46.00",
        "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "hadithNumber": 319,
        "hadithText": "Al-Hasan ibn ‘Ali said:\n“I asked my maternal uncle, Hind ibn Abi Hala, who was an expert describer, about the finery of Allah’s Messenger (Allah bless him and give him peace), and I asked him to describe something of it for me, so he said: ‘Allah’s Messenger (Allah bless him and give him peace) was an honored dignitary, whose face shone with the radiance of the moon on the night of the full moon.’\" Then he related the tradition in its full length.\nAl-Hasan said: “I concealed it from al-Husain for some time, then I related it to him, so I found that he had beaten me to it.” He therefore asked him about what he had asked him about, and he found that he had asked his father about his entrance and his exit and his outward appearance, so he did not leave anything out of it.\nAl-Husain said: “I asked my father about the entry of Allah’s Messenger (Allah bless him and give him peace), so he said: ‘When Allah’s Messenger (Allah bless him and give him peace) betook himself to his residence, he divided his entry into three sections: a section for Allah’s sake, a section for his family’s sake, and a section for his own sake. Then he divided his section between himself and the people, so he was assigning that in particular to the common folk, and he was not keeping anything from them. His conduct in the section of the Community included preference for the people of excellent merit, with his permission, and its allotment according to the value of their excellent merit in the religion, for among them was the one burdened with one need, and among them was the one burdened with two needs, and among them was the one burdened with multiple needs. He would therefore preoccupy himself with them, and preoccupy them with what would benefit them and the Community, including questioning them about it and informing them of what would be appropriate for them. He would say: 'Let the one of you who is present inform the absentee, and notify me of the need of someone who is incapable of notification, for if someone notifies a Sultan of the need of someone who is incapable of its notification, Allah will establish his feet firmly on the Day of the Resurrection. Nothing but that will be mentioned in His presence, and it will not be accepted from anyone other than him. They will enter as seekers, and they will not separate except on the strength of an intuition, and they will emerge as guides (meaning to goodness).’”\nHe said: “Then I asked him about his exit: ‘How was he used to behaving in it?’ He said: ‘Allah’s Messenger (Allah bless him and give him peace) used to hold his tongue with regard to anything that did not concern him. He used to bring people together and not alienate them. He would honor the noble, generous man of every community, and put him in charge of them. He would caution people and be wary of them, without concealing his good humor and his natural disposition from anyone among them. He would watch out for his Companions, and he would ask people about their affairs. He would present the beautiful in a favorable light and strengthen it, and he would reveal the ugly for what it was and weaken it. He was equitable, not argumentative. He remained vigilant lest others be negligent or deviate from the right path. He had a means of dealing with every situation. He would neither fall short of the truth, nor overstep it. Those who followed him were the best of people. The most meritorious in his sight were those most receptive to sincere advice and most elevated in status those most generous in consolation and support.’”\nHe said: “Then I asked him about his session, so he said: ‘Allah’s Messenger (Allah bless him and give him peace) would neither stand up nor sit down without observing the remembrance of Allah. When he eventually joined a group of people, he would take whatever seat was available, and he instructed others to do the same. He would give each of his sitting companions his share of time and attention, and every one of them would feel equally honored. If someone sat with him, or conferred with him about a need, he would bear with him patiently, so that the person who had sought him out would be the first to leave. If someone asked him for something he needed, he would not send him away without what he had requested, or least some comforting words. His munificence and his good nature encompassed people such that he became a father to them, and they became truly equal in his presence. His session was a session of knowledge, forbearance, modesty, trust and patience. Voices were not raised there, there was no talk of women, and people’s lapses were not broadcast. They were on a par with one another, contending with each other only in piety, humbly revering the elderly and showing compassion for the young. They were solicitous to the needy, and took good care of the stranger.’”</b>",
        "bookID": "46.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "In brief, in every matter his noble manners reached their pinnacle and even exceeded that, and why should it not be so when his divine mission was to fulfil and complete noble manners? Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam has said: 'I have been sent so that I may fulfil and complete the best of manners'. Even though being granted this, he always made this du'aa: 'O Allah, You have created me excellently. In the same manner make my character excellent'. Allah Ta'aala has mentioned the greatness of his noble character in the Qur-aan, and has also emphasised it in many ways. Rasulullah Sallallahu 'Alayhi Wasallam said: 'Allah Ta'aala likes those with gentle temperaments, and in reward for gentleness He grants something which He does not grant for other things'. In another hadith it has been stated: 'The person that is deprived of gentleness is deprived of great blessings'. It is stated in a hadith: 'The best amongst you is the one who has the best character'. In one hadith it has been stated: 'The most beloved amongst you by me is the one who possesses noble character'. A Sahaabi inquired from Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam 'What is the best thing granted to man? Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam replied: 'Good character'. In one hadith it has been stated: 'On the day of qiyyaamah the weightiest thing on the scale of deeds will be good character'. It has been stated in a hadith: 'A good-mannered person can through his character, reach the status of those pious people who stay awake at night, and fast during the day'. Sayyidina Mu'aadh Radiyallahu 'Anhu says that when I was sent to Yaman (Yeman), while mounting conveyance, when I put my leg in the stirrup, Rasulullah Sallallahu 'Alayhi Wasallam gave me this final advice: 'Treat the people with courtesy'. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam has said the ones that possess the most complete imaan among the Mu'mins are those whose characters are the best. In many other other ahaadith too it has been stressed that one should have good character. The above mentioned ahaadith are an example of these.",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1903360,
        "last_updated": "2021-02-12 08:00:33"
    },
    {
        "englishURN": 1803190,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 46,
        "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "babNumber": "46.00",
        "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "hadithNumber": 320,
        "hadithText": "Anas ibn Malik said (may Allah be well pleased with him):\n“Allah’s Messenger said (Allah bless him and give him peace): 'If a sheep’s trotter were given to me, I would receive it, and if I were invited to eat it at someone’s home, I would accept the invitation!'”</b>",
        "bookID": "46.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "It does not even come to mind that why should I accept such an ordinary small article, or accept an invitation to partake of it. I think of it as a blessing of Allah and accept it whole heartedly. The actual reason for accepting an invitation is not the food but to encourage the host and keep one happy.",
        "ourHadithNumber": 8,
        "matchingArabicURN": 1903370,
        "last_updated": "2021-02-12 08:01:38"
    },
    {
        "englishURN": 1803200,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 46,
        "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "babNumber": "46.00",
        "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "hadithNumber": 321,
        "hadithText": "Jabir said (may Allah be well pleased with him):\n“Allah’s Messenger (Allah bless him and give him peace) came to me riding neither a mule nor a hackney.”</b>",
        "bookID": "46.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "The humbleness of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam is intended here. He did not adopt the way of the kings and the rich in using conveyance, but mostly walked. This incident is mentioned in the Bukhaari Sharif with more detail, where Sayyidina Jaabir Radiyallahu 'Anhu says: 'Once I became ill. Rasulullah Sallallhu 'Alayhi Wasallam and Abubakar (Radiyallahu 'Anhu) both came to visit me on foot. When they reached my home they found me unconscious. Rasulullah Sallallahu 'Alayhi Wasallam performed wudu and sprinkled the water of the wudu on me, as a result I became conscious and saw Rasulullah Sallallahu 'Alayhi Wasallam sitting before me. I asked him a question on inheritance, whereupon an aayah on this was revealed'.",
        "ourHadithNumber": 9,
        "matchingArabicURN": 1903380,
        "last_updated": "2021-02-12 08:02:35"
    },
    {
        "englishURN": 1803210,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 46,
        "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "babNumber": "46.00",
        "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "hadithNumber": 322,
        "hadithText": "Yusuf ibn 'Abdi’llah ibn Salam said:\n\"Allah’s Messenger (Allah bless him and give him peace) named me Yusuf, and he sat me on his lap and stroked my head.”</b>",
        "bookID": "46.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "In this we find the high character of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam and his love for little children. The height of humbleness is that he did not avoid putting infants on his lap. In a hadith it is stated that he (Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam) also made dua of barakah for me. From this hadith it is evident that children were taken to the pious elders and were asked to choose a name for them. In other ahaadith it has also been related that the Sahaabah Radiyallahu 'Anhum took their new born infants to Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam.",
        "ourHadithNumber": 10,
        "matchingArabicURN": 1903390,
        "last_updated": "2021-02-12 08:03:44"
    },
    {
        "englishURN": 1803220,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 46,
        "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "babNumber": "46.00",
        "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "hadithNumber": 323,
        "hadithText": "Anas ibn Malik said (may Allah be well pleased with him):\n“Allah’s Messenger (Allah bless him and give him peace) performed the Pilgrimage on a shabby camel saddle and a tassled blanket, the price of which we reckoned to be four silver coins, so when his riding camel stood up straight with him, he said: ‘Doubly at Your service, with a Pilgrimage in which there is no notoriety and no hypocritical ostentation!'”</b>",
        "bookID": "46.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "This hadith has been mentioned in hadith number five in this chapter.",
        "ourHadithNumber": 11,
        "matchingArabicURN": 1903400,
        "last_updated": "2021-02-12 08:04:50"
    },
    {
        "englishURN": 1803230,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 46,
        "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "babNumber": "46.00",
        "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "hadithNumber": 324,
        "hadithText": "Anas ibn Malik said (may Allah be well pleased with him):\n“A tailor invited Allah’s Messenger (Allah bless him and give him peace) and served him a dish of sopped bread, meat and broth, with some gourd on it. Allah’s Messenger (Allah bless him and give him peace) used to love gourd.” Thabit said; “Then I heard Anas say: ‘From then on, any dish that could be made with gourd was made for me!'”</b>",
        "bookID": "46.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "Thareed is a type of food wherein bread is mixed with gravy. This has already been mentioned in the eleventh hadith on the chapter of the curry of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. There instead of thareed, bread and gravy is mentioned. It is possible that both things were served, gravy and bread and thareed also. It is possible that thareed figuratively, or the ingredients of thareed were mentioned separately, as bread and gravy when mixed together become thareed.",
        "ourHadithNumber": 12,
        "matchingArabicURN": 1903410,
        "last_updated": "2021-02-12 08:05:58"
    },
    {
        "englishURN": 1803240,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 46,
        "bookName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "babNumber": "46.00",
        "babName": "Chapter 46. The Humbleness Of Sayyidina Rasoolullah",
        "hadithNumber": 325,
        "hadithText": "'Amra said:\n“'A'isha was asked: ‘What was Allah’s Messenger (Allah bless him and give him peace) accustomed to doing in his home?’ She said: ‘He was a normal human being. He used to examine his clothes for lice, milk his sheep and serve himself.’”</b>",
        "bookID": "46.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "He was a human from among other humans' means as the common people, he mostly did his household chores himself. He did not have pride or feel ashamed to do the household work or fulfil his needs. In a hadith it is stated that the work that was done by the common people in their homes, was also done by Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. In some ahaadith, examples of the chores are also given as in the hadith under discussion. In the ahaadith it is also stated that he sewed his clothing himself, he repaired his shoes, mended his clothing etc.<br><br>In the above hadith it is mentioned that he removed lice from his clothing. The research of the 'ulama is that lice was not found in the body and clothing of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. It is evident that lice appears from the dirt of the body and multiplies with the perspiration. The whole body of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was nur. There can be no questions of dirt, in the same manner his perspiration was like rose, that is used as a scent. How can it be possible for lice to live in the essence of rose. Therefore here it will mean that he looked for lice suspecting it from another person to have crept onto his clothing. The 'ulama say that this was done to teach the ummah, that when others see him doing this they will practise it more diligently.",
        "ourHadithNumber": 13,
        "matchingArabicURN": 1903420,
        "last_updated": "2021-02-12 08:06:53"
    }
]