[
    {
        "englishURN": 1803400,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 48,
        "bookName": "Chapter 48. Modesty Of Sayyidina Rasoolullah",
        "babNumber": "48.00",
        "babName": "Chapter 48. Modesty Of Sayyidina Rasoolullah",
        "hadithNumber": 341,
        "hadithText": "Abu Sa'id al-Khudri said:\n\"He (Allah bless him and give him peace) was more bashful than the virgin in her boudoir, and when he disapproved of something, we knew it from the expression on his face.”</b>",
        "bookID": "48.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "The 'Ulama have given two meanings for the words 'a virgin in her veil (Purdah)'. One group among the 'ulama say it means a virgin girl in her veil, that she is more shameful than that virgin girl who roams about. However every virgin is bashful, therefore the shari'ah has recognised the silence of a virgin girl as her consent for her-nikaah, as bashfulness is natural for a virgin girl, and especially the girl who is in purdah. Some 'ulama have said that by the girl in purdah, that girl is meant, who is brought up in purdah and also makes purdah from other women. It is a custom in many families, where purdah is observed from those women who go about. It is clear from this, how modest such a girl will be? The second meaning that some of the 'ulama have given is that 'in purdah' is taken metaphorically, that the modesty shown by a virgin girl (bride) on her first night is evident. (It is sad that this does not exist in many western orientated circles today).",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1903580,
        "last_updated": "2021-02-12 08:41:52"
    },
    {
        "englishURN": 1803410,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 48,
        "bookName": "Chapter 48. Modesty Of Sayyidina Rasoolullah",
        "babNumber": "48.00",
        "babName": "Chapter 48. Modesty Of Sayyidina Rasoolullah",
        "hadithNumber": 342,
        "hadithText": "'A’isha said:\n“I never looked at the private parts of Allah’s Messenger (Allah bless him and give him peace).” (Or she said: “I never saw the private parts of Allah’s Messenger (Allah bless him and give him peace).”</b>",
        "bookID": "48.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "Due to the shame-fastness of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam this was not possible, then how could Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam himself have done so? It is natural that in the presence of a modest person, one is compelled to act modestly. In another narration it is clearly denied that never did Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam see my private parts, nor did I see the private parts of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. Although 'Aayeshah Radiyallahu 'Anha was the most informal among all the wives, she was also the most beloved. If this was his manner with her, what can be said of the others? Sayyiditina Ummi Salamah Radiyallahu 'Anha says that when Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam slept with his wife, he closed his eyes and bowed down his head, and also stressed to his wife to be calm and dignified. Ibn 'Abbaas Radiyallahu 'Anhu narrates that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam went behind the rooms to perform ghusl. Nobody saw the private parts of Sayyidina Rasulullah Sallallahu'Alayhi Wasallam. Before the advent of nubuwwah, when the Ka'bah was rebuilt Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam also carried stones and brought them. According to 'Arab custom, no importance was given to concealing the private parts. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam (happen to) put his lungi under the stone, and immediately became unconscious (due to modesty) and fell down, whereas, at that time the shar'ee injunctions were not even revealed.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1903590,
        "last_updated": "2021-02-12 08:42:36"
    }
]