[
    {
        "englishURN": 1800360,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 5,
        "bookName": "Chapter 05. Appearing Of The White Hair Of Rasoolullah",
        "babNumber": "5.00",
        "babName": "Chapter 05. Appearing Of The White Hair Of Rasoolullah",
        "hadithNumber": 36,
        "hadithText": "Qatada reports that he said: ‘I said to Anas ibn Malik:\n“Did Allah’s Messenger (Allah bless him and give him peace) dye his hair?” He replied: ‘He did not get to that, for he was grayed only in the hair covering his temples, but Abu Bakr (may Allah the Exalted be well pleased with him) dyed his hair with henna and a herbal mixture called katam.”</b>",
        "bookID": "5.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "Katm is a type of grass, which is used for dying the hair. Some people say that the colour of Katm is black, and if mixed with Hina it becomes red. Others say the colour of Katm is green, and when mixed with Hina it gives a black tint. Mulla Ali Qari says: 'The one that gives more colour is considered. If more Katm is used the dye becomes black and if more Hina is used, it becomes red'. The use of both colours are permissible, but black should not be used. It has been forbidden in the ahaadith to use a totally black dye.\r\n",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1900370,
        "last_updated": "2021-01-17 14:06:56"
    },
    {
        "englishURN": 1800370,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 5,
        "bookName": "Chapter 05. Appearing Of The White Hair Of Rasoolullah",
        "babNumber": "5.00",
        "babName": "Chapter 05. Appearing Of The White Hair Of Rasoolullah",
        "hadithNumber": 37,
        "hadithText": "Anas ibn Malik said:\n\"On the head of Allah’s Messenger (Allah bless him and give him peace) and his beard, I counted only fourteen white hairs.”</b>",
        "bookID": "5.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "Sayyidina Rasulullah (Sallallahu alaihe wasallam) had very few white hair. There is some disagreement on the actual number. In this narration fourteen hairs are mentioned. In others, seventeen, eighteen, and in some, twenty white hairs are mentioned. This is a minor disagreement. The other ahaadith may have been related at different periods. A difference in the counting may also be possible.\r\n",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1900380,
        "last_updated": "2021-01-17 14:07:47"
    },
    {
        "englishURN": 1800380,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 5,
        "bookName": "Chapter 05. Appearing Of The White Hair Of Rasoolullah",
        "babNumber": "5.00",
        "babName": "Chapter 05. Appearing Of The White Hair Of Rasoolullah",
        "hadithNumber": 38,
        "hadithText": "Jabir ibn Samura was asked about the grayness of Allah’s Messenger (Allah bless him and give him peace), so he said: \"When he oiled his head, no grayness was visible, and when he did not apply oil, some was visible.”</b>",
        "bookID": "5.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "Oil gives the hair a shine, therefore the white hair becomes indistinguishable from the other hair, or they become compact and mixed, therefore the few whit hairs cannot be easily seen. When there is no oil the hair becomes dry and loose, and is easily seen.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1900390,
        "last_updated": "2021-01-17 14:08:56"
    },
    {
        "englishURN": 1800390,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 5,
        "bookName": "Chapter 05. Appearing Of The White Hair Of Rasoolullah",
        "babNumber": "5.00",
        "babName": "Chapter 05. Appearing Of The White Hair Of Rasoolullah",
        "hadithNumber": 39,
        "hadithText": "'Abdullah ibn 'Umar said:\n\"The hoariness of Allah’s Messenger (Allah bless him and give him peace) was merely about twenty white hairs.\"</b>",
        "bookID": "5.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "As mentioned above this is not contrary to the other ahaadith.",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1900400,
        "last_updated": "2021-01-17 14:10:01"
    },
    {
        "englishURN": 1800400,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 5,
        "bookName": "Chapter 05. Appearing Of The White Hair Of Rasoolullah",
        "babNumber": "5.00",
        "babName": "Chapter 05. Appearing Of The White Hair Of Rasoolullah",
        "hadithNumber": 40,
        "hadithText": "Ibn Abbas said:\nAbu Bakr said: “O Messenger of Allah, you have grayed!” He said: 'I have been made gray-haired by Hud (Al-Qur'an; 11)), the calamity (Al-Qur'an; 56)), the winds sent forth (Al-Qur'an; 77)). what will they question one another about?’ (Al-Qur'an; 74)). and ‘when the sun is overthrown’ (Al-Qur'an; 81)'.\"</b>",
        "bookID": "5.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "Apart form these surahs the Surahs of Al-Haaqqah, Al-Qaariah, Al- Ghaashiah etc. have also been mentioned. In short all those surahs wherein frightening matters are mentioned, e.g. Qiyaamah, (Day of judgement) Hell, the Trumpet, the punishment of evil people etc. In hadith it is stated that Rasulullah (Sallallahu alaihe wasallam) said: \"If you knew what I know, you would laugh less and cry more. You would even stop going to your wives (or as he had said)\". It is written in the Sharhus Sunnah that a person saw Rasulullah (Sallallahu alaihe wasallam) in his dream. He asked: \"O Rasulallah, (Sallallahu alaihe wasallam)! This hadith has reached me, that you said: 'Surah Hud has made me old'\". Rasulullah (Sallallahu alaihe wasallam) replied: \"There is one verse in it 'Wastaqim kama umirta' (Stay steadfast on the religion as I have commanded you). And it is well-known that to stay steadfast on the commandments of Allah is very difficult\". That is why the Sufiya have written that to remain steadfast is better than a thousand miracles.",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1900410,
        "last_updated": "2021-01-17 14:13:34"
    },
    {
        "englishURN": 1800410,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 5,
        "bookName": "Chapter 05. Appearing Of The White Hair Of Rasoolullah",
        "babNumber": "5.00",
        "babName": "Chapter 05. Appearing Of The White Hair Of Rasoolullah",
        "hadithNumber": 41,
        "hadithText": "Abu Juhaifa said:\n\"O Messenger of Allah we notice that you have turned gray!’ He said: ‘The [Sura of] Hud and its sisters have caused me to turn gray!’”</b>",
        "bookID": "5.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "It is related in a hadith that Rasulullah (Sallallahu alaihe wasallam) once came out of his house, wiping his hands on his blessed beared. Abu Bakr and Umar R.A. were sitting in the Masjid at that time. When AbuBakr R.A. saw this he said: 'O Messenger of Allah, may my father and mother be sacrificed for you. How early you have aged'. Then he began to weep. Rasulullah (Sallallahu alaihe wasallam) said: \"Surahs like Surah Hud have made me old\".Zamakh'shari says: \"He read in a kitaab, that a person had pure black hair one evening, and during the night it became completely white. When the people enquired of this sudden change, he said: \"At night, I saw Qiyaamah, in my dream. People were being pulled with chains and thrown into Hell. It frightened me so much, that within the night I became like this\". Allah is Great.",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1900420,
        "last_updated": "2021-01-17 15:34:00"
    },
    {
        "englishURN": 1800420,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 5,
        "bookName": "Chapter 05. Appearing Of The White Hair Of Rasoolullah",
        "babNumber": "5.00",
        "babName": "Chapter 05. Appearing Of The White Hair Of Rasoolullah",
        "hadithNumber": 42,
        "hadithText": "Abu’r-Rimtha at-Taimi (the servant of ar-Rabab) said: \"I came to the Prophet (Allah bless him and give him peace) with a son of mine, who said: 'So I was shown him, and I said when I saw him: ‘This is Allah’s Prophet (Allah bless him and give him peace). He is wearing two green garments, and he has hair that is topped with grayness, and its grayness is reddish'.”</b>",
        "bookID": "5.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "The signs of dignity, 'Anwaar-e- Nubuwwah' (prophetic illumination) and 'Aathari-Haybah' (signs of awe) were thus seen on the blessed face of Rasulullah (Sallallahu alaihe wasallam).When one sees these signs, such words naturally come to one's tongue: \"There is no doubt he is Allah's Messenger and cannot be false.\" The ahaadith state that many Sahabah R.A. uttered such words when they first met Rasulullah (Sallallahu alaihe wasallam). The above Hadith also states that the hair of Rasulullah (Sallallahu alaihe wasallam) was red. The ulama disagree whether Rasulullah (Sallallahu alaihe wasallam) dyed his hair or not. Some are of the opinion that Rasulullah (Sallallahu alaihe wasallam) dyed his hair and they base their argument on the red hair. Others deny this and say that before the hair becomes white, it usually turns red. The redness was natural, and not that of a dye.",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1900430,
        "last_updated": "2021-01-17 15:35:56"
    },
    {
        "englishURN": 1800430,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 5,
        "bookName": "Chapter 05. Appearing Of The White Hair Of Rasoolullah",
        "babNumber": "5.00",
        "babName": "Chapter 05. Appearing Of The White Hair Of Rasoolullah",
        "hadithNumber": 43,
        "hadithText": "Jabir ibn Samura was asked: “Was there any grayness of the head of Allah’s Messenger (Allah bless him and give him peace)?\" He replied: \"There was no grayness on the head of Allah’s Messenger (Allah bless him and give him peace), except some hairs in the part of his hair when he applied oil and the oil made them visible.”</b>",
        "bookID": "5.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "This narration seems to contradict the one related by Anas R.A., which has been mentioned in the beginning of this chapter. There is no complication, as there were a few white hair in the parting, that used to be covered by other hair. When oil was not rubbed in, they became visible. Therefore, if this is not mentioned in any hadith, there is no complication or harm.",
        "ourHadithNumber": 8,
        "matchingArabicURN": 1900440,
        "last_updated": "2021-01-17 15:37:15"
    }
]