[
    {
        "englishURN": 1803420,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "Chapter 49. Hajaamah (Cupping-Cautering) Of Sayyidina Rasoolullah",
        "babNumber": "49.00",
        "babName": "Chapter 49. Hajaamah (Cupping-Cautering) Of Sayyidina Rasoolullah",
        "hadithNumber": 343,
        "hadithText": "Anas ibn Malik said:\n\"Allah’s Messenger (Allah bless him and give him peace) sought to have blood drawn from him by the operation of cupping. Abu Taiba cupped him, so he ordered two measures of food for him, and he spoke to his people, so they relieved him of some of his tax. He also said: 'Cupping is the most excellent means by which you can provide medical treatment.’”</b>",
        "bookID": "49.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "When Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam himself paid the price, then the answer to the question is apparent. It is possible that the aim of the question was this, that in a few ahaadith this occupation has been scorned. The reason being, that blood has to be sucked out which is an unclean thing, therefore, it is essential that one be careful, and care be taken that the mouth be kept paak at all times. In the same manner, the same has been said in the ahaadith regarding some other occupations. As a result it created doubt and perplexities in the minds of some people, whereas, the meaning of the narrations is simple and clear. Whatever Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam said regarding an occupation there was something in it that one had to be careful about, and which needed to be remedied. In the above hadith, by 'income' is meant, that a slave is given the opportunity, that if he agrees to pay daily a certain amount, he is given a limited freedom. The extra that he earns belongs to him. This type of slave is called 'Abd Ma'dhu,. It was originally stipulated that this slave pay three saa' daily. By the intercession of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam one was made less after which there remained only two 2 saa' to be paid daily. There is a difference of opinion among the 'ulama regarding the weight of the saa'. According to the Hanafi jurists a saa' equals approximately four seers (approx. 3,8kg). The saying of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam that cupping is the best medicine is very true. By this he was addressing the youth of the Haramayn, and also the inhabitants of the countries where the climate is hot, because their blood becomes thin, it remains more on the surface of the body and the climate of the country brings it even more closer to the surface.<br><br>Therefore the 'ulama say it is not advisable for those above the age of forty to take the treatment of cupping.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1903600,
        "last_updated": "2021-02-14 13:46:11"
    },
    {
        "englishURN": 1803430,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "Chapter 49. Hajaamah (Cupping-Cautering) Of Sayyidina Rasoolullah",
        "babNumber": "49.00",
        "babName": "Chapter 49. Hajaamah (Cupping-Cautering) Of Sayyidina Rasoolullah",
        "hadithNumber": 344,
        "hadithText": "Ali said:\n“The Prophet (Allah bless him and give him peace) had the operation of cupping performed upon him, and on his instructions I gave the cupper his fee.”</b>",
        "bookID": "49.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "Two things are also apparent from this hadith. Using the treatment of cupping and paying its fees.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1903610,
        "last_updated": "2021-02-14 13:46:48"
    },
    {
        "englishURN": 1803440,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "Chapter 49. Hajaamah (Cupping-Cautering) Of Sayyidina Rasoolullah",
        "babNumber": "49.00",
        "babName": "Chapter 49. Hajaamah (Cupping-Cautering) Of Sayyidina Rasoolullah",
        "hadithNumber": 345,
        "hadithText": "Ibn Abbas said:\n\"The Prophet (Allah bless him and give him peace) had cupping performed between the two veins in the neck and between the shoulders. He also gave the cupper his fee, which\nhe would not have done if cupping had been unlawful.”</b>",
        "bookID": "49.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "As the blood has to be sucked out by the mouth, for this reason in some ahaadith this occupation and its income have been scorned, as has been mentioned previously. In some ahaadith its income has been declared undesirable and wicked. Due to this, some 'ulama say its fees are not permissible Imam Ahmad ibn Hambal has reconciled the two in this manner, that the prohibition is for free people and not for slaves. Since Abu Taybah Radiyallahu'Anhu was a slave, there remains no perplexity in paying a fee. Ibnul Jauzi says, it has been declared (a remuneration) wicked because, it is among the necessities of a Muslim, and to help another Muslim is waajib, therefore no remuneration should be taken, and this service should be rendered without a charge. The 'ulama have many views on this. Ibn 'Abbaas Radiyallahu 'Anhu has through this hadith proved its permissibility, and says if it was not permissible, Sayyidina Rasulullah Sallallahu'Alayhi Wasallam would not have paid a fee.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1903620,
        "last_updated": "2021-02-14 13:47:33"
    },
    {
        "englishURN": 1803450,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "Chapter 49. Hajaamah (Cupping-Cautering) Of Sayyidina Rasoolullah",
        "babNumber": "49.00",
        "babName": "Chapter 49. Hajaamah (Cupping-Cautering) Of Sayyidina Rasoolullah",
        "hadithNumber": 346,
        "hadithText": "Ibn 'Umar said:\n\"The Prophet (Allah bless him and give him peace) summoned a cupper, so he cupped him. Then he asked him: “How much is your tax?” He said: “Three measures of grain,” so he reduced his tax by one measure and gave him his fee.”</b>",
        "bookID": "49.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "Apparently this is the same hadith about Abu Taybah Radiyallahu 'Anhu mentioned in the first hadith of this chapter. In the beginning he had to pay his master three saa', then Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam had it reduced to two saa'.",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1903630,
        "last_updated": "2021-02-14 13:48:24"
    },
    {
        "englishURN": 1803460,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "Chapter 49. Hajaamah (Cupping-Cautering) Of Sayyidina Rasoolullah",
        "babNumber": "49.00",
        "babName": "Chapter 49. Hajaamah (Cupping-Cautering) Of Sayyidina Rasoolullah",
        "hadithNumber": 347,
        "hadithText": "Anas ibn Malik said (may Allah be well pleased with him):\n\"Allah’s Messenger (Allah bless him and give him peace) used to have cupping performed between the two veins of the neck and in the upper back, and he used to undergo cupping on the seventeenth, nineteenth and twenty-first days of the month.”</b>",
        "bookID": "49.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "In some ahaadith, the benefit of these dates are also mentioned. The unaani hakims also agree with this. It is reported that Ibn Sina said it is not beneficial to take treatment of cupping in the beginning and end of the month, this treatment should be taken in the middle of the (lunar) month. From this hadith we find that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam took this treatment many times, and on different days, and from the ahaadith that follow, we also find that it was taken at different places. The Jews gave Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam strong poison in his food. They intended to kill him, so that the question of their opposition may be eliminated. Although Sayyidina Rasulullah Sallallahu'Alayhi Wasallam did not eat the whole portion of the poisoned meat, but the effect of the portion eaten was, that it used to trouble him at different times, especially in the summer the effects used to occur frequently. The place where it used to pain the treatment of cupping was applied. As poison mixes into the blood stream, its effects and pains are felt on different parts of the body.",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1903640,
        "last_updated": "2021-02-14 13:49:00"
    },
    {
        "englishURN": 1803470,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "Chapter 49. Hajaamah (Cupping-Cautering) Of Sayyidina Rasoolullah",
        "babNumber": "49.00",
        "babName": "Chapter 49. Hajaamah (Cupping-Cautering) Of Sayyidina Rasoolullah",
        "hadithNumber": 348,
        "hadithText": "Anas ibn Malik said:\n\"Allah’s Messenger (Allah bless him and give him peace) underwent cupping on the top of the foot, while he was in the state of Pilgrim consecration in Malal [a place between Mecca and Medina].”</b>",
        "bookID": "49.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "According to some a-immah, it is makruh to take the treatment of cupping in the state of ihraam. According to the Hanafis it is permissible, provided that hair does not break off. In these narrations the use of cupping (cautering) is mentioned numerous times. In the kitaabs of hadith too the sayings and deeds of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam are mentioned regarding the treatment of cupping, but the treatment of fasd (phlebotomy-blood-letting as a medical operation) is not mentioned, whereas, according to the tibbi hakims, the treatment of phlebotomy is more beneficial than cupping, and is a cure for many illnesses. The reason for this is that both are not unconditionally beneficial, both have their peculiarities. The land of Hijaaz is hot, as stated before, cupping is more beneficial for this country. Hot and cold temperatures have altogether different effects on temperaments. In hot countries, and other countries in summer the heat of the body comes out to the outer part of the body, and the effect of coolness remains in the inner parts of the body. For this reason one perspires a great deal in summer, and because of the inner coolness foods take longer to digest, and many illnesses occur. In cold countries, and in winter the heat of a person's body goes to the inner portion of the body due to the cold. As a result the food digesting organs are strengthened. Vapour emits from the urine, and diseases decrease. According to the saying of Baqraat, in cold temperatures the inner parts of the body become warmer, more sleep is experienced, and food is digested easily. For this reason rich foods digest easily in winter, and take more time in summer. This is also the reason honey, dates and other heat creating foods do not affect the people of Hijaaz. In cupping, the blood on the outer part of the body is removed, and in Hijaaz the heat is more on the outer parts of the body, therefore, cupping is more beneficial there. In phlebotomy blood is let from the veins and inner part of the body, there for it will not be beneficial there. For this reason, it is not mentioned that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam used the treatment of phlebotomy.",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1903650,
        "last_updated": "2021-02-14 13:49:42"
    }
]