[
    {
        "englishURN": 1803590,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 51,
        "bookName": "Chapter 51. The Names Of Sayyidina Rasoolullah",
        "babNumber": "51.00",
        "babName": "Chapter 51. The Names Of Sayyidina Rasoolullah",
        "hadithNumber": 360,
        "hadithText": "Muhammad ibn Jubair ibn Mut'im reported that his father said:\n\"Allah’s Messenger said (Allah bless him and give him peace): “Verily I have several names: I am Muhammad; I am Ahmad; I am al-Mahi [the Eraser], with whom Allah erases unbelief; I am al-Hashir [the Gatherer], at whose feet the people will be gathered; and I am al-'Aqib [the Ultimate] (The name al-'Aqib [the Uhimate] means the one after whom there is no Prophet.)</b>",
        "bookID": "51.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "The last three names are mentioned with their reasons. The reasons for the first two names are not mentioned in the narration. Apparently it seems the first two are names, and the others are attributes, or it may be that there are many reasons for these names, or the reasons for it may be clear. The 'ulama have written that Muhammad is a hyperbole of the word hamd, which means praised abundantly, or it may be the name of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam because he had many virtues, or because he was praised occasionally, or it is because Allah praised Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam many times, and in the same manner the malaa-ikah, previous ambiyaa and awliyaa praised him, or it is by the way of tafaa-ul (optimism) that he be praised profusely, or because the past and present, all the people Praise Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, and on the day of qiyaamah all will be under his banner, which will be known as the Banner of Praise. The meaning of Ahmad is the one who praises more. The meaning of it may also be, the one who is more praised. In this case the word will have a similar meaning as that of the previous word, but the first meaning is better known. According to this, it will mean that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam praised Allah the most, which according to this world is apparent, and there is no doubt about this in the hereafter. On the day of qiyaamah, the Banner of Hamd will be in the hands of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. The Maqaamul Mahmud (laudable station) is for Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. At the time of shafaa'ah (inter-cession) Sayyidina Rasulullah Sallallahu 'Alayhi Wasllam will praise Allah so much that no one before him had ever praised Allah as much. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam has said: 'At that time I will be inspired to praise Allah Ta'aala, which is not before me at this moment'. The 'ulama have written that Muhammad is a special name of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, which was not kept before by the people. When the time for the birth of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam dawned, many people hoped that their children become worthy of the glad tidings, which were mentioned in the scriptures. They started keeping the name Muhammad thinking that this child would become a nabi. But \"Allah alone knows best, the place where He will choose for His Risaalah\".",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1903660,
        "last_updated": "2021-02-14 13:52:17"
    },
    {
        "englishURN": 1803600,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 51,
        "bookName": "Chapter 51. The Names Of Sayyidina Rasoolullah",
        "babNumber": "51.00",
        "babName": "Chapter 51. The Names Of Sayyidina Rasoolullah",
        "hadithNumber": 361,
        "hadithText": "Hudhaifa said:\n\"I encountered the Prophet (Allah bless him and give him peace) in one of the streets of Medina, and he said: “I am Muhammad; I am Ahmad; I am the Prophet of Mercy and the Prophet of Repentance; I am the Follower [of the earlier Prophets]; I am the Gatherer and the Prophet of the Fierce Battles.”</b>",
        "bookID": "51.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "These names are specially mentioned, because they used to foretell the coming of Sayyidina Rasulullah Sallallabu 'Alayhi Wasallam in the previous kitaabs of the ambiyaa. The Ahlul-Kitaab recognised Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam by these names and attributes. The first name mentioned is Nabiyyur Rahmah, the translation of which is prophet of mercy. Allah Ta'aala has attributed and made his noble soul a source of mercy for the Muslims and non- Muslims. It is stated in the Qur-aan Karim:<br><br>\"We sent thee not save as a mercy for the peoples\" - Suratul Ambiyaa, 107.<br><br>Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam being a mercy to the Muslims is clear, as 'they will receive his intercession in the world and the hereafter, and on the non-believers in this manner, that they were not punished in this world as had been the case with previous ummahs, due to the grace and kindness of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. It had been promised in the 'Qur-aan that the non-believers will not be punished whilst Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam is amongst them. If the deen of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam remains, order and tranquillity will continue to remain. When there will not be a single person left in this world, who will say Allah, the world will fall into chaos and qiyaamah will take place. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was sent as a prophet to the entire world, he was not sent to a certain tribe or community, in this respect too, he is a mercy unto mankind. Those who wish may become part of this mercy. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam also came as a teacher of love and kindness between the people and to teach brotherhood; considering this, he was a prophet of mercy. The doors of Allah's Mercy are open because of Sayyidina Rasulullah Sallallahu'Alayhi Wasallam. He conveyed the message of Allah's Mercy and glad tidings, according to this too he is a prophet of mercy.<br><br>The second name of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam is Nabiyyut Taubah, which means, he is the Prophet of repentance. (that the condition of forgiveness of the sins of his ummah was only that they repent sincerely, whereas, among the ummah of the previous ambiyaa, their sins were only forgiven if they killed themselves etc.) Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam commanded his ummah to repent frequently. He himself also repented frequently. Among these reasons, every reason indicates that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was a Nabi of Taubah. In the same manner he has the attribute of Muqaffaa, meaning the one that shall come last, after whom shall be no other nabi, or that he shall follow the previous ambiyaa. The 'ulama have stated both meanings. The result of the second meaning is that he confirmed the teachings of the previous ambiyaa about tauheed and other religious fundamentals. All the ambiyaa were unanimous in the teaching of tauheed (oneness of Allah), religious fundamentals, and good character. They differed in some practical aspects.<br><br>Another name is Haashir, which has been explained in the previous hadith. Nabiyul Milaahim was also the title of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, that me'ans, the Nabi of the Mulhimun. Malhamah is that war wherein fierce battle takes place. The reason for this title is clear, as the number of wars that took place in the time of Nabi Sallallahu 'Alayhi Wasallam and after him with his ummah, did not take place during the times of the previous ummahs. It will always remain so with this ummah. Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam had prophesied that jihaad will always continue in my ummah till the day of qiyaamah. The last among the ummah will go to war against the dajjaal (The Impostor, Anti-Christ). Some of the 'ulama, are of the opinion that the meaning of this word is unity and healing, and the unity that was experienced among the ummah of Muhammad Sallallahu 'Alayhi Wasallam previously, and despite all the differences of this age, unity is still experienced. This type of unity is not found to have remained for such a long time. The meaning of Malhamah is also a great calamity. According to this meaning also, this name of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam is correct, because in this ummah, before qiyaamah, many great and difficult calamities will occur, the similarity of which has not yet been witnessed by the ummahs of any nabi. Taking only the fitnah (trials) of dajjaal, the calamity of which will be so great and difficult, it cannot be comprehended. The hadith states, that from the time of Nuh Alayhis Salaam, every nabi warned their respective ummahs regarding the fitnah of dajjaal. In the same manner the great mischief of Yajuj Majuj (Gog Magog) etc. will take place, the signs of which are beginning to appear.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1903670,
        "last_updated": "2021-02-14 13:53:26"
    }
]