[
    {
        "englishURN": 1803610,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 52,
        "bookName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
        "babNumber": "52.00",
        "babName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
        "hadithNumber": 362,
        "hadithText": "Ibn Abbas said:\n“The Prophet (Allah bless him and give him peace) stayed in Mecca for thirteen years, during which he was inspired with Divine revelation, and in Medina for ten, and he died when he was sixty-three years of age.”</b>",
        "bookID": "52.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "Different narrations have been narrated regarding the age of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, which has been briefly explained at the beginning of this chapter. According to the muhadditheen and historians this is the most correct narration.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1903780,
        "last_updated": "2021-02-14 13:54:32"
    },
    {
        "englishURN": 1803620,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 52,
        "bookName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
        "babNumber": "52.00",
        "babName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
        "hadithNumber": 363,
        "hadithText": "Mu'awiya said in a sermon:\n\"The Prophet died (Allah bless him and give him peace) when he was sixty-three years of age, as did Abu Bakr and 'Umar, and I am now sixty-three years of age.”</b>",
        "bookID": "52.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "It means that it is not impossible for me to be blessed with the following of this natural age. The muhadditheen write that this wish of Sayyidina' Mu'aa-wiyah Radiyallahu 'Anhu was not fulfilled. He passed away at the age of eighty years. Sayyidina 'Uthmaan Radiyallahu'Anhu was not mentioned here, although he had close ties with him. The reason is apparent, that the age of 'Uthmaan Radiyallahu 'Anhu was more than eighty years old when he was martyred. The reason for Imaam Tirmidhi mentioning this narration is to strengthen the previous narration, where it is stated that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam passed away at the age of sixty three years. The Shaykhayn were blessed with the natural following of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam in this matter. ",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1903790,
        "last_updated": "2021-02-14 13:55:11"
    },
    {
        "englishURN": 1803630,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 52,
        "bookName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
        "babNumber": "52.00",
        "babName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
        "hadithNumber": 364,
        "hadithText": "'A’isha said:\n\"The Prophet died (Allah bless him and give him peace) when he was sixty-three years of age.”</b>",
        "bookID": "52.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "This narration is also to strengthen the previous narrations. It is confirmed from many narrations that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam attained the age of sixty three years. Therefore the narration that are contrary to these are not correct, or are not correct in their apparent form.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1903800,
        "last_updated": "2021-02-14 13:55:44"
    },
    {
        "englishURN": 1803640,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 52,
        "bookName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
        "babNumber": "52.00",
        "babName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
        "hadithNumber": 365,
        "hadithText": "Ibn 'Abbas said: \n\"Allah’s Messenger died (Allah bless him and give him peace) when he was sixty-five years of age.”</b>",
        "bookID": "52.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "This narration is contrary to the previous narration. It shall be briefly discussed at the end of the chapter, and a reference to it has already been made at the beginning of the chapter.",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1903810,
        "last_updated": "2021-02-14 13:56:35"
    },
    {
        "englishURN": 1803650,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 52,
        "bookName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
        "babNumber": "52.00",
        "babName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
        "hadithNumber": 366,
        "hadithText": "Daghfal ibn Hanzala said:\n\"The Prophet died (Allah bless him and give him peace) when he was sixty-five years of age.”</b>",
        "bookID": "52.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "After mentioning this hadith, Imaam Tirmidhi says that Daghfal Radiyallahu 'Anhu was present in the time of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, and was of an old age. It is not proven that he had met Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. It points he had heard this narration from another person.",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1903820,
        "last_updated": "2021-02-14 13:57:53"
    },
    {
        "englishURN": 1803660,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 52,
        "bookName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
        "babNumber": "52.00",
        "babName": "Chapter 52. The Noble Age Of Sayyidina Rasoolullah",
        "hadithNumber": 367,
        "hadithText": "Anas ibn Malik said:\n“Allah’s Messenger (Allah bless him and give him peace) was neither very tall of stature, nor short. His skin was neither pale white, nor tawny, and his hair was neither crisply curled, nor lank. Allah (Exalted is He) sent him [to serve as His Messenger] at the end of forty years of life, so he stayed in Mecca for ten years and in Medina for ten years, and Allah took him unto Himself at the end of sixty years, with fewer than twenty white hairs on his head and in his beard.”</b>",
        "bookID": "52.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "This hadith of Sayyidina Anas Radiyallahu 'Anhu has been mentioned at the beginning of the kitaab. In its commentary the three narrations have also been mentioned, and the explanations of the three different narrations have also been given. The 'ulama are unanimous in that the narrations where in the age of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam is narrated as sixty three years are the most correct. The other hadith can be referred to this, or it may be possible that the later narrators may have slipped up. Therefore in this hadith Sayyidina Anas Radiyallahu 'Anhu it could be explained that many a times, at the time of counting, only the units are mentioned, and the fractions omitted. Sayyidina 'Urwah bin Zubayr Radiyallhu 'Anhu, the nephew of Sayyidiyina 'Aayesha Radiyallahu 'Anha has stated that the narration of Sayyidina Ibn 'Ababas Radiyallahu 'Anhu where the age is mentioned as sixty five years is incorrect. Mulla Ali Qaari has explained this in detail.",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1903830,
        "last_updated": "2021-02-14 13:59:03"
    }
]