[
    {
        "englishURN": 1803670,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 53,
        "bookName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "babNumber": "53.00",
        "babName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "hadithNumber": 368,
        "hadithText": "Anas ibn Malik said:\n\"The last occasion when I caught sight of Allah’s Messenger (Allah bless him and give him peace) was the unveiling of the curtain on a Monday. I looked at his face as if it were a parchment of the Qur’an, as the people were performing the ritual prayer behind Abu Bakr. The people were about to get restless, so he gestured to them to keep calm, as Abu Bakr led them in prayer, and he cast the curtain aside. Allah’s Messenger (Allah bless him and give him peace) died at the end of that day.”</b>",
        "bookID": "53.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "This is the last glimpse on the Monday, wherein Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam judged that the shar'ee system has been established, and the old friend Sayyidina Abubakr Radiyallahu 'Anhu would fulfil his duty, and shoulder the responsibilities of the ummah. Accordingly, this is what took place and what the world witnessed, that the demise of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was such an occurrence before which all the incidents that took place in the world are of no importance and as if nothing had occurred, and with it the fitnah of apostasy, and the facing of all worldly problems, but this pinnacle of steadfastness endured all its calamities, and with a will stronger than hard rock, overcame all hardships and difficulties. The truth is that Sayyidina Abubakr Radiyallahu 'Anhu did justice to his responsibilities as a khalifah of Sayyidina Rasulullah Sallallabu 'Alayhi Wasallam. A pillar of Islaam like Sayyidina 'Umar Ridiyallahu 'Anhu, whose courage, strength and ability, friends and enemies alike had accepted, when requesting Sayyidina Abubakr Radiyallahu 'Anhu to adopt leniency, receives a reply not to be weak-hearted.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1903850,
        "last_updated": "2021-02-14 14:00:24"
    },
    {
        "englishURN": 1803680,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 53,
        "bookName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "babNumber": "53.00",
        "babName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "hadithNumber": 369,
        "hadithText": "A’isha said:\n\"I was resting the Prophet (Allah bless him and give him peace) on my chest (or: on my lap), when he called for a basin in which to urinate. Then he urinated and died soon after.”</b>",
        "bookID": "53.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "It is a pride for Sayyiditina 'Aayeshah Radiyallahu 'Anha that the last moments were spent with her. When Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam passed away from this world and reached his Creator, his head was resting in the lap of Sayyiditina 'Aayeshah Radiyallahu 'Anha.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1903860,
        "last_updated": "2021-02-14 14:01:13"
    },
    {
        "englishURN": 1803690,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 53,
        "bookName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "babNumber": "53.00",
        "babName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "hadithNumber": 370,
        "hadithText": "A’isha said:\n\"I saw Allah’s Messenger (Allah bless him and give him peace) when he was at the point of death, and beside him there was a vessel containing water. He would dip his hand into the vessel, then wipe his face with the water, saying: 'O Allah, help me against the atrocities of death (or: the agonies of death)!’”</b>",
        "bookID": "53.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "On one side it was a lesson to the ummah, and on the other side at the time of death, when the soul was leaving the body, it was a scene of complete steadfastness, perseverance and a total inclination towards Allah. At the time of death, when the soul was separated from the body, it is natural that pain was experienced. At that moment only Allah could be beseeched to make it easy.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1903870,
        "last_updated": "2021-02-14 14:02:08"
    },
    {
        "englishURN": 1803700,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 53,
        "bookName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "babNumber": "53.00",
        "babName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "hadithNumber": 371,
        "hadithText": "'A’isha said:\n\"No more will I envy anyone for an easy death now that I have seen how the Messenger of Allah (Allah bless him and give him peace) suffered in his passing.”</b>",
        "bookID": "53.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "Intense illness is a means of decreasing the sins of one's evil deeds, and increasing in the blessing of that person, Intense illness being a reason for death makes one utter more istighfaar and prepare for death.",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1903880,
        "last_updated": "2021-02-14 14:02:50"
    },
    {
        "englishURN": 1803710,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 53,
        "bookName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "babNumber": "53.00",
        "babName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "hadithNumber": 372,
        "hadithText": "A’isha said:\n\"When Allah’s Messenger died (Allah bless him and give him peace), they disagreed over where to bury him, so Abu Bakr said: “I heard Allah’s Messenger (Allah bless him and give him peace) say something I have never forgotten. He said: ‘Never has Allah taken a Prophet [from this world], but in the place where he would want to be buried.’ So bury him in the spot where his pallet is!'”</b>",
        "bookID": "53.0",
        "grade1": "Sanad Da'if wal-Hadīth Hasan",
        "grade2": "",
        "comments": "As after the death of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, it was destined that Abubakr Radiyallahu 'Anhu would take his place, therefore such masaa-il were a speciality only known by Sayyidina Abubakr Radiyallahu 'Anhu. A few ahaadith are mentioned as an example:No nabi's death occurs till that nabi becomes a muqtadi, (performs prayers behind) in salaah of among his ummah.The ahaadith on the collecting of zakaah and its nisaab rate.The portion between my grave and mimbar is a part from the gardens of jannah (paradise). 4. The ambiyaa do not have any heirs (No one inherits from a nabi).When Allah Ta'aala gives a nabi any rizq (sustenance), that person is responsible for its administration, who is the khalifah of the nabi.The one that becomes a khalifah or a king, and he carelessly chooses a deputy, the curse of Allah befalls him. By carelessness it is meant that he does not consider the facts.The hadith on the punishment for adultery.The hadith on consultations at the time of jihaad.The basis of the deen is on Laa ilaaha iliallaah.The khilaafah be among the Quraysh.The virtues of the Ansaar and the advice to the khalifahs on caring for them.The punishment of theft.A just and humble king is the Shadow of Allah on earth.The one who wishes to be safe from the hardships of jahannam and remain under the shadow of Allah, should not be harsh towards the Muslims, but treat them with love and care.The nations that discards jihaad, general calamities and hardships befall them. (Tarikhul Khulafaa).<br><br><br><br>Besides these, there are many other narrations regarding the demise of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam and the administration thereafter.",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1903890,
        "last_updated": "2021-02-14 14:03:42"
    },
    {
        "englishURN": 1803720,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 53,
        "bookName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "babNumber": "53.00",
        "babName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "hadithNumber": 373,
        "hadithText": "Ibn 'Abbas and ‘A’isha report:\n\"Abu Bakr kissed the Prophet (Allah bless him and give him peace) after he died.”</b>",
        "bookID": "53.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "This hadith is mentioned in brief. A more detailed one will be mentioned later. This kissing of Sayyidina Rasulullah Sallallahu'Alayhi Wasallam as mentioned by the commentators are for barakah. According to this humble servant it was a farewell kiss, as it was the final parting of a beloved friend.",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1903900,
        "last_updated": "2021-02-14 14:04:31"
    },
    {
        "englishURN": 1803730,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 53,
        "bookName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "babNumber": "53.00",
        "babName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "hadithNumber": 374,
        "hadithText": "A’isha said:\n\"Abu Bakr entered the presence of the Prophet (Allah bless him and give him peace) after his demise, whereupon he placed his mouth between his eyes, and his hands on his forearms, exclaiming: 'O Prophet! O best friend! O bosom friend!'”</b>",
        "bookID": "53.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "These words were not intended to draw attention, therefore there is no perplexity. A narration in Musnad Ahmad states that Sayyidina Abubakr Radiyallahu 'Anhu came towards the mubaarak head of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, bent his head towards the noble face and kissed the forehead, and said: 'Waa nabiyyaah'. He lifted his head bent and kissed the forehead again and said: 'Waa khalilaah\".",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1903910,
        "last_updated": "2021-02-14 14:05:21"
    },
    {
        "englishURN": 1803740,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 53,
        "bookName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "babNumber": "53.00",
        "babName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "hadithNumber": 375,
        "hadithText": "Anas said:\n\"On the day when Allah’s Messenger (Allah bless him and give him peace) entered Medina, every part of it shone bright, and on the day when he died, every part of it was gloomy. We did not shake the dust off our hands, and we\nwere engaged in his burial until we no longer recognized our own hearts.”</b>",
        "bookID": "53.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "This does not mean that a change took place in their deeds and beliefs, but they missed the bounties of his noble company and seeing his inspiring personality, and the anwaar that were always present could not be benefited from anymore. Nowadays too the disciples of the mashaa-ikh (spiritual guide) also feel the difference when in the shaykh's company and when not in his company. For this reason, in order to gain those anwaar, one is made to strive in dhikr and muraaqabah (meditation-contemplation). Previously all this was not necessary. The visiting of the jamaal of the entire universe (i.e. Sayyidina Rasulullah Sallallahu 'Alayhi.Wasallam) was enough for countless manifestations. It created such a status of imaan and ihsaan in a man which cannot be attained through countless rnujaahadaat (striving and exerting in spiritual upliftment). After becoming a Sahaabi, the love of Allah and his Rasul Sallallahu 'Alayhi Wasallam became so overwhelming that one's own life and wealth ceased to have value. The lives of the Sahaabah Radiyallahu 'Anhum are testimony to this.",
        "ourHadithNumber": 8,
        "matchingArabicURN": 1903920,
        "last_updated": "2021-02-14 14:06:20"
    },
    {
        "englishURN": 1803750,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 53,
        "bookName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "babNumber": "53.00",
        "babName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "hadithNumber": 376,
        "hadithText": "A’isha said:\n\"Allah’s Messenger died (Allah bless him and give him peace) on a Monday.”</b>",
        "bookID": "53.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "This has been mentioned previously. The muhadditheen and historians are unanimous in that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam passed away on Monday.",
        "ourHadithNumber": 9,
        "matchingArabicURN": 1903930,
        "last_updated": "2021-02-14 14:07:03"
    },
    {
        "englishURN": 1803760,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 53,
        "bookName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "babNumber": "53.00",
        "babName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "hadithNumber": 377,
        "hadithText": "Ja'far ibn Muhammad reported that his father said:\n\"Allah’s Messenger (Allah bless him and give him peace) died on Monday, after which he remained that day and Tuesday night, and he was buried during the night.”\nAccording to Sufyan [ibn 'Uyaina], someone else said: “The sound of the iron shovels could be heard during the latter part of the night.”</b>",
        "bookID": "53.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "The grave was dug in the last portion of the night. A question may arise why did it take so long before Sayyidina Rasulullah Sallalallahu 'Alayhi Wasallam was buried, wheras in the ahaadith it is stated that after death one should be buried as soon as possible. The fact is that the amount of obstacles that had to be overcome, taking this into consideration it could not be said that the burial was delayed, but was carried out as soon as possible. The first thing is, at the time of such a shocking incident, besides Abubakr Radiyallahu 'Anhu, all the others were either shocked, confused, or did not gasp the actual situation. Some were confounded and astonished. Some were so aghast and amazed that they could not even speak. Because of the intense shock it could not be believed that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallamhad passed away. A strong and powerful personality like 'Umar Radiyallahu 'Anhu could not control himself. Thereafter when the time came for the continuation of the administration, one thing was more important than any other. The most important issue at this moment was that of the khilaafah, because it was needed for every detail. And since it was a nabi, it was necessary to know every detail. As has been mentioned earlier, some were adamant that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam be taken to Makkah Mukarramah for burial. Some said to the burial place of Ebrahim 'Alayhis Salaam. etc. In the same manner there were differences regarding the tajheez (preparation for burial), takfeen (shrouding the deceased), salaatul janaazah (prayer for, the deceased) etc. The tajheez and takfeen of the common people were observed many a time, but the burial of a nabi was not witnessed before this. How should he be given the ghusl? How should the salaatul janaazah be performed? The ahaadith had to be referred to whenever a question arose. As a result Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was given the ghusl without his clothing being removed, and janaazah salaah was performed individually without a jamaa'ah as will be mentioned later. It is apparent that the time needed for every Muslim present there to perform the salaatul janaazah was considerable. Besides this, the question of allegiance (bay'ah) among the Ansaar cropped up, which made matters even more difficult. If an unsuitable person was chosen as an amir, the matters of the deen would become chaotic. To remove such a person later would have become a calamity on it's own. Therefore the protection of the deen now depended on the electing of an amir. This question was settled till the evening. The next, day after the general bay'ah (oath of allegiance) was made, Sayyidina Abubakr Radiyallahu 'Anhu commanded what should be carried out. Thereafter every stage was overcome without any difficulty.",
        "ourHadithNumber": 10,
        "matchingArabicURN": 1903940,
        "last_updated": "2021-02-14 14:08:10"
    },
    {
        "englishURN": 1803770,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 53,
        "bookName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "babNumber": "53.00",
        "babName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "hadithNumber": 378,
        "hadithText": "Abu Salama ibn 'Abd ar-Rahman ibn 'Awf said:\n\"Allah’s Messenger (Allah bless him and give him peace) died on Monday and he was buried on Tuesday.”</b>",
        "bookID": "53.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was buried during the night of Tuesday and Wednesday, which could be called Tuesday or Wednesday too. 'Hence this narration does not contradict the previous narration. Some of the 'ulama have said that after overcoming the question of the khilaafah, the tajheez and takfeen began on Tuesday and ended on the night of Wednesday (Tuesday night).",
        "ourHadithNumber": 11,
        "matchingArabicURN": 1903950,
        "last_updated": "2021-02-14 14:09:02"
    },
    {
        "englishURN": 1803780,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 53,
        "bookName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "babNumber": "53.00",
        "babName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "hadithNumber": 379,
        "hadithText": "Salim ibn 'Ubaida said:\n“Allah’s Messenger (Allah bless him and give him peace) lost consciousness in his illness, then he regained consciousness and said: ‘Has the ritual prayer arrived?’ They said: ‘Yes,’ so he said: ‘Command Bilal to give the call to prayer, and command Abu Bakr to lead the people in prayer.’ Then he lost consciousness, and when he recovered, he said: ‘Has the ritual prayer arrived?’ They said: ‘Yes,’ so he said: ‘Command Bilal to give the call to prayer, and command Abu Bakr to lead the people in prayer.’ 'A'isha then said: ‘My father is a melancholy man. If he is given that responsibility, he will weep and lose command of himself. SO if only you would appoint someone else!'\nHe [Salim] said: “Then he lost consciousness and recovered, so he said: ‘Command Bilal to give the call to prayer, and command Abu Bakr to lead the people in prayer, for you are the female companions of Yusuf!’ Bilal was therefore commanded, so he gave the call to prayer, and Abu Bakr was commanded, so he led the people in prayer. Then Allah’s Messenger (Allah bless him and give him peace) felt light in the head, so he said: ‘Find me someone I can lean on!’ Barira and another man therefore came to him, so he leaned on them. When Abu Bakr saw him, the man was about to withdraw, but he signaled for him to stay in his place until Abu Bakr completed his ritual prayer. Then Allah’s Messenger died (Allah bless him and give him peace), so 'Umar said: ‘If I hear anyone mention that Allah’s Messenger (Allah bless him and give him peace) has died, I will strike him with this sword of mine!”’\nHe [Salim] said: “The people were unlettered folk among whom there had never come a prophet before, so they held their tongues. But then they said: ‘O Salim, go to the Companion of Allah’s Messenger (Allah bless him and give him peace) and summon him.’ So I went to see Abu Bakr, in the mosque. I came to him weeping and perplexed, so when he saw me, he said: ‘Has Allah’s Messenger died (Allah bless him and give him peace)?’ I replied: 'Umar says: “If anyone mentions that Allah’s Messenger (Allah bless him and give him peace) has died, I will strike him with this sword of mine!” He then said to me: ‘Go outside,’ so I went outside with him. Then he came and found the people in the presence of Allah’s Messenger (Allah bless him and give him peace).\n“He therefore said: ‘O people, get out of my way,’ so they got out of his way. Then he leaned over him and touched him, saying: “You will surely die, and they will surely die.\" [inna-ka mayyitun wa inna-hum mayyitun].” (Al-Qur'an.39:3O). Then they said: ‘O Companion of Allah’s Messenger (Allah bless him and give him peace), should the funeral prayer be performed for Allah’s Messenger?’ When he said: ‘Yes,’ they asked: And how?’ He said: A group will enter, proclaim the Supreme Greatness of Allah, perform the ritual prayer and offer supplication. Then they will go out, so that other people may enter.’ They said: ‘O Companion of Allah’s Messenger (Allah bless him and give him peace), should Allah’s Messenger (Allah bless him and give him peace) be buried?’ When he said: ‘Yes,’ they asked: ‘Where?’ He said: ‘In the place in which Allah took his spirit, for Allah would not take his spirit in a place that was not good,’ and they knew that he had spoken the truth.’ Then he gave instructions for the sons of his father to bathe him, and the Emigrants [al-Muhajirun] assembled, consulting with one another. They said: ‘Take us to our brethren among the Helpers [al-Ansar], so that we may include them with us in this business.' The Helpers then said: ‘There should be a commander among us and a commander among you,’ so 'Umar ibn al-Khattab said: ‘Who has the like of these three [excellent merits of Abu Bakr]? [In the words of the Qur’an]: “The second of the two; when the two of them were in the cave, when he said to his companion: ‘Do not grieve. Allah is with us [thaniya’thnaini idh huma fi’l-ghari idh yaqulu li-sahibi-hi la tahzan inna’llaha ma'a-na].’” (Al-Qur'an.9:4O). Who are the two of them?’ Then he extended his hand, so they pledged allegiance to him, and the people paid him a beautiful homage.”</b>",
        "bookID": "53.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "This is the initial bay'ah that took place among the gathering of the Ansaar. Thereafter a general bay'ah was held in the Masjidun Nabawi, at the beginning of which 'Umar Radiyallahu 'Anhu delivered a khutbah in which he mentioned the virtues of Abubakr Radiyallahu 'Anhu and elaborated on other matters. Abubakr Radiyallahu 'Anhu then delivered a lengthy khutbah in which he said this too that, 'I swear an oath by Allah that I never coveted the post of khilaafah. Nor was I induced to do so in private or public, nor did I make du'aa for it. I feared that if I did not accept it, greater calamities would appear among the umrnah. I have no rest in it, and what has been thrown on me, is a burden which is beyond my control. Things can only run smoothly with the help of Allah'.",
        "ourHadithNumber": 12,
        "matchingArabicURN": 1903960,
        "last_updated": "2021-02-14 14:19:09"
    },
    {
        "englishURN": 1803790,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 53,
        "bookName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "babNumber": "53.00",
        "babName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "hadithNumber": 380,
        "hadithText": "Anas ibn Malik said:\n\"When Allah’s Messenger (Allah bless him and give him peace) was enduring of the agony of death, Fatima (may Allah be well pleased with her) exclaimed: 'Alas for his agony!' to which the Prophet replied (Allah bless him and\ngive him peace): 'Your father will suffer no agony from this day forth. Your father has met the fate from which no one is exempt, and which precedes ones appearance before Allah\non the Day of Resurrection.'”</b>",
        "bookID": "53.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "The word 'Haai' is used to express distress and sorrow. Here she meant to express sorrow.",
        "ourHadithNumber": 13,
        "matchingArabicURN": 1903970,
        "last_updated": "2021-02-14 14:20:47"
    },
    {
        "englishURN": 1803800,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 53,
        "bookName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "babNumber": "53.00",
        "babName": "Chapter 53. The Death Of Sayyidina Rasoolullah",
        "hadithNumber": 381,
        "hadithText": "Ibn 'Abbas (may Allah the Exalted be well pleased with him and his father) related that: he heard Allah’s Messenger say (Allah bless him and give him peace): 'If someone has two children from my Community who died an untimely death, Allah will cause him to enter the Garden of Paradise on their account,' so 'A'isha said (may Allah be well pleased with her): 'What about someone who has only one child from your Community who has died an untimely death?' He said: 'Also someone who has only one child who has died young, O favored one!' She said: 'So what about someone who does not have any child from your Community who has died as an infant?' He said: 'I am a child of my Community who died an untimely death. Never again will they be afflicted by the loss of the likes of me!'”</b>",
        "bookID": "53.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "Verily the loss of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam is such, that it is more sorrowful than the loss of one's parents, relatives, friends, wife, children. In fact the loss of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam is more than the loss of anyone else, which cannot be compared with anything else. It is stated in a hadith that when a person experiences difficulties, let him gain solace by thinking of it as a minor thing compared to my loss. He should think that patience was observed at the loss of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, so this difficulty has no comparison with it.",
        "ourHadithNumber": 14,
        "matchingArabicURN": 1903980,
        "last_updated": "2021-02-14 14:23:05"
    }
]