[
    {
        "englishURN": 1803810,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 54,
        "bookName": "Chapter 54. The Legacy Of Sayyidina Rasoolullah",
        "babNumber": "54.00",
        "babName": "Chapter 54. The Legacy Of Sayyidina Rasoolullah",
        "hadithNumber": 382,
        "hadithText": "'Amr ibn al-Harith, the brother of Juwairiyya, told us:\n\"Allah’s Messenger (Allah bless him and give him peace) left nothing behind except his weaponry, his female mule and some land which he had others give away as charity.”</b>",
        "bookID": "54.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "Since this was declared sadaqa, the laws of inheritance did not apply to them. As the clothing that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam used were of nominal value, it was not mentioned.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1903990,
        "last_updated": "2021-02-14 14:29:48"
    },
    {
        "englishURN": 1803820,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 54,
        "bookName": "Chapter 54. The Legacy Of Sayyidina Rasoolullah",
        "babNumber": "54.00",
        "babName": "Chapter 54. The Legacy Of Sayyidina Rasoolullah",
        "hadithNumber": 383,
        "hadithText": "Abu Huraira said (may Allah be well pleased with him):\n“Fatima came to Abu Bakr and said: ‘Who will inherit from you?’ He said: ‘My wives and my offspring,’ so she said: ‘Why should I not inherit from my father?’ Abu Bakr said:\n‘I heard Allah’s Messenger say (Allah bless him and give him peace): “We will not be inherited from,” but I support those whom Allah’s Messenger (Allah bless him and give him peace) used to support, and I provide for those for whom Allah’s Messenger (Allah bless him and give him peace) used to provide.’”</b>",
        "bookID": "54.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "Apparently it seems Sayyidina Faatimah Radiyallahu 'Anha thought that being a ruler, the estate of Sayyidina Rasulullah Sallallhu 'Alayhi Wasallam was not adjudged for his heirs. For this reason she inquired from Sayyidina Abubakr Radiyallahu 'Anhu that would he have any heirs. Sayyidina Abubakr Radiyallahu 'Anhu gave a shar'ee reply to the query, otherwise according to his own will he had stipulated that his wealth must be returned to the Baytul Maal (treasury). Therefore Sayyidina Abubakr Radiyallahu 'Anhu did not leave any heirs for his estate. The saying of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam that 'We do not leave any heirs' is a well known hadith, which has been mentioned in different wordings. In some narrations only those words are narrated that have been mentioned above. In some narrations, it is stated that, 'We the group of ambiyaa, do not leave heirs'. Shah Waliyullah has written in his 'Musawwa) ( on Muwatta) on this subject that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam did not leave any heirs, has been narrated by more than ten Sahaabah.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1904000,
        "last_updated": "2021-02-14 14:30:55"
    },
    {
        "englishURN": 1803830,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 54,
        "bookName": "Chapter 54. The Legacy Of Sayyidina Rasoolullah",
        "babNumber": "54.00",
        "babName": "Chapter 54. The Legacy Of Sayyidina Rasoolullah",
        "hadithNumber": 384,
        "hadithText": "Abu’l-Bakhtari reported:\nthat al-'Abbas and 'Ali came to 'Umar quarreling, each of them saying to his companion: “You are such-and-such, you are such-and-such!” 'Umar therefore said to Talha, az-Zubair, 'Abd ar-Rahman ibn 'Awf and Sa'd (may Allah the Exalted be well pleased with them): “I adjure you by Allah, have you heard Allah’s Messenger say (Allah bless him and give him peace): ‘Every possession of a Prophet is a charitable donation, except what provides him with food. No one shall inherit from us!'\"(This tradition is part of a longer story.)</b>",
        "bookID": "54.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "The aim of Imaam Tirmidhi was to mention that the ambiyaa do not leave heirs, which has been done here. For this reason the complete hadith is not narrated. Imaam Abu Daawud has mentioned it with a bit more detail. After mentioning a little, carried it over to the hadith of Sayyidina Maalik bin Aws Radiyallahu 'Anhu, which is mentioned in hadith number six. The hadith of Sayyidina Maalik bin Aws Radiyallahu'Anhu is better known. It has been mentioned many a time in Bukhaari, Muslim and Abu Daawud. And to mention the complete hadith every time in detail will result in it becoming too long. The translation of the narration in Abu Daawud is this: Sayyidina Abul Bakhtari Radiyallahu'Anhu says: 'I heard a hadith from a person which appealed very much to me. I requested him to write it for me. He presented it in a very clear writing'. Haafiz Ibn Hajar says this person is probably Sayyidina Maalik bin Aws Radiyallahu 'Anhu himself. In this hadith it was written that Sayyidina 'Abbaas Radiyallahu 'Anhu and Sayyidina 'Ali Radiyallahu 'Anhu came to 'Umar Radiyallahu 'Anhu. At that time Sayyidina Talhah Radiyallahu 'Anhu, Sayyidina Zubayr Radiyallahu 'Anhu, Sayyidina Sa'd Radiyallahu 'Anhu and Sayyidina Abdurrahmaan Radiyallahu 'Anhu were present there. Both Sayyidina 'Abbaas Radiyallahu 'Anhu and Sayyidina 'Ali Radiyallahu 'Anhu were arguing among themselves. i.e. they were accusing one another of negligence. Sayyidina 'Umar Radiyallahu 'Anhu while making the four Sahaabah Radiyallahu 'Anhum who were present witnesses, asked: 'Do you not know that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam said, \"Every possession of a Nabi is sadaqah, but that portion which he spends in feeding and clothing his wives and children. This is because we (the ambiyaa) do not leave heirs\"'. All our Sahaabah Radiyallahu 'Anhum that were present agreed and said verily Sayyidina Rasulullah Sallallahu 'Alayhi Wasalla'm said so. Sayyidina 'Umar Radiyallahu 'Anhu said: Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam spent from his wealth during his life-time and what was left was given away in sadaqah. After the death of Sayyidina Rasulullah Sallalalhu 'Alayhi Wasallam, Sayyidina Abubakr Radiyallahu 'Anhu became the khalifah. In this two-year reign he did that which was the practice of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam'. Imaam Abu Daawud says further, approximately the complete story is narrated in the hadith of Sayyidina Maalik bin Aws Radiyallahu 'Anhu.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1904010,
        "last_updated": "2021-02-14 14:37:01"
    },
    {
        "englishURN": 1803840,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 54,
        "bookName": "Chapter 54. The Legacy Of Sayyidina Rasoolullah",
        "babNumber": "54.00",
        "babName": "Chapter 54. The Legacy Of Sayyidina Rasoolullah",
        "hadithNumber": 385,
        "hadithText": "'A’isha said (may Allah be well pleased with her):\n\"Allah’s Messenger said (Allah bless him and give him peace): 'We are not inherited from. Whatever we leave behind is a charitable donation.’”</b>",
        "bookID": "54.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "By sadaqah it is meant that it should be spent on those to whom sadaqah is given.",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1904020,
        "last_updated": "2021-02-14 14:38:07"
    },
    {
        "englishURN": 1803850,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 54,
        "bookName": "Chapter 54. The Legacy Of Sayyidina Rasoolullah",
        "babNumber": "54.00",
        "babName": "Chapter 54. The Legacy Of Sayyidina Rasoolullah",
        "hadithNumber": 386,
        "hadithText": "Abu Huraira (may Allah be well pleased with him) reported: \n\"The Prophet said (Allah bless him and give him peace): 'My legacy will not be distributed as gold coin, nor as silver coin. Whatever I leave beyond support for my wives and the provisions for my workman will be a charitable donation.'”</b>",
        "bookID": "54.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "It has been explained that by Aamil, is referred to that person who will be the khalifah of the time after Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. It is also said that it is that person who collects and brings the harvest of the lands. i.e. who is in charge and manages the lands. It is possible both are intended here. The Baytul Maal is responsible for the salary of the khalifah, and every person responsible for managing the affairs also has the right to take his share of the estate. It is not necessary that it be in the form of Dinars and Dirhams (currency). For example it is mentioned that, if it is said money should not be distributed, that other things are included. Or it is said the, the distribution is always according to the value of the articles, in which case it shall always be referred to in terms of money.",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1904030,
        "last_updated": "2021-02-14 14:39:45"
    },
    {
        "englishURN": 1803860,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 54,
        "bookName": "Chapter 54. The Legacy Of Sayyidina Rasoolullah",
        "babNumber": "54.00",
        "babName": "Chapter 54. The Legacy Of Sayyidina Rasoolullah",
        "hadithNumber": 387,
        "hadithText": "Malik bin Aws ibn al-Hadtahan said:\n“I entered the presence of 'Umar, after which 'Abd ar- Rahman ibn 'Awf and Talha and Sa'd entered his presence, and 'Ali and al-'Abbas came in quarreling, so 'Umar said to them: ‘I adjure you by the One with whose permission the heaven and the earth exist, do you know that Allah’s Messenger said (Allah bless him and give him peace): 'We are not inherited from. Whatever we leave behind is a charitable donation'?\"</b>",
        "bookID": "54.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "This is the same incident which had been mentioned in hadith number three by Sayyidina Abul Bakhtari Radiyallahu 'Anhu. This incident is lengthy and has been mentioned in practically all the hadith kitaabs, either briefly or in detail. The hadith from Bukhaari is translated here. Other explanations and additions are taken from Fathul Baari and other narrations, which have been included as deemed necessary. Sayyidina Maalik bin Aws Radiyallahu 'Anhu reports: \"I was at home, the sun had risen quite a bit. A messenger from 'Umar Radiyallahu'Anhu came to call me. I went to 'Umar Radiyallahu 'Anhu. He was sitting on a sack, on which no other cloth was spread. I greeted him and sat down. 'Umar Radiyallahu 'Anhu said: 'Some needy among your people have come. I have given instructions that they be given something. Take them with you and distribute it among them'. I said, it would have been better if you had appointed someone else to distribute it among them. He replied: 'No, you must distribute it'. As we were discussing this, the servant of 'Umar Radiyallahu 'Anhu whose name was 'Yarfa came in and said: \"Uthmaan Radiyallahu 'Anhu, 'Abdurrahmaan bin 'Awf Radiyallahu 'Anhu, Zubayr Radiyallahu 'Anhu and Sa'd bin Abi Waqqaas Radiyallahu 'Anhu request permission to present themselves'. In some narrations Sayyidina Talhah Radiyallahu 'Anhu is also included. 'Umar Radiyallahu 'Anhu gave permission for them to enter. They entered, greeted and sat down. After'a little while Yarfa came in and said, \"Abbaas Radiyallahu 'Anhu and 'Ali Radiyallahu 'Anhu request permission to enter'. 'Umar Radiyallahu 'Anhu asked them to come in. Both came in, greeted and sat down. 'Abbaas Radiyallahu 'Anhu said: 'Give a verdict between me and this oppressor'. 'Abbaas Radiyallahu 'Anhu called 'Ali Radiyallahu 'Anhu some other harsh names too. As a result both began to argue. Sayyidina 'Uthmaan Radiyallahu 'Anhu and the others that were present requested 'Umar Radiyallahu 'Anhu to reconcile them and give a verdict. In the narration of Muslim this is also stated, Maalik bin Aws Radiyallahu 'Anhu says: 'From their request for a reconciliation and support, I felt that both of them had sent the Sahaabah Radiyallahu 'Anhum beforehand to strengthen their cases, and gain support'. 'Umar Radiyallahu 'Anhu said: 'Wait a bit, then addressing those present said, I swear an oath by the Holy Being in whose command is the skies and earth, and I ask you, do you know, that Rasulullah Sallallahu 'Alayhi Wasallam said: \"We do not leave heirs. Whatever we leave is sadaqah\"'. The group present agreed that truly Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam had said this. After this he turned towards 'Abbaas Radiyallahu 'Anhu and 'Ali Radiyallahu 'Anhu and in the same manner after swearing an oath asked them the same question. They both confessed that they knew. Sayyidina 'Umar Radiyallahu 'Anhu then said, \"Listen carefully. Allah Ta'aala had given this booty (garden etc.) especially to Rasulullah Sallallahu 'Alayhi Wasallam. No other person had a share in it, Rasulullah Sallallahu 'Alayhi Wasllam did not keep it strictly for himself, but distributed it among you people, and left a very small portion of the land for supporting himself and his family, and from this too after giving little in his homes, whatever was left was given in the path of Allah. I swear an oath and ask you, 'Was it so or not?'. He first made the five Sahaabah Radiyallahu 'Anhum swear an oath and testify to its being true. Thereafter he made both Sayyidina 'Abbaas Radiyallahu'Anhu and Sayyidina'Ali Radiyallahu'Anhu swear an oath and to testify to its being true. Sayyidina 'Umar Radiyallahu 'Anhu then said. 'After that Rasulullah Sallallahu 'Alayhi Wasallam passed away, and Abubakr Radiyallahu 'Anhu became the khalifah. He carried out this duty in the same manner as was the practice of Rasulullah Sallallahu 'Alayhi Wasallam. I swear by Allah that Abubakr Radiyallahu 'Anhu was correct in handling this matter in this manner. He was on the straight path and followed the truth. You have regarded this as a subterfuge. You (Sayyidina 'Abbaas Radiyallahu 'Anhu) have come to claim the estate of your nephew (Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam) and you (Sayyidina 'Ali Radiyallahu 'Anhu) have come to claim the share of your wife. Abubakr Radiyallahu 'Anhu said to you that Rasulullah Sallallahu 'Alayhi Wasallam said: \"We (the ambiyaa) have no heirs\". 'You did not accept his saying. Thereafter Abubakr Radiyallahu 'Anhu passed away and I became the khalifah, and in the first two years carried out this duty in the manner that Rasulullah Sallallahu 'Alayhi Wasallam and Abubakr Radiyallahu 'Anhu had done. Allah knows best that in adopting this manner I am on the truth, and the one who acts on pious deeds. Subsequently both of you came to me, and on that same claim, the one claims his nephew's estate and the other his wife's share. I had made known to you the saying of Rasulullah Sallallahu 'Alayhi Wasallam that we have no heirs. Thereafter, I thought it suitable by handing this affair to you as a guardian. I had taken an undertaking from you that you shall administer it in the same manner as Rasulullah Sallallahu 'Alayhi Wasallam, Abubakr Radiyallahu and I had done for two years.' You accepted it, and I handed it over to you. I ask you to swear an oath that did I not hand it over to you in this manner?' The group present admitted that he had done so. Sayyidina 'Abbaas Radiyallahu 'Anhu and Sayyidina 'Ali Radiyyallahu 'Anhu also admitted this fact. Sayyidina 'Umar Radiyallahu 'Anhu then said: 'Now do you wish that I pass a ruling contrary to this. I swear an oath by that Being in whose command lies the skies and earth, I will never give a ruling against this. If you are unable to administer it, then give it back to me. I shall administer it'. This is that long story which Imaam Timidhi has referred to as that 'It has a long story'.<br><br>A few points are worth noting here: (a.) Sayyidina 'Abbaas Radiyallahu 'Anhu had called Sayyidina 'Ali Radiyallahu 'Anhu an oppressor and both had an argument. This apparently seems unbefitting. Sayyidina 'Abbaas Radiyallahu 'Anhu is the uncle of Sayyidina 'Ali Radiyallahu 'Anhnu, according to this he has the right to reprimand him. Secondly, when he feels that Sayyidina 'Ali Radiyallahu 'Anhu was wrong, which shall be described later, then he has the right to call his act an oppression. (b.) When Sayyidina 'Abbaas Radiyallahu 'Anhu and Sayyidina 'Ali Radiyallahu 'Anhu knew about this hadith, and on the inquiring of Sayyidina 'Umar Radiyallahu 'Anhu accepted the knowledge of it, why did they make a claim to Sayyidina Abubakr Radiyallahu 'Anhu and later also to Sayyidina 'Umar Radiyallahu 'Anhu. If it is accepted that they did not have knowledge of this hadith from before, surely they knew it from the saying of Sayyidina Abubakr Radiyallahu 'Anhu. When Sayyidina Abubakr Radiyallahu 'Anhu did not accept their claims due to the hadith, why did they again come to Sayyidina 'Umar Radiyallahu 'Anhu for a ruling. The answer is that they were surely aware of this hadith. Apparently they must have thought that this hadith refers, for example, only to Dinars and Dirhams, as has been mentioned in an earlier hadith, but according to all the other people it included all the possessions of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam as mentioned in many a ahaadith in the words: 'Whatever I leave is sadaqah'. In this case the questioning of Sayyidina Abubakr Radiyallahu 'Anhu in the beginning is because they may have thought it for something special, and questioning 'Umar Radiyallahu 'Anhu the second time during the period of his khilaafah may have been because they thought the view of Sayyidina 'Umar Radiyallahu 'Anhu would agree with the view held by them. i.e. Sayyidina 'Umar Radiyallahu 'Anhu also regards it to be for something special. After making a claim to Sayyidina 'Umar Radiyallahu 'Anhu they found he held the same view as all the others had held. The words of the hadith also clearly show that everything is included, and it is not for something special. It is very important to note one thing here, that we may feel that the Shaykhayn (Sayyidina Abubakr Radiyallahu 'Anhu and Sayyidina 'Umar Radiyallahu 'Anhu) were helpless and compelled not to distribute the estate of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam due to his instruction. And although the people pleaded, the Shaykhayn did not distribute the estate. It is also necessary to point out that to hold evil thoughts against these great personalities that because of wealth, they kept on pleading for it, and although having the knowledge that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam clearly stated that he would have no heirs, they still asked for it. To hold such a view is a sign of impoliteness and great lack of understanding. They pleaded for it as they thought it their sharee right to do so. Therefore they refuted the view which was contrary to the one they held according to their findings, which Sayyidina 'Umar Radiyallahu 'Anhu mentioned by saying, \"You thought Abubakr (Radiyallahu 'Anhu) to be using a subterfuge\". (c.) After the denial of Sayyidina Abubakr Radiyallahu 'Anhu and Sayyidina 'Umar Radiyallahu 'Anhu, also taking into consideration the saying of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam that, \"We do not have heirs\", and after unanimous approval taking the estate under their control, how did this argument between the two come about, which resulted in strong language between them. Also what now brought about the question of distribution, when it had been made clear previously that this was not lawful? The reason for it is, that the question of distribution had been made clear from the beginning, that no heir would receive a share from the estate of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. For this reason the Shaykhayn did not give the permission for the assets to be distributed among the heirs, and the heirs too had accepted this as a fact. My late father had given the reason for their requesting the distribution of the estate, as there was a difference of opinion between Sayyidina 'Abbaas Radiyallahu 'Anhu and Sayyidina 'Ali Radiyallahu 'Anhu regarding the amount to be spent from the estate. Sayyidina 'Abbaas Radiyallahu 'Anhu was thoughtful and particular in the administration of the estate. He had foresight and had wished that the wealth be spent with care, and wished to keep some provisions for the time of need. Contrary to this, Sayyidina 'Ali Radiyallahu 'Anhu was very generous, big hearted, pious and had possessed tawakkul. He did the same as Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam had done. Whatever became available he immediately gave away to the needy. He did not like to leave a Dirham behind. For this reason there always occurred a clash between uncle and nephew. Haafiz Ibn Hajar writes in his Fathul Baari a narration from Daar Qutni, that the differences between them was not regarding the inheritance, but of the administration and its spending, how should the income be spent. Imaam Abu Daawud has written that the request of Sayyidina 'Abbaas Radiyallahu 'Anhu and Sayyidina 'Ali Radiyallahu 'Anhu was that the estate be distributed in two portions, and not that they claimed any inheritance. (d.) When these people wanted only to split the estate in to two portions, and did not claim any inheritance, why did Sayyidina 'Umar Radiyallahu 'Anhu reject this suggestion. Apparently there would be no problem, every one would have his own portion to administer and look after, and could spend and distribute the income immediately or later as they deemed appropriate. The 'ulama have given the reason for this, that in this manner there is a possibility that it would later result into an inheritance. It could also then be said that Sayyidina 'Umar Radiyallahu 'Anhu had changed his former view, therefore he had agreed to split the estate into two portions. This distribution would also be like Distributing the estate to the heirs. Half would go to the daughter and the other half to Sayyidina 'Abbaas Radiyallahu 'Anhu as a relative. If Sayyidina 'Umar Radiyallahu 'Anhu had accepted this, the future generations would have claimed, and it would also become a testimony that this estate could be distributed among the heirs. (e.) In the beginning although the Ahlul-Bayt thought that the estate could be distributed among the heirs, and made a claim to the Shaykhayn. Later they changed their views and accepted the ruling of the Shaykhayn. Sayyidina 'Ali Radiyallahu 'Anhu left the estate in its original form of administration at the time of his khilaafah. If I had thought that it should be distributed among the heirs he would have done so. In the beginning Sayyidina 'Abbaas Radiyallahu 'Anhu and Sayyidina 'Ali Radiyallahu 'Anhu were joint administrators of the estate. At the time of Sayyidina 'Uthmaan Radiyallahu 'Anhu's period of khilaafah, Sayyidina 'Abbaas Radiyallahu 'Anhu relinquished this post, thereafter Sayyidina 'Ali Radiyallahu 'Anhu became the sole administrator. After that Sayyidina Hasan Radiyallahu 'Anhu, then Sayyidina Husayn Radiyallahu 'Anhu, then Sayyidina 'Ali bin Husayn Riadiyallahu 'Anhu successively became administrators. (Fathul Baari). These few important questions regarding this incident have been briefly dealt with here. There are other discussions too which have been omitted to keep it brief.",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1904040,
        "last_updated": "2021-02-14 14:41:23"
    },
    {
        "englishURN": 1803870,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 54,
        "bookName": "Chapter 54. The Legacy Of Sayyidina Rasoolullah",
        "babNumber": "54.00",
        "babName": "Chapter 54. The Legacy Of Sayyidina Rasoolullah",
        "hadithNumber": 388,
        "hadithText": "Zirr ibn Hubaish reports that A’isha said (may Allah be well pleased with her):\n“Allah’s Messenger (Allah bless him and give him peace) did not leave behind a gold coin, nor a silver coin, nor a sheep, nor a camel.” Then he added, “And I suspect she said, 'nor a male and female slave.'”</b>",
        "bookID": "54.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "A narrator from the chain of narrators of this hadith doubted if these words were said or not. Therefore it is pointed out here. In other narrations it has also been mentioned that he did not leave a male or female slave.",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1904050,
        "last_updated": "2021-02-14 14:43:52"
    }
]