[
    {
        "englishURN": 1803880,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 55,
        "bookName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
        "babNumber": "55.00",
        "babName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
        "hadithNumber": 389,
        "hadithText": "'Abdullah ibn Mas'ud, that the Prophet said (Allah bless him and give him peace):\n“If someone sees me in his sleep, he has indeed seen me, for Satan cannot imitate me!\"</b>",
        "bookID": "55.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1904060,
        "last_updated": "2021-02-14 15:00:21"
    },
    {
        "englishURN": 1803890,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 55,
        "bookName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
        "babNumber": "55.00",
        "babName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
        "hadithNumber": 390,
        "hadithText": "Abu Huraira (may Allah be well pleased with him) said:\n“Allah’s Messenger said (Allah bless him and give him peace): ‘If someone sees me in his sleep, he has indeed seen me, for Satan cannot appear in disguise as me’(or: ‘cannot imitate me’).”</b>",
        "bookID": "55.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "The manner in which Allah Ta'aala has protected Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam from the shaytaan during his life time, in the same manner, after his death the shaytaan has not been given the power to impersonate Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. This is a decided fact. Now the question may arise that is the original form of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam seen?, that is, does the one who sees him obtain such strength that one will see him in his actual form, or does one see only his image. For example, if a person is sitting a little away from a mirror, another person who is also at a distance can see the image of the person in the mirror, but due to some obstruction cannot see the actual person. The sufis opine that Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam is seen both ways. Some people actually see Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam and some see his image, like the one described of the mirror. For this reason at times Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam is seen in the form of others, as if that person is a mirror of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1904070,
        "last_updated": "2021-02-14 15:11:10"
    },
    {
        "englishURN": 1803900,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 55,
        "bookName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
        "babNumber": "55.00",
        "babName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
        "hadithNumber": 391,
        "hadithText": "Abu Malik al-Ashja'i reported that his father said:\n\"Allah’s Messenger said (Allah bless him and give him peace): “If someone sees me in his sleep, he has indeed seen me!”</b>",
        "bookID": "55.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "A question may arise that different people in different towns, and different countries see Sayyidina Rasullullah Sallallahu'Alayhi Wasallam at the same moment in their dreams. How can Sayyidina Rasulullah Sallallahu'Alayhi Wasallam be present at different places at one moment. This view carries no weight because it is not necessary that if many people see him at one time or moment, he is present everywhere, but it is possible that different people can see him at one place. It is like the sun which is in no one place and many people see it from many towns which are a distance from one another. Also whatever colour of spectacles are worn, red, green, etc. to see the sun, the sun will appear in that colour, despite the sun having its original colour and form.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1904081,
        "last_updated": "2021-02-14 15:12:52"
    },
    {
        "englishURN": 1803910,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 55,
        "bookName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
        "babNumber": "55.00",
        "babName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
        "hadithNumber": 392,
        "hadithText": "'Asim ibn Kulaib’s father heard Abu Huraira say:\n“Allah’s Messenger (Allah bless him and give him peace) said: ‘If someone sees me in his sleep, he has indeed seen me, for Satan cannot imitate me!’ The father then related this to Ibn Abbas, saying that he had seen the Prophet. He also mentioned al-Hasan ibn ‘Ali, noting that he resembled the Prophet. To this Ibn 'Abbas replied, ‘Yes, he resembled him.’”</b>",
        "bookID": "55.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "<br>In some narrations it has been related that the chest and the portion above it, of the body of Sayyidina Hasan Radiyallahu'Anhu was similar to that of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, and the lower portion of Sayyidina Husayn Radiyallahu 'Anhu was similar in appearance to that of Sayyidina Rasulullah Sallallahu'Alayhi Wasallam.",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1904090,
        "last_updated": "2021-02-14 15:16:32"
    },
    {
        "englishURN": 1803920,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 55,
        "bookName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
        "babNumber": "55.00",
        "babName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
        "hadithNumber": 393,
        "hadithText": "Yazid al-Farisi, who used to inscribe copies of the Qur’an said:\n“I saw the Prophet (Allah bless him and give him peace) in my sleep in the time of Ibn 'Abbas, so I said to Ibn 'Abbas:\n‘I saw Allah’s Messenger (Allah bless him and give him peace) in my sleep!’\nIbn 'Abbas said: “Allah’s Messenger (Allah bless him and give him peace) used to say: ‘Satan cannot imitate me, so if someone sees me in his sleep, he has indeed seen me!’ Can you describe this man whom you saw in your sleep?” “Yes,” he said. “I shall describe for you an average man: his body and his flesh were brown-to-white; he was black eyed, endowed with a pleasant smile and handsome facial features; his beard went from here to here, and it came down over the top of his chest.”\n'Awf said: \"I do not know what could be added to this description,” and Ibn 'Abbas said: \"If you had seen him in the state of wakefulness, you could not have described him more accurately than this.”</b>",
        "bookID": "55.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "As this has been mentioned at the beginning of the book, here too the noble features of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam have been described in the same manner.",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1904100,
        "last_updated": "2021-02-14 15:20:51"
    },
    {
        "englishURN": 1803930,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 55,
        "bookName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
        "babNumber": "55.00",
        "babName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
        "hadithNumber": 394,
        "hadithText": "Abu Qatada said:\n“Allah’s Messenger said (Allah bless him and give him peace): ‘If someone sees me (meaning in his sleep), he has seen me truly!'”</b>",
        "bookID": "55.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "Meaning one has really seen me. It cannot be so that the shaytaan shows something else and says that it is Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. Some of the 'ulama have written that it means, it is a true dream and not a collection of thoughts. ",
        "ourHadithNumber": 8,
        "matchingArabicURN": 1904120,
        "last_updated": "2021-02-14 15:28:50"
    },
    {
        "englishURN": 1803940,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 55,
        "bookName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
        "babNumber": "55.00",
        "babName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
        "hadithNumber": 395,
        "hadithText": "Anas said:\n\"The Prophet said (Allah bless him and give him peace): 'If someone sees me in his sleep, he has indeed seen me, for Satan cannot impersonate me!' He also said: 'The vision of the believer is one of forty-six parts of Prophethood.'\"</b>",
        "bookID": "55.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "The 'ulama have adopted different headings to its meaning. Haafizul Hadith Ibn Hajar has written a very lengthy treatise in his commentary on Bukhaari, wherein he has mentioned the sayings of many 'ulama. The author of Tabreez has also written in detail on this subject. Mulla 'Ali Qaari and others have written that this is the best, because it is said to be part of the 'ilmi nubuwwah (knowledge of prophethood), and the 'ulum of nubuwwah is particular only to the ambiyaa, therefore, it should be regarded as something special only to them. In brief, it is sufficient to know that a good and blessed dream is a great glad tiding and a portion from the portions of nubuwwah. This is enough for his nobility, greatness and blessedness. Only a nabi can know correctly if it is a forty sixth part of nubuwwah, and he is the only one who can correctly understand how and what this forty sixth portion is.<br><br>The discussion of seeing Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam in a dream ends here. Imaam Tirmidhi ends his kitaab by including two athars, which in reality are advices and also an important warning. The first is that one should not guess and give a ruling. The basis of the deen should be in following Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam, and therefore in every verdict, Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam should be obeyed and followed. The second is that the verdict of any ordinary person should not be accepted, the irreligious are not worthy of being followed. In reality both advices are very important.",
        "ourHadithNumber": 9,
        "matchingArabicURN": 1904130,
        "last_updated": "2021-02-14 15:30:29"
    },
    {
        "englishURN": 1803950,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 55,
        "bookName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
        "babNumber": "55.00",
        "babName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
        "hadithNumber": 396,
        "hadithText": "Abdu llah ibn al-Mubarak said:\n“If you are afflicted with the responsibility of judgeship, you must follow the [Prophetic] tradition [al-athar]!”</b>",
        "bookID": "55.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "The object here is that one should not follow one's own view and completely rely on one's own way of thinking, but should follow the sayings of the pious predecessors and the Sahaabah Radiyallahu 'Anhum. This is the general advice of 'Abdullah bin Mubaarak. In respect of all verdicts, whether it refers to the verdicts of justice or otherwise, as has been mentioned. Imaam Tirmidhi has mentioned this as a general advice, this is the view of all the commentators of the Shamaa-il. According to this humble servant, this may have a special relation to this chapter, that the interpretation of a dream is also a verdict, therefore in this too one should not confuse others by giving one's own judgments, but should refer to the interpretation of the learned ones of the past. Many interpretations of dreams have been related from Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. The Sahaabah Radiyallahu 'Anhum and the Taabi'een. The 'ulama of the sciences of interpreting dreams have written, it is necessary for one who interprets dreams to be understanding, pious, cautious and have knowledge of the Qur-aan and Sunnah of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam. One should also possess knowledge of the 'Arabic language and its related sciences. Many other conditions and aadaab have been stipulated in books on interpretations of dreams.",
        "ourHadithNumber": 10,
        "matchingArabicURN": 1904140,
        "last_updated": "2021-02-14 15:31:17"
    },
    {
        "englishURN": 1803960,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 55,
        "bookName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
        "babNumber": "55.00",
        "babName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
        "hadithNumber": 397,
        "hadithText": "Ibn Sirin said:\n\"This tradition [hadith] is religion, so consider from whom you accept your religion.”</b>",
        "bookID": "55.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "Ibn Seereen was also an Imaam of his time and is a famous Taabi-ee. He acquired 'ilm from many of the Sahaabah Radiyallahu 'Anhum, and is regarded as the imaam in the art of interpreting dreams. His interpretations of dreams are a hujjah (testimony). The object of his advice is that prior to acquiring knowledge from a person, one should first thoroughly investigate the state of the person's piety, honesty religion and maslak (rule of conduct). One should not follow the sayings of every person, because the following of the sayings of an irreligious person has its effects. This has also been commanded by Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam in a few narrations. This is a general advice as mentioned in athar number one. This athar may also be relevant to the subject of interpreting dreams, as this subject is also important. When a good dream is a portion from the portions of nubuwwah, its importance can be understood. Therefore one should always be careful from whom one is seeking an interpretation of a dream. Is that person capable of interpreting a dream or not. It is for this reason that Imaam Tirmidhi has mentioned this athar here. This advice of Ibn Seereen is not particular or confined to the subject of dreams, but includes all other sciences. The more important the signs are, the more it becomes necessary to seek a competent and knowledgeable person. In our times which is close to the time of qiyaamah, a very dangerous and detrimental element has appeared. That every person, however unlearned or irreligious, after delivering a short inspiring lecture, or writing an article on a aspect of the deen, begins to be considered an 'allaamah or an 'aalim, and by donning coloured clothing begins to be regarded as a sufi, hence people ignorantly begin to follow such a person. In the beginning the general public due to some misunderstanding begin following such a person, and because of their ignorance they are caught in their web. This is because of a general misunderstanding, which has entered the hearts of the public, that 'See what is said and not who has said it'. Although this saying is true, it is for those who understand and differentiate, that which is being said, is it a fact or is it false? Those who cannot differentiate should not follow the sayings of every person they come across, as this will result in a bad and detrimental ending. It is for this reason that in these times, if one claims to be a saint, imaam, or prophet, and Allah forbid, also that of being a God, one group always immediately begins to follow that person. And to Allah is our complaint, and He is the One that grants assistance.",
        "ourHadithNumber": 11,
        "matchingArabicURN": 1904150,
        "last_updated": "2021-05-20 19:54:57"
    },
    {
        "englishURN": 1803901,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 55,
        "bookName": "The Seeing Of Rasoolullah In a Dream",
        "babNumber": "55.00",
        "babName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
        "hadithNumber": 391,
        "hadithText": "Khalaf ibn Khalifa said: \n“I saw Amr ibn Huraith, the Companion of the Prophet (Allah bless him and give him peace), when I was a little boy.”</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1904082,
        "last_updated": "2021-02-14 15:17:46"
    },
    {
        "englishURN": 1803921,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 55,
        "bookName": "The Seeing Of Rasoolullah In a Dream",
        "babNumber": "55.00",
        "babName": "Chapter 55. The Seeing Of Rasoolullah In a Dream",
        "hadithNumber": 393,
        "hadithText": "(Regarding one of the narrators of the previous narration) `Awf (Abu Jamilah) al-A`rabi said: \"I am older then Qatadah.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1904110,
        "last_updated": "2021-02-15 07:57:46"
    }
]