[
    {
        "englishURN": 1800480,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "Chapter 07. Kuhl Of Rasoolullah ",
        "babNumber": "7.00",
        "babName": "Chapter 07. Kuhl Of Rasoolullah ",
        "hadithNumber": 48,
        "hadithText": "Ibn 'Abbas reported that the Prophet said (Allah bless him and give him peace):\n\"Color the edges of the eyelids with antimony [ithmid], for it clears the vision and makes the eyelashes grow!” He also maintained that the Prophet (Allah bless him and give him peace) had a kohl jar from which he used to apply kohl to his eyelashes every night, three times in this [eye],and three times in that.</b>",
        "bookID": "7.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "Ithmid is a special type of kuhl which is reddish black in colour. It is obtained in the Eastern countries. Some of the learned say it is the Isfahaani kuhl, and other say it is the Totiya. Some 'ulama say, it means those who have good eyesight and it should be used by those with whose eyesight it agrees, otherwise a sick person's eyes will pain more by its use. It is more beneficial to apply kuhl at the time of sleeping as it will remain longer in the eyes, and will penetrate more into the pores. There are different narrations on the number of times it should be applied in each eye. In a few it is stated that it should be applied three times in each eye, as mentioned above. In other narrations it is stated that it should be put three times in the right eye and two times in the left eye. It is supposed that the variations are because of the different times of the narrations. At a certain time, Sayyidina Rasulullah Sallallahu alayhi Wasallam applied it in one manner and at another time in the other manner. Haafiz Ibn Hajar, Mulla 'Ali Qaari and other 'ulama have preferred the first method (as given in the hadith under discussion). the first method has been narrated many times from Sayyidina Rasulullah Sallallahu' Alayhi Wasallam, as will be seen in the narration that follow.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1900490,
        "last_updated": "2021-01-18 14:17:50"
    },
    {
        "englishURN": 1800490,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "Chapter 07. Kuhl Of Rasoolullah ",
        "babNumber": "7.00",
        "babName": "Chapter 07. Kuhl Of Rasoolullah ",
        "hadithNumber": 49,
        "hadithText": "Ibn 'Abbas said:\n“Allah’s Messenger (Allah bless him and give him peace) used to color the edges of his eyelids with antimony before going to sleep, three times in each eye.\nYazid ibn Harun also said in his tradition: “The Prophet (Allah bless him and give him peace) had a kohl jar from which he used to apply kohl to his eyelashes before going to sleep, three times in each eye.”</b>",
        "bookID": "7.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1900500,
        "last_updated": "2021-01-18 14:18:43"
    },
    {
        "englishURN": 1800500,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "Chapter 07. Kuhl Of Rasoolullah ",
        "babNumber": "7.00",
        "babName": "Chapter 07. Kuhl Of Rasoolullah ",
        "hadithNumber": 50,
        "hadithText": "Jabir (i.e. Ibn Abdillah) said:\n\"Allah’s Messenger said (Allah bless him and give him peace): “You must apply antimony before going to sleep, for it clears the vision and makes the eyelashes grow.”</b>",
        "bookID": "7.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1900510,
        "last_updated": "2021-01-18 14:19:51"
    },
    {
        "englishURN": 1800510,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "Chapter 07. Kuhl Of Rasoolullah ",
        "babNumber": "7.00",
        "babName": "Chapter 07. Kuhl Of Rasoolullah ",
        "hadithNumber": 51,
        "hadithText": "Ibn \"Abbas said:\n\"Allah’s Messenger said (Allah bless him and give him peace): 'The best of your eye salves is antimony, for it clears the vision and makes the eyelashes grow.'”</b>",
        "bookID": "7.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "One of the narrators in the chain of this hadith is Bishr bin Mufaddal RA. The 'ulama wrote that he performed four hundred rak'ahs nafl daily, and it was his permanent practice to fast every alternate day.",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1900520,
        "last_updated": "2021-01-18 14:21:05"
    },
    {
        "englishURN": 1800520,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "Chapter 07. Kuhl Of Rasoolullah ",
        "babNumber": "7.00",
        "babName": "Chapter 07. Kuhl Of Rasoolullah ",
        "hadithNumber": 52,
        "hadithText": "Ibn 'Umar said:\n\"You must apply antimony, for it clears the vision and makes the eyelashes grow.”</b>",
        "bookID": "7.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "In all the above narrations the use of kuhl made from ithmid has be stressed. Only those eyes are meant, that agree with the use of it, otherwise, because of certain eye conditions kuhl does not agree with some people, as was mentioned previously. The 'ulama have written that due to these commands and practices it is sunnah to use kuhl, and it is better to use the one made from ithmid. If one uses kuhl made from any other substance it will be regarded as sunnah, but the virtue is obtained by using kuhl made of ithmid.",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1900530,
        "last_updated": "2021-01-18 14:21:50"
    }
]