[
    {
        "englishURN": 1800530,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 8,
        "bookName": "Chapter 08. The Dressing Of Rasoolullah",
        "babNumber": "8.00",
        "babName": "Chapter 08. The Dressing Of Rasoolullah",
        "hadithNumber": 53,
        "hadithText": "Umm ul Mu'mineen Umm Salama said:\n\"The apparel dearest to Allah’s Messenger (Allah bless him and give him peace) was the shirt [qamis].”</b>",
        "bookID": "8.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "The 'ulama have written different reasons for Sayidina Rasulullah Sallallahu 'Alayhi Wasallam preferring to wear a qamis (Thowb, kurtah). Some say it is because it covers the body well and covers it better than a lungi etc. Some say because it is 'qumait' and besides it is less of a burden on the body, whereas a sheet has to be straightened every now and then. Some are of the opinion that it does not create pride in a person, as other clothing does. According to this humble servant the reason is because it covers the satr well, and the same time it is neat, whereas in some clothing there is less beauty, like the lungi, or it does not cover the satr well, like the top sheet. The eighth hadith in this chapter seems contrary to this hadith. It shall be compared and reconciled there.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1900540,
        "last_updated": "2021-01-19 15:54:13"
    },
    {
        "englishURN": 1800540,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 8,
        "bookName": "Chapter 08. The Dressing Of Rasoolullah",
        "babNumber": "8.00",
        "babName": "Chapter 08. The Dressing Of Rasoolullah",
        "hadithNumber": 54,
        "hadithText": "Umm Salama said:\n\"The apparel dearest to Allah’s Messenger (Allah bless him and give him peace) was the shirt.”</b>",
        "bookID": "8.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1900550,
        "last_updated": "2021-01-19 15:55:11"
    },
    {
        "englishURN": 1800550,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 8,
        "bookName": "Chapter 08. The Dressing Of Rasoolullah",
        "babNumber": "8.00",
        "babName": "Chapter 08. The Dressing Of Rasoolullah",
        "hadithNumber": 55,
        "hadithText": "Umm Salama said:\n\"The apparel dearest to Allah’s Messenger (Allah bless him and give him peace) was the shirt he used to wear.”</b>",
        "bookID": "8.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "Mulla 'Ali Qaari relates from Dimyaati that the qamis of Sayidina Rasulullah Sallallahu 'Alayhi Wasallam was made of cotton and was not very long, nor were the sleeves long. Bayjuri has written that Sayidina Rasulullah Sallallahu 'Alayhi Wasallam had only one qamis. It is reported from Sayyiditina 'Aayeshah Radhiyallahu 'Anha that: \"Rasulullah Sallallahu 'Alayhi Wasallam did not leave any of the morning food for the evening, nor any of the evening food for the morning. He possessed only one each, of a lungi, qamis, sheet (body wrap), shoes or any other clothing. He did not have a pair of any of these\".<br><br>Munaawi relates from Sayyidina Ibn 'Abbaas Radiyallahu 'anhu that, 'The qamis (thowb, kurtah) of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was not very long, nor were its sleeves long. In another hadith of Sayyidina Ibn 'Abbaas Radiyalia anhu it is stated that the qamis of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was above the ankles. 'Allaamah Shaami says: 'It should reach halfway down the calf'.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1900560,
        "last_updated": "2021-01-19 15:56:31"
    },
    {
        "englishURN": 1800560,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 8,
        "bookName": "Chapter 08. The Dressing Of Rasoolullah",
        "babNumber": "8.00",
        "babName": "Chapter 08. The Dressing Of Rasoolullah",
        "hadithNumber": 56,
        "hadithText": "Asma bint Yazid said:\n“The sleeve of the shirt of Allah’s Messenger (Allah bless him and give him peace) extended to the wrist.”</b>",
        "bookID": "8.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "This narration apparently contradicts the one where it has been stated that the sleeves of the qamis of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam were a bit longer than the wrist. The 'ulama have summed up the difference in several ways. Firstly, that at different times it had different lengths. Secondly, that when the sleeves were creased they were above the wrists, and when they were smooth and straight they were over the wrists. Some are of the opinion that both are taken on estimation. In this case there is no difficulty. Maulana Khalil Ahmad Saahib has written in the 'Badhlul Majhud' that where it is mentioned till the wrists, it is taken to be the best and desirable. Where the sleeves are stated to be longer, it is considered permissible. 'Allaamah Jazari states that it is sunnah that the length of the qamis (kurtah) sleeves reach till the wrists, and that of a jubbah be a bit longer, but in no case should it be longer than the fingers.",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1900570,
        "last_updated": "2021-01-19 15:57:12"
    },
    {
        "englishURN": 1800570,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 8,
        "bookName": "Chapter 08. The Dressing Of Rasoolullah",
        "babNumber": "8.00",
        "babName": "Chapter 08. The Dressing Of Rasoolullah",
        "hadithNumber": 57,
        "hadithText": "Mu'awiya ibn Qurra reported that his father said:\n“I came to Allah’s Messenger (Allah bless him and give him peace) in a group of fewer than ten men from the Muzaina tribe, so that we might pay homage to him, and his shirt was set loose (or: “the button of his shirt was set loose”), so I inserted my hand in the breast of his shirt and I touched the Seal.”</b>",
        "bookID": "8.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "When he visited Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam he found the collar of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam's qamis open. It is characteristic of one who loves, that every act of his beloved sinks into his heart. Sayyidina 'Urwah Radiyallahu'Anhu, who is a narrator of this says: \"I have never seen Mu'aawiyah (bin Qurrah - Radiyallahu'Anhu) and his son button up their collars. Be it summer or winter, their collars were always open\". Their love for Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam has given us a glimpse of each and every act and deed of the beloved Rasul of Allah, Sallallahu 'Alayhi Wasallam. 'Jazahumullahu 'anna wa-'an saa-iril ummati ahsanal jazaa'.",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1900580,
        "last_updated": "2021-01-19 15:59:06"
    },
    {
        "englishURN": 1800580,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 8,
        "bookName": "Chapter 08. The Dressing Of Rasoolullah",
        "babNumber": "8.00",
        "babName": "Chapter 08. The Dressing Of Rasoolullah",
        "hadithNumber": 58,
        "hadithText": "Anas ibn Malik said:\n\"The Prophet (Allah bless him and give him peace) came out leaning on Usama ibn Zaid, wearing an outer garment of coarse cotton fabric, which he had thrown on loosely, then he led them in the ritual prayer.”</b>",
        "bookID": "8.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "'Daar Qutni' has stated that this incident took place when Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam was ill. For this reason he was assisted by Sayyidina Usaamah bin Zayd Radhiyallahu 'Anhu. It is possible that it was the time of Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam's illness before his death. This hadith will also be mentioned in the chapter on 'Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam leaning on something'. Imaam Tirmidhi has written a surprising incident on the sanad (chain of narrators) of this hadith, from which we can gauge the intense love of the muhadditheen for the hadith, and their detachment from this unstable and materialistic world. Muhammad bin AI-Fadl says: \"Yahya bin Mu'een (who is a great imaam and scholar of hadith - some 'ulama have said that he has written ten lakh -100,000- ahaadith with his own hands) asked me as soon as I sat down (when visiting him), about this hadith. I started reciting it to him. He said: 'I desire you to read it out from your kitaab so that it may be more satisfying\"' Muhammad bin AI-Fadl says: 'I stood up to go inside and fetch the kitaab. He caught me by my qamis and said: \"First dictate it to me from memory, so that I may write it down. There is no surety of life and death. It is possible I may meet you or Imay not meet you again. You may repeat it from the kitaab later'. Muhammad bin AI-Fadl says: 'I recited it to him from memory, then brought the kitaab and read it out again from the kitaab'. Allahu Akbar! He did not have that little assurance that either of them would live till he went inside to get a kitaab and return. His love for the hadith was such that he did not even like to wait till the kitaab was brought from inside the room.",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1900590,
        "last_updated": "2021-01-19 16:00:12"
    },
    {
        "englishURN": 1800590,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 8,
        "bookName": "Chapter 08. The Dressing Of Rasoolullah",
        "babNumber": "8.00",
        "babName": "Chapter 08. The Dressing Of Rasoolullah",
        "hadithNumber": 59,
        "hadithText": "Abu Sa'id al-Khudri said:\n\"When Allah’s Messenger (Allah bless him and give him peace) donned a new garment, he would call it by its name, then he would say: 'O Allah praise be to You, as You have clothed me with it! I beg You for its goodness and the goodness of what it has been made for, and I take refuge with You from its evil and the evil of what it has been made for!’”</b>",
        "bookID": "8.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "The goodness and badness of a garment is evident and 'for the good and bad for which it was made' means for summer and winter, elegance etc. For whatever reason it is worn, the goodness in it is that it may be used to obtain Allah's pleasure, like performing 'ibaadah (devotion) with it. To use it for a bad cause would be in disobeying Allah or to create pride, arrogance etc.",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1900600,
        "last_updated": "2021-01-19 16:01:40"
    },
    {
        "englishURN": 1800600,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 8,
        "bookName": "Chapter 08. The Dressing Of Rasoolullah",
        "babNumber": "8.00",
        "babName": "Chapter 08. The Dressing Of Rasoolullah",
        "hadithNumber": 60,
        "hadithText": "Anas ibn Malik said:\n“The apparel dearest to Allah’s Messenger (Allah bless him and give him peace) was the hibara [striped garment of Yemenite fabric] that he used to wear.”</b>",
        "bookID": "8.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "This seems to contradict the hadith mentioned at the beginning of the chapter where it is stated that Sayyidina Rasulullah (Sallalahu alaihe wasallam) preferred wearing the qamis (kurtah) the most. The 'Ulama have given many explanations for this. The simplest explanation if that there is no difference. He liked the qamis very much and the sheet too. It could also be said that among ordinary clothing that are worn, he liked the qamis the most, and from the ones that are used for outer covering, he liked the sheet the most. It has also been stated that for purposes of evidence this is a much stronger hadith. Some 'Ulama have taken the first hadith for the different types of clothing, among which Sayyidina Rasulullah (S.A.W) liked the qamis most, and this hadith for the coloured clothing, from which he liked the coloured printed sheet the most. Some say the sheet was of a green colour. The object is that, among the colours, green was liked the most, as it is the colour of the clothing in Jannah (paradise).",
        "ourHadithNumber": 8,
        "matchingArabicURN": 1900620,
        "last_updated": "2021-01-19 16:02:45"
    },
    {
        "englishURN": 1800610,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 8,
        "bookName": "Chapter 08. The Dressing Of Rasoolullah",
        "babNumber": "8.00",
        "babName": "Chapter 08. The Dressing Of Rasoolullah",
        "hadithNumber": 61,
        "hadithText": "Awn ibn Abi Juhaifa said that his father said:\n“I saw the Prophet (Allah bless him and give him peace) wearing a red garb, as if I were looking at the sheen of his legs.” Sufyan said: “I think it was a hibara [striped garment of Yemenite fabric].”</b>",
        "bookID": "8.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "This incident took place at the time of Hajjatul-Widaa, as is stated if the Bukhaari and other kitaabs of hadith. Sayyidina Sufyaan (R.A) 'Anhu's reason for saying that this was a red coloured clothing (for men). There is a difference of opinion among the 'Ulama'. The Hanafis also state a number of opinions. This has been discussed in the first chapter. Before choosing red-coloured clothing an 'aalim should be consulted. Maulana Gangohi has mentioned a few times in his fataawa (religious rulings) that it is permissible for a man to wear red patterned garment's. From the point of taqwaa (piety) it is better for a man not to wear red coloured garments, since there is a difference of opinion among the learned 'Ulama'.",
        "ourHadithNumber": 9,
        "matchingArabicURN": 1900630,
        "last_updated": "2021-01-19 16:04:45"
    },
    {
        "englishURN": 1800620,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 8,
        "bookName": "Chapter 08. The Dressing Of Rasoolullah",
        "babNumber": "8.00",
        "babName": "Chapter 08. The Dressing Of Rasoolullah",
        "hadithNumber": 62,
        "hadithText": "Al-Bara’ ibn ‘Azib said:\n\"I never saw anyone among the people more handsome in a red garb than Allah’s Messenger (Allah bless him and give him peace), when the hair of his head was touching close to his shoulders.”</b>",
        "bookID": "8.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "This hadith has been mentioned in the first chapter. It is repeated here because of the red-coloured clothing.",
        "ourHadithNumber": 10,
        "matchingArabicURN": 1900640,
        "last_updated": "2021-01-19 16:05:48"
    },
    {
        "englishURN": 1800630,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 8,
        "bookName": "Chapter 08. The Dressing Of Rasoolullah",
        "babNumber": "8.00",
        "babName": "Chapter 08. The Dressing Of Rasoolullah",
        "hadithNumber": 63,
        "hadithText": "Abu Rimtha said:\n“I saw the Prophet (Allah bless him and give him peace) wearing two green garments.\"</b>",
        "bookID": "8.0",
        "grade1": "Sahih Isnād",
        "grade2": "",
        "comments": "This hadith has been quoted twice. It is repeated here briefly.\r\n",
        "ourHadithNumber": 11,
        "matchingArabicURN": 1900650,
        "last_updated": "2021-01-19 16:06:29"
    },
    {
        "englishURN": 1800640,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 8,
        "bookName": "Chapter 08. The Dressing Of Rasoolullah",
        "babNumber": "8.00",
        "babName": "Chapter 08. The Dressing Of Rasoolullah",
        "hadithNumber": 64,
        "hadithText": "Qaila bint Makhrama said:\n“I saw the Prophet (Allah bless him and give him peace) wearing the tatters of two sheets which had been dyed with saffron, but had lost their color....” (This tradition is part of a longer story.)</b>",
        "bookID": "8.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "It is prohibited in the hadith to use clothing dyed with saffron. For this reason it has been pointed out in the above hadith that the colour of the saffron had faded, so that there remains no contradictions in the ahaadith. Sayyidina Rasulullah (S.A.W) wore the two old sheets as a sign of humility. The sufis have for this reason chosen a rugged way of life. This leads one towards humility and keeps one away from pride and arrogance. It should also be borne in mind that if (the wearing of such clothing) does not have this effect then this manner is not preferred. It will cause more harm than good as we see it happening in these times. Many a time this way is adopted to show that one has reached the stage of perfection whilst the tongue is asking (begging).<br><br>An incident of Abul-Hasan Shaa-dhali who is from among the great sufis is famous. Once he was wearing smart clothing. Some raggedly dressed person objected. He replied, \"My dressing in this manner shows praise and gratefulness to Allah, whereas this state of yours shows a state of asking (begging). You in your present state are begging from people.\" In short, it is better not to wear showy clothing but only with the intention of humbleness, and on condition that it does not lead one towards some other harm. On the other hand, if it is worn for some religious benefits or to please a confidant who has given it as a present, then in this case to wear elegant clothing will also be mandub (desirable) and better. Sayyidina Rasulullah (S.A.W) once purchased a set of clothing in exchange for twenty seven camels and wore that clothing for this reason. The mashaa-ikh of the Naqshabandiyyah and Shaa-dhaliyyah Orders usually wear elegant type of clothing. It has been given preference because it saves one from the appearance of a beggar. Imaam Abul-Hasan Shaa-dhali has said: \"It is important that one should keep away from the deceit of the heart from both angles. The gaining of fame by dressing shabbily, to show off by being humble, and to show pride by wearing smart elegant clothing, all are dangerous to our spiritual up-liftment.<br><br>There is lengthy story in this hadith that is not relevant to the dressing of Sayyidina Rasulullah (S.A.W). Therefore Imaam Tirmidhi omitted it here with the object of shortening the hadith. The story probably covers two sheets. The commentators have also omitted it for the same reason. In it are mentioned incidents of the early period and experiences of Sayyiditina Qaylah (R.A) after her acceptance of Islaam. In a few narrations it is also mentioned that Sayyidina Ralsulullah (S.A.W) was sitting with his old clothing in a humble manner. He had a branch (fan) of a palm in his mubaarak hands. A person entered his noble assembly. He saw Sayyidina Rasulullah (S.A.W) in this state of humbleness and dur to the awe-inspiring appearance of Sayyidina Rasulullah (S.A.W), began shivering. Upon seeing this person in this state, or being made aware of it, Sayyidina Rasulullah (S.A.W) said to him: \"Keep calm.\" As soon as Sayyidina Rasulullah (S.A.W) said this he became calm, and all the signs of fear vanished. In some ahaadith we gather that this incident relates to Sayyiditina Qaylah (R.A.) herself. Imaam Tirmikhi has therefore mentioned this briefly in the chapter on the sitting of Sayyidina Rasulullah (S.A.W). The incident is attributed to Sayyiditina Qaylah (R.A) and will be mentioned in the chapter on the sitting of Sayyidina Rasulullah (S.A.W).",
        "ourHadithNumber": 12,
        "matchingArabicURN": 1900660,
        "last_updated": "2021-01-19 16:07:17"
    },
    {
        "englishURN": 1800650,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 8,
        "bookName": "Chapter 08. The Dressing Of Rasoolullah",
        "babNumber": "8.00",
        "babName": "Chapter 08. The Dressing Of Rasoolullah",
        "hadithNumber": 65,
        "hadithText": "Ibn 'Abbas said:\nAllah’s Messenger said (Allah bless him and give him peace): “You should acquire white clothes, so that your living ones may wear them, and you can shroud your deceased in them, for they are among the best of your clothes.”</b>",
        "bookID": "8.0",
        "grade1": "Hasan Isnād",
        "grade2": "",
        "comments": "In this hadith it is not stated that Sayyidina (S.A.W) wore white clothing. Its mention in the 'Shamaa-il Tirmikhi' is therefore implicit. Idt can be explained that when Sayyidina Rasulullah (S.A.W) encouraged the wearing of white clothing, then he must have worn it himself. If is clearly stated in the Bukhaari that Sayyidina Rasulullah (S.A.W) wore white clothing.",
        "ourHadithNumber": 13,
        "matchingArabicURN": 1900670,
        "last_updated": "2021-01-19 16:08:07"
    },
    {
        "englishURN": 1800660,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 8,
        "bookName": "Chapter 08. The Dressing Of Rasoolullah",
        "babNumber": "8.00",
        "babName": "Chapter 08. The Dressing Of Rasoolullah",
        "hadithNumber": 66,
        "hadithText": "Samura ibn Jundub said:\n“Allah’s Messenger said (Allah bless him and give him peace): 'Wear white, for it is most pure and pleasant, and you must shroud your deceased therein'.”</b>",
        "bookID": "8.0",
        "grade1": "Da'if Isnād",
        "grade2": "",
        "comments": "By 'It is more taahir (paak) and clean is meant that if a small stain appears, it will show clearly, whereas in coloured clothing it does not show easily.",
        "ourHadithNumber": 14,
        "matchingArabicURN": 1900680,
        "last_updated": "2021-01-19 16:09:04"
    },
    {
        "englishURN": 1800670,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 8,
        "bookName": "Chapter 08. The Dressing Of Rasoolullah",
        "babNumber": "8.00",
        "babName": "Chapter 08. The Dressing Of Rasoolullah",
        "hadithNumber": 67,
        "hadithText": "'Aisha said;\n“Allah's Messenger (Allah bless him and give him peace) went out one early morning, wearing a wrap of black hair.”</b>",
        "bookID": "8.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 1900690,
        "last_updated": "2021-01-19 16:10:10"
    },
    {
        "englishURN": 1800680,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 8,
        "bookName": "Chapter 08. The Dressing Of Rasoolullah",
        "babNumber": "8.00",
        "babName": "Chapter 08. The Dressing Of Rasoolullah",
        "hadithNumber": 68,
        "hadithText": "Urwa ibn al-Mughira ibn Shu'ba said that his father said:\n“The Prophet (Allah bless him and give him peace) wore a Byzantine robe with narrow sleeves.”</b>",
        "bookID": "8.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "This incident was at the time of Ghazwah Tabuk. The 'Ulama have interpreted from this hadith that a thing made by non-believers is not najis (na-paak) till we can outwardly find of this. Upto that time there were no Muslims in Rome, and Sayyidina Rasulullah (S.A.W) wore the clothing made by them.",
        "ourHadithNumber": 16,
        "matchingArabicURN": 1900700,
        "last_updated": "2021-01-19 16:11:25"
    }
]