[
    {
        "arabicURN": 108760,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "1.00",
        "hadithNumber": "990",
        "bookName": "كتاب الوتر ",
        "babName": "باب مَا جَاءَ فِي الْوِتْرِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، وَعَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَجُلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَلاَةِ اللَّيْلِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ صَلاَةُ اللَّيْلِ مَثْنَى مَثْنَى، فَإِذَا خَشِيَ أَحَدُكُمُ الصُّبْحَ صَلَّى رَكْعَةً وَاحِدَةً، تُوتِرُ لَهُ مَا قَدْ صَلَّى ‏\"‏‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 1,
        "matchingEnglishURN": 9401,
        "last_updated": null
    },
    {
        "arabicURN": 108770,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "1.00",
        "hadithNumber": "991",
        "bookName": "كتاب الوتر ",
        "babName": "باب مَا جَاءَ فِي الْوِتْرِ ",
        "hadithText": "وَعَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُسَلِّمُ بَيْنَ الرَّكْعَةِ وَالرَّكْعَتَيْنِ فِي الْوِتْرِ، حَتَّى يَأْمُرَ بِبَعْضِ حَاجَتِهِ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 2,
        "matchingEnglishURN": 9402,
        "last_updated": null
    },
    {
        "arabicURN": 108780,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "1.00",
        "hadithNumber": "992",
        "bookName": "كتاب الوتر ",
        "babName": "باب مَا جَاءَ فِي الْوِتْرِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ، عَنْ كُرَيْبٍ، أَنَّ ابْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّهُ، بَاتَ عِنْدَ مَيْمُونَةَ، وَهْىَ خَالَتُهُ، فَاضْطَجَعْتُ فِي عَرْضِ وِسَادَةٍ، وَاضْطَجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَهْلُهُ فِي طُولِهَا، فَنَامَ حَتَّى انْتَصَفَ اللَّيْلُ أَوْ قَرِيبًا مِنْهُ، فَاسْتَيْقَظَ يَمْسَحُ النَّوْمَ عَنْ وَجْهِهِ، ثُمَّ قَرَأَ عَشْرَ آيَاتٍ مِنْ آلِ عِمْرَانَ، ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى شَنٍّ مُعَلَّقَةٍ، فَتَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ، ثُمَّ قَامَ يُصَلِّي فَصَنَعْتُ مِثْلَهُ فَقُمْتُ إِلَى جَنْبِهِ، فَوَضَعَ يَدَهُ الْيُمْنَى عَلَى رَأْسِي، وَأَخَذَ بِأُذُنِي يَفْتِلُهَا، ثُمَّ صَلَّى رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ أَوْتَرَ، ثُمَّ اضْطَجَعَ حَتَّى جَاءَهُ الْمُؤَذِّنُ فَقَامَ فَصَلَّى رَكْعَتَيْنِ ثُمَّ، خَرَجَ فَصَلَّى الصُّبْحَ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 3,
        "matchingEnglishURN": 9410,
        "last_updated": null
    },
    {
        "arabicURN": 108790,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "1.00",
        "hadithNumber": "993",
        "bookName": "كتاب الوتر ",
        "babName": "باب مَا جَاءَ فِي الْوِتْرِ ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرٌو، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ، حَدَّثَهُ عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ صَلاَةُ اللَّيْلِ مَثْنَى مَثْنَى، فَإِذَا أَرَدْتَ أَنْ تَنْصَرِفَ فَارْكَعْ رَكْعَةً تُوتِرُ لَكَ مَا صَلَّيْتَ ‏\"‏‏.‏ قَالَ الْقَاسِمُ وَرَأَيْنَا أُنَاسًا مُنْذُ أَدْرَكْنَا يُوتِرُونَ بِثَلاَثٍ، وَإِنَّ كُلاًّ لَوَاسِعٌ أَرْجُو أَنْ لاَ يَكُونَ بِشَىْءٍ مِنْهُ بَأْسٌ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 4,
        "matchingEnglishURN": 9420,
        "last_updated": null
    },
    {
        "arabicURN": 108800,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "1.00",
        "hadithNumber": "994",
        "bookName": "كتاب الوتر ",
        "babName": "باب مَا جَاءَ فِي الْوِتْرِ ",
        "hadithText": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي إِحْدَى عَشْرَةَ رَكْعَةً، كَانَتْ تِلْكَ صَلاَتَهُ ـ تَعْنِي بِاللَّيْلِ ـ فَيَسْجُدُ السَّجْدَةَ مِنْ ذَلِكَ قَدْرَ مَا يَقْرَأُ أَحَدُكُمْ خَمْسِينَ آيَةً قَبْلَ أَنْ يَرْفَعَ رَأْسَهُ، وَيَرْكَعُ رَكْعَتَيْنِ قَبْلَ صَلاَةِ الْفَجْرِ، ثُمَّ يَضْطَجِعُ عَلَى شِقِّهِ الأَيْمَنِ حَتَّى يَأْتِيَهُ الْمُؤَذِّنُ لِلصَّلاَةِ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 5,
        "matchingEnglishURN": 9430,
        "last_updated": null
    },
    {
        "arabicURN": 108810,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "2.00",
        "hadithNumber": "995",
        "bookName": "كتاب الوتر ",
        "babName": "باب سَاعَاتِ الْوِتْرِ ",
        "hadithText": "حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، قَالَ حَدَّثَنَا أَنَسُ بْنُ سِيرِينَ، قَالَ قُلْتُ لاِبْنِ عُمَرَ أَرَأَيْتَ الرَّكْعَتَيْنِ قَبْلَ صَلاَةِ الْغَدَاةِ أُطِيلُ فِيهِمَا الْقِرَاءَةَ فَقَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي مِنَ اللَّيْلِ مَثْنَى مَثْنَى، وَيُوتِرُ بِرَكْعَةٍ وَيُصَلِّي الرَّكْعَتَيْنِ قَبْلَ صَلاَةِ الْغَدَاةِ وَكَأَنَّ الأَذَانَ بِأُذُنَيْهِ‏.‏ قَالَ حَمَّادٌ أَىْ سُرْعَةً‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 6,
        "matchingEnglishURN": 9440,
        "last_updated": null
    },
    {
        "arabicURN": 108820,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "2.00",
        "hadithNumber": "996",
        "bookName": "كتاب الوتر ",
        "babName": "باب سَاعَاتِ الْوِتْرِ ",
        "hadithText": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي مُسْلِمٌ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ كُلَّ اللَّيْلِ أَوْتَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَانْتَهَى وِتْرُهُ إِلَى السَّحَرِ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 7,
        "matchingEnglishURN": 9450,
        "last_updated": null
    },
    {
        "arabicURN": 108830,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "3.00",
        "hadithNumber": "997",
        "bookName": "كتاب الوتر ",
        "babName": "باب إِيقَاظِ النَّبِيِّ صلى الله عليه وسلم أَهْلَهُ بِالْوِتْرِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا هِشَامٌ، قَالَ حَدَّثَنِي أَبِي، عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي، وَأَنَا رَاقِدَةٌ مُعْتَرِضَةً عَلَى فِرَاشِهِ، فَإِذَا أَرَادَ أَنْ يُوتِرَ أَيْقَظَنِي فَأَوْتَرْتُ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 8,
        "matchingEnglishURN": 9460,
        "last_updated": null
    },
    {
        "arabicURN": 108840,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "4.00",
        "hadithNumber": "998",
        "bookName": "كتاب الوتر ",
        "babName": "باب لِيَجْعَلْ آخِرَ صَلاَتِهِ وِتْرًا ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، حَدَّثَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ اجْعَلُوا آخِرَ صَلاَتِكُمْ بِاللَّيْلِ وِتْرًا ‏\"‏‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 9,
        "matchingEnglishURN": 9470,
        "last_updated": null
    },
    {
        "arabicURN": 108850,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "5.00",
        "hadithNumber": "999",
        "bookName": "كتاب الوتر ",
        "babName": "باب الْوِتْرِ عَلَى الدَّابَّةِ ",
        "hadithText": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي بَكْرِ بْنِ عُمَرَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ، عَنْ سَعِيدِ بْنِ يَسَارٍ، أَنَّهُ قَالَ كُنْتُ أَسِيرُ مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ بِطَرِيقِ مَكَّةَ فَقَالَ سَعِيدٌ فَلَمَّا خَشِيتُ الصُّبْحَ نَزَلْتُ فَأَوْتَرْتُ، ثُمَّ لَحِقْتُهُ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ أَيْنَ كُنْتَ فَقُلْتُ خَشِيتُ الصُّبْحَ، فَنَزَلْتُ فَأَوْتَرْتُ‏.‏ فَقَالَ عَبْدُ اللَّهِ أَلَيْسَ لَكَ فِي رَسُولِ اللَّهِ صلى الله عليه وسلم أُسْوَةٌ حَسَنَةٌ فَقُلْتُ بَلَى وَاللَّهِ‏.‏ قَالَ فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُوتِرُ عَلَى الْبَعِيرِ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 10,
        "matchingEnglishURN": 9480,
        "last_updated": null
    },
    {
        "arabicURN": 108860,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "6.00",
        "hadithNumber": "1000",
        "bookName": "كتاب الوتر ",
        "babName": "باب الْوِتْرِ فِي السَّفَرِ ",
        "hadithText": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي فِي السَّفَرِ عَلَى رَاحِلَتِهِ، حَيْثُ تَوَجَّهَتْ بِهِ، يُومِئُ إِيمَاءً، صَلاَةَ اللَّيْلِ إِلاَّ الْفَرَائِضَ، وَيُوتِرُ عَلَى رَاحِلَتِهِ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 11,
        "matchingEnglishURN": 9490,
        "last_updated": null
    },
    {
        "arabicURN": 108870,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "7.00",
        "hadithNumber": "1001",
        "bookName": "كتاب الوتر ",
        "babName": "باب الْقُنُوتِ قَبْلَ الرُّكُوعِ وَبَعْدَهُ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، قَالَ سُئِلَ أَنَسٌ أَقَنَتَ النَّبِيُّ صلى الله عليه وسلم فِي الصُّبْحِ قَالَ نَعَمْ‏.‏ فَقِيلَ لَهُ أَوَقَنَتَ قَبْلَ الرُّكُوعِ قَالَ بَعْدَ الرُّكُوعِ يَسِيرًا‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 12,
        "matchingEnglishURN": 9500,
        "last_updated": null
    },
    {
        "arabicURN": 108880,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "7.00",
        "hadithNumber": "1002",
        "bookName": "كتاب الوتر ",
        "babName": "باب الْقُنُوتِ قَبْلَ الرُّكُوعِ وَبَعْدَهُ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ حَدَّثَنَا عَاصِمٌ، قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ عَنِ الْقُنُوتِ،‏.‏ فَقَالَ قَدْ كَانَ الْقُنُوتُ‏.‏ قُلْتُ قَبْلَ الرُّكُوعِ أَوْ بَعْدَهُ قَالَ قَبْلَهُ‏.‏ قَالَ فَإِنَّ فُلاَنًا أَخْبَرَنِي عَنْكَ أَنَّكَ قُلْتَ بَعْدَ الرُّكُوعِ‏.‏ فَقَالَ كَذَبَ، إِنَّمَا قَنَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَعْدَ الرُّكُوعِ شَهْرًا ـ أُرَاهُ ـ كَانَ بَعَثَ قَوْمًا يُقَالُ لَهُمُ الْقُرَّاءُ زُهَاءَ سَبْعِينَ رَجُلاً إِلَى قَوْمٍ مِنَ الْمُشْرِكِينَ دُونَ أُولَئِكَ، وَكَانَ بَيْنَهُمْ وَبَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَهْدٌ فَقَنَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم شَهْرًا يَدْعُو عَلَيْهِمْ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 13,
        "matchingEnglishURN": 9510,
        "last_updated": null
    },
    {
        "arabicURN": 108890,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "7.00",
        "hadithNumber": "1003",
        "bookName": "كتاب الوتر ",
        "babName": "باب الْقُنُوتِ قَبْلَ الرُّكُوعِ وَبَعْدَهُ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ يُونُسَ، قَالَ حَدَّثَنَا زَائِدَةُ، عَنِ التَّيْمِيِّ، عَنْ أَبِي مِجْلَزٍ، عَنْ أَنَسٍ، قَالَ قَنَتَ النَّبِيُّ صلى الله عليه وسلم شَهْرًا يَدْعُو عَلَى رِعْلٍ وَذَكْوَانَ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 14,
        "matchingEnglishURN": 9520,
        "last_updated": null
    },
    {
        "arabicURN": 108900,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "7.00",
        "hadithNumber": "1004",
        "bookName": "كتاب الوتر ",
        "babName": "باب الْقُنُوتِ قَبْلَ الرُّكُوعِ وَبَعْدَهُ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، قَالَ كَانَ الْقُنُوتُ فِي الْمَغْرِبِ وَالْفَجْرِ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 15,
        "matchingEnglishURN": 9530,
        "last_updated": null
    }
]