[
    {
        "arabicURN": 116780,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "1.00",
        "hadithNumber": "1773",
        "bookName": "كتاب العمرة ",
        "babName": "باب وُجُوبِ الْعُمْرَةِ وَفَضْلِهَا ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الْعُمْرَةُ إِلَى الْعُمْرَةِ كَفَّارَةٌ لِمَا بَيْنَهُمَا، وَالْحَجُّ الْمَبْرُورُ لَيْسَ لَهُ جَزَاءٌ إِلاَّ الْجَنَّةُ ‏\"‏‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 1,
        "matchingEnglishURN": 16630,
        "last_updated": null
    },
    {
        "arabicURN": 116791,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "2.00",
        "hadithNumber": "1774",
        "bookName": "كتاب العمرة ",
        "babName": null,
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَنَّ عِكْرِمَةَ بْنَ خَالِدٍ، سَأَلَ ابْنَ عُمَرَ ـ رضى الله عنهما ـ عَنِ الْعُمْرَةِ، قَبْلَ الْحَجِّ فَقَالَ لاَ بَأْسَ‏.‏ قَالَ عِكْرِمَةُ قَالَ ابْنُ عُمَرَ اعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم قَبْلَ أَنْ يَحُجَّ‏.‏ وَقَالَ إِبْرَاهِيمُ بْنُ سَعْدٍ عَنِ ابْنِ إِسْحَاقَ حَدَّثَنِي عِكْرِمَةُ بْنُ خَالِدٍ سَأَلْتُ ابْنَ عُمَرَ مِثْلَهُ‏.‏ <br><p>\nحَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا أَبُو عَاصِمٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ عِكْرِمَةُ بْنُ خَالِدٍ سَأَلْتُ ابْنَ عُمَرَ ـ رضى الله عنه ـ مِثْلَهُ‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 2,
        "matchingEnglishURN": 16641,
        "last_updated": null
    },
    {
        "arabicURN": 116811,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "3.00",
        "hadithNumber": "1775, 1776",
        "bookName": "كتاب العمرة ",
        "babName": "باب كَمِ اعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، قَالَ دَخَلْتُ أَنَا وَعُرْوَةُ بْنُ الزُّبَيْرِ الْمَسْجِدَ،، فَإِذَا عَبْدُ اللَّهِ بْنُ عُمَرَ ـ رضى الله عنهما ـ جَالِسٌ إِلَى حُجْرَةِ عَائِشَةَ، وَإِذَا نَاسٌ يُصَلُّونَ فِي الْمَسْجِدِ صَلاَةَ الضُّحَى‏.‏ قَالَ فَسَأَلْنَاهُ عَنْ صَلاَتِهِمْ‏.‏ فَقَالَ بِدْعَةٌ‏.‏ ثُمَّ قَالَ لَهُ كَمِ اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ أَرْبَعً إِحْدَاهُنَّ فِي رَجَبٍ، فَكَرِهْنَا أَنْ نَرُدَّ عَلَيْهِ‏.‏ قَالَ وَسَمِعْنَا اسْتِنَانَ، عَائِشَةَ أُمِّ الْمُؤْمِنِينَ فِي الْحُجْرَةِ، فَقَالَ عُرْوَةُ يَا أُمَّاهُ، يَا أُمَّ الْمُؤْمِنِينَ‏.‏ أَلاَ تَسْمَعِينَ مَا يَقُولُ أَبُو عَبْدِ الرَّحْمَنِ‏.‏ قَالَتْ مَا يَقُولُ قَالَ يَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اعْتَمَرَ أَرْبَعَ عُمَرَاتٍ إِحْدَاهُنَّ فِي رَجَبٍ‏.‏ قَالَتْ يَرْحَمُ اللَّهُ أَبَا عَبْدِ الرَّحْمَنِ، مَا اعْتَمَرَ عُمْرَةً إِلاَّ وَهُوَ شَاهِدُهُ، وَمَا اعْتَمَرَ فِي رَجَبٍ قَطُّ‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 3,
        "matchingEnglishURN": 16660,
        "last_updated": null
    },
    {
        "arabicURN": 116830,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "3.00",
        "hadithNumber": "1777",
        "bookName": "كتاب العمرة ",
        "babName": "باب كَمِ اعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم ",
        "hadithText": "حَدَّثَنَا أَبُو عَاصِمٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، قَالَ سَأَلْتُ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي رَجَبٍ‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 4,
        "matchingEnglishURN": 16670,
        "last_updated": null
    },
    {
        "arabicURN": 116840,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "3.00",
        "hadithNumber": "1778",
        "bookName": "كتاب العمرة ",
        "babName": "باب كَمِ اعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم ",
        "hadithText": "حَدَّثَنَا حَسَّانُ بْنُ حَسَّانٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، سَأَلْتُ أَنَسًا ـ رضى الله عنه ـ كَمِ اعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم قَالَ أَرْبَعٌ عُمْرَةُ الْحُدَيْبِيَةِ فِي ذِي الْقَعْدَةِ، حَيْثُ صَدَّهُ الْمُشْرِكُونَ، وَعُمْرَةٌ مِنَ الْعَامِ الْمُقْبِلِ فِي ذِي الْقَعْدَةِ، حَيْثُ صَالَحَهُمْ، وَعُمْرَةُ الْجِعْرَانَةِ إِذْ قَسَمَ غَنِيمَةَ أُرَاهُ حُنَيْنٍ‏.‏ قُلْتُ كَمْ حَجَّ قَالَ وَاحِدَةً‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 5,
        "matchingEnglishURN": 16680,
        "last_updated": null
    },
    {
        "arabicURN": 116850,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "3.00",
        "hadithNumber": "1779",
        "bookName": "كتاب العمرة ",
        "babName": "باب كَمِ اعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم ",
        "hadithText": "حَدَّثَنَا أَبُو الْوَلِيدِ، هِشَامُ بْنُ عَبْدِ الْمَلِكِ حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، قَالَ سَأَلْتُ أَنَسًا ـ رضى الله عنه ـ فَقَالَ اعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم حَيْثُ رَدُّوهُ، وَمِنَ الْقَابِلِ عُمْرَةَ الْحُدَيْبِيَةِ، وَعُمْرَةً فِي ذِي الْقَعْدَةِ وَعُمْرَةً مَعَ حَجَّتِهِ‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 6,
        "matchingEnglishURN": 16690,
        "last_updated": null
    },
    {
        "arabicURN": 116860,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "3.00",
        "hadithNumber": "1780",
        "bookName": "كتاب العمرة ",
        "babName": "باب كَمِ اعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم ",
        "hadithText": "حَدَّثَنَا هُدْبَةُ، حَدَّثَنَا هَمَّامٌ، وَقَالَ، اعْتَمَرَ أَرْبَعَ عُمَرٍ فِي ذِي الْقَعْدَةِ إِلاَّ الَّتِي اعْتَمَرَ مَعَ حَجَّتِهِ عُمْرَتَهُ مِنَ الْحُدَيْبِيَةِ، وَمِنَ الْعَامِ الْمُقْبِلِ، وَمِنَ الْجِعْرَانَةِ، حَيْثُ قَسَمَ غَنَائِمَ حُنَيْنٍ، وَعُمْرَةً مَعَ حَجَّتِهِ‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 7,
        "matchingEnglishURN": 16700,
        "last_updated": null
    },
    {
        "arabicURN": 116870,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "3.00",
        "hadithNumber": "1781",
        "bookName": "كتاب العمرة ",
        "babName": "باب كَمِ اعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ، حَدَّثَنَا شُرَيْحُ بْنُ مَسْلَمَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ يُوسُفَ، عَنْ أَبِيهِ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَأَلْتُ مَسْرُوقًا وَعَطَاءً وَمُجَاهِدًا‏.‏ فَقَالُوا اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ذِي الْقَعْدَةِ قَبْلَ أَنْ يَحُجَّ‏.‏ وَقَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ ـ رضى الله عنهما ـ يَقُولُ اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ذِي الْقَعْدَةِ، قَبْلَ أَنْ يَحُجَّ مَرَّتَيْنِ‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 8,
        "matchingEnglishURN": 16710,
        "last_updated": null
    },
    {
        "arabicURN": 116880,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "4.00",
        "hadithNumber": "1782",
        "bookName": "كتاب العمرة ",
        "babName": "باب عُمْرَةٍ فِي رَمَضَانَ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يُخْبِرُنَا يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لاِمْرَأَةٍ مِنَ الأَنْصَارِ سَمَّاهَا ابْنُ عَبَّاسٍ، فَنَسِيتُ اسْمَهَا ‏\"‏ مَا مَنَعَكِ أَنْ تَحُجِّي مَعَنَا ‏\"‏‏.‏ قَالَتْ كَانَ لَنَا نَاضِحٌ فَرَكِبَهُ أَبُو فُلاَنٍ وَابْنُهُ ـ لِزَوْجِهَا وَابْنِهَا ـ وَتَرَكَ نَاضِحًا نَنْضَحُ عَلَيْهِ قَالَ ‏\"‏ فَإِذَا كَانَ رَمَضَانُ اعْتَمِرِي فِيهِ فَإِنَّ عُمْرَةً فِي رَمَضَانَ حَجَّةٌ ‏\"‏‏.‏ أَوْ نَحْوًا مِمَّا قَالَ‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 9,
        "matchingEnglishURN": 16720,
        "last_updated": null
    },
    {
        "arabicURN": 116890,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "5.00",
        "hadithNumber": "1783",
        "bookName": "كتاب العمرة ",
        "babName": "باب الْعُمْرَةِ لَيْلَةَ الْحَصْبَةِ وَغَيْرِهَا ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مُوَافِينَ لِهِلاَلِ ذِي الْحَجَّةِ فَقَالَ لَنَا ‏\"‏ مَنْ أَحَبَّ مِنْكُمْ أَنْ يُهِلَّ بِالْحَجِّ فَلْيُهِلَّ وَمَنْ أَحَبَّ أَنْ يُهِلَّ بِعُمْرَةٍ فَلْيُهِلَّ بِعُمْرَةٍ، فَلَوْلاَ أَنِّي أَهْدَيْتُ لأَهْلَلْتُ بِعُمْرَةٍ ‏\"‏‏.‏ قَالَتْ فَمِنَّا مَنْ أَهَلَّ بِعُمْرَةٍ، وَمِنَّا مَنْ أَهَلَّ بِحَجٍّ، وَكُنْتُ مِمَّنْ أَهَلَّ بِعُمْرَةٍ، فَأَظَلَّنِي يَوْمُ عَرَفَةَ، وَأَنَا حَائِضٌ، فَشَكَوْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ ارْفُضِي عُمْرَتَكِ، وَانْقُضِي رَأْسَكِ وَامْتَشِطِي، وَأَهِلِّي بِالْحَجِّ ‏\"‏‏.‏ فَلَمَّا كَانَ لَيْلَةُ الْحَصْبَةِ أَرْسَلَ مَعِي عَبْدَ الرَّحْمَنِ إِلَى التَّنْعِيمِ، فَأَهْلَلْتُ بِعُمْرَةٍ مَكَانَ عُمْرَتِي‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 10,
        "matchingEnglishURN": 16730,
        "last_updated": null
    },
    {
        "arabicURN": 116900,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "6.00",
        "hadithNumber": "1784",
        "bookName": "كتاب العمرة ",
        "babName": "باب عُمْرَةِ التَّنْعِيمِ ",
        "hadithText": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، سَمِعَ عَمْرَو بْنَ أَوْسٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَهُ أَنْ يُرْدِفَ عَائِشَةَ، وَيُعْمِرَهَا مِنَ التَّنْعِيمِ‏.‏ قَالَ سُفْيَانُ مَرَّةً سَمِعْتُ عَمْرًا، كَمْ سَمِعْتُهُ مِنْ عَمْرٍو‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 11,
        "matchingEnglishURN": 16740,
        "last_updated": null
    },
    {
        "arabicURN": 116910,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "6.00",
        "hadithNumber": "1785",
        "bookName": "كتاب العمرة ",
        "babName": "باب عُمْرَةِ التَّنْعِيمِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْمَجِيدِ، عَنْ حَبِيبٍ الْمُعَلِّمِ، عَنْ عَطَاءٍ، حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَهَلَّ وَأَصْحَابُهُ بِالْحَجِّ وَلَيْسَ مَعَ أَحَدٍ مِنْهُمْ هَدْىٌ، غَيْرَ النَّبِيِّ صلى الله عليه وسلم وَطَلْحَةَ، وَكَانَ عَلِيٌّ قَدِمَ مِنَ الْيَمَنِ، وَمَعَهُ الْهَدْىُ فَقَالَ أَهْلَلْتُ بِمَا أَهَلَّ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ وَإِنَّ النَّبِيَّ صلى الله عليه وسلم أَذِنَ لأَصْحَابِهِ أَنْ يَجْعَلُوهَا عُمْرَةً، يَطُوفُوا بِالْبَيْتِ، ثُمَّ يُقَصِّرُوا وَيَحِلُّوا، إِلاَّ مَنْ مَعَهُ الْهَدْىُ، فَقَالُوا نَنْطَلِقُ إِلَى مِنًى وَذَكَرُ أَحَدِنَا يَقْطُرُ فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ لَوِ اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ مَا أَهْدَيْتُ، وَلَوْلاَ أَنَّ مَعِي الْهَدْىَ لأَحْلَلْتُ ‏\"‏‏.‏ وَأَنَّ عَائِشَةَ حَاضَتْ فَنَسَكَتِ الْمَنَاسِكَ كُلَّهَا، غَيْرَ أَنَّهَا لَمْ تَطُفْ بِالْبَيْتِ قَالَ فَلَمَّا طَهُرَتْ وَطَافَتْ، قَالَتْ يَا رَسُولَ اللَّهِ أَتَنْطَلِقُونَ بِعُمْرَةٍ وَحَجَّةٍ، وَأَنْطَلِقُ بِالْحَجِّ فَأَمَرَ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ أَنْ يَخْرُجَ مَعَهَا إِلَى التَّنْعِيمِ، فَاعْتَمَرَتْ بَعْدَ الْحَجِّ فِي ذِي الْحَجَّةِ، وَأَنَّ سُرَاقَةَ بْنَ مَالِكِ بْنِ جُعْشُمٍ لَقِيَ النَّبِيَّ صلى الله عليه وسلم وَهُوَ بِالْعَقَبَةِ، وَهُوَ يَرْمِيهَا، فَقَالَ أَلَكُمْ هَذِهِ خَاصَّةً، يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ لاَ، بَلْ لِلأَبَدِ ‏\"‏‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 12,
        "matchingEnglishURN": 16750,
        "last_updated": null
    },
    {
        "arabicURN": 116920,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "7.00",
        "hadithNumber": "1786",
        "bookName": "كتاب العمرة ",
        "babName": "باب الاِعْتِمَارِ بَعْدَ الْحَجِّ بِغَيْرِ هَدْىٍ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، حَدَّثَنَا هِشَامٌ، قَالَ أَخْبَرَنِي أَبِي قَالَ، أَخْبَرَتْنِي عَائِشَةُ ـ رضى الله عنها ـ قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مُوَافِينَ لِهِلاَلِ ذِي الْحَجَّةِ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَحَبَّ أَنْ يُهِلَّ بِعُمْرَةٍ فَلْيُهِلَّ، وَمَنْ أَحَبَّ أَنْ يُهِلَّ بِحَجَّةِ فَلْيُهِلَّ، وَلَوْلاَ أَنِّي أَهْدَيْتُ لأَهْلَلْتُ بِعُمْرَةٍ ‏\"‏‏.‏ فَمِنْهُمْ مَنْ أَهَلَّ بِعُمْرَةٍ، وَمِنْهُمْ مِنْ أَهَلَّ بِحَجَّةٍ، وَكُنْتُ مِمَّنْ أَهَلَّ بِعُمْرَةٍ، فَحِضْتُ قَبْلَ أَنْ أَدْخُلَ مَكَّةَ، فَأَدْرَكَنِي يَوْمُ عَرَفَةَ، وَأَنَا حَائِضٌ، فَشَكَوْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ دَعِي عُمْرَتَكِ، وَانْقُضِي رَأْسَكِ وَامْتَشِطِي، وَأَهِلِّي بِالْحَجِّ ‏\"‏‏.‏ فَفَعَلْتُ، فَلَمَّا كَانَتْ لَيْلَةُ الْحَصْبَةِ أَرْسَلَ مَعِي عَبْدَ الرَّحْمَنِ إِلَى التَّنْعِيمِ، فَأَرْدَفَهَا، فَأَهَلَّتْ بِعُمْرَةٍ مَكَانَ عُمْرَتِهَا، فَقَضَى اللَّهُ حَجَّهَا وَعُمْرَتَهَا، وَلَمْ يَكُنْ فِي شَىْءٍ مِنْ ذَلِكَ هَدْىٌ، وَلاَ صَدَقَةٌ، وَلاَ صَوْمٌ‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 13,
        "matchingEnglishURN": 16760,
        "last_updated": null
    },
    {
        "arabicURN": 116930,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "8.00",
        "hadithNumber": "1787",
        "bookName": "كتاب العمرة ",
        "babName": "باب أَجْرِ الْعُمْرَةِ عَلَى قَدْرِ النَّصَبِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، وَعَنِ ابْنِ عَوْنٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، قَالاَ قَالَتْ عَائِشَةُ ـ رضى الله عنها ـ يَا رَسُولَ اللَّهِ يَصْدُرُ النَّاسُ بِنُسُكَيْنِ وَأَصْدُرُ بِنُسُكٍ فَقِيلَ لَهَا ‏\"‏ انْتَظِرِي، فَإِذَا طَهُرْتِ فَاخْرُجِي إِلَى التَّنْعِيمِ، فَأَهِلِّي ثُمَّ ائْتِينَا بِمَكَانِ كَذَا، وَلَكِنَّهَا عَلَى قَدْرِ نَفَقَتِكِ، أَوْ نَصَبِكِ ‏\"‏‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 14,
        "matchingEnglishURN": 16770,
        "last_updated": null
    },
    {
        "arabicURN": 116940,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "9.00",
        "hadithNumber": "1788",
        "bookName": "كتاب العمرة ",
        "babName": "باب الْمُعْتَمِرِ إِذَا طَافَ طَوَافَ الْعُمْرَةِ، ثُمَّ خَرَجَ، هَلْ يُجْزِئُهُ مِنْ طَوَافِ الْوَدَاعِ ",
        "hadithText": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا أَفْلَحُ بْنُ حُمَيْدٍ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ خَرَجْنَا مُهِلِّينَ بِالْحَجِّ فِي أَشْهُرِ الْحَجِّ، وَحُرُمِ الْحَجِّ، فَنَزَلْنَا سَرِفَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم لأَصْحَابِهِ ‏\"‏ مَنْ لَمْ يَكُنْ مَعَهُ هَدْىٌ، فَأَحَبَّ أَنْ يَجْعَلَهَا عُمْرَةً، فَلْيَفْعَلْ وَمَنْ كَانَ مَعَهُ هَدْىٌ فَلاَ ‏\"‏‏.‏ وَكَانَ مَعَ النَّبِيِّ صلى الله عليه وسلم وَرِجَالٍ مِنْ أَصْحَابِهِ ذَوِي قُوَّةٍ الْهَدْىُ، فَلَمْ تَكُنْ لَهُمْ عُمْرَةً، فَدَخَلَ عَلَىَّ النَّبِيُّ صلى الله عليه وسلم وَأَنَا أَبْكِي فَقَالَ ‏\"‏ مَا يُبْكِيكِ ‏\"‏‏.‏ قُلْتُ سَمِعْتُكَ تَقُولُ لأَصْحَابِكَ مَا قُلْتَ فَمُنِعْتُ الْعُمْرَةَ‏.‏ قَالَ ‏\"‏ وَمَا شَأْنُكِ ‏\"‏‏.‏ قُلْتُ لاَ أُصَلِّي‏.‏ قَالَ ‏\"‏ فَلاَ يَضُرَّكِ أَنْتِ مِنْ بَنَاتِ آدَمَ، كُتِبَ عَلَيْكِ مَا كُتِبَ عَلَيْهِنَّ، فَكُونِي فِي حَجَّتِكِ عَسَى اللَّهُ أَنْ يَرْزُقَكِهَا ‏\"‏‏.‏ قَالَتْ فَكُنْتُ حَتَّى نَفَرْنَا مِنْ مِنًى، فَنَزَلْنَا الْمُحَصَّبَ فَدَعَا عَبْدَ الرَّحْمَنِ، فَقَالَ ‏\"‏ اخْرُجْ بِأُخْتِكَ الْحَرَمَ، فَلْتُهِلَّ بِعُمْرَةٍ، ثُمَّ افْرُغَا مِنْ طَوَافِكُمَا، أَنْتَظِرْكُمَا هَا هُنَا ‏\"‏‏.‏ فَأَتَيْنَا فِي جَوْفِ اللَّيْلِ‏.‏ فَقَالَ ‏\"‏ فَرَغْتُمَا ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ فَنَادَى بِالرَّحِيلِ فِي أَصْحَابِهِ، فَارْتَحَلَ النَّاسُ، وَمَنْ طَافَ بِالْبَيْتِ، قَبْلَ صَلاَةِ الصُّبْحِ، ثُمَّ خَرَجَ مُوَجِّهًا إِلَى الْمَدِينَةِ‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 15,
        "matchingEnglishURN": 16780,
        "last_updated": null
    },
    {
        "arabicURN": 116950,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "10.00",
        "hadithNumber": "1789",
        "bookName": "كتاب العمرة ",
        "babName": "باب يَفْعَلُ فِي الْعُمْرَةِ مَا يَفْعَلُ فِي الْحَجِّ ",
        "hadithText": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا عَطَاءٌ، قَالَ حَدَّثَنِي صَفْوَانُ بْنُ يَعْلَى بْنِ أُمَيَّةَ يَعْنِي، عَنْ أَبِيهِ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم وَهُوَ بِالْجِعْرَانَةِ وَعَلَيْهِ جُبَّةٌ وَعَلَيْهِ أَثَرُ الْخَلُوقِ أَوْ قَالَ صُفْرَةٍ فَقَالَ كَيْفَ تَأْمُرُنِي أَنْ أَصْنَعَ فِي عُمْرَتِي فَأَنْزَلَ اللَّهُ عَلَى النَّبِيِّ صلى الله عليه وسلم، فَسُتِرَ بِثَوْبٍ وَوَدِدْتُ أَنِّي قَدْ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَقَدْ أُنْزِلَ عَلَيْهِ الْوَحْىُ‏.‏ فَقَالَ عُمَرُ تَعَالَ أَيَسُرُّكَ أَنْ تَنْظُرَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَقَدْ أَنْزَلَ اللَّهُ الْوَحْىَ قُلْتُ نَعَمْ‏.‏ فَرَفَعَ طَرَفَ الثَّوْبِ، فَنَظَرْتُ إِلَيْهِ لَهُ غَطِيطٌ وَأَحْسِبُهُ قَالَ كَغَطِيطِ الْبَكْرِ‏.‏ فَلَمَّا سُرِّيَ عَنْهُ قَالَ ‏\"‏ أَيْنَ السَّائِلُ عَنِ الْعُمْرَةِ اخْلَعْ عَنْكَ الْجُبَّةَ وَاغْسِلْ أَثَرَ الْخَلُوقِ عَنْكَ، وَأَنْقِ الصُّفْرَةَ، وَاصْنَعْ فِي عُمْرَتِكَ كَمَا تَصْنَعُ فِي حَجِّكِ ‏\"‏‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 16,
        "matchingEnglishURN": 16790,
        "last_updated": null
    },
    {
        "arabicURN": 116960,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "10.00",
        "hadithNumber": "1790",
        "bookName": "كتاب العمرة ",
        "babName": "باب يَفْعَلُ فِي الْعُمْرَةِ مَا يَفْعَلُ فِي الْحَجِّ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ قُلْتُ لِعَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم وَأَنَا يَوْمَئِذٍ حَدِيثُ السِّنِّ أَرَأَيْتِ قَوْلَ اللَّهِ تَبَارَكَ وَتَعَالَى ‏<A id=\"q2\" name=\"q2\" href=\"javascript:openquran(1,158,158)\"><c_q2>{‏إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا‏}</c_q2></a>‏ فَلاَ أُرَى عَلَى أَحَدٍ شَيْئًا أَنْ لاَ يَطَّوَّفَ بِهِمَا‏.‏ فَقَالَتْ عَائِشَةُ كَلاَّ، لَوْ كَانَتْ كَمَا تَقُولُ كَانَتْ فَلاَ جُنَاحَ عَلَيْهِ أَنْ لاَ يَطَّوَّفَ بِهِمَا‏.‏ إِنَّمَا أُنْزِلَتْ هَذِهِ الآيَةُ فِي الأَنْصَارِ كَانُوا يُهِلُّونَ لِمَنَاةَ، وَكَانَتْ مَنَاةُ حَذْوَ قُدَيْدٍ، وَكَانُوا يَتَحَرَّجُونَ أَنْ يَطُوفُوا بَيْنَ الصَّفَا وَالْمَرْوَةِ، فَلَمَّا جَاءَ الإِسْلاَمُ سَأَلُوا رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ، فَأَنْزَلَ اللَّهُ تَعَالَى ‏<A id=\"q3\" name=\"q3\" href=\"javascript:openquran(1,158,158)\"><c_q3>{‏إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا‏}</c_q3></a>‏‏.‏ زَادَ سُفْيَانُ وَأَبُو مُعَاوِيَةَ عَنْ هِشَامٍ مَا أَتَمَّ اللَّهُ حَجَّ امْرِئٍ وَلاَ عُمْرَتَهُ لَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 17,
        "matchingEnglishURN": 16800,
        "last_updated": null
    },
    {
        "arabicURN": 116971,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "11.00",
        "hadithNumber": "1791, 1792",
        "bookName": "كتاب العمرة ",
        "babName": "باب مَتَى يَحِلُّ الْمُعْتَمِرُ ",
        "hadithText": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، عَنْ جَرِيرٍ، عَنْ إِسْمَاعِيلَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى، قَالَ اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَاعْتَمَرْنَا مَعَهُ فَلَمَّا دَخَلَ مَكَّةَ طَافَ وَطُفْنَا مَعَهُ، وَأَتَى الصَّفَا وَالْمَرْوَةَ وَأَتَيْنَاهَا مَعَهُ، وَكُنَّا نَسْتُرُهُ مِنْ أَهْلِ مَكَّةَ أَنْ يَرْمِيَهُ أَحَدٌ‏.‏ فَقَالَ لَهُ صَاحِبٌ لِي أَكَانَ دَخَلَ الْكَعْبَةَ قَالَ لاَ‏.‏ قَالَ فَحَدِّثْنَا مَا، قَالَ لِخَدِيجَةَ‏.‏ قَالَ ‏\"‏ بَشِّرُوا خَدِيجَةَ بِبَيْتٍ فِي الْجَنَّةِ مِنْ قَصَبٍ لاَ صَخَبَ فِيهِ وَلاَ نَصَبَ ‏\"‏‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 18,
        "matchingEnglishURN": 16810,
        "last_updated": null
    },
    {
        "arabicURN": 116991,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "11.00",
        "hadithNumber": "1793, 1794",
        "bookName": "كتاب العمرة ",
        "babName": "باب مَتَى يَحِلُّ الْمُعْتَمِرُ ",
        "hadithText": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، قَالَ سَأَلْنَا ابْنَ عُمَرَ ـ رضى الله عنهما ـ عَنْ رَجُلٍ، طَافَ بِالْبَيْتِ فِي عُمْرَةٍ، وَلَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ، أَيَأْتِي امْرَأَتَهُ فَقَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم فَطَافَ بِالْبَيْتِ سَبْعًا، وَصَلَّى خَلْفَ الْمَقَامِ رَكْعَتَيْنِ، وَطَافَ بَيْنَ الصَّفَا وَالْمَرْوَةِ سَبْعًا، وَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ‏.‏ قَالَ وَسَأَلْنَا جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ فَقَالَ لاَ يَقْرَبَنَّهَا حَتَّى يَطُوفَ بَيْنَ الصَّفَا وَالْمَرْوَةِ‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 19,
        "matchingEnglishURN": 16820,
        "last_updated": null
    },
    {
        "arabicURN": 117010,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "11.00",
        "hadithNumber": "1795",
        "bookName": "كتاب العمرة ",
        "babName": "باب مَتَى يَحِلُّ الْمُعْتَمِرُ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ ـ رضى الله عنه ـ قَالَ قَدِمْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم بِالْبَطْحَاءِ وَهُوَ مُنِيخٌ فَقَالَ ‏\"‏ أَحَجَجْتَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ بِمَا أَهْلَلْتَ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ بِإِهْلاَلٍ كَإِهْلاَلِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ أَحْسَنْتَ‏.‏ طُفْ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ ثُمَّ أَحِلَّ ‏\"‏‏.‏ فَطُفْتُ بِالْبَيْتِ، وَبِالصَّفَا وَالْمَرْوَةِ، ثُمَّ أَتَيْتُ امْرَأَةً مِنْ قَيْسٍ، فَفَلَتْ رَأْسِي، ثُمَّ أَهْلَلْتُ بِالْحَجِّ‏.‏ فَكُنْتُ أُفْتِي بِهِ، حَتَّى كَانَ فِي خِلاَفَةِ عُمَرَ فَقَالَ إِنْ أَخَذْنَا بِكِتَابِ اللَّهِ فَإِنَّهُ يَأْمُرُنَا بِالتَّمَامِ، وَإِنْ أَخَذْنَا بِقَوْلِ النَّبِيِّ صلى الله عليه وسلم فَإِنَّهُ لَمْ يَحِلَّ حَتَّى يَبْلُغَ الْهَدْىُ مَحِلَّهُ‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 20,
        "matchingEnglishURN": 16830,
        "last_updated": null
    },
    {
        "arabicURN": 117020,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "11.00",
        "hadithNumber": "1796",
        "bookName": "كتاب العمرة ",
        "babName": "باب مَتَى يَحِلُّ الْمُعْتَمِرُ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنَا عَمْرٌو، عَنْ أَبِي الأَسْوَدِ، أَنَّ عَبْدَ اللَّهِ، مَوْلَى أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ حَدَّثَهُ أَنَّهُ، كَانَ يَسْمَعُ أَسْمَاءَ تَقُولُ كُلَّمَا مَرَّتْ بِالْحَجُونِ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ لَقَدْ نَزَلْنَا مَعَهُ هَا هُنَا، وَنَحْنُ يَوْمَئِذٍ خِفَافٌ، قَلِيلٌ ظَهْرُنَا، قَلِيلَةٌ أَزْوَادُنَا، فَاعْتَمَرْتُ أَنَا وَأُخْتِي عَائِشَةُ وَالزُّبَيْرُ وَفُلاَنٌ وَفُلاَنٌ، فَلَمَّا مَسَحْنَا الْبَيْتَ أَحْلَلْنَا، ثُمَّ أَهْلَلْنَا مِنَ الْعَشِيِّ بِالْحَجِّ‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 21,
        "matchingEnglishURN": 16840,
        "last_updated": null
    },
    {
        "arabicURN": 117030,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "12.00",
        "hadithNumber": "1797",
        "bookName": "كتاب العمرة ",
        "babName": "باب مَا يَقُولُ إِذَا رَجَعَ مِنَ الْحَجِّ أَوِ الْعُمْرَةِ أَوِ الْغَزْوِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا قَفَلَ مِنْ غَزْوٍ أَوْ حَجٍّ أَوْ عُمْرَةٍ يُكَبِّرُ عَلَى كُلِّ شَرَفٍ مِنَ الأَرْضِ ثَلاَثَ تَكْبِيرَاتٍ، ثُمَّ يَقُولُ ‏\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ، آيِبُونَ تَائِبُونَ عَابِدُونَ سَاجِدُونَ لِرَبِّنَا حَامِدُونَ، صَدَقَ اللَّهُ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الأَحْزَابَ وَحْدَهُ ‏\"‏‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 22,
        "matchingEnglishURN": 16850,
        "last_updated": null
    },
    {
        "arabicURN": 117040,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "13.00",
        "hadithNumber": "1798",
        "bookName": "كتاب العمرة ",
        "babName": "باب اسْتِقْبَالِ الْحَاجِّ الْقَادِمِينَ وَالثَّلاَثَةِ عَلَى الدَّابَّةِ ",
        "hadithText": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا قَدِمَ النَّبِيُّ صلى الله عليه وسلم مَكَّةَ اسْتَقْبَلَتْهُ أُغَيْلِمَةُ بَنِي عَبْدِ الْمُطَّلِبِ، فَحَمَلَ وَاحِدًا بَيْنَ يَدَيْهِ وَآخَرَ خَلْفَهُ‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 23,
        "matchingEnglishURN": 16860,
        "last_updated": null
    },
    {
        "arabicURN": 117050,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "14.00",
        "hadithNumber": "1799",
        "bookName": "كتاب العمرة ",
        "babName": "باب الْقُدُومِ بِالْغَدَاةِ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ الْحَجَّاجِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا خَرَجَ إِلَى مَكَّةَ يُصَلِّي فِي مَسْجِدِ الشَّجَرَةِ، وَإِذَا رَجَعَ صَلَّى بِذِي الْحُلَيْفَةِ بِبَطْنِ الْوَادِي وَبَاتَ حَتَّى يُصْبِحَ‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 24,
        "matchingEnglishURN": 16870,
        "last_updated": null
    },
    {
        "arabicURN": 117060,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "15.00",
        "hadithNumber": "1800",
        "bookName": "كتاب العمرة ",
        "babName": "باب الدُّخُولِ بِالْعَشِيِّ ",
        "hadithText": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا هَمَّامٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم لاَ يَطْرُقُ أَهْلَهُ، كَانَ لاَ يَدْخُلُ إِلاَّ غُدْوَةً أَوْ عَشِيَّةً‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 25,
        "matchingEnglishURN": 16880,
        "last_updated": null
    },
    {
        "arabicURN": 117070,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "16.00",
        "hadithNumber": "1801",
        "bookName": "كتاب العمرة ",
        "babName": "باب لاَ يَطْرُقُ أَهْلَهُ إِذَا بَلَغَ الْمَدِينَةَ ",
        "hadithText": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَارِبٍ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يَطْرُقَ أَهْلَهُ لَيْلاً‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 26,
        "matchingEnglishURN": 16890,
        "last_updated": null
    },
    {
        "arabicURN": 117081,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "17.00",
        "hadithNumber": "1802",
        "bookName": "كتاب العمرة ",
        "babName": null,
        "hadithText": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنِي حُمَيْدٌ، أَنَّهُ سَمِعَ أَنَسًا ـ رضى الله عنه ـ يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا قَدِمَ مِنْ سَفَرٍ، فَأَبْصَرَ دَرَجَاتِ الْمَدِينَةِ أَوْضَعَ نَاقَتَهُ، وَإِنْ كَانَتْ دَابَّةً حَرَّكَهَا‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ زَادَ الْحَارِثُ بْنُ عُمَيْرٍ عَنْ حُمَيْدٍ حَرَّكَهَا مِنْ حُبِّهَا‏.‏ <br><p>\nحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ جُدُرَاتٍ‏.‏ تَابَعَهُ الْحَارِثُ بْنُ عُمَيْرٍ‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 27,
        "matchingEnglishURN": 16901,
        "last_updated": null
    },
    {
        "arabicURN": 117100,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "18.00",
        "hadithNumber": "1803",
        "bookName": "كتاب العمرة ",
        "babName": "باب قَوْلِ اللَّهِ تَعَالَى ‏<A id=\"q4\" name=\"q4\" href=\"javascript:openquran(1,189,189)\"><c_q4>{‏وَأْتُوا الْبُيُوتَ مِنْ أَبْوَابِهَا‏}",
        "hadithText": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ ـ رضى الله عنه ـ يَقُولُ نَزَلَتْ هَذِهِ الآيَةُ فِينَا، كَانَتِ الأَنْصَارُ إِذَا حَجُّوا فَجَاءُوا لَمْ يَدْخُلُوا مِنْ قِبَلِ أَبْوَابِ بُيُوتِهِمْ، وَلَكِنْ مِنْ ظُهُورِهَا، فَجَاءَ رَجُلٌ مِنَ الأَنْصَارِ، فَدَخَلَ مِنْ قِبَلِ بَابِهِ، فَكَأَنَّهُ عُيِّرَ بِذَلِكَ، فَنَزَلَتْ ‏<A id=\"q5\" name=\"q5\" href=\"javascript:openquran(1,189,189)\"><c_q5>{‏وَلَيْسَ الْبِرُّ بِأَنْ تَأْتُوا الْبُيُوتَ مِنْ ظُهُورِهَا وَلَكِنَّ الْبِرَّ مَنِ اتَّقَى وَأْتُوا الْبُيُوتَ مِنْ أَبْوَابِهَا‏}</c_q5></a>‏‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 28,
        "matchingEnglishURN": 16920,
        "last_updated": null
    },
    {
        "arabicURN": 117110,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "19.00",
        "hadithNumber": "1804",
        "bookName": "كتاب العمرة ",
        "babName": "باب السَّفَرُ قِطْعَةٌ مِنَ الْعَذَابِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا مَالِكٌ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ السَّفَرُ قِطْعَةٌ مِنَ الْعَذَابِ، يَمْنَعُ أَحَدَكُمْ طَعَامَهُ وَشَرَابَهُ وَنَوْمَهُ، فَإِذَا قَضَى نَهْمَتَهُ فَلْيُعَجِّلْ إِلَى أَهْلِهِ ‏\"‏‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 29,
        "matchingEnglishURN": 16930,
        "last_updated": null
    },
    {
        "arabicURN": 117120,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 26,
        "babNumber": "20.00",
        "hadithNumber": "1805",
        "bookName": "كتاب العمرة ",
        "babName": "باب الْمُسَافِرِ إِذَا جَدَّ بِهِ السَّيْرُ يُعَجِّلُ إِلَى أَهْلِهِ ",
        "hadithText": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنِي زَيْدُ بْنُ أَسْلَمَ، عَنْ أَبِيهِ، قَالَ كُنْتُ مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ بِطَرِيقِ مَكَّةَ، فَبَلَغَهُ عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ شِدَّةُ وَجَعٍ فَأَسْرَعَ السَّيْرَ، حَتَّى كَانَ بَعْدَ غُرُوبِ الشَّفَقِ نَزَلَ، فَصَلَّى الْمَغْرِبَ وَالْعَتَمَةَ، جَمَعَ بَيْنَهُمَا، ثُمَّ قَالَ إِنِّي رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم إِذَا جَدَّ بِهِ السَّيْرُ أَخَّرَ الْمَغْرِبَ، وَجَمَعَ بَيْنَهُمَا‏.‏",
        "annotations": null,
        "bookID": "26.0",
        "grade1": null,
        "ourHadithNumber": 30,
        "matchingEnglishURN": 16940,
        "last_updated": null
    }
]