[
    {
        "arabicURN": 126640,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "1.00",
        "hadithNumber": "2738",
        "bookName": "كتاب الوصايا ",
        "babName": "باب الْوَصَايَا ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَا حَقُّ امْرِئٍ مُسْلِمٍ لَهُ شَىْءٌ، يُوصِي فِيهِ يَبِيتُ لَيْلَتَيْنِ، إِلاَّ وَوَصِيَّتُهُ مَكْتُوبَةٌ عِنْدَهُ ‏\"‏‏.‏ تَابَعَهُ مُحَمَّدُ بْنُ مُسْلِمٍ عَنْ عَمْرٍو عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 1,
        "matchingEnglishURN": 25600,
        "last_updated": null
    },
    {
        "arabicURN": 126650,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "1.00",
        "hadithNumber": "2739",
        "bookName": "كتاب الوصايا ",
        "babName": "باب الْوَصَايَا ",
        "hadithText": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْحَارِثِ، حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ، حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ الْجُعْفِيُّ، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ عَمْرِو بْنِ الْحَارِثِ، خَتَنِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَخِي جُوَيْرِيَةَ بِنْتِ الْحَارِثِ قَالَ مَا تَرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَ مَوْتِهِ دِرْهَمًا وَلاَ دِينَارًا وَلاَ عَبْدًا وَلاَ أَمَةً وَلاَ شَيْئًا، إِلاَّ بَغْلَتَهُ الْبَيْضَاءَ وَسِلاَحَهُ وَأَرْضًا جَعَلَهَا صَدَقَةً‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 2,
        "matchingEnglishURN": 25610,
        "last_updated": null
    },
    {
        "arabicURN": 126660,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "1.00",
        "hadithNumber": "2740",
        "bookName": "كتاب الوصايا ",
        "babName": "باب الْوَصَايَا ",
        "hadithText": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا مَالِكٌ، حَدَّثَنَا طَلْحَةُ بْنُ مُصَرِّفٍ، قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى ـ رضى الله عنهما ـ هَلْ كَانَ النَّبِيُّ صلى الله عليه وسلم أَوْصَى فَقَالَ لاَ‏.‏ فَقُلْتُ كَيْفَ كُتِبَ عَلَى النَّاسِ الْوَصِيَّةُ أَوْ أُمِرُوا بِالْوَصِيَّةِ قَالَ أَوْصَى بِكِتَابِ اللَّهِ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 3,
        "matchingEnglishURN": 25620,
        "last_updated": null
    },
    {
        "arabicURN": 126670,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "1.00",
        "hadithNumber": "2741",
        "bookName": "كتاب الوصايا ",
        "babName": "باب الْوَصَايَا ",
        "hadithText": "حَدَّثَنَا عَمْرُو بْنُ زُرَارَةَ، أَخْبَرَنَا إِسْمَاعِيلُ، عَنِ ابْنِ عَوْنٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، قَالَ ذَكَرُوا عِنْدَ عَائِشَةَ أَنَّ عَلِيًّا ـ رضى الله عنهما ـ كَانَ وَصِيًّا‏.‏ فَقَالَتْ مَتَى أَوْصَى إِلَيْهِ وَقَدْ كُنْتُ مُسْنِدَتَهُ إِلَى صَدْرِي ـ أَوْ قَالَتْ حَجْرِي ـ فَدَعَا بِالطَّسْتِ، فَلَقَدِ انْخَنَثَ فِي حَجْرِي، فَمَا شَعَرْتُ أَنَّهُ قَدْ مَاتَ، فَمَتَى أَوْصَى إِلَيْهِ",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 4,
        "matchingEnglishURN": 25630,
        "last_updated": null
    },
    {
        "arabicURN": 126680,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "2.00",
        "hadithNumber": "2742",
        "bookName": "كتاب الوصايا ",
        "babName": "باب أَنْ يَتْرُكَ وَرَثَتَهُ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ يَتَكَفَّفُوا النَّاسَ ",
        "hadithText": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ ـ رضى الله عنه ـ قَالَ جَاءَ النَّبِيُّ صلى الله عليه وسلم يَعُودُنِي وَأَنَا بِمَكَّةَ، وَهْوَ يَكْرَهُ أَنْ يَمُوتَ بِالأَرْضِ الَّتِي هَاجَرَ مِنْهَا قَالَ ‏\"‏ يَرْحَمُ اللَّهُ ابْنَ عَفْرَاءَ ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ، أُوصِي بِمَالِي كُلِّهِ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ فَالشَّطْرُ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ الثُّلُثُ‏.‏ قَالَ ‏\"‏ فَالثُّلُثُ، وَالثُّلُثُ كَثِيرٌ، إِنَّكَ أَنْ تَدَعَ وَرَثَتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَدَعَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ فِي أَيْدِيهِمْ، وَإِنَّكَ مَهْمَا أَنْفَقْتَ مِنْ نَفَقَةٍ فَإِنَّهَا صَدَقَةٌ، حَتَّى اللُّقْمَةُ الَّتِي تَرْفَعُهَا إِلَى فِي امْرَأَتِكَ، وَعَسَى اللَّهُ أَنْ يَرْفَعَكَ فَيَنْتَفِعَ بِكَ نَاسٌ وَيُضَرَّ بِكَ آخَرُونَ ‏\"‏‏.‏ وَلَمْ يَكُنْ لَهُ يَوْمَئِذٍ إِلاَّ ابْنَةٌ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 5,
        "matchingEnglishURN": 25640,
        "last_updated": null
    },
    {
        "arabicURN": 126690,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "3.00",
        "hadithNumber": "2743",
        "bookName": "كتاب الوصايا ",
        "babName": "باب الْوَصِيَّةِ بِالثُّلُثِ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَوْ غَضَّ النَّاسُ إِلَى الرُّبْعِ، لأَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الثُّلُثُ، وَالثُّلُثُ كَثِيرٌ أَوْ كَبِيرٌ ‏\"‏‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 6,
        "matchingEnglishURN": 25650,
        "last_updated": null
    },
    {
        "arabicURN": 126700,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "3.00",
        "hadithNumber": "2744",
        "bookName": "كتاب الوصايا ",
        "babName": "باب الْوَصِيَّةِ بِالثُّلُثِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ، حَدَّثَنَا مَرْوَانُ، عَنْ هَاشِمِ بْنِ هَاشِمٍ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ مَرِضْتُ فَعَادَنِي النَّبِيُّ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ لاَ يَرُدَّنِي عَلَى عَقِبِي‏.‏ قَالَ ‏\"‏ لَعَلَّ اللَّهَ يَرْفَعُكَ وَيَنْفَعُ بِكَ نَاسًا ‏\"‏‏.‏ قُلْتُ أُرِيدُ أَنْ أُوصِيَ، وَإِنَّمَا لِي ابْنَةٌ ـ قُلْتُ ـ أُوصِي بِالنِّصْفِ قَالَ ‏\"‏ النِّصْفُ كَثِيرٌ ‏\"‏‏.‏ قُلْتُ فَالثُّلُثِ‏.‏ قَالَ ‏\"‏ الثُّلُثُ، وَالثُّلُثُ كَثِيرٌ أَوْ كَبِيرٌ ‏\"‏‏.‏ قَالَ فَأَوْصَى النَّاسُ بِالثُّلُثِ، وَجَازَ ذَلِكَ لَهُمْ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 7,
        "matchingEnglishURN": 25660,
        "last_updated": null
    },
    {
        "arabicURN": 126710,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "4.00",
        "hadithNumber": "2745",
        "bookName": "كتاب الوصايا ",
        "babName": "باب قَوْلِ الْمُوصِي لِوَصِيِّهِ تَعَاهَدْ وَلَدِي وَمَا يَجُوزُ لِلْوَصِيِّ مِنَ الدَّعْوَى ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كَانَ عُتْبَةُ بْنُ أَبِي وَقَّاصٍ عَهِدَ إِلَى أَخِيهِ سَعْدِ بْنِ أَبِي وَقَّاصٍ أَنَّ ابْنَ وَلِيدَةِ زَمْعَةَ مِنِّي، فَاقْبِضْهُ إِلَيْكَ‏.‏ فَلَمَّا كَانَ عَامُ الْفَتْحِ أَخَذَهُ سَعْدٌ فَقَالَ ابْنُ أَخِي، قَدْ كَانَ عَهِدَ إِلَىَّ فِيهِ‏.‏ فَقَامَ عَبْدُ بْنُ زَمْعَةَ فَقَالَ أَخِي، وَابْنُ أَمَةِ أَبِي، وُلِدَ عَلَى فِرَاشِهِ‏.‏ فَتَسَاوَقَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَقَالَ سَعْدٌ يَا رَسُولَ اللَّهِ، ابْنُ أَخِي، كَانَ عَهِدَ إِلَىَّ فِيهِ‏.‏ فَقَالَ عَبْدُ بْنُ زَمْعَةَ أَخِي وَابْنُ وَلِيدَةِ أَبِي‏.‏ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هُوَ لَكَ يَا عَبْدُ ابْنَ زَمْعَةَ، الْوَلَدُ لِلْفِرَاشِ، وَلِلْعَاهِرِ الْحَجَرُ ‏\"‏‏.‏ ثُمَّ قَالَ لِسَوْدَةَ بِنْتِ زَمْعَةَ ‏\"‏ احْتَجِبِي مِنْهُ ‏\"‏‏.‏ لِمَا رَأَى مِنْ شَبَهِهِ بِعُتْبَةَ، فَمَا رَآهَا حَتَّى لَقِيَ اللَّهَ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 8,
        "matchingEnglishURN": 25670,
        "last_updated": null
    },
    {
        "arabicURN": 126720,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "5.00",
        "hadithNumber": "2746",
        "bookName": "كتاب الوصايا ",
        "babName": "باب إِذَا أَوْمَأَ الْمَرِيضُ بِرَأْسِهِ إِشَارَةً بَيِّنَةً جَازَتْ ",
        "hadithText": "حَدَّثَنَا حَسَّانُ بْنُ أَبِي عَبَّادٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ يَهُوِدِيًّا، رَضَّ رَأْسَ جَارِيَةٍ بَيْنَ حَجَرَيْنِ، فَقِيلَ لَهَا مَنْ فَعَلَ بِكِ، أَفُلاَنٌ أَوْ فُلاَنٌ حَتَّى سُمِّيَ الْيَهُودِيُّ، فَأَوْمَأَتْ بِرَأْسِهَا، فَجِيءَ بِهِ، فَلَمْ يَزَلْ حَتَّى اعْتَرَفَ، فَأَمَرَ النَّبِيُّ صلى الله عليه وسلم فَرُضَّ رَأْسُهُ بِالْحِجَارَةِ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 9,
        "matchingEnglishURN": 25680,
        "last_updated": null
    },
    {
        "arabicURN": 126730,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "6.00",
        "hadithNumber": "2747",
        "bookName": "كتاب الوصايا ",
        "babName": "باب لاَ وَصِيَّةَ لِوَارِثٍ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، عَنْ وَرْقَاءَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ الْمَالُ لِلْوَلَدِ، وَكَانَتِ الْوَصِيَّةُ لِلْوَالِدَيْنِ، فَنَسَخَ اللَّهُ مِنْ ذَلِكَ مَا أَحَبَّ، فَجَعَلَ لِلذَّكَرِ مِثْلَ حَظِّ الأُنْثَيَيْنِ، وَجَعَلَ لِلأَبَوَيْنِ لِكُلِّ وَاحِدٍ مِنْهُمَا السُّدُسَ، وَجَعَلَ لِلْمَرْأَةِ الثُّمُنَ وَالرُّبْعَ، وَلِلزَّوْجِ الشَّطْرَ وَالرُّبُعَ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 10,
        "matchingEnglishURN": 25690,
        "last_updated": null
    },
    {
        "arabicURN": 126740,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "7.00",
        "hadithNumber": "2748",
        "bookName": "كتاب الوصايا ",
        "babName": "باب الصَّدَقَةِ عِنْدَ الْمَوْتِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ سُفْيَانَ، عَنْ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَجُلٌ لِلنَّبِيِّ صلى الله عليه وسلم يَا رَسُولَ اللَّهِ، أَىُّ الصَّدَقَةِ أَفْضَلُ قَالَ ‏\"‏ أَنْ تَصَدَّقَ وَأَنْتَ صَحِيحٌ حَرِيصٌ‏.‏ تَأْمُلُ الْغِنَى، وَتَخْشَى الْفَقْرَ، وَلاَ تُمْهِلْ حَتَّى إِذَا بَلَغَتِ الْحُلْقُومَ قُلْتَ لِفُلاَنٍ كَذَا وَلِفُلاَنٍ كَذَا، وَقَدْ كَانَ لِفُلاَنٍ ‏\"‏‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 11,
        "matchingEnglishURN": 25700,
        "last_updated": null
    },
    {
        "arabicURN": 126750,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "8.00",
        "hadithNumber": "2749",
        "bookName": "كتاب الوصايا ",
        "babName": "باب قَوْلِ اللَّهِ تَعَالَى ‏<A id=\"q3\" name=\"q3\" href=\"javascript:openquran(3,11,11)\"><c_q3>{‏مِنْ بَعْدِ وَصِيَّةٍ يُوصِي بِهَا أَوْ د",
        "hadithText": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ أَبُو الرَّبِيعِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، حَدَّثَنَا نَافِعُ بْنُ مَالِكِ بْنِ أَبِي عَامِرٍ أَبُو سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ آيَةُ الْمُنَافِقِ ثَلاَثٌ، إِذَا حَدَّثَ كَذَبَ، وَإِذَا اؤْتُمِنَ خَانَ، وَإِذَا وَعَدَ أَخْلَفَ ‏\"‏‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 12,
        "matchingEnglishURN": 25710,
        "last_updated": null
    },
    {
        "arabicURN": 126760,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "9.00",
        "hadithNumber": "2750",
        "bookName": "كتاب الوصايا ",
        "babName": "باب تَأْوِيلِ قَوْلِ اللَّهِ تَعَالَى ‏<A id=\"q5\" name=\"q5\" href=\"javascript:openquran(3,11,11)\"><c_q5>{‏مِنْ بَعْدِ وَصِيَّةٍ يُوصِي بِ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا الأَوْزَاعِيُّ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَعُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّ حَكِيمَ بْنَ حِزَامٍ ـ رضى الله عنه ـ قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَعْطَانِي، ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ قَالَ لِي ‏\"‏ يَا حَكِيمُ، إِنَّ هَذَا الْمَالَ خَضِرٌ حُلْوٌ، فَمَنْ أَخَذَهُ بِسَخَاوَةِ نَفْسٍ بُورِكَ لَهُ فِيهِ، وَمَنْ أَخَذَهُ بِإِشْرَافِ نَفْسٍ لَمْ يُبَارَكْ لَهُ فِيهِ، وَكَانَ كَالَّذِي يَأْكُلُ وَلاَ يَشْبَعُ، وَالْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى ‏\"‏‏.‏ قَالَ حَكِيمٌ فَقُلْتُ يَا رَسُولَ اللَّهِ، وَالَّذِي بَعَثَكَ بِالْحَقِّ لاَ أَرْزَأُ أَحَدًا بَعْدَكَ شَيْئًا حَتَّى أُفَارِقَ الدُّنْيَا‏.‏ فَكَانَ أَبُو بَكْرٍ يَدْعُو حَكِيمًا لِيُعْطِيَهُ الْعَطَاءَ فَيَأْبَى أَنْ يَقْبَلَ مِنْهُ شَيْئًا، ثُمَّ إِنَّ عُمَرَ دَعَاهُ لِيُعْطِيَهُ فَيَأْبَى أَنْ يَقْبَلَهُ فَقَالَ يَا مَعْشَرَ الْمُسْلِمِينَ، إِنِّي أَعْرِضُ عَلَيْهِ حَقَّهُ الَّذِي قَسَمَ اللَّهُ لَهُ مِنْ هَذَا الْفَىْءِ فَيَأْبَى أَنْ يَأْخُذَهُ‏.‏ فَلَمْ يَرْزَأْ حَكِيمٌ أَحَدًا مِنَ النَّاسِ بَعْدَ النَّبِيِّ صلى الله عليه وسلم حَتَّى تُوُفِّيَ رَحِمَهُ اللَّهُ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 13,
        "matchingEnglishURN": 25720,
        "last_updated": null
    },
    {
        "arabicURN": 126770,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "9.00",
        "hadithNumber": "2751",
        "bookName": "كتاب الوصايا ",
        "babName": "باب تَأْوِيلِ قَوْلِ اللَّهِ تَعَالَى ‏<A id=\"q5\" name=\"q5\" href=\"javascript:openquran(3,11,11)\"><c_q5>{‏مِنْ بَعْدِ وَصِيَّةٍ يُوصِي بِ",
        "hadithText": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ السَّخْتِيَانِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ كُلُّكُمْ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالإِمَامُ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالرَّجُلُ رَاعٍ فِي أَهْلِهِ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالْمَرْأَةُ فِي بَيْتِ زَوْجِهَا رَاعِيَةٌ وَمَسْئُولَةٌ عَنْ رَعِيَّتِهَا، وَالْخَادِمُ فِي مَالِ سَيِّدِهِ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ ‏\"‏‏.‏ قَالَ وَحَسِبْتُ أَنْ قَدْ قَالَ ‏\"‏ وَالرَّجُلُ رَاعٍ فِي مَالِ أَبِيهِ ‏\"‏‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 14,
        "matchingEnglishURN": 25730,
        "last_updated": null
    },
    {
        "arabicURN": 126790,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "10.00",
        "hadithNumber": "2752",
        "bookName": "كتاب الوصايا ",
        "babName": "باب إِذَا وَقَفَ أَوْ أَوْصَى لأَقَارِبِهِ وَمَنِ الأَقَارِبُ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسًا ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم لأَبِي طَلْحَةَ ‏\"‏ أَرَى أَنْ تَجْعَلَهَا فِي الأَقْرَبِينَ ‏\"‏‏.‏ قَالَ أَبُو طَلْحَةَ أَفْعَلُ يَا رَسُولَ اللَّهِ‏.‏ فَقَسَمَهَا أَبُو طَلْحَةَ فِي أَقَارِبِهِ وَبَنِي عَمِّهِ‏.‏ وَقَالَ ابْنُ عَبَّاسٍ لَمَّا نَزَلَتْ ‏<A id=\"q7\" name=\"q7\" href=\"javascript:openquran(25,214,214)\"><c_q7>{‏وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ‏}</c_q7></a>‏ جَعَلَ النَّبِيُّ صلى الله عليه وسلم يُنَادِي ‏\"‏ يَا بَنِي فِهْرٍ، يَا بَنِي عَدِيٍّ ‏\"‏‏.‏ لِبُطُونِ قُرَيْشٍ‏.‏ وَقَالَ أَبُو هُرَيْرَةَ لَمَّا نَزَلَتْ ‏<A id=\"q8\" name=\"q8\" href=\"javascript:openquran(25,214,214)\"><c_q8>{‏وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ‏}</c_q8></a>‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يَا مَعْشَرَ قُرَيْشٍ ‏\"‏‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 15,
        "matchingEnglishURN": 25740,
        "last_updated": null
    },
    {
        "arabicURN": 126800,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "11.00",
        "hadithNumber": "2753",
        "bookName": "كتاب الوصايا ",
        "babName": "باب هَلْ يَدْخُلُ النِّسَاءُ وَالْوَلَدُ فِي الأَقَارِبِ ",
        "hadithText": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏<A id=\"q9\" name=\"q9\" href=\"javascript:openquran(25,214,214)\"><c_q9>{‏وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ ‏}</c_q9></a>‏ قَالَ ‏\"‏ يَا مَعْشَرَ قُرَيْشٍ ـ أَوْ كَلِمَةً نَحْوَهَا ـ اشْتَرُوا أَنْفُسَكُمْ، لاَ أُغْنِي عَنْكُمْ مِنَ اللَّهِ شَيْئًا، يَا بَنِي عَبْدِ مَنَافٍ لاَ أُغْنِي عَنْكُمْ مِنَ اللَّهِ شَيْئًا، يَا عَبَّاسُ بْنَ عَبْدِ الْمُطَّلِبِ لاَ أُغْنِي عَنْكَ مِنَ اللَّهِ شَيْئًا، وَيَا صَفِيَّةُ عَمَّةَ رَسُولِ اللَّهِ لاَ أُغْنِي عَنْكِ مِنَ اللَّهِ شَيْئًا، وَيَا فَاطِمَةُ بِنْتَ مُحَمَّدٍ سَلِينِي مَا شِئْتِ مِنْ مَالِي لاَ أُغْنِي عَنْكِ مِنَ اللَّهِ شَيْئًا ‏\"‏‏.‏ تَابَعَهُ أَصْبَغُ عَنِ ابْنِ وَهْبٍ عَنْ يُونُسَ عَنِ ابْنِ شِهَابٍ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 16,
        "matchingEnglishURN": 25750,
        "last_updated": null
    },
    {
        "arabicURN": 126810,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "12.00",
        "hadithNumber": "2754",
        "bookName": "كتاب الوصايا ",
        "babName": "باب هَلْ يَنْتَفِعُ الْوَاقِفُ بِوَقْفِهِ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى رَجُلاً يَسُوقُ بَدَنَةً، فَقَالَ لَهُ ‏\"‏ ارْكَبْهَا ‏\"‏‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّهَا بَدَنَةٌ‏.‏ قَالَ فِي الثَّالِثَةِ أَوِ الرَّابِعَةِ ‏\"‏ ارْكَبْهَا، وَيْلَكَ، أَوْ وَيْحَكَ ‏\"‏‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 17,
        "matchingEnglishURN": 25760,
        "last_updated": null
    },
    {
        "arabicURN": 126820,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "12.00",
        "hadithNumber": "2755",
        "bookName": "كتاب الوصايا ",
        "babName": "باب هَلْ يَنْتَفِعُ الْوَاقِفُ بِوَقْفِهِ ",
        "hadithText": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى رَجُلاً يَسُوقُ بَدَنَةً، فَقَالَ ‏\"‏ ارْكَبْهَا ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ إِنَّهَا بَدَنَةٌ‏.‏ قَالَ ‏\"‏ ارْكَبْهَا، وَيْلَكَ ‏\"‏‏.‏ فِي الثَّانِيَةِ أَوْ فِي الثَّالِثَةِ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 18,
        "matchingEnglishURN": 25770,
        "last_updated": null
    },
    {
        "arabicURN": 126830,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "15.00",
        "hadithNumber": "2756",
        "bookName": "كتاب الوصايا ",
        "babName": "باب إِذَا قَالَ أَرْضِي أَوْ بُسْتَانِي صَدَقَةٌ عَنْ أُمِّي فَهُوَ جَائِزٌ، وَإِنْ لَمْ يُبَيِّنْ لِمَنْ ذ",
        "hadithText": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا مَخْلَدُ بْنُ يَزِيدَ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي يَعْلَى، أَنَّهُ سَمِعَ عِكْرِمَةَ، يَقُولُ أَنْبَأَنَا ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ سَعْدَ بْنَ عُبَادَةَ ـ رضى الله عنه ـ تُوُفِّيَتْ أُمُّهُ وَهْوَ غَائِبٌ عَنْهَا، فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أُمِّي تُوُفِّيَتْ وَأَنَا غَائِبٌ عَنْهَا، أَيَنْفَعُهَا شَىْءٌ إِنْ تَصَدَّقْتُ بِهِ عَنْهَا قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ قَالَ فَإِنِّي أُشْهِدُكَ أَنَّ حَائِطِي الْمِخْرَافَ صَدَقَةٌ عَلَيْهَا‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 19,
        "matchingEnglishURN": 25780,
        "last_updated": null
    },
    {
        "arabicURN": 126840,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "16.00",
        "hadithNumber": "2757",
        "bookName": "كتاب الوصايا ",
        "babName": "باب إِذَا تَصَدَّقَ أَوْ أَوْقَفَ بَعْضَ مَالِهِ أَوْ بَعْضَ رَقِيقِهِ أَوْ دَوَابِّهِ، فَهُوَ جَائِزٌ ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبٍ، أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبٍ، قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ ـ رضى الله عنه‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ، إِنَّ مِنْ تَوْبَتِي أَنْ أَنْخَلِعَ مِنْ مَالِي صَدَقَةً إِلَى اللَّهِ وَإِلَى رَسُولِهِ صلى الله عليه وسلم‏.‏ قَالَ ‏\"‏ أَمْسِكْ عَلَيْكَ بَعْضَ مَالِكَ فَهُوَ خَيْرٌ لَكَ ‏\"‏‏.‏ قُلْتُ فَإِنِّي أُمْسِكُ سَهْمِي الَّذِي بِخَيْبَرَ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 20,
        "matchingEnglishURN": 25790,
        "last_updated": null
    },
    {
        "arabicURN": 126850,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "17.00",
        "hadithNumber": "2758",
        "bookName": "كتاب الوصايا ",
        "babName": "باب مَنْ تَصَدَّقَ إِلَى وَكِيلِهِ ثُمَّ رَدَّ الْوَكِيلُ إِلَيْهِ ",
        "hadithText": "وَقَالَ إِسْمَاعِيلُ أَخْبَرَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ،، لاَ أَعْلَمُهُ إِلاَّ عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ لَمَّا نَزَلَتْ ‏<A id=\"q10\" name=\"q10\" href=\"javascript:openquran(2,92,92)\"><c_q10>{‏لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ‏}</c_q10></a>‏ جَاءَ أَبُو طَلْحَةَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ يَقُولُ اللَّهُ تَبَارَكَ وَتَعَالَى فِي كِتَابِهِ ‏<A id=\"q11\" name=\"q11\" href=\"javascript:openquran(2,92,92)\"><c_q11>{‏لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ‏}</c_q11></a>‏ وَإِنَّ أَحَبَّ أَمْوَالِي إِلَىَّ بِيرُحَاءَ ـ قَالَ وَكَانَتْ حَدِيقَةً كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدْخُلُهَا وَيَسْتَظِلُّ بِهَا وَيَشْرَبُ مِنْ مَائِهَا ـ فَهِيَ إِلَى اللَّهِ عَزَّ وَجَلَّ وَإِلَى رَسُولِهِ صلى الله عليه وسلم أَرْجُو بِرَّهُ وَذُخْرَهُ، فَضَعْهَا أَىْ رَسُولَ اللَّهِ حَيْثُ أَرَاكَ اللَّهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بَخْ يَا أَبَا طَلْحَةَ، ذَلِكَ مَالٌ رَابِحٌ، قَبِلْنَاهُ مِنْكَ وَرَدَدْنَاهُ عَلَيْكَ، فَاجْعَلْهُ فِي الأَقْرَبِينَ ‏\"‏‏.‏ فَتَصَدَّقَ بِهِ أَبُو طَلْحَةَ عَلَى ذَوِي رَحِمِهِ، قَالَ وَكَانَ مِنْهُمْ أُبَىٌّ وَحَسَّانُ، قَالَ وَبَاعَ حَسَّانُ حِصَّتَهُ مِنْهُ مِنْ مُعَاوِيَةَ، فَقِيلَ لَهُ تَبِيعُ صَدَقَةَ أَبِي طَلْحَةَ فَقَالَ أَلاَ أَبِيعُ صَاعًا مِنْ تَمْرٍ بِصَاعٍ مِنْ دَرَاهِمَ قَالَ وَكَانَتْ تِلْكَ الْحَدِيقَةُ فِي مَوْضِعِ قَصْرِ بَنِي حُدَيْلَةَ الَّذِي بَنَاهُ مُعَاوِيَةُ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 21,
        "matchingEnglishURN": 25795,
        "last_updated": null
    },
    {
        "arabicURN": 126860,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "18.00",
        "hadithNumber": "2759",
        "bookName": "كتاب الوصايا ",
        "babName": "باب قَوْلِ اللَّهِ تَعَالَى ‏<A id=\"q12\" name=\"q12\" href=\"javascript:openquran(3,8,8)\"><c_q12>{‏وَإِذَا حَضَرَ الْقِسْمَةَ أُولُو الْقُر",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الْفَضْلِ أَبُو النُّعْمَانِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ إِنَّ نَاسًا يَزْعُمُونَ أَنَّ هَذِهِ الآيَةَ نُسِخَتْ، وَلاَ وَاللَّهِ مَا نُسِخَتْ، وَلَكِنَّهَا مِمَّا تَهَاوَنَ النَّاسُ، هُمَا وَالِيَانِ وَالٍ يَرِثُ، وَذَاكَ الَّذِي يَرْزُقُ، وَوَالٍ لاَ يَرِثُ، فَذَاكَ الَّذِي يَقُولُ بِالْمَعْرُوفِ، يَقُولُ لاَ أَمْلِكُ لَكَ أَنْ أُعْطِيَكَ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 22,
        "matchingEnglishURN": 25800,
        "last_updated": null
    },
    {
        "arabicURN": 126870,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "19.00",
        "hadithNumber": "2760",
        "bookName": "كتاب الوصايا ",
        "babName": "باب مَا يُسْتَحَبُّ لِمَنْ يُتَوَفَّى فَجْأَةً أَنْ يَتَصَدَّقُوا عَنْهُ وَقَضَاءِ النُّذُورِ عَنِ الْمَيّ",
        "hadithText": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، رضى الله عنها أَنَّ رَجُلاً، قَالَ لِلنَّبِيِّ صلى الله عليه وسلم إِنَّ أُمِّي افْتُلِتَتْ نَفْسَهَا، وَأُرَاهَا لَوْ تَكَلَّمَتْ تَصَدَّقَتْ، أَفَأَتَصَدَّقُ عَنْهَا قَالَ ‏\"‏ نَعَمْ، تَصَدَّقْ عَنْهَا ‏\"‏‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 23,
        "matchingEnglishURN": 25810,
        "last_updated": null
    },
    {
        "arabicURN": 126880,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "19.00",
        "hadithNumber": "2761",
        "bookName": "كتاب الوصايا ",
        "babName": "باب مَا يُسْتَحَبُّ لِمَنْ يُتَوَفَّى فَجْأَةً أَنْ يَتَصَدَّقُوا عَنْهُ وَقَضَاءِ النُّذُورِ عَنِ الْمَيّ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ سَعْدَ بْنَ عُبَادَةَ ـ رضى الله عنه ـ اسْتَفْتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنَّ أُمِّي مَاتَتْ وَعَلَيْهَا نَذْرٌ‏.‏ فَقَالَ ‏\"‏ اقْضِهِ عَنْهَا ‏\"‏‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 24,
        "matchingEnglishURN": 25820,
        "last_updated": null
    },
    {
        "arabicURN": 126890,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "20.00",
        "hadithNumber": "2762",
        "bookName": "كتاب الوصايا ",
        "babName": "باب الإِشْهَادِ فِي الْوَقْفِ وَالصَّدَقَةِ ",
        "hadithText": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي يَعْلَى، أَنَّهُ سَمِعَ عِكْرِمَةَ، مَوْلَى ابْنِ عَبَّاسٍ يَقُولُ أَنْبَأَنَا ابْنُ عَبَّاسٍ، أَنَّ سَعْدَ بْنَ عُبَادَةَ ـ رضى الله عنهم ـ أَخَا بَنِي سَاعِدَةَ تُوُفِّيَتْ أُمُّهُ وَهْوَ غَائِبٌ، فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أُمِّي تُوُفِّيَتْ وَأَنَا غَائِبٌ عَنْهَا، فَهَلْ يَنْفَعُهَا شَىْءٌ إِنْ تَصَدَّقْتُ بِهِ عَنْهَا قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ قَالَ فَإِنِّي أُشْهِدُكَ أَنَّ حَائِطِي الْمِخْرَافَ صَدَقَةٌ عَلَيْهَا‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 25,
        "matchingEnglishURN": 25830,
        "last_updated": null
    },
    {
        "arabicURN": 126900,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "21.00",
        "hadithNumber": "2763",
        "bookName": "كتاب الوصايا ",
        "babName": "باب قَوْلِ اللَّهِ تَعَالَى <A id=\"q13\" name=\"q13\" href=\"javascript:openquran(3,2,3)\"><c_q13>‏{‏وَآتُوا الْيَتَامَى أَمْوَالَهُمْ وَلاَ ",
        "hadithText": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ كَانَ عُرْوَةُ بْنُ الزُّبَيْرِ يُحَدِّثُ أَنَّهُ سَأَلَ عَائِشَةَ ـ رضى الله عنها – <A id=\"q14\" name=\"q14\" href=\"javascript:openquran(3,3,3)\"><c_q14>‏{‏وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ‏}‏</c_q14></a> قَالَتْ هِيَ الْيَتِيمَةُ فِي حَجْرِ وَلِيِّهَا، فَيَرْغَبُ فِي جَمَالِهَا وَمَالِهَا، وَيُرِيدُ أَنْ يَتَزَوَّجَهَا بِأَدْنَى مِنْ سُنَّةِ نِسَائِهَا، فَنُهُوا عَنْ نِكَاحِهِنَّ، إِلاَّ أَنْ يُقْسِطُوا لَهُنَّ فِي إِكْمَالِ الصَّدَاقِ، وَأُمِرُوا بِنِكَاحِ مَنْ سِوَاهُنَّ مِنَ النِّسَاءِ قَالَتْ عَائِشَةُ ثُمَّ اسْتَفْتَى النَّاسُ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعْدُ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏<A id=\"q15\" name=\"q15\" href=\"javascript:openquran(3,127,127)\"><c_q15>{‏وَيَسْتَفْتُونَكَ فِي النِّسَاءِ قُلِ اللَّهُ يُفْتِيكُمْ فِيهِنَّ‏}</c_q15></a>‏ قَالَتْ فَبَيَّنَ اللَّهُ فِي هَذِهِ أَنَّ الْيَتِيمَةَ إِذَا كَانَتْ ذَاتَ جَمَالٍ وَمَالٍ رَغِبُوا فِي نِكَاحِهَا، وَلَمْ يُلْحِقُوهَا بِسُنَّتِهَا بِإِكْمَالِ الصَّدَاقِ، فَإِذَا كَانَتْ مَرْغُوبَةً عَنْهَا فِي قِلَّةِ الْمَالِ وَالْجَمَالِ تَرَكُوهَا وَالْتَمَسُوا غَيْرَهَا مِنَ النِّسَاءِ، قَالَ فَكَمَا يَتْرُكُونَهَا حِينَ يَرْغَبُونَ عَنْهَا فَلَيْسَ لَهُمْ أَنْ يَنْكِحُوهَا إِذَا رَغِبُوا فِيهَا إِلاَّ أَنْ يُقْسِطُوا لَهَا الأَوْفَى مِنَ الصَّدَاقِ وَيُعْطُوهَا حَقَّهَا‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 26,
        "matchingEnglishURN": 25840,
        "last_updated": null
    },
    {
        "arabicURN": 126910,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "22.10",
        "hadithNumber": "2764",
        "bookName": "كتاب الوصايا ",
        "babName": "باب وَمَا لِلْوَصِيِّ أَنْ يَعْمَلَ فِي مَالِ الْيَتِيمِ، وَمَا يَأْكُلُ مِنْهُ بِقَدْرِ عُمَالَتِهِ ",
        "hadithText": "حَدَّثَنَا هَارُونُ، حَدَّثَنَا أَبُو سَعِيدٍ، مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا صَخْرُ بْنُ جُوَيْرِيَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ عُمَرَ، تَصَدَّقَ بِمَالٍ لَهُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَ يُقَالُ لَهُ ثَمْغٌ، وَكَانَ نَخْلاً، فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ إِنِّي اسْتَفَدْتُ مَالاً وَهُوَ عِنْدِي نَفِيسٌ فَأَرَدْتُ أَنْ أَتَصَدَّقَ بِهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ تَصَدَّقْ بِأَصْلِهِ، لاَ يُبَاعُ وَلاَ يُوهَبُ وَلاَ يُورَثُ، وَلَكِنْ يُنْفَقُ ثَمَرُهُ ‏\"‏‏.‏ فَتَصَدَّقَ بِهِ عُمَرُ، فَصَدَقَتُهُ ذَلِكَ فِي سَبِيلِ اللَّهِ وَفِي الرِّقَابِ وَالْمَسَاكِينِ وَالضَّيْفِ وَابْنِ السَّبِيلِ وَلِذِي الْقُرْبَى، وَلاَ جُنَاحَ عَلَى مَنْ وَلِيَهُ أَنْ يَأْكُلَ مِنْهُ بِالْمَعْرُوفِ، أَوْ يُوكِلَ صَدِيقَهُ غَيْرَ مُتَمَوِّلٍ بِهِ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 27,
        "matchingEnglishURN": 25850,
        "last_updated": null
    },
    {
        "arabicURN": 126920,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "22.10",
        "hadithNumber": "2765",
        "bookName": "كتاب الوصايا ",
        "babName": "باب وَمَا لِلْوَصِيِّ أَنْ يَعْمَلَ فِي مَالِ الْيَتِيمِ، وَمَا يَأْكُلُ مِنْهُ بِقَدْرِ عُمَالَتِهِ ",
        "hadithText": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها – ‏<A id=\"q17\" name=\"q17\" href=\"javascript:openquran(3,6,6)\"><c_q17>{‏وَمَنْ كَانَ غَنِيًّا فَلْيَسْتَعْفِفْ وَمَنْ كَانَ فَقِيرًا فَلْيَأْكُلْ بِالْمَعْرُوفِ‏}</c_q17></a>‏‏.‏ قَالَتْ أُنْزِلَتْ فِي وَالِي الْيَتِيمِ أَنْ يُصِيبَ مِنْ مَالِهِ إِذَا كَانَ مُحْتَاجًا بِقَدْرِ مَالِهِ بِالْمَعْرُوفِ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 28,
        "matchingEnglishURN": 25860,
        "last_updated": null
    },
    {
        "arabicURN": 126930,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "23.00",
        "hadithNumber": "2766",
        "bookName": "كتاب الوصايا ",
        "babName": "باب قَوْلِ اللَّهِ تَعَالَى ‏<A id=\"q18\" name=\"q18\" href=\"javascript:openquran(3,1,1)\"><c_q18>{‏إِنَّ الَّذِينَ يَأْكُلُونَ أَمْوَالَ ال",
        "hadithText": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ الْمَدَنِيِّ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ اجْتَنِبُوا السَّبْعَ الْمُوبِقَاتِ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ، وَمَا هُنَّ قَالَ ‏\"‏ الشِّرْكُ بِاللَّهِ، وَالسِّحْرُ، وَقَتْلُ النَّفْسِ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ، وَأَكْلُ الرِّبَا، وَأَكْلُ مَالِ الْيَتِيمِ، وَالتَّوَلِّي يَوْمَ الزَّحْفِ، وَقَذْفُ الْمُحْصَنَاتِ الْمُؤْمِنَاتِ الْغَافِلاَتِ ‏\"‏‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 29,
        "matchingEnglishURN": 25870,
        "last_updated": null
    },
    {
        "arabicURN": 126940,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "24.00",
        "hadithNumber": "2767",
        "bookName": "كتاب الوصايا ",
        "babName": "باب قَوْلِ اللَّهِ تَعَالَى ‏<A id=\"q19\" name=\"q19\" href=\"javascript:openquran(1,220,220)\"><c_q19>{‏وَيَسْأَلُونَكَ عَنِ الْيَتَامَى، قُل",
        "hadithText": "وَقَالَ لَنَا سُلَيْمَانُ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، قَالَ مَا رَدَّ ابْنُ عُمَرَ عَلَى أَحَدٍ وَصِيَّةً‏.‏ وَكَانَ ابْنُ سِيرِينَ أَحَبَّ الأَشْيَاءِ إِلَيْهِ فِي مَالِ الْيَتِيمِ أَنْ يَجْتَمِعَ إِلَيْهِ نُصَحَاؤُهُ وَأَوْلِيَاؤُهُ فَيَنْظُرُوا الَّذِي هُوَ خَيْرٌ لَهُ‏.‏ وَكَانَ طَاوُسٌ إِذَا سُئِلَ عَنْ شَىْءٍ مِنْ أَمْرِ الْيَتَامَى قَرَأَ ‏<A id=\"q20\" name=\"q20\" href=\"javascript:openquran(1,220,220)\"><c_q20>{‏وَاللَّهُ يَعْلَمُ الْمُفْسِدَ مِنَ الْمُصْلِحِ‏}</c_q20></a>‏‏.‏ وَقَالَ عَطَاءٌ فِي يَتَامَى الصَّغِيرُ وَالْكَبِيرُ يُنْفِقُ الْوَلِيُّ عَلَى كُلِّ إِنْسَانٍ بِقَدْرِهِ مِنْ حِصَّتِهِ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 30,
        "matchingEnglishURN": 25875,
        "last_updated": null
    },
    {
        "arabicURN": 126950,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "25.00",
        "hadithNumber": "2768",
        "bookName": "كتاب الوصايا ",
        "babName": "باب اسْتِخْدَامِ الْيَتِيمِ فِي السَّفَرِ وَالْحَضَرِ إِذَا كَانَ صَلاَحًا لَهُ وَنَظَرِ الأُمِّ وَزَوْجِه",
        "hadithText": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ كَثِيرٍ، حَدَّثَنَا ابْنُ عُلَيَّةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ لَيْسَ لَهُ خَادِمٌ، فَأَخَذَ أَبُو طَلْحَةَ بِيَدِي، فَانْطَلَقَ بِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أَنَسًا غُلاَمٌ كَيِّسٌ، فَلْيَخْدُمْكَ‏.‏ قَالَ فَخَدَمْتُهُ فِي السَّفَرِ وَالْحَضَرِ، مَا قَالَ لِي لِشَىْءٍ صَنَعْتُهُ لِمَ صَنَعْتَ هَذَا هَكَذَا وَلاَ لِشَىْءٍ لَمْ أَصْنَعْهُ لِمَ لَمْ تَصْنَعْ هَذَا هَكَذَا",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 31,
        "matchingEnglishURN": 25880,
        "last_updated": null
    },
    {
        "arabicURN": 126960,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "26.00",
        "hadithNumber": "2769",
        "bookName": "كتاب الوصايا ",
        "babName": "باب إِذَا وَقَفَ أَرْضًا وَلَمْ يُبَيِّنِ الْحُدُودَ فَهْوَ جَائِزٌ، وَكَذَلِكَ الصَّدَقَةُ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ كَانَ أَبُو طَلْحَةَ أَكْثَرَ أَنْصَارِيٍّ بِالْمَدِينَةِ مَالاً مِنْ نَخْلٍ، وَكَانَ أَحَبُّ مَالِهِ إِلَيْهِ بَيْرَحَاءَ مُسْتَقْبِلَةَ الْمَسْجِدِ، وَكَانَ النَّبِيُّ صلى الله عليه وسلم يَدْخُلُهَا وَيَشْرَبُ مِنْ مَاءٍ فِيهَا طَيِّبٍ‏.‏ قَالَ أَنَسٌ فَلَمَّا نَزَلَتْ ‏<A id=\"q21\" name=\"q21\" href=\"javascript:openquran(2,92,92)\"><c_q21>{‏لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ‏}</c_q21></a>‏ قَامَ أَبُو طَلْحَةَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ يَقُولُ ‏<A id=\"q22\" name=\"q22\" href=\"javascript:openquran(2,92,92)\"><c_q22>{‏لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ‏}</c_q22></a>‏ وَإِنَّ أَحَبَّ أَمْوَالِي إِلَىَّ بِيرُحَاءَ، وَإِنَّهَا صَدَقَةٌ لِلَّهِ أَرْجُو بِرَّهَا وَذُخْرَهَا عِنْدَ اللَّهِ، فَضَعْهَا حَيْثُ أَرَاكَ اللَّهُ‏.‏ فَقَالَ ‏\"‏ بَخْ، ذَلِكَ مَالٌ رَابِحٌ ـ أَوْ رَايِحٌ ـ شَكَّ ابْنُ مَسْلَمَةَ وَقَدْ سَمِعْتُ مَا قُلْتَ، وَإِنِّي أَرَى أَنْ تَجْعَلَهَا فِي الأَقْرَبِينَ ‏\"‏‏.‏ قَالَ أَبُو طَلْحَةَ أَفْعَلُ ذَلِكَ يَا رَسُولَ اللَّهِ‏.‏ فَقَسَمَهَا أَبُو طَلْحَةَ فِي أَقَارِبِهِ وَفِي بَنِي عَمِّهِ‏.‏ وَقَالَ إِسْمَاعِيلُ وَعَبْدُ اللَّهِ بْنُ يُوسُفَ وَيَحْيَى بْنُ يَحْيَى عَنْ مَالِكٍ ‏\"‏ رَايِحٌ ‏\"‏‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 32,
        "matchingEnglishURN": 25890,
        "last_updated": null
    },
    {
        "arabicURN": 126970,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "26.00",
        "hadithNumber": "2770",
        "bookName": "كتاب الوصايا ",
        "babName": "باب إِذَا وَقَفَ أَرْضًا وَلَمْ يُبَيِّنِ الْحُدُودَ فَهْوَ جَائِزٌ، وَكَذَلِكَ الصَّدَقَةُ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَاقَ، قَالَ حَدَّثَنِي عَمْرُو بْنُ دِينَارٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما أَنَّ رَجُلاً، قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِنَّ أُمَّهُ تُوُفِّيَتْ أَيَنْفَعُهَا إِنْ تَصَدَّقْتُ عَنْهَا قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ قَالَ فَإِنَّ لِي مِخْرَافًا وَأُشْهِدُكَ أَنِّي قَدْ تَصَدَّقْتُ عَنْهَا‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 33,
        "matchingEnglishURN": 25900,
        "last_updated": null
    },
    {
        "arabicURN": 126980,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "27.00",
        "hadithNumber": "2771",
        "bookName": "كتاب الوصايا ",
        "babName": "باب إِذَا أَوْقَفَ جَمَاعَةٌ أَرْضًا مُشَاعًا فَهْوَ جَائِزٌ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ أَمَرَ النَّبِيُّ صلى الله عليه وسلم بِبِنَاءِ الْمَسْجِدِ فَقَالَ ‏\"‏ يَا بَنِي النَّجَّارِ ثَامِنُونِي بِحَائِطِكُمْ هَذَا ‏\"‏‏.‏ قَالُوا لاَ‏.‏ وَاللَّهِ لاَ نَطْلُبُ ثَمَنَهُ إِلاَّ إِلَى اللَّهِ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 34,
        "matchingEnglishURN": 25910,
        "last_updated": null
    },
    {
        "arabicURN": 126990,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "28.00",
        "hadithNumber": "2772",
        "bookName": "كتاب الوصايا ",
        "babName": "باب الْوَقْفِ كَيْفَ يُكْتَبُ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ أَصَابَ عُمَرُ بِخَيْبَرَ أَرْضًا فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ أَصَبْتُ أَرْضًا لَمْ أُصِبْ مَالاً قَطُّ أَنْفَسَ مِنْهُ، فَكَيْفَ تَأْمُرُنِي بِهِ قَالَ ‏\"‏ إِنْ شِئْتَ حَبَّسْتَ أَصْلَهَا، وَتَصَدَّقْتَ بِهَا ‏\"‏‏.‏ فَتَصَدَّقَ عُمَرُ أَنَّهُ لاَ يُبَاعُ أَصْلُهَا وَلاَ يُوهَبُ وَلاَ يُورَثُ، فِي الْفُقَرَاءِ وَالْقُرْبَى وَالرِّقَابِ وَفِي سَبِيلِ اللَّهِ وَالضَّيْفِ وَابْنِ السَّبِيلِ، وَلاَ جُنَاحَ عَلَى مَنْ وَلِيَهَا أَنْ يَأْكُلَ مِنْهَا بِالْمَعْرُوفِ، أَوْ يُطْعِمَ صَدِيقًا غَيْرَ مُتَمَوِّلٍ فِيهِ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 35,
        "matchingEnglishURN": 25920,
        "last_updated": null
    },
    {
        "arabicURN": 127000,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "29.00",
        "hadithNumber": "2773",
        "bookName": "كتاب الوصايا ",
        "babName": "باب الْوَقْفِ لِلْغَنِيِّ وَالْفَقِيرِ وَالضَّيْفِ ",
        "hadithText": "حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ، رضى الله عنه وَجَدَ مَالاً بِخَيْبَرَ، فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَأَخْبَرَهُ، قَالَ ‏\"‏ إِنْ شِئْتَ تَصَدَّقْتَ بِهَا ‏\"‏‏.‏ فَتَصَدَّقَ بِهَا فِي الْفُقَرَاءِ وَالْمَسَاكِينِ وَذِي الْقُرْبَى وَالضَّيْفِ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 36,
        "matchingEnglishURN": 25930,
        "last_updated": null
    },
    {
        "arabicURN": 127010,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "30.00",
        "hadithNumber": "2774",
        "bookName": "كتاب الوصايا ",
        "babName": "باب وَقْفِ الأَرْضِ لِلْمَسْجِدِ ",
        "hadithText": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا عَبْدُ الصَّمَدِ، قَالَ سَمِعْتُ أَبِي، حَدَّثَنَا أَبُو التَّيَّاحِ، قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ أَمَرَ بِالْمَسْجِدِ وَقَالَ ‏\"‏ يَا بَنِي النَّجَّارِ ثَامِنُونِي بِحَائِطِكُمْ هَذَا ‏\"‏‏.‏ قَالُوا لاَ وَاللَّهِ لاَ نَطْلُبُ ثَمَنَهُ إِلاَّ إِلَى اللَّهِ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 37,
        "matchingEnglishURN": 25940,
        "last_updated": null
    },
    {
        "arabicURN": 127020,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "31.00",
        "hadithNumber": "2775",
        "bookName": "كتاب الوصايا ",
        "babName": "باب وَقْفِ الدَّوَابِّ وَالْكُرَاعِ وَالْعُرُوضِ وَالصَّامِتِ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، حَدَّثَنَا عُبَيْدُ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ عُمَرَ، حَمَلَ عَلَى فَرَسٍ لَهُ فِي سَبِيلِ اللَّهِ أَعْطَاهَا رَسُولَ اللَّهِ صلى الله عليه وسلم لِيَحْمِلَ عَلَيْهَا رَجُلاً، فَأُخْبِرَ عُمَرُ أَنَّهُ قَدْ وَقَفَهَا يَبِيعُهَا، فَسَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْ يَبْتَاعَهَا فَقَالَ ‏\"‏ لاَ تَبْتَعْهَا، وَلاَ تَرْجِعَنَّ فِي صَدَقَتِكَ ‏\"‏‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 38,
        "matchingEnglishURN": 25950,
        "last_updated": null
    },
    {
        "arabicURN": 127030,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "32.00",
        "hadithNumber": "2776",
        "bookName": "كتاب الوصايا ",
        "babName": "باب نَفَقَةِ الْقَيِّمِ لِلْوَقْفِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَقْتَسِمْ وَرَثَتِي دِينَارًا، مَا تَرَكْتُ بَعْدَ نَفَقَةِ نِسَائِي وَمَئُونَةِ عَامِلِي فَهْوَ صَدَقَةٌ ‏\"‏‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 39,
        "matchingEnglishURN": 25960,
        "last_updated": null
    },
    {
        "arabicURN": 127040,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "32.00",
        "hadithNumber": "2777",
        "bookName": "كتاب الوصايا ",
        "babName": "باب نَفَقَةِ الْقَيِّمِ لِلْوَقْفِ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ عُمَرَ، اشْتَرَطَ فِي وَقْفِهِ أَنْ يَأْكُلَ مَنْ وَلِيَهُ وَيُوكِلَ صَدِيقَهُ غَيْرَ مُتَمَوِّلٍ مَالاً‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 40,
        "matchingEnglishURN": 25970,
        "last_updated": null
    },
    {
        "arabicURN": 127050,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "33.00",
        "hadithNumber": "2778",
        "bookName": "كتاب الوصايا ",
        "babName": "باب إِذَا وَقَفَ أَرْضًا أَوْ بِئْرًا وَاشْتَرَطَ لِنَفْسِهِ مِثْلَ دِلاَءِ الْمُسْلِمِينَ ",
        "hadithText": "وَقَالَ عَبْدَانُ أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ عُثْمَانَ ـ رضى الله عنه ـ حَيْثُ حُوصِرَ أَشْرَفَ عَلَيْهِمْ وَقَالَ أَنْشُدُكُمْ وَلاَ أَنْشُدُ إِلاَّ أَصْحَابَ النَّبِيِّ صلى الله عليه وسلم، أَلَسْتُمْ تَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ حَفَرَ رُومَةَ فَلَهُ الْجَنَّةُ ‏\"‏‏.‏ فَحَفَرْتُهَا، أَلَسْتُمْ تَعْلَمُونَ أَنَّهُ قَالَ ‏\"‏ مَنْ جَهَّزَ جَيْشَ الْعُسْرَةِ فَلَهُ الْجَنَّةُ ‏\"‏‏.‏ فَجَهَّزْتُهُمْ‏.‏ قَالَ فَصَدَّقُوهُ بِمَا قَالَ‏.‏ وَقَالَ عُمَرُ فِي وَقْفِهِ لاَ جُنَاحَ عَلَى مَنْ وَلِيَهُ أَنْ يَأْكُلَ‏.‏ وَقَدْ يَلِيهِ الْوَاقِفُ وَغَيْرُهُ فَهْوَ وَاسِعٌ لِكُلٍّ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 41,
        "matchingEnglishURN": 25975,
        "last_updated": null
    },
    {
        "arabicURN": 127060,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "34.00",
        "hadithNumber": "2779",
        "bookName": "كتاب الوصايا ",
        "babName": "باب إِذَا قَالَ الْوَاقِفُ لاَ نَطْلُبُ ثَمَنَهُ إِلاَّ إِلَى اللَّهِ فَهْوَ جَائِزٌ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يَا بَنِي النَّجَّارِ ثَامِنُونِي بِحَائِطِكُمْ ‏\"‏‏.‏ قَالُوا لاَ نَطْلُبُ ثَمَنَهُ إِلاَّ إِلَى اللَّهِ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 42,
        "matchingEnglishURN": 25980,
        "last_updated": null
    },
    {
        "arabicURN": 127070,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "35.00",
        "hadithNumber": "2780",
        "bookName": "كتاب الوصايا ",
        "babName": "باب قَوْلِ اللَّهِ تَعَالَى ‏<A id=",
        "hadithText": "وَقَالَ لِي عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، عَنْ مُحَمَّدِ بْنِ أَبِي الْقَاسِمِ، عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ خَرَجَ رَجُلٌ مِنْ بَنِي سَهْمٍ مَعَ تَمِيمٍ الدَّارِيِّ وَعَدِيِّ بْنِ بَدَّاءٍ فَمَاتَ السَّهْمِيُّ بِأَرْضٍ لَيْسَ بِهَا مُسْلِمٌ، فَلَمَّا قَدِمَا بِتَرِكَتِهِ فَقَدُوا جَامًا مِنْ فِضَّةٍ مُخَوَّصًا مِنْ ذَهَبٍ، فَأَحْلَفَهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم، ثُمَّ وُجِدَ الْجَامُ بِمَكَّةَ فَقَالُوا ابْتَعْنَاهُ مِنْ تَمِيمٍ وَعَدِيٍّ‏.‏ فَقَامَ رَجُلاَنِ مِنْ أَوْلِيَائِهِ، فَحَلَفَا لَشَهَادَتُنَا أَحَقُّ مِنْ شَهَادَتِهِمَا، وَإِنَّ الْجَامَ لِصَاحِبِهِمْ‏.‏ قَالَ وَفِيهِمْ نَزَلَتْ هَذِهِ الآيَةُ ‏<A id=\"q24\" name=\"q24\" href=\"javascript:openquran(4,106,106)\"><c_q24>{‏يَا أَيُّهَا الَّذِينَ آمَنُوا شَهَادَةُ بَيْنِكُمْ ‏إِذَا حَضَرَ أَحَدَكُمُ الْمَوْتُ}<c_q24></a>‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 43,
        "matchingEnglishURN": 25985,
        "last_updated": null
    },
    {
        "arabicURN": 127080,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "babNumber": "36.00",
        "hadithNumber": "2781",
        "bookName": "كتاب الوصايا ",
        "babName": "باب قَضَاءِ الْوَصِيِّ دُيُونَ الْمَيِّتِ بِغَيْرِ مَحْضَرٍ مِنَ الْوَرَثَةِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ سَابِقٍ، أَوِ الْفَضْلُ بْنُ يَعْقُوبَ عَنْهُ حَدَّثَنَا شَيْبَانُ أَبُو مُعَاوِيَةَ، عَنْ فِرَاسٍ، قَالَ قَالَ الشَّعْبِيُّ حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ ـ رضى الله عنهما ـ أَنَّ أَبَاهُ اسْتُشْهِدَ يَوْمَ أُحُدٍ، وَتَرَكَ سِتَّ بَنَاتٍ، وَتَرَكَ عَلَيْهِ دَيْنًا، فَلَمَّا حَضَرَ جِدَادُ النَّخْلِ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ قَدْ عَلِمْتَ أَنَّ وَالِدِي اسْتُشْهِدَ يَوْمَ أُحُدٍ وَتَرَكَ عَلَيْهِ دَيْنًا كَثِيرًا، وَإِنِّي أُحِبُّ أَنْ يَرَاكَ الْغُرَمَاءُ قَالَ ‏\"‏ اذْهَبْ فَبَيْدِرْ كُلَّ تَمْرٍ عَلَى نَاحِيَتِهِ ‏\"‏‏.‏ فَفَعَلْتُ ثُمَّ دَعَوْتُهُ، فَلَمَّا نَظَرُوا إِلَيْهِ أُغْرُوا بِي تِلْكَ السَّاعَةَ، فَلَمَّا رَأَى مَا يَصْنَعُونَ أَطَافَ حَوْلَ أَعْظَمِهَا بَيْدَرًا ثَلاَثَ مَرَّاتٍ ثُمَّ جَلَسَ عَلَيْهِ ثُمَّ قَالَ ‏\"‏ ادْعُ أَصْحَابَكَ ‏\"‏‏.‏ فَمَا زَالَ يَكِيلُ لَهُمْ حَتَّى أَدَّى اللَّهُ أَمَانَةَ وَالِدِي، وَأَنَا وَاللَّهِ رَاضٍ أَنْ يُؤَدِّيَ اللَّهُ أَمَانَةَ وَالِدِي وَلاَ أَرْجِعَ إِلَى أَخَوَاتِي بِتَمْرَةٍ، فَسَلِمَ وَاللَّهِ الْبَيَادِرُ كُلُّهَا حَتَّى أَنِّي أَنْظُرُ إِلَى الْبَيْدَرِ الَّذِي عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم كَأَنَّهُ لَمْ يَنْقُصْ تَمْرَةً وَاحِدَةً‏.‏   <br><p>\nقَالَ أَبُو عَبْد اللَّهِ أُغْرُوا بِي يَعْنِي هِيجُوا بِي  فَأَغْرَيْنَا بَيْنَهُمْ الْعَدَاوَةَ وَالْبَغْضَاءَ",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 44,
        "matchingEnglishURN": 25990,
        "last_updated": null
    }
]