[
    {
        "englishURN": 1612750,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1408,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"There are two statements that are light for the tongue to remember, heavy in the Scales and are dear to the Merciful: 'Subhan-Allahi wa bihamdihi, Subhan-Allahil-Azim <b>[Glory be to Allah and His is the praise, (and) Allah, the Greatest is free from imperfection]'</b>.\"<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1713980,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612760,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1409,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"The uttering of the words: \"Subhan-Allah (Allah is free from imperfection), Al-hamdu lillah (all praise is due to Allah), La ilaha illallah (there is no true god except Allah) and Allahu Akbar (Allah is the Greatest)' is dearer to me than anything over which the sun rises.\"<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1713990,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612770,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1410,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"He who utters a hundred times in a day these words: 'La ilaha illallahu, wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, wa Huwa 'ala kulli sha'in Qadir (there is no true god except Allah. He is One and He has no partner with Him; His is the sovereignty and His is the praise, and He is Omnipotent),' he will have a reward equivalent to that for emancipating ten slaves, a hundred good deeds will be recorded to his credit, hundred of his sins will be blotted out from his scroll, and he will be safeguarded against the devil on that day till the evening; and no one will exceed him in doing more excellent good deeds except someone who has recited these words more often than him. And he who utters: 'Subhan-Allahi wa bihamdihi (Allah is free from imperfection and His is the praise)' one hundred times a day, his sins will be obliterated even if they are equal to the extent of the foam of the ocean.\"<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1714000,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612780,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1411,
        "hadithText": "Abu Ayyub Al-Ansari (May Allah be pleased with him) reported: The Prophet (ﷺ) said: \"He who utters ten times: 'La ilaha illallahu, wahdahu la sharika lahu, lahulmulku wa lahulhamdu, wa Huwa 'ala kulli sha'in Qadir (there is no true god except Allah. He is One and He has no partner with Him. His is the sovereignty and His is the praise, and He is Omnipotent),' he will have a reward equal to that for freeing four slaves from the progeny of Prophet Isma'il.\"<br><br><b>[Al- Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1714010,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612790,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1412,
        "hadithText": "Abu Dharr (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said to me, \"Shall I tell you the expression that is most loved by Allah?\" It is 'Subhan-Allahi wa bihamdihi' (Allah is free from imperfection and His is the praise)'.\"<br><br><b>[Muslim]</b>.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1714020,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612800,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1413,
        "hadithText": "Abu Malik Al-Ash'ari (may Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said: \"Purity is half of iman (faith). ‘Al-hamdu lillah (all praise and gratitude belong to Allah)’ fills the scales, and ‘subhan-Allah (how far is Allah from every imperfection) and ‘Al-hamdulillah (all praise and gratitude belong to Allah)’ fill that which is between heaven and earth.\"<br><p>\n<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1714030,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612810,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1414,
        "hadithText": "Sa'd bin Abu Waqqas (May Allah be pleased with him) reported: A bedouin came to the Messenger of Allah (ﷺ) and said to him, \"Teach me a few words to recite frequently.\" He (ﷺ) said, \"Say: \"La ilaha illallahu wahdahu la sharika lahu; Allahu Akbar kabiran, wal-hamdu lillahi kathiran, wa subhan-Allahi Rabbil-'alamin; wa la hawla wa la quwwata illa billahil-'Azizil-Hakim (there is no true god except Allah the One and He has no partner with Him; Allah is the Greatest and greatness is for Him. All praise is due to Him. Allah, the Rubb of the worlds is free from imperfection; there is no might and power but that of Allah, the All-Powerful and the All-Wise.)\"' The bedouin said: \"All of these for my Rubb. But what is for me?\" Thereupon he (Messenger of Allah (ﷺ)) said, \"You should say: 'Allahummaghfir li, warhamni, wahdini, warzuqni (O Allah! Grant me pardon, have mercy upon me, direct me to righteousness and provide me subsistence)'.\"<br><br><b>[Muslim]</b>.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1714040,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612820,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1415,
        "hadithText": "Thauban (May Allah be pleased with him) reported: Whenever the Messenger of Allah (ﷺ) concluded his prayer, he would beg forgiveness from Allah thrice and then would recite: \"Allahumma Antas- Salamu, wa minkas-salamu, tabarakta ya Dhal-Jalali wal-Ikram (O Allah, You are the Grantor of security, and security comes from You. You are Blessing, O You Who have majesty and nobility)!\" (Imam) Al-Awza'i, one of the narrators of this Hadith, was asked: \"How forgiveness is to be sought?\" He answered: \"The Messenger of Allah (ﷺ) used to say: 'Astaghfirullah! Astaghfirullah! (I beseech Allah for forgiveness, I beseech Allah for forgiveness)'.\"<br><br><b>[Muslim]</b>.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 1714050,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612830,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1416,
        "hadithText": "Al-Mughirah bin Shu'bah (May Allah be pleased with him) reported: Messenger of Allah (ﷺ) used to say at the conclusion of prayer: \"La ilaha illallahu wahdahu la sharika lahu, lahul-mulku, wa lahul-hamdu, wa Huwa 'ala kulli shai'in Qadir. Allahumma la mani'a lima a'tayta, wa la mu'tiya lima mana'ta, wa la yanfa'u dhal-jaddi, minkal-jaddu (there is no true god except Allah. He is One and He has no partner with Him, His is the sovereignty and His is the praise, and He is Omnipotent. O Allah! None can deny that which You bestow and none can bestow that which You hold back; and the greatness of the great will be of no avail to them against You).\"<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 1714060,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612840,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1417,
        "hadithText": "It has been reported that 'Abdullah bin Zubair (May Allah be pleased with them) used to recite after Taslim at the conclusion of every Salat (prayer): \"La ilaha illallahu wahdahu la sharika lahu, lahul- mulku, wa lahul-hamdu, wa Huwa 'ala kulli shai'in Qadir. La hawla wa la quwwata illa billah. La ilaha illallahu, wa la na'budu illa iyyahu, Lahun-ni'matu, wa lahul-fadlu, wa lahuth-thana'ul-hasan. La ilaha ilallahu, mukhlisina, lahud-dina, wa lau karihal-kafirun (there is no true god except Allah; He is One. To Him belongs the dominion and to Him is all praise, and He is Powerful over all things. There is no power and might except with (the help of) Allah. There is no God but Allah and we worship none except Him, to Him belongs the bounty and to Him belongs the grace, and to Him belongs all excellent praise; there is no deity but Allah. We reserve our devotion exclusively for Him though the disbelievers may detest it).\" Ibn Az-Zubair said: The Messenger of Allah (ﷺ) used to celebrate Allah's Greatness in those terms after every Salat (prayer).<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 1714070,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612850,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1418,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) reported: The poor Emigrants came to the Messenger of Allah (ﷺ) and said: \"The wealthy have gone with the highest ranks and lasting bliss.\" He asked: \"How is that?\" They replied: \"They offer Salat (prayer) as we offer it; they observe fast as we do; (and as they are wealthy) they perform Hajj and 'Umrah, and go for Jihad, and they spend in charity but we cannot, and they free the slaves but we are unable to do so.\" The Messenger of Allah (ﷺ) said, \"Shall I not teach you something with which you may overtake those who surpassed you and with which you will surpass those who will come after you? None will excel you unless he who does which you do.\" They said: \"Yes, please do, O Messenger of Allah\" He (ﷺ) said, \"You should recite: Tasbih (Allah is free from imperfection), Takbir (Allah is Greatest), Tahmid (Praise be to Allah) thirty-three times after each Salat.\"<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br>Abu Salih, the subnarrator of the Hadith said, when Abu Hurairah (May Allah be pleased with him) was asked about the manner of reciting Tasbih, Tahmid and Takbir, he said, \"Recite: \"Subhan-Allah, wal-hamdulillah, wallahu Akbar', till all are recited thirty-three times.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 1714080,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612860,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1419,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"He who recites after every prayer: Subhan-Allah (Allah is free from imperfection) thirty-three times; Al-hamdu lillah (praise be to Allah) thirty-three times; Allahu Akbar (Allah is Greatest) thirty-three times; and completes the hundred with: La ilaha illallahu, wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, wa Huwa 'ala kulli shai'in Qadir (there is no true god except Allah. He is One and He has no partner with Him. His is the sovereignty and His is the praise, and He is Omnipotent), will have all his sins pardoned even if they may be as large as the foam on the surface of the sea.\"<br><br><b>[Muslim]</b>.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 1714090,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612870,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1420,
        "hadithText": "Ka'b bin 'Ujrah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"There are some words, the reciters of which will never be disappointed. These are: Tasbih <b>[saying 'Subhan-Allah' (Allah is free from imperfection)]</b>, thirty-three times, Tahmid <b>[saying 'Al-hamdu lillah' (praise be to Allah)]</b> thirty-three times and Takbir <b>[saying 'Allahu Akbar' (Allah is Greatest)]</b> thirty-four times; and these should be recited after the conclusion of every prescribed prayer.\"<br><br><b>[Muslim]</b><br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 1714100,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612880,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1421,
        "hadithText": "Sa'd bin Abu Waqqas (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) used to seek (Allah's) protection after prayers in these words: \"Alla-humma inni a'udhu bika minal-jubni wal- bukhl, wa a'udhu bika min an uradda ila ardhalil-'umur, wa a'udhu bika min fitnatid-dunya, wa a'udhu bika min fitnatil-qabr (O Allah, I seek refuge with You from cowardice, miserliness and from being sent back to a feeble age; and, seek refuge with You from the trials of this life and those of the grave).\"<br><br><b>[Al- Bukhari]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 1714110,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612890,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1422,
        "hadithText": "Mu'adh (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) took hold of my hand and said, \"O Mu'adh! By Allah I love you, so I advise you to never forget to recite after every prayer: \"Allahumma a'inni ala dhikrika, wa shukrika, wa husni 'ibadatika (O Allah, help me remember You, to be grateful to You, and to worship You in an excellent manner).\"<br><br><b>[Abu Dawud]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 1714120,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612900,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1423,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"When anyone of you has done his Tashahhud during Salat (prayer), he should seek refuge in Allah against four things and say: \"Allahumma inni a'udhu bika min 'adhabi jahannam, wa min 'adhabil-qabr, wa min fitnatil-mahya wal-mamat, wa min sharri fitnatil-masihid-dajjal (O Allah! I seek refuge in You from the torment of Hell, from the torment of the grave, from the trials of life and death, and from the mischief of Al-Masih Ad-Dajjal (Antichrist).\"<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 1714130,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612910,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1424,
        "hadithText": "'Ali (May Allah be pleased with him) reported: When the Messenger of Allah (ﷺ) was in Salat (prayer), he used to supplicate towards the end of prayer after Tashahhud and before the concluding salutations: \"Allahum-maghfir li ma qaddamtu wa ma akh-khartu, wa ma asrartu, wa ma a'lantu, wa ma asraftu, wa ma Anta a'lamu bihi minni. Antal-Muqqadimu, wa Antal-Mu'akh-khiru. La ilaha illa Anta (O Allah! Forgive my former and latter sins, which I have done secretly and those which I have done openly, and that I have wronged others, and those defaults of mine about which You have better knowledge than I have. You Alone can send whomever You will to Jannah, and You Alone can send whomever You will to Hell-fire. None has the right to be worshipped but You.\"<br><br><b>[Muslim]</b>.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 1714140,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612920,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1425,
        "hadithText": "'Aishah (May Allah be pleased with her) reported: The Prophet (ﷺ) used to recite frequently in his bowing and prostration: \"Subhanak- Allahumma, Rabbana wa bihamdika. Allahum-maghfir li (O Allah! You are free from imperfection and I begin with praising You. Forgive my sins).\"<br><br><b>[Al-Bukhari and Muslim]</b>.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 1714150,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612930,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1426,
        "hadithText": "'Aishah (May Allah be pleased with her) reported: The Messenger of Allah (ﷺ) used to recite in his bowing and prostration: \"Subbuhun Quddusun, Rabbul-mala'ikati war-ruh <b>[You are the Most Glorious. The Most Holy. You the Rubb of the angels and of Jibril<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 1714160,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612940,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1427,
        "hadithText": "Ibn 'Abbas (May Allah be pleased with them) reported: The Messenger of Allah (ﷺ) said: \"Glorify your Lord in Ruku' (bowing posture) and exert yourself in supplication in prostration. Thus your supplications are liable to be accepted.\"<br><br><b>[Muslim]</b>.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 1714170,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612950,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1428,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"A slave becomes nearest to his Rubb when he is in prostration. So increase supplications while prostrating.\"<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 1714180,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612960,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1429,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) used to say in his prostration: Allahum-maghfir li dhanbi kullahu: diqqahu wa jillahu, wa 'awwalahu wa akhirahu, wa alaniyatahu wa sirrahu (O Allah! Forgive all my sins, the small and the great, first and the last, the open and the secret).\"<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 1714190,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612970,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1430,
        "hadithText": "'Aishah (May Allah be pleased with her) reported: One night I missed the Messenger of Allah (ﷺ) from his bed. I searched for him. When I found him he was in bowing or prostrating posture and was reciting: Subhanaka wa bi hamdika. La ilaha illa Anta (You are free from imperfection and I begin praising You. There is no true god except You).\"<br><br>Another narration is: My hand fell over his feet while he was in prostration with his feet erect. He was supplicating: \"Allahumma inni a'udhu biridaka min sakhatika, wa bi-mu'afatika min 'uqubatika, wa a'udhu bika minka, la uhsi thana'an 'alaika, Anta kama athnaita 'ala Nafsika (O Allah! I seek protection against Your Wrath in Your Pleasure. I seek protection in Your Pardon against Your chastisement, I am not capable of enumerating praise of You. You are as You have lauded Yourself).\"</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 1714200,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612980,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1431,
        "hadithText": "Sa'd bin Abu Waqqas (May Allah be pleased with him) reported: We were with the Messenger of Allah (ﷺ) when he asked, \"Is anyone of you unable to earn a thousand good deeds?\" One of those present asked: \"How can one earn thousand good deeds in a day?\" He (ﷺ) replied, \"By saying: Subhan Allah a hundred times, then one thousand good deeds will be recorded for him or one thousand sins will be blotted out from his record.\"<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 1714210,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1612990,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1432,
        "hadithText": "Abu Dharr (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"Every morning charity is due from every joint bone of the body of every one of you. Every utterance of Allah's Glorification (i.e., Subhan-Allah) is an act of charity, and every utterance of praise of Him (i.e., Al-hamdu lillah) is an act of charity, and every utterance of profession of Faith (i.e., La ilaha illallah) is an act of charity, and every utterance of His Greatness (i.e., Allahu Akbar) is an act of charity; and enjoining good is an act of charity and forbidding what is disreputable is an act of charity; and two Rak'ah prayer which one offers in the forenoon (Ad- Duha) will suffice for all this.\"<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 1714220,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613000,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1433,
        "hadithText": "Juwairiyah bint Al-Harith (May Allah be pleased with her), the Mother of the Believers, reported: The Prophet (ﷺ) came out from my apartment in the morning as I was busy in performing the dawn prayer. He came back in the forenoon and found me sitting there. The Prophet (ﷺ) said, \"Are you still in the same position as I left you.\" I replied in the affirmative. Thereupon the Prophet said, \"I recited four words three times after I had left you. If these are to be weighed against all you have recited since morning, these will be heavier. These are: Subhan-Allahi wa bihamdihi, `adada khalqihi, wa rida nafsihi, wa zinatah `arshihi, wa midada kalimatihi <b>[Allah is free from imperfection and I begin with His praise, as many times as the number of His creatures, in accordance with His Good Pleasure, equal to the weight of His Throne and equal to the ink that may be used in recording the words (for His Praise)]</b>.\"<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 1714230,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613010,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1434,
        "hadithText": "Abu Musa Al-Ash'ari (May Allah be pleased with him) reported: The Prophet (ﷺ) said, \"The similitude of one who remembers his Rubb and one who does not remember Him, is like that of the living and the dead.\"<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 1714240,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613020,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1435,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"Allah the Exalted says: 'I am as my slave expects me to be, and I am with him when he remembers Me. If he remembers Me inwardly, I will remember him inwardly, and if he remembers Me in an assembly, I will remember him in a better assembly (i.e., in the assembly of angels).\"<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 1714250,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613030,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1436,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"The Mufarridun have gone ahead.\" He was asked, \"Who are the Mufarridun?\" He (ﷺ) replied, \"Those men and women who frequently celebrate the remembrance of Allah.\"<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 1714260,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613040,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1437,
        "hadithText": "Jabir (May Allah be pleased with him) reported: I heard the Messenger of Allah (ﷺ) saying, \"The best way to celebrate the remembrance of Allah is to say: La ilaha illallah (there is no true god except Allah).\"<br><br><b>[At-Tirmidhi]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 1714270,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613050,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1438,
        "hadithText": "'Abdullah bin Busr (May Allah be pleased with him) reported: One of the Companions said, \"O Messenger of Allah. There are many injunctions of Islam for me. So tell me something to which I may hold fast.\" He said, \"Keep your tongue wet with the remembrance of Allah.\"<br><br><b >[At-Tirmidhi]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 1714280,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613060,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1439,
        "hadithText": "Jabir (May Allah be pleased with him) reported: The Prophet (ﷺ) said, \"For him who says: 'Subhan-Allahi wa bi hamdihi (Allah is free from imperfection, and I begin with praising Him, and to Him),' a palm-tree will be planted in Jannah.\"<br><br><b>[At- Tirmidhi]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 1714290,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613070,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1440,
        "hadithText": "Ibn Mas'ud (May Allah be pleased with him) reported: Messenger of Allah (ﷺ) said, \"I met Ibrahim (ﷺ) on the Night of Ascension (Al-Asra), and he said to me: 'O Muhammad, convey my greetings to your Ummah, and tell them that Jannah has a vast plain of pure soil and sweet water. It is a plain levelled land. The plants grow there by uttering: Subhan-Allah, Al-hamdu lillah, La ilaha illallah and Allahu Akbar (Allah is free from imperfection; praise be to Allah; there is no true god except Allah; and Allah is Greatest).\"<br><br><b>[At- Tirmidhi]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 1714300,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613080,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1441,
        "hadithText": "Abud-Darda (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"Shall I not inform you of the best of your actions which are the purest to your Rubb, which exalt you to the high ranks, which are more efficacious than spending gold and silver (in charity), and better for you than you should encounter your enemies whom you will smite their necks and they will smite your necks?\" They said, \"Certainly.\" He (ﷺ) said, \"Remembrance of Allah the Exalted.\"<br><br><b>[At-Tirmidhi]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 1714310,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613090,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1442,
        "hadithText": "Sa'd bin Abu Waqqas (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) and I went to see a woman. She had date- stones or pebbles in front of her, and she was counting and reciting Tasbih. <b>['Subhan-Allah' (Allah is free from imperfection)]</b>. He said, \"Shall I not inform you of what is easier or better than this for you?\" You should say: 'Subhan-Allahi 'adada ma khalaqa fis-sama', wa subhan-Allahi 'adada ma khalaqa fil-ardi, wa subhan-Allahi 'adada ma baina dhalika, wa subhan-Allahi 'adada ma Huwa Khaliqun, wallahu Akbaru mithla dhalika, wal-hamdu lillahi mithla dhalika, wa la ilaha illallahu mithla dhalika, wa la hawla wa la quwwata illa billahi mithla dhalika (Subhan-Allah, equal to the number of what He created in the heaven; and Subhan-Allah, equal to the number of His creatures in the earth; and Subhan-Allah, equal to the number in between them; and Subhan-Allah equal to the number of those He will create).' Then say: 'Allahu Akbar' (Allah is Greatest) in the same way. Then say: 'Al-hamdu lillah' (praise be to Allah) in the same way. Then say: 'La ilaha illallah' (there is no true god except Allah) in the same way. Then say: 'La hawla wa la quwwata illa billah' (there is no change of a condition nor power except by Allah) in the same manner.\"<br><br><b >[At-Tirmidhi]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 1714320,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613100,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "244.00",
        "babName": "The Excellence of the Remembrance of Allah",
        "hadithNumber": 1443,
        "hadithText": "Abu Musa (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said to me, \"Shall I not guide you to a treasure from the treasures of Jannah?\" I said: \"Yes, O Messenger of Allah!\" Thereupon he (ﷺ) said, \"(Recite) 'La hawla wa la quwwata illa billah' (There is no change of a condition nor power except by Allah).\"<br><br><b >[Al-Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 1714330,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613110,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "245.00",
        "babName": "Remembrance of Allah in all Conditions",
        "hadithNumber": 1444,
        "hadithText": "'Aishah (May Allah be pleased with her) reported: The Messenger of Allah (ﷺ) used to remember Allah at all times.<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 1714340,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613120,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "245.00",
        "babName": "Remembrance of Allah in all Conditions",
        "hadithNumber": 1445,
        "hadithText": "Ibn 'Abbas (May Allah be pleased with them) reported: The Prophet (ﷺ) said, \"If anyone intends to have (sexual intercourse) with his wife, he should say: \"Bismillah! Allahumma janibnash-Shaitana, wa jannibish-Shaitana ma razaqtana (In the Name of Allah, O Allah! Keep us away from Satan and keep Satan away from what You have bestowed upon us);' and if Allah has ordained a child for them, Satan will never harm him.\"<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 1714350,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613130,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "247.00",
        "babName": "The Excellence of Gathering in which Allah is Remembered",
        "hadithNumber": 1447,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"Allah, the Exalted, has teams of angels who go about on the roads seeking those who remember Allah. When they find some people remembering Allah they call to one another and say, 'Come to what you are looking for;' and they surround them with their wings till the space between them and the lowest sky is fully covered. Allah, the Exalted and Glorious, asks them (although He is best informed about every thing): 'What are my slave saying?' They say: 'They are glorifying Your Tasbih, Tahmid, Takbir, Tamjid, (i.e., they were declaring Your Perfectness, praising, remembering the Greatness and Majesty of Allah).' He asks: 'Have they seen Me?' They reply, 'No, indeed, they have not seen You.' He asks: 'How would they act if they were to see Me?' Thereupon they reply: 'If they were to see You, they would engage more earnestly in worshipping and glorifying You and would extol You more.' He would say: 'What do they beg of Me?' They say, 'They beg You for Your Jannah.' Allah says, 'Have they seen My Jannah?' They say, 'No, our Rubb.' He says: 'How would they act if they were to see My Jannah?' They reply, 'Were they to see it, they would more intensely eager for it.' They (the angels) say, 'They seek Your Protection.' He asks, 'Against what do they seek My Protection?' They (the angels) say, 'Our Rubb, from the fire of Hell.' (He, the Rubb) says, 'Have they seen the fire of Hell?' They say, 'No. By Your Honour, they have not seen it.' He says: 'How would they act if they were to see My Fire?' They say: 'If they were to see it, they would more earnest in being away from it and fearing it. They beg of Your forgiveness.' He says: 'I call you to witness that I hereby grant pardon to them and confer upon them what they ask for; and grant them protection against what they seek protection from.' One of the angels says: 'Our Rubb, there is amongst them such and such slave who does not belong to the assembly of those who are participating in Your remembrance. He passed by them and sat down with them.' He says: 'I also grant him pardon because they are the people by virtue of whom their associates will not be unfortunate'.\"<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br>(The narration in Muslim is also the same with minor changes in wordings).<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 1714370,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613140,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "247.00",
        "babName": "The Excellence of Gathering in which Allah is Remembered",
        "hadithNumber": 1448,
        "hadithText": "Abu Hurairah and Abu Sa'id Al-Khudri (May Allah be pleased with them) reported: The Messenger of Allah (ﷺ) said, \"When a group of people assemble for the remembrance of Allah, the angels surround them (with their wings), (Allah's) mercy envelops them, Sakinah, or tranquillity descends upon them and Allah makes a mention of them before those who are near Him.\"<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 1714380,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613150,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "247.00",
        "babName": "The Excellence of Gathering in which Allah is Remembered",
        "hadithNumber": 1449,
        "hadithText": "Abu Waqid Al-Harith bin 'Auf (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) was sitting in the mosque with his Companions when three people came to him. Two of them stepped forward to the Messenger of Allah (ﷺ) and the third went away. Those two men stood by the side of Messenger of Allah (ﷺ). One of them found a space in the circle and he filled it, while the other one sat behind him. When the Messenger of Allah (ﷺ) finished, he said, \"Shall I not inform you about these three people? One of them sought refuge with Allah and Allah gave him refuge; the second one felt shy and Allah showed kindness to his shyness (and so he was accommodated in that meeting), and the last one averted, and so Allah turned away His Attention from him.\"<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 1714390,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613160,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "247.00",
        "babName": "The Excellence of Gathering in which Allah is Remembered",
        "hadithNumber": 1450,
        "hadithText": "Abu Sa'id Al-Khudri (May Allah be pleased with him) reported: Mu'awiyah (May Allah be pleased with him) came to an assembly in the mosque and asked them: \"What has made you sit together?\" They replied, \"We are sitting here to remember Allah.\" He said, \"I adjure you by Allah to tell me whether nothing else has made you to sit together.\" They replied: \"By Allah! We are sitting only to remember Allah.\" Then he said, \"I did not adjure you because I suspected you. No one of my rank in the eyes of the Messenger of Allah (ﷺ) is the narrator of so few traditions as I am. The fact is that the Messenger of Allah (ﷺ) went out to a circle of his Companions and said, 'What has made you sit there?' When they replied that they are sitting together to remember Allah and to praise Him for guiding them to Islam and bestowing favours on them, he (ﷺ) said, 'I adjure you by Allah to tell me that nothing else has made you sit together.' On their reply that there was certainly no other purpose, he (ﷺ) said, 'I did not adjure you because I suspected you, but Jibril (Gabriel) came to me and told me that Allah was talking proudly of you to the angels.\"'<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 1714400,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613170,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "248.00",
        "babName": "Remembrance of Allah in the Morning and in the Evening",
        "hadithNumber": 1451,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"He who recites in the morning and in the evening the statement: 'Subhan-Allahi wa bihamdihi (Allah is free from imperfection and I begin with praising Him)' one hundred times, will not be surpassed on the Day of Resurrection by anyone with better deeds than one who utters the same words or utters more of these words.\"<br><br><b>[Muslim]</b>.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 1714410,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613180,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "248.00",
        "babName": "Remembrance of Allah in the Morning and in the Evening",
        "hadithNumber": 1452,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) reported: A man came to the Prophet (ﷺ) and said, \"What a trouble I suffered from a scorpion which stung me last night!\" He (ﷺ) said, \"Had you said in the evening: 'A'udhu bikalimatillahit-tammati min sharri ma khalaqa (I seek the protection of Allah's Perfect Words from the evil of whatever He has created),' it would not have harmed you.\"<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 1714420,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613190,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "248.00",
        "babName": "Remembrance of Allah in the Morning and in the Evening",
        "hadithNumber": 1453,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) reported: The Prophet (ﷺ) used to say in the morning: \"Allahumma bika asbahna, wa bika amsaina, wa bika nahya, wa bika namutu, wa ilaikan-nushur (O Allah! With Your Power we have come to the morning, with Your Power we come to the evening, with Your Power we live, and we die, and to You will we return).\" In the evening he would say: \"Allahumma bika amsaina, wa bika nahya, wa bika namutu, wa ilaikan-nushur (O Allah! With Your Power, we have come to the evening, by You do we live, by You do we die, and to You is the return).\"<br><br><b>[At-Tirmidhi and Abu Dawud]</b>.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 1714430,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613200,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "248.00",
        "babName": "Remembrance of Allah in the Morning and in the Evening",
        "hadithNumber": 1454,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) reported: Abu Bakr asked, \"O Messenger of Allah! Teach me some words so that I may recite them in the morning and in the evening.\" The Messenger of Allah (ﷺ) said, \"Recite these words: 'Allahumma fatiras-samawati wal-ardi, 'alimal-ghaibi wash-shahadati, Rabba kulli shai'in wa malikahu. Ash- hadu an la ilaha illa Anta, a'udhu bika min sharri nafsi, wa sharrish- Shaitani wa shirkihi (O Allah! Creator of the heavens and the earth! Knower of the hidden and the exposed! Rubb of everything and every one. I bear witness that none has the right to be worshipped but You. I seek Your Protection from the evil of my own self from the evil of Satan and from the evil of Shirk to which he calls).\"' The Messenger of Allah (ﷺ) added: \"Recite these words in the morning and the evening and when you go to bed.\"<br><br><b>[Abu Dawud and At- Tirmidhi]</b>.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 1714440,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613210,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "248.00",
        "babName": "Remembrance of Allah in the Morning and in the Evening",
        "hadithNumber": 1455,
        "hadithText": "'Abdullah bin Mas'ud (May Allah be pleased with him) reported: When it was evening, the Prophet (ﷺ) used to supplicate: \"Amsaina wa amsal-mulku lillah, wal-hamdu lillah. La 'ilaha illallahu wahdahu la sharika lahu (We have entered upon evening and the whole kingdom of Allah, too, has entered upon evening. Praise is due to Allah. There is none who has the right to be worshiped but Allah, the One who has no partner with Him).\" He (the narrator) said: I think that he (ﷺ) used to follow the recitation with these words: \"Lahul-mulku, wa lahul-hamdu, wa Huwa 'ala kulli shi'in Qadir. Rabbi as'aluka khaira ma fi hadhihil-lailati, wa khaira ma ba'daha; wa a'udhu bika min sharri ma fi hadhihil-lailati, wa sharri ma ba'daha; Rabbi a'udhu bika minal- kasali, wa su'il-kibari; Rabbi a'udhu bika min 'adhabin fin-nari, wa 'adhabin fil-qabri (His is the sovereignty and to Him is all praise due, and He is Omnipotent. My Rubb, I beg of you good that lies in this night and good that follows it, and I seek refuge in You from the evil that lies in this night and from the evil of that which follows it. My Rubb! I seek refuge in You from lethargy and the misery of old age. O Allah! I seek Your Protection from the torment of Hell-fire and the punishment of the grave).\" When it was morning, he (ﷺ) would recite the same, replacing the words: \"We have entered upon evening and the whole kingdom of Allah, too, has entered upon evening\" with \"We have entered upon morning and the whole kingdom of Allah entered upon morning.\" (Replace the words \"Amsaina, amsa, hadhihil-lailati, ma ba'daha with Asbahna, asbaha, hadhal-yaumi, ma ba'dahu, respectively.)<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 1714450,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613220,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "248.00",
        "babName": "Remembrance of Allah in the Morning and in the Evening",
        "hadithNumber": 1456,
        "hadithText": "'Abdullah bin Khubaib (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said to me, \"Recite Surat Al-Ikhlas and Al- Mu'awwidhatain (Surat Al-Falaq and Surat An-Nas) three times at dawn and dusk. It will suffice you in all respects.\"<br><br><b>[Abu Dawud and At-Tirmidhi]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 1714460,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613230,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "248.00",
        "babName": "Remembrance of Allah in the Morning and in the Evening",
        "hadithNumber": 1457,
        "hadithText": "'Uthman bin 'Affan (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"He who recites three times every morning and evening: 'Bismillahil-ladhi la yadurru ma'as-mihi shai'un fil-ardi wa la fis-sama'i, wa Huwas-Sami'ul-'Alim (In the Name of Allah with Whose Name there is protection against every kind of harm in the earth or in the heaven, and He is the All-Hearing and All- Knowing),' nothing will harm him.\"<br><br><b>[Abu Dawud and At- Tirmidhi]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 1714470,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613240,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "249.00",
        "babName": "Supplication before going to Bed",
        "hadithNumber": 1458,
        "hadithText": "Hudhaifah and Abu Dharr (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) used to supplicate when he went to bed at night: \"Bismik-Allahumma ahya wa amut (With Your Name, O Allah, I expire and return to life).\"<br><br><b>[Al- Bukhari]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 1714480,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613250,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "249.00",
        "babName": "Supplication before going to Bed",
        "hadithNumber": 1459,
        "hadithText": "'Ali (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said to me and to Fatimah (May Allah be pleased with her) (Ali's wife and the Prophet's daughter), \"When you go to bed, recite: Takbir (Allahu Akbar) thirty-three times and Tasbih (Subhan-Allah) thirty-three times and Tahmid (Al-hamdu lillah) thirty-three times.\"<br><br>Another narration is: The Messenger of Allah (ﷺ) said, \"Recite Tasbih thirty-four times.\"<br><br>Another narration is: The Messenger of Allah(ﷺ) said, \"Recite Takbir thirty-four times.\"<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 1714490,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613260,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "249.00",
        "babName": "Supplication before going to Bed",
        "hadithNumber": 1460,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"When any of you goes to bed, he should shake off (or dust off) his bedsheet because he does not know what might have fallen on it after he had left it. Then he should recite: 'Bismika Rabbi wada'tu janbi, wa bika arfa'uhu, in amsakta nafsi farhamha, wa in arsaltaha fahfazha bima tahfazu bihi 'ibadakas-salihin <b>[With Your Name, my Rubb, I place my side (upon the bed) and with Your Grace I will raise it up. If You withhold my soul (cause me to die), have mercy on it but if You let it go (let me live), guard it against which You guarded Your pious slaves]</b>.\"'<br><br><b>[Al- Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 1714500,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613270,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "249.00",
        "babName": "Supplication before going to Bed",
        "hadithNumber": 1461,
        "hadithText": "'A ishah (May Allah be pleased with her) reported: Whenever the Messenger of Allah (ﷺ) went to bed, he would blow upon his hands recite Al-Mu'awwidhat; and pass his hands over his body.<br><br><b >[Al-Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 1714510,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613280,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "249.00",
        "babName": "Supplication before going to Bed",
        "hadithNumber": 1462,
        "hadithText": "Al-Bara' bin 'Azib (May Allah be pleased with them) reported: The Messenger of Allah (ﷺ) said, \"Whenever you intend to go to bed, perform Wudu' as is done for Salat (prayer); and then lie down on the right side and recite: 'Allahumma aslamtu nafsi ilaika, wa fawwadtu amri ilaika, wal-ja'tu zahri ilaika, raghbatan wa rahbatan ilaika, la malja'a wa la manja minka illa ilaika, amantu bikitabik-alladhi anzalta, wa binabiyyik-alladhi arsalta <b>[O Allah! I have submitted myself to You. I have turned my face to You, entrusted my affairs to You and relied completely on You out of desire for and fear of You (expecting Your reward and fearing Your punishment). There is no resort and no deliverer from (hardships) except You. I affirm my faith in Your Book which You have revealed, and in Your Prophet whom You have sent]</b>.' If you die during the night, you will die in the true religion. Let these words be your last words at night.\"<br><br><b>[Al- Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 1714520,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613290,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "249.00",
        "babName": "Supplication before going to Bed",
        "hadithNumber": 1463,
        "hadithText": "Anas (May Allah be pleased with him) reported: Whenever the Prophet (ﷺ) went to his bed, he would say: \"Al-hamdu lillah-illadhi at'amana wa saqana, wa kafana wa awana, fakam mimman la kafiya lahu wa la mu'wiya (Praise is due to Allah Who has fed us, provided us drink, satisfied us and gave us protection. Many are those who have no one to provide for them, or give them shelter).\"<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 1714530,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613300,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "249.00",
        "babName": "Supplication before going to Bed",
        "hadithNumber": 1464,
        "hadithText": "Hudhaifah (May Allah be pleased with him) reported: Whenever the Messenger of Allah (ﷺ) intended to go to sleep, he would place his right hand under his (right) cheek and supplicate: \"Allahumma qini 'adhabaka yauma tab'athu 'ibadaka (O Allah! Guard me against Your punishment on the Day when You will resurrect Your slaves).\"<br><br><b >[At-Tirmidhi]</b>.<br><br>In a narration in Abu Dawud, Hafsah (May Allah be pleased with her) said: Before going to sleep the Messenger of Allah (ﷺ) would recite this Du'a three times.<br><br></b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 1714540,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1613125,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of the Remembrance of Allah",
        "babNumber": "246.00",
        "babName": "The Book of the Etiquette of Sleeping, Lying, and Sitting etc",
        "hadithNumber": 1446,
        "hadithText": "Hudhaifah and Abu Dharr (May Allah be pleased with him) reported: Whenever the Messenger of Allah (ﷺ) went to bed, he would supplicate: \"Bismika-Allahumma amut wa ahya (With Your Name, O Allah, I die and return to life)\"; and when he woke up, he would supplicate thus: \"Al-hamdu lillahilladhi ahyana ba'da ma amatana, wa ilaihin-nushur (All praise belongs to Allah Who has restored us back to life after causing us to die; and to Him shall we return).\"<br><p>\n<br><p>\n[Al-Bukhari]</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 1714360,
        "last_updated": "2020-08-16 22:09:35"
    }
]