[
    {
        "englishURN": 1616590,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "371.00",
        "babName": "Seeking Forgiveness",
        "hadithNumber": 1869,
        "hadithText": "Al-Agharr Al-Muzani (May Allah be pleased with him) said: The Messenger of Allah (ﷺ) said, \"Sometimes I perceive a veil over my heart, and I supplicate Allah for forgiveness a hundred times in a day.\"<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1718570,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616600,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "371.00",
        "babName": "Seeking Forgiveness",
        "hadithNumber": 1870,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) said: I heard the Messenger of Allah (ﷺ) saying, \"I swear by Allah that I seek Allah's Pardon and turn to Him in repentance more than seventy times a day.\"<br><br><b>[Al-Bukhari]</b>.</b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1718580,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616610,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "371.00",
        "babName": "Seeking Forgiveness",
        "hadithNumber": 1871,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) said: The Messenger of Allah (ﷺ) said, \"By the One in Whose Hand my soul is! If you do not commit sins, Allah would replace you with a people who would commit sins and seek forgiveness from Allah; and Allah will certainly forgive them.\"<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1718590,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616620,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "371.00",
        "babName": "Seeking Forgiveness",
        "hadithNumber": 1872,
        "hadithText": "Ibn 'Umar (May Allah be pleased with them) said: We counted Messenger's saying a hundred times during one single sitting: Rabb- ighfir li, wa tubb 'alayya, innaka Antat-Tawwabur-Rahim. (My Rubb! Forgive me and pardon me. Indeed, You are the Oft-Returning with compassion and Ever Merciful.\"<br><br><b>[Abu Dawud and At- Tirmidhi]</b>.<br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1718600,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616630,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "371.00",
        "babName": "Seeking Forgiveness",
        "hadithNumber": 1873,
        "hadithText": "Ibn 'Abbas (May Allah be pleased with them) said: The Messenger of Allah (ﷺ) said, \"If anyone constantly seeks pardon (from Allah), Allah will appoint for him a way out of every distress and a relief from every anxiety, and will provide sustenance for him from where he expects not.\"<br><br><b>[Abu Dawud]</b>.<br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1718610,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616640,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "371.00",
        "babName": "Seeking Forgiveness",
        "hadithNumber": 1874,
        "hadithText": "Ibn Mas'ud (May Allah be pleased with him) said: The Messenger of Allah (ﷺ) said, \"He who says: 'Astaghfir ullah-alladhi la ilaha illa Huwal-Haiyul-Qayyumu, wa atubu ilaihi (I seek the forgiveness of Allah, there is no true god except Allah, the Ever-Living, the Self- Subsisting, and I turn to Him in repentance),' his sins will be forgiven even if he should have run away from the battlefield (while he was engaged in fighting for the Cause of Allah).\"<br><br><b>[Abu Dawud, At-Tirmidhi and Al-Hakim (on conditions of Al-Bukhari and Muslim for accepting Hadith)]</b>.<br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1718620,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616650,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "371.00",
        "babName": "Seeking Forgiveness",
        "hadithNumber": 1875,
        "hadithText": "Shaddad bin Aus (May Allah be pleased with him) said: The Prophet (ﷺ) said, \"The best supplication for seeking forgiveness (Syed-ul- Istighfar) is to say: 'Allahumma Anta Rabbi, la ilaha illa Anta, khalaqtani wa ana 'abduka, wa ana 'ala 'ahdika wa wa'dika mastata'tu, a'udhu bika min sharri ma sana'tu, abu'u laka bini'matika 'alayya, wa abu'u bidhanbi faghfir li, fa innahu la yaghfirudh-dhunuba illa Anta. (O Allah! You are my Rubb. There is no true god except You. You have created me, and I am Your slave, and I hold to Your Covenant as far as I can. I seek refuge in You from the evil of what I have done. I acknowledge the favours that You have bestowed upon me, and I confess my sins. Pardon me, for none but You has the power to pardon).' He who supplicates in these terms during the day with firm belief in it and dies on the same day (before the evening), he will be one of the dwellers of Jannah; and if anyone supplicates in these terms during the night with firm belief in it and dies before the morning, he will be one of the dwellers of Jannah.\"<br><br><b>[Al-Bukhari]</b>.</b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1718630,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616660,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "371.00",
        "babName": "Seeking Forgiveness",
        "hadithNumber": 1876,
        "hadithText": "Thauban (May Allah be pleased with him) reported: Whenever the Messenger of Allah (ﷺ) finished his Salat (prayer), he would beg forgiveness three times <b>[by saying, 'Astaghfirullah' (3 times)]</b> and then he would say: \"Allahumma Antas-Salamu, wa minkas-Salamu, tabarakta ya Dhal-Jalali wal-Ikram. (O Allah! You are the Bestower of security and security comes from You; Blessed are You. O Possessor of glory and honour).\" Imam Al-Auza'i (one of the subnarrators) of this Hadith was asked: \"How forgiveness should be sought?\" He replied: \"I say: Astaghfirullah, Astaghfirullah (I seek forgiveness from Allah. I seek forgiveness from Allah).\"<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 1718640,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616670,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "371.00",
        "babName": "Seeking Forgiveness",
        "hadithNumber": 1877,
        "hadithText": "'Aishah (May Allah be pleased with her) reported: Prior to his demise, the Messenger of Allah (ﷺ) used to supplicate frequently: Subhan Allahi wa bihamdihi; Astaghfirullaha wa atubu ilaihi (Allah is free from imperfection, and I begin with praising Him. I beg forgiveness from Allah and I turn to Him in repentance.\"<br><br><b >[Al-Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 1718650,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616680,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "371.00",
        "babName": "Seeking Forgiveness",
        "hadithNumber": 1878,
        "hadithText": "Anas (May Allah be pleased with him) said: I heard the Messenger of Allah (ﷺ) saying, \"Allah, the Exalted, has said: 'O son of Adam! I shall go on forgiving you so long as you pray to Me and aspire for My forgiveness whatever may be your sins. O son of Adam! I do not care even if your sins should pile up to the sky and should you beg pardon of Me, I would forgive you. O son of Adam! If you come to Me with an earthful of sins and meet Me, not associating anything with Me in worship, I will certainly grant you as much pardon as will fill the earth.\"'<br><br><b>[At-Tirmidhi]</b>.<br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 1718660,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616690,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "371.00",
        "babName": "Seeking Forgiveness",
        "hadithNumber": 1879,
        "hadithText": "Ibn 'Umar (May Allah be pleased with them) said: The Prophet (ﷺ) said, \"O women folk! You should give charity and be diligent in seeking Allah's forgiveness because I have seen (i.e., on the Night of the Ascension to the highest heavens) that dwellers of the Hell are women.\" A woman amongst them said: \"Why is it that the majority of the dwellers of Hell are women?\" The Prophet (ﷺ) replied, \"You curse frequently and are ungrateful to your husbands. In spite of your lacking in wisdom and failing in religion, you are depriving the wisest of men of their intelligence.\" Upon this the woman asked: \"What is the deficiency in our wisdom and in our religion?\" He (ﷺ) replied, \"Your lack of wisdom can be well judged from the fact that the evidence of two women is equal to that one man. You do not offer Salat (prayer) for some days and you do not fast (the whole of) Ramadan sometimes, it is a deficiency in religion.\"<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 1718670,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616700,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "372.00",
        "babName": "Some of the Bounties which Allah has prepared for the Believers in Paradise",
        "hadithNumber": 1880,
        "hadithText": "Jabir (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"The inhabitants of Jannah will eat and drink therein, but they will not have to pass excrement, to blow their noses or to urinate. Their food will be digested producing belch which will give out a smell like that of musk. They will be inspired to declare the freedom of Allah from imperfection and proclaim His Greatness as easily as you breathe.\"<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 1718680,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616710,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "372.00",
        "babName": "Some of the Bounties which Allah has prepared for the Believers in Paradise",
        "hadithNumber": 1881,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) said: The Messenger of Allah (ﷺ) said, \"Allah, the Exalted, has said: 'I have prepared for my righteous slaves what no eye has seen, no ear has heard, and the mind of no man has conceived.' If you wish, recite:<br><br>'No person knows what is kept hidden for them of joy as a reward for what they used to do.\"' (32:17)<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 1718690,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616720,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "372.00",
        "babName": "Some of the Bounties which Allah has prepared for the Believers in Paradise",
        "hadithNumber": 1882,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) said: The Messenger of Allah (ﷺ) said, \"The first group (of people) to enter Jannah will be shining like the moon on a full-moon night. Then will come those who follow them who will be like the most shining planet in the sky. They will not stand in need of urinating or relieving of nature or of spitting or blowing their noses. Their combs will be of gold and their sweat will smell like musk; in their censers the aloes-wood will be used. Their wives will be large eyed maidens. All men will be alike in the form of their father 'Adam, sixty cubits tall.\"<br><br>Another narration is: The Messenger of Allah (ﷺ) said, \"Their utensils will be of gold, their perspiration will smell like musk; everyone of them will have two wives; the marrow of the bones of the wives' legs will be seen through the flesh out of excessive beauty. They (i.e., the people of Jannah) will neither have difference, nor enmity (hatred) amongst themselves; their hearts will be as if one heart, and they will be glorifying Allah in the morning and in the afternoon.\"<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 1718700,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616730,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "372.00",
        "babName": "Some of the Bounties which Allah has prepared for the Believers in Paradise",
        "hadithNumber": 1883,
        "hadithText": "Al-Mughirah bin Shu'bah (May Allah be pleased with him) said: The Messenger of Allah (ﷺ) said, \"Musa (Moses) (ﷺ) asked his Rubb: 'Who amongst the inhabitants of Jannah will be the lowest in rank?' He said: 'It will be a person who will be admitted into Jannah last of all when all the dwellers of Jannah have entered Jannah. It will be said to him: Enter Jannah. But he will say: O my Rubb! How should I enter while the people have settled in their apartments and taken their shares? It will be said to him: Will you be satisfied and pleased if you have a kingdom like that of a monarch of the world? He will say: I will be content, my Rubb. Allah will say: For you is that, and like that and like that and like that and like that. He will say at the fifth time: I am well-pleased, my Rubb. Allah will say: It is for you and ten times more like it. You will have whatever your soul desires and whatever your eyes could delight in. He will say: I am well-pleased, my Rubb.' Musa (ﷺ) said: 'Who will be of the highest rank in Jannah.' Allah said: 'They are those whom I chose and I established their honour with My Own Hand. I attest with My Seal that they will be blessed with such bounties as no eye has seen, no ear has heard and no human mind has perceived.\"'<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 1718710,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616740,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "372.00",
        "babName": "Some of the Bounties which Allah has prepared for the Believers in Paradise",
        "hadithNumber": 1884,
        "hadithText": "'Abdullah bin Mas'ud (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"I know of the last of the inhabitants of the Hell to be taken out from there and the last one to enter Jannah. He is a man who will come out of the Fire, crawling on all fours. Allah, the Rubb of glory and honour will say to him: 'Go and enter Jannah.' He will go to it and think that it is full up. He will then come back and say: 'O my Rubb, it is full up.' Allah will say to him: 'Go and enter Jannah.' He will again go to it and think that it is full up. So he will turn back. Allah will again say: 'Go and enter Jannah. For you have what is equal to ten times the world.' He will say: 'Are You making fun of me while You are the King?\" At this I (i.e., the narrator) saw the Messenger of Allah (ﷺ) laugh till his premolars were visible and he said, \"Such man will be the last dweller of Jannah in its lowest rank.\"<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 1718720,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616750,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "372.00",
        "babName": "Some of the Bounties which Allah has prepared for the Believers in Paradise",
        "hadithNumber": 1885,
        "hadithText": "Abu Musa (May Allah be pleased with him) said: The Prophet (ﷺ) said, \"In Jannah the believer will have a tent made of a single hollowed pearl of which the length will be sixty miles in the sky. The believer will have his wives with him and he will visit them and they will not be able to see one another.\"<br><br><b>[Al-Bukhari and Muslim]</b>.</b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 1718730,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616760,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "372.00",
        "babName": "Some of the Bounties which Allah has prepared for the Believers in Paradise",
        "hadithNumber": 1886,
        "hadithText": "Abu Sa'id Al-Khudri (May Allah be pleased with him) said: The Prophet (ﷺ) said, \"There is a tree in Jannah that is so huge that if a rider of a swift horse has to cover its distance from one end to another in one hundred years, he will not be able to do so.\"<br><br>Another narration from Abu Hurairah (May Allah be pleased with him) is: The Messenger of Allah (ﷺ) said, \"A rider will not be able to cross its (the tree's) shade even after travelling for one hundred years.\"<br><br><b>[Al-Bukhari and Muslim]</b><br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 1718740,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616770,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "372.00",
        "babName": "Some of the Bounties which Allah has prepared for the Believers in Paradise",
        "hadithNumber": 1887,
        "hadithText": "Abu Sa'id Al-Khudri (May Allah be pleased with him) said: The Prophet (ﷺ) said, \"The dwellers of Jannah will look at those in the upper abodes above them as you look at a shining star which remains in the eastern or western horizon; such will be the difference in superiority which some of them have over others.\" The Messenger of Allah (ﷺ) was asked: \"Will those be the dwellings of the Prophets which no one else will be able to reach?\" He (ﷺ) replied, \"Yes, but by Him in Whose Hand my soul is! men who believed in Allah and acknowledged the truthfulness of the Messengers will reach them.\"<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 1718750,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616780,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "372.00",
        "babName": "Some of the Bounties which Allah has prepared for the Believers in Paradise",
        "hadithNumber": 1888,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) said: The Messenger of Allah (ﷺ) said, \"A space in Jannah equal to the distance between the middle and the end of a bow will be better than all that upon which the sun rises and sets.\"<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 1718760,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616790,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "372.00",
        "babName": "Some of the Bounties which Allah has prepared for the Believers in Paradise",
        "hadithNumber": 1889,
        "hadithText": "Anas (May Allah be pleased with him) said: The Messenger of Allah (ﷺ) said, \"In Jannah there is a market to which the people will come every Friday. The northern wind will blow and shower fragrance on their faces and clothes and, consequently, it will enhance their beauty and loveliness. They will then return to their wives who will also have increased in their beauty and loveliness, and their families will say to them: 'We swear by Allah that you have been increased in beauty and loveliness since leaving us.' Thereupon they will reply: 'We swear by Allah that you have also been increased in beauty and loveliness since we left you.\"'<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 1718770,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616800,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "372.00",
        "babName": "Some of the Bounties which Allah has prepared for the Believers in Paradise",
        "hadithNumber": 1890,
        "hadithText": "Sahl bin Sa'd (May Allah be pleased with him) said: The Messenger of Allah (ﷺ) said, \"The dwellers of Jannah will see the upper abodes of Jannah as you see the stars in the sky.\"<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 1718780,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616810,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "372.00",
        "babName": "Some of the Bounties which Allah has prepared for the Believers in Paradise",
        "hadithNumber": 1891,
        "hadithText": "Sahl bin Sa'd (May Allah be pleased with him) said: I was in the company of the Prophet (ﷺ). He gave a description of Jannah and concluded with these words, \"There will be bounties which no eye has seen, no ear has heard and no human heart has ever perceived.\" He (ﷺ) then recited this Verse:<br><br>\"Their sides forsake their beds, to invoke their Rubb in fear and hope, and they spend (in charity in Allah's Cause) out of what We have bestowed on them. No person knows what is kept hidden for them of joy...\" (32:16,17)<br><br><b>[Al-Bukhari]</b>.<br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 1718790,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616820,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "372.00",
        "babName": "Some of the Bounties which Allah has prepared for the Believers in Paradise",
        "hadithNumber": 1892,
        "hadithText": "Abu Sa'id and Abu Hurairah (May Allah be pleased with them) reported: The Messenger of Allah (ﷺ) said, \"When the dwellers of Jannah enter Jannah, an announcer will call: (You have a promise from Allah that) you will live therein and you will never die; you will stay healthy therein and you will never fall ill; you will stay young and you will never become old; you will be under a constant bliss and you will never feel miserable.\"<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 1718800,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616830,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "372.00",
        "babName": "Some of the Bounties which Allah has prepared for the Believers in Paradise",
        "hadithNumber": 1893,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) said: The Messenger of Allah (ﷺ) said, \"The lowest place of any of you in Jannah will be that Allah will tell him to express his wish. He will wish and wish again. Allah will then ask him: 'Have you expressed your wish?' He will answer: 'Yes, I have.' Allah will say: 'You will have what you have wished for and the like thereof along with it.\"'<br><br><b>[Muslim]</b>.</b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 1718810,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616840,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "372.00",
        "babName": "Some of the Bounties which Allah has prepared for the Believers in Paradise",
        "hadithNumber": 1894,
        "hadithText": "Abu Sa'id Al-Khudri (May Allah be pleased with him) said: The Messenger of Allah (ﷺ) said, \"Allah, the Rubb of honour and glory, will say to the inhabitants of Jannah: 'O inhabitants of Jannah!' They will respond: 'Here we are! At Your service, O our Rubb. All good is in Your Hand!' He will ask them: 'Are you pleased?' They will reply: 'Why should we not be pleased, O Rubb, when You have given us what You have not given to any of Your creatures?' Allah will say: 'Shall I not give you something better than that?' They will ask: 'O Rubb! What can be better than that?' Allah will say: 'I shall bestow My Pleasure upon you and I shall never be displeased with you.\"'<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 1718820,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616850,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "372.00",
        "babName": "Some of the Bounties which Allah has prepared for the Believers in Paradise",
        "hadithNumber": 1895,
        "hadithText": "Jarir bin 'Abdullah (May Allah be pleased with him) reported: We were sitting with the Messenger of Allah (ﷺ) when he looked at the full moon and observed, \"You shall see your Rubb in the Hereafter as you are seeing this moon; and you will not feel the slightest inconvenience in seeing Him.\"<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 1718830,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1616860,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 19,
        "bookName": "The Book of Forgiveness",
        "babNumber": "372.00",
        "babName": "Some of the Bounties which Allah has prepared for the Believers in Paradise",
        "hadithNumber": 1896,
        "hadithText": "Suhaib (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"When the inhabitants of Jannah enter Jannah, Allah, the Glorious and Exalted, will say to them: 'Do you wish me to give you anything more?' They will reply: 'Have You not made our faces bright? Have You not brought us into Jannah and delivered us from the Hell?' And Allah will remove the Veil. The (dwellers of Jannah) will feel that they have not been awarded anything dearer to them than looking at their Rubb.\"<br><br><b>[Muslim]</b>.<br><br>Allah, the Exalted, says:<br><br>\"Verily, those who believe and do deeds of righteousness, their Rubb will guide them through their Faith; under them will flow rivers in the Gardens of Delight (Jannah). Their way of request therein will be Subhanaka Allahumma (Glory to You, O Allah!) and Salam (peace, safety from evil) will be their greetings therein (Jannah)! and the close of their request will be: Al-hamdu lillahi Rabbil-'Alamin <b>[All the praises and thanks are to Allah, the Rubb of 'Alamin (mankind, jinn and all that exists)]</b>.\" (10:9,10)</b>",
        "bookID": "19.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 1718840,
        "last_updated": "2020-08-16 22:09:35"
    }
]