[
    {
        "englishURN": 1607490,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "117.00",
        "babName": null,
        "hadithNumber": 778,
        "hadithText": "Ibn 'Abbas (May Allah be pleased with them) reported: I heard the Messenger of Allah (ﷺ) saying, \"Put on white clothes because they are the best; and use them for shrouding your dead.\"<br><br><b>[Abu Dawud and At- Tirmidhi]</b>.</b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 1707720,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607500,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "117.00",
        "babName": null,
        "hadithNumber": 779,
        "hadithText": "Samurah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, 'Wear white clothes because they are the purest and they are closest to modesty; and shroud the dead in it.\"<br><br><b>[An- Nasa'i and Al-Hakim]</b>.<br><br></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 1707730,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607510,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "117.00",
        "babName": "Excellence of wearing white clothes and the permissibility of wearing red, green, yellow and black clothes made from Cotton, Linen but not Silk",
        "hadithNumber": 780,
        "hadithText": "Bara' (May Allah be pleased with him) reported: Messenger of Allah (ﷺ) was of medium stature. I saw him wearing a red mantle. I have never seen anything more graceful than that.<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 1707740,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607520,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "117.00",
        "babName": null,
        "hadithNumber": 781,
        "hadithText": "Abu Juhaifah Wahb bin 'Abdullah (May Allah be pleased with him) reported: I saw the Prophet (ﷺ) by Al-Abtah valley in Makkah, in a red tent made from tanned skin. Bilal brought him ablution water. Then the Messenger of Allah (ﷺ) came out wearing a red mantle; and I can still remember looking at whiteness of his shanks. So he made his ablution, and Bilal (ﷺ) pronounced the call for prayer (Adhan). I kept following the movement of his (Bilal's) face to the right and to the left when he recited: 'Come to the prayer; come to the success.' Then a spear was fixed (as a Sutrah) in front of Messenger of Allah (ﷺ) who then stepped forward and led the prayer. Dogs and donkeys passed in front of him (beyond the spear) and no one prevented them from doing so.<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 1707750,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607530,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "117.00",
        "babName": null,
        "hadithNumber": 782,
        "hadithText": "Abu Rimthah Rifa'ah At-Taimi (May Allah be pleased with him) reported: I saw the Messenger of Allah (ﷺ) wearing two green garments.<br><br><b>[Abu Dawud and At- Tirmidhi]</b>.<br><br></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 1707760,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607540,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "117.00",
        "babName": null,
        "hadithNumber": 783,
        "hadithText": "Jabir (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) entered Makkah on the day of its conquest and he was wearing a black turban.<br><br><b>[Muslim]</b>.</b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 1707770,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607550,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "117.00",
        "babName": null,
        "hadithNumber": 784,
        "hadithText": "Abu Sa'id 'Amr bin Huraith (May Allah be pleased with him) reported: It was as if I am seeing the Messenger of Allah (ﷺ) wearing a black turban and both ends of it are falling over his shoulders.<br><br><b>[Muslim]</b>.<br><br>Another narration is: The Messenger of Allah (ﷺ) was delivering a Khutbah wearing a black turban.<br><br></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 1707780,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607560,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "117.00",
        "babName": "Excellence of wearing white clothes and the permissibility of wearing red, green, yellow and black clothes made from Cotton, Linen but not Silk",
        "hadithNumber": 785,
        "hadithText": "'Aishah (May Allah be pleased with her) reported: The body of Messenger of Allah (ﷺ) was shrouded in three white Yemeni cotton garments, among which was neither a gown nor a turban.<br><br><b>[Al- Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 1707790,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607570,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "117.00",
        "babName": null,
        "hadithNumber": 786,
        "hadithText": "'Aishah (May Allah be pleased with her) reported: One morning the Messenger of Allah (ﷺ) went out wearing a black blanket made of a camel or sheep's black hair with patterns of camel's bags upon it.<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 1707800,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607580,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "117.00",
        "babName": null,
        "hadithNumber": 787,
        "hadithText": "Al-Mughirah bin Shu'bah (May Allah be pleased with him) reported: I was with the Messenger of Allah (ﷺ) in a journey one night, and he asked me, \"Do you have any water with you?\" I said, \"Yes.\" So he dismounted from his riding camel and walked away (to answer the call of nature) until he disappeared in the darkness. When he returned, I poured out some water from a vessel and he washed his face. He was wearing a long woolen cloak and could not take out his forearms from his sleeves, so he brought them out from below the cloak and then washed them, and then passed his (wet) hands over his head. I stretched out my hand to take off his Khuff (leather socks), but he said, \"Leave them. I put them on after performing Wudu',\" and he passed his (wet) hands over them.<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br>Another narration is: The Messenger of Allah (ﷺ) was wearing a Syrian cloak with tight sleeves.<br><br>Another narration is: This incident took place during the battle of Tabuk.<br><br></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 1707810,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607590,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "119.00",
        "babName": null,
        "hadithNumber": 790,
        "hadithText": "Ibn 'Umar (May Allah be pleased with him) reported: The Prophet (ﷺ) said, \"Whoever allows his lower garment to drag out of vanity will find that Allah will not look at him on the Day of Resurrection.\" On this Abu Bakr (May Allah be pleased with him) replied: \"O Messenger of Allah! My lower garment keeps sliding down though I take care to pull it and wrap it.\" The Messenger of Allah (ﷺ) said, \"You are not of those who do it out of vanity.\"<br><br><b>[Al- Bukhari]</b>.<br><br></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 1707840,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607600,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "119.00",
        "babName": null,
        "hadithNumber": 791,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"On the Day of Resurrection, Allah will not look at him who trails his lower garment out of pride.\"<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 1707850,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607610,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "119.00",
        "babName": "Description of the length of Qamees and the Sleeves, the end of the Turban, the Prohibition of wearing long Garments out of Pride and the undesirability of wearing them without Pride",
        "hadithNumber": 792,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) reported: The Prophet (ﷺ) said, \"What is below the ankles of a lower garment is condemned to the Fire (Hell).\"<br><br><b>[Al-Bukhari]</b>.<br><br></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 1707860,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607620,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "119.00",
        "babName": "Description of the length of Qamees and the Sleeves, the end of the Turban, the Prohibition of wearing long Garments out of Pride and the undesirability of wearing them without Pride",
        "hadithNumber": 793,
        "hadithText": "Abu Dharr (May Allah be pleased with him) reported: I heard the Prophet (ﷺ) saying, \"There are three to whom Allah will neither speak on the Day of Resurrection nor will look at them nor purify them (i.e., of their sins), and they will be severely tormented.\" When he repeated this (statement) thrice, Abu Dharr (May Allah be pleased with him) said: \"They are doomed and destroyed! (But) who are they, O Messenger of Allah (ﷺ)?\" He said, \"One whose lower garment trails, one who boasts of kindness shown to another; and one who promotes sale of his business by taking false oaths.\"<br><br><b>[Muslim]</b>.<br><br></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 1707870,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607630,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "119.00",
        "babName": "Description of the length of Qamees and the Sleeves, the end of the Turban, the Prohibition of wearing long Garments out of Pride and the undesirability of wearing them without Pride",
        "hadithNumber": 794,
        "hadithText": "Ibn 'Umar (May Allah be pleased with them) reported: The Prophet (ﷺ) said, \"On the Day of Resurrection, Allah will not look at one who trails his lower garment, Qamees or turban arrogantly.\"<br><br><b>[Abu Dawud and An- Nasa'i]</b>.<br><br></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 1707880,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607640,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "119.00",
        "babName": null,
        "hadithNumber": 795,
        "hadithText": "Abu Juraiy Jabir bin Sulaim (May Allah be pleased with him) reported: I noticed a man whose opinion was followed by everyone, and no one acted contrary to what he said. I asked who he was, and I was informed that he was the Messenger of Allah (ﷺ). I said to him twice: \"Alaikas- salam ya Rasul-Allah (May Allah render you safe).\" He said, \"Do not say: 'Alaikas-salamu.' This is the salutation to the dead (during the time of Jahiliyyah). Say, instead: 'As-salamu 'alaika (May Allah render you safe).\"' I asked: \"Are you the Messenger of Allah?\" He replied, \"(Yes) I am the Messenger of Allah, The One Who (Allah) will remove your affliction when you are in trouble and call upon Him, Who will cause food to grow for you when you are famine-stricken and call upon Him, and Who will restore to you your lost riding animal in the desert when you call upon Him.\" I said to him: \"Give me instructions (to act upon).\" He (ﷺ) said, \"Do not abuse anyone.\" (Since then I have never abused anyone, neither a freeman, nor a slave, nor a camel, nor a sheep). He (ﷺ) continued, \"Do not hold in contempt even an insignificant act of goodness because even talking to your brother with a cheerful countenance is an act of goodness. Hold up your lower garment half way to the leg, and at least above the ankles; for trailing it is arrogance, and Allah dislikes pride. And if a man attributes to you bad things he knows you possess, do not attribute to him bad things that you know he has for he will assume the evil consequences of his abuse.\"<br><br><b>[Abu Dawud and At-Tirmidhi]</b>.<br><br></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 1707890,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607650,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "119.00",
        "babName": null,
        "hadithNumber": 796,
        "hadithText": "Abu Hurairah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said to a man who was performing Salah while his lower garment was trailing, \"Go and perform your Wudu' again.\" The man went and came back having performed it. The Messenger of Allah (ﷺ) said (again), \"Go and perform your Wudu'.\" Someone present said to the Messenger of Allah (ﷺ): \"O Messenger of Allah! You ask him to perform his Wudu' and then you kept silent (without saying the reason for it).\" He (ﷺ) said, \"He performed Salah while his lower garment was below his ankles. Allah does not accept the Salah of a man who trails his lower garment.\"<br><br><b>[Abu Dawud]</b>.</b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 1707900,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607660,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "119.00",
        "babName": null,
        "hadithNumber": 797,
        "hadithText": "Qais bin Bishr At-Taghlibi reported that his father, who attended the company of 'Abud-Darda' (May Allah be pleased with him) told him: There was a man in Damascus who was a Companion of the Messenger of Allah (ﷺ). He was called Ibn Al-Hanzaliyyah. He was a lonesome person and would rarely spend some time in the company of people. He would spend most of his time performing Salah and when he finished, he would engage himself in Tasbih (Subhan-Allah) and Takbir (Allahu Akbar), until he would go home. He passed by us one day when we were sitting with Abud-Darda' (May Allah be pleased with him). The latter said to him: \"Tell us something which will benefit for us and will not harm you.\" He said: \"The Messenger of Allah (ﷺ) sent a detachment. When they returned, one of them came to the assemblage in which the Messenger of Allah (ﷺ) was present and said to his neighbor during the conversation: 'I wish you had seen us when we encountered the enemy. So-and-so (a believer) took up his spear, struck and said: Take this from me and I am the Ghifari boy. Now what do you think of this?' The neighbor said: 'I think that he lost his reward because of boasting.' He said: 'I see no harm in it.' They began to exchange arguments till the Messenger of Allah (ﷺ) heard them and said, 'Subhan-Allah (Allah is free from every imperfection). He would be rewarded (in the Hereafter) and praised (in this world)'. I noticed that Abud-Darda' (May Allah be pleased with him) felt a great pleasure at this remark and, raising his head began to repeat: \"Have you heard the Messenger of Allah (ﷺ) say this!\" Ibn Al-Hanzaliyyah (May Allah be pleased with him) continued responding until I asked Abud-Darda' (May Allah be pleased with him) not to annoy him.<br><br>Ibn Al-Hanzaliyyah (May Allah be pleased with him) happened to pass by us another day and Abud-Darda' said to him: \"Tell us something which will benefit us and will not harm you.\" He said: \"The Messenger of Allah (ﷺ) told us, 'He who spends to purchase a horse (for Jihad) is like one who extends his hand for spending out of charity without withholding it.\"'<br><br>He passed by us another day and Abud-Darda' (May Allah be pleased with him) said to him: \"Tell us something which might benefit us, and will not harm you.\" He said: \"The Messenger of Allah (ﷺ) once said, 'Khuraim Al-Usaidi is an excellent man were it not for his long hair and his lower garment which is hanging down.' When Khuraim heard about what the Prophet had said about him, he trimmed his long hair up to his ears with a knife and raised his lower garment half way to his shanks.\"<br><br>On another occasion he passed by us and Abud-Darda' (May Allah be pleased with him) said to him: \"Tell us something that will benefit us and will not harm you.\" He said that he heard the Messenger of Allah (ﷺ) say, while coming back from an expedition: \"You are returning to your brothers, so set your saddles and clothes in order so that you look tidy and graceful. Allah hates untidiness.\"<br><br><b>[Abu Dawud]</b>.<br><br></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 1707910,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607670,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "119.00",
        "babName": "Description of the length of Qamees and the Sleeves, the end of the Turban, the Prohibition of wearing long Garments out of Pride and the undesirability of wearing them without Pride",
        "hadithNumber": 798,
        "hadithText": "Abu Sa'id Al-Khudri (May Allah be pleased with him) reported: Messenger of Allah (ﷺ) said, \"The lower garment of a believer should be half way below the knees. He is guilty of no sin if they are up to the ankles. That which is below the ankles is in the Fire (of Hell). Allah will not look at one who allows his lower garment to trail out of vanity.<br><br><b>[Abu Dawud]</b>.<br><br></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 1707920,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607680,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "119.00",
        "babName": null,
        "hadithNumber": 799,
        "hadithText": "Ibn 'Umar (May Allah be pleased with them) reported: My lower garment was trailing as I passed by the Messenger of Allah (ﷺ) so he said, \"Raise your lower garment, Abdullah.\" I lifted it up and he told me to raise it higher. I complied with his orders and as I was still trying to find the best place (for it), one of the people asked where it should reach and he (ﷺ) replied, \"Half way down the knees.\"<br><br><b>[Muslim]</b>.</b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 1707930,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607690,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "119.00",
        "babName": null,
        "hadithNumber": 800,
        "hadithText": "Ibn 'Umar (May Allah be pleased with them) reported: The Messenger of Allah (ﷺ) said, \"On the Day of Resurrection, Allah will not look at the one who trails his lower garment out of arrogance.\" Umm Salamah (May Allah be pleased with her) asked: \"What should women do with the hem of their clothes?\" He (ﷺ) said, \"They might lower them a hand's span.\" She said: \"But their feet would still remain exposed.\" He said, \"Let them lower them equal to arm's length but not more than that.\"<br><br><b>[Abu Dawud and At-Tirmidhi]</b>.<br><br></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 1707940,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607700,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "122.00",
        "babName": null,
        "hadithNumber": 804,
        "hadithText": "'Umar bin Al-Khattab (May Allah be pleased with him) reported: I heard the Messenger of Allah (ﷺ) saying, \"Silk (clothes) are worn only by he who has no share in the Hereafter.\"<br><br><b>[Al-Bukhari and Muslim]</b>.<br><br><br><p>\n<br><p>\nAnother narration is: \"Who has no share in the Hereafter.\"</b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 1707980,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607710,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "122.00",
        "babName": null,
        "hadithNumber": 805,
        "hadithText": "Anas (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"He who wears silk clothes in this life shall not wear them in the Hereafter.\"<br><br><b>[Al-Bukhari and Muslim]</b>.</b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 1707990,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607720,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "122.00",
        "babName": null,
        "hadithNumber": 806,
        "hadithText": "'Ali (May Allah be pleased with him) reported: I saw the Messenger of Allah (ﷺ) holding a piece of gold in his left hand and a silk (cloth) in his right hand. Then he said, \"These two are forbidden for the males of my Ummah.\"<br><br><b>[Abu Dawud]</b>.</b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 1708000,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607730,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "122.00",
        "babName": null,
        "hadithNumber": 807,
        "hadithText": "Abu Musa Al-Ash'ari (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"The wearing of silk and gold has been made unlawful for males of my Ummah and lawful for the females.\"<br><br><b>[At-Tirmidhi]</b>.<br><br></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 1708010,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607740,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "122.00",
        "babName": null,
        "hadithNumber": 808,
        "hadithText": "Hudhaifah (May Allah be pleased with him) reported: The Prophet (ﷺ) prohibited us from eating or drinking from gold or silver utensils and from wearing silk and brocade, or sitting on (anything made from) them.<br><br><b>[Al-Bukhari]</b>.<br><br></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 1708020,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607750,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "124.00",
        "babName": null,
        "hadithNumber": 811,
        "hadithText": "Abul-Malih on the authority of his father reported: The Messenger of Allah (ﷺ) prohibited the use of the skins of wild animals.<br><br><b>[Abu Dawud, At-Tirmidhi and An- Nasa'i]</b>.<br><br>Another narration in At-Tirmidhi is: The Messenger of Allah (ﷺ) forbade the use of the skins of wild animals in making firash (i.e., something to sit on or lie down on, such as cushions, pillows, covers, spreads, saddles, etc.).<br><br></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 1708050,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607585,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "118.00",
        "babName": null,
        "hadithNumber": 788,
        "hadithText": "Umm Salamah (May Allah be pleased with her) reported: Out of all garments, the Messenger of Allah (ﷺ) liked the Qamees the best.<br><p>\n<p><br><p>\n<b>[Abu Dawud and At-Tirmidhi ]</b>.<br><p>\n<p><br><p>\nEditor's note: The Qamees is a modest, traditional outfit thought to resemble what is now referred to as a thawb.</b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 1707820,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607587,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "119.00",
        "babName": null,
        "hadithNumber": 789,
        "hadithText": "Asma' bint Yazid (May Allah be pleased with her) reported: The sleeves of the Messenger of Allah (ﷺ)'s Qamees reached down to his wrists.<br><p>\n<p><br><p>\n<b>[Abu Dawud and At-Tirmidhi]</b>.</b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 1707830,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607695,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "120.00",
        "babName": null,
        "hadithNumber": 801,
        "hadithText": "Mu`adh bin Anas (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"Whoever gives up wearing elegant and expensive garments out of humbleness, when he can do so, Allah will call him on the Day of Resurrection, before all of creation, He will give him the choice to wear whichever garment of Iman he would like to wear.\"<br><p>\n<p><br><p>\n<b>[At-Tirmidhi]</b>.</b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 1707950,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607696,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "121.00",
        "babName": null,
        "hadithNumber": 802,
        "hadithText": "`Amr bin Shu`aib on the authority of his father and grandfather reported: The Messenger of Allah (ﷺ) said, \"Allah loves to see the sign of His Bounties on his slave.\"<br><p>\n<p><br><p>\n<b>[At-Tirmidhi]</b>.</b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 1707960,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607698,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "122.00",
        "babName": null,
        "hadithNumber": 803,
        "hadithText": "`Umar bin Al-Khattab (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"Do not wear silk (clothes). For whoever wears (them) in this life will be deprived of them in the Hereafter.\"<br><p>\n<p><br><p>\n<b>[Al-Bukhari and Muslim]</b>.</b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 1707970,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607745,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "123.00",
        "babName": null,
        "hadithNumber": 809,
        "hadithText": "Anas (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) permitted Zubair and `Abdur-Rahman bin `Auf (May Allah be pleased with them) to wear silk because they were suffering from an itch.<br><p>\n<p><br><p>\n<b>[Al-Bukhari and Muslim]</b>.</b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 1708030,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607747,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "124.00",
        "babName": null,
        "hadithNumber": 810,
        "hadithText": "Mu`awiyah (May Allah be pleased with him) reported: The Messenger of Allah (ﷺ) said, \"Do not ride on saddles made from silk or leopard's skin.\"<br><p>\n<p><br><p>\n<b>[Abu Dawud]</b>.</b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 1708040,
        "last_updated": "2020-08-16 22:09:35"
    },
    {
        "englishURN": 1607757,
        "collection": "riyadussalihin",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book of Dress",
        "babNumber": "125.00",
        "babName": null,
        "hadithNumber": 812,
        "hadithText": "Abu Sa`id Al-Khudri (May Allah be pleased with him) reported: When the Messenger of Allah (ﷺ) wore a new garment, he would name it. For instance, a turban, shirt, or cloak and would supplicate: \"Allahumma lakal-hamdu, Anta kasautanihi, as`aluka khairahu wa khaira ma suni`a lahu, wa a`udhu bika min sharrihi wa sharri ma suni`a lahu (O Allah, all the praise is for You that You have given it to me to put on. I ask You its goodness and the goodness of the purpose for which it was made, and I seek Your Protection from its evil and the evil of the purpose for which it was made).''<br><p>\n<p><br><p>\n<b>[Abu Dawud and At-Tirmidhi].</b></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 1708060,
        "last_updated": "2020-08-16 22:09:35"
    }
]