[
    {
        "arabicURN": 923160,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "1.00",
        "hadithNumber": "2313",
        "bookName": " كتاب الصوم ",
        "babName": " باب مَبْدَإِ فَرْضِ الصِّيَامِ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ شَبُّويَةَ، حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنِ بْنِ وَاقِدٍ، عَنْ أَبِيهِ، عَنْ يَزِيدَ النَّحْوِيِّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، ‏<A id=\"q1\" name=\"q1\" href=\"javascript:openquran(1,183,183)\"><c_q1>{‏ يَا أَيُّهَا الَّذِينَ آمَنُوا كُتِبَ عَلَيْكُمُ الصِّيَامُ كَمَا كُتِبَ عَلَى الَّذِينَ مِنْ قَبْلِكُمْ ‏}</c_q1></a>‏ فَكَانَ النَّاسُ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم إِذَا صَلَّوُا الْعَتَمَةَ حَرُمَ عَلَيْهِمُ الطَّعَامُ وَالشَّرَابُ وَالنِّسَاءُ وَصَامُوا إِلَى الْقَابِلَةِ فَاخْتَانَ رَجُلٌ نَفْسَهُ فَجَامَعَ امْرَأَتَهُ وَقَدْ صَلَّى الْعِشَاءَ وَلَمْ يُفْطِرْ فَأَرَادَ اللَّهُ عَزَّ وَجَلَّ أَنْ يَجْعَلَ ذَلِكَ يُسْرًا لِمَنْ بَقِيَ وَرُخْصَةً وَمَنْفَعَةً فَقَالَ سُبْحَانَهُ ‏<A id=\"q2\" name=\"q2\" href=\"javascript:openquran(1,187,187)\"><c_q2>{‏ عَلِمَ اللَّهُ أَنَّكُمْ كُنْتُمْ تَخْتَانُونَ أَنْفُسَكُمْ ‏}</c_q2></a>‏ ‏.‏ وَكَانَ هَذَا مِمَّا نَفَعَ اللَّهُ بِهِ النَّاسَ وَرَخَّصَ لَهُمْ وَيَسَّرَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "حسن صحيح",
        "ourHadithNumber": 1,
        "matchingEnglishURN": 823060,
        "last_updated": null
    },
    {
        "arabicURN": 923170,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "1.00",
        "hadithNumber": "2314",
        "bookName": " كتاب الصوم ",
        "babName": " باب مَبْدَإِ فَرْضِ الصِّيَامِ ",
        "hadithText": "حَدَّثَنَا نَصْرُ بْنُ عَلِيِّ بْنِ نَصْرٍ الْجَهْضَمِيُّ، أَخْبَرَنَا أَبُو أَحْمَدَ، أَخْبَرَنَا إِسْرَائِيلُ، عَنْ إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ كَانَ الرَّجُلُ إِذَا صَامَ فَنَامَ لَمْ يَأْكُلْ إِلَى مِثْلِهَا وَإِنَّ صِرْمَةَ بْنَ قَيْسٍ الأَنْصَارِيَّ أَتَى امْرَأَتَهُ وَكَانَ صَائِمًا فَقَالَ عِنْدَكِ شَىْءٌ قَالَتْ لاَ لَعَلِّي أَذْهَبُ فَأَطْلُبُ لَكَ شَيْئًا ‏.‏ فَذَهَبَتْ وَغَلَبَتْهُ عَيْنُهُ فَجَاءَتْ فَقَالَتْ خَيْبَةً لَكَ ‏.‏ فَلَمْ يَنْتَصِفِ النَّهَارُ حَتَّى غُشِيَ عَلَيْهِ وَكَانَ يَعْمَلُ يَوْمَهُ فِي أَرْضِهِ فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَنَزَلَتْ ‏<A id=\"q3\" name=\"q3\" href=\"javascript:openquran(1,187,187)\"><c_q3>{‏ أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَى نِسَائِكُمْ ‏}</c_q3></a>‏ قَرَأَ إِلَى قَوْلِهِ ‏{‏ مِنَ الْفَجْرِ ‏}‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 2,
        "matchingEnglishURN": 823070,
        "last_updated": null
    },
    {
        "arabicURN": 923180,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "2.00",
        "hadithNumber": "2315",
        "bookName": " كتاب الصوم ",
        "babName": " باب نَسْخِ قَوْلِهِ ‏<A id=\"q4\" name=\"q4\" href=\"javascript:openquran(1,184,184)\"><c_q4>{‏ وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ ‏}</c_q4></a>‏",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا بَكْرٌ، - يَعْنِي ابْنَ مُضَرَ - عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ بُكَيْرٍ، عَنْ يَزِيدَ، مَوْلَى سَلَمَةَ عَنْ سَلَمَةَ بْنِ الأَكْوَعِ، قَالَ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ ‏<A id=\"q5\" name=\"q5\" href=\"javascript:openquran(1,184,184)\"><c_q5>{‏ وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ ‏}</c_q5></a>‏ كَانَ مَنْ أَرَادَ مِنَّا أَنْ يُفْطِرَ وَيَفْتَدِيَ فَعَلَ حَتَّى نَزَلَتِ الآيَةُ الَّتِي بَعْدَهَا فَنَسَخَتْهَا ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 3,
        "matchingEnglishURN": 823080,
        "last_updated": null
    },
    {
        "arabicURN": 923190,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "2.00",
        "hadithNumber": "2316",
        "bookName": " كتاب الصوم ",
        "babName": " باب نَسْخِ قَوْلِهِ ‏<A id=\"q4\" name=\"q4\" href=\"javascript:openquran(1,184,184)\"><c_q4>{‏ وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ ‏}</c_q4></a>‏",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنٍ، عَنْ أَبِيهِ، عَنْ يَزِيدَ النَّحْوِيِّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، ‏<A id=\"q6\" name=\"q6\" href=\"javascript:openquran(1,184,184)\"><c_q6>{‏ وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ ‏}</c_q6></a>‏ فَكَانَ مَنْ شَاءَ مِنْهُمْ أَنْ يَفْتَدِيَ بِطَعَامِ مِسْكِينٍ افْتَدَى وَتَمَّ لَهُ صَوْمُهُ فَقَالَ ‏<A id=\"q7\" name=\"q7\" href=\"javascript:openquran(1,184,184)\"><c_q7>{‏ فَمَنْ تَطَوَّعَ خَيْرًا فَهُوَ خَيْرٌ لَهُ وَأَنْ تَصُومُوا خَيْرٌ لَكُمْ ‏}</c_q7></a>‏ وَقَالَ ‏<A id=\"q8\" name=\"q8\" href=\"javascript:openquran(1,185,185)\"><c_q8>{‏ فَمَنْ شَهِدَ مِنْكُمُ الشَّهْرَ فَلْيَصُمْهُ وَمَنْ كَانَ مَرِيضًا أَوْ عَلَى سَفَرٍ فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ ‏}</c_q8></a>‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "حسن",
        "ourHadithNumber": 4,
        "matchingEnglishURN": 823090,
        "last_updated": null
    },
    {
        "arabicURN": 923200,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "3.00",
        "hadithNumber": "2317",
        "bookName": " كتاب الصوم ",
        "babName": " باب مَنْ قَالَ هِيَ مُثْبَتَةٌ لِلشَّيْخِ وَالْحُبْلَى ",
        "hadithText": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبَانُ، حَدَّثَنَا قَتَادَةُ، أَنَّ عِكْرِمَةَ، حَدَّثَهُ أَنَّ ابْنَ عَبَّاسٍ قَالَ أُثْبِتَتْ لِلْحُبْلَى وَالْمُرْضِعِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 5,
        "matchingEnglishURN": 823100,
        "last_updated": null
    },
    {
        "arabicURN": 923210,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "3.00",
        "hadithNumber": "2318",
        "bookName": " كتاب الصوم ",
        "babName": " باب مَنْ قَالَ هِيَ مُثْبَتَةٌ لِلشَّيْخِ وَالْحُبْلَى ",
        "hadithText": "حَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ عَزْرَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، ‏<A id=\"q9\" name=\"q9\" href=\"javascript:openquran(1,184,184)\"><c_q9>{‏ وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ ‏}</c_q9></a>‏ قَالَ كَانَتْ رُخْصَةً لِلشَّيْخِ الْكَبِيرِ وَالْمَرْأَةِ الْكَبِيرَةِ وَهُمَا يُطِيقَانِ الصِّيَامَ أَنْ يُفْطِرَا وَيُطْعِمَا مَكَانَ كُلِّ يَوْمٍ مِسْكِينًا وَالْحُبْلَى وَالْمُرْضِعُ إِذَا خَافَتَا - قَالَ أَبُو دَاوُدَ يَعْنِي عَلَى أَوْلاَدِهِمَا - أَفْطَرَتَا وَأَطْعَمَتَا ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "شاذ",
        "ourHadithNumber": 6,
        "matchingEnglishURN": 823110,
        "last_updated": null
    },
    {
        "arabicURN": 923220,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "4.00",
        "hadithNumber": "2319",
        "bookName": " كتاب الصوم ",
        "babName": " باب الشَّهْرِ يَكُونُ تِسْعًا وَعِشْرِينَ ",
        "hadithText": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَسْوَدِ بْنِ قَيْسٍ، عَنْ سَعِيدِ بْنِ عَمْرٍو، - يَعْنِي ابْنَ سَعِيدِ بْنِ الْعَاصِ - عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّا أُمَّةٌ أُمِّيَّةٌ لاَ نَكْتُبُ وَلاَ نَحْسُبُ الشَّهْرُ هَكَذَا وَ هَكَذَا وَهَكَذَا ‏\"‏ ‏.‏ وَخَنَسَ سُلَيْمَانُ أُصْبَعَهُ فِي الثَّالِثَةِ يَعْنِي تِسْعًا وَعِشْرِينَ وَثَلاَثِينَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 7,
        "matchingEnglishURN": 823120,
        "last_updated": null
    },
    {
        "arabicURN": 923230,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "4.00",
        "hadithNumber": "2320",
        "bookName": " كتاب الصوم ",
        "babName": " باب الشَّهْرِ يَكُونُ تِسْعًا وَعِشْرِينَ ",
        "hadithText": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الشَّهْرُ تِسْعٌ وَعِشْرُونَ فَلاَ تَصُومُوا حَتَّى تَرَوْهُ وَلاَ تُفْطِرُوا حَتَّى تَرَوْهُ فَإِنْ غُمَّ عَلَيْكُمْ فَاقْدُرُوا لَهُ ثَلاَثِينَ ‏\"‏ ‏.‏ قَالَ فَكَانَ ابْنُ عُمَرَ إِذَا كَانَ شَعْبَانُ تِسْعًا وَعِشْرِينَ نُظِرَ لَهُ فَإِنْ رُؤِيَ فَذَاكَ وَإِنْ لَمْ يُرَ وَلَمْ يَحُلْ دُونَ مَنْظَرِهِ سَحَابٌ وَلاَ قَتَرَةٌ أَصْبَحَ مُفْطِرًا فَإِنْ حَالَ دُونَ مَنْظَرِهِ سَحَابٌ أَوْ قَتَرَةٌ أَصْبَحَ صَائِمًا ‏.‏ قَالَ فَكَانَ ابْنُ عُمَرَ يُفْطِرُ مَعَ النَّاسِ وَلاَ يَأْخُذُ بِهَذَا الْحِسَابِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح قد دون قوله فكان ابن عمر",
        "ourHadithNumber": 8,
        "matchingEnglishURN": 823130,
        "last_updated": null
    },
    {
        "arabicURN": 923240,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "4.00",
        "hadithNumber": "2321",
        "bookName": " كتاب الصوم ",
        "babName": " باب الشَّهْرِ يَكُونُ تِسْعًا وَعِشْرِينَ ",
        "hadithText": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنِي أَيُّوبُ، قَالَ كَتَبَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ إِلَى أَهْلِ الْبَصْرَةِ بَلَغَنَا عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ نَحْوَ حَدِيثِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم زَادَ وَإِنَّ أَحْسَنَ مَا يُقَدَّرُ لَهُ إِذَا رَأَيْنَا هِلاَلَ شَعْبَانَ لِكَذَا وَكَذَا فَالصَّوْمُ إِنْ شَاءَ اللَّهُ لِكَذَا وَكَذَا إِلاَّ أَنْ تَرَوُا الْهِلاَلَ قَبْلَ ذَلِكَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح مقطوع",
        "ourHadithNumber": 9,
        "matchingEnglishURN": 823140,
        "last_updated": null
    },
    {
        "arabicURN": 923250,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "4.00",
        "hadithNumber": "2322",
        "bookName": " كتاب الصوم ",
        "babName": " باب الشَّهْرِ يَكُونُ تِسْعًا وَعِشْرِينَ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، عَنِ ابْنِ أَبِي زَائِدَةَ، عَنْ عِيسَى بْنِ دِينَارٍ، عَنْ أَبِيهِ، عَنْ عَمْرِو بْنِ الْحَارِثِ بْنِ أَبِي ضِرَارٍ، عَنِ ابْنِ مَسْعُودٍ، قَالَ لَمَا صُمْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم تِسْعًا وَعِشْرِينَ أَكْثَرُ مِمَّا صُمْنَا مَعَهُ ثَلاَثِينَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 10,
        "matchingEnglishURN": 823150,
        "last_updated": null
    },
    {
        "arabicURN": 923260,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "4.00",
        "hadithNumber": "2323",
        "bookName": " كتاب الصوم ",
        "babName": " باب الشَّهْرِ يَكُونُ تِسْعًا وَعِشْرِينَ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، أَنَّ يَزِيدَ بْنَ زُرَيْعٍ، حَدَّثَهُمْ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ شَهْرَا عِيدٍ لاَ يَنْقُصَانِ رَمَضَانُ وَذُو الْحِجَّةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 11,
        "matchingEnglishURN": 823160,
        "last_updated": null
    },
    {
        "arabicURN": 923270,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "5.00",
        "hadithNumber": "2324",
        "bookName": " كتاب الصوم ",
        "babName": " باب إِذَا أَخْطَأَ الْقَوْمُ الْهِلاَلَ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، حَدَّثَنَا حَمَّادٌ، - فِي حَدِيثِ أَيُّوبَ - عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ أَبِي هُرَيْرَةَ، ذَكَرَ النَّبِيَّ صلى الله عليه وسلم فِيهِ قَالَ ‏\"‏ وَفِطْرُكُمْ يَوْمَ تُفْطِرُونَ وَأَضْحَاكُمْ يَوْمَ تُضَحُّونَ وَكُلُّ عَرَفَةَ مَوْقِفٌ وَكُلُّ مِنًى مَنْحَرٌ وَكُلُّ فِجَاجِ مَكَّةَ مَنْحَرٌ وَكُلُّ جَمْعٍ مَوْقِفٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 12,
        "matchingEnglishURN": 823170,
        "last_updated": null
    },
    {
        "arabicURN": 923280,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "6.00",
        "hadithNumber": "2325",
        "bookName": " كتاب الصوم ",
        "babName": " باب إِذَا أُغْمِيَ الشَّهْرُ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنِي مُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَيْسٍ، قَالَ سَمِعْتُ عَائِشَةَ، - رضى الله عنها - تَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَحَفَّظُ مِنْ شَعْبَانَ مَا لاَ يَتَحَفَّظُ مِنْ غَيْرِهِ ثُمَّ يَصُومُ لِرُؤْيَةِ رَمَضَانَ فَإِنْ غُمَّ عَلَيْهِ عَدَّ ثَلاَثِينَ يَوْمًا ثُمَّ صَامَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 13,
        "matchingEnglishURN": 823180,
        "last_updated": null
    },
    {
        "arabicURN": 923290,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "6.00",
        "hadithNumber": "2326",
        "bookName": " كتاب الصوم ",
        "babName": " باب إِذَا أُغْمِيَ الشَّهْرُ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ، حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ الضَّبِّيُّ، عَنْ مَنْصُورِ بْنِ الْمُعْتَمِرِ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ حُذَيْفَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تُقَدِّمُوا الشَّهْرَ حَتَّى تَرَوُا الْهِلاَلَ أَوْ تُكْمِلُوا الْعِدَّةَ ثُمَّ صُومُوا حَتَّى تَرَوُا الْهِلاَلَ أَوْ تُكْمِلُوا الْعِدَّةَ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَرَوَاهُ سُفْيَانُ وَغَيْرُهُ عَنْ مَنْصُورٍ عَنْ رِبْعِيٍّ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم لَمْ يُسَمِّ حُذَيْفَةَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 14,
        "matchingEnglishURN": 823190,
        "last_updated": null
    },
    {
        "arabicURN": 923300,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "7.00",
        "hadithNumber": "2327",
        "bookName": " كتاب الصوم ",
        "babName": " باب مَنْ قَالَ فَإِنْ غُمَّ عَلَيْكُمْ فَصُومُوا ثَلاَثِينَ ",
        "hadithText": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا حُسَيْنٌ، عَنْ زَائِدَةَ، عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تُقَدِّمُوا الشَّهْرَ بِصِيَامِ يَوْمٍ وَلاَ يَوْمَيْنِ إِلاَّ أَنْ يَكُونَ شَىْءٌ يَصُومُهُ أَحَدُكُمْ وَلاَ تَصُومُوا حَتَّى تَرَوْهُ ثُمَّ صُومُوا حَتَّى تَرَوْهُ فَإِنْ حَالَ دُونَهُ غَمَامَةٌ فَأَتِمُّوا الْعِدَّةَ ثَلاَثِينَ ثُمَّ أَفْطِرُوا وَ الشَّهْرُ تِسْعٌ وَعِشْرُونَ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ حَاتِمُ بْنُ أَبِي صَغِيرَةَ وَشُعْبَةُ وَالْحَسَنُ بْنُ صَالِحٍ عَنْ سِمَاكٍ بِمَعْنَاهُ لَمْ يَقُولُوا ‏\"‏ ثُمَّ أَفْطِرُوا ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَهُوَ حَاتِمُ بْنُ مُسْلِمِ بْنِ أَبِي صَغِيرَةَ وَأَبُو صَغِيرَةَ زَوْجُ أُمِّهِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 15,
        "matchingEnglishURN": 823200,
        "last_updated": null
    },
    {
        "arabicURN": 923310,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "8.00",
        "hadithNumber": "2328",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي التَّقَدُّمِ ",
        "hadithText": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ مُطَرِّفٍ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، وَسَعِيدٍ الْجُرَيْرِيِّ، عَنْ أَبِي الْعَلاَءِ، عَنْ مُطَرِّفٍ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِرَجُلٍ ‏\"‏ هَلْ صُمْتَ مِنْ سَرَرِ شَعْبَانَ شَيْئًا ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَإِذَا أَفْطَرْتَ فَصُمْ يَوْمًا ‏\"‏ ‏.‏ وَقَالَ أَحَدُهُمَا ‏\"‏ يَوْمَيْنِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 16,
        "matchingEnglishURN": 823210,
        "last_updated": null
    },
    {
        "arabicURN": 923320,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "8.00",
        "hadithNumber": "2329",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي التَّقَدُّمِ ",
        "hadithText": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْعَلاَءِ الزُّبَيْدِيُّ، مِنْ كِتَابِهِ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْعَلاَءِ، عَنْ أَبِي الأَزْهَرِ الْمُغِيرَةِ بْنِ فَرْوَةَ، قَالَ قَامَ مُعَاوِيَةُ فِي النَّاسِ بِدَيْرِ مِسْحَلٍ الَّذِي عَلَى بَابِ حِمْصَ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّا قَدْ رَأَيْنَا الْهِلاَلَ يَوْمَ كَذَا وَكَذَا وَأَنَا مُتَقَدِّمٌ بِالصِّيَامِ فَمَنْ أَحَبَّ أَنْ يَفْعَلَهُ فَلْيَفْعَلْهُ ‏.‏ قَالَ فَقَامَ إِلَيْهِ مَالِكُ بْنُ هُبَيْرَةَ السَّبَئِيُّ فَقَالَ يَا مُعَاوِيَةُ أَشَىْءٌ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَمْ شَىْءٌ مِنْ رَأْيِكَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ صُومُوا الشَّهْرَ وَسِرَّهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 17,
        "matchingEnglishURN": 823220,
        "last_updated": null
    },
    {
        "arabicURN": 923330,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "8.00",
        "hadithNumber": "2330",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي التَّقَدُّمِ ",
        "hadithText": "حَدَّثَنَا سُلَيْمَانُ بْنُ عَبْدِ الرَّحْمَنِ الدِّمَشْقِيُّ، - فِي هَذَا الْحَدِيثِ - قَالَ قَالَ الْوَلِيدُ سَمِعْتُ أَبَا عَمْرٍو - يَعْنِي الأَوْزَاعِيَّ - يَقُولُ سِرُّهُ أَوَّلُهُ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "شاذ مقطوع",
        "ourHadithNumber": 18,
        "matchingEnglishURN": 823230,
        "last_updated": null
    },
    {
        "arabicURN": 923340,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "8.00",
        "hadithNumber": "2331",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي التَّقَدُّمِ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الْوَاحِدِ، حَدَّثَنَا أَبُو مُسْهِرٍ، قَالَ كَانَ سَعِيدٌ - يَعْنِي ابْنَ عَبْدِ الْعَزِيزِ - يَقُولُ سِرُّهُ أَوَّلُهُ ‏.‏ قَالَ أَبُو دَاوُدَ وَقَالَ بَعْضُهُمْ سِرُّهُ وَسَطُهُ وَقَالُوا آخِرُهُ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "شاذ",
        "ourHadithNumber": 19,
        "matchingEnglishURN": 823240,
        "last_updated": null
    },
    {
        "arabicURN": 923350,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "9.00",
        "hadithNumber": "2332",
        "bookName": " كتاب الصوم ",
        "babName": " باب إِذَا رُؤِيَ الْهِلاَلُ فِي بَلَدٍ قَبْلَ الآخَرِينَ بِلَيْلَةٍ ",
        "hadithText": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ جَعْفَرٍ - أَخْبَرَنِي مُحَمَّدُ بْنُ أَبِي حَرْمَلَةَ، أَخْبَرَنِي كُرَيْبٌ، أَنَّ أُمَّ الْفَضْلِ ابْنَةَ الْحَارِثِ، بَعَثَتْهُ إِلَى مُعَاوِيَةَ بِالشَّامِ قَالَ فَقَدِمْتُ الشَّامَ فَقَضَيْتُ حَاجَتَهَا فَاسْتُهِلَّ رَمَضَانُ وَأَنَا بِالشَّامِ فَرَأَيْنَا الْهِلاَلَ لَيْلَةَ الْجُمُعَةِ ثُمَّ قَدِمْتُ الْمَدِينَةَ فِي آخِرِ الشَّهْرِ فَسَأَلَنِي ابْنُ عَبَّاسٍ ثُمَّ ذَكَرَ الْهِلاَلَ فَقَالَ مَتَى رَأَيْتُمُ الْهِلاَلَ قُلْتُ رَأَيْتُهُ لَيْلَةَ الْجُمُعَةِ ‏.‏ قَالَ أَنْتَ رَأَيْتَهُ قُلْتُ نَعَمْ وَرَآهُ النَّاسُ وَصَامُوا وَصَامَ مُعَاوِيَةُ ‏.‏ قَالَ لَكِنَّا رَأَيْنَاهُ لَيْلَةَ السَّبْتِ فَلاَ نَزَالُ نَصُومُهُ حَتَّى نُكْمِلَ الثَّلاَثِينَ أَوْ نَرَاهُ ‏.‏ فَقُلْتُ أَفَلاَ تَكْتَفِي بِرُؤْيَةِ مُعَاوِيَةَ وَصِيَامِهِ قَالَ لاَ هَكَذَا أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 20,
        "matchingEnglishURN": 823250,
        "last_updated": null
    },
    {
        "arabicURN": 923360,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "9.00",
        "hadithNumber": "2333",
        "bookName": " كتاب الصوم ",
        "babName": " باب إِذَا رُؤِيَ الْهِلاَلُ فِي بَلَدٍ قَبْلَ الآخَرِينَ بِلَيْلَةٍ ",
        "hadithText": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنِي أَبِي، حَدَّثَنَا الأَشْعَثُ، عَنِ الْحَسَنِفِي رَجُلٍ كَانَ بِمِصْرٍ مِنَ الأَمْصَارِ فَصَامَ يَوْمَ الاِثْنَيْنِ وَشَهِدَ رَجُلاَنِ أَنَّهُمَا رَأَيَا الْهِلاَلَ لَيْلَةَ الأَحَدِ فَقَالَ لاَ يَقْضِي ذَلِكَ الْيَوْمَ الرَّجُلُ وَلاَ أَهْلُ مِصْرِهِ إِلاَّ أَنْ يَعْلَمُوا أَنَّ أَهْلَ مِصْرٍ مِنْ أَمْصَارِ الْمُسْلِمِينَ قَدْ صَامُوا يَوْمَ الأَحَدِ فَيَقْضُونَهُ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح مقطوع",
        "ourHadithNumber": 21,
        "matchingEnglishURN": 823260,
        "last_updated": null
    },
    {
        "arabicURN": 923370,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "10.00",
        "hadithNumber": "2334",
        "bookName": " كتاب الصوم ",
        "babName": " باب كَرَاهِيَةِ صَوْمِ يَوْمِ الشَّكِّ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ عَمْرِو بْنِ قَيْسٍ، عَنْ أَبِي إِسْحَاقَ، عَنْ صِلَةَ، قَالَ كُنَّا عِنْدَ عَمَّارٍ فِي الْيَوْمِ الَّذِي يُشَكُّ فِيهِ فَأُتِيَ بِشَاةٍ فَتَنَحَّى بَعْضُ الْقَوْمِ فَقَالَ عَمَّارٌ مَنْ صَامَ هَذَا الْيَوْمَ فَقَدْ عَصَى أَبَا الْقَاسِمِ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 22,
        "matchingEnglishURN": 823270,
        "last_updated": null
    },
    {
        "arabicURN": 923380,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "11.00",
        "hadithNumber": "2335",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِيمَنْ يَصِلُ شَعْبَانَ بِرَمَضَانَ ",
        "hadithText": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَقَدَّمُوا صَوْمَ رَمَضَانَ بِيَوْمٍ وَلاَ يَوْمَيْنِ إِلاَّ أَنْ يَكُونَ صَوْمًا يَصُومُهُ رَجُلٌ فَلْيَصُمْ ذَلِكَ الصَّوْمَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 23,
        "matchingEnglishURN": 823280,
        "last_updated": null
    },
    {
        "arabicURN": 923390,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "11.00",
        "hadithNumber": "2336",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِيمَنْ يَصِلُ شَعْبَانَ بِرَمَضَانَ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ تَوْبَةَ الْعَنْبَرِيِّ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ لَمْ يَكُنْ يَصُومُ مِنَ السَّنَةِ شَهْرًا تَامًّا إِلاَّ شَعْبَانَ يَصِلُهُ بِرَمَضَانَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 24,
        "matchingEnglishURN": 823290,
        "last_updated": null
    },
    {
        "arabicURN": 923400,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "12.00",
        "hadithNumber": "2337",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي كَرَاهِيَةِ ذَلِكَ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، قَالَ قَدِمَ عَبَّادُ بْنُ كَثِيرٍ الْمَدِينَةَ فَمَالَ إِلَى مَجْلِسِ الْعَلاَءِ فَأَخَذَ بِيَدِهِ فَأَقَامَهُ ثُمَّ قَالَ اللَّهُمَّ إِنَّ هَذَا يُحَدِّثُ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا انْتَصَفَ شَعْبَانُ فَلاَ تَصُومُوا ‏\"‏ ‏.‏ فَقَالَ الْعَلاَءُ اللَّهُمَّ إِنَّ أَبِي حَدَّثَنِي عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم بِذَلِكَ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ الثَّوْرِيُّ وَشِبْلُ بْنُ الْعَلاَءِ وَأَبُو عُمَيْسٍ وَزُهَيْرُ بْنُ مُحَمَّدٍ عَنِ الْعَلاَءِ ‏.‏ قَالَ أَبُو دَاوُدَ وَكَانَ عَبْدُ الرَّحْمَنِ لاَ يُحَدِّثُ بِهِ قُلْتُ لأَحْمَدَ لِمَ قَالَ لأَنَّهُ كَانَ عِنْدَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَصِلُ شَعْبَانَ بِرَمَضَانَ وَقَالَ عَنِ النَّبِيِّ صلى الله عليه وسلم خِلاَفَهُ ‏.‏ قَالَ أَبُو دَاوُدَ وَلَيْسَ هَذَا عِنْدِي خِلاَفَهُ وَلَمْ يَجِئْ بِهِ غَيْرُ الْعَلاَءِ عَنْ أَبِيهِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 25,
        "matchingEnglishURN": 823300,
        "last_updated": null
    },
    {
        "arabicURN": 923410,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "13.00",
        "hadithNumber": "2338",
        "bookName": " كتاب الصوم ",
        "babName": " باب شَهَادَةِ رَجُلَيْنِ عَلَى رُؤْيَةِ هِلاَلِ شَوَّالٍ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ أَبُو يَحْيَى الْبَزَّازُ، حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، حَدَّثَنَا عَبَّادٌ، عَنْ أَبِي مَالِكٍ الأَشْجَعِيِّ، حَدَّثَنَا حُسَيْنُ بْنُ الْحَارِثِ الْجَدَلِيُّ، - مِنْ جَدِيلَةِ قَيْسٍ أَنَّ أَمِيرَ مَكَّةَ خَطَبَ ثُمَّ قَالَ عَهِدَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ نَنْسُكَ لِلرُّؤْيَةِ فَإِنْ لَمْ نَرَهُ وَشَهِدَ شَاهِدَا عَدْلٍ نَسَكْنَا بِشَهَادَتِهِمَا فَسَأَلْتُ الْحُسَيْنَ بْنَ الْحَارِثِ مَنْ أَمِيرُ مَكَّةَ قَالَ لاَ أَدْرِي ‏.‏ ثُمَّ لَقِيَنِي بَعْدُ فَقَالَ هُوَ الْحَارِثُ بْنُ حَاطِبٍ أَخُو مُحَمَّدِ بْنِ حَاطِبٍ ثُمَّ قَالَ الأَمِيرُ إِنَّ فِيكُمْ مَنْ هُوَ أَعْلَمُ بِاللَّهِ وَرَسُولِهِ مِنِّي وَشَهِدَ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ وَأَوْمَأَ بِيَدِهِ إِلَى رَجُلٍ قَالَ الْحُسَيْنُ فَقُلْتُ لِشَيْخٍ إِلَى جَنْبِي مَنْ هَذَا الَّذِي أَوْمَأَ إِلَيْهِ الأَمِيرُ قَالَ هَذَا عَبْدُ اللَّهِ بْنُ عُمَرَ ‏.‏ وَصَدَقَ كَانَ أَعْلَمَ بِاللَّهِ مِنْهُ فَقَالَ بِذَلِكَ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 26,
        "matchingEnglishURN": 823310,
        "last_updated": null
    },
    {
        "arabicURN": 923420,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "13.00",
        "hadithNumber": "2339",
        "bookName": " كتاب الصوم ",
        "babName": " باب شَهَادَةِ رَجُلَيْنِ عَلَى رُؤْيَةِ هِلاَلِ شَوَّالٍ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، وَخَلَفُ بْنُ هِشَامٍ الْمُقْرِئُ، قَالاَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مَنْصُورٍ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ رَجُلٍ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم قَالَ اخْتَلَفَ النَّاسُ فِي آخِرِ يَوْمٍ مِنْ رَمَضَانَ فَقَدِمَ أَعْرَابِيَّانِ فَشَهِدَا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِاللَّهِ لأَهَلاَّ الْهِلاَلَ أَمْسِ عَشِيَّةً فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم النَّاسَ أَنْ يُفْطِرُوا زَادَ خَلَفٌ فِي حَدِيثِهِ وَأَنْ يَغْدُوا إِلَى مُصَلاَّهُمْ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 27,
        "matchingEnglishURN": 823320,
        "last_updated": null
    },
    {
        "arabicURN": 923430,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "14.00",
        "hadithNumber": "2340",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي شَهَادَةِ الْوَاحِدِ عَلَى رُؤْيَةِ هِلاَلِ رَمَضَانَ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارِ بْنِ الرَّيَّانِ، حَدَّثَنَا الْوَلِيدُ، - يَعْنِي ابْنَ أَبِي ثَوْرٍ ح وَحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا الْحُسَيْنُ، - يَعْنِي الْجُعْفِيَّ - عَنْ زَائِدَةَ، - الْمَعْنَى - عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنِّي رَأَيْتُ الْهِلاَلَ - قَالَ الْحَسَنُ فِي حَدِيثِهِ يَعْنِي رَمَضَانَ - فَقَالَ ‏\"‏ أَتَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ أَتَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ يَا بِلاَلُ أَذِّنْ فِي النَّاسِ فَلْيَصُومُوا غَدًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 28,
        "matchingEnglishURN": 823330,
        "last_updated": null
    },
    {
        "arabicURN": 923440,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "14.00",
        "hadithNumber": "2341",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي شَهَادَةِ الْوَاحِدِ عَلَى رُؤْيَةِ هِلاَلِ رَمَضَانَ ",
        "hadithText": "حَدَّثَنِي مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ عِكْرِمَةَ، أَنَّهُمْ شَكُّوا فِي هِلاَلِ رَمَضَانَ مَرَّةً فَأَرَادُوا أَنْ لاَ يَقُومُوا وَلاَ يَصُومُوا فَجَاءَ أَعْرَابِيٌّ مِنَ الْحَرَّةِ فَشَهِدَ أَنَّهُ رَأَى الْهِلاَلَ فَأُتِيَ بِهِ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَتَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنِّي رَسُولُ اللَّهِ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ وَشَهِدَ أَنَّهُ رَأَى الْهِلاَلَ فَأَمَرَ بِلاَلاً فَنَادَى فِي النَّاسِ أَنْ يَقُومُوا وَأَنْ يَصُومُوا ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ جَمَاعَةٌ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ مُرْسَلاً وَلَمْ يَذْكُرِ الْقِيَامَ أَحَدٌ إِلاَّ حَمَّادُ بْنُ سَلَمَةَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 29,
        "matchingEnglishURN": 823340,
        "last_updated": null
    },
    {
        "arabicURN": 923450,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "14.00",
        "hadithNumber": "2342",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي شَهَادَةِ الْوَاحِدِ عَلَى رُؤْيَةِ هِلاَلِ رَمَضَانَ ",
        "hadithText": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ، وَعَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ السَّمَرْقَنْدِيُّ، - وَأَنَا لِحَدِيثِهِ، أَتْقَنُ - قَالاَ حَدَّثَنَا مَرْوَانُ، - هُوَ ابْنُ مُحَمَّدٍ - عَنْ عَبْدِ اللَّهِ بْنِ وَهْبٍ، عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ سَالِمٍ، عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، قَالَ تَرَاءَى النَّاسُ الْهِلاَلَ فَأَخْبَرْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنِّي رَأَيْتُهُ فَصَامَهُ وَأَمَرَ النَّاسَ بِصِيَامِهِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 30,
        "matchingEnglishURN": 823350,
        "last_updated": null
    },
    {
        "arabicURN": 923460,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "15.00",
        "hadithNumber": "2343",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي تَوْكِيدِ السُّحُورِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ مُوسَى بْنِ عُلَىِّ بْنِ رَبَاحٍ، عَنْ أَبِيهِ، عَنْ أَبِي قَيْسٍ، مَوْلَى عَمْرِو بْنِ الْعَاصِ عَنْ عَمْرِو بْنِ الْعَاصِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ فَصْلَ مَا بَيْنَ صِيَامِنَا وَصِيَامِ أَهْلِ الْكِتَابِ أَكْلَةُ السَّحَرِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 31,
        "matchingEnglishURN": 823360,
        "last_updated": null
    },
    {
        "arabicURN": 923470,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "16.00",
        "hadithNumber": "2344",
        "bookName": " كتاب الصوم ",
        "babName": " باب مَنْ سَمَّى السَّحُورَ الْغَدَاءَ ",
        "hadithText": "حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ النَّاقِدُ، حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ الْخَيَّاطُ، حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ يُونُسَ بْنِ سَيْفٍ، عَنِ الْحَارِثِ بْنِ زِيَادٍ، عَنْ أَبِي رُهْمٍ، عَنِ الْعِرْبَاضِ بْنِ سَارِيَةَ، قَالَ دَعَانِي رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى السَّحُورِ فِي رَمَضَانَ فَقَالَ ‏\"‏ هَلُمَّ إِلَى الْغَدَاءِ الْمُبَارَكِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 32,
        "matchingEnglishURN": 823370,
        "last_updated": null
    },
    {
        "arabicURN": 923480,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "16.00",
        "hadithNumber": "2345",
        "bookName": " كتاب الصوم ",
        "babName": " باب مَنْ سَمَّى السَّحُورَ الْغَدَاءَ ",
        "hadithText": "حَدَّثَنَا عُمَرُ بْنُ الْحَسَنِ بْنِ إِبْرَاهِيمَ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي الْوَزِيرِ أَبُو الْمُطَرِّفِ، حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ نِعْمَ سَحُورُ الْمُؤْمِنِ التَّمْرُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 33,
        "matchingEnglishURN": 823380,
        "last_updated": null
    },
    {
        "arabicURN": 923490,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "17.00",
        "hadithNumber": "2346",
        "bookName": " كتاب الصوم ",
        "babName": " باب وَقْتِ السُّحُورِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَبْدِ اللَّهِ بْنِ سَوَادَةَ الْقُشَيْرِيِّ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ سَمُرَةَ بْنَ جُنْدُبٍ، يَخْطُبُ وَهُوَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يَمْنَعَنَّ مِنْ سَحُورِكُمْ أَذَانُ بِلاَلٍ وَلاَ بَيَاضُ الأُفُقِ الَّذِي هَكَذَا حَتَّى يَسْتَطِيرَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 34,
        "matchingEnglishURN": 823390,
        "last_updated": null
    },
    {
        "arabicURN": 923500,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "17.00",
        "hadithNumber": "2347",
        "bookName": " كتاب الصوم ",
        "babName": " باب وَقْتِ السُّحُورِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ التَّيْمِيِّ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا سُلَيْمَانُ التَّيْمِيُّ، عَنْ أَبِي عُثْمَانَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يَمْنَعَنَّ أَحَدَكُمْ أَذَانُ بِلاَلٍ مِنْ سَحُورِهِ فَإِنَّهُ يُؤَذِّنُ - أَوْ قَالَ يُنَادِي - لِيَرْجِعَ قَائِمُكُمْ وَيَنْتَبِهَ نَائِمُكُمْ وَلَيْسَ الْفَجْرُ أَنْ يَقُولَ هَكَذَا ‏\"‏ ‏.‏ قَالَ مُسَدَّدٌ وَجَمَعَ يَحْيَى كَفَّيْهِ حَتَّى يَقُولَ هَكَذَا وَمَدَّ يَحْيَى بِأُصْبَعَيْهِ السَّبَّابَتَيْنِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 35,
        "matchingEnglishURN": 823400,
        "last_updated": null
    },
    {
        "arabicURN": 923510,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "17.00",
        "hadithNumber": "2348",
        "bookName": " كتاب الصوم ",
        "babName": " باب وَقْتِ السُّحُورِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، حَدَّثَنَا مُلاَزِمُ بْنُ عَمْرٍو، عَنْ عَبْدِ اللَّهِ بْنِ النُّعْمَانِ، حَدَّثَنِي قَيْسُ بْنُ طَلْقٍ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كُلُوا وَاشْرَبُوا وَلاَ يَهِيدَنَّكُمُ السَّاطِعُ الْمُصْعِدُ فَكُلُوا وَاشْرَبُوا حَتَّى يَعْتَرِضَ لَكُمُ الأَحْمَرُ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ هَذَا مِمَّا تَفَرَّدَ بِهِ أَهْلُ الْيَمَامَةِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "حسن صحيح",
        "ourHadithNumber": 36,
        "matchingEnglishURN": 823410,
        "last_updated": null
    },
    {
        "arabicURN": 923520,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "17.00",
        "hadithNumber": "2349",
        "bookName": " كتاب الصوم ",
        "babName": " باب وَقْتِ السُّحُورِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حُصَيْنُ بْنُ نُمَيْرٍ، ح وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ إِدْرِيسَ، - الْمَعْنَى - عَنْ حُصَيْنٍ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ ‏<A id=\"q10\" name=\"q10\" href=\"javascript:openquran(1,187,187)\"><c_q10>{‏ حَتَّى يَتَبَيَّنَ لَكُمُ الْخَيْطُ الأَبْيَضُ مِنَ الْخَيْطِ الأَسْوَدِ ‏}</c_q10></a>‏ ‏.‏ قَالَ أَخَذْتُ عِقَالاً أَبْيَضَ وَعِقَالاً أَسْوَدَ فَوَضَعْتُهُمَا تَحْتَ وِسَادَتِي فَنَظَرْتُ فَلَمْ أَتَبَيَّنْ فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَضَحِكَ فَقَالَ ‏\"‏ إِنَّ وِسَادَكَ لَعَرِيضٌ طَوِيلٌ إِنَّمَا هُوَ اللَّيْلُ وَالنَّهَارُ ‏\"‏ ‏.‏ قَالَ عُثْمَانُ ‏\"‏ إِنَّمَا هُوَ سَوَادُ اللَّيْلِ وَبَيَاضُ النَّهَارِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 37,
        "matchingEnglishURN": 823420,
        "last_updated": null
    },
    {
        "arabicURN": 923530,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "18.00",
        "hadithNumber": "2350",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي الرَّجُلِ يَسْمَعُ النِّدَاءَ وَالإِنَاءُ عَلَى يَدِهِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، حَدَّثَنَا حَمَّادٌ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا سَمِعَ أَحَدُكُمُ النِّدَاءَ وَالإِنَاءُ عَلَى يَدِهِ فَلاَ يَضَعْهُ حَتَّى يَقْضِيَ حَاجَتَهُ مِنْهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "حسن صحيح",
        "ourHadithNumber": 38,
        "matchingEnglishURN": 823430,
        "last_updated": null
    },
    {
        "arabicURN": 923540,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "19.00",
        "hadithNumber": "2351",
        "bookName": " كتاب الصوم ",
        "babName": " باب وَقْتِ فِطْرِ الصَّائِمِ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا هِشَامٌ، ح وَحَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ، عَنْ هِشَامٍ، - الْمَعْنَى - قَالَ هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ، عَنْ عَاصِمِ بْنِ عُمَرَ، عَنْ أَبِيهِ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِذَا جَاءَ اللَّيْلُ مِنْ هَا هُنَا وَذَهَبَ النَّهَارُ مِنْ هَا هُنَا ‏\"‏ ‏.‏ زَادَ مُسَدَّدٌ ‏\"‏ وَغَابَتِ الشَّمْسُ فَقَدْ أَفْطَرَ الصَّائِمُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 39,
        "matchingEnglishURN": 823440,
        "last_updated": null
    },
    {
        "arabicURN": 923550,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "19.00",
        "hadithNumber": "2352",
        "bookName": " كتاب الصوم ",
        "babName": " باب وَقْتِ فِطْرِ الصَّائِمِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا سُلَيْمَانُ الشَّيْبَانِيُّ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى، يَقُولُ سِرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ صَائِمٌ فَلَمَّا غَرَبَتِ الشَّمْسُ قَالَ ‏\"‏ يَا بِلاَلُ انْزِلْ فَاجْدَحْ لَنَا ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ لَوْ أَمْسَيْتَ ‏.‏ قَالَ ‏\"‏ انْزِلْ فَاجْدَحْ لَنَا ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ إِنَّ عَلَيْكَ نَهَارًا ‏.‏ قَالَ ‏\"‏ انْزِلْ فَاجْدَحْ لَنَا ‏\"‏ ‏.‏ فَنَزَلَ فَجَدَحَ فَشَرِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ إِذَا رَأَيْتُمُ اللَّيْلَ قَدْ أَقْبَلَ مِنْ هَا هُنَا فَقَدْ أَفْطَرَ الصَّائِمُ ‏\"‏ ‏.‏ وَأَشَارَ بِأُصْبُعِهِ قِبَلَ الْمَشْرِقِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 40,
        "matchingEnglishURN": 823450,
        "last_updated": null
    },
    {
        "arabicURN": 923560,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "20.00",
        "hadithNumber": "2353",
        "bookName": " كتاب الصوم ",
        "babName": " باب مَا يُسْتَحَبُّ مِنْ تَعْجِيلِ الْفِطْرِ ",
        "hadithText": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ، عَنْ خَالِدٍ، عَنْ مُحَمَّدٍ، - يَعْنِي ابْنَ عَمْرٍو - عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَزَالُ الدِّينُ ظَاهِرًا مَا عَجَّلَ النَّاسُ الْفِطْرَ لأَنَّ الْيَهُودَ وَالنَّصَارَى يُؤَخِّرُونَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "حسن",
        "ourHadithNumber": 41,
        "matchingEnglishURN": 823460,
        "last_updated": null
    },
    {
        "arabicURN": 923570,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "20.00",
        "hadithNumber": "2354",
        "bookName": " كتاب الصوم ",
        "babName": " باب مَا يُسْتَحَبُّ مِنْ تَعْجِيلِ الْفِطْرِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ أَبِي عَطِيَّةَ، قَالَ دَخَلْتُ عَلَى عَائِشَةَ - رضى الله عنها - أَنَا وَمَسْرُوقٌ فَقُلْنَا يَا أُمَّ الْمُؤْمِنِينَ رَجُلاَنِ مِنْ أَصْحَابِ مُحَمَّدٍ صلى الله عليه وسلم أَحَدُهُمَا يُعَجِّلُ الإِفْطَارَ وَيُعَجِّلُ الصَّلاَةَ وَالآخَرُ يُؤَخِّرُ الإِفْطَارَ وَيُؤَخِّرُ الصَّلاَةَ قَالَتْ أَيُّهُمَا يُعَجِّلُ الإِفْطَارَ وَيُعَجِّلُ الصَّلاَةَ قُلْنَا عَبْدُ اللَّهِ ‏.‏ قَالَتْ كَذَلِكَ كَانَ يَصْنَعُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 42,
        "matchingEnglishURN": 823470,
        "last_updated": null
    },
    {
        "arabicURN": 923580,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "21.00",
        "hadithNumber": "2355",
        "bookName": " كتاب الصوم ",
        "babName": " باب مَا يُفْطَرُ عَلَيْهِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، عَنْ عَاصِمٍ الأَحْوَلِ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، عَنِ الرَّبَابِ، عَنْ سَلْمَانَ بْنِ عَامِرٍ، عَمِّهَا قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا كَانَ أَحَدُكُمْ صَائِمًا فَلْيُفْطِرْ عَلَى التَّمْرِ فَإِنْ لَمْ يَجِدِ التَّمْرَ فَعَلَى الْمَاءِ فَإِنَّ الْمَاءَ طَهُورٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 43,
        "matchingEnglishURN": 823480,
        "last_updated": null
    },
    {
        "arabicURN": 923590,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "21.00",
        "hadithNumber": "2356",
        "bookName": " كتاب الصوم ",
        "babName": " باب مَا يُفْطَرُ عَلَيْهِ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُفْطِرُ عَلَى رُطَبَاتٍ قَبْلَ أَنْ يُصَلِّيَ فَإِنْ لَمْ تَكُنْ رُطَبَاتٌ فَعَلَى تَمَرَاتٍ فَإِنْ لَمْ تَكُنْ حَسَا حَسَوَاتٍ مِنْ مَاءٍ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "حسن صحيح",
        "ourHadithNumber": 44,
        "matchingEnglishURN": 823490,
        "last_updated": null
    },
    {
        "arabicURN": 923600,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "22.00",
        "hadithNumber": "2357",
        "bookName": " كتاب الصوم ",
        "babName": " باب الْقَوْلِ عِنْدَ الإِفْطَارِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ يَحْيَى أَبُو مُحَمَّدٍ، حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ، أَخْبَرَنِي الْحُسَيْنُ بْنُ وَاقِدٍ، حَدَّثَنَا مَرْوَانُ، - يَعْنِي ابْنَ سَالِمٍ - الْمُقَفَّعُ - قَالَ رَأَيْتُ ابْنَ عُمَرَ يَقْبِضُ عَلَى لِحْيَتِهِ فَيَقْطَعُ مَا زَادَ عَلَى الْكَفِّ وَقَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَفْطَرَ قَالَ ‏\"‏ ذَهَبَ الظَّمَأُ وَابْتَلَّتِ الْعُرُوقُ وَثَبَتَ الأَجْرُ إِنْ شَاءَ اللَّهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "حسن",
        "ourHadithNumber": 45,
        "matchingEnglishURN": 823500,
        "last_updated": null
    },
    {
        "arabicURN": 923610,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "22.00",
        "hadithNumber": "2358",
        "bookName": " كتاب الصوم ",
        "babName": " باب الْقَوْلِ عِنْدَ الإِفْطَارِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا هُشَيْمٌ، عَنْ حُصَيْنٍ، عَنْ مُعَاذِ بْنِ زُهْرَةَ، أَنَّهُ بَلَغَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا أَفْطَرَ قَالَ ‏\"‏ اللَّهُمَّ لَكَ صُمْتُ وَعَلَى رِزْقِكَ أَفْطَرْتُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 46,
        "matchingEnglishURN": 823510,
        "last_updated": null
    },
    {
        "arabicURN": 923620,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "23.00",
        "hadithNumber": "2359",
        "bookName": " كتاب الصوم ",
        "babName": " باب الْفِطْرِ قَبْلَ غُرُوبِ الشَّمْسِ ",
        "hadithText": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، وَمُحَمَّدُ بْنُ الْعَلاَءِ، - الْمَعْنَى - قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، قَالَتْ أَفْطَرْنَا يَوْمًا فِي رَمَضَانَ فِي غَيْمٍ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ طَلَعَتِ الشَّمْسُ قَالَ أَبُو أُسَامَةَ قُلْتُ لِهِشَامٍ أُمِرُوا بِالْقَضَاءِ قَالَ وَبُدٌّ مِنْ ذَلِكَ",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 47,
        "matchingEnglishURN": 823520,
        "last_updated": null
    },
    {
        "arabicURN": 923630,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "24.00",
        "hadithNumber": "2360",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي الْوِصَالِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ نَهَى عَنِ الْوِصَالِ، قَالُوا فَإِنَّكَ تُوَاصِلُ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ إِنِّي لَسْتُ كَهَيْئَتِكُمْ إِنِّي أُطْعَمُ وَأُسْقَى ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 48,
        "matchingEnglishURN": 823530,
        "last_updated": null
    },
    {
        "arabicURN": 923640,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "24.00",
        "hadithNumber": "2361",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي الْوِصَالِ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، أَنَّ بَكْرَ بْنَ مُضَرَ، حَدَّثَهُمْ عَنِ ابْنِ الْهَادِ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ تُوَاصِلُوا فَأَيُّكُمْ أَرَادَ أَنْ يُوَاصِلَ فَلْيُوَاصِلْ حَتَّى السَّحَرِ ‏\"‏ ‏.‏ قَالُوا فَإِنَّكَ تُوَاصِلُ ‏.‏ قَالَ ‏\"‏ إِنِّي لَسْتُ كَهَيْئَتِكُمْ إِنَّ لِي مُطْعِمًا يُطْعِمُنِي وَسَاقِيًا يَسْقِينِي ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 49,
        "matchingEnglishURN": 823540,
        "last_updated": null
    },
    {
        "arabicURN": 923650,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "25.00",
        "hadithNumber": "2362",
        "bookName": " كتاب الصوم ",
        "babName": " باب الْغِيبَةِ لِلصَّائِمِ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ لَمْ يَدَعْ قَوْلَ الزُّورِ وَالْعَمَلَ بِهِ فَلَيْسَ لِلَّهِ حَاجَةٌ أَنْ يَدَعَ طَعَامَهُ وَشَرَابَهُ ‏\"‏ ‏.‏ قَالَ أَحْمَدُ فَهِمْتُ إِسْنَادَهُ مِنَ ابْنِ أَبِي ذِئْبٍ وَأَفْهَمَنِي الْحَدِيثَ رَجُلٌ إِلَى جَنْبِهِ أُرَاهُ ابْنَ أَخِيهِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 50,
        "matchingEnglishURN": 823550,
        "last_updated": null
    },
    {
        "arabicURN": 923660,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "25.00",
        "hadithNumber": "2363",
        "bookName": " كتاب الصوم ",
        "babName": " باب الْغِيبَةِ لِلصَّائِمِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ الصِّيَامُ جُنَّةٌ إِذَا كَانَ أَحَدُكُمْ صَائِمًا فَلاَ يَرْفُثْ وَلاَ يَجْهَلْ فَإِنِ امْرُؤٌ قَاتَلَهُ أَوْ شَاتَمَهُ فَلْيَقُلْ إِنِّي صَائِمٌ إِنِّي صَائِمٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 51,
        "matchingEnglishURN": 823560,
        "last_updated": null
    },
    {
        "arabicURN": 923670,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "26.00",
        "hadithNumber": "2364",
        "bookName": " كتاب الصوم ",
        "babName": " باب السِّوَاكِ لِلصَّائِمِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا شَرِيكٌ، ح وَحَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ، عَنْ أَبِيهِ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَسْتَاكُ وَهُوَ صَائِمٌ ‏.‏ زَادَ مُسَدَّدٌ مَا لاَ أَعُدُّ وَلاَ أُحْصِي ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 52,
        "matchingEnglishURN": 823570,
        "last_updated": null
    },
    {
        "arabicURN": 923680,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "27.00",
        "hadithNumber": "2365",
        "bookName": " كتاب الصوم ",
        "babName": " باب الصَّائِمِ يَصُبُّ عَلَيْهِ الْمَاءَ مِنَ الْعَطَشِ وَيُبَالِغُ فِي الاِسْتِنْشَاقِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ بَعْضِ، أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ النَّاسَ فِي سَفَرِهِ عَامَ الْفَتْحِ بِالْفِطْرِ وَقَالَ ‏\"‏ تَقَوَّوْا لِعَدُوِّكُمْ ‏\"‏ ‏.‏ وَصَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو بَكْرٍ قَالَ الَّذِي حَدَّثَنِي لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم بِالْعَرْجِ يَصُبُّ عَلَى رَأْسِهِ الْمَاءَ وَهُوَ صَائِمٌ مِنَ الْعَطَشِ أَوْ مِنَ الْحَرِّ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 53,
        "matchingEnglishURN": 823581,
        "last_updated": null
    },
    {
        "arabicURN": 923690,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "27.00",
        "hadithNumber": "2366",
        "bookName": " كتاب الصوم ",
        "babName": " باب الصَّائِمِ يَصُبُّ عَلَيْهِ الْمَاءَ مِنَ الْعَطَشِ وَيُبَالِغُ فِي الاِسْتِنْشَاقِ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنِي يَحْيَى بْنُ سُلَيْمٍ، عَنْ إِسْمَاعِيلَ بْنِ كَثِيرٍ، عَنْ عَاصِمِ بْنِ لَقِيطِ بْنِ صَبِرَةَ، عَنْ أَبِيهِ، لَقِيطِ بْنِ صَبِرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بَالِغْ فِي الاِسْتِنْشَاقِ إِلاَّ أَنْ تَكُونَ صَائِمًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 54,
        "matchingEnglishURN": 823600,
        "last_updated": null
    },
    {
        "arabicURN": 923700,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "28.00",
        "hadithNumber": "2367",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي الصَّائِمِ يَحْتَجِمُ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا حَسَنُ بْنُ مُوسَى، حَدَّثَنَا شَيْبَانُ، - جَمِيعًا - عَنْ يَحْيَى، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي أَسْمَاءَ، - يَعْنِي الرَّحَبِيَّ - عَنْ ثَوْبَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ ‏\"‏ ‏.‏ قَالَ شَيْبَانُ أَخْبَرَنِي أَبُو قِلاَبَةَ أَنَّ أَبَا أَسْمَاءَ الرَّحَبِيَّ حَدَّثَهُ أَنَّ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَخْبَرَهُ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 55,
        "matchingEnglishURN": 823610,
        "last_updated": null
    },
    {
        "arabicURN": 923710,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "28.00",
        "hadithNumber": "2368",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي الصَّائِمِ يَحْتَجِمُ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا حَسَنُ بْنُ مُوسَى، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، قَالَ حَدَّثَنِي أَبُو قِلاَبَةَ الْجَرْمِيُّ، أَنَّهُ أَخْبَرَهُ أَنَّ شَدَّادَ بْنَ أَوْسٍ بَيْنَمَا هُوَ يَمْشِي مَعَ النَّبِيِّ صلى الله عليه وسلم فَذَكَرَ نَحْوَهُ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 56,
        "matchingEnglishURN": 823620,
        "last_updated": null
    },
    {
        "arabicURN": 923720,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "28.00",
        "hadithNumber": "2369",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي الصَّائِمِ يَحْتَجِمُ ",
        "hadithText": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الأَشْعَثِ، عَنْ شَدَّادِ بْنِ أَوْسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَتَى عَلَى رَجُلٍ بِالْبَقِيعِ وَهُوَ يَحْتَجِمُ وَهُوَ آخِذٌ بِيَدِي لِثَمَانَ عَشْرَةَ خَلَتْ مِنْ رَمَضَانَ فَقَالَ ‏\"‏ أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَرَوَى خَالِدٌ الْحَذَّاءُ عَنْ أَبِي قِلاَبَةَ بِإِسْنَادِ أَيُّوبَ مِثْلَهُ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 57,
        "matchingEnglishURN": 823630,
        "last_updated": null
    },
    {
        "arabicURN": 923730,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "28.00",
        "hadithNumber": "2370",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي الصَّائِمِ يَحْتَجِمُ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، وَعَبْدُ الرَّزَّاقِ، ح وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ إِبْرَاهِيمَ - عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي مَكْحُولٌ، أَنَّ شَيْخًا، مِنَ الْحَىِّ - قَالَ عُثْمَانُ فِي حَدِيثِهِ مُصَدَّقٌ - أَخْبَرَهُ أَنَّ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَخْبَرَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 58,
        "matchingEnglishURN": 823640,
        "last_updated": null
    },
    {
        "arabicURN": 923740,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "28.00",
        "hadithNumber": "2371",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي الصَّائِمِ يَحْتَجِمُ ",
        "hadithText": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ، حَدَّثَنَا مَرْوَانُ، حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ، أَخْبَرَنَا الْعَلاَءُ بْنُ الْحَارِثِ، عَنْ مَكْحُولٍ، عَنْ أَبِي أَسْمَاءَ الرَّحَبِيِّ، عَنْ ثَوْبَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَرَوَاهُ ابْنُ ثَوْبَانَ عَنْ أَبِيهِ عَنْ مَكْحُولٍ بِإِسْنَادِهِ مِثْلَهُ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 59,
        "matchingEnglishURN": 823650,
        "last_updated": null
    },
    {
        "arabicURN": 923750,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "29.00",
        "hadithNumber": "2372",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي الرُّخْصَةِ فِي ذَلِكَ ",
        "hadithText": "حَدَّثَنَا أَبُو مَعْمَرٍ عَبْدُ اللَّهِ بْنُ عَمْرٍو، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم احْتَجَمَ وَهُوَ صَائِمٌ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ وُهَيْبُ بْنُ خَالِدٍ عَنْ أَيُّوبَ بِإِسْنَادِهِ مِثْلَهُ ‏.‏ وَجَعْفَرُ بْنُ رَبِيعَةَ وَهِشَامُ بْنُ حَسَّانَ عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ مِثْلَهُ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 60,
        "matchingEnglishURN": 823660,
        "last_updated": null
    },
    {
        "arabicURN": 923760,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "29.00",
        "hadithNumber": "2373",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي الرُّخْصَةِ فِي ذَلِكَ ",
        "hadithText": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم احْتَجَمَ وَهُوَ صَائِمٌ مُحْرِمٌ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 61,
        "matchingEnglishURN": 823670,
        "last_updated": null
    },
    {
        "arabicURN": 923770,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "29.00",
        "hadithNumber": "2374",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي الرُّخْصَةِ فِي ذَلِكَ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، حَدَّثَنِي رَجُلٌ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْحِجَامَةِ وَالْمُوَاصَلَةِ وَلَمْ يُحَرِّمْهُمَا إِبْقَاءً عَلَى أَصْحَابِهِ فَقِيلَ لَهُ يَا رَسُولَ اللَّهِ إِنَّكَ تُوَاصِلُ إِلَى السَّحَرِ ‏.‏ فَقَالَ ‏\"‏ إِنِّي أُوَاصِلُ إِلَى السَّحَرِ وَرَبِّي يُطْعِمُنِي وَيَسْقِينِي ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 62,
        "matchingEnglishURN": 823680,
        "last_updated": null
    },
    {
        "arabicURN": 923780,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "29.00",
        "hadithNumber": "2375",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي الرُّخْصَةِ فِي ذَلِكَ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا سُلَيْمَانُ، - يَعْنِي ابْنَ الْمُغِيرَةِ - عَنْ ثَابِتٍ، قَالَ قَالَ أَنَسٌ مَا كُنَّا نَدَعُ الْحِجَامَةَ لِلصَّائِمِ إِلاَّ كَرَاهِيَةَ الْجَهْدِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 63,
        "matchingEnglishURN": 823690,
        "last_updated": null
    },
    {
        "arabicURN": 923790,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "30.00",
        "hadithNumber": "2376",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي الصَّائِمِ يَحْتَلِمُ نَهَارًا فِي شَهْرِ رَمَضَانَ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ رَجُلٍ، مِنْ أَصْحَابِهِ عَنْ رَجُلٍ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يُفْطِرُ مَنْ قَاءَ وَلاَ مَنِ احْتَلَمَ وَلاَ مَنِ احْتَجَمَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 64,
        "matchingEnglishURN": 823700,
        "last_updated": null
    },
    {
        "arabicURN": 923800,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "31.00",
        "hadithNumber": "2377",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي الْكَحْلِ عِنْدَ النَّوْمِ لِلصَّائِمِ ",
        "hadithText": "حَدَّثَنَا النُّفَيْلِيُّ، حَدَّثَنَا عَلِيُّ بْنُ ثَابِتٍ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ النُّعْمَانِ بْنِ مَعْبَدِ بْنِ هَوْذَةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ أَمَرَ بِالإِثْمِدِ الْمُرَوَّحِ عِنْدَ النَّوْمِ وَقَالَ ‏\"‏ لِيَتَّقِهِ الصَّائِمُ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ قَالَ لِي يَحْيَى بْنُ مَعِينٍ هُوَ حَدِيثٌ مُنْكَرٌ يَعْنِي حَدِيثَ الْكَحْلِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 65,
        "matchingEnglishURN": 823710,
        "last_updated": null
    },
    {
        "arabicURN": 923810,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "31.00",
        "hadithNumber": "2378",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي الْكَحْلِ عِنْدَ النَّوْمِ لِلصَّائِمِ ",
        "hadithText": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ عُتْبَةَ، عَنْ أَبِي مُعَاذٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ أَنَسٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ كَانَ يَكْتَحِلُ وَهُوَ صَائِمٌ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "حسن موقوف",
        "ourHadithNumber": 66,
        "matchingEnglishURN": 823720,
        "last_updated": null
    },
    {
        "arabicURN": 923820,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "31.00",
        "hadithNumber": "2379",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي الْكَحْلِ عِنْدَ النَّوْمِ لِلصَّائِمِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْمُخَرِّمِيُّ، وَيَحْيَى بْنُ مُوسَى الْبَلْخِيُّ، قَالاَ حَدَّثَنَا يَحْيَى بْنُ عِيسَى، عَنِ الأَعْمَشِ، قَالَ مَا رَأَيْتُ أَحَدًا مِنْ أَصْحَابِنَا يَكْرَهُ الْكَحْلَ لِلصَّائِمِ وَكَانَ إِبْرَاهِيمُ يُرَخِّصُ أَنْ يَكْتَحِلَ الصَّائِمُ بِالصَّبِرِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "حسن",
        "ourHadithNumber": 67,
        "matchingEnglishURN": 823730,
        "last_updated": null
    },
    {
        "arabicURN": 923830,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "32.00",
        "hadithNumber": "2380",
        "bookName": " كتاب الصوم ",
        "babName": " باب الصَّائِمِ يَسْتَقِيءُ عَامِدًا ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ ذَرَعَهُ قَىْءٌ وَهُوَ صَائِمٌ فَلَيْسَ عَلَيْهِ قَضَاءٌ وَإِنِ اسْتَقَاءَ فَلْيَقْضِ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ أَيْضًا حَفْصُ بْنُ غِيَاثٍ عَنْ هِشَامٍ مِثْلَهُ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 68,
        "matchingEnglishURN": 823740,
        "last_updated": null
    },
    {
        "arabicURN": 923840,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "32.00",
        "hadithNumber": "2381",
        "bookName": " كتاب الصوم ",
        "babName": " باب الصَّائِمِ يَسْتَقِيءُ عَامِدًا ",
        "hadithText": "حَدَّثَنَا أَبُو مَعْمَرٍ عَبْدُ اللَّهِ بْنُ عَمْرٍو، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا الْحُسَيْنُ، عَنْ يَحْيَى، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَمْرٍو الأَوْزَاعِيُّ، عَنْ يَعِيشَ بْنِ الْوَلِيدِ بْنِ هِشَامٍ، أَنَّ أَبَاهُ، حَدَّثَهُ حَدَّثَنِي مَعْدَانُ بْنُ طَلْحَةَ، أَنَّ أَبَا الدَّرْدَاءِ، حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَاءَ فَأَفْطَرَ فَلَقِيتُ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فِي مَسْجِدِ دِمَشْقَ فَقُلْتُ إِنَّ أَبَا الدَّرْدَاءِ حَدَّثَنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَاءَ فَأَفْطَرَ ‏.‏ قَالَ صَدَقَ وَأَنَا صَبَبْتُ لَهُ وَضُوءَهُ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 69,
        "matchingEnglishURN": 823750,
        "last_updated": null
    },
    {
        "arabicURN": 923850,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "33.00",
        "hadithNumber": "2382",
        "bookName": " كتاب الصوم ",
        "babName": " باب الْقُبْلَةِ لِلصَّائِمِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، وَعَلْقَمَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُقَبِّلُ وَهُوَ صَائِمٌ وَيُبَاشِرُ وَهُوَ صَائِمٌ وَلَكِنَّهُ كَانَ أَمْلَكَ لإِرْبِهِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 70,
        "matchingEnglishURN": 823760,
        "last_updated": null
    },
    {
        "arabicURN": 923860,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "33.00",
        "hadithNumber": "2383",
        "bookName": " كتاب الصوم ",
        "babName": " باب الْقُبْلَةِ لِلصَّائِمِ ",
        "hadithText": "حَدَّثَنَا أَبُو تَوْبَةَ الرَّبِيعُ بْنُ نَافِعٍ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ زِيَادِ بْنِ عِلاَقَةَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُقَبِّلُ فِي شَهْرِ الصَّوْمِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 71,
        "matchingEnglishURN": 823770,
        "last_updated": null
    },
    {
        "arabicURN": 923870,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "33.00",
        "hadithNumber": "2384",
        "bookName": " كتاب الصوم ",
        "babName": " باب الْقُبْلَةِ لِلصَّائِمِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ، - يَعْنِي ابْنَ عُثْمَانَ الْقُرَشِيَّ - عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُقَبِّلُنِي وَهُوَ صَائِمٌ وَأَنَا صَائِمَةٌ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 72,
        "matchingEnglishURN": 823780,
        "last_updated": null
    },
    {
        "arabicURN": 923880,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "33.00",
        "hadithNumber": "2385",
        "bookName": " كتاب الصوم ",
        "babName": " باب الْقُبْلَةِ لِلصَّائِمِ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا اللَّيْثُ، ح وَحَدَّثَنَا عِيسَى بْنُ حَمَّادٍ، أَخْبَرَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ هَشِشْتُ فَقَبَّلْتُ وَأَنَا صَائِمٌ، فَقُلْتُ يَا رَسُولَ اللَّهِ صَنَعْتُ الْيَوْمَ أَمْرًا عَظِيمًا قَبَّلْتُ وَأَنَا صَائِمٌ ‏.‏ قَالَ ‏\"‏ أَرَأَيْتَ لَوْ مَضْمَضْتَ مِنَ الْمَاءِ وَأَنْتَ صَائِمٌ ‏\"‏ ‏.‏ قَالَ عِيسَى بْنُ حَمَّادٍ فِي حَدِيثِهِ قُلْتُ لاَ بَأْسَ بِهِ ‏.‏ ثُمَّ اتَّفَقَا قَالَ ‏\"‏ فَمَهْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 73,
        "matchingEnglishURN": 823790,
        "last_updated": null
    },
    {
        "arabicURN": 923890,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "34.00",
        "hadithNumber": "2386",
        "bookName": " كتاب الصوم ",
        "babName": " باب الصَّائِمِ يَبْلَعُ الرِّيقَ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، حَدَّثَنَا مُحَمَّدُ بْنُ دِينَارٍ، حَدَّثَنَا سَعْدُ بْنُ أَوْسٍ الْعَبْدِيُّ، عَنْ مِصْدَعٍ أَبِي يَحْيَى، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُقَبِّلُهَا وَهُوَ صَائِمٌ وَيَمُصُّ لِسَانَهَا ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 74,
        "matchingEnglishURN": 823800,
        "last_updated": null
    },
    {
        "arabicURN": 923900,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "35.00",
        "hadithNumber": "2387",
        "bookName": " كتاب الصوم ",
        "babName": " باب كَرَاهِيَتِهِ لِلشَّابِّ ",
        "hadithText": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، حَدَّثَنَا أَبُو أَحْمَدَ، - يَعْنِي الزُّبَيْرِيَّ - أَخْبَرَنَا إِسْرَائِيلُ، عَنْ أَبِي الْعَنْبَسِ، عَنِ الأَغَرِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، سَأَلَ النَّبِيَّ صلى الله عليه وسلم عَنِ الْمُبَاشَرَةِ لِلصَّائِمِ فَرَخَّصَ لَهُ وَأَتَاهُ آخَرُ فَسَأَلَهُ فَنَهَاهُ ‏.‏ فَإِذَا الَّذِي رَخَّصَ لَهُ شَيْخٌ وَالَّذِي نَهَاهُ شَابٌّ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "حسن صحيح",
        "ourHadithNumber": 75,
        "matchingEnglishURN": 823810,
        "last_updated": null
    },
    {
        "arabicURN": 923910,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "36.00",
        "hadithNumber": "2388",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِيمَنْ أَصْبَحَ جُنُبًا فِي شَهْرِ رَمَضَانَ ",
        "hadithText": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ إِسْحَاقَ الأَذْرَمِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ مَالِكٍ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، وَأُمِّ سَلَمَةَ زَوْجَىِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُمَا قَالَتَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصْبِحُ جُنُبًا ‏.‏ قَالَ عَبْدُ اللَّهِ الأَذْرَمِيُّ فِي حَدِيثِهِ فِي رَمَضَانَ مِنْ جِمَاعٍ غَيْرِ احْتِلاَمٍ ثُمَّ يَصُومُ ‏.‏ قَالَ أَبُو دَاوُدَ وَمَا أَقَلَّ مَنْ يَقُولُ هَذِهِ الْكَلِمَةَ - يَعْنِي يُصْبِحُ جُنُبًا فِي رَمَضَانَ - وَإِنَّمَا الْحَدِيثُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصْبِحُ جُنُبًا وَهُوَ صَائِمٌ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 76,
        "matchingEnglishURN": 823820,
        "last_updated": null
    },
    {
        "arabicURN": 923920,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "36.00",
        "hadithNumber": "2389",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِيمَنْ أَصْبَحَ جُنُبًا فِي شَهْرِ رَمَضَانَ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، - يَعْنِي الْقَعْنَبِيَّ - عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ مَعْمَرٍ الأَنْصَارِيِّ، عَنْ أَبِي يُونُسَ، مَوْلَى عَائِشَةَ عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَجُلاً قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ وَاقِفٌ عَلَى الْبَابِ يَا رَسُولَ اللَّهِ إِنِّي أُصْبِحُ جُنُبًا وَأَنَا أُرِيدُ الصِّيَامَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَأَنَا أُصْبِحُ جُنُبًا وَأَنَا أُرِيدُ الصِّيَامَ فَأَغْتَسِلُ وَأَصُومُ ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ يَا رَسُولَ اللَّهِ إِنَّكَ لَسْتَ مِثْلَنَا قَدْ غَفَرَ اللَّهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ فَغَضِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\"‏ وَاللَّهِ إِنِّي لأَرْجُو أَنْ أَكُونَ أَخْشَاكُمْ لِلَّهِ وَأَعْلَمَكُمْ بِمَا أَتَّبِعُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 77,
        "matchingEnglishURN": 823830,
        "last_updated": null
    },
    {
        "arabicURN": 923930,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "37.00",
        "hadithNumber": "2390",
        "bookName": " كتاب الصوم ",
        "babName": " باب كَفَّارَةِ مَنْ أَتَى أَهْلَهُ فِي رَمَضَانَ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، وَمُحَمَّدُ بْنُ عِيسَى، - الْمَعْنَى - قَالاَ حَدَّثَنَا سُفْيَانُ، - قَالَ مُسَدَّدٌ - حَدَّثَنَا الزُّهْرِيُّ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أَتَى رَجُلٌ النَّبِيَّ صلى الله عليه وسلم فَقَالَ هَلَكْتُ ‏.‏ فَقَالَ ‏\"‏ مَا شَأْنُكَ ‏\"‏ ‏.‏ قَالَ وَقَعْتُ عَلَى امْرَأَتِي فِي رَمَضَانَ ‏.‏ قَالَ ‏\"‏ فَهَلْ تَجِدُ مَا تُعْتِقُ رَقَبَةً ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَهَلْ تَسْتَطِيعُ أَنْ تَصُومَ شَهْرَيْنِ مُتَتَابِعَيْنِ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَهَلْ تَسْتَطِيعُ أَنْ تُطْعِمَ سِتِّينَ مِسْكِينًا ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ اجْلِسْ ‏\"‏ ‏.‏ فَأُتِيَ النَّبِيُّ صلى الله عليه وسلم بِعَرَقٍ فِيهِ تَمْرٌ فَقَالَ ‏\"‏ تَصَدَّقْ بِهِ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ مَا بَيْنَ لاَبَتَيْهَا أَهْلُ بَيْتٍ أَفْقَرَ مِنَّا فَضَحِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى بَدَتْ ثَنَايَاهُ قَالَ ‏\"‏ فَأَطْعِمْهُ إِيَّاهُمْ ‏\"‏ ‏.‏ وَقَالَ مُسَدَّدٌ فِي مَوْضِعٍ آخَرَ أَنْيَابُهُ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 78,
        "matchingEnglishURN": 823840,
        "last_updated": null
    },
    {
        "arabicURN": 923940,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "37.00",
        "hadithNumber": "2391",
        "bookName": " كتاب الصوم ",
        "babName": " باب كَفَّارَةِ مَنْ أَتَى أَهْلَهُ فِي رَمَضَانَ ",
        "hadithText": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، بِهَذَا الْحَدِيثِ بِمَعْنَاهُ ‏.‏ زَادَ الزُّهْرِيُّ وَإِنَّمَا كَانَ هَذَا رُخْصَةً لَهُ خَاصَّةً فَلَوْ أَنَّ رَجُلاً فَعَلَ ذَلِكَ الْيَوْمَ لَمْ يَكُنْ لَهُ بُدٌّ مِنَ التَّكْفِيرِ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ اللَّيْثُ بْنُ سَعْدٍ وَالأَوْزَاعِيُّ وَمَنْصُورُ بْنُ الْمُعْتَمِرِ وَعِرَاكُ بْنُ مَالِكٍ عَلَى مَعْنَى ابْنِ عُيَيْنَةَ ‏.‏ زَادَ الأَوْزَاعِيُّ وَاسْتَغْفِرِ اللَّهَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 79,
        "matchingEnglishURN": 823850,
        "last_updated": null
    },
    {
        "arabicURN": 923950,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "37.00",
        "hadithNumber": "2392",
        "bookName": " كتاب الصوم ",
        "babName": " باب كَفَّارَةِ مَنْ أَتَى أَهْلَهُ فِي رَمَضَانَ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، أَفْطَرَ فِي رَمَضَانَ فَأَمَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُعْتِقَ رَقَبَةً أَوْ يَصُومَ شَهْرَيْنِ مُتَتَابِعَيْنِ أَوْ يُطْعِمَ سِتِّينَ مِسْكِينًا ‏.‏ قَالَ لاَ أَجِدُ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اجْلِسْ ‏\"‏ ‏.‏ فَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِعَرَقٍ فِيهِ تَمْرٌ فَقَالَ ‏\"‏ خُذْ هَذَا فَتَصَدَّقْ بِهِ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ مَا أَحَدٌ أَحْوَجَ مِنِّي ‏.‏ فَضَحِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى بَدَتْ أَنْيَابُهُ وَقَالَ لَهُ ‏\"‏ كُلْهُ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ ابْنُ جُرَيْجٍ عَنِ الزُّهْرِيِّ عَلَى لَفْظِ مَالِكٍ أَنَّ رَجُلاً أَفْطَرَ وَقَالَ فِيهِ ‏\"‏ أَوْ تُعْتِقَ رَقَبَةً أَوْ تَصُومَ شَهْرَيْنِ أَوْ تُطْعِمَ سِتِّينَ مِسْكِينًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 80,
        "matchingEnglishURN": 823860,
        "last_updated": null
    },
    {
        "arabicURN": 923960,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "37.00",
        "hadithNumber": "2393",
        "bookName": " كتاب الصوم ",
        "babName": " باب كَفَّارَةِ مَنْ أَتَى أَهْلَهُ فِي رَمَضَانَ ",
        "hadithText": "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم أَفْطَرَ فِي رَمَضَانَ بِهَذَا الْحَدِيثِ ‏.‏ قَالَ فَأُتِيَ بِعَرَقٍ فِيهِ تَمْرٌ قَدْرُ خَمْسَةَ عَشَرَ صَاعًا وَقَالَ فِيهِ ‏\"‏ كُلْهُ أَنْتَ وَأَهْلُ بَيْتِكَ وَصُمْ يَوْمًا وَاسْتَغْفِرِ اللَّهَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 81,
        "matchingEnglishURN": 823870,
        "last_updated": null
    },
    {
        "arabicURN": 923970,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "37.00",
        "hadithNumber": "2394",
        "bookName": " كتاب الصوم ",
        "babName": " باب كَفَّارَةِ مَنْ أَتَى أَهْلَهُ فِي رَمَضَانَ ",
        "hadithText": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ، حَدَّثَهُ أَنَّ مُحَمَّدَ بْنَ جَعْفَرِ بْنِ الزُّبَيْرِ حَدَّثَهُ أَنَّ عَبَّادَ بْنَ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ حَدَّثَهُ أَنَّهُ، سَمِعَ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم تَقُولُ أَتَى رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فِي الْمَسْجِدِ فِي رَمَضَانَ فَقَالَ يَا رَسُولَ اللَّهِ احْتَرَقْتُ ‏.‏ فَسَأَلَهُ النَّبِيُّ صلى الله عليه وسلم مَا شَأْنُهُ قَالَ أَصَبْتُ أَهْلِي ‏.‏ قَالَ ‏\"‏ تَصَدَّقْ ‏\"‏ ‏.‏ قَالَ وَاللَّهِ مَا لِي شَىْءٌ وَلاَ أَقْدِرُ عَلَيْهِ ‏.‏ قَالَ ‏\"‏ اجْلِسْ ‏\"‏ ‏.‏ فَجَلَسَ فَبَيْنَمَا هُوَ عَلَى ذَلِكَ أَقْبَلَ رَجُلٌ يَسُوقُ حِمَارًا عَلَيْهِ طَعَامٌ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَيْنَ الْمُحْتَرِقُ آنِفًا ‏\"‏ ‏.‏ فَقَامَ الرَّجُلُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَصَدَّقْ بِهَذَا ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ أَعَلَى غَيْرِنَا فَوَاللَّهِ إِنَّا لَجِيَاعٌ مَا لَنَا شَىْءٌ ‏.‏ قَالَ ‏\"‏ كُلُوهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 82,
        "matchingEnglishURN": 823880,
        "last_updated": null
    },
    {
        "arabicURN": 923980,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "37.00",
        "hadithNumber": "2395",
        "bookName": " كتاب الصوم ",
        "babName": " باب كَفَّارَةِ مَنْ أَتَى أَهْلَهُ فِي رَمَضَانَ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ، عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ، عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ، عَنْ عَائِشَةَ، بِهَذِهِ الْقِصَّةِ قَالَ فَأُتِيَ بِعَرَقٍ فِيهِ عِشْرُونَ صَاعًا ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "منكر",
        "ourHadithNumber": 83,
        "matchingEnglishURN": 823890,
        "last_updated": null
    },
    {
        "arabicURN": 923990,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "38.00",
        "hadithNumber": "2396",
        "bookName": " كتاب الصوم ",
        "babName": " باب التَّغْلِيظِ فِي مَنْ أَفْطَرَ عَمْدًا ",
        "hadithText": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ أَخْبَرَنَا شُعْبَةُ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنِ ابْنِ مُطَوِّسٍ، عَنْ أَبِيهِ، - قَالَ ابْنُ كَثِيرٍ عَنْ أَبِي الْمُطَوِّسِ، عَنْ أَبِيهِ، - عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَفْطَرَ يَوْمًا مِنْ رَمَضَانَ مِنْ غَيْرِ رُخْصَةٍ رَخَّصَهَا اللَّهُ لَهُ لَمْ يَقْضِ عَنْهُ صِيَامُ الدَّهْرِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 84,
        "matchingEnglishURN": 823900,
        "last_updated": null
    },
    {
        "arabicURN": 924000,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "38.00",
        "hadithNumber": "2397",
        "bookName": " كتاب الصوم ",
        "babName": " باب التَّغْلِيظِ فِي مَنْ أَفْطَرَ عَمْدًا ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، حَدَّثَنِي حَبِيبٌ، عَنْ عُمَارَةَ، عَنِ ابْنِ الْمُطَوِّسِ، - قَالَ فَلَقِيتُ ابْنَ الْمُطَوِّسِ فَحَدَّثَنِي - عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم مِثْلَ حَدِيثِ ابْنِ كَثِيرٍ وَسُلَيْمَانَ ‏.‏ قَالَ أَبُو دَاوُدَ وَاخْتُلِفَ عَلَى سُفْيَانَ وَشُعْبَةَ عَنْهُمَا ابْنُ الْمُطَوِّسِ وَأَبُو الْمُطَوِّسِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 85,
        "matchingEnglishURN": 823910,
        "last_updated": null
    },
    {
        "arabicURN": 924010,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "39.00",
        "hadithNumber": "2398",
        "bookName": " كتاب الصوم ",
        "babName": " باب مَنْ أَكَلَ نَاسِيًا ",
        "hadithText": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، وَحَبِيبٌ، وَهِشَامٌ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَكَلْتُ وَشَرِبْتُ نَاسِيًا وَأَنَا صَائِمٌ ‏.‏ فَقَالَ ‏\"‏ أَطْعَمَكَ اللَّهُ وَسَقَاكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 86,
        "matchingEnglishURN": 823920,
        "last_updated": null
    },
    {
        "arabicURN": 924020,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "40.00",
        "hadithNumber": "2399",
        "bookName": " كتاب الصوم ",
        "babName": " باب تَأْخِيرِ قَضَاءِ رَمَضَانَ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ عَائِشَةَ، - رضى الله عنها - تَقُولُ إِنْ كَانَ لَيَكُونُ عَلَىَّ الصَّوْمُ مِنْ رَمَضَانَ فَمَا أَسْتَطِيعُ أَنْ أَقْضِيَهُ حَتَّى يَأْتِيَ شَعْبَانُ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 87,
        "matchingEnglishURN": 823930,
        "last_updated": null
    },
    {
        "arabicURN": 924030,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "41.00",
        "hadithNumber": "2400",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِيمَنْ مَاتَ وَعَلَيْهِ صِيَامٌ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ، عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ مَاتَ وَعَلَيْهِ صِيَامٌ صَامَ عَنْهُ وَلِيُّهُ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ هَذَا فِي النَّذْرِ وَهُوَ قَوْلُ أَحْمَدَ بْنِ حَنْبَلٍ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 88,
        "matchingEnglishURN": 823940,
        "last_updated": null
    },
    {
        "arabicURN": 924040,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "41.00",
        "hadithNumber": "2401",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِيمَنْ مَاتَ وَعَلَيْهِ صِيَامٌ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَبِي حَصِينٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ إِذَا مَرِضَ الرَّجُلُ فِي رَمَضَانَ ثُمَّ مَاتَ وَلَمْ يَصُمْ أُطْعِمَ عَنْهُ وَلَمْ يَكُنْ عَلَيْهِ قَضَاءٌ وَإِنْ كَانَ عَلَيْهِ نَذْرٌ قَضَى عَنْهُ وَلِيُّهُ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 89,
        "matchingEnglishURN": 823950,
        "last_updated": null
    },
    {
        "arabicURN": 924050,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "42.00",
        "hadithNumber": "2402",
        "bookName": " كتاب الصوم ",
        "babName": " باب الصَّوْمِ فِي السَّفَرِ ",
        "hadithText": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، وَمُسَدَّدٌ، قَالاَ حَدَّثَنَا حَمَّادٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ حَمْزَةَ الأَسْلَمِيَّ، سَأَلَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ أَسْرُدُ الصَّوْمَ أَفَأَصُومُ فِي السَّفَرِ قَالَ ‏\"‏ صُمْ إِنْ شِئْتَ وَأَفْطِرْ إِنْ شِئْتَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 90,
        "matchingEnglishURN": 823960,
        "last_updated": null
    },
    {
        "arabicURN": 924060,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "42.00",
        "hadithNumber": "2403",
        "bookName": " كتاب الصوم ",
        "babName": " باب الصَّوْمِ فِي السَّفَرِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَجِيدِ الْمَدَنِيُّ، قَالَ سَمِعْتُ حَمْزَةَ بْنَ مُحَمَّدِ بْنِ حَمْزَةَ الأَسْلَمِيَّ، يَذْكُرُ أَنَّ أَبَاهُ، أَخْبَرَهُ عَنْ جَدِّهِ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي صَاحِبُ ظَهْرٍ أُعَالِجُهُ أُسَافِرُ عَلَيْهِ وَأَكْرِيهِ وَإِنَّهُ رُبَّمَا صَادَفَنِي هَذَا الشَّهْرُ - يَعْنِي رَمَضَانَ - وَأَنَا أَجِدُ الْقُوَّةَ وَأَنَا شَابٌّ وَأَجِدُ بِأَنْ أَصُومَ يَا رَسُولَ اللَّهِ أَهْوَنَ عَلَىَّ مِنْ أَنْ أُؤَخِّرَهُ فَيَكُونَ دَيْنًا أَفَأَصُومُ يَا رَسُولَ اللَّهِ أَعْظَمُ لأَجْرِي أَوْ أُفْطِرُ قَالَ ‏\"‏ أَىُّ ذَلِكَ شِئْتَ يَا حَمْزَةُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 91,
        "matchingEnglishURN": 823970,
        "last_updated": null
    },
    {
        "arabicURN": 924070,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "42.00",
        "hadithNumber": "2404",
        "bookName": " كتاب الصوم ",
        "babName": " باب الصَّوْمِ فِي السَّفَرِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم مِنَ الْمَدِينَةِ إِلَى مَكَّةَ حَتَّى بَلَغَ عُسْفَانَ ثُمَّ دَعَا بِإِنَاءٍ فَرَفَعَهُ إِلَى فِيهِ لِيُرِيَهُ النَّاسَ وَذَلِكَ فِي رَمَضَانَ ‏.‏ فَكَانَ ابْنُ عَبَّاسٍ يَقُولُ قَدْ صَامَ النَّبِيُّ صلى الله عليه وسلم وَأَفْطَرَ فَمَنْ شَاءَ صَامَ وَمَنْ شَاءَ أَفْطَرَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 92,
        "matchingEnglishURN": 823980,
        "last_updated": null
    },
    {
        "arabicURN": 924080,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "42.00",
        "hadithNumber": "2405",
        "bookName": " كتاب الصوم ",
        "babName": " باب الصَّوْمِ فِي السَّفَرِ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زَائِدَةُ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسٍ، قَالَ سَافَرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي رَمَضَانَ فَصَامَ بَعْضُنَا وَأَفْطَرَ بَعْضُنَا فَلَمْ يَعِبِ الصَّائِمُ عَلَى الْمُفْطِرِ وَلاَ الْمُفْطِرُ عَلَى الصَّائِمِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 93,
        "matchingEnglishURN": 823990,
        "last_updated": null
    },
    {
        "arabicURN": 924090,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "42.00",
        "hadithNumber": "2406",
        "bookName": " كتاب الصوم ",
        "babName": " باب الصَّوْمِ فِي السَّفَرِ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، وَوَهْبُ بْنُ بَيَانٍ، - الْمَعْنَى - قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي مُعَاوِيَةُ، عَنْ رَبِيعَةَ بْنِ يَزِيدَ، أَنَّهُ حَدَّثَهُ عَنْ قَزَعَةَ، قَالَ أَتَيْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ وَهُوَ يُفْتِي النَّاسَ وَهُمْ مُكِبُّونَ عَلَيْهِ فَانْتَظَرْتُ خَلْوَتَهُ فَلَمَّا خَلاَ سَأَلْتُهُ عَنْ صِيَامِ رَمَضَانَ فِي السَّفَرِ فَقَالَ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي رَمَضَانَ عَامَ الْفَتْحِ فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ وَنَصُومُ حَتَّى بَلَغَ مَنْزِلاً مِنَ الْمَنَازِلِ فَقَالَ ‏\"‏ إِنَّكُمْ قَدْ دَنَوْتُمْ مِنْ عَدُوِّكُمْ وَالْفِطْرُ أَقْوَى لَكُمْ ‏\"‏ ‏.‏ فَأَصْبَحْنَا مِنَّا الصَّائِمُ وَمِنَّا الْمُفْطِرُ - قَالَ - ثُمَّ سِرْنَا فَنَزَلْنَا مَنْزِلاً فَقَالَ ‏\"‏ إِنَّكُمْ تُصَبِّحُونَ عَدُوَّكُمْ وَالْفِطْرُ أَقْوَى لَكُمْ فَأَفْطِرُوا ‏\"‏ ‏.‏ فَكَانَتْ عَزِيمَةً مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو سَعِيدٍ ثُمَّ لَقَدْ رَأَيْتُنِي أَصُومُ مَعَ النَّبِيِّ صلى الله عليه وسلم قَبْلَ ذَلِكَ وَبَعْدَ ذَلِكَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 94,
        "matchingEnglishURN": 824000,
        "last_updated": null
    },
    {
        "arabicURN": 924100,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "43.00",
        "hadithNumber": "2407",
        "bookName": " كتاب الصوم ",
        "babName": " باب اخْتِيَارِ الْفِطْرِ ",
        "hadithText": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، - يَعْنِي ابْنَ سَعْدِ بْنِ زُرَارَةَ - عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَسَنٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى رَجُلاً يُظَلَّلُ عَلَيْهِ وَالزِّحَامُ عَلَيْهِ فَقَالَ ‏\"‏ لَيْسَ مِنَ الْبِرِّ الصِّيَامُ فِي السَّفَرِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 95,
        "matchingEnglishURN": 824010,
        "last_updated": null
    },
    {
        "arabicURN": 924110,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "43.00",
        "hadithNumber": "2408",
        "bookName": " كتاب الصوم ",
        "babName": " باب اخْتِيَارِ الْفِطْرِ ",
        "hadithText": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا أَبُو هِلاَلٍ الرَّاسِبِيُّ، حَدَّثَنَا ابْنُ سَوَادَةَ الْقُشَيْرِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ، - رَجُلٍ مِنْ بَنِي عَبْدِ اللَّهِ بْنِ كَعْبٍ إِخْوَةِ بَنِي قُشَيْرٍ - قَالَ أَغَارَتْ عَلَيْنَا خَيْلٌ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَانْتَهَيْتُ - أَوْ قَالَ فَانْطَلَقْتُ - إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ يَأْكُلُ فَقَالَ ‏\"‏ اجْلِسْ فَأَصِبْ مِنْ طَعَامِنَا هَذَا ‏\"‏ ‏.‏ فَقُلْتُ إِنِّي صَائِمٌ ‏.‏ قَالَ ‏\"‏ اجْلِسْ أُحَدِّثْكَ عَنِ الصَّلاَةِ وَعَنِ الصِّيَامِ إِنَّ اللَّهَ تَعَالَى وَضَعَ شَطْرَ الصَّلاَةِ أَوْ نِصْفَ الصَّلاَةِ وَالصَّوْمَ عَنِ الْمُسَافِرِ وَعَنِ الْمُرْضِعِ أَوِ الْحُبْلَى ‏\"‏ ‏.‏ وَاللَّهِ لَقَدْ قَالَهُمَا جَمِيعًا أَوْ أَحَدَهُمَا قَالَ فَتَلَهَّفَتْ نَفْسِي أَنْ لاَ أَكُونَ أَكَلْتُ مِنْ طَعَامِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "حسن صحيح",
        "ourHadithNumber": 96,
        "matchingEnglishURN": 824020,
        "last_updated": null
    },
    {
        "arabicURN": 924120,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "44.00",
        "hadithNumber": "2409",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِيمَنِ اخْتَارَ الصِّيَامَ ",
        "hadithText": "حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ، حَدَّثَنَا الْوَلِيدُ، حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ، حَدَّثَنِي إِسْمَاعِيلُ بْنُ عُبَيْدِ اللَّهِ، حَدَّثَتْنِي أُمُّ الدَّرْدَاءِ، عَنْ أَبِي الدَّرْدَاءِ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي بَعْضِ غَزَوَاتِهِ فِي حَرٍّ شَدِيدٍ حَتَّى إِنَّ أَحَدَنَا لَيَضَعُ يَدَهُ عَلَى رَأْسِهِ أَوْ كَفَّهُ عَلَى رَأْسِهِ مِنْ شِدَّةِ الْحَرِّ مَا فِينَا صَائِمٌ إِلاَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَعَبْدُ اللَّهِ بْنُ رَوَاحَةَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 97,
        "matchingEnglishURN": 824030,
        "last_updated": null
    },
    {
        "arabicURN": 924130,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "44.00",
        "hadithNumber": "2410",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِيمَنِ اخْتَارَ الصِّيَامَ ",
        "hadithText": "حَدَّثَنَا حَامِدُ بْنُ يَحْيَى، حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، ح وَحَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ، حَدَّثَنَا أَبُو قُتَيْبَةَ، - الْمَعْنَى - قَالاَ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ حَبِيبِ بْنِ عَبْدِ اللَّهِ الأَزْدِيُّ، حَدَّثَنِي حَبِيبُ بْنُ عَبْدِ اللَّهِ، قَالَ سَمِعْتُ سِنَانَ بْنَ سَلَمَةَ بْنِ الْمُحَبَّقِ الْهُذَلِيَّ، يُحَدِّثُ عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ كَانَتْ لَهُ حَمُولَةٌ تَأْوِي إِلَى شِبَعٍ فَلْيَصُمْ رَمَضَانَ حَيْثُ أَدْرَكَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 98,
        "matchingEnglishURN": 824040,
        "last_updated": null
    },
    {
        "arabicURN": 924140,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "44.00",
        "hadithNumber": "2411",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِيمَنِ اخْتَارَ الصِّيَامَ ",
        "hadithText": "حَدَّثَنَا نَصْرُ بْنُ الْمُهَاجِرِ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ حَبِيبٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ سِنَانِ بْنِ سَلَمَةَ، عَنْ سَلَمَةَ بْنِ الْمُحَبَّقِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَدْرَكَهُ رَمَضَانُ فِي السَّفَرِ ‏\"‏ ‏.‏ فَذَكَرَ مَعْنَاهُ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 99,
        "matchingEnglishURN": 824050,
        "last_updated": null
    },
    {
        "arabicURN": 924150,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "45.00",
        "hadithNumber": "2412",
        "bookName": " كتاب الصوم ",
        "babName": " باب مَتَى يُفْطِرُ الْمُسَافِرُ إِذَا خَرَجَ ",
        "hadithText": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ يَزِيدَ، ح وَحَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَحْيَى، - الْمَعْنَى - حَدَّثَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ، وَزَادَ، جَعْفَرٌ وَاللَّيْثُ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، أَنَّ كُلَيْبَ بْنَ ذُهْلٍ الْحَضْرَمِيَّ، أَخْبَرَهُ عَنْ عُبَيْدٍ، - قَالَ جَعْفَرٌ ابْنُ جَبْرٍ - قَالَ كُنْتُ مَعَ أَبِي بَصْرَةَ الْغِفَارِيِّ صَاحِبِ النَّبِيِّ صلى الله عليه وسلم فِي سَفِينَةٍ مِنَ الْفُسْطَاطِ فِي رَمَضَانَ فَرُفِعَ ثُمَّ قُرِّبَ غَدَاهُ - قَالَ جَعْفَرٌ فِي حَدِيثِهِ - فَلَمْ يُجَاوِزِ الْبُيُوتَ حَتَّى دَعَا بِالسُّفْرَةِ قَالَ اقْتَرِبْ ‏.‏ قُلْتُ أَلَسْتَ تَرَى الْبُيُوتَ قَالَ أَبُو بَصْرَةَ أَتَرْغَبُ عَنْ سُنَّةِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ جَعْفَرٌ فِي حَدِيثِهِ فَأَكَلَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 100,
        "matchingEnglishURN": 824060,
        "last_updated": null
    },
    {
        "arabicURN": 924160,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "46.00",
        "hadithNumber": "2413",
        "bookName": " كتاب الصوم ",
        "babName": " باب قَدْرِ مَسِيرَةِ مَا يُفْطِرُ فِيهِ ",
        "hadithText": "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ، أَخْبَرَنَا اللَّيْثُ، - يَعْنِي ابْنَ سَعْدٍ - عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ مَنْصُورٍ الْكَلْبِيِّ، أَنَّ دِحْيَةَ بْنَ خَلِيفَةَ، خَرَجَ مِنْ قَرْيَةٍ مِنْ دِمَشْقَ مَرَّةً إِلَى قَدْرِ قَرْيَةِ عُقْبَةَ مِنَ الْفُسْطَاطِ وَذَلِكَ ثَلاَثَةُ أَمْيَالٍ فِي رَمَضَانَ ثُمَّ إِنَّهُ أَفْطَرَ وَأَفْطَرَ مَعَهُ نَاسٌ وَكَرِهَ آخَرُونَ أَنْ يُفْطِرُوا فَلَمَّا رَجَعَ إِلَى قَرْيَتِهِ قَالَ وَاللَّهِ لَقَدْ رَأَيْتُ الْيَوْمَ أَمْرًا مَا كُنْتُ أَظُنُّ أَنِّي أَرَاهُ إِنَّ قَوْمًا رَغِبُوا عَنْ هَدْىِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَصْحَابِهِ ‏.‏ يَقُولُ ذَلِكَ لِلَّذِينَ صَامُوا ثُمَّ قَالَ عِنْدَ ذَلِكَ اللَّهُمَّ اقْبِضْنِي إِلَيْكَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 101,
        "matchingEnglishURN": 824070,
        "last_updated": null
    },
    {
        "arabicURN": 924170,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "46.00",
        "hadithNumber": "2414",
        "bookName": " كتاب الصوم ",
        "babName": " باب قَدْرِ مَسِيرَةِ مَا يُفْطِرُ فِيهِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا الْمُعْتَمِرُ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، كَانَ يَخْرُجُ إِلَى الْغَابَةِ فَلاَ يُفْطِرُ وَلاَ يَقْصُرُ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح موقوف",
        "ourHadithNumber": 102,
        "matchingEnglishURN": 824080,
        "last_updated": null
    },
    {
        "arabicURN": 924180,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "47.00",
        "hadithNumber": "2415",
        "bookName": " كتاب الصوم ",
        "babName": " باب مَنْ يَقُولُ صُمْتُ رَمَضَانَ كُلَّهُ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ الْمُهَلَّبِ بْنِ أَبِي حَبِيبَةَ، حَدَّثَنَا الْحَسَنُ، عَنْ أَبِي بَكْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يَقُولَنَّ أَحَدُكُمْ إِنِّي صُمْتُ رَمَضَانَ كُلَّهُ وَ قُمْتُهُ كُلَّهُ ‏\"‏ ‏.‏ فَلاَ أَدْرِي أَكَرِهَ التَّزْكِيَةَ أَوْ قَالَ لاَ بُدَّ مِنْ نَوْمَةٍ أَوْ رَقْدَةٍ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 103,
        "matchingEnglishURN": 824090,
        "last_updated": null
    },
    {
        "arabicURN": 924190,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "48.00",
        "hadithNumber": "2416",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي صَوْمِ الْعِيدَيْنِ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَزُهَيْرُ بْنُ حَرْبٍ، - وَهَذَا حَدِيثُهُ - قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي عُبَيْدٍ، قَالَ شَهِدْتُ الْعِيدَ مَعَ عُمَرَ فَبَدَأَ بِالصَّلاَةِ قَبْلَ الْخُطْبَةِ ثُمَّ قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ صِيَامِ هَذَيْنِ الْيَوْمَيْنِ أَمَّا يَوْمُ الأَضْحَى فَتَأْكُلُونَ مِنْ لَحْمِ نُسُكِكُمْ وَأَمَّا يَوْمُ الْفِطْرِ فَفِطْرُكُمْ مِنْ صِيَامِكُمْ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 104,
        "matchingEnglishURN": 824100,
        "last_updated": null
    },
    {
        "arabicURN": 924200,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "48.00",
        "hadithNumber": "2417",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي صَوْمِ الْعِيدَيْنِ ",
        "hadithText": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَمْرُو بْنُ يَحْيَى، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ صِيَامِ يَوْمَيْنِ يَوْمِ الْفِطْرِ وَيَوْمِ الأَضْحَى وَعَنْ لِبْسَتَيْنِ الصَّمَّاءِ وَأَنْ يَحْتَبِيَ الرَّجُلُ فِي الثَّوْبِ الْوَاحِدِ وَعَنِ الصَّلاَةِ فِي سَاعَتَيْنِ بَعْدَ الصُّبْحِ وَبَعْدَ الْعَصْرِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 105,
        "matchingEnglishURN": 824110,
        "last_updated": null
    },
    {
        "arabicURN": 924210,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "49.00",
        "hadithNumber": "2418",
        "bookName": " كتاب الصوم ",
        "babName": " باب صِيَامِ أَيَّامِ التَّشْرِيقِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ الْهَادِ، عَنْ أَبِي مُرَّةَ، مَوْلَى أُمِّ هَانِئٍ أَنَّهُ دَخَلَ مَعَ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَلَى أَبِيهِ عَمْرِو بْنِ الْعَاصِ فَقَرَّبَ إِلَيْهِمَا طَعَامًا فَقَالَ كُلْ ‏.‏ فَقَالَ إِنِّي صَائِمٌ ‏.‏ فَقَالَ عَمْرٌو كُلْ فَهَذِهِ الأَيَّامُ الَّتِي كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُنَا بِإِفْطَارِهَا وَيَنْهَانَا عَنْ صِيَامِهَا ‏.‏ قَالَ مَالِكٌ وَهِيَ أَيَّامُ التَّشْرِيقِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 106,
        "matchingEnglishURN": 824120,
        "last_updated": null
    },
    {
        "arabicURN": 924220,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "49.00",
        "hadithNumber": "2419",
        "bookName": " كتاب الصوم ",
        "babName": " باب صِيَامِ أَيَّامِ التَّشْرِيقِ ",
        "hadithText": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا وَهْبٌ، حَدَّثَنَا مُوسَى بْنُ عُلَىٍّ، ح وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ مُوسَى بْنِ عُلَىٍّ، - وَالإِخْبَارُ فِي حَدِيثِ وَهْبٍ - قَالَ سَمِعْتُ أَبِي أَنَّهُ، سَمِعَ عُقْبَةَ بْنَ عَامِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَوْمُ عَرَفَةَ وَيَوْمُ النَّحْرِ وَأَيَّامُ التَّشْرِيقِ عِيدُنَا أَهْلَ الإِسْلاَمِ وَهِيَ أَيَّامُ أَكْلٍ وَشُرْبٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 107,
        "matchingEnglishURN": 824130,
        "last_updated": null
    },
    {
        "arabicURN": 924230,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "50.00",
        "hadithNumber": "2420",
        "bookName": " كتاب الصوم ",
        "babName": " باب النَّهْىِ أَنْ يُخَصَّ يَوْمُ الْجُمُعَةِ بِصَوْمٍ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يَصُمْ أَحَدُكُمْ يَوْمَ الْجُمُعَةِ إِلاَّ أَنْ يَصُومَ قَبْلَهُ بِيَوْمٍ أَوْ بَعْدَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 108,
        "matchingEnglishURN": 824140,
        "last_updated": null
    },
    {
        "arabicURN": 924240,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "51.00",
        "hadithNumber": "2421",
        "bookName": " كتاب الصوم ",
        "babName": " باب النَّهْىِ أَنْ يُخَصَّ يَوْمُ السَّبْتِ بِصَوْمٍ ",
        "hadithText": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا سُفْيَانُ بْنُ حَبِيبٍ، ح وَحَدَّثَنَا يَزِيدُ بْنُ قُبَيْسٍ، - مِنْ أَهْلِ جَبَلَةَ - حَدَّثَنَا الْوَلِيدُ، جَمِيعًا عَنْ ثَوْرِ بْنِ يَزِيدَ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ السُّلَمِيِّ، عَنْ أُخْتِهِ، - وَقَالَ يَزِيدُ الصَّمَّاءِ - أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَصُومُوا يَوْمَ السَّبْتِ إِلاَّ فِيمَا افْتُرِضَ عَلَيْكُمْ وَإِنْ لَمْ يَجِدْ أَحَدُكُمْ إِلاَّ لِحَاءَ عِنَبَةٍ أَوْ عُودَ شَجَرَةٍ فَلْيَمْضُغْهُ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَهَذَا حَدِيثٌ مَنْسُوخٌ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 109,
        "matchingEnglishURN": 824150,
        "last_updated": null
    },
    {
        "arabicURN": 924250,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "52.00",
        "hadithNumber": "2422",
        "bookName": " كتاب الصوم ",
        "babName": " باب الرُّخْصَةِ فِي ذَلِكَ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، ح وَحَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَبِي أَيُّوبَ، - قَالَ حَفْصٌ الْعَتَكِيُّ - عَنْ جُوَيْرِيَةَ بِنْتِ الْحَارِثِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَلَيْهَا يَوْمَ الْجُمُعَةِ وَهِيَ صَائِمَةٌ فَقَالَ ‏\"‏ أَصُمْتِ أَمْسِ ‏\"‏ ‏.‏ قَالَتْ لاَ ‏.‏ قَالَ ‏\"‏ تُرِيدِينَ أَنْ تَصُومِي غَدًا ‏\"‏ ‏.‏ قَالَتْ لاَ ‏.‏ قَالَ ‏\"‏ فَأَفْطِرِي ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 110,
        "matchingEnglishURN": 824160,
        "last_updated": null
    },
    {
        "arabicURN": 924260,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "52.00",
        "hadithNumber": "2423",
        "bookName": " كتاب الصوم ",
        "babName": " باب الرُّخْصَةِ فِي ذَلِكَ ",
        "hadithText": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبٍ، حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ سَمِعْتُ اللَّيْثَ، يُحَدِّثُ عَنِ ابْنِ شِهَابٍ، أَنَّهُ كَانَ إِذَا ذُكِرَ لَهُ أَنَّهُ نُهِيَ عَنْ صِيَامِ يَوْمِ السَّبْتِ يَقُولُ ابْنُ شِهَابٍ هَذَا حَدِيثٌ حِمْصِيٌّ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "مقطوع مرفوض",
        "ourHadithNumber": 111,
        "matchingEnglishURN": 824170,
        "last_updated": null
    },
    {
        "arabicURN": 924270,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "52.00",
        "hadithNumber": "2424",
        "bookName": " كتاب الصوم ",
        "babName": " باب الرُّخْصَةِ فِي ذَلِكَ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ بْنِ سُفْيَانَ، حَدَّثَنَا الْوَلِيدُ، عَنِ الأَوْزَاعِيِّ، قَالَ مَا زِلْتُ لَهُ كَاتِمًا حَتَّى رَأَيْتُهُ انْتَشَرَ ‏.‏ يَعْنِي حَدِيثَ عَبْدِ اللَّهِ بْنِ بُسْرٍ هَذَا فِي صَوْمِ يَوْمِ السَّبْتِ ‏.‏ قَالَ أَبُو دَاوُدَ قَالَ مَالِكٌ هَذَا كَذِبٌ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح مقطوع",
        "ourHadithNumber": 112,
        "matchingEnglishURN": 824180,
        "last_updated": null
    },
    {
        "arabicURN": 924280,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "53.00",
        "hadithNumber": "2425",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي صَوْمِ الدَّهْرِ تَطَوُّعًا ",
        "hadithText": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، وَمُسَدَّدٌ، قَالاَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ غَيْلاَنَ بْنِ جَرِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَعْبَدٍ الزِّمَّانِيِّ، عَنْ أَبِي قَتَادَةَ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ تَصُومُ فَغَضِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ قَوْلِهِ فَلَمَّا رَأَى ذَلِكَ عُمَرُ قَالَ رَضِينَا بِاللَّهِ رَبًّا وَبِالإِسْلاَمِ دِينًا وَبِمُحَمَّدٍ نَبِيًّا نَعُوذُ بِاللَّهِ مِنْ غَضَبِ اللَّهِ وَمِنْ غَضَبِ رَسُولِهِ ‏.‏ فَلَمْ يَزَلْ عُمَرُ يُرَدِّدُهَا حَتَّى سَكَنَ غَضَبُ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ بِمَنْ يَصُومُ الدَّهْرَ كُلَّهُ قَالَ ‏\"‏ لاَ صَامَ وَلاَ أَفْطَرَ ‏\"‏ ‏.‏ قَالَ مُسَدَّدٌ ‏\"‏ لَمْ يَصُمْ وَلَمْ يُفْطِرْ أَوْ مَا صَامَ وَلاَ أَفْطَرَ ‏\"‏ ‏.‏ شَكَّ غَيْلاَنُ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ كَيْفَ بِمَنْ يَصُومُ يَوْمَيْنِ وَيُفْطِرُ يَوْمًا قَالَ ‏\"‏ أَوَيُطِيقُ ذَلِكَ أَحَدٌ ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ فَكَيْفَ بِمَنْ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا قَالَ ‏\"‏ ذَلِكَ صَوْمُ دَاوُدَ ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ فَكَيْفَ بِمَنْ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمَيْنِ قَالَ ‏\"‏ وَدِدْتُ أَنِّي طُوِّقْتُ ذَلِكَ ‏\"‏ ‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ثَلاَثٌ مِنْ كُلِّ شَهْرٍ وَرَمَضَانُ إِلَى رَمَضَانَ فَهَذَا صِيَامُ الدَّهْرِ كُلِّهِ وَصِيَامُ عَرَفَةَ إِنِّي أَحْتَسِبُ عَلَى اللَّهِ أَنْ يُكَفِّرَ السَّنَةَ الَّتِي قَبْلَهُ وَالسَّنَةَ الَّتِي بَعْدَهُ وَصَوْمُ يَوْمِ عَاشُورَاءَ إِنِّي أَحْتَسِبُ عَلَى اللَّهِ أَنْ يُكَفِّرَ السَّنَةَ الَّتِي قَبْلَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 113,
        "matchingEnglishURN": 824190,
        "last_updated": null
    },
    {
        "arabicURN": 924290,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "53.00",
        "hadithNumber": "2426",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي صَوْمِ الدَّهْرِ تَطَوُّعًا ",
        "hadithText": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا مَهْدِيُّ، حَدَّثَنَا غَيْلاَنُ، عَنْ عَبْدِ اللَّهِ بْنِ مَعْبَدٍ الزِّمَّانِيِّ، عَنْ أَبِي قَتَادَةَ، بِهَذَا الْحَدِيثِ زَادَ قَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ صَوْمَ يَوْمِ الاِثْنَيْنِ وَيَوْمِ الْخَمِيسِ قَالَ ‏\"‏ فِيهِ وُلِدْتُ وَفِيهِ أُنْزِلَ عَلَىَّ الْقُرْآنُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 114,
        "matchingEnglishURN": 824200,
        "last_updated": null
    },
    {
        "arabicURN": 924300,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "53.00",
        "hadithNumber": "2427",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي صَوْمِ الدَّهْرِ تَطَوُّعًا ",
        "hadithText": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، قَالَ لَقِيَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَلَمْ أُحَدَّثْ أَنَّكَ تَقُولُ لأَقُومَنَّ اللَّيْلَ وَلأَصُومَنَّ النَّهَارَ ‏\"‏ ‏.‏ قَالَ - أَحْسِبُهُ قَالَ - نَعَمْ يَا رَسُولَ اللَّهِ قَدْ قُلْتُ ذَاكَ ‏.‏ قَالَ ‏\"‏ قُمْ وَنَمْ وَصُمْ وَأَفْطِرْ وَصُمْ مِنْ كُلِّ شَهْرٍ ثَلاَثَةَ أَيَّامٍ وَذَاكَ مِثْلُ صِيَامِ الدَّهْرِ ‏\"‏ ‏.‏ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ ‏.‏ قَالَ ‏\"‏ فَصُمْ يَوْمًا وَأَفْطِرْ يَوْمَيْنِ ‏\"‏ ‏.‏ قَالَ فَقُلْتُ إِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ قَالَ ‏\"‏ فَصُمْ يَوْمًا وَأَفْطِرْ يَوْمًا وَهُوَ أَعْدَلُ الصِّيَامِ وَهُوَ صِيَامُ دَاوُدَ ‏\"‏ ‏.‏ قُلْتُ إِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ أَفْضَلَ مِنْ ذَلِكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 115,
        "matchingEnglishURN": 824210,
        "last_updated": null
    },
    {
        "arabicURN": 924310,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "54.00",
        "hadithNumber": "2428",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي صَوْمِ أَشْهُرِ الْحُرُمِ ",
        "hadithText": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ سَعِيدٍ الْجُرَيْرِيِّ، عَنْ أَبِي السَّلِيلِ، عَنْ مُجِيبَةَ الْبَاهِلِيَّةِ، عَنْ أَبِيهَا، أَوْ عَمِّهَا أَنَّهُ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم ثُمَّ انْطَلَقَ فَأَتَاهُ بَعْدَ سَنَةٍ وَقَدْ تَغَيَّرَتْ حَالَتُهُ وَهَيْئَتُهُ فَقَالَ يَا رَسُولَ اللَّهِ أَمَا تَعْرِفُنِي قَالَ ‏\"‏ وَمَنْ أَنْتَ ‏\"‏ ‏.‏ قَالَ أَنَا الْبَاهِلِيُّ الَّذِي جِئْتُكَ عَامَ الأَوَّلِ ‏.‏ قَالَ ‏\"‏ فَمَا غَيَّرَكَ وَقَدْ كُنْتَ حَسَنَ الْهَيْئَةِ ‏\"‏ ‏.‏ قَالَ مَا أَكَلْتُ طَعَامًا إِلاَّ بِلَيْلٍ مُنْذُ فَارَقْتُكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لِمَ عَذَّبْتَ نَفْسَكَ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ صُمْ شَهْرَ الصَّبْرِ وَيَوْمًا مِنْ كُلِّ شَهْرٍ ‏\"‏ ‏.‏ قَالَ زِدْنِي فَإِنَّ بِي قُوَّةً ‏.‏ قَالَ ‏\"‏ صُمْ يَوْمَيْنِ ‏\"‏ ‏.‏ قَالَ زِدْنِي ‏.‏ قَالَ ‏\"‏ صُمْ ثَلاَثَةَ أَيَّامٍ ‏\"‏ ‏.‏ قَالَ زِدْنِي ‏.‏ قَالَ ‏\"‏ صُمْ مِنَ الْحُرُمِ وَاتْرُكْ صُمْ مِنَ الْحُرُمِ وَاتْرُكْ صُمْ مِنَ الْحُرُمِ وَاتْرُكْ ‏\"‏ ‏.‏ وَقَالَ بِأَصَابِعِهِ الثَّلاَثَةِ فَضَمَّهَا ثُمَّ أَرْسَلَهَا ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 116,
        "matchingEnglishURN": 824220,
        "last_updated": null
    },
    {
        "arabicURN": 924320,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "55.00",
        "hadithNumber": "2429",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي صَوْمِ الْمُحَرَّمِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَفْضَلُ الصِّيَامِ بَعْدَ شَهْرِ رَمَضَانَ شَهْرُ اللَّهِ الْمُحَرَّمُ وَإِنَّ أَفْضَلَ الصَّلاَةِ بَعْدَ الْمَفْرُوضَةِ صَلاَةٌ مِنَ اللَّيْلِ ‏\"‏ ‏.‏ لَمْ يَقُلْ قُتَيْبَةُ ‏\"‏ شَهْرِ ‏\"‏ ‏.‏ قَالَ ‏\"‏ رَمَضَانَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 117,
        "matchingEnglishURN": 824230,
        "last_updated": null
    },
    {
        "arabicURN": 924330,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "56.00",
        "hadithNumber": "2430",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي صَوْمِ رَجَبَ ",
        "hadithText": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، حَدَّثَنَا عِيسَى، حَدَّثَنَا عُثْمَانُ، - يَعْنِي ابْنَ حَكِيمٍ - قَالَ سَأَلْتُ سَعِيدَ بْنَ جُبَيْرٍ عَنْ صِيَامِ رَجَبَ، فَقَالَ أَخْبَرَنِي ابْنُ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَصُومُ حَتَّى نَقُولَ لاَ يُفْطِرُ وَيُفْطِرُ حَتَّى نَقُولَ لاَ يَصُومُ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 118,
        "matchingEnglishURN": 824240,
        "last_updated": null
    },
    {
        "arabicURN": 924340,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "57.00",
        "hadithNumber": "2431",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي صَوْمِ شَعْبَانَ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَيْسٍ، سَمِعَ عَائِشَةَ، تَقُولُ كَانَ أَحَبَّ الشُّهُورِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَنْ يَصُومَهُ شَعْبَانُ ثُمَّ يَصِلُهُ بِرَمَضَانَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 119,
        "matchingEnglishURN": 824250,
        "last_updated": null
    },
    {
        "arabicURN": 924350,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "58.00",
        "hadithNumber": "2432",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي صَوْمِ شَوَّالٍ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ الْعِجْلِيُّ، حَدَّثَنَا عُبَيْدُ اللَّهِ، - يَعْنِي ابْنَ مُوسَى - عَنْ هَارُونَ بْنِ سَلْمَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ مُسْلِمٍ الْقُرَشِيِّ، عَنْ أَبِيهِ، قَالَ سَأَلْتُ - أَوْ سُئِلَ النَّبِيُّ صلى الله عليه وسلم - عَنْ صِيَامِ الدَّهْرِ فَقَالَ ‏\"‏ إِنَّ لأَهْلِكَ عَلَيْكَ حَقًّا صُمْ رَمَضَانَ وَالَّذِي يَلِيهِ وَكُلَّ أَرْبِعَاءَ وَخَمِيسٍ فَإِذَا أَنْتَ قَدْ صُمْتَ الدَّهْرَ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَافَقَهُ زَيْدٌ الْعُكْلِيُّ وَخَالَفَهُ أَبُو نُعَيْمٍ قَالَ مُسْلِمُ بْنُ عُبَيْدِ اللَّهِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 120,
        "matchingEnglishURN": 824260,
        "last_updated": null
    },
    {
        "arabicURN": 924360,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "59.00",
        "hadithNumber": "2433",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي صَوْمِ سِتَّةِ أَيَّامٍ مِنْ شَوَّالٍ ",
        "hadithText": "حَدَّثَنَا النُّفَيْلِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، وَسَعْدِ بْنِ سَعِيدٍ، عَنْ عُمَرَ بْنِ ثَابِتٍ الأَنْصَارِيِّ، عَنْ أَبِي أَيُّوبَ، صَاحِبِ النَّبِيِّ صلى الله عليه وسلم عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ صَامَ رَمَضَانَ ثُمَّ أَتْبَعَهُ بِسِتٍّ مِنْ شَوَّالٍ فَكَأَنَّمَا صَامَ الدَّهْرَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 121,
        "matchingEnglishURN": 824270,
        "last_updated": null
    },
    {
        "arabicURN": 924370,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "60.00",
        "hadithNumber": "2434",
        "bookName": " كتاب الصوم ",
        "babName": " باب كَيْفَ كَانَ يَصُومُ النَّبِيُّ صلى الله عليه وسلم ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ حَتَّى نَقُولَ لاَ يُفْطِرُ وَيُفْطِرُ حَتَّى نَقُولَ لاَ يَصُومُ وَمَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَكْمَلَ صِيَامَ شَهْرٍ قَطُّ إِلاَّ رَمَضَانَ وَمَا رَأَيْتُهُ فِي شَهْرٍ أَكْثَرَ صِيَامًا مِنْهُ فِي شَعْبَانَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 122,
        "matchingEnglishURN": 824280,
        "last_updated": null
    },
    {
        "arabicURN": 924380,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "60.00",
        "hadithNumber": "2435",
        "bookName": " كتاب الصوم ",
        "babName": " باب كَيْفَ كَانَ يَصُومُ النَّبِيُّ صلى الله عليه وسلم ",
        "hadithText": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَاهُ ‏.‏ زَادَ كَانَ يَصُومُهُ إِلاَّ قَلِيلاً بَلْ كَانَ يَصُومُهُ كُلَّهُ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "حسن صحيح",
        "ourHadithNumber": 123,
        "matchingEnglishURN": 824290,
        "last_updated": null
    },
    {
        "arabicURN": 924390,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "61.00",
        "hadithNumber": "2436",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي صَوْمِ الاِثْنَيْنِ وَالْخَمِيسِ ",
        "hadithText": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبَانُ، حَدَّثَنَا يَحْيَى، عَنْ عُمَرَ بْنِ أَبِي الْحَكَمِ بْنِ ثَوْبَانَ، عَنْ مَوْلَى، قُدَامَةَ بْنِ مَظْعُونٍ عَنْ مَوْلَى، أُسَامَةَ بْنِ زَيْدٍ أَنَّهُ انْطَلَقَ مَعَ أُسَامَةَ إِلَى وَادِي الْقُرَى فِي طَلَبِ مَالٍ لَهُ فَكَانَ يَصُومُ يَوْمَ الاِثْنَيْنِ وَيَوْمَ الْخَمِيسِ فَقَالَ لَهُ مَوْلاَهُ لِمَ تَصُومُ يَوْمَ الاِثْنَيْنِ وَيَوْمَ الْخَمِيسِ وَأَنْتَ شَيْخٌ كَبِيرٌ فَقَالَ إِنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم كَانَ يَصُومُ يَوْمَ الاِثْنَيْنِ وَيَوْمَ الْخَمِيسِ وَسُئِلَ عَنْ ذَلِكَ فَقَالَ ‏\"‏ إِنَّ أَعْمَالَ الْعِبَادِ تُعْرَضُ يَوْمَ الاِثْنَيْنِ وَيَوْمَ الْخَمِيسِ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ كَذَا قَالَ هِشَامٌ الدَّسْتَوَائِيُّ عَنْ يَحْيَى عَنْ عُمَرَ بْنِ أَبِي الْحَكَمِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 124,
        "matchingEnglishURN": 824300,
        "last_updated": null
    },
    {
        "arabicURN": 924400,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "62.00",
        "hadithNumber": "2437",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي صَوْمِ الْعَشْرِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الْحُرِّ بْنِ الصَّبَّاحِ، عَنْ هُنَيْدَةَ بْنِ خَالِدٍ، عَنِ امْرَأَتِهِ، عَنْ بَعْضِ، أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ تِسْعَ ذِي الْحِجَّةِ وَيَوْمَ عَاشُورَاءَ وَثَلاَثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ أَوَّلَ اثْنَيْنِ مِنَ الشَّهْرِ وَالْخَمِيسَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 125,
        "matchingEnglishURN": 824310,
        "last_updated": null
    },
    {
        "arabicURN": 924410,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "62.00",
        "hadithNumber": "2438",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي صَوْمِ الْعَشْرِ ",
        "hadithText": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي صَالِحٍ، وَمُجَاهِدٍ، وَمُسْلِمٍ الْبَطِينِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْ أَيَّامٍ الْعَمَلُ الصَّالِحُ فِيهَا أَحَبُّ إِلَى اللَّهِ مِنْ هَذِهِ الأَيَّامِ ‏\"‏ ‏.‏ يَعْنِي أَيَّامَ الْعَشْرِ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَلاَ الْجِهَادُ فِي سَبِيلِ اللَّهِ قَالَ ‏\"‏ وَلاَ الْجِهَادُ فِي سَبِيلِ اللَّهِ إِلاَّ رَجُلٌ خَرَجَ بِنَفْسِهِ وَمَالِهِ فَلَمْ يَرْجِعْ مِنْ ذَلِكَ بِشَىْءٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 126,
        "matchingEnglishURN": 824320,
        "last_updated": null
    },
    {
        "arabicURN": 924420,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "63.00",
        "hadithNumber": "2439",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي فِطْرِ الْعَشْرِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم صَائِمًا الْعَشْرَ قَطُّ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 127,
        "matchingEnglishURN": 824330,
        "last_updated": null
    },
    {
        "arabicURN": 924430,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "64.00",
        "hadithNumber": "2440",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي صَوْمِ عَرَفَةَ بِعَرَفَةَ ",
        "hadithText": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَوْشَبُ بْنُ عَقِيلٍ، عَنْ مَهْدِيٍّ الْهَجَرِيِّ، حَدَّثَنَا عِكْرِمَةُ، قَالَ كُنَّا عِنْدَ أَبِي هُرَيْرَةَ فِي بَيْتِهِ فَحَدَّثَنَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ صَوْمِ يَوْمِ عَرَفَةَ بِعَرَفَةَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 128,
        "matchingEnglishURN": 824340,
        "last_updated": null
    },
    {
        "arabicURN": 924440,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "64.00",
        "hadithNumber": "2441",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي صَوْمِ عَرَفَةَ بِعَرَفَةَ ",
        "hadithText": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، عَنْ عُمَيْرٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ أُمِّ الْفَضْلِ بِنْتِ الْحَارِثِ، أَنَّ نَاسًا، تَمَارَوْا عِنْدَهَا يَوْمَ عَرَفَةَ فِي صَوْمِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ بَعْضُهُمْ هُوَ صَائِمٌ ‏.‏ وَقَالَ بَعْضُهُمْ لَيْسَ بِصَائِمٍ ‏.‏ فَأَرْسَلَتْ إِلَيْهِ بِقَدَحِ لَبَنٍ وَهُوَ وَاقِفٌ عَلَى بَعِيرِهِ بِعَرَفَةَ فَشَرِبَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 129,
        "matchingEnglishURN": 824350,
        "last_updated": null
    },
    {
        "arabicURN": 924450,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "65.00",
        "hadithNumber": "2442",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي صَوْمِ يَوْمِ عَاشُورَاءَ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ كَانَ يَوْمُ عَاشُورَاءَ يَوْمًا تَصُومُهُ قُرَيْشٌ فِي الْجَاهِلِيَّةِ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُهُ فِي الْجَاهِلِيَّةِ فَلَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ صَامَهُ وَأَمَرَ بِصِيَامِهِ فَلَمَّا فُرِضَ رَمَضَانُ كَانَ هُوَ الْفَرِيضَةَ وَتُرِكَ عَاشُورَاءُ فَمَنْ شَاءَ صَامَهُ وَمَنْ شَاءَ تَرَكَهُ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 130,
        "matchingEnglishURN": 824360,
        "last_updated": null
    },
    {
        "arabicURN": 924460,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "65.00",
        "hadithNumber": "2443",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي صَوْمِ يَوْمِ عَاشُورَاءَ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ عَاشُورَاءُ يَوْمًا نَصُومُهُ فِي الْجَاهِلِيَّةِ فَلَمَّا نَزَلَ رَمَضَانُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذَا يَوْمٌ مِنْ أَيَّامِ اللَّهِ فَمَنْ شَاءَ صَامَهُ وَمَنْ شَاءَ تَرَكَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 131,
        "matchingEnglishURN": 824370,
        "last_updated": null
    },
    {
        "arabicURN": 924470,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "65.00",
        "hadithNumber": "2444",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي صَوْمِ يَوْمِ عَاشُورَاءَ ",
        "hadithText": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ، حَدَّثَنَا هُشَيْمٌ، حَدَّثَنَا أَبُو بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا قَدِمَ النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ وَجَدَ الْيَهُودَ يَصُومُونَ عَاشُورَاءَ فَسُئِلُوا عَنْ ذَلِكَ فَقَالُوا هَذَا الْيَوْمُ الَّذِي أَظْهَرَ اللَّهُ فِيهِ مُوسَى عَلَى فِرْعَوْنَ وَنَحْنُ نَصُومُهُ تَعْظِيمًا لَهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَحْنُ أَوْلَى بِمُوسَى مِنْكُمْ ‏\"‏ ‏.‏ وَأَمَرَ بِصِيَامِهِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 132,
        "matchingEnglishURN": 824380,
        "last_updated": null
    },
    {
        "arabicURN": 924480,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "66.00",
        "hadithNumber": "2445",
        "bookName": " كتاب الصوم ",
        "babName": " باب مَا رُوِيَ أَنَّ عَاشُورَاءَ الْيَوْمُ التَّاسِعُ ",
        "hadithText": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ، أَنَّ إِسْمَاعِيلَ بْنَ أُمَيَّةَ الْقُرَشِيَّ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا غَطَفَانَ، يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، يَقُولُ حِينَ صَامَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ عَاشُورَاءَ وَأَمَرَنَا بِصِيَامِهِ قَالُوا يَا رَسُولَ اللَّهِ إِنَّهُ يَوْمٌ تُعَظِّمُهُ الْيَهُودُ وَالنَّصَارَى ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَإِذَا كَانَ الْعَامُ الْمُقْبِلُ صُمْنَا يَوْمَ التَّاسِعِ ‏\"‏ ‏.‏ فَلَمْ يَأْتِ الْعَامُ الْمُقْبِلُ حَتَّى تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 133,
        "matchingEnglishURN": 824390,
        "last_updated": null
    },
    {
        "arabicURN": 924490,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "66.00",
        "hadithNumber": "2446",
        "bookName": " كتاب الصوم ",
        "babName": " باب مَا رُوِيَ أَنَّ عَاشُورَاءَ الْيَوْمُ التَّاسِعُ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ - عَنْ مُعَاوِيَةَ بْنِ غَلاَبٍ، ح وَحَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا إِسْمَاعِيلُ، أَخْبَرَنِي حَاجِبُ بْنُ عُمَرَ، - جَمِيعًا الْمَعْنَى - عَنِ الْحَكَمِ بْنِ الأَعْرَجِ، قَالَ أَتَيْتُ ابْنَ عَبَّاسٍ وَهُوَ مُتَوَسِّدٌ رِدَاءَهُ فِي الْمَسْجِدِ الْحَرَامِ فَسَأَلْتُهُ عَنْ صَوْمِ يَوْمِ عَاشُورَاءَ فَقَالَ إِذَا رَأَيْتَ هِلاَلَ الْمُحَرَّمِ فَاعْدُدْ فَإِذَا كَانَ يَوْمُ التَّاسِعِ فَأَصْبِحْ صَائِمًا ‏.‏ فَقُلْتُ كَذَا كَانَ مُحَمَّدٌ صلى الله عليه وسلم يَصُومُ فَقَالَ كَذَلِكَ كَانَ مُحَمَّدٌ صلى الله عليه وسلم يَصُومُ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 134,
        "matchingEnglishURN": 824400,
        "last_updated": null
    },
    {
        "arabicURN": 924500,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "67.00",
        "hadithNumber": "2447",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي فَضْلِ صَوْمِهِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَسْلَمَةَ، عَنْ عَمِّهِ، أَنَّ أَسْلَمَ، أَتَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ صُمْتُمْ يَوْمَكُمْ هَذَا ‏\"‏ ‏.‏ قَالُوا لاَ ‏.‏ قَالَ ‏\"‏ فَأَتِمُّوا بَقِيَّةَ يَوْمِكُمْ وَاقْضُوهُ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ يَعْنِي يَوْمَ عَاشُورَاءَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 135,
        "matchingEnglishURN": 824410,
        "last_updated": null
    },
    {
        "arabicURN": 924510,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "68.00",
        "hadithNumber": "2448",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي صَوْمِ يَوْمٍ وَفِطْرِ يَوْمٍ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، وَمُحَمَّدُ بْنُ عِيسَى، وَمُسَدَّدٌ، - وَالإِخْبَارُ فِي حَدِيثِ أَحْمَدَ - قَالُوا حَدَّثَنَا سُفْيَانُ قَالَ سَمِعْتُ عَمْرًا قَالَ أَخْبَرَنِي عَمْرُو بْنُ أَوْسٍ سَمِعَهُ مِنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَحَبُّ الصِّيَامِ إِلَى اللَّهِ تَعَالَى صِيَامُ دَاوُدَ وَأَحَبُّ الصَّلاَةِ إِلَى اللَّهِ صَلاَةُ دَاوُدَ كَانَ يَنَامُ نِصْفَهُ وَيَقُومُ ثُلُثَهُ وَيَنَامُ سُدُسَهُ وَكَانَ يُفْطِرُ يَوْمًا وَيَصُومُ يَوْمًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 136,
        "matchingEnglishURN": 824420,
        "last_updated": null
    },
    {
        "arabicURN": 924520,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "69.00",
        "hadithNumber": "2449",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي صَوْمِ الثَّلاَثِ مِنْ كُلِّ شَهْرٍ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، حَدَّثَنَا هَمَّامٌ، عَنْ أَنَسٍ، أَخِي مُحَمَّدٍ عَنِ ابْنِ مِلْحَانَ الْقَيْسِيِّ، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُنَا أَنْ نَصُومَ الْبِيضَ ثَلاَثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ ‏.‏ قَالَ وَقَالَ ‏\"‏ هُنَّ كَهَيْئَةِ الدَّهْرِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 137,
        "matchingEnglishURN": 824430,
        "last_updated": null
    },
    {
        "arabicURN": 924530,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "69.00",
        "hadithNumber": "2450",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي صَوْمِ الثَّلاَثِ مِنْ كُلِّ شَهْرٍ ",
        "hadithText": "حَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا شَيْبَانُ، عَنْ عَاصِمٍ، عَنْ زِرٍّ، عَنْ عَبْدِ اللَّهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ - يَعْنِي مِنْ غُرَّةِ كُلِّ شَهْرٍ - ثَلاَثَةَ أَيَّامٍ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "حسن",
        "ourHadithNumber": 138,
        "matchingEnglishURN": 824440,
        "last_updated": null
    },
    {
        "arabicURN": 924540,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "70.00",
        "hadithNumber": "2451",
        "bookName": " كتاب الصوم ",
        "babName": " باب مَنْ قَالَ الاِثْنَيْنِ وَالْخَمِيسِ ",
        "hadithText": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ عَاصِمِ بْنِ بَهْدَلَةَ، عَنْ سَوَاءٍ الْخُزَاعِيِّ، عَنْ حَفْصَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ ثَلاَثَةَ أَيَّامٍ مِنَ الشَّهْرِ الاِثْنَيْنِ وَالْخَمِيسِ وَالاِثْنَيْنِ مِنَ الْجُمُعَةِ الأُخْرَى ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "حسن",
        "ourHadithNumber": 139,
        "matchingEnglishURN": 824450,
        "last_updated": null
    },
    {
        "arabicURN": 924550,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "70.00",
        "hadithNumber": "2452",
        "bookName": " كتاب الصوم ",
        "babName": " باب مَنْ قَالَ الاِثْنَيْنِ وَالْخَمِيسِ ",
        "hadithText": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، حَدَّثَنَا الْحَسَنُ بْنُ عُبَيْدِ اللَّهِ، عَنْ هُنَيْدَةَ الْخُزَاعِيِّ، عَنْ أُمِّهِ، قَالَتْ دَخَلْتُ عَلَى أُمِّ سَلَمَةَ فَسَأَلْتُهَا عَنِ الصِّيَامِ فَقَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُنِي أَنْ أَصُومَ ثَلاَثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ أَوَّلُهَا الاِثْنَيْنِ وَالْخَمِيسِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "منكر",
        "ourHadithNumber": 140,
        "matchingEnglishURN": 824460,
        "last_updated": null
    },
    {
        "arabicURN": 924560,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "71.00",
        "hadithNumber": "2453",
        "bookName": " كتاب الصوم ",
        "babName": " باب مَنْ قَالَ لاَ يُبَالِي مِنْ أَىِّ الشَّهْرِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ يَزِيدَ الرِّشْكِ، عَنْ مُعَاذَةَ، قَالَتْ قُلْتُ لِعَائِشَةَ أَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ مِنْ كُلِّ شَهْرٍ ثَلاَثَةَ أَيَّامٍ قَالَتْ نَعَمْ ‏.‏ قُلْتُ مِنْ أَىِّ شَهْرٍ كَانَ يَصُومُ قَالَتْ مَا كَانَ يُبَالِي مِنْ أَىِّ أَيَّامِ الشَّهْرِ كَانَ يَصُومُ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 141,
        "matchingEnglishURN": 824470,
        "last_updated": null
    },
    {
        "arabicURN": 924570,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "72.00",
        "hadithNumber": "2454",
        "bookName": " كتاب الصوم ",
        "babName": " باب النِّيَّةِ فِي الصِّيَامِ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، حَدَّثَنِي ابْنُ لَهِيعَةَ، وَيَحْيَى بْنُ أَيُّوبَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، عَنْ حَفْصَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ لَمْ يُجْمِعِ الصِّيَامَ قَبْلَ الْفَجْرِ فَلاَ صِيَامَ لَهُ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ اللَّيْثُ وَإِسْحَاقُ بْنُ حَازِمٍ أَيْضًا جَمِيعًا عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ مِثْلَهُ وَوَقَفَهُ عَلَى حَفْصَةَ مَعْمَرٌ وَالزُّبَيْدِيُّ وَابْنُ عُيَيْنَةَ وَيُونُسُ الأَيْلِيُّ كُلُّهُمْ عَنِ الزُّهْرِيِّ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 142,
        "matchingEnglishURN": 824480,
        "last_updated": null
    },
    {
        "arabicURN": 924580,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "73.00",
        "hadithNumber": "2455",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي الرُّخْصَةِ فِي ذَلِكَ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، حَدَّثَنَا سُفْيَانُ، ح وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، جَمِيعًا عَنْ طَلْحَةَ بْنِ يَحْيَى، عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا دَخَلَ عَلَىَّ قَالَ ‏\"‏ هَلْ عِنْدَكُمْ طَعَامٌ ‏\"‏ ‏.‏ فَإِذَا قُلْنَا لاَ قَالَ ‏\"‏ إِنِّي صَائِمٌ ‏\"‏ ‏.‏ زَادَ وَكِيعٌ فَدَخَلَ عَلَيْنَا يَوْمًا آخَرَ فَقُلْنَا يَا رَسُولَ اللَّهِ أُهْدِيَ لَنَا حَيْسٌ فَحَبَسْنَاهُ لَكَ ‏.‏ فَقَالَ ‏\"‏ أَدْنِيهِ ‏\"‏ ‏.‏ قَالَ طَلْحَةُ فَأَصْبَحَ صَائِمًا وَأَفْطَرَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "حسن صحيح",
        "ourHadithNumber": 143,
        "matchingEnglishURN": 824490,
        "last_updated": null
    },
    {
        "arabicURN": 924590,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "73.00",
        "hadithNumber": "2456",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي الرُّخْصَةِ فِي ذَلِكَ ",
        "hadithText": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، عَنْ أُمِّ هَانِئٍ، قَالَتْ لَمَّا كَانَ يَوْمُ الْفَتْحِ فَتْحِ مَكَّةَ جَاءَتْ فَاطِمَةُ فَجَلَسَتْ عَنْ يَسَارِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأُمُّ هَانِئٍ عَنْ يَمِينِهِ قَالَتْ فَجَاءَتِ الْوَلِيدَةُ بِإِنَاءٍ فِيهِ شَرَابٌ فَنَاوَلَتْهُ فَشَرِبَ مِنْهُ ثُمَّ نَاوَلَهُ أُمَّ هَانِئٍ فَشَرِبَتْ مِنْهُ فَقَالَتْ يَا رَسُولَ اللَّهِ لَقَدْ أَفْطَرْتُ وَكُنْتُ صَائِمَةً ‏.‏ فَقَالَ لَهَا ‏\"‏ أَكُنْتِ تَقْضِينَ شَيْئًا ‏\"‏ ‏.‏ قَالَتْ لاَ ‏.‏ قَالَ ‏\"‏ فَلاَ يَضُرُّكِ إِنْ كَانَ تَطَوُّعًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 144,
        "matchingEnglishURN": 824500,
        "last_updated": null
    },
    {
        "arabicURN": 924600,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "74.00",
        "hadithNumber": "2457",
        "bookName": " كتاب الصوم ",
        "babName": " باب مَنْ رَأَى عَلَيْهِ الْقَضَاءَ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي حَيْوَةُ بْنُ شُرَيْحٍ، عَنِ ابْنِ الْهَادِ، عَنْ زُمَيْلٍ، مَوْلَى عُرْوَةَ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، قَالَتْ أُهْدِيَ لِي وَلِحَفْصَةَ طَعَامٌ وَكُنَّا صَائِمَتَيْنِ فَأَفْطَرْنَا ثُمَّ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُلْنَا لَهُ يَا رَسُولَ اللَّهِ إِنَّا أُهْدِيَتْ لَنَا هَدِيَّةٌ فَاشْتَهَيْنَاهَا فَأَفْطَرْنَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ عَلَيْكُمَا صُومَا مَكَانَهُ يَوْمًا آخَرَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 145,
        "matchingEnglishURN": 824510,
        "last_updated": null
    },
    {
        "arabicURN": 924610,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "75.00",
        "hadithNumber": "2458",
        "bookName": " كتاب الصوم ",
        "babName": " باب الْمَرْأَةِ تَصُومُ بِغَيْرِ إِذْنِ زَوْجِهَا ",
        "hadithText": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَصُومُ الْمَرْأَةُ وَبَعْلُهَا شَاهِدٌ إِلاَّ بِإِذْنِهِ غَيْرَ رَمَضَانَ وَلاَ تَأْذَنُ فِي بَيْتِهِ وَهُوَ شَاهِدٌ إِلاَّ بِإِذْنِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح ق دون ذكر رمضان",
        "ourHadithNumber": 146,
        "matchingEnglishURN": 824520,
        "last_updated": null
    },
    {
        "arabicURN": 924620,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "75.00",
        "hadithNumber": "2459",
        "bookName": " كتاب الصوم ",
        "babName": " باب الْمَرْأَةِ تَصُومُ بِغَيْرِ إِذْنِ زَوْجِهَا ",
        "hadithText": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي سَعِيدٍ، قَالَ جَاءَتِ امْرَأَةٌ إِلَى النَّبِيِّ صلى الله عليه وسلم وَنَحْنُ عِنْدَهُ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ زَوْجِي صَفْوَانَ بْنَ الْمُعَطَّلِ يَضْرِبُنِي إِذَا صَلَّيْتُ وَيُفَطِّرُنِي إِذَا صُمْتُ وَلاَ يُصَلِّي صَلاَةَ الْفَجْرِ حَتَّى تَطْلُعَ الشَّمْسُ ‏.‏ قَالَ وَصَفْوَانُ عِنْدَهُ ‏.‏ قَالَ فَسَأَلَهُ عَمَّا قَالَتْ فَقَالَ يَا رَسُولَ اللَّهِ أَمَّا قَوْلُهَا يَضْرِبُنِي إِذَا صَلَّيْتُ فَإِنَّهَا تَقْرَأُ بِسُورَتَيْنِ وَقَدْ نَهَيْتُهَا ‏.‏ قَالَ فَقَالَ ‏\"‏ لَوْ كَانَتْ سُورَةً وَاحِدَةً لَكَفَتِ النَّاسَ ‏\"‏ ‏.‏ وَأَمَّا قَوْلُهَا يُفَطِّرُنِي فَإِنَّهَا تَنْطَلِقُ فَتَصُومُ وَأَنَا رَجُلٌ شَابٌّ فَلاَ أَصْبِرُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَئِذٍ ‏\"‏ لاَ تَصُومُ امْرَأَةٌ إِلاَّ بِإِذْنِ زَوْجِهَا ‏\"‏ ‏.‏ وَأَمَّا قَوْلُهَا إِنِّي لاَ أُصَلِّي حَتَّى تَطْلُعَ الشَّمْسُ فَإِنَّا أَهْلُ بَيْتٍ قَدْ عُرِفَ لَنَا ذَاكَ لاَ نَكَادُ نَسْتَيْقِظُ حَتَّى تَطْلُعَ الشَّمْسُ ‏.‏ قَالَ ‏\"‏ فَإِذَا اسْتَيْقَظْتَ فَصَلِّ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ حَمَّادٌ - يَعْنِي ابْنَ سَلَمَةَ - عَنْ حُمَيْدٍ أَوْ ثَابِتٍ عَنْ أَبِي الْمُتَوَكِّلِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 147,
        "matchingEnglishURN": 824530,
        "last_updated": null
    },
    {
        "arabicURN": 924630,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "76.00",
        "hadithNumber": "2460",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي الصَّائِمِ يُدْعَى إِلَى وَلِيمَةٍ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو خَالِدٍ، عَنْ هِشَامٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا دُعِيَ أَحَدُكُمْ فَلْيُجِبْ فَإِنْ كَانَ مُفْطِرًا فَلْيَطْعَمْ وَإِنْ كَانَ صَائِمًا فَلْيُصَلِّ ‏\"‏ ‏.‏ قَالَ هِشَامٌ وَالصَّلاَةُ الدُّعَاءُ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ حَفْصُ بْنُ غِيَاثٍ أَيْضًا عَنْ هِشَامٍ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 148,
        "matchingEnglishURN": 824540,
        "last_updated": null
    },
    {
        "arabicURN": 924640,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "77.00",
        "hadithNumber": "2461",
        "bookName": " كتاب الصوم ",
        "babName": " باب مَا يَقُولُ الصَّائِمُ إِذَا دُعِيَ إِلَى الطَّعَامِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا دُعِيَ أَحَدُكُمْ إِلَى طَعَامٍ وَهُوَ صَائِمٌ فَلْيَقُلْ إِنِّي صَائِمٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 149,
        "matchingEnglishURN": 824550,
        "last_updated": null
    },
    {
        "arabicURN": 924650,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "78.00",
        "hadithNumber": "2462",
        "bookName": " كتاب الصوم ",
        "babName": " باب الاِعْتِكَافِ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَعْتَكِفُ الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ حَتَّى قَبَضَهُ اللَّهُ ثُمَّ اعْتَكَفَ أَزْوَاجُهُ مِنْ بَعْدِهِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 150,
        "matchingEnglishURN": 824560,
        "last_updated": null
    },
    {
        "arabicURN": 924660,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "78.00",
        "hadithNumber": "2463",
        "bookName": " كتاب الصوم ",
        "babName": " باب الاِعْتِكَافِ ",
        "hadithText": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، أَخْبَرَنَا ثَابِتٌ، عَنْ أَبِي رَافِعٍ، عَنْ أُبَىِّ بْنِ كَعْبٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَعْتَكِفُ الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ فَلَمْ يَعْتَكِفْ عَامًا فَلَمَّا كَانَ الْعَامُ الْمُقْبِلُ اعْتَكَفَ عِشْرِينَ لَيْلَةً ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 151,
        "matchingEnglishURN": 824570,
        "last_updated": null
    },
    {
        "arabicURN": 924670,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "78.00",
        "hadithNumber": "2464",
        "bookName": " كتاب الصوم ",
        "babName": " باب الاِعْتِكَافِ ",
        "hadithText": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَيَعْلَى بْنُ عُبَيْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَرَادَ أَنْ يَعْتَكِفَ صَلَّى الْفَجْرَ ثُمَّ دَخَلَ مُعْتَكَفَهُ ‏.‏ قَالَتْ وَإِنَّهُ أَرَادَ مَرَّةً أَنْ يَعْتَكِفَ فِي الْعَشْرِ الأَوَاخِرِ مِنْ رَمَضَانَ ‏.‏ قَالَتْ فَأَمَرَ بِبِنَائِهِ فَضُرِبَ فَلَمَّا رَأَيْتُ ذَلِكَ أَمَرْتُ بِبِنَائِي فَضُرِبَ ‏.‏ قَالَتْ وَأَمَرَ غَيْرِي مِنْ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم بِبِنَائِهِ فَضُرِبَ فَلَمَّا صَلَّى الْفَجْرَ نَظَرَ إِلَى الأَبْنِيَةِ فَقَالَ ‏\"‏ مَا هَذِهِ آلْبِرَّ تُرِدْنَ ‏\"‏ ‏.‏ قَالَتْ فَأَمَرَ بِبِنَائِهِ فَقُوِّضَ وَأَمَرَ أَزْوَاجُهُ بِأَبْنِيَتِهِنَّ فَقُوِّضَتْ ثُمَّ أَخَّرَ الاِعْتِكَافَ إِلَى الْعَشْرِ الأُوَلِ يَعْنِي مِنْ شَوَّالٍ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ ابْنُ إِسْحَاقَ وَالأَوْزَاعِيُّ عَنْ يَحْيَى بْنِ سَعِيدٍ نَحْوَهُ وَرَوَاهُ مَالِكٌ عَنْ يَحْيَى بْنِ سَعِيدٍ قَالَ اعْتَكَفَ عِشْرِينَ مِنْ شَوَّالٍ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 152,
        "matchingEnglishURN": 824580,
        "last_updated": null
    },
    {
        "arabicURN": 924680,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "79.00",
        "hadithNumber": "2465",
        "bookName": " كتاب الصوم ",
        "babName": " باب أَيْنَ يَكُونُ الاِعْتِكَافُ ",
        "hadithText": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، أَنَّ نَافِعًا، أَخْبَرَهُ عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَعْتَكِفُ الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ ‏.‏ قَالَ نَافِعٌ وَقَدْ أَرَانِي عَبْدُ اللَّهِ الْمَكَانَ الَّذِي يَعْتَكِفُ فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنَ الْمَسْجِدِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح م خ دون قول نافع وقد ...",
        "ourHadithNumber": 153,
        "matchingEnglishURN": 824590,
        "last_updated": null
    },
    {
        "arabicURN": 924690,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "79.00",
        "hadithNumber": "2466",
        "bookName": " كتاب الصوم ",
        "babName": " باب أَيْنَ يَكُونُ الاِعْتِكَافُ ",
        "hadithText": "حَدَّثَنَا هَنَّادٌ، عَنْ أَبِي بَكْرٍ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَعْتَكِفُ كُلَّ رَمَضَانَ عَشَرَةَ أَيَّامٍ فَلَمَّا كَانَ الْعَامُ الَّذِي قُبِضَ فِيهِ اعْتَكَفَ عِشْرِينَ يَوْمًا ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "حسن صحيح",
        "ourHadithNumber": 154,
        "matchingEnglishURN": 824600,
        "last_updated": null
    },
    {
        "arabicURN": 924700,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "80.00",
        "hadithNumber": "2467",
        "bookName": " كتاب الصوم ",
        "babName": " باب الْمُعْتَكِفِ يَدْخُلُ الْبَيْتَ لِحَاجَتِهِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اعْتَكَفَ يُدْنِي إِلَىَّ رَأْسَهُ فَأُرَجِّلُهُ وَكَانَ لاَ يَدْخُلُ الْبَيْتَ إِلاَّ لِحَاجَةِ الإِنْسَانِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 155,
        "matchingEnglishURN": 824610,
        "last_updated": null
    },
    {
        "arabicURN": 924710,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "80.00",
        "hadithNumber": "2468",
        "bookName": " كتاب الصوم ",
        "babName": " باب الْمُعْتَكِفِ يَدْخُلُ الْبَيْتَ لِحَاجَتِهِ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَعَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، قَالاَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏ قَالَ أَبُو دَاوُدَ وَكَذَلِكَ رَوَاهُ يُونُسُ عَنِ الزُّهْرِيِّ وَلَمْ يُتَابِعْ أَحَدٌ مَالِكًا عَلَى عُرْوَةَ عَنْ عَمْرَةَ وَرَوَاهُ مَعْمَرٌ وَزِيَادُ بْنُ سَعْدٍ وَغَيْرُهُمَا عَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "",
        "ourHadithNumber": 156,
        "matchingEnglishURN": 824620,
        "last_updated": null
    },
    {
        "arabicURN": 924720,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "80.00",
        "hadithNumber": "2469",
        "bookName": " كتاب الصوم ",
        "babName": " باب الْمُعْتَكِفِ يَدْخُلُ الْبَيْتَ لِحَاجَتِهِ ",
        "hadithText": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، وَمُسَدَّدٌ، قَالاَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَكُونُ مُعْتَكِفًا فِي الْمَسْجِدِ فَيُنَاوِلُنِي رَأْسَهُ مِنْ خَلَلِ الْحُجْرَةِ فَأَغْسِلُ رَأْسَهُ ‏.‏ وَقَالَ مُسَدَّدٌ فَأُرَجِّلُهُ وَأَنَا حَائِضٌ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 157,
        "matchingEnglishURN": 824630,
        "last_updated": null
    },
    {
        "arabicURN": 924730,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "80.00",
        "hadithNumber": "2470",
        "bookName": " كتاب الصوم ",
        "babName": " باب الْمُعْتَكِفِ يَدْخُلُ الْبَيْتَ لِحَاجَتِهِ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ شَبُّويَةَ الْمَرْوَزِيُّ، حَدَّثَنِي عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ صَفِيَّةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم مُعْتَكِفًا فَأَتَيْتُهُ أَزُورُهُ لَيْلاً فَحَدَّثْتُهُ ثُمَّ قُمْتُ فَانْقَلَبْتُ فَقَامَ مَعِي لِيَقْلِبَنِي - وَكَانَ مَسْكَنُهَا فِي دَارِ أُسَامَةَ بْنِ زَيْدٍ - فَمَرَّ رَجُلاَنِ مِنَ الأَنْصَارِ فَلَمَّا رَأَيَا النَّبِيَّ صلى الله عليه وسلم أَسْرَعَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عَلَى رِسْلِكُمَا إِنَّهَا صَفِيَّةُ بِنْتُ حُيَىٍّ ‏\"‏ ‏.‏ قَالاَ سُبْحَانَ اللَّهِ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ إِنَّ الشَّيْطَانَ يَجْرِي مِنَ الإِنْسَانِ مَجْرَى الدَّمِ فَخَشِيتُ أَنْ يَقْذِفَ فِي قُلُوبِكُمَا شَيْئًا ‏\"‏ ‏.‏ أَوْ قَالَ ‏\"‏ شَرًّا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 158,
        "matchingEnglishURN": 824640,
        "last_updated": null
    },
    {
        "arabicURN": 924740,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "80.00",
        "hadithNumber": "2471",
        "bookName": " كتاب الصوم ",
        "babName": " باب الْمُعْتَكِفِ يَدْخُلُ الْبَيْتَ لِحَاجَتِهِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ، حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، بِإِسْنَادِهِ بِهَذَا قَالَتْ حَتَّى إِذَا كَانَ عِنْدَ بَابِ الْمَسْجِدِ الَّذِي عِنْدَ بَابِ أُمِّ سَلَمَةَ مَرَّ بِهِمَا رَجُلاَنِ ‏.‏ وَسَاقَ مَعْنَاهُ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 159,
        "matchingEnglishURN": 824650,
        "last_updated": null
    },
    {
        "arabicURN": 924750,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "81.00",
        "hadithNumber": "2472",
        "bookName": " كتاب الصوم ",
        "babName": " باب الْمُعْتَكِفِ يَعُودُ الْمَرِيضَ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، وَمُحَمَّدُ بْنُ عِيسَى، قَالاَ حَدَّثَنَا عَبْدُ السَّلاَمِ بْنُ حَرْبٍ، أَخْبَرَنَا اللَّيْثُ بْنُ أَبِي سُلَيْمٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، - قَالَ النُّفَيْلِيُّ - قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَمُرُّ بِالْمَرِيضِ وَهُوَ مُعْتَكِفٌ فَيَمُرُّ كَمَا هُوَ وَلاَ يُعَرِّجُ يَسْأَلُ عَنْهُ ‏.‏ وَقَالَ ابْنُ عِيسَى قَالَتْ إِنْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَعُودُ الْمَرِيضَ وَهُوَ مُعْتَكِفٌ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 160,
        "matchingEnglishURN": 824660,
        "last_updated": null
    },
    {
        "arabicURN": 924760,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "81.00",
        "hadithNumber": "2473",
        "bookName": " كتاب الصوم ",
        "babName": " باب الْمُعْتَكِفِ يَعُودُ الْمَرِيضَ ",
        "hadithText": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ، أَخْبَرَنَا خَالِدٌ، عَنْ عَبْدِ الرَّحْمَنِ، - يَعْنِي ابْنَ إِسْحَاقَ - عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتِ السُّنَّةُ عَلَى الْمُعْتَكِفِ أَنْ لاَ يَعُودَ مَرِيضًا وَلاَ يَشْهَدَ جَنَازَةً وَلاَ يَمَسَّ امْرَأَةً وَلاَ يُبَاشِرَهَا وَلاَ يَخْرُجَ لِحَاجَةٍ إِلاَّ لِمَا لاَ بُدَّ مِنْهُ وَلاَ اعْتِكَافَ إِلاَّ بِصَوْمٍ وَلاَ اعْتِكَافَ إِلاَّ فِي مَسْجِدٍ جَامِعٍ ‏.‏ قَالَ أَبُو دَاوُدَ غَيْرُ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَاقَ لاَ يَقُولُ فِيهِ قَالَتِ السُّنَّةُ ‏.‏ قَالَ أَبُو دَاوُدَ جَعَلَهُ قَوْلَ عَائِشَةَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "حسن صحيح",
        "ourHadithNumber": 161,
        "matchingEnglishURN": 824670,
        "last_updated": null
    },
    {
        "arabicURN": 924770,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "81.00",
        "hadithNumber": "2474",
        "bookName": " كتاب الصوم ",
        "babName": " باب الْمُعْتَكِفِ يَعُودُ الْمَرِيضَ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُدَيْلٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ، - رضى الله عنه - جَعَلَ عَلَيْهِ أَنْ يَعْتَكِفَ فِي الْجَاهِلِيَّةِ لَيْلَةً أَوْ يَوْمًا عِنْدَ الْكَعْبَةِ فَسَأَلَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ اعْتَكِفْ وَصُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح دون قوله أو يوما وقوله وصم ق",
        "ourHadithNumber": 162,
        "matchingEnglishURN": 824680,
        "last_updated": null
    },
    {
        "arabicURN": 924780,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "81.00",
        "hadithNumber": "2475",
        "bookName": " كتاب الصوم ",
        "babName": " باب الْمُعْتَكِفِ يَعُودُ الْمَرِيضَ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ مُحَمَّدٍ، عَنْ أَبَانَ بْنِ صَالِحٍ الْقُرَشِيِّ، حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ، - يَعْنِي الْعَنْقَزِيَّ - عَنْ عَبْدِ اللَّهِ بْنِ بُدَيْلٍ، بِإِسْنَادِهِ نَحْوَهُ قَالَ فَبَيْنَمَا هُوَ مُعْتَكِفٌ إِذْ كَبَّرَ النَّاسُ فَقَالَ مَا هَذَا يَا عَبْدَ اللَّهِ قَالَ سَبْىُ هَوَازِنَ أَعْتَقَهُمُ النَّبِيُّ صلى الله عليه وسلم قَالَ وَتِلْكَ الْجَارِيَةُ ‏.‏ فَأَرْسَلَهَا مَعَهُمْ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 163,
        "matchingEnglishURN": 824690,
        "last_updated": null
    },
    {
        "arabicURN": 924790,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "82.00",
        "hadithNumber": "2476",
        "bookName": " كتاب الصوم ",
        "babName": " باب فِي الْمُسْتَحَاضَةِ تَعْتَكِفُ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا يَزِيدُ، عَنْ خَالِدٍ، عَنْ عِكْرِمَةَ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتِ اعْتَكَفَتْ مَعَ النَّبِيِّ صلى الله عليه وسلم امْرَأَةٌ مِنْ أَزْوَاجِهِ فَكَانَتْ تَرَى الصُّفْرَةَ وَالْحُمْرَةَ فَرُبَّمَا وَضَعْنَا الطَّسْتَ تَحْتَهَا وَهِيَ تُصَلِّي ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": "صحيح",
        "ourHadithNumber": 164,
        "matchingEnglishURN": 824700,
        "last_updated": null
    }
]