[
    {
        "arabicURN": 941620,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "1.00",
        "hadithNumber": "4159",
        "bookName": " كتاب الترجل ",
        "babName": " باب النَّهْىِ عَنْ كَثِيرٍ، مِنَ الإِرْفَاهِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ هِشَامِ بْنِ حَسَّانَ، عَنِ الْحَسَنِ، عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ التَّرَجُّلِ إِلاَّ غِبًّا ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 1,
        "matchingEnglishURN": 841470,
        "last_updated": null
    },
    {
        "arabicURN": 941630,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "1.00",
        "hadithNumber": "4160",
        "bookName": " كتاب الترجل ",
        "babName": " باب النَّهْىِ عَنْ كَثِيرٍ، مِنَ الإِرْفَاهِ ",
        "hadithText": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا يَزِيدُ الْمَازِنِيُّ، أَخْبَرَنَا الْجُرَيْرِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، أَنَّ رَجُلاً، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم رَحَلَ إِلَى فَضَالَةَ بْنِ عُبَيْدٍ وَهُوَ بِمِصْرَ فَقَدِمَ عَلَيْهِ فَقَالَ أَمَا إِنِّي لَمْ آتِكَ زَائِرًا وَلَكِنِّي سَمِعْتُ أَنَا وَأَنْتَ حَدِيثًا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم رَجَوْتُ أَنْ يَكُونَ عِنْدَكَ مِنْهُ عِلْمٌ ‏.‏ قَالَ وَمَا هُوَ قَالَ كَذَا وَكَذَا قَالَ فَمَا لِي أَرَاكَ شَعِثًا وَأَنْتَ أَمِيرُ الأَرْضِ قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَنْهَانَا عَنْ كَثِيرٍ مِنَ الإِرْفَاهِ ‏.‏ قَالَ فَمَا لِي لاَ أَرَى عَلَيْكَ حِذَاءً قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَأْمُرُنَا أَنْ نَحْتَفِيَ أَحْيَانًا ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 2,
        "matchingEnglishURN": 841480,
        "last_updated": null
    },
    {
        "arabicURN": 941640,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "1.00",
        "hadithNumber": "4161",
        "bookName": " كتاب الترجل ",
        "babName": " باب النَّهْىِ عَنْ كَثِيرٍ، مِنَ الإِرْفَاهِ ",
        "hadithText": "حَدَّثَنَا النُّفَيْلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أُمَامَةَ، عَنْ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِي أُمَامَةَ، قَالَ ذَكَرَ أَصْحَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمًا عِنْدَهُ الدُّنْيَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلاَ تَسْمَعُونَ أَلاَ تَسْمَعُونَ إِنَّ الْبَذَاذَةَ مِنَ الإِيمَانِ إِنَّ الْبَذَاذَةَ مِنَ الإِيمَانِ ‏\"‏ ‏.‏ يَعْنِي التَّقَحُّلَ ‏.‏ قَالَ أَبُو دَاوُدَ هُوَ أَبُو أُمَامَةَ بْنُ ثَعْلَبَةَ الأَنْصَارِيُّ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 3,
        "matchingEnglishURN": 841490,
        "last_updated": null
    },
    {
        "arabicURN": 941650,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "2.00",
        "hadithNumber": "4162",
        "bookName": " كتاب الترجل ",
        "babName": " باب مَا جَاءَ فِي اسْتِحْبَابِ الطِّيبِ ",
        "hadithText": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، حَدَّثَنَا أَبُو أَحْمَدَ، عَنْ شَيْبَانَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ اللَّهِ بْنِ الْمُخْتَارِ، عَنْ مُوسَى بْنِ أَنَسٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَتْ لِلنَّبِيِّ صلى الله عليه وسلم سُكَّةٌ يَتَطَيَّبُ مِنْهَا ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 4,
        "matchingEnglishURN": 841500,
        "last_updated": null
    },
    {
        "arabicURN": 941660,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "3.00",
        "hadithNumber": "4163",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي إِصْلاَحِ الشَّعْرِ ",
        "hadithText": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنِي ابْنُ أَبِي الزِّنَادِ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ كَانَ لَهُ شَعْرٌ فَلْيُكْرِمْهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "حسن صحيح",
        "ourHadithNumber": 5,
        "matchingEnglishURN": 841510,
        "last_updated": null
    },
    {
        "arabicURN": 941670,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "4.00",
        "hadithNumber": "4164",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي الْخِضَابِ لِلنِّسَاءِ ",
        "hadithText": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عَلِيِّ بْنِ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ حَدَّثَتْنِي كَرِيمَةُ بِنْتُ هَمَّامٍ، أَنَّ امْرَأَةً، أَتَتْ عَائِشَةَ - رضى الله عنها - فَسَأَلَتْهَا عَنْ خِضَابِ الْحِنَّاءِ فَقَالَتْ لاَ بَأْسَ بِهِ وَلَكِنِّي أَكْرَهُهُ كَانَ حَبِيبِي رَسُولُ اللَّهِ صلى الله عليه وسلم يَكْرَهُ رِيحَهُ ‏.‏ قَالَ أَبُو دَاوُدَ تَعْنِي خِضَابَ شَعْرِ الرَّأْسِ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 6,
        "matchingEnglishURN": 841520,
        "last_updated": null
    },
    {
        "arabicURN": 941680,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "4.00",
        "hadithNumber": "4165",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي الْخِضَابِ لِلنِّسَاءِ ",
        "hadithText": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَتْنِي غِبْطَةُ بِنْتُ عَمْرٍو الْمُجَاشِعِيَّةُ، قَالَتْ حَدَّثَتْنِي عَمَّتِي أُمُّ الْحَسَنِ، عَنْ جَدَّتِهَا، عَنْ عَائِشَةَ، رضى الله عنها أَنَّ هِنْدًا بِنْتَ عُتْبَةَ، قَالَتْ يَا نَبِيَّ اللَّهِ بَايِعْنِي ‏.‏ قَالَ ‏\"‏ لاَ أُبَايِعُكِ حَتَّى تُغَيِّرِي كَفَّيْكِ كَأَنَّهُمَا كَفَّا سَبُعٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 7,
        "matchingEnglishURN": 841530,
        "last_updated": null
    },
    {
        "arabicURN": 941690,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "4.00",
        "hadithNumber": "4166",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي الْخِضَابِ لِلنِّسَاءِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ مُحَمَّدٍ الصُّورِيُّ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنَا مُطِيعُ بْنُ مَيْمُونٍ، عَنْ صَفِيَّةَ بِنْتِ عِصْمَةَ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ أَوْمَتِ امْرَأَةٌ مِنْ وَرَاءِ سِتْرٍ بِيَدِهَا كِتَابٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَبَضَ النَّبِيُّ صلى الله عليه وسلم يَدَهُ فَقَالَ ‏\"‏ مَا أَدْرِي أَيَدُ رَجُلٍ أَمْ يَدُ امْرَأَةٍ ‏\"‏ ‏.‏ قَالَتْ بَلِ امْرَأَةٌ ‏.‏ قَالَ ‏\"‏ لَوْ كُنْتِ امْرَأَةً لَغَيَّرْتِ أَظْفَارَكِ ‏\"‏ ‏.‏ يَعْنِي بِالْحِنَّاءِ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "حسن",
        "ourHadithNumber": 8,
        "matchingEnglishURN": 841540,
        "last_updated": null
    },
    {
        "arabicURN": 941700,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "5.00",
        "hadithNumber": "4167",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي صِلَةِ الشَّعْرِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ، عَامَ حَجَّ وَهُوَ عَلَى الْمِنْبَرِ وَتَنَاوَلَ قُصَّةً مِنْ شَعْرٍ كَانَتْ فِي يَدِ حَرَسِيٍّ يَقُولُ يَا أَهْلَ الْمَدِينَةِ أَيْنَ عُلَمَاؤُكُمْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنْ مِثْلِ هَذِهِ وَيَقُولُ ‏\"‏ إِنَّمَا هَلَكَتْ بَنُو إِسْرَائِيلَ حِينَ اتَّخَذَ هَذِهِ نِسَاؤُهُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 9,
        "matchingEnglishURN": 841550,
        "last_updated": null
    },
    {
        "arabicURN": 941710,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "5.00",
        "hadithNumber": "4168",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي صِلَةِ الشَّعْرِ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، وَمُسَدَّدٌ، قَالاَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ، قَالَ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ وَالْوَاشِمَةَ وَالْمُسْتَوْشِمَةَ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 10,
        "matchingEnglishURN": 841560,
        "last_updated": null
    },
    {
        "arabicURN": 941720,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "5.00",
        "hadithNumber": "4169",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي صِلَةِ الشَّعْرِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، - الْمَعْنَى - قَالاَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ لَعَنَ اللَّهُ الْوَاشِمَاتِ وَالْمُسْتَوْشِمَاتِ ‏.‏ قَالَ مُحَمَّدٌ وَالْوَاصِلاَتِ وَقَالَ عُثْمَانُ وَالْمُتَنَمِّصَاتِ ثُمَّ اتَّفَقَا وَالْمُتَفَلِّجَاتِ لِلْحُسْنِ الْمُغَيِّرَاتِ خَلْقَ اللَّهِ عَزَّ وَجَلَّ ‏.‏ فَبَلَغَ ذَلِكَ امْرَأَةً مِنْ بَنِي أَسَدٍ يُقَالُ لَهَا أُمُّ يَعْقُوبَ ‏.‏ زَادَ عُثْمَانُ كَانَتْ تَقْرَأُ الْقُرْآنَ ثُمَّ اتَّفَقَا فَأَتَتْهُ فَقَالَتْ بَلَغَنِي عَنْكَ أَنَّكَ لَعَنْتَ الْوَاشِمَاتِ وَالْمُسْتَوْشِمَاتِ ‏.‏ قَالَ مُحَمَّدٌ وَالْوَاصِلاَتِ وَقَالَ عُثْمَانُ وَالْمُتَنَمِّصَاتِ ثُمَّ اتَّفَقَا وَالْمُتَفَلِّجَاتِ قَالَ عُثْمَانُ لِلْحُسْنِ الْمُغَيِّرَاتِ خَلْقَ اللَّهِ تَعَالَى ‏.‏ فَقَالَ وَمَا لِي لاَ أَلْعَنُ مَنْ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ فِي كِتَابِ اللَّهِ تَعَالَى قَالَتْ لَقَدْ قَرَأْتُ مَا بَيْنَ لَوْحَىِ الْمُصْحَفِ فَمَا وَجَدْتُهُ ‏.‏ فَقَالَ وَاللَّهِ لَئِنْ كُنْتِ قَرَأْتِيهِ لَقَدْ وَجَدْتِيهِ ثُمَّ قَرَأَ ‏<A id=\"q1\" name=\"q1\" href=\"javascript:openquran(58,7,7)\"><c_q1>{‏ وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا ‏}</c_q1></a>‏ قَالَتْ إِنِّي أَرَى بَعْضَ هَذَا عَلَى امْرَأَتِكَ ‏.‏ قَالَ فَادْخُلِي فَانْظُرِي ‏.‏ فَدَخَلَتْ ثُمَّ خَرَجَتْ فَقَالَ مَا رَأَيْتِ وَقَالَ عُثْمَانُ فَقَالَتْ مَا رَأَيْتُ ‏.‏ فَقَالَ لَوْ كَانَ ذَلِكَ مَا كَانَتْ مَعَنَا ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 11,
        "matchingEnglishURN": 841570,
        "last_updated": null
    },
    {
        "arabicURN": 941730,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "5.00",
        "hadithNumber": "4170",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي صِلَةِ الشَّعْرِ ",
        "hadithText": "حَدَّثَنَا ابْنُ السَّرْحِ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ أُسَامَةَ، عَنْ أَبَانَ بْنِ صَالِحٍ، عَنْ مُجَاهِدِ بْنِ جَبْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لُعِنَتِ الْوَاصِلَةُ وَالْمُسْتَوْصِلَةُ وَالنَّامِصَةُ وَالْمُتَنَمِّصَةُ وَالْوَاشِمَةُ وَالْمُسْتَوْشِمَةُ مِنْ غَيْرِ دَاءٍ ‏.‏ قَالَ أَبُو دَاوُدَ وَتَفْسِيرُ الْوَاصِلَةِ الَّتِي تَصِلُ الشَّعْرَ بِشَعْرِ النِّسَاءِ وَالْمُسْتَوْصِلَةُ الْمَعْمُولُ بِهَا وَالنَّامِصَةُ الَّتِي تَنْقُشُ الْحَاجِبَ حَتَّى تَرِقَّهُ وَالْمُتَنَمِّصَةُ الْمَعْمُولُ بِهَا وَالْوَاشِمَةُ الَّتِي تَجْعَلُ الْخِيلاَنَ فِي وَجْهِهَا بِكُحْلٍ أَوْ مِدَادٍ وَالْمُسْتَوْشِمَةُ الْمَعْمُولُ بِهَا ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 12,
        "matchingEnglishURN": 841580,
        "last_updated": null
    },
    {
        "arabicURN": 941740,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "5.00",
        "hadithNumber": "4171",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي صِلَةِ الشَّعْرِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرِ بْنِ زِيَادٍ، قَالَ حَدَّثَنَا شَرِيكٌ، عَنْ سَالِمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ لاَ بَأْسَ بِالْقَرَامِلِ ‏.‏ قَالَ أَبُو دَاوُدَ كَأَنَّهُ يَذْهَبُ إِلَى أَنَّ الْمَنْهِيَّ، عَنْهُ شُعُورُ النِّسَاءِ ‏.‏ قَالَ أَبُو دَاوُدَ كَانَ أَحْمَدُ يَقُولُ الْقَرَامِلُ لَيْسَ بِهِ بَأْسٌ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "ضعيف مقطوع منكر",
        "ourHadithNumber": 13,
        "matchingEnglishURN": 841590,
        "last_updated": null
    },
    {
        "arabicURN": 941750,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "6.00",
        "hadithNumber": "4172",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي رَدِّ الطِّيبِ ",
        "hadithText": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، وَهَارُونُ بْنُ عَبْدِ اللَّهِ، - الْمَعْنَى - أَنَّ أَبَا عَبْدِ الرَّحْمَنِ الْمُقْرِئَ، حَدَّثَهُمْ عَنْ سَعِيدِ بْنِ أَبِي أَيُّوبَ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ عُرِضَ عَلَيْهِ طِيبٌ فَلاَ يَرُدَّهُ فَإِنَّهُ طَيِّبُ الرِّيحِ خَفِيفُ الْمَحْمَلِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 14,
        "matchingEnglishURN": 841600,
        "last_updated": null
    },
    {
        "arabicURN": 941760,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "7.00",
        "hadithNumber": "4173",
        "bookName": " كتاب الترجل ",
        "babName": " باب مَا جَاءَ فِي الْمَرْأَةِ تَتَطَيَّبُ لِلْخُرُوجِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، أَخْبَرَنَا ثَابِتُ بْنُ عُمَارَةَ، حَدَّثَنِي غُنَيْمُ بْنُ قَيْسٍ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا اسْتَعْطَرَتِ الْمَرْأَةُ فَمَرَّتْ عَلَى الْقَوْمِ لِيَجِدُوا رِيحَهَا فَهِيَ كَذَا وَكَذَا ‏\"‏ ‏.‏ قَالَ قَوْلاً شَدِيدًا ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "حسن",
        "ourHadithNumber": 15,
        "matchingEnglishURN": 841610,
        "last_updated": null
    },
    {
        "arabicURN": 941770,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "7.00",
        "hadithNumber": "4174",
        "bookName": " كتاب الترجل ",
        "babName": " باب مَا جَاءَ فِي الْمَرْأَةِ تَتَطَيَّبُ لِلْخُرُوجِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ، عَنْ عُبَيْدِ اللَّهِ، مَوْلَى أَبِي رُهْمٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ لَقِيَتْهُ امْرَأَةٌ وَجَدَ مِنْهَا رِيحَ الطِّيبِ يُنْفَحُ وَلِذَيْلِهَا إِعْصَارٌ فَقَالَ يَا أَمَةَ الْجَبَّارِ جِئْتِ مِنَ الْمَسْجِدِ قَالَتْ نَعَمْ ‏.‏ قَالَ وَلَهُ تَطَيَّبْتِ قَالَتْ نَعَمْ ‏.‏ قَالَ إِنِّي سَمِعْتُ حِبِّي أَبَا الْقَاسِمِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ تُقْبَلُ صَلاَةٌ لاِمْرَأَةٍ تَطَيَّبَتْ لِهَذَا الْمَسْجِدِ حَتَّى تَرْجِعَ فَتَغْتَسِلَ غُسْلَهَا مِنَ الْجَنَابَةِ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ الإِعْصَارُ غُبَارٌ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 16,
        "matchingEnglishURN": 841620,
        "last_updated": null
    },
    {
        "arabicURN": 941780,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "7.00",
        "hadithNumber": "4175",
        "bookName": " كتاب الترجل ",
        "babName": " باب مَا جَاءَ فِي الْمَرْأَةِ تَتَطَيَّبُ لِلْخُرُوجِ ",
        "hadithText": "حَدَّثَنَا النُّفَيْلِيُّ، وَسَعِيدُ بْنُ مَنْصُورٍ، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ أَبُو عَلْقَمَةَ، قَالَ حَدَّثَنِي يَزِيدُ بْنُ خُصَيْفَةَ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَيُّمَا امْرَأَةٍ أَصَابَتْ بَخُورًا فَلاَ تَشْهَدَنَّ مَعَنَا الْعِشَاءَ ‏\"‏ ‏.‏ قَالَ ابْنُ نُفَيْلٍ ‏\"‏ عِشَاءَ الآخِرَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 17,
        "matchingEnglishURN": 841630,
        "last_updated": null
    },
    {
        "arabicURN": 941790,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "8.00",
        "hadithNumber": "4176",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي الْخَلُوقِ لِلرِّجَالِ ",
        "hadithText": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، أَخْبَرَنَا عَطَاءٌ الْخُرَاسَانِيُّ، عَنْ يَحْيَى بْنِ يَعْمَرَ، عَنْ عَمَّارِ بْنِ يَاسِرٍ، قَالَ قَدِمْتُ عَلَى أَهْلِي لَيْلاً وَقَدْ تَشَقَّقَتْ يَدَاىَ فَخَلَّقُونِي بِزَعْفَرَانٍ فَغَدَوْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم فَسَلَّمْتُ عَلَيْهِ فَلَمْ يَرُدَّ عَلَىَّ وَلَمْ يُرَحِّبْ بِي فَقَالَ ‏\"‏ اذْهَبْ فَاغْسِلْ هَذَا عَنْكَ ‏\"‏ ‏.‏ فَذَهَبْتُ فَغَسَلْتُهُ ثُمَّ جِئْتُ وَقَدْ بَقِيَ عَلَىَّ مِنْهُ رَدْعٌ فَسَلَّمْتُ فَلَمْ يَرُدَّ عَلَىَّ وَلَمْ يُرَحِّبْ بِي وَقَالَ ‏\"‏ اذْهَبْ فَاغْسِلْ هَذَا عَنْكَ ‏\"‏ ‏.‏ فَذَهَبْتُ فَغَسَلْتُهُ ثُمَّ جِئْتُ فَسَلَّمْتُ عَلَيْهِ فَرَدَّ عَلَىَّ وَرَحَّبَ بِي وَقَالَ ‏\"‏ إِنَّ الْمَلاَئِكَةَ لاَ تَحْضُرُ جَنَازَةَ الْكَافِرِ بِخَيْرٍ وَلاَ الْمُتَضَمِّخَ بِالزَّعْفَرَانِ وَلاَ الْجُنُبَ ‏\"‏ ‏.‏ قَالَ وَرَخَّصَ لِلْجُنُبِ إِذَا نَامَ أَوْ أَكَلَ أَوْ شَرِبَ أَنْ يَتَوَضَّأَ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "حسن",
        "ourHadithNumber": 18,
        "matchingEnglishURN": 841640,
        "last_updated": null
    },
    {
        "arabicURN": 941800,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "8.00",
        "hadithNumber": "4177",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي الْخَلُوقِ لِلرِّجَالِ ",
        "hadithText": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عُمَرُ بْنُ عَطَاءِ بْنِ أَبِي الْخُوَارِ، أَنَّهُ سَمِعَ يَحْيَى بْنَ يَعْمَرَ، يُخْبِرُ عَنْ رَجُلٍ، أَخْبَرَهُ عَنْ عَمَّارِ بْنِ يَاسِرٍ، - زَعَمَ عُمَرُ أَنَّ يَحْيَى، سَمَّى ذَلِكَ الرَّجُلَ فَنَسِيَ عُمَرُ اسْمَهُ - أَنَّ عَمَّارًا قَالَ تَخَلَّقْتُ بِهَذِهِ الْقِصَّةِ ‏.‏ وَالأَوَّلُ أَتَمُّ بِكَثِيرٍ فِيهِ ذَكَرَ الْغُسْلَ قَالَ قُلْتُ لِعُمَرَ وَهُمْ حُرُمٌ قَالَ لاَ الْقَوْمُ مُقِيمُونَ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "حسن",
        "ourHadithNumber": 19,
        "matchingEnglishURN": 841650,
        "last_updated": null
    },
    {
        "arabicURN": 941810,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "8.00",
        "hadithNumber": "4178",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي الْخَلُوقِ لِلرِّجَالِ ",
        "hadithText": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ الأَسَدِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ حَرْبٍ الأَسَدِيُّ، حَدَّثَنَا أَبُو جَعْفَرٍ الرَّازِيُّ، عَنِ الرَّبِيعِ بْنِ أَنَسٍ، عَنْ جَدَّيْهِ، قَالاَ سَمِعْنَا أَبَا مُوسَى، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يَقْبَلُ اللَّهُ تَعَالَى صَلاَةَ رَجُلٍ فِي جَسَدِهِ شَىْءٌ مِنْ خَلُوقٍ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ جَدَّاهُ زَيْدٌ وَزِيَادٌ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 20,
        "matchingEnglishURN": 841660,
        "last_updated": null
    },
    {
        "arabicURN": 941820,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "8.00",
        "hadithNumber": "4179",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي الْخَلُوقِ لِلرِّجَالِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، أَنَّ حَمَّادَ بْنَ زَيْدٍ، وَإِسْمَاعِيلَ بْنَ إِبْرَاهِيمَ، حَدَّثَاهُمْ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ التَّزَعْفُرِ لِلرِّجَالِ وَقَالَ عَنْ إِسْمَاعِيلَ أَنْ يَتَزَعْفَرَ الرَّجُلُ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 21,
        "matchingEnglishURN": 841670,
        "last_updated": null
    },
    {
        "arabicURN": 941830,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "8.00",
        "hadithNumber": "4180",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي الْخَلُوقِ لِلرِّجَالِ ",
        "hadithText": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ الأُوَيْسِيُّ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ، عَنِ الْحَسَنِ بْنِ أَبِي الْحَسَنِ، عَنْ عَمَّارِ بْنِ يَاسِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ ثَلاَثَةٌ لاَ تَقْرَبُهُمُ الْمَلاَئِكَةُ جِيفَةُ الْكَافِرِ وَالْمُتَضَمِّخُ بِالْخَلُوقِ وَالْجُنُبُ إِلاَّ أَنْ يَتَوَضَّأَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "حسن",
        "ourHadithNumber": 22,
        "matchingEnglishURN": 841680,
        "last_updated": null
    },
    {
        "arabicURN": 941840,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "8.00",
        "hadithNumber": "4181",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي الْخَلُوقِ لِلرِّجَالِ ",
        "hadithText": "حَدَّثَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الرَّقِّيُّ، حَدَّثَنَا عُمَرُ بْنُ أَيُّوبَ، عَنْ جَعْفَرِ بْنِ بُرْقَانَ، عَنْ ثَابِتِ بْنِ الْحَجَّاجِ، عَنْ عَبْدِ اللَّهِ الْهَمْدَانِيِّ، عَنِ الْوَلِيدِ بْنِ عُقْبَةَ، قَالَ لَمَّا فَتَحَ نَبِيُّ اللَّهِ صلى الله عليه وسلم مَكَّةَ جَعَلَ أَهْلُ مَكَّةَ يَأْتُونَهُ بِصِبْيَانِهِمْ فَيَدْعُو لَهُمْ بِالْبَرَكَةِ وَيَمْسَحُ رُءُوسَهُمْ قَالَ فَجِيءَ بِي إِلَيْهِ وَأَنَا مُخَلَّقٌ فَلَمْ يَمَسَّنِي مِنْ أَجْلِ الْخَلُوقِ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "منكر",
        "ourHadithNumber": 23,
        "matchingEnglishURN": 841690,
        "last_updated": null
    },
    {
        "arabicURN": 941850,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "8.00",
        "hadithNumber": "4182",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي الْخَلُوقِ لِلرِّجَالِ ",
        "hadithText": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا سَلْمٌ الْعَلَوِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَجُلاً، دَخَلَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَعَلَيْهِ أَثَرُ صُفْرَةٍ - وَكَانَ النَّبِيُّ صلى الله عليه وسلم قَلَّمَا يُوَاجِهُ رَجُلاً فِي وَجْهِهِ بِشَىْءٍ يَكْرَهُهُ - فَلَمَّا خَرَجَ قَالَ ‏\"‏ لَوْ أَمَرْتُمْ هَذَا أَنْ يَغْسِلَ هَذَا عَنْهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 24,
        "matchingEnglishURN": 841700,
        "last_updated": null
    },
    {
        "arabicURN": 941860,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "9.00",
        "hadithNumber": "4183",
        "bookName": " كتاب الترجل ",
        "babName": " باب مَا جَاءَ فِي الشَّعْرِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، وَمُحَمَّدُ بْنُ سُلَيْمَانَ الأَنْبَارِيُّ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ مَا رَأَيْتُ مِنْ ذِي لِمَّةٍ أَحْسَنَ فِي حُلَّةٍ حَمْرَاءَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم زَادَ مُحَمَّدُ بْنُ سُلَيْمَانَ لَهُ شَعْرٌ يَضْرِبُ مَنْكِبَيْهِ ‏.‏ قَالَ أَبُو دَاوُدَ وَكَذَا رَوَاهُ إِسْرَائِيلُ عَنْ أَبِي إِسْحَاقَ قَالَ يَضْرِبُ مَنْكِبَيْهِ وَقَالَ شُعْبَةُ يَبْلُغُ شَحْمَةَ أُذُنَيْهِ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 25,
        "matchingEnglishURN": 841710,
        "last_updated": null
    },
    {
        "arabicURN": 941870,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "9.00",
        "hadithNumber": "4184",
        "bookName": " كتاب الترجل ",
        "babName": " باب مَا جَاءَ فِي الشَّعْرِ ",
        "hadithText": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَهُ شَعْرٌ يَبْلُغُ شَحْمَةَ أُذُنَيْهِ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 26,
        "matchingEnglishURN": 841720,
        "last_updated": null
    },
    {
        "arabicURN": 941880,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "9.00",
        "hadithNumber": "4185",
        "bookName": " كتاب الترجل ",
        "babName": " باب مَا جَاءَ فِي الشَّعْرِ ",
        "hadithText": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ كَانَ شَعْرُ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى شَحْمَةِ أُذُنَيْهِ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 27,
        "matchingEnglishURN": 841730,
        "last_updated": null
    },
    {
        "arabicURN": 941890,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "9.00",
        "hadithNumber": "4186",
        "bookName": " كتاب الترجل ",
        "babName": " باب مَا جَاءَ فِي الشَّعْرِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا إِسْمَاعِيلُ، أَخْبَرَنَا حُمَيْدٌ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ شَعْرُ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى أَنْصَافِ أُذُنَيْهِ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 28,
        "matchingEnglishURN": 841740,
        "last_updated": null
    },
    {
        "arabicURN": 941900,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "9.00",
        "hadithNumber": "4187",
        "bookName": " كتاب الترجل ",
        "babName": " باب مَا جَاءَ فِي الشَّعْرِ ",
        "hadithText": "حَدَّثَنَا ابْنُ نُفَيْلٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ شَعْرُ رَسُولِ اللَّهِ صلى الله عليه وسلم فَوْقَ الْوَفْرَةِ وَدُونَ الْجُمَّةِ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "حسن صحيح",
        "ourHadithNumber": 29,
        "matchingEnglishURN": 841750,
        "last_updated": null
    },
    {
        "arabicURN": 941910,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "10.00",
        "hadithNumber": "4188",
        "bookName": " كتاب الترجل ",
        "babName": " باب مَا جَاءَ فِي الْفَرْقِ ",
        "hadithText": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، أَخْبَرَنِي ابْنُ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ أَهْلُ الْكِتَابِ - يَعْنِي - يَسْدِلُونَ أَشْعَارَهُمْ وَكَانَ الْمُشْرِكُونَ يَفْرُقُونَ رُءُوسَهُمْ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم تُعْجِبُهُ مُوَافَقَةُ أَهْلِ الْكِتَابِ فِيمَا لَمْ يُؤْمَرْ بِهِ فَسَدَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم نَاصِيَتَهُ ثُمَّ فَرَقَ بَعْدُ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 30,
        "matchingEnglishURN": 841760,
        "last_updated": null
    },
    {
        "arabicURN": 941920,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "10.00",
        "hadithNumber": "4189",
        "bookName": " كتاب الترجل ",
        "babName": " باب مَا جَاءَ فِي الْفَرْقِ ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ مُحَمَّدٍ، - يَعْنِي ابْنَ إِسْحَاقَ - قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرِ بْنِ الزُّبَيْرِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، رضى الله عنها قَالَتْ كُنْتُ إِذَا أَرَدْتُ أَنْ أَفْرِقَ رَأْسَ رَسُولِ اللَّهِ صلى الله عليه وسلم صَدَعْتُ الْفَرْقَ مِنْ يَافُوخِهِ وَأُرْسِلُ نَاصِيَتَهُ بَيْنَ عَيْنَيْهِ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "حسن",
        "ourHadithNumber": 31,
        "matchingEnglishURN": 841770,
        "last_updated": null
    },
    {
        "arabicURN": 941930,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "11.00",
        "hadithNumber": "4190",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي تَطْوِيلِ الْجُمَّةِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، وَسُفْيَانُ بْنُ عُقْبَةَ السُّوَائِيُّ، - هُوَ أَخُو قَبِيصَةَ - وَحُمَيْدُ بْنُ خُوَارٍ عَنْ سُفْيَانَ الثَّوْرِيِّ، عَنْ عَاصِمِ بْنِ كُلَيْبٍ، عَنْ أَبِيهِ، عَنْ وَائِلِ بْنِ حُجْرٍ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم وَلِي شَعْرٌ طَوِيلٌ فَلَمَّا رَآنِي رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ ذُبَابٌ ذُبَابٌ ‏\"‏ ‏.‏ قَالَ فَرَجَعْتُ فَجَزَزْتُهُ ثُمَّ أَتَيْتُهُ مِنَ الْغَدِ فَقَالَ ‏\"‏ إِنِّي لَمْ أَعْنِكَ وَهَذَا أَحْسَنُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 32,
        "matchingEnglishURN": 841780,
        "last_updated": null
    },
    {
        "arabicURN": 941940,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "12.00",
        "hadithNumber": "4191",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي الرَّجُلِ يَعْقِصُ شَعْرَهُ ",
        "hadithText": "حَدَّثَنَا النُّفَيْلِيُّ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، قَالَ قَالَتْ أُمُّ هَانِئٍ قَدِمَ النَّبِيُّ صلى الله عليه وسلم إِلَى مَكَّةَ وَلَهُ أَرْبَعُ غَدَائِرَ تَعْنِي عَقَائِصَ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 33,
        "matchingEnglishURN": 841790,
        "last_updated": null
    },
    {
        "arabicURN": 941950,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "13.00",
        "hadithNumber": "4192",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي حَلْقِ الرَّأْسِ ",
        "hadithText": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ، وَابْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي قَالَ، سَمِعْتُ مُحَمَّدَ بْنَ أَبِي يَعْقُوبَ، يُحَدِّثُ عَنِ الْحَسَنِ بْنِ سَعْدٍ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمْهَلَ آلَ جَعْفَرٍ ثَلاَثًا أَنْ يَأْتِيَهُمْ ثُمَّ أَتَاهُمْ فَقَالَ ‏\"‏ لاَ تَبْكُوا عَلَى أَخِي بَعْدَ الْيَوْمِ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ ادْعُوا لِي بَنِي أَخِي ‏\"‏ ‏.‏ فَجِيءَ بِنَا كَأَنَّا أَفْرُخٌ فَقَالَ ‏\"‏ ادْعُوا لِي الْحَلاَّقَ ‏\"‏ ‏.‏ فَأَمَرَهُ فَحَلَقَ رُءُوسَنَا ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 34,
        "matchingEnglishURN": 841800,
        "last_updated": null
    },
    {
        "arabicURN": 941960,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "14.00",
        "hadithNumber": "4193",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي الذُّؤَابَةِ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا عُثْمَانُ بْنُ عُثْمَانَ، - قَالَ أَحْمَدُ كَانَ رَجُلاً صَالِحًا - قَالَ أَخْبَرَنَا عُمَرُ بْنُ نَافِعٍ عَنْ أَبِيهِ عَنِ ابْنِ عُمَرَ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْقَزَعِ وَالْقَزَعُ أَنْ يُحْلَقَ رَأْسُ الصَّبِيِّ فَيُتْرَكَ بَعْضُ شَعْرِهِ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 35,
        "matchingEnglishURN": 841810,
        "last_updated": null
    },
    {
        "arabicURN": 941970,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "14.00",
        "hadithNumber": "4194",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي الذُّؤَابَةِ ",
        "hadithText": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الْقَزَعِ وَهُوَ أَنْ يُحْلَقَ رَأْسُ الصَّبِيِّ فَتُتْرَكَ لَهُ ذُؤَابَةٌ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 36,
        "matchingEnglishURN": 841820,
        "last_updated": null
    },
    {
        "arabicURN": 941980,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "14.00",
        "hadithNumber": "4195",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي الذُّؤَابَةِ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى صَبِيًّا قَدْ حُلِقَ بَعْضُ شَعْرِهِ وَتُرِكَ بَعْضُهُ فَنَهَاهُمْ عَنْ ذَلِكَ وَقَالَ ‏\"‏ احْلِقُوهُ كُلَّهُ أَوِ اتْرُكُوهُ كُلَّهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 37,
        "matchingEnglishURN": 841830,
        "last_updated": null
    },
    {
        "arabicURN": 941990,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "15.00",
        "hadithNumber": "4196",
        "bookName": " كتاب الترجل ",
        "babName": " باب مَا جَاءَ فِي الرُّخْصَةِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، عَنْ مَيْمُونِ بْنِ عَبْدِ اللَّهِ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَتْ لِي ذُؤَابَةٌ فَقَالَتْ لِي أُمِّي لاَ أَجُزُّهَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَمُدُّهَا وَيَأْخُذُ بِهَا ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "ضعيف الإسناد",
        "ourHadithNumber": 38,
        "matchingEnglishURN": 841840,
        "last_updated": null
    },
    {
        "arabicURN": 942000,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "15.00",
        "hadithNumber": "4197",
        "bookName": " كتاب الترجل ",
        "babName": " باب مَا جَاءَ فِي الرُّخْصَةِ ",
        "hadithText": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، حَدَّثَنَا الْحَجَّاجُ بْنُ حَسَّانَ، قَالَ دَخَلْنَا عَلَى أَنَسِ بْنِ مَالِكٍ فَحَدَّثَتْنِي أُخْتِي الْمُغِيرَةُ، قَالَتْ وَأَنْتَ يَوْمَئِذٍ غُلاَمٌ وَلَكَ قَرْنَانِ أَوْ قُصَّتَانِ فَمَسَحَ رَأْسَكَ وَبَرَّكَ عَلَيْكَ وَقَالَ ‏\"‏ احْلِقُوا هَذَيْنِ أَوْ قُصُّوهُمَا فَإِنَّ هَذَا زِيُّ الْيَهُودِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "ضعيف الإسناد",
        "ourHadithNumber": 39,
        "matchingEnglishURN": 841850,
        "last_updated": null
    },
    {
        "arabicURN": 942010,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "16.00",
        "hadithNumber": "4198",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي أَخْذِ الشَّارِبِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم ‏\"‏ الْفِطْرَةُ خَمْسٌ أَوْ خَمْسٌ مِنَ الْفِطْرَةِ الْخِتَانُ وَالاِسْتِحْدَادُ وَنَتْفُ الإِبْطِ وَتَقْلِيمُ الأَظْفَارِ وَقَصُّ الشَّارِبِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 40,
        "matchingEnglishURN": 841860,
        "last_updated": null
    },
    {
        "arabicURN": 942020,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "16.00",
        "hadithNumber": "4199",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي أَخْذِ الشَّارِبِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِإِحْفَاءِ الشَّوَارِبِ وَإِعْفَاءِ اللِّحَى ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 41,
        "matchingEnglishURN": 841870,
        "last_updated": null
    },
    {
        "arabicURN": 942030,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "16.00",
        "hadithNumber": "4200",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي أَخْذِ الشَّارِبِ ",
        "hadithText": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا صَدَقَةُ الدَّقِيقِيُّ، حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ وَقَّتَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم حَلْقَ الْعَانَةِ وَتَقْلِيمَ الأَظْفَارِ وَقَصَّ الشَّارِبِ وَنَتْفَ الإِبْطِ أَرْبَعِينَ يَوْمًا مَرَّةً ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ جَعْفَرُ بْنُ سُلَيْمَانَ عَنْ أَبِي عِمْرَانَ عَنْ أَنَسٍ لَمْ يَذْكُرِ النَّبِيَّ صلى الله عليه وسلم قَالَ وُقِّتَ لَنَا وَهَذَا أَصَحُّ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 42,
        "matchingEnglishURN": 841880,
        "last_updated": null
    },
    {
        "arabicURN": 942040,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "16.00",
        "hadithNumber": "4201",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي أَخْذِ الشَّارِبِ ",
        "hadithText": "حَدَّثَنَا ابْنُ نُفَيْلٍ، حَدَّثَنَا زُهَيْرٌ، قَرَأْتُ عَلَى عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ وَقَرَأَهُ عَبْدُ الْمَلِكِ عَلَى أَبِي الزُّبَيْرِ وَرَوَاهُ أَبُو الزُّبَيْرِ عَنْ جَابِرٍ، قَالَ كُنَّا نُعْفِي السِّبَالَ إِلاَّ فِي حَجٍّ أَوْ عُمْرَةٍ ‏.‏ قَالَ أَبُو دَاوُدَ الاِسْتِحْدَادُ حَلْقُ الْعَانَةِ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "ضعيف الإسناد",
        "ourHadithNumber": 43,
        "matchingEnglishURN": 841890,
        "last_updated": null
    },
    {
        "arabicURN": 942050,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "17.00",
        "hadithNumber": "4202",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي نَتْفِ الشَّيْبِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، ح وَحَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، - الْمَعْنَى - عَنِ ابْنِ عَجْلاَنَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَنْتِفُوا الشَّيْبَ مَا مِنْ مُسْلِمٍ يَشِيبُ شَيْبَةً فِي الإِسْلاَمِ ‏\"‏ ‏.‏ قَالَ عَنْ سُفْيَانَ ‏\"‏ إِلاَّ كَانَتْ لَهُ نُورًا يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ وَقَالَ فِي حَدِيثِ يَحْيَى ‏\"‏ إِلاَّ كَتَبَ اللَّهُ لَهُ بِهَا حَسَنَةً وَحَطَّ عَنْهُ بِهَا خَطِيئَةً ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "حسن صحيح",
        "ourHadithNumber": 44,
        "matchingEnglishURN": 841900,
        "last_updated": null
    },
    {
        "arabicURN": 942060,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "18.00",
        "hadithNumber": "4203",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي الْخِضَابِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، وَسُلَيْمَانَ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ الْيَهُودَ وَالنَّصَارَى لاَ يَصْبُغُونَ فَخَالِفُوهُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 45,
        "matchingEnglishURN": 841910,
        "last_updated": null
    },
    {
        "arabicURN": 942070,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "18.00",
        "hadithNumber": "4204",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي الْخِضَابِ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، وَأَحْمَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ أُتِيَ بِأَبِي قُحَافَةَ يَوْمَ فَتْحِ مَكَّةَ وَرَأْسُهُ وَلِحْيَتُهُ كَالثَّغَامَةِ بَيَاضًا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ غَيِّرُوا هَذَا بِشَىْءٍ وَاجْتَنِبُوا السَّوَادَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 46,
        "matchingEnglishURN": 841920,
        "last_updated": null
    },
    {
        "arabicURN": 942080,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "18.00",
        "hadithNumber": "4205",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي الْخِضَابِ ",
        "hadithText": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ سَعِيدٍ الْجُرَيْرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِي الأَسْوَدِ الدِّيلِيِّ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ أَحْسَنَ مَا غُيِّرَ بِهِ هَذَا الشَّيْبُ الْحِنَّاءُ وَالْكَتَمُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 47,
        "matchingEnglishURN": 841930,
        "last_updated": null
    },
    {
        "arabicURN": 942090,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "18.00",
        "hadithNumber": "4206",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي الْخِضَابِ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، - يَعْنِي ابْنَ إِيَادٍ - قَالَ حَدَّثَنَا إِيَادٌ، عَنْ أَبِي رِمْثَةَ، قَالَ انْطَلَقْتُ مَعَ أَبِي نَحْوَ النَّبِيِّ صلى الله عليه وسلم فَإِذَا هُوَ ذُو وَفْرَةٍ بِهَا رَدْعُ حِنَّاءَ وَعَلَيْهِ بُرْدَانِ أَخْضَرَانِ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 48,
        "matchingEnglishURN": 841940,
        "last_updated": null
    },
    {
        "arabicURN": 942100,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "18.00",
        "hadithNumber": "4207",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي الْخِضَابِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا ابْنُ إِدْرِيسَ، قَالَ سَمِعْتُ ابْنَ أَبْجَرَ، عَنْ إِيَادِ بْنِ لَقِيطٍ، عَنْ أَبِي رِمْثَةَ، فِي هَذَا الْخَبَرِ قَالَ فَقَالَ لَهُ أَبِي أَرِنِي هَذَا الَّذِي بِظَهْرِكَ فَإِنِّي رَجُلٌ طَبِيبٌ ‏.‏ قَالَ ‏\"‏ اللَّهُ الطَّبِيبُ بَلْ أَنْتَ رَجُلٌ رَفِيقٌ طَبِيبُهَا الَّذِي خَلَقَهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 49,
        "matchingEnglishURN": 841950,
        "last_updated": null
    },
    {
        "arabicURN": 942110,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "18.00",
        "hadithNumber": "4208",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي الْخِضَابِ ",
        "hadithText": "حَدَّثَنَا ابْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ إِيَادِ بْنِ لَقِيطٍ، عَنْ أَبِي رِمْثَةَ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم أَنَا وَأَبِي فَقَالَ لِرَجُلٍ أَوْ لأَبِيهِ ‏\"‏ مَنْ هَذَا ‏\"‏ ‏.‏ قَالَ ابْنِي ‏.‏ قَالَ ‏\"‏ لاَ تَجْنِي عَلَيْهِ ‏\"‏ ‏.‏ وَكَانَ قَدْ لَطَخَ لِحْيَتَهُ بِالْحِنَّاءِ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 50,
        "matchingEnglishURN": 841960,
        "last_updated": null
    },
    {
        "arabicURN": 942120,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "18.00",
        "hadithNumber": "4209",
        "bookName": " كتاب الترجل ",
        "babName": " باب فِي الْخِضَابِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّهُ سُئِلَ عَنْ خِضَابِ النَّبِيِّ، صلى الله عليه وسلم فَذَكَرَ أَنَّهُ لَمْ يَخْضِبْ وَلَكِنْ قَدْ خَضَبَ أَبُو بَكْرٍ وَعُمَرُ رَضِيَ اللَّهُ عَنْهُمَا ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح ق دون ذكر العمرين لكن م ذكر أبا بكر",
        "ourHadithNumber": 51,
        "matchingEnglishURN": 841970,
        "last_updated": null
    },
    {
        "arabicURN": 942130,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "19.00",
        "hadithNumber": "4210",
        "bookName": " كتاب الترجل ",
        "babName": " باب مَا جَاءَ فِي خِضَابِ الصُّفْرَةِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ مُطَرِّفٍ أَبُو سُفْيَانَ، حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ، حَدَّثَنَا ابْنُ أَبِي رَوَّادٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَلْبَسُ النِّعَالَ السِّبْتِيَّةَ وَيُصَفِّرُ لِحْيَتَهُ بِالْوَرْسِ وَالزَّعْفَرَانِ وَكَانَ ابْنُ عُمَرَ يَفْعَلُ ذَلِكَ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 52,
        "matchingEnglishURN": 841980,
        "last_updated": null
    },
    {
        "arabicURN": 942140,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "19.00",
        "hadithNumber": "4211",
        "bookName": " كتاب الترجل ",
        "babName": " باب مَا جَاءَ فِي خِضَابِ الصُّفْرَةِ ",
        "hadithText": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ، عَنْ حُمَيْدِ بْنِ وَهْبٍ، عَنِ ابْنِ طَاوُسٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَرَّ عَلَى النَّبِيِّ صلى الله عليه وسلم رَجُلٌ قَدْ خَضَبَ بِالْحِنَّاءِ فَقَالَ ‏\"‏ مَا أَحْسَنَ هَذَا ‏\"‏ ‏.‏ قَالَ فَمَرَّ آخَرُ قَدْ خَضَبَ بِالْحِنَّاءِ وَالْكَتَمِ فَقَالَ ‏\"‏ هَذَا أَحْسَنُ مِنْ هَذَا ‏\"‏ ‏.‏ قَالَ فَمَرَّ آخَرُ قَدْ خَضَبَ بِالصُّفْرَةِ فَقَالَ ‏\"‏ هَذَا أَحْسَنُ مِنْ هَذَا كُلِّهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "ضعيف",
        "ourHadithNumber": 53,
        "matchingEnglishURN": 841990,
        "last_updated": null
    },
    {
        "arabicURN": 942150,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "20.00",
        "hadithNumber": "4212",
        "bookName": " كتاب الترجل ",
        "babName": " باب مَا جَاءَ فِي خِضَابِ السَّوَادِ ",
        "hadithText": "حَدَّثَنَا أَبُو تَوْبَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَكُونُ قَوْمٌ يَخْضِبُونَ فِي آخِرِ الزَّمَانِ بِالسَّوَادِ كَحَوَاصِلِ الْحَمَامِ لاَ يَرِيحُونَ رَائِحَةَ الْجَنَّةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "صحيح",
        "ourHadithNumber": 54,
        "matchingEnglishURN": 842000,
        "last_updated": null
    },
    {
        "arabicURN": 942160,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "21.00",
        "hadithNumber": "4213",
        "bookName": " كتاب الترجل ",
        "babName": " باب مَا جَاءَ فِي الاِنْتِفَاعِ بِالْعَاجِ ",
        "hadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ جُحَادَةَ، عَنْ حُمَيْدٍ الشَّامِيِّ، عَنْ سُلَيْمَانَ الْمَنْبِهِيِّ، عَنْ ثَوْبَانَ، مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا سَافَرَ كَانَ آخِرُ عَهْدِهِ بِإِنْسَانٍ مِنْ أَهْلِهِ فَاطِمَةَ وَأَوَّلُ مَنْ يَدْخُلُ عَلَيْهَا إِذَا قَدِمَ فَاطِمَةَ فَقَدِمَ مِنْ غَزَاةٍ لَهُ وَقَدْ عَلَّقَتْ مِسْحًا أَوْ سِتْرًا عَلَى بَابِهَا وَحَلَّتِ الْحَسَنَ وَالْحُسَيْنَ قُلْبَيْنِ مِنْ فِضَّةٍ فَقَدِمَ فَلَمْ يَدْخُلْ فَظَنَّتْ أَنَّ مَا مَنَعَهُ أَنْ يَدْخُلَ مَا رَأَى فَهَتَكَتِ السِّتْرَ وَفَكَّكَتِ الْقُلْبَيْنِ عَنِ الصَّبِيَّيْنِ وَقَطَعَتْهُ بَيْنَهُمَا فَانْطَلَقَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُمَا يَبْكِيَانِ فَأَخَذَهُ مِنْهُمَا وَقَالَ ‏\"‏ يَا ثَوْبَانُ اذْهَبْ بِهَذَا إِلَى آلِ فُلاَنٍ ‏\"‏ ‏.‏ أَهْلِ بَيْتٍ بِالْمَدِينَةِ ‏\"‏ إِنَّ هَؤُلاَءِ أَهْلُ بَيْتِي أَكْرَهُ أَنْ يَأْكُلُوا طَيِّبَاتِهِمْ فِي حَيَاتِهِمُ الدُّنْيَا يَا ثَوْبَانُ اشْتَرِ لِفَاطِمَةَ قِلاَدَةً مِنْ عَصَبٍ وَسِوَارَيْنِ مِنْ عَاجٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": "ضعيف الإسناد منكر",
        "ourHadithNumber": 55,
        "matchingEnglishURN": 842010,
        "last_updated": null
    }
]