[
    {
        "arabicURN": 1113720,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "1.00",
        "hadithNumber": "1367",
        "bookName": " كتاب الجمعة",
        "babName": " باب إِيجَابِ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، وَابْنُ، طَاوُسٍ عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَحْنُ الآخِرُونَ السَّابِقُونَ بَيْدَ أَنَّهُمْ أُوتُوا الْكِتَابَ مِنْ قَبْلِنَا وَأُوتِينَاهُ مِنْ بَعْدِهِمْ وَهَذَا الْيَوْمُ الَّذِي كَتَبَ اللَّهُ عَزَّ وَجَلَّ عَلَيْهِمْ فَاخْتَلَفُوا فِيهِ فَهَدَانَا اللَّهُ عَزَّ وَجَلَّ لَهُ - يَعْنِي يَوْمَ الْجُمُعَةِ - فَالنَّاسُ لَنَا فِيهِ تَبَعٌ الْيَهُودُ غَدًا وَالنَّصَارَى بَعْدَ غَدٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 1,
        "matchingEnglishURN": 1064920,
        "last_updated": null
    },
    {
        "arabicURN": 1113730,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "1.00",
        "hadithNumber": "1368",
        "bookName": " كتاب الجمعة",
        "babName": " باب إِيجَابِ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا وَاصِلُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ أَبِي مَالِكٍ الأَشْجَعِيِّ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، وَعَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ حُذَيْفَةَ، قَالاَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَضَلَّ اللَّهُ عَزَّ وَجَلَّ عَنِ الْجُمُعَةِ مَنْ كَانَ قَبْلَنَا فَكَانَ لِلْيَهُودِ يَوْمُ السَّبْتِ وَكَانَ لِلنَّصَارَى يَوْمُ الأَحَدِ فَجَاءَ اللَّهُ عَزَّ وَجَلَّ بِنَا فَهَدَانَا لِيَوْمِ الْجُمُعَةِ فَجَعَلَ الْجُمُعَةَ وَالسَّبْتَ وَالأَحَدَ وَكَذَلِكَ هُمْ لَنَا تَبَعٌ يَوْمَ الْقِيَامَةِ وَنَحْنُ الآخِرُونَ مِنْ أَهْلِ الدُّنْيَا وَالأَوَّلُونَ يَوْمَ الْقِيَامَةِ الْمَقْضِيُّ لَهُمْ قَبْلَ الْخَلاَئِقِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 2,
        "matchingEnglishURN": 1064930,
        "last_updated": null
    },
    {
        "arabicURN": 1113740,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "1.00",
        "hadithNumber": "1368",
        "bookName": " كتاب الجمعة",
        "babName": " باب إِيجَابِ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَمَّارٍ، قَالَ حَدَّثَنَا الْمُعَافَى، عَنْ إِبْرَاهِيمَ بْنِ طَهْمَانَ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ إِنَّ أَوَّلَ جُمُعَةٍ جُمِعَتْ بَعْدَ جُمُعَةٍ جُمِعَتْ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمَكَّةَ جُمُعَةٌ بِجُوَاثَا بِالْبَحْرَيْنِ قَرْيَةٌ لِعَبْدِ الْقَيْسِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 3,
        "matchingEnglishURN": 1064940,
        "last_updated": null
    },
    {
        "arabicURN": 1113750,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "2.00",
        "hadithNumber": "1369",
        "bookName": " كتاب الجمعة",
        "babName": " باب التَّشْدِيدِ فِي التَّخَلُّفِ عَنِ الْجُمُعَةِ،  ",
        "hadithText": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ عَبِيدَةَ بْنِ سُفْيَانَ الْحَضْرَمِيِّ، عَنْ أَبِي الْجَعْدِ الضَّمْرِيِّ، وَكَانَتْ، لَهُ صُحْبَةٌ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ تَرَكَ ثَلاَثَ جُمَعٍ تَهَاوُنًا بِهَا طَبَعَ اللَّهُ عَلَى قَلْبِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 4,
        "matchingEnglishURN": 1064950,
        "last_updated": null
    },
    {
        "arabicURN": 1113760,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "2.00",
        "hadithNumber": "1369",
        "bookName": " كتاب الجمعة",
        "babName": " باب التَّشْدِيدِ فِي التَّخَلُّفِ عَنِ الْجُمُعَةِ،  ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادٍ، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ أَنْبَأَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ أَسِيدِ بْنِ أَبِي أَسِيدٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، - رضى الله عنه - أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ تَرَكَ الْجُمُعَةَ ثَلاَثًا مِنْ غَيْرِ ضَرُورَةٍ طَبَعَ اللَّهُ عَلَى قَلْبِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 5,
        "matchingEnglishURN": 1064960,
        "last_updated": null
    },
    {
        "arabicURN": 1113770,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "2.00",
        "hadithNumber": "1370",
        "bookName": " كتاب الجمعة",
        "babName": " باب التَّشْدِيدِ فِي التَّخَلُّفِ عَنِ الْجُمُعَةِ،  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، قَالَ حَدَّثَنَا حَبَّانُ، قَالَ حَدَّثَنَا أَبَانُ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنِ الْحَضْرَمِيِّ بْنِ لاَحِقٍ، عَنْ زَيْدٍ، عَنْ أَبِي سَلاَّمٍ، عَنِ الْحَكَمِ بْنِ مِينَاءَ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ، وَابْنَ، عُمَرَ يُحَدِّثَانِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ وَهُوَ عَلَى أَعْوَادِ مِنْبَرِهِ ‏\"‏ لَيَنْتَهِيَنَّ أَقْوَامٌ عَنْ وَدْعِهِمُ الْجُمُعَاتِ أَوْ لَيَخْتِمَنَّ اللَّهُ عَلَى قُلُوبِهِمْ وَلَيَكُونَنَّ مِنَ الْغَافِلِينَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 6,
        "matchingEnglishURN": 1064970,
        "last_updated": null
    },
    {
        "arabicURN": 1113780,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "2.00",
        "hadithNumber": "1371",
        "bookName": " كتاب الجمعة",
        "babName": " باب التَّشْدِيدِ فِي التَّخَلُّفِ عَنِ الْجُمُعَةِ،  ",
        "hadithText": "أَخْبَرَنِي مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، قَالَ حَدَّثَنِي الْمُفَضَّلُ بْنُ فَضَالَةَ، عَنْ عَيَّاشِ بْنِ عَبَّاسٍ، عَنْ بُكَيْرِ بْنِ الأَشَجِّ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ حَفْصَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ رَوَاحُ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 7,
        "matchingEnglishURN": 1064980,
        "last_updated": null
    },
    {
        "arabicURN": 1113790,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "3.00",
        "hadithNumber": "1372",
        "bookName": " كتاب الجمعة",
        "babName": " باب كَفَّارَةِ مَنْ تَرَكَ الْجُمُعَةَ مِنْ غَيْرِ عُذْرٍ  ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالَ حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ قُدَامَةَ بْنِ وَبَرَةَ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ تَرَكَ الْجُمُعَةَ مِنْ غَيْرِ عُذْرٍ فَلْيَتَصَدَّقْ بِدِينَارٍ فَإِنْ لَمْ يَجِدْ فَبِنِصْفِ دِينَارٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 8,
        "matchingEnglishURN": 1064990,
        "last_updated": null
    },
    {
        "arabicURN": 1113800,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "3.00",
        "hadithNumber": "1372",
        "bookName": " كتاب الجمعة",
        "babName": " باب كَفَّارَةِ مَنْ تَرَكَ الْجُمُعَةَ مِنْ غَيْرِ عُذْرٍ  ",
        "hadithText": "أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ، قَالَ أَنْبَأَنَا نُوحٌ، عَنْ خَالِدٍ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، - رضى الله عنه - عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ تَرَكَ الْجُمُعَةَ مُتَعَمِّدًا فَعَلَيْهِ دِينَارٌ فَإِنْ لَمْ يَجِدْ فَبِنِصْفِ دِينَارٍ ‏\"‏ ‏.‏ وَفِي مَوْضِعٍ آخَرَ لَيْسَ فِيهِ مُتَعَمِّدًا ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 9,
        "matchingEnglishURN": 1065000,
        "last_updated": null
    },
    {
        "arabicURN": 1113810,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "4.00",
        "hadithNumber": "1373",
        "bookName": " كتاب الجمعة",
        "babName": " باب ذِكْرِ فَضْلِ يَوْمِ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ الأَعْرَجُ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خَيْرُ يَوْمٍ طَلَعَتْ فِيهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ عَلَيْهِ السَّلاَمُ وَفِيهِ أُدْخِلَ الْجَنَّةَ وَفِيهِ أُخْرِجَ مِنْهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 10,
        "matchingEnglishURN": 1065010,
        "last_updated": null
    },
    {
        "arabicURN": 1113820,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "5.00",
        "hadithNumber": "1374",
        "bookName": " كتاب الجمعة",
        "babName": " باب إِكْثَارِ الصَّلاَةِ عَلَى النَّبِيِّ صلى الله عليه وسلم يَوْمَ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ، عَنْ أَبِي الأَشْعَثِ الصَّنْعَانِيِّ، عَنْ أَوْسِ بْنِ أَوْسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ مِنْ أَفْضَلِ أَيَّامِكُمْ يَوْمَ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ عَلَيْهِ السَّلاَمُ وَفِيهِ قُبِضَ وَفِيهِ النَّفْخَةُ وَفِيهِ الصَّعْقَةُ فَأَكْثِرُوا عَلَىَّ مِنَ الصَّلاَةِ فَإِنَّ صَلاَتَكُمْ مَعْرُوضَةٌ عَلَىَّ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَكَيْفَ تُعْرَضُ صَلاَتُنَا عَلَيْكَ وَقَدْ أَرَمْتَ أَىْ يَقُولُونَ قَدْ بَلِيتَ ‏.‏ قَالَ ‏\"‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ قَدْ حَرَّمَ عَلَى الأَرْضِ أَنْ تَأْكُلَ أَجْسَادَ الأَنْبِيَاءِ عَلَيْهِمُ السَّلاَمُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 11,
        "matchingEnglishURN": 1065020,
        "last_updated": null
    },
    {
        "arabicURN": 1113830,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "6.00",
        "hadithNumber": "1375",
        "bookName": " كتاب الجمعة",
        "babName": " باب الأَمْرِ بِالسِّوَاكِ يَوْمَ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، أَنَّ سَعِيدَ بْنَ أَبِي هِلاَلٍ، وَبُكَيْرَ بْنَ الأَشَجِّ، حَدَّثَاهُ عَنْ أَبِي بَكْرِ بْنِ الْمُنْكَدِرِ، عَنْ عَمْرِو بْنِ سُلَيْمٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الْغُسْلُ يَوْمَ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ وَالسِّوَاكُ وَيَمَسُّ مِنَ الطِّيبِ مَا قَدَرَ عَلَيْهِ ‏\"‏ ‏.‏ إِلاَّ أَنَّ بُكَيْرًا لَمْ يَذْكُرْ عَبْدَ الرَّحْمَنِ وَقَالَ فِي الطِّيبِ ‏\"‏ وَلَوْ مِنْ طِيبِ الْمَرْأَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 12,
        "matchingEnglishURN": 1065030,
        "last_updated": null
    },
    {
        "arabicURN": 1113840,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "7.00",
        "hadithNumber": "1376",
        "bookName": " كتاب الجمعة",
        "babName": " باب الأَمْرِ بِالْغُسْلِ يَوْمَ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا جَاءَ أَحَدُكُمُ الْجُمُعَةَ فَلْيَغْتَسِلْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 13,
        "matchingEnglishURN": 1065040,
        "last_updated": null
    },
    {
        "arabicURN": 1113850,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "8.00",
        "hadithNumber": "1377",
        "bookName": " كتاب الجمعة",
        "babName": " باب إِيجَابِ الْغُسْلِ يَوْمَ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ غُسْلُ يَوْمِ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 14,
        "matchingEnglishURN": 1065050,
        "last_updated": null
    },
    {
        "arabicURN": 1113860,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "8.00",
        "hadithNumber": "1378",
        "bookName": " كتاب الجمعة",
        "babName": " باب إِيجَابِ الْغُسْلِ يَوْمَ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، قَالَ حَدَّثَنَا بِشْرٌ، قَالَ حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ عَلَى كُلِّ رَجُلٍ مُسْلِمٍ فِي كُلِّ سَبْعَةِ أَيَّامٍ غُسْلُ يَوْمٍ وَهُوَ يَوْمُ الْجُمُعَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 15,
        "matchingEnglishURN": 1065060,
        "last_updated": null
    },
    {
        "arabicURN": 1113870,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "9.00",
        "hadithNumber": "1379",
        "bookName": " كتاب الجمعة",
        "babName": " باب الرُّخْصَةِ فِي تَرْكِ الْغُسْلِ يَوْمَ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ، عَنِ الْوَلِيدِ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْعَلاَءِ، أَنَّهُ سَمِعَ الْقَاسِمَ بْنَ مُحَمَّدِ بْنِ أَبِي بَكْرٍ، أَنَّهُمْ ذَكَرُوا غُسْلَ يَوْمِ الْجُمُعَةِ عِنْدَ عَائِشَةَ فَقَالَتْ إِنَّمَا كَانَ النَّاسُ يَسْكُنُونَ الْعَالِيَةَ فَيَحْضُرُونَ الْجُمُعَةَ وَبِهِمْ وَسَخٌ فَإِذَا أَصَابَهُمُ الرَّوْحُ سَطَعَتْ أَرْوَاحُهُمْ فَيَتَأَذَّى بِهَا النَّاسُ فَذُكِرَ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَوَلاَ يَغْتَسِلُونَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 16,
        "matchingEnglishURN": 1065070,
        "last_updated": null
    },
    {
        "arabicURN": 1113880,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "9.00",
        "hadithNumber": "1380",
        "bookName": " كتاب الجمعة",
        "babName": " باب الرُّخْصَةِ فِي تَرْكِ الْغُسْلِ يَوْمَ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا أَبُو الأَشْعَثِ، عَنْ يَزِيدَ بْنِ زُرَيْعٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ تَوَضَّأَ يَوْمَ الْجُمُعَةِ فَبِهَا وَنِعْمَتْ وَمَنِ اغْتَسَلَ فَالْغُسْلُ أَفْضَلُ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ الْحَسَنُ عَنْ سَمُرَةَ كِتَابًا وَلَمْ يَسْمَعِ الْحَسَنُ مِنْ سَمُرَةَ إِلاَّ حَدِيثَ الْعَقِيقَةِ وَاللَّهُ تَعَالَى أَعْلَمُ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 17,
        "matchingEnglishURN": 1065080,
        "last_updated": null
    },
    {
        "arabicURN": 1113890,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "10.00",
        "hadithNumber": "1381",
        "bookName": " كتاب الجمعة",
        "babName": " باب فَضْلِ غُسْلِ يَوْمِ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، وَهَارُونُ بْنُ مُحَمَّدِ بْنِ بَكَّارِ بْنِ بِلاَلٍ، - وَاللَّفْظُ لَهُ - قَالاَ حَدَّثَنَا أَبُو مُسْهِرٍ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ، عَنْ يَحْيَى بْنِ الْحَارِثِ، عَنْ أَبِي الأَشْعَثِ الصَّنْعَانِيِّ، عَنْ أَوْسِ بْنِ أَوْسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ غَسَّلَ وَاغْتَسَلَ وَغَدَا وَابْتَكَرَ وَدَنَا مِنَ الإِمَامِ وَلَمْ يَلْغُ كَانَ لَهُ بِكُلِّ خُطْوَةٍ عَمَلُ سَنَةٍ صِيَامُهَا وَقِيَامُهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 18,
        "matchingEnglishURN": 1065090,
        "last_updated": null
    },
    {
        "arabicURN": 1113900,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "11.00",
        "hadithNumber": "1382",
        "bookName": " كتاب الجمعة",
        "babName": " باب الْهَيْئَةِ لِلْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، رَأَى حُلَّةً فَقَالَ يَا رَسُولَ اللَّهِ لَوِ اشْتَرَيْتَ هَذِهِ فَلَبِسْتَهَا يَوْمَ الْجُمُعَةِ وَلِلْوَفْدِ إِذَا قَدِمُوا عَلَيْكَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا يَلْبَسُ هَذِهِ مَنْ لاَ خَلاَقَ لَهُ فِي الآخِرَةِ ‏\"‏ ‏.‏ ثُمَّ جَاءَ رَسُولَ اللَّهِ صلى الله عليه وسلم مِثْلُهَا فَأَعْطَى عُمَرَ مِنْهَا حُلَّةً فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ كَسَوْتَنِيهَا وَقَدْ قُلْتَ فِي حُلَّةِ عُطَارِدٍ مَا قُلْتَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَمْ أَكْسُكَهَا لِتَلْبَسَهَا ‏\"‏ ‏.‏ فَكَسَاهَا عُمَرُ أَخًا لَهُ مُشْرِكًا بِمَكَّةَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 19,
        "matchingEnglishURN": 1065100,
        "last_updated": null
    },
    {
        "arabicURN": 1113910,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "11.00",
        "hadithNumber": "1383",
        "bookName": " كتاب الجمعة",
        "babName": " باب الْهَيْئَةِ لِلْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا الْحَسَنُ بْنُ سَوَّارٍ، قَالَ حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ سَعِيدٍ، عَنْ أَبِي بَكْرِ بْنِ الْمُنْكَدِرِ، أَنَّ عَمْرَو بْنَ سُلَيْمٍ، أَخْبَرَهُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ الْغُسْلَ يَوْمَ الْجُمُعَةِ عَلَى كُلِّ مُحْتَلِمٍ وَالسِّوَاكَ وَأَنْ يَمَسَّ مِنَ الطِّيبِ مَا يَقْدِرُ عَلَيْهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 20,
        "matchingEnglishURN": 1065110,
        "last_updated": null
    },
    {
        "arabicURN": 1113920,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "12.00",
        "hadithNumber": "1384",
        "bookName": " كتاب الجمعة",
        "babName": " باب فَضْلِ الْمَشْىِ إِلَى الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرٍ، قَالَ حَدَّثَنَا الْوَلِيدُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ، أَنَّهُ سَمِعَ أَبَا الأَشْعَثِ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَوْسَ بْنَ أَوْسٍ، صَاحِبَ رَسُولِ اللَّهِ صلى الله عليه وسلم يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنِ اغْتَسَلَ يَوْمَ الْجُمُعَةِ وَغَسَّلَ وَغَدَا وَابْتَكَرَ وَمَشَى وَلَمْ يَرْكَبْ وَدَنَا مِنَ الإِمَامِ وَأَنْصَتَ وَلَمْ يَلْغُ كَانَ لَهُ بِكُلِّ خُطْوَةٍ عَمَلُ سَنَةٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 21,
        "matchingEnglishURN": 1065120,
        "last_updated": null
    },
    {
        "arabicURN": 1113930,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "13.00",
        "hadithNumber": "1385",
        "bookName": " كتاب الجمعة",
        "babName": " باب التَّبْكِيرِ إِلَى الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا نَصْرُ بْنُ عَلِيِّ بْنِ نَصْرٍ، عَنْ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ الأَغَرِّ أَبِي عَبْدِ اللَّهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا كَانَ يَوْمُ الْجُمُعَةِ قَعَدَتِ الْمَلاَئِكَةُ عَلَى أَبْوَابِ الْمَسْجِدِ فَكَتَبُوا مَنْ جَاءَ إِلَى الْجُمُعَةِ فَإِذَا خَرَجَ الإِمَامُ طَوَتِ الْمَلاَئِكَةُ الصُّحُفَ ‏\"‏ ‏.‏ قَالَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْمُهَجِّرُ إِلَى الْجُمُعَةِ كَالْمُهْدِي بَدَنَةً ثُمَّ كَالْمُهْدِي بَقَرَةً ثُمَّ كَالْمُهْدِي شَاةً ثُمَّ كَالْمُهْدِي بَطَّةً ثُمَّ كَالْمُهْدِي دَجَاجَةً ثُمَّ كَالْمُهْدِي بَيْضَةً ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 22,
        "matchingEnglishURN": 1065130,
        "last_updated": null
    },
    {
        "arabicURN": 1113940,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "13.00",
        "hadithNumber": "1386",
        "bookName": " كتاب الجمعة",
        "babName": " باب التَّبْكِيرِ إِلَى الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم ‏\"‏ إِذَا كَانَ يَوْمُ الْجُمُعَةِ كَانَ عَلَى كُلِّ بَابٍ مِنْ أَبْوَابِ الْمَسْجِدِ مَلاَئِكَةٌ يَكْتُبُونَ النَّاسَ عَلَى مَنَازِلِهِمُ الأَوَّلَ فَالأَوَّلَ فَإِذَا خَرَجَ الإِمَامُ طُوِيَتِ الصُّحُفُ وَاسْتَمَعُوا الْخُطْبَةَ فَالْمُهَجِّرُ إِلَى الصَّلاَةِ كَالْمُهْدِي بَدَنَةً ثُمَّ الَّذِي يَلِيهِ كَالْمُهْدِي بَقَرَةً ثُمَّ الَّذِي يَلِيهِ كَالْمُهْدِي كَبْشًا ‏\"‏ ‏.‏ حَتَّى ذَكَرَ الدَّجَاجَةَ وَالْبَيْضَةَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 23,
        "matchingEnglishURN": 1065140,
        "last_updated": null
    },
    {
        "arabicURN": 1113950,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "13.00",
        "hadithNumber": "1387",
        "bookName": " كتاب الجمعة",
        "babName": " باب التَّبْكِيرِ إِلَى الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ، قَالَ أَنْبَأَنَا اللَّيْثُ، عَنِ ابْنِ عَجْلاَنَ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ تَقْعُدُ الْمَلاَئِكَةُ يَوْمَ الْجُمُعَةِ عَلَى أَبْوَابِ الْمَسْجِدِ يَكْتُبُونَ النَّاسَ عَلَى مَنَازِلِهِمْ فَالنَّاسُ فِيهِ كَرَجُلٍ قَدَّمَ بَدَنَةً وَكَرَجُلٍ قَدَّمَ بَقَرَةً وَكَرَجُلٍ قَدَّمَ شَاةً وَكَرَجُلٍ قَدَّمَ دَجَاجَةً وَكَرَجُلٍ قَدَّمَ عُصْفُورًا وَكَرَجُلٍ قَدَّمَ بَيْضَةً ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 24,
        "matchingEnglishURN": 1065150,
        "last_updated": null
    },
    {
        "arabicURN": 1113960,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "14.00",
        "hadithNumber": "1388",
        "bookName": " كتاب الجمعة",
        "babName": " باب وَقْتِ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنِ اغْتَسَلَ يَوْمَ الْجُمُعَةِ غُسْلَ الْجَنَابَةِ ثُمَّ رَاحَ فَكَأَنَّمَا قَرَّبَ بَدَنَةً وَمَنْ رَاحَ فِي السَّاعَةِ الثَّانِيَةِ فَكَأَنَّمَا قَرَّبَ بَقَرَةً وَمَنْ رَاحَ فِي السَّاعَةِ الثَّالِثَةِ فَكَأَنَّمَا قَرَّبَ كَبْشًا وَمَنْ رَاحَ فِي السَّاعَةِ الرَّابِعَةِ فَكَأَنَّمَا قَرَّبَ دَجَاجَةً وَمَنْ رَاحَ فِي السَّاعَةِ الْخَامِسَةِ فَكَأَنَّمَا قَرَّبَ بَيْضَةً فَإِذَا خَرَجَ الإِمَامُ حَضَرَتِ الْمَلاَئِكَةُ يَسْتَمِعُونَ الذِّكْرَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 25,
        "matchingEnglishURN": 1065160,
        "last_updated": null
    },
    {
        "arabicURN": 1113970,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "14.00",
        "hadithNumber": "1389",
        "bookName": " كتاب الجمعة",
        "babName": " باب وَقْتِ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادِ بْنِ الأَسْوَدِ بْنِ عَمْرٍو، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - عَنِ ابْنِ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنِ الْجُلاَحِ، مَوْلَى عَبْدِ الْعَزِيزِ أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، حَدَّثَهُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ يَوْمُ الْجُمُعَةِ اثْنَتَا عَشْرَةَ سَاعَةً لاَ يُوجَدُ فِيهَا عَبْدٌ مُسْلِمٌ يَسْأَلُ اللَّهَ شَيْئًا إِلاَّ آتَاهُ إِيَّاهُ فَالْتَمِسُوهَا آخِرَ سَاعَةٍ بَعْدَ الْعَصْرِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 26,
        "matchingEnglishURN": 1065170,
        "last_updated": null
    },
    {
        "arabicURN": 1113980,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "14.00",
        "hadithNumber": "1390",
        "bookName": " كتاب الجمعة",
        "babName": " باب وَقْتِ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي يَحْيَى بْنُ آدَمَ، قَالَ حَدَّثَنَا حَسَنُ بْنُ عَيَّاشٍ، قَالَ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم الْجُمُعَةَ ثُمَّ نَرْجِعُ فَنُرِيحُ نَوَاضِحَنَا ‏.‏ قُلْتُ أَيَّةَ سَاعَةٍ قَالَ زَوَالُ الشَّمْسِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 27,
        "matchingEnglishURN": 1065180,
        "last_updated": null
    },
    {
        "arabicURN": 1113990,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "14.00",
        "hadithNumber": "1391",
        "bookName": " كتاب الجمعة",
        "babName": " باب وَقْتِ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ، قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ، عَنْ يَعْلَى بْنِ الْحَارِثِ، قَالَ سَمِعْتُ إِيَاسَ بْنَ سَلَمَةَ بْنِ الأَكْوَعِ، يُحَدِّثُ عَنْ أَبِيهِ، قَالَ كُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم الْجُمُعَةَ ثُمَّ نَرْجِعُ وَلَيْسَ لِلْحِيطَانِ فَىْءٌ يُسْتَظَلُّ بِهِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 28,
        "matchingEnglishURN": 1065190,
        "last_updated": null
    },
    {
        "arabicURN": 1114000,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "15.00",
        "hadithNumber": "1392",
        "bookName": " كتاب الجمعة",
        "babName": " باب الأَذَانِ لِلْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي السَّائِبُ بْنُ يَزِيدَ، أَنَّ الأَذَانَ، كَانَ أَوَّلُ حِينَ يَجْلِسُ الإِمَامُ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةَ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبِي بَكْرٍ وَعُمَرَ فَلَمَّا كَانَ فِي خِلاَفَةِ عُثْمَانَ وَكَثُرَ النَّاسُ أَمَرَ عُثْمَانُ يَوْمَ الْجُمُعَةِ بِالأَذَانِ الثَّالِثِ فَأُذِّنَ بِهِ عَلَى الزَّوْرَاءِ فَثَبَتَ الأَمْرُ عَلَى ذَلِكَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 29,
        "matchingEnglishURN": 1065200,
        "last_updated": null
    },
    {
        "arabicURN": 1114010,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "15.00",
        "hadithNumber": "1393",
        "bookName": " كتاب الجمعة",
        "babName": " باب الأَذَانِ لِلْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا يَعْقُوبُ، قَالَ حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ السَّائِبَ بْنَ يَزِيدَ، أَخْبَرَهُ قَالَ إِنَّمَا أَمَرَ بِالتَّأْذِينِ الثَّالِثِ عُثْمَانُ حِينَ كَثُرَ أَهْلُ الْمَدِينَةِ وَلَمْ يَكُنْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم غَيْرُ مُؤَذِّنٍ وَاحِدٍ وَكَانَ التَّأْذِينُ يَوْمَ الْجُمُعَةِ حِينَ يَجْلِسُ الإِمَامُ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 30,
        "matchingEnglishURN": 1065210,
        "last_updated": null
    },
    {
        "arabicURN": 1114020,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "15.00",
        "hadithNumber": "1394",
        "bookName": " كتاب الجمعة",
        "babName": " باب الأَذَانِ لِلْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا الْمُعْتَمِرُ، عَنْ أَبِيهِ، عَنِ الزُّهْرِيِّ، عَنِ السَّائِبِ بْنِ يَزِيدَ، قَالَ كَانَ بِلاَلٌ يُؤَذِّنُ إِذَا جَلَسَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ فَإِذَا نَزَلَ أَقَامَ ثُمَّ كَانَ كَذَلِكَ فِي زَمَنِ أَبِي بَكْرٍ وَعُمَرَ رضى الله عنهما ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 31,
        "matchingEnglishURN": 1065220,
        "last_updated": null
    },
    {
        "arabicURN": 1114030,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "16.00",
        "hadithNumber": "1395",
        "bookName": " كتاب الجمعة",
        "babName": " باب الصَّلاَةِ يَوْمَ الْجُمُعَةِ لِمَنْ جَاءَ وَقَدْ خَرَجَ الإِمَامُ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ دِينَارٍ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا جَاءَ أَحَدُكُمْ وَقَدْ خَرَجَ الإِمَامُ فَلْيُصَلِّ رَكْعَتَيْنِ ‏\"‏ ‏.‏ قَالَ شُعْبَةُ يَوْمَ الْجُمُعَةِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 32,
        "matchingEnglishURN": 1065230,
        "last_updated": null
    },
    {
        "arabicURN": 1114040,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "17.00",
        "hadithNumber": "1396",
        "bookName": " كتاب الجمعة",
        "babName": " باب مَقَامِ الإِمَامِ فِي الْخُطْبَةِ  ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادِ بْنِ الأَسْوَدِ، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ، أَنَّ أَبَا الزُّبَيْرِ، أَخْبَرَهُ أَنَّهُ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا خَطَبَ يَسْتَنِدُ إِلَى جِذْعِ نَخْلَةٍ مِنْ سَوَارِي الْمَسْجِدِ فَلَمَّا صُنِعَ الْمِنْبَرُ وَاسْتَوَى عَلَيْهِ اضْطَرَبَتْ تِلْكَ السَّارِيَةُ كَحَنِينِ النَّاقَةِ حَتَّى سَمِعَهَا أَهْلُ الْمَسْجِدِ حَتَّى نَزَلَ إِلَيْهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَاعْتَنَقَهَا فَسَكَتَتْ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 33,
        "matchingEnglishURN": 1065240,
        "last_updated": null
    },
    {
        "arabicURN": 1114050,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "18.00",
        "hadithNumber": "1397",
        "bookName": " كتاب الجمعة",
        "babName": " باب قِيَامِ الإِمَامِ فِي الْخُطْبَةِ  ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ أَبِي عُبَيْدَةَ، عَنْ كَعْبِ بْنِ عُجْرَةَ، قَالَ دَخَلَ الْمَسْجِدَ وَعَبْدُ الرَّحْمَنِ بْنُ أُمِّ الْحَكَمِ يَخْطُبُ قَاعِدًا فَقَالَ انْظُرُوا إِلَى هَذَا يَخْطُبُ قَاعِدًا وَقَدْ قَالَ اللَّهُ عَزَّ وَجَلَّ ‏<A id=\"q1\" name=\"q1\" href=\"javascript:openquran(61,11,11)\"><c_q1>{‏ وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا ‏}</c_q1></a>‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 34,
        "matchingEnglishURN": 1065250,
        "last_updated": null
    },
    {
        "arabicURN": 1114060,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "19.00",
        "hadithNumber": "1398",
        "bookName": " كتاب الجمعة",
        "babName": " باب الْفَضْلِ فِي الدُّنُوِّ مِنَ الإِمَامِ  ",
        "hadithText": "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ، قَالَ حَدَّثَنِي عُمَرُ بْنُ عَبْدِ الْوَاحِدِ، قَالَ سَمِعْتُ يَحْيَى بْنَ الْحَارِثِ، يُحَدِّثُ عَنْ أَبِي الأَشْعَثِ الصَّنْعَانِيِّ، عَنْ أَوْسِ بْنِ أَوْسٍ الثَّقَفِيِّ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ غَسَّلَ وَاغْتَسَلَ وَابْتَكَرَ وَغَدَا وَدَنَا مِنَ الإِمَامِ وَأَنْصَتَ ثُمَّ لَمْ يَلْغُ كَانَ لَهُ بِكُلِّ خُطْوَةٍ كَأَجْرِ سَنَةٍ صِيَامِهَا وَقِيَامِهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 35,
        "matchingEnglishURN": 1065260,
        "last_updated": null
    },
    {
        "arabicURN": 1114070,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "20.00",
        "hadithNumber": "1399",
        "bookName": " كتاب الجمعة",
        "babName": " باب النَّهْىِ عَنْ تَخَطِّي، رِقَابِ النَّاسِ وَالإِمَامُ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا وَهْبُ بْنُ بَيَانٍ، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ صَالِحٍ، عَنْ أَبِي الزَّاهِرِيَّةِ، عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ، قَالَ كُنْتُ جَالِسًا إِلَى جَانِبِهِ يَوْمَ الْجُمُعَةِ فَقَالَ جَاءَ رَجُلٌ يَتَخَطَّى رِقَابَ النَّاسِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَىِ اجْلِسْ فَقَدْ آذَيْتَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 36,
        "matchingEnglishURN": 1065270,
        "last_updated": null
    },
    {
        "arabicURN": 1114080,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "21.00",
        "hadithNumber": "1400",
        "bookName": " كتاب الجمعة",
        "babName": " باب الصَّلاَةِ يَوْمَ الْجُمُعَةِ لِمَنْ جَاءَ وَالإِمَامُ يَخْطُبُ  ",
        "hadithText": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ، وَيُوسُفُ بْنُ سَعِيدٍ، - وَاللَّفْظُ لَهُ - قَالاَ حَدَّثَنَا حَجَّاجٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ جَاءَ رَجُلٌ وَالنَّبِيُّ صلى الله عليه وسلم عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ فَقَالَ لَهُ ‏\"‏ أَرَكَعْتَ رَكْعَتَيْنِ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَارْكَعْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 37,
        "matchingEnglishURN": 1065280,
        "last_updated": null
    },
    {
        "arabicURN": 1114090,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "22.00",
        "hadithNumber": "1401",
        "bookName": " كتاب الجمعة",
        "babName": " باب الإِنْصَاتِ لِلْخُطْبَةِ يَوْمَ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ قَالَ لِصَاحِبِهِ يَوْمَ الْجُمُعَةِ وَالإِمَامُ يَخْطُبُ أَنْصِتْ فَقَدْ لَغَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 38,
        "matchingEnglishURN": 1065290,
        "last_updated": null
    },
    {
        "arabicURN": 1114100,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "22.00",
        "hadithNumber": "1402",
        "bookName": " كتاب الجمعة",
        "babName": " باب الإِنْصَاتِ لِلْخُطْبَةِ يَوْمَ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ جَدِّي، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، عَنْ عَبْدِ اللَّهِ بْنِ إِبْرَاهِيمَ بْنِ قَارِظٍ، وَعَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُمَا حَدَّثَاهُ أَنَّ أَبَا هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِذَا قُلْتَ لِصَاحِبِكَ أَنْصِتْ يَوْمَ الْجُمُعَةِ وَالإِمَامُ يَخْطُبُ فَقَدْ لَغَوْتَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 39,
        "matchingEnglishURN": 1065300,
        "last_updated": null
    },
    {
        "arabicURN": 1114110,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "23.00",
        "hadithNumber": "1403",
        "bookName": " كتاب الجمعة",
        "babName": " باب فَضْلِ الإِنْصَاتِ وَتَرْكِ اللَّغْوِ يَوْمَ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي مَعْشَرٍ، زِيَادِ بْنِ كُلَيْبٍ عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنِ الْقَرْثَعِ الضَّبِّيِّ، - وَكَانَ مِنَ الْقُرَّاءِ الأَوَّلِينَ - عَنْ سَلْمَانَ، قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْ رَجُلٍ يَتَطَهَّرُ يَوْمَ الْجُمُعَةِ كَمَا أُمِرَ ثُمَّ يَخْرُجُ مِنْ بَيْتِهِ حَتَّى يَأْتِيَ الْجُمُعَةَ وَيُنْصِتُ حَتَّى يَقْضِيَ صَلاَتَهُ إِلاَّ كَانَ كَفَّارَةً لِمَا قَبْلَهُ مِنَ الْجُمُعَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 40,
        "matchingEnglishURN": 1065310,
        "last_updated": null
    },
    {
        "arabicURN": 1114120,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "24.00",
        "hadithNumber": "1404",
        "bookName": " كتاب الجمعة",
        "babName": " باب كَيْفِيَّةِ الْخُطْبَةِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ أَبَا إِسْحَاقَ، يُحَدِّثُ عَنْ أَبِي عُبَيْدَةَ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ عَلَّمَنَا خُطْبَةَ الْحَاجَةِ الْحَمْدُ لِلَّهِ نَسْتَعِينُهُ وَنَسْتَغْفِرُهُ وَنَعُوذُ بِاللَّهِ مِنْ شُرُورِ أَنْفُسِنَا وَسَيِّئَاتِ أَعْمَالِنَا مَنْ يَهْدِهِ اللَّهُ فَلاَ مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلاَ هَادِيَ لَهُ وَأَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ ثُمَّ يَقْرَأُ ثَلاَثَ آيَاتٍ ‏<A id=\"q2\" name=\"q2\" href=\"javascript:openquran(2,102,102)\"><c_q2>{‏ يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلاَ تَمُوتُنَّ إِلاَّ وَأَنْتُمْ مُسْلِمُونَ ‏}</c_q2></a>‏ ‏<A id=\"q3\" name=\"q3\" href=\"javascript:openquran(3,1,1)\"><c_q3>{‏ يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ وَخَلَقَ مِنْهَا زَوْجَهَا وَبَثَّ مِنْهُمَا رِجَالاً كَثِيرًا وَنِسَاءً وَاتَّقُوا اللَّهَ الَّذِي تَسَاءَلُونَ بِهِ وَالأَرْحَامَ إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا ‏}</c_q3></a>‏ ‏<A id=\"q4\" name=\"q4\" href=\"javascript:openquran(32,70,70)\"><c_q4>{‏ يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَقُولُوا قَوْلاً سَدِيدًا ‏}</c_q4></a>‏ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ أَبُو عُبَيْدَةَ لَمْ يَسْمَعْ مِنْ أَبِيهِ شَيْئًا وَلاَ عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ وَلاَ عَبْدُ الْجَبَّارِ بْنُ وَائِلِ بْنِ حُجْرٍ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 41,
        "matchingEnglishURN": 1065320,
        "last_updated": null
    },
    {
        "arabicURN": 1114130,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "25.00",
        "hadithNumber": "1405",
        "bookName": " كتاب الجمعة",
        "babName": " باب حَضِّ الإِمَامِ فِي خُطْبَتِهِ عَلَى الْغُسْلِ يَوْمَ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ خَطَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ إِذَا رَاحَ أَحَدُكُمْ إِلَى الْجُمُعَةِ فَلْيَغْتَسِلْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 42,
        "matchingEnglishURN": 1065330,
        "last_updated": null
    },
    {
        "arabicURN": 1114140,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "25.00",
        "hadithNumber": "1406",
        "bookName": " كتاب الجمعة",
        "babName": " باب حَضِّ الإِمَامِ فِي خُطْبَتِهِ عَلَى الْغُسْلِ يَوْمَ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ إِبْرَاهِيمَ بْنِ نَشِيطٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنِ الْغُسْلِ، يَوْمَ الْجُمُعَةِ فَقَالَ سُنَّةٌ وَقَدْ حَدَّثَنِي بِهِ، سَالِمُ بْنُ عَبْدِ اللَّهِ عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم تَكَلَّمَ بِهَا عَلَى الْمِنْبَرِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 43,
        "matchingEnglishURN": 1065340,
        "last_updated": null
    },
    {
        "arabicURN": 1114150,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "25.00",
        "hadithNumber": "1407",
        "bookName": " كتاب الجمعة",
        "babName": " باب حَضِّ الإِمَامِ فِي خُطْبَتِهِ عَلَى الْغُسْلِ يَوْمَ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ وَهُوَ قَائِمٌ عَلَى الْمِنْبَرِ ‏\"‏ مَنْ جَاءَ مِنْكُمُ الْجُمُعَةَ فَلْيَغْتَسِلْ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ مَا أَعْلَمُ أَحَدًا تَابَعَ اللَّيْثَ عَلَى هَذَا الإِسْنَادِ غَيْرَ ابْنِ جُرَيْجٍ وَأَصْحَابُ الزُّهْرِيِّ يَقُولُونَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ بَدَلَ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 44,
        "matchingEnglishURN": 1065350,
        "last_updated": null
    },
    {
        "arabicURN": 1114160,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "26.00",
        "hadithNumber": "1408",
        "bookName": " كتاب الجمعة",
        "babName": " باب حَثِّ الإِمَامِ عَلَى الصَّدَقَةِ يَوْمَ الْجُمُعَةِ فِي خُطْبَتِهِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ عَجْلاَنَ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ جَاءَ رَجُلٌ يَوْمَ الْجُمُعَةِ وَالنَّبِيُّ صلى الله عليه وسلم يَخْطُبُ بِهَيْئَةٍ بَذَّةٍ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَصَلَّيْتَ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ صَلِّ رَكْعَتَيْنِ ‏\"‏ ‏.‏ وَحَثَّ النَّاسَ عَلَى الصَّدَقَةِ فَأَلْقُوا ثِيَابًا فَأَعْطَاهُ مِنْهَا ثَوْبَيْنِ فَلَمَّا كَانَتِ الْجُمُعَةُ الثَّانِيَةُ جَاءَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَخْطُبُ فَحَثَّ النَّاسَ عَلَى الصَّدَقَةِ - قَالَ - فَأَلْقَى أَحَدَ ثَوْبَيْهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ جَاءَ هَذَا يَوْمَ الْجُمُعَةِ بِهَيْئَةٍ بَذَّةٍ فَأَمَرْتُ النَّاسَ بِالصَّدَقَةِ فَأَلْقَوا ثِيَابًا فَأَمَرْتُ لَهُ مِنْهَا بِثَوْبَيْنِ ثُمَّ جَاءَ الآنَ فَأَمَرْتُ النَّاسَ بِالصَّدَقَةِ فَأَلْقَى أَحَدَهُمَا ‏\"‏ ‏.‏ فَانَتْهَرَهُ وَقَالَ ‏\"‏ خُذْ ثَوْبَكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 45,
        "matchingEnglishURN": 1065360,
        "last_updated": null
    },
    {
        "arabicURN": 1114170,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "27.00",
        "hadithNumber": "1409",
        "bookName": " كتاب الجمعة",
        "babName": " باب مُخَاطَبَةِ الإِمَامِ رَعِيَّتَهُ وَهُوَ عَلَى الْمِنْبَرِ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ بَيْنَا النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ يَوْمَ الْجُمُعَةِ إِذْ جَاءَ رَجُلٌ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ صَلَّيْتَ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ قُمْ فَارْكَعْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 46,
        "matchingEnglishURN": 1065370,
        "last_updated": null
    },
    {
        "arabicURN": 1114180,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "27.00",
        "hadithNumber": "1410",
        "bookName": " كتاب الجمعة",
        "babName": " باب مُخَاطَبَةِ الإِمَامِ رَعِيَّتَهُ وَهُوَ عَلَى الْمِنْبَرِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا أَبُو مُوسَى، إِسْرَائِيلُ بْنُ مُوسَى قَالَ سَمِعْتُ الْحَسَنَ، يَقُولُ سَمِعْتُ أَبَا بَكْرَةَ، يَقُولُ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى الْمِنْبَرِ وَالْحَسَنُ مَعَهُ وَهُوَ يُقْبِلُ عَلَى النَّاسِ مَرَّةً وَعَلَيْهِ مَرَّةً وَيَقُولُ ‏\"‏ إِنَّ ابْنِي هَذَا سَيِّدٌ وَلَعَلَّ اللَّهَ أَنْ يُصْلِحَ بِهِ بَيْنَ فِئَتَيْنِ مِنَ الْمُسْلِمِينَ عَظِيمَتَيْنِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 47,
        "matchingEnglishURN": 1065380,
        "last_updated": null
    },
    {
        "arabicURN": 1114190,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "28.00",
        "hadithNumber": "1411",
        "bookName": " كتاب الجمعة",
        "babName": " باب الْقِرَاءَةِ فِي الْخُطْبَةِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا هَارُونُ بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا عَلِيٌّ، - وَهُوَ ابْنُ الْمُبَارَكِ - عَنْ يَحْيَى، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنِ ابْنَةِ حَارِثَةَ بْنِ النُّعْمَانِ، قَالَتْ حَفِظْتُ ‏<A id=\"q5\" name=\"q5\" href=\"javascript:openquran(49,1,1)\"><c_q5>{‏ ق وَالْقُرْآنِ الْمَجِيدِ ‏}</c_q5></a>‏ مِنْ فِي رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 48,
        "matchingEnglishURN": 1065390,
        "last_updated": null
    },
    {
        "arabicURN": 1114200,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "29.00",
        "hadithNumber": "1412",
        "bookName": " كتاب الجمعة",
        "babName": " باب الإِشَارَةِ فِي الْخُطْبَةِ  ",
        "hadithText": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ حُصَيْنٍ، أَنَّ بِشْرَ بْنَ مَرْوَانَ، رَفَعَ يَدَيْهِ يَوْمَ الْجُمُعَةِ عَلَى الْمِنْبَرِ فَسَبَّهُ عُمَارَةُ بْنُ رُوَيْبَةَ الثَّقَفِيُّ وَقَالَ مَا زَادَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى هَذَا وَأَشَارَ بِأُصْبُعِهِ السَّبَّابَةِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 49,
        "matchingEnglishURN": 1065400,
        "last_updated": null
    },
    {
        "arabicURN": 1114210,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "30.00",
        "hadithNumber": "1413",
        "bookName": " كتاب الجمعة",
        "babName": " باب نُزُولِ الإِمَامِ عَنِ الْمِنْبَرِ، قَبْلَ فَرَاغِهِ مِنَ الْخُطْبَةِ وَقَطْعِهِ كَلاَمَهُ وَرُجُوعِهِ إِلَيْهِ يَوْمَ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ، قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ حُسَيْنِ بْنِ وَاقِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ فَجَاءَ الْحَسَنُ وَالْحُسَيْنُ - رضى الله عنهما - وَعَلَيْهِمَا قَمِيصَانِ أَحْمَرَانِ يَعْثُرَانِ فِيهِمَا فَنَزَلَ النَّبِيُّ صلى الله عليه وسلم فَقَطَعَ كَلاَمَهُ فَحَمَلَهُمَا ثُمَّ عَادَ إِلَى الْمِنْبَرِ ثُمَّ قَالَ ‏\"‏ صَدَقَ اللَّهُ ‏<A id=\"q6\" name=\"q6\" href=\"javascript:openquran(7,28,28)\"><c_q6>{‏ إِنَّمَا أَمْوَالُكُمْ وَأَوْلاَدُكُمْ فِتْنَةٌ ‏}</c_q6></a>‏ رَأَيْتُ هَذَيْنِ يَعْثُرَانِ فِي قَمِيصَيْهِمَا فَلَمْ أَصْبِرْ حَتَّى قَطَعْتُ كَلاَمِي فَحَمَلْتُهُمَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 50,
        "matchingEnglishURN": 1065410,
        "last_updated": null
    },
    {
        "arabicURN": 1114220,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "31.00",
        "hadithNumber": "1414",
        "bookName": " كتاب الجمعة",
        "babName": " باب مَا يُسْتَحَبُّ مِنْ تَقْصِيرِ الْخُطْبَةِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ غَزْوَانَ، قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى، عَنِ الْحُسَيْنِ بْنِ وَاقِدٍ، قَالَ حَدَّثَنِي يَحْيَى بْنُ عُقَيْلٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُكْثِرُ الذِّكْرَ وَيُقِلُّ اللَّغْوَ وَيُطِيلُ الصَّلاَةَ وَيُقَصِّرُ الْخُطْبَةَ وَلاَ يَأْنَفُ أَنْ يَمْشِيَ مَعَ الأَرْمَلَةِ وَالْمِسْكِينِ فَيَقْضِيَ لَهُ الْحَاجَةَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 51,
        "matchingEnglishURN": 1065420,
        "last_updated": null
    },
    {
        "arabicURN": 1114230,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "32.00",
        "hadithNumber": "1415",
        "bookName": " كتاب الجمعة",
        "babName": " باب كَمْ يَخْطُبُ  ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا شَرِيكٌ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ جَالَسْتُ النَّبِيَّ صلى الله عليه وسلم فَمَا رَأَيْتُهُ يَخْطُبُ إِلاَّ قَائِمًا وَيَجْلِسُ ثُمَّ يَقُومُ فَيَخْطُبُ الْخُطْبَةَ الآخِرَةَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 52,
        "matchingEnglishURN": 1065430,
        "last_updated": null
    },
    {
        "arabicURN": 1114240,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "33.00",
        "hadithNumber": "1416",
        "bookName": " كتاب الجمعة",
        "babName": " باب الْفَصْلِ بَيْنَ الْخُطْبَتَيْنِ بِالْجُلُوسِ  ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَخْطُبُ الْخُطْبَتَيْنِ وَهُوَ قَائِمٌ وَكَانَ يَفْصِلُ بَيْنَهُمَا بِجُلُوسٍ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 53,
        "matchingEnglishURN": 1065440,
        "last_updated": null
    },
    {
        "arabicURN": 1114250,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "34.00",
        "hadithNumber": "1417",
        "bookName": " كتاب الجمعة",
        "babName": " باب السُّكُوتِ فِي الْقَعْدَةِ بَيْنَ الْخُطْبَتَيْنِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ، قَالَ حَدَّثَنَا يَزِيدُ، - يَعْنِي ابْنَ زُرَيْعٍ - قَالَ حَدَّثَنَا إِسْرَائِيلُ، قَالَ حَدَّثَنَا سِمَاكٌ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَخْطُبُ يَوْمَ الْجُمُعَةِ قَائِمًا ثُمَّ يَقْعُدُ قِعْدَةً لاَ يَتَكَلَّمُ ثُمَّ يَقُومُ فَيَخْطُبُ خُطْبَةً أُخْرَى فَمَنْ حَدَّثَكُمْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَخْطُبُ قَاعِدًا فَقَدْ كَذَبَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 54,
        "matchingEnglishURN": 1065450,
        "last_updated": null
    },
    {
        "arabicURN": 1114260,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "35.00",
        "hadithNumber": "1418",
        "bookName": " كتاب الجمعة",
        "babName": " باب الْقِرَاءَةِ فِي الْخُطْبَةِ الثَّانِيَةِ وَالذِّكْرِ فِيهَا  ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، عَنْ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ قَائِمًا ثُمَّ يَجْلِسُ ثُمَّ يَقُومُ وَيَقْرَأُ آيَاتٍ وَيَذْكُرُ اللَّهَ عَزَّ وَجَلَّ وَكَانَتْ خُطْبَتُهُ قَصْدًا وَصَلاَتُهُ قَصْدًا ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 55,
        "matchingEnglishURN": 1065460,
        "last_updated": null
    },
    {
        "arabicURN": 1114270,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "36.00",
        "hadithNumber": "1419",
        "bookName": " كتاب الجمعة",
        "babName": " باب الْكَلاَمِ وَالْقِيَامِ بَعْدَ النُّزُولِ عَنِ الْمِنْبَرِ،  ",
        "hadithText": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَلِيِّ بْنِ مَيْمُونٍ، قَالَ حَدَّثَنَا الْفِرْيَابِيُّ، قَالَ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَنْزِلُ عَنِ الْمِنْبَرِ فَيَعْرِضُ لَهُ الرَّجُلُ فَيُكَلِّمُهُ فَيَقُومُ مَعَهُ النَّبِيُّ صلى الله عليه وسلم حَتَّى يَقْضِيَ حَاجَتَهُ ثُمَّ يَتَقَدَّمُ إِلَى مُصَلاَّهُ فَيُصَلِّي ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 56,
        "matchingEnglishURN": 1065470,
        "last_updated": null
    },
    {
        "arabicURN": 1114280,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "37.00",
        "hadithNumber": "1420",
        "bookName": " كتاب الجمعة",
        "babName": " باب عَدَدِ صَلاَةِ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا شَرِيكٌ، عَنْ زُبَيْدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، قَالَ قَالَ عُمَرُ صَلاَةُ الْجُمُعَةِ رَكْعَتَانِ وَصَلاَةُ الْفِطْرِ رَكْعَتَانِ وَصَلاَةُ الأَضْحَى رَكْعَتَانِ وَصَلاَةُ السَّفَرِ رَكْعَتَانِ تَمَامٌ غَيْرُ قَصْرٍ عَلَى لِسَانِ مُحَمَّدٍ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ عَبْدُ الرَّحْمَنِ بْنُ أَبِي لَيْلَى لَمْ يَسْمَعْ مِنْ عُمَرَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 57,
        "matchingEnglishURN": 1065480,
        "last_updated": null
    },
    {
        "arabicURN": 1114290,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "38.00",
        "hadithNumber": "1421",
        "bookName": " كتاب الجمعة",
        "babName": " باب الْقِرَاءَةِ فِي صَلاَةِ الْجُمُعَةِ بِسُورَةِ الْجُمُعَةِ وَالْمُنَافِقِينَ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى الصَّنْعَانِيُّ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي مُخَوَّلٌ، قَالَ سَمِعْتُ مُسْلِمًا الْبَطِينَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقْرَأُ يَوْمَ الْجُمُعَةِ فِي صَلاَةِ الصُّبْحِ ‏<A id=\"q1\" name=\"q1\" href=\"javascript:openquran(31,1,1)\"><c_q1>{‏ الم * تَنْزِيلُ ‏}</c_q1></a>‏ وَ‏<A id=\"q2\" name=\"q2\" href=\"javascript:openquran(75,1,1)\"><c_q2>{‏ هَلْ أَتَى عَلَى الإِنْسَانِ ‏}</c_q2></a>‏ وَفِي صَلاَةِ الْجُمُعَةِ بِسُورَةِ الْجُمُعَةِ وَالْمُنَافِقِينَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 58,
        "matchingEnglishURN": 1065490,
        "last_updated": null
    },
    {
        "arabicURN": 1114300,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "39.00",
        "hadithNumber": "1422",
        "bookName": " كتاب الجمعة",
        "babName": " باب الْقِرَاءَةِ فِي صَلاَةِ الْجُمُعَةِ بِـ ‏<A id=\"q3\" name=\"q3\" href=\"javascript:openquran(86,1,1)\"><c_q3>{‏ سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى ‏}</c_q3></a>‏ وَ‏<A id=\"q4\" name=\"q4\" href=\"javascript:openquran(87,1,1)\"><c_q4>{‏ هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ ‏}</c_q4></a>‏  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ شُعْبَةَ، قَالَ أَخْبَرَنِي مَعْبَدُ بْنُ خَالِدٍ، عَنْ زَيْدِ بْنِ عُقْبَةَ، عَنْ سَمُرَةَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْرَأُ فِي صَلاَةِ الْجُمُعَةِ بِـ ‏<A id=\"q5\" name=\"q5\" href=\"javascript:openquran(86,1,1)\"><c_q5>{‏ سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى ‏}</c_q5></a>‏ وَ<A id=\"q6\" name=\"q6\" href=\"javascript:openquran(87,1,1)\"><c_q6>{‏ هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ ‏}</c_q6></a>‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 59,
        "matchingEnglishURN": 1065500,
        "last_updated": null
    },
    {
        "arabicURN": 1114310,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "40.00",
        "hadithNumber": "1423",
        "bookName": " كتاب الجمعة",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى النُّعْمَانِ بْنِ بَشِيرٍ فِي الْقِرَاءَةِ فِي صَلاَةِ الْجُمُعَةِ ‏ ‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ ضَمْرَةَ بْنِ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، أَنَّ الضَّحَّاكَ بْنَ قَيْسٍ، سَأَلَ النُّعْمَانَ بْنَ بَشِيرٍ مَاذَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْرَأُ يَوْمَ الْجُمُعَةِ عَلَى إِثْرِ سُورَةِ الْجُمُعَةِ قَالَ كَانَ يَقْرَأُ ‏<A id=\"q7\" name=\"q7\" href=\"javascript:openquran(87,1,1)\"><c_q7>{‏ هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ ‏}</c_q7></a>‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 60,
        "matchingEnglishURN": 1065510,
        "last_updated": null
    },
    {
        "arabicURN": 1114320,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "40.00",
        "hadithNumber": "1424",
        "bookName": " كتاب الجمعة",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى النُّعْمَانِ بْنِ بَشِيرٍ فِي الْقِرَاءَةِ فِي صَلاَةِ الْجُمُعَةِ ‏ ‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ شُعْبَةَ، أَنَّ إِبْرَاهِيمَ بْنَ مُحَمَّدِ بْنِ الْمُنْتَشِرِ، أَخْبَرَهُ قَالَ سَمِعْتُ أَبِي يُحَدِّثُ، عَنْ حَبِيبِ بْنِ سَالِمٍ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْرَأُ فِي الْجُمُعَةِ بِـ ‏<A id=\"q8\" name=\"q8\" href=\"javascript:openquran(86,1,1)\"><c_q8>{‏ سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى ‏}</c_q8></a>‏ وَ‏<A id=\"q9\" name=\"q9\" href=\"javascript:openquran(87,1,1)\"><c_q9>{‏ هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ ‏}</c_q9></a>‏ وَرُبَّمَا اجْتَمَعَ الْعِيدُ وَالْجُمُعَةُ فَيَقْرَأُ بِهِمَا فِيهِمَا جَمِيعًا ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 61,
        "matchingEnglishURN": 1065520,
        "last_updated": null
    },
    {
        "arabicURN": 1114330,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "41.00",
        "hadithNumber": "1425",
        "bookName": " كتاب الجمعة",
        "babName": " باب مَنْ أَدْرَكَ رَكْعَةً مِنْ صَلاَةِ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، وَمُحَمَّدُ بْنُ مَنْصُورٍ، - وَاللَّفْظُ لَهُ - عَنْ سُفْيَانَ، عَنِ الْزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ أَدْرَكَ مِنْ صَلاَةِ الْجُمُعَةِ رَكْعَةً فَقَدْ أَدْرَكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 62,
        "matchingEnglishURN": 1065530,
        "last_updated": null
    },
    {
        "arabicURN": 1114340,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "42.00",
        "hadithNumber": "1426",
        "bookName": " كتاب الجمعة",
        "babName": " باب عَدَدِ الصَّلاَةِ بَعْدَ الْجُمُعَةِ فِي الْمَسْجِدِ  ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا صَلَّى أَحَدُكُمُ الْجُمُعَةَ فَلْيُصَلِّ بَعْدَهَا أَرْبَعًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 63,
        "matchingEnglishURN": 1065540,
        "last_updated": null
    },
    {
        "arabicURN": 1114350,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "43.00",
        "hadithNumber": "1427",
        "bookName": " كتاب الجمعة",
        "babName": " باب صَلاَةِ الإِمَامِ بَعْدَ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ لاَ يُصَلِّي بَعْدَ الْجُمُعَةِ حَتَّى يَنْصَرِفَ فَيُصَلِّيَ رَكْعَتَيْنِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 64,
        "matchingEnglishURN": 1065550,
        "last_updated": null
    },
    {
        "arabicURN": 1114360,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "43.00",
        "hadithNumber": "1428",
        "bookName": " كتاب الجمعة",
        "babName": " باب صَلاَةِ الإِمَامِ بَعْدَ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ فِي بَيْتِهِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 65,
        "matchingEnglishURN": 1065560,
        "last_updated": null
    },
    {
        "arabicURN": 1114370,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "44.00",
        "hadithNumber": "1429",
        "bookName": " كتاب الجمعة",
        "babName": " باب إِطَالَةِ الرَّكْعَتَيْنِ بَعْدَ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ، عَنْ يَزِيدَ، - وَهُوَ ابْنُ هَارُونَ - قَالَ أَنْبَأَنَا شُعْبَةُ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ كَانَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ يُطِيلُ فِيهِمَا وَيَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَفْعَلُهُ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 66,
        "matchingEnglishURN": 1065570,
        "last_updated": null
    },
    {
        "arabicURN": 1114380,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "45.00",
        "hadithNumber": "1430",
        "bookName": " كتاب الجمعة",
        "babName": " باب ذِكْرِ السَّاعَةِ الَّتِي يُسْتَجَابُ فِيهَا الدُّعَاءُ يَوْمَ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا بَكْرٌ، - يَعْنِي ابْنَ مُضَرَ - عَنِ ابْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أَتَيْتُ الطُّورَ فَوَجَدْتُ ثَمَّ كَعْبًا فَمَكَثْتُ أَنَا وَهُوَ يَوْمًا أُحَدِّثُهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَيُحَدِّثُنِي عَنِ التَّوْرَاةِ فَقُلْتُ لَهُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خَيْرُ يَوْمٍ طَلَعَتْ فِيهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُهْبِطَ وَفِيهِ تِيبَ عَلَيْهِ وَفِيهِ قُبِضَ وَفِيهِ تَقُومُ السَّاعَةُ مَا عَلَى الأَرْضِ مِنْ دَابَّةٍ إِلاَّ وَهِيَ تُصْبِحُ يَوْمَ الْجُمُعَةِ مُصِيخَةً حَتَّى تَطْلُعَ الشَّمْسُ شَفَقًا مِنَ السَّاعَةِ إِلاَّ ابْنَ آدَمَ وَفِيهِ سَاعَةٌ لاَ يُصَادِفُهَا مُؤْمِنٌ وَهُوَ فِي الصَّلاَةِ يَسْأَلُ اللَّهَ فِيهَا شَيْئًا إِلاَّ أَعْطَاهُ إِيَّاهُ ‏\"‏ ‏.‏ فَقَالَ كَعْبٌ ذَلِكَ يَوْمٌ فِي كُلِّ سَنَةٍ ‏.‏ فَقُلْتُ بَلْ هِيَ فِي كُلِّ جُمُعَةٍ ‏.‏ فَقَرَأَ كَعْبٌ التَّوْرَاةَ ثُمَّ قَالَ صَدَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم هُوَ فِي كُلِّ جُمُعَةٍ ‏.‏ فَخَرَجْتُ فَلَقِيتُ بَصْرَةَ بْنَ أَبِي بَصْرَةَ الْغِفَارِيَّ فَقَالَ مِنْ أَيْنَ جِئْتَ قُلْتُ مِنَ الطُّورِ ‏.‏ قَالَ لَوْ لَقِيتُكَ مِنْ قَبْلِ أَنْ تَأْتِيَهُ لَمْ تَأْتِهِ ‏.‏ قُلْتُ لَهُ وَلِمَ قَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ تُعْمَلُ الْمَطِيُّ إِلاَّ إِلَى ثَلاَثَةِ مَسَاجِدَ الْمَسْجِدِ الْحَرَامِ وَمَسْجِدِي وَمَسْجِدِ بَيْتِ الْمَقْدِسِ ‏\"‏ ‏.‏ فَلَقِيتُ عَبْدَ اللَّهِ بْنَ سَلاَمٍ فَقُلْتُ لَوْ رَأَيْتَنِي خَرَجْتُ إِلَى الطُّورِ فَلَقِيتُ كَعْبًا فَمَكَثْتُ أَنَا وَهُوَ يَوْمًا أُحَدِّثُهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَيُحَدِّثُنِي عَنِ التَّوْرَاةِ فَقُلْتُ لَهُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خَيْرُ يَوْمٍ طَلَعَتْ فِيهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُهْبِطَ وَفِيهِ تِيبَ عَلَيْهِ وَفِيهِ قُبِضَ وَفِيهِ تَقُومُ السَّاعَةُ مَا عَلَى الأَرْضِ مِنْ دَابَّةٍ إِلاَّ وَهِيَ تُصْبِحُ يَوْمَ الْجُمُعَةِ مُصِيخَةً حَتَّى تَطْلُعَ الشَّمْسُ شَفَقًا مِنَ السَّاعَةِ إِلاَّ ابْنَ آدَمَ وَفِيهِ سَاعَةٌ لاَ يُصَادِفُهَا عَبْدٌ مُؤْمِنٌ وَهُوَ فِي الصَّلاَةِ يَسْأَلُ اللَّهَ شَيْئًا إِلاَّ أَعْطَاهُ إِيَّاهُ ‏\"‏ ‏.‏ قَالَ كَعْبٌ ذَلِكَ يَوْمٌ فِي كُلِّ سَنَةٍ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ كَذَبَ كَعْبٌ ‏.‏ قُلْتُ ثُمَّ قَرَأَ كَعْبٌ فَقَالَ صَدَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم هُوَ فِي كُلِّ جُمُعَةٍ ‏.‏ فَقَالَ عَبْدُ اللَّهِ صَدَقَ كَعْبٌ إِنِّي لأَعْلَمُ تِلْكَ السَّاعَةَ فَقُلْتُ يَا أَخِي حَدِّثْنِي بِهَا ‏.‏ قَالَ هِيَ آخِرُ سَاعَةٍ مِنْ يَوْمِ الْجُمُعَةِ قَبْلَ أَنْ تَغِيبَ الشَّمْسُ فَقُلْتُ أَلَيْسَ قَدْ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ يُصَادِفُهَا مُؤْمِنٌ وَهُوَ فِي الصَّلاَةِ ‏\"‏ ‏.‏ وَلَيْسَتْ تِلْكَ السَّاعَةَ صَلاَةٌ قَالَ أَلَيْسَ قَدْ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنْ صَلَّى وَجَلَسَ يَنْتَظِرُ الصَّلاَةَ لَمْ يَزَلْ فِي صَلاَتِهِ حَتَّى تَأْتِيَهُ الصَّلاَةُ الَّتِي تُلاَقِيهَا ‏\"‏ ‏.‏ قُلْتُ بَلَى ‏.‏ قَالَ فَهُوَ كَذَلِكَ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 67,
        "matchingEnglishURN": 1065580,
        "last_updated": null
    },
    {
        "arabicURN": 1114390,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "45.00",
        "hadithNumber": "1431",
        "bookName": " كتاب الجمعة",
        "babName": " باب ذِكْرِ السَّاعَةِ الَّتِي يُسْتَجَابُ فِيهَا الدُّعَاءُ يَوْمَ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ خَالِدٍ، عَنْ رَبَاحٍ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي سَعِيدٌ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ فِي الْجُمُعَةِ سَاعَةً لاَ يُوَافِقُهَا عَبْدٌ مُسْلِمٌ يَسْأَلُ اللَّهَ فِيهَا شَيْئًا إِلاَّ أَعْطَاهُ إِيَّاهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 68,
        "matchingEnglishURN": 1065590,
        "last_updated": null
    },
    {
        "arabicURN": 1114400,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 14,
        "babNumber": "45.00",
        "hadithNumber": "1432",
        "bookName": " كتاب الجمعة",
        "babName": " باب ذِكْرِ السَّاعَةِ الَّتِي يُسْتَجَابُ فِيهَا الدُّعَاءُ يَوْمَ الْجُمُعَةِ  ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ، قَالَ أَنْبَأَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ أَبُو الْقَاسِمِ صلى الله عليه وسلم ‏\"‏ إِنَّ فِي الْجُمُعَةِ سَاعَةً لاَ يُوَافِقُهَا عَبْدٌ مُسْلِمٌ قَائِمٌ يُصَلِّي يَسْأَلُ اللَّهَ عَزَّ وَجَلَّ شَيْئًا إِلاَّ أَعْطَاهُ إِيَّاهُ ‏\"‏ ‏.‏ قُلْنَا يُقَلِّلُهَا يُزَهِّدُهَا ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ لاَ نَعْلَمُ أَحَدًا حَدَّثَ بِهَذَا الْحَدِيثِ غَيْرَ رَبَاحٍ عَنْ مَعْمَرٍ عَنِ الزُّهْرِيِّ إِلاَّ أَيُّوبَ بْنَ سُوَيْدٍ فَإِنَّهُ حَدَّثَ بِهِ عَنْ يُونُسَ عَنِ الزُّهْرِيِّ عَنْ سَعِيدٍ وَأَبِي سَلَمَةَ وَأَيُّوبُ بْنُ سُوَيْدٍ مَتْرُوكُ الْحَدِيثِ ‏.‏",
        "annotations": null,
        "bookID": "14.0",
        "grade1": null,
        "ourHadithNumber": 69,
        "matchingEnglishURN": 1065600,
        "last_updated": null
    }
]