[
    {
        "arabicURN": 1118260,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "1.00",
        "hadithNumber": "1818",
        "bookName": " كتاب الجنائز",
        "babName": " باب تَمَنِّي الْمَوْتِ ‏ ",
        "hadithText": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مَعْنٌ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَتَمَنَّيَنَّ أَحَدٌ مِنْكُمُ الْمَوْتَ إِمَّا مُحْسِنًا فَلَعَلَّهُ أَنْ يَزْدَادَ خَيْرًا وَإِمَّا مُسِيئًا فَلَعَلَّهُ أَنْ يَسْتَعْتِبَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 1,
        "matchingEnglishURN": 1070000,
        "last_updated": null
    },
    {
        "arabicURN": 1118270,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "1.00",
        "hadithNumber": "1819",
        "bookName": " كتاب الجنائز",
        "babName": " باب تَمَنِّي الْمَوْتِ ‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ، قَالَ حَدَّثَنَا بَقِيَّةُ، قَالَ حَدَّثَنَا الزُّبَيْدِيُّ، قَالَ حَدَّثَنِي الزُّهْرِيُّ، عَنْ أَبِي عُبَيْدٍ، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يَتَمَنَّيَنَّ أَحَدُكُمُ الْمَوْتَ إِمَّا مُحْسِنًا فَلَعَلَّهُ أَنْ يَعِيشَ يَزْدَادُ خَيْرًا وَهُوَ خَيْرٌ لَهُ وَإِمَّا مُسِيئًا فَلَعَلَّهُ أَنْ يَسْتَعْتِبَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 2,
        "matchingEnglishURN": 1070010,
        "last_updated": null
    },
    {
        "arabicURN": 1118280,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "1.00",
        "hadithNumber": "1820",
        "bookName": " كتاب الجنائز",
        "babName": " باب تَمَنِّي الْمَوْتِ ‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ زُرَيْعٍ - عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَتَمَنَّيَنَّ أَحَدُكُمُ الْمَوْتَ لِضُرٍّ نَزَلَ بِهِ فِي الدُّنْيَا وَلَكِنْ لِيَقُلِ اللَّهُمَّ أَحْيِنِي مَا كَانَتِ الْحَيَاةُ خَيْرًا لِي وَتَوَفَّنِي إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِي ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 3,
        "matchingEnglishURN": 1070020,
        "last_updated": null
    },
    {
        "arabicURN": 1118290,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "1.00",
        "hadithNumber": "1821",
        "bookName": " كتاب الجنائز",
        "babName": " باب تَمَنِّي الْمَوْتِ ‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ عَبْدِ الْعَزِيزِ، ح وَأَنْبَأَنَا عِمْرَانُ بْنُ مُوسَى، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلاَ لاَ يَتَمَنَّى أَحَدُكُمُ الْمَوْتَ لِضُرٍّ نَزَلَ بِهِ فَإِنْ كَانَ لاَ بُدَّ مُتَمَنِّيًا الْمَوْتَ فَلْيَقُلِ اللَّهُمَّ أَحْيِنِي مَا كَانَتِ الْحَيَاةُ خَيْرًا لِي وَتَوَفَّنِي إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِي ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 4,
        "matchingEnglishURN": 1070030,
        "last_updated": null
    },
    {
        "arabicURN": 1118300,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "2.00",
        "hadithNumber": "1822",
        "bookName": " كتاب الجنائز",
        "babName": " باب الدُّعَاءِ بِالْمَوْتِ ‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ، عَنِ الْحَجَّاجِ، - وَهُوَ الْبَصْرِيُّ - عَنْ يُونُسَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَدْعُوا بِالْمَوْتِ وَلاَ تَتَمَنَّوْهُ فَمَنْ كَانَ دَاعِيًا لاَ بُدَّ فَلْيَقُلِ اللَّهُمَّ أَحْيِنِي مَا كَانَتِ الْحَيَاةُ خَيْرًا لِي وَتَوَفَّنِي إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِي ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 5,
        "matchingEnglishURN": 1070040,
        "last_updated": null
    },
    {
        "arabicURN": 1118310,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "2.00",
        "hadithNumber": "1823",
        "bookName": " كتاب الجنائز",
        "babName": " باب الدُّعَاءِ بِالْمَوْتِ ‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي قَيْسٌ، قَالَ دَخَلْتُ عَلَى خَبَّابٍ وَقَدِ اكْتَوَى فِي بَطْنِهِ سَبْعًا وَقَالَ لَوْلاَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَانَا أَنْ نَدْعُوَ بِالْمَوْتِ دَعَوْتُ بِهِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 6,
        "matchingEnglishURN": 1070050,
        "last_updated": null
    },
    {
        "arabicURN": 1118320,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "3.00",
        "hadithNumber": "1824",
        "bookName": " كتاب الجنائز",
        "babName": " باب كَثْرَةِ ذِكْرِ الْمَوْتِ ‏ ",
        "hadithText": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، ح وَأَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَكْثِرُوا ذِكْرَ هَاذِمِ اللَّذَّاتِ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ مُحَمَّدُ بْنُ إِبْرَاهِيمَ وَالِدُ أَبِي بَكْرِ بْنِ أَبِي شَيْبَةَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 7,
        "matchingEnglishURN": 1070060,
        "last_updated": null
    },
    {
        "arabicURN": 1118330,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "3.00",
        "hadithNumber": "1825",
        "bookName": " كتاب الجنائز",
        "babName": " باب كَثْرَةِ ذِكْرِ الْمَوْتِ ‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ يَحْيَى، عَنِ الأَعْمَشِ، قَالَ حَدَّثَنِي شَقِيقٌ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِذَا حَضَرْتُمُ الْمَرِيضَ فَقُولُوا خَيْرًا فَإِنَّ الْمَلاَئِكَةَ يُؤَمِّنُونَ عَلَى مَا تَقُولُونَ ‏\"‏ ‏.‏ فَلَمَّا مَاتَ أَبُو سَلَمَةَ قُلْتُ يَا رَسُولَ اللَّهِ كَيْفَ أَقُولُ قَالَ ‏\"‏ قُولِي اللَّهُمَّ اغْفِرْ لَنَا وَلَهُ وَأَعْقِبْنِي مِنْهُ عُقْبَى حَسَنَةً ‏\"‏ ‏.‏ فَأَعْقَبَنِي اللَّهُ عَزَّ وَجَلَّ مِنْهُ مُحَمَّدًا صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 8,
        "matchingEnglishURN": 1070070,
        "last_updated": null
    },
    {
        "arabicURN": 1118340,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "4.00",
        "hadithNumber": "1826",
        "bookName": " كتاب الجنائز",
        "babName": " باب تَلْقِينِ الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، قَالَ حَدَّثَنَا عُمَارَةُ بْنُ غَزِيَّةَ، قَالَ حَدَّثَنَا يَحْيَى بْنُ عُمَارَةَ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ، ح وَأَنْبَأَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ يَحْيَى بْنِ عُمَارَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَقِّنُوا مَوْتَاكُمْ لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 9,
        "matchingEnglishURN": 1070080,
        "last_updated": null
    },
    {
        "arabicURN": 1118350,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "4.00",
        "hadithNumber": "1827",
        "bookName": " كتاب الجنائز",
        "babName": " باب تَلْقِينِ الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ، قَالَ حَدَّثَنِي أَحْمَدُ بْنُ إِسْحَاقَ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا مَنْصُورُ ابْنُ صَفِيَّةَ، عَنْ أُمِّهِ، صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَقِّنُوا هَلْكَاكُمْ قَوْلَ لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 10,
        "matchingEnglishURN": 1070090,
        "last_updated": null
    },
    {
        "arabicURN": 1118360,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "5.00",
        "hadithNumber": "1828",
        "bookName": " كتاب الجنائز",
        "babName": " باب عَلاَمَةِ مَوْتِ الْمُؤْمِنِ ‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنِ الْمُثَنَّى بْنِ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَوْتُ الْمُؤْمِنِ بِعَرَقِ الْجَبِينِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 11,
        "matchingEnglishURN": 1070100,
        "last_updated": null
    },
    {
        "arabicURN": 1118370,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "5.00",
        "hadithNumber": "1829",
        "bookName": " كتاب الجنائز",
        "babName": " باب عَلاَمَةِ مَوْتِ الْمُؤْمِنِ ‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، قَالَ حَدَّثَنَا يُوسُفُ بْنُ يَعْقُوبَ، قَالَ حَدَّثَنَا كَهْمَسٌ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ الْمُؤْمِنُ يَمُوتُ بِعَرَقِ الْجَبِينِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 12,
        "matchingEnglishURN": 1070110,
        "last_updated": null
    },
    {
        "arabicURN": 1118380,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "6.00",
        "hadithNumber": "1830",
        "bookName": " كتاب الجنائز",
        "babName": " باب شِدَّةِ الْمَوْتِ ‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي ابْنُ الْهَادِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ مَاتَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَإِنَّهُ لَبَيْنَ حَاقِنَتِي وَذَاقِنَتِي فَلاَ أَكْرَهُ شِدَّةَ الْمَوْتِ لأَحَدٍ أَبَدًا بَعْدَ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 13,
        "matchingEnglishURN": 1070120,
        "last_updated": null
    },
    {
        "arabicURN": 1118390,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "7.00",
        "hadithNumber": "1831",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْمَوْتِ يَوْمَ الاِثْنَيْنِ ‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسٍ، قَالَ آخِرُ نَظْرَةٍ نَظَرْتُهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم كَشَفَ السِّتَارَةَ وَالنَّاسُ صُفُوفٌ خَلْفَ أَبِي بَكْرٍ رضى الله عنه فَأَرَادَ أَبُو بَكْرٍ أَنْ يَرْتَدَّ فَأَشَارَ إِلَيْهِمْ أَنِ امْكُثُوا وَأَلْقَى السِّجْفَ وَتُوُفِّيَ مِنْ آخِرِ ذَلِكَ الْيَوْمِ وَذَلِكَ يَوْمُ الاِثْنَيْنِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 14,
        "matchingEnglishURN": 1070130,
        "last_updated": null
    },
    {
        "arabicURN": 1118400,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "8.00",
        "hadithNumber": "1832",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْمَوْتِ بِغَيْرِ مَوْلِدِهِ ‏ ",
        "hadithText": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي حُيَىُّ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ مَاتَ رَجُلٌ بِالْمَدِينَةِ مِمَّنْ وُلِدَ بِهَا فَصَلَّى عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ يَا لَيْتَهُ مَاتَ بِغَيْرِ مَوْلِدِهِ ‏\"‏ ‏.‏ قَالُوا وَلِمَ ذَاكَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ إِنَّ الرَّجُلَ إِذَا مَاتَ بِغَيْرِ مَوْلِدِهِ قِيسَ لَهُ مِنْ مَوْلِدِهِ إِلَى مُنْقَطَعِ أَثَرِهِ فِي الْجَنَّةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 15,
        "matchingEnglishURN": 1070140,
        "last_updated": null
    },
    {
        "arabicURN": 1118410,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "9.00",
        "hadithNumber": "1833",
        "bookName": " كتاب الجنائز",
        "babName": " باب مَا يُلْقَى بِهِ الْمُؤْمِنُ مِنَ الْكَرَامَةِ عِنْدَ خُرُوجِ نَفْسِهِ ‏ ",
        "hadithText": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ قَسَامَةَ بْنِ زُهَيْرٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا حُضِرَ الْمُؤْمِنُ أَتَتْهُ مَلاَئِكَةُ الرَّحْمَةِ بِحَرِيرَةٍ بَيْضَاءَ فَيَقُولُونَ اخْرُجِي رَاضِيَةً مَرْضِيًّا عَنْكِ إِلَى رَوْحِ اللَّهِ وَرَيْحَانٍ وَرَبٍّ غَيْرِ غَضْبَانَ ‏.‏ فَتَخْرُجُ كَأَطْيَبِ رِيحِ الْمِسْكِ حَتَّى أَنَّهُ لَيُنَاوِلُهُ بَعْضُهُمْ بَعْضًا حَتَّى يَأْتُونَ بِهِ بَابَ السَّمَاءِ فَيَقُولُونَ مَا أَطْيَبَ هَذِهِ الرِّيحَ الَّتِي جَاءَتْكُمْ مِنَ الأَرْضِ ‏.‏ فَيَأْتُونَ بِهِ أَرْوَاحَ الْمُؤْمِنِينَ فَلَهُمْ أَشَدُّ فَرَحًا بِهِ مِنْ أَحَدِكُمْ بِغَائِبِهِ يَقْدَمُ عَلَيْهِ فَيَسْأَلُونَهُ مَاذَا فَعَلَ فُلاَنٌ مَاذَا فَعَلَ فُلاَنٌ فَيَقُولُونَ دَعُوهُ فَإِنَّهُ كَانَ فِي غَمِّ الدُّنْيَا فَإِذَا قَالَ أَمَا أَتَاكُمْ قَالُوا ذُهِبَ بِهِ إِلَى أُمِّهِ الْهَاوِيَةِ وَإِنَّ الْكَافِرَ إِذَا احْتُضِرَ أَتَتْهُ مَلاَئِكَةُ الْعَذَابِ بِمِسْحٍ فَيَقُولُونَ اخْرُجِي سَاخِطَةً مَسْخُوطًا $$عَلَيْكِ إِلَى عَذَابِ اللَّهِ عَزَّ وَجَلَّ ‏.‏ فَتَخْرُجُ كَأَنْتَنِ رِيحِ جِيفَةٍ حَتَّى يَأْتُونَ بِهِ بَابَ الأَرْضِ فَيَقُولُونَ مَا أَنْتَنَ هَذِهِ الرِّيحَ حَتَّى يَأْتُونَ بِهِ أَرْوَاحَ الْكُفَّارِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 16,
        "matchingEnglishURN": 1070150,
        "last_updated": null
    },
    {
        "arabicURN": 1118420,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "10.00",
        "hadithNumber": "1834",
        "bookName": " كتاب الجنائز",
        "babName": " باب فِيمَنْ أَحَبَّ لِقَاءَ اللَّهِ ‏ ",
        "hadithText": "أَخْبَرَنَا هَنَّادٌ، عَنْ أَبِي زُبَيْدٍ، - وَهُوَ عَبْثَرُ بْنُ الْقَاسِمِ - عَنْ مُطَرِّفٍ، عَنْ عَامِرٍ، عَنْ شُرَيْحِ بْنِ هَانِئٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ ‏\"‏ ‏.‏ قَالَ شُرَيْحٌ فَأَتَيْتُ عَائِشَةَ فَقُلْتُ يَا أُمَّ الْمُؤْمِنِينَ سَمِعْتُ أَبَا هُرَيْرَةَ يَذْكُرُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم حَدِيثًا إِنْ كَانَ كَذَلِكَ فَقَدْ هَلَكْنَا ‏.‏ قَالَتْ وَمَا ذَاكَ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ ‏\"‏ ‏.‏ وَلَكِنْ لَيْسَ مِنَّا أَحَدٌ إِلاَّ وَهُوَ يَكْرَهُ الْمَوْتَ قَالَتْ قَدْ قَالَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم وَلَيْسَ بِالَّذِي تَذْهَبُ إِلَيْهِ وَلَكِنْ إِذَا طَمَحَ الْبَصَرُ وَحَشْرَجَ الصَّدْرُ وَاقْشَعَرَّ الْجِلْدُ فَعِنْدَ ذَلِكَ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 17,
        "matchingEnglishURN": 1070160,
        "last_updated": null
    },
    {
        "arabicURN": 1118430,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "10.00",
        "hadithNumber": "1835",
        "bookName": " كتاب الجنائز",
        "babName": " باب فِيمَنْ أَحَبَّ لِقَاءَ اللَّهِ ‏ ",
        "hadithText": "أَخْبَرَنَا الْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، حَدَّثَنِي مَالِكٌ، ح وَأَنْبَأَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا الْمُغِيرَةُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَالَ اللَّهُ تَعَالَى إِذَا أَحَبَّ عَبْدِي لِقَائِي أَحْبَبْتُ لِقَاءَهُ وَإِذَا كَرِهَ لِقَائِي كَرِهْتُ لِقَاءَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 18,
        "matchingEnglishURN": 1070170,
        "last_updated": null
    },
    {
        "arabicURN": 1118440,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "10.00",
        "hadithNumber": "1836",
        "bookName": " كتاب الجنائز",
        "babName": " باب فِيمَنْ أَحَبَّ لِقَاءَ اللَّهِ ‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ أَنَسًا، يُحَدِّثُ عَنْ عُبَادَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 19,
        "matchingEnglishURN": 1070180,
        "last_updated": null
    },
    {
        "arabicURN": 1118450,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "10.00",
        "hadithNumber": "1837",
        "bookName": " كتاب الجنائز",
        "babName": " باب فِيمَنْ أَحَبَّ لِقَاءَ اللَّهِ ‏ ",
        "hadithText": "أَخْبَرَنَا أَبُو الأَشْعَثِ، قَالَ حَدَّثَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ أَبِي يُحَدِّثُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 20,
        "matchingEnglishURN": 1070190,
        "last_updated": null
    },
    {
        "arabicURN": 1118460,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "10.00",
        "hadithNumber": "1838",
        "bookName": " كتاب الجنائز",
        "babName": " باب فِيمَنْ أَحَبَّ لِقَاءَ اللَّهِ ‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى، قَالَ حَدَّثَنَا سَعِيدٌ، ح وَأَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، عَنْ خَالِدِ بْنِ الْحَارِثِ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ، عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ ‏\"‏ ‏.‏ زَادَ عَمْرٌو فِي حَدِيثِهِ فَقِيلَ يَا رَسُولَ اللَّهِ كَرَاهِيَةُ لِقَاءِ اللَّهِ كَرَاهِيَةُ الْمَوْتِ كُلُّنَا نَكْرَهُ الْمَوْتَ ‏.‏ قَالَ ‏\"‏ ذَاكَ عِنْدَ مَوْتِهِ إِذَا بُشِّرَ بِرَحْمَةِ اللَّهِ وَمَغْفِرَتِهِ أَحَبَّ لِقَاءَ اللَّهِ وَأَحَبَّ اللَّهُ لِقَاءَهُ وَإِذَا بُشِّرَ بِعَذَابِ اللَّهِ كَرِهَ لِقَاءَ اللَّهِ وَكَرِهَ اللَّهُ لِقَاءَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 21,
        "matchingEnglishURN": 1070200,
        "last_updated": null
    },
    {
        "arabicURN": 1118470,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "11.00",
        "hadithNumber": "1839",
        "bookName": " كتاب الجنائز",
        "babName": " باب تَقْبِيلِ الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرٍو، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ أَبَا بَكْرٍ، قَبَّلَ بَيْنَ عَيْنَىِ النَّبِيِّ صلى الله عليه وسلم وَهُوَ مَيِّتٌ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 22,
        "matchingEnglishURN": 1070210,
        "last_updated": null
    },
    {
        "arabicURN": 1118480,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "11.00",
        "hadithNumber": "1840",
        "bookName": " كتاب الجنائز",
        "babName": " باب تَقْبِيلِ الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي مُوسَى بْنُ أَبِي عَائِشَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، وَعَنْ عَائِشَةَ، أَنَّ أَبَا بَكْرٍ، قَبَّلَ النَّبِيَّ صلى الله عليه وسلم وَهُوَ مَيِّتٌ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 23,
        "matchingEnglishURN": 1070220,
        "last_updated": null
    },
    {
        "arabicURN": 1118490,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "11.00",
        "hadithNumber": "1841",
        "bookName": " كتاب الجنائز",
        "babName": " باب تَقْبِيلِ الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا سُوَيْدٌ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، قَالَ قَالَ مَعْمَرٌ وَيُونُسُ قَالَ الزُّهْرِيُّ وَأَخْبَرَنِي أَبُو سَلَمَةَ أَنَّ عَائِشَةَ أَخْبَرَتْهُ أَنَّ أَبَا بَكْرٍ أَقْبَلَ عَلَى فَرَسٍ مِنْ مَسْكَنِهِ بِالسُّنُحِ حَتَّى نَزَلَ فَدَخَلَ الْمَسْجِدَ فَلَمْ يُكَلِّمِ النَّاسَ حَتَّى دَخَلَ عَلَى عَائِشَةَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم مُسَجًّى بِبُرْدٍ حِبَرَةٍ فَكَشَفَ عَنْ وَجْهِهِ ثُمَّ أَكَبَّ عَلَيْهِ فَقَبَّلَهُ فَبَكَى ثُمَّ قَالَ بِأَبِي أَنْتَ وَاللَّهِ لاَ يَجْمَعُ اللَّهُ عَلَيْكَ مَوْتَتَيْنِ أَبَدًا أَمَّا الْمَوْتَةُ الَّتِي كَتَبَ اللَّهُ عَلَيْكَ فَقَدْ مُتَّهَا ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 24,
        "matchingEnglishURN": 1070230,
        "last_updated": null
    },
    {
        "arabicURN": 1118500,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "12.00",
        "hadithNumber": "1842",
        "bookName": " كتاب الجنائز",
        "babName": " باب تَسْجِيَةِ الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنِي مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ ابْنَ الْمُنْكَدِرِ، يَقُولُ سَمِعْتُ جَابِرًا، يَقُولُ جِيءَ بِأَبِي يَوْمَ أُحُدٍ وَقَدْ مُثِّلَ بِهِ فَوُضِعَ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَقَدْ سُجِّيَ بِثَوْبٍ فَجَعَلْتُ أُرِيدُ أَنْ أَكْشِفَ عَنْهُ فَنَهَانِي قَوْمِي فَأَمَرَ بِهِ النَّبِيُّ صلى الله عليه وسلم فَرُفِعَ فَلَمَّا رُفِعَ سَمِعَ صَوْتَ بَاكِيَةٍ فَقَالَ ‏\"‏ مَنْ هَذِهِ ‏\"‏ ‏.‏ فَقَالُوا هَذِهِ بِنْتُ عَمْرٍو أَوْ أُخْتُ عَمْرٍو ‏.‏ قَالَ ‏\"‏ فَلاَ تَبْكِي - أَوْ فَلِمَ تَبْكِي - مَا زَالَتِ الْمَلاَئِكَةُ تُظِلُّهُ بِأَجْنِحَتِهَا حَتَّى رُفِعَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 25,
        "matchingEnglishURN": 1070240,
        "last_updated": null
    },
    {
        "arabicURN": 1118510,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "13.00",
        "hadithNumber": "1843",
        "bookName": " كتاب الجنائز",
        "babName": " باب فِي الْبُكَاءِ عَلَى الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسِ، قَالَ لَمَّا حُضِرَتْ بِنْتٌ لِرَسُولِ اللَّهِ صلى الله عليه وسلم صَغِيرَةٌ فَأَخَذَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَضَمَّهَا إِلَى صَدْرِهِ ثُمَّ وَضَعَ يَدَهُ عَلَيْهَا فَقَضَتْ وَهِيَ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَبَكَتْ أُمُّ أَيْمَنَ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا أُمَّ أَيْمَنَ أَتَبْكِينَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَكِ ‏\"‏ ‏.‏ فَقَالَتْ مَا لِي لاَ أَبْكِي وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَبْكِي فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنِّي لَسْتُ أَبْكِي وَلَكِنَّهَا رَحْمَةٌ ‏\"‏ ‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْمُؤْمِنُ بِخَيْرٍ عَلَى كُلِّ حَالٍ تُنْزَعُ نَفْسُهُ مِنْ بَيْنِ جَنْبَيْهِ وَهُوَ يَحْمَدُ اللَّهَ عَزَّ وَجَلَّ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 26,
        "matchingEnglishURN": 1070250,
        "last_updated": null
    },
    {
        "arabicURN": 1118520,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "13.00",
        "hadithNumber": "1844",
        "bookName": " كتاب الجنائز",
        "babName": " باب فِي الْبُكَاءِ عَلَى الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ فَاطِمَةَ، بَكَتْ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم حِينَ مَاتَ فَقَالَتْ يَا أَبَتَاهُ مِنْ رَبِّهِ مَا أَدْنَاهُ يَا أَبَتَاهُ إِلَى جِبْرِيلَ نَنْعَاهُ يَا أَبَتَاهُ جَنَّةُ الْفِرْدَوْسِ مَأْوَاهُ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 27,
        "matchingEnglishURN": 1070260,
        "last_updated": null
    },
    {
        "arabicURN": 1118530,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "13.00",
        "hadithNumber": "1845",
        "bookName": " كتاب الجنائز",
        "babName": " باب فِي الْبُكَاءِ عَلَى الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ، قَالَ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، أَنَّ أَبَاهُ، قُتِلَ يَوْمَ أُحُدٍ - قَالَ - فَجَعَلْتُ أَكْشِفُ عَنْ وَجْهِهِ، وَأَبْكِي، وَالنَّاسُ، يَنْهَوْنِي وَرَسُولُ اللَّهِ صلى الله عليه وسلم لاَ يَنْهَانِي وَجَعَلَتْ عَمَّتِي تَبْكِيهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَبْكِيهِ مَا زَالَتِ الْمَلاَئِكَةُ تُظِلُّهُ بِأَجْنِحَتِهَا حَتَّى رَفَعْتُمُوهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 28,
        "matchingEnglishURN": 1070270,
        "last_updated": null
    },
    {
        "arabicURN": 1118540,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "14.00",
        "hadithNumber": "1846",
        "bookName": " كتاب الجنائز",
        "babName": " باب النَّهْىِ عَنِ الْبُكَاءِ، عَلَى الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا عُتْبَةُ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ جَبْرِ بْنِ عَتِيكٍ، أَنَّ عَتِيكَ بْنَ الْحَارِثِ، وَهُوَ جَدُّ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ أَبُو أُمِّهِ أَخْبَرَهُ أَنَّ جَبْرَ بْنَ عَتِيكٍ أَخْبَرَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم جَاءَ يَعُودُ عَبْدَ اللَّهِ بْنَ ثَابِتٍ فَوَجَدَهُ قَدْ غُلِبَ عَلَيْهِ فَصَاحَ بِهِ فَلَمْ يُجِبْهُ فَاسْتَرْجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\"‏ قَدْ غُلِبْنَا عَلَيْكَ أَبَا الرَّبِيعِ ‏\"‏ ‏.‏ فَصِحْنَ النِّسَاءُ وَبَكَيْنَ فَجَعَلَ ابْنُ عَتِيكٍ يُسَكِّتُهُنَّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ دَعْهُنَّ فَإِذَا وَجَبَ فَلاَ تَبْكِيَنَّ بَاكِيَةٌ ‏\"‏ ‏.‏ قَالُوا وَمَا الْوُجُوبُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الْمَوْتُ ‏\"‏ ‏.‏ قَالَتِ ابْنَتُهُ إِنْ كُنْتُ لأَرْجُو أَنْ تَكُونَ شَهِيدًا قَدْ كُنْتَ قَضَيْتَ جِهَازَكَ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ قَدْ أَوْقَعَ أَجْرَهُ عَلَيْهِ عَلَى قَدْرِ نِيَّتِهِ وَمَا تَعُدُّونَ الشَّهَادَةَ ‏\"‏ ‏.‏ قَالُوا الْقَتْلُ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الشَّهَادَةُ سَبْعٌ سِوَى الْقَتْلِ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ الْمَطْعُونُ شَهِيدٌ وَالْمَبْطُونُ شَهِيدٌ وَالْغَرِيقُ شَهِيدٌ وَصَاحِبُ الْهَدْمِ شَهِيدٌ وَصَاحِبُ ذَاتِ الْجَنْبِ شَهِيدٌ وَصَاحِبُ الْحَرَقِ شَهِيدٌ وَالْمَرْأَةُ تَمُوتُ بِجُمْعٍ شَهِيدَةٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 29,
        "matchingEnglishURN": 1070280,
        "last_updated": null
    },
    {
        "arabicURN": 1118550,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "14.00",
        "hadithNumber": "1847",
        "bookName": " كتاب الجنائز",
        "babName": " باب النَّهْىِ عَنِ الْبُكَاءِ، عَلَى الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، قَالَ قَالَ مُعَاوِيَةُ بْنُ صَالِحٍ وَحَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا أَتَى نَعْىُ زَيْدِ بْنِ حَارِثَةَ وَجَعْفَرِ بْنِ أَبِي طَالِبٍ وَعَبْدِ اللَّهِ بْنِ رَوَاحَةَ جَلَسَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُعْرَفُ فِيهِ الْحُزْنُ وَأَنَا أَنْظُرُ مِنْ صِئْرِ الْبَابِ فَجَاءَهُ رَجُلٌ فَقَالَ إِنَّ نِسَاءَ جَعْفَرٍ يَبْكِينَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ انْطَلِقْ فَانْهَهُنَّ ‏\"‏ ‏.‏ فَانْطَلَقَ ثُمَّ جَاءَ فَقَالَ قَدْ نَهَيْتُهُنَّ فَأَبَيْنَ أَنْ يَنْتَهِينَ ‏.‏ فَقَالَ ‏\"‏ انْطَلِقْ فَانْهَهُنَّ ‏\"‏ ‏.‏ فَانْطَلَقَ ثُمَّ جَاءَ فَقَالَ قَدْ نَهَيْتُهُنَّ فَأَبَيْنَ أَنْ يَنْتَهِينَ ‏.‏ قَالَ ‏\"‏ فَانْطَلِقْ فَاحْثُ فِي أَفْوَاهِهِنَّ التُّرَابَ ‏\"‏ ‏.‏ فَقَالَتْ عَائِشَةُ فَقُلْتُ أَرْغَمَ اللَّهُ أَنْفَ الأَبْعَدِ إِنَّكَ وَاللَّهِ مَا تَرَكْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَمَا أَنْتَ بِفَاعِلٍ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 30,
        "matchingEnglishURN": 1070290,
        "last_updated": null
    },
    {
        "arabicURN": 1118560,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "14.00",
        "hadithNumber": "1848",
        "bookName": " كتاب الجنائز",
        "babName": " باب النَّهْىِ عَنِ الْبُكَاءِ، عَلَى الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الْمَيِّتُ يُعَذَّبُ بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 31,
        "matchingEnglishURN": 1070300,
        "last_updated": null
    },
    {
        "arabicURN": 1118570,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "14.00",
        "hadithNumber": "1849",
        "bookName": " كتاب الجنائز",
        "babName": " باب النَّهْىِ عَنِ الْبُكَاءِ، عَلَى الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ اللَّهِ بْنِ صُبَيْحٍ، قَالَ سَمِعْتُ مُحَمَّدَ بْنَ سِيرِينَ، يَقُولُ ذُكِرَ عِنْدَ عِمْرَانَ بْنِ حُصَيْنٍ الْمَيِّتُ يُعَذَّبُ بِبُكَاءِ الْحَىِّ فَقَالَ عِمْرَانُ قَالَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 32,
        "matchingEnglishURN": 1070310,
        "last_updated": null
    },
    {
        "arabicURN": 1118580,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "14.00",
        "hadithNumber": "1850",
        "bookName": " كتاب الجنائز",
        "babName": " باب النَّهْىِ عَنِ الْبُكَاءِ، عَلَى الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا سُلَيْمَانُ بْنُ سَيْفٍ، قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ قَالَ سَالِمٌ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ، يَقُولُ قَالَ عُمَرُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يُعَذَّبُ الْمَيِّتُ بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 33,
        "matchingEnglishURN": 1070320,
        "last_updated": null
    },
    {
        "arabicURN": 1118590,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "15.00",
        "hadithNumber": "1851",
        "bookName": " كتاب الجنائز",
        "babName": " باب النِّيَاحَةِ عَلَى الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ مُطَرِّفٍ، عَنْ حَكِيمِ بْنِ قَيْسٍ، أَنَّ قَيْسَ بْنَ عَاصِمٍ، قَالَ لاَ تَنُوحُوا عَلَىَّ فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يُنَحْ عَلَيْهِ ‏.‏ مُخْتَصَرٌ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 34,
        "matchingEnglishURN": 1070330,
        "last_updated": null
    },
    {
        "arabicURN": 1118600,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "15.00",
        "hadithNumber": "1852",
        "bookName": " كتاب الجنائز",
        "babName": " باب النِّيَاحَةِ عَلَى الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ، قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَخَذَ عَلَى النِّسَاءِ حِينَ بَايَعَهُنَّ أَنْ لاَ يَنُحْنَ فَقُلْنَ يَا رَسُولَ اللَّهِ إِنَّ نِسَاءً أَسْعَدْنَنَا فِي الْجَاهِلِيَّةِ أَفَنُسْعِدُهُنَّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ إِسْعَادَ فِي الإِسْلاَمِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 35,
        "matchingEnglishURN": 1070340,
        "last_updated": null
    },
    {
        "arabicURN": 1118610,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "15.00",
        "hadithNumber": "1853",
        "bookName": " كتاب الجنائز",
        "babName": " باب النِّيَاحَةِ عَلَى الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا قَتَادَةُ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ الْمَيِّتُ يُعَذَّبُ فِي قَبْرِهِ بِالنِّيَاحَةِ عَلَيْهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 36,
        "matchingEnglishURN": 1070350,
        "last_updated": null
    },
    {
        "arabicURN": 1118620,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "15.00",
        "hadithNumber": "1854",
        "bookName": " كتاب الجنائز",
        "babName": " باب النِّيَاحَةِ عَلَى الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، قَالَ أَنْبَأَنَا هُشَيْمٌ، قَالَ أَنْبَأَنَا مَنْصُورٌ، - هُوَ ابْنُ زَاذَانَ - عَنِ الْحَسَنِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ الْمَيِّتُ يُعَذَّبُ بِنِيَاحَةِ أَهْلِهِ عَلَيْهِ ‏.‏ فَقَالَ لَهُ رَجُلٌ أَرَأَيْتَ رَجُلاً مَاتَ بِخُرَاسَانَ وَنَاحَ أَهْلُهُ عَلَيْهِ هَا هُنَا أَكَانَ يُعَذَّبُ بِنِيَاحَةِ أَهْلِهِ قَالَ صَدَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَكَذَبْتَ أَنْتَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 37,
        "matchingEnglishURN": 1070360,
        "last_updated": null
    },
    {
        "arabicURN": 1118630,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "15.00",
        "hadithNumber": "1855",
        "bookName": " كتاب الجنائز",
        "babName": " باب النِّيَاحَةِ عَلَى الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ آدَمَ، عَنْ عَبْدَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏ ‏.‏ فَذُكِرَ ذَلِكَ لِعَائِشَةَ فَقَالَتْ وَهِلَ إِنَّمَا مَرَّ النَّبِيُّ صلى الله عليه وسلم عَلَى قَبْرٍ فَقَالَ ‏\"‏ إِنَّ صَاحِبَ الْقَبْرِ لَيُعَذَّبُ وَإِنَّ أَهْلَهُ يَبْكُونَ عَلَيْهِ ‏\"‏ ‏.‏ ثُمَّ قَرَأَتْ ‏<A id=\"q1\" name=\"q1\" href=\"javascript:openquran(5,164,164)\"><c_q1>{‏ وَلاَ تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى ‏}</c_q1></a>‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 38,
        "matchingEnglishURN": 1070370,
        "last_updated": null
    },
    {
        "arabicURN": 1118640,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "15.00",
        "hadithNumber": "1856",
        "bookName": " كتاب الجنائز",
        "babName": " باب النِّيَاحَةِ عَلَى الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِيهِ، عَنْ عَمْرَةَ، أَنَّهَا أَخْبَرَتْهُ أَنَّهَا، سَمِعَتْ عَائِشَةَ، وَذُكِرَ، لَهَا أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، يَقُولُ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبُكَاءِ الْحَىِّ عَلَيْهِ ‏.‏ قَالَتْ عَائِشَةُ يَغْفِرُ اللَّهُ لأَبِي عَبْدِ الرَّحْمَنِ أَمَا إِنَّهُ لَمْ يَكْذِبْ وَلَكِنْ نَسِيَ أَوْ أَخْطَأَ إِنَّمَا مَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى يَهُودِيَّةٍ يُبْكَى عَلَيْهَا فَقَالَ ‏\"‏ إِنَّهُمْ لَيَبْكُونَ عَلَيْهَا وَإِنَّهَا لَتُعَذَّبُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 39,
        "matchingEnglishURN": 1070380,
        "last_updated": null
    },
    {
        "arabicURN": 1118650,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "15.00",
        "hadithNumber": "1857",
        "bookName": " كتاب الجنائز",
        "babName": " باب النِّيَاحَةِ عَلَى الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلاَءِ بْنِ عَبْدِ الْجَبَّارِ، عَنْ سُفْيَانَ، قَالَ قَصَّهُ لَنَا عَمْرُو بْنُ دِينَارٍ قَالَ سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ، يَقُولُ قَالَ ابْنُ عَبَّاسٍ قَالَتْ عَائِشَةُ إِنَّمَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ يَزِيدُ الْكَافِرَ عَذَابًا بِبَعْضِ بُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 40,
        "matchingEnglishURN": 1070390,
        "last_updated": null
    },
    {
        "arabicURN": 1118660,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "15.00",
        "hadithNumber": "1858",
        "bookName": " كتاب الجنائز",
        "babName": " باب النِّيَاحَةِ عَلَى الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا سُلَيْمَانُ بْنُ مَنْصُورٍ الْبَلْخِيُّ، قَالَ حَدَّثَنَا عَبْدُ الْجَبَّارِ بْنُ الْوَرْدِ، سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ، يَقُولُ لَمَّا هَلَكَتْ أُمُّ أَبَانَ حَضَرْتُ مَعَ النَّاسِ فَجَلَسْتُ بَيْنَ عَبْدِ اللَّهِ بْنِ عُمَرَ وَابْنِ عَبَّاسٍ فَبَكَيْنَ النِّسَاءُ فَقَالَ ابْنُ عُمَرَ أَلاَ تَنْهَى هَؤُلاَءِ عَنِ الْبُكَاءِ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبَعْضِ بُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏ ‏.‏ فَقَالَ ابْنُ عَبَّاسٍ قَدْ كَانَ عُمَرُ يَقُولُ بَعْضَ ذَلِكَ خَرَجْتُ مَعَ عُمَرَ حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ رَأَى رَكْبًا تَحْتَ شَجَرَةٍ فَقَالَ انْظُرْ مَنِ الرَّكْبُ فَذَهَبْتُ فَإِذَا صُهَيْبٌ وَأَهْلُهُ فَرَجَعْتُ إِلَيْهِ فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ هَذَا صُهَيْبٌ وَأَهْلُهُ ‏.‏ فَقَالَ عَلَىَّ بِصُهَيْبٍ ‏.‏ فَلَمَّا دَخَلْنَا الْمَدِينَةَ أُصِيبَ عُمَرُ فَجَلَسَ صُهَيْبٌ يَبْكِي عِنْدَهُ يَقُولُ وَاأُخَيَّاهُ وَاأُخَيَّاهُ ‏.‏ فَقَالَ عُمَرُ يَا صُهَيْبُ لاَ تَبْكِ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبَعْضِ بُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏ ‏.‏ قَالَ فَذَكَرْتُ ذَلِكَ لِعَائِشَةَ فَقَالَتْ أَمَا وَاللَّهِ مَا تُحَدِّثُونَ هَذَا الْحَدِيثَ عَنْ كَاذِبَيْنِ مُكَذَّبَيْنِ وَلَكِنَّ السَّمْعَ يُخْطِئُ وَإِنَّ لَكُمْ فِي الْقُرْآنِ لَمَا يَشْفِيكُمْ ‏<A id=\"q2\" name=\"q2\" href=\"javascript:openquran(52,38,38)\"><c_q2>{‏ أَلاَّ تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى ‏}</c_q2></a>‏ وَلَكِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ اللَّهَ لَيَزِيدُ الْكَافِرَ عَذَابًا بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 41,
        "matchingEnglishURN": 1070400,
        "last_updated": null
    },
    {
        "arabicURN": 1118670,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "16.00",
        "hadithNumber": "1859",
        "bookName": " كتاب الجنائز",
        "babName": " باب الرُّخْصَةِ فِي الْبُكَاءِ عَلَى الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، - هُوَ ابْنُ جَعْفَرٍ - عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، أَنَّ سَلَمَةَ بْنَ الأَزْرَقِ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، قَالَ مَاتَ مَيِّتٌ مِنْ آلِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَاجْتَمَعَ النِّسَاءُ يَبْكِينَ عَلَيْهِ فَقَامَ عُمَرُ يَنْهَاهُنَّ وَيَطْرُدُهُنَّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ دَعْهُنَّ يَا عُمَرُ فَإِنَّ الْعَيْنَ دَامِعَةٌ وَالْقَلْبَ مُصَابٌ وَالْعَهْدَ قَرِيبٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 42,
        "matchingEnglishURN": 1070410,
        "last_updated": null
    },
    {
        "arabicURN": 1118680,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "17.00",
        "hadithNumber": "1860",
        "bookName": " كتاب الجنائز",
        "babName": " باب دَعْوَى الْجَاهِلِيَّةِ ‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ خَشْرَمٍ، قَالَ حَدَّثَنَا عِيسَى، عَنِ الأَعْمَشِ، ح أَنْبَأَنَا الْحَسَنُ بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا ابْنُ إِدْرِيسَ، عَنِ الأَعْمَشِ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَيْسَ مِنَّا مَنْ ضَرَبَ الْخُدُودَ وَشَقَّ الْجُيُوبَ وَدَعَا بِدُعَاءِ الْجَاهِلِيَّةِ ‏\"‏ ‏.‏ وَاللَّفْظُ لِعَلِيٍّ وَقَالَ الْحَسَنُ ‏\"‏ بِدَعْوَى ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 43,
        "matchingEnglishURN": 1070420,
        "last_updated": null
    },
    {
        "arabicURN": 1118690,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "18.00",
        "hadithNumber": "1861",
        "bookName": " كتاب الجنائز",
        "babName": " باب السَّلْقِ ‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَوْفٍ، عَنْ خَالِدٍ الأَحْدَبِ، عَنْ صَفْوَانَ بْنِ مُحْرِزٍ، قَالَ أُغْمِيَ عَلَى أَبِي مُوسَى فَبَكَوْا عَلَيْهِ فَقَالَ أَبْرَأُ إِلَيْكُمْ كَمَا بَرِئَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْسَ مِنَّا مَنْ حَلَقَ وَلاَ خَرَقَ وَلاَ سَلَقَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 44,
        "matchingEnglishURN": 1070430,
        "last_updated": null
    },
    {
        "arabicURN": 1118700,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "19.00",
        "hadithNumber": "1862",
        "bookName": " كتاب الجنائز",
        "babName": " باب ضَرْبِ الْخُدُودِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي زُبَيْدٌ، عَنْ إِبْرَاهِيمَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ لَيْسَ مِنَّا مَنْ ضَرَبَ الْخُدُودَ وَشَقَّ الْجُيُوبَ وَدَعَا بِدَعْوَى الْجَاهِلِيَّةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 45,
        "matchingEnglishURN": 1070440,
        "last_updated": null
    },
    {
        "arabicURN": 1118710,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "20.00",
        "hadithNumber": "1863",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْحَلْقِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ، قَالَ أَنْبَأَنَا جَعْفَرُ بْنُ عَوْفٍ، قَالَ حَدَّثَنَا أَبُو عُمَيْسٍ، عَنْ أَبِي صَخْرَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، وَأَبِي، بُرْدَةَ قَالاَ لَمَّا ثَقُلَ أَبُو مُوسَى أَقْبَلَتِ امْرَأَتُهُ تَصِيحُ - قَالاَ - فَأَفَاقَ فَقَالَ أَلَمْ أُخْبِرْكِ أَنِّي بَرِيءٌ مِمَّنْ بَرِئَ مِنْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالاَ وَكَانَ يُحَدِّثُهَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَنَا بَرِيءٌ مِمَّنْ حَلَقَ وَخَرَقَ وَسَلَقَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 46,
        "matchingEnglishURN": 1070450,
        "last_updated": null
    },
    {
        "arabicURN": 1118720,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "21.00",
        "hadithNumber": "1864",
        "bookName": " كتاب الجنائز",
        "babName": " باب شَقِّ الْجُيُوبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ زُبَيْدٍ، عَنْ إِبْرَاهِيمَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لَيْسَ مِنَّا مَنْ ضَرَبَ الْخُدُودَ وَشَقَّ الْجُيُوبَ وَدَعَا بِدَعْوَى الْجَاهِلِيَّةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 47,
        "matchingEnglishURN": 1070460,
        "last_updated": null
    },
    {
        "arabicURN": 1118730,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "21.00",
        "hadithNumber": "1865",
        "bookName": " كتاب الجنائز",
        "babName": " باب شَقِّ الْجُيُوبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ يَزِيدَ بْنِ أَوْسٍ، عَنْ أَبِي مُوسَى، أَنَّهُ أُغْمِيَ عَلَيْهِ فَبَكَتْ أُمُّ وَلَدٍ لَهُ فَلَمَّا أَفَاقَ قَالَ لَهَا أَمَا بَلَغَكِ مَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَأَلْنَاهَا فَقَالَتْ قَالَ ‏\"‏ لَيْسَ مِنَّا مَنْ سَلَقَ وَحَلَقَ وَخَرَقَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 48,
        "matchingEnglishURN": 1070470,
        "last_updated": null
    },
    {
        "arabicURN": 1118740,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "21.00",
        "hadithNumber": "1866",
        "bookName": " كتاب الجنائز",
        "babName": " باب شَقِّ الْجُيُوبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، قَالَ حَدَّثَنَا إِسْرَائِيلُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ يَزِيدَ بْنِ أَوْسٍ، عَنْ أُمِّ عَبْدِ اللَّهِ، امْرَأَةِ أَبِي مُوسَى عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَيْسَ مِنَّا مَنْ حَلَقَ وَسَلَقَ وَخَرَقَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 49,
        "matchingEnglishURN": 1070480,
        "last_updated": null
    },
    {
        "arabicURN": 1118750,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "21.00",
        "hadithNumber": "1867",
        "bookName": " كتاب الجنائز",
        "babName": " باب شَقِّ الْجُيُوبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا هَنَّادٌ، عَنْ أَبِي مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ سَهْمِ بْنِ مِنْجَابٍ، عَنِ الْقَرْثَعِ، قَالَ لَمَّا ثَقُلَ أَبُو مُوسَى صَاحَتِ امْرَأَتُهُ فَقَالَ أَمَا عَلِمْتِ مَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَتْ بَلَى ‏.‏ ثُمَّ سَكَتَتْ فَقِيلَ لَهَا بَعْدَ ذَلِكَ أَىُّ شَىْءٍ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَتْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَعَنَ مَنْ حَلَقَ أَوْ سَلَقَ أَوْ خَرَقَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 50,
        "matchingEnglishURN": 1070490,
        "last_updated": null
    },
    {
        "arabicURN": 1118760,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "22.00",
        "hadithNumber": "1868",
        "bookName": " كتاب الجنائز",
        "babName": " باب الأَمْرِ بِالاِحْتِسَابِ وَالصَّبْرِ عِنْدَ نُزُولِ الْمُصِيبَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ عَاصِمِ بْنِ سُلَيْمَانَ، عَنْ أَبِي عُثْمَانَ، قَالَ حَدَّثَنِي أُسَامَةُ بْنُ زَيْدٍ، قَالَ أَرْسَلَتْ بِنْتُ النَّبِيِّ صلى الله عليه وسلم إِلَيْهِ أَنَّ ابْنًا لِي قُبِضَ فَأْتِنَا ‏.‏ فَأَرْسَلَ يَقْرَأُ السَّلاَمَ وَيَقُولُ ‏\"‏ إِنَّ لِلَّهِ مَا أَخَذَ وَلَهُ مَا أَعْطَى وَكُلُّ شَىْءٍ عِنْدَ اللَّهِ بِأَجَلٍ مُسَمًّى فَلْتَصْبِرْ وَلْتَحْتَسِبْ ‏\"‏ ‏.‏ فَأَرْسَلَتْ إِلَيْهِ تُقْسِمُ عَلَيْهِ لَيَأْتِيَنَّهَا فَقَامَ وَمَعَهُ سَعْدُ بْنُ عُبَادَةَ وَمُعَاذُ بْنُ جَبَلٍ وَأُبَىُّ بْنُ كَعْبٍ وَزَيْدُ بْنُ ثَابِتٍ وَرِجَالٌ فَرُفِعَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم الصَّبِيُّ وَنَفْسُهُ تَقَعْقَعُ فَفَاضَتْ عَيْنَاهُ فَقَالَ سَعْدٌ يَا رَسُولَ اللَّهِ مَا هَذَا قَالَ ‏\"‏ هَذَا رَحْمَةٌ يَجْعَلُهَا اللَّهُ فِي قُلُوبِ عِبَادِهِ وَإِنَّمَا يَرْحَمُ اللَّهُ مِنْ عِبَادِهِ الرُّحَمَاءَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 51,
        "matchingEnglishURN": 1070500,
        "last_updated": null
    },
    {
        "arabicURN": 1118770,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "22.00",
        "hadithNumber": "1869",
        "bookName": " كتاب الجنائز",
        "babName": " باب الأَمْرِ بِالاِحْتِسَابِ وَالصَّبْرِ عِنْدَ نُزُولِ الْمُصِيبَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ ثَابِتٍ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الصَّبْرُ عِنْدَ الصَّدْمَةِ الأُولَى ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 52,
        "matchingEnglishURN": 1070510,
        "last_updated": null
    },
    {
        "arabicURN": 1118780,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "22.00",
        "hadithNumber": "1870",
        "bookName": " كتاب الجنائز",
        "babName": " باب الأَمْرِ بِالاِحْتِسَابِ وَالصَّبْرِ عِنْدَ نُزُولِ الْمُصِيبَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا أَبُو إِيَاسٍ، - وَهُوَ مُعَاوِيَةُ بْنُ قُرَّةَ - عَنْ أَبِيهِ، رضى الله عنه أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم وَمَعَهُ ابْنٌ لَهُ فَقَالَ لَهُ ‏\"‏ أَتُحِبُّهُ ‏\"‏ ‏.‏ فَقَالَ أَحَبَّكَ اللَّهُ كَمَا أُحِبُّهُ ‏.‏ فَمَاتَ فَفَقَدَهُ فَسَأَلَ عَنْهُ فَقَالَ ‏\"‏ مَا يَسُرُّكَ أَنْ لاَ تَأْتِيَ بَابًا مِنْ أَبْوَابِ الْجَنَّةِ إِلاَّ وَجَدْتَهُ عِنْدَهُ يَسْعَى يَفْتَحُ لَكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 53,
        "matchingEnglishURN": 1070520,
        "last_updated": null
    },
    {
        "arabicURN": 1118790,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "23.00",
        "hadithNumber": "1871",
        "bookName": " كتاب الجنائز",
        "babName": " باب ثَوَابِ مَنْ صَبَرَ وَاحْتَسَبَ ‏‏ ",
        "hadithText": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، قَالَ أَنْبَأَنَا عُمَرُ بْنُ سَعِيدِ بْنِ أَبِي حُسَيْنٍ، أَنَّ عَمْرَو بْنَ شُعَيْبٍ، كَتَبَ إِلَى عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي حُسَيْنٍ يُعَزِّيهِ بِابْنٍ لَهُ هَلَكَ وَذَكَرَ فِي كِتَابِهِ أَنَّهُ سَمِعَ أَبَاهُ يُحَدِّثُ عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ لاَ يَرْضَى لِعَبْدِهِ الْمُؤْمِنِ إِذَا ذَهَبَ بِصَفِيِّهِ مِنْ أَهْلِ الأَرْضِ فَصَبَرَ وَاحْتَسَبَ وَقَالَ مَا أُمِرَ بِهِ بِثَوَابٍ دُونَ الْجَنَّةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 54,
        "matchingEnglishURN": 1070530,
        "last_updated": null
    },
    {
        "arabicURN": 1118800,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "24.00",
        "hadithNumber": "1872",
        "bookName": " كتاب الجنائز",
        "babName": " باب ثَوَابِ مَنِ احْتَسَبَ ثَلاَثَةً مِنْ صُلْبِهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي عَمْرٌو، قَالَ حَدَّثَنِي بُكَيْرُ بْنُ عَبْدِ اللَّهِ، عَنْ عِمْرَانَ بْنِ نَافِعٍ، عَنْ حَفْصِ بْنِ عُبَيْدِ اللَّهِ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنِ احْتَسَبَ ثَلاَثَةً مِنْ صُلْبِهِ دَخَلَ الْجَنَّةَ ‏\"‏ ‏.‏ فَقَامَتِ امْرَأَةٌ فَقَالَتْ أَوِ اثْنَانِ قَالَ ‏\"‏ أَوِ اثْنَانِ ‏\"‏ ‏.‏ قَالَتِ الْمَرْأَةُ يَا لَيْتَنِي قُلْتُ وَاحِدًا ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 55,
        "matchingEnglishURN": 1070540,
        "last_updated": null
    },
    {
        "arabicURN": 1118810,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "25.00",
        "hadithNumber": "1873",
        "bookName": " كتاب الجنائز",
        "babName": " باب مَنْ يُتَوَفَّى لَهُ ثَلاَثَةٌ ‏‏ ",
        "hadithText": "أَخْبَرَنَا يُوسُفُ بْنُ حَمَّادٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْ مُسْلِمٍ يُتَوَفَّى لَهُ ثَلاَثَةٌ مِنَ الْوَلَدِ لَمْ يَبْلُغُوا الْحِنْثَ إِلاَّ أَدْخَلَهُ اللَّهُ الْجَنَّةَ بِفَضْلِ رَحْمَتِهِ إِيَّاهُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 56,
        "matchingEnglishURN": 1070550,
        "last_updated": null
    },
    {
        "arabicURN": 1118820,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "25.00",
        "hadithNumber": "1874",
        "bookName": " كتاب الجنائز",
        "babName": " باب مَنْ يُتَوَفَّى لَهُ ثَلاَثَةٌ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ يُونُسَ، عَنِ الْحَسَنِ، عَنْ صَعْصَعَةَ بْنِ مُعَاوِيَةَ، قَالَ لَقِيتُ أَبَا ذَرٍّ قُلْتُ حَدِّثْنِي ‏.‏ قَالَ نَعَمْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْ مُسْلِمَيْنِ يَمُوتُ بَيْنَهُمَا ثَلاَثَةُ أَوْلاَدٍ لَمْ يَبْلُغُوا الْحِنْثَ إِلاَّ غَفَرَ اللَّهُ لَهُمَا بِفَضْلِ رَحْمَتِهِ إِيَّاهُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 57,
        "matchingEnglishURN": 1070560,
        "last_updated": null
    },
    {
        "arabicURN": 1118830,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "25.00",
        "hadithNumber": "1875",
        "bookName": " كتاب الجنائز",
        "babName": " باب مَنْ يُتَوَفَّى لَهُ ثَلاَثَةٌ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَمُوتُ لأَحَدٍ مِنَ الْمُسْلِمِينَ ثَلاَثَةٌ مِنَ الْوَلَدِ فَتَمَسَّهُ النَّارُ إِلاَّ تَحِلَّةَ الْقَسَمِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 58,
        "matchingEnglishURN": 1070570,
        "last_updated": null
    },
    {
        "arabicURN": 1118840,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "25.00",
        "hadithNumber": "1876",
        "bookName": " كتاب الجنائز",
        "babName": " باب مَنْ يُتَوَفَّى لَهُ ثَلاَثَةٌ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ ابْنِ عُلَيَّةَ، وَعَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا إِسْحَاقُ، - وَهُوَ الأَزْرَقُ - عَنْ عَوْفٍ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَا مِنْ مُسْلِمَيْنِ يَمُوتُ بَيْنَهُمَا ثَلاَثَةُ أَوْلاَدٍ لَمْ يَبْلُغُوا الْحِنْثَ إِلاَّ أَدْخَلَهُمَا اللَّهُ بِفَضْلِ رَحْمَتِهِ إِيَّاهُمُ الْجَنَّةَ ‏\"‏ ‏.‏ قَالَ ‏\"‏ يُقَالُ لَهُمُ ادْخُلُوا الْجَنَّةَ فَيَقُولُونَ حَتَّى يَدْخُلَ آبَاؤُنَا فَيُقَالُ ادْخُلُوا الْجَنَّةَ أَنْتُمْ وَآبَاؤُكُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 59,
        "matchingEnglishURN": 1070580,
        "last_updated": null
    },
    {
        "arabicURN": 1118850,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "26.00",
        "hadithNumber": "1877",
        "bookName": " كتاب الجنائز",
        "babName": " باب مَنْ قَدَّمَ ثَلاَثَةً ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ، قَالَ أَنْبَأَنَا جَرِيرٌ، قَالَ حَدَّثَنِي طَلْقُ بْنُ مُعَاوِيَةَ، وَحَفْصُ بْنُ غِيَاثٍ، قَالَ حَدَّثَنِي جَدِّي، طَلْقُ بْنُ مُعَاوِيَةَ عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِابْنٍ لَهَا يَشْتَكِي فَقَالَتْ يَا رَسُولَ اللَّهِ أَخَافُ عَلَيْهِ وَقَدْ قَدَّمْتُ ثَلاَثَةً ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَقَدِ احْتَظَرْتِ بِحِظَارٍ شَدِيدٍ مِنَ النَّارِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 60,
        "matchingEnglishURN": 1070590,
        "last_updated": null
    },
    {
        "arabicURN": 1118860,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "27.00",
        "hadithNumber": "1878",
        "bookName": " كتاب الجنائز",
        "babName": " باب النَّعْىِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ، قَالَ أَنْبَأَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَعَى زَيْدًا وَجَعْفَرًا قَبْلَ أَنْ يَجِيءَ خَبَرُهُمْ فَنَعَاهُمْ وَعَيْنَاهُ تَذْرِفَانِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 61,
        "matchingEnglishURN": 1070600,
        "last_updated": null
    },
    {
        "arabicURN": 1118870,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "27.00",
        "hadithNumber": "1879",
        "bookName": " كتاب الجنائز",
        "babName": " باب النَّعْىِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا يَعْقُوبُ، قَالَ حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، وَابْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُمَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَعَى لَهُمُ النَّجَاشِيَّ صَاحِبَ الْحَبَشَةِ الْيَوْمَ الَّذِي مَاتَ فِيهِ وَقَالَ ‏\"‏ اسْتَغْفِرُوا لأَخِيكُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 62,
        "matchingEnglishURN": 1070610,
        "last_updated": null
    },
    {
        "arabicURN": 1118880,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "27.00",
        "hadithNumber": "1880",
        "bookName": " كتاب الجنائز",
        "babName": " باب النَّعْىِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ فَضَالَةَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، هُوَ ابْنُ يَزِيدَ الْمُقْرِئُ ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْمُقْرِئُ، قَالَ حَدَّثَنَا أَبِي قَالَ، سَعِيدٌ حَدَّثَنِي رَبِيعَةُ بْنُ سَيْفٍ الْمَعَافِرِيُّ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ بَيْنَمَا نَحْنُ نَسِيرُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ بَصُرَ بِامْرَأَةٍ لاَ تَظُنُّ أَنَّهُ عَرَفَهَا فَلَمَّا تَوَسَّطَ الطَّرِيقَ وَقَفَ حَتَّى انْتَهَتْ إِلَيْهِ فَإِذَا فَاطِمَةُ بِنْتُ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ لَهَا ‏\"‏ مَا أَخْرَجَكِ مِنْ بَيْتِكِ يَا فَاطِمَةُ ‏\"‏ ‏.‏ قَالَتْ أَتَيْتُ أَهْلَ هَذَا الْمَيِّتِ فَتَرَحَّمْتُ إِلَيْهِمْ وَعَزَّيْتُهُمْ بِمَيِّتِهِمْ ‏.‏ قَالَ ‏\"‏ لَعَلَّكِ بَلَغْتِ مَعَهُمُ الْكُدَى ‏\"‏ ‏.‏ قَالَتْ مَعَاذَ اللَّهِ أَنْ أَكُونَ بَلَغْتُهَا وَقَدْ سَمِعْتُكَ تَذْكُرُ فِي ذَلِكَ مَا تَذْكُرُ ‏.‏ فَقَالَ لَهَا ‏\"‏ لَوْ بَلَغْتِهَا مَعَهُمْ مَا رَأَيْتِ الْجَنَّةَ حَتَّى يَرَاهَا جَدُّ أَبِيكِ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ رَبِيعَةُ ضَعِيفٌ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 63,
        "matchingEnglishURN": 1070620,
        "last_updated": null
    },
    {
        "arabicURN": 1118890,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "28.00",
        "hadithNumber": "1881",
        "bookName": " كتاب الجنائز",
        "babName": " باب غَسْلِ الْمَيِّتِ بِالْمَاءِ وَالسِّدْرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، أَنَّ أُمَّ عَطِيَّةَ الأَنْصَارِيَّةَ، قَالَتْ دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ تُوُفِّيَتِ ابْنَتُهُ فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكِ إِنْ رَأَيْتُنَّ ذَلِكِ بِمَاءٍ وَسِدْرٍ وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏ ‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَعْطَانَا حَقْوَهُ وَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 64,
        "matchingEnglishURN": 1070630,
        "last_updated": null
    },
    {
        "arabicURN": 1118900,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "29.00",
        "hadithNumber": "1882",
        "bookName": " كتاب الجنائز",
        "babName": " باب غَسْلِ الْمَيِّتِ بِالْحَمِيمِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْحَسَنِ، مَوْلَى أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ عَنْ أُمِّ قَيْسٍ، قَالَتْ تُوُفِّيَ ابْنِي فَجَزِعْتُ عَلَيْهِ فَقُلْتُ لِلَّذِي يَغْسِلُهُ لاَ تَغْسِلِ ابْنِي بِالْمَاءِ الْبَارِدِ فَتَقْتُلَهُ ‏.‏ فَانْطَلَقَ عُكَّاشَةُ بْنُ مِحْصَنٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ بِقَوْلِهَا فَتَبَسَّمَ ثُمَّ قَالَ ‏\"‏ مَا قَالَتْ طَالَ عُمْرُهَا ‏\"‏ ‏.‏ فَلاَ نَعْلَمُ امْرَأَةً عُمِرَتْ مَا عُمِرَتْ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 65,
        "matchingEnglishURN": 1070640,
        "last_updated": null
    },
    {
        "arabicURN": 1118910,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "30.00",
        "hadithNumber": "1883",
        "bookName": " كتاب الجنائز",
        "babName": " باب نَقْضِ رَأْسِ الْمَيِّتِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حَجَّاجٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَيُّوبُ سَمِعْتُ حَفْصَةَ، تَقُولُ حَدَّثَتْنَا أُمُّ عَطِيَّةَ، أَنَّهُنَّ جَعَلْنَ رَأْسَ ابْنَةِ النَّبِيِّ صلى الله عليه وسلم ثَلاَثَةَ قُرُونٍ ‏.‏ قُلْتُ نَقَضْنَهُ وَجَعَلْنَهُ ثَلاَثَةَ قُرُونٍ قَالَتْ نَعَمْ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 66,
        "matchingEnglishURN": 1070650,
        "last_updated": null
    },
    {
        "arabicURN": 1118920,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "31.00",
        "hadithNumber": "1884",
        "bookName": " كتاب الجنائز",
        "babName": " باب مَيَامِنِ الْمَيِّتِ وَمَوَاضِعِ الْوُضُوءِ مِنْهُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ خَالِدٍ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ فِي غُسْلِ ابْنَتِهِ ‏\"‏ ابْدَأْنَ بِمَيَامِنِهَا وَمَوَاضِعِ الْوُضُوءِ مِنْهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 67,
        "matchingEnglishURN": 1070660,
        "last_updated": null
    },
    {
        "arabicURN": 1118930,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "32.00",
        "hadithNumber": "1885",
        "bookName": " كتاب الجنائز",
        "babName": " باب غَسْلِ الْمَيِّتِ وَتْرًا ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا هِشَامٌ، قَالَ حَدَّثَتْنَا حَفْصَةُ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ مَاتَتْ إِحْدَى بَنَاتِ النَّبِيِّ صلى الله عليه وسلم فَأَرْسَلَ إِلَيْنَا فَقَالَ ‏\"‏ اغْسِلْنَهَا بِمَاءٍ وَسِدْرٍ وَاغْسِلْنَهَا وَتْرًا ثَلاَثًا أَوْ خَمْسًا أَوْ سَبْعًا إِنْ رَأَيْتُنَّ ذَلِكِ وَاجْعَلْنَ فِي الآخِرَةِ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏ ‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَلْقَى إِلَيْنَا حَقْوَهُ وَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏ ‏.‏ وَمَشَطْنَاهَا ثَلاَثَةَ قُرُونٍ وَأَلْقَيْنَاهَا مِنْ خَلْفِهَا ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 68,
        "matchingEnglishURN": 1070670,
        "last_updated": null
    },
    {
        "arabicURN": 1118940,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "33.00",
        "hadithNumber": "1886",
        "bookName": " كتاب الجنائز",
        "babName": " باب غَسْلِ الْمَيِّتِ أَكْثَرَ مِنْ خَمْسٍ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، عَنْ يَزِيدَ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَنَحْنُ نَغْسِلُ ابْنَتَهُ فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكِ إِنْ رَأَيْتُنَّ ذَلِكِ بِمَاءٍ وَسِدْرٍ وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏ ‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَلْقَى إِلَيْنَا حَقْوَهُ وَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 69,
        "matchingEnglishURN": 1070680,
        "last_updated": null
    },
    {
        "arabicURN": 1118950,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "34.00",
        "hadithNumber": "1887",
        "bookName": " كتاب الجنائز",
        "babName": " باب غَسْلِ الْمَيِّتِ أَكْثَرَ مِنْ سَبْعَةٍ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَمَّادٌ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ تُوُفِّيَتْ إِحْدَى بَنَاتِ النَّبِيِّ صلى الله عليه وسلم فَأَرْسَلَ إِلَيْنَا فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكِ إِنْ رَأَيْتُنَّ بِمَاءٍ وَسِدْرٍ وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏ ‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَلْقَى إِلَيْنَا حَقْوَهُ وَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 70,
        "matchingEnglishURN": 1070690,
        "last_updated": null
    },
    {
        "arabicURN": 1118960,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "34.00",
        "hadithNumber": "1888",
        "bookName": " كتاب الجنائز",
        "babName": " باب غَسْلِ الْمَيِّتِ أَكْثَرَ مِنْ سَبْعَةٍ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، نَحْوَهُ غَيْرَ أَنَّهُ قَالَ ‏\"‏ ثَلاَثًا أَوْ خَمْسًا أَوْ سَبْعًا أَوْ أَكْثَرَ مِنْ ذَلِكِ إِنْ رَأَيْتُنَّ ذَلِكِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 71,
        "matchingEnglishURN": 1070700,
        "last_updated": null
    },
    {
        "arabicURN": 1118970,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "34.00",
        "hadithNumber": "1889",
        "bookName": " كتاب الجنائز",
        "babName": " باب غَسْلِ الْمَيِّتِ أَكْثَرَ مِنْ سَبْعَةٍ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا بِشْرٌ، عَنْ سَلَمَةَ بْنِ عَلْقَمَةَ، عَنْ مُحَمَّدٍ، عَنْ بَعْضِ، إِخْوَتِهِ عَنْ أُمِّ عَطِيَّةَ، قَالَتْ تُوُفِّيَتِ ابْنَةٌ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَأَمَرَنَا بِغَسْلِهَا فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ سَبْعًا أَوْ أَكْثَرَ مِنْ ذَلِكِ إِنْ رَأَيْتُنَّ ‏\"‏ ‏.‏ قَالَتْ قُلْتُ وِتْرًا قَالَ ‏\"‏ نَعَمْ وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏ ‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَعْطَانَا حَقْوَهُ وَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 72,
        "matchingEnglishURN": 1070710,
        "last_updated": null
    },
    {
        "arabicURN": 1118980,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "35.00",
        "hadithNumber": "1890",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْكَافُورِ فِي غَسْلِ الْمَيِّتِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ أَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَنَحْنُ نَغْسِلُ ابْنَتَهُ فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكِ إِنْ رَأَيْتُنَّ ذَلِكِ بِمَاءٍ وَسِدْرٍ وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏ ‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَلْقَى إِلَيْنَا حَقْوَهُ وَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏ ‏.‏ قَالَ أَوْ قَالَتْ حَفْصَةُ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ سَبْعًا ‏.‏ قَالَ وَقَالَتْ أُمُّ عَطِيَّةَ مَشَطْنَاهَا ثَلاَثَةَ قُرُونٍ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 73,
        "matchingEnglishURN": 1070720,
        "last_updated": null
    },
    {
        "arabicURN": 1118990,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "35.00",
        "hadithNumber": "1891",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْكَافُورِ فِي غَسْلِ الْمَيِّتِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، قَالَ أَخْبَرَتْنِي حَفْصَةُ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ وَجَعَلْنَا رَأْسَهَا ثَلاَثَةَ قُرُونٍ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 74,
        "matchingEnglishURN": 1070730,
        "last_updated": null
    },
    {
        "arabicURN": 1119000,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "35.00",
        "hadithNumber": "1892",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْكَافُورِ فِي غَسْلِ الْمَيِّتِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، وَقَالَتْ، حَفْصَةُ عَنْ أُمِّ عَطِيَّةَ، وَجَعَلْنَا، رَأْسَهَا ثَلاَثَةَ قُرُونٍ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 75,
        "matchingEnglishURN": 1070740,
        "last_updated": null
    },
    {
        "arabicURN": 1119010,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "36.00",
        "hadithNumber": "1893",
        "bookName": " كتاب الجنائز",
        "babName": " باب الإِشْعَارِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حَجَّاجٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي أَيُّوبُ بْنُ أَبِي تَمِيمَةَ، أَنَّهُ سَمِعَ مُحَمَّدَ بْنَ سِيرِينَ، يَقُولُ كَانَتْ أُمُّ عَطِيَّةَ امْرَأَةٌ مِنَ الأَنْصَارِ قَدِمَتْ تُبَادِرُ ابْنًا لَهَا فَلَمْ تُدْرِكْهُ حَدَّثَتْنَا قَالَتْ دَخَلَ النَّبِيُّ صلى الله عليه وسلم عَلَيْنَا وَنَحْنُ نَغْسِلُ ابْنَتَهُ فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ بِمَاءٍ وَسِدْرٍ وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏ ‏.‏ فَلَمَّا فَرَغْنَا أَلْقَى إِلَيْنَا حَقْوَهُ وَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏ ‏.‏ وَلَمْ يَزِدْ عَلَى ذَلِكَ ‏.‏ قَالَ لاَ أَدْرِي أَىُّ بَنَاتِهِ ‏.‏ قَالَ قُلْتُ مَا قَوْلُهُ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏ ‏.‏ أَتُؤَزَّرُ بِهِ قَالَ لاَ أُرَاهُ إِلاَّ أَنْ يَقُولَ الْفُفْنَهَا فِيهِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 76,
        "matchingEnglishURN": 1070750,
        "last_updated": null
    },
    {
        "arabicURN": 1119020,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "36.00",
        "hadithNumber": "1894",
        "bookName": " كتاب الجنائز",
        "babName": " باب الإِشْعَارِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ النَّسَائِيُّ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ تُوُفِّيَ إِحْدَى بَنَاتِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكِ إِنْ رَأَيْتُنَّ ذَلِكِ وَاغْسِلْنَهَا بِالسِّدْرِ وَالْمَاءِ وَاجْعَلْنَ فِي آخِرِ ذَلِكِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏ ‏.‏ قَالَتْ فَآذَنَّاهُ فَأَلْقَى إِلَيْنَا حَقْوَهُ فَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 77,
        "matchingEnglishURN": 1070760,
        "last_updated": null
    },
    {
        "arabicURN": 1119030,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "37.00",
        "hadithNumber": "1895",
        "bookName": " كتاب الجنائز",
        "babName": " باب الأَمْرِ بِتَحْسِينِ الْكَفَنِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ الرَّقِّيُّ الْقَطَّانُ، وَيُوسُفُ بْنُ سَعِيدٍ، - وَاللَّفْظُ لَهُ - قَالَ أَنْبَأَنَا حَجَّاجٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرًا، يَقُولُ خَطَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَذَكَرَ رَجُلاً مِنْ أَصْحَابِهِ مَاتَ فَقُبِرَ لَيْلاً وَكُفِّنَ فِي كَفَنٍ غَيْرِ طَائِلٍ فَزَجَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُقْبَرَ إِنْسَانٌ لَيْلاً إِلاَّ أَنْ يُضْطَرَّ إِلَى ذَلِكَ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا وَلِيَ أَحَدُكُمْ أَخَاهُ فَلْيُحَسِّنْ كَفَنَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 78,
        "matchingEnglishURN": 1070770,
        "last_updated": null
    },
    {
        "arabicURN": 1119040,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "38.00",
        "hadithNumber": "1896",
        "bookName": " كتاب الجنائز",
        "babName": " باب أَىُّ الْكَفَنِ خَيْرٌ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ أَنْبَأَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ سَمِعْتُ سَعِيدَ بْنَ أَبِي عَرُوبَةَ، يُحَدِّثُ عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمُهَلَّبِ، عَنْ سَمُرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الْبَسُوا مِنْ ثِيَابِكُمُ الْبَيَاضَ فَإِنَّهَا أَطْهَرُ وَأَطْيَبُ وَكَفِّنُوا فِيهَا مَوْتَاكُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 79,
        "matchingEnglishURN": 1070780,
        "last_updated": null
    },
    {
        "arabicURN": 1119050,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "39.00",
        "hadithNumber": "1897",
        "bookName": " كتاب الجنائز",
        "babName": " باب كَفَنِ النَّبِيِّ صلى الله عليه وسلم ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ، قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ كُفِّنَ النَّبِيُّ صلى الله عليه وسلم فِي ثَلاَثَةِ أَثْوَابٍ سُحُولِيَّةٍ بِيضٍ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 80,
        "matchingEnglishURN": 1070790,
        "last_updated": null
    },
    {
        "arabicURN": 1119060,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "39.00",
        "hadithNumber": "1898",
        "bookName": " كتاب الجنائز",
        "babName": " باب كَفَنِ النَّبِيِّ صلى الله عليه وسلم ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كُفِّنَ فِي ثَلاَثَةِ أَثْوَابٍ بِيضٍ سُحُولِيَّةٍ لَيْسَ فِيهَا قَمِيصٌ وَلاَ عِمَامَةٌ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 81,
        "matchingEnglishURN": 1070800,
        "last_updated": null
    },
    {
        "arabicURN": 1119070,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "39.00",
        "hadithNumber": "1899",
        "bookName": " كتاب الجنائز",
        "babName": " باب كَفَنِ النَّبِيِّ صلى الله عليه وسلم ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَفْصٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كُفِّنَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ثَلاَثَةِ أَثْوَابٍ بِيضٍ يَمَانِيَةٍ كُرْسُفٍ لَيْسَ فِيهَا قَمِيصٌ وَلاَ عِمَامَةٌ فَذُكِرَ لِعَائِشَةَ قَوْلُهُمْ فِي ثَوْبَيْنِ وَبُرْدٍ مِنْ حِبَرَةٍ فَقَالَتْ قَدْ أُتِيَ بِالْبُرْدِ وَلَكِنَّهُمْ رَدُّوهُ وَلَمْ يُكَفِّنُوهُ فِيهِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 82,
        "matchingEnglishURN": 1070810,
        "last_updated": null
    },
    {
        "arabicURN": 1119080,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "40.00",
        "hadithNumber": "1900",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْقَمِيصِ فِي الْكَفَنِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، قَالَ حَدَّثَنَا نَافِعٌ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ لَمَّا مَاتَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ جَاءَ ابْنُهُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ أَعْطِنِي قَمِيصَكَ حَتَّى أُكَفِّنَهُ فِيهِ وَصَلِّ عَلَيْهِ وَاسْتَغْفِرْ لَهُ ‏.‏ فَأَعْطَاهُ قَمِيصَهُ ثُمَّ قَالَ ‏\"‏ إِذَا فَرَغْتُمْ فَآذِنُونِي أُصَلِّي عَلَيْهِ ‏\"‏ ‏.‏ فَجَذَبَهُ عُمَرُ وَقَالَ قَدْ نَهَاكَ اللَّهُ أَنْ تُصَلِّيَ عَلَى الْمُنَافِقِينَ ‏.‏ فَقَالَ ‏\"‏ أَنَا بَيْنَ خِيرَتَيْنِ ‏\"‏ ‏.‏ قَالَ ‏<A id=\"q1\" name=\"q1\" href=\"javascript:openquran(8,80,80)\"><c_q1>{‏ اسْتَغْفِرْ لَهُمْ أَوْ لاَ تَسْتَغْفِرْ لَهُمْ ‏}</c_q1></a>‏ فَصَلَّى عَلَيْهِ فَأَنْزَلَ اللَّهُ تَعَالَى ‏<A id=\"q2\" name=\"q2\" href=\"javascript:openquran(8,84,84)\"><c_q2>{‏ وَلاَ تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا وَلاَ تَقُمْ عَلَى قَبْرِهِ ‏}</c_q2></a>‏ فَتَرَكَ الصَّلاَةَ عَلَيْهِمْ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 83,
        "matchingEnglishURN": 1070820,
        "last_updated": null
    },
    {
        "arabicURN": 1119090,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "40.00",
        "hadithNumber": "1901",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْقَمِيصِ فِي الْكَفَنِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلاَءِ بْنِ عَبْدِ الْجَبَّارِ، عَنْ سُفْيَانَ، عَنْ عَمْرٍو، قَالَ سَمِعْتُ جَابِرًا، يَقُولُ أَتَى النَّبِيُّ صلى الله عليه وسلم قَبْرَ عَبْدِ اللَّهِ بْنِ أُبَىٍّ وَقَدْ وُضِعَ فِي حُفْرَتِهِ فَوَقَفَ عَلَيْهِ فَأَمَرَ بِهِ فَأُخْرِجَ لَهُ فَوَضَعَهُ عَلَى رُكْبَتَيْهِ وَأَلْبَسَهُ قَمِيصَهُ وَنَفَثَ عَلَيْهِ مِنْ رِيقِهِ وَاللَّهُ تَعَالَى أَعْلَمُ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 84,
        "matchingEnglishURN": 1070830,
        "last_updated": null
    },
    {
        "arabicURN": 1119100,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "40.00",
        "hadithNumber": "1902",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْقَمِيصِ فِي الْكَفَنِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ الزُّهْرِيُّ الْبَصْرِيُّ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، سَمِعَ جَابِرًا، يَقُولُ وَكَانَ الْعَبَّاسُ بِالْمَدِينَةِ فَطَلَبَتِ الأَنْصَارُ ثَوْبًا يَكْسُونَهُ فَلَمْ يَجِدُوا قَمِيصًا يَصْلُحُ عَلَيْهِ إِلاَّ قَمِيصَ عَبْدِ اللَّهِ بْنِ أُبَىٍّ فَكَسَوْهُ إِيَّاهُ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 85,
        "matchingEnglishURN": 1070840,
        "last_updated": null
    },
    {
        "arabicURN": 1119110,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "40.00",
        "hadithNumber": "1903",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْقَمِيصِ فِي الْكَفَنِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنِ الأَعْمَشِ، ح وَأَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، قَالَ سَمِعْتُ الأَعْمَشَ، قَالَ سَمِعْتُ شَقِيقًا، قَالَ حَدَّثَنَا خَبَّابٌ، قَالَ هَاجَرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم نَبْتَغِي وَجْهَ اللَّهِ تَعَالَى فَوَجَبَ أَجْرُنَا عَلَى اللَّهِ فَمِنَّا مَنْ مَاتَ لَمْ يَأْكُلْ مِنْ أَجْرِهِ شَيْئًا مِنْهُمْ مُصْعَبُ بْنُ عُمَيْرٍ قُتِلَ يَوْمَ أُحُدٍ فَلَمْ نَجِدْ شَيْئًا نُكَفِّنُهُ فِيهِ إِلاَّ نَمِرَةً كُنَّا إِذَا غَطَّيْنَا رَأْسَهُ خَرَجَتْ رِجْلاَهُ وَإِذَا غَطَّيْنَا بِهَا رِجْلَيْهِ خَرَجَتْ رَأْسُهُ فَأَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ نُغَطِّيَ بِهَا رَأْسَهُ وَنَجْعَلَ عَلَى رِجْلَيْهِ إِذْخِرًا وَمِنَّا مَنْ أَيْنَعَتْ لَهُ ثَمَرَتُهُ فَهُوَ يَهْدِبُهَا ‏.‏ وَاللَّفْظُ لإِسْمَاعِيلَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 86,
        "matchingEnglishURN": 1070850,
        "last_updated": null
    },
    {
        "arabicURN": 1119120,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "41.00",
        "hadithNumber": "1904",
        "bookName": " كتاب الجنائز",
        "babName": " باب كَيْفَ يُكَفَّنُ الْمُحْرِمُ إِذَا مَاتَ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عُتْبَةُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا يُونُسُ بْنُ نَافِعٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اغْسِلُوا الْمُحْرِمَ فِي ثَوْبَيْهِ اللَّذَيْنِ أَحْرَمَ فِيهِمَا وَاغْسِلُوهُ بِمَاءٍ وَسِدْرٍ وَكَفِّنُوهُ فِي ثَوْبَيْهِ وَلاَ تُمِسُّوهُ بِطِيبٍ وَلاَ تُخَمِّرُوا رَأْسَهُ فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ مُحْرِمًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 87,
        "matchingEnglishURN": 1070860,
        "last_updated": null
    },
    {
        "arabicURN": 1119130,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "42.00",
        "hadithNumber": "1905",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْمِسْكِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، وَشَبَابَةُ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ خُلَيْدِ بْنِ جَعْفَرٍ، سَمِعَ أَبَا نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَطْيَبُ الطِّيبِ الْمِسْكُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 88,
        "matchingEnglishURN": 1070870,
        "last_updated": null
    },
    {
        "arabicURN": 1119140,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "42.00",
        "hadithNumber": "1906",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْمِسْكِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ الْحُسَيْنِ الدِّرْهَمِيُّ، قَالَ حَدَّثَنَا أُمَيَّةُ بْنُ خَالِدٍ، عَنِ الْمُسْتَمِرِّ بْنِ الرَّيَّانِ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مِنْ خَيْرِ طِيبِكُمُ الْمِسْكُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 89,
        "matchingEnglishURN": 1070880,
        "last_updated": null
    },
    {
        "arabicURN": 1119150,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "43.00",
        "hadithNumber": "1907",
        "bookName": " كتاب الجنائز",
        "babName": " باب الإِذْنِ بِالْجَنَازَةِ ‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، فِي حَدِيثِهِ عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، أَنَّهُ أَخْبَرَهُ أَنَّ مِسْكِينَةً مَرِضَتْ فَأُخْبِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَرَضِهَا وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعُودُ الْمَسَاكِينَ وَيَسْأَلُ عَنْهُمْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا مَاتَتْ فَآذِنُونِي ‏\"‏ ‏.‏ فَأُخْرِجَ بِجَنَازَتِهَا لَيْلاً وَكَرِهُوا أَنْ يُوقِظُوا رَسُولَ اللَّهِ صلى الله عليه وسلم فَلَمَّا أَصْبَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم أُخْبِرَ بِالَّذِي كَانَ مِنْهَا فَقَالَ ‏\"‏ أَلَمْ آمُرْكُمْ أَنْ تُؤْذِنُونِي بِهَا ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ كَرِهْنَا أَنْ نُوقِظَكَ لَيْلاً ‏.‏ فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى صَفَّ بِالنَّاسِ عَلَى قَبْرِهَا وَكَبَّرَ أَرْبَعَ تَكْبِيرَاتٍ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 90,
        "matchingEnglishURN": 1070890,
        "last_updated": null
    },
    {
        "arabicURN": 1119160,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "44.00",
        "hadithNumber": "1908",
        "bookName": " كتاب الجنائز",
        "babName": " باب السُّرْعَةِ بِالْجَنَازَةِ ‏ ",
        "hadithText": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ مِهْرَانَ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِذَا وُضِعَ الرَّجُلُ الصَّالِحُ عَلَى سَرِيرِهِ قَالَ قَدِّمُونِي قَدِّمُونِي وَإِذَا وُضِعَ الرَّجُلُ - يَعْنِي السُّوءَ - عَلَى سَرِيرِهِ قَالَ يَا وَيْلِي أَيْنَ تَذْهَبُونَ بِي ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 91,
        "matchingEnglishURN": 1070900,
        "last_updated": null
    },
    {
        "arabicURN": 1119170,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "44.00",
        "hadithNumber": "1909",
        "bookName": " كتاب الجنائز",
        "babName": " باب السُّرْعَةِ بِالْجَنَازَةِ ‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا وُضِعَتِ الْجَنَازَةُ فَاحْتَمَلَهَا الرِّجَالُ عَلَى أَعْنَاقِهِمْ فَإِنْ كَانَتْ صَالِحَةً قَالَتْ قَدِّمُونِي قَدِّمُونِي وَإِنْ كَانَتْ غَيْرَ صَالِحَةٍ قَالَتْ يَا وَيْلَهَا إِلَى أَيْنَ تَذْهَبُونَ بِهَا يَسْمَعُ صَوْتَهَا كُلُّ شَىْءٍ إِلاَّ الإِنْسَانَ وَلَوْ سَمِعَهَا الإِنْسَانُ لَصَعِقَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 92,
        "matchingEnglishURN": 1070910,
        "last_updated": null
    },
    {
        "arabicURN": 1119180,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "44.00",
        "hadithNumber": "1910",
        "bookName": " كتاب الجنائز",
        "babName": " باب السُّرْعَةِ بِالْجَنَازَةِ ‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ أَسْرِعُوا بِالْجَنَازَةِ فَإِنْ تَكُ صَالِحَةً فَخَيْرٌ تُقَدِّمُونَهَا إِلَيْهِ وَإِنْ تَكُ غَيْرَ ذَلِكَ فَشَرٌّ تَضَعُونَهُ عَنْ رِقَابِكُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 93,
        "matchingEnglishURN": 1070920,
        "last_updated": null
    },
    {
        "arabicURN": 1119190,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "44.00",
        "hadithNumber": "1911",
        "bookName": " كتاب الجنائز",
        "babName": " باب السُّرْعَةِ بِالْجَنَازَةِ ‏ ",
        "hadithText": "أَخْبَرَنَا سُوَيْدٌ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي أَبُو أُمَامَةَ بْنُ سَهْلٍ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ أَسْرِعُوا بِالْجَنَازَةِ فَإِنْ كَانَتْ صَالِحَةً قَدَّمْتُمُوهَا إِلَى الْخَيْرِ وَإِنْ كَانَتْ غَيْرَ ذَلِكَ كَانَتْ شَرًّا تَضَعُونَهُ عَنْ رِقَابِكُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 94,
        "matchingEnglishURN": 1070930,
        "last_updated": null
    },
    {
        "arabicURN": 1119200,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "44.00",
        "hadithNumber": "1912",
        "bookName": " كتاب الجنائز",
        "babName": " باب السُّرْعَةِ بِالْجَنَازَةِ ‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ أَنْبَأَنَا عُيَيْنَةُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ جَوْشَنٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، شَهِدْتُ جَنَازَةَ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ وَخَرَجَ زِيَادٌ يَمْشِي بَيْنَ يَدَىِ السَّرِيرِ فَجَعَلَ رِجَالٌ مِنْ أَهْلِ عَبْدِ الرَّحْمَنِ وَمَوَالِيهِمْ يَسْتَقْبِلُونَ السَّرِيرَ وَيَمْشُونَ عَلَى أَعْقَابِهِمْ وَيَقُولُونَ رُوَيْدًا رُوَيْدًا بَارَكَ اللَّهُ فِيكُمْ ‏.‏ فَكَانُوا يَدِبُّونَ دَبِيبًا حَتَّى إِذَا كُنَّا بِبَعْضِ طَرِيقِ الْمِرْبَدِ لَحِقَنَا أَبُو بَكْرَةَ عَلَى بَغْلَةٍ فَلَمَّا رَأَى الَّذِي يَصْنَعُونَ حَمَلَ عَلَيْهِمْ بِبَغْلَتِهِ وَأَهْوَى إِلَيْهِمْ بِالسَّوْطِ وَقَالَ خَلُّوا فَوَالَّذِي أَكْرَمَ وَجْهَ أَبِي الْقَاسِمِ صلى الله عليه وسلم لَقَدْ رَأَيْتُنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَإِنَّا لَنَكَادُ نَرْمُلُ بِهَا رَمْلاً ‏.‏ فَانْبَسَطَ الْقَوْمُ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 95,
        "matchingEnglishURN": 1070940,
        "last_updated": null
    },
    {
        "arabicURN": 1119210,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "44.00",
        "hadithNumber": "1913",
        "bookName": " كتاب الجنائز",
        "babName": " باب السُّرْعَةِ بِالْجَنَازَةِ ‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، عَنْ إِسْمَاعِيلَ، وَهُشَيْمٍ، عَنْ عُيَيْنَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي بَكْرَةَ، قَالَ لَقَدْ رَأَيْتُنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَإِنَّا لَنَكَادُ نَرْمُلُ بِهَا رَمَلاً ‏.‏ وَاللَّفْظُ حَدِيثُ هُشَيْمٍ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 96,
        "matchingEnglishURN": 1070950,
        "last_updated": null
    },
    {
        "arabicURN": 1119220,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "44.00",
        "hadithNumber": "1914",
        "bookName": " كتاب الجنائز",
        "babName": " باب السُّرْعَةِ بِالْجَنَازَةِ ‏ ",
        "hadithText": "أَخْبَرَنَا يَحْيَى بْنُ دُرُسْتَ، قَالَ حَدَّثَنَا أَبُو إِسْمَاعِيلَ، عَنْ يَحْيَى، أَنَّ أَبَا سَلَمَةَ، حَدَّثَهُ عَنْ أَبِي سَعِيدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا مَرَّتْ بِكُمْ جَنَازَةٌ فَقُومُوا فَمَنْ تَبِعَهَا فَلاَ يَقْعُدْ حَتَّى تُوضَعَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 97,
        "matchingEnglishURN": 1070960,
        "last_updated": null
    },
    {
        "arabicURN": 1119230,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "45.00",
        "hadithNumber": "1915",
        "bookName": " كتاب الجنائز",
        "babName": " باب الأَمْرِ بِالْقِيَامِ لِلْجَنَازَةِ ‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ عَامِرِ بْنِ رَبِيعَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا رَأَى أَحَدُكُمُ الْجَنَازَةَ فَلَمْ يَكُنْ مَاشِيًا مَعَهَا فَلْيَقُمْ حَتَّى تُخَلِّفَهُ أَوْ تُوضَعَ مِنْ قَبْلِ أَنْ تُخَلِّفَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 98,
        "matchingEnglishURN": 1070970,
        "last_updated": null
    },
    {
        "arabicURN": 1119240,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "45.00",
        "hadithNumber": "1916",
        "bookName": " كتاب الجنائز",
        "babName": " باب الأَمْرِ بِالْقِيَامِ لِلْجَنَازَةِ ‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنْ عَامِرِ بْنِ رَبِيعَةَ الْعَدَوِيِّ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\"‏ إِذَا رَأَيْتُمُ الْجَنَازَةَ فَقُومُوا حَتَّى تُخَلِّفَكُمْ أَوْ تُوضَعَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 99,
        "matchingEnglishURN": 1070980,
        "last_updated": null
    },
    {
        "arabicURN": 1119250,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "45.00",
        "hadithNumber": "1917",
        "bookName": " كتاب الجنائز",
        "babName": " باب الأَمْرِ بِالْقِيَامِ لِلْجَنَازَةِ ‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ هِشَامٍ، ح وَأَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا رَأَيْتُمُ الْجَنَازَةَ فَقُومُوا فَمَنْ تَبِعَهَا فَلاَ يَقْعُدْ حَتَّى تُوضَعَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 100,
        "matchingEnglishURN": 1070990,
        "last_updated": null
    },
    {
        "arabicURN": 1119260,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "45.00",
        "hadithNumber": "1918",
        "bookName": " كتاب الجنائز",
        "babName": " باب الأَمْرِ بِالْقِيَامِ لِلْجَنَازَةِ ‏ ",
        "hadithText": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حَجَّاجٌ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ عَجْلاَنَ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، وَأَبِي، سَعِيدٍ قَالاَ مَا رَأَيْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم شَهِدَ جَنَازَةً قَطُّ فَجَلَسَ حَتَّى تُوضَعَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 101,
        "matchingEnglishURN": 1071000,
        "last_updated": null
    },
    {
        "arabicURN": 1119270,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "45.00",
        "hadithNumber": "1919",
        "bookName": " كتاب الجنائز",
        "babName": " باب الأَمْرِ بِالْقِيَامِ لِلْجَنَازَةِ ‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا زَكَرِيَّا، عَنِ الشَّعْبِيِّ، قَالَ قَالَ أَبُو سَعِيدٍ ح وَأَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ بْنِ إِسْحَاقَ، قَالَ حَدَّثَنَا أَبُو زَيْدٍ، سَعِيدُ بْنُ الرَّبِيعِ قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ، قَالَ سَمِعْتُ الشَّعْبِيَّ، يُحَدِّثُ عَنْ أَبِي سَعِيدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَرُّوا عَلَيْهِ بِجَنَازَةٍ فَقَامَ ‏.‏ وَقَالَ عَمْرٌو إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَرَّتْ بِهِ جَنَازَةٌ فَقَامَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 102,
        "matchingEnglishURN": 1071010,
        "last_updated": null
    },
    {
        "arabicURN": 1119280,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "45.00",
        "hadithNumber": "1920",
        "bookName": " كتاب الجنائز",
        "babName": " باب الأَمْرِ بِالْقِيَامِ لِلْجَنَازَةِ ‏ ",
        "hadithText": "أَخْبَرَنِي أَيُّوبُ بْنُ مُحَمَّدٍ الْوَزَّانُ، قَالَ حَدَّثَنَا مَرْوَانُ، قَالَ حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ، قَالَ أَخْبَرَنِي خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ، عَنْ عَمِّهِ، يَزِيدَ بْنِ ثَابِتٍ أَنَّهُمْ كَانُوا جُلُوسًا مَعَ النَّبِيِّ صلى الله عليه وسلم فَطَلَعَتْ جَنَازَةٌ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَامَ مَنْ مَعَهُ فَلَمْ يَزَالُوا قِيَامًا حَتَّى نَفَذَتْ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 103,
        "matchingEnglishURN": 1071020,
        "last_updated": null
    },
    {
        "arabicURN": 1119290,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "46.00",
        "hadithNumber": "1921",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْقِيَامِ لِجَنَازَةِ أَهْلِ الشِّرْكِ ‏ ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، قَالَ كَانَ سَهْلُ بْنُ حُنَيْفٍ وَقَيْسُ بْنُ سَعْدِ بْنِ عُبَادَةَ بِالْقَادِسِيَّةِ فَمُرَّ عَلَيْهِمَا بِجَنَازَةٍ فَقَامَا فَقِيلَ لَهُمَا إِنَّهَا مِنْ أَهْلِ الأَرْضِ ‏.‏ فَقَالاَ مُرَّ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِجَنَازَةٍ فَقَامَ فَقِيلَ لَهُ إِنَّهُ يَهُودِيٌّ ‏.‏ فَقَالَ ‏\"‏ أَلَيْسَتْ نَفْسًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 104,
        "matchingEnglishURN": 1071030,
        "last_updated": null
    },
    {
        "arabicURN": 1119300,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "46.00",
        "hadithNumber": "1922",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْقِيَامِ لِجَنَازَةِ أَهْلِ الشِّرْكِ ‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ هِشَامٍ، ح وَأَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ مِقْسَمٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ مَرَّتْ بِنَا جَنَازَةٌ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقُمْنَا مَعَهُ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّمَا هِيَ جَنَازَةُ يَهُودِيَّةٍ ‏.‏ فَقَالَ ‏\"‏ إِنَّ لِلْمَوْتِ فَزَعًا فَإِذَا رَأَيْتُمُ الْجَنَازَةَ فَقُومُوا ‏\"‏ ‏.‏ اللَّفْظُ لِخَالِدٍ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 105,
        "matchingEnglishURN": 1071040,
        "last_updated": null
    },
    {
        "arabicURN": 1119310,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "47.00",
        "hadithNumber": "1923",
        "bookName": " كتاب الجنائز",
        "babName": " باب الرُّخْصَةِ فِي تَرْكِ الْقِيَامِ ‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، عَنْ أَبِي مَعْمَرٍ، قَالَ كُنَّا عِنْدَ عَلِيٍّ فَمَرَّتْ جَنَازَةٌ فَقَامُوا لَهَا فَقَالَ عَلِيٌّ مَا هَذَا قَالُوا أَمْرُ أَبِي مُوسَى ‏.‏ فَقَالَ إِنَّمَا قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِجَنَازَةِ يَهُودِيَّةٍ وَلَمْ يَعُدْ بَعْدَ ذَلِكَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 106,
        "matchingEnglishURN": 1071050,
        "last_updated": null
    },
    {
        "arabicURN": 1119320,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "47.00",
        "hadithNumber": "1924",
        "bookName": " كتاب الجنائز",
        "babName": " باب الرُّخْصَةِ فِي تَرْكِ الْقِيَامِ ‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، أَنَّ جَنَازَةً، مَرَّتْ بِالْحَسَنِ بْنِ عَلِيٍّ وَابْنِ عَبَّاسٍ فَقَامَ الْحَسَنُ وَلَمْ يَقُمِ ابْنُ عَبَّاسٍ فَقَالَ الْحَسَنُ أَلَيْسَ قَدْ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِجَنَازَةِ يَهُودِيٍّ قَالَ ابْنُ عَبَّاسٍ نَعَمْ ثُمَّ جَلَسَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 107,
        "matchingEnglishURN": 1071060,
        "last_updated": null
    },
    {
        "arabicURN": 1119330,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "47.00",
        "hadithNumber": "1925",
        "bookName": " كتاب الجنائز",
        "babName": " باب الرُّخْصَةِ فِي تَرْكِ الْقِيَامِ ‏ ",
        "hadithText": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا هُشَيْمٌ، قَالَ أَنْبَأَنَا مَنْصُورٌ، عَنِ ابْنِ سِيرِينَ، قَالَ مُرَّ بِجَنَازَةٍ عَلَى الْحَسَنِ بْنِ عَلِيٍّ وَابْنِ عَبَّاسٍ فَقَامَ الْحَسَنُ وَلَمْ يَقُمِ ابْنُ عَبَّاسٍ فَقَالَ الْحَسَنُ لاِبْنِ عَبَّاسٍ أَمَا قَامَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ابْنُ عَبَّاسٍ قَامَ لَهَا ثُمَّ قَعَدَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 108,
        "matchingEnglishURN": 1071070,
        "last_updated": null
    },
    {
        "arabicURN": 1119340,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "47.00",
        "hadithNumber": "1926",
        "bookName": " كتاب الجنائز",
        "babName": " باب الرُّخْصَةِ فِي تَرْكِ الْقِيَامِ ‏ ",
        "hadithText": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، عَنِ ابْنِ عُلَيَّةَ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَبِي مِجْلَزٍ، عَنِ ابْنِ عَبَّاسٍ، وَالْحَسَنِ بْنِ عَلِيٍّ، مَرَّتْ بِهِمَا جَنَازَةٌ فَقَامَ أَحَدُهُمَا وَقَعَدَ الآخَرُ فَقَالَ الَّذِي قَامَ أَمَا وَاللَّهِ لَقَدْ عَلِمْتُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ قَامَ قَالَ لَهُ الَّذِي جَلَسَ لَقَدْ عَلِمْتُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ جَلَسَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 109,
        "matchingEnglishURN": 1071080,
        "last_updated": null
    },
    {
        "arabicURN": 1119350,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "47.00",
        "hadithNumber": "1927",
        "bookName": " كتاب الجنائز",
        "babName": " باب الرُّخْصَةِ فِي تَرْكِ الْقِيَامِ ‏ ",
        "hadithText": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ هَارُونَ الْبَلْخِيُّ، قَالَ حَدَّثَنَا حَاتِمٌ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، أَنَّ الْحَسَنَ بْنَ عَلِيٍّ، كَانَ جَالِسًا فَمُرَّ عَلَيْهِ بِجَنَازَةٍ فَقَامَ النَّاسُ حَتَّى جَاوَزَتِ الْجَنَازَةُ فَقَالَ الْحَسَنُ إِنَّمَا مُرَّ بِجَنَازَةِ يَهُودِيٍّ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى طَرِيقِهَا جَالِسًا فَكَرِهَ أَنْ تَعْلُوَ رَأْسَهُ جَنَازَةُ يَهُودِيٍّ فَقَامَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 110,
        "matchingEnglishURN": 1071090,
        "last_updated": null
    },
    {
        "arabicURN": 1119360,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "47.00",
        "hadithNumber": "1928",
        "bookName": " كتاب الجنائز",
        "babName": " باب الرُّخْصَةِ فِي تَرْكِ الْقِيَامِ ‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرًا، يَقُولُ قَامَ النَّبِيُّ صلى الله عليه وسلم لِجَنَازَةِ يَهُودِيٍّ مَرَّتْ بِهِ حَتَّى تَوَارَتْ ‏.‏ \n<p>\nوَأَخْبَرَنِي أَبُو الزُّبَيْرِ، أَيْضًا أَنَّهُ سَمِعَ جَابِرًا، رَضِيَ اللَّهُ عَنْهُ يَقُولُ قَامَ النَّبِيُّ صلى الله عليه وسلم وَأَصْحَابُهُ لِجَنَازَةِ يَهُودِيٍّ حَتَّى تَوَارَتْ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 111,
        "matchingEnglishURN": 1071100,
        "last_updated": null
    },
    {
        "arabicURN": 1119380,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "47.00",
        "hadithNumber": "1929",
        "bookName": " كتاب الجنائز",
        "babName": " باب الرُّخْصَةِ فِي تَرْكِ الْقِيَامِ ‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ، قَالَ أَنْبَأَنَا النَّضْرُ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ جَنَازَةً، مَرَّتْ بِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَامَ فَقِيلَ إِنَّهَا جَنَازَةُ يَهُودِيٍّ ‏.‏ فَقَالَ ‏\"‏ إِنَّمَا قُمْنَا لِلْمَلاَئِكَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 112,
        "matchingEnglishURN": 1071120,
        "last_updated": null
    },
    {
        "arabicURN": 1119390,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "48.00",
        "hadithNumber": "1930",
        "bookName": " كتاب الجنائز",
        "babName": " باب اسْتِرَاحَةِ الْمُؤْمِنِ بِالْمَوْتِ ‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ، عَنْ مَعْبَدِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِي قَتَادَةَ بْنِ رِبْعِيٍّ، أَنَّهُ كَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مُرَّ عَلَيْهِ بِجَنَازَةٍ فَقَالَ ‏\"‏ مُسْتَرِيحٌ وَمُسْتَرَاحٌ مِنْهُ ‏\"‏ ‏.‏ فَقَالُوا مَا الْمُسْتَرِيحُ وَمَا الْمُسْتَرَاحُ مِنْهُ قَالَ ‏\"‏ الْعَبْدُ الْمُؤْمِنُ يَسْتَرِيحُ مِنْ نَصَبِ الدُّنْيَا وَأَذَاهَا وَالْعَبْدُ الْفَاجِرُ يَسْتَرِيحُ مِنْهُ الْعِبَادُ وَالْبِلاَدُ وَالشَّجَرُ وَالدَّوَابُّ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 113,
        "matchingEnglishURN": 1071130,
        "last_updated": null
    },
    {
        "arabicURN": 1119400,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "49.00",
        "hadithNumber": "1931",
        "bookName": " كتاب الجنائز",
        "babName": " باب الاِسْتِرَاحَةِ مِنَ الْكُفَّارِ ‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ وَهْبِ بْنِ أَبِي كَرِيمَةَ الْحَرَّانِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، - وَهُوَ الْحَرَّانِيُّ - عَنْ أَبِي عَبْدِ الرَّحِيمِ، حَدَّثَنِي زَيْدٌ، عَنْ وَهْبِ بْنِ كَيْسَانَ، عَنْ مَعْبَدِ بْنِ كَعْبٍ، عَنْ أَبِي قَتَادَةَ، قَالَ كُنَّا جُلُوسًا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ طَلَعَتْ جَنَازَةٌ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مُسْتَرِيحٌ وَمُسْتَرَاحٌ مِنْهُ الْمُؤْمِنُ يَمُوتُ فَيَسْتَرِيحُ مِنْ أَوْصَابِ الدُّنْيَا وَنَصَبِهَا وَأَذَاهَا وَالْفَاجِرُ يَمُوتُ فَيَسْتَرِيحُ مِنْهُ الْعِبَادُ وَالْبِلاَدُ وَالشَّجَرُ وَالدَّوَابُّ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 114,
        "matchingEnglishURN": 1071140,
        "last_updated": null
    },
    {
        "arabicURN": 1119410,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "50.00",
        "hadithNumber": "1932",
        "bookName": " كتاب الجنائز",
        "babName": " باب الثَّنَاءِ ‏ ",
        "hadithText": "أَخْبَرَنِي زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ، قَالَ مُرَّ بِجَنَازَةٍ فَأُثْنِيَ عَلَيْهَا خَيْرًا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَجَبَتْ ‏\"‏ ‏.‏ وَمُرَّ بِجَنَازَةٍ أُخْرَى فَأُثْنِيَ عَلَيْهَا شَرًّا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَجَبَتْ ‏\"‏ ‏.‏ فَقَالَ عُمَرُ فِدَاكَ أَبِي وَأُمِّي مُرَّ بِجَنَازَةِ فَأُثْنِيَ عَلَيْهَا خَيْرًا فَقُلْتَ ‏\"‏ وَجَبَتْ ‏\"‏ ‏.‏ وَمُرَّ بِجَنَازَةٍ فَأُثْنِيَ عَلَيْهَا شَرًّا فَقُلْتَ ‏\"‏ وَجَبَتْ ‏\"‏ ‏.‏ فَقَالَ ‏\"‏ مَنْ أَثْنَيْتُمْ عَلَيْهِ خَيْرًا وَجَبَتْ لَهُ الْجَنَّةُ وَمَنْ أَثْنَيْتُمْ عَلَيْهِ شَرًّا وَجَبَتْ لَهُ النَّارُ أَنْتُمْ شُهَدَاءُ اللَّهِ فِي الأَرْضِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 115,
        "matchingEnglishURN": 1071150,
        "last_updated": null
    },
    {
        "arabicURN": 1119420,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "50.00",
        "hadithNumber": "1933",
        "bookName": " كتاب الجنائز",
        "babName": " باب الثَّنَاءِ ‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ إِبْرَاهِيمَ بْنَ عَامِرٍ، وَجَدُّهُ، أُمَيَّةُ بْنُ خَلَفٍ قَالَ سَمِعْتُ عَامِرَ بْنَ سَعْدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ مَرُّوا بِجَنَازَةٍ عَلَى النَّبِيِّ صلى الله عليه وسلم فَأَثْنَوْا عَلَيْهَا خَيْرًا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَجَبَتْ ‏\"‏ ‏.‏ ثُمَّ مَرُّوا بِجَنَازَةٍ أُخْرَى فَأَثْنَوْا عَلَيْهَا شَرًّا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَجَبَتْ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ قَوْلُكَ الأُولَى وَالأُخْرَى ‏\"‏ وَجَبَتْ ‏\"‏ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الْمَلاَئِكَةُ شُهَدَاءُ اللَّهِ فِي السَّمَاءِ وَأَنْتُمْ شُهَدَاءُ اللَّهِ فِي الأَرْضِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 116,
        "matchingEnglishURN": 1071160,
        "last_updated": null
    },
    {
        "arabicURN": 1119430,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "50.00",
        "hadithNumber": "1934",
        "bookName": " كتاب الجنائز",
        "babName": " باب الثَّنَاءِ ‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ، وَعَبْدُ اللَّهِ بْنُ يَزِيدَ، قَالاَ حَدَّثَنَا دَاوُدُ بْنُ أَبِي الْفُرَاتِ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، عَنْ أَبِي الأَسْوَدِ الدِّيلِيِّ، قَالَ أَتَيْتُ الْمَدِينَةَ فَجَلَسْتُ إِلَى عُمَرَ بْنِ الْخَطَّابِ فَمُرَّ بِجَنَازَةٍ فَأُثْنِيَ عَلَى صَاحِبِهَا خَيْرًا فَقَالَ عُمَرُ وَجَبَتْ ‏.‏ ثُمَّ مُرَّ بِأُخْرَى فَأُثْنِيَ عَلَى صَاحِبِهَا خَيْرًا فَقَالَ عُمَرُ وَجَبَتْ ‏.‏ ثُمَّ مُرَّ بِالثَّالِثِ فَأُثْنِيَ عَلَى صَاحِبِهَا شَرًّا فَقَالَ عُمَرُ وَجَبَتْ ‏.‏ فَقُلْتُ وَمَا وَجَبَتْ يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ قُلْتُ كَمَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَيُّمَا مُسْلِمٍ شَهِدَ لَهُ أَرْبَعَةٌ قَالُوا خَيْرًا أَدْخَلَهُ اللَّهُ الْجَنَّةَ ‏\"‏ ‏.‏ قُلْنَا أَوْ ثَلاَثَةٌ قَالَ ‏\"‏ أَوْ ثَلاَثَةٌ ‏\"‏ ‏.‏ قُلْنَا أَوِ اثْنَانِ قَالَ ‏\"‏ أَوِ اثْنَانِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 117,
        "matchingEnglishURN": 1071170,
        "last_updated": null
    },
    {
        "arabicURN": 1119440,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "51.00",
        "hadithNumber": "1935",
        "bookName": " كتاب الجنائز",
        "babName": " باب النَّهْىِ عَنْ ذِكْرِ الْهَلْكَى، إِلاَّ بِخَيْرٍ ‏ ",
        "hadithText": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ، قَالَ حَدَّثَنِي أَحْمَدُ بْنُ إِسْحَاقَ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا مَنْصُورُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، قَالَتْ ذُكِرَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم هَالِكٌ بِسُوءٍ فَقَالَ ‏\"‏ لاَ تَذْكُرُوا هَلْكَاكُمْ إِلاَّ بِخَيْرٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 118,
        "matchingEnglishURN": 1071180,
        "last_updated": null
    },
    {
        "arabicURN": 1119450,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "52.00",
        "hadithNumber": "1936",
        "bookName": " كتاب الجنائز",
        "babName": " باب النَّهْىِ عَنْ سَبِّ الأَمْوَاتِ، ‏ ",
        "hadithText": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، عَنْ بِشْرٍ، - وَهُوَ ابْنُ الْمُفَضَّلِ - عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ الأَعْمَشِ، عَنْ مُجَاهِدٍ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَسُبُّوا الأَمْوَاتَ فَإِنَّهُمْ قَدْ أَفْضَوْا إِلَى مَا قَدَّمُوا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 119,
        "matchingEnglishURN": 1071190,
        "last_updated": null
    },
    {
        "arabicURN": 1119460,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "52.00",
        "hadithNumber": "1937",
        "bookName": " كتاب الجنائز",
        "babName": " باب النَّهْىِ عَنْ سَبِّ الأَمْوَاتِ، ‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَتْبَعُ الْمَيِّتَ ثَلاَثَةٌ أَهْلُهُ وَمَالُهُ وَعَمَلُهُ فَيَرْجِعُ اثْنَانِ أَهْلُهُ وَمَالُهُ وَيَبْقَى وَاحِدٌ عَمَلُهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 120,
        "matchingEnglishURN": 1071200,
        "last_updated": null
    },
    {
        "arabicURN": 1119470,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "52.00",
        "hadithNumber": "1938",
        "bookName": " كتاب الجنائز",
        "babName": " باب النَّهْىِ عَنْ سَبِّ الأَمْوَاتِ، ‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لِلْمُؤْمِنِ عَلَى الْمُؤْمِنِ سِتُّ خِصَالٍ يَعُودُهُ إِذَا مَرِضَ وَيَشْهَدُهُ إِذَا مَاتَ وَيُجِيبُهُ إِذَا دَعَاهُ وَيُسَلِّمُ عَلَيْهِ إِذَا لَقِيَهُ وَيُشَمِّتُهُ إِذَا عَطَسَ وَيَنْصَحُ لَهُ إِذَا غَابَ أَوْ شَهِدَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 121,
        "matchingEnglishURN": 1071210,
        "last_updated": null
    },
    {
        "arabicURN": 1119480,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "53.00",
        "hadithNumber": "1939",
        "bookName": " كتاب الجنائز",
        "babName": " باب الأَمْرِ بِاتِّبَاعِ الْجَنَائِزِ ‏ ",
        "hadithText": "أَخْبَرَنَا سُلَيْمَانُ بْنُ مَنْصُورٍ الْبَلْخِيُّ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، ح وَأَنْبَأَنَا هَنَّادُ بْنُ السَّرِيِّ، فِي حَدِيثِهِ عَنْ أَبِي الأَحْوَصِ، عَنْ أَشْعَثَ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدٍ، قَالَ هَنَّادٌ قَالَ الْبَرَاءُ بْنُ عَازِبٍ وَقَالَ سُلَيْمَانُ عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِسَبْعٍ وَنَهَانَا عَنْ سَبْعٍ أَمَرَنَا بِعِيَادَةِ الْمَرِيضِ وَتَشْمِيتِ الْعَاطِسِ وَإِبْرَارِ الْقَسَمِ وَنُصْرَةِ الْمَظْلُومِ وَإِفْشَاءِ السَّلاَمِ وَإِجَابَةِ الدَّاعِي وَاتِّبَاعِ الْجَنَائِزِ وَنَهَانَا عَنْ خَوَاتِيمِ الذَّهَبِ وَعَنْ آنِيَةِ الْفِضَّةِ وَعَنِ الْمَيَاثِرِ وَالْقَسِّيَّةِ وَالإِسْتَبْرَقِ وَالْحَرِيرِ وَالدِّيبَاجِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 122,
        "matchingEnglishURN": 1071220,
        "last_updated": null
    },
    {
        "arabicURN": 1119490,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "54.00",
        "hadithNumber": "1940",
        "bookName": " كتاب الجنائز",
        "babName": " باب فَضْلِ مَنْ يَتْبَعُ جَنَازَةً ‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا عَبْثَرٌ، عَنْ بُرْدٍ، أَخِي يَزِيدَ بْنِ أَبِي زِيَادٍ عَنِ الْمُسَيَّبِ بْنِ رَافِعٍ، قَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ تَبِعَ جَنَازَةً حَتَّى يُصَلَّى عَلَيْهَا كَانَ لَهُ مِنَ الأَجْرِ قِيرَاطٌ وَمَنْ مَشَى مَعَ الْجَنَازَةِ حَتَّى تُدْفَنَ كَانَ لَهُ مِنَ الأَجْرِ قِيرَاطَانِ وَالْقِيرَاطُ مِثْلُ أُحُدٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 123,
        "matchingEnglishURN": 1071230,
        "last_updated": null
    },
    {
        "arabicURN": 1119500,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "54.00",
        "hadithNumber": "1941",
        "bookName": " كتاب الجنائز",
        "babName": " باب فَضْلِ مَنْ يَتْبَعُ جَنَازَةً ‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا أَشْعَثُ، عَنِ الْحَسَنِ، عَنْ عَبْدِ اللَّهِ بْنِ الْمُغَفَّلِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ تَبِعَ جَنَازَةً حَتَّى يُفْرَغَ مِنْهَا فَلَهُ قِيرَاطَانِ فَإِنْ رَجَعَ قَبْلَ أَنْ يُفْرَغَ مِنْهَا فَلَهُ قِيرَاطٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 124,
        "matchingEnglishURN": 1071240,
        "last_updated": null
    },
    {
        "arabicURN": 1119510,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "55.00",
        "hadithNumber": "1942",
        "bookName": " كتاب الجنائز",
        "babName": " باب مَكَانِ الرَّاكِبِ مِنَ الْجَنَازَةِ ‏ ",
        "hadithText": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ وَاصِلٍ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدِ اللَّهِ، وَأَخُوهُ الْمُغِيرَةُ، جَمِيعًا عَنْ زِيَادِ بْنِ جُبَيْرٍ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الرَّاكِبُ خَلْفَ الْجَنَازَةِ وَالْمَاشِي حَيْثُ شَاءَ مِنْهَا وَالطِّفْلُ يُصَلَّى عَلَيْهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 125,
        "matchingEnglishURN": 1071250,
        "last_updated": null
    },
    {
        "arabicURN": 1119520,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "56.00",
        "hadithNumber": "1943",
        "bookName": " كتاب الجنائز",
        "babName": " باب مَكَانِ الْمَاشِي مِنَ الْجَنَازَةِ ‏ ",
        "hadithText": "أَخْبَرَنِي أَحْمَدُ بْنُ بَكَّارٍ الْحَرَّانِيُّ، قَالَ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ، عَنْ سَعِيدٍ الثَّقَفِيِّ، عَنْ عَمِّهِ، زِيَادِ بْنِ جُبَيْرِ بْنِ حَيَّةَ عَنْ أَبِيهِ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الرَّاكِبُ خَلْفَ الْجَنَازَةِ وَالْمَاشِي حَيْثُ شَاءَ مِنْهَا وَالطِّفْلُ يُصَلَّى عَلَيْهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 126,
        "matchingEnglishURN": 1071260,
        "last_updated": null
    },
    {
        "arabicURN": 1119530,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "56.00",
        "hadithNumber": "1944",
        "bookName": " كتاب الجنائز",
        "babName": " باب مَكَانِ الْمَاشِي مِنَ الْجَنَازَةِ ‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَلِيُّ بْنُ حُجْرٍ، وَقُتَيْبَةُ، عَنْ سُفْيَانَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّهُ رَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم وَأَبَا بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا يَمْشُونَ أَمَامَ الْجَنَازَةِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 127,
        "matchingEnglishURN": 1071270,
        "last_updated": null
    },
    {
        "arabicURN": 1119540,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "56.00",
        "hadithNumber": "1945",
        "bookName": " كتاب الجنائز",
        "babName": " باب مَكَانِ الْمَاشِي مِنَ الْجَنَازَةِ ‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا هَمَّامٌ، قَالَ حَدَّثَنَا سُفْيَانُ، وَمَنْصُورٌ، وَزِيَادٌ، وَبَكْرٌ، - هُوَ ابْنُ وَائِلٍ - كُلُّهُمْ ذَكَرُوا أَنَّهُمْ سَمِعُوا مِنَ الزُّهْرِيِّ، يُحَدِّثُ أَنَّ سَالِمًا، أَخْبَرَهُ أَنَّ أَبَاهُ أَخْبَرَهُ أَنَّهُ، رَأَى النَّبِيَّ صلى الله عليه وسلم وَأَبَا بَكْرٍ وَعُمَرَ وَعُثْمَانَ يَمْشُونَ بَيْنَ يَدَىِ الْجَنَازَةِ ‏.‏ بَكْرٌ وَحْدَهُ لَمْ يَذْكُرْ عُثْمَانَ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا خَطَأٌ وَالصَّوَابُ مُرْسَلٌ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 128,
        "matchingEnglishURN": 1071280,
        "last_updated": null
    },
    {
        "arabicURN": 1119550,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "57.00",
        "hadithNumber": "1946",
        "bookName": " كتاب الجنائز",
        "babName": " باب الأَمْرِ بِالصَّلاَةِ عَلَى الْمَيِّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، وَعَمْرُو بْنُ زُرَارَةَ النَّيْسَابُورِيُّ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمُهَلَّبِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ أَخَاكُمْ قَدْ مَاتَ فَقُومُوا فَصَلُّوا عَلَيْهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 129,
        "matchingEnglishURN": 1071290,
        "last_updated": null
    },
    {
        "arabicURN": 1119560,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "58.00",
        "hadithNumber": "1947",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصَّلاَةِ عَلَى الصِّبْيَانِ ‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى، عَنْ عَمَّتِهِ، عَائِشَةَ بِنْتِ طَلْحَةَ عَنْ خَالَتِهَا أُمِّ الْمُؤْمِنِينَ، عَائِشَةَ قَالَتْ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِصَبِيٍّ مِنْ صِبْيَانِ الأَنْصَارِ فَصَلَّى عَلَيْهِ ‏.‏ قَالَتْ عَائِشَةُ فَقُلْتُ طُوبَى لِهَذَا عُصْفُورٌ مِنْ عَصَافِيرِ الْجَنَّةِ لَمْ يَعْمَلْ سُوءًا وَلَمْ يُدْرِكْهُ ‏.‏ قَالَ ‏\"‏ أَوَغَيْرَ ذَلِكَ يَا عَائِشَةُ خَلَقَ اللَّهُ عَزَّ وَجَلَّ الْجَنَّةَ وَخَلَقَ لَهَا أَهْلاً وَخَلَقَهُمْ فِي أَصْلاَبِ آبَائِهِمْ وَخَلَقَ النَّارَ وَخَلَقَ لَهَا أَهْلاً وَخَلَقَهُمْ فِي أَصْلاَبِ آبَائِهِمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 130,
        "matchingEnglishURN": 1071300,
        "last_updated": null
    },
    {
        "arabicURN": 1119570,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "59.00",
        "hadithNumber": "1948",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصَّلاَةِ عَلَى الأَطْفَالِ ‏ ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدِ اللَّهِ، قَالَ سَمِعْتُ زِيَادَ بْنَ جُبَيْرٍ، يُحَدِّثُ عَنْ أَبِيهِ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، أَنَّهُ ذَكَرَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الرَّاكِبُ خَلْفَ الْجَنَازَةِ وَالْمَاشِي حَيْثُ شَاءَ مِنْهَا وَالطِّفْلُ يُصَلَّى عَلَيْهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 131,
        "matchingEnglishURN": 1071310,
        "last_updated": null
    },
    {
        "arabicURN": 1119580,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "60.00",
        "hadithNumber": "1949",
        "bookName": " كتاب الجنائز",
        "babName": " باب أَوْلاَدِ الْمُشْرِكِينَ ‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ، قَالَ أَنْبَأَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَوْلاَدِ الْمُشْرِكِينَ فَقَالَ ‏\"‏ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 132,
        "matchingEnglishURN": 1071320,
        "last_updated": null
    },
    {
        "arabicURN": 1119590,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "60.00",
        "hadithNumber": "1950",
        "bookName": " كتاب الجنائز",
        "babName": " باب أَوْلاَدِ الْمُشْرِكِينَ ‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا الأَسْوَدُ بْنُ عَامِرٍ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ قَيْسٍ، - هُوَ ابْنُ سَعْدٍ - عَنْ طَاوُسٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم سُئِلَ عَنْ أَوْلاَدِ الْمُشْرِكِينَ فَقَالَ ‏\"‏ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 133,
        "matchingEnglishURN": 1071330,
        "last_updated": null
    },
    {
        "arabicURN": 1119600,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "60.00",
        "hadithNumber": "1951",
        "bookName": " كتاب الجنائز",
        "babName": " باب أَوْلاَدِ الْمُشْرِكِينَ ‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَوْلاَدِ الْمُشْرِكِينَ فَقَالَ ‏\"‏ خَلَقَهُمُ اللَّهُ حِينَ خَلَقَهُمْ وَهُوَ يَعْلَمُ بِمَا كَانُوا عَامِلِينَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 134,
        "matchingEnglishURN": 1071340,
        "last_updated": null
    },
    {
        "arabicURN": 1119610,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "60.00",
        "hadithNumber": "1952",
        "bookName": " كتاب الجنائز",
        "babName": " باب أَوْلاَدِ الْمُشْرِكِينَ ‏ ",
        "hadithText": "أَخْبَرَنِي مُجَاهِدُ بْنُ مُوسَى، عَنْ هُشَيْمٍ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنْ ذَرَارِيِّ الْمُشْرِكِينَ فَقَالَ ‏\"‏ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 135,
        "matchingEnglishURN": 1071350,
        "last_updated": null
    },
    {
        "arabicURN": 1119620,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "61.00",
        "hadithNumber": "1953",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصَّلاَةِ عَلَى الشُّهَدَاءِ ‏ ",
        "hadithText": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي عِكْرِمَةُ بْنُ خَالِدٍ، أَنَّ ابْنَ أَبِي عَمَّارٍ، أَخْبَرَهُ عَنْ شَدَّادِ بْنِ الْهَادِ، أَنَّ رَجُلاً، مِنَ الأَعْرَابِ جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَآمَنَ بِهِ وَاتَّبَعَهُ ثُمَّ قَالَ أُهَاجِرُ مَعَكَ ‏.‏ فَأَوْصَى بِهِ النَّبِيُّ صلى الله عليه وسلم بَعْضَ أَصْحَابِهِ فَلَمَّا كَانَتْ غَزْوَةٌ غَنِمَ النَّبِيُّ صلى الله عليه وسلم سَبْيًا فَقَسَمَ وَقَسَمَ لَهُ فَأَعْطَى أَصْحَابَهُ مَا قَسَمَ لَهُ وَكَانَ يَرْعَى ظَهْرَهُمْ فَلَمَّا جَاءَ دَفَعُوهُ إِلَيْهِ فَقَالَ مَا هَذَا قَالُوا قِسْمٌ قَسَمَهُ لَكَ النَّبِيُّ صلى الله عليه وسلم ‏.‏ فَأَخَذَهُ فَجَاءَ بِهِ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ مَا هَذَا قَالَ ‏\"‏ قَسَمْتُهُ لَكَ ‏\"‏ ‏.‏ قَالَ مَا عَلَى هَذَا اتَّبَعْتُكَ وَلَكِنِّي اتَّبَعْتُكَ عَلَى أَنْ أُرْمَى إِلَى هَا هُنَا - وَأَشَارَ إِلَى حَلْقِهِ بِسَهْمٍ - فَأَمُوتَ فَأَدْخُلَ الْجَنَّةَ ‏.‏ فَقَالَ ‏\"‏ إِنْ تَصْدُقِ اللَّهَ يَصْدُقْكَ ‏\"‏ ‏.‏ فَلَبِثُوا قَلِيلاً ثُمَّ نَهَضُوا فِي قِتَالِ الْعَدُوِّ فَأُتِيَ بِهِ النَّبِيُّ صلى الله عليه وسلم يُحْمَلُ قَدْ أَصَابَهُ سَهْمٌ حَيْثُ أَشَارَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَهُوَ هُوَ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ قَالَ ‏\"‏ صَدَقَ اللَّهَ فَصَدَقَهُ ‏\"‏ ‏.‏ ثُمَّ كَفَّنَهُ النَّبِيُّ صلى الله عليه وسلم فِي جُبَّةِ النَّبِيِّ صلى الله عليه وسلم ثُمَّ قَدَّمَهُ فَصَلَّى عَلَيْهِ فَكَانَ فِيمَا ظَهَرَ مِنْ صَلاَتِهِ ‏\"‏ اللَّهُمَّ هَذَا عَبْدُكَ خَرَجَ مُهَاجِرًا فِي سَبِيلِكَ فَقُتِلَ شَهِيدًا أَنَا شَهِيدٌ عَلَى ذَلِكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 136,
        "matchingEnglishURN": 1071360,
        "last_updated": null
    },
    {
        "arabicURN": 1119630,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "61.00",
        "hadithNumber": "1954",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصَّلاَةِ عَلَى الشُّهَدَاءِ ‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ يَوْمًا فَصَلَّى عَلَى أَهْلِ أُحُدٍ صَلاَتَهُ عَلَى الْمَيِّتِ ثُمَّ انْصَرَفَ إِلَى الْمِنْبَرِ فَقَالَ ‏\"‏ إِنِّي فَرَطٌ لَكُمْ وَأَنَا شَهِيدٌ عَلَيْكُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 137,
        "matchingEnglishURN": 1071370,
        "last_updated": null
    },
    {
        "arabicURN": 1119640,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "62.00",
        "hadithNumber": "1955",
        "bookName": " كتاب الجنائز",
        "babName": " باب تَرْكِ الصَّلاَةِ عَلَيْهِمْ ‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَجْمَعُ بَيْنَ الرَّجُلَيْنِ مِنْ قَتْلَى أُحُدٍ فِي ثَوْبٍ وَاحِدٍ ثُمَّ يَقُولُ ‏\"‏ أَيُّهُمَا أَكْثَرُ أَخْذًا لِلْقُرْآنِ ‏\"‏ ‏.‏ فَإِذَا أُشِيرَ إِلَى أَحَدِهِمَا قَدَّمَهُ فِي اللَّحْدِ ‏.‏ قَالَ ‏\"‏ أَنَا شَهِيدٌ عَلَى هَؤُلاَءِ ‏\"‏ ‏.‏ وَأَمَرَ بِدَفْنِهِمْ فِي دِمَائِهِمْ وَلَمْ يُصَلِّ عَلَيْهِمْ وَلَمْ يُغَسَّلُوا ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 138,
        "matchingEnglishURN": 1071380,
        "last_updated": null
    },
    {
        "arabicURN": 1119650,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "63.00",
        "hadithNumber": "1956",
        "bookName": " كتاب الجنائز",
        "babName": " باب تَرْكِ الصَّلاَةِ عَلَى الْمَرْجُومِ ‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى، وَنُوحُ بْنُ حَبِيبٍ، قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَجُلاً، مِنْ أَسْلَمَ جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَاعْتَرَفَ بِالزِّنَا فَأَعْرَضَ عَنْهُ ثُمَّ اعْتَرَفَ فَأَعْرَضَ عَنْهُ ثُمَّ اعْتَرَفَ فَأَعْرَضَ عَنْهُ حَتَّى شَهِدَ عَلَى نَفْسِهِ أَرْبَعَ مَرَّاتٍ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَبِكَ جُنُونٌ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ أَحْصَنْتَ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ فَأَمَرَ بِهِ النَّبِيُّ صلى الله عليه وسلم فَرُجِمَ فَلَمَّا أَذْلَقَتْهُ الْحِجَارَةُ فَرَّ فَأُدْرِكَ فَرُجِمَ فَمَاتَ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم خَيْرًا وَلَمْ يُصَلِّ عَلَيْهِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 139,
        "matchingEnglishURN": 1071390,
        "last_updated": null
    },
    {
        "arabicURN": 1119660,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "64.00",
        "hadithNumber": "1957",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصَّلاَةِ عَلَى الْمَرْجُومِ ‏ ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمُهَلَّبِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ امْرَأَةً، مِنْ جُهَيْنَةَ أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَتْ إِنِّي زَنَيْتُ وَهِيَ حُبْلَى فَدَفَعَهَا إِلَى وَلِيِّهَا فَقَالَ ‏\"‏ أَحْسِنْ إِلَيْهَا فَإِذَا وَضَعَتْ فَائْتِنِي بِهَا ‏\"‏ ‏.‏ فَلَمَّا وَضَعَتْ جَاءَ بِهَا فَأَمَرَ بِهَا فَشُكَّتْ عَلَيْهَا ثِيَابُهَا ثُمَّ رَجَمَهَا ثُمَّ صَلَّى عَلَيْهَا فَقَالَ لَهُ عُمَرُ أَتُصَلِّي عَلَيْهَا وَقَدْ زَنَتْ فَقَالَ ‏\"‏ لَقَدْ تَابَتْ تَوْبَةً لَوْ قُسِمَتْ بَيْنَ سَبْعِينَ مِنْ أَهْلِ الْمَدِينَةِ لَوَسِعَتْهُمْ وَهَلْ وَجَدْتَ تَوْبَةً أَفْضَلَ مِنْ أَنْ جَادَتْ بِنَفْسِهَا لِلَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 140,
        "matchingEnglishURN": 1071400,
        "last_updated": null
    },
    {
        "arabicURN": 1119670,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "65.00",
        "hadithNumber": "1958",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصَّلاَةِ عَلَى مَنْ يَحِيفُ فِي وَصِيَّتِهِ ‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا هُشَيْمٌ، عَنْ مَنْصُورٍ، - وَهُوَ ابْنُ زَاذَانَ - عَنِ الْحَسَنِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ رَجُلاً، أَعْتَقَ سِتَّةً مَمْلُوكِينَ لَهُ عِنْدَ مَوْتِهِ وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرَهُمْ فَبَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَغَضِبَ مِنْ ذَلِكَ وَقَالَ ‏\"‏ لَقَدْ هَمَمْتُ أَنْ لاَ أُصَلِّيَ عَلَيْهِ ‏\"‏ ‏.‏ ثُمَّ دَعَا مَمْلُوكِيهِ فَجَزَّأَهُمْ ثَلاَثَةَ أَجْزَاءٍ ثُمَّ أَقْرَعَ بَيْنَهُمْ فَأَعْتَقَ اثْنَيْنِ وَأَرَقَّ أَرْبَعَةً ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 141,
        "matchingEnglishURN": 1071410,
        "last_updated": null
    },
    {
        "arabicURN": 1119680,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "66.00",
        "hadithNumber": "1959",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصَّلاَةِ عَلَى مَنْ غَلَّ ‏ ",
        "hadithText": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ الأَنْصَارِيِّ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنْ أَبِي عَمْرَةَ، عَنْ زَيْدِ بْنِ خَالِدٍ، قَالَ مَاتَ رَجُلٌ بِخَيْبَرَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ صَلُّوا عَلَى صَاحِبِكُمْ إِنَّهُ غَلَّ فِي سَبِيلِ اللَّهِ ‏\"‏ ‏.‏ فَفَتَّشْنَا مَتَاعَهُ فَوَجَدْنَا فِيهِ خَرَزًا مِنْ خَرَزِ يَهُودَ مَا يُسَاوِي دِرْهَمَيْنِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 142,
        "matchingEnglishURN": 1071420,
        "last_updated": null
    },
    {
        "arabicURN": 1119690,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "67.00",
        "hadithNumber": "1960",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصَّلاَةِ عَلَى مَنْ عَلَيْهِ دَيْنٌ ‏ ",
        "hadithText": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ، سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي قَتَادَةَ، يُحَدِّثُ عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ بِرَجُلٍ مِنَ الأَنْصَارِ لِيُصَلِّيَ عَلَيْهِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ صَلُّوا عَلَى صَاحِبِكُمْ فَإِنَّ عَلَيْهِ دَيْنًا ‏\"‏ ‏.‏ قَالَ أَبُو قَتَادَةَ هُوَ عَلَىَّ ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بِالْوَفَاءِ ‏\"‏ ‏.‏ قَالَ بِالْوَفَاءِ ‏.‏ فَصَلَّى عَلَيْهِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 143,
        "matchingEnglishURN": 1071430,
        "last_updated": null
    },
    {
        "arabicURN": 1119700,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "67.00",
        "hadithNumber": "1961",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصَّلاَةِ عَلَى مَنْ عَلَيْهِ دَيْنٌ ‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا يَزِيدُ بْنُ أَبِي عُبَيْدٍ، قَالَ حَدَّثَنَا سَلَمَةُ، - يَعْنِي ابْنَ الأَكْوَعِ - قَالَ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِجَنَازَةٍ فَقَالُوا يَا نَبِيَّ اللَّهِ صَلِّ عَلَيْهَا ‏.‏ قَالَ ‏\"‏ هَلْ تَرَكَ عَلَيْهِ دَيْنًا ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ قَالَ ‏\"‏ هَلْ تَرَكَ مِنْ شَىْءٍ ‏\"‏ ‏.‏ قَالُوا لاَ ‏.‏ قَالَ ‏\"‏ صَلُّوا عَلَى صَاحِبِكُمْ ‏\"‏ ‏.‏ قَالَ رَجُلٌ مِنَ الأَنْصَارِ يُقَالُ لَهُ أَبُو قَتَادَةَ صَلِّ عَلَيْهِ وَعَلَىَّ دَيْنُهُ ‏.‏ فَصَلَّى عَلَيْهِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 144,
        "matchingEnglishURN": 1071440,
        "last_updated": null
    },
    {
        "arabicURN": 1119710,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "67.00",
        "hadithNumber": "1962",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصَّلاَةِ عَلَى مَنْ عَلَيْهِ دَيْنٌ ‏ ",
        "hadithText": "أَخْبَرَنَا نُوحُ بْنُ حَبِيبٍ الْقُومِسِيُّ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم لاَ يُصَلِّي عَلَى رَجُلٍ عَلَيْهِ دَيْنٌ فَأُتِيَ بِمَيِّتٍ فَسَأَلَ ‏\"‏ أَعَلَيْهِ دَيْنٌ ‏\"‏ ‏.‏ قَالُوا نَعَمْ عَلَيْهِ دِينَارَانِ ‏.‏ قَالَ ‏\"‏ صَلُّوا عَلَى صَاحِبِكُمْ ‏\"‏ ‏.‏ قَالَ أَبُو قَتَادَةَ هُمَا عَلَىَّ يَا رَسُولَ اللَّهِ ‏.‏ فَصَلَّى عَلَيْهِ فَلَمَّا فَتَحَ اللَّهُ عَلَى رَسُولِهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَنَا أَوْلَى بِكُلِّ مُؤْمِنٍ مِنْ نَفْسِهِ مَنْ تَرَكَ دَيْنًا فَعَلَىَّ وَمَنْ تَرَكَ مَالاً فَلِوَرَثَتِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 145,
        "matchingEnglishURN": 1071450,
        "last_updated": null
    },
    {
        "arabicURN": 1119720,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "67.00",
        "hadithNumber": "1963",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصَّلاَةِ عَلَى مَنْ عَلَيْهِ دَيْنٌ ‏ ",
        "hadithText": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، وَابْنُ أَبِي ذِئْبٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا تُوُفِّيَ الْمُؤْمِنُ وَعَلَيْهِ دَيْنٌ سَأَلَ ‏\"‏ هَلْ تَرَكَ لِدَيْنِهِ مِنْ قَضَاءٍ ‏\"‏ ‏.‏ فَإِنْ قَالُوا نَعَمْ صَلَّى عَلَيْهِ وَإِنْ قَالُوا لاَ قَالَ ‏\"‏ صَلُّوا عَلَى صَاحِبِكُمْ ‏\"‏ ‏.‏ فَلَمَّا فَتَحَ اللَّهُ عَزَّ وَجَلَّ عَلَى رَسُولِهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَنَا أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ فَمَنْ تُوُفِّيَ وَعَلَيْهِ دَيْنٌ فَعَلَىَّ قَضَاؤُهُ وَمَنْ تَرَكَ مَالاً فَهُوَ لِوَرَثَتِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 146,
        "matchingEnglishURN": 1071460,
        "last_updated": null
    },
    {
        "arabicURN": 1119730,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "68.00",
        "hadithNumber": "1964",
        "bookName": " كتاب الجنائز",
        "babName": " باب تَرْكِ الصَّلاَةِ عَلَى مَنْ قَتَلَ نَفْسَهُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ أَنْبَأَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا أَبُو خَيْثَمَةَ، زُهَيْرٌ قَالَ حَدَّثَنَا سِمَاكٌ، عَنِ جَابِرِ بْنِ سَمُرَةَ، أَنَّ رَجُلاً، قَتَلَ نَفْسَهُ بِمَشَاقِصَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَّا أَنَا فَلاَ أُصَلِّي عَلَيْهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 147,
        "matchingEnglishURN": 1071470,
        "last_updated": null
    },
    {
        "arabicURN": 1119740,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "68.00",
        "hadithNumber": "1965",
        "bookName": " كتاب الجنائز",
        "babName": " باب تَرْكِ الصَّلاَةِ عَلَى مَنْ قَتَلَ نَفْسَهُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، سَمِعْتُ ذَكْوَانَ، يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ تَرَدَّى مِنْ جَبَلٍ فَقَتَلَ نَفْسَهُ فَهُوَ فِي نَارِ جَهَنَّمَ يَتَرَدَّى خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا وَمَنْ تَحَسَّى سُمًّا فَقَتَلَ نَفْسَهُ فَسُمُّهُ فِي يَدِهِ يَتَحَسَّاهُ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا وَمَنْ قَتَلَ نَفْسَهُ بِحَدِيدَةٍ - ثُمَّ انْقَطَعَ عَلَىَّ شَىْءٌ خَالِدٌ يَقُولُ - كَانَتْ حَدِيدَتُهُ فِي يَدِهِ يَجَأُ بِهَا فِي بَطْنِهِ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 148,
        "matchingEnglishURN": 1071480,
        "last_updated": null
    },
    {
        "arabicURN": 1119750,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "69.00",
        "hadithNumber": "1966",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصَّلاَةِ عَلَى الْمُنَافِقِينَ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، قَالَ لَمَّا مَاتَ عَبْدُ اللَّهِ بْنُ أُبَىِّ ابْنِ سَلُولَ دُعِي لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم لِيُصَلِّيَ عَلَيْهِ فَلَمَّا قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَثَبْتُ إِلَيْهِ فَقُلْتُ يَا رَسُولَ اللَّهِ تُصَلِّي عَلَى ابْنِ أُبَىٍّ وَقَدْ قَالَ يَوْمَ كَذَا وَكَذَا كَذَا وَكَذَا أُعَدِّدُ عَلَيْهِ فَتَبَسَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\"‏ أَخِّرْ عَنِّي يَا عُمَرُ ‏\"‏ ‏.‏ فَلَمَّا أَكْثَرْتُ عَلَيْهِ قَالَ ‏\"‏ إِنِّي قَدْ خُيِّرْتُ فَاخْتَرْتُ فَلَوْ عَلِمْتُ أَنِّي لَوْ زِدْتُ عَلَى السَّبْعِينَ غُفِرَ لَهُ لَزِدْتُ عَلَيْهَا ‏\"‏ ‏.‏ فَصَلَّى عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ انْصَرَفَ فَلَمْ يَمْكُثْ إِلاَّ يَسِيرًا حَتَّى نَزَلَتِ الآيَتَانِ مِنْ بَرَاءَةَ ‏<A id=\"q1\" name=\"q1\" href=\"javascript:openquran(8,84,84)\"><c_q1>{‏ وَلاَ تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا وَلاَ تَقُمْ عَلَى قَبْرِهِ إِنَّهُمْ كَفَرُوا بِاللَّهِ وَرَسُولِهِ وَمَاتُوا وَهُمْ فَاسِقُونَ ‏}</c_q1></a>‏ فَعَجِبْتُ بَعْدُ مِنْ جُرْأَتِي عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَئِذٍ وَاللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 149,
        "matchingEnglishURN": 1071490,
        "last_updated": null
    },
    {
        "arabicURN": 1119760,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "70.00",
        "hadithNumber": "1967",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصَّلاَةِ عَلَى الْجَنَازَةِ فِي الْمَسْجِدِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَلِيُّ بْنُ حُجْرٍ، قَالاَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ عَبْدِ الْوَاحِدِ بْنِ حَمْزَةَ، عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، قَالَتْ مَا صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى سُهَيْلِ ابْنِ بَيْضَاءَ إِلاَّ فِي الْمَسْجِدِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 150,
        "matchingEnglishURN": 1071500,
        "last_updated": null
    },
    {
        "arabicURN": 1119770,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "70.00",
        "hadithNumber": "1968",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصَّلاَةِ عَلَى الْجَنَازَةِ فِي الْمَسْجِدِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ عَبْدِ الْوَاحِدِ بْنِ حَمْزَةَ، أَنَّ عَبَّادَ بْنَ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، أَخْبَرَهُ أَنَّ عَائِشَةَ قَالَتْ مَا صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى سُهَيْلِ ابْنِ بَيْضَاءَ إِلاَّ فِي جَوْفِ الْمَسْجِدِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 151,
        "matchingEnglishURN": 1071510,
        "last_updated": null
    },
    {
        "arabicURN": 1119780,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "71.00",
        "hadithNumber": "1969",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصَّلاَةِ عَلَى الْجَنَازَةِ بِاللَّيْلِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو أُمَامَةَ بْنُ سَهْلِ بْنِ حُنَيْفٍ، أَنَّهُ قَالَ اشْتَكَتِ امْرَأَةٌ بِالْعَوَالِي مِسْكِينَةٌ فَكَانَ النَّبِيُّ صلى الله عليه وسلم يَسْأَلُهُمْ عَنْهَا وَقَالَ ‏\"‏ إِنْ مَاتَتْ فَلاَ تَدْفِنُوهَا حَتَّى أُصَلِّيَ عَلَيْهَا ‏\"‏ ‏.‏ فَتُوُفِّيَتْ فَجَاءُوا بِهَا إِلَى الْمَدِينَةِ بَعْدَ الْعَتَمَةِ فَوَجَدُوا رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ نَامَ فَكَرِهُوا أَنْ يُوقِظُوهُ فَصَلُّوا عَلَيْهَا وَدَفَنُوهَا بِبَقِيعِ الْغَرْقَدِ فَلَمَّا أَصْبَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم جَاءُوا فَسَأَلَهُمْ عَنْهَا فَقَالُوا قَدْ دُفِنَتْ يَا رَسُولَ اللَّهِ وَقَدْ جِئْنَاكَ فَوَجَدْنَاكَ نَائِمًا فَكَرِهْنَا أَنْ نُوقِظَكَ ‏.‏ قَالَ ‏\"‏ فَانْطَلِقُوا ‏\"‏ ‏.‏ فَانْطَلَقَ يَمْشِي وَمَشَوْا مَعَهُ حَتَّى أَرَوْهُ قَبْرَهَا فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَصَفُّوا وَرَاءَهُ فَصَلَّى عَلَيْهَا وَكَبَّرَ أَرْبَعًا ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 152,
        "matchingEnglishURN": 1071520,
        "last_updated": null
    },
    {
        "arabicURN": 1119790,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "72.00",
        "hadithNumber": "1970",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصُّفُوفِ عَلَى الْجَنَازَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، عَنْ حَفْصِ بْنِ غِيَاثٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ أَخَاكُمُ النَّجَاشِيَّ قَدْ مَاتَ فَقُومُوا فَصَلُّوا عَلَيْهِ ‏\"‏ ‏.‏ فَقَامَ فَصَفَّ بِنَا كَمَا يُصَفُّ عَلَى الْجَنَازَةِ وَصَلَّى عَلَيْهِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 153,
        "matchingEnglishURN": 1071530,
        "last_updated": null
    },
    {
        "arabicURN": 1119800,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "72.00",
        "hadithNumber": "1971",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصُّفُوفِ عَلَى الْجَنَازَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَعَى لِلنَّاسِ النَّجَاشِيَّ الْيَوْمَ الَّذِي مَاتَ فِيهِ ثُمَّ خَرَجَ بِهِمْ إِلَى الْمُصَلَّى فَصَفَّ بِهِمْ فَصَلَّى عَلَيْهِ وَكَبَّرَ أَرْبَعَ تَكْبِيرَاتٍ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 154,
        "matchingEnglishURN": 1071540,
        "last_updated": null
    },
    {
        "arabicURN": 1119810,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "72.00",
        "hadithNumber": "1972",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصُّفُوفِ عَلَى الْجَنَازَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ، قَالَ نَعَى رَسُولُ اللَّهِ صلى الله عليه وسلم النَّجَاشِيَّ لأَصْحَابِهِ بِالْمَدِينَةِ فَصَفُّوا خَلْفَهُ فَصَلَّى عَلَيْهِ وَكَبَّرَ أَرْبَعًا ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ ابْنُ الْمُسَيَّبِ إِنِّي لَمْ أَفْهَمْهُ كَمَا أَرَدْتَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 155,
        "matchingEnglishURN": 1071550,
        "last_updated": null
    },
    {
        "arabicURN": 1119820,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "72.00",
        "hadithNumber": "1973",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصُّفُوفِ عَلَى الْجَنَازَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ أَخَاكُمْ قَدْ مَاتَ فَقُومُوا فَصَلُّوا عَلَيْهِ ‏\"‏ ‏.‏ فَصَفَفْنَا عَلَيْهِ صَفَّيْنِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 156,
        "matchingEnglishURN": 1071560,
        "last_updated": null
    },
    {
        "arabicURN": 1119830,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "72.00",
        "hadithNumber": "1974",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصُّفُوفِ عَلَى الْجَنَازَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، سَمِعْتُ شُعْبَةَ، يَقُولُ السَّاعَةَ يَخْرُجُ السَّاعَةَ يَخْرُجُ حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ كُنْتُ فِي الصَّفِّ الثَّانِي يَوْمَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى النَّجَاشِيِّ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 157,
        "matchingEnglishURN": 1071570,
        "last_updated": null
    },
    {
        "arabicURN": 1119840,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "72.00",
        "hadithNumber": "1975",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصُّفُوفِ عَلَى الْجَنَازَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، قَالَ حَدَّثَنَا يُونُسُ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي الْمُهَلَّبِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ قَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ أَخَاكُمُ النَّجَاشِيَّ قَدْ مَاتَ فَقُومُوا فَصَلُّوا عَلَيْهِ ‏\"‏ ‏.‏ قَالَ فَقُمْنَا فَصَفَفْنَا عَلَيْهِ كَمَا يُصَفُّ عَلَى الْمَيِّتِ وَصَلَّيْنَا عَلَيْهِ كَمَا يُصَلَّى عَلَى الْمَيِّتِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 158,
        "matchingEnglishURN": 1071580,
        "last_updated": null
    },
    {
        "arabicURN": 1119850,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "73.00",
        "hadithNumber": "1976",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصَّلاَةِ عَلَى الْجَنَازَةِ قَائِمًا ‏‏ ",
        "hadithText": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، عَنْ عَبْدِ الْوَارِثِ، قَالَ حَدَّثَنَا حُسَيْنٌ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ سَمُرَةَ، قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى أُمِّ كَعْبٍ مَاتَتْ فِي نِفَاسِهَا فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الصَّلاَةِ فِي وَسَطِهَا ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 159,
        "matchingEnglishURN": 1071590,
        "last_updated": null
    },
    {
        "arabicURN": 1119860,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "74.00",
        "hadithNumber": "1977",
        "bookName": " كتاب الجنائز",
        "babName": " باب اجْتِمَاعِ جَنَازَةِ صَبِيٍّ وَامْرَأَةٍ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا سَعِيدٌ، قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ عَمَّارٍ، قَالَ حَضَرَتْ جَنَازَةُ صَبِيٍّ وَامْرَأَةٍ فَقُدِّمَ الصَّبِيُّ مِمَّا يَلِي الْقَوْمَ وَوُضِعَتِ الْمَرْأَةُ وَرَاءَهُ فَصَلَّى عَلَيْهِمَا وَفِي الْقَوْمِ أَبُو سَعِيدٍ الْخُدْرِيُّ وَابْنُ عَبَّاسٍ وَأَبُو قَتَادَةَ وَأَبُو هُرَيْرَةَ فَسَأَلْتُهُمْ عَنْ ذَلِكَ فَقَالُوا السُّنَّةُ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 160,
        "matchingEnglishURN": 1071600,
        "last_updated": null
    },
    {
        "arabicURN": 1119870,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "75.00",
        "hadithNumber": "1978",
        "bookName": " كتاب الجنائز",
        "babName": " باب اجْتِمَاعِ جَنَائِزِ الرِّجَالِ وَالنِّسَاءِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ، قَالَ سَمِعْتُ نَافِعًا، يَزْعُمُ أَنَّ ابْنَ عُمَرَ، صَلَّى عَلَى تِسْعِ جَنَائِزَ جَمِيعًا فَجَعَلَ الرِّجَالَ يَلُونَ الإِمَامَ وَالنِّسَاءَ يَلِينَ الْقِبْلَةَ فَصَفَّهُنَّ صَفًّا وَاحِدًا وَوُضِعَتْ جَنَازَةُ أُمِّ كُلْثُومٍ بِنْتِ عَلِيٍّ امْرَأَةِ عُمَرَ بْنِ الْخَطَّابِ وَابْنٍ لَهَا يُقَالُ لَهُ زَيْدٌ وُضِعَا جَمِيعًا وَالإِمَامُ يَوْمَئِذٍ سَعِيدُ بْنُ الْعَاصِ وَفِي النَّاسِ ابْنُ عُمَرَ وَأَبُو هُرَيْرَةَ وَأَبُو سَعِيدٍ وَأَبُو قَتَادَةَ فَوُضِعَ الْغُلاَمُ مِمَّا يَلِي الإِمَامَ فَقَالَ رَجُلٌ فَأَنْكَرْتُ ذَلِكَ فَنَظَرْتُ إِلَى ابْنِ عَبَّاسٍ وَأَبِي هُرَيْرَةَ وَأَبِي سَعِيدٍ وَأَبِي قَتَادَةَ فَقُلْتُ مَا هَذَا قَالُوا هِيَ السُّنَّةُ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 161,
        "matchingEnglishURN": 1071610,
        "last_updated": null
    },
    {
        "arabicURN": 1119880,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "75.00",
        "hadithNumber": "1979",
        "bookName": " كتاب الجنائز",
        "babName": " باب اجْتِمَاعِ جَنَائِزِ الرِّجَالِ وَالنِّسَاءِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا ابْنُ الْمُبَارَكِ، وَالْفَضْلُ بْنُ مُوسَى، ح وَأَخْبَرَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ حُسَيْنٍ الْمُكْتِبِ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى عَلَى أُمِّ فُلاَنٍ مَاتَتْ فِي نِفَاسِهَا فَقَامَ فِي وَسَطِهَا ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 162,
        "matchingEnglishURN": 1071620,
        "last_updated": null
    },
    {
        "arabicURN": 1119890,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "76.00",
        "hadithNumber": "1980",
        "bookName": " كتاب الجنائز",
        "babName": " باب عَدَدِ التَّكْبِيرِ عَلَى الْجَنَازَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَعَى لِلنَّاسِ النَّجَاشِيَّ وَخَرَجَ بِهِمْ فَصَفَّ بِهِمْ وَكَبَّرَ أَرْبَعَ تَكْبِيرَاتٍ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 163,
        "matchingEnglishURN": 1071630,
        "last_updated": null
    },
    {
        "arabicURN": 1119900,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "76.00",
        "hadithNumber": "1981",
        "bookName": " كتاب الجنائز",
        "babName": " باب عَدَدِ التَّكْبِيرِ عَلَى الْجَنَازَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ، قَالَ مَرِضَتِ امْرَأَةٌ مِنْ أَهْلِ الْعَوَالِي وَكَانَ النَّبِيُّ صلى الله عليه وسلم أَحْسَنَ شَىْءٍ عِيَادَةً لِلْمَرِيضِ فَقَالَ ‏\"‏ إِذَا مَاتَتْ فَآذِنُونِي ‏\"‏ ‏.‏ فَمَاتَتْ لَيْلاً فَدَفَنُوهَا وَلَمْ يُعْلِمُوا النَّبِيَّ صلى الله عليه وسلم فَلَمَّا أَصْبَحَ سَأَلَ عَنْهَا فَقَالُوا كَرِهْنَا أَنْ نُوقِظَكَ يَا رَسُولَ اللَّهِ ‏.‏ فَأَتَى قَبْرَهَا فَصَلَّى عَلَيْهَا وَكَبَّرَ أَرْبَعًا ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 164,
        "matchingEnglishURN": 1071640,
        "last_updated": null
    },
    {
        "arabicURN": 1119910,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "76.00",
        "hadithNumber": "1982",
        "bookName": " كتاب الجنائز",
        "babName": " باب عَدَدِ التَّكْبِيرِ عَلَى الْجَنَازَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي عَمْرُو بْنُ مُرَّةَ، عَنِ ابْنِ أَبِي لَيْلَى، أَنَّ زَيْدَ بْنَ أَرْقَمَ، صَلَّى عَلَى جَنَازَةٍ فَكَبَّرَ عَلَيْهَا خَمْسًا وَقَالَ كَبَّرَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 165,
        "matchingEnglishURN": 1071650,
        "last_updated": null
    },
    {
        "arabicURN": 1119920,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "77.00",
        "hadithNumber": "1983",
        "bookName": " كتاب الجنائز",
        "babName": " باب الدُّعَاءِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ أَبِي حَمْزَةَ بْنِ سُلَيْمٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ، عَنْ أَبِيهِ، عَنْ عَوْفِ بْنِ مَالِكٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى عَلَى جَنَازَةٍ يَقُولُ ‏\"‏ اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ وَاعْفُ عَنْهُ وَعَافِهِ وَأَكْرِمْ نُزُلَهُ وَوَسِّعْ مُدْخَلَهُ وَاغْسِلْهُ بِمَاءٍ وَثَلْجٍ وَبَرَدٍ وَنَقِّهِ مِنَ الْخَطَايَا كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ وَأَبْدِلْهُ دَارًا خَيْرًا مِنْ دَارِهِ وَأَهْلاً خَيْرًا مِنْ أَهْلِهِ وَزَوْجًا خَيْرًا مِنْ زَوْجِهِ وَقِهِ عَذَابَ الْقَبْرِ وَعَذَابَ النَّارِ ‏\"‏ ‏.‏ قَالَ عَوْفٌ فَتَمَنَّيْتُ أَنْ لَوْ كُنْتُ الْمَيِّتَ لِدُعَاءِ رَسُولِ اللَّهِ صلى الله عليه وسلم لِذَلِكَ الْمَيِّتِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 166,
        "matchingEnglishURN": 1071660,
        "last_updated": null
    },
    {
        "arabicURN": 1119930,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "77.00",
        "hadithNumber": "1984",
        "bookName": " كتاب الجنائز",
        "babName": " باب الدُّعَاءِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا مَعْنٌ، قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ حَبِيبِ بْنِ عُبَيْدٍ الْكَلاَعِيِّ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ الْحَضْرَمِيِّ، قَالَ سَمِعْتُ عَوْفَ بْنَ مَالِكٍ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُصَلِّي عَلَى مَيِّتٍ فَسَمِعْتُ فِي دُعَائِهِ وَهُوَ يَقُولُ ‏\"‏ اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ وَعَافِهِ وَاعْفُ عَنْهُ وَأَكْرِمْ نُزُلَهُ وَوَسِّعْ مُدْخَلَهُ وَاغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ وَنَقِّهِ مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ وَأَبْدِلْهُ دَارًا خَيْرًا مِنْ دَارِهِ وَأَهْلاً خَيْرًا مِنْ أَهْلِهِ وَزَوْجًا خَيْرًا مِنْ زَوْجِهِ وَأَدْخِلْهُ الْجَنَّةَ وَنَجِّهِ مِنَ النَّارِ - أَوْ قَالَ - وَأَعِذْهُ مِنْ عَذَابِ الْقَبْرِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 167,
        "matchingEnglishURN": 1071670,
        "last_updated": null
    },
    {
        "arabicURN": 1119940,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "77.00",
        "hadithNumber": "1985",
        "bookName": " كتاب الجنائز",
        "babName": " باب الدُّعَاءِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، قَالَ سَمِعْتُ عَمْرَو بْنَ مَيْمُونٍ، يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ رُبَيِّعَةَ السُّلَمِيِّ، وَكَانَ، مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم عَنْ عُبَيْدِ بْنِ خَالِدٍ السُّلَمِيِّ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم آخَى بَيْنَ رَجُلَيْنِ فَقُتِلَ أَحَدُهُمَا وَمَاتَ الآخَرُ بَعْدَهُ فَصَلَّيْنَا عَلَيْهِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَا قُلْتُمْ ‏\"‏ ‏.‏ قَالُوا دَعَوْنَا لَهُ اللَّهُمَّ اغْفِرْ لَهُ اللَّهُمَّ ارْحَمْهُ اللَّهُمَّ أَلْحِقْهُ بِصَاحِبِهِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَأَيْنَ صَلاَتُهُ بَعْدَ صَلاَتِهِ وَأَيْنَ عَمَلُهُ بَعْدَ عَمَلِهِ فَلَمَا بَيْنَهُمَا كَمَا بَيْنَ السَّمَاءِ وَالأَرْضِ ‏\"‏ ‏.‏ قَالَ عَمْرُو بْنُ مَيْمُونٍ أَعْجَبَنِي لأَنَّهُ أَسْنَدَ لِي ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 168,
        "matchingEnglishURN": 1071680,
        "last_updated": null
    },
    {
        "arabicURN": 1119950,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "77.00",
        "hadithNumber": "1986",
        "bookName": " كتاب الجنائز",
        "babName": " باب الدُّعَاءِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ زُرَيْعٍ - قَالَ حَدَّثَنَا هِشَامُ بْنُ أَبِي عَبْدِ اللَّهِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي إِبْرَاهِيمَ الأَنْصَارِيِّ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ فِي الصَّلاَةِ عَلَى الْمَيِّتِ ‏\"‏ اللَّهُمَّ اغْفِرْ لِحَيِّنَا وَمَيِّتِنَا وَشَاهِدِنَا وَغَائِبِنَا وَذَكَرِنَا وَأُنْثَانَا وَصَغِيرِنَا وَكَبِيرِنَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 169,
        "matchingEnglishURN": 1071690,
        "last_updated": null
    },
    {
        "arabicURN": 1119960,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "77.00",
        "hadithNumber": "1987",
        "bookName": " كتاب الجنائز",
        "babName": " باب الدُّعَاءِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا الْهَيْثَمُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ، - وَهُوَ ابْنُ سَعْدٍ - قَالَ حَدَّثَنَا أَبِي، عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ، قَالَ صَلَّيْتُ خَلْفَ ابْنِ عَبَّاسٍ عَلَى جَنَازَةٍ فَقَرَأَ بِفَاتِحَةِ الْكِتَابِ وَسُورَةٍ وَجَهَرَ حَتَّى أَسْمَعَنَا فَلَمَّا فَرَغَ أَخَذْتُ بِيَدِهِ فَسَأَلْتُهُ فَقَالَ سُنَّةٌ وَحَقٌّ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 170,
        "matchingEnglishURN": 1071700,
        "last_updated": null
    },
    {
        "arabicURN": 1119970,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "77.00",
        "hadithNumber": "1988",
        "bookName": " كتاب الجنائز",
        "babName": " باب الدُّعَاءِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ، قَالَ صَلَّيْتُ خَلْفَ ابْنِ عَبَّاسٍ عَلَى جَنَازَةٍ فَسَمِعْتُهُ يَقْرَأُ، بِفَاتِحَةِ الْكِتَابِ فَلَمَّا انْصَرَفَ أَخَذْتُ بِيَدِهِ فَسَأَلْتُهُ فَقُلْتُ تَقْرَأُ قَالَ نَعَمْ إِنَّهُ حَقٌّ وَسُنَّةٌ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 171,
        "matchingEnglishURN": 1071710,
        "last_updated": null
    },
    {
        "arabicURN": 1119980,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "77.00",
        "hadithNumber": "1989",
        "bookName": " كتاب الجنائز",
        "babName": " باب الدُّعَاءِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي أُمَامَةَ، أَنَّهُ قَالَ السُّنَّةُ فِي الصَّلاَةِ عَلَى الْجَنَازَةِ أَنْ يَقْرَأَ فِي التَّكْبِيرَةِ الأُولَى بِأُمِّ الْقُرْآنِ مُخَافَتَةً ثُمَّ يُكَبِّرَ ثَلاَثًا وَالتَّسْلِيمُ عِنْدَ الآخِرَةِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 172,
        "matchingEnglishURN": 1071720,
        "last_updated": null
    },
    {
        "arabicURN": 1119990,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "77.00",
        "hadithNumber": "1990",
        "bookName": " كتاب الجنائز",
        "babName": " باب الدُّعَاءِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ مُحَمَّدِ بْنِ سُوَيْدٍ الدِّمَشْقِيِّ الْفِهْرِيِّ، عَنِ الضَّحَّاكِ بْنِ قَيْسٍ الدِّمَشْقِيِّ، بِنَحْوِ ذَلِكَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 173,
        "matchingEnglishURN": 1071730,
        "last_updated": null
    },
    {
        "arabicURN": 1120000,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "78.00",
        "hadithNumber": "1991",
        "bookName": " كتاب الجنائز",
        "babName": " باب فَضْلِ مَنْ صَلَّى عَلَيْهِ مِائَةٌ ‏‏ ",
        "hadithText": "أَخْبَرَنَا سُوَيْدٌ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ سَلاَّمِ بْنِ أَبِي مُطِيعٍ الدِّمَشْقِيِّ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، رَضِيعِ عَائِشَةَ عَنْ عَائِشَةَ، رَضِيَ اللَّهُ عَنْهَا عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَا مِنْ مَيِّتٍ يُصَلِّي عَلَيْهِ أُمَّةٌ مِنَ الْمُسْلِمِينَ يَبْلُغُونَ أَنْ يَكُونُوا مِائَةً يَشْفَعُونَ إِلاَّ شُفِّعُوا فِيهِ ‏\"‏ ‏.‏ قَالَ سَلاَّمٌ فَحَدَّثْتُ بِهِ شُعَيْبَ بْنَ الْحَبْحَابِ فَقَالَ حَدَّثَنِي بِهِ أَنَسُ بْنُ مَالِكٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 174,
        "matchingEnglishURN": 1071740,
        "last_updated": null
    },
    {
        "arabicURN": 1120010,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "78.00",
        "hadithNumber": "1992",
        "bookName": " كتاب الجنائز",
        "babName": " باب فَضْلِ مَنْ صَلَّى عَلَيْهِ مِائَةٌ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ، قَالَ أَنْبَأَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، - رَضِيعٌ لِعَائِشَةَ رضى الله عنها - عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَمُوتُ أَحَدٌ مِنَ الْمُسْلِمِينَ فَيُصَلِّي عَلَيْهِ أُمَّةٌ مِنَ النَّاسِ فَيَبْلُغُوا أَنْ يَكُونُوا مِائَةً فَيَشْفَعُوا إِلاَّ شُفِّعُوا فِيهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 175,
        "matchingEnglishURN": 1071750,
        "last_updated": null
    },
    {
        "arabicURN": 1120020,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "78.00",
        "hadithNumber": "1993",
        "bookName": " كتاب الجنائز",
        "babName": " باب فَضْلِ مَنْ صَلَّى عَلَيْهِ مِائَةٌ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ سَوَاءٍ أَبُو الْخَطَّابِ، قَالَ حَدَّثَنَا أَبُو بَكَّارٍ الْحَكَمُ بْنُ فَرُّوخٍ، قَالَ صَلَّى بِنَا أَبُو الْمَلِيحِ عَلَى جَنَازَةٍ فَظَنَنَّا أَنَّهُ قَدْ كَبَّرَ فَأَقْبَلَ عَلَيْنَا بِوَجْهِهِ فَقَالَ أَقِيمُوا صُفُوفَكُمْ وَلْتَحْسُنْ شَفَاعَتُكُمْ قَالَ أَبُو الْمَلِيحِ حَدَّثَنِي عَبْدُ اللَّهِ - وَهُوَ ابْنُ سَلِيطٍ - عَنْ إِحْدَى أُمَّهَاتِ الْمُؤْمِنِينَ وَهِيَ مَيْمُونَةُ زَوْجُ النَّبِيِّ صلى الله عليه وسلم قَالَتْ أَخْبَرَنِي النَّبِيُّ صلى الله عليه وسلم قَالَ ‏\"‏ مَا مِنْ مَيِّتٍ يُصَلِّي عَلَيْهِ أُمَّةٌ مِنَ النَّاسِ إِلاَّ شُفِّعُوا فِيهِ ‏\"‏ ‏.‏ فَسَأَلْتُ أَبَا الْمَلِيحِ عَنِ الأُمَّةِ فَقَالَ أَرْبَعُونَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 176,
        "matchingEnglishURN": 1071760,
        "last_updated": null
    },
    {
        "arabicURN": 1120030,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "79.00",
        "hadithNumber": "1994",
        "bookName": " كتاب الجنائز",
        "babName": " باب ثَوَابِ مَنْ صَلَّى عَلَى جَنَازَةٍ ‏‏ ",
        "hadithText": "أَخْبَرَنَا نُوحُ بْنُ حَبِيبٍ، قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ صَلَّى عَلَى جَنَازَةٍ فَلَهُ قِيرَاطٌ وَمَنِ انْتَظَرَهَا حَتَّى تُوضَعَ فِي اللَّحْدِ فَلَهُ قِيرَاطَانِ وَالْقِيرَاطَانِ مِثْلُ الْجَبَلَيْنِ الْعَظِيمَيْنِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 177,
        "matchingEnglishURN": 1071770,
        "last_updated": null
    },
    {
        "arabicURN": 1120040,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "79.00",
        "hadithNumber": "1995",
        "bookName": " كتاب الجنائز",
        "babName": " باب ثَوَابِ مَنْ صَلَّى عَلَى جَنَازَةٍ ‏‏ ",
        "hadithText": "أَخْبَرَنَا سُوَيْدٌ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ الأَعْرَجُ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ شَهِدَ جَنَازَةً حَتَّى يُصَلَّى عَلَيْهَا فَلَهُ قِيرَاطٌ وَمَنْ شَهِدَ حَتَّى تُدْفَنَ فَلَهُ قِيرَاطَانِ ‏\"‏ ‏.‏ قِيلَ وَمَا الْقِيرَاطَانِ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ مِثْلُ الْجَبَلَيْنِ الْعَظِيمَيْنِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 178,
        "matchingEnglishURN": 1071780,
        "last_updated": null
    },
    {
        "arabicURN": 1120050,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "79.00",
        "hadithNumber": "1996",
        "bookName": " كتاب الجنائز",
        "babName": " باب ثَوَابِ مَنْ صَلَّى عَلَى جَنَازَةٍ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ عَوْفٍ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ تَبِعَ جَنَازَةَ رَجُلٍ مُسْلِمٍ احْتِسَابًا فَصَلَّى عَلَيْهَا وَدَفَنَهَا فَلَهُ قِيرَاطَانِ وَمَنْ صَلَّى عَلَيْهَا ثُمَّ رَجَعَ قَبْلَ أَنْ تُدْفَنَ فَإِنَّهُ يَرْجِعُ بِقِيرَاطٍ مِنَ الأَجْرِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 179,
        "matchingEnglishURN": 1071790,
        "last_updated": null
    },
    {
        "arabicURN": 1120060,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "79.00",
        "hadithNumber": "1997",
        "bookName": " كتاب الجنائز",
        "babName": " باب ثَوَابِ مَنْ صَلَّى عَلَى جَنَازَةٍ ‏‏ ",
        "hadithText": "أَخْبَرَنَا الْحَسَنُ بْنُ قَزَعَةَ، قَالَ حَدَّثَنَا مَسْلَمَةُ بْنُ عَلْقَمَةَ، قَالَ أَنْبَأَنَا دَاوُدُ، عَنْ عَامِرٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ تَبِعَ جَنَازَةً فَصَلَّى عَلَيْهَا ثُمَّ انْصَرَفَ فَلَهُ قِيرَاطٌ مِنَ الأَجْرِ وَمَنْ تَبِعَهَا فَصَلَّى عَلَيْهَا ثُمَّ قَعَدَ حَتَّى يُفْرَغَ مِنْ دَفْنِهَا فَلَهُ قِيرَاطَانِ مِنَ الأَجْرِ كُلُّ وَاحِدٍ مِنْهُمَا أَعْظَمُ مِنْ أُحُدٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 180,
        "matchingEnglishURN": 1071800,
        "last_updated": null
    },
    {
        "arabicURN": 1120070,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "80.00",
        "hadithNumber": "1998",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْجُلُوسِ قَبْلَ أَنْ تُوضَعَ الْجَنَازَةُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ هِشَامٍ، وَالأَوْزَاعِيِّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا رَأَيْتُمُ الْجَنَازَةَ فَقُومُوا وَمَنْ تَبِعَهَا فَلاَ يَقْعُدَنَّ حَتَّى تُوضَعَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 181,
        "matchingEnglishURN": 1071810,
        "last_updated": null
    },
    {
        "arabicURN": 1120080,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "81.00",
        "hadithNumber": "1999",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْوُقُوفِ لِلْجَنَائِزِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَحْيَى، عَنْ وَاقِدٍ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنْ مَسْعُودِ بْنِ الْحَكَمِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، ‏:‏ أَنَّهُ ذُكِرَ الْقِيَامُ عَلَى الْجَنَازَةِ حَتَّى تُوضَعَ، فَقَالَ عَلِيُّ بْنُ أَبِي طَالِبٍ ‏:‏ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَعَدَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 182,
        "matchingEnglishURN": 1071820,
        "last_updated": null
    },
    {
        "arabicURN": 1120090,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "81.00",
        "hadithNumber": "2000",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْوُقُوفِ لِلْجَنَائِزِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ الْمُنْكَدِرِ، عَنْ مَسْعُودِ بْنِ الْحَكَمِ، عَنْ عَلِيٍّ، قَالَ ‏:‏ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ فَقُمْنَا، وَرَأَيْنَاهُ قَعَدَ فَقَعَدْنَا ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 183,
        "matchingEnglishURN": 1071830,
        "last_updated": null
    },
    {
        "arabicURN": 1120100,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "81.00",
        "hadithNumber": "2001",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْوُقُوفِ لِلْجَنَائِزِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَاقَ، قَالَ حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ عَمْرِو بْنِ قَيْسٍ، عَنِ الْمِنْهَالِ بْنِ عَمْرٍو، عَنْ زَاذَانَ، عَنِ الْبَرَاءِ، قَالَ ‏:‏ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي جَنَازَةٍ، فَلَمَّا انْتَهَيْنَا إِلَى الْقَبْرِ وَلَمْ يُلْحَدْ، فَجَلَسَ وَجَلَسْنَا حَوْلَهُ كَأَنَّ عَلَى رُءُوسِنَا الطَّيْرَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 184,
        "matchingEnglishURN": 1071840,
        "last_updated": null
    },
    {
        "arabicURN": 1120110,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "82.00",
        "hadithNumber": "2002",
        "bookName": " كتاب الجنائز",
        "babName": " باب مُوَارَاةِ الشَّهِيدِ فِي دَمِهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا هَنَّادٌ، عَنِ ابْنِ الْمُبَارَكِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ ثَعْلَبَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِقَتْلَى أُحُدٍ ‏:‏ ‏\"‏ زَمِّلُوهُمْ بِدِمَائِهِمْ، فَإِنَّهُ لَيْسَ كَلْمٌ يُكْلَمُ فِي اللَّهِ إِلاَّ يَأْتِي يَوْمَ الْقِيَامَةِ يَدْمَى، لَوْنُهُ لَوْنُ الدَّمِ وَرِيحُهُ رِيحُ الْمِسْكِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 185,
        "matchingEnglishURN": 1071850,
        "last_updated": null
    },
    {
        "arabicURN": 1120120,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "83.00",
        "hadithNumber": "2003",
        "bookName": " كتاب الجنائز",
        "babName": " باب أَيْنَ يُدْفَنُ الشَّهِيدُ  ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا وَكِيعٌ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ السَّائِبِ، عَنْ رَجُلٍ، يُقَالُ لَهُ عُبَيْدُ اللَّهِ بْنُ مُعَيَّةَ قَالَ ‏:‏ أُصِيبَ رَجُلاَنِ مِنَ الْمُسْلِمِينَ يَوْمَ الطَّائِفِ، فَحُمِلاَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَمَرَ أَنْ يُدْفَنَا حَيْثُ أُصِيبَا ‏.‏ وَكَانَ ابْنُ مُعَيَّةَ وُلِدَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 186,
        "matchingEnglishURN": 1071860,
        "last_updated": null
    },
    {
        "arabicURN": 1120130,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "83.00",
        "hadithNumber": "2004",
        "bookName": " كتاب الجنائز",
        "babName": " باب أَيْنَ يُدْفَنُ الشَّهِيدُ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا الأَسْوَدُ بْنُ قَيْسٍ، عَنْ نُبَيْحٍ الْعَنَزِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، ‏:‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ بِقَتْلَى أُحُدٍ أَنْ يُرَدُّوا إِلَى مَصَارِعِهِمْ، وَكَانُوا قَدْ نُقِلُوا إِلَى الْمَدِينَةِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 187,
        "matchingEnglishURN": 1071870,
        "last_updated": null
    },
    {
        "arabicURN": 1120140,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "83.00",
        "hadithNumber": "2005",
        "bookName": " كتاب الجنائز",
        "babName": " باب أَيْنَ يُدْفَنُ الشَّهِيدُ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنِ الأَسْوَدِ بْنِ قَيْسٍ، عَنْ نُبَيْحٍ الْعَنَزِيِّ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏:‏ ‏\"‏ ادْفِنُوا الْقَتْلَى فِي مَصَارِعِهِمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 188,
        "matchingEnglishURN": 1071880,
        "last_updated": null
    },
    {
        "arabicURN": 1120150,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "84.00",
        "hadithNumber": "2006",
        "bookName": " كتاب الجنائز",
        "babName": " باب مُوَارَاةِ الْمُشْرِكِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي أَبُو إِسْحَاقَ، عَنْ نَاجِيَةَ بْنِ كَعْبٍ، عَنْ عَلِيٍّ، قَالَ قُلْتُ لِلنَّبِيِّ صلى الله عليه وسلم، إِنَّ عَمَّكَ الشَّيْخَ الضَّالَّ مَاتَ، فَمَنْ يُوَارِيهِ قَالَ ‏:‏ ‏\"‏ اذْهَبْ فَوَارِ أَبَاكَ وَلاَ تُحْدِثَنَّ حَدَثًا حَتَّى تَأْتِيَنِي ‏\"‏ ‏.‏ فَوَارَيْتُهُ ثُمَّ جِئْتُ فَأَمَرَنِي فَاغْتَسَلْتُ وَدَعَا لِي، وَذَكَرَ دُعَاءً لَمْ أَحْفَظْهُ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 189,
        "matchingEnglishURN": 1071890,
        "last_updated": null
    },
    {
        "arabicURN": 1120160,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "85.00",
        "hadithNumber": "2007",
        "bookName": " كتاب الجنائز",
        "babName": " باب اللَّحْدِ وَالشَّقِّ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ، عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، عَنْ سَعْدٍ، قَالَ ‏:‏ الْحَدُوا لِي لَحْدًا، وَانْصِبُوا عَلَىَّ نَصْبًا كَمَا فُعِلَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 190,
        "matchingEnglishURN": 1071900,
        "last_updated": null
    },
    {
        "arabicURN": 1120170,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "85.00",
        "hadithNumber": "2008",
        "bookName": " كتاب الجنائز",
        "babName": " باب اللَّحْدِ وَالشَّقِّ ‏‏ ",
        "hadithText": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا أَبُو عَامِرٍ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدٍ، عَنْ عَامِرِ بْنِ سَعْدٍ، ‏:‏ أَنَّ سَعْدًا، لَمَّا حَضَرَتْهُ الْوَفَاةُ قَالَ ‏:‏ الْحَدُوا لِي لَحْدًا، وَانْصِبُوا عَلَىَّ نَصْبًا كَمَا فُعِلَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 191,
        "matchingEnglishURN": 1071910,
        "last_updated": null
    },
    {
        "arabicURN": 1120180,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "85.00",
        "hadithNumber": "2009",
        "bookName": " كتاب الجنائز",
        "babName": " باب اللَّحْدِ وَالشَّقِّ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ أَبُو عَبْدِ الرَّحْمَنِ الأَذْرَمِيُّ، عَنْ حَكَّامِ بْنِ سَلْمٍ الرَّازِيِّ، عَنْ عَلِيِّ بْنِ عَبْدِ الأَعْلَى، عَنْ أَبِيهِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏:‏ ‏\"‏ اللَّحْدُ لَنَا وَالشَّقُّ لِغَيْرِنَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 192,
        "matchingEnglishURN": 1071920,
        "last_updated": null
    },
    {
        "arabicURN": 1120190,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "86.00",
        "hadithNumber": "2010",
        "bookName": " كتاب الجنائز",
        "babName": " باب مَا يُسْتَحَبُّ مِنْ إِعْمَاقِ الْقَبْرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ هِشَامِ بْنِ عَامِرٍ، قَالَ ‏:‏ شَكَوْنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ أُحُدٍ فَقُلْنَا ‏:‏ يَا رَسُولَ اللَّهِ الْحَفْرُ عَلَيْنَا لِكُلِّ إِنْسَانٍ شَدِيدٌ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏:‏ ‏\"‏ احْفِرُوا وَأَعْمِقُوا وَأَحْسِنُوا، وَادْفِنُوا الاِثْنَيْنِ وَالثَّلاَثَةَ فِي قَبْرٍ وَاحِدٍ ‏\"‏ ‏.‏ قَالُوا ‏:‏ فَمَنْ نُقَدِّمُ يَا رَسُولَ اللَّهِ قَالَ ‏:‏ ‏\"‏ قَدِّمُوا أَكْثَرَهُمْ قُرْآنًا ‏\"‏ ‏.‏ قَالَ ‏:‏ فَكَانَ أَبِي ثَالِثَ ثَلاَثَةٍ فِي قَبْرٍ وَاحِدٍ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 193,
        "matchingEnglishURN": 1071930,
        "last_updated": null
    },
    {
        "arabicURN": 1120200,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "87.00",
        "hadithNumber": "2011",
        "bookName": " كتاب الجنائز",
        "babName": " باب مَا يُسْتَحَبُّ مِنْ تَوْسِيعِ الْقَبْرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، قَالَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، قَالَ حَدَّثَنَا أَبِي قَالَ، سَمِعْتُ حُمَيْدَ بْنَ هِلاَلٍ، عَنْ سَعْدِ بْنِ هِشَامِ بْنِ عَامِرٍ، عَنْ أَبِيهِ، قَالَ ‏:‏ لَمَّا كَانَ يَوْمُ أُحُدٍ أُصِيبَ مِنَ الْمُسْلِمِينَ، وَأَصَابَ النَّاسَ جِرَاحَاتٌ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏:‏ ‏\"‏ احْفِرُوا وَأَوْسِعُوا، وَادْفِنُوا الاِثْنَيْنِ وَالثَّلاَثَةَ فِي الْقَبْرِ، وَقَدِّمُوا أَكْثَرَهُمْ قُرْآنًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 194,
        "matchingEnglishURN": 1071940,
        "last_updated": null
    },
    {
        "arabicURN": 1120210,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "88.00",
        "hadithNumber": "2012",
        "bookName": " كتاب الجنائز",
        "babName": " باب وَضْعِ الثَّوْبِ فِي اللَّحْدِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، عَنْ يَزِيدَ، - وَهُوَ ابْنُ زُرَيْعٍ - قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي جَمْرَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ ‏:‏ جُعِلَ تَحْتَ رَسُولِ اللَّهِ صلى الله عليه وسلم حِينَ دُفِنَ قَطِيفَةٌ حَمْرَاءُ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 195,
        "matchingEnglishURN": 1071950,
        "last_updated": null
    },
    {
        "arabicURN": 1120220,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "89.00",
        "hadithNumber": "2013",
        "bookName": " كتاب الجنائز",
        "babName": " باب السَّاعَاتِ الَّتِي نُهِيَ عَنْ إِقْبَارِ الْمَوْتَى، فِيهِنَّ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا مُوسَى بْنُ عُلَىِّ بْنِ رَبَاحٍ، قَالَ سَمِعْتُ أَبِي قَالَ، سَمِعْتُ عُقْبَةَ بْنَ عَامِرٍ الْجُهَنِيَّ، قَالَ ‏:‏ ثَلاَثُ سَاعَاتٍ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَنْهَانَا أَنْ نُصَلِّيَ فِيهِنَّ، أَوْ نَقْبُرَ فِيهِنَّ مَوْتَانَا ‏:‏ حِينَ تَطْلُعُ الشَّمْسُ بَازِغَةً حَتَّى تَرْتَفِعَ، وَحِينَ يَقُومُ قَائِمُ الظَّهِيرَةِ حَتَّى تَزُولَ الشَّمْسُ، وَحِينَ تَضَيَّفُ الشَّمْسُ لِلْغُرُوبِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 196,
        "matchingEnglishURN": 1071960,
        "last_updated": null
    },
    {
        "arabicURN": 1120230,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "89.00",
        "hadithNumber": "2014",
        "bookName": " كتاب الجنائز",
        "babName": " باب السَّاعَاتِ الَّتِي نُهِيَ عَنْ إِقْبَارِ الْمَوْتَى، فِيهِنَّ ‏‏ ",
        "hadithText": "أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ الْقَطَّانُ الرَّقِّيُّ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرًا، يَقُولُ ‏:‏ خَطَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَذَكَرَ رَجُلاً مِنْ أَصْحَابِهِ مَاتَ فَقُبِرَ لَيْلاً، وَكُفِّنَ فِي كَفَنٍ غَيْرِ طَائِلٍ، فَزَجَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُقْبَرَ إِنْسَانٌ لَيْلاً إِلاَّ أَنْ يُضْطَرَّ إِلَى ذَلِكَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 197,
        "matchingEnglishURN": 1071970,
        "last_updated": null
    },
    {
        "arabicURN": 1120240,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "90.00",
        "hadithNumber": "2015",
        "bookName": " كتاب الجنائز",
        "babName": " باب دَفْنِ الْجَمَاعَةِ فِي الْقَبْرِ الْوَاحِدِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا وَكِيعٌ، عَنْ سُلَيْمَانَ بْنِ الْمُغِيرَةِ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ هِشَامِ بْنِ عَامِرٍ، قَالَ ‏:‏ لَمَّا كَانَ يَوْمُ أُحُدٍ أَصَابَ النَّاسَ جَهْدٌ شَدِيدٌ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏:‏ ‏\"‏ احْفِرُوا وَأَوْسِعُوا، وَادْفِنُوا الاِثْنَيْنِ وَالثَّلاَثَةَ فِي قَبْرٍ ‏\"‏ ‏.‏ فَقَالُوا ‏:‏ يَا رَسُولَ اللَّهِ فَمَنْ نُقَدِّمُ قَالَ ‏:‏ ‏\"‏ قَدِّمُوا أَكْثَرَهُمْ قُرْآنًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 198,
        "matchingEnglishURN": 1071980,
        "last_updated": null
    },
    {
        "arabicURN": 1120250,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "90.00",
        "hadithNumber": "2016",
        "bookName": " كتاب الجنائز",
        "babName": " باب دَفْنِ الْجَمَاعَةِ فِي الْقَبْرِ الْوَاحِدِ ‏‏ ",
        "hadithText": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ، قَالَ أَنْبَأَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ سَعْدِ بْنِ هِشَامِ بْنِ عَامِرٍ، عَنْ أَبِيهِ، قَالَ ‏:‏ اشْتَدَّ الْجِرَاحُ يَوْمَ أُحُدٍ فَشُكِيَ ذَلِكَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏:‏ ‏\"‏ احْفِرُوا وَأَوْسِعُوا وَأَحْسِنُوا، وَادْفِنُوا فِي الْقَبْرِ الاِثْنَيْنِ وَالثَّلاَثَةَ، وَقَدِّمُوا أَكْثَرَهُمْ قُرْآنًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 199,
        "matchingEnglishURN": 1071990,
        "last_updated": null
    },
    {
        "arabicURN": 1120260,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "90.00",
        "hadithNumber": "2017",
        "bookName": " كتاب الجنائز",
        "babName": " باب دَفْنِ الْجَمَاعَةِ فِي الْقَبْرِ الْوَاحِدِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ، قَالَ حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَيُّوبَ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ أَبِي الدَّهْمَاءِ، عَنْ هِشَامِ بْنِ عَامِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏:‏ ‏\"‏ احْفِرُوا وَأَحْسِنُوا، وَادْفِنُوا الاِثْنَيْنِ وَالثَّلاَثَةَ، وَقَدِّمُوا أَكْثَرَهُمْ قُرْآنًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 200,
        "matchingEnglishURN": 1072000,
        "last_updated": null
    },
    {
        "arabicURN": 1120270,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "91.00",
        "hadithNumber": "2018",
        "bookName": " كتاب الجنائز",
        "babName": " باب مَنْ يُقَدَّمُ ‏‏ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ هِشَامِ بْنِ عَامِرٍ، قَالَ ‏:‏ قُتِلَ أَبِي يَوْمَ أُحُدٍ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏:‏ ‏\"‏ احْفِرُوا وَأَوْسِعُوا وَأَحْسِنُوا، وَادْفِنُوا الاِثْنَيْنِ وَالثَّلاَثَةَ فِي الْقَبْرِ، وَقَدِّمُوا أَكْثَرَهُمْ قُرْآنًا ‏\"‏ ‏.‏ فَكَانَ أَبِي ثَالِثَ ثَلاَثَةٍ وَكَانَ أَكْثَرَهُمْ قُرْآنًا فَقُدِّمَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 201,
        "matchingEnglishURN": 1072010,
        "last_updated": null
    },
    {
        "arabicURN": 1120280,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "92.00",
        "hadithNumber": "2019",
        "bookName": " كتاب الجنائز",
        "babName": " باب إِخْرَاجِ الْمَيِّتِ مِنَ اللَّحْدِ بَعْدَ أَنْ يُوضَعَ فِيهِ ‏‏ ",
        "hadithText": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنْ سُفْيَانَ، قَالَ سَمِعَ عَمْرٌو، جَابِرًا يَقُولُ ‏:‏ أَتَى النَّبِيُّ صلى الله عليه وسلم عَبْدَ اللَّهِ بْنَ أُبَىٍّ بَعْدَ مَا أُدْخِلَ فِي قَبْرِهِ، فَأَمَرَ بِهِ فَأُخْرِجَ فَوَضَعَهُ عَلَى رُكْبَتَيْهِ، وَنَفَثَ عَلَيْهِ مِنْ رِيقِهِ وَأَلْبَسَهُ قَمِيصَهُ، وَاللَّهُ أَعْلَمُ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 202,
        "matchingEnglishURN": 1072020,
        "last_updated": null
    },
    {
        "arabicURN": 1120290,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "92.00",
        "hadithNumber": "2020",
        "bookName": " كتاب الجنائز",
        "babName": " باب إِخْرَاجِ الْمَيِّتِ مِنَ اللَّحْدِ بَعْدَ أَنْ يُوضَعَ فِيهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنِ الْحُسَيْنِ بْنِ وَاقِدٍ، قَالَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، قَالَ سَمِعْتُ جَابِرًا، يَقُولُ ‏:‏ إِنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ بِعَبْدِ اللَّهِ بْنِ أُبَىٍّ فَأَخْرَجَهُ مِنْ قَبْرِهِ، فَوَضَعَ رَأْسَهُ عَلَى رُكْبَتَيْهِ فَتَفَلَ فِيهِ مِنْ رِيقِهِ، وَأَلْبَسَهُ قَمِيصَهُ ‏.‏ قَالَ جَابِرٌ ‏:‏ وَصَلَّى عَلَيْهِ وَاللَّهُ أَعْلَمُ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 203,
        "matchingEnglishURN": 1072030,
        "last_updated": null
    },
    {
        "arabicURN": 1120300,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "93.00",
        "hadithNumber": "2021",
        "bookName": " كتاب الجنائز",
        "babName": " باب إِخْرَاجِ الْمَيِّتِ مِنَ الْقَبْرِ بَعْدَ أَنْ يُدْفَنَ فِيهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ، عَنْ سَعِيدِ بْنِ عَامِرٍ، عَنْ شُعْبَةَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ ‏:‏ دُفِنَ مَعَ أَبِي رَجُلٌ فِي الْقَبْرِ فَلَمْ يَطِبْ قَلْبِي حَتَّى أَخْرَجْتُهُ وَدَفَنْتُهُ عَلَى حِدَةٍ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 204,
        "matchingEnglishURN": 1072040,
        "last_updated": null
    },
    {
        "arabicURN": 1120310,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "94.00",
        "hadithNumber": "2022",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصَّلاَةِ عَلَى الْقَبْرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ أَبُو قُدَامَةَ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، قَالَ حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ، عَنْ خَارِجَةَ بْنِ زَيْدِ بْنِ ثَابِتٍ، عَنْ عَمِّهِ، يَزِيدَ بْنِ ثَابِتٍ ‏:‏ أَنَّهُمْ خَرَجُوا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ، فَرَأَى قَبْرًا جَدِيدًا فَقَالَ ‏:‏ ‏\"‏ مَا هَذَا ‏\"‏ ‏.‏ قَالُوا ‏:‏ هَذِهِ فُلاَنَةُ مَوْلاَةُ بَنِي فُلاَنٍ، فَعَرَفَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم مَاتَتْ ظُهْرًا وَأَنْتَ نَائِمٌ قَائِلٌ، فَلَمْ نُحِبَّ أَنْ نُوقِظَكَ بِهَا ‏.‏ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَصَفَّ النَّاسَ خَلْفَهُ وَكَبَّرَ عَلَيْهَا أَرْبَعًا ثُمَّ قَالَ ‏:‏ ‏\"‏ لاَ يَمُوتُ فِيكُمْ مَيِّتٌ مَا دُمْتُ بَيْنَ أَظْهُرِكُمْ إِلاَّ آذَنْتُمُونِي بِهِ، فَإِنَّ صَلاَتِي لَهُ رَحْمَةٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 205,
        "matchingEnglishURN": 1072050,
        "last_updated": null
    },
    {
        "arabicURN": 1120320,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "94.00",
        "hadithNumber": "2023",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصَّلاَةِ عَلَى الْقَبْرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ الشَّيْبَانِيِّ، عَنِ الشَّعْبِيِّ، ‏:‏ أَخْبَرَنِي مَنْ، مَرَّ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى قَبْرٍ مُنْتَبِذٍ، فَأَمَّهُمْ وَصَفَّ خَلْفَهُ، قُلْتُ ‏:‏ مَنْ هُوَ يَا أَبَا عَمْرٍو قَالَ ‏:‏ ابْنُ عَبَّاسٍ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 206,
        "matchingEnglishURN": 1072060,
        "last_updated": null
    },
    {
        "arabicURN": 1120330,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "94.00",
        "hadithNumber": "2024",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصَّلاَةِ عَلَى الْقَبْرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا هُشَيْمٌ، قَالَ الشَّيْبَانِيُّ أَنْبَأَنَا عَنِ الشَّعْبِيِّ، قَالَ أَخْبَرَنِي مَنْ، رَأَى النَّبِيَّ صلى الله عليه وسلم مَرَّ بِقَبْرٍ مُنْتَبِذٍ، فَصَلَّى عَلَيْهِ وَصَفَّ أَصْحَابَهُ خَلْفَهُ ‏.‏ قِيلَ ‏:‏ مَنْ حَدَّثَكَ قَالَ ‏:‏ ابْنُ عَبَّاسٍ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 207,
        "matchingEnglishURN": 1072070,
        "last_updated": null
    },
    {
        "arabicURN": 1120340,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "94.00",
        "hadithNumber": "2025",
        "bookName": " كتاب الجنائز",
        "babName": " باب الصَّلاَةِ عَلَى الْقَبْرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا زَيْدُ بْنُ عَلِيٍّ، - وَهُوَ أَبُو أُسَامَةَ - قَالَ حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ، عَنْ حَبِيبِ بْنِ أَبِي مَرْزُوقٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، ‏:‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى عَلَى قَبْرِ امْرَأَةٍ بَعْدَ مَا دُفِنَتْ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 208,
        "matchingEnglishURN": 1072080,
        "last_updated": null
    },
    {
        "arabicURN": 1120350,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "95.00",
        "hadithNumber": "2026",
        "bookName": " كتاب الجنائز",
        "babName": " باب الرُّكُوبِ بَعْدَ الْفَرَاغِ مِنَ الْجَنَازَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، وَيَحْيَى بْنُ آدَمَ، قَالاَ حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ ‏:‏ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى جَنَازَةِ أَبِي الدَّحْدَاحِ، فَلَمَّا رَجَعَ أُتِيَ بِفَرَسٍ مُعْرَوْرًى فَرَكِبَ وَمَشَيْنَا مَعَهُ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 209,
        "matchingEnglishURN": 1072090,
        "last_updated": null
    },
    {
        "arabicURN": 1120360,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "96.00",
        "hadithNumber": "2027",
        "bookName": " كتاب الجنائز",
        "babName": " باب الزِّيَادَةِ عَلَى الْقَبْرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَاقَ، قَالَ حَدَّثَنَا حَفْصٌ، عَنِ ابْنِ جُرَيْجٍ، عَنْ سُلَيْمَانَ بْنِ مُوسَى، وَأَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ ‏:‏ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُبْنَى عَلَى الْقَبْرِ، أَوْ يُزَادَ عَلَيْهِ، أَوْ يُجَصَّصَ ‏.‏ زَادَ سُلَيْمَانُ بْنُ مُوسَى ‏:‏ أَوْ يُكْتَبَ عَلَيْهِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 210,
        "matchingEnglishURN": 1072100,
        "last_updated": null
    },
    {
        "arabicURN": 1120370,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "97.00",
        "hadithNumber": "2028",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْبِنَاءِ عَلَى الْقَبْرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حَجَّاجٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرًا، يَقُولُ ‏:‏ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ تَقْصِيصِ الْقُبُورِ، أَوْ يُبْنَى عَلَيْهَا، أَوْ يَجْلِسَ عَلَيْهَا أَحَدٌ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 211,
        "matchingEnglishURN": 1072110,
        "last_updated": null
    },
    {
        "arabicURN": 1120380,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "98.00",
        "hadithNumber": "2029",
        "bookName": " كتاب الجنائز",
        "babName": " باب تَجْصِيصِ الْقُبُورِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ ‏:‏ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ تَجْصِيصِ الْقُبُورِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 212,
        "matchingEnglishURN": 1072120,
        "last_updated": null
    },
    {
        "arabicURN": 1120390,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "99.00",
        "hadithNumber": "2030",
        "bookName": " كتاب الجنائز",
        "babName": " باب تَسْوِيَةِ الْقُبُورِ إِذَا رُفِعَتْ ‏‏ ",
        "hadithText": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، أَنَّ ثُمَامَةَ بْنَ شُفَىٍّ، حَدَّثَهُ قَالَ ‏:‏ كُنَّا مَعَ فَضَالَةَ بْنِ عُبَيْدٍ بِأَرْضِ الرُّومِ فَتُوُفِّيَ صَاحِبٌ لَنَا، فَأَمَرَ فَضَالَةُ بِقَبْرِهِ فَسُوِّيَ، ثُمَّ قَالَ ‏:‏ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْمُرُ بِتَسْوِيَتِهَا ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 213,
        "matchingEnglishURN": 1072130,
        "last_updated": null
    },
    {
        "arabicURN": 1120400,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "99.00",
        "hadithNumber": "2031",
        "bookName": " كتاب الجنائز",
        "babName": " باب تَسْوِيَةِ الْقُبُورِ إِذَا رُفِعَتْ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ حَبِيبٍ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي الْهَيَّاجِ، قَالَ قَالَ عَلِيٌّ رضى الله عنه ‏:‏ أَلاَ أَبْعَثُكَ عَلَى مَا بَعَثَنِي عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم لاَ تَدَعَنَّ قَبْرًا مُشْرِفًا إِلاَّ سَوَّيْتَهُ، وَلاَ صُورَةً فِي بَيْتٍ إِلاَّ طَمَسْتَهَا ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 214,
        "matchingEnglishURN": 1072140,
        "last_updated": null
    },
    {
        "arabicURN": 1120410,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "100.00",
        "hadithNumber": "2032",
        "bookName": " كتاب الجنائز",
        "babName": " باب زِيَارَةِ الْقُبُورِ  ",
        "hadithText": "أَخْبَرَنِي مُحَمَّدُ بْنُ آدَمَ، عَنِ ابْنِ فُضَيْلٍ، عَنْ أَبِي سِنَانٍ، عَنْ مُحَارِبِ بْنِ دِثَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏:‏ ‏\"‏ نَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ فَزُورُوهَا، وَنَهَيْتُكُمْ عَنْ لُحُومِ الأَضَاحِي فَوْقَ ثَلاَثَةِ أَيَّامٍ فَأَمْسِكُوا مَا بَدَا لَكُمْ، وَنَهَيْتُكُمْ عَنِ النَّبِيذِ إِلاَّ فِي سِقَاءٍ فَاشْرَبُوا فِي الأَسْقِيَةِ كُلِّهَا، وَلاَ تَشْرَبُوا مُسْكِرًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 215,
        "matchingEnglishURN": 1072150,
        "last_updated": null
    },
    {
        "arabicURN": 1120420,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "100.00",
        "hadithNumber": "2033",
        "bookName": " كتاب الجنائز",
        "babName": " باب زِيَارَةِ الْقُبُورِ  ",
        "hadithText": "أَخْبَرَنِي مُحَمَّدُ بْنُ قُدَامَةَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ أَبِي فَرْوَةَ، عَنِ الْمُغِيرَةِ بْنِ سُبَيْعٍ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، عَنْ أَبِيهِ، ‏:‏ أَنَّهُ كَانَ فِي مَجْلِسٍ فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏:‏ ‏\"‏ إِنِّي كُنْتُ نَهَيْتُكُمْ أَنْ تَأْكُلُوا لُحُومَ الأَضَاحِي إِلاَّ ثَلاَثًا، فَكُلُوا وَأَطْعِمُوا وَادَّخِرُوا مَا بَدَا لَكُمْ، وَذَكَرْتُ لَكُمْ أَنْ لاَ تَنْتَبِذُوا فِي الظُّرُوفِ الدُّبَّاءِ وَالْمُزَفَّتِ وَالنَّقِيرِ وَالْحَنْتَمِ، انْتَبِذُوا فِيمَا رَأَيْتُمْ وَاجْتَنِبُوا كُلَّ مُسْكِرٍ، وَنَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ فَمَنْ أَرَادَ أَنْ يَزُورَ فَلْيَزُرْ، وَلاَ تَقُولُوا هُجْرًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 216,
        "matchingEnglishURN": 1072160,
        "last_updated": null
    },
    {
        "arabicURN": 1120430,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "101.00",
        "hadithNumber": "2034",
        "bookName": " كتاب الجنائز",
        "babName": " باب زِيَارَةِ قَبْرِ الْمُشْرِكِ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، عَنْ يَزِيدَ بْنِ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ ‏:‏ زَارَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَبْرَ أُمِّهِ فَبَكَى وَأَبْكَى مَنْ حَوْلَهُ وَقَالَ ‏:‏ ‏\"‏ اسْتَأْذَنْتُ رَبِّي عَزَّ وَجَلَّ فِي أَنْ أَسْتَغْفِرَ لَهَا فَلَمْ يُؤْذَنْ لِي، وَاسْتَأْذَنْتُ فِي أَنْ أَزُورَ قَبْرَهَا فَأَذِنَ لِي، فَزُورُوا الْقُبُورَ فَإِنَّهَا تُذَكِّرُكُمُ الْمَوْتَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 217,
        "matchingEnglishURN": 1072170,
        "last_updated": null
    },
    {
        "arabicURN": 1120440,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "102.00",
        "hadithNumber": "2035",
        "bookName": " كتاب الجنائز",
        "babName": " باب النَّهْىِ عَنْ الاِسْتِغْفَارِ، لِلْمُشْرِكِينَ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا مُحَمَّدٌ، - وَهُوَ ابْنُ ثَوْرٍ - عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِيهِ، قَالَ ‏:‏ لَمَّا حَضَرَتْ أَبَا طَالِبٍ الْوَفَاةُ دَخَلَ عَلَيْهِ النَّبِيُّ صلى الله عليه وسلم وَعِنْدَهُ أَبُو جَهْلٍ وَعَبْدُ اللَّهِ بْنُ أَبِي أُمَيَّةَ فَقَالَ ‏:‏ ‏\"‏ أَىْ عَمِّ قُلْ لاَ إِلَهَ إِلاَّ اللَّهُ كَلِمَةً أُحَاجُّ لَكَ بِهَا عِنْدَ اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏ فَقَالَ لَهُ أَبُو جَهْلٍ وَعَبْدُ اللَّهِ بْنُ أَبِي أُمَيَّةَ ‏:‏ يَا أَبَا طَالِبٍ أَتَرْغَبُ عَنْ مِلَّةِ عَبْدِ الْمُطَّلِبِ ‏.‏ فَلَمْ يَزَالاَ يُكَلِّمَانِهِ حَتَّى كَانَ آخِرُ شَىْءٍ كَلَّمَهُمْ بِهِ عَلَى مِلَّةِ عَبْدِ الْمُطَّلِبِ ‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏:‏ ‏\"‏ لأَسْتَغْفِرَنَّ لَكَ مَا لَمْ أُنْهَ عَنْكَ ‏\"‏ ‏.‏ فَنَزَلَتْ ‏<A id=\"q1\" name=\"q1\" href=\"javascript:openquran(8,113,113)\"><c_q1>{‏ مَا كَانَ لِلنَّبِيِّ وَالَّذِينَ آمَنُوا أَنْ يَسْتَغْفِرُوا لِلْمُشْرِكِينَ ‏}</c_q1></a>‏ وَنَزَلَتْ ‏<A id=\"q2\" name=\"q2\" href=\"javascript:openquran(27,56,56)\"><c_q2>{‏ إِنَّكَ لاَ تَهْدِي مَنْ أَحْبَبْتَ ‏}</c_q2></a>‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 218,
        "matchingEnglishURN": 1072180,
        "last_updated": null
    },
    {
        "arabicURN": 1120450,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "102.00",
        "hadithNumber": "2036",
        "bookName": " كتاب الجنائز",
        "babName": " باب النَّهْىِ عَنْ الاِسْتِغْفَارِ، لِلْمُشْرِكِينَ  ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الْخَلِيلِ، عَنْ عَلِيٍّ، قَالَ ‏:‏ سَمِعْتُ رَجُلاً، يَسْتَغْفِرُ لأَبَوَيْهِ وَهُمَا مُشْرِكَانِ فَقُلْتُ ‏:‏ أَتَسْتَغْفِرُ لَهُمَا وَهُمَا مُشْرِكَانِ فَقَالَ أَوَلَمْ يَسْتَغْفِرْ إِبْرَاهِيمُ لأَبِيهِ ‏.‏ فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَذَكَرْتُ ذَلِكَ لَهُ فَنَزَلَتْ ‏<A id=\"q3\" name=\"q3\" href=\"javascript:openquran(8,114,114)\"><c_q3>{‏ وَمَا كَانَ اسْتِغْفَارُ إِبْرَاهِيمَ لأَبِيهِ إِلاَّ عَنْ مَوْعِدَةٍ وَعَدَهَا إِيَّاهُ ‏}</c_q3></a>‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 219,
        "matchingEnglishURN": 1072190,
        "last_updated": null
    },
    {
        "arabicURN": 1120460,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "103.00",
        "hadithNumber": "2037",
        "bookName": " كتاب الجنائز",
        "babName": " باب الأَمْرِ بِالاِسْتِغْفَارِ لِلْمُؤْمِنِينَ  ",
        "hadithText": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حَجَّاجٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ أَبِي مُلَيْكَةَ، أَنَّهُ سَمِعَ مُحَمَّدَ بْنَ قَيْسِ بْنِ مَخْرَمَةَ، يَقُولُ سَمِعْتُ عَائِشَةَ، تُحَدِّثُ قَالَتْ ‏:‏ أَلاَ أُحَدِّثُكُمْ عَنِّي وَعَنِ النَّبِيِّ صلى الله عليه وسلم قُلْنَا ‏:‏ بَلَى ‏.‏ قَالَتْ ‏:‏ لَمَّا كَانَتْ لَيْلَتِي الَّتِي هُوَ عِنْدِي تَعْنِي النَّبِيَّ صلى الله عليه وسلم انْقَلَبَ فَوَضَعَ نَعْلَيْهِ عِنْدَ رِجْلَيْهِ، وَبَسَطَ طَرَفَ إِزَارِهِ عَلَى فِرَاشِهِ، فَلَمْ يَلْبَثْ إِلاَّ رَيْثَمَا ظَنَّ أَنِّي قَدْ رَقَدْتُ، ثُمَّ انْتَعَلَ رُوَيْدًا وَأَخَذَ رِدَاءَهُ رُوَيْدًا، ثُمَّ فَتَحَ الْبَابَ رُوَيْدًا وَخَرَجَ رُوَيْدًا وَجَعَلْتُ دِرْعِي فِي رَأْسِي وَاخْتَمَرْتُ وَتَقَنَّعْتُ إِزَارِي، وَانْطَلَقْتُ فِي إِثْرِهِ حَتَّى جَاءَ الْبَقِيعَ، فَرَفَعَ يَدَيْهِ ثَلاَثَ مَرَّاتٍ فَأَطَالَ، ثُمَّ انْحَرَفَ فَانْحَرَفْتُ، فَأَسْرَعَ فَأَسْرَعْتُ، فَهَرْوَلَ فَهَرْوَلْتُ، فَأَحْضَرَ فَأَحْضَرْتُ وَسَبَقْتُهُ فَدَخَلْتُ، فَلَيْسَ إِلاَّ أَنِ اضْطَجَعْتُ فَدَخَلَ فَقَالَ ‏:‏ ‏\"‏ مَا لَكِ يَا عَائِشَةُ حَشْيَا رَابِيَةً ‏\"‏ ‏.‏ قَالَتْ ‏:‏ لاَ ‏.‏ قَالَ ‏:‏ ‏\"‏ لَتُخْبِرِنِّي أَوْ لَيُخْبِرَنِّي اللَّطِيفُ الْخَبِيرُ ‏\"‏ ‏.‏ قُلْتُ ‏:‏ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي، فَأَخْبَرْتُهُ الْخَبَرَ ‏.‏ قَالَ ‏:‏ ‏\"‏ فَأَنْتِ السَّوَادُ الَّذِي رَأَيْتُ أَمَامِي ‏\"‏ ‏.‏ قَالَتْ ‏:‏ نَعَمْ، فَلَهَزَنِي فِي صَدْرِي لَهْزَةً أَوْجَعَتْنِي، ثُمَّ قَالَ ‏:‏ ‏\"‏ أَظَنَنْتِ أَنْ يَحِيفَ اللَّهُ عَلَيْكِ وَرَسُولُهُ ‏\"‏ ‏.‏ قُلْتُ ‏:‏ مَهْمَا يَكْتُمُ النَّاسُ فَقَدْ عَلِمَهُ اللَّهُ ‏.‏ قَالَ ‏:‏ ‏\"‏ فَإِنَّ جِبْرِيلَ أَتَانِي حِينَ رَأَيْتِ وَلَمْ يَدْخُلْ عَلَىَّ وَقَدْ وَضَعْتِ ثِيَابَكِ فَنَادَانِي، فَأَخْفَى مِنْكِ فَأَجَبْتُهُ فَأَخْفَيْتُهُ مِنْكِ، فَظَنَنْتُ أَنْ قَدْ رَقَدْتِ وَكَرِهْتُ أَنْ أُوقِظَكِ، وَخَشِيتُ أَنْ تَسْتَوْحِشِي، فَأَمَرَنِي أَنْ آتِيَ الْبَقِيعَ فَأَسْتَغْفِرَ لَهُمْ ‏\"‏ ‏.‏ قُلْتُ ‏:‏ كَيْفَ أَقُولُ يَا رَسُولَ اللَّهِ قَالَ ‏:‏ ‏\"‏ قُولِي السَّلاَمُ عَلَى أَهْلِ الدِّيَارِ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ، يَرْحَمُ اللَّهُ الْمُسْتَقْدِمِينَ مِنَّا وَالْمُسْتَأْخِرِينَ، وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لاَحِقُونَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 220,
        "matchingEnglishURN": 1072200,
        "last_updated": null
    },
    {
        "arabicURN": 1120470,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "103.00",
        "hadithNumber": "2038",
        "bookName": " كتاب الجنائز",
        "babName": " باب الأَمْرِ بِالاِسْتِغْفَارِ لِلْمُؤْمِنِينَ  ",
        "hadithText": "أَخْبَرَنِي مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَلْقَمَةَ بْنِ أَبِي عَلْقَمَةَ، عَنْ أُمِّهِ، أَنَّهَا سَمِعَتْ عَائِشَةَ، تَقُولُ ‏:‏ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ فَلَبِسَ ثِيَابَهُ ثُمَّ خَرَجَ - قَالَتْ - فَأَمَرْتُ جَارِيَتِي بَرِيرَةَ تَتْبَعُهُ فَتَبِعَتْهُ حَتَّى جَاءَ الْبَقِيعَ، فَوَقَفَ فِي أَدْنَاهُ مَا شَاءَ اللَّهُ أَنْ يَقِفَ، ثُمَّ انْصَرَفَ فَسَبَقَتْهُ بَرِيرَةُ فَأَخْبَرَتْنِي، فَلَمْ أَذْكُرْ لَهُ شَيْئًا حَتَّى أَصْبَحْتُ، ثُمَّ ذَكَرْتُ ذَلِكَ لَهُ فَقَالَ ‏:‏ ‏\"‏ إِنِّي بُعِثْتُ إِلَى أَهْلِ الْبَقِيعِ لأُصَلِّيَ عَلَيْهِمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 221,
        "matchingEnglishURN": 1072210,
        "last_updated": null
    },
    {
        "arabicURN": 1120480,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "103.00",
        "hadithNumber": "2039",
        "bookName": " كتاب الجنائز",
        "babName": " باب الأَمْرِ بِالاِسْتِغْفَارِ لِلْمُؤْمِنِينَ  ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنَا شَرِيكٌ، - وَهُوَ ابْنُ أَبِي نَمِرٍ - عَنْ عَطَاءٍ، عَنْ عَائِشَةَ، قَالَتْ ‏:‏ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم كُلَّمَا كَانَتْ لَيْلَتُهَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم يَخْرُجُ فِي آخِرِ اللَّيْلِ إِلَى الْبَقِيعِ فَيَقُولُ ‏:‏ ‏\"‏ السَّلاَمُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِينَ، وَإِنَّا وَإِيَّاكُمْ مُتَوَاعِدُونَ غَدًا أَوْ مُوَاكِلُونَ، وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لاَحِقُونَ، اللَّهُمَّ اغْفِرْ لأَهْلِ بَقِيعِ الْغَرْقَدِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 222,
        "matchingEnglishURN": 1072220,
        "last_updated": null
    },
    {
        "arabicURN": 1120490,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "103.00",
        "hadithNumber": "2040",
        "bookName": " كتاب الجنائز",
        "babName": " باب الأَمْرِ بِالاِسْتِغْفَارِ لِلْمُؤْمِنِينَ  ",
        "hadithText": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، ‏:‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا أَتَى عَلَى الْمَقَابِرِ فَقَالَ ‏:‏ ‏\"‏ السَّلاَمُ عَلَيْكُمْ أَهْلَ الدِّيَارِ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ، وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لاَحِقُونَ، أَنْتُمْ لَنَا فَرَطٌ وَنَحْنُ لَكُمْ تَبَعٌ، أَسْأَلُ اللَّهَ الْعَافِيَةَ لَنَا وَلَكُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 223,
        "matchingEnglishURN": 1072230,
        "last_updated": null
    },
    {
        "arabicURN": 1120500,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "103.00",
        "hadithNumber": "2041",
        "bookName": " كتاب الجنائز",
        "babName": " باب الأَمْرِ بِالاِسْتِغْفَارِ لِلْمُؤْمِنِينَ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ ‏:‏ لَمَّا مَاتَ النَّجَاشِيُّ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏:‏ ‏\"‏ اسْتَغْفِرُوا لَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 224,
        "matchingEnglishURN": 1072240,
        "last_updated": null
    },
    {
        "arabicURN": 1120510,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "103.00",
        "hadithNumber": "2042",
        "bookName": " كتاب الجنائز",
        "babName": " باب الأَمْرِ بِالاِسْتِغْفَارِ لِلْمُؤْمِنِينَ  ",
        "hadithText": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا يَعْقُوبُ، قَالَ حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، وَابْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُمَا ‏:‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَعَى لَهُمُ النَّجَاشِيَّ صَاحِبَ الْحَبَشَةِ فِي الْيَوْمِ الَّذِي مَاتَ فِيهِ فَقَالَ ‏:‏ ‏\"‏ اسْتَغْفِرُوا لأَخِيكُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 225,
        "matchingEnglishURN": 1072250,
        "last_updated": null
    },
    {
        "arabicURN": 1120520,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "104.00",
        "hadithNumber": "2043",
        "bookName": " كتاب الجنائز",
        "babName": " باب التَّغْلِيظِ فِي اتِّخَاذِ السُّرُجِ عَلَى الْقُبُورِ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ جُحَادَةَ، عَنْ أَبِي صَالِحٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ ‏:‏ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم زَائِرَاتِ الْقُبُورِ وَالْمُتَّخِذِينَ عَلَيْهَا الْمَسَاجِدَ وَالسُّرُجَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 226,
        "matchingEnglishURN": 1072260,
        "last_updated": null
    },
    {
        "arabicURN": 1120530,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "105.00",
        "hadithNumber": "2044",
        "bookName": " كتاب الجنائز",
        "babName": " باب التَّشْدِيدِ فِي الْجُلُوسِ عَلَى الْقُبُورِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، عَنْ وَكِيعٍ، عَنْ سُفْيَانَ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لأَنْ يَجْلِسَ أَحَدُكُمْ عَلَى جَمْرَةٍ حَتَّى تَحْرِقَ ثِيَابَهُ خَيْرٌ لَهُ مِنْ أَنْ يَجْلِسَ عَلَى قَبْرٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 227,
        "matchingEnglishURN": 1072270,
        "last_updated": null
    },
    {
        "arabicURN": 1120540,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "105.00",
        "hadithNumber": "2045",
        "bookName": " كتاب الجنائز",
        "babName": " باب التَّشْدِيدِ فِي الْجُلُوسِ عَلَى الْقُبُورِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، عَنْ شُعَيْبٍ، قَالَ حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنَا خَالِدٌ، عَنِ ابْنِ أَبِي هِلاَلٍ، عَنْ أَبِي بَكْرِ بْنِ حَزْمٍ، عَنِ النَّضْرِ بْنِ عَبْدِ اللَّهِ السَّلَمِيِّ، عَنْ عَمْرِو بْنِ حَزْمٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَقْعُدُوا عَلَى الْقُبُورِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 228,
        "matchingEnglishURN": 1072280,
        "last_updated": null
    },
    {
        "arabicURN": 1120550,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "106.00",
        "hadithNumber": "2046",
        "bookName": " كتاب الجنائز",
        "babName": " باب اتِّخَاذِ الْقُبُورِ مَسَاجِدَ  ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ لَعَنَ اللَّهُ قَوْمًا اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 229,
        "matchingEnglishURN": 1072290,
        "last_updated": null
    },
    {
        "arabicURN": 1120560,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "106.00",
        "hadithNumber": "2047",
        "bookName": " كتاب الجنائز",
        "babName": " باب اتِّخَاذِ الْقُبُورِ مَسَاجِدَ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ أَبُو يَحْيَى، صَاعِقَةُ قَالَ حَدَّثَنَا أَبُو سَلَمَةَ الْخُزَاعِيُّ، قَالَ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ يَزِيدَ بْنِ الْهَادِ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لَعَنَ اللَّهُ الْيَهُودَ وَالنَّصَارَى اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 230,
        "matchingEnglishURN": 1072300,
        "last_updated": null
    },
    {
        "arabicURN": 1120570,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "107.00",
        "hadithNumber": "2048",
        "bookName": " كتاب الجنائز",
        "babName": " باب كَرَاهِيَةِ الْمَشْىِ بَيْنَ الْقُبُورِ فِي النِّعَالِ السِّبْتِيَّةِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا وَكِيعٌ، عَنِ الأَسْوَدِ بْنِ شَيْبَانَ، - وَكَانَ ثِقَةً - عَنْ خَالِدِ بْنِ سُمَيْرٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، أَنَّ بَشِيرَ ابْنَ الْخَصَاصِيَّةِ، قَالَ كُنْتُ أَمْشِي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَمَرَّ عَلَى قُبُورِ الْمُسْلِمِينَ فَقَالَ ‏\"‏ لَقَدْ سَبَقَ هَؤُلاَءِ شَرًّا كَثِيرًا ‏\"‏ ‏.‏ ثُمَّ مَرَّ عَلَى قُبُورِ الْمُشْرِكِينَ فَقَالَ ‏\"‏ لَقَدْ سَبَقَ هَؤُلاَءِ خَيْرًا كَثِيرًا ‏\"‏ ‏.‏ فَحَانَتْ مِنْهُ الْتِفَاتَةٌ فَرَأَى رَجُلاً يَمْشِي بَيْنَ الْقُبُورِ فِي نَعْلَيْهِ فَقَالَ ‏\"‏ يَا صَاحِبَ السِّبْتِيَّتَيْنِ أَلْقِهِمَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 231,
        "matchingEnglishURN": 1072310,
        "last_updated": null
    },
    {
        "arabicURN": 1120580,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "108.00",
        "hadithNumber": "2049",
        "bookName": " كتاب الجنائز",
        "babName": " باب التَّسْهِيلِ فِي غَيْرِ السِّبْتِيَّةِ  ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ أَبِي عُبَيْدِ اللَّهِ الْوَرَّاقُ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ الْعَبْدَ إِذَا وُضِعَ فِي قَبْرِهِ وَتَوَلَّى عَنْهُ أَصْحَابُهُ إِنَّهُ لَيَسْمَعُ قَرْعَ نِعَالِهِمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 232,
        "matchingEnglishURN": 1072320,
        "last_updated": null
    },
    {
        "arabicURN": 1120590,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "109.00",
        "hadithNumber": "2050",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْمَسْأَلَةِ فِي الْقَبْرِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، وَإِبْرَاهِيمُ بْنُ يَعْقُوبَ بْنِ إِسْحَاقَ، قَالاَ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، عَنْ شَيْبَانَ، عَنْ قَتَادَةَ، أَنْبَأَنَا أَنَسُ بْنُ مَالِكٍ، قَالَ قَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ الْعَبْدَ إِذَا وُضِعَ فِي قَبْرِهِ وَتَوَلَّى عَنْهُ أَصْحَابُهُ إِنَّهُ لَيَسْمَعُ قَرْعَ نِعَالِهِمْ ‏\"‏ ‏.‏ قَالَ ‏\"‏ فَيَأْتِيهِ مَلَكَانِ فَيُقْعِدَانِهِ فَيَقُولاَنِ لَهُ مَا كُنْتَ تَقُولُ فِي هَذَا الرَّجُلِ فَأَمَّا الْمُؤْمِنُ فَيَقُولُ أَشْهَدُ أَنَّهُ عَبْدُ اللَّهِ وَرَسُولُهُ فَيُقَالُ لَهُ انْظُرْ إِلَى مَقْعَدِكَ مِنَ النَّارِ قَدْ أَبْدَلَكَ اللَّهُ بِهِ مَقْعَدًا مِنَ الْجَنَّةِ ‏\"‏ ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَيَرَاهُمَا جَمِيعًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 233,
        "matchingEnglishURN": 1072330,
        "last_updated": null
    },
    {
        "arabicURN": 1120600,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "110.00",
        "hadithNumber": "2051",
        "bookName": " كتاب الجنائز",
        "babName": " باب مَسْأَلَةِ الْكَافِرِ  ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ أَبِي عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ الْعَبْدَ إِذَا وُضِعَ فِي قَبْرِهِ وَتَوَلَّى عَنْهُ أَصْحَابُهُ إِنَّهُ لَيَسْمَعُ قَرْعَ نِعَالِهِمْ أَتَاهُ مَلَكَانِ فَيُقْعِدَانِهِ فَيَقُولاَنِ لَهُ مَا كُنْتَ تَقُولُ فِي هَذَا الرَّجُلِ مُحَمَّدٍ فَأَمَّا الْمُؤْمِنُ فَيَقُولُ أَشْهَدُ أَنَّهُ عَبْدُ اللَّهِ وَرَسُولُهُ فَيُقَالُ لَهُ انْظُرْ إِلَى مَقْعَدِكَ مِنَ النَّارِ قَدْ أَبْدَلَكَ اللَّهُ بِهِ مَقْعَدًا خَيْرًا مِنْهُ ‏\"‏ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَيَرَاهُمَا جَمِيعًا وَأَمَّا الْكَافِرُ أَوِ الْمُنَافِقُ فَيُقَالُ لَهُ مَا كُنْتَ تَقُولُ فِي هَذَا الرَّجُلِ فَيَقُولُ لاَ أَدْرِي كُنْتُ أَقُولُ كَمَا يَقُولُ النَّاسُ ‏.‏ فَيُقَالُ لَهُ لاَ دَرَيْتَ وَلاَ تَلَيْتَ ‏.‏ ثُمَّ يُضْرَبُ ضَرْبَةً بَيْنَ أُذُنَيْهِ فَيَصِيحُ صَيْحَةً يَسْمَعُهَا مَنْ يَلِيهِ غَيْرُ الثَّقَلَيْنِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 234,
        "matchingEnglishURN": 1072340,
        "last_updated": null
    },
    {
        "arabicURN": 1120610,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "111.00",
        "hadithNumber": "2052",
        "bookName": " كتاب الجنائز",
        "babName": " باب مَنْ قَتَلَهُ بَطْنُهُ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ شُعْبَةَ، قَالَ أَخْبَرَنِي جَامِعُ بْنُ شَدَّادٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ يَسَارٍ، قَالَ كُنْتُ جَالِسًا وَسُلَيْمَانُ بْنُ صُرَدٍ وَخَالِدُ بْنُ عُرْفُطَةَ فَذَكَرُوا أَنَّ رَجُلاً، تُوُفِّيَ مَاتَ بِبَطْنِهِ فَإِذَا هُمَا يَشْتَهِيَانِ أَنْ يَكُونَا شُهَدَاءَ جَنَازَتِهِ فَقَالَ أَحَدُهُمَا لِلآخَرِ أَلَمْ يَقُلْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ يَقْتُلْهُ بَطْنُهُ فَلَنْ يُعَذَّبَ فِي قَبْرِهِ ‏\"‏ ‏.‏ فَقَالَ الآخَرُ بَلَى ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 235,
        "matchingEnglishURN": 1072350,
        "last_updated": null
    },
    {
        "arabicURN": 1120620,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "112.00",
        "hadithNumber": "2053",
        "bookName": " كتاب الجنائز",
        "babName": " باب الشَّهِيدِ  ",
        "hadithText": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ، قَالَ حَدَّثَنَا حَجَّاجٌ، عَنْ لَيْثِ بْنِ سَعْدٍ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، أَنَّ صَفْوَانَ بْنَ عَمْرٍو، حَدَّثَهُ عَنْ رَاشِدِ بْنِ سَعْدٍ، عَنْ رَجُلٍ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَجُلاً قَالَ يَا رَسُولَ اللَّهِ مَا بَالُ الْمُؤْمِنِينَ يُفْتَنُونَ فِي قُبُورِهِمْ إِلاَّ الشَّهِيدَ قَالَ ‏\"‏ كَفَى بِبَارِقَةِ السُّيُوفِ عَلَى رَأْسِهِ فِتْنَةً ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 236,
        "matchingEnglishURN": 1072360,
        "last_updated": null
    },
    {
        "arabicURN": 1120630,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "112.00",
        "hadithNumber": "2054",
        "bookName": " كتاب الجنائز",
        "babName": " باب الشَّهِيدِ  ",
        "hadithText": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنِ التَّيْمِيِّ، عَنْ أَبِي عُثْمَانَ، عَنْ عَامِرِ بْنِ مَالِكٍ، عَنْ صَفْوَانَ بْنِ أُمَيَّةَ، قَالَ الطَّاعُونُ وَالْمَبْطُونُ وَالْغَرِيقُ وَالنُّفَسَاءُ شَهَادَةٌ ‏.‏ قَالَ وَحَدَّثَنَا أَبُو عُثْمَانَ مِرَارًا وَرَفَعَهُ مَرَّةً إِلَى النَّبِيِّ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 237,
        "matchingEnglishURN": 1072370,
        "last_updated": null
    },
    {
        "arabicURN": 1120640,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "113.00",
        "hadithNumber": "2055",
        "bookName": " كتاب الجنائز",
        "babName": " باب ضَمَّةِ الْقَبْرِ وَضَغْطَتِهِ  ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ الْعَنْقَزِيُّ، قَالَ حَدَّثَنَا ابْنُ إِدْرِيسَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ هَذَا الَّذِي تَحَرَّكَ لَهُ الْعَرْشُ وَفُتِحَتْ لَهُ أَبْوَابُ السَّمَاءِ وَشَهِدَهُ سَبْعُونَ أَلْفًا مِنَ الْمَلاَئِكَةِ لَقَدْ ضُمَّ ضَمَّةً ثُمَّ فُرِّجَ عَنْهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 238,
        "matchingEnglishURN": 1072380,
        "last_updated": null
    },
    {
        "arabicURN": 1120650,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "114.00",
        "hadithNumber": "2056",
        "bookName": " كتاب الجنائز",
        "babName": " باب عَذَابِ الْقَبْرِ  ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ أَبِيهِ، عَنْ خَيْثَمَةَ، عَنِ الْبَرَاءِ، قَالَ ‏<A id=\"q4\" name=\"q4\" href=\"javascript:openquran(13,27,27)\"><c_q4>{‏ يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا بِالْقَوْلِ الثَّابِتِ فِي الْحَيَاةِ الدُّنْيَا وَفِي الآخِرَةِ ‏}</c_q4></a>‏ قَالَ نَزَلَتْ فِي عَذَابِ الْقَبْرِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 239,
        "matchingEnglishURN": 1072390,
        "last_updated": null
    },
    {
        "arabicURN": 1120660,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "114.00",
        "hadithNumber": "2057",
        "bookName": " كتاب الجنائز",
        "babName": " باب عَذَابِ الْقَبْرِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏<A id=\"q5\" name=\"q5\" href=\"javascript:openquran(13,27,27)\"><c_q5>{‏ يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا بِالْقَوْلِ الثَّابِتِ فِي الْحَيَاةِ الدُّنْيَا وَفِي الآخِرَةِ ‏}</c_q5></a>‏ قَالَ نَزَلَتْ فِي عَذَابِ الْقَبْرِ يُقَالُ لَهُ مَنْ رَبُّكَ فَيَقُولُ رَبِّيَ اللَّهُ وَدِينِي دِينُ مُحَمَّدٍ صلى الله عليه وسلم فَذَلِكَ قَوْلُهُ ‏<A id=\"q6\" name=\"q6\" href=\"javascript:openquran(13,27,27)\"><c_q6>{‏ يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا بِالْقَوْلِ الثَّابِتِ فِي الْحَيَاةِ الدُّنْيَا وَفِي الآخِرَةِ ‏}</c_q6></a>‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 240,
        "matchingEnglishURN": 1072400,
        "last_updated": null
    },
    {
        "arabicURN": 1120670,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "114.00",
        "hadithNumber": "2058",
        "bookName": " كتاب الجنائز",
        "babName": " باب عَذَابِ الْقَبْرِ  ",
        "hadithText": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم سَمِعَ صَوْتًا مِنْ قَبْرٍ فَقَالَ ‏\"‏ مَتَى مَاتَ هَذَا ‏\"‏ ‏.‏ قَالُوا مَاتَ فِي الْجَاهِلِيَّةِ ‏.‏ فَسُرَّ بِذَلِكَ وَقَالَ ‏\"‏ لَوْلاَ أَنْ لاَ تَدَافَنُوا لَدَعَوْتُ اللَّهَ أَنْ يُسْمِعَكُمْ عَذَابَ الْقَبْرِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 241,
        "matchingEnglishURN": 1072410,
        "last_updated": null
    },
    {
        "arabicURN": 1120680,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "114.00",
        "hadithNumber": "2059",
        "bookName": " كتاب الجنائز",
        "babName": " باب عَذَابِ الْقَبْرِ  ",
        "hadithText": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، قَالَ أَخْبَرَنِي عَوْنُ بْنُ أَبِي جُحَيْفَةَ، عَنْ أَبِيهِ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، عَنْ أَبِي أَيُّوبَ، قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَعْدَ مَا غَرَبَتِ الشَّمْسُ فَسَمِعَ صَوْتًا فَقَالَ ‏\"‏ يَهُودُ تُعَذَّبُ فِي قُبُورِهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 242,
        "matchingEnglishURN": 1072420,
        "last_updated": null
    },
    {
        "arabicURN": 1120690,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "115.00",
        "hadithNumber": "2060",
        "bookName": " كتاب الجنائز",
        "babName": " باب التَّعَوُّذِ مِنْ عَذَابِ الْقَبْرِ  ",
        "hadithText": "أَخْبَرَنَا يَحْيَى بْنُ دُرُسْتَ، قَالَ حَدَّثَنَا أَبُو إِسْمَاعِيلَ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، أَنَّ أَبَا سَلَمَةَ، حَدَّثَهُ عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ كَانَ يَقُولُ ‏\"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَأَعُوذُ بِكَ مِنْ عَذَابِ النَّارِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 243,
        "matchingEnglishURN": 1072430,
        "last_updated": null
    },
    {
        "arabicURN": 1120700,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "115.00",
        "hadithNumber": "2061",
        "bookName": " كتاب الجنائز",
        "babName": " باب التَّعَوُّذِ مِنْ عَذَابِ الْقَبْرِ  ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادِ بْنِ الأَسْوَدِ بْنِ عَمْرٍو، عَنِ ابْنِ وَهْبٍ، قَالَ حَدَّثَنَا يُونُسُ بْنُ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعْدَ ذَلِكَ يَسْتَعِيذُ مِنْ عَذَابِ الْقَبْرِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 244,
        "matchingEnglishURN": 1072440,
        "last_updated": null
    },
    {
        "arabicURN": 1120710,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "115.00",
        "hadithNumber": "2062",
        "bookName": " كتاب الجنائز",
        "babName": " باب التَّعَوُّذِ مِنْ عَذَابِ الْقَبْرِ  ",
        "hadithText": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ، عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّهُ سَمِعَ أَسْمَاءَ بِنْتَ أَبِي بَكْرٍ، تَقُولُ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَذَكَرَ الْفِتْنَةَ الَّتِي يُفْتَنُ بِهَا الْمَرْءُ فِي قَبْرِهِ فَلَمَّا ذَكَرَ ذَلِكَ ضَجَّ الْمُسْلِمُونَ ضَجَّةً حَالَتْ بَيْنِي وَبَيْنَ أَنْ أَفْهَمَ كَلاَمَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا سَكَنَتْ ضَجَّتُهُمْ قُلْتُ لِرَجُلٍ قَرِيبٍ مِنِّي أَىْ بَارَكَ اللَّهُ لَكَ مَاذَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي آخِرِ قَوْلِهِ قَالَ ‏\"‏ قَدْ أُوحِيَ إِلَىَّ أَنَّكُمْ تُفْتَنُونَ فِي الْقُبُورِ قَرِيبًا مِنْ فِتْنَةِ الدَّجَّالِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 245,
        "matchingEnglishURN": 1072450,
        "last_updated": null
    },
    {
        "arabicURN": 1120720,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "115.00",
        "hadithNumber": "2063",
        "bookName": " كتاب الجنائز",
        "babName": " باب التَّعَوُّذِ مِنْ عَذَابِ الْقَبْرِ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ طَاوُسٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُعَلِّمُهُمْ هَذَا الدُّعَاءَ كَمَا يُعَلِّمُهُمُ السُّورَةَ مِنَ الْقُرْآنِ ‏\"‏ قُولُوا اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 246,
        "matchingEnglishURN": 1072460,
        "last_updated": null
    },
    {
        "arabicURN": 1120730,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "115.00",
        "hadithNumber": "2064",
        "bookName": " كتاب الجنائز",
        "babName": " باب التَّعَوُّذِ مِنْ عَذَابِ الْقَبْرِ  ",
        "hadithText": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ، عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي عُرْوَةُ، أَنَّ عَائِشَةَ، قَالَتْ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَعِنْدِي امْرَأَةٌ مِنَ الْيَهُودِ وَهِيَ تَقُولُ إِنَّكُمْ تُفْتَنُونَ فِي الْقُبُورِ ‏.‏ فَارْتَاعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\"‏ إِنَّمَا تُفْتَنُ يَهُودُ ‏\"‏ ‏.‏ وَقَالَتْ عَائِشَةُ فَلَبِثْنَا لَيَالِيَ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّهُ أُوحِيَ إِلَىَّ أَنَّكُمْ تُفْتَنُونَ فِي الْقُبُورِ ‏\"‏ ‏.‏ قَالَتْ عَائِشَةُ فَسَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعْدُ يَسْتَعِيذُ مِنْ عَذَابِ الْقَبْرِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 247,
        "matchingEnglishURN": 1072470,
        "last_updated": null
    },
    {
        "arabicURN": 1120740,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "115.00",
        "hadithNumber": "2065",
        "bookName": " كتاب الجنائز",
        "babName": " باب التَّعَوُّذِ مِنْ عَذَابِ الْقَبْرِ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ يَحْيَى، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَسْتَعِيذُ مِنْ عَذَابِ الْقَبْرِ وَمِنْ فِتْنَةِ الدَّجَّالِ وَقَالَ ‏\"‏ إِنَّكُمْ تُفْتَنُونَ فِي قُبُورِكُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 248,
        "matchingEnglishURN": 1072480,
        "last_updated": null
    },
    {
        "arabicURN": 1120750,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "115.00",
        "hadithNumber": "2066",
        "bookName": " كتاب الجنائز",
        "babName": " باب التَّعَوُّذِ مِنْ عَذَابِ الْقَبْرِ  ",
        "hadithText": "أَخْبَرَنَا هَنَّادٌ، عَنْ أَبِي مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، دَخَلَتْ يَهُودِيَّةٌ عَلَيْهَا فَاسْتَوْهَبَتْهَا شَيْئًا فَوَهَبَتْ لَهَا عَائِشَةُ فَقَالَتْ أَجَارَكِ اللَّهُ مِنْ عَذَابِ الْقَبْرِ ‏.‏ قَالَتْ عَائِشَةُ فَوَقَعَ فِي نَفْسِي مِنْ ذَلِكَ حَتَّى جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ ‏\"‏ إِنَّهُمْ لَيُعَذَّبُونَ فِي قُبُورِهِمْ عَذَابًا تَسْمَعُهُ الْبَهَائِمُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 249,
        "matchingEnglishURN": 1072490,
        "last_updated": null
    },
    {
        "arabicURN": 1120760,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "115.00",
        "hadithNumber": "2067",
        "bookName": " كتاب الجنائز",
        "babName": " باب التَّعَوُّذِ مِنْ عَذَابِ الْقَبْرِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ دَخَلَتْ عَلَىَّ عَجُوزَتَانِ مِنْ عُجُزِ يَهُودِ الْمَدِينَةِ فَقَالَتَا إِنَّ أَهْلَ الْقُبُورِ يُعَذَّبُونَ فِي قُبُورِهِمْ ‏.‏ فَكَذَّبْتُهُمَا وَلَمْ أَنْعَمْ أَنْ أُصَدِّقَهُمَا فَخَرَجَتَا وَدَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ عَجُوزَتَيْنِ مِنْ عُجُزِ يَهُودِ الْمَدِينَةِ قَالَتَا إِنَّ أَهْلَ الْقُبُورِ يُعَذَّبُونَ فِي قُبُورِهِمْ ‏.‏ قَالَ ‏\"‏ صَدَقَتَا إِنَّهُمْ يُعَذَّبُونَ عَذَابًا تَسْمَعُهُ الْبَهَائِمُ كُلُّهَا ‏\"‏ ‏.‏ فَمَا رَأَيْتُهُ صَلَّى صَلاَةً إِلاَّ تَعَوَّذَ مِنْ عَذَابِ الْقَبْرِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 250,
        "matchingEnglishURN": 1072500,
        "last_updated": null
    },
    {
        "arabicURN": 1120770,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "116.00",
        "hadithNumber": "2068",
        "bookName": " كتاب الجنائز",
        "babName": " باب وَضْعِ الْجَرِيدَةِ عَلَى الْقَبْرِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِحَائِطٍ مِنْ حِيطَانِ مَكَّةَ أَوِ الْمَدِينَةِ سَمِعَ صَوْتَ إِنْسَانَيْنِ يُعَذَّبَانِ فِي قُبُورِهِمَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يُعَذَّبَانِ وَمَا يُعَذَّبَانِ فِي كَبِيرٍ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ بَلَى كَانَ أَحَدُهُمَا لاَ يَسْتَبْرِئُ مِنْ بَوْلِهِ وَكَانَ الآخَرُ يَمْشِي بِالنَّمِيمَةِ ‏\"‏ ‏.‏ ثُمَّ دَعَا بِجَرِيدَةٍ فَكَسَرَهَا كِسْرَتَيْنِ فَوَضَعَ عَلَى كُلِّ قَبْرٍ مِنْهُمَا كِسْرَةً فَقِيلَ لَهُ يَا رَسُولَ اللَّهِ لِمَ فَعَلْتَ هَذَا قَالَ ‏\"‏ لَعَلَّهُ أَنْ يُخَفَّفَ عَنْهُمَا مَا لَمْ يَيْبَسَا أَوْ أَنْ يَيْبَسَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 251,
        "matchingEnglishURN": 1072510,
        "last_updated": null
    },
    {
        "arabicURN": 1120780,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "116.00",
        "hadithNumber": "2069",
        "bookName": " كتاب الجنائز",
        "babName": " باب وَضْعِ الْجَرِيدَةِ عَلَى الْقَبْرِ  ",
        "hadithText": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، فِي حَدِيثِهِ عَنْ أَبِي مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ مُجَاهِدٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِقَبْرَيْنِ فَقَالَ ‏\"‏ إِنَّهُمَا لَيُعَذَّبَانِ وَمَا يُعَذَّبَانِ فِي كَبِيرٍ أَمَّا أَحَدُهُمَا فَكَانَ لاَ يَسْتَبْرِئُ مِنْ بَوْلِهِ وَأَمَّا الآخَرُ فَكَانَ يَمْشِي بِالنَّمِيمَةِ ‏\"‏ ‏.‏ ثُمَّ أَخَذَ جَرِيدَةً رَطْبَةً فَشَقَّهَا نِصْفَيْنِ ثُمَّ غَرَزَ فِي كُلِّ قَبْرٍ وَاحِدَةً فَقَالُوا يَا رَسُولَ اللَّهِ لِمَ صَنَعْتَ هَذَا فَقَالَ ‏\"‏ لَعَلَّهُمَا أَنْ يُخَفَّفَ عَنْهُمَا مَا لَمْ يَيْبَسَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 252,
        "matchingEnglishURN": 1072520,
        "last_updated": null
    },
    {
        "arabicURN": 1120790,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "116.00",
        "hadithNumber": "2070",
        "bookName": " كتاب الجنائز",
        "babName": " باب وَضْعِ الْجَرِيدَةِ عَلَى الْقَبْرِ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ أَلاَ إِنَّ أَحَدَكُمْ إِذَا مَاتَ عُرِضَ عَلَيْهِ مَقْعَدُهُ بِالْغَدَاةِ وَالْعَشِيِّ إِنْ كَانَ مِنْ أَهْلِ الْجَنَّةِ فَمِنْ أَهْلِ الْجَنَّةِ وَإِنْ كَانَ مِنْ أَهْلِ النَّارِ فَمِنْ أَهْلِ النَّارِ حَتَّى يَبْعَثَهُ اللَّهُ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 253,
        "matchingEnglishURN": 1072530,
        "last_updated": null
    },
    {
        "arabicURN": 1120800,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "116.00",
        "hadithNumber": "2071",
        "bookName": " كتاب الجنائز",
        "babName": " باب وَضْعِ الْجَرِيدَةِ عَلَى الْقَبْرِ  ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ عُبَيْدَ اللَّهِ، يُحَدِّثُ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ يُعْرَضُ عَلَى أَحَدِكُمْ إِذَا مَاتَ مَقْعَدُهُ مِنَ الْغَدَاةِ وَالْعَشِيِّ فَإِنْ كَانَ مِنْ أَهْلِ النَّارِ فَمِنْ أَهْلِ النَّارِ قِيلَ هَذَا مَقْعَدُكَ حَتَّى يَبْعَثَكَ اللَّهُ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 254,
        "matchingEnglishURN": 1072540,
        "last_updated": null
    },
    {
        "arabicURN": 1120810,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "116.00",
        "hadithNumber": "2072",
        "bookName": " كتاب الجنائز",
        "babName": " باب وَضْعِ الْجَرِيدَةِ عَلَى الْقَبْرِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - عَنِ ابْنِ الْقَاسِمِ، حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا مَاتَ أَحَدُكُمْ عُرِضَ عَلَى مَقْعَدِهِ بِالْغَدَاةِ وَالْعَشِيِّ إِنْ كَانَ مِنْ أَهْلِ الْجَنَّةِ فَمِنْ أَهْلِ الْجَنَّةِ وَإِنْ كَانَ مِنْ أَهْلِ النَّارِ فَمِنْ أَهْلِ النَّارِ فَيُقَالُ هَذَا مَقْعَدُكَ حَتَّى يَبْعَثَكَ اللَّهُ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 255,
        "matchingEnglishURN": 1072550,
        "last_updated": null
    },
    {
        "arabicURN": 1120820,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "117.00",
        "hadithNumber": "2073",
        "bookName": " كتاب الجنائز",
        "babName": " باب أَرْوَاحِ الْمُؤْمِنِينَ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبٍ، أَنَّهُ أَخْبَرَهُ أَنَّ أَبَاهُ كَعْبَ بْنَ مَالِكٍ كَانَ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّمَا نَسَمَةُ الْمُؤْمِنِ طَائِرٌ فِي شَجَرِ الْجَنَّةِ حَتَّى يَبْعَثَهُ اللَّهُ عَزَّ وَجَلَّ إِلَى جَسَدِهِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 256,
        "matchingEnglishURN": 1072560,
        "last_updated": null
    },
    {
        "arabicURN": 1120830,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "117.00",
        "hadithNumber": "2074",
        "bookName": " كتاب الجنائز",
        "babName": " باب أَرْوَاحِ الْمُؤْمِنِينَ  ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا سُلَيْمَانُ، - وَهُوَ ابْنُ الْمُغِيرَةِ - قَالَ حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ كُنَّا مَعَ عُمَرَ بَيْنَ مَكَّةَ وَالْمَدِينَةِ أَخَذَ يُحَدِّثُنَا عَنْ أَهْلِ بَدْرٍ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَيُرِينَا مَصَارِعَهُمْ بِالأَمْسِ قَالَ ‏\"‏ هَذَا مَصْرَعُ فُلاَنٍ إِنْ شَاءَ اللَّهُ غَدًا ‏\"‏ ‏.‏ قَالَ عُمَرُ وَالَّذِي بَعَثَهُ بِالْحَقِّ مَا أَخْطَئُوا تِيكَ فَجُعِلُوا فِي بِئْرٍ فَأَتَاهُمُ النَّبِيُّ صلى الله عليه وسلم فَنَادَى ‏\"‏ يَا فُلاَنُ بْنَ فُلاَنٍ يَا فُلاَنُ بْنَ فُلاَنٍ هَلْ وَجَدْتُمْ مَا وَعَدَ رَبُّكُمْ حَقًّا فَإِنِّي وَجَدْتُ مَا وَعَدَنِي اللَّهُ حَقًّا ‏\"‏ ‏.‏ فَقَالَ عُمَرُ تُكَلِّمُ أَجْسَادًا لاَ أَرْوَاحَ فِيهَا فَقَالَ ‏\"‏ مَا أَنْتُمْ بِأَسْمَعَ لِمَا أَقُولُ مِنْهُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 257,
        "matchingEnglishURN": 1072570,
        "last_updated": null
    },
    {
        "arabicURN": 1120840,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "117.00",
        "hadithNumber": "2075",
        "bookName": " كتاب الجنائز",
        "babName": " باب أَرْوَاحِ الْمُؤْمِنِينَ  ",
        "hadithText": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ سَمِعَ الْمُسْلِمُونَ، مِنَ اللَّيْلِ بِبِئْرِ بَدْرٍ وَرَسُولُ اللَّهِ صلى الله عليه وسلم قَائِمٌ يُنَادِي ‏\"‏ يَا أَبَا جَهْلِ بْنَ هِشَامٍ وَيَا شَيْبَةُ بْنَ رَبِيعَةَ وَيَا عُتْبَةُ بْنَ رَبِيعَةَ وَيَا أُمَيَّةُ بْنَ خَلَفٍ هَلْ وَجَدْتُمْ مَا وَعَدَ رَبُّكُمْ حَقًّا فَإِنِّي وَجَدْتُ مَا وَعَدَنِي رَبِّي حَقًّا ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ أَوَتُنَادِي قَوْمًا قَدْ جَيَّفُوا فَقَالَ ‏\"‏ مَا أَنْتُمْ بِأَسْمَعَ لِمَا أَقُولُ مِنْهُمْ وَلَكِنَّهُمْ لاَ يَسْتَطِيعُونَ أَنْ يُجِيبُوا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 258,
        "matchingEnglishURN": 1072580,
        "last_updated": null
    },
    {
        "arabicURN": 1120850,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "117.00",
        "hadithNumber": "2076",
        "bookName": " كتاب الجنائز",
        "babName": " باب أَرْوَاحِ الْمُؤْمِنِينَ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ آدَمَ، قَالَ حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم وَقَفَ عَلَى قَلِيبِ بَدْرٍ فَقَالَ ‏\"‏ هَلْ وَجَدْتُمْ مَا وَعَدَ رَبُّكُمْ حَقًّا - قَالَ - إِنَّهُمْ لَيَسْمَعُونَ الآنَ مَا أَقُولُ لَهُمْ ‏\"‏ ‏.‏ فَذُكِرَ ذَلِكَ لِعَائِشَةَ فَقَالَتْ وَهَلَ ابْنُ عُمَرَ إِنَّمَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّهُمُ الآنَ يَعْلَمُونَ أَنَّ الَّذِي كُنْتُ أَقُولُ لَهُمْ هُوَ الْحَقُّ ‏\"‏ ‏.‏ ثُمَّ قَرَأَتْ قَوْلَهُ ‏<A id=\"q7\" name=\"q7\" href=\"javascript:openquran(26,80,80)\"><c_q7>{‏ إِنَّكَ لاَ تُسْمِعُ الْمَوْتَى ‏}</c_q7></a>‏ حَتَّى قَرَأَتِ الآيَةَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 259,
        "matchingEnglishURN": 1072590,
        "last_updated": null
    },
    {
        "arabicURN": 1120860,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "117.00",
        "hadithNumber": "2077",
        "bookName": " كتاب الجنائز",
        "babName": " باب أَرْوَاحِ الْمُؤْمِنِينَ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، وَمُغِيرَةَ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كُلُّ بَنِي آدَمَ - وَفِي حَدِيثِ مُغِيرَةَ كُلُّ ابْنِ آدَمَ - يَأْكُلُهُ التُّرَابُ إِلاَّ عَجْبَ الذَّنَبِ مِنْهُ خُلِقَ وَفِيهِ يُرَكَّبُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 260,
        "matchingEnglishURN": 1072600,
        "last_updated": null
    },
    {
        "arabicURN": 1120870,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "117.00",
        "hadithNumber": "2078",
        "bookName": " كتاب الجنائز",
        "babName": " باب أَرْوَاحِ الْمُؤْمِنِينَ  ",
        "hadithText": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ عَجْلاَنَ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَالَ اللَّهُ عَزَّ وَجَلَّ كَذَّبَنِي ابْنُ آدَمَ وَلَمْ يَكُنْ يَنْبَغِي لَهُ أَنْ يُكَذِّبَنِي وَشَتَمَنِي ابْنُ آدَمَ وَلَمْ يَكُنْ يَنْبَغِي لَهُ أَنْ يَشْتِمَنِي أَمَّا تَكْذِيبُهُ إِيَّاىَ فَقَوْلُهُ إِنِّي لاَ أُعِيدُهُ كَمَا بَدَأْتُهُ وَلَيْسَ آخِرُ الْخَلْقِ بِأَعَزَّ عَلَىَّ مِنْ أَوَّلِهِ وَأَمَّا شَتْمُهُ إِيَّاىَ فَقَوْلُهُ اتَّخَذَ اللَّهُ وَلَدًا وَأَنَا اللَّهُ الأَحَدُ الصَّمَدُ لَمْ أَلِدْ وَلَمْ أُولَدْ وَلَمْ يَكُنْ لِي كُفُوًا أَحَدٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 261,
        "matchingEnglishURN": 1072610,
        "last_updated": null
    },
    {
        "arabicURN": 1120880,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "117.00",
        "hadithNumber": "2079",
        "bookName": " كتاب الجنائز",
        "babName": " باب أَرْوَاحِ الْمُؤْمِنِينَ  ",
        "hadithText": "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، عَنِ الزُّهْرِيِّ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ أَسْرَفَ عَبْدٌ عَلَى نَفْسِهِ حَتَّى حَضَرَتْهُ الْوَفَاةُ قَالَ لأَهْلِهِ إِذَا أَنَا مُتُّ فَأَحْرِقُونِي ثُمَّ اسْحَقُونِي ثُمَّ اذْرُونِي فِي الرِّيحِ فِي الْبَحْرِ فَوَاللَّهِ لَئِنْ قَدَرَ اللَّهُ عَلَىَّ لَيُعَذِّبَنِّي عَذَابًا لاَ يُعَذِّبُهُ أَحَدًا مِنْ خَلْقِهِ قَالَ فَفَعَلَ أَهْلُهُ ذَلِكَ قَالَ اللَّهُ عَزَّ وَجَلَّ لِكُلِّ شَىْءٍ أَخَذَ مِنْهُ شَيْئًا أَدِّ مَا أَخَذْتَ فَإِذَا هُوَ قَائِمٌ قَالَ اللَّهُ عَزَّ وَجَلَّ مَا حَمَلَكَ عَلَى مَا صَنَعْتَ قَالَ خَشْيَتُكَ ‏.‏ فَغَفَرَ اللَّهُ لَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 262,
        "matchingEnglishURN": 1072620,
        "last_updated": null
    },
    {
        "arabicURN": 1120890,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "117.00",
        "hadithNumber": "2080",
        "bookName": " كتاب الجنائز",
        "babName": " باب أَرْوَاحِ الْمُؤْمِنِينَ  ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ رِبْعِيٍّ، عَنْ حُذَيْفَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ كَانَ رَجُلٌ مِمَّنْ كَانَ قَبْلَكُمْ يُسِيءُ الظَّنَّ بِعَمَلِهِ فَلَمَّا حَضَرَتْهُ الْوَفَاةُ قَالَ لأَهْلِهِ إِذَا أَنَا مُتُّ فَأَحْرِقُونِي ثُمَّ اطْحَنُونِي ثُمَّ اذْرُونِي فِي الْبَحْرِ فَإِنَّ اللَّهَ إِنْ يَقْدِرْ عَلَىَّ لَمْ يَغْفِرْ لِي ‏.‏ قَالَ فَأَمَرَ اللَّهُ عَزَّ وَجَلَّ الْمَلاَئِكَةَ فَتَلَقَّتْ رُوحَهُ قَالَ لَهُ مَا حَمَلَكَ عَلَى مَا فَعَلْتَ قَالَ يَا رَبِّ مَا فَعَلْتُ إِلاَّ مِنْ مَخَافَتِكَ ‏.‏ فَغَفَرَ اللَّهُ لَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 263,
        "matchingEnglishURN": 1072630,
        "last_updated": null
    },
    {
        "arabicURN": 1120900,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "118.00",
        "hadithNumber": "2081",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْبَعْثِ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَخْطُبُ عَلَى الْمِنْبَرِ يَقُولُ ‏\"‏ إِنَّكُمْ مُلاَقُو اللَّهِ عَزَّ وَجَلَّ حُفَاةً عُرَاةً غُرْلاً ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 264,
        "matchingEnglishURN": 1072640,
        "last_updated": null
    },
    {
        "arabicURN": 1120910,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "118.00",
        "hadithNumber": "2082",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْبَعْثِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي الْمُغِيرَةُ بْنُ النُّعْمَانِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ عُرَاةً غُرْلاً وَأَوَّلُ الْخَلاَئِقِ يُكْسَى إِبْرَاهِيمُ عَلَيْهِ السَّلاَمُ ثُمَّ قَرَأَ ‏<A id=\"q8\" name=\"q8\" href=\"javascript:openquran(20,104,104)\"><c_q8>{‏ كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُعِيدُهُ ‏}</c_q8></a>‏ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 265,
        "matchingEnglishURN": 1072650,
        "last_updated": null
    },
    {
        "arabicURN": 1120920,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "118.00",
        "hadithNumber": "2083",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْبَعْثِ  ",
        "hadithText": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ، قَالَ حَدَّثَنَا بَقِيَّةُ، قَالَ أَخْبَرَنِي الزُّبَيْدِيُّ، قَالَ أَخْبَرَنِي الزُّهْرِيُّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ يُبْعَثُ النَّاسُ يَوْمَ الْقِيَامَةِ حُفَاةً عُرَاةً غُرْلاً ‏\"‏ ‏.‏ فَقَالَتْ عَائِشَةُ فَكَيْفَ بِالْعَوْرَاتِ قَالَ ‏\"‏ لِكُلِّ امْرِئٍ مِنْهُمْ يَوْمَئِذٍ شَأْنٌ يُغْنِيهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 266,
        "matchingEnglishURN": 1072660,
        "last_updated": null
    },
    {
        "arabicURN": 1120930,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "118.00",
        "hadithNumber": "2084",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْبَعْثِ  ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا أَبُو يُونُسَ الْقُشَيْرِيُّ، قَالَ حَدَّثَنِي ابْنُ أَبِي مُلَيْكَةَ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّكُمْ تُحْشَرُونَ حُفَاةً عُرَاةً ‏\"‏ ‏.‏ قُلْتُ الرِّجَالُ وَالنِّسَاءُ يَنْظُرُ بَعْضُهُمْ إِلَى بَعْضٍ قَالَ ‏\"‏ إِنَّ الأَمْرَ أَشَدُّ مِنْ أَنْ يُهِمَّهُمْ ذَلِكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 267,
        "matchingEnglishURN": 1072670,
        "last_updated": null
    },
    {
        "arabicURN": 1120940,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "118.00",
        "hadithNumber": "2085",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْبَعْثِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا أَبُو هِشَامٍ، قَالَ حَدَّثَنَا وُهَيْبُ بْنُ خَالِدٍ أَبُو بَكْرٍ، قَالَ حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ عَلَى ثَلاَثِ طَرَائِقَ رَاغِبِينَ رَاهِبِينَ اثْنَانِ عَلَى بَعِيرٍ وَثَلاَثَةٌ عَلَى بَعِيرٍ وَأَرْبَعَةٌ عَلَى بَعِيرٍ وَعَشْرَةٌ عَلَى بَعِيرٍ وَتَحْشُرُ بَقِيَّتَهُمُ النَّارُ تَقِيلُ مَعَهُمْ حَيْثُ قَالُوا وَتَبِيتُ مَعَهُمْ حَيْثُ بَاتُوا وَتُصْبِحُ مَعَهُمْ حَيْثُ أَصْبَحُوا وَتُمْسِي مَعَهُمْ حَيْثُ أَمْسَوْا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 268,
        "matchingEnglishURN": 1072680,
        "last_updated": null
    },
    {
        "arabicURN": 1120950,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "118.00",
        "hadithNumber": "2086",
        "bookName": " كتاب الجنائز",
        "babName": " باب الْبَعْثِ  ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، عَنِ الْوَلِيدِ بْنِ جُمَيْعٍ، قَالَ حَدَّثَنَا أَبُو الطُّفَيْلِ، عَنْ حُذَيْفَةَ بْنِ أَسِيدٍ، عَنْ أَبِي ذَرٍّ، قَالَ إِنَّ الصَّادِقَ الْمَصْدُوقَ صلى الله عليه وسلم حَدَّثَنِي ‏\"‏ أَنَّ النَّاسَ يُحْشَرُونَ ثَلاَثَةَ أَفْوَاجٍ فَوْجٌ رَاكِبِينَ طَاعِمِينَ كَاسِينَ وَفَوْجٌ تَسْحَبُهُمُ الْمَلاَئِكَةُ عَلَى وُجُوهِهِمْ وَتَحْشُرُهُمُ النَّارُ وَفَوْجٌ يَمْشُونَ وَيَسْعَوْنَ يُلْقِي اللَّهُ الآفَةَ عَلَى الظَّهْرِ فَلاَ يَبْقَى حَتَّى إِنَّ الرَّجُلَ لَتَكُونُ لَهُ الْحَدِيقَةُ يُعْطِيهَا بِذَاتِ الْقَتَبِ لاَ يَقْدِرُ عَلَيْهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 269,
        "matchingEnglishURN": 1072690,
        "last_updated": null
    },
    {
        "arabicURN": 1120960,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "119.00",
        "hadithNumber": "2087",
        "bookName": " كتاب الجنائز",
        "babName": " باب ذِكْرِ أَوَّلِ مَنْ يُكْسَى  ",
        "hadithText": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ أَخْبَرَنَا وَكِيعٌ، وَوَهْبُ بْنُ جَرِيرٍ، وَأَبُو دَاوُدَ عَنْ شُعْبَةَ، عَنِ الْمُغِيرَةِ بْنِ النُّعْمَانِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْمَوْعِظَةِ فَقَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ إِنَّكُمْ مَحْشُورُونَ إِلَى اللَّهِ عَزَّ وَجَلَّ عُرَاةً ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ ‏\"‏ حُفَاةً غُرْلاً ‏\"‏ ‏.‏ وَقَالَ وَكِيعٌ وَوَهْبٌ ‏\"‏ عُرَاةً غُرْلاً ‏<A id=\"q9\" name=\"q9\" href=\"javascript:openquran(20,104,104)\"><c_q9>{‏ كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُعِيدُهُ ‏}</c_q9></a>‏ قَالَ أَوَّلُ مَنْ يُكْسَى يَوْمَ الْقِيَامَةِ إِبْرَاهِيمُ عَلَيْهِ السَّلاَمُ وَإِنَّهُ سَيُؤْتَى ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ ‏\"‏ يُجَاءُ ‏\"‏ ‏.‏ وَقَالَ وَهْبٌ وَوَكِيعٌ ‏\"‏ سَيُؤْتَى بِرِجَالٍ مِنْ أُمَّتِي فَيُؤْخَذُ بِهِمْ ذَاتَ الشِّمَالِ فَأَقُولُ رَبِّ أَصْحَابِي ‏.‏ فَيُقَالُ إِنَّكَ لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ فَأَقُولُ كَمَا قَالَ الْعَبْدُ الصَّالِحُ ‏<A id=\"q10\" name=\"q10\" href=\"javascript:openquran(4,117,117)\"><c_q10>{‏ وَكُنْتُ عَلَيْهِمْ شَهِيدًا مَا دُمْتُ فِيهِمْ فَلَمَّا تَوَفَّيْتَنِي ‏}</c_q10></a>‏ إِلَى قَوْلِهِ ‏<A id=\"q11\" name=\"q11\" href=\"javascript:openquran(4,118,118)\"><c_q11>{‏ وَإِنْ تَغْفِرْ لَهُمْ ‏}</c_q11></a>‏ الآيَةَ فَيُقَالُ إِنَّ هَؤُلاَءِ لَمْ يَزَالُوا مُدْبِرِينَ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ ‏\"‏ مُرْتَدِّينَ عَلَى أَعْقَابِهِمْ مُنْذُ فَارَقْتَهُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 270,
        "matchingEnglishURN": 1072700,
        "last_updated": null
    },
    {
        "arabicURN": 1120970,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "120.00",
        "hadithNumber": "2088",
        "bookName": " كتاب الجنائز",
        "babName": " باب فِي التَّعْزِيَةِ  ",
        "hadithText": "أَخْبَرَنَا هَارُونُ بْنُ زَيْدٍ، - وَهُوَ ابْنُ أَبِي الزَّرْقَاءِ - قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا خَالِدُ بْنُ مَيْسَرَةَ، قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ قُرَّةَ، عَنْ أَبِيهِ، قَالَ كَانَ نَبِيُّ اللَّهِ صلى الله عليه وسلم إِذَا جَلَسَ يَجْلِسُ إِلَيْهِ نَفَرٌ مِنْ أَصْحَابِهِ وَفِيهِمْ رَجُلٌ لَهُ ابْنٌ صَغِيرٌ يَأْتِيهِ مِنْ خَلْفِ ظَهْرِهِ فَيُقْعِدُهُ بَيْنَ يَدَيْهِ فَهَلَكَ فَامْتَنَعَ الرَّجُلُ أَنْ يَحْضُرَ الْحَلْقَةَ لِذِكْرِ ابْنِهِ فَحَزِنَ عَلَيْهِ فَفَقَدَهُ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا لِي لاَ أَرَى فُلاَنًا ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ بُنَيَّهُ الَّذِي رَأَيْتَهُ هَلَكَ ‏.‏ فَلَقِيَهُ النَّبِيُّ صلى الله عليه وسلم فَسَأَلَهُ عَنْ بُنَيِّهِ فَأَخْبَرَهُ أَنَّهُ هَلَكَ فَعَزَّاهُ عَلَيْهِ ثُمَّ قَالَ ‏\"‏ يَا فُلاَنُ أَيُّمَا كَانَ أَحَبُّ إِلَيْكَ أَنْ تَمَتَّعَ بِهِ عُمْرَكَ أَوْ لاَ تَأْتِي غَدًا إِلَى بَابٍ مِنْ أَبْوَابِ الْجَنَّةِ إِلاَّ وَجَدْتَهُ قَدْ سَبَقَكَ إِلَيْهِ يَفْتَحُهُ لَكَ ‏\"‏ ‏.‏ قَالَ يَا نَبِيَّ اللَّهِ بَلْ يَسْبِقُنِي إِلَى بَابِ الْجَنَّةِ فَيَفْتَحُهَا لِي لَهُوَ أَحَبُّ إِلَىَّ ‏.‏ قَالَ ‏\"‏ فَذَاكَ لَكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 271,
        "matchingEnglishURN": 1072710,
        "last_updated": null
    },
    {
        "arabicURN": 1120980,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "121.00",
        "hadithNumber": "2089",
        "bookName": " كتاب الجنائز",
        "babName": " باب نَوْعٌ آخَرُ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، عَنْ عَبْدِ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أُرْسِلَ مَلَكُ الْمَوْتِ إِلَى مُوسَى عَلَيْهِ السَّلاَمُ فَلَمَّا جَاءَهُ صَكَّهُ فَفَقَأَ عَيْنَهُ فَرَجَعَ إِلَى رَبِّهِ فَقَالَ أَرْسَلْتَنِي إِلَى عَبْدٍ لاَ يُرِيدُ الْمَوْتَ ‏.‏ فَرَدَّ اللَّهُ عَزَّ وَجَلَّ إِلَيْهِ عَيْنَهُ وَقَالَ ارْجِعْ إِلَيْهِ فَقُلْ لَهُ يَضَعُ يَدَهُ عَلَى مَتْنِ ثَوْرٍ فَلَهُ بِكُلِّ مَا غَطَّتْ يَدُهُ بِكُلِّ شَعْرَةٍ سَنَةٌ ‏.‏ قَالَ أَىْ رَبِّ ثُمَّ مَهْ قَالَ الْمَوْتُ ‏.‏ قَالَ فَالآنَ ‏.‏ فَسَأَلَ اللَّهَ عَزَّ وَجَلَّ أَنْ يُدْنِيَهُ مِنَ الأَرْضِ الْمُقَدَّسَةِ رَمْيَةً بِحَجَرٍ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَلَوْ كُنْتُ ثَمَّ لأَرَيْتُكُمْ قَبْرَهُ إِلَى جَانِبِ الطَّرِيقِ تَحْتَ الْكَثِيبِ الأَحْمَرِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 272,
        "matchingEnglishURN": 1072720,
        "last_updated": null
    }
]