[
    {
        "arabicURN": 1137750,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "1.00",
        "hadithNumber": "3761",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ الرُّهَاوِيُّ، وَمُوسَى بْنُ عَبْدِ الرَّحْمَنِ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَتْ يَمِينٌ يَحْلِفُ عَلَيْهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ وَمُقَلِّبِ الْقُلُوبِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 1,
        "matchingEnglishURN": 1037750,
        "last_updated": null
    },
    {
        "arabicURN": 1137760,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "2.00",
        "hadithNumber": "3762",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْحَلِفِ بِمُصَرِّفِ الْقُلُوبِ ‏ ",
        "hadithText": "أَخْبَرَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ أَبُو يَعْلَى، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ، عَنْ عَبَّادِ بْنِ إِسْحَاقَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ كَانَتْ يَمِينُ رَسُولِ اللَّهِ صلى الله عليه وسلم الَّتِي يَحْلِفُ بِهَا ‏\"‏ لاَ وَمُصَرِّفِ الْقُلُوبِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 2,
        "matchingEnglishURN": 1037760,
        "last_updated": null
    },
    {
        "arabicURN": 1137770,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "3.00",
        "hadithNumber": "3763",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْحَلِفِ بِعِزَّةِ اللَّهِ تَعَالَى ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرٍو، قَالَ حَدَّثَنَا أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لَمَّا خَلَقَ اللَّهُ الْجَنَّةَ وَالنَّارَ أَرْسَلَ جِبْرِيلَ عَلَيْهِ السَّلاَمُ إِلَى الْجَنَّةِ فَقَالَ انْظُرْ إِلَيْهَا وَإِلَى مَا أَعْدَدْتُ لأَهْلِهَا فِيهَا ‏.‏ فَنَظَرَ إِلَيْهَا فَرَجَعَ فَقَالَ وَعِزَّتِكَ لاَ يَسْمَعُ بِهَا أَحَدٌ إِلاَّ دَخَلَهَا ‏.‏ فَأَمَرَ بِهَا فَحُفَّتْ بِالْمَكَارِهِ فَقَالَ اذْهَبْ إِلَيْهَا فَانْظُرْ إِلَيْهَا وَإِلَى مَا أَعْدَدْتُ لأَهْلِهَا فِيهَا فَنَظَرَ إِلَيْهَا فَإِذَا هِيَ قَدْ حُفَّتْ بِالْمَكَارِهِ فَقَالَ وَعِزَّتِكَ لَقَدْ خَشِيتُ أَنْ لاَ يَدْخُلَهَا أَحَدٌ ‏.‏ قَالَ اذْهَبْ فَانْظُرْ إِلَى النَّارِ وَإِلَى مَا أَعْدَدْتُ لأَهْلِهَا فِيهَا ‏.‏ فَنَظَرَ إِلَيْهَا فَإِذَا هِيَ يَرْكَبُ بَعْضُهَا بَعْضًا فَرَجَعَ فَقَالَ وَعِزَّتِكَ لاَ يَدْخُلُهَا أَحَدٌ ‏.‏ فَأَمَرَ بِهَا فَحُفَّتْ بِالشَّهَوَاتِ فَقَالَ ارْجِعْ فَانْظُرْ إِلَيْهَا ‏.‏ فَإِذَا هِيَ قَدْ حُفَّتْ بِالشَّهَوَاتِ فَرَجَعَ وَقَالَ وَعِزَّتِكَ لَقَدْ خَشِيتُ أَنْ لاَ يَنْجُوَ مِنْهَا أَحَدٌ إِلاَّ دَخَلَهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 3,
        "matchingEnglishURN": 1037770,
        "last_updated": null
    },
    {
        "arabicURN": 1137780,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "4.00",
        "hadithNumber": "3764",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب التَّشْدِيدِ فِي الْحَلِفِ بِغَيْرِ اللَّهِ تَعَالَى ‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، عَنْ إِسْمَاعِيلَ، - وَهُوَ ابْنُ جَعْفَرٍ - قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ كَانَ حَالِفًا فَلاَ يَحْلِفْ إِلاَّ بِاللَّهِ ‏\"‏ ‏.‏ وَكَانَتْ قُرَيْشٌ تَحْلِفُ بِآبَائِهَا فَقَالَ ‏\"‏ لاَ تَحْلِفُوا بِآبَائِكُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 4,
        "matchingEnglishURN": 1037780,
        "last_updated": null
    },
    {
        "arabicURN": 1137790,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "4.00",
        "hadithNumber": "3765",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب التَّشْدِيدِ فِي الْحَلِفِ بِغَيْرِ اللَّهِ تَعَالَى ‏ ",
        "hadithText": "أَخْبَرَنِي زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي إِسْحَاقَ، قَالَ حَدَّثَنِي رَجُلٌ، مِنْ بَنِي غِفَارٍ فِي مَجْلِسِ سَالِمِ بْنِ عَبْدِ اللَّهِ قَالَ سَالِمُ بْنُ عَبْدِ اللَّهِ سَمِعْتُ عَبْدَ اللَّهِ، - يَعْنِي ابْنَ عُمَرَ - وَهُوَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 5,
        "matchingEnglishURN": 1037790,
        "last_updated": null
    },
    {
        "arabicURN": 1137800,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "5.00",
        "hadithNumber": "3766",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْحَلِفِ بِالآبَاءِ ‏ ",
        "hadithText": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَاللَّفْظُ، لَهُ قَالاَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ النَّبِيُّ صلى الله عليه وسلم عُمَرَ مَرَّةً وَهُوَ يَقُولُ وَأَبِي وَأَبِي ‏.‏ فَقَالَ ‏\"‏ إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ ‏\"‏ ‏.‏ فَوَاللَّهِ مَا حَلَفْتُ بِهَا بَعْدُ ذَاكِرًا وَلاَ آثِرًا ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 6,
        "matchingEnglishURN": 1037800,
        "last_updated": null
    },
    {
        "arabicURN": 1137810,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "5.00",
        "hadithNumber": "3767",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْحَلِفِ بِالآبَاءِ ‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، وَسَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ، - وَاللَّفْظُ لَهُ - قَالاَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنْ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ ‏\"‏ ‏.‏ قَالَ عُمَرُ فَوَاللَّهِ مَا حَلَفْتُ بِهَا بَعْدُ ذَاكِرًا وَلاَ آثِرًا ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 7,
        "matchingEnglishURN": 1037810,
        "last_updated": null
    },
    {
        "arabicURN": 1137820,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "5.00",
        "hadithNumber": "3768",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْحَلِفِ بِالآبَاءِ ‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدٍ، قَالَ أَنْبَأَنَا مُحَمَّدٌ، - وَهُوَ ابْنُ حَرْبٍ - عَنِ الزُّبَيْدِيِّ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّهُ أَخْبَرَهُ عَنْ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ ‏\"‏ ‏.‏ قَالَ عُمَرُ فَوَاللَّهِ مَا حَلَفْتُ بِهَا بَعْدُ ذَاكِرًا وَلاَ آثِرًا ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 8,
        "matchingEnglishURN": 1037820,
        "last_updated": null
    },
    {
        "arabicURN": 1137830,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "6.00",
        "hadithNumber": "3769",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْحَلِفِ بِالأُمَّهَاتِ ‏ ",
        "hadithText": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا عَوْفٌ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَحْلِفُوا بِآبَائِكُمْ وَلاَ بِأُمَّهَاتِكُمْ وَلاَ بِالأَنْدَادِ وَلاَ تَحْلِفُوا إِلاَّ بِاللَّهِ وَلاَ تَحْلِفُوا إِلاَّ وَأَنْتُمْ صَادِقُونَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 9,
        "matchingEnglishURN": 1037830,
        "last_updated": null
    },
    {
        "arabicURN": 1137840,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "7.00",
        "hadithNumber": "3770",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْحَلِفِ بِمِلَّةٍ سِوَى الإِسْلاَمِ ‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ خَالِدٍ، ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ أَبِي قِلاَبَةَ، عَنْ ثَابِتِ بْنِ الضَّحَّاكِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ بِمِلَّةٍ سِوَى الإِسْلاَمِ كَاذِبًا فَهُوَ كَمَا قَالَ ‏\"‏ ‏.‏ قَالَ قُتَيْبَةُ فِي حَدِيثِهِ مُتَعَمِّدًا وَقَالَ يَزِيدُ ‏\"‏ كَاذِبًا فَهُوَ كَمَا قَالَ وَمَنْ قَتَلَ نَفْسَهُ بِشَىْءٍ عَذَّبَهُ اللَّهُ بِهِ فِي نَارِ جَهَنَّمَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 10,
        "matchingEnglishURN": 1037840,
        "last_updated": null
    },
    {
        "arabicURN": 1137850,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "7.00",
        "hadithNumber": "3771",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْحَلِفِ بِمِلَّةٍ سِوَى الإِسْلاَمِ ‏ ",
        "hadithText": "أَخْبَرَنِي مَحْمُودُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا الْوَلِيدُ، قَالَ حَدَّثَنَا أَبُو عَمْرٍو، عَنْ يَحْيَى، أَنَّهُ حَدَّثَهُ قَالَ حَدَّثَنِي أَبُو قِلاَبَةَ، قَالَ حَدَّثَنِي ثَابِتُ بْنُ الضَّحَّاكِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ حَلَفَ بِمِلَّةٍ سِوَى الإِسْلاَمِ كَاذِبًا فَهُوَ كَمَا قَالَ وَمَنْ قَتَلَ نَفْسَهُ بِشَىْءٍ عُذِّبَ بِهِ فِي الآخِرَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 11,
        "matchingEnglishURN": 1037850,
        "last_updated": null
    },
    {
        "arabicURN": 1137860,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "8.00",
        "hadithNumber": "3772",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْحَلِفِ بِالْبَرَاءَةِ مِنَ الإِسْلاَمِ ‏ ",
        "hadithText": "أَخْبَرَنَا الْحُسَيْنِ بْنُ حُرَيْثٍ، قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ حُسَيْنِ بْنِ وَاقِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ قَالَ إِنِّي بَرِيءٌ مِنَ الإِسْلاَمِ فَإِنْ كَانَ كَاذِبًا فَهُوَ كَمَا قَالَ وَإِنْ كَانَ صَادِقًا لَمْ يَعُدْ إِلَى الإِسْلاَمِ سَالِمًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 12,
        "matchingEnglishURN": 1037860,
        "last_updated": null
    },
    {
        "arabicURN": 1137870,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "9.00",
        "hadithNumber": "3773",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْحَلِفِ بِالْكَعْبَةِ ‏ ",
        "hadithText": "أَخْبَرَنَا يُوسُفُ بْنُ عِيسَى، قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، قَالَ حَدَّثَنَا مِسْعَرٌ، عَنْ مَعْبَدِ بْنِ خَالِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ يَسَارٍ، عَنْ قُتَيْلَةَ، - امْرَأَةٌ مِنْ جُهَيْنَةَ - أَنَّ يَهُودِيًّا، أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ إِنَّكُمْ تُنَدِّدُونَ وَإِنَّكُمْ تُشْرِكُونَ تَقُولُونَ مَا شَاءَ اللَّهُ وَشِئْتَ وَتَقُولُونَ وَالْكَعْبَةِ ‏.‏ فَأَمَرَهُمُ النَّبِيُّ صلى الله عليه وسلم إِذَا أَرَادُوا أَنْ يَحْلِفُوا أَنْ يَقُولُوا ‏\"‏ وَرَبِّ الْكَعْبَةِ ‏\"‏ ‏.‏ وَيَقُولُونَ ‏\"‏ مَا شَاءَ اللَّهُ ثُمَّ شِئْتَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 13,
        "matchingEnglishURN": 1037870,
        "last_updated": null
    },
    {
        "arabicURN": 1137880,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "10.00",
        "hadithNumber": "3774",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْحَلِفِ بِالطَّوَاغِيتِ ‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ أَنْبَأَنَا هِشَامٌ، عَنِ الْحَسَنِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَحْلِفُوا بِآبَائِكُمْ وَلاَ بِالطَّوَاغِيتِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 14,
        "matchingEnglishURN": 1037880,
        "last_updated": null
    },
    {
        "arabicURN": 1137890,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "11.00",
        "hadithNumber": "3775",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْحَلِفِ بِاللاَّتِ ‏ ",
        "hadithText": "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، عَنِ الزُّهْرِيِّ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ مِنْكُمْ فَقَالَ بِاللاَّتِ فَلْيَقُلْ لاَ إِلَهَ إِلاَّ اللَّهُ وَمَنْ قَالَ لِصَاحِبِهِ تَعَالَ أُقَامِرْكَ فَلْيَتَصَدَّقْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 15,
        "matchingEnglishURN": 1037890,
        "last_updated": null
    },
    {
        "arabicURN": 1137900,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "12.00",
        "hadithNumber": "3776",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْحَلِفِ بِاللاَّتِ وَالْعُزَّى ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا زُهَيْرٌ، قَالَ حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ مُصْعَبِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ كُنَّا نَذْكُرُ بَعْضَ الأَمْرِ وَأَنَا حَدِيثُ، عَهْدٍ بِالْجَاهِلِيَّةِ فَحَلَفْتُ بِاللاَّتِ وَالْعُزَّى فَقَالَ لِي أَصْحَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم بِئْسَ مَا قُلْتَ ائْتِ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَخْبِرْهُ فَإِنَّا لاَ نَرَاكَ إِلاَّ قَدْ كَفَرْتَ فَأَتَيْتُهُ فَأَخْبَرْتُهُ فَقَالَ لِي ‏\"‏ قُلْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ ثَلاَثَ مَرَّاتٍ وَتَعَوَّذْ بِاللَّهِ مِنَ الشَّيْطَانِ ثَلاَثَ مَرَّاتٍ وَاتْفُلْ عَنْ يَسَارِكَ ثَلاَثَ مَرَّاتٍ وَلاَ تَعُدْ لَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 16,
        "matchingEnglishURN": 1037900,
        "last_updated": null
    },
    {
        "arabicURN": 1137910,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "12.00",
        "hadithNumber": "3777",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْحَلِفِ بِاللاَّتِ وَالْعُزَّى ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَبْدُ الْحَمِيدِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا مَخْلَدٌ، قَالَ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَاقَ، عَنْ أَبِيهِ، قَالَ حَدَّثَنِي مُصْعَبُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، قَالَ حَلَفْتُ بِاللاَّتِ وَالْعُزَّى فَقَالَ لِي أَصْحَابِي بِئْسَ مَا قُلْتَ قُلْتَ هُجْرًا ‏.‏ فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ ‏\"‏ قُلْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ وَانْفُثْ عَنْ يَسَارِكَ ثَلاَثًا وَتَعَوَّذْ بِاللَّهِ مِنَ الشَّيْطَانِ ثُمَّ لاَ تَعُدْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 17,
        "matchingEnglishURN": 1037910,
        "last_updated": null
    },
    {
        "arabicURN": 1137920,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "13.00",
        "hadithNumber": "3778",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب إِبْرَارِ الْقَسَمِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، عَنْ مُحَمَّدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الأَشْعَثِ بْنِ سُلَيْمٍ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِسَبْعٍ أَمَرَنَا بِاتِّبَاعِ الْجَنَائِزِ وَعِيَادَةِ الْمَرِيضِ وَتَشْمِيتِ الْعَاطِسِ وَإِجَابَةِ الدَّاعِي وَنَصْرِ الْمَظْلُومِ وَإِبْرَارِ الْقَسَمِ وَرَدِّ السَّلاَمِ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 18,
        "matchingEnglishURN": 1037920,
        "last_updated": null
    },
    {
        "arabicURN": 1137930,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "14.00",
        "hadithNumber": "3779",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ سُلَيْمَانَ، عَنْ أَبِي السَّلِيلِ، عَنْ زَهْدَمٍ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَا عَلَى الأَرْضِ يَمِينٌ أَحْلِفُ عَلَيْهَا فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا إِلاَّ أَتَيْتُهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 19,
        "matchingEnglishURN": 1037930,
        "last_updated": null
    },
    {
        "arabicURN": 1137940,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "15.00",
        "hadithNumber": "3780",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْكَفَّارَةِ قَبْلَ الْحِنْثِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ غَيْلاَنَ بْنِ جَرِيرٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، قَالَ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي رَهْطٍ مِنَ الأَشْعَرِيِّينَ نَسْتَحْمِلُهُ فَقَالَ ‏\"‏ وَاللَّهِ لاَ أَحْمِلُكُمْ وَمَا عِنْدِي مَا أَحْمِلُكُمْ ‏\"‏ ‏.‏ ثُمَّ لَبِثْنَا مَا شَاءَ اللَّهُ فَأُتِيَ بِإِبِلٍ فَأَمَرَ لَنَا بِثَلاَثِ ذَوْدٍ فَلَمَّا انْطَلَقْنَا قَالَ بَعْضُنَا لِبَعْضٍ لاَ يُبَارِكُ اللَّهُ لَنَا أَتَيْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم نَسْتَحْمِلُهُ فَحَلَفَ أَنْ لاَ يَحْمِلَنَا ‏.‏ قَالَ أَبُو مُوسَى فَأَتَيْنَا النَّبِيَّ صلى الله عليه وسلم فَذَكَرْنَا ذَلِكَ لَهُ فَقَالَ ‏\"‏ مَا أَنَا حَمَلْتُكُمْ بَلِ اللَّهُ حَمَلَكُمْ إِنِّي وَاللَّهِ لاَ أَحْلِفُ عَلَى يَمِينٍ فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا إِلاَّ كَفَّرْتُ عَنْ يَمِينِي وَأَتَيْتُ الَّذِي هُوَ خَيْرٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 20,
        "matchingEnglishURN": 1037940,
        "last_updated": null
    },
    {
        "arabicURN": 1137950,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "15.00",
        "hadithNumber": "3781",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْكَفَّارَةِ قَبْلَ الْحِنْثِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ بْنِ الأَخْنَسِ، قَالَ حَدَّثَنَا عَمْرُو بْنُ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيُكَفِّرْ عَنْ يَمِينِهِ وَلْيَأْتِ الَّذِي هُوَ خَيْرٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 21,
        "matchingEnglishURN": 1037950,
        "last_updated": null
    },
    {
        "arabicURN": 1137960,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "15.00",
        "hadithNumber": "3782",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْكَفَّارَةِ قَبْلَ الْحِنْثِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا الْمُعْتَمِرُ، عَنْ أَبِيهِ، عَنِ الْحَسَنِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا حَلَفَ أَحَدُكُمْ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيُكَفِّرْ عَنْ يَمِينِهِ وَلْيَنْظُرِ الَّذِي هُوَ خَيْرٌ فَلْيَأْتِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 22,
        "matchingEnglishURN": 1037960,
        "last_updated": null
    },
    {
        "arabicURN": 1137970,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "15.00",
        "hadithNumber": "3783",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْكَفَّارَةِ قَبْلَ الْحِنْثِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا عَفَّانُ، قَالَ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، قَالَ سَمِعْتُ الْحَسَنَ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا حَلَفْتَ عَلَى يَمِينٍ فَكَفِّرْ عَنْ يَمِينِكَ ثُمَّ ائْتِ الَّذِي هُوَ خَيْرٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 23,
        "matchingEnglishURN": 1037970,
        "last_updated": null
    },
    {
        "arabicURN": 1137980,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "15.00",
        "hadithNumber": "3784",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْكَفَّارَةِ قَبْلَ الْحِنْثِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى الْقُطَعِيُّ، عَنْ عَبْدِ الأَعْلَى، وَذَكَرَ، كَلِمَةً مَعْنَاهَا حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَكَفِّرْ عَنْ يَمِينِكَ وَائْتِ الَّذِي هُوَ خَيْرٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 24,
        "matchingEnglishURN": 1037980,
        "last_updated": null
    },
    {
        "arabicURN": 1137990,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "16.00",
        "hadithNumber": "3785",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْكَفَّارَةِ بَعْدَ الْحِنْثِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو، مَوْلَى الْحَسَنِ بْنِ عَلِيٍّ يُحَدِّثُ عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيَأْتِ الَّذِي هُوَ خَيْرٌ وَلْيُكَفِّرْ عَنْ يَمِينِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 25,
        "matchingEnglishURN": 1037990,
        "last_updated": null
    },
    {
        "arabicURN": 1138000,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "16.00",
        "hadithNumber": "3786",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْكَفَّارَةِ بَعْدَ الْحِنْثِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنْ تَمِيمِ بْنِ طَرَفَةَ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيَدَعْ يَمِينَهُ وَلْيَأْتِ الَّذِي هُوَ خَيْرٌ وَلْيُكَفِّرْهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 26,
        "matchingEnglishURN": 1038000,
        "last_updated": null
    },
    {
        "arabicURN": 1138010,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "16.00",
        "hadithNumber": "3787",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْكَفَّارَةِ بَعْدَ الْحِنْثِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ، قَالَ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَبْدُ الْعَزِيزِ بْنُ رُفَيْعٍ، قَالَ سَمِعْتُ تَمِيمَ بْنَ طَرَفَةَ، يُحَدِّثُ عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى خَيْرًا مِنْهَا فَلْيَأْتِ الَّذِي هُوَ خَيْرٌ وَلْيَتْرُكْ يَمِينَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 27,
        "matchingEnglishURN": 1038010,
        "last_updated": null
    },
    {
        "arabicURN": 1138020,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "16.00",
        "hadithNumber": "3788",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْكَفَّارَةِ بَعْدَ الْحِنْثِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، عَنْ سُفْيَانَ، قَالَ حَدَّثَنَا أَبُو الزَّعْرَاءِ، عَنْ عَمِّهِ أَبِي الأَحْوَصِ، عَنْ أَبِيهِ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ ابْنَ عَمٍّ لِي أَتَيْتُهُ أَسْأَلُهُ فَلاَ يُعْطِينِي وَلاَ يَصِلُنِي ثُمَّ يَحْتَاجُ إِلَىَّ فَيَأْتِينِي فَيَسْأَلُنِي وَقَدْ حَلَفْتُ أَنْ لاَ أُعْطِيَهُ وَلاَ أَصِلَهُ فَأَمَرَنِي أَنْ آتِيَ الَّذِي هُوَ خَيْرٌ وَأُكَفِّرَ عَنْ يَمِينِي ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 28,
        "matchingEnglishURN": 1038020,
        "last_updated": null
    },
    {
        "arabicURN": 1138030,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "16.00",
        "hadithNumber": "3789",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْكَفَّارَةِ بَعْدَ الْحِنْثِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا هُشَيْمٌ، قَالَ أَنْبَأَنَا مَنْصُورٌ، وَيُونُسُ، عَنِ الْحَسَنِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ، قَالَ قَالَ لِي النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِذَا آلَيْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَأْتِ الَّذِي هُوَ خَيْرٌ وَكَفِّرْ عَنْ يَمِينِكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 29,
        "matchingEnglishURN": 1038030,
        "last_updated": null
    },
    {
        "arabicURN": 1138040,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "16.00",
        "hadithNumber": "3790",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْكَفَّارَةِ بَعْدَ الْحِنْثِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا ابْنُ عَوْنٍ، عَنِ الْحَسَنِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ، قَالَ قَالَ يَعْنِي رَسُولَ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَأْتِ الَّذِي هُوَ خَيْرٌ مِنْهَا وَكَفِّرْ عَنْ يَمِينِكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 30,
        "matchingEnglishURN": 1038040,
        "last_updated": null
    },
    {
        "arabicURN": 1138050,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "16.00",
        "hadithNumber": "3791",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْكَفَّارَةِ بَعْدَ الْحِنْثِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ، فِي حَدِيثِهِ عَنْ جَرِيرٍ، عَنْ مَنْصُورٍ، عَنِ الْحَسَنِ الْبَصْرِيِّ، قَالَ عَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَأْتِ الَّذِي هُوَ خَيْرٌ وَكَفِّرْ عَنْ يَمِينِكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 31,
        "matchingEnglishURN": 1038050,
        "last_updated": null
    },
    {
        "arabicURN": 1138060,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "17.00",
        "hadithNumber": "3792",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْيَمِينِ فِيمَا لاَ يَمْلِكُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ بْنِ الأَخْنَسِ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ نَذْرَ وَلاَ يَمِينَ فِيمَا لاَ تَمْلِكُ وَلاَ فِي مَعْصِيَةٍ وَلاَ قَطِيعَةِ رَحِمٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 32,
        "matchingEnglishURN": 1038060,
        "last_updated": null
    },
    {
        "arabicURN": 1138070,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "18.00",
        "hadithNumber": "3793",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب مَنْ حَلَفَ فَاسْتَثْنَى ‏‏ ",
        "hadithText": "أَخْبَرَنِي أَحْمَدُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حِبَّانُ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ حَلَفَ فَاسْتَثْنَى فَإِنْ شَاءَ مَضَى وَإِنْ شَاءَ تَرَكَ غَيْرَ حَنِثٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 33,
        "matchingEnglishURN": 1038070,
        "last_updated": null
    },
    {
        "arabicURN": 1138080,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "19.00",
        "hadithNumber": "3794",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب النِّيَّةِ فِي الْيَمِينِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا سُلَيْمَانُ بْنُ حَيَّانَ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ بْنِ وَقَّاصٍ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّمَا الأَعْمَالُ بِالنِّيَّةِ وَإِنَّمَا لاِمْرِئٍ مَا نَوَى فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوِ امْرَأَةٍ يَتَزَوَّجُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 34,
        "matchingEnglishURN": 1038080,
        "last_updated": null
    },
    {
        "arabicURN": 1138090,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "20.00",
        "hadithNumber": "3795",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب تَحْرِيمِ مَا أَحَلَّ اللَّهُ عَزَّ وَجَلَّ ‏‏ ",
        "hadithText": "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ، قَالَ حَدَّثَنَا حَجَّاجٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ زَعَمَ عَطَاءٌ أَنَّهُ سَمِعَ عُبَيْدَ بْنَ عُمَيْرٍ، يَقُولُ سَمِعْتُ عَائِشَةَ، تَزْعُمُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَمْكُثُ عِنْدَ زَيْنَبَ بِنْتِ جَحْشٍ فَيَشْرَبُ عِنْدَهَا عَسَلاً فَتَوَاصَيْتُ أَنَا وَحَفْصَةُ أَنَّ أَيَّتَنَا دَخَلَ عَلَيْهَا النَّبِيُّ صلى الله عليه وسلم فَلْتَقُلْ إِنِّي أَجِدُ مِنْكَ رِيحَ مَغَافِيرَ أَكَلْتَ مَغَافِيرَ فَدَخَلَ عَلَى إِحْدَاهُمَا فَقَالَتْ ذَلِكَ لَهُ فَقَالَ ‏\"‏ لاَ بَلْ شَرِبْتُ عَسَلاً عِنْدَ زَيْنَبَ بِنْتِ جَحْشٍ وَلَنْ أَعُودَ لَهُ ‏\"‏ ‏.‏ فَنَزَلَتْ ‏<A id=\"q1\" name=\"q1\" href=\"javascript:openquran(65,1,1)\"><c_q1>{‏ يَا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ ‏}</c_q1></a>‏ إِلَى ‏<A id=\"q2\" name=\"q2\" href=\"javascript:openquran(65,4,4)\"><c_q2>{‏ إِنْ تَتُوبَا إِلَى اللَّهِ ‏}</c_q2></a>‏ عَائِشَةُ وَحَفْصَةُ ‏<A id=\"q3\" name=\"q3\" href=\"javascript:openquran(65,3,3)\"><c_q3>{‏ وَإِذْ أَسَرَّ النَّبِيُّ إِلَى بَعْضِ أَزْوَاجِهِ حَدِيثًا ‏}</c_q3></a>‏ لِقَوْلِهِ ‏\"‏ بَلْ شَرِبْتُ عَسَلاً ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 35,
        "matchingEnglishURN": 1038090,
        "last_updated": null
    },
    {
        "arabicURN": 1138100,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "21.00",
        "hadithNumber": "3796",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب إِذَا حَلَفَ أَنْ لاَ يَأْتَدِمَ فَأَكَلَ خُبْزًا بِخَلٍّ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا الْمُثَنَّى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا طَلْحَةُ بْنُ نَافِعٍ، عَنْ جَابِرٍ، قَالَ دَخَلْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم بَيْتَهُ فَإِذَا فِلَقٌ وَخَلٌّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كُلْ فَنِعْمَ الإِدَامُ الْخَلُّ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 36,
        "matchingEnglishURN": 1038100,
        "last_updated": null
    },
    {
        "arabicURN": 1138110,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "22.00",
        "hadithNumber": "3797",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب فِي الْحَلِفِ وَالْكَذِبِ لِمَنْ لَمْ يَعْتَقِدِ الْيَمِينَ بِقَلْبِهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الْمَلِكِ، عَنْ أَبِي وَائِلٍ، عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ، قَالَ كُنَّا نُسَمَّى السَّمَاسِرَةَ فَأَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَنَحْنُ نَبِيعُ فَسَمَّانَا بِاسْمٍ هُوَ خَيْرٌ مِنِ اسْمِنَا فَقَالَ ‏\"‏ يَا مَعْشَرَ التُّجَّارِ إِنَّ هَذَا الْبَيْعَ يَحْضُرُهُ الْحَلِفُ وَالْكَذِبُ فَشُوبُوا بَيْعَكُمْ بِالصَّدَقَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 37,
        "matchingEnglishURN": 1038110,
        "last_updated": null
    },
    {
        "arabicURN": 1138120,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "22.00",
        "hadithNumber": "3798",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب فِي الْحَلِفِ وَالْكَذِبِ لِمَنْ لَمْ يَعْتَقِدِ الْيَمِينَ بِقَلْبِهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، عَنْ سُفْيَانَ، عَنْ عَبْدِ الْمَلِكِ، وَعَاصِمٍ، وَجَامِعٍ، عَنْ أَبِي وَائِلٍ، عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ، قَالَ كُنَّا نَبِيعُ بِالْبَقِيعِ فَأَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَكُنَّا نُسَمَّى السَّمَاسِرَةَ فَقَالَ ‏\"‏ يَا مَعْشَرَ التُّجَّارِ ‏\"‏ ‏.‏ فَسَمَّانَا بِاسْمٍ هُوَ خَيْرٌ مِنِ اسْمِنَا ثُمَّ قَالَ ‏\"‏ إِنَّ هَذَا الْبَيْعَ يَحْضُرُهُ الْحَلِفُ وَالْكَذِبُ فَشُوبُوهُ بِالصَّدَقَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 38,
        "matchingEnglishURN": 1038120,
        "last_updated": null
    },
    {
        "arabicURN": 1138130,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "23.00",
        "hadithNumber": "3799",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب فِي اللَّغْوِ وَالْكَذِبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مُغِيرَةَ، عَنْ أَبِي وَائِلٍ، عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ، قَالَ أَتَانَا النَّبِيُّ صلى الله عليه وسلم وَنَحْنُ فِي السُّوقِ فَقَالَ ‏\"‏ إِنَّ هَذِهِ السُّوقَ يُخَالِطُهَا اللَّغْوُ وَالْكَذِبُ فَشُوبُوهَا بِالصَّدَقَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 39,
        "matchingEnglishURN": 1038130,
        "last_updated": null
    },
    {
        "arabicURN": 1138140,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "23.00",
        "hadithNumber": "3800",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب فِي اللَّغْوِ وَالْكَذِبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، وَمُحَمَّدُ بْنُ قُدَامَةَ، قَالاَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ، قَالَ كُنَّا بِالْمَدِينَةِ نَبِيعُ الأَوْسَاقَ وَنَبْتَاعُهَا وَكُنَّا نُسَمِّي أَنْفُسَنَا السَّمَاسِرَةَ وَيُسَمِّينَا النَّاسُ فَخَرَجَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ فَسَمَّانَا بِاسْمٍ هُوَ خَيْرٌ مِنَ الَّذِي سَمَّيْنَا أَنْفُسَنَا وَسَمَّانَا النَّاسُ فَقَالَ ‏\"‏ يَا مَعْشَرَ التُّجَّارِ إِنَّهُ يَشْهَدُ بَيْعَكُمُ الْحَلِفُ وَالْكَذِبُ فَشُوبُوهُ بِالصَّدَقَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 40,
        "matchingEnglishURN": 1038140,
        "last_updated": null
    },
    {
        "arabicURN": 1138150,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "24.00",
        "hadithNumber": "3801",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب النَّهْىِ عَنِ النَّذْرِ، ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ شُعْبَةَ، قَالَ أَخْبَرَنِي مَنْصُورٌ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ النَّذْرِ وَقَالَ ‏\"‏ إِنَّهُ لاَ يَأْتِي بِخَيْرٍ إِنَّمَا يُسْتَخْرَجُ بِهِ مِنَ الْبَخِيلِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 41,
        "matchingEnglishURN": 1038150,
        "last_updated": null
    },
    {
        "arabicURN": 1138160,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "24.00",
        "hadithNumber": "3802",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب النَّهْىِ عَنِ النَّذْرِ، ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ النَّذْرِ وَقَالَ ‏\"‏ إِنَّهُ لاَ يَرُدُّ شَيْئًا إِنَّمَا يُسْتَخْرَجُ بِهِ مِنَ الشَّحِيحِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 42,
        "matchingEnglishURN": 1038160,
        "last_updated": null
    },
    {
        "arabicURN": 1138170,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "25.00",
        "hadithNumber": "3803",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب النَّذْرِ لاَ يُقَدِّمُ شَيْئًا وَلاَ يُؤَخِّرُهُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ النَّذْرُ لاَ يُقَدِّمُ شَيْئًا وَلاَ يُؤَخِّرُهُ إِنَّمَا هُوَ شَىْءٌ يُسْتَخْرَجُ بِهِ مِنَ الشَّحِيحِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 43,
        "matchingEnglishURN": 1038170,
        "last_updated": null
    },
    {
        "arabicURN": 1138180,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "25.00",
        "hadithNumber": "3804",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب النَّذْرِ لاَ يُقَدِّمُ شَيْئًا وَلاَ يُؤَخِّرُهُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَأْتِي النَّذْرُ عَلَى ابْنِ آدَمَ شَيْئًا لَمْ يُقَدِّرْهُ عَلَيْهِ وَلَكِنَّهُ شَىْءٌ يُسْتَخْرَجُ بِهِ مِنَ الْبَخِيلِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 44,
        "matchingEnglishURN": 1038180,
        "last_updated": null
    },
    {
        "arabicURN": 1138190,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "26.00",
        "hadithNumber": "3805",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب النَّذْرُ يُسْتَخْرَجُ بِهِ مِنَ الْبَخِيلِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَنْذِرُوا فَإِنَّ النَّذْرَ لاَ يُغْنِي مِنَ الْقَدَرِ شَيْئًا وَإِنَّمَا يُسْتَخْرَجُ بِهِ مِنَ الْبَخِيلِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 45,
        "matchingEnglishURN": 1038190,
        "last_updated": null
    },
    {
        "arabicURN": 1138200,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "27.00",
        "hadithNumber": "3806",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب النَّذْرِ فِي الطَّاعَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ طَلْحَةَ بْنِ عَبْدِ الْمَلِكِ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ وَمَنْ نَذَرَ أَنْ يَعْصِيَ اللَّهَ فَلاَ يَعْصِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 46,
        "matchingEnglishURN": 1038200,
        "last_updated": null
    },
    {
        "arabicURN": 1138210,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "28.00",
        "hadithNumber": "3807",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب النَّذْرِ فِي الْمَعْصِيَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا مَالِكٌ، قَالَ حَدَّثَنِي طَلْحَةُ بْنُ عَبْدِ الْمَلِكِ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ، قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ وَمَنْ نَذَرَ أَنْ يَعْصِيَ اللَّهَ فَلاَ يَعْصِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 47,
        "matchingEnglishURN": 1038210,
        "last_updated": null
    },
    {
        "arabicURN": 1138220,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "28.00",
        "hadithNumber": "3808",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب النَّذْرِ فِي الْمَعْصِيَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا ابْنُ إِدْرِيسَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ طَلْحَةَ بْنِ عَبْدِ الْمَلِكِ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ، قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ وَمَنْ نَذَرَ أَنْ يَعْصِيَ اللَّهَ فَلاَ يَعْصِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 48,
        "matchingEnglishURN": 1038220,
        "last_updated": null
    },
    {
        "arabicURN": 1138230,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "29.00",
        "hadithNumber": "3809",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الْوَفَاءِ بِالنَّذْرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي جَمْرَةَ، عَنْ زَهْدَمٍ، قَالَ سَمِعْتُ عِمْرَانَ بْنَ حُصَيْنٍ، يَذْكُرُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ خَيْرُكُمْ قَرْنِي ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ‏\"‏ ‏.‏ فَلاَ أَدْرِي أَذَكَرَ مَرَّتَيْنِ بَعْدَهُ أَوْ ثَلاَثًا ثُمَّ ذَكَرَ قَوْمًا يَخُونُونَ وَلاَ يُؤْتَمَنُونَ وَيَشْهَدُونَ وَلاَ يُسْتَشْهَدُونَ وَيُنْذِرُونَ وَلاَ يُوفُونَ وَيَظْهَرُ فِيهِمُ السِّمَنُ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا نَصْرُ بْنُ عِمْرَانَ أَبُو جَمْرَةَ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 49,
        "matchingEnglishURN": 1038230,
        "last_updated": null
    },
    {
        "arabicURN": 1138240,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "30.00",
        "hadithNumber": "3810",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب النَّذْرِ فِيمَا لاَ يُرَادُ بِهِ وَجْهُ اللَّهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ حَدَّثَنِي سُلَيْمَانُ الأَحْوَلُ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِرَجُلٍ يَقُودُ رَجُلاً فِي قَرَنٍ فَتَنَاوَلَهُ النَّبِيُّ صلى الله عليه وسلم فَقَطَعَهُ قَالَ إِنَّهُ نَذْرٌ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 50,
        "matchingEnglishURN": 1038240,
        "last_updated": null
    },
    {
        "arabicURN": 1138250,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "30.00",
        "hadithNumber": "3811",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب النَّذْرِ فِيمَا لاَ يُرَادُ بِهِ وَجْهُ اللَّهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حَجَّاجٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي سُلَيْمَانُ الأَحْوَلُ، أَنَّ طَاوُسًا، أَخْبَرَهُ عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم مَرَّ بِرَجُلٍ وَهُوَ يَطُوفُ بِالْكَعْبَةِ يَقُودُهُ إِنْسَانٌ بِخِزَامَةٍ فِي أَنْفِهِ فَقَطَعَهُ النَّبِيُّ صلى الله عليه وسلم بِيَدِهِ ثُمَّ أَمَرَهُ أَنْ يَقُودَهُ بِيَدِهِ ‏.‏ قَالَ ابْنُ جُرَيْجٍ وَأَخْبَرَنِي سُلَيْمَانُ أَنَّ طَاوُسًا أَخْبَرَهُ عَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صلى الله عليه وسلم مَرَّ بِهِ وَهُوَ يَطُوفُ بِالْكَعْبَةِ وَإِنْسَانٌ قَدْ رَبَطَ يَدَهُ بِإِنْسَانٍ آخَرَ بِسَيْرٍ أَوْ خَيْطٍ أَوْ بِشَىْءٍ غَيْرِ ذَلِكَ فَقَطَعَهُ النَّبِيُّ صلى الله عليه وسلم بِيَدِهِ ثُمَّ قَالَ ‏\"‏ قُدْهُ بِيَدِكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 51,
        "matchingEnglishURN": 1038250,
        "last_updated": null
    },
    {
        "arabicURN": 1138260,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "31.00",
        "hadithNumber": "3812",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب النَّذْرِ فِيمَا لاَ يَمْلِكُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي أَيُّوبُ، قَالَ حَدَّثَنَا أَبُو قِلاَبَةَ، عَنْ عَمِّهِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ نَذْرَ فِي مَعْصِيَةِ اللَّهِ وَلاَ فِيمَا لاَ يَمْلِكُ ابْنُ آدَمَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 52,
        "matchingEnglishURN": 1038260,
        "last_updated": null
    },
    {
        "arabicURN": 1138270,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "31.00",
        "hadithNumber": "3813",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب النَّذْرِ فِيمَا لاَ يَمْلِكُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا أَبُو الْمُغِيرَةِ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي يَحْيَى، عَنْ أَبِي قِلاَبَةَ، عَنْ ثَابِتِ بْنِ الضَّحَّاكِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ بِمِلَّةٍ سِوَى مِلَّةِ الإِسْلاَمِ كَاذِبًا فَهُوَ كَمَا قَالَ وَمَنْ قَتَلَ نَفْسَهُ بِشَىْءٍ فِي الدُّنْيَا عُذِّبَ بِهِ يَوْمَ الْقِيَامَةِ وَلَيْسَ عَلَى رَجُلٍ نَذْرٌ فِيمَا لاَ يَمْلِكُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 53,
        "matchingEnglishURN": 1038270,
        "last_updated": null
    },
    {
        "arabicURN": 1138280,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "32.00",
        "hadithNumber": "3814",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب مَنْ نَذَرَ أَنْ يَمْشِيَ إِلَى بَيْتِ اللَّهِ تَعَالَى ‏‏ ",
        "hadithText": "أَخْبَرَنِي يُوسُفُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حَجَّاجٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، أَخْبَرَهُ أَنَّ أَبَا الْخَيْرِ حَدَّثَهُ عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ نَذَرَتْ أُخْتِي أَنْ تَمْشِيَ، إِلَى بَيْتِ اللَّهِ فَأَمَرَتْنِي أَنْ أَسْتَفْتِيَ لَهَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَاسْتَفْتَيْتُ لَهَا النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ لِتَمْشِ وَلْتَرْكَبْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 54,
        "matchingEnglishURN": 1038280,
        "last_updated": null
    },
    {
        "arabicURN": 1138290,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "33.00",
        "hadithNumber": "3815",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب إِذَا حَلَفَتِ الْمَرْأَةُ لِتَمْشِي حَافِيَةً غَيْرَ مُخْتَمِرَةٍ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ زَحْرٍ، - وَقَالَ عَمْرٌو إِنَّ عُبَيْدَ اللَّهِ بْنَ زَحْرٍ أَخْبَرَهُ - عَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ، أَنَّ عُقْبَةَ بْنَ عَامِرٍ، أَخْبَرَهُ أَنَّهُ، سَأَلَ النَّبِيَّ صلى الله عليه وسلم عَنْ أُخْتٍ لَهُ نَذَرَتْ أَنْ تَمْشِيَ حَافِيَةً غَيْرَ مُخْتَمِرَةٍ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مُرْهَا فَلْتَخْتَمِرْ وَلْتَرْكَبْ وَلْتَصُمْ ثَلاَثَةَ أَيَّامٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 55,
        "matchingEnglishURN": 1038290,
        "last_updated": null
    },
    {
        "arabicURN": 1138300,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "34.00",
        "hadithNumber": "3816",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب مَنْ نَذَرَ أَنْ يَصُومَ ثُمَّ مَاتَ قَبْلَ أَنْ يَصُومَ ‏‏ ",
        "hadithText": "أَخْبَرَنَا بِشْرُ بْنُ خَالِدٍ الْعَسْكَرِيُّ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، قَالَ سَمِعْتُ سُلَيْمَانَ، يُحَدِّثُ عَنْ مُسْلِمٍ الْبَطِينِ، عَنِ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ رَكِبَتِ امْرَأَةٌ الْبَحْرَ فَنَذَرَتْ أَنْ تَصُومَ شَهْرًا فَمَاتَتْ قَبْلَ أَنْ تَصُومَ فَأَتَتْ أُخْتُهَا النَّبِيَّ صلى الله عليه وسلم وَذَكَرَتْ ذَلِكَ لَهُ فَأَمَرَهَا أَنْ تَصُومَ عَنْهَا ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 56,
        "matchingEnglishURN": 1038300,
        "last_updated": null
    },
    {
        "arabicURN": 1138310,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "35.00",
        "hadithNumber": "3817",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب مَنْ مَاتَ وَعَلَيْهِ نَذْرٌ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - عَنْ سُفْيَانَ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ سَعْدَ بْنَ عُبَادَةَ، اسْتَفْتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فِي نَذْرٍ كَانَ عَلَى أُمِّهِ تُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ فَقَالَ ‏\"‏ اقْضِهِ عَنْهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 57,
        "matchingEnglishURN": 1038310,
        "last_updated": null
    },
    {
        "arabicURN": 1138320,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "35.00",
        "hadithNumber": "3818",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب مَنْ مَاتَ وَعَلَيْهِ نَذْرٌ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ اسْتَفْتَى سَعْدُ بْنُ عُبَادَةَ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي نَذْرٍ كَانَ عَلَى أُمِّهِ فَتُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اقْضِهِ عَنْهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 58,
        "matchingEnglishURN": 1038320,
        "last_updated": null
    },
    {
        "arabicURN": 1138330,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "35.00",
        "hadithNumber": "3819",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب مَنْ مَاتَ وَعَلَيْهِ نَذْرٌ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ آدَمَ، وَهَارُونُ بْنُ إِسْحَاقَ الْهَمْدَانِيُّ، عَنْ عَبْدَةَ، عَنْ هِشَامٍ، - وَهُوَ ابْنُ عُرْوَةَ - عَنْ بَكْرِ بْنِ وَائِلٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ جَاءَ سَعْدُ بْنُ عُبَادَةَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنَّ أُمِّي مَاتَتْ وَعَلَيْهَا نَذْرٌ فَلَمْ تَقْضِهِ ‏.‏ قَالَ ‏\"‏ اقْضِهِ عَنْهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 59,
        "matchingEnglishURN": 1038330,
        "last_updated": null
    },
    {
        "arabicURN": 1138340,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "36.00",
        "hadithNumber": "3820",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب إِذَا نَذَرَ ثُمَّ أَسْلَمَ قَبْلَ أَنْ يَفِيَ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ مُوسَى، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ، أَنَّهُ كَانَ عَلَيْهِ لَيْلَةٌ نَذَرَ فِي الْجَاهِلِيَّةِ يَعْتَكِفُهَا فَسَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَمَرَهُ أَنْ يَعْتَكِفَ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 60,
        "matchingEnglishURN": 1038340,
        "last_updated": null
    },
    {
        "arabicURN": 1138350,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "36.00",
        "hadithNumber": "3821",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب إِذَا نَذَرَ ثُمَّ أَسْلَمَ قَبْلَ أَنْ يَفِيَ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ عَلَى عُمَرَ نَذْرٌ فِي اعْتِكَافِ لَيْلَةٍ فِي الْمَسْجِدِ الْحَرَامِ فَسَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَأَمَرَهُ أَنْ يَعْتَكِفَ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 61,
        "matchingEnglishURN": 1038350,
        "last_updated": null
    },
    {
        "arabicURN": 1138360,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "36.00",
        "hadithNumber": "3822",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب إِذَا نَذَرَ ثُمَّ أَسْلَمَ قَبْلَ أَنْ يَفِيَ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ عُبَيْدَ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ، كَانَ جَعَلَ عَلَيْهِ يَوْمًا يَعْتَكِفُهُ فِي الْجَاهِلِيَّةِ فَسَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَأَمَرَهُ أَنْ يَعْتَكِفَهُ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 62,
        "matchingEnglishURN": 1038360,
        "last_updated": null
    },
    {
        "arabicURN": 1138370,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "36.00",
        "hadithNumber": "3823",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب إِذَا نَذَرَ ثُمَّ أَسْلَمَ قَبْلَ أَنْ يَفِيَ ‏‏ ",
        "hadithText": "حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم حِينَ تِيبَ عَلَيْهِ يَا رَسُولَ اللَّهِ إِنِّي أَنْخَلِعُ مِنْ مَالِي صَدَقَةً إِلَى اللَّهِ وَرَسُولِهِ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمْسِكْ عَلَيْكَ بَعْضَ مَالِكَ فَهُوَ خَيْرٌ لَكَ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ يُشْبِهُ أَنْ يَكُونَ الزُّهْرِيُّ سَمِعَ هَذَا الْحَدِيثَ مِنْ عَبْدِ اللَّهِ بْنِ كَعْبٍ وَمِنْ عَبْدِ الرَّحْمَنِ عَنْهُ فِي هَذَا الْحَدِيثِ الطَّوِيلِ تَوْبَةُ كَعْبٍ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 63,
        "matchingEnglishURN": 1038370,
        "last_updated": null
    },
    {
        "arabicURN": 1138380,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "37.00",
        "hadithNumber": "3824",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب إِذَا أَهْدَى مَالَهُ عَلَى وَجْهِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، قَالَ قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ كَعْبِ بْنِ مَالِكٍ، أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبٍ، قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ، يُحَدِّثُ حَدِيثَهُ حِينَ تَخَلَّفَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ قَالَ فَلَمَّا جَلَسْتُ بَيْنَ يَدَيْهِ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ مِنْ تَوْبَتِي أَنْ أَنْخَلِعَ مِنْ مَالِي صَدَقَةً إِلَى اللَّهِ وَإِلَى رَسُولِهِ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمْسِكْ عَلَيْكَ بَعْضَ مَالِكَ فَهُوَ خَيْرٌ لَكَ ‏\"‏ ‏.‏ فَقُلْتُ فَإِنِّي أُمْسِكُ سَهْمِي الَّذِي بِخَيْبَرَ ‏.‏ مُخْتَصَرٌ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 64,
        "matchingEnglishURN": 1038380,
        "last_updated": null
    },
    {
        "arabicURN": 1138390,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "37.00",
        "hadithNumber": "3825",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب إِذَا أَهْدَى مَالَهُ عَلَى وَجْهِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبٍ، أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبِ بْنِ مَالِكٍ، قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ، يُحَدِّثُ حَدِيثَهُ حِينَ تَخَلَّفَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ مِنْ تَوْبَتِي أَنْ أَنْخَلِعَ مِنْ مَالِي صَدَقَةً إِلَى اللَّهِ وَإِلَى رَسُولِهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمْسِكْ عَلَيْكَ مَالَكَ فَهُوَ خَيْرٌ لَكَ ‏\"‏ ‏.‏ قُلْتُ فَإِنِّي أُمْسِكُ عَلَىَّ سَهْمِي الَّذِي بِخَيْبَرَ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 65,
        "matchingEnglishURN": 1038390,
        "last_updated": null
    },
    {
        "arabicURN": 1138400,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "37.00",
        "hadithNumber": "3826",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب إِذَا أَهْدَى مَالَهُ عَلَى وَجْهِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْدَانَ بْنِ عِيسَى، قَالَ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، قَالَ حَدَّثَنَا مَعْقِلٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبٍ، عَنْ عَمِّهِ، عُبَيْدِ اللَّهِ بْنِ كَعْبٍ قَالَ سَمِعْتُ أَبِي كَعْبَ بْنَ مَالِكٍ، يُحَدِّثُ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ عَزَّ وَجَلَّ إِنَّمَا نَجَّانِي بِالصِّدْقِ وَإِنَّ مِنْ تَوْبَتِي أَنْ أَنْخَلِعَ مِنْ مَالِي صَدَقَةً إِلَى اللَّهِ وَإِلَى رَسُولِهِ ‏.‏ فَقَالَ ‏\"‏ أَمْسِكْ عَلَيْكَ بَعْضَ مَالِكَ فَهُوَ خَيْرٌ لَكَ ‏\"‏ ‏.‏ قُلْتُ فَإِنِّي أُمْسِكُ سَهْمِي الَّذِي بِخَيْبَرَ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 66,
        "matchingEnglishURN": 1038400,
        "last_updated": null
    },
    {
        "arabicURN": 1138410,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "38.00",
        "hadithNumber": "3827",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب هَلْ تَدْخُلُ الأَرَضُونَ فِي الْمَالِ إِذَا نَذَرَ ‏.‏ ",
        "hadithText": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ ثَوْرِ بْنِ زَيْدٍ، عَنْ أَبِي الْغَيْثِ، مَوْلَى ابْنِ مُطِيعٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ خَيْبَرَ فَلَمْ نَغْنَمْ إِلاَّ الأَمْوَالَ وَالْمَتَاعَ وَالثِّيَابَ فَأَهْدَى رَجُلٌ مِنْ بَنِي الضُّبَيْبِ يُقَالُ لَهُ رِفَاعَةُ بْنُ زَيْدٍ لِرَسُولِ اللَّهِ صلى الله عليه وسلم غُلاَمًا أَسْوَدَ يُقَالُ لَهُ مِدْعَمٌ فَوُجِّهَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى وَادِي الْقُرَى حَتَّى إِذَا كُنَّا بِوَادِي الْقُرَى بَيْنَا مِدْعَمٌ يَحُطُّ رَحْلَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَجَاءَهُ سَهْمٌ فَأَصَابَهُ فَقَتَلَهُ فَقَالَ النَّاسُ هَنِيئًا لَكَ الْجَنَّةُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَلاَّ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّ الشَّمْلَةَ الَّتِي أَخَذَهَا يَوْمَ خَيْبَرَ مِنَ الْمَغَانِمِ لَتَشْتَعِلُ عَلَيْهِ نَارًا ‏\"‏ ‏.‏ فَلَمَّا سَمِعَ النَّاسُ بِذَلِكَ جَاءَ رَجُلٌ بِشِرَاكٍ أَوْ بِشِرَاكَيْنِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ شِرَاكٌ أَوْ شِرَاكَانِ مِنْ نَارٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 67,
        "matchingEnglishURN": 1038410,
        "last_updated": null
    },
    {
        "arabicURN": 1138420,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "39.00",
        "hadithNumber": "3828",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الاِسْتِثْنَاءِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، أَنَّ كَثِيرَ بْنَ فَرْقَدٍ، حَدَّثَهُ أَنَّ نَافِعًا حَدَّثَهُمْ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ فَقَالَ إِنْ شَاءَ اللَّهُ فَقَدِ اسْتَثْنَى ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 68,
        "matchingEnglishURN": 1038420,
        "last_updated": null
    },
    {
        "arabicURN": 1138430,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "39.00",
        "hadithNumber": "3829",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الاِسْتِثْنَاءِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ فَقَالَ إِنْ شَاءَ اللَّهُ فَقَدِ اسْتَثْنَى ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 69,
        "matchingEnglishURN": 1038430,
        "last_updated": null
    },
    {
        "arabicURN": 1138440,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "39.00",
        "hadithNumber": "3830",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الاِسْتِثْنَاءِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا عَفَّانُ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ حَلَفَ عَلَى يَمِينٍ فَقَالَ إِنْ شَاءَ اللَّهُ فَهُوَ بِالْخِيَارِ إِنْ شَاءَ أَمْضَى وَإِنْ شَاءَ تَرَكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 70,
        "matchingEnglishURN": 1038440,
        "last_updated": null
    },
    {
        "arabicURN": 1138450,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "40.00",
        "hadithNumber": "3831",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب إِذَا حَلَفَ فَقَالَ لَهُ رَجُلٌ إِنْ شَاءَ اللَّهُ هَلْ لَهُ اسْتِثْنَاءٌ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا عِمْرَانُ بْنُ بَكَّارٍ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ، قَالَ أَنْبَأَنَا شُعَيْبٌ، قَالَ حَدَّثَنِي أَبُو الزِّنَادِ، مِمَّا حَدَّثَهُ عَبْدُ الرَّحْمَنِ الأَعْرَجُ، مِمَّا ذَكَرَ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يُحَدِّثُ بِهِ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ قَالَ سُلَيْمَانُ بْنُ دَاوُدَ لأَطُوفَنَّ اللَّيْلَةَ عَلَى تِسْعِينَ امْرَأَةً كُلُّهُنَّ يَأْتِي بِفَارِسٍ يُجَاهِدُ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ فَقَالَ لَهُ صَاحِبُهُ إِنْ شَاءَ اللَّهُ ‏.‏ فَلَمْ يَقُلْ إِنْ شَاءَ اللَّهُ فَطَافَ عَلَيْهِنَّ جَمِيعًا فَلَمْ تَحْمِلْ مِنْهُنَّ إِلاَّ امْرَأَةٌ وَاحِدَةٌ جَاءَتْ بِشِقِّ رَجُلٍ وَايْمُ الَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَوْ قَالَ إِنْ شَاءَ اللَّهُ لَجَاهَدُوا فِي سَبِيلِ اللَّهِ فُرْسَانًا أَجْمَعِينَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 71,
        "matchingEnglishURN": 1038450,
        "last_updated": null
    },
    {
        "arabicURN": 1138460,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "41.00",
        "hadithNumber": "3832",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب كَفَّارَةِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ يَحْيَى بْنِ الْوَزِيرِ بْنِ سُلَيْمَانَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ كَعْبِ بْنِ عَلْقَمَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ شِمَاسَةَ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ كَفَّارَةُ النَّذْرِ كَفَّارَةُ الْيَمِينِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 72,
        "matchingEnglishURN": 1038460,
        "last_updated": null
    },
    {
        "arabicURN": 1138470,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "41.00",
        "hadithNumber": "3833",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب كَفَّارَةِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، عَنِ الزُّهْرِيِّ، أَنَّهُ بَلَغَهُ عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ نَذْرَ فِي مَعْصِيَةٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 73,
        "matchingEnglishURN": 1038470,
        "last_updated": null
    },
    {
        "arabicURN": 1138480,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "41.00",
        "hadithNumber": "3834",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب كَفَّارَةِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 74,
        "matchingEnglishURN": 1038480,
        "last_updated": null
    },
    {
        "arabicURN": 1138490,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "41.00",
        "hadithNumber": "3835",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب كَفَّارَةِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ الْمُخَرِّمِيُّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، قَالَ حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 75,
        "matchingEnglishURN": 1038490,
        "last_updated": null
    },
    {
        "arabicURN": 1138500,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "41.00",
        "hadithNumber": "3836",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب كَفَّارَةِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ أَنْبَأَنَا عُثْمَانُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 76,
        "matchingEnglishURN": 1038500,
        "last_updated": null
    },
    {
        "arabicURN": 1138510,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "41.00",
        "hadithNumber": "3837",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب كَفَّارَةِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو صَفْوَانَ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ وَقَدْ قِيلَ إِنَّ الزُّهْرِيَّ لَمْ يَسْمَعْ هَذَا مِنْ أَبِي سَلَمَةَ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 77,
        "matchingEnglishURN": 1038510,
        "last_updated": null
    },
    {
        "arabicURN": 1138520,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "41.00",
        "hadithNumber": "3838",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب كَفَّارَةِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا هَارُونُ بْنُ مُوسَى الْفَرْوِيُّ، قَالَ حَدَّثَنَا أَبُو ضَمْرَةَ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنَا أَبُو سَلَمَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهَا كَفَّارَةُ الْيَمِينِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 78,
        "matchingEnglishURN": 1038520,
        "last_updated": null
    },
    {
        "arabicURN": 1138530,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "41.00",
        "hadithNumber": "3839",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب كَفَّارَةِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ التِّرْمِذِيُّ، قَالَ حَدَّثَنَا أَيُّوبُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي أُوَيْسٍ، قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ مُحَمَّدِ بْنِ أَبِي عَتِيقٍ، وَمُوسَى بْنِ عُقْبَةَ، عَنِ ابْنِ شِهَابٍ، عَنْ سُلَيْمَانَ بْنِ أَرْقَمَ، أَنَّ يَحْيَى بْنَ أَبِي كَثِيرٍ الَّذِي، كَانَ يَسْكُنُ الْيَمَامَةَ حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا سَلَمَةَ، يُخْبِرُ عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهَا كَفَّارَةُ يَمِينٍ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ سُلَيْمَانُ بْنُ أَرْقَمَ مَتْرُوكُ الْحَدِيثِ وَاللَّهُ أَعْلَمُ ‏.‏ خَالَفَهُ غَيْرُ وَاحِدٍ مِنْ أَصْحَابِ يَحْيَى بْنِ أَبِي كَثِيرٍ فِي هَذَا الْحَدِيثِ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 79,
        "matchingEnglishURN": 1038530,
        "last_updated": null
    },
    {
        "arabicURN": 1138540,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "41.00",
        "hadithNumber": "3840",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب كَفَّارَةِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنْ وَكِيعٍ، عَنِ ابْنِ الْمُبَارَكِ، - وَهُوَ عَلِيٌّ - عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ مُحَمَّدِ بْنِ الزُّبَيْرِ الْحَنْظَلِيِّ، عَنْ أَبِيهِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 80,
        "matchingEnglishURN": 1038540,
        "last_updated": null
    },
    {
        "arabicURN": 1138550,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "41.00",
        "hadithNumber": "3841",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب كَفَّارَةِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ، قَالَ حَدَّثَنَا بَقِيَّةُ، عَنْ أَبِي عَمْرٍو، - وَهُوَ الأَوْزَاعِيُّ - عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ مُحَمَّدِ بْنِ الزُّبَيْرِ الْحَنْظَلِيِّ، عَنْ أَبِيهِ، عَنِ عِمْرَانَ بْنِ حُصَيْنٍ، رضى الله عنهما قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهَا كَفَّارَةُ يَمِينٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 81,
        "matchingEnglishURN": 1038550,
        "last_updated": null
    },
    {
        "arabicURN": 1138560,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "41.00",
        "hadithNumber": "3842",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب كَفَّارَةِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ مَيْمُونٍ، قَالَ حَدَّثَنَا مَعْمَرُ بْنُ سُلَيْمَانَ، عَنْ عَبْدِ اللَّهِ بْنِ بِشْرٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ مُحَمَّدٍ الْحَنْظَلِيِّ، عَنْ أَبِيهِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ نَذْرَ فِي غَضَبٍ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ مُحَمَّدُ بْنُ الزُّبَيْرِ ضَعِيفٌ لاَ يَقُومُ بِمِثْلِهِ حُجَّةٌ ‏.‏ وَقَدِ اخْتُلِفَ عَلَيْهِ فِي هَذَا الْحَدِيثِ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 82,
        "matchingEnglishURN": 1038560,
        "last_updated": null
    },
    {
        "arabicURN": 1138570,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "41.00",
        "hadithNumber": "3843",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب كَفَّارَةِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ، قَالَ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، قَالَ حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ مُحَمَّدِ بْنِ الزُّبَيْرِ، عَنْ أَبِيهِ، عَنْ عِمْرَانَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ نَذْرَ فِي غَضَبٍ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 83,
        "matchingEnglishURN": 1038570,
        "last_updated": null
    },
    {
        "arabicURN": 1138580,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "41.00",
        "hadithNumber": "3844",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب كَفَّارَةِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، أَنْبَأَنَا حَمَّادٌ، عَنْ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ عِمْرَانَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ نَذْرَ فِي غَضَبٍ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِ ‏\"‏ ‏.‏ وَقِيلَ إِنَّ الزُّبَيْرَ لَمْ يَسْمَعْ هَذَا الْحَدِيثَ مِنْ عِمْرَانَ بْنِ حُصَيْنٍ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 84,
        "matchingEnglishURN": 1038580,
        "last_updated": null
    },
    {
        "arabicURN": 1138590,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "41.00",
        "hadithNumber": "3845",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب كَفَّارَةِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنِي مُحَمَّدُ بْنُ وَهْبٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنِي ابْنُ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ الزُّبَيْرِ، عَنْ أَبِيهِ، عَنْ رَجُلٍ، مِنْ أَهْلِ الْبَصْرَةِ قَالَ صَحِبْتُ عِمْرَانَ بْنَ حُصَيْنٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ النَّذْرُ نَذْرَانِ فَمَا كَانَ مِنْ نَذْرٍ فِي طَاعَةِ اللَّهِ فَذَلِكَ لِلَّهِ وَفِيهِ الْوَفَاءُ وَمَا كَانَ مِنْ نَذْرٍ فِي مَعْصِيَةِ اللَّهِ فَذَلِكَ لِلشَّيْطَانِ وَلاَ وَفَاءَ فِيهِ وَيُكَفِّرُهُ مَا يُكَفِّرُ الْيَمِينَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 85,
        "matchingEnglishURN": 1038590,
        "last_updated": null
    },
    {
        "arabicURN": 1138600,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "41.00",
        "hadithNumber": "3846",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب كَفَّارَةِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ، قَالَ حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ مُحَمَّدِ بْنِ الزُّبَيْرِ الْحَنْظَلِيِّ، قَالَ أَخْبَرَنِي أَبِي أَنَّ رَجُلاً، حَدَّثَهُ أَنَّهُ، سَأَلَ عِمْرَانَ بْنَ حُصَيْنٍ عَنْ رَجُلٍ، نَذَرَ نَذْرًا لاَ يَشْهَدُ الصَّلاَةَ فِي مَسْجِدِ قَوْمِهِ فَقَالَ عِمْرَانُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ نَذْرَ فِي غَضَبٍ وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 86,
        "matchingEnglishURN": 1038600,
        "last_updated": null
    },
    {
        "arabicURN": 1138610,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "41.00",
        "hadithNumber": "3847",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب كَفَّارَةِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الزُّبَيْرِ، عَنِ الْحَسَنِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ نَذْرَ فِي مَعْصِيَةٍ وَلاَ غَضَبٍ وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 87,
        "matchingEnglishURN": 1038610,
        "last_updated": null
    },
    {
        "arabicURN": 1138620,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "41.00",
        "hadithNumber": "3848",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب كَفَّارَةِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا هِلاَلُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو سُلَيْمٍ، - وَهُوَ عُبَيْدُ بْنُ يَحْيَى - قَالَ حَدَّثَنَا أَبُو بَكْرٍ النَّهْشَلِيُّ، عَنْ مُحَمَّدِ بْنِ الزُّبَيْرِ، عَنِ الْحَسَنِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ نَذْرَ فِي الْمَعْصِيَةِ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِ ‏\"‏ ‏.‏ خَالَفَهُ مَنْصُورُ بْنُ زَاذَانَ فِي لَفْظِهِ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 88,
        "matchingEnglishURN": 1038620,
        "last_updated": null
    },
    {
        "arabicURN": 1138630,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "41.00",
        "hadithNumber": "3849",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب كَفَّارَةِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا هُشَيْمٌ، قَالَ أَنْبَأَنَا مَنْصُورٌ، عَنِ الْحَسَنِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ قَالَ يَعْنِي النَّبِيَّ صلى الله عليه وسلم ‏\"‏ لاَ نَذْرَ لاِبْنِ آدَمَ فِيمَا لاَ يَمْلِكُ وَلاَ فِي مَعْصِيَةِ اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏ خَالَفَهُ عَلِيُّ بْنُ زَيْدٍ فَرَوَاهُ عَنِ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 89,
        "matchingEnglishURN": 1038630,
        "last_updated": null
    },
    {
        "arabicURN": 1138640,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "41.00",
        "hadithNumber": "3850",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب كَفَّارَةِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنِي عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَلِيٍّ، قَالَ حَدَّثَنَا خَلَفُ بْنُ تَمِيمٍ، قَالَ حَدَّثَنَا زَائِدَةُ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ زَيْدِ بْنِ جُدْعَانَ، عَنِ الْحَسَنِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ نَذْرَ فِي مَعْصِيَةٍ وَلاَ فِيمَا لاَ يَمْلِكُ ابْنُ آدَمَ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ عَلِيُّ بْنُ زَيْدٍ ضَعِيفٌ وَهَذَا الْحَدِيثُ خَطَأٌ وَالصَّوَابُ عِمْرَانُ بْنُ حُصَيْنٍ ‏.‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ مِنْ وَجْهٍ آخَرَ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 90,
        "matchingEnglishURN": 1038640,
        "last_updated": null
    },
    {
        "arabicURN": 1138650,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "41.00",
        "hadithNumber": "3851",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب كَفَّارَةِ النَّذْرِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي أَيُّوبُ، قَالَ حَدَّثَنَا أَبُو قِلاَبَةَ، عَنْ عَمِّهِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ نَذْرَ فِي مَعْصِيَةٍ وَلاَ فِيمَا لاَ يَمْلِكُ ابْنُ آدَمَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 91,
        "matchingEnglishURN": 1038650,
        "last_updated": null
    },
    {
        "arabicURN": 1138660,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "42.00",
        "hadithNumber": "3852",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب مَا الْوَاجِبُ عَلَى مَنْ أَوْجَبَ عَلَى نَفْسِهِ نَذْرًا فَعَجَزَ عَنْهُ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا حَمَّادُ بْنُ مَسْعَدَةَ، عَنْ حُمَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ رَأَى النَّبِيُّ صلى الله عليه وسلم رَجُلاً يُهَادَى بَيْنَ رَجُلَيْنِ فَقَالَ ‏\"‏ مَا هَذَا ‏\"‏ ‏.‏ قَالُوا نَذَرَ أَنْ يَمْشِيَ إِلَى بَيْتِ اللَّهِ ‏.‏ قَالَ ‏\"‏ إِنَّ اللَّهَ غَنِيٌّ عَنْ تَعْذِيبِ هَذَا نَفْسَهُ مُرْهُ فَلْيَرْكَبْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 92,
        "matchingEnglishURN": 1038660,
        "last_updated": null
    },
    {
        "arabicURN": 1138670,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "42.00",
        "hadithNumber": "3853",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب مَا الْوَاجِبُ عَلَى مَنْ أَوْجَبَ عَلَى نَفْسِهِ نَذْرًا فَعَجَزَ عَنْهُ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا حُمَيْدٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ مَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِشَيْخٍ يُهَادَى بَيْنَ اثْنَيْنِ فَقَالَ ‏\"‏ مَا بَالُ هَذَا ‏\"‏ ‏.‏ قَالُوا نَذَرَ أَنْ يَمْشِيَ ‏.‏ قَالَ ‏\"‏ إِنَّ اللَّهَ غَنِيٌّ عَنْ تَعْذِيبِ هَذَا نَفْسَهُ مُرْهُ فَلْيَرْكَبْ ‏\"‏ ‏.‏ فَأَمَرَهُ أَنْ يَرْكَبَ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 93,
        "matchingEnglishURN": 1038670,
        "last_updated": null
    },
    {
        "arabicURN": 1138680,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "42.00",
        "hadithNumber": "3854",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب مَا الْوَاجِبُ عَلَى مَنْ أَوْجَبَ عَلَى نَفْسِهِ نَذْرًا فَعَجَزَ عَنْهُ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ أَتَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى رَجُلٍ يُهَادَى بَيْنَ ابْنَيْهِ فَقَالَ ‏\"‏ مَا شَأْنُ هَذَا ‏\"‏ ‏.‏ فَقِيلَ نَذَرَ أَنْ يَمْشِيَ إِلَى الْكَعْبَةِ ‏.‏ فَقَالَ ‏\"‏ إِنَّ اللَّهَ لاَ يَصْنَعُ بِتَعْذِيبِ هَذَا نَفْسَهُ شَيْئًا ‏\"‏ ‏.‏ فَأَمَرَهُ أَنْ يَرْكَبَ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 94,
        "matchingEnglishURN": 1038680,
        "last_updated": null
    },
    {
        "arabicURN": 1138690,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "43.00",
        "hadithNumber": "3855",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الاِسْتِثْنَاءِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا نُوحُ بْنُ حَبِيبٍ، قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ عَلَى يَمِينٍ فَقَالَ إِنْ شَاءَ اللَّهُ فَقَدِ اسْتَثْنَى ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 95,
        "matchingEnglishURN": 1038690,
        "last_updated": null
    },
    {
        "arabicURN": 1138700,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 35,
        "babNumber": "43.00",
        "hadithNumber": "3856",
        "bookName": " كتاب الأيمان والنذور",
        "babName": " باب الاِسْتِثْنَاءِ ‏.‏ ",
        "hadithText": "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، رَفَعَهُ ‏\"‏ قَالَ سُلَيْمَانُ لأَطُوفَنَّ اللَّيْلَةَ عَلَى تِسْعِينَ امْرَأَةً تَلِدُ كُلُّ امْرَأَةٍ مِنْهُنَّ غُلاَمًا يُقَاتِلُ فِي سَبِيلِ اللَّهِ فَقِيلَ لَهُ قُلْ إِنْ شَاءَ اللَّهُ ‏.‏ فَلَمْ يَقُلْ فَطَافَ بِهِنَّ فَلَمْ تَلِدْ مِنْهُنَّ إِلاَّ امْرَأَةٌ وَاحِدَةٌ نِصْفَ إِنْسَانٍ ‏\"‏ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ قَالَ إِنْ شَاءَ اللَّهُ لَمْ يَحْنَثْ وَكَانَ دَرَكًا لِحَاجَتِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "35.0",
        "grade1": null,
        "ourHadithNumber": 96,
        "matchingEnglishURN": 1038700,
        "last_updated": null
    }
]