[
    {
        "arabicURN": 1144640,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "1.00",
        "hadithNumber": "4449",
        "bookName": " كتاب البيوع",
        "babName": " باب الْحَثِّ عَلَى الْكَسْبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ أَبُو قُدَامَةَ السَّرَخْسِيُّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ عَمَّتِهِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ أَطْيَبَ مَا أَكَلَ الرَّجُلُ مِنْ كَسْبِهِ وَإِنَّ وَلَدَ الرَّجُلِ مِنْ كَسْبِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 1,
        "matchingEnglishURN": 1084905,
        "last_updated": null
    },
    {
        "arabicURN": 1144650,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "1.00",
        "hadithNumber": "4450",
        "bookName": " كتاب البيوع",
        "babName": " باب الْحَثِّ عَلَى الْكَسْبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ عَمَّةٍ، لَهُ عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم ‏\"‏ قَالَ إِنَّ أَوْلاَدَكُمْ مِنْ أَطْيَبِ كَسْبِكُمْ فَكُلُوا مِنْ كَسْبِ أَوْلاَدِكُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 2,
        "matchingEnglishURN": 1084910,
        "last_updated": null
    },
    {
        "arabicURN": 1144660,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "1.00",
        "hadithNumber": "4451",
        "bookName": " كتاب البيوع",
        "babName": " باب الْحَثِّ عَلَى الْكَسْبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا يُوسُفُ بْنُ عِيسَى، قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى، قَالَ أَنْبَأَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ أَطْيَبَ مَا أَكَلَ الرَّجُلُ مِنْ كَسْبِهِ وَوَلَدُهُ مِنْ كَسْبِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 3,
        "matchingEnglishURN": 1084915,
        "last_updated": null
    },
    {
        "arabicURN": 1144670,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "1.00",
        "hadithNumber": "4452",
        "bookName": " كتاب البيوع",
        "babName": " باب الْحَثِّ عَلَى الْكَسْبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ النَّيْسَابُورِيُّ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ، عَنْ عُمَرَ بْنِ سَعِيدٍ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ أَطْيَبَ مَا أَكَلَ الرَّجُلُ مِنْ كَسْبِهِ وَإِنَّ وَلَدَهُ مِنْ كَسْبِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 4,
        "matchingEnglishURN": 1084920,
        "last_updated": null
    },
    {
        "arabicURN": 1144680,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "2.00",
        "hadithNumber": "4453",
        "bookName": " كتاب البيوع",
        "babName": " باب اجْتِنَابِ الشُّبُهَاتِ فِي الْكَسْبِ ‏‏ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى الصَّنْعَانِيُّ، قَالَ حَدَّثَنَا خَالِدٌ، - وَهُوَ ابْنُ الْحَارِثِ - قَالَ حَدَّثَنَا ابْنُ عَوْنٍ، عَنِ الشَّعْبِيِّ، قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم - فَوَاللَّهِ لاَ أَسْمَعُ بَعْدَهُ أَحَدًا يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم - يَقُولُ ‏\"‏ إِنَّ الْحَلاَلَ بَيِّنٌ وَإِنَّ الْحَرَامَ بَيِّنٌ وَإِنَّ بَيْنَ ذَلِكَ أُمُورًا مُشْتَبِهَاتٍ ‏\"‏ ‏.‏ وَرُبَّمَا قَالَ ‏\"‏ وَإِنَّ بَيْنَ ذَلِكَ أُمُورًا مُشْتَبِهَةً ‏\"‏ ‏.‏ قَالَ ‏\"‏ وَسَأَضْرِبُ لَكُمْ فِي ذَلِكَ مَثَلاً إِنَّ اللَّهَ عَزَّ وَجَلَّ حَمَى حِمًى وَإِنَّ حِمَى اللَّهِ عَزَّ وَجَلَّ مَا حَرَّمَ وَإِنَّهُ مَنْ يَرْتَعْ حَوْلَ الْحِمَى يُوشِكْ أَنْ يُخَالِطَ الْحِمَى ‏\"‏ ‏.‏ وَرُبَّمَا قَالَ ‏\"‏ إِنَّهُ مَنْ يَرْعَى حَوْلَ الْحِمَى يُوشِكْ أَنْ يَرْتَعَ فِيهِ وَإِنَّ مَنْ يُخَالِطِ الرِّيبَةَ يُوشِكْ أَنْ يَجْسُرَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 5,
        "matchingEnglishURN": 1084925,
        "last_updated": null
    },
    {
        "arabicURN": 1144690,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "2.00",
        "hadithNumber": "4454",
        "bookName": " كتاب البيوع",
        "babName": " باب اجْتِنَابِ الشُّبُهَاتِ فِي الْكَسْبِ ‏‏ ",
        "hadithText": "حَدَّثَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ، عَنْ سُفْيَانَ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَأْتِي عَلَى النَّاسِ زَمَانٌ مَا يُبَالِي الرَّجُلُ مِنْ أَيْنَ أَصَابَ الْمَالَ مِنْ حَلاَلٍ أَوْ حَرَامٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 6,
        "matchingEnglishURN": 1084930,
        "last_updated": null
    },
    {
        "arabicURN": 1144700,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "2.00",
        "hadithNumber": "4455",
        "bookName": " كتاب البيوع",
        "babName": " باب اجْتِنَابِ الشُّبُهَاتِ فِي الْكَسْبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ، عَنْ سَعِيدِ بْنِ أَبِي خَيْرَةَ، عَنِ الْحَسَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَأْتِي عَلَى النَّاسِ زَمَانٌ يَأْكُلُونَ الرِّبَا فَمَنْ لَمْ يَأْكُلْهُ أَصَابَهُ مِنْ غُبَارِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 7,
        "matchingEnglishURN": 1084935,
        "last_updated": null
    },
    {
        "arabicURN": 1144710,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "3.00",
        "hadithNumber": "4456",
        "bookName": " كتاب البيوع",
        "babName": " باب التِّجَارَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ أَنْبَأَنَا وَهْبُ بْنُ جَرِيرٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ يُونُسَ، عَنِ الْحَسَنِ، عَنْ عَمْرِو بْنِ تَغْلِبَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يَفْشُوَ الْمَالُ وَيَكْثُرَ وَتَفْشُوَ التِّجَارَةُ وَيَظْهَرَ الْعِلْمُ وَيَبِيعَ الرَّجُلُ الْبَيْعَ فَيَقُولَ لاَ حَتَّى أَسْتَأْمِرَ تَاجِرَ بَنِي فُلاَنٍ وَيُلْتَمَسَ فِي الْحَىِّ الْعَظِيمِ الْكَاتِبُ فَلاَ يُوجَدُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 8,
        "matchingEnglishURN": 1084940,
        "last_updated": null
    },
    {
        "arabicURN": 1144720,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "4.00",
        "hadithNumber": "4457",
        "bookName": " كتاب البيوع",
        "babName": " باب مَا يَجِبُ عَلَى التُّجَّارِ مِنَ التَّوْقِيَةِ فِي مُبَايَعَتِهِمْ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، عَنْ يَحْيَى، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي قَتَادَةُ، عَنْ أَبِي الْخَلِيلِ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، عَنْ حَكِيمِ بْنِ حِزَامٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَفْتَرِقَا فَإِنْ صَدَقَا وَبَيَّنَا بُورِكَ فِي بَيْعِهِمَا وَإِنْ كَذَبَا وَكَتَمَا مُحِقَ بَرَكَةُ بَيْعِهِمَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 9,
        "matchingEnglishURN": 1084945,
        "last_updated": null
    },
    {
        "arabicURN": 1144730,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "5.00",
        "hadithNumber": "4458",
        "bookName": " كتاب البيوع",
        "babName": " باب الْمُنْفِقِ سِلْعَتَهُ بِالْحَلِفِ الْكَاذِبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، عَنْ مُحَمَّدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَلِيِّ بْنِ مُدْرِكٍ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ خَرَشَةَ بْنِ الْحُرِّ، عَنْ أَبِي ذَرٍّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ ثَلاَثَةٌ لاَ يُكَلِّمُهُمُ اللَّهُ يَوْمَ الْقِيَامَةِ وَلاَ يَنْظُرُ إِلَيْهِمْ وَلاَ يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ ‏\"‏ ‏.‏ فَقَرَأَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ أَبُو ذَرٍّ خَابُوا وَخَسِرُوا ‏.‏ قَالَ ‏\"‏ الْمُسْبِلُ إِزَارَهُ وَالْمُنَفِّقُ سِلْعَتَهُ بِالْحَلِفِ الْكَاذِبِ وَالْمَنَّانُ عَطَاءَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 10,
        "matchingEnglishURN": 1084950,
        "last_updated": null
    },
    {
        "arabicURN": 1144740,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "5.00",
        "hadithNumber": "4459",
        "bookName": " كتاب البيوع",
        "babName": " باب الْمُنْفِقِ سِلْعَتَهُ بِالْحَلِفِ الْكَاذِبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي سُلَيْمَانُ الأَعْمَشُ، عَنْ سُلَيْمَانَ بْنِ مُسْهِرٍ، عَنْ خَرَشَةَ بْنِ الْحُرِّ، عَنْ أَبِي ذَرٍّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ ثَلاَثَةٌ لاَ يَنْظُرُ اللَّهُ إِلَيْهِمْ يَوْمَ الْقِيَامَةِ وَلاَ يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ الَّذِي لاَ يُعْطِي شَيْئًا إِلاَّ مَنَّهُ وَالْمُسْبِلُ إِزَارَهُ وَالْمُنَفِّقُ سِلْعَتَهُ بِالْكَذِبِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 11,
        "matchingEnglishURN": 1084955,
        "last_updated": null
    },
    {
        "arabicURN": 1144750,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "5.00",
        "hadithNumber": "4460",
        "bookName": " كتاب البيوع",
        "babName": " باب الْمُنْفِقِ سِلْعَتَهُ بِالْحَلِفِ الْكَاذِبِ ‏‏ ",
        "hadithText": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ أَخْبَرَنِي الْوَلِيدُ، - يَعْنِي ابْنَ كَثِيرٍ - عَنْ مَعْبَدِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِي قَتَادَةَ الأَنْصَارِيِّ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِيَّاكُمْ وَكَثْرَةَ الْحَلِفِ فِي الْبَيْعِ فَإِنَّهُ يُنَفِّقُ ثُمَّ يَمْحَقُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 12,
        "matchingEnglishURN": 1084960,
        "last_updated": null
    },
    {
        "arabicURN": 1144760,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "5.00",
        "hadithNumber": "4461",
        "bookName": " كتاب البيوع",
        "babName": " باب الْمُنْفِقِ سِلْعَتَهُ بِالْحَلِفِ الْكَاذِبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الْحَلِفُ مَنْفَقَةٌ لِلسِّلْعَةِ مَمْحَقَةٌ لِلْكَسْبِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 13,
        "matchingEnglishURN": 1084965,
        "last_updated": null
    },
    {
        "arabicURN": 1144770,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "6.00",
        "hadithNumber": "4462",
        "bookName": " كتاب البيوع",
        "babName": " باب الْحَلِفِ الْوَاجِبِ لِلْخَدِيعَةِ فِي الْبَيْعِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ ثَلاَثَةٌ لاَ يُكَلِّمُهُمُ اللَّهُ عَزَّ وَجَلَّ وَلاَ يَنْظُرُ إِلَيْهِمْ يَوْمَ الْقِيَامَةِ وَلاَ يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ رَجُلٌ عَلَى فَضْلِ مَاءٍ بِالطَّرِيقِ يَمْنَعُ ابْنَ السَّبِيلِ مِنْهُ وَرَجُلٌ بَايَعَ إِمَامًا لِدُنْيَا إِنْ أَعْطَاهُ مَا يُرِيدُ وَفَّى لَهُ وَإِنْ لَمْ يُعْطِهِ لَمْ يَفِ لَهُ وَرَجُلٌ سَاوَمَ رَجُلاً عَلَى سِلْعَةٍ بَعْدَ الْعَصْرِ فَحَلَفَ لَهُ بِاللَّهِ لَقَدْ أُعْطِيَ بِهَا كَذَا وَكَذَا فَصَدَّقَهُ الآخَرُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 14,
        "matchingEnglishURN": 1084970,
        "last_updated": null
    },
    {
        "arabicURN": 1144780,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "7.00",
        "hadithNumber": "4463",
        "bookName": " كتاب البيوع",
        "babName": " باب الأَمْرِ بِالصَّدَقَةِ لِمَنْ لَمْ يَعْتَقِدِ الْيَمِينَ بِقَلْبِهِ فِي حَالِ بَيْعِهِ ‏‏ ",
        "hadithText": "أَخْبَرَنِي مُحَمَّدُ بْنُ قُدَامَةَ، عَنْ جَرِيرٍ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ، قَالَ كُنَّا بِالْمَدِينَةِ نَبِيعُ الأَوْسَاقَ وَنَبْتَاعُهَا وَنُسَمِّي أَنْفُسَنَا السَّمَاسِرَةَ وَيُسَمِّينَا النَّاسُ فَخَرَجَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَمَّانَا بِاسْمٍ هُوَ خَيْرٌ لَنَا مِنَ الَّذِي سَمَّيْنَا بِهِ أَنْفُسَنَا فَقَالَ ‏\"‏ يَا مَعْشَرَ التُّجَّارِ إِنَّهُ يَشْهَدُ بَيْعَكُمُ الْحَلِفُ وَاللَّغْوُ فَشُوبُوهُ بِالصَّدَقَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 15,
        "matchingEnglishURN": 1084975,
        "last_updated": null
    },
    {
        "arabicURN": 1144790,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "8.00",
        "hadithNumber": "4464",
        "bookName": " كتاب البيوع",
        "babName": " باب وُجُوبِ الْخِيَارِ لِلْمُتَبَايِعَيْنِ قَبْلَ افْتِرَاقِهِمَا ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَبُو الأَشْعَثِ، عَنْ خَالِدٍ، قَالَ حَدَّثَنَا سَعِيدٌ، - وَهُوَ ابْنُ أَبِي عَرُوبَةَ - عَنْ قَتَادَةَ، عَنْ صَالِحٍ أَبِي الْخَلِيلِ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، عَنْ حَكِيمِ بْنِ حِزَامٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَفْتَرِقَا فَإِنْ بَيَّنَا وَصَدَقَا بُورِكَ لَهُمَا فِي بَيْعِهِمَا وَإِنْ كَذَبَا وَكَتَمَا مُحِقَ بَرَكَةُ بَيْعِهِمَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 16,
        "matchingEnglishURN": 1084980,
        "last_updated": null
    },
    {
        "arabicURN": 1144800,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "9.00",
        "hadithNumber": "4465",
        "bookName": " كتاب البيوع",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى نَافِعٍ فِي لَفْظِ حَدِيثِهِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الْمُتَبَايِعَانِ كُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ عَلَى صَاحِبِهِ مَا لَمْ يَفْتَرِقَا إِلاَّ بَيْعَ الْخِيَارِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 17,
        "matchingEnglishURN": 1084985,
        "last_updated": null
    },
    {
        "arabicURN": 1144810,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "9.00",
        "hadithNumber": "4466",
        "bookName": " كتاب البيوع",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى نَافِعٍ فِي لَفْظِ حَدِيثِهِ  ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَفْتَرِقَا أَوْ يَكُونَ خِيَارًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 18,
        "matchingEnglishURN": 1084990,
        "last_updated": null
    },
    {
        "arabicURN": 1144820,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "9.00",
        "hadithNumber": "4467",
        "bookName": " كتاب البيوع",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى نَافِعٍ فِي لَفْظِ حَدِيثِهِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيٍّ الْمَرْوَزِيُّ، قَالَ حَدَّثَنَا مُحْرِزُ بْنُ الْوَضَّاحِ، عَنْ إِسْمَاعِيلَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْمُتَبَايِعَانِ بِالْخِيَارِ مَا لَمْ يَفْتَرِقَا إِلاَّ أَنْ يَكُونَ الْبَيْعُ كَانَ عَنْ خِيَارٍ فَإِنْ كَانَ الْبَيْعُ عَنْ خِيَارٍ فَقَدْ وَجَبَ الْبَيْعُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 19,
        "matchingEnglishURN": 1084995,
        "last_updated": null
    },
    {
        "arabicURN": 1144830,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "9.00",
        "hadithNumber": "4468",
        "bookName": " كتاب البيوع",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى نَافِعٍ فِي لَفْظِ حَدِيثِهِ  ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ مَيْمُونٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَمْلَى عَلَىَّ نَافِعٌ عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا تَبَايَعَ الْبَيِّعَانِ فَكُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ مِنْ بَيْعِهِ مَا لَمْ يَفْتَرِقَا أَوْ يَكُونَ بَيْعُهُمَا عَنْ خِيَارٍ فَإِنْ كَانَ عَنْ خِيَارٍ فَقَدْ وَجَبَ الْبَيْعُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 20,
        "matchingEnglishURN": 1085000,
        "last_updated": null
    },
    {
        "arabicURN": 1144840,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "9.00",
        "hadithNumber": "4469",
        "bookName": " كتاب البيوع",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى نَافِعٍ فِي لَفْظِ حَدِيثِهِ  ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَفْتَرِقَا أَوْ يَقُولَ أَحَدُهُمَا لِلآخَرِ اخْتَرْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 21,
        "matchingEnglishURN": 1085005,
        "last_updated": null
    },
    {
        "arabicURN": 1144850,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "9.00",
        "hadithNumber": "4470",
        "bookName": " كتاب البيوع",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى نَافِعٍ فِي لَفْظِ حَدِيثِهِ  ",
        "hadithText": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ، قَالَ أَنْبَأَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْبَيِّعَانِ بِالْخِيَارِ حَتَّى يَفْتَرِقَا أَوْ يَكُونَ بَيْعَ خِيَارٍ ‏\"‏ ‏.‏ وَرُبَّمَا قَالَ نَافِعٌ ‏\"‏ أَوْ يَقُولَ أَحَدُهُمَا لِلآخَرِ اخْتَرْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 22,
        "matchingEnglishURN": 1085010,
        "last_updated": null
    },
    {
        "arabicURN": 1144860,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "9.00",
        "hadithNumber": "4471",
        "bookName": " كتاب البيوع",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى نَافِعٍ فِي لَفْظِ حَدِيثِهِ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْبَيِّعَانِ بِالْخِيَارِ حَتَّى يَفْتَرِقَا أَوْ يَكُونَ بَيْعَ خِيَارٍ ‏\"‏ ‏.‏ وَرُبَّمَا قَالَ نَافِعٌ ‏\"‏ أَوْ يَقُولَ أَحَدُهُمَا لِلآخَرِ اخْتَرْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 23,
        "matchingEnglishURN": 1085015,
        "last_updated": null
    },
    {
        "arabicURN": 1144870,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "9.00",
        "hadithNumber": "4472",
        "bookName": " كتاب البيوع",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى نَافِعٍ فِي لَفْظِ حَدِيثِهِ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا تَبَايَعَ الرَّجُلاَنِ فَكُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ حَتَّى يَفْتَرِقَا ‏\"‏ ‏.‏ وَقَالَ مَرَّةً أُخْرَى ‏\"‏ مَا لَمْ يَتَفَرَّقَا وَكَانَا جَمِيعًا أَوْ يُخَيِّرَ أَحَدُهُمَا الآخَرَ فَإِنْ خَيَّرَ أَحَدُهُمَا الآخَرَ فَتَبَايَعَا عَلَى ذَلِكَ فَقَدْ وَجَبَ الْبَيْعُ فَإِنْ تَفَرَّقَا بَعْدَ أَنْ تَبَايَعَا وَلَمْ يَتْرُكْ وَاحِدٌ مِنْهُمَا الْبَيْعَ فَقَدْ وَجَبَ الْبَيْعُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 24,
        "matchingEnglishURN": 1085020,
        "last_updated": null
    },
    {
        "arabicURN": 1144880,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "9.00",
        "hadithNumber": "4473",
        "bookName": " كتاب البيوع",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى نَافِعٍ فِي لَفْظِ حَدِيثِهِ  ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، يَقُولُ سَمِعْتُ نَافِعًا، يُحَدِّثُ عَنِ ابْنِ عُمَرَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ الْمُتَبَايِعَيْنِ بِالْخِيَارِ فِي بَيْعِهِمَا مَا لَمْ يَفْتَرِقَا إِلاَّ أَنْ يَكُونَ الْبَيْعُ خِيَارًا ‏\"‏ ‏.‏ قَالَ نَافِعٌ فَكَانَ عَبْدُ اللَّهِ إِذَا اشْتَرَى شَيْئًا يُعْجِبُهُ فَارَقَ صَاحِبَهُ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 25,
        "matchingEnglishURN": 1085025,
        "last_updated": null
    },
    {
        "arabicURN": 1144890,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "9.00",
        "hadithNumber": "4474",
        "bookName": " كتاب البيوع",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى نَافِعٍ فِي لَفْظِ حَدِيثِهِ  ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا هُشَيْمٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ حَدَّثَنَا نَافِعٌ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْمُتَبَايِعَانِ لاَ بَيْعَ بَيْنَهُمَا حَتَّى يَتَفَرَّقَا إِلاَّ بَيْعَ الْخِيَارِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 26,
        "matchingEnglishURN": 1085030,
        "last_updated": null
    },
    {
        "arabicURN": 1144900,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "10.00",
        "hadithNumber": "4475",
        "bookName": " كتاب البيوع",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى عَبْدِ اللَّهِ بْنِ دِينَارٍ فِي لَفْظِ هَذَا الْحَدِيثِ  ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، عَنْ إِسْمَاعِيلَ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كُلُّ بَيِّعَيْنِ لاَ بَيْعَ بَيْنَهُمَا حَتَّى يَتَفَرَّقَا إِلاَّ بَيْعَ الْخِيَارِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 27,
        "matchingEnglishURN": 1085035,
        "last_updated": null
    },
    {
        "arabicURN": 1144910,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "10.00",
        "hadithNumber": "4476",
        "bookName": " كتاب البيوع",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى عَبْدِ اللَّهِ بْنِ دِينَارٍ فِي لَفْظِ هَذَا الْحَدِيثِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، عَنْ شُعَيْبٍ، عَنِ اللَّيْثِ، عَنِ ابْنِ الْهَادِ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ كُلُّ بَيِّعَيْنِ فَلاَ بَيْعَ بَيْنَهُمَا حَتَّى يَتَفَرَّقَا إِلاَّ بَيْعَ الْخِيَارِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 28,
        "matchingEnglishURN": 1085038,
        "last_updated": null
    },
    {
        "arabicURN": 1144920,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "10.00",
        "hadithNumber": "4477",
        "bookName": " كتاب البيوع",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى عَبْدِ اللَّهِ بْنِ دِينَارٍ فِي لَفْظِ هَذَا الْحَدِيثِ  ",
        "hadithText": "أَخْبَرَنَا عَبْدُ الْحَمِيدِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا مَخْلَدٌ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كُلُّ بَيِّعَيْنِ لاَ بَيْعَ بَيْنَهُمَا حَتَّى يَتَفَرَّقَا إِلاَّ بَيْعَ الْخِيَارِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 29,
        "matchingEnglishURN": 1085040,
        "last_updated": null
    },
    {
        "arabicURN": 1144930,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "10.00",
        "hadithNumber": "4478",
        "bookName": " كتاب البيوع",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى عَبْدِ اللَّهِ بْنِ دِينَارٍ فِي لَفْظِ هَذَا الْحَدِيثِ  ",
        "hadithText": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ بْنِ دَاوُدَ، قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ بَكْرٍ، قَالَ حَدَّثَنَا أَبِي، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ كُلُّ بَيِّعَيْنِ لاَ بَيْعَ بَيْنَهُمَا حَتَّى يَتَفَرَّقَا إِلاَّ بَيْعَ الْخِيَارِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 30,
        "matchingEnglishURN": 1085045,
        "last_updated": null
    },
    {
        "arabicURN": 1144940,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "10.00",
        "hadithNumber": "4479",
        "bookName": " كتاب البيوع",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى عَبْدِ اللَّهِ بْنِ دِينَارٍ فِي لَفْظِ هَذَا الْحَدِيثِ  ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ، عَنْ بَهْزِ بْنِ أَسَدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كُلُّ بَيِّعَيْنِ فَلاَ بَيْعَ بَيْنَهُمَا حَتَّى يَتَفَرَّقَا إِلاَّ بَيْعَ الْخِيَارِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 31,
        "matchingEnglishURN": 1085050,
        "last_updated": null
    },
    {
        "arabicURN": 1144950,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "10.00",
        "hadithNumber": "4480",
        "bookName": " كتاب البيوع",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى عَبْدِ اللَّهِ بْنِ دِينَارٍ فِي لَفْظِ هَذَا الْحَدِيثِ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا أَوْ يَكُونَ بَيْعُهُمَا عَنْ خِيَارٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 32,
        "matchingEnglishURN": 1085055,
        "last_updated": null
    },
    {
        "arabicURN": 1144960,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "10.00",
        "hadithNumber": "4481",
        "bookName": " كتاب البيوع",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى عَبْدِ اللَّهِ بْنِ دِينَارٍ فِي لَفْظِ هَذَا الْحَدِيثِ  ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الْبَيِّعَانِ بِالْخِيَارِ حَتَّى يَتَفَرَّقَا أَوْ يَأْخُذَ كُلُّ وَاحِدٍ مِنْهُمَا مِنَ الْبَيْعِ مَا هَوِيَ وَيَتَخَايَرَانِ ثَلاَثَ مَرَّاتٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 33,
        "matchingEnglishURN": 1085060,
        "last_updated": null
    },
    {
        "arabicURN": 1144970,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "10.00",
        "hadithNumber": "4482",
        "bookName": " كتاب البيوع",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى عَبْدِ اللَّهِ بْنِ دِينَارٍ فِي لَفْظِ هَذَا الْحَدِيثِ  ",
        "hadithText": "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ أَنْبَأَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا وَيَأْخُذْ أَحَدُهُمَا مَا رَضِيَ مِنْ صَاحِبِهِ أَوْ هَوِيَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 34,
        "matchingEnglishURN": 1085065,
        "last_updated": null
    },
    {
        "arabicURN": 1144980,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "11.00",
        "hadithNumber": "4483",
        "bookName": " كتاب البيوع",
        "babName": " باب وُجُوبِ الْخِيَارِ لِلْمُتَبَايِعَيْنِ قَبْلَ افْتِرَاقِهِمَا بِأَبْدَانِهِمَا ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ أَنْبَأَنَا اللَّيْثُ، عَنِ ابْنِ عَجْلاَنَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ الْمُتَبَايِعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا إِلاَّ أَنْ يَكُونَ صَفْقَةَ خِيَارٍ وَلاَ يَحِلُّ لَهُ أَنْ يُفَارِقَ صَاحِبَهُ خَشْيَةَ أَنْ يَسْتَقِيلَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 35,
        "matchingEnglishURN": 1085070,
        "last_updated": null
    },
    {
        "arabicURN": 1144990,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "12.00",
        "hadithNumber": "4484",
        "bookName": " كتاب البيوع",
        "babName": " باب الْخَدِيعَةِ فِي الْبَيْعِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَجُلاً، ذَكَرَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ يُخْدَعُ فِي الْبَيْعِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا بِعْتَ فَقُلْ لاَ خِلاَبَةَ ‏\"‏ ‏.‏ فَكَانَ الرَّجُلُ إِذَا بَاعَ يَقُولُ لاَ خِلاَبَةَ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 36,
        "matchingEnglishURN": 1085075,
        "last_updated": null
    },
    {
        "arabicURN": 1145000,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "12.00",
        "hadithNumber": "4485",
        "bookName": " كتاب البيوع",
        "babName": " باب الْخَدِيعَةِ فِي الْبَيْعِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا يُوسُفُ بْنُ حَمَّادٍ، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ رَجُلاً، كَانَ فِي عُقْدَتِهِ ضَعْفٌ كَانَ يُبَايِعُ وَأَنَّ أَهْلَهُ أَتَوُا النَّبِيَّ صلى الله عليه وسلم فَقَالُوا يَا نَبِيَّ اللَّهِ احْجُرْ عَلَيْهِ ‏.‏ فَدَعَاهُ نَبِيُّ اللَّهِ صلى الله عليه وسلم فَنَهَاهُ فَقَالَ يَا نَبِيَّ اللَّهِ إِنِّي لاَ أَصْبِرُ عَنِ الْبَيْعِ ‏.‏ قَالَ ‏\"‏ إِذَا بِعْتَ فَقُلْ لاَ خِلاَبَةَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 37,
        "matchingEnglishURN": 1085080,
        "last_updated": null
    },
    {
        "arabicURN": 1145010,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "13.00",
        "hadithNumber": "4486",
        "bookName": " كتاب البيوع",
        "babName": " باب الْمُحَفَّلَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو كَثِيرٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا بَاعَ أَحَدُكُمُ الشَّاةَ أَوِ اللَّقْحَةَ فَلاَ يُحَفِّلْهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 38,
        "matchingEnglishURN": 1085085,
        "last_updated": null
    },
    {
        "arabicURN": 1145020,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "14.00",
        "hadithNumber": "4487",
        "bookName": " كتاب البيوع",
        "babName": " باب النَّهْىِ عَنِ الْمُصَرَّاةِ، وَهُوَ أَنْ يَرْبِطَ، أَخْلاَفَ النَّاقَةِ أَوِ الشَّاةِ وَتُتْرَكُ مِنَ الْحَلْبِ يَوْمَيْنِ وَالثَّلاَثَةَ حَتَّى يَجْتَمِعَ لَهَا لَبَنٌ فَيَزِيدَ مُشْتَرِيهَا فِي قِيمَتِهَا لِمَا يَرَى مِنْ كَثْرَةِ لَبَنِهَا ‏.‏",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَلَقُّوا الرُّكْبَانَ لِلْبَيْعِ وَلاَ تُصَرُّوا الإِبِلَ وَالْغَنَمَ مَنِ ابْتَاعَ مِنْ ذَلِكَ شَيْئًا فَهُوَ بِخَيْرِ النَّظَرَيْنِ فَإِنْ شَاءَ أَمْسَكَهَا وَإِنْ شَاءَ أَنْ يَرُدَّهَا رَدَّهَا وَمَعَهَا صَاعُ تَمْرٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 39,
        "matchingEnglishURN": 1085090,
        "last_updated": null
    },
    {
        "arabicURN": 1145030,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "14.00",
        "hadithNumber": "4488",
        "bookName": " كتاب البيوع",
        "babName": " باب النَّهْىِ عَنِ الْمُصَرَّاةِ، وَهُوَ أَنْ يَرْبِطَ، أَخْلاَفَ النَّاقَةِ أَوِ الشَّاةِ وَتُتْرَكُ مِنَ الْحَلْبِ يَوْمَيْنِ وَالثَّلاَثَةَ حَتَّى يَجْتَمِعَ لَهَا لَبَنٌ فَيَزِيدَ مُشْتَرِيهَا فِي قِيمَتِهَا لِمَا يَرَى مِنْ كَثْرَةِ لَبَنِهَا ‏.‏",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ، قَالَ حَدَّثَنِي دَاوُدُ بْنُ قَيْسٍ، عَنِ ابْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنِ اشْتَرَى مُصَرَّاةً فَإِنْ رَضِيَهَا إِذَا حَلَبَهَا فَلْيُمْسِكْهَا وَإِنْ كَرِهَهَا فَلْيَرُدَّهَا وَمَعَهَا صَاعٌ مِنْ تَمْرٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 40,
        "matchingEnglishURN": 1085095,
        "last_updated": null
    },
    {
        "arabicURN": 1145040,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "14.00",
        "hadithNumber": "4489",
        "bookName": " كتاب البيوع",
        "babName": " باب النَّهْىِ عَنِ الْمُصَرَّاةِ، وَهُوَ أَنْ يَرْبِطَ، أَخْلاَفَ النَّاقَةِ أَوِ الشَّاةِ وَتُتْرَكُ مِنَ الْحَلْبِ يَوْمَيْنِ وَالثَّلاَثَةَ حَتَّى يَجْتَمِعَ لَهَا لَبَنٌ فَيَزِيدَ مُشْتَرِيهَا فِي قِيمَتِهَا لِمَا يَرَى مِنْ كَثْرَةِ لَبَنِهَا ‏.‏",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ أَبُو الْقَاسِمِ صلى الله عليه وسلم ‏\"‏ مَنِ ابْتَاعَ مُحَفَّلَةً أَوْ مُصَرَّاةً فَهُوَ بِالْخِيَارِ ثَلاَثَةَ أَيَّامٍ إِنْ شَاءَ أَنْ يُمْسِكَهَا أَمْسَكَهَا وَإِنْ شَاءَ أَنْ يَرُدَّهَا رَدَّهَا وَصَاعًا مِنْ تَمْرٍ لاَ سَمْرَاءَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 41,
        "matchingEnglishURN": 1085100,
        "last_updated": null
    },
    {
        "arabicURN": 1145050,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "15.00",
        "hadithNumber": "4490",
        "bookName": " كتاب البيوع",
        "babName": " باب الْخَرَاجِ بِالضَّمَانِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عِيسَى بْنُ يُونُسَ، وَوَكِيعٌ، قَالاَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ مَخْلَدِ بْنِ خُفَافٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَّ الْخَرَاجَ بِالضَّمَانِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 42,
        "matchingEnglishURN": 1085105,
        "last_updated": null
    },
    {
        "arabicURN": 1145060,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "16.00",
        "hadithNumber": "4491",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْمُهَاجِرِ لِلأَعْرَابِيِّ ‏‏ ",
        "hadithText": "أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ تَمِيمٍ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ حَدَّثَنِي شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ التَّلَقِّي وَأَنْ يَبِيعَ مُهَاجِرٌ لِلأَعْرَابِيِّ وَعَنِ التَّصْرِيَةِ وَالنَّجْشِ وَأَنْ يَسْتَامَ الرَّجُلُ عَلَى سَوْمِ أَخِيهِ وَأَنْ تَسْأَلَ الْمَرْأَةُ طَلاَقَ أُخْتِهَا ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 43,
        "matchingEnglishURN": 1085110,
        "last_updated": null
    },
    {
        "arabicURN": 1145070,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "17.00",
        "hadithNumber": "4492",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْحَاضِرِ لِلْبَادِي ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ الزِّبْرِقَانِ، قَالَ حَدَّثَنَا يُونُسُ بْنُ عُبَيْدٍ، عَنِ الْحَسَنِ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ وَإِنْ كَانَ أَبَاهُ أَوْ أَخَاهُ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 44,
        "matchingEnglishURN": 1085115,
        "last_updated": null
    },
    {
        "arabicURN": 1145080,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "17.00",
        "hadithNumber": "4493",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْحَاضِرِ لِلْبَادِي ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنِي سَالِمُ بْنُ نُوحٍ، قَالَ أَنْبَأَنَا يُونُسُ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ نُهِينَا أَنْ يَبِيعَ، حَاضِرٌ لِبَادٍ وَإِنْ كَانَ أَخَاهُ أَوْ أَبَاهُ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 45,
        "matchingEnglishURN": 1085120,
        "last_updated": null
    },
    {
        "arabicURN": 1145090,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "17.00",
        "hadithNumber": "4494",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْحَاضِرِ لِلْبَادِي ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ مُحَمَّدٍ، عَنْ أَنَسٍ، قَالَ نُهِينَا أَنْ يَبِيعَ، حَاضِرٌ لِبَادٍ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 46,
        "matchingEnglishURN": 1085125,
        "last_updated": null
    },
    {
        "arabicURN": 1145100,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "17.00",
        "hadithNumber": "4495",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْحَاضِرِ لِلْبَادِي ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرًا، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يَبِيعُ حَاضِرٌ لِبَادٍ دَعُوا النَّاسَ يَرْزُقُ اللَّهُ بَعْضَهُمْ مِنْ بَعْضٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 47,
        "matchingEnglishURN": 1085130,
        "last_updated": null
    },
    {
        "arabicURN": 1145110,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "17.00",
        "hadithNumber": "4496",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْحَاضِرِ لِلْبَادِي ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَلَقُّوا الرُّكْبَانَ لِلْبَيْعِ وَلاَ يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ - وَلاَ تَنَاجَشُوا - وَلاَ يَبِيعُ حَاضِرٌ لِبَادٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 48,
        "matchingEnglishURN": 1085135,
        "last_updated": null
    },
    {
        "arabicURN": 1145120,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "17.00",
        "hadithNumber": "4497",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْحَاضِرِ لِلْبَادِي ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ بْنِ أَعْيَنَ، قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ، عَنْ أَبِيهِ، عَنْ كَثِيرِ بْنِ فَرْقَدٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ نَهَى عَنِ النَّجْشِ وَالتَّلَقِّي وَأَنْ يَبِيعَ حَاضِرٌ لِبَادٍ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 49,
        "matchingEnglishURN": 1085140,
        "last_updated": null
    },
    {
        "arabicURN": 1145130,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "18.00",
        "hadithNumber": "4498",
        "bookName": " كتاب البيوع",
        "babName": " باب التَّلَقِّي ‏‏ ",
        "hadithText": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ التَّلَقِّي ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 50,
        "matchingEnglishURN": 1085145,
        "last_updated": null
    },
    {
        "arabicURN": 1145140,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "18.00",
        "hadithNumber": "4499",
        "bookName": " كتاب البيوع",
        "babName": " باب التَّلَقِّي ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ قُلْتُ لأَبِي أُسَامَةَ أَحَدَّثَكُمْ عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ تَلَقِّي الْجَلَبِ حَتَّى يَدْخُلَ بِهَا السُّوقَ فَأَقَرَّ بِهِ أَبُو أُسَامَةَ وَقَالَ نَعَمْ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 51,
        "matchingEnglishURN": 1085148,
        "last_updated": null
    },
    {
        "arabicURN": 1145150,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "18.00",
        "hadithNumber": "4500",
        "bookName": " كتاب البيوع",
        "babName": " باب التَّلَقِّي ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُتَلَقَّى الرُّكْبَانُ وَأَنْ يَبِيعَ حَاضِرٌ لِبَادٍ ‏.‏ قُلْتُ لاِبْنِ عَبَّاسٍ مَا قَوْلُهُ حَاضِرٌ لِبَادٍ قَالَ لاَ يَكُونُ لَهُ سِمْسَارًا ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 52,
        "matchingEnglishURN": 1085150,
        "last_updated": null
    },
    {
        "arabicURN": 1145160,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "18.00",
        "hadithNumber": "4501",
        "bookName": " كتاب البيوع",
        "babName": " باب التَّلَقِّي ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ، قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ، قَالَ أَنْبَأَنَا هِشَامُ بْنُ حَسَّانَ الْقُرْدُوسِيُّ، أَنَّهُ سَمِعَ ابْنَ سِيرِينَ، يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَلَقُّوا الْجَلَبَ فَمَنْ تَلَقَّاهُ فَاشْتَرَى مِنْهُ فَإِذَا أَتَى سَيِّدُهُ السُّوقَ فَهُوَ بِالْخِيَارِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 53,
        "matchingEnglishURN": 1085155,
        "last_updated": null
    },
    {
        "arabicURN": 1145170,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "19.00",
        "hadithNumber": "4502",
        "bookName": " كتاب البيوع",
        "babName": " باب سَوْمِ الرَّجُلِ عَلَى سَوْمِ أَخِيهِ ‏‏ ",
        "hadithText": "حَدَّثَنَا مُجَاهِدُ بْنُ مُوسَى، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يَبِيعَنَّ حَاضِرٌ لِبَادٍ وَلاَ تَنَاجَشُوا وَلاَ يُسَاوِمِ الرَّجُلُ عَلَى سَوْمِ أَخِيهِ وَلاَ يَخْطُبْ عَلَى خِطْبَةِ أَخِيهِ وَلاَ تَسْأَلِ الْمَرْأَةُ طَلاَقَ أُخْتِهَا لِتَكْتَفِئَ مَا فِي إِنَائِهَا وَلِتُنْكَحَ فَإِنَّمَا لَهَا مَا كَتَبَ اللَّهُ لَهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 54,
        "matchingEnglishURN": 1085160,
        "last_updated": null
    },
    {
        "arabicURN": 1145180,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "20.00",
        "hadithNumber": "4503",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الرَّجُلِ عَلَى بَيْعِ أَخِيهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، وَاللَّيْثِ، - وَاللَّفْظُ لَهُ - عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\"‏ لاَ يَبِيعُ أَحَدُكُمْ عَلَى بَيْعِ أَخِيهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 55,
        "matchingEnglishURN": 1085165,
        "last_updated": null
    },
    {
        "arabicURN": 1145190,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "20.00",
        "hadithNumber": "4504",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الرَّجُلِ عَلَى بَيْعِ أَخِيهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَبِيعُ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ حَتَّى يَبْتَاعَ أَوْ يَذَرَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 56,
        "matchingEnglishURN": 1085170,
        "last_updated": null
    },
    {
        "arabicURN": 1145200,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "21.00",
        "hadithNumber": "4505",
        "bookName": " كتاب البيوع",
        "babName": " باب النَّجْشِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ النَّجْشِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 57,
        "matchingEnglishURN": 1085175,
        "last_updated": null
    },
    {
        "arabicURN": 1145210,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "21.00",
        "hadithNumber": "4506",
        "bookName": " كتاب البيوع",
        "babName": " باب النَّجْشِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا بِشْرُ بْنُ شُعَيْبٍ، قَالَ حَدَّثَنَا أَبِي، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي أَبُو سَلَمَةَ، وَسَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ يَبِيعُ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ وَلاَ يَبِيعُ حَاضِرٌ لِبَادٍ وَلاَ تَنَاجَشُوا وَلاَ يَزِيدُ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ وَلاَ تَسْأَلِ الْمَرْأَةُ طَلاَقَ الأُخْرَى لِتَكْتَفِئَ مَا فِي إِنَائِهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 58,
        "matchingEnglishURN": 1085180,
        "last_updated": null
    },
    {
        "arabicURN": 1145220,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "21.00",
        "hadithNumber": "4507",
        "bookName": " كتاب البيوع",
        "babName": " باب النَّجْشِ ‏‏ ",
        "hadithText": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَبِيعُ حَاضِرٌ لِبَادٍ وَلاَ تَنَاجَشُوا وَلاَ يَزِيدُ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ وَلاَ تَسْأَلُ الْمَرْأَةُ طَلاَقَ أُخْتِهَا لِتَسْتَكْفِئَ بِهِ مَا فِي صَحْفَتِهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 59,
        "matchingEnglishURN": 1085185,
        "last_updated": null
    },
    {
        "arabicURN": 1145230,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "22.00",
        "hadithNumber": "4508",
        "bookName": " كتاب البيوع",
        "babName": " باب الْبَيْعِ فِيمَنْ يَزِيدُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا الْمُعْتَمِرُ، وَعِيسَى بْنُ يُونُسَ، قَالاَ حَدَّثَنَا الأَخْضَرُ بْنُ عَجْلاَنَ، عَنْ أَبِي بَكْرٍ الْحَنَفِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَاعَ قَدَحًا وَحِلْسًا فِيمَنْ يَزِيدُ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 60,
        "matchingEnglishURN": 1085190,
        "last_updated": null
    },
    {
        "arabicURN": 1145240,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "23.00",
        "hadithNumber": "4509",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْمُلاَمَسَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حِبَّانَ، وَأَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُلاَمَسَةِ وَالْمُنَابَذَةِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 61,
        "matchingEnglishURN": 1085195,
        "last_updated": null
    },
    {
        "arabicURN": 1145250,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "24.00",
        "hadithNumber": "4510",
        "bookName": " كتاب البيوع",
        "babName": " باب تَفْسِيرِ ذَلِكَ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ بْنِ إِسْحَاقَ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عَامِرُ بْنُ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُلاَمَسَةِ لَمْسِ الثَّوْبِ لاَ يَنْظُرُ إِلَيْهِ وَعَنِ الْمُنَابَذَةِ وَهِيَ طَرْحُ الرَّجُلِ ثَوْبَهُ إِلَى الرَّجُلِ بِالْبَيْعِ قَبْلَ أَنْ يُقَلِّبَهُ أَوْ يَنْظُرَ إِلَيْهِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 62,
        "matchingEnglishURN": 1085200,
        "last_updated": null
    },
    {
        "arabicURN": 1145260,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "25.00",
        "hadithNumber": "4511",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْمُنَابَذَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُلاَمَسَةِ وَالْمُنَابَذَةِ فِي الْبَيْعِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 63,
        "matchingEnglishURN": 1085205,
        "last_updated": null
    },
    {
        "arabicURN": 1145270,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "25.00",
        "hadithNumber": "4512",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْمُنَابَذَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ الْمَرْوَزِيُّ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنِ عَطَاءِ بْنِ يَزِيدَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعَتَيْنِ عَنِ الْمُلاَمَسَةِ وَالْمُنَابَذَةِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 64,
        "matchingEnglishURN": 1085210,
        "last_updated": null
    },
    {
        "arabicURN": 1145280,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "26.00",
        "hadithNumber": "4513",
        "bookName": " كتاب البيوع",
        "babName": " باب تَفْسِيرِ ذَلِكَ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُصَفَّى بْنِ بُهْلُولٍ، عَنْ مُحَمَّدِ بْنِ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، عَنِ الزُّهْرِيِّ، قَالَ سَمِعْتُ سَعِيدًا، يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُلاَمَسَةِ وَالْمُنَابَذَةِ وَالْمُلاَمَسَةُ أَنْ يَتَبَايَعَ الرَّجُلاَنِ بِالثَّوْبَيْنِ تَحْتَ اللَّيْلِ يَلْمِسُ كُلُّ رَجُلٍ مِنْهُمَا ثَوْبَ صَاحِبِهِ بِيَدِهِ وَالْمُنَابَذَةُ أَنْ يَنْبِذَ الرَّجُلُ إِلَى الرَّجُلِ الثَّوْبَ وَيَنْبُذَ الآخَرُ إِلَيْهِ الثَّوْبَ فَيَتَبَايَعَا عَلَى ذَلِكَ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 65,
        "matchingEnglishURN": 1085215,
        "last_updated": null
    },
    {
        "arabicURN": 1145290,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "26.00",
        "hadithNumber": "4514",
        "bookName": " كتاب البيوع",
        "babName": " باب تَفْسِيرِ ذَلِكَ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عَامِرَ بْنَ سَعْدٍ، أَخْبَرَهُ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ رَضِيَ اللَّهُ عَنْهُ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُلاَمَسَةِ وَالْمُلاَمَسَةُ لَمْسُ الثَّوْبِ لاَ يَنْظُرُ إِلَيْهِ وَعَنِ الْمُنَابَذَةِ وَالْمُنَابَذَةُ طَرْحُ الرَّجُلِ ثَوْبَهُ إِلَى الرَّجُلِ قَبْلَ أَنْ يُقَلِّبَهُ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 66,
        "matchingEnglishURN": 1085220,
        "last_updated": null
    },
    {
        "arabicURN": 1145300,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "26.00",
        "hadithNumber": "4515",
        "bookName": " كتاب البيوع",
        "babName": " باب تَفْسِيرِ ذَلِكَ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عَطَاءِ بْنِ يَزِيدَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ لُبْسَتَيْنِ وَعَنْ بَيْعَتَيْنِ أَمَّا الْبَيْعَتَانِ فَالْمُلاَمَسَةُ وَالْمُنَابَذَةُ وَالْمُنَابَذَةُ أَنْ يَقُولَ إِذَا نَبَذْتُ هَذَا الثَّوْبَ فَقَدْ وَجَبَ يَعْنِي الْبَيْعَ وَالْمُلاَمَسَةُ أَنْ يَمَسَّهُ بِيَدِهِ وَلاَ يَنْشُرَهُ وَلاَ يُقَلِّبَهُ إِذَا مَسَّهُ فَقَدْ وَجَبَ الْبَيْعُ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 67,
        "matchingEnglishURN": 1085225,
        "last_updated": null
    },
    {
        "arabicURN": 1145310,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "26.00",
        "hadithNumber": "4516",
        "bookName": " كتاب البيوع",
        "babName": " باب تَفْسِيرِ ذَلِكَ ‏‏ ",
        "hadithText": "أَخْبَرَنَا هَارُونُ بْنُ زَيْدِ بْنِ أَبِي الزَّرْقَاءِ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ، قَالَ بَلَغَنِي عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ لُبْسَتَيْنِ وَنَهَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعَتَيْنِ عَنِ الْمُنَابَذَةِ وَالْمُلاَمَسَةِ وَهِيَ بُيُوعٌ كَانُوا يَتَبَايَعُونَ بِهَا فِي الْجَاهِلِيَّةِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 68,
        "matchingEnglishURN": 1085230,
        "last_updated": null
    },
    {
        "arabicURN": 1145320,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "26.00",
        "hadithNumber": "4517",
        "bookName": " كتاب البيوع",
        "babName": " باب تَفْسِيرِ ذَلِكَ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ عُبَيْدَ اللَّهِ، عَنْ خُبَيْبٍ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ نَهَى عَنْ بَيْعَتَيْنِ أَمَّا الْبَيْعَتَانِ فَالْمُنَابَذَةُ وَالْمُلاَمَسَةُ وَزَعَمَ أَنَّ الْمُلاَمَسَةَ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ أَبِيعُكَ ثَوْبِي بِثَوْبِكَ وَلاَ يَنْظُرَ وَاحِدٌ مِنْهُمَا إِلَى ثَوْبِ الآخَرِ وَلَكِنْ يَلْمِسُهُ لَمْسًا وَأَمَّا الْمُنَابَذَةُ أَنْ يَقُولَ أَنْبُذُ مَا مَعِي وَتَنْبُذُ مَا مَعَكَ لِيَشْتَرِيَ أَحَدُهُمَا مِنَ الآخَرِ وَلاَ يَدْرِي كُلُّ وَاحِدٍ مِنْهُمَا كَمْ مَعَ الآخَرِ وَنَحْوًا مِنْ هَذَا الْوَصْفِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 69,
        "matchingEnglishURN": 1085233,
        "last_updated": null
    },
    {
        "arabicURN": 1145330,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "27.00",
        "hadithNumber": "4518",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْحَصَاةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنِي أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الْحَصَاةِ وَعَنْ بَيْعِ الْغَرَرِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 70,
        "matchingEnglishURN": 1085235,
        "last_updated": null
    },
    {
        "arabicURN": 1145340,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "28.00",
        "hadithNumber": "4519",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الثَّمَرِ قَبْلَ أَنْ يَبْدُوَ صَلاَحُهُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَبِيعُوا الثَّمَرَ حَتَّى يَبْدُوَ صَلاَحُهُ ‏\"‏ ‏.‏ نَهَى الْبَائِعَ وَالْمُشْتَرِيَ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 71,
        "matchingEnglishURN": 1085240,
        "last_updated": null
    },
    {
        "arabicURN": 1145350,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "28.00",
        "hadithNumber": "4520",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الثَّمَرِ قَبْلَ أَنْ يَبْدُوَ صَلاَحُهُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الثَّمَرِ حَتَّى يَبْدُوَ صَلاَحُهُ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 72,
        "matchingEnglishURN": 1085245,
        "last_updated": null
    },
    {
        "arabicURN": 1145360,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "28.00",
        "hadithNumber": "4521",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الثَّمَرِ قَبْلَ أَنْ يَبْدُوَ صَلاَحُهُ ‏‏ ",
        "hadithText": "أَخْبَرَنِي يُونُسُ بْنُ عَبْدِ الأَعْلَى، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي سَعِيدٌ، وَأَبُو سَلَمَةَ أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَبِيعُوا الثَّمَرَ حَتَّى يَبْدُوَ صَلاَحُهُ وَلاَ تَبْتَاعُوا الثَّمَرَ بِالتَّمْرِ ‏\"‏ ‏.‏ قَالَ ابْنُ شِهَابٍ حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ مِثْلِهِ سَوَاءً ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 73,
        "matchingEnglishURN": 1085250,
        "last_updated": null
    },
    {
        "arabicURN": 1145370,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "28.00",
        "hadithNumber": "4522",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الثَّمَرِ قَبْلَ أَنْ يَبْدُوَ صَلاَحُهُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَبْدُ الْحَمِيدِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا مَخْلَدُ بْنُ يَزِيدَ، قَالَ حَدَّثَنَا حَنْظَلَةُ، قَالَ سَمِعْتُ طَاوُسًا، يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ، يَقُولُ قَامَ فِينَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ لاَ تَبِيعُوا الثَّمَرَ حَتَّى يَبْدُوَ صَلاَحُهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 74,
        "matchingEnglishURN": 1085255,
        "last_updated": null
    },
    {
        "arabicURN": 1145380,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "28.00",
        "hadithNumber": "4523",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الثَّمَرِ قَبْلَ أَنْ يَبْدُوَ صَلاَحُهُ ‏‏ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ نَهَى عَنِ الْمُخَابَرَةِ وَالْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَأَنْ يُبَاعَ الثَّمَرُ حَتَّى يَبْدُوَ صَلاَحُهُ وَأَنْ لاَ يُبَاعَ إِلاَّ بِالدَّنَانِيرِ وَالدَّرَاهِمِ وَرَخَّصَ فِي الْعَرَايَا ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 75,
        "matchingEnglishURN": 1085260,
        "last_updated": null
    },
    {
        "arabicURN": 1145390,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "28.00",
        "hadithNumber": "4524",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الثَّمَرِ قَبْلَ أَنْ يَبْدُوَ صَلاَحُهُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا الْمُفَضَّلُ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، وَأَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الْمُخَابَرَةِ وَالْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَبَيْعِ الثَّمَرِ حَتَّى يُطْعَمَ إِلاَّ الْعَرَايَا ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 76,
        "matchingEnglishURN": 1085265,
        "last_updated": null
    },
    {
        "arabicURN": 1145400,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "28.00",
        "hadithNumber": "4525",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الثَّمَرِ قَبْلَ أَنْ يَبْدُوَ صَلاَحُهُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ النَّخْلِ حَتَّى يُطْعَمَ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 77,
        "matchingEnglishURN": 1085270,
        "last_updated": null
    },
    {
        "arabicURN": 1145410,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "29.00",
        "hadithNumber": "4526",
        "bookName": " كتاب البيوع",
        "babName": " باب شِرَاءِ الثِّمَارِ قَبْلَ أَنْ يَبْدُوَ صَلاَحُهَا عَلَى أَنْ يَقْطَعَهَا وَلاَ يَتْرُكَهَا إِلَى أَوَانِ إِدْرَاكِهَا ‏.‏",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الثِّمَارِ حَتَّى تُزْهِيَ ‏.‏ قِيلَ يَا رَسُولَ اللَّهِ وَمَا تُزْهِيَ قَالَ ‏\"‏ حَتَّى تَحْمَرَّ ‏\"‏ ‏.‏ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَرَأَيْتَ إِنْ مَنَعَ اللَّهُ الثَّمَرَةَ فَبِمَ يَأْخُذُ أَحَدُكُمْ مَالَ أَخِيهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 78,
        "matchingEnglishURN": 1085275,
        "last_updated": null
    },
    {
        "arabicURN": 1145420,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "30.00",
        "hadithNumber": "4527",
        "bookName": " كتاب البيوع",
        "babName": " باب وَضْعِ الْجَوَائِحِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرًا، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنْ بِعْتَ مِنْ أَخِيكَ ثَمَرًا فَأَصَابَتْهُ جَائِحَةٌ فَلاَ يَحِلُّ لَكَ أَنْ تَأْخُذَ مِنْهُ شَيْئًا بِمَ تَأْخُذُ مَالَ أَخِيكَ بِغَيْرِ حَقٍّ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 79,
        "matchingEnglishURN": 1085280,
        "last_updated": null
    },
    {
        "arabicURN": 1145430,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "30.00",
        "hadithNumber": "4528",
        "bookName": " كتاب البيوع",
        "babName": " باب وَضْعِ الْجَوَائِحِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، قَالَ حَدَّثَنَا ثَوْرُ بْنُ يَزِيدَ، أَنَّهُ سَمِعَ ابْنَ جُرَيْجٍ، يُحَدِّثُ عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ بَاعَ ثَمَرًا فَأَصَابَتْهُ جَائِحَةٌ فَلاَ يَأْخُذْ مِنْ أَخِيهِ - وَذَكَرَ شَيْئًا - عَلَى مَا يَأْكُلُ أَحَدُكُمْ مَالَ أَخِيهِ الْمُسْلِمِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 80,
        "matchingEnglishURN": 1085285,
        "last_updated": null
    },
    {
        "arabicURN": 1145440,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "30.00",
        "hadithNumber": "4529",
        "bookName": " كتاب البيوع",
        "babName": " باب وَضْعِ الْجَوَائِحِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ حُمَيْدٍ، - وَهُوَ الأَعْرَجُ - عَنْ سُلَيْمَانَ بْنِ عَتِيقٍ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم وَضَعَ الْجَوَائِحَ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 81,
        "matchingEnglishURN": 1085290,
        "last_updated": null
    },
    {
        "arabicURN": 1145450,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "30.00",
        "hadithNumber": "4530",
        "bookName": " كتاب البيوع",
        "babName": " باب وَضْعِ الْجَوَائِحِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ بُكَيْرٍ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ أُصِيبَ رَجُلٌ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي ثِمَارٍ ابْتَاعَهَا فَكَثُرَ دَيْنُهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَصَدَّقُوا عَلَيْهِ ‏\"‏ ‏.‏ فَتَصَدَّقَ النَّاسُ عَلَيْهِ فَلَمْ يَبْلُغْ ذَلِكَ وَفَاءَ دَيْنِهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خُذُوا مَا وَجَدْتُمْ وَلَيْسَ لَكُمْ إِلاَّ ذَلِكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 82,
        "matchingEnglishURN": 1085295,
        "last_updated": null
    },
    {
        "arabicURN": 1145460,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "31.00",
        "hadithNumber": "4531",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الثَّمَرِ سِنِينَ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ حُمَيْدٍ الأَعْرَجِ، عَنْ سُلَيْمَانَ بْنِ عَتِيكٍ، - قَالَ قُتَيْبَةُ عَتِيكٌ بِالْكَافِ وَالصَّوَابُ عَتِيقٌ - عَنْ جَابِرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الثَّمَرِ سِنِينَ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 83,
        "matchingEnglishURN": 1085300,
        "last_updated": null
    },
    {
        "arabicURN": 1145470,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "32.00",
        "hadithNumber": "4532",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الثَّمَرِ بِالتَّمْرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الثَّمَرِ بِالتَّمْرِ ‏.‏ وَقَالَ ابْنُ عُمَرَ حَدَّثَنِي زَيْدُ بْنُ ثَابِتٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَخَّصَ فِي الْعَرَايَا ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 84,
        "matchingEnglishURN": 1085305,
        "last_updated": null
    },
    {
        "arabicURN": 1145480,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "32.00",
        "hadithNumber": "4533",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الثَّمَرِ بِالتَّمْرِ ‏‏ ",
        "hadithText": "أَخْبَرَنِي زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُزَابَنَةِ وَالْمُزَابَنَةُ أَنْ يُبَاعَ مَا فِي رُءُوسِ النَّخْلِ بِتَمْرٍ بِكَيْلٍ مُسَمًّى إِنْ زَادَ لِي وَإِنْ نَقَصَ فَعَلَىَّ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 85,
        "matchingEnglishURN": 1085310,
        "last_updated": null
    },
    {
        "arabicURN": 1145490,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "33.00",
        "hadithNumber": "4534",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْكَرْمِ بِالزَّبِيبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، رضى الله عنهما أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُزَابَنَةِ وَالْمُزَابَنَةُ بَيْعُ الثَّمَرِ بِالتَّمْرِ كَيْلاً وَبَيْعُ الْكَرْمِ بِالزَّبِيبِ كَيْلاً ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 86,
        "matchingEnglishURN": 1085315,
        "last_updated": null
    },
    {
        "arabicURN": 1145500,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "33.00",
        "hadithNumber": "4535",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْكَرْمِ بِالزَّبِيبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ طَارِقٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 87,
        "matchingEnglishURN": 1085320,
        "last_updated": null
    },
    {
        "arabicURN": 1145510,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "33.00",
        "hadithNumber": "4536",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْكَرْمِ بِالزَّبِيبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ حَدَّثَنِي زَيْدُ بْنُ ثَابِتٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَخَّصَ فِي الْعَرَايَا ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 88,
        "matchingEnglishURN": 1085325,
        "last_updated": null
    },
    {
        "arabicURN": 1145520,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "33.00",
        "hadithNumber": "4537",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْكَرْمِ بِالزَّبِيبِ ‏‏ ",
        "hadithText": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَخَّصَ فِي الْعَرَايَا بِالتَّمْرِ وَالرُّطَبِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 89,
        "matchingEnglishURN": 1085330,
        "last_updated": null
    },
    {
        "arabicURN": 1145530,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "34.00",
        "hadithNumber": "4538",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْعَرَايَا بِخَرْصِهَا تَمْرًا ‏‏ ",
        "hadithText": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ، عَنْ زَيْدِ بْنِ ثَابِتٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَخَّصَ فِي بَيْعِ الْعَرَايَا تُبَاعُ بِخِرْصِهَا ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 90,
        "matchingEnglishURN": 1085335,
        "last_updated": null
    },
    {
        "arabicURN": 1145540,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "34.00",
        "hadithNumber": "4539",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْعَرَايَا بِخَرْصِهَا تَمْرًا ‏‏ ",
        "hadithText": "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ حَدَّثَنِي زَيْدُ بْنُ ثَابِتٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَخَّصَ فِي بَيْعِ الْعَرِيَّةِ بِخِرْصِهَا تَمْرًا ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 91,
        "matchingEnglishURN": 1085340,
        "last_updated": null
    },
    {
        "arabicURN": 1145550,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "35.00",
        "hadithNumber": "4540",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْعَرَايَا بِالرُّطَبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَالِمًا، أَخْبَرَهُ أَنَّهُ، سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ، يَقُولُ إِنَّ زَيْدَ بْنَ ثَابِتٍ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَخَّصَ فِي بَيْعِ الْعَرَايَا بِالرُّطَبِ وَبِالتَّمْرِ وَلَمْ يُرَخِّصْ فِي غَيْرِ ذَلِكَ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 92,
        "matchingEnglishURN": 1085345,
        "last_updated": null
    },
    {
        "arabicURN": 1145560,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "35.00",
        "hadithNumber": "4541",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْعَرَايَا بِالرُّطَبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لَهُ - عَنْ عَبْدِ الرَّحْمَنِ، عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، عَنْ أَبِي سُفْيَانَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَخَّصَ فِي الْعَرَايَا أَنْ تُبَاعَ بِخَرْصِهَا فِي خَمْسَةِ أَوْسُقٍ أَوْ مَا دُونَ خَمْسَةِ أَوْسُقٍ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 93,
        "matchingEnglishURN": 1085350,
        "last_updated": null
    },
    {
        "arabicURN": 1145570,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "35.00",
        "hadithNumber": "4542",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْعَرَايَا بِالرُّطَبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ يَحْيَى، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سَهْلِ بْنِ أَبِي حَثَمَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الثَّمَرِ حَتَّى يَبْدُوَ صَلاَحُهُ وَرَخَّصَ فِي الْعَرَايَا أَنْ تُبَاعَ بِخَرْصِهَا يَأْكُلُهَا أَهْلُهَا رُطَبًا ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 94,
        "matchingEnglishURN": 1085355,
        "last_updated": null
    },
    {
        "arabicURN": 1145580,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "35.00",
        "hadithNumber": "4543",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْعَرَايَا بِالرُّطَبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا الْحُسَيْنُ بْنُ عِيسَى، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ حَدَّثَنِي الْوَلِيدُ بْنُ كَثِيرٍ، قَالَ أَخْبَرَنِي بُشَيْرُ بْنُ يَسَارٍ، أَنَّ رَافِعَ بْنَ خَدِيجٍ، وَسَهْلَ بْنَ أَبِي حَثْمَةَ، حَدَّثَاهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُزَابَنَةِ بَيْعُ الثَّمَرِ بِالتَّمْرِ إِلاَّ لأَصْحَابِ الْعَرَايَا فَإِنَّهُ أَذِنَ لَهُمْ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 95,
        "matchingEnglishURN": 1085360,
        "last_updated": null
    },
    {
        "arabicURN": 1145590,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "35.00",
        "hadithNumber": "4544",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْعَرَايَا بِالرُّطَبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَحْيَى، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ أَصْحَابِ، رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُمْ قَالُوا رَخَّصَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي بَيْعِ الْعَرَايَا بِخَرْصِهَا ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 96,
        "matchingEnglishURN": 1085365,
        "last_updated": null
    },
    {
        "arabicURN": 1145600,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "36.00",
        "hadithNumber": "4545",
        "bookName": " كتاب البيوع",
        "babName": " باب اشْتِرَاءِ التَّمْرِ بِالرُّطَبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا مَالِكٌ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ يَزِيدَ، عَنْ زَيْدِ بْنِ عَيَّاشٍ، عَنْ سَعْدٍ، قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ التَّمْرِ بِالرُّطَبِ فَقَالَ لِمَنْ حَوْلَهُ ‏\"‏ أَيَنْقُصُ الرُّطَبُ إِذَا يَبِسَ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ فَنَهَى عَنْهُ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 97,
        "matchingEnglishURN": 1085370,
        "last_updated": null
    },
    {
        "arabicURN": 1145610,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "36.00",
        "hadithNumber": "4546",
        "bookName": " كتاب البيوع",
        "babName": " باب اشْتِرَاءِ التَّمْرِ بِالرُّطَبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ مَيْمُونٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ الْفِرْيَابِيُّ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، عَنْ زَيْدٍ، عَنْ سَعْدِ بْنِ مَالِكٍ، قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الرُّطَبِ بِالتَّمْرِ فَقَالَ ‏\"‏ أَيَنْقُصُ إِذَا يَبِسَ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ فَنَهَى عَنْهُ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 98,
        "matchingEnglishURN": 1085375,
        "last_updated": null
    },
    {
        "arabicURN": 1145620,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "37.00",
        "hadithNumber": "4547",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الصُّبْرَةِ مِنَ التَّمْرِ لاَ يُعْلَمُ مَكِيلُهَا بِالْكَيْلِ الْمُسَمَّى مِنَ التَّمْرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الصُّبْرَةِ مِنَ التَّمْرِ لاَ يُعْلَمُ مَكِيلُهَا بِالْكَيْلِ الْمُسَمَّى مِنَ التَّمْرِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 99,
        "matchingEnglishURN": 1085380,
        "last_updated": null
    },
    {
        "arabicURN": 1145630,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "38.00",
        "hadithNumber": "4548",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الصُّبْرَةِ مِنَ الطَّعَامِ بِالصُّبْرَةِ مِنَ الطَّعَامِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ تُبَاعُ الصُّبْرَةُ مِنَ الطَّعَامِ بِالصُّبْرَةِ مِنَ الطَّعَامِ وَلاَ الصُّبْرَةُ مِنَ الطَّعَامِ بِالْكَيْلِ الْمُسَمَّى مِنَ الطَّعَامِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 100,
        "matchingEnglishURN": 1085385,
        "last_updated": null
    },
    {
        "arabicURN": 1145640,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "39.00",
        "hadithNumber": "4549",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الزَّرْعِ بِالطَّعَامِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُزَابَنَةِ أَنْ يَبِيعَ ثَمَرَ حَائِطِهِ وَإِنْ كَانَ نَخْلاً بِتَمْرٍ كَيْلاً وَإِنْ كَانَ كَرْمًا أَنْ يَبِيعَهُ بِزَبِيبٍ كَيْلاً وَإِنْ كَانَ زَرْعًا أَنْ يَبِيعَهُ بِكَيْلِ طَعَامٍ نَهَى عَنْ ذَلِكَ كُلِّهِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 101,
        "matchingEnglishURN": 1085390,
        "last_updated": null
    },
    {
        "arabicURN": 1145650,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "39.00",
        "hadithNumber": "4550",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الزَّرْعِ بِالطَّعَامِ ‏‏ ",
        "hadithText": "حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا مَخْلَدُ بْنُ يَزِيدَ، قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُخَابَرَةِ وَالْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَعَنْ بَيْعِ الثَّمَرِ قَبْلَ أَنْ يُطْعَمَ وَعَنْ بَيْعِ ذَلِكَ إِلاَّ بِالدَّنَانِيرِ وَالدَّرَاهِمِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 102,
        "matchingEnglishURN": 1085395,
        "last_updated": null
    },
    {
        "arabicURN": 1145660,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "40.00",
        "hadithNumber": "4551",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ السُّنْبُلِ حَتَّى يَبْيَضَّ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ النَّخْلَةِ حَتَّى تَزْهُوَ وَعَنِ السُّنْبُلِ حَتَّى يَبْيَضَّ وَيَأْمَنَ الْعَاهَةَ نَهَى الْبَائِعَ وَالْمُشْتَرِيَ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 103,
        "matchingEnglishURN": 1085400,
        "last_updated": null
    },
    {
        "arabicURN": 1145670,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "40.00",
        "hadithNumber": "4552",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ السُّنْبُلِ حَتَّى يَبْيَضَّ ‏‏ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنِ الأَعْمَشِ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ أَبِي صَالِحٍ، أَنَّ رَجُلاً، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَهُ قَالَ يَا رَسُولَ اللَّهِ إِنَّا لاَ نَجِدُ الصَّيْحَانِيَّ وَلاَ الْعِذْقَ بِجَمْعِ التَّمْرِ حَتَّى نَزِيدَهُمْ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بِعْهُ بِالْوَرِقِ ثُمَّ اشْتَرِ بِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 104,
        "matchingEnglishURN": 1085405,
        "last_updated": null
    },
    {
        "arabicURN": 1145680,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "41.00",
        "hadithNumber": "4553",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ التَّمْرِ بِالتَّمْرِ مُتَفَاضِلاً ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ الْمَجِيدِ بْنِ سُهَيْلٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، وَعَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَعْمَلَ رَجُلاً عَلَى خَيْبَرَ فَجَاءَ بِتَمْرٍ جَنِيبٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَكُلُّ تَمْرِ خَيْبَرَ هَكَذَا ‏\"‏ ‏.‏ قَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ إِنَّا لَنَأْخُذُ الصَّاعَ مِنْ هَذَا بِصَاعَيْنِ وَالصَّاعَيْنِ بِالثَّلاَثِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَفْعَلْ بِعِ الْجَمْعَ بِالدَّرَاهِمِ ثُمَّ ابْتَعْ بِالدَّرَاهِمِ جَنِيبًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 105,
        "matchingEnglishURN": 1085410,
        "last_updated": null
    },
    {
        "arabicURN": 1145690,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "41.00",
        "hadithNumber": "4554",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ التَّمْرِ بِالتَّمْرِ مُتَفَاضِلاً ‏‏ ",
        "hadithText": "أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ، وَإِسْمَاعِيلُ بْنُ مَسْعُودٍ، - وَاللَّفْظُ لَهُ - عَنْ خَالِدٍ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ بِتَمْرٍ رَيَّانٍ - وَكَانَ تَمْرُ رَسُولِ اللَّهِ صلى الله عليه وسلم بَعْلاً فِيهِ يُبْسٌ - فَقَالَ ‏\"‏ أَنَّى لَكُمْ هَذَا ‏\"‏ ‏.‏ قَالُوا ابْتَعْنَاهُ صَاعًا بِصَاعَيْنِ مِنْ تَمْرِنَا فَقَالَ ‏\"‏ لاَ تَفْعَلْ فَإِنَّ هَذَا لاَ يَصِحُّ وَلَكِنْ بِعْ تَمْرَكَ وَاشْتَرِ مِنْ هَذَا حَاجَتَكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 106,
        "matchingEnglishURN": 1085415,
        "last_updated": null
    },
    {
        "arabicURN": 1145700,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "41.00",
        "hadithNumber": "4555",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ التَّمْرِ بِالتَّمْرِ مُتَفَاضِلاً ‏‏ ",
        "hadithText": "حَدَّثَنِي إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا أَبُو سَعِيدٍ الْخُدْرِيُّ، قَالَ كُنَّا نُرْزَقُ تَمْرَ الْجَمْعِ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَنَبِيعُ الصَّاعَيْنِ بِالصَّاعِ فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ لاَ صَاعَىْ تَمْرٍ بِصَاعٍ وَلاَ صَاعَىْ حِنْطَةٍ بِصَاعٍ وَلاَ دِرْهَمًا بِدِرْهَمَيْنِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 107,
        "matchingEnglishURN": 1085420,
        "last_updated": null
    },
    {
        "arabicURN": 1145710,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "41.00",
        "hadithNumber": "4556",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ التَّمْرِ بِالتَّمْرِ مُتَفَاضِلاً ‏‏ ",
        "hadithText": "أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ، عَنْ يَحْيَى، - وَهُوَ ابْنُ حَمْزَةَ - قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ يَحْيَى، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، قَالَ حَدَّثَنِي أَبُو سَعِيدٍ، قَالَ كُنَّا نَبِيعُ تَمْرَ الْجَمْعِ صَاعَيْنِ بِصَاعٍ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ صَاعَىْ تَمْرٍ بِصَاعٍ وَلاَ صَاعَىْ حِنْطَةٍ بِصَاعٍ وَلاَ دِرْهَمَيْنِ بِدِرْهَمٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 108,
        "matchingEnglishURN": 1085425,
        "last_updated": null
    },
    {
        "arabicURN": 1145720,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "41.00",
        "hadithNumber": "4557",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ التَّمْرِ بِالتَّمْرِ مُتَفَاضِلاً ‏‏ ",
        "hadithText": "أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ، عَنْ يَحْيَى، - وَهُوَ ابْنُ حَمْزَةَ - قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي يَحْيَى، قَالَ حَدَّثَنِي عُقْبَةُ بْنُ عَبْدِ الْغَافِرِ، قَالَ حَدَّثَنِي أَبُو سَعِيدٍ، قَالَ أَتَى بِلاَلٌ رَسُولَ اللَّهِ صلى الله عليه وسلم بِتَمْرٍ بَرْنِيٍّ فَقَالَ ‏\"‏ مَا هَذَا ‏\"‏ ‏.‏ قَالَ اشْتَرَيْتُهُ صَاعًا بِصَاعَيْنِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَوِّهْ عَيْنُ الرِّبَا لاَ تَقْرَبْهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 109,
        "matchingEnglishURN": 1085430,
        "last_updated": null
    },
    {
        "arabicURN": 1145730,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "41.00",
        "hadithNumber": "4558",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ التَّمْرِ بِالتَّمْرِ مُتَفَاضِلاً ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ، أَنَّهُ سَمِعَ عُمَرَ بْنَ الْخَطَّابِ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الذَّهَبُ بِالْوَرِقِ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالتَّمْرُ بِالتَّمْرِ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالْبُرُّ بِالْبُرِّ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالشَّعِيرُ بِالشَّعِيرِ رِبًا إِلاَّ هَاءَ وَ هَاءَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 110,
        "matchingEnglishURN": 1085435,
        "last_updated": null
    },
    {
        "arabicURN": 1145740,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "42.00",
        "hadithNumber": "4559",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ التَّمْرِ بِالتَّمْرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا وَاصِلُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ التَّمْرُ بِالتَّمْرِ وَالْحِنْطَةُ بِالْحِنْطَةِ وَالشَّعِيرُ بِالشَّعِيرِ وَالْمِلْحُ بِالْمِلْحِ يَدًا بِيَدٍ فَمَنْ زَادَ أَوِ ازْدَادَ فَقَدْ أَرْبَى إِلاَّ مَا اخْتَلَفَتْ أَلْوَانُهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 111,
        "matchingEnglishURN": 1085440,
        "last_updated": null
    },
    {
        "arabicURN": 1145750,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "43.00",
        "hadithNumber": "4560",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْبُرِّ بِالْبُرِّ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ حَدَّثَنَا سَلَمَةُ، - وَهُوَ ابْنُ عَلْقَمَةَ - عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ مُسْلِمِ بْنِ يَسَارٍ، وَعَبْدِ اللَّهِ بْنِ عَتِيكٍ، قَالاَ جَمَعَ الْمَنْزِلُ بَيْنَ عُبَادَةَ بْنِ الصَّامِتِ وَمُعَاوِيَةَ حَدَّثَهُمْ عُبَادَةُ، قَالَ نَهَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الذَّهَبِ بِالذَّهَبِ وَالْوَرِقِ بِالْوَرِقِ وَالْبُرِّ بِالْبُرِّ وَالشَّعِيرِ بِالشَّعِيرِ وَالتَّمْرِ بِالتَّمْرِ - قَالَ أَحَدُهُمَا وَالْمِلْحِ بِالْمِلْحِ وَلَمْ يَقُلْهُ الآخَرُ - إِلاَّ مِثْلاً بِمِثْلٍ يَدًا بِيَدٍ وَأَمَرَنَا أَنْ نَبِيعَ الذَّهَبَ بِالْوَرِقِ وَالْوَرِقَ بِالذَّهَبِ وَالْبُرَّ بِالشِّعِيرِ وَالشَّعِيرَ بِالْبُرِّ يَدًا بِيَدٍ كَيْفَ شِئْنَا قَالَ أَحَدُهُمَا فَمَنْ زَادَ أَوِ ازْدَادَ فَقَدْ أَرْبَى ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 112,
        "matchingEnglishURN": 1085445,
        "last_updated": null
    },
    {
        "arabicURN": 1145760,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "43.00",
        "hadithNumber": "4561",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْبُرِّ بِالْبُرِّ ‏‏ ",
        "hadithText": "أَخْبَرَنَا الْمُؤَمَّلُ بْنُ هِشَامٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ عُلَيَّةَ - عَنْ سَلَمَةَ بْنِ عَلْقَمَةَ، عَنِ ابْنِ سِيرِينَ، قَالَ حَدَّثَنِي مُسْلِمُ بْنُ يَسَارٍ، وَعَبْدُ اللَّهِ بْنُ عُبَيْدٍ، - وَقَدْ كَانَ يُدْعَى ابْنَ هُرْمُزَ - قَالَ جَمَعَ الْمَنْزِلُ بَيْنَ عُبَادَةَ بْنِ الصَّامِتِ وَبَيْنَ مُعَاوِيَةَ حَدَّثَهُمْ عُبَادَةُ، قَالَ نَهَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الذَّهَبِ بِالذَّهَبِ وَالْفِضَّةِ بِالْفِضَّةِ وَالتَّمْرِ بِالتَّمْرِ وَالْبُرِّ بِالْبُرِّ وَالشَّعِيرِ بِالشَّعِيرِ - قَالَ أَحَدُهُمَا وَالْمِلْحِ بِالْمِلْحِ وَلَمْ يَقُلْهُ الآخَرُ - إِلاَّ سَوَاءً بِسَوَاءٍ مِثْلاً بِمِثْلٍ - قَالَ أَحَدُهُمَا مَنْ زَادَ أَوِ ازْدَادَ فَقَدْ أَرْبَى وَلَمْ يَقُلْهُ الآخَرُ - وَأَمَرَنَا أَنْ نَبِيعَ الذَّهَبَ بِالْفِضَّةِ وَالْفِضَّةَ بِالذَّهَبِ وَالْبُرَّ بِالشَّعِيرِ وَالشَّعِيرَ بِالْبُرِّ يَدًا بِيَدٍ كَيْفَ شِئْنَا ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 113,
        "matchingEnglishURN": 1085450,
        "last_updated": null
    },
    {
        "arabicURN": 1145770,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "44.00",
        "hadithNumber": "4562",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الشَّعِيرِ بِالشَّعِيرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، قَالَ حَدَّثَنَا سَلَمَةُ بْنُ عَلْقَمَةَ، عَنْ مُحَمَّدٍ، قَالَ حَدَّثَنِي مُسْلِمُ بْنُ يَسَارٍ، وَعَبْدُ اللَّهِ بْنُ عُبَيْدٍ، قَالاَ جَمَعَ الْمَنْزِلُ بَيْنَ عُبَادَةَ بْنِ الصَّامِتِ وَبَيْنَ مُعَاوِيَةَ فَقَالَ عُبَادَةُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ نَبِيعَ الذَّهَبَ بِالذَّهَبِ وَالْوَرِقَ بِالْوَرِقِ وَالْبُرَّ بِالْبُرِّ وَالشَّعِيرَ بِالشَّعِيرِ وَالتَّمْرَ بِالتَّمْرِ - قَالَ أَحَدُهُمَا وَالْمِلْحَ بِالْمِلْحِ وَلَمْ يَقُلِ الآخَرُ - إِلاَّ سَوَاءً بِسَوَاءٍ مِثْلاً بِمِثْلٍ - قَالَ أَحَدُهُمَا مَنْ زَادَ أَوِ ازْدَادَ فَقَدْ أَرْبَى وَلَمْ يَقُلِ الآخَرُ - وَأَمَرَنَا أَنْ نَبِيعَ الذَّهَبَ بِالْوَرِقِ وَالْوَرِقَ بِالذَّهَبِ وَالْبُرَّ بِالشَّعِيرِ وَالشَّعِيرَ بِالْبُرِّ يَدًا بِيَدٍ كَيْفَ شِئْنَا فَبَلَغَ هَذَا الْحَدِيثُ مُعَاوِيَةَ فَقَامَ فَقَالَ مَا بَالُ رِجَالٍ يُحَدِّثُونَ أَحَادِيثَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَدْ صَحِبْنَاهُ وَلَمْ نَسْمَعْهُ مِنْهُ ‏.‏ فَبَلَغَ ذَلِكَ عُبَادَةَ بْنَ الصَّامِتِ فَقَامَ فَأَعَادَ الْحَدِيثَ فَقَالَ لَنُحَدِّثَنَّ بِمَا سَمِعْنَاهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَإِنْ رُغِمَ مُعَاوِيَةُ ‏.‏ خَالَفَهُ قَتَادَةُ رَوَاهُ عَنْ مُسْلِمِ بْنِ يَسَارٍ عَنْ أَبِي الأَشْعَثِ عَنْ عُبَادَةَ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 114,
        "matchingEnglishURN": 1085455,
        "last_updated": null
    },
    {
        "arabicURN": 1145780,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "44.00",
        "hadithNumber": "4563",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الشَّعِيرِ بِالشَّعِيرِ ‏‏ ",
        "hadithText": "أَخْبَرَنِي مُحَمَّدُ بْنُ آدَمَ، عَنْ عَبْدَةَ، عَنِ ابْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ مُسْلِمِ بْنِ يَسَارٍ، عَنْ أَبِي الأَشْعَثِ الصَّنْعَانِيِّ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، - وَكَانَ بَدْرِيًّا وَكَانَ بَايَعَ النَّبِيَّ صلى الله عليه وسلم أَنْ لاَ يَخَافَ فِي اللَّهِ لَوْمَةَ لاَئِمٍ - أَنَّ عُبَادَةَ قَامَ خَطِيبًا فَقَالَ أَيُّهَا النَّاسُ إِنَّكُمْ قَدْ أَحْدَثْتُمْ بُيُوعًا لاَ أَدْرِي مَا هِيَ أَلاَ إِنَّ الذَّهَبَ بِالذَّهَبِ وَزْنًا بِوَزْنٍ تِبْرُهَا وَعَيْنُهَا وَإِنَّ الْفِضَّةَ بِالْفِضَّةِ وَزْنًا بِوَزْنٍ تِبْرُهَا وَعَيْنُهَا وَلاَ بَأْسَ بِبَيْعِ الْفِضَّةِ بِالذَّهَبِ يَدًا بِيَدٍ وَالْفِضَّةُ أَكْثَرُهُمَا وَلاَ تَصْلُحُ النَّسِيئَةُ أَلاَ إِنَّ الْبُرَّ بِالْبُرِّ وَالشَّعِيرَ بِالشَّعِيرِ مُدْيًا بِمُدْىٍ وَلاَ بَأْسَ بِبَيْعِ الشَّعِيرِ بِالْحِنْطَةِ يَدًا بِيَدٍ وَالشَّعِيرُ أَكْثَرُهُمَا وَلاَ يَصْلُحُ نَسِيئَةً أَلاَ وَإِنَّ التَّمْرَ بِالتَّمْرِ مُدْيًا بِمُدْىٍ حَتَّى ذَكَرَ الْمِلْحَ مُدًّا بِمُدٍّ فَمَنْ زَادَ أَوِ اسْتَزَادَ فَقَدْ أَرْبَى ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 115,
        "matchingEnglishURN": 1085460,
        "last_updated": null
    },
    {
        "arabicURN": 1145790,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "44.00",
        "hadithNumber": "4564",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الشَّعِيرِ بِالشَّعِيرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالاَ حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، قَالَ حَدَّثَنَا هَمَّامٌ، قَالَ حَدَّثَنَا قَتَادَةُ، عَنْ أَبِي الْخَلِيلِ، عَنْ مُسْلِمٍ الْمَكِّيِّ، عَنْ أَبِي الأَشْعَثِ الصَّنْعَانِيِّ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الذَّهَبُ بِالذَّهَبِ تِبْرُهُ وَعَيْنُهُ وَزْنًا بِوَزْنٍ وَالْفِضَّةُ بِالْفِضَّةِ تِبْرُهُ وَعَيْنُهُ وَزْنًا بِوَزْنٍ وَالْمِلْحُ بِالْمِلْحِ وَالتَّمْرُ بِالتَّمْرِ وَالْبُرُّ بِالْبُرِّ وَالشَّعِيرُ بِالشَّعِيرِ سَوَاءً بِسَوَاءٍ مِثْلاً بِمِثْلٍ فَمَنْ زَادَ أَوِ ازْدَادَ فَقَدْ أَرْبَى ‏\"‏ ‏.‏ وَاللَّفْظُ لِمُحَمَّدٍ لَمْ يَذْكُرْ يَعْقُوبُ ‏\"‏ وَالشَّعِيرُ بِالشَّعِيرِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 116,
        "matchingEnglishURN": 1085465,
        "last_updated": null
    },
    {
        "arabicURN": 1145800,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "44.00",
        "hadithNumber": "4565",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الشَّعِيرِ بِالشَّعِيرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ سُلَيْمَانَ بْنِ عَلِيٍّ، أَنَّ أَبَا الْمُتَوَكِّلِ، مَرَّ بِهِمْ فِي السُّوقِ فَقَامَ إِلَيْهِ قَوْمٌ أَنَا مِنْهُمْ قَالَ قُلْنَا أَتَيْنَاكَ لِنَسْأَلَكَ عَنِ الصَّرْفِ ‏.‏ قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ قَالَ لَهُ رَجُلٌ مَا بَيْنَكَ وَبَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم غَيْرُ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ لَيْسَ بَيْنِي وَبَيْنَهُ غَيْرُهُ ‏.‏ قَالَ فَإِنَّ الذَّهَبَ بِالذَّهَبِ وَالْوَرِقَ بِالْوَرِقِ - قَالَ سُلَيْمَانُ أَوْ قَالَ وَالْفِضَّةَ بِالْفِضَّةِ - وَالْبُرَّ بِالْبُرِّ وَالشَّعِيرَ بِالشَّعِيرِ وَالتَّمْرَ بِالتَّمْرِ وَالْمِلْحَ بِالْمِلْحِ سَوَاءً بِسَوَاءٍ فَمَنْ زَادَ عَلَى ذَلِكَ أَوِ ازْدَادَ فَقَدْ أَرْبَى وَالآخِذُ وَالْمُعْطِي فِيهِ سَوَاءٌ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 117,
        "matchingEnglishURN": 1085470,
        "last_updated": null
    },
    {
        "arabicURN": 1145810,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "44.00",
        "hadithNumber": "4566",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الشَّعِيرِ بِالشَّعِيرِ ‏‏ ",
        "hadithText": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ قَالَ إِسْمَاعِيلُ حَدَّثَنَا حَكِيمُ بْنُ جَابِرٍ، ح وَأَنْبَأَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا حَكِيمُ بْنُ جَابِرٍ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ الذَّهَبُ الْكِفَّةُ بِالْكِفَّةِ ‏\"‏ ‏.‏ وَلَمْ يَذْكُرْ يَعْقُوبُ ‏\"‏ الْكِفَّةُ بِالْكِفَّةِ ‏\"‏ ‏.‏ فَقَالَ مُعَاوِيَةُ إِنَّ هَذَا لاَ يَقُولُ شَيْئًا ‏.‏ قَالَ عُبَادَةُ إِنِّي وَاللَّهِ مَا أُبَالِي أَنْ لاَ أَكُونَ بِأَرْضٍ يَكُونُ بِهَا مُعَاوِيَةُ إِنِّي أَشْهَدُ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ذَلِكَ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 118,
        "matchingEnglishURN": 1085475,
        "last_updated": null
    },
    {
        "arabicURN": 1145820,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "45.00",
        "hadithNumber": "4567",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الدِّينَارِ بِالدِّينَارِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ مُوسَى بْنِ أَبِي تَمِيمٍ، عَنْ سَعِيدِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الدِّينَارُ بِالدِّينَارِ وَالدِّرْهَمُ بِالدِّرْهَمِ لاَ فَضْلَ بَيْنَهُمَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 119,
        "matchingEnglishURN": 1085480,
        "last_updated": null
    },
    {
        "arabicURN": 1145830,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "46.00",
        "hadithNumber": "4568",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الدِّرْهَمِ بِالدِّرْهَمِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ حُمَيْدِ بْنِ قَيْسٍ الْمَكِّيِّ، عَنْ مُجَاهِدٍ، قَالَ قَالَ ابْنُ عُمَرَ الدِّينَارُ بِالدِّينَارِ وَالدِّرْهَمُ بِالدِّرْهَمِ لاَ فَضْلَ بَيْنَهُمَا هَذَا عَهْدُ نَبِيِّنَا صلى الله عليه وسلم إِلَيْنَا ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 120,
        "matchingEnglishURN": 1085485,
        "last_updated": null
    },
    {
        "arabicURN": 1145840,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "46.00",
        "hadithNumber": "4569",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الدِّرْهَمِ بِالدِّرْهَمِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا وَاصِلُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنِ ابْنِ أَبِي نُعْمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الذَّهَبُ بِالذَّهَبِ وَزْنًا بِوَزْنٍ مِثْلاً بِمِثْلٍ وَالْفِضَّةُ بِالْفِضَّةِ وَزْنًا بِوَزْنٍ مِثْلاً بِمِثْلٍ فَمَنْ زَادَ أَوِ ازْدَادَ فَقَدْ أَرْبَى ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 121,
        "matchingEnglishURN": 1085490,
        "last_updated": null
    },
    {
        "arabicURN": 1145850,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "47.00",
        "hadithNumber": "4570",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الذَّهَبِ بِالذَّهَبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَبِيعُوا الذَّهَبَ بِالذَّهَبِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا الْوَرِقَ بِالْوَرِقِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تَبِيعُوا مِنْهَا شَيْئًا غَائِبًا بِنَاجِزٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 122,
        "matchingEnglishURN": 1085495,
        "last_updated": null
    },
    {
        "arabicURN": 1145860,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "47.00",
        "hadithNumber": "4571",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الذَّهَبِ بِالذَّهَبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، وَإِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالاَ حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ زُرَيْعٍ - قَالَ حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ نَافِعٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ بَصُرَ عَيْنِي وَسَمِعَ أُذُنِي، مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ النَّهْىَ عَنِ الذَّهَبِ بِالذَّهَبِ وَالْوَرِقِ بِالْوَرِقِ إِلاَّ سَوَاءً بِسَوَاءٍ مِثْلاً بِمِثْلٍ ‏\"‏ وَلاَ تَبِيعُوا غَائِبًا بِنَاجِزٍ وَلاَ تُشِفُّوا أَحَدَهُمَا عَلَى الآخَرِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 123,
        "matchingEnglishURN": 1085500,
        "last_updated": null
    },
    {
        "arabicURN": 1145870,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "47.00",
        "hadithNumber": "4572",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الذَّهَبِ بِالذَّهَبِ ‏‏ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ مُعَاوِيَةَ، بَاعَ سِقَايَةً مِنْ ذَهَبٍ أَوْ وَرِقٍ بِأَكْثَرَ مِنْ وَزْنِهَا فَقَالَ أَبُو الدَّرْدَاءِ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنْ مِثْلِ هَذَا إِلاَّ مِثْلاً بِمِثْلٍ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 124,
        "matchingEnglishURN": 1085505,
        "last_updated": null
    },
    {
        "arabicURN": 1145880,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "48.00",
        "hadithNumber": "4573",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْقِلاَدَةِ فِيهَا الْخَرَزُ وَالذَّهَبُ بِالذَّهَبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ أَبِي شُجَاعٍ، سَعِيدِ بْنِ يَزِيدَ عَنْ خَالِدِ بْنِ أَبِي عِمْرَانَ، عَنْ حَنَشٍ الصَّنْعَانِيِّ، عَنْ فَضَالَةَ بْنِ عُبَيْدٍ، قَالَ اشْتَرَيْتُ يَوْمَ خَيْبَرَ قِلاَدَةً فِيهَا ذَهَبٌ وَخَرَزٌ بِاثْنَىْ عَشَرَ دِينَارًا فَفَصَّلْتُهَا فَوَجَدْتُ فِيهَا أَكْثَرَ مِنَ اثْنَىْ عَشَرَ دِينَارًا فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ لاَ تُبَاعُ حَتَّى تُفَصَّلَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 125,
        "matchingEnglishURN": 1085510,
        "last_updated": null
    },
    {
        "arabicURN": 1145890,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "48.00",
        "hadithNumber": "4574",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْقِلاَدَةِ فِيهَا الْخَرَزُ وَالذَّهَبُ بِالذَّهَبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ مَحْبُوبٍ، قَالَ حَدَّثَنَا هُشَيْمٌ، قَالَ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ خَالِدِ بْنِ أَبِي عِمْرَانَ، عَنْ حَنَشٍ الصَّنْعَانِيِّ، عَنْ فَضَالَةَ بْنِ عُبَيْدٍ، قَالَ أَصَبْتُ يَوْمَ خَيْبَرَ قِلاَدَةً فِيهَا ذَهَبٌ وَخَرَزٌ فَأَرَدْتُ أَنْ أَبِيعَهَا فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ افْصِلْ بَعْضَهَا مِنْ بَعْضٍ ثُمَّ بِعْهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 126,
        "matchingEnglishURN": 1085515,
        "last_updated": null
    },
    {
        "arabicURN": 1145900,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "49.00",
        "hadithNumber": "4575",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْفِضَّةِ بِالذَّهَبِ نَسِيئَةً ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، عَنْ سُفْيَانَ، عَنْ عَمْرٍو، عَنْ أَبِي الْمِنْهَالِ، قَالَ بَاعَ شَرِيكٌ لِي وَرِقًا بِنَسِيئَةٍ فَجَاءَنِي فَأَخْبَرَنِي فَقُلْتُ، هَذَا لاَ يَصْلُحُ ‏.‏ فَقَالَ قَدْ وَاللَّهِ بِعْتُهُ فِي السُّوقِ وَمَا عَابَهُ عَلَىَّ أَحَدٌ فَأَتَيْتُ الْبَرَاءَ بْنَ عَازِبٍ فَسَأَلْتُهُ فَقَالَ قَدِمَ عَلَيْنَا النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ وَنَحْنُ نَبِيعُ هَذَا الْبَيْعَ فَقَالَ ‏\"‏ مَا كَانَ يَدًا بِيَدٍ فَلاَ بَأْسَ وَمَا كَانَ نَسِيئَةً فَهُوَ رِبًا ‏\"‏ ‏.‏ ثُمَّ قَالَ لِي ائْتِ زَيْدَ بْنَ أَرْقَمَ فَأَتَيْتُهُ فَسَأَلْتُهُ فَقَالَ مِثْلَ ذَلِكَ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 127,
        "matchingEnglishURN": 1085520,
        "last_updated": null
    },
    {
        "arabicURN": 1145910,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "49.00",
        "hadithNumber": "4576",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْفِضَّةِ بِالذَّهَبِ نَسِيئَةً ‏‏ ",
        "hadithText": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، وَعَامِرُ بْنُ مُصْعَبٍ، أَنَّهُمَا سَمِعَا أَبَا الْمِنْهَالِ، يَقُولُ سَأَلْتُ الْبَرَاءَ بْنَ عَازِبٍ وَزَيْدَ بْنَ أَرْقَمَ فَقَالاَ كُنَّا تَاجِرَيْنِ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلْنَا نَبِيَّ اللَّهِ صلى الله عليه وسلم عَنِ الصَّرْفِ فَقَالَ ‏\"‏ إِنْ كَانَ يَدًا بِيَدٍ فَلاَ بَأْسَ وَإِنْ كَانَ نَسِيئَةً فَلاَ يَصْلُحُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 128,
        "matchingEnglishURN": 1085525,
        "last_updated": null
    },
    {
        "arabicURN": 1145920,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "49.00",
        "hadithNumber": "4577",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْفِضَّةِ بِالذَّهَبِ نَسِيئَةً ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ، عَنْ مُحَمَّدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ حَبِيبٍ، قَالَ سَمِعْتُ أَبَا الْمِنْهَالِ، قَالَ سَأَلْتُ الْبَرَاءَ بْنَ عَازِبٍ عَنِ الصَّرْفِ، فَقَالَ سَلْ زَيْدَ بْنَ أَرْقَمَ فَإِنَّهُ خَيْرٌ مِنِّي وَأَعْلَمُ ‏.‏ فَسَأَلْتُ زَيْدًا فَقَالَ سَلِ الْبَرَاءَ فَإِنَّهُ خَيْرٌ مِنِّي وَأَعْلَمُ فَقَالاَ جَمِيعًا نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْوَرِقِ بِالذَّهَبِ دَيْنًا ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 129,
        "matchingEnglishURN": 1085530,
        "last_updated": null
    },
    {
        "arabicURN": 1145930,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "50.00",
        "hadithNumber": "4578",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْفِضَّةِ بِالذَّهَبِ وَبَيْعِ الذَّهَبِ بِالْفِضَّةِ ‏‏ ",
        "hadithText": "وَفِيمَا قَرَأَ عَلَيْنَا أَحْمَدُ بْنُ مَنِيعٍ قَالَ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي إِسْحَاقَ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الْفِضَّةِ بِالْفِضَّةِ وَالذَّهَبِ بِالذَّهَبِ إِلاَّ سَوَاءً بِسَوَاءٍ وَأَمَرَنَا أَنْ نَبْتَاعَ الذَّهَبَ بِالْفِضَّةِ كَيْفَ شِئْنَا وَالْفِضَّةَ بِالذَّهَبِ كَيْفَ شِئْنَا ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 130,
        "matchingEnglishURN": 1085535,
        "last_updated": null
    },
    {
        "arabicURN": 1145940,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "50.00",
        "hadithNumber": "4579",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْفِضَّةِ بِالذَّهَبِ وَبَيْعِ الذَّهَبِ بِالْفِضَّةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ مُحَمَّدِ بْنِ كَثِيرٍ الْحَرَّانِيُّ، قَالَ حَدَّثَنَا أَبُو تَوْبَةَ، قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ سَلاَّمٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، قَالَ نَهَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ نَبِيعَ الْفِضَّةَ بِالْفِضَّةِ إِلاَّ عَيْنًا بِعَيْنٍ سَوَاءً بِسَوَاءٍ وَلاَ نَبِيعَ الذَّهَبَ بِالذَّهَبِ إِلاَّ عَيْنًا بِعَيْنٍ سَوَاءً بِسَوَاءٍ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَبَايَعُوا الذَّهَبَ بِالْفِضَّةِ كَيْفَ شِئْتُمْ وَالْفِضَّةَ بِالذَّهَبِ كَيْفَ شِئْتُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 131,
        "matchingEnglishURN": 1085540,
        "last_updated": null
    },
    {
        "arabicURN": 1145950,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "50.00",
        "hadithNumber": "4580",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْفِضَّةِ بِالذَّهَبِ وَبَيْعِ الذَّهَبِ بِالْفِضَّةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ، سَمِعَ ابْنَ عَبَّاسٍ، يَقُولُ حَدَّثَنِي أُسَامَةُ بْنُ زَيْدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ رِبًا إِلاَّ فِي النَّسِيئَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 132,
        "matchingEnglishURN": 1085545,
        "last_updated": null
    },
    {
        "arabicURN": 1145960,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "50.00",
        "hadithNumber": "4581",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْفِضَّةِ بِالذَّهَبِ وَبَيْعِ الذَّهَبِ بِالْفِضَّةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ أَبِي صَالِحٍ، سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ قُلْتُ لاِبْنِ عَبَّاسٍ أَرَأَيْتَ هَذَا الَّذِي تَقُولُ أَشَيْئًا وَجَدْتَهُ فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ أَوْ شَيْئًا سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ مَا وَجَدْتُهُ فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ وَلاَ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلَكِنْ أُسَامَةُ بْنُ زَيْدٍ أَخْبَرَنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّمَا الرِّبَا فِي النَّسِيئَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 133,
        "matchingEnglishURN": 1085550,
        "last_updated": null
    },
    {
        "arabicURN": 1145970,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "50.00",
        "hadithNumber": "4582",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْفِضَّةِ بِالذَّهَبِ وَبَيْعِ الذَّهَبِ بِالْفِضَّةِ ‏‏ ",
        "hadithText": "أَخْبَرَنِي أَحْمَدُ بْنُ يَحْيَى، عَنْ أَبِي نُعَيْمٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عُمَرَ، قَالَ كُنْتُ أَبِيعُ الإِبِلَ بِالْبَقِيعِ فَأَبِيعُ بِالدَّنَانِيرِ وَآخُذُ الدَّرَاهِمَ فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فِي بَيْتِ حَفْصَةَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أُرِيدُ أَنْ أَسْأَلَكَ إِنِّي أَبِيعُ الإِبِلَ بِالْبَقِيعِ فَأَبِيعُ بِالدَّنَانِيرِ وَآخُذُ الدَّرَاهِمَ قَالَ ‏\"‏ لاَ بَأْسَ أَنْ تَأْخُذَهَا بِسِعْرِ يَوْمِهَا مَا لَمْ تَفْتَرِقَا وَبَيْنَكُمَا شَىْءٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 134,
        "matchingEnglishURN": 1085555,
        "last_updated": null
    },
    {
        "arabicURN": 1145980,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "51.00",
        "hadithNumber": "4583",
        "bookName": " كتاب البيوع",
        "babName": " باب أَخْذِ الْوَرِقِ مِنَ الذَّهَبِ وَالذَّهَبِ مِنَ الْوَرِقِ وَذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ ابْنِ عُمَرَ فِيهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ سِمَاكٍ، عَنِ ابْنِ جُبَيْرٍ، عَنِ ابْنِ عُمَرَ، قَالَ كُنْتُ أَبِيعُ الذَّهَبَ بِالْفِضَّةِ أَوِ الْفِضَّةَ بِالذَّهَبِ فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَخْبَرْتُهُ بِذَلِكَ فَقَالَ ‏\"‏ إِذَا بَايَعْتَ صَاحِبَكَ فَلاَ تُفَارِقْهُ وَبَيْنَكَ وَبَيْنَهُ لَبْسٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 135,
        "matchingEnglishURN": 1085560,
        "last_updated": null
    },
    {
        "arabicURN": 1145990,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "51.00",
        "hadithNumber": "4584",
        "bookName": " كتاب البيوع",
        "babName": " باب أَخْذِ الْوَرِقِ مِنَ الذَّهَبِ وَالذَّهَبِ مِنَ الْوَرِقِ وَذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ ابْنِ عُمَرَ فِيهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ أَنْبَأَنَا مُوسَى بْنُ نَافِعٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، أَنَّهُ كَانَ يَكْرَهُ أَنْ يَأْخُذَ، الدَّنَانِيرَ مِنَ الدَّرَاهِمِ وَالدَّرَاهِمَ مِنَ الدَّنَانِيرِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 136,
        "matchingEnglishURN": 1085565,
        "last_updated": null
    },
    {
        "arabicURN": 1146000,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "51.00",
        "hadithNumber": "4585",
        "bookName": " كتاب البيوع",
        "babName": " باب أَخْذِ الْوَرِقِ مِنَ الذَّهَبِ وَالذَّهَبِ مِنَ الْوَرِقِ وَذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ ابْنِ عُمَرَ فِيهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ أَنْبَأَنَا مُؤَمَّلٌ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي هَاشِمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ كَانَ لاَ يَرَى بَأْسًا - يَعْنِي - فِي قَبْضِ الدَّرَاهِمِ مِنَ الدَّنَانِيرِ وَالدَّنَانِيرِ مِنَ الدَّرَاهِمِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 137,
        "matchingEnglishURN": 1085570,
        "last_updated": null
    },
    {
        "arabicURN": 1146010,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "51.00",
        "hadithNumber": "4586",
        "bookName": " كتاب البيوع",
        "babName": " باب أَخْذِ الْوَرِقِ مِنَ الذَّهَبِ وَالذَّهَبِ مِنَ الْوَرِقِ وَذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ ابْنِ عُمَرَ فِيهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الْهُذَيْلِ، عَنْ إِبْرَاهِيمَ، فِي قَبْضِ الدَّنَانِيرِ مِنَ الدَّرَاهِمِ أَنَّهُ كَانَ يَكْرَهُهَا إِذَا كَانَ مِنْ قَرْضٍ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 138,
        "matchingEnglishURN": 1085575,
        "last_updated": null
    },
    {
        "arabicURN": 1146020,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "51.00",
        "hadithNumber": "4587",
        "bookName": " كتاب البيوع",
        "babName": " باب أَخْذِ الْوَرِقِ مِنَ الذَّهَبِ وَالذَّهَبِ مِنَ الْوَرِقِ وَذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ ابْنِ عُمَرَ فِيهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مُوسَى أَبِي شِهَابٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، أَنَّهُ كَانَ لاَ يَرَى بَأْسًا وَإِنْ كَانَ مِنْ قَرْضٍ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 139,
        "matchingEnglishURN": 1085580,
        "last_updated": null
    },
    {
        "arabicURN": 1146030,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "51.00",
        "hadithNumber": "4588",
        "bookName": " كتاب البيوع",
        "babName": " باب أَخْذِ الْوَرِقِ مِنَ الذَّهَبِ وَالذَّهَبِ مِنَ الْوَرِقِ وَذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ ابْنِ عُمَرَ فِيهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا مُوسَى بْنُ نَافِعٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، بِمِثْلِهِ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ كَذَا وَجَدْتُهُ فِي هَذَا الْمَوْضِعِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 140,
        "matchingEnglishURN": 1085585,
        "last_updated": null
    },
    {
        "arabicURN": 1146040,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "52.00",
        "hadithNumber": "4589",
        "bookName": " كتاب البيوع",
        "babName": " باب أَخْذِ الْوَرِقِ مِنَ الذَّهَبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَمَّارٍ، قَالَ حَدَّثَنَا الْمُعَافَى، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عُمَرَ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَقُلْتُ رُوَيْدَكَ أَسْأَلُكَ إِنِّي أَبِيعُ الإِبِلَ بِالْبَقِيعِ بِالدَّنَانِيرِ وَآخُذُ الدَّرَاهِمَ ‏.‏ قَالَ ‏\"‏ لاَ بَأْسَ أَنْ تَأْخُذَ بِسِعْرِ يَوْمِهَا مَا لَمْ تَفْتَرِقَا وَبَيْنَكُمَا شَىْءٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 141,
        "matchingEnglishURN": 1085590,
        "last_updated": null
    },
    {
        "arabicURN": 1146050,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "53.00",
        "hadithNumber": "4590",
        "bookName": " كتاب البيوع",
        "babName": " باب الزِّيَادَةِ فِي الْوَزْنِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ شُعْبَةَ، قَالَ أَخْبَرَنِي مُحَارِبُ بْنُ دِثَارٍ، عَنْ جَابِرٍ، قَالَ لَمَّا قَدِمَ النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ دَعَا بِمِيزَانٍ فَوَزَنَ لِي وَزَادَنِي ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 142,
        "matchingEnglishURN": 1085593,
        "last_updated": null
    },
    {
        "arabicURN": 1146060,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "53.00",
        "hadithNumber": "4591",
        "bookName": " كتاب البيوع",
        "babName": " باب الزِّيَادَةِ فِي الْوَزْنِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، عَنْ سُفْيَانَ، عَنْ مِسْعَرٍ، عَنْ مُحَارِبِ بْنِ دِثَارٍ، عَنْ جَابِرٍ، قَالَ قَضَانِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَزَادَنِي ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 143,
        "matchingEnglishURN": 1085595,
        "last_updated": null
    },
    {
        "arabicURN": 1146070,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "54.00",
        "hadithNumber": "4592",
        "bookName": " كتاب البيوع",
        "babName": " باب الرُّجْحَانِ فِي الْوَزْنِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ سِمَاكٍ، عَنْ سُوَيْدِ بْنِ قَيْسٍ، قَالَ جَلَبْتُ أَنَا وَمَخْرَفَةُ الْعَبْدِيُّ، بَزًّا مِنْ هَجَرَ فَأَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَنَحْنُ بِمِنًى وَوَزَّانٌ يَزِنُ بِالأَجْرِ فَاشْتَرَى مِنَّا سَرَاوِيلَ فَقَالَ لِلْوَزَّانِ ‏\"‏ زِنْ وَأَرْجِحْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 144,
        "matchingEnglishURN": 1085600,
        "last_updated": null
    },
    {
        "arabicURN": 1146080,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "54.00",
        "hadithNumber": "4593",
        "bookName": " كتاب البيوع",
        "babName": " باب الرُّجْحَانِ فِي الْوَزْنِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، عَنْ مُحَمَّدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، قَالَ سَمِعْتُ أَبَا صَفْوَانَ، قَالَ بِعْتُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم سَرَاوِيلَ قَبْلَ الْهِجْرَةِ فَأَرْجَحَ لِي ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 145,
        "matchingEnglishURN": 1085605,
        "last_updated": null
    },
    {
        "arabicURN": 1146090,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "54.00",
        "hadithNumber": "4594",
        "bookName": " كتاب البيوع",
        "babName": " باب الرُّجْحَانِ فِي الْوَزْنِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، عَنِ الْمُلاَئِيِّ، عَنْ سُفْيَانَ، ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا أَبُو نُعَيْمٍ، عَنْ سُفْيَانَ، عَنْ حَنْظَلَةَ، عَنْ طَاوُسٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْمِكْيَالُ عَلَى مِكْيَالِ أَهْلِ الْمَدِينَةِ وَالْوَزْنُ عَلَى وَزْنِ أَهْلِ مَكَّةَ ‏\"‏ ‏.‏ وَاللَّفْظُ لإِسْحَاقَ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 146,
        "matchingEnglishURN": 1085610,
        "last_updated": null
    },
    {
        "arabicURN": 1146100,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "55.00",
        "hadithNumber": "4595",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 147,
        "matchingEnglishURN": 1085615,
        "last_updated": null
    },
    {
        "arabicURN": 1146110,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "55.00",
        "hadithNumber": "4596",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَقْبِضَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 148,
        "matchingEnglishURN": 1085620,
        "last_updated": null
    },
    {
        "arabicURN": 1146120,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "55.00",
        "hadithNumber": "4597",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا قَاسِمٌ، عَنْ سُفْيَانَ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِيعُهُ حَتَّى يَكْتَالَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 149,
        "matchingEnglishURN": 1085625,
        "last_updated": null
    },
    {
        "arabicURN": 1146130,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "55.00",
        "hadithNumber": "4598",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ عَمْرٍو، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم بِمِثْلِهِ وَالَّذِي قَبْلَهُ حَتَّى يَقْبِضَهُ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 150,
        "matchingEnglishURN": 1085630,
        "last_updated": null
    },
    {
        "arabicURN": 1146140,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "55.00",
        "hadithNumber": "4599",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ طَاوُسٍ، عَنْ طَاوُسٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ أَمَّا الَّذِي نَهَى عَنْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُبَاعَ حَتَّى يُسْتَوْفَى الطَّعَامُ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 151,
        "matchingEnglishURN": 1085635,
        "last_updated": null
    },
    {
        "arabicURN": 1146150,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "55.00",
        "hadithNumber": "4600",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِيعُهُ حَتَّى يَقْبِضَهُ ‏\"‏ ‏.‏ قَالَ ابْنُ عَبَّاسٍ فَأَحْسَبُ أَنَّ كُلَّ شَىْءٍ بِمَنْزِلَةِ الطَّعَامِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 152,
        "matchingEnglishURN": 1085640,
        "last_updated": null
    },
    {
        "arabicURN": 1146160,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "55.00",
        "hadithNumber": "4601",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى ‏‏ ",
        "hadithText": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ، عَنْ حَجَّاجِ بْنِ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ، عَنْ صَفْوَانَ بْنِ مَوْهَبٍ، أَنَّهُ أَخْبَرَهُ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ صَيْفِيٍّ، عَنْ حَكِيمِ بْنِ حِزَامٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَبِعْ طَعَامًا حَتَّى تَشْتَرِيَهُ وَتَسْتَوْفِيَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 153,
        "matchingEnglishURN": 1085645,
        "last_updated": null
    },
    {
        "arabicURN": 1146170,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "55.00",
        "hadithNumber": "4602",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ قَالَ ابْنُ جُرَيْجٍ وَأَخْبَرَنِي عَطَاءٌ، ذَلِكَ عَنْ عَبْدِ اللَّهِ بْنِ عِصْمَةَ الْجُشَمِيِّ، عَنْ حَكِيمِ بْنِ حِزَامٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 154,
        "matchingEnglishURN": 1085650,
        "last_updated": null
    },
    {
        "arabicURN": 1146180,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "55.00",
        "hadithNumber": "4603",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى ‏‏ ",
        "hadithText": "أَخْبَرَنَا سُلَيْمَانُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ حِزَامِ بْنِ حَكِيمٍ، قَالَ قَالَ حَكِيمُ بْنُ حِزَامٍ ابْتَعْتُ طَعَامًا مِنْ طَعَامِ الصَّدَقَةِ فَرَبِحْتُ فِيهِ قَبْلَ أَنْ أَقْبِضَهُ فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ ‏\"‏ لاَ تَبِعْهُ حَتَّى تَقْبِضَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 155,
        "matchingEnglishURN": 1085655,
        "last_updated": null
    },
    {
        "arabicURN": 1146190,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "56.00",
        "hadithNumber": "4604",
        "bookName": " كتاب البيوع",
        "babName": " باب النَّهْىِ عَنْ بَيْعِ، مَا اشْتُرِيَ مِنَ الطَّعَامِ بِكَيْلٍ حَتَّى يُسْتَوْفَى ‏‏ ",
        "hadithText": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنِ الْمُنْذِرِ بْنِ عُبَيْدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى أَنْ يَبِيعَ أَحَدٌ طَعَامًا اشْتَرَاهُ بِكَيْلٍ حَتَّى يَسْتَوْفِيَهُ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 156,
        "matchingEnglishURN": 1085660,
        "last_updated": null
    },
    {
        "arabicURN": 1146200,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "57.00",
        "hadithNumber": "4605",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ مَا يُشْتَرَى مِنَ الطَّعَامِ جُزَافًا قَبْلَ أَنْ يُنْقَلَ مِنْ مَكَانِهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ كُنَّا فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم نَبْتَاعُ الطَّعَامَ فَيَبْعَثُ عَلَيْنَا مَنْ يَأْمُرُنَا بِانْتِقَالِهِ مِنَ الْمَكَانِ الَّذِي ابْتَعْنَا فِيهِ إِلَى مَكَانٍ سِوَاهُ قَبْلَ أَنْ نَبِيعَهُ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 157,
        "matchingEnglishURN": 1085665,
        "last_updated": null
    },
    {
        "arabicURN": 1146210,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "57.00",
        "hadithNumber": "4606",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ مَا يُشْتَرَى مِنَ الطَّعَامِ جُزَافًا قَبْلَ أَنْ يُنْقَلَ مِنْ مَكَانِهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّهُمْ كَانُوا يَبْتَاعُونَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي أَعْلَى السُّوقِ جُزَافًا فَنَهَاهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَبِيعُوهُ فِي مَكَانِهِ حَتَّى يَنْقُلُوهُ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 158,
        "matchingEnglishURN": 1085670,
        "last_updated": null
    },
    {
        "arabicURN": 1146220,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "57.00",
        "hadithNumber": "4607",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ مَا يُشْتَرَى مِنَ الطَّعَامِ جُزَافًا قَبْلَ أَنْ يُنْقَلَ مِنْ مَكَانِهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ، عَنْ أَبِيهِ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، حَدَّثَهُمْ أَنَّهُمْ، كَانُوا يَبْتَاعُونَ الطَّعَامَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنَ الرُّكْبَانِ فَنَهَاهُمْ أَنْ يَبِيعُوا فِي مَكَانِهِمُ الَّذِي ابْتَاعُوا فِيهِ حَتَّى يَنْقُلُوهُ إِلَى سُوقِ الطَّعَامِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 159,
        "matchingEnglishURN": 1085675,
        "last_updated": null
    },
    {
        "arabicURN": 1146230,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "57.00",
        "hadithNumber": "4608",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ مَا يُشْتَرَى مِنَ الطَّعَامِ جُزَافًا قَبْلَ أَنْ يُنْقَلَ مِنْ مَكَانِهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَزِيدُ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ رَأَيْتُ النَّاسَ يُضْرَبُونَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذَا اشْتَرَوُا الطَّعَامَ جُزَافًا أَنْ يَبِيعُوهُ حَتَّى يُئْوُوهُ إِلَى رِحَالِهِمْ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 160,
        "matchingEnglishURN": 1085680,
        "last_updated": null
    },
    {
        "arabicURN": 1146240,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "58.00",
        "hadithNumber": "4609",
        "bookName": " كتاب البيوع",
        "babName": " باب الرَّجُلِ يَشْتَرِي الطَّعَامَ إِلَى أَجَلٍ وَيَسْتَرْهِنُ الْبَائِعَ مِنْهُ بِالثَّمَنِ رَهْنًا ‏.‏  ",
        "hadithText": "أَخْبَرَنِي مُحَمَّدُ بْنُ آدَمَ، عَنْ حَفْصِ بْنِ غِيَاثٍ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتِ اشْتَرَى رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ يَهُودِيٍّ طَعَامًا إِلَى أَجَلٍ وَرَهَنَهُ دِرْعَهُ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 161,
        "matchingEnglishURN": 1085685,
        "last_updated": null
    },
    {
        "arabicURN": 1146250,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "59.00",
        "hadithNumber": "4610",
        "bookName": " كتاب البيوع",
        "babName": " باب الرَّهْنِ فِي الْحَضَرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا هِشَامٌ، قَالَ حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ مَشَى إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِخُبْزِ شَعِيرٍ وَإِهَالَةٍ سَنِخَةٍ ‏.‏ قَالَ وَلَقَدْ رَهَنَ دِرْعًا لَهُ عِنْدَ يَهُودِيٍّ بِالْمَدِينَةِ وَأَخَذَ مِنْهُ شَعِيرًا لأَهْلِهِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 162,
        "matchingEnglishURN": 1085690,
        "last_updated": null
    },
    {
        "arabicURN": 1146260,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "60.00",
        "hadithNumber": "4611",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ مَا لَيْسَ عِنْدَ الْبَائِعِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، وَحُمَيْدُ بْنُ مَسْعَدَةَ، عَنْ يَزِيدَ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَحِلُّ سَلَفٌ وَبَيْعٌ وَلاَ شَرْطَانِ فِي بَيْعٍ وَلاَ بَيْعُ مَا لَيْسَ عِنْدَكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 163,
        "matchingEnglishURN": 1085695,
        "last_updated": null
    },
    {
        "arabicURN": 1146270,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "60.00",
        "hadithNumber": "4612",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ مَا لَيْسَ عِنْدَ الْبَائِعِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عُثْمَانُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، عَنْ عَبَّادِ بْنِ الْعَوَّامِ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ أَبِي رَجَاءٍ، - قَالَ عُثْمَانُ هُوَ مُحَمَّدُ بْنُ سَيْفٍ - عَنْ مَطَرٍ الْوَرَّاقِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَيْسَ عَلَى رَجُلٍ بَيْعٌ فِيمَا لاَ يَمْلِكُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 164,
        "matchingEnglishURN": 1085700,
        "last_updated": null
    },
    {
        "arabicURN": 1146280,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "60.00",
        "hadithNumber": "4613",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ مَا لَيْسَ عِنْدَ الْبَائِعِ ‏‏ ",
        "hadithText": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا هُشَيْمٌ، قَالَ حَدَّثَنَا أَبُو بِشْرٍ، عَنْ يُوسُفَ بْنِ مَاهَكَ، عَنْ حَكِيمِ بْنِ حِزَامٍ، قَالَ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ يَأْتِينِي الرَّجُلُ فَيَسْأَلُنِي الْبَيْعَ لَيْسَ عِنْدِي أَبِيعُهُ مِنْهُ ثُمَّ أَبْتَاعُهُ لَهُ مِنَ السُّوقِ ‏.‏ قَالَ ‏\"‏ لاَ تَبِعْ مَا لَيْسَ عِنْدَكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 165,
        "matchingEnglishURN": 1085705,
        "last_updated": null
    },
    {
        "arabicURN": 1146290,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "61.00",
        "hadithNumber": "4614",
        "bookName": " كتاب البيوع",
        "babName": " باب السَّلَمِ فِي الطَّعَامِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي الْمُجَالِدِ، قَالَ سَأَلْتُ ابْنَ أَبِي أَوْفَى عَنِ السَّلَفِ، قَالَ كُنَّا نُسْلِفُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبِي بَكْرٍ وَعُمَرَ فِي الْبُرِّ وَالشَّعِيرِ وَالتَّمْرِ إِلَى قَوْمٍ لاَ أَدْرِي أَعِنْدَهُمْ أَمْ لاَ ‏.‏ وَابْنُ أَبْزَى قَالَ مِثْلَ ذَلِكَ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 166,
        "matchingEnglishURN": 1085710,
        "last_updated": null
    },
    {
        "arabicURN": 1146300,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "62.00",
        "hadithNumber": "4615",
        "bookName": " كتاب البيوع",
        "babName": " باب السَّلَمِ فِي الزَّبِيبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ أَنْبَأَنَا شُعْبَةُ، قَالَ حَدَّثَنَا ابْنُ أَبِي الْمُجَالِدِ، - وَقَالَ مَرَّةً عَبْدُ اللَّهِ وَقَالَ مَرَّةً مُحَمَّدٌ - قَالَ تَمَارَى أَبُو بُرْدَةَ وَعَبْدُ اللَّهِ بْنُ شَدَّادٍ فِي السَّلَمِ فَأَرْسَلُونِي إِلَى ابْنِ أَبِي أَوْفَى فَسَأَلْتُهُ فَقَالَ كُنَّا نُسْلِمُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَعَلَى عَهْدِ أَبِي بَكْرٍ وَعَلَى عَهْدِ عُمَرَ فِي الْبُرِّ وَالشَّعِيرِ وَالزَّبِيبِ وَالتَّمْرِ إِلَى قَوْمٍ مَا نُرَى عِنْدَهُمْ ‏.‏ وَسَأَلْتُ ابْنَ أَبْزَى فَقَالَ مِثْلَ ذَلِكَ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 167,
        "matchingEnglishURN": 1085715,
        "last_updated": null
    },
    {
        "arabicURN": 1146310,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "63.00",
        "hadithNumber": "4616",
        "bookName": " كتاب البيوع",
        "babName": " باب السَّلَفِ فِي الثِّمَارِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرٍ، عَنْ أَبِي الْمِنْهَالِ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، قَالَ قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ وَهُمْ يُسْلِفُونَ فِي التَّمْرِ السَّنَتَيْنِ وَالثَّلاَثَ فَنَهَاهُمْ وَقَالَ ‏\"‏ مَنْ أَسْلَفَ سَلَفًا فَلْيُسْلِفْ فِي كَيْلٍ مَعْلُومٍ وَوَزْنٍ مَعْلُومٍ إِلَى أَجَلٍ مَعْلُومٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 168,
        "matchingEnglishURN": 1085720,
        "last_updated": null
    },
    {
        "arabicURN": 1146320,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "64.00",
        "hadithNumber": "4617",
        "bookName": " كتاب البيوع",
        "babName": " باب اسْتِسْلاَفِ الْحَيَوَانِ وَاسْتِقْرَاضِهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي رَافِعٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَسْلَفَ مِنْ رَجُلٍ بَكْرًا فَأَتَاهُ يَتَقَاضَاهُ بَكْرَهُ فَقَالَ لِرَجُلٍ ‏\"‏ انْطَلِقْ فَابْتَعْ لَهُ بَكْرًا ‏\"‏ ‏.‏ فَأَتَاهُ فَقَالَ مَا أَصَبْتُ إِلاَّ بَكْرًا رَبَاعِيًّا خِيَارًا ‏.‏ فَقَالَ ‏\"‏ أَعْطِهِ فَإِنَّ خَيْرَ الْمُسْلِمِينَ أَحْسَنُهُمْ قَضَاءً ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 169,
        "matchingEnglishURN": 1085725,
        "last_updated": null
    },
    {
        "arabicURN": 1146330,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "64.00",
        "hadithNumber": "4618",
        "bookName": " كتاب البيوع",
        "babName": " باب اسْتِسْلاَفِ الْحَيَوَانِ وَاسْتِقْرَاضِهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ لِرَجُلٍ عَلَى النَّبِيِّ صلى الله عليه وسلم سِنٌّ مِنَ الإِبِلِ فَجَاءَ يَتَقَاضَاهُ فَقَالَ ‏\"‏ أَعْطُوهُ ‏\"‏ ‏.‏ فَلَمْ يَجِدُوا إِلاَّ سِنًّا فَوْقَ سِنِّهِ قَالَ ‏\"‏ أَعْطُوهُ ‏\"‏ ‏.‏ فَقَالَ أَوْفَيْتَنِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ خِيَارَكُمْ أَحْسَنُكُمْ قَضَاءً ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 170,
        "matchingEnglishURN": 1085730,
        "last_updated": null
    },
    {
        "arabicURN": 1146340,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "64.00",
        "hadithNumber": "4619",
        "bookName": " كتاب البيوع",
        "babName": " باب اسْتِسْلاَفِ الْحَيَوَانِ وَاسْتِقْرَاضِهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ، قَالَ سَمِعْتُ سَعِيدَ بْنَ هَانِئٍ، يَقُولُ سَمِعْتُ عِرْبَاضَ بْنَ سَارِيَةَ، يَقُولُ بِعْتُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم بَكْرًا فَأَتَيْتُهُ أَتَقَاضَاهُ فَقَالَ ‏\"‏ أَجَلْ لاَ أَقْضِيكَهَا إِلاَّ نَجِيبَةً ‏\"‏ ‏.‏ فَقَضَانِي فَأَحْسَنَ قَضَائِي وَجَاءَهُ أَعْرَابِيٌّ يَتَقَاضَاهُ سِنَّهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَعْطُوهُ سِنًّا ‏\"‏ ‏.‏ فَأَعْطَوْهُ يَوْمَئِذٍ جَمَلاً فَقَالَ هَذَا خَيْرٌ مِنْ سِنِّي ‏.‏ فَقَالَ ‏\"‏ خَيْرُكُمْ خَيْرُكُمْ قَضَاءً ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 171,
        "matchingEnglishURN": 1085735,
        "last_updated": null
    },
    {
        "arabicURN": 1146350,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "65.00",
        "hadithNumber": "4620",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْحَيَوَانِ بِالْحَيَوَانِ نَسِيئَةً ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَيَزِيدُ بْنُ زُرَيْعٍ، وَخَالِدُ بْنُ الْحَارِثِ، قَالُوا حَدَّثَنَا شُعْبَةُ، وَأَخْبَرَنِي أَحْمَدُ بْنُ فَضَالَةَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، قَالَ حَدَّثَنَا الْحَسَنُ بْنُ صَالِحٍ، عَنِ ابْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الْحَيَوَانِ بِالْحَيَوَانِ نَسِيئَةً ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 172,
        "matchingEnglishURN": 1085740,
        "last_updated": null
    },
    {
        "arabicURN": 1146360,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "66.00",
        "hadithNumber": "4621",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْحَيَوَانِ بِالْحَيَوَانِ يَدًا بِيَدٍ مُتَفَاضِلاً ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ جَاءَ عَبْدٌ فَبَايَعَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى الْهِجْرَةِ وَلاَ يَشْعُرُ النَّبِيُّ صلى الله عليه وسلم أَنَّهُ عَبْدٌ فَجَاءَ سَيِّدُهُ يُرِيدُهُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بِعْنِيهِ ‏\"‏ ‏.‏ فَاشْتَرَاهُ بِعَبْدَيْنِ أَسْوَدَيْنِ ثُمَّ لَمْ يُبَايِعْ أَحَدًا بَعْدُ حَتَّى يَسْأَلَهُ أَعَبْدٌ هُوَ",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 173,
        "matchingEnglishURN": 1085745,
        "last_updated": null
    },
    {
        "arabicURN": 1146370,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "67.00",
        "hadithNumber": "4622",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ حَبَلِ الْحَبَلَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا يَحْيَى بْنُ حَكِيمٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ السَّلَفُ فِي حَبَلِ الْحَبَلَةِ رِبًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 174,
        "matchingEnglishURN": 1085750,
        "last_updated": null
    },
    {
        "arabicURN": 1146380,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "67.00",
        "hadithNumber": "4623",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ حَبَلِ الْحَبَلَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ حَبَلِ الْحَبَلَةِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 175,
        "matchingEnglishURN": 1085755,
        "last_updated": null
    },
    {
        "arabicURN": 1146390,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "67.00",
        "hadithNumber": "4624",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ حَبَلِ الْحَبَلَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ حَبَلِ الْحَبَلَةِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 176,
        "matchingEnglishURN": 1085760,
        "last_updated": null
    },
    {
        "arabicURN": 1146400,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "68.00",
        "hadithNumber": "4625",
        "bookName": " كتاب البيوع",
        "babName": " باب تَفْسِيرِ ذَلِكَ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ حَبَلِ الْحَبَلَةِ وَكَانَ بَيْعًا يَتَبَايَعُهُ أَهْلُ الْجَاهِلِيَّةِ كَانَ الرَّجُلُ يَبْتَاعُ جَزُورًا إِلَى أَنْ تُنْتَجَ النَّاقَةُ ثُمَّ تُنْتَجَ الَّتِي فِي بَطْنِهَا ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 177,
        "matchingEnglishURN": 1085765,
        "last_updated": null
    },
    {
        "arabicURN": 1146410,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "69.00",
        "hadithNumber": "4626",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ السِّنِينَ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ السِّنِينَ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 178,
        "matchingEnglishURN": 1085770,
        "last_updated": null
    },
    {
        "arabicURN": 1146420,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "69.00",
        "hadithNumber": "4627",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ السِّنِينَ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ حُمَيْدٍ الأَعْرَجِ، عَنْ سُلَيْمَانَ، - وَهُوَ ابْنُ عَتِيقٍ - عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ السِّنِينَ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 179,
        "matchingEnglishURN": 1085775,
        "last_updated": null
    },
    {
        "arabicURN": 1146430,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "70.00",
        "hadithNumber": "4628",
        "bookName": " كتاب البيوع",
        "babName": " باب الْبَيْعِ إِلَى الأَجَلِ الْمَعْلُومِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ حَدَّثَنَا عُمَارَةُ بْنُ أَبِي حَفْصَةَ، قَالَ أَنْبَأَنَا عِكْرِمَةُ، عَنْ عَائِشَةَ، قَالَتْ كَانَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بُرْدَيْنِ قِطْرِيَّيْنِ وَكَانَ إِذَا جَلَسَ فَعَرِقَ فِيهِمَا ثَقُلاَ عَلَيْهِ وَقَدِمَ لِفُلاَنٍ الْيَهُودِيِّ بَزٌّ مِنَ الشَّأْمِ فَقُلْتُ لَوْ أَرْسَلْتَ إِلَيْهِ فَاشْتَرَيْتَ مِنْهُ ثَوْبَيْنِ إِلَى الْمَيْسَرَةِ ‏.‏ فَأَرْسَلَ إِلَيْهِ فَقَالَ قَدْ عَلِمْتُ مَا يُرِيدُ مُحَمَّدٌ إِنَّمَا يُرِيدُ أَنْ يَذْهَبَ بِمَالِي أَوْ يَذْهَبَ بِهِمَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَذَبَ قَدْ عَلِمَ أَنِّي مِنْ أَتْقَاهُمْ لِلَّهِ وَآدَاهُمْ لِلأَمَانَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 180,
        "matchingEnglishURN": 1085780,
        "last_updated": null
    },
    {
        "arabicURN": 1146440,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "71.00",
        "hadithNumber": "4629",
        "bookName": " كتاب البيوع",
        "babName": " باب سَلَفٍ وَبَيْعٍ وَهُوَ أَنْ يَبِيعَ السِّلْعَةَ عَلَى أَنْ يُسْلِفَهُ سَلَفًا ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، عَنْ خَالِدٍ، عَنْ حُسَيْنٍ الْمُعَلِّمِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ سَلَفٍ وَبَيْعٍ وَشَرْطَيْنِ فِي بَيْعٍ وَرِبْحِ مَا لَمْ يُضْمَنْ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 181,
        "matchingEnglishURN": 1085785,
        "last_updated": null
    },
    {
        "arabicURN": 1146450,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "72.00",
        "hadithNumber": "4630",
        "bookName": " كتاب البيوع",
        "babName": " باب شَرْطَانِ فِي بَيْعٍ وَهُوَ أَنْ يَقُولَ أَبِيعُكَ هَذِهِ السِّلْعَةَ إِلَى شَهْرٍ بِكَذَا وَإِلَى شَهْرَيْنِ بِكَذَا ‏.‏",
        "hadithText": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ، قَالَ حَدَّثَنَا أَيُّوبُ، قَالَ حَدَّثَنَا عَمْرُو بْنُ شُعَيْبٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ أَبِيهِ، حَتَّى ذَكَرَ عَبْدَ اللَّهِ بْنَ عَمْرٍو قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يَحِلُّ سَلَفٌ وَبَيْعٌ وَلاَ شَرْطَانِ فِي بَيْعٍ وَلاَ رِبْحُ مَا لَمْ يُضْمَنْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 182,
        "matchingEnglishURN": 1085790,
        "last_updated": null
    },
    {
        "arabicURN": 1146460,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "72.00",
        "hadithNumber": "4631",
        "bookName": " كتاب البيوع",
        "babName": " باب شَرْطَانِ فِي بَيْعٍ وَهُوَ أَنْ يَقُولَ أَبِيعُكَ هَذِهِ السِّلْعَةَ إِلَى شَهْرٍ بِكَذَا وَإِلَى شَهْرَيْنِ بِكَذَا ‏.‏",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ سَلَفٍ وَبَيْعٍ وَعَنْ شَرْطَيْنِ فِي بَيْعٍ وَاحِدٍ وَعَنْ بَيْعِ مَا لَيْسَ عِنْدَكَ وَعَنْ رِبْحِ مَا لَمْ يُضْمَنْ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 183,
        "matchingEnglishURN": 1085795,
        "last_updated": null
    },
    {
        "arabicURN": 1146470,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "73.00",
        "hadithNumber": "4632",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعَتَيْنِ فِي بَيْعَةٍ وَهُوَ أَنْ يَقُولَ أَبِيعُكَ هَذِهِ السِّلْعَةَ بِمِائَةِ دِرْهَمٍ نَقْدًا وَبِمِائَتَىْ دِرْهَمٍ نَسِيئَةً ‏.‏",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالُوا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو، قَالَ حَدَّثَنَا أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعَتَيْنِ فِي بَيْعَةٍ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 184,
        "matchingEnglishURN": 1085800,
        "last_updated": null
    },
    {
        "arabicURN": 1146480,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "74.00",
        "hadithNumber": "4633",
        "bookName": " كتاب البيوع",
        "babName": " باب النَّهْىِ عَنْ بَيْعِ الثُّنْيَا، حَتَّى تُعْلَمَ ‏‏ ",
        "hadithText": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ، قَالَ حَدَّثَنَا سُفْيَانُ بْنُ حُسَيْنٍ، قَالَ حَدَّثَنَا يُونُسُ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ وَالْمُخَابَرَةِ وَعَنِ الثُّنْيَا إِلاَّ أَنْ تُعْلَمَ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 185,
        "matchingEnglishURN": 1085805,
        "last_updated": null
    },
    {
        "arabicURN": 1146490,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "74.00",
        "hadithNumber": "4634",
        "bookName": " كتاب البيوع",
        "babName": " باب النَّهْىِ عَنْ بَيْعِ الثُّنْيَا، حَتَّى تُعْلَمَ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ أَيُّوبَ، وَأَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ، قَالَ أَنْبَأَنَا أَيُّوبُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ وَالْمُخَابَرَةِ وَالْمُعَاوَمَةِ وَالثُّنْيَا وَرَخَّصَ فِي الْعَرَايَا ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 186,
        "matchingEnglishURN": 1085810,
        "last_updated": null
    },
    {
        "arabicURN": 1146500,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "75.00",
        "hadithNumber": "4635",
        "bookName": " كتاب البيوع",
        "babName": " باب النَّخْلِ يُبَاعُ أَصْلُهَا وَيَسْتَثْنِي الْمُشْتَرِي ثَمَرَهَا ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ أَيُّمَا امْرِئٍ أَبَّرَ نَخْلاً ثُمَّ بَاعَ أَصْلَهَا فَلِلَّذِي أَبَّرَ ثَمَرُ النَّخْلِ إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 187,
        "matchingEnglishURN": 1085815,
        "last_updated": null
    },
    {
        "arabicURN": 1146510,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "76.00",
        "hadithNumber": "4636",
        "bookName": " كتاب البيوع",
        "babName": " باب الْعَبْدِ يُبَاعُ وَيَسْتَثْنِي الْمُشْتَرِي مَالَهُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنِ ابْتَاعَ نَخْلاً بَعْدَ أَنْ تُؤَبَّرَ فَثَمَرَتُهَا لِلْبَائِعِ إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ وَمَنْ بَاعَ عَبْدًا وَلَهُ مَالٌ فَمَالُهُ لِلْبَائِعِ إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 188,
        "matchingEnglishURN": 1085820,
        "last_updated": null
    },
    {
        "arabicURN": 1146520,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "77.00",
        "hadithNumber": "4637",
        "bookName": " كتاب البيوع",
        "babName": " باب الْبَيْعِ يَكُونُ فِيهِ الشَّرْطُ فَيَصِحُّ الْبَيْعُ وَالشَّرْطُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا سَعْدَانُ بْنُ يَحْيَى، عَنْ زَكَرِيَّا، عَنْ عَامِرٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كُنْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ فَأَعْيَا جَمَلِي فَأَرَدْتُ أَنْ أُسَيِّبَهُ فَلَحِقَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَدَعَا لَهُ فَضَرَبَهُ فَسَارَ سَيْرًا لَمْ يَسِرْ مِثْلَهُ فَقَالَ ‏\"‏ بِعْنِيهِ بِوُقِيَّةٍ ‏\"‏ ‏.‏ قُلْتُ لاَ ‏.‏ قَالَ ‏\"‏ بِعْنِيهِ ‏\"‏ ‏.‏ فَبِعْتُهُ بِوُقِيَّةٍ وَاسْتَثْنَيْتُ حُمْلاَنَهُ إِلَى الْمَدِينَةِ فَلَمَّا بَلَغْنَا الْمَدِينَةَ أَتَيْتُهُ بِالْجَمَلِ وَابْتَغَيْتُ ثَمَنَهُ ثُمَّ رَجَعْتُ فَأَرْسَلَ إِلَىَّ فَقَالَ ‏\"‏ أَتُرَانِي إِنَّمَا مَاكَسْتُكَ لآخُذَ جَمَلَكَ خُذْ جَمَلَكَ وَدَرَاهِمَكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 189,
        "matchingEnglishURN": 1085825,
        "last_updated": null
    },
    {
        "arabicURN": 1146530,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "77.00",
        "hadithNumber": "4638",
        "bookName": " كتاب البيوع",
        "babName": " باب الْبَيْعِ يَكُونُ فِيهِ الشَّرْطُ فَيَصِحُّ الْبَيْعُ وَالشَّرْطُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى بْنِ الطَّبَّاعِ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مُغِيرَةَ، عَنِ الشَّعْبِيِّ، عَنْ جَابِرٍ، قَالَ غَزَوْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم عَلَى نَاضِحٍ لَنَا ثُمَّ ذَكَرْتُ الْحَدِيثَ بِطُولِهِ ثُمَّ ذَكَرَ كَلاَمًا مَعْنَاهُ فَأُزْحِفَ الْجَمَلُ فَزَجَرَهُ النَّبِيُّ صلى الله عليه وسلم فَانْتَشَطَ حَتَّى كَانَ أَمَامَ الْجَيْشِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يَا جَابِرُ مَا أَرَى جَمَلَكَ إِلاَّ قَدِ انْتَشَطَ ‏\"‏ ‏.‏ قُلْتُ بِبَرَكَتِكَ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ بِعْنِيهِ وَلَكَ ظَهْرُهُ حَتَّى تَقْدَمَ ‏\"‏ ‏.‏ فَبِعْتُهُ وَكَانَتْ لِي إِلَيْهِ حَاجَةٌ شَدِيدَةٌ وَلَكِنِّي اسْتَحْيَيْتُ مِنْهُ فَلَمَّا قَضَيْنَا غَزَاتَنَا وَدَنَوْنَا اسْتَأْذَنْتُهُ بِالتَّعْجِيلِ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي حَدِيثُ عَهْدٍ بِعُرْسٍ ‏.‏ قَالَ ‏\"‏ أَبِكْرًا تَزَوَّجْتَ أَمْ ثَيِّبًا ‏\"‏ ‏.‏ قُلْتُ بَلْ ثَيِّبًا يَا رَسُولَ اللَّهِ إِنَّ عَبْدَ اللَّهِ بْنَ عَمْرٍو أُصِيبَ وَتَرَكَ جَوَارِيَ أَبْكَارًا فَكَرِهْتُ أَنْ آتِيَهُنَّ بِمِثْلِهِنَّ فَتَزَوَّجْتُ ثَيِّبًا تُعَلِّمُهُنَّ وَتُؤَدِّبُهُنَّ فَأَذِنَ لِي وَقَالَ لِي ‏\"‏ ائْتِ أَهْلَكَ عِشَاءً ‏\"‏ ‏.‏ فَلَمَّا قَدِمْتُ أَخْبَرْتُ خَالِي بِبَيْعِيَ الْجَمَلَ فَلاَمَنِي فَلَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم غَدَوْتُ بِالْجَمَلِ فَأَعْطَانِي ثَمَنَ الْجَمَلِ وَالْجَمَلَ وَسَهْمًا مَعَ النَّاسِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 190,
        "matchingEnglishURN": 1085830,
        "last_updated": null
    },
    {
        "arabicURN": 1146540,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "77.00",
        "hadithNumber": "4639",
        "bookName": " كتاب البيوع",
        "babName": " باب الْبَيْعِ يَكُونُ فِيهِ الشَّرْطُ فَيَصِحُّ الْبَيْعُ وَالشَّرْطُ ‏‏ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كُنْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي سَفَرٍ وَكُنْتُ عَلَى جَمَلٍ فَقَالَ ‏\"‏ مَا لَكَ فِي آخِرِ النَّاسِ ‏\"‏ ‏.‏ قُلْتُ أَعْيَا بَعِيرِي فَأَخَذَ بِذَنَبِهِ ثُمَّ زَجَرَهُ فَإِنْ كُنْتُ إِنَّمَا أَنَا فِي أَوَّلِ النَّاسِ يُهِمُّنِي رَأْسُهُ فَلَمَّا دَنَوْنَا مِنَ الْمَدِينَةِ قَالَ ‏\"‏ مَا فَعَلَ الْجَمَلُ بِعْنِيهِ ‏\"‏ ‏.‏ قُلْتُ لاَ بَلْ هُوَ لَكَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ لاَ بَلْ بِعْنِيهِ ‏\"‏ ‏.‏ قُلْتُ لاَ بَلْ هُوَ لَكَ ‏.‏ قَالَ ‏\"‏ لاَ بَلْ بِعْنِيهِ قَدْ أَخَذْتُهُ بِوُقِيَّةٍ ارْكَبْهُ فَإِذَا قَدِمْتَ الْمَدِينَةَ فَائْتِنَا بِهِ ‏\"‏ ‏.‏ فَلَمَّا قَدِمْتُ الْمَدِينَةَ جِئْتُهُ بِهِ فَقَالَ لِبِلاَلٍ ‏\"‏ يَا بِلاَلُ زِنْ لَهُ أُوقِيَّةً وَزِدْهُ قِيرَاطًا ‏\"‏ ‏.‏ قُلْتُ هَذَا شَىْءٌ زَادَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمْ يُفَارِقْنِي فَجَعَلْتُهُ فِي كِيسٍ فَلَمْ يَزَلْ عِنْدِي حَتَّى جَاءَ أَهْلُ الشَّامِ يَوْمَ الْحَرَّةِ فَأَخَذُوا مِنَّا مَا أَخَذُوا ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 191,
        "matchingEnglishURN": 1085835,
        "last_updated": null
    },
    {
        "arabicURN": 1146550,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "77.00",
        "hadithNumber": "4640",
        "bookName": " كتاب البيوع",
        "babName": " باب الْبَيْعِ يَكُونُ فِيهِ الشَّرْطُ فَيَصِحُّ الْبَيْعُ وَالشَّرْطُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ أَدْرَكَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَكُنْتُ عَلَى نَاضِحٍ لَنَا سَوْءٍ فَقُلْتُ لاَ يَزَالُ لَنَا نَاضِحُ سَوْءٍ يَا لَهْفَاهُ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ تَبِيعُنِيهِ يَا جَابِرُ ‏\"‏ ‏.‏ قُلْتُ بَلْ هُوَ لَكَ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ اللَّهُمَّ اغْفِرْ لَهُ اللَّهُمَّ ارْحَمْهُ قَدْ أَخَذْتُهُ بِكَذَا وَكَذَا وَقَدْ أَعَرْتُكَ ظَهْرَهُ إِلَى الْمَدِينَةِ ‏\"‏ ‏.‏ فَلَمَّا قَدِمْتُ الْمَدِينَةَ هَيَّأْتُهُ فَذَهَبْتُ بِهِ إِلَيْهِ فَقَالَ ‏\"‏ يَا بِلاَلُ أَعْطِهِ ثَمَنَهُ ‏\"‏ ‏.‏ فَلَمَّا أَدْبَرْتُ دَعَانِي فَخِفْتُ أَنْ يَرُدَّهُ فَقَالَ ‏\"‏ هُوَ لَكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 192,
        "matchingEnglishURN": 1085840,
        "last_updated": null
    },
    {
        "arabicURN": 1146560,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "77.00",
        "hadithNumber": "4641",
        "bookName": " كتاب البيوع",
        "babName": " باب الْبَيْعِ يَكُونُ فِيهِ الشَّرْطُ فَيَصِحُّ الْبَيْعُ وَالشَّرْطُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ أَبِي قَالَ، حَدَّثَنَا أَبُو نَضْرَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كُنَّا نَسِيرُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَنَا عَلَى نَاضِحٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَبِيعُنِيهِ بِكَذَا وَكَذَا وَاللَّهُ يَغْفِرُ لَكَ ‏\"‏ ‏.‏ قُلْتُ نَعَمْ هُوَ لَكَ يَا نَبِيَّ اللَّهِ قَالَ ‏\"‏ أَتَبِيعُنِيهِ بِكَذَا وَكَذَا وَاللَّهُ يَغْفِرُ لَكَ ‏\"‏ ‏.‏ قُلْتُ نَعَمْ هُوَ لَكَ يَا نَبِيَّ اللَّهِ ‏.‏ قَالَ ‏\"‏ أَتَبِيعُنِيهِ بِكَذَا وَكَذَا وَاللَّهُ يَغْفِرُ لَكَ ‏\"‏ ‏.‏ قُلْتُ نَعَمْ هُوَ لَكَ ‏.‏ قَالَ أَبُو نَضْرَةَ وَكَانَتْ كَلِمَةً يَقُولُهَا الْمُسْلِمُونَ افْعَلْ كَذَا وَكَذَا وَاللَّهُ يَغْفِرُ لَكَ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 193,
        "matchingEnglishURN": 1085845,
        "last_updated": null
    },
    {
        "arabicURN": 1146570,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "78.00",
        "hadithNumber": "4642",
        "bookName": " كتاب البيوع",
        "babName": " باب الْبَيْعِ يَكُونُ فِيهِ الشَّرْطُ الْفَاسِدُ فَيَصِحُّ الْبَيْعُ وَيَبْطُلُ الشَّرْطُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتِ اشْتَرَيْتُ بَرِيرَةَ فَاشْتَرَطَ أَهْلُهَا وَلاَءَهَا فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَعْتِقِيهَا فَإِنَّ الْوَلاَءَ لِمَنْ أَعْطَى الْوَرِقَ ‏\"‏ ‏.‏ قَالَتْ فَأَعْتَقْتُهَا - قَالَتْ - فَدَعَاهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَخَيَّرَهَا مِنْ زَوْجِهَا فَاخْتَارَتْ نَفْسَهَا وَكَانَ زَوْجُهَا حُرًّا ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 194,
        "matchingEnglishURN": 1085850,
        "last_updated": null
    },
    {
        "arabicURN": 1146580,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "78.00",
        "hadithNumber": "4643",
        "bookName": " كتاب البيوع",
        "babName": " باب الْبَيْعِ يَكُونُ فِيهِ الشَّرْطُ الْفَاسِدُ فَيَصِحُّ الْبَيْعُ وَيَبْطُلُ الشَّرْطُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ، قَالَ سَمِعْتُ الْقَاسِمَ، يُحَدِّثُ عَنْ عَائِشَةَ، أَنَّهَا أَرَادَتْ أَنْ تَشْتَرِيَ، بَرِيرَةَ لِلْعِتْقِ وَأَنَّهُمُ اشْتَرَطُوا وَلاَءَهَا فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اشْتَرِيهَا فَأَعْتِقِيهَا فَإِنَّ الْوَلاَءَ لِمَنْ أَعْتَقَ ‏\"‏ ‏.‏ وَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِلَحْمٍ فَقِيلَ هَذَا تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ فَقَالَ ‏\"‏ هُوَ لَهَا صَدَقَةٌ وَلَنَا هَدِيَّةٌ ‏\"‏ ‏.‏ وَخُيِّرَتْ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 195,
        "matchingEnglishURN": 1085855,
        "last_updated": null
    },
    {
        "arabicURN": 1146590,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "78.00",
        "hadithNumber": "4644",
        "bookName": " كتاب البيوع",
        "babName": " باب الْبَيْعِ يَكُونُ فِيهِ الشَّرْطُ الْفَاسِدُ فَيَصِحُّ الْبَيْعُ وَيَبْطُلُ الشَّرْطُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عَائِشَةَ، أَرَادَتْ أَنْ تَشْتَرِيَ، جَارِيَةً تَعْتِقُهَا فَقَالَ أَهْلُهَا نَبِيعُكِهَا عَلَى أَنَّ الْوَلاَءَ لَنَا ‏.‏ فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ لاَ يَمْنَعُكِ ذَلِكَ فَإِنَّ الْوَلاَءَ لِمَنْ أَعْتَقَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 196,
        "matchingEnglishURN": 1085860,
        "last_updated": null
    },
    {
        "arabicURN": 1146600,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "79.00",
        "hadithNumber": "4645",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْمَغَانِمِ قَبْلَ أَنْ تُقْسَمَ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِبْرَاهِيمُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الْمَغَانِمِ حَتَّى تُقْسَمَ وَعَنِ الْحَبَالَى أَنْ يُوطَأْنَ حَتَّى يَضَعْنَ مَا فِي بُطُونِهِنَّ وَعَنْ لَحْمِ كُلِّ ذِي نَابٍ مِنَ السِّبَاعِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 197,
        "matchingEnglishURN": 1085865,
        "last_updated": null
    },
    {
        "arabicURN": 1146610,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "80.00",
        "hadithNumber": "4646",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْمَشَاعِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ، قَالَ أَنْبَأَنَا إِسْمَاعِيلُ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الشُّفْعَةُ فِي كُلِّ شِرْكٍ رَبْعَةٍ أَوْ حَائِطٍ لاَ يَصْلُحُ لَهُ أَنْ يَبِيعَ حَتَّى يُؤْذِنَ شَرِيكَهُ فَإِنْ بَاعَ فَهُوَ أَحَقُّ بِهِ حَتَّى يُؤْذِنَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 198,
        "matchingEnglishURN": 1085870,
        "last_updated": null
    },
    {
        "arabicURN": 1146620,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "81.00",
        "hadithNumber": "4647",
        "bookName": " كتاب البيوع",
        "babName": " باب التَّسْهِيلِ فِي تَرْكِ الإِشْهَادِ عَلَى الْبَيْعِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا الْهَيْثَمُ بْنُ مَرْوَانَ بْنِ الْهَيْثَمِ بْنِ عِمْرَانَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارٍ، قَالَ حَدَّثَنَا يَحْيَى، - وَهُوَ ابْنُ حَمْزَةَ - عَنِ الزُّبَيْدِيِّ، أَنَّ الزُّهْرِيَّ، أَخْبَرَهُ عَنْ عُمَارَةَ بْنِ خُزَيْمَةَ، أَنَّ عَمَّهُ، حَدَّثَهُ - وَهُوَ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم - أَنَّ النَّبِيَّ صلى الله عليه وسلم ابْتَاعَ فَرَسًا مِنْ أَعْرَابِيٍّ وَاسْتَتْبَعَهُ لِيَقْبِضَ ثَمَنَ فَرَسِهِ فَأَسْرَعَ النَّبِيُّ صلى الله عليه وسلم وَأَبْطَأَ الأَعْرَابِيُّ وَطَفِقَ الرِّجَالُ يَتَعَرَّضُونَ لِلأَعْرَابِيِّ فَيَسُومُونَهُ بِالْفَرَسِ وَهُمْ لاَ يَشْعُرُونَ أَنَّ النَّبِيَّ صلى الله عليه وسلم ابْتَاعَهُ حَتَّى زَادَ بَعْضُهُمْ فِي السَّوْمِ عَلَى مَا ابْتَاعَهُ بِهِ مِنْهُ فَنَادَى الأَعْرَابِيُّ النَّبِيَّ صلى الله عليه وسلم فَقَالَ إِنْ كُنْتَ مُبْتَاعًا هَذَا الْفَرَسَ وَإِلاَّ بِعْتُهُ ‏.‏ فَقَامَ النَّبِيُّ صلى الله عليه وسلم حِينَ سَمِعَ نِدَاءَهُ فَقَالَ ‏\"‏ أَلَيْسَ قَدِ ابْتَعْتُهُ مِنْكَ ‏\"‏ ‏.‏ قَالَ لاَ وَاللَّهِ مَا بِعْتُكَهُ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ قَدِ ابْتَعْتُهُ مِنْكَ ‏\"‏ ‏.‏ فَطَفِقَ النَّاسُ يَلُوذُونَ بِالنَّبِيِّ صلى الله عليه وسلم وَبِالأَعْرَابِيِّ وَهُمَا يَتَرَاجَعَانِ وَطَفِقَ الأَعْرَابِيُّ يَقُولُ هَلُمَّ شَاهِدًا يَشْهَدُ أَنِّي قَدْ بِعْتُكَهُ ‏.‏ قَالَ خُزَيْمَةُ بْنُ ثَابِتٍ أَنَا أَشْهَدُ أَنَّكَ قَدْ بِعْتَهُ ‏.‏ قَالَ فَأَقْبَلَ النَّبِيُّ صلى الله عليه وسلم عَلَى خُزَيْمَةَ فَقَالَ ‏\"‏ لِمَ تَشْهَدُ ‏\"‏ ‏.‏ قَالَ بِتَصْدِيقِكَ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ فَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم شَهَادَةَ خُزَيْمَةَ شَهَادَةَ رَجُلَيْنِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 199,
        "matchingEnglishURN": 1085875,
        "last_updated": null
    },
    {
        "arabicURN": 1146630,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "82.00",
        "hadithNumber": "4648",
        "bookName": " كتاب البيوع",
        "babName": " باب اخْتِلاَفِ الْمُتَبَايِعَيْنِ فِي الثَّمَنِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِدْرِيسَ، قَالَ حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، قَالَ حَدَّثَنَا أَبِي، عَنْ أَبِي عُمَيْسٍ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ الأَشْعَثِ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ عَبْدُ اللَّهِ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِذَا اخْتَلَفَ الْبَيِّعَانِ وَلَيْسَ بَيْنَهُمَا بَيِّنَةٌ فَهُوَ مَا يَقُولُ رَبُّ السِّلْعَةِ أَوْ يَتْرُكَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 200,
        "matchingEnglishURN": 1085880,
        "last_updated": null
    },
    {
        "arabicURN": 1146640,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "82.00",
        "hadithNumber": "4649",
        "bookName": " كتاب البيوع",
        "babName": " باب اخْتِلاَفِ الْمُتَبَايِعَيْنِ فِي الثَّمَنِ ‏‏ ",
        "hadithText": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ، وَيُوسُفُ بْنُ سَعِيدٍ، وَعَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ، - وَاللَّفْظُ لإِبْرَاهِيمَ - قَالُوا حَدَّثَنَا حَجَّاجٌ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي إِسْمَاعِيلُ بْنُ أُمَيَّةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُبَيْدٍ، قَالَ حَضَرْنَا أَبَا عُبَيْدَةَ بْنَ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ أَتَاهُ رَجُلاَنِ تَبَايَعَا سِلْعَةً فَقَالَ أَحَدُهُمَا أَخَذْتُهَا بِكَذَا وَبِكَذَا ‏.‏ وَقَالَ هَذَا بِعْتُهَا بِكَذَا وَكَذَا ‏.‏ فَقَالَ أَبُو عُبَيْدَةَ أُتِيَ ابْنُ مَسْعُودٍ فِي مِثْلِ هَذَا فَقَالَ حَضَرْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ بِمِثْلِ هَذَا فَأَمَرَ الْبَائِعَ أَنْ يَسْتَحْلِفَ ثُمَّ يَخْتَارَ الْمُبْتَاعُ فَإِنْ شَاءَ أَخَذَ وَإِنْ شَاءَ تَرَكَ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 201,
        "matchingEnglishURN": 1085885,
        "last_updated": null
    },
    {
        "arabicURN": 1146650,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "83.00",
        "hadithNumber": "4650",
        "bookName": " كتاب البيوع",
        "babName": " باب مُبَايَعَةِ أَهْلِ الْكِتَابِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتِ اشْتَرَى رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ يَهُودِيٍّ طَعَامًا بِنَسِيئَةٍ وَأَعْطَاهُ دِرْعًا لَهُ رَهْنًا ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 202,
        "matchingEnglishURN": 1085890,
        "last_updated": null
    },
    {
        "arabicURN": 1146660,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "83.00",
        "hadithNumber": "4651",
        "bookName": " كتاب البيوع",
        "babName": " باب مُبَايَعَةِ أَهْلِ الْكِتَابِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا يُوسُفُ بْنُ حَمَّادٍ، قَالَ حَدَّثَنَا سُفْيَانُ بْنُ حَبِيبٍ، عَنْ هِشَامٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَدِرْعُهُ مَرْهُونَةٌ عِنْدَ يَهُودِيٍّ بِثَلاَثِينَ صَاعًا مِنْ شَعِيرٍ لأَهْلِهِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 203,
        "matchingEnglishURN": 1085895,
        "last_updated": null
    },
    {
        "arabicURN": 1146670,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "84.00",
        "hadithNumber": "4652",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْمُدَبَّرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ أَعْتَقَ رَجُلٌ مِنْ بَنِي عُذْرَةَ عَبْدًا لَهُ عَنْ دُبُرٍ، فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَلَكَ مَالٌ غَيْرُهُ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ يَشْتَرِيهِ مِنِّي ‏\"‏ ‏.‏ فَاشْتَرَاهُ نُعَيْمُ بْنُ عَبْدِ اللَّهِ الْعَدَوِيُّ بِثَمَانِمِائَةِ دِرْهَمٍ فَجَاءَ بِهَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَدَفَعَهَا إِلَيْهِ ثُمَّ قَالَ ‏\"‏ ابْدَأْ بِنَفْسِكَ فَتَصَدَّقْ عَلَيْهَا فَإِنْ فَضَلَ شَىْءٌ فَلأَهْلِكَ فَإِنْ فَضَلَ مِنْ أَهْلِكَ شَىْءٌ فَلِذِي قَرَابَتِكَ فَإِنْ فَضَلَ مِنْ ذِي قَرَابَتِكَ شَىْءٌ فَهَكَذَا وَهَكَذَا وَهَكَذَا ‏\"‏ ‏.‏ يَقُولُ بَيْنَ يَدَيْكَ وَعَنْ يَمِينِكَ وَعَنْ شِمَالِكَ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 204,
        "matchingEnglishURN": 1085900,
        "last_updated": null
    },
    {
        "arabicURN": 1146680,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "84.00",
        "hadithNumber": "4653",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْمُدَبَّرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَجُلاً، مِنَ الأَنْصَارِ يُقَالُ لَهُ أَبُو مَذْكُورٍ أَعْتَقَ غُلامًا لَهُ عَنْ دُبُرٍ يُقَالُ لَهُ يَعْقُوبُ لَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ فَدَعَا بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَنْ يَشْتَرِيهِ ‏\"‏ ‏.‏ فَاشْتَرَاهُ نُعَيْمُ بْنُ عَبْدِ اللَّهِ بِثَمَانِمِائَةِ دِرْهَمٍ فَدَفَعَهَا إِلَيْهِ وَقَالَ ‏\"‏ إِذَا كَانَ أَحَدُكُمْ فَقِيرًا فَلْيَبْدَأْ بِنَفْسِهِ فَإِنْ كَانَ فَضْلاً فَعَلَى عِيَالِهِ فَإِنْ كَانَ فَضْلاً فَعَلَى قَرَابَتِهِ أَوْ عَلَى ذِي رَحِمِهِ فَإِنْ كَانَ فَضْلاً فَهَا هُنَا وَهَا هُنَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 205,
        "matchingEnglishURN": 1085905,
        "last_updated": null
    },
    {
        "arabicURN": 1146690,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "84.00",
        "hadithNumber": "4654",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْمُدَبَّرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا سُفْيَانُ، وَابْنُ أَبِي خَالِدٍ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم بَاعَ الْمُدَبَّرَ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 206,
        "matchingEnglishURN": 1085910,
        "last_updated": null
    },
    {
        "arabicURN": 1146700,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "85.00",
        "hadithNumber": "4655",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْمُكَاتِبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَخْبَرَتْهُ أَنَّ بَرِيرَةَ جَاءَتْ عَائِشَةَ تَسْتَعِينُهَا فِي كِتَابَتِهَا شَيْئًا فَقَالَتْ لَهَا عَائِشَةُ ارْجِعِي إِلَى أَهْلِكِ فَإِنْ أَحَبُّوا أَنْ أَقْضِيَ عَنْكِ كِتَابَتَكِ وَيَكُونَ وَلاَؤُكِ لِي فَعَلْتُ فَذَكَرَتْ ذَلِكَ بَرِيرَةُ لأَهْلِهَا فَأَبَوْا وَقَالُوا إِنْ شَاءَتْ أَنْ تَحْتَسِبَ عَلَيْكِ فَلْتَفْعَلْ وَيَكُونَ لَنَا وَلاَؤُكِ ‏.‏ فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ابْتَاعِي وَأَعْتِقِي فَإِنَّ الْوَلاَءَ لِمَنْ أَعْتَقَ ‏\"‏ ‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا بَالُ أَقْوَامٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ فَمَنِ اشْتَرَطَ شَيْئًا لَيْسَ فِي كِتَابِ اللَّهِ فَلَيْسَ لَهُ وَإِنِ اشْتَرَطَ مِائَةَ شَرْطٍ وَشَرْطُ اللَّهِ أَحَقُّ وَأَوْثَقُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 207,
        "matchingEnglishURN": 1085930,
        "last_updated": null
    },
    {
        "arabicURN": 1146710,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "86.00",
        "hadithNumber": "4656",
        "bookName": " كتاب البيوع",
        "babName": " باب الْمُكَاتَبِ يُبَاعُ قَبْلَ أَنْ يَقْضِيَ مِنْ كِتَابَتِهِ شَيْئًا ‏‏ ",
        "hadithText": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي رِجَالٌ، مِنْ أَهْلِ الْعِلْمِ مِنْهُمْ يُونُسُ وَاللَّيْثُ أَنَّ ابْنَ شِهَابٍ أَخْبَرَهُمْ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّهَا قَالَتْ جَاءَتْ بَرِيرَةُ إِلَىَّ فَقَالَتْ يَا عَائِشَةُ إِنِّي كَاتَبْتُ أَهْلِي عَلَى تِسْعِ أَوَاقٍ فِي كُلِّ عَامٍ أُوقِيَّةٌ فَأَعِينِينِي ‏.‏ وَلَمْ تَكُنْ قَضَتْ مِنْ كِتَابَتِهَا شَيْئًا فَقَالَتْ لَهَا عَائِشَةُ وَنَفِسَتْ فِيهَا ارْجِعِي إِلَى أَهْلِكِ فَإِنْ أَحَبُّوا أَنْ أُعْطِيَهُمْ ذَلِكَ جَمِيعًا وَيَكُونَ وَلاَؤُكِ لِي فَعَلْتُ ‏.‏ فَذَهَبَتْ بَرِيرَةُ إِلَى أَهْلِهَا فَعَرَضَتْ ذَلِكَ عَلَيْهِمْ فَأَبَوْا وَقَالُوا إِنْ شَاءَتْ أَنْ تَحْتَسِبَ عَلَيْكِ فَلْتَفْعَلْ وَيَكُونَ ذَلِكَ لَنَا ‏.‏ فَذَكَرَتْ ذَلِكَ عَائِشَةُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ لاَ يَمْنَعُكِ ذَلِكَ مِنْهَا ابْتَاعِي وَأَعْتِقِي فَإِنَّ الْوَلاَءَ لِمَنْ أَعْتَقَ ‏\"‏ ‏.‏ فَفَعَلَتْ وَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي النَّاسِ فَحَمِدَ اللَّهَ تَعَالَى ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ فَمَا بَالُ النَّاسِ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ مَنِ اشْتَرَطَ شَرْطًا لَيْسَ فِي كِتَابِ اللَّهِ فَهُوَ بَاطِلٌ وَإِنْ كَانَ مِائَةَ شَرْطٍ قَضَاءُ اللَّهِ أَحَقُّ وَشَرْطُ اللَّهِ أَوْثَقُ وَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 208,
        "matchingEnglishURN": 1085935,
        "last_updated": null
    },
    {
        "arabicURN": 1146720,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "87.00",
        "hadithNumber": "4657",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْوَلاَءِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ، رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الْوَلاَءِ وَعَنْ هِبَتِهِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 209,
        "matchingEnglishURN": 1085940,
        "last_updated": null
    },
    {
        "arabicURN": 1146730,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "87.00",
        "hadithNumber": "4658",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْوَلاَءِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الْوَلاَءِ وَعَنْ هِبَتِهِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 210,
        "matchingEnglishURN": 1085945,
        "last_updated": null
    },
    {
        "arabicURN": 1146740,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "87.00",
        "hadithNumber": "4659",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْوَلاَءِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ شُعْبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الْوَلاَءِ وَعَنْ هِبَتِهِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 211,
        "matchingEnglishURN": 1085950,
        "last_updated": null
    },
    {
        "arabicURN": 1146750,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "88.00",
        "hadithNumber": "4660",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْمَاءِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى السِّيْنَانِيُّ، عَنْ حُسَيْنِ بْنِ وَاقِدٍ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الْمَاءِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 212,
        "matchingEnglishURN": 1085955,
        "last_updated": null
    },
    {
        "arabicURN": 1146760,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "88.00",
        "hadithNumber": "4661",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْمَاءِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، وَعَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، - وَاللَّفْظُ لَهُ - قَالاَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، قَالَ سَمِعْتُ أَبَا الْمِنْهَالِ، يَقُولُ سَمِعْتُ إِيَاسَ بْنَ عُمَرَ، - وَقَالَ مَرَّةً ابْنَ عَبْدٍ - يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنْ بَيْعِ الْمَاءِ ‏.‏ قَالَ قُتَيْبَةُ لَمْ أَفْقَهْ عَنْهُ بَعْضَ حُرُوفِ أَبِي الْمِنْهَالِ كَمَا أَرَدْتُ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 213,
        "matchingEnglishURN": 1085960,
        "last_updated": null
    },
    {
        "arabicURN": 1146770,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "89.00",
        "hadithNumber": "4662",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ فَضْلِ الْمَاءِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا دَاوُدُ، عَنْ عَمْرٍو، عَنْ أَبِي الْمِنْهَالِ، عَنْ إِيَاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ فَضْلِ الْمَاءِ ‏.‏ وَبَاعَ قَيِّمُ الْوَهْطِ فَضْلَ مَاءِ الْوَهْطِ فَكَرِهَهُ عَبْدُ اللَّهِ بْنُ عَمْرٍو ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 214,
        "matchingEnglishURN": 1085965,
        "last_updated": null
    },
    {
        "arabicURN": 1146780,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "89.00",
        "hadithNumber": "4663",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ فَضْلِ الْمَاءِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ، عَنْ حَجَّاجٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، أَنَّ أَبَا الْمِنْهَالِ، أَخْبَرَهُ أَنَّ إِيَاسَ بْنَ عَبْدٍ صَاحِبَ النَّبِيِّ صلى الله عليه وسلم قَالَ لاَ تَبِيعُوا فَضْلَ الْمَاءِ فَإِنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ فَضْلِ الْمَاءِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 215,
        "matchingEnglishURN": 1085970,
        "last_updated": null
    },
    {
        "arabicURN": 1146790,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "90.00",
        "hadithNumber": "4664",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْخَمْرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنِ ابْنِ وَعْلَةَ الْمِصْرِيِّ، أَنَّهُ سَأَلَ ابْنَ عَبَّاسٍ عَمَّا يُعْصَرُ مِنَ الْعِنَبِ قَالَ ابْنُ عَبَّاسٍ أَهْدَى رَجُلٌ لِرَسُولِ اللَّهِ صلى الله عليه وسلم رَاوِيَةَ خَمْرٍ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هَلْ عَلِمْتَ أَنَّ اللَّهَ عَزَّ وَجَلَّ حَرَّمَهَا ‏\"‏ ‏.‏ فَسَارَّ وَلَمْ أَفْهَمْ مَا سَارَّ كَمَا أَرَدْتُ فَسَأَلْتُ إِنْسَانًا إِلَى جَنْبِهِ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بِمَ سَارَرْتَهُ ‏\"‏ ‏.‏ قَالَ أَمَرْتُهُ أَنْ يَبِيعَهَا ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ الَّذِي حَرَّمَ شُرْبَهَا حَرَّمَ بَيْعَهَا ‏\"‏ ‏.‏ فَفَتَحَ الْمَزَادَتَيْنِ حَتَّى ذَهَبَ مَا فِيهِمَا ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 216,
        "matchingEnglishURN": 1085975,
        "last_updated": null
    },
    {
        "arabicURN": 1146800,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "90.00",
        "hadithNumber": "4665",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْخَمْرِ ‏‏ ",
        "hadithText": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا نَزَلَتْ آيَاتُ الرِّبَا قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْمِنْبَرِ فَتَلاَهُنَّ عَلَى النَّاسِ ثُمَّ حَرَّمَ التِّجَارَةَ فِي الْخَمْرِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 217,
        "matchingEnglishURN": 1085978,
        "last_updated": null
    },
    {
        "arabicURN": 1146810,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "91.00",
        "hadithNumber": "4666",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْكَلْبِ ‏‏ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، أَنَّهُ سَمِعَ أَبَا مَسْعُودٍ، عُقْبَةَ بْنَ عَمْرٍو قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ ثَمَنِ الْكَلْبِ وَمَهْرِ الْبَغِيِّ وَحُلْوَانِ الْكَاهِنِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 218,
        "matchingEnglishURN": 1085980,
        "last_updated": null
    },
    {
        "arabicURN": 1146820,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "91.00",
        "hadithNumber": "4667",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْكَلْبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ عِيسَى، قَالَ أَنْبَأَنَا الْمُفَضَّلُ بْنُ فَضَالَةَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي أَشْيَاءَ حَرَّمَهَا ‏\"‏ وَثَمَنِ الْكَلْبِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 219,
        "matchingEnglishURN": 1085985,
        "last_updated": null
    },
    {
        "arabicURN": 1146830,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "92.00",
        "hadithNumber": "4668",
        "bookName": " كتاب البيوع",
        "babName": " باب مَا اسْتُثْنِيَ ‏‏ ",
        "hadithText": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ، قَالَ أَنْبَأَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ ثَمَنِ الْكَلْبِ وَالسِّنَّوْرِ إِلاَّ كَلْبَ صَيْدٍ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا مُنْكَرٌ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 220,
        "matchingEnglishURN": 1085990,
        "last_updated": null
    },
    {
        "arabicURN": 1146840,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "93.00",
        "hadithNumber": "4669",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ الْخِنْزِيرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ عَامَ الْفَتْحِ وَهُوَ بِمَكَّةَ ‏\"‏ إِنَّ اللَّهَ وَرَسُولَهُ حَرَّمَ بَيْعَ الْخَمْرِ وَالْمَيْتَةِ وَالْخِنْزِيرِ وَالأَصْنَامِ ‏\"‏ ‏.‏ فَقِيلَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ شُحُومَ الْمَيْتَةِ فَإِنَّهُ يُطْلَى بِهَا السُّفُنُ وَيُدَّهَنُ بِهَا الْجُلُودُ وَيَسْتَصْبِحُ بِهَا النَّاسُ ‏.‏ فَقَالَ ‏\"‏ لاَ هُوَ حَرَامٌ ‏\"‏ ‏.‏ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَ ذَلِكَ ‏\"‏ قَاتَلَ اللَّهُ الْيَهُودَ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَمَّا حَرَّمَ عَلَيْهِمْ شُحُومَهَا جَمَّلُوهُ ثُمَّ بَاعُوهُ فَأَكَلُوا ثَمَنَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 221,
        "matchingEnglishURN": 1085995,
        "last_updated": null
    },
    {
        "arabicURN": 1146850,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "94.00",
        "hadithNumber": "4670",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ ضِرَابِ الْجَمَلِ ‏‏ ",
        "hadithText": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ، عَنْ حَجَّاجٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرًا، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ ضِرَابِ الْجَمَلِ وَعَنْ بَيْعِ الْمَاءِ وَبَيْعِ الأَرْضِ لِلْحَرْثِ يَبِيعُ الرَّجُلُ أَرْضَهُ وَمَاءَهُ فَعَنْ ذَلِكَ نَهَى النَّبِيُّ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 222,
        "matchingEnglishURN": 1086000,
        "last_updated": null
    },
    {
        "arabicURN": 1146860,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "94.00",
        "hadithNumber": "4671",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ ضِرَابِ الْجَمَلِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ عَلِيِّ بْنِ الْحَكَمِ، ح وَأَنْبَأَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَلِيِّ بْنِ الْحَكَمِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ عَسْبِ الْفَحْلِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 223,
        "matchingEnglishURN": 1086005,
        "last_updated": null
    },
    {
        "arabicURN": 1146870,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "94.00",
        "hadithNumber": "4672",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ ضِرَابِ الْجَمَلِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عِصْمَةُ بْنُ الْفَضْلِ، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ إِبْرَاهِيمَ بْنِ حُمَيْدٍ الرُّؤَاسِيِّ، قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ جَاءَ رَجُلٌ مِنْ بَنِي الصَّعْقِ أَحَدِ بَنِي كِلاَبٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلَهُ عَنْ عَسْبِ الْفَحْلِ فَنَهَاهُ عَنْ ذَلِكَ فَقَالَ إِنَّا نُكْرَمُ عَلَى ذَلِكَ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 224,
        "matchingEnglishURN": 1086010,
        "last_updated": null
    },
    {
        "arabicURN": 1146880,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "94.00",
        "hadithNumber": "4673",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ ضِرَابِ الْجَمَلِ ‏‏ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، عَنْ مُحَمَّدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الْمُغِيرَةِ، قَالَ سَمِعْتُ ابْنَ أَبِي نُعْمٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ كَسْبِ الْحَجَّامِ وَعَنْ ثَمَنِ الْكَلْبِ وَعَنْ عَسْبِ الْفَحْلِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 225,
        "matchingEnglishURN": 1086015,
        "last_updated": null
    },
    {
        "arabicURN": 1146890,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "94.00",
        "hadithNumber": "4674",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ ضِرَابِ الْجَمَلِ ‏‏ ",
        "hadithText": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَلِيِّ بْنِ مَيْمُونٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنِ ابْنِ أَبِي نُعْمٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ عَسْبِ الْفَحْلِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 226,
        "matchingEnglishURN": 1086020,
        "last_updated": null
    },
    {
        "arabicURN": 1146900,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "94.00",
        "hadithNumber": "4675",
        "bookName": " كتاب البيوع",
        "babName": " باب بَيْعِ ضِرَابِ الْجَمَلِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا وَاصِلُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنِ الأَعْمَشِ، عَنْ أَبِي حَازِمٍ، ‏{‏ عَنْ أَبِي هُرَيْرَةَ، ‏}‏ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ ثَمَنِ الْكَلْبِ وَعَسْبِ الْفَحْلِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 227,
        "matchingEnglishURN": 1086025,
        "last_updated": null
    },
    {
        "arabicURN": 1146910,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "95.00",
        "hadithNumber": "4676",
        "bookName": " كتاب البيوع",
        "babName": " باب الرَّجُلِ يَبْتَاعُ الْبَيْعَ فَيُفْلِسُ وَيُوجَدُ الْمَتَاعُ بِعَيْنِهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَحْيَى، عَنْ أَبِي بَكْرِ بْنِ حَزْمٍ، عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَيُّمَا امْرِئٍ أَفْلَسَ ثُمَّ وَجَدَ رَجُلٌ عِنْدَهُ سِلْعَتَهُ بِعَيْنِهَا فَهُوَ أَوْلَى بِهِ مِنْ غَيْرِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 228,
        "matchingEnglishURN": 1086030,
        "last_updated": null
    },
    {
        "arabicURN": 1146920,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "95.00",
        "hadithNumber": "4677",
        "bookName": " كتاب البيوع",
        "babName": " باب الرَّجُلِ يَبْتَاعُ الْبَيْعَ فَيُفْلِسُ وَيُوجَدُ الْمَتَاعُ بِعَيْنِهِ ‏‏ ",
        "hadithText": "أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ، وَإِبْرَاهِيمُ بْنُ الْحَسَنِ، - وَاللَّفْظُ لَهُ - قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي ابْنُ أَبِي حُسَيْنٍ، أَنَّ أَبَا بَكْرِ بْنَ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، أَخْبَرَهُ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ حَدَّثَهُ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَدِيثِ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم عَنِ الرَّجُلِ، يُعْدِمُ إِذَا وُجِدَ عِنْدَهُ الْمَتَاعُ بِعَيْنِهِ وَعَرَفَهُ أَنَّهُ لِصَاحِبِهِ الَّذِي بَاعَهُ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 229,
        "matchingEnglishURN": 1086035,
        "last_updated": null
    },
    {
        "arabicURN": 1146930,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "95.00",
        "hadithNumber": "4678",
        "bookName": " كتاب البيوع",
        "babName": " باب الرَّجُلِ يَبْتَاعُ الْبَيْعَ فَيُفْلِسُ وَيُوجَدُ الْمَتَاعُ بِعَيْنِهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ حَدَّثَنِي اللَّيْثُ بْنُ سَعْدٍ، وَعَمْرُو بْنُ الْحَارِثِ، عَنْ بُكَيْرِ بْنِ الأَشَجِّ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ أُصِيبَ رَجُلٌ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي ثِمَارٍ ابْتَاعَهَا وَكَثُرَ دَيْنُهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَصَدَّقُوا عَلَيْهِ ‏\"‏ ‏.‏ فَتَصَدَّقُوا عَلَيْهِ وَلَمْ يَبْلُغْ ذَلِكَ وَفَاءَ دَيْنِهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خُذُوا مَا وَجَدْتُمْ وَلَيْسَ لَكُمْ إِلاَّ ذَلِكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 230,
        "matchingEnglishURN": 1086040,
        "last_updated": null
    },
    {
        "arabicURN": 1146940,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "96.00",
        "hadithNumber": "4679",
        "bookName": " كتاب البيوع",
        "babName": " باب الرَّجُلِ يَبِيعُ السِّلْعَةَ فَيَسْتَحِقُّهَا مُسْتَحِقٌّ ‏‏ ",
        "hadithText": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عِكْرِمَةَ بْنِ خَالِدٍ، قَالَ حَدَّثَنِي أُسَيْدُ بْنُ حُضَيْرِ بْنِ سِمَاكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى أَنَّهُ إِذَا وَجَدَهَا فِي يَدِ الرَّجُلِ غَيْرِ الْمُتَّهَمِ فَإِنْ شَاءَ أَخَذَهَا بِمَا اشْتَرَاهَا وَإِنْ شَاءَ اتَّبَعَ سَارِقَهُ وَقَضَى بِذَلِكَ أَبُو بَكْرٍ وَعُمَرُ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 231,
        "matchingEnglishURN": 1086045,
        "last_updated": null
    },
    {
        "arabicURN": 1146950,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "96.00",
        "hadithNumber": "4680",
        "bookName": " كتاب البيوع",
        "babName": " باب الرَّجُلِ يَبِيعُ السِّلْعَةَ فَيَسْتَحِقُّهَا مُسْتَحِقٌّ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ ذُؤَيْبٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنِ ابْنِ جُرَيْجٍ، وَلَقَدْ، أَخْبَرَنِي عِكْرِمَةُ بْنُ خَالِدٍ، أَنَّ أُسَيْدَ بْنَ حُضَيْرٍ الأَنْصَارِيَّ، ثُمَّ أَحَدَ بَنِي حَارِثَةَ أَخْبَرَهُ أَنَّهُ، كَانَ عَامِلاً عَلَى الْيَمَامَةِ وَأَنَّ مَرْوَانَ كَتَبَ إِلَيْهِ أَنَّ مُعَاوِيَةَ كَتَبَ إِلَيْهِ أَنَّ أَيُّمَا رَجُلٍ سُرِقَ مِنْهُ سَرِقَةٌ فَهُوَ أَحَقُّ بِهَا حَيْثُ وَجَدَهَا ‏.‏ ثُمَّ كَتَبَ بِذَلِكَ مَرْوَانُ إِلَىَّ فَكَتَبْتُ إِلَى مَرْوَانَ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَضَى بِأَنَّهُ إِذَا كَانَ الَّذِي ابْتَاعَهَا مِنَ الَّذِي سَرَقَهَا غَيْرُ مُتَّهَمٍ يُخَيَّرُ سَيِّدُهَا فَإِنْ شَاءَ أَخَذَ الَّذِي سُرِقَ مِنْهُ بِثَمَنِهَا وَإِنْ شَاءَ اتَّبَعَ سَارِقَهُ ثُمَّ قَضَى بِذَلِكَ أَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ فَبَعَثَ مَرْوَانُ بِكِتَابِي إِلَى مُعَاوِيَةَ وَكَتَبَ مُعَاوِيَةُ إِلَى مَرْوَانَ إِنَّكَ لَسْتَ أَنْتَ وَلاَ أُسَيْدٌ تَقْضِيَانِ عَلَىَّ وَلَكِنِّي أَقْضِي فِيمَا وُلِّيتُ عَلَيْكُمَا فَأَنْفِذْ لِمَا أَمَرْتُكَ بِهِ ‏.‏ فَبَعَثَ مَرْوَانُ بِكِتَابِ مُعَاوِيَةَ فَقُلْتُ لاَ أَقْضِي بِهِ مَا وُلِّيتُ بِمَا قَالَ مُعَاوِيَةُ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 232,
        "matchingEnglishURN": 1086050,
        "last_updated": null
    },
    {
        "arabicURN": 1146960,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "96.00",
        "hadithNumber": "4681",
        "bookName": " كتاب البيوع",
        "babName": " باب الرَّجُلِ يَبِيعُ السِّلْعَةَ فَيَسْتَحِقُّهَا مُسْتَحِقٌّ ‏‏ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ دَاوُدَ، قَالَ حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، قَالَ حَدَّثَنَا هُشَيْمٌ، عَنْ مُوسَى بْنِ السَّائِبِ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الرَّجُلُ أَحَقُّ بِعَيْنِ مَالِهِ إِذَا وَجَدَهُ وَيَتْبَعُ الْبَائِعُ مَنْ بَاعَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 233,
        "matchingEnglishURN": 1086055,
        "last_updated": null
    },
    {
        "arabicURN": 1146970,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "96.00",
        "hadithNumber": "4682",
        "bookName": " كتاب البيوع",
        "babName": " باب الرَّجُلِ يَبِيعُ السِّلْعَةَ فَيَسْتَحِقُّهَا مُسْتَحِقٌّ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَيُّمَا امْرَأَةٍ زَوَّجَهَا وَلِيَّانِ فَهِيَ لِلأَوَّلِ مِنْهُمَا وَمَنْ بَاعَ بَيْعًا مِنْ رَجُلَيْنِ فَهُوَ لِلأَوَّلِ مِنْهُمَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 234,
        "matchingEnglishURN": 1086060,
        "last_updated": null
    },
    {
        "arabicURN": 1146980,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "97.00",
        "hadithNumber": "4683",
        "bookName": " كتاب البيوع",
        "babName": " باب الاِسْتِقْرَاضِ ‏‏ ",
        "hadithText": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي رَبِيعَةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ اسْتَقْرَضَ مِنِّي النَّبِيُّ صلى الله عليه وسلم أَرْبَعِينَ أَلْفًا فَجَاءَهُ مَالٌ فَدَفَعَهُ إِلَىَّ وَقَالَ ‏\"‏ بَارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ إِنَّمَا جَزَاءُ السَّلَفِ الْحَمْدُ وَالأَدَاءُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 235,
        "matchingEnglishURN": 1086065,
        "last_updated": null
    },
    {
        "arabicURN": 1146990,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "98.00",
        "hadithNumber": "4684",
        "bookName": " كتاب البيوع",
        "babName": " باب التَّغْلِيظِ فِي الدَّيْنِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، عَنْ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا الْعَلاَءُ، عَنْ أَبِي كَثِيرٍ، مَوْلَى مُحَمَّدِ بْنِ جَحْشٍ عَنْ مُحَمَّدِ بْنِ جَحْشٍ، قَالَ كُنَّا جُلُوسًا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَرَفَعَ رَأْسَهُ إِلَى السَّمَاءِ ثُمَّ وَضَعَ رَاحَتَهُ عَلَى جَبْهَتِهِ ثُمَّ قَالَ ‏\"‏ سُبْحَانَ اللَّهِ مَاذَا نُزِّلَ مِنَ التَّشْدِيدِ ‏\"‏ ‏.‏ فَسَكَتْنَا وَفَزِعْنَا فَلَمَّا كَانَ مِنَ الْغَدِ سَأَلْتُهُ يَا رَسُولَ اللَّهِ مَا هَذَا التَّشْدِيدُ الَّذِي نُزِّلَ فَقَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لَوْ أَنَّ رَجُلاً قُتِلَ فِي سَبِيلِ اللَّهِ ثُمَّ أُحْيِيَ ثُمَّ قُتِلَ ثُمَّ أُحْيِيَ ثُمَّ قُتِلَ وَعَلَيْهِ دَيْنٌ مَا دَخَلَ الْجَنَّةَ حَتَّى يُقْضَى عَنْهُ دَيْنُهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 236,
        "matchingEnglishURN": 1086070,
        "last_updated": null
    },
    {
        "arabicURN": 1147000,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "98.00",
        "hadithNumber": "4685",
        "bookName": " كتاب البيوع",
        "babName": " باب التَّغْلِيظِ فِي الدَّيْنِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا الثَّوْرِيُّ، عَنْ أَبِيهِ، عَنِ الشَّعْبِيِّ، عَنْ سَمْعَانَ، عَنْ سَمُرَةَ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي جَنَازَةٍ فَقَالَ ‏\"‏ أَهَا هُنَا مِنْ بَنِي فُلاَنٍ أَحَدٌ ‏\"‏ ‏.‏ ثَلاَثًا فَقَامَ رَجُلٌ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَا مَنَعَكَ فِي الْمَرَّتَيْنِ الأُولَيَيْنِ أَنْ لاَ تَكُونَ أَجَبْتَنِي أَمَا إِنِّي لَمْ أُنَوِّهْ بِكَ إِلاَّ بِخَيْرٍ إِنَّ فُلاَنًا - لِرَجُلٍ مِنْهُمْ - مَاتَ مَأْسُورًا بِدَيْنِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 237,
        "matchingEnglishURN": 1086075,
        "last_updated": null
    },
    {
        "arabicURN": 1147010,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "99.00",
        "hadithNumber": "4686",
        "bookName": " كتاب البيوع",
        "babName": " باب التَّسْهِيلِ فِيهِ ‏‏ ",
        "hadithText": "أَخْبَرَنِي مُحَمَّدُ بْنُ قُدَامَةَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ زِيَادِ بْنِ عَمْرِو بْنِ هِنْدٍ، عَنْ عِمْرَانَ بْنِ حُذَيْفَةَ، قَالَ كَانَتْ مَيْمُونَةُ تَدَّانُ وَتُكْثِرُ فَقَالَ لَهَا أَهْلُهَا فِي ذَلِكَ وَلاَمُوهَا وَوَجَدُوا عَلَيْهَا فَقَالَتْ لاَ أَتْرُكُ الدَّيْنَ وَقَدْ سَمِعْتُ خَلِيلِي وَصَفِيِّي صلى الله عليه وسلم يَقُولُ ‏\"‏ مَا مِنْ أَحَدٍ يَدَّانُ دَيْنًا فَعَلِمَ اللَّهُ أَنَّهُ يُرِيدُ قَضَاءَهُ إِلاَّ أَدَّاهُ اللَّهُ عَنْهُ فِي الدُّنْيَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 238,
        "matchingEnglishURN": 1086080,
        "last_updated": null
    },
    {
        "arabicURN": 1147020,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "99.00",
        "hadithNumber": "4687",
        "bookName": " كتاب البيوع",
        "babName": " باب التَّسْهِيلِ فِيهِ ‏‏ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، قَالَ حَدَّثَنَا أَبِي، عَنِ الأَعْمَشِ، عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ مَيْمُونَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم اسْتَدَانَتْ فَقِيلَ لَهَا يَا أُمَّ الْمُؤْمِنِينَ تَسْتَدِينِينَ وَلَيْسَ عِنْدَكِ وَفَاءٌ قَالَتْ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنْ أَخَذَ دَيْنًا وَهُوَ يُرِيدُ أَنْ يُؤَدِّيَهُ أَعَانَهُ اللَّهُ عَزَّ وَجَلَّ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 239,
        "matchingEnglishURN": 1086085,
        "last_updated": null
    },
    {
        "arabicURN": 1147030,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "100.00",
        "hadithNumber": "4688",
        "bookName": " كتاب البيوع",
        "babName": " باب مَطْلِ الْغَنِيِّ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا أُتْبِعَ أَحَدُكُمْ عَلَى مَلِيءٍ فَلْيَتْبَعْ وَالظُّلْمُ مَطْلُ الْغَنِيِّ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 240,
        "matchingEnglishURN": 1086090,
        "last_updated": null
    },
    {
        "arabicURN": 1147040,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "100.00",
        "hadithNumber": "4689",
        "bookName": " كتاب البيوع",
        "babName": " باب مَطْلِ الْغَنِيِّ ‏‏ ",
        "hadithText": "أَخْبَرَنِي مُحَمَّدُ بْنُ آدَمَ، قَالَ حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ وَبْرِ بْنِ أَبِي دُلَيْلَةَ، عَنْ مُحَمَّدِ بْنِ مَيْمُونٍ، عَنْ عَمْرِو بْنِ الشَّرِيدِ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَىُّ الْوَاجِدِ يُحِلُّ عِرْضَهُ وَعُقُوبَتَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 241,
        "matchingEnglishURN": 1086095,
        "last_updated": null
    },
    {
        "arabicURN": 1147050,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "100.00",
        "hadithNumber": "4690",
        "bookName": " كتاب البيوع",
        "babName": " باب مَطْلِ الْغَنِيِّ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا وَبْرُ بْنُ أَبِي دُلَيْلَةَ الطَّائِفِيُّ، عَنْ مُحَمَّدِ بْنِ مَيْمُونِ بْنِ مُسَيْكَةَ، - وَأَثْنَى عَلَيْهِ خَيْرًا - عَنْ عَمْرِو بْنِ الشَّرِيدِ، عَنْ أَبِيهِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لَىُّ الْوَاجِدِ يُحِلُّ عِرْضَهُ وَعُقُوبَتَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 242,
        "matchingEnglishURN": 1086100,
        "last_updated": null
    },
    {
        "arabicURN": 1147060,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "101.00",
        "hadithNumber": "4691",
        "bookName": " كتاب البيوع",
        "babName": " باب الْحَوَالَةِ ‏‏ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، وَاللَّفْظُ، لَهُ عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَطْلُ الْغَنِيِّ ظُلْمٌ وَإِذَا أُتْبِعَ أَحَدُكُمْ عَلَى مَلِيءٍ فَلْيَتْبَعْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 243,
        "matchingEnglishURN": 1086105,
        "last_updated": null
    },
    {
        "arabicURN": 1147070,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "102.00",
        "hadithNumber": "4692",
        "bookName": " كتاب البيوع",
        "babName": " باب الْكَفَالَةِ بِالدَّيْنِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، أَنَّ رَجُلاً، مِنَ الأَنْصَارِ أُتِيَ بِهِ النَّبِيُّ صلى الله عليه وسلم لِيُصَلِّيَ عَلَيْهِ فَقَالَ ‏\"‏ إِنَّ عَلَى صَاحِبِكُمْ دَيْنًا ‏\"‏ ‏.‏ فَقَالَ أَبُو قَتَادَةَ أَنَا أَتَكَفَّلُ بِهِ ‏.‏ قَالَ ‏\"‏ بِالْوَفَاءِ ‏\"‏ ‏.‏ قَالَ بِالْوَفَاءِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 244,
        "matchingEnglishURN": 1086110,
        "last_updated": null
    },
    {
        "arabicURN": 1147080,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "103.00",
        "hadithNumber": "4693",
        "bookName": " كتاب البيوع",
        "babName": " باب التَّرْغِيبِ فِي حُسْنِ الْقَضَاءِ  ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، عَنْ وَكِيعٍ، قَالَ حَدَّثَنِي عَلِيُّ بْنُ صَالِحٍ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ خِيَارُكُمْ أَحْسَنُكُمْ قَضَاءً ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 245,
        "matchingEnglishURN": 1086115,
        "last_updated": null
    },
    {
        "arabicURN": 1147090,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "104.00",
        "hadithNumber": "4694",
        "bookName": " كتاب البيوع",
        "babName": " باب حُسْنِ الْمُعَامَلَةِ وَالرِّفْقِ فِي الْمُطَالَبَةِ  ",
        "hadithText": "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ عَجْلاَنَ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ رَجُلاً لَمْ يَعْمَلْ خَيْرًا قَطُّ وَكَانَ يُدَايِنُ النَّاسَ فَيَقُولُ لِرَسُولِهِ خُذْ مَا تَيَسَّرَ وَاتْرُكْ مَا عَسُرَ وَتَجَاوَزْ لَعَلَّ اللَّهَ تَعَالَى أَنْ يَتَجَاوَزَ عَنَّا فَلَمَّا هَلَكَ قَالَ اللَّهُ عَزَّ وَجَلَّ لَهُ هَلْ عَمِلْتَ خَيْرًا قَطُّ قَالَ لاَ إِلاَّ أَنَّهُ كَانَ لِي غُلاَمٌ وَكُنْتُ أُدَايِنُ النَّاسَ فَإِذَا بَعَثْتُهُ لِيَتَقَاضَى قُلْتُ لَهُ خُذْ مَا تَيَسَّرَ وَاتْرُكْ مَا عَسُرَ وَتَجَاوَزْ لَعَلَّ اللَّهَ يَتَجَاوَزُ عَنَّا ‏.‏ قَالَ اللَّهُ تَعَالَى قَدْ تَجَاوَزْتُ عَنْكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 246,
        "matchingEnglishURN": 1086120,
        "last_updated": null
    },
    {
        "arabicURN": 1147100,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "104.00",
        "hadithNumber": "4695",
        "bookName": " كتاب البيوع",
        "babName": " باب حُسْنِ الْمُعَامَلَةِ وَالرِّفْقِ فِي الْمُطَالَبَةِ  ",
        "hadithText": "أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا الزُّبَيْدِيُّ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ كَانَ رَجُلٌ يُدَايِنُ النَّاسَ وَكَانَ إِذَا رَأَى إِعْسَارَ الْمُعْسِرِ قَالَ لِفَتَاهُ تَجَاوَزْ عَنْهُ لَعَلَّ اللَّهَ تَعَالَى يَتَجَاوَزُ عَنَّا ‏.‏ فَلَقِيَ اللَّهَ فَتَجَاوَزَ عَنْهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 247,
        "matchingEnglishURN": 1086125,
        "last_updated": null
    },
    {
        "arabicURN": 1147110,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "104.00",
        "hadithNumber": "4696",
        "bookName": " كتاب البيوع",
        "babName": " باب حُسْنِ الْمُعَامَلَةِ وَالرِّفْقِ فِي الْمُطَالَبَةِ  ",
        "hadithText": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ إِسْمَاعِيلَ ابْنِ عُلَيَّةَ، عَنْ يُونُسَ، عَنْ عَطَاءِ بْنِ فَرُّوخَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَدْخَلَ اللَّهُ عَزَّ وَجَلَّ رَجُلاً كَانَ سَهْلاً مُشْتَرِيًا وَبَائِعًا وَقَاضِيًا وَمُقْتَضِيًا الْجَنَّةَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 248,
        "matchingEnglishURN": 1086130,
        "last_updated": null
    },
    {
        "arabicURN": 1147120,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "105.00",
        "hadithNumber": "4697",
        "bookName": " كتاب البيوع",
        "babName": " باب الشَّرِكَةِ بِغَيْرِ مَالٍ  ",
        "hadithText": "أَخْبَرَنِي عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي أَبُو إِسْحَاقَ، عَنْ أَبِي عُبَيْدَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ اشْتَرَكْتُ أَنَا وَعَمَّارٌ، وَسَعْدٌ، يَوْمَ بَدْرٍ فَجَاءَ سَعْدٌ بِأَسِيرَيْنِ وَلَمْ أَجِئْ أَنَا وَعَمَّارٌ بِشَىْءٍ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 249,
        "matchingEnglishURN": 1086135,
        "last_updated": null
    },
    {
        "arabicURN": 1147130,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "105.00",
        "hadithNumber": "4698",
        "bookName": " كتاب البيوع",
        "babName": " باب الشَّرِكَةِ بِغَيْرِ مَالٍ  ",
        "hadithText": "أَخْبَرَنَا نُوحُ بْنُ حَبِيبٍ، قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ أُتِمَّ مَا بَقِيَ فِي مَالِهِ إِنْ كَانَ لَهُ مَالٌ يَبْلُغُ ثَمَنَ الْعَبْدِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 250,
        "matchingEnglishURN": 1086140,
        "last_updated": null
    },
    {
        "arabicURN": 1147140,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "106.00",
        "hadithNumber": "4699",
        "bookName": " كتاب البيوع",
        "babName": " باب الشَّرِكَةِ فِي الرَّقِيقِ  ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ زُرَيْعٍ - قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَعْتَقَ شِرْكًا لَهُ فِي مَمْلُوكٍ وَكَانَ لَهُ مِنَ الْمَالِ مَا يَبْلُغُ ثَمَنَهُ بِقِيمَةِ الْعَبْدِ فَهُوَ عَتِيقٌ مِنْ مَالِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 251,
        "matchingEnglishURN": 1086145,
        "last_updated": null
    },
    {
        "arabicURN": 1147150,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "107.00",
        "hadithNumber": "4700",
        "bookName": " كتاب البيوع",
        "babName": " باب الشَّرِكَةِ فِي النَّخِيلِ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ أَيُّكُمْ كَانَتْ لَهُ أَرْضٌ أَوْ نَخْلٌ فَلاَ يَبِعْهَا حَتَّى يَعْرِضَهَا عَلَى شَرِيكِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 252,
        "matchingEnglishURN": 1086150,
        "last_updated": null
    },
    {
        "arabicURN": 1147160,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "108.00",
        "hadithNumber": "4701",
        "bookName": " كتاب البيوع",
        "babName": " باب الشَّرِكَةِ فِي الرِّبَاعِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ أَنْبَأَنَا ابْنُ إِدْرِيسَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم بِالشُّفْعَةِ فِي كُلِّ شَرِكَةٍ لَمْ تُقْسَمْ رَبْعَةٍ وَحَائِطٍ لاَ يَحِلُّ لَهُ أَنْ يَبِيعَهُ حَتَّى يُؤْذِنَ شَرِيكَهُ فَإِنْ شَاءَ أَخَذَ وَإِنْ شَاءَ تَرَكَ وَإِنْ بَاعَ وَلَمْ يُؤْذِنْهُ فَهُوَ أَحَقُّ بِهِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 253,
        "matchingEnglishURN": 1086155,
        "last_updated": null
    },
    {
        "arabicURN": 1147170,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "109.00",
        "hadithNumber": "4702",
        "bookName": " كتاب البيوع",
        "babName": " باب ذِكْرِ الشُّفْعَةِ وَأَحْكَامِهَا  ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ، عَنْ عَمْرِو بْنِ الشَّرِيدِ، عَنْ أَبِي رَافِعٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْجَارُ أَحَقُّ بِسَقَبِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 254,
        "matchingEnglishURN": 1086160,
        "last_updated": null
    },
    {
        "arabicURN": 1147180,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "109.00",
        "hadithNumber": "4703",
        "bookName": " كتاب البيوع",
        "babName": " باب ذِكْرِ الشُّفْعَةِ وَأَحْكَامِهَا  ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عِيسَى بْنُ يُونُسَ، قَالَ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ عَمْرِو بْنِ الشَّرِيدِ، عَنْ أَبِيهِ، أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ أَرْضِي لَيْسَ لأَحَدٍ فِيهَا شَرِكَةٌ وَلاَ قِسْمَةٌ إِلاَّ الْجُوَارَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْجَارُ أَحَقُّ بِسَقَبِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 255,
        "matchingEnglishURN": 1086165,
        "last_updated": null
    },
    {
        "arabicURN": 1147190,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "109.00",
        "hadithNumber": "4704",
        "bookName": " كتاب البيوع",
        "babName": " باب ذِكْرِ الشُّفْعَةِ وَأَحْكَامِهَا  ",
        "hadithText": "أَخْبَرَنَا هِلاَلُ بْنُ بِشْرٍ، قَالَ حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الشُّفْعَةُ فِي كُلِّ مَالٍ لَمْ يُقْسَمْ فَإِذَا وَقَعَتِ الْحُدُودُ وَعُرِفَتِ الطُّرُقُ فَلاَ شُفْعَةَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 256,
        "matchingEnglishURN": 1086170,
        "last_updated": null
    },
    {
        "arabicURN": 1147200,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "109.00",
        "hadithNumber": "4705",
        "bookName": " كتاب البيوع",
        "babName": " باب ذِكْرِ الشُّفْعَةِ وَأَحْكَامِهَا  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ أَبِي رِزْمَةَ، قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ حُسَيْنٍ، - وَهُوَ ابْنُ وَاقِدٍ - عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم بِالشُّفْعَةِ وَالْجِوَارِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 257,
        "matchingEnglishURN": 1086175,
        "last_updated": null
    }
]