[
    {
        "arabicURN": 1147210,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "1.00",
        "hadithNumber": "4706",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ الْقَسَامَةِ الَّتِي كَانَتْ فِي الْجَاهِلِيَّةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا قَطَنٌ أَبُو الْهَيْثَمِ، قَالَ حَدَّثَنَا أَبُو يَزِيدَ الْمَدَنِيُّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أَوَّلُ قَسَامَةٍ كَانَتْ فِي الْجَاهِلِيَّةِ كَانَ رَجُلٌ مِنْ بَنِي هَاشِمٍ اسْتَأْجَرَ رَجُلاً مِنْ قُرَيْشٍ مِنْ فَخِذِ أَحَدِهِمْ - قَالَ - فَانْطَلَقَ مَعَهُ فِي إِبِلِهِ فَمَرَّ بِهِ رَجُلٌ مِنْ بَنِي هَاشِمٍ قَدِ انْقَطَعَتْ عُرْوَةُ جُوَالِقِهِ فَقَالَ أَغِثْنِي بِعِقَالٍ أَشُدُّ بِهِ عُرْوَةَ جُوَالِقِي لاَ تَنْفِرُ الإِبِلُ فَأَعْطَاهُ عِقَالاً يَشُدُّ بِهِ عُرْوَةَ جُوَالِقِهِ فَلَمَّا نَزَلُوا وَعُقِلَتِ الإِبِلُ إِلاَّ بَعِيرًا وَاحِدًا فَقَالَ الَّذِي اسْتَأْجَرَهُ مَا شَأْنُ هَذَا الْبَعِيرِ لَمْ يُعْقَلْ مِنْ بَيْنِ الإِبِلِ قَالَ لَيْسَ لَهُ عِقَالٌ ‏.‏ قَالَ فَأَيْنَ عِقَالُهُ قَالَ مَرَّ بِي رَجُلٌ مِنْ بَنِي هَاشِمٍ قَدِ انْقَطَعَتْ عُرْوَةَ جُوَالِقِهِ فَاسْتَغَاثَنِي فَقَالَ أَغِثْنِي بِعِقَالٍ أَشُدُّ بِهِ عُرْوَةَ جُوَالِقِي لاَ تَنْفِرُ الإِبِلُ ‏.‏ فَأَعْطَيْتُهُ عِقَالاً فَحَذَفَهُ بِعَصًا كَانَ فِيهَا أَجَلُهُ فَمَرَّ بِهِ رَجُلٌ مِنْ أَهْلِ الْيَمَنِ فَقَالَ أَتَشْهَدُ الْمَوْسِمَ قَالَ مَا أَشْهَدُ وَرُبَّمَا شَهِدْتُ ‏.‏ قَالَ هَلْ أَنْتَ مُبَلِّغٌ عَنِّي رِسَالَةً مَرَّةً مِنَ الدَّهْرِ قَالَ نَعَمْ ‏.‏ قَالَ إِذَا شَهِدْتَ الْمَوْسِمَ فَنَادِ يَا آلَ قُرَيْشٍ فَإِذَا أَجَابُوكَ فَنَادِ يَا آلَ هَاشِمٍ فَإِذَا أَجَابُوكَ فَسَلْ عَنْ أَبِي طَالِبٍ فَأَخْبِرْهُ أَنَّ فُلاَنًا قَتَلَنِي فِي عِقَالٍ وَمَاتَ الْمُسْتَأْجَرُ فَلَمَّا قَدِمَ الَّذِي اسْتَأْجَرَهُ أَتَاهُ أَبُو طَالِبٍ فَقَالَ مَا فَعَلَ صَاحِبُنَا قَالَ مَرِضَ فَأَحْسَنْتُ الْقِيَامَ عَلَيْهِ ثُمَّ مَاتَ فَنَزَلْتُ فَدَفَنْتُهُ ‏.‏ فَقَالَ كَانَ ذَا أَهْلَ ذَاكَ مِنْكَ ‏.‏ فَمَكُثَ حِينًا ثُمَّ إِنَّ الرَّجُلَ الْيَمَانِيَّ الَّذِي كَانَ أَوْصَى إِلَيْهِ أَنْ يُبَلِّغَ عَنْهُ وَافَى الْمَوْسِمَ قَالَ يَا آلَ قُرَيْشٍ ‏.‏ قَالُوا هَذِهِ قُرَيْشٌ ‏.‏ قَالَ يَا آلَ بَنِي هَاشِمٍ ‏.‏ قَالُوا هَذِهِ بَنُو هَاشِمٍ ‏.‏ قَالَ أَيْنَ أَبُو طَالِبٍ قَالَ هَذَا أَبُو طَالِبٍ ‏.‏ قَالَ أَمَرَنِي فُلاَنٌ أَنْ أُبَلِّغَكَ رِسَالَةً أَنَّ فُلاَنًا قَتَلَهُ فِي عِقَالٍ ‏.‏ فَأَتَاهُ أَبُو طَالِبٍ فَقَالَ اخْتَرْ مِنَّا إِحْدَى ثَلاَثٍ إِنْ شِئْتَ أَنْ تُؤَدِّيَ مِائَةً مِنَ الإِبِلِ فَإِنَّكَ قَتَلْتَ صَاحِبَنَا خَطَأً وَإِنْ شِئْتَ يَحْلِفُ خَمْسُونَ مِنْ قَوْمِكَ أَنَّكَ لَمْ تَقْتُلْهُ فَإِنْ أَبَيْتَ قَتَلْنَاكَ بِهِ ‏.‏ فَأَتَى قَوْمَهُ فَذَكَرَ ذَلِكَ لَهُمْ فَقَالُوا نَحْلِفُ ‏.‏ فَأَتَتْهُ امْرَأَةٌ مِنْ بَنِي هَاشِمٍ كَانَتْ تَحْتَ رَجُلٍ مِنْهُمْ قَدْ وَلَدَتْ لَهُ فَقَالَتْ يَا أَبَا طَالِبٍ أُحِبُّ أَنْ تُجِيزَ ابْنِي هَذَا بِرَجُلٍ مِنَ الْخَمْسِينَ وَلاَ تُصْبِرْ يَمِينَهُ ‏.‏ فَفَعَلَ فَأَتَاهُ رَجُلٌ مِنْهُمْ فَقَالَ يَا أَبَا طَالِبٍ أَرَدْتَ خَمْسِينَ رَجُلاً أَنْ يَحْلِفُوا مَكَانَ مِائَةٍ مِنَ الإِبِلِ يُصِيبُ كُلُّ رَجُلٍ بَعِيرَانِ فَهَذَانِ بَعِيرَانِ فَاقْبَلْهُمَا عَنِّي وَلاَ تُصْبِرْ يَمِينِي حَيْثُ تُصْبَرُ الأَيْمَانُ ‏.‏ فَقَبِلَهُمَا وَجَاءَ ثَمَانِيَةٌ وَأَرْبَعُونَ رَجُلاً حَلَفُوا ‏.‏ قَالَ ابْنُ عَبَّاسٍ فَوَالَّذِي نَفْسِي بِيَدِهِ مَا حَالَ الْحَوْلُ وَمِنَ الثَّمَانِيَةِ وَالأَرْبَعِينَ عَيْنٌ تَطْرِفُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 1,
        "matchingEnglishURN": 1086180,
        "last_updated": null
    },
    {
        "arabicURN": 1147220,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "2.00",
        "hadithNumber": "4707",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَسَامَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، وَيُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، - قَالَ أَحْمَدُ بْنُ عَمْرٍو - قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، وَسُلَيْمَانُ بْنُ يَسَارٍ، عَنْ رَجُلٍ، مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنَ الأَنْصَارِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَقَرَّ الْقَسَامَةَ عَلَى مَا كَانَتْ عَلَيْهِ فِي الْجَاهِلِيَّةِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 2,
        "matchingEnglishURN": 1086185,
        "last_updated": null
    },
    {
        "arabicURN": 1147230,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "2.00",
        "hadithNumber": "4708",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَسَامَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ هَاشِمٍ، قَالَ حَدَّثَنَا الْوَلِيدُ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، وَسُلَيْمَانَ بْنِ يَسَارٍ، عَنْ أُنَاسٍ، مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّ الْقَسَامَةَ كَانَتْ فِي الْجَاهِلِيَّةِ فَأَقَرَّهَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى مَا كَانَتْ عَلَيْهِ فِي الْجَاهِلِيَّةِ وَقَضَى بِهَا بَيْنَ أُنَاسٍ مِنَ الأَنْصَارِ فِي قَتِيلٍ ادَّعَوْهُ عَلَى يَهُودِ خَيْبَرَ ‏.‏ خَالَفَهُمَا مَعْمَرٌ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 3,
        "matchingEnglishURN": 1086190,
        "last_updated": null
    },
    {
        "arabicURN": 1147240,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "2.00",
        "hadithNumber": "4709",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَسَامَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيَّبِ، قَالَ كَانَتِ الْقَسَامَةُ فِي الْجَاهِلِيَّةِ ثُمَّ أَقَرَّهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الأَنْصَارِيِّ الَّذِي وُجِدَ مَقْتُولاً فِي جُبِّ الْيَهُودِ فَقَالَتِ الأَنْصَارُ الْيَهُودُ قَتَلُوا صَاحِبَنَا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 4,
        "matchingEnglishURN": 1086195,
        "last_updated": null
    },
    {
        "arabicURN": 1147250,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "3.00",
        "hadithNumber": "4710",
        "bookName": " كتاب القسامة",
        "babName": " باب تَبْدِئَةِ أَهْلِ الدَّمِ فِي الْقَسَامَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ أَبِي لَيْلَى بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الأَنْصَارِيِّ، أَنَّ سَهْلَ بْنَ أَبِي حَثْمَةَ، أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ وَمُحَيِّصَةَ خَرَجَا إِلَى خَيْبَرَ مِنْ جَهْدٍ أَصَابَهُمَا فَأُتِيَ مُحَيِّصَةُ فَأُخْبِرَ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ قَدْ قُتِلَ وَطُرِحَ فِي فَقِيرٍ أَوْ عَيْنٍ فَأَتَى يَهُودَ فَقَالَ أَنْتُمْ وَاللَّهِ قَتَلْتُمُوهُ ‏.‏ فَقَالُوا وَاللَّهِ مَا قَتَلْنَاهُ ‏.‏ ثُمَّ أَقْبَلَ حَتَّى قَدِمَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ ثُمَّ أَقْبَلَ هُوَ وَحُوَيِّصَةُ وَهُوَ أَخُوهُ أَكْبَرُ مِنْهُ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ فَذَهَبَ مُحَيِّصَةُ لِيَتَكَلَّمَ وَهُوَ الَّذِي كَانَ بِخَيْبَرَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَبِّرْ كَبِّرْ ‏\"‏ ‏.‏ وَتَكَلَّمَ حُوَيِّصَةُ ثُمَّ تَكَلَّمَ مُحَيِّصَةُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِمَّا أَنْ يَدُوا صَاحِبَكُمْ وَإِمَّا أَنْ يُؤْذَنُوا بِحَرْبٍ ‏\"‏ ‏.‏ فَكَتَبَ النَّبِيُّ صلى الله عليه وسلم فِي ذَلِكَ فَكَتَبُوا إِنَّا وَاللَّهِ مَا قَتَلْنَاهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِحُوَيِّصَةَ وَمُحَيِّصَةَ وَعَبْدِ الرَّحْمَنِ ‏\"‏ تَحْلِفُونَ وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ ‏\"‏ ‏.‏ قَالُوا لاَ ‏.‏ قَالَ ‏\"‏ فَتَحْلِفُ لَكُمْ يَهُودُ ‏\"‏ ‏.‏ قَالُوا لَيْسُوا مُسْلِمِينَ ‏.‏ فَوَدَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ عِنْدِهِ فَبَعَثَ إِلَيْهِمْ بِمِائَةِ نَاقَةٍ حَتَّى أُدْخِلَتْ عَلَيْهِمُ الدَّارَ ‏.‏ قَالَ سَهْلٌ لَقَدْ رَكَضَتْنِي مِنْهَا نَاقَةٌ حَمْرَاءُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 5,
        "matchingEnglishURN": 1086200,
        "last_updated": null
    },
    {
        "arabicURN": 1147260,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "3.00",
        "hadithNumber": "4711",
        "bookName": " كتاب القسامة",
        "babName": " باب تَبْدِئَةِ أَهْلِ الدَّمِ فِي الْقَسَامَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي لَيْلَى بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَهْلٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، أَنَّهُ أَخْبَرَهُ وَرِجَالٌ، مِنْ كُبَرَاءِ قَوْمِهِ أَنَّ عَبْدَ، اللَّهِ بْنَ سَهْلٍ وَمُحَيِّصَةَ خَرَجَا إِلَى خَيْبَرَ مِنْ جَهْدٍ أَصَابَهُمْ فَأُتِيَ مُحَيِّصَةُ فَأُخْبِرَ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ قَدْ قُتِلَ وَطُرِحَ فِي فَقِيرٍ أَوْ عَيْنٍ فَأَتَى يَهُودَ وَقَالَ أَنْتُمْ وَاللَّهِ قَتَلْتُمُوهُ قَالُوا وَاللَّهِ مَا قَتَلْنَاهُ ‏.‏ فَأَقْبَلَ حَتَّى قَدِمَ عَلَى قَوْمِهِ فَذَكَرَ لَهُمْ ثُمَّ أَقْبَلَ هُوَ وَأَخُوهُ حُوَيِّصَةُ وَهُوَ أَكْبَرُ مِنْهُ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ فَذَهَبَ مُحَيِّصَةُ لِيَتَكَلَّمَ وَهُوَ الَّذِي كَانَ بِخَيْبَرَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِمُحَيِّصَةَ ‏\"‏ كَبِّرْ كَبِّرْ ‏\"‏ ‏.‏ يُرِيدُ السِّنَّ فَتَكَلَّمَ حُوَيِّصَةُ ثُمَّ تَكَلَّمَ مُحَيِّصَةُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِمَّا أَنْ يَدُوا صَاحِبَكُمْ وَإِمَّا أَنْ يُؤْذَنُوا بِحَرْبٍ ‏\"‏ ‏.‏ فَكَتَبَ إِلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ذَلِكَ فَكَتَبُوا إِنَّا وَاللَّهِ مَا قَتَلْنَاهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِحُوَيِّصَةَ وَمُحَيِّصَةَ وَعَبْدِ الرَّحْمَنِ ‏\"‏ أَتَحْلِفُونَ وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ ‏\"‏ ‏.‏ قَالُوا لاَ ‏.‏ قَالَ ‏\"‏ فَتَحْلِفُ لَكُمْ يَهُودُ ‏\"‏ ‏.‏ قَالُوا لَيْسُوا بِمُسْلِمِينَ ‏.‏ فَوَدَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ عِنْدِهِ فَبَعَثَ إِلَيْهِمْ بِمِائَةِ نَاقَةٍ حَتَّى أُدْخِلَتْ عَلَيْهِمُ الدَّارَ ‏.‏ قَالَ سَهْلٌ لَقَدْ رَكَضَتْنِي مِنْهَا نَاقَةٌ حَمْرَاءُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 6,
        "matchingEnglishURN": 1086205,
        "last_updated": null
    },
    {
        "arabicURN": 1147270,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "4.00",
        "hadithNumber": "4712",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ سَهْلٍ فِيهِ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَحْيَى، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، قَالَ وَحَسِبْتُ قَالَ وَعَنْ رَافِعِ بْنِ خَدِيجٍ، أَنَّهُمَا قَالاَ خَرَجَ عَبْدُ اللَّهِ بْنُ سَهْلِ بْنِ زَيْدٍ وَمُحَيِّصَةُ بْنُ مَسْعُودٍ حَتَّى إِذَا كَانَا بِخَيْبَرَ تَفَرَّقَا فِي بَعْضِ مَا هُنَالِكَ ثُمَّ إِذَا بِمُحَيِّصَةَ يَجِدُ عَبْدَ اللَّهِ بْنَ سَهْلٍ قَتِيلاً فَدَفَنَهُ ثُمَّ أَقْبَلَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم هُوَ وَحُوَيِّصَةُ بْنُ مَسْعُودٍ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ - وَكَانَ أَصْغَرَ الْقَوْمِ - فَذَهَبَ عَبْدُ الرَّحْمَنِ يَتَكَلَّمُ قَبْلَ صَاحِبَيْهِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَبِّرِ الْكُبْرَ فِي السِّنِّ ‏\"‏ ‏.‏ فَصَمَتَ وَتَكَلَّمَ صَاحِبَاهُ ثُمَّ تَكَلَّمَ مَعَهُمَا فَذَكَرُوا لِرَسُولِ اللَّهِ صلى الله عليه وسلم مَقْتَلَ عَبْدِ اللَّهِ بْنِ سَهْلٍ فَقَالَ لَهُمْ ‏\"‏ أَتَحْلِفُونَ خَمْسِينَ يَمِينًا وَتَسْتَحِقُّونَ صَاحِبَكُمْ أَوْ قَاتِلَكُمْ ‏\"‏ ‏.‏ قَالُوا كَيْفَ نَحْلِفُ وَلَمْ نَشْهَدْ قَالَ ‏\"‏ فَتُبَرِّئُكُمْ يَهُودُ بِخَمْسِينَ يَمِينًا ‏\"‏ ‏.‏ قَالُوا وَكَيْفَ نَقْبَلُ أَيْمَانَ قَوْمٍ كُفَّارٍ فَلَمَّا رَأَى ذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَعْطَاهُ عَقْلَهُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 7,
        "matchingEnglishURN": 1086210,
        "last_updated": null
    },
    {
        "arabicURN": 1147280,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "4.00",
        "hadithNumber": "4713",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ سَهْلٍ فِيهِ  ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدَةَ، قَالَ أَنْبَأَنَا حَمَّادٌ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، وَرَافِعِ بْنِ خَدِيجٍ، أَنَّهُمَا حَدَّثَاهُ أَنَّ مُحَيِّصَةَ بْنَ مَسْعُودٍ وَعَبْدَ اللَّهِ بْنَ سَهْلٍ أَتَيَا خَيْبَرَ فِي حَاجَةٍ لَهُمَا فَتَفَرَّقَا فِي النَّخْلِ فَقُتِلَ عَبْدُ اللَّهِ بْنُ سَهْلٍ فَجَاءَ أَخُوهُ عَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ وَحُوَيِّصَةُ وَمُحَيِّصَةُ ابْنَا عَمِّهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَتَكَلَّمَ عَبْدُ الرَّحْمَنِ فِي أَمْرِ أَخِيهِ - وَهُوَ أَصْغَرُ مِنْهُمْ - فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْكُبْرَ لِيَبْدَأَ الأَكْبَرُ ‏\"‏ ‏.‏ فَتَكَلَّمَا فِي أَمْرِ صَاحِبِهِمَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَذَكَرَ كَلِمَةً مَعْنَاهَا ‏\"‏ يُقْسِمُ خَمْسُونَ مِنْكُمْ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ أَمْرٌ لَمْ نَشْهَدْهُ كَيْفَ نَحْلِفُ قَالَ ‏\"‏ فَتُبَرِّئُكُمْ يَهُودُ بِأَيْمَانِ خَمْسِينَ مِنْهُمْ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ قَوْمٌ كُفَّارٌ ‏.‏ فَوَدَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ قِبَلِهِ ‏.‏ قَالَ سَهْلٌ فَدَخَلْتُ مِرْبَدًا لَهُمْ فَرَكَضَتْنِي نَاقَةٌ مِنْ تِلْكَ الإِبِلِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 8,
        "matchingEnglishURN": 1086215,
        "last_updated": null
    },
    {
        "arabicURN": 1147290,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "4.00",
        "hadithNumber": "4714",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ سَهْلٍ فِيهِ  ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا بِشْرٌ، - وَهُوَ ابْنُ الْمُفَضَّلِ - قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ، وَمُحَيِّصَةَ بْنَ مَسْعُودِ بْنِ زَيْدٍ، أَنَّهُمَا أَتَيَا خَيْبَرَ وَهُوَ يَوْمَئِذٍ صُلْحٌ فَتَفَرَّقَا لِحَوَائِجِهِمَا فَأَتَى مُحَيِّصَةُ عَلَى عَبْدِ اللَّهِ بْنِ سَهْلٍ وَهُوَ يَتَشَحَّطُ فِي دَمِهِ قَتِيلاً فَدَفَنَهُ ثُمَّ قَدِمَ الْمَدِينَةَ فَانْطَلَقَ عَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ وَحُوَيِّصَةُ وَمُحَيِّصَةُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَهَبَ عَبْدُ الرَّحْمَنِ يَتَكَلَّمُ - وَهُوَ أَحْدَثُ الْقَوْمِ سِنًّا - فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَبِّرِ الْكُبْرَ ‏\"‏ ‏.‏ فَسَكَتَ فَتَكَلَّمَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَحْلِفُونَ بِخَمْسِينَ يَمِينًا مِنْكُمْ فَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ أَوْ قَاتِلِكُمْ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نَحْلِفُ وَلَمْ نَشْهَدْ وَلَمْ نَرَ قَالَ ‏\"‏ تُبَرِّئُكُمْ يَهُودُ بِخَمْسِينَ يَمِينًا ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نَأْخُذُ أَيْمَانَ قَوْمٍ كُفَّارٍ فَعَقَلَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ عِنْدِهِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 9,
        "matchingEnglishURN": 1086220,
        "last_updated": null
    },
    {
        "arabicURN": 1147300,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "4.00",
        "hadithNumber": "4715",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ سَهْلٍ فِيهِ  ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، قَالَ انْطَلَقَ عَبْدُ اللَّهِ بْنُ سَهْلٍ وَمُحَيِّصَةُ بْنُ مَسْعُودِ بْنِ زَيْدٍ إِلَى خَيْبَرَ وَهِيَ يَوْمَئِذٍ صُلْحٌ فَتَفَرَّقَا فِي حَوَائِجِهِمَا فَأَتَى مُحَيِّصَةُ عَلَى عَبْدِ اللَّهِ بْنِ سَهْلٍ وَهُوَ يَتَشَحَّطُ فِي دَمِهِ قَتِيلاً فَدَفَنَهُ ثُمَّ قَدِمَ الْمَدِينَةَ فَانْطَلَقَ عَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ وَحُوَيِّصَةُ وَمُحَيِّصَةُ ابْنَا مَسْعُودٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَهَبَ عَبْدُ الرَّحْمَنِ يَتَكَلَّمُ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَبِّرِ الْكُبْرَ ‏\"‏ ‏.‏ وَهُوَ أَحْدَثُ الْقَوْمِ فَسَكَتَ فَتَكَلَّمَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَحْلِفُونَ بِخَمْسِينَ يَمِينًا مِنْكُمْ وَتَسْتَحِقُّونَ قَاتِلَكُمْ أَوْ صَاحِبَكُمْ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نَحْلِفُ وَلَمْ نَشْهَدْ وَلَمْ نَرَ فَقَالَ ‏\"‏ أَتُبَرِّئُكُمْ يَهُودُ بِخَمْسِينَ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نَأْخُذُ أَيْمَانَ قَوْمٍ كُفَّارٍ فَعَقَلَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ عِنْدِهِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 10,
        "matchingEnglishURN": 1086225,
        "last_updated": null
    },
    {
        "arabicURN": 1147310,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "4.00",
        "hadithNumber": "4716",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ سَهْلٍ فِيهِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، يَقُولُ أَخْبَرَنِي بُشَيْرُ بْنُ يَسَارٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ الأَنْصَارِيَّ، وَمُحَيِّصَةَ بْنَ مَسْعُودٍ، خَرَجَا إِلَى خَيْبَرَ فَتَفَرَّقَا فِي حَاجَتِهِمَا فَقُتِلَ عَبْدُ اللَّهِ بْنُ سَهْلٍ الأَنْصَارِيُّ فَجَاءَ مُحَيِّصَةُ وَعَبْدُ الرَّحْمَنِ أَخُو الْمَقْتُولِ وَحُوَيِّصَةُ بْنُ مَسْعُودٍ حَتَّى أَتَوْا رَسُولَ اللَّهِ صلى الله عليه وسلم فَذَهَبَ عَبْدُ الرَّحْمَنِ يَتَكَلَّمُ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الْكُبْرَ الْكُبْرَ ‏\"‏ ‏.‏ فَتَكَلَّمَ مُحَيِّصَةُ وَحُوَيِّصَةُ فَذَكَرُوا شَأْنَ عَبْدِ اللَّهِ بْنِ سَهْلٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَحْلِفُونَ خَمْسِينَ يَمِينًا فَتَسْتَحِقُّونَ قَاتِلَكُمْ ‏\"‏ ‏.‏ قَالُوا كَيْفَ نَحْلِفُ وَلَمْ نَشْهَدْ وَلَمْ نَحْضُرْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَتُبَرِّئُكُمْ يَهُودُ بِخَمْسِينَ يَمِينًا ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نَقْبَلُ أَيْمَانَ قَوْمٍ كُفَّارٍ قَالَ فَوَدَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ بُشَيْرٌ قَالَ لِي سَهْلُ بْنُ أَبِي حَثْمَةَ لَقَدْ رَكَضَتْنِي فَرِيضَةٌ مِنْ تِلْكَ الْفَرَائِضِ فِي مِرْبَدٍ لَنَا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 11,
        "matchingEnglishURN": 1086230,
        "last_updated": null
    },
    {
        "arabicURN": 1147320,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "4.00",
        "hadithNumber": "4717",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ سَهْلٍ فِيهِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، قَالَ وُجِدَ عَبْدُ اللَّهِ بْنُ سَهْلٍ قَتِيلاً فَجَاءَ أَخُوهُ وَعَمَّاهُ حُوَيِّصَةُ وَمُحَيِّصَةُ وَهُمَا عَمَّا عَبْدِ اللَّهِ بْنِ سَهْلٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَهَبَ عَبْدُ الرَّحْمَنِ يَتَكَلَّمُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْكُبْرَ الْكُبْرَ ‏\"‏ ‏.‏ قَالاَ يَا رَسُولَ اللَّهِ إِنَّا وَجَدْنَا عَبْدَ اللَّهِ بْنَ سَهْلٍ قَتِيلاً فِي قَلِيبٍ مِنْ بَعْضِ قُلُبِ خَيْبَرَ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنْ تَتَّهِمُونَ ‏\"‏ ‏.‏ قَالُوا نَتَّهِمُ الْيَهُودَ ‏.‏ قَالَ ‏\"‏ أَفَتُقْسِمُونَ خَمْسِينَ يَمِينًا أَنَّ الْيَهُودَ قَتَلَتْهُ ‏\"‏ ‏.‏ قَالُوا وَكَيْفَ نُقْسِمُ عَلَى مَا لَمْ نَرَ قَالَ ‏\"‏ فَتُبَرِّئُكُمُ الْيَهُودُ بِخَمْسِينَ أَنَّهُمْ لَمْ يَقْتُلُوهُ ‏\"‏ ‏.‏ قَالُوا وَكَيْفَ نَرْضَى بِأَيْمَانِهِمْ وَهُمْ مُشْرِكُونَ فَوَدَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ عِنْدِهِ ‏.‏ أَرْسَلَهُ مَالِكُ بْنُ أَنَسٍ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 12,
        "matchingEnglishURN": 1086235,
        "last_updated": null
    },
    {
        "arabicURN": 1147330,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "4.00",
        "hadithNumber": "4718",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ سَهْلٍ فِيهِ  ",
        "hadithText": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، حَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، أَنَّهُ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ الأَنْصَارِيَّ وَمُحَيِّصَةَ بْنَ مَسْعُودٍ خَرَجَا إِلَى خَيْبَرَ فَتَفَرَّقَا فِي حَوَائِجِهِمَا فَقُتِلَ عَبْدُ اللَّهِ بْنُ سَهْلٍ فَقَدِمَ مُحَيِّصَةُ فَأَتَى هُوَ وَأَخُوهُ حُوَيِّصَةُ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَهَبَ عَبْدُ الرَّحْمَنِ لِيَتَكَلَّمَ لِمَكَانِهِ مِنْ أَخِيهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَبِّرْ كَبِّرْ ‏\"‏ ‏.‏ فَتَكَلَّمَ حُوَيِّصَةُ وَمُحَيِّصَةُ فَذَكَرُوا شَأْنَ عَبْدِ اللَّهِ بْنِ سَهْلٍ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَحْلِفُونَ خَمْسِينَ يَمِينًا وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ أَوْ قَاتِلِكُمْ ‏\"‏ ‏.‏ قَالَ مَالِكٌ قَالَ يَحْيَى فَزَعَمَ بُشَيْرٌ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَدَاهُ مِنْ عِنْدِهِ ‏.‏ خَالَفَهُمْ سَعِيدُ بْنُ عُبَيْدٍ الطَّائِيُّ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 13,
        "matchingEnglishURN": 1086240,
        "last_updated": null
    },
    {
        "arabicURN": 1147340,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "4.00",
        "hadithNumber": "4719",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ سَهْلٍ فِيهِ  ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدٍ الطَّائِيُّ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، زَعَمَ أَنَّ رَجُلاً، مِنَ الأَنْصَارِ يُقَالُ لَهُ سَهْلُ بْنُ أَبِي حَثْمَةَ أَخْبَرَهُ أَنَّ نَفَرًا مِنْ قَوْمِهِ انْطَلَقُوا إِلَى خَيْبَرَ فَتَفَرَّقُوا فِيهَا فَوَجَدُوا أَحَدَهُمْ قَتِيلاً فَقَالُوا لِلَّذِينَ وَجَدُوهُ عِنْدَهُمْ قَتَلْتُمْ صَاحِبَنَا قَالُوا مَا قَتَلْنَاهُ وَلاَ عَلِمْنَا قَاتِلاً ‏.‏ فَانْطَلَقُوا إِلَى نَبِيِّ اللَّهِ صلى الله عليه وسلم فَقَالُوا يَا نَبِيَّ اللَّهِ انْطَلَقْنَا إِلَى خَيْبَرَ فَوَجَدْنَا أَحَدَنَا قَتِيلاً ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْكُبْرَ الْكُبْرَ ‏\"‏ ‏.‏ فَقَالَ لَهُمْ ‏\"‏ تَأْتُونَ بِالْبَيِّنَةِ عَلَى مَنْ قَتَلَ ‏\"‏ ‏.‏ قَالُوا مَا لَنَا بَيِّنَةٌ ‏.‏ قَالَ ‏\"‏ فَيَحْلِفُونَ لَكُمْ ‏\"‏ ‏.‏ قَالُوا لاَ نَرْضَى بِأَيْمَانِ الْيَهُودِ ‏.‏ وَكَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَبْطُلَ دَمُهُ فَوَدَاهُ مِائَةً مِنْ إِبِلِ الصَّدَقَةِ ‏.‏ خَالَفَهُمْ عَمْرُو بْنُ شُعَيْبٍ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 14,
        "matchingEnglishURN": 1086245,
        "last_updated": null
    },
    {
        "arabicURN": 1147350,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "4.00",
        "hadithNumber": "4720",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ سَهْلٍ فِيهِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، قَالَ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ الأَخْنَسِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ ابْنَ مُحَيِّصَةَ الأَصْغَرَ، أَصْبَحَ قَتِيلاً عَلَى أَبْوَابِ خَيْبَرَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَقِمْ شَاهِدَيْنِ عَلَى مَنْ قَتَلَهُ أَدْفَعْهُ إِلَيْكُمْ بِرُمَّتِهِ ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ وَمِنْ أَيْنَ أُصِيبُ شَاهِدَيْنِ وَإِنَّمَا أَصْبَحَ قَتِيلاً عَلَى أَبْوَابِهِمْ قَالَ ‏\"‏ فَتَحْلِفُ خَمْسِينَ قَسَامَةً ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ وَكَيْفَ أَحْلِفُ عَلَى مَا لاَ أَعْلَمُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَنَسْتَحْلِفُ مِنْهُمْ خَمْسِينَ قَسَامَةً ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ نَسْتَحْلِفُهُمْ وَهُمُ الْيَهُودُ فَقَسَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم دِيَتَهُ عَلَيْهِمْ وَأَعَانَهُمْ بِنِصْفِهَا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 15,
        "matchingEnglishURN": 1086250,
        "last_updated": null
    },
    {
        "arabicURN": 1147360,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "5.00",
        "hadithNumber": "4721",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَوَدِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا بِشْرُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلاَّ بِإِحْدَى ثَلاَثٍ النَّفْسُ بِالنَّفْسِ وَالثَّيِّبُ الزَّانِي وَالتَّارِكُ دِينَهُ الْمُفَارِقُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 16,
        "matchingEnglishURN": 1086255,
        "last_updated": null
    },
    {
        "arabicURN": 1147370,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "5.00",
        "hadithNumber": "4722",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَوَدِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، وَأَحْمَدُ بْنُ حَرْبٍ، - وَاللَّفْظُ لأَحْمَدَ - قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قُتِلَ رَجُلٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَرُفِعَ الْقَاتِلُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَدَفَعَهُ إِلَى وَلِيِّ الْمَقْتُولِ فَقَالَ الْقَاتِلُ يَا رَسُولَ اللَّهِ لاَ وَاللَّهِ مَا أَرَدْتُ قَتْلَهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِوَلِيِّ الْمَقْتُولِ ‏\"‏ أَمَا إِنَّهُ إِنْ كَانَ صَادِقًا ثُمَّ قَتَلْتَهُ دَخَلْتَ النَّارَ ‏\"‏ ‏.‏ فَخَلَّى سَبِيلَهُ ‏.‏ قَالَ وَكَانَ مَكْتُوفًا بِنِسْعَةٍ فَخَرَجَ يَجُرُّ نِسْعَتَهُ فَسُمِّيَ ذَا النِّسْعَةِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 17,
        "matchingEnglishURN": 1086260,
        "last_updated": null
    },
    {
        "arabicURN": 1147380,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "5.00",
        "hadithNumber": "4723",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَوَدِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا إِسْحَاقُ، عَنْ عَوْفٍ الأَعْرَابِيِّ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ الْحَضْرَمِيِّ، عَنْ أَبِيهِ، قَالَ جِيءَ بِالْقَاتِلِ الَّذِي قَتَلَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم جَاءَ بِهِ وَلِيُّ الْمَقْتُولِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَعْفُو ‏\"‏ ‏.‏ قَالَ لاَ قَالَ ‏\"‏ أَتَقْتُلُ ‏\"‏ ‏.‏ قَالَ نَعَمْ قَالَ ‏\"‏ اذْهَبْ ‏\"‏ ‏.‏ فَلَمَّا ذَهَبَ دَعَاهُ قَالَ ‏\"‏ أَتَعْفُو ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ أَتَأْخُذُ الدِّيَةَ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ أَتَقْتُلُ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ اذْهَبْ ‏\"‏ ‏.‏ فَلَمَّا ذَهَبَ قَالَ ‏\"‏ أَمَا إِنَّكَ إِنْ عَفَوْتَ عَنْهُ فَإِنَّهُ يَبُوءُ بِإِثْمِكَ وَإِثْمِ صَاحِبِكَ ‏\"‏ ‏.‏ فَعَفَا عَنْهُ فَأَرْسَلَهُ - قَالَ - فَرَأَيْتُهُ يَجُرُّ نِسْعَتَهُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 18,
        "matchingEnglishURN": 1086265,
        "last_updated": null
    },
    {
        "arabicURN": 1147390,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "6.00",
        "hadithNumber": "4724",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ اخْتِلاَفِ النَّاقِلِينَ لِخَبَرِ عَلْقَمَةَ بْنِ وَائِلٍ فِيهِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عَوْفِ بْنِ أَبِي جَمِيلَةَ، قَالَ حَدَّثَنِي حَمْزَةُ أَبُو عَمْرٍو الْعَائِذِيُّ، قَالَ حَدَّثَنَا عَلْقَمَةُ بْنُ وَائِلٍ، عَنْ وَائِلٍ، قَالَ شَهِدْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم حِينَ جِيءَ بِالْقَاتِلِ يَقُودُهُ وَلِيُّ الْمَقْتُولِ فِي نِسْعَةٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِوَلِيِّ الْمَقْتُولِ ‏\"‏ أَتَعْفُو ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ أَتَأْخُذُ الدِّيَةَ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَتَقْتُلُهُ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ اذْهَبْ بِهِ ‏\"‏ ‏.‏ فَلَمَّا ذَهَبَ بِهِ فَوَلَّى مِنْ عِنْدِهِ دَعَاهُ فَقَالَ لَهُ ‏\"‏ أَتَعْفُو ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ أَتَأْخُذُ الدِّيَةَ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَتَقْتُلُهُ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ اذْهَبْ بِهِ ‏\"‏ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَ ذَلِكَ ‏\"‏ أَمَا إِنَّكَ إِنْ عَفَوْتَ عَنْهُ يَبُوءُ بِإِثْمِهِ وَإِثْمِ صَاحِبِكَ ‏\"‏ ‏.‏ فَعَفَا عَنْهُ وَتَرَكَهُ فَأَنَا رَأَيْتُهُ يَجُرُّ نِسْعَتَهُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 19,
        "matchingEnglishURN": 1086270,
        "last_updated": null
    },
    {
        "arabicURN": 1147400,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "6.00",
        "hadithNumber": "4725",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ اخْتِلاَفِ النَّاقِلِينَ لِخَبَرِ عَلْقَمَةَ بْنِ وَائِلٍ فِيهِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا جَامِعُ بْنُ مَطَرٍ الْحَبَطِيُّ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏ قَالَ يَحْيَى وَهُوَ أَحْسَنُ مِنْهُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 20,
        "matchingEnglishURN": 1086275,
        "last_updated": null
    },
    {
        "arabicURN": 1147410,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "6.00",
        "hadithNumber": "4726",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ اخْتِلاَفِ النَّاقِلِينَ لِخَبَرِ عَلْقَمَةَ بْنِ وَائِلٍ فِيهِ  ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، - وَهُوَ الْحَوْضِيُّ - قَالَ حَدَّثَنَا جَامِعُ بْنُ مَطَرٍ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ، عَنْ أَبِيهِ، قَالَ كُنْتُ قَاعِدًا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم جَاءَ رَجُلٌ فِي عُنُقِهِ نِسْعَةٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ هَذَا وَأَخِي كَانَا فِي جُبٍّ يَحْفِرَانِهَا فَرَفَعَ الْمِنْقَارَ فَضَرَبَ بِهِ رَأْسَ صَاحِبِهِ فَقَتَلَهُ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اعْفُ عَنْهُ ‏\"‏ ‏.‏ فَأَبَى وَقَالَ يَا نَبِيَّ اللَّهِ إِنَّ هَذَا وَأَخِي كَانَا فِي جُبٍّ يَحْفِرَانِهَا فَرَفَعَ الْمِنْقَارَ فَضَرَبَ بِهِ رَأْسَ صَاحِبِهِ فَقَتَلَهُ ‏.‏ فَقَالَ ‏\"‏ اعْفُ عَنْهُ ‏\"‏ ‏.‏ فَأَبَى ثُمَّ قَامَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ هَذَا وَأَخِي كَانَا فِي جُبٍّ يَحْفِرَانِهَا فَرَفَعَ الْمِنْقَارَ - أُرَاهُ قَالَ - فَضَرَبَ رَأْسَ صَاحِبِهِ فَقَتَلَهُ ‏.‏ فَقَالَ ‏\"‏ اعْفُ عَنْهُ ‏\"‏ ‏.‏ فَأَبَى قَالَ ‏\"‏ اذْهَبْ إِنْ قَتَلْتَهُ كُنْتَ مِثْلَهُ ‏\"‏ ‏.‏ فَخَرَجَ بِهِ حَتَّى جَاوَزَ فَنَادَيْنَاهُ أَمَا تَسْمَعُ مَا يَقُولُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَرَجَعَ فَقَالَ إِنْ قَتَلْتُهُ كُنْتُ مِثْلَهُ قَالَ ‏\"‏ نَعَمِ اعْفُ ‏\"‏ ‏.‏ فَخَرَجَ يَجُرُّ نِسْعَتَهُ حَتَّى خَفِيَ عَلَيْنَا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 21,
        "matchingEnglishURN": 1086280,
        "last_updated": null
    },
    {
        "arabicURN": 1147420,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "6.00",
        "hadithNumber": "4727",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ اخْتِلاَفِ النَّاقِلِينَ لِخَبَرِ عَلْقَمَةَ بْنِ وَائِلٍ فِيهِ  ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا حَاتِمٌ، عَنْ سِمَاكٍ، ذَكَرَ أَنَّ عَلْقَمَةَ بْنَ وَائِلٍ، أَخْبَرَهُ عَنْ أَبِيهِ، أَنَّهُ كَانَ قَاعِدًا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ جَاءَ رَجُلٌ يَقُودُ آخَرَ بِنِسْعَةٍ فَقَالَ يَا رَسُولَ اللَّهِ قَتَلَ هَذَا أَخِي ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَقَتَلْتَهُ ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ لَوْ لَمْ يَعْتَرِفْ أَقَمْتُ عَلَيْهِ الْبَيِّنَةَ ‏.‏ قَالَ نَعَمْ قَتَلْتُهُ ‏.‏ قَالَ ‏\"‏ كَيْفَ قَتَلْتَهُ ‏\"‏ ‏.‏ قَالَ كُنْتُ أَنَا وَهُوَ نَحْتَطِبُ مِنْ شَجَرَةٍ فَسَبَّنِي فَأَغْضَبَنِي فَضَرَبْتُ بِالْفَأْسِ عَلَى قَرْنِهِ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلْ لَكَ مِنْ مَالٍ تُؤَدِّيهِ عَنْ نَفْسِكَ ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ مَالِي إِلاَّ فَأْسِي وَكِسَائِي ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتُرَى قَوْمَكَ يَشْتَرُونَكَ ‏\"‏ ‏.‏ قَالَ أَنَا أَهْوَنُ عَلَى قَوْمِي مِنْ ذَاكَ ‏.‏ فَرَمَى بِالنِّسْعَةِ إِلَى الرَّجُلِ فَقَالَ ‏\"‏ دُونَكَ صَاحِبَكَ ‏\"‏ ‏.‏ فَلَمَّا وَلَّى قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنْ قَتَلَهُ فَهُوَ مِثْلُهُ ‏\"‏ ‏.‏ فَأَدْرَكُوا الرَّجُلَ فَقَالُوا وَيْلَكَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنْ قَتَلَهُ فَهُوَ مِثْلُهُ ‏\"‏ ‏.‏ فَرَجَعَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ حُدِّثْتُ أَنَّكَ قُلْتَ ‏\"‏ إِنْ قَتَلَهُ فَهُوَ مِثْلُهُ ‏\"‏ ‏.‏ وَهَلْ أَخَذْتُهُ إِلاَّ بِأَمْرِكَ فَقَالَ ‏\"‏ مَا تُرِيدُ أَنْ يَبُوءَ بِإِثْمِكَ وَإِثْمِ صَاحِبِكَ ‏\"‏ ‏.‏ قَالَ بَلَى ‏.‏ قَالَ ‏\"‏ فَإِنْ ذَاكَ ‏\"‏ ‏.‏ قَالَ ذَلِكَ كَذَلِكَ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 22,
        "matchingEnglishURN": 1086285,
        "last_updated": null
    },
    {
        "arabicURN": 1147430,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "6.00",
        "hadithNumber": "4728",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ اخْتِلاَفِ النَّاقِلِينَ لِخَبَرِ عَلْقَمَةَ بْنِ وَائِلٍ فِيهِ  ",
        "hadithText": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا أَبُو يُونُسَ، عَنْ سِمَاكِ بْنِ حَرْبٍ، أَنَّ عَلْقَمَةَ بْنَ وَائِلٍ، حَدَّثَهُ أَنَّ أَبَاهُ حَدَّثَهُ قَالَ إِنِّي لَقَاعِدٌ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ جَاءَ رَجُلٌ يَقُودُ آخَرَ نَحْوَهُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 23,
        "matchingEnglishURN": 1086290,
        "last_updated": null
    },
    {
        "arabicURN": 1147440,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "6.00",
        "hadithNumber": "4729",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ اخْتِلاَفِ النَّاقِلِينَ لِخَبَرِ عَلْقَمَةَ بْنِ وَائِلٍ فِيهِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ، عَنْ أَبِي عَوَانَةَ، عَنْ إِسْمَاعِيلَ بْنِ سَالِمٍ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ، أَنَّ أَبَاهُ، حَدَّثَهُمْ أَنَّ النَّبِيَّ صلى الله عليه وسلم أُتِيَ بِرَجُلٍ قَدْ قَتَلَ رَجُلاً فَدَفَعَهُ إِلَى وَلِيِّ الْمَقْتُولِ يَقْتُلُهُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم لِجُلَسَائِهِ ‏\"‏ الْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ ‏\"‏ ‏.‏ قَالَ فَاتَّبَعَهُ رَجُلٌ فَأَخْبَرَهُ فَلَمَّا أَخْبَرَهُ تَرَكَهُ ‏.‏ قَالَ فَلَقَدْ رَأَيْتُهُ يَجُرُّ نِسْعَتَهُ حِينَ تَرَكَهُ يَذْهَبُ ‏.‏ فَذَكَرْتُ ذَلِكَ لِحَبِيبٍ فَقَالَ حَدَّثَنِي سَعِيدُ بْنُ أَشْوَعَ قَالَ وَذَكَرَ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ الرَّجُلَ بِالْعَفْوِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 24,
        "matchingEnglishURN": 1086295,
        "last_updated": null
    },
    {
        "arabicURN": 1147450,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "6.00",
        "hadithNumber": "4730",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ اخْتِلاَفِ النَّاقِلِينَ لِخَبَرِ عَلْقَمَةَ بْنِ وَائِلٍ فِيهِ  ",
        "hadithText": "أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، قَالَ حَدَّثَنَا ضَمْرَةُ، عَنْ عَبْدِ اللَّهِ بْنِ شَوْذَبٍ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَجُلاً، أَتَى بِقَاتِلِ وَلِيِّهِ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اعْفُ عَنْهُ ‏\"‏ ‏.‏ فَأَبَى فَقَالَ ‏\"‏ خُذِ الدِّيَةَ ‏\"‏ ‏.‏ فَأَبَى قَالَ ‏\"‏ اذْهَبْ فَاقْتُلْهُ فَإِنَّكَ مِثْلَهُ ‏\"‏ ‏.‏ فَذَهَبَ فَلُحِقَ الرَّجُلُ فَقِيلَ لَهُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ اقْتُلْهُ فَإِنَّكَ مِثْلَهُ ‏\"‏ ‏.‏ فَخَلَّى سَبِيلَهُ فَمَرَّ بِيَ الرَّجُلُ وَهُوَ يَجُرُّ نِسْعَتَهُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 25,
        "matchingEnglishURN": 1086300,
        "last_updated": null
    },
    {
        "arabicURN": 1147460,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "6.00",
        "hadithNumber": "4731",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ اخْتِلاَفِ النَّاقِلِينَ لِخَبَرِ عَلْقَمَةَ بْنِ وَائِلٍ فِيهِ  ",
        "hadithText": "أَخْبَرَنَا الْحَسَنُ بْنُ إِسْحَاقَ الْمَرْوَزِيُّ، قَالَ حَدَّثَنِي خَالِدُ بْنُ خِدَاشٍ، قَالَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ بَشِيرِ بْنِ الْمُهَاجِرِ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ رَجُلاً، جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنَّ هَذَا الرَّجُلَ قَتَلَ أَخِي ‏.‏ قَالَ ‏\"‏ اذْهَبْ فَاقْتُلْهُ كَمَا قَتَلَ أَخَاكَ ‏\"‏ ‏.‏ فَقَالَ لَهُ الرَّجُلُ اتَّقِ اللَّهَ وَاعْفُ عَنِّي فَإِنَّهُ أَعْظَمُ لأَجْرِكَ وَخَيْرٌ لَكَ وَلأَخِيكَ يَوْمَ الْقِيَامَةِ ‏.‏ قَالَ فَخَلَّى عَنْهُ قَالَ فَأُخْبِرَ النَّبِيُّ صلى الله عليه وسلم فَسَأَلَهُ فَأَخْبَرَهُ بِمَا قَالَ لَهُ قَالَ فَأَعْنَفَهُ ‏\"‏ أَمَا إِنَّهُ كَانَ خَيْرًا مِمَّا هُوَ صَانِعٌ بِكَ يَوْمَ الْقِيَامَةِ يَقُولُ يَا رَبِّ سَلْ هَذَا فِيمَ قَتَلَنِي ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 26,
        "matchingEnglishURN": 1086305,
        "last_updated": null
    },
    {
        "arabicURN": 1147470,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "8.00",
        "hadithNumber": "4732",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى عِكْرِمَةَ فِي ذَلِكَ ‏‏ ",
        "hadithText": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، قَالَ أَنْبَأَنَا عَلِيٌّ، - وَهُوَ ابْنُ صَالِحٍ - عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ قُرَيْظَةُ وَالنَّضِيرُ وَكَانَ النَّضِيرُ أَشْرَفَ مِنْ قُرَيْظَةَ وَكَانَ إِذَا قَتَلَ رَجُلٌ مِنْ قُرَيْظَةَ رَجُلاً مِنَ النَّضِيرِ قُتِلَ بِهِ وَإِذَا قَتَلَ رَجُلٌ مِنَ النَّضِيرِ رَجُلاً مِنْ قُرَيْظَةَ أَدَّى مِائَةَ وَسْقٍ مِنْ تَمْرٍ فَلَمَّا بُعِثَ النَّبِيُّ صلى الله عليه وسلم قَتَلَ رَجُلٌ مِنَ النَّضِيرِ رَجُلاً مِنْ قُرَيْظَةَ فَقَالُوا ادْفَعُوهُ إِلَيْنَا نَقْتُلْهُ ‏.‏ فَقَالُوا بَيْنَنَا وَبَيْنَكُمُ النَّبِيُّ صلى الله عليه وسلم ‏.‏ فَأَتَوْهُ فَنَزَلَتْ ‏<A id=\"q2\" name=\"q2\" href=\"javascript:openquran(4,42,42)\"><c_q2>{‏ وَإِنْ حَكَمْتَ فَاحْكُمْ بَيْنَهُمْ بِالْقِسْطِ ‏}</c_q2></a>‏ وَالْقِسْطُ النَّفْسُ بِالنَّفْسِ ثُمَّ نَزَلَتْ ‏<A id=\"q3\" name=\"q3\" href=\"javascript:openquran(4,50,50)\"><c_q3>{‏ أَفَحُكْمَ الْجَاهِلِيَّةِ يَبْغُونَ ‏}</c_q3></a>‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 27,
        "matchingEnglishURN": 1086310,
        "last_updated": null
    },
    {
        "arabicURN": 1147480,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "8.00",
        "hadithNumber": "4733",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى عِكْرِمَةَ فِي ذَلِكَ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدٍ، قَالَ حَدَّثَنَا عَمِّي، قَالَ حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، أَخْبَرَنِي دَاوُدُ بْنُ الْحُصَيْنِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ الآيَاتِ الَّتِي، فِي الْمَائِدَةِ الَّتِي قَالَهَا اللَّهُ عَزَّ وَجَلَّ ‏<A id=\"q4\" name=\"q4\" href=\"javascript:openquran(4,42,42)\"><c_q4>{‏ فَاحْكُمْ بَيْنَهُمْ أَوْ أَعْرِضْ عَنْهُمْ ‏}</c_q4></a>‏ إِلَى ‏<A id=\"q5\" name=\"q5\" href=\"javascript:openquran(4,42,42)\"><c_q5>{‏ الْمُقْسِطِينَ ‏}</c_q5></a>‏ إِنَّمَا نَزَلَتْ فِي الدِّيَةِ بَيْنَ النَّضِيرِ وَبَيْنَ قُرَيْظَةَ وَذَلِكَ أَنَّ قَتْلَى النَّضِيرِ كَانَ لَهُمْ شَرَفٌ يُودَوْنَ الدِّيَةَ كَامِلَةً وَأَنَّ بَنِي قُرَيْظَةَ كَانُوا يُودَوْنَ نِصْفَ الدِّيَةِ فَتَحَاكَمُوا فِي ذَلِكَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ذَلِكَ فِيهِمْ فَحَمَلَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْحَقِّ فِي ذَلِكَ فَجَعَلَ الدِّيَةَ سَوَاءً ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 28,
        "matchingEnglishURN": 1086315,
        "last_updated": null
    },
    {
        "arabicURN": 1147490,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "9.00",
        "hadithNumber": "4734",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَوَدِ بَيْنَ الأَحْرَارِ وَالْمَمَالِيكِ فِي النَّفْسِ ‏‏ ",
        "hadithText": "أَخْبَرَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ قَيْسِ بْنِ عُبَادٍ، قَالَ انْطَلَقْتُ أَنَا وَالأَشْتَرُ، إِلَى عَلِيٍّ رضى الله عنه فَقُلْنَا هَلْ عَهِدَ إِلَيْكَ نَبِيُّ اللَّهِ صلى الله عليه وسلم شَيْئًا لَمْ يَعْهَدْهُ إِلَى النَّاسِ عَامَّةً قَالَ لاَ إِلاَّ مَا كَانَ فِي كِتَابِي هَذَا ‏.‏ فَأَخْرَجَ كِتَابًا مِنْ قِرَابِ سَيْفِهِ فَإِذَا فِيهِ ‏\"‏ الْمُؤْمِنُونَ تَكَافَأُ دِمَاؤُهُمْ وَهُمْ يَدٌ عَلَى مَنْ سِوَاهُمْ وَيَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ أَلاَ لاَ يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ وَلاَ ذُو عَهْدٍ بِعَهْدِهِ مَنْ أَحْدَثَ حَدَثًا فَعَلَى نَفْسِهِ أَوْ آوَى مُحْدِثًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 29,
        "matchingEnglishURN": 1086320,
        "last_updated": null
    },
    {
        "arabicURN": 1147500,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "9.00",
        "hadithNumber": "4735",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَوَدِ بَيْنَ الأَحْرَارِ وَالْمَمَالِيكِ فِي النَّفْسِ ‏‏ ",
        "hadithText": "أَخْبَرَنِي أَبُو بَكْرِ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا الْقَوَارِيرِيُّ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْوَاحِدِ، قَالَ حَدَّثَنَا عُمَرُ بْنُ عَامِرٍ، عَنْ قَتَادَةَ، عَنْ أَبِي حَسَّانَ، عَنْ عَلِيٍّ، رضى الله عنه أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ الْمُؤْمِنُونَ تَكَافَأُ دِمَاؤُهُمْ وَهُمْ يَدٌ عَلَى مَنْ سِوَاهُمْ يَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ لاَ يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ وَلاَ ذُو عَهْدٍ فِي عَهْدِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 30,
        "matchingEnglishURN": 1086325,
        "last_updated": null
    },
    {
        "arabicURN": 1147510,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "10.00",
        "hadithNumber": "4736",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَوَدِ مِنَ السَّيِّدِ لِلْمَوْلَى ‏‏ ",
        "hadithText": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، - هُوَ الْمَرْوَزِيُّ - قَالَ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ وَمَنْ جَدَعَهُ جَدَعْنَاهُ وَمَنْ أَخْصَاهُ أَخْصَيْنَاهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 31,
        "matchingEnglishURN": 1086330,
        "last_updated": null
    },
    {
        "arabicURN": 1147520,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "10.00",
        "hadithNumber": "4737",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَوَدِ مِنَ السَّيِّدِ لِلْمَوْلَى ‏‏ ",
        "hadithText": "أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 32,
        "matchingEnglishURN": 1086335,
        "last_updated": null
    },
    {
        "arabicURN": 1147530,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "10.00",
        "hadithNumber": "4738",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَوَدِ مِنَ السَّيِّدِ لِلْمَوْلَى ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 33,
        "matchingEnglishURN": 1086340,
        "last_updated": null
    },
    {
        "arabicURN": 1147540,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "11.00",
        "hadithNumber": "4739",
        "bookName": " كتاب القسامة",
        "babName": " باب قَتْلِ الْمَرْأَةِ بِالْمَرْأَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، أَنَّهُ سَمِعَ طَاوُسًا، يُحَدِّثُ عَنِ ابْنِ عَبَّاسٍ، عَنْ عُمَرَ، رضى الله عنه أَنَّهُ نَشَدَ قَضَاءَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي ذَلِكَ فَقَامَ حَمَلُ بْنُ مَالِكٍ فَقَالَ كُنْتُ بَيْنَ حُجْرَتَىِ امْرَأَتَيْنِ فَضَرَبَتْ إِحْدَاهُمَا الأُخْرَى بِمِسْطَحٍ فَقَتَلَتْهَا وَجَنِينَهَا فَقَضَى النَّبِيُّ صلى الله عليه وسلم فِي جَنِينِهَا بِغُرَّةٍ وَأَنْ تُقْتَلَ بِهَا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 34,
        "matchingEnglishURN": 1086345,
        "last_updated": null
    },
    {
        "arabicURN": 1147550,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "12.00",
        "hadithNumber": "4740",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَوَدِ مِنَ الرَّجُلِ لِلْمَرْأَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدَةُ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، رضى الله عنه أَنَّ يَهُودِيًّا، قَتَلَ جَارِيَةً عَلَى أَوْضَاحٍ لَهَا فَأَقَادَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِهَا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 35,
        "matchingEnglishURN": 1086350,
        "last_updated": null
    },
    {
        "arabicURN": 1147560,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "12.00",
        "hadithNumber": "4741",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَوَدِ مِنَ الرَّجُلِ لِلْمَرْأَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا أَبُو هِشَامٍ، قَالَ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ يَهُودِيًّا، أَخَذَ أَوْضَاحًا مِنْ جَارِيَةٍ ثُمَّ رَضَخَ رَأْسَهَا بَيْنَ حَجَرَيْنِ فَأَدْرَكُوهَا وَبِهَا رَمَقٌ فَجَعَلُوا يَتَّبِعُونَ بِهَا النَّاسَ هُوَ هَذَا هُوَ هَذَا قَالَتْ نَعَمْ ‏.‏ فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَرُضِخَ رَأْسُهُ بَيْنَ حَجَرَيْنِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 36,
        "matchingEnglishURN": 1086355,
        "last_updated": null
    },
    {
        "arabicURN": 1147570,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "12.00",
        "hadithNumber": "4742",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَوَدِ مِنَ الرَّجُلِ لِلْمَرْأَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ هَمَّامٍ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ خَرَجَتْ جَارِيَةٌ عَلَيْهَا أَوْضَاحٌ فَأَخَذَهَا يَهُودِيٌّ فَرَضَخَ رَأْسَهَا وَأَخَذَ مَا عَلَيْهَا مِنَ الْحُلِيِّ فَأُدْرِكَتْ وَبِهَا رَمَقٌ فَأُتِيَ بِهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَنْ قَتَلَكِ فُلاَنٌ ‏\"‏ ‏.‏ قَالَتْ بِرَأْسِهَا لاَ ‏.‏ قَالَ ‏\"‏ فُلاَنٌ ‏\"‏ ‏.‏ قَالَ حَتَّى سَمَّى الْيَهُودِيَّ قَالَتْ بِرَأْسِهَا نَعَمْ فَأُخِذَ فَاعْتَرَفَ فَأَمَرَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَرُضِخَ رَأْسُهُ بَيْنَ حَجَرَيْنِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 37,
        "matchingEnglishURN": 1086360,
        "last_updated": null
    },
    {
        "arabicURN": 1147580,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "13.00",
        "hadithNumber": "4743",
        "bookName": " كتاب القسامة",
        "babName": " باب سُقُوطِ الْقَوَدِ مِنَ الْمُسْلِمِ لِلْكَافِرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِبْرَاهِيمُ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\"‏ لاَ يَحِلُّ قَتْلُ مُسْلِمٍ إِلاَّ فِي إِحْدَى ثَلاَثِ خِصَالٍ زَانٍ مُحْصَنٍ فَيُرْجَمُ وَرَجُلٌ يَقْتُلُ مُسْلِمًا مُتَعَمِّدًا وَرَجُلٌ يَخْرُجُ مِنَ الإِسْلاَمِ فَيُحَارِبُ اللَّهَ عَزَّ وَجَلَّ وَرَسُولَهُ فَيُقْتَلُ أَوْ يُصَلَّبُ أَوْ يُنْفَى مِنَ الأَرْضِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 38,
        "matchingEnglishURN": 1086365,
        "last_updated": null
    },
    {
        "arabicURN": 1147590,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "13.00",
        "hadithNumber": "4744",
        "bookName": " كتاب القسامة",
        "babName": " باب سُقُوطِ الْقَوَدِ مِنَ الْمُسْلِمِ لِلْكَافِرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مُطَرِّفِ بْنِ طَرِيفٍ، عَنِ الشَّعْبِيِّ، قَالَ سَمِعْتُ أَبَا جُحَيْفَةَ، يَقُولُ سَأَلْنَا عَلِيًّا فَقُلْنَا هَلْ عِنْدَكُمْ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم شَىْءٌ سِوَى الْقُرْآنِ فَقَالَ لاَ وَالَّذِي فَلَقَ الْحَبَّةَ وَبَرَأَ النَّسَمَةَ إِلاَّ أَنْ يُعْطِيَ اللَّهُ عَزَّ وَجَلَّ عَبْدًا فَهْمًا فِي كِتَابِهِ أَوْ مَا فِي هَذِهِ الصَّحِيفَةِ ‏.‏ قُلْتُ وَمَا فِي الصَّحِيفَةِ قَالَ فِيهَا ‏\"‏ الْعَقْلُ وَفِكَاكُ الأَسِيرِ وَأَنْ لاَ يُقْتَلَ مُسْلِمٌ بِكَافِرٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 39,
        "matchingEnglishURN": 1086370,
        "last_updated": null
    },
    {
        "arabicURN": 1147600,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "13.00",
        "hadithNumber": "4745",
        "bookName": " كتاب القسامة",
        "babName": " باب سُقُوطِ الْقَوَدِ مِنَ الْمُسْلِمِ لِلْكَافِرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا الْحَجَّاجُ بْنُ مِنْهَالٍ، قَالَ حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَبِي حَسَّانَ، قَالَ قَالَ عَلِيٌّ مَا عَهِدَ إِلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِشَىْءٍ دُونَ النَّاسِ إِلاَّ فِي صَحِيفَةٍ فِي قِرَابِ سَيْفِي ‏.‏ فَلَمْ يَزَالُوا بِهِ حَتَّى أَخْرَجَ الصَّحِيفَةَ فَإِذَا فِيهَا ‏\"‏ الْمُؤْمِنُونَ تَكَافَأُ دِمَاؤُهُمْ يَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ وَهُمْ يَدٌ عَلَى مَنْ سِوَاهُمْ لاَ يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ وَلاَ ذُو عَهْدٍ فِي عَهْدِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 40,
        "matchingEnglishURN": 1086375,
        "last_updated": null
    },
    {
        "arabicURN": 1147610,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "13.00",
        "hadithNumber": "4746",
        "bookName": " كتاب القسامة",
        "babName": " باب سُقُوطِ الْقَوَدِ مِنَ الْمُسْلِمِ لِلْكَافِرِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ، عَنِ الْحَجَّاجِ بْنِ الْحَجَّاجِ، عَنْ قَتَادَةَ، عَنْ أَبِي حَسَّانَ الأَعْرَجِ، عَنِ الأَشْتَرِ، أَنَّهُ قَالَ لِعَلِيٍّ إِنَّ النَّاسَ قَدْ تَفَشَّغَ بِهِمْ مَا يَسْمَعُونَ فَإِنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَهِدَ إِلَيْكَ عَهْدًا فَحَدِّثْنَا بِهِ ‏.‏ قَالَ مَا عَهِدَ إِلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم عَهْدًا لَمْ يَعْهَدْهُ إِلَى النَّاسِ غَيْرَ أَنَّ فِي قِرَابِ سَيْفِي صَحِيفَةً فَإِذَا فِيهَا ‏\"‏ الْمُؤْمِنُونَ تَتَكَافَأُ دِمَاؤُهُمْ يَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ لاَ يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ وَلاَ ذُو عَهْدٍ فِي عَهْدِهِ ‏\"‏ ‏.‏ مُخْتَصَرٌ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 41,
        "matchingEnglishURN": 1086380,
        "last_updated": null
    },
    {
        "arabicURN": 1147620,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "14.00",
        "hadithNumber": "4747",
        "bookName": " كتاب القسامة",
        "babName": " باب تَعْظِيمِ قَتْلِ الْمُعَاهِدِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ عُيَيْنَةَ، قَالَ أَخْبَرَنِي أَبِي قَالَ، قَالَ أَبُو بَكْرَةَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ قَتَلَ مُعَاهِدًا فِي غَيْرِ كُنْهِهِ حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 42,
        "matchingEnglishURN": 1086385,
        "last_updated": null
    },
    {
        "arabicURN": 1147630,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "14.00",
        "hadithNumber": "4748",
        "bookName": " كتاب القسامة",
        "babName": " باب تَعْظِيمِ قَتْلِ الْمُعَاهِدِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ يُونُسَ، عَنِ الْحَكَمِ بْنِ الأَعْرَجِ، عَنِ الأَشْعَثِ بْنِ ثُرْمُلَةَ، عَنْ أَبِي بَكْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ قَتَلَ نَفْسًا مُعَاهِدَةً بِغَيْرِ حِلِّهَا حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ أَنْ يَشُمَّ رِيحَهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 43,
        "matchingEnglishURN": 1086390,
        "last_updated": null
    },
    {
        "arabicURN": 1147640,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "14.00",
        "hadithNumber": "4749",
        "bookName": " كتاب القسامة",
        "babName": " باب تَعْظِيمِ قَتْلِ الْمُعَاهِدِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا النَّضْرُ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ هِلاَلِ بْنِ يِسَافٍ، عَنِ الْقَاسِمِ بْنِ مُخَيْمِرَةَ، عَنْ رَجُلٍ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ قَتَلَ رَجُلاً مِنْ أَهْلِ الذِّمَّةِ لَمْ يَجِدْ رِيحَ الْجَنَّةِ وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ سَبْعِينَ عَامًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 44,
        "matchingEnglishURN": 1086395,
        "last_updated": null
    },
    {
        "arabicURN": 1147650,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "14.00",
        "hadithNumber": "4750",
        "bookName": " كتاب القسامة",
        "babName": " باب تَعْظِيمِ قَتْلِ الْمُعَاهِدِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، دُحَيْمٌ قَالَ حَدَّثَنَا مَرْوَانُ، قَالَ حَدَّثَنَا الْحَسَنُ، - وَهُوَ ابْنُ عَمْرٍو - عَنْ مُجَاهِدٍ، عَنْ جُنَادَةَ بْنِ أَبِي أُمَيَّةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ قَتَلَ قَتِيلاً مِنْ أَهْلِ الذِّمَّةِ لَمْ يَجِدْ رِيحَ الْجَنَّةِ وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ أَرْبَعِينَ عَامًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 45,
        "matchingEnglishURN": 1086400,
        "last_updated": null
    },
    {
        "arabicURN": 1147660,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "15.00",
        "hadithNumber": "4751",
        "bookName": " كتاب القسامة",
        "babName": " باب سُقُوطِ الْقَوَدِ بَيْنَ الْمَمَالِيكِ فِيمَا دُونَ النَّفْسِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ أَبِي نَضْرَةَ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ غُلاَمًا، لأُنَاسٍ فُقَرَاءَ قَطَعَ أُذُنَ غُلاَمٍ لأُنَاسٍ أَغْنِيَاءَ فَأَتَوُا النَّبِيَّ صلى الله عليه وسلم فَلَمْ يَجْعَلْ لَهُمْ شَيْئًا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 46,
        "matchingEnglishURN": 1086405,
        "last_updated": null
    },
    {
        "arabicURN": 1147670,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "16.00",
        "hadithNumber": "4752",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقِصَاصِ فِي السِّنِّ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا أَبُو خَالِدٍ، سُلَيْمَانُ بْنُ حَيَّانَ قَالَ حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى بِالْقِصَاصِ فِي السِّنِّ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كِتَابُ اللَّهِ الْقِصَاصُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 47,
        "matchingEnglishURN": 1086410,
        "last_updated": null
    },
    {
        "arabicURN": 1147680,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "16.00",
        "hadithNumber": "4753",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقِصَاصِ فِي السِّنِّ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 48,
        "matchingEnglishURN": 1086415,
        "last_updated": null
    },
    {
        "arabicURN": 1147690,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "16.00",
        "hadithNumber": "4754",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقِصَاصِ فِي السِّنِّ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ خَصَى عَبْدَهُ خَصَيْنَاهُ وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُ ‏\"‏ ‏.‏ وَاللَّفْظُ لاِبْنِ بَشَّارٍ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 49,
        "matchingEnglishURN": 1086420,
        "last_updated": null
    },
    {
        "arabicURN": 1147700,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "16.00",
        "hadithNumber": "4755",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقِصَاصِ فِي السِّنِّ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا عَفَّانُ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، أَنَّ أُخْتَ الرُّبَيِّعِ أُمَّ حَارِثَةَ، جَرَحَتْ إِنْسَانًا فَاخْتَصَمُوا إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْقِصَاصَ الْقِصَاصَ ‏\"‏ ‏.‏ فَقَالَتْ أُمُّ الرُّبَيِّعِ يَا رَسُولَ اللَّهِ أَيُقْتَصُّ مِنْ فُلاَنَةَ لاَ وَاللَّهِ لاَ يُقْتَصُّ مِنْهَا أَبَدًا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ سُبْحَانَ اللَّهِ يَا أُمَّ الرُّبَيِّعِ الْقِصَاصُ كِتَابُ اللَّهِ ‏\"‏ ‏.‏ قَالَتْ لاَ وَاللَّهِ لاَ يُقْتَصُّ مِنْهَا أَبَدًا ‏.‏ فَمَا زَالَتْ حَتَّى قَبِلُوا الدِّيَةَ ‏.‏ قَالَ ‏\"‏ إِنَّ مِنْ عِبَادِ اللَّهِ مَنْ لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 50,
        "matchingEnglishURN": 1086425,
        "last_updated": null
    },
    {
        "arabicURN": 1147710,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "17.00",
        "hadithNumber": "4756",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقِصَاصِ مِنَ الثَّنِيَّةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، وَإِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالاَ حَدَّثَنَا بِشْرٌ، عَنْ حُمَيْدٍ، قَالَ ذَكَرَ أَنَسٌ أَنَّ عَمَّتَهُ، كَسَرَتْ ثَنِيَّةَ جَارِيَةٍ فَقَضَى نَبِيُّ اللَّهِ صلى الله عليه وسلم بِالْقِصَاصِ فَقَالَ أَخُوهَا أَنَسُ بْنُ النَّضْرِ أَتُكْسَرُ ثَنِيَّةُ فُلاَنَةَ لاَ وَالَّذِي بَعَثَكَ بِالْحَقِّ لاَ تُكْسَرُ ثَنِيَّةُ فُلاَنَةَ ‏.‏ قَالَ وَكَانُوا قَبْلَ ذَلِكَ سَأَلُوا أَهْلَهَا الْعَفْوَ وَالأَرْشَ فَلَمَّا حَلَفَ أَخُوهَا - وَهُوَ عَمُّ أَنَسٍ وَهُوَ الشَّهِيدُ يَوْمَ أُحُدٍ - رَضِيَ الْقَوْمُ بِالْعَفْوِ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنْ عِبَادِ اللَّهِ مَنْ لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 51,
        "matchingEnglishURN": 1086430,
        "last_updated": null
    },
    {
        "arabicURN": 1147720,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "17.00",
        "hadithNumber": "4757",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقِصَاصِ مِنَ الثَّنِيَّةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ، قَالَ كَسَرَتِ الرُّبَيِّعُ ثَنِيَّةَ جَارِيَةٍ فَطَلَبُوا إِلَيْهِمُ الْعَفْوَ فَأَبَوْا فَعُرِضَ عَلَيْهِمُ الأَرْشُ فَأَبَوْا فَأَتَوُا النَّبِيَّ صلى الله عليه وسلم فَأَمَرَ بِالْقِصَاصِ ‏.‏ قَالَ أَنَسُ بْنُ النَّضْرِ يَا رَسُولَ اللَّهِ تُكْسَرُ ثَنِيَّةُ الرُّبَيِّعِ لاَ وَالَّذِي بَعَثَكَ بِالْحَقِّ لاَ تُكْسَرُ ‏.‏ قَالَ ‏\"‏ يَا أَنَسُ كِتَابُ اللَّهِ الْقِصَاصُ ‏\"‏ ‏.‏ فَرَضِيَ الْقَوْمُ وَعَفَوْا فَقَالَ ‏\"‏ إِنَّ مِنْ عِبَادِ اللَّهِ مَنْ لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 52,
        "matchingEnglishURN": 1086435,
        "last_updated": null
    },
    {
        "arabicURN": 1147730,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "18.00",
        "hadithNumber": "4758",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَوَدِ مِنَ الْعَضَّةِ وَذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ عِمْرَانَ بْنِ حُصَيْنٍ ‏.‏  ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ أَبُو الْجَوْزَاءِ، قَالَ أَنْبَأَنَا قُرَيْشُ بْنُ أَنَسٍ، عَنِ ابْنِ عَوْنٍ، عَنِ ابْنِ سِيرِينَ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ رَجُلاً، عَضَّ يَدَ رَجُلٍ فَانْتَزَعَ يَدَهُ فَسَقَطَتْ ثَنِيَّتُهُ أَوْ قَالَ ثَنَايَاهُ فَاسْتَعْدَى عَلَيْهِ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا تَأْمُرُنِي تَأْمُرُنِي أَنْ آمُرَهُ أَنْ يَدَعَ يَدَهُ فِي فِيكَ تَقْضَمُهَا كَمَا يَقْضَمُ الْفَحْلُ إِنْ شِئْتَ فَادْفَعْ إِلَيْهِ يَدَكَ حَتَّى يَقْضَمَهَا ثُمَّ انْتَزِعْهَا إِنْ شِئْتَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 53,
        "matchingEnglishURN": 1086440,
        "last_updated": null
    },
    {
        "arabicURN": 1147740,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "18.00",
        "hadithNumber": "4759",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَوَدِ مِنَ الْعَضَّةِ وَذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ عِمْرَانَ بْنِ حُصَيْنٍ ‏.‏  ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ رَجُلاً، عَضَّ آخَرَ عَلَى ذِرَاعِهِ فَاجْتَذَبَهَا فَانْتَزَعَتْ ثَنِيَّتَهُ فَرُفِعَ ذَلِكَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَبْطَلَهَا وَقَالَ ‏\"‏ أَرَدْتَ أَنْ تَقْضَمَ لَحْمَ أَخِيكَ كَمَا يَقْضَمُ الْفَحْلُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 54,
        "matchingEnglishURN": 1086445,
        "last_updated": null
    },
    {
        "arabicURN": 1147750,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "18.00",
        "hadithNumber": "4760",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَوَدِ مِنَ الْعَضَّةِ وَذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ عِمْرَانَ بْنِ حُصَيْنٍ ‏.‏  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ قَاتَلَ يَعْلَى رَجُلاً فَعَضَّ أَحَدُهُمَا صَاحِبَهُ فَانْتَزَعَ يَدَهُ مِنْ فِيهِ فَنَدَرَتْ ثَنِيَّتُهُ فَاخْتَصَمَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ يَعَضُّ أَحَدُكُمْ أَخَاهُ كَمَا يَعَضُّ الْفَحْلُ لاَ دِيَةَ لَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 55,
        "matchingEnglishURN": 1086450,
        "last_updated": null
    },
    {
        "arabicURN": 1147760,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "18.00",
        "hadithNumber": "4761",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَوَدِ مِنَ الْعَضَّةِ وَذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ عِمْرَانَ بْنِ حُصَيْنٍ ‏.‏  ",
        "hadithText": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ يَعْلَى، قَالَ فِي الَّذِي عَضَّ فَنَدَرَتْ ثَنِيَّتُهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ دِيَةَ لَكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 56,
        "matchingEnglishURN": 1086455,
        "last_updated": null
    },
    {
        "arabicURN": 1147770,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "18.00",
        "hadithNumber": "4762",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَوَدِ مِنَ الْعَضَّةِ وَذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ عِمْرَانَ بْنِ حُصَيْنٍ ‏.‏  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا أَبُو هِشَامٍ، قَالَ حَدَّثَنَا أَبَانُ، قَالَ حَدَّثَنَا قَتَادَةُ، قَالَ حَدَّثَنَا زُرَارَةُ بْنُ أَوْفَى، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ رَجُلاً، عَضَّ ذِرَاعَ رَجُلٍ فَانْتَزَعَ ثَنِيَّتَهُ فَانْطَلَقَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ فَقَالَ ‏\"‏ أَرَدْتَ أَنْ تَقْضَمَ ذِرَاعَ أَخِيكَ كَمَا يَقْضَمُ الْفَحْلُ ‏\"‏ ‏.‏ فَأَبْطَلَهَا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 57,
        "matchingEnglishURN": 1086460,
        "last_updated": null
    },
    {
        "arabicURN": 1147780,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "19.00",
        "hadithNumber": "4763",
        "bookName": " كتاب القسامة",
        "babName": " باب الرَّجُلِ يَدْفَعُ عَنْ نَفْسِهِ، ‏‏ ",
        "hadithText": "أَخْبَرَنَا مَالِكُ بْنُ الْخَلِيلِ، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنِ الْحَكَمِ، عَنْ مُجَاهِدٍ، عَنْ يَعْلَى ابْنِ مُنْيَةَ، أَنَّهُ قَاتَلَ رَجُلاً فَعَضَّ أَحَدُهُمَا صَاحِبَهُ فَانْتَزَعَ يَدَهُ مِنْ فِيهِ فَقَلَعَ ثَنِيَّتَهُ فَرُفِعَ ذَلِكَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ يَعَضُّ أَحَدُكُمْ أَخَاهُ كَمَا يَعَضُّ الْبَكْرُ ‏\"‏ ‏.‏ فَأَبْطَلَهَا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 58,
        "matchingEnglishURN": 1086465,
        "last_updated": null
    },
    {
        "arabicURN": 1147790,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "19.00",
        "hadithNumber": "4764",
        "bookName": " كتاب القسامة",
        "babName": " باب الرَّجُلِ يَدْفَعُ عَنْ نَفْسِهِ، ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عَقِيلٍ، قَالَ حَدَّثَنَا جَدِّي، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ مُجَاهِدٍ، عَنْ يَعْلَى ابْنِ مُنْيَةَ، أَنَّ رَجُلاً، مِنْ بَنِي تَمِيمٍ قَاتَلَ رَجُلاً فَعَضَّ يَدَهُ فَانْتَزَعَهَا فَأَلْقَى ثَنِيَّتَهُ فَاخْتَصَمَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ يَعَضُّ أَحَدُكُمْ أَخَاهُ كَمَا يَعَضُّ الْبَكْرُ ‏\"‏ ‏.‏ فَأَطَلَّهَا أَىْ أَبْطَلَهَا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 59,
        "matchingEnglishURN": 1086470,
        "last_updated": null
    },
    {
        "arabicURN": 1147800,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "20.00",
        "hadithNumber": "4765",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى عَطَاءٍ فِي هَذَا الْحَدِيثِ  ",
        "hadithText": "أَخْبَرَنَا عِمْرَانُ بْنُ بَكَّارٍ، قَالَ أَنْبَأَنَا أَحْمَدُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ صَفْوَانَ بْنِ عَبْدِ اللَّهِ، عَنْ عَمَّيْهِ، سَلَمَةَ وَيَعْلَى ابْنَىْ أُمَيَّةَ قَالاَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ وَمَعَنَا صَاحِبٌ لَنَا فَقَاتَلَ رَجُلاً مِنَ الْمُسْلِمِينَ فَعَضَّ الرَّجُلُ ذِرَاعَهُ فَجَذَبَهَا مِنْ فِيهِ فَطَرَحَ ثَنِيَّتَهُ فَأَتَى الرَّجُلُ النَّبِيَّ صلى الله عليه وسلم يَلْتَمِسُ الْعَقْلَ فَقَالَ ‏\"‏ يَنْطَلِقُ أَحَدُكُمْ إِلَى أَخِيهِ فَيَعَضُّهُ كَعَضِيضِ الْفَحْلِ ثُمَّ يَأْتِي يَطْلُبُ الْعَقْلَ لاَ عَقْلَ لَهَا ‏\"‏ ‏.‏ فَأَبْطَلَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 60,
        "matchingEnglishURN": 1086475,
        "last_updated": null
    },
    {
        "arabicURN": 1147810,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "20.00",
        "hadithNumber": "4766",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى عَطَاءٍ فِي هَذَا الْحَدِيثِ  ",
        "hadithText": "أَخْبَرَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلاَءِ بْنِ عَبْدِ الْجَبَّارِ، عَنْ سُفْيَانَ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، عَنْ صَفْوَانَ بْنِ يَعْلَى، عَنْ أَبِيهِ، أَنَّ رَجُلاً، عَضَّ يَدَ رَجُلٍ فَانْتُزِعَتْ ثَنِيَّتُهُ فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَأَهْدَرَهَا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 61,
        "matchingEnglishURN": 1086480,
        "last_updated": null
    },
    {
        "arabicURN": 1147820,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "20.00",
        "hadithNumber": "4767",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى عَطَاءٍ فِي هَذَا الْحَدِيثِ  ",
        "hadithText": "أَخْبَرَنَا عَبْدُ الْجَبَّارِ، مَرَّةً أُخْرَى عَنْ سُفْيَانَ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، عَنْ صَفْوَانَ بْنِ يَعْلَى، عَنْ يَعْلَى، وَابْنِ، جُرَيْجٍ عَنْ عَطَاءٍ، عَنْ صَفْوَانَ بْنِ يَعْلَى، عَنْ يَعْلَى، أَنَّهُ اسْتَأْجَرَ أَجِيرًا فَقَاتَلَ رَجُلاً فَعَضَّ يَدَهُ فَانْتُزِعَتْ ثَنِيَّتُهُ فَخَاصَمَهُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَيَدَعُهَا يَقْضِمُهَا كَقَضْمِ الْفَحْلِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 62,
        "matchingEnglishURN": 1086485,
        "last_updated": null
    },
    {
        "arabicURN": 1147830,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "20.00",
        "hadithNumber": "4768",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى عَطَاءٍ فِي هَذَا الْحَدِيثِ  ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا سُفْيَانُ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ صَفْوَانَ بْنِ يَعْلَى، عَنْ أَبِيهِ، قَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ فَاسْتَأْجَرْتُ أَجِيرًا فَقَاتَلَ أَجِيرِي رَجُلاً فَعَضَّ الآخَرُ فَسَقَطَتْ ثَنِيَّتُهُ فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَذَكَرَ لَهُ فَأَهْدَرَهُ النَّبِيُّ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 63,
        "matchingEnglishURN": 1086490,
        "last_updated": null
    },
    {
        "arabicURN": 1147840,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "20.00",
        "hadithNumber": "4769",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى عَطَاءٍ فِي هَذَا الْحَدِيثِ  ",
        "hadithText": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ، قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، عَنْ صَفْوَانَ بْنِ يَعْلَى، عَنْ يَعْلَى بْنِ أُمَيَّةَ، قَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم جَيْشَ الْعُسْرَةِ - وَكَانَ أَوْثَقَ عَمَلٍ لِي فِي نَفْسِي - وَكَانَ لِي أَجِيرٌ فَقَاتَلَ إِنْسَانًا فَعَضَّ أَحَدُهُمَا أُصْبَعَ صَاحِبِهِ فَانْتَزَعَ إِصْبَعَهُ فَأَنْدَرَ ثَنِيَّتَهُ فَسَقَطَتْ فَانْطَلَقَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَهْدَرَ ثَنِيَّتَهُ وَقَالَ ‏\"‏ أَفَيَدَعُ يَدَهُ فِي فِيكَ تَقْضَمُهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 64,
        "matchingEnglishURN": 1086495,
        "last_updated": null
    },
    {
        "arabicURN": 1147850,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "20.00",
        "hadithNumber": "4770",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى عَطَاءٍ فِي هَذَا الْحَدِيثِ  ",
        "hadithText": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، فِي حَدِيثِ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ عَطَاءٍ، عَنِ ابْنِ يَعْلَى، عَنْ أَبِيهِ، بِمِثْلِ الَّذِي عَضَّ فَنَدَرَتْ ثَنِيَّتُهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ دِيَةَ لَكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 65,
        "matchingEnglishURN": 1086500,
        "last_updated": null
    },
    {
        "arabicURN": 1147860,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "20.00",
        "hadithNumber": "4771",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى عَطَاءٍ فِي هَذَا الْحَدِيثِ  ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ، عَنْ عَطَاءٍ، عَنْ صَفْوَانَ بْنِ يَعْلَى ابْنِ مُنْيَةَ، أَنَّ أَجِيرًا، لِيَعْلَى ابْنِ مُنْيَةَ عَضَّ آخَرُ ذِرَاعَهُ فَانْتَزَعَهَا مِنْ فِيهِ فَرَفَعَ ذَلِكَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَقَدْ سَقَطَتْ ثَنِيَّتُهُ فَأَبْطَلَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\"‏ أَيَدَعُهَا فِي فِيكَ تَقْضَمُهَا كَقَضْمِ الْفَحْلِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 66,
        "matchingEnglishURN": 1086505,
        "last_updated": null
    },
    {
        "arabicURN": 1147870,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "20.00",
        "hadithNumber": "4772",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى عَطَاءٍ فِي هَذَا الْحَدِيثِ  ",
        "hadithText": "أَخْبَرَنِي أَبُو بَكْرِ بْنُ إِسْحَاقَ، قَالَ حَدَّثَنَا أَبُو الْجَوَّابِ، قَالَ حَدَّثَنَا عَمَّارٌ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنِ الْحَكَمِ، عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ، عَنْ صَفْوَانَ بْنِ يَعْلَى، أَنَّ أَبَاهُ، غَزَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ فَاسْتَأْجَرَ أَجِيرًا فَقَاتَلَ رَجُلاً فَعَضَّ الرَّجُلُ ذِرَاعَهُ فَلَمَّا أَوْجَعَهُ نَتَرَهَا فَأَنْدَرَ ثَنِيَّتَهُ فَرُفِعَ ذَلِكَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ يَعْمِدُ أَحَدُكُمْ فَيَعَضُّ أَخَاهُ كَمَا يَعَضُّ الْفَحْلُ ‏\"‏ ‏.‏ فَأَبْطَلَ ثَنِيَّتَهُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 67,
        "matchingEnglishURN": 1086510,
        "last_updated": null
    },
    {
        "arabicURN": 1147880,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "21.00",
        "hadithNumber": "4773",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَوَدِ فِي الطَّعْنَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا وَهْبُ بْنُ بَيَانٍ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبِيدَةَ بْنِ مُسَافِعٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ بَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْسِمُ شَيْئًا أَقْبَلَ رَجُلٌ فَأَكَبَّ عَلَيْهِ فَطَعَنَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِعُرْجُونٍ كَانَ مَعَهُ فَخَرَجَ الرَّجُلُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَعَالَ فَاسْتَقِدْ ‏\"‏ ‏.‏ قَالَ بَلْ قَدْ عَفَوْتُ يَا رَسُولَ اللَّهِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 68,
        "matchingEnglishURN": 1086515,
        "last_updated": null
    },
    {
        "arabicURN": 1147890,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "21.00",
        "hadithNumber": "4774",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَوَدِ فِي الطَّعْنَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ سَعِيدٍ الرِّبَاطِيُّ، قَالَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، أَنْبَأَنَا أَبِي قَالَ، سَمِعْتُ يَحْيَى، يُحَدِّثُ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبِيدَةَ بْنِ مُسَافِعٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ بَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْسِمُ شَيْئًا إِذْ أَكَبَّ عَلَيْهِ رَجُلٌ فَطَعَنَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِعُرْجُونٍ كَانَ مَعَهُ فَصَاحَ الرَّجُلُ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَعَالَ فَاسْتَقِدْ ‏\"‏ ‏.‏ قَالَ بَلْ عَفَوْتُ يَا رَسُولَ اللَّهِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 69,
        "matchingEnglishURN": 1086520,
        "last_updated": null
    },
    {
        "arabicURN": 1147900,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "22.00",
        "hadithNumber": "4775",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَوَدِ مِنَ اللَّطْمَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ أَنْبَأَنَا عُبَيْدُ اللَّهِ، عَنْ إِسْرَائِيلَ، عَنْ عَبْدِ الأَعْلَى، أَنَّهُ سَمِعَ سَعِيدَ بْنَ جُبَيْرٍ، يَقُولُ أَخْبَرَنِي ابْنُ عَبَّاسٍ، أَنَّ رَجُلاً، وَقَعَ فِي أَبٍ كَانَ لَهُ فِي الْجَاهِلِيَّةِ فَلَطَمَهُ الْعَبَّاسُ فَجَاءَ قَوْمُهُ فَقَالُوا لَيَلْطِمَنَّهُ كَمَا لَطَمَهُ ‏.‏ فَلَبِسُوا السِّلاَحَ فَبَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَصَعِدَ الْمِنْبَرَ فَقَالَ ‏\"‏ أَيُّهَا النَّاسُ أَىُّ أَهْلِ الأَرْضِ تَعْلَمُونَ أَكْرَمُ عَلَى اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏ فَقَالُوا أَنْتَ ‏.‏ فَقَالَ ‏\"‏ إِنَّ الْعَبَّاسَ مِنِّي وَأَنَا مِنْهُ لاَ تَسُبُّوا مَوْتَانَا فَتُؤْذُوا أَحْيَاءَنَا ‏\"‏ ‏.‏ فَجَاءَ الْقَوْمُ فَقَالُوا يَا رَسُولَ اللَّهِ نَعُوذُ بِاللَّهِ مِنْ غَضَبِكَ اسْتَغْفِرْ لَنَا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 70,
        "matchingEnglishURN": 1086525,
        "last_updated": null
    },
    {
        "arabicURN": 1147910,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "23.00",
        "hadithNumber": "4776",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَوَدِ مِنَ الْجَبْذَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَلِيِّ بْنِ مَيْمُونٍ، قَالَ حَدَّثَنِي الْقَعْنَبِيُّ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ هِلاَلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كُنَّا نَقْعُدُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ فَإِذَا قَامَ قُمْنَا فَقَامَ يَوْمًا وَقُمْنَا مَعَهُ حَتَّى لَمَّا بَلَغَ وَسَطَ الْمَسْجِدِ أَدْرَكَهُ رَجُلٌ فَجَبَذَ بِرِدَائِهِ مِنْ وَرَائِهِ - وَكَانَ رِدَاؤُهُ خَشِنًا - فَحَمَّرَ رَقَبَتَهُ فَقَالَ يَا مُحَمَّدُ احْمِلْ لِي عَلَى بَعِيرَىَّ هَذَيْنِ فَإِنَّكَ لاَ تَحْمِلُ مِنْ مَالِكَ وَلاَ مِنْ مَالِ أَبِيكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ وَأَسْتَغْفِرُ اللَّهَ لاَ أَحْمِلُ لَكَ حَتَّى تُقِيدَنِي مِمَّا جَبَذْتَ بِرَقَبَتِي ‏\"‏ ‏.‏ فَقَالَ الأَعْرَابِيُّ لاَ وَاللَّهِ لاَ أُقِيدُكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَلِكَ ثَلاَثَ مَرَّاتٍ كُلُّ ذَلِكَ يَقُولُ لاَ وَاللَّهِ لاَ أُقِيدُكَ ‏.‏ فَلَمَّا سَمِعْنَا قَوْلَ الأَعْرَابِيِّ أَقْبَلْنَا إِلَيْهِ سِرَاعًا فَالْتَفَتَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ عَزَمْتُ عَلَى مَنْ سَمِعَ كَلاَمِي أَنْ لاَ يَبْرَحَ مَقَامَهُ حَتَّى آذَنَ لَهُ ‏\"‏ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِرَجُلٍ مِنَ الْقَوْمِ ‏\"‏ يَا فُلاَنُ احْمِلْ لَهُ عَلَى بَعِيرٍ شَعِيرًا وَعَلَى بَعِيرٍ تَمْرًا ‏\"‏ ‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ انْصَرِفُوا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 71,
        "matchingEnglishURN": 1086530,
        "last_updated": null
    },
    {
        "arabicURN": 1147920,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "24.00",
        "hadithNumber": "4777",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقِصَاصِ مِنَ السَّلاَطِينِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُؤَمَّلُ بْنُ هِشَامٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا أَبُو مَسْعُودٍ، سَعِيدُ بْنُ إِيَاسٍ الْجُرَيْرِيُّ عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي فِرَاسٍ، أَنَّ عُمَرَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُقِصُّ مِنْ نَفْسِهِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 72,
        "matchingEnglishURN": 1086535,
        "last_updated": null
    },
    {
        "arabicURN": 1147930,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "25.00",
        "hadithNumber": "4778",
        "bookName": " كتاب القسامة",
        "babName": " باب السُّلْطَانُ يُصَابُ عَلَى يَدِهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَ أَبَا جَهْمِ بْنَ حُذَيْفَةَ مُصَدِّقًا فَلاَحَّهُ رَجُلٌ فِي صَدَقَتِهِ فَضَرَبَهُ أَبُو جَهْمٍ فَأَتَوُا النَّبِيَّ صلى الله عليه وسلم فَقَالَ الْقَوَدُ يَا رَسُولَ اللَّهِ فَقَالَ ‏\"‏ لَكُمْ كَذَا وَكَذَا ‏\"‏ ‏.‏ فَلَمْ يَرْضَوْا بِهِ فَقَالَ ‏\"‏ لَكُمْ كَذَا وَكَذَا ‏\"‏ ‏.‏ فَرَضُوا بِهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنِّي خَاطِبٌ عَلَى النَّاسِ وَمُخْبِرُهُمْ بِرِضَاكُمْ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ فَخَطَبَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ إِنَّ هَؤُلاَءِ أَتَوْنِي يُرِيدُونَ الْقَوَدَ فَعَرَضْتُ عَلَيْهِمْ كَذَا وَكَذَا فَرَضُوا ‏\"‏ ‏.‏ قَالُوا لاَ ‏.‏ فَهَمَّ الْمُهَاجِرُونَ بِهِمْ فَأَمَرَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَكُفُّوا فَكَفُّوا ثُمَّ دَعَاهُمْ قَالَ ‏\"‏ أَرَضِيتُمْ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ قَالَ ‏\"‏ فَإِنِّي خَاطِبٌ عَلَى النَّاسِ وَمُخْبِرُهُمْ بِرِضَاكُمْ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ فَخَطَبَ النَّاسَ ثُمَّ قَالَ ‏\"‏ أَرَضِيتُمْ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 73,
        "matchingEnglishURN": 1086540,
        "last_updated": null
    },
    {
        "arabicURN": 1147940,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "26.00",
        "hadithNumber": "4779",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَوَدِ بِغَيْرِ حَدِيدَةٍ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ شُعْبَةَ، عَنْ هِشَامِ بْنِ زَيْدٍ، عَنْ أَنَسٍ، أَنَّ يَهُودِيًّا، رَأَى عَلَى جَارِيَةٍ أَوْضَاحًا فَقَتَلَهَا بِحَجَرٍ فَأُتِيَ بِهَا النَّبِيُّ صلى الله عليه وسلم وَبِهَا رَمَقٌ فَقَالَ ‏\"‏ أَقَتَلَكِ فُلاَنٌ ‏\"‏ ‏.‏ فَأَشَارَ شُعْبَةُ بِرَأْسِهِ يَحْكِيهَا أَنْ لاَ ‏.‏ فَقَالَ ‏\"‏ أَقَتَلَكِ فُلاَنٌ ‏\"‏ ‏.‏ فَأَشَارَ شُعْبَةُ بِرَأْسِهِ يَحْكِيهَا أَنْ لاَ ‏.‏ قَالَ ‏\"‏ أَقَتَلَكِ فُلاَنٌ ‏\"‏ ‏.‏ فَأَشَارَ شُعْبَةُ بِرَأْسِهِ يَحْكِيهَا أَنْ نَعَمْ ‏.‏ فَدَعَا بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَتَلَهُ بَيْنَ حَجَرَيْنِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 74,
        "matchingEnglishURN": 1086545,
        "last_updated": null
    },
    {
        "arabicURN": 1147950,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "26.00",
        "hadithNumber": "4780",
        "bookName": " كتاب القسامة",
        "babName": " باب الْقَوَدِ بِغَيْرِ حَدِيدَةٍ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو خَالِدٍ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ سَرِيَّةً إِلَى قَوْمٍ مِنْ خَثْعَمٍ فَاسْتَعْصَمُوا بِالسُّجُودِ فَقُتِلُوا فَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم بِنِصْفِ الْعَقْلِ وَقَالَ ‏\"‏ إِنِّي بَرِيءٌ مِنْ كُلِّ مُسْلِمٍ مَعَ مُشْرِكٍ ‏\"‏ ‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلاَ لاَ تَرَاءَى نَارَاهُمَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 75,
        "matchingEnglishURN": 1086550,
        "last_updated": null
    },
    {
        "arabicURN": 1147960,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "27.00",
        "hadithNumber": "4781",
        "bookName": " كتاب القسامة",
        "babName": " باب تَأْوِيلِ قَوْلِهِ عَزَّ وَجَلَّ <A id=\"q1\" name=\"q1\" href=\"javascript:openquran(1,178,178)\"><c_q1>‏{‏ فَمَنْ عُفِيَ لَهُ مِنْ أَخِيهِ شَىْءٌ فَاتِّبَاعٌ بِالْمَعْرُوفِ وَأَدَاءٌ إِلَيْهِ بِإِحْسَانٍ ‏}‏</c_q1></a> ‏.‏",
        "hadithText": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنْ سُفْيَانَ، عَنْ عَمْرٍو، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ فِي بَنِي إِسْرَائِيلَ الْقِصَاصُ وَلَمْ تَكُنْ فِيهِمُ الدِّيَةُ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏<A id=\"q2\" name=\"q2\" href=\"javascript:openquran(1,178,178)\"><c_q2>{‏ كُتِبَ عَلَيْكُمُ الْقِصَاصُ فِي الْقَتْلَى الْحُرُّ بِالْحُرِّ وَالْعَبْدُ بِالْعَبْدِ وَالأُنْثَى بِالأُنْثَى ‏}</c_q2></a>‏ إِلَى قَوْلِهِ ‏<A id=\"q3\" name=\"q3\" href=\"javascript:openquran(1,178,178)\"><c_q3>{‏ فَمَنْ عُفِيَ لَهُ مِنْ أَخِيهِ شَىْءٌ فَاتِّبَاعٌ بِالْمَعْرُوفِ وَأَدَاءٌ إِلَيْهِ بِإِحْسَانٍ ‏}</c_q3></a>‏ فَالْعَفْوُ أَنْ يَقْبَلَ الدِّيَةَ فِي الْعَمْدِ وَاتِّبَاعٌ بِمَعْرُوفٍ يَقُولُ يَتَّبِعُ هَذَا بِالْمَعْرُوفِ وَأَدَاءٌ بِإِحْسَانٍ وَيُؤَدِّي هَذَا بِإِحْسَانٍ ‏<A id=\"q4\" name=\"q4\" href=\"javascript:openquran(1,178,178)\"><c_q4>{‏ ذَلِكَ تَخْفِيفٌ مِنْ رَبِّكُمْ وَرَحْمَةٌ ‏}</c_q4></a>‏ مِمَّا كُتِبَ عَلَى مَنْ كَانَ قَبْلَكُمْ إِنَّمَا هُوَ الْقِصَاصُ لَيْسَ الدِّيَةَ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 76,
        "matchingEnglishURN": 1086555,
        "last_updated": null
    },
    {
        "arabicURN": 1147970,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "27.00",
        "hadithNumber": "4782",
        "bookName": " كتاب القسامة",
        "babName": " باب تَأْوِيلِ قَوْلِهِ عَزَّ وَجَلَّ <A id=\"q1\" name=\"q1\" href=\"javascript:openquran(1,178,178)\"><c_q1>‏{‏ فَمَنْ عُفِيَ لَهُ مِنْ أَخِيهِ شَىْءٌ فَاتِّبَاعٌ بِالْمَعْرُوفِ وَأَدَاءٌ إِلَيْهِ بِإِحْسَانٍ ‏}‏</c_q1></a> ‏.‏",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ حَفْصٍ، قَالَ حَدَّثَنَا وَرْقَاءُ، عَنْ عَمْرٍو، عَنْ مُجَاهِدٍ، قَالَ ‏<A id=\"q5\" name=\"q5\" href=\"javascript:openquran(1,178,178)\"><c_q5>{‏ كُتِبَ عَلَيْكُمُ الْقِصَاصُ فِي الْقَتْلَى الْحُرُّ بِالْحُرِّ ‏}</c_q5></a>‏ قَالَ كَانَ بَنُو إِسْرَائِيلَ عَلَيْهِمُ الْقِصَاصُ وَلَيْسَ عَلَيْهِمُ الدِّيَةَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ عَلَيْهِمُ الدِّيَةَ فَجَعَلَهَا عَلَى هَذِهِ الأُمَّةِ تَخْفِيفًا عَلَى مَا كَانَ عَلَى بَنِي إِسْرَائِيلَ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 77,
        "matchingEnglishURN": 1086560,
        "last_updated": null
    },
    {
        "arabicURN": 1147980,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "28.00",
        "hadithNumber": "4783",
        "bookName": " كتاب القسامة",
        "babName": " باب الأَمْرِ بِالْعَفْوِ عَنِ الْقِصَاصِ، ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، - وَهُوَ ابْنُ بَكْرِ بْنِ عَبْدِ اللَّهِ الْمُزَنِيُّ - عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ، عَنْ أَنَسٍ، قَالَ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي قِصَاصٍ فَأَمَرَ فِيهِ بِالْعَفْوِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 78,
        "matchingEnglishURN": 1086565,
        "last_updated": null
    },
    {
        "arabicURN": 1147990,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "28.00",
        "hadithNumber": "4784",
        "bookName": " كتاب القسامة",
        "babName": " باب الأَمْرِ بِالْعَفْوِ عَنِ الْقِصَاصِ، ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، وَبَهْزُ بْنُ أَسَدٍ، وَعَفَّانُ بْنُ مُسْلِمٍ، قَالُوا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ الْمُزَنِيُّ، قَالَ حَدَّثَنَا عَطَاءُ بْنُ أَبِي مَيْمُونَةَ، وَلاَ أَعْلَمُهُ إِلاَّ عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ مَا أُتِيَ النَّبِيُّ صلى الله عليه وسلم فِي شَىْءٍ فِيهِ قِصَاصٌ إِلاَّ أَمَرَ فِيهِ بِالْعَفْوِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 79,
        "matchingEnglishURN": 1086570,
        "last_updated": null
    },
    {
        "arabicURN": 1148000,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "29.00",
        "hadithNumber": "4785",
        "bookName": " كتاب القسامة",
        "babName": " باب هَلْ يُؤْخَذُ مِنْ قَاتِلِ الْعَمْدِ الدِّيَةَ إِذَا عَفَا وَلِيُّ الْمَقْتُولِ عَنِ الْقَوَدِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَشْعَثَ، قَالَ حَدَّثَنَا أَبُو مُسْهِرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ عَبْدِ اللَّهِ بْنِ سَمَاعَةَ - قَالَ أَنْبَأَنَا الأَوْزَاعِيُّ، قَالَ أَخْبَرَنِي يَحْيَى، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ قُتِلَ لَهُ قَتِيلٌ فَهُوَ بِخَيْرِ النَّظَرَيْنِ إِمَّا أَنْ يُقَادَ وَإِمَّا أَنْ يُفْدَى ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 80,
        "matchingEnglishURN": 1086575,
        "last_updated": null
    },
    {
        "arabicURN": 1148010,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "29.00",
        "hadithNumber": "4786",
        "bookName": " كتاب القسامة",
        "babName": " باب هَلْ يُؤْخَذُ مِنْ قَاتِلِ الْعَمْدِ الدِّيَةَ إِذَا عَفَا وَلِيُّ الْمَقْتُولِ عَنِ الْقَوَدِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ بْنِ مَزْيَدَ، قَالَ أَخْبَرَنِي أَبِي قَالَ، حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، قَالَ حَدَّثَنَا أَبُو هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ قُتِلَ لَهُ قَتِيلٌ فَهُوَ بِخَيْرِ النَّظَرَيْنِ إِمَّا أَنْ يُقَادَ وَإِمَّا أَنْ يُفْدَى ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 81,
        "matchingEnglishURN": 1086580,
        "last_updated": null
    },
    {
        "arabicURN": 1148020,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "29.00",
        "hadithNumber": "4787",
        "bookName": " كتاب القسامة",
        "babName": " باب هَلْ يُؤْخَذُ مِنْ قَاتِلِ الْعَمْدِ الدِّيَةَ إِذَا عَفَا وَلِيُّ الْمَقْتُولِ عَنِ الْقَوَدِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا ‏{‏ أَحْمَدُ بْنُ، ‏}‏ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ قَالَ أَنْبَأَنَا ابْنُ عَائِذٍ، قَالَ حَدَّثَنَا يَحْيَى، - هُوَ ابْنُ حَمْزَةَ - قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ قُتِلَ لَهُ قَتِيلٌ ‏\"‏ ‏.‏ مُرْسَلٌ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 82,
        "matchingEnglishURN": 1086585,
        "last_updated": null
    },
    {
        "arabicURN": 1148030,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "30.00",
        "hadithNumber": "4788",
        "bookName": " كتاب القسامة",
        "babName": " باب عَفْوِ النِّسَاءِ عَنِ الدَّمِ، ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا الْوَلِيدُ، عَنِ الأَوْزَاعِيِّ، قَالَ حَدَّثَنِي حِصْنٌ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، ح وَأَنْبَأَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ حَدَّثَنَا الْوَلِيدُ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي حِصْنٌ، أَنَّهُ سَمِعَ أَبَا سَلَمَةَ، يُحَدِّثُ عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ وَعَلَى الْمُقْتَتِلِينَ أَنْ يَنْحَجِزُوا الأَوَّلَ فَالأَوَّلَ وَإِنْ كَانَتِ امْرَأَةٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 83,
        "matchingEnglishURN": 1086590,
        "last_updated": null
    },
    {
        "arabicURN": 1148040,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "31.00",
        "hadithNumber": "4789",
        "bookName": " كتاب القسامة",
        "babName": " باب مَنْ قُتِلَ بِحَجَرٍ أَوْ سَوْطٍ ‏‏ ",
        "hadithText": "أَخْبَرَنَا هِلاَلُ بْنُ الْعَلاَءِ بْنِ هِلاَلٍ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، قَالَ أَنْبَأَنَا سُلَيْمَانُ بْنُ كَثِيرٍ، قَالَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ قُتِلَ فِي عِمِّيَا أَوْ رِمِّيَا تَكُونُ بَيْنَهُمْ بِحَجَرٍ أَوْ سَوْطٍ أَوْ بِعَصًا فَعَقْلُهُ عَقْلُ خَطَإٍ وَمَنْ قَتَلَ عَمْدًا فَقَوَدُ يَدِهِ فَمَنْ حَالَ بَيْنَهُ وَبَيْنَهُ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ لاَ يُقْبَلُ مِنْهُ صَرْفٌ وَلاَ عَدْلٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 84,
        "matchingEnglishURN": 1086595,
        "last_updated": null
    },
    {
        "arabicURN": 1148050,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "31.00",
        "hadithNumber": "4790",
        "bookName": " كتاب القسامة",
        "babName": " باب مَنْ قُتِلَ بِحَجَرٍ أَوْ سَوْطٍ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ كَثِيرٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، يَرْفَعُهُ قَالَ ‏\"‏ مَنْ قُتِلَ فِي عِمِّيَّةٍ أَوْ رِمِّيَّةٍ بِحَجَرٍ أَوْ سَوْطٍ أَوْ عَصًا فَعَقْلُهُ عَقْلُ الْخَطَإِ وَمَنْ قُتِلَ عَمْدًا فَهُوَ قَوَدٌ وَمَنْ حَالَ بَيْنَهُ وَبَيْنَهُ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ لاَ يَقْبَلُ اللَّهُ مِنْهُ صَرْفًا وَلاَ عَدْلاً ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 85,
        "matchingEnglishURN": 1086600,
        "last_updated": null
    },
    {
        "arabicURN": 1148060,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "32.00",
        "hadithNumber": "4791",
        "bookName": " كتاب القسامة",
        "babName": " باب كَمْ دِيَةُ شِبْهِ الْعَمْدِ وَذِكْرِ الاِخْتِلاَفِ عَلَى أَيُّوبَ فِي حَدِيثِ الْقَاسِمِ بْنِ رَبِيعَةَ فِيهِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، عَنِ الْقَاسِمِ بْنِ رَبِيعَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ قَتِيلُ الْخَطَإِ شِبْهِ الْعَمْدِ بِالسَّوْطِ أَوِ الْعَصَا مِائَةٌ مِنَ الإِبِلِ أَرْبَعُونَ مِنْهَا فِي بُطُونِهَا أَوْلاَدُهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 86,
        "matchingEnglishURN": 1086605,
        "last_updated": null
    },
    {
        "arabicURN": 1148070,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "32.00",
        "hadithNumber": "4792",
        "bookName": " كتاب القسامة",
        "babName": " باب كَمْ دِيَةُ شِبْهِ الْعَمْدِ وَذِكْرِ الاِخْتِلاَفِ عَلَى أَيُّوبَ فِي حَدِيثِ الْقَاسِمِ بْنِ رَبِيعَةَ فِيهِ ‏‏ ",
        "hadithText": "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يُونُسُ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنِ الْقَاسِمِ بْنِ رَبِيعَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَطَبَ يَوْمَ الْفَتْحِ ‏.‏ مُرْسَلٌ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 87,
        "matchingEnglishURN": 1086610,
        "last_updated": null
    },
    {
        "arabicURN": 1148080,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "33.00",
        "hadithNumber": "4793",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى خَالِدٍ الْحَذَّاءِ  ",
        "hadithText": "أَخْبَرَنِي يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ، قَالَ أَنْبَأَنَا حَمَّادٌ، عَنْ خَالِدٍ، - يَعْنِي الْحَذَّاءَ - عَنِ الْقَاسِمِ بْنِ رَبِيعَةَ، عَنْ عُقْبَةَ بْنِ أَوْسٍ، عَنْ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَلاَ وَإِنَّ قَتِيلَ الْخَطَإِ شِبْهِ الْعَمْدِ مَا كَانَ بِالسَّوْطِ وَالْعَصَا مِائَةٌ مِنَ الإِبِلِ أَرْبَعُونَ فِي بُطُونِهَا أَوْلاَدُهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 88,
        "matchingEnglishURN": 1086615,
        "last_updated": null
    },
    {
        "arabicURN": 1148090,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "33.00",
        "hadithNumber": "4794",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى خَالِدٍ الْحَذَّاءِ  ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ كَامِلٍ، قَالَ حَدَّثَنَا هُشَيْمٌ، عَنْ خَالِدٍ، عَنِ الْقَاسِمِ بْنِ رَبِيعَةَ، عَنْ عُقْبَةَ بْنِ أَوْسٍ، عَنْ رَجُلٍ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم قَالَ خَطَبَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ فَتْحِ مَكَّةَ فَقَالَ ‏\"‏ أَلاَ وَإِنَّ قَتِيلَ الْخَطَإِ شِبْهِ الْعَمْدِ بِالسَّوْطِ وَالْعَصَا وَالْحَجَرِ مِائَةٌ مِنَ الإِبِلِ فِيهَا أَرْبَعُونَ ثَنِيَّةً إِلَى بَازِلِ عَامِهَا كُلُّهُنَّ خَلِفَةٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 89,
        "matchingEnglishURN": 1086620,
        "last_updated": null
    },
    {
        "arabicURN": 1148100,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "33.00",
        "hadithNumber": "4795",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى خَالِدٍ الْحَذَّاءِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، عَنِ ابْنِ أَبِي عَدِيٍّ، عَنْ خَالِدٍ، عَنِ الْقَاسِمِ، عَنْ عُقْبَةَ بْنِ أَوْسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَلاَ إِنَّ قَتِيلَ الْخَطَإِ قَتِيلَ السَّوْطِ وَالْعَصَا فِيهِ مِائَةٌ مِنَ الإِبِلِ مُغَلَّظَةٌ أَرْبَعُونَ مِنْهَا فِي بُطُونِهَا أَوْلاَدُهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 90,
        "matchingEnglishURN": 1086625,
        "last_updated": null
    },
    {
        "arabicURN": 1148110,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "33.00",
        "hadithNumber": "4796",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى خَالِدٍ الْحَذَّاءِ  ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنِ الْقَاسِمِ بْنِ رَبِيعَةَ، عَنْ يَعْقُوبَ بْنِ أَوْسٍ، عَنْ رَجُلٍ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا دَخَلَ مَكَّةَ يَوْمَ الْفَتْحِ قَالَ ‏\"‏ أَلاَ وَإِنَّ كُلَّ قَتِيلِ خَطَإِ الْعَمْدِ أَوْ شِبْهِ الْعَمْدِ قَتِيلِ السَّوْطِ وَالْعَصَا مِنْهَا أَرْبَعُونَ فِي بُطُونِهَا أَوْلاَدُهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 91,
        "matchingEnglishURN": 1086630,
        "last_updated": null
    },
    {
        "arabicURN": 1148120,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "33.00",
        "hadithNumber": "4797",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى خَالِدٍ الْحَذَّاءِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ حَدَّثَنَا خَالِدٌ، عَنِ الْقَاسِمِ بْنِ رَبِيعَةَ، عَنْ يَعْقُوبَ بْنِ أَوْسٍ، أَنَّ رَجُلاً، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا قَدِمَ مَكَّةَ عَامَ الْفَتْحِ قَالَ ‏\"‏ أَلاَ وَإِنَّ قَتِيلَ الْخَطَإِ الْعَمْدِ قَتِيلَ السَّوْطِ وَالْعَصَا مِنْهَا أَرْبَعُونَ فِي بُطُونِهَا أَوْلاَدُهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 92,
        "matchingEnglishURN": 1086635,
        "last_updated": null
    },
    {
        "arabicURN": 1148130,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "33.00",
        "hadithNumber": "4798",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى خَالِدٍ الْحَذَّاءِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ، قَالَ أَنْبَأَنَا يَزِيدُ، عَنْ خَالِدٍ، عَنِ الْقَاسِمِ بْنِ رَبِيعَةَ، عَنْ يَعْقُوبَ بْنِ أَوْسٍ، أَنَّ رَجُلاً، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم حَدَّثَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ مَكَّةَ عَامَ الْفَتْحِ قَالَ ‏\"‏ أَلاَ وَإِنَّ قَتِيلَ الْخَطَإِ الْعَمْدِ قَتِيلَ السَّوْطِ وَالْعَصَا مِنْهَا أَرْبَعُونَ فِي بُطُونِهَا أَوْلاَدُهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 93,
        "matchingEnglishURN": 1086640,
        "last_updated": null
    },
    {
        "arabicURN": 1148140,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "33.00",
        "hadithNumber": "4799",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى خَالِدٍ الْحَذَّاءِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا ابْنُ جُدْعَانَ، سَمِعَهُ مِنَ الْقَاسِمِ بْنِ رَبِيعَةَ، عَنِ ابْنِ عُمَرَ، قَالَ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ فَتْحِ مَكَّةَ عَلَى دَرَجَةِ الْكَعْبَةِ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَقَالَ ‏\"‏ الْحَمْدُ لِلَّهِ الَّذِي صَدَقَ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الأَحْزَابَ وَحْدَهُ أَلاَ إِنَّ قَتِيلَ الْعَمْدِ الْخَطَإِ بِالسَّوْطِ وَالْعَصَا شِبْهِ الْعَمْدِ فِيهِ مِائَةٌ مِنَ الإِبِلِ مُغَلَّظَةٌ مِنْهَا أَرْبَعُونَ خَلِفَةٌ فِي بُطُونِهَا أَوْلاَدُهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 94,
        "matchingEnglishURN": 1086645,
        "last_updated": null
    },
    {
        "arabicURN": 1148150,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "33.00",
        "hadithNumber": "4800",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى خَالِدٍ الْحَذَّاءِ  ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا سَهْلُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا حُمَيْدٌ، عَنِ الْقَاسِمِ بْنِ رَبِيعَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الْخَطَأُ شِبْهُ الْعَمْدِ - يَعْنِي بِالْعَصَا وَالسَّوْطِ - مِائَةٌ مِنَ الإِبِلِ مِنْهَا أَرْبَعُونَ فِي بُطُونِهَا أَوْلاَدُهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 95,
        "matchingEnglishURN": 1086650,
        "last_updated": null
    },
    {
        "arabicURN": 1148160,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "33.00",
        "hadithNumber": "4801",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ الاِخْتِلاَفِ عَلَى خَالِدٍ الْحَذَّاءِ  ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ رَاشِدٍ، عَنْ سُلَيْمَانَ بْنِ مُوسَى، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ قُتِلَ خَطَأً فَدِيَتُهُ مِائَةٌ مِنَ الإِبِلِ ثَلاَثُونَ بِنْتَ مَخَاضٍ وَثَلاَثُونَ بِنْتَ لَبُونٍ وَثَلاَثُونَ حِقَّةً وَعَشْرَةٌ بَنِي لَبُونٍ ذُكُورٍ ‏\"‏ ‏.‏ قَالَ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُقَوِّمُهَا عَلَى أَهْلِ الْقُرَى أَرْبَعَمِائَةَ دِينَارٍ أَوْ عِدْلَهَا مِنَ الْوَرِقِ وَيُقَوِّمُهَا عَلَى أَهْلِ الإِبِلِ إِذَا غَلَتْ رَفَعَ فِي قِيمَتِهَا وَإِذَا هَانَتْ نَقَصَ مِنْ قِيمَتِهَا عَلَى نَحْوِ الزَّمَانِ مَا كَانَ فَبَلَغَ قِيمَتُهَا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم مَا بَيْنَ الأَرْبَعِمِائَةِ دِينَارٍ إِلَى ثَمَانَمِائَةِ دِينَارٍ أَوْ عِدْلَهَا مِنَ الْوَرِقِ ‏.‏ قَالَ وَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَّ مَنْ كَانَ عَقْلُهُ فِي الْبَقَرِ عَلَى أَهْلِ الْبَقَرِ مِائَتَىْ بَقَرَةٍ وَمَنْ كَانَ عَقْلُهُ فِي الشَّاةِ أَلْفَىْ شَاةٍ وَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَّ الْعَقْلَ مِيرَاثٌ بَيْنَ وَرَثَةِ الْقَتِيلِ عَلَى فَرَائِضِهِمْ فَمَا فَضَلَ فَلِلْعَصَبَةِ وَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَعْقِلَ عَلَى الْمَرْأَةِ عَصَبَتُهَا مَنْ كَانُوا وَلاَ يَرِثُونَ مِنْهُ شَيْئًا إِلاَّ مَا فَضَلَ عَنْ وَرَثَتِهَا وَإِنْ قُتِلَتْ فَعَقْلُهَا بَيْنَ وَرَثَتِهَا وَهُمْ يَقْتُلُونَ قَاتِلَهَا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 96,
        "matchingEnglishURN": 1086655,
        "last_updated": null
    },
    {
        "arabicURN": 1148170,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "34.00",
        "hadithNumber": "4802",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ أَسْنَانِ دِيَةِ الْخَطَإِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ سَعِيدِ بْنِ مَسْرُوقٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، عَنْ حَجَّاجٍ، عَنْ زَيْدِ بْنِ جُبَيْرٍ، عَنْ خِشْفِ بْنِ مَالِكٍ، قَالَ سَمِعْتُ ابْنَ مَسْعُودٍ، يَقُولُ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم دِيَةَ الْخَطَإِ عِشْرِينَ بِنْتَ مَخَاضٍ وَعِشْرِينَ ابْنَ مَخَاضٍ ذُكُورًا وَعِشْرِينَ بِنْتَ لَبُونٍ وَعِشْرِينَ جَذَعَةً وَعِشْرِينَ حِقَّةً ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 97,
        "matchingEnglishURN": 1086660,
        "last_updated": null
    },
    {
        "arabicURN": 1148180,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "35.00",
        "hadithNumber": "4803",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ الدِّيَةِ مِنَ الْوَرِقِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ مُعَاذِ بْنِ هَانِئٍ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ مُسْلِمٍ، قَالَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، ح وَأَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هَانِئٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَتَلَ رَجُلٌ رَجُلاً عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَجَعَلَ النَّبِيُّ صلى الله عليه وسلم دِيَتَهُ اثْنَىْ عَشَرَ أَلْفًا وَذَكَرَ قَوْلَهُ إِلاَّ أَنْ أَغْنَاهُمُ اللَّهُ وَرَسُولُهُ مِنْ فَضْلِهِ فِي أَخْذِهِمُ الدِّيَةَ ‏.‏ وَاللَّفْظُ لأَبِي دَاوُدَ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 98,
        "matchingEnglishURN": 1086665,
        "last_updated": null
    },
    {
        "arabicURN": 1148190,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "35.00",
        "hadithNumber": "4804",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ الدِّيَةِ مِنَ الْوَرِقِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَيْمُونٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ عِكْرِمَةَ، سَمِعْنَاهُ مَرَّةً، يَقُولُ عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَضَى بِاثْنَىْ عَشَرَ أَلْفًا يَعْنِي فِي الدِّيَةِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 99,
        "matchingEnglishURN": 1086670,
        "last_updated": null
    },
    {
        "arabicURN": 1148200,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "36.00",
        "hadithNumber": "4805",
        "bookName": " كتاب القسامة",
        "babName": " باب عَقْلِ الْمَرْأَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، قَالَ حَدَّثَنَا ضَمْرَةُ، عَنْ إِسْمَاعِيلَ بْنِ عَيَّاشٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ عَقْلُ الْمَرْأَةِ مِثْلُ عَقْلِ الرَّجُلِ حَتَّى يَبْلُغَ الثُّلُثَ مِنْ دِيَتِهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 100,
        "matchingEnglishURN": 1086675,
        "last_updated": null
    },
    {
        "arabicURN": 1148210,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "37.00",
        "hadithNumber": "4806",
        "bookName": " كتاب القسامة",
        "babName": " باب كَمْ دِيَةُ الْكَافِرِ  ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ مُحَمَّدِ بْنِ رَاشِدٍ، عَنْ سُلَيْمَانَ بْنِ مُوسَى، وَذَكَرَ، كَلِمَةً مَعْنَاهَا عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ عَقْلُ أَهْلِ الذِّمَّةِ نِصْفُ عَقْلِ الْمُسْلِمِينَ ‏\"‏ ‏.‏ وَهُمُ الْيَهُودُ وَالنَّصَارَى ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 101,
        "matchingEnglishURN": 1086680,
        "last_updated": null
    },
    {
        "arabicURN": 1148220,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "37.00",
        "hadithNumber": "4807",
        "bookName": " كتاب القسامة",
        "babName": " باب كَمْ دِيَةُ الْكَافِرِ  ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ عَقْلُ الْكَافِرِ نِصْفُ عَقْلِ الْمُؤْمِنِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 102,
        "matchingEnglishURN": 1086685,
        "last_updated": null
    },
    {
        "arabicURN": 1148230,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "38.00",
        "hadithNumber": "4808",
        "bookName": " كتاب القسامة",
        "babName": " باب دِيَةِ الْمُكَاتَبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْمُكَاتَبِ يُقْتَلُ بِدِيَةِ الْحُرِّ عَلَى قَدْرِ مَا أَدَّى ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 103,
        "matchingEnglishURN": 1086690,
        "last_updated": null
    },
    {
        "arabicURN": 1148240,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "38.00",
        "hadithNumber": "4809",
        "bookName": " كتاب القسامة",
        "babName": " باب دِيَةِ الْمُكَاتَبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عَبْدِ الرَّحْمَنِ الطَّرَائِفِيُّ، قَالَ حَدَّثَنَا مُعَاوِيَةُ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَضَى فِي الْمُكَاتَبِ أَنْ يُودَى بِقَدْرِ مَا عَتَقَ مِنْهُ دِيَةَ الْحُرِّ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 104,
        "matchingEnglishURN": 1086695,
        "last_updated": null
    },
    {
        "arabicURN": 1148250,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "38.00",
        "hadithNumber": "4810",
        "bookName": " كتاب القسامة",
        "babName": " باب دِيَةِ الْمُكَاتَبِ ‏‏ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَعْلَى، عَنِ الْحَجَّاجِ الصَّوَّافِ، عَنْ يَحْيَى، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْمُكَاتَبِ يُودَى بِقَدْرِ مَا أَدَّى مِنْ مُكَاتَبَتِهِ دِيَةَ الْحُرِّ وَمَا بَقِيَ دِيَةَ الْعَبْدِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 105,
        "matchingEnglishURN": 1086700,
        "last_updated": null
    },
    {
        "arabicURN": 1148260,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "38.00",
        "hadithNumber": "4811",
        "bookName": " كتاب القسامة",
        "babName": " باب دِيَةِ الْمُكَاتَبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى بْنِ النَّقَّاشِ، قَالَ حَدَّثَنَا يَزِيدُ، - يَعْنِي ابْنَ هَارُونَ - قَالَ أَنْبَأَنَا حَمَّادٌ، عَنْ قَتَادَةَ، عَنْ خِلاَسٍ، عَنْ عَلِيٍّ، وَعَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الْمُكَاتَبُ يَعْتِقُ بِقَدْرِ مَا أَدَّى وَيُقَامُ عَلَيْهِ الْحَدُّ بِقَدْرِ مَا عَتَقَ مِنْهُ وَيَرِثُ بِقَدْرِ مَا عَتَقَ مِنْهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 106,
        "matchingEnglishURN": 1086705,
        "last_updated": null
    },
    {
        "arabicURN": 1148270,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "38.00",
        "hadithNumber": "4812",
        "bookName": " كتاب القسامة",
        "babName": " باب دِيَةِ الْمُكَاتَبِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الأَشْعَثِيُّ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، وَعَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ مُكَاتَبًا، قُتِلَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَمَرَ أَنْ يُودَى مَا أَدَّى دِيَةَ الْحُرِّ وَمَا لاَ دِيَةَ الْمَمْلُوكِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 107,
        "matchingEnglishURN": 1086710,
        "last_updated": null
    },
    {
        "arabicURN": 1148280,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "39.00",
        "hadithNumber": "4813",
        "bookName": " كتاب القسامة",
        "babName": " باب دِيَةِ جَنِينِ الْمَرْأَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، وَإِبْرَاهِيمُ بْنُ يُونُسَ بْنِ مُحَمَّدٍ، قَالاَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، قَالَ حَدَّثَنَا يُوسُفُ بْنُ صُهَيْبٍ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ امْرَأَةً، خَذَفَتِ امْرَأَةً فَأَسْقَطَتْ فَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي وَلَدِهَا خَمْسِينَ شَاةً وَنَهَى يَوْمَئِذٍ عَنِ الْخَذْفِ ‏.‏ أَرْسَلَهُ أَبُو نُعَيْمٍ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 108,
        "matchingEnglishURN": 1086715,
        "last_updated": null
    },
    {
        "arabicURN": 1148290,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "39.00",
        "hadithNumber": "4814",
        "bookName": " كتاب القسامة",
        "babName": " باب دِيَةِ جَنِينِ الْمَرْأَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا يُوسُفُ بْنُ صُهَيْبٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، أَنَّ امْرَأَةً، خَذَفَتِ امْرَأَةً فَأَسْقَطَتِ الْمَخْذُوفَةُ فَرُفِعَ ذَلِكَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَجَعَلَ عَقْلَ وَلَدِهَا خَمْسَمِائَةٍ مِنَ الْغُرِّ وَنَهَى يَوْمَئِذٍ عَنِ الْخَذْفِ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا وَهْمٌ وَيَنْبَغِي أَنْ يَكُونَ أَرَادَ مِائَةً مِنَ الْغُرِّ ‏.‏ وَقَدْ رُوِيَ النَّهْىُ عَنِ الْخَذْفِ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 109,
        "matchingEnglishURN": 1086720,
        "last_updated": null
    },
    {
        "arabicURN": 1148300,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "39.00",
        "hadithNumber": "4815",
        "bookName": " كتاب القسامة",
        "babName": " باب دِيَةِ جَنِينِ الْمَرْأَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ أَنْبَأَنَا كَهْمَسٌ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ، أَنَّهُ رَأَى رَجُلاً يَخْذِفُ فَقَالَ لاَ تَخْذِفْ فَإِنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم كَانَ يَنْهَى عَنِ الْخَذْفِ أَوْ يَكْرَهُ الْخَذْفَ ‏.‏ شَكَّ كَهْمَسُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 110,
        "matchingEnglishURN": 1086725,
        "last_updated": null
    },
    {
        "arabicURN": 1148310,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "39.00",
        "hadithNumber": "4816",
        "bookName": " كتاب القسامة",
        "babName": " باب دِيَةِ جَنِينِ الْمَرْأَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ عَمْرٍو، عَنْ طَاوُسٍ، أَنَّ عُمَرَ، اسْتَشَارَ النَّاسَ فِي الْجَنِينِ فَقَالَ حَمَلُ بْنُ مَالِكٍ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْجَنِينِ غُرَّةً ‏.‏ قَالَ طَاوُسٌ إِنَّ الْفَرَسَ غُرَّةٌ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 111,
        "matchingEnglishURN": 1086730,
        "last_updated": null
    },
    {
        "arabicURN": 1148320,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "39.00",
        "hadithNumber": "4817",
        "bookName": " كتاب القسامة",
        "babName": " باب دِيَةِ جَنِينِ الْمَرْأَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي جَنِينِ امْرَأَةٍ مِنْ بَنِي لِحْيَانَ سَقَطَ مَيِّتًا بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ ثُمَّ إِنَّ الْمَرْأَةَ الَّتِي قَضَى عَلَيْهَا بِالْغُرَّةِ تُوُفِّيَتْ فَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم بِأَنَّ مِيرَاثَهَا لِبَنِيهَا وَزَوْجِهَا وَأَنَّ الْعَقْلَ عَلَى عَصَبَتِهَا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 112,
        "matchingEnglishURN": 1086735,
        "last_updated": null
    },
    {
        "arabicURN": 1148330,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "39.00",
        "hadithNumber": "4818",
        "bookName": " كتاب القسامة",
        "babName": " باب دِيَةِ جَنِينِ الْمَرْأَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، وَسَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ اقْتَتَلَتِ امْرَأَتَانِ مِنْ هُذَيْلٍ فَرَمَتْ إِحْدَاهُمَا الأُخْرَى بِحَجَرٍ وَذَكَرَ كَلِمَةً مَعْنَاهَا فَقَتَلَتْهَا وَمَا فِي بَطْنِهَا فَاخْتَصَمُوا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَّ دِيَةَ جَنِينِهَا غُرَّةٌ عَبْدٌ أَوْ وَلِيدَةٌ وَقَضَى بِدِيَةِ الْمَرْأَةِ عَلَى عَاقِلَتِهَا وَوَرَّثَهَا وَلَدَهَا وَمَنْ مَعَهُمْ ‏.‏ فَقَالَ حَمَلُ بْنُ مَالِكِ بْنِ النَّابِغَةِ الْهُذَلِيُّ يَا رَسُولَ اللَّهِ كَيْفَ أُغَرَّمُ مَنْ لاَ شَرِبَ وَلاَ أَكَلْ وَلاَ نَطَقَ وَلاَ اسْتَهَلّ فَمِثْلُ ذَلِكَ يُطَلّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا هَذَا مِنْ إِخْوَانِ الْكُهَّانِ ‏\"‏ ‏.‏ مِنْ أَجْلِ سَجْعِهِ الَّذِي سَجَعَ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 113,
        "matchingEnglishURN": 1086740,
        "last_updated": null
    },
    {
        "arabicURN": 1148340,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "39.00",
        "hadithNumber": "4819",
        "bookName": " كتاب القسامة",
        "babName": " باب دِيَةِ جَنِينِ الْمَرْأَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ امْرَأَتَيْنِ، مِنْ هُذَيْلٍ فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم رَمَتْ إِحْدَاهُمَا الأُخْرَى فَطَرَحَتْ جَنِينَهَا فَقَضَى فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم بِغُرَّةٍ عَبْدٍ أَوْ وَلِيدَةٍ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 114,
        "matchingEnglishURN": 1086745,
        "last_updated": null
    },
    {
        "arabicURN": 1148350,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "39.00",
        "hadithNumber": "4820",
        "bookName": " كتاب القسامة",
        "babName": " باب دِيَةِ جَنِينِ الْمَرْأَةِ ‏‏ ",
        "hadithText": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى فِي الْجَنِينِ يُقْتَلُ فِي بَطْنِ أُمِّهِ بِغُرَّةٍ عَبْدٍ أَوْ وَلِيدَةٍ فَقَالَ الَّذِي قَضَى عَلَيْهِ كَيْفَ أُغَرَّمُ مَنْ لاَ شَرِبَ وَلاَ أَكَلَ وَلاَ اسْتَهَلّ وَلاَ نَطَقَ فَمِثْلُ ذَلِكَ يُطَلّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا هَذَا مِنَ الْكُهَّانِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 115,
        "matchingEnglishURN": 1086750,
        "last_updated": null
    },
    {
        "arabicURN": 1148360,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "39.00",
        "hadithNumber": "4821",
        "bookName": " كتاب القسامة",
        "babName": " باب دِيَةِ جَنِينِ الْمَرْأَةِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَلِيٍّ، قَالَ حَدَّثَنَا خَلَفٌ، - وَهُوَ ابْنُ تَمِيمٍ - قَالَ حَدَّثَنَا زَائِدَةُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، أَنَّ امْرَأَةً، ضَرَبَتْ ضَرَّتَهَا بِعَمُودِ فُسْطَاطٍ فَقَتَلَتْهَا وَهِيَ حُبْلَى فَأُتِيَ فِيهَا النَّبِيُّ صلى الله عليه وسلم فَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى عَصَبَةِ الْقَاتِلَةِ بِالدِّيَةِ وَفِي الْجَنِينِ غُرَّةً ‏.‏ فَقَالَ عَصَبَتُهَا أَدِي مَنْ لاَ طَعِمَ وَلاَ شَرِبَ وَلاَ صَاحَ فَاسْتَهَلّ فَمِثْلُ هَذَا يُطَلّ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَسَجْعٌ كَسَجْعِ الأَعْرَابِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 116,
        "matchingEnglishURN": 1086755,
        "last_updated": null
    },
    {
        "arabicURN": 1148370,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "40.00",
        "hadithNumber": "4822",
        "bookName": " كتاب القسامة",
        "babName": " باب صِفَةِ شِبْهِ الْعَمْدِ وَعَلَى مَنْ دِيَةُ الأَجِنَّةِ وَشِبْهِ الْعَمْدِ وَذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ إِبْرَاهِيمَ عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ عَنِ الْمُغِيرَةِ ‏.‏",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ الْخُزَاعِيِّ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ ضَرَبَتِ امْرَأَةٌ ضَرَّتَهَا بِعَمُودِ الْفُسْطَاطِ وَهِيَ حُبْلَى فَقَتَلَتْهَا فَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم دِيَةَ الْمَقْتُولَةِ عَلَى عَصَبَةِ الْقَاتِلَةِ وَغُرَّةً لِمَا فِي بَطْنِهَا ‏.‏ فَقَالَ رَجُلٌ مِنْ عَصَبَةِ الْقَاتِلَةِ أَنَغْرَمُ دِيَةَ مَنْ لاَ أَكَلْ وَلاَ شَرِبَ وَلاَ اسْتَهَلّ فَمِثْلُ ذَلِكَ يُطَلّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَسَجْعٌ كَسَجْعِ الأَعْرَابِ ‏\"‏ ‏.‏ فَجَعَلَ عَلَيْهِمُ الدِّيَةَ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 117,
        "matchingEnglishURN": 1086760,
        "last_updated": null
    },
    {
        "arabicURN": 1148380,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "40.00",
        "hadithNumber": "4823",
        "bookName": " كتاب القسامة",
        "babName": " باب صِفَةِ شِبْهِ الْعَمْدِ وَعَلَى مَنْ دِيَةُ الأَجِنَّةِ وَشِبْهِ الْعَمْدِ وَذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ إِبْرَاهِيمَ عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ عَنِ الْمُغِيرَةِ ‏.‏",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، أَنَّ ضَرَّتَيْنِ، ضَرَبَتْ إِحْدَاهُمَا الأُخْرَى بِعَمُودِ فُسْطَاطٍ فَقَتَلَتْهَا فَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم بِالدِّيَةِ عَلَى عَصَبَةِ الْقَاتِلَةِ وَقَضَى لِمَا فِي بَطْنِهَا بِغُرَّةٍ ‏.‏ فَقَالَ الأَعْرَابِيُّ تُغَرِّمُنِي مَنْ لاَ أَكَلْ وَلاَ شَرِبَ وَلاَ صَاحَ فَاسْتَهَلّ فَمِثْلُ ذَلِكَ يُطَلّ فَقَالَ ‏\"‏ سَجْعٌ كَسَجْعِ الْجَاهِلِيَّةِ ‏\"‏ ‏.‏ وَقَضَى لِمَا فِي بَطْنِهَا بِغُرَّةٍ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 118,
        "matchingEnglishURN": 1086765,
        "last_updated": null
    },
    {
        "arabicURN": 1148390,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "40.00",
        "hadithNumber": "4824",
        "bookName": " كتاب القسامة",
        "babName": " باب صِفَةِ شِبْهِ الْعَمْدِ وَعَلَى مَنْ دِيَةُ الأَجِنَّةِ وَشِبْهِ الْعَمْدِ وَذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ إِبْرَاهِيمَ عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ عَنِ الْمُغِيرَةِ ‏.‏",
        "hadithText": "أَخْبَرَنَا عَلِيُّ بْنُ سَعِيدِ بْنِ مَسْرُوقٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي زَائِدَةَ، عَنْ إِسْرَائِيلَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ ضَرَبَتِ امْرَأَةٌ مِنْ بَنِي لِحْيَانَ ضَرَّتَهَا بِعَمُودِ الْفُسْطَاطِ فَقَتَلَتْهَا وَكَانَ بِالْمَقْتُولَةِ حَمْلٌ فَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى عَصَبَةِ الْقَاتِلَةِ بِالدِّيَةِ وَلِمَا فِي بَطْنِهَا بِغُرَّةٍ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 119,
        "matchingEnglishURN": 1086770,
        "last_updated": null
    },
    {
        "arabicURN": 1148400,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "40.00",
        "hadithNumber": "4825",
        "bookName": " كتاب القسامة",
        "babName": " باب صِفَةِ شِبْهِ الْعَمْدِ وَعَلَى مَنْ دِيَةُ الأَجِنَّةِ وَشِبْهِ الْعَمْدِ وَذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ إِبْرَاهِيمَ عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ عَنِ الْمُغِيرَةِ ‏.‏",
        "hadithText": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ شُعْبَةَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، أَنَّ امْرَأَتَيْنِ، كَانَتَا تَحْتَ رَجُلٍ مِنْ هُذَيْلٍ فَرَمَتْ إِحْدَاهُمَا الأُخْرَى بِعَمُودِ فُسْطَاطٍ فَأَسْقَطَتْ فَاخْتَصَمَا إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالُوا كَيْفَ نَدِي مَنْ لاَ صَاحَ وَلاَ اسْتَهَلّ وَلاَ شَرِبَ وَلاَ أَكَلْ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَسَجْعٌ كَسَجْعِ الأَعْرَابِ ‏\"‏ ‏.‏ فَقَضَى بِالْغُرَّةِ عَلَى عَاقِلَةِ الْمَرْأَةِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 120,
        "matchingEnglishURN": 1086775,
        "last_updated": null
    },
    {
        "arabicURN": 1148410,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "40.00",
        "hadithNumber": "4826",
        "bookName": " كتاب القسامة",
        "babName": " باب صِفَةِ شِبْهِ الْعَمْدِ وَعَلَى مَنْ دِيَةُ الأَجِنَّةِ وَشِبْهِ الْعَمْدِ وَذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ إِبْرَاهِيمَ عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ عَنِ الْمُغِيرَةِ ‏.‏",
        "hadithText": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، قَالَ سَمِعْتُ إِبْرَاهِيمَ، عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، أَنَّ رَجُلاً، مِنْ هُذَيْلٍ كَانَ لَهُ امْرَأَتَانِ فَرَمَتْ إِحْدَاهُمَا الأُخْرَى بِعَمُودِ الْفُسْطَاطِ فَأَسْقَطَتْ فَقِيلَ أَرَأَيْتَ مَنْ لاَ أَكَلْ وَلاَ شَرِبَ وَلاَ صَاحَ فَاسْتَهَلّ ‏.‏ فَقَالَ ‏\"‏ أَسَجْعٌ كَسَجْعِ الأَعْرَابِ ‏\"‏ ‏.‏ فَقَضَى فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ وَجُعِلَتْ عَلَى عَاقِلَةِ الْمَرْأَةِ ‏.‏ أَرْسَلَهُ الأَعْمَشُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 121,
        "matchingEnglishURN": 1086780,
        "last_updated": null
    },
    {
        "arabicURN": 1148420,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "40.00",
        "hadithNumber": "4827",
        "bookName": " كتاب القسامة",
        "babName": " باب صِفَةِ شِبْهِ الْعَمْدِ وَعَلَى مَنْ دِيَةُ الأَجِنَّةِ وَشِبْهِ الْعَمْدِ وَذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ إِبْرَاهِيمَ عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ عَنِ الْمُغِيرَةِ ‏.‏",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا مُصْعَبٌ، قَالَ حَدَّثَنَا دَاوُدُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، قَالَ ضَرَبَتِ امْرَأَةٌ ضَرَّتَهَا بِحَجَرٍ وَهِيَ حُبْلَى فَقَتَلَتْهَا فَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا فِي بَطْنِهَا غُرَّةً وَجَعَلَ عَقْلَهَا عَلَى عَصَبَتِهَا فَقَالُوا نُغَرَّمُ مَنْ لاَ شَرِبَ وَلاَ أَكَلْ وَلاَ اسْتَهَلّ فَمِثْلُ ذَلِكَ يُطَلّ فَقَالَ ‏\"‏ أَسَجْعٌ كَسَجْعِ الأَعْرَابِ هُوَ مَا أَقُولُ لَكُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 122,
        "matchingEnglishURN": 1086785,
        "last_updated": null
    },
    {
        "arabicURN": 1148430,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "40.00",
        "hadithNumber": "4828",
        "bookName": " كتاب القسامة",
        "babName": " باب صِفَةِ شِبْهِ الْعَمْدِ وَعَلَى مَنْ دِيَةُ الأَجِنَّةِ وَشِبْهِ الْعَمْدِ وَذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ إِبْرَاهِيمَ عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ عَنِ الْمُغِيرَةِ ‏.‏",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ، قَالَ حَدَّثَنَا عَمْرٌو، عَنْ أَسْبَاطٍ، عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَتِ امْرَأَتَانِ جَارَتَانِ كَانَ بَيْنَهُمَا صَخَبٌ فَرَمَتْ إِحْدَاهُمَا الأُخْرَى بِحَجَرٍ فَأَسْقَطَتْ غُلاَمًا قَدْ نَبَتَ شَعْرُهُ مَيْتًا وَمَاتَتِ الْمَرْأَةُ فَقَضَى عَلَى الْعَاقِلَةِ الدِّيَةَ ‏.‏ فَقَالَ عَمُّهَا إِنَّهَا قَدْ أَسْقَطَتْ يَا رَسُولَ اللَّهِ غُلاَمًا قَدْ نَبَتَ شَعْرُهُ ‏.‏ فَقَالَ أَبُو الْقَاتِلَةِ إِنَّهُ كَاذِبٌ إِنَّهُ وَاللَّهِ مَا اسْتَهَلّ وَلاَ شَرِبَ وَلاَ أَكَلْ فَمِثْلُهُ يُطَلّ ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَسَجْعٌ كَسَجْعِ الْجَاهِلِيَّةِ وَكِهَانَتِهَا إِنَّ فِي الصَّبِيِّ غُرَّةً ‏\"‏ ‏.‏ قَالَ ابْنُ عَبَّاسٍ كَانَتْ إِحْدَاهُمَا مُلَيْكَةَ وَالأُخْرَى أُمَّ غَطِيفٍ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 123,
        "matchingEnglishURN": 1086790,
        "last_updated": null
    },
    {
        "arabicURN": 1148440,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "40.00",
        "hadithNumber": "4829",
        "bookName": " كتاب القسامة",
        "babName": " باب صِفَةِ شِبْهِ الْعَمْدِ وَعَلَى مَنْ دِيَةُ الأَجِنَّةِ وَشِبْهِ الْعَمْدِ وَذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ إِبْرَاهِيمَ عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ عَنِ الْمُغِيرَةِ ‏.‏",
        "hadithText": "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ، قَالَ حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرًا، يَقُولُ كَتَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى كُلِّ بَطْنٍ عُقُولَةً وَلاَ يَحِلُّ لِمَوْلًى أَنْ يَتَوَلَّى مُسْلِمًا بِغَيْرِ إِذْنِهِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 124,
        "matchingEnglishURN": 1086795,
        "last_updated": null
    },
    {
        "arabicURN": 1148450,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "40.00",
        "hadithNumber": "4830",
        "bookName": " كتاب القسامة",
        "babName": " باب صِفَةِ شِبْهِ الْعَمْدِ وَعَلَى مَنْ دِيَةُ الأَجِنَّةِ وَشِبْهِ الْعَمْدِ وَذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ إِبْرَاهِيمَ عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ عَنِ الْمُغِيرَةِ ‏.‏",
        "hadithText": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ، وَمُحَمَّدُ بْنُ مُصَفًّى، قَالاَ حَدَّثَنَا الْوَلِيدُ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ تَطَبَّبَ وَلَمْ يُعْلَمْ مِنْهُ طِبٌّ قَبْلَ ذَلِكَ فَهُوَ ضَامِنٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 125,
        "matchingEnglishURN": 1086800,
        "last_updated": null
    },
    {
        "arabicURN": 1148460,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "40.00",
        "hadithNumber": "4831",
        "bookName": " كتاب القسامة",
        "babName": " باب صِفَةِ شِبْهِ الْعَمْدِ وَعَلَى مَنْ دِيَةُ الأَجِنَّةِ وَشِبْهِ الْعَمْدِ وَذِكْرِ اخْتِلاَفِ أَلْفَاظِ النَّاقِلِينَ لِخَبَرِ إِبْرَاهِيمَ عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ عَنِ الْمُغِيرَةِ ‏.‏",
        "hadithText": "أَخْبَرَنِي مَحْمُودُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا الْوَلِيدُ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، مِثْلَهُ سَوَاءً ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 126,
        "matchingEnglishURN": 1086805,
        "last_updated": null
    },
    {
        "arabicURN": 1148470,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "41.00",
        "hadithNumber": "4832",
        "bookName": " كتاب القسامة",
        "babName": " باب هَلْ يُؤْخَذُ أَحَدٌ بِجَرِيرَةِ غَيْرِهِ  ",
        "hadithText": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ أَبْجَرَ، عَنْ إِيَادِ بْنِ لَقِيطٍ، عَنْ أَبِي رِمْثَةَ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم مَعَ أَبِي فَقَالَ ‏\"‏ مَنْ هَذَا مَعَكَ ‏\"‏ ‏.‏ قَالَ ابْنِي أَشْهَدُ بِهِ ‏.‏ قَالَ ‏\"‏ أَمَا إِنَّكَ لاَ تَجْنِي عَلَيْهِ وَلاَ يَجْنِي عَلَيْكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 127,
        "matchingEnglishURN": 1086810,
        "last_updated": null
    },
    {
        "arabicURN": 1148480,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "41.00",
        "hadithNumber": "4833",
        "bookName": " كتاب القسامة",
        "babName": " باب هَلْ يُؤْخَذُ أَحَدٌ بِجَرِيرَةِ غَيْرِهِ  ",
        "hadithText": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَشْعَثَ، عَنِ الأَسْوَدِ بْنِ هِلاَلٍ، عَنْ ثَعْلَبَةَ بْنِ زَهْدَمٍ الْيَرْبُوعِيِّ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَخْطُبُ فِي أُنَاسٍ مِنَ الأَنْصَارِ فَقَالُوا يَا رَسُولَ اللَّهِ هَؤُلاَءِ بَنُو ثَعْلَبَةَ بْنِ يَرْبُوعٍ قَتَلُوا فُلاَنًا فِي الْجَاهِلِيَّةِ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم وَهَتَفَ بِصَوْتِهِ ‏\"‏ أَلاَ لاَ تَجْنِي نَفْسٌ عَلَى الأُخْرَى ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 128,
        "matchingEnglishURN": 1086815,
        "last_updated": null
    },
    {
        "arabicURN": 1148490,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "41.00",
        "hadithNumber": "4834",
        "bookName": " كتاب القسامة",
        "babName": " باب هَلْ يُؤْخَذُ أَحَدٌ بِجَرِيرَةِ غَيْرِهِ  ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، عَنْ سُفْيَانَ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، عَنِ الأَسْوَدِ بْنِ هِلاَلٍ، عَنْ ثَعْلَبَةَ بْنِ زَهْدَمٍ، قَالَ انْتَهَى قَوْمٌ مِنْ بَنِي ثَعْلَبَةَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ يَخْطُبُ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ هَؤُلاَءِ بَنُو ثَعْلَبَةَ بْنِ يَرْبُوعٍ قَتَلُوا فُلاَنًا رَجُلاً مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ تَجْنِي نَفْسٌ عَلَى أُخْرَى ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 129,
        "matchingEnglishURN": 1086818,
        "last_updated": null
    },
    {
        "arabicURN": 1148500,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "41.00",
        "hadithNumber": "4835",
        "bookName": " كتاب القسامة",
        "babName": " باب هَلْ يُؤْخَذُ أَحَدٌ بِجَرِيرَةِ غَيْرِهِ  ",
        "hadithText": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ أَنْبَأَنَا شُعْبَةُ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، قَالَ سَمِعْتُ الأَسْوَدَ بْنَ هِلاَلٍ، يُحَدِّثُ عَنْ رَجُلٍ، مِنْ بَنِي ثَعْلَبَةَ بْنِ يَرْبُوعٍ أَنَّ نَاسًا، مِنْ بَنِي ثَعْلَبَةَ أَتَوُا النَّبِيَّ صلى الله عليه وسلم فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ هَؤُلاَءِ بَنُو ثَعْلَبَةَ بْنِ يَرْبُوعٍ قَتَلُوا فُلاَنًا رَجُلاً مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ تَجْنِي نَفْسٌ عَلَى أُخْرَى ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 130,
        "matchingEnglishURN": 1086820,
        "last_updated": null
    },
    {
        "arabicURN": 1148510,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "41.00",
        "hadithNumber": "4836",
        "bookName": " كتاب القسامة",
        "babName": " باب هَلْ يُؤْخَذُ أَحَدٌ بِجَرِيرَةِ غَيْرِهِ  ",
        "hadithText": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا أَبُو عَتَّابٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الأَشْعَثِ بْنِ سُلَيْمٍ، عَنِ الأَسْوَدِ بْنِ هِلاَلٍ، - وَكَانَ قَدْ أَدْرَكَ النَّبِيَّ صلى الله عليه وسلم - عَنْ رَجُلٍ مِنْ بَنِي ثَعْلَبَةَ بْنِ يَرْبُوعٍ أَنَّ نَاسًا مِنْ بَنِي ثَعْلَبَةَ أَصَابُوا رَجُلاً مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ رَجُلٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَا رَسُولَ اللَّهِ هَؤُلاَءِ بَنُو ثَعْلَبَةَ قَتَلَتْ فُلاَنًا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَجْنِي نَفْسٌ عَلَى أُخْرَى ‏\"‏ ‏.‏ قَالَ شُعْبَةُ أَىْ لاَ يُؤْخَذُ أَحَدٌ بِأَحَدٍ وَاللَّهُ تَعَالَى أَعْلَمُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 131,
        "matchingEnglishURN": 1086825,
        "last_updated": null
    },
    {
        "arabicURN": 1148520,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "41.00",
        "hadithNumber": "4837",
        "bookName": " كتاب القسامة",
        "babName": " باب هَلْ يُؤْخَذُ أَحَدٌ بِجَرِيرَةِ غَيْرِهِ  ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الأَشْعَثِ بْنِ سُلَيْمٍ، عَنْ أَبِيهِ، عَنْ رَجُلٍ، مِنْ بَنِي ثَعْلَبَةَ بْنِ يَرْبُوعٍ قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم وَهُوَ يَتَكَلَّمُ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ هَؤُلاَءِ بَنُو ثَعْلَبَةَ بْنِ يَرْبُوعٍ الَّذِينَ أَصَابُوا فُلاَنًا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ - يَعْنِي - لاَ تَجْنِي نَفْسٌ عَلَى نَفْسٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 132,
        "matchingEnglishURN": 1086830,
        "last_updated": null
    },
    {
        "arabicURN": 1148530,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "41.00",
        "hadithNumber": "4838",
        "bookName": " كتاب القسامة",
        "babName": " باب هَلْ يُؤْخَذُ أَحَدٌ بِجَرِيرَةِ غَيْرِهِ  ",
        "hadithText": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، فِي حَدِيثِهِ عَنْ أَبِي الأَحْوَصِ، عَنْ أَشْعَثَ، عَنْ أَبِيهِ، عَنْ رَجُلٍ، مِنْ بَنِي يَرْبُوعٍ قَالَ أَتَيْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم وَهُوَ يُكَلِّمُ النَّاسَ فَقَامَ إِلَيْهِ نَاسٌ فَقَالُوا يَا رَسُولَ اللَّهِ هَؤُلاَءِ بَنُو فُلاَنٍ الَّذِينَ قَتَلُوا فُلاَنًا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَجْنِي نَفْسٌ عَلَى أُخْرَى ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 133,
        "matchingEnglishURN": 1086835,
        "last_updated": null
    },
    {
        "arabicURN": 1148540,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "41.00",
        "hadithNumber": "4839",
        "bookName": " كتاب القسامة",
        "babName": " باب هَلْ يُؤْخَذُ أَحَدٌ بِجَرِيرَةِ غَيْرِهِ  ",
        "hadithText": "أَخْبَرَنَا يُوسُفُ بْنُ عِيسَى، قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى، قَالَ أَنْبَأَنَا يَزِيدُ، - وَهُوَ ابْنُ زِيَادِ بْنِ أَبِي الْجَعْدِ - عَنْ جَامِعِ بْنِ شَدَّادٍ، عَنْ طَارِقٍ الْمُحَارِبِيِّ، أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ هَؤُلاَءِ بَنُو ثَعْلَبَةَ الَّذِينَ قَتَلُوا فُلاَنًا فِي الْجَاهِلِيَّةِ ‏.‏ فَخُذْ لَنَا بِثَأْرِنَا ‏.‏ فَرَفَعَ يَدَيْهِ حَتَّى رَأَيْتُ بَيَاضَ إِبْطَيْهِ وَهُوَ يَقُولُ ‏\"‏ لاَ تَجْنِي أُمٌّ عَلَى وَلَدٍ ‏\"‏ ‏.‏ مَرَّتَيْنِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 134,
        "matchingEnglishURN": 1086840,
        "last_updated": null
    },
    {
        "arabicURN": 1148550,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "42.00",
        "hadithNumber": "4840",
        "bookName": " كتاب القسامة",
        "babName": " باب الْعَيْنِ الْعَوْرَاءِ السَّادَّةِ لِمَكَانِهَا إِذَا طُمِسَتْ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ، قَالَ أَنْبَأَنَا ابْنُ عَائِذٍ، قَالَ حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ، قَالَ أَخْبَرَنِي الْعَلاَءُ، - وَهُوَ ابْنُ الْحَارِثِ - عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى فِي الْعَيْنِ الْعَوْرَاءِ السَّادَّةِ لِمَكَانِهَا إِذَا طُمِسَتْ بِثُلُثِ دِيَتِهَا وَفِي الْيَدِ الشَّلاَّءِ إِذَا قُطِعَتْ بِثُلُثِ دِيَتِهَا وَفِي السِّنِّ السَّوْدَاءِ إِذَا نُزِعَتْ بِثُلُثِ دِيَتِهَا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 135,
        "matchingEnglishURN": 1086845,
        "last_updated": null
    },
    {
        "arabicURN": 1148560,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "43.00",
        "hadithNumber": "4841",
        "bookName": " كتاب القسامة",
        "babName": " باب عَقْلِ الأَسْنَانِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مُعَاوِيَةَ، قَالَ حَدَّثَنَا عَبَّادٌ، عَنْ حُسَيْنٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فِي الأَسْنَانِ خَمْسٌ مِنَ الإِبِلِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 136,
        "matchingEnglishURN": 1086850,
        "last_updated": null
    },
    {
        "arabicURN": 1148570,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "43.00",
        "hadithNumber": "4842",
        "bookName": " كتاب القسامة",
        "babName": " باب عَقْلِ الأَسْنَانِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا حَفْصُ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ مَطَرٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الأَسْنَانُ سَوَاءٌ خَمْسًا خَمْسًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 137,
        "matchingEnglishURN": 1086855,
        "last_updated": null
    },
    {
        "arabicURN": 1148580,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "44.00",
        "hadithNumber": "4843",
        "bookName": " كتاب القسامة",
        "babName": " باب عَقْلِ الأَصَابِعِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَبُو الأَشْعَثِ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ مَسْرُوقِ بْنِ أَوْسٍ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ فِي الأَصَابِعِ عَشْرٌ عَشْرٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 138,
        "matchingEnglishURN": 1086860,
        "last_updated": null
    },
    {
        "arabicURN": 1148590,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "44.00",
        "hadithNumber": "4844",
        "bookName": " كتاب القسامة",
        "babName": " باب عَقْلِ الأَصَابِعِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ غَالِبٍ التَّمَّارِ، عَنْ مَسْرُوقِ بْنِ أَوْسٍ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الأَصَابِعُ سَوَاءٌ عَشْرًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 139,
        "matchingEnglishURN": 1086865,
        "last_updated": null
    },
    {
        "arabicURN": 1148600,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "44.00",
        "hadithNumber": "4845",
        "bookName": " كتاب القسامة",
        "babName": " باب عَقْلِ الأَصَابِعِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا حَفْصٌ، - وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ الْبَلْخِيُّ - عَنْ سَعِيدٍ، عَنْ غَالِبٍ التَّمَّارِ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ مَسْرُوقِ بْنِ أَوْسٍ، عَنْ أَبِي مُوسَى، قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَّ الأَصَابِعَ سَوَاءٌ عَشْرًا عَشْرًا مِنَ الإِبِلِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 140,
        "matchingEnglishURN": 1086870,
        "last_updated": null
    },
    {
        "arabicURN": 1148610,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "44.00",
        "hadithNumber": "4846",
        "bookName": " كتاب القسامة",
        "babName": " باب عَقْلِ الأَصَابِعِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ لَمَّا وُجِدَ الْكِتَابُ الَّذِي عِنْدَ آلِ عَمْرِو بْنِ حَزْمٍ الَّذِي ذَكَرُوا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَتَبَ لَهُمْ وَجَدُوا فِيهِ ‏\"‏ وَفِيمَا هُنَالِكَ مِنَ الأَصَابِعِ عَشْرًا عَشْرًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 141,
        "matchingEnglishURN": 1086875,
        "last_updated": null
    },
    {
        "arabicURN": 1148620,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "44.00",
        "hadithNumber": "4847",
        "bookName": " كتاب القسامة",
        "babName": " باب عَقْلِ الأَصَابِعِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي قَتَادَةُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، رضى الله عنهما عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ هَذِهِ وَهَذِهِ سَوَاءٌ ‏\"‏ ‏.‏ يَعْنِي الْخِنْصَرَ وَالإِبْهَامَ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 142,
        "matchingEnglishURN": 1086880,
        "last_updated": null
    },
    {
        "arabicURN": 1148630,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "44.00",
        "hadithNumber": "4848",
        "bookName": " كتاب القسامة",
        "babName": " باب عَقْلِ الأَصَابِعِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، فَهَذِهِ وَهَذِهِ سَوَاءٌ الإِبْهَامُ وَالْخِنْصَرُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 143,
        "matchingEnglishURN": 1086885,
        "last_updated": null
    },
    {
        "arabicURN": 1148640,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "44.00",
        "hadithNumber": "4849",
        "bookName": " كتاب القسامة",
        "babName": " باب عَقْلِ الأَصَابِعِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ الأَصَابِعُ عَشْرٌ عَشْرٌ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 144,
        "matchingEnglishURN": 1086890,
        "last_updated": null
    },
    {
        "arabicURN": 1148650,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "44.00",
        "hadithNumber": "4850",
        "bookName": " كتاب القسامة",
        "babName": " باب عَقْلِ الأَصَابِعِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، أَنَّ أَبَاهُ، حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ لَمَّا افْتَتَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَكَّةَ قَالَ فِي خُطْبَتِهِ ‏\"‏ وَفِي الأَصَابِعِ عَشْرٌ عَشْرٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 145,
        "matchingEnglishURN": 1086895,
        "last_updated": null
    },
    {
        "arabicURN": 1148660,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "44.00",
        "hadithNumber": "4851",
        "bookName": " كتاب القسامة",
        "babName": " باب عَقْلِ الأَصَابِعِ ‏‏ ",
        "hadithText": "أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ الْهَيْثَمِ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ حَدَّثَنَا هَمَّامٌ، قَالَ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، وَابْنُ، جُرَيْجٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ فِي خُطْبَتِهِ وَهُوَ مُسْنِدٌ ظَهْرَهُ إِلَى الْكَعْبَةِ ‏\"‏ الأَصَابِعُ سَوَاءٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 146,
        "matchingEnglishURN": 1086900,
        "last_updated": null
    },
    {
        "arabicURN": 1148670,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "45.00",
        "hadithNumber": "4852",
        "bookName": " كتاب القسامة",
        "babName": " باب الْمَوَاضِحِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، أَنَّ أَبَاهُ، حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ لَمَّا افْتَتَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَكَّةَ قَالَ فِي خُطْبَتِهِ ‏\"‏ وَفِي الْمَوَاضِحِ خَمْسٌ خَمْسٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 147,
        "matchingEnglishURN": 1086903,
        "last_updated": null
    },
    {
        "arabicURN": 1148680,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "46.00",
        "hadithNumber": "4853",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ حَدِيثِ عَمْرِو بْنِ حَزْمٍ فِي الْعُقُولِ وَاخْتِلاَفِ النَّاقِلِينَ لَهُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى، قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، عَنْ سُلَيْمَانَ بْنِ دَاوُدَ، قَالَ حَدَّثَنِي الزُّهْرِيُّ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَتَبَ إِلَى أَهْلِ الْيَمَنِ كِتَابًا فِيهِ الْفَرَائِضُ وَالسُّنَنُ وَالدِّيَاتُ وَبَعَثَ بِهِ مَعَ عَمْرِو بْنِ حَزْمٍ فَقُرِئَتْ عَلَى أَهْلِ الْيَمَنِ هَذِهِ نُسْخَتُهَا ‏\"‏ مِنْ مُحَمَّدٍ النَّبِيِّ صلى الله عليه وسلم إِلَى شُرَحْبِيلَ بْنِ عَبْدِ كُلاَلٍ وَنُعَيْمِ بْنِ عَبْدِ كُلاَلٍ وَالْحَارِثِ بْنِ عَبْدِ كُلاَلٍ قَيْلِ ذِي رُعَيْنٍ وَمُعَافِرَ وَهَمْدَانَ أَمَّا بَعْدُ ‏\"‏ ‏.‏ وَكَانَ فِي كِتَابِهِ ‏\"‏ أَنَّ مَنِ اعْتَبَطَ مُؤْمِنًا قَتْلاً عَنْ بَيِّنَةٍ فَإِنَّهُ قَوَدٌ إِلاَّ أَنْ يَرْضَى أَوْلِيَاءُ الْمَقْتُولِ وَأَنَّ فِي النَّفْسِ الدِّيَةُ مِائَةً مِنَ الإِبِلِ وَفِي الأَنْفِ إِذَا أُوعِبَ جَدْعُهُ الدِّيَةُ وَفِي اللِّسَانِ الدِّيَةُ وَفِي الشَّفَتَيْنِ الدِّيَةُ وَفِي الْبَيْضَتَيْنِ الدِّيَةُ وَفِي الذَّكَرِ الدِّيَةُ وَفِي الصُّلْبِ الدِّيَةُ وَفِي الْعَيْنَيْنِ الدِّيَةُ وَفِي الرِّجْلِ الْوَاحِدَةِ نِصْفُ الدِّيَةِ وَفِي الْمَأْمُومَةِ ثُلُثُ الدِّيَةِ وَفِي الْجَائِفَةِ ثُلُثُ الدِّيَةِ وَفِي الْمُنَقِّلَةِ خَمْسَ عَشَرَةَ مِنَ الإِبِلِ وَفِي كُلِّ أُصْبُعٍ مِنْ أَصَابِعِ الْيَدِ وَالرِّجْلِ عَشْرٌ مِنَ الإِبِلِ وَفِي السِّنِّ خَمْسٌ مِنَ الإِبِلِ وَفِي الْمُوضِحَةِ خَمْسٌ مِنَ الإِبِلِ وَأَنَّ الرَّجُلَ يُقْتَلُ بِالْمَرْأَةِ وَعَلَى أَهْلِ الذَّهَبِ أَلْفُ دِينَارٍ ‏\"‏ ‏.‏ خَالَفَهُ مُحَمَّدُ بْنُ بَكَّارِ بْنِ بِلاَلٍ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 148,
        "matchingEnglishURN": 1086905,
        "last_updated": null
    },
    {
        "arabicURN": 1148690,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "46.00",
        "hadithNumber": "4854",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ حَدِيثِ عَمْرِو بْنِ حَزْمٍ فِي الْعُقُولِ وَاخْتِلاَفِ النَّاقِلِينَ لَهُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا الْهَيْثَمُ بْنُ مَرْوَانَ بْنِ الْهَيْثَمِ بْنِ عِمْرَانَ الْعَنْسِيُّ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارِ بْنِ بِلاَلٍ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ أَرْقَمَ، قَالَ حَدَّثَنِي الزُّهْرِيُّ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَتَبَ إِلَى أَهْلِ الْيَمَنِ بِكِتَابٍ فِيهِ الْفَرَائِضُ وَالسُّنَنُ وَالدِّيَاتُ وَبَعَثَ بِهِ مَعَ عَمْرِو بْنِ حَزْمٍ فَقُرِئَ عَلَى أَهْلِ الْيَمَنِ هَذِهِ نُسْخَتُهُ فَذَكَرَ مِثْلَهُ إِلاَّ أَنَّهُ قَالَ ‏\"‏ وَفِي الْعَيْنِ الْوَاحِدَةِ نِصْفُ الدِّيَةِ وَفِي الْيَدِ الْوَاحِدَةِ نِصْفُ الدِّيَةِ وَفِي الرِّجْلِ الْوَاحِدَةِ نِصْفُ الدِّيَةِ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ وَهَذَا أَشْبَهُ بِالصَّوَابِ وَاللَّهُ أَعْلَمُ وَسُلَيْمَانُ بْنُ أَرْقَمَ مَتْرُوكُ الْحَدِيثِ وَقَدْ رَوَى هَذَا الْحَدِيثَ يُونُسُ عَنِ الزُّهْرِيِّ مُرْسَلاً ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 149,
        "matchingEnglishURN": 1086910,
        "last_updated": null
    },
    {
        "arabicURN": 1148700,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "46.00",
        "hadithNumber": "4855",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ حَدِيثِ عَمْرِو بْنِ حَزْمٍ فِي الْعُقُولِ وَاخْتِلاَفِ النَّاقِلِينَ لَهُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، قَالَ قَرَأْتُ كِتَابَ رَسُولِ اللَّهِ صلى الله عليه وسلم الَّذِي كَتَبَ لِعَمْرِو بْنِ حَزْمٍ حِينَ بَعَثَهُ عَلَى نَجْرَانَ - وَكَانَ الْكِتَابُ عِنْدَ أَبِي بَكْرِ بْنِ حَزْمٍ - فَكَتَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذَا بَيَانٌ مِنَ اللَّهِ وَرَسُولِهِ ‏<A id=\"q1\" name=\"q1\" href=\"javascript:openquran(4,1,1)\"><c_q1>{‏ يَا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا بِالْعُقُودِ ‏}</c_q1></a>‏ ‏\"‏ ‏.‏ وَكَتَبَ الآيَاتِ مِنْهَا حَتَّى بَلَغَ ‏<A id=\"q2\" name=\"q2\" href=\"javascript:openquran(4,4,4)\"><c_q2>{‏ إِنَّ اللَّهَ سَرِيعُ الْحِسَابِ ‏}</c_q2></a>‏ ثُمَّ كَتَبَ ‏\"‏ هَذَا كِتَابُ الْجِرَاحِ فِي النَّفْسِ مِائَةٌ مِنَ الإِبِلِ ‏\"‏ ‏.‏ نَحْوَهُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 150,
        "matchingEnglishURN": 1086915,
        "last_updated": null
    },
    {
        "arabicURN": 1148710,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "46.00",
        "hadithNumber": "4856",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ حَدِيثِ عَمْرِو بْنِ حَزْمٍ فِي الْعُقُولِ وَاخْتِلاَفِ النَّاقِلِينَ لَهُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ الْوَاحِدِ، قَالَ حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا سَعِيدٌ، - وَهُوَ ابْنُ عَبْدِ الْعَزِيزِ - عَنِ الزُّهْرِيِّ، قَالَ جَاءَنِي أَبُو بَكْرِ بْنِ حَزْمٍ بِكِتَابٍ فِي رُقْعَةٍ مِنْ أَدَمٍ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذَا بَيَانٌ مِنَ اللَّهِ وَرَسُولِهِ ‏<A id=\"q3\" name=\"q3\" href=\"javascript:openquran(4,1,1)\"><c_q3>{‏ يَا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا بِالْعُقُودِ ‏}</c_q3></a>‏ ‏\"‏ ‏.‏ فَتَلاَ مِنْهَا آيَاتٍ ثُمَّ قَالَ ‏\"‏ فِي النَّفْسِ مِائَةٌ مِنَ الإِبِلِ وَفِي الْعَيْنِ خَمْسُونَ وَفِي الْيَدِ خَمْسُونَ وَفِي الرِّجْلِ خَمْسُونَ وَفِي الْمَأْمُومَةِ ثُلُثُ الدِّيَةِ وَفِي الْجَائِفَةِ ثُلُثُ الدِّيَةِ وَفِي الْمُنَقِّلَةِ خَمْسَ عَشْرَةَ فَرِيضَةً وَفِي الأَصَابِعِ عَشْرٌ عَشْرٌ وَفِي الأَسْنَانِ خَمْسٌ خَمْسٌ وَفِي الْمُوضِحَةِ خَمْسٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 151,
        "matchingEnglishURN": 1086920,
        "last_updated": null
    },
    {
        "arabicURN": 1148720,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "46.00",
        "hadithNumber": "4857",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ حَدِيثِ عَمْرِو بْنِ حَزْمٍ فِي الْعُقُولِ وَاخْتِلاَفِ النَّاقِلِينَ لَهُ ‏‏ ",
        "hadithText": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ أَبِيهِ، قَالَ الْكِتَابُ الَّذِي كَتَبَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم لِعَمْرِو بْنِ حَزْمٍ فِي الْعُقُولِ ‏\"‏ إِنَّ فِي النَّفْسِ مِائَةً مِنَ الإِبِلِ وَفِي الأَنْفِ إِذَا أُوعِيَ جَدْعًا مِائَةً مِنَ الإِبِلِ وَفِي الْمَأْمُومَةِ ثُلُثُ النَّفْسِ وَفِي الْجَائِفَةِ مِثْلُهَا وَفِي الْيَدِ خَمْسُونَ وَفِي الْعَيْنِ خَمْسُونَ وَفِي الرِّجْلِ خَمْسُونَ وَفِي كُلِّ إِصْبَعٍ مِمَّا هُنَالِكَ عَشْرٌ مِنَ الإِبِلِ وَفِي السِّنِّ خَمْسٌ وَفِي الْمُوضِحَةِ خَمْسٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 152,
        "matchingEnglishURN": 1086925,
        "last_updated": null
    },
    {
        "arabicURN": 1148730,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "46.00",
        "hadithNumber": "4858",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ حَدِيثِ عَمْرِو بْنِ حَزْمٍ فِي الْعُقُولِ وَاخْتِلاَفِ النَّاقِلِينَ لَهُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا أَبَانُ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ أَعْرَابِيًّا، أَتَى بَابَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَلْقَمَ عَيْنَهُ خُصَاصَةَ الْبَابِ فَبَصُرَ بِهِ النَّبِيُّ صلى الله عليه وسلم فَتَوَخَّاهُ بِحَدِيدَةٍ أَوْ عُودٍ لِيَفْقَأَ عَيْنَهُ فَلَمَّا أَنْ بَصُرَ انْقَمَعَ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَمَا إِنَّكَ لَوْ ثَبَتَّ لَفَقَأْتُ عَيْنَكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 153,
        "matchingEnglishURN": 1086930,
        "last_updated": null
    },
    {
        "arabicURN": 1148740,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "46.00",
        "hadithNumber": "4859",
        "bookName": " كتاب القسامة",
        "babName": " باب ذِكْرِ حَدِيثِ عَمْرِو بْنِ حَزْمٍ فِي الْعُقُولِ وَاخْتِلاَفِ النَّاقِلِينَ لَهُ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ، أَخْبَرَهُ أَنَّ رَجُلاً اطَّلَعَ مِنْ جُحْرٍ فِي بَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَمَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مِدْرَى يَحُكُّ بِهَا رَأْسَهُ فَلَمَّا رَآهُ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لَوْ عَلِمْتُ أَنَّكَ تَنْظُرُنِي لَطَعَنْتُ بِهِ فِي عَيْنِكَ إِنَّمَا جُعِلَ الإِذْنُ مِنْ أَجْلِ الْبَصَرِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 154,
        "matchingEnglishURN": 1086935,
        "last_updated": null
    },
    {
        "arabicURN": 1148750,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "47.00",
        "hadithNumber": "4860",
        "bookName": " كتاب القسامة",
        "babName": " باب مَنِ اقْتَصَّ وَأَخَذَ حَقَّهُ دُونَ السُّلْطَانِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنِ اطَّلَعَ فِي بَيْتِ قَوْمٍ بِغَيْرِ إِذْنِهِمْ فَفَقَئُوا عَيْنَهُ فَلاَ دِيَةَ لَهُ وَلاَ قِصَاصَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 155,
        "matchingEnglishURN": 1086940,
        "last_updated": null
    },
    {
        "arabicURN": 1148760,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "47.00",
        "hadithNumber": "4861",
        "bookName": " كتاب القسامة",
        "babName": " باب مَنِ اقْتَصَّ وَأَخَذَ حَقَّهُ دُونَ السُّلْطَانِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لَوْ أَنَّ امْرَأً اطَّلَعَ عَلَيْكَ بِغَيْرِ إِذْنٍ فَخَذَفْتَهُ فَفَقَأْتَ عَيْنَهُ مَا كَانَ عَلَيْكَ حَرَجٌ ‏\"‏ ‏.‏ وَقَالَ مَرَّةً أُخْرَى ‏\"‏ جُنَاحٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 156,
        "matchingEnglishURN": 1086945,
        "last_updated": null
    },
    {
        "arabicURN": 1148770,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "47.00",
        "hadithNumber": "4862",
        "bookName": " كتاب القسامة",
        "babName": " باب مَنِ اقْتَصَّ وَأَخَذَ حَقَّهُ دُونَ السُّلْطَانِ ‏‏ ",
        "hadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ مُصْعَبٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ كَانَ يُصَلِّي فَإِذَا بِابْنٍ لِمَرْوَانَ يَمُرُّ بَيْنَ يَدَيْهِ فَدَرَأَهُ فَلَمْ يَرْجِعْ فَضَرَبَهُ فَخَرَجَ الْغُلاَمُ يَبْكِي حَتَّى أَتَى مَرْوَانَ فَأَخْبَرَهُ فَقَالَ مَرْوَانُ لأَبِي سَعِيدٍ لِمَ ضَرَبْتَ ابْنَ أَخِيكَ قَالَ مَا ضَرَبْتُهُ إِنَّمَا ضَرَبْتُ الشَّيْطَانَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِذَا كَانَ أَحَدُكُمْ فِي صَلاَةٍ فَأَرَادَ إِنْسَانٌ يَمُرُّ بَيْنَ يَدَيْهِ فَيَدْرَؤُهُ مَا اسْتَطَاعَ فَإِنْ أَبَى فَلْيُقَاتِلْهُ فَإِنَّهُ شَيْطَانٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 157,
        "matchingEnglishURN": 1086950,
        "last_updated": null
    },
    {
        "arabicURN": 1148780,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "48.00",
        "hadithNumber": "4863",
        "bookName": " كتاب القسامة",
        "babName": " باب مَا جَاءَ فِي كِتَابِ الْقِصَاصِ مِنَ الْمُجْتَبَى مِمَّا لَيْسَ فِي السُّنَنِ تَأْوِيلِ قَوْلِ اللَّهِ عَزَّ وَجَلَّ ‏<A id=\"q4\" name=\"q4\" href=\"javascript:openquran(3,93,93)\"><c_q4>{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ خَالِدًا فِيهَا ‏}</c_q4></a>‏ ‏‏ ",
        "hadithText": "حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ، لَفْظًا قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ أَمَرَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبْزَى أَنْ أَسْأَلَ ابْنَ عَبَّاسٍ، عَنْ هَاتَيْنِ الآيَتَيْنِ، ‏<A id=\"q5\" name=\"q5\" href=\"javascript:openquran(3,93,93)\"><c_q5>{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ ‏}</c_q5></a>‏ فَسَأَلْتُهُ فَقَالَ لَمْ يَنْسَخْهَا شَىْءٌ ‏.‏ وَعَنْ هَذِهِ الآيَةِ ‏<A id=\"q6\" name=\"q6\" href=\"javascript:openquran(24,68,68)\"><c_q6>{‏ وَالَّذِينَ لاَ يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ وَلاَ يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ ‏}</c_q6></a>‏ قَالَ نَزَلَتْ فِي أَهْلِ الشِّرْكِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 158,
        "matchingEnglishURN": 1086955,
        "last_updated": null
    },
    {
        "arabicURN": 1148790,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "48.00",
        "hadithNumber": "4864",
        "bookName": " كتاب القسامة",
        "babName": " باب مَا جَاءَ فِي كِتَابِ الْقِصَاصِ مِنَ الْمُجْتَبَى مِمَّا لَيْسَ فِي السُّنَنِ تَأْوِيلِ قَوْلِ اللَّهِ عَزَّ وَجَلَّ ‏<A id=\"q4\" name=\"q4\" href=\"javascript:openquran(3,93,93)\"><c_q4>{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ خَالِدًا فِيهَا ‏}</c_q4></a>‏ ‏‏ ",
        "hadithText": "أَخْبَرَنَا أَزْهَرُ بْنُ جَمِيلٍ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الْمُغِيرَةِ بْنِ النُّعْمَانِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ اخْتَلَفَ أَهْلُ الْكُوفَةِ فِي هَذِهِ الآيَةِ ‏<A id=\"q7\" name=\"q7\" href=\"javascript:openquran(3,93,93)\"><c_q7>{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا ‏}</c_q7></a>‏ فَرَحَلْتُ إِلَى ابْنِ عَبَّاسٍ فَسَأَلْتُهُ فَقَالَ نَزَلَتْ فِي آخِرِ مَا أُنْزِلَتْ وَمَا نَسَخَهَا شَىْءٌ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 159,
        "matchingEnglishURN": 1086960,
        "last_updated": null
    },
    {
        "arabicURN": 1148800,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "48.00",
        "hadithNumber": "4865",
        "bookName": " كتاب القسامة",
        "babName": " باب مَا جَاءَ فِي كِتَابِ الْقِصَاصِ مِنَ الْمُجْتَبَى مِمَّا لَيْسَ فِي السُّنَنِ تَأْوِيلِ قَوْلِ اللَّهِ عَزَّ وَجَلَّ ‏<A id=\"q4\" name=\"q4\" href=\"javascript:openquran(3,93,93)\"><c_q4>{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ خَالِدًا فِيهَا ‏}</c_q4></a>‏ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي الْقَاسِمُ بْنُ أَبِي بَزَّةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ هَلْ لِمَنْ قَتَلَ مُؤْمِنًا مُتَعَمِّدًا مِنْ تَوْبَةٍ قَالَ لاَ ‏.‏ وَقَرَأْتُ عَلَيْهِ الآيَةَ الَّتِي فِي الْفُرْقَانِ ‏<A id=\"q8\" name=\"q8\" href=\"javascript:openquran(24,68,68)\"><c_q8>{‏ وَالَّذِينَ لاَ يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ وَلاَ يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ ‏}</c_q8></a>‏ قَالَ هَذِهِ آيَةٌ مَكِّيَّةٌ نَسَخَتْهَا آيَةٌ مَدَنِيَّةٌ ‏<A id=\"q9\" name=\"q9\" href=\"javascript:openquran(3,93,93)\"><c_q9>{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ ‏}</c_q9></a>‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 160,
        "matchingEnglishURN": 1086965,
        "last_updated": null
    },
    {
        "arabicURN": 1148810,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "48.00",
        "hadithNumber": "4866",
        "bookName": " كتاب القسامة",
        "babName": " باب مَا جَاءَ فِي كِتَابِ الْقِصَاصِ مِنَ الْمُجْتَبَى مِمَّا لَيْسَ فِي السُّنَنِ تَأْوِيلِ قَوْلِ اللَّهِ عَزَّ وَجَلَّ ‏<A id=\"q4\" name=\"q4\" href=\"javascript:openquran(3,93,93)\"><c_q4>{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ خَالِدًا فِيهَا ‏}</c_q4></a>‏ ‏‏ ",
        "hadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمَّارٍ الدُّهْنِيِّ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، أَنَّ ابْنَ عَبَّاسٍ، سُئِلَ عَمَّنْ قَتَلَ مُؤْمِنًا مُتَعَمِّدًا ثُمَّ تَابَ وَآمَنَ وَعَمِلَ صَالِحًا ثُمَّ اهْتَدَى فَقَالَ ابْنُ عَبَّاسٍ وَأَنَّى لَهُ التَّوْبَةُ سَمِعْتُ نَبِيَّكُمْ صلى الله عليه وسلم يَقُولُ ‏\"‏ يَجِيءُ مُتَعَلِّقًا بِالْقَاتِلِ تَشْخَبُ أَوْدَاجُهُ دَمًا يَقُولُ سَلْ هَذَا فِيمَ قَتَلَنِي ‏\"‏ ‏.‏ ثُمَّ قَالَ وَاللَّهِ لَقَدْ أَنْزَلَهَا وَمَا نَسَخَهَا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 161,
        "matchingEnglishURN": 1086970,
        "last_updated": null
    },
    {
        "arabicURN": 1148820,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "48.00",
        "hadithNumber": "4867",
        "bookName": " كتاب القسامة",
        "babName": " باب مَا جَاءَ فِي كِتَابِ الْقِصَاصِ مِنَ الْمُجْتَبَى مِمَّا لَيْسَ فِي السُّنَنِ تَأْوِيلِ قَوْلِ اللَّهِ عَزَّ وَجَلَّ ‏<A id=\"q4\" name=\"q4\" href=\"javascript:openquran(3,93,93)\"><c_q4>{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ خَالِدًا فِيهَا ‏}</c_q4></a>‏ ‏‏ ",
        "hadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا النَّضْرُ بْنُ شُمَيْلٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ح وَأَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الْكَبَائِرُ الشِّرْكُ بِاللَّهِ وَعُقُوقُ الْوَالِدَيْنِ وَقَتْلُ النَّفْسِ وَقَوْلُ الزُّورِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 162,
        "matchingEnglishURN": 1086975,
        "last_updated": null
    },
    {
        "arabicURN": 1148830,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "48.00",
        "hadithNumber": "4868",
        "bookName": " كتاب القسامة",
        "babName": " باب مَا جَاءَ فِي كِتَابِ الْقِصَاصِ مِنَ الْمُجْتَبَى مِمَّا لَيْسَ فِي السُّنَنِ تَأْوِيلِ قَوْلِ اللَّهِ عَزَّ وَجَلَّ ‏<A id=\"q4\" name=\"q4\" href=\"javascript:openquran(3,93,93)\"><c_q4>{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ خَالِدًا فِيهَا ‏}</c_q4></a>‏ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ الرَّحِيمِ، قَالَ أَنْبَأَنَا ابْنُ شُمَيْلٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَنْبَأَنَا فِرَاسٌ، قَالَ سَمِعْتُ الشَّعْبِيَّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الْكَبَائِرُ الإِشْرَاكُ بِاللَّهِ وَعُقُوقُ الْوَالِدَيْنِ وَقَتْلُ النَّفْسِ وَالْيَمِينُ الْغَمُوسُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 163,
        "matchingEnglishURN": 1086980,
        "last_updated": null
    },
    {
        "arabicURN": 1148840,
        "collection": "nasai",
        "volumeNumber": 1,
        "bookNumber": 45,
        "babNumber": "48.00",
        "hadithNumber": "4869",
        "bookName": " كتاب القسامة",
        "babName": " باب مَا جَاءَ فِي كِتَابِ الْقِصَاصِ مِنَ الْمُجْتَبَى مِمَّا لَيْسَ فِي السُّنَنِ تَأْوِيلِ قَوْلِ اللَّهِ عَزَّ وَجَلَّ ‏<A id=\"q4\" name=\"q4\" href=\"javascript:openquran(3,93,93)\"><c_q4>{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ خَالِدًا فِيهَا ‏}</c_q4></a>‏ ‏‏ ",
        "hadithText": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلاَّمٍ، قَالَ حَدَّثَنَا إِسْحَاقُ الأَزْرَقُ، عَنِ الْفُضَيْلِ بْنِ غَزْوَانَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يَزْنِي الْعَبْدُ حِينَ يَزْنِي وَهُوَ مُؤْمِنٌ وَلاَ يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُهَا وَهُوَ مُؤْمِنٌ وَلاَ يَسْرِقُ وَهُوَ مُؤْمِنٌ وَلاَ يَقْتُلُ وَهُوَ مُؤْمِنٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 164,
        "matchingEnglishURN": 1086985,
        "last_updated": null
    }
]