[
    {
        "englishURN": 5000010,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1,
        "hadithText": "It was narrated that Qais said: Abu Bakr stood up and praised and glorified Allah, then he said: O people, you recite this verse: `O you who believe! Take care of your ownselves. If you follow the (right) guidance (and enjoin what is right (Islamic Monotheism and all that Islam orders one to do) and forbid what is wrong (polytheism, disbelief and all that Islam has forbidden)] no hurt can come to you from those who are in error` (al-Ma'idah 5:105]. We heard the Messenger of Allah (ﷺ) say: `lf the people see evil and do not change it, soon Allah will send His punishment upon them all.`</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 5300010,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000020,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2,
        "hadithText": "It was narrated that ‘Ali said: If I heard a hadeeth from the Messenger of Allah (ﷺ) Allah benefitted me as He willed thereby. If someone else told me something from him I would ask him to swear, and if he swore I would believe him. Abu Bakr told me - and Abu Bakr told the truth - that he heard the Prophet (ﷺ) say: `There is no man who commits a sin, then does wudoo' and does it well - Mis'ar said: and prays; Sufyan said: then prays - two rak'ahs and asks Allah, may He be glorified and exalted, for forgiveness but He will forgive him.`</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 5300020,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000030,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3,
        "hadithText": "It was narrated that al-Bara' bin 'Azib said: Abu Bakr bought a saddle from ‘Azib for thirteen dirhams, then Abu Bakr said to 'Azib. Tell al-Bara to carry it to my house. He said: No, not until you tell us what happened when the Messenger of Allah (ﷺ) went out and you were with him. Abu Bakr said: We started our journey at the beginning of the night and we hastened for one day and one night, until it was midday. I looked into the distance to see whether there was anywhere to seek shade, and I saw a rock, so I went to it and it had a little shade. I smoothed the ground for the Messenger of Allah (ﷺ) and spread a garment of camel hair for him, and said: Lie down and rest, O Messenger of Allah. So he lay down, and I went out to see if I could spot anyone looking for us. Then I saw a shepherd and I said: Who do you belong to, O boy? He said: To a man of Quraish. He mentioned his name and I recognised it. I said: Is there any milk in your sheep? He said: Yes | said: Will you milk some for me? He said: Yes. I told him to do that, so he caught a sheep, then I told him to brush the dust from its teat, then to brush the dust off his hands. I had a small vessel with me on the neck of which was a cloth. He milked a little bit of milk for me and I poured it into the vessel until it cooled down. Then I came to the Messenger of Allah (ﷺ). When I reached him, he had already woken up. I said: Drink, O Messenger of Allah. He drank until I was pleased, then I said: Is it time to move on? So we moved on and the people were coming after us but none of them caught up with us except Suraqah bin Malik bin Ju'shum, who was riding a horse of his, I said: O Messenger of Allah, someone has caught up with us. He said: `Do not be afraid, for Allah is with us.` When he got close to us, and there was no more between us and him then the length of a spear or two or three spears, I said: O Messenger of Allah, this pursuer has caught up with us, and I wept. He said: `Why are you weeping?` I said: I am not weeping for myself; rather I am weeping for you. The Messenger of Allah (ﷺ) prayed against him [the pursuer] and said: “O Allah, protect us from him by whatever means You will.” Then his horse's legs sank into the solid ground up to its belly, and he fell off it. He said: O Muhammad, I know that this is because of you; pray to Allah to save me from my predicament, and by Allah I shall divert away from you any one who is behind me of those who are seeking you. Here is my quiver, take one arrow. You are going to pass by some camels and sheep of mine in such and such a place, take whatever you need from thern. The Messenger of Allah (ﷺ) said: `I have no need of it.“ The Messenger of Allah (ﷺ) prayed for him and he was released, and he went back to his companions. The Messenger of Allah (ﷺ) and I continued on our way until we came to Madinah, where the people met him. They came out on the road and on the roofs, and a lot of servants and children crowded the road saying: Allahu Akbar, the Messenger of Allah (ﷺ) has come, Muhammad has come. The people disputed as to who he would stay with. The Messenger of Allah (ﷺ) said: `Tonight I will stay with Banun-Najjar, the maternal uncles of 'Abdul-Muttalib, to honour them thereby.” The next morning, he went where he was instructed. Al-Bara' bin 'Azib said: The first of the Muhajireen to come to us was Mus'ab bin 'Umair, the brother of Banu 'Abdud-Dar. Then Ibn Umm Maktoom, the blind man and brother of Banu Fihr, came to us. Then 'Umar bin al-Khattab, came to us with twenty riders and we said: What happened to the Messenger of Allah (ﷺ)? He said: He is behind me. Then the Messenger of Allah (ﷺ) came and Abu Bakr was with him. Al-Bara said: the Messenger of Allah (ﷺ) did not come until I had read some soorahs from al-Mufassal [Al-Mufassal is that portion of the Qur'an which goes from Qaf to an-Nas]. Isra'eel said: al-Bara' was one of the Ansar from Banu Harithah.</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam) [Bukhari 3615 and Muslim 2009]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 5300030,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000040,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 4,
        "hadithText": "It was narrated from Abu Bakr: that the Prophet (ﷺ) sent him with Soorat Bara'ah (at-Taubah) to the people of Makkah, to say that no mushrik should perform Hajj after this year and no one should circumambulate the Ka'bah naked, and no one would enter Paradise except a Muslim, whoever had a covenant with the Messenger of Allah (ﷺ) for a specific time, it would last until the stated time, and Allah is free from (all) obligations to the Mushrikoon and so is His Messenger (cf. 9:3). He went around doing that for three days, then [the Prophet (ﷺ) said to ‘Ali; “Go and catch up with him; send Abu Bakr back to me and you convey it.” So he did that. And when Abu Bakr carme to the Prophet (ﷺ) , he wept and said: O Messenger of Allah, is there something the matter with me? He said: `There is nothing but good, but I was instructed that no one should convey it except me or a man from my family.”</b>",
        "bookID": "1.0",
        "grade1": "Da'if (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 5300040,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000050,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5,
        "hadithText": "It was narrated that Awsat said: Abu Bakr addressed us and said: The Messenger of Allah (ﷺ) stood last year where I am standing. Abu Bakr wept, then he said: Ask Allah to keep you safe and sound, for no one is given anything better, after certainly of faith, than well-being. And you should be truthful, for that goes with righteousness and they lead to Paradise. And beware of lying, for that goes with immorality and they lead to Hell. Do not envy one another, do not bear grudges against one another, do not sever ties with one another, do not turn away from one another; be brothers as Allah has commanded you.”</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 5300050,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000060,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6,
        "hadithText": "Rifa'ah bin Rafi' said: I heard Abu Bakr as-Siddeeq say on the minbar of the Messenger of Allah (ﷺ) : I heard the Messenger of Allah (ﷺ) say, and Abu Bakr wept when he remembered the Messenger of Allah (ﷺ) , then he recovered and said. I heard the Messenger of Allah (ﷺ) say, in this hot weather last year: `Ask Allah for forgiveness, well-being and certainty of faith in the Hereafter and in this world.”</b>",
        "bookID": "1.0",
        "grade1": "Hasan Darussalam",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 5300060,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000070,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7,
        "hadithText": "It was narrated from Abu Bakr that the prophet (ﷺ) said: `The siwak is cleansing to the mouth and pleasing to the Lord`</b>",
        "bookID": "1.0",
        "grade1": "Sahih lighairihi because of corroborating reports",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 5300070,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000080,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 8,
        "hadithText": "It was narrated from Abu Bakr as Siddeeq that he said to the Messenger of Allah (ﷺ) : Teach me a dua that I may say in my prayer. He said: `Say: O Allah, I have wronged myself greatly and no one forgives sins but you, grant me forgiveness from you and have mercy on me for you are the Oft Forgiving Most Merciful</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam) [Bukhari 834 and Muslim 2705]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 5300080,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000090,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 9,
        "hadithText": "It was narrated from 'A'ishah at Fatimah and al-'Abbas came to Abu Bakr seeking their inheritance from the Messenger of Allah (ﷺ). At that time they were asking for his land at Fadak and his share of Khaibar. Abu Bakr said to them: I heard the Messenger Allah (ﷺ) say: `Our (Prophets property is not to be inherited and whatever we leave behind is charity. Rather the family of Muhammad may take their provision from these properties.” By Allah, I will not change any of the charity of the Messenger of Allah (ﷺ) from how it was at the time of the Messenger of Allah (ﷺ) and I will do the same with it as the Messenger of Allah (ﷺ) did.</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam) [Bukhari 4035 and Muslim 1759]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 5300090,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000100,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 10,
        "hadithText": "Abu Hurairah said: I heard Abu Bakr as-Siddeeq on this minbar saying: I heard the Messenger of Allah (ﷺ) on this day last year-then Abu Bakr wept, then he said: I heard the Messenger of Allah (ﷺ) say: `You will not be given anything, after the word of sincerity (i.e., the Shahadah), like well-being, so ask Allah for well-being.”</b>",
        "bookID": "1.0",
        "grade1": "Sahih lighairihi - Sahih because of corroborating evidence",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 5300100,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000110,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 11,
        "hadithText": "It was narrated from Anas that Abu Bakr told him: I said to the Prophet (ﷺ) when he was in the cave - on one occasion he said: when we were in the cave -: If one of them looks at his feet, he will see us beneath his feet.\nHe said: `O Abu Bakr, what do you think of two, of whom Allah is the third?`</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam) [Bukhari 3653 and Muslim 2381]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 5300110,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000120,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 12,
        "hadithText": "It was narrated that Abu Bakr as-Siddeeq said: The Messenger of Allah (ﷺ) said: `The Dajjal will emerge from a land in the east called Khurasan and he will be followed by peoples whose faces are like hammered shields.`</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 5300120,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000130,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 13,
        "hadithText": "It was narrated thal Abu Bakr as-Siddeeq said: The Messenger of Allah (ﷺ) said: `No miser, cheater, traitor or person who mistreats his slaves will enter Paradise. The first to knock at the gates of Paradise will be the slaves, if they fulfil their duties towards Allah and towards their masters properly.”</b>",
        "bookID": "1.0",
        "grade1": "Da'if because of the weakness of Sadaqah bin Moosa and Farqad As-Sabakhi",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 5300130,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000140,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 14,
        "hadithText": "It was narrated that Abu Tufail said: When the Messenger of Allah (ﷺ) died, Fatimah sent word to Abu Bakr saying: Are you the heir of the Messenger of Allah (ﷺ) or are his family? He said: No, rather his family (are his heirs). She said: Where is the share of the Messenger of Allah (ﷺ)? Abu Bakr said: I heard the Messenger of Allah (ﷺ) say: `If Allah grants some wealth to a Prophet, then takes his soul. He grants it to the one who took charge after him.` So I have decided to give the benefit of it to the Muslims. She said: That is fine, and you know best what you heard from the Messenger of Allah (ﷺ). Muhaqalah</b>",
        "bookID": "1.0",
        "grade1": "Hasan (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 5300140,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000150,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 15,
        "hadithText": "It was narrated that Abu Bakr as-Siddeeq said: One day the Messenger of Allah (ﷺ) got up and prayed Fajr, then he sat until the forenoon, then the Messenger of Allah (ﷺ) smiled. Then he sat where he was until he had prayed Zuhr, 'Asr and Maghrib, and he did not speak until he had prayed 'isha'. Then he got up and went to his family. The people said to Abu Bakr: Why don't you ask the Messenger of Allah (ﷺ) what is the matter? He did something today that he never did before. So he asked him and he said: `Yes, I was shown what is to come of this world and the Hereafter. The earlier and later generations were gathered in one place and the people got terrified because of that. They went to Adam when the sweat was about to reach their mouths, and they said: O Adam, you are the father of mankind and Allah, may He be glorified and exalted, chose you. Intercede for us with your Lord, He said: I am in the same position as you. Go to your father after your father, to Nooh, “Allah chose Adam, Nooh (Noah), the family of Ibraheem (Abraham) and the family of 'Imran above the 'Alameen (mankind and jinn) (of their times)` (Al 'Imran 3:33}.\n\nThen they will go to Nooh and will say: Intercede with your Lord for us, for Allah chose you and answered your supplication, and He did not leave one of the disbelievers on the Earth (cf. 71:26). He will say: I am not the one you want; go to Ibraheem for Allah, may He be glorified and exalted, took him as a close friend (khaleel). So they will go to Ibraheem but he will say: I am not the one you want; go to Moosa, for Allah, may He be glorified and exalted, spoke directly to him (cf. 4:164). But Moosa will say: I am not the one you want; go to 'Eesa Ibn Maryam, for he healed those born blind and the lepers, and he brought forth the dead. But 'Eesa will say: I am not the one you want; go to the leader of the sons of Adam, for he is the first one for whom the earth is split on the Day of Resurrection. Go to Muhammad, for he will intercede for you with your Lord, may He be glorified and exalted. Then (the Prophet) will go and Jibreel will come to his Lord and Allah, may He be glorified and exalted, will say: Give him permission and give him the glad tidings of Paradise. Jibreel will take him and he will fall down in prostration for a week. Allah, may He be glorified and exalted, will say: Raise your head, O Muhammad; speak and you will be heard, intercede and your intercession will be accepted. So he will raise his head, and when he looks at his Lord, may He be glorified and exalted, he will fall down in prostration for another week. Allah, may He be glorified and exalted, will say: Raise your head, O Muhammad; speak and you will be heard, intercede and your intersession will be accepted. He will start to fall down in prostration again, but Jibreel (peace be upon him) will take hold of his upper arms and Allah, may he be glorified and exalted, will inspire him to offer a supplication such as no human being was ever inspired with. He will say: `O Lord, You created me as the leader of the sons of Adam, and no boast; the first one for whom the earth is split on the Day of Resurrection, and no boast; there will come to my Cistern more people than there can be between San‘a’ and Allah (Eilat).` Then it will be said: Call the Siddeeq's so that they might intercede. Then it will be said: Call the Prophets. So one Prophet will come with a group, and another Prophet will come with five or six people, and another Prophet will come with nobody. Then it will be said: Call the martyrs so that they might intercede for whoever they want. When the martyrs do that, Allah, may He be glorified and exalted, will say: I am the Most Merciful of those who show mercy; I admit to My Paradise anyone who does not associate anything with Me.\n\nSo they will enter Paradise. Then Allah, may He be glorified and exalted, will say: Look in Hell; can you find anyone who ever did anything good? And they will find a man in Hell, and He will say to him: Did you ever do anything good? He will say: No, except that I was easy-going with people in buying and selling. And Allah, may He be glorified and exalted, will say: Be easy-going with My slave as he was easygoing with My slaves. Then they will bring a man out of Hell and He will say to him: Did you ever do anything good? He will say: No, except that l instructed my sons: When I die, burn me with fire, then grind me until I am like kohl powder. Then take me to the sea and scatter me in the wind, for by Allah the Lord of the Worlds will never be able to punish me. Allah, may He be glorified and exalted, will say: Why did you do that? He will say: For fear of You. And Allah, may He be glorified and exalted, will say: Look at the kingdom of the greatest king and you will have the like thereof and ten times as much. He will say: Are You making fun of me when You are the Sovereign? He (the Prophet (ﷺ) said: “That is what I was smiling at, at the time of the foremoon.`</b>",
        "bookID": "1.0",
        "grade1": "Hasan (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 5300150,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000160,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 16,
        "hadithText": "Qais said: Abu Bakr stood up and praised and glorified Allah, then he said: O people, you recite this verse: “O you who believe! Take care of your ownselves. If you follow the (right) guidance...” [al-Ma'idah 5:105], but you do not interpret it properly. I heard the Messenger of Allah (ﷺ) say: “If the people see evil and do not change it, soon Allah will send His punishment upon them all.` He (Qais] said: I heard Abu Bakr say: O people, beware of lying for lying is contrary to faith.</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 5300160,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000170,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 17,
        "hadithText": "It was narrated from Awsat bin Isma'eel al-Bajali that he heard Abu Bakr, when the Prophet (ﷺ) had passed away, saying: The Messenger of Allah (ﷺ) stood last year in this place where I am standing. Then Abu Bakr wept, then he said: “You must adhere to the truth, for with it comes righteousness and they both lead to Paradise. And you must beware of lying for with it comes immorality and they both lead to Hell. Ask Allah to keep you safe and sound, for no one is given anything, after certain faith (yaqeen) that is better than being kept safe and sound.` Then he said: “Do not sever ties with one another, do not turn your backs on one another, do not bear grudges against one another, do not envy one another, and be, O slaves of Allah, brothers.`</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 5300170,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000180,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 18,
        "hadithText": "It was narrated that Humaid bin ‘Abdur-Rahman said: When the Messenger of Allah (ﷺ) died, Abu Bakr was in some other area of Madinah. He came and uncovered his face and kissed him, and said: May my father and mother be sacrificed for you; how good you look in life and in death. Muhammad (ﷺ) has died, by the Lord of the Ka'bah... Then Abu Bakr and ‘Umar came together to the people, Abu Bakr spoke and did not omit anything that was revealed concerning the Ansar or that the Messenger of Allah (ﷺ) had said concerning them but he mentioned it. And he said: You know that the Messenger of Allah (ﷺ) said: `If the people were to walk in one direction and the Ansar were to walk in another, I would walk in the direction of the Ansar.` I know, O Sa'd, that the Messenger of Allah (ﷺ) said, when you were sitting here: `Quraish are to be in charge of this affair (Islam), so the righteous people are but followers of the righteous of (Quraish), and the wrongdoers among the people are but followers of the wrongdoers of (Quraish).` Sa'd said to hümn: You have spoken the truth: we are advisers and you are leaders.</b>",
        "bookID": "1.0",
        "grade1": "Sahih lighairihi - Sahih because of corroborating evidence",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 5300180,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000190,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 19,
        "hadithText": "It was narrated that Talhah bin 'Abdullah bin 'Abdur-Rahman bin Abi Bakr as-Siddeeq said: I heard my father say that his father heard Abu Bakr saying: I said to the Messenger of Allah (ﷺ) : O Messenger of Allah, are we striving for something that has already been decided or is it something to be decided as events unfold? He said: `Rather it is for something that has already been decided.` I said: So why should we strive, O Messenger of Allah? He said: “Each person will be enabled to do that for which he has been created.`</b>",
        "bookID": "1.0",
        "grade1": "Hasan lighairihi - Hasan because of corroborating evidence",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 5300190,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000200,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 20,
        "hadithText": "It was narrated that az-Zuhri said: A man among the Ansar who was a man of knowledge told me that he heard 'Uthman bin 'Affan (may Allah have mercy on him) narrate that some of the Companions of the Prophet (ﷺ), when the Prophet (ﷺ) died, grieved so much that some of thern were almost unaware of what was going on around them. 'Uthman said: I was one of them. Whilst I was sitting in the shade of a small fort, ‘Umar passed by me and greeted me, and I did not realise that he had passed me or greeted me, ‘Umar went to Abu Bakr and said to him: Do you think it is right that I passed by ‘Uthman and greeted him and he did not return my greeting? He and Abu Bakr came, when Abu Bakr had been appointed caliph and they both greeted me. Then Abu Bakr said: Your brother ‘Umar came to me and told me that he passed by you and greeted you but you did not return his greeting; what made you do that? I said: I did not do that. 'Umar said: Yes, by Allah, you did that, but you have too much pride, O Banu Umayyah. I said: By Allah, I did not realise that you had passed me or greeted me. Abu Bakr said: 'Uthman is telling the truth; is something bothering you? I said: Yes. He said: What is it? 'Uthman said: Allah, may He be glorifică and exalted, has caused His Prophet (ﷺ) to die before we could ask him how we can save ourselves, Abu Bakr said: I asked him about that. ('Uthman] said: I went to him and said: May my father and mother be sacrificed for you, you were more deserving to ask it. Abu Bakr said: I said:O Messenger of Allah, what is salvation? The Messenger of Allah (ﷺ) said: “Whoever accepts this word from me that I asked my uncle to say but he rejected it, it is salvation for him.`</b>",
        "bookID": "1.0",
        "grade1": "Sahih because of other similar reports.This isnad is Marfoo'",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 5300200,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000210,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 21,
        "hadithText": "It was narrated that Yazeed bin Abi Sufyan said: Abu Bakr said, when he sent me to Syria: O Yazeed, you have relatives and you may give them precedence in allocating positions of authority; that is the most serious thing I fear for you, because the Messenger of Allah (ﷺ) said: `Whoever is appointed in charge of any affairs of the Muslims and appoints over them anyone by way of favouritism, the curse of Allah be upon him and Allah will not accept any obligatory or nafl prayer from him until he admits him to Hell. And whoever allows anyone to transgress the sacred limits set by Allah has transgressed the sacred limits of Allah unlawfully, and on him will be the curse of Allah and Allah will forsake him.`</b>",
        "bookID": "1.0",
        "grade1": "Da'if because an old man of Quraish in the isnad is unknown",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 5300210,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000220,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 22,
        "hadithText": "lt was narrated that Abu Bakr as-Siddiq said: The Messenger of Allah (ﷺ) said: `I have been granted seventy thousand who will enter Paradise without being brought to account; their faces will be like the moon on the night when it is full and their hearts will be as the heart of one man. I asked my Lord, may He glorified and exalted, for more and He gave me more, with each one another seventy thousand.` Abu Bakr as-Siddeeq said: I thought that that referred to the people living in towns and included some of those living on the edge of the wilderness</b>",
        "bookID": "1.0",
        "grade1": "Da'if because a narrator's unknown",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 5300220,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000230,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 23,
        "hadithText": "It was narrated that Ibn 'Umar said: I heard Abu Bakr say: The Messenger of Allah (ﷺ) said: `Whoever does an evil deed will be requited for it in this world.`</b>",
        "bookID": "1.0",
        "grade1": "Sahih hadeeth because of its isnads and other similar reports;",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 5300230,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000240,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 24,
        "hadithText": "Uthman bin 'Affan narrated that when the Messenger of Allah (ﷺ) died, some of the Companions of the Prophet (ﷺ) grieved for him so much that they were almost unaware of what was going on around thern. 'Uthman said: I was one of them... and he narrated a hadeeth similar to that of Abul Yaman from Shu'aib.</b>",
        "bookID": "1.0",
        "grade1": "Sahih because of other similar reports",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 5300240,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000250,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 25,
        "hadithText": "Urwah bin az-Zubair narrated that 'A'ishah, the wife of the Prophet (ﷺ) told him that Fatimah, the daughter of the Messenger of Allah (ﷺ), asked Abu Bakr, after the death of the Messenger of Allah (ﷺ), to give her her share of inheritance from that which the Messenger of Allah (ﷺ) had left behind, of the fai' that Allah had bestowed upon him. Abu Bakr said to her: The Messenger of Allah (ﷺ) said: “Our (Prophets') property is not to be inherited and whatever we leave behind is charity.` Fatimah got angry and kept away from Abu Bakr and she continued to do so until she died. Fatimah lived for six months after the Messenger of Allah (ﷺ), and she used to ask Abu Bakr for her share of that which the Messenger of Allah (ﷺ) had left behind of Khaibar and Fadak, and his charitable endowments in Madinah, but Abu Bakr refused to give her that. He said: I will not stop doing something that the Messenger of Allah (ﷺ) used to do; rather I will continue to do it. I am afraid that if I give up something that he did, I will go astray. As for his charitable endowment in Madinah, 'Umar gave it to 'Ali and 'Abbas, but ‘Ali took most of it. As for Khaibar and Fadak, 'Umar kept them and said: They are the charitable endowment of the Messenger of Allah (ﷺ) and were spent on his responsibilities and on emergencies. They were to be cared for by whoever became caliph, and this remains the case until today.</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam) [Bukhari 3092 and Muslim 1759]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 5300250,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000260,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 26,
        "hadithText": "It was narrated from 'A'ishah that she recited this line of poetry when Abu Bakr was dying: \n\nA white man by whose face rain may be sought, a refuge for orphans and protection for widows.\n\nAbu Bakr said: By Allah, that refers to the Messenger of Allah (ﷺ).</b>",
        "bookID": "1.0",
        "grade1": "Da'if because of the weakness of 'Ali bin Zaid bin Jud'an",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 5300260,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000270,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 27,
        "hadithText": "Ibn Juraij said: My father told me that the Companions of the Prophet (ﷺ) did not know where to bury the Prophet (ﷺ) until Abu Bakr said: I heard the Messenger of Allah (ﷺ) say: `A Prophet is not to be buried except where he died.” So they removed his bed and dug a grave for him beneath</b>",
        "bookID": "1.0",
        "grade1": "Sahih. A qawi strong hadeeth because of other isnads; this isnad is Da'if because it is inuuqati' interrupted",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 5300270,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000280,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 28,
        "hadithText": "It was narrated from Abu Bakr as-Siddeeq that he said to the Messenger of Allah (ﷺ): Teach me a du'a` that I may say in my prayer. He said: `Say: O Allah. I have wronged myself greatly and no one forgives sins except You, so grant me forgiveness from You and have mercy on me, for You are the Oft-Forgiving, Most Merciful.`</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam) [Bukhari 834 and Muslim 2705]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 5300280,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000290,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 29,
        "hadithText": "It was narrated that Qais said: Abu Bakr stood up and praised and glorified Allah, then he said:O people, you recite this verse: `O you who believe! Take care of your ownselves...` (al-Ma’idah 5:105] until he reached the end of the verse. But if the people see an evildoer and do not stop him, soon Allah will send His punishment upon them all. But I heard the Messenger of Allah (ﷺ) say: “If the people...” And on another occasion he said: We heard the Messenger of Allah...</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 5300290,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000300,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 30,
        "hadithText": "It was narrated that Abu Bakr as-Siddeeq said: O people, you recite this verse: `O you who believe! Take care of your own selves. If you follow the (right) guidance [and enjoin what is right (Islamic Monotheism and all that Islam orders one to do) and forbid what is wrong (polytheism, disbelief and all that Islam has forbidden)] no hurt can come to you from those who are in error` [al-Ma’idah 5:105]. I heard the Messenger of Allah (ﷺ) say: “If the people see an evildoer and do not stop him, soon Allah will send His punishment upon them all.”</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 5300300,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000310,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 31,
        "hadithText": "t was narrated from Farqad as-Sabakhi and ' Affan said: Hammam told us: Farqad told us from Murrah at-Tayyib from Abu Bakr as-Siddeeq that the Prophet (ﷺ) said: `No one who mistreats his slaves will enter Paradise.”</b>",
        "bookID": "1.0",
        "grade1": "Da'if weak because of the weakness of Farqad as-Sabakhi",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 5300310,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000320,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 32,
        "hadithText": "It was narrated from Farqad as-Sabakhi from Murrah at-Tayyib from Abu Bakr as-Siddeeq that the Prophet (ﷺ)said: “No one will enter Paradise who is treacherous, miserly, reminds people of his favours or mistreats his slaves. The first to enter Paradise will be the slave, if he obeys Allah and obeys his master.`</b>",
        "bookID": "1.0",
        "grade1": "Da'if like the previous hadeeth",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 5300320,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000330,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 33,
        "hadithText": "It was narrated from 'Amr bin Huraith that Abu Bakr as-Siddeeq recovered from a sickness and went out to the people. He apologised for something and said: We did not intend anything but good. Then he said: The Messenger of Allah (ﷺ) told us: `The Dajjal will emerge from a land in the East called Khurasan and he will be followed by people with faces like hammered shields.”</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 5300330,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000340,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 34,
        "hadithText": "It was narrated that Yazeed bin Khumair said: I heard Sulaim bin 'Amir, a man from Homs who met the Companions of the Messenger of Allah (ﷺ), say - on one occasion he said: I heard Awsat al-Bajali narrate from Abu Bakr as-Siddeeq, he said: I heard him addressing the people - and on another occasion he said: when he was appointed as caliph - he said: The Messenger of Allah (ﷺ) stood last year where I am standing. Abu Bakr wept and said: “I ask Allah for pardon and well-being, for people are never given anything, after certainty of faith, that is better than well being. You should be truthful, for it leads to Paradise, and beware of lying, for it goes with immorality, and they lead to Hell. Do not sever ties with one another, do not hate one another, do not envy one another, do not turn your backs on one another; be brothers, as Allah, may He be glorified and exalted, has enjoined you.`</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 5300340,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000350,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 35,
        "hadithText": "It was narrated from 'Asim from Zirr from ‘Abdullah that Abu Bakr and ‘Umar gave him the glad tidings that the Messenger of Allah (ﷺ) said: `Whoever would like to recite the Qur'an fresh as it was revealed, let him recite it according to the recitation of Ibn Umm 'Abd.`\n<p>\nUmar bin al-Khattab narrated that the Prophet (ﷺ) said... a similar report, in which he said: crisp or fresh.</b>",
        "bookID": "1.0",
        "grade1": "Hasan (35), Sahih (36)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 5300350,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000370,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 37,
        "hadithText": "It was narrated from Muhammad bin Jubair bin Mut'im that 'Uthman said: I wish that I had asked the Messenger of Allah (ﷺ) what would save us from what the Shaitan whispers into our hearts. Abu Bakr said: I asked him about that and he said: `What can save you from that is to say what I told my uncle to say but he did not say it.`</b>",
        "bookID": "1.0",
        "grade1": "Sahih lighairihi and Da'if (Darussalam) because it is interrupted",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 5300360,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000380,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 38,
        "hadithText": "It was narrated from al-Hasan that Abu Bakr addressed the people and said: The Messenger of Allah (ﷺ) said: `O people, the people are not given anything better in this world than certainty of faith and well-being, so ask Allah, may He be glorified and exalted, for them.`</b>",
        "bookID": "1.0",
        "grade1": "Sahih lighairihi and Da'if (Darussalam) because it is interrupted",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 5300370,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000390,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 39,
        "hadithText": "It was narrated that Ibn 'Abbas said: When they wanted to dig a grave for the Messenger of Allah (ﷺ), Abu 'Ubaidah bin al-Jarrah used to dig graves in the manner of the people of Makkah and Abu Talhah Zaid bin Sahl used to dig graves for the people of Madinah, and he would make a niche in the side of the grave. Al-'Abbas called two men and said to one of them, Go to Abu ‘Ubaidah; and to the other he said, Go to Abu Talhah. O Allah, choose for Your Messenger. The one who had been sent to Abu Talhah found him, so he came and dug a grave with a niche in its side for the Messenger of Allah (ﷺ).</b>",
        "bookID": "1.0",
        "grade1": "Sahih bishawahidihi",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 5300380,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000400,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 40,
        "hadithText": "Uqbah bin al-Harith said: I went out with Abu Bakr following 'Asr prayer a few days after the death of the Prophet (ﷺ), and ‘Ali was walking beside him. He passed by al-Hasan bin ‘Ali who was playing with some boys. Abu Bakr carried him on his shoulder, saying: May my father be sacrificed for him, the one who looks like the Prophet (ﷺ) and does not look like 'Ali. He said: And ‘Ali smiled</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam) [Bukhari 3542]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 5300390,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000410,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 41,
        "hadithText": "It was narrated from Jabir from 'Abdur-Rahman bin Abza that Abu Bakr 4 said: I was sitting with the Prophet (ﷺ) when Ma'iz bin Malik came and confessed (to adultery) in his presence once, and he sent him away. Then he came and admitted it in his presence a second time and he sent him away. Then he came and admitted it in his presence a third time and he sent him away. I said to him: If you confess a fourth time, he will stone you. Then he admitted it the fourth time, so he detained him and asked about him, and they said: We do not know anything but good about him. Then he ordered that he be stoned.</b>",
        "bookID": "1.0",
        "grade1": "Sahih lighairihi, but this isnad is Da'if because of the weakness of Jabir al-Ju'fi",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 5300400,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000420,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 42,
        "hadithText": "It was narrated that Rafi' atTaʼi, Abu Bakrʼs companion during the campaign of as-Salasil, said: I asked him about how they came to swear allegiance to Abu Bakr and he said - when telling him about what the Ansar said and what Abu Bakr said to them and what `Umar bin al-Khattab said to the Ansar when he reminded them that he had led them in prayer on the instructions of the Messenger of Allah (ﷺ) when he was sick. They swore allegiance to me because of that and I Accepted it from them, but I was concerned that there would be turmoil that would lead to apostasy,</b>",
        "bookID": "1.0",
        "grade1": "Sahih. Its isnad is jayyid",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 5300410,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000430,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 43,
        "hadithText": "It was narrated from Wahshi bin Harb that Abu Bakr appointed Khalid bin al-Waleed as commander to fight the apostates and he said: I heard the Messenger of Allah (ﷺ) say: “What a good slave of Allah and member of the tribe Khalid bin al-Waleed is! [He is] one of the swords of Allah that Allah, may He be glorified and exalted, has unsheathed against disbelievers and hypocrites.`</b>",
        "bookID": "1.0",
        "grade1": "Sahih because of corroborating evidence, this is a Da'if isnad",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 5300420,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000440,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 44,
        "hadithText": "Mu'awiyah bin Salih narrated from Sulaim bin 'Amir al-Kala'i, that Awsat bin 'Amr said: I came to Madinah one year after the death of the Messenger of Allah (ﷺ) and I found Abu Bakr addressing the people. He said: The Messenger of Allah (ﷺ) stood before us last year... and he wept and struggled to speak three times, then he said: 0 people, ask Allah for well-being for no one is given, after certainty of faith, anything like well being and nothing worse than doubt after disbelief. You should be truthful, for it guides to righteousness and they lead to Paradise. Beware of lying, for it guides to immorality and they both lead to Hell.</b>",
        "bookID": "1.0",
        "grade1": "Hasan (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 5300430,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000450,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 45,
        "hadithText": "Muhammad bin Muyassar Abu Sa'd as-Saghani al-Makfoot narrated: Hisham bin 'Lirwah narrated to us from his father that ‘Aʼishah said; When Abu Bakr was dying, he said: What day is it? They said: Monday. He said: if I die tonight, do not wait until tomorrow to bury me, for the dearest of days and nights to me is that which is closest to the Messenger of Allah (ﷺ).</b>",
        "bookID": "1.0",
        "grade1": "Da'if isnad because of the weakness of Muhammad bin Muyassar",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 5300440,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000460,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 46,
        "hadithText": "It was narrâted that Abu 'Ubaidah said: Abu Bakr stood up, one year after the death of the Messenger of Allah (ﷺ) and said: The Messenger of Allah (ﷺ) stood where I am standing last year and said: “Ask Allah for well being, for no one is given anything better than well-being. And you should be truthful and righteous, for they lead to Paradise. Beware of lying and immorality, for they lead to Hell.`</b>",
        "bookID": "1.0",
        "grade1": "Sahih lighairihi. This isnad is weak because it is interrupted",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 5300450,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000490,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 49,
        "hadithText": "‘Umar said: Abu Bakr -q. addressed us and said: The Messenger of Allah (ﷺ) stood among us last year and said: “Nothing is shared out among the people that is better than well-being after certainty of faith. Verily, truthfulness and righteousness lead to Paradise and verily lying and immorality lead to Hell.`</b>",
        "bookID": "1.0",
        "grade1": "Sahih lighairihi. Da'of (Darussalam) [ because it is interrupted",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 5300470,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000500,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 50,
        "hadithText": "Al-Bara` said: When the Messenger of Allah (ﷺ) came from Makkah to Madinah, the Messenger of Allah (ﷺ) got thirsty. They passed by a herd of sheep, Abu Bakr as Siddeeq said: I took a cup and milked a cupful of milk for the Messenger of Allah (ﷺ). I brought it to him and he drank until I was pleased,</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam) [Bukhari 3908 and Muslim 2009]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 5300480,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000530,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 53,
        "hadithText": "It was narrated from Abu Bakr as-Siddeeq that he delivered a khutbah and said: 0 people, you recite this verse but you quote it inappropriately: “O you who believe! Take care of your own selves. If you follow the (right) guidance [and enjoin what is right (Islamic Monotheism and all that Islam orders one to do) and forbid what is wrong (polytheism, disbelief and all that Islam has forbidden)] no hurt can come to you from those who are in error` (al-Ma'idah 5:105]. I heard the Messenger of Allah (ﷺ) say: `If the people see evil and do not denounce it, soon Allah will send His punishment upon them ali.”</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 5300500,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000540,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 54,
        "hadithText": "It was narrated that Abu Barzah al-Aslami said: A man spoke harshly to Abu Bakr asSiddeeq. Abu Barzah said: Shall I strike his neck? He [Abu Bakr, rebuked him and said: That is not for any one after the Messenger of Allah (ﷺ).</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 5300510,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000550,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 55,
        "hadithText": "It was narrated from 'Urwah bin az-Zubair that 'A'ishah the wife of the Prophet 35 told him: Fatimah the daughter of the Messenger of Allah (ﷺ) sent word to Abu Bakr as-Siddeeq, asking for her inheritance from the Messenger of Allah (ﷺ), of the fai` that Allah had granted to him in Madinah and Fadak, and what was left of the khurnus of Khaibar, Abu Bakr said: The Messenger of Allah (ﷺ) said: `We (Prophets) are not to be inherited from and whatever we leave behind is charity. Rather the family of Muhammad may take their provision from this wealth.` By Allah, I will not change any of the charity of the Messenger of Allah (ﷺ) from how it was at the time of the Messenger of Allah (ﷺ), and I will do the same with it as the Messenger of Allah (ﷺ) did. So Abu Bakr refused to give anything of it to Fatimah, and Fatimah was upset with Abu Bakr because of that. Abu Bakr said; By the One in Whose hand is my soul, the relatives of the Messenger of Allah (ﷺ) are dearer to me than my own relatives. As for the dispute between me and you concerning this wealth, I did not deviate from the truth concerning them and I will not leave anything that I saw the Messenger of Allah (ﷺ) do but I will do it the way he did it.</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam) [Bukhari 4240 and Muslim 1759]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 5300520,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000560,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 56,
        "hadithText": "It was narrated that Asma' bin [sic] al-Hakam al-Fazari said: I heard ‘Ali say: If I heard a hadeeth from the Messenger of Allah (ﷺ), Allah benefitted me as He willed thereby. If someone else told me something from him I would ask him to swear, and if he swore I would believe him. Abu Bakr told me - and Abu Bakr told the truth - that he heard the Prophet (ﷺ) say: `There is no believer who commits a sin, then does wudoo` and does it well and prays two rak'ahs and asks Allah, may He be glorified and exalted, for forgiveness but Allah will forgive him.` Then he recited the verse: `And those who, when they have committed Fahishah (illegal sexual intercourse) or wronged themselves...` (Al ‘Imran 3:135).</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 5300530,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000570,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 57,
        "hadithText": "It was narrated that Zaid bin Thabit said: Abu Bakr sent for me when many of the people of al-Yamamah were killed. Abu Bakr said: O Zaid bin Thabit, you are a wise young man and we trust you; you used to write down the Revelation for the Messenger of Allah (ﷺ). Seek out the Qur'an and collect it.</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam) [Bukhari 4986]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 5300540,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000580,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 58,
        "hadithText": "It was narrated from 'A'ishah that Fatimah and al-'Abbas came to Abu Bakr, seeking their inheritance from the Messenger of Allah (ﷺ). At that time they were seeking his land in Fadak and his share of Khaibar. Abu Bakr said to them: I heard the Messenger of Allah (ﷺ) say: `We (Prophets) are not to be inherited from and whatever we leave behind is charity. Rather the family of Muhammad; may take their provision from this wealth.` By Allah, I will not leave anything that I saw the Messenger of Allah (ﷺ) do with it but I will do it too.</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam) [Bukhari 4035 and Muslim 1759]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 5300550,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000590,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 59,
        "hadithText": "It was narrated that Ibn Abi Mulaikah said. It was said to Abu Bakr: O khaleefah (caliph) of Allah. He said: I am the khaleefah (lit. successor) of the Messenger of Allah (ﷺ) and I am pleased with that.</b>",
        "bookID": "1.0",
        "grade1": "Da'if because it is interrupted",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 5300560,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000600,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 60,
        "hadithText": "It was narrated from Abu Salamah that Fatimah said to Abu Bakr: Who will inherit from you if you die? He Said: My children and my wife. She said: Then why can't we inherit from the Prophet (ﷺ). He said: I heard the Prophet (ﷺ) say: `The Prophet is not to be inherited from.” But I will sponsor those whom the Messenger of Allah (ﷺ) used to sponsor and I will spend on those on whom the Messenger of Allah used to spend.</b>",
        "bookID": "1.0",
        "grade1": "Sahih lighairihi; Abu Salamah did not meet Abu Bakr",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 5300570,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000610,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 61,
        "hadithText": "It was narrated from Abu Barzah al-Aslami that he said: We were with Abu Bakr as-Siddeeq when he was conducting some business of caliphate and he got very angry with one of the Muslims. When I saw that I said: O Khaleefah of the Messenger of Allah, shall I strike his neck? When I mentioned killing him, he changed the subject completely, When we parted, Abu Bakr as Siddeeq sent word to me after that and said: O Abu Barzah, what did you say? I said: I have forgotten what I said; remind me. He said: Don't you remember what you said? I said: No, by Allah. He said: Do you remember, when you saw me get angry with that man, you said: Shall I strike his neck, O khaleefah of the Messenger of Allah? Don't you remember that? would you really have done that? I said: Yes, by Allah. If you order me to do it now, I will do it. He said: Woe to you! By Allah, that is not for anyone after Muhammad (ﷺ).</b>",
        "bookID": "1.0",
        "grade1": "Sahih. lts isnad is qawi!",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 5300580,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000620,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 62,
        "hadithText": "Abu Bakr as-Siddeeq said: The Messenger of Allah (ﷺ) said: `The siwak is purifying for the mouth and pleasing to the Lord.”</b>",
        "bookID": "1.0",
        "grade1": "Sahih lighairihi",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 5300590,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000630,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 63,
        "hadithText": "Abu Hurairah said: Abu Bakr said: O Messenger of Allah, tell me something I may say in the morning and in the evening. He said: `Say: 'O Allah, Knower of the unseen and the seen, Creator of the heavens and the earth, Lord and Sovereign of all things, I bear witness that there is no god but You, I seek refuge in You from the evil of my own self and the evil of the Shuitart and the shirk to which he calls.` And he told him to say it in the morning and in the evening and when going to bed.</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 5300600,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000640,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 64,
        "hadithText": "It was narrated that ‘Abdullah bin Abi Mulaikah said: It was said to Abu Bakr: O khaleefäh of Allah. He said: Rather slam] the khaleefah (lit successor) of Muhammad (ﷺ), and I am pleased with that,</b>",
        "bookID": "1.0",
        "grade1": "Da'if because it is interrupted",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 5300610,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000650,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 65,
        "hadithText": "It was narrated that Ibn Abi Mulaikah said: The halter fell from the hand of Abu Bakr as-Siddeeq. He struck the foreleg of his she-camel to make her kneel down, and they said to him: Why did you not tell us to pass it to you? He said: My beloved the Messenger of Allah (ﷺ) instructed me not to ask the people for anything.</b>",
        "bookID": "1.0",
        "grade1": "Hasan lighairihi; this isnad is Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 5300620,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000660,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 66,
        "hadithText": "It was narrated from Abu 'Ubaidah that Abu Bakr stood up one year after the death of the Messenger of Allah (ﷺ) and said: The Messenger of Allah (ﷺ) stood among us last year and said: `The son of Adam has not been given anything better than well-being, so ask Allah for well-being. You should be truthful and righteous, for they lead to Paradise, and you should beware of lying and immorality, for they lead to Hell.`</b>",
        "bookID": "1.0",
        "grade1": "Sahih lighairihi; this isnad is Da'if because it is interrupted",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 5300630,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000670,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 67,
        "hadithText": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said: “I have been commanded to fight the people until they say La ilaha illallah, and if they say it then their blood and wealth are safe from me, except in cases dictated by sharee'ah, and their reckoning is with Allah.” When some people apostatized, ʼUmar said to Abu Bakr: Will you fight them when you heard the Messenger of Allah is say such and such? Abu Bakr said: By Allah, I will not separate prayer and zakah, and I shall certainly fight anyone who separates them. So we fought them alongside him and we realised that that was the right thing to do.</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam) [Bukhari 6924 and Muslim 20]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 5300640,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000680,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 68,
        "hadithText": "It was narrated that Abu Bakr bin Abi Zuhair said: I was told that Abu Bakr said: O Messenger of Allah, how could we be in a good state after this verse: “It will not be in accordance with your desires (Muslims), nor those of the people of the Scripture (Jews and Christians), whosoever works evil, will have the recompense thereof` fan-Nisa' 4:123]? Will we be punished for every bad deed we do? There Messenger of Allah (ﷺ) said: `May Allah forgive you, O Abu Bakr, do you not fall sick? Do you not get exhausted? Do you not feel sad? Don't calamities befall you?` He said: Of course. He said: `That is the recompense you are given.`</b>",
        "bookID": "1.0",
        "grade1": "Sahih bituruqihi wa shawahidihi",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 5300650,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000710,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 71,
        "hadithText": "It was narrated that Abu Bakr bin Abi Zuhair ath-Thaqafi said: When the verse `It will not be in accordance with your desires (Muslims), nor those of the people of the Scripture (Jews and Christians), whosoever works evil, will have the recompense thereof` [an-Nisa' 4:123] was revealed, Abu Bakr to said: O Messenger of Allah, will we receive recompense for every bad deed we do? The Messenger of Allah (ﷺ) said: `May Allah have mercy on you, O Abu Bakr. Do you not become exhausted? Do you not feel sad? Don't calamities befall you? This is the recompense that you receive.”</b>",
        "bookID": "1.0",
        "grade1": "Sahih; although this isnad is Da'if like the previous one",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 5300670,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000720,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 72,
        "hadithText": "It was narrated from Anas bin Malik that Abu Bakr wrote to thern saying: These are the types of charity (zakah) that the Messenger of Allah (ﷺ) made obligatory upon the Muslims and which Allah, may He be glorified and exalted, enjoined upon the Messenger of Allah (ﷺ). Whoever among the Muslims is asked to pay it in the proper manner, let him give it; whoever is asked for more than that, let him not give it. For less than twenty-five camels, for each five, one sheep (should be given). If the number reaches twenty-five, then one she-camel in its second year (should be given), up to thirty-five. If there is no she-camel in its second year, then a he-camel in its third year (may be given). If the number reaches thirty-six, then a she-camel in its third year (should be given), up to forty-five. If the number reaches forty-six, then a she-camel in its fourth year that has been bred to a stallion camel should be given, up to sixty, If the number reaches sixty-one, then a she-camel in its fifth year (should be given), up to seventy five. If the number reaches seventy-six, then two she-camels in their second year (should be given), up to ninety. If the number reaches ninety-one, then two she camels in their fourth year that have been bred to a stallion camel should be given, up to one hundred and twenty. If the number is more than one hundred and twenty, then for every forty camels, a she-camel limits third year should be given and for every fifty a she-camel in its fourth year. If the ages of the camels for zakah differ, if what is due is a she-camel in its fifth year but he does not own such a camel, but he has a she-camel in its fourth year, then that will be accepted from him and he should add to it two sheep, if available, or twenty dirhams. If what is due from him is a she-camel in its fourth year and he only has a she camel in its fifth year, it should be accepted from him and the zakat collector should give him back twenty dirhams or two sheep. If what is due from him is a shecamel in its fourth year, but he does not have such a cameland he has a she-camel in its third year, then it should be accepted from him and he should add to it two sheep, is available, or twenty dirhams. If what is due from him is a she camel in its second year, but he only has a he-camel in its third year, then it should be accepted from him and nothing should be added to it. If he has only four camels, no zakah is due unless the owner wants to give it. With regard to zakah on sheep in the pasture, if there are forty sheep, then one sheep is due as zakah, up to one hundred and twenty sheep. of there is one more than that, then two sheep are due, up to two hundred. If there is one more than that then three sheep are due, up to three hundred. If there is one more than that, then for every hundred sheep, one sheep is due No toothless or defective sheep should be taken as zakah and neither should a ram, unless the one who is giving allows that. Separate flocks should not be put together and flocks should not be divided so as to avoid or reduce zakah. If there are two partners [and the zakah-collector comes and takes zakah), they should settle the matter between them on a fair basis. If a man's flock is grazing if it is one less than forty, then no zakah is due on it unless the owner wants to give it. On silver the zakah is one quarter of one tenth; if the wealth is only one hundred and ninety dirhams, then no zakah is due on it unless the owner wants to give it.</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam) [Bukhari 1448]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 5300680,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000730,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 73,
        "hadithText": "Abdur-Razzaq said: The people of Makkah say: Ibn Juraij learned the prayer from 'Ata' and `Ata` learned it from Ibn az-Zubair and Ibn az-Zubair learned it from Abu Bakr and Abu Bakr learned it from the Prophet (ﷺ). I have never seen anyone who prays better than Ibn Juraij.\n\nThis is a report praising Ibn Juraij and is not a hadeeth; this was stated by Ahmad Shakir</b>",
        "bookID": "1.0",
        "grade1": "",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 5300690,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000740,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 74,
        "hadithText": "It was narrated from Salim from Ibn ‘Umar that `Umar said: Hafsah bint 'Umar became the widow of Khunais or Hudhaifah bin Hudhafah - 'Abdur-Razzaq was not certain. He was one of the Companions of the Prophet (ﷺ) who were present at Badr, and he died in Madinah, I met 'Uthman bin `Affan and offered I Hafsah to him in marriage, I said: If you wish, I will marry Hafsah to you. He said: I will think about it. A few days passed, then he met me and said: I do not want to get married at present. 'Umar said: Then I met Abu Bakr and I said: If you wish, I will marry Hafsah the daughter of ‘Umar to you. He did not give any response to me, and I was more upset with him than with 'Uthman. A few days passed, then the Messenger of Allah (ﷺ) proposed marriage to her and he gave her in marriage to him. Abu Bakr met me and said: Perhaps you felt upset with me when you offered Hafsah to me in marriage and I did not give you any response? I said: Yes. He said: Nothing prevented me from giving you an answer when you offered her to me in marriage except that I heard the Messenger of Allah (ﷺ) mention her and I did not want to disclose the private matters of the Messenger of Allah (ﷺ). If he had not married her, I would have married her.</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam) [Bukhari 5129]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 5300700,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000750,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 75,
        "hadithText": "It was narrated that Abu Bakr as Siddeeq said: The Messenger of Allah (ﷺ) said: “No one who mistreats his slaves will enter Paradise.` Aman said: O Messenger of Allah, didn't you tell us that this ummah is the greatest in numbers of slaves and orphans? He said: `Yes, so treat them kindly as you treat your children and feed them from what you eat.` They said: What could benefit us in this world, O Messenger of Allah? He said: “A good horse which you keep ready for fighting for the sake of Allah and a slave to take care of you. If he prays (becomes Muslim), then he is your brother, if he prays, then he is your brother.”</b>",
        "bookID": "1.0",
        "grade1": "Da'if because of the weakness of Farqad as-Sabakhil",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 5300710,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000760,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 76,
        "hadithText": "Ibn as-Sabbaq said that Zaid bin Thabit told him that Abu Bakr sent for him to tell him that a large number of people at al-Yamamah had been killed. He found ʼUmar with him and Abu Bakr said: ‘Umar has come to me and told me that casualties were heavy at al-Yamamah among the Muslims who knew the Qur'an by heart, and I am afraid that more heavy casualties may take place among the Muslims who know the Qur'an by heart on other battlefields and a large part of the Qur’an may be lost. I ['Umar] think that you [Abu Bakr should issue instructions that the Qur'an be collected. I said to ‘Umar. How can I do anything that the Messenger of Allah (ﷺ) did not do? He said: By Allah, it is a good thing. And he kept urging me to do that until Allah opened my heart to it and I came around to 'Umar's point of view. Zaid said: And ‘Umar was sitting with him, not speaking. Abu Bakr said: You are a wise young man and we trust you. You used to write down the revelation for the Messenger of Allah (ﷺ), so collect it. Zaid said: By Allah, if they had ordered me to move a mountain, that would not have been more difficult for me than what they instructed me to do of collecting the Qur'an. I said: How can you do anything that the Messenger of Allah (ﷺ) did not do?</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam) [Bukhari 4986]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 5300720,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000770,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 77,
        "hadithText": "It was narrated that Ibn 'Abbas said: When the Messenger of Allah (ﷺ) died and Abu Bakr was appointed as caliph, al-'Abbas disputed with ‘Ali concerning some things that the Messenger of Allah: had left behind. Abu Bakr said: It is something that the Messenger of Allah (ﷺ) left the way it is and I am not going to introduce any changes to it. When 'Umar was appointed as caliph, they referred the dispute to him and he said: It is something that Abu Bakr did not change and I am not going to change it. When 'Uthman was appointed as caliph, they referred the dispute to him and ‘Uthman remained quiet and lowered his head. Ibn 'Abbas said: I was afraid that he (‘Uthman) would take it back so I struck al-'Abbas between his shoulders and said: O my father, I insist that you give it to 'Ali. So he gave it to him.</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 5300730,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000780,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 78,
        "hadithText": "It was narrated that 'Asim bin Kulaib said: An old man of Quraish, from Banu Taim, told me: So and so, and So and so told me - and he listed six or seven, all of whom were from Quraish, one of whom was 'Abdullah bin az-Zubair, - and said: Whilst we were sitting with ‘Umar, ‘Ali and al-'Abbas came in, and they had been raising their voices. ‘Umar said: Stop, O'Abbas! I know what you are going to say. You are going to say: He (the Prophet (ﷺ)) is the son of my brother and I should have half of the wealth. And I know what you are going to say, O 'Ali. You are going to say: His daughter is married to me and she should have half of the wealth. This is what the Messenger of Allah (ﷺ) had, and we saw how he managed it. Then Abu Bakr took charge of it after him, and he dealt with it in the same way as the Messenger of Allah (ﷺ) had dealt with it. Then I took charge after Abu Bakr and I swear by Allah that I will strive my best to deal with it as the Messenger of Allah (ﷺ) and Abu Bakr to dealt with it. Then he said: Abu Bakr told me and he swore by Allah that he was telling the truth, that he heard the Prophet (ﷺ) say: `The Prophet is not to be inherited from; rather his estate is to go to the poor and needy Muslims.` And Abu Bakr told me and swore by Allah that he was telling the truth, that the Prophet (ﷺ) Said: 'No Prophet dies until he has been led in prayer by one of his ummah.` This is what was in the possession of the Messenger of Allah (ﷺ) and we saw how he dealt with it. If you wish, I will give it to you to manage it in the same way as the Messenger of Al!ah (ﷺ) and Abu Bakr did, so that I can put it under your control. They discussed it privately, then they came and al-'Abbas said: Give it to ‘Ali, for I am happy for him to take control of it.</b>",
        "bookID": "1.0",
        "grade1": "Sahih lighairihil",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 5300740,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000790,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 79,
        "hadithText": "It was narrated from Abu Hurairah that Fatimah came to Abu Bakr and 'Umar to ask for her inheritance from the Messenger of Allah (ﷺ). They said: We heard the Messenger of Allah (ﷺ) say: “I am not to be inherited from.`</b>",
        "bookID": "1.0",
        "grade1": "Hasan (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 5300750,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000800,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 80,
        "hadithText": "It was narrated that Qais bin Abi Hazim said: I was sitting with Abu Bakr as-Siddeeq, the successor of the Messenger of Allah (ﷺ), one month after the death of the Prophet (ﷺ) and he was telling a story, then the call went out among the people, `As-salatu jami'ah (prayer is about to begin),` and it was the first time that this call of `as-salatu jami'ah` went out to the people. The people gathered and he ascended the minbar, which was something that was made for him to deliver speeches, and it was the first speech he gave in Islam. He praised and glorified Allah, then he said: O People, I wish that someone else could have taken care of this for me, for if you compare my way to the way of your Prophet (ﷺ), I cannot be like him, for he was protected from the shaitan and the revelation used to come to him from heaven.</b>",
        "bookID": "1.0",
        "grade1": "Da'if because of the weakness of Eesa bin al-Musayyab",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 5300760,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000810,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 81,
        "hadithText": "It was narrated that Mujahid said: Abu Bakr as-Siddeeq said: The Messenger of Allah (ﷺ) commanded me to say, in the morning, in the evening and when I went to bed at night: `O Allah, Creator of the heavens and the earth. Knower of the unseen and the seen. You are the Lord and Sovereign of all things. I bear witness that there is no god but You alone with no partner or associate, and that Muhammad is Your slave and Your Messenger. I seek refuge in You from the evil of my own self and the evil of the shaitan and the shirk to which he calls, and lest I wrong myself or wrong another Muslim.`</b>",
        "bookID": "1.0",
        "grade1": "Hasan lighairihi, and its isnad is weak",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 5300770,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000471,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": "",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 47,
        "hadithText": "Ali said: If Heard something from the Messenger of Allah (ﷺ), Allah would benefit me thereby as He willed. Abu Bakr told me - and Abu Bakr spoke the truth - he said: The Messenger of Allah (ﷺ) said: `There is no Muslim who commits a sin then does wudu' and prays two rak'ahs then asks Allah for forgiveness for that sin, but He will forgive him.” And he recited these two verses: `And whoever does evil or wrongs himself but afterwards seeks Allah's forgiveness, he will find Allah Oft-Forgiving Most Merciful` [an-Nisa’ 4:110] \n“And those who, when they have committed Fahishah (illegal sexual intercourse) or wronged themselves with evil, remember Allah and ask forgiveness for their sins;-and none can forgive sins but Allah - and do not persist in what (wrong) they have done, while they know` [Al ‘Imran 3:135]\n<p>\nShu'bah said: I heard 'Uthman from the family of Abu 'Aqeel athThaqafi say--but he said. Shu'bah said: And he recited one of these two verses: `whosoever works evil, will have the recompense thereof` [an-Nisa'4:110] or “And those who, when they have committed Fahishah (illegal sexual intercourse)...` [Al 'Imran 3:135).</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 5300460,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000511,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": "",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 51,
        "hadithText": "Abu Hurairah said. Abu Bakr said: O Messenger of Allah, teach me something that I may say in the morning and in the evening and when I go to bed. He said: `Say: O Allah, Creator of the heavens and the earth. Knower of the unseen and the seen – or he said: O Allah, Knower of the unseen and the seen, Creator of the heavens and the earth - Lord and Sovereign of all things, I bear witness that there is no god but You; I seek refuge in You from the evil of my own self and the evil of the Shaitan and the shirk to which he calls people.”\n<p>\nIt was narrated that Ya'la bin `Ata' said: I heard 'Amr bin 'Asim bin ‘Abdullah... a similar report.</b>",
        "bookID": "1.0",
        "grade1": "Sahih (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 5300490,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5000691,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 1,
        "bookName": "",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 69,
        "hadithText": "Ibn Abi Khalid told us, from Abu Bakr bin Abi Zuhair - I think he said: Abu Bakr said: O Messenger of Allah, how could we be in a good state after this verse? He said: `May Allah have mercy on you, O Abu Bakr. Do you not fall sick? Do you not feel sad? Don't calamities befall you? Do you not...?” He said: Of course. He said: `That is for that.\n<p>\nIt was narrated that Abu Bakr ath-Thaqafi said: Abu Bakr said: O Messenger of Allah, how could we be in a good state after this verse: `whosoever works evil, will have the recompense thereof` (an-Nisa' 4:123)?... and he narrated the same Hadeeth</b>",
        "bookID": "1.0",
        "grade1": "Sahih, although this isnad is Da'if like the previous one",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 5300660,
        "last_updated": "2020-06-07 23:43:08"
    }
]