[
    {
        "englishURN": 5003910,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 391,
        "hadithText": "It was narrated from `Ubaidullah bin ‘Abdullah bin `Utbah bin Mas`ood that Ibn `Abbas told him that ‘AbdurRahman bin ‘Awf went back to where he had halted. Ibn `Abbas said: I used to recite to ‘AbdurRahman bin ‘Awf, and he found me waiting for him. That was in Mina during the last Hajj performed by `Umar bin al-Khattab (رضي الله عنه) Abdur-Rahman bin `Awf said: A man came to `Umar bin al-Khattab and said: So and so is saying: If `Umar (رضي الله عنه) dies, I will swear allegiance to So and so. ʼUmar (رضي الله عنه) said: I will stand before the people today and warn them against these people who want to deprive them of their rights, `Abdur-Rahman said: I said: O Ameer al-Mu`mineen, do not do that, for the Hajj season brings together the riffraff and rabble among the people, and most of the people who gather around and listen to you will be of that type. Is you stand before the people, I am afraid that you will say something that they will spread and not understand it properly or interpret it properly. Rather wait until you come to Madinah, for it is the land of Hijrah and the Sunnah, and you will meet the most knowledgeable and noble people there, and you can say what you want to say with confidence; they wilt understand what you say and will interpret it correctly, `Umar (رضي الله عنه) said: If I reach Madinah safe and sound, I shall certainly talk to the people there in the first speech I deliver. When we came to Madinah at the end of Dhul-I-Iijah, it was a Friday. I set out early, ‘Umar did not care at what time he went out, because he did not pay attention to heat and cold and so on. I found Sa`eed bin Zaid at the right-hand corner of the minbar, he had got there before me. I sat down next to him, with my knee touching his knee, and it was not long before `Umar (رضي الله عنه)came. When I saw him, I said: He will certainly speak today on this minbar and say something that no one ever heard before. Sa`eed bin Zaid objected to that and said: What do you think he will say that no one said before? `Umar (رضي الله عنه)sat on the minbar, and when the mu`dhdhin fell silent, he stood up and praised and glorified Allah as He deserves, then he said: To proceed o people, I am going to tell you something that it has been decreed I should say. I do not know, perhaps it may signal my death. So whoever understands it and remembers it, let him narrate it to others wherever his mount takes him; whoever does not understand il, it is not permissible for him to tell lies about me. Allah, may He be blessed and exalted, sent Muhammad (ﷺ) with the truth and revealed the Book to him; among the things that were revealed to him was the verse of stoning [adulterers). We read it and understood it; the Messenger of Allah (ﷺ) stoned [adulterers] and we stoned adulterers] after him. But I fear that with the passage of time, some people will say: We do not find the verse of stoning in the Book of Allah, thus they will go astray by forsaking an  obligation that Allah revealed. Stoning is the due punishment in the Book of Allah for those who commit zina, both men and women, if they have been married and if proof is established, or there is a pregnancy or a confession, And we used to recite: Do not claim to be the offspring of anyone other than your fathers, as it is disbelief (or ingratitude) on your part to claim to be the offspring of anyone other than your fathers, Verily the Messenger of Allah (ﷺ) said: `Do not praise me excessively as `Eesa, the son of Maryam, was praised; rather I am the slave of Allah, so say, the slave of Allah and His Messenger.` I have heard that some among you are saying. If `Umar (رضي الله عنه) dies, I shall swear allegiance to So and so. No man should deceive himself by saying that the oath of allegiance to Abu Bakr was given suddenly and it was is successful. There is no doubt that this is the case, but Allah, may He be glorified and exalted, saved the to 2 people from its bad consequences and there is no one among you today who has the qualities of Abu Bakr (رضي الله عنه) What happened to us when the Messenger of Allah (ﷺ) died was that ‘Ali, az-Zubair and those who were with them stayed behind in the house of Fatimah, the daughter of the Messenger of Allah (ﷺ), and all the Ansar stayed behind and gathered in Saqeefat Banu Sa`idah, whilst the Muhajireen gathered around Abu Bakr (رضي الله عنه) I said to him; O Abu Bakr, let us go to our brothers, the Ansar. So we set out, looking for them, then we were met by two righteous men who told us what the people had done, and said: where are you going, O Muhajireen? I said: We are looking for these brothers of ours, the Ansar, They said. You should not go near them; do whatever you have already decided, O Muhajireen. I said: By Allah, we will go to them. So we carried on until we came to them in Saqeefat Banu Sa`idah, where we found them gathered and among them was a man wrapped up [in a garment. I said: Who is this? They said: Sa`d bin `Ubadah. ! said: What is the matter with him? They said: He is sick. After we sat down, their spokesman stood up and praised and glorified Allah, may He glorified and exalted, as He deserves, then he said: To proceed. We are the supporters (Ansar) of Allah and the majority of the Muslim army. You, O Muhajireen, are a small group among us. Some of you came to us, wanting to deny who we are and prevent us from attaining a position of authority. When he fell silent, I wanted to present a speech that I had prepared and that I liked in front of Abu Bakr (رضي الله عنه) I used to avoid provoking him and he was more forbearing and more dignified than me. But Abu Bakr (رضي الله عنه) said: Wait a while. I did not like to make him angry, and he was more knowledgeable and more dignified than me. By Allah, he did not omit any word that I liked in the speech I had prepared but he said something like it or better, speaking spontaneously, until he finished speaking. Then he said: To proceed. Whatever you have mentioned about your achievements and virtues, is correct. The Arabs would not acknowledge the leadership of anyone except someone from this tribe of Quraish, for they are the best of the Arabs in lineage and location. I am pleased to suggest to you one of these two men, whichever of them you want. Then he took hold of my hand and the hand of Abu `Ubaidah bin al-Jarrah, and I disliked nothing of what he had said apart from this, for by Allah, I would rather have my neck struck for no sin on my part than to become the leader of people among whom was Abu Bakr (رضي الله عنه) unless my own self suggested something at the time of death. One of the Ansar said: I am the post on which the camel with a skin disease scratches itself and I am like a high class palm tree [i.e., a noble]. [I suggest] a ruler from among us and a ruler from among you, O Quraish. - I the narrator said to Malik; What does ‘I am the post on which the cainc! with a skin disease scratches itself and I am like a high class palm tree` mean? He said:It is as if he is saying, I am the smart one who has the answer. - Then there was a great deal of clamour and raised voices, to such an extent that I feared there would be a conflict, so I said: Hold out your hand, O Abu Bakr. So he held out his hand and I swore allegiance to him, and the Muhajireen swore allegiance to him, then the Ansar swore allegiance to him. Thus we surrounded Sa`d bin ‘Ubadah. One of them said: You have killed Sa`d i said: May Allah kill Sa’d! And `Umar (رضي الله عنه) said: By Allah, we never encountered any problem greater than the swearing of allegiance to Abu Bakr (رضي الله عنه) . We were afraid that if we left the people without having sworn allegiance to anyone, they might swear allegiance after we were gone, so we would either follow in their footsteps and swear allegiance to someone we were not pleased with, or we would disagree with them and that would cause trouble. If anyone swears allegiance to a leader without consulting the Muslims, there is no allegiance for him and no allegiance to the one who swore allegiance to him, lest both of them be killed. Malik said: Ibn Shihab told me, from `Urwah bin az-Zubair, that the men whom they met were `Uwaim bin Sa`idah and Ma`n bin `Adiyy. Ibn Shihab said. Sa`eed bin al-Musayyab told me that the one who said, I am the post on which the camel with a skin disease scratches itself and I am like a high class palm tree, was al-lubab bin al-Mundhir.</b>",
        "bookID": "3.0",
        "grade1": "Sahih (Darussalam) [ al-Bukhari (2462) and Muslim (1691).",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 5303680,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5003920,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 392,
        "hadithText": "It was narrated from Yahya bin Sa`eed that he heard Anas bin Malik say: The Messenger of Allah (ﷺ)  said: “Shall I not tell you of the best tribe of the Ansar? Banun-Najjar, then Banu `Abdul Ashhal, then Banul-Harith bin al-Khazraj. then Banu Sa`idah.` and he said: `In each tribe of the Ansar there is goodness.”</b>",
        "bookID": "3.0",
        "grade1": "Sahih (Darussalam) [ al-Bukhari (5300) and Muslim (2511)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 5303690,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5003930,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 393,
        "hadithText": "It was narrated that Ibn `Umar (رضي الله عنه) said: The Messenger of Allah   (ﷺ) said: “The two parties to a transaction have the option (of cancelling it) so long as they have not parted or there is a condition which gives the option to cancel.`</b>",
        "bookID": "3.0",
        "grade1": "Sahih (Darussalam) [, al-Bukhari (2107) and Muslim (1531), ",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 5303700,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5003940,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 394,
        "hadithText": "It was narrated from Ibn `Umar that  the Messenger of Allah (ﷺ) forbade selling the offspring of the offspring that is still in the womb of a camel.</b>",
        "bookID": "3.0",
        "grade1": "Sahih (Darussalam) [, al-Bukhari (2143) and Muslim (1514)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 5303710,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5003950,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 395,
        "hadithText": "It was narrated that Ibn `Umar (رضي الله عنه) said:  We used to buy and sell foodstuff at the time of the Messenger of Allah (ﷺ), and he would send someone to tell us to transfer the food from the place we have bought it to another place before selling it.</b>",
        "bookID": "3.0",
        "grade1": "Sahih (Darussalam) [ al-Bukhari (2123) and Muslim (1527)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 5303720,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5003960,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 396,
        "hadithText": "It was narrated that Ibn `Umar (رضي الله عنه) said: The Messenger of Allah        (ﷺ)said: “Whoever buys foodstuff should not sell it until he takes possession of all of it.”</b>",
        "bookID": "3.0",
        "grade1": "Sahih (Darussalam) [ al-Bukhari (2126) and Muslim (1525)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 5303730,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5003970,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 397,
        "hadithText": "It was narrated from Ibn `Umar (رضي الله عنه) that the Messenger of Allah         (ﷺ) said: “If a person frees his share of a slave, and has enough Money to pay the full price of the slave, a fair price should be worked out for the slave, and his partners should be given their shares, then he may free the slave, otherwise he has freed only what he has freed.”</b>",
        "bookID": "3.0",
        "grade1": "Sahih (Darussalam) [, al-Bukhari (2522) and Muslim (1501)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 5303740,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5003980,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 398,
        "hadithText": "It was narrated that Sa`eed said: I said to IbnʼUmar (رضي الله عنه): What about a man who engaged in li`an with his wife? He said: The Messenger of Allah (ﷺ)  would separate them - and he mentioned the hadeeth.</b>",
        "bookID": "3.0",
        "grade1": "Sahih (Darussalam) [ al-Bukhari (5312) and Muslim (1493)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 5303750,
        "last_updated": "2020-06-07 23:43:08"
    }
]