[
    {
        "englishURN": 5003990,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 399,
        "hadithText": "It was narrated that Yazeed said: Ibn ‘Abbas (رضي الله عنه) said to us.  I said to ‘Uthman bin `Affan: What made you take al-Anfal, which is one of al-Mathani (the seven long soorahs), and Bara`ah, which is one of al-Mi`een (soorahs with one hundred verses or thereabouts), and put them next to one another and not write - Ibn Ja`far said: A line between them saying Bismillahir-Rahmanir-Raheem - and you put them with the seven long ones? What made you do that? `Uthman (رضي الله عنه)said: Sometimes many soorahs would be revealed (incomplete) to the Messenger of Allah (ﷺ) , and when something was revealed he would call one of the scribes to write it down for him and say: “Put this in the Soorah in which such and such is mentioned`; and verses would be revealed to him and he would say, `Put these verses in the soorah in which such and such is mentioned”; and a verse would be revealed to him and he would say: `Put this verse in the soorah in which such and such is mentioned.” Al-Anfal was one of the first soorahs to be revealed in Madinah and Bara`ah was one of the last soorahs of the Qur`an, and the stories and content of the two soorahs were similar. \nThen the Messenger of Allah (ﷺ)  passed away without having stated clearly to us that it was part of it, but we thought that it was, hence I put them together and I did not put between them the line Bismillahir-Rahmanir-Raheem. Ibn Ja`far said: I put it with the seven long ones.</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam) [ and its content is munkar]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 5303760,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004000,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 400,
        "hadithText": "It was narrated from Hisham bin `Urwah: My father told me that Humran told him: `Uthman (رضي الله عنه) did wudoo’ in al-Balat (a paved area in Madinah) then he said, i shall tell you a hadeeth that I heard from the Messenger of Allah (ﷺ) . Were it not for a verse in the Book of Allah, I would not have told you it. I heard the Prophet (ﷺ) say: `Whoever does wudoo’ and does it well, then goes in and prays, his sins between that prayer and the next will be forgiven, until he prays [the second prayer].”</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [, al-Bukhari (160) and Muslim (227)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 5303770,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004010,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 401,
        "hadithText": "It was narrated from Aban bin `Uthman (رضي الله عنه) from his father that the Prophet  (ﷺ)  said: `The pilgrim in ihram should not get married, arrange a marriage or propose marriage.`</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ Muslim (1409)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 5303780,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004020,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 402,
        "hadithText": "It was narrated that Ibn Harmalah said: I heard Sa`eed [i.e., Ibn al-Musayyabi] say: `Uthman (رضي الله عنه) went out for Hajj, then when he was partway there, it was said to `Ali {رضي الله عنه): He (`Uthman] has forbidden tamattu` [doing `Umrah then exiting ihram until Hajj]. `Ali (رضي الله عنه) said to his companions. When he sets out, set out too. And ‘Ali and his companions entered ihram with the intention of doing `umrah and `Uthman (رضي الله عنه) did not say anything to him about that ‘Ali (رضي الله عنه) said to him: Have I not been told that you forbade tamattu` by doing `umrah first? He said. Of course. ‘Ali said: Did you not hear that the Messenger of Allah (ﷺ) did tamattu’?`Uthman said: Of course,</b>",
        "bookID": "4.0",
        "grade1": "Sahih hadeeth, al-Bukhari (1569) and Muslim (1223)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 5303790,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004030,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 403,
        "hadithText": "It was narrated from `Uthman that the Messenger of Allah (ﷺ) did wudoo’ washing each part of the body three times.</b>",
        "bookID": "4.0",
        "grade1": "A hadeeth that is Sahih because of corroborating evidence]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 5303800,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004040,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 404,
        "hadithText": "It was narrated from Abu Anas  that `Uthman (رضي الله عنه) did wudoo` in al-Maqa`id, washing each part of the body three times. Some of the Companions of the Messenger of Allah (ﷺ) were with him. He said: Didn`t you see the Messenger of Allah (ﷺ)  do wudoo like this? They said: Yes</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ Muslim (2301)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 5303810,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004050,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 405,
        "hadithText": "It was narrated that `Uthman (رضي الله عنه) said: The Messenger of Allah       (ﷺ)  said: `The best of you is the one who learns Qur`an and teaches it.”</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ alBukhari (5028)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 5303820,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004060,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 406,
        "hadithText": "It was narrated that `Uthman (رضي الله عنه) said: The Messenger of Allah      (ﷺ) said: `Whoever does wudoo’ as Allah, may he be glorified and exalted, has commanded him, the prescribed prayers will be an expiation for [whatever sins he commits] between them.”</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ Muslim (231)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 5303830,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004070,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 407,
        "hadithText": "Abu Sahlah narrated that `Uthman (رضي الله عنه) said, on the Day of the House when he was besieged. The Messenger of Allah (ﷺ) gave me advice and I promised to comply with it, so I shall bear it with patience. Qais said: People thought that it was that day (when he was killed).</b>",
        "bookID": "4.0",
        "grade1": "Hasan (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 5303840,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004080,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 408,
        "hadithText": "It was narrated from `Uthman bin `Affan (رضي الله عنه) . `Abdur-Razzaq said: from the Prophet (ﷺ)  - that he said: `Whoever prays `Isha` and Fajr prayer in congregation, it is as if he spent the night in prayer (qiyamul-lail).” ‘Abdur-Rahman said: Whoever prays `Isha` in congregation, it is as if he spent half the night in prayer, and whoever prays Fajr in congregation, it is as if he spent the entire night in prayer,</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ Muslim (656)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 5303850,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004090,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 409,
        "hadithText": "It was narrated from ‘Uthman bin `Affan (رضي الله عنه) that the Prophet        (ﷺ) said: “whoever prays ‘Isha in congregation is like one who spent half the night in prayer, and whoever prays Fajr in congregation is like one who spent the entire night in prayer.”</b>",
        "bookID": "4.0",
        "grade1": "A Sahih hadith]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 5303860,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004100,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 410,
        "hadithText": "‘Ata` bin Farrookh, the freed slave of the Qurashis, narrated that `Uthman (رضي الله عنه) bought some land from a man and the man did not seek payment for it. Then he met him and he said to him: What prevented you from coming and taking your money? He said: You were unfair to me; I never met anyone but he blamed me. `Uthman said: Is this the reason? He said: Yes.  ‘Uthman said: Then choose between your land or your money. Then `Uthman said: The Messenger of Allah (ﷺ)  said: “Allah, may He be glorified and exalted, admitted to Paradise a man who was easygoing in buying and selling, when paying off debt and when asking for a debt that was owed to him.”</b>",
        "bookID": "4.0",
        "grade1": "A hadeeth that is Hasan because of corroborating evidence].",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 5303870,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004110,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 411,
        "hadithText": "It was narrated that ‘Alqamah said: I was with Ibn Mas`ood when he was with ‘Uthman {رضي الله عنه}. `Uthman (رضي الله عنه) said to him: Do you still feel any desire towards women? When women were mentioned, Ibn Mas`ood said: Come closer, ‘Alqamah. I was a young man (at that time). `Uthman   (رضي الله عنه) said to him: The Messenger of Allah (ﷺ)  came out to some young men of the Muhajireen and said: “Whoever among you has the means to get married, let him do so, for it is more effective in lowering the gaze and guarding chastity, whoever cannot (do that), then fasting is a shield for him.`</b>",
        "bookID": "4.0",
        "grade1": "Sahih hadeeth]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 5303880,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004140,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 414,
        "hadithText": "It was narrated that `Amr bin Deenar said: I heard a man narrate from `Uthman bin `Affan (رضي الله عنه) from the Prophet (ﷺ)  who said: `A man was easy-going when buying and selling, and when paying his dues and asking for what he was owe then he will enter Paradise.”</b>",
        "bookID": "4.0",
        "grade1": "Hasan because of corroborating evidence; this isnad is da'eef]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 5303900,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004150,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 415,
        "hadithText": "It was narrated from Aban from `Uthman (رضي الله عنه) that he called for water and did wudoo`: he rinsed his mouth and nose, then he washed his face three times, his arms three times each, and wiped his head and the tops of his feet, then he smiled and said to his companions: Aren`t you going to ask me what made me smile? They said: What made you smile, O Ameer al-Mu`mineen? He said: I saw the Messenger of Allah (ﷺ)  call for water near this spot, then he did wudoo’ as I have done it, then he smiled and said: `Aren`t you going to ask me what made me smile?` They said: What made you smile, O Messenger of Allah (ﷺ)? He said: “If a person calls for (water for) wudoo’, then he washes his face, Allah will remove from him every sin that he committed with his face; when he washes his arms, the same applies; when he wipes his head, the same applies; when he purifies his feet, the same applies.”</b>",
        "bookID": "4.0",
        "grade1": "Sahih because of corroborating evidence]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 5303910,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004200,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 420,
        "hadithText": "It was narrated that Abu Salamah bin `Abdul-Rahman said: `Uthman (رضي الله عنه) looked out from the house when he was under siege and said: I adjure by Allah anyone who was present with the Messenger of Allah (ﷺ) , on the day of Hira`, when the mountain shook beneath his feet; he kicked it with his foot and said: “Be still, Hira`, there is no one on you but a Prophet, a Siddiq or a martyr,` and i was with him. And some men testified to what he said. Then he said: I adjure by Allah anyone who was present with the Messenger of Allah (ﷺ) on the day of Bai’atul-Ridwan, when he had sent me to the mushrikeen, the people of Makkah; he said, `This is my hand and this is the hand of `Uthman,` and he swore allegiance on my behalf. And some men testified to what he said. Then he said:l adjure by Allah anyone who was present when the Messenger of Allah (ﷺ) said: `Who will expand the mosque by incorporating this house into it, in return for a house in Paradise?” and I bought it with my wealth and expanded the mosque by incorporating it into it. And some men testified to what he said. Then he said: I adjure by Allah anyone who saw the Messenger of Allah (ﷺ) on the day of the army of hardship (i.e., Tabook), when he said: `Who will spend today a spending that will be accepted by Allah?` and I equipped half of the army with my wealth. And some men testified to what he said, Then he said:I adjure by Allah anyone who saw the water of Roomah (a well) being sold to wayfarers, then I bought it with my own wealth and gave it to wayfarers for free.` And some men testified to what he said.</b>",
        "bookID": "4.0",
        "grade1": "Sahih hadeeth]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 5303940,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004210,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 421,
        "hadithText": "It was narrated that  Humran bin Aban said: I saw `Uthman bin `Affan (رضي الله عنه) do wudoo`, He poured water onto his hands three times and washed them, then he rinsed his mouth and nose, then he washed his face three times, then he washed his right arm up to the elbow three times, then the left arm likewise, then he wiped his head, then he washed his right foot three times, then the left foot likewise. He said: I saw the Messenger of Allah (ﷺ)  do wudoo` similar to what I just did, then he said: “Whoever does wudoo` as I just did, then prays two rak’ahs without letting his mind wander, his previous sins will be forgiven”</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [, alBukhari (159) and Muslim (226)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 5303950,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004220,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 422,
        "hadithText": "It was narrated that Nubaih bin Wahb said:  `Umar bin `Ubaidullah sent word to Aban bin `Uthman (رضي الله عنه), (to ask) whether he could apply something to his eyes when he was in ihram - or (to ask) what he could apply to his eyes when he was in ihram. He sent word back to him telling him that he could apply aloes to them, and I heard `Uthman bin Affan(رضي الله عنه) narrating that from the Messenger of Allah (ﷺ) .</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ Muslim (1204)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 5303960,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004230,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 423,
        "hadithText": "It was narrated from `Uthman bin `Affan that the Prophet (ﷺ) said: “Whoever knows that prayer is an obligatory duty will enter Paradise.`</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam) [, because Abdul-Malik bin Ubaid is unknown)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 5303970,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004240,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 424,
        "hadithText": "It was narrated that Sa`eed bin al-Musayyab said,  `Uthman went for Hajj, and when he was halfway there, `Ali was informed that `Uthman had told his companions not to do tamattu`, `Ali said to his companions: When he sets out, set out too. `Ali and his companions entered ihram for ‘Umrah, and `Uthman did not say anything to them. `Ali said: Have I not been told that you have forbidden tamattu.” Didn`t the Messenger of Allah (ﷺ) do tamattu`? He (the narrator) said: I do not know what answer `Uthman (رضي الله عنه) gave.</b>",
        "bookID": "4.0",
        "grade1": "A hadeeth Sahih,Muslim (1223)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 5303980,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004250,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 425,
        "hadithText": "It was narrated that Malik bin Aws bin al-Hadathan said: `Umar bin al-Khattab (رضي الله عنه) sent for me, and whilst I was like that, his freed slave Yarfa` came and said: ‘Uthman, `Abdur-Rahman, Sa’d and az-Zubair bin al-`Awwam are here - (the narrator) said: I do not know whether he mentioned Talhah or not - and they are asking for permission to enter upon you. He said: Let them in. Then after a while, (Yarfa`) came and said: al-`Abbas and ‘Ali are asking permission to enter upon you. He said: Let them in. When al`Abbas came in, he said: O Ameer al-Mu`mineen, judge between me and this one. They had a dispute at that time concerning the fai’ (booty) that Allah had granted to His Messenger of the wealth of Banun-Nadeer, The people said: Judge between them, O Ameer al-Mu`mineen, and relieve each one of his opponent, for their dispute has gone on too long. ‘Umar (رضي الله عنه) said: I adjure you by Allah, by Whose Leave heaven and earth exist, do you know that the Messenger of Allah (ﷺ)  said, “We are not to be inherited from; what we leave behind is charity`? They said: He did say that. He said: I shall tell you about that fai`; Allah, may He be glorified and exalted, gave something exclusively to His Prophet (ﷺ) that He did not give to anyone else. And he quoted the verse: `And what Allah gave as booty (Fai’) to His Messenger\n(Muhammad (ﷺ)) from them - for this you made no expedition with either cavalry or camelry` [al Hashr 59:6]. He said: `This was exclusively for the Messenger of Allah (ﷺ) and by Allah, he did not keep it to himself in exclusion of you and he did not prefer himself over you with regard to it. Rather he gave it to you and divided it among you until there was nothing left of it except this property. He spent on his family`s needs from this property for one year, then he took what was left and regarded it as the property of Allah. When the Messenger of Allah (ﷺ) passed away, Abu Bakr said: `I am the successor of the Messenger of Allah (ﷺ), I shall deal with it as the Messenger of Allah (ﷺ)  dealt with it.</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ al-Bukhari (2904) and Muslim (1757)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 5303990,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004260,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 426,
        "hadithText": "It was narrated from `Uthman that he saw a funeral and stood up for it and said: I saw the Messenger of Allah (ﷺ)  see a funeral and stand up for it.</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam), because of corroborating evidence and its isnad is da'eef, because Yahya bin Sulaim is unknown]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 5304000,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004290,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 429,
        "hadithText": "It was narrated from one of the Ansar, from his father, that `Uthman (رضي الله عنه) said: Shall l not show you how the Messenger of Allah (ﷺ)  did wudoo? They said: Yes. So he called for water, and he rinsed his mouth three times and his nose three times, and he washed his face and arms three times, and he wiped his head and washed his feet three times. Then he said: You should know that the ears are part of the head. Then he said: I have tried to do wudoo’ for you as the Messenger of Allah (ﷺ) did it.</b>",
        "bookID": "4.0",
        "grade1": "Sahih hadeeth. This isnad is da'eef (weak)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 5304020,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004300,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 430,
        "hadithText": "It was narrated that Humran bin Aban said:  We were with `Uthman bin `Affan (رضي الله عنه), he called for water and did wudoo’. When he had finished his wudoo`, he smiled and said: Do you know why I smiled?  He said: The Messenger of Allah (ﷺ) did wudoo` as I just did wudoo`, then he smiled and said: “Do you know why I smiled?` we said: Allah and His Messenger know best. He said: “If a person does wudoo and completes his wudoo’, then he starts to pray and completes his prayer, he will come out of his prayer free of sin as he came out of his mother`s womb.”</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) []",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 5304030,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004310,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 431,
        "hadithText": "It was narrated that Qatadah said: I heard `Abdullah bin Shaqeeq say: `Uthman (رضي الله عنه) forbade tamattu` and `Ali enjoined it. `Uthman (رضي الله عنه) said something and ‘Ali (رضي الله عنه) said to him, You know that the Messenger of Allah (ﷺ) did that. `Uthman (رضي الله عنه) said: Yes, but we were in a state of fear [at that time]. Shu`bah said: I said to Qatadah: What were they afraid of? He said: I do not know,</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ Muslim (1223)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 5304040,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004320,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 432,
        "hadithText": "It was narrated that Qatadah said.  `Abdullah bin Shaqeeq said: `Uthman used to forbid mut’ah (of Hajj, i.e., tamattu`) and ‘Ali used to enjoin it. `Uthman said something to `Ali, then `Ali said: You know that we did tamattu` with the Messenger of Allah (ﷺ) . He said: Yes, but we were in a state of fear then.</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) []",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 5304050,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004330,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 433,
        "hadithText": "It was narrated that ‘Abdullah bin az-Zubair said:  `Uthman bin `Affan (رضي الله عنه) said, speaking from his minbar I am going to tell you a hadeeth that I heard from the Messenger of Allah (ﷺ) , nothing kept me from telling it to you except the fact that I care for you, I heard the Messenger of Allah (ﷺ) say: `Standing guard for one night for the sake of Allah, may He be exalted, is better than a thousand nights spent in prayer and [a thousand] days spent fasting.”</b>",
        "bookID": "4.0",
        "grade1": "Hasan, and its isnad is da'eef because of the weakness of Mus'ab bin Thabit]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 5304060,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004340,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 434,
        "hadithText": "It was narrated that `Uthman bin `Affan (رضي الله عنه) said: I heard the Messenger of Allah (ﷺ)  say: `Whoever builds a mosque for the sake of Allah, may He be glorified and exalted. Allah will build something like it for him in Paradise.”</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam), al-Bukhari (450) and Muslim (533)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 5304070,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004350,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 435,
        "hadithText": "It was narrated that Abu ‘Ubaid, the freed slave of ‘AbdurRahman bin Azhar, said: I saw `Ali (رضي الله عنه) and ‘Uthman (رضي الله عنه) praying on the day of al-Fitr and the day of al-Adha, then they reminded the people. And I heard them say: The Messenger of Allah (ﷺ)  forbade fasting on these two days. And I heard ‘Ali (رضي الله عنه) say: The Messenger of Allah (ﷺ) forbade anything of the sacrificial meat to be left after three days.</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) []",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 5304080,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004360,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 436,
        "hadithText": "It was narrated that Muhammad bin ‘Abdullah bin Abi Maryam said: I entered upon Ibn Darah, the freed slave of `Uthman, and he heard me rinsing my mouth. He said: O Muhammad! I said: Here I am. He said:Shall I not tell you about the wudoo’ of the Messenger of Allah (ﷺ)? I saw `Uthman when he was in al-Maqa`id. He called for water for wudoo’, then he rinsed his mouth three times, rinsed his nose three times, washed his face three times, washed his arms three times, wiped his head three times and washed his feet, then he said: Whoever would like to see how the Messenger of Allah (ﷺ) did wudoo’, this is how the Messenger of Allah (ﷺ) did wudoo`.</b>",
        "bookID": "4.0",
        "grade1": "Hasan (Darussalam) []",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 5304100,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004390,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 439,
        "hadithText": "It was narrated that Salim bin Abul-Ja`d said, `Uthman (رضي الله عنه) called some of the Companions of the Messenger of Allah (ﷺ), among whom was ‘Ammar bin Yasir, and said: I am going to ask you something and I would like you to be honest with me. I adjure you by Allah, do you know that the Messenger of Allah (ﷺ) used to give Quraish precedence over all people and he gave precedence to Banu Hashim over all of Quraish? The people fell silent, then `Uthman said: If I had the keys of Paradise in my hand, I would have given them to Banu Umayyah [his own clan] so that they could all, down to the last man, enter it. Then he sent for Talhah and az-Zubair. And ‘Uthman (رضي الله عنه) said: Should I tell you about him - i.e. Ammar? I was walking with the Messenger of Allah (ﷺ) , who was holding my hand, and we were walking in al-Batha`, until he came to where his [`Ammar`s] father and mother were being tortured. ‘Ammar`s father said: O Messenger of Allah (ﷺ), are we going to be like this forever? The Prophet (ﷺ) said to him: `Be patient.” Then he said: “O Allah, forgive the family of Yasir, and You have already done so.”</b>",
        "bookID": "4.0",
        "grade1": "Da'if, because it is interrupted]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 5304120,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004400,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 440,
        "hadithText": "It was narrated from ‘Uthman bin `Affan (رضي الله عنه) that the Messenger of Allah (ﷺ) to said: `Everything apart from the shade of a house, a sack of bread, a garment to cover his `awrah and water, anything more than that the son of Adam has no right to.”</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam) []",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 5304130,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004410,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 441,
        "hadithText": "It was narrated that an old man of Thaqeef - Humaid said that he was righteous - said that his paternal uncle told him that he saw `Uthman (رضي الله عنه) sitting at the second door of the mosque of the Messenger of Allah (ﷺ) . He called for a shoulder [of an animal] and ate its meat, then he got up and prayed, without doing wudoo’. Then he said: I sat where the Prophet (ﷺ) sat and I ate what the Prophet (ﷺ) ate, and I did what the Prophet (ﷺ) did.</b>",
        "bookID": "4.0",
        "grade1": "Sahih because of corroborating evidence] ",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 5304140,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004420,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 442,
        "hadithText": "it was narrated that Abu Salih, the freed slave of `Uthman, said: I heard `Uthman in Mina saying:  O people, I shall tell you a hadeeth that I heard from the Messenger of Allah (ﷺ) . He said: `Standing guard on the border for one day for the sake of Allah is better than one thousand ordinary days, so let a man stand on guard at the border as much as he wants.” [`Uthman] said; Have I conveyed [the message]? They said: Yes. He said: O Allah, bear witness.</b>",
        "bookID": "4.0",
        "grade1": "A Hasan hadeeth",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 5304150,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004430,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 443,
        "hadithText": "`Abdullah bin ‘AbdurRahman bin Abi Dhubab narrated from his father that ‘Uthman bin ‘Affan (رضي الله عنه) prayed four rak`ahs in Mina and the people objected to that. He said:O people, I have taken a wife in Makkah since I came here, and I heard the Messenger of Allah (ﷺ)say: “Whoever takes a wife in a city should offer the prayer of one who is a resident (i.e., in full).</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam) [ because ‘Ikrimah bin Ibraheem is unknown]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 5304160,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004460,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 446,
        "hadithText": "It was narrated from Aban bin `Uthman that his father said: The Messenger of Allah (ﷺ) said: `Whoever says in the Name of Allah, with whose name nothing on earth or in heaven can cause harm, and He is the All-Hearing, All-Knowing, nothing will harm him.`</b>",
        "bookID": "4.0",
        "grade1": "Hasan (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 5304180,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004470,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 447,
        "hadithText": "It was narrated from Hurman bin Aban that `Uthman bin `Affan (رضي الله عنه) said: I heard the Messenger of Allah (ﷺ)  say: `I know a word which no one says, sincerely from the heart, but he will be forbidden to the Fire.” `Umar bin al-Khattab (رضي الله عنه) said to him: I will tell you what it is: it is the word of al-ikhlas by means of which Allah, may He be blessed and exalted, caused Muhammad (ﷺ) and his companions to prevail and it is the word of taqwa that the Prophet (ﷺ) of Allah  urged his uncle Abu Talib to say when he was dying, the testimony that there is no god but Allah.</b>",
        "bookID": "4.0",
        "grade1": "Qawi (Darussalam)y]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 5304190,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004480,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 448,
        "hadithText": "Abu Salamah narrated that ‘Ata` bin Yasar told him that Zaid bin Khalid al-Juhani told him that he asked ‘Uthman bin `Affan (رضي الله عنه): What do you think if a man has intercourse with his wife but does not ejaculate? `Uthman(رضي الله عنه) Said. He should do wudoo` as for prayer and wash his private part. And `Uthman (رضي الله عنه) said: I heard it from the Messenger of Allah (ﷺ); I asked ‘Ali bin Abi Talib, az-Zubair bin al-` Awwam, Talhah bin `Ubaidullah and Ubayy bin Ka`b about that, and they told him to do the same.</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ alBukhari (179) and Muslim (347)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 5304200,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004490,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 449,
        "hadithText": "`Ubaid bin Abi Qurrah said: I heard Malik bin Anas say: `We raise whom We will in degrees` |al-An’am 6.83). He said: [i.e.] by means of knowledge. I said: Who told you that? He said. Zaid bin Aslam said that.</b>",
        "bookID": "4.0",
        "grade1": "The isnad of this report going back to Zaid bin Aslam is Sahih)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 5304210,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004520,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 452,
        "hadithText": "It was narrated from Nafi` from Ibn `Umar, that Uthman (رضي الله عنه) looked out at his companions when he was under siege and said: Why do you want to kill me? I heard the Messenger of Allah (ﷺ) say: `It is not permissible to shed the blood of a Muslim man except in one of three cases; a man who commits zina after being married, so he is to be stoned, or a man who killed deliberately (committed murder), so he is to be killed in retaliation, or a man who apostatised after having become Muslim, so he is to be executed.” By Allah, I never committed zina either during the Jahiliyyah or in Islam, I never killed anyone such that my life should be taken in retaliation; and I never apostatised since [became Muslim bear witness that there is no god but Allah and that Muhammad is His slave and His Messenger,</b>",
        "bookID": "4.0",
        "grade1": "Hasan)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 5304230,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004530,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 453,
        "hadithText": "It was narrated from Abu Dharr that he came and asked permission to enter upon `Uthman bin ‘Affan (رضي الله عنه) He gave him permission and he had a stick in his hand ‘Uthman (رضي الله عنه) said. O Ka`b, `Abdur-Rahman has died and left behind wealth. What do you think of him? He said: If he paid the dues of Allah, then that is fine. Abu Dharr raised his stick and struck Ka`b, and said: I heard the Messenger of Allah (ﷺ) say: `I would not like to have this mountain in gold and spend it (for the sake of Allah) and Allah accept it from me, and leave behind six Ooqiyyah of it.” I adjure you by Allah, O `Uthman, did you hear him? - [He said it] three times, He said: Yes.</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam)because Ibn Lahee'ah is da'eef and Malik bin Abdullah is unknown]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 5304240,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004540,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 454,
        "hadithText": "It was narrated that Hani`, the freed slave of `Uthman, (رضي الله عنه) said: `Uthman (رضي الله عنه) used to stand by a grave and weep until his beard became wet. It was said to him: You remember Paradise and Hell and you do not weep, but you weep for this? He said: The Messenger of Allah (ﷺ) said: `The grave is the first stage of the hereafter. If one is saved from it (i.e., its torments), then what comes after it is easier than it. But if one is not saved from it {i.e. its torments), then what comes after it is worse.` And the Messenger of Allah (ﷺ)  said: By Allah, I have never seen any frightening scene but the grave is more frightening than it.`</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) []",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 5304250,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004570,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 457,
        "hadithText": "It was narrated that Moosa bin ‘Imran bin Mannah said: Aban bin `Uthman (رضي الله عنه) saw a funeral and stood up for it. He said: `Uthman bin `Affan (رضي الله عنه) saw a funeral and stood up for it, then he narrated that the Messenger of Allah (ﷺ)  saw a funeral and stood up for it.</b>",
        "bookID": "4.0",
        "grade1": "Hasan because of corroborating evidence and its isnad is da'eef]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 5304270,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004580,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 458,
        "hadithText": "lt was narrated from Zaid bin Khalid al-Juhani that he asked `Uthman bin `Affan (رضي الله عنه): what do you think if a man has intercourse with his wife but does not ejaculate? `Uthman (رضي الله عنه) said: Let him do wudoo’ as for prayer, and wash his private part. And `Uthman (رضي الله عنه) said: I heard it from the Messenger of Allah (ﷺ) I asked ‘Ali bin Abi Talib (رضي الله عنه), az-Zubair, Talhah and Ubayy bin Ka`b about that and they told him to do the same thing.</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ al-Bukhari (179) and Muslim (347).",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 5304280,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004590,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 459,
        "hadithText": "Mu`adh bin ‘Abdur-Rahman narrated that Humran bin Aban told him: I came to ‘Uthman bin `Affan (رضي الله عنه) when he was sitting in al-Maqa`id. He did wudoo and did it well, then he said: I saw the Messenger of Allah (ﷺ) when he was in this place; he did wudoo’ and did it well, then he said: “Whoever does wudoo’ as I have done, then goes to the mosque and prays two rakats, his previous sins will be forgiven.” And he said: The Messenger of Allah (ﷺ) said: `Do not become complacent.”</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ al-Bukhari (160) and Muslim (227).",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 5304290,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004600,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 460,
        "hadithText": "’Ubaidullah bin Muhammad bin Hafs bin `Umar at-Taimi said: I heard my father say: I heard my paternal uncle `Ubaidullah bin ʼUmar bin Moosa say; I was with Sulaiman bin `Ali (رضي الله عنه) and an old man of Quraish came in. Sulaiman said: Look at the old man, give him a good seat, for Quraish have a right. I said: O Ameer, shall I not tell you a hadeeth that has reached me from the Messenger of Allah (ﷺ). He said: Yes, I said to him: I have heard that the Messenger of Allah  (ﷺ) said: `Whoever humiliates Quraish. Allah will humiliate him.” He said: Subhanallah, how good this is, Who told you this? I said: Rabee`ah bin Abi ‘Abdur. Rahman told me, from Sa’eed bin al-Musayyab, from ’Amr bin `Uthman bin `Affan (رضي الله عنه) who said. My father said to me: O my son, if you are put in a position of authority over the people, then honour Quraish, for I heard the Messenger of Allah (ﷺ) say: “Whoever humiliates Quraish, Allah will humiliate him.”  .</b>",
        "bookID": "4.0",
        "grade1": "Hasan because of corroborating evidence]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 5304300,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004610,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 461,
        "hadithText": "It was narrated from `Uthman bin `Affan (رضي الله عنه). `Abdullah bin az-Zubair said to him when he was besieged: I have camels that I have prepared for you; do you want to go to Makkah, then whoever wants to see you can come and see you? He said: No, I heard the Messenger of Allah (ﷺ) say: `A ram of Quraish whose name is ‘Abdullah will seek to commit profanity and wrongdoing in Makkah; he will have half of the burden of mankind`s sins.”</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam) [ arid its text is munkar (odd); it is virtually fabricated] ",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 5304310,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004620,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 462,
        "hadithText": "It was narrated from `uthman bin `Affan (رضي الله عنه]that the Messenger of Allah (ﷺ) said: `The pilgrim in ihram should not get married, arrange a marriage or propose marriage.”</b>",
        "bookID": "4.0",
        "grade1": "Sahih hadeeth, Muslim (1409)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 5304320,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004630,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 463,
        "hadithText": "It was narrated that `Abdullah bin az-Zubair said: `Uthman bin `Affan (رضي الله عنه) said, speaking from his minbar:  I am going to tell you a hadeeth that I heard from the Messenger of Allah (ﷺ) ; nothing kept me from telling it to you except the fact that I care for you. I heard the Messenger of Allah (ﷺ) say: “Standing guard for one night for the sake of Allah, may He be exalted, is better than a thousand nights spent in prayer and [a thousand] days spent fasting.`</b>",
        "bookID": "4.0",
        "grade1": "Hasan, and Da'if (Darussalam) because Mus'ab bin thabit is unknown)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 5304330,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004640,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 464,
        "hadithText": "It was narrated from `Uthman bn `Affan (رضي الله عنه) that the Prophet (ﷺ) said: “Whoever dies knowing that there is no god but Allah will enter Paradise.”</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [, Muslim (26)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 5304340,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004650,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 465,
        "hadithText": "Nubaih bin Wahb narrated that the eye of `Umar bin Ubaidullah became inflamed when he was in ihram, and he wanted to apply kohl to it, but Aban bin `Uthman (رضي الله عنه) forbade him to do that and told him to apply aloes to it. He said that `Uthman (رضي الله عنه) narrated from the Messenger of Allah (ﷺ) that he had done that.</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ Muslim (1204]]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 5304350,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004660,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 466,
        "hadithText": "It was narrated from Nubaih bin Wahb that `Umar bin Ubaidullah wanted to arrange a marriage for his son when he was in Ihram, but Aban forbade him to do that and said that `Uthman narrated that the Messenger of Allah (ﷺ) said: `The pilgrim in ihram should not get married, arrange a marriage or propose marrіage.”</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ Muslim (1409)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 5304360,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004670,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 467,
        "hadithText": "It was narrated that Rabah said: My masters married me to a Roman slave girl of theirs and she bore me a black boy. Then she fell in love with a Roman slave whose name was Yuhannas, and he spoke to her in their language. Then she got pregnant. She had borne me a child who was black like me, then she gave birth to a boy who looked like a lizard (i.e., was very fair). I said to her: What is this? She said: He is the child of Yuhannas. I asked Yuhannas and he admitted it, I went to ‘Uthman bin ‘Affan (رضي الله عنه) and told him about that. He sent for them and asked them, then he said: I will pass judgement between you according to the judgement of the Messenger of Allah (ﷺ); the child is to be attributed to the (husband of the) woman, and the fornicator gets nothing. He attributed the child to me and flogged them both. then later on she gave birth to a black chıld</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam) because Rabah is unknown]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 5304370,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004680,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 468,
        "hadithText": "It was narrated that Abu Umamah bin Sahl said: I was with ‘Uthman (رضي الله عنه) in the house when he was under siege. We would go into an entryway where, when we entered it, we could hear what the people were saying in al-Balat. `Uthman (رضي الله عنه) entered it one day for some reason, then he came out with his face flushed and said: They were threatening to kill me just now. We said: Allah will suffice you against them, O Ameer al-Mu`mineen. He said: Why would they kill me? I heard the Messenger of Allah (ﷺ) say: “It is not permissible to shed the blood of a Muslim man except in one of three cases; a man who disbelieved after having become Muslim, or a man who committed zina after being married, or a man who killed a person not in retaliation of murder But by Allah, I never committed zina either during the Jahiliyyah or in Islam... I never wanted to change my religion since Allah, may He be glorified and exalted guided me, and I never killed anyone So why do they want to kill me?</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 5304380,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004690,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 469,
        "hadithText": "It was narrated that ‘Amir bin Sa`d said: Husain bin Abi Waqqas said: l heard `Uthman bin `Affan (رضي الله عنه) say: What prevented me from narrating from the Messenger of Allah (ﷺ)  was not the fact that was not the most knowledgeable of his Companions about what he said, but I bear witness that I heard him say: “Whoever says something about me that I did not say, let him take his place in Hell.” And he said: Husain was the most aware of his companions of what he said.</b>",
        "bookID": "4.0",
        "grade1": "Hasan (Darussalam) []",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 5304390,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004700,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 470,
        "hadithText": "It was narrated that Abu Salih, the freed slave of ‘Uthman bin `Affan {رضي الله عنه) said: I heard `Uthman (رضي الله عنه) say on the minbar:  O people, I concealed from you a hadeeth that I heard from the Messenger of Allah (ﷺ) for fear that you would scatter away from me, then I thought that I should tell it to you, and let each one choose for himself what he thinks is best. I heard the Messenger of Allah (ﷺ) say: `Guarding the border for one day for the sake of Allah is better than a thousand other days doing other deeds.`</b>",
        "bookID": "4.0",
        "grade1": "lts isnad is Hasan]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 5304400,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004710,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 471,
        "hadithText": "It was narrated that `Uthman bin `Affan (رضي الله عنه) said: The Messenger of Allah (ﷺ)  said: `There is no Muslim who leaves his house, intending to travel or otherwise, and says when leaving: `In the Name of Allah, I believe in Allah, I seek the protection of Allah, I put my trust in Allah, there is no strength and no power except with Allah, but he will be granted the goodness of that going out, and the evil of that going out will be diverted from him.”</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam))",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 5304410,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004720,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 472,
        "hadithText": "It was narrated that `Uthman (رضي الله عنه) said: I saw the Messenger of Allah (ﷺ) as doing wudoo’. He washed his face three times and his hands three times, and he wiped his head and washed his feet.</b>",
        "bookID": "4.0",
        "grade1": "Sahih hadeeth; this isnad is da'eef]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 5304420,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004730,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 473,
        "hadithText": "Abu Sakhrah Jami’ bin Shaddad told me that he said: I heard Humran bin Aban tell Abu Burdah in the mosque of Basrah, when I was standing next to him, that he heard `Uthman bin `Affan (رضي الله عنه) narrating from the Prophet (ﷺ)  that he said: `Whoever does wudoo’ properly as enjoined by Allah, may He be glorified and exalted, the five prayers will be an expiation for whatever comes in between them.`</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ Muslim (231)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 5304430,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004740,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 474,
        "hadithText": "It was narrated that Aban bin `Uthman said: I heard `Uthman bin `Affan (رضي الله عنه) say: The Messenger of Allah (ﷺ)  said: `Whoever says at the beginning of the day or the beginning of the night, ‘In the Name of Allah with Whose name nothing on earth or in heaven can cause harm, and he is the All-Hearing. All-Knowing.` three times, nothing will harm him during that day or that night.”</b>",
        "bookID": "4.0",
        "grade1": "Hasan (Darussalam) []",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 5304440,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004750,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 475,
        "hadithText": "It was narrated from Yazeed bin Mawhab that `Uthman (رضي الله عنه) said to Ibn `Umar (رضي الله عنه). Judge between the people. He said:I will not judge between two people or lead two men in prayer. Did you not hear the Prophet (ﷺ) say, `Whoever seeks refuge with Allah has indeed sought refuge with a powerful one`?`Uthman (رضي الله عنه) said. Yes I did. He said: then I seek refuge with Allah lest you appoint me to some post. So Uthman (رضي الله عنه) let him off and said: Do not tell anyone else about this.</b>",
        "bookID": "4.0",
        "grade1": "Hasan because of corroborating evidence ,this sinad is da'eef because of the weakness of Abu Sinan]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 5304450,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004760,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 476,
        "hadithText": "It was narrated that `Uthman bin `Affan said: The Messenger of Allah (ﷺ) said: “Whoever does wudoo` and does wudoo’ well, his sins come out of his body, even from beneath his nails.”</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ Muslim (245)}",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 5304460,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004770,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 477,
        "hadithText": "It was narrated from Abu Salih, the freed slave of `Uthman (رضي الله عنه), that `Uthman (رضي الله عنه.) said: O people, move on in the middle of the day, for I am moving on in the middle of the day. So the people moved on in the middle of the day. Then he said: O people, I shall tell you a hadith of which I have not spoken since I heard it from the Messenger of Allah (ﷺ) until this day. The Messenger of Allah (ﷺ), said: `Guarding the border for one day for the sake of Allah is better than a thousand other days, so let a man guard the border as much as he wants.` Have I conveyed the message to you? They said: Yes. He said. O Allah, bear witness.</b>",
        "bookID": "4.0",
        "grade1": "A Hasan Hadeeth, but this isnad is Da'if.]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 5304470,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004780,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 478,
        "hadithText": "It was narrated that Humran said: Uthman was sitting in alMaqa`id. He called for water and did wudoo’, then he said: I saw the Messenger of Allah (ﷺ) doing wudoo` in this place where I am sitting then he said: “whoever does wudoo’ as I have done, then gets up and prays two rak`ahs, his previous sins will be forgiven.” And the Messenger of Allah (ﷺ) said: `Do not become complacent.`</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ al bukhari (160) and Muslim (227)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 5304480,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004790,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 479,
        "hadithText": "Abu ‘Awn al-Ansari narrated that `Uthman bin `Affan (رضي الله عنه) said to Ibn Mas`ood: Are you going to give up what I heard about you? He was apologetic, then `Uthman (رضي الله عنه) said: Woe to you! I heard and remembered and it is not as you heard; the Messenger of Allah (ﷺ) said: `A leader will be killed and a criminal will commit a crime.` I am the one who will be killed, not ‘Umar رضي الله عنه); rather ‘Umar (رضي الله عنه) was killed by one man, but a group of people will kill me</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam) []",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 5304490,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004800,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 480,
        "hadithText": "`Uthman bin `Affan (رضي الله عنه) said to his nephew: Did you meet the Messenger of Allah (ﷺ)? He said: No, but there reached me of his knowledge and certainty of faith that which would reach a virgin in her seclusion .He [`Uthman] recited the tashahhud then he said: Verily Allah, may He be glorified and exalted, sent Muhammad  with the truth and I was one of those who responded to (the call of) Allah and His Messenger, and I believed in that with which Muhammad (ﷺ) was sent. Then I migrated twice, and I also attained the honour of becoming the son-in law of the Messenger of Allah (ﷺ), I swore allegiance to the Messenger of Allah (ﷺ), and by Allah, I never disobeyed him or betrayed him until Allah, may He be glorified and exalted, took his soul in death.</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ al-Bukhari (3696)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 5304500,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004830,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 483,
        "hadithText": "It was narrated from Mu`adh bin ‘Abdur-Rahman at Taimi, from Humran the freed slave of `Uthman (رضي الله عنه), from `Uthman (رضي الله عنه), that he said:  I heard the Messenger of Allah (ﷺ) say: “Whoever does wudoo` and does it properly, then goes and offers an obligatory prayer, his sins will be forgiven.`</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ al-Bukhari (160) and Muslim (227)] ] :",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 5304520,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004840,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 484,
        "hadithText": "It was narrated that Humran said. `Uthman (رضي الله عنه) did ghusl every day since he became Muslim. I  brought water for him one day to do wudoo’ for prayer. After he did wudoo’, he said: I wanted to tell you a hadeeth that I heard from the  Messenger of Allah (ﷺ). Then I  decided not to tell it to you, al-Hakam bin al-`As said: O Ameer  al-Mu`mineen, if it is enjoining us  to do good we will do it and if it is warning us of a bad thing we will avoid it. He said: I will tell it to you  the Messenger of Allah (ﷺ)  did  wudoo in this manner, then he said: `Whoever does wudoo’ in this manner and does it well, then goes and prays, bowing and prostrating properly, it (the prayer) will  expiate his sins between that - prayer and the next, unless he does  or something serious` i.e., major sin.</b>",
        "bookID": "4.0",
        "grade1": "Sahih hadeeth, Muslim (228) and this isnad is Hasan) ",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 5304530,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004850,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 485,
        "hadithText": "It was narrated that `Uthman bin `Affan (رضي الله عنه) said: I heard the Messenger of Allah (ﷺ) say:  “Allah admitted to Paradise a man who was easy-going in buying and selling, when paying off debt and when asking for a debt that was owed to him.”</b>",
        "bookID": "4.0",
        "grade1": "A Hasan hadeeth]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 5304540,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004860,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 486,
        "hadithText": "It was narrated from ‘lkrimah bin Khalid: a man from Madinah told me that the mu`adhdhin gave the call to `Asr prayer and ‘Uthman (رضي الله عنه) called for water and purified himself, then he said: I heard the Messenger of Allah (ﷺ) say: \n`Whoever purifies himself as he has been enjoined and prays as he has been enjoined, his sins will be expiated.” Then he called four of the Companions of the Messenger of Allah (ﷺ)  to testify to that, and they testified that the Prophet (ﷺ)  had said that.</b>",
        "bookID": "4.0",
        "grade1": "Hasan because of corroborating evidence, this isnad is da‘eef]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 5304550,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004870,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 487,
        "hadithText": "It was narrated that Busr bin Sa`eed said: `Uthman (رضي الله عنه) came to al-Maqa`id and called for water for wudoo`. He rinsed his mouth and nose, then he washed his face three times, then he washed his hands three times each, then he wiped his head and (washed) his feet three times each. Then he said: I saw the Messenger of Allah (ﷺ) doing wudoo` like this, O people, isn`t that true? They said: Yes - i.e., a group of the Companions of the Messenger of Allah (ﷺ)  who were with him.</b>",
        "bookID": "4.0",
        "grade1": "Sahih hadeeth, its isnad is Hasan, Muslim (230)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 5304560,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004880,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 488,
        "hadithText": "It was narrated from `Uthman bin `Affan (رضي الله عنه )  that he called for water and did wudoo` in al-Maqa`id. He did wudoo’, washing each part three times, then he said to the Companions of the Messenger of Allah (ﷺ). Did you see the Messenger of Allah (ﷺ) doing {wudoo`) like this? They said: Yes.</b>",
        "bookID": "4.0",
        "grade1": "Sahih, hadeeth and its isnad is qawi]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 5304570,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004890,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 489,
        "hadithText": "It was narrated that | Humran bin Aban, the freed slave of `Uthman bin `Affan (رضي الله عنه), said: I saw `Uthman bin `Affan رضي الله عنه call for water at the door of the mosque. He washed his hands, then he rinsed his mouth, and took water into his nose and blew it out; then he washed his face three times, then he washed his hands up to the elbows three times, then he wiped his head. Then he passed his hands over the outside of his ears, then passed them over his beard, then he washed his feet up to the ankles three times. Then he stood and prayed two rak`ahs, Then he said: I have done wudoo’ for you as I saw the Messenger of Allah (ﷺ)  do wudoo’, then I prayed two rak`ahs as I saw him do. When the Messenger of Allah (ﷺ)  had finished praying his two rak`ahs, he said: \n`Whoever does wudoo’ as I have done, then prays two rak`ahs in which he does not let his mind wander, will be forgiven whatever sins came between that and his previous prayer.`</b>",
        "bookID": "4.0",
        "grade1": "Sahih hadeeth and its isnad is Hasan]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 5304580,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004900,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 490,
        "hadithText": "It was narrated that Shaqeeq said: `Abdur-Rahman bin ‘Awf met al-Waleed bin `Uqbah. Al-Waleed said to him: Why do i see you keeping away from Ameer al-Mu`mineen `Uthman (-رضي الله عنه-)? `AbdurRahman said to him:Tell him that I did not flee on the day of ‘Ainain -’Asim said: The day of Uhud - and I did not stay behind on the day of Badr, and I did not turn away from the way of ‘Umar (رضي الله عنه). So he went and told that to ‘Uthman (رضي الله عنه), who said: \nAs for his saying that he did not flee on the day of  ‘Ainain, how could he shame me for a fault for which Allah has pardoned me and said: `Those of you who turned back on the day the two hosts met (i.e. the battle of Uhud), it was Shaitan (Satan) who caused them to backslide (run away from the battlefield) because of some (sins) they had earned. But Allah, indeed, has forgiven them` [Al ‘Imran 3:155]? \nAs for his saying that I stayed behind on the day of Badr, was tending Ruqayyah, the daughter of the Messenger of Allah (ﷺ) , when she was dying, and the Messenger of Allah (ﷺ)  allocated to me a share (of the booty), and whoever was allocated a share by the Messenger of Allah (ﷺ)  was present.  As for his saying that he did not turn away from the way of ‘Umar ( رضي الله عنه), I cannot bear it and not even he could bear it. Go and tell him that,</b>",
        "bookID": "4.0",
        "grade1": "Hasan (Darussalam) []",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 5304590,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004910,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 491,
        "hadithText": "It was narrated that `Uthman bin `Affan said: The Messenger of Allah (ﷺ) said:Whoever prays `Isha` in congregation, it will be like spending half the night in prayer (qiyam) and whoever prays `Isha` and Fajr in congregation, it will be like spending the whole night in prayer.`</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ Muslim (656)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 5304600,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004920,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 492,
        "hadithText": "It was narrated that Nubaih bin Wahb said: Ibn Ma`mar wanted to marry his son to the daughter of Shaibah bin Jubair. So he sent me to Aban bin `Uthman who was the Ameer of Hajj. I came to him and said to him: Your brother wants to arrange his son`s marriage and wants you to witness it. He said: I think you are no more than an ill-mannered Iraqi. The pilgrim in ihram should not get married or arrange a marriage. Then he narrated a similar report from `Uthman (رضي الله عنه) and attributed it to the Prophet (ﷺ)</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ Muslim (1409)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 5304610,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004930,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 493,
        "hadithText": "It was narrated from Humran, the freed slave of `Uthman (رضي الله عنه) that `Uthman did wudoo’ in al-Maqa`id, he washed each part of the body three times and said: I heard the Messenger of Allah (ﷺ) say:  “Whoever does wudoo’ as I have done then gets up to pray, his sins will fall away, i.e., from his face, his hands, his feet and his head.`</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam), al-Bukhari (160) and Muslim (277)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 5304620,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004940,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 494,
        "hadithText": "It was narrated that Nubaih bin Wahb said: `Umar bin `Ubaidullah bin Ma`mar had a problem in his eyes. He sent word to Aban bin `Uthman (رضي الله عنه) - Sufyan said: He was the Ameer (of Hajj) - to ask what he should do. He said: Apply aloes to them, for I heard ‘Uthman (رضي الله عنه) narrate that from the Messenger of Allah (ﷺ).</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ Muslim (1204)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 5304630,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004950,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 495,
        "hadithText": "It was narrated from Aban bin `Uthman (رضي الله عنه) that he saw a funeral coming towards him. When he saw it, stood up and said: I saw Uthman (رضي الله عنه) do that and he told me that he saw the Prophet (ﷺ) do that.</b>",
        "bookID": "4.0",
        "grade1": "Sahih  because of corroborating evidence; this isnad is da 'eef because Sa'eed bin Maslamah is weak)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 5304640,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004960,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 496,
        "hadithText": "It was narrated from `Aban bin `Uthman (رضي الله عنه) from ‘Uthman (رضي الله عنه), who attributed it to the Prophet (ﷺ) , that [the latter] said: `The pilgrim in ihram should not get married or propose marriage.`</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [, Muslim (1409)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 5304650,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004970,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 497,
        "hadithText": "It was narrated from Aban bin `Uthman (رضي الله عنه) that he narrated from `Uthman (رضي الله عنه) that  the Messenger of Allah (ﷺ)  granted a concession, or said concerning the pilgrim in ihram, if he has a problem in his eyes, that he may apply aloes to them.</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ Muslim (1204)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 5304660,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004980,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 498,
        "hadithText": "It was narrated that ‘Uthman (رضي الله عنه) said:  “Whoever dies knowing that there is no God but Allah will enter Paradise.”</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ Muslim (26)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 5304670,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004990,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 499,
        "hadithText": "Ibn `Abbas (رضي الله عنه) told us. I said to ‘Uthman bin `Affan: What made you take al-Anfal, which is one of the Mathani and Bara`ah, which is one of al-mi’een, and put them next to one another and not write - Ibn Ja`far said: A line between them saying Bismillahir-Rahmanir-Raheem - and put it with the seven long ones? What made you do that? `Uthman (رضي الله عنه) said. Sometimes many soorahs would be revealed (incomplete) to the Messenger of Allah (ﷺ) , and when something was revealed he would call one of the scribes to write it down for him and say: `Put this in the soorah in which such and such is mentioned`; and verses would be revealed to him and he would say, `Put these verses in the soorah in which such and such is mentioned`; and a verse would be revealed to him and he would say: `Put this verse in the soorah in which such and such is mentioned.` Al-Anfal was one of the first soorahs to be revealed in Madinah and Bara`ah was one of the last soorahs of the Qur`an, and the content of the two soorahs was similar. Then the Messenger of Allah (ﷺ) passed away without having stated clearly to us that it was part of it, but we thought that it was, hence I put them together and I did not put between them the line Bismillahir-Rahmanir-Raheem, and I put it with the seven long ones.</b>",
        "bookID": "4.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 5304680,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005000,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 500,
        "hadithText": "It was narrated from `Uthman (رضي الله عنه) that The Prophet (ﷺ) said:  “The best of you are those who learn Qur`an and teach it.`</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ al-Bukhari (5028)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 5304690,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005010,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 501,
        "hadithText": "Abu Sahlah narrated that `Uthman (رضي الله عنه) said on the day of the house when he was under siege. The Prophet (ﷺ) solemnly advised me and I shall follow his advice with patience. Qais said: They thought it (his advice) was about that day.</b>",
        "bookID": "4.0",
        "grade1": "Hasan (Darussalam) []",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 5304700,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005020,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 502,
        "hadithText": "It was narrated from al-Hasan bin Sa`d that Rabah said: My masters married me to a Roman slave girl of theirs. I was intimate with her and she bore me a boy who was black like me and I named him `Abdullah. Then I was intimate with her again and she bore me a boy who was black like me, and I named him ‘Ubaidullah. My masters had a Roman slave whose name was Yuhannas, who spoke to her in his language, i.e. the Roman language. Then he was intimate with her and she bore him a boy who was red like a lizard. I said to her: What is this? She said: He is the child of Yuhannas. So we referred the case to Ameer al Mu`mineen `Uthman (رضي الله عنه) and they both confessed. He said: Will you agree to me passing judgement between you according to the judgement of the Messenger of Allah (ﷺ) ?He said:The Messenger of Allah (ﷺ) ruled that the child be attributed to the (husband of the) woman. And he flogged them.</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam)because Rabah is unknown]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 5304710,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005030,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 503,
        "hadithText": "It was narrated that Jami` bin Shaddad said: I heard Humran bin Aban telling Abu Burdah in the mosque that he heard `Uthman bin `Affan (رضي الله عنه) narrate from the Prophet (ﷺ)  that he said: “Whoever does wudoo’ properly as enjoined by Allah, the prescribed prayers will be expiations for whatever comes between them.`</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [. Muslim (231)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 5304720,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005040,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 504,
        "hadithText": "It was narrated that Simak Harb said: I heard Abbad bin Zahir Abu Ruwa` say: I heard ‘Uthman (رضي الله عنه) delivering a khutbah in which he said: By Allah, l accompanied the Messenger of Allah (ﷺ) whilst travelling and not traveling; he used to visit our sick, attend our funerals, go out on campaign with us and comfort us with whatever means he could. Some people tell me about him and perhaps none of them ever saw him.</b>",
        "bookID": "4.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 5304730,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005050,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 505,
        "hadithText": "Sa`eed bin al-Musayyab said.: I saw `Uthman (رضي الله عنه ) sitting in al-Maqa`id. He called for food that had been touched by fire and ate it, then he got up to pray; he prayed, then `Uthman (رضي الله عنه) said: I sat where the Messenger of Allah (ﷺ)  sat and  ate the food that the Messenger of Allah (ﷺ) ate and I offered the prayer that the Messenger of Allah (ﷺ) offered.</b>",
        "bookID": "4.0",
        "grade1": "Hasan (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 5304740,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005060,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 506,
        "hadithText": "It was narrated from Mahmood bin Labeed That `Uthman (رضي الله عنه) wanted to build (an extension to) the mosque of Madinah, but the people objected to that and wanted to leave it as it was. `Uthman (رضي الله عنه) said: I heard the Messenger of Allah( ﷺ)  say: `Whoever builds a mosque for the sake of Allah, Allah will build for him a house like it in Paradise.`</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ al Bukhari 1450 and Muslim 1533]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 5304750,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005070,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 507,
        "hadithText": "It was narrated that `Uthman bin `Affan (رضي الله عنه) said: The Messenger of Allah (ﷺ) said: `Whoever tells a lie about me deliberately, let him take up his abode in Hell.`</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) []",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 5304760,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005080,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 508,
        "hadithText": "It was narrated that ‘Uthman bin `Affan(رضي الله عنه) said: The Messenger of Allah (ﷺ) said: `Allah admitted to Paradise a man who was easygoing in buying and selling, when paying off debt and when asking for a debt that was owed to him.`</b>",
        "bookID": "4.0",
        "grade1": "Hasan because of corroborating evidences]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 5304770,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005090,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 509,
        "hadithText": "It was narrated that Abu Umamah bin Sahl bin Hunaif said. We were with Uthman when he was besieged in the house. He said: Why would they kill me? I heard the Messenger of Allah (ﷺ) say: `It is not permissible (to shed) the blood of a Muslim except in three cases: If a man disbelieves after becoming Muslim, or commits zina after being married or kills someone and is executed in retaliation.`</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 5304780,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005100,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 510,
        "hadithText": "It was narrated that Abu ‘Ubaid, the freed slave of `AbdurRahman bin Azhar, said:  l saw `Ali (رضي الله عنه) and `Uthman (رضي الله عنه) on the day of Eid al-Fitr and Eid al-Adha; they prayed, then when they finished they reminded the people. I heard them saying: The Messenger of Allah (ﷺ) forbade fasting on these two days. He said: And I heard ‘Ali say: The Messenger of Allah (ﷺ) forbade anything of the sacrificial meat to be left after three days.</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 5304791,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005110,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 511,
        "hadithText": "Al-Ahnaf said: We set out for Hajj, and passed by Madinah. Whilst we were in our camp, someone came to us and said: The people are in a panic in the mosque. My companion and I set out, and we found some people gathered around a group in the mosque. I pushed through them until I got to (that group), where I found ` Ali bin Abi Talib, Az-Zubair, Talhah and Sa`d bin Abi Waqqas. Soon ‘Uthman came walking and said: Is `Ali here? They said: Yes. He said: ls Az-Zubair here? They said: Yes. He said: ls Talhah here? They said: Yes. He said: ls Sa`d here? They said: Yes. He said: I adjure you by Allah, beside Whom there is no other god, do you know that the Messenger of Allah (ﷺ)  said: “Whoever buys the date-drying place of (the tribe of) Banu so- and-so, Allah will forgive him.” so I bought it and went to the Messenger of Allah (ﷺ) and said: I have bought it; he said: `Add it to our mosque and the reward for that will be yours”? They said: Yes. He said: I adjure you by Allah, beside Whom there is no other god, do you know that the Messenger of Allah (ﷺ) said: “Who will buy the well of Roomah?` so I bought it for such and such and went to the Messenger of Allah (ﷺ)  and said: I have bought it - meaning the well of Roomah, and he said: `Make it a water source for the Muslims and the reward for that will be yours`? They said: Yes. He said: I adjure you by Allah, beside Whom there is no other god, do you know that the Messenger of Allah (ﷺ)  looked at the faces of the people on the day of the army of hardship (Tabook) and said: “Whoever equips these men, Allah will forgive him,” so I equipped them until they were not without even reins or ropes? They said: By Allah, yes. He said: O Allah, bear witness, O Allah, bear witness; O Allah, bear witness. Then he left</b>",
        "bookID": "4.0",
        "grade1": "Sahih hadeeth]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 5304810,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005120,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 512,
        "hadithText": "It was narrated that one of the family of Ya`la bin Umayyah said: Ya`la said:I circumambulated [the Ka’bah] with ‘Uthman (رضي الله عنه) and he touched the corner. Ya`la said: I was next to the House and when I reached the western corner which is next to the Black Stone. I took his hand to touch it and he said: What is the matter with you? I said: Aren`t you going to touch it? He said: Did you not do tawaf with the Messenger of Allah (ﷺ) ” I said: Yes indeed. He said: Did you see him touch these two western corners? I said, No. He said: Don`t you have a good example in him? I said: Yes indeed. He said. Then stop bothering about that.</b>",
        "bookID": "4.0",
        "grade1": "Sahih, because of corroborating evidence and Da'if (Darussalam)) ",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 5304820,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005130,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 513,
        "hadithText": "Alu’ Aqeel narrated  That he heard al Harith, the freed slave of `Uthman  (رضي الله عنه), say: `Uthman sat down one day and we sat down with him. The Mu’adhdhin came to him and `Uthman called for water in a vessel which I thought would contain one mudd. He did wudoo`, then he said: I saw the Messenger of Allah (ﷺ)  doing wudoo’ as I have just done it, then he said: `Whoever does wudoo` as I have just done, then gets up and prays Zuhr, will be forgiven for (whatever sins he committed) between it and Fajr; then if he prays `Asr. he will be forgiven so? (whatever sins he committed) between it and Zuhr, then if he prays Maghrib, he will be forgiven for (whatever sins he committed) between it and ‘Asr, then if he prays Isha‘, he will be forgiven for (whatever sins he committed) between it and Maghrib. Then he may spend the night indulging in physical pleasure, then if he gets up and does wudoo’ and prays Fajr, he will be forgiven for (whatever sins he committed) between it and `Isha`. These are the good deeds that remove the evil deeds (cf. 11:114).” They said: These are the good deeds, but what are the good righteous deeds that last (cf. 18:46), O` Uthman? He said: They are (the words)La Ilaha Illallah, wa subhanallah wal-hamdu Lillah wallahu akbar, wa la hawla wa la quwwata illa billah ( There is no god but Allah, praise be to Allah, Allah is most great and there is no power and no strength except with Allah)</b>",
        "bookID": "4.0",
        "grade1": "Hasan (Darussalam) []",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 5304830,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005160,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 516,
        "hadithText": "It was narrated from Humran, the freed slave of ‘Uthman, that `Uthman bin `Affan said: I heard the Messenger of Allah (ﷺ) say: `Whoever does wudoo’ and does it properly, then goes to offer an obligatory prayer and offers it, his sins will be forgiven.”</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [ al-Bukhari (160) and Muslim (227)] ",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 5304850,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005170,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 517,
        "hadithText": "It was narrated that Abu Hurairah (رضي الله عنه) said:  `Uthman (رضي الله عنه) went to Makkah for Hajj. The wife of Muhammad bin Ja`far bin Abi Talib entered upon him (i.e., her husband) and he spent the night with her. Then the next morning, he (i.e., Muhammad bin Ja`far) came out smelling of perfume and wearing a wrapper saturated with safflower dye. He caught up with the people in weariness before they set out. When `Uthman saw him, he rebuked him and expressed disapproval, saying: Are you wearing something dyed with safflower when the Messenger of Allah (ﷺ)  forbade that? `Ali bin Abi Talib (رضي الله عنه) said to him: The Messenger of Allah (ﷺ) did not forbid it to him or you; he only forbade it to me.</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam) [ because of the weakness of Ubaidullah bin Abdur Rahman and Ubaidullah bin Abdullah is unknown]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 5304860,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005180,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 518,
        "hadithText": "Aban bin `Uthman said: ‘Uthman said: I heard the Messenger of Allah (ﷺ) say:  “Do you think if there was a river in the courtyard of one of you and he washed himself in it five times each day, would any dirt remain on him? They said: Nothing [would remain on him). He said: `The (five daily) prayers take away sins as water takes away dirt.`</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) []",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 5304870,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005190,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 519,
        "hadithText": "It was narrated that `Uthman bin, `Affan said: The Messenger of Allah (ﷺ)  said:   “Whoever betrays the Arabs will never receive my intercession or attain my love.`</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam) [ jiddan (very weak)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 5304880,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005200,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 520,
        "hadithText": "It was narrated from `Uthman that the Messenger of Allah (ﷺ)  said:  `The hornless animal will settle the score with the horned one on the day of Resurrection.`</b>",
        "bookID": "4.0",
        "grade1": "Sahih hadeeth because of corroborating evidence, this isnad is da'eef because of the weakness of Hajjaj bin Nusair]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 5304890,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005210,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 521,
        "hadithText": "Al Hasan narrated:  I saw `Uthman enjoining, in his khutbah, the killing of dogs and the slaughter of pigeons.</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam) [  because of the weakness of   Mubarak bin Fadalah] ",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 113,
        "matchingArabicURN": 5304900,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005220,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 522,
        "hadithText": "It was narrated that Umm Moosa said: `Uthman was the most handsome of people.</b>",
        "bookID": "4.0",
        "grade1": "Hasan (Darussalam) []",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 114,
        "matchingArabicURN": 5304910,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005230,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 523,
        "hadithText": "Ibraheem bin Sa`d narrated: My father narrated that his father said:  I was praying and a man passed in front of me; I tried to stop him but he insisted. I asked `Uthman bin `Affan (about that) and he said. It does not affect you, O son of my brother.</b>",
        "bookID": "4.0",
        "grade1": "Sahih] ",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 115,
        "matchingArabicURN": 5304920,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005240,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 524,
        "hadithText": "Ibraheem bin Sa’d narrated: My father narrated; that his father said: Uthman said: If you find in the Book of Allah, may He be glorified and exalted, that you should put my feet in fetters, then do that.</b>",
        "bookID": "4.0",
        "grade1": "Sahih]]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 116,
        "matchingArabicURN": 5304930,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005250,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 525,
        "hadithText": "It was narrated from ‘Ubaidullah bin Abi Rafi’, the freed slave of the Messenger of Allah (ﷺ) , from `Ali bin Abi Talib (رضي الله عنه) that  The Messenger of Allah (ﷺ) stood in Arafah with Usamah bin Zaid riding behind him, and said: `This is the place of standing, and all of `Arafah is a place of standing.` Then he moved on at an unhurried pace, and the people started rushing right and left. He turned to them and said: `Calmly, O people; calmly, O people.” Then he came to al-Muzdalifah and put two prayers together, then he stood in al-Muzdalifah in a place called Quzah, with al-Fadl bin al-`Abbas riding behind him, and he said: “This is the place of standing and all of Muzdalifah is a place of standing.” Then he moved on at an unhurried pace and the people started rushing right and left. He turned to them and said: `Calmly, O people; calmly, O people.” he quoted the hadeeth at length.</b>",
        "bookID": "4.0",
        "grade1": "Hasan (Darussalam) []",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 117,
        "matchingArabicURN": 5304940,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005260,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 526,
        "hadithText": "It was narrated from Muslim Abu Sa`eed, the freed slave of `Uthman bin `Affan (رضي الله عنه) that  `Uthman bin `Affan manumitted twenty slaves, and called for some pants and put them on; he had never worn them before, either during the Jahiliyyah or in Islam. And he said: I saw the Messenger of Allah (ﷺ) in a dream last night, and I saw Abu Bakr and `Umar (رضي الله عنهما) and they said to me, Be patient, for you will break your fast with us tomorrow. Then he called for a Mushaf and opened it, and he was killed with it in front of him.</b>",
        "bookID": "4.0",
        "grade1": "lts isnad is Sahih]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 118,
        "matchingArabicURN": 5304950,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005270,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 527,
        "hadithText": "It was narrated that `Uthman said:  I saw the Messenger of Allah (ﷺ) do wudoo’: he washed his face three times and his hands three times, and he washed his arms three times each, and wiped his head, and washed his feet thoroughly.</b>",
        "bookID": "4.0",
        "grade1": "Sahih hadeeth, this isnad is Da'if]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 119,
        "matchingArabicURN": 5304960,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005280,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 528,
        "hadithText": "It was narrated from Aban bin `Uthman, from `Uthman, that  The Prophet (ﷺ) said: `Whoever says, `In the Name of Allah with Whose name nothing on earth or in heaven can cause harm, and he is the All-Hearing, All-Knowing.` three times, will not be struck unawares by calamity until night comes, and whoever says it in the evening will not be struck unawares by calamity until morning comes, in sha` Allah.”</b>",
        "bookID": "4.0",
        "grade1": "Hasan]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 120,
        "matchingArabicURN": 5304970,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005290,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 529,
        "hadithText": "It was narrated from Aban bin `Uthman that  He saw a funeral coming. When he saw it he stood up and said. I saw `Uthman doing that and he told me that he saw the Prophet (ﷺ) doing that.</b>",
        "bookID": "4.0",
        "grade1": "Sahih because of corroborating evidence; this isnad is Da'if because of the weakness of Sa'eed bin Maslamah]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 121,
        "matchingArabicURN": 5304980,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005300,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 530,
        "hadithText": "It was narrated from `Amr bin `Uthman bin `Affan (رضي الله عنه) that his father said:  The Messenger of Allah (ﷺ) said: “Sleeping early in the day leads to withholding of provision.”</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam) jiddan, virtually mawdoo’ (fabricated)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 122,
        "matchingArabicURN": 5304990,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005310,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 531,
        "hadithText": "It was narrated from Ibraheem` bin `Abdullah bin Farrookh that his father said:  I saw `Uthman bin `Affan (رضي الله عنه) buried in his clothes soaked with his blood. he was not washed.</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam) [ because of the weakness of Mahboob bin Muhriz and Ibraheem bin Abdullah is unknown]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 123,
        "matchingArabicURN": 5305000,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005320,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 532,
        "hadithText": "It was narrated from Mihjan the freed slave of `Uthman, that `Uthman  said:  I heard the Messenger of Allah (ﷺ) say: “Allah will shade with His shade on the Day when there is no shade but His a person who gave more time to a debtor who was in difficulty or waived a debt for one who had a lot of debts.`</b>",
        "bookID": "4.0",
        "grade1": "lts isnad is Da'if jiddan]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 124,
        "matchingArabicURN": 5305010,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005330,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 533,
        "hadithText": "It was narrated from ‘Amr bin `Uthman bin `Affan (رضي الله عنه) that his father said:  The Messenger of Allah (ﷺ) said: “Sleeping early in the morning leads to withholding of provision.”</b>",
        "bookID": "4.0",
        "grade1": "lts isnad is Da'if jiddan (very weak), virtually mawdoo` (fabricated)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 125,
        "matchingArabicURN": 5305020,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005340,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 534,
        "hadithText": "It was narrated from Aban bin `Uthman, from his father, that the Prophet       (ﷺ)said: “The pilgrim in ihram should not get married, arrange a marriage or propose marriage.`</b>",
        "bookID": "4.0",
        "grade1": "lts isnad is Sahih, Muslim (1409)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 126,
        "matchingArabicURN": 5305030,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005350,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 535,
        "hadithText": "It was narrated from Nafiʼ; Nubaih bin Wahb told me: `Umar bin Ubaidullah bin Ma’mar proposed marriage on behalf of his son to the daughter of Shaibah bin `Uthman. He sent me to Aban bin `Uthman, who was the leader of the Hajj, and he [Aban] said: I think he must be a Bedouin. `The pilgrim in ihram should not get married or arrange a marriage.` ‘Uthman (رضي الله عنه) told me that from the Prophet (ﷺ) , and Nubaih told me something similar from his father.</b>",
        "bookID": "4.0",
        "grade1": "lts isnad is Sahih]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 127,
        "matchingArabicURN": 5305040,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005360,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 536,
        "hadithText": "It was narrated that Na`ilah bint al-Farafisah, the wife of `Uthman bin `Affan  (رضي الله عنه) said: Ameer al-Mu`mineen, `Uthman felt sleepy and had a brief nap. When he woke up, he said: The people will certainly kill me. I said: No, in sha Allah it will not go that far: your people will only ask you for an explanation. He said: I saw the Messenger of Allah (ﷺ) in my dream, and Abu Bakr and `Umar, (رضي الله عنهما) and they said: You will break your fast with us tonight.</b>",
        "bookID": "4.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 128,
        "matchingArabicURN": 5305050,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005370,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 537,
        "hadithText": "It was narrated that al-Hasan bin Abil-Hasan said: l entered the mosque and I saw `Uthman bin `Affan (رضي الله عنه) reclining on his rida`. Two water carriers came to him and he judged between them. Then I came to him and looked at him; he was a handsome man with marks of smallpox on his face and his arms were covered with hair.</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam) because of the weakness of Abul Miqdam]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 129,
        "matchingArabicURN": 5305060,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005380,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 538,
        "hadithText": "Umm Ghurab narrated that Bunanah said: ’Uthman never dyed his hair.</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam) because Umm Ghurab is unknown]    ",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 130,
        "matchingArabicURN": 5305070,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005390,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 539,
        "hadithText": "Waqid bin ‘Abdullah At-Tameemi narrated from someone Who saw ‘Uthman bin ‘Affan (رضي الله عنه) with his teeth covered with gold.</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 131,
        "matchingArabicURN": 5305080,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005400,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 540,
        "hadithText": "It was narrated that Moosa bin Talha said: I Heard ‘Uthman bin ‘Affan (رضي الله عنه) when he was on the minbar and the mu’adhdhin was giving the iqamah (call immediately preceding the prayer), asking the people about their news and business.</b>",
        "bookID": "4.0",
        "grade1": "Sahih]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 132,
        "matchingArabicURN": 5305090,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005410,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 541,
        "hadithText": "It was narrated from as-Sa’ib bin Yazeed that ’Uthman (رضي الله عنه) Prostrated in Soorat Sad</b>",
        "bookID": "4.0",
        "grade1": "Sahih]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 133,
        "matchingArabicURN": 5305100,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005420,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 542,
        "hadithText": "It was narrated from Ibraheem bin ‘Abdullah - i.e. Ibn Farrookh - that his father said: I offered the Eid prayer behind `Uthman (رضي الله عنه) and he said the takbeer seven times and five times (i.e., in the first and second rak’ahs, respectively).</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam) because of the weakness of Mahboob bin Muhriz and Ibraheem bin Abdullah is unknown]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 134,
        "matchingArabicURN": 5305110,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005430,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 543,
        "hadithText": "Al-Hasan mentioned `Uthman`s extreme shyness and said: If he was in a room with the door closed, and he took off his garment to pour water on himself, shyness prevented him from standing up straight.</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 135,
        "matchingArabicURN": 5305120,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005440,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 544,
        "hadithText": "Umayyah bin Shibl and others said: `Uthman held the position of caliph for twelve years and the turmoil lasted for five years.</b>",
        "bookID": "4.0",
        "grade1": "munqati’ (interrupted)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 136,
        "matchingArabicURN": 5305130,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005450,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 545,
        "hadithText": "It was narrated that Abu Ma`shar said: `Uthman (رضي الله عنه) was killed on the eighteenth of Dhul-Hijjah 35 AH, His caliphate lasted twelve years less twelve days.</b>",
        "bookID": "4.0",
        "grade1": "lts isnad is munqati’ (interrupted). Abu Ma'shar is Da'if]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 137,
        "matchingArabicURN": 5305140,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005460,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 546,
        "hadithText": "Abu `Uthman narrated that ’Uthman (رضي الله عنه) was killed in the middle of the days of al-tashreeq.</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 138,
        "matchingArabicURN": 5305150,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005470,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 547,
        "hadithText": "Qatadah narrated that `Uthman (رضي الله عنه) was killed when he was ninety years old or eighty-eight years old.</b>",
        "bookID": "4.0",
        "grade1": "munqati (interrupted)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 139,
        "matchingArabicURN": 5305160,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005480,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 548,
        "hadithText": "lt was narrated that Abul ’Aliyah said: We were guarding The door of ‘Uthman (رضي الله عنه) for the first ten days of [Dhul-Hijjah].</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 140,
        "matchingArabicURN": 5305170,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005490,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 549,
        "hadithText": "It was narrated that Qatadah said: Az-Zubair offered the funeral prayer for `Uthman (رضي الله عنه) and buried him in accordance with his instructions.</b>",
        "bookID": "4.0",
        "grade1": "munqati’]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 141,
        "matchingArabicURN": 5305180,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005500,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 550,
        "hadithText": "It was narrated that ‘Abdullah bin Muhammad bin `Aqeel said: `Uthman (رضي الله عنه) was killed in 35 AH and the fitnah (turmoil) lasted for\nfive years including four months of al-Hasan`s rule.</b>",
        "bookID": "4.0",
        "grade1": "lts isnad is munqati’]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 142,
        "matchingArabicURN": 5305190,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005510,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 551,
        "hadithText": "It was narrated that Abul `Aliyah said: We were guarding the door of `Uthman (رضي الله عنه) for the first ten days of [Dhul-Hijjah].</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 143,
        "matchingArabicURN": 5305200,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005520,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 552,
        "hadithText": "It was narrated from Zaid bin Aslam that his father said: I saw `Uthman (رضي الله عنه) on the day he was besieged in the place where funerals were held; if a stone were to be thrown it would not have landed anywhere but on a man`s head. And I saw `Uthman (رضي الله عنه) look out of the window beside the place where Jibreel (عليه السلام) once stood, and he said: O people, is Talhah among you? They kept quiet. Then he said: O people, is Talhah among you? They kept quiet. Then he said: O people, is Talhah among you? Talhah bin `Ubaidullah stood up and ‘Uthman (رضي الله عنه) said to him: Are you there? I did not think that you would be in a group of people, hearing me call you three times and not answering me. I adjure you by Allah, O Talhah, do you remember the day when you and I were with the Messenger of Allah (ﷺ)  in such and such a place, and none of his Companions were with him except you and I. He said: Yes, [`Uthman said:] And the Messenger of Allah (ﷺ) said to you: `O Talhah, there is no Prophet but he had a companion from among his ummah who will be with him in Paradise, and this `Uthman bin `Affan (رضي الله عنه)` - meaning me - `is that companion who will be with me in Paradise.” Talhah said: By Allah, yes [I remember that]. Then he went away.</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 144,
        "matchingArabicURN": 5305210,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005530,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 553,
        "hadithText": "It was narrated from Humran bin Aban that He saw `Uthman (رضي الله عنه) do wudoo` one day; he rinsed his mouth and his nose, and he washed his face three times... and he narrated a hadeeth from the Prophet (ﷺ) similar to the hadeeth of Ibn Ja`far from Sa’eed.</b>",
        "bookID": "4.0",
        "grade1": "Sahih because of corroborating evidence]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 145,
        "matchingArabicURN": 5305220,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005540,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 554,
        "hadithText": "It was narrated from one of the Ansar that his father said: I was standing with ‘Uthman bin `Affan (رضي الله عنه) and he said: Shall I not tell you how the Messenger of Allah (ﷺ)  did wudoo`? We said: Yes indeed. He called for water and washed his face three times, rinsed his mouth and nose three times, then he washed his hands up to the elbow three times, then he wiped his head and his ears, and washed his feet three times. Then he said: This is how the Messenger of Allah (ﷺ)  did wudoo`.</b>",
        "bookID": "4.0",
        "grade1": "Sahih Hadeeth, this isnad is Da'if because of a man and his father from Ansar are unknown]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 146,
        "matchingArabicURN": 5305230,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005550,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 555,
        "hadithText": "It was narrated that Thumamah bin Hazn al-Qushairi said: I was present at the house (of `Uthman) on the day `Uthman (رضي الله عنه) was killed. He looked out at them and said: Call for me your two companions who incited you against me. They were called for him and he said: I adjure you by Allah, do you know that when the Messenger of Allah (ﷺ)  came to Madinah, the mosque got too crowded for its people and he said: “Who will buy this piece of land with his own wealth and use it like the rest of the Muslims (i.e., donate it to the Muslims and share it with them) and he will have something better than it in Paradise?” So I bought it with my own wealth and donated it to the Muslims, but now you are preventing me from praying two rak’ahs in it! Then he said: I adjure you by Allah, do you know that when the Messenger of Allah (ﷺ) came to Madinah, there was no well good for drinking from except (the well of) Roomah. The Messenger of Allah (ﷺ) said: `Who will buy it with his own wealth and his bucket will be like that of the Muslims (i.e., donate the well to the Muslims and share it with them) and he will have something better than it in Paradise.” So I bought it with my own wealth, but now you are preventing me from drinking from it. Then he said: Do you know that I am the one who equipped the army of hardship (i.e., the army that went on the campaign of Tabook)? They said: By Allah, yes.</b>",
        "bookID": "4.0",
        "grade1": "Sahih hadeeth and its isnad is Hasan]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 147,
        "matchingArabicURN": 5305240,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005560,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 556,
        "hadithText": "It was narrated that Shaqeeq said: `Abdur-Rahman bin ‘Awf met al-Waleed bin `Uqbah Al-Waleed said to him: Why do I see you keeping away from Ameer al-Mu`mineen `Uthman (رضي الله عنه)? `AbdurRahman said to him. Tell him that I did not flee on the day of `Ainain - ` Asim said: The day of Uhud - and I did not stay behind on the day of Badr, and I did not turn away from the way of ‘Umar (رضي الله عنه). So he went and told that to `Uthman (رضي الله عنه), who said: As for his saying that he did not flee on the day of `Ainain, how could he shame me for a fault for which Allah has pardoned me and said: `Those of you who turned back on the day the two hosts met (i.e. the battle of Uhud), it was Shaitan (Satan) who caused them to backslide (run away from the battlefield) because of some (sins) they had earned. But Allah, indeed, has forgiven them.` [Al ‘Imran 3:155]? As for his saying that I stayed behind on the day of Badr, I was tending Ruqayyah, the daughter of the Messenger of Allah (ﷺ), when she was dying, and the Messenger of Allah (ﷺ)  allocated to me a share (of the booty), and whoever was allocated a share by the Messenger of Allah (ﷺ)  was present.... and he quoted the hadeeth at length to the end.</b>",
        "bookID": "4.0",
        "grade1": "Hasan (Darussalam) [, and it is a repeat of 490]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 148,
        "matchingArabicURN": 5305250,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005570,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 557,
        "hadithText": "It was narrated that Abu Wa`il said: I said to ‘AbdurRahman bin ‘Awf: How could you swear allegiance to ‘Uthman (رضي الله عنه)  and not to `Ali (رضي الله عنه)? He said: It is not my fault. I started with `Ali and said: I swear allegiance to you in accordance with the Book of Allah, the Sunnah of His Messenger, and the way of Abu Bakr and ʼUmar (رضي الله عنهما) . He said: As much as I can. Then I offered it to `Uthman (رضي الله عنه) and he accepted it.</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 149,
        "matchingArabicURN": 5305260,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005600,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 560,
        "hadithText": "Sa`eed bin al-Musayyab said: I heard ‘Uthman (رضي الله عنه) delivering a khutbah from the minbar. He said: I used to buy dates from one of the Jewish clans who were called Banu Qainuqa`, and sell them at a profit. News of that reached the Messenger of Allah (ﷺ) who said: `O `Uthman, when you buy, take your dues with nothing extra, and when you sell, give (the other party`s) dues with nothing less.`</b>",
        "bookID": "4.0",
        "grade1": "A Hasan hadeeth]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 151,
        "matchingArabicURN": 5305280,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5005610,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 561,
        "hadithText": "`Ubaidullah bin `Adiyy bin al-Khiyar narrated that `Uthman (رضي الله عنه) said to him: Verily Allah, may He be glorified and exalted, sent Muhammad (ﷺ) with the truth and I was one of those who responded to (the call of) Allah and His Messenger, and I believed in that with which Muhammad (ﷺ) was sent. Then I migrated twice, and I also attained the honour of becoming the son-in-law of the Messenger of Allah (ﷺ); I swore allegiance to the Messenger of Allah (ﷺ), and by Allah, I never disobeyed him or betrayed him until Allah, may He be glorified and exalted, took his soul in death.</b>",
        "bookID": "4.0",
        "grade1": "lts isnad is Sahih, al-Bukhari (3696)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 152,
        "matchingArabicURN": 5305290,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5004121,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 412,
        "hadithText": "It was narrated from `Uthman bin `Affan (رضي الله عنه) that the Prophet        (ﷺ) said: `The best of you is the one who teaches Qur`an or learns it.” Muhammad bin Ja`far and Hajjaj said: Abu `AbdurRahman said: That is what made me sit in this place (i.e., become a teacher). Hajjaj said: Shu`bah said: Abu `Abdur-Rahman did not hear (it) from `Uthman (رضي الله عنه) or from ‘Abdullah, but he heard it from ‘Ali (رضي الله عنه). My father said and Bahz said: (It was narrated from) Shu`bah who said: `AIqamah bin Marthad told me. “The best of you is the one who learns Qur`an and teaches it.`\n\n<p>\n`Affan told us: Shu`bah told us: `Alqamah bin Marthad told me... and he said in it: “Whoever learns the Qur`an or teaches it.”</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [, al Bukhari (5028)] Sahih (Darussalam) []",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 5303890,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5004161,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 416,
        "hadithText": "It was narrated from alHasan bin Sa`d, the freed slave of Hasan bin `Ali, that Rabah said: My masters married me to a Roman slave girl of theirs. I was intimate with her and she bore me a boy who was black like me and i named him `Abdullah. Then l was intimate with her again and she bore me a boy who was black like me, and I named him Ubaidullah. Then she was corrupted by a Roman slave of my masters, whose name was Yuhannas and he spoke to her in their language. Then she gave birth to a boy who looked like a lizard (i.e., was very fair). I said to her: What is this? She said: He is the child of Yohannas. So we referred the case to Ameer al-Mu`mineen `Uthman (رضي الله عنه) - Mahdi said: I think he said: And he asked then both- and they confessed. He said. Will you agree to me passing judgement between you according to the judgement of the Messenger of Allah (ﷺ) ? He said: The Messenger of Allah (ﷺ)  ruled that the child be attributed to the (husband of the) woman, and the fornicator gets nothing. Mahdi said: and I think he said: He flogged her and him, and they were both slaves,\n\n<p>\nIt was narrated from Rabah... he mentioned a similar hadeeth. He said: I took them to Ameer al-Mu`mineen `Uthman bin `Affan {رضي الله عنه}, who said: The Messenger of Allah (ﷺ)  ruled that the child be attributed to (the husband of the woman... and he mentioned a similar report</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam) [ because Rabah is unknown] Da\\'if and it is a repeat of the previous report]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 5303920,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5004181,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 418,
        "hadithText": "It was narrated that Humran said, `Uthman (رضي الله عنه) called for water when he was in al-Maqa`id. He poured some on his right hand and washed it, then he put his right hand in the vessel and washed his hands three times, then he washed his face three times, and he rinsed his mouth and nose, he washed his arms up to the elbows three times, then he wiped his head, then he washed his feet up to the ankles three times. Then he said: I heard the Messenger of Allah(ﷺ)  say: “Whoever does wudoo` as I have done wudoo’, then prays two rak`ahs in which he does not let his mind wander, will be forgiven his previous sins. \n\n<p>\nIt was narrated from Humran, the freed slave of ‘Uthman, that he saw `Uthman (رضي الله عنه) call for a vessel,... and he mentioned a similar report.</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [, al-Bukhari (159) and Muslim (226)] Sahih hadeeth and it is repeat of the previous report]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 5303930,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5004271,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 427,
        "hadithText": "It was narrated that Abu `Ubaid said: I saw `Ali and `Uthman (رضي الله عنه)on the day of (Eid) al-fitr and (Eid) al-Adhaa; they prayed, then when they finished they reminded the people. I heard them saying. The Messenger of Allah (ﷺ)  forbade fasting on these two days,\n\n<p>\nIt was narrated from `Ata` bin Yazeed al-Junda`i that he heard Humran the freed slave of `Uthman bin `Affan (رضي الله عنه), say.  I saw Ameer al-Mu`mineen `Uthman do wudoo’; he poured water onto his hands three times, then he rinsed his nose three times and rinsed his mouth three times... and he mentioned the Hadeeth, similar to the Hadeeth of Ma`mar.</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [) Sahih (Darussalam) [ al-Bukhari (159) and Muslim (226)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 5304010,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5004371,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 437,
        "hadithText": "It was narrated that Abu Umamah bin Sahl said: We were with ‘Uthman when he was under siege in the house. He went to the entrance of the house, from which his words could be heard in alBalat. He went to that entrance, then came out to us and said:They were threatening to kill me just now. We said: Allah will suffice you against them. O Ameer al-Mu`mineen. He said: Why would they kill me? I heard the Messenger of Allah (ﷺ)  say: `It is not permissible (to shed) the blood of a Muslim except in three cases: if a man disbelieves after becoming Muslim, or commits zina after being married, or kills someone and is executed in return.” By Allah, I have never wished to change my religion after Allah guided me; I never committed zina either during the Jahiliyyah or in Islam; and I have never killed anyone. So why would they kill me\n\n<p>\nAbu Umamah bin Sahl bin Hunaif narrated: I was with `Uthman (رضي الله عنه) in the house when he was under siege. We would enter through an entrance... and he narrated a similar hadeeth. And he said: I heard the Messenger of Allah (ﷺ)  say:... and he narrated a similar hadeeth,</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam)] Sahih (Darussalam) []",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 5304110,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5004441,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 444,
        "hadithText": "Sa`eed bin al-Musayyab said. I heard ‘Uthman (رضي الله عنه) delivering a khutbah from the minbar. He said:  I used to buy dates from one of the Jewish clans who were called Banu Qainuqa`, and sell them at a profit. News of that reached the Messenger of Allah (ﷺ)  who said: `O `Uthman, when you buy, take your dues with nothing extra, and when you sell, give (the other party`s) dues with nothing less.`\n\n<p>\nMoosa bin Wardan narrated from Sa`eed bin al-Musayyab from ‘Uthman bin `Affan (رضي الله عنه)... and he mentioned a similar report.</b>",
        "bookID": "4.0",
        "grade1": "A Hasan hadeeth] Hasan, it is repeat of the report above)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 5304170,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5004501,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 450,
        "hadithText": "It was narrated that `Uthman bin `Affan (رضي الله عنه) said: A man came to the Prophet (ﷺ)  and said: O Messenger of Allah (ﷺ), I prayed but I do not know whether I did an even number [of rak`ahs] or an odd number. The Messenger of Allah (ﷺ) said: `Beware lest the Shaitan toy with you in your prayer. Whoever among you prays and does not know whether he did an even number [of rak`ahs] or an odd number, let him prostrate twice, for that will complete his prayer.` \n\n<p>\nIt was narrated that Masarrah bin Ma`bad said: Yazeed bin Abi Kabshah led us in praying `Asr, then he turned to us after the prayer and said: I prayed with Marwan bin al-Hakam and he did two prostrations like these, then he turned to us and told us that he prayed with ‘Uthman (رضي الله عنه), who narrated from the Prophet (ﷺ) ... and he mentioned a similar report.</b>",
        "bookID": "4.0",
        "grade1": "Hasan and its isnad is da'eef because it is interrupted] lts isnad is Hasan]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 5304220,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5004811,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 481,
        "hadithText": "lt was narrated from al-Mugheerah bin Shu`bah that he entered upon `Uthman (رضي الله عنه) when he was under siege and said: You are the leader of the people and there has befallen you what you see, I am going to suggest to you three options, choose one of them. Either go out and fight them, because you have numbers and strength, and you are in the right and they are in the wrong; or we will make another door for you other than the door where they are, then you can mount your animal and go to Makkah, for they will not try to kill you there; or go to Syria, for the people of Syria are good people and among them is Mu`awiyah. `Uthman (رضي الله عنه) said: As for going out and fighting. I will never be the first successor of the Messenger of Allah (ﷺ)  to shed blood among his ummah; as for going out to Makkah because they will never try to kill me there, I heard the Messenger of Allah (ﷺ) say, “A man of Quraish will commit profanity in Makkah and half the punishment of the world will be upon him`, and I will never be that one; as for going to Syria, because they are the people of Syria and Mu`awiyah is among them, I shall never leave the land to which I migrated, where I am close to the Messenger of Allah (ﷺ) \n\nIt was narrated from Ibn al-Mubarak... and he mentioned the same hadeeth, and said `will commit profanity.”</b>",
        "bookID": "4.0",
        "grade1": "Da'if (Darussalam) [ because it is interrupted], A da\\'eef hadeeth it is repeat of the previous hadeeth]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 5304510,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5005581,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 558,
        "hadithText": "It was narrated that Abu Salih, the freed slave of `Uthman bin `Affan (رضي الله عنه) said: I heard `Uthman (رضي الله عنه) say on the minbar: O people, I concealed from you a hadeeth that I heard from the Messenger of Allah (ﷺ)  for fear that you would scatter away from me, then I thought that I should tell it to you, and let each one choose for himself what he thinks is best. I heard the Messenger of Allah (ﷺ) say: `Guarding the border for one day for the sake of Allah is better than a thousand other days doing other deeds.”\n\n`Abdullah bin ‘Abdur-Rahman bin Abi Dhubab narrated... A similar hadeeth]</b>",
        "bookID": "4.0",
        "grade1": "A Hasan hadeeth] , Da\\'if (Darussalam), it is a repeat of 442]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 150,
        "matchingArabicURN": 5305270,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5004551,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 455,
        "hadithText": "It was narrated from Hisham bin `Urwah from his father from Marwan, and we have no reason to suspect hirn, who said,  `Uthman (رضي الله عنه) suffered a nosebleed in the year of the nosebleed, (which was so bad that, he stayed behind from Hajj and gave his final instructions (because he thought he was going to die). A man of Quraish entered upon him and said: Appoint a successor. He said: Are they suggesting that? He said: Yes. He said: Who are they suggesting? The man kept quiet. Then another man entered upon him and said something similar to what the first man said, and he gave the same response. Then `Uthman (رضي الله عنه) said: Are they suggesting az-Zubair? He said: Yes. He said. By the One in whose hand is my soul, indeed he is the best among them as far as I know, and the most beloved of them to the Messenger of Allah (ﷺ) .\n\n‘Abdullah told us: Suwaid told us: ` Ali bin Mus-hir told us similar report, with his isnad.</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [], Sahih hadeeth]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 5304260,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5005141,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 4,
        "bookName": "",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 514,
        "hadithText": "`A`ishah, the wife of the Prophet (ﷺ) and ‘Uthman  (رضي الله عنه) narrated that Abu Bakr asked for permission to enter upon the Messenger of Allah (SWT) when he was lying down on his bed, wearing the cover of `A`ishah. He gave permission to Abu Bakr (to enter) when he was like that, and he fulfilled his need then he went away. Then ‘Umar asked for permission to enter and he gave him permission (to enter) when he was like that, and he fulfilled his need then he went away. `Uthman said: Then I asked permission to enter and he set up and said to `A`ishah: `Cover yourself properly.` I fulfilled my need then I went away, `A`ishah said: O Messenger of Allah (ﷺ), why did I not see you stirring for Abu Bakr and ‘Umar as you did for `Uthman? The Messenger of Allah (SWT) said: ``Uthman is a shy man, and I was afraid that if I gave him permission to enter when I was in that state, he would not tell me of his need.` Al-Laith said: Some people said: The Messenger of Allah (ﷺ)  said to `A`ishah (رضي الله عنه): `Should I not feel shy before a man before whom the angels feel shy?`\n\nSa`eed bin al-`As narrated that `Uthman and `A`ishah narrated that Abu Bakr asked for permission to enter upon the Messenger of Allah (ﷺ) when he was lying down on his bed, wearing the cover of `A`ishah. And he narrated a hadeeth similar to that of ‘Uqail.</b>",
        "bookID": "4.0",
        "grade1": "Sahih (Darussalam) [, Muslim (2402)], Sahih (Darussalam) []",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 5304840,
        "last_updated": "2012-04-26 14:00:00"
    }
]