[
    {
        "englishURN": 5013810,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 6,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1381,
        "hadithText": "It was narrated that Ibn Abi Mulaikah said: Talhah bin ‘Ubaidullah (رضي الله عنه) said: I heard the Messenger of Allah (ﷺ) said: `How good are the family: ‘Abdullah, the father of ‘Abdullah and the mother of ‘Abdullah.`</b>",
        "bookID": "6.0",
        "grade1": "Da'if (Darussalam) because it is interrupted]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 5313090,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5013820,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 6,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1382,
        "hadithText": "It was narrated that Ibn Abi Mulaikah said: Talhah bin ‘Ubaidullah said: I do not usually narrate anything from the Messenger of Allah (ﷺ), but I heard him say:` `Amr bin al-`As (رضي الله عنه) is one of the righteous of Quraish.” \n“Abdul Jabbar bin Ward added, narrating from Ibn Abi Mulaikah, that Talhah said: “How good are the family: ‘Abdullah, the father of `Abdullah and the mother of `Abdullah.`</b>",
        "bookID": "6.0",
        "grade1": "lts isnad is Da'if like the previous report]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 5313100,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5013830,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 6,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1383,
        "hadithText": "It was narrated from Mu`adh bin `Abdur-Rahman bin `Uthman at-Taimi that his father ‘ Abdur-Rahman bin `Uthman said: “We were with Talhah bin ‘Ubaidullah (رضي الله عنه) and we were in ihram. We were given a bird as a gift whilst Talhah was sleeping. Some of us ate and some of us refrained and did not eat. When Talhah woke up, he approved of those who had eaten it and said: “We ate it with the Messenger of Allah(ﷺ).”</b>",
        "bookID": "6.0",
        "grade1": "Sahih (Darussalam), Muslim (1197)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 5313110,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5013840,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 6,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1384,
        "hadithText": "It was narrated from Yahya bin Talhah that his father said: `Umar(رضي الله عنه) saw Talhah bin `Ubaidullah looking upset and said: “What is the matter with you, O Father of so and so? Perhaps your cousin being appointed as caliph has upset you, O Father of so and so?” He said: “No, but I heard a Hadeeth from the Messenger of Allah (ﷺ) and nothing prevented me from asking him about it except the fear of not being able to comply with it sand I did not ask him about it until he died. I heard him say: `I know a word which no one says at the time of death but his colour will brighten and Allah will relieve him of his distress.` Umar (رضي الله عنه) said: “I know what it is.” Talhah said: “What is it?” ’Umar(رضي الله عنه) said: “Do you know any word that is greater than the word he enjoined his uncle to say when he was dying, La ilaha illallah?” Talhah said: “You are right. By Allah, that is what it is.”</b>",
        "bookID": "6.0",
        "grade1": "lts isnad is Sahih]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 5313120,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5013850,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 6,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1385,
        "hadithText": "It was narrated that Isma`eel said: I saw Talhah with his hand paralysed; he had protected the Messenger of Allah (ﷺ) with it on the day of Uhud.</b>",
        "bookID": "6.0",
        "grade1": "lts isnad is Sahih, al-Bukhari (4063)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 5313130,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5013860,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 6,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1386,
        "hadithText": "It was narrated from Yahya bin Talhah bin `Ubaidullah, from his father, that ‘Umar (رضي الله عنه) saw him looking sad and said: “What is the matter with you, O Abu Muhammad? Perhaps you are upset about your cousin being appointed as caliph?” [referring to Abu Bakr(رضي الله عنه)]. He said: “No.” And he spoke highly of Abu Bakr (رضي الله عنه), [then he said:] “But I heard the Prophet (ﷺ) say: `[There is] a word which no one says when he is dying but Allah will relieve him of distress and his colour will brighten.” Nothing prevented me from asking him about it except the fear of not being able to comply with it and I did not ask him about it until he died.” ‘Umar said to him: “I know what it is.” Talhah said to him: “What is it?` ‘Umar said: “Do you know any word that is greater than the word he enjoined his uncle to say when he was dying, ‘La ilaha illallah’?” Talhah said: “You are right. By Allah, that is what it is.”</b>",
        "bookID": "6.0",
        "grade1": "lts isnad is Sahih]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 5313140,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5013870,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 6,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1387,
        "hadithText": "Dawood bin Khalid bin Dinar narrated that  He and a man called Abu Yoosuf, who was from (the tribe of) Banu Taim, passed by Rabee`ah bin Abi ‘AbdurRahman (رضي الله عنه) and Abu Yoosuf said to him: “We find that you have a hadeeth that we did not find with anyone else.” He said: “I have a lot of hadeeths, but Rabee`ah bin al Hudair - who used to stay close to Talhah bin `Ubaidullah - said that he did not hear Talhah narrate any hadeeth from the Messenger of Allah (ﷺ) except one.” Rabee`ah bin Abi ‘Abdur-Rahman said: “I said to him: “What is it?” He said: “Talhah said to me: “We went out with the Messenger of Allah (ﷺ) until we approached Harrat Waqim. When we drew close to it, we saw some graves at a turn in the valley and we said: “O Messenger of Allah(ﷺ), are these the graves of our brothers?” He said: “The graves of our companions.` Then he left and when we came to the graves of the martyrs, the Messenger of Allah (ﷺ) said: `These are the graves of our Brothers.””</b>",
        "bookID": "6.0",
        "grade1": "Hasan (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 5313150,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5013880,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 6,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1388,
        "hadithText": "It was narrated from Moosa bin Talhah that his father said: We used to pray with animals passing in front of us. We mentioned that to the Prophet (ﷺ) and he said: “If you put something the height of the back of a saddle in front of you, then it will not matter what passes beyond it.”</b>",
        "bookID": "6.0",
        "grade1": "Hasan (Darussalam), Muslim (499)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 5313160,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5013890,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 6,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1389,
        "hadithText": "It was narrated that Abu Salamah said: Two men from Yemen came to stay with Talhah bin `Ubaidullah. One of them was killed with the Messenger of Allah (ﷺ) and the other remained for a year after that and then he died in his bed. Talhah bin `Ubaidullah was shown [in a dream] that the one who died in his bed entered Paradise some time before the other. Talhah mentioned that to the Messenger of Allah (ﷺ) and the Messenger of Allah (ﷺ) said: “How long did he live after (the one who died first)?` He said: “One year.” The Messenger of Allah (ﷺ) said: “He offered eighteen hundred (extra) prayers and fasted Ramadan.`</b>",
        "bookID": "6.0",
        "grade1": "Hasan because of corroborating evidence; this is a Da'if isnad] ",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 5313170,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5013900,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 6,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1390,
        "hadithText": "Malik narrated from his paternal uncle, from his father, that he heard Talhah bin `Ubaidullah say: A Bedouin came to the Prophet (ﷺ) and said: “O Messenger of Allah(ﷺ), what is Islam?” He said: `Five prayers every day and night.` He said: “Do l have to do anything other than that?” He said: “No.” He asked him about fasting and he said: “Fasting (the month of) Ramadan.” He said: “Do I have to do anything other than that?” He said: “No.” He mentioned zakah and said: “Do I have to do anything other than that?” He said: “No.” He said: “By Allah, I will do no more and no less than that.” The Messenger of Allah (ﷺ) said: “He will prosper, if he means what he says.”</b>",
        "bookID": "6.0",
        "grade1": "Sahih (Darussalam), al Bukhari (46) and Muslim (11)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 5313180,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5013910,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 6,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1391,
        "hadithText": "It was narrated from Malik bin Aws: I heard `Umar (رضي الله عنه) say to ‘Abdur-Rahman, Talhah, azZubair and Sa`d: “I adjure you by Allah, by Whose power heaven and earth exist [Sufyan said on one occasion: by Whose leave heaven and earth exist], do you know that the Messenger of Allah (ﷺ) said: `We [Prophets] are not to be inherited from ; what we leave behind is charity”. They said: “By Allah, yes.”</b>",
        "bookID": "6.0",
        "grade1": "lts isnad is Sahih, al Bukhari (3094) and Muslim (1757)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 5313190,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5013920,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 6,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1392,
        "hadithText": "It was narrated from Mu`adh bin `Abdur-Rahman bin ‘Uthman at-Taimi that his father said: We were with Talhah bin `Ubaidullah and we were in ihram. A bird was given to him as a gift when Talhah was sleeping. Some of us ate and some of us refrained. When Talhah woke up, he approved of those who had eaten and said: “We ate it with the Messenger of Allah (ﷺ)”.</b>",
        "bookID": "6.0",
        "grade1": "lts isnad is Sahih, Muslim (1197)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 5313200,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5013950,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 6,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1395,
        "hadithText": "It was narrated from Moosa bin Talhah that his father said: The Messenger of Allah (ﷺ) passed by some people who were at the top of the palm trees. He said: `What are these people doing?` They said: “They are pollinating (the trees), putting the male with the female.” He said: `I do not think this can help in any way.” They were told about that and they stopped doing it. News of that reached the Messenger of Allah (ﷺ) and he said: “If it will benefit them, then let them do it. It was only a passing thought. Do not blame me for a mere thought, but if I tell you anything about Allah (may He be glorified and exalted) then accept it from me, for I will never tell a lie about Allah.`</b>",
        "bookID": "6.0",
        "grade1": "Hasan (Darussalam), Muslim (2361)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 5313220,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5013960,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 6,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1396,
        "hadithText": "It was narrated from Moosa bin Talhah, that his father said: I said: “O Messenger of Allah(ﷺ), how do we send blessings upon you?” He said: `Say: O Allah, send Your salah (grace, honour and mercy) upon Muhammad and upon the family of Muhammad, as You sent Your salah upon the family of Ibrahim, You are indeed Praiseworthy, Most Glorious. And send Your blessings upon Muhammad and the family of Muhammad, as You sent Your blessings upon the family of Ibrahim, You are indeed Praiseworthy, Most Glorious.”</b>",
        "bookID": "6.0",
        "grade1": "Qawi (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 5313230,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5013970,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 6,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1397,
        "hadithText": "Bilal bin Yahya bin Talhah bin `Ubaidullah narrated, from his father, from his grandfather that When the Prophet (ﷺ) saw the new moon, he would say: `O Allah, bring it over us with blessing and faith, and with soundness and Islam. My Lord and your Lord is Allah.”</b>",
        "bookID": "6.0",
        "grade1": "Hasan because of corroborating evidence; this is a Da'if isnad]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 5313240,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5013980,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 6,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1398,
        "hadithText": "It was narrated from Moosa bin Talhah, from his father, that The Prophet (ﷺ) said: “Let one of you put something in front of him the height of the back of a saddle, then pray.`</b>",
        "bookID": "6.0",
        "grade1": "Hasan (Darussalam), Muslim (499)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 5313250,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014010,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 6,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1401,
        "hadithText": "It was narrated from `Abdullah bin Shaddad that Three people from Banu ‘Udhrah came to the Prophet (ﷺ) and became Muslim. The Prophet (ﷺ) said: “Who will take care of them?` Talhah said: “I will.” So they stayed with Talhah. The Prophet (ﷺ) sent out an expedition and one of them (these three men) went on that expedition and was martyred. Then he sent out an expedition, and another of them went on that expedition and was martyred. Then the third one died in his bed. Talhah said: “I dreamt that these three people who had stayed with me were in Paradise, and I saw the one who had died in his bed was ahead of them. I saw the one who was martyred last next to him, and I saw the one who was martyred first at the back. I was confused about that so I went to the Prophet (ﷺ) and told him about that. The Messenger of Allah (ﷺ) said: “What did you find so strange about that? No one is better before Allah than a believer who lives longer as a Muslim, because of his fasting, takbeer and tahleel.`</b>",
        "bookID": "6.0",
        "grade1": "Hasan because of corroborating evidence; this is a Da'if isnad]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 5313270,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014020,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 6,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1402,
        "hadithText": "Muhammad bin ‘AbdurRahman bin Mujabbar narrated from his father, from his grandfather, that `Uthman (رضي الله عنه) looked out at those who were besieging him. He greeted them with salam but they did not respond to him. `Uthman (رضي الله عنه) said: “Is Talhah among the people?” Talhah said: “Yes.” He said: “Verily, to Allah we belong and unto Him is our return! I greet people among whom you are and they do not return the greeting.” Talhah said: “I returned the greeting.” `Uthman said: “This is not the way to return the greeting, I made you hear me but you did not make me hear you. O Talhah, I adjure you by Allah, did you hear the Prophet (ﷺ)  say: “The blood of a Muslim is not permissible except in one of three cases: if he disbelieves after believing, or he commits zina after having been married, or he kills a soul and may be killed in return.” Talhah said: “Yes, by Allah.” `Uthman said takbeer, then he said: “By Allah, I have never denied Allah since I came to know Him. I never committed zina during the Jahiliyyah or in Islam. I abstained during the Jahiliyyah because I hated it and in Islam so as to maintain my chastity. And I have never killed anyone in return for which killing me would become permissible.”</b>",
        "bookID": "6.0",
        "grade1": "Hasan because of corroborating evidence; this is a Da'if isnad]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 5313280,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014030,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 6,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1403,
        "hadithText": "It was narrated from Talhah bin `Ubaidullah that Two men came to the Messenger of Allah (ﷺ) and they both became Muslim, but one of them strove harder in worship than his companion. The one who strove hard in worship went out on a military campaign and was martyred. The other one remained for a year after that, then he died. Talhah said: “I saw in a dream that I was at the gate of Paradise, and I saw them both. Someone had come out from Paradise and he gave permission to the one who died last (to enter); then he came out and gave permission to the one who had been martyred. Then they both came back to me and said to me: Go back, for your time has not yet come.” The next morning, Talhah told the people about that and they were amazed by it. News of that reached the Messenger of Allah (ﷺ) and he said: “Why are you amazed?` They said: “O Messenger of Allah, this one strove harder in worship and then was martyred for the sake of Allah, but the other one entered Paradise before him?” He said: `Did he not remain for a year after (the other one) died?” They said: “Yes.” He said: “Did he not live until Ramadan came and fast it?” They said: “Yes.” He said: `Did he not pray this many rak`ahs during that year?` They said: “Yes.” The Messenger of Allah (ﷺ) said: “Verily, the distance between them is the distance between heaven and earth.”</b>",
        "bookID": "6.0",
        "grade1": "Hasan because of corroborating evidence, and its isnad is interrupted]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 5313290,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014040,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 6,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1404,
        "hadithText": "Salim bin Abi Umayyah Ablin-Nadr said: I sat with an old man of Banu Tameem in the mosque of Basrah who had a document in his hand. That was at the time of al-Hajjaj. He said to me: “O slave of Allah, do you think that this document could help me in any way with this governor?” I said: “What is this document?” He said: “This is a document from the Messenger of Allah (ﷺ) which he wrote for us to say that no transgression should be committed against us with regard to our zakah.” I said: “No, by Allah, I do not think that this document will help you at all. But what is the story about this document?” He said: “I came to Madinah with my father when I was a young boy, with some camels of ours to sell. My father was a friend of Talhah bin `Ubaidullah at-Taimi, so we stayed with him. My father said to him: “Come out with me and sell these camels of mine for me.” Talhah said: “The Messenger of Allah (ﷺ) has forbidden townsmen to sell for Bedouins. But I will go out with you and sit with you. Offer your camels for sale and if a man comes and makes you an offer and I think he is honest and sincere, I will tell you to sell to him. So we went out to the marketplace and showed the mounts that we had for sale, and Talhah sat nearby. People made offers to us, then when a man offered what we wanted, my father said to Talhah: “Shall I sell to him?” He said: “Yes, I am sure he is honest. So sell to him.” So we sold to him. Then when we took our money and ended our business, my father said to Talhah: “Ask the Messenger of Allah (ﷺ) for a document for us, stating that no one should transgress against us with regard to our zakah.” (Talhah) said: “This is your right and it is the right of every Muslim.” He said: “Nevertheless, I would like to have a document from the Messenger of Allah(ﷺ).” So he took us out and brought us to the Messenger of Allah (ﷺ) and said: “O Messenger of Allah (ﷺ), this man is a man of the desert and is a friend of ours. He would like you to write a document for him, stating that no one should transgress against him with regard to his zakah.” The Messenger of Allah (ﷺ) said: `That is his right and it is the right of every Muslim.” He said: “O, Messenger of Allah, he would like to have something from you in writing concerning that.” So the Messenger of Allah (ﷺ) wrote this document for us.”</b>",
        "bookID": "6.0",
        "grade1": "Hasan (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 5313300,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5013931,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 6,
        "bookName": "",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 1393,
        "hadithText": "It was narrated from Moosa bin Talhah that his father said: “The Messenger of Allah (ﷺ) was asked: “What will serve as a screen (sutrah) for one who is praying?” He said: `Something the height of the back of a saddle.”\n\n<p>\nA similar report was narrated from Moosa bin Talhah, from his father, from the Prophet (ﷺ).  a  similar report</b>",
        "bookID": "6.0",
        "grade1": "Hasan (Darussalam), Muslim (499)] Hasan (Darussalam), Muslim (499)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 5313210,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5013991,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 6,
        "bookName": "",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1399,
        "hadithText": "It was narrated from Simak that he heard Moosa bin Talhah narrate that his father said: I was with the Prophet (ﷺ) and he passed by some palm trees of Madinah, and he saw some people at the top of the palm trees who were pollinating them. He said: “What are these people doing?` [Talhah] said: “They are taking (pollen) from the male and putting it in the female, to fertilise it.” He said: `I do not think this can help in any way.” News of that reached them, so they stopped doing that and came down from the trees, which did not bear any fruit that year as a result. News of that reached the Prophet (ﷺ) and he said: “It was only a thought that crossed my mind. If it helps in any way, then do it. I am only human, just like you, and thoughts may be right or wrong. But if I tell you that Allah, May He be glorified and exalted, said something, I will never tell a lie about Allah, may He be glorified and exalted.”\n\nIt was narrated from Moosa bin Talhah ( and he narrated a similar report.)  a similar report</b>",
        "bookID": "6.0",
        "grade1": "lts isnad is Hasan, Muslim(2361)] Hasan (Darussalam) - as the previous report]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 5313260,
        "last_updated": "2020-08-11 18:16:03"
    }
]