[
    {
        "englishURN": 5014050,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1405,
        "hadithText": "It was narrated that az-Zubair said: When the verse, `Then, on the Day of Resurrection, you will be disputing before your Lord” (az-Zumar [39:31]) was revealed, az-Zubair said: “O Messenger of Allah (ﷺ), (is this) in addition to our disputes in this world?” He said: `Yes.` When the verse, `Then on that Day you shall be asked about the delights (you indulged in, in this world)” (at-Takathur [102:8]) was revealed, az-Zubair said: “O Messenger of Allah (ﷺ), what delights will we be asked about? All we have is the two black ones - dates and water.” He said: `This will certainly take place.”</b>",
        "bookID": "7.0",
        "grade1": "Hasan (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 5313310,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014060,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1406,
        "hadithText": "It was narrated from Malik bin Aws: I heard `Umar (رضي الله عنه) say to ‘Abdur-Rahman, Talhah, az-Zubair and Sa`d: “I adjure you by Allah, by Whose power heaven and earth exist (Sufyan said on one occasion: by Whose leave heaven and earth exist), do you know that the Messenger of Allah (ﷺ) said: `We (Prophets) are not to be inherited from; what we leave behind is charity`. They said: “By Allah, yes.”</b>",
        "bookID": "7.0",
        "grade1": "Sahih (Darussalam), al-Bukhari (3094) and Muslim (1757) without mentioning Talhah]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 5313320,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014070,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1407,
        "hadithText": "It was narrated that az-Zubair bin al-`Awwam said: The Messenger of Allah (ﷺ) said: “Verily, for a man to carry a rope and gather firewood, then come and sell it in the marketplace and make himself independent of means thereby, so that he can spend on his (needs), is better than him asking people, whether they give him anything or not.”</b>",
        "bookID": "7.0",
        "grade1": "Sahih (Darussalam), al Bukhari (1471)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 5313330,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014080,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1408,
        "hadithText": "It was narrated that az-Zubair said: The Messenger of Allah (ﷺ) mentioned both of his parents together for me on the Day of ‘Uhud (i.e., in the phrase “may my father and mother be sacrificed for you`.]</b>",
        "bookID": "7.0",
        "grade1": "Sahih (Darussalam) according to the conditions of al Bukhari and Muslim]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 5313340,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014090,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1409,
        "hadithText": "It was narrated that `Abdullah bin az-Zubair said: On the day of al-Khandaq, `Umar bin Abi Salamah and I were in the fort where the wives of the Messenger of Allah (ﷺ) were, the fort of Hassan. He would lift me up and I would lift him up. When he lifted me up, I saw my father go past on his way to Quraizah, as he was fighting alongside the Messenger of Allah (ﷺ) on the day of al-Khandaq. He said: “Who will go to Banu Quraizah and fight them?” I said to him when he came back: “O my father, I recognized you when you were going to Banu Quraizah.” He said: “O my son, by Allah, the Messenger of Allah(ﷺ) mentioned both his parents together for me when he said: May my father and mother be sacrificed for you.`</b>",
        "bookID": "7.0",
        "grade1": "Sahih (Darussalam), al Bukhari (3720) and Muslim (2416)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 5313350,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014100,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1410,
        "hadithText": "It was narrated from az-Zubair bin al-`Awwam that a man gave a mare called Ghamrah or Ghamra` [for jihad], then he found a horse or a colt for sale which was said to be from that mare, but he was told not to buy it.</b>",
        "bookID": "7.0",
        "grade1": "lts isnad is Sahih]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 5313360,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014110,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1411,
        "hadithText": "It was narrated that az-Zubair bin al-`Awwam (رضي الله عنه) said: We used to pray Jumu’ah with the Prophet (ﷺ), then we would leave and seek the shade of the fortress, but we would not find any shade except (an area) the width of our feet.</b>",
        "bookID": "7.0",
        "grade1": "Sahih because of corroborating evidence; this is a Da'if isnad because it is interrupted]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 5313370,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014120,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1412,
        "hadithText": "It was narrated that az-Zubair bin al-`Awwam (رضي الله عنه) said: The Messenger of Allah (ﷺ) said: “There has come to you the disease of the nations before you, jealousy and hatred. Hatred is the `shaver` (destroyer) that shaves (destroys) religious commitment; it does not shave hair. By the One in Whose Hand is the soul of Muhammad, you will not believe until you love one another. Shall I not tell you something which, if you do it, you will love one another? Spread (the greeting of) salam amongst yourselves.”</b>",
        "bookID": "7.0",
        "grade1": "The Hadeeth is Hasan because of corroborating evidence and its isnad is interrupted]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 5313380,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014130,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1413,
        "hadithText": "It was narrated from `Amir bin `Abdullah bin az-Zubair that his father said: I said to az-Zubair (رضي الله عنه): “Why don`t I hear you narrating from the Messenger of Allah (ﷺ) as I hear Ibn Mas`ood and so and so, and so and so?” He said: “I never left him since I became Muslim, but I heard something from him: `Whoever tells a lie about me deliberately, let him take his place in Hell.””</b>",
        "bookID": "7.0",
        "grade1": "Sahih (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 5313390,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014140,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1414,
        "hadithText": "It was narrated that Mutarrif said: We said to az-Zubair (رضي الله عنه): “O Abu `Abdullah, what brought you here? You let the caliph down until he was killed, then you came seeking vengeance for him?” Az-Zubair (رضي الله عنه) said: “At the time of the Prophet (ﷺ), Abu Bakr, `Umar and `Uthman and me, we read the verse: “And fear the Fitnah (affliction and trial) which affects not in particular (only those) of you who do wrong (but it may afflict all the good and the bad people).” [al-Anfal 8:25]. But we never knew that it referred to us until the turmoil befell us.”</b>",
        "bookID": "7.0",
        "grade1": "Its isnad is Jayyid]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 5313400,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014150,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1415,
        "hadithText": "It was narrated that az-Zubair (رضي الله عنه) said: The Messenger of Allah (ﷺ) said: “Change grey hair, and do not resemble the Jews.`</b>",
        "bookID": "7.0",
        "grade1": "Hasan because of corroborating evidence and Da'if (Darussalam)]    ",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 5313410,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014160,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1416,
        "hadithText": "It was narrated that az-Zubair (رضي الله عنه) said: We came from Liyyah with the Messenger of Allah (ﷺ) and when we reached Sidrah, the Messenger of Allah (ﷺ) stood at one side of Qarnul-Aswad, facing it, then he turned his gaze towards Nakhibah (i.e., a valley) and he waited until all the people had stopped too. Then he said: `Hunting in Wajj and cutting down its plants is haram; it is sacred to Allah.” That was before he came to at-Ta`if and besieged Thaqeef.</b>",
        "bookID": "7.0",
        "grade1": "Da'if (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 5313420,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014170,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1417,
        "hadithText": "It was narrated that az-Zubair (رضي الله عنه) said: I heard the Messenger of Allah (ﷺ) say one day: `Paradise is due to Talhah,` when he did what he did for the Messenger of Allah (ﷺ)(i.e., when Talhah leaned down and the Messenger of Allah (ﷺ) climbed on his back.)</b>",
        "bookID": "7.0",
        "grade1": "Hasan (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 5313430,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014180,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1418,
        "hadithText": "It was narrated that ‘Urwah said: My father az-Zubair (رضي الله عنه) told me that on the day of Uhud, a woman came running, and when she was about to reach where the slain were, the Prophet (ﷺ) did not want her to see them, and he said, `The woman, the woman!` az-Zubair (رضي الله عنه) said: “I thought that she was my mother Safiyyah, so I went running towards her and caught up with her before she reached the slain. She shoved me in the chest, and she was a tough woman.” She said: “Stay away from me, may you have no land!” I said: “The Messenger of Allah (ﷺ) is urging you (not to go and see them).” She stopped and took out two pieces of cloth that she had with her and said: “These are two pieces of cloth that I have brought for my brother Hamzah. I have heard that he has been killed; shroud him with them.” We brought the two pieces of cloth to shroud Hamzah with them, but we saw beside him one of the Ansar who had been killed, and the same had been done to him as to Hamzah. We did not feel it was appropriate to shroud Hamzah in two pieces of cloth and to leave the Ansari with no shroud, so we said: “One piece for Hamzah and one piece for the Ansari.” We measured (the pieces of cloth) and found that one of them was larger, so we drew lots between them and shrouded each of them in the piece of cloth that was selected for him.</b>",
        "bookID": "7.0",
        "grade1": "lts isnad is Hasan]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 5313440,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014190,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1419,
        "hadithText": "It was narrated that az-Zuhri said: ’Urwah bin az-Zubair told me that az-Zubair (رضي الله عنه) used to narrate that he referred to the Prophet (ﷺ), a dispute with an Ansari man who had been present at Badr about the streams of the Harrah, with which they both used to irrigate their palm trees. The Prophet (ﷺ) said to az-Zubair (رضي الله عنه): `Water (your trees), then let the water flow to your neighbour.` The Ansari got angry and said: “O Messenger of Allah, it is because he is your cousin!” The face of the Messenger of Allah (ﷺ) changed colour, then he said to az-Zubair: “Water (your trees), then block the water until it backs up to the bottom of the wall.” So the Prophet (ﷺ)  told az-Zubair (رضي الله عنه) to take all of his rights in full. Before that, the Prophet (ﷺ) had suggested to az-Zubair (رضي الله عنه) something that would be good for both him and the Ansari, but when the Ansari annoyed the Messenger of Allah (ﷺ), he told az-Zubair to take his rights in full in a clear ruling. `Urwah said: “az-Zubair (رضي الله عنه) said: By Allah, I think that this verse was revealed concerning that: But no, by your Lord, they can have no Faith, until they make you (O Muhammad (ﷺ)) judge in all disputes between them, and find in themselves no resistance against your decisions, and accept (them) with full submission` (an-Nisa` [4:65]).”</b>",
        "bookID": "7.0",
        "grade1": "Sahih (Darussalam), al-Bukhari (2708) and Muslim (2357)] ",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 5313450,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014200,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1420,
        "hadithText": "It was narrated that azZubair bin al-`Awwam (رضي الله عنه) said: The Messenger of Allah (ﷺ) said: `This land is the land of Allah and the people are the slaves of Allah, so wherever you find something good, stay there.`</b>",
        "bookID": "7.0",
        "grade1": "lts isnad is Da'if]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 5313460,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014210,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1421,
        "hadithText": "It was narrated that azZubair bin al-`Awwam (رضي الله عنه) said: I heard the Messenger of Allah (ﷺ) recite this verse when he was in ‘Arafah: `Allah bears witness that La ilaha illa Huwa (none has the right to be worshipped but He), and the angels, and those having knowledge (also give this witness); (He always) maintains His creation in justice. La ilaha illa Huwa (none has the right to be worshipped but He), the All-Mighty, the All-Wise” (Surah AI-‘Imran [3:18]). And I am one of the witnesses to that, O Lord.”</b>",
        "bookID": "7.0",
        "grade1": "Da'if (Darussalam) like the previous report]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 5313470,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014220,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1422,
        "hadithText": "Abdullah bin `Ata, the son of Ibraheem the freed slave of azZubair narrated that his mother and his grandmother Umm ‘Ata said: By Allah, it is as if we can see az-Zubair bin al-`Awwam (رضي الله عنه) when he came to us on a white mule of his and said: “O Umm ‘Ata, the Messenger of Allah (ﷺ) has forbidden the Muslims to eat from the meat of their sacrifices after three days.” I said: “May my father be sacrificed for you! What should we do with that which has been given to us?” He said: “As for what has been given to you, it is up to you.”</b>",
        "bookID": "7.0",
        "grade1": "Da'if (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 5313480,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014230,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1423,
        "hadithText": "It was narrated that `Abdullah bin az-Zubair (رضي الله عنه) said: On the day of al-Ahzab, `Umar bin Abi Salamah and I were put with the women. I looked out and saw az-Zubair on his horse, coming and going from Banu Quraizah two or three times. When he came back I said: “O my father, I saw you coming and going.” He said: “Did you see me, O my son?” I said: “Yes.” He said: “The Messenger of Allah (ﷺ) said: `Who would like to go to Banu Quraizah and bring me news of them?` So I set out and when I came back, the Messenger of Allah (ﷺ) mentioned both his father and his mother for me and said: `May my father and mother be sacrificed for you.”</b>",
        "bookID": "7.0",
        "grade1": "Sahih (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 5313490,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014240,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1424,
        "hadithText": "Sufyan bin Wahb al Khawlani said: When we conquered Egypt without a peace deal (i.e., by force), az-Zubair bin al-`Awwam (رضي الله عنه) stood up and said: “O `Amr bin al `As, divide the land.” `Amr said: “I shall not divide it.” az-Zubair (رضي الله عنه) said: “By Allah, you will divide it as the Messenger of Allah (ﷺ) divided Khaibar!” ‘Amr said: “By Allah, I shall not divide it until I write to Ameer al-Mu`mineen.” So he wrote to `Umar (رضي الله عنه) and `Umar wrote back to him (saying}, Leave it so that the third generation (i.e., the offspring of the foetuses currently in their mother`s wombs) may use the income from it to go out on campaign for the sake of Allah.</b>",
        "bookID": "7.0",
        "grade1": "Da'if (Darussalam) []",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 5313500,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014250,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1425,
        "hadithText": "It was narrated from al Mundhir bin az-Zubair (رضي الله عنه) from his father that The Prophet (ﷺ) gave a share to az-Zubair, a share to his mother, and two shares to his horse.</b>",
        "bookID": "7.0",
        "grade1": "Hasan because of corroborating evidence and this is a Da'if isnad, Fulaih is unknown] ",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 5313510,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014280,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1428,
        "hadithText": "It was narrated from’`Amir bin ‘Abdullah bin az-Zubair (رضي الله عنه) that his father said: I said to my father, az-Zubair bin al-Awwam (رضي الله عنه): “Why don`t you narrate from the Messenger of Allah (ﷺ).” He said: “I never left him since I became Muslim, but I heard him say something. He said: Whoever tells a lie about me, let him take his place in Hell.`</b>",
        "bookID": "7.0",
        "grade1": "Sahih (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 5313530,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014290,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1429,
        "hadithText": "Hisham bin `Urwah narrated from his father, that his grandfather Ibn Numair said that az-Zubair (رضي الله عنه) said: The Messenger of Allah (ﷺ) said: “For one of you to take a rope and go to the mountains, then bring a bundle of firewood on his back and sell it, and make himself independent of means thereby, is better for him than to ask of people, whether they give him something or not.”</b>",
        "bookID": "7.0",
        "grade1": "Sahih (Darussalam), al Bukhari (1471)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 5313540,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014330,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1433,
        "hadithText": "It was narrated that al-Hasan said: A man said to az-Zubair: “Shall I kill `Ali for you?” He said: “How would you kill him?” He said: “I will assassinate him.”He said: “No, the Messenger of Allah (ﷺ) said: Faith prohibits assassination; no believer should resort to that.`</b>",
        "bookID": "7.0",
        "grade1": "Sahih]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 5313560,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014340,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1434,
        "hadithText": "It was narrated that az-Zubair bin al-`Awwam (رضي الله عنه) said: When this surah was revealed to the Messenger of Allah (ﷺ): `Verily, you (O Muhammad is) will die, and verily, they (too) will die. Then, on the Day of Resurrection, you will be disputing before your Lord” (az-Zumar [39:30,31]), az-Zubair said: “O Messenger of Allah, will we face again the disputes we had among us in this world in addition to other sins?” He said: “Yes, you will face these disputes again until everyone who has a right has been given his right.” AzZubair said: “By Allah, the matter is very serious.”</b>",
        "bookID": "7.0",
        "grade1": "Hasan (Darussalam)] ",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 5313570,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014350,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1435,
        "hadithText": "`Urwah said: I heard ‘lkrimah (recite): “And (remember) when We sent towards you (Muhammad (ﷺ)” and it was recited to Sufyan from az-Zubair, `a group (three to ten persons) of the jinn, (quietly) listening to the Qur`an` (al-Ahqaf [46:29]). He said: “[That was] in Nakhlah. The Messenger of Allah (ﷺ) was praying Isha`, and they (the jinn) just made round him a dense crowd as if sticking one over the other (in order to listen to the Prophet’s (ﷺ) recitation)” (al-Jinn [72:19]). Sufyan said: “They were one above the other, like thick masses of clouds one above the other.”</b>",
        "bookID": "7.0",
        "grade1": "Hasan because of corroborating evidence and Da'if (Darussalam) because it is interrupted between Ikrimah and Az-Zubair]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 5313580,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014360,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1436,
        "hadithText": "Muslim bin Jundub narrated: Someone who heard him told me that az-Zubair bin al ‘Awwam (رضي الله عنه) said: “We used to pray Jumu’ah with the Prophet (ﷺ), then we would leave and seek the shade of the fortress, but we would not find any shade except (an area) the width of our feet.</b>",
        "bookID": "7.0",
        "grade1": "Sahih because of corroborating evidence; this is a Da'if isnad because the chain between Muslim bin Jundab and Az-Zubair is unknown)",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 5313590,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014370,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1437,
        "hadithText": "It was narrated that ‘Ali or az-Zubair said: The Messenger of Allah (ﷺ) used to address us and remind us of the annals of Allah, until we could see that on his face (because of alarm). It was as if he was warning people against an enemy that would attack them in the morning. If he had just recently met with Jibreel, he would not smile until Jibreel had departed from him.</b>",
        "bookID": "7.0",
        "grade1": "Hasan (Darussalam)]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 5313600,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014380,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1438,
        "hadithText": "Az-Zubair bin al-’Awwam (رضي الله عنه) said: This verse was revealed when we were present with the Messenger of Allah (ﷺ) : `And fear the Fitnah (affliction and trial) which affects not in particular (only) those of you who do wrong (but it may afflict all the good and the bad people)`. (al-Anfal [8:25]). We started saying: “What is this fitnah? And we never thought that it would happen as it did.”</b>",
        "bookID": "7.0",
        "grade1": "This hadeeth is Jayyid]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 5313610,
        "last_updated": "2020-06-07 23:43:08"
    },
    {
        "englishURN": 5014261,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1426,
        "hadithText": "Al-Hasan narrated: A man came to az-Zubair bin al-’Awwam (رضي الله عنه) and said: “Shall I kill `Ali for you?” He said: “No; how can you kill him when he has the troops with him?” He said: “I will catch up with him and assassinate him.” He said: “No. The Messenger of Allah (ﷺ) said: Faith prohibits assassination; no believer should resort to that.”\n\nAl-Hasan said:  A man came to az-Zubair bin al-`Awwam (رضي الله عنه) and said: “Shall I not kill `Ali for you?” He said: “How can you kill him when he has people with him?” (and he narrated a similar report.)</b>",
        "bookID": "7.0",
        "grade1": "Sahih], Sahih]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 5313520,
        "last_updated": "2020-08-16 21:43:49"
    },
    {
        "englishURN": 5014302,
        "collection": "ahmad",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1430,
        "hadithText": "Ya`eesh bin al-Waleed narrated that a freed slave of the family of az-Zubair told him that azZubair bin al-`Awwam (رضي الله عنه) narrated to him that The Messenger of Allah (ﷺ) said: “There has come to you the disease of the nations before you, jealousy and hatred. Hatred is the `shaver` (destroyer). I do not say that it shaves hair; rather its shaves (destroys) religious commitment. By the One in Whose Hand is the soul of Muhammad, you will not enter Paradise until you believe, and you will not believe until you love one another. Shall I not tell you of something that will help you to achieve that? Spread (the greeting of) salaam amongst yourselves.`\n\nIt was narrated from Ya`eesh bin al-Waleed that a freed slave of the family of az-Zubair told him that az-Zubair (رضي الله عنه) told him: The Prophet (ﷺ)  said: “There has come to you.” and he narrated it.\n\nIt was narrated from a freed slave of the family of az-Zubair (رضي الله عنه) that az-Zubair bin al-`Awwam (رضي الله عنه) told him that The Messenger of Allah (ﷺ) said: “There has come to you...` and he narrated it,</b>",
        "bookID": "7.0",
        "grade1": "Da'if (Darussalam)], See the previous report], See the previous report]",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 5313550,
        "last_updated": "2020-08-16 21:45:51"
    }
]