[
    {
        "englishURN": 5720010,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 198,
        "hadithText": "‘Abdallah b. ‘Amr reported God’s messenger as saying, “Pass on information from me, even if it is only a verse of the Qur’an; and relate traditions from the Bani Isra'il, for there is no restriction; but let him who deliberately lies against me come to his abode in hell.” \nBukhari transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 5601980,
        "last_updated": "2020-07-15 16:34:01"
    },
    {
        "englishURN": 5720020,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 199,
        "hadithText": "Samura b. Jundub and al-Mughira b. Shu'ba reported God’s messenger as saying, “If anyone relates a tradition from me thinking that \nit is false, he is one of the liars.” Muslim transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 5601990,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720030,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 200,
        "hadithText": "Mu'awiya reported God’s messenger as saying, “When God wishes \ngood for anyone He instructs him in the religion. I am only a distributor; God gives.” (Bukhari and Muslim.)</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 5602000,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720040,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 201,
        "hadithText": "Abu Huraira reported God's messenger as saying, “Men are of\ndifferent origins just as gold and silver are; the best among them in\nthe pre-Islamic period are the best among them in Islam when they are \nversed in the religion.” Muslim transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 5602010,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720050,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 202,
        "hadithText": "Ibn Mas'ud reported God’s messenger as saying, “Two people only\nmay be envied: a man to whom God has given property, empowering \nhim to dispose of it on what is right; and a man to whom God has given\nwisdom who acts according to it and teaches it.” (Bukhari and Muslim).</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 5602020,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720060,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 203,
        "hadithText": "Abu Huraira reported God’s messenger as saying, “When a man \ndies no further reward is recorded for his actions, with three exceptions:\n<i>sadaqa</i> which continues to be supplied, or knowledge from which benefit\ncontinues to be reaped, or the prayers of a good son for his dead father.”\nMuslim transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 5602030,
        "last_updated": "2020-07-15 05:26:01"
    },
    {
        "englishURN": 5720070,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 204,
        "hadithText": "He also reported God’s messenger as saying, “ If anyone removes \none of the anxieties of this world from a believer, God will remove one \nof the anxieties of the day of resurrection from him; if one smooths\nthe way for one who is destitute, God will smooth the way for him in\nthis world and the next; and if anyone conceals the faults of a Muslim,\nGod will conceal his faults, in this world and the next. God helps a\nman as long as he helps his brother. If anyone pursues a path in\nsearch of knowledge, God will thereby make easy for him a path to paradise. No company will gather in a mosque to recite God’s Book and\nstudy it together without calmness descending on them, mercy covering\nthem, the angels surrounding them, and God mentioning them among\nthose who are with Him. But he who is made slow by his actions will\nnot be speeded by his genealogy.” Muslim transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 5602040,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720080,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 205,
        "hadithText": "He also reported God’s messenger as saying, “The first person to\nbe judged on the day of resurrection will be a man who died as a martyr.\nHe will be brought forward, and after God has reminded him of the\nfavour He showed him and the man acknowledges it, He will ask,\n‘What did you do to show gratitude for it?’ The man will reply, ‘I\nfought for Thy cause till I was martyred.’ God will say, ‘You lie. You\nfought that people might call you courageous, and they have done so.’\nCommand will then be issued about him, and he will be dragged on his\nface and thrown into hell. Next a man who has acquired and taught\nknowledge and read the Qur’an will be brought forward, and after God\nhas reminded him of the favour He showed him and the man acknowledges\nit, He will ask, ‘What did you do to show gratitude for it?’ The man\nwill reply, ‘I acquired and taught knowledge and read the Qur’an for\nThy sake.’ God will say, 'You lie. You acquired knowledge that people\nmight call you learned, and you read the Qur’an that they might call\nyou a reader, and they have done so.’ Command will then be issued\nabout him, and he will be dragged on his face and thrown into hell.\nNext a man whom God has made affluent and whom He has given all kinds\nof property will be brought forward, and after God has reminded him\nof the favour He showed him and the man acknowledges it, He will ask,\n‘What did you do to show gratitude for it?’ The man will reply, ‘I\nhave not neglected to give liberally for Thy sake to all the causes\napproved by Thee for this purpose.’ God will say, ‘You lie. You did\nit that people might call you generous, and they have done so.’ Command will then be issued about him, and he will be dragged on his face\nand thrown into hell.” Muslim transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 5602050,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720090,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 206,
        "hadithText": "‘Abdallah b. ‘Amr reported God’s messenger as saying, “God does\nnot take away knowledge by removing it from men, but takes it away\nby taking away the learned, so that when He leaves no learned man, men\nwill take ignorant men as leaders. Causes will be presented to them\nand they will pass judgement without knowledge, erring and leading\nothers into error.” (Bukhari and Muslim.)</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 5602060,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720100,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 207,
        "hadithText": "Shaqiq said that ‘Abdallah b. Mas'ud used to exhort the people\nevery Thursday. A man said, “ I wish, Abu ‘Abd ar-Rahman [This is Ibn Mas`ud’s <i>kunya</i>], that you\nwould give us a daily exhortation.” He replied, “My dislike of wearying you prevents me from that, so I am considerate in my exhortations\nto you as God’s messenger was to us for fear of causing us aversion.”\n(Bukhari and Muslim.)</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 5602070,
        "last_updated": "2020-07-15 05:26:23"
    },
    {
        "englishURN": 5720110,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 208,
        "hadithText": "Anas said that when the Prophet made a statement he repeated it\nthree times so that it would be understood, and that when he met a company and gave them a salutation he did it three times. Bukhari\ntransmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 5602080,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720120,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 209,
        "hadithText": "Abu Mas'ud al-Ansari told of a man who came to the Prophet and\nsaid, “My camel has become jaded, so give me a mount.” On his replying that he had none, a man said, “Messenger of God, I can guide him\nto one who will give him a mount.” God’s messenger then said, “He\nwho guides to what is good will have a reward equivalent to that of him\nwho does it.” Muslim transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 5602090,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720130,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 210,
        "hadithText": "Jarir said that: One early morning when they were with God’s messenger some people came to him who were scantily clad, wearing striped\nwoollen garments,* with swords over their shoulders; most, nay all of\nthem, belonging to Mudar. God’s messenger showed signs of anger on\nhis face because of the poverty-stricken state in which he saw them,\nand went in. After a little he came out and gave orders to Bilal who\nuttered the call to prayer and announced that the time to begin prayer\nhad come. When the Prophet had prayed, he delivered an address in \nwhich he said, “ ‘Fear your Lord, people, who created you from one\nsoul . . . God watches over you.’[Qur’an, iv, 1] ‘Fear God, and let a soul look to\nwhat it has sent forward for the morrow. [Ibid., lix, 18] Let a man give <i>sadaqa</i>\nfrom his dinars and dirhams, his clothing, his <i>sa‘</i> of wheat and <i>sa‘</i> of\ndates, even if it is only half a date.” Jarir said: One of the Ansar\nbrought a purse which was almost too big for his hand to hold, indeed\nit was too big. Then people came one after the other till I saw two\nmounds of food and clothing, with the result that I saw the face of God’s\nmessenger glowing as if it were golden. He then said, “If anyone establishes a good <i>sunna</i> in Islam he will have a reward for it and the\nequivalent of the rewards of those who act upon it after him, without\ntheirs being diminished in any respect; but he who establishes a bad\n<i>sunna</i> in Islam will bear the responsibility of it and the responsibility\nof those who act upon it after him, without theirs being diminished in\nany respect.” Muslim transmitted it. \n*[The text has <i>an-nimar au al-'aba</i>, thus giving an alternative word. This is not indicated in\nthe translation above.]</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 5602100,
        "last_updated": "2020-07-15 07:33:47"
    },
    {
        "englishURN": 5720140,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 211,
        "hadithText": "Ibn Mas'ud reported God’s messenger as saying, “No life is taken\nunjustly without a portion of its blood being laid at the door of Adam’s\nfirst son, because he was the first to introduce murder.” (Bukhari and\nMuslim). We shall mention the tradition from Mu'awiya, “A section of\nmy people will continue .. .”* in the chapter on the reward of this\npeople, if God will.\n*Book XXV, Chap. xli. The wording is slightly different.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 5602110,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720150,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 212,
        "hadithText": "Kathir b. Qais told how, when he was sitting with Abu Darda' in\nthe mosque of Damascus, a man came to him and said, “Abu Darda',\nI have come to you from the town of the Messenger for a tradition I have\nheard that you relate from God's messenger. I have come for no other\npurpose.” He replied that he had heard God’s messenger say, “ If anyone travels on a road in search of knowledge God will cause him to\ntravel on one of the roads of paradise, the angels will lower their wings\nfrom good pleasure with one who seeks knowledge, and the inhabitants\nof the heavens and the earth and the fish in the depth of the water will\nask forgiveness for him. The superiority of the learned man over the\ndevout man is like that of the moon on the night when it is full over the\nrest of the stars. The learned are the heirs of the prophets who leave\nneither dinar nor dirham, leaving only knowledge, and he who accepts it\naccepts an abundant portion.” Ahmad, Tirmidhi, Abu Dawud, Ibn Majah\nand Darimi transmitted it, Tirmidhi calling Him Qais b. Kathir.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 5602120,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720160,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 213,
        "hadithText": "Abu Umama al-Bahili said that: Two men, one learned and the\nother devout, were mentioned to God’s messenger, who then said, “The\nsuperiority of the learned man over the devout man is like mine over\nthe most contemptible among you,” adding, “God, His angels, the inhabitants of the heavens and the earth, even the ant in its hole and even\nthe fish invoke blessings on him who teaches men what is good.”\nTirmidhi transmitted it. \n\nDarimi transmitted it from Makhul in <i>mursal</i>\nform, but did not mention the two men. He said, “The superiority of\nthe learned man over the devout man is like mine over the most contemptible among you.” Then he recited this verse, “Only those of His\nservants who are learned fear God,\" (35:28) <sup>1</sup> then went on with the tradition to\nthe end.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 5602131,
        "last_updated": "2020-07-15 07:34:08"
    },
    {
        "englishURN": 5720170,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 214,
        "hadithText": "Abu Sa'id al-Khudri reported God’s messenger as saying, “ People\nwill follow you, and men will come to you from all regions of the earth\nseeking understanding about the religion; so when they come to you,\ngive them good counsel.” Tirmidhi transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 5602150,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720180,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 215,
        "hadithText": "Abu Huraira reported God's messenger as saying, “A word which\ncontains wisdom is the stray beast* of the wise man, so wherever he finds\nit he is most entitled to it.” Tirmidhi and Ibn Majah transmitted it,\nTirmidhi saying that this is a <i>gharib</i> tradition and that Ibrahim b. al-Fadl the transmitter is declared to be weak in tradition.\n*i.e. something to be sought.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 5602160,
        "last_updated": "2020-07-15 07:34:38"
    },
    {
        "englishURN": 5720190,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 216,
        "hadithText": "Ibn ‘Abbas reported God’s messenger as saying, “One <i>faqih</i> has\nmore power over the devil than a thousand devout men.” Tirmidhi and\nIbn Majah transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 5602170,
        "last_updated": "2020-07-15 07:34:45"
    },
    {
        "englishURN": 5720200,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 217,
        "hadithText": "Anas reported God’s messenger as saying, “The search for knowledge is an obligation laid on every Muslim, but he who commits it to\nthose who are unworthy of it is like one who puts necklaces of jewels,\npearls and gold on swine.” Ibn Majah transmitted it. Baihaqi transmitted it in <i>Shu'ab al-iman</i> up to the word “Muslim”, saying that this\nis a tradition whose text is well known but whose <i>isnad</i> is weak, it being\ntransmitted by many ways all of which are weak.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 5602180,
        "last_updated": "2020-07-15 07:34:55"
    },
    {
        "englishURN": 5720210,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 218,
        "hadithText": "Abu Huraira reported God’s messenger as saying, “Two qualities\nare not found together in a hypocrite: good behaviour and knowledge\nof religion.” Tirmidhi transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 5602190,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720220,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 219,
        "hadithText": "Anas reported God’s messenger as saying, “He who goes out in\nsearch of knowledge is in God’s path till he returns.” Tirmidhi and\nDarimi transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 5602200,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720230,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 220,
        "hadithText": "Sakhbara al-Azdi reported God’s messenger as saying, “If anyone\nseeks knowledge, it will be an atonement for past sins.” Tirmidhi and\nDarimi transmitted it, Tirmidhi saying that this is a tradition whose\n<i>isnad</i> is weak, and that Abu Dawud the transmitter is declared to be\nweak.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 5602210,
        "last_updated": "2020-07-15 07:35:06"
    },
    {
        "englishURN": 5720240,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 221,
        "hadithText": "Abu Sa'id al-Khudri reported God’s messenger as saying, “A believer will never be satisfied with the good he hears till he reaches\nparadise.” Tirmidhi transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 5602220,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720250,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 222,
        "hadithText": "Abu Huraira reported God’s messenger as saying, “He who is\nasked about something he knows and conceals it will have a bridle of fire\nput on him on the day of resurrection.” Ahmad, Abu Dawud and\nTirmidhi transmitted it, and Ibn Majah transmitted it from Anas.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 5602231,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720260,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 223,
        "hadithText": "Ka'b b. Malik reported God’s messenger as saying, “If anyone\nseeks knowledge to use it in vying with the learned, or disputing with\nthe foolish, or to attract men’s attention to himself, God will bring him\ninto hell.” Tirmidhi transmitted it, and Ibn Majah transmitted it from\nIbn ‘Umar.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 5602251,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720270,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 224,
        "hadithText": "Abu Huraira reported God’s messenger as saying, “If anyone\nacquires knowledge of things by which God’s good pleasure is sought,\nbut acquires it only to get some worldly advantage, he will not experience the <i>‘arf</i>, i.e. the odour, of paradise on the day of resurrection.”\nAhmad, Abu Dawud and Ibn Majah transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 5602270,
        "last_updated": "2020-07-15 07:35:18"
    },
    {
        "englishURN": 5720280,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 225,
        "hadithText": "Ibn Mas'ud reported God’s messenger as saying, “God brighten a\nman who hears what I say, gets it by heart, retains it, and passes it on\nto others! Many a bearer of knowledge is not versed in it, and many a\nbearer of knowledge conveys it to one who is more versed than he is.\nThere are three things on account of which no rancour enters a Muslim's\nheart: sincere action for God’s sake, good counsel to Muslims, and hold-\ning fast to their community, for their invitation includes those who are\nbeyond them.” Shafi‘i transmitted it, also Baihaqi in <i>al-Madkhal</i>.\n\nAhmad, Tirmidhi, Abu Dawud, Ibn Majah and Darimi transmitted it from\nZaid b. Thabit, but Tirmidhi and Abu Dawud did not mention, “There\nare three things on account of which no rancour enters...\" to the end.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 5602281,
        "last_updated": "2020-07-15 06:27:58"
    },
    {
        "englishURN": 5720290,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 226,
        "hadithText": "Ibn Mas'ud said that he heard God’s messenger saying, “God\nbrighten a man who hears something from us and conveys it to others\nas he heard it, for many a one to whom it is brought retains it better\nthan the one who heard it.” Tirmidhi and Ibn Majah transmitted it,\nand Darimi transmitted it from Abu Darda'.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 5602301,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720300,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 227,
        "hadithText": "Ibn ‘Abbas reported God’s messenger as saying, “Be on your guard\nabout tradition from me, except what you know; for he who lies about\nme deliberately will certainly come to his abode in hell.” Tirmidhi\ntransmitted it, and Ibn Majah transmitted it from Ibn Mas'ud and Jabir,\nbut did not mention, “ Be on your guard about tradition from me, except\nwhat you know.”</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 5602321,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720310,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 228,
        "hadithText": "Ibn ‘Abbas reported God’s messenger as saying, “Let him who\ninterprets the Qur’an in the light of his opinion come to his abode\nin hell.” A version has, “Let him who interprets the Qur’an without\nknowledge come to his abode in hell.” Tirmidhi transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 5602340,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720320,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 229,
        "hadithText": "Jundub reported God’s messenger as saying, “ If anyone interprets\nthe Qur’an in the light of his own opinion and is right, he has erred.”\nTirmidhi transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 5602350,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720330,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 230,
        "hadithText": "Abu Huraira reported God’s messenger as saying, “Disputation\nabout the Qur’an is infidelity.” Ahmad and Abu Dawud transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 5602360,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720340,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 231,
        "hadithText": "‘Amr b. Shu'aib quoted the authority of his father from his grandfather who said that the Prophet heard some people disagreeing about\nthe Qur’an and said, “It was just on this account that your predecessors\nperished: they set parts of God’s Book against others, whereas God's\nBook was sent down only to be consistent; so do not use parts to falsify\nothers. Speak about as much of it as you know, but where you are ignorant entrust it to him who knows.” Ahmad and Ibn Majah transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 5602370,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720350,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 232,
        "hadithText": "Ibn Mas'ud reported God's messenger as saying, “The Qur'an was\nsent down in seven modes. Every verse in it has an external and an\ninternal meaning, and every interdiction has a source of reference.”\nBaghawi transmitted it in <i>Sharh as-sunna</i>.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 5602380,
        "last_updated": "2020-07-15 07:35:35"
    },
    {
        "englishURN": 5720360,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 233,
        "hadithText": "‘Abdallah b. ‘Amr reported God's messenger as saying, “Knowledge has three categories: a precise verse, or an established <i>sunna</i>, or\na firm obligatory duty. Anything else is an extra.” Abu Dawud and Ibn Majah transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 5602390,
        "last_updated": "2020-07-15 05:30:12"
    },
    {
        "englishURN": 5720370,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 234,
        "hadithText": "‘Auf b. Malik al-Ashja‘i reported God’s messenger as saying, \"Only\na ruler, or one put in charge, or one who is presumptuous gives instruction.\"* \n\nAbu Dawud transmitted it, and Darimi transmitted it from ' Amr b. Shu'aib from his father from his grandfather. A version has, \"Or a hypocrite” instead of \"one who is presumptuous”. \n\n*The word used here is <i>yaqussu</i>, which may be translated as given above, but which may also\nbe translated as “inflicts punishment.”</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 5602401,
        "last_updated": "2020-07-15 06:41:40"
    },
    {
        "englishURN": 5720380,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 235,
        "hadithText": "Abu Huraira reported God’s messenger as saying, “If anyone is\ngiven a legal decision ignorantly, the sin rests on the one who gave it;\nand if anyone advises his brother, knowing that right guidance lies in\nanother direction, he has deceived him.” Abu Dawud transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 5602420,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720390,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 236,
        "hadithText": "Mu'awiya said that the Prophet forbade the discussion of thorny\nquestions. Abu Dawud transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 5602430,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720400,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 237,
        "hadithText": "Abu Huraira reported God’s messenger as saying, \"Learn the\nthings which are made obligatory and the Qur’an, and teach them to\npeople, for I shall die.” Tirmidhi transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 5602440,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720410,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 238,
        "hadithText": "Abu Darda’ told how God’s messenger, on an occasion when they\nwere with him, turned his eyes to the sky and said, \"This is a time when\nknowledge will be snatched away from men, so that they will be unable\nto acquire any.” Tirmidhi transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 5602450,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720420,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 239,
        "hadithText": "Abu Huraira transmitted [from the Prophet], \"The time is approaching when men will urge on their camels in search of knowledge, but\nwill find no one more learned than the learned man of Medina.” Tirmidhi transmitted it. and in his <i>Jami'</i> he quotes Ibn ‘Uyaina as saying\nthat Malik b. Anas was meant, and the same view is expressed by ‘Abd\nar-Razzaq. Ishab b. Musa said he heard Ibn ‘Uyaina say that he\nwas al-‘Umari the ascetic, whose name was ‘Abd al-‘Aziz b. ‘Abdallah.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 5602460,
        "last_updated": "2020-07-15 07:35:50"
    },
    {
        "englishURN": 5720430,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 240,
        "hadithText": "He also reported among the material he knew to come from God’s\nmessenger that he said, \"At the beginning of every century God will\nsend one who will renew its religion for this people.” Abu Dawud\ntransmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 5602470,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720440,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 241,
        "hadithText": "Ibrahim b. ‘Abd ar-Rahman al-‘Udhri reported God's messenger\nas saying, \"In every successive century those who are reliable authorities\nwill preserve this knowledge, rejecting the changes made by extremists, the plagiarisms of those who make false claims for themselves, and the\ninterpretations of the ignorant.”*\n*The source is lacking. The editor of the Damascus edition of the <i>Mishkat</i> says the tradition\nis given by Baihaqi in <i>al-Madkhal</i>.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 5602480,
        "last_updated": "2020-07-15 06:44:04"
    },
    {
        "englishURN": 5720450,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 242,
        "hadithText": "We shall mention Jabir’s tradition, “The only cure for perplexity is\nto ask”* in the chapter on performing ablution with sand, if God will. \n*Book 111. Chap. xi, section ii.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 5602485,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720460,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 243,
        "hadithText": "Al-Hasan reported in <i>mursal</i> form that God’s messenger said, “If\ndeath comes to anyone when he is seeking knowledge with the purpose\nof using it to revivify Islam, there will be only one degree between him\nand the prophets in paradise.” Darimi transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 5602490,
        "last_updated": "2020-07-15 05:31:43"
    },
    {
        "englishURN": 5720470,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 244,
        "hadithText": "He also reported in <i>mursal</i> form that God’s messenger was asked\nwhich of two men who had been among the B. Isra’il was superior, one\nwho was a learned man who observed the prescribed prayers, then sat\nand taught men what is good, the other who fasted by day and prayed\nduring the night. He replied, “The superiority of this learned man who\nobserved the prescribed prayers, then sat and taught men what is good\nover the devout man who fasted by day and prayed during the night is\nlike my superiority over the most contemptible among you.” Darimi\ntransmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 5602500,
        "last_updated": "2020-07-15 05:31:51"
    },
    {
        "englishURN": 5720480,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 245,
        "hadithText": "‘Ali reported God’s messenger as saying, “Good is the man learned\nin religion who, if people have need of him benefits them, but who, if\nthey ignore him enriches himself.”* Razin transmitted it. \n*i.e. with religious exercises and study.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 5602510,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720490,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 246,
        "hadithText": "Ikrima reported Ibn ‘Abbas as saying, “Talk to the people once\nevery Friday, but if you object, then twice, and if you want more, then\nthree times, but do not weary the people with this Qur’an. And do not\nlet me find you coming to the people when they are talking about their\nconcerns, interrupting them in their talk by addressing them, and so\nwearying them. Keep silent, and when they request you, talk to them\nat a time when they want it. Look out for rhymed prose in supplications and avoid it, for I know that God’s messenger and his companions\ndid not use it.” Bukhari transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 5602520,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720500,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 247,
        "hadithText": "Wathila b. al-Asqa‘ reported God’s messenger as saying, “He who seeks knowledge and attains it will have a double portion of reward,\nbut if he does not attain it he will have a single portion of reward.\"\nDarimi transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 5602530,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720510,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 248,
        "hadithText": "Abu Huraira reported God’s messenger as saying, “Among the\nactions and good deeds for which a believer will continue to receive reward after his death are knowledge which he taught and spread, a good\nson whom he left behind, or a copy of the Qur'an which he left as a\nlegacy, or a mosque which he built, or a house which he built for the\ntraveller, or a stream which he caused to flow, or a <i>sadaqa</i> which he\ngave from his property when he was alive and well, for which he will\ncontinue to receive reward after his death.” Ibn Majah transmitted it,\nand also Baihaqi in <i>Shu'ab al-iman</i>.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 5602540,
        "last_updated": "2020-07-15 05:32:09"
    },
    {
        "englishURN": 5720520,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 249,
        "hadithText": "‘Aisha said she heard God’s messenger say that God revealed\nto him, “ If anyone follows a path in search of knowledge, I shall make\neasy for him the road to paradise; and if I deprive anyone of his eyes,\nI shall guarantee paradise to him in return for them. Superiority in\nknowledge is better than superiority in worship, and the basis of the\nreligion is abstinence.” Baihaqi transmitted it in <i>Shu'ab al-iman</i>.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 5602550,
        "last_updated": "2020-07-15 05:32:20"
    },
    {
        "englishURN": 5720530,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 250,
        "hadithText": "Ibn ‘Abbas said, “Studying together for an hour during the night\nis better than spending the whole night in devotions.” Darimi transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 5602560,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720540,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 251,
        "hadithText": "‘Abdallah b. ‘Amr told of God’s messenger coming upon two\ngroups in his mosque and saying, “They are both engaged in what is\ngood, but one of them is superior to the other. These ones are praying and supplicating God who, if He wills, may answer their prayers\nbut, if He wills, may refuse them. Those ones are learning knowledge*\nand teaching the ignorant, so they are superior. I was sent only as a\nteacher.” He then sat down among them. Darimi transmitted it. \n*The text has <i>al-fiqh au al-'ilm, fiqh</i> and <i>‘ilm</i> having the same meaning, but the transmitter of the\ntradition was not sure which word was used by the Prophet on this occasion.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 5602570,
        "last_updated": "2020-07-15 07:36:32"
    },
    {
        "englishURN": 5720550,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 252,
        "hadithText": "Abu Darda’ told how God’s messenger, when asked how much a\nman had to learn to become a <i>faqih</i>, replied, “ If anyone preserves for\nmy people forty traditions concerning their religion, God will raise him\nup in the next world as a <i>faqih</i>, and I shall be an intercessor and witness\nfor him on the day of resurrection.”</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 5602580,
        "last_updated": "2020-07-15 07:36:43"
    },
    {
        "englishURN": 5720560,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 253,
        "hadithText": "Anas b. Malik said that God’s messenger asked, “Do you know\nwho is most generous?\" On receiving the reply that God and His\nmessenger knew best, he said, “God is the most generous, then I am the\nmost generous of mankind, and the most generous of them after me will\nbe a man who acquires knowledge and spreads it. On the day of resurrection he will come as a prince alone.” Or he said, “As one people.\"</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 5602590,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720570,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 254,
        "hadithText": "He also reported the Prophet as saying, “Two greedy ones never\nattain satisfaction: he who is greedy for knowledge can never get\nenough of it, and he who is greedy for worldly goods can never get\nenough of them.\" Baihaqi transmitted the three traditions in <i>Shu'ab\nal-iman</i>, and quoted the <i>imam</i> Ahmad as saying about Abu Darda''s\ntradition, “This is a well-known text among the people, but it does not\nhave a sound <i>isnad</i>.\"</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 5602600,
        "last_updated": "2020-07-15 07:36:57"
    },
    {
        "englishURN": 5720580,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 255,
        "hadithText": "‘Aun reported Ibn Mas'ud as saying, “Two greedy ones never\nattain satisfaction, the learned man and the worldly man, but they are\nnot equal. The learned man becomes more pleasing to the Compassionate One, but the worldly man perseveres in transgression.\" Then\n‘Abdallah [ibn Mas'ud] recited, “Nay, but man transgresses in considering that he\nis self-sufficient. \"* He added, “The other is preferable, for ‘only those\nof His servants who are learned fear God.’ \" [Ibid, xxxv, 28.] Darimi transmitted it. \n*Qur’an, xcvi, 6 f.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 5602610,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720590,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 256,
        "hadithText": "Ibn ‘Abbas reported God’s messenger as saying, “Some among\nmy people will become learned in religion, will recite the Qur’an, and\nsay that they will go to princes and get some of their worldly goods,\nbut withdraw from them with their religion. That cannot be; for, as\nwhat is gathered from tragacanth trees consists only of thorns, so what\nis gathered from drawing near to them consists only of . . . ” Muhammad\nb. as-Sabbah said that he obviously meant “sins.\" Ibn Majah transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 5602620,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720600,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 257,
        "hadithText": "‘Abdallah b. Mas'ud said: If the learned were to guard learning\nand entrust it to those who are worthy of it, they would thereby, rule\ntheir contemporaries. But they have bestowed it on worldly people to\nget thereby some of their worldly goods, and have been despised by\nthem. I heard your Prophet say, \"If anyone makes the care of his\neternal welfare the sum total of his cares God will protect him from\nworldly care, but if he has a variety of cares consisting of matters related to this world God will not be concerned in which of its <i>wadis</i> he\nperishes.” Ibn Majah transmitted it, and Baihaqi transmitted it in\n<i>Shu'ab al-iman</i> from Ibn ‘Umar beginning with \"If anyone makes the\ncare.”</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 5602631,
        "last_updated": "2020-07-15 07:37:14"
    },
    {
        "englishURN": 5720610,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 258,
        "hadithText": "Al-A‘mash reported God’s messenger as saying, \"The calamity\nwhich affects knowledge is forgetfulness, and wasting it is to convey it to\nthose who are unworthy of it.” Darimi transmitted it in <i>mursal</i> form.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 5602650,
        "last_updated": "2020-07-15 07:37:20"
    },
    {
        "englishURN": 5720620,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 259,
        "hadithText": "Sufyan said that ‘Umar b. al-Khattab asked Ka‘b who were the lords\nof knowledge, and he replied that they are those who act according to\nwhat they know. He then asked what it is that takes knowledge from\nthe hearts of the learned and was told that it is covetousness. Darimi\ntransmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 5602660,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720630,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 260,
        "hadithText": "Al-Ahwas b. Hakim told on his father’s authority that a man asked\nthe Prophet about evil, and he replied, \"Do not ask me about evil, but\nask me about good,” saying it three times. Then he said, \"The worst\nevil consists in learned men who are evil, and the best good consists in\nlearned men who are good.” Darimi transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 5602670,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720640,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 261,
        "hadithText": "Abu Darda’ said that the one who would have the worst position in\nGod’s sight on the day of resurrection would be a learned man who did\nnot profit from his learning.” Darimi transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 5602680,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720650,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 262,
        "hadithText": "Ziyad b. Hudair said that ‘Umar asked him whether he knew what\ndemolishes Islam, and that when he replied that he did not, he said,\n\"The slip of a learned man, the disputation of a hypocrite about the\nBook, and the rule of <i>imams</i> who lead men astray.” Darimi transmitted\nit.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 5602690,
        "last_updated": "2020-07-15 07:37:29"
    },
    {
        "englishURN": 5720660,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 263,
        "hadithText": "Al-Hasan said that knowledge is of two kinds: knowledge in the\nheart, which is the beneficial type; and knowledge on the tongue, which\nis God’s allegation against a human being.” Darimi transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 5602700,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720670,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 264,
        "hadithText": "Abu Huraira said, \"I have kept in my memory two large quantities*\nof learning from God’s messenger, one of which I have disclosed among\nyou; but were I to disclose the other, this <i>bul'um</i>, meaning the food\ntract, would be cut\". Bukhari transmitted it.\n*Lit. receptacles, or vessels.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 5602710,
        "last_updated": "2020-07-15 07:37:36"
    },
    {
        "englishURN": 5720680,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 265,
        "hadithText": "‘Abdallah [b. Mas'ud] said: If any of you people knows anything he should\nmake it known, but if anyone does not know he should say that God\nknows best, for saying this when one does not know is a part of knowledge. God said to His prophet, “Say, I do not ask you for any reward\nfor it, and I am not a pretender.”* (Bukhari and Muslim.)\n*Qur’an, xxxviii, 86.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 5602720,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720690,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 266,
        "hadithText": "Ibn Sirin said, “This knowledge is a religion, so consider from whom\nyou receive your religion.” Muslim transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 5602730,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720700,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 267,
        "hadithText": "Hudhaifa said, “ If you Qur'an readers follow a straight course you\nwill have attained great precedence; but if you go right and left you will\nhave fallen into vast error.” Bukhari transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 5602740,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720710,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 268,
        "hadithText": "Abu Huraira reported God’s messenger as saying, “Seek refuge in\nGod from the pit of sorrow.” On being asked what the pit of sorrow was,\nhe replied, “ It is a <i>wadi</i> in <i>jahannam</i> from which <i>jahannam</i> seeks refuge four hundred times every day.” When God’s messenger was asked\nwho would enter it, he replied, “The Qur’an readers who are ostentatious in what they do.” Tirmidhi transmitted it, and Ibn Majah has the\nsame, adding in it, “Among the Qur’an readers who are most hateful to\nGod are those who visit princes.” Al-Muharibi said that he meant\ntyrants.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 5602750,
        "last_updated": "2020-07-15 07:37:51"
    },
    {
        "englishURN": 5720720,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 269,
        "hadithText": "‘Ali reported God’s messenger as saying, “ A time is soon coming to\nmankind when nothing of Islam but its name will remain and only the\nwritten form of the Qur’an will remain. Their mosques will be in fine\ncondition but will be devoid of guidance, their learned men will be the\nworst people under heaven, corruption coming forth from them and\nreturning among them.” Baihaqi transmitted it in <i>Shu'ab al-iman</i>.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 5602760,
        "last_updated": "2020-07-15 07:37:58"
    },
    {
        "englishURN": 5720730,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 270,
        "hadithText": "Ziyad b. Labid said: The Prophet mentioned a matter, saying,\n“That will be at the time when knowledge departs.” I asked, “How can\nknowledge depart when we recite the Qur’an and teach it to our children\nand they will teach it to their children up till the day of resurrection?”\nHe replied, “ I am astonished at you,* Ziyad. I thought you were the\nmost learned man in Medina. Do not these Jews and Christians read the\nTorah and the Injil without knowing a thing about their contents?”\nAhmad and Ibn Majah transmitted it, Tirmidhi transmitted something\nsimilar from him, as did Darimi from Abu Umama.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 5602771,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720740,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 271,
        "hadithText": "Ibn Mas'ud reported that God's messenger said to him, \"Acquire\nknowledge and teach it to the people, learn the obligatory duties and\nteach them to the people, learn the Qur’an and teach it to the people;\nfor I am a man who will be taken away, knowledge will be taken away,\ndissensions will appear, so that two men will disagree about an obligatory duty and find no one to decide between them.” Darimi and\nDaraqutni transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 5602790,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 5720750,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 2,
        "bookName": "Knowledge",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 272,
        "hadithText": "Abu Huraira reported God’s messenger as saying, \"Knowledge from which no benefit is derived is like a treasure from which nothing is expended in God’s path.” Darimi transmitted it.</b>",
        "bookID": "2.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 5602800,
        "last_updated": "2020-07-16 01:06:23"
    }
]