[
    {
        "englishURN": 235780,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "11.00",
        "babName": " EMANCIPATING A SLAVE",
        "hadithNumber": 3578,
        "hadithText": "<p>\nIbn Umar (Allah be pleased with them) reported Allah's Messenger may peace be upon him) as saying: If anyone emancipates his share ina slave and has enough money to pay the full price for him, a fair price for the slave should be fixed, his partners given their shares, and the slave be thus emancipated, otherwise he is emancipated only to the extent of the first man's share.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 338680,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 235790,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "11.00",
        "babName": " EMANCIPATING A SLAVE",
        "hadithNumber": 3579,
        "hadithText": "<p>\nThis hadith has been reported on the authority of Ibn 'Umar through another chain of transmitters.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 338690,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 235800,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "11.00",
        "babName": " EMANCIPATING A SLAVE",
        "hadithNumber": 3580,
        "hadithText": "<p>\nAbu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying: The slave who is jointly owned by two persons, and is emancipated by one of them, (this one) has liability (upon him to secure complete freedom for that slave).</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 338700,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 235810,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "11.00",
        "babName": " EMANCIPATING A SLAVE",
        "hadithNumber": 3581,
        "hadithText": "<p>\nAbu Huraira (Allah be pleased witli him) reported Allah's Prophet (ﷺ) as saying: If anyone emancipates a share in a slave, he is to be completely emancipated if he has money; but if he has none, the slave will be required to work to pay for his freedom, but must not be over-burhened.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 338710,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 235820,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "11.00",
        "babName": " EMANCIPATING A SLAVE",
        "hadithNumber": 3582,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Sa'id b. Abu 'Aruba with the same chain of transmitters but with the addition:\" If he (one of the joint owners emancipating the slave) has not (enough) money (to secure freedom for the other half) a fair price for the slave should be fixed, and he will be required to work to pay for his freedom, but must not be over-burdened.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 338720,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 235830,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "11.00",
        "babName": " EMANCIPATING A SLAVE",
        "hadithNumber": 3583,
        "hadithText": "<p>\nA hadith like this is reported on the authority of the same chain of transmitters but with a slight change of words.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 338730,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 235840,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "12.00",
        "babName": " THE RIGHT OF INHERITANCE OF PROPERTY VESTS WITH ONE WHO EMANCIPATES THE SLAVE",
        "hadithNumber": 3584,
        "hadithText": "<p>\nIbn Umar reported that 'A'isha decided to buy a slave-girl and then set her free, but her masters said: We are prepared to sell her to you on the condition that her right of inheritance would vest with you. She (Hadrat A'isha) made a mention of that to Allah's Messenger (ﷺ) whereupon he said: This should not stand in your way. The right of inheritance vests in one who emancipates.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 338740,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 235850,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "12.00",
        "babName": " THE RIGHT OF INHERITANCE OF PROPERTY VESTS WITH ONE WHO EMANCIPATES THE SLAVE",
        "hadithNumber": 3585,
        "hadithText": "<p>\n'A'isha (Allah be pjeased with her) reported that Barira came to her in order to seek her help in securing freedom, but she had (so far) paid nothing out of that sum stipulated in the contract. 'A'isba said to her. Go to your family (who owns you), and if they like that I should pay the amount (of the contract) on your behalf (for purchasing your freedom), then I shall have the right in your inheritance. (If they accepted it) I am prepared (to make this payment). Barira made a mention of that to the (members of) her family, but they refused and said: If she (Hadrat 'A'isha) wants to do good to You for the sake of Allah, she may do it, but the right of inheritance will be ours. She (Hadrat 'A'isha) made a mention of that to Allah's Messenger (ﷺ), and he said to her: Buy her, and emancipate her, for the right of inheritance vests with one who emancipates (the slave). Allah's Messenger, may peace be upon him) then stood up and said: What has happened to the people that they lay down conditions which are not (found) in the Book of Allah? And he who laid down a condition not found in the Book of Allah, that is not valid. even if it is laid down hundred times. The condition laid down by Allah is the most weighty and the most valid.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 338750,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 235860,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "12.00",
        "babName": " THE RIGHT OF INHERITANCE OF PROPERTY VESTS WITH ONE WHO EMANCIPATES THE SLAVE",
        "hadithNumber": 3586,
        "hadithText": "<p>\n'A'isha, the wife of Allah's Apostle (ﷺ), reported: Barira came to me and said: 'A'isha, I have entered into contract for securing freedom with my family (who owns me) for nine 'uqiyas (of silver), one 'uqiya every year The rest of the hadith is the same (but with this addition):\" This (the problem of the right of inheritance) should not stand in your way. Buy her, and set her free. He said in a hadith: Allah's Messenger (ﷺ) stood up among men, extolled Allah, praised Him, and then said:\" for......\"</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 338760,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 235870,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "12.00",
        "babName": " THE RIGHT OF INHERITANCE OF PROPERTY VESTS WITH ONE WHO EMANCIPATES THE SLAVE",
        "hadithNumber": 3587,
        "hadithText": "<p>\n'A'isha (Allah be pleased with her) reported: Barira came to me and said: My family (owners) have made contract with me (for granting freedom) for nine 'uqiyas (of silver) payable in nine years, one 'uqiya every year. Help me (in making this payment). I said to her: If your family so desires, I am prepared to make them the full payment in one instalment, and thus secure freedom for you, but the right of inheritance will vest in me, if I do so. She (Barira) made a mention of that to her family, but they refused (except) on the condition that the right of inheritance would vest in them. She came to me and made mention of if She ('A'isha) said: I scolded her. She (Barira) said: By Allah, it is not possible (they will never agree to it). And as she was saying it, Allah's messenger (ﷺ) heard, and he asked me, I informed him and he said: Buy her and emancipate her, and let the right of inherit- ance vest in them, for they cannot claim it (rightfully) since the right of inherritance vests with one who emancipates (the slave; therefore, these people have no right to lay such false claims). And I did so. She ('A'isha) said: Then Allah's Messenger (ﷺ) delivered a sermon in the evening. He extolled Allah and praised Him with what He deserves, and then said afterwards,: What has happened to the people that they lay down conditions which are not found in the Book of Allah? And the condition which is not found in the Book of Allah is invalid, even if its number is one hundred. The Book of Allah is more true (than any other deed) and the condition laid down by Allah is more binding (than any other condition). What has happened to the people among you that someone among you says:\" Emancipate so and so, but the right of inheritance vests in me\"? Verily, the right of inheritance vests in one who emancipates.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 338770,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 235880,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "12.00",
        "babName": " THE RIGHT OF INHERITANCE OF PROPERTY VESTS WITH ONE WHO EMANCIPATES THE SLAVE",
        "hadithNumber": 3588,
        "hadithText": "<p>\nHisham b. 'Urwa narrated a hadith like this with the same chain of trans- mitters except (with this change) that in the hadith transmitted on the authority of jartr (the words are): Her (Barira's) husband was a slave, so Allah's Messenger (ﷺ) gave her the option (either to retain her matrimonial relation with her husband or sever it off). She opted to break off (and secure freedom for her even from the matrimonial alliance). And if he were free he would not have given her the option. In the hadith narrated on the authority (of this chain of transmitters) these words are not found: Amma ba'du.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 338780,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 235890,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "12.00",
        "babName": " THE RIGHT OF INHERITANCE OF PROPERTY VESTS WITH ONE WHO EMANCIPATES THE SLAVE",
        "hadithNumber": 3589,
        "hadithText": "<p>\n'Abd al-Rahman b. al. Qasim reported on the authority of his father: 'A'isha (Allah be pleased with her) said: There were three issues which were clarified in case of Barira: her owners had decided to sell her on the condition that the right of her inheritance would vest with them. She ('A'isha) said: I made a mention of that to Allah's Apostle (ﷺ) and he said: Buy her and emancipate her, for verily the right of inheritance vests with one who emancipates. She said that she emancipated (her) and Allah's Messenger (ﷺ) gave her the option (either to retain her matrimonial alliance or break it after emancipation). She (taking advantage of the option) opted for herself (the severing of matrimonial alliance). 'A'isha said: The people used to give her charity and she gave us that as gift. I made a mention of it to Allah's Apostle (ﷺ), whereupon he said: That is charity for her but gift for you, so take that.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 338790,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 235900,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "12.00",
        "babName": " THE RIGHT OF INHERITANCE OF PROPERTY VESTS WITH ONE WHO EMANCIPATES THE SLAVE",
        "hadithNumber": 3590,
        "hadithText": "<p>\n'A'isha (Allah's be pleased with her) reported that she had bought Barira from the people of Ansar, but they laid down the condition that the right of inheritance (would vest in them), whereupon Allah's Messenger (ﷺ) said: The right of inheritance vests with one who shows favour (who emancipates) and Allah's Messenger (may peacebe upon him) gave her the choice (either to retain) her matrimonial alliance or break it). Her husband was a slave. She (Barira also) gave 'A'isha some meat as gift. Allah's Messenger (ﷺ) said: I wish you could prepare (cook) for us out of this meat. 'A'isha said, It has been given as charity to Barira, whereupon he said: That is charity for her and gift for us.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 338800,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 235910,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "12.00",
        "babName": " THE RIGHT OF INHERITANCE OF PROPERTY VESTS WITH ONE WHO EMANCIPATES THE SLAVE",
        "hadithNumber": 3591,
        "hadithText": "<p>\n'A'isha (Allah be pleased with her) reported: She wanted to buy Barira with a view to emancipating her. They (the sellers) laid down the condition that the right of inheritance would vest (with them). She (Hadrat 'A'isha) made a mention of that to Allah's Messenger (ﷺ), whereupon he said: Buy her and emancipate her for the right of inheritance vests with one who emancipates. Allah's Messenger (ﷺ) was given meat as gift. They (his Companions) said to Allah's Apostle (ﷺ): This was given as charity to Barira, whereupon he said: That is charity for her but gift for us. And she was given option (to retain her matrimonial alliance or to break it). Abd al-Rahman said: Her husband was a free man. Shu'ba said: I then asked him (one of the narrators) about Barira's husband (whether he had been a free mart or a slave), whereupon he said: I do not know.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 338810,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 235920,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "12.00",
        "babName": " THE RIGHT OF INHERITANCE OF PROPERTY VESTS WITH ONE WHO EMANCIPATES THE SLAVE",
        "hadithNumber": 3592,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 338820,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 235930,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "12.00",
        "babName": " THE RIGHT OF INHERITANCE OF PROPERTY VESTS WITH ONE WHO EMANCIPATES THE SLAVE",
        "hadithNumber": 3593,
        "hadithText": "<p>\n'A'isha reported that the husband of Barira was a slave.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 338830,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 235940,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "12.00",
        "babName": " THE RIGHT OF INHERITANCE OF PROPERTY VESTS WITH ONE WHO EMANCIPATES THE SLAVE",
        "hadithNumber": 3594,
        "hadithText": "<p>\n'A'isha (Allah be pleased with her). the wife of Allah's Apostle (may Peace be upon him) said: Three are the Sunan (usages) (that we came to know in case of Bairara). She was given option in regard to her husband when she was emancipated. Sbe was given meat as charity. Allah's Messenger (way peace be upon him) visited me when an earthen pot with meat in it was placed on the fire. He asked for food and be was given bread with ordinary meat (usually cooked in the) house. Thereupon he (Allah's Messenger) said: Don't I see the earthen pot on fire with meat in it? They said: Yes. Allah's Messenger, there is meat in it which was given as charity to Barira. We did not deem it advisable that we should give you that to eat, whereupon he said: It is charity for her, but it is gift for us. Allah's Apostle (ﷺ) also said: The right of inheritance vests with one who emancipates.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 338840,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 235950,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "12.00",
        "babName": " THE RIGHT OF INHERITANCE OF PROPERTY VESTS WITH ONE WHO EMANCIPATES THE SLAVE",
        "hadithNumber": 3595,
        "hadithText": "<p>\nAbu Huraira (Allah be pleased with him) reported: 'A'isha (Allah be pleated with her) thought of buying a slave-girl and emancipating her, but her owners refused to (sell her but on the condition) that the right of inheritance would vest in them. She made a mention of that to Allah's Messenger (ﷺ). whereupon he said: Let this (condition) not stand in your way for the right of inheritance vests with one who emancipates.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 338850,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 235960,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "13.00",
        "babName": " IT IS FORBIDDEN TO SELL AL-WALA' (THE RIGHT OF INHERITANCE OF A SLAVE) AND ITS CONFERRING ON OTHERS",
        "hadithNumber": 3596,
        "hadithText": "<p>\nIbn Umar (Allah be pleased with them) reported that Allah's Messenger (may peace he upon him) forbade the selling and making a gift of the right of inheritance of a slave. Imam Muslim said: All the persons depend upon Abdullah b. Dinar in regard to this hadith.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 338860,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 235970,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "13.00",
        "babName": " IT IS FORBIDDEN TO SELL AL-WALA' (THE RIGHT OF INHERITANCE OF A SLAVE) AND ITS CONFERRING ON OTHERS",
        "hadithNumber": 3597,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Ibn 'Umar (Allah be pleased with them) through another chain of transmitters but with this change that in tba hadith narrated by al-Thaqafi from Ubaidullah there is only a mention of selling (or right of inheritance, al-Wala' ) but not that of making a gift.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 338870,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 235980,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "14.00",
        "babName": " IT IS FORBIDDEN FOR A SLAVE TO TAKE ANYONE AS HIS ALLY EXCEPT ONE WHO EMANCIPATES HIM",
        "hadithNumber": 3598,
        "hadithText": "<p>\nJabir b. Abdullah (Allah be pleased with them) reported that Allah's Apostle (ﷺ) made it obligatory for every tribe (the payment) of blood-wit; he then also made it explicit that it is not permissible for a Muslim to make himself the ally (of the slave emancipated by another) Muslim without his permission. He (the narrator further added): I was informed that he (the Holy Prophet) cursed the one who did that (and it was recorded) in his Sahifa (in a document).</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 338880,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 235990,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "14.00",
        "babName": " IT IS FORBIDDEN FOR A SLAVE TO TAKE ANYONE AS HIS ALLY EXCEPT ONE WHO EMANCIPATES HIM",
        "hadithNumber": 3599,
        "hadithText": "<p>\nAbu Huraira (Allah be pleased with him) reported that Allah's Messenger (ﷺ) said: He who takes anyone as his ally without the consent of his previous master, there will be the curse of Allah and that of His angels upon him, and neither, any obligatory act of his nor the supererogatory one will be accepted (by Allah).</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 338890,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 236000,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "14.00",
        "babName": " IT IS FORBIDDEN FOR A SLAVE TO TAKE ANYONE AS HIS ALLY EXCEPT ONE WHO EMANCIPATES HIM",
        "hadithNumber": 3600,
        "hadithText": "<p>\nAbu Huraira (Allah be pleased with him) reported Allah's Apostle (ﷺ) as saying: He who took the freed slave as his ally without the consent of his previous master, there is upon him the curse of Allah and that of His angels and that of the whole mankind, and there will not be accepted from him his obligatory acts or supercrogatory acts on the Day of Resurrection. This hadith is narrated through the same chain of transmitters, but with a slight change of words.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 338901,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 236010,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "14.00",
        "babName": " IT IS FORBIDDEN FOR A SLAVE TO TAKE ANYONE AS HIS ALLY EXCEPT ONE WHO EMANCIPATES HIM",
        "hadithNumber": 3601,
        "hadithText": "<p>\nIbrahim al-Taimi reported on the authority of his father: 'Ali b. Abu Talib (Allah be pleased with him) addressed us and said: He who thinks that we (the members of the Prophet's family) read anything else besides the Book of Allah and this Sahifa (and he said that Sahifa was tied to the scabbard of the sword) tells a lie. (This Sahifa) contains (problems) pertaining to the ages of the camels and (the recompense) of the injuries, and it also records the words of the Prophet (ﷺ): Medina is a sacred territory from 'Ayr to Thaur (it is most probably Uhud). He who innovates (an act or practice) or gives protection to an innovator, there is a curse of Allah and that of His angels and that of the whole humanity upon him. Allah will not accdpt from him (as a recompense) any obligatory act or supererogatory act, and the responsibility of the Muslims is a joint responsibility; even the lowest in rank can undertake the responsibility (on behalf of others), and he who claims anyone else as his father besides his own father or makes one his ally other than the one (who freed him), there is a curse of Allah. that of His angels and that of the wholemankind upon him. Allah will not accept the obligatory act of the supererogatery act (as a recompense) from him.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 338920,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 236020,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "15.00",
        "babName": " EXCELENCE OF EMANCIPATING A SLAVE",
        "hadithNumber": 3602,
        "hadithText": "<p>\nAbu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying: If anyone emancipates a Muslim slave, Allah will set free from Hell an organ of his body for every organ of his (slave's) body.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 338930,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 236030,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "15.00",
        "babName": " EXCELENCE OF EMANCIPATING A SLAVE",
        "hadithNumber": 3603,
        "hadithText": "<p>\nAbu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace benpon him) as saying: He who emancipates a slave, Allah will set free from Hell every limb (of his body) for every limb of his (slave's) body, even his private parts.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 338940,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 236040,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "15.00",
        "babName": " EXCELENCE OF EMANCIPATING A SLAVE",
        "hadithNumber": 3604,
        "hadithText": "<p>\nAbu Huraira (Allah be pleased with him) reported: I heard Allah's Messenger (ﷺ) as saying: He who emancipates a believing slave. Allah will set free from Fire his every limb for every limb of his (slave's), even his private parts for his.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 338950,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 236050,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "15.00",
        "babName": " EXCELENCE OF EMANCIPATING A SLAVE",
        "hadithNumber": 3605,
        "hadithText": "<p>\nAbu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying: A Muslim who emancipates a Muslim (slave). Allah will save from Fire every limb of his for every limb (of the slave). Sa'id b. Marjana said: When I heard this hadith from Abu Huraira (Allah be pleased with him), I went away and made a mention of it to 'Ali b. Husain and he at once emancipated the slave for which Ibn ja'far was prepared to pay ten thousand dirhams or one thousand dinars.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 338960,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 236060,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "16.00",
        "babName": " EXCELLENCE OF SECURING THE EMANCIPATION OF FATHER",
        "hadithNumber": 3606,
        "hadithText": "<p>\nAbu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying: A son does not repay what he owes his father unless he buys him (the father) in case he is a slave and then emancipates him. In the narration transmitted by Ibn Abu Shaiba there is a slight change of words.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 338970,
        "last_updated": "2013-02-11 19:42:33"
    },
    {
        "englishURN": 236070,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 9,
        "bookName": "The Book of Divorce (Kitab Al-Talaq)",
        "babNumber": "16.00",
        "babName": " EXCELLENCE OF SECURING THE EMANCIPATION OF FATHER",
        "hadithNumber": 3607,
        "hadithText": "<p>\nA hadith like this has been narrated on the authority of Suhail with the same chain of transmitters.</b>",
        "bookID": "9.4",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 338980,
        "last_updated": "2013-02-11 19:42:33"
    }
]