[
    {
        "englishURN": 240350,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "1.00",
        "babName": " IT IS FORBIDDEN TO TAKE THE OATHS IN THE NAME OF ANYONE ELSE BESIDES ALLAH",
        "hadithNumber": 4035,
        "hadithText": "<p>\n'Umar b. al-Khattib reported Allah's Messenger (ﷺ) as saying: Allah, the Great and Majestic, forbids you to swear by your fathers. Umar said: By Allah. I have never sworn (by my father) since I heard Allah's Messenger (ﷺ) forbidding it mentioning them\" on my behalf\" nor on behalf of someone else.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 343780,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240360,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "1.00",
        "babName": " IT IS FORBIDDEN TO TAKE THE OATHS IN THE NAME OF ANYONE ELSE BESIDES ALLAH",
        "hadithNumber": 4036,
        "hadithText": "<p>\nThis hadith has been transmitted on the authority of Zuhri except that in the hadith narrated on the authority of Uqail the words are:\" I did not take oath by (anyone else except Allah) since I heard Allah's Messenger forbidding it. nor did I speak in such terms, and the narrator did not say,\" on my own behalf or on behalf of someone else\".</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 343790,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240370,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "1.00",
        "babName": " IT IS FORBIDDEN TO TAKE THE OATHS IN THE NAME OF ANYONE ELSE BESIDES ALLAH",
        "hadithNumber": 4037,
        "hadithText": "<p>\nSalim reported on the authority of his father that Allah's Apostle (ﷺ) heard 'Umar while he was taking oath by his father. The rest of the hadith is the same.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 343800,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240380,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "1.00",
        "babName": " IT IS FORBIDDEN TO TAKE THE OATHS IN THE NAME OF ANYONE ELSE BESIDES ALLAH",
        "hadithNumber": 4038,
        "hadithText": "<p>\n'Abdullah (b. Umar) reported that Allah's Messenger (ﷺ) found, Umar b. al-Khattab amongst the riders and he was taking oath by his father Allah's Messenger (ﷺ) called them (saying) ; Our Allah, the Exated and Majestic, has forbidden you that you take oath by your father. He who bag to take an oath, he must take it by Allah or keep quiet.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 343810,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240390,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "1.00",
        "babName": " IT IS FORBIDDEN TO TAKE THE OATHS IN THE NAME OF ANYONE ELSE BESIDES ALLAH",
        "hadithNumber": 4039,
        "hadithText": "<p>\nThis hadith is narrated on the authority of Ibn Umar through another chain of transmitters.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 343820,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240400,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "1.00",
        "babName": " IT IS FORBIDDEN TO TAKE THE OATHS IN THE NAME OF ANYONE ELSE BESIDES ALLAH",
        "hadithNumber": 4040,
        "hadithText": "<p>\nIbn 'Umar heard Allah's Messenger (ﷺ) as saying: He who has to take an oath, he must not take oath but by Allah. The Quraish used to take oath by their fathers. So he (the Holy Prophet) said: Do not take oath by your fathers.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 343830,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240410,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "2.00",
        "babName": " HE WHO TAKES AN OATH BY LAT AND UZZA, HE SHOULD SAY: THERE IS NO GOD BUT ALLAH",
        "hadithNumber": 4041,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: He who takes an oath in the course of which he says: By Lat (and al-'Uzza), he should say: There is no god but Allah; and that if anyone says to his friend:\" Come and I will gamble with you,\" he should pay sadaqa.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 343840,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240420,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "2.00",
        "babName": " HE WHO TAKES AN OATH BY LAT AND UZZA, HE SHOULD SAY: THERE IS NO GOD BUT ALLAH",
        "hadithNumber": 4042,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Zuhri.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 343850,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240430,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "2.00",
        "babName": " HE WHO TAKES AN OATH BY LAT AND UZZA, HE SHOULD SAY: THERE IS NO GOD BUT ALLAH",
        "hadithNumber": 4043,
        "hadithText": "<p>\nAbd al-Rahman b. Samura reported Allah's Messenger (ﷺ) as saying: Do not swear by idols, nor by your fathers.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 343860,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240440,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "3.00",
        "babName": " IT IS EXCELLENT TO BREAK THE VOW IF ONE FINDS IT BETTER DOING THAT WHICH IS AGAINST THIS VOW ONE SHOULD EXPIATE IT",
        "hadithNumber": 4044,
        "hadithText": "<p>\nAbu Musa al-Ash'ari reported: I came to Allah's Apostle (ﷺ) along with a group of Ash'arites requesting to give us a mount. He (the Holy Prophet) said: By Allah, I cannot provide you with a mount, and there is nothing with me which I should give you as a ride. He (the narrator) said: We stayed there as long as Allah willed. Then there were brought to him (to the Holy Prophet) camels. He (the Holy Prophet) then ordered to give us three white humped camels, We started and said (or some of us said to the others): Allah will not bless us. We came to Allah's Messenger (ﷺ) begging him to provide us with riding camels. He swore that he could not provide us with a mount, but later on he provided us with that. They (some of the Prophet's Companions) came and informed him about this (rankling of theirs), whereupon he said: It was not I who provided you with a mount, but Allah has provided you with that. So far as I am concerned, by Allah, if He so wills, I would not swear, but if, later on, I would see better than it, I (would break the vow) and expiate it and do that which is better.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 343870,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240450,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "3.00",
        "babName": " IT IS EXCELLENT TO BREAK THE VOW IF ONE FINDS IT BETTER DOING THAT WHICH IS AGAINST THIS VOW ONE SHOULD EXPIATE IT",
        "hadithNumber": 4045,
        "hadithText": "<p>\nAbu Musa reported: My friends sent me to Allah's Messenger (ﷺ) asking him to provide them with mounts as they were going along with him in jaish al-'Usrah (the army of destitutes or of meagre means or army setting out during the hard times and that is the occasion of the expedition of Tabuk) I said: Apostle of Allah, my friends have sent me to you so that you may provide them with mounts. He (the Holy Prophet) said: By Allah, I cannot provide you with anything to ride. And it so happened that he was at that time much perturbed. I little knew of it, so I came back with a heavy heart on account of the refusal of Allah's Messenger (ﷺ), and the fear that Allah's Messenger (ﷺ) might have some feelings against me. I returned to my friends and informed them about what Allah's Messenger (ﷺ) had said. I had hardly stayed for a little that I heard Bilal calling: 'Abdullah b. Qais. I responded to his call. He said: Hasten to Allah's Messenger (ﷺ), he is calling you, When I came to the Prophet (ﷺ) he said: Take this pair, this pair, and this pair (i. e. six camels which he had bought from Sa'd), and take them to y, our friends and say: Verily Allah (or he said: Verily Allah's Messenger (ﷺ) has provided you with these animals. So ride upon them. Abu Musa said: I went along with them to my friends and said: Verily Allah's messenger (ﷺ) has provided you with these animals for riding; but by Allah, I shall not leave you until some of you go along with me to him who had heard the talk of Allah's Messenger (ﷺ) then I asked him for you, and his refusal for the first time, and then his granting them to me subsequently; so you should not think that I narrated to you something which he did not say. They said to me: By Allah, in our opinion you are certainly truthful, and we would do as you like. So Abu Musa went along withsome of the menfrom them until they came to those who had heard the words of Allah's Messenger (may, peace be upon him) and his refusal to (provide) them with (animals) ; and subsequently his granting (the animals) to them; and they narrated to them exactly as Abu Masa had narrated to them.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 343880,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240460,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "3.00",
        "babName": " IT IS EXCELLENT TO BREAK THE VOW IF ONE FINDS IT BETTER DOING THAT WHICH IS AGAINST THIS VOW ONE SHOULD EXPIATE IT",
        "hadithNumber": 4046,
        "hadithText": "<p>\r\nAyyub said: We were sitting in the company of Abu Musa that he called for food and it consisted of flesh of fowl. It was then that a person from Banu Tamim visited him. His complexion was red having the resemblance of a slave. He said to him: Come and (join me in food). He showed reluctance. He (Abu Masa) said: Come on, for I saw Allah's Messenger (ﷺ) eating it (fowl's meat), whereupon that person said: I saw it eating something (of filth and rubbish) and I found it repugnant and took an oath that I would never eat that. He (Abu Muds) said: Come, so that I would narrate to you about that (the incident pertaining to vow). (And he narrated thus): I came to Allah's Messenger (ﷺ) along with a group of people belonging to the tribe of Ash'ari, asking him to provide us with riding camels. He (the Holy Prophet) said: By Allah, I cannot provide you with riding animals. And there is nothing with me with which I can provide you a mount. We stayed (for some time) there as Allah willed, and there was brought to Allah's Messenger (ﷺ) booty of camels. He called us and commanded that we should be given five white humped camels. As we were about to go back, some of us said to the other: As we made Allah's Messenger (ﷺ) forget oath, there would be no blessing for us (in his gift). We went back to him and said: Allah's Messenger, we came to you to provide us with riding animals and you took an oath that you would never equip us with mounts and then you have provided us with the riding beasts Allah's Messenger, have you forgotten? Thereupon he said: I swear by Allah that if Allah so wills, I shall not swear an oath, and then consider something else to be better than it without making atonement for my oath and doing the thing that is better. So you go; Allah, the Exalted and Glorious, has given you riding animals.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 343890,
        "last_updated": "2012-05-27 00:41:03"
    },
    {
        "englishURN": 240470,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "3.00",
        "babName": " IT IS EXCELLENT TO BREAK THE VOW IF ONE FINDS IT BETTER DOING THAT WHICH IS AGAINST THIS VOW ONE SHOULD EXPIATE IT",
        "hadithNumber": 4047,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Abu Musa al-Ash'ari with a slight variation of words.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 343900,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240480,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "3.00",
        "babName": " IT IS EXCELLENT TO BREAK THE VOW IF ONE FINDS IT BETTER DOING THAT WHICH IS AGAINST THIS VOW ONE SHOULD EXPIATE IT",
        "hadithNumber": 4048,
        "hadithText": "<p>\nZahdam al-Jarmi reported: We were in the company of Abu Musa. The rest of the hadith is the same.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 343910,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240490,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "3.00",
        "babName": " IT IS EXCELLENT TO BREAK THE VOW IF ONE FINDS IT BETTER DOING THAT WHICH IS AGAINST THIS VOW ONE SHOULD EXPIATE IT",
        "hadithNumber": 4049,
        "hadithText": "<p>\nZahdam al-Jarmi reported: I visited Abu Musa and lie was eating fowl's meat. The rest of the hadith is the same with this addition that he (the Holy Prophet) said: By Allah, I did not forget it.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 343920,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240500,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "3.00",
        "babName": " IT IS EXCELLENT TO BREAK THE VOW IF ONE FINDS IT BETTER DOING THAT WHICH IS AGAINST THIS VOW ONE SHOULD EXPIATE IT",
        "hadithNumber": 4050,
        "hadithText": "<p>\nAbu Musa al-Ash'ari reported: We came to Allah's Messenger (ﷺ) requesting him to provide us with riding camels. He (the Holy Prophet) said: There is nothing with me with which I should equip you. By Allah, I would not provide you with (riding camels). Then Allah's Messenger (ﷺ) sent to us three camels with spotted bumps. We said: We came to Allah's Messenger (ﷺ) asking him to equip us with riding animals. He took an oath that he could not equip us. We came to him and informed him. He said: By Allah, I do not take an oath, but when I find the other thing better than that, I do that which is better.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 343930,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240510,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "3.00",
        "babName": " IT IS EXCELLENT TO BREAK THE VOW IF ONE FINDS IT BETTER DOING THAT WHICH IS AGAINST THIS VOW ONE SHOULD EXPIATE IT",
        "hadithNumber": 4051,
        "hadithText": "<p>\nAbu Musa reported: We walked on foot and came to Allah's Apostle (may peace he upon him) asking him to provide us with mounts. The rest of the hadith is the same.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 343940,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240520,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "3.00",
        "babName": " IT IS EXCELLENT TO BREAK THE VOW IF ONE FINDS IT BETTER DOING THAT WHICH IS AGAINST THIS VOW ONE SHOULD EXPIATE IT",
        "hadithNumber": 4052,
        "hadithText": "<p>\nAbu Huraira reported: A person sat late in the night with Allah's Apostle (ﷺ), and then came to his family and found that his children had gone to sleep. His wife brought food for him. but he took an oath that he would not eat because of his children (having gone to sleep without food) He then gave precedence (of breaking the vow and then expiating it) and ate the food He then came to Allah s Messenger (ﷺ) and made mention of that to him, whereupon Allah's Messenger (may peace he upon him) said: He who took an oath and (later on) found something better than that should do that, and expiate for (breaking) his vow.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 343950,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240530,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "3.00",
        "babName": " IT IS EXCELLENT TO BREAK THE VOW IF ONE FINDS IT BETTER DOING THAT WHICH IS AGAINST THIS VOW ONE SHOULD EXPIATE IT",
        "hadithNumber": 4053,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: He who took an oath and then found another thing better than (this) should expiate for the oath (broken) by him and do (the better thing).</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 343960,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240540,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "3.00",
        "babName": " IT IS EXCELLENT TO BREAK THE VOW IF ONE FINDS IT BETTER DOING THAT WHICH IS AGAINST THIS VOW ONE SHOULD EXPIATE IT",
        "hadithNumber": 4054,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: He who took an oath and (later on) found another thing better than that, he should do that which is better, and expiate for the vow (broken by him).</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 343970,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240550,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "3.00",
        "babName": " IT IS EXCELLENT TO BREAK THE VOW IF ONE FINDS IT BETTER DOING THAT WHICH IS AGAINST THIS VOW ONE SHOULD EXPIATE IT",
        "hadithNumber": 4055,
        "hadithText": "<p>\nThis hadith is narrated on the authority of Suhail with the same chain of transmitters (with these words):\" He should expiate for (breaking) the vow and do that which is better.\"</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 343980,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240560,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "3.00",
        "babName": " IT IS EXCELLENT TO BREAK THE VOW IF ONE FINDS IT BETTER DOING THAT WHICH IS AGAINST THIS VOW ONE SHOULD EXPIATE IT",
        "hadithNumber": 4056,
        "hadithText": "<p>\nTamim b. Tarafa reported: A beggar came to 'Adi b. Hatim and he begged him to give him the price of a slave, or some portion of the price of the slave. He ('Adi) said: I have nothing to give you except my coat-of-mail and helmet. I will, however, write to my family to give that to you, but he did not agree to that. Thereupon 'Adi was enraged, and said: By Allah, I will not give you anything. The person (then) agreed to accept that, whereupon he said: By Allah, had I not heard Allah's Messenger (ﷺ) saying:\" He who took an oath, but then found something more pious in the sight of Allah, he should (break the oath) and do that which is more pious,\" I would not have broken the oath (and thus paid you anything).</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 343990,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240570,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "3.00",
        "babName": " IT IS EXCELLENT TO BREAK THE VOW IF ONE FINDS IT BETTER DOING THAT WHICH IS AGAINST THIS VOW ONE SHOULD EXPIATE IT",
        "hadithNumber": 4057,
        "hadithText": "<p>\n'Adi b. Hatim reported Allah's Messenger (ﷺ) as saying: He who took an oath, but he found something else better than that, should do that which is better and break his oath.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 344000,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240580,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "3.00",
        "babName": " IT IS EXCELLENT TO BREAK THE VOW IF ONE FINDS IT BETTER DOING THAT WHICH IS AGAINST THIS VOW ONE SHOULD EXPIATE IT",
        "hadithNumber": 4058,
        "hadithText": "<p>\n'Adi reported Allah's Messenger (ﷺ) as saying: When anyone amongst you takes an oath, but he finds (something) better than that he should expiate (the breaking of the oath), and do that which is better.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 344010,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240590,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "3.00",
        "babName": " IT IS EXCELLENT TO BREAK THE VOW IF ONE FINDS IT BETTER DOING THAT WHICH IS AGAINST THIS VOW ONE SHOULD EXPIATE IT",
        "hadithNumber": 4059,
        "hadithText": "<p>\nThis hadith is reported on the authority of Adi b. Hatim through another chain of transmitters.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 344020,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240600,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "3.00",
        "babName": " IT IS EXCELLENT TO BREAK THE VOW IF ONE FINDS IT BETTER DOING THAT WHICH IS AGAINST THIS VOW ONE SHOULD EXPIATE IT",
        "hadithNumber": 4060,
        "hadithText": "<p>\nTamim b. Tarafa reported that he heard 'Adi b. Hatim say that a person came to him and asked for one hundred dirhams. He ('Adi) said: You asked me for one hundred dirhams and I am the son of Hatim; by Allah, I will not give you. But then he said: (I would have done that) if I had not heard Allah's Messenger (ﷺ) say: He who takes an oath, but then finds something better than that, should do that which is better.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 344030,
        "last_updated": "2015-02-12 11:58:33"
    },
    {
        "englishURN": 240610,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "3.00",
        "babName": " IT IS EXCELLENT TO BREAK THE VOW IF ONE FINDS IT BETTER DOING THAT WHICH IS AGAINST THIS VOW ONE SHOULD EXPIATE IT",
        "hadithNumber": 4061,
        "hadithText": "<p>\nTamim b. Tarafa reported: I heard 'Adi b. Hatim say that a person asked that and then narrated (the hadith) like one (mentioned above), but he made this addition:\" Here are four hundred (dirhams) for you out of my gift.\"</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 344040,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240620,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "3.00",
        "babName": " IT IS EXCELLENT TO BREAK THE VOW IF ONE FINDS IT BETTER DOING THAT WHICH IS AGAINST THIS VOW ONE SHOULD EXPIATE IT",
        "hadithNumber": 4062,
        "hadithText": "<p>\nAbd al-Rahman b. Samura reported that Allah's Messenger (ﷺ) said to me: Abd al-Rahman b. Samura, don't ask for authority for if it is granted to you for asking for it, you would be commissioned for it (without having the support of Allah), but if you are granted it without your asking for it. You would be helped (by Allah) in it. And when you take an oath and find something else better than that, expiate for (breaking) your oath, and do that which is better. This hadith has also been transmitted on the authority of Ibn Farrukh.\n<p>\nThe above hadith is narratted through another chain of transmitters.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 344050,
        "last_updated": "2021-02-10 18:19:16"
    },
    {
        "englishURN": 240630,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "3.00",
        "babName": " IT IS EXCELLENT TO BREAK THE VOW IF ONE FINDS IT BETTER DOING THAT WHICH IS AGAINST THIS VOW ONE SHOULD EXPIATE IT",
        "hadithNumber": 4063,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of 'Abd al-Rahman b. Samura through another chain of transmitters but there is no mention of the word\" authority\".</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 344070,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240640,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "4.00",
        "babName": " THE OATH WOULD BE CONSIDERED ON THE BASIS OF THE INTENTION OF ONE WHO TAKES AN OATH",
        "hadithNumber": 4064,
        "hadithText": "<p>\nAbu Haraira reported Allah's Messenger (ﷺ) as saying: Your oath should be about something regarding which your companion will believe you. 'Amr said: By which your companion will believe you.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 344080,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240650,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "4.00",
        "babName": " THE OATH WOULD BE CONSIDERED ON THE BASIS OF THE INTENTION OF ONE WHO TAKES AN OATH",
        "hadithNumber": 4065,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: An oath is to be interpreted according to the intention of the one who takes it.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 344090,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240660,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "5.00",
        "babName": " EXPRESSING THE WORDS\" GOD WILLING\" IN THE OATH",
        "hadithNumber": 4066,
        "hadithText": "<p>\nAbu Huraira reported that (Hadrat) Sulaiman had sixty wives. He (one day) said: I will visit each one of them every night, and every one of them will become pregnant and give birth to a male child who will be a horseman and fight in the cause of Allah. But (it so happened) that none of them became pregnant except one, but she gave birth to an incomplete child. Thereupon Allah's Messenger (ﷺ) said: Had he said Insha' Allah (if God so wills), then every one of them would have given birth to a child who would have been a horseman and fought in the cause of Allah</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 344100,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240670,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "5.00",
        "babName": " EXPRESSING THE WORDS\" GOD WILLING\" IN THE OATH",
        "hadithNumber": 4067,
        "hadithText": "<p>\nAbu Huraira reported Allah's Prophet (ﷺ) as saying that Sulaiman b. Dawud, the Messenger of Allah, observed: I will have an intercourse with seventy wives during the night; all of them will give birth to a male child who will fight in the cause of Allah. His companion or the ang I said to him: Say,\" If God wills.\" But he (Hadrat Sulaimin) did not say so, and he forgot it. And none of his wives gave birth to a child, but one who gave birth to a premature child. Allah's Messenger (ﷺ) said: Had he said Insha' Allah (if God so will). he would not have failed and his desire would have been materialised.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 344110,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240680,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "5.00",
        "babName": " EXPRESSING THE WORDS\" GOD WILLING\" IN THE OATH",
        "hadithNumber": 4068,
        "hadithText": "<p>\nAbu Huraira reported this hadith from the Messenger of Allah (ﷺ) through another chain of transmitters.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 344120,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240690,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "5.00",
        "babName": " EXPRESSING THE WORDS\" GOD WILLING\" IN THE OATH",
        "hadithNumber": 4069,
        "hadithText": "<p>\nAbu Huraira reported that Sulaiman b. Dawud said: I will certainly have intercourse with seventy wives during the night, and every wife amongst them will give birth to a child, who will fight in the cause of Allah. It was said to him: Say:\" Insha' Allah\" (God willing), but he did not say so and forgot it. He went round them but none of them give birth to a child except one woman and that too was an incomplete person. Upon this Allah's Messenger (ﷺ) said: If he had said\" Insha' Allah.\" he would not have failed, and his desire must have been fulfilled.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 344130,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240710,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "6.00",
        "babName": " IT IS FORBIDDEN TO PERSIST IN AN OATH WHICH CAUSES TROUBLE TO THE FAMILY, AND IS NOT LAWFUL",
        "hadithNumber": 4071,
        "hadithText": "<p>\nHammam b. Munabbih reported: This is what Abu Huraira reported to us from Allah's Messenger (ﷺ), and he narrated a hadith and (one) of them is that Allah's Messenger (ﷺ) said: I swear by Allah, it is more sinful in Allah's sight for one of you to persist in an oath regarding his family than payment of its expiation which Allah has imposed upon him (for breaking the oath).</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 344160,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240720,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "7.00",
        "babName": " WHAT A NON-BELIEVER SHOULD DO WITH HIS VOW WHEN HE EMBRACES ISLAM",
        "hadithNumber": 4072,
        "hadithText": "<p>\nIbn 'Umar reported that Umar (b. Khattab) said: Messenger of Allah, I had taken a vow during the days of Ignorance (Jahiliyya) that I would observe I'tikaf for a night in the Sacred Mosque. He (the Holy Prophet) said: Fulfil your vow.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 344170,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240730,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "7.00",
        "babName": " WHAT A NON-BELIEVER SHOULD DO WITH HIS VOW WHEN HE EMBRACES ISLAM",
        "hadithNumber": 4073,
        "hadithText": "<p>\nThis hadith is transmitted on the authority of Ibn Umar with a slight variation of words.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 344180,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240740,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "7.00",
        "babName": " WHAT A NON-BELIEVER SHOULD DO WITH HIS VOW WHEN HE EMBRACES ISLAM",
        "hadithNumber": 4074,
        "hadithText": "<p>\n'Abdullah b. 'Umar reported that 'Umar b. Khattab asked the Messenger of Allah (ﷺ) as he was at ji'rana (a town near Mecca) on his way back from Ta'if: Messenger of Allah, I had taken a vow during the days of Ignorance that I would observe I'tikaf for one day in the Sacred Mosque. So what is your opinion? He said: Go and observe I'tikaf for a day. And Allah's Messenger (ﷺ) gave him a slave girl out of the one-fifth (of the spoils of war meant for the Holy Prophet). And when Allah's Messenger (inay peace be upon him) set the war prisoners free. 'Umar b. Khattab heard their voice as they were saying: Allah's Messenger (ﷺ) has set as free. He (Hadrat 'Umar) said: What is this? They said: Allah's Messenger (ﷺ) has set free the prisoners of war (which had fallen to the lot of people). Thereupon he (Hadrat 'Umar) said: Abdullah, go to that slave-girl and set her free.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 344190,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240750,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "7.00",
        "babName": " WHAT A NON-BELIEVER SHOULD DO WITH HIS VOW WHEN HE EMBRACES ISLAM",
        "hadithNumber": 4075,
        "hadithText": "<p>\nlbn 'Umar reported: When Allah's Apostle (ﷺ) came back from the Battle of Hunain, Umar asked Allah's Messenger (ﷺ) about the vow he had taken during the days of Ignorance that he would observe I'tikaf for a day. The rest of the hadith is the same.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 344200,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240760,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "7.00",
        "babName": " WHAT A NON-BELIEVER SHOULD DO WITH HIS VOW WHEN HE EMBRACES ISLAM",
        "hadithNumber": 4076,
        "hadithText": "<p>\nNafi' reported: A mention of Allah's Messenger (ﷺ) observing 'Umra from ja'rina was made before Ibn 'Umar. He said: He did not enter into the state of Ihram from that (place), and Umar had taken a vow of observing I'tikaf for a night during the days of Ignorance. The rest of the hadith is the same.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 344210,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240770,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "7.00",
        "babName": " WHAT A NON-BELIEVER SHOULD DO WITH HIS VOW WHEN HE EMBRACES ISLAM",
        "hadithNumber": 4077,
        "hadithText": "<p>\nThis hadith has been transmitted on the authority of Ibn Umar through another chain of transmitters but with a slight variation of words.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 344220,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240780,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "8.00",
        "babName": " HOW SHOULD THE MASTERS TREAT THEIR SLAVES AND EXPIATION IF THEY SHOW HIGH-HANDEDNESS",
        "hadithNumber": 4078,
        "hadithText": "<p>\nZadhan Abl Umar reported: I came to Ibn 'Umar as he had granted freedom to a stave. He (the narrator further) said: He took hold of a wood or something like it from the earth and said: It (freedom of a slave) has not the reward evert equal to it, but the fact that I heard Allah's Messenger (way peace be upon him) say: He who slaps his slave or beats him, the expiation for it is that he should set him free.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 344230,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240790,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "8.00",
        "babName": " HOW SHOULD THE MASTERS TREAT THEIR SLAVES AND EXPIATION IF THEY SHOW HIGH-HANDEDNESS",
        "hadithNumber": 4079,
        "hadithText": "<p>\nZadhan reported that Ibn Umar called his slave and he found the marks (of beating) upon his back. He said to him: I have caused you pain. He said: No. But he (Ibn Umar) said: You are free. He then took hold of something from the earth and said: There is no reward for me even to the weight equal to it. I heard Allah's Messenger (ﷺ) as saying: He who beats a slave without cognizable offence of his or slaps him (without any serious fault), then expiation for it is that he should set him free.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 344240,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240800,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "8.00",
        "babName": " HOW SHOULD THE MASTERS TREAT THEIR SLAVES AND EXPIATION IF THEY SHOW HIGH-HANDEDNESS",
        "hadithNumber": 4080,
        "hadithText": "<p>\nThis hadith has been narrated through another chain of transmitters with a slight variation of words.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 344250,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240810,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "8.00",
        "babName": " HOW SHOULD THE MASTERS TREAT THEIR SLAVES AND EXPIATION IF THEY SHOW HIGH-HANDEDNESS",
        "hadithNumber": 4081,
        "hadithText": "<p>\nMu'awiya b. Suwaid reported: I slapped a slave belonging to us and then fled away. I came back just before noon and offered prayer behind my father. He called him (the slave) and me and said: Do as he has done to you. He granted pardon. He (my father) then said: We belonged to the family of Muqarrin during the lifetime of Allah's Messenger (may peace be upon him. and had only one slave-girl and one of us slapped her. This news reached Allah's Apostle (ﷺ) and he said: Set her free. They (the members of the family) said: There is no other servant except she. Thereupon he said: Then employ her and when you can afford to dispense with her services, then set her free.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 344260,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240820,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "8.00",
        "babName": " HOW SHOULD THE MASTERS TREAT THEIR SLAVES AND EXPIATION IF THEY SHOW HIGH-HANDEDNESS",
        "hadithNumber": 4082,
        "hadithText": "<p>\nHilal b. Yasaf reported that a person got angry and slapped his slave-girl. Thereupon Suwaid b. Muqarrin said to him: You could find no other part (to slap) but the prominent part of her face. See I was one of the seven sons of Muqarrin, and we had but only one slave-girl. The youngest of us slapped her, and Allah's Messenger (ﷺ) commanded us to set her free. 2097</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 344270,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240830,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "8.00",
        "babName": " HOW SHOULD THE MASTERS TREAT THEIR SLAVES AND EXPIATION IF THEY SHOW HIGH-HANDEDNESS",
        "hadithNumber": 4083,
        "hadithText": "<p>\nHilal b. Yasaf reported: We used to sell cloth in the house of Suwaid b. Muqarrin, the brother of Nu'man b. Muqarrin. There came out a slave-girl, and she said something to a person amongst us, and he slapped her. Suwaid was enraged-the rest of the hadlth is the same.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 344280,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240840,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "8.00",
        "babName": " HOW SHOULD THE MASTERS TREAT THEIR SLAVES AND EXPIATION IF THEY SHOW HIGH-HANDEDNESS",
        "hadithNumber": 4084,
        "hadithText": "<p>\nSuwaid b. Muqarrin reported that he had a slave-girl and a person (one of the members of the family) slapped her, whereupon Suwaid said to him: Don't you know that it is forbidden (to strike the) face. He said: You see I was the seventh one amongst my brothers during the lifetime of Allah's Messenger (ﷺ), and we had but only one servant. One of us got enraged and slapped him. Thereupon Allah's Messenger (ﷺ) commanded us to set him free.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 344290,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240850,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "8.00",
        "babName": " HOW SHOULD THE MASTERS TREAT THEIR SLAVES AND EXPIATION IF THEY SHOW HIGH-HANDEDNESS",
        "hadithNumber": 4085,
        "hadithText": "<p>\nWahb b. Jarir reported: Shu'ba informed that Muhammad b. Munkadir said to me: What is your name? The rest of the hadith is the same.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 344300,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240860,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "8.00",
        "babName": " HOW SHOULD THE MASTERS TREAT THEIR SLAVES AND EXPIATION IF THEY SHOW HIGH-HANDEDNESS",
        "hadithNumber": 4086,
        "hadithText": "<p>\nAbu Mas'ud al-Badri reported: I was beating my slave with a whip when I heard a voice behind me: Understand, Abu Masud; but I did not recognise the voice due to intense anger. He (Abu Mas'ud) reported: As he came near me (I found) that he was the Messenger of Allah (ﷺ) and he was saying: Bear in mind, Abu Mas'ud; bear in mind. Abu Mas'ud. He (Aba Maslad) said: threw the whip from my hand. Thereupon he (the Holy Prophet) said: Bear in mind, Abu Mas'ud; verily Allah has more dominance upon you than you have upon your slave. I (then) said: I would never beat my servant in future.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 344310,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240870,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "8.00",
        "babName": " HOW SHOULD THE MASTERS TREAT THEIR SLAVES AND EXPIATION IF THEY SHOW HIGH-HANDEDNESS",
        "hadithNumber": 4087,
        "hadithText": "<p>\nThis hadith has been narrated on the authorityo A'mash but with this variation of words:\" There fell from my hand the whip on account of his (the Prophet's) awe.\"</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 344320,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240880,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "8.00",
        "babName": " HOW SHOULD THE MASTERS TREAT THEIR SLAVES AND EXPIATION IF THEY SHOW HIGH-HANDEDNESS",
        "hadithNumber": 4088,
        "hadithText": "<p>\nAbu Mas'ud al-Ansari reported: When I was beating my servant, I heard a voice behind me (saying): Abu Mas'ud, bear in mind Allah has more dominance over you than you have upon him. I turned and (found him) to be Allah's Messenger (ﷺ). I said: Allah's Messenger, I set him free for the sake of Allah. Thereupon he said: Had you not done that, (the gates of) Hell would have opened for you, or the fire would have burnt you.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 344330,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240900,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "9.00",
        "babName": " IT IS IMPROPER TO ACCUSE THE SLAVE OF ADULTERY",
        "hadithNumber": 4090,
        "hadithText": "<p>\nAbu Huraira reported that Abu'l-Qasim (one of the names of Allah's Messenger [may peace be upon him]) said: He who accused his slave of adultery, punishment would be imposed upon him on the Day of Resurrection, except in case the accusation was as he had said.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 344360,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240910,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "9.00",
        "babName": " IT IS IMPROPER TO ACCUSE THE SLAVE OF ADULTERY",
        "hadithNumber": 4091,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Ibn Ghazwan (and the words are):\" I heard Abu'l-Qasim (ﷺ) as the Prophet of repentance.\"</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 344370,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240920,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "10.00",
        "babName": " FEEDING OF SLAVE WITH WHAT THE MASTER EATS HIMSELF AND CLOTHING HIM WITH WHAT HE WEARS HIMSELF AND NOT TO BURDEN HIM BEYOND CAPACITY",
        "hadithNumber": 4092,
        "hadithText": "<p>\nAl-Ma'rur b. Suwaid said: We went to Abu Dharr (Ghifari) in Rabadha and he had a mantle over him, and his slave had one like it. We said: Abu Dharr, had you joined them together, it would have been a complete garment. Thereupon he said: There was an altercation between me and one of the persons among my brothers. His mother was a non-Arab. I reproached him for his mother. He complained against me to Allah's Apostle (ﷺ). As I met Allah's Apostle (ﷺ) he said: Abu Dharr, you are a person who still has (in him the remnants) of the days (of Ignorance). Thereupon I said: Allah's Messenger, he who abuses (other) persons, they abuse (in return) his father and mother. He (the Holy Prophet) said: Abu Dharr, you are a person who still has (the remnants) of Ignorance in him They (your servants and slaves) are your brothers. Allah has put them in your care, so feed them with what you eat, clothe them with what you wear. and do not burden them beyond their capacities; but if you burden them (with an unbearable burden), then help them (by sharing their extra burden).</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 344380,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240930,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "10.00",
        "babName": " FEEDING OF SLAVE WITH WHAT THE MASTER EATS HIMSELF AND CLOTHING HIM WITH WHAT HE WEARS HIMSELF AND NOT TO BURDEN HIM BEYOND CAPACITY",
        "hadithNumber": 4093,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of A'mash but with a slight variation of words, e. g. in the hadith transmitted on the authority of Zuhair and Abu Mu'awiya after his words (these words of the Holy Prophet):\" You are a person having the remnants of Ignorance in him.\" (these words also occur, that Abu Dharr) said: Even up to this time of my old age? He (the Holy Prophet) said: Yes. In the tradition transmitted on the authority of Abu Mu'awiya (the words are):\" Yes, in this time of your old age.\" In the tradition transmitted on the authority of 'Isa (the words are):\" If you burden him (with an unbearable burden), you should sell him (and get another slave who can easily undertake this burden).\" In the hadith transmitted on the authority of Zuhair (the words are):\" Help him in that (work).\" In the hadith transmitted by Abu Mu'awiya (separately) there is no such word: Then sell him or help him.\" This hadith concludes with these words:\" Do not burden him beyond his capacity.\"</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 344390,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240940,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "10.00",
        "babName": " FEEDING OF SLAVE WITH WHAT THE MASTER EATS HIMSELF AND CLOTHING HIM WITH WHAT HE WEARS HIMSELF AND NOT TO BURDEN HIM BEYOND CAPACITY",
        "hadithNumber": 4094,
        "hadithText": "<p>\nMa'rur b. Suwaid reported: I saw Abu Dharr wearing clothes, and his slave wearing similar ones. I asked him about it, and he narrated that he had abused a person during the lifetime of Allah's Messenger (may peace be upoe. him) and he reproached him for his mother. That person came to Allah's Apostle (ﷺ) and made mention of that to him. Thereupon Allah's Apostle (ﷺ) said: You are a person who has (remnants of) Ignorance in him. Your slaves are brothers of yours. Allah has placed them in your hand, and he who has his brother under him, he should feed him with what he eats, and dress him with what he dresses himself, and do not burden them beyond their capacities, and if you burden them, (beyond their capacities), then help them.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 344400,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240950,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "10.00",
        "babName": " FEEDING OF SLAVE WITH WHAT THE MASTER EATS HIMSELF AND CLOTHING HIM WITH WHAT HE WEARS HIMSELF AND NOT TO BURDEN HIM BEYOND CAPACITY",
        "hadithNumber": 4095,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: It is essential to feed the slave, clothe him (properly) and not burden him with work which is beyond his power.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 344410,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240960,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "10.00",
        "babName": " FEEDING OF SLAVE WITH WHAT THE MASTER EATS HIMSELF AND CLOTHING HIM WITH WHAT HE WEARS HIMSELF AND NOT TO BURDEN HIM BEYOND CAPACITY",
        "hadithNumber": 4096,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: When the slave of anyone amongst you prepares food for him and he serves him after having sat close to (and undergoing the hardship of) heat and smoke, he should make him (the slave) sit along with him and make him eat (along with him), and if the food seems to run short, then he should spare some portion for him (from his own share) - (another narrator) Dawud said:\" i. e. a morsel or two\". 4097</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 344420,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240970,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "11.00",
        "babName": " REWARD OF THE SALVE WHEN HE IS LOYAL TO HIS MASTER AND IS GOOD IN WORSHIPPING ALLAH",
        "hadithNumber": 4097,
        "hadithText": "<p>\nIbn Umar reported Allah's Messenger (ﷺ) as saying: When a slave looks to the welfare of his master and worships Allah well, he has two rewards for him.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 344430,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240980,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "11.00",
        "babName": " REWARD OF THE SALVE WHEN HE IS LOYAL TO HIS MASTER AND IS GOOD IN WORSHIPPING ALLAH",
        "hadithNumber": 4098,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Ibn 'Umar through another chain of transmitters.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 344440,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241000,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "11.00",
        "babName": " REWARD OF THE SALVE WHEN HE IS LOYAL TO HIS MASTER AND IS GOOD IN WORSHIPPING ALLAH",
        "hadithNumber": 4100,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: When a slave fulfils obligation of Allah and obligation of his master, he has two rewards for him. I narrated this to Ka'b, and Ka'b said: (Such a slave) has no accountability, nor has a poor believer.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 344470,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241010,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "11.00",
        "babName": " REWARD OF THE SALVE WHEN HE IS LOYAL TO HIS MASTER AND IS GOOD IN WORSHIPPING ALLAH",
        "hadithNumber": 4101,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: It is good for a slave that he worships Allah well, and serves his master (well). It is good for him.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 344490,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241020,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "12.00",
        "babName": " HE WHO EMANCIPATES HIS SHARE IN THE SLAVE",
        "hadithNumber": 4102,
        "hadithText": "<p>\nIbn 'Umar reported Allah's Messenger (ﷺ) as saying: He who gives up his share in a slave, and has enough money to pay the full price of the slave, then full emancipation devolves upon him; but if he has not the money, then he emancipated what he emancipated.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 344500,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241030,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "12.00",
        "babName": " HE WHO EMANCIPATES HIS SHARE IN THE SLAVE",
        "hadithNumber": 4103,
        "hadithText": "<p>\nIbn 'Umar reported Allah's Messenger (ﷺ) as saying: He who emancipates his share in the slave, it is his responsibility to secure full freedom for him provided he (the slave) has enough money to pay the (remaining) price, but it he has not so much money he would be emancipated to the extent that the first man emancipated.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 344510,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241040,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "12.00",
        "babName": " HE WHO EMANCIPATES HIS SHARE IN THE SLAVE",
        "hadithNumber": 4104,
        "hadithText": "<p>\n'Abdullah b. 'Umar reported Allah's Messenger (ﷺ) as saying: He who gives up his share in a slave, and he has money enough to meet the full price, a fair price for him should be fixed; otherwise be has emancipated him to the extent that he has emancipated.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 344520,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241050,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "12.00",
        "babName": " HE WHO EMANCIPATES HIS SHARE IN THE SLAVE",
        "hadithNumber": 4105,
        "hadithText": "<p>\nThis hadith has been narrated through another chain of transmitters with a slight variation of words.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 344530,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241060,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "12.00",
        "babName": " HE WHO EMANCIPATES HIS SHARE IN THE SLAVE",
        "hadithNumber": 4106,
        "hadithText": "<p>\nSalim b. 'Abdullah reported on the authority of his father that Allah's Apostle (ﷺ) said: He who emancipates a slave (shared) by him and another one, his full price may be justly assessed from his wealth, neither less nor more, and he (the slave) would be emancipated if he (the partner) would be solvent enough (to forgo the amount of his share).</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 344540,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241070,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "12.00",
        "babName": " HE WHO EMANCIPATES HIS SHARE IN THE SLAVE",
        "hadithNumber": 4107,
        "hadithText": "<p>\nIbn 'Umar reported Allah's Apostle (ﷺ) as saying: He who gives up his share in a slave, the remaining (share) will be paid out of his riches if his riches are enough to meet the price of the slave.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 344550,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241080,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "12.00",
        "babName": " HE WHO EMANCIPATES HIS SHARE IN THE SLAVE",
        "hadithNumber": 4108,
        "hadithText": "<p>\nAbu Huraira reported Allah's Apostle (ﷺ) as saying: In case the slave is owned by two persons, and one of them emancipates him, he will guarantee (his full freedom).</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 344560,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241090,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "12.00",
        "babName": " HE WHO EMANCIPATES HIS SHARE IN THE SLAVE",
        "hadithNumber": 4109,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Shu'ba with the same chain of transmitters (and the words are):\" He who emancipates a portion in a slave, he should (secure full) freedom for him from his property.\"</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 344570,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241100,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "12.00",
        "babName": " HE WHO EMANCIPATES HIS SHARE IN THE SLAVE",
        "hadithNumber": 4110,
        "hadithText": "<p>\nAbu Huraira reported Allah's Apostle (ﷺ) as saying: He who emancipates his portion in a slave, full emancipation may be secured for him out of his property (if he has money) if he has enough property to meet (the required expenses), but if he has not enough property, the slave should be put to extra labour (in order to earn money for buying his freedom), but he should not be overburdened.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 344580,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241110,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "12.00",
        "babName": " HE WHO EMANCIPATES HIS SHARE IN THE SLAVE",
        "hadithNumber": 4111,
        "hadithText": "<p>\nThis hadith has been narrated through another chain of transmitters (and the words are):\" He will be required to work (in order to secure freedom) for that por- tion in which he has not been emancipated, without overburdening him.\"</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 344590,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241120,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "12.00",
        "babName": " HE WHO EMANCIPATES HIS SHARE IN THE SLAVE",
        "hadithNumber": 4112,
        "hadithText": "<p>\n'Imran b. Husain reported that a person who had no other property emancipated six slaves of his at the time of his death. Allah's Messenger (ﷺ) called for them and divided them into three sections, cast lots amongst them, and set two free and kept four in slavery; and he (the Holy Prophet) spoke severely of him.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 344600,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241130,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "12.00",
        "babName": " HE WHO EMANCIPATES HIS SHARE IN THE SLAVE",
        "hadithNumber": 4113,
        "hadithText": "<p>\nThis hadith has been narrated through another chain of transmitters (and the words are):\" A person from among the Ansar willed away the freedom of six slaves of his at the time of his death.\"</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 344610,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241140,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "12.00",
        "babName": " HE WHO EMANCIPATES HIS SHARE IN THE SLAVE",
        "hadithNumber": 4114,
        "hadithText": "<p>\nThis hadith has been reported on the authority of Imran b. Husain through another chain of narrators.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 344620,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241150,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "13.00",
        "babName": " THE PERMISSIBILITY OF BUYING A MUDABBAR SLAVE",
        "hadithNumber": 4115,
        "hadithText": "<p>\nJabir b. 'Abdullah said that a person among the Ansar declared his slave free after his death, as he had no other property. This news reached the Messenger of Allah (ﷺ) and he said: Who will buy him from me? And Nu'aim b. al-Nahham bought him for eight hundred dirhams and he handed them over to him, 'Amr (one of the narrators) said: I heard Jabir b. 'Abdullah as saying: He was a Coptic slave, and he died in the first year (of the Caliphate of 'Abdullah b. Zubair).</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 344630,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241160,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "13.00",
        "babName": " THE PERMISSIBILITY OF BUYING A MUDABBAR SLAVE",
        "hadithNumber": 4116,
        "hadithText": "<p>\nJabir is reported to have said: A person amongst the Ansar who had no other property declared a slave free after his death. Allah's Messenger (ﷺ) sold him, and Ibn al-Nahham bought him and he was a Coptic slave (who) died in the first year of the Caliphate of Ibn Zubair.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 344640,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241170,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "13.00",
        "babName": " THE PERMISSIBILITY OF BUYING A MUDABBAR SLAVE",
        "hadithNumber": 4117,
        "hadithText": "<p>\nA hadith like this has been narrated on the authority of Jabir through another chain of transmitters.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 344650,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241180,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "13.00",
        "babName": " THE PERMISSIBILITY OF BUYING A MUDABBAR SLAVE",
        "hadithNumber": 4118,
        "hadithText": "<p>\nThis hadith has been narrated from Allah's Messenger (ﷺ) through other chains of transmitters.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 344662,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240701,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "5.00",
        "babName": " EXPRESSING THE WORDS",
        "hadithNumber": 4070,
        "hadithText": "<p>\nAbu Huraira reported Allah's Apostle (ﷺ) as saying that Sulaiman b. Dawud (once) said: I will go round in the night to my ninety wives, and every one of them will give birth to a child (who will grow up) as a horseman and fight in the cause of Allah His companions said to him: Say\" Insha' Allah.\" but he did not say Inshii' Allah. He went round all of them but none of them became pregnant but one, and she gave birth to a premature child. And by Him in Whose hand is the life of Muhammad, if he had said, Insha' Allah (his wives would have given birth to the children who would all have grown up into horsemen and fought in the way of Allah).</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 344140,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240702,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "5.00",
        "babName": " EXPRESSING THE WORDS",
        "hadithNumber": 4070,
        "hadithText": "<p>\n This hadith has been narrated on the authority of Abu Zinad with the same chain of transmitters with a variation of (these words):\" Every one of them giving birth to a child, who would have fought in the cause of Allah.\"</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 344150,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240891,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "8.00",
        "babName": " HOW SHOULD THE MASTERS TREAT THEIR SLAVES AND EXPIATION IF THEY SHOW HIGH-HANDEDNESS",
        "hadithNumber": 4089,
        "hadithText": "<p>\nAbu Mas'ud reported that he had been beating his slave and he had been saying: I seek refuge with Allah, but he continued beating him, whereupon he said: I seek refuge with Allah's Messenger, and he spared him. Thereupon Allah's Messenger (ﷺ) said: By Allah, God has more dominance over you than you have over him (the slave). He said that he set him free.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 344340,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240892,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "8.00",
        "babName": " HOW SHOULD THE MASTERS TREAT THEIR SLAVES AND EXPIATION IF THEY SHOW HIGH-HANDEDNESS",
        "hadithNumber": 4089,
        "hadithText": "<p> \nThis hadith has been narrated on the authority of Shu'ba with the same chain of transmitters, but made no mention of (these words) of his: I seek refuge with Allah, I seek refuge with Allah's Messenger (ﷺ).</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 344350,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240991,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "11.00",
        "babName": " REWARD OF THE SALVE WHEN HE IS LOYAL TO HIS MASTER AND IS GOOD IN WORSHIPPING ALLAH",
        "hadithNumber": 4099,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: For a faithful slave there are two rewards. By him in Whose hand is the life of Abu Huraira, but for Jihad in the cause of Allah, and Pilgrimage and kindness to my mother, I would have preferred to die as a slave. He (one of the narrators in the chain of transmitters) said: This news reached us that Abu Huraira did not perform Pilgrimage until his mother died for (keeping himself constantly) in her service.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 344450,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 240992,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "11.00",
        "babName": " REWARD OF THE SALVE WHEN HE IS LOYAL TO HIS MASTER AND IS GOOD IN WORSHIPPING ALLAH",
        "hadithNumber": 4099,
        "hadithText": "<p>\nThis hadith has been transmitted on the authority of Abu Tahir but with a slight variation of words.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 344460,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241005,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book of Oaths (Kitab Al-Aiman)",
        "babNumber": "11.00",
        "babName": "REWARD OF THE SALVE WHEN HE IS LOYAL TO HIS MASTER AND IS GOOD IN WORSHIPPING ALLAH",
        "hadithNumber": 4100,
        "hadithText": "The above hadith has been reported through another chain of transmitters on the authority of Abu Huraira.</b>",
        "bookID": "15.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 344480,
        "last_updated": "2012-04-26 14:00:00"
    }
]