[
    {
        "englishURN": 241190,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "1.00",
        "babName": " AL-OASAMAH",
        "hadithNumber": 4119,
        "hadithText": "<p>\nSahl b. Abu Hathma and Rafi' b. Khadij reported that 'Abdullah b. Sahl b. Zaid and Muhayyisa b. Mas'ud b. Zaid went out and as they reached Khaibar they were separated. Then Muhayyisa found 'Abdullah b. Sahl having been killed. He buried him, and then came to Allah's Messenger (ﷺ). They were Huwayyisa b. Mas'ud and 'Abd al-Rahman b. Sahl, and he (the latter one) was the youngest of the people (those three who had come to seek an interview with the Holy Prophet) began to talk before his Companions (had spoken). Thereupon Allah's Messenger (ﷺ) said: The eldest one (eldest in regard to age should speak). So he kept quiet, and his companions (Muhayyisa and Huwayyisa) began to speak, and he ('Abd al Rahman) spoke along with them and they narrated to Allah's Messenger (ﷺ) the murder of 'Abdullah b. Sahl. Thereupon he said to them: Are you prepared to take fifty oaths so that you may be entitled (to blood-wit) of your companion (or your man who has murdered)? They said: How can we take an oath on a matter which we have not witnessed? He (the Holy Prophet) said: Then the Jews will exonerate themselves by fifty oaths. They said: How can we accept the oaths of people who are unbelievers? When Allah's Messenger (ﷺ) saw that, he himself paid his blood-wit.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 344690,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241200,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "1.00",
        "babName": " AL-OASAMAH",
        "hadithNumber": 4120,
        "hadithText": "<p>\nSahl. b. Abu Hathma and Rafi' b. Khadij reported that Muhayyisa b. Mas'ud and 'Abdullah b. Sahl went towards Khaibar and they separated near the palm-trees. 'Abdullah b. Sahl was killed. They accused the Jews (for this act). And there came to Allah's Apostle (ﷺ) his brother (the brother of the slain person) 'Abd al-Rahman and his cousins Huwayyisa and Muhayyisa; and 'Abd al-Rahman talked to him about the matter pertaining to (the murder of) his brother, and he was the youngest among them. Thereupon Allah's Messenger (ﷺ) said: Show regard for the greatness of the old, or he said: Let the eldest begin speaking. Then they (Huwayyisa and Muhayyisa) spoke about the matter of their companion (murder of their cousin, 'Abdullah b. Sahl). Thereupon Allah's Messenger (ﷺ) said: Let fifty (persons) among you take oath for levelling the charge (of murder) against a person amongst them, and he would be surrendered to you. They said: We have not witnessed this matter ourselves. How can we then take oath? He (the Holy Prophet) said: The Jews will exonerate themselves by the oaths of fifty of them. They said: Messenger of Allah, they are non-believing people. Thereupon Allah's Messenger (ﷺ) paid the blood wit for him. Sahl said: As one day I entered the fold a she-camel amongst those camels hit me with its leg.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 344700,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241210,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "1.00",
        "babName": " AL-OASAMAH",
        "hadithNumber": 4121,
        "hadithText": "<p>\nSahl b. Abu Hathma has narrated this hadith through another chain of transmitters with a slight variation of words, but no mention has been made of the hitting by the she-camel.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 344710,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241220,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "1.00",
        "babName": " AL-OASAMAH",
        "hadithNumber": 4122,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Sahl b. Abu Hathma through another chain of transmitters.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 344720,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241230,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "1.00",
        "babName": " AL-OASAMAH",
        "hadithNumber": 4123,
        "hadithText": "<p>\nBushair b. Yasar reported that 'Abdullah b. Sahl b. Zaid and Muhayyisa b. Mas'ud b. Zaid, both of them were Ansar belonging to the tribe of Banu Haritha, set out to Khaibar during the lifetime of Allah's Messenger (ﷺ). There was peace during those days and (this place) was inhabited by the Jews. They parted company for their (respective) needs. 'Abdullab b. Sahl was killed, and his dead body was found in a tank. His companion (Muhayyisa) buried him and came to Medina, and the brothers of the slain 'Abd al-Rahman b. Sahl. and Muhayyisa and Huwayyisa told Allah's Messenger (ﷺ) the case of 'Abdullah and the place where he had been murdered. Bushair reported on the authority of one who had seen Allah's Messenger (ﷺ) that he had said to them: You take fifty oaths and you are entitled to blood-wit of (one) slain among you (or your companion). They said: Messenger of Allah, we neither saw (with our own eyes this murder) nor were we present there. Thereupon (Allah's Messenger is reported to have said): Then the Jews will exonerate themselves by taking fifty oaths. They said: Allah's Messenger, how can we accept the oath of unbelieving people? Bushair said that Allah's Messenger (ﷺ) paid the blood-wit himself.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 344730,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241240,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "1.00",
        "babName": " AL-OASAMAH",
        "hadithNumber": 4124,
        "hadithText": "<p>\nBushair b. Yasar reported that a person from the Ansar belonging to the tribe of Banu Haritha who was called 'Abdullah b. Sahl b. Zaid set out and the son of his uncle called Muhayyisa b. Mas'ud b. Zaid, the rest of the hadith is the same up to the words:\" Allah's Messenger (ﷺ) paid the blood-wit himself.\" Bushair b. Yasar reported that Sahl b. Abu Hathma said: One camel amongst the camels paid as blood-wit kicked me while I was in the (camel) enclosure.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 344740,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241250,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "1.00",
        "babName": " AL-OASAMAH",
        "hadithNumber": 4125,
        "hadithText": "<p>\nBushair b. Yasar al-Ansari reported on the authority of Sahl b. Abu Hathma al-Ansari that some men (of his tribe went to Khaibar, and they were separated from one another, and they found one of them slain. The rest of the hadith is the same. And it was said in this connection: Allah's Messenger (may peace be him) did not approve of his blood go waste. He paid blood-wit of one hundred camels of Sadaqa.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 344750,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241260,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "1.00",
        "babName": " AL-OASAMAH",
        "hadithNumber": 4126,
        "hadithText": "<p>\nAbu Laila 'Abdullah b. 'Abd al-Rahman b. Sahl reported that the elderly persons of (the tribe) had informed Sahl b. Abu Hathma that 'Abdullah b. Sahl and Muhayyisa went out to Khaibar under some distress which had afflicted them. Muhayyisa came and informed that Abdutlah b. Sahl had been killed, and (his dead body) had been thrown in a well or in a ditch. He came to the Jews and said: By Allah, it is you who have killed him. They said: By Allah, we have not killed him. He then came to his people, and made mention of that to them. Then came he and his brother Huwayyisa, and he was older than he, and 'Abd al-Rahman b. Sahl. Then Muhayyisa went to speak, and it was he who had accompanied ('Abdullah) to Khaibar, whereupon Allah's Messenger (ﷺ) said to Muhayyisa: Observe greatness of the great (he meant the seniority of age). Then Huwayyisa spoke and then Muhayyisa also spoke. Thereupon Allah's Messenger (ﷺ) said: They should either pay blood-wit for your companion, or be prepared for war. Allah's Messenger (ﷺ) wrote about it to them (to the Jews). They wrote: Verily, by Allah, we have not killed him. Thereupon Allah's Messenger (ﷺ) said to Huwayyisa and Muhayyisa and Abd al-Rahman: Are you prepared to take oath in order to entitle yourselves for the blood-wit of your companion? They said: No. He (the Holy Prophet) said: Then the Jews will take oath (of their innocence). They said: They are not Muslims. Allah's Messenger (ﷺ), however, himself paid the blood-wit to them and sent to them one hundred camels until they entered into their houses, Sahl said: One red she-camel among them kicked me.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 344760,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241270,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "1.00",
        "babName": " AL-OASAMAH",
        "hadithNumber": 4127,
        "hadithText": "<p>\nSulaiman b. Yasar, the freed slave of Maimuna, the wife of Allah's Apostle (ﷺ), narrated from one of the Ansari Companions of Allah's Messenger (ﷺ) that Allah's Messenger (ﷺ) retained (the practice) of Qasama as it was in the pre-Islamic days.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 344770,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241280,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "1.00",
        "babName": " AL-OASAMAH",
        "hadithNumber": 4128,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Ibn Shihab with the same chain of transmitters but with this addition:\" Allah's Messenger (ﷺ) decided (according to Qasama) between the persons of Ansar (and yours) about a slain (Muslim) for which they made claim against the Jews</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 344780,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241290,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "1.00",
        "babName": " AL-OASAMAH",
        "hadithNumber": 4129,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Abu Salama b. 'Abd al-Rahman and Sulaiman b. Yasar.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 344790,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241300,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "2.00",
        "babName": " PERTAINING TO THE COMBATANTS AND APOSTATES",
        "hadithNumber": 4130,
        "hadithText": "<p>\nAnas b. Malik reported that some people belonging (to the tribe) of 'Uraina came to Allah's Messenger (ﷺ) at Medina, but they found its climate uncogenial. So Allah's Messenger (ﷺ) said to them: If you so like, you may go to the camels of Sadaqa and drink their milk and urine. They did so and were all right. They then fell upon the shepherds and killed them and turned apostates from Islam and drove off the camels of the Prophet (ﷺ). This news reached Allah's Apostle (ﷺ) and he sent (people) on their track and they were (brought) and handed over to him. He (the Holy Prophet) got their hands cut off, and their feet, and put out their eyes, and threw them on the stony ground until they died.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 344800,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241310,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "2.00",
        "babName": " PERTAINING TO THE COMBATANTS AND APOSTATES",
        "hadithNumber": 4131,
        "hadithText": "<p>\nAnas reported: Eight men of the tribe of 'Ukl came to Allah's Messenger (ﷺ) and swore allegiance to him on Islam, but found the climate of that land uncogenial to their health and thus they became sick, and they made complaint of that to Allah's Messenger (ﷺ), and he said: Why don't you go to (the fold) of our camels along with our shepherd, and make use of their milk and urine. They said: Yes. They set out and drank their (camels') milk and urine and regained their health. They killed the shepherd and drove away the camels. This (news) reached Allah's Messenger (ﷺ) and he sent them on their track and they were caught and brought to him (the Holy Prophet). He commanded about them, and (thus) their hands and feet were cut off and their eyes were gouged and then they were thrown in the sun, until they died. \nThis hadith has been narrated on the authority of Ibn al-Sabbah with a slight variation of words.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 344810,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241320,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "2.00",
        "babName": " PERTAINING TO THE COMBATANTS AND APOSTATES",
        "hadithNumber": 4132,
        "hadithText": "<p>\nAnas b. Malik reported that some people of the tribe of 'Ukl or 'Uraina came to Allah's Messenger (ﷺ), and they found the climate of Medina uncogenial. Allah's Messenger (ﷺ) commanded them to the milch she-camels and commanded them to drink their urine and their milk. The rest of the hadith is the same (and the concluding words are):\" Their eyes were pierced, and they were thrown on the stony ground. They were asking for water, but they were not given water.\"</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 344820,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241330,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "2.00",
        "babName": " PERTAINING TO THE COMBATANTS AND APOSTATES",
        "hadithNumber": 4133,
        "hadithText": "<p>\nAbu Qilaba reported: I was sitting behind 'Umar b. 'Abd al-'Aziz and he said to the people: What do you say about al-Qasama? Thereupon 'Anbasa said: Anas b Malik narrated to us such and such (hadith pertaining to al-Qasama). I said: This is what Anas had narrated to me: People came to Allah's Apostle (ﷺ), and the rest of the hadith is the same. When I (Abu Qilaba) finished (the narration of this hadith), 'Anbasa said: Hallowed be Allah. I said: Do you blame me (for telling a lie)? He ('Anbasa) said: No. This is how Anas b Malik narrated to us. O people of Syria, you would not be deprived of good, so long as such (a person) or one like him lives amongst you.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 344830,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241340,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "2.00",
        "babName": " PERTAINING TO THE COMBATANTS AND APOSTATES",
        "hadithNumber": 4134,
        "hadithText": "<p>\nAnas b. Malik reported: There came to Allah's Messenger (ﷺ) eight persons from the tribe of 'Ukl, but with this addition that he did not cauterise (the wounds which hid been inflicted upon them while punishing them).</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 344840,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241350,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "2.00",
        "babName": " PERTAINING TO THE COMBATANTS AND APOSTATES",
        "hadithNumber": 4135,
        "hadithText": "<p>\nAnas reported: There came to Allah's Messenger (ﷺ) some ponple from 'Uraina. They embraced Islam and swore allegiance to him and there had spread at that time pleurisy. The rest of the hadith is the same (but with this addition):\" There were by his (the Prophet's) side about twenty young men of the Ansar; he sent them (behind) them (culprits), and he also sent along with them one expert in following the track so that he might trace their footprints.\"</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 344850,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241360,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "2.00",
        "babName": " PERTAINING TO THE COMBATANTS AND APOSTATES",
        "hadithNumber": 4136,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 344861,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241370,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "2.00",
        "babName": " PERTAINING TO THE COMBATANTS AND APOSTATES",
        "hadithNumber": 4137,
        "hadithText": "<p>\nAnas reported that Allah's Messenger (ﷺ) pierced their eyes because they had pierced the eyes of the shepherds.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 344880,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241380,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "3.00",
        "babName": " THE JUSTIFICATION OF QISAS (RETRIBUTION) WHEN ONE IS KILLED WITH STONE OR ANY OTHER HEAVY THING AND KILLING OF A MALE FOR THE MURDER OF A FEMALE",
        "hadithNumber": 4138,
        "hadithText": "<p>\nAnas b. Malik reported that a Jew killed a girl with a stone for her silver ornaments. She was brought to Allah's Messenger (ﷺ) when there was yet some life in her. He (the Holy Prophet) said to her: Has so and so killed you? She indicated with the nod of her head: No. He said for the second time, and she again said: No with the nod of her head. He asked for the third time, and she said: Yes with the nod of her head and Allah's Messenger (ﷺ) commanded to crush his head between two stones.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 344890,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241390,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "3.00",
        "babName": " THE JUSTIFICATION OF QISAS (RETRIBUTION) WHEN ONE IS KILLED WITH STONE OR ANY OTHER HEAVY THING AND KILLING OF A MALE FOR THE MURDER OF A FEMALE",
        "hadithNumber": 4139,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Shu'ba with the same chain of transmitters and in the hadith narrated on the authority of Ibn Idris (the words are):\" He (commanded) to crush his head between two stones.\"</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 344900,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241400,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "3.00",
        "babName": " THE JUSTIFICATION OF QISAS (RETRIBUTION) WHEN ONE IS KILLED WITH STONE OR ANY OTHER HEAVY THING AND KILLING OF A MALE FOR THE MURDER OF A FEMALE",
        "hadithNumber": 4140,
        "hadithText": "<p>\nAnas reported that a Jew killed a girl of the Ansar for her ornaments and then threw her in a well and smashed her head with a stone. He was caught and brought to the Messenger of Allah (ﷺ), and he commanded that he should be stoned to death. So he was stoned until he died.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 344910,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241410,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "3.00",
        "babName": " THE JUSTIFICATION OF QISAS (RETRIBUTION) WHEN ONE IS KILLED WITH STONE OR ANY OTHER HEAVY THING AND KILLING OF A MALE FOR THE MURDER OF A FEMALE",
        "hadithNumber": 4141,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Ayyub with the same chain of transmitters.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 344920,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241420,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "3.00",
        "babName": " THE JUSTIFICATION OF QISAS (RETRIBUTION) WHEN ONE IS KILLED WITH STONE OR ANY OTHER HEAVY THING AND KILLING OF A MALE FOR THE MURDER OF A FEMALE",
        "hadithNumber": 4142,
        "hadithText": "<p>\nAnas b. Malik reported: A girl was found with her head crushed between two stones. They asked her as to who had done that-has so and so (done it) until they mentioned a Jew. She indicated with the nod of her head (that it was so). So the Jew was caught, and he made confession (of his guilt). And Allah's Messenger (ﷺ) commanded that his head be smashed with stones.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 344930,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241430,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "4.00",
        "babName": " WHEN ANYONE ATTACKS THE LIFE OF A PERSON, OR HIS LIMB, AND THE VICTIM WARDS OFF THE ATTACK AND IN SELFDEFENCE EITHER THE LIFE OF THE ASSAILANT IS LOST OR HIS LIMB BROKEN, THERE WOULD BE NO PENALTY ON THE VICTIM",
        "hadithNumber": 4143,
        "hadithText": "<p>\nImran b. Husain reported: Ya'la b. Munya or Ibn Umayya fought with a person, and the one bit the hand of the other. And he tried to draw his hand from his mouth and thus his foreteeth ware pulled out. They referred their dispute to Allah's Apostle (ﷺ), whereupon he said: Does any one of you bite as the camel bites? So there is no blood-wit for it.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 344940,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241440,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "4.00",
        "babName": " WHEN ANYONE ATTACKS THE LIFE OF A PERSON, OR HIS LIMB, AND THE VICTIM WARDS OFF THE ATTACK AND IN SELFDEFENCE EITHER THE LIFE OF THE ASSAILANT IS LOST OR HIS LIMB BROKEN, THERE WOULD BE NO PENALTY ON THE VICTIM",
        "hadithNumber": 4144,
        "hadithText": "<p>\nThis hadith has been transmitted on the authority of Ya'la.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 344950,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241450,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "4.00",
        "babName": " WHEN ANYONE ATTACKS THE LIFE OF A PERSON, OR HIS LIMB, AND THE VICTIM WARDS OFF THE ATTACK AND IN SELFDEFENCE EITHER THE LIFE OF THE ASSAILANT IS LOST OR HIS LIMB BROKEN, THERE WOULD BE NO PENALTY ON THE VICTIM",
        "hadithNumber": 4145,
        "hadithText": "<p>\n'Imran b. Husain reported that a person bit the arm of another person; he pulled it out and his foretooth fell down. This matter was taken to Allah's Apostle (ﷺ), and he turned it down saying: Did you want to eat his flesh?</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 344960,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241460,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "4.00",
        "babName": " WHEN ANYONE ATTACKS THE LIFE OF A PERSON, OR HIS LIMB, AND THE VICTIM WARDS OFF THE ATTACK AND IN SELFDEFENCE EITHER THE LIFE OF THE ASSAILANT IS LOST OR HIS LIMB BROKEN, THERE WOULD BE NO PENALTY ON THE VICTIM",
        "hadithNumber": 4146,
        "hadithText": "<p>\nSafwan b. Ya'la reported that a person bit the arm of the servant of Ya'la b. Munya. He pulled it and his foretooth fell. The matter was referred to Allah's Apostle (ﷺ) and he turned it down and said: Did you intend to bite his hand, as the camel bites?</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 344970,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241470,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "4.00",
        "babName": " WHEN ANYONE ATTACKS THE LIFE OF A PERSON, OR HIS LIMB, AND THE VICTIM WARDS OFF THE ATTACK AND IN SELFDEFENCE EITHER THE LIFE OF THE ASSAILANT IS LOST OR HIS LIMB BROKEN, THERE WOULD BE NO PENALTY ON THE VICTIM",
        "hadithNumber": 4147,
        "hadithText": "<p>\n'Imran b. Husain reported that a person bit the hand of a person. He withdrew his hand and his foretooth or foreteeth fell down. He (the man who lost his teeth) referred the matter to Allah's Messenger (ﷺ) and he said, What do you want me to do? Do you ask me that I should order him to put his hand in your mouth, and you should bite it as the camel bites? (If you want retaliation, then the only way out is) that you put your hand in his mouth (allow him) to bite that and then draw it away.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 344980,
        "last_updated": "2015-02-12 12:01:36"
    },
    {
        "englishURN": 241480,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "4.00",
        "babName": " WHEN ANYONE ATTACKS THE LIFE OF A PERSON, OR HIS LIMB, AND THE VICTIM WARDS OFF THE ATTACK AND IN SELFDEFENCE EITHER THE LIFE OF THE ASSAILANT IS LOST OR HIS LIMB BROKEN, THERE WOULD BE NO PENALTY ON THE VICTIM",
        "hadithNumber": 4148,
        "hadithText": "<p>\nSafwan b. Ya'la b. Munya reported on the authority of his father that there came to Allah's Apostle (ﷺ) a person who had bitten the hand of another person and who had withdrawn his hand (and as a result thereof) his foreteeth had fallen (those which had bitten). The Apostle of Allah (ﷺ) turned down his (claim), and said: Do you wish to bite as the camel bites?</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 344990,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241490,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "4.00",
        "babName": " WHEN ANYONE ATTACKS THE LIFE OF A PERSON, OR HIS LIMB, AND THE VICTIM WARDS OFF THE ATTACK AND IN SELFDEFENCE EITHER THE LIFE OF THE ASSAILANT IS LOST OR HIS LIMB BROKEN, THERE WOULD BE NO PENALTY ON THE VICTIM",
        "hadithNumber": 4149,
        "hadithText": "<p>\nSafwan b. Ya'la b. Umayya thus reported from his father: I participated in the expedition to Tabuk with Allah's Apostle (ﷺ). And Ya'la used to say: That was the most weighty of my deeds, in my opinion. Safwan said that Ya'la had stated: I had a servant; he quarrelled with another person, and the one bit the hand of the other. ('Ata' said that Safwan had told him which one had bitten the hand of the other.) So he whose hand was bitten drew ill from (the mouth) of the one who had bitten it and (in this scuffle) one of his foreteeth was also drawn out. They both came to Allah's Apostle (ﷺ) and he declared his (claim for the compensation of) tooth as invalid.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 345000,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241500,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "4.00",
        "babName": " WHEN ANYONE ATTACKS THE LIFE OF A PERSON, OR HIS LIMB, AND THE VICTIM WARDS OFF THE ATTACK AND IN SELFDEFENCE EITHER THE LIFE OF THE ASSAILANT IS LOST OR HIS LIMB BROKEN, THERE WOULD BE NO PENALTY ON THE VICTIM",
        "hadithNumber": 4150,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Juraij with the same chain of transmitters.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 345010,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241510,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "5.00",
        "babName": " THE VERACITY OF RFTRIBUTION IN CASE OF TOOTH",
        "hadithNumber": 4151,
        "hadithText": "<p>\nAnas reported that Umm Haritha, the sister of Rubayyi' (she was the father's sister of Hadrat Anas) injured a person (she broke his teeth). The dispute was referred to Allah's Apostle (ﷺ). Allah's Messenger (ﷺ) said: Retribution, retribution. Umm Rubayyi' said: Messenger of Allah, will retribution be taken from so and so? By Allah, it shall not be taken from her (i. e. from Umm Haritha). Thereupon Allah's Apostle said: Hallowed be Allah. O Umm Rubayyi', Qisas (retribution is a command, prescribed) in the Book of Allah. She said: No, by Allah, Qisas will never be taken from her; and she went on saying this until they (the relatives of the one who had been injured) accepted the blood-wit. Thereupon Allah's Messenger (ﷺ) said: Verily there are amongst the servants of Allah (such pious persons) who, if they take oath of Allah, He honours it.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 345020,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241520,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "6.00",
        "babName": " WHEN IT IS PERMISSIBLE TO TAKE THE LIFE OF A MUSLIM",
        "hadithNumber": 4152,
        "hadithText": "<p>\n'Abdullah (b. Mas'ud) reported Allah's Messenger (ﷺ) as saying: It is not permissible to take the life of a Muslim who bears testimony (to the fact that there is no god but Allah, and I am the Messenger of Allah, but in one of the three cases: the married adulterer, a life for life, and the deserter of his Din (Islam), abandoning the community.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 345030,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241530,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "6.00",
        "babName": " WHEN IT IS PERMISSIBLE TO TAKE THE LIFE OF A MUSLIM",
        "hadithNumber": 4153,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of A'mash.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 345040,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241540,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "6.00",
        "babName": " WHEN IT IS PERMISSIBLE TO TAKE THE LIFE OF A MUSLIM",
        "hadithNumber": 4154,
        "hadithText": "<p>\n'Abdullah (b. Mas'ud) reported: Allah's Messenger (ﷺ) stood up and said: By Him besides Whom there is no god but He, the blood of a Muslim who bears the testimony that there is no god but Allah, and I am His Messenger, may be lawfully shed only in case of three persons: the one who abandons Islam, and deserts the community [Ahmad, one of the narrators, is doubtful whether the Prophet (ﷺ) used the word li'l-jama'ah or al-jama'ah), and the married adulterer, and life for life.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 345051,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241550,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "6.00",
        "babName": " WHEN IT IS PERMISSIBLE TO TAKE THE LIFE OF A MUSLIM",
        "hadithNumber": 4155,
        "hadithText": "<p>\nThis hadith has been reported on the authority of A'mash with the same chain of narrators but with a slight variation of words, i. e. he did not say: By Him besides Whom there is no god.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 345070,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241560,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "7.00",
        "babName": " HE WHO SHEDS THE BLOOD FIRST OF ALL BEARS THE BURDEN OF ALL SUBSEQUENT MURDERS",
        "hadithNumber": 4156,
        "hadithText": "<p>\n'Abdullah (b. Mas'ud) reported: Allah's Apostle (ﷺ) having said: No person who is killed unjustly, but the share of (this offence of his also) falls upon the first son of Adam, for he was the first to introduce killing.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 345080,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241570,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "7.00",
        "babName": " HE WHO SHEDS THE BLOOD FIRST OF ALL BEARS THE BURDEN OF ALL SUBSEQUENT MURDERS",
        "hadithNumber": 4157,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Jarir and 'Isa b. Yunus with a slight variation of words.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 345090,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241580,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "8.00",
        "babName": " THE (CASES OF) BLOODSHED WOULD BE DECIDED FIRST OF ALL ON THE DAY OF JUDGMENT",
        "hadithNumber": 4158,
        "hadithText": "<p>\n'Abdullah b. (Mas'ud) reported Allah's Messenger (ﷺ) as saying: The first (thing) that will be decided among people on the Day of Judgment will pertain to bloodshed.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 345100,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241590,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "8.00",
        "babName": " THE (CASES OF) BLOODSHED WOULD BE DECIDED FIRST OF ALL ON THE DAY OF JUDGMENT",
        "hadithNumber": 4159,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of 'Abdullah through another chain of transmitters with a slight variation of words.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 345110,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241600,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "8.00",
        "babName": " THE (CASES OF) BLOODSHED WOULD BE DECIDED FIRST OF ALL ON THE DAY OF JUDGMENT",
        "hadithNumber": 4160,
        "hadithText": "<p>\nAbu Bakra reported that (in the Farewell Address) Allah's Apostle (ﷺ) said: Time has completed a cycle and come to the state of the day when Allah created the heavens and the earth. The year is constituted of twelve months, of which four are sacred; three of them consecutive, viz. Dhu'l-Qa'da, Dhu'l- Hijja and Muharram, and also Rajab the month of Mudar which comes between Jumada and Sha'ban. He (the Holy Prophet) then said: which month is this? We said Allah and His Messenger know best. He (the narrator) said: He (the Holy Prophet) remained silent for some time until we thought that he would give it a name other than that (by which it was known). He said: Is it not Dha'l-Hijja? We said: Yes. He (the Holy Prophet) said: Which city is this? We said: Allah and His Messenger know best. He (the Holy Prophety remained silent until we thought that he would give it another name. He (the Holy Prophet) said: Is it not the Balda (the city of Mecca)? We said: Yes. He said: What day is this? We said: Allah and His Messenger know best. He (the Holy Prophet) remained silent until we thought that he would give it another name. He said: Is it not the Day of Sacrifice? We said: Allah's Messenger. yes. Thereupon he said: Your blood, your property (Muhammad, one of the narrators, said: I think, he also said this) and your honour are sacred to you like the sacredness of this day of yours, in this city of yours, and in this month of yours. You will soon meet your Lord and He will ask you about your deeds. So do not turn after me unbelievers (or misguided), some of you striking the necks of the others. Behold I let him who is present convey to him who is absent, for many a one whom a message is conveyed has a more retentive memory than one who hears. He again said: Behold! have I not delivered (the message) to you? This hadith has been narrated through another chain of transmitters, but with a slight variation of words.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 345130,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241610,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "8.00",
        "babName": " THE (CASES OF) BLOODSHED WOULD BE DECIDED FIRST OF ALL ON THE DAY OF JUDGMENT",
        "hadithNumber": 4161,
        "hadithText": "<p>\nAbu Bakra reported that when it was that day (the 10th of Dhu'l-Hijja) he mounted his camel and a person caught its nosestring, whereupon he said: Do you know which day is this? They said: Allah and His Messenger know best. (The Prophet [may peace be upon him] kept silent) until we thought that he would give that another name. He said: Is it not the day of Nahr (Sacrifice) (10th of Dhu'l- Hijja)? We said: Allah's Messenger, yes. He (again) said: Which month is it? We said: Allah and His Messenger knows best. He said: Is it not Dhu'l-Hijja? We said: Allah's Messenger, yes. He said: Which city is this? We said: Allah and His Messenger know best. He (the narrator) said (that the Prophet kept silent until we thought that he would give it another name besides its (original) name. He said: Is it not Balda (the city of Mecca)? We said: Yes, Allah's Messenger. He (then) said: Verily your blood (lives) and your property and your honour are as sacred unto you as sacred is this day of yours, in this month of yours, in this city of yours. Let him who is present convey it to one who is absent. He then turned his attention towards two multicoloured (black and white) rams and slaughtered them, and two goats, and distributed them amongst us.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 345140,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241620,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "8.00",
        "babName": " THE (CASES OF) BLOODSHED WOULD BE DECIDED FIRST OF ALL ON THE DAY OF JUDGMENT",
        "hadithNumber": 4162,
        "hadithText": "<p>\nAbu Bakra reported that when it was the day of (Dhu'l-Hijja) Allah's Apostle (ﷺ) mounted the camel and addressed and a person had been holding its nosestring. The rest of the hadith is the same.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 345150,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241630,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "8.00",
        "babName": " THE (CASES OF) BLOODSHED WOULD BE DECIDED FIRST OF ALL ON THE DAY OF JUDGMENT",
        "hadithNumber": 4163,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Abu Bakra through another chain of transmitters (and the words are):\" Allah's Messenger (ﷺ) addressed us on the day of Nahr (Sacrifice) and said: What day is this? And the rest of the hadith is the same except that he did not make mention of\" your honour,\" and also did not make mention of this: He then turned his attention towards two rams and what follows, and in a hadith (the words pertaining to sacred- ness are recorded in this way):\" Like the sacredness of this day of yours, in this month of yours, in this city of yours to the day when you will meet your Lord. Behold, have I not conveyed (the Message of God)? They said: Yes. He said: O Allah, bear witness.\"</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 345160,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241640,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "9.00",
        "babName": " THE CONFESSION OF MURDER IS HELD VALID AND THE PERSON WHOSE MAN IS KILLED IS ENTITLED TO GET RETRIBUTION. THE OFFENDER HAS A RIGHT TO BEG FOR REMISSION",
        "hadithNumber": 4164,
        "hadithText": "<p>\n'Alqama b. Wa'il reported on the authority of his-father: While I was sitting in the company of Allah's Apostle (ﷺ), a person came there dragging another one with the help of a strap and said: Allah's Messenger, this man has killed my brother. Allah's Messenger (ﷺ) said to him: Did you kill him? And the other man said: (In case he did not make a confession of this, I shall brine, a witness against him). He (the murderer) said: Yes, I have killed him. He (the Holy Prophet) said: Why did you kill him? He said: I and he won striking down the leaves of a tree and he abused me and enraged me, and to I struck his head with an axe and killed him, whereupon Allah's Messenger (ﷺ) said: Have you anything with you to pay blood-wit on your behalf? He said: I do not possess any property but this robe of mine and this axe of mine. He (the Holy, Prophet) said: Do you think your people will pay ransom for you? He said: I am more insignificant among my people than this (that I would not be able to get this benefit from my tribe). He (the Holy Prophet) threw the strap towards him (the claimant of the blood-wit) saying: Take away your man. The man took him away, and as he returned, Allah's Messenger (ﷺ) said: If he kills him, he will be like him. He returned and said: Allah's Messenger, it has reached me that you have said that\" If he killed him, he would be like him.\" I caught hold of him according to your command, whereupon Allah's Messenger (ﷺ) said: Don't you like that he should take upon him (the burden) of your sin and the sin of your companion (your brother)? He said: Allah's Apostle, why not? The Messenger of Allah (may peace be. upon him) said: If it is so, then let it be. He threw away the strap (around the offender) and set him free.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 345170,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241650,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "9.00",
        "babName": " THE CONFESSION OF MURDER IS HELD VALID AND THE PERSON WHOSE MAN IS KILLED IS ENTITLED TO GET RETRIBUTION. THE OFFENDER HAS A RIGHT TO BEG FOR REMISSION",
        "hadithNumber": 4165,
        "hadithText": "<p>\n'Alaqama b. Wa'il reported on the authority of his father that a person was brought to the Messenger of Allah (ﷺ) who had killed another person, and the heir of the person slain had dragged him (to the Holy Prophet) with a strap around his neck. As he turned away Allah's Messenger (ﷺ) said: The killer and the killed are (doomed) to fire. A person came to the other person (the heir of the deceased) and he reported to him the words of the Messenger of Allah (ﷺ), and so he let him off. Isma'il b. Salim said: I made a mention of it to Habib b. Abu Thabit and he said: Ibn Ashwa' reported to me that Allah's Apostle (ﷺ) had asked him to pardon him, but he refused.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 345180,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241660,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "10.00",
        "babName": " BLOOD-WIT OF THE CHILD IN THE WOMB, AND THE ESSENTIALITY OF BLOOD-WIT IN CASE OF UNINTENTIONAL MURDER AND IN CASE OF THE QUASI-INTENTIONAL MURDER",
        "hadithNumber": 4166,
        "hadithText": "<p>\nAbu Huraira reported that among two women of the tribe of Hudhail one flung a stone upon the other causing an abortion to her so Allah's Apostle (may peace he upon him) gave judgment that a male or a female slave of best quality be given as compensation.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 345190,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241670,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "10.00",
        "babName": " BLOOD-WIT OF THE CHILD IN THE WOMB, AND THE ESSENTIALITY OF BLOOD-WIT IN CASE OF UNINTENTIONAL MURDER AND IN CASE OF THE QUASI-INTENTIONAL MURDER",
        "hadithNumber": 4167,
        "hadithText": "<p>\nAbu Huraira reported that Allah's Messenger (ﷺ) gave judgment in case of the abortion of a woman of Banu Lihyan (that the offender and near relative should give compensation in the form of) good quality of a slave or a slave-girl. And the woman about whom the judgment was given for compensation died and thereupon Allah's Messenger (ﷺ) gave judgment that her inheritance goes to her sons and her husband, and the payment of the blood-wit lies with the family of (one who struck her).</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 345200,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241680,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "10.00",
        "babName": " BLOOD-WIT OF THE CHILD IN THE WOMB, AND THE ESSENTIALITY OF BLOOD-WIT IN CASE OF UNINTENTIONAL MURDER AND IN CASE OF THE QUASI-INTENTIONAL MURDER",
        "hadithNumber": 4168,
        "hadithText": "<p>\nAbu Huraira reported that two women of the tribe of Hudhail fought with each other and one of them flung a stone at the other, killing her and what was in her womb. The case was brought to Allah's Messenger (ﷺ) and he gave judgment that the diyat (indemnity) of her unborn child is a male or a female slave of the best quality, and he also decided that the diyat of the woman is to be paid by her relative on the father's side, and he (the Holy Prophet) made her sons and those who were with them her heirs. Hamal b. al-Nabigha al-Hudhali said: Messenger of Allah, why should I play blood-wit for one who neither drank, nor ate, nor spoke, nor made any noise; it is like a nonentity (it is, therefore, not justifiable to demand blood-wit for it). Thereupon Allah's Messenger (ﷺ) said: He seems to be one of the brothers of soothsavers on account of the rhymed speech which he has composed.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 345210,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241690,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "10.00",
        "babName": " BLOOD-WIT OF THE CHILD IN THE WOMB, AND THE ESSENTIALITY OF BLOOD-WIT IN CASE OF UNINTENTIONAL MURDER AND IN CASE OF THE QUASI-INTENTIONAL MURDER",
        "hadithNumber": 4169,
        "hadithText": "<p>\nAbu Huraira reported that two women fought-the rest of the hadith is the same but herein no mention has been made of: He made her son and those who were with them her heirs. Someone said: Why should we pay blood-wit? And he did not name Hamal b. Malik.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 345220,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241700,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "10.00",
        "babName": " BLOOD-WIT OF THE CHILD IN THE WOMB, AND THE ESSENTIALITY OF BLOOD-WIT IN CASE OF UNINTENTIONAL MURDER AND IN CASE OF THE QUASI-INTENTIONAL MURDER",
        "hadithNumber": 4170,
        "hadithText": "<p>\nAl-Mughira b. Shu'ba reported that a woman struck her co-wife with a tent-pole and she was pregnant and she killed her. One of them belonged to the tribe of Lihyan. Allah's Messenger (ﷺ) made the relatives of the murderer responsible for the payment of blood-wit on her behalf, and fixed a slave or a female slave as the indemnity for what was in her womb. One of the persons amongst the relatives of the murderer said: Should we pay indemnity for one who, neither ate, nor drank, nor made any noise, who was just like a nonentity? Thereupon Allah's Messenger (ﷺ) remarked: He speaks rhymed phrases like the people of the desert. He did impose indemnity upon them.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 345230,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241710,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "10.00",
        "babName": " BLOOD-WIT OF THE CHILD IN THE WOMB, AND THE ESSENTIALITY OF BLOOD-WIT IN CASE OF UNINTENTIONAL MURDER AND IN CASE OF THE QUASI-INTENTIONAL MURDER",
        "hadithNumber": 4171,
        "hadithText": "<p>\nAl-Mughira b. Shu'ba reported: A woman killed her fellow-wife with a tent-pole. Her case was brought to Allah's Messenger (ﷺ), and he gave judgment that blood-wit should be paid by the relatives (of the offender) on the father's side. And as she was pregnant, he decided regarding her unborn child that a male or a female slave of good quality be given. Some of her offender's) relatives said: Should we make compensation for one who never ate, nor drank, nor made any noise, who was like a nonentity? Thereupon Allah's Messenger (ﷺ) said: He was talking rhymed phrases like the rhymed phrases of desert Arabs.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 345240,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241720,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "10.00",
        "babName": " BLOOD-WIT OF THE CHILD IN THE WOMB, AND THE ESSENTIALITY OF BLOOD-WIT IN CASE OF UNINTENTIONAL MURDER AND IN CASE OF THE QUASI-INTENTIONAL MURDER",
        "hadithNumber": 4172,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Mansur with the same chain of transmitters.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 345250,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241730,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "10.00",
        "babName": " BLOOD-WIT OF THE CHILD IN THE WOMB, AND THE ESSENTIALITY OF BLOOD-WIT IN CASE OF UNINTENTIONAL MURDER AND IN CASE OF THE QUASI-INTENTIONAL MURDER",
        "hadithNumber": 4173,
        "hadithText": "<p>\nMansur transmitted this hadith with a slight variation of words.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 345260,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 241740,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 16,
        "bookName": "The Book Pertaining to the Oath, for Establishing the Responsibility of Murders, Fighting, Requital ",
        "babNumber": "10.00",
        "babName": " BLOOD-WIT OF THE CHILD IN THE WOMB, AND THE ESSENTIALITY OF BLOOD-WIT IN CASE OF UNINTENTIONAL MURDER AND IN CASE OF THE QUASI-INTENTIONAL MURDER",
        "hadithNumber": 4174,
        "hadithText": "<p>\nMiswar b. Makhrama reported that 'Umar b. Khattab consulted people about the diyat of abortion of an unboam child. Mughira b. Shu'ba said: I bear witness to the fact that Allah's Messenger (ﷺ) gave judgment about it that a good quality of slave or female slave should be given for it. Thereupon 'Umar said: Bring one who may bear witness to you. Then Muhammad b. Maslama bore witness to him.</b>",
        "bookID": "16.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 345270,
        "last_updated": "2012-04-26 14:00:00"
    }
]