[
    {
        "englishURN": 266100,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "1.00",
        "babName": " EXHORTATION FOR REPENTANCE",
        "hadithNumber": 6610,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: Allah, the Exalted and Glorious, said: I live in the thought of My servant and I am with him as he remembers Me. (The Holy Prophet) further said: By Allah, Allah is more pleased wth the repentance of His servant than what one of you would do on finding the lost camel in the waterless desert. When he draws near Me by the span of his hand. I draw near him by the length of a cubit and when he draws near Me by the length of a cubit. I draw near him by the length of a fathom and when he draws near Me walking I draw close to him hurriedly.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 371660,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266110,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "1.00",
        "babName": " EXHORTATION FOR REPENTANCE",
        "hadithNumber": 6611,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: Allah is more pleased with the repentance of His servant when he turns penitently towards Him than one of you would be on finding the lost camel.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 371670,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266120,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "1.00",
        "babName": " EXHORTATION FOR REPENTANCE",
        "hadithNumber": 6612,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Abu Huraira through another chain of transmitters.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 371680,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266130,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "1.00",
        "babName": " EXHORTATION FOR REPENTANCE",
        "hadithNumber": 6613,
        "hadithText": "<p>\nHarith b. Suwaid said: I went to see 'Abdullah to inquire about his health as he was sick and he narrated to us a hadith of Allahs Messenger (ﷺ). He heard Allah's Messenger (ﷺ) as saying: Allah is more pleased with the repentance of His believing servant than a person who loses his riding beast carrying food and drink. He sleeps (being disappointed of its recovery) and then gets up and goes in search for that, until he is stricken with thirst. then comes back to the place where he had been before and goes to sleep completely exhausted placing his head upon his hands waiting for death. And when he gets up, lot there is before him his riding beast and his provisions of food and drink. Allah is more pleased with the repentance of His servant than the recovery of this riding beast along with the provisions (of food and drink).</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 371690,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266140,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "1.00",
        "babName": " EXHORTATION FOR REPENTANCE",
        "hadithNumber": 6614,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of A'mash through another chain of transmitters.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 371700,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266150,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "1.00",
        "babName": " EXHORTATION FOR REPENTANCE",
        "hadithNumber": 6615,
        "hadithText": "<p>\n'Abdullah reported Allah's Messenger (ﷺ) as saying: Allah is more pleased with the repentance of a believing man. The rest of the hadith is the same.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 371710,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266160,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "1.00",
        "babName": " EXHORTATION FOR REPENTANCE",
        "hadithNumber": 6616,
        "hadithText": "<p>\nNu'man b. Bashir reported: Allah is more pleased with the repentance of a believing servant than of a person who set out on a journey with a provision of food and drink on the back of his camel. He went on until he came to a waterless desert and he felt like sleeping. So he got down under the shade of a tree and was overcome by sleep and his camel ran away. As he got up he tried to see (the camel) standing upon a mound. but did not find it. He then got upon the other mound, but could not see anything. He then climbed upon the third mound but did not see anything until he came back to the place where he had been previously. And as he was sitting (in utter disappointment) there came to him the camel, till that (camel) placed its nosestring in his hand. Allah is more pleased with the repentance of His servant than the person who found (his lost camel) in this very state. Simak reported that Sha'bi was of the opinion that Nu'min traced it to Allah's Apostle (ﷺ). Simak, however, did not hear that himself.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 371720,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266170,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "1.00",
        "babName": " EXHORTATION FOR REPENTANCE",
        "hadithNumber": 6617,
        "hadithText": "<p>\nAl-Bara' b. 'Azib reported Allah's Messenger (ﷺ) as saying that Allah's Messenger (ﷺ) said: What is your opinion about the delight of a person whose camel loaded with the provisions of food and drink is lost and that moves about with its nosestring trailing upon the waterless desert in which there is neither food nor drink, and lie wanders about in search of that until he is completely exhausted and then accidentally it happens to pass by the trunk of a tree and its nosestring gets entangled in that and he finds it entangled therein? He (in response to the question of the Holy Prophet) said: Allah's Messenger, he would feel highly delighted. Thereupon Allah's Messenger (ﷺ) said. By Allah, Allah is more delighted at the repentance of His servant than that person (as he finds his lost) camel.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 371730,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266180,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "1.00",
        "babName": " EXHORTATION FOR REPENTANCE",
        "hadithNumber": 6618,
        "hadithText": "<p>\nAnas b. Malik reported that Allah's Messenger (ﷺ) said: Allah is more pleased with the repentance of a servant as he turns towards Him for repentance than this that one amongst you is upon the camel in a waterless desert and there is upon (that camel) his provision of food and drink also and it is lost by him, and he having lost all hope (to get tbat) lies down in the shadow and is disappointed about his camel and there he finds that camel standing before him. He takes hold of his nosestring and then out of boundless joy says: 0 Lord, Thou art my servant and I am Thine Lord. He commits this mistake out of extreme delight.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 371740,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266190,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "1.00",
        "babName": " EXHORTATION FOR REPENTANCE",
        "hadithNumber": 6619,
        "hadithText": "<p>\nAnas b. Malik reported that Allah's Messenger (ﷺ) said: Allah is more pleased with the repentance of His servant than if one of you gets up and he finds his camel missing in a waterless desert (and then he accidentally finds it). This hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 371751,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266200,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "2.00",
        "babName": " THE OBLITERATION OF SINS WITH THE HELP OF SEEKING FORGIVENESS PROM ALLAH",
        "hadithNumber": 6620,
        "hadithText": "<p>\nAbu Sirma reported that when the time of the death of Abu Ayyub Ansari drew near, he said: I used to conceal from you a thing which I heard from Allah's Messenger (ﷺ) and I heard Allah's Messenger (ﷺ) as saying: Had you not committed sins, Allah would have brought into existence a creation that would have committed sin (and Allah) would have forgiven them.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 371770,
        "last_updated": "2015-01-26 12:36:02"
    },
    {
        "englishURN": 266210,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "2.00",
        "babName": " THE OBLITERATION OF SINS WITH THE HELP OF SEEKING FORGIVENESS PROM ALLAH",
        "hadithNumber": 6621,
        "hadithText": "<p>\nAbu Ayyub Ansari reported that Allah's Messenger (ﷺ) said: If you were not to commit sins, Allah would have swept you out of existence and would have replaced you by another people who have committed sin, and then asked forgiveness from Allah, and He would have granted them pardon.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 371780,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266220,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "2.00",
        "babName": " THE OBLITERATION OF SINS WITH THE HELP OF SEEKING FORGIVENESS PROM ALLAH",
        "hadithNumber": 6622,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) having said: By Him in Whose Hand is my life, if you were not to commit sin, Allah would sweep you out of existence and He would replace (you by) those people who would commit sin and seek forgiveness from Allah, and He would have pardoned them.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 371790,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266230,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "3.00",
        "babName": " THE EXCELLENCE OF CONSTANT REMEMBRANCE OF ALLAH AND MEDITATION IN THE AFFAIRS OF THE HEREAFTER AND PERMISSION OF ABANDONING IT AT TIMES AND ATTENDING TO THE AFFAIRS OF THE WORLD",
        "hadithNumber": 6623,
        "hadithText": "<p>\nHanzala Usayyidi, who was amongst the scribes of Allah's Messenger (ﷺ). reported: I met Abu Bakr. He said: Who are you? He (Hanzala) said: Hanzala has turned to be a hypocrite. He (Abu Bakr) said: Hallowed be Allah, what are you saying? Thereupon he said: I say that when we are in the company of Allah's Messenger (ﷺ) we ponder over Hell-Fire and Paradise as if we are seeing them with our very eyes and when we are away from Allah's Messenger (ﷺ) we attend to our wives, our children, our business; most of these things (pertaining to After-life) slip out of our minds. Abu Bakr said: By Allah, I also experience the same. So I and Abu Bakr went to Allah's Messenger (ﷺ) and said to him: Allah's Messenger, Hanzala has turned to be a hypocrite. Thereupon Allah's Messenger (ﷺ) said: What has happened to you? I said: Allah's Messenger, when we are in your company, we are reminded of Hell-Fire and Paradise as if we are seeing them with our own eyes, but whenever we go away from you and attend to our wives, children and business, much of these things go out of our minds. Thereupon Allah's Messenger (ﷺ) said: By Him in Whose Hand is my life, if your state of mind remains the same as it is in my presence and you are always busy in remembrance (of Allah), the Angels will shake hands with you in your beds and in your paths but, Hanzala, time should be devoted (to the worldly affairs) and time (should be devoted to prayer and meditation). He (the Holy Prophet) said this thrice.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 371800,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266240,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "3.00",
        "babName": " THE EXCELLENCE OF CONSTANT REMEMBRANCE OF ALLAH AND MEDITATION IN THE AFFAIRS OF THE HEREAFTER AND PERMISSION OF ABANDONING IT AT TIMES AND ATTENDING TO THE AFFAIRS OF THE WORLD",
        "hadithNumber": 6624,
        "hadithText": "<p>\nHanzala reported: We were in the company of Allah's Messenger (ﷺ) and he delivered to us a sermon and made a mention of Hell-Fire. Then I came to my house and began to laugh with my children and sport with my wife. (Hanzala) further reported: I went out and met Abu Bakr and made a mention of that to him. Thereupon he said: I have done the same as you have mentioned. So we went to see Allah's Messenger (ﷺ) and said to him: Allah's Messenger, Hanzala has turned to he a hypocrite. And he (the Holy Prophet) said Show respite. And then I narrated to him the story, and Abu Bakr said: I have done the same as he has done. Thereupon he (the Holy Prophet) said: Hanzala, there is a time for worldly affairs and a time for (worship and devotion), and if your state of mind is always the same as it is at the time of remembrance of Allah, the Angels would shake hands with you and would greet you on the path by saying: As-Salamu-Alaikum.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 371810,
        "last_updated": "2015-04-26 21:36:08"
    },
    {
        "englishURN": 266250,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "3.00",
        "babName": " THE EXCELLENCE OF CONSTANT REMEMBRANCE OF ALLAH AND MEDITATION IN THE AFFAIRS OF THE HEREAFTER AND PERMISSION OF ABANDONING IT AT TIMES AND ATTENDING TO THE AFFAIRS OF THE WORLD",
        "hadithNumber": 6625,
        "hadithText": "<p>\nHanzala Taimi Ufayyidi, the scribe of Allah's Messenger (ﷺ), reported: We were in the presence of Allah's Messenger (ﷺ) and he brought to our minds the problems pertaining to Paradise and Hell-Fire. The rest of the hadith is the same.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 371820,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266260,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "4.00",
        "babName": " THE MERCY OF ALLAH PREDOMINATES HIS WRATH",
        "hadithNumber": 6626,
        "hadithText": "<p>\nAbu Huraira reported that Allah's Messenger (ﷺ) said: When Allah created the creation as He was upon the Throne, He put down in His Book: Verily, My mercy predominates My wrath.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 371830,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266270,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "4.00",
        "babName": " THE MERCY OF ALLAH PREDOMINATES HIS WRATH",
        "hadithNumber": 6627,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: Allah, the Exalted and Glorious, said: My mercy excels My wrath.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 371840,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266280,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "4.00",
        "babName": " THE MERCY OF ALLAH PREDOMINATES HIS WRATH",
        "hadithNumber": 6628,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: When Allah created the creation, He ordained for Himself and this document is with Him: Verily, My mercy predominates Mv wrath.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 371850,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266290,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "4.00",
        "babName": " THE MERCY OF ALLAH PREDOMINATES HIS WRATH",
        "hadithNumber": 6629,
        "hadithText": "<p>\nAbu Huraira reported: I heard Allah's Messenger (ﷺ) as saying: Allah created mercy in one hundred parts and He retained with Him ninety-nine parts, and He has sent down upon the earth one part, and it is because of this one part that there is mutual love among the creation so much so that the animal lifts up its hoof from its young one, fearing that it might harm it.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 371860,
        "last_updated": "2015-01-26 12:34:08"
    },
    {
        "englishURN": 266300,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "4.00",
        "babName": " THE MERCY OF ALLAH PREDOMINATES HIS WRATH",
        "hadithNumber": 6630,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: Allah created one hundred (parts of mercy) and He distributed one amongst His creation and kept this one hundred excepting one with Himself (for the Day of Resurrection).</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 371870,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266310,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "4.00",
        "babName": " THE MERCY OF ALLAH PREDOMINATES HIS WRATH",
        "hadithNumber": 6631,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: There are one hundred (parts of) mercy for Allah and He has sent down out of these one part of mercy upon the jinn and human beings and animals and the insects, and it is because of this (one part) that they love one another, show kindness to one another and even the beast treats its young one with affection, and Allah has reserved ninety nine parts of mercy with which He would treat His servants on the Day of Resurrection.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 371880,
        "last_updated": "2015-02-10 12:09:33"
    },
    {
        "englishURN": 266320,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "4.00",
        "babName": " THE MERCY OF ALLAH PREDOMINATES HIS WRATH",
        "hadithNumber": 6632,
        "hadithText": "<p>\nSalman Farisi reported Allah's Messenger (ﷺ) as saying: Verily, there are one hundred (parts of) mercy for Allah, and it is one part of this mercy by virtue of which there is mutual love between the people and ninety-nine reserved for the Day of Resurrection.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 371890,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266330,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "4.00",
        "babName": " THE MERCY OF ALLAH PREDOMINATES HIS WRATH",
        "hadithNumber": 6633,
        "hadithText": "<p>\nThis hadith has been transmitted on the authority of Mu'tamir, reported on the authority of his father.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 371900,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266340,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "4.00",
        "babName": " THE MERCY OF ALLAH PREDOMINATES HIS WRATH",
        "hadithNumber": 6634,
        "hadithText": "<p>\nSalman reported that Allah's Messenger (ﷺ) said: Verily, Allah created, on the same very day when He created the heavens and the earth, one hundred parts of mercy. Every part of mercy is coextensive with the space between the heavens. and the earth and He out of this mercy endowed one part to the earth and it is because of this that the mother shows affection to her child and even the beasts and birds show kindness to one another and when there would be the Day of Resurrection, Allah would make full (use of Mercy).</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 371910,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266350,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "4.00",
        "babName": " THE MERCY OF ALLAH PREDOMINATES HIS WRATH",
        "hadithNumber": 6635,
        "hadithText": "<p>\n'Umar b. Khattab reported that there were brought some prisoners to Allah's Messenger (ﷺ) amongst whom there was also a woman, who was searching (for someone) and when she found a child amongst the prisoners, she took hold of it, pressed it against her chest and provided it suck. Thereupon Allah's Messenger (ﷺ) said: Do you think this woman would ever afford to throw her child in the Fire? We said: By Allah, so far as it lies in her power, she would never throw the child in Fire. ' Thereupon Allah's Messenger (ﷺ) said: Allah is more kind to His servants than this woman is to her child.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 371920,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266360,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "4.00",
        "babName": " THE MERCY OF ALLAH PREDOMINATES HIS WRATH",
        "hadithNumber": 6636,
        "hadithText": "<p>\n'Ala' reported on the authority of his father who reported on the authority of Abu Huraira that Allah's Messenger (ﷺ) said: If a believer were to know the punishment (in Hell) none would have the audacity to aspire for Paradise (but he would earnestly desire to be rescued from Hell), and if a non-believer were to know what is there with Allah as a mercy. none would have been disappointed in regard to Paradise.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 371930,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266370,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "4.00",
        "babName": " THE MERCY OF ALLAH PREDOMINATES HIS WRATH",
        "hadithNumber": 6637,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying that a person who had never done any good deed asked the members of his family to burn his dead body when he would die and to scatter half of its ashes over the land and half in the ocean. By Allah, if Allah finds him in His grip, He would torment him with a torment with which He did not afflict anyone amongst the people of the world; and when the person died, it was done to him as he had commanded (his family) to do. Allah commanded the land to collect (the ashes scattered on it) and He commanded the ocean and that collected (ashes) contained in it. Allah questioned him why he had done. that He said: My Lord, it is out of Thine fear that I have done it and Thou art well aware of it, and Allah granted him pardon:.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 371940,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266380,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "4.00",
        "babName": " THE MERCY OF ALLAH PREDOMINATES HIS WRATH",
        "hadithNumber": 6638,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying that a person committed sin beyond measure and when he was going to die, he left this will: (When I die), bum my dead body and then cast them (the ashes) to the wind and in the ocean. By Allah, if my Lord takes hold of me, He would torment me as He has not tormented anyone else. They did as he had asked them to do. He (the Lord) said to the earth: Return what you have taken. And he was thus restored to his (original form). He (Allah) said to him: What prompted you to do this? He said: My Lord, it was Thine fear or Thine awe, and Allah pardoned him because of this. \n\nAbu Huraira reported Allah's Messenger (ﷺ) as saying that a woman was thrown into Hell-Fire because of a cat whom she had tied and did not provide it with food. nor did she set it free to eat vermin of the earth until it died emaciated. \n\nAz-Zuhri said: (These two ahadith) show that a person should neither feel confident (of getting into Paradise) because of his deeds, nor should he lose (all hopes) of getting into Paradise.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 371951,
        "last_updated": "2021-03-25 15:53:27"
    },
    {
        "englishURN": 266390,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "4.00",
        "babName": " THE MERCY OF ALLAH PREDOMINATES HIS WRATH",
        "hadithNumber": 6639,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying that a servant transgressed the litnit in committing sins. The rest of the hadith is the same but there is no mention of the story of the cat in it and in the hadith transmitted on the authority of Ziibaidl (the words are):\" Allah, the Exalted and Glorious, said to everything which had taken a part of lies ashes to return what it had taken.\"</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 371970,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266400,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "4.00",
        "babName": " THE MERCY OF ALLAH PREDOMINATES HIS WRATH",
        "hadithNumber": 6640,
        "hadithText": "<p>\nAbu Sa'id Khudri reported that Allah's Messenger (ﷺ) said that a person amongst the earlier nations before you was conferred property and children by Allah, He said to his children: 'You must do as I command you to do, otherwise I will make others besides you as my inheritors. As I die, burn my body and blow my ashes in the wind as I do not find any merit of mine which would please Allah, and if Allah were to take hold of me, He would punish me. He took a pledge from them and they did as he commanded thein to do. Allah said: What prompted you to do this? He said: My Lord. Thine fear, and Allah did not punish him at all.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 371980,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266410,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "4.00",
        "babName": " THE MERCY OF ALLAH PREDOMINATES HIS WRATH",
        "hadithNumber": 6641,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Shu'ba with the chain of transmitters but with a slight variation of wording and Qatada explained the word\" lam yasiru\" as:\" I find no good in store for rxie in the eye of Allah.\"</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 371990,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266430,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "5.00",
        "babName": " REPENTANCE IS ACCEPTED SO LONG AS ONE REPENTS AFTER COMMITTING SINS",
        "hadithNumber": 6643,
        "hadithText": "<p>\nAbu Huraira reported lie heard Allah's Messenger (ﷺ) as saying that a servant committed a sin. The rest of the hadith is the same, but there is a slight variation of wording.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 372020,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266440,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "5.00",
        "babName": " REPENTANCE IS ACCEPTED SO LONG AS ONE REPENTS AFTER COMMITTING SINS",
        "hadithNumber": 6644,
        "hadithText": "<p>\nAbu Musa reported Allah's Messenger (ﷺ) as saying that Allah, the Exalted and Glorious, Stretches out His Hand during the night so that the people may repent for the fault committed from dawn till dusk and He stretches out His Hand during the day so that the people may repent for the fault committed from dusk to dawn. (He would accept repentance) before the sun rises in the west (before the Day of Resurrection). \n\nA hadith like this has been narrated on the authority of Shu'ba with the same chain of transmitters.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 372031,
        "last_updated": "2015-02-19 11:20:53"
    },
    {
        "englishURN": 266450,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "6.00",
        "babName": " ALLAH'S SENSE OF HONOUR, AND HIS PROHIBITION OF THE ABOMINABLE ACTS",
        "hadithNumber": 6645,
        "hadithText": "<p>\n'Abdullah reported Allah's Messenger (ﷺ) as saying: Nothing is more loveable to Allah than His praise as He has praised Himself and no one is more self-respecting than Allah Himself and it As because of this that He has prohibited abominable acts.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 372050,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266460,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "6.00",
        "babName": " ALLAH'S SENSE OF HONOUR, AND HIS PROHIBITION OF THE ABOMINABLE ACTS",
        "hadithNumber": 6646,
        "hadithText": "<p>\n'Abdullah reported Allah's Messenger (ﷺ) as saying: None is more self-respectidg than Allah and it is because of this that He has prohibited abominable acts-both visible and invisible-and none loves His praise more than Allah Himself.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 372060,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266470,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "6.00",
        "babName": " ALLAH'S SENSE OF HONOUR, AND HIS PROHIBITION OF THE ABOMINABLE ACTS",
        "hadithNumber": 6647,
        "hadithText": "<p>\n'Abdullah b. Mas'ud reported it directly from Allah's Messenger (ﷺ) that he said: None is more self-respecting than Allah and it is because of this that He has prohibited abominable acts-both visible and invisible and nothing is loved by Allah more than the praise of His Ownself and it is because of this that He has praised Himself.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 372070,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266480,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "6.00",
        "babName": " ALLAH'S SENSE OF HONOUR, AND HIS PROHIBITION OF THE ABOMINABLE ACTS",
        "hadithNumber": 6648,
        "hadithText": "<p>\nAbdullah b. Mas'ud reported that Allah's Messenger (ﷺ) said: None loves one's own praise more than Allah, the Exalted and Glurious, does. It is because of this that He has praised Himself, and none is more self-respecting than Allah and it is because of this that He has prohibited abominable acts and there is none who is more anxious to accept the apologies of the people than Allah Himself and it is because of this that He has revealed the Book and sent the Messengers.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 372080,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266490,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "6.00",
        "babName": " ALLAH'S SENSE OF HONOUR, AND HIS PROHIBITION OF THE ABOMINABLE ACTS",
        "hadithNumber": 6649,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: Allah is self-respecting and a believer is also self-respecting and the respect of Allah is injured if a believer does what He has forbidden him to do.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 372090,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266500,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "6.00",
        "babName": " ALLAH'S SENSE OF HONOUR, AND HIS PROHIBITION OF THE ABOMINABLE ACTS",
        "hadithNumber": 6650,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Asma' daughter of Abu Bakr, through another chain of transmitters.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 372100,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266510,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "6.00",
        "babName": " ALLAH'S SENSE OF HONOUR, AND HIS PROHIBITION OF THE ABOMINABLE ACTS",
        "hadithNumber": 6651,
        "hadithText": "<p>\nAbu Salama reported from Abu Huraira that he narrated that Allah's Messenger (may peace be upon hin) said: There is none more self-respecting than Allah, the Exalted and Glorious There is no mention of the narration of Asma'.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 372110,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266520,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "6.00",
        "babName": " ALLAH'S SENSE OF HONOUR, AND HIS PROHIBITION OF THE ABOMINABLE ACTS",
        "hadithNumber": 6652,
        "hadithText": "<p>\nAsma' reported that Allah's Apostle (ﷺ) said: There is none more self-respecting than Allah, the Exalted and Glorious.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 372120,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266530,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "6.00",
        "babName": " ALLAH'S SENSE OF HONOUR, AND HIS PROHIBITION OF THE ABOMINABLE ACTS",
        "hadithNumber": 6653,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (may peace be upon him ) as saying: A believer is self-respecting and Allah is extremely self-respecting.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 372130,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266540,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "6.00",
        "babName": " ALLAH'S SENSE OF HONOUR, AND HIS PROHIBITION OF THE ABOMINABLE ACTS",
        "hadithNumber": 6654,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Shu'ba through another chain of transmitters.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 372140,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266550,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "7.00",
        "babName": " THE WORDS OF ALLAH\" THE GOOD DEEDS TAKE AWAY THE EVIL DEEDS\"",
        "hadithNumber": 6655,
        "hadithText": "<p>\n'Abdullah b. Mas'ud reported that a person kissed a woman and he came to Allah's Apostle (ﷺ) and made a mention of that to him. It was (on this occasion) that this verse was revealed:\" And observe prayer at the (two) ends of the day and in the first hours of the night. Surely, good deeds take away evil deeds. That is a reminder for the mindful\" (xi. 115). That person said: Allah's Messenger, does it concern me only? He (the Holy Prophet) said: It concerns every one of my Unimah, who acts according to it.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 372150,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266560,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "7.00",
        "babName": " THE WORDS OF ALLAH\" THE GOOD DEEDS TAKE AWAY THE EVIL DEEDS\"",
        "hadithNumber": 6656,
        "hadithText": "<p>\nIbn Mas'ud reported that a person came to Allah's Messenger (ﷺ) and told him that he had kissed a woman or touched her with his hand or did something like this. He inquired of him about its expiation. It was (on this occasion) that Allah, the Exalted and Glorious, revealed this verse (as mentioned above).</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 372160,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266570,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "7.00",
        "babName": " THE WORDS OF ALLAH\" THE GOOD DEEDS TAKE AWAY THE EVIL DEEDS\"",
        "hadithNumber": 6657,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Sulaiman Taimi with the same chain of transmitters that a person had taken liberty with a woman less than fomication. He came to 'Umar b. Khattab and he took it to be a serious offence. Then he came to Abu Bakr and he also took it to be a serious offence. Then he came the Allahs Apostle (ﷺ) and he made a mention of this to him. The rest of the hadith is the same.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 372170,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266580,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "7.00",
        "babName": " THE WORDS OF ALLAH\" THE GOOD DEEDS TAKE AWAY THE EVIL DEEDS\"",
        "hadithNumber": 6658,
        "hadithText": "<p>\n'Abdullah reported that a person came to Allah's Apostle (ﷺ) and said: Allah's Messenger, I sported with a woman in the outskirts of Medina, and I have committed an offence short of fornication. Here I am (before you), kindly deliver verdict about me which you deem fit. Unar said: Allah concealed your fault. You had better conceal it yourself also. Allah's Apostle (ﷺ), however, gave no reply to him. The man stood up and went away and Allah's Apostle (ﷺ) sent a person after him to call him and be recited this verse:\" And observe prayer at the ends of the day and in the first hours of the night. Surely, good deeds take away evil deeds. That is a reminder for the mindful\" (xi. 115). A person amongst the people said: Allah's Apostle, does it concern this marn only? Thereupon he (the Holy Prophet) said: No, but the people at large.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 372180,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266590,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "7.00",
        "babName": " THE WORDS OF ALLAH\" THE GOOD DEEDS TAKE AWAY THE EVIL DEEDS\"",
        "hadithNumber": 6659,
        "hadithText": "<p>\nThis hadith has been transmitted by Abu al-Ahwas and in this (these words are) also found: Mu'adh said: Allah's Messenger, does it concern this particular case or to all of us? And he (the Holy Prophet) said: Of course, to all of you.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 372190,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266600,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "7.00",
        "babName": " THE WORDS OF ALLAH\" THE GOOD DEEDS TAKE AWAY THE EVIL DEEDS\"",
        "hadithNumber": 6660,
        "hadithText": "<p>\nAnas reported that a person came to Allah's Apostle (ﷺ) said: Allah's Messenger, I have committed an offence which deserves imposition of haad, so impose it upon me according to the Book of Allah. Thereupon he said: Were you not present with us at the time of prayer? He said: Yes. Thereupon he said: You have been granted pardon.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 372200,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266610,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "7.00",
        "babName": " THE WORDS OF ALLAH\" THE GOOD DEEDS TAKE AWAY THE EVIL DEEDS\"",
        "hadithNumber": 6661,
        "hadithText": "<p>\nAbu Umama reported: We were sitting in the mosque in the company of Allah's Messenger (ﷺ). A person came there and said: Allah's Messenger, I have committed an offence which deserves the imposition of hadd upon me, so impose it upon me. Allah's Messenger (ﷺ) kept silent. He repeated it and said: Allah's Messenger, I have committed an offence which deserves the imposition of hadd upon me, so impose it upon me. He (the Holy Prophet) kept silent, and it was at this time that Iqama was pronounced for prayer (and the prayer was observed). And when Allah's Apostle (ﷺ) had concluded the payer that person followed Allah's Messenger (ﷺ). Abu Umama said: I too followed Allah's Messenger (ﷺ) after he had concluded the prayer, so that I should know what answer he would give to that person. That person remained attached to Allah's Messenger (ﷺ) and said: Allah's Messenger, I have committed an offence which deserves imposition of hadd upon me, so impose it upon me. Abu Umama reported that Allah's Messenger (ﷺ) said to him: Didn't you see that as you got out of the house, you performed ablution perfectly well. He said: Allah's Messenger, of course. I did it. He again said to him: Then you observed prayer along with us. He said: Allah's Messenger, yes, it is so. Thereupon Allah's Messenger (ﷺ) said to him: Verily, Allah has exempted you from the imposition of hadd, or he said. From your sin.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 372210,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266620,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "7.00",
        "babName": " THE WORDS OF ALLAH\" THE GOOD DEEDS TAKE AWAY THE EVIL DEEDS\"",
        "hadithNumber": 6662,
        "hadithText": "<p>\nAbu Sa'id al-Khudri reported Allah's Messenger (ﷺ) as saying: There was a person before you who had killed ninety-nine persons and then made an inquiry about the learned persons of the world (who could show him the way to salvation). He was directed to a monk. He came to him and told him that he had killed ninety-nine persons and asked him whether there was any scope for his repentance to be accepted. He said: No. He killed him also and thus completed one hundred. He then asked about the learned persons of the earth and he was directed to a scholar, and he told him that he had killed one hundred persons and asked him whether there was any scope for his repentance to be accepted. He said: Yes; what stands between you and the repentance? You better go to such and such land; there are people devoted to prayer and worship and you also worship along with them and do not come to the land of yours since it was an evil land (for you). So he went away and he had hardly covered half the distance when death came to him and there was a dispute between the angels of mercy and the angels of punishment. The angels of mercy said: This man has come as a penitant and remorseful to Allah and the angels of punishment said: He has done no good at all. Then there came another angel in the form of a human being in order to decide between them. He said: You measure the land to which he has drawn near. They measured it and found him nearer to the land where he intended to go (the land of piety), and so the angels of mercy took possession of it. Qatada said that Hasan told him that it was said to them that as death approached him, he crawled upon his chest (and managed) to slip in the land of mercy.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 372220,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266630,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "7.00",
        "babName": " THE WORDS OF ALLAH\" THE GOOD DEEDS TAKE AWAY THE EVIL DEEDS\"",
        "hadithNumber": 6663,
        "hadithText": "<p>\nAbu Sa'id al-Khudri reported Allah's Messenger (ﷺ) as saying that a man killed ninety-nine persons and then he began to make an inquiry whether there was any way left for him for repentance. He came to a monk and asked him about that, and he said: There is no chance for repentance for you. He killed the monk also and then began to make an inquiry and moved from one village to another village where there lived pious persons, and as he had covered some distance, he was overtaken by death, but he managed to crawl upon his chest (to the side nearer to the place where the pious men lived). He died and then there was a dispute between the angels of mercy and the angels of punishment and (when it was measured) he was found to be nearer to the village where pious persons were living equal to the Space of a span and he was thus included among them.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 372230,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266640,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "7.00",
        "babName": " THE WORDS OF ALLAH\" THE GOOD DEEDS TAKE AWAY THE EVIL DEEDS\"",
        "hadithNumber": 6664,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Qatida with the same chain of transmitters but (with this variation of wording):\" Allah commanded the earth (from where) he wanted to come out to move itself away and to the other earth (where he wanted to go) to draw nearer.\"</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 372240,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266650,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "8.00",
        "babName": " THROWING OF NON-BELIEVERS IN HELL-FIRE FOR BELIEVERS AS DIVINE GRACE AND MERCY",
        "hadithNumber": 6665,
        "hadithText": "<p>\nAbu Musa' reported that Allah's Messenger (ﷺ) said: When it will be the Day of Resurrection Allah would deliver to every Muslim a Jew or a Christian and say: That is your rescue from Hell-Fire.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 372250,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266660,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "8.00",
        "babName": " THROWING OF NON-BELIEVERS IN HELL-FIRE FOR BELIEVERS AS DIVINE GRACE AND MERCY",
        "hadithNumber": 6666,
        "hadithText": "<p>\nAbu Burda reported on the authority of his father that Allah's Apostle (ﷺ) said: No Muslim would die but Allah would admit in his stead a Jew or a Christian in Hell-Fire. 'Umar b. Abd al-'Aziz took an oath: By One besides Whom there is no god but He, thrice that his father had narrated that to him from Allah's Messenger (ﷺ).</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 372260,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266670,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "8.00",
        "babName": " THROWING OF NON-BELIEVERS IN HELL-FIRE FOR BELIEVERS AS DIVINE GRACE AND MERCY",
        "hadithNumber": 6667,
        "hadithText": "<p>\nThis hadith has been transmitted on the authority of 'Aun b. Utba.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 372270,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266680,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "8.00",
        "babName": " THROWING OF NON-BELIEVERS IN HELL-FIRE FOR BELIEVERS AS DIVINE GRACE AND MERCY",
        "hadithNumber": 6668,
        "hadithText": "<p>\nAbu Burda reported Allah's Messenger (ﷺ) as saying: There would come people amongst the Muslims on the Day of Resurrection with as heavy sins as a mountain, and Allah would forgive them and He would place in their stead the Jews and the Christians. (As far as I think), Abu Raub said: I do not know as to who is in doubt. Abu Burda said: I narrated it to 'Umar b. 'Abd al-'Aziz, whereupon he said: Was it your father who narrated it to you from Allah's Apostle (ﷺ)? I said: Yes.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 372280,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266690,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "8.00",
        "babName": " THROWING OF NON-BELIEVERS IN HELL-FIRE FOR BELIEVERS AS DIVINE GRACE AND MERCY",
        "hadithNumber": 6669,
        "hadithText": "<p>\nSafwan b. Muhriz reported that a person said to Ibn 'Umar: How did you hear Allah's Messenger (ﷺ) as saying something about intimate conversation? He said: I heard him say: A believer will be brought to his Lord, the Exalted and Glorious, on the Day of Resurrection and He would place upon him His veil (of Light) and make him confess his faults and say: Do you recognise (your faults)? He would say: My Lord, I do recognise (them). He (the Lord) would say: I concealed them for you in the world. And today I forgive them. And he would then be given the Book containing (the account of his) good deeds. And so far as the non-believers and hypocrites are concerned, there would be general announcement about them before all creation telling them that these (people, i. e. non-believers and hypocrites) told a lie about Allah.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 372290,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266700,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "9.00",
        "babName": " PERTAINING TO THE REPENTANCE OF KA'B B. MALIK AND HIS COMPANIONS",
        "hadithNumber": 6670,
        "hadithText": "<p>\nIbn Shihab reported that Allah's Messenger (ﷺ) made an expedition to Tabuk and he (the Holy Prophet) had in his mind (the idea of threatening the) Christians of Arabia in Syria and those of Rome. Ibn Shihab (further) reported that 'Abd al-Rahman b. 'Abdullah b. Ka'b informed him that Abdullah b. Ka'b who served as the guide of Ka'b b. 'Malik as he became blind that he heard Ka'b b. Malik narrate the story of his remaining behind Allah's Messenger (ﷺ) from the Battle of Tabuk. Ka'b b. Malik said: I never remained behind Allah's Messenger (ﷺ) from any expedition which he undertook except the Battle of Tabuk and that of the Battle of Badr. So far as the Battle of Badr is concerned, nobody was blamed for remaining behind as Allah's Messenger (ﷺ) and the Muslims (did not set out for attack but for waylaying) the caravan of the Quraish, but it was Allah Who made them confront their enemies without their intention (to do so). I had the honour to be with Allah's Messenger (ﷺ) on the night of 'Aqaba when we pledged our allegiance to Islam and it was more dear to me than my participation in the Battle of Badr, although Badr was more popular amongst people as compared with that (Tabuk). And this is my story of remaining back from Allah's Messenger (ﷺ) on the occasion of the Battle of Tabuk. Never did I possess means enough and (my circumstances) more favourable than at the occasion of this expedition. And, by Allah, I had never before this expedition simultaneously in my possession two rides. Allah's Messenger (ﷺ) set out for this expedition in extremely hot season; the journey was long and the land (which he and his army had to cover) was waterless and he had to confront a large army, so he informed the Muslims about the actual situation (they had to face), so that they should adequately equip themselves for this expedition, and he also told them the destination where he intended to go. And the Muslims who accompanied Allah's Messenger (ﷺ) at that time were large in numbers but there was no proper record of them. Ka'b (further) said: Few were the persons who wanted to absent themselves, and were under the impression that they could easily conceal themselves (and thus remain undetected) until revelations from Allah, the Exalted and Glorious (descended in connection with them). \nAnd Allah's Messenger (ﷺ) set out on an expedition when the fruits were ripe and their shadows had been lengthened. I had weakness for them and it was during this season that Allah's Messenger (ﷺ) made preparations and the Muslims too along with them. I also set out in the morning so that I should make preparations along with them but I came back and did nothing and said to myself: I have means enough (to make preparations) as soon as I like. And I went on doing this (postponing my preparations) until people were about to depart and it was in the morning that Allah's Messenger (ﷺ) set out and the Muslims too along with him, but I made no preparations. I went early in the morning and came back, but I made no decision. I continued to do so until they (the Muslims) hastened and covered a good deal of distance. I also made up my mind to march on and to meet them. Would that I had done that but perhaps it was not destined for me. After the departure of Allah's Messenger (ﷺ) as I went out amongst people, I was shocked to find that I did not find anyone like me but people who were labelled as hypocrites or the people whom Allah granted exemption because of their incapacity and Allah's Messenger (ﷺ) took no notice of me until he had reached Tabuk. (One day as he was sitting amongst the people in Tabuk) he said: What has happened to Ka'b b. Malik? A person from Banu' Salama said: Allah's Messenger, the (beauty) of his cloak and his appreciation of his sides have allured him and he was thus detained. Mua'dh b. Jabal said: Woe be upon that what you contend. Allah's Messenger, by Allah, we know nothing about him but good. Allah's Messenger (ﷺ), however, kept quiet. It was during that time that he (the Holy Prophet) saw a person (dressed in all white (garment) shattering the illusion of eye (mirage). \nThereupon Allah's Messenger (ﷺ) said: May he be Abu Khaithama and, lo, it was Abu Khaithama al-Ansari and he was that person who contributed a sa' of dates and was scoffed at by the hypocrites. Ka'b b. Malik farther said: When this news reached me that Allah's Messenger (ﷺ) was on his way back from Tabuk I was greatly perturbed. I thought of fabricating false stories and asked myself how I would save myself from his anger on the following day. In this connection, I sought the help of every prudent man from amongst the members of my family and when it was said to me that Allah's Messenger (ﷺ) was about to arrive, all the false ideas banished (from my mind) and I came to the conclusion that nothing could save me but the telling of truth, so I decided to speak the truth and it was in the morning that Allah's Messenger (ﷺ) arrived (in Medina). And it was his habit that as he came back from a journey he first went to the mosque and observed two Rak'ahs of nafl prayer (as a mark of gratitude) and then sat amongst people. And as he did that, those who had remained behind him began to put forward their excuses and take an oath before him and they were more than eighty persons. Allah's Messenger (ﷺ) accepted their excuses on the very face of them and accepted their allegiance and sought forgiveness for them and left their secret (intentions) to Allah, until I presented myself to him. I greeted him and he smiled and there was a tinge of anger in that. He (the Holy Prophet) then said to me: Come forward. I went forward until I sat in front of him. He said to me: What kept you back? Could you not afford to go in for a ride? I said: Allah's Messenger, by Allah, if I were to sit in the presence of anybody else from amongst the worldly people I would have definitely saved myself from his anger on one pretext (or the other) and I have also the knack to fall into argumentation, but, by Allah, I am fully aware of the fact that if I were to put forward before you a false excuse to please you Allah would definitely provoke your wrath upon me, and if I speak the truth you may be annoyed with me, but I hope that Allah would make its end well and, by Allah, there is no valid excuse for me. By Allah, I never possessed so good means, and I never had such favourable conditions for me as I had when I stayed behind you (failed to join the expedition). \nThereupon, Allah's Messenger (ﷺ) said: This man told the truth, so get up until Allah gives a decision in your case. I stood up and some people of Banu' Salama followed me in hot haste, and they said to me: By Allah, we do not know about you that you committed a sin prior to this. You, however, showed inability to put forward an excuse before Allah's Messenger (ﷺ) as those who stayed behind him have put forward excuses. It would have been enough for the forgiveness of your sin that Allah's Messenger (ﷺ) would have sought forgiveness for you. By Allah, they continued to incite me until I thought of going back to Allah's Messenger (ﷺ) and contradict myself. Then I said to them: Has anyone else also met the same fate? They said: Yes, two persons have met the same fate as has fallen to you and they have made the sane statement as you have made, and the same verdict has been delivered in their case as it has been delivered in your case. I said: Who are they? They said: Murara b. ar-Rabi'a 'Amiri and Hilal b. Umayya al-Waqafi. They made a mention of these two pious persons to me who had participated in the Battle of Badr and there was an example for me in them. I went away when they named these two persons. Allah's Messenger (ﷺ) forbade the Nluslims to talk with three of us from amongst those (persons) who had stayed behind him. The people began to avoid us and their attitude towards us underwent a change and it seemed as if the whole atmosphere had turned (hostile) against us and it was in fact the same atmosphere ot which I was fully aware and in which I had lived (for a fairly long time). We spent fifty nights in this very state and my two friends confined themselves withen their houses and spent (most of the) time in weeping, but as I was young and strong amongst them I got (out of my house), participated in congregational prayers, moved about in the bazar; but none spoke to me. I came to Allah's Messenger (ﷺ) as he sat amongst (people) after the prayer, greeted him and asked myself whether his lips stirred in response to my greetings (or not). \nThen I observed prayer beside him and looked at him with stealing glances and when I attended to my prayer, he looked at me and when I cast a glance at him he turned away his eyes from me. And when the harsh treatment of the Muslims towards me extended to a (considerable) length of time, I walked until I climbed upon the wall of the garden of Abu Qatada, and he was my cousin, and I had the greatest love for him. I greeted him but, by Allah, he did not respond to my greetings. I said to him: Abu Qatada, I adjure you by Allah, arn't you well aware of the fact that I love Allah and His Messenger (ﷺ) the most. He kept quiet. I again repeated saying: I adjure you by Allah. arn't you well aware of the fact that I love Allah and His Messenger (ﷺ) the most. He kept quiet. I again adjured him, whereupon he said: Allah and the Messenger (ﷺ) are best aware of it. My eyes began to shed tears and I came back climbing down from the wall and as I was walking in the bazar of Medina a Nabatean from amongst the Nabateans of Syria, who had come to sell foodgrains in Medina, asked people to direct him to Ka'b b. Malik. People gave him the indication by pointing towards me. He came to me and delivered to me a letter of the King of Ghassan and as I was a scribe I read that letter and it was written like this:\" Coming to my point, it has been conveyed to us that your friend (the Holy Prophet) is subjecting you to cruelty and Allah has not created you for a place where you are to be degraded and where you cannot find your right place, so you come to us that we should accord you honour. As I read that letter I said: This is also a calamity, so I burnt it in the oven. When out of the fifty days, forty days had passed and Allah's Messenger (ﷺ) received no revelation, there came the messenger of Allah's Messenger (ﷺ) to me and said: Verily, Allah's Messenger (ﷺ) has commanded you to remain separate from your wife. I said: Should I divorce her or what (else) should I do? He said: No, but only remain separate from her and don't have sexual contact with her. \nThe same message was sent to my companions. So I said to my wife: You better go to your parents and stay there with them until Allah gives the decision in my case. The wife of Hilal b. Umayya came to Allah's Messenger (ﷺ) and said: Allah's Messenger, Hilal b. Umayya is a senile person, he has no servant. Do you disapprove of my serving him? He said: No, but don't go near him. She said: By Allah, he has no such instinct in him. By Allah, he spends his time in weeping from that day to this day. Some of the members of my family said to me: Were you to seek permission from Allah's Messenger (ﷺ) in regard to your wife as he has granted permission to the wife of Hilal b. Umayya to serve him. I said: I would not seek permission from Allah's Messenger (ﷺ), for I cannot say what Allah's Apostle may say in response to seeking my permission. Moreover, I am a young man. It was in this state that I spent ten more nights and thus fifty nights had passed that (people) had observed boycott with us. It was on the morning of the fiftieth night that I observed my dawn prayer and was sitting on one of the roofs of our houses. And I was in fact sitting in that very state which Allah, the Exalted and Glorious, has described about us in these words:\" Life had become hard for myself and the earth had compressed despite its vastness,\" that I heard the noise of an announcer from the peak of the hill of Sal' saying at the top of his voice: Ka'b b. Malik, there is glad tidings for you. I fell down in prostration and came to realise that there was (a message of) relief for me. Allah's Messenger (ﷺ) had informed the people of the acceptance of our repentance by Allah as he offered the dawn prayer. So the people went on to give us glad tidings and some of them went to my friends in order to give them the glad tidings and a person galloped his horse and came from the tribe of Aslam and his horse reached me more quickly than his voice. And when he came to me whose sound I heard, he gave me the glad tidings. I took off my clothes and clothed him with them because of his bringing good news to me and, by Allah, I possessed nothing else (in the form of clothes) than these two on that occasion, and I asked one to lend me two clothes and dressed myself in them. \nI came to Allah's Messenger (ﷺ) and on my way I met groups of people who greeted me because of (the acceptance of) repentance and they said: Here is a greeting for you for your repentance being accepted by Allah. (I moved on) until I came to the mosque and Allah's Messenger (ﷺ) had been sitting there amongst persons. So Talha b. 'Ubaidullah got up and rushed towards me and he shook hands with me and greeted me and, by Allah, no person stood up (to greet me) from amongst the emigrants except he. Ka'b said that he never forgot (this good gesture of) Talha. Ka'b further said: I greeted Allah's Messenger (ﷺ) with Assalam-o-'Alaikam and his face was glistening because of delight, and he said: Let there be glad tidings and blessings for you, the like of which (you have neither found nor you will find, as you find today) since your mother gave your birth. I said: Allah's Messenger. is this acceptance of repentance from you or from Allah? He said: No, (it is not from ma), it is from Allah, and it was common with Allah's Messenger (ﷺ) that as he was happy his face brightened up and it looked like a part of the moon and it was from this that we recognised it (his delight). As I sat before him, I said: Allah's Messenger, am I allowed to give in charity my wealth for Allah's sake and for the sake of His Messenger (ﷺ)? Thereupon Allah's Messenger (ﷺ) said: Keep some property with you as it is better for you. I said: I shall keep with me that part (of my property) which fell to my lot (on the occasion of the expedition of) Khaibar. I said: Allah's Messenger, verily, Allah has granted me salvation because of truth and, therefore, (I think) that repentance implies that I should not speak anything but truth as long as I live. He said: By Allah, I do not know whether anyone amongst the Muslims was put to more severe trial than I by Allah because of telling the truth. And since I made a mention of this to Allah's Messenger (ﷺ) up to this day I have not told any lie and, by Allah, I have decided not to tell a lie and I hope that Allah would save me (from trials) for the rest of my life and Allah, the Exalted and Glorious, revealed these verses:\" \nCertainly, Allah has turned in Mercy to the Prophet and the emigrants and the helpers who followed him in the hour of hardship after the hearts of a part of them were about to deviate; then He turned to them in mercy. Surely, to them He is Compassionate, Merciful and (He turned in Mercy) to the three who were left behind until the earth despite its vastness became strait for them and their souls were also straitened to them.\" And this revelation reached up to the (words):\" O you who believe, develop God consciousness, and be with the truthful\" (ix. 117-118). Ka'b said: By Allah, since Allah directed me to Islam there has been no blessing more significant for me than this truth of mine which I spoke to Allah's Messenger (ﷺ) and if I were to tell a lie I would have been ruined as were ruined those who told lies, for in regard to those who told lies Allah used harshest words used for anyone as He descended revelation (and the words of Allah are):\" They will swear by Allah to you when you return to them so that you may leave them alone. So leave them alone. Surely, they are unclean and their resort is Hell, recompense for what they earned. They will swear to you that you may be pleased with them but if you are pleased with them, yet surely Allah is not pleased with the transgressing people\" (ix. 95-96). K'ab said that the matter of us three persons was deferred as compared with those who took an oath in the presence of Allahs Messenger (ﷺ) and he accepted their allegiance and sought forgiveness for them and Allah did not give any decision in regard to us. It was Allah, the Exalted and Glorious, Who gave decisions in our case, three who remained behind. (The words of the Qur'an)\" the three who were left behind\" do not mean that we remained back from Jihad but these imply that He kept our matter behind them who took oath and presented excuse before Him. This hadith has been narrated on the authority of Zuhri with the same chain of transmitters.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 372301,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266710,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "9.00",
        "babName": " PERTAINING TO THE REPENTANCE OF KA'B B. MALIK AND HIS COMPANIONS",
        "hadithNumber": 6671,
        "hadithText": "<p>\n'Abdullah b. K'ab, who was his (Ka'b's) guide as he became blind, reported that he heard from Ka'b b. Malik the story of his staying behind Allah's Messenger (ﷺ) from the expedition of Tabuk. The rest of the hadith is the same (but with this variation) that in the narration transmitted on the authority of Yunus (the words are): When Allah's Messenger (may. peace be upon him) intended to set on an expedition he kept It as a secret, but. be did not do so in thic. expedition. And in the narration transmitted on the authority of Muhammad b. Abdullah b. Muslim, there is no mention of Abu Khaithana (Allah be pleased with him) and no mention of his meeting with Allah's Messenger (ﷺ).</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 372320,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266720,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "9.00",
        "babName": " PERTAINING TO THE REPENTANCE OF KA'B B. MALIK AND HIS COMPANIONS",
        "hadithNumber": 6672,
        "hadithText": "<p>\nIt is reported on the authority of Abdullah b. K'ab and he was the guide of Ka'b as he lost his eyesight and he was the greatest scholar amongst his people and he retained in his mind many ahadith of the Companions of Allah's Messenger (ﷺ). He said: I heard my father Ka'b b. Malik, and he fas one of those three whose repentance was accepted (by Allah). He transmitted that He never lagged behind Allah's Messenger (ﷺ) from any expedition that he undertook except two expeditions; the rest of the hadith is the same, and in the tradition narrated through another chain of transmitters the words are:\" That Allah's Messenger (ﷺ) set out on an expedition with a large number of persons more than ten thousand and this could not be recorded in the census register.\"</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 372330,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266730,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "10.00",
        "babName": " HADITH PERTAINING TO THE LIE ABOUT (HADRAT) 'A'ISHA SIDDIQA (ALLAH BE PLEASED WITH HER) AND ACCEPTING OF REPENTANCE OF THOSE WHO BROUGHT FALSE ALLEGATION ABOUT HER",
        "hadithNumber": 6673,
        "hadithText": "<p>\nSa'id b. Musayyib, 'Urwa b. Zubair, 'Alqama b. Waqqas and 'Ubaidullah b. Abdullah b. 'Utba b. Mas'ud--all of them reported the story of the false allegation against 'A'isha, the wife of Allah's Apostle (ﷺ). And they (the slanderers) said what they had to say, but Allah exonerated her of this charge and all of them reported a part of the hadith and some of them who had better memories reported more and with better retention, and I tried to retain this hadith (listening) from every one of them that they reported to me and some of them attested the other. (The sumaried substance of the false allegation is this): 'A'isha said: Whenever Allah's Messenger (ﷺ) intended to set out on a journey he cast lots amongst his wives and he took one with him in whose favour the lot was cast. It so happened that he cast lots amongst us while setting out on a battle and it was cast in my favour, so I set out along with Allah's Messenger (ﷺ). This relates to the period when the revelation concerning the commands of veil had been made. I was carried in a haudaj and I was brought down where we had to stay. In short, when we set out for return journey from the expedition and our caravan was near Medina, Allah's Messenger (ﷺ) commanded one night to march forward. I also got up when the command for the march was given and moved on until I went out of the encampments of the army and after relieving myself I came to my place. I touched my chest and found that my necklace which had been made of the stones of zafar had been broken. I retraced my steps and tried to search my necklace and this detained me there. The group of people who saddled my ride and placed my haudaj carrying me upon the camels marched on. They were under the impression that I was in it. The women in those days were light of weight and they did not wear much flesh, as they ate less food; so they did not perceive the weight of my haudaj as they placed it upon the camel as I was a young girl at that time. So they drove the camel and Eet out and I found my necklace after the army had marched. I came to my place and there was none to call and none to respond (the call). \nI waited at my place under the impression that when the people would riot find me they would come back. So I kept sitting at my place. I was overpowered by sleep and slept. Safwan b. Mu'attal Sulami Dhakwini, who had lagged behind the army because of taking rest came to my place walking in the latter part of the night and he saw the body of a person who was asleep. He came to me and recognised me as he had seen rue before it was enjoined to observe purda. I got ap by his voice as he recited Inna lillahi wa inna ilaihi raji'un [we are for Allah and to Him we have to return. ] and I covered my head with my headdress. By Allah, he did not speak to me a word and I did not hear a word from him except Inna lillahi. He made his camel kneel down and I amounted the camel as he pressed tLe camel's foreleg and he moved on leaning the camel by the nose string on which I was riding until we came to the army where it had encamped for rest because of extreme heat. Woe be upon those who harboured doubts about me and the most notorious among them was 'Abdullah b. Ubayy, the great hypocrite. We came to Medina and I fell sick for a month. The people had been deliberating over the statements of those who had brought these calumnies against me. I was absolutely unaware of anything concerning that. This, however, caused doubt in my mind that I did not see Allah's Messenger (may peace be upon him.) treating me with such kindness with which he treated me as I fell ill before this. The Prophet (ﷺ) would coome and greet me with Assalam-o-'Alaikum and only ask me how I was. This caused doubt in my mind, but I was unaware of the evil. I wept outside despite my failing health and there went along with me Umm Mistah and she said the daughter of Abu Rhm b. Muttalib b. 'Abd Manaf and his mother was the daughter of Sakhr b. 'Amir, the sister of the mother of Abu Bakr Sidiq and his son was Mistah b. Uthatha b. 'Abbad b. Muttalib. I and the daughter of Abu Rahm set towards the direction of my house. Something got into the head dress of Umm Mistah and she said: Woe be upon Mistah. And I said. Woe be upon what you say. Do you curse people who had participated in Badr? She said: Innocent woman, have you not heard what he said? I said: What did he say? She conveyed to me the statement of those who had brought false allegations against me. So my illness was aggravated. \nI went to my house and Allah's Messenger (ﷺ) came to me and he greeted me and then said: How is that woman? I said: Do you permit me to go to the (house) of my parents? She (further) said: I had at that time made up my mind to confirm this news from them. Allah's Messenger (ﷺ) permitted me. So I came to (the house of) my parents and said to my mother: Mother, do you know what the people are talking about? She said: My daughter, you should not worry. By Allah, if there is a handsome woman who is loved by her husband and he has co-wives also they talk many a thing about her. I said: Hallowed be Allah, what are the people talking about? I wept during the whole night until it was morning and I did not have a wink of sleep and I wept even in the morning. As the revelation was delayed (in regard to this matter), so Allah's Messenger (ﷺ) called 'Ali ibn Abi 'Talib and Usama b. Zaid in order to seek their advice in regard to the separation of his wife. Usama b. Zaid told Allah's Messenger (may peace be apen him) about the innocence of his wives and what he knew about his love for them. He said: Allah's Messenger, they are your wives and we know nothing else about them but goodness. And as for 'Ali b. Abu Talib, he said: Allah has not put any unnecessary burden upon you (in regard to your wives). There are a number of women besides her and if you ask that maidservant (Barira) she will tell you the truth. So, Allah's Messenger (ﷺ) called Bailra and said: Barira, did you see anything in 'A'isha which can cause doubt about her? Barira said: By Him Who sent thee with the truth, I have seen nothing objectionable in her but only this much that she is a young girl and she goes to sleep while kneading the flour and the lamb eats that. Thereupon Allah's Messenger (ﷺ) mounted the pulpit and sought vindication against 'Abdullah b. Ubayy b. Salul, and he further said: Who would exonerate me from imputations of that person who has troubled (me) in regard to my family? By Allah, I find nothing in my wife but goodness and the person whom the people have mentioned in this connection is, according to my knowledge, a thoroughly pious person, and he did never get into my house but along with me. Sa'd b. Mu'adh stood up and said: Allah's Messenger, I defend your honour against him. If he belong to the tribe of Aus we would strike his neck and if he belongs to the tribe of our brother Khazraj and you order us we would comply with your order. \nThen Sa'd b. 'Ubada stood up. He was chief of the Khazraj tribe. He was otherwise a pioas man but he had some what tribal partisanship in him and he said to Sa'd b. Mu'adh: By the everlasting existence of Allah. you are not stating the fact, you will not be able to kill him and you will not have the power to do so. Thereupon, Usaid b. Hudair stood up, and he was the first cousin of Sa'd b. Mu'adh and said to Sa'd b. 'Ubada: By the everlasting existence of Allah, you are not stating the fact. We would kill him. You are a hypocrite and so you argue in defence of the hypocrites, and thus both the tribes Aus and Khazraj were flared up, until they were about to fall upon one another and Allah's Messenger (ﷺ) kept standing upon the pulpit and Allah's Messenger (ﷺ) tried to subside their anger until they became silent and thus there was silence. 'A'isha further reported: I spent the whole day in weeping and even the night and could not have a wink of sleep even next night. My parents thought that this constant weeping of mine would break my heart. I wept and they sat beside me. In the meanwhile a woman of the Ansar came to see me. I permitted her to see me and she also began to weep. And we were in this very state that Allah's Messenger (ﷺ) came and he greeted me and then sat down. He had never sat with me since a month when this rumour was afloat, and there was no revelation (to clarity) my case. Allah's Messenger (ﷺ) recited Tashahhud (there is no god but Allah and Muhammad is His Apostle) and then said: Coming to the point, 'A'isha, this is what has reached me about you and if you are innocent, Allah would Himself vindicate your honour, and if accidentally there has been a lapse on your part seek forgiveness of Allah; He will pardon thee for when a servant makes a confession of his fault and turns (to Him) penitently, Allah also turns to him (mercifully) accepting his repentance. \nWhen Allah's Messenger (ﷺ) talked, my tears dried up and not even a single drop of tear was perceived by me (rolling out of my eyes). I said to my father: You give a reply to Allah's Messenger (ﷺ) on my behalf. He said: By Allah, I do not know what I should say to Allah's Messenger (ﷺ). I then said to my mother: Give a reply to Allah's Messenger (ﷺ) on my behalf, but she said: By Allah, I do not know what I should say to Allah's Messenger (ﷺ). I was a small girl at that time and I had not read much of the Qur'an (but I said): By Allah, I perceive that you have heard about this and it has settled down in your mind and you have taken it to be true, so if I say to you that I am quite innocent, and Allah knows that I am innocent, you would never believe me to be true, and if I confess to (the alleged) lapse before you, whereas Allah knows that I am completely innocent (and I have not committed this sin at all), in that case You will take me to be true and, by Allah, I, therefore, find no other alternative for me and for you except that what the father of Yousuf said:, (My course is) comely patience. And Allah it is Whose help is to be sought for in that (predicament) which ye describe\" (xii 18). After this I turned my face to the other side and lay down on my bed. By Allah, I was fully aware of this fact that I was innocent but I did not expect that Allah would descend Wahy Matlu (Qur'anic Wahy) in my case as I did not think myself so much important that Allah, the Exalted and Glorious, would speak in this matter in words to be recited. I only hoped that Allah would in vision give an indication of my innocence to Allah's Messenger (ﷺ) during his sleep. And, by Allah, Allah's Messenger (ﷺ) had not moved an inch from where he had been sitting and none from the members of my family had gone that Allah, the Exalted and Glorious, descended revelation upon Allah's Messenger (ﷺ) there and then and he felt the burden which he used to feel at the time of receiving revelation. He began to perspire because of the burden of words of Allah as they descended upon him even during the winter season and there fell the drops of his sweat like silvery beads. When this state of receiving revelation was over, the Messenger of Allah (ﷺ) smiled and the first words which he spoke to me were that he said: 'A'isha, there is glad tidings for you. Verily, Allah has vindicated your honour, and my mother who had been standing by me said: Get up (and thank him, i. e. the Holy Prophet). I said: By Allah, I shall not thank him and laud him but Allah Who has descended revelation vindicating my honour. She ('A'isha) said: Allah, the Exalted and Glorious, revealed:\" 'Verily, those who spread the slander are a gang among you\" (and) ten (subsequent) verses in regard to my innocence. She further said: Abu Bakr used to give to Mistah (some stipend) as a token of kinship with him and for his poverty and he (Abu Bakr) said: By Allah, now I would not spend anything for him. 'A'isha said: It was upon this that Allah the Exalted and Glorious revealed this verse:\" And let not those who possess dignity and ease among you swear to give to the near of the kin\" up to\" Yearn ye not that Allah may forgive you?\" Hibban b. Musa' said that 'Abdullah b. Mubarak used to say: It is a verse contained in the Book which most (eminently) brightens the hope. \nAbu Bakr said: By Allah, I wish that Allah should pardon me. I shall never stop this stipend. So he continued to give him the stipend which he had withdrawn. 'A'isha said that Allah's Messenger (ﷺ) asked Zainab, daughter of Jahsh, the wife of Allah's Apostle (ﷺ), about me what she knew or what she had seen in me, and she said: Allah's Messenger, I shall not say anything without hearing (with my ears) and seeing with my eyes. By Allah, I find nothing in her but goodness. (And she stated this in spite of the fact) that she was the only lady who amongst the wives of Allah's Apostle (ﷺ) used to vie with me but Allah saved her in bringing false allegation against me because of her God-consciousness. Her sister Hamna bint Jahsh, however, opposed her and she was undone along with others.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 372340,
        "last_updated": "2020-08-13 01:54:02"
    },
    {
        "englishURN": 266740,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "10.00",
        "babName": " HADITH PERTAINING TO THE LIE ABOUT (HADRAT) 'A'ISHA SIDDIQA (ALLAH BE PLEASED WITH HER) AND ACCEPTING OF REPENTANCE OF THOSE WHO BROUGHT FALSE ALLEGATION ABOUT HER",
        "hadithNumber": 6674,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Zuhri through other chains of transmitters but with a slight variation of wording. In the hadith transmitters on the authority of 'Urwa, there is an addition of these words:\" 'A'isha did not like that Hassan should be rebuked in her presence and she used to say: It was he who wrote this verse also:\" 'Verily, my father and my mother and my honour, those are all meant for defending the honour of Muhammad against you.\" And 'Urwa further reported that 'A'isha said: By Allah, the person, about whom the allegation was trade used to say: Hallowed be Allah, by One, in Whose hand is my life, I have never unveiled any woman, and then he die, & as a martyr in the cause of Allah, and in the narration transmitted on the authority of Ya'qub b. Ibrahim., the word is Mu'irin and in the narration transmitted on the'authority of 'Abd al-Razzaq it is Mughirin. 'Abd b. Humaid said: I said to 'Abd al-Razzaq: What does this word Mughirin mean? And he said: Al- waghra means intense heat.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 372350,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266750,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "10.00",
        "babName": " HADITH PERTAINING TO THE LIE ABOUT (HADRAT) 'A'ISHA SIDDIQA (ALLAH BE PLEASED WITH HER) AND ACCEPTING OF REPENTANCE OF THOSE WHO BROUGHT FALSE ALLEGATION ABOUT HER",
        "hadithNumber": 6675,
        "hadithText": "<p>\n'A'Isha reported: When I came under discussion what the people had to say about me, Allah's Messenger (ﷺ) stood up for delivering an address and he recited tashahhud (I bear witness to the fact that iheie is no god but Allah) and praised Allah, lauded Him what He rightly deserves and then said: Coming to the point. Give me an advice about them who have brought false charge about my family. By Allah, I know no evil in the members of my family and the person in connection with whom the false charge is being levelled, I know no evil in him too. And he never entered my house but in my presence and when I was away on a journey, he remained with me even in that. The rest of the hadith is the same but with this change that Allah's Messenger (ﷺ) came to my house and asked my maidservant and she said: By Allah, I know no fault in her but this that she sleeps, and goat comes and eats the kneaded flour. Some of the Companions (of the Holy Prophet) scolded her and said: State the fact before Allah's Messenger (ﷺ) and they even made a pointed reference (to this incident). She said: gallowed be Allah. By Allah, I know about her as does the jeweller know about the pure piece of gold. And when this news reached the person in connection with whom the allegation was made he said: Hallowed be Allah. By Allah, I have never unveiled any woman. 'A'isha said: He fell as a martyr in the cause of Allah, and there is this addition in this hadith that the people who had brought false allegation amongst them were Mistah and Hamna and Hassan. And so far as the hypocrite 'Abdullah b. Ubayy is concerned, he was one who tried his best to gather the false news and then gave them the wind. And he was in fact a fabricator and there was Hamna, daughter of Jahsh with him.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 372360,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266760,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "11.00",
        "babName": " THE EXONERATION OF THE SLAVEGIRL OF ALLAH'S APOSTLE (MAY PEACE BE UPON HIM) FROM A FALSE CHARGE",
        "hadithNumber": 6676,
        "hadithText": "<p>\nAnas reported that a person was charged with fornication with the slavegirl of Allah's Messenger (ﷺ). Thereupon Allah's Messenger (ﷺ) said to 'Ali: Go and strike his neck. 'Ali came to him and he found him in a well making his body cool. 'Ali said to him: Come out, and as he took hold of his hand and brought him out, he found that his sexual organ had been cut. Hadrat 'Ali refrained from striking his neck. He came to Allah's Apostle (ﷺ) and said: Allah's Messenger, he has not even the sexual organ with him.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 372370,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266421,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "5.00",
        "babName": " REPENTANCE IS ACCEPTED SO LONG AS ONE REPENTS AFTER COMMITTING SINS",
        "hadithNumber": 6642,
        "hadithText": "<p>\nAbu Huraira reported from Allah's Messenger (ﷺ) that his Lord, the Exalted and Glorious, thus said. A servant committed a sin and he said: O Allah, forgive me my sins, and Allah (the Exalted and Glorious) said: My servant commited a sin and then he came to realise that he has a Lord Who forgives the sins and takes to account (the sinner) for the sin. He then again committed a sin and said: My Lord, forgive me my sin, and Allah, the Exalted and High, said: My servant committed a sin and then came to realise that he has a Lord Who would forgive his sin or would take (him) to account for the sin. He again committed a sin and said: My Lord, forgive me for my sin, and Allah (the Exalted and High) said: My servant sas committed a sin and then came to realise that he has a Lord Who forgives the sins or takes (him) to account for sin. O servant, do what you like. I have granted you forgiveness. \n'Abd al-A'la said: I do not know whether he said thrice or four times to do\" what you desire\".</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 372000,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 266422,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 37,
        "bookName": "The Book Pertaining to Repentance and Exhortation to Repentance (Kitab Al-Tauba)",
        "babNumber": "5.00",
        "babName": " REPENTANCE IS ACCEPTED SO LONG AS ONE REPENTS AFTER COMMITTING SINS",
        "hadithNumber": 6642,
        "hadithText": "<p>\nThe hadlth has been narrated on the authority of 'Abd al-A'la b. Hammad with the same chain of transmitters.</b>",
        "bookID": "37.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 372010,
        "last_updated": "2012-04-26 14:00:00"
    }
]