[
    {
        "englishURN": 270580,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7058,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: The world is a prison-house for a believer and Paradise for a non-believer.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 376440,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270590,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 7059,
        "hadithText": "<p>\nJabir b. Abdullah reported that Allah's Apostle (ﷺ) happened to walk through the bazar coming from the side of 'Aliya and the people were on both his sides. There he found a dead lamb with very short ears. He took hold of his ear and said: Who amongst you would like to have this for a dirham? They said: We do not like to have it even for less than that as it is of no use to us. He said: Do you wish to have it (free of any cost)? They said: By Allah, even if it were alive (we would not have liked to possess that), for there is defect in it as its ear is very short; now it is dead also. Thereupon Allah's Messenger (ﷺ) said: By Allah, this world is more insignificant in the eye of Allah than it (this dead lamb) is in your eye.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 376450,
        "last_updated": "2015-01-13 11:20:13"
    },
    {
        "englishURN": 270600,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7060,
        "hadithText": "<p>\nJabir reported Allah's Apostle (ﷺ) narrating a hadith like this with a slight variation of wording.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 376460,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270610,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7061,
        "hadithText": "<p>\nMutarrif reported on the authority of his father: I came to Allah's Apostle (ﷺ) as he was reciting:\" Abundance diverts you\" (cii. 1). He said: The son of Adam claims: My wealth, my wealth. And he (the Holy Prophet) said: O son of Adam. is there anything as your belonging except that which you consumed, which you utilised, or which you wore and then it was worn out or you gave as charity and sent it forward?</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 376470,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270620,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7062,
        "hadithText": "<p>\nMutarrif reported on the authority of his father: I went to Allah's Apostle (ﷺ). The rest of the hadith is the same.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 376480,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270631,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7063,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: A servant says, My wealth. my wealth, but out of his wealth three things are only his: whatever he eats and makes use of or by means of which he dresses himself and it wears out or he gives as charity, and this is what he stored for himself (as a reward for the Hereafter), and what is beyond this (it is of no use to you) because you are to depart and leave it for other people.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 376490,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270632,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7063,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of al-'Ala' b. 'Abd al-Rahman with the same chain of transmitters.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 376500,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270640,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 7064,
        "hadithText": "<p>\nAnas b. Malik reported Allah's Messenger (ﷺ) as saying: Three things follow the bier of a dead man. Two of them come back and one is left with him: the members of his family, wealth and his good deeds. The members of his family and wealth come back and the deeds alone are left with him.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 376510,
        "last_updated": "2015-01-21 10:37:08"
    },
    {
        "englishURN": 270650,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 7065,
        "hadithText": "<p>\n`Amr b. `Auf, who was an ally of Banu `Amir b. Luwayy (and he was one amongst them) who participated in Badr along with Allah's Messenger (ﷺ) reported that, Allah's Messenger (ﷺ) sent Abu `Ubaida b. Al-Jarrah to Bahrain for collecting Jizya and Allah's Messenger (ﷺ) had made a truce with the people of Bahrain and had appointed `Ala' b. Hadrami and Abu `Ubaida (for this purpose). They came with wealth from Bahrain and the Ansar heard about the arrival of Abu `Ubaida and they had observed the dawn prayer along with Allah's Messenger (ﷺ). When Allah's Messenger (ﷺ) had finished the prayer, they (the Ansar) came before him and Allah's Messenger (ﷺ) smiled as he saw them and then said: I think you have heard about the arrival of Abu `Ubaida with goods from Bahrain. They said: Allah's Messenger, yes, it is so. Thereupon he said: Be happy and be hopeful of that which gives you delight. By Allah, it is not the poverty about which I fear in regard to you but I am afraid in your case that (the worldly) riches way be given to you as were given to those who had gone before you and you begin to vie with one another for them as they vied for them, and these may destroy you as these destroyed them.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 376520,
        "last_updated": "2015-01-21 10:41:32"
    },
    {
        "englishURN": 270660,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7066,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Zuhri as reported by Yunus with a slight variation of wording.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 376530,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270670,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 7067,
        "hadithText": "<p>\n`Abdullah b. `Amr b. al-`As reported that Allah's Messenger (ﷺ) said: How would you be, O people, when Persia and Rome would be conquered for you? `Abd ar-Rahman b `Auf said: We would say as Allah has commanded us and we would express our gratitude to Allah. Thereupon Allah's Messenger (ﷺ) said: Nothing else besides it? You would (in fact) vie with one another, then you would feel jealous, then your relations would be estranged and then you will bear enmity against one another, or something to the same effect. Then you would go to the poor emigrants and would make some the masters of the others.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 376540,
        "last_updated": "2014-12-18 08:47:02"
    },
    {
        "englishURN": 270680,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7068,
        "hadithText": "<p>\r\nAbu Huraira reported that Allah's Messenger (ﷺ) said: When one of you looks at one who stands at a higher level than you in regard to wealth and physical structure he should also see one who stands at a lower level than you in regard to these things (in which he stands) at a higher level (as compared to him).</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 376550,
        "last_updated": "2013-12-20 13:18:11"
    },
    {
        "englishURN": 270690,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7069,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Abu Huraira through another chain of transmitters.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 376560,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270700,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 7070,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: Look at those who stand at a lower level than you but don't look at those who stand at a higher level than you, for that is better-suited that you do not disparage Allah's favors.\n\n<br><br>In the chain narrated by Abu Mu'awiya's he said: Upon you.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 376570,
        "last_updated": "2020-09-29 10:47:33"
    },
    {
        "englishURN": 270710,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 7071,
        "hadithText": "<p>\nAbu Huraira, narrated that he heard Allah's Messenger (ﷺ) as saying: There were three persons in Bani Isra'il, one suffering from leprosy, the other bald-headed and the third one blind. Allah decided to test them. So He sent an angel who came to the one who was suffering from leprosy and said: Which thing do you like most? He said: Beautiful colour and fine skin and removal of that which makes me detestable in the eye of people. He wiped him and his illness was no more and he was conferred upon beautiful colour and beautiful skin. He (the angel) again said: Which property do you like most? He said: Camels, or he said: The cow the narrator is, however, doubtful about it, but (out of the persons) suffering from leprosy or baldness one of them definitely said: The camel. And the other one said: Cow. And he (one who demanded camel) was bestowed upon a she-camel, in an advanced stage of pregnancy, and while giving he said: May Allah bless you in this. Then he came to the bald-headed person and said: Which thing do you like most? He said: Beautiful hair and that (this baldness) may be removed from me because of which people hate me. He wiped his body and his illness was removed and he was bestowed upon beautiful hair, and the angel said: Which wealth do you like most? He said: The cow. And he was given a pregnant cow and while handing it over to him he (the angel) said: May Allah bless you in this. Then he came to the blind man and he said: Which thing do you like most? He said: Allah should restore my eyesight so that I should be able to see people with the help of that. He wiped his body and Allah restored to him his eyesight, and he (the angel) also said: Which wealth do you like most? He said: The flock of sheep. And he was given a pregnant goat and that gave birth to young ones and it so happened that one valley abounded in camels and the other one in cows and the third one in sheep. He then came to the one who had suffered from leprosy in his (old) form and shape and he said: I am a poor person and my provision has run short in my journey and there is none to take me to my destination except with the help of Allah and your favour. I beg of you in His name Who gave you fine colour and fine skin, and the camel in the shape of wealth (to confer upon me) a camel which should carry me in my journey. He said: I have many responsibilities to discharge. Thereupon he said: I perceive as if I recognise you. Were you not suffering from leprosy whom people hated and you were a destitute and Allah conferred upon you (wealth)? He said: I have inherited this property from my forefathers. Thereupon he said: If you are a liar may Allah change you to that very position in which you had been. He then came to the one who was bald-headed in his (old) form and said to him the same what he had said to him (one suffering from leprosy) and he gave him the same reply as he had given him and he said: If you are a liar, may Allah turn you to your previous position in which you had been. And then he came to the blind man in his (old) form and shape and he said: I am a destitute person and a wayfarer. My provision have ran short and today there is no way to reach the destination but with the help of Allah and then with your help and I beg of you in the (name) of One Who restored your eyesight and gave you the flock of sheep to give me a sheep by which I should be able to make my provisions for the journey. He said: I was blind and Allah restored to me my eyesight; you take whatever you like and leave whatever you like. By Allah, I shall not stand in your way today for what you take in the name of God. Thereupon, he said: You keep with you what you have (in your possession). The fact is that you three were put to test and Allah is well pleased with you and He is annoyed with your companions.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 376580,
        "last_updated": "2015-02-02 09:32:25"
    },
    {
        "englishURN": 270720,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7072,
        "hadithText": "<p>\nIt is reported on the authority of Amir b. Sa'd that Sa'd b. Abi Waqqas was in the fold of his camels that his son 'Umar came to him. When Sa'd saw him he said: I seek refuge with Allah from the mischief of this rider. And as he got down he said to him: You are busy with your camels and your sheep and you have abandoned people who are contending with one another for kingdom. Sa'd struck his chest and said: Keep quite. I heard Allah's Messenger (ﷺ) as saying: Allah loves the servant who is God-conscious and is free from want and is hidden (from the view of people).</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 376590,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270730,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7073,
        "hadithText": "<p>\nSa'd b. Abu Waqqas is reported to have, said: By Allah, I am the first person amongst the Arabs to throw an arrow in the cause of Allah and we used to go with Allah's Messenger (ﷺ) and there was no food for us to eat but only the leaves of hubla and samur trees (they are wild trees) and as a result thereof one amongst us would relieve himself as does the goat. (How strange it is) that now the people of Banu Asad (the progeny of Zubair) instruct me in religion and try to impose punishment upon me (in regard to it). If it is so (that I am so ignorant of religion), then indeed, I am undone and my deeds have been lost. Ibn Numair, however, did not make a mention of the word (idhan) thus? (in his narration).</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 376601,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270740,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7074,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Isma'il b. Khalid with the same chain of transmitters and the words are:\" One amongst us would relieve himself as the goats do without anything mixing with its excrement.\"</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 376620,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270750,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7075,
        "hadithText": "<p>\n'Umair al-'Adawi reported: 'Utba b. Ghazwan delivered us a sermon and he praised Allah and lauded Him, then said: Now coming to the point, verily the world has been given the news of its end and that too quite early. Nothing would be left out of it but only water left in the utensil which its owner leaves, and you are going to shift to an abode which knows no end, and you should shift with the good before you, for we have been told that a stone would be thrown at one side of the Hell and it would go down even for seventy years but would not be able to reach its bottom. By Allah, it would be fully packed. Do you find it something strange, and it has been mentioned that there yawns a distance which one would be able to cover in forty years from one end to another of Paradise, and a day would come when it would be fully packed and you must be knowing that I was the seventh amongst seven who had been with Allah's Messenger (ﷺ) and we had nothing to eat but the leaves of the tree until the corners of the mouth were injured. We found a sheet which we tore in two and divided between myself and Sa'd b. Malik. I made the lower garment with halt of it and so did Sa'd make the lower garment with half of it and today there is none amongst us who has not become the governor of a city from amongst the cities (of the Islamic Commonwealth) and I seek refuge with Allah that I should consider myself great whereas I am insignificant in the eye of Allah. Prophethood does not remain for ever and its impact fades with the result that it changes eventually into kingship, and you would soon come to know and experience those rulers who would come after us and see (how far they are from religion).</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 376630,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270760,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7076,
        "hadithText": "<p>\nKhalid b. 'Umair reported and he had seen the pre-Islamic days also, that 'Uqba b. Ghazwan delivered this address and he was the governor of Basra. The rest of the hadith is the same as transmitted by Shaiban.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 376640,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270770,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7077,
        "hadithText": "<p>\nKhalid b. Umair reported: I heard Uqba b. Ghazwan as saving: I found myself as the seventh amongst the seven who had been along with Allah's Messenger (ﷺ). We had nothing to eat but the leaves of hubla (a wild tree) until the corners of our mouths were injured.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 376650,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270780,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7078,
        "hadithText": "<p>\nAbu Huraira reported that they (the Companions of the Holy Prophet) said: Allah's Messenger, will we be able to see our Lord on the Day of Judgment? He said: Do you feel any difficulty in seeing the sun in the noon when there is no cloud over it? They said: No. He again said: Do you feel any difficulty in seeing the moon on the fourteenth night when there is no cloud over it? They said: No. Thereupon he said: By Allah Who is One in Whose Hand is my life. you will not face any difficulty in seeing your Lord but only so much as you feel in seeing one of them. Then Allah would sit in judgment upon the servant and would say: O, so and so, did I not honour you and make you the chief and provide you the spouse and subdue for you horses, camels, and afforded you an opportunity to rule over your subjects? He would say: Yes. And then it would be said: Did you not think that you would meet Us? And he would say: No. Thereupon He (Allah) would say: Well, We forget you as you forgot Us. Then the second person would be brought for judgment. (And Allah would) say: 0, so and so. did We not honour you and make you the chief and make you pair and subdue for you horses and camels and afford you an opportunity to rule over your subjects? He would say: Yes, my Lord. And He (the Lord) would say: Did you not think that you would be meeting Us? And he would say: No. And then He (Allah) would say: Well, I forget you today as you forgot Us. Then the third -one would be brought and He (Allah) would say to him as He said before. And he (the third person) would say: O, my Lord, I affirmed my faith in Thee and in Thy Book and in Thy Messenger and I observed prayer and fasts and gave charity, and he would speak in good terms like this as he would be able to do. And He (Allah) would say: Well, We will bring our witnesses to you. And the man would think in his mind who would bear witness upon him and then his mouth would be sealed and it would be said to his thighs, to his flesh and to his bones to speak and his thighs. flesh and bones would bear witness to his deeds and it would be done so that he should not be able to make any excuse for himself and he would be a hypocrite and Allah would be annoyed with him.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 376660,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270790,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 7079,
        "hadithText": "<p>\nAnas b. Malik reported: We were in the company of Allah's Messenger (ﷺ) when he smiled, and said: Do you know why I laughed? We said: Allah and His Messenger, know best. Thereupon he said: It was because (there came to my mind the) talk which the servant would have with his Lord (on the Day of judgment). He would say: My Lord, have you not guaranteed me protection against injustice? He would say: Yes. Then the servant would say: I do not deem valid any witness against me but my own self, and He would say: Well, enough would be the witness of your self against you and that of the two angels who had been appointed to record your deeds. Then the seal would be set upon his mouth and it would be said to his hands and feet to speak and they would speak of his deeds. Then the mouth would be made free to talk, he would say (to the hands and feet): Be away, let there be curse of Allah upon you. It was for your safety that I contended.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 376670,
        "last_updated": "2015-01-21 10:45:26"
    },
    {
        "englishURN": 270800,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7080,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: O Allah, make for the family of Muhammad the provision which is a bare subsistence.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 376680,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270810,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7081,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: 0 Allah, provide for the, family of Muhammad their subsistence, and in the narration transmitted on the authority of 'Amr (the words are):\" O Allah, provide us subsistence\"</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 376690,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270820,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7082,
        "hadithText": "<p>\n'Umara b. al-Qa'qa' reported this hadith with the same chain of transmitters but instead of the word\" qut\" (bare subsistence) there has been used the word\" Kafaf\" (adequate means to meet the needs).</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 376700,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270830,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7083,
        "hadithText": "<p>\n'A'isha reported: Never had the family of Muhammad (ﷺ) eaten to the fill since their, arrival in Medina with the bread of wheat for three successive nights until his (Holy Prophet's) death.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 376710,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270840,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7084,
        "hadithText": "<p>\n'A'isha reported Allah's Messenger (ﷺ) as saying: Never did Allah's Messenger (ﷺ) eat to his fill the bread of wheat for three successive days until he had run the course of his life.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 376720,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270850,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7085,
        "hadithText": "<p>\n'A'isha reported: Never did the family of Muhammad (ﷺ) eat to the fill the bread of barley for two successive days until Allah's Messenger (ﷺ) died.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 376730,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270860,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 7086,
        "hadithText": "<p>\n'A'isha reported: Never could the family of Muhammad (ﷺ) (afford to eat to the fill) the bread of wheat beyond three days (successively).</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 376740,
        "last_updated": "2013-01-23 06:42:56"
    },
    {
        "englishURN": 270870,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7087,
        "hadithText": "<p>\n'A'isha reported: Never could the family of Muhammad (may peace. be upon him) (afford to eat) the bread of wheat for three (successive days) until he ran the course of his life.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 376750,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270880,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7088,
        "hadithText": "<p>\n'A'isha reported: Never could the family of Muhammad (ﷺ) (afford to eat) the bread of wheat for two days successively. Even (out of these two days) one (was such wherein he could get) only a date.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 376760,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270890,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7089,
        "hadithText": "<p>\n'A'isha reported: We the family of Muhammad (ﷺ) used to spend (the whole) month in which we (did not need to) kindle the fire as (we had nothing to cook) ; we had only dates and water (to fill our bellies).</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 376770,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270900,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7090,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of 'Urwa with the same chain of transmitters (and the words are):\" We used to spend-\" And he did not make a mention of the family of Muhammad (ﷺ), and Abu Kuraib made this addition to his hadith which was transmitted on the authority of Ibn Numair (and the words are):\" But this that there was brought to us some meat.\"</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 376780,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270910,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 7091,
        "hadithText": "<p>\n`A'isha reported that Allah's Messenger (ﷺ) died (in such a state) that there had been nothing in my wooden tub which a living being could afford to eat but a handful of barley. I had been eating out of that for a fairly long duration when I thought of measuring it and it was almost finished.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 376790,
        "last_updated": "2015-01-21 10:46:28"
    },
    {
        "englishURN": 270920,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7092,
        "hadithText": "<p>\n'A'isha used to say to 'Urwa: Son of my sister, by Allah, I used to see the new moon, then the new moon, then the new moon, i. e. three moons in two months, and fire was not kindled in the house of Allah's Messenger (ﷺ). I ('Urwa) said: Auntie, then what were your means of sustenance? She said: Dates and water. But it (so happened) that Allah's Messenger (ﷺ) had some Ansar as his neighbours and they had milch animals and they used to send to Allah's Messenger (ﷺ) some milk of their (animals) and he served that to us.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 376800,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270930,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7093,
        "hadithText": "<p>\n'Urwa b. Zubair reported on the authority of 'A'isha, the wife of Allah's Apostle (ﷺ), that she said: Allah's Messenger (ﷺ) died (in a state) that it never happened that he could eat to his fill the bread with olive oil twice during a day.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 376810,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270940,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7094,
        "hadithText": "<p>\n'A'isha reported this hadith through other chains of transmitters also (and the words are) that Allah's Messenger (ﷺ) died (in a state) when the people could afford to eat only the dates and water.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 376821,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270950,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7095,
        "hadithText": "<p>\r\n'A'isha reported that Allah's Messenger (ﷺ) had died in a state that they could afford to eat two things only: water and dates.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 376840,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270960,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7096,
        "hadithText": "<p>\nThis hadith has been transmitted on the authority of Sufyan and the words are:\" We could not afford to eat to the fill even dates and water.\"</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 376850,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270970,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7097,
        "hadithText": "<p>\nAbu Huraira reported: By Him in Whose Hand is my life and Ibn 'Abbad also said: By One in Whose hand is the life of Abu Huraira, Allah's Messenger (ﷺ) could not afford to provide adequate food to his family which could (fill their bellies) with bread and wheat for three days successively until he left the world.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 376860,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270980,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7098,
        "hadithText": "<p>\nAbu Hazim reported: I saw Abu Huraira point with his finger many a time and saying: By One in Whose Hand is the life of Abu Huraira, Allah's Apostle (ﷺ) could not eat to his fill and provide his family bread of wheat beyond three days successively until he left the world.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 376870,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 270990,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7099,
        "hadithText": "<p>\nNu'man b. Bashir said: Don't you eat and drink according to your heart's desire, whereas I saw that your Prophet (ﷺ) (at times) could not find even an inferior quality of the dates with which he could fill his belly? Qutaiba, however, did not make a mention of It.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 376880,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271000,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7100,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Simak with the same chain of transmitters, with this addition of words:\" You are not satisfied with the qualities of dates and butter.\"</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 376890,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271010,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": "",
        "hadithNumber": 7101,
        "hadithText": "<p>\nSimak b. Barb reported: I heard Nu'man deliver an address in which he said that (Hadrat) Umar made a mention of what had fallen to the lot of people out of the material world and he said: I saw Allah's Messenger (ﷺ) spend the whole day being upset because of hunger and he could not get even an interior quality of dates with which he could fill his belly.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 376900,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271020,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "1.00",
        "babName": null,
        "hadithNumber": 7102,
        "hadithText": "<p>\n'Abd al-Rahman al-Hubuli reported: I heard that a person asked 'Abdullah b. 'Amr b. 'As and heard him saying: Are we not amongst the destitute of the emigrants? Abdullah said to him: Have you a spouse with whom you live? He said: Yes. Abdullah asked: Do you not have a home in which you reside? The man replied \"Yes.\" Abdullah said: Then you are amongst the rich. He said: I have a servant also. Thereupon he (Abdullah b. 'Amr b. 'As) said: Then you are amongst the kings. \nAbu 'Abd al-Rahman reported that three persons came to 'Abdullah b. Amr b. 'As while I was sitting with him and they said: By Allah, we have nothing with us either in the form of provision, riding animals or wealth. Thereupon he said to them: I am prepared to do whatever you like. If you come to us, we would give you what Allah would make available for you. and if you like I would make a mention of your case to the ruler, and if you like you can show patience also. for I have heard Allah's Messenger (ﷺ) as saying: The destitute amongst the emigrants would precede the rich emigrants by forty years in getting into Paradise on the Day of Resurrection. Thereupon they said: We then, show patience and do not ask for anything.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 376911,
        "last_updated": "2014-01-23 16:48:59"
    },
    {
        "englishURN": 271030,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "2.00",
        "babName": " DO NOT ENTER BUT WFEPINGLY THE HABITATIONS OF THOSE WHO COMMITIED ATROKITIES UPON THEMSELVES",
        "hadithNumber": 7103,
        "hadithText": "<p>\n'Abdullah b. Umar reported that Allah's Messenger (ﷺ) said in connection with the people of Hijr (Thamud): Do not enter but weepingly (the habitations) of these people who had been punished by (Allah), and in case you do not feel inclined to weep, then do not enter (these habitations) that you may not meet the same calamity as had fallen to their lot.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 376930,
        "last_updated": "2015-01-29 11:20:38"
    },
    {
        "englishURN": 271040,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "2.00",
        "babName": " DO NOT ENTER BUT WFEPINGLY THE HABITATIONS OF THOSE WHO COMMITIED ATROKITIES UPON THEMSELVES",
        "hadithNumber": 7104,
        "hadithText": "<p>\nIbn Shihab reported, and he had been talking about the stony abodes of Thamud, and he said: Salim b. 'Abdullah reported that 'Abdullah b. Umar said: We were passing along with Allah's Messenger (ﷺ) through the habitations of Hijr, and Allah's Messenger (ﷺ) said: Do not enter but weepingly the habitations of these persons who committed tyranny among themselves, lest the same calamity should fall upon you as it fell upon them. He then urged his mount to proceed quickly and pass through that valley hurriedly.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 376940,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271050,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "2.00",
        "babName": " DO NOT ENTER BUT WFEPINGLY THE HABITATIONS OF THOSE WHO COMMITIED ATROKITIES UPON THEMSELVES",
        "hadithNumber": 7105,
        "hadithText": "<p>\nAbdullah b. 'Umar reported that the people encamped along with Allah's Messenger (ﷺ) in the valley of Hijr, the habitations of Thamud, and they quenched their thirst from the wells thereof and kneaded the flour with it. Thereupon Allah's Messenger (ﷺ) commanded that the water collected for drinking should be spilt and the flour should be given to the camels and commanded them that the water for drinking should be taken from that well where the she-camel (of Hadrat Salih) used to come.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 376950,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271060,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "2.00",
        "babName": " DO NOT ENTER BUT WFEPINGLY THE HABITATIONS OF THOSE WHO COMMITIED ATROKITIES UPON THEMSELVES",
        "hadithNumber": 7106,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of 'Abdullah with the same chain of transmitters but with a slight variation of wording.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 376960,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271070,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "3.00",
        "babName": " BENEVOLENT TREATMENT TO THE WIDOWS, ORPHANS AND THE POOR",
        "hadithNumber": 7107,
        "hadithText": "<p>\nAbu Huraira reported that Allah's Messenger (ﷺ) said: One who makes efforts (for earning to be spent) on a widow and the destitute is like a striver in the cause of Allah, and I think he also said: He is like one who constantly stands for prayer and observes fast without breaking it.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 376970,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271080,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "3.00",
        "babName": " BENEVOLENT TREATMENT TO THE WIDOWS, ORPHANS AND THE POOR",
        "hadithNumber": 7108,
        "hadithText": "<p>\nAbu Huraira reported that Allah's Messenger (ﷺ) said: One who looks after the orphan whether he is his relative or not, I and he would be together in Paradise like this, and Malik (explained it) with the gesture by drawing his index finger and middle finger close together.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 376980,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271090,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "4.00",
        "babName": " EXCELLENCE OF BUILDING MOSQUES",
        "hadithNumber": 7109,
        "hadithText": "<p>\nAbdullah al-Khaulani reported that when Uthman b. 'Affan tried to rebuild the mosque of Allah's Messenger (ﷺ) the people began to talk about this. Uthman b. 'Affan said: You discuss it very much whereas I have heard Allah's Messenger (ﷺ) as saying: He who builds a mosque-- and the narrator Bukair said: I think he also said: (for) seeking the pleasure of Allah- Allah would build (a similar house for him in Paradise). and in the narration of Harun (the words are):\" A house for him in Paradise.\"</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 376990,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271100,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "4.00",
        "babName": " EXCELLENCE OF BUILDING MOSQUES",
        "hadithNumber": 7110,
        "hadithText": "<p>\nMahmud b. Labid reported that 'Uthman b. 'Affan decided to rebuild the mosque (of Allah's Apostle in Medina) but the people did not like this idea and they wished that it should be preserved in the same (old) form. Thereupon he (Hadrat 'Uthman) said: I heard Allah's Messenger (ﷺ) as saying: He who builds a mosque for Allah, Allah would build for him (a house) in Paradise like it.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 377000,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271110,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "4.00",
        "babName": " EXCELLENCE OF BUILDING MOSQUES",
        "hadithNumber": 7111,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Ja'far with the same chain of transmitters with this variation (that the words are):\" Allah would build for him a house in Paradise.\"</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 377010,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271120,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "5.00",
        "babName": " CHARITY TO BE GIVEN TO THE POOR OR THE WAYFARERS",
        "hadithNumber": 7112,
        "hadithText": "<p>\nAbu Huraira reported: While a person was in the wilderness he heard a voice from the cloud (commanding it thus): Irrigate the garden of so and so. (After that the clouds slinked aside and poured water on a stony ground. It filled a channel amongst the channels of that land and that person followed that water and he found a person standing in the garden busy in changing the course of water with the help of a hatchet. He said to him: Servant of Allah, what is your name? he said: So and so. And it was that very name which he had heard from the clouds. and he said to him: Servant of Allah, why do you ask me my name? He said: I heard a voice from the clouds of which is the downpour, saying: Water the garden of so and so, like your name. What do you do (for the favour) shown to you by Allah in this matter? He said: Now as you state so. I look what yield I get from it, and I give one-third as charity out of it and I and my children eat one-third of it and one-third I return to it as investment.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 377020,
        "last_updated": "2013-02-14 16:02:41"
    },
    {
        "englishURN": 271130,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "5.00",
        "babName": " CHARITY TO BE GIVEN TO THE POOR OR THE WAYFARERS",
        "hadithNumber": 7113,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Wahb b. Kaisan with the same chain of transmitters but with this change that he said:\" I earmark one-third for the poor, the needy and the wayfarers.\"</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 377030,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271140,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "6.00",
        "babName": " HE WHO ASSOCIATES ONE AS AN OBJECT OF WORSHIP WITH ALLAH IN HIS DEEDS",
        "hadithNumber": 7114,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as stating that Allah the Most High and Exalted said: I am the One, One Who does not stand in need of a partner. If anyone does anything in which he associates anyone else with Me, I shall abandon him with one whom he associates with Allah.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 377040,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271150,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "7.00",
        "babName": " THE PROHIBITION OF SIMULATION AND OSTENTATION",
        "hadithNumber": 7115,
        "hadithText": "<p>\nIbn Abbas reported Allah's Messenger (ﷺ) as saying: If anyone wants to have his deeds widely publicised, Allah will publicise (his humiliation). And if anyone makes a hypocritical display (of his deeds) Allah will make a display of him.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 377050,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271160,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "7.00",
        "babName": " THE PROHIBITION OF SIMULATION AND OSTENTATION",
        "hadithNumber": 7116,
        "hadithText": "<p>\nJundub reported Allah's Messenger (ﷺ) as saying: He who wants to publicise (his deeds), Allah will publicise (his humility), and he who makes a hypocritical display (of his deeds), Allah will make a display of him.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 377060,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271170,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "7.00",
        "babName": " THE PROHIBITION OF SIMULATION AND OSTENTATION",
        "hadithNumber": 7117,
        "hadithText": "<p>\nSufyan reported this hadith with the same chain of transmitters and he made this addition:\" I did not hear anyone saying besides him that it was Allah's Messenger (ﷺ) who had said so.\"</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 377070,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271180,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "7.00",
        "babName": " THE PROHIBITION OF SIMULATION AND OSTENTATION",
        "hadithNumber": 7118,
        "hadithText": "<p>\nSalama b. Kuhail reported: I heard from Jundub, but I did not hear him say this: \"I heard Allah's Messenger (ﷺ) saying this.\"</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 377080,
        "last_updated": "2015-01-21 10:47:36"
    },
    {
        "englishURN": 271190,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "7.00",
        "babName": " THE PROHIBITION OF SIMULATION AND OSTENTATION",
        "hadithNumber": 7119,
        "hadithText": "<p>\nAbu Sufyan reported like that as as-Saduq al-Amin al-Walid b. Harb narrated with the same chain of transmitters.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 377090,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271200,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "8.00",
        "babName": " PERTAINING TO THE GUARDING OF TONGUE",
        "hadithNumber": 7120,
        "hadithText": "<p>\nAbu Huraira reported that he heard Allah's Messenger (ﷺ) as saying: The servant speaks words for which he is sent down to the Hell-Fire farther than the distance between the east and the west.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 377100,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271210,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "8.00",
        "babName": " PERTAINING TO THE GUARDING OF TONGUE",
        "hadithNumber": 7121,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: The servant speaks words that he does not understand its repercussions but he sinks down in Hell-Fire farther than the distance between the east and the west.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 377110,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271220,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "9.00",
        "babName": " THE PUNISTIMENT OF ONE WHO COMMANDS OTHERS TO DO GOOD BUT DOES NOT DO IT HIMSELF AND RE FORBIDS OTHERS TO DO EVIL BUT DOES NOT HIMSELF REFRAIN FROM IT",
        "hadithNumber": 7122,
        "hadithText": "<p>\nShaqiq reported that it was said to Usama b. Zaid: Why don't you visit 'Uthman and talk to him? Thereupon he said: Do you think that I have not talked to him but that I have made you hear? By Allah. I have talked to him (about things) concerning me and him and I did not like to divulge those things about which I had to take the initiative and I do not say to my ruler: \"You are the best among people,\" after I heard Allah's Messenger (ﷺ) as saying: A man will be brought on the Day of Resurrection and thrown in Hell-Fire and his intestines will pour forth in Hell and he will go round along with them, as an ass goes round the mill stone. The denizens of Hell would gather round him and say: O, so and so, what has happened to you? Were you not enjoining us to do what was reputable and forbid us to do what was disreputable? He will say: Of course, it is so; I used to enjoin (upon people) to do what was reputable but did not practise that myself. I had been forbidding people to do what was disreputable, but practised it myself.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 377120,
        "last_updated": "2015-02-02 09:34:37"
    },
    {
        "englishURN": 271230,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "9.00",
        "babName": " THE PUNISTIMENT OF ONE WHO COMMANDS OTHERS TO DO GOOD BUT DOES NOT DO IT HIMSELF AND RE FORBIDS OTHERS TO DO EVIL BUT DOES NOT HIMSELF REFRAIN FROM IT",
        "hadithNumber": 7123,
        "hadithText": "<p>\nAbu Wa'il reported: I was in the company of Usama b. Zaid that a person said: What prevents you to visit Uthman and talk to him for what he does? The rest of the hadith is the same.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 377130,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271240,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "10.00",
        "babName": " IT IS FORBIDDEN TO PUBLICISE ONE'S SINS",
        "hadithNumber": 7124,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: All the people of my Ummah would get pardon for their sins except those who publicise them. And (it means) that a servant should do a deed during the night and tell the people in the morning that he has done so and so, whereas Allah has concealed it. And he does a deed during the day and when it is night he tells the people, whereas Allah has concealed it. Zuhair has used the word hijar for publicising.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 377140,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271250,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "11.00",
        "babName": " SNEEZING AND THE DISAPPROVAL OF YAWNING",
        "hadithNumber": 7125,
        "hadithText": "<p>\nAnas b. Malik reported that two persons sneezed in the presence of Allah's Messenger (ﷺ). He (the Messenger of Allah) invoked mercy for one, and did not invoke for the other. The one for whom he had not prayed said: So and so sneezed and you said: May Allah have mercy upon you. I also sneezed but you did not utter these words for me. Thereupon he (the Holy Prophet) said: That person praised Allah, and you did not praise Allah.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 377150,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271260,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "11.00",
        "babName": " SNEEZING AND THE DISAPPROVAL OF YAWNING",
        "hadithNumber": 7126,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Anas through another chain of transmitters.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 377160,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271270,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "11.00",
        "babName": " SNEEZING AND THE DISAPPROVAL OF YAWNING",
        "hadithNumber": 7127,
        "hadithText": "<p>\nAbu Burda reported: I visited Abu Musa, as he was in the house of the daughter of Fadl b. 'Abbas. I sneezed but he did not respond to it (by saying): Allah may have mercy upon you. Then she sneezed and he (Fadl b. 'Abbas) said: May Allah have mercy upon you. I came back to my mother and informed her about it, and when he came to her she said: My son sneezed in your presence and you did not say:\" Allah may have mercy upon you, and she sneezed and you said for her:\" May Allah have mercy upon you.\" Thereupon he said: Your son sneezed but he did not praise Allah and I did not beg mercy of Allah for him and she sneezed and she praised Allah and so I said: May Allah have mercy upon you, as I heard Allah's Messenger (ﷺ) as saying: When any one of you sneezes he should praise Allah and the other should say: May Allah have mercy upon you, and if he does not praise Allah, no mercy should be begged for him.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 377170,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271280,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "11.00",
        "babName": " SNEEZING AND THE DISAPPROVAL OF YAWNING",
        "hadithNumber": 7128,
        "hadithText": "<p>\nIyas b. Salama b. al-Akwa reported that his father reported to him that he heard Allah's Apostle (ﷺ) as saying: A person sneezed in his presence and he said to him: May Allah have mercy upon you. And he then sneezed for the second time and Allah's Messenger (ﷺ) said to him: He is suffering from cold (and no response is necessary).</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 377181,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271290,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "11.00",
        "babName": " SNEEZING AND THE DISAPPROVAL OF YAWNING",
        "hadithNumber": 7129,
        "hadithText": "<p>\nAbu Huraira reported Allah's Messenger (ﷺ) as saying: The yawning as from the devil. So when one of you yawns he should try to restrain it as far as it lies in his power.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 377200,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271300,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "11.00",
        "babName": " SNEEZING AND THE DISAPPROVAL OF YAWNING",
        "hadithNumber": 7130,
        "hadithText": "<p>\nThe son of Abu Said al-Khudri reported on the authority of his father that Allah's Messenger (ﷺ) said: When one of you yawns, he should keep his mouth shut with the help of his hand, for it is the devil that enters therein.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 377210,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271310,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "11.00",
        "babName": " SNEEZING AND THE DISAPPROVAL OF YAWNING",
        "hadithNumber": 7131,
        "hadithText": "<p>\nThe son of Abu Said al-Khudri reported on the authority of his father that Allah's Messenger (ﷺ) said: When one of you yawns, he should try to restrain it with cue help of his hand since it is the Satan that enters therein.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 377220,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271320,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "11.00",
        "babName": " SNEEZING AND THE DISAPPROVAL OF YAWNING",
        "hadithNumber": 7132,
        "hadithText": "<p>\nThe son of Abu Said al-Khudri reported on the authority of his father that Allah's Messenger (ﷺ) said. When one of you yawns while engaged in prayer, he should try to restrain so far as it lies in his power, since it is the Satan that enter therein.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 377230,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271330,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "11.00",
        "babName": " SNEEZING AND THE DISAPPROVAL OF YAWNING",
        "hadithNumber": 7133,
        "hadithText": "<p>\nAbu Said al-Khudri reported Allah's Messenger (ﷺ) a hadith like this through another chain of transmitters.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 377240,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271340,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "12.00",
        "babName": " MISCELLANEOUS AHADITH",
        "hadithNumber": 7134,
        "hadithText": "<p>\n'A'isha reported that Allah's Messenger (ﷺ) said: The Angels were born out of light and the Jinns were born out of the spark of fire and Adam was born as he has been defined (in the Qur'an) for you (i. e. he is fashioned out of clay).</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 377250,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271350,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "12.00",
        "babName": " MISCELLANEOUS AHADITH",
        "hadithNumber": 7135,
        "hadithText": "<p>\nAbu Huraira reported that Allah's Messenger (ﷺ) said: A group of Bani Isra'il was lost. I do not know what happened to it, but I think (that it 'underwent a process of metamorphosis) and assumed the shape of rats. Don't you see when the milk of the camel is placed before them, these do not drink and when the milk of goat is placed before them, these do drink. Abu Huraira said: I narrated this very hadith to Ka'b and he said: Did you hear this from Allah's Messenger (ﷺ)? I (Abu Huraira) said: Yes. He said this again and again, and I said: Have I read Torah? This hadith has been transmitted on the authority of Ishaq with a slight variation of wording.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 377260,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271360,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "12.00",
        "babName": " MISCELLANEOUS AHADITH",
        "hadithNumber": 7136,
        "hadithText": "<p>\nAbu Huraira reported that the rat (is the result of) metamorphosis (of a group of Bani Isra'il) and the proof of this is that when the milk of goat is placed before it, it drinks it, and when the milk of the camel is placed before it, it would not taste it at all. Ka'b said: Did you hear it from Allah's Messenger (ﷺ)? Thereupon he said: Has Torah been revealed to me?</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 377270,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271370,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "13.00",
        "babName": " THE BELIEVER DOES NOT PROVIDE OPPORTUNITY TO BE STUNG TWICE FROM ONE (AND THE SAME) HOLE",
        "hadithNumber": 7137,
        "hadithText": "<p>\nAbu Huraira reported that Allah's Messenger (ﷺ) said: The believer does not allow to be stung twice from one (and the same) hole. This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 377281,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271380,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "14.00",
        "babName": " EVERY ACT OF A BELIEVER IS A BLESSING FOR HIM",
        "hadithNumber": 7138,
        "hadithText": "<p>\nSuhaib reported that Allah's Messenger (ﷺ) said: Strange are the ways of a believer for there is good in every affair of his and this is not the case with anyone else except in the case of a believer for if he has an occasion to feel delight, he thanks (God), thus there is a good for him in it, and if he gets into trouble and shows resignation (and endures it patiently), there is a good for him in it.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 377300,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271390,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "15.00",
        "babName": " IT IS PROHIBITED TO PRAISE ANYONE SO MUCH THAT THERE MAY BE FEAR OF HIS BEING INTOXICATED BECAUSE OF THAT",
        "hadithNumber": 7139,
        "hadithText": "<p>\n'Abd al-Rahman b. Abu Bakra reported on the authority of his father that a person praised another person in the presence of Allah's Apostle (ﷺ), whereupon he said: Woe be to thee, you have broken the neck of your friend, you have broken the neck of your friend-he said this twice. If one of you has to praise his friend at all, he should say: I think (him to be) so and Allah knows it well and I do not know the secret of the heart and Allah knows the destined end, and I cannot testify his purity against Allah but (he appears) to be so and so.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 377310,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271401,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "15.00",
        "babName": " IT IS PROHIBITED TO PRAISE ANYONE SO MUCH THAT THERE MAY BE FEAR OF HIS BEING INTOXICATED BECAUSE OF THAT",
        "hadithNumber": 7140,
        "hadithText": "<p>\nAbd al-Rahman b. Abu Bakra reported on the authority of his father that a person was mentioned in the presence of Allah's Apostle (ﷺ), and a person said: Allah's Messenger, no person is more excellent than he after Allah's Messenger (ﷺ). Thereupon Allah's Apostle (ﷺ) said: Woe be to thee, you have broken the neck of your friend, and he said this twice. Then Allah's Messenger (ﷺ) said: If anyone has to praise his brother at all, he should say: I think him to be so and so, and even on this he should say: I do not consider anyone purer than Allah (considers).</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 377320,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271402,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "15.00",
        "babName": " IT IS PROHIBITED TO PRAISE ANYONE SO MUCH THAT THERE MAY BE FEAR OF HIS BEING INTOXICATED BECAUSE OF THAT",
        "hadithNumber": 7140,
        "hadithText": "<p>\nhis hadith has been transmitted on the authority of Shu'ba with a slight variation of wording.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 377330,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271410,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "15.00",
        "babName": " IT IS PROHIBITED TO PRAISE ANYONE SO MUCH THAT THERE MAY BE FEAR OF HIS BEING INTOXICATED BECAUSE OF THAT",
        "hadithNumber": 7141,
        "hadithText": "<p>\nAbu Musa reported Allah's Messenger (ﷺ) saw a person lauding another person or praising him too much. Thereupon he said: You killed him, or you sliced the back of a person.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 377340,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271420,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "15.00",
        "babName": " IT IS PROHIBITED TO PRAISE ANYONE SO MUCH THAT THERE MAY BE FEAR OF HIS BEING INTOXICATED BECAUSE OF THAT",
        "hadithNumber": 7142,
        "hadithText": "<p>\nAbu Ma'mar reported that a person lauded a ruler amongst the rulers and Miqdad began to throw dust upon him and he said: Allah's Messenger (ﷺ) commanded us that we should throw dust upon the faces of those who shower too much praise.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 377350,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271430,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "15.00",
        "babName": " IT IS PROHIBITED TO PRAISE ANYONE SO MUCH THAT THERE MAY BE FEAR OF HIS BEING INTOXICATED BECAUSE OF THAT",
        "hadithNumber": 7143,
        "hadithText": "<p>\nHammam b. al-Harith reported that a person began to praise 'Uthman and Miqdad sat upon his knee; and he was a bulky person and began to throw pebbles upon his (flatterer's) face. Thereupon 'Uthman said: What is the matter with you? And he said: Verily, Allah's Messenger (ﷺ) said: When you see those who shower (undue) praise (upon others), throw dust upon their faces.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 377360,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271440,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "15.00",
        "babName": " IT IS PROHIBITED TO PRAISE ANYONE SO MUCH THAT THERE MAY BE FEAR OF HIS BEING INTOXICATED BECAUSE OF THAT",
        "hadithNumber": 7144,
        "hadithText": "<p>\nThis hadith has been narrated on the authority of Miqdad through another chain of transmitters.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 377370,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271450,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "16.00",
        "babName": " THE OLDER ONE IS TO BE PREFERRED",
        "hadithNumber": 7145,
        "hadithText": "<p>\n'Abdullah b. Umar reported that Allah's Messenger (ﷺ) said: It was shown in a vision that I was rinsing my mouth with miswak and two persons began to contend with one another for getting that miswak. One was older than the other. I gave the miswak to the younger one amongst them, but it was said to me: (Let it be given) to the older one. So I gave it to the older one.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 377380,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271460,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "17.00",
        "babName": " TO STATE HADITH AFTER ITS VERIFICATION AND RECORDING OF\" KNOWLEDGE\"",
        "hadithNumber": 7146,
        "hadithText": "<p>\nIt was reported that Abu Huraira used to say: Listen to me, inmate of the apartment; listen to me, inmate of the apartment, while 'A'isha (Allah be pleased with her) had been busy in observing prayer. As she finished prayer, she said to\" Urwa: Did you hear his words? And this is how Allah's Messenger (ﷺ) used to utter (so distinctly) that if one intended to count (the words uttered) he would be able to do so.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 377390,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271470,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "17.00",
        "babName": " TO STATE HADITH AFTER ITS VERIFICATION AND RECORDING OF\" KNOWLEDGE\"",
        "hadithNumber": 7147,
        "hadithText": "<p>\nAbu Sa'id Khudri reported that Allah's Messenger (ﷺ) said: Do not take down anything from me, and he who took down anything from me except the Qur'an, he should efface that and narrate from me, for there is no harm in it and he who attributed any falsehood to me-and Hammam said: I think he also said:\" deliberately\" -he should in fact find his abode in the Hell-Fire.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 377400,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271480,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "18.00",
        "babName": " THE STORY OF THE PEOPLE OF THE DITCH, THE MAGICIAN, THE MONK AND THE SLAVE",
        "hadithNumber": 7148,
        "hadithText": "<p>\nSuhaib reported that Allah's Messenger (ﷺ) thus said: There lived a king before you and he had a (court) magician. As he (the magician) grew old, he said to the king: I have grown old, send some young boy to me so that I should teach him magic. He (the king) sent to him a young man so that he should train him (in magic). And on his way (to the magician) he (the young man) found a monk sitting there. He (the young man) listened to his (the monk's) talk and was impressed by it. It became his habit that on his way to the magician he met the monk and set there and he came to the magician (late). He (the magician) beat him because of delay. He made a complaint of that to the monk and he said to him: When you feel afraid of the magician, say: Members of my family had detained me. And when you feel afraid of your family you should say: The magician had detained me. It so happened that there came a huge beast (of prey) and it blocked the way of the people, and he (the young boy) said: I will come to know today whether the magician is superior or the monk is superior. He picked up a stone and said: O Allah, if the affair of the monk is dearer to Thee than the affair of the magician, cause death to this animal so that the people should be able to move about freely. He threw that stone towards it and killed it and the people began to move about (on the path freely). He (the young man) then came to that monk and Informed him and the monk said: Sonny, today you are superior to me. Your affair has come to a stage where I find that you would be soon put to a trial, and in case you are put to a trial don't give my clue. That young man began to treat the blind and those suffering from leprosy and he in fact began to cure people from (all kinds) of illness. When a companion of the king who had gone blind heard about him, he came to him with numerous gifts and said: If you cure me all these things collected together here would be yours. Be said: I myself do not cure anyone. It is Allah Who cures and if you affirm faith in Allah, I shall also supplicate Allah to cure you. \nHe affirmed his faith in Allah and Allah cured him and he came to the king and sat by his side as he used to sit before. The king said to him: Who restored your eyesight? He said: My Lord. Thereupon he said: It means that your Lord is One besides me. He said: My Lord and your Lord is Allah, so he (the king) took hold of him and tormented him till he gave a clue of that boy. The young man was thus summoned and the king said to him: O boy, it has been conveyed to me that you have become so much proficient in your magic that you cure the blind and those suffering from leprosy and you do such and such things. Thereupon he said: I do not cure anyone; it is Allah Who cures, and he (the king) took hold of him and began to torment him. So he gave a clue of the monk. The monk was thus summoned and it was said to him: You should turn back from your religion. He, however, refused to do so. He (ordered) for a saw to be brought (and when it was done) he (the king) placed it in the middle of his head and tore it into parts till a part fell down. Then the courtier of the king was brought and it was said to him: Turn back from your religion. Arid he refused to do so, and the saw was placed in the midst of his head and it was torn till a part fell down. Then that young boy was brought and it was said to him: Turn back from your religion. He refused to do so and he was handed over to a group of his courtiers. And he 'said to them: Take him to such and such mountain; make him climb up that mountain and when you reach its top (ask him to renounce his faith) but if he refuses to do so, then throw him (down the mountain). So they took him and made him climb up the mountain and he said: O Allah, save me from them (in any way) Thou likest and the mountain began to quake and they all fell down and that person came walking to the king. The king said to him: What has happened to your companions? He said: Allah has saved me from them. He again handed him to some of his courtiers and said: Take him and carry him in a small boat and when you reach the middle of the ocean (ask him to renounce) his religion, but if he does not renounce his religion throw him (into the water). \nSo they took him and he said: O Allah, save me from them and what they want to do. It was quite soon that the boat turned over and they were drowned and he came walking to the king, and the king said to him: What has happened to your companions? He said: Allah has saved me from them, and he said to the king: You cannot kill me until you do what I ask you to do. And he said: What is that? He said: You should gather people in a plain and hang me by the trunk (of a tree). Then take hold of an arrow from the quiver and say: In the name of Allah, the Lord of the young boy; then shoot an arrow and if you do that then you would be able to kill me. So he (the king) called the people in an open plain and tied him (the boy) to the trunk of a tree, then he took hold of an arrow from his quiver and then placed the arrow in the bow and then said: In the name of Allah, the Lord of the young boy; he then shot an arrow and it bit his temple. He (the boy) placed his hands upon the temple where the arrow had bit him and he died and the people said: We affirm our faith in the Lord of this young man, we affirm our faith in the Lord of this young man, we affirm our faith in the Lord of this young man. The courtiers came to the king and it was said to him: Do you see that Allah has actually done what you aimed at averting. They (the people) have affirmed their faith in the Lord. He (the king) commanded ditches to be dug at important points in the path. When these ditches were dug, and the fire was lit in them it was said (to the people): He who would not turn back from his (boy's) religion would be thrown in the fire or it would be said to them to jump in that. (The people courted death but did not renounce religion) till a woman came with her child and she felt hesitant in jumping into the fire and the child said to her: 0 mother, endure (this ordeal) for it is the Truth.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 377410,
        "last_updated": "2012-10-11 18:45:30"
    },
    {
        "englishURN": 271490,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "19.00",
        "babName": " THE STORY OF ABU AL-YASAR AND THE LENGTHY HADITH OF JABIR",
        "hadithNumber": 7149,
        "hadithText": "<p>\n'Ubadah b. Walid b. Samit reported: I and my father set out in search of knowledge to a tribe of the Ansar before their death (i. e. before the Companions of the Prophet left the world) and I was the first to meet Abu Yasar, a Companion of Allah's Messenger (ﷺ) and there was a young man with him who carried the record of letters with him and there was a mantle prepared by the tribe of Ma'afiri upon him. And his servant too had a Ma'afiri mantle over him. My father said to him: My uncle, I see the signs of anger or that of agony on your face. He said: Yes, such and such person, the son of so and so, of the tribe of Harami owed me a debt. I went to his family, extended salutations and said: Where is he? They said: He is not here. Then came out to me his son who was at the threshold of his youth. I said to him: Where is your father? He said: No sooner did he hear your sound than he hid himself behind my mother's bedstead. I said to him: Walk out to me, for I know where you are. He came out. I said to him: What prompted you to hide yourself from me? He said: By God, whatever I would say to you would not be a lie. By Allah, I fear that I should tell a lie to you and in case of making promise with you I should break it, as you are the Companion of Allah's Messenger (ﷺ). The fact is that I was hard up in regard to money. I said: Do you adjure by Allah? He said: I adjure by Allah. I said: Do you adjure by Allah? He said: I adjure by Allah. I said: Do you adjure by Allah? He said: I adjure by Allah. Then he brought his promissory note and he wrote off (the debt) with his hand and said: Make payment when you find yourself solvent enough to pay me back; if you are not, then there is no liability upon you. These two eyes of mine saw, and he (Abu'I-Yasar) placed his fingers upon his eyes and these two ears of mine heard and my heart retained, and he pointed towards his heart that Allah's Messenger (ﷺ) said: He who gives time to one who is financially hard up (in the payment of debt) or writes off his debt, Allah will provide him His shadow. I said to him: My uncle, if you get the cloak of your servant and you give him your two clothes, or take his two clothes of Ma'afir and give him your cloak, then there would be one dress for you and one for him. \nHe wiped my head and said: O Allah, bless the son of my brother. O, son of my brother, these two very eyes of mine saw and these two ears of mine listened to and this heart of mine retained this, and he pointed towards the heart that Allah's Messenger (ﷺ) said: Feed them (the servants) and clothe them (the servants) what you wear, and if I give him the goods of the world, it is easy for me than this that he should take my virtues on the Day of Resurrection. We went on till we came to Jabir b. Abdullah in the mosque and he was busy in observing prayer in one cloth which he had joined at its opposite ends. I made my way through the people till I sat between him and the Qibla and I said: May Allah have mercy upon you. Do you observe prayer with one cloth on your body whereas your mantle is lying at your side? He pointed me with his hand towards my breast just like this and he separated his fingers and bent them in the shape of a bow. And (he said): I thought that a fool like you should come to me so that he should see me as I do and he should then also do like it. Allah's Messenger (ﷺ) came to us in this very mosque and he had in his hand the twig of the palm-tree and he saw mucus towards the Qibla of the mosque and he erased it with the help of the twig. He then came to us and said: Who amongst you likes that Allah should turn His face away from him? We were afraid. He then again said: Who amongst you likes that Allah should turn His face away from him? We were afraid. He again said: Who amongst you likes that Allah should turn His face away from him? We said: Allah's Messenger, none of us likes it. And he said: If one amongst you stands for prayer, Allah, the Exalted and Glorious, is before him he should not spit in front of him, or on his right side, but should spit on his left side beneath his left foot and if he is impelled to do so all of a sudden (in spite of himself) he should then spit in his cloth and fold it in some part of it. (and he further said: ) Bring some sweet-smelling thing. A young man who belonged to our tribe stood up, went and brought scent in his palm. Allah's Messenger (ﷺ) took that and applied it to the end of that twig and then touched the place where there had been mucus. Jabir said: This is why you should apply scent to your mosques. \nIt is reported on the same authority: We set out along with Allah's Messenger (ﷺ) on an expedition of Batn Buwat. He (the Holy Prophet) was in search of al-Majdi b. 'Amr al-Juhani. (We had so meagre equipment) that five. six or seven of us had one camel to ride and so we mounted it turn by turn. Once there wan. the turn of an Ansari to ride upon the camel. He made it kneel down to ride over it (and after having. mounted it), he tried to raise it up but it hesitated. So he said. May there be curse of Allah upon you! Thereupon Allah's Messenger (ﷺ) said: Who is there to curse his camel? He said: Allah's Messenger, it' is I. Thereupon he said: Get down from the camel and let us not have in our company the cursed one. Don't curse your own selves, nor your children. nor your belongings. There is the possibility that your curse may synchronies with the time when Allah is about to confer upon you what you demand and thus your prayer may be readily responded. \nIt is reported on the same authority: We set out on an expedition along with Allah's Messenger (ﷺ) until it was evening, and we had been near a. water reservoir of Arabia. Allah's Messenger (ﷺ) said: Who would be the person who would go ahead and set right the reservoir and drink water himself and serve us with it? Jabir said: I stood up and said: Allah's Messenger, it is I who am ready to do that. Thereupon Allah's Messenger (ﷺ) said: Who is the person to accompany Jabir? And then Jabbar b. Sakhr stood up. So we went to that well and poured in that tank a bucket or two of water and plastered it with clay and then began to fill it (with water) until it was filled to the brim. Allah's Messenger (ﷺ) was the first who appeared before us, and he said: Do you (both) permit me to drink water out of it? We said: Yea, Allah's Messenger. He led his camel to drink water and it drank. He then pulled its rein and it stretched its legs and began to urinate. He then took it aside and made it kneel down at another place and then came to the tank and performed ablution. I then got up and performed ablution like the ablution of Allah's Messenger (ﷺ), and Jabbar b. Sakhr went in order to relieve himself and Allah's Messenger (ﷺ) got up to observe prayer and there was a mantle over me. I tried to invert its ends but it was too short (to cover my body easily). It had its borders. I then inverted it (the mantle) and drew its opposite ends and then tied them at my neck. I then came and stood upon the left side of Allah's Messenger (ﷺ). He caught hold of me and made me go round behind him, until he made me stand on his right side. Then Jabbar b. Sakhr came. He performed ablution and then came and stood on the left side of Allah's Messenger (ﷺ). Then Allah's Messenger (ﷺ) caught hold of our hands together, pushed us back and made us stand behind him. Then Allah's Messenger (ﷺ) began to look upon me with darting looks, but I did not perceive that. After that I became aware of it and he pointed with the gesture of his hand that I should wrap my loin-cloth. When Allah's Messenger (ﷺ) had finished the prayer, he said: Jabir! I said: Allah's Messenger, at thy beck and call. He said: When the cloth around you is inadequate, then tie the opposite ends but when it is small, tie it over the lower body. \nJabir reported: We set out on an expedition with Allah's Messenger (ﷺ) and the only means of sustenance for every person amongst us was only one date for a day and we used to chew it. And we struck the leaves with the help of our bow and ate them until the sides of our mouths were injured. It so happened one day that a person was overlooked and not given a date. We carried that person and bore witness to the fact that he had not been given that date so he was offered that and he got up and received that. \nJabir reported: We set out on an expedition along with Allah's Messenger (ﷺ) until we got down at a spacious valley and Allah's Messenger (ﷺ) went to relieve himself. I followed him with a bucket full of water and Allah's Messenger (ﷺ) looked about and he found no privacy but two trees at the end of the valley and Allah's Messenger (may. peace be upon him) went to one of them and took hold of one of its twigs and said: Be thou under my control by the permission of Allah, and so it came under his control like the camel who has its nosestring in the hand of its rider, and then he came to the second tree and took hold of a twig and said: Be thou under my control with the permission of Allah, and it came under his control, and when he came in the middle of the two trees he joined together the two twigs and said: join with the permission of Allah. Jabir said: I was afraid lest Allah's Messenger (ﷺ) should be aware of my nearness and go still farther. And Muhammad b. Abbad has used the word\" faitab'd\" and I began to talk to myself. And as I saw, I suddenly found Allah's Messenger (ﷺ) before me and the two trees were separated and each one of them was standing at its place. I saw Allah's Messenger (ﷺ) standing for a short time, nodding his head towards right and left. Isma'il pointed towards the right and left with the help of his head (in order to demonstrate how the Prophet had pointed). Then he (the Holy Prophet) came to me and said: Jabir did you see my place where I was standing? I said: Allah's Messenger, yes. He then said: Then you should go to those two trees and cut a twig from each of them and go to that place with them where I was standing and stand there where I was standing and place a twig on the right and a twig on the left. Jabir said: I set out and took hold of a stone and broke it and sharpened it and then I came to those trees and cut a twig from each one of them. \nI then came dragging them until I stood at the place where Allah's Messenger (ﷺ) had been standing and placed a twig on the right and a twig on the left. Then I met him and said: Allah's Messenger, I have done that, but (kindly) explain to me the reason for it. Thereupon he said: I passed by two graves the occupants of which had been undergoing torment. I liked to make intercession for them so that the might be relieved of this torment y as long as these twigs remain fresh. Jabir said: We came back to the (camp of the) army and Allah's Messenger (ﷺ) said: Jabir, call people for per- forming wudu. I cried: Come and perform wudu, come and perform wudu, come and perform wudu. I said: Allah's Messenger, there is not even a drop of water in the army camp, and there. was a person who used to cool the water for Allah's Messenger (ﷺ) in the old water-skin which kept hanging by the twig. He asked me to go to such and such Ansari and ask him to see if there was any water in that skin. I went to him and cast a glance in it but did not find anything but a drop in the mouth of that water-skin and if I were to draw that, the water-skin's,. dried part would suck it up. I came to Allah's Messenger (ﷺ) and said: Allah's Messenger, I have not found anything in it but a drop of water in the mouth of the water-skin and now if I were to draw that, it would be absorbed. He said: Go and bring that to me. I brought that to him. He took hold of it -and began to utter something which I could not understand and then pressed it with his hand and gave that to me and said: Jabir, announce for the tub to be brought. So I announced that the tub of the army (be brought). It was brought accordingly and I placed it before him (the Holy Prophet). Thereupon Allah's Messenger (ﷺ) placed his hands in the tub like this: with his fingers stretched out, and then he placed his fingers at the bottom of the tub and said: Jabir, take it (that waters-skin) and pour water over me, by reciting Bismillah, and I poured water and I said: Bismillah, and found water sprouting out between the fingers of Allah's Messenger (ﷺ). Then that tub gushed forth until it was filled up and the Messenger (ﷺ) said: Jabir, make an announcement to the effect: He who needs water should take that. Jabir said: The people came and got water until they were all satiated. I said: Is there anyone left who wants to get it? And Allah's Messenger (ﷺ) then lifted up his hand from that tub and it was still full. Then the people made a complaint to Allah's Messenger (ﷺ) about hunger and he said: May Allah provide you food! We came to the bank of the ocean and the ocean was tossing and it threw out a big animal and we lit fire and cooked it and took it until we had eaten to our heart's content. Jabir said: I and such and such five persons entered Its socket and nobody could see us until we had come out, and we took hold of one of its ribs and twisted it into a sort of arch, then we called the tallest of the persons of the army and the hugest of the camels of the army and it had the big saddle over it, and it could easily pass through it without the rider having need to bend down.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 377421,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271501,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "20.00",
        "babName": " THE ACCOUNT OF PROPHET'S (MAY PEACE BE UPON HIM) EMIGRATION",
        "hadithNumber": 7150,
        "hadithText": "<p>\nAl-Bara' b. 'Azib reported that Abu Bakr Siddiq came to the residence of my father ('Azib) and bought a haudaj from him and said to 'Azib: Send your son to my residence (to carry this haudaj), and my father said to me: Carry it (for him). So I carried it and there went along with him (with Abu Bakr) my father in order to fetch its price and he ('Azib) said to Abu Bakr: Abu Bakr, narrate to me what you both did on the night when you set out on a journey along with Allah's Messenger (ﷺ). He said: We set out during the night and went on walking until it was noon, and the path was vacant and so none passed by that (until) there appeared prominently before us a large rock. It had its shade and the rays of the sun did not reach that place. So we got down at that place. I then went to the rock and levelled the ground with my hands at the place where the Prophet (ﷺ) would take rest under its shade. I then set the bedding and said: Allah's Messenger, go to sleep and I shall keep a watch around you. I went out and watched around him. There we saw a shepherd moving towards that rock with his flock and he intended what we intended (i. e. taking rest). I met him and said to him: Young boy, to which place do you belong? He said: I am a person from Medina. I said, is there any milk in the udders of your sheep and goats? He said: Yes. He took hold of a goat, and I said to him: Clean the udder well so that it should be free from hair, dust and impurity. I saw al-Bara' striking his hand upon the other (to give an indication) how he did that. He milked the goat for me in a wooden cup which he had with him and I had with me a bucket in which I kept water for drinking and for performing ablution. I came to Allah's Apostle (ﷺ) and did not like to awaken him from sleep but he was accidentally startled from the sleep. I poured water upon the milk (till It was cold) and I said: Allah's Messenger, take this milk. He then took It and I was delighted and he (the Holy Prophet) said: Is now not the time to march on? I said: Of course. So he marched on after the sun had passed the meridian and Suraqa b. Malik pursued us and we had been walking on soft, level ground. I said: Allah's Messenger, we are about to be overtaken by them. Thereupon he said: Be not grieved. Verily, Allah is with us. Then Allah's Messenger (ﷺ) cursed him and his horse sank into the earth. I think he also said: I know you have hurled curse upon me. So supplicate Allah for me and I take an oath that I shall turn everyone away who would come in search of you. So he (Allah's Messenger) supplicated Allah and he was rescued and he came back and to everyone he met, he said: I have combed all this side. In short, he diverted everyone whom he met and he in fact fulfilled his promise.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 377442,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 271502,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 42,
        "bookName": "The Book Pertaining to Piety and Softening of Hearts (Kitab Al-Zuhd wa Al-Raqa'iq)",
        "babNumber": "20.00",
        "babName": " THE ACCOUNT OF PROPHET'S (MAY PEACE BE UPON HIM) EMIGRATION",
        "hadithNumber": 7150,
        "hadithText": "Al-Bara' reported: Abu Bakr purchased a saddle from me for thirteen dirhams; the rest of the hadith is the same, and in the narration of Uthman b. 'Umar, the words are: He (Suraqa b. Malik) drew near Allah's Messenger (ﷺ), and he (the Holy Prophet) cursed him and his camel sank in the earth up to the belly and he jumped from that and said: Muhammad, I am fully aware of It that it is your doing. Supplicate Allah that He should rescue me from it in which I am (pitchforked) and I give you a solemn pledge that I shall keep this as a secret from all those who are coming after me. Take hold of an arrow out of it (quiver) for you will find my camels and my slaves at such and such place and you can get whatever you need (on showing this arrow). He (the Holy Prophet) said: I don't need your camels. And we (the Prophet and Abu Bakr) came to Medina during the night and the people began to contend as to where Allah's Messenger (ﷺ) should reside and he encamped in the tribe of Najjar who were related to 'Abd ul-Muttalib from the side of mother. Allah's Messenger (ﷺ) honoured them, then people climbed upon house-top and women also and boys scattered in the way, and they were all crying: Muhammad, Messenger of Allah, Muhammad, Messenger of Allah.</b>",
        "bookID": "42.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 377443,
        "last_updated": "2012-04-26 14:00:00"
    }
]