[
    {
        "englishURN": 8990,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 14,
        "bookName": "Fear Prayer",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 64,
        "hadithText": "<p>\nNarrated Shu'aib:\n\n<p>I asked Az-Zuhri, \"Did the Prophet (ﷺ) ever offer the Fear Prayer?\" Az-Zuhri said, \"I was told by Salim \nthat `Abdullah bin `Umar I had said, 'I took part in a holy battle with Allah's Messenger (ﷺ) I in Najd. We \nfaced the enemy and arranged ourselves in rows. Then Allah's Messenger (ﷺ) (p.b.u.h) stood up to lead the \nprayer and one party stood to pray with him while the other faced the enemy. Allah's Messenger (ﷺ) (p.b.u.h) \nand the former party bowed and performed two prostrations. Then that party left and took the place of \nthose who had not prayed. Allah's Messenger (ﷺ) prayed one rak`a (with the latter) and performed two \nprostrations and finished his prayer with Taslim. Then everyone of them bowed once and performed \ntwo prostrations individually.' \"</b>",
        "bookID": "14.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 108280,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 9000,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 14,
        "bookName": "Fear Prayer",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 65,
        "hadithText": "<p>\nNarrated Nafi`:\n\n<p>Ibn `Umar said something similar to Mujahid's saying: Whenever (Muslims and non-Muslims) stand \nface to face in battle, the Muslims can pray while standing. Ibn `Umar added, \"The Prophet (ﷺ) said, 'If \nthe number of the enemy is greater than the Muslims, they can pray while standing or riding \n(individually).' \"</b>",
        "bookID": "14.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 108290,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 9010,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 14,
        "bookName": "Fear Prayer",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 66,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>Once the Prophet (p.b.u.h) led the fear prayer and the people stood behind him. He said Takbir \n(Allahu-Akbar) and the people said the same. He bowed and some of them bowed. Then he prostrated \nand they also prostrated. Then he stood for the second rak`a and those who had prayed the first rak`a \nleft and guarded their brothers. The second party joined him and performed bowing and prostration \nwith him. All the people were in prayer but they were guarding one another during the prayer.</b>",
        "bookID": "14.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 108300,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 9020,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 14,
        "bookName": "Fear Prayer",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 67,
        "hadithText": "<p>\nNarrated Jabir bin `Abdullah:\n\n<p>On the day of the Khandaq `Umar came, cursing the disbelievers of Quraish and said, \"O Allah's \nApostle! I have not offered the `Asr prayer and the sun has set.\" The Prophet (ﷺ) replied, \"By Allah! I too, \nhave not offered the prayer yet. \"The Prophet (ﷺ) then went to Buthan, performed ablution and performed \nthe `Asr prayer after the sun had set and then offered the Maghrib prayer after it.\"</b>",
        "bookID": "14.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 108310,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 9025,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 14,
        "bookName": "Fear Prayer",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 67,
        "hadithText": "Narrated Ibn `Umar:\nWhen the Prophet (ﷺ) returned from the battle of Al-Ahzab (The confederates), he said to us, \"None should offer the 'Asr prayer but at Bani Quraiza.\" The 'Asr prayer became due for some of them on the way. Some of them decided not to offer the Salat but at Bani Quraiza while others decided to offer the Salat on the spot and said that the intention of the Prophet (ﷺ) was not what the former party had understood. And when that was told to the Prophet (ﷺ) he did not blame anyone of them.</b>",
        "bookID": "14.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 108320,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 9030,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 14,
        "bookName": "Fear Prayer",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 68,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>Allah's Messenger (ﷺ) (p.b.u.h) offered the Fajr prayer when it was still dark, then he rode and said, 'Allah \nAkbar! Khaibar is ruined. When we approach near to a nation, the most unfortunate is the morning of \nthose who have been warned.\" The people came out into the streets saying, \"Muhammad and his \narmy.\" Allah's Messenger (ﷺ) vanquished them by force and their warriors were killed; the children and \nwomen were taken as captives. Safiya was taken by Dihya Al-Kalbi and later she belonged to Allah's \nApostle go who married her and her Mahr was her manumission.</b>",
        "bookID": "14.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 108330,
        "last_updated": "2012-04-26 07:00:00"
    }
]