[
    {
        "englishURN": 9850,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 150,
        "hadithText": "<p>\nNarrated Abu Bakra:\n\n<p>We were with Allah's Messenger (ﷺ) when the sun eclipsed. Allah's Messenger (ﷺ) stood up dragging his cloak till \nhe entered the Mosque. He led us in a two-rak`at prayer till the sun (eclipse) had cleared. Then the \nProphet (p.b.u.h) said, \"The sun and the moon do not eclipse because of someone's death. So \nwhenever you see these eclipses pray and invoke (Allah) till the eclipse is over.\"</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 109260,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 9860,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 151,
        "hadithText": "<p>\nNarrated Abu Mas`ud:\n\n<p>The Prophet (ﷺ) said, \"The sun and the moon do not eclipse because of the death of someone from the \npeople but they are two signs amongst the signs of Allah. When you see them stand up and pray.\"</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 109270,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 9870,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 152,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>The Prophet (ﷺ) said, \"The sun and the moon do not eclipse because of the death or life (i.e. birth) of \nsomeone but they are two signs amongst the signs of Allah. When you see them offer the prayer.\"</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 109280,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 9880,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 153,
        "hadithText": "<p>\nNarrated Al-Mughira bin Shu`ba:\n\n<p>\"The sun eclipsed in the lifetime of Allah's Messenger (ﷺ) on the day when (his son) Ibrahim died. So the \npeople said that the sun had eclipsed because of the death of Ibrahim. Allah's Messenger (ﷺ) said, \"The sun \nand the moon do not eclipse because of the death or life (i.e. birth) of someone. When you see the \neclipse pray and invoke Allah.\"</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 109290,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 9890,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 154,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>In the lifetime of Allah's Messenger (ﷺ) (p.b.u.h) the sun eclipsed, so he led the people in prayer, and stood \nup and performed a long Qiyam, then bowed for a long while. He stood up again and performed a \nlong Qiyam but this time the period of standing was shorter than the first. He bowed again for a long \ntime but shorter than the first one, then he prostrated and prolonged the prostration. He did the same in \nthe second rak`a as he did in the first and then finished the prayer; by then the sun (eclipse) had \ncleared. He delivered the Khutba (sermon) and after praising and glorifying Allah he said, \"The sun \nand the moon are two signs against the signs of Allah; they do not eclipse on the death or life of \nanyone. So when you see the eclipse, remember Allah and say Takbir, pray and give Sadaqa.\" The \nProphet then said, \"O followers of Muhammad! By Allah! There is none who has more ghaira (selfrespect) \nthan Allah as He has forbidden that His slaves, male or female commit adultery (illegal \nsexual intercourse). O followers of Muhammad! By Allah! If you knew that which I know you would \nlaugh little and weep much.</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 109300,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 9900,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 155,
        "hadithText": "<p>\nNarrated `Abdullah bin `Amr:\n\n<p>\"When the sun eclipsed in the lifetime of Allah's Messenger (ﷺ) an announcement was made that a prayer \nwas to be offered in congregation.\"</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 109310,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 9910,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 156,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>(the wife of the Prophet (p.b.u.h) In the lifetime of the Prophet (ﷺ) the sun eclipsed and he went to the \nMosque and the people aligned behind him. He said the Takbir (starting the prayer) and prolonged the \nrecitation (from the Qur'an) and then said Takbir and performed a prolonged bowing; then he (lifted \nhis head and) said, \"Sami allahu liman hamidah\" (Allah heard him who sent his praises to Him). He \nthen did not prostrate but stood up and recited a prolonged recitation which was shorter than the first \nrecitation. He again said Takbir and then bowed a prolonged bowing but shorter than the first one and \nthen said, \"Sami`a l-lahu Lyman hamidah Rabbana walak-lhamd, (Allah heard him who sent his \npraises to Him. O our Sustainer! All the praises are for You)\" and then prostrated and did the same in \nthe second rak`a; thus he completed four bowing and four prostrations. The sun (eclipse) had cleared \nbefore he finished the prayer. (After the prayer) he stood up, glorified and praised Allah as He \ndeserved and then said, \"The sun and the moon are two of the signs of Allah. They do not eclipse \nbecause of the death or the life (i.e. birth) of someone. When you see them make haste for the prayer.\" \nNarrated Az-Zuhri: I said to 'Urwa, \"When the sun eclipsed at Medina your brother (`Abdullah bin Az-Zubair) offered only a two-rak`at prayer like that of the morning (Fajr) prayer.\" 'Urwa replied, \"Yes, \nfor he missed the Prophet's tradition (concerning this matter).\"</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 109320,
        "last_updated": "2012-12-28 14:51:32"
    },
    {
        "englishURN": 9920,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 157,
        "hadithText": "<p>\nNarrated Aisha:\n\n<p>(the wife of the Prophet) On the day when the sun Khasafat (eclipsed) Allah's Messenger (ﷺ) prayed; he \nstood up and said Takbir and recited a prolonged recitation, then he performed a prolonged bowing, \nthen he raised his head and said, \"Sami`a l-lahu Lyman Hamidah,\" and then remained standing and \nrecited a prolonged recitation which was shorter than the first. Then he performed a prolonged bowing \nwhich was shorter than the first. Then he prostrated and prolonged the prostration and he did the same \nin the second rak`a as in the first and then finished the prayer with Taslim. By that time the sun \n(eclipse) had cleared He addressed the people and said, \"The sun and the moon are two of the signs of \nAllah; they do not eclipse (Yakhsifan) because of the death or the life (i.e. birth) of someone. So when \nyou see them make haste for the prayer.\"</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 109330,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 9930,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 158,
        "hadithText": "<p>\nNarrated Abu Bakra:\n\n<p>Allah's Messenger (ﷺ) said: \"The sun and the moon are two signs amongst the signs of Allah and they do not \neclipse because of the death of someone but Allah frightens His devotees with them.\"</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 109340,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 9940,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 159,
        "hadithText": "<p>\nNarrated `Amra bint `Abdur-Rahman:\n\n<p>A Jewess came to ask `Aisha (the wife of the Prophet) about something. She said to her, \"May Allah \ngive you refuge from the punishment of the grave.\" So `Aisha ' asked Allah's Messenger (ﷺ) \"Would the \npeople be punished in their graves?\" Allah's Messenger (ﷺ) after seeking refuge with Allah from the \npunishment of the grave (and thus replied in the affirmative). Then one day, Allah's Messenger (ﷺ) rode to go \nto some place but the sun eclipsed. He returned in the forenoon and passed through the rear of the \ndwellings (of his wives) and stood for the (eclipse) prayer, and the people stood behind him. He stood \nup for a long period and then performed a prolonged bowing which was shorter than the first bowing. \nThen he raised his head and prostrated. Then he stood up (for the second rak`a) for a long while but \nthe standing was shorter than that of the first rak`a. Then he performed a prolonged bowing which was \nshorter than the first one. Then he raised his head and prostrated. Then he stood up for a long time but \nshorter than the first. Then he performed a prolonged bowing but shorter than the first. Then he raised \nhis head and prostrated and finished the prayer and (then delivered the sermon and) said as much as \nAllah wished. And then he ordered the people to seek refuge with Allah from the punishment of the \ngrave.</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 109351,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 9950,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 160,
        "hadithText": "<p>\nNarrated `Abdullah bin `Amr:\n\n<p>When the sun eclipsed in the lifetime of Allah's Messenger (ﷺ) and an announcement was made that the \nprayer was to be held in congregation. The Prophet (ﷺ) performed two bowing in one rak`a. Then he stood \nup and performed two bowing in one rak`a. Then he sat down and finished the prayer; and by then the \n(eclipse) had cleared `Aisha said, \"I had never performed such a long prostration.\"</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 109370,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 9960,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 161,
        "hadithText": "<p>\nNarrated `Abdullah bin `Abbas:\n\n<p>The sun eclipsed in the lifetime of the Prophet (p.b.u.h) . Allah's Messenger (ﷺ) offered the eclipse prayer \nand stood for a long period equal to the period in which one could recite Surat-al-Baqara. Then he \nbowed for a long time and then stood up for a long period which was shorter than that of the first \nstanding, then bowed again for a long time but for a shorter period than the first; then he prostrated \ntwice and then stood up for a long period which was shorter than that of the first standing; then he \nbowed for a long time which was shorter than the previous one, and then he raised his head and stood \nup for a long period which was shorter than the first standing, then he bowed for a long time which \nwas shorter than the first bowing, and then prostrated (twice) and finished the prayer. By then, the sun \n(eclipse) had cleared. The Prophet (ﷺ) then said, \"The sun and the moon are two of the signs of Allah. \nThey eclipse neither because of the death of somebody nor because of his life (i.e. birth). So when you \nsee them, remember Allah.\" The people say, \"O Allah's Messenger (ﷺ)! We saw you taking something from \nyour place and then we saw you retreating.\" The Prophet (ﷺ) replied, \"I saw Paradise and stretched my \nhands towards a bunch (of its fruits) and had I taken it, you would have eaten from it as long as the \nworld remains. I also saw the Hell-fire and I had never seen such a horrible sight. I saw that most of \nthe inhabitants were women.\" The people asked, \"O Allah's Messenger (ﷺ)! Why is it so?\" The Prophet (ﷺ) \nreplied, \"Because of their ungratefulness.\" It was asked whether they are ungrateful to Allah. The \nProphet said, \"They are ungrateful to their companions of life (husbands) and ungrateful to good \ndeeds. If you are benevolent to one of them throughout the life and if she sees anything (undesirable) \nin you, she will say, 'I have never had any good from you.' \"</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 109380,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 9970,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 162,
        "hadithText": "<p>\nNarrated Fatima bint Al-Mundhir:\n\n<p>Asma' bint Al Bakr said, \"I came to `Aisha the wife of the Prophet (p.b.u.h) during the solar eclipse. \nThe people were standing and offering the prayer and she was also praying too. I asked her, 'What has \nhappened to the people?' She pointed out with her hand towards the sky and said, 'Subhan-Allah'. I \nsaid, 'Is there a sign?' She pointed out in the affirmative.\" Asma' further said, \"I too then stood up for \nthe prayer till I fainted and then poured water on my head. When Allah's Messenger (ﷺ) had finished his \nprayer, he thanked and praised Allah and said, 'I have seen at this place of mine what I have never \nseen even Paradise and Hell. No doubt, it has been inspired to me that you will be put to trial in the \ngraves like or nearly like the trial of (Masih) Ad-Dajjal. (I do not know which one of the two Asma' \nsaid.) (The angels) will come to everyone of you and will ask what do you know about this man (i.e. \nMuhammad). The believer or a firm believer (I do not know which word Asma' said) will reply, 'He is \nMuhammad, Allah's Messenger (ﷺ) (p.b.u.h) who came to us with clear evidences and guidance, so we \naccepted his teachings, believed and followed him.' The angels will then say to him, 'Sleep peacefully \nas we knew surely that you were a firm believer.' The hypocrite or doubtful person (I do not know \nwhich word Asma' said) will say, 'I do not know. I heard the people saying something so I said it (the \nsame).' \"</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 109390,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 9980,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 163,
        "hadithText": "<p>\nNarrated Asma:\n\n<p>No doubt the Prophet (ﷺ) ordered people to manumit slaves during the solar eclipse.</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 109400,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 9990,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 164,
        "hadithText": "<p>\nNarrated `Amra bint `Abdur-Rahman:\n\n<p>A Jewess came to `Aisha to ask her about something and then she said, \"May Allah give you refuge \nfrom the punishment of the grave.\" So `Aisha asked Allah's Messenger (ﷺ), \"Would the people be punished \nin their graves?\" Allah's Messenger (ﷺ) asked Allah's refuge from the punishment of the grave (indicating an \naffirmative reply). Then one day Allah's Messenger (ﷺ) rode (to leave for some place) but the sun eclipsed. \nHe returned on the forenoon and passed through the rear of the dwellings (of his wives) and stood up \nand started offering the (eclipse) prayer and the people stood behind him. He stood for a long period \nand then performed a long bowing and then stood straight for a long period which was shorter than \nthat of the first standing, then he performed a prolonged bowing which was shorter than the first \nbowing, then he raised his head and prostrated for a long time and then stood up (for the second rak`a) \nfor a long while, but the standing was shorter than the standing of the first rak`a. Then he performed a \nprolonged bowing which was shorter than that of the first one. He then stood up for a long time but \nshorter than the first, then again performed a long bowing which was shorter than the first and then \nprostrated for a shorter while than that of the first prostration. Then he finished the prayer and \ndelivered the sermon and) said what Allah wished; and ordered the people to seek refuge with Allah \nfrom the punishment of the grave.</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 109411,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 10000,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 165,
        "hadithText": "<p>\nNarrated Abu Mas`ud:\n\n<p>Allah's Messenger (ﷺ) said, \"The sun and the moon do not eclipse because of someone's death or life but they \nare two signs amongst the signs of Allah, so pray whenever you see them.\"</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 109430,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 10010,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 166,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>In the lifetime of the Prophet (ﷺ) the sun eclipsed and the Prophet (p.b.u.h) stood up to offer the prayer \nwith the people and recited a long recitation, then he performed a prolonged bowing, and then lifted \nhis head and recited a prolonged recitation which was shorter than the first. Then he performed a \nprolonged bowing which was shorter than the first and then lifted his head and performed two \nprostrations. He then stood up for the second rak`a and offered it like the first. Then he stood up and \nsaid, \"The sun and the moon do not eclipse because of someone's life or death but they are two signs \namongst the signs of Allah which He shows to His worshipers. So whenever you see them, make haste \nfor the prayer.\"</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 109440,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 10020,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 167,
        "hadithText": "<p>\nNarrated Abu Musa:\n\n<p>The sun eclipsed and the Prophet (ﷺ) got up, being afraid that it might be the Hour (i.e. Day of Judgment). \nHe went to the Mosque and offered the prayer with the longest Qiyam, bowing and prostration that I \nhad ever seen him doing. Then he said, \"These signs which Allah sends do not occur because of the \nlife or death of somebody, but Allah makes His worshipers afraid by them. So when you see anything \nthereof, proceed to remember Allah, invoke Him and ask for His forgiveness.\"</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 109450,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 10030,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 168,
        "hadithText": "<p>\nNarrated Al-Mughira bin Shu`ba:\n\n<p>On the day of Ibrahim's death, the sun eclipsed and the people said that the eclipse was due to the \ndeath of Ibrahim (the son of the Prophet). Allah's Messenger (ﷺ) said, \"The sun and the moon are two signs \namongst the signs of Allah. They do not eclipse because of someone's death or life. So when you see \nthem, invoke Allah and pray till the eclipse is clear.\"</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 109460,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 10035,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 168,
        "hadithText": "And this was narrated by Asma' who said, \"Allah's Messenger (ﷺ) finished the eclipse prayer and by then the sun (eclipse) had cleared. Then he delivered the Khutba (religious talk) and praised Allah as He deserved and then said Amma ba'du.\"</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 109470,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 10040,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 169,
        "hadithText": "<p>\nNarrated Abu Bakra:\n\n<p>In the lifetime of the Prophet (ﷺ) the sun eclipsed and then he offered a two rak`at prayer.</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 109480,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 10050,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 170,
        "hadithText": "<p>\nNarrated Abu Bakra:\n\n<p>In the lifetime of the Allah's Messenger (ﷺ) (p.b.u.h) the sun eclipsed and he went out dragging his clothes \ntill he reached the Mosque. The people gathered around him and he led them and offered two rak`at. \nWhen the sun (eclipse) cleared, he said, \"The sun and the moon are two signs amongst the signs of \nAllah; they do not eclipse because of the death of someone, and so when an eclipse occurs, pray and \ninvoke Allah till the eclipse is over.\" It happened that a son of the Prophet (ﷺ) called Ibrahim died on that \nday and the people were talking about that (saying that the eclipse was caused by his death).</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 109490,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 10060,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 171,
        "hadithText": "<p>\nNarrated Aisha:\n\n<p>The Prophet (ﷺ) led us and performed four bowing in two rak`at during the solar eclipse and the first rak`a \nwas longer.</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 109500,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 10070,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 18,
        "bookName": "Eclipses",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 172,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>The Prophet (p.b.u.h) recited (the Qur'an) aloud during the eclipse prayer and when he had finished \nthe eclipse prayer he said the Takbir and bowed. When he stood straight from bowing he would say \n\"Sami 'allahu liman hamidah Rabbana wa laka l-hamd.\" And he would again start reciting. In the \neclipse prayer there are four bowing and four prostrations in two rak`at. Al-Auza'i and others said that \nthey had heard Az-Zuhri from 'Urwa from `Aisha saying, \"In the lifetime of Allah's Messenger (ﷺ) the sun \neclipsed, and he made a person to announce: 'Prayer in congregation.' He led the prayer and performed \nfour bowing and four prostrations in two rak`at.\" Narrated Al-Walid that `Abdur-Rahman bin Namir \nhad informed him that he had heard the same. Ibn Shihab heard the same. Az-Zuhri said, \"I asked \n('Urwa), 'What did your brother `Abdullah bin Az-Zubair do? He prayed two rak`at (of the eclipse \nprayer) like the morning prayer, when he offered the (eclipse) prayer in Medina.' 'Urwa replied that he \nhad missed (i.e. did not pray according to) the Prophet's tradition.\" Sulaiman bin Kathir and Sufyan \nbin Husain narrated from Az-Zuhri that the prayer for the eclipse used to be offered with loud \nrecitation.</b>",
        "bookID": "18.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 109511,
        "last_updated": "2012-12-28 14:53:11"
    }
]