[
    {
        "englishURN": 11530,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 22,
        "bookName": "Actions while Praying",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 315,
        "hadithText": "<p>\nNarrated `Abdullah bin Buhaina:\n\n<p>Allah's Messenger (ﷺ) once led us in a prayer and offered two rak`at and got up (for the third rak`a) without \nsitting (after the second rak`a). The people also got up with him, and when he was about to finish his \nprayer, we waited for him to finish the prayer with Taslim but he said Takbir before Taslim and \nperformed two prostrations while sitting and then finished the prayer with Taslim.</b>",
        "bookID": "22.2",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 111120,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 11540,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 22,
        "bookName": "Actions while Praying",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 316,
        "hadithText": "<p>\nNarrated `Abdullah bin Buhaina:\n\n<p>Allah's Messenger (ﷺ) got up after the second rak`a of the Zuhr prayer without sitting in between (the second \nand the third rak`at). When he finished the prayer he performed two prostrations (of Sahu) and then \nfinished the prayer with Taslim.</b>",
        "bookID": "22.2",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 111130,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 11550,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 22,
        "bookName": "Actions while Praying",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 317,
        "hadithText": "<p>\nNarrated' `Abdullah:\n\n<p>Once Allah's Messenger (ﷺ) offered five rak`at in the Zuhr prayer, and somebody asked him whether there \nwas some increase in the prayer. Allah's Messenger (ﷺ) said, \"What is that?\" He said, \"You have offered five \nrak`at.\" So Allah's Messenger (ﷺ) performed two prostrations of Sahu after Taslim.</b>",
        "bookID": "22.2",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 111140,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 11560,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 22,
        "bookName": "Actions while Praying",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 318,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) led us in the `Asr or the Zuhr prayer and finished it with Taslim. Dhul-Yadain said to \nhim, \"O Allah's Messenger (ﷺ)! Has the prayer been reduced?\" The Prophet (ﷺ) asked his companions in the \naffirmative. So Allah's Messenger (ﷺ) I offered two more rak`at and then performed two prostrations (of \nSahu). Sa`d said, \"I saw that 'Urwa bin Az-Zubair had offered two rak`at in the Maghrib prayer and \nfinished it with Taslim. He then talked (and when he was informed about it) he completed the rest of \nhis prayer and performed two prostrations, and said, 'The Prophet (ﷺ) prayed like this.' \"</b>",
        "bookID": "22.2",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 111150,
        "last_updated": "2012-12-28 14:55:05"
    },
    {
        "englishURN": 11570,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 22,
        "bookName": "Actions while Praying",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 319,
        "hadithText": "<p>\nNarrated Abu Huraira.:\n\n<p>Once Allah's Messenger (ﷺ) offered two rak`at and finished his prayer. So Dhul-Yadain asked him, \"Has the \nprayer been reduced or have you forgotten?\" Allah's Messenger (ﷺ) said, \"Has Dhul-Yadain spoken the \ntruth?\" The people replied in the affirmative. Then Allah's Messenger (ﷺ) stood up and offered the remaining \ntwo rak`at and performed Taslim, and then said Takbir and performed two prostrations like his usual \nprostrations, or a bit longer, and then got up.</b>",
        "bookID": "22.2",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 111160,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 11580,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 22,
        "bookName": "Actions while Praying",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 320,
        "hadithText": "<p>\nNarrated Salama bin 'Alqama:\n\n<p>I asked Muhammad (bin Seereen) whether Tashah-hud should be recited after the two prostrations of \nSahu. He replied, \"It is not (mentioned) in Abu Huraira's narration . \"</b>",
        "bookID": "22.2",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 111170,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 11590,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 22,
        "bookName": "Actions while Praying",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 321,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) offered one of the evening prayers (the sub-narrator Muhammad said, \"I think that it was \nmost probably the `Asr prayer\") and he finished it after offering two rak`at only. He then stood near a \nprice of wood in front of the Mosque and put his hand over it. Abu Bakr and `Umar were amongst \nthose who were present, but they dared not talk to him about that (because of excessive respect for \nhim), and those who were in a hurry went out. They said, \"Has the prayer been reduced?\" A man who \nwas called Dhul-Yadain by the Prophet (ﷺ) said (to the Prophet), \"Has the prayer been reduced or have \nyou forgotten?\" He said, \"Neither have I forgotten, nor has the prayer been reduced.\" He said, \n\"Certainly you have forgotten.\" So the Prophet (ﷺ) offered two more rak`at and performed Taslim and \nthen said Takbir and performed a prostration of Sahu like his ordinary prostration or a bit longer and \nthen raised his head and said Takbir and then put his head down and performed a prostration like his \nordinary prostration or a bit longer, and then raised his head and said Takbir.</b>",
        "bookID": "22.2",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 111180,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 11600,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 22,
        "bookName": "Actions while Praying",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 322,
        "hadithText": "<p>\nNarrated `Abdullah bin Buhaina Al-Asdi:\n\n<p>(the ally of Bani `Abdul Muttalib) Allah's Messenger (ﷺ) stood up for the Zuhr prayer and he should have sat \n(after the second rak`a but he stood up for the third rak`a without sitting for Tashah-hud) and when he \nfinished the prayer he performed two prostrations and said Takbir on each prostration while sitting, \nbefore ending (the prayer) with Taslim; and the people too performed the two prostrations with him \ninstead of the sitting he forgot.</b>",
        "bookID": "22.2",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 111190,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 11610,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 22,
        "bookName": "Actions while Praying",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 323,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"When the call for prayer is made, Satan takes to his heels passing wind so that \nhe may not hear the Adhan and when the call is finished he comes back, and when the Iqama is \npronounced, Satan again takes to his heels, and when the Iqama is finished he comes back again and \ntries to interfere with the person and his thoughts and say, \"Remember this and that (which he has not \nthought of before the prayer)\", till the praying person forgets how much he has prayed. If anyone of \nyou does not remember whether he has offered three or four rak`at then he should perform two \nprostrations of Sahu while sitting.</b>",
        "bookID": "22.2",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 111200,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 11620,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 22,
        "bookName": "Actions while Praying",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 324,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"When anyone of you stands for the prayers, Satan comes and puts him in doubts \ntill he forgets how many rak`at he has prayed. So if this happens to anyone of you, he should perform \ntwo prostrations of Sahu while sitting.</b>",
        "bookID": "22.2",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 111210,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 11630,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 22,
        "bookName": "Actions while Praying",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 325,
        "hadithText": "<p>\nNarrated Kuraib:\n\n<p>I was sent to Aisha by Ibn `Abbas, Al-Miswar bin Makhrama and `Abdur-Rahman bin Azhar . They \ntold me to greet her on their behalf and to ask her about the offering of the two rak`at after the `Asr \nprayer and to say to her, \"We were informed that you offer those two rak`at and we were told that the \nProphet had forbidden offering them.\" Ibn `Abbas said, \"I along with `Umar bin Al-Khattab used to \nbeat the people whenever they offered them.\" I went to Aisha and told her that message. `Aisha said, \n\"Go and ask Um Salama about them.\" So I returned and informed them about her statement. They \nthen told me to go to Um Salama with the same question with which t sent me to `Aisha. Um Salama \nreplied, \"I heard the Prophet (ﷺ) forbidding them. Later I saw him offering them immediately after he \nprayed the `Asr prayer. He then entered my house at a time when some of the Ansari women from the \ntribe of Bani Haram were sitting with me, so I sent my slave girl to him having said to her, 'Stand \nbeside him and tell him that Um Salama says to you, \"O Allah's Messenger (ﷺ)! I have heard you forbidding \nthe offering of these (two rak`at after the `Asr prayer) but I have seen you offering them.\" If he waves \nhis hand then wait for him.' The slave girl did that. The Prophet (ﷺ) beckoned her with his hand and she \nwaited for him. When he had finished the prayer he said, \"O daughter of Bani Umaiya! You have \nasked me about the two rak`at after the `Asr prayer. The people of the tribe of `Abdul-Qais came to \nme and made me busy and I could not offer the two rak`at after the Zuhr prayer. These (two rak`at that \nI have just prayed) are for those (missed) ones.</b>",
        "bookID": "22.2",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 111220,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 11640,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 22,
        "bookName": "Actions while Praying",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 326,
        "hadithText": "<p>\nNarrated Sahl bin Sa`d As-Sa`idi:\n\n<p>The news about the differences amongst the people of Bani `Amr bin `Auf reached Allah's Messenger (ﷺ) \nand so he went to them along with some of his companions to effect a reconciliation between them. \nAllah's Messenger (ﷺ) was delayed there, and the time of the prayer was due. Bilal went to Abu Bakr and \nsaid to him, \"Allah's Messenger (ﷺ) has been delayed (there) and the time of prayer is due. So will you lead \nthe people in prayer?\" Abu Bakr said, \"Yes, if you wish.\" Bilal pronounced the Iqama and Abu Bakr, \nwent forward and said Takbir for the people. In the meantime Allah's Messenger (ﷺ) came crossing the rows \n(of the praying people) and stood in the (first) row and the people started clapping. Abu Bakr, would \nnever glance sideways in his prayer but when the people clapped much he looked back and (ﷺ) \nAllah's Messenger (ﷺ) . Allah's Messenger (ﷺ) beckoned him to carry on the prayer. Abu Bakr raised his hands and \nthanked Allah, and retreated till he reached the (first) row. Allah's Messenger (ﷺ) went forward and led the \npeople in the prayer. When he completed the prayer he faced the people and said, \"O people! Why did \nyou start clapping when something unusual happened to you in the prayer? Clapping is only for \nwomen. So whoever amongst you comes across something in the prayer should say, 'Subhan-Allah' \nfor there is none who will not turn round on hearing him saying Subhan-Allah. O Abu Bakr! What \nprevented you from leading the people in the prayer when I beckoned you to do so?\" Abu Bakr \nreplied, \"How dare the son of Abu Quhafa lead the prayer in the presence of Allah's Messenger (ﷺ) ?\"</b>",
        "bookID": "22.2",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 111230,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 11650,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 22,
        "bookName": "Actions while Praying",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 327,
        "hadithText": "<p>\nNarrated Asma':\n\n<p>I went to `Aisha and she was standing praying and the people, too, were standing (praying). So I said, \n\"What is the matter with the people?\" She beckoned with her head towards the sky. \nI said, \"(Is there) a sign?\" She nodded intending to say, \"Yes.\"</b>",
        "bookID": "22.2",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 111240,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 11660,
        "collection": "bukhari",
        "volumeNumber": 2,
        "bookNumber": 22,
        "bookName": "Actions while Praying",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 328,
        "hadithText": "<p>\nNarrated `Aisha the wife of the Prophet:\n\n<p>Allah's Messenger (ﷺ) during his illness prayed in his house sitting, whereas some people followed him \nstanding, but the Prophet (ﷺ) beckoned them to sit down. On completion of the prayer he said, \"The Imam \nis to be followed. So, bow when he bows, and raise your head when he raises his head.\" (See Hadith \nNo. 657 Vol 1 for taking the verdict).</b>",
        "bookID": "22.2",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 111250,
        "last_updated": "2012-04-26 07:00:00"
    }
]