[
    {
        "englishURN": 21230,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 461,
        "hadithText": "<p>\nNarrated Abu Musa Al-Ash`ari:\n\n<p>The Prophet (ﷺ) said, \"The honest treasurer who gives willingly what he is ordered to give, is one of the \ntwo charitable persons, (the second being the owner).</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 121800,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21240,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 462,
        "hadithText": "<p>\nNarrated Abu Musa:\n\n<p>I went to the Prophet (ﷺ) with two men from Ash`ari tribe. I said (to the Prophet), \"I do not know that they \nwant employment.\" The Prophet (ﷺ) said, \"No, we do not appoint for our jobs anybody who demands it \nearnestly.\"</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 121810,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21250,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 463,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"Allah did not send any prophet but shepherded sheep.\" His companions asked him, \n\"Did you do the same?\" The Prophet (ﷺ) replied, \"Yes, I used to shepherd the sheep of the people of \nMecca for some Qirats.\"</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 121820,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21260,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 464,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>The Prophet (ﷺ) and Abu Bakr employed a (pagan) man from the tribe of Bani Ad-Dail and the tribe of \nBani 'Abu bin `Adi as a guide. He was an expert guide and he broke the oath contract which he had to \nabide by with the tribe of Al-`Asi bin Wail and he was on the religion of Quraish pagans. The Prophet (ﷺ) \nand Abu Bakr had confidence in him and gave him their riding camels and told him to bring them to \nthe Cave of Thaur after three days. So, he brought them their two riding camels after three days and \nboth of them (The Prophet (ﷺ) and Abu Bakr) set out accompanied by 'Amir bin Fuhaira and the Dili \nguide who guided them below Mecca along the road leading to the sea-shore.</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 121830,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21270,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 465,
        "hadithText": "<p>\nNarrated Aisha:\n\n<p>(the wife of the Prophet) Allah's Messenger (ﷺ) and Abu Bakr hired a man from the tribe of Bani-Ad-Dil as \nan expert guide who was a pagan (follower of the religion of the pagans of Quraish). The Prophet (ﷺ) and \nAbu Bakr gave him their two riding camels and took a promise from him to bring their riding camels \nin the morning of the third day to the Cave of Thaur.</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 121840,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21280,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 466,
        "hadithText": "<p>\nNarrated Ya`la bin Umaiya:\n\n<p>I fought in Jaish-al-Usra (Ghazwa of Tabuk) along with the Prophet (ﷺ) and in my opinion that was the \nbest of my deeds. Then I had an employee, who quarrel led with someone and one of the them bit and \ncut the other's finger and caused his own tooth to fall out. He then went to the Prophet (with a \ncomplaint) but the Prophet (ﷺ) canceled the suit and said to the complainant, \"Did you expect him to let \nhis finger in your mouth so that you might snap and cut it (as does a stallion camel)?\" \nNarrated Ibn Juraij from `Abdullah bin Abu Mulaika from his grandfather a similar story: A man bit \nthe hand of another man and caused his own tooth to fall out, but Abu Bakr judged that he had no \nright for compensation (for the broken tooth).</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 121851,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21290,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 467,
        "hadithText": "<p>\nNarrated Ubai bin Ka`b:\n\n<p>Allah's Messenger (ﷺ) said, \"Both of them (Moses and Al-Khadir) proceeded on till they reached a wall \nwhich was about to fall.\" Sa`d said [?? or Sa`id], \"(Al-Khadir pointed) with his hands (towards the \nwall) and then raised his hands and the wall became straightened up.\" Ya`la said, \"I think Sa`id [?? or \nSa`d] said, 'He (Khadir) passed his hand over it and it was straightened up.\" (Moses said to him), \"if \nyou had wanted, you could have taken wages for it.\" Sa`id [?? or Sa`d] said, \"Wages with which to \nbuy food . \"</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 121870,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21300,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 468,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>The Prophet (ﷺ) said, \"Your example and the example of the people of the two Scriptures (i.e. Jews and \nChristians) is like the example of a man who employed some laborers and asked them, 'Who will \nwork for me from morning till midday for one Qirat?' The Jews accepted and carried out the work. He \nthen asked, Who will work for me from midday up to the `Asr prayer for one Qirat?' The Christians \naccepted and fulfilled the work. He then said, 'Who will work for me from the `Asr till sunset for two \nQirats?' You, Muslims have accepted the offer. The Jews and the Christians got angry and said, 'Why \nshould we work more and get lesser wages?' (Allah) said, 'Have I withheld part of your right?' They \nreplied in the negative. He said, 'It is My Blessing, I bestow upon whomever I wish .'</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 121880,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21310,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 469,
        "hadithText": "<p>\nNarrated `Abdullah bin `Umar bin Al-Khattab:\n\n<p>Allah's Messenger (ﷺ) said, \"Your example and the example of Jews and Christians is like the example of a \nman who employed some laborers to whom he said, 'Who will work for me up to midday for one \nQirat each?' The Jews carried out the work for one Qirat each; and then the Christians carried out the \nwork up to the `Asr prayer for one Qirat each; and now you Muslims are working from the `Asr \nprayer up to sunset for two Qirats each. The Jews and Christians got angry and said, 'We work more \nand are paid less.' The employer (Allah) asked them, 'Have I usurped some of your right?' They \nreplied in the negative. He said, 'That is My Blessing, I bestow upon whomever I wish.' \"</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 121890,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21320,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 470,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"Allah said, 'I will be an opponent to three types of people on the Day of \nResurrection: \n-1. One who makes a covenant in My Name, but proves treacherous; \n-2. One who sells a free person and eats his price; and \n-3. One who employs a laborer and takes full work from him but does not pay him for his lab our.' \"</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 121900,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21330,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 471,
        "hadithText": "<p>\nNarrated Abu Musa:\n\n<p>The Prophet (ﷺ) said, \"The example of Muslims, Jews and Christians is like the example of a man who \nemployed laborers to work for him from morning till night for specific wages. They worked till \nmidday and then said, 'We do not need your money which you have fixed for us and let whatever we \nhave done be annulled.' The man said to them, 'Don't quit the work, but complete the rest of it and \ntake your full wages.' But they refused and went away. The man employed another batch after them \nand said to them, 'Complete the rest of the day and yours will be the wages I had fixed for the first \nbatch.' So, they worked till the time of `Asr prayer. Then they said, \"Let what we have done be \nannulled and keep the wages you have promised us for yourself.' The man said to them, 'Complete the \nrest of the work, as only a little of the day remains,' but they refused. Thereafter he employed another \nbatch to work for the rest of the day and they worked for the rest of the day till the sunset, and they \nreceived the wages of the two former batches. So, that was the example of those people (Muslims) and \nthe example of this light (guidance) which they have accepted willingly.</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 121910,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21340,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 472,
        "hadithText": "<p>\nNarrated `Abdullah bin `Umar:\n\n<p>I heard Allah's Messenger (ﷺ) saying, \"Three men from among those who were before you, set out together \ntill they reached a cave at night and entered it. A big rock rolled down the mountain and closed the \nmouth of the cave. They said (to each other), Nothing could save you from this rock but to invoke \nAllah by giving reference to the righteous deed which you have done (for Allah's sake only).' So, one \nof them said, 'O Allah! I had old parents and I never provided my family (wife, children etc.) with \nmilk before them. One day, by chance I was delayed, and I came late (at night) while they had slept. I \nmilked the sheep for them and took the milk to them, but I found them sleeping. I disliked to provide \nmy family with the milk before them. I waited for them and the bowl of milk was in my hand and I \nkept on waiting for them to get up till the day dawned. Then they got up and drank the milk. O Allah! \nIf I did that for Your Sake only, please relieve us from our critical situation caused by this rock.' So, \nthe rock shifted a little but they could not get out.\" \nThe Prophet (ﷺ) added, \"The second man said, 'O Allah! I had a cousin who was the dearest of all people \nto me and I wanted to have sexual relations with her but she refused. Later she had a hard time in a \nfamine year and she came to me and I gave her one-hundred-and-twenty Dinars on the condition that \nshe would not resist my desire, and she agreed. When I was about to fulfill my desire, she said: It is \nillegal for you to outrage my chastity except by legitimate marriage. So, I thought it a sin to have \nsexual intercourse with her and left her though she was the dearest of all the people to me, and also I \nleft the gold I had given her. O Allah! If I did that for Your Sake only, please relieve us from the \npresent calamity.' So, the rock shifted a little more but still they could not get out from there.\" \nThe Prophet (ﷺ) added, \"Then the third man said, 'O Allah! I employed few laborers and I paid them their \nwages with the exception of one man who did not take his wages and went away. I invested his wages \nand I got much property thereby. (Then after some time) he came and said to me: O Allah's slave! Pay \nme my wages. I said to him: All the camels, cows, sheep and slaves you see, are yours. He said: O \nAllah's slave! Don't mock at me. I said: I am not mocking at you. So, he took all the herd and drove \nthem away and left nothing. O Allah! If I did that for Your Sake only, please relieve us from the \npresent suffering.' So, that rock shifted completely and they got out walking.</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 121920,
        "last_updated": "2015-02-10 12:30:51"
    },
    {
        "englishURN": 21350,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 473,
        "hadithText": "<p>\nNarrated Abu May' id Al-Ansari:\n\n<p>Whenever Allah's Messenger (ﷺ) ordered us to give in charity we would go to the market and work as \nporters to earn a Mudd (two handfuls) (of foodstuff) but now some of us have one-hundred thousand \nDirhams or Diners. (The sub-narrator) Shaqiq said, \"I think Abu Mas`ud meant himself by saying \n(some of us) .</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 121930,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21360,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 474,
        "hadithText": "<p>\nNarrated Tawus:\n\n<p>Ibn `Abbas said, \"The Prophet (ﷺ) forbade the meeting of caravans (on the way) and ordained that no \ntownsman is permitted to sell things on behalf of a bedouin.\" I asked Ibn `Abbas, \"What is the \nmeaning of his saying, 'No townsman is permitted to sell things on behalf of a bedouin.' \" He replied, \n\"He should not work as a broker for him.\"</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 121940,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21370,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 475,
        "hadithText": "<p>\nNarrated Khabbab:\n\n<p>I was a blacksmith and did some work for Al-`As bin Wail. When he owed me some money for my \nwork, I went to him to ask for that amount. He said, \"I will not pay you unless you disbelieve in \nMuhammad.\" I said, \"By Allah! I will never do that till you die and be resurrected.\" He said, \"Will I \nbe dead and then resurrected after my death?\" I said, \"Yes.\" He said, \"There I will have property and \noffspring and then I will pay you your due.\" Then Allah revealed. 'Have you seen him who \ndisbelieved in Our signs, and yet says: I will be given property and offspring?' (19.77)</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 121950,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21380,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 476,
        "hadithText": "<p>\nNarrated Abu Sa`id:\n\n<p>Some of the companions of the Prophet (ﷺ) went on a journey till they reached some of the 'Arab tribes (at \nnight). They asked the latter to treat them as their guests but they refused. The chief of that tribe was \nthen bitten by a snake (or stung by a scorpion) and they tried their best to cure him but in vain. Some \nof them said (to the others), \"Nothing has benefited him, will you go to the people who resided here at \nnight, it may be that some of them might possess something (as treatment),\" They went to the group of \nthe companions (of the Prophet (ﷺ) ) and said, \"Our chief has been bitten by a snake (or stung by a \nscorpion) and we have tried everything but he has not benefited. Have you got anything (useful)?\" \nOne of them replied, \"Yes, by Allah! I can recite a Ruqya, but as you have refused to accept us as \nyour guests, I will not recite the Ruqya for you unless you fix for us some wages for it.\" They agrees \nto pay them a flock of sheep. One of them then went and recited (Surat-ul-Fatiha): 'All the praises are \nfor the Lord of the Worlds' and puffed over the chief who became all right as if he was released from a \nchain, and got up and started walking, showing no signs of sickness. \nThey paid them what they agreed to pay. Some of them (i.e. the companions) then suggested to divide \ntheir earnings among themselves, but the one who performed the recitation said, \"Do not divide them \ntill we go to the Prophet (ﷺ) and narrate the whole story to him, and wait for his order.\" So, they went to \nAllah's Messenger (ﷺ) and narrated the story. Allah's Messenger (ﷺ) asked, \"How did you come to know that Suratul- \nFatiha was recited as Ruqya?\" Then he added, \"You have done the right thing. Divide (what you \nhave earned) and assign a share for me as well.\" The Prophet (ﷺ) smiled thereupon.</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 121960,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21390,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 477,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>When Abu Taiba cupped the Prophet (ﷺ) and the Prophet (ﷺ) ordered that he be paid one or two Sas of \nfoodstuff and he interceded with his masters to reduce his taxes.</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 121970,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21400,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 478,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>When the Prophet (ﷺ) was cupped, he paid the man who cupped him his wages.</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 121980,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21410,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 479,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>When the Prophet (ﷺ) was cupped, he paid the man who cupped him his wages. If it had been undesirable \nhe would not have paid him.</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 121990,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21420,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 480,
        "hadithText": "<p>\nNarrated Anas:\n\n<p>The Prophet (ﷺ) used to get cupped and would never withhold the wages of any person .</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 122000,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21430,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 481,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>The Prophet (ﷺ) sent for a slave who had the profession of cupping, and he cupped him. The Prophet (ﷺ) \nordered that he be paid one or two Sas, or one or two Mudds of foodstuff, and appealed to his masters \nto reduce his taxes:</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 122010,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21440,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 482,
        "hadithText": "<p>\nNarrated Abu Mas`ud Al-Ansari:\n\n<p>Allah's Messenger (ﷺ) regarded illegal the price of a dog, the earnings of a prostitute, and the charges taken \nby a soothsayer.</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 122020,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21450,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 483,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) prohibited the earnings of slave girls (through prostitution).</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 122030,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21460,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 484,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>The Prophet (ﷺ) forbade taking a price for animal copulation.</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 122040,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21470,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Hiring",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 485,
        "hadithText": "<p>\nNarrated `Abdullah bin `Umar:\n\n<p>\"Allah's Messenger (ﷺ) gave the land of Khaibar to the Jews to work on and cultivate and take half of its \nyield. Ibn `Umar added, \"The land used to be rented for a certain portion (of its yield).\" Nafi` \nmentioned the amount of the portion but I forgot it. Rafi` bin Khadij said, \"The Prophet (ﷺ) forbade \nrenting farms.\" Narrated 'Ubaidullah Nafi` said: Ibn `Umar said: (The contract of Khaibar continued) \ntill `Umar evacuated the Jews (from Khaibar).</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 122051,
        "last_updated": "2012-04-26 07:00:00"
    }
]