[
    {
        "englishURN": 21590,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 38,
        "bookName": "Representation, Authorization, Business by Proxy",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 496,
        "hadithText": "<p>\nNarrated `Ali:\n\n<p>Allah's Messenger (ﷺ) ordered me to distribute the saddles and skins of the Budn which I had slaughtered.</b>",
        "bookID": "38.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 122190,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21600,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 38,
        "bookName": "Representation, Authorization, Business by Proxy",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 497,
        "hadithText": "<p>\nNarrated `Uqba bin Amir:\n\n<p>that the Prophet (ﷺ) had given him sheep to distribute among his companions and a male kid was left \n(after the distribution). When he informed the Prophet (ﷺ) of it, he said (to him), \"Offer it as a sacrifice on \nyour behalf.\"</b>",
        "bookID": "38.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 122200,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21610,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 38,
        "bookName": "Representation, Authorization, Business by Proxy",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 498,
        "hadithText": "<p>\nNarrated `Abdur-Rahman bin `Auf:\n\n<p>I got an agreement written between me and Umaiya bin Khalaf that Umaiya would look after my \nproperty (or family) in Mecca and I would look after his in Medina. When I mentioned the word 'Ar64 \nRahman' in the documents, Umaiya said, \"I do not know 'Ar-Rahman.' Write down to me your name, \n(with which you called yourself) in the Pre-Islamic Period of Ignorance.\" So, I wrote my name ' \n`Abdu `Amr'. On the day (of the battle) of Badr, when all the people went to sleep, I went up the hill \nto protect him. Bilal(1) saw him (i.e. Umaiya) and went to a gathering of Ansar and said, \"(Here is) \nUmaiya bin Khalaf! Woe to me if he escapes!\" So, a group of Ansar went out with Bilal to follow us \n(`Abdur-Rahman and Umaiya). Being afraid that they would catch us, I left Umaiya's son for them to \nkeep them busy but the Ansar killed the son and insisted on following us. Umaiya was a fat man, and \nwhen they approached us, I told him to kneel down, and he knelt, and I laid myself on him to protect \nhim, but the Ansar killed him by passing their swords underneath me, and one of them injured my foot \nwith his sword. (The sub narrator said, \" `Abdur-Rahman used to show us the trace of the wound on \nthe back of his foot.\")</b>",
        "bookID": "38.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 122210,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21620,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 38,
        "bookName": "Representation, Authorization, Business by Proxy",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 499,
        "hadithText": "<p>\nNarrated Abu Sa`id Al-Khudri and Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) employed someone as a governor at Khaibar. When the man came to Medina, he \nbrought with him dates called Janib. The Prophet (ﷺ) asked him, \"Are all the dates of Khaibar of this \nkind?\" The man replied, \"(No), we exchange two Sa's of bad dates for one Sa of this kind of dates (i.e. \nJanib), or exchange three Sa's for two.\" On that, the Prophet (ﷺ) said, \"Don't do so, as it is a kind of usury \n(Riba) but sell the dates of inferior quality for money, and then buy Janib with the money\". The \nProphet said the same thing about dates sold by weight. (See Hadith No. 506).</b>",
        "bookID": "38.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 122220,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21630,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 38,
        "bookName": "Representation, Authorization, Business by Proxy",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 500,
        "hadithText": "<p>\nNarrated Ibn Ka`b bin Malik from his father:\n\n<p>We had some sheep which used to graze at Sala'. One of our slavegirls saw a sheep dying and she \nbroke a stone and slaughtered the sheep with it. My father said to the people, \"Don't eat it till I ask the \nProphet about it (or till I send somebody to ask the Prophet).\" So, he asked or sent somebody to ask \nthe Prophet, and the Prophet (ﷺ) permitted him to eat it. 'Ubaidullah (a sub-narrator) said, \"I admire that \ngirl, for though she was a slave-girl, she dared to slaughter the sheep . \"</b>",
        "bookID": "38.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 122230,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21640,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 38,
        "bookName": "Representation, Authorization, Business by Proxy",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 501,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) owed somebody a camel of a certain age. When he came to demand it back, the Prophet (ﷺ) \nsaid (to some people), \"Give him (his due).\" When the people searched for a camel of that age, they \nfound none, but found a camel one year older. The Prophet (ﷺ) said, \"Give (it to) him.\" On that, the man \nremarked, \"You have given me my right in full. May Allah give you in full.\" The Prophet (ﷺ) said, \"The \nbest amongst you is the one who pays the rights of others generously.\"</b>",
        "bookID": "38.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 122240,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21650,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 38,
        "bookName": "Representation, Authorization, Business by Proxy",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 502,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>A man came to the Prophet (ﷺ) demanding his debts and behaved rudely. The companions of the Prophet (ﷺ) \nintended to harm him, but Allah's Messenger (ﷺ) said (to them), \"Leave him, for the creditor (i.e. owner of a \nright) has the right to speak.\" Allah's Messenger (ﷺ) then said, \"Give him a camel of the same age as that of \nhis.\" The people said, \"O Allah's Messenger (ﷺ)! There is only a camel that is older than his.\" Allah's Messenger (ﷺ) \nsaid, \"Give (it to) him, for the best amongst you is he who pays the rights of others handsomely.\"</b>",
        "bookID": "38.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 122250,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21660,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 38,
        "bookName": "Representation, Authorization, Business by Proxy",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 503,
        "hadithText": "<p>\nNarrated Marwan bin Al-Hakam and Al-Miswar bin Makhrama:\n\n<p>When the delegates of the tribe of Hawazin after embracing Islam, came to Allah's Messenger (ﷺ), he got up. \nThey appealed to him to return their properties and their captives. Allah's Messenger (ﷺ) said to them, \"The \nmost beloved statement to me is the true one. So, you have the option of restoring your properties or \nyour captives, for I have delayed distributing them.\" The narrator added, Allah's Messenger (ﷺ) c had been \nwaiting for them for more than ten days on his return from Taif. When they realized that Allah's \nApostle would return to them only one of two things, they said, \"We choose our captives.\" So, Allah's \nApostle got up in the gathering of the Muslims, praised Allah as He deserved, and said, \"Then after! \nThese brethren of yours have come to you with repentance and I see it proper to return their captives \nto them. So, whoever amongst you likes to do that as a favor, then he can do it, and whoever of you \nwants to stick to his share till we pay him from the very first booty which Allah will give us then he \ncan do so.\" The people replied, \"We agree to give up our shares willingly as a favor for Allah's \nApostle.\" Then Allah's Messenger (ﷺ) said, \"We don't know who amongst you has agreed and who hasn't. Go \nback and your chiefs may tell us your opinion.\" So, all of them returned and their chiefs discussed the \nmatter with them and then they (i.e. their chiefs) came to Allah's Messenger (ﷺ) to tell him that they (i.e. the \npeople) had given up their shares gladly and willingly.</b>",
        "bookID": "38.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 122260,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21670,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 38,
        "bookName": "Representation, Authorization, Business by Proxy",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 504,
        "hadithText": "<p>\nNarrated Jabir bin `Abdullah:\n\n<p>I was accompanying the Prophet (ﷺ) on a journey and was riding a slow camel that was lagging behind \nthe others. The Prophet (ﷺ) passed by me and asked, \"Who is this?\" I replied, \"Jabir bin `Abdullah.\" He \nasked, \"What is the matter, (why are you late)?\" I replied, \"I am riding a slow camel.\" He asked, \"Do \nyou have a stick?\" I replied in the affirmative. He said, \"Give it to me.\" When I gave it to him, he beat \nthe camel and rebuked it. Then that camel surpassed the others thenceforth. The Prophet (ﷺ) said, \"Sell it \nto me.\" I replied, \"It is (a gift) for you, O Allah's Messenger (ﷺ).\" He said, \"Sell it to me. I have bought it for \nfour Dinars (gold pieces) and you can keep on riding it till Medina.\" When we approached Medina, I \nstarted going (towards my house). The Prophet (ﷺ) said, \"Where are you going?\" I Sa`d, \"I have married a \nwidow.\" He said, \"Why have you not married a virgin to fondle with each other?\" I said, \"My father \ndied and left daughters, so I decided to marry a widow (an experienced woman) (to look after them).\" \nHe said, \"Well done.\" When we reached Medina, Allah's Messenger (ﷺ) said, \"O Bilal, pay him (the price of \nthe camel) and give him extra money.\" Bilal gave me four Dinars and one Qirat extra. (A sub-narrator \nsaid): Jabir added, \"The extra Qirat of Allah's Messenger (ﷺ) never parted from me.\" The Qirat was always in \nJabir bin `Abdullah's purse.</b>",
        "bookID": "38.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 122270,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21680,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 38,
        "bookName": "Representation, Authorization, Business by Proxy",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 505,
        "hadithText": "<p>\n\n     Narrated Sahl bin Sad:\n<p>\n\n     A woman came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I want \n     to give up myself to you.\" A man said, \"Marry her to me.\" The Prophet (ﷺ) \n     said, \"We agree to marry her to you with what you know of the Qur'an \n     by heart.\"\n<p></b>",
        "bookID": "38.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 122280,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21690,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 38,
        "bookName": "Representation, Authorization, Business by Proxy",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 505,
        "hadithText": "<p>\n\n     Narrated Abu Huraira:\n<p>\n\n     Allah's Messenger (ﷺ) deputed me to keep Sadaqat (al-Fitr) of Ramadan. A \n     comer came and started taking handfuls of the foodstuff (of the \n     Sadaqa) (stealthily). I took hold of him and said, \"By Allah, I will \n     take you to Allah's Messenger (ﷺ) .\" He said, \"I am needy and have many \n     dependents, and I am in great need.\" I released him, and in the \n     morning Allah's Messenger (ﷺ) asked me, \"What did your prisoner do \n     yesterday?\" I said, \"O Allah's Messenger (ﷺ)! The person complained of being\n     needy and of having many dependents, so, I pitied him and let him go.\"\n     Allah's Messenger (ﷺ) said, \"Indeed, he told you a lie and he will be coming\n     again.\" I believed that he would show up again as Allah's Messenger (ﷺ) had \n     told me that he would return. So, I waited for him watchfully. When he\n     (showed up and) started stealing handfuls of foodstuff, I caught hold \n     of him again and said, \"I will definitely take you to Allah's Messenger (ﷺ).\n     He said, \"Leave me, for I am very needy and have many dependents. I \n     promise I will not come back again.\" I pitied him and let him go. \n<p>\n\n     In the morning Allah's Messenger (ﷺ) asked me, \"What did your prisoner do.\" \n     I replied, \"O Allah's Messenger (ﷺ)! He complained of his great need and of \n     too many dependents, so I took pity on him and set him free.\" Allah's \n     Apostle said, \"Verily, he told you a lie and he will return.\" I waited\n     for him attentively for the third time, and when he (came and) started\n     stealing handfuls of the foodstuff, I caught hold of him and said, \"I \n     will surely take you to Allah's Messenger (ﷺ) as it is the third time you \n     promise not to return, yet you break your promise and come.\" He said, \n     \"(Forgive me and) I will teach you some words with which Allah will \n     benefit you.\" I asked, \"What are they?\" He replied, \"Whenever you go \n     to bed, recite \"Ayat-al-Kursi\"-- 'Allahu la ilaha illa huwa-l-Haiy-ul \n     Qaiyum' till you finish the whole verse. (If you do so), Allah will \n     appoint a guard for you who will stay with you and no satan will come \n     near you till morning. \" So, I released him. In the morning, Allah's \n     Apostle asked, \"What did your prisoner do yesterday?\" I replied, \"He \n     claimed that he would teach me some words by which Allah will benefit \n     me, so I let him go.\" Allah's Messenger (ﷺ) asked, \"What are they?\" I \n     replied, \"He said to me, 'Whenever you go to bed, recite Ayat-al-Kursi\n     from the beginning to the end ---- Allahu la ilaha illa \n     huwa-lHaiy-ul-Qaiyum----.' He further said to me, '(If you do so), \n     Allah will appoint a guard for you who will stay with you, and no \n     satan will come near you till morning.' (Abu Huraira or another \n     sub-narrator) added that they (the companions) were very keen to do \n     good deeds. The Prophet (ﷺ) said, \"He really spoke the truth, although he \n     is an absolute liar. Do you know whom you were talking to, these three\n     nights, O Abu Huraira?\" Abu Huraira said, \"No.\" He said, \"It was \n     Satan.\"\n<p></b>",
        "bookID": "38.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 122290,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21700,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 38,
        "bookName": "Representation, Authorization, Business by Proxy",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 506,
        "hadithText": "<p>\nNarrated Abu Sa`id al-Khudri:\n\n<p>Once Bilal brought Barni (i.e. a kind of dates) to the Prophet (ﷺ) and the Prophet (ﷺ) asked him, \"From where \nhave you brought these?\" Bilal replied, \"I had some inferior type of dates and exchanged two Sas of it \nfor one Sa of Barni dates in order to give it to the Prophet; to eat.\" Thereupon the Prophet (ﷺ) said, \n\"Beware! Beware! This is definitely Riba (usury)! This is definitely Riba (Usury)! Don't do so, but if \nyou want to buy (a superior kind of dates) sell the inferior dates for money and then buy the superior \nkind of dates with that money.\"</b>",
        "bookID": "38.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 122300,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21710,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 38,
        "bookName": "Representation, Authorization, Business by Proxy",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 507,
        "hadithText": "<p>\nNarrated `Amr:\n\n<p>Concerning the Waqf of `Umar: It was not sinful of the trustee (of the Waqf) to eat or provide his \nfriends from it, provided the trustee had no intention of collecting fortune (for himself). Ibn `Umar \nwas the manager of the trust of `Umar and he used to give presents from it to those with whom he \nused to stay at Mecca.</b>",
        "bookID": "38.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 122310,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21720,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 38,
        "bookName": "Representation, Authorization, Business by Proxy",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 508,
        "hadithText": "<p>\nNarrated Zaid bin Khalid and Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"O Unais! Go to the wife of this (man) and if she confesses (that she has committed \nillegal sexual intercourse), then stone her to death.\"</b>",
        "bookID": "38.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 122320,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21730,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 38,
        "bookName": "Representation, Authorization, Business by Proxy",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 509,
        "hadithText": "<p>\nNarrated `Uqba bin Al-Harith:\n\n<p>When An-Nuaman or his son was brought in a state of drunkenness, Allah's Messenger (ﷺ) ordered all those \nwho were present in the house to beat him. I was one of those who beat him. We beat him with shoes \nand palm-leaf stalks.</b>",
        "bookID": "38.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 122330,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21740,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 38,
        "bookName": "Representation, Authorization, Business by Proxy",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 510,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>I twisted the garlands of the Hadis (i.e. animals for sacrifice) of Allah's Messenger (ﷺ) with my own hands. \nThen Allah's Messenger (ﷺ) put them around their necks with his own hands, and sent them with my father \n(to Mecca). Nothing legal was regarded illegal for Allah's Messenger (ﷺ) till the animals were slaughtered.</b>",
        "bookID": "38.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 122340,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21750,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 38,
        "bookName": "Representation, Authorization, Business by Proxy",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 511,
        "hadithText": "<p>\r\nNarrated Anas bin Malik:\r\n\r\n<p>Abu Talha was the richest man in Medina amongst the Ansar and Beeruha' (garden) was the most \r\nbeloved of his property, and it was situated opposite the mosque (of the Prophet.). Allah's Messenger (ﷺ) \r\nused to enter it and drink from its sweet water. When the following Divine Verse were revealed: 'you \r\nwill not attain righteousness till you spend in charity of the things you love' (3.92), Abu Talha got up \r\nin front of Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Allah says in His Book, 'You will not attain \r\nrighteousness unless you spend (in charity) that which you love,' and verily, the most beloved to me of \r\nmy property is Beeruha (garden), so I give it in charity and hope for its reward from Allah. O Allah's \r\nApostle! Spend it wherever you like.\" Allah's Messenger (ﷺ) appreciated that and said, \"That is perishable \r\nwealth, that is perishable wealth. I have heard what you have said; I suggest you to distribute it among \r\nyour relatives.\" Abu Talha said, \"I will do so, O Allah's Messenger (ﷺ).\" So, Abu Talha distributed it among \r\nhis relatives and cousins. The sub-narrator (Malik) said: The Prophet (ﷺ) said: \"That is a profitable \r\nwealth,\" instead of \"perishable wealth\".</b>",
        "bookID": "38.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 122350,
        "last_updated": "2014-12-11 23:53:34"
    },
    {
        "englishURN": 21760,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 38,
        "bookName": "Representation, Authorization, Business by Proxy",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 512,
        "hadithText": "<p>\nNarrated Abu Musa:\n\n<p>The Prophet (ﷺ) said, \"An honest treasurer who gives what he is ordered to give fully, perfectly and \nwillingly to the person to whom he is ordered to give, is regarded as one of the two charitable \npersons.\"</b>",
        "bookID": "38.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 122360,
        "last_updated": "2012-04-26 07:00:00"
    }
]