[
    {
        "englishURN": 21770,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 513,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>Allah's Messenger (ﷺ) said, \"There is none amongst the Muslims who plants a tree or sows seeds, and then a \nbird, or a person or an animal eats from it, but is regarded as a charitable gift for him.\"</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 122371,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21780,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 514,
        "hadithText": "<p>\nNarrated Abu Umama al-Bahili:\n\n<p>I saw some agricultural equipment and said: \"I heard the Prophet (ﷺ) saying: \"There is no house in which \nthese equipment enters except that Allah will cause humiliation to enter it.\"</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 122390,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21790,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 515,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"Whoever keeps a dog, one Qirat of the reward of his good deeds is deducted \ndaily, unless the dog is used for guarding a farm or cattle.\" Abu Huraira (in another narration) said \nfrom the Prophet, \"unless it is used for guarding sheep or farms, or for hunting.\" Narrated Abu Hazim \nfrom Abu Huraira: The Prophet (ﷺ) said, \"A dog for guarding cattle or for hunting.\"</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 122400,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21800,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 516,
        "hadithText": "<p>\nNarrated As-Sa'ib bin Yazid:\n\n<p>Abu Sufyan bin Abu Zuhair, a man from Azd Shanu'a and one of the companions of the Prophet (ﷺ) said, \n\"I heard Allah's Messenger (ﷺ) saying, 'If one keeps a dog which is meant for guarding neither a farm nor \ncattle, one Qirat of the reward of his good deeds is deducted daily.\" I said, \"Did you hear this from \nAllah's Messenger (ﷺ)?\" He said, \"Yes, by the Lord of this Mosque.\"</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 122410,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21810,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 517,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"While a man was riding a cow, it turned towards him and said, 'I have not been \ncreated for this purpose (i.e. carrying), I have been created for ploughing.\" The Prophet (ﷺ) added, \"I, Abu \nBakr and `Umar believe in the story.\" The Prophet (ﷺ) went on, \"A wolf caught a sheep, and when the \nshepherd chased it, the wolf said, 'Who will be its guard on the day of wild beasts, when there will be \nno shepherd for it except me?' \"After narrating it, the Prophet (ﷺ) said, \"I, Abu Bakr and `Umar too \nbelieve it.\" Abu Salama (a sub-narrator) said, \"Abu Bakr and `Umar were not present then.\"</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "(It has \r\nbeen written that a wolf also spoke to one of the companions of the Prophet near Medina as narrated \r\nin Fath-ul-Bari: \r\nNarrated Unais bin `Amr: Ahban bin Aus said, \"I was amongst my sheep. Suddenly a wolf caught a \r\nsheep and I shouted at it. The wolf sat on its tail and addressed me, saying, 'Who will look after it (i.e. \r\nthe sheep) when you will be busy and not able to look after it? Do you forbid me the provision which \r\nAllah has provided me?' \" Ahban added, \"I clapped my hands and said, 'By Allah, I have never seen \r\nanything more curious and wonderful than this!' On that the wolf said, 'There is something (more \r\ncurious) and wonderful than this; that is, Allah's Apostle in those palm trees, inviting people to Allah \r\n(i.e. Islam).' \"Unais bin `Amr further said, \"Then Ahban went to Allah's Apostle and informed him \r\nwhat happened and embraced Islam.)\" palm trees or other trees and share the fruits with me.\"",
        "ourHadithNumber": 5,
        "matchingArabicURN": 122420,
        "last_updated": "2015-02-12 12:59:24"
    },
    {
        "englishURN": 21820,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 518,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Ansar said to the Prophet (ﷺ) \"Distribute the date palm trees between us and our emigrant brothers.\" \nHe replied, \"No.\" The Ansar said (to the emigrants), \"Look after the trees (water and watch them) and \nshare the fruits with us.\" The emigrants said, \"We listen and obey.\"</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 122430,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21830,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 519,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>The Prophet (ﷺ) got the date palm trees of the tribe of Bani-An-Nadir burnt and the trees cut down at a \nplace called Al-Buwaira . Hassan bin Thabit said in a poetic verse: \"The chiefs of Bani Lu'ai found it \neasy to watch fire spreading at Al-Buwaira.\"</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 122440,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21840,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 520,
        "hadithText": "<p>\nNarrated Rafi` bin Khadij:\n\n<p>We worked on farms more than anybody else in Medina. We used to rent the land at the yield of \nspecific delimited portion of it to be given to the landlord. Sometimes the vegetation of that portion \nwas affected by blights etc., while the rest remained safe and vice versa, so the Prophet (ﷺ) forbade this \npractice. At that time gold or silver were not used (for renting the land). If they provided the seeds, \nthey would get so-and-so much.</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "Al-Hasan said, \"There is no harm if the land belongs to one but both \r\nspend on it and the yield is divided between them.\" Az-Zuhri had the same opinion. Al-Hasan said, \r\n\"There is no harm if cotton is picked on the condition of having half the yield.\" Ibrahim, Ibn Siain, \r\n`Ata', Al-Hakam, Az-Zuhri and Qatada said, \"There is no harm in giving the yarn to the weaver to \r\nweave into cloth on the basis that one-third or one-fourth (or any other portion) of the cloth is given to \r\nthe weaver for his labor.\" Ma'am said, \"There is no harm in hiring animals for a definite (fixed) period \r\non the basis that one-third or one-fourth of the products carried by the animals is given to the owner of \r\nthe animals.\"",
        "ourHadithNumber": 8,
        "matchingArabicURN": 122450,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21850,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 521,
        "hadithText": "<p>\nNarrated `Abdullah bin `Umar:\n\n<p>The Prophet (ﷺ) concluded a contract with the people of Khaibar to utilize the land on the condition that \nhalf the products of fruits or vegetation would be their share. The Prophet (ﷺ) used to give his wives one \nhundred Wasqs each, eighty Wasqs of dates and twenty Wasqs of barley. (When `Umar became the \nCaliph) he gave the wives of the Prophet (ﷺ) the option of either having the land and water as their shares, \nor carrying on the previous practice. Some of them chose the land and some chose the Wasqs, and \n`Aisha chose the land.</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 122460,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21860,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 522,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>The Prophet (ﷺ) made a deal with the people of Khaibar that they would have half the fruits and \nvegetation of the land they cultivated.</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 122470,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21870,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 523,
        "hadithText": "<p>\nNarrated `Amr:\n\n<p>I said to Tawus, \"I wish you would give up Mukhabara (Sharecropping), for the people say that the \nProphet forbade it.\" On that Tawus replied, \"O `Amr! I give the land to sharecroppers and help them. \nNo doubt; the most learned man, namely Ibn `Abbas told me that the Prophet (ﷺ) had not forbidden it but \nsaid, 'It is more beneficial for one to give his land free to one's brother than to charge him a fixed \nrental.\"</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 122480,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21880,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 524,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>Allah's Messenger (ﷺ) gave the land of Khaibar to the Jew's on the condition that they work on it and \ncultivate it, and be given half of its yield.</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 122490,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21890,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 525,
        "hadithText": "<p>\nNarrated Rafi`:\n\n<p>We worked on farms more than anybody else in Medina. We used to rent the land and say to the \nowner, \"The yield of this portion is for us and the yield of that portion is for you (as the rent).\" One of \nthose portions might yield something and the other might not. So, the Prophet (ﷺ) forbade us to do so.</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 122500,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21900,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 526,
        "hadithText": "<p>\nNarrated `Abdullah bin `Umar:\n\n<p>The Prophet (ﷺ) said, \"While three men were walking, It started raining and they took shelter (refuge) in a \ncave in a mountain. A big rock rolled down from the mountain and closed the mouth of the cave. They \nsaid to each other, \"Think of good deeds which you did for Allah's sake only, and invoke Allah by \ngiving reference to those deeds so that He may remove this rock from you.\" \nOne of them said, 'O Allah! I had old parents and small children and I used to graze the sheep for \nthem. On my return to them in the evening, I used to milk (the sheep) and start providing my parents \nfirst of all before my children. One day I was delayed and came late at night and found my parents \nsleeping. I milked (the sheep) as usual and stood by their heads. I hated to wake them up and disliked \nto give milk to my children before them, although my children were weeping (because of hunger) at \nmy feet till the day dawned. O Allah! If I did this for Your sake only, kindly remove the rock so that \nwe could see the sky through it.' So, Allah removed the rock a little and they saw the sky. \nThe second man said, 'O Allah! I was in love with a cousin of mine like the deepest love a man may \nhave for a woman. I wanted to outrage her chastity but she refused unless I gave her one hundred \nDinars. So, I struggled to collect that amount. And when I sat between her legs, she said, 'O Allah's \nslave! Be afraid of Allah and do not deflower me except rightfully (by marriage).' So, I got up. O \nAllah! If I did it for Your sake only, please remove the rock.' The rock shifted a little more. \nThen the third man said, 'O Allah! I employed a laborer for a Faraq of rice and when he finished his \njob and demanded his right, I presented it to him, but he refused to take it. So, I sowed the rice many \ntime till I gathered cows and their shepherd (from the yield). (Then after some time) He came and said \nto me, 'Fear Allah (and give me my right).\" I said, 'Go and take those cows and the shepherd.' He said, \n'Be afraid of Allah! Don't mock at me.' I said, 'I am not mocking at you. Take (all that).' So, he took all \nthat. O Allah! If I did that for Your sake only, please remove the rest of the rock.' So, Allah removed \nthe rock.\"</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 122510,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21910,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 527,
        "hadithText": "<p>\nNarrated Zaid bin Aslam from his father:\n\n<p>`Umar said, \"But for the future Muslim generations, I would have distributed the land of the villages I \nconquer among the soldiers as the Prophet (ﷺ) distributed the land of Khaibar.\"</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 122520,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21920,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 528,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>The Prophet (ﷺ) said, \"He who cultivates land that does not belong to anybody is more rightful (to own \nit).\" `Urwa said, \"`Umar gave the same verdict in his Caliphate.\"</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 122530,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21930,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 529,
        "hadithText": "<p>\nNarrated `Abdullah bin `Umar:\n\n<p>While the Prophet (ﷺ) was passing the night at his place of rest in Dhul-Hulaifa in the bottom of the valley \n(of Aqiq), he saw a dream and it was said to him, \"You are in a blessed valley.\" Musa said, \"Salim let \nour camels kneel at the place where `Abdullah used to make his camel kneel, seeking the place where \nAllah's Messenger (ﷺ) used to take a rest, which is situated below the mosque which is in the bottom of the \nvalley; it is midway between the mosque and the road.\"</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 122540,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21940,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 530,
        "hadithText": "<p>\nNarrated `Umar:\n\n<p>While the Prophet (ﷺ) was in Al-`Aqiq he said, \"Someone (meaning Gabriel) came to me from my Lord \ntonight (in my dream) and said, 'Offer the prayer in this blessed valley and say (I intend to perform) \n`Umra along with Hajj (together).' \"</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 122550,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21950,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 531,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>`Umar expelled the Jews and the Christians from Hijaz. When Allah's Messenger (ﷺ) had conquered \nKhaibar, he wanted to expel the Jews from it as its land became the property of Allah, His Apostle, \nand the Muslims. Allah's Messenger (ﷺ) intended to expel the Jews but they requested him to let them stay \nthere on the condition that they would do the labor and get half of the fruits. Allah's Messenger (ﷺ) told them, \n\"We will let you stay on thus condition, as long as we wish.\" So, they (i.e. Jews) kept on living there \nuntil `Umar forced them to go towards Taima' and Ariha'.</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 122560,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21960,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 532,
        "hadithText": "<p>\nNarrated Rafi` bin Khadij:\n\n<p>My uncle Zuhair said, \"Allah's Messenger (ﷺ) forbade us to do a thing which was a source of help to us.\" I \nsaid, \"Whatever Allah's Messenger (ﷺ) said was right.\" He said, \"Allah's Messenger (ﷺ) sent for me and asked, \n'What are you doing with your farms?' I replied, 'We give our farms on rent on the basis that we get \nthe yield produced at the banks of the water streams (rivers) for the rent, or rent it for some Wasqs of \nbarley and dates.' Allah's Messenger (ﷺ) said, 'Do not do so, but cultivate (the land) yourselves or let it be \ncultivated by others gratis, or keep it uncultivated.' I said, 'We hear and obey.'</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 122570,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21970,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 533,
        "hadithText": "<p>\nNarrated Jabir:\n\n<p>The people used to rent their land for cultivation for one-third, one-fourth or half its yield. The \nProphet said, \"Whoever has land should cultivate it himself or give it to his (Muslim) brother gratis; \notherwise keep it uncultivated.\" \nNarrated Abu Huraira: Allah's Messenger (ﷺ) said, \"Whoever has land should cultivate it himself or give it to \nhis (Muslim) brother gratis; otherwise he should keep it uncultivated.\"</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 122581,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21980,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 534,
        "hadithText": "<p>\nNarrated `Amr:\n\n<p>When I mentioned it (i.e. the narration of Rafi` 'bin Khadij: no. 532) to Tawus, he said, \"It is \npermissible to rent the land for cultivation, for Ibn `Abbas said, 'The Prophet (ﷺ) did not forbid that, but \nsaid: One had better give the land to one's brother gratis rather than charge a certain amount for it.' \"</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 122600,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 21990,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 535,
        "hadithText": "<p>\nNarrated Nafi`:\n\n<p>Ibn `Umar used to rent his farms in the time of Abu Bakr, `Umar, `Uthman, and in the early days of \nMuawiya. Then he was told the narration of Rafi` 'bin Khadij that the Prophet (ﷺ) had forbidden the \nrenting of farms. Ibn `Umar went to Rafi` and I accompanied him. He asked Rafi` who replied that the \nProphet had forbidden the renting of farms. Ibn `Umar said, \"You know that we used to rent our farms \nin the lifetime of Allah's Messenger (ﷺ) for the yield of the banks of the water streams (rivers) and for certain \namount of figs.</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 122611,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22000,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 536,
        "hadithText": "<p>\nNarrated Salim:\n\n<p>`Abdullah bin `Umar said, \"I knew that the land was rented for cultivation in the lifetime of Allah's \nApostle .\" Later on Ibn `Umar was afraid that the Prophet (ﷺ) had forbidden it, and he had no knowledge \nof it, so he gave up renting his land.</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 122630,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22010,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 537,
        "hadithText": "<p>\nNarrated Hanzla bin Qais:\n\n<p>Rafi` bin Khadij said, \"My two uncles told me that they (i.e. the companions of the Prophet) used to \nrent the land in the lifetime of the Prophet (ﷺ) for the yield on the banks of water streams (rivers) or for a \nportion of the yield stipulated by the owner of the land. The Prophet (ﷺ) forbade it.\" I said to Rafi`, \"What \nabout renting the land for Dinars and Dirhams?\" He replied, \"There is no harm in renting for Dinars- \nDirhams. Al-Laith said, \"If those who have discernment for distinguishing what is legal from what is \nillegal looked into what has been forbidden concerning this matter they would not permit it, for it is \nsurrounded with dangers.\"</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 122640,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22020,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 538,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Once the Prophet (ﷺ) was narrating (a story), while a bedouin was sitting with him. \"One of the \ninhabitants of Paradise will ask Allah to allow him to cultivate the land. Allah will ask him, 'Are you \nnot living in the pleasures you like?' He will say, 'Yes, but I like to cultivate the land.' \" The Prophet (ﷺ) \nadded, \"When the man (will be permitted he) will sow the seeds and the plants will grow up and get \nripe, ready for reaping and so on till it will be as huge as mountains within a wink. Allah will then say \nto him, 'O son of Adam! Take here you are, gather (the yield); nothing satisfies you.' \" On that, the \nbedouin said, \"The man must be either from Quraish (i.e. an emigrant) or an Ansari, for they are \nfarmers, whereas we are not farmers.\" The Prophet (ﷺ) smiled (at this).</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 122650,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22030,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 539,
        "hadithText": "<p>\nNarrated Sahl bin Sa`d:\n\n<p>We used to be very happy on Friday as an old lady used to cut some roots of the Silq, which we used \nto plant on the banks of our small water streams, and cook them in a pot of her's, adding to them, \nsome grains of barley. (Ya'qub, the sub-narrator said, \"I think the narrator mentioned that the food did \nnot contain fat or melted fat (taken from meat).\") When we offered the Friday prayer we would go to \nher and she would serve us with the dish. So, we used to be happy on Fridays because of that. We \nused not to take our meals or the midday nap except after the Jumua prayer (i.e. Friday prayer).</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 122660,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22040,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Agriculture",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 540,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The people say that Abu Huraira narrates too many narrations. In fact Allah knows whether I say the \ntruth or not. They also ask, \"Why do the emigrants and the Ansar not narrate as he does?\" In fact, my \nemigrant brethren were busy trading in the markets, and my Ansar brethren were busy with their \nproperties. I was a poor man keeping the company of Allah's Messenger (ﷺ) and was satisfied with what \nfilled my stomach. So, I used to be present while they (i.e. the emigrants and the Ansar) were absent, \nand I used to remember while they forgot (the Hadith). One day the Prophet (ﷺ) said, \"Whoever spreads \nhis sheet till I finish this statement of mine and then gathers it on his chest, will never forget anything \nof my statement.\" So, I spread my covering sheet which was the only garment I had, till the Prophet (ﷺ) \nfinished his statement and then I gathered it over my chest. By Him Who had sent him (i.e. Allah's \nApostle) with the truth, since then I did not forget even a single word of that statement of his, until this \nday of mine. By Allah, but for two verses in Allah's Book, I would never have related any narration \n(from the Prophet). (These two verses are): \"Verily! Those who conceal the clear signs and the \nguidance which we have sent down .....(up to) the Merciful.' (2.159-160)</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 122670,
        "last_updated": "2012-04-26 07:00:00"
    }
]