[
    {
        "englishURN": 22050,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 541,
        "hadithText": "<p>\nNarrated Sahl bin Sa`d:\n\n<p>A tumbler (full of milk or water) was brought to the Prophet (ﷺ) who drank from it, while on his right side \nthere was sitting a boy who was the youngest of those who were present and on his left side there were \nold men. The Prophet (ﷺ) asked, \"O boy, will you allow me to give it (i.e. the rest of the drink) to the old \nmen?\" The boy said, \"O Allah's Messenger (ﷺ)! I will not give preference to anyone over me to drink the rest \nof it from which you have drunk.\" So, the Prophet (ﷺ) gave it to him.</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 122680,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22060,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 542,
        "hadithText": "<p>\nNarrated Az-Zuhri:\n\n<p>Anas bin Malik said, that once a domestic sheep was milked for Allah's Messenger (ﷺ) while he was in the \nhouse of Anas bin Malik. The milk was mixed with water drawn from the well in Anas's house. A \ntumbler of it was presented to Allah's Messenger (ﷺ) who drank from it. Then Abu Bakr was sitting on his \nleft side and a bedouin on his right side. When the Prophet (ﷺ) removed the tumbler from his mouth, \n`Umar was afraid that the Prophet (ﷺ) might give it to the bedouin, so he said. \"O Allah's Messenger (ﷺ)! Give it \nto Abu Bakr who is sitting by your side.\" But the Prophet (ﷺ) gave it to the bedouin, who was to his right \nand said, \"You should start with the one on your right side.\"</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 122690,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22070,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 543,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"Do not withhold the superfluous water, for that will prevent people from \ngrazing their cattle.\"</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 122700,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22080,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 544,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>that Allah's Messenger (ﷺ) said, \"Do not withhold the superfluous water in order to withhold the superfluous \ngrass.\"</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 122710,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22090,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 545,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"No bloodmoney will be charged if somebody dies in a mine or in a well or is \nkilled by an animal; and if somebody finds a treasure in his land he has to give one-fifth of it to the \nGovernment.\"</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 122720,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22100,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 546,
        "hadithText": "<p>\nNarrated `Abdullah (bin Mas`ud):\n\n<p>The Prophet (ﷺ) said, \"Whoever takes a false oath to deprive somebody of his property will meet Allah \nwhile He will be angry with him.\" Allah revealed: 'Verily those who purchase a little gain at the cost \nof Allah's covenant, and their oaths.' ........(3.77) \nAl-Ashath came (to the place where `Abdullah was narrating) and said, \"What has Abu `Abdur- \nRahman (i.e. `Abdullah) been telling you? This verse was revealed concerning me. I had a well in the \nland of a cousin of mine. The Prophet (ﷺ) asked me to bring witnesses (to confirm my claim). I said, 'I \ndon't have witnesses.' He said, 'Let the defendant take an oath then.' I said, 'O Allah's Messenger (ﷺ)! He will \ntake a (false) oath immediately.' Then the Prophet (ﷺ) mentioned the above narration and Allah revealed \nthe verse to confirm what he had said.\" (See Hadith No. 692)</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 122731,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22110,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 547,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"There are three persons whom Allah will not look at on the Day of \nResurrection, nor will he purify them and theirs shall be a severe punishment. They are: \n-1. A man possessed superfluous water, on a way and he withheld it from travelers. \n-2. A man who gave a pledge of allegiance to a ruler and he gave it only for worldly benefits. If the \nruler gives him something he gets satisfied, and if the ruler withholds something from him, he gets \ndissatisfied. \n-3. And man displayed his goods for sale after the `Asr prayer and he said, 'By Allah, except Whom \nNone has the right to be worshipped, I have been given so much for my goods,' and somebody \nbelieves him (and buys them). \nThe Prophet (ﷺ) then recited: \"Verily! Those who purchase a little gain at the cost of Allah's Covenant and \ntheir oaths.\" (3.77)</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 122750,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22120,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 548,
        "hadithText": "<p>\nNarrated `Abdullah bin Az-Zubair:\n\n<p>An Ansari man quarreled with Az-Zubair in the presence of the Prophet (ﷺ) about the Harra Canals which \nwere used for irrigating the date-palms. The Ansari man said to Az-Zubair, \"Let the water pass' but \nAz-Zubair refused to do so. So, the case was brought before the Prophet (ﷺ) who said to Az-Zubair, \"O \nZubair! Irrigate (your land) and then let the water pass to your neighbor.\" On that the Ansari got angry \nand said to the Prophet, \"Is it because he (i.e. Zubair) is your aunt's son?\" On that the color of the face \nof Allah's Messenger (ﷺ) changed (because of anger) and he said, \"O Zubair! Irrigate (your land) and then \nwithhold the water till it reaches the walls between the pits round the trees.\" Zubair said, \"By Allah, I \nthink that the following verse was revealed on this occasion\": \"But no, by your Lord They can have \nNo faith Until they make you judge In all disputes between them.\" (4.65)</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 122760,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22130,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 549,
        "hadithText": "<p>\nNarrated `Urwa:\n\n<p>When a man from the Ansar quarreled with Az-Zubair, the Prophet (ﷺ) said, \"O Zubair! Irrigate (your \nland) first and then let the water flow (to the land of the others).\" \"On that the Ansari said, (to the \nProphet), \"It is because he is your aunt's son.\" On that the Prophet (ﷺ) said, \"O Zubair! Irrigate till the \nwater reaches the walls between the pits around the trees and then stop (i.e. let the water go to the \nother's land).\" I think the following verse was revealed concerning this event: \"But no, by your Lord \nThey can have No faith Until they make you judge In all disputes between them.\" (4.65)</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 122770,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22140,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 550,
        "hadithText": "<p>\nNarrated `Urwa bin Az-Zubair:\n\n<p>An Ansari man quarreled with Az-Zubair about a canal in the Harra which was used for irrigating \ndate-palms. Allah's Messenger (ﷺ), ordering Zubair to be moderate, said, \"O Zubair! Irrigate (your land) first \nand then leave the water for your neighbor.\" The Ansari said, \"Is it because he is your aunt's son?\" On \nthat the color of the face of Allah's Messenger (ﷺ) changed and he said, \"O Zubair! Irrigate (your land) and \nwithhold the water till it reaches the walls that are between the pits around the trees.\" So, Allah's \nApostle gave Zubair his full right. Zubair said, \"By Allah, the following verse was revealed in that \nconnection\": \"But no, by your Lord They can have No faith Until they make you judge In all disputes \nbetween them.\" (4.65) \n(The sub-narrator,) Ibn Shihab said to Juraij (another sub-narrator), \"The Ansar and the other people \ninterpreted the saying of the Prophet, 'Irrigate (your land) and withhold the water till it reaches the \nwalls between the pits around the trees,' as meaning up to the ankles.\"</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 122780,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22150,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 551,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"While a man was walking he felt thirsty and went down a well and drank water \nfrom it. On coming out of it, he saw a dog panting and eating mud because of excessive thirst. The \nman said, 'This (dog) is suffering from the same problem as that of mine. So he (went down the well), \nfilled his shoe with water, caught hold of it with his teeth and climbed up and watered the dog. Allah \nthanked him for his (good) deed and forgave him.\" The people asked, \"O Allah's Messenger (ﷺ)! Is there a \nreward for us in serving (the) animals?\" He replied, \"Yes, there is a reward for serving any animate.\"</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 122790,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22160,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 552,
        "hadithText": "<p>\nNarrated Asma' bint Abi Bakr:\n\n<p>The Prophet (ﷺ) prayed the eclipse prayer, and then said, \"Hell was displayed so close that I said, 'O my \nLord ! Am I going to be one of its inhabitants?\"' Suddenly he saw a woman. I think he said, who was \nbeing scratched by a cat. He said, \"What is wrong with her?\" He was told, \"She had imprisoned it (i.e. \nthe cat) till it died of hunger.\"</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 122800,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22170,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 553,
        "hadithText": "<p>\nNarrated `Abdullah bin `Umar:\n\n<p>Allah's Messenger (ﷺ) said, \"A woman was tortured and was put in Hell because of a cat which she had kept locked till it died of hunger.\" Allah's Messenger (ﷺ) further said, (Allah knows better) Allah said (to the woman), 'You neither fed it nor watered when you locked it up, nor did you set it free to eat the vermin of the earth.' \"</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 122810,
        "last_updated": "2021-03-25 15:56:41"
    },
    {
        "englishURN": 22180,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 554,
        "hadithText": "<p>\nNarrated Sahl bin Sa`d:\n\n<p>Once a tumbler (full of milk or water) was brought to Allah's Messenger (ﷺ) who drank from it, while on his \nright side there was sitting a boy who was the youngest of those who were present, and on his left side \nthere were old men. The Prophet (ﷺ) asked, \"O boy ! Do you allow me to give (the drink) to the elder \npeople (first)?\" The boy said, \"I will not prefer anybody to have my share from you, O Allah's \nApostle!\" So, he gave it to the boy.</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 122820,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22190,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 555,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"By Him in Whose Hands my soul is, I will drive some people out from my (sacred) \nFount on the Day of Resurrection as strange camels are expelled from a private trough.\"</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 122830,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22200,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 556,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>The Prophet (ﷺ) said, \"May Allah be merciful to the mother of Ishmael! If she had left the water of \nZamzam (fountain) as it was, (without constructing a basin for keeping the water), (or said, \"If she had \nnot taken handfuls of its water\"), it would have been a flowing stream. Jurhum (an Arab tribe) came \nand asked her, 'May we settle at your dwelling?' She said, 'Yes, but you have no right to possess the \nwater.' They agreed.\"</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 122840,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22210,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 557,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"There are three types of people whom Allah will neither talk to, nor look at, on the \nDay of Resurrection. (They are): \n-1. A man who takes an oath falsely that he has been offered for his goods so much more than what he \nis given, \n-2. a man who takes a false oath after the `Asr prayer in order to grab a Muslim's property, and \n-3. a man who withholds his superfluous water. Allah will say to him, \"Today I will withhold My \nGrace from you as you withheld the superfluity of what you had not created.\"</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 122850,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22220,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 558,
        "hadithText": "<p>\nNarrated As-Sab bin Jath-thama:\n\n<p>Allah's Messenger (ﷺ) said, No Hima except for Allah and His Apostle. We have been told that Allah's \nApostle made a place called An-Naqi' as Hima, and `Umar made Ash-Sharaf and Ar-Rabadha Hima \n(for grazing the animals of Zakat).</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 122860,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22230,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 559,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"Keeping horses may be a source of reward to some (man), a shelter to another \n(i.e. means of earning one's living), or a burden to a third. He to whom the horse will be a source of \nreward is the one who keeps it in Allah's Cause (prepare it for holy battles) and ties it by a long rope \nin a pasture (or a garden). He will get a reward equal to what its long rope allows it to eat in the \npasture or the garden, and if that horse breaks its rope and crosses one or two hills, then all its \nfootsteps and its dung will be counted as good deeds for its owner; and if it passes by a river and \ndrinks from it, then that will also be regarded as a good deed for its owner even if he has had no \nintention of watering it then. Horses are a shelter from poverty to the second person who keeps horses \nfor earning his living so as not to ask others, and at the same time he gives Allah's right (i.e. rak`at) \n(from the wealth he earns through using them in trading etc.,) and does not overburden them. He who \nkeeps horses just out of pride and for showing off and as a means of harming the Muslims, his horses \nwill be a source of sins to him.\" When Allah's Messenger (ﷺ) was asked about donkeys, he replied, \"Nothing \nparticular was revealed to me regarding them except the general unique verse which is applicable to \neverything: \"Whoever does goodness equal to the weight of an atom (or small ant) shall see it (its \nreward) on the Day of Resurrection.\"</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 122870,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22240,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 560,
        "hadithText": "<p>\nNarrated Zaid bin Khalid:\n\n<p>A man came to Allah's Messenger (ﷺ) and asked about Al-Luqata (a fallen thing). The Prophet (ﷺ) said, \n\"Recognize its container and its tying material and then make a public announcement about it for one \nyear and if its owner shows up, give it to him; otherwise use it as you like.\" The man said, \"What \nabout a lost sheep?\" The Prophet (ﷺ) said, \"It is for you, your brother or the wolf.\" The man said \"What \nabout a lost camel?\" The Prophet (ﷺ) said, \"Why should you take it as it has got its water-container (its \nstomach) and its hooves and it can reach the places of water and can eat the trees till its owner finds \nit?\"</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 122880,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22250,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 561,
        "hadithText": "<p>\nNarrated Az-Zubair bin Al 'Awwam:\n\n<p>The Prophet (ﷺ) said, \"No doubt, one had better take a rope (and cut) and tie a bundle of wood and sell it \nwhereby Allah will keep his face away (from Hell-fire) rather than ask others who may give him or \nnot.\"</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 122890,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22260,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 562,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"No doubt, you had better gather a bundle of wood and carry it on your back \n(and earn your living thereby) rather than ask somebody who may give you or not.\"</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 122900,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22270,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 563,
        "hadithText": "<p>\nNarrated Husain bin `Ali:\n\n<p>`Ali bin Abi Talib said: \"I got a she-camel as my share of the war booty on the day (of the battle) of \nBadr, and Allah's Messenger (ﷺ) gave me another she-camel. I let both of them kneel at the door of one of \nthe Ansar, intending to carry Idhkhir on them to sell it and use its price for my wedding banquet on \nmarrying Fatima. A goldsmith from Bani Qainqa' was with me. Hamza bin `Abdul-Muttalib was in \nthat house drinking wine and a lady singer was reciting: \"O Hamza! (Kill) the (two) fat old she camels \n(and serve them to your guests). \nSo Hamza took his sword and went towards the two she-camels and cut off their humps and opened \ntheir flanks and took a part of their livers.\" (I said to Ibn Shihab, \"Did he take part of the humps?\" He \nreplied, \"He cut off their humps and carried them away.\") `Ali further said, \"When I saw that dreadful \nsight, I went to the Prophet (ﷺ) and told him the news. The Prophet (ﷺ) came out in the company of Zaid bin \nHaritha who was with him then, and I too went with them. He went to Hamza and spoke harshly to \nhim. Hamza looked up and said, 'Aren't you only the slaves of my forefathers?' The Prophet (ﷺ) retreated \nand went out. This incident happened before the prohibition of drinking.\"</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 122910,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22280,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 564,
        "hadithText": "<p>\nNarrated Anas:\n\n<p>The Prophet (ﷺ) decided to grant a portion of (the uncultivated land of) Bahrain to the Ansar. The Ansar \nsaid, \"(We will not accept it) till you give a similar portion to our emigrant brothers (from Quraish).\" \nHe said, \"(O Ansar!) You will soon see people giving preference to others, so remain patient till you \nmeet me (on the Day of Resurrection).</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 122920,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22290,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 565,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"One of the rights of a she camel is that it should be milked at a place of water.\"</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 122940,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22300,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 566,
        "hadithText": "<p>\nNarrated Zaid bin Thabit:\n\n<p>The Prophet (ﷺ) permitted selling the dates of the 'Araya for ready dates by estimating the amount of the \nformer (as they are still on the trees).</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 122960,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22310,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 567,
        "hadithText": "<p>\nNarrated Jabir bin `Abdullah:\n\n<p>The Prophet (ﷺ) forbade the sales called Al-Mukhabara, Al-Muhaqala and Al-Muzabana and the selling of \nfruits till they are free from blights. He forbade the selling of the fruits except for money, except the \n'Araya.</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 122970,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22320,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 568,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) allowed the sale of the dates of the 'Araya for ready dates by estimating the former which \nshould be estimated as less than five Awsuq or five Awsuq. (Dawud, the sub-narrator is not sure as to \nthe right amount.)</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 122980,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22330,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 569,
        "hadithText": "<p>\nNarrated Rafi` 'bin Khadij and Sahl bin Abi Hathma:\n\n<p>Allah's Messenger (ﷺ) forbade the sale of Muzabana, i.e. selling of fruits for fruits, except in the case of \n'Araya; he allowed the owners of 'Araya such kind of sale.</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 122990,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22285,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 564,
        "hadithText": "Narrated Anas (ra): The Prophet (ﷺ) called the Ansar so as to grant them a portion of (the land of) Bahrain. They said, \"O Allah's Messenger ! If you grant this to is, write a similar document on our Quraish (emigrant) brothers.\" But the Prophet (ﷺ) did not have enough grants and he said: \"After me you will see the people giving preference (to others), so be patient till you meet me.\"</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 122930,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 22295,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Distribution of Water",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 566,
        "hadithText": "Narrated 'Abdullah (ra) said, I heard the Messenger of Allah (ﷺ) say \"If somebody buys date-palms after they have been pollinated, the fruits will belong to the seller unless the buyer stipulates the contrary. If somebody buys a slave having some property, the property will belong to the seller unless the buyer stipulate that it should belong to him.\"</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 122950,
        "last_updated": "2012-04-26 07:00:00"
    }
]