[
    {
        "englishURN": 23270,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 44,
        "bookName": "Partnership",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 663,
        "hadithText": "<p>\nNarrated Jabir bin `Abdullah:\n\n<p>\"Allah's Messenger (ﷺ) sent an army towards the east coast and appointed Abu 'Ubaida bin Al-Jarrah as their \nchief, and the army consisted of three-hundred men including myself. We marched on till we reached \na place where our food was about to finish. Abu- 'Ubaida ordered us to collect all the journey food and \nit was collected. My (our) journey food was dates. Abu 'Ubaida kept on giving us our daily ration in \nsmall amounts from it, till it was exhausted. The share of everyone of us used to be one date only.\" I \nsaid, \"How could one date benefit you?\" Jabir replied, \"We came to know its value when even that too \nfinished.\" Jabir added, \"When we reached the sea-shore, we saw a huge fish which was like a small \nmountain. The army ate from it for eighteen days. Then Abu 'Ubaida ordered that two of its ribs be \nfixed and they were fixed in the ground. Then he ordered that a she-camel be ridden and it passed \nunder the two ribs (forming an arch) without touching them.\"</b>",
        "bookID": "44.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 124000,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 23280,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 44,
        "bookName": "Partnership",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 664,
        "hadithText": "<p>\r\nNarrated Salama:\r\n\r\n<p>Once (on a journey) our provisions diminished and the people were reduced to poverty. They went to the Prophet (ﷺ) \r\nand asked his permission to slaughter their camels, and he agreed. `Umar met them and they told him \r\nabout it, and he said, \"How would you survive after slaughtering your camels?\" Then he went to the \r\nProphet and said, \"O Allah's Messenger (ﷺ)! How would they survive after slaughtering their camels?\" \r\nAllah's Messenger (ﷺ) ordered `Umar, \"Call upon the people to bring what has remained of their food.\" A \r\nleather sheet was spread and all the food was collected and heaped over it. Allah's Messenger (ﷺ) \r\nstood up and invoked Allah to bless it, and then directed all the people to come with their utensils, and \r\nthey started taking from it till all of them got what was sufficient for them. Allah's Messenger (ﷺ) then said, \r\n\"I testify that None has the right to be worshipped but Allah, and I am His Messenger.\"</b>",
        "bookID": "44.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 124010,
        "last_updated": "2013-10-30 17:48:01"
    },
    {
        "englishURN": 23290,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 44,
        "bookName": "Partnership",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 665,
        "hadithText": "<p>\nNarrated Rafi` bin Khadij:\n\n<p>We used to offer the `Asr prayer with the Prophet (ﷺ) and slaughter a camel, the meat of which would be \ndivided in ten parts. We would eat the cooked meat before sunset.</b>",
        "bookID": "44.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 124020,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 23300,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 44,
        "bookName": "Partnership",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 666,
        "hadithText": "<p>\nNarrated Abu Musa:\n\n<p>The Prophet (ﷺ) said, \"When the people of Ash`ari tribe ran short of food during the holy battles, or the \nfood of their families in Medina ran short, they would collect all their remaining food in one sheet and \nthen distribute it among themselves equally by measuring it with a bowl. So, these people are from \nme, and I am from them.\"</b>",
        "bookID": "44.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 124030,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 23310,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 44,
        "bookName": "Partnership",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 667,
        "hadithText": "<p>\nNarrated Anas:\n\n<p>that Abu Bakr As-Siddiq wrote to him the law of Zakat which was made obligatory by Allah's \nApostle. He wrote: 'Partners possessing joint property (sheep) have to pay its Zakat equally.</b>",
        "bookID": "44.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 124040,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 23320,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 44,
        "bookName": "Partnership",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 668,
        "hadithText": "<p>\nNarrated 'Abaya bin Rafa'a bin Raft' bin Khadij:\n\n<p>My grandfather said, \"We were in the company of the Prophet (ﷺ) at Dhul-Hulaifa. The people felt \nhungry and captured some camels and sheep (as booty). The Prophet (ﷺ) was behind the people. They \nhurried and slaughtered the animals and put their meat in pots and started cooking it. (When the \nProphet came) he ordered the pots to be upset and then he distributed the animals (of the booty), \nregarding ten sheep as equal to one camel. One of the camels fled and the people ran after it till they \nwere exhausted. At that time there were few horses. A man threw an arrow at the camel, and Allah \nstopped the camel with it. The Prophet (ﷺ) said, \"Some of these animals are like wild animals, so if you \nlose control over one of these animals, treat it in this way (i.e. shoot it with an arrow).\" Before \ndistributing them among the soldiers my grandfather said, \"We may meet the enemies in the future \nand have no knives; can we slaughter the animals with reeds?\" The Prophet (ﷺ) said, \"Use whatever \ncauses blood to flow, and eat the animals if the name of Allah has been mentioned on slaughtering \nthem. Do not slaughter with teeth or fingernails and I will tell you why: It is because teeth are bones \n(i.e. cannot cut properly) and fingernails are the tools used by the Ethiopians (whom we should not \nimitate for they are infidels).</b>",
        "bookID": "44.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 124050,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 23330,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 44,
        "bookName": "Partnership",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 669,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>The Prophet (ﷺ) decreed that one should not eat two dates together at a time unless he gets the permission \nfrom his companions (sharing the meal with him).</b>",
        "bookID": "44.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 124060,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 23340,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 44,
        "bookName": "Partnership",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 670,
        "hadithText": "<p>\nNarrated Jabala:\n\n<p>\"While at Medina we were struck with famine. Ibn Az-Zubair used to provide us with dates as our \nfood. Ibn `Umar used to pass by us and say, \"Don't eat two dates together at a time as the Prophet (ﷺ) has \nforbidden eating two dates together at a time (in a gathering) unless one takes the permission of one's \ncompanion brother.\"</b>",
        "bookID": "44.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 124070,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 23350,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 44,
        "bookName": "Partnership",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 671,
        "hadithText": "<p>\nNarrated Nafi`:\n\n<p>Ibn `Umar said, \"Allah's Messenger (ﷺ) said, 'If one manumits his share of a jointly possessed slave, and can \nafford the price of the other shares according to the adequate price of the slave, the slave will be \ncompletely manumitted; otherwise he will be partially manumitted.' \" (Aiyub, a sub-narrator is not \nsure whether the saying \" ... otherwise he will be partially manumitted\" was said by Nafi` or the \nProphet.)</b>",
        "bookID": "44.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 124080,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 23360,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 44,
        "bookName": "Partnership",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 672,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"Whoever manumits his share of a jointly possessed slave, it is imperative for him \nto get that slave manumitted completely by paying the remaining price, and if he does not have \nsufficient money to manumit him, then the price of the slave should be estimated justly, and he is to \nbe allowed to work and earn the amount that will manumit him (without overburdening him)\".</b>",
        "bookID": "44.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 124090,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 23370,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 44,
        "bookName": "Partnership",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 673,
        "hadithText": "<p>\nNarrated An-Nu`man bin Bashir:\n\n<p>The Prophet (ﷺ) said, \"The example of the person abiding by Allah's order and restrictions in comparison \nto those who violate them is like the example of those persons who drew lots for their seats in a boat. \nSome of them got seats in the upper part, and the others in the lower. When the latter needed water, \nthey had to go up to bring water (and that troubled the others), so they said, 'Let us make a hole in our \nshare of the ship (and get water) saving those who are above us from troubling them. So, if the people \nin the upper part left the others do what they had suggested, all the people of the ship would be \ndestroyed, but if they prevented them, both parties would be safe.\"</b>",
        "bookID": "44.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 124100,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 23380,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 44,
        "bookName": "Partnership",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 674,
        "hadithText": "<p>\nNarrated `Urwa bin Az-Zubair:\n\n<p>That he had asked `Aisha about the meaning of the Statement of Allah: \"If you fear that you shall not \nBe able to deal justly With the orphan girls, then Marry (Other) women of your choice Two or three or \nfour.\" (4.3) \nShe said, \"O my nephew! This is about the orphan girl who lives with her guardian and shares his \nproperty. Her wealth and beauty may tempt him to marry her without giving her an adequate Mahr \n(bridal-money) which might have been given by another suitor. So, such guardians were forbidden to \nmarry such orphan girls unless they treated them justly and gave them the most suitable Mahr; \notherwise they were ordered to marry any other woman.\" `Aisha further said, \"After that verse the \npeople again asked the Prophet (about the marriage with orphan 'girls), so Allah revealed the \nfollowing verses:-- 'They ask your instruction Concerning the women. Say: Allah Instructs you about \nthem And about what is Recited unto you In the Book, concerning The orphan girls to whom You \ngive not the prescribed portions and yet whom you Desire to marry...\" (4.127) \nWhat is meant by Allah's Saying:-- 'And about what is Recited unto you is the former verse which \ngoes:-- 'If you fear that you shall not Be able to deal justly With the orphan girls, then Marry (other) \nwomen of your choice.' (4.3) `Aisha said, \"Allah's saying in the other verse:--'Yet whom you desire to \nmarry' (4.127) means the desire of the guardian to marry an orphan girl under his supervision when \nshe has not much property or beauty (in which case he should treat her justly). The guardians were \nforbidden to marry their orphan girls possessing property and beauty without being just to them, as \nthey generally refrain from marrying them (when they are neither beautiful nor wealthy).</b>",
        "bookID": "44.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 124110,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 23390,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 44,
        "bookName": "Partnership",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 675,
        "hadithText": "<p>\nNarrated Jabir bin `Abdullah:\n\n<p>The Prophet (ﷺ) established the right of Shu'fa (i.e. Preemption) in joint properties; but when the land is \ndivided and the ways are demarcated, then there is no pre-emption.</b>",
        "bookID": "44.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 124120,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 23400,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 44,
        "bookName": "Partnership",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 676,
        "hadithText": "<p>\nNarrated Jabir bin `Abdullah:\n\n<p>The Prophet (ﷺ) said, \"The right of preemption is valid in every joint property, but when the land is \ndivided and the way is demarcated, then there is no right of pre-emption.\"</b>",
        "bookID": "44.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 124130,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 23410,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 44,
        "bookName": "Partnership",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 677,
        "hadithText": "<p>\nNarrated Sulaiman bin Abu Muslim:\n\n<p>I asked Abu Minhal about money exchange from hand to hand. He said, \"I and a partner of mine \nbought something partly in cash and partly on credit.\" Al-Bara' bin `Azib passed by us and we asked \nabout it. He replied, \"I and my partner Zaid bin Al-Arqam did the same and then went to the Prophet (ﷺ) \nand asked him about it. He said, 'Take what was from hand to hand and leave what was on credit.' \"</b>",
        "bookID": "44.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 124140,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 23420,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 44,
        "bookName": "Partnership",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 678,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>Allah's Messenger (ﷺ) rented the land of Khaibar to the Jews on the condition that they would work on it and \ncultivate it and take half of its yield.</b>",
        "bookID": "44.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 124150,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 23430,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 44,
        "bookName": "Partnership",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 679,
        "hadithText": "<p>\nNarrated `Uqba bin 'Amir:\n\n<p>that Allah's Messenger (ﷺ) gave him some sheep to distribute among his companions in order to sacrifice \nthem and a kid was left. He told the Prophet (ﷺ) about it and the Prophet (ﷺ) said to him, \"Sacrifice it on your \nbehalf.\"</b>",
        "bookID": "44.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 124160,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 23440,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 44,
        "bookName": "Partnership",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 680,
        "hadithText": "<p>\nNarrated `Abdullah bin Hisham:\n\n<p>that his mother Zainab bint Humaid took him to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Take the \npledge of allegiance from him.\" But he said, \"He is still too young for the pledge,\" and passed his \nhand on his (i.e. `Abdullah's) head and invoked for Allah's blessing for him. Zuhra bin Ma`bad stated \nthat he used to go with his grandfather, `Abdullah bin Hisham, to the market to buy foodstuff. Ibn \n`Umar and Ibn Az-Zubair would meet him and say to him, \"Be our partner, as the Prophet (ﷺ) invoked \nAllah to bless you.\" So, he would be their partner, and very often he would win a camel's load and \nsend it home.</b>",
        "bookID": "44.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 124171,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 23450,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 44,
        "bookName": "Partnership",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 681,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>The Prophet (ﷺ) said, \"Whoever manumits his share o a jointly possessed slave, it is imperative on him to \nmanumit the slave completely if he has sufficient money to pay the rest of its price which is to be \nestimated justly. He should pay his partners their shares and release him (the freed one).</b>",
        "bookID": "44.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 124190,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 23460,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 44,
        "bookName": "Partnership",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 682,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"Whoever manumits his share of a jointly possessed slave, it is essential for him to \nmanumit the slave completely if he has sufficient money. Otherwise he should look for some work for \nthe slave (to earn what would enable him to emancipate himself), without overburdening him with \nwork.\"</b>",
        "bookID": "44.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 124200,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 23470,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 44,
        "bookName": "Partnership",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 683,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>The Prophet (along with his companions) reached Mecca in the morning of the fourth of Dhul-Hijja \nassuming Ihram for Hajj only. So when we arrived at Mecca, the Prophet (ﷺ) ordered us to change our \nintentions of the Ihram for `Umra and that we could finish our Ihram after performing the `Umra and \ncould go to our wives (for sexual intercourse). The people began talking about that. Jabir said \nsurprisingly, \"Shall we go to Mina while semen is dribbling from our male organs?\" Jabir moved his \nhand while saying so. When this news reached the Prophet (ﷺ) he delivered a sermon and said, \"I have \nbeen informed that some peoples were saying so and so; By Allah I fear Allah more than you do, and \nam more obedient to Him than you. If I had known what I know now, I would not have brought the \nHadi (sacrifice) with me and had the Hadi not been with me, I would have finished the Ihram.\" At that \nSuraqa bin Malik stood up and asked \"O Allah's Messenger (ﷺ)! Is this permission for us only or is it \nforever?\" The Prophet (ﷺ) replied, \"It is forever.\" In the meantime `Ali bin Abu Talib came from Yemen \nand was saying Labbaik for what the Prophet (ﷺ) has intended. (According to another man, `Ali was \nsaying Labbaik for Hajj similar to Allah's Messenger (ﷺ)'s). The Prophet (ﷺ) told him to keep on the Ihram and \nlet him share the Hadi with him.</b>",
        "bookID": "44.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 124211,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 23480,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 44,
        "bookName": "Partnership",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 684,
        "hadithText": "<p>\nNarrated Abaya bin Rifaa:\n\n<p>My grandfather, Rafi` bin Khadij said, \"We were in the valley of Dhul-Hulaifa of Tuhama in the \ncompany of the Prophet (ﷺ) and had some camels and sheep (of the booty). The people hurried (in \nslaughtering the animals) and put their meat in the pots and started cooking. Allah's Messenger (ﷺ) came and \nordered them to upset the pots, and distributed the booty considering one camel as equal to ten sheep. \nOne of the camels fled and the people had only a few horses, so they got worried. (The camel was \nchased and) a man slopped the camel by throwing an arrow at it. Allah's Messenger (ﷺ) said, 'Some of these \nanimals are untamed like wild animals, so if anyone of them went out of your control, then you should \ntreat it as you have done now.' \" My grandfather said, \"O Allah's Messenger (ﷺ)! We fear that we may meet \nour enemy tomorrow and we have no knives, could we slaughter the animals with reeds?\" The Prophet (ﷺ) \nsaid, \"Yes, or you can use what would make blood flow (slaughter) and you can eat what is \nslaughtered and the Name of Allah is mentioned at the time of slaughtering. But don't use teeth or \nfingernails (in slaughtering). I will tell you why, as for teeth, they are bones, and fingernails are used \nby Ethiopians for slaughtering. (See Hadith 668)</b>",
        "bookID": "44.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 124230,
        "last_updated": "2012-04-26 07:00:00"
    }
]