[
    {
        "englishURN": 25390,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 875,
        "hadithText": "<p>\nNarrated Jarir:\n\n<p>When I gave the pledge of allegiance to Allah's Messenger (ﷺ) and he stipulated that I should give good \nadvice to every Muslim.</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 126410,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 25400,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 876,
        "hadithText": "<p>\nNarrated Jabir bin `Abdullah:\n\n<p>I gave the pledge of allegiance to Allah's Messenger (ﷺ) for offering the prayers perfectly paying the Zakat \nand giving good advice to every Muslim.</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 126420,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 25410,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 877,
        "hadithText": "<p>\nNarrated `Abdullah bin `Umar:\n\n<p>Allah's Messenger (ﷺ) said, \"If someone sells pollinated date-palms, their fruits will be for the seller, unless \nthe buyer stipulates the contrary.\"</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 126430,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 25420,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 878,
        "hadithText": "<p>\r\nNarrated `Urwa:\r\n\r\n<p>Aisha told me that Barirah came to seek her help in writing for emancipation and at that time she had \r\nnot paid any part of her price. `Aisha said to her, \"Go to your masters and if they agree that I will pay \r\nyour price (and free you) on condition that your Wala' will be for me, I will pay the money.\" Barirah \r\ntold her masters about that, but they refused, and said, \"If `Aisha wants to do a favor she could, but \r\nyour Wala will be for us.\" Aisha informed Allah's Messenger (ﷺ) of that and he said to her, \"Buy and \r\nmanumit Barirah as the Wala' will go to the manumitted.\"</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 126440,
        "last_updated": "2021-03-08 18:55:12"
    },
    {
        "englishURN": 25430,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 879,
        "hadithText": "<p>\nNarrated Jabir:\n\n<p>While I was riding a (slow) and tired camel, the Prophet (ﷺ) passed by and beat it and prayed for Allah's \nBlessings for it. The camel became so fast as it had never been before. The Prophet (ﷺ) then said, \"Sell it \nto me for one Uqiyya (of gold).\" I said, \"No.\" He again said, \"Sell it to me for one Uqiyya (of gold).\" I \nsold it and stipulated that I should ride it to my house. When we reached (Medina) I took that camel to \nthe Prophet (ﷺ) and he gave me its price. I returned home but he sent for me (and when I went to him) he \nsaid, \"I will not take your camel. Take your camel as a gift for you.\" (Various narrations are \nmentioned here with slight variations in expressions relating the condition that Jabir had the right to \nride the sold camel up to Medina).</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 126450,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 25440,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 880,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Ansar said to the Prophet, \"Divide our date-palms between us and our emigrant brothers.\" The \nProphet said, \"No.\" The Ansar said to the emigrants, \"You may do the labor (in our gardens) and we \nwill share the fruits with you.\" The emigrants said, \"We hear and obey.\"</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 126460,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 25450,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 881,
        "hadithText": "<p>\nNarrated `Abdullah bin `Umar:\n\n<p>Allah's Messenger (ﷺ) gave the land of Khaibar to the Jews on the condition that they would work on it and \ncultivate it and they would get half of its yield.</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 126470,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 25460,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 882,
        "hadithText": "<p>\nNarrated `Uqba bin Amir:\n\n<p>Allah's Messenger (ﷺ) said, \"From among all the conditions which you have to fulfill, the conditions which \nmake it legal for you to have sexual relations (i.e. the marriage contract) have the greatest right to be \nfulfilled.\"</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 126480,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 25470,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 883,
        "hadithText": "<p>\nNarrated Rafi` bin Khadij:\n\n<p>We used to work on the fields more than the other Ansar, and we used to rent the land (for the yield of \na specific portion of it). But sometimes that portion or the rest of the land did not give any yield, so we \nwere forbidden (by the Prophet (ﷺ) ) to follow such a system, but we were allowed to rent the land for \nmoney.</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 126490,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 25480,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 884,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"No town-dweller should sell for a bedouin. Do not practice Najsh (i.e. Do not offer \na high price for a thing which you do not want to buy, in order to deceive the people). No Muslim \nshould offer more for a thing already bought by his Muslim brother, nor should he demand the hand of \na girl already engaged to another Muslim. A Muslim woman shall not try to bring about The divorce \nof her sister (i.e. another Muslim woman) in order to take her place herself.\"</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 126500,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 25490,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 885,
        "hadithText": "<p>\nNarrated Abu Huraira and Zaid bin Khalid Al-Juhani:\n\n<p>A bedouin came to Allah's Messenger (ﷺ) and said, \"O Allah's apostle! I ask you by Allah to judge My case \naccording to Allah's Laws.\" His opponent, who was more learned than he, said, \"Yes, judge between \nus according to Allah's Laws, and allow me to speak.\" Allah's Messenger (ﷺ) said, \"Speak.\" He (i .e. the \nbedouin or the other man) said, \"My son was working as a laborer for this (man) and he committed \nillegal sexual intercourse with his wife. The people told me that it was obligatory that my son should \nbe stoned to death, so in lieu of that I ransomed my son by paying one hundred sheep and a slave girl. \nThen I asked the religious scholars about it, and they informed me that my son must be lashed one \nhundred lashes, and be exiled for one year, and the wife of this (man) must be stoned to death.\" \nAllah's Messenger (ﷺ) said, \"By Him in Whose Hands my soul is, I will judge between you according to \nAllah's Laws. The slave-girl and the sheep are to be returned to you, your son is to receive a hundred \nlashes and be exiled for one year. You, Unais, go to the wife of this (man) and if she confesses her \nguilt, stone her to death.\" Unais went to that woman next morning and she confessed. Allah's Messenger (ﷺ) \nordered that she be stoned to death.</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 126510,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 25500,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 886,
        "hadithText": "<p>\r\nNarrated Aiman Al-Makki:\r\n\r\n<p>When I visited Aisha she said, \"Barirah who had a written contract for her emancipation for a certain \r\namount came to me and said, \"O mother of the believers! Buy me and manumit me, as my masters \r\nwill sell me.\" Aisha agreed to it. Barirah said, 'My masters will sell me on the condition that my Wala \r\nwill go to them.\" Aisha said to her, 'Then I am not in need of you.' The Prophet (ﷺ) heard of that or was \r\ntold about it and so he asked Aisha, 'What is the problem of Barirah?' He said, 'Buy her and manumit \r\nher, no matter what they stipulate.' Aisha added, 'I bought and manumitted her, though her masters \r\nhad stipulated that her Wala would be for them.' The Prophet (ﷺ) said, The Wala is for the liberator, even \r\nif the other stipulated a hundred conditions.\"</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 126520,
        "last_updated": "2021-03-08 18:55:35"
    },
    {
        "englishURN": 25510,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 887,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) forbade (1) the meeting of the caravan (of goods) on the way, (2) and that a residing \nperson buys for a bedouin, (3) and that a woman stipulates the divorce of the wife of the would-be \nhusband, (4) and that a man tries to cause the cancellation of a bargain concluded by another. He also \nforbade An-Najsh (see Hadith 824) and that one withholds the milk in the udder of the animal so that \nhe may deceive people on selling it.</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 126530,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 25520,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 888,
        "hadithText": "<p>\nNarrated Ubai bin Ka`b:\n\n<p>Allah's Messenger (ﷺ) said, \"Moses the Messenger of Allah,\" and then he narrated the whole story about him. \nAl-Khadir said to Moses, \"Did not I tell you that you can have no patience with me.\" (18.72). Moses \nthen violated the agreement for the first time because of forgetfulness, then Moses promised that if he \nasked Al-Khadir about anything, the latter would have the right to desert him. Moses abided by that \ncondition and on the third occasion he intentionally asked Al-Khadir and caused that condition to be \napplied. The three occasions referred to above are referred to by the following Verses: \n\"Call me not to account for forgetting And be not hard upon me.\" (18.73) \n\"Then they met a boy and Khadir killed him.\" (18.74) \n\"Then they proceeded and found a wall which was on the verge of falling and Khadir set it up \nstraight.\" (18.77)</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 126540,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 25530,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 889,
        "hadithText": "<p>\r\nNarrated `Urwa:\r\n\r\n<p>Aisha said, \"Barirah came to me and said, 'My people (masters) have written the contract for my \r\nemancipation for nine Awaq ) of gold) to be paid in yearly installments, one Uqiyya per year; so help \r\nme.\" Aisha said (to her), \"If your masters agree, I will pay them the whole sum provided the Wala will \r\nbe for me.\" Barirah went to her masters and told them about it, but they refused the offer and she \r\nreturned from them while Allah's Messenger (ﷺ)s was sitting. She said, \"I presented the offer to them, but \r\nthey refused unless the Wala' would be for them.\" When the Prophet (ﷺ) heard that and `Aisha told him \r\nabout It, he said to her, \"Buy Barirah and let them stipulate that her Wala' will be for them, as the \r\nWala' is for the manumitted.\" `Aisha did so. After that Allah's Messenger (ﷺ) got up amidst the people, \r\nGlorified and Praised Allah and said, \"What is wrong with some people who stipulate things which \r\nare not in Allah's Laws? Any condition which is not in Allah's Laws is invalid even if there were a \r\nhundred such conditions. Allah's Rules are the most valid and Allah's Conditions are the most solid. \r\nThe Wala is for the manumitted.\"</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 126550,
        "last_updated": "2021-03-08 18:56:02"
    },
    {
        "englishURN": 25540,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 890,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>When the people of Khaibar dislocated `Abdullah bin `Umar's hands and feet, `Umar got up \ndelivering a sermon saying, \"No doubt, Allah's Messenger (ﷺ) made a contract with the Jews concerning \ntheir properties, and said to them, 'We allow you (to stand in your land) as long as Allah allows you.' \nNow `Abdullah bin `Umar went to his land and was attacked at night, and his hands and feet were \ndislocated, and as we have no enemies there except those Jews, they are our enemies and the only \npeople whom we suspect, I have made up my mind to exile them.\" When `Umar decided to carry out \nhis decision, a son of Abu Al-Haqiq's came and addressed `Umar, \"O chief of the believers, will you \nexile us although Muhammad allowed us to stay at our places, and made a contract with us about our \nproperties, and accepted the condition of our residence in our land?\" `Umar said, \"Do you think that I \nhave forgotten the statement of Allah's Messenger (ﷺ), i.e.: What will your condition be when you are \nexpelled from Khaibar and your camel will be carrying you night after night?\" The Jew replied, \"That \nwas joke from Abul-Qasim.\" `Umar said, \"O the enemy of Allah! You are telling a lie.\" `Umar then \ndrove them out and paid them the price of their properties in the form of fruits, money, camel saddles \nand ropes, etc.\"</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 126561,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 25560,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 892,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) mentioned a person who asked an Israeli man to lend him one-thousand Dinars, and \nthe Israeli lent him the sum for a certain fixed period.</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 126600,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 25570,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 893,
        "hadithText": "<p>\r\nNarrated `Amra:\r\n\r\n<p>Aisha said that Barirah came to seek her help in the writing of her emancipation. `Aisha said to her, \r\n\"If you wish, I will pay your masters (your price) and the wala' will be for me.\" When Allah's Messenger (ﷺ) \r\ncame, she told him about it. The Prophet (ﷺ) said to her, \"Buy her (i.e. Barirah) and manumit (free) her, for the \r\nWala is for the one who manumits.\" Then Allah's Messenger (ﷺ) ascended the pulpit and said, \"What about \r\nthose people who stipulate conditions which are not in Allah's Laws? Whoever stipulates such \r\nconditions as are not in Allah's Laws, then those conditions are invalid even if he stipulated a hundred \r\nsuch conditions.\"</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 126610,
        "last_updated": "2021-03-08 18:54:49"
    },
    {
        "englishURN": 25580,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 894,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"Allah has ninety-nine names, i.e. one-hundred minus one, and whoever knows \nthem will go to Paradise.\" (Please see Hadith No. 419 Vol. 8)</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 126620,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 25590,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 895,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>Umar bin Khattab got some land in Khaibar and he went to the Prophet (ﷺ) to consult him about it saying, \"O Allah's Messenger (ﷺ) I got some land in Khaibar better than which I have never had, what do you suggest that I do with it?\" The Prophet (ﷺ) said, \"If you like you can give the land as endowment and give its fruits in charity.\" So `Umar gave it in charity as an endowment on the condition that would not be sold nor given to anybody as a present and not to be inherited, but its yield would be given in charity to the poor people, to the Kith and kin, for freeing slaves, for Allah's Cause, to the travelers and guests; and that there would be no harm if the guardian of the endowment ate from it according to his need with good intention, and fed others without storing it for the future.\"</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 126630,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 25381,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 874,
        "hadithText": "<p>\nNarrated Marwan and al-Miswar bin Makhrama:\n\n<p>(from the companions of Allah's Messenger (ﷺ)) When Suhail bin `Amr agreed to the Treaty (of Hudaibiya), \none of the things he stipulated then, was that the Prophet (ﷺ) should return to them (i.e. the pagans) \nanyone coming to him from their side, even if he was a Muslim; and would not interfere between \nthem and that person. The Muslims did not like this condition and got disgusted with it. Suhail did not \nagree except with that condition. So, the Prophet (ﷺ) agreed to that condition and returned Abu Jandal to \nhis father Suhail bin `Amr. Thenceforward the Prophet (ﷺ) returned everyone in that period (of truce) \neven if he was a Muslim. During that period some believing women emigrants including Um Kulthum \nbint `Uqba bin Abu Muait who came to Allah's Messenger (ﷺ) and she was a young lady then. Her relative \ncame to the Prophet (ﷺ) and asked him to return her, but the Prophet (ﷺ) did not return her to them for Allah \nhad revealed the following Verse regarding women: \n\"O you who believe! When the believing women come to you as emigrants. Examine them, Allah \nknows best as to their belief, then if you know them for true believers, Send them not back to the \nunbelievers, (for) they are not lawful (wives) for the disbelievers, Nor are the unbelievers lawful \n(husbands) for them (60.10)</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 126390,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 25382,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 874,
        "hadithText": "<p>Narrated `Urwa:<p> Aisha told me, \"Allah's Messenger (ﷺ) used to examine them according to this Verse: \"O \nyou who believe! When the believing women come to you, as emigrants test them . . . for Allah is Oft- \nForgiving, Most Merciful.\" (60.10-12) Aisha said, \"When any of them agreed to that condition Allah's \nApostle would say to her, 'I have accepted your pledge of allegiance.' He would only say that, but, by \nAllah he never touched the hand of any women (i.e. never shook hands with them) while taking the \npledge of allegiance and he never took their pledge of allegiance except by his words (only).</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 126400,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 25551,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 891,
        "hadithText": "<p>\nNarrated Al-Miswar bin Makhrama and Marwan:\n\n<p>(whose narrations attest each other) Allah's Messenger (ﷺ) set out at the time of Al-Hudaibiya (treaty), and \nwhen they proceeded for a distance, he said, \"Khalid bin Al-Walid leading the cavalry of Quraish \nconstituting the front of the army, is at a place called Al-Ghamim, so take the way on the right.\" By \nAllah, Khalid did not perceive the arrival of the Muslims till the dust arising from the march of the \nMuslim army reached him, and then he turned back hurriedly to inform Quraish. The Prophet (ﷺ) went on \nadvancing till he reached the Thaniya (i.e. a mountainous way) through which one would go to them \n(i.e. people of Quraish). The she-camel of the Prophet (ﷺ) sat down. The people tried their best to cause \nthe she-camel to get up but in vain, so they said, \"Al-Qaswa' (i.e. the she-camel's name) has become \nstubborn! Al-Qaswa' has become stubborn!\" The Prophet (ﷺ) said, \"Al-Qaswa' has not become stubborn, \nfor stubbornness is not her habit, but she was stopped by Him Who stopped the elephant.\" Then he \nsaid, \"By the Name of Him in Whose Hands my soul is, if they (i.e. the Quraish infidels) ask me \nanything which will respect the ordinances of Allah, I will grant it to them.\" \nThe Prophet (ﷺ) then rebuked the she-camel and she got up. The Prophet (ﷺ) changed his way till he \ndismounted at the farthest end of Al-Hudaibiya at a pit (i.e. well) containing a little water which the \npeople used in small amounts, and in a short while the people used up all its water and complained to \nAllah's Messenger (ﷺ); of thirst. The Prophet (ﷺ) took an arrow out of his arrow-case and ordered them to put the \narrow in that pit. By Allah, the water started and continued sprouting out till all the people quenched \ntheir thirst and returned with satisfaction. While they were still in that state, Budail bin Warqa-al- \nKhuza`i came with some persons from his tribe Khuza`a and they were the advisers of Allah's Messenger (ﷺ) \nwho would keep no secret from him and were from the people of Tihama. Budail said, \"I left Ka`b bin \nLuai and 'Amir bin Luai residing at the profuse water of Al-Hudaibiya and they had milch camels (or \ntheir women and children) with them, and will wage war against you, and will prevent you from \nvisiting the Ka`ba.\" \nAllah's Messenger (ﷺ) said, \"We have not come to fight anyone, but to perform the `Umra. No doubt, the war \nhas weakened Quraish and they have suffered great losses, so if they wish, I will conclude a truce with \nthem, during which they should refrain from interfering between me and the people (i.e. the 'Arab \ninfidels other than Quraish), and if I have victory over those infidels, Quraish will have the option to \nembrace Islam as the other people do, if they wish; they will at least get strong enough to fight. But if \nthey do not accept the truce, by Allah in Whose Hands my life is, I will fight with them defending my \nCause till I get killed, but (I am sure) Allah will definitely make His Cause victorious.\" Budail said, \"I \nwill inform them of what you have said.\" So, he set off till he reached Quraish and said, \"We have \ncome from that man (i.e. Muhammad) whom we heard saying something which we will disclose to \nyou if you should like.\" Some of the fools among Quraish shouted that they were not in need of this \ninformation, but the wiser among them said, \"Relate what you heard him saying.\" Budail said, \"I \nheard him saying so-and-so,\" relating what the Prophet (ﷺ) had told him. \n`Urwa bin Mas`ud got up and said, \"O people! Aren't you the sons? They said, \"Yes.\" He added, \"Am \nI not the father?\" They said, \"Yes.\" He said, \"Do you mistrust me?\" They said, \"No.\" He said, \"Don't \nyou know that I invited the people of `Ukaz for your help, and when they refused I brought my \nrelatives and children and those who obeyed me (to help you)?\" They said, \"Yes.\" He said, \"Well, this \nman (i.e. the Prophet) has offered you a reasonable proposal, you'd better accept it and allow me to \nmeet him.\" They said, \"You may meet him.\" So, he went to the Prophet (ﷺ) and started talking to him. \nThe Prophet (ﷺ) told him almost the same as he had told Budail. Then `Urwa said, \"O Muhammad! Won't \nyou feel any scruple in extirpating your relations? Have you ever heard of anyone amongst the Arabs \nextirpating his relatives before you? On the other hand, if the reverse should happen, (nobody will aid \nyou, for) by Allah, I do not see (with you) dignified people, but people from various tribes who would \nrun away leaving you alone.\" Hearing that, Abu Bakr abused him and said, \"Do you say we would run \nand leave the Prophet (ﷺ) alone?\" `Urwa said, \"Who is that man?\" They said, \"He is Abu Bakr.\" `Urwa \nsaid to Abu Bakr, \"By Him in Whose Hands my life is, were it not for the favor which you did to me \nand which I did not compensate, I would retort on you.\" `Urwa kept on talking to the Prophet (ﷺ) and \nseizing the Prophet's beard as he was talking while Al-Mughira bin Shu`ba was standing near the head \nof the Prophet, holding a sword and wearing a helmet. Whenever `Urwa stretched his hand towards \nthe beard of the Prophet, Al-Mughira would hit his hand with the handle of the sword and say (to \n`Urwa), \"Remove your hand from the beard of Allah's Messenger (ﷺ).\" `Urwa raised his head and asked, \n\"Who is that?\" The people said, \"He is Al-Mughira bin Shu`ba.\" `Urwa said, \"O treacherous! Am I not \ndoing my best to prevent evil consequences of your treachery?\" \nBefore embracing Islam Al-Mughira was in the company of some people. He killed them and took \ntheir property and came (to Medina) to embrace Islam. The Prophet (ﷺ) said (to him, \"As regards your \nIslam, I accept it, but as for the property I do not take anything of it. (As it was taken through treason). \n`Urwa then started looking at the Companions of the Prophet. By Allah, whenever Allah's Messenger (ﷺ) \nspat, the spittle would fall in the hand of one of them (i.e. the Prophet's companions) who would rub it \non his face and skin; if he ordered them they would carry his orders immediately; if he performed \nablution, they would struggle to take the remaining water; and when they spoke to him, they would \nlower their voices and would not look at his face constantly out of respect. `Urwa returned to his \npeople and said, \"O people! By Allah, I have been to the kings and to Caesar, Khosrau and An- \nNajashi, yet I have never seen any of them respected by his courtiers as much as Muhammad is \nrespected by his companions. \nBy Allah, if he spat, the spittle would fall in the hand of one of them (i.e. the Prophet's companions) \nwho would rub it on his face and skin; if he ordered them, they would carry out his order immediately; \nif he performed ablution, they would struggle to take the remaining water; and when they spoke, they \nwould lower their voices and would not look at his face constantly out of respect.\" `Urwa added, \"No \ndoubt, he has presented to you a good reasonable offer, so please accept it.\" A man from the tribe of \nBani Kinana said, \"Allow me to go to him,\" and they allowed him, and when he approached the \nProphet and his companions, Allah's Messenger (ﷺ) said, \"He is so-and-so who belongs to the tribe that \nrespects the Budn (i.e. camels of the sacrifice). \nSo, bring the Budn in front of him.\" So, the Budn were brought before him and the people received \nhim while they were reciting Talbiya. When he saw that scene, he said, \"Glorified be Allah! It is not \nfair to prevent these people from visiting the Ka`ba.\" When he returned to his people, he said, 'I saw \nthe Budn garlanded (with colored knotted ropes) and marked (with stabs on their backs). I do not think \nit is advisable to prevent them from visiting the Ka`ba.\" Another person called Mikraz bin Hafs got up \nand sought their permission to go to Muhammad, and they allowed him, too. When he approached the \nMuslims, the Prophet (ﷺ) said, \"Here is Mikraz and he is a vicious man.\" Mikraz started talking to the \nProphet and as he was talking, Suhail bin `Amr came. \nWhen Suhail bin `Amr came, the Prophet (ﷺ) said, \"Now the matter has become easy.\" Suhail said to the \nProphet \"Please conclude a peace treaty with us.\" So, the Prophet (ﷺ) called the clerk and said to him, \n\"Write: By the Name of Allah, the most Beneficent, the most Merciful.\" Suhail said, \"As for \n'Beneficent,' by Allah, I do not know what it means. So write: By Your Name O Allah, as you used to \nwrite previously.\" The Muslims said, \"By Allah, we will not write except: By the Name of Allah, the \nmost Beneficent, the most Merciful.\" The Prophet (ﷺ) said, \"Write: By Your Name O Allah.\" Then he \ndictated, \"This is the peace treaty which Muhammad, Allah's Messenger (ﷺ) has concluded.\" Suhail said, \"By \nAllah, if we knew that you are Allah's Messenger (ﷺ) we would not prevent you from visiting the Ka`ba, and \nwould not fight with you. So, write: \"Muhammad bin `Abdullah.\" The Prophet (ﷺ) said, \"By Allah! I am \nApostle of Allah even if you people do not believe me. Write: Muhammad bin `Abdullah.\" \n(Az-Zuhri said, \"The Prophet (ﷺ) accepted all those things, as he had already said that he would accept \neverything they would demand if it respects the ordinance of Allah, (i.e. by letting him and his \ncompanions perform `Umra.)\" The Prophet (ﷺ) said to Suhail, \"On the condition that you allow us to visit \nthe House (i.e. Ka`ba) so that we may perform Tawaf around it.\" Suhail said, \"By Allah, we will not \n(allow you this year) so as not to give chance to the 'Arabs to say that we have yielded to you, but we \nwill allow you next year.\" So, the Prophet (ﷺ) got that written. \nThen Suhail said, \"We also stipulate that you should return to us whoever comes to you from us, even \nif he embraced your religion.\" The Muslims said, \"Glorified be Allah! How will such a person be \nreturned to the pagans after he has become a Muslim? While they were in this state Abu- Jandal bin \nSuhail bin `Amr came from the valley of Mecca staggering with his fetters and fell down amongst the \nMuslims. Suhail said, \"O Muhammad! This is the very first term with which we make peace with you, \ni.e. you shall return Abu Jandal to me.\" The Prophet (ﷺ) said, \"The peace treaty has not been written yet.\" \nSuhail said, \"I will never allow you to keep him.\" The Prophet (ﷺ) said, \"Yes, do.\" He said, \"I won't do.: \nMikraz said, \"We allow you (to keep him).\" Abu Jandal said, \"O Muslims! Will I be returned to the \npagans though I have come as a Muslim? Don't you see how much I have suffered?\" \n(continued...) \n(continuing... 1): -3.891:... ... \nAbu Jandal had been tortured severely for the Cause of Allah. `Umar bin Al-Khattab said, \"I went to \nthe Prophet (ﷺ) and said, 'Aren't you truly the Messenger of Allah?' The Prophet (ﷺ) said, 'Yes, indeed.' I said, \n'Isn't our Cause just and the cause of the enemy unjust?' He said, 'Yes.' I said, 'Then why should we be \nhumble in our religion?' He said, 'I am Allah's Messenger (ﷺ) and I do not disobey Him, and He will make \nme victorious.' I said, 'Didn't you tell us that we would go to the Ka`ba and perform Tawaf around it?' \nHe said, 'Yes, but did I tell you that we would visit the Ka`ba this year?' I said, 'No.' He said, 'So you \nwill visit it and perform Tawaf around it?' \" `Umar further said, \"I went to Abu Bakr and said, 'O Abu \nBakr! Isn't he truly Allah's Prophet?' He replied, 'Yes.' I said, 'Then why should we be humble in our \nreligion?' He said, 'Indeed, he is Allah's Messenger (ﷺ) and he does not disobey his Lord, and He will make \nhim victorious. Adhere to him as, by Allah, he is on the right.' I said, 'Was he not telling us that we \nwould go to the Ka`ba and perform Tawaf around it?' He said, 'Yes, but did he tell you that you would \ngo to the Ka`ba this year?' I said, 'No.' He said, \"You will go to Ka`ba and perform Tawaf around it.\" \n(Az-Zuhri said, \" `Umar said, 'I performed many good deeds as expiation for the improper questions I \nasked them.' \") \nWhen the writing of the peace treaty was concluded, Allah's Messenger (ﷺ) said to his companions, \"Get up \nand' slaughter your sacrifices and get your head shaved.\" By Allah none of them got up, and the \nProphet repeated his order thrice. When none of them got up, he left them and went to Um Salama and \ntold her of the people's attitudes towards him. Um Salama said, \"O the Prophet (ﷺ) of Allah! Do you want \nyour order to be carried out? Go out and don't say a word to anybody till you have slaughtered your \nsacrifice and call your barber to shave your head.\" So, the Prophet (ﷺ) went out and did not talk to anyone \nof them till he did that, i.e. slaughtered the sacrifice and called his barber who shaved his head. Seeing \nthat, the companions of the Prophet (ﷺ) got up, slaughtered their sacrifices, and started shaving the heads \nof one another, and there was so much rush that there was a danger of killing each other. Then some \nbelieving women came (to the Prophet (ﷺ) ); and Allah revealed the following Divine Verses:-- \n\"O you who believe, when the believing women come to you as emigrants examine them . . .\" (60.10) \n`Umar then divorced two wives of his who were infidels. Later on Muawiya bin Abu Sufyan married \none of them, and Safwan bin Umaiya married the other. When the Prophet (ﷺ) returned to Medina, Abu \nBasir, a new Muslim convert from Quraish came to him. The Infidels sent in his pursuit two men who \nsaid (to the Prophet (ﷺ) ), \"Abide by the promise you gave us.\" So, the Prophet (ﷺ) handed him over to them. \nThey took him out (of the City) till they reached Dhul-Hulaifa where they dismounted to eat some \ndates they had with them. Abu Basir said to one of them, \"By Allah, O so-and-so, I see you have a \nfine sword.\" The other drew it out (of the scabbard) and said, \"By Allah, it is very fine and I have tried \nit many times.\" Abu Basir said, \"Let me have a look at it.\" \nWhen the other gave it to him, he hit him with it till he died, and his companion ran away till he came \nto Medina and entered the Mosque running. When Allah's Messenger (ﷺ) saw him he said, \"This man \nappears to have been frightened.\" When he reached the Prophet (ﷺ) he said, \"My companion has been \nmurdered and I would have been murdered too.\" Abu Basir came and said, \"O Allah's Messenger (ﷺ), by \nAllah, Allah has made you fulfill your obligations by your returning me to them (i.e. the Infidels), but \nAllah has saved me from them.\" The Prophet (ﷺ) said, \"Woe to his mother! what excellent war kindler he \nwould be, should he only have supporters.\" When Abu Basir heard that he understood that the Prophet (ﷺ) \nwould return him to them again, so he set off till he reached the seashore. Abu Jandal bin Suhail got \nhimself released from them (i.e. infidels) and joined Abu Basir. So, whenever a man from Quraish \nembraced Islam he would follow Abu Basir till they formed a strong group. By Allah, whenever they \nheard about a caravan of Quraish heading towards Sham, they stopped it and attacked and killed them \n(i.e. infidels) and took their properties. The people of Quraish sent a message to the Prophet (ﷺ) \nrequesting him for the Sake of Allah and Kith and kin to send for (i.e. Abu Basir and his companions) \npromising that whoever (amongst them) came to the Prophet (ﷺ) would be secure. So the Prophet (ﷺ) sent for \nthem (i.e. Abu Basir's companions) and Allah I revealed the following Divine Verses: \n\"And it is He Who Has withheld their hands from you and your hands From them in the midst of \nMecca, After He made you the victorious over them. ... the unbelievers had pride and haughtiness, in \ntheir hearts ... the pride and haughtiness of the time of ignorance.\" (48.24-26) And their pride and \nhaughtiness was that they did not confess (write in the treaty) that he (i.e. Muhammad) was the \nProphet of Allah and refused to write: \"In the Name of Allah, the most Beneficent, the Most \nMerciful,\" and they (the mushriks) prevented them (the Muslims) from visiting the House (the Ka`bah).</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 126580,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 25552,
        "collection": "bukhari",
        "volumeNumber": 3,
        "bookNumber": 50,
        "bookName": "Conditions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 891,
        "hadithText": "<p> Narrated Az-Zuhri: <p>`Urwa said, \"Aisha told me that Allah's Messenger (ﷺ) used to examine the women \nemigrants. We have been told also that when Allah revealed the order that the Muslims should return \nto the pagans what they had spent on their wives who emigrated (after embracing Islam) and that the \nMuslims should not keep unbelieving women as their wives, `Umar divorced two of his wives, \nQariba, the daughter of Abu Umayyah and the daughter of Jarwal Al-Khuza`i. Later on Mu`awiya \nmarried Qariba and Abu Jahm married the other.\" \nWhen the pagans refused to pay what the Muslims had spent on their wives, Allah revealed: \"And if \nany of your wives have gone from you to the unbelievers and you have an accession (by the coming \nover of a woman from the other side) (then pay to those whose wives have gone) the equivalent of \nwhat they had spent (on their Mahr).\" (60.11) \nSo, Allah ordered that the Muslim whose wife has gone, should be given, as a compensation of the \nMahr he had given to his wife, from the Mahr of the wives of the pagans who had emigrated deserting \ntheir husbands. \nWe do not know any of the women emigrants who deserted Islam after embracing it. We have also \nbeen told that Abu Basir bin Asid Ath-Thaqafi came to the Prophet (ﷺ) as a Muslim emigrant during the \ntruce. Al-Akhnas bin Shariq wrote to the Prophet (ﷺ) requesting him to return Abu Basir.</b>",
        "bookID": "50.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 126590,
        "last_updated": "2015-03-23 10:39:26"
    }
]