[
    {
        "englishURN": 28880,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 324,
        "hadithText": "<p>\nNarrated `Ali:\n\n<p>I got a she-camel in my share of the war booty on the day (of the battle) of Badr, and the Prophet (ﷺ) had \ngiven me a she-camel from the Khumus. When I intended to marry Fatima, the daughter of Allah's \nApostle, I had an appointment with a goldsmith from the tribe of Bani Qainuqa' to go with me to bring \nIdhkhir (i.e. grass of pleasant smell) and sell it to the goldsmiths and spend its price on my wedding \nparty. I was collecting for my she-camels equipment of saddles, sacks and ropes while my two shecamels \nwere kneeling down beside the room of an Ansari man. I returned after collecting whatever I \ncollected, to see the humps of my two she-camels cut off and their flanks cut open and some portion \nof their livers was taken out. When I saw that state of my two she-camels, I could not help weeping. I \nasked, \"Who has done this?\" The people replied, \"Hamza bin `Abdul Muttalib who is staying with \nsome Ansari drunks in this house.\" I went away till I reached the Prophet (ﷺ) and Zaid bin Haritha was \nwith him. The Prophet (ﷺ) noticed on my face the effect of what I had suffered, so the Prophet (ﷺ) asked. \n\"What is wrong with you.\" I replied, \"O Allah's Messenger (ﷺ)! I have never seen such a day as today. \nHamza attacked my two she-camels, cut off their humps, and ripped open their flanks, and he is sitting \nthere in a house in the company of some drunks.\" The Prophet (ﷺ) then asked for his covering sheet, put it \non, and set out walking followed by me and Zaid bin Haritha till he came to the house where Hamza \nwas. He asked permission to enter, and they allowed him, and they were drunk. Allah's Messenger (ﷺ) started \nrebuking Hamza for what he had done, but Hamza was drunk and his eyes were red. Hamza looked at \nAllah's Messenger (ﷺ) and then he raised his eyes, looking at his knees, then he raised up his eyes looking at \nhis umbilicus, and again he raised up his eyes look in at his face. Hamza then said, \"Aren't you but the \nslaves of my father?\" Allah's Messenger (ﷺ) realized that he was drunk, so Allah's Messenger (ﷺ) retreated, and we \nwent out with him.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 128080,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 28890,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 325,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>(mother of the believers) After the death of Allah 's Apostle Fatima the daughter of Allah's Messenger (ﷺ) \nasked Abu Bakr As-Siddiq to give her, her share of inheritance from what Allah's Messenger (ﷺ) had left of \nthe Fai (i.e. booty gained without fighting) which Allah had given him. Abu Bakr said to her, \"Allah's \nApostle said, 'Our property will not be inherited, whatever we (i.e. prophets) leave is Sadaqa (to be \nused for charity).\" Fatima, the daughter of Allah's Messenger (ﷺ) got angry and stopped speaking to Abu \nBakr, and continued assuming that attitude till she died. Fatima remained alive for six months after the \ndeath of Allah's Messenger (ﷺ). \nShe used to ask Abu Bakr for her share from the property of Allah's Messenger (ﷺ) which he left at Khaibar, \nand Fadak, and his property at Medina (devoted for charity). Abu Bakr refused to give her that \nproperty and said, \"I will not leave anything Allah's Messenger (ﷺ) used to do, because I am afraid that if I \nleft something from the Prophet's tradition, then I would go astray.\" (Later on) `Umar gave the \nProphet's property (of Sadaqa) at Medina to `Ali and `Abbas, but he withheld the properties of \nKhaibar and Fadak in his custody and said, \"These two properties are the Sadaqa which Allah's \nApostle used to use for his expenditures and urgent needs. Now their management is to be entrusted to \nthe ruler.\" (Az-Zuhri said, \"They have been managed in this way till today.\")</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 128091,
        "last_updated": "2013-05-03 20:51:30"
    },
    {
        "englishURN": 28900,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 326,
        "hadithText": "<p>\nNarrated Malik bin Aus:\n\n<p>While I was at home, the sun rose high and it got hot. Suddenly the messenger of `Umar bin Al- \nKhattab came to me and said, \"The chief of the believers has sent for you.\" So, I went along with him \ntill I entered the place where `Umar was sitting on a bedstead made of date-palm leaves and covered \nwith no mattress, and he was leaning over a leather pillow. I greeted him and sat down. He said, \"O \nMali! Some persons of your people who have families came to me and I have ordered that a gift \nshould be given to them, so take it and distribute it among them.\" I said, \"O chief of the believers! I \nwish that you order someone else to do it.\" He said, \"O man! Take it.\" While I was sitting there with \nhim, his doorman Yarfa' came saying, \"`Uthman, `Abdur-Rahman bin `Auf, Az-Zubair and Sa`d bin \nAbi Waqqas are asking your permission (to see you); may I admit them?\" \n`Umar said, \"Yes\", So they were admitted and they came in, greeted him, and sat down. After a while \nYarfa' came again and said, \"May I admit `Ali and `Abbas?\" `Umar said, \"yes.\" So, they were \nadmitted and they came in and greeted (him) and sat down. Then `Abbas said, \"O chief of the \nbelievers! Judge between me and this (i.e. `Ali).\" They had a dispute regarding the property of Bani \nAn-Nadir which Allah had given to His Apostle as Fai. The group (i.e. `Uthman and his companions) \nsaid, \"O chief of the believers! Judge between them and relieve both of them front each other.\" `Umar \nsaid, \"Be patient! I beseech you by Allah by Whose Permission the Heaven and the Earth exist, do \nyou know that Allah's Messenger (ﷺ) said, 'Our (i.e. prophets') property will not be inherited, and whatever \nwe leave, is Sadaqa (to be used for charity),' and Allah's Messenger (ﷺ) meant himself (by saying \"we'')?\" \nThe group said, \"He said so.\" `Umar then turned to `Ali and `Abbas and said, \"I beseech you by Allah, \ndo you know that Allah's Messenger (ﷺ) said so?\" They replied, \" He said so.\" `Umar then said, \"So, I will \ntalk to you about this matter. Allah bestowed on His Apostle with a special favor of something of this \nFai (booty) which he gave to nobody else.\" `Umar then recited the Holy Verses: \"What Allah \nbestowed as (Fai) Booty on his Apostle (Muhammad) from them --- for this you made no expedition \nwith either cavalry or camelry: But Allah gives power to His Apostles over whomever He will 'And \nAllah is able to do all things.\" 9:6) \n`Umar added \"So this property was especially given to Allah's Messenger (ﷺ), but, by Allah, neither did he \ntake possession of it and leave your, nor did he favor himself with it to your exclusion, but he gave it \nto all of you and distributed it amongst you till this property remained out of it. Allah's Messenger (ﷺ) used \nto spend the yearly expenses of his family out of this property and used to keep the rest of its revenue \nto be spent on Allah 's Cause. Allah 's Apostle kept on doing this during all his lifetime. I ask you by \nAllah do you know this?\" They replies in the affirmative. `Umar then said to `Ali and `Abbas. \"I ask \nyou by Allah, do you know this?\" `Umar added, \"When Allah had taken His Prophet unto Him, 'Abu \nBakr said, 'I am the successor of Allah's Messenger (ﷺ) so, Abu Bakr took over that property and managed it \nin the same way as Allah's Messenger (ﷺ) used to do, and Allah knows that he was true, pious and rightlyguided, \nand he was a follower of what was right. \nThen Allah took Abu Bakr unto Him and I became Abu Bakr's successor, and I kept that property in \nmy possession for the first two years of my Caliphate, managing it in the same way as Allah's Messenger (ﷺ) \nused to do and as Abu Bakr used to do, and Allah knows that I have been true, pious, rightly guided, \nand a follower of what is right. Now you both (i.e. 'Ah and `Abbas) came to talk to me, bearing the \nsame claim and presenting the same case; you, `Abbas, came to me asking for your share from your \nnephew's property, and this man, i.e. `Ali, came to me asking for his wife's share from her father's \nproperty. I told you both that Allah's Messenger (ﷺ) said, 'Our (prophets') properties are not to be inherited, \nbut what we leave is Sadaqa (to be used for charity).' \nWhen I thought it right that I should hand over this property to you, I said to you, 'I am ready to hand \nover this property to you if you wish, on the condition that you would take Allah's Pledge and \nConvention that you would manage it in the same way as Allah's Messenger (ﷺ) used to, and as Abu Bakr \nused to do, and as I have done since I was in charge of it.' So, both of you said (to me), 'Hand it over \nto us,' and on that condition I handed it over to you. So, I ask you by Allah, did I hand it over to them \non this condition?\" The group aid, \"Yes.\" Then `Umar faced `Ali and `Abbas saying, \"I ask you by \nAllah, did I hand it over to you on this condition?\" They said, \"Yes. \" He said, \" Do you want now to \ngive a different decision? By Allah, by Whose Leave both the Heaven and the Earth exist, I will never \ngive any decision other than that (I have already given). And if you are unable to manage it, then \nreturn it to me, and I will do the job on your behalf.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 128110,
        "last_updated": "2013-05-03 20:59:21"
    },
    {
        "englishURN": 28910,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 327,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>The delegates of the tribe of `Abdul-Qais came and said, \"O Allah's Messenger (ﷺ)! We are from the tribe of \nRabi`a, and there is the infidels of the tribe of Mudar intervening between you and us, so we cannot \ncome to you except in the Sacred Months. So please order us some instructions that we may apply it to \nourselves and also invite our people whom we left behind us to observe as well.\" The Prophet (ﷺ) said, \"I \norder you (to do) four (things) and forbid you (to do) four: I order you to believe in Allah, that is, to \ntestify that None has the right to be worshipped but Allah (the Prophet (ﷺ) pointed with his hand); to offer \nprayers perfectly; to pay Zakat; to fast the month of Ramadan, and to pay the Khumus (i.e. one-fifth) \nof the war booty to Allah and I forbid you to use Ad-dubba', An-Naqir, Al-Hantam and Al-Muzaffat \n(i.e. utensils used for preparing alcoholic drinks).\" (See Hadith No. 50, Vol. 1).</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 128120,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 28920,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 328,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"My heirs should not take even a single Dinar (i.e. anything from my property), \nand whatever I leave, excluding the expenditure of my wives and my laborers, will be Sadaqa (i.e. be \nused for charity).\"'</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 128130,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 28930,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 329,
        "hadithText": "<p>\nNarrated Aisha:\n\n<p>Allah's Messenger (ﷺ) died, and there was nothing in my house that a living being could eat, except some \nbarley Lying on a shelf. So, I ate of it for a long period and measured it, and (after a short period) it \nwas consumed.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 128140,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 28940,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 330,
        "hadithText": "<p>\nNarrated `Amr bin Al-Harith:\n\n<p>The Prophet (ﷺ) did not leave anything (after his death) except his arms, a white mule, and a (piece of) \nland which he had given as Sadaqa.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 128150,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 28950,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 331,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>(the wife of the Prophet) When the sickness of Allah's Messenger (ﷺ) got aggravated, he asked the \npermission of his wives that he should be treated in my house, and they permitted him.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 128160,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 28960,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 332,
        "hadithText": "<p>\nNarrated Ibn Abu Mulaika:\n\n<p>`Aisha said, \"The Prophet (ﷺ) died in my house on the day of my turn while he was leaning on my chest \ncloser to my neck, and Allah made my saliva mix with his Saliva.\" `Aisha added, \"`AbdurRahman \ncame with a Siwak and the Prophet (ﷺ) was too weak to use it so I took it, chewed it and then (gave it to \nhim and he) cleaned his teeth with it.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 128170,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 28970,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 333,
        "hadithText": "<p>\nNarrated Safiya:\n\n<p>(the wife of the Prophet) That she came to visit Allah's Messenger (ﷺ) while he was in I`tikaf (i.e. seclusion \nin the Mosque during the last ten days of Ramadan). When she got up to return, Allah's Messenger (ﷺ) got up \nwith her and accompanied her, and when he reached near the gate of the Mosque close to the door (of \nthe house) of Um Salama, the wife of the Prophet, two Ansari men passed by them and greeted Allah's \nApostle and then went away. Allah's Messenger (ﷺ) addressed them saying, \"Don't hurry! (She is my wife),\" \nThey said, \"Glorified be Allah! O Allah's Messenger (ﷺ) (You are far away from any suspicion),\" and his \nsaying was hard on them. Allah's Messenger (ﷺ) said, \"Satan circulates in the mind of a person as blood does \n(in his body). I was afraid that Satan might put some (evil) thoughts in your minds.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 128180,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 28980,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 334,
        "hadithText": "<p>\nNarrated `Abdullah bin `Umar:\n\n<p>Once I went upstairs in Hafsa's house and saw the Prophet (ﷺ) answering the call of nature with his back \ntowards the Qibla and facing Sham.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 128190,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 28990,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 335,
        "hadithText": "<p>\nNarrated Aisha:\n\n<p>That Allah's Messenger (ﷺ) used to offer the `Asr prayer while the sun was still shining in her Hujra (i.e. her \ndwelling place).</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 128200,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29000,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 336,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>The Prophet (ﷺ) stood up and delivered a sermon, and pointing to `Aisha's house (i.e. eastwards), he said \nthrice, \"Affliction (will appear from) here,\" and, \"from where the side of the Satan's head comes out \n(i.e. from the East).</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 128210,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29010,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 337,
        "hadithText": "<p>\nNarrated `Amra bint `Abdur-Rahman:\n\n<p>`Aisha, the wife of the Prophet (ﷺ) told her that once Allah's Messenger (ﷺ) was with her and she heard \nsomebody asking permission to enter Hafsa's house. She said, \"O Allah's Messenger (ﷺ)! This man is asking \npermission to enter your house.\" Allah's Messenger (ﷺ) replied, \"I think he is so-and-so (meaning the foster \nuncle of Hafsa). What is rendered illegal because of blood relations, is also rendered illegal because of \nthe corresponding foster-relations.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 128220,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29020,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 338,
        "hadithText": "<p>\nNarrated Anas:\n\n<p>That when Abu Bakr became the Caliph, he sent him to Bahrain and wrote this letter for him, and \nstamped it with the Ring of the Prophet. Three lines were engraved on the Ring, (the word) \n'Muhammad' was in a line, 'Apostle' was in another line, and 'Allah' in a third.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 128230,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29030,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 339,
        "hadithText": "<p>\nNarrated `Isa bin Tahman:\n\n<p>Anas brought out to us two worn out leather shoes without hair and with pieces of leather straps. Later \non Thabit Al-Banani told me that Anas said that they were the shoes of the Prophet.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 128240,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29040,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 340,
        "hadithText": "<p>\nNarrated Abu Burda:\n\n<p>`Aisha brought out to us a patched wool Len garment, and she said, \"(It chanced that) the soul of \nAllah's Messenger (ﷺ) was taken away while he was wearing this.\" Abu-Burda added, \"Aisha brought out to \nus a thick waist sheet like the ones made by the Yemenites, and also a garment of the type called Al- \nMulabbada.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 128250,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29050,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 341,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>When the cup of Allah's Messenger (ﷺ) got broken, he fixed it with a silver wire at the crack. (The subnarrator, \n`Asim said, \"I saw the cup and drank (water) in it.\")</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 128260,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29060,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 342,
        "hadithText": "<p>\nNarrated `Ali bin Al-Husain:\n\n<p>That when they reached Medina after returning from Yazid bin Mu'awaiya after the martyrdom of \nHusain bin `Ali (may Allah bestow His Mercy upon him), Al-Miswar bin Makhrama met him and said \nto him, \"Do you have any need you may order me to satisfy?\" `Ali said, \"No.\" Al-Miswar said, Will \nyou give me the sword of Allah's Messenger (ﷺ) for I am afraid that people may take it from you by force? \nBy Allah, if you give it to me, they will never be able to take it till I die.\" When `Ali bin Abu Talib \ndemanded the hand of the daughter of Abi Jahal to be his wife besides Fatima, I heard Allah's Messenger (ﷺ) \non his pulpit delivering a sermon in this connection before the people, and I had then attained my age \nof puberty. Allah's Messenger (ﷺ) said, \"Fatima is from me, and I am afraid she will be subjected to trials in \nher religion (because of jealousy).\" The Prophet (ﷺ) then mentioned one of his son-in-law who was from \nthe tribe of 'Abu Shams, and he praised him as a good son-in-law, saying, \"Whatever he said was the \ntruth, and he promised me and fulfilled his promise. I do not make a legal thing illegal, nor do I make \nan illegal thing legal, but by Allah, the daughter of Allah's Messenger (ﷺ) and the daughter of the enemy of \nAllah, (i.e. Abu Jahl) can never get together (as the wives of one man) (See Hadith No. 76, Vo. 5).</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 128270,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29080,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 344,
        "hadithText": "<p>\nNarrated `Ali:\n\n<p>Fatima complained of what she suffered from the hand mill and from grinding, when she got the news \nthat some slave girls of the booty had been brought to Allah's Messenger (ﷺ). She went to him to ask for a \nmaid-servant, but she could not find him, and told `Aisha of her need. When the Prophet (ﷺ) came, Aisha \ninformed him of that. The Prophet (ﷺ) came to our house when we had gone to our beds. (On seeing the \nProphet) we were going to get up, but he said, 'Keep at your places,' I felt the coolness of the Prophet's \nfeet on my chest. Then he said, \"Shall I tell you a thing which is better than what you asked me for? \nWhen you go to your beds, say: 'Allahu Akbar (i.e. Allah is Greater)' for 34 times, and 'Al hamdu Li llah \n(i.e. all the praises are for Allah)' for 33 times, and Subhan Allah (i.e. Glorified be Allah) for 33 \ntimes. This is better for you than what you have requested.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 128300,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29090,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 345,
        "hadithText": "<p>\nNarrated Jabir bin `Abdullah Al-Ansari:\n\n<p>A man amongst us begot a boy whom he named Al-Qasim. On that the Ansar said, (to the man), \"We \nwill never call you Abu-al-Qasim and will never please you with this blessed title.\" So, he went to the \nProphet and said, \"O Allah's Messenger (ﷺ)! I have begotten a boy whom I named Al-Qasim and the Ansar \nsaid, 'We will never call you Abu-al-Qasim, nor will we please you with this title.' \" The Prophet (ﷺ) said, \n\"The Ansar have done well. Name by my name, but do not name by my Kunya, for I am Qasim.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 128320,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29110,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 347,
        "hadithText": "<p>\nNarrated Khaula Al-Ansariya:\n\n<p>I heard Allah's Messenger (ﷺ) saying, \"Some people spend Allah's Wealth (i.e. Muslim's wealth) in an unjust \nmanner; such people will be put in the (Hell) Fire on the Day of Resurrection.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 128350,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29120,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 348,
        "hadithText": "<p>\nNarrated `Urwa-al-Bariqi:\n\n<p>The Prophet (ﷺ) said, \"Horses are always the source of good, namely, rewards (in the Hereafter) and \nbooty, till the Day of Resurrection.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 128360,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29130,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 349,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"When Khosrau is ruined, there will be no Khosrau after him; and when Caesar \nis ruined, there will be no Caesar after him. By Him in Whose Hands my life is, you will spend their \ntreasures in Allah's Cause.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 128370,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29140,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 350,
        "hadithText": "<p>\nNarrated Jabir bin Samura:\n\n<p>Allah's Messenger (ﷺ) said, \"When Khosrau is ruined, there will be no Khosrau after him; and when Caesar \nis ruined, their will be no Caesar after him. By Him in Whose Hands my life is, you will spend their \ntreasures in Allah's Cause.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 128380,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29150,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 351,
        "hadithText": "<p>\nNarrated Jabir bin `Abdullah:\n\n<p>Allah's Messenger (ﷺ) said, \"Booty has been made legal for me.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 128390,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29160,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 352,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"Allah guarantees him who strives in His Cause and whose motivation for going \nout is nothing but Jihad in His Cause and belief in His Word, that He will admit him into Paradise (if \nmartyred) or bring him back to his dwelling place, whence he has come out, with what he gains of \nreward and booty.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 128400,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29170,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 353,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"A prophet amongst the prophets carried out a holy military expedition, so he said \nto his followers, 'Anyone who has married a woman and wants to consummate the marriage, and has \nnot done so yet, should not accompany me; nor should a man who has built a house but has not \ncompleted its roof; nor a man who has sheep or shecamels and is waiting for the birth of their young \nones.' So, the prophet carried out the expedition and when he reached that town at the time or nearly at \nthe time of the `Asr prayer, he said to the sun, 'O sun! You are under Allah's Order and I am under \nAllah's Order O Allah! Stop it (i.e. the sun) from setting.' It was stopped till Allah made him \nvictorious. \nThen he collected the booty and the fire came to burn it, but it did not burn it. He said (to his men), \n'Some of you have stolen something from the booty. So one man from every tribe should give me a \npledge of allegiance by shaking hands with me.' (They did so and) the hand of a man got stuck over \nthe hand of their prophet. Then that prophet said (to the man), 'The theft has been committed by your \npeople. So all the persons of your tribe should give me the pledge of allegiance by shaking hands with \nme.' The hands of two or three men got stuck over the hand of their prophet and he said, \"You have \ncommitted the theft.' Then they brought a head of gold like the head of a cow and put it there, and the \nfire came and consumed the booty. The Prophet (ﷺ) added: Then Allah saw our weakness and disability, \nso he made booty legal for us.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 128410,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29180,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 354,
        "hadithText": "<p>\nNarrated Aslam:\n\n<p>`Umar said, \"Were it not for those Muslims who have not come to existence yet, I would have \ndistributed (the land of) every town I conquer among the fighters as the Prophet (ﷺ) distributed the land of \nKhaibar.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 128420,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29190,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 355,
        "hadithText": "<p>\nNarrated Abu Musa Al-Ash`ari:\n\n<p>A bedouin asked the Prophet, \"A man may fight for the sake of booty, and another may fight so that \nhe may be mentioned by the people, and a third may fight to show his position (i.e. bravery); which of \nthese regarded as fighting in Allah's Cause?\" The Prophet (ﷺ) said, \"He who fights so that Allah's Word \n(i.e. Islam) should be superior, fights for Allah's Cause.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 128430,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29200,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 356,
        "hadithText": "<p>\nNarrated `Abdullah bin Abu Mulaika:\n\n<p>Some silken cloaks with golden buttons were presented to the Prophet. He distributed them amongst \nhis companions and kept one for Makhrama, bin Naufal. Later on Makhrama came along with his son \nAl-Miswar bin Makhrama, and stood up at the gate and said (to his son). \"Call him (i.e. the Prophet) \nto me.\" The Prophet (ﷺ) heard his voice, took a silken cloak and brought it to him, placing those golden \nbuttons in front of him saying, \"O Abu-al-Miswar! I have kept this aside for you! O Abu-al Miswar! I \nhave kept this aside for you!\" Makhrama was a bad-tempered man.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 128440,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29210,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 357,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>People used to give some of their datepalms to the Prophet (as a gift), till he conquered Bani Quraiza \nand Bani An-Nadir, whereupon he started returning their favors.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 128450,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29220,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 358,
        "hadithText": "<p>\nNarrated `Abdullah bin Az-Zubair:\n\n<p>When Az-Zubair got up during the battle of Al-Jamal, he called me and I stood up beside him, and he \nsaid to me, \"O my son! Today one will be killed either as an oppressor or as an oppressed one. I see \nthat I will be killed as an oppressed one. My biggest worry is my debts. Do you think, if we pay the \ndebts, there will be something left for us from our money?\" Az-Zubair added, \"O my son! Sell our \nproperty and pay my debts.\" Az-Zubair then willed one-third of his property and willed one-third of \nthat portion to his sons; namely, `Abdullah's sons. He said, \"One-third of the one third. If any property \nis left after the payment of the debts, one-third (of the one-third of what is left) is to be given to your \nsons.\" (Hisham, a sub-narrator added, \"Some of the sons of `Abdullah were equal in age to the sons of \nAz-Zubair e.g. Khubaib and `Abbas. `Abdullah had nine sons and nine daughters at that time.\" (The \nnarrator `Abdullah added:) My father (Az-Zubair) went on drawing my attention to his debts saying, \n\"If you should fail to pay part of the debts, appeal to my Master to help you.\" By Allah! I could not \nunderstand what he meant till I asked, \"O father! Who is your Master?\" He replied, \"Allah (is my \nMaster).\" \nBy Allah, whenever I had any difficulty regarding his debts, I would say, \"Master of Az-Zubair! Pay \nhis debts on his behalf .\" and Allah would (help me to) pay it. Az-Zubair was martyred leaving no \nDinar or Dirham but two pieces of land, one of which was (called) Al-Ghaba, and eleven houses in \nMedina, two in Basra, one in Kufa and one in Egypt. In fact, the source of the debt which he owed \nwas, that if somebody brought some money to deposit with him. Az-Zubair would say, \"No, (i won't \nkeep it as a trust), but I take it as a debt, for I am afraid it might be lost.\" Az-Zubair was never \nappointed governor or collector of the tax of Kharaj or any other similar thing, but he collected his \nwealth (from the war booty he gained) during the holy battles he took part in, in the company of the \nProphet, Abu Bakr, `Umar, and `Uthman. (`Abdullah bin Az-Zubair added:) When I counted his debt, \nit turned to be two million and two hundred thousand. (The sub-narrator added:) Hakim bin Hizam \nmet `Abdullah bin Zubair and asked, \"O my nephew! How much is the debt of my brother?\" \n`Abdullah kept it as a secret and said, \"One hundred thousand,\" Hakim said, \"By Allah! I don't think \nyour property will cover it.\" On that `Abdullah said to him, \"What if it is two million and two hundred \nthousand?\" \nHakim said, \"I don't think you can pay it; so if you are unable to pay all of it, I will help you.\" Az- \nZubair had already bought Al-Ghaba for one hundred and seventy thousand. `Abdullah sold it for one \nmillion and six hundred thousand. Then he called the people saying, \"Any person who has any money \nclaim on Az-Zubair should come to us in Al-Ghaba.\" There came to him `Abdullah bin Ja`far whom \nAz-Zubair owed four hundred thousand. He said to `Abdullah bin Az-Zubair, \"If you wish I will \nforgive you the debt.\" `Abdullah (bin Az-Zubair) said, \"No.\" Then Ibn Ja`far said, \"If you wish you \ncan defer the payment if you should defer the payment of any debt.\" Ibn Az-Zubair said, \"No.\" \n`Abdullah bin Ja`far said, \"Give me a piece of the land.\" `Abdullah bin AzZubair said (to him), \n\"Yours is the land extending from this place to this place.\" So, `Abdullah bin Az-Zubair sold some of \nthe property (including the houses) and paid his debt perfectly, retaining four and a half shares from \nthe land (i.e. Al-Ghaba). He then went to Mu'awlya while `Amr bin `Uthman, Al-Mundhir bin Az- \nZubair and Ibn Zam`a were sitting with him. Mu'awiya asked, \"At what price have you appraised Al- \nGhaba?\" He said, \"One hundred thousand for each share,\" Muawiya asked, \"How many shares have \nbeen left?\" `Abdullah replied, \"Four and a half shares.\" \nAl-Mundhir bin Az-Zubair said, \"I would like to buy one share for one hundred thousand.\" `Amr bin \n`Uthman said, \"I would like to buy one share for one hundred thousand.\" Ibn Zam`a said, \"I would \nlike to buy one share for one hundred thousand.\" Muawiya said, \"How much is left now?\" `Abdullah \nreplied, \"One share and a half.\" Muawiya said, \"I would like to buy it for one hundred and fifty \nthousand.\" `Abdullah also sold his part to Muawiya six hundred thousand. When Ibn AzZubair had \npaid all the debts. Az-Zubair's sons said to him, \"Distribute our inheritance among us.\" He said, \"No, \nby Allah, I will not distribute it among you till I announce in four successive Hajj seasons, 'Would \nthose who have money claims on Az-Zubair come so that we may pay them their debt.\" So, he started \nto announce that in public in every Hajj season, and when four years had elapsed, he distributed the \ninheritance among the inheritors. Az-Zubair had four wives, and after the one-third of his property \nwas excluded (according to the will), each of his wives received one million and two hundred \nthousand. So the total amount of his property was fifty million and two hundred thousand.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 128460,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29230,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 359,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>`Uthman did not join the Badr battle because he was married to one of the daughters of Allah's \nApostle and she was ill. So, the Prophet (ﷺ) said to him. \"You will get a reward and a share (from the war \nbooty) similar to the reward and the share of one who has taken part in the Badr battle.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 128470,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29240,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 360,
        "hadithText": "<p>\nNarrated Marwan bin Al-Hakim and Miswar bin Makhrama:\n\n<p>When the Hawazin delegation came to Allah's Messenger (ﷺ) after they had embraced Islam and requested \nhim to return their properties and war prisoners to them, Allah's Messenger (ﷺ) said, \"To me the best talk is \nthe truest, so you may choose either of two things; the war prisoners or the wealth, for I have delayed \ntheir distribution.\" Allah's Messenger (ﷺ) had waited for them for over ten days when he returned from Ta'if. \nSo, when those people came to know that Allah's Messenger (ﷺ) was not going to return to them except one \nof the two things the said, \"We choose our war Prisoners 'Allah's Messenger (ﷺ) stood up amongst the \nMuslims, and after glorifying Allah as He deserved, he said, \"Now then, these brothers of yours have \ncome to us with repentance, and I see it logical that I should return their captives to them, so whoever \nof you likes to do that as a favor then he can do it, and whoever amongst you likes to stick to his \nshare, let him give up his prisoners and we will compensate him from the very first Fai' (i.e. war booty \nreceived without fight) which Allah will give us.\" On that, all the people said. 'O Allah's Messenger (ﷺ)s We \nhave agreed willingly to do so (return the captives)\" Then Allah's Messenger (ﷺ) said to them \"I do not know \nwho amongst you has agreed to this and who has not. You should return and let your leaders inform \nme of your agreement.\" The people returned and their leaders spoke to them, and then came to Allah's \nApostle and said, \"All the people have agreed willingly to do so and have given the permission to \nreturn the war prisoners (without Compensation)\" (Az-Zuhri, the sub-narrator states) This is what has \nbeen related to us about the captives of Hawazin.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 128480,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29250,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 361,
        "hadithText": "<p>\r\nNarrated Zahdam:\r\n\r\n<p>Once we were in the house of Abu Musa who presented a meal containing cooked chicken. A man \r\nfrom the tribe of Bani Taim Allah with red complexion as if he were from the Byzantine war \r\nprisoners, was present. Abu Musa invited him to share the meal but he (apologised) saying. \"I saw \r\nchickens eating dirty things and so I have had a strong aversion to eating them, and have taken an oath \r\nthat I will not eat chickens.\" Abu Musa said, \"Come along, I will tell you about this matter (i.e. how to \r\ncancel one's oath). I went to the Prophet (ﷺ) in the company of a group of Al-Ashariyin, asked him to \r\nprovide us with means of conveyance. He said, 'By Allah, I will not provide you with any means of \r\nconveyance and I have nothing to make you ride on.' Then some camels as booty were brought to \r\nAllah's Messenger (ﷺ) and he asked for us saying. 'Where are the group of Al-Ash`ariyun?' Then he ordered \r\nthat we should be given five camels with white humps. When we set out we said, 'What have we \r\ndone? We will never be blessed (with what we have been given).' So, we returned to the Prophet (ﷺ) and \r\nsaid, 'We asked you to provide us with means of conveyance, but you took an oath that you would not \r\nprovide us with any means of conveyance. Did you forget (your oath when you gave us the camels)? \r\nHe replied. 'I have not provided you with means of conveyance, but Allah has provided you with it, \r\nand by Allah, Allah willing, if ever I take an oath to do something, and later on I find that it is more \r\nbeneficial to do something different, I will do the thing which is better, and give expiation for my \r\noath.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 128490,
        "last_updated": "2014-02-22 18:29:01"
    },
    {
        "englishURN": 29260,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 362,
        "hadithText": "<p>\nNarrated Nafi` from Ibn `Umar:\n\n<p>Allah's Messenger (ﷺ) sent a Sariya towards Najd, and `Abdullah bin `Umar was in the Sariya. They gained a \ngreat number of camels as war booty. The share of each one of them was twelve or eleven camels, and \nthey were given an extra camel each.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 128500,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29270,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 363,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>Allah's Messenger (ﷺ) used to give extra share to some of the members of the Sariya he used to send, in \naddition to the shares they shared with the army in general.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 128510,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29280,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 364,
        "hadithText": "<p>\nNarrated Abu Musa:\n\n<p>We got the news of the migration of the Prophet (ﷺ) while we were in Yemen, so we set out migrating to \nhim. We were, I and my two brothers, I being the youngest, and one of my brothers was Abu Burda \nand the other was Abu Ruhm. We were over fifty (or fifty-three or fifty two) men from our people. \nWe got on board a ship which took us to An-Najashi in Ethiopia, and there we found Ja`far bin Abu \nTalib and his companions with An-Najaishi. Ja`far said (to us), \"Allah's Messenger (ﷺ) has sent us here and \nordered us to stay here, so you too, stay with us.\" We stayed with him till we all left (Ethiopia) and \nmet the Prophet (ﷺ) at the time when he had conquered Khaibar. He gave us a share from its booty (or \ngave us from its booty). He gave only to those who had taken part in the Ghazwa with him. but he did \nnot give any share to any person who had not participated in Khaibar's conquest except the people of \nour ship, besides Ja`far and his companions, whom he gave a share as he did them (i.e. the people of \nthe ship).</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 128520,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29290,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 365,
        "hadithText": "<p>\nNarrated Jabir:\n\n<p>Allah's Messenger (ﷺ) said (to me), \"If the property of Bahrain had come to us, I would have given you so \nmuch and so much.\" But the Bahrain property did not come till the Prophet (ﷺ) had died. When the \nBahrain property came. Abu Bakr ordered somebody to announce, \"Any person who has money claim \non Allah's Messenger (ﷺ) or whom Allah's Messenger (ﷺ) had promised something, should come to us.\" So, I went \nto him and said, \"Allah's Messenger (ﷺ) had promised to give me so much an so much.\" Abu Bakr scooped \nup money with both hands thrice for me.\" (The sub-narrator Sufyan illustrated this action by scooping \nup with both hands and said, \"Ibn Munkadir, another sub-narrator, used to illustrate it in this way.\") \nNarrated Jabir: Once I went to Abu Bakr and asked for the money but he did not give me, and I went \nto him again, but he did not give me, so I went to him for the third time and said, \"I asked you, but \nyou did not give me; then I asked you (for the second time) and you did not give me; then I asked you \n(for the third time) but you did not give me. You should either give me or allow yourself to be \nconsidered a miser regarding my case.\" Abu Bakr said, \"You tell me that I am a miser with regard to \nyou. But really, whenever I rejected your request, I had the inclination to give you.\" \n(In another narration Jabir added:) So, Abu Bakr scooped up money with both hands for me and asked \nme to count it. I found out that It was five hundred. Abu Bakr told me to take twice that amount.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 128530,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29300,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 366,
        "hadithText": "<p>\nNarrated Jabir bin `Abdullah:\n\n<p>While Allah's Messenger (ﷺ) was distributing the booty at Al-Ja'rana, somebody said to him \"Be just (in your \ndistribution).\" The Prophet (ﷺ) replied, \"Verily I would be miserable if I did not act justly.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 128540,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29310,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 367,
        "hadithText": "<p>\nNarrated Jubair bin Mut`im:\n\n<p>The Prophet (ﷺ) talked about war prisoners of Badr saying, \"Had Al-Mut`im bin Adi been alive and \ninterceded with me for these mean people, I would have freed them for his sake.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 128550,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29320,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 368,
        "hadithText": "<p>\nNarrated Jubair bin Mut`im:\n\n<p>I and `Uthman bin `Affan went to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! You have given to \nBani Al-Muttalib and left us although they and we are of the same kinship to you.\" Allah's Messenger (ﷺ) \nsaid, \"Bani Muttalib and Bani Hashim are one and the same.\" The Prophet (ﷺ) did not give a share to Bani \n`Abd Shams and Bani Naufai. (Ibn 'Is-haq said, \"Abd Shams and Hashim and Al-Muttalib were \nmaternal brothers and their mother was 'Atika bint Murra and Naufal was their paternal brother.)</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 128560,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29330,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 369,
        "hadithText": "<p>\nNarrated `Abdur-Rahman bin `Auf:\n\n<p>While I was standing in the row on the day (of the battle) of Badr, I looked to my right and my left \nand saw two young Ansari boys, and I wished I had been stronger than they. One of them called my \nattention saying, \"O Uncle! Do you know Abu Jahl?\" I said, \"Yes, What do you want from him, O my \nnephew?\" He said, \"I have been informed that he abuses Allah's Messenger (ﷺ). By Him in Whose Hands my \nlife is, if I should see him, then my body will not leave his body till either of us meet his fate.\" I was \nastonished at that talk. Then the other boy called my attention saying the same as the other had said. \nAfter a while I saw Abu Jahl walking amongst the people. I said (to the boys), \"Look! This is the man \nyou asked me about.\" So, both of them attacked him with their swords and struck him to death and \nreturned to Allah'S Apostle to inform him of that. Allah's Messenger (ﷺ) asked, \"Which of you has killed \nhim?\" Each of them said, \"I Have killed him.\" Allah's Messenger (ﷺ) asked, \"Have you cleaned your \nswords?\" They said, \"No. \" He then looked at their swords and said, \"No doubt, you both have killed \nhim and the spoils of the deceased will be given to Mu`adh bin `Amr bin Al-Jamuh.\" The two boys \nwere Mu`adh bin 'Afra and Mu`adh bin `Amr bin Al-Jamuh.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 128570,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29340,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 370,
        "hadithText": "<p>\nNarrated Abu Qatada:\n\n<p>We set out in the company of Allah's Messenger (ﷺ) on the day (of the battle) of Hunain. When we faced the \nenemy, the Muslims retreated and I saw a pagan throwing himself over a Muslim. I turned around and \ncame upon him from behind and hit him on the shoulder with the sword He (i.e. the pagan) came \ntowards me and seized me so violently that I felt as if it were death itself, but death overtook him and \nhe released me. I followed `Umar bin Al Khattab and asked (him), \"What is wrong with the people \n(fleeing)?\" He replied, \"This is the Will of Allah,\" After the people returned, the Prophet (ﷺ) sat and said, \n\"Anyone who has killed an enemy and has a proof of that, will posses his spoils.\" I got up and said, \n\"Who will be a witness for me?\" and then sat down. The Prophet (ﷺ) again said, \"Anyone who has killed \nan enemy and has proof of that, will possess his spoils.\" I (again) got up and said, \"Who will be a \nwitness for me?\" and sat down. Then the Prophet (ﷺ) said the same for the third time. I again got up, and \nAllah's Messenger (ﷺ) said, \"O Abu Qatada! What is your story?\" Then I narrated the whole story to him. A \nman (got up and) said, \"O Allah's Messenger (ﷺ)! He is speaking the truth, and the spoils of the killed man \nare with me. So please compensate him on my behalf.\" On that Abu Bakr As-Siddiq said, \"No, by \nAllah, he (i.e. Allah's Messenger (ﷺ) ) will not agree to give you the spoils gained by one of Allah's Lions \nwho fights on the behalf of Allah and His Apostle.\" The Prophet (ﷺ) said, \"Abu Bakr has spoken the \ntruth.\" So, Allah's Messenger (ﷺ) gave the spoils to me. I sold that armor (i.e. the spoils) and with its price I \nbought a garden at Bani Salima, and this was my first property which I gained after my conversion to \nIslam.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 128580,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29350,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 371,
        "hadithText": "<p>\nNarrated `Urwa bin Az-Zubair:\n\n<p>Hakim bin Hizam said, \"I asked Allah's Messenger (ﷺ) for something, and he gave me. I asked him again, \nand he gave me, and said to me. 'O Hakim! This wealth is like green sweet (i.e. fruit), and if one takes \nit without greed, then one is blessed in it, and if one takes it with greediness, then one is not blessed in \nit, and will be like the one who eats without satisfaction. And an upper (i.e. giving) hand is better than \na lower (i.e. taking) hand,' I said, 'O Allah's Messenger (ﷺ)! By Him Who has sent you with the Truth. I will \nnot ask anyone for anything after you till I leave this world.\" So, when Abu Bakr during his Caliphate, \ncalled Hakim to give him (some money), Hakim refused to accept anything from him. Once `Umar \ncalled him (during his Caliphate) in order to give him something, but Hakim refused to accept it, \nwhereupon `Umar said, \"O Muslims! I give him (i.e. Hakim) his right which Allah has assigned to \nhim) from this Fai '(booty), but he refuses to take it.\" So Hakim never took anything from anybody \nafter the Prophet (ﷺ) till he died.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 128590,
        "last_updated": "2013-05-03 21:00:19"
    },
    {
        "englishURN": 29360,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 372,
        "hadithText": "<p>\nNarrated Nafi`:\n\n<p>`Umar bin Al-Khattab said, \"O Allah's Messenger (ﷺ)! I vowed to observe I`tikaf for one day during the Prelslamic \nperiod.\" The Prophet (ﷺ) ordered him to fulfill his vow. `Umar gained two lady captives from the \nwar prisoners of Hunain and he left them in some of the houses at Mecca. When Allah's Messenger (ﷺ) freed \nthe captives of Hunain without ransom, they came out walking in the streets. `Umar said (to his son), \n\"O `Abdullah! See what is the matter.\" `Abdullah replied, \"Allah's Messenger (ﷺ) has freed the captives \nwithout ransom.\" He said (to him), \"Go and set free those two slave girls.\" (Nafi` added:) Allah's \nApostle did not perform the `Umra from Al-Jarana, and if he had performed the `Umra, it would not \nhave been hidden from `Abdullah.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 128600,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29370,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 373,
        "hadithText": "<p>\nNarrated `Amr bin Taghlib:\n\n<p>Allah's Messenger (ﷺ) gave (gifts) to some people to the exclusion of some others. The latter seemed to be \ndispleased by that. The Prophet (ﷺ) said, \"I give to some people, lest they should deviate from True Faith \nor lose patience, while I refer other people to the goodness and contentment which Allah has put in \ntheir hearts, and `Amr bin Taghlib is amongst them.\" `Amr bin Taghlib said, \"The statement of Allah's \nApostle is dearer to me than red camels.\" \nNarrated Al-Hasan: `Amr bin Taghlib told us that Allah's Messenger (ﷺ) got some property or some war \nprisoners and he distributed them in the above way (i.e. giving to some people to the exclusion of \nothers) .</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 128610,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29380,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 374,
        "hadithText": "<p>\nNarrated Anas:\n\n<p>The Prophet (ﷺ) said, \"I give to Quraish people in order to let them adhere to Islam, for they are near to \ntheir life of Ignorance (i.e. they have newly embraced Islam and it is still not strong in their hearts.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 128620,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29390,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 375,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>When Allah favored His Apostle with the properties of Hawazin tribe as Fai (booty), he started giving \nto some Quarries men even up to one-hundred camels each, whereupon some Ansari men said about \nAllah's Messenger (ﷺ), \"May Allah forgive His Apostle! He is giving to (men of) Quraish and leaves us, in \nspite of the fact that our swords are still dropping blood (of the infidels)\" When Allah's Messenger (ﷺ) was \ninformed of what they had said, he called the Ansar and gathered them in a leather tent and did not \ncall anybody else along, with them. When they gathered, Allah's Messenger (ﷺ) came to them and said, \n\"What is the statement which, I have been informed, and that which you have said?\" The learned ones \namong them replied,\" O Allah's Messenger (ﷺ)! The wise ones amongst us did not say anything, but the \nyoungsters amongst us said, 'May Allah forgive His Apostle; he gives the Quarish and leaves the \nAnsar, in spite of the fact that our swords are still dribbling (wet) with the blood of the infidels.' \" \nAllah's Messenger (ﷺ) replied, I give to such people as are still close to the period of Infidelity (i.e. they have \nrecently embraced Islam and Faith is still weak in their hearts). Won't you be pleased to see people go \nwith fortune, while you return with Allah's Messenger (ﷺ) to your houses? By Allah, what you will return \nwith, is better than what they are returning with.\" The Ansar replied, \"Yes, O Allah's Messenger (ﷺ), we are \nsatisfied' Then the Prophet (ﷺ) said to them.\" You will find after me, others being preferred to you. Then \nbe patient till you meet Allah and meet His Apostle at Al-Kauthar (i.e. a fount in Paradise).\" (Anas \nadded:) But we did not remain patient.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 128630,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29400,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 376,
        "hadithText": "<p>\nNarrated Jubair bin Mut`im:\n\n<p>That while he was with Allah's Messenger (ﷺ) who was accompanied by the people on their way back from \nHunain, the bedouins started begging things of Allah's Messenger (ﷺ) so much so that they forced him to go \nunder a Samura tree where his loose outer garment was snatched away. On that, Allah's Messenger (ﷺ) stood \nup and said to them, \"Return my garment to me. If I had as many camels as these trees, I would have \ndistributed them amongst you; and you will not find me a miser or a liar or a coward.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 128640,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29410,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 377,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>While I was walking with the Prophet (ﷺ) who was wearing a Najrani outer garment with a thick hem, a \nbedouin came upon the Prophet (ﷺ) and pulled his garment so violently that I could recognize the impress \nof the hem of the garment on his shoulder, caused by the violence of his pull. Then the bedouin said, \n\"Order for me something from Allah's Fortune which you have.\" The Prophet (ﷺ) turned to him and \nsmiled, and ordered that a gift be given to him.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 128650,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29420,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 378,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>On the day (of the battle) of Hunain, Allah's Messenger (ﷺ) favored some people in the distribution of the \nbooty (to the exclusion of others); he gave Al-Aqra' bin H`Abis one-hundred camels and he gave \n'Uyaina the same amount, and also gave to some of the eminent Arabs, giving them preference in this \nregard. Then a person came and said, \"By Allah, in this distribution justice has not been observed, nor \nhas Allah's Pleasure been aimed at.\" I said (to him), \"By Allah, I will inform the Prophet (of what you \nhave said), \"I went and informed him, and he said, \"If Allah and His Apostle did not act justly, who \nelse would act justly. May Allah be merciful to Moses, for he was harmed with more than this, yet he \nkept patient.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 128660,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29430,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 379,
        "hadithText": "<p>\nNarrated Asma bint Abu Bakr:\n\n<p>I used to carry the date stones on my head from the land of Az-Zubair which Allah's Messenger (ﷺ) had \ngiven to him, and it was at a distance of 2/3 of a Farsakh from my house. \nNarrated Hisham's father: The Prophet (ﷺ) gave Az-Zubair a piece of land from the property of Bani An- \nNadir (gained as war booty).</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 128670,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29440,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 380,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>`Umar bin Al-Khattab expelled all the Jews and Christians from the land of Hijaz. Allah's Messenger (ﷺ) \nafter conquering Khaibar, thought of expelling the Jews from the land which, after he conquered it \nbelonged to Allah, Allah's Messenger (ﷺ) and the Muslims. But the Jews requested Allah's Messenger (ﷺ) to leave \nthem there on the condition that they would do the labor and get half of the fruits (the land would \nyield). Allah's Messenger (ﷺ) said, \"We shall keep you on these terms as long as we wish.\" Thus they stayed \ntill the time of `Umar's Caliphate when he expelled them to Taima and Ariha.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 128680,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29450,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 381,
        "hadithText": "<p>\nNarrated `Abdullah bin Mughaffal:\n\n<p>While we were besieging the fort of Khaibar, a person threw a leather container containing fat, and I \nran to take it, but when I turned I saw the Prophet (standing behind), so I felt embarrassed in front of \nhim.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 128690,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29460,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 382,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>In our holy battles, we used to get honey and grapes, as war booty which we would eat and would not \nstore.</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 128700,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29470,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 383,
        "hadithText": "<p>\nNarrated Ibn Abi `Aufa:\n\n<p>We were afflicted with hunger during the besiege of Khaibar, and when it was the day of (the battle \nof) Khaibar, we slaughtered the donkeys and when the pots got boiling (with their meat). Allah's \nApostle made an announcement that all the pots should be upset and that nobody should eat anything \nof the meat of the donkeys. We thought that the Prophet (ﷺ) prohibited that because the Khumus had not \nbeen taken out of the booty (i.e. donkeys); other people said, \"He prohibited eating them for ever.\" \nThe sub-narrator added, \"I asked Sa`id bin Jubair who said, 'He has made the eating of donkeys' meat \nillegal for ever.\")</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 128710,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29071,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 343,
        "hadithText": "<p>\nNarrated Ibn Al-Hanafiya:\n\n<p>If `Ali had spoken anything bad about `Uthman then he would have mentioned the day when some \npersons came to him and complained about the Zakat officials of `Uthman. `Ali then said to me, \"Go \nto `Uthman and say to him, 'This document contains the regulations of spending the Sadaqa of Allah's \nApostle so order your Zakat officials to act accordingly.\" I took the document to `Uthman. `Uthman \nsaid, \"Take it away, for we are not in need of it.\" I returned to `Ali with it and informed him of that. \nHe said, \"Put it whence you took it.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 128280,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29072,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 343,
        "hadithText": "<p> Muhammad bin Suqa: I heard Mundhir at-Tuzi reporting Ibn Hanafiya who said,\n\n<p> \"My father \nsent me saying, 'Take this letter to `Uthman for it contains the orders of the Prophet (ﷺ) concerning the \nSadaqa.' \"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 128290,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29101,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 346,
        "hadithText": "Narrated Muawiya:\n\n<p>Allah's Messenger (ﷺ) said, \"If Allah wants to do good for somebody, he makes him comprehend the \nReligion (i.e. Islam), and Allah is the Giver and I am Al-Qasim (i.e. the distributor), and this (Muslim) nation will remain victorious over their opponents, till Allah's Order comes and they will still be victorious.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 128330,
        "last_updated": "2021-01-15 17:35:01"
    },
    {
        "englishURN": 29102,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 346,
        "hadithText": "<p> Abu Huraira:\n<p>Allah's Messenger (ﷺ) said, \"Neither do I give you (anything) nor withhold (anything) \nfrom you, but I am just a distributor (i.e. Qasim), and I give as I am ordered.\"</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 128340,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29085,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 53,
        "bookName": "One-fifth of Booty to the Cause of Allah (Khumus)",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 345,
        "hadithText": "Narrated Jabir bin 'Abdullah (ra): A boy was born to one of our men, the Ansar, and he wanted to name him Muhammad. Then Ansari man said, \"I took the boy to the Prophet (ﷺ). The Prophet (ﷺ) said, \"Name your child by my name, but do not name (them) by my Kunya, for I have been made Qasim (i.e., a distributor) to distribute (the booty etc.) amongst you.\" The narrator, Husain said that the Prophet (ﷺ) said, \"I have been sent as a Qasim (i.e., distributor) to distribute (things) amongst you.\" [The Sub narrator Salim said that he heard Jabir saying that the man wanted to name the boy Al-Qasim, but the Prophet (ﷺ) said, \"Call (your sons) by my name, but do not name (them) by my Kunya.\"]</b>",
        "bookID": "53.1",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 128310,
        "last_updated": "2012-04-26 07:00:00"
    }
]