[
    {
        "englishURN": 29770,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 413,
        "hadithText": "<p>\nNarrated `Imran bin Husain:\n\n<p>Some people of Bani Tamim came to the Prophet (ﷺ) and he said (to them), \"O Bani Tamim! rejoice with \nglad tidings.\" They said, \"You have given us glad tidings, now give us something.\" On hearing that \nthe color of his face changed then the people of Yemen came to him and he said, \"O people of Yemen \n! Accept the good tidings, as Bani Tamim has refused them.\" The Yemenites said, \"We accept them. \nThen the Prophet (ﷺ) started taking about the beginning of creation and about Allah's Throne. In the mean \ntime a man came saying, \"O `Imran! Your she-camel has run away!'' (I got up and went away), but l \nwish I had not left that place (for I missed what Allah's Messenger (ﷺ) had said).</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 129060,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29781,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 414,
        "hadithText": "<p> \n\n   Narrated Imran bin Husain: <p> I went to the Prophet (ﷺ) and tied my she-camel at the gate. The people of Bani Tamim came to the Prophet (ﷺ) who said \"O Bani Tamim! Accept the good tidings.\" They said twice, 'You have given us the good tidings, now give us something\" Then some Yemenites came to him and he said, \"Accept the good tidings, O people of Yemem, for Bani Tamim refused them.\" They said, \"We accept it, O Allah's Messenger (ﷺ)! We have come to ask you about this matter (i.e. the start of creations).\" He said, \"First of all, there was nothing but Allah, and (then He created His Throne). His throne was over the water, and He wrote everything in the Book (in the Heaven) and created the Heavens and the Earth.\" Then a man shouted, \"O Ibn Husain! Your she-camel has gone away!\" So, I went away and could not see the she-camel because of the mirage. By Allah, I wished I had left that she-camel (but not that gathering).</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 129070,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29782,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 414,
        "hadithText": "<p> \n\n   Narrated 'Umar: One day the Prophet (ﷺ) stood up amongst us for a long period and informed us about the beginning of creation (and talked about everything in detail) till he mentioned how the people of Paradise will enter their places and the people of Hell will enter their places. Some remembered what he had said, and some forgot it. <p></b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 129080,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29790,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 415,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"Allah the Most Superior said, \"The son of Adam slights Me, and he should not \nslight Me, and he disbelieves in Me, and he ought not to do so. As for his slighting Me, it is that he \nsays that I have a son; and his disbelief in Me is his statement that I shall not recreate him as I have \ncreated (him) before.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 129090,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29800,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 416,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"When Allah completed the creation, He wrote in His Book which is with Him \non His Throne, \"My Mercy overpowers My Anger.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 129100,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29810,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 417,
        "hadithText": "<p>\nNarrated Muhammad bin Ibrahim bin Al-Harith:\n\n<p>from Abu Salama bin `Abdur-Rahman who had a dispute with some people on a piece of land, and so \nhe went to `Aisha and told her about it. She said, \"O Abu Salama, avoid the land, for Allah's Messenger (ﷺ) \nsaid, 'Any person who takes even a span of land unjustly, his neck shall be encircled with it down \nseven earths.' \"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 129110,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29820,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 418,
        "hadithText": "<p>\nNarrated Salim's father:\n\n<p>The Prophet (ﷺ) said, \"Any person who takes a piece of land unjustly will sink down the seven earths on \nthe Day of Resurrection.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 129120,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29830,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 419,
        "hadithText": "<p>\nNarrated Abu Bakra:\n\n<p>The Prophet (ﷺ) said. \"(The division of time has turned to its original form which was current when Allah \ncreated the Heavens and the Earths. The year is of twelve months, out of which four months are \nsacred: Three are in succession Dhul-Qa' da, Dhul-Hijja and Muharram, and (the fourth is) Rajab of \n(the tribe of) Mudar which comes between Jumadi-ath-Thaniyah and Sha ban.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 129130,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29840,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 420,
        "hadithText": "<p>\nNarrated Sa`id bin Zaid bin `Amr bin Nufail:\n\n<p>That Arwa sued him before Marwan for a right, which she claimed, he had deprived her of. On that \nSa`id said, \"How should I deprive her of her right? I testify that I heard Allah's Messenger (ﷺ) saying, 'If \nanyone takes a span of land unjustly, his neck will be encircled with it down seven earths on the Day \nof Resurrection.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 129140,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29850,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 421,
        "hadithText": "<p>\nNarrated Abu Dhar:\n\n<p>The Prophet (ﷺ) asked me at sunset, \"Do you know where the sun goes (at the time of sunset)?\" I replied, \n\"Allah and His Apostle know better.\" He said, \"It goes (i.e. travels) till it prostrates Itself underneath \nthe Throne and takes the permission to rise again, and it is permitted and then (a time will come when) \nit will be about to prostrate itself but its prostration will not be accepted, and it will ask permission to \ngo on its course but it will not be permitted, but it will be ordered to return whence it has come and so \nit will rise in the west. And that is the interpretation of the Statement of Allah: \"And the sun Runs its \nfixed course For a term (decreed). that is The Decree of (Allah) The Exalted in Might, The All- \nKnowing.\" (36.38)</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 129160,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29860,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 422,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"The sun and the moon will be folded up (deprived of their light) on the Day of \nResurrection.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 129170,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29870,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 423,
        "hadithText": "<p>\r\nNarrated `Abdullah bin `Umar:\r\n\r\n<p>The Prophet (ﷺ) said, \"The sun and the moon do not eclipse because of someone's death or life (i.e. \r\nbirth), but they are two signs amongst the Signs of Allah. So, if you see them (i.e. eclipse) offer the (eclipse) prayer.</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 129180,
        "last_updated": "2013-08-26 23:42:05"
    },
    {
        "englishURN": 29880,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 424,
        "hadithText": "<p>\nNarrated `Abdullah bin `Abbas:\n\n<p>The Prophet (ﷺ) said, \"The sun and the moon are two signs amongst the Signs of Allah. They do not \neclipse because of someone's death or life. So, if you see them (i.e. eclipse), celebrate the Praises of \nAllah (i.e. pray).</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 129190,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29890,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 425,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>On the day of a solar eclipse, Allah's Messenger (ﷺ) stood up (to offer the eclipse prayer). He recited Takbir, \nrecited a long recitation (of Holy Verses), bowed a long bowing, and then he raised h is head saying. \n\"Allah hears him who sends his praises to Him.\" Then he stayed standing, recited a long recitation \nagain, but shorter than the former, bowed a long bowing, but shorter than the first, performed a long \nprostration and then performed the second rak`a in the same way as he had done the first. By the time \nhe had finished his prayer with Taslim, the solar eclipse had been over. Then he addressed the people \nreferring to the solar and lunar eclipses saying, \"These are two signs amongst the Signs of Allah, and \nthey do not eclipse because of anyone's death or life. So, if you see them, hasten for the Prayer.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 129200,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29900,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 426,
        "hadithText": "<p>\nNarrated Abu Mas`ud:\n\n<p>The Prophet (ﷺ) said, \"the sun and the moon do not eclipse because of the death or life of someone, but \nthey are two signs amongst the Signs of Allah. So, if you see them, offer the Prayer (of eclipse).</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 129210,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29910,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 427,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>The Prophet (ﷺ) said, \"I have been made victorious with the Saba (i.e. easterly wind) and the people of \n'Ad were destroyed with the Dabur (i.e. westerly wind) .\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 129220,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29920,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 428,
        "hadithText": "<p>\nNarrated Ata:\n\n<p>`Aisha said If the Prophet (ﷺ) saw a cloud In the sky, he would walk to and fro in agitation, go out and \ncome in, and the color of his face would change, and if it rained, he would feel relaxed.\" So `Aisha \nknew that state of his. So the Prophet (ﷺ) said, I don't know (am afraid), it may be similar to what \nhappened to some people referred to in the Holy Qur'an in the following Verse: -- \"Then when they \nsaw it as a dense cloud coming towards their valleys, they said, 'This is a cloud bringing us rain!' Nay, \nbut, it is that (torment) which you were asking to be hastened a wind wherein is severe torment.\" \n(46.24)</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 129230,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29930,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 429,
        "hadithText": "<p>\nNarrated Malik bin Sasaa:\n\n<p>The Prophet (ﷺ) said, \"While I was at the House in a state midway between sleep and wakefulness, (an \nangel recognized me) as the man lying between two men. A golden tray full of wisdom and belief was \nbrought to me and my body was cut open from the throat to the lower part of the `Abdomen and then \nmy `Abdomen was washed with Zamzam water and (my heart was) filled with wisdom and belief. Al- \nBuraq, a white animal, smaller than a mule and bigger than a donkey was brought to me and I set out \nwith Gabriel. When I reached the nearest heaven. Gabriel said to the heaven gate-keeper, 'Open the \ngate.' The gatekeeper asked, 'Who is it?' He said, 'Gabriel.' The gate-keeper,' Who is accompanying \nyou?' Gabriel said, 'Muhammad.' The gate-keeper said, 'Has he been called?' Gabriel said, 'Yes.' Then \nit was said, 'He is welcomed. What a wonderful visit his is!' Then I met Adam and greeted him and he \nsaid, 'You are welcomed O son and a Prophet.' Then we ascended to the second heaven. It was asked, \n'Who is it?' Gabriel said, 'Gabriel.' It was said, 'Who is with you?' He said, 'Muhammad' It was asked, \n'Has he been sent for?' He said, 'Yes.' It was said, 'He is welcomed. What a wonderful visit his is!\" \nThen I met Jesus and Yahya (John) who said, 'You are welcomed, O brother and a Prophet.' Then we \nascended to the third heaven. It was asked, 'Who is it?' Gabriel said, 'Gabriel.' It was asked, 'Who is \nwith you? Gabriel said, 'Muhammad.' It was asked, 'Has he been sent for?' 'Yes,' said Gabriel. 'He is \nwelcomed. What a wonderful visit his is!' (The Prophet (ﷺ) added:). There I met Joseph and greeted him, \nand he replied, 'You are welcomed, O brother and a Prophet!' Then we ascended to the 4th heaven and \nagain the same questions and answers were exchanged as in the previous heavens. There I met Idris \nand greeted him. He said, 'You are welcomed O brother and Prophet.' Then we ascended to the 5th \nheaven and again the same questions and answers were exchanged as in previous heavens. there I met \nand greeted Aaron who said, 'You are welcomed O brother and a Prophet\". \nThen we ascended to the 6th heaven and again the same questions and answers were exchanged as in \nthe previous heavens. There I met and greeted Moses who said, 'You are welcomed O brother and. a \nProphet.' When I proceeded on, he started weeping and on being asked why he was weeping, he said, \n'O Lord! Followers of this youth who was sent after me will enter Paradise in greater number than my \nfollowers.' Then we ascended to the seventh heaven and again the same questions and answers were \nexchanged as in the previous heavens. There I met and greeted Abraham who said, 'You are \nwelcomed o son and a Prophet.' Then I was shown Al-Bait-al-Ma'mur (i.e. Allah's House). I asked \nGabriel about it and he said, This is Al Bait-ul-Ma'mur where 70,000 angels perform prayers daily and \nwhen they leave they never return to it (but always a fresh batch comes into it daily).' \nThen I was shown Sidrat-ul-Muntaha (i.e. a tree in the seventh heaven) and I saw its Nabk fruits \nwhich resembled the clay jugs of Hajr (i.e. a town in Arabia), and its leaves were like the ears of \nelephants, and four rivers originated at its root, two of them were apparent and two were hidden. I \nasked Gabriel about those rivers and he said, 'The two hidden rivers are in Paradise, and the apparent \nones are the Nile and the Euphrates.' \nThen fifty prayers were enjoined on me. I descended till I met Moses who asked me, 'What have you \ndone?' I said, 'Fifty prayers have been enjoined on me.' He said, 'I know the people better than you, \nbecause I had the hardest experience to bring Bani Israel to obedience. Your followers cannot put up \nwith such obligation. So, return to your Lord and request Him (to reduce the number of prayers.' I \nreturned and requested Allah (for reduction) and He made it forty. I returned and (met Moses) and had \na similar discussion, and then returned again to Allah for reduction and He made it thirty, then twenty, \nthen ten, and then I came to Moses who repeated the same advice. Ultimately Allah reduced it to five. \nWhen I came to Moses again, he said, 'What have you done?' I said, 'Allah has made it five only.' He \nrepeated the same advice but I said that I surrendered (to Allah's Final Order)'\" Allah's Messenger (ﷺ) was \naddressed by Allah, \"I have decreed My Obligation and have reduced the burden on My slaves, and I \nshall reward a single good deed as if it were ten good deeds.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 129240,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29940,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 430,
        "hadithText": "<p>\nNarrated `Abdullah bin Mus'ud:\n\n<p>Allah's Messenger (ﷺ), the true and truly inspired said, \"(The matter of the Creation of) a human being is put \ntogether in the womb of the mother in forty days, and then he becomes a clot of thick blood for a \nsimilar period, and then a piece of flesh for a similar period. Then Allah sends an angel who is ordered \nto write four things. He is ordered to write down his (i.e. the new creature's) deeds, his livelihood, his \n(date of) death, and whether he will be blessed or wretched (in religion). Then the soul is breathed into \nhim. So, a man amongst you may do (good deeds till there is only a cubit between him and Paradise \nand then what has been written for him decides his behavior and he starts doing (evil) deeds \ncharacteristic of the people of the (Hell) Fire. And similarly a man amongst you may do (evil) deeds \ntill there is only a cubit between him and the (Hell) Fire, and then what has been written for him \ndecides his behavior, and he starts doing deeds characteristic of the people of Paradise.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 129250,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29950,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 431,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"If Allah loves a person, He calls Gabriel saying, 'Allah loves so and-so; O Gabriel! \nLove him.' Gabriel would love him and make an announcement amongst the inhabitants of the \nHeaven. 'Allah loves so-and-so, therefore you should love him also,' and so all the inhabitants of the \nHeaven would love him, and then he is granted the pleasure of the people on the earth.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 129260,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29960,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 432,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>I heard Allah's Messenger (ﷺ) saying, \"The angels descend, the clouds and mention this or that matter \ndecreed in the Heaven. The devils listen stealthily to such a matter, come down to inspire the \nsoothsayers with it, and the latter would add to it one-hundred lies of their own.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 129270,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29970,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 433,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"On every Friday the angels take their stand at every gate of the mosque to write the names of the people chronologically (i.e. according to the time of their arrival for the Friday prayer) and when the Imam sits (on the pulpit) they fold up their scrolls and get ready to listen to the sermon.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 129280,
        "last_updated": "2012-10-30 17:08:26"
    },
    {
        "englishURN": 29980,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 434,
        "hadithText": "<p>\nNarrated Sa`id bin Al-Musaiyab:\n\n<p>`Umar came to the Mosque while Hassan was reciting a poem. (`Umar disapproved of that). On that \nHassan said, \"I used to recite poetry in this very Mosque in the presence of one (i.e. the Prophet (ﷺ) ) who \nwas better than you.\" Then he turned towards Abu Huraira and said (to him), \"I ask you by Allah, did \nyou hear Allah's Messenger (ﷺ) saying (to me), \"Retort on my behalf. O Allah! Support him (i.e. Hassan) \nwith the Holy Spirit?\" Abu Huraira said, \"Yes.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 129290,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 29990,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 435,
        "hadithText": "<p>\nNarrated Al Bara:\n\n<p>The Prophet (ﷺ) said to Hassan, \"Lampoon them (i.e. the pagans) and Gabriel is with you.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 129300,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30001,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 436,
        "hadithText": "<p>\nNarrated Jarir:\n\n<p>as below.<p>\nNarrated Humaid bin Hilal:\n\n<p>Anas bin Malik said, \"As if I say a cloud of dust swirling up in the lane of Bani Ghanim.\" Musa \nadded, \"That was caused by the procession of Gabriel.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 129310,
        "last_updated": "2012-05-02 03:38:34"
    },
    {
        "englishURN": 30020,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 438,
        "hadithText": "<p>\nNarrated Aisha:\n\n<p>Al Harith bin Hisham asked the Prophet, \"How does the divine inspiration come to you?\" He replied, \n\"In all these ways: The Angel sometimes comes to me with a voice which resembles the sound of a \nringing bell, and when this state abandons me, I remember what the Angel has said, and this type of \nDivine Inspiration is the hardest on me; and sometimes the Angel comes to me in the shape of a man \nand talks to me, and I understand and remember what he says.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 129320,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30030,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 439,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>I heard the Prophet (ﷺ) saying, \"Who ever spends a couple (of objects) in Allah's cause, will be called by \nthe Gatekeepers of Paradise who will say, \"O so-and-so, come on!\" Abu Bakr said, \"Such a person \nwill never perish or be miserable' The Prophet (ﷺ) said, \"I hope you will be among such person.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 129330,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30040,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 440,
        "hadithText": "<p>\nNarrated Abu Salama:\n\n<p>`Aisha said that the Prophet (ﷺ) said to her \"O `Aisha' This is Gabriel and he sends his (greetings) \nsalutations to you.\" `Aisha said, \"Salutations (Greetings) to him, and Allah's Mercy and Blessings be \non him,\" and addressing the Prophet (ﷺ) she said, \"You see what I don't see.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 129340,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30050,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 441,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>Allah's Messenger (ﷺ) asked Gabriel, \"Why don't you visit us more often than you do?\" Then the following \nHoly Verse was revealed (in this respect):-- \"And we (angels) descend not but by the order of your \nLord. To Him belong what is before us and what is behind us, and what is between those two and your \nLord was never forgetful.\" (19.64)</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 129350,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30060,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 442,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>Allah's Messenger (ﷺ) said, \"Gabriel read the Qur'an to me in one way (i.e. dialect) and I continued asking \nhim to read it in different ways till he read it in seven different ways.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 129360,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30070,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 443,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>Allah's Messenger (ﷺ) was the most generous of all the people, and he used to be more generous in the \nmonth of Ramadan when Gabriel used to meet him. Gabriel used to meet him every night in Ramadan \nto study the Holy Qur'an carefully together. Allah's Messenger (ﷺ) used to become more generous than the \nfast wind when he met Gabriel.</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 129370,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30080,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 444,
        "hadithText": "<p>\nNarrated Ibn Shihab:\n\n<p>Once `Umar bin `Abdul `Aziz delayed the `Asr prayer a little. `Urwa said to him, \"Gabriel descended \nand led the prayer in front of the Prophet (ﷺ) \" On that `Umar said, \"O `Urwa! Be sure of what you say.\" \n\"Urwa, \"I heard Bashir bin Abi Masud narrating from Ibn Masud who heard Allah's Messenger (ﷺ) saying, \n'Gabriel descended and led me in prayer; and then prayed with him again, and then prayed with him \nagain, and then prayed with him again, and then prayed with him again, counting with his fingers five \nprayers.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 129380,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30090,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 445,
        "hadithText": "<p>\nNarrated Abu Dhar:\n\n<p>The Prophet (ﷺ) said, \"Gabriel said to me, 'Whoever amongst your followers die without having \nworshipped others besides Allah, will enter Paradise (or will not enter the (Hell) Fire).\" The Prophet (ﷺ) \nasked. \"Even if he has committed illegal sexual intercourse or theft?\" He replied, \"Even then.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 129390,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30100,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 446,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"Angels keep on descending from and ascending to the Heaven in turn, some at \nnight and some by daytime, and all of them assemble together at the time of the Fajr and `Asr prayers. \nThen those who have stayed with you over-night, ascent unto Allah Who asks them, and He knows \nthe answer better than they, \"How have you left My slaves?\" They reply, \"We have left them praying \nas we found them praying.\" If anyone of you says \"Amin\" (during the Prayer at the end of the \nrecitation of Surat-al-Faitiha), and the angels in Heaven say the same, and the two sayings coincide, \nall his past sins will be forgiven.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 129400,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30110,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 447,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>I stuffed for the Prophet (ﷺ) a pillow decorated with pictures (of animals) which looked like a Namruqa \n(i.e. a small cushion). He came and stood between the two doors and his face began to change. I \nsaid, \"O Allah's Messenger (ﷺ)! What did we do wrong?\" He said, \"What is this pillow?\" I said, \"I have prepared this \npillow for you, so that you may recline on it.\" He said, \"Don't you know that angels do not enter a \nhouse wherein there are pictures; and whoever makes a picture will be punished on the Day of \nResurrection and will be asked to give life to (what he has created)?\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 129410,
        "last_updated": "2021-03-14 19:17:42"
    },
    {
        "englishURN": 30120,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 448,
        "hadithText": "<p>\nNarrated Abu Talha:\n\n<p>I heard Allah's Messenger (ﷺ) saying; \"Angels (of Mercy) do not enter a house wherein there is a dog or a \npicture of a living creature (a human being or an animal).</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 129420,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30130,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 449,
        "hadithText": "<p>\nNarrated Busr bin Sa`id:\n\n<p>That Zaid bin Khalid Al-Juhani narrated to him something in the presence of Sa`id bin 'Ubaidullah Al- \nKhaulani who was brought up in the house of Maimuna the wife of the Prophet. Zaid narrated to them \nthat Abu Talha said that the Prophet (ﷺ) said, \"The Angels (of Mercy) do not enter a house wherein there \nis a picture.\" Busr said, \"Later on Zaid bin Khalid fell ill and we called on him. To our surprise we \nsaw a curtain decorated with pictures in his house. I said to Ubaidullah Al-Khaulani, \"Didn't he (i.e. \nZaid) tell us about the (prohibition of) pictures?\" He said, \"But he excepted the embroidery on \ngarments. Didn't you hear him?\" I said, \"No.\" He said, \"Yes, he did.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 129430,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30140,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 450,
        "hadithText": "<p>\nNarrated Salim's father:\n\n<p>Once Gabriel promised the Prophet (that he would visit him, but Gabriel did not come) and later on he \nsaid, \"We, angels, do not enter a house which contains a picture or a dog.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 129440,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30150,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 451,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"When the Imam, during the prayer, says, \"Allah hears him who praises Him', \nsay: 'O Allah! Our Lord! All the praises are for You/, for if the saying of anyone of you coincides with \nthe saying of the angels, his past sins will be forgiven.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 129450,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30160,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 452,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"As long as any-one of you is waiting for the prayer, he is considered to be praying \nactually, and the angels say, 'O Allah! Be merciful to him and forgive him', (and go on saying so) \nunless he leaves his place of praying or passes wind (i.e. breaks his ablution).</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 129460,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30170,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 453,
        "hadithText": "<p>\nNarrated Yali:\n\n<p>I heard the Prophet (ﷺ) reciting the following Verse on the pulpit: \"They will call: O Malik...' and Sufyan \nsaid that `Abdullah recited it: 'They will call: O Mali...' (43.77)</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 129470,
        "last_updated": "2021-03-14 19:19:02"
    },
    {
        "englishURN": 30180,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 454,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>That she asked the Prophet (ﷺ) , 'Have you encountered a day harder than the day of the battle) of Uhud?\" \nThe Prophet (ﷺ) replied, \"Your tribes have troubled me a lot, and the worse trouble was the trouble on the \nday of 'Aqaba when I presented myself to Ibn `Abd-Yalail bin `Abd-Kulal and he did not respond to \nmy demand. So I departed, overwhelmed with excessive sorrow, and proceeded on, and could not \nrelax till I found myself at Qarnath-Tha-alib where I lifted my head towards the sky to see a cloud \nshading me unexpectedly. I looked up and saw Gabriel in it. He called me saying, 'Allah has heard \nyour people's saying to you, and what they have replied back to you, Allah has sent the Angel of the \nMountains to you so that you may order him to do whatever you wish to these people.' The Angel of \nthe Mountains called and greeted me, and then said, \"O Muhammad! Order what you wish. If you \nlike, I will let Al-Akh-Shabain (i.e. two mountains) fall on them.\" The Prophet (ﷺ) said, \"No but I hope \nthat Allah will let them beget children who will worship Allah Alone, and will worship None besides \nHim.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 129480,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30190,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 455,
        "hadithText": "<p>\nNarrated Abu 'Is-haq-Ash-Shaibani:\n\n<p>I asked Zir bin Hubaish regarding the Statement of Allah: \"And was at a distance Of but two bowlengths \nOr (even) nearer; So did (Allah) convey The Inspiration to His slave (Gabriel) and then he \n(Gabriel) Conveyed (that to Muhammad). (53.9-10) On that, Zir said, \"Ibn Mas`ud informed us that \nthe Prophet (ﷺ) had seen Gabriel having 600 wings.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 129490,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30200,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 456,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>Regarding the Verse: \"Indeed he (Muhammad) did see. Of the Signs of his Lord, The Greatest!\" \n(53.18) That the Prophet (ﷺ) had seen a green carpet spread all over the horizon of the sky.</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 129500,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30210,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 457,
        "hadithText": "<p>\nNarrated Aisha:\n\n<p>Whoever claimed that (the Prophet) Muhammad saw his Lord, is committing a great fault, for he only \nsaw Gabriel in his genuine shape in which he was created covering the whole horizon.</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 129510,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30220,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 458,
        "hadithText": "<p>\nNarrated Masruq:\n\n<p>I asked Aisha \"What about His Statement:-- \"Then he (Gabriel) approached And came closer, And \nwas at a distance Of but two bow-lengths Or (even) nearer?\" (53.8-9) She replied, \"It was Gabriel who \nused to come to the Prophet (ﷺ) in the figure of a man, but on that occasion, he came in his actual and real \nfigure and (he was so huge) that he covered the whole horizon.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 129520,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30230,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 459,
        "hadithText": "<p>\nNarrated Samura:\n\n<p>The Prophet (ﷺ) said, \"Last night I saw (in a dream) two men coming to me. One of them said, \"The \nperson who kindles the fire is Malik, the gate-keeper of the (Hell) Fire, and I am Gabriel, and this is \nMichael.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 129530,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30240,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 460,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"If a husband calls his wife to his bed (i.e. to have sexual relation) and she \nrefuses and causes him to sleep in anger, the angels will curse her till morning.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 129540,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30250,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 461,
        "hadithText": "<p>\nNarrated Jabir bin `Abdullah:\n\n<p>that he heard the Prophet (ﷺ) saying, \"The Divine Inspiration was delayed for a short period but suddenly, \nas I was walking. I heard a voice in the sky, and when I looked up towards the sky, to my surprise, I \nsaw the angel who had come to me in the Hira Cave, and he was sitting on a chair in between the sky \nand the earth. I was so frightened by him that I fell on the ground and came to my family and said (to \nthem), 'Cover me! (with a blanket), cover me!' Then Allah sent the Revelation: \"O, You wrapped up \n(In a blanket)! (Arise and warn! And your Lord magnify And keep pure your garments, And desert the \nidols.\" (74.1-5)</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 129550,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30260,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 462,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>The Prophet (ﷺ) said, \"On the night of my Ascent to the Heaven, I saw Moses who was a tall brown curlyhaired \nman as if he was one of the men of Shan'awa tribe, and I saw Jesus, a man of medium height \nand moderate complexion inclined to the red and white colors and of lank hair. I also saw Malik, the \ngate-keeper of the (Hell) Fire and Ad-Dajjal amongst the signs which Allah showed me.\" (The \nProphet then recited the Holy Verse): \"So be not you in doubt of meeting him' when you met Moses \nduring the night of Mi'raj over the heavens\" (32.23) \nNarrated Anas and Abu Bakra: \"The Prophet (ﷺ) said, \"The angels will guard Medina from Ad-Dajjal \n(who will not be able to enter the city of Medina).</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 129560,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30270,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 463,
        "hadithText": "<p>\nNarrated `Abdullah bin `Umar:\n\n<p>Allah's Messenger (ﷺ) said, \"When anyone of you dies, he will be shown his destination both in the morning \nand in the evening, and if he belongs to the people of Paradise, he will be shown his place in Paradise, \nand if he is from the people of Hell, he will be shown his place in Hell.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 129570,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30280,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 464,
        "hadithText": "<p>\nNarrated `Imran bin Husain:\n\n<p>The Prophet (ﷺ) said, \"I looked at Paradise and found poor people forming the majority of its inhabitants; \nand I looked at Hell and saw that the majority of its inhabitants were women.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 129580,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30290,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 465,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>While we were in the company of the Prophet, he said, \"While I was asleep, I saw myself in Paradise \nand there I beheld a woman making ablution beside a palace, I asked, To whom does this palace \nbelong? 'They said, To `Umar bin Al-Khattab.' Then I remembered `Umar's Ghaira (concerning \nwomen), and so I quickly went away from that palace.\" (When `Umar heard this from the Prophet), he \nwept and said, \"Do you think it is likely that I feel Ghaira because of you, O Allah's Messenger (ﷺ)?\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 129590,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30300,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 466,
        "hadithText": "<p>\nNarrated `Abdullah bin Qais Al-Ash`ari:\n\n<p>The Prophet (ﷺ) said, \"A tent (in Paradise) is like a hollow pearl which is thirty miles in height and on \nevery corner of the tent the believer will have a family that cannot be seen by the others.\" (Narrated \nAbu `Imran in another narration, \"The tent is sixty miles in height.\")</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 129600,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30310,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 467,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"Allah said, \"I have prepared for My Pious slaves things which have never been \nseen by an eye, or heard by an ear, or imagined by a human being.\" If you wish, you can recite this \nVerse from the Holy Qur'an:--\"No soul knows what is kept hidden for them, of joy as a reward for \nwhat they used to do.\" (32.17)</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 129610,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30320,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 468,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"The first group (of people) who will enter Paradise will be (glittering) like the \nmoon when it is full. They will not spit or blow their noses or relieve nature. Their utensils will be of \ngold and their combs of gold and silver; in their centers the aloe wood will be used, and their sweat \nwill smell like musk. Everyone of them will have two wives; the marrow of the bones of the wives' \nlegs will be seen through the flesh out of excessive beauty. They ( i.e. the people of Paradise) will \nneither have differences nor hatred amongst themselves; their hearts will be as if one heart and they \nwill be glorifying Allah in the morning and in the evening.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 129620,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30330,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 469,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"The first batch (of people) who will enter Paradise will be (glittering) like a full \nmoon; and those who will enter next will be (glittering) like the brightest star. Their hearts will be as if \nthe heart of a single man, for they will have no enmity amongst themselves, and everyone of them \nshall have two wives, each of whom will be so beautiful, pure and transparent that the marrow of the \nbones of their legs will be seen through the flesh. They will be glorifying Allah in the morning and \nevening, and will never fall ill, and they will neither blow their noses, nor spit. Their utensils will be \nof gold and silver, and their combs will be of gold, and the fuel used in their centers will be the aloeswood, \nand their sweat will smell like musk.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 129630,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30340,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 470,
        "hadithText": "<p>\nNarrated Sahl bin Sa`d:\n\n<p>The Prophet (ﷺ) said, \"Verily! 70,000 or 700,000 of my followers will enter Paradise altogether; so that \nthe first and the last amongst them will enter at the same time, and their faces will be glittering like the \nbright full moon.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 129640,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30350,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 471,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>A silken cloak was presented to the Prophet (ﷺ) and he used to forbid the usage of silk (by men). When \nthe people were fascinated by the cloak. he said, \"By Allah in Whose Hands the life of Muhammad is, \nthe handkerchiefs of Sa`d bin Mu`adh in Paradise are better than this.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 129650,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30360,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 472,
        "hadithText": "<p>\nNarrated Al-Bara bin Azib:\n\n<p>Allah's Messenger (ﷺ) was given a silken garment, and its beauty and delicacy astonished the people. On \nthat, Allah's Messenger (ﷺ) said, \"No doubt, the handkerchiefs of Sa`d bin Mu`adh in Paradise are better than \nthis.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 129660,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30370,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 473,
        "hadithText": "<p>\nNarrated Sahl bin Sa`d Al-Saidi:\n\n<p>Allah's Messenger (ﷺ) said, \"A place in Paradise equal to the size of a lash is better than the whole world and \nwhatever is in it.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 129670,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30380,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 474,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>The Prophet (ﷺ) said, \"There is a tree in Paradise (which is so big and huge that) if a rider travels in its \nshade for one hundred years, he would not be able to cross it.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 129680,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30390,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 475,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said \"There is a tree in Paradise (which is so big and huge that) a rider could travel in its \nshade for a hundred years. And if you wish, you can recite:--'In shade long extended..' (56. 30) and a \nplace in Paradise equal to an arrow bow of one of you, is better than (the whole earth) on which the \nsun rises and sets.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 129690,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30400,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 476,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"The first batch (of people) who will enter Paradise will be (glittering) like the full \nmoon, and the batch next to them will be (glittering) like the most brilliant star in the sky. Their hearts \nwill be as if the heart of a single man, for they will have neither enmity nor jealousy amongst \nthemselves; everyone will have two wives from the houris, (who will be so beautiful, pure and \ntransparent that) the marrow of the bones of their legs will be seen through the bones and the flesh.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 129700,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30410,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 477,
        "hadithText": "<p>\nNarrated Al-Bara (bin Azib):\n\n<p>The Prophet, after the death of his son Ibrahim, said, \"There is a wet-nurse for him (i.e. Ibrahim) in \nParadise.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 129710,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30420,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 478,
        "hadithText": "<p>\nNarrated Abu Sa`id Al-Khudri:\n\n<p>The Prophet (ﷺ) said, \"The people of Paradise will look at the dwellers of the lofty mansions (i.e. a \nsuperior place in Paradise) in the same way as one looks at a brilliant star far away in the East or in the \nWest on the horizon; all that is because of their superiority over one another (in rewards).\" On that the \npeople said, \"O Allah's Messenger (ﷺ)! Are these lofty mansions for the prophets which nobody else can \nreach? The Prophet (ﷺ) replied,\" No! \"By Allah in whose Hands my life is, these are for the men who \nbelieved in Allah and also believed in the Apostles.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 129720,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30430,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 479,
        "hadithText": "<p>\nNarrated Sahl bin Sa`d:\n\n<p>The Prophet (ﷺ) said, \"Paradise has eight gates, and one of them is called Ar-Raiyan through which none \nwill enter but those who observe fasting.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 129730,
        "last_updated": "2013-06-13 14:13:50"
    },
    {
        "englishURN": 30440,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 480,
        "hadithText": "<p>\nNarrated Abu Dhar:\n\n<p>While the Prophet (ﷺ) was on a journey, he said (regarding the performance of the Zuhr prayer), \"Wait till \nit (i.e. the weather) gets cooler.\" He said the same again till the shade of the hillocks extended. Then \nhe said, \"Delay the (Zuhr) Prayer till it gets cooler, for the severity of heat is from the increase in heat \nof Hell (fire).</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 129740,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30450,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 481,
        "hadithText": "<p>\nNarrated Abu Sa`d:\n\n<p>The Prophet (ﷺ) said, \"Delay the (Zuhr) Prayer till it gets cooler, for the severity of heat is from the \nincrease in the heat of Hell (fire).</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 129750,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30460,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 482,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"The (Hell) Fire complained to its Lord saying, 'O my Lord! My different parts \neat up each other.' So, He allowed it to take two breaths, one in the winter and the other in summer, \nand this is the reason for the severe heat and the bitter cold you find (in weather).</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 129760,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30470,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 483,
        "hadithText": "<p>\nNarrated Abu Jamra Ad-Dabi:\n\n<p>I used to sit with Ibn `Abbas in Mecca. Once I had a fever and he said (to me), \"Cool your fever with \nZamzam water, for Allah's Messenger (ﷺ) said: 'It, (the Fever) is from the heat of the (Hell) Fire; so, cool it \nwith water (or Zamzam water).</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 129770,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30480,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 484,
        "hadithText": "<p>\nNarrated Rafi` bin Khadij:\n\n<p>I heard the Prophet (ﷺ) saying, \"Fever is from the heat of the (Hell) Fire; so cool it with water.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 129780,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30490,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 485,
        "hadithText": "<p>\nNarrated Aisha:\n\n<p>The Prophet (ﷺ) said, \"Fever is from the heat of the (Hell) Fire, so cool it with water.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 129790,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30500,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 486,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>The Prophet (ﷺ) said, \"Fever is from the heat of the (Hell) Fire; so abate fever with water.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 129800,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30510,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 487,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"Your (ordinary) fire is one of 70 parts of the (Hell) Fire.\" Someone asked, \"O \nAllah's Messenger (ﷺ) This (ordinary) fire would have been sufficient (to torture the unbelievers),\" Allah's \nApostle said, \"The (Hell) Fire has 69 parts more than the ordinary (worldly) fire, each part is as hot as \nthis (worldly) fire.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 129810,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30520,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 488,
        "hadithText": "<p>\nNarrated Yali:\n\n<p>That he heard the Prophet (ﷺ) on the pulpit reciting:-- \n\"They will cry: \"O Malik!' (43.77) (Malik is the gate-keeper (angel) of the (Hell) Fire.)</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 129820,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30530,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 489,
        "hadithText": "<p>\nNarrated Abu Wail:\n\n<p>Somebody said to Usama, \"Will you go to so-and-so (i.e. `Uthman) and talk to him (i.e. advise him \nregarding ruling the country)?\" He said, \"You see that I don't talk to him. Really I talk to (advise) him \nsecretly without opening a gate (of affliction), for neither do I want to be the first to open it (i.e. \nrebellion), nor will I say to a man who is my ruler that he is the best of all the people after I have \nheard something from Allah s Apostle .\" They said, What have you heard him saying? He said, \"I \nhave heard him saying, \"A man will be brought on the Day of Resurrection and thrown in the (Hell) \nFire, so that his intestines will come out, and he will go around like a donkey goes around a millstone. \nThe people of (Hell) Fire will gather around him and say: O so-and-so! What is wrong with you? \nDidn't you use to order us to do good deeds and forbid us to do bad deeds? He will reply: Yes, I used \nto order you to do good deeds, but I did not do them myself, and I used to forbid you to do bad deeds, \nyet I used to do them myself.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 129830,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30540,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 490,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>Magic was worked on the Prophet (ﷺ) so that he began to fancy that he was doing a thing which he was \nnot actually doing. One day he invoked (Allah) for a long period and then said, \"I feel that Allah has \ninspired me as how to cure myself. Two persons came to me (in my dream) and sat, one by my head \nand the other by my feet. One of them asked the other, \"What is the ailment of this man?\" The other \nreplied, 'He has been bewitched\" The first asked, 'Who has bewitched him?' The other replied, 'Lubaid \nbin Al-A'sam.' The first one asked, 'What material has he used?' The other replied, 'A comb, the hair \ngathered on it, and the outer skin of the pollen of the male date-palm.' The first asked, 'Where is that?' \nThe other replied, 'It is in the well of Dharwan.' \" So, the Prophet (ﷺ) went out towards the well and then \nreturned and said to me on his return, \"Its date-palms (the date-palms near the well) are like the heads \nof the devils.\" I asked, \"Did you take out those things with which the magic was worked?\" He said, \n\"No, for I have been cured by Allah and I am afraid that this action may spread evil amongst the \npeople.\" Later on the well was filled up with earth.</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 129840,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30550,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 491,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"During your sleep, Satan knots three knots at the back of the head of each of \nyou, and he breathes the following words at each knot, 'The night is, long, so keep on sleeping,' If that \nperson wakes up and celebrates the praises of Allah, then one knot is undone, and when he performs \nablution the second knot is undone, and when he prays, all the knots are undone, and he gets up in the \nmorning lively and in good spirits, otherwise he gets up in low spirits and lethargic.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 129850,
        "last_updated": "2013-03-20 16:07:37"
    },
    {
        "englishURN": 30560,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 492,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>It was mentioned before the Prophet (ﷺ) that there was a man who slept the night till morning (after \nsunrise). The Prophet (ﷺ) said, \"He is a man in whose ears (or ear) Satan had urinated.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 129860,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30570,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 493,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>The Prophet (ﷺ) said, \"If anyone of you, when having sexual relation with his wife, say: 'In the name of \nAllah. O Allah! Protect us from Satan and prevent Satan from approaching our offspring you are \ngoing to give us,' and if he begets a child (as a result of that relation) Satan will not harm it.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 129870,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30580,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 494,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>Allah's Messenger (ﷺ) said, \"When the (upper) edge of the sun appears (in the morning), don't perform a \nprayer till the sun appears in full, and when the lower edge of the sun sets, don't perform a prayer till it \nsets completely. And you should not seek to pray at sunrise or sunset for the sun rises between two \nsides of the head of the devil (or Satan).</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 129881,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30591,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 495,
        "hadithText": "<p> \n\n   Narrated Abu Said Al-Khudri: \n\n<p> \n\n   The Prophet (ﷺ) said, \"If while you are praying, somebody intends to pass in front of you, prevent him; and should he insist, prevent him again; and if he insists again, fight with him (i.e. prevent him violently e.g. pushing him violently), because such a person is (like) a devil.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 129900,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30592,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 495,
        "hadithText": "<p> \n\n  Narrated Muhammad bin Sirin: Abu Huraira said, \"Allah's Messenger (ﷺ) put me in charge of the Zakat of Ramadan (i.e. Zakat-ul-Fitr). Someone came to me and started scooping some of the foodstuff of (Zakat) with both hands. I caught him and told him that I would take him to Allah's Messenger (ﷺ).\" Then Abu Huraira told the whole narration and added \"He (i.e. the thief) said, 'Whenever you go to your bed, recite the Verse of \"Al-Kursi\" (2.255) for then a guardian from Allah will be guarding you, and Satan will not approach you till dawn.' \" On that the Prophet (ﷺ) said, \"He told you the truth, though he is a liar, and he (the thief) himself was the Satan.\" \n\n<p></b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 129910,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30600,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 496,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"Satan comes to one of you and says, 'Who created so-and-so? 'till he says, 'Who \nhas created your Lord?' So, when he inspires such a question, one should seek refuge with Allah and \ngive up such thoughts.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 129920,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30610,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 497,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"When the month of Ramadan comes, the gates of Paradise are opened and the \ngates of the (Hell) Fire are closed, and the devils are chained.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 129930,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30620,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 498,
        "hadithText": "<p>\nNarrated Ubai bin Ka`b:\n\n<p>That he heard Allah's Messenger (ﷺ) saying, \"(The prophet) Moses said to his attendant, \"Bring us our early \nmeal' (18.62). The latter said, 'Did you remember when we betook ourselves to the rock? I indeed \nforgot the fish and none but Satan made me forget to remember it.\" (18.63) Moses did not feel tired \ntill he had crossed the place which Allah ordered him to go to.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 129940,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30630,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 499,
        "hadithText": "<p>\nNarrated `Abdullah bin `Umar:\n\n<p>I saw Allah's Messenger (ﷺ) pointing towards the east saying, \"Lo! Afflictions will verily emerge hence; \nafflictions will verily emerge hence where the (side of the head of) Satan appears.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 129950,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30640,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 500,
        "hadithText": "<p>\nNarrated Jabir:\n\n<p>The Prophet (ﷺ) said, \"When nightfalls, then keep your children close to you, for the devil spread out \nthen. An hour later you can let them free; and close the gates of your house (at night), and mention \nAllah's Name thereupon, and cover your utensils, and mention Allah's Name thereupon, (and if you \ndon't have something to cover your utensil) you may put across it something (e.g. a piece of wood \netc.).</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 129960,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30650,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 501,
        "hadithText": "<p>\nNarrated Safiya bint Huyay:\n\n<p>While Allah's Messenger (ﷺ) was in I`tikaf, I called on him at night and having had a talk with him, I got up \nto depart. He got up also to accompany me to my dwelling place, which was then in the house of \nUsama bin Zaid. Two Ansari men passed by, and when they saw the Prophet (ﷺ) they hastened away. The \nProphet said (to them). \"Don't hurry! It is Safiya, the daughter of Huyay (i.e. my wife).\" They said, \n\"Glorified be Allah! O Allah's Messenger (ﷺ)! (How dare we suspect you?)\" He said, \"Satan circulates in the \nhuman mind as blood circulates in it, and I was afraid that Satan might throw an evil thought (or \nsomething) into your hearts.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 129970,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30660,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 502,
        "hadithText": "<p>\nNarrated Sulaiman bin Surd:\n\n<p>While I was sitting in the company of the Prophet, two men abused each other and the face of one of \nthem became red with anger, and his jugular veins swelled (i.e. he became furious). On that the \nProphet said, \"I know a word, the saying of which will cause him to relax, if he does say it. If he says: \n'I seek Refuge with Allah from Satan.' then all is anger will go away.\" Some body said to him, \"The \nProphet has said, 'Seek refuge with Allah from Satan.\"' The angry man said, \"Am I mad?\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 129980,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30670,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 503,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>The Prophet (ﷺ) said, \"If anyone of you, on having sexual relation with his wife, says: 'O Allah! Protect \nme from Satan, and prevent Satan from approaching the offspring you are going to give me,' and if it \nhappens that the lady conceives a child, Satan will neither harm it nor be given power over it.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 129990,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30680,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 504,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) offered a prayer, and (after finishing) he said, \"Satan came in front of me trying \npersistently to divert my attention from the prayer, but Allah gave me the strength to over-power \nhim.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 130000,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30690,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 505,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"When the call for the prayer is pronounced, Satan takes to his heels, passing wind \nwith noise, When the call for the prayer is finished, he comes back. And when the Iqama is \npronounced, he again takes to his heels, and after its completion, he returns again to interfere between \nthe (praying) person and his heart, saying to him. 'Remember this or that thing.' till the person forgets \nwhether he has offered three or four rak`at: so if one forgets whether he has prayed three or four rak`at, \nhe should perform two prostrations of Sahu (i.e. forgetfulness).</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 130010,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30700,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 506,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"When any human being is born. Satan touches him at both sides of the body with \nhis two fingers, except Jesus, the son of Mary, whom Satan tried to touch but failed, for he touched \nthe placenta-cover instead.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 130020,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30710,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 507,
        "hadithText": "<p>\nNarrated Alqama:\n\n<p>I went to Sham (and asked. \"Who is here?\"), The people said, \"Abu Ad-Darda.\" Abu Darda said, \"Is \nthe person whom Allah has protected against Satan, (as Allah's Messenger (ﷺ) said) amongst you\". The subnarrator, \nMughira said that the person who was given Allah's Refuge through the tongue of the \nProphet was `Ammar (bin Yasir).</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 130030,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30720,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 508,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>The Prophet (ﷺ) said, \"While the angels talk amidst the clouds about things that are going to happen on \nearth, the devils hear a word of what they say and pour it in the ears of a soothsayer as one pours \nsomething in a bottle, and they add one hundred lies to that (one word).</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 130040,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30730,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 509,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"Yawning is from Satan and if anyone of you yawns, he should check his yawning \nas much as possible, for if anyone of you (during the act of yawning) should say: 'Ha', Satan will \nlaugh at him.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 130050,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30740,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 510,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>On the day (of the battle) of Uhud when the pagans were defeated, Satan shouted, \"O slaves of Allah! \nBeware of the forces at your back,\" and on that the Muslims of the front files fought with the Muslims \nof the back files (thinking they were pagans). Hudhaifa looked back to see his father \"Al-Yaman,\" \n(being attacked by the Muslims). He shouted, \"O Allah's Slaves! My father! My father!\" By Allah, \nthey did not stop till they killed him. Hudhaifa said, \"May Allah forgive you.\" `Urwa said that \nHudhaifa continued to do good (invoking Allah to forgive the killer of his father till he met Allah (i.e. \ndied).</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 130060,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30750,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 511,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>I asked the Prophet (ﷺ) about one's looking here and there during the prayer. He replied, \"It is what Satan \nsteals from the prayer of any one of you.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 130070,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30761,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 512,
        "hadithText": "<p>\nNarrated Abu Qatada:\n\n<p>as below.<p>\nNarrated Abu Qatada:\n\n<p>The Prophet (ﷺ) said, \"A good dream is from Allah, and a bad or evil dream is from Satan; so if anyone of \nyou has a bad dream of which he gets afraid, he should spit on his left side and should seek Refuge \nwith Allah from its evil, for then it will not harm him.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 130080,
        "last_updated": "2012-05-02 03:39:43"
    },
    {
        "englishURN": 30780,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 514,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"If one says one-hundred times in one day: \"None has the right to be worshipped \nbut Allah, the Alone Who has no partners, to Him belongs Dominion and to Him belong all the \nPraises, and He has power over all things (i.e. Omnipotent)\", one will get the reward of manumitting \nten slaves, and one-hundred good deeds will be written in his account, and one-hundred bad deeds will \nbe wiped off or erased from his account, and on that day he will be protected from the morning till \nevening from Satan, and nobody will be superior to him except one who has done more than that \nwhich he has done.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 130090,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30790,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 515,
        "hadithText": "<p>\nNarrated Sa`d bin Abi Waqqas:\n\n<p>Once `Umar asked the leave to see Allah's Messenger (ﷺ) in whose company there were some Quraishi \nwomen who were talking to him and asking him for more financial support raising their voices. When \n`Umar asked permission to enter the women got up (quickly) hurrying to screen themselves. When \nAllah's Messenger (ﷺ) admitted `Umar, Allah's Messenger (ﷺ) was smiling, `Umar asked, \"O Allah's Messenger (ﷺ)! May \nAllah keep you in happiness always.\" Allah's Messenger (ﷺ) said, \"I am astonished at these women who were with \nme. As soon as they heard your voice, they hastened to screen themselves.\" `Umar said, \"O Allah's \nApostle! You have more right to be feared by them.\" Then he addressed (those women) saying, \"O \nenemies of your own souls! Do you fear me and not Allah's Messenger (ﷺ) ?\" They replied. \"Yes, for you are \na fearful and fierce man as compared with Allah's Messenger (ﷺ).\" On that Allah's Messenger (ﷺ) said (to `Umar), \n\"By Him in Whose Hands my life is, whenever Satan sees you taking a path, he follows a path other \nthan yours.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 130100,
        "last_updated": "2013-03-20 16:08:05"
    },
    {
        "englishURN": 30800,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 516,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"If anyone of you rouses from sleep and performs the ablution, he should wash his \nnose by putting water in it and then blowing it out thrice, because Satan has stayed in the upper part of \nhis nose all the night.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 130110,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30810,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 517,
        "hadithText": "<p>\nNarrated `Abdur-Rahman bin `Abdullah bin `Abdur-Rahman bin Abi Sasaa Ansari:\n\n<p>That Abu Sa`id Al-Khudri said to his father. \"I see you are fond of sheep and the desert, so when you \nwant to pronounce the Adhan, raise your voice with it for whoever will hear the Adhan whether a \nhuman being, or a Jinn, or anything else, will bear witness, in favor on the Day of Resurrection.\" Abu \nSa`id added, \"I have heard this from Allah's Messenger (ﷺ) .\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 130120,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30820,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 518,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>That he heard the Prophet (ﷺ) delivering a sermon on the pulpit saying, \"Kill snakes and kill Dhu-at- \nTufyatain (i.e. a snake with two white lines on its back) and Al-Abtar (i.e. a snake with short or \nmutilated tail) for they destroy the sight of one's eyes and bring about abortion.\" (`Abdullah bin `Umar \nfurther added): Once while I was chasing a snake in order, to kill it, Abu Lubaba called me saying: \n\"Don't kill it,\" I said. \"Allah's Messenger (ﷺ) ordered us to kill snakes.\" He said, \"But later on he prohibited \nthe killing of snakes living in the houses.\" (Az-Zuhri said. \"Such snakes are called Al-Awamir.\")</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 130131,
        "last_updated": "2021-03-14 20:22:49"
    },
    {
        "englishURN": 30825,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 518,
        "hadithText": "Narrated Ibn 'Umar (ra): Abu Lubaba and Zaid bin Khattab saw me.</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 130150,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30830,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 519,
        "hadithText": "<p>\nNarrated Abu Sa`id al-Khudri:\n\n<p>Allah's Messenger (ﷺ) said, \"There will come a time when the best property of a man will be sheep which he \nwill graze on the tops of mountains and the places where rain falls (i.e. pastures) escaping to protect \nhis religion from afflictions.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 130160,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30840,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 520,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"The main source of disbelief is in the east. Pride and arrogance are \ncharacteristics of the owners of horses and camels, and those bedouins who are busy with their camels \nand pay no attention to Religion; while modesty and gentleness are the characteristics of the owners of \nsheep.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 130170,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30850,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 521,
        "hadithText": "<p>\nNarrated `Uqba bin `Umar and Abu Mas`ud:\n\n<p>Allah's Messenger (ﷺ) pointed with his hand towards Yemen and said, \"(True) Belief is Yemenite, towards here (i.e. \nthe Yemenite, had True Belief and embraced Islam readily). Certainly sternness and mercilessness are the \nqualities of those who are loud and at the base of the tails  of camels, where the two \nhorns of Satan will appear. Such qualities belong to the tribes of Rabi`a and Mudar.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 130180,
        "last_updated": "2021-03-14 20:16:54"
    },
    {
        "englishURN": 30860,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 522,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"When you hear the crowing of roosters, ask for Allah's Blessings for (their crowing \nindicates that) they have seen an angel. And when you hear the braying of donkeys, seek Refuge with \nAllah from Satan for (their braying indicates) that they have seen a Satan.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 130190,
        "last_updated": "2021-03-10 17:56:41"
    },
    {
        "englishURN": 30870,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 523,
        "hadithText": "<p>\nNarrated Jabir bin `Abdullah:\n\n<p>Allah's Messenger (ﷺ) said, \"When night falls (or it is evening), keep your children close to you for the devils \nspread out at that time. But when an hour of the night elapses, you can let them free. Close the doors \nand mention the Name of Allah, for Satan does not open a closed door.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 130200,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30880,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 524,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"A group of Israelites were lost. Nobody knows what they did. But I do not see \nthem except that they were cursed and changed into rats, for if you put the milk of a she-camel in front \nof a rat, it will not drink it, but if the milk of a sheep is put in front of it, it will drink it.\" I told this to \nKa`b who asked me, \"Did you hear it from the Prophet (ﷺ) ?\" I said, \"Yes.\" Ka`b asked me the same \nquestion several times.; I said to Ka`b. \"Do I read the Torah? (i.e. I tell you this from the Prophet.)\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 113,
        "matchingArabicURN": 130210,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30890,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 525,
        "hadithText": "<p>\nNarrated Aisha:\n\n<p>The Prophet (ﷺ) called the Salamander, a mischief-doer. I have not heard him ordering that it should be \nkilled. Sa`d bin Waqqas claims that the Prophet (ﷺ) ordered that it should be killed.</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 114,
        "matchingArabicURN": 130220,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30900,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 526,
        "hadithText": "<p>\nNarrated Um Sharik:\n\n<p>That the Prophet (ﷺ) ordered her to kill Salamanders.</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 115,
        "matchingArabicURN": 130230,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30910,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 527,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>The Prophet (ﷺ) said, \"Kill the snake with two white lines on its back, for it blinds the on-looker and \ncauses abortion.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 116,
        "matchingArabicURN": 130240,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30920,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 528,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>The Prophet (ﷺ) ordered that a short-tailed or mutilated-tailed snake (i.e. Abtar) should be killed, for it \nblinds the on-looker and causes abortion.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 117,
        "matchingArabicURN": 130250,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30930,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 529,
        "hadithText": "<p>\nNarrated Abu Mulaika:\n\n<p>Ibn `Umar used to kill snakes, but afterwards he forbade their killing and said, \"Once the Prophet (ﷺ) \npulled down a wall and saw a cast-off skin of a snake in it. He said, 'Look for the snake. 'They found it \nand the Prophet (ﷺ) said, \"Kill it.\" For this reason I used to kill snakes. Later on I met Abu Lubaba who \ntold me the Prophet (ﷺ) said, 'Do not kill snakes except the short-tailed or mutilated-tailed snake with two \nwhite lines on its back, for it causes abortion and makes one blind. So kill it.' \"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 118,
        "matchingArabicURN": 130261,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30940,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 530,
        "hadithText": "<p>\nNarrated Nafi`:\n\n<p>Ibn `Umar used to kill snakes but when Abu Lubaba informed him that the Prophet (ﷺ) had forbidden the \nkilling of snakes living in houses, he gave up killing them.</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 119,
        "matchingArabicURN": 130280,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30950,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 531,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>The Prophet (ﷺ) said, \"Five kinds of animals are mischief-doers and can be killed even in the Sanctuary: \nThey are the rat the scorpion, the kite (a type of predatory bird), the crow and the rabid dog.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 120,
        "matchingArabicURN": 130290,
        "last_updated": "2021-03-14 20:20:10"
    },
    {
        "englishURN": 30960,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 532,
        "hadithText": "<p>\nNarrated `Abdullah bin `Umar:\n\n<p>Allah's Messenger (ﷺ) said, \"It is not sinful of a person in the state of Ihram to kill any of these five animals: \nThe scorpion, the rat, the rabid dog, the crow and the kite.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 121,
        "matchingArabicURN": 130300,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30970,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 533,
        "hadithText": "<p>\nNarrated Jabir bin `Abdullah:\n\n<p>The Prophet (ﷺ) said, \"Cover your utensils and tie your water skins, and close your doors and keep your \nchildren close to you at night, as the Jinns spread out at such time and snatch things away. When you \ngo to bed, put out your lights, for the mischief-doer (i.e. the rat) may drag away the wick of the candle \nand burn the dwellers of the house.\" Ata said, \"The devils.\" (instead of the Jinns).</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 122,
        "matchingArabicURN": 130310,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30980,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 534,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>Once we were in the company of Allah's Messenger (ﷺ) in a cave. Surat-al-Mursalat (77) was revealed there, \nand we were learning it from Allah's Messenger (ﷺ) . Suddenly a snake came out of its hole and we rushed \ntowards it to kill it, but it hastened and entered its hole before we were able to catch it. Allah's Messenger (ﷺ) \nsaid,\" It has been saved from your evil and you have been saved from its evil.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 123,
        "matchingArabicURN": 130320,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 30990,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 535,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>The Prophet (ﷺ) said, \"A woman entered the (Hell) Fire because of a cat which she had tied, neither \ngiving it food nor setting it free to eat from the vermin of the earth. \"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 124,
        "matchingArabicURN": 130330,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31000,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 536,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"Once while a prophet amongst the prophets was taking a rest underneath a tree, \nan ant bit him. He, therefore, ordered that his luggage be taken away from underneath that tree and \nthen ordered that the dwelling place of the ants should be set on fire. Allah sent him a revelation:-- \n\"Wouldn't it have been sufficient to burn a single ant? (that bit you): (See Page 162, chapter No. 153).</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 125,
        "matchingArabicURN": 130340,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31010,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 537,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said \"If a house fly falls in the drink of anyone of you, he should dip it (in the drink) and take it out, for \none of its wings has a disease and the other has the cure for the disease.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 126,
        "matchingArabicURN": 130350,
        "last_updated": "2015-02-17 12:18:20"
    },
    {
        "englishURN": 31020,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 538,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"A prostitute was forgiven by Allah, because, passing by a panting dog near a \nwell and seeing that the dog was about to die of thirst, she took off her shoe, and tying it with her \nhead-cover she drew out some water for it. So, Allah forgave her because of that.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 127,
        "matchingArabicURN": 130360,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31030,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 539,
        "hadithText": "<p>\r\nNarrated Abu Talha:\r\n\r\n<p>The Prophet (ﷺ) said, \"Angels do not enter a house that has either a dog or a picture in it.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 128,
        "matchingArabicURN": 130370,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31040,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 540,
        "hadithText": "<p>\nNarrated `Abdullah bin `Umar:\n\n<p>Allah's Messenger (ﷺ) ordered that the dogs should be killed.</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 129,
        "matchingArabicURN": 130380,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31050,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 541,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"If somebody keeps a dog, he loses one Qirat (of the reward) of his good deeds \neveryday, except if he keeps it for the purpose of agriculture or for the protection of livestock. \"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 130,
        "matchingArabicURN": 130390,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31060,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 54,
        "bookName": "Beginning of Creation",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 542,
        "hadithText": "<p>\nNarrated Sufyan bin Abi Zuhair Ash-Shani:\n\n<p>That he heard Allah's Messenger (ﷺ) saying, \"If somebody keeps a dog that is neither used for farm work nor \nfor guarding the livestock, he will lose one Qirat (of the reward) of his good deeds everyday.\"</b>",
        "bookID": "54.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 131,
        "matchingArabicURN": 130400,
        "last_updated": "2012-04-26 07:00:00"
    }
]