[
    {
        "englishURN": 31070,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 543,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"Allah created Adam, making him 60 cubits tall. When He created him, He said to \nhim, \"Go and greet that group of angels, and listen to their reply, for it will be your greeting \n(salutation) and the greeting (salutations of your offspring.\" So, Adam said (to the angels), As-Salamu \nAlaikum (i.e. Peace be upon you). The angels said, \"As-salamu Alaika wa Rahmatu-l-lahi\" (i.e. Peace \nand Allah's Mercy be upon you). Thus the angels added to Adam's salutation the expression, 'Wa \nRahmatu-l-lahi,' Any person who will enter Paradise will resemble Adam (in appearance and figure). \nPeople have been decreasing in stature since Adam's creation.</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 171070,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31080,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 544,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"The first group of people who will enter Paradise, will be glittering like the full \nmoon and those who will follow them, will glitter like the most brilliant star in the sky. They will not \nurinate, relieve nature, spit, or have any nasal secretions. Their combs will be of gold, and their sweat \nwill smell like musk. The aloes-wood will be used in their centers. Their wives will be houris. All of \nthem will look alike and will resemble their father Adam (in stature), sixty cubits tall.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 171080,
        "last_updated": "2015-01-13 11:33:42"
    },
    {
        "englishURN": 31090,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 545,
        "hadithText": "<p>\nNarrated Zainab bint Abi Salama:\n\n<p>Um Salama said, \"Um Sulaim said, 'O Allah's Messenger (ﷺ)! Allah does not refrain from saying the truth! Is \nit obligatory for a woman to take a bath after she gets nocturnal discharge?' He said, 'Yes, if she \nnotices the water (i.e. discharge).' Um Salama smiled and said, 'Does a woman get discharge?' Allah's \nApostle said. 'Then why does a child resemble (its mother)?\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 171090,
        "last_updated": "2015-02-10 11:04:45"
    },
    {
        "englishURN": 31100,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 546,
        "hadithText": "<p>\nNarrated Anas:\n\n<p>When `Abdullah bin Salam heard the arrival of the Prophet (ﷺ) at Medina, he came to him and said, \"I am \ngoing to ask you about three things which nobody knows except a prophet: What is the first portent of \nthe Hour? What will be the first meal taken by the people of Paradise? Why does a child resemble its \nfather, and why does it resemble its maternal uncle\" Allah's Messenger (ﷺ) said, \"Gabriel has just now told \nme of their answers.\" `Abdullah said, \"He (i.e. Gabriel), from amongst all the angels, is the enemy of \nthe Jews.\" Allah's Messenger (ﷺ) said, \"The first portent of the Hour will be a fire that will bring together the \npeople from the east to the west; the first meal of the people of Paradise will be Extra-lobe (caudate \nlobe) of fish-liver. As for the resemblance of the child to its parents: If a man has sexual intercourse \nwith his wife and gets discharge first, the child will resemble the father, and if the woman gets \ndischarge first, the child will resemble her.\" On that `Abdullah bin Salam said, \"I testify that you are \nthe Messenger of Allah.\" `Abdullah bin Salam further said, \"O Allah's Messenger (ﷺ)! The Jews are liars, and if \nthey should come to know about my conversion to Islam before you ask them (about me), they would \ntell a lie about me.\" The Jews came to Allah's Messenger (ﷺ) and `Abdullah went inside the house. Allah's \nApostle asked (the Jews), \"What kind of man is `Abdullah bin Salam amongst you?\" They replied, \n\"He is the most learned person amongst us, and the best amongst us, and the son of the best amongst \nus.\" Allah's Messenger (ﷺ) said, \"What do you think if he embraces Islam (will you do as he does)?\" The \nJews said, \"May Allah save him from it.\" Then `Abdullah bin Salam came out in front of them saying, \n\"I testify that None has the right to be worshipped but Allah and that Muhammad is the Apostle of \nAllah.\" Thereupon they said, \"He is the evilest among us, and the son of the evilest amongst us,\" and \ncontinued talking badly of him.</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 171100,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31110,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 547,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"But for the Israelis, meat would not decay and but for Eve, wives would never \nbetray their husbands.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 171110,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31120,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 548,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah 's Apostle said, \"Treat women nicely, for a women is created from a rib, and the most curved \nportion of the rib is its upper portion, so, if you should try to straighten it, it will break, but if you \nleave it as it is, it will remain crooked. So treat women nicely.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 171120,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31130,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 549,
        "hadithText": "<p>\r\nNarrated `Abdullah:\r\n\r\n<p>Allah's Messenger (ﷺ), the true and truly inspired said, \"(as regards your creation), every one of you is \r\ncollected in the womb of his mother for the first forty days, and then he becomes a clot for another \r\nforty days, and then a piece of flesh for another forty days. Then Allah sends an angel to write four \r\nitems: He writes his deeds, time of his death, means of his livelihood, and whether he will be \r\nwretched or blessed (in religion). Then the soul is breathed into his body. So a man may do deeds \r\ncharacteristic of the people of the (Hell) Fire, so much so that there is only the distance of a cubit \r\nbetween him and it, and then what has been written (by the angel) surpasses, and so he starts doing \r\ndeeds characteristic of the people of Paradise and enters Paradise. Similarly, a person may do deeds \r\ncharacteristic of the people of Paradise, so much so that there is only the distance of a cubit between \r\nhim and it, and then what has been written (by the angel) surpasses, and he starts doing deeds of the \r\npeople of the (Hell) Fire and enters the (Hell) Fire.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 171130,
        "last_updated": "2012-08-08 23:21:52"
    },
    {
        "englishURN": 31140,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 550,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>The Prophet (ﷺ) said, \"Allah has appointed an angel in the womb, and the angel says, 'O Lord! A drop of \ndischarge (i.e. of semen), O Lord! a clot, O Lord! a piece of flesh.' And then, if Allah wishes to \ncomplete the child's creation, the angel will say. 'O Lord! A male or a female? O Lord! wretched or \nblessed (in religion)? What will his livelihood be? What will his age be?' The angel writes all this \nwhile the child is in the womb of its mother.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 171140,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31150,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 551,
        "hadithText": "<p>\nNarrated Anas:\n\n<p>The Prophet (ﷺ) said, \"Allah will say to that person of the (Hell) Fire who will receive the least \npunishment, 'If you had everything on the earth, would you give it as a ransom to free yourself (i.e. \nsave yourself from this Fire)?' He will say, 'Yes.' Then Allah will say, 'While you were in the \nbackbone of Adam, I asked you much less than this, i.e. not to worship others besides Me, but you \ninsisted on worshipping others besides me.' \"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 171150,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31160,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 552,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>Allah's Messenger (ﷺ) said, \"Whenever a person is murdered unjustly, there is a share from the burden of the \ncrime on the first son of Adam for he was the first to start the tradition of murdering.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 171160,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31165,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 552,
        "hadithText": "Narrated Aishah (ra): I heard the Prophet (ﷺ), \"Souls are like recruited troops: Those who are like qualities are inclined to each other, but those who have dissimilar qualities, differ.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 171170,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31170,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 553,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>Once Allah's Messenger (ﷺ) stood amongst the people, glorified and praised Allah as He deserved and then \nmentioned the Dajjal saying, \"l warn you against him (i.e. the Dajjal) and there was no prophet but \nwarned his nation against him. No doubt, Noah warned his nation against him but I tell you about him \nsomething of which no prophet told his nation before me. You should know that he is one-eyed, and \nAllah is not one-eyed.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 171180,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31180,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 554,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"Shall I not tell you about the Dajjal a story of which no prophet told his nation? \nThe Dajjall is one-eyed and will bring with him what will resemble Hell and Paradise, and what he \nwill call Paradise will be actually Hell; so I warn you (against him) as Noah warned his nation against \nhim.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 171190,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31190,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 555,
        "hadithText": "<p>\nNarrated Abu Sa`id:\n\n<p>Allah's Messenger (ﷺ) said, \"Noah and his nation will come (on the Day of Resurrection and Allah will ask \n(Noah), \"Did you convey (the Message)?' He will reply, 'Yes, O my Lord!' Then Allah will ask Noah's \nnation, 'Did Noah convey My Message to you?' They will reply, 'No, no prophet came to us.' Then \nAllah will ask Noah, 'Who will stand a witness for you?' He will reply, 'Muhammad and his followers \n(will stand witness for me).' So, I and my followers will stand as witnesses for him (that he conveyed \nAllah's Message).\" That is, (the interpretation) of the Statement of Allah: \"Thus we have made you a \njust and the best nation that you might be witnesses Over mankind ..\" (2.143)</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 171200,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31200,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 556,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>We were in the company of the Prophet (ﷺ) at a banquet and a cooked (mutton) forearm was set before \nhim, and he used to like it. He ate a morsel of it and said, \"I will be the chief of all the people on the \nDay of Resurrection. Do you know how Allah will gather all the first and the last (people) in one level \nplace where an observer will be able to see (all) of them and they will be able to hear the announcer, \nand the sun will come near to them. Some People will say: Don't you see, in what condition you are \nand the state to which you have reached? Why don't you look for a person who can intercede for you \nwith your Lord? Some people will say: Appeal to your father, Adam.' They will go to him and say: 'O \nAdam! You are the father of all mankind, and Allah created you with His Own Hands, and ordered the \nangels to prostrate for you, and made you live in Paradise. Will you not intercede for us with your \nLord? Don't you see in what (miserable) state we are, and to what condition we have reached?' On that \nAdam will reply, 'My Lord is so angry as He has never been before and will never be in the future; \n(besides), He forbade me (to eat from) the tree, but I disobeyed (Him), (I am worried about) myself! \nMyself! Go to somebody else; go to Noah.' They will go to Noah and say; 'O Noah! You are the first \namongst the messengers of Allah to the people of the earth, and Allah named you a thankful slave. \nDon't you see in what a (miserable) state we are and to what condition we have reached? Will you not \nintercede for us with your Lord? Noah will reply: 'Today my Lord has become so angry as he had \nnever been before and will never be in the future Myself! Myself! Go to the Prophet (Muhammad). \nThe people will come to me, and I will prostrate myself underneath Allah's Throne. Then I will be \naddressed: 'O Muhammad! Raise your head; intercede, for your intercession will be accepted, and ask \n(for anything). for you will be given. \"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 171210,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31210,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 557,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>Allah's Messenger (ﷺ) recited the following Verse) in the usual tone: 'Fahal-Min-Muddalkir.' (54.15)</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 171220,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31215,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 557,
        "hadithText": "Narrated Anas (ra): Abu Dhar (ra) used to say that Allah's  Messenger (ﷺ) said, \"While I was at Makkah, the roof of my house was opened and Jibril descended, opened my chest, and washed it with Zamzam water. Then he brought a golden tray full of wisdom and faith, and having poured its contents into my chest, he closed it. Then he took my hand and ascended with me to the heaven. When Jibril reached the nearest heaven, he said to the gatekeeper of the heaven, 'Open (the gate).' The gatekeeper asked, 'who is it?' Jibril answered, 'Jibril'. He asked, 'Is there anyone with you?' Jibril replied, 'Muhammad (ﷺ) is with me.' He asked, 'Has he been called?', Jibril said, 'Yes'. So, the gate was opened and we went over the nearest heaven, and there we saw a man sitting with Aswida (a large number of people) of his right and Aswida on his left. When he looked towards his right, he laughed and when he looked towards his left he wept. He said (to me), 'Welcome, O pious Prophet and pious son'. I said, 'Who is this man O Jibril?' Jibril replied, 'He is Adam, and the people on his right and left are the souls of his offspring. Those on the right are the people of Paradise, and those on the left are the people of the (Hell) Fire. So, when he looks to the right, he laughs, and when he looks to the left he weeps.' Then Jibril ascended with me till he reached the second heaven and said to the gatekeeper, 'Open (the gate).' The gatekeeper said to him the same as the gatekeeper of the first heaven has said, and he opened the gate.\"\n\nAnas added: Abu Dhar mentioned that Prophet (ﷺ) met Idris, Musa (Moses), 'Isa (Jesus) and Ibrahim (Abraham) over the heavens, but he did not specify their places (i.e., on which heavens each of them was), but he mentioned that he (the Prophet (ﷺ)) had met Adam on the nearest heaven, and Ibrahim on the sixth. Anas said, \"When Jibril and the Prophet (ﷺ) passed by Idris, the latter said, 'Welcome, O pious Prophet and pious brother!' the Prophet (ﷺ) asked, 'Who is he?' Jibril said, 'He is Idris.' \" The Prophet (ﷺ) added, \"Then I passed by Musa who said, 'Welcome, O pious Prophet  and pious brother!' I said, 'Who is he?' Jibril said, 'He is Musa.' Then I passed by 'Isa who said, 'Welcome, O pious Prophet and pious brother!' I said, 'Who is he?' He replied, 'He is 'Isa.' Then I passed by the Prophet (ﷺ) Ibrahim who said, 'Welcome, O pious Prophet and pious son!' I said, 'Who is he?' Jibril replied, 'He is Ibrahim'.\"\n\nNarrated Ibn 'Abbas and Abu Haiyya Al-Ansari: The Prophet (ﷺ) said, \"Then Jibril ascended with me to a place where I heard the creaking of pens.\" Ibn Hazm and Anas bin Malik state the Prophet (ﷺ) said, \"Allah enjoined fifty Salat (prayers) on me. When I returned with this order of Allah, I passed by Musa who asked me, 'What has Allah enjoined on your followers?' I replied, 'He has enjoined fifty Salat (prayers) on them.' On the Musa said to me, 'Go back to your Lord (and appeal for reduction), for your followers will not be able to bear it.' So, I returned to my Lord and asked for some reduction, and He reduced it to half. When I passed by Musa again and informed him about it, he once more said to me, 'Go back to your Lord, for your followers will not be able to bear it.' So, I returned to my Lord similarly as before, and half of it was reduced. I again passed by Musa and he said to me, 'Go back to your Lord, for your followers will not be able to bear it.' I again returned to my Lord and He said, 'These are five (Salat-prayers) and they are all (equal to) fifty (in reward), for My Word does not change.' I returned to Musa, he again told me to return to my Lord (for further reduction) but I said to him 'I feel shy of asking my Lord now.' Then Jibril took me till we reached Sidrat-ul-Muntaha (i.e., lote tree of utmost boundary) which was shrouded in colors indescribable. Then I was admitted into Paradise where I found small tents (made) of pearls and its earth was musk (a kind of perfume).\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 171230,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31221,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 558,
        "hadithText": "<p> Narrated Ibn `Abbas: <p>The Prophet (ﷺ) said, \"I have been made victorious with As-Saba (i.e. an easterly wind) and the people of 'Ad were destroyed by Ad-Dabur (i.e. a westerly wind).\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 171240,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31222,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 558,
        "hadithText": "Narrated Abu Sa`id: `Ali sent a piece of gold to the Prophet (ﷺ) who distributed it among four persons: Al-Aqra' bin H`Abis Al-Hanzali from the tribe of Mujashi, 'Uyaina bin Badr Al-Fazari, Zaid at-Ta'i who belonged to (the tribe of) Bani Nahban, and 'Alqama bin Ulatha Al-`Amir who belonged to (the tribe of) Bani Kilab. So the Quraish and the Ansar became angry and said, \"He (i.e. the Prophet, ) gives the chief of Najd and does not give us.\" The Prophet (ﷺ) said, \"I give them) so as to attract their hearts (to Islam).\" Then a man with sunken eyes, prominent checks, a raised forehead, a thick beard and a shaven head, came (in front of the Prophet (ﷺ) ) and said, \"Be afraid of Allah, O Muhammad!\" The Prophet (ﷺ) ' said \"Who would obey Allah if I disobeyed Him? (Is it fair that) Allah has trusted all the people of the earth to me while, you do not trust me?\" Somebody who, I think was Khalid bin Al-Walid, requested the Prophet (ﷺ) to let him chop that man's head off, but he prevented him. When the man left, the Prophet (ﷺ) said, \"Among the off-spring of this man will be some who will recite the Qur'an but the Qur'an will not reach beyond their throats (i.e. they will recite like parrots and will not understand it nor act on it), and they will renegade from the religion as an arrow goes through the game's body. They will kill the Muslims but will not disturb the idolaters. If I should live up to their time' I will kill them as the people of 'Ad were killed (i.e. I will kill all of them).\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 171250,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31230,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 559,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>I heard the Prophet (ﷺ) reciting: \"Fahal Min Muddakir.\" (See Hadith No. 557)</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 171260,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31290,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 565,
        "hadithText": "<p>\nNarrated Zainab bint Jahsh:\n\n<p>That the Prophet (ﷺ) once came to her in a state of fear and said, \"None has the right to be worshipped but \nAllah. Woe unto the Arabs from a danger that has come near. An opening has been made in the wall \nof Gog and Magog like this,\" making a circle with his thumb and index finger. Zainab bint Jahsh said, \n\"O Allah's Messenger (ﷺ)! Shall we be destroyed even though there are pious persons among us?\" He said, \n\"Yes, when the evil person will increase.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 171270,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31300,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 566,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"Allah has made an opening in the wall of the Gog and Magog (people) like this, \nand he made with his hand (with the help of his fingers).</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 171280,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31310,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 567,
        "hadithText": "<p>\nNarrated Abu Sa`id Al-Khudri:\n\n<p>The Prophet (ﷺ) said, \"Allah will say (on the Day of Resurrection), 'O Adam.' Adam will reply, 'Labbaik \nwa Sa`daik', and all the good is in Your Hand.' Allah will say: 'Bring out the people of the fire.' Adam \nwill say: 'O Allah! How many are the people of the Fire?' Allah will reply: 'From every one thousand, \ntake out nine-hundred-and ninety-nine.' At that time children will become hoary headed, every \npregnant female will have a miscarriage, and one will see mankind as drunken, yet they will not be \ndrunken, but dreadful will be the Wrath of Allah.\" The companions of the Prophet (ﷺ) asked, \"O Allah's \nApostle! Who is that (excepted) one?\" He said, \"Rejoice with glad tidings; one person will be from \nyou and one-thousand will be from Gog and Magog.\" \nThe Prophet (ﷺ) further said, \"By Him in Whose Hands my life is, hope that you will be one-fourth of the \npeople of Paradise.\" We shouted, \"Allahu Akbar!\" He added, \"I hope that you will be one-third of the \npeople of Paradise.\" We shouted, \"Allahu Akbar!\" He said, \"I hope that you will be half of the people \nof Paradise.\" We shouted, \"Allahu Akbar!\" He further said, \"You (Muslims) (compared with non \nMuslims) are like a black hair in the skin of a white ox or like a white hair in the skin of a black ox \n(i.e. your number is very small as compared with theirs).</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 171290,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31320,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 568,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>The Prophet (ﷺ) said, \"You will be gathered (on the Day of Judgment), bare-footed, naked and not \ncircumcised.\" He then recited:--'As We began the first creation, We, shall repeat it: A Promise We \nhave undertaken: Truly we shall do it.' (21.104) He added, \"The first to be dressed on the Day of \nResurrection, will be Abraham, and some of my companions will be taken towards the left side (i.e. to \nthe (Hell) Fire), and I will say: 'My companions! My companions!' It will be said: 'They renegade \nfrom Islam after you left them.' Then I will say as the Pious slave of Allah (i.e. Jesus) said. 'And I was \na witness Over them while I dwelt amongst them. When You took me up You were the Watcher over \nthem, And You are a witness to all things. If You punish them. They are Your slaves And if You \nforgive them, Verily you, only You are the All-Mighty, the All-Wise.\" (5.120-121)</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 171300,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31330,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 569,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"On the Day of Resurrection Abraham will meet his father Azar whose face will be \ndark and covered with dust.(The Prophet (ﷺ) Abraham will say to him): 'Didn't I tell you not to disobey \nme?' His father will reply: 'Today I will not disobey you.' 'Abraham will say: 'O Lord! You promised \nme not to disgrace me on the Day of Resurrection; and what will be more disgraceful to me than \ncursing and dishonoring my father?' Then Allah will say (to him):' 'I have forbidden Paradise for the \ndisbelievers.\" Then he will be addressed, 'O Abraham! Look! What is underneath your feet?' He will \nlook and there he will see a Dhabh (an animal,) blood-stained, which will be caught by the legs and \nthrown in the (Hell) Fire.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 171310,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31340,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 570,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>The Prophet (ﷺ) entered the Ka`ba and found in it the pictures of (Prophet) Abraham and Mary. On that \nhe said' \"What is the matter with them ( i.e. Quraish)? They have already heard that angels do not \nenter a house in which there are pictures; yet this is the picture of Abraham. And why is he depicted as \npracticing divination by arrows?\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 171320,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31350,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 571,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>When the Prophet (ﷺ) saw pictures in the Ka`ba, he did not enter it till he ordered them to be erased. \nWhen he saw (the pictures of Abraham and Ishmael carrying the arrows of divination, he said, \"May \nAllah curse them (i.e. the Quraish)! By Allah, neither Abraham nor Ishmael practiced divination by \narrows.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 171330,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31360,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 572,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The people said, \"O Allah's Messenger (ﷺ)! Who is the most honorable amongst the people (in Allah's \nSight)?\" He said, \"The most righteous amongst them.\" They said, \"We do not ask you, about this. \" He \nsaid, \"Then Joseph, Allah's Prophet, the son of Allah's Prophet, The son of Allah's Prophet the son of \nAllah's Khalil (i.e. Abraham).\" They said, \"We do not want to ask about this,\" He said' \"Then you \nwant to ask about the descent of the Arabs. Those who were the best in the pre-lslamic period of \nignorance will be the best in Islam provided they comprehend the religious knowledge.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 171340,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31370,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 573,
        "hadithText": "<p>\nNarrated Samura:\n\n<p>Allah's Messenger (ﷺ) said, \"Two persons came to me at night (in dream) (and took me along with them). \nWe passed by a tall man who was so tall that I was not able to see his head and that person was \nAbraham.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 171350,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31380,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 574,
        "hadithText": "<p>\nNarrated Mujahid:\n\n<p>That when the people mentioned before Ibn `Abbas that the Dajjal would have the word Kafir, (i.e. \nunbeliever) or the letters Kafir (the root of the Arabic verb 'disbelieve') written on his forehead, I \nheard Ibn `Abbas saying, \"I did not hear this, but the Prophet (ﷺ) said, 'If you want to see Abraham, then \nlook at your companion (i.e. the Prophet) but Moses was a curly-haired, brown man (who used to \nride) a red camel, the reins of which was made of fires of date-palms. As if I were now looking down \na valley.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 171360,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31391,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 575,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"Abraham did his circumcision with an adze* at the age of eighty.\"\n<br><br>\nNarrated Abu Az-Zinad:\n<br>(as above) With an adze*.\n<br><br>\n* a type of cured blade axe.</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 171370,
        "last_updated": "2021-03-10 18:02:17"
    },
    {
        "englishURN": 31410,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 577,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"Abraham did not tell a lie except on three occasions.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 171380,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31420,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 578,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Abraham did not tell a lie except on three occasion. Twice for the Sake of Allah when he said, \"I am \nsick,\" and he said, \"(I have not done this but) the big idol has done it.\" The (third was) that while \nAbraham and Sarah (his wife) were going (on a journey) they passed by (the territory of) a tyrant. \nSomeone said to the tyrant, \"This man (i.e. Abraham) is accompanied by a very charming lady.\" So, \nhe sent for Abraham and asked him about Sarah saying, \"Who is this lady?\" Abraham said, \"She is my \nsister.\" Abraham went to Sarah and said, \"O Sarah! There are no believers on the surface of the earth \nexcept you and I. This man asked me about you and I have told him that you are my sister, so don't \ncontradict my statement.\" The tyrant then called Sarah and when she went to him, he tried to take hold \nof her with his hand, but (his hand got stiff and) he was confounded. He asked Sarah. \"Pray to Allah \nfor me, and I shall not harm you.\" So Sarah asked Allah to cure him and he got cured. He tried to take \nhold of her for the second time, but (his hand got as stiff as or stiffer than before and) was more \nconfounded. He again requested Sarah, \"Pray to Allah for me, and I will not harm you.\" Sarah asked \nAllah again and he became alright. He then called one of his guards (who had brought her) and said, \n\"You have not brought me a human being but have brought me a devil.\" The tyrant then gave Hajar as \na girl-servant to Sarah. Sarah came back (to Abraham) while he was praying. Abraham, gesturing with \nhis hand, asked, \"What has happened?\" She replied, \"Allah has spoiled the evil plot of the infidel (or \nimmoral person) and gave me Hajar for service.\" (Abu Huraira then addressed his listeners saying, \n\"That (Hajar) was your mother, O Bani Ma-is-Sama (i.e. the Arabs, the descendants of Ishmael, \nHajar's son).</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 171390,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31430,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 579,
        "hadithText": "<p>\nNarrated Um Sharik:\n\n<p>Allah's Messenger (ﷺ) ordered that the salamander should be killed and said, \"It (i.e. the salamander) blew \n(the fire) on Abraham.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 171400,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31440,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 580,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>When the Verse:--\"It is those who believe and do not confuse their belief with wrong ( i.e. joining \nothers in worship with Allah\" (6.83) was revealed, we said, \"O Allah's Messenger (ﷺ)! Who is there amongst \nus who has not done wrong to himself?\" He replied, \"It is not as you say, for 'wrong' in the Verse and \n'do not confuse their belief, with wrong means 'SHIRK' (i.e. joining others in worship with Allah). \nHaven't you heard Luqman's saying to his son, 'O my son! Join not others in worship with Allah, \nverily joining others in worship with Allah is a great wrong indeed.\" (31.13)</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 171410,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31450,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 581,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>One day some meat was given to the Prophet (ﷺ) and he said, \"On the Day of Resurrection Allah will \ngather all the first and the last (people) in one plain, and the voice of the announcer will reach all of \nthem, and one will be able to see them all, and the sun will come closer to them.\" (The narrator then \nmentioned the narration of intercession): \"The people will go to Abraham and say: 'You are Allah's \nProphet and His Khalil on the earth. Will you intercede for us with your Lord?' Abraham will then \nremember his lies and say: 'Myself! Myself! Go to Moses.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 171420,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31460,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 582,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>The Prophet (ﷺ) said, \"May Allah bestow His Mercy on the mother of Ishmael! Had she not hastened (to \nfill her water-skin with water from the Zamzam well). Zamzam would have been a stream flowing on \nthe surface of the earth.\" Ibn `Abbas further added, \"(The Prophet) Abraham brought Ishmael and his \nmother (to Mecca) and she was suckling Ishmael and she had a water-skin with her.'</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 171431,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31470,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 583,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>The first lady to use a girdle was the mother of Ishmael. She used a girdle so that she might hide her \ntracks from Sarah. Abraham brought her and her son Ishmael while she was suckling him, to a place \nnear the Ka`ba under a tree on the spot of Zamzam, at the highest place in the mosque. During those \ndays there was nobody in Mecca, nor was there any water So he made them sit over there and placed \nnear them a leather bag containing some dates, and a small water-skin containing some water, and set \nout homeward. Ishmael's mother followed him saying, \"O Abraham! Where are you going, leaving us \nin this valley where there is no person whose company we may enjoy, nor is there anything (to \nenjoy)?\" She repeated that to him many times, but he did not look back at her Then she asked him, \n\"Has Allah ordered you to do so?\" He said, \"Yes.\" She said, \"Then He will not neglect us,\" and \nreturned while Abraham proceeded onwards, and on reaching the Thaniya where they could not see \nhim, he faced the Ka`ba, and raising both hands, invoked Allah saying the following prayers: \n'O our Lord! I have made some of my offspring dwell in a valley without cultivation, by Your Sacred \nHouse (Ka`ba at Mecca) in order, O our Lord, that they may offer prayer perfectly. So fill some hearts \namong men with love towards them, and (O Allah) provide them with fruits, so that they may give \nthanks.' (14.37) Ishmael's mother went on suckling Ishmael and drinking from the water (she had). \nWhen the water in the water-skin had all been used up, she became thirsty and her child also became \nthirsty. She started looking at him (i.e. Ishmael) tossing in agony; She left him, for she could not \nendure looking at him, and found that the mountain of Safa was the nearest mountain to her on that \nland. She stood on it and started looking at the valley keenly so that she might see somebody, but she \ncould not see anybody. Then she descended from Safa and when she reached the valley, she tucked up \nher robe and ran in the valley like a person in distress and trouble, till she crossed the valley and \nreached the Marwa mountain where she stood and started looking, expecting to see somebody, but she \ncould not see anybody. She repeated that (running between Safa and Marwa) seven times.\" \nThe Prophet (ﷺ) said, \"This is the source of the tradition of the walking of people between them (i.e. Safa \nand Marwa). When she reached the Marwa (for the last time) she heard a voice and she asked herself \nto be quiet and listened attentively. She heard the voice again and said, 'O, (whoever you may be)! \nYou have made me hear your voice; have you got something to help me?\" And behold! She saw an \nangel at the place of Zamzam, digging the earth with his heel (or his wing), till water flowed from that \nplace. She started to make something like a basin around it, using her hand in this way, and started \nfilling her water-skin with water with her hands, and the water was flowing out after she had scooped \nsome of it.\" \nThe Prophet (ﷺ) added, \"May Allah bestow Mercy on Ishmael's mother! Had she let the Zamzam (flow \nwithout trying to control it) (or had she not scooped from that water) (to fill her water-skin), Zamzam \nwould have been a stream flowing on the surface of the earth.\" The Prophet (ﷺ) further added, \"Then she \ndrank (water) and suckled her child. The angel said to her, 'Don't be afraid of being neglected, for this \nis the House of Allah which will be built by this boy and his father, and Allah never neglects His \npeople.' The House (i.e. Ka`ba) at that time was on a high place resembling a hillock, and when \ntorrents came, they flowed to its right and left. She lived in that way till some people from the tribe of \nJurhum or a family from Jurhum passed by her and her child, as they (i.e. the Jurhum people) were \ncoming through the way of Kada'. They landed in the lower part of Mecca where they saw a bird that \nhad the habit of flying around water and not leaving it. They said, 'This bird must be flying around \nwater, though we know that there is no water in this valley.' They sent one or two messengers who \ndiscovered the source of water, and returned to inform them of the water. So, they all came (towards \nthe water).\" The Prophet (ﷺ) added, \"Ishmael's mother was sitting near the water. They asked her, 'Do you \nallow us to stay with you?\" She replied, 'Yes, but you will have no right to possess the water.' They \nagreed to that.\" The Prophet (ﷺ) further said, \"Ishmael's mother was pleased with the whole situation as \nshe used to love to enjoy the company of the people. So, they settled there, and later on they sent for \ntheir families who came and settled with them so that some families became permanent residents \nthere. The child (i.e. Ishmael) grew up and learnt Arabic from them and (his virtues) caused them to \nlove and admire him as he grew up, and when he reached the age of puberty they made him marry a \nwoman from amongst them. \nAfter Ishmael's mother had died, Abraham came after Ishmael's marriage in order to see his family \nthat he had left before, but he did not find Ishmael there. When he asked Ishmael's wife about him, she \nreplied, 'He has gone in search of our livelihood.' Then he asked her about their way of living and their \ncondition, and she replied, 'We are living in misery; we are living in hardship and destitution,' \ncomplaining to him. He said, 'When your husband returns, convey my salutation to him and tell him to \nchange the threshold of the gate (of his house).' When Ishmael came, he seemed to have felt \nsomething unusual, so he asked his wife, 'Has anyone visited you?' She replied, 'Yes, an old man of \nso-and-so description came and asked me about you and I informed him, and he asked about our state \nof living, and I told him that we were living in a hardship and poverty.' On that Ishmael said, 'Did he \nadvise you anything?' She replied, 'Yes, he told me to convey his salutation to you and to tell you to \nchange the threshold of your gate.' Ishmael said, 'It was my father, and he has ordered me to divorce \nyou. Go back to your family.' So, Ishmael divorced her and married another woman from amongst \nthem (i.e. Jurhum). \nThen Abraham stayed away from them for a period as long as Allah wished and called on them again \nbut did not find Ishmael. So he came to Ishmael's wife and asked her about Ishmael. She said, 'He has \ngone in search of our livelihood.' Abraham asked her, 'How are you getting on?' asking her about their \nsustenance and living. She replied, 'We are prosperous and well-off (i.e. we have everything in \nabundance).' Then she thanked Allah' Abraham said, 'What kind of food do you eat?' She said. 'Meat.' \nHe said, 'What do you drink?' She said, 'Water.\" He said, \"O Allah! Bless their meat and water.\" The \nProphet added, \"At that time they did not have grain, and if they had grain, he would have also \ninvoked Allah to bless it.\" The Prophet (ﷺ) added, \"If somebody has only these two things as his \nsustenance, his health and disposition will be badly affected, unless he lives in Mecca.\" The Prophet (ﷺ) \nadded,\" Then Abraham said Ishmael's wife, \"When your husband comes, give my regards to him and \ntell him that he should keep firm the threshold of his gate.' When Ishmael came back, he asked his \nwife, 'Did anyone call on you?' She replied, 'Yes, a good-looking old man came to me,' so she praised \nhim and added. 'He asked about you, and I informed him, and he asked about our livelihood and I told \nhim that we were in a good condition.' Ishmael asked her, 'Did he give you any piece of advice?' She \nsaid, 'Yes, he told me to give his regards to you and ordered that you should keep firm the threshold of \nyour gate.' On that Ishmael said, 'It was my father, and you are the threshold (of the gate). He has \nordered me to keep you with me.' \nThen Abraham stayed away from them for a period as long as Allah wished, and called on them \nafterwards. He saw Ishmael under a tree near Zamzam, sharpening his arrows. When he saw \nAbraham, he rose up to welcome him (and they greeted each other as a father does with his son or a \nson does with his father). Abraham said, 'O Ishmael! Allah has given me an order.' Ishmael said, 'Do \nwhat your Lord has ordered you to do.' Abraham asked, 'Will you help me?' Ishmael said, 'I will help \nyou.' Abraham said, Allah has ordered me to build a house here,' pointing to a hillock higher than the \nland surrounding it.\" The Prophet (ﷺ) added, \"Then they raised the foundations of the House (i.e. the \nKa`ba). Ishmael brought the stones and Abraham was building, and when the walls became high, \nIshmael brought this stone and put it for Abraham who stood over it and carried on building, while \nIshmael was handing him the stones, and both of them were saying, 'O our Lord! Accept (this service) \nfrom us, Verily, You are the All-Hearing, the All-Knowing.' The Prophet (ﷺ) added, \"Then both of them \nwent on building and going round the Ka`ba saying: O our Lord ! Accept (this service) from us, \nVerily, You are the All-Hearing, the All-Knowing.\" (2.127)</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 171450,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31480,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 584,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>When Abraham had differences with his wife), (because of her jealousy of Hajar, Ishmael's mother), \nhe took Ishmael and his mother and went away. They had a water-skin with them containing some \nwater, Ishmael's mother used to drink water from the water-skin so that her milk would increase for \nher child. When Abraham reached Mecca, he made her sit under a tree and afterwards returned home. \nIshmael's mother followed him, and when they reached Kada', she called him from behind, 'O \nAbraham! To whom are you leaving us?' He replied, '(I am leaving you) to Allah's (Care).' \nShe said, 'I am satisfied to be with Allah.' She returned to her place and started drinking water from \nthe water-skin, and her milk increased for her child. When the water had all been used up, she said to \nherself, 'I'd better go and look so that I may see somebody.' She ascended the Safa mountain and \nlooked, hoping to see somebody, but in vain. When she came down to the valley, she ran till she \nreached the Marwa mountain. She ran to and fro (between the two mountains) many times. They she \nsaid to herself, 'i'd better go and see the state of the child,' she went and found it in a state of one on \nthe point of dying. She could not endure to watch it dying and said (to herself), 'If I go and look, I may \nfind somebody.' \nShe went and ascended the Safa mountain and looked for a long while but could not find anybody. \nThus she completed seven rounds (of running) between Safa and Marwa. Again she said (to herself), \n'I'd better go back and see the state of the child.' But suddenly she heard a voice, and she said to that \nstrange voice, 'Help us if you can offer any help.' Lo! It was Gabriel (who had made the voice). \nGabriel hit the earth with his heel like this (Ibn `Abbas hit the earth with his heel to Illustrate it), and \nso the water gushed out. Ishmael's mother was astonished and started digging. (Abu Al-Qasim) (i.e. \nthe Prophet) said, \"If she had left the water, (flow naturally without her intervention), it would have \nbeen flowing on the surface of the earth.\") Ishmael's mother started drinking from the water and her \nmilk increased for her child . Afterwards some people of the tribe of Jurhum, while passing through \nthe bottom of the valley, saw some birds, and that astonished them, and they said, 'Birds can only be \nfound at a place where there is water.' \nThey sent a messenger who searched the place and found the water, and returned to inform them about \nit. Then they all went to her and said, 'O ishmael's mother! Will you allow us to be with you (or dwell \nwith you)?' (And thus they stayed there.) Later on her boy reached the age of puberty and married a \nlady from them. Then an idea occurred to Abraham which he disclosed to his wife (Sarah), 'I want to \ncall on my dependents I left (at Mecca).' When he went there, he greeted (Ishmael's wife) and said, \n'Where is Ishmael?' She replied, 'He has gone out hunting.' Abraham said (to her), 'When he comes, \ntell him to change the threshold of his gate.' When he came, she told him the same whereupon Ishmael \nsaid to her, 'You are the threshold, so go to your family (i.e. you are divorced).' Again Abraham \nthought of visiting his dependents whom he had left (at Mecca), and he told his wife (Sarah) of his \nintentions. \nAbraham came to Ishmael's house and asked. \"Where is Ishmael?\" Ishmael's wife replied, \"He has \ngone out hunting,\" and added, \"Will you stay (for some time) and have something to eat and drink?' \nAbraham asked, 'What is your food and what is your drink?' She replied, 'Our food is meat and our \ndrink is water.' He said, 'O Allah! Bless their meals and their drink.\" Abu Al-Qa-sim (i.e. Prophet) \nsaid, \"Because of Abraham's invocation there are blessings (in Mecca).\" Once more Abraham thought \nof visiting his family he had left (at Mecca), so he told his wife (Sarah) of his decision. He went and \nfound Ishmael behind the Zamzam well, mending his arrows. He said, \"O Ishmael, Your Lord has \nordered me to build a house for Him.\" Ishmael said, \"Obey (the order of) your Lord.\" \nAbraham said, \"Allah has also ordered me that you should help me therein.\" Ishmael said, \"Then I will \ndo.\" So, both of them rose and Abraham started building (the Ka`ba) while Ishmael went on handing \nhim the stones, and both of them were saying, \"O our Lord ! Accept (this service) from us, Verily, \nYou are the All-Hearing, the All-Knowing.\" (2.127). When the building became high and the old man \n(i.e. Abraham) could no longer lift the stones (to such a high position), he stood over the stone of Al- \nMaqam and Ishmael carried on handing him the stones, and both of them were saying, 'O our Lord! \nAccept (this service) from us, Verily You are All-Hearing, All-Knowing.\" (2.127)</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 171460,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31490,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 585,
        "hadithText": "<p>\nNarrated Abu Dhar:\n\n<p>I said, \"O Allah's Messenger (ﷺ)! Which mosque was first built on the surface of the earth?\" He said, \"Al- \nMasjid-ul-,Haram (in Mecca).\" I said, \"Which was built next?\" He replied \"The mosque of Al-Aqsa ( \nin Jerusalem) .\" I said, \"What was the period of construction between the two?\" He said, \"Forty \nyears.\" He added, \"Wherever (you may be, and) the prayer time becomes due, perform the prayer \nthere, for the best thing is to do so (i.e. to offer the prayers in time).</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 171470,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31500,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 586,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>When the mountain of Uhud came in the sight of Allah's Messenger (ﷺ) he said. \"This is a mountain that \nloves us and is loved by us. O Allah! Abraham made Mecca a sanctuary, and I make (the area) in \nbetween these two mountains (of Medina) a sanctuary.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 171480,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31510,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 587,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>(The wife of the Prophet) Allah's Messenger (ﷺ) said (to her). \"Don't you see that when your folk built the \nKa`ba, they did not build it on all the foundations built by Abraham?\" I said, \"O Allah's Messenger (ﷺ)! Why \ndon't we rebuild it on the foundations of Abraham?\" He said. \"But for the fact that your folk have \nrecently given up infidelity (I would have done so). \nNarrated Ibn `Umar: Aisha must have heard this from Allah's Messenger (ﷺ) for I see that Allah's Messenger (ﷺ) \nused not to touch the two corners facing Al-Hijr only because the House had not been built on the \nfoundations of Abraham.''</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 171490,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31520,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 588,
        "hadithText": "<p>\nNarrated Abu Humaid As-Sa`idi:\n\n<p>The people asked, \"O Allah's Messenger (ﷺ)! How shall we (ask Allah to) send blessings on you?\" Allah's \nApostle replied, \"Say: O Allah! Send Your Mercy on Muhammad and on his wives and on his off \nspring, as You sent Your Mercy on Abraham's family; and send Your Blessings on Muhammad and \non his offspring, as You sent Your Blessings on Abraham's family, for You are the Most Praiseworthy, \nthe Most Glorious.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 171500,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31530,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 589,
        "hadithText": "<p>\nNarrated `Abdur-Rahman bin Abi Laila:\n\n<p>Ka`b bin Ujrah met me and said, \"Shall I not give you a present I got from the Prophet?\" `Abdur- \nRahman said, \"Yes, give it to me.\" I said, \"We asked Allah's Messenger (ﷺ) saying, 'O Allah's Messenger (ﷺ)! How \nshould one (ask Allah to) send blessings on you, the members of the family, for Allah has taught us \nhow to salute you (in the prayer)?' He said, 'Say: O Allah! Send Your Mercy on Muhammad and on \nthe family of Muhammad, as You sent Your Mercy on Abraham and on the family of Abraham, for \nYou are the Most Praise-worthy, the Most Glorious. O Allah! Send Your Blessings on Muhammad \nand the family of Muhammad, as You sent your Blessings on Abraham and on the family of Abraham, \nfor You are the Most Praise-worthy, the Most Glorious.' \"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 171510,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31540,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 590,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>The Prophet (ﷺ) used to seek Refuge with Allah for Al-Hasan and Al-Husain and say: \"Your forefather \n(i.e. Abraham) used to seek Refuge with Allah for Ishmael and Isaac by reciting the following: 'O \nAllah! I seek Refuge with Your Perfect Words from every devil and from poisonous pests and from \nevery evil, harmful, envious eye.' \"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 171520,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31550,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 591,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"We are more liable to be in doubt than Abraham when he said, 'My Lord! Show \nme how You give life to the dead.\" . He (i.e. Allah) slid: 'Don't you believe then?' He (i.e. Abraham) \nsaid: \"Yes, but (I ask) in order to be stronger in Faith.\" (2.260) And may Allah send His Mercy on \nLot! He wished to have a powerful support. If I were to stay in prison for such a long time as Joseph \ndid I would have accepted the offer (of freedom without insisting on having my guiltless less \ndeclared).</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 171530,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31560,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 592,
        "hadithText": "<p>\nNarrated Salama bin Al-Akwa`:\n\n<p>The Prophet (ﷺ) passed by some persons of the tribe of Aslam practicing archery (i.e. the throwing of \narrows) Allah's Messenger (ﷺ) said, \"O offspring of Ishmael! Practice archery (i.e. arrow throwing) as your \nfather was a great archer (i.e. arrow-thrower). I am with (on the side of) the son of so-and-so-.\" \nHearing that, one of the two teams stopped throwing. Allah's Messenger (ﷺ) asked them, ' Why are you not \nthrowing?\" They replied, \"O Allah's Messenger (ﷺ)! How shall we throw when you are with the opposite \nteam?\" He said, \"Throw, for I am with you all.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 171540,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31570,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 593,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Some people asked the Prophet: \"Who is the most honorable amongst the people?\" He replied, \"The \nmost honorable among them is the one who is the most Allah-fearing.\" They said, \"O Allah's Prophet! \nWe do not ask about this.\" He said, \"Then the most honorable person is Joseph, Allah's Prophet, the \nson of Allah's Prophet, the son of Allah's Prophet, the son of Allah's Khalil.\" They said, \"We do not \nask about this.\" He said, \"Then you want to ask me about the Arabs' descent?\" They said, \"Yes.\" He \nsaid, \"Those who were best in the pre-lslamic period, are the best in Islam, if they comprehend (the \nreligious knowledge).</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 171550,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31580,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 594,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"May Allah forgive Lot: He wanted to have a powerful support.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 171560,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31590,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 595,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>The Prophet (ﷺ) recited:-- 'Hal-min-Muddakir' (54.15) (Is there any that will remember) (and avoid evil).</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 171570,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31592,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 560,
        "hadithText": "<p>\nNarrated `Abdullah bin Zam`a:\n\n<p>I heard the Prophet (ﷺ) while referring to the person who had cut the legs of the she-camel (of the Prophet (ﷺ) \nSalih), saying, \"The man who was appointed for doing this job, was a man of honor and power in his \nnation like Abu Zam`a.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 171580,
        "last_updated": "2020-06-04 04:43:59"
    },
    {
        "englishURN": 31593,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 561,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>When Allah's Messenger (ﷺ) landed at Al-Hijr during the Ghazwa of Tabuk, he ordered his companions not \nto drink water from its well or reserve water from it. They said, \"We have already kneaded the dough \nwith its water. and also filled our bags with its water.'' On that, the Prophet (ﷺ) ordered them to throw \naway the dough and pour out the water.</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 171590,
        "last_updated": "2020-06-04 04:47:56"
    },
    {
        "englishURN": 31594,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 562,
        "hadithText": "<p>\nNarrated `Abdullah bin `Umar:\n\n<p>The people landed at the land of Thamud called Al-Hijr along with Allah's Messenger (ﷺ) and they took \nwater from its well for drinking and kneading the dough with it as well. (When Allah's Messenger (ﷺ) heard \nabout it) he ordered them to pour out the water they had taken from its wells and feed the camels with \nthe dough, and ordered them to take water from the well whence the she-camel (of Prophet Salih) used \nto drink.</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 171600,
        "last_updated": "2020-06-04 04:48:16"
    },
    {
        "englishURN": 31595,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 563,
        "hadithText": "<p>\nNarrated `Abdullah bin `Umar:\n\n<p>When the Prophet (ﷺ) passed by (a place called) Al Hijr, he said, \"Do not enter the house of those who \nwere unjust to themselves, unless (you enter) weeping, lest you should suffer the same punishment as \nwas inflicted upon them.\" After that he covered his face with his sheet cloth while he was on the \ncamel-saddle.</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 171610,
        "last_updated": "2020-06-04 04:48:37"
    },
    {
        "englishURN": 31596,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 564,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>Allah's Messenger (ﷺ) said, \"Do not enter the ruined dwellings of those who were unjust to themselves \nunless (you enter) weeping, lest you should suffer the same punishment as was inflicted upon them.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 171620,
        "last_updated": "2020-06-04 04:49:05"
    },
    {
        "englishURN": 31600,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 596,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>The Prophet (ﷺ) said, \"The honorable is the son of the honorable, the son the honorable, i.e. Joseph, the \nson of Jacob, the son of Isaac, the son of Abraham.</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 171630,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31610,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 597,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) was asked, \"Who is the most honorable amongst the people?\" He replied, \"The most \nAllah fearing.\" The people said, \"We do not want to ask you about this.\" He said, \"The most \nhonorable person is Joseph, Allah's Prophet, the son of Allah's Prophet, the son of Allah's Prophet, the \nson of Allah's Khalil\" The people said, 'We do not want to ask you about this.\" He said,\" Then you \nwant to ask me about the origins of the Arabs? People are of various origins. The best in the prelslamic \nperiod are the best in Islam, provided they comprehend (the religious knowledge).</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 171641,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31620,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 598,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>That the Prophet (ﷺ) said (to her). \"Order Abu Bakr to lead the people in prayer.\" She replied,\" Abu Bakr \nis a soft-hearted person and when he stands at your place, he will weep (so he will not be able to lead \nthe prayer).\" The Prophet (ﷺ) repeated the same order and she gave the same reply. The narrator, Shuba \nsaid that the Prophet (ﷺ) said on the third or fourth time. \"You are (like) the female companions of Joseph. \nOrder Abu Bakr to lead the prayer. \"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 171660,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31630,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 599,
        "hadithText": "<p>\nNarrated Abu Musa:\n\n<p>When the Prophet (ﷺ) fell ill, he said, \"Order Abu Bakr to lead the people in prayer.\" `Aisha said, \"Abu \nBakr is a soft-hearted person. The Prophet (ﷺ) gave the same order again and she again gave the same \nreply. He again said, \"Order Abu Bakr (to lead the prayer)! You are (like) the female companions of \nJoseph.\" Consequently Abu Bakr led the people in prayer in the life-time of the Prophet.</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 171670,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31640,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 600,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"O Allah! Save `Aiyyash bin Abi Rabi`a (from the unjust treatment of the \ninfidels). O Allah! Save Salama bin Hisham. O Allah! Send your Punishment on (the tribe of) Mudar. \nO Allah! Let them suffer from years (of drought) similar to that inflicted during the life-time of \nJoseph.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 171680,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31650,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 601,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"May Allah bestow His Mercy on Lot. He wanted to have a powerful support. If \nI were to stay in prison (for a period equal to) the stay of Joseph (prison) and then the offer of freedom \ncame to me, then I would have accepted it.\" (See Hadith No. 591)</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 171690,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31660,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 602,
        "hadithText": "<p>\nNarrated Masruq:\n\n<p>I asked Um Ruman, `Aisha's mother about the accusation forged against `Aisha. She said, \"While I \nwas sitting with `Aisha, an Ansari woman came to us and said, 'Let Allah condemn such-and-such \nperson.' I asked her, 'Why do you say so?' She replied, 'For he has spread the (slanderous) story.' \n`Aisha said, 'What story?' The woman then told her the story. `Aisha asked, 'Have Abu Bakr and \nAllah's Messenger (ﷺ) heard about it ?' She said, 'Yes.' `Aisha fell down senseless (on hearing that), and \nwhen she came to her senses, she got fever and shaking of the body. The Prophet (ﷺ) came and asked, \n'What is wrong with her?' I said, 'She has got fever because of a story which has been rumored.' \n`Aisha got up and said, 'By Allah! Even if I took an oath, you would not believe me, and if I put \nforward an excuse, You would not excuse me. My example and your example is just like that example \nof Jacob and his sons. Against that which you assert, it is Allah (Alone) Whose Help can be sought.' \n(12.18) The Prophet (ﷺ) left and then Allah revealed the Verses (concerning the matter), and on that \n`Aisha said, 'Thanks to Allah (only) and not to anybody else.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 171700,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31671,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 603,
        "hadithText": "<p> Narrated `Urwa: <p>I asked `Aisha the wife of the Prophet (ﷺ) about the meaning of the following Verse: -- \"(Respite will be granted) 'Until when the apostles give up hope (of their people) and thought that they were denied (by their people)...............\"(12.110) `Aisha replied, \"Really, their nations did not believe them.\" I said, \"By Allah! They were definite that their nations treated them as liars and it was not a matter of suspecting.\" `Aisha said, \"O 'Uraiya (i.e. `Urwa)! No doubt, they were quite sure about it.\" I said, \"May the Verse be read in such a way as to mean that the apostles thought that Allah did not help them?\" Aisha said, \"Allah forbid! (Impossible) The Apostles did not suspect their Lord of such a thing. But this Verse is concerned with the Apostles' followers who had faith in their Lord and believed in their apostles and their period of trials was long and Allah's Help was delayed till the apostles gave up hope for the conversion of the disbelievers amongst their nation and suspected that even their followers were shaken in their belief, Allah's Help then came to them.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 171710,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31672,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 603,
        "hadithText": "Narrated Ibn `Umar: The Prophet (ﷺ) said, \"The honorable, the son of the honorable, the son of the honorable, (was) Joseph, the son of Jacob! the son of Isaac, the son of Abraham.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 171720,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31680,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 604,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"While Job was naked, taking a bath, a swarm of gold locusts fell on him and he \nstarted collecting them in his garment. His Lord called him, 'O Job! Have I not made you rich enough \nto need what you see? He said, 'Yes, O Lord! But I cannot dispense with your Blessing.\"'</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 171730,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31690,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 605,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>The Prophet (ﷺ) returned to Khadija while his heart was beating rapidly. She took him to Waraqa bin \nNaufal who was a Christian convert and used to read the Gospels in Arabic Waraqa asked (the \nProphet), \"What do you see?\" When he told him, Waraqa said, \"That is the same angel whom Allah \nsent to the Prophet) Moses. Should I live till you receive the Divine Message, I will support you \nstrongly.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 171740,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31700,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 606,
        "hadithText": "<p>\nNarrated Malik bin Sasaa:\n\n<p>Allah's Messenger (ﷺ) talked to his companions about his Night Journey to the Heavens. When he reached \nthe fifth Heaven, he met Aaron. (Gabriel said to the Prophet), \"This is Aaron.\" The Prophet (ﷺ) said, \n\"Gabriel greeted and so did I, and he returned the greeting saying, 'Welcome, O Pious Brother and \nPious Prophet.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 171750,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31710,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 607,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"On the night of my Ascension to Heaven, I saw (the prophet) Moses who was a \nthin person with lank hair, looking like one of the men of the tribe of Shanua; and I saw Jesus who \nwas of average height with red face as if he had just come out of a bathroom. And I resemble prophet \nAbraham more than any of his offspring does. Then I was given two cups, one containing milk and the \nother wine. Gabriel said, 'Drink whichever you like.' I took the milk and drank it. Gabriel said, 'You \nhave accepted what is natural, (True Religion i.e. Islam) and if you had taken the wine, your followers \nwould have gone astray.' \"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 171760,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31720,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 608,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>The Prophet (ﷺ) said, \"One should not say that I am better than Jonah (i.e. Yunus) bin Matta.\" So, he \nmentioned his father Matta. The Prophet (ﷺ) mentioned the night of his Ascension and said, \"The prophet \nMoses was brown, a tall person as if from the people of the tribe of Shanu'a. Jesus was a curly-haired \nman of moderate height.\" He also mentioned Malik, the gate-keeper of the (Hell) Fire, and Ad-Dajjal.</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 171771,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31730,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 609,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>When the Prophet (ﷺ) came to Medina, he found (the Jews) fasting on the day of 'Ashura' (i.e. 10th of \nMuharram). They used to say: \"This is a great day on which Allah saved Moses and drowned the folk \nof Pharaoh. Moses observed the fast on this day, as a sign of gratitude to Allah.\" The Prophet (ﷺ) said, \"I \nam closer to Moses than they.\" So, he observed the fast (on that day) and ordered the Muslims to fast \non it.</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 171790,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31740,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 610,
        "hadithText": "<p>\nNarrated Abu Sa`id:\n\n<p>The Prophet (ﷺ) said, 'People will be struck unconscious on the Day of Resurrection and I will be the first \nto regain consciousness, and behold! There I will see Moses holding one of the pillars of Allah's \nThrone. I will wonder whether he has become conscious before me of he has been exempted, because \nof his unconsciousness at the Tur (mountain) which he received (on the earth).</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 171800,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31750,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 611,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"Were it not for Bani Israel, meat would not decay; and were it not for Eve, no \nwoman would ever betray her husband.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 171810,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31760,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 612,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>That he differed with Al-Hur bin Qais Al-Fazari regarding the companion of Moses. Ibn `Abbas said \nthat he was Al-Khadir. Meanwhile Ubai bin Ka`b passed by them and Ibn `Abbas called him saying, \n\"My friend and I have differed regarding Moses' companion whom Moses asked the way to meet. \nHave you heard Allah's Messenger (ﷺ) mentioning something about him?\" He said, \"Yes, I heard Allah's \nApostle saying, 'While Moses was sitting in the company of some Israelites, a man came and asked \n(him), 'Do you know anyone who is more learned than you?' Moses replied, 'No.' So, Allah sent the \nDivine Inspiration to Moses: 'Yes, Our slave, Khadir (is more learned than you).' Moses asked how to \nmeet him (i.e. Khadir). So, the fish, was made, as a sign for him, and he was told that when the fish \nwas lost, he should return and there he would meet him. So, Moses went on looking for the sign of the \nfish in the sea. The servant boy of Moses said to him, 'Do you know that when we were sitting by the \nside of the rock, I forgot the fish, and t was only Satan who made me forget to tell (you) about it.' \nMoses said, That was what we were seeking after,' and both of them returned, following their \nfootmarks and found Khadir; and what happened further to them, is mentioned in Allah's Book.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 171820,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31770,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 613,
        "hadithText": "<p>\nNarrated Sa`id bin Jubair:\n\n<p>I said to Ibn `Abbas, \"Nauf Al-Bukah claims that Moses, the companion of Al-Khadir was not Moses \n(the prophet) of the children of Israel, but some other Moses.\" Ibn `Abbas said, \"Allah's enemy (i.e. \nNauf) has told a lie. Ubai bin Ka`b told us that the Prophet (ﷺ) said, 'Once Moses stood up and addressed \nBani Israel. He was asked who was the most learned man amongst the people. He said, 'I.' Allah \nadmonished him as he did not attribute absolute knowledge to Him (Allah). So, Allah said to him, \n'Yes, at the junction of the two seas there is a Slave of Mine who is more learned than you.' Moses \nsaid, 'O my Lord! How can I meet him?' \nAllah said, 'Take a fish and put it in a large basket and you will find him at the place where you will \nlose the fish.' Moses took a fish and put it in a basket and proceeded along with his (servant) boy, \nYusha` bin Noon, till they reached the rock where they laid their heads (i.e. lay down). Moses slept, \nand the fish, moving out of the basket, fell into the sea. It took its way into the sea (straight) as in a \ntunnel. Allah stopped the flow of water over the fish and it became like an arch (the Prophet (ﷺ) pointed \nout this arch with his hands). They travelled the rest of the night, and the next day Moses said to his \nboy (servant), 'Give us our food, for indeed, we have suffered much fatigue in this journey of ours.' \nMoses did not feel tired till he crossed that place which Allah had ordered him to seek after. His boy \n(servant) said to him, 'Do you know that when we were sitting near that rock, I forgot the fish, and \nnone but Satan caused me to forget to tell (you) about it, and it took its course into the sea in an \namazing way?.' So there was a path for the fish and that astonished them. Moses said, 'That was what \nwe were seeking after.' So, both of them retraced their footsteps till they reached the rock. \nThere they saw a man Lying covered with a garment. Moses greeted him and he replied saying, 'How \ndo people greet each other in your land?' Moses said, 'I am Moses.' The man asked, 'Moses of Bani \nIsrael?' Moses said, 'Yes, I have come to you so that you may teach me from those things which Allah \nhas taught you.' He said, 'O Moses! I have some of the Knowledge of Allah which Allah has taught \nme, and which you do not know, while you have some of the Knowledge of Allah which Allah has \ntaught you and which I do not know.' Moses asked, 'May I follow you?' He said, 'But you will not be \nable to remain patient with me for how can you be patient about things which you will not be able to \nunderstand?' \n(Moses said, 'You will find me, if Allah so will, truly patient, and I will not disobey you in aught.') So, \nboth of them set out walking along the sea-shore, a boat passed by them and they asked the crew of \nthe boat to take them on board. The crew recognized Al-Khadir and so they took them on board \nwithout fare. When they were on board the boat, a sparrow came and stood on the edge of the boat and \ndipped its beak once or twice into the sea. \nAl-Khadir said to Moses, 'O Moses! My knowledge and your knowledge have not decreased Allah's \nKnowledge except as much as this sparrow has decreased the water of the sea with its beak.' Then \nsuddenly Al-Khadir took an adze and plucked a plank, and Moses did not notice it till he had plucked \na plank with the adze. Moses said to him, 'What have you done? They took us on board charging us \nnothing; yet you I have intentionally made a hole in their boat so as to drown its passengers. Verily, \nyou have done a dreadful thing.' Al-Khadir replied, 'Did I not tell you that you would not be able to \nremain patient with me?' Moses replied, 'Do not blame me for what I have forgotten, and do not be \nhard upon me for my fault.' So the first excuse of Moses was that he had forgotten. When they had left \nthe sea, they passed by a boy playing with other boys. \nAl-Khadir took hold of the boys head and plucked it with his hand like this. (Sufyan, the sub narrator \npointed with his fingertips as if he was plucking some fruit.) Moses said to him, \"Have you killed an \ninnocent person who has not killed any person? You have really done a horrible thing.\" Al-Khadir \nsaid, \"Did I not tell you that you could not remain patient with me?' Moses said \"If I ask you about \nanything after this, don't accompany me. You have received an excuse from me.' Then both of them \nwent on till they came to some people of a village, and they asked its inhabitant for wood but they \nrefused to entertain them as guests. Then they saw therein a wall which was just going to collapse \n(and Al Khadir repaired it just by touching it with his hands). (Sufyan, the sub-narrator, pointed with \nhis hands, illustrating how Al-Khadir passed his hands over the wall upwards.) Moses said, \"These are \nthe people whom we have called on, but they neither gave us food, nor entertained us as guests, yet \nyou have repaired their wall. If you had wished, you could have taken wages for it.\" Al-Khadir said, \n\"This is the parting between you and me, and I shall tell you the explanation of those things on which \nyou could not remain patient.\" The Prophet (ﷺ) added, \"We wished that Moses could have remained \npatient by virtue of which Allah might have told us more about their story. (Sufyan the sub-narrator \nsaid that the Prophet (ﷺ) said, \"May Allah bestow His Mercy on Moses! If he had remained patient, we \nwould have been told further about their case.\")</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 171830,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31780,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 614,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"Al-Khadir was named so because he sat over a barren white land, it turned green \nwith plantation after (his sitting over it.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 171840,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31790,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 615,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"It was said to Bani Israel, Enter the gate (of the town) with humility (prostrating \nyourselves) and saying: \"Repentance\", but they changed the word and entered the town crawling on \ntheir buttocks and saying: \"A wheat grain in the hair.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 171850,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31800,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 616,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"(The Prophet) Moses was a shy person and used to cover his body completely \nbecause of his extensive shyness. One of the children of Israel hurt him by saying, 'He covers his body \nin this way only because of some defect in his skin, either leprosy or scrotal hernia, or he has some \nother defect.' Allah wished to clear Moses of what they said about him, so one day while Moses was \nin seclusion, he took off his clothes and put them on a stone and started taking a bath. When he had \nfinished the bath, he moved towards his clothes so as to take them, but the stone took his clothes and \nfled; Moses picked up his stick and ran after the stone saying, 'O stone! Give me my garment!' Till he \nreached a group of Bani Israel who saw him naked then, and found him the best of what Allah had \ncreated, and Allah cleared him of what they had accused him of. The stone stopped there and Moses \ntook and put his garment on and started hitting the stone with his stick. By Allah, the stone still has \nsome traces of the hitting, three, four or five marks. This was what Allah refers to in His Saying:-- \"O \nyou who believe! Be you not like those Who annoyed Moses, But Allah proved his innocence of that \nwhich they alleged, And he was honorable In Allah's Sight.\" (33.69)</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 171860,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31810,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 617,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>Once the Prophet (ﷺ) distributed something (among his followers. A man said, \"This distribution has not \nbeen done (with justice) seeking Allah's Countenance.\" I went to the Prophet (ﷺ) and told him (of that). \nHe became so angry that I saw the signs of anger oh his face. Then he said, \"May Allah bestow His \nMercy on Moses, for he was harmed more (in a worse manner) than this; yet he endured patiently.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 171870,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31820,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 618,
        "hadithText": "<p>\nNarrated Jabir bin `Abdullah:\n\n<p>We were with Allah's Messenger (ﷺ) picking the fruits of the 'Arak trees, and Allah's Messenger (ﷺ) said, \"Pick the \nblack fruit, for it is the best.\" The companions asked, \"Were you a shepherd?\" He replied, \"There was \nno prophet who was not a shepherd.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 171880,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31830,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 619,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Angel of Death was sent to Moses when he came to Moses, Moses slapped him on the eye. The \nangel returned to his Lord and said, \"You have sent me to a Slave who does not want to die.\" Allah \nsaid, \"Return to him and tell him to put his hand on the back of an ox and for every hair that will come \nunder it, he will be granted one year of life.\" Moses said, \"O Lord! What will happen after that?\" \nAllah replied, \"Then death.\" Moses said, \"Let it come now.\" Moses then requested Allah to let him die \nclose to the Sacred Land so much so that he would be at a distance of a stone's throw from it.\" Abu \nHuraira added, \"Allah's Messenger (ﷺ) said, 'If I were there, I would show you his grave below the red sand \nhill on the side of the road.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 171890,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31840,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 620,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>A Muslim and a Jew quarreled. The Muslim taking an oath, said, \"By Him Who has preferred \nMuhammad over all people...!\" The Jew said, \"By Him Who has preferred Moses, over all people.\" \nThe Muslim raised his hand and slapped the Jew who came to the Prophet (ﷺ) to tell him what had \nhappened between him and the Muslim. The Prophet (ﷺ) said, \"Don't give me superiority over Moses, for \nthe people will become unconscious (on the Day of Resurrection) and I will be the first to gain \nconsciousness to see Moses standing and holding a side of Allah's Throne. I will not know if he has \nbeen among those people who have become unconscious; and that he has gained consciousness before \nme, or he has been amongst those whom Allah has exempted.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 171900,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31850,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 621,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"Adam and Moses argued with each other. Moses said to Adam. 'You are Adam \nwhose mistake expelled you from Paradise.' Adam said to him, 'You are Moses whom Allah selected \nas His Messenger and as the one to whom He spoke directly; yet you blame me for a thing which had \nalready been written in my fate before my creation?\"' Allah's Messenger (ﷺ) said twice, \"So, Adam \noverpowered Moses.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 171910,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31860,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 622,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>The Prophet (ﷺ) once came to us and said, \"All the nations were displayed in front of me, and I saw a \nlarge multitude of people covering the horizon. Somebody said, 'This is Moses and his followers.' \"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 171920,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31870,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 623,
        "hadithText": "<p>\nNarrated Abu Musa:\n\n<p>Allah's Messenger (ﷺ) said, \"Many amongst men reached (the level of) perfection but none amongst the \nwomen reached this level except Asia, Pharaoh's wife, and Mary, the daughter of `Imran. And no \ndoubt, the superiority of `Aisha to other women is like the superiority of Tharid (i.e. a meat and bread \ndish) to other meals.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 171930,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31880,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 624,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>The Prophet (ﷺ) said, \"None of you should say that I am better than Yunus (i.e. Jonah).\" Musadded added, \n\"Jonah bin Matta.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 171940,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31890,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 625,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>The Prophet (ﷺ) said, \"No slave (of Allah) should say that I am better than Yunus bin Matta.\" So the \nProphet mentioned his father's name with his name.</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 171950,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31900,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 626,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Once while a Jew was selling something, he was offered a price that he was not pleased with. So, he \nsaid, \"No, by Him Who gave Moses superiority over all human beings!\" Hearing him, an Ansari man \ngot up and slapped him on the face and said, \"You say: By Him Who Gave Moses superiority over all \nhuman beings although the Prophet (Muhammad) is present amongst us!\" The Jew went to the \nProphet and said, \"O Abu-l-Qasim! I am under the assurance and contract of security, so what right \ndoes so-and-so have to slap me?\" The Prophet (ﷺ) asked the other, \"Why have you slapped\". He told him \nthe whole story. The Prophet (ﷺ) became angry, till anger appeared on his face, and said, \"Don't give \nsuperiority to any prophet amongst Allah's Prophets, for when the trumpet will be blown, everyone on \nthe earth and in the heavens will become unconscious except those whom Allah will exempt. The \ntrumpet will be blown for the second time and I will be the first to be resurrected to see Moses holding \nAllah's Throne. I will not know whether the unconsciousness which Moses received on the Day of Tur \nhas been sufficient for him, or has he got up before me. And I do not say that there is anybody who is \nbetter than Yunus bin Matta.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 171960,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31910,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 627,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"None should say that I am better than Yunus bin Matta.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 171970,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31920,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 628,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"The reciting of the Zabur (i.e. Psalms) was made easy for David. He used to order \nthat his riding animals be saddled, and would finish reciting the Zabur before they were saddled. And \nhe would never eat except from the earnings of his manual work.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 171981,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31930,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 629,
        "hadithText": "<p>\nNarrated `Abdullah bin `Amr:\n\n<p>Allah's Messenger (ﷺ) was informed that I have said: \"By Allah, I will fast all the days and pray all the nights \nas long as I live.\" On that, Allah's Messenger (ﷺ) asked me. \"Are you the one who says: 'I will fast all the \ndays and pray all the nights as long as I live?' \" I said, \"Yes, I have said it.\" He said, \"You cannot do \nthat. So fast (sometimes) and do not fast (sometimes). Pray and sleep. Fast for three days a month, for \nthe reward of a good deed is multiplied by ten time, and so the fasting of three days a month equals \nthe fasting of a year.\" I said, \"O Allah's Messenger (ﷺ)! I can do (fast) more than this.\" He said, \"Fast on \nevery third day. I said: I can do (fast) more than that, He said: \"Fast on alternate days and this was the \nfasting of David which is the most moderate sort of fasting.\" I said, \"O Allah's Messenger (ﷺ)! I can do (fast) \nmore than that.\" He said, \"There is nothing better than that.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 172000,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31940,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 630,
        "hadithText": "<p>\nNarrated `Abdullah bin `Amr bin Al-As:\n\n<p>The Prophet (ﷺ) said to me, \"I have been informed that you pray all the nights and observe fast all the \ndays; is this true?\" I replied, \"Yes.\" He said, \"If you do so, your eyes will become weak and you will \nget bored. So fast three days a month, for this will be the fasting of a whole year, or equal to the \nfasting of a whole year.\" I said, \"I find myself able to fast more.\" He said, \"Then fast like the fasting \nof (the Prophet) David who used to fast on alternate days and would not flee on facing the enemy.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 172010,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31950,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 631,
        "hadithText": "<p>\nNarrated `Abdullah bin `Amr:\n\n<p>Allah's Messenger (ﷺ) said to me, \"The most beloved fasting to Allah was the fasting of (the Prophet) David \nwho used to fast on alternate days. And the most beloved prayer to Allah was the prayer of David who \nused to sleep for (the first) half of the night and pray for 1/3 of it and (again) sleep for a sixth of it.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 172020,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31960,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 632,
        "hadithText": "<p>\nNarrated Mujahid:\n\n<p>I asked Ibn `Abbas, \"Should we perform a prostration on reciting Surat-Sa`d?\" He recited (the Sura) \nincluding: 'And among his progeny, David, Solomon..(up to)...so follow their guidance (6.84-91) And \nthen he said, \"Your Prophet is amongst those people who have been ordered to follow them (i.e. the \npreceding apostles).</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 172030,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31971,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 633,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>The prostration in Sura-Sa`d is not amongst the compulsory prostrations, though I saw the Prophet (ﷺ) \nprostrating on reciting it.</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 172040,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31980,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 634,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"A strong demon from the Jinns came to me yesterday suddenly, so as to spoil my \nprayer, but Allah enabled me to overpower him, and so I caught him and intended to tie him to one of \nthe pillars of the Mosque so that all of you might see him, but I remembered the invocation of my \nbrother Solomon: 'And grant me a kingdom such as shall not belong to any other after me.' (38.35) so \nI let him go cursed.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 172050,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 31990,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 635,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"Solomon (the son of) David said, 'Tonight I will sleep with seventy ladies each of \nwhom will conceive a child who will be a knight fighting for \"Allah's Cause.' His companion said, 'If \nAllah will.' But Solomon did not say so; therefore none of those women got pregnant except one who \ngave birth to a half child.\" The Prophet (ﷺ) further said, \"If the Prophet (ﷺ) Solomon had said it (i.e. 'If Allah \nwill') he would have begotten children who would have fought in Allah's Cause.\" Shuaib and Ibn Abi \nAz-Zinad said, \"Ninety (women) is more correct (than seventy).</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 172060,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32000,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 636,
        "hadithText": "<p>\nNarrated Abu Dhaar:\n\n<p>I said, \"O Allah's Messenger (ﷺ)! Which mosque was built first?\" He replied, \"Al-Masjid-ul-Haram.\" I asked, \n\"Which (was built) next?\" He replied, \"Al-Masjid-ul-Aqs-a (i.e. Jerusalem).\" I asked, \"What was the \nperiod in between them?\" He replied, \"Forty (years).\" He then added, \"Wherever the time for the \nprayer comes upon you, perform the prayer, for all the earth is a place of worshipping for you.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 172070,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32010,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 637,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"My example and the example o the people is like that of a person who lit a fire \nand let the moths, butterflies and these insects fall in it.\" He also said, \"There were two women, each \nof whom had a child with her. A wolf came and took away the child of one of them, whereupon the \nother said, 'It has taken your child.' The first said, 'But it has taken your child.' So they both carried the \ncase before David who judged that the living child be given to the elder lady. So both of them went to \nSolomon bin David and informed him (of the case). He said, 'Bring me a knife so as to cut the child \ninto two pieces and distribute it between them.' The younger lady said, 'May Allah be merciful to you! \nDon't do that, for it is her (i.e. the other lady's) child.' So he gave the child to the younger lady.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 172081,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32020,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 638,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>When the Verse:-- 'Those who believe and mix not their belief with wrong.\" was revealed, the \ncompanions of the Prophet (ﷺ) said, \"Who amongst us has not mixed his belief with wrong?\" Then Allah \nrevealed: \"Join none in worship with Allah, Verily joining others in worship with Allah is a great \nwrong indeed.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 172100,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32030,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 639,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>When the Verse:-- 'Those who believe and mix not their belief with wrong.' was revealed, the \nMuslims felt it very hard on them and said, \"O Allah's Messenger (ﷺ)! Who amongst us does not do wrong to \nhimself?\" He replied, \"The Verse does not mean this. But that (wrong) means to associate others in \nworship to Allah: Don't you listen to what Luqman said to his son when he was advising him,\" O my \nson! Join not others in worship with Allah. Verily joining others in worship with Allah is a great \nwrong indeed.\" (31.13)</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 172110,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32040,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 640,
        "hadithText": "<p>\nNarrated Malik bin Sasaa:\n\n<p>That the Prophet (ﷺ) talked to them about the night of his Ascension to the Heavens. He said, \"(Then \nGabriel took me) and ascended up till he reached the second heaven where he asked for the gate to be \nopened, but it was asked, 'Who is it?' Gabriel replied, 'I am Gabriel.' It was asked, 'Who is \naccompanying you?' He replied, 'Muhammad.' It was asked, 'Has he been called?' He said, 'Yes.' \nWhen we reached over the second heaven, I saw Yahya (i.e. John) and Jesus who were cousins. \nGabriel said, 'These are John (Yahya) and Jesus, so greet them.' I greeted them and they returned the \ngreeting saying, 'Welcome, O Pious Brother and Pious Prophet!;' \"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 172120,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32050,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 641,
        "hadithText": "<p>\nNarrated Sa`id bin Al-Musaiyab:\n\n<p>Abu Huraira said, \"I heard Allah's Messenger (ﷺ) saying, 'There is none born among the off-spring of Adam, \nbut Satan touches it. A child therefore, cries loudly at the time of birth because of the touch of Satan, \nexcept Mary and her child.\" Then Abu Huraira recited: \"And I seek refuge with You for her and for \nher offspring from the outcast Satan\" (3.36)</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 172130,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32060,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 642,
        "hadithText": "<p>\nNarrated `Ali:\n\n<p>I heard the Prophet (ﷺ) saying, \"Mary, the daughter of `Imran, was the best among the women (of the \nworld of her time) and Khadija is the best amongst the women. (of this nation).</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 172140,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32071,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 643,
        "hadithText": "<p> Narrated Abu Musa Al-Ash`ari: <p>The Prophet (ﷺ) said, \"The superiority of `Aisha to other ladies is like the superiority of Tharid (i.e. meat and bread dish) to other meals. Many men reached the level of perfection, but no woman reached such a level except Mary, the daughter of `Imran and Asia, the wife of Pharaoh.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 172150,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32072,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 643,
        "hadithText": "Narrated Abu Huraira: I heard Allah's Messenger (ﷺ) saying, \"Amongst all those women who ride camels (i.e. Arabs), the ladies of Quraish are the best. They are merciful and kind to their off-spring and the best guardians of their husbands' properties.' Abu Huraira added, \"Mary the daughter of `Imran never rode a camel.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 172160,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32080,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 644,
        "hadithText": "<p>\nNarrated 'Ubada:\n\n<p>The Prophet (ﷺ) said, \"If anyone testifies that None has the right to be worshipped but Allah Alone Who \nhas no partners, and that Muhammad is His Slave and His Apostle, and that Jesus is Allah's Slave and \nHis Apostle and His Word which He bestowed on Mary and a Spirit created by Him, and that Paradise \nis true, and Hell is true, Allah will admit him into Paradise with the deeds which he had done even if \nthose deeds were few.\" (Junada, the sub-narrator said, \" 'Ubada added, 'Such a person can enter \nParadise through any of its eight gates he likes.\")</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 172170,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32090,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 645,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"None spoke in cradle but three: (The first was) Jesus, (the second was), there a man \nfrom Bani Israel called Juraij. While he was offering his prayers, his mother came and called him. He \nsaid (to himself), 'Shall I answer her or keep on praying?\" (He went on praying) and did not answer \nher, his mother said, \"O Allah! Do not let him die till he sees the faces of prostitutes.\" So while he was \nin his hermitage, a lady came and sought to seduce him, but he refused. So she went to a shepherd and \npresented herself to him to commit illegal sexual intercourse with her and then later she gave birth to a \nchild and claimed that it belonged to Juraij. The people, therefore, came to him and dismantled his \nhermitage and expelled him out of it and abused him. Juraij performed the ablution and offered prayer, \nand then came to the child and said, 'O child! Who is your father?' The child replied, 'The shepherd.' \n(After hearing this) the people said, 'We shall rebuild your hermitage of gold,' but he said, 'No, of \nnothing but mud.'(The third was the hero of the following story) A lady from Bani Israel was nursing \nher child at her breast when a handsome rider passed by her. She said, 'O Allah ! Make my child like \nhim.' On that the child left her breast, and facing the rider said, 'O Allah! Do not make me like him.' \nThe child then started to suck her breast again. (Abu Huraira further said, \"As if I were now looking at \nthe Prophet (ﷺ) sucking his finger (in way of demonstration.\") After a while the people passed by, with a \nlady slave and she (i.e. the child's mother) said, 'O Allah! Do not make my child like this (slave girl)!, \nOn that the child left her breast and said, 'O Allah! Make me like her.' When she asked why, the child \nreplied, 'The rider is one of the tyrants while this slave girl is falsely accused of theft and illegal sexual \nintercourse.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 172190,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32101,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 646,
        "hadithText": "<p>\nNarrated Hisham:\n\n<p>From Ma`mar as below.<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"I met Moses on the night of my Ascension to heaven.\" The Prophet (ﷺ) then described \nhim saying, as I think, \"He was a tall person with lank hair as if he belonged to the people of the tribe \nof Shanu's.' The Prophet (ﷺ) further said, \"I met Jesus.\" The Prophet (ﷺ) described him saying, \"He was one \nof moderate height and was red-faced as if he had just come out of a bathroom. I saw Abraham whom \nI resembled more than any of his children did.\" The Prophet (ﷺ) further said, \"(That night) I was given \ntwo cups; one full of milk and the other full of wine. I was asked to take either of them which I liked, \nand I took the milk and drank it. On that it was said to me, 'You have taken the right path (religion). If \nyou had taken the wine, your (Muslim) nation would have gone astray.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 172200,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32120,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 648,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>The Prophet (ﷺ) said, \"I saw Moses, Jesus and Abraham (on the night of my Ascension to the heavens). \nJesus was of red complexion, curly hair and a broad chest. Moses was of brown complexion, straight \nhair and tall stature as if he was from the people of Az-Zutt.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 172210,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32130,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 649,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>The Prophet (ﷺ) mentioned the Masih Ad-Dajjal in front of the people saying, Allah is not one-eyed \nwhile Masih Ad-Dajjal is blind in the right eye and his eye looks like a bulging out grape. While \nsleeping near the Ka`ba last night, I saw in my dream a man of brown color the best one can see \namongst brown color and his hair was long that it fell between his shoulders. His hair was lank and \nwater was dribbling from his head and he was placing his hands on the shoulders of two men while \ncircumambulating the Ka`ba. I asked, 'Who is this?' They replied, 'This is Jesus, son of Mary.' Behind \nhim I saw a man who had very curly hair and was blind in the right eye, resembling Ibn Qatan (i.e. an \ninfidel) in appearance. He was placing his hands on the shoulders of a person while performing Tawaf \naround the Ka`ba. I asked, 'Who is this? 'They replied, 'The Masih, Ad-Dajjal.' \"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 172221,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32140,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 650,
        "hadithText": "<p>\nNarrated Salim from his father:\n\n<p>No, By Allah, the Prophet (ﷺ) did not tell that Jesus was of red complexion but said, \"While I was asleep \ncircumambulating the Ka`ba (in my dream), suddenly I saw a man of brown complexion and lank hair \nwalking between two men, and water was dropping from his head. I asked, 'Who is this?' The people \nsaid, 'He is the son of Mary.' Then I looked behind and I saw a red-complexioned, fat, curly-haired \nman, blind in the right eye which looked like a bulging out grape. I asked, 'Who is this?' They replied, \n'He is Ad-Dajjal.' The one who resembled to him among the people, was Ibn Qatar.\" (Az-Zuhri said, \n\"He (i.e. Ibn Qatan) was a man from the tribe Khuza`a who died in the pre-lslamic period.\")</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 172240,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32150,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 651,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>I heard Allah's Messenger (ﷺ) saying, \"I am the nearest of all the people to the son of Mary, and all the \nprophets are paternal brothers, and there has been no prophet between me and him (i.e. Jesus).</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 172250,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32160,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 652,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"Both in this world and in the Hereafter, I am the nearest of all the people to \nJesus, the son of Mary. The prophets are paternal brothers; their mothers are different, but their \nreligion is one.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 113,
        "matchingArabicURN": 172261,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32170,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 653,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"Jesus, seeing a man stealing, asked him, 'Did you steal?, He said, 'No, by Allah, besides Whom there is none who has the right to be worshipped' Jesus said, 'I believe in Allah and suspect my eyes.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 114,
        "matchingArabicURN": 172280,
        "last_updated": "2021-01-27 17:30:37"
    },
    {
        "englishURN": 32180,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 654,
        "hadithText": "<p>\nNarrated `Umar:\n\n<p>I heard the Prophet (ﷺ) saying, \"Do not exaggerate in praising me as the Christians praised the son of \nMary, for I am only a Slave. So, call me the Slave of Allah and His Apostle.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 115,
        "matchingArabicURN": 172290,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32190,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 655,
        "hadithText": "<p>\nNarrated Abu Musa Al-Ash`ari:\n\n<p>Allah's Messenger (ﷺ) said, \"If a person teaches his slave girl good manners properly, educates her properly, \nand then manumits and marries her, he will get a double reward. And if a man believes in Jesus and \nthen believes in me, he will get a double reward. And if a slave fears his Lord (i.e. Allah) and obeys \nhis masters, he too will get a double reward.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 116,
        "matchingArabicURN": 172300,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32200,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 656,
        "hadithText": "<p>\nNarrted Ibn `Abbas:\n\n<p>Allah's Messenger (ﷺ) said, \"You will be resurrected (and assembled) bare-footed, naked and \nuncircumcised.\" The Prophet (ﷺ) then recited the Divine Verse:-- \"As We began the first creation, We \nshall repeat it: A promise We have undertaken. Truly we shall do it.\" (21.104) \nHe added, \"The first to be dressed will be Abraham. Then some of my companions will take to the \nright and to the left. I will say: 'My companions! 'It will be said, 'They had been renegades since you \nleft them.' I will then say what the Pious Slave Jesus, the son of Mary said: 'And I was a witness over \nthem while I dwelt amongst them; when You did take me up, You were the Watcher over them, and \nYou are a Witness to all things. If You punish them, they are Your slaves, and if you forgive them, \nYou, only You are the All-Mighty the All-Wise.' \" (5.117-118) Narrated Quaggas, \"Those were the \napostates who renegade from Islam during the Caliphate of Abu Bakr who fought them\".</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 117,
        "matchingArabicURN": 172310,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32210,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 657,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"By Him in Whose Hands my soul is, surely (Jesus,) the son of Mary will soon \ndescend amongst you and will judge mankind justly (as a Just Ruler); he will break the Cross and kill \nthe pigs and there will be no Jizya (i.e. taxation taken from non Muslims). Money will be in \nabundance so that nobody will accept it, and a single prostration to Allah (in prayer) will be better \nthan the whole world and whatever is in it.\" Abu Huraira added \"If you wish, you can recite (this \nverse of the Holy Book): -- 'And there is none Of the people of the Scriptures (Jews and Christians) \nBut must believe in him (i.e Jesus as an Apostle of Allah and a human being) Before his death. And \non the Day of Judgment He will be a witness Against them.\" (4.159) (See Fath-ul-Bari, Page 302 Vol \n7)</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 118,
        "matchingArabicURN": 172320,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32220,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Prophets",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 658,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said \"How will you be when the son of Mary (i.e. Jesus) descends amongst you and your imam is among you.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 119,
        "matchingArabicURN": 172330,
        "last_updated": "2013-11-09 21:27:33"
    },
    {
        "englishURN": 32230,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 659,
        "hadithText": "<p>\nNarrated Rabi bin Hirash:\n\n<p>`Uqba bin `Amr said to Hudhaifa, \"Won't you relate to us of what you have heard from Allah's \nApostle ?\" He said, \"I heard him saying, \"When Al-Dajjal appears, he will have fire and water along \nwith him. What the people will consider as cold water, will be fire that will burn (things). So, if \nanyone of you comes across this, he should fall in the thing which will appear to him as fire, for in \nreality, it will be fresh cold water.\" Hudhaifa added, \"I also heard him saying, 'From among the people \npreceding your generation, there was a man whom the angel of death visited to capture his soul. (So \nhis soul was captured) and he was asked if he had done any good deed.' He replied, 'I don't remember \nany good deed.' He was asked to think it over. He said, 'I do not remember, except that I used to trade \nwith the people in the world and I used to give a respite to the rich and forgive the poor (among my \ndebtors). So Allah made him enter Paradise.\" Hudhaifa further said, \"I also heard him saying, 'Once \nthere was a man on his death-bed, who, losing every hope of surviving said to his family: When I die, \ngather for me a large heap of wood and make a fire (to burn me). When the fire eats my meat and \nreaches my bones, and when the bones burn, take and crush them into powder and wait for a windy \nday to throw it (i.e. the powder) over the sea. They did so, but Allah collected his particles and asked \nhim: \nWhy did you do so? He replied: For fear of You. So Allah forgave him.\" `Uqba bin `Amr said, \"I \nheard him saying that the Israeli used to dig the grave of the dead (to steal their shrouds).</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 120,
        "matchingArabicURN": 172342,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32240,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 660,
        "hadithText": "<p>\nNarrated `Aisha and Ibn `Abbas:\n\n<p>On his death-bed Allah's Messenger (ﷺ) put a sheet over his-face and when he felt hot, he would remove it \nfrom his face. When in that state (of putting and removing the sheet) he said, \"May Allah's Curse be \non the Jews and the Christians for they build places of worship at the graves of their prophets.\" (By \nthat) he intended to warn (the Muslim) from what they (i.e. Jews and Christians) had done.</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 121,
        "matchingArabicURN": 172370,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32250,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 661,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"The Israelis used to be ruled and guided by prophets: Whenever a prophet died, \nanother would take over his place. There will be no prophet after me, but there will be Caliphs who \nwill increase in number.\" The people asked, \"O Allah's Messenger (ﷺ)! What do you order us (to do)?\" He \nsaid, \"Obey the one who will be given the pledge of allegiance first. Fulfil their (i.e. the Caliphs) \nrights, for Allah will ask them about (any shortcoming) in ruling those Allah has put under their \nguardianship.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 122,
        "matchingArabicURN": 172380,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32260,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 662,
        "hadithText": "<p>\nNarrated Abu Sa`id:\n\n<p>The Prophet (ﷺ) said, \"You will follow the wrong ways, of your predecessors so completely and literally \nthat if they should go into the hole of a mastigure, you too will go there.\" We said, \"O Allah's Messenger (ﷺ)! \nDo you mean the Jews and the Christians?\" He replied, \"Whom else?\" (Meaning, of course, the Jews \nand the Christians.)</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 123,
        "matchingArabicURN": 172390,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32270,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 663,
        "hadithText": "<p>\nNarrated Anas:\n\n<p>The people mentioned the fire and the bell (as means proposed for announcing the time of prayer) and \nby such a suggestion they referred to the Jews and the Christians. But Bilal was ordered, \"Pronounce \nthe words of the Adhan (i.e. call for the prayer) twice and the Iqama once only.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 124,
        "matchingArabicURN": 172400,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32280,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 664,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>That she used to hate that one should keep his hands on his flanks while praying. She said that the Jew \nused to do so.</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 125,
        "matchingArabicURN": 172410,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32290,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 665,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>Allah's Messenger (ﷺ) said, \"Your period (i.e. the Muslims' period) in comparison to the periods of the \nprevious nations, is like the period between the `Asr prayer and sunset. And your example in \ncomparison to the Jews and the Christians is like the example of a person who employed some \nlaborers and asked them, 'Who will work for me till midday for one Qirat each?' The Jews worked for \nhalf a day for one Qirat each. The person asked, 'Who will do the work for me from midday to the \ntime of the `Asr (prayer) for one Qirat each?' The Christians worked from midday till the `Asr prayer \nfor one Qirat. Then the person asked, 'Who will do the work for me from the `Asr till sunset for two \nQirats each?' \" The Prophet (ﷺ) added, \"It is you (i.e. Muslims) who are doing the work from the `Asr till \nsunset, so you will have a double reward. The Jews and the Christians got angry and said, 'We have \ndone more work but got less wages.' Allah said, 'Have I been unjust to you as regards your rights?' \nThey said, 'No.' So Allah said, 'Then it is My Blessing which I bestow on whomever I like. \"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 126,
        "matchingArabicURN": 172420,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32300,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 666,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>I heard `Umar saying, \"May Allah Curse so-and-so! Doesn't he know that the Prophet (ﷺ) said, 'May \nAllah curse the Jews for, though they were forbidden (to eat) fat, they liquefied it and sold it. \"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 127,
        "matchingArabicURN": 172430,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32310,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 667,
        "hadithText": "<p>\nNarrated `Abdullah bin `Amr:\n\n<p>The Prophet (ﷺ) said, \"Convey (my teachings) to the people even if it were a single sentence, and tell \nothers the stories of Bani Israel (which have been taught to you), for it is not sinful to do so. And \nwhoever tells a lie on me intentionally, will surely take his place in the (Hell) Fire.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 128,
        "matchingArabicURN": 172440,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32320,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 668,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"The Jews and the Christians do not dye (their grey hair), so you shall do the \nopposite of what they do (i.e. dye your grey hair and beards).</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 129,
        "matchingArabicURN": 172450,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32330,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 669,
        "hadithText": "<p>\nNarrated Jundub:\n\n<p>Allah's Messenger (ﷺ) said, \"Amongst the nations before you there was a man who got a wound, and \ngrowing impatient (with its pain), he took a knife and cut his hand with it and the blood did not stop \ntill he died. Allah said, 'My Slave hurried to bring death upon himself so I have forbidden him (to \nenter) Paradise.' \"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 130,
        "matchingArabicURN": 172460,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32340,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 670,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>that he heard Allah's Messenger (ﷺ) saying, \"Allah willed to test three Israelis who were a Leper, a blind man \nand a bald-headed man. So, he sent them an angel who came to the leper and said, 'What thing do you \nlike most?' He replied, 'Good color and good skin, for the people have a strong aversion to me.' The \nangel touched him and his illness was cured, and he was given a good color and beautiful skin. The \nangel asked him, 'What kind of property do you like best?' He replied, 'Camels (or cows).' (The \nnarrator is in doubt, for either the leper or the bald-headed man demanded camels and the other \ndemanded cows). So he (i.e. the leper) was given a pregnant she-camel, and the angel said (to him), \n'May Allah bless you in it.' \nThe angel then went to the bald-headed man and said, 'What thing do you like most?' He said, 'I like \ngood hair and wish to be cured of this disease, for the people feel repulsion for me.' The angel touched \nhim and his illness was cured, and he was given good hair. The angel asked (him), 'What kind of \nproperty do you like best?' He replied, 'Cows,' The angel gave him a pregnant cow and said, 'May \nAllah bless you in it.' The angel went to the blind man and asked, 'What thing do you like best?' He \nsaid, '(I like) that Allah may restore my eye-sight to me so that I may see the people.' The angel \ntouched his eyes and Allah gave him back his eye-sight. The angel asked him, 'What kind of property \ndo you like best?' He replied, 'Sheep.' The angel gave him a pregnant sheep. Afterwards, all the three \npregnant animals gave birth to young ones, and multiplied and brought forth so much that one of the \n(three) men had a herd of camels filling a valley, and one had a herd of cows filling a valley, and one \nhad a flock of sheep filling a valley. Then the angel, disguised in the shape and appearance of a leper, \nwent to the leper and said, I am a poor man, who has lost all means of livelihood while on a journey. \nSo none will satisfy my need except Allah and then you. In the Name of Him Who has given you such \nnice color and beautiful skin, and so much property, I ask you to give me a camel so that I may reach \nmy destination. The man replied, 'I have many obligations (so I cannot give you).' The angel said, 'I \nthink I know you; were you not a leper to whom the people had a strong aversion? Weren't you a poor \nman, and then Allah gave you (all this property).' He replied, '(This is all wrong), I got this property \nthrough inheritance from my fore-fathers.' The angel said, 'If you are telling a lie, then let Allah make \nyou as you were before. ' \nThen the angel, disguised in the shape and appearance of a bald man, went to the bald man and said to \nhim the same as he told the first one, and he too answered the same as the first one did. The angel \nsaid, 'If you are telling a lie, then let Allah make you as you were before.' \nThe angel, disguised in the shape of a blind man, went to the blind man and said, 'I am a poor man and \na traveler, whose means of livelihood have been exhausted while on a journey. I have nobody to help \nme except Allah, and after Him, you yourself. I ask you in the Name of Him Who has given you back \nyour eye-sight to give me a sheep, so that with its help, I may complete my journey.' The man said, 'No \ndoubt, I was blind and Allah gave me back my eye-sight; I was poor and Allah made me rich; so take \nanything you wish from my property. By Allah, I will not stop you for taking anything (you need) of \nmy property which you may take for Allah's sake.' The angel replied, 'Keep your property with you. \nYou (i.e the three men) have been tested, and Allah is pleased with you and is angry with your two \ncompanions.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 131,
        "matchingArabicURN": 172470,
        "last_updated": "2015-02-19 10:59:22"
    },
    {
        "englishURN": 32350,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 671,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>Allah's Messenger (ﷺ) said, \"Once three persons (from the previous nations) were traveling, and suddenly it \nstarted raining and they took shelter in a cave. The entrance of the cave got closed while they were \ninside. They said to each other, 'O you! Nothing can save you except the truth, so each of you should \nask Allah's Help by referring to such a deed as he thinks he did sincerely (i.e. just for gaining Allah's \nPleasure).' So one of them said, 'O Allah! You know that I had a laborer who worked for me for one \nFaraq (i.e. three Sas) of rice, but he departed, leaving it (i.e. his wages). I sowed that Faraq of rice and \nwith its yield I bought cows (for him). Later on when he came to me asking for his wages, I said (to \nhim), 'Go to those cows and drive them away.' He said to me, 'But you have to pay me only a Faraq of \nrice,' I said to him, 'Go to those cows and take them, for they are the product of that Faraq (of rice).' \nSo he drove them. O Allah! If you consider that I did that for fear of You, then please remove the \nrock.' The rock shifted a bit from the mouth of the cave. \nThe second one said, 'O Allah, You know that I had old parents whom I used to provide with the milk \nof my sheep every night. One night I was delayed and when I came, they had slept, while my wife and \nchildren were crying with hunger. I used not to let them (i.e. my family) drink unless my parents had \ndrunk first. So I disliked to wake them up and also disliked that they should sleep without drinking it, \nI kept on waiting (for them to wake) till it dawned. O Allah! If You consider that I did that for fear of \nyou, then please remove the rock.' So the rock shifted and they could see the sky through it. The \n(third) one said, 'O Allah! You know that I had a cousin (i.e. my paternal uncle's daughter) who was \nmost beloved to me and I sought to seduce her, but she refused, unless I paid her one-hundred Dinars \n(i.e. gold pieces). So I collected the amount and brought it to her, and she allowed me to sleep with \nher. But when I sat between her legs, she said, 'Be afraid of Allah, and do not deflower me but legally. \n'I got up and left the hundred Dinars (for her). O Allah! If You consider that I did that for fear of you \nthan please remove the rock. So Allah saved them and they came out (of the cave).\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 132,
        "matchingArabicURN": 172480,
        "last_updated": "2012-12-18 17:22:28"
    },
    {
        "englishURN": 32360,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 672,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>That he heard Allah's Messenger (ﷺ) saying, \"While a lady was nursing her child, a rider passed by and she \nsaid, 'O Allah! Don't let my child die till he becomes like this (rider).' The child said, 'O Allah! Don't \nmake me like him,' and then returned to her breast (sucking it). (After a while) they passed by a lady \nwho was being pulled and teased (by the people). The child's mother said, 'O Allah! Do not make my \nchild like her.' The child said, 'O Allah! Make me like her.' Then he said, 'As for the rider, he is an \ninfidel, while the lady is accused of illegal sexual intercourse (falsely) and she says: Allah is sufficient \nfor me (He knows the truth).</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 133,
        "matchingArabicURN": 172490,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32370,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 673,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"While a dog was going round a well and was about to die of thirst, an Israeli \nprostitute saw it and took off her shoe and watered it. So Allah forgave her because of that good \ndeed.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 134,
        "matchingArabicURN": 172500,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32380,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 674,
        "hadithText": "<p>\nNarrated Humaid bin `Abdur-Rahman:\n\n<p>That he heard Muawiya bin Abi Sufyan (talking) on the pulpit in the year when he performed the Hajj. \nHe took a tuft of hair that was in the hand of an orderly and said, \"O people of Medina! Where are \nyour learned men? I heard the Prophet (ﷺ) forbidding such a thing as this (i.e. false hair) and he used to \nsay, 'The Israelis were destroyed when their ladies practiced this habit (of using false hair to lengthen \ntheir locks).</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 135,
        "matchingArabicURN": 172510,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32390,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 675,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"Amongst the people preceding you there used to be 'Muhaddithun' (i.e. persons \nwho can guess things that come true later on, as if those persons have been inspired by a divine \npower), and if there are any such persons amongst my followers, it is `Umar bin Al-Khattab.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 136,
        "matchingArabicURN": 172520,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32400,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 676,
        "hadithText": "<p>\nNarrated Abu Sa`id Al-Khudri:\n\n<p>The Prophet (ﷺ) said, \"Amongst the men of Bani Israel there was a man who had murdered ninety-nine \npersons. Then he set out asking (whether his repentance could be accepted or not). He came upon a \nmonk and asked him if his repentance could be accepted. The monk replied in the negative and so the \nman killed him. He kept on asking till a man advised to go to such and such village. (So he left for it) \nbut death overtook him on the way. While dying, he turned his chest towards that village (where he \nhad hoped his repentance would be accepted), and so the angels of mercy and the angels of \npunishment quarrelled amongst themselves regarding him. Allah ordered the village (towards which \nhe was going) to come closer to him, and ordered the village (whence he had come), to go far away, \nand then He ordered the angels to measure the distances between his body and the two villages. So he \nwas found to be one span closer to the village (he was going to). So he was forgiven.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 137,
        "matchingArabicURN": 172530,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32410,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 677,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Once Allah's Messenger (ﷺ); offered the morning prayer and then faced the people and said, \"While a man \nwas driving a cow, he suddenly rode over it and beat it. The cow said, \"We have not been created for \nthis, but we have been created for sloughing.\" On that the people said astonishingly, \"Glorified be \nAllah! A cow speaks!\" The Prophet (ﷺ) said, \"I believe this, and Abu Bakr and `Umar too, believe it, \nalthough neither of them was present there. While a person was amongst his sheep, a wolf attacked \nand took one of the sheep. The man chased the wolf till he saved it from the wolf, where upon the \nwolf said, 'You have saved it from me; but who will guard it on the day of the wild beasts when there \nwill be no shepherd to guard them except me (because of riots and afflictions)? ' \" The people said \nsurprisingly, \"Glorified be Allah! A wolf speaks!\" The Prophet (ﷺ) said, \"But I believe this, and Abu Bakr \nand `Umar too, believe this, although neither of them was present there.\" (See the Foot-note of page \nNo. 10 Vol.5)</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 138,
        "matchingArabicURN": 172541,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32420,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 678,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"A man bought a piece of land from another man, and the buyer found an \nearthenware jar filled with gold in the land. The buyer said to the seller. 'Take your gold, as I have \nbought only the land from you, but I have not bought the gold from you.' The (former) owner of the \nland said, \"I have sold you the land with everything in it.' So both of them took their case before a \nman who asked, 'Do you have children?' One of them said, \"I have a boy.' The other said, \"I have a \ngirl.' The man said, 'Marry the girl to the boy and spend the money on both of them and give the rest \nof it in charity.'\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 139,
        "matchingArabicURN": 172560,
        "last_updated": "2020-05-25 21:06:44"
    },
    {
        "englishURN": 32430,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 679,
        "hadithText": "<p>\nNarrated Usama bin Zaid:\n\n<p>Allah's Messenger (ﷺ) said, \"Plague was a means of torture sent on a group of Israelis (or on some people \nbefore you). So if you hear of its spread in a land, don't approach it, and if a plague should appear in a \nland where you are present, then don't leave that land in order to run away from it (i.e. plague).</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 140,
        "matchingArabicURN": 172570,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32440,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 680,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>(the wife of the Prophet) I asked Allah's Messenger (ﷺ) about the plague. He told me that it was a \nPunishment sent by Allah on whom he wished, and Allah made it a source of mercy for the believers, \nfor if one in the time of an epidemic plague stays in his country patiently hoping for Allah's Reward \nand believing that nothing will befall him except what Allah has written for him, he will get the \nreward of a martyr.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 141,
        "matchingArabicURN": 172580,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32450,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 681,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>The people of Quraish worried about the lady from Bani Makhzum who had committed theft. They \nasked, \"Who will intercede for her with Allah's Messenger (ﷺ)?\" Some said, \"No one dare to do so except \nUsama bin Zaid the beloved one to Allah's Messenger (ﷺ) .\" When Usama spoke about that to Allah's \nApostle Allah's Messenger (ﷺ) said, (to him), \"Do you try to intercede for somebody in a case connected \nwith Allah's Prescribed Punishments?\" Then he got up and delivered a sermon saying, \"What \ndestroyed the nations preceding you, was that if a noble amongst them stole, they would forgive him, \nand if a poor person amongst them stole, they would inflict Allah's Legal punishment on him. By \nAllah, if Fatima, the daughter of Muhammad stole, I would cut off her hand.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 142,
        "matchingArabicURN": 172590,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32460,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 682,
        "hadithText": "<p>\nNarrated Ibn Mas`ud:\n\n<p>I heard a person reciting a (Qur'anic) Verse in a certain way, and I had heard the Prophet (ﷺ) reciting the \nsame Verse in a different way. So I took him to the Prophet (ﷺ) and informed him of that but I noticed the \nsign of disapproval on his face, and then he said, \"Both of you are correct, so don't differ, for the \nnations before you differed, so they were destroyed.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 143,
        "matchingArabicURN": 172600,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32470,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 683,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>As if I saw the Prophet (ﷺ) talking about one of the prophets whose nation had beaten him and caused him \nto bleed, while he was cleaning the blood off his face and saying, \"O Allah! Forgive my nation, for \nthey have no knowledge.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 144,
        "matchingArabicURN": 172610,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32480,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 684,
        "hadithText": "<p>\nNarrated Abu Sa`id:\n\n<p>The Prophet (ﷺ) said, \"Amongst the people preceding your age, there was a man whom Allah had given a \nlot of money. While he was in his death-bed, he called his sons and said, 'What type of father have I \nbeen to you? They replied, 'You have been a good father.' He said, 'I have never done a single good \ndeed; so when I die, burn me, crush my body, and scatter the resulting ashes on a windy day.' His sons \ndid accordingly, but Allah gathered his particles and asked (him), 'What made you do so?' He replied, \n\"Fear of you.' So Allah bestowed His Mercy upon him. (forgave him).</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 145,
        "matchingArabicURN": 172621,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32491,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 685,
        "hadithText": "<p>\nNarrated Rabi` bin Hirash:\n\n<p>`Uqba said to Hudhaifa, \"Won't you narrate to us what you heard from Allah's Messenger (ﷺ) ?\" Hudhaifa \nsaid, \"I heard him saying, 'Death approached a man and when he had no hope of surviving, he said to \nhis family, 'When I die, gather for me much wood and build a fire (to burn me),. When the fire has \neaten my flesh and reached my bones, take the bones and grind them and scatter the resulting powder \nin the sea on a hot (or windy) day.' (That was done.) But Allah collected his particles and asked (him), \n'Why did you do so?' He replied, 'For fear of You.' So Allah forgave him.\"<p>\nNarrated `Abdu Malik:\n\n<p>As above, saying, \"On a windy day.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 146,
        "matchingArabicURN": 172640,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32510,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 687,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"A man used to give loans to the people and used to say to his servant, 'If the \ndebtor is poor, forgive him, so that Allah may forgive us.' So when he met Allah (after his death), \nAllah forgave him.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 147,
        "matchingArabicURN": 172650,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32520,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 688,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"A man used to do sinful deeds, and when death came to him, he said to his sons, \n'After my death, burn me and then crush me, and scatter the powder in the air, for by Allah, if Allah \nhas control over me, He will give me such a punishment as He has never given to anyone else.' When \nhe died, his sons did accordingly. Allah ordered the earth saying, 'Collect what you hold of his \nparticles.' It did so, and behold! There he was (the man) standing. Allah asked (him), 'What made you \ndo what you did?' He replied, 'O my Lord! I was afraid of You.' So Allah forgave him. \" Another \nnarrator said \"The man said, Fear of You, O Lord!\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 148,
        "matchingArabicURN": 172660,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32530,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 689,
        "hadithText": "<p>\nNarrated `Abdullah bin `Umar:\n\n<p>Allah's Messenger (ﷺ) said, \"A lady was punished because of a cat which she had imprisoned till it died. She \nentered the (Hell) Fire because of it, for she neither gave it food nor water as she had imprisoned it, \nnor set it free to eat from the vermin of the earth.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 149,
        "matchingArabicURN": 172670,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32540,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 690,
        "hadithText": "<p>\nNarrated Abu Masud `Uqba:\n\n<p>The Prophet (ﷺ) said, \"One of the sayings of the prophets which the people have got, is. 'If you do not feel \nashamed, then do whatever you like.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 150,
        "matchingArabicURN": 172680,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32550,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 691,
        "hadithText": "<p>\nNarrated Abu Mus'ud:\n\n<p>The Prophet (ﷺ) said, \"One of the sayings of the prophets which the people have got is, 'If you do not feel \nashamed, then do whatever you like.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 151,
        "matchingArabicURN": 172690,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32560,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 692,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>The Prophet (ﷺ) said, \"While a man was walking, dragging his dress with pride, he was caused to be \nswallowed by the earth and will go on sinking in it till the Day of Resurrection.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 152,
        "matchingArabicURN": 172700,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32570,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 693,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"We are the last (to come) but we will be the foremost on the Day of Resurrection, \nnations were given the Book (i.e. Scripture) before us, and we were given the Holy Book after them. \nThis (i.e. Friday) is the day about which they differed. So the next day (i.e. Saturday) was prescribed \nfor the Jews and the day after it (i.e. Sunday) for the Christians. It is incumbent on every Muslim to \nwash his head and body on a Day (i.e. Friday) (at least) in every seven days.\"</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 153,
        "matchingArabicURN": 172711,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 32580,
        "collection": "bukhari",
        "volumeNumber": 4,
        "bookNumber": 55,
        "bookName": "Virtues and Merits of the Prophet (pbuh) and his Companions",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 694,
        "hadithText": "<p>\nNarrated Sa`id bin Al-Musaiyab:\n\n<p>When Muawiya bin Abu Sufyan came to Medina for the last time, he delivered a sermon before us. \nHe took out a tuft of hair and said, \"I never thought that someone other than the Jews would do such a \nthing (i.e. use false hair). The Prophet (ﷺ) named such a practice, 'Az-Zur' (i.e. falsehood),\" meaning the \nuse of false hair.</b>",
        "bookID": "55.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 154,
        "matchingArabicURN": 172730,
        "last_updated": "2012-04-26 07:00:00"
    }
]