[
    {
        "englishURN": 3310,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "Rubbing hands and feet with dust (Tayammum)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 330,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>(the wife of the Prophet) We set out with Allah's Messenger (ﷺ) on one of his journeys till we reached Al- \nBaida' or Dhatul-Jaish, a necklace of mine was broken (and lost). Allah's Messenger (ﷺ) stayed there to \nsearch for it, and so did the people along with him. There was no water at that place, so the people \nwent to Abu- Bakr As-Siddiq and said, \"Don't you see what `Aisha has done? She has made Allah's \nApostle and the people stay where there is no water and they have no water with them.\" Abu Bakr \ncame while Allah's Messenger (ﷺ) was sleeping with his head on my thigh, He said, to me: \"You have \ndetained Allah's Messenger (ﷺ) and the people where there is no water and they have no water with them. \nSo he admonished me and said what Allah wished him to say and hit me on my flank with his hand. \nNothing prevented me from moving (because of pain) but the position of Allah's Messenger (ﷺ) on my thigh. \nAllah's Messenger (ﷺ) got up when dawn broke and there was no water. So Allah revealed the Divine Verses \nof Tayammum. So they all performed Tayammum. Usaid bin Hudair said, \"O the family of Abu Bakr! \nThis is not the first blessing of yours.\" Then the camel on which I was riding was caused to move \nfrom its place and the necklace was found beneath it.</b>",
        "bookID": "7.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 103350,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 3320,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "Rubbing hands and feet with dust (Tayammum)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 331,
        "hadithText": "<p>\nNarrated Jabir bin `Abdullah:\n\n<p>The Prophet (ﷺ) said, \"I have been given five things which were not given to any one else before me. \n-1. Allah made me victorious by awe, (by His frightening my enemies) for a distance of one month's \njourney. \n-2. The earth has been made for me (and for my followers) a place for praying and a thing to perform \nTayammum, therefore anyone of my followers can pray wherever the time of a prayer is due. \n-3. The booty has been made Halal (lawful) for me yet it was not lawful for anyone else before me. \n-4. I have been given the right of intercession (on the Day of Resurrection). \n-5. Every Prophet used to be sent to his nation only but I have been sent to all mankind.</b>",
        "bookID": "7.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 103360,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 3330,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "Rubbing hands and feet with dust (Tayammum)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 332,
        "hadithText": "<p>\nNarrated `Urwa's father:\n\n<p>Aisha said, \"I borrowed a necklace from Asma' and it was lost. So Allah's Messenger (ﷺ) sent a man to \nsearch for it and he found it. Then the time of the prayer became due and there was no water. They \nprayed (without ablution) and informed Allah's Messenger (ﷺ) about it, so the verse of Tayammum was \nrevealed.\" Usaid bin Hudair said to `Aisha, \"May Allah reward you. By Allah, whenever anything \nhappened which you did not like, Allah brought good for you and for the Muslims in that.\"</b>",
        "bookID": "7.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 103370,
        "last_updated": "2014-02-23 22:37:28"
    },
    {
        "englishURN": 3340,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "Rubbing hands and feet with dust (Tayammum)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 333,
        "hadithText": "<p>\nNarrated Abu Juhaim Al-Ansari:\n\n<p>The Prophet (ﷺ) came from the direction of Bir Jamal. A man met him and greeted him. But he did not \nreturn back the greeting till he went to a (mud) wall and wiped his face and hands with its dust \n(performed Tayammum) and then returned back the greeting.</b>",
        "bookID": "7.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 103380,
        "last_updated": "2014-01-03 03:01:19"
    },
    {
        "englishURN": 3350,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "Rubbing hands and feet with dust (Tayammum)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 334,
        "hadithText": "<p>\nNarrated `Abdur Rahman bin Abza [??]:\n\n<p>A man came to `Umar bin Al-Khattab and said, \"I became Junub but no water was available.\" \n`Ammar bin Yasir said to `Umar, \"Do you remember that you and I (became Junub while both of us) \nwere together on a journey and you didn't pray but I rolled myself on the ground and prayed? I \ninformed the Prophet (ﷺ) about it and he said, 'It would have been sufficient for you to do like this.' The \nProphet then stroked lightly the earth with his hands and then blew off the dust and passed his hands \nover his face and hands.\"</b>",
        "bookID": "7.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 103390,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 3360,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "Rubbing hands and feet with dust (Tayammum)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 335,
        "hadithText": "<p>\nNarrated Sa`id bin `Abdur Rahman bin Abza:\n\n<p>(on the authority of his father who said) `Ammar said so (the above Statement). And Shu`ba stroked \nlightly the earth with his hands and brought them close to his mouth (blew off the dust) and passed \nthem over his face and then the backs of his hands. `Ammar said, \"Ablution (meaning Tayammum \nhere) is sufficient for a Muslim if water is not available.\"</b>",
        "bookID": "7.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 103400,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 3370,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "Rubbing hands and feet with dust (Tayammum)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 336,
        "hadithText": "<p>\nNarrated `Abdur Rahman bin Abza:\n\n<p>that while he was in the company of `Umar, `Ammar said to `Umar, \"We were in a detachment and \nbecame Junub and I blew the dust off my hands (performed the rolling over the earth and prayed.)\"</b>",
        "bookID": "7.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 103410,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 3380,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "Rubbing hands and feet with dust (Tayammum)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 337,
        "hadithText": "<p>\nNarrated `Abdur Rahman bin Abza:\n\n<p>`Ammar said to `Umar \"I rolled myself in the dust and came to the Prophet (ﷺ) who said, 'Passing dusted \nhands over the face and the backs of the hands is sufficient for you.' \"</b>",
        "bookID": "7.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 103420,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 3390,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "Rubbing hands and feet with dust (Tayammum)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 338,
        "hadithText": "<p>\nNarrated `Ammar:\n\n<p>As above.</b>",
        "bookID": "7.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 103430,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 3400,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "Rubbing hands and feet with dust (Tayammum)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 339,
        "hadithText": "<p>\nNarrated `Ammar:\n\n<p>The Prophet (ﷺ) stroked the earth with his hands and then passed them over his face and the backs of his \nhands (while demonstrating Tayammum).</b>",
        "bookID": "7.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 103440,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 3410,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "Rubbing hands and feet with dust (Tayammum)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 340,
        "hadithText": "<p>\nNarrated `Imran:\n\n<p>Once we were traveling with the Prophet (ﷺ) and we carried on traveling till the last part of the night and \nthen we (halted at a place) and slept (deeply). There is nothing sweeter than sleep for a traveler in the \nlast part of the night. So it was only the heat of the sun that made us to wake up and the first to wake \nup was so and so, then so and so and then so and so (the narrator `Auf said that Abu Raja' had told \nhim their names but he had forgotten them) and the fourth person to wake up was `Umar bin Al- \nKhattab. And whenever the Prophet (ﷺ) used to sleep, nobody would wake up him till he himself used to \nget up as we did not know what was happening (being revealed) to him in his sleep. So, `Umar got up \nand saw the condition of the people, and he was a strict man, so he said, \"Allahu Akbar\" and raised his \nvoice with Takbir, and kept on saying loudly till the Prophet (ﷺ) got up because of it. When he got up, the \npeople informed him about what had happened to them. He said, \"There is no harm (or it will not be \nharmful). Depart!\" So they departed from that place, and after covering some distance the Prophet (ﷺ) \nstopped and asked for some water to perform the ablution. So he performed the ablution and the call \nfor the prayer was pronounced and he led the people in prayer. After he finished from the prayer, he \nsaw a man sitting aloof who had not prayed with the people. He asked, \"O so and so! What has \nprevented you from praying with us?\" He replied, \"I am Junub and there is no water. \" The Prophet (ﷺ) \nsaid, \"Perform Tayammum with (clean) earth and that is sufficient for you.\" \nThen the Prophet (ﷺ) proceeded on and the people complained to him of thirst. Thereupon he got down \nand called a person (the narrator `Auf added that Abu Raja' had named him but he had forgotten) and \n`Ali, and ordered them to go and bring water. So they went in search of water and met a woman who \nwas sitting on her camel between two bags of water. They asked, \"Where can we find water?\" She \nreplied, \"I was there (at the place of water) this hour yesterday and my people are behind me.\" They \nrequested her to accompany them. She asked, \"Where?\" They said, \"To Allah's Messenger (ﷺ) .\" She said, \n\"Do you mean the man who is called the Sabi, (with a new religion)?\" They replied, \"Yes, the same \nperson. So come along.\" They brought her to the Prophet (ﷺ) and narrated the whole story. He said, \"Help \nher to dismount.\" The Prophet (ﷺ) asked for a pot, then he opened the mouths of the bags and poured \nsome water into the pot. Then he closed the big openings of the bags and opened the small ones and \nthe people were called upon to drink and water their animals. \nSo they all watered their animals and they (too) all quenched their thirst and also gave water to others \nand last of all the Prophet (ﷺ) gave a pot full of water to the person who was Junub and told him to pour it \nover his body. The woman was standing and watching all that which they were doing with her water. \nBy Allah, when her water bags were returned the looked like as if they were more full (of water) than \nthey had been before (Miracle of Allah's Messenger (ﷺ)) Then the Prophet (ﷺ) ordered us to collect something \nfor her; so dates, flour and Sawiq were collected which amounted to a good meal that was put in a \npiece of cloth. She was helped to ride on her camel and that cloth full of foodstuff was also placed in \nfront of her and then the Prophet (ﷺ) said to her, \"We have not taken your water but Allah has given water \nto us.\" She returned home late. Her relatives asked her: \"O so and so what has delayed you?\" She said, \n\"A strange thing! Two men met me and took me to the man who is called the Sabi' and he did such \nand such a thing. By Allah, he is either the greatest magician between this and this (gesturing with her \nindex and middle fingers raising them towards the sky indicating the heaven and the earth) or he is \nAllah's true Apostle.\" \nAfterwards the Muslims used to attack the pagans around her abode but never touched her village. \nOne day she said to her people, \"I think that these people leave you purposely. Have you got any \ninclination to Islam?\" They obeyed her and all of them embraced Islam. \nAbu `Abdullah said: The word Saba'a means \"The one who has deserted his old religion and embraced \na new religion.\" Abul 'Ailya [??] said, \"The S`Abis are a sect of people of the Scripture who recite the \nBook of Psalms.\"</b>",
        "bookID": "7.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 103450,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 3420,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "Rubbing hands and feet with dust (Tayammum)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 341,
        "hadithText": "<p>\nNarrated Abu Wail:\n\n<p>Abu Musa said to `Abdullah bin Mas`ud, \"If one does not find water (for ablution) can he give up the \nprayer?\" `Abdullah replied, \"If you give the permission to perform Tayammum they will perform \nTayammum even if water was available if one of them found it cold.\" Abu Musa said, \"What about \nthe statement of `Ammar to `Umar?\" `Abdullah replied, \"`Umar was not satisfied by his statement.\"</b>",
        "bookID": "7.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 103460,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 3430,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "Rubbing hands and feet with dust (Tayammum)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 342,
        "hadithText": "<p>\nNarrated Shaqiq bin Salama:\n\n<p>I was with `Abdullah and Abu Musa; the latter asked the former, \"O Abu `Abdur-Rahman! What is \nyour opinion if somebody becomes Junub and no water is available?\" `Abdullah replied, \"Do not pray \ntill water is found.\" Abu Musa said, \"What do you say about the statement of `Ammar (who was \nordered by the Prophet (ﷺ) to perform Tayammum). The Prophet (ﷺ) said to him: \"Perform Tayammum and \nthat would be sufficient.\" `Abdullah replied, \"Don't you see that `Umar was not satisfied by `Ammar's \nstatement?\" Abu- Musa said, \"All right, leave `Ammar's statement, but what will you say about this \nverse (of Tayammum)?\" `Abdullah kept quiet and then said, \"If we allowed it, then they would \nprobably perform Tayammum even if water was available, if one of them found it (water) cold.\" The \nnarrator added, \"I said to Shaqiq, \"Then did `Abdullah dislike to perform Tayammum because of \nthis?\" He replied, \"Yes.\"</b>",
        "bookID": "7.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 103470,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 3440,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "Rubbing hands and feet with dust (Tayammum)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 343,
        "hadithText": "<p>\nNarrated Al-A`mash:\n\n<p>Shaqiq said, \"While I was sitting with `Abdullah and Abu Musa Al-Ash`ari, the latter asked the \nformer, 'If a person becomes Junub and does not find water for one month, can he perform \nTayammum and offer his prayer?' (He applied in the negative). Abu Musa said, 'What do you say \nabout this verse from Sura \"Al-Ma'ida\": When you do not find water then perform Tayammum with \nclean earth? `Abdullah replied, 'If we allowed it then they would probably perform Tayammum with \nclean earth even if water were available but cold.' I said to Shaqiq, 'You then disliked to perform \nTayammum because of this?' Shaqiq said, 'Yes.' (Shaqiq added), \"Abu Musa said, 'Haven't you heard \nthe statement of `Ammar to `Umar? He said: I was sent out by Allah's Messenger (ﷺ) for some job and I \nbecame Junub and could not find water so I rolled myself over the dust (clean earth) like an animal \ndoes, and when I told the Prophet (ﷺ) of that he said, 'Like this would have been sufficient.' The Prophet (ﷺ) \n(saying so) lightly stroked the earth with his hand once and blew it off, then passed his (left) hand over \nthe back of his right hand or his (right) hand over the back of his left hand and then passed them over \nhis face.' So `Abdullah said to Abu- Musa, 'Don't you know that `Umar was not satisfied with \n`Ammar's statement?' \" \nNarrated Shaqiq: While I was with `Abdullah and Abu Musa, the latter said to the former, \"Haven't \nyou heard the statement of `Ammar to `Umar? He said, \"Allah's Messenger (ﷺ) sent you and me out and I \nbecame Junub and rolled myself in the dust (clean earth) (for Tayammum). When we came to Allah's \nApostle I told him about it and he said, 'This would have been sufficient,' passing his hands over his \nface and the backs of his hands once only.' \"</b>",
        "bookID": "7.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 103480,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 3450,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 7,
        "bookName": "Rubbing hands and feet with dust (Tayammum)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 344,
        "hadithText": "<p>\nNarrated `Imran bin Husain Al-Khuza`i:\n\n<p>Allah's Messenger (ﷺ) saw a person sitting aloof and not praying with the people. He asked him, \"O so and \nso! What prevented you from offering the prayer with the people?\" He replied, \"O Allah's Messenger (ﷺ)! I \nam Junub and there is no water.\" The Prophet (ﷺ) said, \"Perform Tayammum with clean earth and that \nwill be sufficient for you.\"</b>",
        "bookID": "7.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 103490,
        "last_updated": "2012-04-26 07:00:00"
    }
]