[
    {
        "englishURN": 50280,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 286,
        "hadithText": "<p>\nNarrated Abu Musa Al-Ash`ari:\n\n<p>The Prophet (ﷺ) said, \"Give food to the hungry, pay a visit to the sick and release (set free) the one in \ncaptivity (by paying his ransom).</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 145740,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50290,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 287,
        "hadithText": "<p>\n\n     Narrated Abu Huraira:\n<p>\n\n     The family of Muhammad did not eat their fill for three successive \n     days till he died.\n<p></b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 145750,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50300,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 287,
        "hadithText": "<p>\n\n     Narrated Abu Huraira:\n<p>\n\n     Once while I was in a state of fatigue (because of severe hunger), I \n     met 'Umar bin Al-Khattab, so I asked him to recite a verse from \n     Allah's Book to me. He entered his house and interpreted it to me. \n     (Then I went out and) after walking for a short distance, I fell on my\n     face because of fatigue and severe hunger. Suddenly I saw Allah's \n     Apostle  standing by my head. He said, \"O Abu Huraira!\" I replied, \n     \"Labbaik, O Allah's Messenger (ﷺ), and Sadaik!\" Then he held me by the hand,\n     and made me get up. Then he came to know what I was suffering from. He\n     took me to his house, and ordered a big bowl of milk for me. I drank \n     thereof and he said, \"Drink more, O Abu Hirr!\" So I drank again, \n     whereupon he again said, \"Drink more.\" So I drank more till my belly \n     became full and looked like a bowl. Afterwards I met 'Umar and \n     mentioned to him what had happened to me, and said to him, \"Somebody, \n     who had more right than you, O 'Umar, took over the case. By Allah, I \n     asked you to recite a Verse to me while I knew it better than you.\" On\n     that Umar said to me, \"By Allah, if I admitted and entertained you, it\n     would have been dearer to me than having nice red camels.\n<p></b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 145760,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50310,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 288,
        "hadithText": "<p>\nNarrated `Umar bin Abi Salama:\n\n<p>I was a boy under the care of Allah's Messenger (ﷺ) and my hand used to go around the dish while I was \neating. So Allah's Messenger (ﷺ) said to me, 'O boy! Mention the Name of Allah and eat with your right \nhand, and eat of the dish what is nearer to you.\" Since then I have applied those instructions when \neating.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 145770,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50320,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 289,
        "hadithText": "<p>\nNarrated `Umar bin Al Salama:\n\n<p>Who was the son of Um Salama, the wife of the Prophet: \nOnce I ate a meal with Allah's Messenger (ﷺ) and I was eating from all sides of the dish. So Allah's Messenger (ﷺ) \nsaid to me, \"Eat of the dish what is nearer to you.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 145780,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50330,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 290,
        "hadithText": "<p>\nNarrated Wahb bin Kaisan Abi Nu'aim:\n\n<p>A meal was brought to Allah's Messenger (ﷺ) while his step-son, `Umar bin Abi Salama was with him. \nAllah's Messenger (ﷺ) said to him, \"Mention the Name of Allah and eat of the dish what is nearer to you.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 145790,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50340,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 291,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>A tailor invited Allah's Messenger (ﷺ) to a meal which he had prepared. I went along with Allah's Messenger (ﷺ) \nand saw him seeking to eat the pieces of gourd from the various sides of the dish. Since that day I \nhave liked to eat gourd. `Umar bin Abi Salama said: The Prophet, said to me, \"Eat with your right \nhand.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 145800,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50350,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 292,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>The Prophet (ﷺ) used to love to start doing things from the right side whenever possible, in performing \nablution, putting on his shoes, and combing his hair. (Al-Ash'ath said: The Prophet (ﷺ) used to do so in all \nhis affairs.)</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 145810,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50360,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 293,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>Abu Talha said to Um Sulaim, \"I have heard the voice of Allah's Messenger (ﷺ) which was feeble, and I \nthink that he is hungry. Have you got something (to eat)?\" She took out some loaves of barley bread, \nthen took her face-covering sheet and wrapped the bread in part of it, and pushed it under my garment \nand turned the rest of it around my body and sent me to Allah's Messenger (ﷺ) . I went with that, and found \nAllah's Messenger (ﷺ) in the mosque with some people. I stood up near them, and Allah's Messenger (ﷺ) asked me, \n\"Have you been sent by Abu Talha?\" I said, \"Yes.\" He asked, \"With some food (for us)?\" I said, \n\"Yes.\" Then Allah's Messenger (ﷺ) said to all those who were with him, \"Get up!\" He set out (and all the \npeople accompanied him) and I proceeded ahead of them till I came to Abu Talha. Abu Talha then \nsaid, \"O Um Sulaim! Allah's Messenger (ﷺ) has arrived along with the people, and we do not have food \nenough to feed them all.\" She said, \"Allah and His Apostle know better.\" So Abu Talha went out till \nhe met Allah's Messenger (ﷺ). Then Abu Talha and Allah's Messenger (ﷺ) came and entered the house. Allah's \nApostle said, \"Um Sulaim ! Bring whatever you have.\" She brought that very bread. The Prophet (ﷺ) \nordered that it be crushed into small pieces, and Um Sulaim pressed a skin of butter on it. Then Allah's \nApostle said whatever Allah wished him to say (to bless the food) and then added, \"Admit ten (men).\" \nSo they were admitted, ate their fill and went out. The Prophet (ﷺ) then said, \"Admit ten (more).\" They \nwere admitted, ate their full, and went out. He then again said, \"Admit ten more!\" They were \nadmitted, ate their fill, and went out. He admitted ten more, and so all those people ate their fill, and \nthey were eighty men.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 145820,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50370,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 294,
        "hadithText": "<p>\nNarrated `Abdur-Rahman bin Abu Bakr:\n\n<p>We were one hundred and thirty men sitting with the Prophet. The Prophet (ﷺ) said, \"Have anyone of you \nany food with him?\" It happened that one man had one Sa of wheat flour (or so) which was turned \ninto dough then. After a while a tall lanky pagan came, driving some sheep. The Prophet (ﷺ) asked, 'Will \nyou sell us (a sheep), or give (it to) us as a gift?\" The pagan said, \"No, but I will sell it \" So the \nProphet bought from him a sheep which was slaughtered, and then the Prophet (ﷺ) ordered that the liver, \nthe kidneys, lungs and heart, etc., of that sheep be roasted. By Allah, none of those one hundred and \nthirty men but had his share of those things. The Prophet (ﷺ) gave to those who were present, and also \nkept a share for those who were absent He then served that cooked sheep in two big trays and we all \nate together our fill; yet there remained a part of it in those two trays which I carried on the camel.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 145830,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50380,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 295,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>The Prophet (ﷺ) died when we had satisfied our hunger with the two black things, i.e. dates and water.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 145840,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50390,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 296,
        "hadithText": "<p>\nNarrated Suwaid bin An-Nu`man:\n\n<p>We went out with Allah's Messenger (ﷺ) to Khaibar, and when we were at As-Sahba', (Yahya, a sub-narrator \nsaid, \"As-Sahba' is a place at a distance of one day's journey to Khaibar).\" Allah's Messenger (ﷺ) asked the \npeople to bring their food, but there was nothing with the people except Sawiq. So we all chewed and \nate of it. Then the Prophet (ﷺ) asked for some water and he rinsed his mouth, and we too, rinsed our \nmouths. Then he led us in the Maghrib prayer without performing ablution (again).</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 145850,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50400,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 297,
        "hadithText": "<p>\nNarrated Qatada:\n\n<p>We were in the company of Anas whose baker was with him. Anas said, The Prophet (ﷺ) did not eat thin \nbread, or a roasted sheep till he met Allah (died).</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 145860,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50410,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 298,
        "hadithText": "<p>\nNarrated Anas:\n\n<p>To the best of my knowledge, the Prophet (ﷺ) did not take his meals in a big tray at all, nor did he ever eat \nwell-baked thin bread, nor did he ever eat at a dining table.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 145870,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50420,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 299,
        "hadithText": "<p>\nNarrated Anas:\n\n<p>The Prophet (ﷺ) halted to consummate his marriage with Safiyya. I invited the Muslims to his wedding \nbanquet. He ordered that leather dining sheets be spread. Then dates, dried yoghurt and butter were \nput on those sheets. Anas added: The Prophet (ﷺ) consummated his marriage with Safiyya (during a \njourney) whereupon Hais (sweet dish) was served on a leather dining sheet.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 145880,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50430,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 300,
        "hadithText": "<p>\nNarrated Wahb bin Kaisan:\n\n<p>The People of Sham taunted `Abdullah bin Az-Zubair by calling him \"The son of Dhatin-Nataqain\" \n(the woman who has two waist-belts). (His mother) (Asma, said to him, \"O my son! They taunt you \nwith \"Nataqain\". Do you know what the Nataqain were? That was my waist-belt which I divided in \ntwo parts. I tied the water skin of Allah's Messenger (ﷺ) with one part, and with the other part I tied his food \ncontainer.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 145890,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50440,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 301,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>that his aunt, Um Hufaid bint Al-Harith bin Hazn, presented to the Prophet (ﷺ) butter, dried yoghurt and \nmastigures. The Prophet (ﷺ) invited the people to those mastigures and they were eaten on his dining \nsheet, but the Prophet (ﷺ) did not eat of it, as if he disliked it. Nevertheless. if it was unlawful to eat that, \nthe people would not have eaten it on the dining sheet of the Prophet (ﷺ) nor would he have ordered that \nthey be eaten.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 145900,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50450,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 302,
        "hadithText": "<p>\nNarrated Suwaid bin An-Nu`man:\n\n<p>that while they were with the Prophet (ﷺ) at As-Sahba' which was at a distance of one day's journey from \nKhaibar the prayer became due, and the Prophet (ﷺ) asked the people for food but there was nothing with \nthe people except Sawiq. He ate of it and we ate along with him, and then he asked for water and \nrinsed his mouth (with it), and then offered the (Maghrib) prayer and we too offered the prayer but the \nProphet did not perform ablution (again after eating the Sawiq.).</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 145910,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50460,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 303,
        "hadithText": "<p>\nNarrated Khalid bin Al-Walid:\n\n<p>That he went with Allah's Messenger (ﷺ) to the house of Maimuna, who was his and Ibn `Abbas' aunt. He \nfound with her a roasted mastigure which her sister Hufaida bint Al-Harith had brought from Najd. \nMaimuna presented the mastigure before Allah's Messenger (ﷺ) who rarely started eating any (unfamiliar) \nfood before it was described and named for him. (But that time) Allah's Messenger (ﷺ) stretched his hand \ntowards the (meat of the) mastigure whereupon a lady from among those who were present, said, \n\"You should inform Allah's Messenger (ﷺ) of what you have presented to him. O Allah's Messenger (ﷺ)! It is the \nmeat of a mastigure.\" (On learning that) Allah's Messenger (ﷺ) withdrew his hand from the meat of the \nmastigure. Khalid bin Al-Walid said, \"O Allah's Messenger (ﷺ)! Is this unlawful to eat?\" Allah's Messenger (ﷺ) \nreplied, \"No, but it is not found in the land of my people, so I do not like it.\" Khalid said, \"Then I \npulled the mastigure (meat) towards me and ate it while Allah's Messenger (ﷺ) was looking at me.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 145920,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50470,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 304,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"The food for two persons is sufficient for three, and the food of three persons is \nsufficient for four persons.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 145930,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50480,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 305,
        "hadithText": "<p>\nNarrated Nafi`:\n\n<p>Ibn `Umar never used to take his meal unless a poor man was called to eat with him. One day I \nbrought a poor man to eat with him, the man ate too much, whereupon Ibn `Umar said, \"O Nafi`! \nDon't let this man enter my house, for I heard the Prophet (ﷺ) saying, \"A believer eats in one intestine (is \nsatisfied with a little food), and a kafir (unbeliever) eats in seven intestines (eats much food).</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 145940,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50490,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 306,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>Allah's Messenger (ﷺ) said, \"A believer eats in one intestine (is satisfied with a little food), and a kafir \n(unbeliever) or a hypocrite eats in seven intestines (eats too much).</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 145951,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50500,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 307,
        "hadithText": "<p>\nNarrated `Amr:\n\n<p>Abu Nahik was avaricious eater. Ibn `Umar said to him, \"Allah's Messenger (ﷺ) said, \"A Kafir (unbeliever) \neats in seven intestines (eats much).\" On that Abu Nahik said, \"But I believe in Allah and His Apostle \n.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 145970,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50510,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 308,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"A Muslim eats in one intestine (i.e. he is satisfied with a little food) while a \nKafir (unbeliever) eats in seven intestines (eats much).</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 145980,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50520,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 309,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>A man used to eat much, but when he embraced Islam, he started eating less. That was mentioned to \nthe Prophet (ﷺ) who then said, \"A believer eats in one intestine (is satisfied with a little food) and a Kafir \neats in seven intestines (eats much). \"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 145990,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50530,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 310,
        "hadithText": "<p>\nNarrated Abu Juhaifa:\n\n<p>Allah's Messenger (ﷺ) said, \"I do not take my meals while leaning (against something).</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 146000,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50540,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 311,
        "hadithText": "<p>\nNarrated Abu Juhaifa:\n\n<p>While I was with the Prophet (ﷺ) he said to a man who was with him, \"I do not take my meals while \nleaning.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 146010,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50550,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 312,
        "hadithText": "<p>\nNarrated Khalid bin Al-Walid:\n\n<p>\"A roasted mastigure was brought to the Prophet (ﷺ) who stretched his hand towards it to eat it. But it was \nsaid to him, \"It is a mastigure.\" So he withdrew his hand. Khalid asked, \"Is it unlawful to eat?\" the \nProphet said, \"No, but it is not found in the land of my people and that is why I do not like eating it.\" \nSo Khalid started eating (it) while Allah's Messenger (ﷺ) was looking at him. An-Nadr said: 'Al-Khazira' (is \nprepared) from bran while 'Al-Harira' is prepared from milk.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 146020,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50560,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 313,
        "hadithText": "<p>\nNarrated 'Urban bin Malik:\n\n<p>who attended the Badr battle and was from the Ansar, that he came to the Prophet (ﷺ) and said, \"O Allah's \nApostle! I have lost my eyesight and I lead my people in the prayer (as an Imam). When it rains, the \nvalley which is between me and my people, flows with water, and then I cannot go to their mosque to \nlead them in the prayer. O Allah's Messenger (ﷺ)! I wish that you could come and pray in my house so that I \nmay take it as a praying place. The Prophet (ﷺ) said, \"Allah willing, I will do that.\" The next morning, \nsoon after the sun had risen, Allah's Messenger (ﷺ) came with Abu Bakr. The Prophet (ﷺ) asked for the \npermission to enter and I admitted him. The Prophet (ﷺ) had not sat till he had entered the house and said \nto me, \"Where do you like me to pray in your house?\" I pointed at a place in my house whereupon he \nstood and said, \"Allahu Akbar.\" We lined behind him and he prayed two rak`at and finished it with \nTaslim. We then requested him to stay for a special meal of Khazira which we had prepared. A large \nnumber of men from the adjoining area gathered in the house. One of them said, \"Where is Malik bin \nAd-Dukhshun?\" Another man said, \"He is a hypocrite and does not love Allah and His Apostle.\" The \nProphet said, \"Do not say so. Do you not think that he has said: \"None has the right to be worshipped \nbut Allah,\" seeking Allah's pleasure? The man said, \"Allah and His Apostle know better, but we have \nalways seen him mixing with hypocrites and giving them advice.\" The Prophet (ﷺ) said, \"Allah has \nforbidden the (Hell) Fire for those who testify that none has the right to be worshipped but Allah, \nseeking Allah's pleasure. \"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 146030,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50570,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 314,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>My aunt presented (roasted) mastigures, Iqt and milk to the Prophet (ﷺ) . The mastigures were put on his \ndining sheet, and if it was unlawful to eat, it would not have been put there. The Prophet (ﷺ) drank the \nmilk and ate the Iqt only.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 146040,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50580,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 315,
        "hadithText": "<p>\nNarrated Sahl bin Sa`d:\n\n<p>We used to be happy on Fridays, for there was an old lady who used to pull out the roots of Silq and \nput it in a cooking pot with some barley. When we had finished the prayer, we would visit her and she \nwould present that dish before us. So we used to be happy on Fridays because of that, and we never \nused to take our meals or have a mid-day nap except after the Friday prayer. By Allah, that meal \ncontained no fat.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 146050,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50600,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 317,
        "hadithText": "<p>\nNarrated Abu Qatada:\n\n<p>We went out towards Mecca with the Prophet.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 146080,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50610,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 318,
        "hadithText": "<p>\nNarrated Abu Qatada:\n\n<p>Once, while I was sitting with the companions of the Prophet (ﷺ) at a station on the road to Mecca and \nAllah's Messenger (ﷺ) was stationing ahead of us and all the people were assuming Ihram while I was not. \nMy companion, saw an onager while I was busy Mending my shoes. They did not Inform me of the \nonager but they wished that I would see it Suddenly I looked and saw the onager Then I headed \ntowards my horse, saddled it and rode, but I forgot to take the lash and the spear. So I said to them my \ncompanions), \"Give me the lash and the spear.\" But they said, \"No, by Allah we will not help you in \nany way to hunt it ' I got angry, dismounted, took it the spear and the lash), rode (the horse chased the \nonager and wounded it Then I brought it when it had dyed. My companions started eating of its \n(cooked) meat, but they suspected that it might be unlawful to eat of its meat while they were in a \nstate of Ihram Then I proceeded further and I kept one of its forelegs with me. When we met Allah's \nApostle we asked him about that. He said, \"Have you some of its meat with you?\" I gave him that \nforeleg and he ate the meat till he stripped the bone of its flesh although he was in a state of Ihram.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 146090,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50620,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 319,
        "hadithText": "<p>\nNarrated `Amr bin Umaiyya:\n\n<p>that he saw the Prophet (ﷺ) holding a shoulder piece of mutton in his hand and cutting part of it with a \nknife. Then he was called for the prayer whereupon he put down the shoulder piece and the knife with \nwhich he was cutting it, and then stood for prayer without performing ablution again.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 146100,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50630,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 320,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) never criticized any food (he was invited to) but he used to eat if he liked the food, and \nleave it if he disliked it.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 146110,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50640,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 321,
        "hadithText": "<p>\nNarrated Abu Hazim:\n\n<p>that he asked Sahl, \"Did you use white flour during the lifetime of the Prophet (ﷺ) ?\" Sahl replied, \"No. \nHazim asked, \"Did you use to sift barley flour?\" He said, \"No, but we used to blow off the husk (of \nthe barley).</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 146120,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50650,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 322,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Once the Prophet (ﷺ) distributed dates among his companions and gave each one seven dates. He gave me \nseven dates too, one of which was dry and hard, but none of the other dates was more liked by me \nthan that one, for it prolonged my chewing it.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 146130,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50660,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 323,
        "hadithText": "<p>\nNarrated Sa`d:\n\n<p>I was one of (the first) seven (who had embraced Islam) with Allah's Messenger (ﷺ) and we had nothing to \neat then, except the leaves of the Habala or Hubula tree, so that our stool used to be similar to that of \nsheep. Now the tribe of Bani Asad wants to teach me Islam; I would be a loser and all my efforts \nwould be in vain (if I learn Islam anew from them).</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 146140,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50670,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 324,
        "hadithText": "<p>\nNarrated Abu Hazim:\n\n<p>I asked Sahl bin Sa`d, \"Did Allah's Messenger (ﷺ) ever eat white flour?\" Sahl said, \"Allah's Messenger (ﷺ) never \nsaw white flour since Allah sent him as an Apostle till He took him unto Him.\" I asked, \"Did the \npeople have (use) sieves during the lifetime of Allah's Messenger (ﷺ)?\" Sahl said, \"Allah's Messenger (ﷺ) never saw \n(used) a sieve since Allah sent him as an Apostle until He took him unto Him,\" I said, \"How could \nyou eat barley unsifted?\" he said, \"We used to grind it and then blow off its husk, and after the husk \nflew away, we used to prepare the dough (bake) and eat it.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 146150,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50680,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 325,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>that he passed by a group of people in front of whom there was a roasted sheep. They invited him but \nhe refused to eat and said, \"Allah's Messenger (ﷺ) left this world without satisfying his hunger even with \nbarley bread.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 146160,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50690,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 326,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>The Prophet (ﷺ) never took his meals at a dining table, nor in small plates, and he never ate thin wellbaked \nbread. (The sub-narrator asked Qatada, \"Over what did they use to take their meals?\" Qatada \nsaid, \"On leather dining sheets.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 146170,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50700,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 327,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>The family of Muhammad had not eaten wheat bread to their satisfaction for three consecutive days \nsince his arrival at Medina till he died.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 146180,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50710,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 328,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>(the wife of the Prophet) that whenever one of her relatives died, the women assembled and then \ndispersed (returned to their houses) except her relatives and close friends. She would order that a pot \nof Talbina be cooked. Then Tharid (a dish prepared from meat and bread) would be prepared and the \nTalbina would be poured on it. `Aisha would say (to the women),\"Eat of it, for I heard Allah's Messenger (ﷺ) \nsaying, 'The Talbina soothes the heart of the patient and relieves him from some of his sadness.' \"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 146190,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50720,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 329,
        "hadithText": "<p>\nNarrated Abu Musa Al-Ash`ari:\n\n<p>The Prophet (ﷺ) said, \"Many men reached perfection but none among the women reached perfection \nexcept Mary, the daughter of ' `Imran, and Asia, Pharoah's wife. And the superiority of `Aisha to other \nwomen is like the superiority of Tharid to other kinds of food.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 146200,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50730,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 330,
        "hadithText": "<p>\nNarrated Anas:\n\n<p>The Prophet (ﷺ) said, \"The superiority of `Aisha to other women is like the superiority of Tharid to other \nkinds of food . \"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 146210,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50740,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 331,
        "hadithText": "<p>\nNarrated Anas:\n\n<p>I went along with the Prophet (ﷺ) to the house of a young tailor of his. The tailor presented a dish of \nTharid to the Prophet (ﷺ) and resumed his work. The Prophet (ﷺ) started picking the pieces of gourd and I too, \nstarted picking them and putting it before him. Since then I have always loved (to eat) gourd.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 146220,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50750,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 332,
        "hadithText": "<p>\nNarrated Qatada:\n\n<p>We used to visit Anas bin Malik while his baker was standing (and baking). Anas would say, \"Eat! I \ndo not know that the Prophet (ﷺ) had ever seen well-baked bread till he met Allah, nor had he ever seen a \nroasted sheep with his own eyes.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 146230,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50760,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 333,
        "hadithText": "<p>\nNarrated `Amr bin Umaiyay Ad-Damri:\n\n<p>I saw Allah's Messenger (ﷺ) cutting part of the shoulder of mutton with a knife. He ate of it and then was \ncalled for prayer whereupon he got up and put down the knife and offered the prayer without \nperforming new ablution.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 146240,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50770,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 334,
        "hadithText": "<p>\nNarrated `Abis:\n\n<p>I asked `Aisha \"Did the Prophet (ﷺ) forbid eating the meat of sacrifices offered on `Id-ul-Adha for more \nthan three days\" She said, \"The Prophet (ﷺ) did not do this except in the year when the people were \nhungry, so he wanted the rich to feed the poor. But later we used to store even a trotter of a sheep to \neat it fifteen days later.\" She was asked, \"What compelled you to do so?\" She smiled and said, \"The \nfamily of Muhammad did not eat to their satisfaction white bread with meat soup for three successive \ndays till he met Allah.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 146250,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50780,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 335,
        "hadithText": "<p>\nNarrated Jabir:\n\n<p>We used to carry the meat of the Hadis (sacrificed animals) to Medina during the life-time of the \nProphet .</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 146260,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50790,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 336,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>Allah's Messenger (ﷺ) said to Abu Talha, \"Seek one of your boys to serve me.\" Abu Talha mounted me \nbehind him (on his riding animal) and took me (to the Prophet (ﷺ) ). So I used to serve Allah's Messenger (ﷺ) \nwhenever he dismounted (to stay somewhere). I used to hear him saying very often, \"O Allah! I seek \nrefuge with You from, having worries sadness, helplessness, laziness, miserliness, cowardice, from \nbeing heavily in debt and from being overpowered by other persons unjustly.\" I kept on serving till we \n-returned from the battle of Khaibar. The Prophet (ﷺ) then brought Safiyya bint Huyai whom he had won \nfrom the war booty. I saw him folding up a gown or a garment for her to sit on behind him (on his shecamel). \nWhen he reached As-Sahba', he prepared Hais and placed it on a dining sheet. Then he sent \nme to invite men, who (came and) ate; and that was his and Safiyya's wedding banquet. Then the \nProphet proceeded, and when he saw (noticed) the mountain of Uhud, he said, \"This mountain loves \nus, and we love it.\" When we approached Medina, he said, \"O Allah! I make the area between its two \nmountains a sanctuary as Abraham has made Mecca a sanctuary. O Allah! Bless their Mudd and Sa \n(special kinds of measure).</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 146270,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50800,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 337,
        "hadithText": "<p>\nNarrated `Abdur-Rahman bin Abi Laila:\n\n<p>We were sitting in the company of Hudhaifa who asked for water and a Magian brought him water. \nBut when he placed the cup in his hand, he threw it at him and said, \"Had I not forbidden him to do so \nmore than once or twice?\" He wanted to say, \"I would not have done so,\" adding, \"but I heard the \nProphet saying, \"Do not wear silk or Dibaja, and do not drink in silver or golden vessels, and do not \neat in plates of such metals, for such things are for the unbelievers in this worldly life and for us in the \nHereafter.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 146280,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50810,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 338,
        "hadithText": "<p>\nNarrated Abu Musa Al-Ash`ari:\n\n<p>Allah's Messenger (ﷺ) said, \"The example of a Believer who recites the Qur'an, is that of a citron which \nsmells good and tastes good; And the example of a Believer who does not recite the Qur'an, is that of \na date which has no smell but tastes sweet; and the example of a hypocrite who recites the Qur'an, is \nthat of an aromatic plant which smells good but tastes bitter; and the example of a hypocrite who does \nnot recite the Qur'an, is that of a colocynth plant which has no smell and is bitter in taste.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 146290,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50820,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 339,
        "hadithText": "<p>\nNarrated Anas:\n\n<p>The Prophet (ﷺ) said, \"The superiority of `Aisha to other ladies is like the superiority of Tharid to other \nkinds of food.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 146300,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50830,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 340,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"Traveling is a kind of torture, as it prevents one from sleeping and eating! So when \none has finished his job, he should return quickly to his family.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 146310,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50840,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 341,
        "hadithText": "<p>\nNarrated Qasim bin Muhammad:\n\n<p>Three traditions have been established because of Barira: `Aisha intended to buy her and set her free, \nbut Barira's masters said, \"Her wala' will be for us.\" `Aisha mentioned that to Allah's Messenger (ﷺ) who \nsaid, \"You could accept their condition if you wished, for the wala is for the one who manumits the \nslave.\" Barira was manumitted, then she was given the choice either to stay with her husband or leave \nhim; One day Allah's Messenger (ﷺ) entered `Aisha's house while there was a cooking pot of food boiling on \nthe fire. The Prophet (ﷺ) asked for lunch, and he was presented with bread and some extra food from the \nhome-made Udm (e.g. soup). He asked, \"Don't I see meat (being cooked)?\" They said, \"Yes, O Allah's \nApostle! But it is the meat that has been given to Barira in charity and she has given it to us as a \npresent.\" He said, \"For Barira it is alms, but for us it is a present.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 146320,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50850,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 342,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>Allah's Messenger (ﷺ) used to love sweet edible things and honey.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 146330,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50860,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 343,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>I used to accompany Allah's Messenger (ﷺ) to fill my stomach; and that was when I did not eat baked bread, \nnor wear silk. Neither a male nor a female slave used to serve me, and I used to bind stones over my \nbelly and ask somebody to recite a Qur'anic Verse for me though I knew it, so that he might take me \nto his house and feed me. Ja`far bin Abi Talib was very kind to the poor, and he used to take us and \nfeed us with what ever was available in his house, (and if nothing was available), he used to give us \nthe empty (honey or butter) skin which we would tear and lick whatever was in it.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 146340,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50870,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 344,
        "hadithText": "<p>\nNarrated Anas:\n\n<p>Allah's Messenger (ﷺ) went to (the house of) his slave tailor, and he was offered (a dish of) gourd of which \nhe started eating. I have loved to eat gourd since I saw Allah's Messenger (ﷺ) eating it.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 146350,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50880,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 345,
        "hadithText": "<p>\nNarrated Abu Mas`ud Al-Ansari:\n\n<p>There was a man called Abu Shu'aib, and he had a slave who was a butcher. He said (to his slave), \n\"Prepare a meal to which I may invite Allah's Messenger (ﷺ) along with four other men.\" So he invited \nAllah's Messenger (ﷺ) and four other men, but another man followed them whereupon the Prophet (ﷺ) said, \n\"You have invited me as one of five guests, but now another man has followed us. If you wish you \ncan admit him, and if you wish you can refuse him.\" On that the host said, \"But I admit him.\" \nNarrated Muhammad bin Isma`il: If guests are sitting at a dining table, they do not have the right to \ncarry food from other tables to theirs, but they can pass on food from their own table to each other; \notherwise they should leave it.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 146360,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50890,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 346,
        "hadithText": "<p>\nNarrated Anas:\n\n<p>I was a young boy when I once was walking with Allah's Messenger (ﷺ) . Allah's Messenger (ﷺ) entered the house \nof his slave tailor and the latter brought a dish filled with food covered with pieces of gourd. Allah's \nApostle started picking and eating the gourd. When I saw that, I started collecting and placing the \ngourd before him. Then the slave returned to his work. Anas added: I have kept on loving gourd since \nI saw Allah's Messenger (ﷺ) doing what he was doing.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 146370,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50900,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 347,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>A tailor invited the Prophet (ﷺ) to a meal which he had prepared, and I went along with the Prophet (ﷺ) . The \ntailor presented barley bread and soup containing gourd and cured meat. I saw the Prophet (ﷺ) picking the \npieces of gourd from around the dish, and since then I have kept on liking gourd.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 146380,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50910,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 348,
        "hadithText": "<p>\nNarrated Anas:\n\n<p>I saw the Prophet (ﷺ) being served with soup and containing gourd and cured meat, and I saw him picking \nand eating the pieces of gourd.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 146390,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50920,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 349,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>The Prophet (ﷺ) did not do that (i.e., forbade the storage of the meat of sacrifices for three days) except \n(he did so) so that the rich would feed the poor. But later we used to keep even trotters to cook, fifteen \ndays later. The family of Muhammad did not eat wheat bread with meat or soup to their satisfaction \nfor three successive days.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 146400,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50930,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 350,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>A tailor invited Allah's Messenger (ﷺ) to a meal which he had prepared. I went with Allah's Messenger (ﷺ) to that \nmeal, and the tailor served the Prophet (ﷺ) with barley bread and soup of gourd and cured meat. I saw \nAllah's Messenger (ﷺ) picking the pieces of gourd from around the dish, and since then I have kept on liking \ngourd.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 146410,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50940,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 351,
        "hadithText": "<p>\nNarrated `Abdullah bin Ja`far bin Abi Talib:\n\n<p>I saw Allah's Messenger (ﷺ) eating fresh dates with snake cucumber.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 146420,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50950,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 352,
        "hadithText": "<p>\nNarrated Abu `Uthman:\n\n<p>I was a guest of Abu Huraira for seven days. Abu Huraira, his wife and his slave used to get up and \nremain awake for one-third of the night by turns. Each would offer the night prayer and then awaken \nthe other. I heard Abu Huraira saying, \"Allah's Messenger (ﷺ) distributed dates among his companions and \nmy share was seven dates, one of which was a Hashafa (a date which dried on the tree before it was \nfully ripe).</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 146430,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50960,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 353,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) distributed dates among us, and my share was five dates, four of which were good, and \none was a ,Hashafa, and I found the Hashafa the hardest for my teeth.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 146440,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50970,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 354,
        "hadithText": "<p>\nNarrated Jabir bin `Abdullah:\n\n<p>There was a Jew in Medina who used to lend me money up to the season of plucking dates. (Jabir had \na piece of land which was on the way to Ruma). That year the land was not promising, so the payment \nof the debt was delayed one year. The Jew came to me at the time of plucking, but gathered nothing \nfrom my land. I asked him to give me one year respite, but he refused. This news reached the Prophet (ﷺ) \nwhereupon he said to his companions, \"Let us go and ask the Jew for respite for Jabir.\" All of them \ncame to me in my garden, and the Prophet (ﷺ) started speaking to the Jew, but he Jew said, \"O Abu \nQasim! I will not grant him respite.\" When the Prophet (ﷺ) saw the Jew's attitude, he stood up and walked \nall around the garden and came again and talked to the Jew, but the Jew refused his request. I got up \nand brought some ripe fresh dates and put it in front of the Prophet. He ate and then said to me, \n\"Where is your hut, O Jabir?\" I informed him, and he said, \"Spread out a bed for me in it.\" I spread \nout a bed, and he entered and slept. When he woke up, I brought some dates to him again and he ate of \nit and then got up and talked to the Jew again, but the Jew again refused his request. Then the Prophet (ﷺ) \ngot up for the second time amidst the palm trees loaded with fresh dates, and said, \"O Jabir! Pluck \ndates to repay your debt.\" The Jew remained with me while I was plucking the dates, till I paid him all \nhis right, yet there remained extra quantity of dates. So I went out and proceeded till I reached the \nProphet and informed him of the good news, whereupon he said, \"I testify that I am Allah's Messenger (ﷺ).\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 146460,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50980,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 355,
        "hadithText": "<p>\nNarrated `Abdullah bin `Umar:\n\n<p>While we were sitting with the Prophet, fresh dates were brought to him. The Prophet (ﷺ) said, \"There is a \ntree among the trees which is as blessed as a Muslim\" I thought that it was the date palm tree and \nintended to say, \"It is the date-palm tree, O Allah's Messenger (ﷺ)!\" but I looked behind to see that I was the \ntenth and youngest of ten men present there, so I kept quiet' Then the Prophet (ﷺ) said, \"It is the datepalm \ntree.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 146470,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50990,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 356,
        "hadithText": "<p>\nNarrated Sa`d:\n\n<p>Allah's Messenger (ﷺ) said, \"He who eats seven 'Ajwa dates every morning, will not be affected by poison or \nmagic on the day he eats them.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 146480,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 51000,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 357,
        "hadithText": "<p>\nNarrated Jabala bin Suhaim.:\n\n<p>At the time of Ibn Az-Zubair, we were struck with famine, and he provided us with dates for our food. \n`Abdullah bin `Umar used to pass by us while we were eating, and say, \"Do not eat two dates together \nat a time, for the Prophet (ﷺ) forbade the taking of two dates together at a time (in a gathering).\" Ibn \n`Umar used to add, \"Unless one takes the permission of one's companions.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 146490,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 51010,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 358,
        "hadithText": "<p>\nNarrated `Abdullah bin Ja`far:\n\n<p>I saw the Prophet (ﷺ) eating fresh dates with snake cucumbers.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 146500,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 51020,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 359,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>The Prophet (ﷺ) said, \"There is a tree among the trees which is similar to a Muslim (in goodness), and that \nis the date palm tree.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 146510,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 51030,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 360,
        "hadithText": "<p>\nNarrated `Abdullah bin Ja`far:\n\n<p>I saw Allah's Messenger (ﷺ) eating fresh dates with snake cucumbers.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 146520,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 51040,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 361,
        "hadithText": "<p>\nNarrated Anas:\n\n<p>My mother, Um Sulaim, took a Mudd of barley grain, ground it and made porridge from it, and \npressed (over it), a butter skin she had with her. Then she sent me to the Prophet, and I reached him \nwhile he was sitting with his companions. I invited him, whereupon he said, \"And those who are with \nme?' I returned and said, \"He says, 'And those who are with me?\" Abu Talha went out to him and said, \n\"O Allah's Messenger (ﷺ)! It is just a meal prepared by Um Sulaim.\" The Prophet (ﷺ) entered and the food was \nbrought to him. He said, \"Let ten persons enter upon me.\" Those ten entered and ate their fill. Again \nhe said, 'Let ten (more) enter upon me.\" Those ten entered and ate their fill. Then he said, \"Let ten \n(more) enter upon me.\" He called forty persons in all Then Allah's Messenger (ﷺ) ate and got up. I started \nlooking (at the food) to see if it decreased or not.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 146530,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 51050,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 362,
        "hadithText": "<p>\nNarrated `Abdul `Aziz:\n\n<p>It was said to Anas \"What did you hear the Prophet (ﷺ) saying about garlic?\" Anas replied, \"Whoever has \neaten (garlic) should not approach our mosque.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 146540,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 51060,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 363,
        "hadithText": "<p>\nNarrated Jabir bin `Abdullah:\n\n<p>The Prophet (ﷺ) said, \"Whoever has eaten garlic or onion should keep away from us (or should keep away \nfrom our mosque).'</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 146550,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 51070,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 364,
        "hadithText": "<p>\nNarrated Jabir bin `Abdullah:\n\n<p>We were with Allah's Messenger (ﷺ) collecting Al-Kabath at Mar-Az-Zahran. The Prophet (ﷺ) said, \"Collect the \nblack ones, for they are better.\" Somebody said, (O Allah's Messenger (ﷺ)!) Have you ever shepherded \nsheep?\" He said, \"There has been no prophet but has shepherded them. \"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 146560,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 51080,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 365,
        "hadithText": "<p>\nNarrated Suwaid: We went out with \nAllah's Messenger (ﷺ) to Khaibar. and when we reached As-Sahba', which (Yahya says) is one day' journey \nfrom Khaibar, the Prophet (ﷺ) asked for food, and he was offered nothing but Sawiq which we chewed \nand ate. Then the Prophet (ﷺ) asked for water and rinsed his mouth, and we too, rinsed our mouths along \nwith him. He then led us in the Maghrib prayer without performing ablution again.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 146580,
        "last_updated": "2012-10-16 16:08:25"
    },
    {
        "englishURN": 51075,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 365,
        "hadithText": "Narrated Suwaid bin An Nu`man:\n\n<p>We went out with Allah's Messenger (ﷺ) to Khaibar, and when we reached As-Sahba', the Prophet (ﷺ) asked for \nfood, and he was offered nothing but Sawiq. We ate, and then Allah's Messenger (ﷺ) stood up for the prayer. \nHe rinsed his mouth with water, and we too, rinsed our mouths.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 146570,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 51090,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 366,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>The Prophet (ﷺ) said, 'When you eat, do not wipe your hands till you have licked it, or had it licked by \nsomebody else.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 146590,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 51100,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 367,
        "hadithText": "<p>\nNarrated Sa`id bin Al-Harith:\n\n<p>that he asked Jabir bin `Abdullah about performing ablution after taking a cooked meal. He replied, \"It \nis not essential,\" and added, \"We never used to get such kind of food during the lifetime of the \nProphet except rarely; and if at all we got such a dish, we did not have any handkerchiefs to wipe our \nhands with except the palms of our hands, our forearms and our feet. We would perform the prayer \nthereafter with-out performing new ablution.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 146600,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 51110,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 368,
        "hadithText": "<p>\nNarrated Abu Umama:\n\n<p>Whenever the dining sheet of the Prophet (ﷺ) was taken away (i.e., whenever he finished his meal), he \nused to say: \"Al-hamdu li l-lah kathiran taiyiban mubarakan fihi ghaira makfiy wala muWada` wala \nmustaghna'anhu Rabbuna.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 146610,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 51120,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 369,
        "hadithText": "<p>\nNarrated Abu Umama:\n\n<p>Whenever the Prophet (ﷺ) finished his meals (or when his dining sheet was taken away), he used to say. \n\"Praise be to Allah Who has satisfied our needs and quenched our thirst. Your favor cannot by \ncompensated or denied.\" Once he said, upraise be to You, O our Lord! Your favor cannot be \ncompensated, nor can be left, nor can be dispensed with, O our Lord!\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 146620,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 51130,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 370,
        "hadithText": "<p>\nNarrated .Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"When your servant brings your food to you, if you do not ask him to join you, then \nat least ask him to take one or two handfuls, for he has suffered from its heat (while cooking it) and \nhas taken pains to cook it nicely.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 146630,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 51140,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 371,
        "hadithText": "<p>\nNarrated Abu Mas`ud Al-Ansari:\n\n<p>There was an Ansari man nicknamed, Abu Shu'aib, who had a slave who was a butcher. He came to \nthe Prophet (ﷺ) while he was sitting with his companions and noticed the signs of hunger on the face of \nthe Prophet (ﷺ) . So he went to his butcher slave and said, \"Prepare for me a meal sufficient for five \npersons so that I may invite the Prophet (ﷺ) along with four other men.\" He had the meal prepared for him \nand invited him. A (sixth) man followed them. The Prophet (ﷺ) said, \"O Abu Shu'aib! Another man has \nfollowed us. If you wish, you may invite him; and if you wish, you may refuse him.\" Abu Shu'aib \nsaid, \"No, I will admit him.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 146640,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 51150,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 372,
        "hadithText": "<p>\nNarrated `Amr bin Umaiyya:\n\n<p>That he saw Allah's Messenger (ﷺ) cutting a piece of mutton from its shoulder part he was carrying in his \nhand. When he was called for prayer, he put it down and the knife with which he was cutting it. Then \nhe stood up and offered the prayer without performing new ablution.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 146650,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 51160,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 373,
        "hadithText": "<p>\n\n     Narrated Anas bin Malik:\n<p>\n\n     The Prophet (ﷺ) said, If supper is served and the Iqama for (Isha) prayer \n     is proclaimed, start with you supper first.\"\n<p></b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 146660,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 51170,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 373,
        "hadithText": "<p>\n\n     Narrated Nafi:\n<p>\n\n     Once Ibn Umar was taking his supper while he was listening to the \n     recitation of (Quran by) the Imam (in the Isha prayer).\n<p></b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 146670,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 51180,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 374,
        "hadithText": "<p>\nNarrated Aisha:\n\n<p>The Prophet (ﷺ) said, \"If the Iqama for (`Isha') prayer is proclaimed and supper is served, take your supper \nfirst.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 146680,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 51190,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 375,
        "hadithText": "<p>\nNarrated Anas:\n\n<p>I know (about) the Hijab (the order of veiling of women) more than anybody else. Ubai bin Ka`b used \nto ask me about it. Allah's Messenger (ﷺ) became the bridegroom of Zainab bint Jahsh whom he married at \nMedina. After the sun had risen high in the sky, the Prophet (ﷺ) invited the people to a meal. Allah's \nApostle remained sitting and some people remained sitting with him after the other guests had left. \nThen Allah's Messenger (ﷺ) got up and went away, and I too, followed him till he reached the door of \n`Aisha's room. Then he thought that the people must have left the place by then, so he returned and I \nalso returned with him. Behold, the people were still sitting at their places. So he went back again for \nthe second time, and I went along with him too. When we reached the door of `Aisha's room, he \nreturned and I also returned with him to see that the people had left. Thereupon the Prophet (ﷺ) hung a \ncurtain between me and him and the Verse regarding the order for (veiling of women) Hijab was \nrevealed.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 146690,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50591,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 316,
        "hadithText": "<p>\n\n     Narrated Ibn 'Abbas:\n<p>\n\n     The Prophet (ﷺ) ate of the meat of a shoulder (by cutting the meat with \n     his teeth), and then got up and offered the prayer without performing \n     the ablution anew.</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 146060,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50592,
        "collection": "bukhari",
        "volumeNumber": 7,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 316,
        "hadithText": "Narrated Ibn 'Abbas:  The Prophet (ﷺ) took out a bone \n     with meat on it from a cooking pot and ate of it, and then offered the\n     prayer without performing ablution anew.\n<p></b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 146070,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 50965,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 65,
        "bookName": "Food, Meals",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 353,
        "hadithText": "Aishah (ra) said, \"When Allah's Messenger (ﷺ) died, we had been satisfied by the two black things, i.e., dates and water.\"</b>",
        "bookID": "65.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 146450,
        "last_updated": "2012-04-26 07:00:00"
    }
]