[
    {
        "englishURN": 62270,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 618,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>Abu Bakr As-Siddiq had never broken his oaths till Allah revealed the expiation for the oaths. Then he \nsaid, \"If I take an oath to do something and later on I find something else better than the first one, then \nI do what is better and make expiation for my oath.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 157350,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62280,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 619,
        "hadithText": "<p>\nNarrated `Abdur-Rahman bin Samura:\n\n<p>The Prophet (ﷺ) said, \"O `Abdur-Rahman bin Samura! Do not seek to be a ruler, because if you are given \nauthority for it, then you will be held responsible for it, but if you are given it without asking for it, \nthen you will be helped in it (by Allah): and whenever you take an oath to do something and later you \nfind that something else is better than the first, then do the better one and make expiation for your \noath.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 157360,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62290,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 620,
        "hadithText": "<p>\nNarrated Abu Musa:\n\n<p>I went to the Prophet (ﷺ) along with a group of Al-Ash`ariyin in order to request him to provide us with \nmounts. He said, \"By Allah, I will not provide you with mounts and I haven't got anything to mount \nyou on.\" Then we stayed there as long as Allah wished us to stay, and then three very nice looking \nshe-camels were brought to him and he made us ride them. When we left, we, or some of us, said, \"By \nAllah, we will not be blessed, as we came to the Prophet (ﷺ) asking him for mounts, and he swore that he \nwould not give us any mounts but then he did give us. So let us go back to the Prophet (ﷺ) and remind \nhim (of his oath).\" When we returned to him (and reminded him of the fact), he said, \"I did not give \nyou mounts, but it is Allah Who gave you. By Allah, Allah willing, if I ever take an oath to do \nsomething and then I find something else than the first, I will make expiation for my oath and do the \nthing which is better (or do something which is better and give the expiation for my oath).</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 157370,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62310,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 622,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"Anyone who takes an oath through which his family may be harmed, and insists \non keeping it, he surely commits a sin greater (than that of dissolving his oath). He should rather \ncompensate for that oath by making expiation.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 157400,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62320,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 623,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>Allah's Messenger (ﷺ) sent an army detachment and made Usama bin Zaid its commander. Some people \ncriticized (spoke badly of) Usama's leadership. So Allah's Messenger (ﷺ) got up saying, \"If you people are \ncriticizing Usama's leadership, you have already criticized the leadership of his father before. But Waaimullah \n(i.e., By Allah), he (i.e. Zaid) deserved the leadership, and he was one of the most beloved \npersons to me; and now this (his son Usama) is one of the dearest persons to me after him.\" (See \nHadith No. 765, Vol. 5)</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 157410,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62330,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 624,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>The oath of the Prophet (ﷺ) used to be: \"No, by Him who turns the hearts.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 157420,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62340,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 625,
        "hadithText": "<p>\nNarrated Jabir bin Samura:\n\n<p>The Prophet (ﷺ) said, \"If Caesar is ruined, there will be no Caesar after him; and if Khosrau is ruined, \nthere will be no Khosrau, after him; and, by Him in Whose Hand my soul is, surely you will spend \ntheir treasures in Allah's Cause.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 157430,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62350,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 626,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"If Khosrau is ruined, there will be no Khosrau after him; and if Caesar is ruined, \nthere will be no Caesar after him. By Him in Whose Hand Muhammad's soul is, surely you will spend \ntheir treasures in Allah's Cause.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 157440,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62360,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 627,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>The Prophet (ﷺ) said, \"O followers of Muhammad! By Allah, if you knew what I know, you would weep \nmuch and laugh little.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 157450,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62370,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 628,
        "hadithText": "<p>\nNarrated `Abdullah bin Hisham:\n\n<p>We were with the Prophet (ﷺ) and he was holding the hand of `Umar bin Al-Khattab. `Umar said to Him, \n\"O Allah's Messenger (ﷺ)! You are dearer to me than everything except my own self.\" The Prophet (ﷺ) said, \n\"No, by Him in Whose Hand my soul is, (you will not have complete faith) till I am dearer to you than \nyour own self.\" Then `Umar said to him, \"However, now, by Allah, you are dearer to me than my own \nself.\" The Prophet (ﷺ) said, \"Now, O `Umar, (now you are a believer).</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 157460,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62380,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 629,
        "hadithText": "<p>\nNarrated Abu Huraira and Zaid bin Khalid:\n\n<p>Two men had a dispute in the presence of Allah's Messenger (ﷺ). One of them said, \"O Allah's Messenger (ﷺ)! \nJudge between us according to Allah's Laws.\" The other who was wiser, said, \"Yes, O Allah's \nApostle! Judge between us according to Allah's Laws and allow me to speak. The Prophet (ﷺ) said, \n\"Speak.\" He said, \"My son was a laborer serving this (person) and he committed illegal sexual \nintercourse with his wife, The people said that my son is to be stoned to death, but I ransomed him \nwith one-hundred sheep and a slave girl. Then I asked the learned people, who informed me that my \nson should receive one hundred lashes and will be exiled for one year, and stoning will be the lot for \nthe man's wife.\" Allah's Messenger (ﷺ) said, \"Indeed, by Him in Whose Hand my soul is, I will judge \nbetween you according to Allah's Laws: As for your sheep and slave girl, they are to be returned to \nyou.\" Then he scourged his son one hundred lashes and exiled him for one year. Then Unais Al- \nAslami was ordered to go to the wife of the second man, and if she confessed (the crime), then stone \nher to death. She did confess, so he stoned her to death.</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 157470,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62390,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 630,
        "hadithText": "<p>\nNarrated Abu Bakra:\n\n<p>The Prophet (ﷺ) said, \"Do you think if the tribes of Aslam, Ghifar, Muzaina and Juhaina are better than \nthe tribes of Tamim, 'Amir bin Sa'sa'a, Ghatfan and Asad, they (the second group) are despairing and \nlosing?\" They (the Prophet's companions) said, \"Yes, (they are).\" He said, \"By Him in Whose Hand \nmy soul is, they (the first group) are better than them (the second group).</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 157480,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62400,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 631,
        "hadithText": "<p>\nNarrated Abu Humaid As-Sa`idi:\n\n<p>Allah's Messenger (ﷺ) employed an employee (to collect Zakat). The employee returned after completing his \njob and said, \"O Allah's Messenger (ﷺ)! This (amount of Zakat) is for you, and this (other amount) was given \nto me as a present.\" The Prophet (ﷺ) said to him, \"Why didn't you stay at your father's or mother's house \nand see if you would be given presents or not?\" Then Allah's Messenger (ﷺ) got up in the evening after the \nprayer, and having testified that none has the right to be worshipped but Allah and praised and \nglorified Allah as He deserved, he said, \"Now then ! What about an employee whom we employ and \nthen he comes and says, 'This amount (of Zakat) is for you, and this (amount) was given to me as a \npresent'? Why didn't he stay at the house of his father and mother to see if he would be given presents \nor not? By Him in Whose Hand Muhammad's soul is, none of you will steal anything of it (i.e. Zakat) \nbut will bring it by carrying it over his neck on the Day of Resurrection. If it has been a camel, he will \nbring it (over his neck) while it will be grunting, and if it has been a cow, he will bring it (over his \nneck), while it will be mooing; and if it has been a sheep, he will bring it (over his neck) while it will \nbe bleeding.\" The Prophet (ﷺ) added, \"I have preached you (Allah's Message).\" Abu Humaid said, \"Then \nAllah's Messenger (ﷺ) raised his hands so high that we saw the whiteness of his armpits.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 157490,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62410,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 632,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Abu-l-Qasim (the Prophet) said, \"By Him in Whose Hand Muhammad's soul is, if you know that \nwhich I know, you would weep much and laugh little.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 157500,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62420,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 633,
        "hadithText": "<p>\nNarrated Abu Dhar:\n\n<p>I reached him (the Prophet (ﷺ) ) while in the shade of the Ka`ba; he was saying, \"They are the losers, by \nthe Lord of the Ka`ba! They are the losers, by the Lord of the Ka`ba!\" I said (to myself ), \"What is \nwrong with me? Is anything improper detected in me? What is wrong with me? Then I sat beside him \nand he kept on saying his statement. I could not remain quiet, and Allah knows in what sorrowful state \nI was at that time. So I said, ' Who are they (the losers)? Let My father and mother be sacrificed for \nyou, O Allah's Messenger (ﷺ)!\" He said, \"They are the wealthy people, except the one who does like this and \nlike this and like this (i.e., spends of his wealth in Allah's Cause).</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 157510,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62430,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 634,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"(The Prophet) Solomon once said, 'Tonight I will sleep with ninety women, \neach of whom will bring forth a (would-be) cavalier who will fight in Allah's Cause.\" On this, his \ncompanion said to him, \"Say: Allah willing!\" But he did not say Allah willing. Solomon then slept \nwith all the women, but none of them became pregnant but one woman who later delivered a halfman. \nBy Him in Whose Hand Muhammad's soul is, if he (Solomon) had said, 'Allah willing' (all his \nwives would have brought forth boys) and they would have fought in Allah's Cause as cavaliers. \"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 157520,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62440,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 635,
        "hadithText": "<p>\nNarrated Al-Bara 'bin `Azib:\n\n<p>A piece of silken cloth was given to the Prophet (ﷺ) as a present and the people handed it over amongst \nthemselves and were astonished at its beauty and softness. Allah's Messenger (ﷺ) said, \"Are you astonished \nat it?\" They said, \"Yes, O Allah's Messenger (ﷺ)!\" He said, \"By Him in Whose Hand my soul is, the \nhandkerchiefs of Sa`d in Paradise are better than it.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 157530,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62450,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 636,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>Hind bint `Utba bin Rabi`a said, \"O Allah 's Apostle! (Before I embraced Islam), there was no family \non the surface of the earth, I wish to have degraded more than I did your family. But today there is no \nfamily whom I wish to have honored more than I did yours.\" Allah's Messenger (ﷺ) said, \"I thought \nsimilarly, by Him in Whose Hand Muhammad's soul is!\" Hind said, \"O Allah's Messenger (ﷺ)! (My \nhusband) Abu Sufyan is a miser. Is it sinful of me to feed my children from his property?\" The \nProphet said, \"No, unless you take it for your needs what is just and reasonable.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 157540,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62460,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 637,
        "hadithText": "<p>\nNarrated `Abdullah bin Masud:\n\n<p>While Allah's Messenger (ﷺ) was sitting, reclining his back against a Yemenite leather tent he said to his \ncompanions, \"Will you be pleased to be one-fourth of the people of Paradise?\" They said, 'Yes.' He \nsaid \"Won't you be pleased to be one-third of the people of Paradise\" They said, \"Yes.\" He said, \"By \nHim in Whose Hand Muhammad's soul is, I hope that you will be one-half of the people of Paradise.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 157550,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62470,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 638,
        "hadithText": "<p>\nNarrated Abu Sa`id Al-Khudri:\n\n<p>A man heard another man reciting: Surat-ul-Ikhlas (The Unity) 'Say: He is Allah, the One (112) and \nhe was repeating it. The next morning he came to Allah's Messenger (ﷺ) and mentioned the whole story to \nhim as if he regarded the recitation of that Sura as insufficient On that, Allah's Messenger (ﷺ) said, \"By Him \nin Whose Hand my soul is! That (Sura No. 112) equals one-third of the Qur'an.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 157560,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62480,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 639,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>I heard the Prophet (ﷺ) saying, \"Perform the bowing and the prostration properly (with peace of mind), \nfor, by Him in Whose Hand my soul is, I see you from behind my back when you bow and when you \nprostrate.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 157570,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62490,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 640,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>An Ansari woman came to the Prophet (ﷺ) in the company of her children, and the Prophet (ﷺ) said to her, \n\"By Him in Whose Hand my soul is, you are the most beloved people to me!\" And he repeated the \nstatement thrice.</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 157580,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62500,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 641,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>Allah's Messenger (ﷺ) met `Umar bin Al-Khattab while the latter was going with a group of camel-riders, \nand he was swearing by his father. The Prophet (ﷺ) said, \"Lo! Allah forbids you to swear by your fathers, \nso whoever has to take an oath, he should swear by Allah or keep quiet.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 157590,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62510,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 642,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>I heard `Umar saying, \"Allah's Messenger (ﷺ) said to me, 'Allah forbids you to swear by your fathers.\" \n`Umar said, \"By Allah! Since I heard that from the Prophet (ﷺ) , I have not taken such an oath, neither \nintentionally, nor by reporting the oath of someone else.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 157600,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62520,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 643,
        "hadithText": "<p>\nNarrated `Abdullah bin `Umar:\n\n<p>Allah's Messenger (ﷺ) said, \"Do not swear by your fathers.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 157610,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62530,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 644,
        "hadithText": "<p>\nNarrated Zahdam:\n\n<p>There was a relation of love and brotherhood between this tribe of Jarm and Al-Ash`ariyin. Once we \nwere with Abu Musa Al-Ash`ari, and then a meal containing chicken was brought to Abu Musa, and \nthere was present, a man from the tribe of Taimillah who was of red complexion as if he were from \nnon-Arab freed slaves. Abu Musa invited him to the meal. He said, \"I have seen chickens eating dirty \nthings, so I deemed it filthy and took an oath that I would never eat chicken.\" On that, Abu Musa said, \n\"Get up, I will narrate to you about that. Once a group of the Ash`ariyin and I went to Allah's Messenger (ﷺ) \nand asked him to provide us with mounts; he said, 'By Allah, I will never give you any mounts nor do \nI have anything to mount you on.' Then a few camels of war booty were brought to Allah's Messenger (ﷺ) , \nand he asked about us, saying, 'Where are the Ash-'ariyin?' He then ordered five nice camels to be \ngiven to us, and when we had departed, we said, 'What have we done? Allah's Messenger (ﷺ) had taken the \noath not to give us any mounts, and that he had nothing to mount us on, and later he gave us that we \nmight ride? Did we take advantage of the fact that Allah's Messenger (ﷺ) had forgotten his oath? By Allah, \nwe will never succeed.' So we went back to him and said to him, 'We came to you to give us mounts, \nand you took an oath that you would not give us any mounts and that you had nothing to mount us on.' \nOn that he said, 'I did not provide you with mounts, but Allah did. By Allah, if I take an oath to do \nsomething, and then find something else better than it, I do that which is better and make expiation for \nthe dissolution of the oath.' \"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 157620,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62540,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 645,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"Whoever swears saying in his oath. 'By Al-Lat and Al-`Uzza,' should say, 'None \nhas the right to be worshipped but Allah; and whoever says to his friend, 'Come, let me gamble with \nyou,' should give something in charity.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 157630,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62550,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 646,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>Allah's Messenger (ﷺ) had a gold ring made for himself, and he used to wear it with the stone towards the \ninner part of his hand. Consequently, the people had similar rings made for themselves. Afterwards \nthe Prophet; sat on the pulpit and took it off, saying, \"I used to wear this ring and keep its stone \ntowards the palm of my hand.\" He then threw it away and said, \"By Allah, I will never wear it.\" \nTherefore all the people threw away their rings as well.</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 157640,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62560,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 647,
        "hadithText": "<p>\nNarrated Thabit bin Ad-Dahhak:\n\n<p>The Prophet (ﷺ) said, \"Whoever swears by a religion other than Islam, is, as he says; and whoever \ncommits suicide with something, will be punished with the same thing in the (Hell) Fire; and cursing a \nbeliever is like murdering him; and whoever accuses a believer of disbelief, then it is as if he had \nkilled him.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 157650,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62570,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 648,
        "hadithText": "<p>\nNarrated Al-Bara:\n\n<p>The Prophet (ﷺ) ordered us to help others to fulfill the oaths.</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 157670,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62580,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 649,
        "hadithText": "<p>\nNarrated Usama:\n\n<p>Once a daughter of Allah's Messenger (ﷺ) sent a message to Allah's Messenger (ﷺ) while Usama, Sa`d, and my \nfather or Ubai were (sitting there) with him. She said, (in the message); My child is going to die; \nplease come to us.\" Allah's Messenger (ﷺ) returned the messenger and told him to convey his greetings to \nher, and say, \"Whatever Allah takes, is for Him and whatever He gives is for Him, and everything \nwith Him has a limited fixed term (in this world): so she should be patient and hope for Allah's \nreward.\" Then she again sent for him swearing that he should come; so The Prophet (ﷺ) got up, and so did \nwe. When he sat there (at the house of his daughter), the child was brought to him, and he took him \ninto his lap while the child's breath was disturbed in his chest. The eyes of Allah's Messenger (ﷺ) started \nshedding tears. Sa`d said, \"What is this, O Allah's Messenger (ﷺ)?\" The Prophet (ﷺ) said, \"This is the mercy \nwhich Allah has lodged in the hearts of whoever He wants of His slaves, and verily Allah is merciful \nonly to those of His slaves who are merciful (to others).'</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 157680,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62590,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 650,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"Any Muslim who has lost three of his children will not be touched by the Fire \nexcept that which will render Allah's oath fulfilled.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 157690,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62600,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 651,
        "hadithText": "<p>\nNarrated Haritha bin Wahb:\n\n<p>I heard the Prophet (ﷺ) saying, \"Shall I tell you of the people of Paradise? They comprise every poor \nhumble person, and if he swears by Allah to do something, Allah will fulfill it; while the people of the \nfire comprise every violent, cruel arrogant person.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 157700,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62610,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 652,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>The Prophet (ﷺ) was asked, \"Who are the best people?\" He replied: The people of my generation, and \nthen those who will follow (come after) them, and then those who will come after the later; after that \nthere will come some people whose witness will precede their oaths and their oaths will go ahead of \ntheir witness.\" Ibrahim (a sub-narrator) said, \"When we were young, our elder friends used to prohibit \nus from taking oaths by saying, 'I bear witness swearing by Allah, or by Allah's Covenant.\"'</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 157710,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62620,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 653,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>The Prophet (ﷺ) said, \"Whoever swears falsely in order to grab the property of a Muslim (or of his \nbrother), Allah will be angry with him when he meets Him.\" Allah then revealed in confirmation of \nthe above statement:--'Verily those who purchase a small gain at the cost of Allah's Covenant and \ntheir own oaths.' (3.77) Al-Ash'ath said, \"This Verse was revealed regarding me and a companion of \nmine when we had a dispute about a well.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 157720,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62630,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 654,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>The Prophet (ﷺ) said, \"The Hell Fire will keep on saying: 'Are there anymore (people to come)?' Till the \nLord of Power and Honor will put His Foot over it and then it will say, 'Qat! Qat! (sufficient! \nsufficient!) by Your Power and Honor. And its various sides will come close to each other (i.e., it will \ncontract). \"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 157740,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62640,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 655,
        "hadithText": "<p>\nNarrated Az-Zuhri:\n\n<p>I heard `Urwa bin Az-Zubair, Sa`id bin Al-Musaiyab, 'Alqama bin Waqqas and 'Ubaidullah bin \n`Abdullah narrating from `Aisha, the wife of the Prophet, the story about the liars who said what they \nsaid about her and how Allah revealed her innocence afterwards. Each one of the above four narrators \nnarrated to me a portion of her narration. (It was said in it), \"The Prophet (ﷺ) stood up, saying, 'Is there \nanyone who can relieve me from `Abdullah bin Ubai?' On that, Usaid bin Hudair got up and said to \nSa`d bin 'Ubada, La`Amrullahi (By the Eternity of Allah), we will kill him!' \"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 157750,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62650,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 656,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>regarding: 'Allah will not call you to account for that which is unintentional in your oaths...' (2.225) \nThis Verse was revealed concerning such oath formulas as: 'No, by Allah!' and 'Yes, by Allah!' \nsomething against his oath due to forgetfulness should he make expiation?). And the Statement of \nAllah: 'And there is no blame on you if you make a mistake therein.' (33.5) And Allah said:-- '(Moses \nsaid to Khadir): Call me not to account for what I forgot.' (18.73)</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 157760,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62660,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 657,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"Allah forgives my followers those (evil deeds) their souls may whisper or suggest \nto them as long as they do not act (on it) or speak.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 157770,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62670,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 658,
        "hadithText": "<p>\nNarrated `Abdullah bin `Amr bin Al-As:\n\n<p>While the Prophet (ﷺ) was delivering a sermon on the Day of Nahr (i.e., 10th Dhul-Hijja-Day of \nslaughtering the sacrifice), a man got up saying, \"I thought, O Allah's Messenger (ﷺ), such-and-such a thing \nwas to be done before such-and-such a thing.\" Another man got up, saying, \"O Allah's Messenger (ﷺ)! As \nregards these three (acts of Hajj), thought so-and-so.\" The Prophet (ﷺ) said, \"Do, and there is no harm,\" \nconcerning all those matters on that day. And so, on that day, whatever question he was asked, he \nsaid, \"Do it, do it, and there is no harm therein.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 157780,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62680,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 659,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>A man said to the Prophet (while he was delivering a sermon on the Day of Nahr), \"I have performed \nthe Tawaf round the Ka`ba before the Rami (throwing pebbles) at the Jamra.\" The Prophet (ﷺ) said, \n\"There is no harm (therein).\" Another man said, \"I had my head shaved before slaughtering (the \nsacrifice).\" The Prophet (ﷺ) said, \"There is no harm.\" A third said, \"I have slaughtered (the sacrifice) \nbefore the Rami (throwing pebbles) at the Jamra.\" The Prophet (ﷺ) said, \"There is no harm.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 157790,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62690,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 660,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>A man entered the mosque and started praying while Allah's Messenger (ﷺ) was sitting somewhere in the \nmosque. Then (after finishing the prayer) the man came to the Prophet (ﷺ) and greeted him. The Prophet (ﷺ) \nsaid to him, \"Go back and pray, for you have not prayed. The man went back, and having prayed, he \ncame and greeted the Prophet. The Prophet (ﷺ) after returning his greetings said, \"Go back and pray, for \nyou did not pray.\" On the third time the man said, \"(O Allah's Messenger (ﷺ)!) teach me (how to pray).\" The \nProphet said, \"When you get up for the prayer, perform the ablution properly and then face the Qibla \nand say Takbir (Allahu Akbar), and then recite of what you know of the Qur'an, and then bow, and \nremain in this state till you feel at rest in bowing, and then raise your head and stand straight; and then \nprostrate till you feel at rest in prostration, and then sit up till you feel at rest while sitting; and then \nprostrate again till you feel at rest in prostration; and then get up and stand straight, and do all this in \nall your prayers.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 157800,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62700,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 661,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>When the pagans were defeated during the (first stage) of the battle of Uhud, Satan shouted, \"O \nAllah's slaves! Beware of what is behind you!\" So the front files of the Muslims attacked their own \nback files. Hudhaifa bin Al-Yaman looked and on seeing his father he shouted: \"My father! My \nfather!\" By Allah! The people did not stop till they killed his father. Hudhaifa then said, \"May Allah \nforgive you.\" `Urwa (the sub-narrator) added, \"Hudhaifa continued asking Allah forgiveness for the \nkillers of his father till he met Allah (till he died).</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 157810,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62710,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 662,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"If somebody eats something forgetfully while he is fasting, then he should \ncomplete his fast, for Allah has made him eat and drink.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 157820,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62720,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 663,
        "hadithText": "<p>\nNarrated `Abdullah bin Buhaina:\n\n<p>Once Allah's Messenger (ﷺ) led us in prayer, and after finishing the first two rak`at, got up (instead of sitting \nfor at-Tahiyyat) and then carried on with the prayer. When he had finished his prayer, the people were \nwaiting for him to say Taslim, but before saying Tasiim, he said Takbir and prostrated; then he raised \nhis head, and saying Takbir, he prostrated (SAHU) and then raised his head and finished his prayer \nwith Taslim.</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 157830,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62730,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 664,
        "hadithText": "<p>\nNarrated Ibn Mas`ud:\n\n<p>that Allah's Prophet led them in the Zuhr prayer and he offered either more or less rak`at, and it was \nsaid to him, \"O Allah's Messenger (ﷺ) ! Has the prayer been reduced, or have you forgotten?\" He asked, \n\"What is that?\" They said, \"You have prayed so many rak`at.\" So he performed with them two more \nprostrations and said, \"These two prostrations are to be performed by the person who does not know \nwhether he has prayed more or less (rak`at) in which case he should seek to follow what is right. And \nthen complete the rest (of the prayer) and perform two extra prostrations.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 157840,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62750,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 666,
        "hadithText": "<p>\nNarrated Jundub:\n\n<p>I witnessed the Prophet (ﷺ) offering the `Id prayer (and after finishing it) he delivered a sermon and said, \n\"Whoever has slaughtered his sacrifice (before the prayer) should make up for it (i.e. slaughter another \nanimal) and whoever has not slaughtered his sacrifice yet, should slaughter it by mentioning Allah's \nName over it.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 157870,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62760,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 667,
        "hadithText": "<p>\nNarrated `Abdullah bin `Amr:\n\n<p>The Prophet (ﷺ) said, \"The biggest sins are: To join others in worship with Allah; to be undutiful to one's \nparents; to kill somebody unlawfully; and to take an oath Al-Ghamus.</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 157880,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62770,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 668,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>Allah's Messenger (ﷺ) said, \"If somebody is ordered (by the ruler or the judge) to take an oath, and he takes a \nfalse oath in order to grab the property of a Muslim, then he will incur Allah's Wrath when he will \nmeet Him.\" And Allah revealed in its confirmation: 'Verily! Those who purchase a small gain at the \ncost of Allah's covenants and their own oaths.' (3.77) (The sub-narrator added:) Al-Ash'ath bin Qais \nentered, saying, \"What did Abu `Abdur-Rahman narrate to you?\" They said, \"So-and-so,\" Al-Ash'ath \nsaid, \"This verse was revealed in my connection. I had a well on the land of my cousin (and we had a \ndispute about it). I reported him to Allah 's Apostle who said (to me). \"You should give evidence (i.e. \nwitness) otherwise the oath of your opponent will render your claim invalid.\" I said, \"Then he (my \nopponent) will take the oath, O Allah's Messenger (ﷺ).\" Allah's Messenger (ﷺ) said, \"Whoever is ordered (by the \nruler or the judge) to give an oath, and he takes a false oath in order to grab the property of a Muslim, \nthen he will incur Allah's Wrath when he meets Him on the Day of Resurrection.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 157891,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62780,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 669,
        "hadithText": "<p>\nNarrated Abu Musa:\n\n<p>My companions sent me to the Prophet (ﷺ) to ask him for some mounts. He said, \"By Allah! I will not \nmount you on anything!\" When I met him, he was in an angry mood, but when I met him (again), he \nsaid, \"Tell your companions that Allah or Allah's Messenger (ﷺ) will provide you with mounts.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 157910,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62790,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 670,
        "hadithText": "<p>\nNarrated Az-Zuhri:\n\n<p>I heard `Urwa bin Az-Zubair, Sa`id bin Al-Musaiyab, 'Alqama bin Waqqas and 'Ubaidullah bin \n`Abdullah bin `Uqba relating from `Aisha, the wife of the Prophet (ﷺ) the narration of the people (i.e. the \nliars) who spread the slander against her and they said what they said, and how Allah revealed her \ninnocence. Each of them related to me a portion of that narration. (They said that `Aisha said), ''Then \nAllah revealed the ten Verses starting with:--'Verily! Those who spread the slander..' (24.11-21) \nAll these verses were in proof of my innocence. Abu Bakr As-Siddiq who used to provide for Mistah \nsome financial aid because of his relation to him, said, \"By Allah, I will never give anything (in \ncharity) to Mistah, after what he has said about `Aisha\" Then Allah revealed:-- 'And let not those \namong you who are good and are wealthy swear not to give (any sort of help) to their kins men....' \n(24.22) On that, Abu Bakr said, \"Yes, by Allah, I like that Allah should forgive me.\" and then \nresumed giving Mistah the aid he used to give him and said, \"By Allah! I will never withhold it from \nhim.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 157920,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62800,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 671,
        "hadithText": "<p>\nNarrated Abu Musa Al-Ash`ari:\n\n<p>I went along with some men from the Ash-ariyin to Allah's Messenger (ﷺ) and it happened that I met him \nwhile he was in an angry mood. We asked him to provide us with mounts, but he swore that he would \nnot give us any. Later on he said, \"By Allah, Allah willing, if ever I take an oath (to do something) \nand later on I find something else better than the first, then I do the better one and give expiation for \nthe dissolution of my oath.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 157930,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62810,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 672,
        "hadithText": "<p>\nNarrated Al-Musaiyab:\n\n<p>When the death of Abu Talib approached, Allah's Messenger (ﷺ) came to him and said, \"Say: La ilaha \nillallah, a word with which I will be able to defend you before Allah.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 157940,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62820,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 673,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"(The following are) two words (sentences or utterances) that are very easy for the tongue to say, and very heavy in the balance (of reward), and most beloved to the Gracious Almighty (And they are): Subhan Allahi wa bi-hamdihi; Subhan Allahi-l-'Adhim,\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 157950,
        "last_updated": "2013-06-11 19:19:09"
    },
    {
        "englishURN": 62830,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 674,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>Allah's Messenger (ﷺ) said a sentence and I said another. He said, \"Whoever dies while he is setting up rivals \nalong with Allah (i.e. worshipping others along with Allah) shall be admitted into the (Hell) Fire.\" \nAnd I said the other: \"Whoever dies while he is not setting up rivals along with Allah (i.e. \nworshipping none except Allah) shall be admitted into Paradise.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 157960,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62840,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 675,
        "hadithText": "<p>\nNarrated Anas:\n\n<p>Allah's Messenger (ﷺ) took an oath for abstention from his wives (for one month), and during those days he \nhad a sprain in his foot. He stayed in a Mashrubah (an upper room) for twenty-nine nights and then \ncame down. Then the people said, \"O Allah's Messenger (ﷺ)! You took an oath for abstention (from your \nwives) for one month.\" On that he said, \"A (lunar) month can be of twenty-nine days.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 157970,
        "last_updated": "2015-03-23 10:10:34"
    },
    {
        "englishURN": 62850,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 676,
        "hadithText": "<p>\nNarrated Abu Hazim:\n\n<p>Sahl bin Sa`d said, \"Abu Usaid, the companion of the Prophet, got married, so he invited the Prophet (ﷺ) \nto his wedding party, and the bride herself served them. Sahl said to the People, 'Do you know what \ndrink she served him with? She infused some dates in a pot at night and the next morning she served \nhim with the infusion.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 157980,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62860,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 677,
        "hadithText": "<p>\nNarrated Sauda:\n\n<p>(the wife of the Prophet) One of our sheep died and we tanned its skin and kept on infusing dates in it \ntill it was a worn out water skin.</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 157990,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62870,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 678,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>The family of (the Prophet) Muhammad never ate wheat-bread with meat for three consecutive days \nto their fill, till he met Allah.</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 158000,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62880,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 679,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>Abu Talha said to Um Sulaim, \"I heard the voice of Allah's Messenger (ﷺ) rather weak, and I knew that it \nwas because of hunger. Have you anything (to present to the Prophet)?\" She said, \"Yes.\" Then she \ntook out a few loaves of barley bread and took a veil of hers and wrapped the bread with a part of it \nand sent me to Allah's Messenger (ﷺ). I went and found Allah's Messenger (ﷺ) sitting in the mosque with some \npeople. I stood up before him. Allah's Messenger (ﷺ) said to me, \"Has Abu Talha sent you?\" I said, ' Yes. \nThen Allah's Messenger (ﷺ) said to those who were with him. \"Get up and proceed.\" I went ahead of them \n(as their forerunner) and came to Abu Talha and informed him about it. Abu Talha said, \"O Um \nSulaim! Allah's Messenger (ﷺ) has come and we have no food to feed them.\" Um Sulaim said, \"Allah and \nHis Apostle know best.\" So Abu Talha went out (to receive them) till he met Allah's Messenger (ﷺ). \nAllah's Messenger (ﷺ) came in company with Abu Talha and they entered the house. Allah's Messenger (ﷺ) said, \"O \nUm Sulaim! Bring whatever you have.\" So she brought that (barley) bread and Allah's Messenger (ﷺ) \nordered that bread to be broken into small pieces, and then Um Sulaim poured over it some butter \nfrom a leather butter container, and then Allah's Messenger (ﷺ) said what Allah wanted him to say, (i.e. \nblessing the food). Allah's Messenger (ﷺ) then said, \"Admit ten men.\" Abu Talha admitted them and they ate \nto their fill and went out. He again said, \"Admit ten men.\" He admitted them, and in this way all the \npeople ate to their fill, and they were seventy or eighty men.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 158020,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62890,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 680,
        "hadithText": "<p>\nNarrated `Umar bin Al-Khattab:\n\n<p>I heard Allah's Messenger (ﷺ) saying, \"The (reward of) deeds, depend upon the intentions and every person \nwill get the reward according to what he has intended. So whoever emigrated for the sake of Allah and \nHis Apostle, then his emigration will be considered to be for Allah and His Apostle, and whoever \nemigrated for the sake of worldly gain or for a woman to marry, then his emigration will be \nconsidered to be for what he emigrated for.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 158030,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62900,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 681,
        "hadithText": "<p>\nNarrated Ka`b bin Malik:\n\n<p>In the last part of his narration about the three who remained behind (from the battle of Tabuk). (I \nsaid) \"As a proof of my true repentance (for not joining the Holy battle of Tabuk), I shall give up all \nmy property for the sake of Allah and His Apostle (as an expiation for that sin).\" The Prophet (ﷺ) said (to \nme), \"Keep some of your wealth, for that is better for you.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 158040,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62910,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 682,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>The Prophet (ﷺ) used to stay (for a period) in the house of Zainab bint Jahsh (one of the wives of the \nProphet ) and he used to drink honey in her house. Hafsa and I decided that when the Prophet (ﷺ) entered \nupon either of us, she would say, \"I smell in you the bad smell of Maghafir (a bad smelling raisin). \nHave you eaten Maghafir?\" When he entered upon one of us, she said that to him. He replied (to her), \n\"No, but I have drunk honey in the house of Zainab bint Jahsh, and I will never drink it again.\" Then \nthe following verse was revealed: 'O Prophet ! Why do you ban (for you) that which Allah has made \nlawful for you?. ..(up to) If you two (wives of the Prophet (ﷺ) turn in repentance to Allah.' (66.1-4) The \ntwo were `Aisha and Hafsa And also the Statement of Allah: 'And (Remember) when the Prophet (ﷺ) \ndisclosed a matter in confidence to one of his wives!' (66.3) i.e., his saying, \"But I have drunk \nhoney.\" Hisham said: It also meant his saying, \"I will not drink anymore, and I have taken an oath, so \ndo not inform anybody of that.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 158050,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62920,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 683,
        "hadithText": "<p>\nNarrated Sa`id bin Al-Harith:\n\n<p>that he heard Ibn `Umar saying, \"Weren't people forbidden to make vows?\" The Prophet (ﷺ) said, 'A vow \nneither hastens nor delays anything, but by the making of vows, some of the wealth of a miser is taken \nout.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 158070,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62930,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 684,
        "hadithText": "<p>\nNarrated `Abdullah bin `Umar:\n\n<p>The Prophet (ﷺ) forbade the making of vows and said, \"It (a vow) does not prevent anything (that has to \ntake place), but the property of a miser is spent (taken out) with it.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 158080,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62940,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 685,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"Allah says, 'The vow, does not bring about for the son of Adam anything I have not \ndecreed for him, but his vow may coincide with what has been decided for him, and by this way I \ncause a miser to spend of his wealth. So he gives Me (spends in charity) for the fulfillment of what has \nbeen decreed for him what he would not give Me before but for his vow.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 158090,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62950,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 686,
        "hadithText": "<p>\nNarrated Zahdam bin Mudarrab:\n\n<p>`Imran bin Hussain said, \"The Prophet (ﷺ) said, 'The best of you (people) are my generation, and the \nsecond best will be those who will follow them, and then those who will follow the second \ngeneration.\" `Imran added, \"I do not remember whether he mentioned two or three (generations) after \nhis generation. He added, 'Then will come some people who will make vows but will not fulfill them; \nand they will be dishonest and will not be trustworthy, and they will give their witness without being \nasked to give their witness, and fatness will appear among them.' \"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 158100,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62960,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 687,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>The Prophet (ﷺ) said, \"Whoever vows that he will be obedient to Allah, should remain obedient to Him; \nand whoever made a vow that he will disobey Allah, should not disobey Him.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 158110,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62970,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 688,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>`Umar said \"O Allah's Messenger (ﷺ)! I vowed to perform I`tikaf for one night in Al-Masjid-al-Haram, \nduring the Pre-Islamic Period of ignorance (before embracing Islam). \"The Prophet (ﷺ) said, \"Fulfill your \nvow.\" Ibn `Umar said to the lady, \"Pray on her behalf.\" Ibn `Abbas said the same.</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 158120,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62980,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 689,
        "hadithText": "<p>\nNarrated Sa`id bin 'Ubada Al-Ansari:\n\n<p>that he consulted the Prophet (ﷺ) about a vow that had been made by his mother who died without \nfulfilling it. The Prophet (ﷺ) gave his verdict that he should fulfill it on her behalf. The verdict became \nSunna (i.e. the Prophet's tradition).</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 158130,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62990,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 690,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>A man came to the Prophet (ﷺ) and said to him, \"My sister vowed to perform the Hajj, but she died \n(before fulfilling it).\" The Prophet (ﷺ) said, \"Would you not have paid her debts if she had any?\" The man \nsaid, \"Yes.\" The Prophet (ﷺ) said, \"So pay Allah's Rights, as He is more entitled to receive His rights.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 158140,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 63000,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 691,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>The Prophet (ﷺ) said, \"Whoever vowed to be obedient to Allah, must be obedient to Him; and whoever \nvowed to be disobedient to Allah, should not be disobedient to Him.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 158150,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 63010,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 692,
        "hadithText": "<p>\nNarrated Anas:\n\n<p>The Prophet (ﷺ) said, \"Allah is not in need of this man) torturing himself,\" when he saw the man walking \nbetween his two sons (who were supporting him).</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 158160,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 63020,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 693,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>The Prophet (ﷺ) saw a man performing Tawaf around the Ka`ba, tied with a rope or something else (while \nanother person was holding him). The Prophet (ﷺ) cut that rope off.</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 158170,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 63030,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 694,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>While performing the Tawaf around the Ka`ba, the Prophet (ﷺ) passed by a person leading another person \nby a hair-rope nose-ring in his nose. The Prophet (ﷺ) cut the hair-rope nose-ring off with his hand and \nordered the man to lead him by the hand.</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 158180,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 63040,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 695,
        "hadithText": "<p>\nNarrated Ibn `Abbas:\n\n<p>While the Prophet (ﷺ) was delivering a sermon, he saw a man standing, so he asked about that man. They \n(the people) said, \"It is Abu Israil who has vowed that he will stand and never sit down, and he will \nnever come in the shade, nor speak to anybody, and will fast.'' The Prophet (ﷺ) said, \"Order him to speak \nand let him come in the shade, and make him sit down, but let him complete his fast.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 158190,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 63050,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 696,
        "hadithText": "<p>\nNarrated `Abdullah bin `Umar:\n\n<p>that he was asked about a man who had vowed that he would fast all the days of his life then the day \nof `Id al Adha or `Id-al-Fitr came. `Abdullah bin `Umar said: You have indeed a good example in \nAllah's Messenger (ﷺ). He did not fast on the day of `Id al Adha or the day of `Id-al-Fitr, and we do not \nintend fasting on these two days.</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 158210,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 63060,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 697,
        "hadithText": "<p>\nNarrated Ziyad bin Jubair:\n\n<p>I was with Ibn `Umar when a man asked him, \"I have vowed to fast every Tuesday or Wednesday \nthroughout my life and if the day of my fasting coincided with the day of Nahr (the first day of `Id-al- \nAdha), (What shall I do?)\" Ibn `Umar said, \"Allah has ordered the vows to be fulfilled, and we are \nforbidden to fast on the day of Nahr.\" The man repeated his question and Ibn `Umar repeated his \nformer answer, adding nothing more.</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 158220,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 63070,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 698,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>We went out in the company of Allah's Messenger (ﷺ) on the day of (the battle of) Khaibar, and we did not \nget any gold or silver as war booty, but we got property in the form of things and clothes. Then a man \ncalled Rifa`a bin Zaid, from the tribe of Bani Ad-Dubaib, presented a slave named Mid`am to Allah's \nApostle. Allah's Messenger (ﷺ) headed towards the valley of Al-Qura, and when he was in the valley of Al- \nQura an arrow was thrown by an unidentified person, struck and killed Mid`am who was making a \nshe-camel of Allah's Messenger (ﷺ) kneel down. The people said, \"Congratulations to him (the slave) for \ngaining Paradise.\" Allah's Messenger (ﷺ) said, \"No! By Him in Whose Hand my soul is, for the sheet which \nhe stole from the war booty before its distribution on the day of Khaibar, is now burning over him.\" \nWhen the people heard that, a man brought one or two Shiraks (leather straps of shoes) to the Prophet. \nThe Prophet (ﷺ) said, \"A Shirak of fire, or two Shiraks of fire.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 158230,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62741,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 665,
        "hadithText": "<p>\n\n     Narrated Ubai bin Ka'b:\n<p>\n\n     that he heard Allah's Messenger (ﷺ) saying, \"(Moses) said, 'Call me not to \n     account for what I forget and be not hard upon me for my affair (with \n     you)' (18.73) the first excuse of Moses was his forgetfulness.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 157850,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62742,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 665,
        "hadithText": "<p>\n\n     Narrated Al-Bara bin Azib that once he had a guest, so he told his \n     family (on the Day of Id-ul-Adha) that they should slaughter the \n     animal for sacrifice before he returned from the ('Id) prayer in order\n     that their guest could take his meal. So his family slaughtered (the \n     animal ) before the prayer. Then they mentioned that event to the \n     Prophet who ordered Al-Bara to slaughter another sacrifice. Al-Bara' \n     said to the Prophet (ﷺ) , \"I have a young milch she-goat which is better \n     than two sheep for slaughtering.\" (The sub-narrator, Ibn 'Aun used to \n     say, \"I don't know whether the permission (to slaughter a she-goat as \n     a sacrifice) was especially given to Al-Bara' or if it was in general \n     for all the Muslims.\") (See Hadith No. 99, Vol. 2.)\n<p></b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 157860,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62301,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 621,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>The Prophet (ﷺ) said, \"We (Muslims) are the last in the world, but will be foremost on the Day of \nResurrection.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 157380,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62302,
        "collection": "bukhari",
        "volumeNumber": 8,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 621,
        "hadithText": "Allah's Messenger (ﷺ) also said: \"By Allah, if anyone of you insists on fulfilling an oath by \nwhich he may harm his family, he commits a greater sin in Allah's sight than that of dissolving his \noath and making expiation for it.\"</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 157390,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 62565,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 78,
        "bookName": "Oaths and Vows",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 647,
        "hadithText": "Narrated Abu Hurairah that he heard the Prophet (ﷺ) saying, \"Allah decided to test three people from Bani Isra'il. So, He sent an angel who came first to the leper and said, '(I am a traveller) who has run short of all means of living, and I have nobody to help me except Allah, and then with your help.'\" Abu Hurairah then mentioned the complete narration.</b>",
        "bookID": "78.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 157660,
        "last_updated": "2012-04-26 07:00:00"
    }
]