[
    {
        "englishURN": 65245,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 84,
        "bookName": "Obliging the Apostates and the Repentance of Those who Refuse the Truth Obstinately, and to Fight Ag",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 69,
        "hadithText": "'Umar bin Al-Khattab said: I heard Hisham bin Al-Hakim reciting Surat Al-Furqan during the lifetime of Allah's Messenger (ﷺ). I listened to his recitation and noticed that he recited it in several different ways which Allah's Messenger (ﷺ) had not taught me. So  I was about to jump over him during his Salat (prayer) but I waited till he finished his Salat (prayer) whereupon I put, either his upper garment or my upper garment around his neck and seized him by it and asked him, \"Who has taught you this Surah?\" He replied: \"Allah's Messenger (ﷺ) has taught it to me.\" I said (to him), \"You have told a lie! By Allah, Allah's Messenger (ﷺ) has taught me this Surah which I have heard you reciting.\" So I dragged him to the Allah's Messenger (ﷺ). I said: \"O Allah's Messenger I have heard this man reciting Surat Al-Furqan in a way in which you have not taught me, and you did teach me Surah Al-Furqan.\" On that Allah's Messenger (ﷺ) said, \"O 'Umar, release him! Recite, O Hisham\". So Hisham recited before him in the way as I heard him reciting. Allah's Messenger (ﷺ) said, \"It has been revealed like this.\" Then Allah's Messenger (ﷺ) said, \"Recite, O 'Umar\" So recited it. The Prophet (ﷺ) said, \"It has been revealed like this.\" And then he added, \"This Qur'an has been revealed to be recited in seven different ways, so recite it whichever way is easier for you.\"</b>",
        "bookID": "84.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 160530,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 65080,
        "collection": "bukhari",
        "volumeNumber": 9,
        "bookNumber": 84,
        "bookName": "Dealing with Apostates",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 53,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>When the Verse: 'It is those who believe and confuse not their belief with wrong (i.e., worshipping \nothers besides Allah): (6.82) was revealed, it became very hard on the companions of the Prophet (ﷺ) and \nthey said, \"Who among us has not confused his belief with wrong (oppression)?\" On that, Allah's \nApostle said, \"This is not meant (by the Verse). Don't you listen to Luqman's statement: 'Verily! \nJoining others in worship with Allah is a great wrong indeed.' (31.13)</b>",
        "bookID": "84.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 160350,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 65090,
        "collection": "bukhari",
        "volumeNumber": 9,
        "bookNumber": 84,
        "bookName": "Dealing with Apostates",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 54,
        "hadithText": "<p>\nNarrated Abu Bakra:\n\n<p>The Prophet. said, \"The biggest of the great sins are: To join others in worship with Allah, to be \nundutiful to one's parents, and to give a false witness.\" He repeated it thrice, or said, \"....a false \nstatement,\" and kept on repeating that warning till we wished he would stop saying it. (See Hadith \nNo.7, Vol. 8)</b>",
        "bookID": "84.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 160360,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 65100,
        "collection": "bukhari",
        "volumeNumber": 9,
        "bookNumber": 84,
        "bookName": "Dealing with Apostates",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 55,
        "hadithText": "<p>\nNarrated `Abdullah bin `Amr:\n\n<p>A bedouin came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! What are the biggest sins?: The Prophet (ﷺ) \nsaid, \"To join others in worship with Allah.\" The bedouin said, \"What is next?\" The Prophet (ﷺ) said, \"To \nbe undutiful to one's parents.\" The bedouin said \"What is next?\" The Prophet (ﷺ) said \"To take an oath \n'Al-Ghamus.\" The bedouin said, \"What is an oath 'Al-Ghamus'?\" The Prophet (ﷺ) said, \"The false oath \nthrough which one deprives a Muslim of his property (unjustly).</b>",
        "bookID": "84.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 160370,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 65110,
        "collection": "bukhari",
        "volumeNumber": 9,
        "bookNumber": 84,
        "bookName": "Dealing with Apostates",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 56,
        "hadithText": "<p>\nNarrated Ibn Mas`ud:\n\n<p>A man said, \"O Allah's Messenger (ﷺ)! Shall we be punished for what we did in the Prelslamic Period of \nignorance?\" The Prophet (ﷺ) said, \"Whoever does good in Islam will not be punished for what he did in \nthe Pre-lslamic Period of ignorance and whoever does evil in Islam will be punished for his former \nand later (bad deeds).</b>",
        "bookID": "84.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 160380,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 65120,
        "collection": "bukhari",
        "volumeNumber": 9,
        "bookNumber": 84,
        "bookName": "Dealing with Apostates",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 57,
        "hadithText": "<p>\nNarrated `Ikrima:\n\n<p>Some Zanadiqa (atheists) were brought to `Ali and he burnt them. The news of this event, reached Ibn \n`Abbas who said, \"If I had been in his place, I would not have burnt them, as Allah's Messenger (ﷺ) forbade \nit, saying, 'Do not punish anybody with Allah's punishment (fire).' I would have killed them according \nto the statement of Allah's Messenger (ﷺ), 'Whoever changed his Islamic religion, then kill him.'\"</b>",
        "bookID": "84.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 160390,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 65130,
        "collection": "bukhari",
        "volumeNumber": 9,
        "bookNumber": 84,
        "bookName": "Dealing with Apostates",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 58,
        "hadithText": "<p>\nNarrated Abu Burda:\n\n<p>Abu Musa said, \"I came to the Prophet (ﷺ) along with two men (from the tribe) of Ash`ariyin, one on my \nright and the other on my left, while Allah's Messenger (ﷺ) was brushing his teeth (with a Siwak), and both \nmen asked him for some employment. The Prophet (ﷺ) said, 'O Abu Musa (O `Abdullah bin Qais!).' I \nsaid, 'By Him Who sent you with the Truth, these two men did not tell me what was in their hearts and \nI did not feel (realize) that they were seeking employment.' As if I were looking now at his Siwak \nbeing drawn to a corner under his lips, and he said, 'We never (or, we do not) appoint for our affairs \nanyone who seeks to be employed. But O Abu Musa! (or `Abdullah bin Qais!) Go to Yemen.'\" The \nProphet then sent Mu`adh bin Jabal after him and when Mu`adh reached him, he spread out a cushion \nfor him and requested him to get down (and sit on the cushion). Behold: There was a fettered man \nbeside Abu Muisa. Mu`adh asked, \"Who is this (man)?\" Abu Muisa said, \"He was a Jew and became a \nMuslim and then reverted back to Judaism.\" Then Abu Muisa requested Mu`adh to sit down but \nMu`adh said, \"I will not sit down till he has been killed. This is the judgment of Allah and His Apostle \n(for such cases) and repeated it thrice. Then Abu Musa ordered that the man be killed, and he was \nkilled. Abu Musa added, \"Then we discussed the night prayers and one of us said, 'I pray and sleep, \nand I hope that Allah will reward me for my sleep as well as for my prayers.'\"</b>",
        "bookID": "84.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 160400,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 65140,
        "collection": "bukhari",
        "volumeNumber": 9,
        "bookNumber": 84,
        "bookName": "Dealing with Apostates",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 59,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>When the Prophet (ﷺ) died and Abu Bakr became his successor and some of the Arabs reverted to \ndisbelief, `Umar said, \"O Abu Bakr! How can you fight these people although Allah's Messenger (ﷺ) said, 'I \nhave been ordered to fight the people till they say: 'None has the right to be worshipped but Allah, \n'and whoever said, 'None has the right to be worshipped but Allah', Allah will save his property and \nhis life from me, unless (he does something for which he receives legal punishment) justly, and his \naccount will be with Allah?' \"Abu Bakr said, \"By Allah! I will fight whoever differentiates between \nprayers and Zakat as Zakat is the right to be taken from property (according to Allah's Orders). By \nAllah! If they refused to pay me even a kid they used to pay to Allah's Messenger (ﷺ), I would fight with \nthem for withholding it.\" `Umar said, \"By Allah: It was nothing, but I noticed that Allah opened Abu \nBakr's chest towards the decision to fight, therefore I realized that his decision was right.\"</b>",
        "bookID": "84.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 160411,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 65150,
        "collection": "bukhari",
        "volumeNumber": 9,
        "bookNumber": 84,
        "bookName": "Dealing with Apostates",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 60,
        "hadithText": "<p>\nNarrated Anas bin Malik:\n\n<p>A Jew passed by Allah's Messenger (ﷺ) and said, \"As-Samu 'Alaika.\" Allah's Messenger (ﷺ) said in reply, \"We \n'Alaika.\" Allah's Messenger (ﷺ) then said to his companions, \"Do you know what he (the Jew) has said? He \nsaid, 'As-Samu 'Alaika.'\" They said, \"O Allah's Messenger (ﷺ)! Shall we kill him?\" The Prophet, said, \"No. \nWhen the people of the Book greet you, say: 'Wa 'Alaikum.'\"</b>",
        "bookID": "84.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 160430,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 65160,
        "collection": "bukhari",
        "volumeNumber": 9,
        "bookNumber": 84,
        "bookName": "Dealing with Apostates",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 61,
        "hadithText": "<p>\nNarrated `Aisha:\n\n<p>A group of Jews asked permission to visit the Prophet (and when they were admitted) they said, \"As- \nSamu 'Alaika (Death be upon you).\" I said (to them), \"But death and the curse of Allah be upon you!\" \nThe Prophet (ﷺ) said, \"O `Aisha! Allah is kind and lenient and likes that one should be kind and lenient in \nall matters.\" I said, \"Haven't you heard what they said?\" He said, \"I said (to them), 'Wa 'Alaikum (and \nupon you).</b>",
        "bookID": "84.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 160440,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 65170,
        "collection": "bukhari",
        "volumeNumber": 9,
        "bookNumber": 84,
        "bookName": "Dealing with Apostates",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 62,
        "hadithText": "<p>\nNarrated Ibn `Umar:\n\n<p>Allah's Messenger (ﷺ) said, \"When the Jews greet anyone of you they say: 'Sam'Alaika (death be upon you); \nso you should say; 'Wa 'Alaika (and upon you).'\"</b>",
        "bookID": "84.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 160450,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 65180,
        "collection": "bukhari",
        "volumeNumber": 9,
        "bookNumber": 84,
        "bookName": "Dealing with Apostates",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 63,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>As if I am looking at the Prophet (ﷺ) while he was speaking about one of the prophets whose people have \nbeaten and wounded him, and he was wiping the blood off his face and saying, \"O Lord! Forgive my, \npeople as they do not know.\"</b>",
        "bookID": "84.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 160460,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 65190,
        "collection": "bukhari",
        "volumeNumber": 9,
        "bookNumber": 84,
        "bookName": "Dealing with Apostates",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 64,
        "hadithText": "<p>\nNarrated `Ali:\n\n<p>Whenever I tell you a narration from Allah's Messenger (ﷺ), by Allah, I would rather fall down from the sky \nthan ascribe a false statement to him, but if I tell you something between me and you (not a Hadith) \nthen it was indeed a trick (i.e., I may say things just to cheat my enemy). No doubt I heard Allah's \nApostle saying, \"During the last days there will appear some young foolish people who will say the \nbest words but their faith will not go beyond their throats (i.e. they will have no faith) and will go out \nfrom (leave) their religion as an arrow goes out of the game. So, where-ever you find them, kill them, \nfor who-ever kills them shall have reward on the Day of Resurrection.\"</b>",
        "bookID": "84.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 160470,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 65200,
        "collection": "bukhari",
        "volumeNumber": 9,
        "bookNumber": 84,
        "bookName": "Dealing with Apostates",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 65,
        "hadithText": "<p>\nNarrated `Abdullah bin `Amr bin Yasar:\n\n<p>That they visited Abu Sa`id Al-Khudri and asked him about Al-Harauriyya, a special unorthodox \nreligious sect, \"Did you hear the Prophet (ﷺ) saying anything about them?\" Abu Sa`id said, \"I do not \nknow what Al-Harauriyya is, but I heard the Prophet (ﷺ) saying, \"There will appear in this nation---- he \ndid not say: From this nation ---- a group of people so pious apparently that you will consider your \nprayers inferior to their prayers, but they will recite the Qur'an, the teachings of which will not go \nbeyond their throats and will go out of their religion as an arrow darts through the game, whereupon \nthe archer may look at his arrow, its Nasl at its Risaf and its Fuqa to see whether it is blood-stained or \nnot (i.e. they will have not even a trace of Islam in them).</b>",
        "bookID": "84.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 160480,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 65210,
        "collection": "bukhari",
        "volumeNumber": 9,
        "bookNumber": 84,
        "bookName": "Dealing with Apostates",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 66,
        "hadithText": "<p>\nNarrated `Abdullah bin `Umar:\n\n<p>Regarding Al-Harauriyya: The Prophet (ﷺ) said, \"They will go out of Islam as an arrow darts out of the \ngame's body.'</b>",
        "bookID": "84.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 160490,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 65220,
        "collection": "bukhari",
        "volumeNumber": 9,
        "bookNumber": 84,
        "bookName": "Dealing with Apostates",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 67,
        "hadithText": "<p>\nNarrated Abu Sa`id:\n\n<p>While the Prophet (ﷺ) was distributing (something, `Abdullah bin Dhil Khawaisira at-Tamimi came and \nsaid, \"Be just, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said, \"Woe to you ! Who would be just if I were not?\" \n`Umar bin Al-Khattab said, \"Allow me to cut off his neck ! \" The Prophet (ﷺ) said, \" Leave him, for he \nhas companions, and if you compare your prayers with their prayers and your fasting with theirs, you \nwill look down upon your prayers and fasting, in comparison to theirs. Yet they will go out of the \nreligion as an arrow darts through the game's body in which case, if the Qudhadh of the arrow is \nexamined, nothing will be found on it, and when its Nasl is examined, nothing will be found on it; and \nthen its Nadiyi is examined, nothing will be found on it. The arrow has been too fast to be smeared by \ndung and blood. The sign by which these people will be recognized will be a man whose one hand (or \nbreast) will be like the breast of a woman (or like a moving piece of flesh). These people will appear \nwhen there will be differences among the people (Muslims).\" Abu Sa`id added: I testify that I heard \nthis from the Prophet (ﷺ) and also testify that `Ali killed those people while I was with him. The man with \nthe description given by the Prophet (ﷺ) was brought to `Ali. The following Verses were revealed in \nconnection with that very person (i.e., `Abdullah bin Dhil-Khawaisira at-Tarnimi): 'And among them \nare men who accuse you (O Muhammad) in the matter of (the distribution of) the alms.' (9.58)</b>",
        "bookID": "84.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 160500,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 65230,
        "collection": "bukhari",
        "volumeNumber": 9,
        "bookNumber": 84,
        "bookName": "Dealing with Apostates",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 68,
        "hadithText": "<p>\nNarrated Yusair bin `Amr:\n\n<p>I asked Sahl bin Hunaif, \"Did you hear the Prophet (ﷺ) saying anything about Al-Khawarij?\" He said, \"I \nheard him saying while pointing his hand towards Iraq. \"There will appear in it (i.e, Iraq) some people \nwho will recite the Qur'an but it will not go beyond their throats, and they will go out from (leave) \nIslam as an arrow darts through the game's body.' \"</b>",
        "bookID": "84.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 160510,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 65240,
        "collection": "bukhari",
        "volumeNumber": 9,
        "bookNumber": 84,
        "bookName": "Dealing with Apostates",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 69,
        "hadithText": "<p>\nNarrated Abu Huraira:\n\n<p>Allah's Messenger (ﷺ) said, \"The Hour will not be established till two (huge) groups fight against each other, \ntheir claim being one and the same.\"</b>",
        "bookID": "84.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 160520,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 65250,
        "collection": "bukhari",
        "volumeNumber": 9,
        "bookNumber": 84,
        "bookName": "Dealing with Apostates",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 70,
        "hadithText": "<p>\nNarrated `Abdullah:\n\n<p>When the Verse:--'Those who believe and did not confuse their belief with wrong (worshipping others \nbesides Allah).' (6.82) was revealed, it was hard on the companions of the Prophet (ﷺ) and they said, \n\"Who among us has not wronged (oppressed) himself?\" Allah's Messenger (ﷺ) said, \"The meaning of the \nVerse is not as you think, but it is as Luqman said to his son, 'O my son! Join not in worship others \nwith Allah, Verily! Joining others in worship with Allah is a great wrong indeed.'\" (31.13)</b>",
        "bookID": "84.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 160540,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 65260,
        "collection": "bukhari",
        "volumeNumber": 9,
        "bookNumber": 84,
        "bookName": "Dealing with Apostates",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 71,
        "hadithText": "<p>\nNarrated `Itban bin Malik:\n\n<p>Once Allah's Messenger (ﷺ) came to me in the morning, and a man among us said, \"Where is Malik bin Ad- \nDukhshun?\" Another man from us replied, \"He is a hypocrite who does not love Allah and His \nApostle.\" The Prophet (ﷺ) said, \"Don't you think that he says: None has the right to be worshipped but \nAllah, only for Allah's sake?\" They replied, \"Yes\" The Prophet (ﷺ) said, \"Nobody will meet Allah with \nthat saying on the Day of Resurrection, but Allah will save him from the Fire.\"</b>",
        "bookID": "84.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 160550,
        "last_updated": "2012-04-26 07:00:00"
    },
    {
        "englishURN": 65270,
        "collection": "bukhari",
        "volumeNumber": 9,
        "bookNumber": 84,
        "bookName": "Dealing with Apostates",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 72,
        "hadithText": "<p>\nNarrated:\n\n<p>Abu `Abdur-Rahman and Hibban bin 'Atiyya had a dispute. Abu `Abdur-Rahman said to Hibban, \n\"You know what made your companions (i.e. `Ali) dare to shed blood.\" Hibban said, \"Come on! What \nis that?\" `Abdur-Rahman said, \"Something I heard him saying.\" The other said, \"What was it?\" \n`AbdurRahman said, \"`Ali said, Allah's Messenger (ﷺ) sent for me, Az-Zubair and Abu Marthad, and all of \nus were cavalry men, and said, 'Proceed to Raudat-Hajj (Abu Salama said that Abu 'Awana called it \nlike this, i.e., Hajj where there is a woman carrying a letter from Hatib bin Abi Balta'a to the pagans \n(of Mecca). So bring that letter to me.' So we proceeded riding on our horses till we overtook her at \nthe same place of which Allah's Messenger (ﷺ) had told us. She was traveling on her camel. In that letter \nHatib had written to the Meccans about the proposed attached of Allah's Messenger (ﷺ) against them. We \nasked her, \"Where is the letter which is with you?' She replied, 'I haven't got any letter.' So we made \nher camel kneel down and searched her luggage, but we did not find anything. My two companions \nsaid, 'We do not think that she has got a letter.' I said, 'We know that Allah's Messenger (ﷺ) has not told a \nlie.'\" \nThen `Ali took an oath saying, \"By Him by Whom one should swear! You shall either bring out the \nletter or we shall strip off your clothes.\" She then stretched out her hand for her girdle (round her \nwaist) and brought out the paper (letter). They took the letter to Allah's Messenger (ﷺ). `Umar said, \"O \nAllah's Messenger (ﷺ)! (Hatib) has betrayed Allah, His Apostle and the believers; let me chop off his neck!\" \nAllah's Messenger (ﷺ) said, \"O Hatib! What obliged you to do what you have done?\" Hatib replied, \"O \nAllah's Messenger (ﷺ)! Why (for what reason) should I not believe in Allah and His Apostle? But I intended \nto do the (Mecca) people a favor by virtue of which my family and property may be protected as there \nis none of your companions but has some of his people (relatives) whom Allah urges to protect his \nfamily and property.\" The Prophet (ﷺ) said, \"He has said the truth; therefore, do not say anything to him \nexcept good.\" `Umar again said, \"O Allah's Messenger (ﷺ)! He has betrayed Allah, His Apostle and the \nbelievers; let me chop his neck off!\" The Prophet (ﷺ) said, \"Isn't he from those who fought the battle of \nBadr? And what do you know, Allah might have looked at them (Badr warriors) and said (to them), \n'Do what you like, for I have granted you Paradise?' \" On that, `Umar's eyes became flooded with tears \nand he said, \"Allah and His Apostle know best.\"</b>",
        "bookID": "84.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 160560,
        "last_updated": "2012-04-26 07:00:00"
    }
]