[
    {
        "banglaURN": 6009420,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": null,
        "babNumber": 768,
        "babName": null,
        "hadithNumber": 942,
        "hadithSanad": "",
        "hadithText": "শু’আয়ব (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি যুহরী (রহঃ)-কে জিজ্ঞেস করলাম, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) কি সালাত আদায় করতেন অর্থাৎ খাওফের সালাত? তিনি বললেন, আমাকে সালিম (রহঃ) জানিয়েছেন যে, ‘আবদুল্লাহ্‌ ইব্‌নু ‘উমর (রাঃ) বলেছেন, আমি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর সঙ্গে নাজ্‌দ এলাকায় যুদ্ধ করেছিলাম। সেখানে আমরা শত্রুর মুখোমুখী কাতারবন্দী হয়ে দাঁড়ালাম। অতঃপর আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাদের নিয়ে সালাত আদায় করলেন। একদল তাঁর সঙ্গে সালাতে দাঁড়ালেন এবং অন্য একটি দল শত্রুর মুখোমুখী অবস্থান করলেন। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁর সংগে যাঁরা ছিলেন তাঁদের নিয়ে রুকূ’ ও দুটি সিজদা করলেন। অতঃপর এ দলটি যারা সালাত আদায় করেনি, তাঁদের স্থানে চলে গেলেন এবং তাঁরা আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর পিছনে এগিয়ে এলেন, তখন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁদের সঙ্গে এক রুকূ’ ও দু’ সিজদা করলেন এবং পরে সালাম ফিরালেন। অতঃপর তাদের প্রত্যেকে উঠে দাঁড়ালেন এবং নিজে নিজে একটি রুকূ’ ও দুটি সিজদা (সহ সালাত) শেষ করলেন।</b>",
        "bookID": "12.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 108280,
        "last_updated": null
    },
    {
        "banglaURN": 6009430,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": null,
        "babNumber": 769,
        "babName": null,
        "hadithNumber": 943,
        "hadithSanad": "",
        "hadithText": "নাফি’ (রহঃ) সূত্রে ইব্‌নু ‘উমর (রাঃ) হতে মুজাহিদ (রহঃ) থেকে বর্ণিতঃ সৈন্যরা যখন পরস্পর (শত্রুমিত্র) মিলিত হয়ে যায়, ‘তখন দাঁড়িয়ে সালাত আদায় করবে। ইব্‌নু ‘উমর (রাঃ) নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে আরো বলেছেন যে, যদি সৈন্যদের অবস্থা এর চেয়ে গুরুতর হয়ে যায়, তাহলে দাঁড়ানো অবস্থায় এবং আরোহী অবস্থায় সালাত আদায় করবে।</b>",
        "bookID": "12.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 108290,
        "last_updated": null
    },
    {
        "banglaURN": 6009440,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": null,
        "babNumber": 770,
        "babName": null,
        "hadithNumber": 944,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সালাতে দাঁড়ালেন এবং সাহাবীগণ তাঁর পিছনে (ইক্তিদা করে) দাঁড়ালেন। তিনি তাক্‌বীর বললেন, তারাও তাক্‌বীর বললেন, তিনি রুকূ’ করলেন, তারাও তাঁর সঙ্গে রুকূ’ করলেন। অতঃপর তিনি সিজদা করলেন এবং তারাও তাঁর সঙ্গে সিজদা করলেন। অতঃপর তিনি দ্বিতীয় রাক’আতের জন্য দাঁড়ালেন, তখন যারা তাঁর সংগে সিজদা করছিলেন তারা উঠে দাঁড়ালেন এবং তাদের ভাইদের পাহারা দিতে লাগলেন। তখন অপর দলটি এসে তাঁর সঙ্গে রুকূ’ করলেন। এভাবে সকলেই সালাতে অংশগ্রহণ করলেন। অথচ একদল অপর দলকে পাহারাও দিলেন।</b>",
        "bookID": "12.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 108300,
        "last_updated": null
    },
    {
        "banglaURN": 6009450,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": null,
        "babNumber": 771,
        "babName": null,
        "hadithNumber": 945,
        "hadithSanad": "",
        "hadithText": "জাবির ইব্‌নু ‘আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, খন্দক যুদ্ধের দিন ‘উমর (রাঃ) কুরাইশ গোত্রের কাফিরদের মন্দ বলতে বলতে আসলেন এবং বললেন, হে আল্লাহ্‌র রসূল! সূর্য প্রায় ডুবে যাচ্ছে, অথচ ‘আসরের সালাত আদায় করতে পারিনি। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ আল্লাহ্‌র কসম! আমিও তা এখনও আদায় করতে পারিনি। বর্ণনাকারী বলেন, অতঃপর তিনি মদীনার বুতহান উপত্যকায় নেমে উযূ করলেন এবং সূর্যাস্তের পর ‘আসর সালাত আদায় করলেন, অতঃপর মাগরিবের সালাত আদায় করলেন।</b>",
        "bookID": "12.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 108310,
        "last_updated": null
    },
    {
        "banglaURN": 6009460,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": null,
        "babNumber": 772,
        "babName": null,
        "hadithNumber": 946,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আহযাব যুদ্ধ হতে ফিরার পথে আমাদেরকে বললেন, বনূ কুরাইযাহ এলাকায় পৌঁছার পূর্বে কেউ যেন ‘আসর সালাত আদায় না করে। কিন্তু অনেকের রাস্তাতেই আসরের সময় হয়ে গেল, তখন তাদের কেউ কেউ বললেন, আমরা সেখানে না পৌঁছে সালাত আদায় করব না। আবার কেউ কেউ বললেন, আমরা সালাত আদায় করে নেব, আমাদের নিষেধ করার এ উদ্দেশ্য ছিল না (বরং উদ্দেশ্য ছিল তাড়াতাড়ি যাওয়া) নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর নিকট এ কথা উল্লেখ করা হলে, তিনি তাঁদের কারোর ব্যাপারে কড়াকড়ি করেননি।</b>",
        "bookID": "12.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 108320,
        "last_updated": null
    },
    {
        "banglaURN": 6009470,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": null,
        "babNumber": 773,
        "babName": null,
        "hadithNumber": 947,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্‌নু মালিক (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) (একদিন) ফজরের সালাত অন্ধকার থাকতে আদায় করলেন। অতঃপর সওয়ারীতে আরোহণ করলেন এবং বললেনঃ আল্লাহ আক্‌বার, খায়বার ধ্বংস হোক! যখন আমরা কোন সম্প্রদায়ের এলাকায় অবতরণ করি তখন সতর্কীকৃতদের প্রভাত হয় কতই না মন্দ! তখন তারা (ইয়াহূদীরা) বের হয়ে গলির মধ্যে দৌড়াতে লাগল এবং বলতে লাগল, মুহাম্মাদ ও তাঁর খামীস এসে গেছে। বর্ণনাকারী বলেন, খামীস হচ্ছে সৈন্য-সামন্ত। পরে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাদের উপর জয়লাভ করেন। তিনি যোদ্ধাদের হত্যা করলেন এবং নারী-শিশুদের বন্দী করলেন। তখন সফিয়্যাহ প্রথম দিহ্‌ইয়া কালবীর এবং পরে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর অংশে পড়ল। অতঃপর তিনি তাঁকে বিয়ে করেন এবং তাঁর মুক্তিদানকে মাহ্‌ররূপে গণ্য করেন। ‘আবদুল ‘আযীয (রহঃ) সাবিত (রাঃ)-এর নিকট জানতে চাইলেন, তাঁকে কি মোহর দেয়া হয়েছিল? তা কি আপনি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে জিজ্ঞেস করেছিলেন? তিনি বললেন, তাঁর মুক্তিই তাঁর মোহর, আর মুচ্‌কি হাসলেন।</b>",
        "bookID": "12.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 108330,
        "last_updated": null
    }
]