[
    {
        "banglaURN": 6012370,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 649,
        "babName": null,
        "hadithNumber": 1237,
        "hadithSanad": "",
        "hadithText": "আবূ যার্‌ (গিফারী) (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ একজন আগন্তুক [জিব্‌রীল (আঃ)] আমার প্রতিপালকের নিকট হতে এসে আমাকে খবর দিলেন অথবা তিনি বলেছেন, আমাকে সুসংবাদ দিলেন, আমার উম্মাতের মধ্যে যে ব্যক্তি আল্লাহর সঙ্গে কাউকে শরীক না করা অবস্থায় মারা যাবে, সে জান্নাতে প্রবেশ করবে। আমি বললাম, যদিও সে যিনা করে এবং যদিও সে চুরি করে থাকে? তিনি বললেনঃ যদিও সে যিনা করে থাকে এবং যদিও সে চুরি করে থাকে। [২]</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 111260,
        "last_updated": null
    },
    {
        "banglaURN": 6012380,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 649,
        "babName": null,
        "hadithNumber": 1238,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্ ইব্‌নু মাস'ঊদ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন; আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ যে আল্লাহর সঙ্গে শির্‌ক করা অবস্থায় মারা যায়, সে জাহান্নামে প্রবেশ করবে। আমি বললাম, যে আল্লাহর সঙ্গে কোন কিছুর শির্‌ক না করা অবস্থায় মারা যায়, সে জান্নাতে প্রবেশ করবে।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 111270,
        "last_updated": null
    },
    {
        "banglaURN": 6012390,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 650,
        "babName": null,
        "hadithNumber": 1239,
        "hadithSanad": "",
        "hadithText": "বারা’আ ইব্‌নু ‘আযিব (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সাতটি বিষয়ে আমাদের নির্দেশ দিয়েছেন এবং সাতটি বিষয়ে আমাদের নিষেধ করেছেন। তিনি আমাদের নির্দেশ দিয়েছেন- ১. জানাযার অনুগমন করতে, ২. রুগ্ন ব্যক্তির খোঁজ-খবর নিতে, ৩. দা'ওয়াত দাতার দা'ওয়াত গ্রহণ করতে, ৪. মাযলূমকে সাহায্য করতে, ৫. কসম হতে দায়মুক্ত করতে, ৬. সালামের জবাব দিতে এবং ৭. হাঁচিদাতাকে (ইয়ারহামুকাল্লাহু বলে) সন্তুস্ট করতে। আর তিনি নিষেধ করেছেন- ১. রৌপ্যের পাত্র [১] ,২. স্বর্ণের আংটি, ৩. রেশম, ৪. দীবাজ, ৫. কাস্‌সী (কেস্‌ রেশম), ৬. ইস্‌তিব্‌রাক (তসর জাতীয় রেশম) [২] ব্যবহার করতে। [৩]</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 111280,
        "last_updated": null
    },
    {
        "banglaURN": 6012400,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 650,
        "babName": null,
        "hadithNumber": 1240,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে আমি বলতে শুনেছি যে, এক মুসলিমের প্রতি অপর মুসলিমের হক্‌ পাঁচটিঃ ১. সালামের জবাব দেয়া, ২. অসুস্থ ব্যক্তির খোঁজ-খবর নেয়া, ৩. জানাযার পশ্চাদানুসরণ করা, ৪. দা'ওয়াত কবূল করা এবং ৫. হাঁচিদাতাকে খুশী করা (আল-হামদু লিল্লাহর জবাবে ইয়ারহামুকাল্লাহ বলা)। \nআবদুর রায্‌যাক (রহঃ)  ‘আমর ইব্‌নু আবূ সালামা (রহঃ)-এর অনুসরণ করেছেন। আবদুর রায্‌যাক (রহঃ)  বলেন, আমাকে মা’মার (রহঃ)  -এরূপ অবহিত করেছেন এবং এ হাদীস সালামা (রহঃ)  ‘উকাইল (রহঃ)  হতে রিওয়ায়াত করেছেন। (</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 111290,
        "last_updated": null
    },
    {
        "banglaURN": 6012410,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 651,
        "babName": null,
        "hadithNumber": 1241,
        "hadithSanad": "",
        "hadithText": "আবূ সালামা (রহঃ) থেকে বর্ণিতঃ নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সহধর্মিণী ‘আয়িশা (রাঃ) আমাকে বলেছেন, (রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর মৃত্যুর খবর পেয়ে) আবূ বকর (রাঃ) 'সুন্হ' -এ অবস্থিত তাঁর বাড়ি হতে ঘোড়ায় চড়ে এলেন এবং নেমে মসজিদে প্রবেশ করলেন। সেখানে লোকজনদের সঙ্গে কোন কথা না বলে ‘আয়িশা (রাঃ)-এর ঘরে প্রবেশ করে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর দিকে অগ্রসর হলেন। তখন তিনি একখানি ‘হিবারাহ’ ইয়ামানী চাদরে আবৃত ছিলেন। আবূ বকর (রাঃ) নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর মুখমন্ডল উন্মুক্ত করে তাঁর উপর ঝুকে পড়লেন এবং চুমু খেলেন, অতঃপর ক্রন্দন করতে লাগলেন এবং বললেন, হে আল্লাহর নবী ! আমার পিতা আপনার জন্য কুরবান হোক! আল্লাহ্‌ আপনার জন্য দুই মৃত্যু একত্র করবেন না। তবে যে মৃত্যু আপনার জন্য অবধারিত ছিল তা তো আপনি কবূল করেছেন।\n\nআবূ সালামা (রহঃ)  বলেন, ‘আবদুল্লাহ্‌ ইব্‌নু ‘আব্বাস (রাঃ) আমাকে খবর দিয়েছিলেন যে, (তারপর) আবূ বকর (রাঃ) বাহিরে এলেন। তখন ‘উমর (রাঃ) লোকজনের সাথে বাক্যালাপ করছিলেন। আবূ বকর (রাঃ) তাঁকে বললেন, বসে পড়ুন। তিনি তা মানলেন না। আবূ বকর (রাঃ) তাঁকে বললেন, বসে পড়ুন, তিনি তা মানলেন না। তখন আবূ বকর (রাঃ) কালিমা-ই-শাহাদাতের দ্বারা (বক্তব্য) আরম্ভ করলেন। লোকেরা ‘উমর (রাঃ)-কে ছেড়ে তাঁর দিকে আকৃষ্ট হন। আবূ বকর (রাঃ) বললেন.....আম্‌মা বা'দু , তোমাদের মাঝে যারা মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর ইবাদত করতে, মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সত্যই মারা গেছেন। আর যারা মহান আল্লাহর ইবাদত করতে, নিশ্চয় আল্লাহ্‌ চিরঞ্জীব, অমর। মহান আল্লাহ্‌ ইরশাদ করেনঃ \n\nوَمَا مُحَمَّدٌ الَّا رَسُوْلُ اِلى الشَّاكِرِينَ\t \n\n(যার অর্থ) মুহাম্মাদ একজন রসূল মাত্র আর কিছু নন। তার পূর্বেও অনেক রসূল চলে গেছেন। অতএব যদি তিনি মারা যান অথবা নিহত হন তাহলে কি তোমরা পায়ের গোড়ালিতে ভর করে পেছনে ফিরে যাবে? আর যদি কেউ সেরূপ পেছনে ফিরেও যায়, তবে সে কখনও আল্লাহর বিন্দুমাত্র ক্ষতি করতে পারবে না। আল্লাহ অতি সত্বর কৃতজ্ঞদের পুরস্কার দিবেন-(আল-ইমরানঃ ১৪৪)। আল্লাহর কসম, মনে হচ্ছিল যেন আবূ বকর (রাঃ)-এর তিলওয়াত করার পূর্বে লোকদের জানাই ছিল না যে, আল্লাহ্‌ তা'আলা এ আয়াত নাযিল করেছেন। এখনই যেন লোকেরা আয়াতখানি তার কাছ থেকে পেলেন। প্রতিটি মানুষকেই তখন ঐ আয়াত তিলায়াত করতে শোনা গেল।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 111301,
        "last_updated": null
    },
    {
        "banglaURN": 6012421,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "",
        "babNumber": 651,
        "babName": null,
        "hadithNumber": 1242,
        "hadithSanad": "",
        "hadithText": "আনসারী মহিলা ও নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট বাই’আতকারী উম্মুল ‘আলা (রাঃ) থেকে বর্ণিতঃ (মদীনায় হিজরতের পর) লটারীর মাধ্যমে মুহাজিরদের বন্টন করা হচ্ছিল। তাতে ‘উসমান ইবনু মায’উন (রাঃ) আমাদের অংশে পড়লেন, আমরা (সাদরে) তাঁকে আমাদের গৃহে স্থান দিলাম। এক সময়ে তিনি সেই রোগে আক্রান্ত হলেন, যাতে তাঁর মৃত্যু হল। যখন তাঁর মৃত্যু হল এবং তাঁকে তাঁকে গোসল করিয়ে কাফনের কাপড় পরানো হল, তখন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) প্রবেশ করলেন। তখন আমি বললাম, হে আবাস্-সায়িব! আপনার উপর আল্লাহর রহমত বর্ষিত হোক! আপনার ব্যাপারে আমার সাক্ষ্য এই যে, আল্লাহ্ আপনাকে সম্মানিত করেছেন। তখন নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ তুমি কি করে জানলে যে, আল্লাহ্ তাকে সম্মানিত করেছেন? আমি বললাম, আমার পিতা আপনার জন্য কুরবান, হে আল্লাহর রসূল! তাহলে আল্লাহ্ আর কাকে সম্মানিত করবেন? আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ তার ব্যাপার তো এই যে, নিশ্চয় তাঁর মৃত্যু হচ্ছে এবং আল্লাহর কসম! আমি তার জন্য কল্যাণ কামনা করি। আল্লাহর কসম! আমি জানি না আমার সঙ্গে কেমন ব্যবহার করা হবে, অথচ আমি আল্লাহর রসূল। সেই আনসারী মহিলা বলেন, আল্লাহর কসম! অতঃপর এরপর হতে কোন দিন আমি কোন ব্যক্তিকে সম্বন্ধে পবিত্র বলে মন্তব্য করব না।\n\n-----------------\n\n১২৪৩/১. সা’ঈদ ইবনু ‘উফাইর (রহঃ)  লায়স (রহঃ)  সুত্রে ঐরূপ বর্ণনা করেন। আর নাফি’ ইবনু  ইয়াযীদ (রহঃ)  ‘উকাইল (রহঃ)  সূত্রে বলেন। তার সঙ্গে কেমন ব্যবহার করা হবে? [১] শু’য়াইব, ‘আমর ইবনু দীনার ও মা’মার (রহঃ)  ‘উকাইল (রহঃ)-কে সমর্থন করেছেন। (২৬৮৭, ৩৯২৯, ৭০০৩, ৭০০৪, ৭০১৮) (ই.ফা. ১১৭১)</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 111321,
        "last_updated": null
    },
    {
        "banglaURN": 6012491,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "",
        "babNumber": 654,
        "babName": "",
        "hadithNumber": 1249,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ (রাঃ) থেকে বর্ণিতঃ মহিলাগণ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) –এর নিকট নিবেদন করলেন, আমাদের জন্য একটি দিন নির্দিষ্ট করে দিন। অতঃপর তিনি একদা তাদের ওয়ায-নসীহত করলেন এবং বললেনঃ যে স্ত্রীলোকের তিনটি সন্তান মারা যায়, তারা তার জন্য জাহান্নামের প্রতিবন্ধক হবে। তখন এক মহিলা প্রশ্ন করলেন, দু’টি সন্তান মারা গেলে? তিনি বললেন, দু’টি সন্তান মারা গেলেও।\n\nআবূ সা’ঈদ ও আবূ হুরায়রা (রাঃ) সূত্রে নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ আবূ হুরায়রা (রাঃ) বলেন, যারা বালিগ হয়নি।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 111391,
        "last_updated": null
    },
    {
        "banglaURN": 6012581,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "",
        "babNumber": 661,
        "babName": "",
        "hadithNumber": 1258,
        "hadithSanad": "",
        "hadithText": "উম্মু আতিয়্যা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কন্যাগণের একজনের ইন্‌তিকাল হল। নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সেখানে গেলেন এবং বললেনঃ তোমরা তাঁকে তিনবার, পাঁচবার অথবা প্রয়োজন মনে করলে তার চেয়ে অধিকবার বরই পাতাসহ পানি দ্বারা গোসল দাও। শেষবারে কর্পূর (অথবা তিনি বলেন) ‘কিছু কর্পূর’ ব্যবহার করবে। গোসল শেষ করে আমাকে জানাবে। উম্মু আতিয়্যা (রাঃ) বলেন, আমরা শেষ করে তাঁকে জানালাম। তখন তিনি তাঁর চাদর আমাদের দিকে এগিয়ে দিয়ে বললেনঃ এটি তাঁর ভিতরের কাপড় হিসেবে পরাও। আইয়ুব (রহঃ)  হাফসা (রহঃ)-এর সূত্রে উম্মু আতিয়্যা (রাঃ) একইভাবে বর্ণনা করেন।\n\nউম্মু আতিয়্যা (রাঃ) থেকে বর্ণিতঃ তিনি ইরশাদ করেছিলেনঃ তাঁকে তিন, পাঁচ, সাতবার প্রয়োজনে তার চেয়ে অধিকবার গোসল দাও। হাফসা (রহঃ) বলেন, উম্মু আতিয়্যা (রাঃ) বলেন, আমরা তাঁর মাথার চুলে তিনটি গোছা (বেনী) [৮] বানিয়ে দিলাম।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 111481,
        "last_updated": null
    },
    {
        "banglaURN": 6012440,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 651,
        "babName": null,
        "hadithNumber": 1244,
        "hadithSanad": "",
        "hadithText": "জাবির ইব্‌নু ‘আব্দুল্লাহ্‌ (আঃ) থেকে বর্ণিতঃ তিনি বলেন, (উহুদ যুদ্ধে) আমার পিতা আব্দুল্লাহ্‌ (রাঃ) শহীদ হয়ে গেলে আমি তাঁর মুখমন্ডল হতে কাপড় সরিয়ে ক্রন্দন করতে লাগলাম। লোকজন আমাকে নিষেধ করতে লাগল। কিন্তু নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাকে নিষেধ করেননি। আমার ফুফী ফাতিমা (রাঃ) ও ক্রন্দন করতে লাগলেন। এতে নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, তুমি কাঁদ বা না-ই কাঁদ (উভয় সমান) তোমরা তাকে তুলে নেয়া পর্যন্ত ফেরেশতাগণ তাঁদের ডানা দিয়ে ছায়া বিস্তার করে রেখেছেন। ইব্‌নু জুরাইজ (রহঃ)  মুহাম্মাদ ইব্‌নু মুন্‌কাদির (রহঃ)  সূত্রে জাবির (রাঃ) হতে হাদীস বর্ণনায় শু’বা (রাঃ) এর অনুসরণ করেছেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 111340,
        "last_updated": null
    },
    {
        "banglaURN": 6012450,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 652,
        "babName": null,
        "hadithNumber": 1245,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নাজাশী যেদিন মারা যান সেদিন-ই আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁর মৃত্যুর খবর দেন এবং জানযার স্থানে গিয়ে লোকদের কাতারবন্দী করে চার তাকবীর আদায় করলেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 111350,
        "last_updated": null
    },
    {
        "banglaURN": 6012460,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 652,
        "babName": null,
        "hadithNumber": 1246,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্‌নু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) (মূতা যুদ্ধের অবস্থা বর্ণনায়) বললেনঃ যায়দ (রাঃ) পতাকা বহন করেছে অতঃপর শহীদ হয়েছে। অতঃপর জা'ফর (রাঃ) (পতাকা) হাতে নিয়েছে, সেও শহীদ হয়। অতঃপর 'আব্দুল্লাহ্‌ ইব্‌নু রাওয়াহা (রাঃ) (পতাকা) ধারণ করে এবং সেও শহীদ হয়। এ খবর বলছিলেন এবং আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর দু'চোখ দিয়ে অশ্রু প্রবাহিত হচ্ছিল। অতঃপর খালিদ ইব্‌নু ওয়ালিদ (রাঃ) পরামর্শ ছাড়াই (পতাকা) হাতে তুলে নেন এবং তাঁর দ্বারাই বিজয় লাভ হয়।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 111360,
        "last_updated": null
    },
    {
        "banglaURN": 6012470,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 653,
        "babName": null,
        "hadithNumber": 1247,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, এক ব্যক্তি মারা গেল। যার অসুস্থতার সময় আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) খোঁজ-খবর রাখতেন। তার মৃত্যু হয় এবং রাতেই লোকেরা তাঁকে দাফন করেন। সকাল হলে তাঁরা (এ বিষয়ে) নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে খবর দেন। তিনি বললেনঃ আমাকে খবর দিতে তোমাদের কিসে বাধা দিল? তাঁরা বলল, তখন ছিল রাত এবং গাঢ় অন্ধকার। তাই আপনাকে কস্ট দেয়া আমরা পছন্দ করিনি। তিনি ঐ ব্যক্তির কবরের নিকট গেলেন এবং তাঁর জন্য সালাতে জানাযা আদায় করলেন। [৬]</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 111370,
        "last_updated": null
    },
    {
        "banglaURN": 6012480,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 654,
        "babName": null,
        "hadithNumber": 1248,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ কোন মুসলিমের তিনটি সন্তান সাবালিগ হবার পূর্বে মারা গেলে তাদের প্রতি তাঁর রহমত সরূপ অবশ্যই আল্লাহ্‌ তা'আলা ঐ ব্যক্তিকে জান্নাতে প্রবেশ করাবেন। [৭]</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 111380,
        "last_updated": null
    },
    {
        "banglaURN": 6012510,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 654,
        "babName": null,
        "hadithNumber": 1251,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ কোন মুসলিমের তিনটি (নাবালিগ) সন্তান মারা গেল, তবুও জাহান্নামে প্রবেশ করবে,এমন হবে না। তবে কেবল কসম পূর্ণ হবার পরিমাণ পর্যন্ত। আবূ ‘আবদুল্লাহ্‌ ইমাম বুখারী (রহঃ)  বলেন, আল্লাহ্‌ তা’আলা ইরশাদ করেনঃ  وَاِنْ مِنْكُمْ الَّا وَارِدْهَا “তোমাদের প্রত্যেককেই তা অতিক্রম করতে হবে।”</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 111410,
        "last_updated": null
    },
    {
        "banglaURN": 6012520,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 655,
        "babName": null,
        "hadithNumber": 1252,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্‌নু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) একটি কবরের নিকট উপস্থিত এক মহিলার পার্শ্ব দিয়ে যাচ্ছিলেন, সে তখন ক্রন্দন করছিল। তখন তিনি বললেনঃ আল্লাহ্‌কে ভয় কর এবং ধৈর্য ধর।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 111420,
        "last_updated": null
    },
    {
        "banglaURN": 6012530,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 656,
        "babName": null,
        "hadithNumber": 1253,
        "hadithSanad": "",
        "hadithText": "উম্মু আতিয়্যা আনসারী (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কন্যা যায়নাব (রাঃ) ইন্‌তিকাল করলে তিনি আমাদের নিকট এসে বললেনঃ তোমরা তাঁকে তিনবার বা পাঁচবার বা প্রয়োজন মনে করলে তাঁর চেয়ে অধিকবার বরই পাতাসহ পানি দিয়ে গোসল দাও। শেষবারে কর্পূর বা (তিনি বলেছেন) কিছু কর্পূর ব্যবহার করবে। তোমরা শেষ করে আমাকে খবর দাও। আমারা শেষ করার পর তাঁকে জানালাম। তখন তিনি তাঁর চাদরখানি আমাদেরকে দিয়ে বললেনঃ এটি তাঁর শরীরের সঙ্গে জড়িয়ে দাও।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 111430,
        "last_updated": null
    },
    {
        "banglaURN": 6012540,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 657,
        "babName": null,
        "hadithNumber": 1254,
        "hadithSanad": "",
        "hadithText": "উম্মু আতিয়্যা আনসারী (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কন্যা যায়নাব (রাঃ) ইন্‌তিকাল করলে তিনি আমাদের নিকট এসে বললেনঃ তোমরা তাঁকে তিনবার বা পাঁচবার বা প্রয়োজন মনে করলে তার চেয়ে অধিকবার বরই পাতাসহ পানি দ্বারা গোসল দাও। শেষবার কর্পূর বা (তিনি বলেছেন) কিছু কর্পূর ব্যবহার করবে। তোমরা শেষ করে আমাকে জানাও। আমরা শেষ করার পর তাঁকে জানালাম। তখন তিনি তাঁর চাদরখানি আমাদের দিকে দিয়ে বললেনঃ এটি তাঁর ভিতরের কাপড় হিসেবে পরিয়ে দাও। আইয়ুব (রহঃ)  বলেছেন, হাফসা (রহঃ)  আমাকে মুহাম্মাদ বর্ণিত হাদীসের ন্যায় হাদীস শুনিয়েছেন। তবে তাঁর হাদীসে আছে যে, তাকে বিজোড় সংখ্যায়  গোসল দিবে। আরও আছে, তিনবার, পাঁচবার অথবা সাতবার কর; তাতে আরো আছে, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ “তোমরা তার ডান দিক হতে এবং তার উযূর স্থানগুলো থেকে আরম্ভ করবে।” তাতে, এ কথাও আছে। (বর্ণনাকারিণী) উম্মু আতিয়্যা (রাঃ) বলেছেন, আমরা তার চুলগুলো আঁচড়ে তিনটি গোছা করে দিলাম।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 111440,
        "last_updated": null
    },
    {
        "banglaURN": 6012550,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 658,
        "babName": null,
        "hadithNumber": 1255,
        "hadithSanad": "",
        "hadithText": "উম্মু আতিয়্যা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁর কন্যার গোসলের ব্যাপারে ইরশাদ করেনঃ তোমরা তাঁর ডান দিক হতে এবং উযূর অঙ্গসমূহ হতে শুরু করবে।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 111450,
        "last_updated": null
    },
    {
        "banglaURN": 6012560,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 659,
        "babName": null,
        "hadithNumber": 1256,
        "hadithSanad": "",
        "hadithText": "উম্মু আতিয়্যা  (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কন্যা [যায়নাব (রাঃ)]-এর গোসল দিতে যাচ্ছিলাম, গোসল দেয়ার সময় তিনি আমাদের বলেনঃ তোমরা তাঁর ডান দিক হতে এবং উযূর স্থানগুলো হতে শুরু করবে।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 111460,
        "last_updated": null
    },
    {
        "banglaURN": 6012570,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 660,
        "babName": null,
        "hadithNumber": 1257,
        "hadithSanad": "",
        "hadithText": "উম্মু আতিয়্যা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)–এর কন্যার ইন্তিকাল হলে তিনি আমাদের বললেনঃ তোমরা তাকে তিনবার, পাঁচবার অথবা তোমরা প্রয়োজন মনে করলে তার চেয়ে অধিকবার গোসল দাও। তোমরা শেষ করে আমাকে জানাবে। আমরা শেষ করে তাকে জানালাম। তখন তিনি তার কোমর হতে চাদর খুলে দিয়ে বললেনঃ এটি তার ভিতরের কাপড় হিসেবে পরিয়ে দাও।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 111470,
        "last_updated": null
    },
    {
        "banglaURN": 6012600,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 662,
        "babName": null,
        "hadithNumber": 1260,
        "hadithSanad": "",
        "hadithText": "উম্মু আতিয়্যা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) –এর কন্যার মাথার চুল তিনটি বেণী করেছেন। তাঁরা তা খুলেছেন, অতঃপর তা ধুয়ে তিনটি বেনী করেছেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 111500,
        "last_updated": null
    },
    {
        "banglaURN": 6012610,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 663,
        "babName": null,
        "hadithNumber": 1261,
        "hadithSanad": "",
        "hadithText": "আইয়ূব (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি ইব্‌নু সীরীন (রহঃ)-কে বলতে শুনেছি যে, আনসারী মহিলা উম্মু আতিয়্যা (রাঃ) আগমন করলেন, যিনি নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট বাই’আতকারীদের একজন। তিনি তাঁর এক ছেলেকে দেখার জন্য বাসরায় এসেছিলেন, কিন্তু তিনি তাকে পাননি। তখন তিনি আমাদের হাদীস শুনালেন। তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাদের নিকট আসলেন, তখন আমরা তাঁর কন্যাকে গোসল দিচ্ছিলাম। তিনি বলেনঃ তোমরা তাঁকে তিনবার, পাঁচবার অথবা প্রয়োজনে তার চেয়ে অধিকবার বরই পাতাসহ পানি দিয়ে গোসল দাও। আর শেষবারে কর্পূর দাও। তোমরা শেষ করে আমাকে জানাবে। তিনি বলেন, আমরা যখন শেষ করলাম, তখন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁর চাদর আমাদের দিকে নিক্ষেপ করে বললেনঃ এটা তাঁর শরীরের সঙ্গে জড়িয়ে দাও। উম্মু আতিয়্যা (রাঃ)-এর অধিক বর্ণনা করেননি। [আইয়ূব (রহঃ)  বলেন] আমি জানি না, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এর কোন কন্যা ছিলেন? তিনি বলেন, - অর্থ শরীরের সঙ্গে জড়িয়ে দাও। ইবনু সীরীন (রহঃ)  মহিলা সম্পর্কে এভাবেই আদেশ করতেন যে, ভিতরের কাপড় শরীরের সঙ্গে জড়িয়ে দিবে, ইজারের মত ব্যবহার করবে না।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 111510,
        "last_updated": null
    },
    {
        "banglaURN": 6012620,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 664,
        "babName": null,
        "hadithNumber": 1262,
        "hadithSanad": "",
        "hadithText": "উম্মু আতিয়্যা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কন্যার মাথায় চুল বেনী পাকিয়ে দিয়েছিলাম, অর্থাৎ তিনটি বেনী। ওয়াকী’ (রহঃ)  বলেন, সুফিয়ান (রহঃ)  বলেছেন, মাথার সামনে একটি বেনী এবং দু’পাশে দু'টি বেনী।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 111520,
        "last_updated": null
    },
    {
        "banglaURN": 6012630,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 665,
        "babName": null,
        "hadithNumber": 1263,
        "hadithSanad": "",
        "hadithText": "উম্মু আতিয়্যা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কন্যাগণের একজনের ইন্‌তিকাল হলে তিনি আমাদের নিকট এসে বললেনঃ তোমরা তাঁকে বরই পাতার পানি দিয়ে বিজোড় সংখ্যক তিনবার, পাঁচবার অথবা প্রয়োজনবোধ করলে আরও অধিকবার গোসল দাও। শেষবারে কর্পূর অথবা তিনি বলেছিলেন কিছু কর্পূর ব্যবহার করবে। তোমরা গোসল শেষ করে আমাকে জানাবে। আমরা শেষ করে তাঁকে জানালাম। তখন তিনি তাঁর চাদর আমাদের দিকে এগিয়ে দিলেন, আমরা তাঁর মাথার চুলগুলো তিনটি বেনী করে পিছনের দিকে ছেড়ে দিলাম।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 111530,
        "last_updated": null
    },
    {
        "banglaURN": 6012640,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 666,
        "babName": null,
        "hadithNumber": 1264,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে তিনটি ইয়ামানী সাহুলী সাদা সূতী বস্ত্র দ্বারা কাফন দেয়া হয়েছিল। তার মধ্যে কামীস এবং পাগড়ী ছিল না।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 111540,
        "last_updated": null
    },
    {
        "banglaURN": 6012650,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 667,
        "babName": null,
        "hadithNumber": 1265,
        "hadithSanad": "",
        "hadithText": "‘আব্দুল্লাহ্‌ ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, এক ব্যক্তি আরাফাতে ওয়াকূফ অবস্থায় অকস্মাৎ তার উটনী হতে পড়ে যায়। এতে তাঁর ঘাড় মটকে গেল অথবা রাবী বলেছেন, তাঁর ঘাড় মটকে দিল। (যাতে সে মারা গেল)। তখন নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ তাঁকে বরই পাতাসহ পানি দিয়ে গোসল দাও এবং দু’ কাপড়ে তাঁকে কাফন দাও। তাঁকে সুগন্ধি লাগাবে না এবং তাঁর মস্তক আবৃত করবে না। কেননা, কিয়ামাতের দিবসে সে তালবিয়া [১] পাঠরত অবস্থায় উত্থিত হবে।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 111550,
        "last_updated": null
    },
    {
        "banglaURN": 6012660,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 668,
        "babName": null,
        "hadithNumber": 1266,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, এক ব্যক্তি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সঙ্গে আরাফাতে ওয়াকূফ কালে অকস্মাৎ সে তার সওয়ারী হতে পড়ে যান। যার ফলে তাঁর ঘাড় মটকে গেল অথবা রাবী বলেন, ঘাড় মটকে দিল। (যাতে তিনি মারা গেলেন)। তখন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ তাঁকে বরই পাতাসহ পানি দিয়ে গোসল দাও এবং দু’ কাপড়ে তাঁকে কাফন দাও; তাঁকে সুগন্ধি লাগাবে না এবং তাঁর মস্তক আবৃত করবে না। কেননা, আল্লাহ্‌ তা'আলা কিয়ামতের দিন তাঁকে তালবিয়া পাঠরত অবস্থায় উত্থিত করবেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 111560,
        "last_updated": null
    },
    {
        "banglaURN": 6012670,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 669,
        "babName": null,
        "hadithNumber": 1267,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ এক ব্যক্তির উট তার ঘাড় মটকে দিল। (ফলে সে মারা গেল)। সে সময় আমরা আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সঙ্গে ছিলাম। ঐ ব্যক্তি ছিল ইহ্‌রাম অবস্থায়। তখন নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ তাকে বরই পাতাসহ পানি দিয়ে গোসল দাও এবং দু’ কাপড়ে তাকে কাফন দাও। তাকে সুগন্ধি লাগাবে না এবং তার মস্তক আবৃত করো না। কেননা, আল্লাহ্‌ তা’আলা কিয়ামাতের দিন তাকে মুলাব্বি [১] (অর্থাৎ ইহরামরত) অবস্থায় উত্থিত করবেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 111570,
        "last_updated": null
    },
    {
        "banglaURN": 6012680,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 669,
        "babName": null,
        "hadithNumber": 1268,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, এক ব্যক্তি নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সঙ্গে আরাফাতে অবস্থান করছিলেন। সে তার সওয়ারী হতে পতিত হলেন। (পরবর্তী অংশের বর্ণনায়) আইয়ুব (রহঃ) বলেন, ‘فوقمصته’ তার ঘাট মট্‌কে দিল। আর আমর  (রহঃ)  বলেন,  ‘فاقمصته’ তাকে দ্রুত মৃত্যুমুখে ঠেলে দিল। যার ফলে তিনি মারা গেলেন। তখন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, তাঁকে বরই পাতাসহ পানি দিয়ে গোসল দাও এবং দু’ কাপড়ে তাকে কাফন দাও। তাঁকে সুগন্ধি লাগাবে না এবং তাঁর মস্তক আবৃত করবে না। কারণ, তাঁকে কিয়ামত দিবসে উত্থিত করা হবে এ অবস্থায় যে, আইয়ুব (রহঃ)  বলেছেন, ‘সে তালবিয়া পাঠ করছে’ আর ‘আমর (রহঃ)  বলেন, সে তালবিয়া পাঠরত।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 111580,
        "last_updated": null
    },
    {
        "banglaURN": 6012690,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 670,
        "babName": null,
        "hadithNumber": 1269,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ ‘আবদুল্লাহ্‌ ইব্‌নু ‘উবাই (মুনাফিক সর্দার)-এর মৃত্যু হলে তার পুত্র (যিনি সাহাবী ছিলেন) নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট এসে বললেন, আপনার জামাটি আমাকে দান করুন। আমি সেটা দিয়ে আমার পিতার কাফন পরাতে ইচ্ছা করি। আর আপনি তার জানাযা পড়বেন এবং তার জন্য মাগফিরাত কামনা করবেন। নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) নিজের জামাটি তাঁকে দিয়ে দিলেন এবং বললেনঃ আমাকে খবর দিও, আমি তার জানাযা আদায় করব। তিনি তাঁকে খবর দিলেন। যখন নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তার জানাযা আদায়ের ইচ্ছা করলেন, তখন ‘উমর (রাঃ) তাঁর দৃষ্টি আকর্ষণ করে বললেন, আল্লাহ্‌ কি আপনাকে মুনাফিকদের জানাযা আদায় করতে নিষেধ করেননি? তিনি বললেনঃ আমাকে তো দু’টির মধ্যে কোন একটি করার ইখ্‌তিয়ার দেয়া হয়েছে। আল্লাহ্‌ তা’আলা বলেছেনঃ (যার অর্থ) “আপনি তাদের (মুনাফিকদের) জন্য মাগফিরাত কামনা করুন বা মাগফিরাত কামনা না-ই করুন (একই কথা) আপনি যদি সত্তর বারও তাদের জন্য মাগফিরাত কামনা করেন; কখনো আল্লাহ্‌ তাদের ক্ষমা করবেন না-” (আত্‌তাওবাঃ ৮০)। কাজেই তিনি তার জানাযা পড়লেন, অতঃপর নাযিল হলঃ (যার অর্থ) “তাদের কেউ মৃত্যুবরণ করলে আপনি তাদের জানাযা কক্ষণও আদায় করবেন না।” (আত্‌-তাওবাঃ ৮৪)</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 111590,
        "last_updated": null
    },
    {
        "banglaURN": 6012700,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 670,
        "babName": null,
        "hadithNumber": 1270,
        "hadithSanad": "",
        "hadithText": "জাবীর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, ‘আবদুল্লাহ্‌ ইব্‌নু উবাইকে দাফন করার পর নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তার (কবরের) নিকট এলেন এবং তাকে বের করলেন। অতঃপর তার উপর থুথু দিলেন, আর নিজের জামাটি তাকে পরিয়ে দিলেন। [১০]</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 111600,
        "last_updated": null
    },
    {
        "banglaURN": 6012710,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 671,
        "babName": null,
        "hadithNumber": 1271,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে তিনখানা সুতী সাদা সাহুলী (ইয়ামানী) কাপড়ে কাফন দেয়া হয়েছিল, তার মধ্যে কামীস এবং পাগড়ী ছিল না।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 111610,
        "last_updated": null
    },
    {
        "banglaURN": 6012720,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 671,
        "babName": null,
        "hadithNumber": 1272,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে তিনখানা কাপড় দিয়ে কাফন দেয়া হয়েছিল, তাতে জামা ও পাগড়ী ছিলনা। আবূ ‘আবদুল্লাহ্‌ (রহঃ)  বলেন, আবূ নু‘আইম (রহঃ)  ‘ثلاثة’ - শব্দটি বলেননি। আর ‘আবদুল্লাহ্‌ ইব্‌নু ওয়ালীদ (রহঃ)  হতে হাদীস বর্ণনায় ‘ثلاثة’- শব্দটি বলেছেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 111620,
        "last_updated": null
    },
    {
        "banglaURN": 6012730,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 672,
        "babName": null,
        "hadithNumber": 1273,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে তিনখানা সাদা সাহুলী কাপড় দিয়ে কাফন দেয়া হয়েছিল, যার মধ্যে কোন কামীস ও পাগড়ী ছিলনা।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 111630,
        "last_updated": null
    },
    {
        "banglaURN": 6012740,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 673,
        "babName": null,
        "hadithNumber": 1274,
        "hadithSanad": "",
        "hadithText": "সা’দ (রহঃ)-এর পিতা থেকে বর্ণিতঃ তিনি বলেন, একদা ‘আবদুর রহমান ইব্‌নু ‘আওফ (রাঃ)-কে খাবার দেয়া হল। তখন তিনি বললেন, মুস্‌‘আব ইব্‌নু উমাইর (রাঃ) শহীদ হলেন আর তিনি আমার চেয়ে শ্রেষ্ঠ ছিলেন অথচ তাঁর কাফনের জন্য একটি চাদর ছাড়া আর কিছুই পাওয়া যায়নি। হামযাহ (রাঃ) বা অপর এক ব্যক্তি শহীদ হলেন, তিনিও ছিলেন আমার চেয়ে শ্রেষ্ঠ, অথচ তাঁর কাফনের জন্যও একটি চাদর ছাড়া আর কিছুই পাওয়া যায়নি। তাই আমার ভয় হয়, আমাদের নেক আমলের বিনিময়ে আমাদের এ পার্থিব জীবনে পূর্বেই দেয়া হল। অতঃপর তিনি কাঁদতে লাগলেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 111640,
        "last_updated": null
    },
    {
        "banglaURN": 6012750,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 674,
        "babName": null,
        "hadithNumber": 1275,
        "hadithSanad": "",
        "hadithText": "ইব্‌রাহীম (রহঃ) থেকে বর্ণিতঃ একদা ‘আবদুর রহমান ইব্‌নু ‘আওফ (রাঃ)-কে খাদ্য পরিবেশন করা হল, তখন তিনি সিয়াম পালন করছিলেন। তিনি বললেন, মুস‘আব ইব্‌নু উমাইর (রাঃ) শহীদ হলেন। তিনি ছিলেন, আমার চেয়ে শ্রেষ্ঠ। (অথচ) তাঁকে এমন একটি চাদর দিয়ে কাফন দেয়া হল যে, তাঁর মাথা ঢাকলে তাঁর দু’ পা বাইরে থাকে আর দু’ পা ঢাকলে মাথা বাইরে থাকে। (বর্ণনাকারী বলেন) আমার মনে পড়ে, তিনি আরও বলেছিলেন, হামযাহ (রাঃ) শহীদ হলেন। তিনিও ছিলেন আমার চেয়ে শ্রেষ্ঠ। অতঃপর আমাদের জন্য পৃথিবীতে অত্যধিক প্রাচুর্য দেয়া হয়েছে। আশঙ্কা হয় যে, আমাদের নেক ‘আমলগুলো (এর বিনিময়ে) আমাদের পূর্বেই দিয়ে দেয়া হয়েছে। অতঃপর তিনি ক্রন্দন করতে লাগলেন, এমনকি খাদ্যও বর্জন করলেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 111650,
        "last_updated": null
    },
    {
        "banglaURN": 6012760,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 675,
        "babName": null,
        "hadithNumber": 1276,
        "hadithSanad": "",
        "hadithText": "খাব্বার (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সঙ্গে মদীনায় হিজরত করছিলাম, এতে আল্লাহর সন্তুষ্টি কামনা করেছিলাম। আমাদের প্রতিদান আল্লাহর দরবারে নির্ধারিত হয়ে আছে। অতঃপর আমাদের মধ্যে অনেকে শহীদ হয়েছেন। কিন্তু তাঁরা তাঁদের বিনিময়ে কিছুই ভোগ করে যাননি। তাঁদেরই একজন মুস‘আব ইব্‌নু উমাইর (রাঃ) আর আমাদের মধ্যে অনেকে এমনও আছেন যাঁদের প্রতিদানের ফল পরিপক্ক হয়েছে। আর তাঁরা তা ভোগ করছন। মুস‘আব (রাঃ) উহুদের দিন শহীদ হয়েছিলেন। আমরা তাঁকে কাফন দেয়ার জন্য এমন একটি চাদর ব্যতীত আর কিছুই পেলাম না; যা দিয়ে তাঁর মস্তক আবৃত করলে তাঁর দু’ পা বাইরে থাকে আর তাঁর দু’ পা আবৃত করলে তাঁর মস্তক বাইরে থাকে। তখন নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁর মস্তক আবৃত করতে এবং তাঁর দু’খানা পায়ের উপর ইয্‌খির (ঘাস) দিয়ে দিতে আমাদের নির্দেশ দিলেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 111660,
        "last_updated": null
    },
    {
        "banglaURN": 6012770,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 676,
        "babName": null,
        "hadithNumber": 1277,
        "hadithSanad": "",
        "hadithText": "সাহ্‌ল (রাঃ) থেকে বর্ণিতঃ এক মহিলা নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট একখানা বুরদা নিয়ে এলেন যার সাথে ঝালর যুক্ত ছিল। সাহ্‌ল (রাঃ) বললেন, তোমরা জান, বুরদা কী? তারা বলল, চাদর। সাহ্‌ল (রাঃ) বললেন, ঠিকই। মহিলা বললেন, চাদরখানি আমি নিজ হস্তে বয়ন করেছি এবং তা আপনার পরিধানের জন্য নিয়ে এসেছি। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তা গ্রহণ করলেন এবং তাঁর চাদরের প্রয়োজনও ছিল। অতঃপর তিনি তা ইযার হিসেবে পরিধান করে আমাদের সম্মুখে আসলেন। তখন জনৈক ব্যক্তি তার সৌন্দর্য বর্ণনা করে বললেন, বাহ! কত সুন্দর! আমাকে এটি পরিধানের জন্য দান করুন। সাহাবীগন বললেন, তুমি ভাল করনি। নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তা তাঁর প্রয়োজনে পরিধান করেছেন; তবুও তুমি তা চেয়ে বসলে। অথচ তুমি জান যে, তিনি কাউকে বিমুখ করেন না। ঐ ব্যক্তি বলল, আল্লাহর কসম! আমি তা পরিধানের উদ্দেশে চাইনি। আমার চাওয়ার একমাত্র উদ্দেশ্য যেন তা দিয়ে আমার কাফন হয়। সাহ্‌ল (রাঃ) বললেন, অবশেষে তা তাঁর কাফনই হয়েছিল। [১১]</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 111670,
        "last_updated": null
    },
    {
        "banglaURN": 6012780,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 677,
        "babName": null,
        "hadithNumber": 1278,
        "hadithSanad": "",
        "hadithText": "উম্মু আতিয়্যা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, জানাযার পশ্চাদানুগমন করতে আমাদের নিষেধ করা হয়েছে, তবে আমাদের উপর কড়াকড়ি আরোপ করা হয়নি।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 111680,
        "last_updated": null
    },
    {
        "banglaURN": 6012790,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 678,
        "babName": null,
        "hadithNumber": 1279,
        "hadithSanad": "",
        "hadithText": "মুহাম্মাদ ইব্‌নু সীরীন (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, উম্মু আতিয়্যা (রাঃ)-এর এক পুত্রের মৃত্যু হল। তৃতীয় দিবসে তিনি হলুদ বর্ণের সুগন্ধি আনয়ন করিয়ে ব্যবহার করলেন, আর বললেন, স্বামী ব্যতীত অন্য কারো জন্য তিন দিবসের বেশি শোক পালন করতে আমাদেরকে নিষেধ করা হয়েছে।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 111690,
        "last_updated": null
    },
    {
        "banglaURN": 6012800,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 678,
        "babName": null,
        "hadithNumber": 1280,
        "hadithSanad": "",
        "hadithText": "যায়নাব বিন্‌ত আবূ সালামা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, যখন সিরিয়া হতে আবূ সুফিয়ান (রাঃ)-এর মৃত্যুর খবর পৌছল, তার তৃতীয় দিবসে উম্মু হাবীবা (রাঃ) হলুদ বর্ণের সুগন্ধি আনয়ন করলেন এবং তাঁর উভয় গন্ড ও বাহুতে মথিত করলেন। অতঃপর বললেন, অবশ্য আমার এর কোন প্রয়োজন ছিল না, যদি আমি নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে এ কথা বলতে না শুনতাম যে, স্ত্রীলোক আল্লাহ্‌ এবং ক্বিয়ামাতের দিবসের প্রতি ঈমান রাখে তার পক্ষে স্বামী ব্যতীত অন্য কোন মৃত ব্যক্তির জন্য তিন দিনের বেশি শোক পালন করা বৈধ নয়। অবশ্য স্বামীর জন্য সে চার মাস দশ দিন শোক পালন করবে।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 111700,
        "last_updated": null
    },
    {
        "banglaURN": 6012830,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 679,
        "babName": null,
        "hadithNumber": 1283,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্‌নু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এক মহিলার পার্শ্ব দিয়ে যাচ্ছিলেন, যিনি কবরের পার্শ্বে ক্রন্দন করছিলেন। নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ তুমি আল্লাহ্‌কে ভয় কর বং ধৈর্য ধারণ কর। মহিলাটি বললেন, আমার নিকট থেকে প্রস্থান করুন। আপনার উপর তো আমার মত বিপদ উপস্থিত হয়নি। তিনি নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে চিনতে পারেননি। পরে তাকে বলা হল, তিনি তো নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)। তখন তিনি নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর দরজায় উপস্থিত হলেন, তাঁর কাছ কোন প্রহরী ছিল না। তিনি নিবেদন করলেন, আমি আপনাকে চিনতে পারিনি। তিনি বললেনঃ ধৈর্য তো বিপদের প্রাথমিক অবস্থাতেই (ধারণ করতে হয়)। [১৩]</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 111730,
        "last_updated": null
    },
    {
        "banglaURN": 6012840,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 680,
        "babName": null,
        "hadithNumber": 1284,
        "hadithSanad": "",
        "hadithText": "উসামাহ ইব্‌নু যায়দ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর জনৈকা কন্যা (যায়নাব) তাঁর (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) নিকট লোক পাঠালেন যে, আমার এক পুত্র মরণাপন্ন অবস্থায় রয়েছে, তাই আপনি আমাদের নিকট আসুন। তিনি বলে পাঠালেন, (তাঁকে) সালাম দিবে এবং বলবেঃ আল্লাহরই অধিকারে যা কিছু তিনি নিয়ে যান আর তাঁরই অধিকারে যা কিছু তিনি দান করেন। তাঁর নিকট সকল কিছুরই একটি নির্দিষ্ট সময় আছে। কাজেই সে যেন ধৈর্য ধারণ করে এবং সওয়াবের অপেক্ষায় থাকে। তখন তিনি তাঁর কাছে কসম দিয়ে পাঠালেন, তিনি যেন অবশ্যই আগমন করেন। তখন তিনি দন্ডায়মান হলেন এবং তাঁর সাথে ছিলেন সা’দ ইব্‌নু উবাদাহ, মু‘আয ইব্‌নু জাবাল, উবাই ইব্‌নু কা’ব, যাইদ ইব্‌নু সাবিত (রাঃ) এবং আরও কয়েকজন। তখন শিশুটিকে রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছে তুলে দেয়া হল। তখন সে ছটফট করছিল। বর্ণনাকারী বলেন, আমরা ধারনা যে, তিনি এ কথা বলেছিলেন, যেন তার শ্বাস মশকের মত (শব্দ হচ্ছিল)। আর নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর দু’ চক্ষু বেয়ে অশ্রু ঝরছিল। সা’দ (রাঃ) বললেন, হে আল্লাহর রসূল! একি? তিনি বললেনঃ এ হচ্ছে রহমত, যা আল্লাহ্‌ তাঁর বান্দার অন্তরে গচ্ছিত রেখেছেন। আর আল্লাহ্‌ তো তাঁর দয়ালু বান্দাদের প্রতিই দয়া করেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 111740,
        "last_updated": null
    },
    {
        "banglaURN": 6012850,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 680,
        "babName": null,
        "hadithNumber": 1285,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্‌নু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর এক কন্যা [উম্মু কুলসুম (রাঃ)]-এর জানাযায় উপস্থিত হলাম। আল্লাহর রসূল কবরের পার্শ্বে উপবিষ্ট ছিলেন। আনাস (রাঃ) বলেন, তখন আমি তাঁর চক্ষু হতে অশ্রু ঝরতে দেখলাম। বর্ণনাকারী বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) জিজ্ঞেস করলেন, তোমাদের মধ্যে কি এমন কেউ আছে, যে আজ রাতে স্ত্রী মিলন করোনি? আবূ তালহা (রাঃ) বললেন, আমি। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ তা হলে তুমি (কবরে) অবতরণ কর। রাবী বলেন, তখন তিনি আবূ তালহা (রাঃ) তাঁর কবরে অবতরণ করলেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 111750,
        "last_updated": null
    },
    {
        "banglaURN": 6012890,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 680,
        "babName": null,
        "hadithNumber": 1289,
        "hadithSanad": "",
        "hadithText": "নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সহধর্মিণী ‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এক ইয়াহুদী স্ত্রীলোকের (কবরের) পার্শ্ব দিয়ে অতিক্রম করছিলেন, যার পরিবারের লোকেরা তার জন্য ক্রন্দন করছিল। তখন তিনি বললেনঃ তারা তো তার জন্য ক্রন্দন করছে। অথচ তাকে কবরে ‘আযাব দেয়া হচ্ছে।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 111790,
        "last_updated": null
    },
    {
        "banglaURN": 6012900,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 680,
        "babName": null,
        "hadithNumber": 1290,
        "hadithSanad": "",
        "hadithText": "আবূ বুরদার পিতা (আবূ মূসা আশ‘আরী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, যখন ‘উমর (রাঃ) আহত হলেন, তখন সুহাইব (রাঃ) হায়! আমার ভাই! বলতে লাগলেন। ‘উমর (রাঃ) বললেন, তুমি কি অবহিত নও যে, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ জীবিতদের কান্নার কারণে অবশ্যই মৃতদের ‘আযাব দেয়া হয়?</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 111800,
        "last_updated": null
    },
    {
        "banglaURN": 6012910,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 681,
        "babName": null,
        "hadithNumber": 1291,
        "hadithSanad": "",
        "hadithText": "মুগীরা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছি যে, আমার প্রতি মিথ্যারোপ করা অন্য কারো প্রতি মিথ্যারোপ করার মত নয়। যে ব্যক্তি আমার প্রতি মিথ্যারোপ করে সে যেন অবশ্যই তার ঠিকানা জাহান্নামে করে নেয়। [মুগীরা (রাঃ) আরও বলেছেন,] আমি নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে আরও বলতে শুনেছি, যে (মৃত) ব্যক্তির জন্য বিলাপ করা হয়, তাকে বিলাপকৃত বিষয়ের উপর ‘আযাব দেয়া হবে।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 111810,
        "last_updated": null
    },
    {
        "banglaURN": 6012920,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 681,
        "babName": null,
        "hadithNumber": 1292,
        "hadithSanad": "",
        "hadithText": "‘উমর (রাঃ) সূত্রে নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেন, মৃত ব্যক্তিকে তার জন্য কৃত বিলাপের বিষয়ের উপর কবরে শাস্তি দেয়া হয়। আবদুল আ‘লা (রহঃ) ......কাতাদা (রহঃ)  হতে বর্ণনায় আবদান (রহঃ)-এর অনুসরণ করেছেন। আদম (রহঃ)  শু’বাহ্‌ (রাঃ) হতে বর্ণনা করেন যে, মৃত ব্যক্তিকে তার জন্য জীবিতদের কান্নার কারণে ‘আযাব দেয়া হয়।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 111820,
        "last_updated": null
    },
    {
        "banglaURN": 6012930,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 682,
        "babName": null,
        "hadithNumber": 1293,
        "hadithSanad": "",
        "hadithText": "জাবির ইব্‌নু ‘আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, উহুদের দিন আমার পিতাকে অঙ্গ-প্রত্যঙ্গ কর্তিত অবস্থায় নিয়ে এসে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সামনে রাখা হল। তখন একখানি বস্ত্র দ্বারা তাঁকে আবৃত রাখা হয়েছিল। আমি তাঁর উপর হতে আবরণ উন্মোচন করেতে আসলে আমার কওমের লোকেরা আমাকে নিষেধ করল। পুনরায় আমি আবরণ উন্মুক্ত করতে থাকলে আমার কওমের লোকেরা (আবার) আমাকে নিষেধ করল। পরে আল্লাহর রসূল(সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নির্দেশে তাঁকে উঠিয়ে নেয়া হল। তখন তিনি (রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ) এক ক্রন্দনকারিণীর শব্দ শুনে জিজ্ঞেস করলেন, এ কে? লোকেরা বলল, ‘আমরের মেয়ে অথবা (তারা বলল,) ‘আমরের বোন। তিনি বললেন, ক্রন্দন করছো কেন? অথবা বললেন, ক্রন্দন করো না। কেননা, তাঁকে উঠিয়ে নেয়া পর্যন্ত ফেরেশতাগণ তাঁদের পক্ষ বিস্তার করে তাঁকে ছায়া দিয়ে রেখেছিলেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 111830,
        "last_updated": null
    },
    {
        "banglaURN": 6012940,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 683,
        "babName": null,
        "hadithNumber": 1294,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ ইব্‌নু মাস‘ঊদ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ যারা (মৃত ব্যক্তির জন্য শোক প্রকাশে) গন্ডে চপেটাঘাত করে, জামার বক্ষ ছিন্ন করে বং জাহিলী যুগের মত চিৎকার দেয়, তারা আমাদের দলভুক্ত নয়।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 111840,
        "last_updated": null
    },
    {
        "banglaURN": 6012950,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 684,
        "babName": null,
        "hadithNumber": 1295,
        "hadithSanad": "",
        "hadithText": "সা‘দ ইব্‌নু আবূ ওয়াক্কাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, বিদায় হাজ্জে একটি কঠিন রোগে আমি আক্রান্ত হলে, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমার খোঁজ খবর নেয়ার জন্য আসতেন। একদা আমি তাঁর কাছে নিবেদন করলাম, আমার রোগ চরমে পৌঁছেছে আর আমি সম্পদশালী। একমাত্র কন্যা ছাড়া কেউ আমার উত্তরাধিকারী নেই। তবে আমি কি আমার সম্পদের দু’ তৃতীয়াংশ সদকা করতে পারি? তিনি বললেন, না। আমি আবার নিবেদন করলাম, তাহলে অর্ধেক। তিনি বললেন, না। অতঃপর তিনি বললেন, এক তৃতীয়াংশ আর  এক তৃতীয়াংশও বিরাট পরিমাণ অথবা অধিক। তোমরা ওয়ারিসদের অভাবমুক্ত রেখে যাওয়া, তাদের খালি হাতে পরমুখাপেক্ষী অবস্থায় রেখে যাওয়ার চেয়ে উত্তম। [১৫] আর আল্লাহর সন্তুষ্টি লাভের জন্য তুমি যে কোন ব্যয় করো না কেন, তোমাকে তার বিনিময়ে প্রদান করা হবে। এমনকি যা তুমি তোমার স্ত্রীর মুখে তুলে দিবে (তারও প্রতিদান পাবে)। আমি নিবেদন করলাম, হে আল্লাহর রসূল! (আফসোস) আমি আমার সাথীদের হতে পিছনে থেকে যাব? তিনি বললেন, তুমি যদি পিছনে থেকে নেক ‘আমল করতে থাক, তাহলে তাতে তোমার মর্যাদা ও উন্নতি বৃদ্ধিই পেতে থাকবে। তাছাড়া, সম্ভবত, তুমি পিছনে (থেকে যাবে)। যার ফলে তোমার দ্বারা অনেক কওম উপকার লাভ করবে। আর অন্যরা ক্ষতিগ্রস্ত হবে। হে আল্লাহ্‌! আমার সাহাবীগনের হিজরত বলবৎ রাখুন। পশ্চাতে ফিরিয়ে দিবেন না। কিন্তু আফসোস! সা‘দ ইব্‌নু খাওলার জন্য (এ বলে) আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁর জন্য শোক প্রকাশ করছিলেন, যেহেতু মক্কায় তাঁর মৃত্যু হয়েছিল।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 111850,
        "last_updated": null
    },
    {
        "banglaURN": 6012960,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 685,
        "babName": null,
        "hadithNumber": 1296,
        "hadithSanad": "",
        "hadithText": "আবূ বুরদা ইব্‌নু আবূ মূসা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আবূ মূসা আশ‘আরী (রাঃ) কঠিন রোগে আক্রান্ত হলেন। এমনকি তিনি অজ্ঞান হয়ে পড়লেন। তখন তাঁর মাথা তাঁর পরিবারভুক্ত কোন এক মহিলার কোলে ছিল। তিনি তাকে কোন জবাব দিতে পারছিলেন না। জ্ঞান ফিরে পেলে তিনি বললেন, সে সব লোকের সঙ্গে আমি সম্পর্ক রাখিনা যাদের সাথে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সম্পর্ক ছিন্ন করেছেন। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সে সব নারীর সাথে সম্পর্কচ্ছেদের কথা প্রকাশ করেছেন- যারা চিৎকার করে ক্রন্দন করে, যারা মস্তক মুন্ডন করে এবং যারা জামা কাপড় ছিন্ন করে।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 111860,
        "last_updated": null
    },
    {
        "banglaURN": 6012970,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 686,
        "babName": null,
        "hadithNumber": 1297,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ ইব্‌নূ মাস’উদ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ইরশাদ করেছেনঃ যারা শোকে গণ্ডে চপেটাঘাত করে, জামার বক্ষ ছিন্ন করে ও জাহিলী যুগের মত চিৎকার দেয়, তারা আমাদের দলভুক্ত নয়।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 111870,
        "last_updated": null
    },
    {
        "banglaURN": 6012980,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 687,
        "babName": null,
        "hadithNumber": 1298,
        "hadithSanad": "",
        "hadithText": "‘আব্দুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এরশাদ করেছেনঃ যারা শোকে গণ্ডে চপেটাঘাত করে, জামার বক্ষ ছিন্ন করে ও জাহিলী যুগের মত চিৎকার দেয়, তারা আমাদের দলভুক্ত নয়।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 111880,
        "last_updated": null
    },
    {
        "banglaURN": 6012990,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 688,
        "babName": null,
        "hadithNumber": 1299,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, যখন (মুতা-র যুদ্ধ ক্ষেত্র হতে) নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর খিদমতে (যায়দ) ইব্‌নূ হারিসা, জা’ফর ও ইব্‌নু রাওয়াহা (রাঃ)-এর শাহাদাতের খবর পৌঁছল, তখন তিনি (এমনভাবে) বসে পড়লেন যে, তাঁর মধ্যে দুঃখের চিহ্ন ফুটে উঠেছিল। আমি [‘আয়িশা (রাঃ)] দরজার ফাঁক দিয়ে তা প্রত্যক্ষ করছিলাম। এক ব্যক্তি সেখানে উপস্থিত হয়ে জা’ফর (রাঃ)-এর পরিবারের মহিলাদের কান্নাকাটির কথা উল্লেখ করলেন। নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ঐ ব্যক্তিকে নির্দেশ দিলেন, তিনি যেন তাদেরকে (কান্নাকাটি করতে) নিষেধ করেন, লোকটি চলে গেল এবং দ্বিতীয়বার এসে (বলল) তারা তার কথা মানেনি। তিনি ইরশাদ করলেনঃ তাঁদেরকে নিষেধ করো। ঐ ব্যক্তি তৃতীয়বার এসে বললেন, আল্লাহর কসম! সে আল্লাহর রাসূল! তাঁরা আমাদের হার মানিয়েছে। ‘আয়িশা (রাঃ) বলেন, আমার মনে হয়, তখন নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বিরক্তির সাথে বললেনঃ তাহলে তাদের মুখে মাটি নিক্ষেপ করো। ‘আয়িশা (রাঃ) বলেন, আমি বললাম, আল্লাহ্‌ তোমার নাকে ধূলি মিলিয়ে দেন। [১] তুমি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নির্দেশ পালন করতে পারনি। অথচ তুমি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বিরক্ত করতেও দ্বিধা করোনি।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 111890,
        "last_updated": null
    },
    {
        "banglaURN": 6013000,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 688,
        "babName": null,
        "hadithNumber": 1300,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, (বীর-ই মাউনার ঘটনায়) ক্বারি (সাহাবীগনের) শাহাদাতের পর আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) (ফজরের সালাতে) এক মাস যাবত কুনুত-ই নাযিলা [১] পাঠ করেছিলেন। (বর্ণনাকারী বলেন) আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে আমি আর কখনো এর চেয়ে অধিক শোকাভিভূত হতে দেখিনি।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 111900,
        "last_updated": null
    },
    {
        "banglaURN": 6013010,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 689,
        "babName": null,
        "hadithNumber": 1301,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্‌নু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আবূ তালহা (রাঃ)-এর এক পুত্র অসুস্থ হয়ে পড়ল। বর্ণনাকারী বলেন, তার মৃত্যু হলো। তখন আবূ তালহা (রাঃ) বাড়ির বাইরে ছিলেন। তাঁর স্ত্রী যখন দেখলেন যে, ছেলেটি মারা গেছে, তখন তিনি কিছু প্রস্তুতি নিলেন [১] এবং ছেলেটিকে ঘরের এক কোণে রেখে দিলেন। আবূ তালহা (রাঃ) বাড়িতে এসে জিজ্ঞেস করলেন, ছেলের অবস্থা কেমন? স্ত্রী জওয়াব দিলেন, তার আত্মা শান্ত হয়েছে এবং আশা করি সে এখন আরাম পাচ্ছে। আবূ তালহা ভাবলেন তাঁর স্ত্রী সত্য বলেছেন। রাবী বলেন, তিনি রাত যাপন করলেন এবং ভোরে গোসল করলেন। তিনি বাইরে যেতে উদ্যত হলে স্ত্রী তাঁকে জানালেন, ছেলেটি মারা গেছে। অতঃপর তিনি নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সঙ্গে (ফজরের) সালাত আদায় করলেন। অতঃপর নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে তাঁদের রাতের ঘটনা সম্পর্কে অবহিত করলেন। তখন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ইরশাদ করলেনঃ আশা করা যায়, আল্লাহ্‌ তা’আলা তোমাদের এ রাতে বরকত দিবেন। সুফিয়ান (রাঃ) বলেন, এক ব্যক্তি বর্ণনা করেছেন, আমি আবূ তালহা (রাঃ) দম্পতির নয় জন সন্তান দেখেছি, তাঁরা সবাই কুরআন পাঠ করেছে।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 111910,
        "last_updated": null
    },
    {
        "banglaURN": 6013020,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 690,
        "babName": null,
        "hadithNumber": 1302,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেনঃ নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, বিপদের প্রথম অবস্থায়ই প্রকৃত সবর।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 111920,
        "last_updated": null
    },
    {
        "banglaURN": 6013030,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 691,
        "babName": null,
        "hadithNumber": 1303,
        "hadithSanad": "",
        "hadithText": "‘আনাস ইব্‌নু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সঙ্গে আবূ সায়ফ্‌ কর্মকারের নিকট গেলাম। তিনি ছিলেন (নবী -তনয়) ইব্‌রাহীম (রাঃ)-এর দুধ সম্পর্কীয় পিতা। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ইব্‌রাহীম (রাঃ)-কে তুলে নিয়ে চুমু খেলেন এবং নাকে-মুখে লাগালেন। অতঃপর (আরেক বার) আমরা তাঁর (আবূ সায়ফ্‌-এর) বাড়িতে গেলাম। তখন ইব্‌রাহীম (রাঃ) মুমূর্ষু অবস্থায়। এতে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর উভয় চক্ষু হতে অশ্রু ঝরতে লাগল। তখন ‘আবদুর রহমান ইব্‌নু ‘আওফ (রাঃ) বললেন, হে আল্লাহর রসূল! আর আপনিও? (ক্রন্দন করছেন?)। তখন তিনি বললেনঃ অশ্রু প্রবাহিত হয় আর হৃদয় হয় ব্যথিত। তবে আমরা মুখে তা-ই বলি যা আমাদের রব পছন্দ করেন। [১৭] আর হে ইব্‌রাহীম! তোমার বিচ্ছেদে আমরা অবশ্যই শোকসন্তপ্ত। [১৮]\nমূসা (রহঃ)….আনাস (রাঃ) নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে হাদীসটি বর্ণনা করেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 111930,
        "last_updated": null
    },
    {
        "banglaURN": 6013040,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 692,
        "babName": null,
        "hadithNumber": 1304,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, সা’দ ইব্‌নু ‘উবাদাহ (রাঃ) রোগাক্রান্ত হলেন। নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ‘আবদুর রাহমান ইব্‌নু ‘আওফ’ সা’দ ইব্‌নু আবূ ওয়াক্কাস এবং ‘আবদুল্লাহ্‌ ইব্‌নু মাস’উদ (রাঃ)-কে সঙ্গে নিয়ে তাঁকে দেখতে আসলেন। তিনি তাঁর ঘরে প্রবেশ করে তাঁকে পরিজনের মাঝে দেখতে পেলেন। জিজ্ঞেস করলেন, তার কি মৃত্যু হয়েছে! তাঁরা বললেন, না। হে আল্লাহর রসূল! তখন নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) কেঁদে ফেললেন। নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কান্না দেখে উপস্থিত লকেরা কাঁদতে লাগলেন। তখন তিনি ইরশাদ করলেনঃ শুনে রাখ! নিঃসন্দেহে আল্লাহ্‌ তা’আলা চোখের পানি ও অন্তরের শোক-ব্যথার কারনে ‘আযাব দিবেন না। তিনি ‘আযাব দিবেন এর কারনে (এ বলে) জিহ্বার দিকে ইঙ্গিত করলেন। অথবা এর কারণেই তিনি রহম করে থাকেন। আর নিশ্চয় মৃত ব্যক্তিকে তাঁর পরিজনের বিলাপের কারণে ‘আযাব দেয়া হয়’। ‘উমর (রাঃ) এ (ধরণের কান্নার) কারণে লাঠি দ্বারা আঘাত করতেন, কঙ্কর নিক্ষেপ করতেন বা মুখে মাটি পুরে দিতেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 111940,
        "last_updated": null
    },
    {
        "banglaURN": 6013050,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 693,
        "babName": null,
        "hadithNumber": 1305,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, (মুতার যুদ্ধ ক্ষেত্র হতে) যায়দ ইব্‌নু হারিসাহ, জা’ফর এবং ‘আব্দুল্লাহ্‌ ইব্‌নু রাওয়াহা (রাঃ)-এর শাহাদাতের খবর পৌঁছলে নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বসে পড়লেন; তাঁর মধ্যে শোকের আলামত প্রকাশ পেল। আমি [‘আয়িশা (রাঃ)] দরজার ফাঁক দিয়ে ঝুঁকে তা দেখছিলাম। তখন এক ব্যক্তি তাঁর নিকট এসে সম্বোধন করেন, হে আল্লাহর রসূল! জা’ফর (রাঃ)-এর (পরিবারের) মহিলাগণ কান্নাকাটি করছে। তিনি তাদের নিষেধ করার জন্য তাকে আদেশ করলেন। সেই ব্যক্তি চলে গেলেন। পরে এসে বললেন, আমি তাদের নিষেধ করেছি। তিনি উল্লেখ করলেন যে, তারা তাকে মানেনি। তিনি তাদের নিষেধ করার জন্য দ্বিতীয়বার তাকে নির্দেশ দিলেন। তিনি চলে গেলেন এবং আবার এসে বললেন, আল্লাহর কসম! অবশ্যই তাঁরা আমাকে (বা বলেছেন আমাদেরকে) হার মানিয়েছে। ‘আয়িশা (রাঃ) বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, তা হলে তাঁদের মুখে মাটি ছুঁড়ে মারো। [‘আয়িশা (রাঃ) বলেন] আমি বললাম, আল্লাহ্‌ তোমার নাকে ধূলি মিশ্রিত করুন। আল্লাহর কসম! তোমাকে যে কাজের নির্দেশ দেয়া হয়েছে তা করতে পারছ না আর আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বিরক্ত করতেও ছাড়ছ না।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 111950,
        "last_updated": null
    },
    {
        "banglaURN": 6013060,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 693,
        "babName": null,
        "hadithNumber": 1306,
        "hadithSanad": "",
        "hadithText": "উম্মু আতিয়্যা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বাই’আত গ্রহণকালে আমাদের কাছ হতে এ অঙ্গীকার নিয়েছিলেন যে, আমরা (কোন মৃতের জন্য) বিলাপ করব না। ….আমাদের মধ্য হতে পাঁচজন মহিলা উম্মু সুলাইম, উম্মুল ‘আলা, আবূ সাব্‌রাহ্‌র কন্যা মু’আযের স্ত্রী, আরো দু’জন মহিলা বা মু’আযের স্ত্রী ও আরেকজন মহিলা ব্যতীত কোন নারীই সে ওয়াদা রক্ষা করেনি।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 111960,
        "last_updated": null
    },
    {
        "banglaURN": 6013070,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 694,
        "babName": null,
        "hadithNumber": 1307,
        "hadithSanad": "",
        "hadithText": "‘আমির ইব্‌নু রাবী’আ (রাঃ) নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেন, তোমরা জানাযা দেখলে তা তোমাদের পিছনে ফেলে যাওয়া পর্যন্ত দাঁড়িয়ে থাকবে। হুমাইদী আরও উল্লেখ করেছেন, তা তোমাদের পশ্চাতে ফেলে যাওয়া বা মাটিতে নামিয়ে রাখা পর্যন্ত।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 111970,
        "last_updated": null
    },
    {
        "banglaURN": 6013080,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 695,
        "babName": null,
        "hadithNumber": 1308,
        "hadithSanad": "",
        "hadithText": "আবূ সাঈদ খুদরী (রাঃ) সূত্রে নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেন, তোমাদের কেউ জানাযা যেতে দেখলে যদি সে তাঁর সহযাত্রী না হয়, তবে ততক্ষন সে দাঁড়িয়ে থাকবে, যতক্ষণ না সে ব্যক্তি জানাযা পিছনে ফেলে বা জানাযা তাকে পিছনে ফেলে যায় অথবা পিছনে ফেলে যাওয়ার পূর্বে তা (মাটিতে) নামিয়ে রাখা হয়।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 111980,
        "last_updated": null
    },
    {
        "banglaURN": 6013090,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 695,
        "babName": null,
        "hadithNumber": 1309,
        "hadithSanad": "",
        "hadithText": "সা’ঈদ মাক্‌বুরী (রহঃ)  এর পিতা থেকে বর্ণিতঃ তিনি বলেন, আমরা একটি জানাযায় শরীক হলাম। (সেখানে) আবূ হুরায়রা (রাঃ) মারওয়ানের হাত ধরলেন এবং তাঁর জানাযা নামিয়ে রাখার পূর্বেই বসে পড়লেন। তখন আবূ সা’ঈদ এগিয়ে এসে মারওয়ানের হাত ধরে বললেন, দাঁড়িয়ে পড়ুন ! আল্লাহর কসম! ইনি [আবূ হুরায়রা (রাঃ)] তো জানেন যে, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ঐ কাজ করতে (জানাযা নামিয়ে রাখার পূর্বে বসতে) নিষেধ করেছেন। তখন আবূ হুরায়রা (রাঃ) বললেন, তিনি ঠিকই বলেছেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 111990,
        "last_updated": null
    },
    {
        "banglaURN": 6013100,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 696,
        "babName": null,
        "hadithNumber": 1310,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ খুদ্‌রী (রাঃ) থেকে বর্ণিতঃ নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে বর্ণিত। তিনি বলেন, তোমাদের কেউ যখন কোন জানাযা যেতে দেখবে, যদি সে তার সহযাত্রী না হয় তাহলে সে ততক্ষন দাঁড়িয়ে থাকবে, যতক্ষণ না তা চলে যায় অথবা নামিয়ে না রাখা হয়।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 112000,
        "last_updated": null
    },
    {
        "banglaURN": 6013110,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 697,
        "babName": null,
        "hadithNumber": 1311,
        "hadithSanad": "",
        "hadithText": "জাবির ইব্‌নু ‘আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমাদের পার্শ্ব দিয়ে একটি জানাযা যাচ্ছিল। নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তা দেখে দাঁড়িয়ে গেলেন। আমরাও দাঁড়িয়ে পড়লাম এবং নিবেদন করলাম, হে আল্লাহর রসূল! এ তো ইয়াহূদীর জানাযা। তিনি বললেনঃ তোমরা যে কোন জানাযা দেখলে দাঁড়িয়ে পড়বে।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 112010,
        "last_updated": null
    },
    {
        "banglaURN": 6013140,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 698,
        "babName": null,
        "hadithNumber": 1314,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ খুদ্‌রী (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ যখন জানাযা খাটে রাখা হয় এবং পুরুষরা তা কাঁধে বহন করে নেয়, তখন সে সৎ হলে বলতে থাকে, আমাকে সামনে এগিয়ে নিয়ে যাও। আর সৎ না হলে সে বলতে থাকে, হায় আফসোস! তোমরা এটাকে কোথায় নিয়ে যাচ্ছ? মানব জাতি ব্যতীত সবাই তার চিৎকার শুনতে পায়। মানুষ তা শুনলে জ্ঞান হারিয়ে ফেলত।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 112040,
        "last_updated": null
    },
    {
        "banglaURN": 6013150,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 699,
        "babName": null,
        "hadithNumber": 1315,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) সূত্রে নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেন, তোমরা জানাযা নিয়ে দ্রুতগতিতে চলবে। কেননা, সে যদি পুণ্যবান হয়, তবে এটা উত্তম, যার দিকে তোমরা তাঁকে এগিয়ে দিচ্ছ আর যদি সে অন কিছু হয়, তবে সে একটি আপদ, যাকে তোমরা তোমাদের ঘাড় হতে জলদি নামিয়ে ফেলছ।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 112050,
        "last_updated": null
    },
    {
        "banglaURN": 6013160,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 700,
        "babName": null,
        "hadithNumber": 1316,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ খুদ্‌রী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেনঃ যখন জানাযা (খাটিয়ায়) রাখা হয় এবং পুরুষ লোকেরা তা তাদের কাঁধে তুলে নেয়, সে পুণ্যবান হলে তখন বলতে থাকে, আমাকে সামনে এগিয়ে দাও। আর পুণ্যবান না হলে সে আপন পরিজনকে বলতে থাকে, হায় আফসোস! এটা নিয়ে তোমরা কোথায় যাচ্ছ? মানুষ জাতি ব্যতীত সবাই তার চিৎকার সুন্তে পায়। মানুষ যদি তা শুনতে পেত তবে অবশ্যই অজ্ঞান হয়ে যেত।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 112060,
        "last_updated": null
    },
    {
        "banglaURN": 6013170,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 701,
        "babName": null,
        "hadithNumber": 1317,
        "hadithSanad": "",
        "hadithText": "জাবির ইব্‌নু ‘আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) (আবিসিনিয়ার বাদশাহ্‌) নাজাশীর জানাযা আদায় করেন। আমি দ্বিতীয় অথবা তৃতীয় কাতারে ছিলাম।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 112070,
        "last_updated": null
    },
    {
        "banglaURN": 6013180,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 702,
        "babName": null,
        "hadithNumber": 1318,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁর সাহাবীগণকে নাজাশীর মৃত্যু খবর শোনালেন, পরে তিনি সম্মুখে অগ্রসর হলেন এবং সাহাবীগন তাঁর পিছনে কাতারবন্দী হলে তিনি চার তাক্‌বীরে [২০] (জানাযার সালাত) আদায় করলেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 112080,
        "last_updated": null
    },
    {
        "banglaURN": 6013190,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 702,
        "babName": null,
        "hadithNumber": 1319,
        "hadithSanad": "",
        "hadithText": "শা’বী (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, এমন এক সাহাবী যিনি নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সঙ্গে উপস্থিত ছিলেন, তিনি আমাকে খবর দিয়েছেন যে, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) একটি পৃথক কবরের নিকট গমন করলেন এবং লোকেদের কাতারবন্দী করে চার তাক্‌বীরের সঙ্গে (জানাযার সালাত) আদায় করলেন। [শাইবানী (রহঃ) বলেন] আমি শা’বী (রহঃ)-কে জিজ্ঞেস করলাম, এ হাদীস আপনাকে কে বর্ণনা করেছেন? তিনি বললেন, ইব্‌নু ‘আব্বাস (রাঃ)।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 112090,
        "last_updated": null
    },
    {
        "banglaURN": 6013200,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 702,
        "babName": null,
        "hadithNumber": 1320,
        "hadithSanad": "",
        "hadithText": "জাবির ইব্‌নু ‘আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ আজ হাবাশা দেশের (আবিসিনিয়ার) একজন পুণ্যবান লোকের মৃত্যু হয়েছে, তোমরা এসো তাঁর জন্য (জানাযার) সালাত আদায় কর। বর্ণনাকারী বলেন, আমরা তখন কাতারবন্দী হয়ে দাঁড়ালে নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) (জানাযার) সালাত আদায় করলেন, আমরা ছিলাম কয়েক কাতার। আবূ যুবাইর (রহঃ) জাবির (রাঃ) হতে বর্ণনা করেন, জাবির (রাঃ) বলেছেন, আমি দ্বিতীয় কাতারে ছিলাম।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 112100,
        "last_updated": null
    },
    {
        "banglaURN": 6013210,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 703,
        "babName": null,
        "hadithNumber": 1321,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এক (ব্যক্তির) কবরের পার্শ্ব দিয়ে যাচ্ছিলেন, যাকে রাতের বেলা দাফন করা হয়েছিল। তিনি জিজ্ঞেস করলেন, একে কখন দাফন করা হল? সাহাবীগন বললেন, গত রাতে। তিনি বললেনঃ তোমরা আমাকে জানালে না কেন? তাঁরা বললেন, আমরা তাঁকে রাতের আধারে দাফন করেছিলাম, তাই আপনাকে জাগানো পছন্দ করিনি। তখন তিনি (সেখানে) দাঁড়িয়ে গেলেন। আমরাও তাঁর পিছনে কাতারবন্দী হয়ে দাঁড়ালাম। ইব্‌নু ‘আব্বাস (রাঃ) বলেন, আমিও তাদের মধ্যে ছিলাম। তিনি তাঁর জানাযার সালাত আদায় করলেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 112110,
        "last_updated": null
    },
    {
        "banglaURN": 6013220,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 704,
        "babName": null,
        "hadithNumber": 1322,
        "hadithSanad": "",
        "hadithText": "শা’বী (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, এমন এক সাহাবী আমাকে খবর দিয়েছেন, যিনি তোমাদের নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সঙ্গে একটি পৃথক কবরের পার্শ্ব দিয়ে যাচ্ছিলেন। তিনি (নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ) ইমামত করলেন, আমরা তার পিছনে কাতারবন্দী [২১] হলাম এবং সালাত আদায় করলাম। [শাইবানী (রহঃ)  বলেন,] আমরা (শা’বীকে) জিজ্ঞেস করলাম, হে আবূ ‘আম্‌র! আপনাকে এ হাদীস কে বর্ণনা করেছেন? তিনি বললেন, ইব্‌নু ‘আব্বাস (রাঃ)।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 112120,
        "last_updated": null
    },
    {
        "banglaURN": 6013250,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 706,
        "babName": null,
        "hadithNumber": 1325,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ যে ব্যক্তি মৃতের জন্য সালাত আদায় করা পর্যন্ত জানাযায় উপস্থিত থাকবে, তার জন্য এক কীরাত, আর যে ব্যক্তি মৃতের দাফন হয়ে যাওয়া পর্যন্ত উপস্থিত থাকবে তার জন্য দু’কীরাত। জিজ্ঞেস করা হল দু’কীরাত কী? তিনি বললেন, দু’টি বিশাল পর্বত সমতুল্য (সওয়াব)।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 112151,
        "last_updated": null
    },
    {
        "banglaURN": 6013260,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 707,
        "babName": null,
        "hadithNumber": 1326,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) একটি কবরের নিকট আসলেন। সাহাবাগন বললেন, একে গত রাতে দাফন করা হয়েছে। ইব্‌নু ‘আব্বাস (রাঃ) বলেন, তখন আমরা আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর পিছনে কাতারবন্দী হলাম। অতঃপর তিনি তার জানাযার সালাত আদায় করলেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 112170,
        "last_updated": null
    },
    {
        "banglaURN": 6013290,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 708,
        "babName": null,
        "hadithNumber": 1329,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্ ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট ইয়াহূদীরা তাদের এক পুরুষ ও এক স্ত্রীলোককে হাযির করল, যারা ব্যভিচার করেছিল। তখন তিনি তাদের উভয়কে রজমের (পাথর নিক্ষেপে হত্যা) নির্দেশ দেন। মসজিদের পাশে জানাযার স্থানের নিকটে তাদের দু’জনকে রজম করা হল।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 112200,
        "last_updated": null
    },
    {
        "banglaURN": 6013300,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 709,
        "babName": null,
        "hadithNumber": 1330,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এর যে রোগে মৃত্যু হয়েছিল, সে রোগাবস্থায় তিনি বলেছিলেনঃ ইয়াহূদী ও নাসারা সম্প্রদায়ের প্রতি আল্লাহর অভিশাপ, তারা তাদের নবীদের কবরকে মসজিদে পরিণত করেছে। ‘আয়িশা (রাঃ) বলেন, সে আশঙ্কা না থাকলে তাঁর (নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর) কবরকে উন্মুক্ত রাখা হত, কিন্তু আমি আশঙ্কা করি যে, (উন্মুক্ত রাখা হলে) একে মসজিদে পরিণত করা হবে।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 112210,
        "last_updated": null
    },
    {
        "banglaURN": 6013310,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 710,
        "babName": null,
        "hadithNumber": 1331,
        "hadithSanad": "",
        "hadithText": "সামুরা ইব্‌নু জুন্‌দাব (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর পশ্চাতে আমি এমন এক স্ত্রীলোকের জানাযার সালাত আদায় করেছিলাম, যে নিফাসের [২৩] অবস্থায় মারা গিয়েছিল। তিনি (রাঃ) তার ( স্ত্রীলোকটির) মাঝ বরাবর দাঁড়িয়েছিলেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 112220,
        "last_updated": null
    },
    {
        "banglaURN": 6013320,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 711,
        "babName": null,
        "hadithNumber": 1332,
        "hadithSanad": "",
        "hadithText": "সামুরা ইব্‌নু জুন্‌দাব (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর পশ্চাতে আমি এমন এক স্ত্রীলোকের জানাযায় সালাত আদায় করেছিলাম, যে নিফাসের অবস্থায় মারা গিয়েছিলন। তিনি তার ( স্ত্রীলোকটির) মাঝ বরাবর দাঁড়িয়েছিলেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 112230,
        "last_updated": null
    },
    {
        "banglaURN": 6013330,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 712,
        "babName": null,
        "hadithNumber": 1333,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) নাজাশীর মৃত্যুর ‍দিন তাঁর মৃত্যুর খবর জানালেন এবং সাহাবীবর্গকে সঙ্গে নিয়ে জানাযার সালাতের স্থানে গেলেন এবং তাদেরকে সারিবদ্ধ করে চার তাক্‌বীরে জানাযার সালাত আদায় করলেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 112240,
        "last_updated": null
    },
    {
        "banglaURN": 6013340,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 712,
        "babName": null,
        "hadithNumber": 1334,
        "hadithSanad": "",
        "hadithText": "জাবির (রাঃ) থেকে বর্ণিতঃ নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আসহামা নাজাশীর জানাযায় সালাত আদায় করলেন, তাতে তিনি চার তাকবীর দিলেন। ইয়ায়ীদ ইব্‌নু হারূন ও আবদুস্‌ সামাদ (রহঃ)  সালীম (রহঃ)  হতে أَصْحَمَةَ শব্দটি উল্লেখ করেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 112250,
        "last_updated": null
    },
    {
        "banglaURN": 6013350,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 713,
        "babName": null,
        "hadithNumber": 1335,
        "hadithSanad": "",
        "hadithText": "ত্বলহাহ্‌ ইব্‌নু ‘আবদুল্লাহ্‌ ইব্‌নু ‘আওফ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি ইব্‌নু ‘আব্বাস (রাঃ)-এর পিছনে জানাযার সালাত আদায় করলাম। তাতে তিনি সূরা ফাতিহা পাঠ করলেন [২৪] এবং (সালাত শেষে) বললেন, (আমি সূরা ফাতিহা পাঠ করলাম) যাতে লোকেরা জানতে পারে যে, এটা সুন্নাত।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 112260,
        "last_updated": null
    },
    {
        "banglaURN": 6013360,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 714,
        "babName": null,
        "hadithNumber": 1336,
        "hadithSanad": "",
        "hadithText": "শা’বী (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমাকে এমন এক সাহাবী বর্ণনা করেছেন, যিনি নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) –এর সঙ্গে একটি পৃথক কবরের পাশ দিয়ে যাচ্ছিলেন। তিনি তাঁদের ইমামতি করলেন এবং তাঁরা তাঁর পিছনে জানাযার সালাত আদায় করলেন। (বর্ণনাকারী বলেন) আমি শা’বীকে জিজ্ঞেস করলাম, হে আবূ ‘আম্‌র! আপনার নিকট এ হাদিস কে বর্ণনা করেছেন? তিনি বললেন, ইব্‌নু ‘আব্বাস (রাঃ)।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 112270,
        "last_updated": null
    },
    {
        "banglaURN": 6013370,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 714,
        "babName": null,
        "hadithNumber": 1337,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ কালো এক পুরুষ বা এক মহিলা মসজিদে ঝাড়ু দিত। সে মারা গেল। কিন্তু নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তার মৃত্যুর খবর জানতে পারেননি। একদা তার কথা উল্লেখ করে তিনি জিজ্ঞেস করলেন, এ লোকটির কি হল? সাহাবীগণ বললেন, হে আল্লাহর রসূল! সে তো মারা গেছে। তিনি বললেনঃ তোমরা আমাকে জানাওনি কেন? সে ছিল এমন এমন বলে তাঁরা তার ঘটনা উল্লেখ করলেন। বর্ণনাকারী বলেন, তাঁরা তার মর্যাদাকে খাটো করে দেখলেন। নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ আমাকে তার কবর দেখিয়ে দাও। বর্ণনাকারী বলেন, তখন তিনি তার কবরের কাছে আসলেন এবং তার জানাযার সালাত আদায় করলেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 112280,
        "last_updated": null
    },
    {
        "banglaURN": 6013380,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 715,
        "babName": null,
        "hadithNumber": 1338,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ বান্দাকে যখন তার কবরে রাখা হয় এবং তাকে ‍পিছনে রেখে তার সাথীরা চলে যায় (এতটুকু দূরে যে,) তখনও সে তাদের জুতার শব্দ শুনতে পায়, এমন সময় তার নিকট দু’জন ফেরেশতা এসে তাকে বসিয়ে দেন। অতঃপর তাঁরা প্রশ্ন করেন, এই যে মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)! তাঁর সম্পর্কে তুমি কী বলতে? তখন সে বলবে, আমি সাক্ষ্য দিচ্ছি যে, তিনি আল্লাহর বান্দা এবং তাঁর রসূল। তখন তাঁকে বলা হবে, জাহান্নামে তোমার অবস্থানের জায়গাটি দেখে নাও, যার পরিবর্তে আল্লাহ্‌ তা’আলা তোমার জন্য জান্নাতে একটি স্থান নির্ধারিত করেছেন। নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেনঃ তখন সে দু’টি স্থান একই সময় দেখতে পাবে। আর যারা ক্বাফির বা মুনাফিক, তারা বলবে, আমি জানি না। অন্য লোকেরা যা বলত আমিও তাই বলতাম। তখন তাকে বলা হবে, না তুমি নিজে জেনেছ, না তিলাওয়াত করে শিখেছ। অতঃপর তার দু’ কানের মাঝখানে লোহার মুগুর দিয়ে এমন জোরে মারা হবে, যাতে সে চিৎকার করে উঠবে, তার আশপাশের সবাই তা শুনতে পাবে মানুষ ও জ্বীন ছাড়া।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 112290,
        "last_updated": null
    },
    {
        "banglaURN": 6013390,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 716,
        "babName": null,
        "hadithNumber": 1339,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, মালাকুল মাওতকে মূসা (আঃ)-এর নিকট পাঠানো হল। তিনি তাঁর নিকট আসলে, মূসা (আঃ) তাঁকে চপেটাঘাত করলেন। (যার ফলে তাঁর চোখ বেরিয়ে গেল।) তখন মালাকুল মাওত তাঁর প্রতিপালকের নিকট ফিরে গিয়ে বললেন, আমাকে এমন এক বান্দার কাছে পাঠিয়েছেন যে মরতে চায় না। তখন আল্লাহ্‌ তাঁর চোখ ফিরিয়ে দিয়ে হুকুম করলেন, আবার গিয়ে তাঁকে বল, তিনি একটি ষাঁড়ের পিঠে তাঁর হাত রাখবেন, তখন তাঁর হাত যতটুকু আবৃত করবে, তার সম্পূর্ণ অংশের প্রতিটি পশমের বিনিময়ে তাঁকে এক বছর করে আয়ু দান করা হবে। মূসা (আঃ) এ শুনে বললেন, হে আমার রব! অতঃপর কী হবে? আল্লাহ্‌ বললেনঃ অতঃপর মৃত্যু। মূসা (আঃ) বললেন, তা হলে এখনই হোক। তখন তিনি একটি পাথর নিক্ষেপ করলে যতদূর যায় বাইতুল মাক্বদিসের ততটুকু নিকটবর্তী স্থানে তাঁকে পৌঁছিয়ে দেয়ার জন্য আল্লাহ্‌ তা’আলার কাছে নিবেদন করলেন। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ আমি সেখানে থাকলে অবশ্যই পথের পাশে লাল বালুর টিলার নিকটে তাঁর কবর তোমাদের দেখিয়ে দিতাম।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 112300,
        "last_updated": null
    },
    {
        "banglaURN": 6013400,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 717,
        "babName": null,
        "hadithNumber": 1340,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, এক ব্যক্তিকে রাত্রিকালে দাফন করার পর তার জানাযার সালাত আদায় করার জন্য নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ও তাঁর সাহাবীগণ গিয়ে দাঁড়ালেন। তখন তিনি লোকটির ব্যাপারে জিজ্ঞেস করলেন এবং বললেন, এ লোকটি কে? তাঁরা জবাব দিলেন, অমুক, গতরাতে তাকে দাফন করা হয়েছে। তখন তাঁরা তার জানাযার সালাত আদায় করলেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 112310,
        "last_updated": null
    },
    {
        "banglaURN": 6013410,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 718,
        "babName": null,
        "hadithNumber": 1341,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর অসুস্থতার সময় তাঁর এক সহধর্মিণী হাবাশা দেশে তাঁর দেখা ‘মারিয়া’ নামক একটি গীর্জার কথা বললেন। উম্মু সালামা এবং উম্মু হাবীবা (রাঃ) হাবাশায় গিয়েছিলেন। তাঁরা দু’জন ঐ গীর্জার সৌন্দর্য এবং তার ভিতরের চিত্রকর্মের বিবরণ দিলেন। তখন নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁর মাথা তুলে বললেনঃ সে সব দেশের লোকেরা তাদের কোন নেক্‌কার ব্যক্তি মারা গেলে তাঁর কবরে মসজিদ নির্মাণ করত এবং তাতে ঐ সব চিত্রকর্ম অংকণ করত। তারা হলো, আল্লাহর নিকৃষ্ট সৃষ্টি।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 112320,
        "last_updated": null
    },
    {
        "banglaURN": 6013420,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 719,
        "babName": null,
        "hadithNumber": 1342,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্‌নু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর এক কন্যার দাফনে হাযির ছিলাম। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) কবরের পাশেই বসেছিলেন। আমি দেখলাম, তাঁর দু’চোখে অশ্রু প্রবাহিত হচ্ছে। তখন তিনি জিজ্ঞেস করলেন, তোমাদের মধ্যে এমন কেউ আছে কি, যে আজ রাতে স্ত্রী মিলনে লিপ্ত হয়নি? আবূ তালহা (রাঃ) বলেন, আমি। তখন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ তাঁর কবরে নেমে পড়, তখন তিনি তাঁর কবরে নেমে গেলেন এবং তাঁকে দাফন করলেন।\n\nফুলাইহ বলেন, - অর্থ - পিছনে। আবূ ‘আবদুল্লাহ্‌ বুখারী বলেন, - অর্থাৎ যেন লিপ্ত হয়ে পড়ে।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 112330,
        "last_updated": null
    },
    {
        "banglaURN": 6013430,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 720,
        "babName": null,
        "hadithNumber": 1343,
        "hadithSanad": "",
        "hadithText": "জাবির ইব্‌নু ‘আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) উহুদের শহীদগণের দু’ দু’ জনকে একই কাপড়ে (কবরে) একত্র করতেন। অতঃপর জিজ্ঞেস করতেন, তাঁদের উভয়ের মধ্যে কে কুরআন সম্পর্কে অধিক জানত? দু’ জনের মধ্যে এক জনের দিকে ইঙ্গিত করা হলে তাঁকে কবরে পূর্বে রাখতেন এবং বললেন, আমি ক্বিয়ামতের দিন এদের ব্যাপারে সাক্ষী হব। তিনি রক্ত-মাখা অবস্থায় তাঁদের দাফন করার নির্দেশ দিলেন, তাঁদের গোসল দেয়া হয়নি এবং তাঁদের (জানাযার) সালাতও আদায় করা হয়নি।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 112340,
        "last_updated": null
    },
    {
        "banglaURN": 6013440,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 720,
        "babName": null,
        "hadithNumber": 1344,
        "hadithSanad": "",
        "hadithText": "‘উক্‌বা ইব্‌নু ‘আমির (রাঃ) থেকে বর্ণিতঃ নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) একদা বের হলেন এবং উহুদে পৌঁছে মৃতের জন্য যেরূপ (জানাযার) সালাত আদায় করা হয় উহুদের শহীদানের জন্য অনুরূপ সালাত আদায় করলেন। অতঃপর ফিরে এসে মিম্বারে তাশরীফ রেখে বললেনঃ আমি হবো তোমাদের জন্য অগ্রে প্রেরিত এবং তোমাদের জন্য সাক্ষী। আল্লাহর কসম! এ মুহূর্তে আমি অবশ্যই আমার হাউয (হাউয-ই-কাউসার) দেখছি। আর অবশ্যই আমাকে পৃথিবীর ভান্ডারসমূহের চাবিগুচ্ছ প্রদান করা হয়েছে। অথবা (বর্ণনাকারী বলেছেন) পৃথিবীর চাবিগুচ্ছ [২৫] আর আল্লাহর কসম! তোমরা আমার পরে শির্‌ক করবে এ আশঙ্কা আমি করি না। তবে তোমাদের ব্যাপারে আমার আশঙ্কা যে, তোমরা পার্থিব সম্পদ লাভে প্রতিযোগীতায় লিপ্ত হবে।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 112350,
        "last_updated": null
    },
    {
        "banglaURN": 6013450,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 721,
        "babName": null,
        "hadithNumber": 1345,
        "hadithSanad": "",
        "hadithText": "জাবির ইব্‌নু ‘আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি খবর দিয়েছেন যে, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) উহুদের শহীদগণের দু’ দু’জনকে একত্র করে দাফন করেছিলেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 112360,
        "last_updated": null
    },
    {
        "banglaURN": 6013460,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 722,
        "babName": null,
        "hadithNumber": 1346,
        "hadithSanad": "",
        "hadithText": "জাবির (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ তাঁদেরকে তাঁদের রক্ত সহ দাফন কর। অর্থাৎ উহুদের যুদ্ধের দিন শহীদগণের সম্পর্কে (কথাটি বলেছিলেন) আর তিনি তাঁদের গোসলও দেননি।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 112370,
        "last_updated": null
    },
    {
        "banglaURN": 6013490,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 724,
        "babName": null,
        "hadithNumber": 1349,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) সূত্রে নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহ, তা'আলা মক্কাকে হারাম (সম্মানিত বা নিষিদ্ধ এলাকা) সাব্যস্ত করেছেন। আমার পূর্বে তা, কারো জন্য হালাল (বৈধ ও উন্মুক্ত এলাকা) ছিল না এবং আমার পরেও কারো জন্য তা হালাল হবে না। আমার জন্য একটি দিনের (মক্কা বিজয়ের দিন) কিছু সময় হালাল করা হয়েছিল। কাজেই তার ঘাস উৎপাটন করা যাবে না, তার গাছ কাটা যাবে না, শিকারকে তাড়িয়ে দেয়া যাবে না। সেখানে পড়ে থাকা (হারানো) বস্তু উঠিয়ে নেয়া যাবে না, তবে হারানো প্রাপ্তির ঘোষণা প্রদানকারীর জন্য (অনুমতি থাকবে)। তখন আব্বাস (রাঃ) বললেন, তবে ইয্‌খির ঘাস আমাদের স্বর্ণকারদের জন্য এবং আমাদের কবরগুলোর জন্য প্রয়োজন। তখন তিনি বললেনঃ ইয্‌খির ব্যতীত। আবূ হুরায়রা (রাঃ) নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে বর্ণনা করেন, আমাদের কবর ও বাড়ী ঘরের জন্য। আর আবান ইব্‌নু সালিহ (রহঃ)  সাফিয়্যা বিন্‌ত শায়বাহ্‌ (রাঃ) সুত্রে বর্ণিত, তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে আমি অনুরূপ বলতে শুনেছি আর মুজাহিদ (রহঃ)  ইব্‌নু আব্বাস (রাঃ) সূত্রে বলেন, তাদের কর্মকার ও ঘর-বাড়ির জন্য।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 112411,
        "last_updated": null
    },
    {
        "banglaURN": 6013500,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 725,
        "babName": null,
        "hadithNumber": 1350,
        "hadithSanad": "",
        "hadithText": "জাবির ইব্‌নু ‘আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, ‘আবদুল্লাহ্‌ ইব্‌নু ‘উবাই (মুনাফিক সর্দারকে) কবর দেয়ার পর আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তার (কবরের) নিকট আসলেন এবং তিনি তাঁকে বের করার নির্দেশ দিলে তাকে (কবর হতে) বের করা হল। তখন তিনি তাকে তাঁর (নিজের) দু’ হাঁটুর উপর রাখলেন, নিজের (মুখের) লালা (তাঁর উপর ফুঁকে) দিলেন এবং নিজের জামা তাকে পরিয়ে দিলেন। আল্লাহ্‌ সমধিক অবগত। সে আব্বাস (রাঃ)-কে একটি জামা পড়তে দিয়েছিল। আর সুফিয়ান (রহঃ)  বলেন, আবূ হুরায়রা (রাঃ) বলেছেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর পরিধানে তখন দুটি জামা ছিল। ‘আবদুল্লাহ্‌ (ইব্‌নু ‘উবাই)-এর পুত্র (আবদুল্লাহ্‌ ইব্‌নু ‘আবদুল্লাহ্‌) বলেন, হে আল্লাহর রসূল! আপনার (পবিত্র) দেহের সাথে জড়িয়ে থাকা জামাটি  আমার পিতাকে পরিয়ে দিন। সুফিয়ান (রহঃ)  বলেন, তারা মনে করেন যে, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁর জামা ‘আবদুল্লাহ্‌ (ইব্‌নু উবাই)-কে পরিয়ে দিয়েছিলেন, তার কৃত (ইহসানের) বিনিময় স্বরূপ।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 112430,
        "last_updated": null
    },
    {
        "banglaURN": 6013510,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 725,
        "babName": null,
        "hadithNumber": 1351,
        "hadithSanad": "",
        "hadithText": "জাবির (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, যখন উহুদ যুদ্ধের সময় উপস্থিত হল, তখন রাতের বেলা আমার পিতা আমাকে ডেকে বললেন, আমার মনে হয় যে, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সাহাবীগনের মধ্যে যাঁরা প্রথমে শহীদ হবেন, আমি তাঁদের মধ্যে একজন হব। আর আমি আমার (মৃত্যুর) পরে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ব্যতীত তোমার চেয়ে অধিকতর প্রিয় কাউকে রেখে যাচ্ছি না। আমার যিম্মায় কর্য রয়েছে। তুমি তা পরিশোধ করবে। তোমার বোনদের ব্যাপারে সদুপদেশ গ্রহণ করবে। জাবির (রাঃ) বলেন, পরদিন সকাল হলে (আমরা দেখলাম যে) তিনিই প্রথম শহীদ। তাঁর কবরে তাঁর আর একজন সাহাবীকে তাঁর সাথে দাফন করা হয়েছিল। কিন্তু পরে অন্য একজনের সাথে (একই) কবরে তাঁকে রাখা আমার মনে ভাল লাগল না। তাই ছয় মাস পর আমি তাঁকে (কবর হতে) বের করলাম এবং দেখলাম যে, তাঁর কানে সামান্য চিহ্ন ব্যতীত তিনি সেই দিনের মতই (অক্ষত ও অবিকৃত) রয়েছেন, যে দিন তাঁকে (কবরে) রেখেছিলাম।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 112440,
        "last_updated": null
    },
    {
        "banglaURN": 6013520,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 725,
        "babName": null,
        "hadithNumber": 1352,
        "hadithSanad": "",
        "hadithText": "জাবির (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমার পিতার সাথে আরেকজন শহীদকে দাফন করা হলে আমার মন তাতে তুষ্ট হতে পারল না। অবশেষে আমি তাঁকে (কবর হতে) বের করলাম এবং একটি পৃথক কবরে তাঁকে দাফন করলাম।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 112450,
        "last_updated": null
    },
    {
        "banglaURN": 6013530,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 850,
        "babName": null,
        "hadithNumber": 1353,
        "hadithSanad": "",
        "hadithText": "জাবির ইব্‌নু ‘আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) উহুদের শহীদগণের দু’ দু’জনকে একত্র করে জিজ্ঞেস করেছিলেন, তাঁদের মধ্যে কুরআন সম্পর্কে কে অধিক জ্ঞাত? দুজনের কোন একজনের দিকে ইঙ্গিত করা হলে প্রথমে তাঁকে কবরে রাখতেন। অতঃপর ইরশাদ করেনঃ কিয়ামাতের দিন আমি তাঁদের জন্য সাক্ষী হব। তিনি রক্ত-মাখা অবস্থায়ই তাঁদের দাফন করার আদেশ করলেন এবং তাঁদের গোসলও দেননি।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 112460,
        "last_updated": null
    },
    {
        "banglaURN": 6013560,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 851,
        "babName": null,
        "hadithNumber": 1356,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, এক ইয়াহূদী বালক নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর খিদমাত করত, সে একবার অসুস্থ হয়ে পড়লে নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাকে দেখার জন্য আসলেন। তিনি তার মাথার নিকট বসে তাকে বললেনঃ তুমি ইসলাম গ্রহণ কর, সে তখন তার পিতার দিকে তাকাল, সে তার নিকটেই ছিল, পিতা তাকে বলল, আবুল কাসেম (নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কুনিয়াত) এর কথা মেনে নাও, তখন সে ইসলাম গ্রহণ করল। নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সেখান হতে বের হয়ে যাওয়ার সময় ইরশাদ করলেনঃ যাবতীয় প্রশংসা সে আল্লাহর, যিনি তাকে জাহান্নাম হতে মুক্তি দিলেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 112490,
        "last_updated": null
    },
    {
        "banglaURN": 6013570,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 851,
        "babName": null,
        "hadithNumber": 1357,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি এবং আমার মা (লুবাবাহ্‌ বিন্‌ত হারিস) মুসতায’আফীন (দুর্বল, অসহায়) এর অন্তর্ভুক্ত ছিলাম। আমি ছিলাম না-বালিগ শিশুদের মধ্যে আর আমার মা ছিলেন মহিলাদের মধ্যে।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 112500,
        "last_updated": null
    },
    {
        "banglaURN": 6013580,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 851,
        "babName": null,
        "hadithNumber": 1358,
        "hadithSanad": "",
        "hadithText": "শুআইব (রহঃ) থেকে বর্ণিতঃ ইব্‌নু শিহাব (রহঃ)  বলেছেন, নবজাত শিশু মারা গেলে তাঁদের প্রত্যেকের জানাযার সালাত আদায় করা হবে। যদিও সে কোন ভ্রষ্টা মায়ের সন্তানও হয়। এ কারণে যে, সে সন্তানটি ইসলামী ফিত্‌রাহ্‌র (তাওহীদ) এর উপর জন্মলাভ করেছে। তার পিতামাতা ইসলামের দাবীদার হোক বা বিশেষভাবে তার পিতা। যদিও তার মা ইসলাম ব্যতীত অন্য কোন ধর্মের অনুসারী হয়। নবজাত শিশু সরবে কেঁদে থাকলে তার জানাযার সালাত আদায় করা হবে। আর যে শিশু না কাঁদবে, তার জানাযার সালাত আদায় করা হবে না। কেননা, সে অপূর্ণাঙ্গ সন্তান। কারণ, আবূ হুরায়রা (রাঃ) হাদীস বর্ণনা করতেন যে, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ইরশাদ করেছেনঃ প্রতিটি নবজাতকই জন্মলাভ করে ফিত্‌রাতের (তাওহীদের) উপর। অতঃপর তার মা-বাপ তাকে ইয়াহূদী বা খ্রিস্টান বা অগ্নিপূজারী রূপে গড়ে তোলে। যেমন, চতুষ্পদ পশু নিখুঁত বাচ্চা জন্ম দেয়। তোমরা কি তাদের মধ্যে কোন কান কাটা দেখতে পাও? (বরং মানুষরাই তার নাক কান কেটে দিয়ে  বা ছিদ্র করে তাকে বিকৃত করে থাকে। অনুরূপ ইসলামের ফিত্‌রাহ্‌তে ভূমিষ্ট সন্তানকে মা-বাপ তাদের শিক্ষা-দীক্ষা ও জীবন ধারায় প্রবাহিত করে ভ্রান্ত ধর্মী বানিয়ে ফেলে) পড়ে আবূ হুরায়রা (রাঃ) তিলাওয়াত করলেনঃ (فِطْرَةَ اللَّهِ الَّتِي فَطَرَ النَّاسَ عَلَيْهَا) \"আল্লাহর দেয়া ফিত্‌রাতের অনুসরন কর যে ফিত্‌রাতের উপর তিনি মানুষ সৃষ্টি করেছেন -\" (সূরা রূমঃ ৩০)</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 112510,
        "last_updated": null
    },
    {
        "banglaURN": 6013590,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 851,
        "babName": null,
        "hadithNumber": 1359,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ইরশাদ করেছেনঃ প্রত্যেক নবজাতকই ফিত্‌রাতের উপর জন্মলাভ করে। অতঃপর তার পিতামাতা তাকে ইয়াহূদী, নাসারা বা মাজূসী (অগ্নিপূজারী) রূপে গড়ে তোলে। যেমন, চতুষ্পদ পশু একটি পূর্নাঙ্গ বাচ্চা জন্ম দেয়। তোমরা কি তাকে কোন (জন্মগত) কানকাটা দেখতে পাও? অতঃপর আবূ হুরায়রা তিলাওয়াত করলেনঃ  (فِطْرَةَ اللَّهِ الَّتِي فَطَرَ النَّاسَ عَلَيْهَا لا تَبْدِيلَ لِخَلْقِ اللَّهِ ذَلِكَ الدِّينُ الْقَيِّمُ)  (যার অর্থ) “আল্লাহর দেয়া ফিত্‌রাতের অনুসরণ কর, যে ফিত্‌রাতের উপর তিনি মানুষ সৃষ্টি করেছেন, এটাই সরল সুদৃঢ় দ্বীন”- (সূরা রুমঃ ৩০)।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 112520,
        "last_updated": null
    },
    {
        "banglaURN": 6013600,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 852,
        "babName": null,
        "hadithNumber": 1360,
        "hadithSanad": "",
        "hadithText": "সাঈদ ইব্‌নু মুসাইয়্যাব (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আবূ তালিব এর মৃত্যুর সময় উপস্থিত হলে, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তার নিকট আসলেন। তিনি সেখানে আবূ জাহ্‌ল ইব্‌নু হিশাম ও ‘আবদুল্লাহ্‌ ইব্‌নু আবূ উমায়্যা ইব্‌নু মুগীরাকে উপস্থিত দেখতে পেলেন। (রাবী বলেন) আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আবূ তালিবকে লক্ষ্য করে বললেনঃ চাচাজান! ‘লা-ইলাহা-ইল্লাল্লাহু’ কালিমা পাঠ করুন, তাহলে এর অসীলায় আমি আল্লাহর সমীপে আপনার জন্য সাক্ষী দিতে পারব। আবূ জাহ্‌ল ও ‘আবদুল্লাহ্‌ ইব্‌নু আবূ উমায়্যা বলে উঠল, ওহে আবূ তালিব! তুমি কি আবদুল মুত্তালিবের ধর্ম হতে বিমুখ হবে? অতঃপর আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তার নিকট কালিমাহ পেশ করতে থাকেন, আর তারা দু’জনও তাদের উক্তি পুনরাবৃত্তি করতে থাকে। অবশেষে আবূ তালিব তাদের সামনে শেষ কথাটি যা বলল, তা এই যে, সে আবদুল মুত্তালিবের ধর্মের উপর অবিচল রয়েছে, সে ‘লা-ইলাহা-ইল্লাল্লাহু’ বলতে অস্বীকার করল। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ আল্লাহর কসম! তবুও আমি আপনার জন্য মাগফিরাত কামনা করতে থাকব, যতক্ষণ না আমাকে তা হতে নিষেধ করা হয়। এ প্রসঙ্গে আল্লাহ তা'আলা নাযিল করেনঃ - (নবীর জন্য সঙ্গত নয়......)  مَا كَانَ لِلنَّبِيِّ..  (সূরা আত্‌-তাওবাহ্ঃ ১১৩)।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 113,
        "matchingArabicURN": 112530,
        "last_updated": null
    },
    {
        "banglaURN": 6013610,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 853,
        "babName": null,
        "hadithNumber": 1361,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এমন দু’টি কবরের পাশ দিয়ে যাচ্ছিলেন যে কবর দু’টির বাসিন্দাদের উপর আযাব দেয়া হচ্ছিল। তখন তিনি বললেনঃ এদের দুজনকে আযাব দেয়া হচ্ছে অথচ তাদের এমন গুনাহর জন্য আযাব দেয়া হচ্ছে না (যা হতে বিরত থাকা) দুরূহ ছিল। তাদের একজন পেশাবের ব্যাপারে সতর্কতা অবলম্বন করত না, আর অপরজন চোগলখুরী করে বেড়াত। অতঃপর তিনি খেজুরের একটি তাজা ডাল নিয়ে তা দু’ভাগে বিভক্ত করলেন, অতঃপর প্রতিটি কবরে একটি করে পুঁতে দিলেন। সাহাবীগন জিজ্ঞেস করলেন, হে আল্লাহর রসূল! আপনি কেন এরূপ করলেন? তিনি বললেনঃ ডাল দুটি না শুকানো পর্যন্ত আশা করি তাদের আযাব হালকা করা হবে।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 114,
        "matchingArabicURN": 112540,
        "last_updated": null
    },
    {
        "banglaURN": 6013620,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 854,
        "babName": null,
        "hadithNumber": 1362,
        "hadithSanad": "",
        "hadithText": "‘আলী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা বাকী’উল গারক্বাদ (কবরস্থানে) এক জানাযায় উপস্থিত ছিলাম। নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাদের নিকট আগমন করলেন। তিনি উপবেশন করলে আমরাও তাঁর চারদিকে বসে পড়লাম। তাঁর হাতে একটি ছড়ি ছিল। তিনি নীচের দিকে তাকিয়ে তাঁর ছড়িটি দ্বারা মাটি খুঁড়তে লাগলেন। অতঃপর বললেনঃ তোমাদের মধ্যে এমন কেউ নেই, অথবা বললেনঃ এমন কোন সৃষ্ট প্রাণী নেই, যার জন্য জান্নাত ও জাহান্নামে জায়গা নির্ধারিত করে দেয়া হয়নি আর এ কথা লিখে দেয়া হয়নি যে, সে দুর্ভাগা হবে কিংবা ভাগ্যবান। তখন এক ব্যক্তি আরয করল, হে আল্লাহর রসূল! তা হলে কি আমরা আমাদের ভাগ্যলিপির উপর ভরসা করে আমল করা ছেড়ে দিব না? কেননা, আমাদের মধ্যে যারা ভাগ্যবান তারা অচিরেই ভাগ্যবানদের আমলের দিকে ধাবিত হবে। আর যারা দুর্ভাগা তারা অচিরেই দুর্ভাগাদের আমলের দিকে ধাবিত হবে। তিনি বললেনঃ যারা ভাগ্যবান, তাদের জন্য সৌভাগ্যের আমল সহজ করে দেয়া হয় আর ভাগ্যাহতদের জন্য দুর্ভাগ্যের আমল সহজ করে দেয়া হয়। অতঃপর তিনি এ আয়াতে তিলাওয়াত করলেনঃ فَاَمَّا مَنْ اَعْطى – وَاتقى الاية “কাজেই যে দান করে এবং তাক্‌ওয়া অবলম্বন করে আর ভাল কথাকে সত্য বলে বুঝেছে” - (সূরা লাইলঃ ৫)</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 115,
        "matchingArabicURN": 112550,
        "last_updated": null
    },
    {
        "banglaURN": 6013650,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 855,
        "babName": null,
        "hadithNumber": 1365,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ যে ব্যক্তি ফাঁস লাগিয়ে আত্মহত্যা করবে, সে জাহান্নামে (অনুরূপভাবে) নিজেকে ফাঁস লাগাতে থাকবে আর যে ব্যক্তি বর্শার আঘাতে আত্মহত্যা করবে, সে জাহান্নামে (অনুরূপভাবে) বর্শা বিদ্ধ হতে থাকবে।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 117,
        "matchingArabicURN": 112580,
        "last_updated": null
    },
    {
        "banglaURN": 6013660,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 856,
        "babName": null,
        "hadithNumber": 1366,
        "hadithSanad": "",
        "hadithText": "‘উমর ইব্‌নু খাত্তাব (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, (মুনাফিক সর্দার) ‘আবদুল্লাহ্‌ ইব্‌নু ‘উবাই ইব্‌নু সালূল [১] মারা গেলে জানাযার সালাতের জন্য আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে আহবান করা হল। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) (সালাত আদায়ের উদ্দেশ্যে) দাঁড়ালে আমি দ্রুত তাঁর নিকট গিয়ে বসলাম, হে আল্লাহর রসূল ! আপনি ইব্‌নু ‘উবাই’র জানাযার সালাত আদায় করতে যাচ্ছেন? অথচ সে অমুক অমুক দিন (আপনার শানে এবং ঈমানদারদের সম্পর্কে) এই এই কথা বলেছে। এ বলে আমি তার উক্তিগুলো গুণেগুণে পুনরাবৃত্তি করলাম। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) মুচকি হাসি দিয়ে বললেন,  ‘উমর, সরে যাও ! আমি বারবার আপত্তি করলে তিনি বললেন, আমাকে (তার সালাত আদায় করার ব্যাপারে) ইখ্‌তিয়ার দেয়া হয়েছে। কাজেই আমি তা গ্রহণ করলাম। আমি যদি জানতাম যে, সত্তর বারের অধিক মাগফিরাত কামনা করলে তাকে  মাফ করা হবে তা হলে আমি অবশ্যই তার চেয়ে অধিক বার মাফ চাইতাম। ‘উমর (রাঃ) বলেন, অতঃপর আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তার জানাযার সালাত আদায় করেন এবং ফিরে আসেন। এর কিছুক্ষণ পরেই সূরা বারা’আতের এ দু’টি আয়াত নাযিল হলঃ وَلَا تُصَلِّ .... مِنْهُم ماتَ اَبَدًا - “তাদের কেউ মারা গেলে আপনি কখনো তার জানাযার সালাত আদায় করবেন না। এমতাবস্থায় যে তারা ফাসিক” (সূরা আত্তাওবাহ (৯) : ৮৪)। রাবী বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সামনে আমার ঐ দিনের দুঃসাহসিক আচরণ করায় আমি বিস্মিত হয়েছি। আল্লাহ্‌ এবং তাঁর রসূলই সমধিক অবগত।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 118,
        "matchingArabicURN": 112590,
        "last_updated": null
    },
    {
        "banglaURN": 6013670,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 857,
        "babName": null,
        "hadithNumber": 1367,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্‌নু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, কিছু সংখ্যক সাহাবী জানাযার পাশ দিয়ে যাচ্ছিলেন তখন তাঁরা তার প্রশংসা করলেন। তখন নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ ওয়াজিব হয়ে গেল। একটু পরে অপর একটি জানাযা অতিক্রম করলেন। তখন তাঁরা তার নিন্দাসূচক মন্তব্য করলেন। (এবারও) নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ ওয়াজিব হয়ে গেল। তখন ‘উমর ইব্‌নুল খাত্তাব (রাঃ) আরয করলেন, (হে আল্লাহর রসূল!) কি ওয়াজিব হয়ে গেল? তিনি বললেনঃ এ (প্রথম) ব্যক্তি সম্পর্কে তোমরা উত্তম মন্তব্য করলে, তাই তার জন্য জান্নাত ওয়াজিব হয়ে গেল। আর এ (দ্বিতীয়) ব্যক্তি সম্পর্কে তোমরা নিন্দাসূচক মন্তব্য করায় তার জন্য জাহান্নাম ওয়াজিব হয়ে গেল। তোমরা তো পৃথিবীতে আল্লাহর সাক্ষী।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 119,
        "matchingArabicURN": 112600,
        "last_updated": null
    },
    {
        "banglaURN": 6013680,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 857,
        "babName": null,
        "hadithNumber": 1368,
        "hadithSanad": "",
        "hadithText": "আবুল আসওয়াদ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি মদীনায় আসলাম, তখন সেখানে একটি রোগ (মহামারী আকারে) ছড়িয়ে পড়েছিল। আমি ‘উমর ইব্‌নুল খাত্তাব (রাঃ)-এর নিকট উপবিষ্ট ছিলাম। এ সময় তাদের পাশ দিয়ে একটি জানাযা অতিক্রম করল। তখন জানাযার লোকটি সম্পর্কে প্রশংসাসূচক মন্তব্য করা হল। ‘উমর (রাঃ) বললেন, ওয়াজিব হয়ে গেল। অতঃপর অপর একটি (জানাযা) অতিক্রম করল। তখন সে লোকটি সম্পর্কেও প্রশংসাসূচক মন্তব্য করা হল। (এবারও) তিনি বললেন, ওয়াজিব হয়ে গেল। অতঃপর তৃতীয় একটি (জানাযা) অতিক্রম করল, লোকটি সম্বন্ধে নিন্দাসূচক মন্তব্য করা হল। তিনি বললেন, ওয়াজিব হয়ে গেল। আবুল আসওয়াদ (রাঃ) বললেনঃ আমি বললাম, হে আমীরুল মু'মিনীন! কি ওয়াজিব হয়ে গেল? তিনি বললেন, আমি তেমনই বলেছি, যেমন নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছিলেন, যে কোন মুসলমান সম্পর্কে চার ব্যক্তি ভাল বলে সাক্ষ্য দিবে, আল্লাহ্‌ তাকে জান্নাতে দাখিল করবেন। ‘উমর (রাঃ) বলেনঃ তখন আমরা বলেছিলাম, তিনজন হলে? তিনি বললেন, তিনজন হলেও। আমরা বললাম, দু’জন হলে? তিনি বললেন, দু’জন হলেও। অতঃপর আমরা একজন সম্পর্কে আর তাঁকে জিজ্ঞেস করিনি।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 120,
        "matchingArabicURN": 112610,
        "last_updated": null
    },
    {
        "banglaURN": 6013690,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 858,
        "babName": null,
        "hadithNumber": 1369,
        "hadithSanad": "",
        "hadithText": "বারা’আ ইব্‌নু ‘আযিব (রাঃ) সূত্রে নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেন, মু’মিন ব্যক্তিকে যখন তার কবরে বসানো হয় তখন উপস্থিত করা হয় ফেরেশতাগণকে। অতঃপর (ফেরেশতাগণের প্রশ্নের উত্তরে) সে সাক্ষ্য প্রদান করে যে,  – لآ الهَ الَّا اللهُ وَأَنَّ مُحَمَّدًا رَسُوْلُ اللهِ  “আল্লাহ্‌ ব্যতীত প্রকৃত কোন ইলাহ নেই আর মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আল্লাহর রসূল।” এটা আল্লাহর কালামঃ (যার অর্থ) “আল্লাহ্‌ পার্থিব জীবনে ও আখিরাতে অবিচল রাখবেন সে সকল লোককে যারা ঈমান এনেছে, প্রতিষ্ঠিত বাণীতে” - (সূরা ইব্‌রাহীমঃ ২৭)।\n\nশু’বাহ সূত্রে অনুরূপ বর্ণনা করেছেন। তবে তিনি অতিরিক্ত বলেছেন যে, , يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا আল্লাহ অবিচল রাখবেন যারা ঈমান এনেছে - এ আয়াত কবরের আযাব সম্পর্কে নাযিল হয়েছিল।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 121,
        "matchingArabicURN": 112620,
        "last_updated": null
    },
    {
        "banglaURN": 6013700,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 858,
        "babName": null,
        "hadithNumber": 1370,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) (বদরে নিহত) গর্তবাসীদের [১] দিকে ঝুঁকে দেখে বললেনঃ “তোমাদের সাথে রব যে ওয়াদা করেছিলেন, তা তোমরা বাস্তবে পেয়েছ তো?” - (সূরা আল-আ’রাফ (৭) : ৪৪)। তখন তাঁকে বলা হল, আপনি মৃতদের ডেকে কথা বলছেন? (ওরা কি শুনতে পায়?) তিনি বললেনঃ “তোমরা তাদের চেয়ে অধিক শুনতে পাও না, তবে তারা জবাব দিতে পারছে  না”। [২]</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 122,
        "matchingArabicURN": 112630,
        "last_updated": null
    },
    {
        "banglaURN": 6013710,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 858,
        "babName": null,
        "hadithNumber": 1371,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন যে, নিশ্চয়ই তারা এখন ভালভাবে জানতে (ও বুঝতে) পেরেছে যে, (কবর আযাব প্রসঙ্গে) আমি তাদের যা বলতাম তা বাস্তব। আল্লাহ্‌ তা’আলা ঘোষণা করেছেনঃ “আপনি (হে নবী !) নিশ্চিতই মৃতদের (কোন কথা) শোনাতে পারেন না” - (সূরা আন-নামালঃ ৮০)।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 123,
        "matchingArabicURN": 112640,
        "last_updated": null
    },
    {
        "banglaURN": 6013720,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 858,
        "babName": null,
        "hadithNumber": 1372,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ এক ইয়াহুদী স্ত্রীলোক ‘আয়িশা (রাঃ)-এর কাছে এসে কবর আযাব সম্পর্কে আলোচনা করে তাঁকে (দু’আ করে) বলল, আল্লাহ্‌ আপনাকে কবর আযাব হতে রক্ষা করুন ! পরে ‘আয়িশা (রাঃ) কবর আযাব সম্পর্কে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট জিজ্ঞেস করলেন। তিনি বললেনঃ হাঁ, কবর আযাব (সত্য)। ‘আয়িশা (রাঃ) বলেন, এরপর থেকে নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে এমন কোন সালাত আদায় করতে দেখিনি, যাতে তিনি কবর আযাব হতে আল্লাহর নিকট আশ্রয় প্রার্থনা করেননি। [এ হাদীসের বর্ণনায়] গুণদার (রহঃ)  অধিক উল্লেখ করেছেন যে, ‘কবর ‘আযাব একেবারে বাস্তব’।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 124,
        "matchingArabicURN": 112650,
        "last_updated": null
    },
    {
        "banglaURN": 6013730,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 858,
        "babName": null,
        "hadithNumber": 1373,
        "hadithSanad": "",
        "hadithText": "‘উরওয়া ইব্‌নু যুবাইর (রাঃ) থেকে বর্ণিতঃ তিনি আসমা বিন্‌ত আবূ বকর (রাঃ)-কে বলতে শুনেছেন যে, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) (একবার) দাঁড়িয়ে খুৎবাহ দিচ্ছিলেন তাতে তিনি কবরে মানুষ যে কঠিন পরীক্ষার সম্মুখীন হবে, তার বর্ণনা দিলে মুসলমানগণ ভয়ার্ত চিৎকার করতে লাগলেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 125,
        "matchingArabicURN": 112660,
        "last_updated": null
    },
    {
        "banglaURN": 6013740,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 858,
        "babName": null,
        "hadithNumber": 1374,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্‌নু মালিক (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ বান্দাকে যখন তার কবরে রাখা হয় এবং তার সাথীরা এতটুকু মাত্র দূরে যায় যে, সে তখনও তাদের জুতার আওয়াজ শুনতে পায়। [২৯] এ সময় দু’জন ফেরেশতা তার নিকট এসে তাকে বসান এবং তাঁরা বলেন, এ ব্যক্তি অর্থাৎ মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সম্পর্কে তুমি কী বলতে? তখন মু’মিন ব্যক্তি বলবে, আমি সাক্ষ্য দিচ্ছি যে, তিনি আল্লাহর বান্দা এবং তাঁর রসূল। তখন তাঁকে বলা হবে, জাহান্নামে তোমার অবস্থান স্থলটির দিকে নযর কর, আল্লাহ্‌ তোমাকে তার বদলে জান্নাতের একটি অবস্থান স্থল দান করেছেন। তখন সে দুটি স্থলের দিকেই দৃষ্টি করে দেখবে। কাতাদা (রহঃ)  বলেন, আমাদের নিকট বর্ণনা করা হয়েছে যে, সে ব্যক্তির জন্য তাঁর কবর প্রশস্ত করে দেয়া হবে। অতঃপর তিনি (কাতাদা) পুনরায় আনাস (রাঃ)-এর হাদীসের বর্ণনায় ফিরে আসেন। তিনি [আনাস (রাঃ) ] বলেন, আর মুনাফিক বা কাফির ব্যক্তিকেও প্রশ্ন করা হবে তুমি এ ব্যক্তি (মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ) সম্পর্কে কী বলতে? সে উত্তরে বলবে, আমি জানি না। লোকেরা যা বলত আমি তা-ই বললাম। তখন তাকে বলা হবে, তুমি না নিজে জেনেছ, না তিলাওয়াত করে শিখেছ। আর তাকে লোহার মুগুর দ্বারা এমনভাবে আঘাত করা হবে, যার ফলে সে এমন বিকট চিৎকার করে উঠবে যে, দু’ জাতি (মানুষ ও জ্বিন) ছাড়া তার আশপাশের সকলেই তা শুনতে পাবে।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 126,
        "matchingArabicURN": 112670,
        "last_updated": null
    },
    {
        "banglaURN": 6013750,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 859,
        "babName": null,
        "hadithNumber": 1375,
        "hadithSanad": "",
        "hadithText": "আবূ আইয়ুব [আনসারী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, (একবার) সূর্য ডুবে যাওয়ার পর নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বের হলেন। তখন তিনি একটি আওয়াজ শুনতে পেয়ে বলেনঃ ইয়াহূদীদের কবরে আযাব দেয়া হচ্ছে। (এটা আযাব দেয়ার বা আযাবের ফেরেশতাগণের বা ইয়াহূদীদের আওয়াজ।) [ইমাম বুখারী (রহঃ)  বলেন] নযর (রহঃ) .......আবূ আইয়ুব (রাঃ) সূত্রে নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে (অনুরূপ) বলেছেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 127,
        "matchingArabicURN": 112681,
        "last_updated": null
    },
    {
        "banglaURN": 6013760,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 859,
        "babName": null,
        "hadithNumber": 1376,
        "hadithSanad": "",
        "hadithText": "খালিদ ইব্‌নু সাঈদ ইব্‌নু ‘আস (রাঃ) থেকে বর্ণিতঃ তিনি নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে কবরের শাস্তি হতে আশ্রয় প্রার্থনা করতে শুনেছেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 128,
        "matchingArabicURN": 112700,
        "last_updated": null
    },
    {
        "banglaURN": 6013770,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 859,
        "babName": null,
        "hadithNumber": 1377,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) দু’আ করতেন, হে আল্লাহ! আমি আপনার সমীপে পানাহ চাচ্ছি কবরের শাস্তি হতে, জাহান্নামের শাস্তি হতে, জীবন ও মরণের ফিতনা হতে এবং মাসীহ দাজ্জাল এর ফিতনা হতে।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 129,
        "matchingArabicURN": 112710,
        "last_updated": null
    },
    {
        "banglaURN": 6013780,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 860,
        "babName": null,
        "hadithNumber": 1378,
        "hadithSanad": "",
        "hadithText": "ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, (একবার) নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) দু’টি কবরের পাশ দিয়ে যাচ্ছিলেন। তখন তিনি বললেন, ঐ দু’জনকে আযাব দেয়া হচ্ছে আর কোন কঠিন কাজের কারণে তাদের আযাব দেয়া হচ্ছে না। অতঃপর তিনি (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ হ্যাঁ (আযাব দেয়া হচ্ছে) তবে তাদের একজন পরনিন্দা করে বেড়াত, অন্যজন তার পেশাবের ব্যাপারে সতর্কতা অবলম্বন করত না। (রাবী বলেন) অতঃপর তিনি একটি তাজা ডাল নিয়ে তা দু’খন্ডে ভেঙ্গে ফেললেন। অতঃপর সে দু’খন্ডের প্রতিটি এক এক কবরে পুঁতে দিলেন। অতঃপর বললেনঃ আশা করা যায় যে এ দু’টি শুকিয়ে না যাওয়া পর্যন্ত তাদের উভয়ের ‘আযাব হালকা করা হবে।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 130,
        "matchingArabicURN": 112720,
        "last_updated": null
    },
    {
        "banglaURN": 6013790,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 880,
        "babName": null,
        "hadithNumber": 1379,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ ইবনু ‘উমর (রাঃ) থেকে বর্ণিতঃ আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ তোমাদের কেউ মারা গেলে অবশ্যই তার সামনে সকাল ও সন্ধ্যায় তার অবস্থান স্থল উপস্থাপন করা হয়। যদি সে জান্নাতী হয়, তবে (অবস্থান স্থল) জান্নাতীদের মধ্যে দেখানো হয়। আর সে জাহান্নামী হলে, তাকে জাহান্নামীদের (অবস্থান স্থল দেখানো হয়) আর তাকে বলা হয়, এ হচ্ছে তোমার অবস্থান স্থল, ক্বিয়ামত দিবসে আল্লাহ তোমাকে পুনরুত্থিত করা অবধি।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 131,
        "matchingArabicURN": 112730,
        "last_updated": null
    },
    {
        "banglaURN": 6013800,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 881,
        "babName": null,
        "hadithNumber": 1380,
        "hadithSanad": "",
        "hadithText": "আবূ সাঈদ খুদরী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, মৃত ব্যক্তিকে খাটিয়ায় রেখে লোকেরা যখন কাঁধে বহন করে নিয়ে যায়, তখন সে নেককার হলে বলতে থাকে, আমাকে এগিয়ে নিয়ে চল, আমাকে এগিয়ে নিয়ে চল; আর সে নেককার না হলে বলতে থাকে হায় আফসোস! এটাকে নিয়ে তোমরা কোথায় যাচ্ছ? মানুষ ব্যতীত সব কিছুই তার এ আওয়াজ শুনতে পায়। মানুষেরা তা শুনতে পেলে অবশ্যই অজ্ঞান হয়ে পড়ত।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 132,
        "matchingArabicURN": 112740,
        "last_updated": null
    },
    {
        "banglaURN": 6013810,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 882,
        "babName": null,
        "hadithNumber": 1381,
        "hadithSanad": "",
        "hadithText": "আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ যে কোন মুসলিম ব্যক্তির এমন তিনটি (সন্তান) মারা যাবে, যারা বালিগ হয়নি, আল্লাহ তাদের প্রতি তাঁর রহমতের ফযলে সে ব্যক্তিকে (মা-বাপকে) জান্নাতে প্রবেশ করাবেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 133,
        "matchingArabicURN": 112750,
        "last_updated": null
    },
    {
        "banglaURN": 6013820,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 882,
        "babName": null,
        "hadithNumber": 1382,
        "hadithSanad": "",
        "hadithText": "বারা’আ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, (নবী  তনয়) ইবরাহীম (রাঃ) –এর মৃত্যু হলে, আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ তাঁর জন্য তো জান্নাতে একজন দুধ-মা রয়েছেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 134,
        "matchingArabicURN": 112760,
        "last_updated": null
    },
    {
        "banglaURN": 6013830,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 883,
        "babName": null,
        "hadithNumber": 1383,
        "hadithSanad": "",
        "hadithText": "ইবনু আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে মুশরিকদের শিশু সন্তানদের সম্পর্কে জিজ্ঞেস করা হলে তিনি বলেন: আল্লাহ তাদের সৃষ্টি লগ্নেই তাদের ভবিষ্যৎ আমল সম্পর্কে সম্যক জ্ঞাত।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 135,
        "matchingArabicURN": 112770,
        "last_updated": null
    },
    {
        "banglaURN": 6013840,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 883,
        "babName": null,
        "hadithNumber": 1384,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে মুশরিকদের নাবালক সন্তান সম্পর্কে জিজ্ঞেস করা হলে বলেন: আল্লাহ তাদের ভবিষ্যৎ ‘আমল সম্পর্কে সম্যক জ্ঞাত।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 136,
        "matchingArabicURN": 112780,
        "last_updated": null
    },
    {
        "banglaURN": 6013850,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 883,
        "babName": null,
        "hadithNumber": 1385,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ইরশাদ করেন: প্রত্যেক নবজাতক ফিতরাতের উপর জন্মগ্রহণ করে। অত:পর তার মাতাপিতা তাকে ইয়াহুদী বা নাসারা অথবা অগ্নি উপাসক করে, যেমন চতুষ্পদ জন্তু একটি পূর্ণাঙ্গ বাচ্চা জন্ম দেয়। তোমরা কি তাকে (জন্মগত) কানকাটা দেখেছ?</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 137,
        "matchingArabicURN": 112790,
        "last_updated": null
    },
    {
        "banglaURN": 6013860,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 884,
        "babName": null,
        "hadithNumber": 1386,
        "hadithSanad": "",
        "hadithText": "সামুরা ইবনু জুনদুব (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) (ফজর) সালাত শেষে আমাদের দিকে মুখ ফিরিয়ে বসতেন এবং জিজ্ঞেস করতেন, তোমাদের কেউ গত রাতে কোন স্বপ্ন দেখেছ কি? (বর্ণনাকারী) বলেন, কেউ স্বপ্ন, দেখে থাকলে তিনি তা বিবৃত করতেন। তিনি তখন আল্লাহর মর্যী মুতাবিক তাবীর বলতেন। একদা আমাদেরকে প্রশ্ন করলেন, তোমাদের কেউ কি কোন স্বপ্ন দেখেছ? আমরা বললাম, জী না। নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃগত রাতে আমি দেখলাম, দু’জন লোক এসে আমার দু’হাত ধরে আমাকে পবিত্র ভূমির দিকে নিয়ে চললো। হঠাৎ দেখতে পেলাম, এক ব্যক্তি বসে আছে আর এক ব্যক্তি লোহার আঁকড়া হাতে দাঁড়িয়ে। [ইমাম বুখারী (রহঃ)  বলেন] আমাদের এক সাথী মু’সা (রহঃ)  বর্ণনা করেছেন যে, দাঁড়ানো ব্যক্তি বসে থাকা ব্যক্তির (এক পাশের) চোয়ালটা এমনভাবে আঁকড়া বিদ্ধ করছিল যে, তা (চোয়াল বিদীর্ণ করে) মস্তকের পিছনের দিক পর্যন্ত পৌছে যাচ্ছিল। অত:পর অপর চোয়ালটিও আগের মত বিদীর্ণ করল। ততক্ষণে প্রথম চোয়ালটা জোড়া লেগে যাচ্ছিল। আঁকড়াধারী ব্যক্তি পুণরায় সেরূপ করছিল। আমি জিজ্ঞেস করলাম, এ কী হচ্ছে? সাথীদ্বয় বললেন, (পরে বলা হবে এখন) চলুন। আমরা চলতে চলতে চিৎ হয়ে শায়িত এক ব্যক্তির পাশে এসে উপস্থিত হলাম, তার মাথার নিকট পাথর হাতে এক ব্যক্তি দাঁড়িয়ে পাথর দিয়ে তার মাথা চূর্ণ করে দিচ্ছিল। নিক্ষিপ্ত পাথর দূরে গড়িয়ে যাওয়ার ফলে তা তুলে নিয়ে শায়িত ব্যক্তির নিকট ফিরে আসার পূর্বেই বিচূর্ণ মাথা আগের মত জোড়া লেগে যাচ্ছিল। সে পুণরায় মাথার উপরে পাথর নিক্ষেপ করছিল। আমি জিজ্ঞেস করলাম, লোকটি কে? তাঁরা বললেন, চলুন। আমরা অগ্রসর হয়ে তন্দুরের ন্যায় এক গর্তের নিকট উপস্থিত হলাম। গর্তের উপরিভাগ ছিল সংকীর্ণ ও নীচের অংশ প্রশস্ত এবং এর তলদেশ হতে আগুন জ্বলছিল। আগুন গর্তের মুখের নিকটবর্তী হলে সেখানের লোকগুলোও উপরে চলে আসে যেন তারা গর্ত হতে বের হয়ে যাবে। আগুন ক্ষীণ হয়ে গেলে তারাও (তলদেশে) ফিরে যায়। গর্তের মধ্যে বহুসংখ্যক উলঙ্গ নারী-পুরুষ ছিল। জিজ্ঞেস করলাম, এরা কারা? তাঁরা বললেন, চলুন। আমরা চলতে চলতে একটি রক্ত প্রবাহিত নদীর কাছে হাযির হলাম। নদীর মাঝখানে এক ব্যক্তি দাঁড়ানো ছিল (ইমাম বুখারী (র.) বলেন) ইয়াযীদ ইব্‌ন হারূন ও ওহাব ইব্‌ন জারীর ইব্‌ন হাযিম (র.) বর্ণনায় وَ عَلَى شَتَ النّهَرِ رَجُلُ بَيْنَ يَديهِ حِجَارَةً রয়েছে। নদীর তীরে অপর এক ব্যক্তি যার সামনে ছিল পাথর। নদীর মাঝখানে লোকটি নদী হতে বের হয়ে আসার জন্য অগ্রসর হলেই তীরে দাঁড়ানো লোকটি সে ব্যক্তির মুখ বরাবর পাথর নিক্ষেপ করছিল, এতে সে পূর্বস্থানে ফিরিয়ে দিচ্ছিল। এমনভাবে যতবার সে তীরে উঠে আসতে চেষ্টা করে, ততবার সে ব্যক্তি তার মুখ বরাবর পাথর নিক্ষেপ করে পূর্বস্থানে ফিরে যেতে বাধ্য করে। আমি জানতে চাইলাম, এ ঘটনার কারণ কী? তাঁরা বললেন, চলতে থাকুন। আমরা চলতে চলতে একটি সবুজ বাগানে উপস্থিত হলাম। এতে একটি বড় গাছ ছিল। গাছটির গোড়ায় এক বৃদ্ধ ও বেশ কিছু বালক-বালিকা ছিল। হঠাৎ দেখি যে, গাছটির সন্নিকটে জনৈক ব্যক্তি আগুন জ্বালাচ্ছে। সাথীদ্বয় আমাকে নিয়ে গাছে আরোহণ করে এমন একটি বাড়িতে প্রবেশ করলেন যার চেয়ে সুদৃশ্য বাড়ি ইতিপূর্বে কখনো দেখিনি। বাড়িতে বহু সংখ্যক বৃদ্ধ, যুবক, নারী এবং বালক-বালিকা ছিল। অত:পর তাঁরা আমাকে সেখান হতে বের করে নিয়ে গাছে আরো উপরে আরোহণ করে অপর একটি বাড়িতে প্রবেশ করালেন। এটা পূর্বাপেক্ষা অধিক সুদৃশ্য ও মনোরম। বাড়িটিতে ছিল কতিপয় বৃদ্ধ ও যুবক। আমি বললাম, আজ রাতে আপনারা আমাকে (বহুদূর পর্যন্ত) ভ্রমণ করালেন। এবার বলুন, যা দেখলাম তার তাৎপর্য কী? তাঁরা বললেন, না, আপনি যে ব্যক্তির চোয়াল বিদীর্ণ করার দৃশ্য দেখলেন সে মিথ্যাবাদী; মিথ্যা কথা বলে বেড়াতো, তার বিবৃত মিথ্যা বর্ণনা ক্রমাগত বর্ণিত হয়ে দূর দূরান্তে পৌছে যেতো। ক্বিয়ামত পর্যন্ত তার সঙ্গে এ ব্যবহার করা হবে। আপনি যার মাথা পূর্ণ করতে দেখলেন, সে এমন ব্যক্তি যাকে আল্লাহ কুরআনের শিক্ষা দান করেছিলেন, কিন্তু রাতের বেলায় সে কুরআন হতে বিরত হয়ে নিদ্রা যেতো এবং দিনের বেলায় কুরআন অনুযায়ী ‘আমল করতো না। তার সাথে ক্বিয়ামত পর্যন্ত এইরূপই করা হবে। গর্তের মধ্যে যাদেরকে আপনি দেখলেন, তারা ব্যভিচারী। (রক্ত প্রবাহিত) নদীতে আপনি যাকে দেখলেন, সে সুদখোর। গাছের গোড়ায় যে বৃদ্ধ ছিলেন তিনি ইবরাহীম (আ.) এবং তাঁর চারপাশের বালক-বালিকারা মানুষের সন্তান। যিনি আগুন জ্বালাচ্ছিলেন তিনি হলেন, জাহান্নামের খাযিন-মালিক নামক ফেরেশতা। প্রথম যে বাড়িতে আপনি প্রবেশ করলেন তা সাধারণ মু’মিনদের বাসস্থান। আর এ বাড়িটি হলো শহীদগণের আবাস। আমি (হলাম) জিবরাঈল আর ইনি হলে মীকাইল। (এরপর জিবরাঈল আমাকে বললেন) আপনার মাথা উপরে উঠান। আমি উঠিয়ে মেঘমালার মত কিছু দেখলাম। তাঁরা বললেন, এটাই হলো আপনার আবাসস্থল। আমি বললাম, আমাকে ছেড়ে দিন আমি আমার আবাসস্থলে প্রবেশ করি। তাঁরা বললেন, এখনো আপনার আয়ু কিছু সময়ের জন্য রয়ে গেছে, যা এখনো পূর্ণ হয়নি। অবশিষ্ট সময় পূর্ণ হলে অবশ্যই আপনি স্বীয় আবাসে চলে আসবেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 138,
        "matchingArabicURN": 112800,
        "last_updated": null
    },
    {
        "banglaURN": 6013870,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 885,
        "babName": null,
        "hadithNumber": 1387,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আবূ বকর (রাঃ)-এর নিকট উপস্থিত হলে তিনি জিজ্ঞেস করলেন, কয় খন্ড কাপড়ে তোমরা নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে কাফন দিয়েছিলে?  ‘আয়িশা (রাঃ) বললেন, তিন খন্ড সাদা সাহুলী (স্থানের নাম) কাপড়ে, যার মধ্যে জামা ও পাগড়ী ছিল না। তিনি আবার জিজ্ঞেস করলেন, কোন দিন আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ইনতিকাল করেন?  ‘আয়িশা (রাঃ) বলেন, সোমবার। তিনি জিজ্ঞেস করলেন, আজ কী বার? তিনি [ ‘আয়িশা (রাঃ)] বললেন, আজ সোমবার। তিনি [আবূ বকর (রাঃ)] বললেন, আমি আশা করি এখন হতে আগত রাতের মধ্যে (আমার মৃত্যু হবে)। অতঃপর অসুস্থকালীন নিজের পরিধেয় কাপড়ের প্রতি লক্ষ্য করে তাতে জাফরানী রং এর চিহ্ন দেখতে পেয়ে বললেন, আমার এ কাপড়টি ধুয়ে তার সাথে আরো দু’খন্ড কাপড় বৃদ্ধি করে আমার কাফন দিবে। আমি (‘আয়িশা) বললাম, এটা (পরিধেয় কাপড়টি) পুরাতন। তিনি বললেন, মৃত ব্যক্তি অপেক্ষা জীবিতদের নতুন কাপড়ের প্রয়োজন অধিক। আর কাফন হলো বিগলিত শবদেহের জন্য। তিনি মঙ্গলবার রাতের সন্ধ্যায় ইনতিকাল করেন, ভোর হবার পূর্বেই তাঁকে দাফন করা হয়েছিল।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 139,
        "matchingArabicURN": 112810,
        "last_updated": null
    },
    {
        "banglaURN": 6013880,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 886,
        "babName": null,
        "hadithNumber": 1388,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, জনৈক ব্যক্তি নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বললেন, আমার মায়ের আকস্মিক মৃত্যু ঘটে, কিন্তু আমার বিশ্বাস তিনি (মৃত্যুর পূর্বে) কথা বলতে সক্ষম হলে কিছু সদকা করে যেতেন। এখন আমি তাঁর পক্ষ হতে সদকা করলে তিনি এর প্রতিফল পাবেন কি? তিনি [নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)] বললেন, হ্যাঁ।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 140,
        "matchingArabicURN": 112820,
        "last_updated": null
    },
    {
        "banglaURN": 6013890,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 887,
        "babName": null,
        "hadithNumber": 1389,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) রোগশয্যায় (স্ত্রীগণের নিকট অবস্থানের) পালার সময়কাল জানতে চাইতেন। আমার অবস্থান আজ কোথায় হবে? আগামীকাল কোথায় হবে? ‘আয়িশা (রাঃ)-এর পালা বিলম্বিত হচ্ছে বলে ধারণা করেই এ প্রশ্ন করতেন। [ ‘আয়িশা (রাঃ) বলেন] যে দিন আমার পালা আসলো, সেদিন আল্লাহ তাঁকে আমার কন্ঠদেশ ও বক্ষের মাঝে (হেলান দেয়া অবস্থায়) রূহ কব্‌য করলেন [৩০] এবং আমার ঘরে তাঁকে দাফন করা হয়।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 141,
        "matchingArabicURN": 112830,
        "last_updated": null
    },
    {
        "banglaURN": 6013910,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 887,
        "babName": null,
        "hadithNumber": 1391,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি আবদুল্লাহ্‌ ইবনু যুবাইর (রাঃ)-কে অসিয়্যত করেছিলেন, আমাকে তাঁদের (নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ও তাঁর দু’সাহাবী) পাশে দাফন করবে না। বরং আমাকে আমার সঙ্গিনীদের সাথে বাকী’তে দাফন করবে যাতে আমি চিরকালের জন্য প্রশংসিত হতে না থাকি।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 145,
        "matchingArabicURN": 112870,
        "last_updated": null
    },
    {
        "banglaURN": 6013920,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 887,
        "babName": null,
        "hadithNumber": 1392,
        "hadithSanad": "",
        "hadithText": "আমর ইবনু মায়মুন আওদী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি  ‘উমর (রাঃ)-কে দেখলাম তিনি নিজের ছেলে আবদুল্লাহ্‌ (রাঃ)-কে ডেকে বললেন, তুমি উম্মুল মু’মিনীন  ‘আয়িশা (রাঃ)-এর নিকট গিয়ে বল,  ‘উমর ইবনুল খাত্তাব (রাঃ) আপনাকে সালাম বলেছেন। অত:পর আমাকে আমার দু’জন সাথী (নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ও আবূ বক্‌র)-এর পাশে দাফন করতে তিনি রাযী আছেন কি না? [১]  ‘আয়িশা (রাঃ) বললেন, আমি পূর্ব হতেই নিজের জন্য এর আশা পোষণ করতাম, কিন্তু আজ  ‘উমর (রাঃ)-কে নিজের উপর অগ্রাধিকার দিচ্ছি। আবদুল্লাহ্‌ (রাঃ) ফিরে এলে  ‘উমর (রাঃ) তাঁকে জিজ্ঞেস করলেন, কি বার্তা নিলে এলে? তিনি বললেন, হে আমীরুল মু’মিনীন! তিনি [‘আয়িশা (রাঃ)] আপনাকে অনুমতি দিয়েছেন।  ‘উমর (রাঃ) বললেন, সেখানে শয্যা লাভই ছিল আমার নিকট সবচেয়ে গুরুত্বপূর্ণ বিষয়। আমার মৃত্যুর পর আমাকে বহন করে [ ‘আয়িশা (রাঃ)-এর নিকট উপস্থিত করে] তাঁকে সালাম জানিয়ে বলবে,  ‘উমর ইবনু খাত্তাব (পুণরায়) আপনার অনুমতি চাইছেন। তিনি অনুমতি দিলে, আমাকে সেখানে দাফন করবে। অন্যথায় আমাকে মুসলমানদের কবরস্থানে ফিরিয়ে নিয়ে আসবে। [২] অত:পর  ‘উমর (রাঃ) বলেন, এ কয়েকজন ব্যক্তি যাদের উপর আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) মৃত্যু পর্যন্ত সন্তুষ্ট ছিলেন, তাঁদের অপেক্ষা অন্য কাউকে আমি এ খিলাফতের (দায়িত্ব পালনে) অধিক যোগ্য বলে মনে করি না। তাই আমার তাঁরা (তাঁদের মধ্য হতে) যাঁকে খলীফা মনোনীত করবেন তিনি খলীফা হবেন। তোমরা সকলেই তাঁর আদেশ মেনে চলবে, তাঁর আনুগত্য করবে। এ বলে তিনি ‘উসমান, ‘আলী, তালহা, যুবাইর, ‘আবদুর রাহমান ইবনু আওফ ও সা’দ ইবনু আবূ ওয়াক্কাস (রাঃ)-এর নাম উল্লেখ করলেন। এ সময়ে এক আনসারী যুবক ‘উমর (রাঃ)-এর নিকট উপস্থিত হয়ে বললো, হে আমীরুল মু’মিনীন! আল্লাহ প্রদত্ত সুসংবাদ গ্রহণ করুন। আপনি ইসলামের ছায়াতলে দীর্ঘদিন অতিবাহিত করার সৌভাগ্য লাভ করেছেন যা আপনিও জানেন। অত:পর আপনাকে খলীফা নিযুক্ত করা হয় এবং আপনি ন্যায়বিচার করেছেন। সর্বোপরি আপনি শাহাদাত লাভ করেছেন।  ‘উমর (রাঃ) বললেন, হে ভাতিজা! যদি তা আমার জন্য লাভ লোকসানের না হয়ে বরাবর হয়, তবে কতই না ভাল হবে। (তিনি বললেন) আমার পরবর্তী খলীফাকে ওয়াসিয়্যাত করে যাচ্ছি, তিনি যেন প্রথম দিকের মুহাজিরদের ব্যাপারে যত্নবান হন, তাঁদের হক আদায় করে চলেন, যেন তাদের যথাযথ সম্মান প্রদর্শন করেন। আমি তাঁকে আনসারদের সাথেও সদাচারের উপদেশ দেই, যারা ঈমান ও মদীনাকে আঁকড়ে ধরে রয়েছেন, যেন তাঁদের মধ্যকার সৎকর্মপরায়ণদের কাজের স্বীকৃতি প্রদান করা হয় এবং তাঁদের মধ্যকার (লঘু) অপরাধীকে ক্ষমা করে দেয়া হয়। সর্বশেষে আল্লাহ ও তাঁর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর দায়িত্বভূক্ত (সর্বস্তরের মু’মিনদের সম্পর্কে) সতর্ক করে দিচ্ছি যেন মু’মিনদের সাথে কৃত অঙ্গীকার পূর্ণ করা হয়, তাদের রক্ষার জন্য যুদ্ধ করা হয় এবং সাধ্যের বাইরে কোন দায়িত্ব তাদের উপর অর্পণ করা না হয়।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 146,
        "matchingArabicURN": 112880,
        "last_updated": null
    },
    {
        "banglaURN": 6013930,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 888,
        "babName": null,
        "hadithNumber": 1393,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন: তোমরা মৃতদের গালি দিও না। কারণ, তারা স্বীয় কর্মফল পর্যন্ত পৌছে গেছে। [ইমাম বুখারী (রহঃ)  বলেন] ‘আবদুল্লাহ্‌ ইবনু ‘আবদুল কুদ্দুস ও মুহাম্মাদ ইবনু আনাস (রহঃ)  আ’মাশ (রহঃ)  হতে হাদীসটি বর্ণনা করেছেন। ‘আলী ইবনু জা’দ, ইবনু আর’আরা ও ইবনু আবূ ‘আদী (রহঃ) শু’বাহ (রহঃ)  হতে হাদীস বর্ণনায় আদম (রহঃ)-এর অনুসরণ করেছেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 147,
        "matchingArabicURN": 112890,
        "last_updated": null
    },
    {
        "banglaURN": 6013940,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": null,
        "babNumber": 889,
        "babName": null,
        "hadithNumber": 1394,
        "hadithSanad": "",
        "hadithText": "ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আবূ লাহাব লানাতুল্লাহি আলাইহি নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে লক্ষ্য করে বললো, সারা দিনের জন্য তোমার অনিষ্ট হোক! (তার এ কথার পরিপ্রেক্ষিতে) নাযিল হয়: (যার অর্থ) “আবূ লাহাবের হাত দু’টো ধ্বংস হোক এবং সেও ধ্বংস হোক” – (আল-মাসাদ:১)।[১]</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 148,
        "matchingArabicURN": 112900,
        "last_updated": null
    },
    {
        "banglaURN": 6012811,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "",
        "babNumber": 678,
        "babName": "",
        "hadithNumber": 1281,
        "hadithSanad": "",
        "hadithText": "যায়নাব বিন্‌তু আবূ সালামা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সহধর্মিণী উম্মু হাবীবা (রাঃ)-এর নিকটে গেলাম। তখন তিনি বললেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছি, যে স্ত্রীলোক আল্লাহ্‌ এবং ক্বিয়ামত দিবসের প্রতি ঈমান রাখে তার পক্ষে কোন মৃত ব্যক্তির জন্য তিন দিনের বেশী শোক পালন করা বৈধ নয়। তবে স্বামীর জন্য চার মাস দশ দিন (বৈধ)।\n\nযায়নাব বিন্‌তু আবূ সালামা (রাঃ) থেকে বর্ণিতঃ অতঃপর যায়নাব বিন্‌তু জাহ্‌শ (রাঃ)-এর ভ্রাতার মৃত্যু হলে আমি তাঁর নিকট গেলাম। তখন তিনি কিছু সুগন্ধি আনয়ন করিয়ে তা ব্যবহার করলেন। অতঃপর বললেন, সুগন্ধি ব্যবহারের আমার কোন প্রয়োজন নেই, তবু যেহেতু আমি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছি, যে ব্যক্তি আল্লাহ্‌ এবং ক্বিয়ামত দিবসের প্রতি ঈমান রাখে এমন কোন স্ত্রীলোকের পক্ষে কোন মৃত ব্যক্তির জন্য তিন দিনের অধিক শোক পালন করা বৈধ নয়। তবে স্বামীর জন্য চার মাস দশ দিন (শোক পালন করবে)। [১২]</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 111711,
        "last_updated": null
    },
    {
        "banglaURN": 6012862,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "",
        "babNumber": 680,
        "babName": "",
        "hadithNumber": 1286,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ ইব্‌নু ‘উবাইদুল্লাহ্‌ ইব্‌নু আবূ মুলাইকা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, মক্কায় উসমান (রাঃ)-এর জনৈকা কন্যার মৃত্যু হল। আমরা সেখানে (জানাযায়) অংশগ্রহন করার জন্য গেলাম। ইব্‌নু ‘উমর এবং ইব্‌নু ‘আব্বাস (রাঃ) -ও সেখানে উপস্থিত হলেন। আমি তাঁদের দু’জনের মধ্যে উপবিষ্ট ছিলাম, অথবা তিনি বলেছেন, আমি তাঁদের একজনের পার্শ্বে গিয়ে উপবেশন করলাম, পরে অন্যজন আগমন করে আমার পার্শ্বে উপবেশন করলেন। (ক্রন্দনের শব্দ শুনে) ইব্‌নু ‘উমর (রাঃ) ‘আমর ইব্‌নু ‘উসমানকে বললেন, তুমি কেন ক্রন্দন করতে নিষেধ করছ না? কেননা, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ ‘মৃত ব্যক্তিকে তার পরিজনদের কান্নার কারণে ‘আযাব দেয়া হয়।’\n\nইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তখন ইব্‌নু ‘আব্বাস (রাঃ) বললেন, ‘উমর (রাঃ) -ও এমন কিছু বলতেন। অতঃপর ইব্‌নু ‘আব্বাস (রাঃ) বর্ণনা করলেন, ‘উমর (রাঃ)-এর সাথে মক্কা থেকে প্রত্যাবর্তন করছিলাম। আমরা বাইদা (নামক স্থানে) উপস্থিত হলে ‘উমর (রাঃ) বাবলা বৃক্ষের ছায়ায় একটি কাফিলা দর্শন করতঃ আমাকে বললেন, গিয়ে দেখো এ কাফিলা কার? ইব্‌নু ‘আব্বাস (রাঃ) বলেন, আমি গিয়ে দেখলাম সেখানে সুহাইব (রাঃ) আছেন। আমি তাঁকে তা অবহিত করলাম। তিনি বললেন, তাঁকে আমার কাছে ডেকে নিয়ে এসো। আমি সুহাইব (রাঃ)-এর নিকট আবার গেলাম এবং বললাম, চলুন, আমীরুল মু’মিনীনের সঙ্গে সাক্ষাৎ করুন। অতঃপর যখন ‘উমর (রাঃ) (ঘাতকের আঘাতে) আহত হলেন, তখন সুহাইব (রাঃ) তাঁর কাছে আগমন করতঃ এ বলে ক্রন্দন করতে লাগলেন, হায় আমার ভাই! হায় আমার বন্ধু! এতে  ‘উমর (রাঃ) তাঁকে বললেন, তুমি আমার জন্য ক্রন্দন করছো? অথচ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ মৃত ব্যক্তির জন্য তার আপন জনের কোন কোন কান্নার কারণে অবশ্যই তাকে ‘আযাব দেয়া হয়।\n\nইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ ইব্‌নু ‘আব্বাস (রাঃ) বলেন, ‘উমর (রাঃ)-এর মৃত্যুর পর ‘আয়িশা (রাঃ)-এর নিকট আমি ‘উমর (রাঃ)-এর এ উক্তি উল্লেখ করলাম। তিনি বললেন, আল্লাহ্‌ ‘উমর (রাঃ)-কে রহম করুন। আল্লাহর কসম! আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এ কথা বলেননি যে, আল্লাহ্‌ ঈমানদার (মৃত) ব্যক্তিকে তার পরিজনের কান্নার কারণে আযাব দিবেন। তবে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ আল্লাহ্‌ তা‘আলা কাফিরদের আযাব বাড়িয়ে দেন তার পরিজনের কান্নার কারণে। অতঃপর ‘আয়িশা (রাঃ) বললেন, (এ ব্যাপারে) আল্লাহর কুরআনই তোমাদের জন্য যথেষ্ট। (ইরশাদ হয়েছে) : ‘বোঝা বহনকারী কোন ব্যক্তি অপরের বোঝা বহন করবে না’- (আন‘আম ১৬৪)। তখন ইব্‌নু ‘আব্বাস (রাঃ) বললেন, আল্লাহ্‌ই (বান্দাকে) হাসান এবং কাঁদান করান। রাবী ইব্‌নু আবূ মুলাইকা (রহঃ)  বলেন, আল্লাহর কসম! (এ কথা শুনে) ইব্‌নু ‘উমর কোন মন্তব্য করলেন না।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 111762,
        "last_updated": null
    },
    {
        "banglaURN": 6013121,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "",
        "babNumber": 697,
        "babName": "",
        "hadithNumber": 1312,
        "hadithSanad": "",
        "hadithText": "‘আবদুর রহমান ইব্‌নু আবূ লাইলাহ (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, সাহ্‌ল ইব্‌নু হুনাইফ ও কায়স ইব্‌নু সা’দ (রাঃ) কাদিসিয়াতে উপবিষ্ট ছিলেন, তখন লোকেরা তাদের সামনে দিয়ে একটি জানাযা নিয়ে যাচ্ছিল। (তা দেখে) তারা দাঁড়িয়ে গেলেন। তখন তাদের বলা হল, এটা তো এ দেশীয় জিম্মী ব্যক্তির (অমুসলিমের) জানাযা। তখন তারা বললেন, (একদা) নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সামনে দিয়ে একটি জানাযা যাচ্ছিল। তখন তিনি দাঁড়িয়ে গেলে তাঁকে বলা হল, এটা তো এক ইয়াহুদীর জানাযা। তিনি এরশাদ করলেনঃ সে কি মানুষ নয়? [১৯]\n\nইবন আবূ লাযলাহ (রহ.) থেকে বর্ণিতঃ তিনি বলেন, আমি সাহল এবং কায়স (রাঃ) এর সঙ্গে ছিলাম। তখন তারা দু'জন বললেন,আমরা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সঙ্গে ছিলাম। জাকারিয়া (রহঃ) সূত্রে ইবনু আবূ লাযলাহ (রহঃ) হতে বর্ণনা করেন,আবূ মাস'উদ ও কায়স (রাঃ) জানাযা যেতে দেখলে দাড়িয়ে যেতেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 112021,
        "last_updated": null
    },
    {
        "banglaURN": 6013231,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "",
        "babNumber": 705,
        "babName": "",
        "hadithNumber": 1323,
        "hadithSanad": "",
        "hadithText": "নাফি’ (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, ইব্‌নু ‘উমর (রাঃ)-এর নিকট বর্ণনা করা হল যে, আবূ হুরায়রা (রাঃ) বলে থাকেন, যিনি জানাযার পশ্চাতে গমন করবেন তিনি এক কীরাত সওয়াবর অধিকারী হবেন। তিনি বললেন, আবূ হুরায়রা (রাঃ) আমাদের বেশি বেশি হাদীস শোনান।\n\nনাফি’ (রহঃ) থেকে বর্ণিতঃ তবে ‘আয়িশা (রাঃ) এ বিষয়ে আবূ হুরায়রা (রাঃ)-কে সমর্থন জানিয়েছেন। তিনি বলেছেন, আমিও আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে এ হাদীস বলতে শুনেছি। ইব্‌নু ‘উমর (রাঃ) বললেন, তা হলে তো আমরা অনেক কীরাত (সওয়াব) হারিয়ে ফেলেছি। ‘ فَرَّطْت ’ এর অর্থ আল্লাহর আদেশ আমি খুইয়ে ফেলেছি।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 112131,
        "last_updated": null
    },
    {
        "banglaURN": 6013271,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "",
        "babNumber": 708,
        "babName": "",
        "hadithNumber": 1327,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) নাজাশীর মৃত্যুর দিনই আমাদের তাঁর মৃত্যুর খবর জানান এবং ইরশাদ করেনঃ তোমরা তোমাদের ভাই-এর (নাজাশীর) জন্য ক্ষমা প্রার্থনা কর। [২২]\n\nআবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁদের নিয়ে মুসাল্লায় কাতার করলেন, অতঃপর চার তাকবীর আদায় করলেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 112181,
        "last_updated": null
    },
    {
        "banglaURN": 6013471,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "",
        "babNumber": 723,
        "babName": "",
        "hadithNumber": 1347,
        "hadithSanad": "",
        "hadithText": "জাবির ইব্‌নু আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) উহুদের শহীদগণের দু' দুজনকে একই কাপড়ে (কবরে) একত্রে দাফন করার ব্যবস্থা করে জিজ্ঞেস করলেন। তাঁদের মধ্যে কে কুরআন সম্পর্কে অধিক জ্ঞাত? যখন তাঁদের একজনের দিকে ইঙ্গিত করা হত, তখন তিনি তাঁকে প্রথম কবরে রাখতেন আর বলতেনঃ আমি তাঁদের জন্য সাক্ষী হব। (কিয়ামাতে) তিনি তাঁদের রক্ত-মাখা অবস্থায় দাফন করার নির্দেশ দিয়েছিলেন এবং তিনি তাঁদের জানাযার সালাতও আদায় করেননি। তাঁদের গোসলও দেননি।\n\nরাবী আওযায়ী (রহঃ)  যুহরী (রহঃ)  সূত্রে জাবির ইব্‌নু ‘আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ রাসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) উহুদ যুদ্ধের শহীদগণের সম্পর্কে জিজ্ঞেস করতেন, তাঁদের মাঝে কুরআন সম্পর্কে কে অধিক জ্ঞাত? কোন একজনের দিকে ইঙ্গিত করা হলে, তিনি তাঁকে তাঁর সঙ্গীর পূর্বে কবরে রাখতেন। জাবির (রাঃ) বলেন, আমার পিতা ও চাচাকে একখানি পশমের তৈরি নক্‌শা করা কাপড়ে কাফন দেয়া হয়েছিল।\nআর সুলাইমান ইব্‌নু কাসীর (রহঃ)  সূত্রে বর্ণনা করেন যে, আমার নিকট এমন এক ব্যক্তি হাদীস বর্ণনা করেছেন, যিনি জাবির (রাঃ) হতে শুনেছেন।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 112382,
        "last_updated": null
    },
    {
        "banglaURN": 6013541,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "",
        "babNumber": 851,
        "babName": "",
        "hadithNumber": 1354,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু  ‘উমর (রাঃ) থেকে বর্ণিতঃ ‘উমর (রাঃ) নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সঙ্গে একটি দলের অন্তর্ভুক্ত হয়ে ইব্‌নু সাইয়াদ-এর (বাড়ির) দিকে গেলেন। তাঁরা তাঁকে (ইব্‌নু সাইয়াদকে) বনূ মাগালা দুর্গের পাশে অন্যান্য বালকদের সাথে খেলাধূলারত পেলেন। তখন ইব্‌নু সাইয়াদ বালিগ হবার নিকটবর্তী হয়েছিল। সে নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর আগমন অনুভব করার পূর্বেই নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তার হাত ধরে ফেললেন। অতঃপর তিনি জিজ্ঞেস করলেন, তুমি কি সাক্ষ্য দিচ্ছ যে, আমি আল্লাহর রসূল? ইব্‌নু সাইয়াদ তাঁর দিকে দৃষ্টি করে বলল, আমি সাক্ষ্য দিচ্ছি যে, আপনি উম্মীদের রসূল। অতঃপর সে নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলল, আপনি কি সাক্ষ্য দিবেন যে, আমি আল্লাহর রসূল? তখন নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁকে ছেড়ে দিয়ে বললেনঃ আমি আল্লাহর প্রতি এবং তাঁর রসূলগণের প্রতি ঈমান এনেছি। অতঃপর তিনি তাকে (ইব্‌নু সাইয়াদকে) জিজ্ঞেস করলেনঃ তুমি কী দেখে থাক? ইব্‌নু সাইয়াদ বলল, আমার নিকট সত্যবাদী ও মিথ্যাবাদী আগমন করে থাকে। নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ইরশাদ করলেনঃ ব্যাপারটি তোমার নিকট বিভ্রান্তিকর করা হয়েছে। অতঃপর নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাকে বললেনঃ আমি একটি বিষয় তোমার হতে (আমার মনের মধ্যে) গোপন রেখেছি। বলতো সেটি কী? ইব্‌নু সাইয়াদ বলল, তা হচ্ছে  (الدُّخُّ) 'আদ্-দুখখু। তখন তিনি ইরশাদ করলেনঃ তুমি লাঞ্ছিত হও ! তুমি কখনো তোমার (জন্য নির্ধারিত) সীমা অতিক্রম করতে পারবে না। তখন  ‘উমর (রাঃ) বললেন, আমাকে অনুমতি দিন, হে আল্লাহর রসূল ! আমি তার গর্দান উড়িয়ে দেই [২৬]। নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ইরশাদ করলেনঃ যদি সে সে-ই (অর্থাৎ মাসীহ্‌ দাজ্জাল) হয়ে থাকে, তাহলে তাকে কাবু করার ক্ষমতা তোমাকে দেয়া হবে না। আর যদি সে-ই (দাজ্জাল) না হয়, তাহলে তাকে হত্যা করার মধ্যে তোমার কোন কল্যাণ নেই।\n\nরাবী সালিম (রহঃ) থেকে বর্ণিতঃ আমি ইব্‌নু  ‘উমর (রাঃ)-কে বলতে শুনেছি, অতঃপর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এবং উবাই ইব্‌নু কা’ব (রাঃ) ঐ খেজুরের বাগানের দিকে গমন করলেন যেখানে ইব্‌নু সাইয়াদ ছিল। ইব্‌নু সাইয়াদ তাকে দেখে ফেলার পূর্বেই ইব্‌নু সাইয়াদের কিছু কথা তিনি শুনে নিতে চাচ্ছিলেন। নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাকে একটি চাদর মুড়ি দিয়ে শুয়ে থাকতে দেখলেন। যার ভিতর হতে তার গুনগুন আওয়াজ শোনা [১] যাচ্ছিল। ইব্‌নু সাইয়াদের মা আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে দেখতে পেল যে, তিনি খেজুর (গাছের) কাণ্ডের আড়ালে আত্মগোপন করে চলছেন। সে তখন ইব্‌নু সাইয়াদকে ডেকে বলল, ও সাফ ! (এটি ইব্‌নু সাইয়াদের ডাক নাম) এই যে মুহাম্মাদ ! তখন ইব্‌নু সাইয়াদ লাফিয়ে উঠল। নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ইরশাদ করলেনঃ সে (ইব্‌নু সাইয়াদের মা) তাকে (যথাবস্থায়) থাকতে দিলে (ব্যাপারটি) স্পষ্ট হয়ে যেত।\nশুআইব (রহঃ)  তাঁর হাদীসে (فَرَفَضَهُ) বলেন, এবং সন্দেহের সাথে বলেন, (رَمْرَمَةُ) অথবা (زَمْزَمَةُ) এবং উকাইল (র.) বলেছেন, (رَمْزَةُ) আর মা’মার বলেছেন, (আরবী)।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 112471,
        "last_updated": null
    },
    {
        "banglaURN": 6013631,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "",
        "babNumber": 855,
        "babName": "",
        "hadithNumber": 1363,
        "hadithSanad": "",
        "hadithText": "সাবিত ইব্‌নু যাহ্‌হাক (রাঃ) সূত্রে নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেনঃ যে ব্যক্তি ইসলাম ব্যতীত অন্য কোন ধর্মের (অনুসারী হবার) ইচ্ছাকৃতভাবে মিথ্যা হলফ করে সে যেমন বলল, তেমনই হবে আর যে ব্যক্তি কোন ধারালো লোহা দিয়ে আত্মহত্যা করে, তাকে তা দিয়েই জাহান্নামে ‘আযাব দেয়া হবে।\n\nহাজ্জাজ ইব্‌নু মিন্‌হাল (রহঃ) থেকে বর্ণিতঃ জারীর ইব্‌নু হাযিম (রহঃ)  আমাদের হাদীস শুনিয়েছেন হাসান (রহঃ)  হতে, তিনি বলেন, জুন্‌দাব (রাঃ) এই মসজিদে আমাদের হাদীস শুনিয়েছেন আর তা আমরা ভুলে যাইনি এবং আমরা এ আশংকাও করিনি যে, জুন্‌দাব (রাঃ) নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নামে মিথ্যা বলেছেন। তিনি বলেছেন, এক ব্যক্তির (দেহে) যখম ছিল, সে আত্মহত্যা করল। তখন আল্লাহ তা’আলা বললেন, আমার বান্দা তার প্রাণ নিয়ে আমার সাথে তাড়াহুড়া করল। আমি তার জন্য জান্নাত হারাম করে দিলাম। [২৭]</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 116,
        "matchingArabicURN": 112561,
        "last_updated": null
    },
    {
        "banglaURN": 6013901,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "",
        "babNumber": 887,
        "babName": "",
        "hadithNumber": 1390,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) অন্তিম রোগশয্যায় বলেন, ইয়াহুদী ও নাসারাদের প্রতি আল্লাহর অভিসম্পাত বর্ষিত হোক। কারণ, তারা তাদের নবী গণের কবরকে সিজদার স্থানে পরিণত করেছে। (রাবী উরওয়া বলেন) এরূপ আশঙ্কা না থাকলে রাসূলূল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কবরকে (ঘরের বেষ্টনীতে সংরক্ষিত না রেখে) খোলা রাখা হতো। কিন্তু তিনি (নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)) আশংকা করেন বা আশংকা করা হয় যে, পরবর্তীতে একে মসজিদে পরিণত করা হবে। রাবী হিলাল (রহঃ)  বলেন, উরওয়া আমাকে (আবূ আমর) কুনিয়াতে ভূষিত করেন আর তখন পর্যন্ত আমি কোন সন্তানের পিতা হইনি।</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 142,
        "matchingArabicURN": 112840,
        "last_updated": null
    },
    {
        "banglaURN": 6013903,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "",
        "babNumber": 887,
        "babName": "",
        "hadithNumber": 1390,
        "hadithSanad": "",
        "hadithText": "১৩৯০/১. সুফিয়ান তাম্মার (রাঃ) হতে বর্ণিত। তিনি বলেন, তিনি নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কবর উটের কুজের ন্যায় (উঁচু) দেখেছেন। (আ.প্র.১৩০০, ই.ফা.১৩০৮)</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 143,
        "matchingArabicURN": 112850,
        "last_updated": null
    },
    {
        "banglaURN": 6013904,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 23,
        "bookName": "",
        "babNumber": 887,
        "babName": "",
        "hadithNumber": 1390,
        "hadithSanad": "",
        "hadithText": "১৩৯০/২. উরওয়া (রাঃ) হতে বর্ণিত। তিনি বলেন, ওয়ালীদ ইবনু আবদুল মালিক-এর শাসনামলে যখন (রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর রাওযার) বেষ্টনী দেয়াল ধসে পড়ে, তখন তাঁরা সংষ্কার করতে আরম্ভ করলে একটি পা প্রকাশ পায়, তা আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কদম মুবারক বলে ধারণা করার কারণে লোকেরা খুব ঘাবড়ে যায়। সনাক্ত করার মত কাউকে তারা পায়নি। অবশেষে উরওয়া (রাঃ) তাদের বললেন, আল্লাহর কসম এ নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর পা নয় বরং এতো  ‘উমর (রাঃ)-এর পা। (৪৩৫) (আ.প্র. ১৩০১, ই.ফা.১৩০৯)</b>",
        "bookID": "23.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 144,
        "matchingArabicURN": 112860,
        "last_updated": null
    }
]