[
    {
        "banglaURN": 6013950,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1557,
        "babName": null,
        "hadithNumber": 1395,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) মু’আয (রাঃ)-কে ইয়ামান দেশে (শাসক হিসেবে) প্রেরণ করেন। অতঃপর বললেন, সেখানকার অধিবাসীদেরকে এ সাক্ষ্য দানের প্রতি আহবান করবে যে, আল্লাহ ব্যতীত প্রকৃত কোন উপাস্য নেই এবং আমি আল্লাহর রসূল। যদি তারা তা মেনে নেয় তবে তাদেরকে অবগত কর যে, আল্লাহ তা’আলা তাদের উপর প্রতি দিনে ও রাতে পাঁচ ওয়াক্ত নামায ফরয করেছেন। যদি সেটাও তারা মেনে নেয় তবে তাদেরকে অবগত কর যে, আল্লাহ তা’আলা তাদের উপর তাদের সম্পদের মধ্য থেকে সদকা (যাকাত) ফরয করেছেন। যেটা ধনীদের নিকট থেকে গৃহীত হবে আর দরিদ্রদের মাঝে প্রদান করা হবে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 112910,
        "last_updated": null
    },
    {
        "banglaURN": 6013960,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1557,
        "babName": null,
        "hadithNumber": 1396,
        "hadithSanad": "",
        "hadithText": "আবূ আইয়ূব (রাঃ) থেকে বর্ণিতঃ জনৈক সাহাবী নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বললেনঃ আমাকে এমন একটি আমালের কথা বলুন যা আমাকে জান্নাতে প্রবেশ করাবে। রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ তার কী হয়েছে! তার কী হয়েছে! এবং বললেনঃ তার দরকার রয়েছে তো। তুমি আল্লাহর ইবাদত করবে, তাঁর সঙ্গে অপর কোন কিছুকে শরীক করবে না। সালাত আদায় করবে, যাকাত আদায় করবে, আত্মীয়তার সম্পর্ক অটুট রাখবে। (আ.প্র. ১৩০৬)\nআর বাহ্‌য শু’বা (রহঃ)-এর সূত্রে বর্ণনা করেন, মুহাম্মদ ইব্‌নু ‘উসমান ও তাঁর পিতা ‘উসমান ইব্‌নু ‘আবদুল্লাহ্‌ হতে তারা উভয়ে মূসা ইব্‌নু তালহা (রাঃ)-কে আবূ আইউব (রাঃ)-এর সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে হাদীসটি অনুরূপভাবে বর্ণনা করতে শুনেন। আবূ আবদুল্লাহ্‌ ইমাম বুখারী (রহঃ) বলেন: (শু’বাহ রাবীর নাম বলতে ভুল করেছেন) আমার আশংকা হয় যে, মুহাম্মদ ইব্‌নু ‘উসমান-এর উল্লেখ সঠিক নয়, বরং রাবীর নাম এখানে ‘আমর ইব্‌নু ‘উসমান হবে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 112921,
        "last_updated": null
    },
    {
        "banglaURN": 6013970,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1557,
        "babName": null,
        "hadithNumber": 1397,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ এক বেদুইন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট এসে বলল, আমাকে এমন একটি আমলের কথা বলুন যদি আমি তা সম্পাদন করি তবে জান্নাতে প্রবেশ করবো। রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ আল্লাহর ইবাদত করবে আর তার সাথে অপর কোন কিছু শরীক করবে না। ফরয সালাত আদায় করবে, ফরয যাকাত প্রদান করবে, রমযান মাসে সিয়াম, পালন করবে। সে বলল, যাঁর হাতে আমার প্রাণ রয়েছে তার শপথ করে বলছি, আমি এর চেয়ে বেশী করবো না। যখন সে ফিরে গেল, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ যে ব্যক্তি কোন জান্নাতী ব্যক্তিকে দেখতে পছন্দ করে সে যেন এই ব্যক্তি দেখে নেয়। (আ.প্র. ১৩০৭, ই.ফা. ১৩১২)\nআবূ যুর’আ (রহঃ)-এর মাধ্যম নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে অনুরূপ বর্ণনা করেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 112941,
        "last_updated": null
    },
    {
        "banglaURN": 6013980,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1557,
        "babName": null,
        "hadithNumber": 1398,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেনঃ আবদুল কায়স গোত্রের প্রতিনিধি দল নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর দরবারে হাযির হয়ে আরয করলো, হে আল্লাহর রাসূল! আমরা রাবী’আ গোত্রের লোক, আমাদের ও আপনার (মদীনার) মধ্যে মুযার গোত্রের কাফিররা বাধা হয়ে রয়েছে। আমরা আপনার কাছে কেবল নিষিদ্ধ মাস (যুদ্ধ বিরতির মাস) ব্যতীত নির্বিঘ্নে আসতে পারি না। কাজেই এমন কিছু, আমলের আদেশ করুন যা আমরা আপনার কাছ থেকে শিখে (আমাদের গোত্রের) অনুপস্থিতদেরকে সেদিকে আহবান করতে পারি। আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ তোমাদেরকে চারটি বিষয়ের আদেশ করছি ও চারটি বিষয় থেকে নিষেধ করছি। (পালনীয় বিষয়গুলো হলোঃ) আল্লাহর প্রতি ঈমান আনা তথা সাক্ষ্য প্রদান করা যে, আল্লাহ ব্যতীত প্রকৃত কোনো ইলাহ নেই। (রাবী বলেন) এ কথা বলার সময় নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) (একক নির্দেশক) তাঁর হাতের অঙ্গুলি বন্ধ করেন, সালাত কায়েম করা, যাকাত আদায় করা ও তোমরা গনীমতের এক-পঞ্চমাংশ আদায় করবে। আর আমি তোমাদেরকে নিষেধ করছি শুষ্ক কদুর খোলস, সবুজ রং প্রলেপযুক্ত পাত্র, খেজুর কান্ড নির্মিত পাত্র, তৈলজ পদার্থ প্রলেপযুক্ত মাটির পাত্র ব্যবহার করতে। সুলায়মান ও আবূ নুমান (রহঃ) হাম্মাদ (রহঃ) থেকে বর্ণিত হাদীসে ঈমান বিল্লাহ অর্থাৎ (আল্লাহ ব্যতীত প্রকৃত কোনো ইলাহ নেই একথার সাক্ষ্য দেয়া) এরূপ বর্ণনা করেছেন -- (ব্যতীত)।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 112960,
        "last_updated": null
    },
    {
        "banglaURN": 6014010,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1558,
        "babName": null,
        "hadithNumber": 1401,
        "hadithSanad": "",
        "hadithText": "জারীর ইব্‌নু ‘আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট সালাত কায়েম করা, যাকাত দেয়া ও সকল মুসলমানের কল্যাণ কামনা করার উপর বায়’আত করি।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 112990,
        "last_updated": null
    },
    {
        "banglaURN": 6014020,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1559,
        "babName": null,
        "hadithNumber": 1402,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ যে ব্যক্তি নিজের উটের (উপর দরিদ্র, বঞ্চিত, মুসাফিরের) হক আদায় না করবে, (ক্বিয়ামত দিবসে) সেই উট দুনিয়া অপেক্ষা অধিক শক্তিশালী হয়ে এসে খুর দিয়ে আপন মালিককে পিষ্ট করবে এবং যে ব্যক্তি নিজের বকরীর হক আদায় না করবে, সে বকরী দুনিয়া অপেক্ষা অধিক শক্তিশালী হয়ে এসে মালিককে খুর দিয়ে পদদলিত করবে ও শিং দিয়ে আঘাত করবে। উট ও বকরীর হক হলো পানির নিকট অর্থাৎ (ঘাটে) জনসমাগম স্থলে-ওদের দোহন করা (ও দরিদ্র বঞ্চিতদের মধ্যে দুধ বন্টন করা)।  নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আরো বলেনঃ তোমাদের কেউ যেন কিয়ামত দিবসে (হক্ব অনাদায়জনিত কারণে শাস্তি স্বরূপ) কাঁধের উপর চিৎকাররত বকরী বহন করে (আমার নিকট) না আসে এবং বলে, হে মুহাম্মদ! (আমাকে রক্ষা করুন)। তখন আমি বলবঃ তোমাকে রক্ষা করার ব্যাপারে আমার কোনো ক্ষমতা নেই। আমি তো (হক্ব অনাদায়ের পরিণতির কথা) পৌছে দিয়েছি। আর কেউ যেন চিৎকাররত উট কাঁধের উপর বহন করে এসে না বলে, হে মুহাম্মদ! (আমাকে রক্ষা করুন)। তখন আমি বলবঃ তোমাকে রক্ষা করার ব্যাপারে আমার কোন ক্ষমতা নেই। আমি তো (শেষ পরিণতির কথা) পৌছে দিয়েছি।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 113000,
        "last_updated": null
    },
    {
        "banglaURN": 6014030,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1559,
        "babName": null,
        "hadithNumber": 1403,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ যাকে আল্লাহ সম্পদ দান করেছেন, কিন্তু সে এর যাকাত আদায় করেনি, ক্বিয়ামাতের দিন তার সম্পদকে টেকো (বিষের তীব্রতার কারণে) মাথা বিশিষ্ট বিষধর সাপের আকৃতি দান করে তার গলায় ঝুলিয়ে দেয়া হবে। সাপটি তার মুখের দু’পার্শ্ব কামড়ে ধরে বলবে, আমি তোমার সম্পদ, আমি তোমার জমাকৃত মাল। অতঃপর আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তিলাওয়াত করেনঃ \n“আল্লাহ যাদেরকে সম্পদশালী করেছেন অথচ তারা সে সম্পদ নিয়ে কার্পণ্য করছে, তাদের ধারণা করা উচিত নয় যে, সেই সম্পদ তাদের জন্য কল্যাণ বয়ে আনবে, বরং তা তাদের জন্য অকল্যাণকর হবে। অচিরেই ক্বিয়ামত দিবসে, যা নিয়ে কার্পণ্য করছে তা দিয়ে তাদের গলদেশ শৃঙ্খলাবদ্ধ করা হবে” – (আল-ইমরানঃ ১৮০)।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 113010,
        "last_updated": null
    },
    {
        "banglaURN": 6014040,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1560,
        "babName": null,
        "hadithNumber": 1404,
        "hadithSanad": "",
        "hadithText": "খালিদ ইব্‌নু আসলাম (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা ‘আবদুল্লাহ্‌ ইব্‌নু ‘উমর (রাঃ)-এর সাথে বের হলাম। এক মরুবাসী তাঁকে বললো, আল্লাহ তা’আলার বাণীঃ \n“যারা সোনা-রূপা জমা করে রাখে আর আল্লাহর পথে তা ব্যয় করে না”-এর ব্যাখ্যা সম্পর্কে আমাকে অবহিত করুন। ইব্‌নু ‘উমর (রাঃ) বললেন, যে ব্যক্তি সম্পদ জমা করে রাখে আর এর যাকাত আদায় করে না, তার জন্য রয়েছে শাস্তি- এ তো ছিল যাকাত বিধান অবতীর্ণ হওয়ার আগের কথা। এরপর যখন যাকাত বিধান অবতীর্ণ হলো তখন একে আল্লাহ ধন-সম্পদের পবিত্রতা অর্জনের উপার করে দিলেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 113020,
        "last_updated": null
    },
    {
        "banglaURN": 6014050,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1560,
        "babName": null,
        "hadithNumber": 1405,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, পাঁচ উকিয়ার কম সম্পদের উপর যাকাত (ফরয) নেই এবং পাঁচটি উটের কমের উপর যাকাত নেই। পাঁচ ওয়াসাক [১] এর কম উৎপন্ন দ্রব্যের উপর যাকাত নেই।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 113030,
        "last_updated": null
    },
    {
        "banglaURN": 6014060,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1560,
        "babName": null,
        "hadithNumber": 1406,
        "hadithSanad": "",
        "hadithText": "যায়দ ইব্‌নু অহব (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, রাবাযাহ নামক স্থান দিয়ে চলার পথে আবূ যার (রাঃ)-এর সাথে আমার সাক্ষাৎ হলো। আমি তাঁকে বললাম, আপনি এখানে কী কারণে আসলেন? তিনি বললেন, আমি সিরিায়ায় অবস্থানকালে নিম্নোক্ত আয়াতের তাফসীর সম্পর্কে মু’আবিয়া (রাঃ)-এর সাথে আমার মতানৈক্য হয়ঃ\n“যারা সোনা-রূপা জমা করে রাখে এবং আল্লাহর রাস্তায় তা ব্যয় করে না…….”-(আত-তাওবাঃ ৩৪)। মু’আবিয়া (রাঃ) বলেন, এ আয়াত কেবল আহলে কিতাবদের সম্পর্কে অবতীর্ণ হয়েছে। আমি বললাম, আমাদের ও তাদের সকলের সম্পর্কেই অবতীর্ণ হয়েছে। এ নিয়ে আমাদের উভয়ের মধ্যে বিরোধ চলছিল। এক সময় মু’আবিয়া (রাঃ) ‘উসমান (রাঃ)-এর নিকট আমার নামে অভিযোগ করে পত্র পাঠালেন। তিনি পত্রযোগে আমাকে মদীনায় ডেকে পাঠান। মদীনায় পৌছলে আমাকে দেখতে লোকেরা এত ভিড় করলো যে, এর পূর্বে যেন তারা কখনো আমাকে দেখেনি। ‘উসমান (রাঃ)-এর নিকট ঘটনা বিবৃত করলে তিনি আমাকে বললেন, ইচ্ছা করলে আপনি মদীনার বাইরে নিকটে কোথাও থাকতে পারেন। এ হল আমার এ স্থানে অবস্থানের কারণ। খলীফা যদি কোন হাবশী লোককেও আমার উপর কর্তৃত্ব প্রদান করেন, তবুও আমি তাঁর কথা শুনব এবং আনুগত্য করবো।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 113040,
        "last_updated": null
    },
    {
        "banglaURN": 6014090,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1561,
        "babName": null,
        "hadithNumber": 1409,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু মাস’ঊদ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছি কেবল মাত্র দু’ধরনের ব্যক্তির প্রতি ঈর্ষা রাখা যেতে পারে, একজন এমন ব্যক্তি যাকে আল্লাহ সম্পদ দিয়েছেন এবং ন্যায় পথে তা ব্যয় করার মত ক্ষমতাবান করেছেন। অপরজন এমন ব্যক্তি যাকে আল্লাহ দ্বীনের জ্ঞান দান করেছেন (আর তিনি) সে অনুযায়ী ফয়সালা দেন ও অন্যান্যকে তা শিক্ষা দেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 113070,
        "last_updated": null
    },
    {
        "banglaURN": 6014100,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1564,
        "babName": null,
        "hadithNumber": 1410,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ যে ব্যক্তি হালাল কামাই থেকে একটি খেজুর পরিমাণ সদকা করবে, (আল্লাহ তা কবূল করবেন) এবং আল্লাহ কেবল পবিত্র মাল কবূল করেন আর আল্লাহ তাঁর ডান হাত [৩৪] দিয়ে তা কবূল করেন। এরপর আল্লাহ দাতার কল্যাণার্থে তা প্রতিপালন করেন যেমন তোমাদের কেউ অশ্ব শাবক প্রতিপালন করে থাকে, অবশেষে সেই সদকা পাহাড় বরাবর হয়ে যায়। (আ.প্র. ১৩১৮)\nসুলায়মান (রহঃ) ইব্‌নু দীনার (রহঃ) থেকে হাদীস বর্ণনায় ‘আব্দুর রহমান (রহঃ)-এর অনুসরণ করেছেন এবং ওয়ারকা (রহঃ) ইব্‌নু দীনার থেকে তিনি সাঈদ বিন ইয়ামার থেকে আবূ হুরায়রা (রাঃ)-এর সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হাদীসটি বর্ণনা করে বলেছেন এবং মুসলিম ইব্‌নু আবূ মারয়াম, যায়দ ইব্‌নু আসলাম ও সুহায়ল (রহঃ) আবূ সালিহ (রহঃ)-এর মাধ্যম আবূ হুরায়রা (রাঃ)-এর সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে হাদীসটি বর্ণনা করেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 113081,
        "last_updated": null
    },
    {
        "banglaURN": 6014110,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1565,
        "babName": null,
        "hadithNumber": 1411,
        "hadithSanad": "",
        "hadithText": "হারিসা ইব্‌নু অহব (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছি, তোমরা সদকা কর, কেননা তোমাদের ওপর এমন যুগ আসবে যখন মানুষ আপন সদকা নিয়ে ঘুরে বেড়াবে কিন্তু তা গ্রহণ করার মত কাউকে পাবে না। (যাকে দাতা দেয়ার ইচ্ছা করবে সে) লোকটি বলবে, গতকাল পর্যন্ত নিয়ে আসলে আমি গ্রহণ করতাম। আজ আমার আর কোন প্রয়োজন নেই।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 113100,
        "last_updated": null
    },
    {
        "banglaURN": 6014120,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1565,
        "babName": null,
        "hadithNumber": 1412,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ কিয়ামত সংঘটিত হবে না যতক্ষণ না তোমাদের মধ্যে সম্পদ বৃদ্ধি পেয়ে উপচে না পড়বে, এমনকি সম্পদের মালিকগণ তার সদকা কে গ্রহণ করবে তা নিয়ে চিন্তাগ্রস্ত হয়ে পড়বে। যাকেই দান করতে চাইবে সে-ই বলবে, প্রয়োজন নেই।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 113110,
        "last_updated": null
    },
    {
        "banglaURN": 6014130,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1565,
        "babName": null,
        "hadithNumber": 1413,
        "hadithSanad": "",
        "hadithText": "আদী ইব্‌নু হাতিম (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছে ছিলাম, এমন সময় দু’জন সাহাবী আসলেন, তাদের একজন দারিদ্রের অভিযোগ করছিলেন আর অপরজন রাহাজানির অভিযোগ করছিলেন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ রাহাজানির অবস্থা এই যে, কিছুদিন পর এমন সময় আসবে যখন কাফিলা মক্কা পর্যন্ত বিনা পাহারায় পৌছে যাবে। আর দারিদ্রের অবস্থা এই যে, তোমাদের কেউ সদকা নিয়ে ঘোরাফেরা করবে, কিন্তু তা গ্রহণ করার মত কাউকে পাবে না। এমন সময় না আসা পর্যন্ত ক্বিয়ামত কায়িম হবে না। অতঃপর (বিচার দিবসে) আল্লাহর নিকট তোমাদের কেউ এমনভাবে খাড়া হবে যে, তার ও আল্লাহর মাঝে কোন আড়াল থাকবে না বা কোন ব্যাখ্যাকারী দোভাষীও থাকবে না। অতঃপর তিনি বলবেনঃ আমি কি তোমাকে সম্পদ দান করিনি? সে অবশ্যই বলবে, হ্যাঁ, তখন সে ব্যক্তি ডান দিকে তাকিয়ে শুধু আগুন দেখতে পাবে, তেমনিভাবে বাম দিকে তাকিয়েও আগুন দেখতে পাবে। কাজেই তোমাদের প্রত্যেকের উচিত এক টুকরা খেজুর (সদকা) দিয়ে হলেও যেন আগুন হতে আত্মরক্ষা করে। যদি কেউ তা না পায় তবে যেন উত্তম কথা দিয়ে হলেও।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 113120,
        "last_updated": null
    },
    {
        "banglaURN": 6014140,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1565,
        "babName": null,
        "hadithNumber": 1414,
        "hadithSanad": "",
        "hadithText": "আবূ মূসা (আশ’আরী) (রাঃ)-এর সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেন, মানুষের উপর অবশ্যই এমন এক সময় আসবে যখন লোকেরা সদকার সোনা নিয়ে ঘুরে বেড়াবে কিন্তু একজন গ্রহীতাও পাবে না। পুরুষের সংখ্যা হ্রাস পাওয়ায় এবং নারীর সংখ্যা বৃদ্ধির ফলে চল্লিশজন নারী একজন পুরুষের অধীনে থাকবে এবং তার আশ্রয় গ্রহণ করবে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 113130,
        "last_updated": null
    },
    {
        "banglaURN": 6014150,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1566,
        "babName": null,
        "hadithNumber": 1415,
        "hadithSanad": "",
        "hadithText": "আবূ মাস’ঊদ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, যখন সদকার আয়াত নাযিল হলো তখন আমরা পারিশ্রমিকের বিনিময়ে বোঝা বহন করতাম। এক ব্যক্তি এসে প্রচুর মাল সদকা করলো। তারা (মুনাফিকরা) বলতে লাগলো, এ ব্যক্তি লোক দেখানোর উদ্দেশে দান করেছে, আর এক ব্যক্তি এসে এক সা’ পরিমাণ দান করলে তারা বললো, আল্লাহ তো এ ব্যক্তির এক সা’ হতে অমুখাপেক্ষী। এ প্রসঙ্গে অবতীর্ণ হয়ঃ “মুমিনগণের মধ্যে যারা স্বেচ্ছায় সদকা দেয় এবং যারা নিজ শ্রম ব্যতিরেকে কিছুই পায় না তাদেরকে যারা দোষারোপ করে….”- (আত তাওবাঃ ৭৯)।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 113140,
        "last_updated": null
    },
    {
        "banglaURN": 6014160,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1566,
        "babName": null,
        "hadithNumber": 1416,
        "hadithSanad": "",
        "hadithText": "আবূ মাস’ঊদ আনসারী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, যখন আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাদেরকে সদকা করতে আদেশ করলেন তখন আমাদের কেউ বাজারে গিয়ে পারিশ্রমিকের বিনিময়ে বোঝা বহন করে মুদ [৩৫] পরিমাণ অর্জন করতে (এবং তা হতেই সদকা করত) অথচ আজ তাদের কেউ কেউ লক্ষপতি।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 113150,
        "last_updated": null
    },
    {
        "banglaURN": 6014170,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1566,
        "babName": null,
        "hadithNumber": 1417,
        "hadithSanad": "",
        "hadithText": "‘আদী ইব্‌নু হাতিম (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছি, তোমরা জাহান্নাম হতে আত্মরক্ষা কর এক টুকরা খেজুর সদকা করে হলেও।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 113160,
        "last_updated": null
    },
    {
        "banglaURN": 6014180,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1566,
        "babName": null,
        "hadithNumber": 1418,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, এক ভিখারিণী দু’টি শিশু কন্যা সঙ্গে করে আমার নিকট এসে কিছু চাইলো। আমার নিকট একটি খেজুর ব্যতীত অন্য কিছু ছিল না। আমি তাকে তা দিলাম। সে নিজে না খেয়ে খেজুরটি দু’ভাগ করে কন্যা দু’টিকে দিয়ে দিল। এরপর ভিখারিণী বেরিয়ে চলে গেলে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাদের নিকট আসলেন। তাঁর নিকট ঘটনা বিবৃত করলে তিনি বললেনঃ যাকে এরূপ কন্যা সন্তানের ব্যাপারে কোনরূপ পরীক্ষা করা হয় সে কন্যা সন্তান তার জন্য জাহান্নামের আগুন হতে আড় হয়ে দাঁড়াবে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 113170,
        "last_updated": null
    },
    {
        "banglaURN": 6014190,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1882,
        "babName": null,
        "hadithNumber": 1419,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, এক সাহাবী আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এর কাছে এসে বললেন, হে আল্লাহর রাসূল! কোন সদকার সওয়াব বেশি পাওয়া যায়? তিনি (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ সুস্থ ও কৃপণ অবস্থায় তোমার সদকা করা যখন তুমি দারিদ্রের আশঙ্কা করবে ও ধনী হওয়ার আশা রাখবে। সদকা করতে এ পর্যন্ত দেরী করবে না, যখন প্রাণবায়ু কন্ঠাগত হবে, আর তুমি বলতে থাকবে, অমুকের জন্য এতটুকু, অমুকের জন্য এতটুকু, অথচ তা অমুকের জন্য হয়ে গেছে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 113180,
        "last_updated": null
    },
    {
        "banglaURN": 6014200,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1883,
        "babName": null,
        "hadithNumber": 1420,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ কোন নবী-সহধর্মিনী নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বললেনঃ আমাদের মধ্য হতে সবার পূর্বে (মৃত্যুর পর) আপনার সাথে কে মিলিত হবে? তিনি বললেনঃ তোমাদের মধ্যে যার হাত সবচেয়ে লম্বা। তাঁরা একটি বাঁশের কাঠির মাধ্যমে হাত মেপে দেখতে লাগলেন। সওদার হাত সকলের হাতের চেয়ে লম্বা বলে প্রমাণিত হল। পরে [সবার আগে যায়নাব (রাঃ)-এর মৃত্যু হলে] আমরা বুঝলাম হাতের দীর্ঘতার অর্থ দানশীলতা। তিনি [যায়নাব (রাঃ)] আমাদের মধ্যে সবার আগে তাঁর ( (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ) সাথে মিলিত হন এবং তিনি দান করতে ভালবাসতেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 113190,
        "last_updated": null
    },
    {
        "banglaURN": 6014210,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1886,
        "babName": null,
        "hadithNumber": 1421,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ (পূর্ববর্তী উম্মাতের মধ্যে) এক ব্যক্তি বলল, আমি কিছু সদকা করব। সদকা নিয়ে বের হয়ে (ভুলে) সে এক চোরের হাতে তা দিয়ে দিলো। সকালে লোকেরা বলাবলি করতে লাগলো, চোরকে সদকা দেয়া হয়েছে। এতে সে বললো, হে আল্লাহ! প্রশংসা আপনারই, আমি অবশ্যই সদকা করবো। সদকা নিয়ে বের হয়ে তা এক ব্যভিচারিণীর হাতে দিল। সকালে লোকেরা বলাবলি করতে লাগলো, রাতে এক ব্যভিচারিণীকে সদকা দেয়া হয়েছে। লোকটি বললো, হে আল্লাহ! সকল প্রশংসা আপনারই, (আমার সদকা) ব্যভিচারিণীর হাতে পৌছল। আমি অবশ্যই সদকা করব। এরপর সে সদকা নিয়ে বের হয়ে কোন এক ধনী ব্যক্তির হাতে দিল। সকালে লোকেরা বলতে লাগল, ধনী ব্যক্তিকে সদকা দেয়া হয়েছে। লোকটি বলল, হে আল্লাহ! সকল প্রশংসা আপনারই, (আমার সদকা) চোর, ব্যভিচারিণী ও ধনী ব্যক্তির হাতে গিয়ে পড়লো। পরে স্বপ্নযোগে তাকে বলা হলো, তোমার সদকা চোর পেয়েছে, সম্ভবত সে চুরি করা হতে বিরত থাকবে, তোমার সদকা ব্যভিচারিণী পেয়েছে, সম্ভবত সে তার ব্যভিচার হতে পবিত্র থাকবে আর ধনী ব্যক্তি তোমার সদকা পেয়েছে, সম্ভবত সে শিক্ষা গ্রহণ করবে এবং আল্লাহর দেয়া সম্পদ হতে সদকা করবে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 113200,
        "last_updated": null
    },
    {
        "banglaURN": 6014220,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1887,
        "babName": null,
        "hadithNumber": 1422,
        "hadithSanad": "",
        "hadithText": "মা’ন ইব্‌নু ইয়াযীদ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি, আমার পিতা (ইয়াযীদ) ও আমার দাদা (আখনাস) রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছে বায়’আত করলাম। তিনি আমার বিবাহের প্রস্তাব করেন এবং আমার বিবাহ সম্পন্ন করে দেন। আমি তাঁর কাছে (একটি বিষয়ে) বিচার প্রার্থী হই, একদা আমার পিতা ইয়াযীদ কিছু স্বর্ণমুদ্রা সদকা করার নিয়্যাতে মসজিদে এক ব্যক্তির নিকট রেখে (তাকে তা বিতরণ করার সাধারণ অনুমতি দিয়ে) আসেন। আমি সে ব্যক্তির নিকট হতে তা গ্রহণ করে পিতার নিকট আসলাম। তখন তিনি বললেন, আল্লাহর কসম! তোমাকে দেয়ার ইচ্ছা আমার ছিল না। বিষয়টি আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছে পেশ করলাম। তিনি বললেন, হে ইয়াযীদ! তুমি যে নিয়্যাত করেছ, তা তুমি পাবে আর হে মা’ন! তুমি যা গ্রহণ করেছ তা তোমারই।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 113210,
        "last_updated": null
    },
    {
        "banglaURN": 6014230,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1888,
        "babName": null,
        "hadithNumber": 1423,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ যে দিন আল্লাহর (আরশের) ছায়া ব্যতীত কোন ছায়া থাকবে না, সে দিন আল্লাহ তা’আলা সাত প্রকার মানুষকে সে ছায়ায় আশ্রয় দিবেন। (১) ন্যায়পরায়ণ শাসক। (২) যে যুবক আল্লাহর ইবাদতের ভিতর গড়ে উঠেছে। (৩) যার অন্তরের সম্পর্ক সর্বদা মসজিদের সাথে থাকে। (৪) আল্লাহর সন্তুষ্টির উদ্দেশে যে দুব্যক্তি পরষ্পর মহব্বত রাখে, উভয়ে একত্রিত হয় সেই মহব্বতের উপর আর পৃথক হয় সেই মহব্বতের উপর। (৫) এমন ব্যক্তি যাকে সম্ভ্রান্ত সুন্দরী নারী (অবৈধ মিলনের জন্য) আহবান জানিয়েছে। তখন সে বলেছে, আমি আল্লাহকে ভয় করি। (৬) যে ব্যক্তি গোপনে এমনভাবে সদকা করে যে, তার ডান হাত যা দান করে বাম হাত তা জানতে পারে না। (৭) যে ব্যক্তি নির্জনে আল্লাহকে স্মরণ করে এবং তাতে আল্লাহর ভয়ে তার চোখ হতে অশ্রু বের হয়ে পড়ে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 113220,
        "last_updated": null
    },
    {
        "banglaURN": 6014240,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1888,
        "babName": null,
        "hadithNumber": 1424,
        "hadithSanad": "",
        "hadithText": "হারিসা ইব্‌নু অহব খুযা’ঈ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছি, তোমরা সদকা কর। কেননা অচিরেই তোমাদের উপর এমন সময় আসবে, যখন মানুষ সদকার মাল নিয়ে ঘুরে বেড়াবে, তখন এক ব্যক্তি বলবে, গতকাল নিয়ে এলে অবশ্যই গ্রহণ করতাম কিন্তু আজ এর কোন প্রয়োজন আমার নেই।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 113230,
        "last_updated": null
    },
    {
        "banglaURN": 6014250,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1889,
        "babName": null,
        "hadithNumber": 1425,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ কোন স্ত্রী যদি তার ঘর হতে বিপর্যয় সৃষ্টির উদ্দেশ্য ছাড়া খাদ্যদ্রব্য সদকা করে তবে এ জন্যে সে সওয়াব লাভ করবে আর উপার্জন করার কারণে স্বামীও সওয়াব পাবে এবং খাজাঞ্চীও অনুরূপ সওয়াব পাবে। তাদের একজনের কারণে অন্য জনের সওয়াবে কোন কমতি হবে না।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 113240,
        "last_updated": null
    },
    {
        "banglaURN": 6014260,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1890,
        "babName": null,
        "hadithNumber": 1426,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ)-এর সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেনঃ প্রয়োজনের অতিরিক্ত সম্পদ হতে সদকা করা উত্তম। যাদের ভরণ-পোষণ তোমার দায়িত্বে, প্রথমে তাদেরকে দিবে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 113250,
        "last_updated": null
    },
    {
        "banglaURN": 6014290,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1890,
        "babName": null,
        "hadithNumber": 1429,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) একদা মিম্বারের উপর থাকা অবস্থায় সদকা করা ও ভিক্ষা করা হতে বেঁচে থাকা ও ভিক্ষা করা প্রসঙ্গে উল্লেখ করে বলেনঃ উপরের হাত নীচের হাত অপেক্ষা উত্তম। উপরের হাত দাতার, আর নীচের হাত হলো ভিক্ষুকের।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 113280,
        "last_updated": null
    },
    {
        "banglaURN": 6014300,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1892,
        "babName": null,
        "hadithNumber": 1430,
        "hadithSanad": "",
        "hadithText": "‘উকবাহ ইব্‌নু হারিস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, একদিন আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আসরের সালাত আদায় করে দ্রুত ঘরে প্রবেশ করলেন। অতঃপর বিলম্ব না করে বের হয়ে আসলেন। আমি বললাম বা তাঁকে বলা হলো, এমনটি করার কারণ কী? তখন তিনি বললেনঃ ঘরে সদকার একখন্ড সোনা রেখে এসেছিলাম কিন্তু রাত পর্যন্ত তা ঘরে থাকা আমি পছন্দ করিনি। কাজেই তা বন্টন করে দিয়ে এলাম।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 113290,
        "last_updated": null
    },
    {
        "banglaURN": 6014310,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1893,
        "babName": null,
        "hadithNumber": 1431,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ঈদের দিন রেব হলেন এবং দু’রাক’আত সালাত আদায় করলেন, এর আগে ও পরে কোন সালাত আদায় করেননি। এরপর তিনি বিলাল (রাঃ)-কে সাথে নিয়ে মহিলাদের কাছে গেলেন। তাদের উপদেশ দিলেন এবং সদকা করার নির্দেশ দিলেন। তখন মহিলাগণ কানের দুল ও হাতের কংকন ছুঁড়ে মারতে লাগলেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 113300,
        "last_updated": null
    },
    {
        "banglaURN": 6014320,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1893,
        "babName": null,
        "hadithNumber": 1432,
        "hadithSanad": "",
        "hadithText": "আবূ মূসা (আশ’আরী) (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট কেউ কিছু চাইলে বা প্রয়োজনীয় কিছু চাওয়া হলে তিনি বলতেনঃ তোমরা সুপারিশ কর সওয়াব প্রাপ্ত হবে, আল্লাহ তাঁর ইচ্ছা তাঁর নবীর মুখে চূড়ান্ত করেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 113310,
        "last_updated": null
    },
    {
        "banglaURN": 6014330,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1893,
        "babName": null,
        "hadithNumber": 1433,
        "hadithSanad": "",
        "hadithText": "আসমা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাকে বললেনঃ তুমি (সম্পদ কমে যাওয়ার আশঙ্কায়) সদকা দেয়া বন্ধ করবে না। অন্যথায় তোমার জন্যও আল্লাহ কর্তৃক দান বন্ধ করে দেয়া হবে।\n‘আবদা (রহঃ) হতে বর্ণিত যে, [পূর্বোক্ত সূত্রে আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন] তুমি (সম্পদ) গণনা করে জমা রেখো না, (এরূপ করলে) আল্লাহ তোমার রিযক বন্ধ করে দিবেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 113321,
        "last_updated": null
    },
    {
        "banglaURN": 6014340,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1894,
        "babName": null,
        "hadithNumber": 1434,
        "hadithSanad": "",
        "hadithText": "আসমা বিনতু আবূ বক্‌র (রাঃ) থেকে বর্ণিতঃ তিনি এক সময় নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট উপস্থিত হলে তিনি তাঁকে বললেনঃ তুমি সম্পদ জমা করে রেখো না, এরূপ করলে আল্লাহ তোমা হতে তা আটকে রাখবেন। কাজেই সাধ্যানুসারে দান করতে থাক।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 113340,
        "last_updated": null
    },
    {
        "banglaURN": 6014350,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1895,
        "babName": null,
        "hadithNumber": 1435,
        "hadithSanad": "",
        "hadithText": "হুযাইফা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, একদা ‘উমর ইব্‌নু খাত্তাব (রাঃ) বললেন, তোমাদের মধ্যে কে আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে ফিতনা সম্পর্কিত হাদীস মনে রেখেছ? হুযায়ফা (রাঃ) বলেন, আমি বললাম, আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যেভাবে বলেছেন, আমি ঠিক সেভাবেই তা স্মরণ রেখেছি। ‘উমর (রাঃ) বললেন, তুমি [আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে প্রশ্ন করার ক্ষেত্রে] বড় দুঃসাহসী ছিলে, তিনি কিভাবে বলেছেন (বলতো)? তিনি বলেন, আমি বললাম, (হাদীসটি হলোঃ) মানুষ পরিবার-পরিজন, সন্তান-সন্ততি ও প্রতিবেশী নিয়ে ফিতনায় পতিত হবে আর সালাত, সদকা ও নেক কাজ সেই ফিতনা মুছে দিবে। সুলাইমান [অর্থাৎ আমাশ (রহঃ)] বলেন, আবূ ওয়াইল কোন কোন সময় সালাত, সদকা ও সৎ কাজের আদেশ ও অসৎ কাজের নিষেধ করতে বলতেন। ‘উমর (রাঃ) বলেন, আমি এ ধরনের ফিতনার কথা অবগত হতে চাইনি, বরং যে ফিতনা সাগরের ঢেউয়ের মত প্রবল বেগে ছুটে আসবে। হুযায়ফা (রাঃ) বলেন, আমি বললাম, আমীরুল মু’মিনীন। আপনার জীবনকালে ঐ ফিতনার কোন ভয় নেই। সেই ফিতনা ও আপনার মাঝে বদ্ধ দরজা রয়েছে। ‘উমর (রাঃ) প্রশ্ন করলেন, দরজা কি ভেঙ্গে দেয়া হবে না কি খুলে দেয়া হবে? হুযাইফা (রাঃ) বলেন, আমি বললাম, না বরং ভেঙ্গে দেয়া হবে। ‘উমর (রাঃ) বললেন, দরজা ভেঙ্গে দেয়া হলে কোন দিন তা আর বন্ধ করা সম্ভব হবে না। তিনি বলেন, আমি বললাম, সত্যই বলেছেন। আবূ ওয়াইল (রাঃ) বলেন, দরজা বলতে কাকে বোঝানো হয়েছে- এ কথা হুযাইফা (রাঃ)-এর নিকট প্রশ্ন করে জানতে আমরা কেউ সাহসী হলাম না। তাই প্রশ্ন করতে মাসরূককে অনুরোধ করলাম। মাসরূক (রহঃ) হুযাইফা (রাঃ)-কে প্রশ্ন করায় তিনি উত্তর দিলেনঃ দরজা হলেন ‘উমর (রাঃ)। আমরা বললাম, আপনি দরজা বলে যাকে উদ্দেশ করেছেন, ‘উমর (রাঃ) কি তা অনুধাবন করতে পেরেছেন? তিনি বললেন, হ্যাঁ, আগামীকালের পূর্বে রাতের আগমন যেমন সুনিশ্চিত (তেমনি নিঃসন্দেহে তিনি তা উপলব্ধি করতে পেরেছেন)। এর কারণ হলো, আমি তাঁকে এমন হাদীস বর্ণনা করেছি, যাতে কোন ভুল ছিল না।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 113350,
        "last_updated": null
    },
    {
        "banglaURN": 6014360,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1896,
        "babName": null,
        "hadithNumber": 1436,
        "hadithSanad": "",
        "hadithText": "হাকীম ইব্‌নু হিযাম (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আরয করলাম, হে আল্লাহর রাসূল! ঈমান আনয়নের পূর্বে (সওয়াব লাভের উদ্দেশ্যে) আমি সদকা প্রদান, দাসমুক্ত করা ও আত্মীয়তার সম্পর্ক রক্ষা করার ন্যায় যত কাজ করেছি, সেগুলোতে সওয়াব হবে কি? তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ তুমি যে সব ভালো কাজ করেছ তা নিয়েই ইসলাম গ্রহণ করেছ (তুমি সেসব কাজের সওয়াব পাবে)।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 113360,
        "last_updated": null
    },
    {
        "banglaURN": 6014370,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1897,
        "babName": null,
        "hadithNumber": 1437,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ স্ত্রী তার স্বামীর খাদ্য সামগ্রী হতে বিপর্যয়ের উদ্দেশ্য ব্যতীত সদকা করলে সে সদকা করার সওয়াব পাবে, উপার্জন করার কারণে স্বামীও এর সওয়াব পাবে এবং খাজাঞ্চীও অনুরূপ সওয়াব পাবে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 113370,
        "last_updated": null
    },
    {
        "banglaURN": 6014380,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1897,
        "babName": null,
        "hadithNumber": 1438,
        "hadithSanad": "",
        "hadithText": "আবূ মূসা (রাঃ) সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেনঃ যে বিশ্বস্ত মুসলিম খাজাঞ্চী (আপন মালিক কর্তৃক) নির্দেশিত পরিমাণ সদকার সবটুকুই নির্দিষ্ট ব্যক্তিকে সানন্দচিত্তে আদায় করে, কোন কোন সময় তিনি - (বাস্তবায়িত করে) শব্দের স্থলে - (আদায় করে) শব্দ বলেছেন, সে খাজাঞ্চীও নির্দেশদাতার ন্যায় সদকা দানকারী হিসেবে গণ্য।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 113380,
        "last_updated": null
    },
    {
        "banglaURN": 6014390,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1898,
        "babName": null,
        "hadithNumber": 1439,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে বর্ণনা করেছেন, স্ত্রী তার স্বামীর ঘর হতে কাউকে কিছু সদকা করলে (স্ত্রী এর সওয়াব পাবে)।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 113390,
        "last_updated": null
    },
    {
        "banglaURN": 6014400,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1898,
        "babName": null,
        "hadithNumber": 1440,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ ফাসাদের উদ্দেশ্য ব্যতীত স্ত্রী তার স্বামীর গৃহ হতে কাউকে কিছু আহার করালে স্ত্রী এর সওয়াব পাবে স্বামীও সমপরিমাণ সওয়াব পাবে এবং খাজাঞ্চীও সেই পরিমাণ সওয়াব পাবে। স্বামী উপার্জন করার কারণে আর স্ত্রী দান করার কারণে সওয়াব পাবে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 113400,
        "last_updated": null
    },
    {
        "banglaURN": 6014410,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1898,
        "babName": null,
        "hadithNumber": 1441,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেনঃ ফাসাদের উদ্দেশ্য ব্যতীত স্ত্রী তার ঘরের খাদ্য সামগ্রী হতে সদকা করলে সে এর সওয়াব পাবে। উপার্জন করার কারণে স্বামীও সওয়াব পাবে এবং খাজাঞ্চীও সমপরিমাণ সওয়াব পাবে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 113410,
        "last_updated": null
    },
    {
        "banglaURN": 6014420,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1899,
        "babName": null,
        "hadithNumber": 1442,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ প্রতিদিন সকালে দু’জন ফেরেশতা অবতরণ করেন। তাঁদের একজন বলেন, হে আল্লাহ! দাতাকে তার দানের উত্তম প্রতিদান দিন আর অপরজন বলেন, হে আল্লাহ! কৃপণকে ধ্বংস করে দিন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 113420,
        "last_updated": null
    },
    {
        "banglaURN": 6014430,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1900,
        "babName": null,
        "hadithNumber": 1443,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ইরশাদ করেছেনঃ কৃপণ ও সদকা দানকারীর দৃষ্টান্ত এমন দু’ব্যক্তির মত যাদের পরিধানে দু’টি লোহার বর্ম রয়েছে। অপর সনদে আবুল ইয়ামান (রহঃ) ….. আবূ হুরায়রা (রাঃ) হতে বর্ণিত, তিনি আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছেন, কৃপণ ও সদকা দানকারীর দৃষ্টান্ত এমন দু’ব্যক্তির মত, যাদের পরিধানে দুটি লোহার বর্ম রয়েছে যা তাদের বুক হতে কাঁধ পর্যন্ত বিস্তৃত। দাতা ব্যক্তি যখন দান করে তখন বর্মটি তার সম্পূর্ণ দেহ পর্যন্ত প্রশস্ত হয়ে যায়। এমনকি হাতের আঙ্গুলের মাথা পর্যন্ত ঢেকে ফেলে ও (পায়ের পাতা পর্যন্ত ঝুলন্ত বর্ম) পদচিহ্ন মুছে ফেলে। আর কৃপণ ব্যক্তি যখন যৎসামান্যও দান করতে চায়, তখন যেন বর্মের প্রতিটি আংটা যথাস্থানে সেঁটে যায়, সে তা প্রশস্ত করতে চেষ্টা করলেও তা প্রশস্ত হয় না।\n\nহাসান ইব্‌নু মুসলিম (রহঃ) তাউস (রহঃ) হতে - শব্দটির বর্ণনায় ইব্‌নু তাউস (রহঃ) –এর অনুসরণ করেছেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 113430,
        "last_updated": null
    },
    {
        "banglaURN": 6014440,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1900,
        "babName": null,
        "hadithNumber": 1444,
        "hadithSanad": "",
        "hadithText": "তাউস (রহঃ) থেকে বর্ণিতঃ লায়স (রহঃ) আবূ হুরায়রা (রাঃ) সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে - (ঢাল) শব্দের উল্লেখ রয়েছে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 113440,
        "last_updated": null
    },
    {
        "banglaURN": 6014450,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1902,
        "babName": null,
        "hadithNumber": 1445,
        "hadithSanad": "",
        "hadithText": "আবূ মূসা আশ’আরী (রাঃ) সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেনঃ প্রতিটি মুসলিমের সদকা করা উচিত। সাহাবীগণ আরয করলেন, কেউ যদি সদকা দেয়ার মত কিছু না পায়? (তিনি উত্তরে) বললেনঃ সে ব্যক্তি নিজ হাতে কাজ করবে এতে নিজেও লাভবান হবে, সদকাও করতে পারবে। তাঁরা বললেন, যদি এরও ক্ষমতা না থাকে? তিনি বললেনঃ কোন বিপদগ্রস্তকে সাহায্য করবে। তাঁরা বললেন, যদি এতটুকুরও সামর্থ্য না থাকে? তিনি বললেনঃ এ অবস্থায় সে যেন সৎ আমল করে এবং অন্যায় কাজ হতে বিরত থাকে। এটা তার জন্য সদকা বলে গণ্য হবে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 113450,
        "last_updated": null
    },
    {
        "banglaURN": 6014460,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1903,
        "babName": null,
        "hadithNumber": 1446,
        "hadithSanad": "",
        "hadithText": "উম্মু আতিয়্যা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নুসায়বা নাম্নী আনসারী মহিলার জন্য একটি বকরী (সদকা স্বরূপ) পাঠানো হলো। তিনি বকরীর কিছু অংশ ‘আয়িশা (রাঃ) কে (হাদিয়া [৩৬] স্বরূপ) পাঠিয়ে দিলেন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ তোমাদের কাছে (আহার্য) কিছু আছে কি? ‘আয়িশা (রাঃ) বললেন, নুসায়বা কর্তৃক প্রেরিত সেই বকরীর গোশত ব্যতীত আর কিছুই নেই। তখন তিনি বললেনঃ তাই নিয়ে এসো, কেননা বকরীর (সদকা) যথাস্থানে পৌঁছে গেছে (সদকা গ্রহীতার নিকট)।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 113460,
        "last_updated": null
    },
    {
        "banglaURN": 6014470,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1904,
        "babName": null,
        "hadithNumber": 1447,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ খুদরী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ পাঁচের কম সংখ্যক উটের [৩৭] উপর যাকাত নেই, পাঁচ উকিয়া-এর কম পরিমাণ রূপার উপর যাকাত নেই এবং পাঁচ ওয়াসক-এর কম পরিমাণ উৎপন্ন দ্রব্যের উপর সদকা (উশর) নেই। (আ.প্র. ১৩৫৩, ই.ফা. ১৩৫৯)\nআবূ সা’ঈদ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে এ হাদীসটি শুনেছি।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 113471,
        "last_updated": null
    },
    {
        "banglaURN": 6014480,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1905,
        "babName": null,
        "hadithNumber": 1448,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ আবূ বকর (রাঃ) আনাস (রাঃ)-এর কাছে রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে আল্লাহ তা’আলা যাকাত সম্পর্কে যে বিধান দিয়েছেন সে সম্পর্কে লিখে জানালেন, যে ব্যক্তির উপর যাকাত হিসেবে বিনতে মাখায [৩৮] ওয়াজিব হয়েছে কিন্তু তার কাছে তা নেই বরং বিনত লাবূন [৩৯] রয়েছে, তা হলে তা-ই (যাকাত স্বরূপ) গ্রহণ করা হবে। এ অবস্থায় যাকাত আদায়কারী যাকাত দাতাকে বিশটি দিরহাম বা দুটি বকরী দিবে। আর যদি বিনতে মাখায না থাকে বরং ইব্‌নু লাবূন থাকে তা হলে তা-ই গ্রহণ করা হবে। এমতাবস্থায় আদায়কারীর যাকাত দাতাকে কিছু দিতে হবে না।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 113490,
        "last_updated": null
    },
    {
        "banglaURN": 6014490,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1905,
        "babName": null,
        "hadithNumber": 1449,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি সাক্ষ্য দিচ্ছি যে, আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) খুতবা প্রদানের পূর্বেই (ঈদের) সালাত আদায় করেন, এরপর বুঝতে পারলেন যে, (সকলের পিছনে থাকা বিধায়) নারীদেরকে খুতবার আওয়াজ পৌছাতে পারেননি। তাই তিনি নারীদের নিকট আসলেন, তাঁর সাথে বিলাল (রাঃ) ছিলেন। তিনি একখন্ড বস্ত্র প্রসারিত করে ধরলেন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাদেরকে উপদেশ দিলেন ও সদকা করতে আদেশ করলেন। তখন মহিলাগণ তাদের (অলংকারাদি) ছুঁড়ে মারতে লাগলেন। (রাবী) আইয়ুব (রহঃ) তার কান ও গলার দিকে ইঙ্গিত করে (মহিলাগণের অলংকারাদি দান করার বিষয়) দেখালেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 113500,
        "last_updated": null
    },
    {
        "banglaURN": 6014500,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1906,
        "babName": null,
        "hadithNumber": 1450,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যাকাত সম্পর্কে যে বিধান দিয়েছেন তা আবূ বকর (রাঃ) তাঁর নিকট লিখে পাঠান, যাকাতের (পরিমাণ কম-বেশি হওয়ার) আশংকায় বিচ্ছিন্ন [৪০] (প্রাণী)-গুলোকে একত্রিত করা যাবে না এবং একত্রিতগুলোকে বিচ্ছিন্ন  করা যাবে না।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 113510,
        "last_updated": null
    },
    {
        "banglaURN": 6014510,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1907,
        "babName": null,
        "hadithNumber": 1451,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যাকাত সম্পর্কে যে বিধান দিয়েছেন আবূ বকর (রাঃ) তা তাকে লিখে জানালেন, এক অংশীদার অপর অংশীদারের নিকট হতে তার প্রাপ্য আদায় করে নিবে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 113520,
        "last_updated": null
    },
    {
        "banglaURN": 6014520,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1908,
        "babName": null,
        "hadithNumber": 1452,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ খুদরী (রাঃ) থেকে বর্ণিতঃ জনৈক বেদুঈন আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট হিজরত সম্পর্কে জিজ্ঞেস করলে তিনি বললেনঃ তোমার তো বড় সাহস! হিজরতের ব্যাপার কঠিন, বরং যাকাত দেয়ার মত তোমার কোন উট আছে কি? সে বলল, জী হ্যাঁ, আছে। আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ সাগরের ওপারে হলেও (যেখানেই থাক) তুমি ‘আমল করবে। তোমার ন্যূনতম ‘আমলও আল্লাহ বিনষ্ট করবেন না।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 113530,
        "last_updated": null
    },
    {
        "banglaURN": 6014530,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1909,
        "babName": null,
        "hadithNumber": 1453,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ আবূ বকর (রাঃ) তাঁর কাছে আল্লাহ তাঁর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে যাকাত সম্পর্কে যে বিধান দিয়েছেন তা লিখে পাঠানঃ যে ব্যক্তির উপর উটের যাকাত হিসেবে জাযা’আ ফরয হয়েছে, অথচ তার নিকট জাযা’আহ [৪১] নেই বরং তার নিকট হিককা [৪২] রয়েছে, তখন হিককা গ্রহণ করা হবে। এর সাথে সম্ভব হলে (পরিপূরকরূপে) দু’টি বকরী দিবে, অথবা বিশটি দিরহাম দিবে। আর যার উপর যাকাত হিসেবে হিককা ফরয হয়েছে, অথচ তার কাছে হিককা নেই বরং জাযা’আ রয়েছে, তখন তার হতে জাযা’আ গ্রহণ করা হবে। আর যাকাত উসূলকারী (ক্ষতিপূরণ স্বরূপ) মালিককে বিশটি দিরহাম বা দু’টি বকরী দিবে। যার উপর হিককা ফরয হয়েছে, অথচ তার নিকট বিনত লাবূন রয়েছে, তখন বিনতে লাবূনই গ্রহণ করা হবে। তবে মালিক দুটি বকরী বা বিশটি দিরহাম দিবে। আর যার ওপর বিনত লাবূন ফরয হয়েছে, কিন্তু তার কাছে হিককা রয়েছে, তখন তার হতে হিককা গ্রহণ করা হবে এবং আদায়কারী মালিককে বিশটি দিরহাম বা দুটি বকরী দিবে। আর যার ওপর বিনত লাবূন ফরয হয়েছে কিন্তু তার নিকট তা নেই বরং বিনতে মাখায  রয়েছে, তবে তাই গ্রহণ করা হবে, অবশ্য মালিক এর সঙ্গে বিশটি দিরহাম বা দু’টি বকরী দিবে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 113540,
        "last_updated": null
    },
    {
        "banglaURN": 6014540,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1910,
        "babName": null,
        "hadithNumber": 1454,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ আবূ বকর (রাঃ) তাঁকে বাহরাইনে প্রেরণকালে অত্র বিধানটি তাঁর জন্য লিখে দেনঃ\nপরম দয়ালু করুণাময় আল্লাহর নামে। এটাই যাকাতের নিসাব-যা নির্ধারণ করেছেন আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) মুসলিমদের প্রতি এবং যা আল্লাহ তা’আলা তাঁর রসূলকে নির্দেশ দিয়েছেন। মুসলিমদের মধ্যে যার নিকট হতে নিয়মানুযায়ী চাওয়া হয়, সে যেন তা আদায় করে দেয় আর তার চেয়ে অধিক চাওয়া হলে তা যেন আদায় না করে। চব্বিশ ও তার চেয়ে কম সংখ্যক উটের যাকাত বকরী দ্বারা আদায় করা হবে। প্রতিটি পাঁচটি উটে একটি বকরী এবং উটের সংখ্যা পঁচিশ হতে পয়ত্রিশ পর্যন্ত হলে একটি মাদী বিনতে মাখায। ছত্রিশ হতে পয়তাল্লিশ পর্যন্ত একটি মাদী বিনতে লাবূন। ছয়চল্লিশ হতে ষাট পর্যন্ত ষাড়ের পালযোগ্য একটি হিককা, একষট্টি হতে পচাত্তর পর্যন্ত একটি জাযা’আ, ছিয়াত্তর হতে নব্বই পর্যন্ত দুটি বিনতে লাবূন, একানব্বইটি হতে একশ বিশ পর্যন্ত ষাড়ের পালযোগ্য দুটি হিককা আর একশ বিশের অধিক হলে (অতিরিক্ত) প্রতি চল্লিশটিতে একটি করে বিনতে লাবূন এবং (অতিরিক্ত) প্রতি পঞ্চাশটিতে একটি করে হিককা। যার চারটির বেশি উট নেই, সেগুলোর উপর কোন যাকাত নেই, তবে মালিক স্বেচ্ছায় কিছু দিতে চাইলে দিতে পারবে। কিন্তু যখন পাঁচে পৌঁছে তখন একটি বকরী ওয়াজিব। আর বকরীর যাকাত সম্পর্কেঃ গৃহপালিত বকরী চল্লিশটি হতে একশ বিশটি পর্যন্ত একটি বকরী। এর বেশি হলে দু’শটি পর্যন্ত দু’টি বকরী। দু’শর অধিক হলে তিনশ পর্যন্ত তিনটি বকরী। তিনশ-র অধিক হলে প্রতি একশ-তে একটি করে বকরী। কারো গৃহপালিত বকরীর সংখ্যা চল্লিশ হতে একটিও কম হলে তার উপর যাকাত নেই। তবে স্বেচ্ছায় দান করলে তা করতে পারে। রৌপ্যের যাকাত চল্লিশ ভাগের এক ভাগ। একশ নব্বই দিরহাম হলে সেক্ষেত্রে যাকাত নেই [৪৩], তবে মালিক স্বেচ্ছায় কিছু দিলে দিতে পারে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 113550,
        "last_updated": null
    },
    {
        "banglaURN": 6014550,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1911,
        "babName": null,
        "hadithNumber": 1455,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহ তাঁর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর প্রতি যাকাতের যে বিধান দিয়েছেন তা আবূ বকর (রাঃ) তাঁর নিকট লিখে পাঠান। তাতে রয়েছেঃ অধিক বয়সে দাঁত পরা বৃদ্ধ ও ত্রুটিযুক্ত বকরী এবং পাঁঠা যাকাত হিসেবে গ্রহণ করা যাবে না, তবে যাকাত প্রদানকারী শেষোক্ত প্রাণী তথা পাঁঠা ইচ্ছা করলে দিতে পারেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 113560,
        "last_updated": null
    },
    {
        "banglaURN": 6014580,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1913,
        "babName": null,
        "hadithNumber": 1458,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু আব্বাস (রাঃ) থেকে বর্ণিতঃ আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যখন মু’আয (ইব্‌নু জাবাল) (রাঃ)-কে শাসনকর্তা হিসেবে ইয়ামান দেশে পাঠান, তখন বলেছিলেনঃ তুমি আহলে কিতাব লোকদের নিকট যাচ্ছো। সেহেতু প্রথমে তাদের আল্লাহর ইবাদতের দাওয়াত দিবে। যখন তারা আল্লাহর পরিচয় লাভ করবে, তখন তাদের তুমি বলবে যে, আল্লাহ দিন-রাতে তাদের উপর পাঁচ ওয়াক্ত সালাত ফরয করে দিয়েছেন। যখন তারা তা আদায় করতে থাকবে, তখন তাদের জানিয়ে দিবে যে, আল্লাহ তাদের উপর যাকাত ফরয করেছেন, যা তাদের ধন-সম্পদ হতে গ্রহণ করা হবে এবং তাদের দরিদ্রদের মধ্যে বিতরণ করে দেয়া হবে। যখন তারা এর অনুসরণ করবে তখন তাদের হতে তা গ্রহণ করবে এবং লোকের উত্তম [৪৪] মাল গ্রহণ করা হতে বিরত থাকবে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 113590,
        "last_updated": null
    },
    {
        "banglaURN": 6014590,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1914,
        "babName": null,
        "hadithNumber": 1459,
        "hadithSanad": "",
        "hadithText": "আবূ সাঈদ খুদরী (রাঃ) থেকে বর্ণিতঃ আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, পাঁচ ওসাক-এর কম পরিমাণ খেজুরের যাকাত নেই। পাঁচ উকিয়ার কম পরিমাণ রৌপ্যের যাকাত নেই এবং পাঁচটির কম উটের যাকাত নেই।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 113600,
        "last_updated": null
    },
    {
        "banglaURN": 6014600,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1915,
        "babName": null,
        "hadithNumber": 1460,
        "hadithSanad": "",
        "hadithText": "আবূ যার (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছে গমন করলাম। তিনি বললেনঃ শপথ সেই সত্তার যাঁর হাতে আমার প্রাণ (বা তিনি বললেন) শপথ সেই সত্তার, যিনি ব্যতীত প্রকৃত কোন উপাস্য নেই, অথবা অন্য কোন শব্দে শপথ করলেন, উট, গরু বা বকরী থাকা সত্ত্বেও যে ব্যক্তি এদের হক আদায় করেনি সেগুলো যেমন ছিল তার চেয়ে বৃহদাকার ও মোটা তাজা করে কিয়ামাতের দিন হাযির করা হবে এবং তাকে পদপিষ্ট করবে এবং শিং দিয়ে গুঁতো দিবে। যখনই দলের শেষটি চলে যাবে তখন পালাক্রমে আমার প্রথমটি ফিরিয়ে আনা হবে। মানুষের বিচার শেষ না হওয়া পর্যন্ত তার সাথে এরূপ চলতে থাকবে। হাদীসটি বুকায়র (রহঃ) আবূ সারিহ (রহঃ)-এর মাধ্যমে হুরায়রা (রাঃ) সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে বর্ণনা করেছেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 113610,
        "last_updated": null
    },
    {
        "banglaURN": 6014610,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1916,
        "babName": null,
        "hadithNumber": 1461,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, মদীনার আনসারীগণের মধ্যে আবূ তালহা (রাঃ) সবচাইতে বেশী খেজুর বাগানের মালিক ছিলেন। মসজিদে নাববীর নিকটবর্তী বায়রুহা নামক বাগানটি তাঁর কাছে অধিক প্রিয় ছিল। আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁর বাগানে প্রবেশ করে এর সুপেয় পানি পান করতেন। আনাস (রাঃ) বলেন, যখন এ আয়াত অবতীর্ণ হলোঃ “তোমরা যা ভালবাস তা হতে ব্যয় না করা পর্যন্ত তোমরা কখনো পুণ্য লাভ করবে না”- (আল-ইমরানঃ ৯২)। তখন আবূ তালহা (রাঃ) আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছে গিয়ে বললেন, হে আল্লাহর রাসূল! আল্লাহ বলেছেনঃ “তোমরা যা ভালবাস তা হতে ব্যয় না করা পর্যন্ত তোমরা কখনো পুণ্য লাভ করবে না”- (আল-ইমরানঃ ৯২)। আর বায়রুহা বাগানটি আমার কাছে অধিক প্রিয়। এটি আল্লাহর নামে সদকা করা হলো, আমি এর কল্যাণ কামনা করি এবং তা আল্লাহর নিকট আমার জন্য সঞ্চয়রূপে থাকবে। কাজেই আপনি যাকে দান করা ভাল মনে করেন, তাকে দান করুন। তখন আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ তোমাকে ধন্যবাদ, এ হচ্ছে লাভজনক সম্পদ, এ হচ্ছে লাভজনক সম্পদ। তুমি যা বলেছ তা শুনলাম। আমি মনে করি, তোমার আপন জনদের মধ্যে তা বন্টন করে দাও। আবূ তালহা (রাঃ) বললেন, হে আল্লাহর রাসূল! আমি তাই করব। অতঃপর তিনি তাঁর আত্মীয়-স্বজন, আপন চাচার বংশধরের মধ্যে তা বন্টন করে দিলেন। রাবী রাওহ (রহঃ) -- শব্দে ‘আবদুল্লাহ্‌ ইব্‌নু ইউসুফ (রহঃ)-এর অনুসরণ করেছেন। আর রাবী ইয়াহইয়া ইব্‌নু ইয়াহইয়া (রহঃ) ও ইসমা’ঈল (রহঃ) মালিক (রহঃ) হতে -- শব্দ বলেছেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 113620,
        "last_updated": null
    },
    {
        "banglaURN": 6014620,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1916,
        "babName": null,
        "hadithNumber": 1462,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ খুদরী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, এক ঈদুল আযহা বা ঈদুল ফিতরের দিনে আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ঈদগাহে গেলেন এবং সালাত শেষ করলেন। পরে লোকদের উপদেশ দিলেন এবং তাদের সদকা দেয়ার নির্দেশ দিলেন আর বললেনঃ লোক সকল! তোমরা সদকা দিবে। অতঃপর মহিলাগণের নিকট গিয়ে বললেনঃ মহিলাগণ! তোমরা সদকা দাও। আমাকে জাহান্নামে তোমাদেরকে অধিক সংখ্যক দেখানো হয়েছে। তারা বললেন, হে আল্লাহর রাসূল! এর কারণ কী? তিনি বললেনঃ তোমরা বেশি অভিশাপ দিয়ে থাক এবং স্বামীর অকৃতজ্ঞ হয়ে থাক। হে মহিলাগণ! জ্ঞান ও দ্বীনে অপরিপূর্ণ হওয়া স্বত্বেও দৃঢ়চেতা পুরুষের বুদ্ধি হরণকারিণী তোমাদের মত কাউকে দেখিনি। যখন তিনি ফিরে এসে ঘরে পৌছলেন, তখন ইব্‌নু মাস’ঊদ (রাঃ)-এর স্ত্রী যায়নাব (রাঃ) তাঁর কাছে প্রবেশের অনুমতি চাইলেন। বলা হলো, হে আল্লাহর রাসূল! যায়নাব এসেছেন। তিনি বললেন, কোন যায়নাব? বলা হলো, ইব্‌নু মাস’ঊদের স্ত্রী। তিনি বললেনঃ হাঁ, তাকে আসতে দাও। তাকে অনুমতি দেয়া হলো। তিনি বললেন, হে আল্লাহর নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আজ আপনি সদকা করার নির্দেশ দিয়েছেন। আমার অলংকার আছে। আমি তা সদকা করার ইচ্ছা করেছি। ইব্‌নু মাস’ঊদ (রাঃ) মনে করেন, আমার এ সদকায় তাঁর এবং তাঁর সন্তানদেরই হক বেশি। তখন আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, ইব্‌নু মাস’ঊদ (রাঃ) ঠিক বলেছে। তোমার স্বামী ও সন্তানই তোমার এ সদকার অধিক হকদার।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 113630,
        "last_updated": null
    },
    {
        "banglaURN": 6014630,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1917,
        "babName": null,
        "hadithNumber": 1463,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, মুসলিমের উপরে তার ঘোড়া ও গোলামের কোন যাকাত নেই।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 113640,
        "last_updated": null
    },
    {
        "banglaURN": 6014640,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1918,
        "babName": null,
        "hadithNumber": 1464,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, মুসলিমের উপর তার গোলাম ও ঘোড়ার কোন যাকাত নেই।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 113650,
        "last_updated": null
    },
    {
        "banglaURN": 6014650,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1919,
        "babName": null,
        "hadithNumber": 1465,
        "hadithSanad": "",
        "hadithText": "আবূ সাঈদ খুদরী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, একদা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) মিম্বরে বসলেন এবং আমরা তাঁর আশেপাশে বসলাম। তিনি বললেনঃ আমার পরে তোমাদের ব্যাপারে আমি যা আশঙ্কা করছি তা হলো এই যে দুনিয়ার চাকচিক্য ও সৌন্দর্য (ধন-সম্পদ) তোমাদের সামনে খুলে দেয়া হবে। এক সাহাবী বললেন, হে আল্লাহর রাসূল! কল্যাণ কি কখনো অকল্যাণ বয়ে আনে? এতে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) নীরব হলেন। প্রশ্নকারীকে বলা হলো, তোমার কী হয়েছে? তুমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সাথে কথা বলছ, কিন্তু তিনি তোমাকে জওয়াব দিচ্ছেন না? তখন আমরা অনুভব কলাম যে, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর উপর ওয়াহী নাযিল হচ্ছে। বর্ণনাকারী বলেন, এরপর তিনি তাঁর ঘাম মুছলেন এবং বললেনঃ প্রশ্নকারী কোথায়? যেন তার প্রশ্নকে প্রশংসা করে বললেন, কল্যাণ কখনো অকল্যাণ বয়ে আনে না। অবশ্য বসন্ত মৌসুম যে ঘাস উৎপন্ন করে তা (সবটুকুই সুস্বাদু ও কল্যাণকর বটে তবে) অনেক সময় হয়ত (ভোজনকারী প্রাণীর) জীবন নাশ করে অথবা তাকে মৃত্যুর কাছাকাছি নিয়ে যায়। তবে ঐ তৃণভোজী জন্তু, যে পেট ভরে খাওয়ার পর সূর্যের তাপ গ্রহণ করে এবং মল ত্যাগ করে, প্রস্রাব করে এবং পুণরায় চলে (সেই মৃত্যু থেকে রক্ষা পায় তেমনি) এই সম্পদ হলো আকর্ষণীয় সুস্বাদু। কাজেই সে-ই ভাগ্যবান মুসলিম, যে এই সম্পদ থেকে মিসকীন, ইয়াতীম ও মুসাফিরকে দান করে অথবা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যেরূপ বলেছেন, আর যে ব্যক্তি এই সম্পদ অন্যায়ভাবে উপার্জন করে, সে ঐ ব্যক্তির ন্যায়, যে খেতে থাকে এবং তার পেট ভরে না। ক্বিয়ামত দিবসে ঐ সম্পদ তার বিপক্ষে সাক্ষ্য দিবে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 113660,
        "last_updated": null
    },
    {
        "banglaURN": 6014660,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1920,
        "babName": null,
        "hadithNumber": 1466,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ (ইব্‌নু মাস’ঊদ) (রাঃ)-এর স্ত্রী যায়নাব (রাঃ) থেকে বর্ণিতঃ [রাবী আ’মাশ (রহঃ) বলেন,] আমি ইবরাহীম (রহঃ)-এর সাথে এ হাদীসের আলোচনা করলে তিনি আবূ ‘উবায়দাহ সূত্রে ‘আমর ইব্‌নু হারিস (রাঃ)-এর মাধ্যমে ‘আবদুল্লাহ্‌ (রাঃ)-এর স্ত্রী যায়নাব (রাঃ) হতে হুবহু বর্ণনা করেন। তিনি [যায়নাব (রাঃ)] বলেন, আমি মসজিদে ছিলাম। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে দেখলাম তিনি বলছেনঃ তোমরা সদকা দাও যদিও তোমাদের অলংকার হতে হয়। যায়নাব (রাঃ) ‘আবদুল্লাহ্‌ (রাঃ) ও তাঁর পোষ্য ইয়াতীমের প্রতি খরচ করতেন। তখন তিনি ‘আবদুল্লাহ্‌কে বললেন, তুমি আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট জেনে এসো যে, তোমার প্রতি এবং আমার পোষ্য ইয়াতীমদের প্রতি খরচ করলে আমার পক্ষ হতে সদকা আদায় হবে কি? তিনি [ইব্‌নু মাস’উদ (রাঃ)] বললেন, বরং তুমিই আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছে জেনে এসো। এরপর আমি আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট গেলাম। তাঁর দরজায় আরো একজন আনসারী মহিলাকে দেখলাম, তার প্রয়োজনও আমার প্রয়োজনের অনুরূপ। তখন বিলাল (রাঃ)-কে আমাদের পাশ দিয়ে যেতে দেখে বললাম, আপনি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছে জিজ্ঞেস করুন, স্বামী ও আপন (পোষ্য) ইয়াতীমের প্রতি সদকা করলে কি আমার পক্ষ হতে তা যথেষ্ট হবে? এবং এ কথাও বলেছিলাম যে, আমাদের কথা জানাবেন না। তিনি প্রবেশ করে তাঁকে জিজ্ঞেস করলেন। আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ তারা কে? বিলাল (রাঃ) বললেন, যায়নাব। তিনি আবার জিজ্ঞেস করলেন, কোন যায়নাব? তিনি উত্তর দিলেন, আবদুল্লাহ্‌র স্ত্রী। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ তার জন্য দুটি সওয়াব [৪৫] রয়েছে, আত্মীয়কে দেয়ার সওয়াব আর সদকা দেয়ার সওয়াব।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 113670,
        "last_updated": null
    },
    {
        "banglaURN": 6014670,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1920,
        "babName": null,
        "hadithNumber": 1467,
        "hadithSanad": "",
        "hadithText": "উম্মু সালামা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি জিজ্ঞেস করলাম, হে আল্লাহর রাসূল! (আমার স্বামী) আবূ সালামার সন্তান, যারা আমারও সন্তান, তাদের প্রতি ব্যয় করলে আমার সওয়াব হবে কি? তিনি বললেনঃ তাদের প্রতি ব্যয় কর। তাদের প্রতি ব্যয় করার সওয়াব তুমি অবশ্যই পাবে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 113680,
        "last_updated": null
    },
    {
        "banglaURN": 6014680,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1921,
        "babName": null,
        "hadithNumber": 1468,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যাকাত দেয়ার নির্দেশ দিলে বলা হলো, ইব্‌নু জামীল, খালিদ ইব্‌নু ওয়ালীদ ও ‘আব্বাস ইব্‌নু আবদুল মুত্তালিব (রাঃ) যাকাত প্রদানে অস্বীকার করছে। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ ইব্‌নু জামীলের যাকাত না দেয়ার কারণ এ ছাড়া কিছু নয় যে, সে দরিদ্র ছিল, পরে আল্লাহর অনুগ্রহে ও তাঁর রাসূলের বরকতে সম্পদশালী হয়েছে। আর খালিদের ব্যাপার হলো তোমরা খালিদের উপর অন্যায় করেছ, কারণ সে তার বর্ম ও অন্যান্য যুদ্ধাস্ত্র আল্লাহর পথে আবদ্ধ রেখেছে। আর ‘আব্বাস ইব্‌নু ‘আব্দুল মুত্তালিব (রাঃ) তো আল্লাহর রসূলের চাচা। তাঁর যাকাত তাঁর জন্য সদকা এবং সমপরিমাণও তার জন্য সদকা। ইব্‌নু আবুয যিনাদ (রহঃ) তাঁর পিতা হতে হাদীস বর্ণনায় শু’আইব (রহঃ)-এর অনুসরণ করেছেন। আর ইব্‌নু ইসহাক (রহঃ) আবুয যিনাদ (রহঃ) হতে হাদীসের শেষাংশে ‘সদকা’ শব্দের উল্লেখ করেননি। ইব্‌নু জুরাইজ (রহঃ) বলেন, আ’রাজ (রহঃ) হতে অনুরূপ হাদীস আমার নিকট বর্ণনা করা হয়েছে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 113690,
        "last_updated": null
    },
    {
        "banglaURN": 6014690,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1922,
        "babName": null,
        "hadithNumber": 1469,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ খুদরী (রাঃ) থেকে বর্ণিতঃ কিছু সংখ্যক আনসারী সাহাবী আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট কিছু চাইলে তিনি তাঁদের দিলেন, পুনরায় তাঁরা চাইলে তিনি তাঁদের দিলেন। এমনকি তাঁর নিকট যা ছিল সবই শেষ হয়ে গেল। এরপর তিনি বললেনঃ আমার নিকট যে মাল থাকে তা তোমাদের না দিয়ে আমার নিকট জমা রাখি না। তবে যে চাওয়া হতে বিরত থাকে, আল্লাহ তাকে বাঁচিয়ে রাখেন আর যে পরমুখাপেক্ষী না হয়, আল্লাহ তাকে অভাবমুক্ত রাখেন। যে ব্যক্তি ধৈর্য ধারণ করে, আল্লাহ তাকে সবর দান করেন। সবরের চেয়ে উত্তম ও ব্যাপক কোন নি’আমত কাউকে দেয়া হয়নি।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 113700,
        "last_updated": null
    },
    {
        "banglaURN": 6014700,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1922,
        "babName": null,
        "hadithNumber": 1470,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ যার হাতে আমার জীবন, সেই সত্তার কসম! তোমাদের মধ্যে কারো রশি নিয়ে কাঠ সংগ্রহ করে পিঠে করে বয়ে আনা, কোন লোকের কাছে এসে চাওয়া অপেক্ষা অনেক ভাল, চাই সে দিক বা না দিক।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 113710,
        "last_updated": null
    },
    {
        "banglaURN": 6014710,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1922,
        "babName": null,
        "hadithNumber": 1471,
        "hadithSanad": "",
        "hadithText": "যুবাইর ইব্‌নু ‘আওয়াম (রাঃ) সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেনঃ তোমাদের মধ্যে কেউ রশি নিয়ে তার পিঠে কাঠের বোঝা বয়ে আনা এবং তা বিক্রী করা, ফলে আল্লাহ তার চেহারাকে (যাচঞা করার লাঞ্ছনা হতে) রক্ষা করেন, তা মানুষের কাছে সওয়াল করার চেয়ে উত্তম, চাই তারা দিক বা না দিক।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 113720,
        "last_updated": null
    },
    {
        "banglaURN": 6014720,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1922,
        "babName": null,
        "hadithNumber": 1472,
        "hadithSanad": "",
        "hadithText": "হাকীম ইব্‌নু হিযাম (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট কিছু চাইলাম, তিনি আমাকে দিলেন, আবার চাইলাম, তিনি আমাকে দিলেন, আবার চাইলাম, তিনি আমাকে দিলেন। অতঃপর বললেনঃ হে হাকীম! এই সম্পদ শ্যামল সুস্বাদু। যে ব্যক্তি প্রশস্ত অন্তরে (লোভ ব্যতীত) তা গ্রহণ করে তার জন্য তা বরকতময় হয়। আর যে ব্যক্তি অন্তরের লোভসহ তা গ্রহণ করে তার জন্য তা বরকতময় করা হয় না। যেন সে এমন ব্যক্তির মত, যে খায় কিন্তু তার ক্ষুধা মেটে না। উপরের হাত নিচের হাত হতে উত্তম। হাকীম (রাঃ) বলেন, আমি বললাম, যিনি আপনাকে সত্যসহ পাঠিয়েছেন, তাঁর কসম! হে আল্লাহর রাসূল! আপনার পর মৃত্যু পর্যন্ত (সওয়াল করে) আমি কাউকে সামান্যতমও ক্ষতিগ্রস্থ করবো না। এরপর আবূ বকর (রাঃ) হাকীম (রাঃ)-কে অনুদান গ্রহণের জন্য ডাকতেন, কিন্তু তিনি তাঁর কাছ হতে তা গ্রহণ করতে অস্বীকার করতেন। অত:পর ‘উমর (রাঃ) (তাঁর যুগে) তাঁকে কিছু দেয়ার জন্য ডাকলেন। তিনি তাঁর কাছ হতেও কিছু গ্রহণ করতে অস্বীকার করেন। ‘উমর (রাঃ) বললেন, মুসলিমগণ! হাকীম (রহঃ)-এর ব্যাপারে আমি তোমাদের সাক্ষী রাখছি। আমি তাঁর এই গণীমত হতে তাঁর প্রাপ্য পেশ করেছি, কিন্তু সে তা গ্রহণ করতে অস্বীকার করেছে। (সত্য সত্যই) আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর পর হাকীম (রাঃ) মৃত্যু অবধি কারো নিকট কিছু চেয়ে কাউকে ক্ষতিগ্রস্ত করেননি।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 113730,
        "last_updated": null
    },
    {
        "banglaURN": 6014730,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1923,
        "babName": null,
        "hadithNumber": 1473,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি ‘উমর (রাঃ)-কে বলতে শুনেছি যে, আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাকে কিছু দান করতেন, তখন আমি বলতাম, যে আমার চেয়ে বেশি অভাবগ্রস্ত, তাকে দিন। তখন আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলতেনঃ তা গ্রহণ কর। যখন তোমার কাছে এসব মালের কিছু আসে অথচ তার প্রতি তোমার অন্তরের লোভ নেই এবং তার জন্য তুমি প্রার্থী নও, তখন তা তুমি গ্রহণ করবে। এরূপ না হলে তুমি তার প্রতি অন্তর ধাবিত করবে না।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 113740,
        "last_updated": null
    },
    {
        "banglaURN": 6014760,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1925,
        "babName": null,
        "hadithNumber": 1476,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ সে ব্যক্তি প্রকৃত মিসকীন নয়, যাকে এক দু’লোকমা ফিরিয়ে দেয় (যথেষ্ট হয়) বরং সে-ই প্রকৃত মিসকীন যার কোন সম্পদ নেই, অথচ সে (চাইতে) লজ্জাবোধ করে অথবা লোকদেরকে আঁকড়ে ধরে যাচঞা করে না।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 113780,
        "last_updated": null
    },
    {
        "banglaURN": 6014770,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1925,
        "babName": null,
        "hadithNumber": 1477,
        "hadithSanad": "",
        "hadithText": "শা’বী (রহঃ) থেকে বর্ণিতঃ মুগীরা ইব্‌নু শু’বাহ্‌ (রহঃ)-এর কাতিব (একান্ত সচিব) বলেছেন, মু’আবিয়া (রাঃ) মুগীরা ইব্‌নু শু’বাহ (রাঃ)-এর কাছে লিখে পাঠালেন যে, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছ হতে আপনি যা শুনেছেন তার কিছু আমাকে লিখে জানান। তিনি তাঁর কাছে লিখলেন, আমি আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) –কে বলতে শুনেছি, আল্লাহ্‌ তোমাদের তিনটি কাজ অপছন্দ করেন- (১) অনর্থক কথাবার্তা, (২) সম্পদ নষ্ট করা এবং (৩) অত্যধিক সওয়াল করা।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 113790,
        "last_updated": null
    },
    {
        "banglaURN": 6014780,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1925,
        "babName": null,
        "hadithNumber": 1478,
        "hadithSanad": "",
        "hadithText": "সা’দ ইব্‌নু আবূ ওক্কাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) একদল লোককে কিছু দান করলেন। আমি তাদের মধ্যে উপবিষ্ট ছিলাম। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাদের মধ্য হতে এক ব্যক্তিকে কিছুই দিলেন না। অথচ সে ছিল আমার বিবেচনায় তাদের মধ্যে সবচাইতে উত্তম। আমি আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছে গিয়ে চুপে চুপে বললাম, অমুক সম্পর্কে আপনার কি হলো? আমি তো তাকে অবশ্য মু’মিন বলে মনে করি। তিনি বললেনঃ বরং মুসলিম (বল)। সা’দ (রাঃ) বলেন, এরপর আমি কিছুক্ষণ চুপ থাকলাম। আবার তার সম্পর্কে আমার ধারণা প্রবল হয়ে উঠলে আমি বললাম, হে আল্লাহ্‌র রসূল! অমুক সম্পর্কে আপনার কি হলো? আল্লাহ্‌র কসম! আমি তো তাকে অবশ্য মু’মিন বলে মনে করি। তিনি বললেনঃ বরং মুসলিম। এবারও কিছুক্ষণ নীরব রইলাম। আবার তার সম্পর্কে আমার ধারণা প্রবল হয়ে উঠলে আমি বললাম, অমুক সম্পর্কে আপনার কি হলো? আল্লাহ্‌র কসম! আমি তো তাকে মু’মিন বলে মনে করি। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ অথবা মুসলিম! এভাবে তিনবার বললেন। আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ আমি একজনকে দিয়ে থাকি অথচ অন্য ব্যক্তি আমার কাছে অধিক প্রিয় এই আশঙ্কায় যে, তাকে উপুড় করে জাহান্নামে নিক্ষেপ করা হবে। অপর সনদে ইসমাঈল ইব্‌নু মুহাম্মাদ (রহঃ) হতে বর্ণিত, তিনি বলেন, আমি আমার পিতাকে এভাবে বলতে শুনেছি, তিনি হাদীসটি বর্ণনা প্রসঙ্গে বলেছেন, অতঃপর আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমার কাঁধে হাত রাখলেন, এরপর বললেন, হে সা’দ! অগ্রসর হও। আমি সে লোকটিকে (এখন) অবশ্যই দিব।\nআবূ ‘আবদুল্লাহ্‌ (রহঃ) বলেন, -- অর্থ “উল্টিয়ে দেয়া হয়েছে।” (আল-ইসরা/বানী ইসরাঈলঃ ৯৪) -- -- বাগধারা অনুসারে -- হতে গৃহীত হয়েছে অর্থাৎ কর্তার কর্ম যখন কারো প্রতি না বর্তায় তখনই এরূপ বলা হয়ে থাকে। আর যদি কর্ম কারোর উপর বর্তায়, তখন বলা হয় --।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 113800,
        "last_updated": null
    },
    {
        "banglaURN": 6014790,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1925,
        "babName": null,
        "hadithNumber": 1479,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, প্রকৃত মিসকীন সে নয় যে মানুষের কাছে ভিক্ষার জন্য ঘুরে বেড়ায় এবং এক-দু’ লুকমা অথবা এক-দু’টি খেজুর পেলে ফিরে যায় বরং প্রকৃত মিসকীন সেই ব্যক্তি, যার এতটুকু সম্পদ নেই যাতে তার প্রয়োজন মিটতে পারে এবং অবস্থা সেরূপ বোঝা যায় না যে, তাকে দান খয়রাত করা যাবে আর সে মানুষের কাছে যাচঞা করে বেড়ায় না।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 113810,
        "last_updated": null
    },
    {
        "banglaURN": 6014800,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1925,
        "babName": null,
        "hadithNumber": 1480,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, তোমাদের কেউ যদি রশি নিয়ে সকাল বেলা বের হয়, (রাবী বলেন) আমার ধারণা যে, তিনি বলছেন, পাহাড়ের দিকে, অতঃপর লাকড়ী সংগ্রহ করে এবং তা বিক্রি করে জীবিকা নির্বাহ করে এবং দানও করে, তা তার পক্ষে লোকের কাছে যাচনা করার চেয়ে উত্তম।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 113820,
        "last_updated": null
    },
    {
        "banglaURN": 6014830,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1927,
        "babName": null,
        "hadithNumber": 1483,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ বৃষ্টি ও প্রবাহিত পানি দ্বারা সিক্ত ভূমিতে উৎপাদিত ফসল বা সেচ ব্যতীত উর্বরতার ফলে উৎপন্ন ফসলের উপর (দশমাংশ) ‘উশর ওয়াজিব হয়। আর সেচ দ্বারা উৎপাদিত ফসলের উপর অর্ধ (বিশ ভাগের এক ভাগ) ‘উশর। (আ.প্র. ১৩৮৭)\nইমাম বুখারী (রহঃ) বলেন, এই হাদীসটি প্রথম হাদীসের ব্যাখ্যাস্বরূপ। কেননা, প্রথম হাদীস অর্থাৎ ইব্‌নু ‘উমর (রাঃ) হতে বর্ণিত হাদীসে ‘ঊশর বা অর্ধ ‘উশর-এর ক্ষেত্র নির্দিষ্টরূপে বর্ণিত হয়নি। আর এই হাদীসে তার নির্দিষ্ট ক্ষেত্র বর্ণিত হয়েছে। রাবী নির্ভরযোগ্য হলে তাঁর বর্ণনায় অন্য সূত্রের বর্ণনা অপেক্ষা বর্ধিত অংশ থাকলে গ্রহণযোগ্য হয় এবং এ ধরনের বিস্তারিত বর্ণনা অস্পষ্ট বর্ণনার ফয়সালাকারী হয়। যেমন, উল্লেখ করা যেতে পারে যে, ফাযল ইব্‌নু ‘আব্বাস (রাঃ) হতে বর্ণিত আছে যে, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) কা’বা গৃহে সালাত আদায় করেননি। বিলাল (রাঃ) বলেন, সালাত আদায় করেছেন। এক্ষেত্রে বিলাল (রাঃ)-এর বর্ণনা গৃহীত হয়েছে আর ফাযল (রাঃ)-এর বর্ণনা গৃহীত হয়নি।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 113850,
        "last_updated": null
    },
    {
        "banglaURN": 6014840,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1928,
        "babName": null,
        "hadithNumber": 1484,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ খুদরী (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ পাঁচ ওয়াসাক-এর কম উৎপন্ন দ্রব্যের যাকাত নেই এবং পাঁচটির কম উটের যাকাত নেই। এমনিভাবে পাঁচ উকিয়ার কম পরিমাণ রৌপ্যেরও যাকাত নেই।\n\nআবূ ‘আবদুল্লাহ্‌ (রহঃ) বলেন, এটি প্রথমটির ব্যাখ্যায়, যখন বলা হয় পাঁচ ওয়াসাক-এর কম উৎপাদিত পণ্যের যাকাত নেই। জ্ঞানের ক্ষেত্রে জ্ঞানের অধিকারীগণ যা কিছু বৃদ্ধি করেছেন অথবা বর্ণনা করেছেন তা সর্বদা গ্রহণযোগ্য বলে বিবেচিত।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 113860,
        "last_updated": null
    },
    {
        "banglaURN": 6014850,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1929,
        "babName": null,
        "hadithNumber": 1485,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, খেজুর কাটার মৌসুমে রসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছে (সদকার) খেজুর আনা হতো। অমুকে তার খেজুর নিয়ে আসতো, অমুক এর খেজুর নিয়ে আসতো। এভাবে আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছে খেজুর স্তূপ হয়ে গেলো। হাসান ও হুসাইন (রাঃ) সে খেজুর নিয়ে খেলতে লাগলেন, তাদের একজন একটি খেজুর নিয়ে তা মুখে দিলেন। আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তার দিকে তাকালেন, এবং তার মুখ হতে খেজুর বের করে বললেন, তুমি কি জান না যে, মুহাম্মাদের বংশধর (বনূ হাশিম) সদকা ভক্ষণ করে না।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 113870,
        "last_updated": null
    },
    {
        "banglaURN": 6014860,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1930,
        "babName": null,
        "hadithNumber": 1486,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) খেজুর ব্যবহারযোগ্য না হওয়া পর্যন্ত বিক্রয় করতে নিষেধ করেছেন। যখন তাঁকে ব্যবহারযোগ্যতা সম্বন্ধে জিজ্ঞেস করা হলো, তখন তিনি বললেনঃ ফল নষ্ট হওয়া হতে নিরাপদ হওয়া।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 113880,
        "last_updated": null
    },
    {
        "banglaURN": 6014870,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1930,
        "babName": null,
        "hadithNumber": 1487,
        "hadithSanad": "",
        "hadithText": "জাবির ইব্‌নু ‘আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ফল ব্যবহারযোগ্য না হওয়া পর্যন্ত তা বিক্রি করতে নিষেধ করেছেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 113890,
        "last_updated": null
    },
    {
        "banglaURN": 6014880,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1930,
        "babName": null,
        "hadithNumber": 1488,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্‌নু মালিক (রাঃ) থেকে বর্ণিতঃ আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) রং ধরার আগে ফল বিক্রি করতে নিষেধ করেছেন। বর্ণনাকারী বলেন, - এর অর্থ লালচে হওয়া।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 113900,
        "last_updated": null
    },
    {
        "banglaURN": 6014890,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1931,
        "babName": null,
        "hadithNumber": 1489,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি বর্ণনা করতেন যে, ‘উমর ইব্‌নু খাত্তাব (রাঃ) আল্লাহ্‌র রাস্তায় তাঁর ঘোড়া সদকা করেছিলেন। পরে তা বিক্রয় করা হচ্ছে জেনে তিনি নিজেই তা ব্যয় করার ইচ্ছায় নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছে এসে তাঁর মত জানতে চাইলেন। তিনি বললেনঃ তোমার সদকা ফিরিয়ে নিবে না। সে নির্দেশের কারণে ইব্‌নু ‘উমর (রাঃ)-এর অভ্যাস ছিল নিজের দেয়া সদকার বস্তু কিনে ফেললে সেটি সদকা না করে ছাড়তেন না।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 113910,
        "last_updated": null
    },
    {
        "banglaURN": 6014900,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1931,
        "babName": null,
        "hadithNumber": 1490,
        "hadithSanad": "",
        "hadithText": "‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমার একটি ঘোড়া আল্লাহ্‌র পথে দান করলাম। যার কাছে ঘোড়াটি ছিল সে এর হক আদায় করতে পারল না। তখন আমি তা ক্রয় করতে চাইলাম এবং আমার ধারণা ছিল যে, সে সেটি কম মূল্যে বিক্রি করবে। এ সম্পর্কে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে আমি জিজ্ঞেস করলাম। তিনি বললেনঃ তুমি ক্রয় করবে না এবং তোমার সদকা ফিরিয়ে নিবে না, সে তা এক দিরহামের বিনিময়ে দিলেও। কেননা, যে ব্যক্তি নিজের সদকা ফিরিয়ে নেয় সে যেন নিজের বমি পুনঃ ভক্ষণ করে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 113920,
        "last_updated": null
    },
    {
        "banglaURN": 6014910,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1932,
        "babName": null,
        "hadithNumber": 1491,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, হাসান ইব্‌নু ‘আলী (রাঃ) সদকার একটি খেজুর নিয়ে মুখে দিলেন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তা ফেলে দেয়ার জন্য ওয়াক ওয়াক (বমির পূর্বের আওয়াজের মত) বললেন। অতঃপর বললেনঃ তুমি কি জান না যে, আমরা সদকা ভক্ষণ করি না!</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 113930,
        "last_updated": null
    },
    {
        "banglaURN": 6014920,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1933,
        "babName": null,
        "hadithNumber": 1492,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, মায়মূনা (রাঃ) কর্তৃক আযাদকৃত জনৈক দাসীকে সদকা স্বরূপ প্রদত্ত একটি বকরীকে মৃত অবস্থায় দেখতে পেয়ে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ তোমরা এর চামড়া দিয়ে উপকৃত হও না কেন? তারা বললেনঃ এটা তো মৃত। তিনি বললেন, এটা কেবল খাওয়া হারাম করা হয়েছে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 113940,
        "last_updated": null
    },
    {
        "banglaURN": 6014930,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1933,
        "babName": null,
        "hadithNumber": 1493,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বারীরাহ নাম্নী দাসীকে আযাদ করার উদ্দেশে কিনতে চাইলেন, তার মালিকরা বারীরাহ’র ‘ওয়ালা’ (অভিভাবকত্বের অধিকার)-এর শর্তারোপ করতে চাইলো। ‘আয়িশা (রাঃ) (বিষয়টি সম্পর্কে) নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছে উল্লেখ করলেন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁকে বললেনঃ তুমি তাকে ক্রয় কর। কারণ যে (তাকে) আযাদ করবে “ওয়ালা’ তারই। ‘আয়িশা (রাঃ) বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছে একটু গোশত হাযির করা হলো। আমি বললামঃ এটা বারীরাকে সদকা স্বরূপ দেয়া হয়েছে। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, এটা বারীরাহ’র জন্য সদকা, আর আমাদের জন্য উপহার।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 113950,
        "last_updated": null
    },
    {
        "banglaURN": 6014940,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1934,
        "babName": null,
        "hadithNumber": 1494,
        "hadithSanad": "",
        "hadithText": "উম্মু ‘আতিয়্যা আনসারীয়া (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ‘আয়িশা (রাঃ)-এর নিকট গিয়ে বললেনঃ তোমাদের কাছে (খাওয়ার) কিছু আছে কি? ‘আয়িশা (রাঃ) বললেনঃ না, তবে আপনি সদকা স্বরুপ নুসাইবাকে বকরীর যে গোশত পাঠিয়েছিলেন, সে তা কিছু পাঠিয়ে দিয়েছিল (তাছাড়া কিছু নেই)। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ সদকা তার যথাস্থানে পৌঁছেছে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 113960,
        "last_updated": null
    },
    {
        "banglaURN": 6014950,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1934,
        "babName": null,
        "hadithNumber": 1495,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ বারীরাহ (রাঃ)-কে সদকাকৃত গোশতের কিছু আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে দেয়া হল। তিনি বললেন, তা বারীরাহ’র জন্য সদকা এবং আমাদের জন্য হাদিয়া।\nআবূ দাঊদ (রহঃ) বললেন যে, শু’বাহ (রহঃ) কাতাদা (রহঃ) সূত্রে আনাস (রাঃ)-এর মাধ্যমে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে হাদীসটি বর্ণনা করেছেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 113971,
        "last_updated": null
    },
    {
        "banglaURN": 6014960,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1935,
        "babName": null,
        "hadithNumber": 1496,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, মু’আয ইব্‌নু জাবাল (রাঃ)-কে ইয়ামানের (শাসক নিয়োগ করে) পাঠানোর সময় আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁকে বলছিলেনঃ তুমি আহলে কিতাবের কাছে যাচ্ছ। কাজেই তাদের কাছে যখন পৌঁছবে তখন তাদেরকে এ কথার দিকে দাওয়াত দিবে তারা যেন সাক্ষ্য দিয়ে বলে যে, আল্লাহ্‌ ব্যতীত প্রকৃত কোন ইলাহ নেই এবং মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আল্লাহ্‌র রাসূল। যদি তারা তোমার এ কথা মেনে নেয় তবে তাদের বলবে যে, আল্লাহ্‌ তাদের উপর দিনে রাতে পাঁচ ওয়াক্ত সালাত ফরয করেছেন। যদি তারা এ কথাও মেনে নেয় তবে তাদের বলবে যে, আল্লাহ্‌ তাদের উপর সদকা (যাকাত) ফরয করেছেন- যা তাদের ধনীদের নিকট হতে গ্রহণ করা হবে এবং অভাবগ্রস্তদের মধ্যে বিতরণ করে দেয়া হবে। তোমার এ কথা যদি তারা মেনে নেয়, তবে (কেবল) তাদের উত্তম মাল গ্রহণ হতে বিরত থাকবে এবং মযলুমের বদদু’আকে ভয় করবে। কেননা, তার (বদদু’আ) এবং আল্লাহ্‌র মাঝে কোন পর্দা থাকে না।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 113990,
        "last_updated": null
    },
    {
        "banglaURN": 6014970,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1936,
        "babName": null,
        "hadithNumber": 1497,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ ইব্‌নু আবূ আওফা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, লোকজন যখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট নিজেদের সদকা নিয়ে উপস্থিত হতো তখন তিনি বললেনঃ আল্লাহ্‌! অমুকের প্রতি রহমত বর্ষণ করুন। একদা আমার পিতা সদকা নিয়ে হাযির হলে তিনি বললেনঃ হে আল্লাহ্‌! আবূ আওফা’র বংশধরের প্রতি রহমত বর্ষণ করুন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 114000,
        "last_updated": null
    },
    {
        "banglaURN": 6014980,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1937,
        "babName": null,
        "hadithNumber": 1498,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ বনী ইসরাঈলের এক ব্যক্তি অপর ব্যক্তির নিকট এক হাজার দীনার (ঋণ) চাইলে, সে তাকে তা দিল। সে সাগরপথে যাত্রা করল কিন্তু কোন নৌযান পেল না। তখন একটি কাঠের টুকরা নিয়ে তা ছিদ্র করে এক হাজার দীনার তাতে ভরে তা সাগরে নিক্ষেপ করল। ঋণদাতা সাগর তীরে পৌঁছে একটি কাঠ (ভেসে আসতে) দেখে তার পরিবারের জন্য লাকড়ি হিসেবে নিয়ে  আসল। অতঃপর (রাবী) পুরা ঘটনাটি বর্ণনা করেছেন। (সবশেষে রয়েছে) কাঠ চেরাই করার পর সে তার প্রাপ্য মাল পেয়ে গেল।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 114010,
        "last_updated": null
    },
    {
        "banglaURN": 6014990,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1938,
        "babName": null,
        "hadithNumber": 1499,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ চতুষ্পদ জন্তুর আঘাত [৪৬] দায়মুক্ত, কূপ (খননে শ্রমিকের মৃত্যুতে মালিক) দায়মুক্ত, খনি (খননে কেউ মারা গেলে মালিক) দায়মুক্ত। রিকাযে এক-পঞ্চমাংশ ওয়াজিব।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 114020,
        "last_updated": null
    },
    {
        "banglaURN": 6015000,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1939,
        "babName": null,
        "hadithNumber": 1500,
        "hadithSanad": "",
        "hadithText": "আবূ হুমাইদ সা’য়িদী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আস্‌দ গোত্রের ইব্‌নু লুতবিয়া নামক জনৈক ব্যক্তিকে আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বনূ সুলাইম গোত্রের যাকাত আদায় করার কাজে নিয়োগ করেন। তিনি ফিরে আসলে তার নিকট হতে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হিসাব নিলেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 114030,
        "last_updated": null
    },
    {
        "banglaURN": 6015010,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1940,
        "babName": null,
        "hadithNumber": 1501,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, উরাইনা গোত্রের কতিপয় লোকের মদীনার আবহাওয়া প্রতিকূল হওয়ায় আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাদেরকে যাকাতের উটের কাছে গিয়ে উটের দুধ ও পেশাব পান করার অনুমতি প্রদান করেন। তারা রাখালকে (নির্মমভাবে) হত্যা করে এবং উট হাঁকিয়ে নিয়ে (পালিয়ে) যায়। আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাদের পশ্চাদ্ধাবনে লোক প্রেরণ করেন, তাদেরকে ধরে নিয়ে আসা হয়। এরপর তাদের হাত পা কেটে দেন এবং তাদের চোখে তপ্ত শলাকা বিদ্ধ করেন আর তাদেরকে হাররা নামক উত্তপ্ত স্থানে ফেলে রাখেন। তারা (যন্ত্রণায়) পাথর কামড়ে ধরে ছিল। আবূ কিলাবাহ, সাবিত ও হুমাইদ (রহঃ) আনাস (রাঃ) হতে হাদীস বর্ণনায় কাতাদা (রহঃ)-এর অনুসরণ করেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 114040,
        "last_updated": null
    },
    {
        "banglaURN": 6015020,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1941,
        "babName": null,
        "hadithNumber": 1502,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্‌নু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, ‘আবদুল্লাহ্‌ ইব্‌নু আবূ তালহাকে সাথে নিয়ে আমি একদিন সকালে আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট তাঁকে তাহ্‌নীক[১] করানোর উদ্দেশে গেলাম। তখন আমি তাঁকে নিজ হাতে একটি কাঠি দিয়ে যাকাতের উটের গায়ে চিহ্ন লাগাতে দেখলাম।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 114050,
        "last_updated": null
    },
    {
        "banglaURN": 6015030,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1942,
        "babName": null,
        "hadithNumber": 1503,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, প্রত্যক গোলাম, আযাদ, পুরুষ, নারী, প্রাপ্ত বয়স্ক, অপ্রাপ্ত বয়স্ক মুসলিমের উপর আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সদকাতুল ফিতর হিসেবে খেজুর হোক অথবা যব হোক এক সা’ পরিমাণ আদায় করা ফরয করেছেন এবং লোকজনের ঈদের সালাতের বের হবার পূর্বেই তা আদায় করার নির্দেশ দিয়েছেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 114060,
        "last_updated": null
    },
    {
        "banglaURN": 6015040,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1943,
        "babName": null,
        "hadithNumber": 1504,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ মুসলিমদের প্রত্যেক আযাদ, গোলাম পুরুষ ও নারীর পক্ষ হতে সদকাতুল  ফিতর হিসেবে খেজুর অথবা যব-এর এক সা’ পরিমাণ [৪৭] আদায় করা আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ফরয করেছেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 114070,
        "last_updated": null
    },
    {
        "banglaURN": 6015050,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1944,
        "babName": null,
        "hadithNumber": 1505,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ খুদরী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা এক সা’ পরিমাণ যব দ্বারা সদকাতুল ফিতর আদায় করতাম।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 114080,
        "last_updated": null
    },
    {
        "banglaURN": 6015060,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1945,
        "babName": null,
        "hadithNumber": 1506,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ খুদরী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা এক সা’ পরিমাণ খাদ্য অথবা এক সা’ পরিমাণ যব অথবা এক সা’ পরিমাণ খেজুর অথবা এক সা’ পরিমাণ পনির অথবা এক সা’ পরিমাণ কিসমিস দিয়ে সদকাতুল ফিতর আদায় করতাম।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 114090,
        "last_updated": null
    },
    {
        "banglaURN": 6015070,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1946,
        "babName": null,
        "hadithNumber": 1507,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সদকাতুল ফিতর হিসেবে এক সা’ পরিমাণ খেজুর বা এক সা’ পরিমাণ যব দিয়ে আদায় করতে নির্দেশ দেন। ‘আবদুল্লাহ্‌ (রাঃ) বলেন, অতঃপর লোকেরা যবের সমপরিমাণ হিসেবে দু’ মুদ (অর্ধ সা’) গম আদায় করতে থাকে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 114100,
        "last_updated": null
    },
    {
        "banglaURN": 6015080,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1947,
        "babName": null,
        "hadithNumber": 1508,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ খুদ্‌রী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর যুগে এক সা’ খাদ্যদ্রব্য বা এক সা’ খেজুর বা এক সা’ যব বা এক সা’ কিসমিস দিয়ে সদকাতুল ফিতর আদায় করতাম। মু’আবিয়া (রাঃ)-এর যুগে যখন গম আমদানী হল তখন তিনি বললেন, এক মুদ গম (পূর্বোক্তগুলোর) দু’ মুদ-এর সমপরিমাণ বলে আমার মনে হয়।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 114110,
        "last_updated": null
    },
    {
        "banglaURN": 6015090,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1948,
        "babName": null,
        "hadithNumber": 1509,
        "hadithSanad": "",
        "hadithText": "(আবদুল্লাহ্‌) ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) লোকদেরকে ঈদের সালাতের উদ্দেশ্যে বের হওয়ার পূর্বেই [৪৮] সদকাতুল ফিতর আদায় করার নির্দেশ দেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 114120,
        "last_updated": null
    },
    {
        "banglaURN": 6015100,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1948,
        "babName": null,
        "hadithNumber": 1510,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ খুদ্‌রী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর যুগে ঈদের দিন এক সা’ পরিমাণ খাদ্য সাদাকাতুল ফিতর হিসেবে আদায় করতাম। আবূ সা’ঈদ (রাঃ) বলেন, আমাদের খাদ্যদ্রব্য ছিল যব, কিসমিস, পনির ও খেজুর।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 114130,
        "last_updated": null
    },
    {
        "banglaURN": 6015110,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1949,
        "babName": null,
        "hadithNumber": 1511,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) প্রত্যেক পুরুষ, মহিলা, আযাদ ও গোলামের পক্ষ হতে সদকাতুল ফিতর অথবা (বলেছেন) সদকা-ই রমযান হিসেবে এক সা’ খেজুর বা এক এক সা’ যব আদায় করা ফরজ করেছেন। অতঃপর লোকেরা অর্ধ সা’ গমকে এক সা’ খেজুরের সমমান দিতে লাগল। (রাবী নাফি’ বলেন) ইব্‌নু ‘উমর (রাঃ) খেজুর (সদকাতুল ফিতর হিসেবে) দিতেন। এক সময় মদীনায় খেজুর দুর্লভ হলে যব দিয়ে তা আদায় করেন। ইব্‌নু ‘উমর (রাঃ) প্রাপ্ত বয়স্ক ও অপ্রাপ্ত বয়স্ক সকলের পক্ষ হতেই সদকাতুল ফিতর আদায় করতেন, এমনকি আমার সন্তানদের পক্ষ হতেও সদকার দ্রব্য গ্রহীতাদেরকে দিয়ে দিতেন এবং ঈদের এক-দু’ দিন পূর্বেই আদায় করে দিতেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 114140,
        "last_updated": null
    },
    {
        "banglaURN": 6015120,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": null,
        "babNumber": 1950,
        "babName": null,
        "hadithNumber": 1512,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) অপ্রাপ্ত বয়স্ক, প্রাপ্ত বয়স্ক, আযাদ ও গোলাম প্রত্যেকের পক্ষ হতে এক সা’ যব অথবা এক সা’ খেজুর সদকাতুল ফিতর হিসেবে আদায় করা ফরজ করে দিয়েছেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 114150,
        "last_updated": null
    },
    {
        "banglaURN": 6013991,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": "",
        "babNumber": 1557,
        "babName": "",
        "hadithNumber": 1399,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর মৃত্যুর পর আবূ বকর (রাঃ)-এর খিলাফতের সময় আরবের কিছু লোক মুরতাদ হয়ে যায়। তখন ‘উমর (রাঃ) [আবূ বকর (রাঃ)-কে লক্ষ্য করে] বললেন, আপনি (সে সব) লোকদের বিরুদ্ধে কিভাবে যুদ্ধ করবেন (যারা সম্পূর্ণ ধর্ম পরিত্যাগ করেনি, বরং যাকাত দিতে অস্বীকার করেছে মাত্র)? অথচ আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ইরশাদ করেছেনঃ ‘লা ইলাহা ইল্লাল্লাহু’ বলার পূর্ব পর্যন্ত মানুষের বিরুদ্ধে যুদ্ধ করার নির্দেশ আমাকে দেয়া হয়েছে, যে কেউ তা বললো, সে তার সম্পদ ও জীবন আমার পক্ষ থেকে নিরাপদ করে নিলো। তবে ইসলামের বিধান লঙ্ঘন করলে (শাস্তি দেয়া যাবে), আর তার অন্তরের গভীর (হৃদয়াভ্যন্তরে কুফরী বা পাপ লুকানো থাকলে এর) হিসাব-নিকাশ আল্লাহর যিম্মায়।\n\nআবূ বক্‌র (রাঃ) থেকে বর্ণিতঃ আল্লাহর শপথ! তাদের বিরুদ্ধে নিশ্চয়ই আমি যুদ্ধ করবো যারা সালাত ও যাকাতের মধ্যে পার্থক্য করবে, কেননা যাকাত হল সম্পদের উপর আরোপিত হক্ব। আল্লাহর কসম। যদি তারা একটি মেষ শাবক যাকাত দিতেও অস্বীকৃতি জানায় যা আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছে তারা দিত, তাহলে যাকাত না দেয়ার কারণে তাদের বিরুদ্ধে আমি অবশ্যই যুদ্ধ করবো। ‘উমর (রাঃ) বলেনঃ আল্লাহর কসম, আল্লাহ আবূ বকর (রাঃ)-এর হৃদয় বিশেষ জ্ঞানালোকে উদ্ভাসিত করেছেন বিধায় তাঁর এ দৃঢ়তা, এতে আমি বুঝতে পারলাম তাঁর সিদ্ধান্তই যথার্থ।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 112971,
        "last_updated": null
    },
    {
        "banglaURN": 6014071,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": "",
        "babNumber": 1560,
        "babName": "",
        "hadithNumber": 1407,
        "hadithSanad": "",
        "hadithText": "আহনাফ ইব্‌নু কায়স (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, একদা আমি কুরাইশ গোত্রীয় একদল লোকের সাথে বসেছিলাম, এমন সময় রুক্ষ্ম চুল, মোটা কাপড় ও খসখসে শরীর বিশিষ্ট এক ব্যক্তি তাদের নিকট এসে সালাম দিয়ে বললো, যারা সম্পদ জমা করে রাখে তাদেরকে এমন গরম পাথরের সংবাদ দাও, যা তাদেরকে শাস্তি প্রদানের জন্য জাহান্নামের আগুনে উত্তপ্ত করা হবে। তা তাদের স্তনের বোঁটার উপর স্থাপন করা হবে আর তা কাঁধের পেশী ভেদ করে বের হবে এবং কাঁধের চিকন হাড্ডির ওপর স্থাপন করা হবে, তা নড়াপড়া করে সজোরে স্তনের বোঁটা ছেদ করে বের হবে। এরপর লোকটি ফিরে গিয়ে একটি স্তম্ভের পাশে বসল। আমিও তাঁর অনুগমন করলাম ও তাঁর কাছে বসলাম। অথচ আমি জানতাম না সে কে। আমি তাকে বললাম, আমার মনে হয় যে, আপনার বক্তব্য লোকেরা পছন্দ করেনি। তিনি বললেন, তারা কিছুই বুঝে না।\n\nবর্ণনাকারী থেকে বর্ণিতঃ কথাটি আমাকে আমার বন্ধু বলেছেন। রাবী বলেন, আমি বললাম, আপনার বন্ধু কে? সে বলল, তিনি হলেন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)। তিনি আমাকে বলেন, হে আবূ যার! তুমি কি উহুদ পাহাড় দেখেছ? তিনি বলেন, তখন আমি সূর্যের দিকে তাকিয়ে দেখলাম দিনের কতটুকু অংশ বাকি রয়েছে। আমার ধারণা আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁর কোন প্রয়োজনে আমাকে পাঠাবেন। আমি জবাব বললাম, জী-হাঁ। তিনি বললেনঃ আমি পছন্দ করি না যে, আমার জন্য উহুদ পর্বত পরিমাণ স্বর্ণ হোক আর তা সমুদয় আমি নিজের জন্য ব্যয় করি তিনটি দীনার ব্যতীত। [আবূ যার (রাঃ) বলেন] তারা তো বুঝে না, তারা শুধু দুনিয়ার সম্পদই একত্রিত করছে। আল্লাহর কসম, না! না! আমি তাদের নিকট দুনিয়ার কোন সম্পদ চাই না এবং আল্লাহর সাথে সাক্ষাৎ করা পর্যন্ত দ্বীন সম্পর্কেও তাদের নিকট কিছু জিজ্ঞেস করবো না।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 113051,
        "last_updated": null
    },
    {
        "banglaURN": 6014271,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": "",
        "babNumber": 1890,
        "babName": "",
        "hadithNumber": 1427,
        "hadithSanad": "",
        "hadithText": "হাকীম ইব্‌নু হিযাম (রাঃ)-এর সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেন, উপরের হাত (দাতার হাত) নীচের হাত (গ্রহীতার হাত) অপেক্ষা উত্তম। প্রথমে তাদেরকে দিবে যাদের ভরণ-পোষণের দায়িত্ব তুমি বহন কর। প্রয়োজনের অতিরিক্ত সম্পদ হতে সদকা করা উত্তম। যে ব্যক্তি (পাপ ও ভিক্ষা করা হতে) পবিত্র থাকতে চায়, আল্লাহ তাকে পবিত্র রাখেন এবং যে পরমুখাপেক্ষিতা হতে বেঁচে থাকতে চায়, আল্লাহ তাকে স্বাবলম্বী করে দেন।\n\nওহায়ব (রহঃ) থেকে বর্ণিতঃ আবূ হুরায়রা (রাঃ) সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে অনুরূপ বর্ণিত আছে।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 113261,
        "last_updated": null
    },
    {
        "banglaURN": 6014561,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": "",
        "babNumber": 1912,
        "babName": "",
        "hadithNumber": 1456,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আবূ বকর (রাঃ) বলেছেন, আল্লাহর কসম! তারা যদি (যাকাতের) ঐরূপ একটি ছাগল ছানাও দিতে অস্বীকার করে যা আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছে দিতো, তবুও তাদের বিরুদ্ধে যাকাত না দেয়ার কারণে লড়াই করবো।\n\n‘উমর (রাঃ) থেকে বর্ণিতঃ আমার নিকট স্পষ্ট যে, যুদ্ধের ব্যাপারে আল্লাহ আবূ বাকারের ক্বলব খুলে দিয়েছেন, তাই বুঝলাম তাঁর সিদ্ধান্তই সঠিক।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 113571,
        "last_updated": null
    },
    {
        "banglaURN": 6014741,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": "",
        "babNumber": 1924,
        "babName": "",
        "hadithNumber": 1474,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ যে ব্যক্তি সব সময় মানুষের কাছে চেয়ে থাকে, সে কিয়ামাতের দিন এমনভাবে উপস্থিত হবে যে, তার চেহারায় কোন গোশত থাকবে না।\n\n‘আবদুল্লাহ্‌ ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি আরো বলেনঃ কিয়ামাতের দিন সূর্য তাদের অতি কাছে আসবে, এমনকি ঘাম কানের অর্ধেক পর্যন্ত পৌছবে। যখন তারা এই অবস্থায় থাকবে, তখন তারা সাহায্য চাইবে আদম (আঃ)-এর কাছে, অতঃপর মূসা (আঃ)-এর কাছে, তারপর মুহাম্মদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছে। ‘আবদুল্লাহ্‌ (রহঃ) লায়স (রহঃ)-এর মাধ্যমে ইব্‌নু আবূ জা’ফর (রহঃ) হতে অতিরিক্ত বর্ণনা করেছেন, অতঃপর আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সৃষ্টির মধ্যে ফয়সালা করার জন্য সুপারিশ করবেন। তিনি যেতে যেতে জান্নাতের ফটকের কড়া ধরবেন। সেদিন আল্লাহ তাঁকে মাকামে মাহমূদে পৌছে দিবেন। হাশরের ময়দানে সমবেত সকলেই তাঁর প্রশংসা করবে।\nরাবী মু’আল্লা (রহঃ) ….. ইব্‌নু ‘উমর (রাঃ) আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে ভিক্ষাবৃত্তি সম্পর্কে হাদীস বর্ণনা করেছেন।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 113752,
        "last_updated": null
    },
    {
        "banglaURN": 6014811,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 24,
        "bookName": "",
        "babNumber": 1926,
        "babName": "",
        "hadithNumber": 1481,
        "hadithSanad": "",
        "hadithText": "আবূ হুমাইদ সা’ঈদী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সাথে তাবূকের যুদ্ধে শরীক হয়েছি। যখন তিনি ওয়াদিউল কুরা নামক স্থানে পৌঁছলেন, তখন এক মহিলা তার নিজের বাগানে উপস্থিত ছিল। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সাহাবীদের লক্ষ্য করে বললেনঃ তোমরা এই বাগানের ফলগুলোর পরিমাণ আন্দাজ কর। আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) নিজে দশ ওয়াসাক পরিমাণ আন্দাজ করলেন। অতঃপর মহিলাকে বললেনঃ উৎপন্ন ফলের হিসাব রেখো। আমরা তাবূক পৌঁছলে, তিনি বললেনঃ সাবধান! আজ রাতে প্রবল ঝড় প্রবাহিত হবে। কাজেই কেউ যেন দাঁড়িয়ে না থাকে এবং প্রত্যেকেই যেন তার উট বেঁধে রাখে। তখন আমরা নিজ নিজ উট বেঁধে নিলাম। প্রবল ঝড় হতে লাগল। এক ব্যক্তি দাঁড়িয়ে গেলে ঝড় তাকে তায় নামক পর্বতে নিক্ষেপ করল। আয়লা নগরীর শাসনকর্তা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর জন্য একটি সাদা খচ্চর ও চাদর হাদিয়া দিলেন। আর নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাকে সেখানকার শাসনকর্তারূপে বহাল থাকার লিখিত নির্দেশ দিলেন। (ফেরার পথে) ওয়াদিল কুরা পৌঁছে সেই মহিলাকে জিজ্ঞেস করলেনঃ তোমার বাগানে কী পরিমাণ ফল হয়েছে? মহিলা বলল, আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর অনুমিত পরিমাণ, দশ ওয়াসাকই হয়েছে। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ আমি দ্রুত মদীনায় পৌঁছতে ইচ্ছুক। তোমাদের কেউ আমার সাথে দ্রুত যেতে চাইলে দ্রুত কর। ইব্‌নু বাক্কার (রহঃ) এমন একটি বাক্য বললেন, যার অর্থ, যখন তিনি মদীনা দেখতে পেলেন তখন বললেনঃ এটা ত্বাবা (মদীনার অপর নাম)। এরপর যখন তিনি উহুদ পর্বত দেখতে পেলেন তখন বললেনঃ এই পর্বত আমাদেরকে ভালবাসে এবং আমরাও তাকে ভালবাসি। আনসারদের সর্বোত্তম গোত্রটি সম্পর্কে আমি তোমাদের খবর দিব কি? তারা বললেন, হাঁ। তিনি বললেনঃ বনূ নাজ্জার গোত্র, অতঃপর বনূ ‘আবদুল আশহাল গোত্র, এরপর বনূ সা’য়ীদা গোত্র অথবা বনূ হারিস ইব্‌নু খাযরাজ গোত্র। আনসারদের সকল গোত্রেই কল্যাণ রয়েছে।\n\nসাহ্‌ল ইব্‌নু বাক্কার (রহঃ) সুলায়মান ইব্‌নু বিলাল সূত্রে ‘আমর (রহঃ) থেকে বর্ণিতঃ এরপর বনূ হারিস ইব্‌নু খাযরাজ গোত্র, এরপর বনূ সা’য়িদা গোত্র এবং সুলায়মান (রহঃ) .... নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে বর্ণিত। তিনি বলেন, উহুদ পর্বত আমাদেরকে ভালবাসে, আমরাও তাকে ভালবাসি।\n\n\tআবূ ‘আবদুল্লাহ্‌ (রহঃ) বলেন, যে বাগান দেয়াল দ্বারা বেষ্টিত তাকে বলা হয় -- এবং যা দেয়াল দ্বারা বেষ্টিত নয় তাকে -- বলা হয় না।</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 113831,
        "last_updated": null
    }
]