[
    {
        "banglaURN": 6020080,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 31,
        "bookName": null,
        "babNumber": 844,
        "babName": null,
        "hadithNumber": 2008,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) - কে রমযান সম্পর্কে বলতে শুনেছি, যে ব্যক্তি রমযানে ঈমানের সাথে সওয়াব লাভের আশায় কিয়ামে রমযান অর্থাৎ তারাবীর সালাত আদায় করবে তার পূর্ববর্তী গোনাহসমূহ মাফ করে দেয়া হবে।</b>",
        "bookID": "31.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 119230,
        "last_updated": null
    },
    {
        "banglaURN": 6020090,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 31,
        "bookName": null,
        "babNumber": 844,
        "babName": null,
        "hadithNumber": 2009,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, যে ব্যক্তি রমযানে ঈমানের সাথে সওয়াব লাভের আশায় তারাবীর সালাতে দাঁড়াবে তার পূর্ববর্তী গোনাহসমূহ মাফ করে দেয়া হবে। হাদীসের রাবী ইব্‌নু শিহাব (রহঃ) বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ইনতিকাল করেন এবং তারাবীর ব্যাপারটি এভাবেই চালু ছিল। এমনকি আবূ বকর (রাঃ)- এর খিলাফতকালে ও ‘উমর (রাঃ)- এর খিলাফতের প্রথমভাগে এরূপই ছিল।</b>",
        "bookID": "31.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 119240,
        "last_updated": null
    },
    {
        "banglaURN": 6020100,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 31,
        "bookName": null,
        "babNumber": 844,
        "babName": null,
        "hadithNumber": 2010,
        "hadithSanad": "",
        "hadithText": "‘আবদুর রাহমান ইবনু ‘আবদ আল-ক্বারী (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি রমযানের এক রাতে ‘উমর ইবনুল খাত্তাব (রাঃ)- এর সাথে মসজিদে নাবাবীতে গিয়ে দেখি যে, লোকেরা এলোমেলোভাবে জামা’আতে বিভক্ত। কেউ একাকী সালাত আদায় করছে আবার কোন ব্যক্তি সালাত আদায় করছে এবং ইকতেদা করে একদল লোক সালাত আদায় করছে। ‘উমর (রাঃ) বললেন, আমি মনে করি যে, এই লোকদের যদি আমি একজন ক্বারীর (ইমামের) পিছনে জমা করে দেই, তবে তা উত্তম হবে। এরপর তিনি ‘উবাই ইব্‌নু ‘কাব (রাঃ)- এর পিছনে সকলকে জমা করে দিলেন। পরে আর এক রাতে আমি তাঁর [‘উমর (রাঃ)] সাথে বের হই। তখন লোকেরা তাদের ইমামের সাথে সালাত আদায় করছিল। ‘উমর (রাঃ) বললেন, কত না সুন্দর এই নতুন ব্যবস্থা! তোমরা রাতের যে অংশে ঘুমিয়ে থাক তা রাতের ঐ অংশ অপেক্ষা উত্তম যে অংশে তোমরা সালাত আদায় কর, এর দ্বারা তিনি শেষ রাত বুঝিয়েছেন, কেননা তখন রাতের প্রথমভাগে লোকেরা সালাত আদায় করত।</b>",
        "bookID": "31.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 119250,
        "last_updated": null
    },
    {
        "banglaURN": 6020110,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 31,
        "bookName": null,
        "babNumber": 844,
        "babName": null,
        "hadithNumber": 2011,
        "hadithSanad": "",
        "hadithText": "নবী-সহধর্মিণী ‘আয়িশা (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সালাত আদায় করেন এবং তা ছিল রমযানে।</b>",
        "bookID": "31.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 119260,
        "last_updated": null
    },
    {
        "banglaURN": 6020120,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 31,
        "bookName": null,
        "babNumber": 844,
        "babName": null,
        "hadithNumber": 2012,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) গভীর রাতে বের হয়ে মসজিদে সালাত আদায় করেন, কিছু সংখ্যক পুরুষ তাঁর পিছনে সালাত আদায় করেন। সকালে লোকেরা এ সম্পর্কে আলোচনা করেন, ফলে লোকেরা অধিক সংখ্যায় সমবেত হন। তিনি সালাত আদায় করেন এবং লোকেরা তাঁর সঙ্গে সালাত আদায় করেন। সকালে তাঁরা এ বিষয়ে আলাপ-আলোচনা করেন। তৃতীয় রাতে মসজিদে মুসল্লীর সংখ্যা আরো বেড়ে যায়। এরপর আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বের হয়ে সালাত আদায় করেন ও লোকেরা তাঁর সঙ্গে সালাত আদায় করেন। চতুর্থ রাতে মসজিদে মুসল্লীর সংকুলান হল না, কিন্তু তিনি রাতে আর বের না হয়ে ফজরের সালাতে বেরিয়ে আসলেন এবং সালাত শেষে লোকদের দিকে ফিরে প্রথমে তাওহীদ ও রিসালতের সাক্ষ্য দেয়ার পর বললেনঃ শোন! তোমাদের (গতরাতের) অবস্থান আমার অজানা ছিল না, কিন্তু আমি এই সালাত তোমাদের উপর ফরয হয়ে যাবার আশংকা করছি (বিধায় বের হই নাই) কেননা তোমরা তা আদায় করায় অপারগ হয়ে পড়তে। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর ওফাত হলো আর ব্যাপারটি এভাবেই থেকে যায়।</b>",
        "bookID": "31.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 119270,
        "last_updated": null
    },
    {
        "banglaURN": 6020130,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 31,
        "bookName": null,
        "babNumber": 844,
        "babName": null,
        "hadithNumber": 2013,
        "hadithSanad": "",
        "hadithText": "আবূ সালামা ইবনু ‘আবদুর রাহমান (রহঃ) থেকে বর্ণিতঃ তিনি ‘আয়িশা (রাঃ)-কে জিজ্ঞেস করেন যে, রমযানে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) –এর সালাত কিরূপ ছিল? তিনি বললেন, রমযান মাসে ও রমযানে ব্যতীত অন্য সময়ে (রাতে) তিনি এগার রাক’আত হতে বৃদ্ধি করতেন না। [২] তিনি চার রাক’আত সালাত আদায় করতেন, তুমি তার সৌন্দর্য ও দীর্ঘতা সম্পর্কে জিজ্ঞেস করো না। অতঃপর তিনি চার রাক’আত পড়েন। তুমি তার সৌন্দর্য ও দীর্ঘতা সম্পর্কে জিজ্ঞেস করো না। এরপর তিন রাক’আত সালাত আদায় করতেন। আমি (‘আয়িশা রাঃ) বললাম, হে আল্লাহর রসূল! আপনি বিতর আদায়ের আগে ঘুমিয়ে যাবেন? তিনি বললেনঃ হে ‘আয়িশা! আমার দু’চোখ ঘুমায় বটে কিন্তু আমার কাল্‌ব নিদ্রাভিভূত হয়না।</b>",
        "bookID": "31.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 119280,
        "last_updated": null
    }
]