[
    {
        "banglaURN": 6022870,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 38,
        "bookName": null,
        "babNumber": 1267,
        "babName": null,
        "hadithNumber": 2287,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, ধনী ব্যক্তির ঋণ পরিশোধে গড়িমসি করা জুলুম। যখন তোমাদের কাউকে (তার জন্যে) কোন ধনী ব্যক্তির হাওয়ালা করা হয়, তখন সে যেন তা মেনে নেয়।</b>",
        "bookID": "38.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 122070,
        "last_updated": null
    },
    {
        "banglaURN": 6022880,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 38,
        "bookName": null,
        "babNumber": 1268,
        "babName": null,
        "hadithNumber": 2288,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, ধনী ব্যক্তির পক্ষ হতে ঋণ পরিশোধে গড়িমসি করা জুলুম। যাকে (তার পাওনার জন্য) ধনীর হাওয়ালা করা হয়, সে যেন তা মেনে নেয়।</b>",
        "bookID": "38.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 122080,
        "last_updated": null
    },
    {
        "banglaURN": 6022890,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 38,
        "bookName": null,
        "babNumber": 1269,
        "babName": null,
        "hadithNumber": 2289,
        "hadithSanad": "",
        "hadithText": "সালামা ইবনু আকওয়া (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, একদিন আমরা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)- এর নিকট বসা ছিলাম। এমন সময় একটি জানাযা উপস্থিত করা হল। সাহাবীগণ বললেন, আপনি তার জানাযার সালাত আদায় করে দিন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, তার কি কোন ঋণ আছে? তারা বলল, না। তিনি বললেন, সে কি কিছু রেখে গেছে? তারা বলল, না। তখন তিনি জানাযার সালাত আদায় করলেন। তারপর আরেকটি জানাযা উপস্থিত করা হল। সাহাবীগণ বললেন, হে আল্লাহর রসূল! আপনি জানাযার সালাত আদায় করে দিন। তিনি বললেন, তার কি কোন ঋণ আছে? বলা হল, হ্যাঁ, আছে। তিনি বললেন, সে কি কিছু রেখে গেছে? তারা বললেন, তিনটি দীনার। তখন তিনি তার জানাযার সালাত আদায় করলেন। তারপর তৃতীয় আরেকটি জানাযা উপস্থিত করা হল। সাহাবীগণ বললেন, আপনি তার জানাযা আদায় করুন। তিনি বলেন, সে কি কিছু রেখে গেছে। তারা বললেন, না। তিনি বললেন, তার কি কোন ঋণ আছে। তারা বললেন, তিন দীনার। তিনি বললেন, তোমাদের এ লোকটির সালাত তোমরাই আদায় করে নাও। আবূ কাতাদা (রাঃ) বললেন, হে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)! তার জানাযার সালাত আদায় করুন, তার ঋণের জন্য আমি দায়ী। তখন তিনি তার জানাযার সালাত আদায় করলেন।</b>",
        "bookID": "38.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 122090,
        "last_updated": null
    }
]