[
    {
        "banglaURN": 6023200,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1035,
        "babName": null,
        "hadithNumber": 2320,
        "hadithSanad": "",
        "hadithText": "আনাস ইবনে মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, যে কোন মুসলমান ফলবান গাছ রোপণ করে কিংবা কোন ফসল ফলায় আর তা হতে পাখী কিংবা মানুষ বা চতুষ্পদ জন্তু খায় তবে তা তার পক্ষ হতে সদাকা বলে গণ্য হবে। \nমুসলিম (রহঃ) ...... আনাস (রাঃ) সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে হাদীসটি বর্ণিত হয়েছে।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 122371,
        "last_updated": null
    },
    {
        "banglaURN": 6023210,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1036,
        "babName": null,
        "hadithNumber": 2321,
        "hadithSanad": "",
        "hadithText": "আবূ উমামাহ্‌ বাহিলী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, লাঙ্গলের ফাল এবং কিছু কৃষি সরঞ্জাম দেখে বললেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)- কে বলতে শুনেছি এটা যে সম্প্রদায়ের ঘরে প্রবেশ করে, আল্লাহ সেখানে অপমান প্রবেশ করান। রাবী মুহাম্মাদ [ইবনু যিয়াদ (রহঃ)] বলেন, আবূ উমামাহ্‌ (রাঃ)-এর নাম হল সুদাই ইবনু আজলান।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 122390,
        "last_updated": null
    },
    {
        "banglaURN": 6023220,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1037,
        "babName": null,
        "hadithNumber": 2322,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন,  যে ব্যক্তি শস্য ক্ষেতের পাহারা কিংবা পশুর হিফাযতের উদ্দেশ্য ছাড়া অন্য কোন উদ্দেশ্যে কুকুর পোষে, প্রতিদিন তার নেক আমল হতে এক কীরাত পরিমাণ কমতে থাকবে। ইবনু সীরীন ও আবূ সালিহ্‌ (রহঃ) আবূ হুরায়রা (রাঃ) সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে বর্ণনা করেনঃ  বকরী অথবা ক্ষেতের হিফাযত কিংবা শিকারের উদ্দেশ্য ছাড়া। \nআবূ হাযিম (রহঃ) আবূ হুরায়রা (রাঃ) সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে বর্ণনা করেন, শিকার ও পশুর হিফাযত করার কুকুর।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 122400,
        "last_updated": null
    },
    {
        "banglaURN": 6023230,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1037,
        "babName": null,
        "hadithNumber": 2323,
        "hadithSanad": "",
        "hadithText": "সুফিয়ান ইবনু আবূ যুহাইর (রাঃ) থেকে বর্ণিতঃ যিনি আয্‌দ-শানূ’আ গোত্রের লোক, তিনি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর একজন সাহাবী ছিলেন। তিনি বলেন, আমি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)- কে বলতে শুনেছি, যে ব্যক্তি এমন কুকুর পোষে যা ক্ষেত ও গবাদী পশুর হিফাযতের কাজে লাগে না, প্রতিদিন তার নেক আমল হতে এক কীরাত পরিমাণ কমতে থাকে। আমি বললাম, আপনি কি এটা আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে শুনেছেন? তিনি বললেন, হ্যাঁ, এ মসজিদের প্রতিপালকের কসম (আমি তাঁর কাছেই শুনেছি)।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 122410,
        "last_updated": null
    },
    {
        "banglaURN": 6023240,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1038,
        "babName": null,
        "hadithNumber": 2324,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, এক ব্যক্তি একটি গরুর উপর সাওয়ার ছিল, তখন গরুটি সে ব্যক্তির দিকে লক্ষ্য করে বলল, আমাকে এ কাজের জন্য সৃষ্টি করা হয়নি। আমাকে চাষাবাদ তথা ক্ষেতের কাজের জন্য সৃষ্টি করা হয়েছে। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, আমি, আবূ বক্‌র ও ‘উমার (রাঃ) এটা বিশ্বাস করি। তিনি আরো বললেন, এক নেকড়ে বাঘ একটি বকরী ধরেছিল, রাখাল তাকে ধাওয়া করল। নেকড়ে বাঘটা তাকে বলল, সেদিন হিংস্র জন্তুর প্রাধান্য হবে, যেদিন আমি ছাড়া কেউ তার রাখাল থাকবে না, সেদিন কে তাকে রক্ষা করবে? নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, আমি, আবূ বক্‌র ও ‘উমার (রাঃ) এটা বিশ্বাস করি। আবূ সালামাহ্‌ (রাঃ) বলেন, তারা দু’জন [আবূ বক্‌র ও উমার (রাঃ)] সেদিন মজলিসে হাযির ছিলেন না।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 122420,
        "last_updated": null
    },
    {
        "banglaURN": 6023250,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1039,
        "babName": null,
        "hadithNumber": 2325,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আনসাররা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)- কে বললেন, আমাদের এবং আমাদের ভাই (মুহাজির)- দের মধ্যে খেজুরের বাগান ভাগ করে দিন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, না। তখন তাঁরা (মুহাজিরগণকে) বললেন, আপনারা আমাদের বাগানে কাজ করুন, আমরা আপনাদেরকে ফলে অংশীদার করব। তাঁরা বললেন, আমরা শুনলাম এবং মানলাম।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 122430,
        "last_updated": null
    },
    {
        "banglaURN": 6023260,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1040,
        "babName": null,
        "hadithNumber": 2326,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বনূ  নাযির গোত্রের বুওয়াইরা নামক স্থানে অবস্থিত বাগানটির খেজুর গাছ জ্বালিয়ে দিয়েছেন এবং বৃক্ষ কেটে ফেলেছেন। এ সম্পর্কে হাস্‌সান (রাঃ) (তাঁর রচিত কবিতায়) বলেছেন, বুওয়াইরা নামক স্থানে অবস্থিত বাগানটিতে দাউ দাউ করে আগুন জ্বলছে আর বনূ লূয়াই গোত্রের সর্দাররা তা সহজে মেনে নিল।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 122440,
        "last_updated": null
    },
    {
        "banglaURN": 6023270,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1041,
        "babName": null,
        "hadithNumber": 2327,
        "hadithSanad": "",
        "hadithText": "রাফি‌’ ইবনু খাদীজ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, মদীনাবাসীর মধ্যে বেশী জমিন আমাদের ছিল। আমরা ভাগে জমিন চাষ করতে দিতাম এবং সে ক্ষেতের এক নির্দিষ্ট অংশ জমির মালিকের জন্য নির্ধারিত করে দিতাম। তিনি বলেন, কখনো এ অংশের উপর দুর্যোগ আসত, অন্য অংশ নিরাপদ থাকত। আবার কখনো অন্য অংশের উপর দুর্যোগ আসত আর এ অংশ নিরাপদ থাকত। আমাদের এরূপ করতে নিষেধ করে দেয়া হয়েছিল। আর সে সময় সোনা-রূপার (বিনিময়ে জমি চাষ করার) প্রচলন ছিল না।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 122450,
        "last_updated": null
    },
    {
        "banglaURN": 6023280,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1042,
        "babName": null,
        "hadithNumber": 2328,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) খায়বারবাসীদেরকে  উত্পাদিত ফল বা ফসলের অর্ধেক ভাগের শর্তে জমি বর্গা দিয়েছিলেন। তিনি নিজের সহধর্মিণীদেরকে একশ’ ওসক দিতেন, এর মধ্যে ৮০ ওসক খুরমা ও ২০ ওসক যব। ‘উমার (রাঃ) (তাঁর খিলাফতকালে খায়বারের) জমি বন্টন করেন। তিনি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সহধর্মিণীদের ইখতিয়ার দিলেন যে, তাঁরা জমি ও পানি নিবেন, না কি তাদের জন্য ওটাই চালু থাকবে, যা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর যামানায় ছিল। তখন তাদের কেউ জমি নিলেন আর কেউ ওসক নিতে রাজী হলেন। ‘আয়িশা (রাঃ) জমিই নিয়েছিলেন।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 122460,
        "last_updated": null
    },
    {
        "banglaURN": 6023290,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1043,
        "babName": null,
        "hadithNumber": 2329,
        "hadithSanad": "",
        "hadithText": "ইবনু ‘উমার (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) উত্পাদিত ফল কিংবা ফসলের অর্ধেক শর্তে খায়বারের জমি বর্গা দিয়েছিলেন।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 122470,
        "last_updated": null
    },
    {
        "banglaURN": 6023300,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1044,
        "babName": null,
        "hadithNumber": 2330,
        "hadithSanad": "",
        "hadithText": "‘আম্‌র (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি তাউস (রহঃ)- কে বললাম, আপনি যদি বর্গাচাষ ছেড়ে দিতেন, (তাহলে খুব ভাল হত) কেননা, লোকেদের ধারণা যে, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তা নিষেধ করেছেন। তাউস (রহঃ) বললেন, হে ‘আম্‌র! আমি তো তাদেরকে বর্গাচাষ করতেই দিই এবং তাদের সাহায্য করি এবং তাদের মধ্যে সবচেয়ে জ্ঞানী অর্থাৎ ইবনু ‘আব্বাস (রাঃ) আমাকে বলেছেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বর্গাচাষ নিষেধ করেননি। তবে তিনি বলেছেন, তোমাদের কেউ তার ভাইকে জমি দান করুক, এটা তার ভাইয়ের কাছ হতে নিদিষ্ট উপার্জন গ্রহণ করার চেয়ে উত্তম।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 122480,
        "last_updated": null
    },
    {
        "banglaURN": 6023310,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1045,
        "babName": null,
        "hadithNumber": 2331,
        "hadithSanad": "",
        "hadithText": "ইবনু ‘উমার (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) খায়বারের জমি ইয়াহূদীদেরকে এ শর্তে বর্গা দিয়েছিলেন যে, তারা তাতে পরিশ্রম করে কৃষি কাজ করবে এবং উত্পাদিত ফসলের অর্ধেক তারা পাবে।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 122490,
        "last_updated": null
    },
    {
        "banglaURN": 6023320,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1046,
        "babName": null,
        "hadithNumber": 2332,
        "hadithSanad": "",
        "hadithText": "রাফি’ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, মদীনাবাসীদের মধ্যে ফসলের জমি আমাদের বেশী ছিল। আমাদের মধ্যে কেউ তার জমি ইজারা দিত এবং বলত, জমির এ অংশ আমার আর এ অংশ তোমার। কখনো এক অংশে ফসল হত আর অন্য অংশে হত না। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাদেরকে এরূপ করতে নিষেধ করেছেন।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 122500,
        "last_updated": null
    },
    {
        "banglaURN": 6023330,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1047,
        "babName": null,
        "hadithNumber": 2333,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, একবার তিন জন লোক পথ চলছিল, তারা বৃষ্টিতে আক্রান্ত হল। অতঃপর তারা এক পাহাড়ের গুহায় আশ্রয় নিল। হঠাৎ পাহাড় হতে এক খন্ড পাথর পড়ে তাদের গুহার মুখ বন্ধ হয়ে গেল। তারা একে অপরকে বলল, নিজেদের কৃত কিছু সত্কাজের কথা চিন্তা করে বের কর, যা আল্লাহর সন্তুষ্টির জন্য করা হয়েছে এবং তার ওয়াসীলা করে আল্লাহর নিকট দু’আ কর। তাহলে হয়ত আল্লাহ তোমাদের উপর হতে পাথরটি সরিয়ে দিবেন। তাদের একজন বলতে লাগল, হে আল্লাহ! আমার আব্বা-আম্মা খুব বৃদ্ধ ছিলেন এবং আমার ছোট ছোট সন্তানও ছিল। আমি তাদের ভরণ-পোষণের জন্য পশু পালন করতাম। সন্ধ্যায় যখন আমি বাড়ি ফিরতাম তখন দুধ দোহন করতাম এবং আমার সন্তানদের আগে আমার আব্বা-আম্মাকে পান করাতাম। একদিন আমার ফিরতে দেরী হয় এবং সন্ধ্যা হওয়ার আগে আসতে পারলাম না। এসে দেখি তারা ঘুমিয়ে পড়েছেন। তখন আমি দুধ দোহন করলাম, যেমন প্রতিদিন দোহন করি। তারপর আমি তাঁদের শিয়রে (দুধ নিয়ে) দাঁড়িয়ে রইলাম। তাদেরকে জাগানো আমি পছন্দ করিনি এবং তাদের আগে আমার বাচ্চাদেরকে পান করানোও অসঙ্গত মনে করি। অথচ বাচ্চাগুলো দুধের জন্য আমার পায়ের কাছে পড়ে কান্নাকাটি করছিল। এভাবে ভোর হয়ে গেল। হে আল্লাহ! আপনি জানেন আমি যদি শুধু আপনার সন্তুষ্টির জন্যই এ কাজটি করে থাকি তবে আপনি আমাদের হতে পাথরটা খানিক সরিয়ে দিন, যাতে আমরা আসমানটা দেখতে পাই। তখন আল্লাহ পাথরটাকে একটু সরিয়ে দিলেন এবং তারা আসমান দেখতে পেল। দ্বিতীয় ব্যক্তি বলল, হে আল্লাহ! আমার এক চাচাতো বোন ছিল। পুরুষরা যেমন মহিলাদের ভালবাসে, আমি তাকে তার চেয়ে অধিক ভালবাসতাম। একদিন আমি তার কাছে চেয়ে বসলাম (অর্থাৎ খারাপ কাজ করতে চাইলাম) কিন্তু তা সে অস্বীকার করল যে পর্যন্ত না আমি তার জন্য একশ’ দিনার  নিয়ে আসি। পরে চেষ্টা করে আমি তা যোগাড় করলাম (এবং তার কাছে এলাম)। যখন আমি তার দু’পায়ের মাঝে বসলাম (অর্থাৎ সম্ভোগ করতে তৈরী হলাম) তখন সে বলল, হে আল্লাহর বান্দা! আল্লাহকে ভয় কর। অন্যায়ভাবে মাহ্‌র (পর্দা) ছিঁড়ে দিয়ো না। (অর্থাৎ  আমার কুমারীর সতীত্ব নষ্ট করো না) তখন আমি দাঁড়িয়ে গেলাম। হে আল্লাহ! আপনি জানেন আমি যদি শুধু আপনার সন্তুষ্টির জন্য এ কাজটি করে থাকি, তবে আপনি আমাদের জন্য পাথরটা সরিয়ে দিন। তখন পাথরটা কিছু সরে গেল। তৃতীয় ব্যক্তি বলল, হে আল্লাহ! আমি এক ফারাক চাউলের বিনিময়ে একজন শ্রমিক নিযুক্ত করেছিলাম। যখন সে তার কাজ শেষ করল  আমাকে বলল, আমার পাওনা দিয়ে দাও। আমি তাকে তার পাওনা দিতে গেলে সে তা নিল না। আমি তা দিয়ে কৃষি কাজ করতে লাগলাম এবং এর দ্বারা অনেক গরু ও তার রাখাল জমা করলাম। বেশ কিছু দিন পর সে আমার কাছে আসল এবং বলল, আল্লাহকে ভয় কর (আমার মজুরী দাও)। আমি বললাম, এই সব গরু ও রাখাল নিয়ে নাও। সে বলল, আল্লাহকে ভয় কর, আমার সাথে ঠাট্টা করো না। আমি বললাম, আমি তোমার সাথে ঠাট্টা করছি না, ওইগুলো নিয়ে নাও। তখন সে তা নিয়ে গেল। হে আল্লাহ! আপনি জানেন, যদি আমি আপনার সন্তুষ্টি লাভের জন্য এ কাজটি করে থাকি, তবে পাথরের বাকীটুকু সরিয়ে দিন। তখন আল্লাহ পাথরটাকে সরিয়ে দিলেন। আবূ ‘আবদুল্লাহ্ [বুখারী (রহঃ)] বলেন, ইবনু ‘উকবা (রহঃ) নাফি’ (রহঃ) ------এর স্থলে -------- বর্ণনা করেছেন।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 122510,
        "last_updated": null
    },
    {
        "banglaURN": 6023340,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1048,
        "babName": null,
        "hadithNumber": 2334,
        "hadithSanad": "",
        "hadithText": "আসলাম (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, ‘উমার (রাঃ) বলেছেন, পরবর্তী যুগের মুসলমানদের বিষয়ে যদি আমরা চিন্তা না করতাম, তবে যে সব এলাকা জয় করা হত, তা আমি মুজাহিদদের মধ্যে বন্টন করে দিতাম, যেমন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) খায়বার বন্টন করে দিয়েছিলেন।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 122520,
        "last_updated": null
    },
    {
        "banglaURN": 6023350,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1049,
        "babName": null,
        "hadithNumber": 2335,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, যে ব্যক্তি এমন কোন জমি আবাদ করে, যা কারো মালিকানায় নয়, তাহলে সেই (মালিক হওয়ার) বেশী হকদার। ‘উরওয়াহ (রাঃ) বলেন, ‘উমার (রাঃ) তাঁর খিলাফতকালে এরূপ ফায়সালা দিয়েছেন।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 122530,
        "last_updated": null
    },
    {
        "banglaURN": 6023360,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1050,
        "babName": null,
        "hadithNumber": 2336,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যুল-হুলায়ফা উপত্যকায় শেষরাতে বিশ্রাম করছিলেন। তিনি স্বপ্নে দেখলেন যে, তাঁকে বলা হলো, আপনি বরকতময় উপত্যকায় রয়েছেন। মূসা (রহঃ) বলেন, সালিম আমাদের সাথে সে জায়গাতেই উট বসিয়েছিলেন যেখানে ‘আবদুল্লাহ (রাঃ) উট বসাতেন এবং সে জায়গা লক্ষ্য করতেন, যে জায়গায় আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) শেষরাতে অবতরণ করেছিলেন। সে জায়গা ছিল উপত্যকার মধ্যভাগে অবস্থিত মসজিদ হতে নীচে এবং মসজিদ ও রাস্তার মাঝখানে।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 122540,
        "last_updated": null
    },
    {
        "banglaURN": 6023370,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1050,
        "babName": null,
        "hadithNumber": 2337,
        "hadithSanad": "",
        "hadithText": "‘উমার (রাঃ) সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে থেকে বর্ণিতঃ তিনি বলেন, গতরাতে আমার নিকট আমার প্রতিপালকের দূত এসেছিলেন। এ সময় তিনি আকীক উপত্যকায় অবস্থান করছিলেন। (এসে) তিনি বললেন, এই বরকতময় উপত্যকায় সালাত আদায় করুন, অর্থাৎ হাজ্জের সাথে উমরাহ্ এর ইহরাম বাঁধলাম।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 122550,
        "last_updated": null
    },
    {
        "banglaURN": 6023380,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1051,
        "babName": null,
        "hadithNumber": 2338,
        "hadithSanad": "",
        "hadithText": "ইবনু ‘উমার (রাঃ) থেকে বর্ণিতঃ ‘উমার ইবনু খাত্তাব (রাঃ) ইয়াহূদী ও নাসারাদের হিজায হতে নির্বাসিত করেন। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যখন খায়বার জয় করেন, তখন ইয়াহূদীদের সেখান হতে বের করে দিতে চেয়েছিলেন। যখন তিনি কোন স্থান জয় করেন, তখন আল্লাহ, তাঁর রসূল ও মুসলিমদের  জন্য হয়ে যায়। কাজেই ইয়াহূদীদের সেখান হতে বহিষ্কার করে দিতে চাইলেন। তখন ইয়াহূদীরা আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছে অনুরোধ করল, যেন তাদের সে স্হানে বহাল রাখা হয় এ শর্তে যে, তারা সেখানে চাষাবাদে দায়িত্ব পালন করবে আর ফসলের অর্ধেক তাদের থাকবে। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাদের বললেন, আমরা এ শর্তে তোমাদের এখানে বহাল থাকতে দিব যতদিন আমাদের ইচ্ছা। কাজেই তারা সেখানে বহাল রইল। অবশেষে ‘উমার (রাঃ) তাদেরকে তাইমা ও আরীহায় নির্বাসিত করে দেন।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 122560,
        "last_updated": null
    },
    {
        "banglaURN": 6023390,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1052,
        "babName": null,
        "hadithNumber": 2339,
        "hadithSanad": "",
        "hadithText": "যুহাইর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, একটি কাজ আমাদের উপকারী ছিল, যা করতে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাদের নিষেধ করলেন। আমি বললাম, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যা বলেছেন তাই সঠিক। যুহাইর (রাঃ) বললেন, আমাকে ডেকে জিজ্ঞেস করলেন, তোমরা তোমাদের ক্ষেত-খামার কিভাবে চাষাবাদ কর? আমি বললাম, আমরা নদীর তীরের ফসলের শর্তে অথবা খেজুর ও যবের নির্দিষ্ট কয়েক ওসাক প্রদানের শর্তে জমি ইজারা দিয়ে থাকি। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, তোমরা এরূপ করবে না। তোমরা নিজেরা তা চাষ করবে অথবা অন্য কাউকে দিয়ে চাষ করাবে অথবা তা ফেলে রাখবে। রাফ’ (রাঃ) বলেন, আমি শুনলাম ও মানলাম।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 122570,
        "last_updated": null
    },
    {
        "banglaURN": 6023420,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1052,
        "babName": null,
        "hadithNumber": 2342,
        "hadithSanad": "",
        "hadithText": "‘আম্‌র (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি (বর্গাচাষ সম্পর্কিত) এ হাদীসটি তাউস (রহঃ)- কে জিজ্ঞেস করলাম। তিনি বললেন, (অন্যকে দিয়ে) চাষবাদ করানো যেতে পারে। (কেননা) ইবনু ‘আব্বাস (রাঃ) বলেছেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তা (বর্গাচাষ) নিষেধ করেননি। তবে তিনি বলেছেন যে, তোমাদের নিজের ভাইকে জমি দান করে দেয়া উত্তম, তার কাছ হতে নিদিষ্ট কিছু গ্রহণ করার চেয়ে।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 122600,
        "last_updated": null
    },
    {
        "banglaURN": 6023450,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1052,
        "babName": null,
        "hadithNumber": 2345,
        "hadithSanad": "",
        "hadithText": "সালিম (রহঃ) থেকে বর্ণিতঃ ‘আবদুল্লাহ ইবনু ‘উমার (রাঃ) বলেছেন, আমি জানতাম যে, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর যামানায় ক্ষেত বর্গাচাষ করতে দেয়া হত। তারপর ‘আবদুল্লাহ (রাঃ)-এর ভয় হল, হয়ত নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এ সম্পর্কে এমন কিছু নতুন নির্দেশ দিয়েছেন, যা তাঁর জানা নেই। তাই তিনি ভাগে জমি ইজারা দেয়া ত্যাগ করলেন।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 122630,
        "last_updated": null
    },
    {
        "banglaURN": 6023461,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "",
        "babNumber": 1053,
        "babName": null,
        "hadithNumber": 2346,
        "hadithSanad": "",
        "hadithText": "রাফি’ ইবনু খাদীজ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমার কাছে আমার চাচারা বর্ণনা করেছেন যে, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর যামানায় লোকেরা নালার পার্শ্বস্থ ফসলের শর্তে কিংবা এমন কিছু শর্তে ভাগে জমি ইজারা দিত, যা ক্ষেতের মালিক নিজের জন্যে নির্দিষ্ট করে নিত। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাদের এরূপ করতে নিষেধ করেন। রাবী বলেন, আমি রাফি’ (রাঃ)- কে বললাম, দীনার ও দিরহামের শর্তে জমি (ইজারা দেয়া) কেমন? রাফি’ (রাঃ) বললেন, দীনার ও দিরহামের বিনিময়ে ইজারা দেয়াতে কোন দোষ নেই। [লাইস (রহঃ)] বলেন, আমার মনে হয়, যে বিষয়ে নিষেধ করা হয়েছে, হালাল ও হারাম বিষয়ে বিজ্ঞজনেরা সে সম্পর্কে চিন্তা করলেও তারা তা জায়েয মনে করবেন না। কেননা, তাতে (ক্ষতির) আশঙ্কা রয়েছে। \n\nআবূ ‘আবদুল্লাহ [ইমাম বুখারী (রহঃ)] বলেন, আমার মনে হয়, যে বিষয়ে নিষেধ করা হয়েছে- এখান হতে লাইস (রহঃ)-এর উক্তি শুরু হয়েছে। (২৩৩৯, ৪০১৩) (আ.প্র. ২১৭৬, ই.ফা. ২১৯৩)</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 122640,
        "last_updated": null
    },
    {
        "banglaURN": 6023480,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1054,
        "babName": null,
        "hadithNumber": 2348,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ একদিন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) কথা বলছিলেন, তখন তাঁর নিকট গ্রামের একজন লোক উপবিষ্ট ছিল। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বর্ণনা করেন যে, জান্নাতবাসীদের কোন একজন তার রবের কাছে চাষাবাদের অনুমতি চাইবে। তখন আল্লাহ তা’আলা তাকে বলবেন, তুমি কি যা চাও, তা পাচ্ছ না? সে বলবে, হ্যাঁ নিশ্চয়ই। কিন্তু আমার চাষ করার খুবই আগ্রহ। নবী (সা) বললেন, তখন সে বীজ বুনবে এবং তা চারা হওয়া, গাছ বড় হওয়া ও ফসল কাটা সব কিছু পলকের মধ্যে হয়ে যাবে। আর তা (ফসল) পাহাড় সমান হয়ে যাবে। তখন আল্লাহ তা’আলা বলবেন, হে আদম সন্তান! এগুলো নিয়ে নাও। কোন কিছুই তোমাকে তৃপ্তি দেয় না। তখন গ্রাম্য লোকটি বলে উঠল, আল্লাহর কসম, এই ধরনের লোক আপনি কুরাইশী বা আনসারদের মধ্যেই পাবেন। কেননা তাঁরা চাষী। আর আমরা তো চাষী নই। এ কথা শুনে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হেসে দিলেন।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 122650,
        "last_updated": null
    },
    {
        "banglaURN": 6023490,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1055,
        "babName": null,
        "hadithNumber": 2349,
        "hadithSanad": "",
        "hadithText": "সাহ্‌ল ইবনু সা’দ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, জুমু’আর দিন আসলে আমরা আনন্দিত হতাম এজন্য যে, আমাদের (প্রতিবেশী) এক বৃদ্ধা ছিলেন, তিনি আমাদের নালার ধারে লাগানো বীট গাছের মূল তুলে এনে তার ডেকচিতে রাখতেন এবং তার সাথে যবের দানাও মিশাতেন। (বর্ণনাকারী বলেন) আমার যতটুকু মনে পড়ে তিনি (সাহ্‌ল) বলেছেন যে, তাতে কোন চর্বি না তৈলাক্ত কিছু থাকত না। আমরা জুমু’আর সালাতের পর বৃদ্ধার নিকট আসতাম এবং তিনি তা আমাদের সামনে পরিবেশন করতেন। এ কারণে জুমু’আর দিন আমাদের খুব আনন্দ হত। আমরা জুমু’আর সালাতের পরই আহার করতাম এবং কায়লুলাহ (বিশ্রাম) করতাম।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 122660,
        "last_updated": null
    },
    {
        "banglaURN": 6023500,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": null,
        "babNumber": 1055,
        "babName": null,
        "hadithNumber": 2350,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, লোকজন বলে যে, আবূ হুরায়রা বেশী হাদীস বর্ণনা করে থাকেন। প্রকৃতপক্ষে আল্লাহর কাছেই সবার প্রত্যাবর্তন। এবং তারা আরো বলে, মুহাজির ও আনসারদের কী হল যে, তারা আবূ হুরায়রার মতো এত হাদীস বর্ণনা করেন না। [আবূ হুরায়রা (রাঃ) বলেন,] আমার মুহাজির ভাইদেরকে বাজারে বেচা-কেনা এবং আনসার ভাইদেরকে তাদের ক্ষেত খামার ও বাগানের কাজ-কর্ম ব্যতিব্যস্ত রাখত। আমি ছিলাম একজন মিসকীন লোক। পেটে যা জুটে, খেয়ে না খেয়ে তাতেই তুষ্ট হয়ে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছে পড়ে থাকতাম। তাই লোকেরা যখন অনুপস্থিত থাকত, আমি হাযির থাকতাম। লোকেরা যা ভুলে যেত, আমি তা স্মরণ রাখতাম। একদিন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, তোমাদের যে কেউ আমার কথা শেষ হওয়া পর্যন্ত তার চাদর বিছিয়ে রাখবে এবং আমার কথা শেষ হলে চাদরখানা তার বুকের সাথে মিলাবে, তাহলে সে আমার কথা কখনো ভুলবে না। আমি আমার পশমী চাদরটা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কথা শেষ না হওয়া পর্যন্ত বিছিয়ে রাখলাম। সে চাদর ছাড়া আমার গায়ে আর কোন চাদর ছিল না। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কথা শেষ হওয়ার পর আমি তা আমার বুকের সাথে মিলালাম। সে সত্তার কসম! যিনি তাঁকে সত্য দিয়ে প্রেরণ করেছেন, আজ পর্যন্ত আমি তাঁর একটি কথাও ভুলিনি। আল্লাহর কসম! যদি আল্লাহর কিতাবের এ দু’টি আয়াত না থাকত, তবে আমি কখনো তোমাদের নিকট হাদীস বর্ণনা করতাম না। (তা এই) : \n\n“যারা আমার নাযিলকৃত নির্দশনসমূহ গোপন করে ......... আল্লাহ অত্যন্ত দয়ালু পর্যন্ত”-  (আল-বাকারা ১৫৯-১৬০)।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 122670,
        "last_updated": null
    },
    {
        "banglaURN": 6023401,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "",
        "babNumber": 1052,
        "babName": "",
        "hadithNumber": 2340,
        "hadithSanad": "",
        "hadithText": "জাবির (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, লোকেরা এক-তৃতীয়াংশ, এক-চতুর্থাংশ ও অর্ধেক ফসলের শর্তে বর্গা চাষ করত। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, যে ব্যক্তির নিকট জমি রয়েছে, সে যেন নিজে চাষ করে অথবা তা কাউকে দিয়ে দেয়। যদি তা না করে তবে সে যেন তার জমি ফেলে রাখে।\n\nআবু হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, যার নিকট জমি রয়েছে, সে যেন তা নিজে চাষ করে, অথবা তার ভাইকে দিয়ে দেয়, যদি এটাও না করতে চায়, তবে সে যেন তার জমি ফেলে রাখে।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 122581,
        "last_updated": null
    },
    {
        "banglaURN": 6023431,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 41,
        "bookName": "",
        "babNumber": 1052,
        "babName": "",
        "hadithNumber": 2343,
        "hadithSanad": "",
        "hadithText": "নাফি’ (রহঃ) থেকে বর্ণিতঃ ইবনু ‘উমার (রাঃ) নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সময়ে এবং আবূ বকর, ‘উমার, উসমান (রাঃ) মু’আবিয়া (রাঃ)-এর শাসনের শুরু ভাগে নিজের ক্ষেতে বর্গাচাষ করতে দিতেন।\n\nরাফি’ ইবনু খাদীজ (রাঃ) থেকে বর্ণিতঃ হাদীসটি তাঁর নিকট বর্ণনা করা হয় যে, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ক্ষেত ভাগে ইজারা দিতে নিষেধ করেছেন। তখন ইবনু ‘উমার (রাঃ) রাফি’ (রাঃ) এর নিকট গেলেন। আমিও তাঁর সঙ্গে গেলাম। তিনি (ইবনু ‘উমার) তাঁকে জিজ্ঞেস করলেন। তিনি [রাফি’ (রাঃ)] বললেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ক্ষেত ভাগে ইজারা দিতে নিষেধ করেছেন। তখন ইবনু ‘উমার (রাঃ) বললেন, আপনি তো জানেন যে, আমরা আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর যামানায় নালার পার্শ্বস্থ ক্ষেতের ফসলের শর্তে এবং কিছু ঘাসের বিনিময়ে আমাদের ক্ষেত ইজারা দিতাম।</b>",
        "bookID": "41.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 122611,
        "last_updated": null
    }
]