[
    {
        "banglaURN": 6024832,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": null,
        "babNumber": 1351,
        "babName": null,
        "hadithNumber": 2483,
        "hadithSanad": "",
        "hadithText": "জাবির ইবনু ‘আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সমুদ্র তীর অভিমুখে বাহিনী প্রেরণ করেন এবং আবূ উবায়দা ইবনু জাররাহ (রাঃ)-কে তাদের সেনাপতি নিয়োগ করলেন। এ বাহিনীতে তিনশ’ লোক ছিলেন। আমি তাদের মধ্যে ছিলাম। আমরা রওয়ানা হলাম। কিন্তু মাঝপথেই আমাদের পাথেয় শেষ হয়ে গেল। তখন আবূ উবায়দা (রাঃ) দলের সকলকে নিজ নিজ খাদ্যদ্রব্য এক জায়গায় জমা করার নির্দেশ দিলেন। তাই সমস্ত খাদ্যদ্রব্য জমা করা হল। এতে মোট দু’থলে খেজুর জমা হল। আবূ উবায়দা (রাঃ) প্রতিদিন আমাদের এই খেজুর হতে কিছু কিছু করে খেতে দিলেন। অবশেষে তাও শেষ হওয়ার উপক্রম হল এবং জনপ্রতি একটা করে খেজুর ভাগে পড়তে লাগল। (রাবী বলেন) আমি [জাবির (রাঃ)-কে] বললাম, একটা খেজুর কি যথেষ্ট হত। তিনি বললেন, তার মূল্য তখন বুঝতে পারলাম যখন তাও শেষ হয়ে গেল। তিনি বলেন, এরপর আমরা সমুদ্র পর্যন্ত পৌঁছে গেলাম। হঠাৎ ছোট পাহাড়ের ন্যায় একটা মাছ আমরা পেয়ে গেলাম এবং এ বাহিনী আঠারো দিন পর্যন্ত এই মাছ হতে খেল। তারপর আবূ উবায়দা (রাঃ)-এর আদেশে সে মাছের পাঁজর হতে দুটো কাঁটা দাঁড় করানো হল। তারপর তিনি হাওদা লাগাতে বললেন। হাওদা লাগানো হল। এরপর উট তার পাঁজরের নীচ দিয়ে চলে গেল কিন্তু উটের দেহ সে দু’টো কাঁটা স্পর্শ করল না।</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 124000,
        "last_updated": null
    },
    {
        "banglaURN": 6024840,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": null,
        "babNumber": 1351,
        "babName": null,
        "hadithNumber": 2484,
        "hadithSanad": "",
        "hadithText": "সালামা ইবনু আকওয়া (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, কোন এক সফরে লোকেদের পাথেয় কমে গিয়েছিল এবং তারা অভাবগ্রস্ত হয়ে পড়লেন। তখন তারা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট তাদের উট যবেহ করার অনুমতি নেয়ার জন্য এলেন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাদের অনুমতি দিলেন। তারপর তাদের সঙ্গে ‘উমর (রাঃ)-এর সাক্ষাৎ হলে তারা তাঁকে এ খবর দিলেন। তিনি বললেন, উট শেষ হয়ে যাবার পর তোমাদের বাঁচার কি উপায় থাকবে? তারপর ‘উমর (রাঃ) নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছে এসে বললেন, হে আল্লাহর রসূল! উট শেষ হয়ে যাবার পর তাদের বাঁচার কী উপায় হবে? তখন রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, লোকেদের কাছে ঘোষণা করে দাও যে, যাদের কাছে অতিরিক্ত যে খাদ্য সামগ্রী আছে, তা যেন আমার কাছে নিয়ে আসে। এর জন্য একটা চামড়া বিছিয়ে দেয়া হল। তারা সেই চামড়ার উপর তা রাখলেন। তারপর রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) দাঁড়িয়ে তাতে বরকতের জন্য দু‘আ করলেন। এরপর তিনি তাদেরকে তাদের পাত্রগুলো নিয়ে আসতে বললেন, লোকেরা দু’হাত ভর্তি করে করে নিল। সবার নেয়া শেষ হলে রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ব্যতীত প্রকৃত কোন ইলাহ নেই এবং নিশ্চয়ই আমি আল্লাহর রসূল।</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 124010,
        "last_updated": null
    },
    {
        "banglaURN": 6024850,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": null,
        "babNumber": 1351,
        "babName": null,
        "hadithNumber": 2485,
        "hadithSanad": "",
        "hadithText": "রাফি‘ ইবনু খাদীজ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সাথে আসরের সালাত আদায় করে উট যবেহ করতাম। তারপর সে গোশত দশ ভাগে ভাগ করা হত এবং সূর্যাস্তের পূর্বেই আমরা রান্না করা গোশত আহার করতাম।</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 124020,
        "last_updated": null
    },
    {
        "banglaURN": 6024860,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": null,
        "babNumber": 1351,
        "babName": null,
        "hadithNumber": 2486,
        "hadithSanad": "",
        "hadithText": "আবূ মূসা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, আশ‘আরী গোত্রের লোকেরা যখন জিহাদে গিয়ে অভাবগ্রস্ত হয়ে পড়ে বা মদীনাতেই তাদের পরিবার পরিজনদের খাবার কম হয়ে যায়, তখন তারা তাদের যা কিছু সম্বল থাকে, তা একটা কাপড়ে জমা করে। তারপর একটা পাত্র দিয়ে মেপে তা নিজেদের মধ্যে সমান ভাগে ভাগ করে নেয়। কাজেই তারা আমার এবং আমি তাদের।</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 124030,
        "last_updated": null
    },
    {
        "banglaURN": 6024870,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": null,
        "babNumber": 1352,
        "babName": null,
        "hadithNumber": 2487,
        "hadithSanad": "",
        "hadithText": "আনাস (ইবনু মালিক) (রাঃ) থেকে বর্ণিতঃ রসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যাকাতের বিধান হিসাবে যা নির্দিষ্ট করেছিলেন, আবূ বকর (রাঃ) তা আমাকে লিখে দিয়েছিলেন। তিনি বলেছেন, যেখানে দু’জন অংশীদার থাকে (যাকাত প্রদানের পর) তারা দু’জনে নিজ নিজ অংশ আদান-প্রদান করে নেবে।</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 124040,
        "last_updated": null
    },
    {
        "banglaURN": 6024880,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": null,
        "babNumber": 1353,
        "babName": null,
        "hadithNumber": 2488,
        "hadithSanad": "",
        "hadithText": "রাফি‘ ইবনু খাদীজ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সঙ্গে যুল-হুলায়ফাতে ছিলাম। সাহাবীগণ ক্ষুধার্ত হয়ে পড়েন, তারা কিছু উট ও বকরী পেলেন। রাফী‘ (রাঃ) বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) দলের পিছনে ছিলেন। তারা তাড়াহুড়া করে গনীমতের মাল বণ্টনের পূর্বে সেগুলোকে যবেহ করে পাত্রে চড়িয়ে দিলেন। তারপর নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নির্দেশে পাত্র উলটিয়ে ফেলা হল। তারপর তিনি (গনীমতের মাল ) বণ্টন শুরু করলেন। তিনি একটি উটের সমান দশটি বকরী নির্ধারণ করেন। হঠাৎ একটি উট পালিয়ে গেল। সাহাবীগণ উটকে ধরার জন্য ছুটলেন, কিন্তু উটটি তাঁদেরকে ক্লান্ত করে ছাড়ল। সে সময় তাঁদের নিকট অল্প সংখ্যক ঘোড়া ছিল। অবশেষে তাঁদের মধ্যে একজন  সেটির প্রতি তীর ছুড়লেন। তখন আল্লাহ উটটাকে থামিয়ে দিলেন। তারপর নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, নিশ্চয়ই পলায়নপর বন্য জন্তুদের মতো এ সকল চতুস্পদ জন্তুর মধ্যে কতক পলায়নপর হয়ে থাকে। কাজেই যদি এসব জন্তুর কোনটা তোমাদের উপর প্রবল হয়ে উঠে তবে তার সাথে এরূপ করবে। (রাবী বলেন), তখন আমার দাদা [রাফি‘ (রাঃ)] বললেন, আমরা আশঙ্কা করছি যে, কাল শত্রুর সাথে মুকাবিলা হবে। আর আমাদের নিকট কোন ছুরি নেই। তাই আমরা ধারাল বাঁশ দিয়ে যবেহ করতে পারব কি? নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, যে বস্তু রক্ত প্রবাহিত করে এবং যার উপর আল্লাহর নাম নেয়া হয়, সেটা তোমরা আহার করতে পার। কিন্তু দাঁত বা নখ দিয়ে যেন যবেহ না করা হয়। আমি তোমাদেরকে এর কারন বলে দিচ্ছি। দাঁত তো হাড় আর নখ হল হাবশীদের ছুরি।</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 124050,
        "last_updated": null
    },
    {
        "banglaURN": 6024890,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": null,
        "babNumber": 1354,
        "babName": null,
        "hadithNumber": 2489,
        "hadithSanad": "",
        "hadithText": "ইবনু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) (এক সাথে খেতে বসে) সঙ্গীদের অনুমতি ব্যতীত কাউকে এক সঙ্গে দু’টো করে খেজুর খেতে নিষেধ করেছেন।</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 124060,
        "last_updated": null
    },
    {
        "banglaURN": 6024900,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": null,
        "babNumber": 1354,
        "babName": null,
        "hadithNumber": 2490,
        "hadithSanad": "",
        "hadithText": "জাবালা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা মদীনায় ছিলাম। একবার আমরা দুর্ভিক্ষের কবলে পড়ি। তখন ইবনু যুবাইর (রাঃ) আমাদেরকে (প্রত্যহ) খেজুর খেতে দিতেন। একদিন ইবনু ‘উমর (রাঃ) আমাদের নিকট দিয়ে যাচ্ছিলেন। (আমাদের খেজুর খেতে দেখে) তিনি বললেন, তোমরা এক সাথে দু’টো করে খেজুর খেও না। কেননা, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) কাউকে তার ভাইয়ের অনুমতি ব্যতীত দু’টো করে খেজুর খেতে নিষেধ করেছেন।</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 124070,
        "last_updated": null
    },
    {
        "banglaURN": 6024910,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": null,
        "babNumber": 1355,
        "babName": null,
        "hadithNumber": 2491,
        "hadithSanad": "",
        "hadithText": "ইবনু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, (শরীকী) গোলাম হতে কেউ নিজের অংশ আযাদ করে দিলে এবং তার কাছে গোলামের ন্যায্য মূল্য পরিমাণ অর্থ থাকলে সে গোলাম (সম্পূর্ণ) আযাদ হয়ে যাবে (তবে আযাদকারী ন্যায্য মূল্যে শরীকদের ক্ষতিপূরণ দিবে) আর সে পরিমাণ অর্থ না থাকলে যতটুকু সে মুক্ত করবে ততটুকুই মুক্ত হবে।</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 124080,
        "last_updated": null
    },
    {
        "banglaURN": 6024920,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": null,
        "babNumber": 1355,
        "babName": null,
        "hadithNumber": 2492,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, কেউ তার (শরীক) গোলাম হতে অংশ আযাদ করে দিলে তার দায়িত্ব হয়ে পড়ে নিজস্ব অর্থে সেই গোলামকে পূর্ণ আযাদ করা। যদি তার প্রয়োজনীয় অর্থ না থাকে, তাহলে গোলামের ন্যায্য মূল্য নির্ধারণ করতে হবে। তারপর (অন্য শরীকদের অংশ পরিশোধের জন্য) তাকে উপার্জনে যেতে হবে, তবে তার উপর অতিরিক্ত কষ্ট চাপানো যাবে না।</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 124090,
        "last_updated": null
    },
    {
        "banglaURN": 6024930,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": null,
        "babNumber": 1356,
        "babName": null,
        "hadithNumber": 2493,
        "hadithSanad": "",
        "hadithText": "নু‘মান ইবনু বাশীর (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, যে মহান আল্লাহর নির্ধারিত সীমার মধ্যে প্রতিষ্ঠিত থাকে এবং যে সীমা লঙ্ঘন করে, তাদের দৃষ্টান্ত সেই যাত্রীদলের মতো, যারা কুরাআ’র মাধ্যমে এক নৌযানে নিজেদের স্থান নির্ধারণ করে নিল। তাদের কেউ স্থান পেল উপর তলায় আর কেউ নীচ তলায় (পানির ব্যবস্থা ছিল উপর তলায়) কাজেই নীচের তলার লোকেরা পানি সংগ্রহ কালে উপর তলার লোকদের ডিঙ্গিয়ে যেত। তখন নীচ তলার লোকেরা বলল, উপর তলার লোকদের কষ্ট না দিয়ে আমরা যদি নিজেদের অংশে একটি ছিদ্র করে নেই (তবে ভাল হয়) এমতাবস্থায় তারা যদি এদেরকে আপন মর্জির উপর ছেড়ে দেয় তাহলে সবাই ধ্বংস হয়ে যাবে। আর যদি তারা এদের হাত ধরে রাখে (বিরত রাখে) তবে তারা এবং সকলেই রক্ষা পাবে।</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 124100,
        "last_updated": null
    },
    {
        "banglaURN": 6024940,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": null,
        "babNumber": 1357,
        "babName": null,
        "hadithNumber": 2494,
        "hadithSanad": "",
        "hadithText": "‘উরওয়াহ ইবনু যুবাইর (রাঃ) থেকে বর্ণিতঃ তিনি একবার ‘আয়িশা (রাঃ)-কে আল্লাহ তা‘আলার বাণীঃ “আর যদি তোমরা আশঙ্কা কর যে, ইয়াতীম বালিকাদের প্রতি সুবিচার করতে পারবে না তাহলে অন্য মহিলাদের মধ্য হতে তোমাদের পছন্দ মতো দু’জন বা তিনজন কিংবা চারজনকে বিয়ে করতে পার”- (আন-নিসা : ৩)। এ সম্পর্কে জিজ্ঞেস করলে ‘আয়িশা (রাঃ) বললেন, আমার ভাগিনা! এ হচ্ছে, সেই ইয়াতীম মেয়ের কথা, যে অভিভাবকের আশ্রয়ে থাকে এবং তার সম্পদে অংশীদার হয়। এদিকে মেয়ের ধন-রূপে মুগ্ধ হয়ে তার অভিভাবক মোহরানার ব্যাপারে সুবিচার না করে অর্থাৎ অন্য কেউ যে পরিণাম মোহরানা দিতে রাজী হত, তা না দিয়েই তাকে বিয়ে করতে চাইত। তাই প্রাপ্য মোহরানা আদায়ের মাধ্যমে সুবিচার না করা পর্যন্ত তাদেরকে আশ্রিতা ইয়াতীম বালিকাদের বিয়ে করতে নিষেধ করা হয়েছে এবং পছন্দমত অন্য মহিলাদেরকে বিয়ে করতে বলা হয়েছে। ‘উরওয়াহ (রাঃ) বলেন, ‘আয়িশা (রাঃ) বলেছেন, পরে সাহাবীগণ রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট (মহিলাদের সম্পর্কে) ফতোয়া জিজ্ঞেস করলেন তখন আল্লাহ তা‘আলা আয়াত নাযিল করেন- “ তারা আপনার নিকট মহিলাদের সম্পর্কে ফতোয়া জিজ্ঞেস করে, আপনি বলুন, আল্লাহই তাদের সম্পর্কে তোমাদের সিদ্ধান্ত দিয়েছেন। আর ইয়াতীম মেয়েদের সম্পর্কে কিতাব হতে তোমাদেরকে পাঠ করে শোনানো হয়, তাদের জন্য যা বিধিবদ্ধ রয়েছে, তা তোমরা তাদের দাও না অথচ তাদের তোমরা বিয়ে করতে চাও” – (আন-নিসা : ১২৭) (আরবী) বলে আল্লাহ তা‘আলা পূর্বোক্ত আয়াতের প্রতি ইঙ্গিত করেছেন; যেখানে বলা হয়েছে- (আরবী) “আর যদি তোমরা আশঙ্কা কর যে, ইয়াতীম মেয়েদের প্রতি সুবিচার করতে পারবে না, তাহলে অন্য নারীদের মধ্যে হতে তোমাদের পছন্দ মতো দু’জন বা তিনজন কিংবা চারজন বিয়ে করতে পারবে”। ‘আয়িশা (রাঃ) বলেন, আর অপর আয়াতে আল্লাহ তা‘আলার ইরশাদ এর মর্ম হল, “ধন ও রূপের সল্পতা হেতু তোমাদের আশ্রিতা ইয়াতীম মেয়েদের প্রতি তোমাদের অনাগ্রহ”। তাই ইয়াতীম মেয়েদের প্রতি অনাগ্রহ সত্তেও শুধু ধন–রূপের প্রতি আকৃষ্ট হয়ে তাদের বিয়ে করতে নিষেধ করা হয়েছে। অবশ্য ন্যায়সঙ্গত মোহরানা আদায় করে বিয়ে করতে পারে।</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 124110,
        "last_updated": null
    },
    {
        "banglaURN": 6024950,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": null,
        "babNumber": 1358,
        "babName": null,
        "hadithNumber": 2495,
        "hadithSanad": "",
        "hadithText": "জাবির ইবনু ‘আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, যে সব (স্থাবর) সম্পত্তি এখনো ভাগ করা হয়নি, সেগুলোর ক্ষেত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) শুফ‘আ এর (তথা ক্রয়ের ক্ষেত্রে অগ্রাধিকার) বিধান দিয়েছেন। এরপর সীমানা ঠিক করা হলে এবং পথ আলাদা করে নেয়া হলে শুফ‘আর অধিকার থাকে না।</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 124120,
        "last_updated": null
    },
    {
        "banglaURN": 6024960,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": null,
        "babNumber": 1359,
        "babName": null,
        "hadithNumber": 2496,
        "hadithSanad": "",
        "hadithText": "জাবীর ইবনু ‘আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সব ধরনের অবণ্টিত স্থাবর সম্পত্তির ক্ষেত্রে শুফ‘আর ফায়সালা দিয়েছেন। এরপর সীমানা নির্ধারণ করে পথ আলাদা করে নেয়া হলে শুফ‘আর অধিকার থাকে না।</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 124130,
        "last_updated": null
    },
    {
        "banglaURN": 6024990,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": null,
        "babNumber": 1361,
        "babName": null,
        "hadithNumber": 2499,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ ইবনু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) খায়বারের জমি এ শর্তে ইয়াহুদীদের দিয়েছিলেন যে, তারা নিজেদের শ্রমে তাতে চাষাবাদ করবে, তার বিনিময়ে উৎপন্ন ফসলের অর্ধেক তাদের হবে।</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 124150,
        "last_updated": null
    },
    {
        "banglaURN": 6025000,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": null,
        "babNumber": 1362,
        "babName": null,
        "hadithNumber": 2500,
        "hadithSanad": "",
        "hadithText": "‘উকবাহ ইবনু ‘আমির (রাঃ) থেকে বর্ণিতঃ রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) কুরবানীর কিছু বকরী সাহাবীদের মাঝে ভাগ করার জন্য তাকে (দায়িত্ব) দিয়েছিলেন। ভাগ করা শেষে এক বছর বয়সী একটা ছাগল রয়ে গেল। রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে সে কথা জানালে তিনি ইরশাদ করলেন, ওটা তুমিই কুরবানী কর।</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 124160,
        "last_updated": null
    },
    {
        "banglaURN": 6025011,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "",
        "babNumber": 1363,
        "babName": "",
        "hadithNumber": 2501,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ ইবনু হিশাম (রাঃ) থেকে বর্ণিতঃ তিনি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সাক্ষাৎ পেয়েছিলেন। তার মা যায়নাব বিনতে হুমাইদ (রাঃ) একবার তাকে রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট নিয়ে গেলেন এবং বললেন, হে আল্লাহর রসূল! একে বায়‘আত করে নিন। তিনি বললেন, সে তো ছোট। তখন তিনি তার মাথায় হাত বুলালেন এবং তার জন্য দু‘আ করলেন। (একই সনদে) যুহরা ইবনু মা‘বাদ (রহঃ) হতে আরো বর্ণিত আছে যে, তার দাদা ‘আবদুল্লাহ্‌ ইবনু হিশাম (রাঃ) তাকে নিয়ে বাজারে যেতেন, খাদ্য সামগ্রী খরিদ করতেন। পথে ইবনু ‘উমর (রাঃ) ও ইবনু যুবাইর (রাঃ)-এর সাথে দেখা হলে তারা তাকে বলতেন (আপনার সাথে ব্যবসায়ে) আমাদেরও শরীক করে নিন। কেননা, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আপনার জন্য বরকতের দু‘আ করেছেন। এ কথায় তিনি তাদের শরীক করে নিতেন। অনেক সময় (লভ্যাংশ হিসাবে) এক উট বোঝাই মাল তিনি ভাগে পেতেন আর তা বাড়ীতে পাঠিয়ে দিতেন।</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 124171,
        "last_updated": null
    },
    {
        "banglaURN": 6025030,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": null,
        "babNumber": 1364,
        "babName": null,
        "hadithNumber": 2503,
        "hadithSanad": "",
        "hadithText": "ইবনু ‘উমর (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, (শরীকী) গোলাম হতে কেউ নিজের অংশ আযাদ করে দিলে সেই গোলামের সম্পূর্ণটা আযাদ করা তার জন্য ওয়াজিব হয়ে যাবে। যদি তার কাছে সেই গোলামের মূল্য পরিশোধ পরিমাণ সম্পদ থাকে, তাহলে ন্যায্য মূল্য নির্ধারণ করে অংশীদারদের তাদের প্রাপ্য অংশ পরিশোধ করা হবে এবং আযাদ কৃত গোলামের পথ ছেড়ে দেয়া হবে।</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 124190,
        "last_updated": null
    },
    {
        "banglaURN": 6025040,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": null,
        "babNumber": 1364,
        "babName": null,
        "hadithNumber": 2504,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, কেউ (শরীকী) গোলাম হতে একটা অংশ আযাদ করে দিলে সম্পূর্ণ গোলামটাই আযাদ হয়ে যাবে। যদি তার কাছে (প্রয়োজনীয়) অর্থ থাকে (তাহলে সেখান হতে অন্য অংশীদারদের ক্ষতিপূরণ দেয়া হবে) অন্যথায় অতিরিক্ত কষ্ট না চাপিয়ে তাকে উপার্জন করতে বলা হবে।</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 124200,
        "last_updated": null
    },
    {
        "banglaURN": 6025051,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "",
        "babNumber": 1365,
        "babName": "",
        "hadithNumber": 2505,
        "hadithSanad": "",
        "hadithText": "জাবির ও ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এবং তাঁর সাহাবীগন ৪ঠা যিলহজ্জ ভোরে শুধু হজ্জের ইহরাম বেঁধে মক্কায় এসে পৌছলেন। কিন্তু আমরা মক্কায় এসে পৌছলে তিনি আমাদেরকে হজ্জের ইহরামকে ‘উমরা-তে পরিবর্তিত করার আদেশ দিলেন। তখন আমরা হজ্জকে ‘উমরা-তে পরিবর্তিত করলাম। তিনি আমাদেরকে স্ত্রীদের সাথে সহবাসেরও অনুমতি দিলেন। এ বিষয়ে কেউ কথা ছড়ালো (অধস্তন রাবী) আতা (রহঃ) বলেন, জাবির (রাঃ) বলেছেন, আমাদের মধ্যে কেউ কেউ স্ত্রীর সাথে সঙ্গম করে মিনায় যাবে। এ কথা বলে জাবির (রাঃ) নিজের হাত লজ্জাস্থানের দিকে ইঙ্গিত করে দেখালেন। এ খবর নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কানে পৌছলে তিনি দাঁড়িয়ে ভাষণ দিলেন। আমি শুনতে পেয়েছি যে, লোকেরা এটা সেটা বলছে। আল্লাহর কসম! আমি তাদের চেয়ে অধিক পরহেযগার এবং অধিক আল্লাহ ভীরু। পরে যা জেনেছি তা আগে ভাগে জানতে পারলে হাদী (হজ্জের কুরবানীর জন্তু) সাথে নিয়ে আসতাম না। আর সাথে হাদী না থাকলে আমিও ইহরাম হতে হালাল হয়ে যেতাম। তখন সুরাকা ইবনু মালিক ইবনু জু’সুম (রাঃ) দাঁড়িয়ে বললেন, হে আল্লাহর রসুল! এ হুকুম শুধু আমাদের জন্য, না এটা সর্বকালের জন্য। তিনি বললেন, না, বরং সর্বকালের জন্য [রাবী আতা (রহঃ)] বলেন, পরে ‘আলী ইবনু আবূ তালিব (রাঃ) (ইয়ামান থেকে) মক্কায় এলেন। দুই রাবীর একজন বলেন যে, ‘আলী (রাঃ) বলেছেন, আমি রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর অনুরূপ হজ্জ করব। অপরজনের মতে তিনি বললেন, আমি রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর অনুরূপ ইহরাম বাঁধলাম। ফলে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাকে ইহরাম অবস্থায় থাকার নির্দেশ দিলেন এবং তাকেও হাদী এর মধ্যে শরীক করে দিলেন।</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 124211,
        "last_updated": null
    },
    {
        "banglaURN": 6025070,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": null,
        "babNumber": 1366,
        "babName": null,
        "hadithNumber": 2507,
        "hadithSanad": "",
        "hadithText": "রাফি‘ ইবনু খাদীজ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, তিহামার অন্তর্গত যুলহুলায়ফা নামক স্থানে আমারা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সাথে অবস্থান করছিলাম। সে সময় আমরা (গনীমতের অংশ হিসাবে) কিছু বকরী কিংবা উট পেয়ে গেলাম। সাহাবীগণ (অনুমতির অপেক্ষা না করেই) তাড়াহুড়া করে পাত্রে গোশত চড়িয়ে দিলেন। পরে রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এসে পাত্রগুলো উল্টিয়ে ফেলার নির্দেশ দিলেন। (বন্টনকালে) প্রতি দশটি বকরীকে তিনি একটি উটের সমান ধার্য করলেন। ইতিমধ্যে একটি উট পালিয়ে গেল। সে সময় দলে ঘোড়ার সংখ্যাও ছিল খুব অল্প। তাই একজন তীর ছুঁড়ে সেটাকে আটকালেন। তখন রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, দেখ পলায়নপর বন্য জন্তুদের মতো এই গৃহপালিত পশুগুলোর মধ্যেও কোন কোনটা পলায়নপর স্বভাব বিশিষ্ট। কাজেই সেগুলোর মধ্যে যেটা তোমাদের উপর প্রবল হয়ে উঠবে তার সাথে এরূপই করবে। [রাবী আবায়াহ (রহঃ)] বলেন, আমার দাদা বললেন, হে আল্লাহ্‌র রসূল! আমরা আশংকা করি; আগামীকাল হয়ত আমরা শক্রর মুখোমুখী হব। আমাদের সাথে তো কোন ছুরি নেই। এমতাবস্থায় আমরা কি বাঁশের ধারালো কঞ্চি দিয়ে যবেহ করতে পারি? তিনি বললেন, যে রক্ত বের করে দেয় তা দিয়ে দ্রুত কর। যা আল্লাহ্‌র নাম নিয়ে যবেহ হয়, তা তোমরা খেতে পার। তবে তা যেন দাঁত বা নখ না হয়। তোমাদের আমি এর কারণ বলছি, দাঁততো হাড় আর নখ হল হাবশীদের ছুরি।</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 124230,
        "last_updated": null
    },
    {
        "banglaURN": 6024971,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "",
        "babNumber": 1360,
        "babName": null,
        "hadithNumber": 2497,
        "hadithSanad": "",
        "hadithText": "আবূ মুসলিম (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আবুল মিনহাল (রহঃ)-কে মুদ্রার নগদ বিনিময় সম্পর্কে জিজ্ঞেস করলাম। তিনি বললেন, আমি এবং আমার এক অংশীদার একবার কিছু মুদ্রা নগদে ও বাকিতে বিনিময় করেছিলাম। এরপর বারা‘ ইবনু ‘আযিব (রাঃ) আমাদের কাছে এলে আমরা তাকে (সে সম্পর্কে) জিজ্ঞেস করলাম। তিনি বললেন, আমি এবং আমার অংশীদার যায়দ ইবনু আরকাম (রাঃ) এরূপ করেছিলাম। পরে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে সে সম্পর্কে জিজ্ঞেস করায় তিনি বললেন, নগদে যা বিনিময় করেছ, তা বহাল রাখ, আর বাকীতে যা বিনিময় করেছ, তা ফিরিয়ে নাও।</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 124140,
        "last_updated": null
    }
]