[
    {
        "banglaURN": 6031580,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2006,
        "babName": null,
        "hadithNumber": 3158,
        "hadithSanad": "",
        "hadithText": "মিস্‌ওয়ার ইব্‌নু মাখরামা (রাঃ) থেকে বর্ণিতঃ ‘আম্‌র ইব্‌নু আউফ আনসারী (রাঃ) যিনি বনী আমির ইব্‌নু লুয়াইয়ের মিত্র ছিলেন এবং বদর যুদ্ধে অংশ নিয়েছিলেন, তিনি তাঁকে বলেছেন যে, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আবূ ‘উবাইদাহ ইব্‌নু জাররাহ (রাঃ)-কে বাহরাইনের জিযইয়াহ আদায় করার জন্য পাঠালেন। আর রসূলূল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বাহরাইনবাসীদের সঙ্গে সন্ধি করেছিলেন এবং আলা ইব্‌নু হাযরামী (রাঃ)-কে তাদের আমীর নিযুক্ত করেছিলেন। আবূ ‘উবাইদাহ (রাঃ) বাহরাইন হতে অর্থ সম্পদ নিয়ে এলেন। আনসারগণ আবূ ‘উবাইদাহর আগমন বার্তা শুনে আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সঙ্গে ফজরের সলাতে সবাই হাযির হলেন। যখন আল্লাহর রসূল তাঁদের নিয়ে ফাজ্‌রের সলাত আদায় করে ফিরলেন, তখন তারা তাঁর সামনে হাযির হলেন। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাদের দেখে মুচকি হাসলেন এবং বললেন, আমার মনে হয় তোমরা শুনেছ, আবূ ‘উবাইদাহ (রাঃ) কিছু নিয়ে এসেছেন। তারা বললেন, হ্যাঁ, হে আল্লাহর রসূল। আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, ‘সুসংবাদ গ্রহণ কর এবং যা তোমাদের খুশি করে তাঁর আকাঙ্ক্ষা রাখ। আল্লাহ্‌র কসম! আমি তোমাদের ব্যাপারে দারিদ্রের ভয় করি না। কিন্তু তোমাদের ব্যাপারে এ আশঙ্কা করি যে, তোমাদের উপর দুনিয়া এরূপ প্রসারিত হয়ে পড়বে যেমন তোমাদের অগ্রবর্তীদের উপর প্রসারিত হয়েছিল। আর তোমরাও দুনিয়ার প্রতি আকৃষ্ট হয়ে পড়বে, যেমন তারা আকৃষ্ট হয়েছিল। আর তা তোমাদের বিনাশ করবে, যেমন তাদের বিনাশ করেছে।’</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 128740,
        "last_updated": null
    },
    {
        "banglaURN": 6031610,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2007,
        "babName": null,
        "hadithNumber": 3161,
        "hadithSanad": "",
        "hadithText": "আবূ হুমাইদ সা’ঈদী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সঙ্গে তাবুক যুদ্ধে অংশ নিয়েছি। তখন আয়লাহ্‌র অধিপতি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর জন্য একটি সাদা রঙ এর খচ্চর হাদিয়া দিল আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাকে চাদর দান করলেন এবং এলাকা তারই জন্য লিখে দিলেন।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 128770,
        "last_updated": null
    },
    {
        "banglaURN": 6031620,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2008,
        "babName": null,
        "hadithNumber": 3162,
        "hadithSanad": "",
        "hadithText": "জুয়াইরিয়াহ ইব্‌নু কুদামাহ তামীমী (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি ‘উমার ইব্‌নু খাত্তাব (রাঃ)-কে বললাম, ‘হে আমীরুল মুমিনীন! আমাদের কিছু অসীয়্যাত করুন।’ তিনি বললেন, ‘আমি তোমাদেরকে আল্লাহ্‌র ওয়াদা রক্ষার অসিয়্যাত করছি। কারণ তা হল তোমাদের নবীর ওয়াদা এবং তোমাদের পরিবার-পরিজনের জীবিকা।’</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 128780,
        "last_updated": null
    },
    {
        "banglaURN": 6031630,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2009,
        "babName": null,
        "hadithNumber": 3163,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্‌নু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বাহরাইনের ভূমি লিখে দেয়ার জন্য আনসারদের ডাকলেন। তখন তাঁরা বললেন, না, আল্লাহ্‌র কসম! আমরা সে পর্যন্ত গ্রহণ করব না, যে পর্যন্ত আপনি আমাদের ভাই কুরাইশদের জন্যও একইভাবে লিখে না দেন। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, এ সম্পদ তো তাদের জন্য যতক্ষণ আল্লাহ্‌ তা’আলা চাইবেন। কিন্তু তারা সে কথাই বলতে থাকলেন। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, আমার পরে দেখতে পাবে যে, অন্যদেরকে তোমাদের উপর প্রাধান্য দেয়া হচ্ছে। তখন তোমরা আমার সঙ্গে হাওযে মিলিত হওয়া পর্যন্ত সবর করবে।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 128790,
        "last_updated": null
    },
    {
        "banglaURN": 6031660,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2010,
        "babName": null,
        "hadithNumber": 3166,
        "hadithSanad": "",
        "hadithText": "‘আব্দুল্লাহ ইব্‌নু ‘আমর (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, ‘যে ব্যক্তি কোন জিম্মীকে কতল করে, সে জান্নাতের ঘ্রাণ পাবে না। যদিও জান্নাতের ঘ্রাণ চল্লিশ বছরের দূরত্ব হতে পাওয়া যাবে।’</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 128820,
        "last_updated": null
    },
    {
        "banglaURN": 6031670,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2011,
        "babName": null,
        "hadithNumber": 3167,
        "hadithSanad": "",
        "hadithText": "আবূ হুরাইরাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, একবার আমরা মাসজিদে নববীতে উপবিষ্ট ছিলাম। এ সময় আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বের হলেন এবং বললেন, তোমরা ইয়াহূদীদের কাছে চল। আমরা চললাম এবং তাদের পাঠকেন্দ্রে পৌঁছলাম। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাদের উদ্দেশ্যে বললেন, তোমরা ইসলাম গ্রহণ কর, তাহলে নিরাপত্তা পাবে আর জেনে রাখ, পৃথিবী আল্লাহ্‌ তা’আলা ও তাঁর রসূলের। আমি ইচ্ছে করেছি, আমি তোমাদের এ দেশ হতে নির্বাসিত করব। যদি তোমাদের কেউ তাদের মালের বিনিময়ে কিছু পায়, তবে সে যেন তা বিক্রি করে ফেলে। আর জেনে রাখ, পৃথিবী আল্লাহ্‌ তা’আলা ও তাঁর রসূলের।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 128830,
        "last_updated": null
    },
    {
        "banglaURN": 6031680,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2011,
        "babName": null,
        "hadithNumber": 3168,
        "hadithSanad": "",
        "hadithText": "সা’ঈদ ইব্‌নু জুবাইর (রাঃ) থেকে বর্ণিতঃ তিনি ইব্‌নু ‘আব্বাস (রাঃ)-কে বলতে শুনেছেনঃ বৃহস্পতিবার! তুমি জান কি বৃহস্পতিবার কেমন দিন? এ বলে তিনি এমনভাবে কাঁদলেন যে, তাঁর অশ্রুতে কঙ্কর ভিজে গেল। আমি বললাম, হে ইব্‌নু ‘আব্বাস (রাঃ)! বৃহস্পতিবার দিন কী হয়েছিল? তিনি বললেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর রোগকষ্ট বৃদ্ধি পেয়েছিল। তখন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছিলেন, আমার নিকট গর্দানের হাড় নিয়ে এস, আমি তোমাদের জন্য এমন একটি লিপি লিখে দিব অতঃপর তোমরা কখনো পথভ্রষ্ট হবে না। তখন উপস্থিত সাহাবীগণের বাদানুবাদ হল। অথচ নবীর সামনে বাদানুবাদ করা শোভনীয় নয়। সাহাবীগন বললেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কী হয়েছে? তিনি কি বলতে ভুলে গেলেন? তোমরা আবার জিজ্ঞেস করে দেখ। তখন তিনি বললেন, আমাকে ছেড়ে দাও। আমি যে অবস্থায় আছি, তা তোমরা আমাকে যেদিকে ডাকছ তার চেয়ে উত্তম। অতঃপর তিনি তাঁদের তিনটি বিষয়ে আদেশ দিলেন। (১) মুশরিকদের আরব উপদ্বীপ হতে বের করে দিবে, (২) বহিরাগত প্রতিনিধিদের সেভাবে উপঢৌকন দিবে যেভাবে আমি তাদের দিতাম। তৃতীয়টি উত্তম ছিল হয়ত তিনি সে ব্যাপারে নীরব থেকেছেন, নতুবা তিনি বলেছিলেন, আমি ভুলে গিয়েছি। সুফ্‌ইয়ান (রহঃ) বলেন, এই উক্তিটি বর্ণনাকারী সুলাইমান (রহঃ)-এর।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 128840,
        "last_updated": null
    },
    {
        "banglaURN": 6031690,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2012,
        "babName": null,
        "hadithNumber": 3169,
        "hadithSanad": "",
        "hadithText": "আবূ হুরাইরাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, যখন খায়বার বিজিত হয়, তখন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে একটি (ভুনা) বকরী হাদিয়া দেয়া হয়; যাতে বিষ ছিল। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আদেশ দিলেন যে, এখানে যত ইয়াহূদী আছে, সকলকে একত্র কর। তাদের সকলকে তাঁর সামনে একত্র করা হল। তখন তিনি বললেন, ‘আমি তোমাদের একটি প্রশ্ন করব। তোমরা কি আমাকে তার সত্য উত্তর দিবে?’ তারা বলল, ‘হ্যাঁ, সত্য উত্তর দিব।’ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) জিজ্ঞেস করলেন, ‘তোমাদের পিতা কে?’ তারা বলল, ‘অমুক’। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, ‘তোমরা মিথ্যা বলেছ, বরং তোমাদের পিতা অমুক।’ তারা বলল, ‘আপনিই ঠিক বলেছেন।’ তখন তিনি বললেন, ‘আমি যদি তোমাদের একটি প্রশ্ন করি, তোমরা কি তার সঠিক উত্তর দিবে?’ তারা বলল, ‘হ্যাঁ, দিব, হে আবুল কাসিম! আর যদি আমরা মিথ্যা বলি, তবে আপনি আমাদের মিথ্যা ধরে ফেলবেন, যেমন আমাদের পিতা সম্পর্কে আমাদের মিথ্যা ধরে ফেলেছেন।’ তখন তিনি তাদের জিজ্ঞেস করলেন, ‘কারা জাহান্নামবাসী?’ তারা বলল, ‘আমরা তথায় অল্প কিছুদিন অবস্থান করব, অতঃপর আপনারা আমাদের পেছনে সেখানে থেকে যাবেন।’ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, ‘দূর হও, তোমরাই সেখানে থাকবে। আল্লাহ্‌র কসম! আমরা কখনো তাতে তোমাদের স্থলাভিষিক্ত হব না।’ অতঃপর আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, ‘আমি যদি তোমাদের একটি প্রশ্ন করি, তোমরা কি তার সঠিক উত্তর দিবে?’ তারা বলল, ‘হ্যাঁ, হে আবুল কাসিম!’ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) জিজ্ঞেস করলেন, ‘তোমরা কি এ বকরীটিতে বিষ মিশিয়েছ? তারা বলল, ‘হ্যাঁ।’ তিনি বললেন, ‘কিসে তোমাদের এ কাজে উদ্বুদ্ধ করল?’ তারা বলল, ‘আমরা চেয়েছি আপনি যদি মিথ্যাচারী হন, তবে আমরা আপনার নিকট হতে স্বস্তি লাভ করব। আর আপনি যদি নবী হন তবে তা আপনার কোন ক্ষতি করবে না।’</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 128850,
        "last_updated": null
    },
    {
        "banglaURN": 6031700,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2013,
        "babName": null,
        "hadithNumber": 3170,
        "hadithSanad": "",
        "hadithText": "আসিম (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আনাস (রাঃ)-কে কুনূত সম্পর্কে জিজ্ঞেস করলাম। তিনি বললেন, রুকুর আগে। আমি বললাম, অমুক তো বলে যে, আপনি রুকুর পরে বলেছেন। তিনি বললেন, সে মিথ্যা বলেছে। অতঃপর তিনি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে বর্ণনা করেন যে, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এক মাস পর্যন্ত রুকুর পরে কুনূত পড়েন। তিনি বানূ সুলাইম গোত্রসমূহের বিরুদ্ধে দু’আ করেছিলেন। আনাস (রাঃ) বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) চল্লিশজন কিংবা সত্তর জন ক্বারী কয়েকজন মুশরিকদের কাছে পাঠালেন। তখন বানূ সুলাইমের লোকেরা তাঁদের হামলা করে তাঁদের হত্যা করে। অথচ তাদের এবং আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর মধ্যে সন্ধি ছিল। আনাস (রাঃ) বলেন, আমি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে এ ক্বারীদের জন্য যতটা ব্যথিত দেখেছি আর কারো জন্য এতখানি ব্যথিত দেখিনি।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 128860,
        "last_updated": null
    },
    {
        "banglaURN": 6031710,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2014,
        "babName": null,
        "hadithNumber": 3171,
        "hadithSanad": "",
        "hadithText": "উম্মু হানী বিনতে আবূ তালিব (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, মাক্কাহ বিজয়ের বছর আমি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট গেলাম। তখন তাঁকে এমন অবস্থায় পেলাম যে, তিনি গোসল করছিলেন এবং তাঁর মেয়ে ফাতিমাহ (রাঃ) তাঁকে পর্দা করছিলেন। আমি তাঁকে সালাম করলাম। তিনি বললেন, ইনি কে? আমি বললাম, আমি উম্মু হানী বিনতে আবূ তালিব। তখন তিনি বললেন, মারহাবা হে উম্মু হানী! যখন তিনি গোসল হতে ফারেগ হলেন, একখানি কাপড়ে শরীর ঢেকে দাঁড়িয়ে আট রাক’আত সলাত আদায় করলেন। অতঃপর আমি বললাম, হে আল্লাহ্‌র রসূল! আমার সহোদর ভাই ‘আলী (রাঃ) হুবাইরার অমুক পুত্রকে হত্যা করার সংকল্প করেছে, আর আমি তাকে আশ্রয় দিয়েছি। তখন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, হে উম্মু হানী! তুমি যাকে আশ্রয় দিয়েছো, আমিও তাকে আশ্রয় দিয়েছি। উম্মু হানী (রাঃ) বলেন, এটা চাশ্‌তের সময় ছিল।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 128870,
        "last_updated": null
    },
    {
        "banglaURN": 6031720,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2015,
        "babName": null,
        "hadithNumber": 3172,
        "hadithSanad": "",
        "hadithText": "ইব্‌রাহীম তাইমী (রহঃ)-এর পিতা থেকে বর্ণিতঃ তিনি বলেন, ‘আলী (রাঃ) আমাদের সামনে ভাষণ দিলেন এবং বললেন, আমাদের নিকট আল্লাহ্‌র কিতাব ও এই সহীফায় যা আছে, এছাড়া অন্য কোন কিতাব নেই, যা আমরা পাঠ করে থাকি। তিনি বলেন, এ সহীফায় রয়েছে, যখমের দণ্ড বিধান, উটের বয়সের বিবরণ এবং আইর পর্বত থেকে সওর পর্যন্ত মাদীনাহ্‌ হারাম হবার বিধান। যে ব্যক্তি এর মধ্যে বিদ্‌’আত উদ্ভাবণ করে কিংবা বিদ্‌আতীকে আশ্রয় দেয়, তার উপর আল্লাহ্‌, ফেরেশতা ও সকল মানুষের অভিসম্পাত। আল্লাহ তার কোন নফল ও ফরয ‘ইবাদাত কবূল করেন না। আর যে নিজ মাওলা ব্যতীত অন্যকে মাওলা হিসেবে গ্রহণ করে, তার উপর একই রকম লা’নত। আর নিরাপত্তা দানের ক্ষেত্রে সর্বস্তরের মুসলিমগণ একইভাবে দায়িত্বশীল এবং যে ব্যক্তি কোন মুসলিমের চুক্তি ভঙ্গ করে তার উপরও তেমনি অভিসম্পাত।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 128880,
        "last_updated": null
    },
    {
        "banglaURN": 6031730,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2017,
        "babName": null,
        "hadithNumber": 3173,
        "hadithSanad": "",
        "hadithText": "সাহ্‌ল ইব্‌নু আবূ হাসমাহ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, ‘আবদুল্লাহ ইব্‌নু সাহ্‌ল ও মুহায়্যিসাহ ইব্‌নু মাস’ঊদ ইব্‌নু যায়দ (রাঃ) খায়বারের দিকে গেলেন। তখন খায়বারের ইয়াহূদীদের সঙ্গে সন্ধি ছিল। পরে তাঁরা উভয়ে আলাদা হয়ে গেলেন। অতঃপর মুহায়্যিসাহ ‘আবদুল্লাহ ইব্‌নু সাহলের নিকট আসেন এবং বলেন যে, তিনি মৃত্যু যন্ত্রণায় ছটফট করছেন। তখন মুহাইয়িসাহ তাঁকে দাফন করলেন। অতঃপর মদিনায় এলেন। ‘আবদুর রহমান ইব্‌নু সাহল ও মাস’উদের দুই পুত্র মুহায়্যিসাহ ও হুওয়ায়্যিসাহ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট গেলেন। ‘আবদুর রহমান (রাঃ) কথা বলার জন্য এগিয়ে এলেন। তখন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, বড়কে আগে বলতে দাও, বড়কে আগে বলতে দাও। আর ‘আবদুর রহমান ইব‌্নু সাহল (রাঃ) ছিলেন বয়সে ছোট। এতে তিনি চুপ রইলেন এবং মুহায়্যিসাহ ও হুওয়ায়্যিসাহ উভয়ে কথা বললেন। আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, তোমরা কি শপথ করে বলবে এবং তোমাদের হত্যাকারীর অথবা বলেছেন, তোমাদের সঙ্গীর রক্ত পণের অধিকারী হবে? তারা বললেন, আমরা কিভাবে শপথ করব? আমরা তো উপস্থিত ছিলাম না এবং স্বচক্ষে দেখিনি। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, তবে ইয়াহূদীরা পঞ্চাশটি শপথের মাধ্যমে তোমাদের নিকট হতে অব্যাহতি লাভ করবে। তাঁরা বললেন, তারা তো কাফির সম্প্রদায়। আমরা কিরূপে তাদের শপথ গ্রহণ করতে পারি? তখন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) নিজের পক্ষ হতে ‘আবদুর রাহমানকে তাঁর ভাইয়ের দীয়াত পরিশোধ করলেন।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 128890,
        "last_updated": null
    },
    {
        "banglaURN": 6031740,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2018,
        "babName": null,
        "hadithNumber": 3174,
        "hadithSanad": "",
        "hadithText": "আবূ সুফ্‌ইয়ান ইব্‌নু হারব ইব্‌নু উমায়্যাহ (রাঃ) থেকে বর্ণিতঃ হিরাকল তাঁকে ডেকে পাঠালেন, কুরাইশদের সেই কাফেলাসহ যারা সিরিয়ায় বাণিজ্যের উদ্দেশ্যে গিয়েছিলেন। এটা কুরাইশ কাফিরদের সাথে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এর চুক্তি থাকাকালীন ঘটনা।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 128900,
        "last_updated": null
    },
    {
        "banglaURN": 6031750,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2019,
        "babName": null,
        "hadithNumber": 3175,
        "hadithSanad": "",
        "hadithText": "‘আয়িশাহ (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে যাদু করা হয়েছিল। ফলে তিনি ধারণা করতেন যে, তিনি এ কাজ করেছেন অথচ তিনি তা করেননি।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 128910,
        "last_updated": null
    },
    {
        "banglaURN": 6031760,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2020,
        "babName": null,
        "hadithNumber": 3176,
        "hadithSanad": "",
        "hadithText": "‘আউফ ইব্‌নু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি তাবুক যুদ্ধে আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট এলাম। তিনি তখন একটি চামড়ার তৈরী তাঁবুতে ছিলেন। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, ক্বিয়ামাতের আগের ছয়টি নিদর্শন গণনা করে রাখো। আমার মৃত্যু, অতঃপর বায়তুল মুকাদ্দাস বিজয়, অতঃপর তোমাদের মধ্যে ঘটবে মহামারী, বকরীর পালের মহামারীর মত, সম্পদের প্রাচুর্য, এমনকি এক ব্যক্তিকে একশ’ দীনার দেয়ার পরেও সে অসন্তুষ্ট থাকবে। অতঃপর এমন এক ফিত্‌না আসবে যা আরবের প্রতিটি ঘরে প্রবেশ করবে। অতঃপর যুদ্ধ বিরতির চুক্তি-যা তোমাদের ও বানী আসফার বা রোমকদের মধ্যে সম্পাদিত হবে। অতঃপর তারা বিশ্বাসঘাতকতা করবে এবং আশিটি পতাকা উড়িয়ে তোমাদের বিপক্ষে আসবে; প্রত্যেক পতাকার নীচে থাকবে বার হাজার সৈন্য।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 128920,
        "last_updated": null
    },
    {
        "banglaURN": 6031770,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2021,
        "babName": null,
        "hadithNumber": 3177,
        "hadithSanad": "",
        "hadithText": "আবূ হুরাইরাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আবূ বকর (রাঃ) আমাকে সে সকল লোকের সঙ্গে পাঠান যাঁরা মিনায় কুরবানীর দিন এ ঘোষনা দিবেনঃ এ বছরের পর কোন মুশরিক হাজ্জ করতে পারবে না আর বায়তুল্লাহ শরীফে কোন নগ্ন ব্যক্তি তাওয়াফ করতে পারবে না আর কুরবানীর দিনই হল হজ্জে আকবারের দিন। একে আকবার এ জন্য বলা হয় যে, লোকেরা (উমরাহ্‌কে) ‌হজ্জে আসগার (ছোট) বলে। আবূ বকর (রাঃ) সে বছর মুশরিকদের চুক্তি রহিত করে দেন। কাজেই হুজ্জাতুল বিদার বছর যখন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হাজ্জ করেন, তখন কোন মুশরিক হাজ্জ করেনি।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 128930,
        "last_updated": null
    },
    {
        "banglaURN": 6031780,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2022,
        "babName": null,
        "hadithNumber": 3178,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ ইব্‌নু আম্‌র (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, চারটি স্বভাব যার মধ্যে পাওয়া যাবে, সে খালিস মুনাফিক বলে গন্য হবে। যে ব্যক্তি কথা বলার সময় মিথ্যা বলে, আর অঙ্গীকার করলে ভঙ্গ করে, প্রতিশ্রুতি দিলে বিশ্বাসঘাতকতা করে, যখন ঝগড়া করে গালাগালি করে। যার মধ্যে এগুলোর কোন একটি স্বভাব পাওয়া যাবে, তার মধ্যে নিফাকের একটি স্বভাব পাওয়া গেল, যতক্ষণ না সে তা পরিত্যাগ করে।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 128940,
        "last_updated": null
    },
    {
        "banglaURN": 6031790,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2022,
        "babName": null,
        "hadithNumber": 3179,
        "hadithSanad": "",
        "hadithText": "‘আলী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে কুরআন এবং এ কাগজে যা লিখা আছে তা ছাড়া কোন কিছু লিপিবদ্ধ করিনি। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, আয়ির পর্বত হতে এ পর্যন্ত মাদীনাহ্‌র হরম এলাকা। যে কেউ দ্বীনের ব্যাপারে বিদ্‌’আত উদ্ভাবণ করে কিংবা কোন বিদ্‌’আতীকে আশ্রয় দিবে তার উপর আল্লাহ তা’আলা, ফেরেশতা ও সকল মানুষের লা’নত। তার কোন ফরয কিংবা নফল ‘ইবাদাত গৃহীত হবে না। আর সকল মুসলমানের পক্ষ হতে নিরাপত্তা একই স্তরের। সাধারন মুসলিম নিরাপত্তা দিলে সকলকে তা রক্ষা করতে হবে। যে ব্যক্তি কোন মুসলমানের দেয়া নিরাপত্তা বাধাগ্রস্ত করবে তার উপর আল্লাহ তা’আলার লা’নত এবং ফেরেশতামণ্ডলী ও সকল মানুষের। তার কোন নফল কিংবা ফরয ‘ইবাদাত গৃহীত হবে না। আর যে স্বীয় মনিবের অনুমতি ব্যতীত অন্যদের সঙ্গে বন্ধুত্বের চুক্তি করে, তার উপর আল্লাহ তা’আলার লা’নত এবং ফেরেশতামণ্ডলী ও সকল মানুষের। তার কোন নফল কিংবা ফরয ‘ইবাদত কবূল হবে না।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 128950,
        "last_updated": null
    },
    {
        "banglaURN": 6031800,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2022,
        "babName": null,
        "hadithNumber": 3180,
        "hadithSanad": "",
        "hadithText": "আবূ হুরাইরাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, অমুসলিমদের নিকট হতে (জিযইয়াহ স্বরূপ) একটি দীনার বা দিরহামও তোমরা পাবে না, তখন তোমাদের কী অবস্থা হবে? তাকে বলা হল, হে আবূ হুরায়রা্‌ (রাঃ) আপনি কিভাবে মনে করেন যে, এমন অবস্থা দেখা দিবে, তিনি বললেন, হ্যাঁ, শপথ সে মহান সত্তার যাঁর হাতে আবূ হুরায়রা্‌র প্রাণ, যিনি সত্যবাদী ও সত্যবাদী বলে স্বীকৃত তাঁর উক্তি থেকে আমি বলছি। লোকেরা বলল, কী কারণে এমন হবে? তিনি বলেন, আল্লাহ তা’আলা ও তাঁর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর দেয়া নিরাপত্তা ক্ষুণ্ণ করা হবে। ফলে আল্লাহ্‌ তা’আলা জিম্মীদের হৃদয়কে কঠিন করে দিবেন; তারা তাদের হাতের সম্পদ দিবে না।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 128960,
        "last_updated": null
    },
    {
        "banglaURN": 6031810,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2023,
        "babName": null,
        "hadithNumber": 3181,
        "hadithSanad": "",
        "hadithText": "আ’মাশ (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আবূ ওয়াইল (রাঃ)-কে জিজ্ঞেস করলাম, আপনি কি সিফ্‌ফীনের যুদ্ধে হাযির ছিলেন? তিনি বললেন, হ্যাঁ, আমি সাহ্‌ল ইব্‌নু হুনাইফ (রাঃ)-কে বলতে শুনেছি, তোমরা নিজ মতামতকে বিশুদ্ধ মনে করো না। আমি নিজেকে আবূ জান্দালের দিন দেখেছি। আমি যদি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর আদেশ রদ করতে পারতাম, তবে তা নিশ্চয়ই রদ করতাম। আসলে আমরা যখনই কোন ভয়ানক অবস্থায় আমাদের স্কন্ধে তলোয়ার তুলে নিয়েছি, তখন তা আমাদের জন্য সহজ করে দেয়া হয়েছে এমনভাবে যা আমরা উপলব্ধি করেছি। কিন্তু বর্তমান অবস্থা অন্যরূপ।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 128970,
        "last_updated": null
    },
    {
        "banglaURN": 6031820,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2023,
        "babName": null,
        "hadithNumber": 3182,
        "hadithSanad": "",
        "hadithText": "আবূ ওয়ায়িল (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা সিফ্‌ফীন যুদ্ধে অংশ নিয়েছিলাম। সে সময় সাহ্‌ল ইবনু হুনাইফ (রাঃ) দাঁড়িয়ে বললেন, হে লোক সকল! তোমরা নিজ মতামতকে সঠিক মনে করো না। আমরা হুদায়বিয়ার দিন রসূলূল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সঙ্গে ছিলাম। যদি আমরা যুদ্ধ করা সঠিক মনে করতাম, তবে আমরা যুদ্ধ করতাম। পরে ‘উমার ইব্‌নু খাত্তাব (রাঃ) এসে বললেন, হে আল্লাহর রসূল! আমরা কি হকের উপর নই এবং তারা বাতিলের উপর নয়? আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, হ্যাঁ। অতঃপর তিনি বললেন, আমাদের নিহত ব্যক্তিগণ কি জান্নাতী নন এবং তাদের নিহত ব্যক্তিরা জাহান্নামী নয়? আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, হ্যাঁ, আমাদের নিহতগণ অবশ্যই জান্নাতী। ‘উমার (রাঃ) বললেন, তবে কী কারণে আমরা আমাদের দ্বীনের ব্যাপারে হীনতা স্বীকার করব? আমরা কি ফিরে যাব? অথচ আল্লাহ্‌ তা’আলা আমাদের ও তাদের মধ্যে কোন ফায়সালা করেননি? আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, হে ইব্‌নু খাত্তাব! আমি নিশ্চয়ই আল্লাহ্‌র রসূল, আল্লাহ আমাকে কখনো হেয় করবেন না। অতঃপর ‘উমার (রাঃ) আবূ বকর (রাঃ)-এর নিকট গেলেন এবং নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট যা বলেছিলেন, তা তাঁর নিকট বললেন। তখন আবূ বকর (রাঃ) বললেন, তিনি আল্লাহ্‌র রসূল, আল্লাহ তা’আলা কখনও তাঁকে অপদস্থ করবেন না। অতঃপর সূরা ফাত্‌হ নাযিল হয়। তখন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তা শেষ পর্যন্ত ‘উমার (রাঃ) কে পাঠ করে শোনান। ‘উমার (রাঃ) বললেন, হে আল্লাহর রসূল! এটা কি বিজয়? আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, হ্যাঁ।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 128980,
        "last_updated": null
    },
    {
        "banglaURN": 6031830,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2023,
        "babName": null,
        "hadithNumber": 3183,
        "hadithSanad": "",
        "hadithText": "আসমা বিনতে আবূ বাক্‌র (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমার মা, যিনি মুশরিক ছিলেন, তাঁর পিতার সঙ্গে আমার নিকট এলেন, যখন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সঙ্গে কুরাইশরা চুক্তি করেছিল। তখন আসমা (রাঃ) আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে জিজ্ঞেস করলেন, ‘হে আল্লাহর রসূল! আমার মা আমার কাছে এসেছেন। তিনি ইসলামের প্রতি আসক্ত নন। আমি কি তাঁর সঙ্গে ভাল ব্যবহার করব?’ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, ‘হ্যাঁ, তাঁর সঙ্গে সদ্ব্যবহার কর।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 128990,
        "last_updated": null
    },
    {
        "banglaURN": 6031840,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2024,
        "babName": null,
        "hadithNumber": 3184,
        "hadithSanad": "",
        "hadithText": "বারাআ (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যখন ‘উমরাহ করার ইচ্ছা করেন, তখন তিনি মক্কায় আগমনের অনুমতি চেয়ে মক্কায় কাফিরদের নিকট লোক পাঠান। তারা শর্ত দেয় যে, তিনি সেখানে তিন রাতের বেশি থাকবেন না এবং অস্ত্রকে কোষে আবদ্ধ না করে প্রবেশ করবেন না। আর মাক্কাহবাসীদের কাউকে ইসলামের দাওয়াত দিবে না। বারাআ (রাঃ) বলেন, এ সকল শর্ত ‘আলী ইব্‌নু আবূ তালিব (রাঃ) লেখা শুরু করলেন এবং সন্ধিপত্রে লিখলেন, “এটা সে সন্ধিপত্র যার উপর আল্লাহ্‌র রসূল মুহাম্মদ ফায়সালা করেছেন।” তখন কাফিররা বলল, ‘আমরা যদি এ কথা মেনে নিতাম যে, আপনি আল্লাহ্‌র রসূল, তবে তো আমরা আপনাকে বাধাই দিতাম না এবং আপনার হাতে বায়’আত করে নিতাম। কাজেই এভাবে লিখুন, এটি সেই সন্ধিপত্র যার উপর মুহাম্মদ ইব্‌নু ‘আবদুল্লাহ ফায়সালা করেছেন।’ তখন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, আল্লাহ্‌র কসম! আমি মুহাম্মদ ইব্‌নু ‘আবদুল্লাহ এবং আল্লাহ্‌র কসম! আমি আল্লাহ্‌র রসূল। বারাআ (রাঃ) বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) লিখতেন না। তাই তিনি ‘আলী (রাঃ)-কে বললেন, রসূলুল্লাহ মুছে ফেল। ‘আলী (রাঃ) বললেন, আল্লাহ্‌র কসম! আমি কখনো তা মুছব না। তখন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, তবে আমাকে দেখিয়ে দাও। তখন ‘আলী (রাঃ) তাঁকে তা দেখিয়ে দিলেন এবং আল্লাহর নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তা স্বহস্তে মুছে ফেললেন। অতঃপর যখন তিনি মাক্কাহয় প্রবেশ করলেন এবং সে দিনগুলো অতীত হয়ে গেল, তখন তারা ‘আলী (রাঃ)-এর নিকট এসে বলল, তোমার সঙ্গীকে বল, যেন তিনি চলে যান। ‘আলী (রাঃ) আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে তা বললেন। তিনি বললেন, ঠিক আছে। অতঃপর তিনি যাত্রা করলেন।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 129000,
        "last_updated": null
    },
    {
        "banglaURN": 6031850,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2026,
        "babName": null,
        "hadithNumber": 3185,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ (ইব্‌নু মাস’ঊদ) (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, একদা আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সাজদাহরত ছিলেন, তাঁর আশে-পাশে কুরাইশ মুশরিকদের কিছু লোক ছিল। এ সময় ‘উকবাহ ইব্‌নু আবূ মুআইত উটনীর ভুঁড়ি এনে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর পিঠে ফেলে দেয়। ফলে তিনি তাঁর মাথা উঠাতে পারলেন না। অবশেষে ফাতিমাহ (রাঃ) এসে তাঁর পিঠ হতে তা সরিয়ে দেন আর যে ব্যক্তি এ কাজ করেছে তার বিরুদ্ধে বদদু’আ করেন। অতঃপর আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, হে আল্লাহ্‌! কুরাইশদের এ দলের বিচার আপনার উপর ন্যস্ত করলাম। হে আল্লাহ্‌! আপনি শাস্তি দিন আবূ জাহ্‌ল ইব্‌নু হিশাম, উত্‌বাহ ইব্‌নু রাবী’আহ, শায়বাহ ইব্‌নু রাবী’আহ, ‘উকবাহ ইব্‌নু আবূ মুআইত ও উমাইয়াহ ইব্‌নু খালফ (অথবা রাবী বলেছেন), উবাই ইব্‌নু খালফকে। (ইব্‌নু মাস’ঊদ (রাঃ) বলেন), আমি দেখেছি, তারা সবাই বদর যুদ্ধে নিহত হয়। তাদের সবাইকে কূপে নিক্ষেপ করা হয়, উমাইয়াহ অথবা উবাই ছাড়া। কেননা, সে ছিল মোটা দেহের। যখন তার লাশ টানা হচ্ছিল, তখন কূপে নিক্ষেপ করার পূর্বেই তার জোড়াগুলি বিচ্ছিন্ন হয়ে যায়।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 129010,
        "last_updated": null
    },
    {
        "banglaURN": 6031861,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": "",
        "babNumber": 2027,
        "babName": "",
        "hadithNumber": 3186,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ আল্লাহর নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, প্রত্যেক ওয়াদা ভঙ্গকারীর জন্য কিয়ামতের দিন একটি পতাকা হবে। একজন রাবী বলেছেন, পতাকাটি স্থাপিত হবে অপরজন বলেছেন, কিয়ামতের দিন প্রদর্শন করা হবে এবং তা দিয়ে তার পরিচয় দেয়া হবে।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 129021,
        "last_updated": null
    },
    {
        "banglaURN": 6031880,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2027,
        "babName": null,
        "hadithNumber": 3188,
        "hadithSanad": "",
        "hadithText": "ইব্‌নে ‘উমার (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছি যে, (কিয়ামতের দিন) ওয়াদা ভঙ্গের নিদর্শন হিসেবে প্রত্যেক ওয়াদা ভঙ্গকারীর জন্য একটি পতাকা স্থাপন করা হবে।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 129040,
        "last_updated": null
    },
    {
        "banglaURN": 6031890,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": null,
        "babNumber": 2027,
        "babName": null,
        "hadithNumber": 3189,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) মাক্কাহ বিজয়ের দিন বললেন, হিজরাত নেই কিন্তু জিহাদ ও নিয়্যাত রয়েছে আর যখন তোমাদের জিহাদে যাবার জন্য আহ্বান করা হবে তখন তোমরা বেড়িয়ে পড়বে। আর তিনি মাক্কাহ বিজয়ের দিন আরো বলেন, এ নগরীকে আল্লাহ তা’আলা আকাশ ও পৃথিবীর সৃষ্টির দিন থেকে সম্মানিত করেছেন। কাজেই তা আল্লাহ্‌র দেয়া সম্মানের দ্বারা ক্বিয়ামাত অবধি সম্মানিত থাকবে। আমার আগে এখানে যুদ্ধ করা কারও জন্য হালাল ছিল না, আর আমার জন্যও তা দিনের কেবল কিছু সময়ের জন্য হালাল করা হয়েছিল। অতএব, আল্লাহ্‌র দেয়া সম্মানের দ্বারা ক্বিয়ামাত পর্যন্ত তা সম্মানিত থাকবে। এখানকার কাঁটা কর্তন করা যাবে না; শিকারকে তাড়ানো যাবে না আর পথে পড়ে থাকা জিনিস কেউ উঠাবে না। তবে সে ব্যক্তি উঠাতে পারবে, যে তা ঘোষণা করবে। এখানকার ঘাস কাটা যাবে না।’ তখন ‘আব্বাস (রাঃ) বললেন, ‘হে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ইযখির ছাড়া। কেননা, তা কর্মকারের ও ঘরের কাজে লাগে।’ তখন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, ‘ইযখির ছাড়া।’</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 129050,
        "last_updated": null
    },
    {
        "banglaURN": 6031561,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": "",
        "babNumber": 2006,
        "babName": "",
        "hadithNumber": 3156,
        "hadithSanad": "",
        "hadithText": "‘আমর (ইব্‌নু দীনার) (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি জাবির ইব্‌নু যায়দ ও ‘আমর ইব্‌নু আউস (রহঃ) সহ যমযমের সিঁড়ির নিকট উপবিষ্ট ছিলাম, হিজরী সত্তর সনে যে বছর মুসআব ইব্‌নু যুবায়র (রাঃ) বসরাবাসীদের নিয়ে হাজ্জ আদায় করেছিলেন। তখন বাজালাহ্‌ তাদের উভয়কে এ হাদীস বর্ণনা করেন, আমি আহনাফের চাচা জাযই ইবনু মু’আবিয়াহ (রাঃ) -এর লেখক ছিলাম। আমাদের নিকট ‘উমার ইব্‌নু খাত্তাব (রাঃ)–এর পক্ষ হতে তাঁর মৃত্যুর এক বছর আগে একখানি পত্র আসে যে, যে সব অগ্নিপুজক মাহরামদের [১] বিবাহ বন্ধনে আবদ্ধ তাদের আলাদা করে দাও। আর ‘উমার (রাঃ) অগ্নিপূজকদের নিকট হতে জিযইয়াহ গ্রহন করতেন না।\n\n‘আমর (ইব্‌নু দীনার) (রহঃ) থেকে বর্ণিতঃ যে পর্যন্ত না ‘আবদুর রহমান ইবনু আউফ (রাঃ) এ ব্যাপারে সাক্ষ্য দিলেন যে, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হাজার এলাকার অগ্নিপূজকদের নিকট হতে তা গ্রহণ করেছেন।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 128721,
        "last_updated": null
    },
    {
        "banglaURN": 6031591,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": "",
        "babNumber": 2006,
        "babName": "",
        "hadithNumber": 3159,
        "hadithSanad": "",
        "hadithText": "জুবাইর ইব্‌নু হাইয়াহ (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, ‘উমার (রাঃ) মুশরিকদের বিরুদ্ধে যুদ্ধ করার জন্য বিভিন্ন বড় বড় শহরের দিকে সৈন্য দল প্রেরণ করলেন। সে সময় হুরমযান ইসলাম গ্রহণ করে। ‘উমার (রাঃ) তাঁকে বললেন, আমি এসব যুদ্ধের ব্যাপারে তোমার পরামর্শ গ্রহণ করতে চাই। তিনি বললেন, ঠিক আছে। এ সকল দেশ এবং দেশে মুসলিমদের দুশমন যে সব লোক বাস করছে, তাদের দৃষ্টান্ত একটি পাখির মত, যার একটি মাথা, দু’টি ডানা ও দু’টি পা রয়েছে। যদি একটি ডানা ভেঙ্গে দেয়া হয়, তবে সে পাখিটি উভয় পা, একটি ডানা ও মাথার ভরে উঠে দাঁড়াবে। যদি অপর ডানা ভেঙ্গে দেয়া হয়, তবে সে দু’টি পা ও মাথার ভরে উঠে দাঁড়াবে। আর যদি মাথা ভেঙ্গে দেয়া হয়, তবে উভয় পা, উভয় ডানা ও মাথা সবই অকেজো হয়ে যাবে। কিসরা শত্রুদের মাথা, কায়সার হল একটি ডানা, আর পারস্য অপর একটি ডানা। কাজেই মুসলিমগণকে এ আদেশ করুন, তারা যেন কিসরার উপর হামলা করে।\nবাক্‌র ও যিয়াদ (রহঃ) উভয়ে যুবাইর ইবনু হাইয়াহ (রহঃ) হতে বর্ণিত। তিনি বলেন, অতঃপর ‘উমার (রাঃ) আমাদের ডাকলেন আর আমাদের উপর নু’মান ইব্‌নু মুকাররিনকে আমীর নিযুক্ত করেন। আমরা যখন শত্রু দেশে পৌঁছলাম, কিসরার এক সেনাপতি চল্লিশ হাজার সৈন্য নিয়ে আমাদের মুকাবিলায় আসল। তখন তার পক্ষ হতে একজন দোভাষী দাঁড়িয়ে বলল, তোমাদের মধ্য থেকে একজন আমার সাথে আলোচনা করুক। তখন মুগীরাহ (ইব্‌নু শু’বাহ) (রাঃ) বললেন, যা ইচ্ছা প্রশ্ন করতে পার। সে বলল, তোমরা কারা? তিনি বললেন, আমরা আরবের লোক। দীর্ঘ দিন আমরা অতিশয় দুর্ভাগ্য এবং কঠিন বিপদে ছিলাম। ক্ষুধার জ্বালায় আমরা চামড়া ও খেজুর গুটি চুষতাম। চুল ও পশম পরিধান করতাম। বৃক্ষ ও পাথর পূজা করতাম। আমরা যখন এ অবস্থায় পতিত তখন আসমান ও যমীনের প্রতিপালক আমাদের মধ্য হতে আমাদের নিকট একজন নবী পাঠালেন। তাঁর পিতা-মাতাকে আমরা চিনি। আমাদের নবী ও আমাদের রবের রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাদেরকে তোমাদের বিরুদ্ধে যুদ্ধ করার আদেশ দিয়েছেন, যে পর্যন্ত না তোমরা এক আল্লাহ্‌ তা’আলার ‘ইবাদাত কর কিংবা জিযইয়াহ দাও। আর আমাদের নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাদের রবের পক্ষ হতে আমাদেরকে জানিয়েছেন যে, আমাদের মধ্য হতে যে নিহত হবে, সে জান্নাতে এমন নি’মাত লাভ করবে, যা কখনও দেখা যায়নি। আর আমাদের মধ্য হতে যারা জীবিত থাকবে তোমাদের গর্দানের মালিক হবে।\n\nজুবাইর ইব্‌নু হাইয়াহ (রহঃ) থেকে বর্ণিতঃ নু’মান (রহঃ) (মুগীরাহকে) বললেন, আপনাকে আল্লাহ্‌ তা’আলা এমন যুদ্ধে রসূলূল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সাথী করেছেন আর তিনি আপনাকে লজ্জিত ও অসম্মানিত করেনি আর আমিও আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সঙ্গে অনেক যুদ্ধে অংশ নিয়েছি। তাঁর নিয়ম এ ছিল যে, যদি দিনের পূর্বাহ্ণে যুদ্ধ শুরু না করতেন, তবে তিনি বাতাস প্রবাহিত হওয়া এবং সলাতের সময় হওয়া পর্যন্ত অপেক্ষা করতেন।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 128751,
        "last_updated": null
    },
    {
        "banglaURN": 6031641,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 58,
        "bookName": "",
        "babNumber": 2009,
        "babName": "",
        "hadithNumber": 3164,
        "hadithSanad": "",
        "hadithText": "জাবির ইব্‌নু ‘আব্দুল্লাহ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাকে বলেছিলেন, যদি আমার নিকট বাহরাইনের মাল আসে তবে আমি তোমাকে এ পরিমাণ, এ পরিমাণ, এ পরিমাণ দিব। পরে যখন আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ইন্তিকাল করেন আর বাহরাইনের সম্পদ এসে যায় তখন আবূ বকর (রাঃ) বললেন, আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট যে ব্যক্তির কোন ওয়াদা থাকে, সে যেন আমার নিকট আসে। তখন আমি তাঁর নিকট গেলাম এবং বললাম, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাকে বলেছিলাম, যদি আমার নিকট বাহরাইনের সম্পদে আসে, তবে আমি তোমাকে এ পরিমাণ, এ পরিমাণ ও এ পরিমাণ দিব। আবূ বকর (রাঃ) আমাকে বললেন, তুমি অঞ্জলি ভরে নাও। আমি এক অঞ্জলি উঠালাম। তিনি আমাকে বললেন, এগুলো গুণে দেখ। আমি গুণে দেখলাম যে, তাতে পাঁচশ রয়েছে। তখন তিনি আমাকে এক হাজার পাঁচশ দিলেন।\n\nআনাস (রাঃ) থেকে বর্ণিতঃ আনাস (রাঃ) হতে বর্ণনা করেন যে, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট বাহরাইনের মাল এলো। তখন তিনি বললেন, তোমরা এগুলো মাসজিদে ঢেলে দাও আর এ মাল এর আগে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট আসা মালের থেকে অনেক অধিক ছিল। এ সময় ‘আব্বাস (রাঃ) এসে বললেন, হে আল্লাহর রসূল! আমাকে দান করুন। আমি আমার এবং আকীলের মুক্তিপণ দিয়েছি। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, আচ্ছা নাও। তিনি তার কাপড়ে অঞ্জলি ভরে নিতে লাগলেন। অতঃপর তা উঠাতে চাইলেন কিন্তু উঠাতে পারলেন না। তখন তিনি বললেন, কাউকে আমার উপর এ বোঝা উঠিয়ে দিতে বলুন। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, না। তখন তিনি বললেন, আচ্ছা আপনিই আমার উপর উঠিয়ে দিন। রসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, না। তিনি তা হতে কিছু কম করলেন এবং উঠাতে চেষ্টা করলেন, কিন্তু উঠাতে পারলেন না। অতঃপর বললেন, কাউকে আমার উপর বোঝাটি উঠিয়ে দিতে বলুন। তিনি বললেন, না। তখন ‘আব্বাস (রাঃ) বললেন, আপনিই একটু আমার উপর উঠিয়ে দিন। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, না। অতঃপর তিনি আবার তা হতে কমালেন, অতঃপর কাঁধে উঠিয়ে রওনা হলেন। তাঁর এ আসক্তি দেখে বিস্ময়ের সাথে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাকিয়ে থাকলেন, যতক্ষণ না তিনি আমাদের দৃষ্টির আড়াল হলেন। রসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সে স্থানে একটি দিরহাম থাকা পর্যন্ত সেখান হতে উঠে দাঁড়াননি।</b>",
        "bookID": "58.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 128801,
        "last_updated": null
    }
]