[
    {
        "banglaURN": 6031900,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1845,
        "babName": null,
        "hadithNumber": 3190,
        "hadithSanad": "",
        "hadithText": "‘ইমরান ইব্‌নু হুসাইন (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, বনূ তামীমের একদল লোক নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট এল, তখন তিনি তাদের বললেন, হে তামীম সম্প্রদায়! সুসংবাদ গ্রহণ কর। তখন তারা বলল, আপনি তো সুসংবাদ জানিয়েছেন, এবার আমাদের দান করুন। এতে তাঁর মুখমন্ডল বিবর্ণ হয়ে গেল। এমন সময় তাঁর কাছে ইয়ামানের লোকজন এল। তখন তিনি বললেন, হে ইয়ামানবাসী! তোমরা সুসংবাদ গ্রহণ কর। কেননা তামীম সম্প্রদায়ের লোকেরা তা গ্রহণ করেনি। তারা বলল, আমরা গ্রহণ করলাম। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সৃষ্টির সূচনা এবং আরশ সম্পর্কে বর্ণনা করেন। এর মধ্যে জনৈক ব্যক্তি এসে বলল, হে ইমরান! তোমার উটনীটি পালিয়ে গেছে। হায়! আমি যদি উঠে না চলে যেতাম। [১]</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 129060,
        "last_updated": null
    },
    {
        "banglaURN": 6031910,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1845,
        "babName": null,
        "hadithNumber": 3191,
        "hadithSanad": "",
        "hadithText": "‘ইমরান ইব্‌নু হুসাইন (রাঃ) থেকে বর্ণিতঃ তিনি বলেন,আমি আমার উটনীটি দরজার সঙ্গে বেঁধে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট উপস্থিত হলাম। তখন তাঁর নিকট তামীম সম্প্রদায়ের কিছু লোক এল। তিনি বললেন, হে তামীম সম্প্রদায়! তোমরা সুসংবাদ গ্রহণ কর। উত্তরে তারা বলল, আপনি তো আমাদের সুসংবাদ দিয়েছেন, এবার আমাদেরকে কিছু দান করুন। একথা দু’বার বলল। অতঃপর তাঁর নিকট ইয়ামানের কিছু লোক আসল। তিনি তাদের বললেন, হে ইয়ামানবাসী! তোমরা সুসংবাদ গ্রহণ কর। কারণ বনূ তামীম তা গ্রহণ করেনি। তারা বলল, হে আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)! আমরা তা গ্রহণ করলাম। তারা আরও বলল, আমরা দ্বীন সম্পর্কে কিছু জিজ্ঞেস করার জন্য আপনার খেদমতে এসেছিলাম। তখন তিনি বললেন, একমাত্র আল্লাহই ছিলেন, আর তিনি ছাড়া আর কোন কিছুই ছিল না। তাঁর আরশ ছিল পানির উপরে। অতঃপর তিনি লাওহে মাহফুজে সব কিছু লিপিবদ্ধ করলেন এবং আকাশ ও পৃথিবী সৃষ্টি করলেন। এ সময় একজন ঘোষণাকারি ঘোষণা করল, হে ইব্‌নু হুসাইন! আপনার উটনী পালিয়ে গেছে। তখন আমি এর খোঁজে চলে গেলাম। দেখলাম তা এত দূরে চলে গেছে যে, তার এবং আমার মধ্যে মরীচিকাময় ময়দান দূরত্ব হয়ে পড়েছে। আল্লাহ‌্‌র কসম! আমি তখন উটনীটিকে একেবারে ছেড়ে দেয়ার ইচ্ছা করলাম।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 129070,
        "last_updated": null
    },
    {
        "banglaURN": 6031920,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1845,
        "babName": null,
        "hadithNumber": 3192,
        "hadithSanad": "",
        "hadithText": "তারিক ইব্‌নু শিহাব (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি ‘উমর (রাঃ)-কে বলতে শুনেছি, একদা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাদের মধ্যে দাঁড়ালেন। অতঃপর তিনি আমাদের সৃষ্টির সূচনা সম্পর্কে জ্ঞাত করলেন। অবশেষে তিনি জান্নাতবাসী ও জাহান্নামবাসীর নিজ নিজ নির্দিষ্ট স্থানে প্রবেশ করার কথাও উল্লেখ করলেন। যে ব্যক্তি এ কথাটি স্মরণ রাখতে পেরেছে, সে স্মরণ রেখেছে আর যে ভুলে যাবার সে ভুলে গেছে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 129080,
        "last_updated": null
    },
    {
        "banglaURN": 6031930,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1845,
        "babName": null,
        "hadithNumber": 3193,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, মহান আল্লাহ বলেন, আদম সন্তান আমাকে গালি দেয় অথচ আমাকে গালি দেয়া তার উচিত নয়। আর সে আমাকে মিথ্যা জানে অথচ তার উচিত নয়। আমাকে গালি দেয়া হচ্ছে, তার এ উক্তি যে, আমার সন্তান আছে। আর তার মিথ্যা মনে করা হচ্ছে, তার এ উক্তি, যেভাবে আল্লাহ আমাকে প্রথমে সৃষ্টি করেছেন, সেভাবে কখনও তিনি আমাকে আবার সৃষ্টি করবেন না।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 129090,
        "last_updated": null
    },
    {
        "banglaURN": 6031940,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1845,
        "babName": null,
        "hadithNumber": 3194,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, আল্লাহ যখন সৃষ্টির কাজ শেষ করলেন, তখন তিনি তাঁর কিতাব লাওহে মাহ্‌ফুজে লিখেন, যা আরশের উপর তাঁর নিকট আছে। নিশ্চয়ই আমার রহমত আমার ক্রোধের উপর প্রবল।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 129100,
        "last_updated": null
    },
    {
        "banglaURN": 6031950,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1846,
        "babName": null,
        "hadithNumber": 3195,
        "hadithSanad": "",
        "hadithText": "আবূ সালামা ইব্‌নু ‘আবদির রাহমান (রাঃ) থেকে বর্ণিতঃ (তিনি বলেন), কয়েকজন লোকের সঙ্গে একখণ্ড ভূমি নিয়ে তাঁর ঝগড়া ছিল। ‘আয়িশা (রাঃ)-এর নিকট এসে তা জানালেন। তিনি বললেন, হে আবূ সালামা! জমা-জমির গোলমাল হতে দূরে থাক। কেননা, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, যে লোক এক বিঘত পরিমাণ অন্যের জমি অন্যায়ভাবে আত্মসাৎ করেছে, কিয়ামতের দিন সাত তবক যমীনের হার তার গলায় পরিয়ে দেয়া হবে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 129110,
        "last_updated": null
    },
    {
        "banglaURN": 6031960,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1846,
        "babName": null,
        "hadithNumber": 3196,
        "hadithSanad": "",
        "hadithText": "সালিম (রাঃ)-এর পিতা থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, যে লোক অন্যায়ভাবে কারো ভূমির সামান্যতম অংশও আত্মসাৎ করবে, কিয়ামতের দিন সাত তবক যমীনের নীচে তাকে ধ্বসিয়ে দেয়া হবে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 129120,
        "last_updated": null
    },
    {
        "banglaURN": 6031970,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1846,
        "babName": null,
        "hadithNumber": 3197,
        "hadithSanad": "",
        "hadithText": "আবূ বাকরাহ (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, আল্লাহ যে দিন আসমান ও যমীন সৃষ্টি করেছেন, সে দিন হতে সময় যেভাবে আবর্তিত হচ্ছিল আজও তা সেভাবে আবর্তিত হচ্ছে। বারো মাসে এক বছর। এর মধ্যে চারটি মাস সম্মানিত। যুল-কা’দাহ, যূল-হিজ্জাহ ও মুহাররাম। তিনটি মাস পরস্পর রয়েছে। আর একটি মাস হলো রজব-ই-মুযারা [১] যা জুমাদা ও শা’বান মাসের মাঝে অবস্থিত।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 129130,
        "last_updated": null
    },
    {
        "banglaURN": 6031980,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1846,
        "babName": null,
        "hadithNumber": 3198,
        "hadithSanad": "",
        "hadithText": "সা’ঈদ ইব্‌নু যায়িদ ইবনে ‘আম্‌র ইবনে নুফাইর (রাঃ) থেকে বর্ণিতঃ ‘আরওয়া’ নামক এক মহিলা এক সাহাবীর বিরুদ্ধে মারওয়ানের নিকট তার ঐ পাওনার ব্যাপারে মামলা দায়ের করল, যা তার ধারণায় তিনি নষ্ট করেছেন। ব্যাপার শুনে সা’ঈদ (রাঃ) বললেন, আমি কি তার সামান্য হকও নষ্ট করতে পারি? আমি তো সাক্ষ্য দিচ্ছি, আমি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছি, যে ব্যক্তি যুল্‌ম করে অন্যের এক বিঘত যমীনও আত্মসাৎ করে, কেয়ামতের দিন সাত তবক যমীনের শিকল তার গলায় পরিয়ে দেয়া হবে। ইব্‌নু আবিয যিনাদ (রহঃ) হিশাম (রহঃ) থেকে, তিনি তাঁর পিতা হতে বর্ণনা করতে গিয়ে বলেছেন, তিনি (হিশামের পিতা ‘উরওয়াহ) (রাঃ) বলেন, সা’ঈদ ইব্‌নু যায়দ (রাঃ) আমাকে বলেছেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট উপস্থিত হলাম (তখন তিনি এ হাদীস বর্ণনা করেন)।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 129140,
        "last_updated": null
    },
    {
        "banglaURN": 6031990,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1848,
        "babName": null,
        "hadithNumber": 3199,
        "hadithSanad": "",
        "hadithText": "আবূ যার (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সূর্য অস্ত যাবার সময় আবূ যার (রাঃ)-কে বললেন, তুমি কি জান, সূর্য কোথায় যায়? আমি বললাম, আল্লাহ এবং তাঁর রসূলই ভাল জানেন। তিনি বললেন, তা যেতে যেতে আরশের নীচে গিয়ে সিজদা পড়ে যায়। অতঃপর সে আবার উদিত হবার অনুমতি চায় এবং তাকে অনুমতি দেয়া হয়। আর শীঘ্রই এমন সময় আসবে যে, সিজ্‌দা করবে কিন্তু তা কবূল করা হবে না এবং সে অনুমতি চাইবে কিন্তু তাকে অনুমতি দেয়া হবে না। তাকে বলা হবে, যে পথ দিয়ে আসলে ঐ পথেই ফিরে যাও। তখন সে পশ্চিম দিক হতে উদিত হয়-- এটাই মর্ম হল মহান আল্লাহর বাণীরঃ “আর সূর্য নিজ গন্তব্যে (অথবা) কক্ষ পথে চলতে থাকে। এটা পরাক্রমশালী, সর্বজ্ঞের নিয়ন্ত্রণ।” (ইয়াসীন ৩৮)</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 129160,
        "last_updated": null
    },
    {
        "banglaURN": 6032000,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1848,
        "babName": null,
        "hadithNumber": 3200,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেন, কিয়ামতের দিন সূর্য ও চন্দ্র দু’টিকেই গুটিয়ে নেয়া হবে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 129170,
        "last_updated": null
    },
    {
        "banglaURN": 6032010,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1848,
        "babName": null,
        "hadithNumber": 3201,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, কারো মৃত্যু কিংবা জন্মের কারণে সূর্য গ্রহণ ও চন্দ্রগ্রহণ হয় না, বরং এ দু’টো আল্লাহর নিদর্শনসমূহের মধ্যে দু’টি নিদর্শন মাত্র। কাজেই তোমরা যখন তা ঘটতে দেখবে তখন সালাত আদায় করবে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 129180,
        "last_updated": null
    },
    {
        "banglaURN": 6032020,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1848,
        "babName": null,
        "hadithNumber": 3202,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, সূর্য এবং চন্দ্র আল্লাহর নিদর্শনসমূহের মধ্য হতে দু’টি নিদর্শন। কারো মৃত্যু কিংবা জন্মের কারণে সূর্যগ্রহণ ও চন্দ্রগ্রহণ হয় না। কাজেই তোমরা যখন তা ঘটতে দেখবে তখন আল্লাহ্‌র যিক্‌র করবে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 129190,
        "last_updated": null
    },
    {
        "banglaURN": 6032030,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1848,
        "babName": null,
        "hadithNumber": 3203,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ যেদিন সূর্যগ্রহণ হল, সে দিন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সালাতে দাঁড়ালেন। অতঃপর তাকবীর বললেন এবং দীর্ঘ কিরাআত পাঠ করলেন। অতঃপর দীর্ঘ রুকু করলেন অতঃপর তিনি মাথা উঠালেন এবং বললেন, - এবং তিনি আগের মত দাঁড়ালেন। আর দীর্ঘ কিরাআত পাঠ করলেন কিন্তু তা প্রথম কিরাআত থেকে কম ছিল। অতঃপর তিনি দীর্ঘক্ষণ রুকু’ করলেন কিন্তু তা প্রথম রাক’আতের চেয়ে কম ছিল। অতঃপর তিনি দীর্ঘ সিজদা করলেন। তিনি শেষ রাক’আতেও ঐ রকমই করলেন, পরে সালাম ফিরালেন। এ সময় সূর্য উজ্জ্বল হয়ে গেছে। তখন তিনি মানুষদের উদ্দেশে খুত্‌বা দিলেন। তিনি সূর্য ও চন্দ্র গ্রহণ সম্পর্কে বললেন, অবশ্যই এ দু’টি আল্লাহর নিদর্শনাবলীর মধ্যে দু’টি নিদর্শন। কারো মৃত্যু ও জন্মের কারণে সূর্যগ্রহণ-চন্দ্রগ্রহণ হয় না। অতএব যখনই তোমরা তা ঘটতে দেখবে তখনই সালাতে ভয়-ভীতি নিয়ে লিপ্ত হবে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 129200,
        "last_updated": null
    },
    {
        "banglaURN": 6032040,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1848,
        "babName": null,
        "hadithNumber": 3204,
        "hadithSanad": "",
        "hadithText": "আবূ মাস’উদ (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, সূর্যগ্রহণ ও চন্দ্রগ্রহণ কারো মৃত্যু ও জন্মের কারণে হয় না। উভয়টি আল্লাহ্‌র নিদর্শনসমূহের মধ্যে হতে দু’টি নিদর্শন। অতএব যখন তোমরা তা ঘটতে দেখবে, তখন তোমরা সালাত আদায় করবে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 129210,
        "last_updated": null
    },
    {
        "banglaURN": 6032050,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1849,
        "babName": null,
        "hadithNumber": 3205,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, পূর্বের বাতাস দ্বারা আমাকে সাহায্য করা হয়েছে, আর পশ্চিমের বাতাস দ্বারা আদ জাতিকে হালাক করা হয়েছে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 129220,
        "last_updated": null
    },
    {
        "banglaURN": 6032060,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1849,
        "babName": null,
        "hadithNumber": 3206,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যখন আকাশে মেঘ দেখতেন, তখন একবার সামনে আগাতেন, আবার পেছনে সরে যেতেন। আবার কখনও ঘরে প্রবেশ করতেন, আবার বেরিয়ে যেতেন আর তাঁর মুখমণ্ডল মলিন হয়ে যেত। পরে যখন আকাশ বৃষ্টি বর্ষণ করত তখন তাঁর এ অবস্থা দূর হত। ‘আয়িশা (রাঃ)-এর কারণ জানতে চাইলে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, আমি জানি না, এ মেঘ এমন মেঘও হতে পারে যা দেখে আদ জাতি বলেছিলঃ অতঃপর যখন তারা তাদের উপত্যকার দিকে উক্ত মেঘমালাকে এগোতে দেখল। (৪৬ : ২৪)</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 129230,
        "last_updated": null
    },
    {
        "banglaURN": 6032070,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1850,
        "babName": null,
        "hadithNumber": 3207,
        "hadithSanad": "",
        "hadithText": "মালিক ইব্‌নু সা’সা’আ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, আমি কা’বা ঘরের নিকট নিদ্রা ও জাগরণ- এ দু’অবস্থার মাঝামাঝি অবস্থায় ছিলাম। অতঃপর তিনি দু’ব্যক্তির মাঝে অপর এক ব্যক্তি অর্থাৎ নিজের অবস্থা উল্লেখ করে বললেন, আমার নিকট সোনার একটি পেয়ালা নিয়ে আসা হল- যা হিক্‌মত ও ঈমানে ভরা ছিল। অতঃপর আমার বুক হতে পেটের নিচ পর্যন্ত চিরে ফেলা হল। অতঃপর আমার পেট যমযমের পানি দিয়ে ধোয়া হল। অতঃপর তা হিক্‌মত ও ঈমানে পূর্ণ করা হল এবং আমার নিকট সাদা রঙের চতুষ্পদ জন্তু আনা হল, যা খচ্চর হতে ছোট আর গাধা হতে বড় অর্থাৎ বোরাক। অতঃপর তাতে চড়ে আমি জিব্‌রাঈল (‘আঃ) সহ চলতে চলতে পৃথিবীর নিকটতম আসমানে গিয়ে পৌঁছলাম। জিজ্ঞেস করা হল, এ কে? উত্তরে বলা হল, জিব্‌রাঈল। জিজ্ঞেস করা হল, আপনার সঙ্গে আর কে? উত্তর দেয়া হল, মুহাম্মদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)। প্রশ্ন করা হল তাঁকে আনার জন্য কি পাঠানো হয়েছে? তিনি বললেন, হ্যাঁ। বলা হল, তাঁকে মারহাবা, তাঁর আগমন কতই না উত্তম। অতঃপর আমি আদম (‘আঃ)-এর নিকট গেলাম। তাঁকে সালাম করলাম। তিনি বললেন, পুত্র ও নবী! তোমার প্রতি মারহাবা। অতঃপর আমরা দ্বিতীয় আসমানে গেলাম। জিজ্ঞেস করা হল, এ কে? তিনি বললেন, আমি জিব্‌রাঈল। জিজ্ঞেস করা হল, আপনার সঙ্গে আর কে? তিনি বললেন, মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)। প্রশ্ন করা হল, তাঁকে আনার জন্য কি পাঠানো হয়েছে? তিনি বললেন, হ্যাঁ। বলা হল, তাঁকে মারহাবা আর তাঁর আগমন কতই না উত্তম। অতঃপর আমি ‘ঈসা ও ইয়াহইয়া (‘আঃ)-এর নিকট আসলাম। তাঁরা উভয়ে বললেন, ভাই ও নবী! আপনার প্রতি মারহাবা। অতঃপর আমরা তৃতীয় আসমানে পৌঁছলাম। জিজ্ঞেস করা হল, এ কে? উত্তরে বলা হল, আমি জিব্‌রাঈল। প্রশ্ন করা হল, আপনার সঙ্গে কে? বলা হল, মুহাম্মদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)। জিজ্ঞেস করা হল, তাঁকে আনার জন্য কি পাঠানো হয়েছে? তিনি বললেন, হ্যাঁ। বলা হল, তাঁকে মারহাবা আর তাঁর আগমন কতই না উত্তম। অতঃপর আমি ইউসুফ (‘আঃ)-এর নিকট গেলাম। তাঁকে আমি সালাম করলাম। তিনি বললেন, ভাই ও নবী! আপনাকে মারহাবা। অতঃপর আমরা চতুর্থ আসমানে পৌঁছলাম। প্রশ্ন করা হল, এ কে? তিনি বললেন, আমি জিব্‌রাঈল। জিজ্ঞেস করা হল, আপনার সঙ্গে কে? বলা হল, মুহাম্মদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)। প্রশ্ন করা হল, তাঁকে আনার জন্য কি পাঠানো হয়েছে? জবাবে বলা হল, হ্যাঁ। বলা হল, তাঁকে মারহাবা আর তাঁর আগমন কতই না উত্তম। অতঃপর আমি ইদ্‌রীস (‘আঃ)-এর নিকট গেলাম। আমি তাঁকে সালাম করলাম। তিনি বললেন, ভাই ও নবী! আপনাকে মারহাবা। এরপর আমরা পঞ্চম আসমানে পৌঁছলাম। জিজ্ঞেস করা হল, এ কে? বলা হয় আমি জিব্‌রাঈল। প্রশ্ন হল, আপনার সঙ্গে আর কে? বলা হল, মুহাম্মদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)। প্রশ্ন করা হল, তাঁকে আনার জন্য কি পাঠানো হয়েছে? বলা হল হ্যাঁ। বললেন, তাঁকে মারহাবা আর তাঁর আগমন কতই না উত্তম। অতঃপর আমরা হারুন (‘আঃ)-এর নিকট গেলাম। আমি তাঁকে সালাম করলাম। তিনি বললেন, ভাই ও নবী! আপনাকে মারহাবা। অতঃপর আমরা ষষ্ঠ আসমানে পৌঁছলাম। জিজ্ঞেস করা হল, এ কে? বলা হল, আমি জিব্‌রাঈল। প্রশ্ন হল, আপনার সঙ্গে কে? বলা হল, মুহাম্মদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)। বলা হল, তাঁকে আনার জন্য পাঠানো হয়েছে? তাঁকে মারহাবা আর তাঁর আগমন কতই না উত্তম। অতঃপর আমি মূসা (‘আঃ)-এর নিকট গেলাম। আমি তাঁকে সালাম করলাম। তিনি বললেন, ভাই ও নবী আপনাকে মারহাবা। অতঃপর আমি যখন তাঁর কাছ দিয়ে গেলাম, তখন তিনি কেঁদে ফেললেন। তাঁকে বলা হল, আপনি কাঁদছেন কেন? তিনি বললেন, হে রব! এ ব্যক্তি যে আমার পরে প্রেরিত, তাঁর উম্মত আমার উম্মাতের চেয়ে অধিক পরিমাণে বেহেশতে যাবে। অতঃপর আমরা সপ্তম আকাশে পৌঁছলাম। প্রশ্ন করা হল, এ কে? বলা হল, আমি জিব্‌রাঈল। জিজ্ঞেস করা হল, আপনার সঙ্গে কে? বলা হল, মুহাম্মদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)। বলা হল, তাঁকে আনার জন্য পাঠানো হয়েছে? তাঁকে মারহাবা। তাঁর আগমন কতই না উত্তম। অতঃপর আমি ইব্‌রাহীম (‘আঃ)-এর নিকট গেলাম। তাঁকে সালাম করলাম। তিনি বললেন, হে পুত্র ও নবী! আপনাকে মারহাবা। অতঃপর বায়তুল মা’মূরকে আমার সামনে প্রকাশ করা হল। আমি জিব্‌রাঈল (‘আঃ)-কে জিজ্ঞেস করলাম। তিনি বললেন, এটি বায়তুল মা’মূর। প্রতিদিন এখানে সত্তর হাজার ফেরেশতা সালাত আদায় করেন। এরা এখান হতে একবার বাহির হলে দ্বিতীয় বার ফিরে আসেন না। এটাই তাদের শেষ প্রবেশ। অতঃপর আমাকে ‘সিদ্‌রাতুল মুনতাহা’ দেখানো হল। দেখলাম, এর ফল যেন হাজারা নামক জায়গার মটকার মত। আর তার পাতা যেন হাতীর কান। তার উৎসমূলে চারটি ঝরণা প্রবাহিত। দু’টি ভিতরে আর দু’টি বাইরে। এ সম্পর্কে আমি জিব্‌রাঈলকে জিজ্ঞেস করলাম। তিনি বললেন, ভিতরের দু’টি জান্নাতে অবস্থিত। আর বাইরের দু’টির একটি হল- ফুরাত আর অপরটি হল (মিশরের) নীল নদ। অতঃপর আমার প্রতি পঞ্চাশ ওয়াক্ত সালাত ফরয করা হয়। আমি তা গ্রহণ করে মূসা (‘আঃ)-এর নিকট ফিরে এলাম। তিনি বললেন, কি করে এলেন? আমি বললাম, আমার প্রতি পঞ্চাশ ওয়াক্ত সালাত ফরয করা হয়েছে। তিনি বললেন, আমি আপনার চেয়ে মানুষ সম্পর্কে অধিক জ্ঞাত আছি। আমি বাণী ইসরাঈলের রোগ সরানোর যথেষ্ট চেষ্টা করেছি। আপনার উম্মত এত আদায়ে সমর্থ হবে, না। অতএব আপনার রবের নিকট ফিরে যান এবং তা কমানোর আবেদন করুন। আমি ফিরে গেলাম এবং তাঁর নিকট আবেদন করলাম। তিনি সালাত চল্লিশ ওয়াক্ত করে দিলেন। আবার তেমন ঘটল। সালাত ত্রিশ ওয়াক্ত করে দেয়া হল। আবার তেমন ঘটলে তিনি সালাত বিশ ওয়াক্ত করে দিলেন। আবার তেমন ঘটল। তিনি সালাতকে দশ ওয়াক্ত করে দিলেন। অতঃপর আমি মূসা (‘আঃ)-এর নিকট আসলাম। তিনি আগের মত বললেন, এবার আল্লাহ সালাতকে পাঁচ ওয়াক্ত ফরয করে দিলেন। আমি মূসার নিকট আসলাম। তিনি বললেন, কী করে আসলেন? আমি বললাম, আল্লাহ পাঁচ ওয়াক্ত ফরয করে দিয়েছেন। এবারও তিনি আগের মত বললেন, আমি বললাম, আমি তা মেনে নিয়েছি। তখন আওয়াজ এল, আমি আমার ফরয জারি করে দিয়েছি। আর আমার বান্দাদের হতে হালকা করেও দিয়েছি। আমি প্রতিটি নেকির বদলে দশগুণ সওয়াব দিব। আর বায়তুল মা’মূর সম্পর্কে হাম্মাম (রহঃ) …... আবূ হুরায়রা (রাঃ) সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে বর্ণনা করেন।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 129240,
        "last_updated": null
    },
    {
        "banglaURN": 6032080,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1850,
        "babName": null,
        "hadithNumber": 3208,
        "hadithSanad": "",
        "hadithText": "যায়দ ইব্‌নু ওয়াহ্‌ব (রাঃ) থেকে বর্ণিতঃ ‘আবদুল্লাহ (রাঃ) বলেন, সত্যবাদী হিসেবে গৃহীত আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাদের নিকট হাদীস বর্ণনা করতে গিয়ে বলেছেন, নিশ্চয় তোমাদের প্রত্যেকের সৃষ্টির উপাদান নিজ নিজ মায়ের পেটে চল্লিশ দিন পর্যন্ত বীর্যরূপে অবস্থান করে, অতঃপর তা জমাট বাঁধা রক্তে পরিণত হয়। ঐভাবে চল্লিশ দিন অবস্থান করে। অতঃপর তা মাংসপিণ্ডে পরিণত হয়ে (আগের মত চল্লিশ দিন) থাকে। অতঃপর আল্লাহ একজন ফেরেশতা প্রেরণ করেন। আর তাঁকে চারটি বিষয়ে আদেশ দেয়া হয়। তাঁকে লিপিবদ্ধ করতে বলা হয়, তার ‘আমল, তার রিয্‌ক, তার আয়ু এবং সে কি পাপী হবে না নেককার হবে। অতঃপর তার মধ্যে আত্মা ফুঁকে দেয়া হয়। কাজেই তোমাদের কোন ব্যক্তি ‘আমল করতে করতে এমন পর্যায়ে পৌছে যে, তার এবং জান্নাতের মাঝে মাত্র এক হাত পার্থক্য থাকে। এমন সময় তার ‘আমলনামা তার উপর জয়ী হয়। তখন সে জাহান্নামবাসীর মত আমল করে। আর একজন ‘আমল করতে করতে এমন স্তরে পৌছে যে, তার এবং জাহান্নামের মাঝে মাত্র এক হাত তফাৎ থাকে, এমন সময় তার ‘আমলনামা তার উপর জয়ী হয়। ফলে সে জান্নাতবাসীর মত ‘আমল করে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 129250,
        "last_updated": null
    },
    {
        "banglaURN": 6032090,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1850,
        "babName": null,
        "hadithNumber": 3209,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, আল্লাহ যখন কোন বান্দাকে ভালবাসেন তখন তিনি জিব্‌রাঈল (‘আঃ)-কে ডেকে বলেন, নিশ্চয়ই আল্লাহ অমুক বান্দাহকে ভালবাসেন, কাজেই তুমিও তাকে ভালবাস। তখন জিব্‌রাঈল (‘আঃ)-ও তাকে ভালবাসেন এবং জিব্‌রাঈল (‘আঃ) আকাশের অধিবাসীদের মধ্যে ঘোষণা করে দেন যে, আল্লাহ অমুক বান্দাহকে ভালবাসেন। কাজেই তোমরা তাকে ভালবাস। তখন আকাশের অধিবাসী তাকে ভালবাসতে থাকে। অতঃপর পৃথিবীতেও তাকে সম্মানিত করার ব্যবস্থা করে দেয়া হয়।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 129260,
        "last_updated": null
    },
    {
        "banglaURN": 6032100,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1850,
        "babName": null,
        "hadithNumber": 3210,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছেন যে, ফেরেশতামণ্ডলী মেঘমালার আড়ালে অবতরণ করেন এবং আকাশের ফায়সালাসমূহ আলোচনা করেন। তখন শয়তানেরা তা চুরি করে শোনার চেষ্টা করে এবং তার কিছু শোনেও ফেলে। অতঃপর তারা সেটা গণকের নিকট পৌছে দেয় এবং তারা তার সেই শোনা কথার সঙ্গে নিজেদের আরো শত মিথ্যা মিলিয়ে বলে থাকে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 129270,
        "last_updated": null
    },
    {
        "banglaURN": 6032110,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1850,
        "babName": null,
        "hadithNumber": 3211,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, ‘জুমু‘আর দিন মসজিদের প্রতিটি দরজায় ফেরেশতা এসে দাঁড়িয়ে যায় এবং যে ব্যক্তি প্রথম মসজিদে প্রবেশ করে, তার নাম লিখে নেয়। অতঃপর ক্রমান্বয়ে পরবর্তীদের নামও লিখে নেয়। ইমাম যখন বসে পড়েন তখন তারা এসব লেখা পুস্তিকা বন্ধ করে দেন এবং তাঁরা মসজিদে এসে যিক্‌র শুনতে থাকেন।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 129280,
        "last_updated": null
    },
    {
        "banglaURN": 6032120,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1850,
        "babName": null,
        "hadithNumber": 3212,
        "hadithSanad": "",
        "hadithText": "সা’ঈদ ইব্‌নু মুসাইয়্যাব (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, একদা ‘উমর (রাঃ) মসজিদে নববীতে আগমন করেন, তখন হাস্‌সান ইব্‌নু সাবিত (রাঃ) কবিতা আবৃত্তি করছিলেন। তখন তিনি বললেন, এখানে আপনার চেয়ে উত্তম ব্যক্তির উপস্থিতিতেও আমি কবিতা আবৃত্তি করতাম। অতঃপর তিনি আবূ হুরায়রা (রাঃ)-এর দিকে তাকালেন এবং বললেন, আমি আপনাকে আল্লাহর কসম দিয়ে জিজ্ঞেস করছি; আপনি কি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছেন যে, “তুমি আমার পক্ষ হতে জবাব দাও। হে আল্লাহ! আপনি তাকে রুহুল কুদুস [জিবরাঈল (‘আঃ)] দ্বারা সাহায্য করুন।” তিনি উত্তরে বললেন, হ্যাঁ।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 129290,
        "last_updated": null
    },
    {
        "banglaURN": 6032130,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1850,
        "babName": null,
        "hadithNumber": 3213,
        "hadithSanad": "",
        "hadithText": "বারা’ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হাস্‌সান (রাঃ)-কে বলেছেন, তুমি তাদের দোষ-ত্রুটি বর্ণনা কর অথবা তাদের কুৎসার জবাব দাও। তোমার সঙ্গে জিব্‌রাঈল (‘আঃ) আছেন।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 129300,
        "last_updated": null
    },
    {
        "banglaURN": 6032140,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1850,
        "babName": null,
        "hadithNumber": 3214,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্‌নু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি যেন বনূ গানমের গলিতে উপরে উঠা ধূলা স্বয়ং দেখতে পাচ্ছি। মূসা এতটুকু বাড়িয়ে বলেছেন, জিব্‌রীল বাহন নিয়ে পদচারণা করেন। [১]</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 129310,
        "last_updated": null
    },
    {
        "banglaURN": 6032150,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1850,
        "babName": null,
        "hadithNumber": 3215,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ হারিস ইব্‌নু হিশাম (রাঃ) নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে জিজ্ঞেস করলেন, আপনার নিকট ওয়াহী কিভাবে আসে? তিনি বললেন, ‘সব ধরনের ওয়াহী নিয়ে ফেরেশতা আসেন। কখনো কখনো ঘন্টার আওয়াজের মত শব্দ করে। যখন আমার নিকট ওয়াহী আসা শেষ হয়ে যায়, তখন তিনি যা বলেছেন আমি তা মুখস্থ করে ফেলি। আর এভাবে শব্দ করে ওয়াহী আসাটা আমার নিকট কঠিন মনে হয়। আর কখনও কখনও ফেরেশতা আমার নিকট মানুষের আকারে আসেন এবং আমার সঙ্গে কথা বলেন। তিনি যা বলেন আমি তা মুখস্থ করে নেই।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 129320,
        "last_updated": null
    },
    {
        "banglaURN": 6032160,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1850,
        "babName": null,
        "hadithNumber": 3216,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছি, যে ব্যক্তি আল্লাহর পথে কোন কিছু জোড়ায় জোড়ায় দান করবে, তাকে জান্নাতের পর্যবেক্ষকগণ আহবান করতে থাকবে, হে অমুক ব্যক্তি! এ দিকে আস! তখন আবূ বকর (রাঃ) বললেন, এমন ব্যক্তি তো সেই যার কোন ধ্বংস নেই। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, আমি আশা করি, তুমি তাদের মধ্যে একজন হবে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 129330,
        "last_updated": null
    },
    {
        "banglaURN": 6032170,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1850,
        "babName": null,
        "hadithNumber": 3217,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ একদা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁকে বললেন, হে আয়িশা! এই যে জিব্‌রীল (‘আঃ) তোমাকে সালাম দিচ্ছেন। তখন তিনি বললেন, তাঁর প্রতি সালাম, আল্লাহর রহমত এবং তাঁর বরকত বর্ষিত হোক। আপনি এমন কিছু দেখেন যা আমি দেখতে পাই না। এর দ্বারা তিনি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বুঝিয়েছেন।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 129340,
        "last_updated": null
    },
    {
        "banglaURN": 6032180,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1850,
        "babName": null,
        "hadithNumber": 3218,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, একবার আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) জিব্‌রাঈল (‘আঃ)-কে জিজ্ঞেস করলেন, আপনি আমার কাছে যতবার আসেন তার চেয়ে অধিক আমার সঙ্গে সাক্ষাৎ করেন না কেন? রাবী বলেন, তখন এ আয়াত অবতীর্ণ হয়ঃ “(জিবরাঈল বললঃ) আমি আপনার রবের আদেশ ব্যতিরেকে আসতে পারি না। তাঁরই আয়ত্বে রয়েছে যা কিছু আমাদের সামনে আছে, যা আমাদের পশ্চাতে আছে এবং যা কিছু এর মধ্যস্থলে আছে”-(মারইয়াম ৬৪)।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 129350,
        "last_updated": null
    },
    {
        "banglaURN": 6032190,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1850,
        "babName": null,
        "hadithNumber": 3219,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ রসূলূল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, ‘জিব্‌রীল (‘আঃ) আমাকে এক আঞ্চলিক ভাষায় কুরআন পাঠ করে শুনিয়েছেন। কিন্তু আমি সব সময় তাঁর নিকট বেশি ভাষায় পাঠ শুনতে চাইতাম। শেষতক তা সাতটি আঞ্চলিক ভাষায় শেষ হয়। [১]</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 129360,
        "last_updated": null
    },
    {
        "banglaURN": 6032200,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1850,
        "babName": null,
        "hadithNumber": 3220,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) লোকদের মধ্যে সবচেয়ে দানশীল ছিলেন আর রমাযান মাসে যখন জিব্‌রীল (‘আঃ) তাঁর সঙ্গে সাক্ষাৎ করতেন তখন তিনি আরো অধিক দানশীল হয়ে যেতেন। জিব্‌রীল (‘আঃ) রমযানের প্রতি রাতে তাঁর সঙ্গে সাক্ষাৎ করতেন। তখন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁকে কুরআন পাঠ করে শুনাতেন। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এর সঙ্গে যখন  জিব্‌রাঈল (‘আঃ) দেখা করতেন, তখন তিনি মানুষের কল্যাণের জন্য পাঠানো বাতাসের চেয়েও বেশি দানশীল হয়ে হতেন। ‘আবদুল্লাহ (রহঃ) হতে বর্ণিত। মা’মার (রহঃ) এ সনদে একই রকম হাদীসের বর্ণনা করেছেন আর আবূ হুরায়রা (রাঃ) এবং ফাতেমাহ (রাঃ) নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) নিকট হতে -----------এর স্থলে ----------- বর্ণনা করেছেন। অর্থাৎ জিব্‌রীল তাঁর উপর কুরআন পেশ করতেন।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 129370,
        "last_updated": null
    },
    {
        "banglaURN": 6032210,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1850,
        "babName": null,
        "hadithNumber": 3221,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু শিহাব (রহঃ) থেকে বর্ণিতঃ একবার ‘উমর ইব্‌নু ‘আবদুল ‘আযীয (রহঃ) ‘আসরের সালাত কিছুটা দেরিতে আদায় করলেন। তখন তাঁকে ‘উরওয়াহ (রাঃ) বললেন, একবার জিব্‌রীল (‘আঃ) আসলেন এবং আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর ইমাম হয়ে সালাত আদায় করলেন। তা শুনে ‘উমর ইব্‌নু ‘আবদুল ‘আযীয (রহঃ) বললেন, হে ‘উরওয়াহ! কি বলছ, চিন্তা কর। উত্তরে তিনি বললেন, আমি বশীর ইব্‌নু মাস’ঊদকে বলতে শুনেছি, তিনি বলেন, আমি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলতে শুনেছি, একবার জিব্‌রীল (‘আঃ) আসলেন, অতঃপর তিনি আমার ইমামতি করলেন এবং তাঁর সঙ্গে সালাত আদায় করলাম। অতঃপর আমি তাঁর সঙ্গে সালাত আদায় করলাম। অতঃপর আমি তাঁর সঙ্গে সালাত আদায় করলাম। অতঃপর আমি তাঁর সঙ্গে সালাত আদায় করলাম। এ সময় তিনি তাঁর আঙ্গুলে পাঁচ ওয়াক্ত সালাত গুণছিলেন।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 129380,
        "last_updated": null
    },
    {
        "banglaURN": 6032220,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1850,
        "babName": null,
        "hadithNumber": 3222,
        "hadithSanad": "",
        "hadithText": "আবূ যার (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, একবার জিব্‌রাঈল (‘আঃ) আমাকে বললেন, আপনার উম্মত হতে যদি এমন এক ব্যক্তি মারা যায় যা আল্লাহ্‌র সঙ্গে কোন কিছুই শরীক করেনি, তাহলে সে জান্নাতে প্রবেশ করবে কিংবা তিনি বলেছেন, সে জাহান্নামে প্রবেশ করবে না। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, যদিও সে যিনা ও চুরি করে। জিব্‌রীল (‘আঃ) বললেন, যদিও (সে যিনা ও চুরি করে তবুও)। [১]</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 129390,
        "last_updated": null
    },
    {
        "banglaURN": 6032230,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1850,
        "babName": null,
        "hadithNumber": 3223,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, ফেরেশতামন্ডলী একদলের পেছনে আর একদল আগমন করেন। একদল ফেরেশতা রাতে আসেন আর একদল ফেরেশতা দিনে আসেন। তাঁরা ফাজ্‌র ও ‘আসর সালাতে একত্রিত হয়ে থাকেন। অতঃপর যারা তোমাদের নিকট রাত্রি কাটিয়েছিলেন তারা আল্লাহ্‌র নিকট উর্ধ্বে চলে যান। তখন তাদেরকে মানুষের অবস্থা সম্পর্কে জিজ্ঞেস করেন। অথচ তিনি তাদের চেয়ে এ ব্যাপারে অধিক জ্ঞাত আছেন। তিনি বলেন, তোমরা আমার বান্দাহদেরকে কী হালতে ছেড়ে এসেছে? উত্তরে তাঁরা বলেন, আমরা তাদেরকে সালাতরত অবস্থাতেই পৌঁছেছিলাম।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 129400,
        "last_updated": null
    },
    {
        "banglaURN": 6032240,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1851,
        "babName": null,
        "hadithNumber": 3224,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর জন্য প্রানীর ছবিওয়ালা একটি বালিশ তৈরি করেছিলাম। যেন তা একটি ছোট গদী। অতঃপর তিনি আমার ঘরে এসে দু’দরজার মধ্যে দাঁড়ালেন আর তাঁর চেহারা মলিন হয়ে গেল। তখন আমি বললাম, এ বালিশটি আপনি এর উপর ঠেস দিয়ে বসতে পারেন সে’ জন্য তৈরি করছি। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, তুমি কি জান না যে ঘরে প্রাণীর ছবি থাকে, সেখানে ফেরেশতা প্রবেশ করে না। আর যে ব্যক্তি প্রাণীর ছবি আকেঁ তাকে কিয়ামতের দিন শাস্তি দেয়া হবে? (আল্লাহ্‌) বলবেন, ‘বানিয়েছ, তাঁকে জীবিত কর।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 129410,
        "last_updated": null
    },
    {
        "banglaURN": 6032250,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1851,
        "babName": null,
        "hadithNumber": 3225,
        "hadithSanad": "",
        "hadithText": "আবূ ত্বালহা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছি, যে বাড়িতে কুকুর থাকে আর প্রাণীর ছবি থাকে সেথায় ফেরেশতা প্রবেশ করে না।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 129420,
        "last_updated": null
    },
    {
        "banglaURN": 6032260,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1851,
        "babName": null,
        "hadithNumber": 3226,
        "hadithSanad": "",
        "hadithText": "আবূ ত্বলহা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, ‘যে বাড়িতে প্রাণীর ছবি থাকে সেখানে ফেরেশতা প্রবেশ করে না।’ বুস্‌র (রহঃ) বলেন, অতপর যায়িদ ইব্‌নু খালিদ (রাঃ) রোগাক্রান্ত হন। আমরা তাঁর সেবার জন্য গেলাম। তখন আমরা তাঁর ঘরে একটি পর্দায় কিছু ছবি দেখতে পেলাম। তখন আমি (বুস্‌র) ‘উবাইদুল্লাহ খাওলানী (রহঃ)-কে জিজ্ঞেস করলাম, ইনি কি আমাদের কাছে ছবি সম্পর্কীয় হাদীস বর্ণনা করেননি? তখন তিনি বলেছেন, প্রাণীর; তবে কাপড়ের মধ্যে কিছু অংকন করা নিষিদ্ধ নয়, তুমি কি তা শুননি? আমি বললাম, না। তিনি বললেন, হ্যাঁ, তিনি তা বর্ণনা করেছেন।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 129430,
        "last_updated": null
    },
    {
        "banglaURN": 6032270,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1851,
        "babName": null,
        "hadithNumber": 3227,
        "hadithSanad": "",
        "hadithText": "সালিম (রাঃ) তাঁর পিতার নিকট থেকে বর্ণিতঃ তিনি বলেন, জিব্‌রাঈল (‘আঃ)  নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে ওয়াদা দিয়েছিলেন। আমরা ঐ ঘরে প্রবেশ করি না, যে ঘরে ছবি ও কুকুর থাকে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 129440,
        "last_updated": null
    },
    {
        "banglaURN": 6032280,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1851,
        "babName": null,
        "hadithNumber": 3228,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, (সালাতে) ইমাম যখন --------------- বলবে, তখন তোমরা বলবে--------------------- (হে আল্লাহ! আমাদের প্রতিপালক। আপনার জন্য সকল প্রশংসা) কেননা যার এ উক্তি ফেরেশতাগণের উক্তির সঙ্গে মিলে যাবে, তার আগের গুনাহ মাফ করে দেয়া হবে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 129450,
        "last_updated": null
    },
    {
        "banglaURN": 6032290,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1851,
        "babName": null,
        "hadithNumber": 3229,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, ‘তোমাদের কেউ যতক্ষণ পর্যন্ত সালাতে রত থাকবে ততক্ষণ পর্যন্ত ফেরেশতাগণ এ বলে দু’আ করতে থাকে, হে আল্লাহ! তাকে ক্ষমা করে দিন এবং হে আল্লাহ! তার প্রতি রহম করুন যতক্ষণ পর্যন্ত লোকটি সালাত ছেড়ে না দাঁড়ায় কিংবা তার উযু ভঙ্গ না হয়।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 129460,
        "last_updated": null
    },
    {
        "banglaURN": 6032300,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1851,
        "babName": null,
        "hadithNumber": 3230,
        "hadithSanad": "",
        "hadithText": "সাফওয়ান ইব্‌নু ইয়া‘লা (রাঃ) তাঁর পিতা থেকে বর্ণিতঃ তিনি বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে মিম্বারে উঠে এ আয়াত তিলাওয়াত করতে শুনেছি;-----------------(আর তারা ডাকল, হে মালিক!) সুফিয়ান (রহঃ) বলেন, ‘আবদুল্লাহ ইব্‌নু মাস‘উদ (রাঃ)-এর ক্বিরাআতে ----------- স্থলে ------------ রয়েছে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 129470,
        "last_updated": null
    },
    {
        "banglaURN": 6032310,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1851,
        "babName": null,
        "hadithNumber": 3231,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ একবার তিনি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে জিজ্ঞেস করলেন, উহুদের দিনের চেয়ে কঠিন কোনদিন কি  আপনার উপর এসেছিল? তিনি  বললেন, আমি তোমার ক্বওম হতে যে বিপদের সম্মুখীন হয়েছি, তাতো হয়েছি। তাদের  হতে অধিক কঠিন বিপদের সম্মুখীন হয়েছি, আকাবার দিন যখন আমি নিজেকে ইব্‌নু ‘আবদে ইয়ালীল ইবনে ‘আবদে কলালের নিকট পেশ করেছিলাম। আমি যা চেয়েছিলাম, সে তার জবাব দেয়নি। তখন আমি এমন ভাবে বিষণ্ণ চেহারা নিয়ে ফিরে এলাম যে, কারনুস সাআলিবে পৌছা পর্যন্ত আমার চিন্তা দূর হয়নি। তখন আমি মাথা উপরে উঠালাম। হঠাৎ দেখতে পেলাম এক টুকরো মেঘ আমাকে ছায়া দিচ্ছে। আমি সেদিকে তাকালাম। তারমধ্যে ছিলেন জিবরাঈল (‘আঃ)। তিনি আমাকে ডেকে বললেন, আপনার ক্বওম আপনাকে যা বলেছে এবং তারা উত্তরে যা বলেছে তা সবই আল্লাহ শুনেছেন। তিনি আপনার নিকট পাহাড়ের ফেরেশতাকে পাঠিয়েছেন। এদের সম্পর্কে আপনার যা ইচ্ছে  আপনি তাঁকে হুকুম দিতে  পারেন। তখন  পাহাড়ের ফেরেশতা আমাকে ডাকলেন এবং আমাকে সালাম দিলেন। অতঃপর বললেন, হে মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)! এসব ব্যাপার আপনার ইচ্ছাধীন। আপনি যদি চান, তাহলে আমি তাদের উপর আখশাবাইন [১] কে চাপিয়ে দিব। উত্তরে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, বরং আশা করি মহান আল্লাহ তাদের বংশ থেকে এমন সন্তান জন্ম দেবেন যারা এক আল্লাহর  ‘ইবাদত করবে আর তাঁর সঙ্গে কাউকে শরীক করবেনা।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 129480,
        "last_updated": null
    },
    {
        "banglaURN": 6032320,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1851,
        "babName": null,
        "hadithNumber": 3232,
        "hadithSanad": "",
        "hadithText": "আবূ ইসহাক শায়বানী (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি যির ইব্‌নু হুবাইশ (রাঃ)–কে মহান আল্লাহর এ বাণীঃ  ‘‘অবশেষে তাদের মধ্যে দুই ধনুকের দূরত্ব রইল অথবা আরও কম। তখন আল্লাহ স্বীয় বান্দার প্রতি যা ওয়াহী করার ছিল, তা ওয়াহী করলেন’’- (আন্-নাজম ৯-১০)। এ সম্পর্কে জিজ্ঞেস করলাম। তিনি বললেন, ইব্‌নু মাস‘উদ (রাঃ)  আমাদের নিকট বর্ণনা করেছেন যে, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) জিবরাঈল (‘আঃ)-কে দেখেছেন। তাঁর ছয়শ’টি ডানাছিল।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 129490,
        "last_updated": null
    },
    {
        "banglaURN": 6032330,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1851,
        "babName": null,
        "hadithNumber": 3233,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ ইব্‌নু মাস‘উদ (রাঃ) থেকে বর্ণিতঃ তিনি এ আয়াতঃ তিনি তো স্বীয় রবের মহান নিদর্শনসমূহ দর্শন করেছেন।’’ (আন্-নাজম ১৮)–এর মর্মার্থে বলেন, তিনি  (নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)) সবুজবর্ণের রফরফ [২] দেখেছেন, যা আকাশের দিগন্তকে আবৃত করে রেখেছিল।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 129500,
        "last_updated": null
    },
    {
        "banglaURN": 6032340,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1851,
        "babName": null,
        "hadithNumber": 3234,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, যে ব্যক্তি মনে করবে যে, মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁর রবকে দেখেছেন, সে ব্যক্তি মহা ভুল করবে। বরং তিনি জিব্‌রাঈল (‘আঃ)–কে তাঁর আসল আকার ও চেহারায় দেখেছেন। তিনি আকাশের দিকচক্রবাল জুড়ে অবস্থান করছিলেন।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 129510,
        "last_updated": null
    },
    {
        "banglaURN": 6032350,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1851,
        "babName": null,
        "hadithNumber": 3235,
        "hadithSanad": "",
        "hadithText": "মাসরূক (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি ‘আয়িশা (রাঃ)-কে আল্লাহ্‌র বাণীঃ ‘‘তারপর সে তার নিকটবর্তী হল এবং আতি নিকটবর্তী হল, অবশেষে তাদের মধ্যে দুই ধনুকের দূরত্ব রইল আথবা আরও কম’’ (আন্-নাজম ৮,৯) – এর অর্থ সম্পর্কে জিজ্ঞেস করলাম। তিনি বললেন, তিনি জিব্‌রাঈল (‘আঃ) ছিলেন। তিনি সাধারণত মানুষের আকার নিয়ে তাঁর নিকট আসতেন। কিন্তু এবার তিনি নিকটে এসেছিলেন তাঁর আসল চেহারা নিয়ে। তখন তিনি আকাশের সম্পূর্ণ দিকচক্রবাল আবৃত করে ফেলেছিলেন।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 129520,
        "last_updated": null
    },
    {
        "banglaURN": 6032360,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1851,
        "babName": null,
        "hadithNumber": 3236,
        "hadithSanad": "",
        "hadithText": "সামূরাহ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, আজ রাতে আমি দেখেছি, দু’ব্যক্তি আমার নিকট আসেছে। তারা বলল, যে অগ্নি প্রজ্বলিত করছিল সে হলো দোযখের তত্ত্বাবধায়ক মালিক আর আমি জিব্‌রাঈল এবং ইনি মীকাঈল।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 129530,
        "last_updated": null
    },
    {
        "banglaURN": 6032370,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1851,
        "babName": null,
        "hadithNumber": 3237,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, কোন লোক যদি নিজ স্ত্রীকে নিজ বিছানায় আসতে ডাকে আর সে অস্বীকার করে এবং সে ব্যক্তি স্ত্রীর উপর দুঃখ নিয়ে রাত্রি যাপন করে,  তাহলে ফেরেশতাগণ এমন স্ত্রীর উপর সকাল পর্যন্ত লা‘নত দিতে থাকে। শুবা, আবূ হামযাহ্, ইব্‌নু দাউদ ও আবূ মু‘আবিয়াহ (রহঃ) হতে হাদীস বর্ণনায় আবূ আওয়ানাহ  (রহঃ)-এর অনুসরণ করেছেন।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 129540,
        "last_updated": null
    },
    {
        "banglaURN": 6032380,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1851,
        "babName": null,
        "hadithNumber": 3238,
        "hadithSanad": "",
        "hadithText": "জাবির ইব্‌নু ‘আবদিল্লাহ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) – কে বলতে শুনেছি। আমার নিকট হতে কিছুদিনের জন্য ওয়াহী বন্ধ হয়ে গেল। আমি পথ চলতেছিলাম। এরই মধ্যে আকাশ হতে একটি আওয়াজ শুনতে পেলাম। তখন আমি আকাশের দিকে দৃষ্টি তুললাম। হঠাৎ দেখতে পেলাম, হেরা পাহাড়ের গুহায় আমার নিকট যে ফেরেশতা এসেছিলেন, তিনি আকাশ ও যমীনের মাঝখানে একটি কুরসীর উপর বসে আছেন। আমি তাতে ভীত হয়ে গেলাম, এমন কি মাটিতে পড়ে যাবার উপক্রম হলাম। অতঃপর আমি আমার পরিজনের নিকট এলাম এবং বললাম, আমাকে কম্বল দিয়ে আবৃত কর, আমাকে কম্বল দিয়ে আবৃত কর। তখন মহান আল্লাহ্‌  এ আয়াত অবতীর্ণ করেনঃ ------------- হে বস্ত্রাবৃত। উঠ, সতর্কবাণী প্রচার কর.....অপবিত্রতা হতে দূরে থাক। (আল-মুদ্দাসসিরঃ ১-৫) আবূ সালামা (রাঃ) বলেন, অত্র আয়াতে ------ হল প্রতিমা।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 129550,
        "last_updated": null
    },
    {
        "banglaURN": 6032390,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1851,
        "babName": null,
        "hadithNumber": 3239,
        "hadithSanad": "",
        "hadithText": "নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)- এর চাচা ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)  বলেন, মিরাজের রাত্রে আমি মূসা (‘আঃ)- কে দেখেছি। তিনি গোধুম বর্ণের পুরুষ ছিলেন;  দেহের গঠন ছিল লম্বা। মাথার চুল ছিল কোঁকড়ানো। যেন তিনি শানুআ গোত্রের জনৈক ব্যক্তি। আমি ‘ঈসা (‘আঃ)- কে দেখতে পাই। তিনি ছিলেন মধ্যম গঠনের লোক। তাঁর দেহবর্ণ ছিল সাদা লালে মিশ্রিত। তিনি ছিলেন মধ্যম দেহবিশিষ্ঠ। মাথার চুল ছিল অকুঞ্চিত। জাহান্নামের তত্ত্বাবধায়ক মালিক এবং দাজ্জালকেও আমি দেখেছি। আল্লাহ তা‘আলা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)–কে বিশেষ করে যে সকল নিদর্শনসমূহ দেখিয়েছেন তার মধ্যে এগুলোও ছিল সুতরাং তাঁর সঙ্গে সাক্ষাতের বিষয়ে তুমি সন্দেহ পোষণ করবেনা। আনাস এবং আবূ বাকরাহ (রাঃ) নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে বর্ণনা করেছেন, ফেরেশতা মণ্ডলী মদীনাকে দাজ্জাল হতে পাহারা দিয়ে রাখবেন।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 129560,
        "last_updated": null
    },
    {
        "banglaURN": 6032400,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1852,
        "babName": null,
        "hadithNumber": 3240,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, যখন তোমাদের কোন ব্যক্তি মারা যায় তখন সকাল-সন্ধায় তার পরকালের আবাসস্থল তার নিকট পেশ করা হয়। সে যদি জান্নাতবাসী হয় তবে তাকে জান্নাতবাসীর আবাস স্থান আর যদি সে জাহান্নাম বাসী হয় তবে তাকে জাহান্নামবাসীর আবাসস্থান দেখান হয়।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 129570,
        "last_updated": null
    },
    {
        "banglaURN": 6032410,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1852,
        "babName": null,
        "hadithNumber": 3241,
        "hadithSanad": "",
        "hadithText": "‘ইমরান ইব্‌নু হুসাইন (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, ‘আমি জান্নাতের অধিবাসী সম্পর্কে জ্ঞাত হয়েছি। আমি জানতে পারলাম, জান্নাতে অধিকাংশ অধিবাসী হবে দরিদ্রলোক। জাহান্নামীদের সম্পর্কে জ্ঞাত হয়েছি, আমি জানতে পারলাম, এর বেশির ভাগ অধিবাসী নারী।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 129580,
        "last_updated": null
    },
    {
        "banglaURN": 6032420,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1852,
        "babName": null,
        "hadithNumber": 3242,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, ‘এক সময় আমরা নবী  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)- এর নিকট উপবিষ্ট ছিলাম। তিনি বললেন, আমি নিদ্রিত ছিলাম। দেখলাম আমি জান্নাতে অবস্থিত। হঠাৎ দেখলাম এক নারী একটি দালানের পাশে উযু করছে। আমি জিজ্ঞেস করলাম, এ দালানটি কার?  তারা উত্তরে বললেন, ‘উমারের। তখন তাঁর আত্মমর্যাদার কথা আমার স্মরণ হল। আমি পেছনের দিকে ফিরে চলে আসলাম।’ একথা শুনে ‘উমর (রাঃ) কেঁদে ফেললেন এবং বললেন, ‘হে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আপনার সম্মুখে কি আমার কোন মর্যাদাবোধ থাকতে পারে?</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 129590,
        "last_updated": null
    },
    {
        "banglaURN": 6032430,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1852,
        "babName": null,
        "hadithNumber": 3243,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ ইব্‌নু কায়স আল-আশ‘আরী (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)  বলেছেন,  ‘গুণসম্পন্ন মোতির তাঁবু থাকবে যার উচ্চতা ত্রিশ মাইল। এর প্রতিটি কোণে মু’মিনদের জন্য এমন স্ত্রী থাকবে যাদেরকে অন্যরা কখনো দেখেনি।’ আবূ ‘আবদুস সামাদ ও হারিস ইব্‌নু ‘উবায়দ আবূ ‘ইমরান (রহঃ) হতে ষাট মাইল বলে বর্ণনা করেছেন।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 129600,
        "last_updated": null
    },
    {
        "banglaURN": 6032440,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1852,
        "babName": null,
        "hadithNumber": 3244,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, ‘মহান আল্লাহ বলেছেন, আমি আমার নেককার বান্দাদের জন্য এমন জিনিস তৈরি করে রেখেছি, যা কোন চক্ষু দেখেনি, কোন কান শুনেনি এবং যার সম্পর্কে কোন মানুষের মনে ধারণাও জন্মেনি। তোমরা চাইলে এ আয়াতটি পাঠ করতে পার,  ‘‘কেউ জানেনা, তাদের জন্য তাদের চোখ শীতলকারী কী জিনিস লুকানো আছে’’- (আসসাজদাহঃ ১৩)</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 129610,
        "last_updated": null
    },
    {
        "banglaURN": 6032450,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1852,
        "babName": null,
        "hadithNumber": 3245,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন,  ‘যে দল প্রথমে জান্নাতে প্রবেশ করবে তাদের চেহারা পূর্ণিমার রাতের চাঁদের মত উজ্জ্বল হবে। তারা সেখানে থুথু ফেলবে না,  নাক ঝাড়বেনা,  মল মূত্র ত্যাগ করবেনা। সেখানে তাদের পাত্র হবে স্বর্ণের;  তাদের চিরুণী হবে স্বর্ণ ও রৌপ্যের, তাদের ধুনুচিতে থাকবে সুগন্ধি কাষ্ঠ। তাদের গায়ের ঘাম মিসকের মত সুগন্ধময় হবে। তাদের প্রত্যেকের জন্য এমন দু’জন স্ত্রী থাকবে যাদের সৌন্দর্যের কারণে গোশত ভেদ করে পায়ের নলার হাড়ের মজ্জা দেখা যাবে। তাদের মধ্যে কোন মতভেদ থাকবে না; পরস্পর হিংসা-বিদ্বেষ থাকবে না। তাদের সকলের অন্তর এক অন্তরের মত হবে। তারা সকাল- সন্ধ্যায় আল্লাহর তাসবীহ পাঠ করতে থাকবে।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 129620,
        "last_updated": null
    },
    {
        "banglaURN": 6032460,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1852,
        "babName": null,
        "hadithNumber": 3246,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন,  ‘প্রথম যে দল জান্নাতে প্রবেশ করবে তারা পূর্ণিমার চাঁদের মত উজ্জ্বল চেহারা নিয়ে প্রবেশ করবে আর তাদের পর যারা প্রবেশ করবে তারা অতি উজ্জ্বল তারার ন্যায় আকৃতি ধারন করবে। তাদের অন্তরগুলো এক ব্যাক্তির অন্তরের মত থকবে। তাদের মধ্যে কোন রকম মতভেদ থাকবে না আর পরস্পর হিংসা-বিদ্বেষ থাকবে না। তাদের প্রত্যেকের দু’জন করে স্ত্রী থাকবে। সৌন্দর্যের কারণে গোশ্‌ত ভেদ করে পায়ের নলার মজ্জা দেখা যাবে। তারা সকাল- সন্ধ্যায় আল্লাহর তাসবীহ পাঠ করবে। তারা রোগাক্রান্ত হবে না, নাক ঝাড়বেনা, থুথু ফেলবে না। তাদের পাত্রসমূহ হবে স্বর্ণ ও রৌপ্যের আর চিরুণী হবে স্বর্ণের। তাদের ধুনুচিতে থাকবে সুগন্ধি কাষ্ঠ।’ আবুল ইয়ামান (রহঃ) বলেন, অর্থাৎ কাষ্ঠ। তাদের গায়ের ঘাম মিসকের মত সুগন্ধময় হবে। মুজাহিদ (রহঃ) বলেন, --- অর্থ উষাকালের প্রথম অংশ --- অর্থ সূর্য ঢলে পড়ার সময় হতে অস্ত যাওয়া পর্যন্ত সময়কাল।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 129630,
        "last_updated": null
    },
    {
        "banglaURN": 6032470,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1852,
        "babName": null,
        "hadithNumber": 3247,
        "hadithSanad": "",
        "hadithText": "সাহ্‌ল ইব্‌নু সা’দ (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম), বলেছেন, আমার উম্মাতের সত্তর হাজার লোক অথবা সাত লক্ষ লোক একই সঙ্গে জান্নাতে প্রবেশ করবে। তাদের কেউ আগে কেউ পরে এভাবে নয় আর তাদের চেহারা পূর্ণিমার চাঁদের মত উজ্জ্বল থাকবে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 129640,
        "last_updated": null
    },
    {
        "banglaURN": 6032480,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1852,
        "babName": null,
        "hadithNumber": 3248,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্‌নু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে একটি রেশমী জুব্বা হাদিয়া দেয়া হল। অথচ তিনি রেশমী বস্ত্র পরতে নিষেধ করতেন; লোকেরা তা খুব পছন্দ করল। তখন তিনি বললেন, ঐ সত্তার কসম! যাঁর হাতে মুহাম্মাদের প্রাণ, অবশ্যই জান্নাতে সা’দ ইবনু মুআ’যের রুমাল এর থেকে বেশি সুন্দর হবে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 129650,
        "last_updated": null
    },
    {
        "banglaURN": 6032490,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1852,
        "babName": null,
        "hadithNumber": 3249,
        "hadithSanad": "",
        "hadithText": "বারাআ ইব্‌নু ‘আযির (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট একখানা রেশমী বস্ত্র আনা হল। লোকজন এর সৌন্দর্য এবং কমনীয়তার জন্য সেটা খুব পছন্দ করতে লাগল। তখন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, ‘অবশ্যই জান্নাতে সা’দ ইব্‌নু মু’আযের রুমাল এর থেকেও বেশি উত্তম হবে’।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 129660,
        "last_updated": null
    },
    {
        "banglaURN": 6032500,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1852,
        "babName": null,
        "hadithNumber": 3250,
        "hadithSanad": "",
        "hadithText": "সাহ্‌ল ইব্‌নু সা’দ আস্‌সা’ইয়িদী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, ‘জান্নাতে চাবুক পরিমাণ সামান্য জায়গাও দুনিয়া এবং এর মধ্যে যা আছে তার থেকে উত্তম।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 129670,
        "last_updated": null
    },
    {
        "banglaURN": 6032510,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1852,
        "babName": null,
        "hadithNumber": 3251,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্‌নু মালিক (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, জান্নাতে এমন একটি গাছ আছে, যার ছায়ায় কোন আরোহী শত বছর পর্যন্ত চললেও তা অতিক্রম করতে পারবে না।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 129680,
        "last_updated": null
    },
    {
        "banglaURN": 6032540,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1852,
        "babName": null,
        "hadithNumber": 3254,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, প্রথম যে দল জান্নাতে প্রবেশ করবে তাদের চেহারা পূর্ণিমা রাতের চাঁদের মত উজ্জ্বল হবে আর তাদের অনুগামী দলের চেহারা আকাশের উজ্জ্বল তারকার চেয়েও অধিক সুন্দর ও উজ্জ্বল হবে। তাদের অন্তরগুলো এক ব্যক্তির অন্তরের মত হবে। তাদের মধ্যে কোন বিদ্বেষ থাকবে না, কোন হিংসা থাকবে না, তাদের প্রত্যেকের জন্য  ডাগর ডাগর চোখওয়ালা দু’জন করে এমন স্ত্রী থাকবে, যাদের পদ তলের অস্থি মজ্জা ও গোশত ভেদ করে দেখা যাবে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 129700,
        "last_updated": null
    },
    {
        "banglaURN": 6032550,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1852,
        "babName": null,
        "hadithNumber": 3255,
        "hadithSanad": "",
        "hadithText": "বারাআ (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, যখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) (এর ছেলে) ইবরাহীম (রাঃ) ইন্তিকাল করেন, তখন তিনি বলেন, জান্নাতে এর এক ধাত্রী আছে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 129710,
        "last_updated": null
    },
    {
        "banglaURN": 6032560,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1852,
        "babName": null,
        "hadithNumber": 3256,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ খুদরী (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, অবশ্যই জান্নাতবাসীরা তাদের উপরের বালাখানার বাসিন্দাদের এমনভাবে দেখতে পাবে, যেমন তোমরা আকাশের পূর্ব অথবা পশ্চিম দিকে উজ্জ্বল দীপ্তিমান নক্ষত্র দেখতে পাও। এটা হবে তাদের মধ্যে মর্যাদার পার্থক্যের কারণে। সাহাবীগণ বললেন, ‘হে আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এ তো নবীগণের জায়গা। তাদের ব্যতিত অন্যরা সেখানে পৌঁছতে পারবে না। তিনি বললেন, হ্যাঁ, সে সত্তার কসম, যাঁর হাতে আমার প্রাণ, যেসব লোক আল্লাহ্‌র প্রতি ঈমান আনবে এবং রসূলগণকে সত্য বলে স্বীকার করবে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 129720,
        "last_updated": null
    },
    {
        "banglaURN": 6032570,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1853,
        "babName": null,
        "hadithNumber": 3257,
        "hadithSanad": "",
        "hadithText": "সাহ্‌ল ইব্‌নু সা’দ (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, ‘জান্নাতে আটটি দরজা। তার মধ্যে একটি দরজার নাম হবে রাইয়্যান। সাওম পালনকারী ছাড়া অন্য কেউ এ দরজা দিয়ে প্রবেশ করবে না’।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 129730,
        "last_updated": null
    },
    {
        "banglaURN": 6032580,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1854,
        "babName": null,
        "hadithNumber": 3258,
        "hadithSanad": "",
        "hadithText": "আবূ যার (রাঃ) থেকে বর্ণিতঃ তিনি বলেন যে, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এক সফরে ছিলেন, তখন তিনি বলেন, ‘ঠাণ্ডা হতে দাও।’ আবার বললেন, ‘টিলাগুলোর ছায়া নীচে নেমে আসা পর্যন্ত ঠাণ্ডা হতে দাও।’ আবার বললেন, ‘সালাত ঠাণ্ডা হলে পরে আদায় করবে। কেননা, গরমের তীব্রতা জাহান্নামের উত্তাপ থেকে হয়।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 129740,
        "last_updated": null
    },
    {
        "banglaURN": 6032590,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1854,
        "babName": null,
        "hadithNumber": 3259,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন যে, ‘সালাত ঠাণ্ডা হলে, পরে আদায় করবে। কেননা গরমের ভীষণতা জাহান্নামের উত্তাপ হতে হয়।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 129750,
        "last_updated": null
    },
    {
        "banglaURN": 6032600,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1854,
        "babName": null,
        "hadithNumber": 3260,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, ‘জাহান্নাম তার রবের নিকট অভিযোগ করে বলেছে, হে রব! আমার এক অংশ অপর অংশকে খেয়ে ফেলেছে। তখন তিনি তাকে দু’টি নিঃশ্বাস ফেলার অনুমতি প্রদান করেন। একটি নিঃশ্বাস শীতকালে আর একটি নিঃশ্বাস গ্রীষ্মকালে। কাজেই তোমরা গরমের তীব্রতা এবং শীতের তীব্রতা পেয়ে থাক।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 129760,
        "last_updated": null
    },
    {
        "banglaURN": 6032610,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1854,
        "babName": null,
        "hadithNumber": 3261,
        "hadithSanad": "",
        "hadithText": "আবূ জামরাহ যুবা’য়ী (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি মক্কায় ইব্‌নু আব্বাস (রাঃ)-এর নিকট বসতাম। একবার আমি জ্বরাক্রান্ত হই। তখন তিনি আমাকে বললেন, ‘তুমি তোমার গায়ের জ্বর যমযমের পানি দিয়ে ঠাণ্ডা কর।’ কারণ, আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, এটা জাহান্নামের উত্তাপ হতেই হয়ে থাকে। কাজেই তোমরা তা পানি দিয়ে ঠাণ্ডা কর অথবা বলেছেন। যমযমের পানি দিয়ে ঠাণ্ডা কর। এ বিষয়ে বর্ণনাকারী হাম্মাম সন্দেহ পোষণ করেছেন।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 129770,
        "last_updated": null
    },
    {
        "banglaURN": 6032620,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1854,
        "babName": null,
        "hadithNumber": 3262,
        "hadithSanad": "",
        "hadithText": "রাফি’ ইব্‌নু খাদীজ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছি যে, ‘জ্বরের উৎপত্তি হয় জাহান্নামের ভীষণ উত্তাপ হতে। অতএব তোমাদের গায়ের সে তাপ পানি দ্বারা ঠাণ্ডা কর।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 129780,
        "last_updated": null
    },
    {
        "banglaURN": 6032630,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1854,
        "babName": null,
        "hadithNumber": 3263,
        "hadithSanad": "",
        "hadithText": "আয়িশাহ (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, ‘জ্বর হয় জাহান্নামের উত্তাপ থেকে। কাজেই তোমরা তা পানি দিয়ে ঠাণ্ডা কর।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 129790,
        "last_updated": null
    },
    {
        "banglaURN": 6032640,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1854,
        "babName": null,
        "hadithNumber": 3264,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, ‘জ্বর হয় জাহান্নামের উত্তাপ থেকে, কাজেই তোমরা পানি দিয়ে তা ঠাণ্ডা কর।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 129800,
        "last_updated": null
    },
    {
        "banglaURN": 6032650,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1854,
        "babName": null,
        "hadithNumber": 3265,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, তোমাদের আগুন জাহান্নামের আগুনের সত্তর ভাগের একভাগ মাত্র। বলা হল, ‘হে আল্লাহর রসূল! জাহান্নামীদেরকে শাস্তি দেয়ার জন্য দুনিয়ার আগুনই তো যথেষ্ট ছিল।’ তিনি বললেন, ‘দুনিয়ার আগুনের উপর জাহান্নামের আগুনের তাপ আরো ঊনসত্তর গুন বাড়িয়ে দেয়া হয়েছে, প্রত্যেক অংশে তার সম পরিমাণ উত্তাপ রয়েছে।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 129810,
        "last_updated": null
    },
    {
        "banglaURN": 6032660,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1854,
        "babName": null,
        "hadithNumber": 3266,
        "hadithSanad": "",
        "hadithText": "ইয়া’লা (রাঃ) এর পিতা থেকে বর্ণিতঃ তিনি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে মিম্বারে তিলওয়াত করতে শুনেছেন, “আর তারা ডাকবে, হে মালিক।”  (সূরা যুখরুফঃ ৭৭)</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 129820,
        "last_updated": null
    },
    {
        "banglaURN": 6032670,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1854,
        "babName": null,
        "hadithNumber": 3267,
        "hadithSanad": "",
        "hadithText": "আবূ ওয়াইল (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, উসামা (রাঃ)-কে বলা হল, কত ভাল হত! যদি আপনি ঐ ব্যক্তির [উসমান (রাঃ)]-এর নিকট যেতেন এবং তার সঙ্গে আলোচনা করতেন। উত্তরে তিনি বললেন, আপনারা মনে করছেন যে আমি তাঁর সঙ্গে আপনাদেরকে শুনিয়ে শুনিয়ে বলব। অথচ আমি তাঁর সঙ্গে (দাঙ্গা দমনের ব্যাপারে) গোপনে আলোচনা করছি, যেন আমি একটি দ্বার খুলে না বসি। আমি দ্বার উন্মুক্তকারীর প্রথম ব্যক্তি হতে চাই না। আমি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট হতে কিছু শুনেছি, যার পরে আমি কোন ব্যক্তিকে যিনি আমাদের আমীর নির্বাচিত হয়েছেন এ কারণে তিনি আমাদের সবচেয়ে উত্তম ব্যক্তি এ কথা বলতে পারি না। লোকেরা তাঁকে বলল, আপনি তাঁকে কি বলতে শুনেছেন? উসা্‌মাহ (রাঃ) বললেন, আমি তাঁকে বলতে শুনেছি, ক্বিয়ামতের দিন এক ব্যক্তিকে আনা হবে। অরঃপর তাকে জাহান্নামে নিক্ষেপ করা হবে। তখন আগুনে পুড়ে তার নাড়িভুঁড়ি বের হয়ে যাবে। এ সময় সে ঘুরতে থাকবে যেমন গাধা তার চাকা নিয়ে তার চারপাশে ঘুরতে থাকে। তখন জাহান্নামবাসীরা তার নিকট একত্রিত হয়ে তাকে বলবে, হে অমুক ব্যক্তি! তোমার এ অবস্থা কেন? তুমি না আমাদেরকে সৎ কাজের আদেশ করতে আর অন্যায় কাজ হতে নিষেধ করতে? সে বলবে, আমি তোমাদেরকে সৎ কাজের আদেশ করতাম বটে, কিন্তু আমি তা করতাম না আর আমি তোমাদেরকে অন্যায় কাজ হতে নিষেধ করতাম, অথচ আমিই তা করতাম। এ হাদীসটি গুনদার (রহঃ) শুবা (রহঃ) সূত্রে আ’মাশ (রহঃ) হতে বর্ণনা করেছেন।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 129830,
        "last_updated": null
    },
    {
        "banglaURN": 6032680,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3268,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে যাদু করা হয়েছিল। লায়স (রহঃ) বলেন, আমার নিকট হিশাম পত্র লিখেন, তাতে লেখা ছিল যে, তিনি তার পিতা সূত্রে ‘আয়িশা (রাঃ) হতে হাদীস শুনেছেন এবং তা ভালভাবে মুখস্থ করেছেন। ‘আয়িশা (রাঃ) বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) কে যাদু করা হয়। এমনকি যাদুর প্রভাবে তাঁর খেয়াল হতো যে, তিনি স্ত্রীগণের বিষয়ে কোন কাজ করে ফেলেছেন অথচ তিনি তা করেননি। শেষ পর্যন্ত একদা তিনি রোগ আরোগ্যের জন্য বারবার দু’আ করলেন, অরঃপর তিনি আমাকে বললেন, তুমি কি জান আল্লাহ আমাকে জানিয়ে দিয়েছেন, যাতে আমার রোগের আরোগ্য আছে? আমার নিকট দু’জন লোক আসল। তাদের একজন মাথার নিকট বসল আর অপরজন আমার পায়ের নিকট বসল। অরঃপর একজন অন্যজনকে জিজ্ঞেস করল, এ ব্যক্তির রোগ কি? জিজ্ঞাসিত লোকটি জবাব দিল, তাকে যাদু করা হয়েছে। প্রথম লোকটি বলল, তাকে যাদু কে করল? সে বলল, লবীদ ইব্‌নু আ’সাম। প্রথম ব্যক্তি বলল, কিসের দ্বারা? দ্বিতীয় ব্যক্তি বলল, তাকে যাদু করা হয়েছে, চিরুনি, সুতার তাগা এবং খেজুরের খোসায়। প্রথম ব্যক্তি জিজ্ঞেস করল, এগুলো কোথায় আছে? দ্বিতীয় ব্যক্তি জবাব দিল, যারওয়ান কূপে। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সেখানে গেলেন এবং ফিরে আসলেন, অতঃপর তিনি ‘আয়িশা (রাঃ)-কে বললেন, কূপের কাছের খেজুর গাছগুলো যেন এক একটা শয়তানের মাথা। তখন আমি জিজ্ঞেস করলাম, আপনি কি সেই যাদু করা জিনিসগুলো বের করতে পেরেছেন? তিনি বললেন, না। তবে আল্লাহ আমাকে আরোগ্য দিয়েছেন। আমার আশংকা হয়েছিল এসব জিনিস বের করলে মানুষের মধ্যে ফাসাদ সৃষ্টি হতে পারে। অতঃপর সেই কূপটি বন্ধ করে দেয়া হল।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 129840,
        "last_updated": null
    },
    {
        "banglaURN": 6032690,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3269,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, ‘তোমাদের কেউ যখন নিদ্রা যায় তখন শয়তান তার মাথার শেষভাগে তিনটি গিরা দিয়ে দেয়। প্রত্যেক গিরার সময় এ কথা বলে কুমন্ত্রণা দিয়ে দেয় যে, এখনো রাত অনেক রয়ে গেছে, কাজেই শুয়ে থাক। অতঃপর সে লোক যদি জেগে উঠে এবং আল্লাহকে স্মরণ করে তখন একটি গিরা খুলে যায়। অতঃপর যদি সে উযূ করে, তবে দ্বিতীয় গিরাও খুলে যায়। আর যদি সে সালাত আদায় করে তবে সব কয়টি গিরাই খুলে যায়। আর খুশির সঙ্গে পবিত্র মনে তার সকাল হয়, অন্যথায় অপবিত্র মনে আলস্যের সাথে তার সকাল হয়।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 129850,
        "last_updated": null
    },
    {
        "banglaURN": 6032700,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3270,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট এমন এক লোকের ব্যাপারে উল্লেখ করা হল, যে সারা রাত এমনকি ভোর পর্যন্ত ঘুমিয়ে ছিল। তখন তিনি বললেন, সে এমন লোক যার উভয় কানে অথবা তিনি বললেন, তার কানে শয়তান পেশাব করেছে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 129860,
        "last_updated": null
    },
    {
        "banglaURN": 6032710,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3271,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, দেখ, তোমাদের কেউ যখন তার স্ত্রীর কাছে আসে, আর তখন বলে, বিসমিল্লাহ্‌। হে আল্লাহ! আমাদেরকে শয়তানের প্রভাব থেকে দূরে রাখ। আর আমাদেরকে যে সন্তান দেয়া হবে শয়তান তার কোন ক্ষতি করতে পারবে না।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 129870,
        "last_updated": null
    },
    {
        "banglaURN": 6032740,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3274,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, সালাত আদায়ের সময় তোমাদের কারো সম্মুখ দিয়ে যখন কেউ চলাচল করবে তখন সে তাকে অবশ্যই বাধা দিবে। সে যদি অমান্য করে তবে আবারো তাকে বাধা দিবে। অতঃপরও যদি সে অমান্য করে তবে অবশ্যই তার সঙ্গে লড়াই করবে। কেননা সে শয়তান।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 129900,
        "last_updated": null
    },
    {
        "banglaURN": 6032750,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3275,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাকে রমযানের যাকাত (সাদাকাতুল ফিত্‌রের) হিফাযতের দায়িত্ব প্রাদান করলেন। অতঃপর আমার নিকট এক আগন্তুক আসল। সে তার দু’হাতের আঁজলা ভরে খাদ্যশস্য গ্রহণ করতে লাগল। তখন আমি তাকে ধরে ফেললাম এবং বললাম, আমি অবশ্যই তোমাকে আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট নিয়ে যাব। তখন সে একটি হাদীস উল্লেখ করল এবং বলল, যখন তুমি বিছানায় শুতে যাবে, তখন আয়াতুল কুরসী পড়বে। তাহলে সর্বদা আল্লাহ্‌র পক্ষ হতে তোমার জন্য একজন হিফাযতকারী থাকবে এবং  সকাল হওয়া অবধি তোমার নিকট শয়তান আসতে পারবে না। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, সে তোমাকে সত্য বলেছে, অথচ সে মিথ্যাচারী এবং শয়তান ছিল।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 129910,
        "last_updated": null
    },
    {
        "banglaURN": 6032760,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3276,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, তোমাদের কারো নিকট শয়তান আসতে পারে এবং সে বলতে পারে, এ বস্তু কে সৃষ্টি করেছে? ঐ বস্তু কে সৃষ্টি করেছে? এরূপ প্রশ্ন করতে করতে শেষ পর্যন্ত বলে বসবে, তোমাদের প্রতিপালককে কে সৃষ্টি করেছে? যখন ব্যাপারটি এ স্তরে পৌঁছে যাবে তখন সে যেন অবশ্যই আল্লাহর নিকট আশ্রয় চায় এবং বিরত হয়ে যায়।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 129920,
        "last_updated": null
    },
    {
        "banglaURN": 6032770,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3277,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, যখন রমযান মাস আরম্ভ হয়, জান্নাতের দরজাগুলো খুলে দেয়া হয় এবং জাহান্নামের দরজাগুলো বন্ধ করে দেয়া হয় আর শয়তানদেরকে শিকলে বেঁধে রাখা হয়।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 129930,
        "last_updated": null
    },
    {
        "banglaURN": 6032780,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3278,
        "hadithSanad": "",
        "hadithText": "উবাই ইব্‌নু কা’ব (রাঃ) থেকে বর্ণিতঃ তিনি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছেন, “মুসা (‘আঃ) তার সঙ্গীকে বললেনঃ আমাদের নাশতা আন, এ সফরে আমরা অবশ্যই ক্লান্ত হয়ে পড়েছি। সঙ্গী বললঃ আপনি কি লক্ষ্য করেছেন, আমরা যখন প্রস্তর খণ্ডের কাছে বিশ্রাম করেছিলাম, তখন আমি মাছের কথা ভুলে গিয়েছিলাম। শয়তানই আমাকে এ কথা স্মরণ রাখতে ভুলিয়ে দিয়েছিল”-  (সূরা কাহ্‌ফ ৬২-৬৩)। আল্লাহ তা’আলা মূসা (‘আঃ)-কে যে স্থানটি সম্পর্কে নির্দেশ দিয়েছিলেন, তিনি সে স্থানটি অতিক্রম করা পর্যন্ত কোন প্রকার ক্লান্তি অনুভব করেননি।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 129940,
        "last_updated": null
    },
    {
        "banglaURN": 6032790,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3279,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে দেখেছি, তিনি পূর্ব দিকে ইঙ্গিত করে বলেছেন, সাবধান! ফিতনা এখানেই। সাবধান! ফিত্‌না এখানেই। সেখান থেকে শয়তানের শিং উদিত হবে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 129950,
        "last_updated": null
    },
    {
        "banglaURN": 6032800,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3280,
        "hadithSanad": "",
        "hadithText": "জাবির (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, ‘সূর্যাস্তের পরপরই যখন রাত শুরু হয় অথবা বলেছেন, যখন রাতের অন্ধকার নেমে আসে তখন তোমরা তোমাদের শিশুদেরকে ঘরে আটকে রাখবে। কারণ এ সময় শয়তানেরা ছড়িয়ে পড়ে। অতঃপর যখন রাতের কিছু অংশ অতিবাহিত হবে তখন তাদের ছেড়ে দিতে পার আর তুমি তোমার ঘরের দরজা বন্ধ করে দাও এবং আল্লাহর নাম স্মরণ কর। তোমার ঘরের বাতি নিভিয়ে দাও এবং আল্লাহ্‌র নাম স্মরণ কর। তোমার পানি রাখার পাত্রের মুখ ঢেকে রাখ এবং আল্লাহর নাম স্মরণ কর। তোমার বাসনপত্র ঢেকে রাখ এবং আল্লাহর নাম স্মরণ কর। সামান্য কিছু হলেও তার ওপর দিয়ে রেখে দাও।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 129960,
        "last_updated": null
    },
    {
        "banglaURN": 6032810,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3281,
        "hadithSanad": "",
        "hadithText": "সাফিয়্যাহ বিন্‌তু হুয়াই (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ই’তিকাফ অবস্থায় ছিলেন। আমি রাতে তাঁর সঙ্গে দেখা করতে আসলাম। অতঃপর তার সঙ্গে কিছু কথা বললাম। অতঃপর আমি ফিরে আসার জন্য দাঁড়ালাম। তখন আল্লাহ্‌র রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-ও আমাকে পৌঁছে দেয়ার জন্য আমার সঙ্গে উঠে দাঁড়ালেন। আর তার বাসস্থান ছিল উসামা ইব্‌নু যায়দের বাড়িতে। এ সময় দু’জন আনসারী সে স্থান দিয়ে অতিক্রম করল। তারা যখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে দেখল তখন তারা শীঘ্র চলে যেতে লাগল। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, তোমরা একটু থাম। এ সাফিয়্যা বিন্‌তে হুয়াই। তারা বললেন, সুবহানাল্লাহ! হে আল্লাহ্‌র রসূল! তিনি বললেন, মানুষের রক্তধারায় শয়তান প্রবাহমান থাকে। আমি শঙ্কাবোধ করছিলাম, সে তোমাদের মনে কোন খারাপ ধারণা অথবা বললেন অন্য কিছু সৃষ্টি করে না কি।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 129970,
        "last_updated": null
    },
    {
        "banglaURN": 6032820,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3282,
        "hadithSanad": "",
        "hadithText": "সুলাইমান ইব্‌নু সুরাদ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সঙ্গে উপবিষ্ট ছিলাম। তখন দু’জন লোক গালাগালি করছিল। তাদের এক জনের চেহারা লাল হয়ে গিয়েছিল এবং তার রগগুলো ফুলে গিয়েছিল। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, আমি এমন একটি দু’আ জানি, যদি এ লোকটি পড়ে তবে তার রাগ দূর হয়ে যাবে। সে যদি পড়ে “আ’উযুবিল্লাহি মিনাশ শায়তান”- আমি শয়তান হতে আল্লাহর নিকট আশ্রয় চাই। তবে তার রাগ চলে যাবে। তখন তাকে বলল, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, তুমি আল্লাহর নিকট শয়তান থেকে আশ্রয় চাও। সে বলল, আমি কি পাগল হয়েছি?</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 129980,
        "last_updated": null
    },
    {
        "banglaURN": 6032830,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3283,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, তোমাদের কেউ যখন স্ত্রীর নিকট গমন করে এবং বলে, “হে আল্লাহ্‌! আমাকে শয়তান হতে রক্ষা আর আমাকে এর মাধ্যমে যে সন্তান দিবে তাকেও শয়তান থেকে হেফাজত কর”। তাহলে যদি তাদের কোন সন্তান জন্মায়, তবে শয়তান তার কোন ক্ষতি করতে পারবে না এবং তার উপর কোন প্রভাব ফেলতে পারবে না। আসমা (রহঃ)..... ইব্‌নু ‘আব্বাস (রাঃ) নিকট হতে অনুরূপ রিওয়ায়ত বর্ণনা করেন।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 129990,
        "last_updated": null
    },
    {
        "banglaURN": 6032840,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3284,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সালাত আদায় করলেন। অতঃপর বললেন, শয়তান আমার সামনে এসেছিল। সে আমার সালাত নষ্ট করার চেষ্টা করেছিল। কিন্তু আল্লাহ আমাকে তার উপর বিজয়ী করেন। অতঃপর পূর্ণাঙ্গ হাদীসটি উল্লেখ করেন।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 130000,
        "last_updated": null
    },
    {
        "banglaURN": 6032850,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3285,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, যখন সালাতের জন্যে আযান দেয়া হয় তখন শয়তান সশব্দে বায়ু ছাড়তে ছাড়তে পালাতে থাকে। আযান শেষ হলে সামনে এগিয়ে আসে। আবার যখন ইকামাত দেয়া হয় তখন আবার পালাতে থাকে। ইকামাত শেষ হলে আবার সামনে আসে এবং মানুষের মনে খটকা সৃষ্টি করতে থাকে আর বলতে থাকে ওটা ওটা মনে কর। এমন কি সে ব্যক্তি আর মনে রাখতে পারে না যে, সে কি তিন রাক’আত পড়ল না চার রাক’আত পড়ল। এরকম যদি কারো হয়ে যায়, সে মনে রাখতে পারে না তিন রাকা’আত পড়েছে না কি চার রাকা’আত তখন সে যেন দু’টি সাহু সিজদা করে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 130010,
        "last_updated": null
    },
    {
        "banglaURN": 6032860,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3286,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, প্রত্যেক আদম সন্তানের জন্মের সময় তার পার্শ্বদেশে শয়তান তার দুই আঙ্গুলের দ্বারা খোঁচা মারে। ‘ঈসা ইব্‌নু মরয়াম (‘আঃ)-এর ব্যতিক্রম। সে তাকে খোঁচা মারতে গিয়েছিল। তখন সে পর্দার ওপর খোঁচা মারে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 130020,
        "last_updated": null
    },
    {
        "banglaURN": 6032870,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3287,
        "hadithSanad": "",
        "hadithText": "‘আলকামাহ (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি সিরিয়ায় গেলাম, লোকেরা বলল, ইনি আবূ দারদা (রাঃ)। তিনি জিজ্ঞেস করলেন, ‘তোমাদের মধ্যে কি সে ব্যক্তি আছে, যাকে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর মৌখিক দু’আয় আল্লাহ্‌ শয়তান হতে রক্ষা করেছেন? মুগীরাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, সেই ব্যক্তি যাঁকে আল্লাহ্‌ তাঁর নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর মৌখিক দু’আয় শয়তান হতে রক্ষা করেছিলেন, তিনি হলেন, আম্মার (রাঃ)।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 130030,
        "last_updated": null
    },
    {
        "banglaURN": 6032880,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3288,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, ‘ফেরেশতামণ্ডলী মেঘের মাঝে এমন সব বিষয় আলোচনা করেন, যা পৃথিবীতে ঘটবে। তখন শয়তানেরা দু’ একটি কথা শুনে ফেলে এবং তা জ্যোতিষীদের কানে এমনভাবে ঢেলে দেয় যেমন বোতলে পানি ঢালা হয়। তখন তারা সত্য কথার সঙ্গে শত রকমের মিথ্যা বাড়িয়ে বলে’।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 130040,
        "last_updated": null
    },
    {
        "banglaURN": 6032890,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3289,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)  বলেছেন, হাই তোলা শয়তানের পক্ষ হতে হয়ে থাকে। কাজেই তোমাদের  কারো যখন হাই আসবে যথাসম্ভব তা রোধ করবে। কারণ তোমাদের কেউ হাই তোলার সময় যখন ‘হা’ বলে, তখন শয়তান হাসতে থাকে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 130050,
        "last_updated": null
    },
    {
        "banglaURN": 6032900,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3290,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, উহুদের দিন যখন মুশরিকরা পরাজিত হলো, তখন ইব্‌লীস চিৎকার করে বলল, হে আল্লাহ্‌র বান্দারা! তোমাদের পিছনের লোকদের থেকে সতর্ক হও। কাজেই সামনের লোকেরা পিছনের লোকদের ওপর ঝাঁপিয়ে পড়ল। ফলে উভয় দলের মধ্যে নতুনভাবে লড়াই শুরু হল। হুযাইফাহ (রাঃ) হঠাৎ তার পিতা ইয়ামানকে দেখতে পেলেন। তখন তিনি (হুযাইফাহ) বললেন, হে আল্লাহর বান্দারা! আমার পিতা! আমার পিতা! কিন্তু আল্লাহর কসম, তারা বিরত হয়নি। শেষ পর্যন্ত তারা তাঁকে হত্যা করে ফেলল। তখন হুযাইফাহ (রাঃ) বললেন, আল্লাহ  তোমাদের ক্ষমা করুক। ‘উরওয়াহ (রাঃ) বলেন, আল্লাহর সঙ্গে মিলত হওয়া পর্যন্ত হুযাইফাহ (রাঃ) দু’আ ও ইস্তিগফার করতে থাকেন।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 130060,
        "last_updated": null
    },
    {
        "banglaURN": 6032910,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3291,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা  (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে সালাতের ভিতরে মানুষের এদিক-ওদিক তাকানোর বিষয়ে জিজ্ঞেস করলাম। তিনি বললেন, তা হল শয়তানের এক ধরনের ছিনতাই, যা সে তোমাদের এক জনের সালাত হতে ছিনিয়ে নেয়।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 130070,
        "last_updated": null
    },
    {
        "banglaURN": 6032920,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3292,
        "hadithSanad": "",
        "hadithText": "আবূ ক্বাতাদা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, সৎ ও ভাল স্বপ্ন আল্লাহর তরফ হতে হয়ে থাকে। আর মন্দ স্বপ্ন শয়তানের তরফ হতে হয়ে থাকে। কাজেই তোমাদের কেউ যখন ভয়ানক মন্দ স্বপ্ন দেখে তখন সে যেন তার বাম দিকে থুথু ফেলে আর শয়তানের ক্ষতি হতে আল্লাহর নিকট আশ্রয় চায়। তা হলে স্বপ্ন তার কোন ক্ষতি করতে পারবে না।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 130080,
        "last_updated": null
    },
    {
        "banglaURN": 6032930,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3293,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, যে লোক একশ’বার এ দু’আ’টি পড়বেঃ আল্লাহ ব্যতিত কোন ইলাহা নেই, তিনি একক, তাঁর কোন শরিক নেই, রাজত্ব একমাত্র তাঁরই, সমস্ত প্রশংসাও একমাত্র তাঁরই জন্য, আর তিনি সকল বিষয়ের উপর ক্ষমতাবান। তাহলে দশটি গোলাম আযাদ করার সমান সওয়াব তার হবে। তার জন্য একশটি সওয়াব লেখা হবে এবং আর একশটি গুনাহ মিটিয়ে ফেলা হবে। ঐদিন সন্ধ্যা পর্যন্ত সে শয়তান হতে মাহফুজ থাকবে। কোন লোক তার চেয়ে উত্তম সওয়াবের কাজ করতে পারবে না। তবে হ্যাঁ, ঐ ব্যক্তি সক্ষম হবে, যে এর চেয়ে ঐ দু’আটির ‘আমল বেশি পরিমাণ করবে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 130090,
        "last_updated": null
    },
    {
        "banglaURN": 6032940,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3294,
        "hadithSanad": "",
        "hadithText": "সা’দ ইব্‌নু আবূ ওয়াক্কাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেছেন, একদা ‘উমর (রাঃ) আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট আসার অনুমতি চাইলেন। তখন তাঁর সঙ্গে কয়েকজন কুরাইশ নারী কথাবার্তা বলছিল। তারা খুব উচ্চঃস্বরে কথা বলছিল। অতঃপর যখন ‘উমর (রাঃ) অনুমতি চাইলেন, তারা উঠে শীঘ্র পর্দার আড়ালে চলে গেলেন। অতঃপর আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁকে অনুমতি প্রদান করলেন। তখন তিনি মুচকি হাসছিলেন। তখন ‘উমর (রাঃ) বললেন, ‘হে আল্লাহর রসূল! আল্লাহ আপনাকে সর্বদা সহাস্য রাখুন।’ তিনি বললেন, আমার নিকট যে সব মহিলা ছিল  তাদের ব্যাপারে আমি আশ্চর্যান্বিত হয়েছি। তারা যখনি তোমার আওয়াজ শুনল তখনই দ্রুত পর্দার আড়ালে চলে গেল। ‘উমর (রাঃ) বললেন, ‘হে আল্লাহ্‌র রসূল! আপনাকেই তাদের বেশি ভয় করা উচিত ছিল।’ অতঃপর তিনি মহিলাদের উদ্দেশ্য করে বললেন, হে আত্মশত্রু মহিলাগণ! তোমরা আমাকে ভয় করছ অথচ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে ভয় করছ না? তারা জবাব দিল, হ্যাঁ, কারণ তুমি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)–এর চেয়ে অধিক কর্কশ ভাষী ও কঠোর হৃদয়ের লোক। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, ‘শপথ ঐ সত্তার যাঁর হাতে আমার প্রাণ, তুমি যে পথে চল শয়তান কখনও সে পথে চলে না বরং সে তোমার পথ ছেড়ে অন্য পথে চলে।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 130100,
        "last_updated": null
    },
    {
        "banglaURN": 6032950,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1855,
        "babName": null,
        "hadithNumber": 3295,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেন, ‘তোমাদের কেউ যখন ঘুম হতে উঠল এবং উযূ করল তখন তার উচিত নাক তিনবার ঝেড়ে ফেলা। কারণ, শয়তান তার নাকের ছিদ্রে রাত কাটিয়েছে।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 130110,
        "last_updated": null
    },
    {
        "banglaURN": 6032960,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1856,
        "babName": null,
        "hadithNumber": 3296,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ খুদরী (রাঃ) থেকে বর্ণিতঃ তিনি ‘আবদুল্লাহ ইব্‌নু ‘আবদুর রহমান (রহঃ)- কে বলেছেন, ‘আমি তোমাকে দেখছি তুমি বকরির পাল ও মরুভূমি পছন্দ করছ। অতএব, তুমি যখন তোমার বকরির পাল নিয়ে মরুভূমিতে অবস্থান করবে, সালাতের সময় হলে আযান দিবে, আযানে তোমার স্বর উচ্চ করবে। কেননা মুআয্‌যিনের কণ্ঠস্বর জ্বিন, মানুষ ও যে কোন বস্তু শুনে, তারা ক্বিয়ামতের দিন তার পক্ষে সাক্ষ্য দিবে।’ আবূ সা’ঈদ (রাঃ) বলেন, আমি এ হাদীসটি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট হতে শুনেছি।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 130120,
        "last_updated": null
    },
    {
        "banglaURN": 6032990,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1858,
        "babName": null,
        "hadithNumber": 3299,
        "hadithSanad": "",
        "hadithText": "‘আবদুর রায্‌যাক (রহঃ) মা’মার (রহঃ) সূত্রে থেকে বর্ণিতঃ আমাকে দেখেছেন আবূ লুবাবা অথবা যায়দ ইব্‌নু খাত্তাব (রাঃ) আর অনুসরণ করেছেন মা’মার (রহঃ)- কে ইউনুস ইব্‌নু ইয়াইনা, ইসহাক কলবী ও যুবাইদী (রহঃ) এবং সালিহ, ইব্‌নু আবূ হাফসাহ ও ইব্‌নু মুজাম্মি’ (রহঃ).... ইবনু ’উমার (রাঃ) হতে বর্ণিত হাদীসে রয়েছে, ‘আমাকে দেখেছেন আবু লুবাবা ও যায়দ ইব্‌নু খাত্তাব (রাঃ)।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 130150,
        "last_updated": null
    },
    {
        "banglaURN": 6033000,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1859,
        "babName": null,
        "hadithNumber": 3300,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ খুদরী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)  বলেছেন,  সে সময় অতি নিকটে যখন একজন মুসলিমের সবচেয়ে উত্তম সম্পদ হবে ছাগ-পাল। তা নিয়ে সে পাহাড়ের চূড়ায় এবং বৃষ্টির এলাকায় চলে যাবে; সে ফিতনা হতে নিজের দ্বীনকে রক্ষার জন্য পলায়ন করবে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 130160,
        "last_updated": null
    },
    {
        "banglaURN": 6033010,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1859,
        "babName": null,
        "hadithNumber": 3301,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন,  ‘কুফরীর মূল পূর্বদিকে,  গর্ব এবং অহংকার ঘোড়া এবং উটের মালিকদের মধ্যে এবং বেদুইনদের মধ্যে যারা তাদের উটের পাল নিয়ে ব্যস্ত থাকে,  আর শান্তি বকরির পালের মালিকদের মধ্যে।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 130170,
        "last_updated": null
    },
    {
        "banglaURN": 6033020,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1859,
        "babName": null,
        "hadithNumber": 3302,
        "hadithSanad": "",
        "hadithText": "‘উক্‌বাহ ইব্‌নু আম্‌র আবূ মাস’উদ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) নিজ হাতের দ্বারা ইয়ামানের দিকে ইশারা করে বললেন, ঈমান এদিকে। দেখ কঠোরতা এবং অন্তরের কাঠিন্য ঐ সব বেদুইনদের মধ্যে যারা তাদের উট নিয়ে ব্যস্ত থাকে যেখান থেকে শয়তানের শিং দু’টি উদয় হয় অর্থ্যাৎ রাবীয়াহ ও মুযার গোত্রদ্বয়ের মধ্যে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 130180,
        "last_updated": null
    },
    {
        "banglaURN": 6033030,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1859,
        "babName": null,
        "hadithNumber": 3303,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, ‘যখন তোমরা মোরগের ডাক শুনবে তখন তোমরা আল্লাহর নিকট তাঁর অনুগ্রহ প্রার্থনা করে দু’আ কর।  কেননা এ মোরগ ফেরেশতাদের দেখে আর যখন গাধার আওয়াজ শুনবে তখন শয়তান হতে আল্লাহর নিকট আশ্রয় চাইবে,  কেননা এ গাধাটি শয়তান দেখেছে।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 130190,
        "last_updated": null
    },
    {
        "banglaURN": 6033040,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1859,
        "babName": null,
        "hadithNumber": 3304,
        "hadithSanad": "",
        "hadithText": "জাবির ইব্‌নু ‘আবদুল্লাহ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন,  আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, ‘যখন রাতের আঁধার নেমে আসবে অথবা বলেছেন,  যখন সন্ধ্যা হয়ে যাবে তখন তোমরা তোমাদের শিশুদেরকে আটকিয়ে রাখবে। কেননা এসময় শয়তানেরা ছড়িয়ে পড়ে। আর যখন রাতের কিছু অংশ অতিক্রান্ত হবে তখন তাদেরকে ছেড়ে দিতে পার। তোমরা ঘরের দরজা বন্ধ করবে এবং আল্লাহ্‌র নাম স্মরণ করবে। কেননা শয়তান বন্ধ দরজা খুলতে পারেনা। ইব্‌নু জুরাইজ (রহঃ) বলেন, হাদীসটি ‘আম্‌র ইব্‌নু দীনার (রহঃ) ....... জাবির ইব্‌নু ‘আবদুল্লাহ্‌ হতে ‘আত্বা (রহঃ)-এর মতই বর্ণনা করেছেন। তবে তিনি ------------ বলেননি।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 130200,
        "last_updated": null
    },
    {
        "banglaURN": 6033050,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1859,
        "babName": null,
        "hadithNumber": 3305,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন,  বনী ইসরাঈলের একদল লোক নিখোঁজ হয়েছিল। কেউ জানেনা তাদের কী হলো আর আমি তাদেরকে ইঁদুর বলেই মনে করি। কেননা তাদের সামনে যখন উটের দুধ রাখা হয়, তারা তা পান করে না,  আর যখন তাদের সামনে ছাগী দুগ্ধ রাখা হয় তখন তারা তা পান করে। [আবূ হুরায়রা (রাঃ) বলেন] আমি এ হাদীসটি কা‘বের নিকট বললাম,  তিনি আমাকে জিজ্ঞেস করলেন আপনি কি এটা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)- কে বলতে শুনেছেন? আমি বললাম, হ্যাঁ। অতঃপর তিনি কয়েকবার আমাকে এ কথাটি জিজ্ঞেস করলেন। তখন আমি বললাম, আমি কি তাওরাত কিতাব পড়েছি?</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 113,
        "matchingArabicURN": 130210,
        "last_updated": null
    },
    {
        "banglaURN": 6033060,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1859,
        "babName": null,
        "hadithNumber": 3306,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) গিরগিটি বা রক্তচোষা টিকটিকি কে নিকৃষ্টতম ফাসিক বলে আখ্যায়িত করেছেন। আমি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)–কে একে হত্যা করার আদেশ দিতে শুনিনি। আর সা‘দ ইব্‌নু আবূ ওয়াক্কাস (রাঃ) বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) একে হত্যা করার আদেশ দিয়েছেন।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 114,
        "matchingArabicURN": 130220,
        "last_updated": null
    },
    {
        "banglaURN": 6033070,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1859,
        "babName": null,
        "hadithNumber": 3307,
        "hadithSanad": "",
        "hadithText": "সা‘ঈদ ইব্‌নু মুসাইয়্যাব (রহঃ) থেকে বর্ণিতঃ উম্মু শারীক (রহঃ) তাঁকে খবর দিয়েছেন যে, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাকে গিরগিটি বা রক্ত চোষা জাতীয় টিকটিকি হত্যা করার নির্দেশ দিয়েছেন।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 115,
        "matchingArabicURN": 130230,
        "last_updated": null
    },
    {
        "banglaURN": 6033080,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1859,
        "babName": null,
        "hadithNumber": 3308,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, ‘পিঠে দু’টি সাদা রেখা ওয়ালা সাপকে হত্যা কর। কেননা এ জাতীয় সাপ দৃষ্টিশক্তি বিনষ্ট করে আর গর্ভপাত ঘটায়।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 116,
        "matchingArabicURN": 130240,
        "last_updated": null
    },
    {
        "banglaURN": 6033090,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1859,
        "babName": null,
        "hadithNumber": 3309,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) লেজকাটা সাপকে হত্যা করার নির্দেশ দিয়েছেন, আর বলেছেন, এ ধরনের সাপ দৃষ্টিশক্তি বিনষ্ট করে এবং গর্ভপাত ঘটায়।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 117,
        "matchingArabicURN": 130250,
        "last_updated": null
    },
    {
        "banglaURN": 6033140,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1860,
        "babName": null,
        "hadithNumber": 3314,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, পাঁচ প্রকার প্রাণী অধিক ক্ষতিকারক। এদেরকে হারামেও (সীমানারমধ্যে) হত্যা করা যায়। এগুলো হল বিচ্ছু, ইঁদুর, চিল, কাক ও পাগলা কুকুর।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 120,
        "matchingArabicURN": 130290,
        "last_updated": null
    },
    {
        "banglaURN": 6033150,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1860,
        "babName": null,
        "hadithNumber": 3315,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, পাঁচ প্রকারের ক্ষতিকারক প্রাণী যাদেরকে কেউ ইহরাম অবস্থায়ও যদি মেরে ফেলে, তাহলে তার কোন গুনাহ নেই। এগুলো হল বিচ্ছু, ইঁদুর, পাগলা কুকুর, কাক এবং চিল।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 121,
        "matchingArabicURN": 130300,
        "last_updated": null
    },
    {
        "banglaURN": 6033160,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1860,
        "babName": null,
        "hadithNumber": 3316,
        "hadithSanad": "",
        "hadithText": "জাবির (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, ‘তোমরা পাত্রগুলো ঢেকে রেখো, পান করার পাত্রগুলো বন্ধ করে রেখো, ঘরের দরজাগুলো বন্ধ করে রেখো আর সাঁঝের বেলায় তোমাদের বাচ্চাদেরকে ঘরে আটকে রেখো। কারণ এসময় জ্বিনেরা ছড়িয়ে পড়ে এবং কোনকিছুকে দ্রুত পাকড়াও করে। আর নিদ্রাকালে বাতিগুলো নিভিয়ে দেবে। কেননা অনেক সময় ছোট ছোট ক্ষতিকারক ইঁদুর প্রজ্জ্বলিত সলতেযুক্ত বাতি টেনে নিয়ে যায় এবং গৃহবাসীকে জ্বালিয়ে পুড়িয়ে দেয়। ইব্‌নু জুরাইজ এবং হাবীব (রহঃ) আত্বা (রহঃ) হতে “কেননা এসময় জ্বিনেরা ছড়িয়ে পড়ে” এর স্থলে “শয়তানেরা ছড়িয়ে পড়ে” বর্ণনা করেছেন।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 122,
        "matchingArabicURN": 130310,
        "last_updated": null
    },
    {
        "banglaURN": 6033170,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1860,
        "babName": null,
        "hadithNumber": 3317,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ ইব্‌নু মাস’ঊদ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)–এর সঙ্গে এক গুহায় ছিলাম। তখন ওয়াল “মুরসালাতি গারকা” সূরাটি অবতীর্ণ হয়। আমরা আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)– এর মুখ হতে সূরাটি শিখে নিচ্ছিলাম। এমন সময় একটা সাপ বেরিয়ে এল তার গর্ত হতে। আমরা তাকে মারার জন্য দৌঁড়ে যাই। কিন্তু সে আমাদের আগেই গিয়ে গর্তে ঢুকে পড়ে। তখন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, সে তোমাদের অনিষ্ট হতে যেমন রক্ষা পেয়েছে, তোমরাও তেমন তার অনিষ্ট হতে বেঁচে গেছ।\nইসরাঈল (রহ) আ’মাশ, ইব্‌রাহীম,‘আলকামাহ (রহঃ)-ও ‘আবদুল্লাহ (রাঃ) হতে এ রকমই বর্ণনা করেছেন। রাবী ‘আবদুল্লাহ (রাঃ) বলেছেন, আমরা সূরাটি তাঁর মুখ হতে বের হবার সঙ্গে সঙ্গে শিখে নিচ্ছিলাম। আবূ আওয়ানাহ মুগীরাহ (রাঃ) হতে এভাবেই বর্ণনা করেছেন। আর হাফস, আবূ মু’আবিয়া ও সুলাইমান ইব্‌নু কারম, আ’মাশ, ইব্‌রাহীম, আসওয়াদ (রহঃ)-ও ‘আবদুল্লাহ (রাঃ) হতে অনুরূপই বর্ণনা করেছেন।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 123,
        "matchingArabicURN": 130320,
        "last_updated": null
    },
    {
        "banglaURN": 6033180,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1860,
        "babName": null,
        "hadithNumber": 3318,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘উমর (রাঃ) সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেন, এক নারী একটি বিড়ালের কারণে জাহান্নামে গিয়েছিল, সে তাকে বেঁধে রেখেছিল। সে তাকে খাবারও দেয়নি, ছেড়েও দেয়নি, যাতে সে যমীনের পোকা মাকড় খেতে পারত। আবু হুরায়রা (রাঃ) সূত্রেও নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে অনুরূপ হাদীস বর্ণিত আছে।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 124,
        "matchingArabicURN": 130330,
        "last_updated": null
    },
    {
        "banglaURN": 6033190,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1860,
        "babName": null,
        "hadithNumber": 3319,
        "hadithSanad": "",
        "hadithText": "আবু হুরায়রা (রাঃ) থেকে বর্ণিতঃ আল্লাহর রসূল( সাঃ) বলেছেন, নবীগণের মধ্যে কোন এক নবী একটি গাছের নীচে অবতরণ করেন। অতঃপর তাঁকে একটি পিঁপড়ায় কামড় দেয়। তিনি তাঁর আসবাবপত্রের ব্যাপারে আদেশ দেন। এগুলো গাছের নিচ থেকে সরিয়ে ফেলা হয়। অতঃপর তিনি নির্দেশ দিলে পিঁপড়ার বাসা আগুন দিতে জ্বালিয়ে দেয়া হল। তখন আল্লাহ তাঁর প্রতি ওয়াহী নাযিল করলেন, ‘তুমি একটি মাত্র পিঁপড়াকে শাস্তি দিলে না কেন?’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 125,
        "matchingArabicURN": 130340,
        "last_updated": null
    },
    {
        "banglaURN": 6033200,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1861,
        "babName": null,
        "hadithNumber": 3320,
        "hadithSanad": "",
        "hadithText": "‘উবাইদ ইব্‌নু হুনায়ন (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আবূ হুরায়রা (রাঃ)-কে বলতে শুনেছি, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, ‘তোমাদের কারো পানীয় দ্রব্যে মাছি পড়লে সেটাকে তাতে ডুবিয়ে দেবে। অতঃপর তাকে উঠিয়ে ফেলবে। কেননা তার এক ডানায় রোগ থাকে আর অপর ডানায় থাকে রোগের প্রতিষেধক।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 126,
        "matchingArabicURN": 130350,
        "last_updated": null
    },
    {
        "banglaURN": 6033210,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1861,
        "babName": null,
        "hadithNumber": 3321,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) সূত্রে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেন, ‘এক ব্যভিচারিণীকে ক্ষমা করে দেয়া হয়। সে একটি কুকুরের কাছ দিয়ে যাচ্ছিল। তখন সে দেখতে পেল কুকুরটি একটি কূপের পাশে বসে হাঁপাচ্ছে। রাবী বলেন, পানির পিপাসা তাকে মুমূর্ষ করে দিয়েছিল। তখন সেই নারী তার মোজা খুলে উড়নার সাথে বাঁধল। অতঃপর সে কূপ হতে পানি তুলল (এবং কুকুরটিকে পানি পান করালো) এ কারণে তাকে ক্ষমা করে দেয়া হল।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 127,
        "matchingArabicURN": 130360,
        "last_updated": null
    },
    {
        "banglaURN": 6033220,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1861,
        "babName": null,
        "hadithNumber": 3322,
        "hadithSanad": "",
        "hadithText": "আবূ ত্বলহা (রাঃ) সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেন, ‘যে বাড়িতে কুকুর এবং প্রাণীর ছবি থাকে তাতে ফেরেশতামন্ডলী প্রবেশ করেন না।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 128,
        "matchingArabicURN": 130370,
        "last_updated": null
    },
    {
        "banglaURN": 6033230,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1861,
        "babName": null,
        "hadithNumber": 3323,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ ‘রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) কুকুর মেরে ফেলতে আদেশ করেছেন।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 129,
        "matchingArabicURN": 130380,
        "last_updated": null
    },
    {
        "banglaURN": 6033240,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1861,
        "babName": null,
        "hadithNumber": 3324,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল  (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, ‘যে ব্যক্তি কুকুর প্রতিপালন করবে, প্রত্যেক দিন তার ‘আমলনামা হতে এক ক্বীরাত করে সওয়াব কমতে থাকবে। তবে ক্ষেত খামার কিংবা পশু পাল পাহারা দেয়ার কাজে নিযুক্ত শিকারী কুকুর ছাড়া।’</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 130,
        "matchingArabicURN": 130390,
        "last_updated": null
    },
    {
        "banglaURN": 6033250,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": null,
        "babNumber": 1861,
        "babName": null,
        "hadithNumber": 3325,
        "hadithSanad": "",
        "hadithText": "সায়িব ইবনু ইয়াযীদ সুফিয়ান ইবনু আবূ যুহাইর শানাভির (রাঃ) থেকে বর্ণিতঃ তিনি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছেন, যে ব্যক্তি কুকুর লালন পালন করে, যদ্‌দ্বারা না কৃষির উপকার হয়, না পশুপালনের, তার ‘আমল হতে প্রত্যহ এক কিরাত ‘আমল কমে যায়। সায়িব জিজ্ঞেস করেন, আপনি কি তা আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে শুনেছেন? তিনি বললেন, এই কিবলার (কা’বার) প্রতিপালকের শপথ!, অবশ্যই।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 131,
        "matchingArabicURN": 130400,
        "last_updated": null
    },
    {
        "banglaURN": 6032521,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": "",
        "babNumber": 1852,
        "babName": "",
        "hadithNumber": 3252,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, জান্নাতে এমন একটি বৃক্ষ আছে যার ছায়ায় কোন আরোহী শত বছর পর্যন্ত চলতে পারবে। আর তোমরা ইচ্ছা করলে তিলওয়াত করতে পার -------------- এবং দীর্ঘ ছায়া।\n\nআবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ আর জান্নাতে তোমাদের কারও একটি ধনুকের পরিমাণ জায়গাও ঐ জায়গা অপেক্ষা অধিক উত্তম সেখানে সূর্য উদিত হয় আর সূর্য অস্তমিত হয় (অর্থাৎ পৃথিবীর চেয়ে)।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 129690,
        "last_updated": null
    },
    {
        "banglaURN": 6032721,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": "",
        "babNumber": 1855,
        "babName": "",
        "hadithNumber": 3272,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, যখন সূর্যের এক কিনারা উদিত হবে, তখন তা পরিষ্কারভাবে উদিত না হওয়া পর্যন্ত তোমরা সালাত আদায় বন্ধ রাখ। আবার যখন সূর্যের এক কিনারা অস্ত যাবে তখন তা সম্পূর্ণ অস্ত না যাওয়া পর্যন্ত তোমরা সালাত আদায় বন্ধ রাখ।\n\nবর্ণনাকারী থেকে বর্ণিতঃ আর তোমরা সূর্যোদয়ের সময়কে এবং সূর্যাস্তের সময়কে তোমাদের সালাতের জন্য নির্ধারিত করো না। কেননা তা শয়তানের দু’ শিং-এর মাঝখান দিয়ে উদিত হয়। বর্ণনাকারী বলেন, হিশাম (রহ.) ‘শয়তান’ বলেছেন না ‘আশ-শয়তান’ বলেছেন তা আমি জানি না। (মুসলিম ৬/৫১ হাঃ ৮২৯, আহমাদ ৪৬১২) (আধুনিক প্রকাশনীঃ শেষাংশ, ইসলামী ফাউন্ডেশনঃ ৩০৪১ শেষাংশ)</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 129881,
        "last_updated": null
    },
    {
        "banglaURN": 6032971,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": "",
        "babNumber": 1858,
        "babName": "",
        "hadithNumber": 3297,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)- কে মিম্বারের উপর ভাষণ দানের সময় বলতে শুনেছেন, ‘সাপ মেরে ফেল। বিশেষ করে মেরে ফেল ঐ সাপ,  যার মাথার উপর দু’টো সাদা রেখা আছে এবং লেজ কাটা সাপ। কারণ এ দু’প্রকারের সাপ চোখের জ্যোতি নষ্ট করে দেয় ও গর্ভপাত ঘটায়।’\n\n‘আবদুল্লাহ (রাঃ) থেকে বর্ণিতঃ ‘আবদুল্লাহ (রাঃ) বললেন, একদা আমি একটি সাপ মারার জন্য তার পিছু ধাওয়া করছিলাম। এমন সময় আবূ লুবাবা (রাঃ) আমাকে ডেকে বললেন, সাপটি মেরোনা। তখন আমি বললাম, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)  সাপ মারার জন্য আদেশ দিয়েছেন। তিনি বললেন, এরপরে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যে সাপ ঘরে বাস করে যাকে ‘আওয়ামির’ বলা হয় এমন সাপ মারতে নিষেধ করেছেন।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 130131,
        "last_updated": null
    },
    {
        "banglaURN": 6033101,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": "",
        "babNumber": 1859,
        "babName": "",
        "hadithNumber": 3310,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু আবূ মুলায়কাহ্ (রহঃ) থেকে বর্ণিতঃ ইব্‌নু ‘উমর (রাঃ) প্রথমে সাপ মেরে ফেলতেন। পরে মারতে নিষেধ করেছেন। তিনি বলেছেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) একবার তাঁর একটি দেয়াল ভেঙ্গে ফেলেন। তাতে তিনি সাপের খোলস দেখতে পান। তখন তিনি বললেন, দেখ! কোথায় সাপ আছে? লোকেরা দেখল তিনি বললেন, একে মেরে ফেল। এ কারণে আমি সাপ মেরে ফেললাম।\n\nইব্‌নু আবূ মুলায়কাহ্ (রহঃ) থেকে বর্ণিতঃ অতঃপর আবূ লুবাবার সঙ্গে আমার দেখা হল। তিনি আমাকে জানালেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন,  পিঠের উপর দু‘টি রেখাওয়ালা এবং লেজকাটা সাপ ছাড়া অন্য কোন সাপকে তোমরা মেরোনা। কেননা ওগুলো গর্ভপাত ঘটায় এবং চোখের জ্যোতি নষ্ট করে দেয়। তাই এ জাতীয় সাপ মেরে ফেল।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 118,
        "matchingArabicURN": 130261,
        "last_updated": null
    },
    {
        "banglaURN": 6033121,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 59,
        "bookName": "",
        "babNumber": 1859,
        "babName": "",
        "hadithNumber": 3312,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি সাপ হত্যা করতেন।\n\nইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ অতঃপর আবূ লুবাবাহ (রাঃ) তাঁকে একটি হাদীস শুনালেন যে, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ঘরে বসবাসকারী সাপ হত্যা করতে নিষেধ করেছেন। ফলে তিনি সাপ মারা বন্ধ করে দেন।</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 119,
        "matchingArabicURN": 130280,
        "last_updated": null
    }
]