[
    {
        "banglaURN": 6034890,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2442,
        "babName": null,
        "hadithNumber": 3489,
        "hadithSanad": "",
        "hadithText": "ইব্ন ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আয়াতে বর্ণিত (আরবী) অর্থ বড় গোত্র এবং (আরবী) অর্থ ছোট গোত্র।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 131190,
        "last_updated": null
    },
    {
        "banglaURN": 6034900,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2442,
        "babName": null,
        "hadithNumber": 3490,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে জিজ্ঞেস করা হল, হে আল্লাহ্‌র রাসূল! মানুষের মধ্যে সবচেয়ে মর্যাদাবান কে? নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, যে সবচেয়ে আল্লাহ্‌ভীরু, সে-ই অধিক সম্মানিত। সাহাবীগণ বললেন, হে আল্লাহ্‌র রাসূল! আমরা এ ধরনের কথা জিজ্ঞেস করিনি। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, তাহলে আল্লাহ্‌র নবী ইউসূফ ('আ)।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 131200,
        "last_updated": null
    },
    {
        "banglaURN": 6034910,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2442,
        "babName": null,
        "hadithNumber": 3491,
        "hadithSanad": "",
        "hadithText": "কুলায়েব ইব্ন ওয়ায়িল (রহঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর তত্ত্বাবধানে পালিতা আবূ সালমার কন্যা যায়নাবকে আমি জিজ্ঞেস করলাম, আপনি বলুন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) কি মুযার গোত্রের ছিলেন? তিনি বললেন, বনু নযর ইব্‌ন কিনানা উদ্ভূত গোত্র মুযার ব্যতীত আর কোন গোত্র হতে হবেন? এবং মুযার গোত্র নাযর ইব্‌ন কিনানা গোত্রের একটি শাখা ছিল।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 131210,
        "last_updated": null
    },
    {
        "banglaURN": 6034920,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2442,
        "babName": null,
        "hadithNumber": 3492,
        "hadithSanad": "",
        "hadithText": "কুলায়ব থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর তত্ত্বাবধানে পালিতা কন্যা বলেনঃ আর আমার ধারণা তিনি হলেন যায়নাব। তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) কদুর বাওশ, সবুজ মাটির পাত্র মুকাইয়ার ও মুযাফ্ফাত (আলকাতরা লাগানো পাত্র বিশেষ) ব্যবহার করতে নিষেধ করেছেন। কুলায়ব বলেন, আমরা তাকে জিজ্ঞেস করলাম, বলেন তো দেখি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) কোন গোত্রের ছিলেন? তিনি কি মুযার গোত্রের অন্তর্গত ছিলেন? তিনি জবাব দিলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) মুযার গোত্র ব্যতীত আর কোন গোত্রের হবেন? আর মুযার নাযর ইব্‌ন কিনানার বংশধর ছিল।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 131220,
        "last_updated": null
    },
    {
        "banglaURN": 6034970,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2442,
        "babName": null,
        "hadithNumber": 3497,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ (আরবী) এ আয়াতের প্রসঙ্গে রাবী তাউস (রহঃ) বলেন যে, সায়িদ ইব্‌ন জুবায়র (রাঃ) বলেন, কুরবা শব্দ দ্বারা মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর নিকট আত্মীয়কে বুঝান হয়েছে। তখন ইব্‌ন ‘আব্বাস (রাঃ) বলেন, কুরাইশের এমন কোন শাখা - গোত্র নেই যাঁদের সঙ্গে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর আত্মীয়তার বন্ধন ছিল না। আয়াতটি তখনই নাযিল হয়। অর্থাৎ তোমরা আমার ও তোমাদের মধ্যকার আত্মীয়তার প্রতি খেয়াল রাখ।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 131260,
        "last_updated": null
    },
    {
        "banglaURN": 6034980,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2442,
        "babName": null,
        "hadithNumber": 3498,
        "hadithSanad": "",
        "hadithText": "আবূ মাসউদ (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, এই পূর্বদিক হতে ফিতনা-ফাসাদের উৎপত্তি হবে। নির্মমতা ও অন্তরের কাঠিন্য উট ও গরু নিয়ে ব্যস্ত লোকদের মধ্যে। পশমী তাঁবুর অধিবাসীরা রাবী‘আ ও মুযার গোত্রের যারা উট ও গরুর পিছনে চিৎকার করে (হাঁকায়), তাদের মধ্যেই রয়েছে নির্মমতা ও কঠোরতা।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 131270,
        "last_updated": null
    },
    {
        "banglaURN": 6034990,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2442,
        "babName": null,
        "hadithNumber": 3499,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে আমি বলতে শুনেছি যে, গর্ব-অহংকার পশমের তৈরি তাঁবুতে বসবাসকারী যারা (উট-গরু হাঁকানোর সময় চিৎকার করে) তাদের মধ্যে (আরবী) অর্থ বাম দিক, বাম হাতকে (আরবী) এবং বাম দিককে (আরবী) বলা হয়। আর শান্তভাব রয়েছে বকরী পালকদের মধ্যে। ঈমানের দৃশ্যতা ও হিক্মাত ইয়ামানবাসীদের মধ্যে রয়েছে। ইমাম বুখারী (রহঃ) বলেন, ইয়ামান নাম দেয়া হয়েছে যেহেতু তা কা’বা ঘরের ডানদিকে (দক্ষিণ) অবস্থিত এবং শাম (সিরিয়া) কা‘বা ঘরের বাম (উত্তর) দিকে অবস্থিত বিধায় তার শাম নাম দেয়া হয়েছে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 131280,
        "last_updated": null
    },
    {
        "banglaURN": 6035000,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2443,
        "babName": null,
        "hadithNumber": 3500,
        "hadithSanad": "",
        "hadithText": "মুহাম্মাদ ইব্ন জুবায়ের ইব্ন মুত্‘ঈম (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, মু‘আবিয়া (রাঃ) -এর নিকট কুরাইশ প্রতিনিধিদের সাথে তার উপস্থিতিতে সংবাদ পৌঁছলো যে, ‘আবদুল্লাহ্ ইব্‌ন ‘আমর ইবনুল ‘আস (রাঃ) বর্ণনা করেন, শীঘ্রই কাহতান বংশীয় জনৈক বাদশাহর আগমন ঘটবে। এতদশ্রবণে মু‘আবিয়া (রাঃ) ক্রুদ্ধ হয়ে খুতবাহ দেয়ার উদ্দেশে দাঁড়িয়ে আল্লাহর যথাযোগ্য হামদ ও সানার পর তিনি বললেন, আমি জানতে পেরেছি, তোমাদের মধ্য থেকে কিছু লোক এমন সব কথাবার্তা বলতে শুরু করেছে যা আল্লাহর কিতাবে নেই এবং আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতেও বর্ণিত হয়নি। এরাই মূর্খ, এদের হতে সাবধান থাক এবং এমন কাল্পনিক ধারণা হতে সতর্ক থাক যা ধারণাকারীকে বিপথগামী করে। আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে আমি বলতে শুনেছি যে, যত দিন তারা দ্বীন কায়েমে লেগে থাকবে ততদিন খিলাফত ও শাসন ক্ষমতা কুরাইশদের হাতেই থাকবে। এ বিষয়ে যে - ই তাদের সাথে শত্রুতা করবে আল্লাহ্ তাকে অধোঃমুখে নিক্ষেপ করবেন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 131290,
        "last_updated": null
    },
    {
        "banglaURN": 6035010,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2443,
        "babName": null,
        "hadithNumber": 3501,
        "hadithSanad": "",
        "hadithText": "ইব্ন ‘উমর (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, এ বিষয় (খিলাফত ও শাসন ক্ষমতা) সর্বদাই কুরাইশদের হাতে থাকবে, যতদিন তাদের দু’জন লোকও বেঁচে থাকবে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 131300,
        "last_updated": null
    },
    {
        "banglaURN": 6035020,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2443,
        "babName": null,
        "hadithNumber": 3502,
        "hadithSanad": "",
        "hadithText": "জুবায়র ইব্ন মুত‘ঈম (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি এবং ‘উসমান ইব্‌ন আফ্ফান (রাঃ) আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর দরবারে হাযির হলাম। ‘উসমান (রাঃ) বললেন, হে আল্লাহ্‌র রাসূল! আপনি মুত্তালিবের সন্তানদেরকে দান করলেন এবং আমাদেরকে বাদ দিলেন। অথচ তারা ও আমরা আপনার বংশগতভাবে সম স্তরের। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, বনূ হাশিম ও বনূ মুত্তালিব এক ও অভিন্ন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 131310,
        "last_updated": null
    },
    {
        "banglaURN": 6035030,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2443,
        "babName": null,
        "hadithNumber": 3503,
        "hadithSanad": "",
        "hadithText": "‘উরওয়া ইব্‌নু যুবায়র (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, ‘আবদুল্লাহ্ ইব্‌ন জুবায়র (রাঃ) বনূ যুহরার কতিপয় লোকের সঙ্গে ‘আয়িশা (রাঃ)-এর নিকটে হাযির হলেন। ‘আয়িশা (রাঃ) তাদের প্রতি অত্যন্ত নম্র ও দয়ার্দ্র ছিলেন। কেননা, আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সঙ্গে তাঁদের আত্মীয়তা ছিল।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 131320,
        "last_updated": null
    },
    {
        "banglaURN": 6035040,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2443,
        "babName": null,
        "hadithNumber": 3504,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেছেন, আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, কুরাইশ, আনসার, জুহায়না, মুযায়না, আসলাম, আশজা‘ ও গিফার গোত্রগুলো আমার সাহায্যকারী। আল্লাহ্ ও তাঁর রাসূল ছাড়া তাঁদের সাহায্যকারী আর কেউ নেই।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 131330,
        "last_updated": null
    },
    {
        "banglaURN": 6035050,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2443,
        "babName": null,
        "hadithNumber": 3505,
        "hadithSanad": "",
        "hadithText": "‘উরওয়া ইব্ন যুবায়র (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, ‘আবদুল্লাহ ইব্‌ন যুবায়র (রহঃ) নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ও আবূ বকর (রাঃ) -এর পর ‘আয়িশা (রাঃ) -এর নিকট সকল লোকদের মধ্যে সবচেয়ে প্রিয়পাত্র ছিলেন এবং তিনি সকল লোকদের মধ্যে ‘আয়িশা (রাঃ) -এর প্রতি সবচেয়ে অধিক সদাচারী ছিলেন। ‘আয়িশা (রাঃ) -এর নিকট আল্লাহ্‌র পক্ষ হতে রিজিক হিসেবে যা কিছু আসত তা জমা না রেখে সদাকাহ করে দিতেন। এতে ‘আবদুল্লাহ ইব্‌ন যুবায়র (রাঃ) বললেন, অধিক দান খয়রাত করা হতে তাকে বারণ করা উচিত। তখন ‘আয়িশা (রাঃ) বললেন, আমাকে দান করা হতে বারণ করা হবে? আমি যদি তার সঙ্গে কথা বলি, তাহলে আমাকে কাফ্ফারা দিতে হবে এবং ‘আবদুল্লাহ ইব্‌ন যুবায়র (রাঃ) তাঁর নিকট কুরাইশের কিছু লোক, বিশেষভাবে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর মাতৃবংশের কিছু লোক দ্বারা সুপারিশ করালেন। তবুও তিনি তাঁর সঙ্গে কথা বলা হতে বিরত থাকলেন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর মাতৃবংশ বনী যুহরার কতক বিশিষ্ট লোক যাদের মধ্যে ‘আবদুর রহমান ইব্‌ন আস্ওয়াদ এবং মিসওয়ার ইব্‌ন মাখরামাহ (রাঃ) ছিলেন তারা বললেন, আমরা যখন ‘আয়িশা (রাঃ) -এর গৃহে প্রবেশের অনুমতি চাইব তখন তুমি পর্দার ভিতরে ঢুকে পড়বে। তিনি তাই করলেন। পরে ইব্‌ন যুবায়র (রাঃ) কাফ্ফারা আদায়ের জন্য তার নিকট দশটি ক্রীতদাস পাঠিয়ে দিলেন। ‘আয়িশা (রাঃ) তাদের সবাইকে আযাদ করে দিলেন। অতঃপর তিনি বরাবর আযাদ করতে থাকলেন। এমন কি তা সংখ্যা চল্লিশে পৌঁছে। ‘আয়িশা (রাঃ) বললেন, আমি যখন কোন কাজ করার কসম করি, তখন এরাদা থাকে যে আমি যেন সে কাজটা করে দায়িত্ব মুক্ত হয়ে যাই এবং তিনি আরো বলেন, আমি যখন কোন কাজ করার কসম করি তা যথাযথ পূরণের ইচ্ছা রাখি।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 131340,
        "last_updated": null
    },
    {
        "banglaURN": 6035060,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2444,
        "babName": null,
        "hadithNumber": 3506,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ ‘উসমান (রাঃ), যায়দ ইব্‌ন সাবিত (রাঃ), ‘আবদুল্লাহ ইব্‌ন যুবায়র (রাঃ), সা‘ঈদ ইবনুল ‘আস (রাঃ) ‘আবদুর রাহমান ইব্‌ন হারিস (রাঃ) -কে ডেকে পাঠালেন। তাঁরা সংরক্ষিত কুরআনকে সমবেতভাবে লিপিবদ্ধ করলেন। ‘উসমান (রাঃ) কুরাইশ বংশীয় তিনজনকে বললেন, যদি যায়দ ইব্‌ন সাবিত (রাঃ) এবং তোমাদের মধ্যে কোন শব্দে মতবিরোধ দেখা দেয় তবে কুরাইশের ভাষায় তা লিপিবদ্ধ কর। যেহেতু কুরআন শরীফ তাদের ভাষায় অবতীর্ণ হয়েছে। অতঃপর তাঁরা তা-ই করলেন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 131350,
        "last_updated": null
    },
    {
        "banglaURN": 6035070,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2445,
        "babName": null,
        "hadithNumber": 3507,
        "hadithSanad": "",
        "hadithText": "সালামা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, একবার আসলাম গোত্রের কিছু লোক বাজারের নিকটে প্রতিযোগিতামূলক তীর নিক্ষেপের চর্চা করছিল। এমন সময় নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বের হলেন এবং তাদেরকে দেখে বললেন, হে ইসমাঈল (আরবী) -এর বংশধর। তোমরা তীর নিক্ষেপ কর। কেননা তোমাদের পিতাও তীর নিক্ষেপে অভিজ্ঞ ছিলেন এবং আমি তোমাদের অমুক দলের পক্ষে রয়েছি। তখন একটি পক্ষ তাদের হাত গুটিয়ে নিল। বর্ণনাকারী বললেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, তোমাদের কী হল? তারা বলল, আপনি অমুক পক্ষে থাকলে আমরা কী করে তীর নিক্ষেপ করতে পারি? নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, তোমরা তীর নিক্ষেপ কর। আমি তোমাদের উভয় দলের সাথে আছি।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 131360,
        "last_updated": null
    },
    {
        "banglaURN": 6035080,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2446,
        "babName": null,
        "hadithNumber": 3508,
        "hadithSanad": "",
        "hadithText": "আবূ যার (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে বলতে শুনেছেন, কোন লোক যদি নিজ পিতা সম্পর্কে অবগত থাকা সত্ত্বেও অন্য কাকে তার পিতা বলে দাবী করে তবে সে আল্লাহ্‌র কুফরী করল এবং যে ব্যক্তি নিজেকে এমন বংশের সঙ্গে বংশ সম্পর্কিত দাবী করল যে বংশের সঙ্গে তার কোন বংশ সম্পর্ক নেই, সে যেন তার ঠিকানা জাহান্নামে বানিয়ে নেয়।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 131370,
        "last_updated": null
    },
    {
        "banglaURN": 6035090,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2446,
        "babName": null,
        "hadithNumber": 3509,
        "hadithSanad": "",
        "hadithText": "ওয়ায়িলাহ ইব্ন আসকা’ (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, কোন লোকের এমন লোককে পিতা বলে দাবি করা তার পিতা নয় এবং প্রকৃতই যা দেখেনি তা দেখার দাবি করা এবং আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যা বলেননি তা তাঁর প্রতি মিথ্যারোপ করা নিঃসন্দেহে বড় মিথ্যা।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 131380,
        "last_updated": null
    },
    {
        "banglaURN": 6035100,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2446,
        "babName": null,
        "hadithNumber": 3510,
        "hadithSanad": "",
        "hadithText": "ইব্ন ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, যখন ‘আবদুল কায়স গোত্রের এক প্রতিনিধি দল আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর দরবারে হাজির হয়ে আরয করল, হে আল্লাহ্‌র রাসূল! এ গোত্রটি রাবী’আহ বংশের। আমাদের এবং আপনার মধ্যে মূযার গোত্রের কাফিররা বাধা সৃষ্টি করে রেখেছে। আমরা সম্মানিত চার মাস ছাড়া অন্য সময় আপনার নিকট হাযির হতে পারি না। খুবই ভালো হতো যদি আপনি আমাদেরকে এমন কিছু আদেশ দিয়ে দিতেন যা আপনার নিকট হতে গ্রহণ করে আমাদের পিছনে অবস্থিত লোকদের পৌঁছে দিতাম। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, আমি তোমাদেরকে চারটি কাজের আদেশ দিচ্ছি এবং চারটি কাজের নিষেধাজ্ঞা প্রদান করছি। (এক) আল্লাহ্‌র প্রতি ঈমান আনা এবং এ সাক্ষ্য দেয়া যে, আল্লাহ্ ছাড়া অন্য কোন প্রকৃত ইলাহ নেই, (দুই) সালাত কায়িম করা, (তিন) যাকাত আদায় করা, (চার) গনীমতের যে মাল তোমরা লাভ কর তার পঞ্চমাংশ আল্লাহ্‌র জন্য বায়তুল মালে দান করা। আর আমি তোমাদেরকে দুব্বা (কদু পাত্র), হান্তম (সবুজ রং এর ঘড়া), নাকীর (খেজুর বৃক্ষের মূল খোদাই করে তৈরি পাত্র), মযাফ্ফাত (আলকাতরা লাগানো মাটির পাত্র, এই চারটি পাত্রের) ব্যবহার করতে নিষেধ করছি।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 131390,
        "last_updated": null
    },
    {
        "banglaURN": 6035110,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2446,
        "babName": null,
        "hadithNumber": 3511,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ ইব্ন ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) কে মিম্বরের উপর উপবিষ্ট অবস্থায় পূর্ব দিকে [১] ইঙ্গিত করে বলতে শুনেছি, সাবধান! ফিতনা ফাসাদের উদ্ভব ঐদিক থেকেই হবে এবং ঐদিক থেকেই শয়তানের শিং উদিত হবে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 131400,
        "last_updated": null
    },
    {
        "banglaURN": 6035120,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2447,
        "babName": null,
        "hadithNumber": 3512,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন কুরাইশ, আনসার, জুহায়নাহ, মুযায়নাহ, আসলাম, গিফার এবং আশজা‘ গোত্রগুলো আমার আপনজন। আল্লাহ্ ও তাঁর রাসূল ছাড়া অন্য কেউ তাদের আপনজন নেই।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 131410,
        "last_updated": null
    },
    {
        "banglaURN": 6035130,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2447,
        "babName": null,
        "hadithNumber": 3513,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ (ইব্ন ‘উমর) (রাঃ) থেকে বর্ণিতঃ আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) মিম্বারে উপবিষ্ট অবস্থায় বলেন, গিফার গোত্র, আল্লাহ্ তাদেরকে মাফ করুন, আসলাম গোত্র, আল্লাহ্ তাদেরকে নিরাপত্তা দান করুন আর ‘উসাইয়া গোত্র, তারা আল্লাহ্ ও তাঁর রাসূল অবাধ্যতা করেছে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 131420,
        "last_updated": null
    },
    {
        "banglaURN": 6035140,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2447,
        "babName": null,
        "hadithNumber": 3514,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, আসলাম গোত্র, আল্লাহ্ তাদেরকে নিরাপত্তা দিন। গিফার গোত্র, আল্লাহ তাদেরকে মাফ করুন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 131430,
        "last_updated": null
    },
    {
        "banglaURN": 6035150,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2447,
        "babName": null,
        "hadithNumber": 3515,
        "hadithSanad": "",
        "hadithText": "আবূ বাক্‌রাহ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, বলত জুহায়নাহ, মুযায়নাহ, আসলাম ও গিফার গোত্র যদি আল্লাহর নিকট বানূ তামীম, বানূ আসাদ, বানূ গাতফান ও বানূ ‘আমের হতে উত্তম বিবেচিত হয় তবে কেমন হবে? তখন এক সহাবী বললেন, তবে তারা বঞ্চিত ও ক্ষতিগ্রস্ত হলো। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, তারা বানূ তামীম, বানূ আসাদ, বানূ ‘আবদুল্লাহ ইব্‌ন গাত্ফান এবং বানূ ‘আমের ইব্‌ন সা‘সা‘আহ হতে উত্তম।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 131440,
        "last_updated": null
    },
    {
        "banglaURN": 6035160,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2447,
        "babName": null,
        "hadithNumber": 3516,
        "hadithSanad": "",
        "hadithText": "আবূ বাকরাহ (রাঃ) থেকে বর্ণিতঃ আকরা‘ ইব্‌ন হাবিস নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর নিকট ‘আরয করলেন, আসলাম গোত্রের সুররাক হাজীজ, গিফার ও মুযায়না গোত্রদ্বয় আপনার নিকট বায়‘আত করেছে এবং (রাবী বলেন) আমার ধারণা জুহায়না গোত্রও। এ ব্যাপারে ইব্‌ন আবূ ইয়াকুব সন্দেহ পোষণ করেছেন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, তুমি কি জান, আসলাম, গিফার ও মুযায়নাহ গোত্রত্রয়, (রাবী বলেন) আমার মনে হয় তিনি জুহায়নাহ গোত্রের কথাও উল্লেখ করেছেন যে বনূ তামীম, বনূ ‘আমির, আসাদ ও গাতফান (গোত্রগুলো) যারা ক্ষতিগ্রস্ত ও বঞ্চিত হয়েছে, তাদের তুলনায় পূর্বোক্ত গোত্রগুলো উত্তম। রাবী বলেন, হাঁ। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, সে সত্তার কসম যাঁর হাতে আমার প্রাণ, পূর্বোক্তগুলো শেষোক্ত গোত্রগুলোর তুলনায় অবশ্যই অতি উত্তম। (৩৫১৫) (আধুনিক প্রকাশনীঃ ৩২৫৩, ইসলামী ফাউন্ডেশনঃ ৩২৬৩)\n\n-------------\n\n৩৫১৬ মীম. আবূ হুরায়রাহ (রাঃ) হতে বর্ণিত, নবী   বলেন, আসলাম, গিফার এবং মুযাইনাহ ও জুহানাহ গোত্রের কিছু অংশ অথবা জুহানাহ্ও কিছু অংশ মুযায়নাহ্ও কিছু অংশ আল্লাহর নিকট অথবা বলেছেন কিয়ামাতের দিন আসাদ, তামীম, হাওয়াযিন ও গাতাফান গোত্র অপেক্ষা উত্তম বলে বিবেচিত হবে। (আ.প্র. ৩২৫৪, ই.ফা. ৩২৬৪)</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 131450,
        "last_updated": null
    },
    {
        "banglaURN": 6035170,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2448,
        "babName": null,
        "hadithNumber": 3517,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, কিয়ামত সংঘটিত হবে না যে পর্যন্ত কাহ্তান গোত্র হতে এমন এক ব্যক্তির আগমন না হবে যে মানুষ জাতিকে তার লাঠির সাহায্যে পরিচালিত করবে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 131460,
        "last_updated": null
    },
    {
        "banglaURN": 6035180,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2450,
        "babName": null,
        "hadithNumber": 3518,
        "hadithSanad": "",
        "hadithText": "জাবির (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর পরিচালনায় যুদ্ধে শামিল ছিলাম। এ যুদ্ধে বহু মুহাজির সাহাবী যোগদান করেছিলেন। মুহাজিরদের মধ্যে একজন কৌতুক পুরুষ ছিলেন। তিনি কৌতুকবশতঃ একজন আনসারীকে আঘাত করলেন। তাতে আনসারী সাহাবী অত্যন্ত রাগান্বিত হলেন এবং উভয় গোত্রের সাহায্যের জন্য নিজ নিজ লোকদের আহবান জানালেন। আনসারী সহাবী বললেন, হে আনসারীগণ! মুহাজির সাহাবী বললেন, হে মুহাজিরগণ সাহায্যে এগিয়ে আস। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এতদশ্রবণে বের হয়ে আসলেন এবং বললেন, জাহেলী যুগের ডাকাডাকি কেন? অতঃপর বললেন, তাদের ব্যাপার কী? তাঁকে ঘটনা জানানো হল। মুহাজির সাহাবী আনসারী সাহাবীর কোমরে আঘাত করেছে। রাবী বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, এ ধরনের হাঁকডাক ত্যাগ কর, এ অত্যন্ত ঘৃণিত কাজ। ‘আবদুল্লাহ ইব্‌ন উবাই ইব্‌ন সালূল বলল, তারা আমাদের বিরুদ্ধে ডাক দিয়েছে? আমরা যদি মদীনায় নিরাপদে ফিরে যাই তবে সম্মানিত ব্যক্তিগণ অবশ্যই বাহির করে দিবে অপদস্ত ব্যক্তিদেরকে। তখন ‘উমর (রাঃ) বললেন, হে আল্লাহ্‌র রাসূল! আপনি কি এই খাবীসকে হত্যা করার অনুমতি দিবেন? নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, লোকজন বলাবলি করবে, মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁর সাহাবীদেরকে হত্যা করে থাকে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 131470,
        "last_updated": null
    },
    {
        "banglaURN": 6035190,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2450,
        "babName": null,
        "hadithNumber": 3519,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ ইব্ন মাস’উদ (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, ঐ ব্যক্তি আমাদের দলভুক্ত নয় যে গালে চপেটাঘাত করে, পরনের কাপড় ছিন্নভিন্ন করে এবং জাহিলীয়াতের যুগের মত হাঁকডাক করে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 131480,
        "last_updated": null
    },
    {
        "banglaURN": 6035200,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2451,
        "babName": null,
        "hadithNumber": 3520,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, ‘আম্‌র ইব্‌ন লুহাই ইব্‌ন কাম’আহ ইব্‌ন খিনদাফ খুযা’আহ গোত্রের পূর্বপুরুষ ছিল।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 131490,
        "last_updated": null
    },
    {
        "banglaURN": 6035210,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2451,
        "babName": null,
        "hadithNumber": 3521,
        "hadithSanad": "",
        "hadithText": "যুহরী (রহঃ) থেকে বর্ণিতঃ আমি সাঈ’দ ইব্‌ন মুসাইয়্যাব (রহঃ) -কে বলতে শুনেছি। তিনি বলেন, বাহীরাহ বলে দেবতার নামে উৎসর্গ করা উটনী যার দুধ আট্কিয়ে রাখা হত এবং কোন লোক তার দুধ দোহন করত না। সা-য়িবাহ বলে ঐ পশুকে যাকে তারা ছেড়ে দিত দেবতার নামে। তাকে বোঝা বহন ইত্যাদি কোন কাজ কর্মে ব্যবহার করা হয় না। রাবী বলেন, আবূ হুরায়রা (রাঃ) বলেছেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, আমি ‘আম্‌র ইব্‌ন ‘আমির খুয’আহকে তার বহির্গত নাড়ি - ভুঁড়ি নিয়ে জাহান্নামের আগুনে চলাফেরা করতে দেখেছি। সেই প্রথম ব্যক্তি যে সা-য়্যিবাহ উৎসর্গ করার প্রথা প্রচলন করে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 131500,
        "last_updated": null
    },
    {
        "banglaURN": 6035220,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2453,
        "babName": null,
        "hadithNumber": 3522,
        "hadithSanad": "",
        "hadithText": "আবূ জামরা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, ‘আবদুল্লাহ ইব্‌ন ‘আব্বাস (রাঃ) আমাদেরকে বললেন, আমি কি তোমাদেরকে আবূ যার (রাঃ) এর ইসলাম গ্রহণের ঘটনা বিস্তারিতভাবে বর্ণনা করব? আমরা বললাম হাঁ, অবশ্যই। তিনি বলেন, আবূ যার (রাঃ) বলেছেন, আমি গিফার গোত্রের একজন মানুষ। আমরা জানতে পেলাম মক্কায় এক ব্যক্তি আত্মপ্রকাশ করে নিজেকে নবী বলে দাবী করছেন। আমি আমার ভাইকে বললাম, তুমি মক্কায় গিয়ে ঐ ব্যক্তির সাথে সাক্ষাৎ ও আলোচনা করে বিস্তারিত খোঁজ - খবর নিয়ে এস। সে রওয়ানা হয়ে গেল এবং মক্কার ঐ লোকটির সঙ্গে সাক্ষাৎ ও আলাপ - আলোচনা করে ফিরে আসলে আমি জিজ্ঞেস করলাম- কী খবর নিয়ে এলে? সে বলল, আল্লাহ্‌র কসম! আমি একজন মহান ব্যক্তিকে দেখেছি যিনি সৎকাজের আদেশ এবং মন্দ কাজ হতে নিষেধ করেন। আমি বললাম, তোমার খবরে আমি সন্তুষ্ট হতে পারলাম না। অতঃপর আমি একটি ছড়ি ও এক পাত্র খাবার নিয়ে মক্কার দিকে রওয়ানা হলাম। মক্কায় পৌছে আমার অবস্থা দাঁড়াল এমন- তিনি আমার পরিচিত নন, কারো নিকট জিজ্ঞেস করাও আমি সমীচীন মনে করি না। তাই আমি যমযমের পানি পান করে মসজিদে থাকতে লাগলাম। একদিন সন্ধ্যা বেলা ‘আলী (রাঃ) আমার নিকট দিয়ে গমনকালে আমার প্রতি ইশারা করে বললেন, মনে হয় লোকটি বিদেশী। আমি বললাম, হাঁ। তিনি বললেন, আমার সঙ্গে আমার বাড়িতে চল। পথেই তিনি আমাকে কোন কিছু জিজ্ঞেস করেননি। আর আমিও ইচ্ছা করে কোন কিছু বলিনি। তাঁর বাড়িতে রাত্রি যাপন করে ভোর বেলায় আবার মসজিদে গেলাম যাতে ঐ ব্যক্তি সম্পর্কে জিজ্ঞেস করব। কিন্তু ওখানে এমন কোন লোক ছিল না যে ঐ ব্যক্তি সম্পর্কে কিছু বলবে। ঐ দিনও ‘আলী (রাঃ) আমার নিকট দিয়ে চলার সময় বললেন, এখনো কি লোকটি তার গন্তব্যস্থল ঠিক করতে পারেনি? আমি বললাম, না। তিনি বললেন, আমার সঙ্গে চল। পথিমধ্যে তিনি আমাকে জিজ্ঞেস করলেন বল, তোমার বিষয় কী? কেন এ শহরে এসেছ? আমি বললাম, যদি আপনি আমার বিষয়টি গোপন রাখার আশ্বাস দেন তাহলে তা আপনাকে বলতে পারি। তিনি বললেন নিশ্চয়ই আমি গোপন করব। আমি বললাম, আমরা জানতে পেরেছি, এখানে এমন এক লোকের আবির্ভাব হয়েছে যিনি নিজেকে নবী বলে দাবী করেন। আমি তাঁর সঙ্গে বিস্তারিত আলাপ আলোচনা করার জন্য আমার ভাইকে পাঠিয়েছিলাম। কিন্তু সে ফেরত গিয়ে আমাকে সন্তোষজনক কোন কিছু বলতে পারেনি। তাই নিজে দেখা করার ইচ্ছা নিয়ে এখানে আগমন করেছি। ‘আলী (রাঃ) বললেন, তুমি সঠিক পথপ্রদর্শক পেয়েছ। আমি এখনই তাঁর কাছে উপস্থিত হবার জন্য রওয়ানা হয়েছি। তুমি আমাকে অনুসরণ কর এবং আমি যে গৃহে প্রবেশ করি তুমিও সে গৃহে প্রবেশ করবে। রাস্তায় যদি তোমার বিপদজনক কোন লোক দেখতে পাই তবে আমি জুতা ঠিক করার অজুহাতে দেয়ালের পার্শ্বে সরে দাঁড়াব, যেন আমি জুতা ঠিক করছি। তুমি কিন্তু চলতেই থাকবে। ‘আলী (রাঃ) পথ চলতে শুরু করলেন। আমিও তাঁর অনুসরণ করে চলতে লাগলাম। তিনি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর নিকট প্রবেশ করলে, আমিও তাঁর সঙ্গে ঢুকে পড়লাম। আমি বললাম, আমার নিকট ইসলাম পেশ করুন। তিনি পেশ করলেন। আর আমি মুসলিম হয়ে গেলাম। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, হে আবূ যার। এখনকার মত তোমার ইসলাম গ্রহণ গোপন রেখে তোমার দেশে চলে যাও। যখন আমাদের বিজয়ের খবর জানতে পাবে তখন এসো। আমি বললাম, যে আল্লাহ্ আপনাকে সত্য দীনসহ পাঠিয়েছেন তাঁর শপথ! আমি কাফির মুশরিকদের সামনে উচ্চঃস্বরে তৌহীদের বাণী ঘোষণা করব। (ইব্‌ন ‘আব্বাস (রাঃ) বলেন, ) এই কথা বলে তিনি মসজিদে হারামে গমন করলেন, কুরাইশের লোকজনও সেখানে হাজির ছিল। তিনি বললেন হে কুরাইশগণ! আমি নিশ্চিতভাবে সাক্ষ্য দিচ্ছি যে, আল্লাহ্ ছাড়া কোন মা’বুদ নেই এবং আমি আরো সাক্ষ্য দিচ্ছি যে, মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আল্লাহ্‌র বান্দা ও তাঁর রাসূল। এতদশ্রবণে কুরাইশগণ বলে উঠল, ধর এই ধর্মত্যাগী লোকটিকে। তারা আমার দিকে এগিয়ে আসলো এবং আমাকে নির্মমভাবে প্রহার করতে লাগল; যেন আমি মরে যাই। তখন ‘আব্বাস (রাঃ) আমার নিকট পৌঁছে আমাকে ঘিরে রাখলেন। অতঃপর তিনি কুরাইশকে উদ্দেশ্য করে বললেন, তোমাদের বিপদ অবশ্যম্ভাবী। তোমরা গিফার বংশের জনৈক ব্যক্তিকে হত্যা করতে উদ্যোগী হয়েছ অথচ তোমাদের ব্যবসা - বাণিজ্যের কাফেলাকে গিফার গোত্রের নিকট দিয়ে যাতায়াত করতে হয়। এ কথা শুনে তারা সরে পড়ল। পরদিন ভোরবেলা কাবাগৃহে উপস্থিত হয়ে গতদিনের মতই আমি আমার ইসলাম গ্রহণের পূর্ণ ঘোষনা দিলাম। কুরাইশগণ বলে উঠলো, ধর এই ধর্মত্যাগী লোকটিকে। গতদিনের মত আজও তারা নির্মমভাবে আমাকে মারধর করলো। এই দিনও ‘আব্বাস (রাঃ) এসে আমাকে রক্ষা করলেন এবং কুরাইশদেরকে উদ্দেশ্য করে ঐ দিনের মত বক্তব্য রাখলেন। ইব্‌ন ‘আব্বাস (রাঃ) বলেন, এটাই ছিল আবূ যার (রাঃ) -এর ইসলাম গ্রহণের প্রথম ঘটনা।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 131510,
        "last_updated": null
    },
    {
        "banglaURN": 6035230,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2454,
        "babName": null,
        "hadithNumber": 3523,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, আসলাম, গিফার এবং মুযাইনাহ ও জুহানাহ গোত্রের কিছু অংশ অথবা জুহানাহর কিছু অংশ কিংবা মুযায়নাহর কিছু অংশ আল্লাহ্‌র নিকট অথবা বলেছেন কিয়ামতের দিন আসাদ, তামীম, হাওয়াযিন ও গাত্ফান গোত্র চেয়ে উত্তম বলে বিবেচিত হবে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 131520,
        "last_updated": null
    },
    {
        "banglaURN": 6035240,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2454,
        "babName": null,
        "hadithNumber": 3524,
        "hadithSanad": "",
        "hadithText": "ইব্ন ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, তুমি যদি আরবদের অজ্ঞতা সম্বন্ধে জানতে আগ্রহী হও, তবে সূরা আন্’আমের ১৩০ আয়াতের অংশটুকু মনোযোগের সঙ্গে পাঠ কর। “অবশ্যই ক্ষতিগ্রস্ত হয়েছে তারা যারা নিজ সন্তানদেরকে হত্যা করেছে বোকামির দরুন ও অজ্ঞতাবশতঃ এবং হারাম করে নিয়েছে তা যা আল্লাহ্ তাদেরকে জীবিকা হিসেবে দিয়েছিলেন, কেবল আল্লাহ্ সম্বন্ধে মিথ্যা রচনা করার উদ্দেশ্যে। নিশ্চয় তারা বিপথগামী হয়েছে এবং তারা হিদায়াতপ্রাপ্তও ছিল না”। (আল-আনআম ১৪০)</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 131530,
        "last_updated": null
    },
    {
        "banglaURN": 6035250,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2455,
        "babName": null,
        "hadithNumber": 3525,
        "hadithSanad": "",
        "hadithText": "ইব্ন ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, যখন এ আয়াত “তোমার নিকট আত্মীয়গণকে সতর্ক কর” (আশ শু’আরাঃ ২১৪) অবতীর্ণ হল, তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, হে বানী ফিহ্র, হে বনী ‘আদি! বিভিন্ন কুরাইশ শাখা গোত্রগুলিকে নাম ধরে ধরে ইসলামের পথে ডাক দিতে লাগলেন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 131540,
        "last_updated": null
    },
    {
        "banglaURN": 6035260,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2455,
        "babName": null,
        "hadithNumber": 3526,
        "hadithSanad": "",
        "hadithText": "ইবন ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, যখন এ আয়াত “তোমার নিকট আত্মীয়গণকে সতর্ক কর” (আশ শু’আরাঃ ২১৪) অবতীর্ণ হল, তখন নবী (সল্লাল্লাহু আলাইহি ওয়া সাল্লাম) তাদেরকে গোত্র গোত্র ধরে ডাক দিতে লাগলেন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 131550,
        "last_updated": null
    },
    {
        "banglaURN": 6035270,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2455,
        "babName": null,
        "hadithNumber": 3527,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, হে আব্দে মানাফের বংশধরগণ! তোমরা তোমাদের নিজেদেরকে আল্লাহ্‌র শাস্তি হতে বাঁচাও। হে ‘আবদুল মুত্তালিবের বংশধরগণ! তোমরা তোমাদের নিজেদেরকে হিফাজত কর। হে যুবায়রের মা- আল্লাহ্‌র রাসূলের ফুফু, হে মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর কন্যা ফাতিমা! তোমরা তোমাদের নিজেদেরকে রক্ষা কর। তোমাদেরকে আজাব হতে বাঁচানোর সামান্যতম ক্ষমতাও আমার নাই আর আমার ধন - সম্পদ হতে তোমরা যা ইচ্ছা তা চেয়ে নিতে পার।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 131560,
        "last_updated": null
    },
    {
        "banglaURN": 6035280,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2456,
        "babName": null,
        "hadithNumber": 3528,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আনসারদের বললেন, তোমাদের মধ্যে অপর গোত্রের কেউ আছে কি? তারা বললেন না, অন্য কেউ নেই। তবে আমাদের এক ভাগিনা আছে। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন কোন গোত্রের ভাগ্নে সে গোত্রেরই অন্তর্ভুক্ত।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 131570,
        "last_updated": null
    },
    {
        "banglaURN": 6035310,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2458,
        "babName": null,
        "hadithNumber": 3531,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, হাসসান (রাঃ) কবিতার ছন্দে মুশরিকদের নিন্দা করতে অনুমতি চাইলে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, আমার বংশকে কিভাবে তুমি আলাদা করবে? হাসসান (রাঃ) বললেন, আমি তাদের মধ্য হতে এমনভাবে আপনাকে আলাদা করে নিব যেমনভাবে আটার খামির হতে চুলকে আলাদা করে নেয়া হয়। ‘উরওয়াহ্ (রহঃ) বলেন, আমি হাসসান (রাঃ) -কে ‘আয়িশা (রাঃ) -এর সম্মুখে তিরস্কার করতে উদ্যত হলে, তিনি আমাকে বললেন, তাকে গালি দিও না। সে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর তরফ হতে কবিতার মাধ্যমে শত্রুর কথার আঘাত প্রতিহত করত।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 131600,
        "last_updated": null
    },
    {
        "banglaURN": 6035320,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2459,
        "babName": null,
        "hadithNumber": 3532,
        "hadithSanad": "",
        "hadithText": "যুবায়র ‘ইব্ন মুত’ঈম (রাঃ) থেকে বর্ণিতঃ আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, আমার পাঁচটি (প্রসিদ্ধ) নাম রয়েছে, আমি মুহাম্মাদ, আমি আহ্মাদ, আমি আল-মাহী আমার দ্বারা আল্লাহ্ কুফ্র ও শিরককে নিশ্চিহ্ন করে দিবেন। আমি আল-হাশির আমার চারপাশে মানব জাতিকে একত্রিত করা হবে। আমি আল-আক্বিব (সর্বশেষে আগমনকারী)।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 131610,
        "last_updated": null
    },
    {
        "banglaURN": 6035330,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2459,
        "babName": null,
        "hadithNumber": 3533,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, তোমরা কি আশ্চর্যান্বিত হও না? আমার উপর আরোপিত কুরাইশদের নিন্দা ও অভিশাপকে আল্লাহ্ তা’আলা কি চমৎকারভাবে দূরীভূত করছেন? তারা আমাকে নিন্দিত ভেবে গালি দিচ্ছে, অভিশাপ করছে অথচ আমি মুহাম্মাদ চির প্রশংসিত।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 131620,
        "last_updated": null
    },
    {
        "banglaURN": 6035340,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2460,
        "babName": null,
        "hadithNumber": 3534,
        "hadithSanad": "",
        "hadithText": "জাবির ‘ইব্ন ‘আবদুল্লাহ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন আমার ও অন্যান্য নবীগণের অবস্থা এমন, যেন কেউ একটি গৃহ নির্মাণ করলো আর একটি ইটের স্থান শূন্য রেখে নির্মাণ কাজ শেষ করে গৃহটিকে সুসজ্জিত করে নিল। জনগণ মুগ্ধ হল এবং তারা বলাবলি করতে লাগল, যদি একটি ইটের জায়গাটুকু খালি রাখা না হত।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 131630,
        "last_updated": null
    },
    {
        "banglaURN": 6035350,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2460,
        "babName": null,
        "hadithNumber": 3535,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, আমি এবং আমার পূর্ববর্তী নবীগণের অবস্থা এমন, এক ব্যক্তি যেন একটি গৃহ নির্মাণ করল; তাকে সুশোভিত ও সুসজ্জিত করল, কিন্তু এক পাশে একটি ইটের জায়গা খালি রয়ে গেল। অতঃপর লোকজন এর চারপাশে ঘুরে আশ্চর্য হয়ে বলতে লাগল ঐ শূন্যস্থানের ইটটি লাগানো হল না কেন? নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, আমিই সে ইট। আর আমিই সর্বশেষ নবী।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 131640,
        "last_updated": null
    },
    {
        "banglaURN": 6035360,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2461,
        "babName": null,
        "hadithNumber": 3536,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ যখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর মৃত্যু হয় তখন তাঁর বয়স হয়েছিল তেষট্টি বছর। ইব্‌ন শিহাব বলেন, সা’ঈদ ইবনুল মুসায়্যিব এভাবেই আমার কাছে বর্ণনা করেন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 131650,
        "last_updated": null
    },
    {
        "banglaURN": 6035370,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2462,
        "babName": null,
        "hadithNumber": 3537,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) একদিন বাজারে গিয়েছিলেন। তখন এক ব্যক্তি ‘হে আবুল কাসিম!’ বলে ডাক দিল।  নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সেদিকে ফিরে তাকালেন। তখন তিনি বললেন, তোমরা আমার আসল নামে নাম রাখতে পার, কিন্তু আমার উপনামে কারো নাম রেখ না।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 131660,
        "last_updated": null
    },
    {
        "banglaURN": 6035380,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2462,
        "babName": null,
        "hadithNumber": 3538,
        "hadithSanad": "",
        "hadithText": "জাবির (রাঃ) সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বললেন, আমার আসল নামে অন্যের নামকরণ করতে পার, কিন্তু আমার উপনাম অন্যের জন্য রেখোনা।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 131670,
        "last_updated": null
    },
    {
        "banglaURN": 6035390,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2462,
        "babName": null,
        "hadithNumber": 3539,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আবূল কাসিম (নবী) (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, আমার নামে নামকরণ করতে পার, কিন্তু আমার উপনামে তোমাদের নাম রেখ না।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 131680,
        "last_updated": null
    },
    {
        "banglaURN": 6035400,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2463,
        "babName": null,
        "hadithNumber": 3540,
        "hadithSanad": "",
        "hadithText": "জু’আইদ ইব্ন ‘আবদুর রাহমান (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি ‘সাইব ইব্‌ন ইয়াযীদকে চুরানব্বই বছর বয়সে সুস্থ - সবল ও সুঠাম দেহের অধিকারী দেখেছি। তিনি বললেন, তুমি অবশ্যই জ্ঞাত আছ যে, আমি এখনও নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর দু’আর বরকতেই চোখ ও কান দিয়ে উপকার লাভ করছি। আমার খালা একদিন আমাকে নিয়ে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর নিকট গেলেন এবং বললেন, হে আল্লাহ্‌র রাসূল! আমার ভাগিনাটি রোগাক্রান্ত। আপনি তার জন্য আল্লাহ্‌র কাছে দু’আ করুন। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমার জন্য দু’আ করলেন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 131690,
        "last_updated": null
    },
    {
        "banglaURN": 6035410,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2464,
        "babName": null,
        "hadithNumber": 3541,
        "hadithSanad": "",
        "hadithText": "জু’আইদ (রহঃ) থেকে বর্ণিতঃ আমি ‘সাইব ইব্‌ন ইয়াযীদকে বলতে শুনেছি যে, আমার খালা  আমাকে আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর নিকট নিয়ে গেলেন এবং বললেন, হে আল্লাহ্‌র রাসূল! আমার ভাগিনা রোগাক্রান্ত। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমার মাথায় হাত বুলালেন এবং আমার জন্য বরকতের দু’আ করলেন। তিনি ওযু করলেন, তাঁর ওযুর বাকি পানি আমি পান করলাম। অতঃপর আমি তাঁর পিছন দিকে গিয়ে দাঁড়ালাম তাঁর স্কন্ধের মাঝে “মোহরে নাবুওয়্যাত” দেখলাম যা কবুতরের ডিমের মত অথবা বাসর ঘরের পর্দার বুতামের মত।\nইব্‌ন ‘উবায়দুল্লাহ বলেন, (আরবী) অর্থ সাদা চিহ্ন, যা ঘোড়ার কপালের সাদা অংশ এর অর্থ হতে গৃহীত। আর ইব্রাহীম ইব্‌ন হামযাহ বলেন, কবুতরের ডিমের মত। আবূ ‘আবদুল্লাহ বুখারী (রহঃ) বলেন বিশুদ্ধ (আরবী) এর পূর্বে (আরবী) হবে অর্থাৎ (আরবী)।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 131700,
        "last_updated": null
    },
    {
        "banglaURN": 6035420,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3542,
        "hadithSanad": "",
        "hadithText": "‘উকবা ইবন হারিস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, একদিন আবূ বকর (রাঃ) বাদ আসরের সালাত শেষে বের হয়ে চলতে লাগলেন। হাসান (রাঃ) -কে ছেলেদের সঙ্গে খেলা করতে দেখলেন। তখন তিনি তাঁকে  স্কন্ধে  তুলে নিলেন এবং বললেন, আমার পিতা কুরবান হোন! এ-ত নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর সাদৃশ্য, আলীর সাদৃশ্য নয়। তখন ‘আলী (রাঃ) হাসছিলেন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 131710,
        "last_updated": null
    },
    {
        "banglaURN": 6035430,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3543,
        "hadithSanad": "",
        "hadithText": "আবূ জুহাইফা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে দেখেছি। আর হাসান (রাঃ) তাঁরই সদৃশ।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 131720,
        "last_updated": null
    },
    {
        "banglaURN": 6035440,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3544,
        "hadithSanad": "",
        "hadithText": "আবূ জুহাইফা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে দেখেছি। হাসান ইব্‌ন ‘আলী ছিলেন (রাঃ) তাঁরই সদৃশ। (রাবী বলেন) আমি  আবূ জুহায়ফাকে বললাম, আপনি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর বর্ণনা দিন। তিনি বললেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) গৌর বর্ণের ছিলেন। কাল কেশরাজির মধ্যে সামান্য  সাদা চুলও ছিল। তিনি তেরটি সবল উটনী আমাদেরকে দেয়ার আদেশ দিয়েছিলেন, কিন্তু আমাদের হাতে আসার আগেই নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর মৃত্যু হয়।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 131730,
        "last_updated": null
    },
    {
        "banglaURN": 6035450,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3545,
        "hadithSanad": "",
        "hadithText": "আবূ জুহাইফা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে দেখেছি আর তাঁর নীচ ঠোঁটের নিন্মভাগে দাড়িতে সামান্য সাদা চুল দেখেছি।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 131740,
        "last_updated": null
    },
    {
        "banglaURN": 6035460,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3546,
        "hadithSanad": "",
        "hadithText": "হারীয ইব্ন ‘উসমান (রহঃ) থেকে বর্ণিতঃ তিনি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর সাহাবী ‘আবদুল্লাহ ইব্‌ন বুসরকে জিজ্ঞেস করলেন, আপনি কি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে দেখেছেন যে, তিনি কি বৃদ্ধ ছিলেন? তিনি বললেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর নিম্ন দাড়িতে কয়েকটি চুল সাদা ছিল।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 131750,
        "last_updated": null
    },
    {
        "banglaURN": 6035470,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3547,
        "hadithSanad": "",
        "hadithText": "রাবী’আ ইব্ন আবূ ‘আবদুর রহমান (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আনাস  ইব্‌ন মালিক (রাঃ) -কে  নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর বর্ণনা দিতে শুনেছি। তিনি বলেছেন যে, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) লোকেদের মধ্যে মাঝারি গড়নের ছিলেন- বেশি  লম্বাও ছিলেন না বা বেঁটেও ছিলেন না। তাঁর শরীরের রং গোলাপী ধরণের ছিল, ধবধবে সাদাও নয় কিংবা তামাটে বর্ণেরও নয়। মাথার চুল কোঁকড়ানোও ছিলনা, আবার একেবারে  সোজাও ছিলনা। চল্লিশ বছর বয়সে তাঁর উপর ওয়াহী নাযিল হওয়া শুরু হয়। প্রথম দশ বছর মক্কায় অবস্থানকালে ওয়াহী যথারীতি নাযিল হতে থাকে। অতঃপর দশ বছর মদীনায় কাটান। অতঃপর তাঁর মৃত্যুর সময় তাঁর  মাথা ও দাড়িতে কুড়িটি সাদা চুলও ছিলনা। রাবী’আ (রহঃ) বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর একটি  চুল দেখেছি তা লাল রং-এর ছিল। আমি জিজ্ঞেস করলে বলা হল যে, সুগন্ধী লাগানোর জন্য তা লাল হয়েছিল।তিনি বলেন, আমি আনাস  ইব্‌ন মালিক (রাঃ) -কে  নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর বর্ণনা দিতে শুনেছি। তিনি বলেছেন যে, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) লোকেদের মধ্যে মাঝারি গড়নের ছিলেন- বেশি  লম্বাও ছিলেন না বা বেঁটেও ছিলেন না। তাঁর শরীরের রং গোলাপী ধরণের ছিল, ধবধবে সাদাও নয় কিংবা তামাটে বর্ণেরও নয়। মাথার চুল কোঁকড়ানোও ছিলনা, আবার একেবারে  সোজাও ছিলনা। চল্লিশ বছর বয়সে তাঁর উপর ওয়াহী নাযিল হওয়া শুরু হয়। প্রথম দশ বছর মক্কায় অবস্থানকালে ওয়াহী যথারীতি নাযিল হতে থাকে। অতঃপর দশ বছর মদীনায় কাটান। অতঃপর তাঁর মৃত্যুর সময় তাঁর  মাথা ও দাড়িতে কুড়িটি সাদা চুলও ছিলনা। রাবী’আ (রহঃ) বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর একটি  চুল দেখেছি তা লাল রং-এর ছিল। আমি জিজ্ঞেস করলে বলা হল যে, সুগন্ধী লাগানোর জন্য তা লাল হয়েছিল।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 131760,
        "last_updated": null
    },
    {
        "banglaURN": 6035480,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3548,
        "hadithSanad": "",
        "hadithText": "আনাস ইবন মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) অতিরিক্ত লম্বাও ছিলেন না  এবং বেঁটেও ছিলেন না। ধবধবে সাদাও ছিলেন না, আবার তামাটে  রং এরও ছিলেন না। কেশগুচ্ছ একেবারে কুঞ্চিত ছিল না, পুরোপুরি সোজাও ছিল না। চল্লিশ বছর বয়সে তিনি নবুওয়্যাত পান। তাঁর নবুওয়্যাত সময়ের প্রথম দশ বছর মক্কায় এবং পরের দশ বছর মদীনায় কাটান। তাঁর মৃত্যুকালে মাথা ও দাড়িতে বিশটি চুলও সাদা ছিল না।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 131770,
        "last_updated": null
    },
    {
        "banglaURN": 6035490,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3549,
        "hadithSanad": "",
        "hadithText": "বারাআ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর চেহারা ছিল মানুষের মধ্যে [১] সর্বাপেক্ষা সুন্দর এবং তিনি ছিলেন সর্বোত্তম আখলাকের অধিকারী। তিনি বেশি লম্বাও ছিলেন না এবং বেঁটেও ছিলেন না।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 131780,
        "last_updated": null
    },
    {
        "banglaURN": 6035500,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3550,
        "hadithSanad": "",
        "hadithText": "ক্বাতাদাহ (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আনাস (রাঃ) -কে জিজ্ঞেস করলাম, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) চুলে খেযাব লাগাতেন কি? তিনি বললেন, না। তাঁর কানের পাশে সামান্য কয়টা চুল সাদা হয়েছিল মাত্র।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 131790,
        "last_updated": null
    },
    {
        "banglaURN": 6035510,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3551,
        "hadithSanad": "",
        "hadithText": "বারাআ ইব্ন ‘আযিব (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) মাঝারি গড়নের ছিলেন। তাঁর উভয় কাঁধের মধ্যস্থল প্রশস্ত ছিল। তাঁর মাথার চুল দুই কানের লতি পর্যন্ত বিস্তৃত ছিল। আমি তাঁকে লাল ডোরাকাটা জোড় চাদর পরা অবস্থায় দেখেছি। তাঁর চেয়ে বেশি সুন্দর আমি কখনো কাউকে দেখিনি। ইউসুফ ইব্‌ন আবূ ইসহাক তাঁর পিতা হতে হাদীস বর্ণনায় বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর মাথার চুল কাঁধ পর্যন্ত বিস্তৃত ছিল।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 131800,
        "last_updated": null
    },
    {
        "banglaURN": 6035520,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3552,
        "hadithSanad": "",
        "hadithText": "আবূ ইসহাক তাবি-ঈ (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, বারাআ (রহঃ) -কে জিজ্ঞেস করা হল, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর চেহারা মুবারক কি তলোয়ারের মত ছিল? তিনি বললেন, না বরং চাঁদের ন্যায় ছিল।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 131810,
        "last_updated": null
    },
    {
        "banglaURN": 6035530,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3553,
        "hadithSanad": "",
        "hadithText": "হাকাম (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আবূ জুহাইফাহ (রাঃ) -কে বলতে শুনেছি। তিনি বলেছেন, একদিন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) দুপুর বেলায় বাতহার দিকে বেরোলেন। সে স্থানে উযূ করে যুহরের দু’রাকআত ও আসরের দু’ রাক’আত সালাত আদায় করেন। তাঁর সামনে একটি বর্শা পোঁতা ছিল। বর্শার বাহির দিয়ে নারীরা যাতায়াত করছিল। সালাত শেষে লোকজন দাঁড়িয়ে গেল এবং নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর দু’ হাত ধরে তারা নিজেদের মাথা ও মুখমণ্ডলে বুলাতে লাগলেন। আমিও নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর হাত ধরে আমার মুখমণ্ডলে বুলাতে লাগলাম। তাঁর হাত বরফের থেকেও স্নিগ্ধ শীতল ও কস্তুরীর থেকেও বেশি সুগন্ধিময় ছিল।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 131820,
        "last_updated": null
    },
    {
        "banglaURN": 6035540,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3554,
        "hadithSanad": "",
        "hadithText": "ইব্ন ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সর্বাপেক্ষা বেশি দানশীল ছিলেন। তাঁর দানশীলতা বহুগুন বর্ধিত হত রমাযানের পবিত্র দিনে যখন জিব্রাঈল (আঃ) তাঁর সঙ্গে দেখা করতেন। জিব্রাঈল (আঃ) রমাযানের প্রতি রাতে তাঁর সঙ্গে দেখা করে কুরআনের সবক দিতেন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) কল্যাণ বণ্টনে প্রবাহিত বাতাসের চেয়েও বেশি দানশীল ছিলেন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 131830,
        "last_updated": null
    },
    {
        "banglaURN": 6035550,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3555,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ একদিন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) অত্যন্ত আনন্দিত ও খুশী মনে তাঁর নিকট প্রবেশ করলেন। খুশীর কারণে তাঁর চেহারায় খুশীর চিহ্ন পরিস্ফুট হচ্ছিল। তিনি তখন ‘আয়িশাকে বললেন, হে ‘আয়িশা! তুমি শুননি, মুদলাজী যায়দ ও উসামাহ সম্পর্কে  কী বলেছে? পিতা-পুত্রের শুধু পা দেখে বলল, এ পাগুলোর একটি অন্যটির অংশ।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 131840,
        "last_updated": null
    },
    {
        "banglaURN": 6035560,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3556,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ ইব্ন কা’ব (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আমার পিতা কা’ব ইব্‌ন মালিক (রাঃ) -কে তার তাবূক যুদ্ধে না যাওয়ার ঘটনা বর্ণনা করতে শুনেছি। তিনি বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে সালাম করলাম, খুশী ও আনন্দে তাঁর চেহারা ঝলমল করে উঠলো। তাঁর চেহারা এমনিই আনন্দে টগবগ করত। মনে হত যেন চাঁদের একটি টুক্রা। তাঁর মুখমণ্ডলের এ অবস্থা হতে আমরা তা বুঝতে পারতাম।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 131850,
        "last_updated": null
    },
    {
        "banglaURN": 6035570,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3557,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, আমি বনি আদমের সর্বোত্তম যুগে আবির্ভূত হয়েছি। যুগের পর যুগ অতিবাহিত হয়ে আমি সেই যুগেই এসেছি যে যুগ আমার জন্য নির্দিষ্ট ছিল।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 131860,
        "last_updated": null
    },
    {
        "banglaURN": 6035580,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3558,
        "hadithSanad": "",
        "hadithText": "ইব্ন ‘আব্বাস (রহঃ) থেকে বর্ণিতঃ আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁর চুল পিছনে দিকে আঁচড়ে রাখতেন আর মুশ্রিকগণ তাদের চুল দু‘ভাগ করে সিঁথি কেটে রাখত। আহলে কিতাব তাদের চুল পিছন দিকে আঁচড়ে রাখত। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যে কোন বিষয়ে আল্লাহ্‌র নির্দেশ না পাওয়া পর্যন্ত আহলে কিতাবের অনুসরণ পছন্দ করতেন। অতঃপর নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁর চুল দু’ভাগ করে সিঁথি করে রাখতে লাগলেন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 131870,
        "last_updated": null
    },
    {
        "banglaURN": 6035590,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3559,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্ ইব্‌ন ‘আম্‌র (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) অশ্লীল ভাষী ও অসদাচরণের অধিকারী ছিলেন না। তিনি বলতেন, তোমাদের মধ্যে সেই ব্যক্তিই সর্বোত্তম যে নৈতিকতায় সর্বোত্তম।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 131880,
        "last_updated": null
    },
    {
        "banglaURN": 6035600,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3560,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে যখনই দু’টি জিনিসের একটি গ্রহণের স্বাধীনতা দেয়া হত, তখন তিনি সহজটিই গ্রহণ করতেন যদি তা গুনাহ না হত। গুনাহ হতে তিনি অনেক দূরে অবস্থান করতেন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) নিজের ব্যাপারে কখনো প্রতিশোধ গ্রহণ করেননি। তবে আল্লাহ্‌র সীমারেখা লঙ্ঘন করা হলে আল্লাহ্কে সন্তুষ্ট করার জন্য প্রতিশোধ নিতেন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 131890,
        "last_updated": null
    },
    {
        "banglaURN": 6035610,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3561,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর হাতের তালুর চেয়ে মোলায়েম কোন নরম ও গরদকেও আমি স্পর্শ করিনি। আর নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর শরীরের সুঘ্রাণ অপেক্ষা অধিক সুঘ্রাণ আমি কখনো পাইনি।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 131900,
        "last_updated": null
    },
    {
        "banglaURN": 6035620,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3562,
        "hadithSanad": "",
        "hadithText": "আবূ সা‘ঈদ খুদরী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) গৃহবাসিনী পর্দানশীন কুমারীদের চেয়েও বেশি লজ্জাশীল ছিলেন। মুহাম্মদ (রহঃ).... শু’বাহ (রহঃ) হতে একই রূপ রিওয়ায়াত বর্ণিত হয়েছে। যখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) কোন কিছু অপছন্দ করতেন তা চেহারায় বুঝা যেত।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 131910,
        "last_updated": null
    },
    {
        "banglaURN": 6035630,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3563,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) কখনো কোন খাদ্যকে মন্দ বলতেন না। ‎রুচি হলে খেতেন না হলে বাদ দিতেন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 131920,
        "last_updated": null
    },
    {
        "banglaURN": 6035640,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3564,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্ ইব্ন মালিক ইব্ন বুহায়নাহ আসাদিইয়ি (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ‎যখন সাজদাহ্ করতেন, তখন উভয় বাহুকে শরীর হতে এমনভাবে আলাদা করতেন যে, আমরা তাঁর বগল দেখতে পেতাম। ইব্‌ন বুকাইর ‎বলেন, বক্র হাদীস বর্ণনা করে বলেছেন, তাঁর বগলের শুভ্রতা দেখতে পেতাম।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 131930,
        "last_updated": null
    },
    {
        "banglaURN": 6035650,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3565,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ইস্তিস্কায় যতটা উঠাতেন অন্য কোন দু’আয় তাঁর বাহুদ্বয় এতটা ঊর্ধ্বে উঠাতেন না, কেননা এতে হাত এত ঊর্ধ্বে উঠাতেন যে তাঁর বগলের শুভ্রতা দেখা যেত। আবূ মূসা (রহঃ) হাদীস বর্ণনায় বলেন, আনাস (রাঃ) বলেছেন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) দু‘আর মধ্যে দু’হাত উপরে উঠিয়েছেন এবং আমি তাঁর বগলের শুভ্রতা দেখেছি।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 131940,
        "last_updated": null
    },
    {
        "banglaURN": 6035660,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3566,
        "hadithSanad": "",
        "hadithText": "আবূ জুহায়ফাহ (রহঃ) থেকে বর্ণিতঃ তিনি বলেন যে, আমাকে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর কাছে নেয়া হল। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তখন আবতাহ নামক জায়গায় দুপুর বেলায় একটি তাঁবুতে অবস্থান করছিলেন। বিলাল (রাঃ) তাঁবু হতে বেরিয়ে এসে যুহরের সালাতের আযান দিলেন এবং আবার প্রবেশ করে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর উযূর অবশিষ্ট পানি নিয়ে বেরিয়ে এলেন। লোকজন তা নেওয়ার জন্য ঝাপিয়ে পড়ল। অতঃপর তিনি আবার তাঁবুতে ঢুকে একটি ছোট্ট বর্শা নিয়ে বেরিয়ে আসলেন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -ও বেরিয়ে আসলেন। আমি যেন তাঁর পায়ের গোছার উজ্জ্বলতা, এখনো দেখতে পাচ্ছি। বর্শাটি সম্মুখে পুঁতে রাখলেন। অতঃপর যুহরের দু’ রাক‘আত এবং পরে আসরের দু’ রাক‘আত সালাত আদায় করলেন। বর্শার বাহির দিয়ে গাধা ও নারীরা চলাফেরা করছিল।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 131950,
        "last_updated": null
    },
    {
        "banglaURN": 6035670,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3567,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এমনভাবে কথা বলতেন যে, কোন গণনাকারী গুনতে চাইলে তাঁর কথাগুলি গণনা করতে পারত।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 131960,
        "last_updated": null
    },
    {
        "banglaURN": 6035680,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2465,
        "babName": null,
        "hadithNumber": 3568,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, তুমি অমুকের অবস্থা দেখে কি অবাক হও না? তিনি এসে আমার হুজরার পাশে বসে আমাকে শুনিয়ে হাদীস বর্ণনা করেন। আমি তখন সালাতে ছিলাম। আমার সালাত শেষ হবার আগেই তিনি উঠে চলে যান। যদি আমি তাকে পেতাম তবে আমি অবশ্যই তাকে সতর্ক করে দিতাম যে, রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তোমাদের মত দ্রুততার সঙ্গে কথা বলতেন না।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 131971,
        "last_updated": null
    },
    {
        "banglaURN": 6035690,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2466,
        "babName": null,
        "hadithNumber": 3569,
        "hadithSanad": "",
        "hadithText": "আবূ সালামা ইব্ন ‘আবদুর রাহমান (রহঃ) থেকে বর্ণিতঃ তিনি ‘আয়িশা (রাঃ) -কে জিজ্ঞেস করলেন, রমাযান মাসে আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর সালাত কেমন ছিল? ‘আয়িশা (রাঃ) বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) রমাযান মাসে ও অন্যান্য সব মাসের রাতে এগার রাক‘আতের অধিক সালাত আদায় রকতেন না। প্রথমে চার রাক‘আত পড়তেন। এ চার রাক‘আত আদায়ের সৌন্দর্য ও দীর্ঘতা সম্পর্কে জিজ্ঞেস করো না। অতঃপর আরো চার রাক‘আত সালাত আদায় করতেন। এ চার রাক‘আতের সৌন্দর্য ও দীর্ঘতা সম্পর্কে জিজ্ঞেস করো না। অতঃপর তিন রাক‘আত আদায় করতেন। তখন আমি বললাম, হে আল্লাহ্‌র রাসূল! আপনি কি বিত্র সালাত আদায়ের পূর্বে ঘুমিয়ে পড়েন? নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, আমার চোখ ঘুমায়, আমার অন্তর ঘুমায় না।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 131990,
        "last_updated": null
    },
    {
        "banglaURN": 6035700,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2466,
        "babName": null,
        "hadithNumber": 3570,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্ন মালিক (রাঃ) থেকে বর্ণিতঃ তিনি মসজিদে কা‘বা হতে রাতে অনুষ্ঠিত ইসরা -এর ঘটনা বর্ণনা করছিলেন যে, তিন ব্যক্তি তাঁর নিকট হাযির হলেন মি‘রাজ সম্পর্কে ওয়াহী অবতরণের পূর্বে। তখন তিনি মাসজিদুল হারামে ঘুমিয়ে ছিলেন। তাঁদের প্রথম জন বলল, তাদের কোন জন তিনি? মাঝের জন উত্তর দিল, তিনিই তাদের শ্রেষ্ঠ জন। আর শেষজন বলল, শ্রেষ্ঠ জনকে নিয়ে চল। এ রাতে এটুকুই হলো এবং নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ও তাদেরকে আর দেখেন নাই। অতঃপর আর এক রাতে তাঁরা আসলেন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর অন্তর তা দেখতে পাচ্ছিল। যেহেতু নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর চোখ ঘুমাত কিন্তু তাঁর অন্তর কখনও ঘুমাত না। এভাবে সকল আম্বিয়ায়ে কেরামের চোখ ঘুমাত কিন্তু অন্তর ঘুমাত না। অতঃপর জিব্রাঈল (আঃ) দায়িত্ব গ্রহণ করলেন এবং নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে নিয়ে আকাশের দিকে চড়তে লাগলেন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 132000,
        "last_updated": null
    },
    {
        "banglaURN": 6035710,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3571,
        "hadithSanad": "",
        "hadithText": "‘ইমরান ইব্ন হুসাইন (রাঃ) থেকে বর্ণিতঃ এক সফরে তাঁরা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর সঙ্গে ছিলেন। সারা রাত পথ চলার পর যখন ভোর কাছাকাছি হল, তখন বিশ্রাম নেয়ার জন্য থেমে গেলেন এবং গভীর ঘুমে ঘুমিয়ে পড়লেন। অবশেষে সূর্য উদিত হয়ে অনেক উপরে উঠে গেল, [ইমরান (রাঃ) বলেন] যিনি সর্বপ্রথম ঘুম হতে জাগলেন তিনি হলেন আবূ বকর (রাঃ)। আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) নিজে জাগ্রত না হলে তাঁকে জাগানো হত না। অতঃপর ‘উমর (রাঃ) জাগলেন। আবূ বকর (রাঃ) তাঁর শিয়রের নিকট গিয়ে বসে উচ্চৈঃস্বরে ‘আল্লাহু আকবার’ বলতে লাগলেন। শেষে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) জেগে উঠলেন এবং অন্যত্র চলে গিয়ে অবতরণ করে আমাদেরকে নিয়ে ফজরের সালাত আদায় করলেন। তখন এক ব্যক্তি আমাদের সাথে সালাত আদায় না করে দূরে দাঁড়িয়ে থাকল। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সালাত শেষ করে বললেন, হে অমুক! আমাদের সঙ্গে সালাত আদায় করতে কিসে বাধা দিল? লোকটি বলল, আমি অপবিত্র হয়েছি। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাকে পাক মাটি দ্বারা তায়াম্মুম করার নির্দেশ দিলেন, অতঃপর সে সালাত আদায় করল। (ইমরান (রাঃ) বলেন) নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাকে অগ্রবর্তী দলের সঙ্গে পাঠিয়ে দিলেন এবং আমরা ভীষণ তৃষ্ণার্ত হয়ে পড়লাম। এই অবস্থায় আমরা পথ চলছি। হঠাৎ উষ্ট্রে আরোহী এক মহিলা আমাদের নজরে পড়ল। সে পানি ভর্তি দু‘টি মশকের মাঝখানে পা ঝুলিয়ে বসে ছিল। আমরা তাকে জিজ্ঞেস করলাম, পানি কোথায়? সে বলল (আশেপাশে) কোথাও পানি নেই। আমরা বললাম, তোমার ও পানির জায়গার মধ্যে দূরত্ব কতটুকু? সে বলল একদিন ও এক রাতের দূরত্ব। আমরা তাকে বললাম, আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর নিকট চল। সে বলল, আল্লাহ্‌র রাসূল কী? আমরা তাকে যেতে না দিয়ে তাকে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর নিকট নিয়ে গেলাম। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর কাছে এসেও ঐ রকম কথাই বলল যা সে আমাদের সঙ্গে বলেছিল। তবে সে তাঁর নিকট বলল, সে কয়েকজন ইয়াতীম সন্তানের মা। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তার মশক দু‘টি নামিয়ে ফেলতে আদেশ করলেন। অতঃপর তিনি মশক দু‘টির মুখে হাত বুলালেন। আমরা তৃষ্ণার্ত চল্লিশ জন মানুষ পানি পান করে পিপাসা মিটালাম। অতঃপর আমাদের সকল মশক, বাসনপত্র পানি ভর্তি করে নিলাম। তবে উটগুলোকে পানি পান করান হয়নি। এত সবের পরও মহিলার মশকগুলো এত পানি ভর্তি ছিল যে তা ফেটে যাবার উপক্রম হয়ে গিয়েছিল। অতঃপর নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, তোমাদের নিকট যা কিছু আছে উপস্থিত কর। কিছু খেজুর ও রুটির টুকরা জমা করে তাঁকে দেয়া হল। এ নিয়ে নারীটি খুশীর সঙ্গে তার গৃহে ফিরে গেল। গৃহে গিয়ে সকলের নিকট সে বলল, আমার সাক্ষাৎ হয়েছিল, এক মহা যাদুকরের সঙ্গে অথবা মানুষ যাকে নবী বলে ধারণা করে তার সঙ্গে। আল্লাহ্ এই মহিলার মাধ্যমে এ বস্তিবাসীকে হিদায়াত দান করলেন। স্ত্রীলোকটি নিজেও ইসলাম গ্রহণ করল এবং বস্তিবাসী সকলেই ইসলাম গ্রহণ করল।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 132010,
        "last_updated": null
    },
    {
        "banglaURN": 6035720,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3572,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর নিকট একটি পানির পাত্র আনা হল, তখন তিনি যাওরা নামক স্থানে অবস্থান করছিলেন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁর হাত ঐ পাত্রে রেখে দিলেন আর তখনই পানি অঙ্গুলির ফাঁক দিয়ে উপচে পড়তে লাগল। ঐ পানি দিয়ে উপস্থিত সকলেই উযূ করে নিলেন। ক্বাতাদাহ (রহঃ) বলেন, আমি আনাস (রাঃ) -কে জিজ্ঞেস করলাম, আপনারা কতজন ছিলেন? তিনি বললেন, আমরা তিনশ’ কিংবা প্রায় তিনশ’ জন ছিলাম।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 132020,
        "last_updated": null
    },
    {
        "banglaURN": 6035730,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3573,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে দেখতে পেলাম যখন ‘আসরের সালাতের সময় সন্নিকট। সকলেই পেরেশান হয়ে পানি খুঁজছেন কিন্তু পানি পাওয়া যাচ্ছিল না। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর নিকট উযূর পানি আনা হল। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সে পাত্রে তাঁর হাত রেখে দিলেন এবং সকলকে ঐ পাত্রের পানি দ্বারা উযূ করতে নির্দেশ দিলেন। আমি দেখলাম তাঁর হাতের নীচ হতে পানি সজোরে উথ্লে পড়ছিল। তাদের শেষ ব্যক্তিটি পর্যন্ত সকলেই এই পানি দিয়ে উযূ করলেন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 132030,
        "last_updated": null
    },
    {
        "banglaURN": 6035740,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3574,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) কোন এক সফরে বেরিয়ে ছিলেন। তাঁর সঙ্গে সাহাবাগণও ছিলেন। তারা চলতে লাগলেন, তখন সালাতের সময় হয়ে গেল, কিন্তু উযূ করার জন্য কোথাও পানি পাওয়া গেল না। কাফেলার এক ব্যক্তি সামান্য পানিসহ একটি পেয়ালা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর নিকট উপস্থিত করলেন। তিনি পেয়ালাটি হাতে নিয়ে তারই পানি দ্বারা উযূ করলেন এবং তাঁর হাতের চারটি আঙ্গুল পেয়ালার মধ্যে সোজা করে ধরে রাখলেন। আর বললেন, উঠ তোমরা উযূ কর। সকলেই ইচ্ছামত উযূ করে নিলেন। তারা ছিলেন সত্তর বা এর কাছাকাছি।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 132040,
        "last_updated": null
    },
    {
        "banglaURN": 6035750,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3575,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, সালাতের সময় উপস্থিত হল। যাদের বাড়ি মসজিদের নিকটে ছিল তারা উযূ করার জন্য নিজ নিজ বাড়িতে চলে গেলেন। কিন্তু কিছু সংখ্যক লোক গেলেন না। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর সামনে পাথরের তৈরি একটি পাত্র আনা হল। এতে সামান্য পানি ছিল। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ঐ পাত্রে তাঁর হাত রাখলেন। কিন্তু পাত্রটি ছোট্ট হওয়ার কারণে হাতের আঙ্গুলগুলো বিস্তৃত করতে পারলেন না বরং একত্রিত করে রেখে দিলেন। অতঃপর উপস্থিত লোকেরা ঐ পানি দ্বারাই উযূ করে নিল। হুমাইদ (রহঃ) বলেন, আমি আনাস (রাঃ) -কে জিজ্ঞেস করলাম আপনারা কতজন ছিলেন? বললেন, আশি জন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 132050,
        "last_updated": null
    },
    {
        "banglaURN": 6035760,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3576,
        "hadithSanad": "",
        "hadithText": "জাবির ইব্ন ‘আবদুল্লাহ্ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, হুদাইবিয়ায় অবস্থানের সময় একদা সাহাবাগণ পিপাসায় খুব কাতর হয়ে পড়লেন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর সামনে একটি পাত্রে অল্প পানি ছিল। তিনি উযূ করলেন। তাঁর নিকট পানি আছে ধারণা করে সকলে সেদিকে গেলেন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, তোমাদের কী হয়েছে? তাঁরা বললেন, আপনার সামনের পাত্রের সামান্য পানি ছাড়া উযূ ও পান করার মত পানি আমাদের নিকট নাই। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ঐ পাত্রে তাঁর হাত রাখলেন। তখনই তাঁর হাত উপচে ঝর্ণা ধারার মত পানি ছুটে বের হতে লাগলো। আমরা সকলেই পানি পান করলাম ও উযূ করলাম। সারিম (একজন রাবী) বলেন, আমি জাবির (রাঃ) -কে জিজ্ঞেস করলাম, আপনারা কতজন ছিলেন? তিনি বললেন, আমরা যদি এক লক্ষও হতাম তবুও আমাদের জন্য পানি যথেষ্ট হত। আমরা ছিলাম পনেরশ।’</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 132060,
        "last_updated": null
    },
    {
        "banglaURN": 6035770,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3577,
        "hadithSanad": "",
        "hadithText": "বারা’আ (ইবনু ‘আযিব) (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর সঙ্গে হুদাইবিয়ায় চৌদ্দশ’ লোক ছিলাম। হুদাইবিয়াহ একটি কূপ, আমরা তা থেকে পানি এমন ভাবে উঠিয়ে নিলাম যে তাতে এক ফোঁটা পানিও অবশিষ্ট থাকল না। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) কূপের কিনারায় বসে কিছু পানি আনার আদেশ করলেন। তিনি কুলি করে ঐ পানি কূপে নিক্ষেপ করলেন। অল্প সময় অপেক্ষা করলাম। তখন কূপটি পানিতে পূর্ণ হয়ে গেল। আমরা পানি পান করে তৃপ্তি লাভ করলাম, আমাদের উটগুলোও পানি পান করে পরিতৃপ্ত হল। অথবা বলেছেন আমাদের উটগুলো পানি পান করে ফিরল।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 132070,
        "last_updated": null
    },
    {
        "banglaURN": 6035780,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3578,
        "hadithSanad": "",
        "hadithText": "আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আবূ ত্বলহা (রাঃ) উম্মু সুলায়মকে বললেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর কণ্ঠস্বর দুর্বল শুনেছি। আমি তাঁর মধ্যে ক্ষুধা বুঝতে পেরেছি। তোমার নিকট খাবার কিছু আছে কি? তিনি বললেন, হাঁ আছে। এই বলে তিনি কয়েকটা যবের রুটি বের করলেন। অতঃপর তাঁর একখানা ওড়না বের করে কিয়দংশ দিয়ে রুটিগুলো মুড়ে আমার হাতে গোপন করে রেখে দিলেন ও ওড়নার অপর অংশ আমার শরীরে জড়িয়ে দিলেন এবং আমাকে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর নিকট পাঠালেন। রাবী আনাস বলেন, আমি তাঁর নিকট গেলাম। ঐ সময় তিনি কতক লোকসহ মসজিদে ছিলেন। আমি গিয়ে তাঁদের সামনে দাঁড়ালাম। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাকে দেখে বললেন, তোমাকে আবূ ত্বলহা পাঠিয়েছে? আমি বললাম, জি, হাঁ। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, খাওয়ার দাও’আত দিয়ে পাঠিয়েছে? আমি বললাম, জি- হাঁ। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সঙ্গীদেরকে বললেন, চল, আবূ ত্বলহা আমাকে দাও’আত করেছে। আমি তাঁদের আগেই চলে গিয়ে আবূ ত্বলহা (রাঃ) -কে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর আগমনের কথা শুনালাম। এতদশ্রবণে আবূ ত্বলহা (রাঃ) বলেন, হে উম্মু সুলায়ম! নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁর সঙ্গী সাথীদেরকে নিয়ে আসছেন। তাঁদেরকে খাওয়ানোর মত কিছু আমাদের নিকট নেই। উম্মু সুলায়ম (রাঃ) বললেন, আল্লাহ্ ও তাঁর রাসূলই ভালো জানেন। আবূ ত্বলহা (রাঃ) তাঁদেরকে স্বাগত জানানোর জন্য বাড়ি হতে কিছুদূর এগুলেন এবং নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর সঙ্গে দেখা করলেন এবং নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আবূ ত্বলহা (রাঃ) -কে সঙ্গে নিয়ে তার ঘরে আসলেন, আর বললেন, হে উম্মু সুলায়ম! তোমার নিকট যা কিছু আছে নিয়ে এসো। তিনি যবের ঐ রুটিগুলি হাজির করলেন এবং তাঁর নির্দেশে রুটিগুলো টুকরা টুকরা করা হল। উম্মু সুলায়ম ঘিয়ের পাত্র ঝেড়ে কিছু ঘি বের করে তরকারী হিসেবে উপস্থিত করলেন। অতঃপর নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) পাঠ করে তাতে ফুঁ দিলেন অতঃপর দশজনকে নিয়ে আসতে বললেন। তাঁরা দশজন আসলেন এবং রুটি খেয়ে তৃপ্ত হয়ে চলে গেলেন। অতঃপর আরো দশজনকে আসতে বলা হল। তারা আসলেন এবং তৃপ্তি সহকারে রুটি খেয়ে চলে গেলেন। আবার আরো দশজনকে আসতে বলা হল। তাঁরাও আসলেন এবং পেট পুরে খেয়ে নিলেন। ঐভাবে উপস্থিত সকলেই রুটি খেয়ে তৃপ্ত হলেন। সর্বমোট সত্তর বা আশিজন লোক ছিলেন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 132080,
        "last_updated": null
    },
    {
        "banglaURN": 6035790,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3579,
        "hadithSanad": "",
        "hadithText": "আবদুল্লাহ্ ইবনু মাস’উদ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা নিদর্শনাবলীকে বরকতময় মনে করতাম আর তোমরা ঐসব ঘটনাকে ভীতিকর মনে কর। আমরা আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর সঙ্গে কোন এক সফরে ছিলাম। আমাদের পানি কমে আসলো। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, অতিরিক্ত পানি খোঁজ কর। (খুঁজে) সাহাবীগণ একটি পাত্র নিয়ে আসলেন যার ভিতর সামান্য পানি ছিল। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁর হাত ঐ পাত্রের ভিতর ঢুকিয়ে দিলেন এবং ঘোষণা করলেন, বরকতময় পানি নিতে সকলেই এসো। এ বরকত আল্লাহ্ তা’আলার পক্ষ হতে দেয়া হয়েছে। তখন আমি দেখতে পেলাম আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর আঙ্গুলের ফাঁক দিয়ে পানি উপচে পড়ছে। কখনও আমরা খাবারের তাসবীহ পাঠ শুনতাম আর তা খাওয়া হত।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 132090,
        "last_updated": null
    },
    {
        "banglaURN": 6035800,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3580,
        "hadithSanad": "",
        "hadithText": "জাবির (রাঃ) থেকে বর্ণিতঃ তাঁর পিতা (‘আবদুল্লাহ্ (রাঃ) উহুদ যুদ্ধে) ঋণ রেখে শাহাদাত লাভ করেন। তখন আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর নিকট উপস্থিত হয়ে বললাম, আমার পিতা অনেক ঋণ রেখে গেছেন। আমার কাছে বাগানের কিছু খেজুর ছাড়া অন্য কোন মাল নেই। কয়েক বছরের খেজুর একত্র করলেও তাঁর ঋণ শোধ হবে না। আপনি দয়া করে আমার সঙ্গে চলুন, যাতে পাওনাদার আমার প্রতি কঠোর মনোভাব গ্রহণ না করে। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁর সঙ্গে গেলেন এবং খেজুরের একটি স্তূপের চারপাশে ঘুরে দু’আ করলেন। অতঃপর অন্য স্তূপের নিকটে গেলেন এবং এর উপরে বসলেন এবং জাবির (রাঃ) -কে বললেন, খেজুর বের করে দিতে থাক। সকল পাওনাদারের প্রাপ্য শোধ হয়ে গেল আর তাদের যত দিলেন তত থেকে গেল।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 132100,
        "last_updated": null
    },
    {
        "banglaURN": 6035810,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3581,
        "hadithSanad": "",
        "hadithText": "‘আবদুর রাহমান ইবনু আবূ বকর (রাঃ) থেকে বর্ণিতঃ আসহাবে সুফফায় কতক অসহায় গরীব লোক ছিলেন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) একবার বললেন, যার ঘরে দু’জনের খাবার আছে সে যেন এদের মধ্য হতে তৃতীয় একজন নিয়ে যায়। আর যার ঘরে চার জনের খাবার রয়েছে সে এদের মধ্য হতে পঞ্চম একজন বা ষষ্ঠ একজনকে নিয়ে যায় অথবা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যা বলেছেন। আবূ বকর (রাঃ) তিনজন নিলেন। আর নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) নিয়ে গেলেন দশজন এবং আবূ বকর (রাঃ) তিনজন। ‘আবদুর রহমান (রাঃ) বলেন, আমি, আমার আব্বা ও আম্মা। আবূ উসমান (রাঃ) রাবী বলেন, আমার মনে নাই ‘আবদুর রাহমান (রাঃ) কি এও বলেছিলেন যে, আমার স্ত্রী ও আমাদের পিতা-পুত্রের একজন গৃহভৃত্যও ছিল। আবূ বকর (রাঃ) ঐ রাতে নবীজীর বাড়িতেই খেয়ে নিলেন এবং ইশার সালাত পর্যন্ত সেখানেই অবস্থান করলেন। ইশার সালাতের পর পুনরায় তিনি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর গৃহে গমন করলেন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর রাতের খাবার খাওয়া শেষ না হওয়া পর্যন্ত সেখানেই অবস্থান করলেন। অনেক রাতের পর বাড়ী ফিরলেন। তখন তাঁর স্ত্রী তাঁকে বললেন, মেহমান পাঠিয়ে আপনি এতক্ষণ কোথায় ছিলেন? তিনি বললেন, তাদের কি এখনো রাতের খাবার দাওনি? স্ত্রী বললেন, আপনার না আসা পর্যন্ত তারা খাবার খেতে রাযী হননি। তাদেরকে ঘরের লোকজন খাবার দিয়েছিল। কিন্তু তাদের অসম্মতির নিকট আমাদের লোকজন হার মেনেছে। ‘আবদুর রাহমান (রাঃ) বলেন, আমি তাড়াতাড়ি সরে পড়লাম। আবূ বকর (রাঃ) বললেন, ওরে বেওকুফ! আহম্মক! আরো কিছু কড়া কথা বলে ফেললেন। অতঃপর মেহমান পক্ষকে সম্বোধন করে বললেন, আপনারা খেয়ে নিন। আমি কিছুতেই খাব না। ‘আবদুর রহমান (রাঃ) বলেন, আল্লাহ্‌র কসম, আমরা যখন গ্রাস তুলে নেই তখন দেখি পাত্রের খাবার অনেক বেড়ে যায়। খাওয়ার শেষে আবূ বকর (রাঃ) দেখলেন তৃপ্ত হয়ে আহারের পরেও পাত্রে খাবার আগের চেয়ে বেশি রয়ে গেছে। তখন স্ত্রীকে বললেন, হে বনী ফিরাস গোত্রের বোন! ব্যাপার কি? তিনি বললেন, হে আমার নয়নমণি! খাদ্যের পরিমাণ এখন তিনগুনের চেয়েও অধিক রয়েছে। আবূ বকর (রাঃ) তা হতে কয়েক লোকমা খেলেন এবং বললেন, আমার কসম শয়তানের প্ররোচনায় ছিল। অতঃপর অবশিষ্ট খাদ্য নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর নিকট নিয়ে গেলেন এবং ভোর পর্যন্ত ঐ খাদ্য নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর হিফাযতে রইল। রাবী বলেন, আমাদের ও অন্য একটি গোত্রের মধ্যে সন্ধি ছিল। চুক্তির মেয়াদ শেষ হয়ে যাওয়াতে তাদের মোকাবেলা করার জন্য আমাদের বার জনকে নেতা বানানো হল। প্রত্যেক নেতার অধীনে আবার কয়েকজন করে লোক ছিল। আল্লাহ্ই ভাল জানেন তাদের প্রত্যেকের সঙ্গে কতজন করে দেয়া হয়েছিল! ‘আবদুর রহমান (রাঃ) বলেন, এদের সকলেই এ খাবার হতে খেয়ে নিলেন। অথবা তিনি যেমন বলেছেন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 132110,
        "last_updated": null
    },
    {
        "banglaURN": 6035820,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3582,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর যুগে একবার মদীনাবাসী অনাবৃষ্টির কারণে দুর্ভিক্ষে নিপতিত হল। এ সময় কোন এক জুমু’আর দিনে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) খুতবা দিয়েছিলেন, তখন এক লোক উঠে দাঁড়াল এবং বলল, হে আল্লাহ্‌র রাসূল! ঘোড়াগুলো নষ্ট হয়ে গেল, বকরীগুলো ধ্বংস হয়ে গেল। আল্লাহ্‌র দরবারে বৃষ্টির জন্য দু’আ করুন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তৎক্ষণাৎ দু’হাত উঠিয়ে দু’আ করলেন। আনাস (রাঃ) বলেন, তখন আকাশ কাঁচের মত নির্মল ছিল। হঠাৎ মেঘ সৃষ্টিকারী বাতাস শুরু হল এবং মেঘ ঘনীভূত হয়ে গেল। অতঃপর শুরু হল প্রবল বৃষ্টিপাত যেন আকাশ তার দরজা খুলে দিল। আমরা পানি ভেঙ্গে বাড়ী পৌঁছলাম। পরবর্তী শুক্রবার পর্যন্ত অনবরত বৃষ্টিপাত হল। ঐ শুক্রবারে জুমু’আর সময় ঐ ব্যক্তি বা অন্য কেউ দাঁড়িয়ে বলল, হে আল্লাহ্‌র রাসূল! গৃহগুলো ধ্বংস হয়ে গেল। বৃষ্টি বন্ধের জন্য আল্লাহ্‌র দরবারে দু’আ করুন। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) মুচকি হাসলেন এবং বললেন, আমাদের আশে পাশে বৃষ্টি হোক। আমাদের উপর নয়। [আনাস (রাঃ) বলেন,] তখন আমি দেখলাম, মদীনা আকাশ হতে মেঘরাশি চারিদিকে সরে গেছে আর মদীনাকে মুকুটের মত মনে হচ্ছে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 132120,
        "last_updated": null
    },
    {
        "banglaURN": 6035830,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3583,
        "hadithSanad": "",
        "hadithText": "ইবনু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন যে, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) খেজুরের একটি কাণ্ডের সঙ্গে খুতবা প্রদান করতেন। যখন মিম্বার তৈরি করে দেয়া হল। তখন তিনি মিম্বরে উঠে খুতবা দিতে লাগলেন। কাণ্ডটি তখন কাঁদতে শুরু করল। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) কাণ্ডটির নিকটে গিয়ে হাত বুলাতে লাগলেন। উপরোক্ত হাদীসটি ‘আবদুল হামীদ ও আবূ ‘আসিম (রহঃ)...ইবনু ‘উমর (রাঃ) সূত্রে... নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে একইভাবে বর্ণনা করেছেন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 132131,
        "last_updated": null
    },
    {
        "banglaURN": 6035840,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3584,
        "hadithSanad": "",
        "hadithText": "জাবির ইব্ন ‘আবদুল্লাহ (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) একটি বৃক্ষের উপর কিংবা একটি খেজুর বৃক্ষের কাণ্ডের উপর শুক্রবারে খুতবা দেয়ার জন্য দাঁড়াতেন। এমতাবস্থায় একজন আনসারী মহিলা অথবা পুরুষ বলল, হে আল্লাহ্‌র রাসূল! আপনার জন্য একটি মিম্বার বানিয়ে দিব? নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, তোমাদের ইচ্ছে হলে দিতে পার। অতঃপর তারা একটি কাঠের মিম্বার বানিয়ে দিলেন। যখন শুক্রবার এল নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) মিম্বারে বসলেন, তখন কাণ্ডটি শিশুর মত চিৎকার করে কাঁদতে লাগল। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) মিম্বার হতে নেমে এসে ওটাকে জড়িয়ে ধরলেন। কিন্তু কাণ্ডটি শিশুর মত আরো ফুঁপিয়ে ফুঁপিয়ে কাঁদতে লাগল। রাবী বলেন, কাণ্ডটি এজন্য কাঁদছিল যেহেতু সে খুতবাকালে যিকর শুনতে পেত।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 132150,
        "last_updated": null
    },
    {
        "banglaURN": 6035850,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3585,
        "hadithSanad": "",
        "hadithText": "জাবির ইবনু ‘আবদুল্লাহ (রাঃ) থেকে বর্ণিতঃ প্রথন দিকে খেজুরের কয়েকটি কাণ্ডের উপর মসজিদে নববীর ছাদ করা হয়েছিল। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যখনই খুতবা দানের ইচ্ছা করতেন, তখন একটি কাণ্ডে হেলান দিয়ে দাঁড়াতেন। অতঃপর তাঁর জন্য মিম্বার তৈরি করে দেয়া হলে তিনি সেই মিম্বারে উঠে দাঁড়াতেন। ঐ সময় আমরা কাণ্ডটি হতে দশ মাসের গর্ভবতী উষ্ট্রীর স্বরের মত কান্নার আওয়াজ শুনলাম। শেষে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তার কাছে এসে তাকে হাত বুলিয়ে সোহাগ করলেন। অতঃপর কাণ্ডটি শান্ত হল।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 132160,
        "last_updated": null
    },
    {
        "banglaURN": 6035860,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3586,
        "hadithSanad": "",
        "hadithText": "‘উমর ইবনুল খাত্তাব (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, তোমাদের মধ্যে কে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর ফিতনা সম্বন্ধীয় হাদীস স্মরণ রেখেছ যেমনভাবে তিনি বর্ণনা করেছেন। হুযাইফাহ (রাঃ) বললেন, আমিই সর্বাধিক মনে রেখেছি। ‘উমর (রাঃ) বললেন, বর্ণনা কর, তুমি তো অত্যন্ত সাহসী ব্যক্তি। হুযাইফাহ (রাঃ) বললেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, মানুষের পরিবার-পরিজন, ধন-সম্পদ, এবং প্রতিবেশী দ্বারা সৃষ্ট ফিতনা-ফাসাদের ক্ষতিপূরণ হয়ে যাবে সালাত, সাদকা এবং সৎ কাজের আদেশ ও অসৎ কাজের নিষেধ করার দ্বারা। ‘উমর (রাঃ) বললেন, আমি এ ধরনের ফিতনা সম্পর্কে জিজ্ঞেস করিনি বরং উদ্বেলিত সমুদ্রের ঢেউয়ের মত ভীষণ আঘাত হানে ঐ ধরনের ফিতনা সম্পর্কে জিজ্ঞেস করেছি। হুযাইফাহ (রাঃ) বলেন, হে আমীরুল মু’মিনীন! এ ধরনের ফিতনা সম্পর্কে আপনার শঙ্কিত হবার কোন কারণ নেই। আপনার এবং এ জাতীয় ফিতনার মধ্যে একটি সুদৃঢ় কপাট বন্ধ অবস্থায় রয়েছে। ‘উমর (রাঃ) জিজ্ঞেস করলেন, এ কপাটটি কি খোলা হবে, না ভেঙ্গে ফেলা হবে? হুযাইফাহ (রাঃ) বলেন, ভেঙ্গে ফেলা হবে। ‘উমর (রাঃ) বললেন, তা হলে এ কপাটটি আর সহজে বন্ধ করা যাবে না। আমরা হুযাইফাহকে জিজ্ঞেস করলাম, ‘উমর (রাঃ) কি জানতেন, ঐ কপাট দ্বারা কাকে বুঝানো হয়েছে? তিনি বললেন, অবশ্যই; যেমন নিশ্চিতভাবে জানতেন আগামী দিনের পূর্বে আজ রাতের আগমন অনিবার্য। আমি তাঁকে এমন একটি হাদীস শুনিয়েছি, যাতে ভুল-চুকের সুযোগ নেই। আমরা হুযাইফাহকে ভয়ে জিজ্ঞেস করতে সাহস পাইনি, তাই মাসরূককে বললাম, মাসরূক (রহঃ) জিজ্ঞেস করলেন, এ বন্ধ কপাট কে? হুযাইফাহ (রাঃ) বললেন, ‘উমর (রাঃ) স্বয়ং।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 132170,
        "last_updated": null
    },
    {
        "banglaURN": 6035900,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3590,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, কিয়ামত সংঘটিত হবেনা যে পর্যন্ত তোমাদের যুদ্ধ না হবে খুয ও কিরমান নামক স্থানে (বসবাসরত) অনারব জাতিগুলোর সঙ্গে, যাদের চেহারা লালবর্ণ, চেহারা যেন পিটানো ঢাল, নাক চেপ্টা, চোখ ছোট এবং জুতা পশমের। ইয়াহইয়া ছাড়া অন্যান্য রাবীগণ ও আব্দুর রাজ্জাক (রহঃ) হতে পূর্বের হাদীস বর্ণনায় তার অনুসরণ করেছেন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 132190,
        "last_updated": null
    },
    {
        "banglaURN": 6035910,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3591,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর সাথে তিন বছর কাটিয়েছি। আমার জীবনে হাদীস মুখস্থ করার আগ্রহ এ তিন বছরের চেয়ে বেশি আর কখনো ছিল না। আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে হাত দ্বারা এভাবে ইশারা করে বলতে শুনেছি, কিয়ামতের পূর্বে তোমরা এমন এক জাতির সঙ্গে যুদ্ধ করবে যাদের জুতা হবে পশমের। এরা হবে পারস্যবাসী অথবা পাহাড়বাসী অনারব এবং একবার সুফইয়ান বলেছেন, তারা পারস্যবাসী বা পাহাড়বাসী অনারব।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 132200,
        "last_updated": null
    },
    {
        "banglaURN": 6035920,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3592,
        "hadithSanad": "",
        "hadithText": "‘আমর ইবনু তাগলিব (রাঃ) থেকে বর্ণিতঃ আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে বলতে শুনেছি, তোমরা কিয়ামতের আগে এমন এক জাতির সঙ্গে যুদ্ধ করবে যারা পশমের জুতা ব্যবহার করে এবং তোমরা এমন এক জাতির সঙ্গে লড়াই করবে যাদের মুখমণ্ডল হবে পিটানো ঢালের মত।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 132210,
        "last_updated": null
    },
    {
        "banglaURN": 6035930,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3593,
        "hadithSanad": "",
        "hadithText": "আবদুল্লাহ্ ইবনু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে বলতে শুনেছি, ইয়াহূদীরা তোমাদের সাথে যুদ্ধে লিপ্ত হবে। তখন জয়লাভ করবে তোমরাই। স্বয়ং পাথরই বলবে, হে মুসলিম, এইতো ইয়াহূদী আমার পেছনে, একে হত্যা কর।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 132220,
        "last_updated": null
    },
    {
        "banglaURN": 6035940,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3594,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, (ভবিষ্যতে) মানুষের নিকট এমন এক সময় আসবে যে, তারা জিহাদ করবে। তখন তাদেরকে বলা হবে, তোমাদের মধ্যে এমন কোন লোক আছেন কি যিনি আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর সঙ্গ লাভ করেছেন? তখন তারা বলবে, হাঁ। তখন তাদেরকে জয়ী করা হবে। অতঃপরও তারা আরো জিহাদ করবে। তখন তাদের বলা হবে, তোমাদের মধ্যে এমন কেউ আছেন কি যিনি সাহাবাদের সঙ্গ লাভ করেছেন? তখন তারা বলবে, হাঁ। তখন তাদেরকে জয়ী করা হবে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 132230,
        "last_updated": null
    },
    {
        "banglaURN": 6035960,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3596,
        "hadithSanad": "",
        "hadithText": "‘উকবাহ ইবনু ‘আমির (রাঃ) থেকে বর্ণিতঃ একদা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বের হয়ে মৃত ব্যক্তির সালাতে জানাযার মত উহুদ যুদ্ধে শহীদ সাহাবাগণের কবরের পার্শ্বে দাঁড়িয়ে সালাত আদায় করলেন। অতঃপর ফিরে এসে মিম্বারে উঠে বললেন, আমি তোমাদের জন্য অগ্রগামী ব্যক্তি, আমি তোমাদের হয়ে আল্লাহ্‌র দরবারে সাক্ষ্য দিব। আল্লাহ্‌র কসম, আমি এখানে বসে থেকেই আমার হাউযে কাওসার দেখতে পাচ্ছি। পৃথিবীর ধন-ভাণ্ডারের চাবি আমার হাতে তুলে দেয়া হয়েছে। আল্লাহ্‌র কসম! আমার মৃত্যুর পর তোমরা মুশরিক হয়ে যাবে এ আশঙ্কা আমি করি না। তবে আমি তোমাদের ব্যাপারে এ আশঙ্কা করি যে, দুনিয়ার ধন-সম্পদের মোহে তোমরা আত্নকলহে লিপ্ত হয়ে পড়বে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 132260,
        "last_updated": null
    },
    {
        "banglaURN": 6035970,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3597,
        "hadithSanad": "",
        "hadithText": "উসামাহ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) একদা মদীনায় একটি উঁচু টিলায় উঠলেন, অতঃপর বললেন, আমি যা দেখছি, তোমরা কি তা দেখতে পাচ্ছ? আমি দেখছি পানির স্রোতের মত ফাসাদ ঢুকে পড়ছে তোমাদের ঘরে ঘরে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 132270,
        "last_updated": null
    },
    {
        "banglaURN": 6035980,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3598,
        "hadithSanad": "",
        "hadithText": "যায়নাব বিনতু জাহশ (রাঃ) থেকে বর্ণিতঃ একদা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ভীত-সন্ত্রস্ত অবস্থায় ‘লা-ইলাহা ইল্লাল্লাহ’ পড়তে পড়তে তাঁর গৃহে প্রবেশ করলেন এবং বলতে লাগলেন, শীঘ্রই একটি দাঙ্গা-হাঙ্গামা সৃষ্টি হবে। এতে আরবের ধ্বংস অবশ্যম্ভাবী। ইয়াজুজ ও মাজুজের দেয়ালে এতটুকু পরিমাণ ছিদ্র হয়ে গিয়েছে, একথা বলে দু’টি আঙ্গুল গোলাকার করে দেখালেন। যায়নাব (রাঃ) বলেন, আমি জিজ্ঞেস করলাম, “হে আল্লাহ্‌র রাসূল! আমরা কি ধ্বংস হয়ে যাব, অথচ আমাদের মধ্যে বহু নেক ব্যক্তি আছেন?” নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, হ্যাঁ, যখন অশ্লীলতা বেড়ে যাবে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 132280,
        "last_updated": null
    },
    {
        "banglaURN": 6035990,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3599,
        "hadithSanad": "",
        "hadithText": "উম্মু সালামা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) জেগে উঠলেন এবং বলতে লাগলেন, সুবাহানাল্লাহ, আজ কী অফুরন্ত ধনভাণ্ডার অবতীর্ণ করা হয়েছে এবং তারই সঙ্গে অগণিত ফিতনা-ফাসাদ নাযিল করা হয়েছে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 132290,
        "last_updated": null
    },
    {
        "banglaURN": 6036000,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3600,
        "hadithSanad": "",
        "hadithText": "আবূ সা‘ঈদ খুদরী (রাঃ) থেকে বর্ণিতঃ তিনি আবূ সা‘সা‘আহকে বললেন, তোমাকে দেখছি তুমি বকরীকে অত্যন্ত ভালবেসে এদেরকে সর্বদা লালন-পালন কর, তাই, তুমি এদের যত্ন কর এবং রোগ-ব্যাধিতে আক্রান্ত হলে চিকিৎসা কর। আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে বলতে শুনেছি, এমন এক সময় আসবে, যখন বকরীই হবে মুসলিমের উত্তম সম্পদ। তাকে নিয়ে পাহাড়ের চূড়ায় বৃষ্টি বর্ষণের স্থানে চলে যাবে এবং তাঁদের দীনকে ফিতনা থেকে রক্ষা করবে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 132300,
        "last_updated": null
    },
    {
        "banglaURN": 6036030,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3603,
        "hadithSanad": "",
        "hadithText": "ইব্ন মাস‘ঊদ (রাঃ) সূত্রে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেন, শীঘ্রই স্বজনপ্রীতির বিস্তৃতি ঘটবে এবং এমন ব্যাপার ঘটবে যা তোমরা পছন্দ করতে পারবে না। সাহাবাগণ বললেন, হে আল্লাহ্‌র রাসূল! ঐ অবস্থায় আমাদের কী করতে বলেন? নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, তোমাদের উপর অর্পিত দায়িত্ব পালন করবে আর তোমাদের প্রাপ্য আল্লাহ্‌র কাছে চাইবে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 132330,
        "last_updated": null
    },
    {
        "banglaURN": 6036040,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3604,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, কুরাইশ গোত্রের এ লোকগুলি (যুবকগণ) মানুষের ধ্বংস ডেকে আনবে। সাহাবাগণ বললেন, তখন আমাদেরকে আপনি কী করতে বলেন? তিনি বললেন, মানুষেরা যদি এদের সংসর্গ ত্যাগ করত তবে ভালই হত।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 132340,
        "last_updated": null
    },
    {
        "banglaURN": 6036050,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3605,
        "hadithSanad": "",
        "hadithText": "আহমদ ইব্ন মুহাম্মাদ মাক্কী (রহঃ).... সাঈদ উমাব্বী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, একদা আমি আবূ হুরায়রা (রাঃ) এবং মারওয়ান (রাঃ) -এর নিকট ছিলাম। আবূ হুরায়রা (রাঃ) বলতে লাগলেন, আমি সত্যবাদী ও বিশ্বস্ত নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে বলতে শুনেছি, আমার উম্মাতের ধ্বংস কুরাইশের কতকগুলি অল্প বয়স্ক যুবকের হাতে এবং মারওয়ান বললেন, অল্প বয়স্ক ছেলেদের হাতে। আবূ হুরায়রা (রাঃ) বলেন, তুমি শুনতে চাইলে তাদের নামও বলতে পারি, অমুকের ছেলে অমুক, অমুকের ছেলে অমুক।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 132350,
        "last_updated": null
    },
    {
        "banglaURN": 6036060,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3606,
        "hadithSanad": "",
        "hadithText": "হুযাইফাহ ইব্ন ইয়ামান (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, লোকজন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে কল্যাণ সম্পর্কে জিজ্ঞেস করতেন আর আমি তাঁকে অকল্যাণ সম্পর্কে জিজ্ঞেস করতাম; এই ভয়ে যেন আমি ঐ সবের মধ্যে পড়ে না যাই। আমি বললাম, হে আল্লাহ্‌র রাসূল! আমরা জাহিলীয়্যাতে অকল্যাণকর অবস্থায় জীবন যাপন করতাম অতঃপর আল্লাহ্ আমাদের এ কল্যাণ দান করেছেন। এ কল্যাণকর অবস্থার পর আবার কোন অকল্যাণের আশঙ্কা আছে কি? তিনি বললেন, হ্যাঁ, আছে। আমি জিজ্ঞেস করলাম, ঐ অকল্যাণের পর কোন কল্যাণ আছে কি? তিনি বললেন, হ্যাঁ, আছে। তবে তা মন্দ মেশানো। আমি বললাম, মন্দ মেশানো কি? তিনি বললেন, এমন একদল লোক যারা আমার সুন্নাত ত্যাগ করে অন্যপথে পরিচালিত হবে। তাদের কাজে ভাল-মন্দ সবই থাকবে। আমি আবার জিজ্ঞেস করলাম, অতঃপর কি আরো অকল্যাণ আছে? তিনি বললেন, হ্যাঁ, তখন জাহান্নামের দিকে আহবানকারীদের উদ্ভব ঘটবে। যারা তাদের ডাকে সাড়া দিবে তাকেই তারা জাহান্নামে নিক্ষেপ করবে। আমি বললেন, হে আল্লাহ্‌র রাসূল! এদের পরিচয় বর্ণনা করুন। তিনি বললেন, তারা আমাদেরই সম্প্রদায়ভুক্ত এবং কথা বলবে আমাদেরই ভাষায়। আমি বললাম, আমি যদি এ অবস্থায় পড়ে যাই তাহলে আপনি আমাকে কি করতে আদেশ দেন? তিনি বললেন, মুসলিমদের দল ও তাঁদের ইমামকে আঁকড়ে ধরবে। আমি বললাম, যদি মুসলিমদের এহেন দল ও ইমাম না থাকে? তিনি বলেন, তখন তুমি তাদের সকল দল উপদলের সঙ্গে সম্পর্কচ্ছেদ করবে এবং মৃত্যু না আসা পর্যন্ত বৃক্ষমূল দাঁতে আঁকড়ে ধরে হলেও তোমার দ্বীনের উপর থাকবে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 113,
        "matchingArabicURN": 132360,
        "last_updated": null
    },
    {
        "banglaURN": 6036070,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3607,
        "hadithSanad": "",
        "hadithText": "হুযাইফাহ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমার সঙ্গীরা কল্যাণ বিষয়ে জানতে চেয়েছেন আর আমি জানতে চেয়েছি অকল্যাণ সম্পর্কে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 114,
        "matchingArabicURN": 132370,
        "last_updated": null
    },
    {
        "banglaURN": 6036080,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3608,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, কিয়ামত হবে না যে পর্যন্ত এমন দু’টি দলের মধ্যে যুদ্ধ না হবে যাদের দাবী হবে এক।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 115,
        "matchingArabicURN": 132380,
        "last_updated": null
    },
    {
        "banglaURN": 6036090,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3609,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, কিয়ামত সংঘটিত হবে না যে পর্যন্ত দু’টি দলের মধ্যে যুদ্ধ না হবে। তাদের মধ্যে হবে এক রক্তক্ষয়ী যুদ্ধ। তাদের দাবী হবে এক। আর কিয়ামত কায়িম হবে না যে পর্যন্ত প্রায় ত্রিশজন মিথ্যাচারী দাজ্জালের আবির্ভাব না হবে। এরা সবাই নিজেকে আল্লাহ্‌র রাসূল বলে দাবী করবে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 116,
        "matchingArabicURN": 132390,
        "last_updated": null
    },
    {
        "banglaURN": 6036100,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3610,
        "hadithSanad": "",
        "hadithText": "আবূ সা‘ঈদ খুদরী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর নিকট উপস্থিত ছিলাম। তিনি কিছু গনীমতের মাল বন্টন করছিলেন। তখন বানু তামীম গোত্রের জুলখোয়াইসিরাহ্ নামে এক ব্যক্তি এসে হাযির হল এবং বলল, হে আল্লাহ্‌র রাসূল! আপনি ইন্সাফ করুন। তিনি বললেন তোমার দুর্ভাগ্য! আমি যদি ইন্সাফ না করি, তবে ইন্সাফ করবে কে? আমি তো নিষ্ফল ও ক্ষতিগ্রস্ত হব যদি আমি ইন্সাফ না করি। ‘উমর (রাঃ) বললেন, হে আল্লাহ্‌র রাসূল! আমাকে অনুমতি দিন আমি এর গর্দান উড়িয়ে দিই। তিনি বললেন, একে ছেড়ে দাও। তার এমন কিছু সঙ্গী সাথী রয়েছে তোমারা তাদের সালাতের তুলনায় নিজের সালাত এবং সিয়াম নগণ্য বলে মনে করবে। এরা কুরআন পাঠ করে, কিন্তু কুরআন তাদের কন্ঠনালীর নিচে প্রবেশ করে না। তারা দ্বীন হতে এমনভাবে বেরিয়ে যাবে যেমন তীর ধনুক হতে বেরিয়ে যায়। তীরের অগ্রভাগের লোহা দেখা যাবে কিন্তু কোন চিহ্ন পাওয়া যাবে না। কাঠের অংশ দেখলে তাতেও কিছু পাওয়া যাবে না। মাঝের অংশ দেখলে তাতেও কিছু পাওয়া যাবে না। তার পালক দেখলে তাতেও কোন চিহ্ন পাওয়া যায় না। অথচ তীরটি শিকারী জন্তুর নাড়িভুঁড়ি ভেদ করে রক্তমাংস পার হয়ে বেরিয়ে গেছে। এদের নিদর্শন হল এমন একটি কাল মানুষ যার একটি বাহু নারীর স্তনের মত অথবা মাংস খণ্ডের মত নড়াচড়া করবে। তারা লোকদের মধ্যে বিরোধকালে আত্মপ্রকাশ করবে। \nআবূ সা‘ঈদ (রাঃ) বলেন, আমি সাক্ষ্য দিচ্ছি যে, আমি স্বয়ং আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর নিকট হতে এ কথা শুনেছি। আমি এ-ও সাক্ষ্য দিচ্ছি যে, ‘আলী ইব্‌ন আবূ তালিব (রাঃ) এদের সঙ্গে যুদ্ধ করেছেন। আমিও তার সঙ্গে ছিলাম। তখন ‘আলী (রাঃ) ঐ লোককে খুঁজে বের করতে আদেশ দিলেন। খোঁজ করে যখন আনা হল আমি মনোযোগের সঙ্গে তাকিয়ে তার মধ্যে ঐ সব চিহ্নগুলি দেখতে পেলাম, যা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছিলেন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 117,
        "matchingArabicURN": 132400,
        "last_updated": null
    },
    {
        "banglaURN": 6036110,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3611,
        "hadithSanad": "",
        "hadithText": "সুয়াইদ ইব্ন গাফালা (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, ‘আলী (রাঃ) বলেছেন, আমি যখন তোমাদের নিকট আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর কোন হাদীস বর্ণনা করি, তখন আমার এমন অবস্থা হয় যে, তাঁর উপর মিথ্যারোপ করার চেয়ে আকাশ হতে পড়ে ধ্বংস হয়ে যাওয়া আমার নিকট বেশি পছন্দনীয় এবং আমরা নিজেরা যখন আলোচনা করি তখন কথা হল এই যে, যুদ্ধ ছল-চাতুরী মাত্র। আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে বলতে শুনেছি যে, শেষ যুগে একদল যুবকের আবির্ভাব ঘটবে যারা হবে স্বল্পবুদ্ধি সম্পন্ন। তারা মুখে খুব ভাল কথা বলবে। তারা ইসলাম হতে বেরিয়ে যাবে যেভাবে তীর ধনুক হতে বেরিয়ে যায়। তাদের ঈমান গলদেশ পেরিয়ে ভেতরে প্রবেশ করবে না। যেখানেই এদের সঙ্গে তোমাদের দেখা মিলবে, এদেরকে তোমরা হত্যা করে ফেলবে। যারা তাদের হত্যা করবে তাদের এই হত্যার পুরস্কার আছে ক্বিয়ামতের দিন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 118,
        "matchingArabicURN": 132410,
        "last_updated": null
    },
    {
        "banglaURN": 6036120,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3612,
        "hadithSanad": "",
        "hadithText": "খাব্বাব ইব্ন আরত্ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর খেদমতে অভিযোগ করলাম। তখন তিনি তাঁর চাদরকে বালিশ বানিয়ে কা‘বা শরীফের ছায়ায় বিশ্রাম করছিলেন। আমরা তাঁকে বললাম, আপনি কি আমাদের জন্য সাহায্য প্রার্থনা করবেন না? আপনি কি আমাদের জন্য আল্লাহ্‌র নিকট দু’আ করবেন না? তিনি বললেন, তোমাদের আগের লোকদের অবস্থা ছিল এই, তাদের জন্য মাটিতে গর্ত খুঁড়া হত এবং ঐ গর্তে তাকে পুঁতে রেখে করাত দিয়ে তার মাথা দ্বিখণ্ডিত করা হত। এটা তাদেরকে দ্বীন হতে টলাতে পারত না। লোহার চিরুনী দিয়ে শরীরের হাড় মাংস ও শিরা-উপশিরা সব কিছু ছিন্নভিন্ন করে দিত। এটা তাদেরকে দ্বীন হতে সরাতে পারেনি। আল্লাহ্‌র কসম, আল্লাহ্ এ দীনকে অবশ্যই পূর্ণতা দান করবেন। তখন একজন উষ্ট্রারোহী সান‘আ হতে হাযারামাউত পর্যন্ত সফর করবে, আল্লাহ্ ছাড়া অন্য কাউকেও ভয় করবে না। অথবা তার মেষপালের জন্য নেকড়ে বাঘের ভয়ও করবে না। কিন্তু তোমরা তাড়াহুড়া করছ।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 119,
        "matchingArabicURN": 132420,
        "last_updated": null
    },
    {
        "banglaURN": 6036130,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3613,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্ন মালিক (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সাবিত ইব্‌ন কায়েস (রাঃ) -কে তাঁর মাজলিসে অনুপস্থিত পেলেন। তখন এক সহাবী বললেন, হে আল্লাহ্‌র রাসূল! আমি তার সম্পর্কে জানি। তিনি গিয়ে দেখেন সাবিত (রাঃ) তাঁর ঘরে অবনত মস্তকে বসে আছেন। তিনি জিজ্ঞেস করলেন, হে সাবিত! কী অবস্থা তোমার? তিনি বললেন, অত্যন্ত খারাপ। তার গলার স্বর নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর গলার স্বর হতে উচ্চ হয়েছিল। কাজেই তার সব নেক আমল নষ্ট হয়ে গেছে। সে জাহান্নামীদের অন্তর্ভুক্ত হয়ে গেছে। ঐ ব্যক্তি ফিরে এসে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে জানালেন সাবিত (রাঃ) এসব কথা বলেছে। মূসা ইব্‌ন আনাস (রহঃ) বলেন, ঐ সাহাবী এক মহা সুসংবাদ নিয়ে হাযির হলেন যে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, তুমি যাও সাবিতকে বল, নিশ্চয়ই তুমি জাহান্নামীদের অন্তর্ভুক্ত নও বরং তুমি জান্নাতীদের অন্তর্ভুক্ত।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 120,
        "matchingArabicURN": 132430,
        "last_updated": null
    },
    {
        "banglaURN": 6036140,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3614,
        "hadithSanad": "",
        "hadithText": "বার‘আ ইব্ন ‘আযিব (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, এক সাহাবী সূরা কাহ্‌ফ তিলাওয়াত করছিলেন। তাঁর বাড়িতে একটি ঘোড়া বাঁধা ছিল। ঘোড়াটি তখন লাফালাফি করতে লাগল। তখন ঐ সহাবী শান্তি ও নিরাপত্তার জন্য আল্লাহ্‌র দরবারে দু’আ করলেন। তখন তিনি দেখলেন, একখণ্ড মেঘ এসে তাকে ঢেকে দিয়েছে। তিনি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর কাছে বিষয়টি উল্লেখ করলেন। তখন তিনি বললেন, হে অমুক! তুমি এভাবে তিলাওয়াত করবে। এটা তো প্রশান্তি ছিল, যা কুরআন তিলাওয়াতের কারণে নাযিল হয়েছিল।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 121,
        "matchingArabicURN": 132440,
        "last_updated": null
    },
    {
        "banglaURN": 6036150,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3615,
        "hadithSanad": "",
        "hadithText": "বারা ইব্ন ‘আযিব (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, একদা আবূ বকর (রাঃ) আমার পিতার কাছে আমাদের বাড়িতে আসলেন। তিনি আমার পিতার কাছ হতে একটি হাওদা কিনলেন এবং আমার পিতাকে বললেন, তোমার ছেলে বারাকে আমার সঙ্গে হাওদাটি বয়ে নিয়ে যেতে বল। আমি হাওদাটি বয়ে তাঁর সঙ্গে চললাম। আমার পিতাও ওটার মূল্য নেয়ার জন্য আমাদের সঙ্গী হলেন। আমার পিতা তাঁকে বললেন, হে আবূ বক্‌র! দয়া করে আপনি আমাদেরকে বলুন, আপনারা কী করেছিলেন যে রাতে আপনি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর সাথী ছিলেন? তিনি বললেন, হ্যাঁ। অবশ্যই আমরা সারা রাত পথ চলে পরদিন দুপুর অবধি চললাম। যখন রাস্তাঘাট লোকশূন্য হয়ে পড়ল, রাস্তায় কোন মানুষের আনাগোনা ছিল না। হঠাৎ একটি লম্বা ও চওড়া পাথর আমাদের নযরে পড়লো, যার ছায়ায় সূর্যের তাপ প্রবেশ করছিল না। আমরা সেখানে গিয়ে নামলাম। আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর জন্য নিজ হাতে একটি জায়গা পরিস্কার-পরিচ্ছন্ন করে নিলাম, যাতে সেখানে তিনি ঘুমাতে পারেন। আমি ওখানে একটি চামড়ার বিছানা পেতে দিলাম এবং বললাম, হে আল্লাহ্‌র রাসূল! আপনি শুয়ে পড়ুন। আমি আপনার নিরাপত্তার জন্য পাহারায় থাকলাম। তিনি শুয়ে পড়লেন। আর আমি চারপাশের অবস্থা দেখার জন্য বেরিয়ে পড়লাম। হঠাৎ দেখতে পেলাম, একজন মেষ রাখাল তার মেষপাল নিয়ে পাথরের দিকে ছুটে আসছে। সেও আমাদের মত পাথরের ছায়ায় আশ্রয় নিতে চায়। আমি বললাম, হে যুবক! তুমি কার রাখাল? সে মদীনার কি মক্কার এক লোকের নাম বলল। আমি জিজ্ঞেস করলাম, তোমার মেষপালে কি দুধেল মেষ আছে? সে বলল, হ্যাঁ আছে। আমি বললাম, তুমি কি দুহে দিবে? সে বলল, হ্যাঁ। অতঃপর সে একটি বক্রী ধরে নিয়ে এল। আমি বললাম, এর স্তন ধূলা-বালি, পশম ও ময়লা হতে পরিস্কার করে নাও। রাবী আবূ ইসহাক (রহঃ) বলেন, আমি বারাআ (রাঃ) -কে দেখলাম এক হাত অন্য হাতের উপর রেখে ঝাড়ছেন। অতঃপর ঐ যুবক একটি কাঠের বাটিতে কিছু দুধ দোহন করল। আমার সঙ্গেও একটি চামড়ার পাত্র ছিল। আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর উযূর পানি ও পান করার পানি রাখার জন্য নিয়েছিলাম। আমি দুধ নিয়ে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর নিকট আসলাম। তাঁকে জাগানো ভাল মনে করলাম না। কিছুক্ষণ পর তিনি জেগে উঠলেন। আমি দুধ নিয়ে হাযির হলাম। আমি দুধের মধ্যে কিছু পানি ঢেলেছিলাম তাতে দুধের নিচ পর্যন্ত ঠান্ডা হয়ে গেল। আমি বললাম, হে আল্লাহ্‌র রাসূল! আপনি দুধ পান করুন। তিনি পান করলেন, আমি তাতে সন্তুষ্ট হয়ে গেলাম। অতঃপর নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, এখন কি আমাদের যাত্রা শুরুর সময় হয়নি? আমি বললাম, হ্যাঁ হয়েছে। পুনরায় শুরু হল আমাদের সফর। ততক্ষণে সূর্য পশ্চিম আকাশে ঢলে পড়েছে। সুরাকা ইব্‌ন মালিক আমাদের পিছন নিয়েছিল। আমি বললাম, হে আল্লাহ্‌র রাসূল! আমাদের অনুসরণে কে যেন আসছে। তিনি বললেন, চিন্তা করোনা, নিশ্চয়ই মহান আল্লাহ্ আমাদের সঙ্গে রয়েছেন। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁর বিরুদ্ধে দু’আ করলেন। তৎক্ষণাৎ আরোহীসহ ঘোড়া তার পেট পর্যন্ত মাটিতে দেবে গেল, শক্ত মাটিতে। রাবী যুহায়র এই শব্দটি সম্পর্কে সন্দেহ প্রকাশ করে বলেন আমার ধারণা এ রকম শব্দ বলেছিলেন। সুরাকা বলল, আমার বিশ্বাস আপনারা আমার বিরুদ্ধে দু‘আ করেছেন। আমার জন্য আপনারা দু‘আ করে দিন। আল্লাহ্‌র কসম আপনাদের খোঁজকারীদেরকে আমি ফিরিয়ে নিয়ে যাব। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তার জন্য দু‘আ করলেন। সে বেঁচে গেল। ফিরে যাবার পথে যার সঙ্গে তার দেখা হত, সে বলত আমি সব দেখে এসেছি। যাকেই পেয়েছে, ফিরিয়ে দিয়েছে। আবূ বকর (রাঃ) বলেন, সে আমাদের সঙ্গে করা অঙ্গীকার পূর্ণ করেছে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 122,
        "matchingArabicURN": 132450,
        "last_updated": null
    },
    {
        "banglaURN": 6036160,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3616,
        "hadithSanad": "",
        "hadithText": "ইব্ন ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) একদিন অসুস্থ একজন বেদুঈনকে দেখতে গেলেন। রাবী বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর অভ্যাস ছিল যে, পীড়িত ব্যক্তিকে দেখতে গেলে বলতেন, কোন দুশ্চিন্তার কারণ নেই, ইনশাআল্লাহ্ গোনাহ হতে তুমি পবিত্র হয়ে যাবে। ঐ বেদুঈনকেও তিনি বললেন। চিন্তা করো না গুনাহ হতে তুমি পবিত্র হয়ে যাবে ইনশাআল্লাহ্। বেদুঈন বলল, আপনি বলেছেন গোনাহ হতে তুমি পবিত্র হয়ে যাবে। তা নয়। বরং এতো এমন এক জ্বর যা বয়োঃবৃদ্ধের উপর প্রভাব ফেলছে। তাকে কবরের সাক্ষাৎ করাবে। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, তাই হোক।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 123,
        "matchingArabicURN": 132460,
        "last_updated": null
    },
    {
        "banglaURN": 6036170,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3617,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, এক খ্রিস্টান ব্যক্তি মুসলিম হল এবং সূরা বাকারাহ ও সূরা আল-ইমরান শিখে নিল। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর জন্য সে অহী লিখত। অতঃপর সে আবার খ্রিস্টান হয়ে গেল। সে বলতে লাগল, আমি মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে যা লিখে দিতাম তার চেয়ে বেশি কিছু তিনি জানেন না। (নাউজুবিল্লাহ) কিছুদিন পর আল্লাহ্ তাকে মৃত্যু দিলেন। খ্রিস্টানরা তাকে দাফন করল। কিন্তু পরদিন সকালে দেখা গেল, কবরের মাটি তাকে বাইরে নিক্ষেপ করে দিয়েছে। এটা দেখে খ্রিস্টানরা বলতে লাগল- এটা মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এবং তাঁর সাহাবীদেরই কাজ। যেহেতু আমাদের এ সাথী তাদের হতে পালিয়ে এসেছিল। এ জন্যই তারা আমাদের সাথীকে কবর হতে উঠিয়ে বাইরে ফেলে দিয়েছে। তাই যতদূর পারা যায় গভীর করে কবর খুঁড়ে তাকে আবার দাফন করল। কিন্তু পরদিন সকালে দেখা গেল, কবরের মাটি তাকে আবার বাইরে ফেলে দিয়েছে। এবারও তারা বলল, এটা মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ও তাঁর সাহাবীদের কাণ্ড। তাদের নিকট হতে পালিয়ে আসার কারণে তারা আমাদের সাথীকে কবর হতে উঠিয়ে বাইরে ফেলে দিয়েছে। এবার আরো গভীর করে কবর খনন করে দাফন করল। পরদিন ভোরে দেখা গেল কবরের মাটি এবারও তাকে বাইরে নিক্ষেপ করেছে। তখন তারাও বুঝল, এটা মানুষের কাজ নয়। কাজেই তারা লাশটি ফেলে রাখল।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 124,
        "matchingArabicURN": 132470,
        "last_updated": null
    },
    {
        "banglaURN": 6036180,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3618,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, যখন কিস্রা ধ্বংস হবে, অতঃপর অন্য কোন কিস্রা হবে না। যখন কায়সার ধ্বংস হবে তখন আর কোন কায়সার হবে না। ঐ সত্তার কসম, যাঁর হাতে আমার প্রাণ নিশ্চয়ই ঐ দু’এর ধন-ভাণ্ডার তোমরা আল্লাহ্‌র পথে ব্যয় করবে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 125,
        "matchingArabicURN": 132480,
        "last_updated": null
    },
    {
        "banglaURN": 6036190,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3619,
        "hadithSanad": "",
        "hadithText": "জাবির ইব্ন সামুরাহ (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, কিস্রা ধ্বংস হয়ে যাবার পর আর কোন কিস্রা হবে না এবং কায়সার ধ্বংস হয়ে যাবার পর আর কোন কায়সার হবে না। তিনি আরো বলেছেন, নিশ্চয়ই তাদের ধন-ভাণ্ডার তোমরা আল্লাহ্‌র পথে ব্যয় করবে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 126,
        "matchingArabicURN": 132490,
        "last_updated": null
    },
    {
        "banglaURN": 6036220,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3622,
        "hadithSanad": "",
        "hadithText": "আবূ মূসা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, আমি স্বপ্নে দেখতে পেলাম, আমি মক্কা হতে হিজরত করে এমন জায়গায় যাচ্ছি যেখানে বহু খেজুর গাছ রয়েছে। তখন আমার ধারণা হল, এ স্থানটি ইয়ামামা অথবা হাযর হবে। স্থানটি মদীনা ছিল। যার পূর্বনাম ইয়াস্রিব। স্বপ্নে আমি আরো দেখতে পেলাম যে আমি একটি তলোয়ার হাতে নিয়ে নাড়াচাড়া করছি। হঠাৎ তার অগ্রাংশ ভেঙ্গে গেল। উহুদ যুদ্ধে মুসলিমদের যে বিপদ ঘটেছিল এটা তা-ই। অতঃপর দ্বিতীয় বার তলোয়ারটি হাতে নিয়ে নাড়াচাড়া করলাম তখন সেটি আগের চেয়েও আরো উত্তম হয়ে গেল। এটা হল যে, আল্লাহ্ মুসলিমগণকে বিজয়ী ও একত্রিত করে দিবেন। আমি স্বপ্নে আরো দেখতে পেলাম, একটি গরু (যবহ হচ্ছে) এবং শুনতে পেলাম আল্লাহ্ যা করেন সবই ভাল। এটাই হল উহুদ যুদ্ধে মুসলিমদের শাহাদাত বরণ। আর খায়ের হল- আল্লাহ্‌র পক্ষ হতে ঐ সকল কল্যাণই কল্যাণ এবং সত্যবাদিতার পুরস্কার যা আল্লাহ্ আমাদেরকে বাদার দিবসের পর দান করেছেন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 128,
        "matchingArabicURN": 132520,
        "last_updated": null
    },
    {
        "banglaURN": 6036270,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3627,
        "hadithSanad": "",
        "hadithText": "ইব্ন ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, ‘উমর ইব্‌ন খাত্তাব (রাঃ) ইব্‌ন ‘আব্বাস (রাঃ) -কে বিশেষ মর্যাদা দান করতেন। একদা ‘আবদুর রাহমান ইব্‌ন আউফ (রাঃ) তাঁকে বললেন, তাঁর মত ছেলে আমাদেরও আছে। এতে তিনি বললেন, এর কারণ তো আপনি নিজেও জানেন। তখন ‘উমর (রাঃ) ইব্‌ন ‘আব্বাস (রাঃ) -কে ডেকে (আরবী) আয়াতের ব্যাখ্যা জিজ্ঞেস করেন। ইব্‌ন ‘আব্বাস (রাঃ) উত্তর দিলেন, এ আয়াতে আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে তাঁর মৃত্যু সন্নিকট বলে জানিয়ে দেয়া হয়েছে। ‘উমর (রাঃ) বললেন, এ আয়াতের অর্থ তুমি যা জান তা ছাড়া ভিন্ন কিছু আমি জানি না।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 131,
        "matchingArabicURN": 132570,
        "last_updated": null
    },
    {
        "banglaURN": 6036280,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3628,
        "hadithSanad": "",
        "hadithText": "ইব্ন ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) শেষ রোগে আক্রান্ত হবার পর একটি চাদর পরে মাথায় একটি কাল কাপড় দিয়ে পট্টি বেঁধে ঘর হতে বের হয়ে মিম্বরের উপর গিয়ে বসলেন। আল্লাহ্ তা’আলার হামদ ও সানা পাঠ করার পর বললেন, আম্মা বাদ। লোকসংখ্যা বৃদ্ধি পেতে থাকবে, আর আনসারদের সংখ্যা হ্রাস পেতে থাকবে। অবশেষে তাঁদের অবস্থা লোকের মাঝে যেমন খাদ্যের মধ্যে লবণের মত হবে। তখন তোমাদের মধ্যে যে ব্যক্তির মানুষের উপকার বা ক্ষতি করার ক্ষমতা থাকবে সে যেন আনসারদের ভাল কাজ গ্রহণ করে এবং তাদের ভুল-ক্রুটি ক্ষমা করে। এটাই ছিল নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর সর্বশেষ মজলিস যা তিনি করেছিলেন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 132,
        "matchingArabicURN": 132580,
        "last_updated": null
    },
    {
        "banglaURN": 6036290,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3629,
        "hadithSanad": "",
        "hadithText": "আবূ বকর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) একদা হাসান (রাঃ) -কে নিয়ে বেরিয়ে এলেন এবং তাঁকে সহ মিম্বারে আরোহণ করলেন। অতঃপর বললেন, আমার এ ছেলেটি সরদার। নিশ্চয়ই আল্লাহ্ তা’আলা এর মাধ্যমে বিবাদমান দু’দল মুসলমানের মধ্যে সমঝোতা করিয়ে দিবেন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 133,
        "matchingArabicURN": 132590,
        "last_updated": null
    },
    {
        "banglaURN": 6036300,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3630,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্ন মালিক (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) জা’ফর এবং যায়দ [ইব্‌ন হারিস (রাঃ)] -এর শাহাদাত অর্জনের সংবাদ জানিয়ে দিয়েছিলেন, তাদের উভয়ের শাহাদাত অর্জনের সংবাদ আসার পূর্বেই। তখন তাঁর দু’চোখ হতে অশ্রু ঝরছিল।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 134,
        "matchingArabicURN": 132600,
        "last_updated": null
    },
    {
        "banglaURN": 6036310,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3631,
        "hadithSanad": "",
        "hadithText": "জাবির (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) জিজ্ঞেস করলেন, তোমাদের নিকট আনমাত (গালিচার কার্পেট) আছে কি? আমি বললাম আমরা তা পাব কোথায়? তিনি বললেন, শীঘ্রই তোমরা আনমাত লাভ করবে। তখন আমি আমার স্ত্রীকে বলি, আমার বিছানা হতে এটা সরিয়ে দাও। তখন সে বলল, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) কি বলেননি যে, শীঘ্রই তোমরা আনমাত পেয়ে যাবে? তখন আমি তা রাখতে দেই।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 135,
        "matchingArabicURN": 132610,
        "last_updated": null
    },
    {
        "banglaURN": 6036320,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3632,
        "hadithSanad": "",
        "hadithText": "আবদুল্লাহ্ ইব্ন মাস’উদ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, সা’দ ইব্‌ন মু’আয (রাঃ) ‘উমরাহ আদায় করার জন্য গেলেন এবং সাফওয়ানের পিতা উমাইয়াহ ইব্‌ন খালাফ এর বাড়িতে তিনি অতিথি হলেন। উমাইয়াহ ও সিরিয়া গমনকালে (মদীনায়) সা’দ (রাঃ) -এর বাড়িতে অবস্থান করত। উমাইয়াহ সা’দ (রাঃ) -কে বলল, অপেক্ষা করুন, যখন দুপুর হবে এবং যখন চলাফেরা কমে যাবে, তখন আপনি গিয়ে তাওয়াফ করে নিবেন। সা’দ (রাঃ) তাওয়াফ করছিলেন। এমতাবস্থায় আবূ জাহাল এসে হাজির হল। সা’দ (রাঃ) -কে দেখে জিজ্ঞেস করল, এ ব্যক্তি কে যে কা’বার তাওয়াফ করছে সা’দ (রাঃ) বললেন, আমি সা’দ। আবূ জাহাল বলল, তুমি নির্বিঘ্নে কা’বার তাওয়াফ করছ? অথচ তোমরাই মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ও তাঁর সাথীদেরকে আশ্রয় দিয়েছ? সা’দ (রাঃ) বললেন, হ্যাঁ। এভাবে দু’জনের মধ্যে কথা কাটাকাটি হল। তখন উমাইয়াহ সা’দ (রাঃ) -কে বলল, আবুল হাকামের সঙ্গে উচ্চঃস্বরে কথা বল না, কারণ সে মক্কাবাসীদের নেতা। অতঃপর সা’দ (রাঃ) বললেন, আল্লাহ্‌র কসম! তুমি যদি আমাকে বায়তুল্লাহর তাওয়াফ করতে বাধা প্রদান কর, তবে আমিও তোমার সিরিয়ার সঙ্গে ব্যবসা বাণিজ্যের রাস্তা বন্ধ করে দিব। উমাইয়াহ সা’দ (রাঃ) -কে তখন বলতে লাগল, তোমার স্বর উঁচু করো না এবং সে তাঁকে বিরত করতে চেষ্টা করতে লাগল। তখন সা’দ (রাঃ) ক্রোধান্বিত হয়ে বললেন, আমাকে ছেড়ে দাও। আমি মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে বলতে শুনেছি, তারা তোমাকে হত্যা করবে। উমাইয়াহ বলল আমাকেই? তিনি বললেন হ্যাঁ। উমাইয়াহ বলল, আল্লাহ্‌র কসম মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) কখনও মিথ্যা কথা বলেন না। অতঃপর উমাইয়া তার স্ত্রীর নিকট ফিরে এসে বলল, তুমি কি জান, আমার ইয়াসরিবী ভাই আমাকে কী বলেছে? স্ত্রী জিজ্ঞেস করল কী বলেছে? উমাইয়াহ বলল, সে মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে বলতে শুনেছে যে, তারা আমাকে হত্যা করবে। তার স্ত্রী বলল, আল্লাহ্‌র কসম, মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) মিথ্যা বলেন না। যখন মক্কার মুশরিকরা বদরের উদ্দেশ্যে রওয়ানা হল এবং আহবানকারী আহবান জানাল। তখন উমাইয়াহর স্ত্রী তাকে স্মরণ করিয়ে দিল, তোমার ইয়াসরিবী ভাই তোমাকে যে কথা বলছিল সে কথা তোমার মনে নেই? তখন উমাইয়া না যাওয়ারই সিদ্ধান্ত নিল। আবূ জাহল তাকে বলল, তুমি এ অঞ্চলের একজন শীর্ষস্থানীয় নেতা। আমাদের সঙ্গে দুইএকদিনের পথ চল। উমাইয়াহ তাদের সঙ্গে চলল। আল্লাহ্ তা’আলার ইচ্ছায় সে নিহত হল।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 136,
        "matchingArabicURN": 132620,
        "last_updated": null
    },
    {
        "banglaURN": 6036330,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3633,
        "hadithSanad": "",
        "hadithText": "আবদুল্লাহ্ (ইব্ন ‘উমর) (রাঃ) থেকে বর্ণিতঃ আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, একদা (স্বপ্নে) লোকজনকে একটি মাঠে সমবেত দেখতে পেলাম। তখন আবূ বকর (রাঃ) উঠে দাঁড়ালেন এবং এক অথবা দুই বালতি পানি উঠালেন। পানি উঠাতে তিনি দুর্বলতা বোধ করছিলেন। আল্লাহ্ তাঁকে ক্ষমা করুন। অতঃপর ‘উমর (রাঃ) বালতিটি হাতে নিলেন। বালতিটি তখন বড় আকার ধারণ করল। আমি মানুষের মধ্যে পানি উঠাতে ‘উমারের মত সুদক্ষ ও শক্তিশালী ব্যক্তি আর দেখিনি। শেষে উপস্থিত লোক তাদের উটগুলোকে পানি পান করিয়ে উটশালে নিয়ে গেল। হাম্মাম (রহঃ) বলেন, আমি আবূ হুরায়রা (রাঃ) -কে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে বর্ণনা করতে শুনেছি আবূ বক্‌র দু’বালতি পানি উঠালেন।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 138,
        "matchingArabicURN": 132630,
        "last_updated": null
    },
    {
        "banglaURN": 6036340,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2467,
        "babName": null,
        "hadithNumber": 3634,
        "hadithSanad": "",
        "hadithText": "আবূ ‘উসমান (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমাকে জানানো হল যে, একবার জিব্রাঈল (আঃ) নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর নিকট আসলেন। তখন উম্মু সালামা (রাঃ) তাঁর নিকট ছিলেন। তিনি এসে তাঁর সঙ্গে আলোচনা করলেন। অতঃপর উঠে গেলেন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) উম্মু সালামা (রাঃ) -কে জিজ্ঞেস করলেন, লোকটিকে চিনতে পেরেছ কি? তিনি বললেন, এতো দেহ্ইয়া। উম্মু সালামা (রাঃ) বলেন, আল্লাহর কসম! আমি দেহ্ইয়া বলেই বিশ্বাস করেছিলাম কিন্তু নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে তাঁর খুতবায় জিব্রাঈল (আঃ) -এর আগমনের কথা বলতে শুনলাম। [সুলায়মান (রাবী) বলেন, আমি আবূ ‘উসমানকে জিজ্ঞেস করলাম এ হাদীসটি আপনি কার নিকট শুনেছেন? তিনি বললেন, উসামাহ ইব্‌ন যায়দ (রাঃ) -এর নিকট শুনেছি।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 137,
        "matchingArabicURN": 132640,
        "last_updated": null
    },
    {
        "banglaURN": 6036350,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2468,
        "babName": null,
        "hadithNumber": 3635,
        "hadithSanad": "",
        "hadithText": "আবদুল্লাহ্ ইব্‌ন ‘উমর (রাঃ) থেকে বর্ণিতঃ ইয়াহুদীরা আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর খিদমতে এসে বলল, তাদের একজন পুরুষ ও একজন মহিলা ব্যভিচার করেছে। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) জিজ্ঞেস করলেন, প্রস্তর নিক্ষেপে হত্যা করা সম্পর্কে তাওরাতে কী বিধান পেয়েছ? তারা বলল, আমরা এদেরকে অপমানিত করব এবং তাদের বেত্রাঘাত করা হবে। ‘আবদুল্লাহ্ ইব্‌ন সালাম (রাঃ) বললেন, তোমরা মিথ্যা বলছ। তাওরাতে প্রস্তর নিক্ষেপে হত্যার বিধান রয়েছে। তারা তাওরাত নিয়ে এসে বাহির করল এবং প্রস্তর হত্যা করা সম্পর্কীয় আয়াতের উপর হাত রেখে তার আগের ও পরের আয়াতগুলি পাঠ করল। ‘আবদুল্লাহ্ ইব্‌ন সালাম (রাঃ) বললেন, তোমরা হাত সরাও। সে হাত সরাল। তখন দেখা গেল প্রস্তর নিক্ষেপে হত্যা করার আয়াত আছে। তখন ইয়াহুদীরা বলল, হে মুহাম্মাদ! তিনি সত্যই বলছেন। তাওরাতে প্রস্তর নিক্ষেপে হত্যার আয়াতই আছে। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) প্রস্তর নিক্ষেপে দু’জনকে হত্যা করার নির্দেশ দিলেন। ‘আবদুল্লাহ্ (রাঃ) বলেন, আমি ঐ পুরুষটিকে মেয়েটির দিকে ঝুঁকে পড়তে দেখেছি। সে মেয়েটিকে বাচাঁনোর চেষ্টা করছিল। (১৩২৯, মুসলিম ২৯/৬, হাঃ ১৬৯৯, আহমাদ ৪৪৯৮) (আ.প্র. ৩৩৬৪, ই.ফা. ৩৩৭১)</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 139,
        "matchingArabicURN": 132650,
        "last_updated": null
    },
    {
        "banglaURN": 6036360,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2469,
        "babName": null,
        "hadithNumber": 3636,
        "hadithSanad": "",
        "hadithText": "আবদুল্লাহ্ ইব্‌ন মাস’উদ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর যুগে চাঁদ দ্বিখন্ডিত হয়েছিল। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, তোমরা সাক্ষী থাক। (৩৮৬৯, ৩৮৭১, ৪৮৬৪, ৪৮৬৫, মুসলিম ৫০/৮, হাঃ ২৮০০, আহমাদ ৩৫৮৩) (আ.প্র. ৩৩৬৫, ই.ফা. ৩৩৭২)</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 140,
        "matchingArabicURN": 132660,
        "last_updated": null
    },
    {
        "banglaURN": 6036370,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2469,
        "babName": null,
        "hadithNumber": 3637,
        "hadithSanad": "",
        "hadithText": "আনাস (ইব্‌ন মালিক) (রাঃ) থেকে বর্ণিতঃ মক্কাবাসী কাফিররা আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর নিকট নির্দশন দেখানোর জন্য বললে তিনি তাদেরকে চাঁদ দু’ভাগ করে দেখালেন। (৩৮৬৮, ৪৮৬৭, ৪৮৬৮, মুসলিম ৫০/৮, হাঃ ২৮০২) (আ.প্র. ৩৩৬৬, ই.ফা. ৩৩৭৩)</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 141,
        "matchingArabicURN": 132670,
        "last_updated": null
    },
    {
        "banglaURN": 6036380,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2469,
        "babName": null,
        "hadithNumber": 3638,
        "hadithSanad": "",
        "hadithText": "ইব্‌ন ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর যুগে চাদঁ দু’খন্ড হয়েছিল। (৩৮৭০, ৪৮৬৬, মুসলিম ৫০/৮, হাঃ ২৮০৩) (আ.প্র. ৩৩৬৭, ই.ফা. ৩৩৭৪)</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 142,
        "matchingArabicURN": 132680,
        "last_updated": null
    },
    {
        "banglaURN": 6036390,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2470,
        "babName": null,
        "hadithNumber": 3639,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর দু’জন সহাবী অন্ধকার রাতে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর নিকট হতে বের হলেন, তখন তাদের সঙ্গে দু’টি বাতির মত কিছু তাদের সম্মুখ ভাগ আলোকিত করে চলল। যখন তাঁরা আলাদা হয়ে গেলেন তখন প্রত্যেকের সঙ্গে এক একটি বাতি চলতে লাগল। তাঁরা নিজ নিজ বাড়িতে পৌঁছা পর্যন্ত। (৪৬৫) (আ.প্র. ৩৩৬৮, ই.ফা. ৩৩৭৫)</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 143,
        "matchingArabicURN": 132690,
        "last_updated": null
    },
    {
        "banglaURN": 6036400,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2470,
        "babName": null,
        "hadithNumber": 3640,
        "hadithSanad": "",
        "hadithText": "মুগীরা ইব্‌ন শু’বাহ (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, আমার উম্মতের একটি দল সর্বদা বিজয়ী থাকবে। এমনকি যখন ক্বিয়ামত আসবে তখনও তারা বিজয়ী থাকবে। (৭৩১১, ৭৪৫৯, মুসলিম ৩৩/৫৩, হাঃ ১৯২১) (আ.প্র. ৩৩৬৯, ই.ফা. ৩৩৭৬)</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 144,
        "matchingArabicURN": 132700,
        "last_updated": null
    },
    {
        "banglaURN": 6036410,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2470,
        "babName": null,
        "hadithNumber": 3641,
        "hadithSanad": "",
        "hadithText": "মু’আবিয়া (রাঃ) থেকে বর্ণিতঃ তিনি বলেন আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে বলতে শুনেছি, আমার উম্মতের একটি দল সর্বদা আল্লাহ্‌র দ্বীনের উপর অটল থাকবে। তাদেরকে যারা অপমান করতে চাইবে অথবা তাদের বিরোধিতা করবে, তারা তাদের কোন ক্ষতি করতে পারবে না। এমনকি কিয়ামত আসা পর্যন্ত তাঁরা এই অবস্থার উপর থাকবে। ‘উমাইর ইব্‌ন হানী (রহঃ) মালিক ইব্‌ন ইউখামিরের (রহঃ) বরাত দিয়ে বলেন, মু’আয (রাঃ) বলেছেন, ঐ দলটি সিরিয়ায় অবস্থান করবে। মু’আবিয়া (রহঃ) বলেন, মালিক (রহঃ) -এর ধারণা যে ঐ দলটি সিরিয়ায় অবস্থান করবে বলে মু’আয (রাঃ) বলছেন। (৭১) (আ.প্র. ৩৩৭০, ই.ফা. ৩৩৭৭)</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 145,
        "matchingArabicURN": 132710,
        "last_updated": null
    },
    {
        "banglaURN": 6036440,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2470,
        "babName": null,
        "hadithNumber": 3644,
        "hadithSanad": "",
        "hadithText": "ইব্‌ন ‘উমর (রাঃ) থেকে বর্ণিতঃ আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, ঘোড়ার কপালের কেশদামে কিয়ামত অবধি কল্যাণ ও বরকত আছে। (২৮৪৯) (আ.প্র. ৩৩৭২, ই.ফা. ৩৩৭৯)</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 147,
        "matchingArabicURN": 132740,
        "last_updated": null
    },
    {
        "banglaURN": 6036450,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2470,
        "babName": null,
        "hadithNumber": 3645,
        "hadithSanad": "",
        "hadithText": "আনাস ইবনে মালিক (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)  বলেন, ঘোড়ার কপালে কল্যাণ ও বরকত আছে। (২৮৫১) (আ.প্র. ৩৩৭৩, ই.ফা. ৩৩৮০)</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 148,
        "matchingArabicURN": 132750,
        "last_updated": null
    },
    {
        "banglaURN": 6036460,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2470,
        "babName": null,
        "hadithNumber": 3646,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, ঘোড়া তিন প্রকার। একজনের জন্য পূণ্য, আর একজনের জন্য আবরণ ও অন্য আর  একজনের জন্য পাপের কারণ। সে ব্যক্তির জন্য পূণ্য, যে আল্লাহ্‌র রাস্তায় ঘোড়াকে সর্বদা প্রস্তুত রাখে এবং সে ব্যক্তি যখন লম্বা রশি দিয়ে ঘোড়াটি কোন চারণভূমি বা বাগানে বেঁধে রাখে তখন ঐ লম্বা দড়ির মধ্যে চারণভূমি অথবা বাগানের যে অংশ পড়বে তত পরিমান সাওয়াব সে পাবে। যদি ঘোড়াটি দড়ি ছিঁড়ে ফেলে এবং দুই একটি টিলা পার হয়ে কোথাও চলে যায় তার পরে তার লাদাগুলিও নেকী বলে গন্য হবে। যদি কোন নদী-নালায় গিয়ে পানি পান করে, মালিক যদিও পানি পান করানোর ইচ্ছা করেনি তাও তার নেক আমলে গন্য হবে। আর যে ব্যক্তি নিজের অস্বচ্ছলতা দারিদ্রের গ্লানি ও পরমুখাপেক্ষিতা হতে নিজেকে রক্ষা করার জন্য ঘোড়া পালন করে এবং তার গর্দান ও পিঠে আল্লাহ্‌র যে হক রয়েছে তা ভুলে না যায়। তবে এই ঘোড়া তার জন্য আযাব হতে আবরণ হবে। অপর এক ব্যক্তি যে অহংকার, লোক দেখানো এবং আহলে ইসলামের সঙ্গে শত্রুতার কারণে ঘোড়া লালন-পালন করে এ ঘোড়া তার জন্য পাপের বোঝা হবে। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে গাধা সম্পর্কে জিজ্ঞেস করা হলে, তিনি বললেন, এ সম্পর্কে নির্দিষ্ট কোন আয়াত আমার নিকট অবতীর্ণ হয়নি। তবে ব্যাপক অর্থবোধক অনন্য আয়াতটি আমার নিকট নাযিল হয়েছেঃ যে ব্যক্তি অণু পরিমাণ নেক আমল করবে সে তার প্রতিফল অবশ্যই দেখতে পাবে। আর যে অণু পরিমাণ মন্দ কাজ করবে সেও তার প্রতিফল দেখতে পাবে। (যিলযালঃ ৭৮) (২৩৭১) (আ.প্র. ৩৩৭৪, ই.ফা. ৩৩৮১)</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 149,
        "matchingArabicURN": 132760,
        "last_updated": null
    },
    {
        "banglaURN": 6036470,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2470,
        "babName": null,
        "hadithNumber": 3647,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্‌ন মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) খুব সকালে খায়বারে পৌঁছলেন। তখন খায়বারবাসী কোদাল নিয়ে ঘর হতে বের হচ্ছিল। তাঁকে (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে দেখে তারা বলতে লাগল, মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) পুরা সেনা বাহিনী নিয়ে এসে পড়েছে। (এ বলে) তারা দৌড়াদৌড়ি করে তাদের সুরক্ষিত কিল্লায় ঢুকে পড়ল। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) দু’হাত উপরে উঠিয়ে বললেন, “আল্লাহু আকবার” খায়বার ধ্বংস হোক, আমরা যখন কোন জাতির, আঙ্গিণায় অবতরণ করি তখন এসব সাবধানকৃত লোকদের প্রভাতটি অত্যন্ত অশুভ হয়। (৩৭১) (আ.প্র. ৩৩৭৫, ই.ফা. ৩৩৮২)</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 150,
        "matchingArabicURN": 132770,
        "last_updated": null
    },
    {
        "banglaURN": 6036480,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": null,
        "babNumber": 2470,
        "babName": null,
        "hadithNumber": 3648,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বললেন, আমি বললাম, হে আল্লাহ্‌র রাসূল! আপনার হতে অনেক হাদীস আমি শুনেছি, তবে তা আমি ভুলে যাই। তিনি (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, তোমার চাদরটি বিছাও। আমি চাদরটি বিছালাম। তিনি তাঁর হাত দিয়ে চাদরের মধ্যে কী যেন রাখলেন এবং বললেন, চাদরটি চেপে ধর। আমি চেপে ধরলাম, অতঃপর আমি আর কোন হাদীস ভুলিনি। (১১৮) (আ.প্র. ৩৩৭৬, ই.ফা. ৩৩৮৩)</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 151,
        "matchingArabicURN": 132780,
        "last_updated": null
    },
    {
        "banglaURN": 6034931,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": "",
        "babNumber": 2442,
        "babName": "",
        "hadithNumber": 3493,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, তোমরা মানুষকে খণির মত পাবে। আইয়্যামে জাহিলীয়্যাতের উত্তম ব্যক্তিগণ ইসলাম গ্রহণের পরও তারা উত্তম। যখন তারা দ্বীনী জ্ঞান অর্জন করে আর তোমরা শাসন ও কর্তৃত্বের ব্যাপারে লোকদের মধ্যে উত্তম ঐ ব্যক্তিকে পাবে যে এই ব্যাপারে তাদের মধ্যে সবচেয়ে অধিক অনাসক্ত।\n\nআবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ আর মানুষের মধ্যে সব থেকে নিকৃষ্ট ঐ দু’মুখী ব্যক্তি যে একদলের সঙ্গে এক ভাবে কথা বলে, অপর দলের সঙ্গে আরেকভাবে কথা বলে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 131231,
        "last_updated": null
    },
    {
        "banglaURN": 6034951,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": "",
        "babNumber": 2442,
        "babName": "",
        "hadithNumber": 3495,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, খিলাফত ও নেতৃত্বের ব্যাপারে সকলেই কুরাইশদের অনুগত থাকবে। মুসলিমগণ তাদের মুসলিমদের এবং কাফিররা তাদের কাফিরদের অনুগত।\n\nআবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ আর মানব সমাজ খণির মত। জাহিলী যুগের উত্তম ব্যক্তি ইসলাম গ্রহণের পরও উত্তম যদি তারা দ্বীনী ইল্ম অর্জন করে। তোমরা নেতৃত্ব ও শাসনের ব্যাপারে ঐ লোককেই সবচেয়ে উত্তম পাবে যে এর প্রতি অনাসক্ত, যে পর্যন্ত না সে তা গ্রহণ করে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 131250,
        "last_updated": null
    },
    {
        "banglaURN": 6035291,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": "",
        "babNumber": 2457,
        "babName": "",
        "hadithNumber": 3529,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ মিনায় অবস্থানের দিনগুলোতে (অর্থাৎ ১০, ১১, ১২ তারিখে) আবূ বকর (রাঃ) আমার গৃহে প্রবেশ করলেন। তখন তাঁর কাছে দু’টি বালিকা ছিল। তারা দফ বাজিয়ে নেচে নেচে গান করছিল। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তখন চাদর দিয়ে মুখ ঢেকে শুয়েছিলেন। আবূ বকর (রাঃ) এদেরকে ধমক দিলেন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তখন মুখ হতে চাদর সরিয়ে বললেন, হে আবূ বকর (রাঃ)! এদেরকে গাইতে দাও। কেননা, আজ ঈদের দিনও মিনার দিনগুলির অন্তর্ভুক্ত।\n\n‘আয়িশা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাকে আড়াল করে দাঁড়িয়ে ছিলেন আর আমি হাবশীদের খেলা দেখছিলাম। মসজিদের কাছে তারা যুদ্ধাস্ত্র নিয়ে খেলা করছিল। এমন সময় ‘উমর (রাঃ) এসে তাদেরকে ধমক দিলেন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, হে ‘উমর! তাদেরকে বনূ আরফিদাকে নিরাপদ ছেড়ে দাও।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 131581,
        "last_updated": null
    },
    {
        "banglaURN": 6035872,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": "",
        "babNumber": 2467,
        "babName": "",
        "hadithNumber": 3587,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, কিয়ামত সংঘটিত হবে না যতক্ষণ না তোমাদের যুদ্ধ হবে এমন এক জাতির সঙ্গে যাদের পায়ের জুতা হবে পশমের এবং যতক্ষণ না তোমাদের যুদ্ধ হবে তুর্কদের সাথে যাদের চক্ষু ছোট, নাক চেপ্টা, চেহারা লাল বর্ণ যেন তাদের চেহারা পেটানো ঢাল।\n\nবর্ণনাকারী থেকে বর্ণিতঃ তোমাদের মধ্যে সর্বোত্তম মানুষ হবে যারা নেতৃত্ব ও শাসন ক্ষমতায় জড়িয়ে না যাওয়া পর্যন্ত একে অত্যন্ত অপছন্দ করবে। মানুষ খণির মত। যারা জাহিলীয়্যাতের যুগে শ্রেষ্ঠ ও উত্তম, ইসলাম গ্রহনের পরও তারা শ্রেষ্ঠ ও উত্তম।\n\nবর্ণনাকারী থেকে বর্ণিতঃ তোমাদের নিকট এমন যুগ আসবে যখন তোমাদের পরিবার-পরিজনরা ধন-সম্পদের অধিকারী হবার চাইতেও আমার সাক্ষাৎ পাওয়া তার নিকট অত্যন্ত প্রিয় বলে গণ্য হবে।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 132180,
        "last_updated": null
    },
    {
        "banglaURN": 6035951,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": "",
        "babNumber": 2467,
        "babName": "",
        "hadithNumber": 3595,
        "hadithSanad": "",
        "hadithText": "আদি ইবনু হাতিম (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর মজলিসে উপবিষ্ট ছিলাম। তখন এক ব্যক্তি এসে দুর্ভিক্ষের অভিযোগ করল। অতঃপর আর এক ব্যক্তি এসে ডাকাতের উপদ্রবের কথা বলে অনুযোগ করল। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, হে আদী! তুমি কি হীরা নামক স্থানটি দেখেছ? আমি বললাম, দেখি নাই, তবে স্থানটি আমার জানা আছে। তিনি বললেন, তুমি যদি দীর্ঘজীবী হও তবে দেখবে একজন  উষ্ট্রারোহী হাওদানশীল মহিলা হীরা হতে রওয়ানা হয়ে বায়তুল্লাহ শরীফে তাওয়াফ করে যাবে। আল্লাহ্ ছাড়া অন্য কাউকে ভয় করবে না। আমি মনে মনে বলতে লাগলাম তাঈ গোত্রের ডাকাতগুলো কোথায় থাকবে যারা ফিতনা ফাসাদের আগুন জ্বালিয়ে দেশকে জ্বালিয়ে দিচ্ছে। তিনি বললেন, তুমি যদি দীর্ঘজীবী হও, তবে নিশ্চয়ই দেখতে পাবে যে তোমরা কিসরার ধনভাণ্ডার দখল করেছ। আমি বললাম, কিসরা ইবনু হুরমুযের? নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, হাঁ, কিসরা ইবনু হুরমুযের। তোমার আয়ু যদি দীর্ঘ হয়, তবে অবশ্যই তুমি দেখতে পাবে, লোকজন মুঠভরা যাকাতের স্বর্ণ-রৌপ্য নিয়ে বের হবে এবং এমন ব্যক্তির খোঁজ করে বেড়াবে যে তাদের এ মাল গ্রহণ করে। কিন্তু গ্রহণকারী একটি লোকও পাবে না। তোমাদের প্রত্যেকটি মানুষ কিয়ামত দিবসে মহান আল্লাহ্‌র সাক্ষাৎ লাভ করবে। তখন তার ও আল্লাহ্‌র মাঝে অন্য কোন দোভাষী থাকবে না যিনি ভাষান্তর করে বলবেন। আল্লাহ্ বলবেন, আমি কি তোমার নিকট আমার বাণী পৌঁছানোর জন্য রাসূল প্রেরণ করিনি? সে বলবে হাঁ, প্রেরণ করেছেন। আল্লাহ্ বলবেন, আমি কি তোমাকে ধন-সম্পদ, সন্তান-সন্ততি দান করিনি এবং দয়া মেহেরবাণী করিনি? তখন সে বলবে, হাঁ দিয়েছেন। অতঃপর সে ডানদিকে নযর করবে, জাহান্নাম ছাড়া আর কিছুই দেখতে পাবে না। আবার সে বাম দিকে নযর করবে, তখনো সে জাহান্নাম ছাড়া কিছুই দেখবে না। আদী (রাঃ) বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে বলতে শুনেছি, আধখানা খেজুর দান করে হলেও জাহান্নামের আগুন হতে নিজেকে রক্ষা কর আর যদি তাও করার তৌফিক না হয় তবে মানুষের জন্য ভালো কথা বলে নিজেকে আগুন থেকে রক্ষা কর। আদী (রাঃ) বলেন, আমি নিজে দেখেছি, এক উষ্ট্রারোহী মহিলা হীরা হতে একাকী রওয়ানা হয়ে কা’বাহ শরীফ তাওয়াফ করেছে। সে আল্লাহ্ ছাড়া অন্য কাউকেও ভয় করে না। আর পারস্য সম্রাট কিসরা ইবনু হুরমুযের ধনভাণ্ডার যারা দখল করেছিল, তাদের মধ্যে আমি একজন ছিলাম। তোমরা যদি আরও কিছুদিন বেঁচে থাক তাহলে দেখতে পাবে যেমন (ভবিষ্যদ্বাণী হিসাবে) আবুল কাসিম (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যা বলেছেন, এক ব্যক্তি এক মুষ্টি ভর্তি সোনা-রূপা নিয়ে বের হবে কিন্তু কেউ নিতে চাইবে না।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 132240,
        "last_updated": null
    },
    {
        "banglaURN": 6035952,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": "",
        "babNumber": 2467,
        "babName": "",
        "hadithNumber": 3595,
        "hadithSanad": "",
        "hadithText": "মুহিল্লি ইবনু খলীফাহ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি আদী ইবনু হাতিমকে বলতে শুনেছি, তিনি বলেন, একদা আমি আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর নিকট উপস্থিত ছিলাম। (বাকী হাদীস পূর্বোক্ত হাদীসের অনুরূপঃ এই বর্ণনায় মুহিল্লি ইবনু খলীফা হাদীসটি আদী ইবনু হাতিম হতে সরাসরি শুনেছেন বলে উল্লেখিত হয়েছে)</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 132250,
        "last_updated": null
    },
    {
        "banglaURN": 6036011,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": "",
        "babNumber": 2467,
        "babName": "",
        "hadithNumber": 3601,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, শীঘ্রই ফিতনা রাশি আসতে থাকবে। ঐ সময় উপবিষ্ট ব্যক্তি দাঁড়ানো ব্যক্তির চেয়ে উত্তম (নিরাপদ), দাঁড়ানো ব্যক্তি ভ্রাম্যমান ব্যক্তি হতে অধিক রক্ষিত আর ভ্রাম্যমান ব্যক্তি ধাবমান ব্যক্তির চেয়ে অধিক বিপদমুক্ত। যে ব্যক্তি ফিতনার দিকে চোখ তুলে তাকাবে ফিতনা তাকে গ্রাস করবে। তখন যদি কোন ব্যক্তি তার দ্বীন রক্ষার জন্য কোন ঠিকানা অথবা নিরাপদ আশ্রয় পায়, তবে সেখানে আশ্রয় গ্রহণ করাই উচিৎ হবে।\n\nইবনু শিহাব যুহরী (রহঃ) থেকে বর্ণিতঃ ইব্‌ন শিহাব যুহরী (রহঃ).... নাওফাল ইব্‌ন মু‘আবিয়া (রাঃ) হতে আবূ হুরায়রা (রাঃ) -এর হাদীসের মতই বর্ণনা করেছেন। তবে অতিরিক্ত আর একটি কথাও বর্ণনা করেছেন যে এমন একটি সালাত রয়েছে যে ব্যক্তির ঐ সালাত ফওত হয়ে গেল, তার পরিবার-পরিজন ধন-সম্পদ সবই যেন ধ্বংস হয়ে গেল।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 132311,
        "last_updated": null
    },
    {
        "banglaURN": 6036201,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": "",
        "babNumber": 2467,
        "babName": "",
        "hadithNumber": 3620,
        "hadithSanad": "",
        "hadithText": "ইব্ন ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর যামানায় মুসায়লামাতুল কায্যাব আসল এবং বলতে লাগল, মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যদি তাঁর পর আমাকে তাঁর স্থলাভিষিক্ত করেন, তাহলে আমি তাঁর অনুসরণ করব। তার জাতির অনেক লোক নিয়ে সে এসেছিল। আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তার নিকট আসলেন। আর তাঁর সাথী ছিলেন সাবিত ইব্‌ন কায়েস ইব্‌ন শাম্মাস (রাঃ)। আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর হাতে খেজুরের একটি ডাল ছিল। তিনি সঙ্গী-সাথী পরিবেষ্টিত মুসায়লামার সামনে গিয়ে দাঁড়ালেন এবং বললেন, তুমি যদি আমার নিকট খেজুরের এই ডালটিও চাও, তবুও আমি তা তোমাকে দিব না। তোমার ব্যাপারে আল্লাহ্‌র যা ফায়সালা তা তুমি লঙ্ঘন করতে পারবে না। যদি তুমি কিছু দিন বেঁচেও থাক তবুও আল্লাহ্ তোমাকে অবশ্যই ধ্বংস করে দিবেন। অবশ্যই তুমি ঐ লোক যার সম্বন্ধে স্বপ্নে আমাকে সব কিছু দেখানো হয়েছে।\n\nআবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ (ইব্‌ন ‘আব্বাস (রহঃ)...বলেন, ) আবূ হুরায়রা (রাঃ) আমাকে জানিয়েছেন, আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, আমি ঘুমিয়ে ছিলাম। স্বপ্নে দেখতে পেলাম আমার দু’হাতে সোনার দু’টি বালা। বালা দু’টি আমাকে চিন্তায় ফেলল। স্বপ্নেই আমার নিকট অহী এল, আপনি ফুঁ দিন। আমি তাই করলাম। বালা দু’টি উড়ে অদৃশ্য হয়ে গেল। আমি স্বপ্নের ব্যাখ্যা এভাবে করলাম, আমার পর দু’জন কায্যাব বের হবে। এদের একজন আনসী, অপরজন ইয়ামামাহবাসী মুসায়লামাতুল কাজ্জাব।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 127,
        "matchingArabicURN": 132501,
        "last_updated": null
    },
    {
        "banglaURN": 6036231,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": "",
        "babNumber": 2467,
        "babName": "",
        "hadithNumber": 3623,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর চলার ভঙ্গিতে চলতে চলতে ফাতিমা (রাঃ) আমাদের নিকট আগমন করলেন। তাঁকে দেখে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, আমার স্নেহের কন্যাকে মোবারাকবাদ। অতঃপর তাঁকে তার ডানপাশে বা বামপাশে বসালেন এবং তাঁর সঙ্গে চুপিচুপি কথা বললেন। তখন ফাতিমা (রাঃ) কেঁদে দিলেন। আমি [‘আয়িশা (রাঃ) তাঁকে বললাম] কাঁদছেন কেন? নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) পুনরায় চুপিচুপি তার সঙ্গে কথা বললেন। ফাতিমা (রাঃ) এবার হেসে উঠলেন। আমি [‘আয়িশা (রাঃ) বললাম, আজকের মত দুঃখ ও বেদনার সঙ্গে সঙ্গে আনন্দ ও খুশী আমি আর কখনো দেখিনি।  আমি তাকে জিজ্ঞেস করলাম, তিনি (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) কী বলেছিলেন? তিনি উত্তর দিলেন, আমি আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর গোপন কথাকে প্রকাশ করব না। শেষে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর ইন্তেকাল হয়ে যাবার পর আমি তাঁকে (আবার) জিজ্ঞেস করলাম, তিনি কী বলেছিলেন?\n\n‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বললেন, তিনি (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) প্রথম বার আমাকে বলেছিলেন, জিব্রাঈল (আঃ) প্রতি বছর একবার আমার সঙ্গে কুরআন পাঠ করতেন, এ বছর দু’বার পড়ে শুনিয়েছেন। আমার মনে হয় আমার বিদায় বেলা উপস্থিত এবং অতঃপর আমার পরিবারের মধ্যে তুমিই সর্বপ্রথম আমার সঙ্গে মিলিত হবে। তা শুনে আমি কেঁদে দিলাম। অতঃপর বলেছিলেন, তুমি কি এতে সন্তুষ্ট নও যে, জান্নাতবাসী নারীদের অথবা মু’মিন নারীদের তুমি সরদার হবে। এ কথা শুনে আমি হেসেছিলাম।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 129,
        "matchingArabicURN": 132531,
        "last_updated": null
    },
    {
        "banglaURN": 6036251,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": "",
        "babNumber": 2467,
        "babName": "",
        "hadithNumber": 3625,
        "hadithSanad": "",
        "hadithText": "‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) অন্তিম পীড়িতাবস্থায় তাঁর কন্যা ফাতিমা (রাঃ) -কে ডেকে পাঠালেন। অতঃপর চুপিচুপি কী যেন বললেন। ফাতিমা (রাঃ) তা শুনে কেঁদে ফেললেন। অতঃপর আবার ডেকে তাঁকে চুপিচুপি আরো কী যেন বললেন। এতে ফাতিমা (রাঃ) হেসে উঠলেন। ‘আয়িশা (রাঃ) বলেন, আমি হাসি-কান্নার কারণ জিজ্ঞেস করলাম।\n\n‘আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বললেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাকে চুপে চুপে বলেছিলেন, যে রোগে তিনি রোগাক্রান্ত হয়েছেন এ রোগেই তাঁর মৃত্যু হবে; তাই আমি কেঁদে দিয়েছিলাম। অতঃপত তিনি চুপিচুপি আমাকে বলেছিলেন, তাঁর পরিবার-পরিজনের মধ্যে সর্বপ্রথম আমিই তাঁর সঙ্গে মিলিত হব, এতে আমি হাসলাম।</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 130,
        "matchingArabicURN": 132551,
        "last_updated": null
    },
    {
        "banglaURN": 6036421,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 61,
        "bookName": "",
        "babNumber": 2470,
        "babName": "",
        "hadithNumber": 3642,
        "hadithSanad": "",
        "hadithText": "‘উরওয়া বারিকী (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) একটি বকরী কিনে দেয়ার জন্য তাকে একটি দিনার দিলেন। তিনি ঐ দীনার দিয়ে দু’টি বকরী কিনলেন। অতঃপর এক দীনার মূল্যে একটি বকরী বিক্রি করে দিলেন এবং নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর খিদমতে একটি বকরী ও একটি দীনার নিয়ে উপস্থিত হলেন। তা দেখে তিনি তার ব্যবসা বাণিজ্যে বরকত হবার জন্য দু’আ করে দিলেন। অতঃপর তার অবস্থা এমন হল যে, ব্যবসার জন্য যদি মাটিও তিনি কিনতেন তাতেও তিনি লাভবান হতেন। এ হাদীসের একজন বর্ণনাকারী সুফিয়ান ইব্‌ন ‘উয়াইনাহ বলেন, হাসান ইব্‌ন ‘উমারাহ শাবীব ও ‘উরওয়ার বরাদ দিয়ে এ হাদীসটি আমাদেরকে বলেছেন। তারপর আমি শাবীবকে জিজ্ঞেস করলে তিনি বলেন যে, আমি সরাসরি ‘উরওয়া থেকে শুনিনি। একটি গোত্র ‘উরওয়ার বরাত দিয়ে আমাকে হাদীস বলেছেন। তবে ‘উরওয়ার থেকে আমি (অপর) একটি হাদীস শুনেছি। (আ.প্র. ৩৩৭১ প্রথমাংশ, ই.ফা. ৩৩৭৮ প্রথমাংশ)\n\n‘উরওয়া বারিকী (রাঃ) থেকে বর্ণিতঃ আর তা হলো এইঃ ‘উরওয়া বলেন, আমি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -কে বলতে শুনেছি, ঘোড়ার কপালের কেশদামে বরকত ও কল্যাণ আছে ক্বিয়ামাত অবধি। রাবী বলেন, আমি তার গৃহে সত্তরটি ঘোড়া দেখেছি। সুফইয়ান (রহঃ) বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) -এর জন্য যে বকরীটি কেনা হয়েছিল তা ছিল কুরবানীর জন্য। (২৮৫০) (আ.প্র. ৩৩৭১ শেষাংশ, ই.ফা. ৩৩৭৮ শেষাংশ)</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 146,
        "matchingArabicURN": 132721,
        "last_updated": null
    }
]