[
    {
        "banglaURN": 6049781,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": "",
        "babNumber": 2471,
        "babName": "",
        "hadithNumber": 4978,
        "hadithSanad": "",
        "hadithText": "আবূ সালামাহ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন,'আয়িশা ও ইব্‌নু ‘আব্বাস (রাঃ) বলেছেন, নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) মক্কায় দশ বছর অবস্থান করেন। এ সময় তাঁর প্রতি কুরআন অবতীর্ণ হয়েছে এবং মাদীনাহ্‌তেও দশ বছর (তাঁর প্রতি কুরআন অবতীর্ণ হয়েছে)।(আধুনিক প্রকাশনীঃ ৪৬০৯, ইসলামী ফাউন্ডেশনঃ ৪৬১৪)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 141750,
        "last_updated": null
    },
    {
        "banglaURN": 6049800,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2471,
        "babName": null,
        "hadithNumber": 4980,
        "hadithSanad": "",
        "hadithText": "আবূ ‘উসমান (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমাকে অবগত করা হয়েছে যে, একদা জিব্‌রীল (আঃ) নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)- এর কাছে আগমন করলেন। তখন উম্মু সালামাহ (রাঃ) তাঁর কাছে ছিলেন। জিবরীল (আঃ) তাঁর সাথে কথা বলতে আরম্ভ করলেন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) উম্মু সালামাহ (রাঃ)- কে জিজ্ঞেস করলেন, ইনি কে? অথবা তিনি এরকম কোন কথা জিজ্ঞেস করলেন। উম্মু সালামাহ (রাঃ) বললেন, ইনি দাহইয়া (রাঃ)। তারপর জিব্‌রীল (আঃ) উঠে দাঁড়ালেন। তিনি বললেন, আল্লাহ্‌র কসম, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)– এর ভাষণে জিব্‌রীল (আঃ)– এর খবর না শুনা পর্যন্ত আমি তাঁকে সে দাহইয়া (রাঃ)– ই মনে করেছি। অথবা তিনি (বর্ণনাকারী) সে রকম কোন কথা বর্ণনা করেছেন। বর্ণনাকারী মুতামির (রহঃ) বলেন, আমার পিতা (সুলাইমান) বলেছেন, আমি ‘উসমান (রহঃ)- কে জিজ্ঞেস করলাম, আপনি কার নিকট থেকে এ ঘটনা শুনেছেন? তিনি বললেন, উসামাহ ইব্‌নু যায়দের নিকট হতে।(আধুনিক প্রকাশনীঃ ৪৬১০, ইসলামী ফাউন্ডেশনঃ ৪৬১৫)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 141760,
        "last_updated": null
    },
    {
        "banglaURN": 6049810,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2471,
        "babName": null,
        "hadithNumber": 4981,
        "hadithSanad": "",
        "hadithText": "আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, প্রত্যেক নবীকে তাঁর যুগের প্রয়োজন মুতাবিক কিছু মুজিযা ‎দান করা হয়েছে, যা দেখে লোকেরা তাঁর প্রতি ঈমান এনেছে। আমাকে যে মুজিযা দেয়া হয়েছে তা হচ্ছে, ওয়াহী- যা আল্লাহ্‌ আমার ‎প্রতি অবতীর্ণ করেছেন। কাজেই আমি আশা করি, ক্বিয়ামাতের দিন তাদের অনুসারীদের অনুপাতে আমার অনুসারীদের সংখ্যা অনেক ‎অধিক হবে।[৭২৭৪; মুসলিম ১/৭০, হাঃ ১৫২, আহমাদ ৮৪৯৯] (আধুনিক প্রকাশনীঃ ৪৬১১, ইসলামী ফাউন্ডেশনঃ ৪৬১৬)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 141770,
        "last_updated": null
    },
    {
        "banglaURN": 6049820,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2471,
        "babName": null,
        "hadithNumber": 4982,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্‌নু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আল্লাহ তা’আলা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)– এর প্রতি ক্রমাগত ওয়াহী অবতীর্ণ করতে থাকেন এবং তাঁর ইন্তিকালের নিকটবর্তী সময়ে আল্লাহ্‌ তা’আলা তাঁর প্রতি সবচেয়ে বেশি পরিমাণ ওয়াহী অবতীর্ণ করেন। এরপর তাঁর ওফাত হয়। [মুসলিম ৫৪/হাঃ ৩০১৬] (আধুনিক প্রকাশনীঃ ৪৬১২, ইসলামী ফাউন্ডেশনঃ ৪৬১৭)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 141780,
        "last_updated": null
    },
    {
        "banglaURN": 6049830,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2471,
        "babName": null,
        "hadithNumber": 4983,
        "hadithSanad": "",
        "hadithText": "জুনদুব (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, একবার রসূলুল্লাহ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) অসুস্থ হলেন। ফলে এক কি দু’রাত তিনি উঠতে পারেন নি। এক মহিলা তাঁর কাছে এসে বলল, হে মুহাম্মাদ! আমার মনে হয়, তোমার শয়তান তোমাকে ত্যাগ করেছে। তখন আল্লাহ্‌ অবতীর্ণ করলেন, “শপথ পূর্বাহ্ণের, শপথ রাতের, যখন তা হয় নিঝুম। তোমার প্রতিপালক তোমাকে পরিত্যাগ করেননি এবং তোমার প্রতি বিরূপও হননি।”(আধুনিক প্রকাশনীঃ ৪৬১৩, ইসলামী ফাউন্ডেশনঃ ৪৬১৮)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 141790,
        "last_updated": null
    },
    {
        "banglaURN": 6049840,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2472,
        "babName": null,
        "hadithNumber": 4984,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্‌নু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, ‘উসমান (রাঃ) যায়দ ইব্‌নু সাবিত (রাঃ), সা’ঈদ ইব্‌নুল ‘আস (রাঃ), ‘আব্দুল্লাহ্‌ ইব্‌নু যুবায়র (রাঃ) এবং ‘আবদুর রহমান ইব্‌নু হারিস ইব্‌নু  হিশাম (রাঃ)– কে পবিত্র কুরআন গ্রন্থাগারে লিপিবদ্ধ করার জন্য আদেশ দিলেন এবং তাদেরকে বললেন, আল কুরআনের কোন শব্দের আরাবী হওয়ার ব্যাপারে যায়দ ইবনু সাবিতের সঙ্গে তোমাদের মতভেদ দেখা দিলে তোমরা তা কুরাইশদের ভাষায় লিপিবদ্ধ করবে। কারণ, কুরআন তাদের ভাষায় অবতীর্ণ হয়েছে। অতএব তাঁরা তা-ই করলেন।(আধুনিক প্রকাশনীঃ ৪৬১৪, ইসলামী ফাউন্ডেশনঃ ৪৬১৯)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 141800,
        "last_updated": null
    },
    {
        "banglaURN": 6049850,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2472,
        "babName": null,
        "hadithNumber": 4985,
        "hadithSanad": "",
        "hadithText": "ইয়ালা ইব্‌নু ‘উমাইয়াহ (রাঃ) থেকে বর্ণিতঃ তিনি বলতেন, হায়! রসূলুল্লাহ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)– এর প্রতি ওয়াহী অবতীর্ণ হওয়ার সময় যদি তাঁকে দেখতে পারতাম। যখন নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) ‘জিয়িররানা’ নামক স্থানে অবস্থান করছিলেন এবং চাঁদোয়া দিয়ে তাঁর উপর ছায়ার ব্যবস্থা করা হয়েছিল এবং তাঁর সঙ্গে ছিলেন কতিপয় সাহাবী। এমন সময় সুগন্ধি মেখে এক ব্যক্তি এলেন এবং বললেন, হে আল্লাহ্‌র রসূল! ঐ সম্পর্কে  আপনার মত কী, যে সুগন্ধি মেখে জুব্বা পরে ইহ্‌রাম বেঁধেছে? কিছু সময়ের জন্য নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) অপেক্ষা করলেন, এমনি সময় ওয়াহী এল। ‘উমার (রাঃ) ইয়ালা (রাঃ)– কে ইশারা দিয়ে ডাকলেন। ইয়ালা (রাঃ) এলেন এবং তাঁর মাথা ঐ চাদরের ভেতর ঢোকালেন। দেখলেন, রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) এর মুখমণ্ডল লাল রক্তিম বর্ণ এবং কিছু সময়ের জন্য বেশ জোরে জোরে শ্বাস-প্রশ্বাস গ্রহণ করছেন। তারপর তাঁর থেকে এ অবস্থা সম্পূর্ণরূপে দূর হওয়ার পর তিনি বললেন, প্রশ্নকারী কোথায় যে কিছুক্ষণ পূর্বে আমাকে ‘উমরাহ্‌ সম্পর্কে প্রশ্ন করেছিল? লোকটিকে খুঁজে নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)– এর নিকট নিয়ে আসা হল। নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বললেন, যে সুগন্ধি তুমি তোমার শরীরে মেখেছ, তা তিনবার ধুয়ে ফেলবে আর জুব্বাটি খুলে ফেলবে। তারপর তুমি তোমার ‘উমরাহ্‌তে ঐ সমস্ত কাজ করবে, যা তুমি হাজ্জের মধ্যে করে থাক।(আধুনিক প্রকাশনীঃ ৪৬১৫, ইসলামী ফাউন্ডেশনঃ ৪৬২০)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 141810,
        "last_updated": null
    },
    {
        "banglaURN": 6049860,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2473,
        "babName": null,
        "hadithNumber": 4986,
        "hadithSanad": "",
        "hadithText": "যায়দ ইব্‌নু সাবিত (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, ইয়ামামাহ্‌র যুদ্ধে বহু লোক শহীদ হবার পর আবূ বাক্‌র সিদ্দীক (রাঃ) আমাকে ডেকে পাঠালেন। এ সময় ‘উমার (রাঃ)– ও তাঁর কাছে উপস্থিত ছিলেন।  আবূ বকর (রাঃ) বললেন, ‘উমার (রাঃ) আমার কাছে এসে বললেন, ইয়ামামার যুদ্ধে শহীদদের মধ্যে কারীদের সংখ্যা অনেক। আমি আশংকা করছি, এমনিভাবে যদি কারীগণ শাহীদ হয়ে যান, তাহলে কুরআন মাজীদের বহু অংশ হারিয়ে যাবে। অতএব আমি মনে করি যে, আপনি কুরআন সংকলনের নির্দেশ দিন। উত্তরে আমি ‘উমার (রাঃ)– কে বললাম, যে কাজ আল্লাহ্‌র রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) করেননি, সে কাজ তুমি কীভাবে করবে? ‘উমার (রাঃ) জবাবে বললেন, আল্লাহ্‌র কসম! এটা একটি উত্তম কাজ। ‘উমার (রাঃ) এ কথাটি আমার কাছে বার বার বলতে থাকলে অবশেষে আল্লাহ্‌ তা’য়ালা এ কাজের জন্য আমার বক্ষকে উন্মোচন করে দিলেন এবং এ ব্যাপারে ‘উমার যা ভাল মনে করলেন আমিও তাই করলাম। যায়দ (রাঃ) বলেন, আবূ বাক্‌র সিদ্দীক (রাঃ) আমাকে বললেন, তুমি একজন বুদ্ধিমান যুবক। তোমার ব্যাপারে আমার কোন সংশয় নেই। তদুপরি তুমি রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর  ওয়াহীর লেখক ছিলে। সুতরাং তুমি কুরআন মাজীদের অংশগুলোকে তালাশ করে একত্রিত কর। আল্লাহ্‌র শপথ! তারা যদি আমাকে একটি পর্বত এক স্থান হতে অন্যত্র সরিয়ে ফেলার নির্দেশ দিত, তাহলেও তা আমার কাছে কুরআন সংকলনের নির্দেশের চেয়ে কঠিন বলে মনে হত না। আমি বললাম, যে কাজ রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) করেননি, আপনারা সে কাজ কীভাবে করবেন? তিনি বললেন, আল্লাহ্‌র কসম! এটা একটা কল্যাণকর কাজ। এ কথাটি আবূ বাক্‌র সিদ্দীক (রাঃ) আমার কাছে বার বার বলতে থাকেন, অবশেষে আল্লাহ্‌ আমার বক্ষকে উন্মোচন করে দিলেন সে কাজের জন্য, যে কাজের জন্য তিনি আবূ বাকর এবং ‘উমার (রাঃ)– এর বক্ষকে উন্মোচন করে দিয়েছিলেন। এরপর আমি কুরআন আনুসন্ধানের কাজে লেগে গেলাম এবং খেজুর পাতা, প্রস্তরখণ্ড ও মানুষের বক্ষ থেকে আমি তা সংগ্রহ করতে থাকলাম। এমন কি আমি সূরা তওবার শেষাংশ আবূ খুযায়মাহ আনসারী (রাঃ) থেকে সংগ্রহ করলাম। এ অংশটুকু তিনি বাদে আর কারো কাছে আমি পাইনি। আয়াতগুলো হচ্ছে এইঃ তোমাদের মধ্যে হতে তোমাদের কাছে এক রসূল এসেছে। তোমাদেরকে যা বিপন্ন করে তাঁর জন্য তা কষ্টদায়ক। সে তোমাদের মঙ্গলকামী, মু’মিনদের প্রতি সে দয়ার্দ্র ও পরম দয়ালু। এরপর তারা যদি মুখ ফিরিয়ে নেয় তবে তুমি বলো, আমার জন্য আল্লাহ্‌ই যথেষ্ট, তিনি ছাড়া অন্য কোন ইলাহ নেই। আমি তাঁরই উপর নির্ভর করি এবং তিনি মহা আরশের অধিপতি। (১২৮-১২৯) তারপর সঙ্কলিত সহীফাসমূহ মৃত্যু পর্যন্ত আবূ বকর (রাঃ)– এর কাছে রক্ষিত ছিল। তাঁর মৃত্যুর পর তা ‘উমার (রাঃ)- এর কাছে সংরক্ষিত ছিল, যতদিন তিনি জীবিত ছিলেন। অতঃপর তা ‘উমার (রাঃ)- এর কন্যা হাফসাহ (রাঃ)- এর কাছে সংরক্ষিত ছিল।(আধুনিক প্রকাশনীঃ ৪৬১৬, ইসলামী ফাউন্ডেশনঃ ৪৬২১)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 141820,
        "last_updated": null
    },
    {
        "banglaURN": 6049870,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2473,
        "babName": null,
        "hadithNumber": 4987,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্‌নু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, হুযাইফাহ ইব্‌নুল ইয়ামান (রাঃ) একবার ‘উসমান (রাঃ)- এর কাছে এলেন। এ সময় তিনি আরমিনিয়া ও আযারবাইজান বিজয়ের ব্যাপারে সিরীয় ও ইরাকী যোদ্ধাদের জন্য যুদ্ধ-প্রস্তুতির কাজে ব্যস্ত ছিলেন। কুরআন পাঠে তাঁদের মতবিরোধ হুযাইফাহ্‌কে ভীষণ চিন্তিত করল। সুতরাং তিনি ‘উসমান (রাঃ)- কে বললেন, হে আমীরুল মু’মিনীন! কিতাব সম্পর্কে ইয়াহূদী ও নাসারাদের মত মতপার্থক্যে লিপ্ত হবার পূর্বে এই উম্মতকে রক্ষা করুন। তারপর ‘উসমান (রাঃ) হাফসাহ (রাঃ)- এর কাছে এক ব্যক্তিকে এ বলে পাঠালেন যে, আপনার কাছে সংরক্ষিত কুরআনের সহীফাসমূহ আমাদের কাছে পাঠিয়ে দিন, যাতে আমরা সেগুলোকে পরিপূর্ণ মাসহাফসমূহে লিপিবদ্ধ করতে পারি। এরপর আমরা তা আপনার কাছে ফিরিয়ে দেব। হাফসাহ (রাঃ) তখন সেগুলো ‘উসমান (রাঃ)- এর কাছে পাঠিয়ে দিলেন। এরপর ‘উসমান (রাঃ) যায়দ ইবনু সাবিত (রাঃ) ‘আব্দুল্লাহ ইব্‌নু যুবায়র (রাঃ), সা’ঈদ ইব্‌নু আস (রাঃ) এবং ‘আবদুর রহমান ইব্‌নু হারিস ইব্‌নু হিশাম (রাঃ)- কে নির্দেশ দিলেন। তাঁরা মাসহাফে তা লিপিবদ্ধ করলেন। এ সময় ‘উসমান (রাঃ) তিনজন কুরাইশী ব্যাক্তিকে বললেন, কুরআনের কোন ব্যাপারে যদি যায়দ ইব্‌নু সাবিতের সঙ্গে তোমাদের মতভেদ দেখা দেয়, তাহলে তোমরা তা কুরাইশদের ভাষায় লিপিবদ্ধ করবে। কারণ, কুরআন তাদের ভাষায় নাযিল হয়েছে। সুতরাং তাঁরা তাই করলেন। যখন মূল লিপিগুলো থেকে কয়েকটি পরিপূর্ণ গ্রন্থ লেখা হয়ে গেল, তখন ‘উসমান (রাঃ) মূল লিপিগুলো হাফসাহ (রাঃ)- এর কাছে ফিরিয়ে দিলেন। তারপর তিনি কুরআনের লিখিত মাসহাফ-সমূহের  এক একখানা মাসহাফ এক এক প্রদেশে পাঠিয়ে দিলেন এবং এছাড়া আলাদা আলাদা বা একত্রিত কুরআনের যে কপিসমূহ রয়েছে তা জ্বালিয়ে দেয়ার নির্দেশ দিলেন।(আধুনিক প্রকাশনীঃ ৪৬১৭, ইসলামী ফাউন্ডেশনঃ ৪৬২২)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 141830,
        "last_updated": null
    },
    {
        "banglaURN": 6049880,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2473,
        "babName": null,
        "hadithNumber": 4988,
        "hadithSanad": "",
        "hadithText": "ইবনু শিহাব (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, খারিজাহ ইব্‌নু সাবিতের মাধ্যমে যায়দ ইব্‌নু সাবিত থেকে বর্ণনা করেন যে, তিনি বলেছেন, আমরা যখন গ্রন্থাকারে কুরআন লিপিবদ্ধ করছিলাম তখন সূরা আহযাবের একটি আয়াত আমার থেকে হারিয়ে যায়; অথচ আমি তা রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- কে পাঠ করতে শুনেছি। তাই আমরা খোঁজ করতে লাগলাম। শেষে আমরা তা খুযাইমাহ ইব্‌নু সাবিত আনসারী (রাঃ)- এর কাছে পেলাম। আয়াতটি হচ্ছে এইঃ “মু’মিনদের মধ্যে কতক আল্লাহ্‌র সঙ্গে কৃত ওয়াদা পূর্ণ করেছে। তাদের কেউ কেউ মৃত্যুবরণ করেছে এবং কেউ কেউ প্রতীক্ষা করছে। তারা তাদের সংকল্প মোটেই পরিবর্তন করেনি”- (সূরা আল-আহযাব ৩৩/২৩)। তারপর আমরা এ আয়াতটি সংশ্লিষ্ট সূরার সঙ্গে মাসহাফে লিপিবদ্ধ করলাম।(আধুনিক প্রকাশনীঃ ৪৬১৭, ইসলামী ফাউন্ডেশনঃ ৪৬২২)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 141840,
        "last_updated": null
    },
    {
        "banglaURN": 6049890,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2474,
        "babName": null,
        "hadithNumber": 4989,
        "hadithSanad": "",
        "hadithText": "যায়দ ইব্‌নু সাবিত (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আবূ বকর (রাঃ) আমাকে ডেকে পাঠালেন এবং বললেন, তুমি রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর ওয়াহী লিখতে। সুতরাং তুমি কুরআনের আয়াতগুলো খোঁজ কর। এরপর আমি খোঁজ করলাম। অবশেষে সূরা তওবার শেষ দু’টো আয়াত আমি আবূ খুযায়মা আনসারী (রাঃ)- এর কাছে পেলাম। তিনি ছাড়া আর কারো কাছে আমি এর সন্ধান পাইনি। আয়াত দু’টো হচ্ছে এইঃ “তোমাদের কাছে এসেছেন তোমাদেরই মধ্য থেকে একজন রসূল। তার পক্ষে অতি দুঃসহ-দুর্বহ সেসব বিষয় যা তোমাদেরকে বিপন্ন করে, তিনি তোমাদের অতিশয় হিতকামী, মু’মিনদের প্রতি বড়ই স্নেহশীল, খুবই দয়ালু। এতদসত্ত্বেও তারা যদি মুখ ফিরিয়ে নেয় তবে আপনি বলে দিন- আমার জন্য আল্লাহ্‌ই যথেষ্ট, তিনি ব্যতীত অন্য কোন মা’বুদ নেই। তাঁরই উপর আমি ভরসা করি এবং তিনি বিরাট আরশের অধিপতি”- (সূরা আত্‌-তাওবাহ ৯/১২৮-১২৯)।(আধুনিক প্রকাশনীঃ ৪৬১৮, ইসলামী ফাউন্ডেশনঃ ৪৬২৩)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 141850,
        "last_updated": null
    },
    {
        "banglaURN": 6049900,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2474,
        "babName": null,
        "hadithNumber": 4990,
        "hadithSanad": "",
        "hadithText": "বারাআ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, (আরবি) আয়াতটি অবতীর্ণ হলে নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বললেন, যায়দকে আমার কাছে ডেকে আন এবং তাকে বল সে যেন কাষ্ঠখণ্ড, দোয়াত এবং কাঁধের হাড় (রাবী বলেন- অথবা তিনি বলছেন, কাঁধের হাড় এবং দোয়াত) নিয়ে আসে। এরপর তিনি বললেন, লিখ। এ সময় অন্ধ সহাবী আম্‌র ইব্‌নু উম্মু মাকতূম (রাঃ) নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর পেছনে বসা ছিলেন। তিনি বললেন, আমি তো অন্ধ, আমার ব্যাপারে আপনার কী নির্দেশ? এ কথার প্রেক্ষিতে পূর্বোক্ত আয়াতের পরিবর্তে অবতীর্ণ হলঃ “সমান নয় সেসব মু’মিন যারা বিনা ওজরে ঘরে বসে থাকে এবং ঐসব মু’মিন যারা আল্লাহ্‌র পথে নিজেদের জানমাল দিয়ে জিহাদ করে” – (সূরা আন-নিসা ৪/৯৫)।(আধুনিক প্রকাশনীঃ ৪৬১৯, ইসলামী ফাউন্ডেশনঃ ৪৬২৪)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 141860,
        "last_updated": null
    },
    {
        "banglaURN": 6049910,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2475,
        "babName": null,
        "hadithNumber": 4991,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বলেছেন, জিব্‌রীল (আঃ) আমাকে একভাবে কুরআন শিক্ষা দিয়েছেন। এরপর আমি তাঁকে অন্যভাবে পাঠ করার জন্য অনুরোধ করতে লাগলাম এবং বার বার অন্যভাবে পাঠ করার জন্য ক্রমাগত অনুরোধ করতে থাকলে তিনি আমার জন্য তিলাওয়াতের পদ্ধতি বাড়িয়ে যেতে লাগলেন। অবশেষে তিনি সাত আঞ্চলিক ভাষায় তিলাওয়াত করে সমাপ্ত করলেন।(আধুনিক প্রকাশনীঃ ৪৬২০, ইসলামী ফাউন্ডেশনঃ ৪৬২৫)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 141870,
        "last_updated": null
    },
    {
        "banglaURN": 6049920,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2475,
        "babName": null,
        "hadithNumber": 4992,
        "hadithSanad": "",
        "hadithText": "‘উমার ইব্‌নুল খাত্তাব (রাঃ) থেকে বর্ণিতঃ তিনি বলেন,  আমি হিশাম ইব্‌নু হাকীম (রাঃ)- কে রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)– এর জীবদ্দশায় সূরা ফুরকান তিলাওয়াত করতে শুনেছি এবং গভীর মনোযোগ দিয়ে আমি তাঁর কিরাআত শুনেছি। তিনি বিভিন্নভাবে কিরায়াত পাঠ করেছেন; অথচ রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) আমাকে এভাবে শিক্ষা দেননি। এ কারণে সলাতের মাঝে আমি তার উপর ঝাঁপিয়ে পড়ার জন্য আমি উদ্যত হয়ে পড়েছিলাম, কিন্তু বড় কষ্টে নিজেকে সামলে নিলাম। তারপর সে সালাম ফিরালে আমি চাদর দিয়ে তার গলা পেঁচিয়ে ধরলাম এবং জিজ্ঞেস করলাম, তোমাকে এ সূরা যেভাবে পাঠ করতে শুনলাম, এভাবে তোমাকে কে শিক্ষা দিয়েছে? সে বলল, রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)– ই আমাকে এভাবে শিক্ষা দিয়েছেন। আমি বললাম, তুমি মিথ্যা বলছ। কারণ, তুমি যেভাবে পাঠ করেছ, এর থেকে ভিন্ন ভাবে রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) আমাকে শিক্ষা দিয়েছেন। এরপর আমি তাকে জোর করে টেনে রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)– এর কাছে নিয়ে গেলাম এবং বললাম, আপনি আমাকে সূরা ফুরকান যেভাবে পাঠ করতে শিখিয়েছেন এ লোককে আমি এর থেকে ভিন্নভাবে তা পাঠ করতে শুনেছি। এ কথা শুনে রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বললেন, তাকে ছেড়ে দাও। হিশাম, তুমি পাঠ করে শোনাও। তারপর সে সেভাবে পাঠ করে শোনাল, যেভাবে আমি তাঁকে পাঠ করতে শুনেছি। তখন আল্লাহ্‌র রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বললেন, এভাবেই অবতীর্ণ করা হয়েছে। এরপর বললেন, হে ‘উমার! তুমিও পড়। সুতরাং আমাকে তিনি যেভাবে শিক্ষা দিয়েছেন, সেভাবেই আমি পাঠ করলাম। এবারও রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বললেন, এভাবেও কুরআন অবতীর্ণ করা হয়েছে। এ কুরআন সাত আঞ্চলিক ভাষায় অবতীর্ণ করা হয়েছে। সুতরাং তোমাদের জন্য যা বেশি সহজ, সেভাবেই তোমরা পাঠ কর।(আধুনিক প্রকাশনীঃ ৪৬২১, ইসলামী ফাউন্ডেশনঃ ৪৬২৬)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 141880,
        "last_updated": null
    },
    {
        "banglaURN": 6049930,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2476,
        "babName": null,
        "hadithNumber": 4993,
        "hadithSanad": "",
        "hadithText": "ইউসুফ ইব্‌নু মাহিক (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি উম্মুল মু’মিনীন ‘আয়িশাহ (রাঃ)-এর কাছে ছিলাম। এমন সময় এক ইরাকী ব্যক্তি এসে তাঁকে জিজ্ঞেস করলঃ কোন্ ধরনের কাফন শ্রেষ্ঠ? তিনি বললেন, আফ্সোস তোমার প্রতি! এতে তোমার কী ক্ষতি? তারপর লোকটি বলল, হে উম্মুল মু’মিনীন! আমাকে আপনি আপনার কুরআনের কপি দেখান। তিনি বললেন, কেন? লোকটি বলল, এ তারতীবে কুরআনকে বিন্যস্ত করার জন্য। কারণ লোকেরা তাকে অবিন্যস্তভাবে পাঠ করে। ‘আয়িশাহ (রাঃ) বললেন, তোমরা এর যে অংশই আগে পাঠ কর না কেন, এতে তোমাদের কোন ক্ষতি নেই। (الْمُفَصَّلِ) মুফাস্সাল সূরাহ সমূহের মাঝে প্রথমত ঐ সূরাগুলো অবতীর্ণ হয়েছে যার মধ্যে জান্নাত ও জাহান্নামের উল্লেখ রয়েছে। তারপর যখন লোকেরা দলে দলে ইসলাম ধর্ম গ্রহণ করতে লাগল তখন হালাল-হারামের বিধান সম্বলিত সূরাগুলো অবতীর্ণ হয়েছে। যদি প্রথমেই এ আয়াত অবতীর্ণ হত যে, তোমরা মদ পান করো না, তাহলে লোকেরা বলত, আমরা কখনো মদপান ত্যাগ করব না। যদি শুরুতে অবতীর্ণ হতো তোমার ব্যভিচার করো না, তাহলে তারা বলত আমরা কখনো অবৈধ যৌনাচার ত্যাগ করব না। আমি যখন খেলাধূলার বয়সী একজন বালিকা তখন মক্কা্য় মুহাম্মাদ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর প্রতি নিম্নলিখিত আয়াতগুলো অবতীর্ণ হয়ঃ بَلِ السَّاعَةُ مَوْعِدُهُمْ وَالسَّاعَةُ أَدْهٰى وَأَمَرُّ  মানে, ‘‘অধিকন্তু ক্বিয়ামাত তাদের শাস্তির নির্ধারিত কাল এবং ক্বিয়ামাত হবে কঠিনতর ও তিক্ততর।’’ (বিধান সম্বলিত) সূরাহ বাকারাহ ও সূরাহ নিসা আমি রাসূল সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর সঙ্গে থাকাকালীন অবস্থায় অবতীর্ণ হয়। বর্ণনাকারী বলেন, এরপর ‘আয়িশাহ (রাঃ) তাঁর কাছে সংরক্ষিত কুরআনের কপি বের করলেন এবং সূরাসমূহ লেখালেন। [৪৮৭৬] (আধুনিক প্রকাশনীঃ ৪৬২২, ইসলামী ফাউন্ডেশনঃ ৪৬২৭)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 141890,
        "last_updated": null
    },
    {
        "banglaURN": 6049940,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2476,
        "babName": null,
        "hadithNumber": 4994,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু মাস’উদ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, তিনি সূরা বানী ইসরাঈল, সূরা কাহ্‌ফ, সূরা মারিয়াম, সূরা ত্বাহা এবং সূরা আম্বিয়া সম্পর্কে বলতেন যে, এগুলো হচ্ছে আমার সর্বপ্রথম সম্পদ এবং এগুলো আমার পুরাতন সম্পত্তি।(আধুনিক প্রকাশনীঃ ৪৬২৩, ইসলামী ফাউন্ডেশনঃ ৪৬২৮)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 141900,
        "last_updated": null
    },
    {
        "banglaURN": 6049950,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2476,
        "babName": null,
        "hadithNumber": 4995,
        "hadithSanad": "",
        "hadithText": "বারাআ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রাসূল সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম মদিনা্য় আসার পূর্বে আমি سَبِّحْ اسْمَ رَبِّكَ সূরাটি শিখেছি। (আধুনিক প্রকাশনীঃ ৪৬২৪, ইসলামী ফাউন্ডেশনঃ ৪৬২৯)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 141910,
        "last_updated": null
    },
    {
        "banglaURN": 6049960,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2476,
        "babName": null,
        "hadithNumber": 4996,
        "hadithSanad": "",
        "hadithText": "‘আব্দুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, সমপর্যায়ের ঐ সূরাগুলো সম্পর্কে আমি খুব অবগত আছি, যা নাবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম প্রতি রাক‘আতে জোড়া জোড়া পাঠ করতেন। তারপর ‘আবদুল্লাহ (রাঃ) দাঁড়ালেন এবং ‘আলক্বামাহ (রহ.) তাকে অনুসরণ করলেন। যখন ‘আলক্বামাহ (রহ.) বাড়ি থেকে বেরিয়ে আসলেন তখন আমরা তাকে জিজ্ঞেস করলাম। তিনি বললেন, এগুলো হচ্ছে মোট বিশটি সূরা, ইবনু মাস‘ঊদ (রাঃ)-এর সংকলন মুতাবিক মুফাস্সাল থেকে যার শুরু এবং যার শেষ হচ্ছে الْحَوَامِيْمُ অর্থাৎ ‘হামীম’ ‘আদ্দুখান’ এবং ‘আম্মা ইয়াতাসা আলুন’। [৭৭৫] (আধুনিক প্রকাশনীঃ ৪৬২৫, ইসলামী ফাউন্ডেশনঃ ৪৬৩০)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 141920,
        "last_updated": null
    },
    {
        "banglaURN": 6049970,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2477,
        "babName": null,
        "hadithNumber": 4997,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) কল্যাণের কাজে ছিলেন সর্বাধিক দানশীল, বিশেষভাবে রমাযান মাসে। (তাঁর দানশীলতার কোন সীমা ছিল না) কেননা, রমাযান মাসের শেষ পর্যন্ত প্রত্যেক রাত্রে জিব্‌রীল (আঃ) তাঁর সঙ্গে সাক্ষাৎ করতেন এবং তিনি তাঁকে কুরআন তিলাওয়াত করে শোনাতেন। যখন জিব্‌রীল (আঃ) তাঁর সঙ্গে সাক্ষাৎ করতেন তখন তিনি কল্যাণের জন্য প্রবাহমান বায়ুর চেয়েও বেশি দানশীল হতেন।(আধুনিক প্রকাশনীঃ ৪৬২৬, ইসলামী ফাউন্ডেশনঃ ৪৬৩১)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 141930,
        "last_updated": null
    },
    {
        "banglaURN": 6049980,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2477,
        "babName": null,
        "hadithNumber": 4998,
        "hadithSanad": "",
        "hadithText": "আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, প্রতি বছর জিব্‌রীল (আঃ) নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর সঙ্গে একবার কুরআন মাজীদ শোনাতেন ও শুনতেন। কিন্তু যে বছর তাঁর ওফাত হয় সে বছর তিনি রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- কে দু’বার শুনিয়েছেন। প্রতি বছর নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) রমাযানে দশ দিন ই’তিকাফ করতেন। কিন্তু যে বছর তাঁর ওফাত হয় সে বছর তিনি বিশ দিন ই’তিকাফ করেন।(আধুনিক প্রকাশনীঃ ৪৬২৭, ইসলামী ফাউন্ডেশনঃ ৪৬৩২)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 141940,
        "last_updated": null
    },
    {
        "banglaURN": 6049990,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2478,
        "babName": null,
        "hadithNumber": 4999,
        "hadithSanad": "",
        "hadithText": "মাসরুক (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, ‘আবদুল্লাহ্ ইব্‌নু আম্‌র ‘আবদুল্লাহ্ ইব্‌নু মাসউদের কথা উল্লেখ পূর্বক বলেছেন, আমি তাঁকে ঐ সময় থেকে ভালবাসি, যখন নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) -কে আমি বলতে শুনেছি যে, তোমরা চার ব্যক্তি থেকে কুরআন শিক্ষা কর- ‘আবদুল্লাহ্ ইব্‌নু মাস’উদ (রাঃ), সালিম (রাঃ), মু’আয (রাঃ) এবং উবাই ইব্‌নু কা’ব (রাঃ)। (আধুনিক প্রকাশনীঃ ৪৬২৮, ইসলামী ফাউন্ডেশনঃ ৪৬৩৩)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 141950,
        "last_updated": null
    },
    {
        "banglaURN": 6050000,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2478,
        "babName": null,
        "hadithNumber": 5000,
        "hadithSanad": "",
        "hadithText": "শাকীক ইব্‌ন সালামাহ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, একদা ‘আবদুল্লাহ্ ইব্‌নু মাস’উদ (রাঃ) আমাদের সামনে ভাষণ দিলেন এবং বললেন, আল্লাহ্‌র শপথ! সত্তরেরও কিছু অধিক সূরা আমি রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর মুখ থেকে হাসিল করেছি। আল্লাহ্‌র কসম! নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর সহাবীরা জানেন, আমি তাঁদের চেয়ে আল্লাহ্‌র কিতাব সম্বন্ধে অধিক জ্ঞাত; অথচ আমি তাঁদের মধ্যে সর্বোত্তম নই। শাকীক (রহঃ) বলেন, সাহাবীগণ তাঁর কথা শুনে কী বলেন তা শোনার জন্য আমি মাজলিসে বসে থাকলাম, কিন্তু আমি কাউকে অন্যরকম কথা বলে আপত্তি করতে শুনিনি।(আধুনিক প্রকাশনীঃ ৪৬২৯, ইসলামী ফাউন্ডেশনঃ ৪৬৩৪)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 141960,
        "last_updated": null
    },
    {
        "banglaURN": 6050010,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2478,
        "babName": null,
        "hadithNumber": 5001,
        "hadithSanad": "",
        "hadithText": "‘আলক্বামাহ (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা হিম্‌স শহরে ছিলাম। এ সময় ইব্‌নু মাস’উদ (রাঃ) সূরা ইউসুফ তিলাওয়াত করলেন। তখন এক ব্যক্তি বললেন, এটা এভাবে অবতীর্ণ হয়নি। এ কথা শুনে ইব্‌নু মাস’উদ (রাঃ) বললেন, আমি রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর সামনে এ সূরা তিলাওয়াত করেছি। তিনি বলেছেন, তুমি সুন্দর পড়েছ। এ সময় তিনি ঐ লোকটির মুখ থেকে মদের গন্ধ পেলেন। তাই তিনি তাকে বললেন, তুমি আল্লাহ্‌র কিতাব সম্পর্কে মিথ্যা বলা এবং মদ পানের অপরাধ এক সঙ্গে করেছ? এরপর তিনি তার ওপর নির্ধারিত শাস্তি জারি করলেন।(আধুনিক প্রকাশনীঃ ৪৬৩০, ইসলামী ফাউন্ডেশনঃ ৪৬৩৫)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 141970,
        "last_updated": null
    },
    {
        "banglaURN": 6050020,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2478,
        "babName": null,
        "hadithNumber": 5002,
        "hadithSanad": "",
        "hadithText": "মাসরুক (রহঃ) থেকে বর্ণিতঃ ‘আবদুল্লাহ্ (রাঃ) বলেন, আল্লাহ্‌র কসম! যিনি ছাড়া কোন ইলাহ্‌ নেই, আল্লাহ্‌র কিতাবের অবতীর্ণ প্রতিটি সূরা সম্পর্কেই আমি জানি যে, তা কোথায় অবতীর্ণ হয়েছে এবং প্রতিটি আয়াত সম্পর্কেই আমি জানি যে, তা কোন্ ব্যাপারে অবতীর্ণ হয়েছে। আমি যদি জানতাম যে, কোন ব্যক্তি আল্লাহ্‌র কিতাব সম্পর্কে আমার চেয়ে অধিক জ্ঞাত এবং সেখানে উট পৌঁছতে পারে, তাহলে সওয়ার হয়ে সেখানে পৌঁছে যেতাম।(আধুনিক প্রকাশনীঃ ৪৬৩১, ইসলামী ফাউন্ডেশনঃ ৪৬৩৬)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 141980,
        "last_updated": null
    },
    {
        "banglaURN": 6050030,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2478,
        "babName": null,
        "hadithNumber": 5003,
        "hadithSanad": "",
        "hadithText": "ক্বাতাদাহ (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আনাস ইব্‌নু মালিক (রাঃ)- কে জিজ্ঞেস করলাম, নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর সময় কোন্ কোন্ ব্যক্তি কুরআন সংগ্রহ করেছেন? তিনি বললেন, চারজন এবং তাঁরা চারজনই ছিলেন আনসার সহাবী। তাঁরা হলেনঃ উবাই ইব্‌নু কা’ব (রাঃ), মু’আয ইব্‌নু জাবাল (রাঃ), যায়দ ইব্‌নু সাবিত (রাঃ) এবং আবূ যায়দ (রাঃ)। (অন্য সানাদে) ফাদল (রহঃ) ..... আনাস ইব্‌নু মালিক (রাঃ) থেকে এ রকমই বর্ণনা করেছেন।(আধুনিক প্রকাশনীঃ ৪৬৩২, ইসলামী ফাউন্ডেশনঃ ৪৬৩৭)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 141990,
        "last_updated": null
    },
    {
        "banglaURN": 6050040,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2478,
        "babName": null,
        "hadithNumber": 5004,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) ইন্তিকাল করলেন। তখন চারজন ব্যতীত আর কেউ কুরআন সংগ্রহ করেননি। তাঁরা হলেন আবুদ্ দারদা (রাঃ), মু’আয ইব্‌নু জাবাল (রাঃ), যায়দ ইব্‌নু সাবিত (রাঃ) এবং আবূ যায়দ (রাঃ)। আনাস (রাঃ) বলেন, আমরা আবূ যায়দ (রাঃ)- এর উত্তরসুরী।(আধুনিক প্রকাশনীঃ ৪৬৩৩, ইসলামী ফাউন্ডেশনঃ ৪৬৩৮)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 142000,
        "last_updated": null
    },
    {
        "banglaURN": 6050050,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2478,
        "babName": null,
        "hadithNumber": 5005,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, ‘উমার (রাঃ) বলেছেন, ‘আলী (রাঃ) আমাদের মধ্যে সর্বোত্তম বিচারক এবং উবাই (রাঃ) আমাদের মধ্যে সর্বোত্তম কারী। এতদ্‌সত্ত্বেও তিনি যা তিলাওয়াত করেছেন, আমরা তার কিছু অংশ বাদ দিই, অথচ তিনি বলছেন, আমি তা আল্লাহ্‌র রাসূলের যবান থেকে শুনেছি, কোন কিছুর বিনিময়ে আমি তা ত্যাগ করব না। আল্লাহ্‌ বলেছেন, “আমি কোন আয়াত রহিত করলে কিংবা ভুলিয়ে দিলে তা হতে উত্তম কিংবা তার মত কোন আয়াত এনে দিই।” (আধুনিক প্রকাশনীঃ ৪৬৩৪, ইসলামী ফাউন্ডেশনঃ ৪৬৩৯)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 142010,
        "last_updated": null
    },
    {
        "banglaURN": 6050060,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2479,
        "babName": null,
        "hadithNumber": 5006,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ ইব্‌নু মু’আল্লা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি সলাত আদায়রত ছিলাম। নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) আমাকে ডাকলেন; কিন্তু আমি তাঁর ডাকে সাড়া দিলাম না। পরে আমি বললাম, হে আল্লাহ্‌র রসূল! আমি সলাত আদায়রত ছিলাম। তিনি বললেন, আল্লাহ্‌ তা’আলা কি বলেননি, “হে মু’মিনগণ! আল্লাহ্‌ ও রসূল যখন তোমাদেরকে আহবান করেন তখন আল্লাহ্‌ ও রসূলের আহবানে সাড়া দাও”। (সূরা আল-আনফাল ৮/২৪) \nতারপর তিনি বললেন, তোমার মাসজিদ থেকে বের হওয়ার আগে আমি কি তোমাকে কুরআনের সর্বশ্রেষ্ঠ সূরা শিক্ষা দেব না? তখন তিনি আমারা হাত ধরলেন। যখন আমরা মাসজিদ থেকে বের হতে ইচ্ছা করলাম তখন আমি বললাম, আপনি তো বলেছেন মাসজিদ থেকে বের হওয়ার আগে আমাকে কুরআনের সর্বশ্রেষ্ঠ সূরার কথা বলবেন। তিনি বললেন, সেটা হলঃ “আল হামদুলিল্লাহ রাব্বিল ‘আলামীন”। এটা পুনঃ পুনঃ পঠিত সাতটি আয়াত এবং কুরআন আজীম যা আমাকে দেয়া হয়েছে।(আধুনিক প্রকাশনীঃ ৪৬৩৫, ইসলামী ফাউন্ডেশনঃ ৪৮৪০)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 142020,
        "last_updated": null
    },
    {
        "banglaURN": 6050070,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2479,
        "babName": null,
        "hadithNumber": 5007,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ খুদরী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, একবার আমরা সফরে চলছিলাম। (পথিমধ্যে) অবতরণ করলাম। তখন একটি বালিকা এসে বলল, এখানকার গোত্রের সরদারকে সাপে কেটেছে। আমাদের পুরুষগণ বাড়িতে নেই। অতএব, আপনাদের মধ্যে এমন কেউ আছেন কি, যিনি ঝাড়-ফুঁক  করতে পারেন? তখন আমাদের মধ্য থেকে একজন ঐ বালিকাটির সঙ্গে গেলেন। যদিও আমরা ভাবিনি যে সে ঝাড়-ফুঁক জানে। এরপর সে ঝাড়-ফুঁক করল এবং গোত্রের সরদার সুস্থ হয়ে উঠল। এতে সর্দার খুশী হয়ে তাকে ত্রিশটি বক্‌রী দান করলেন এবং আমাদের সকলকে দুধ পান করালেন। ফিরে আসার পথে আমারা জিজ্ঞেস করলাম, তুমি ভালভাবে ঝাড়-ফুঁক করতে জান (অথবা রাবীর সন্দেহ) তুমি কি ঝাড়-ফুঁক করতে পার? সে উত্তর করল, না, আমি তো কেবল উম্মুল কিতাব- সূরা ফাতিহা দিয়েই ঝাড়-ফুঁক করেছি। আমরা তখন বললাম, যতক্ষণ না আমরা নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর কাছে পৌছে তাঁকে জিজ্ঞেস করি ততক্ষণ কেউ কিছু বলবে না। এরপর আমরা মদিনায় পৌছে নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর কাছে ঘটনাটি বললাম। তিনি বললেন, সে কেমন করে জানল যে, তা (সূরা ফাতিহা) রোগ আরোগ্যের জন্য ব্যবহার করা যেতে পারে? তোমরা নিজেদের মধ্যে এগুলো বন্টন করে নাও এবং আমার জন্যও একটা ভাগ রেখো। আবূ মা’মার ..... আবূ সা’ঈদ থেকে এ রকমই বর্ণনা করেছেন।(আধুনিক প্রকাশনীঃ ৪৬৩৬, ইসলামী ফাউন্ডেশনঃ ৪৬৪১)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 142030,
        "last_updated": null
    },
    {
        "banglaURN": 6050080,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2480,
        "babName": null,
        "hadithNumber": 5008,
        "hadithSanad": "",
        "hadithText": "আবূ মাস’উদ (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) হতে বর্ণিত। তিন বলেন, যে দু’টি আয়াত  তিলাওয়াত করে .....। (আধুনিক প্রকাশনীঃ ৪৬৩৭, ইসলামী ফাউন্ডেশনঃ ৪৬৪২)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 142050,
        "last_updated": null
    },
    {
        "banglaURN": 6050090,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2480,
        "babName": null,
        "hadithNumber": 5009,
        "hadithSanad": "",
        "hadithText": "আবূ মাস’উদ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বলেছেন, কেউ যদি রাতে সূরা বাকারার শেষ দু’টি আয়াত পাঠ করে, সেটাই তার জন্য যথেষ্ট। (আধুনিক প্রকাশনীঃ ৪৬৩৭, ইসলামী ফাউন্ডেশনঃ ৪৬৪২)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 142060,
        "last_updated": null
    },
    {
        "banglaURN": 6050100,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2480,
        "babName": null,
        "hadithNumber": 5010,
        "hadithSanad": "",
        "hadithText": "আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রসূলুল্লাহ্ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) আমাকে রমাযানে যাকাতের মাল হিফাজতের দায়িত্ব দিলেন। এক সময় এক ব্যক্তি এসে খাদ্য-সামগ্রী উঠিয়ে নেয়ার উপক্রম করল। আমি তাকে ধরে ফেললাম এবং বললাম, আমি তোমাকে আল্লাহ্‌র নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) - এর কাছে নিয়ে যাব। এরপর পুরো হাদীস বর্ণনা করেন। তখন লোকটি বলল, যখন আপনি ঘুমাতে যাবেন, তখন আয়াতুল কুরসী পাঠ করবেন। এর কারণে আল্লাহ্‌র পক্ষ থেকে একজন পাহারাদার নিযুক্ত হবে এবং ভোর পর্যন্ত শয়তান আপনার কাছে আসতে পারবে না। নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) (ঘটনা শুনে) বললেন, (যে তোমার কাছে এসেছিল) সে সত্য কথা বলেছে, যদিও সে বড় মিথ্যাচারী শায়ত্বন।(আধুনিক প্রকাশনীঃ ৪৬৩৮, ইসলামী ফাউন্ডেশনঃ ৪৬৪২)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 142070,
        "last_updated": null
    },
    {
        "banglaURN": 6050110,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2481,
        "babName": null,
        "hadithNumber": 5011,
        "hadithSanad": "",
        "hadithText": "বারাআ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, এক ব্যক্তি ‘সূরা কাহ্‌ফ’ তিলাওয়াত করছিলেন। তার ঘোড়াটি দু’টি রশি দিয়ে তার পাশে বাঁধা ছিল। তখন এক টুকরো মেঘ এসে তার উপর ছায়া দান করল। মেঘখণ্ড ক্রমেই নিচের দিকে নেমে আসতে লাগল। আর তার ঘোড়াটি ভয়ে লাফালাফী শুরু করে দিল। সকাল বেলা যখন লোকটি নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর কাছে উক্ত ঘটনার কথা ব্যক্ত করেন, তখন তিনি বললেন, এ ছিল আস্‌সাকিনা (প্রশান্তি), যা কুরআন তিলাওয়াতের কারণে নাযিল হয়েছিল।(আধুনিক প্রকাশনীঃ ৪৬৩৯, ইসলামী ফাউন্ডেশনঃ ৪৬৪৩)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 142080,
        "last_updated": null
    },
    {
        "banglaURN": 6050120,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2482,
        "babName": null,
        "hadithNumber": 5012,
        "hadithSanad": "",
        "hadithText": "আসলাম (রাঃ) থেকে বর্ণিতঃ রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম কোন এক সফরে রাত্রিকালে চলছিলেন এবং ‘উমার ইবনুল খাত্তাব (রাঃ) তাঁর সঙ্গে ছিলেন। তখন ‘উমার (রাঃ) তাঁর কাছে কিছু জিজ্ঞেস করলেন; কিন্তু রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম তার কোন উত্তর দিলেন না। তারপর আবার জিজ্ঞেস করলেন; কিন্তু তিনি কোন উত্তর দিলেন না। পুনরায় জিজ্ঞেস করলেন, এবারও তিনি কোন উত্তর দিলেন না। এমন সময় ‘উমার (রাঃ) নিজেকে উদ্দেশ্য করে বললেনঃ তোমার মা তোমাকে হারিয়ে ফেলুক! তুমি রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর কাছে তিনবার প্রশ্ন করে কোন উত্তর পাওনি। ‘উমার (রাঃ) বললেন, এরপর আমি আমার উটকে দ্রুত হাঁকিয়ে লোকেদের অগ্রভাগে চলে গেলাম এবং আমি শঙ্কিত হলাম, না জানি আমার সম্পর্কে কুরআন অবতীর্ণ হয় নাকি। কিছুক্ষণ পর কেউ আমাকে ডাকছে, এ রকম আওয়াজ শুনতে পেলাম। আমি মনে আশংকা করলাম যে, হয়তো আমার ব্যাপারে কুরআন অবতীর্ণ হয়েছে। তখন আমি নাবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম-এর নিকটে গেলাম এবং তাঁকে সালাম করলাম। তিনি বললেন আজ রাতে আমার উপর এমন একটি  সূরাহ নাযিল হয়েছে, যা আমার কাছে সূর্যালোকিত সকল স্থান হতে উত্তম। এরপর তিনি পাঠ করলেন, إِنَّا فَتَحْنَا لَكَ فَتْحًا مُّبِيْنً ‘‘নিশ্চয় আমি তোমাকে সুস্পষ্ট বিজয় দান করেছি।’’ [৪১৭৭] (আধুনিক প্রকাশনীঃ ৪৬৪০, ইসলামী ফাউন্ডেশনঃ ৪৬৪৪)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 142090,
        "last_updated": null
    },
    {
        "banglaURN": 6050130,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2483,
        "babName": null,
        "hadithNumber": 5013,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ খুদরী (রাঃ) থেকে বর্ণিতঃ এক ব্যক্তি আরেক ব্যক্তিকে ‘কুল হুআল্লাহু আহাদ’ পড়তে শুনলেন। সে বার বার তা মুখে উচ্চারণ করছিল। পরদিন সকালে তিনি রসূলুল্লাহ্ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর কাছে এসে এ ব্যাপারে বললেন। যেন ঐ ব্যক্তি তাকে কম মনে করলেন। তখন রসূলুল্লাহ্ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বললেন, সেই সত্তার কসম, যাঁর হাতে আমার জীবন। এ সূরা হচ্ছে সমগ্র কুরআনের এক-তৃতীয়াংশের সমান।(আধুনিক প্রকাশনীঃ ৪৬৪১, ইসলামী ফাউন্ডেশনঃ ৪৬৪৫)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 142100,
        "last_updated": null
    },
    {
        "banglaURN": 6050140,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2483,
        "babName": null,
        "hadithNumber": 5014,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ খুদরী (রাঃ) থেকে বর্ণিতঃ আমার ভাই ক্বাতাদাহ ইব্‌নু নু’মান আমাকে বলেছেন, রসূলুল্লাহ্ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) - এর জীবদ্দশায় এক ব্যক্তি শেষ রাতে সলাতে “কুল হুআল্লাহু আহাদ” ব্যতীত আর কোন সূরাই তিলাওয়াত করেননি। পরদিন সকালে লোকটি নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর কাছে আসলেন। বাকী অংশ আগের হাদীসের মত। (আধুনিক প্রকাশনীঃ ৪৬৪১, ইসলামী ফাউন্ডেশনঃ ৪৬৪৫)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 142110,
        "last_updated": null
    },
    {
        "banglaURN": 6050150,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2483,
        "babName": null,
        "hadithNumber": 5015,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ খুদরী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) তাঁর সহাবীদেরকে বলেছেন, তোমাদের কেউ কি এক রাতে কুরআনের এক-তৃতীয়াংশ তিলাওয়াত করা সাধ্যাতীত মনে কর? এ প্রশ্ন তাদের জন্য কঠিন ছিল। এরপর তারা বলল, হে আল্লাহ্‌র রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)! আমাদের মধ্যে কার সাধ্য আছে যে এটা পারবে? তখন তিনি বললেন, “কুল হুআল্লাহু আহাদ” অর্থাৎ সূরা ইখলাস কুরআনের তিন ভাগের এক ভাগ।(আধুনিক প্রকাশনীঃ ৪৬৪২, ইসলামী ফাউন্ডেশনঃ ৪৬৪৬)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 142120,
        "last_updated": null
    },
    {
        "banglaURN": 6050160,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2484,
        "babName": null,
        "hadithNumber": 5016,
        "hadithSanad": "",
        "hadithText": "'আয়িশা (রাঃ) থেকে বর্ণিতঃ যখনই নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) অসুস্থ হতেন তখনই তিনি ‘সূরায়ে মু’আব্বিযাত’ পড়ে নিজের উপর ফুঁক দিতেন। যখন রোগ কঠিন হয়ে গেল, তখন বাকাত অর্জনের জন্য আমি এই সূরা পাঠ করে তাঁর হাত দিয়ে শরীর মাসহ্ করিয়ে দিতাম।(আধুনিক প্রকাশনীঃ ৪৬৪৩, ইসলামী ফাউন্ডেশনঃ ৪৬৪৭)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 142140,
        "last_updated": null
    },
    {
        "banglaURN": 6050170,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2484,
        "babName": null,
        "hadithNumber": 5017,
        "hadithSanad": "",
        "hadithText": "'আয়িশা (রাঃ) থেকে বর্ণিতঃ প্রতি রাতে নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বিছানায় যাওয়ার প্রাক্কালে সূরা ইখ্‌লাস, সূরা ফালাক ও সূরা নাস পাঠ করে দু’হাত একত্র করে হাতে ফুঁক দিয়ে যতদূর সম্ভব সমস্ত শরীরে হাত বুলাতেন। মাথা ও মুখ থেকে আরম্ভ করে তাঁর দেহের সম্মুখ ভাগের উপর হাত বুলাতেন এবং তিনবার এরূপ করতেন।(আধুনিক প্রকাশনীঃ ৪৬৪৪, ইসলামী ফাউন্ডেশনঃ ৪৬৪৮)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 142150,
        "last_updated": null
    },
    {
        "banglaURN": 6050180,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2485,
        "babName": null,
        "hadithNumber": 5018,
        "hadithSanad": "",
        "hadithText": "লায়স (রহঃ) উসাইদ ইব্‌নু হুযায়র (রাঃ) থেকে বর্ণিতঃ একদা রাত্রে তিনি সূরা বাকারা পাঠ করছিলেন। তখন তাঁর ঘোড়াটি তারই পাশে বাঁধা ছিল। হঠাৎ ঘোড়াটি ভীত হয়ে লাফ দিয়ে উঠল এবং ছুটাছুটি শুরু করল। যখন পাঠ বন্ধ করলেন তখনই ঘোড়াটি শান্ত হল। আবার পাঠ শুরু করলেন। ঘোড়াটি আগের মত  করল। যখন পাঠ বন্ধ করলেন ঘোড়াটি শান্ত হল। আবার পাঠ আরম্ভ করলে ঘোড়াটি আগের মত করতে লাগল। এ সময় তাঁর পুত্র ইয়াহইয়া ঘোড়াটির নিকট ছিল। তার ভয় হচ্ছিল যে, ঘোড়াটি তার পুত্রকে পদদলিত করবে। তখন তিনি পুত্রকে টেনে আনলেন এবং আকাশের দিকে তাকিয়ে কিছু দেখতে পেলেন। পরদিন সকালে তিনি রসুলুল্লাহ্‌ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর কাছে উক্ত ঘটনা বললেন। ঘটনা শুনে নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বললেনঃ হে ইব্‌নু হুদায়র (রাঃ)! তুমি যদি পাঠ করতে, হে ইব্‌নু হুদায়র (রাঃ)! তুমি যদি পাঠ করতে! ইব্‌নু হুদায়র আরয করলেন, আমার ছেলেটি ঘোড়ার নিকট থাকায় আমি ভয় পেয়ে গেলাম হয়ত বা ঘোড়াটি তাকে পদদলিত করবে, সুতরাং আমি আমার মাথা উপরে উঠাতেই মেঘের মত কিছু দেখলাম, যা আলোর মত ছিল। আমি যখন বাইরে এলাম তখন আর কিছু দেখ্‌লাম না। তখন নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বললেন, তুমি কি জান, ওটা কি ছিল? বললেন না। তখন নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বললেন, তারা ছিল মালায়িকাহ। তোমার তিলাওয়াত শুনে তোমার কাছে এসেছিল। তুমি যদি সকাল পর্যন্ত তিলাওয়াত করতে তারাও ততক্ষণ পর্যন্ত এখানে অবস্থান করত এবং লোকেরা তাদেরকে দেখতে পেত। এরপর হাদিসের অন্য একটি সনদ বর্ণিত হয়েছে।[মুসলিম ৬/৩৬, হাঃ ৭৯৬, আহমাদ ১১৭৬৬] (আধুনিক প্রকাশনীঃ অনুচ্ছেদ, ইসলামী ফাউন্ডেশনঃ অনুচ্ছেদ)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 142160,
        "last_updated": null
    },
    {
        "banglaURN": 6050190,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2486,
        "babName": null,
        "hadithNumber": 5019,
        "hadithSanad": "",
        "hadithText": "‘আবদুল আযীয ইব্‌নু রুফাই’ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি এবং শাদ্দাদ ইব্‌নু মা‘কিল ইব্‌নু ‘আব্বাস (রাঃ)- এর নিকট উপস্থিত হলাম। শাদ্দাদ ইব্‌নু মা‘কিল তাকে জিজ্ঞেস করলেন, নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) কুরআন বাদে অন্য কিছু রেখে যাননি? ইব্‌নু 'আব্বাস (রাঃ) উত্তর দিলেন, নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) দুই মলাটের মাঝে যা কিছু আছে অর্থাৎ কুরআন ছাড়া অন্য কিছু রেখে যাননি। 'আবদুল আযীয বললেন, আমরা মুহাম্মাদ ইব্‌নুল হানাফিয়ার নিকট গিয়ে তাঁকে জিজ্ঞেস করলে তিনিই বললেন যে, দুই মলাটের মাঝে (যা আছে তা) ব্যতীত আর কিছু রেখে যাননি।(আধুনিক প্রকাশনীঃ ৪৬৪৫, ইসলামী ফাউন্ডেশনঃ ৪৬৪৯)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 142170,
        "last_updated": null
    },
    {
        "banglaURN": 6050200,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2487,
        "babName": null,
        "hadithNumber": 5020,
        "hadithSanad": "",
        "hadithText": "আবূ মূসা আশ‘আরী (রাঃ) সূত্রে নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেন, যে ব্যক্তি কুরআন তিলাওয়াত করে, তার দৃষ্টান্ত হচ্ছে এ লেবুর মত যা সুস্বাদু এবং সুগন্ধযুক্ত। আর যে ব্যক্তি (মু’মিন) কুরআন পাঠ করে না, তাঁর দৃষ্টান্ত হচ্ছে এমন খেজুরের মত, যা সুগন্ধহীন, কিন্তু খেতে সুস্বাদু। আর ফাসিক-ফাজির ব্যক্তি যে কুরআন পাঠ করে, তাঁর দৃষ্টান্ত হচ্ছে রায়হান জাতীয় লতার মত, যার সুগন্ধ আছে, কিন্তু খেতে বিস্বাদ। আর ঐ ফাসিক যে কুরআন একেবারেই পাঠ করে না, তার দৃষ্টান্ত হচ্ছে ঐ মাকাল ফলের মত, যা খেতেও বিস্বাদ এবং যার কোন সুগন্ধও নেই। (আধুনিক প্রকাশনীঃ ৪৬৪৬, ইসলামী ফাউন্ডেশনঃ ৪৬৫০)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 142180,
        "last_updated": null
    },
    {
        "banglaURN": 6050210,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2487,
        "babName": null,
        "hadithNumber": 5021,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘উমার (রাঃ) সূত্রে নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেন, অতীতের জাতিসমুহের সঙ্গে তোমাদের জীবনকালের তুলনা হচ্ছে আসর ও মাগরিবের সলাতের মধ্যবর্তী সময়কালের মত। তোমাদের এবং ইয়াহূদী-নাসারাদের দৃষ্টান্ত হচ্ছে ঐ ব্যক্তির ন্যায়, যে শ্রমিকদের কাজে নিযুক্ত করে তাদেরকে বলল, “তোমাদের মধ্যে কে এক কীরাতের বিনিময়ে দ্বি-প্রহর পর্যন্ত কাজ করবে?” ইয়াহূদীরা কাজ করল। তারপর সেই ব্যক্তি আবার বলল, তোমাদের মধ্যে কে এক কীরাতের বিনিময়ে দুপুর থেকে আসর পর্যন্ত কাজ করবে? নাসারারা কাজ করল। এরপর তোমরা (মুসলিমরা) আসরের সালাতের পর থেকে মাগরিব পর্যন্ত প্রত্যেকে দু’ কীরাতের বিনিময় কাজ করেছ। তারা বলল, আমরা কম মজুরী নিয়েছি এবং অধিক কাজ করেছি। তিনি (আল্লাহ্‌) বললেন, আমি কি তোমাদের অধিকারের ব্যপারে যুল্‌ম করেছি? তারা উত্তরে বলবে, না। এরপর আল্লাহ্‌ বলবেন, এটা আমার দয়া, আমি যাকে ইচ্ছে দিয়ে থাকি।(আধুনিক প্রকাশনীঃ ৪৬৪৭, ইসলামী ফাউন্ডেশনঃ ৪৬৫১)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 142190,
        "last_updated": null
    },
    {
        "banglaURN": 6050220,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2488,
        "babName": null,
        "hadithNumber": 5022,
        "hadithSanad": "",
        "hadithText": "ত্বলহা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি ‘আবদুল্লাহ্‌ ইব্‌নু আবূ ‘আওফা (রাঃ)– কে  জিজ্ঞেস করলাম, নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) কি কোন ওয়াসিয়্যাত করে গেছেন? তিনি বললেন, না। তখন আমি বললাম, যখন নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) নিজে কোন ওয়াসিয়্যাত করে যাননি, তখন কী করে মানুষের জন্য ওয়াসিয়্যাত করাকে (কুরাআন মাজীদে) বাধ্যতামূলক করা হল এবং তাদেরকে এজন্য নির্দেশ দেয়া হল। জবাবে তিনি বললেন, তিনি (নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)] আল্লাহ্‌র কিতাব (অনুসরণ)– এর ওয়াসিয়্যাত করে গেছেন।(আধুনিক প্রকাশনীঃ ৪৬৪৮, ইসলামী ফাউন্ডেশনঃ ৪৬৫২)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 142200,
        "last_updated": null
    },
    {
        "banglaURN": 6050230,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2489,
        "babName": null,
        "hadithNumber": 5023,
        "hadithSanad": "",
        "hadithText": "আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বলেছেন, আল্লাহ তা’আলা কোন বিষয়ের প্রতি ঐরূপ কান লাগিয়ে শুনেন না যেরূপ তিনি নবীর সুমধুর তিলাওয়াত শুনেন। রাবী বলেন, এর অর্থ সুস্পষ্ট করে আওয়াজের সঙ্গে কুরআন পাঠ করা। [৫০২৩, ৫০২৪, ৭৪৮২, ৭৫৪৪; মুসলিম ৬/৩৪, হাঃ ৭৯২, আহমাদ ৭৬৭৪] (আধুনিক প্রকাশনীঃ ৪৬৪৯, ইসলামী ফাউন্ডেশনঃ ৪৬৫৩)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 142210,
        "last_updated": null
    },
    {
        "banglaURN": 6050240,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2489,
        "babName": null,
        "hadithNumber": 5024,
        "hadithSanad": "",
        "hadithText": "আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিতঃ রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বলেন, আল্লাহ্‌ তা‘আলা কোন বিষয়ের প্রতি এরূপ কান লাগিয়ে শুনেন না যেরূপ তিনি নবীর সুমধুর তিলাওয়াত শুনেন। সুফ্‌ইয়ান (রহঃ) বলেন, কুরআনই তার জন্য যথেষ্ট।(আধুনিক প্রকাশনীঃ ৪৬৫০, ইসলামী ফাউন্ডেশনঃ ৪৬৫৪)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 142220,
        "last_updated": null
    },
    {
        "banglaURN": 6050250,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2490,
        "babName": null,
        "hadithNumber": 5025,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘উমার (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি রসূলুল্লাহ্‌ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছি যে, দুটি বিষয় ছাড়া অন্য কোন বিষয়ে ঈর্ষা করা যায় না। প্রথম, যাকে আল্লাহ্‌ তা’আলা কিতাবের জ্ঞান দান করেছেন এবং তিনি তা থেকে গভীর রাতে তিলাওয়াত করেন। দ্বিতীয়ত, যাকে আল্লাহ্‌ তা'আলা সম্পদ দান করেছেন এবং তিনি সেই সম্পদ দিন-রাত দান করতে থাকেন।(আধুনিক প্রকাশনীঃ ৪৬৬১, ইসলামী ফাউন্ডেশনঃ ৪৬৫৫)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 142230,
        "last_updated": null
    },
    {
        "banglaURN": 6050260,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2490,
        "babName": null,
        "hadithNumber": 5026,
        "hadithSanad": "",
        "hadithText": "আবূ হুরাইরাহ (রাঃ) থেকে বর্ণিতঃ রসূলুল্লাহ্‌ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বলেছেন, দু’ব্যক্তি ব্যতীত অন্য কারও সাথে ঈর্ষা করা যায় না। এক ব্যক্তি, যাকে আল্লাহ্‌ তা’আলা কুরআন শিক্ষা দিয়েছেন এবং সে তা দিন-রাত তিলাওয়াত করে। আর তা শুনে তার প্রতিবেশীরা তাকে বলে, হায়! আমাদেরকে যদি এমন জ্ঞান দেওয়া হত, যেমন অমুককে দেওয়া হয়েছে, তাহলে আমিও তার মত 'আমাল করতাম। অন্য আর এক ব্যক্তি, যাকে আল্লাহ্‌ সম্পদ দান করেছেন এবং সে সম্পদ সত্য ও ন্যায়ের পথে খরচ করে। এ অবস্থা দেখে অন্য এক ব্যক্তি বলেঃ হায়! আমাকে যদি অমুক ব্যক্তির মত সম্পদ দেয়া হত, তাহলে সে যেমন ব্যয় করছে, আমিও তেমন ব্যয় করতাম।(আধুনিক প্রকাশনীঃ ৪৬৫২, ই.ফা . ৪৬৫৬)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 142240,
        "last_updated": null
    },
    {
        "banglaURN": 6050270,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2491,
        "babName": null,
        "hadithNumber": 5027,
        "hadithSanad": "",
        "hadithText": "‘উসমান (রাঃ) সূত্রে নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেন, তোমাদের মধ্যে ঐ ব্যক্তি সবচেয়ে উত্তম যে কুরআন শিখে এবং অন্যকে শিখায়।(আধুনিক প্রকাশনীঃ ৪৬৫৩, ইসলামী ফাউন্ডেশনঃ ৪৬৫৭)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 142250,
        "last_updated": null
    },
    {
        "banglaURN": 6050280,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2491,
        "babName": null,
        "hadithNumber": 5028,
        "hadithSanad": "",
        "hadithText": "‘উসমান ইব্‌নু আফ্‌ফান (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বলেছেন, তোমাদের মধ্যে সবচেয়ে উত্তম তারা, যারা নিজেরা কুরআন শিখে এবং অন্যকে শিক্ষা দেয়।(আধুনিক প্রকাশনীঃ ৪৬৫৪, ইসলামী ফাউন্ডেশনঃ ৪৬৫৮)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 142260,
        "last_updated": null
    },
    {
        "banglaURN": 6050290,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2491,
        "babName": null,
        "hadithNumber": 5029,
        "hadithSanad": "",
        "hadithText": "সাহল ইব্‌নু সা‘দ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, একদা এক মহিলা নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর খিদমাতে উপস্থিত হয়ে বলল, সে নিজেকে আল্লাহ ও তাঁর রসূলের জন্য নিবেদন করার ইচ্ছা করেছে। এ কথা শুনে নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বললেন, আমার কোন মহিলার নিষ্প্রায়োজন। জনৈক ব্যক্তি তাঁকে বলল, একে আমার সঙ্গে বিবাহ করিয়ে দিন। নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) তাকে বললেল, তাকে একখানা কাপড় দাও। ঐ ব্যক্তি তার অপারগতার কথা জানাল, তখন নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) তাকে বললেন, তাকে একখানা লোহার আংটি হলেও দাও। এবারেও লোকটি আগের মত অপারগতা জানাল। তারপর নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) তাকে প্রশ্ন করলেন, তোমার কি কুরআনের কিছু অংশ মুখস্থ আছে? লোকটি উত্তর করল, হাঁ। আমার অমুক অমুক সুরাহ মুখস্থ আছে। তখন নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বললেন, যে পরিমাণ কুরআন তোমার মুখস্থ আছে, তার বিনিময়ে তোমার নিকট এ মহিলাটিকে বিবাহ দিলাম। (আধুনিক প্রকাশনীঃ ৪৬৫৫, ইসলামী ফাউন্ডেশনঃ ৪৬৫৯)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 142270,
        "last_updated": null
    },
    {
        "banglaURN": 6050300,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2492,
        "babName": null,
        "hadithNumber": 5030,
        "hadithSanad": "",
        "hadithText": "সাহল ইব্‌নু সা’দ (রাঃ) থেকে বর্ণিতঃ একদা এক মহিলা রসূলুল্লাহ্‌ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর কাছে এসে বলল, হে আল্লাহ্‌র রসূল! আমি আমার জীবনকে আপনার জন্য দান করতে এসেছি। এরপর নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) তার দিকে তাকিয়ে তার আপাদমস্তক লক্ষ্য করে মাথা নিচু করলেন। মহিলাটি যখন দেখল যে নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) কোন ফয়সালা দিচ্ছেন না তখন সে বসে পড়ল। এমন সময় রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর সহাবীদের একজন বলল, যদি আপনার কোন প্রয়োজন না থাকে, তবে ঐ মহিলাটির সঙ্গে আমার শাদী দিয়ে দিন। তিনি বললেন, তোমার কাছে কি কিছু আছে? সে বলল, হে আল্লাহ্‌র রসূল! আল্লাহ্‌র কসম কিছুই নেই।  তিনি বললেন, তুমি তোমার পরিজনের কাছে ফিরে যাও এবং দেখ কিছু পাও কি-না! এরপর লোকটি চলে গেল এবং ফিরে এসে বলল, আল্লাহ্‌র কসম, হে আল্লাহ্‌র রসূল! আমি কিছুই পেলাম না। নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বললেন, দেখ একটি লোহার আংটি হলেও! তারপর সে চলে গেল এবং ফিরে এসে বলল, আল্লাহ্‌র কসম, একটি লোহার আংটিও পেলাম না; কিন্তু এই যে আমার তহবন্দ আছে। সাহ্‌ল (রাঃ) বলেন, তার কোন চাদর ছিল না। অথচ লোকটি বলল, আমার তহবন্দের অর্ধেক দিতে পারি। এ কথা শুনে রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বললেন, এ তহবন্দ দিয়ে কী হবে? যদি তুমি পরিধান কর, তাহলে মহিলাটির কোন আবরণ থাকবে না। আর যদি সে পরিধান করে, তোমার কোন আবরন থাকবে না। লোকটি বসে পড়লো, অনেকক্ষণ সে বসে থাকল। এরপর সে উঠে দাঁড়াল। রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) তাকে ফিরে যেতে দেখে তাকে ডেকে আনলেন। যখন সে ফিরে আসল, নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) তাকে জিজ্ঞেস করলেনঃ তোমার কুরআনের কতটুকু মুখস্থ আছে? সে উত্তরে বলল, অমুক অমুক সূরা মুখস্থ আছে। সে এমনিভাবে একে একে উল্লেখ করতে থাকল। তখন নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) তাকে জিজ্ঞেস করলেন, তুমি কি এ সকল সূরা মুখস্থ তিলাওয়াত করতে পার? সে উত্তর করল, হাঁ! তখন নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বললেন, যাও তুমি যে পরিমাণ কুরআন মুখস্ত রেখেছ, তার বিনিময়ে এ মহিলাটির তোমার সঙ্গে বিবাহ দিলাম।\n [২৩১০; মুসলিম ১৬/১২, হাঃ ১৪২৫, আহমাদ ২২৯১৩] (আধুনিক প্রকাশনীঃ ৪৬৫৬, ইসলামী ফাউন্ডেশনঃ ৪৬৬০)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 142280,
        "last_updated": null
    },
    {
        "banglaURN": 6050310,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2493,
        "babName": null,
        "hadithNumber": 5031,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘উমার (রাঃ) থেকে বর্ণিতঃ রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বলেছেন, যে ব্যক্তি অন্তরে কুরআন গেঁথে (মুখস্ত) রাখে তার দৃষ্টান্ত হচ্ছে ঐ মালিকের ন্যায়, যে উট বেঁধে রাখে। যদি সে উট বেঁধে রাখে, তবে সে উট তার নিয়ন্ত্রণে থাকে, কিন্তু সে বাঁধন খুলে দেয়, তবে তা নিয়ন্ত্রণের বাইরে চলে যায়।[মুসলিম ৬/৩৩, হাঃ ৭৮৯, আহমাদ ৪৬৬৫] (আধুনিক প্রকাশনীঃ ৪৬৫৭, ইসলামী ফাউন্ডেশনঃ ৪৬৬১)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 142290,
        "last_updated": null
    },
    {
        "banglaURN": 6050330,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2493,
        "babName": null,
        "hadithNumber": 5033,
        "hadithSanad": "",
        "hadithText": "আবূ মুসা (রাঃ) থেকে বর্ণিতঃ রসূলুল্লাহ্‌ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বলেছেন, তোমরা কুরআনের প্রতি লক্ষ্য রাখবে। আল্লাহ্‌র কসম! যাঁর হাতে আমার জীবন! কুরআন বাঁধন ছাড়া উটের চেয়েও দ্রুত গতিতে দৌড়ে যায়।[মুসলিম ৬/৩৩, হাঃ ৭৯১, আহমাদ ১৯৫৬৩] (আধুনিক প্রকাশনীঃ ৪৬৫৯, ইসলামী ফাউন্ডেশনঃ ৪৬৬৩)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 142320,
        "last_updated": null
    },
    {
        "banglaURN": 6050340,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2494,
        "babName": null,
        "hadithNumber": 5034,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ ইব্‌নু মুগাফফাল (রাঃ) থেকে বর্ণিতঃ মাক্কাহ বিজয়ের দিন আমি রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- কে (উটের পিঠে) আরোহন অবস্থায় ‘সুরাহ আল্‌ ফাত্‌হ’ তিলাওয়াত করতে দেখেছি। (আধুনিক প্রকাশনীঃ ৪৬৬০, ইসলামী ফাউন্ডেশনঃ ৪৬৬৪)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 142330,
        "last_updated": null
    },
    {
        "banglaURN": 6050350,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2495,
        "babName": null,
        "hadithNumber": 5035,
        "hadithSanad": "",
        "hadithText": "সা‘ঈদ ইব্‌নু যুবায়র (রাঃ) থেকে বর্ণিতঃ যে সকল সূরাকে তোমরা মুফাস্‌সাল [১৬০] বলো, তা হচ্ছে মুহ্‌কাম।[১৬১] রাবী বলেন, ইব্‌নু ‘আব্বাস (রাঃ) বলেছেন, যখন আল্লাহ্‌র রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) ইন্তিকাল করেন, তখন আমার বয়স দশ বছর এবং আমি ঐ বয়সেই মুহ্‌কাম আয়াতসমূহ শিখে নিয়েছিলাম।(আধুনিক প্রকাশনীঃ ৪৬৬১, ইসলামী ফাউন্ডেশনঃ ৪৬৬৫)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 142340,
        "last_updated": null
    },
    {
        "banglaURN": 6050360,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2495,
        "babName": null,
        "hadithNumber": 5036,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি ‘মুহকাম সূরাসমূহ আল্লাহ্‌র রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)– এর জীবদ্দশায় মুখস্থ করেছিলাম। রাবী সা‘ঈদ (রহঃ) বলেন, আমি তাঁকে প্রশ্ন করলাম, ‘মুহকাম’ অর্থ কী? তিনি বললেন, মুফাস্‌সাল।(আধুনিক প্রকাশনীঃ ৪৬৬২, ইসলামী ফাউন্ডেশনঃ ৪৬৬৬)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 142350,
        "last_updated": null
    },
    {
        "banglaURN": 6050380,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2496,
        "babName": null,
        "hadithNumber": 5038,
        "hadithSanad": "",
        "hadithText": "'আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) এক ব্যক্তিকে রাতে কুরআন পড়তে শুনে বললেন, আল্লাহ তাকে রহমাত করুন। কেননা, সে আমাকে অমুক অমুক সূরার অমুক অমুক আয়াত মনে করিয়ে দিয়েছে, যা আমি ভুলতে বসেছিলাম।(আধুনিক প্রকাশনীঃ ৪৬৬৫, ইসলামী ফাউন্ডেশনঃ ৪৬৬৯)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 142380,
        "last_updated": null
    },
    {
        "banglaURN": 6050390,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2496,
        "babName": null,
        "hadithNumber": 5039,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বলেছেন, কোন লোক এ কথা কেন বলে যে, আমি অমুক অমুক আয়াত ভুলে গেছি; বরং (আল্লাহ্‌র পক্ষ থেকে) তাকে ভুলিয়ে দেয়া হয়েছে।(আধুনিক প্রকাশনীঃ ৪৬৬৬, ইসলামী ফাউন্ডেশনঃ ৪৬৭০)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 142390,
        "last_updated": null
    },
    {
        "banglaURN": 6050400,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2497,
        "babName": null,
        "hadithNumber": 5040,
        "hadithSanad": "",
        "hadithText": "আবূ মাস’উদ আনসারী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বলেছেন, যদি কোন ব্যক্তি সূরা বাক্বারার শেষ দু’টি আয়াত পাঠ করে, তবে এটাই তার জন্য যথেষ্ট।(আধুনিক প্রকাশনীঃ ৪৬৬৭, ইসলামী ফাউন্ডেশনঃ ৪৬৭১)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 142400,
        "last_updated": null
    },
    {
        "banglaURN": 6050410,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2497,
        "babName": null,
        "hadithNumber": 5041,
        "hadithSanad": "",
        "hadithText": "‘উমার ইব্‌নু খাত্তাব (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি হিশাম ইব্‌নু হাকীম ইব্‌নু হিযামকে রসূলুল্লাহ্‌ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর জীবদ্দশায় ‘সূরা ফুরকান’ তিলাওয়াত করতে শুনলাম। আমি লক্ষ্য করলাম যে, সে বিভিন্ন কিরাআতে তা পাঠ করছে, যা আল্লাহ্‌র রসূল আমাকে শিখাননি। যার ফলে তাকে সলাতের মধ্যেই ধরতে উদ্যত হলাম। অবশ্য আমি তার সলাত শেষে সালাম ফিরানো পর্যন্ত অপেক্ষা করলাম। সলাত শেষ হতেই তার গলায় রুমাল পেঁচিয়ে ধরলাম এবং তাঁকে জিজ্ঞেস করলাম, এইমাত্র আমি তোমাকে যা পাঠ করতে শুনলাম, তা তোমাকে কে শিখিয়েছে? সে উত্তর করল, রসূলুল্লাহ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) আমাকে এরূপ শিখিয়েছেন। আমি বললাম, তুমি মিথ্যা বলছো! আল্লাহ্‌র কসম, রসূলুল্লাহ্‌ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) আমাকে ভিন্ন ভাবে তিলাওয়াত করা শিখিয়েছেন, যা তোমাকে তিলাওয়াত করতে শুনেছি। এরপর আমি তাকে টেনে নিয়ে রসূলুল্লাহ্‌ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর কাছে উপস্থিত হলাম এবং বললাম, হে আল্লাহ্‌র রসূল! আমি এই ব্যক্তিকে ভিন্ন ভাবে ‘সূরা ফুরকান’ পাঠ করতে শুনেছি, যে পদ্ধতি আপনি আমাকে তিলাওয়াত করতে শিখাননি। অথচ আপনি আমাকে সূরা ফুরকান তিলাওয়াত শিখিয়েছেন। এরপর তিনি বললেন, হে হিশাম! পাঠ করো! সুতরাং আমি যেভাবে পাঠ করতে শুনেছি, সে সেই ভাবেই পাঠ করল। এরপর রসূলুল্লাহ্‌ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বললেন, এভাবে কুরআন অবতীর্ণ হয়েছে। এরপর রসুলুল্লাহ্‌ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বললেন, হে ‘উমার। তুমি পাঠ করো, সুতরাং রসূলুল্লাহ্‌ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) আমাকে যেভাবে শিখিয়েছিলেন, সেভাবে আমি পাঠ করলাম। এরপর তিনি বললেন, কুরআন এভাবেই অবতীর্ণ হয়েছে। রসূলুল্লাহ্‌ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) আরও বললেন, সাত কিরাআত বা পদ্ধতিতে পাঠ করার জন্য কুরআন অবতীর্ণ হয়েছে। সুতরাং এর মধ্যে যে পদ্ধতি তোমার জন্য সহজ, সে পদ্ধতিতে পড়।(আধুনিক প্রকাশনীঃ ৪৬৬৮, ইসলামী ফাউন্ডেশনঃ ৪৬৭২)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 142410,
        "last_updated": null
    },
    {
        "banglaURN": 6050420,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2497,
        "babName": null,
        "hadithNumber": 5042,
        "hadithSanad": "",
        "hadithText": "'আয়িশা (রাঃ) থেকে বর্ণিতঃ রসূলুল্লাহ্‌ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) এক কারীকে রাতে মাসজিদে কুরআন মাজীদ পড়তে শুনলেন। এরপর তিনি বললেন, আল্লাহ্‌ তার প্রতি করুণা করুন। সে আমাকে অমুক অমুক আয়াত মনে করিয়ে দিয়েছে, যা অমুক অমুক সূরা থেকে ভুলতে বসেছিলাম। (আধুনিক প্রকাশনীঃ ৪৬৬৯, ইসলামী ফাউন্ডেশনঃ ৪৬৭৩)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 142420,
        "last_updated": null
    },
    {
        "banglaURN": 6050430,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2498,
        "babName": null,
        "hadithNumber": 5043,
        "hadithSanad": "",
        "hadithText": "আবূ ওয়ায়িল (রহঃ) সূত্রে ‘আবদুল্লাহ (রাঃ) থেকে বর্ণিতঃ আবূ ওয়ায়িল (রহঃ) বলেন, আমরা একদিন সকালে ‘আবদুল্লাহ্‌ (রাঃ)- এর কাছে গেলাম। একজন লোক বলল, গতকাল রাতে আমি মুফাস্‌সাল সূরাসমূহ পাঠ করেছি। এ কথা শুনে ‘আবদুল্লাহ (রাঃ) বললেন, এত শীঘ্র পাঠ করা যেন কবিতা পাঠের মতো; অথচ আমরা নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর পাঠ শুনেছি এবং তা আমার ভালভাবে মনে আছে। নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) থেকে যে সমস্ত সুরাহ পাঠ করতে আমি শুনেছি, তার সংখ্যা মুফাস্‌সাল হতে আঠারটি এবং ‘আলিফ-লাম হামিম’ হতে দু’টি। (আধুনিক প্রকাশনীঃ ৪৬৭০, ইসলামী ফাউন্ডেশনঃ ৪৬৭৪)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 142430,
        "last_updated": null
    },
    {
        "banglaURN": 6050440,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2498,
        "babName": null,
        "hadithNumber": 5044,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ আল্লাহ্‌র বাণীঃ “হে নবী! আপনার জিহবাকে তাড়াতাড়ি মুখস্থ করার জন্য নাড়াবেন না।” আল্লাহ্‌র এই কালাম সম্পর্কে তিনি বলেন, যখনই জিব্‌রীল (আঃ) ওয়াহী নিয়ে নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর নিকট আসতেন, তখন নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) খুব তাড়াতাড়ি জিহবা এবং ঠোঁট নাড়াতেন এবং এটা তার জন্য খুব কঠিন হত। আর এ অবস্থা সহজেই অন্যজনে আঁচ করতে পারত। এ অবস্থার প্রেক্ষাপটে আল্লাহ্ তা’আলা সূরা ক্বিয়ামাহ এর এ আয়াত অবতীর্ণ করেনঃ “হে নবী! তাড়াতাড়ি ওয়াহী মুখস্থ করার জন্য আপনি আপনার জিহবা নাড়াবেন না। এ মুখস্থ করিয়ে দেয়া ও পাঠ করিয়ে দেয়ার দায়িত্ব আমারই। যখন আমি তা পাঠ করতে থাকি, তখন আপনি সে পাঠকে মনোযোগ সহকারে শুনতে থাকুন। পরে এর অর্থ বুঝিয়ে দেয়াও আমার দায়িত্ব।” সুতরাং যখন জিব্‌রীল (আঃ) পাঠ করেন আপনি তার অনুসরণ করুন। এরপর থেকে জিবরীল (আঃ) বলে যেতেন তখন নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) চুপ থাকতেন। যখন তিনি চলে যেতেন, আল্লাহ্‌র ওয়াদা অনুযায়ী তিনি তা পাঠ করতেন। (আধুনিক প্রকাশনীঃ ৪৬৭১, ইসলামী ফাউন্ডেশনঃ ৪৭৭৫)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 142440,
        "last_updated": null
    },
    {
        "banglaURN": 6050450,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2499,
        "babName": null,
        "hadithNumber": 5045,
        "hadithSanad": "",
        "hadithText": "ক্বাতাদাহ (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আনাস ইব্‌নু মালিক (রাঃ)- কে নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) এর ‘কিরাআত’ সম্পর্কে জিজ্ঞেস করলাম। তিনি বললেন, নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) (কোন কোন ক্ষেত্রে শব্দকে) দীর্ঘায়িত করে পাঠ করতেন।(আধুনিক প্রকাশনীঃ ৪৬৭২, ইসলামী ফাউন্ডেশনঃ ৪৬৭৬)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 142450,
        "last_updated": null
    },
    {
        "banglaURN": 6050460,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2499,
        "babName": null,
        "hadithNumber": 5046,
        "hadithSanad": "",
        "hadithText": "ক্বাতাদাহ (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, আনাস (রাঃ)- কে নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)– এর ‘কিরাআত’ সম্পর্কে জিজ্ঞেস করা হলো যে, নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর ‘কিরাআত’ কেমন ছিল? উত্তরে তিনি বললেন, কোন কোন ক্ষেত্রে নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) দীর্ঘ করতেন। এরপর তিনি ‘বিস্‌মিল্লা-হির রহমা-নির রহীম’ তিলাওয়াত করে শোনালেন এবং তিনি বললেন, নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) ‘বিসমিল্লাহ্’ ‘আর রহমান’, ‘আর রহীম’ পড়ার সময় দীর্ঘায়িত করতেন। (আধুনিক প্রকাশনীঃ ৪৬৭৩, ইসলামী ফাউন্ডেশনঃ ৪৬৭৭)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 142460,
        "last_updated": null
    },
    {
        "banglaURN": 6050470,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2500,
        "babName": null,
        "hadithNumber": 5047,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ ইব্‌নু মুগাফ্‌ফাল (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) উষ্ট্রির পিঠে অথবা উটের পিঠে আরোহিত অবস্থায় যখন উষ্ট্রটি চলছিল, তখন আমি তিলাওয়াত করতে দেখেছি। তিনি ‘সূরা ফাত্‌হ’ বা ‘সূরা ফাত্‌হ’র অংশ বিশেষ অত্যন্ত নরম এবং মধুর ছন্দোময় সুরে পাঠ করছিলেন। (আধুনিক প্রকাশনীঃ ৪৬৭৪, ইসলামী ফাউন্ডেশনঃ ৪৬৭৮)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 142470,
        "last_updated": null
    },
    {
        "banglaURN": 6050480,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2501,
        "babName": null,
        "hadithNumber": 5048,
        "hadithSanad": "",
        "hadithText": "আবূ মূসা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) তাকে লক্ষ্য করে বললেন, হে আবূ মূসা! তোমাকে দাঊদ (আঃ)- এর সুমধুর কণ্ঠ দান করা হয়েছে।[মুসলিম ৬/৩৪, হাঃ ৭৯৩, আহমাদ ২৩০৩০] (আধুনিক প্রকাশনীঃ ৪৬৭৫, ইসলামী ফাউন্ডেশনঃ ৪৬৭৯)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 142480,
        "last_updated": null
    },
    {
        "banglaURN": 6050490,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2502,
        "babName": null,
        "hadithNumber": 5049,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) আমাকে বললেন, “আমার কাছে কুরআন পাঠ কর।” ‘আবদুল্লাহ্‌ বললেন, আমি আপনার কাছে কুরআন পাঠ করব; অথচ আপনার ওপর কুরআন অবতীর্ণ হয়েছে। তিনি বললেন, আমি অন্যের নিকট থেকে তা শুনতে ভালবাসি। (আধুনিক প্রকাশনীঃ ৪৬৭৬, ইসলামী ফাউন্ডেশনঃ ৪৬৮০)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 142490,
        "last_updated": null
    },
    {
        "banglaURN": 6050500,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2503,
        "babName": null,
        "hadithNumber": 5050,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ ইব্‌নু মাস’ঊদ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, একদিন নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) আমাকে বললেন, তুমি কুরআন পাঠ কর। আমি আরয করলাম, হে আল্লাহ্‌র রসূল! আমি আপনার কাছে কুরআন পাঠ করব? অথচ তা তো আপনার ওপরই অবতীর্ণ হয়েছে। তিনি বললেন, হ্যাঁ। এরপর আমি ‘সুরাহ নিসা’ পাঠ করলাম। যখন আমি এই আয়াত পর্যন্ত আসলাম ‘চিন্তা করো আমি যখন প্রত্যেক উম্মাতের মধ্য থেকে একজন করে সাক্ষী উপস্থিত করব এবং সকলের ওপরে তোমাকে সাক্ষী হিসাবে হাযির করব তখন তারা কী করবে।’ নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বললেন, আপাততঃ যথেষ্ট হয়েছে। আমি তাঁর চেহারার দিকে তাকালাম, দেখলাম, তাঁর চোখ থেকে অশ্রু ঝরছে।\n(আধুনিক প্রকাশনীঃ ৪৬৭৭, ইসলামী ফাউন্ডেশনঃ ৪৬৮১)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 142500,
        "last_updated": null
    },
    {
        "banglaURN": 6050520,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2504,
        "babName": null,
        "hadithNumber": 5052,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ ইব্‌নু ‘আমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমার পিতা আমাকে এক সম্ভ্রান্ত বংশীয় মহিলার সঙ্গে শাদী দেন এবং প্রায়ই তিনি আমার সম্পর্কে আমার স্ত্রীর কাছে জিজ্ঞাসাবাদ করতেন। আমার স্ত্রী বলত, সে কতইনা ভাল মানুষ যে, সে কখনও আমার বিছানায় আসেনি এবং শাদীর পর থেকে আমার সম্পর্কে খোঁজ খবরও নেয়নি। এ অবস্থা যখন দীর্ঘদিন পর্যন্ত চলতে থাকল তখন আমার পিতা রসূলুল্লাহ্‌ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- কে আমার সম্পর্কে জানালেন। তখন নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) আমার পিতাকে বললেন, তাকে আমার সঙ্গে সাক্ষাতের ব্যবস্থা করুন। এরপর আমি নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর সঙ্গে সাক্ষাৎ করলে তিনি আমাকে জিজ্ঞেস করলেন, তুমি কেমন সওম পালন কর? আমি উত্তর দিলাম, প্রতিদিন সওম পালন করি। তিনি আবার জিজ্ঞেস করলেন, এ অবস্থায় পূর্ণ কুরআন মাজীদ খতম করতে তোমার কত সময় লাগে? আমি উত্তর দিলাম, প্রত্যেক রাতেই এক খতম করি। তিনি বললেন, প্রত্যেক মাসে তিনদিন সওম পালন করবে এবং কুরআন এক মাসে এক খতম দেবে।” আমি বললাম, আমি এর চেয়ে অধিক করার সামর্থ্য রাখি। তিনি বললেন, তাহলে প্রতি সপ্তাহে তিনদিন সওম পালন করবে। আমি বললাম, আমি এর চেয়ে অধিক করার শক্তি রাখি। তিনি বললেন, দু’দিন পর একদিন সওম পালন কর। আমি বললাম, আমি এর চেয়ে অধিক সামর্থ্য রাখি। তিনি বললেন, তাহলে সব চেয়ে উত্তম পদ্ধতির সওম পালন কর। তা হল, দাঊদ (আঃ)- এর সওম। তিনি এক দিন অন্তর একদিন সওম পালন করতেন এবং প্রতি সাত দিনে একবার আল্লাহ্‌র কিতাব খতম করতেন। হায়! আমি যদি রসূলুল্লাহ্‌ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর দেয়া সুবিধা গ্রহণ করতাম! এখন আমি দুর্বল বৃদ্ধ হয়ে গেছি। ‘আবদুল্লাহ (রাঃ) প্রত্যেক দিন তার পরিবারের একজন সদস্যের সামনে কুরআনের সপ্তমাংশ পাঠ করে শোনাতেন। দিবা ভাগে পাঠ করে দেখতেন, তার স্মরণশক্তি সঠিক আছে কিনা? যা তিনি রাতে পাঠ করবেন তা যেন সহজ হয় এবং যখনই তিনি শারীরিক শক্তি বৃদ্ধির ইচ্ছা করতেন তখন কয়েকদিন সওম পালন বন্ধ রাখতেন এবং পরবর্তীতে ঐ ক’দিনের হিসাব করে সওম পালন করতেন। কেননা, তিনি রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর জীবদ্দশায় যে নিয়ম পালন করতেন পরে সে নিয়ম ত্যাগ করা অপছন্দ মনে করতেন। আবূ ‘আবদুল্লাহ বলেন কেউ তিন দিনে, কেউ পাঁচ দিনে এবং অধিকাংশ লোক সাত দিনে কুরআন খতম করতেন। (আধুনিক প্রকাশনীঃ ৪৬৭৯, ইসলামী ফাউন্ডেশনঃ ৪৬৮৩)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 142530,
        "last_updated": null
    },
    {
        "banglaURN": 6050530,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2504,
        "babName": null,
        "hadithNumber": 5053,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ ইব্‌নু ‘আম্‌র (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) আমাকে জিজ্ঞেস করলেন, কত দিনে তুমি কুরআন খতম কর? (আধুনিক প্রকাশনীঃ ৪৬৮০, ইসলামী ফাউন্ডেশনঃ ৪৬৮৪)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 142540,
        "last_updated": null
    },
    {
        "banglaURN": 6050540,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2504,
        "babName": null,
        "hadithNumber": 5054,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ ইব্‌নু ‘আম্‌র (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) আমাকে বললেন, “এক মাসে কুরআন পাঠ সমাপ্ত কর।” আমি বললাম, “আমি এর চেয়ে অধিক করার শক্তি রাখি।” তখন নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বললেন, “তাহলে সাত দিনে তার পাঠ শেষ করো এবং এর চেয়ে কম সময়ে পাঠ করা শেষ করো না।”(আধুনিক প্রকাশনীঃ ৪৬৮১, ইসলামী ফাউন্ডেশনঃ ৪৬৮৫)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 142550,
        "last_updated": null
    },
    {
        "banglaURN": 6050550,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2505,
        "babName": null,
        "hadithNumber": 5055,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রাসূলুল্লাহ্‌ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) আমাকে বললেন, তুমি আমার কাছে কুরআন পাঠ কর। আমি উত্তরে বললাম, আমি আপনার কাছে কুরআন পাঠ করবো, অথচ আপনারই ওপর কুরআন অবতীর্ণ হয়েছে। তিনি বললেন, আমি অন্যের নিকট হতে কুরআন পাঠ শোনা পছন্দ করি। আমি তখন সুরাহ নিসা পাঠ করলাম যখন আমি এই আয়াত পর্যন্ত পৌঁছলামঃ “তারপর চিন্তা করো, আমি প্রত্যেক উম্মাতের মধ্যে একজন করে সাক্ষী হাযির করব এবং এ সকলের ওপরে তোমাকে সাক্ষী হিসেবে হাযির করব তখন তারা কী করবে।” তখন তিনি আমাকে বললেন, “থাম!” আমি লক্ষ্য করলাম, তাঁর [নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) -এর] দু’চোখ বেয়ে অশ্রু ঝরছে।[৪৫৮২; মুসলিম ৬/৩৯, হাঃ ৮০০, আহমাদ ৩৫৫০] (আধুনিক প্রকাশনীঃ ৪৬৮২, ইসলামী ফাউন্ডেশনঃ ৪৬৮৬)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 142560,
        "last_updated": null
    },
    {
        "banglaURN": 6050560,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2505,
        "babName": null,
        "hadithNumber": 5056,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ ইব্‌নু মাস’ঊদ (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) আমাকে বললেন, আমার কাছে কুরআন পাঠ করো। আমি বললাম, আমি আপনার নিকট কুরআন পাঠ করব, অথচ আপনারই ওপর কুরআন অবতীর্ণ হয়েছে। তিনি বললেন, আমি অন্যের তিলাওয়াত শুনতে পছন্দ করি।(আধুনিক প্রকাশনীঃ ৪৬৮৩, ইসলামী ফাউন্ডেশনঃ ৪৬৮৭)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 142570,
        "last_updated": null
    },
    {
        "banglaURN": 6050570,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2506,
        "babName": null,
        "hadithNumber": 5057,
        "hadithSanad": "",
        "hadithText": "‘আলী (রা) থেকে বর্ণিতঃ বলেনঃ আমি নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- কে বলতে শুনেছি যে, শেষ যামানায় এমন একদল মানুষের আবির্ভাব হবে, যারা হবে কমবয়স্ক এবং যাদের বুদ্ধি হবে স্বল্প। ভাল ভাল কথা বলবে, কিন্তু তারা ইসলাম থেকে এমনভাবে বের হয়ে যাবে যেমন তীর ধনুক থেকে বেরিয়ে যায়। তাদের ঈমান গলার নীচে পৌঁছবে না। সুতরাং তোমরা তাদেরকে যেখানে পাও, হত্যা কর। এদের হত্যাকারীর জন্য ক্বিয়ামাতে পুরস্কার রয়েছে। (আধুনিক প্রকাশনীঃ ৪৬৮৪, ইসলামী ফাউন্ডেশনঃ ৪৬৮৮)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 142580,
        "last_updated": null
    },
    {
        "banglaURN": 6050580,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2506,
        "babName": null,
        "hadithNumber": 5058,
        "hadithSanad": "",
        "hadithText": "আবূ সা’ঈদ খুদরী (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি রসূলুল্লাহ্ (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- কে বলতে শুনেছিঃ ভবিষ্যতে এমন সব লোকের আগমন ঘটবে, যাদের সলাতের তুলনায় তোমাদের সলাতকে, তাদের সওমের তুলনায় তোমাদের সওমকে এবং তাদের ‘আমালের তুলনায় তোমাদের ‘আমালকে তুচ্ছ মনে করবে। তারা কুরআন পাঠ করবে, কিন্তু তা তাদের কণ্ঠনালীর নিচে (অর্থাৎ অন্তরে) প্রবেশ করবে না। এরা দ্বীন থেকে এমনভাবে বেরিয়ে যাবে যেমনভাবে নিক্ষিপ্ত তীর ধনুক থেকে বেরিয়ে যায়। আর শিকারী সেই তীরের আগা পরীক্ষা করে দেখতে পায়, তাতে কোন চিহ্ন নেই। সে তীরের ফলার পার্শ্বদেশে নযর করে; অথচ সেখানে কিছু দেখতে পায় না। শেষে ঐ ব্যক্তি কোন কিছু পাওয়ার জন্য তীরের নিম্নভাগে সন্দেহ পোষণ করে। (আধুনিক প্রকাশনীঃ ৪৬৮৫, ইসলামী ফাউন্ডেশনঃ ৪৬৮৯)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 142590,
        "last_updated": null
    },
    {
        "banglaURN": 6050590,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2506,
        "babName": null,
        "hadithNumber": 5059,
        "hadithSanad": "",
        "hadithText": "আবূ মূসা (রাঃ) সূত্রে নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেন, ঐ মু’মিন যে কুরআন পাঠ করে এবং সে অনুযায়ী ‘আমাল করে, তাঁর দৃষ্টান্ত ঐ লেবুর মত যা খেতে সুস্বাদু এবং গন্ধে চমৎকার। আর ঐ মু’মিন যে কুরআন পাঠ করে না; কিন্তু এর অনুসারে ‘আমাল করে তার দৃষ্টান্ত হচ্ছে ঐ খেজুরের মত যা খেতে সুস্বাদু কিন্তু সুগন্ধ নেই। আর মুনাফিক যে কুরআন পাঠ করে; তার উদাহরণ হচ্ছে, ঐ রায়হানের মত, যার মত মাতানো খুশবু আছে, অথচ খেতে একেবারে বিস্বাদ। আর ঐ মুনাফিক যে কুরআন পাঠ করে না, তার দৃষ্টান্ত হচ্ছে ঐ মাকাল ফলের মত, যা খেতে বিস্বাদ এবং গন্ধে দুর্গন্ধময়।(আধুনিক প্রকাশনীঃ ৪৬৮৬, ইসলামী ফাউন্ডেশনঃ ৪৬৯০)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 142600,
        "last_updated": null
    },
    {
        "banglaURN": 6050600,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2507,
        "babName": null,
        "hadithNumber": 5060,
        "hadithSanad": "",
        "hadithText": "জুনদুব ইব্‌নু ‘আবদুল্লাহ্ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বলেছেন, যতক্ষণ পর্যন্ত ইবাদাত মনের চাহিদার অনুকূল হয় তিলাওয়াত করতে থাক এবং (তাতে) মনোসংযোগে ব্যাঘাত ঘটলে পড়া ত্যাগ কর। [৫০৬১, ৭৩৬৪, ৭৩৬৫; মুসলিম ৪৭/১, হাঃ ২৬৬৭, আহমাদ ১৮৮৩৮] (আধুনিক প্রকাশনীঃ ৪৬৮৭, ইসলামী ফাউন্ডেশনঃ ৪৬৯১)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 142610,
        "last_updated": null
    },
    {
        "banglaURN": 6050610,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2507,
        "babName": null,
        "hadithNumber": 5061,
        "hadithSanad": "",
        "hadithText": "জুনদুব (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বলেছেন, যতক্ষণ পর্যন্ত ইবাদাত মনের চাহিদার অনুকূল হয় তিলাওয়াত করতে থাক এবং তাতে মনোসংযোগে ব্যাঘাত ঘটলে পড়া ত্যাগ কর।  হারিস ইবনু ‘উবায়দ ও সা’ঈদ ইবনু যায়দ আবূ ‘ইমরান এর মাধ্যমে জুনদাবের অনুরূপ বর্ণনা করেছেন। কিন্তু হাম্মাদ ইবনু সালামাহ ও আবান এটিকে মারফু’ হিসেবে বর্ণনা করেননি। ….. তবে জুনদাবের বর্ণনাটি অধিক বিশুদ্ধ ও অধিক বর্ণিত।</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 142620,
        "last_updated": null
    },
    {
        "banglaURN": 6050620,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": null,
        "babNumber": 2507,
        "babName": null,
        "hadithNumber": 5062,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, তিনি এক ব্যক্তিকে আয়াত পড়তে শুনলেন। নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- কে যেভাবে পড়তে শুনতেন, তার থেকে সে অন্য রকম করে পড়ছিল। তখন ঐ ব্যক্তিকে তিনি নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর নিকট নিয়ে গেলেন। তখন নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বললেন, তোমরা উভয়ই সঠিকভাবে পাঠ করেছ। সুতরাং এভাবে কুরআন পাঠ করতে থাক। নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) আরও বললেন, তোমাদের পূর্বেকার জাতিগুলো তাদের পারস্পরিক বিভেদের জন্যই ধ্বংস হয়ে গেছে। (আধুনিক প্রকাশনীঃ ৪৬৮৯, ইসলামী ফাউন্ডেশনঃ ৪৬৯২)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 142630,
        "last_updated": null
    },
    {
        "banglaURN": 6050321,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": "",
        "babNumber": 2493,
        "babName": "",
        "hadithNumber": 5032,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন যে, নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বলেছেন, এটা খুবই খারাপ কথা যে, তোমাদের মধ্যে কেউ বলবে, আমি কুরআনের অমুক অমুক আয়াত ভুলে গেছি; বরং তাকে ভুলিয়ে দেয়া হয়েছে। সুতরাং তোমরা কুরআন তিলাওয়াত করতে থাক কেননা, তা মানুষের অন্তর থেকে উটের চেয়েও দ্রুত গতিতে চলে যায়। [৫০৩৯; মুসলিম ৬/৩৩, হাঃ ৭৯০, আহমাদ ৩৬২০] (আধুনিক প্রকাশনীঃ ৪৬৫৮, ইসলামী ফাউন্ডেশনঃ ৪৬৬২)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 142300,
        "last_updated": null
    },
    {
        "banglaURN": 6050322,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": "",
        "babNumber": 2493,
        "babName": "",
        "hadithNumber": 5032,
        "hadithSanad": "",
        "hadithText": "‘আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন যে, নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বলেছেন, এটা খুবই খারাপ কথা যে, তোমাদের মধ্যে কেউ বলবে, আমি কুরআনের অমুক অমুক আয়াত ভুলে গেছি; বরং তাকে ভুলিয়ে দেয়া হয়েছে। সুতরাং তোমরা কুরআন তিলাওয়াত করতে থাক কেননা, তা মানুষের অন্তর থেকে উটের চেয়েও দ্রুত গতিতে চলে যায়।</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 142310,
        "last_updated": null
    },
    {
        "banglaURN": 6050371,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": "",
        "babNumber": 2496,
        "babName": "",
        "hadithNumber": 5037,
        "hadithSanad": "",
        "hadithText": "'আয়িশা (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) এক ব্যক্তিকে মাসজিদে নাববীতে কুরআন পড়তে শুনলেন। তিনি বললেন, তার প্রতি আল্লাহ্‌র রহমাত বর্ষিত হোক, সে আমাকে অমুক সূরার অমুক আয়াত মনে করিয়ে দিয়েছে। (আ.প্র. ৪৬৬৩, ই.ফা. ৪৬৬৭)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 142360,
        "last_updated": null
    },
    {
        "banglaURN": 6050372,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": "",
        "babNumber": 2496,
        "babName": "",
        "hadithNumber": 5037,
        "hadithSanad": "",
        "hadithText": "হিশাম (রহঃ) হতে বর্ণিত পূর্বের হাদীসের অতিরিক্ত রয়েছে, “যা ভুলে গেছি অমুক অমুক সূরা থেকে।” ‘আলী এবং ‘আবদাহ হিশাম থেকে তার সমর্থন ব্যক্ত করেন। (আ.প্র. ৪৬৬৪, ই.ফা. ৪৬৬৮)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 142370,
        "last_updated": null
    },
    {
        "banglaURN": 6050511,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": "",
        "babNumber": 2504,
        "babName": "",
        "hadithNumber": 5051,
        "hadithSanad": "",
        "hadithText": "সুফ্‌ইয়ান ইব্‌নু ‘উয়াইনাহ (রহঃ) থেকে বর্ণিতঃ আমাকে ইব্‌নু সুবরুমা (রহঃ) বললেন, আমি দেখতে চাইলাম, সলাতে কী পরিমাণ আয়াত পাঠ করা যথেষ্ট এবং আমি তিন আয়াত বিশিষ্ট সূরার চেয়ে ছোট কোন সুরাহ পেলাম না। সুতরাং আমি বললাম, কারো জন্য তিন আয়াতের কম সলাতে পড়া উচিত নয়।</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 142510,
        "last_updated": null
    },
    {
        "banglaURN": 6050512,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 66,
        "bookName": "",
        "babNumber": 2504,
        "babName": "",
        "hadithNumber": 5051,
        "hadithSanad": "",
        "hadithText": "আবূ মাস’ঊদ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমি নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর সঙ্গে সাক্ষাত করলাম, তখন তিনি বায়তুল্লাহ্‌ তাওয়াফ করছিলেন। তখন নবী (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম) বললেন, যদি কেউ সুরা বাকারার শেষ দু’আয়াত রাতে পাঠ করে, তাহলে তা তার জন্য যথেষ্ট। (আধুনিক প্রকাশনীঃ ৪৬৭৮, ইসলামী ফাউন্ডেশনঃ ৪৬৮২)</b>",
        "bookID": "66.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 142520,
        "last_updated": null
    }
]