[
    {
        "banglaURN": 6072460,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 95,
        "bookName": null,
        "babNumber": 1567,
        "babName": null,
        "hadithNumber": 7246,
        "hadithSanad": "",
        "hadithText": "মালিক ইব্‌নু হুওয়ায়রিস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমরা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছে এলাম। আমরা সবাই এক বয়সী যুবক ছিলাম। আমরা বিশ রাত তাঁর কাছে অবস্থান করলাম। রসূলল্লাহ্ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ছিলেন কোমল হৃদয়ের। তিনি যখন অনুমান করলেন যে আমরা আমাদের স্ত্রী-পরিবারের প্রতি ঝুঁকে পরেছি, কিংবা আসক্ত হয়ে পড়েছি তখন তিনি জিজ্ঞেস করলেন, আমরা বাড়িতে কাদেরকে রেখে এসেছি। আমরা তাঁকে জানালাম। তিনি বললেনঃ তোমরা তোমাদের পরিবারের কাছে ফিরে যাও এবং তাদের মাঝে অবস্থান কর, আর তাদেরকে (দ্বীন) শিক্ষা দাও। আর তাদের হুকুম কর। তিনি [মালিক (রাঃ)] কিছু বিষয়ে উল্লেখ করেছিলেন, যা আমি মনে রেখেছি বা মনে রাখতে পারিনি। (নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছিলেন) তোমরা আমাকে যেভাবে সালাত আদায় করতে দেখছ সেভাবে সালাত আদায় কর। যখন সালাতের সময় হাজির হয়, তখন তোমাদের কোন একজন যেন তোমাদের জন্য আযান দেয়, আর তোমাদের মধ্যে যে বড় সে যেন তোমাদের ইমামত করে।(আধুনিক প্রকাশনী- ৬৭৩৯, ইসলামিক ফাউন্ডেশন- ৬৭৫২)</b>",
        "bookID": "95.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 163640,
        "last_updated": null
    },
    {
        "banglaURN": 6072470,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 95,
        "bookName": null,
        "babNumber": 1567,
        "babName": null,
        "hadithNumber": 7247,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু মাস'ঊদ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রসূলুল্লাহ্ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ বিলালের আযান যেন তোমাদের কাউকে নিজ সাহরি খাওয়া থেকে বিরত না করে। কেননা, সে আযান দিয়ে থাকে, কিংবা বলেছিলেন আহ্বান জানায়, তোমাদের যারা সালাতরত তাদের নিরত হতে আর তোমাদের ঘুমন্তদের জাগিয়ে দিতে। এরূপ হলে ফজর হয় না- এই বলে ইয়াহ্ইয়া উভয় হাতের তালুকে একত্র করলেন (অর্থাৎ আলো উপর-নীচে দীর্ঘ হলে) বরং এমন হলে ফজর হয়, এ বলে ইয়াহ্ইয়া তার দু'তর্জনীকে ডানে-বামে বিস্তৃত করলেন।(আধুনিক প্রকাশনী- ৬৭৪০, ইসলামিক ফাউন্ডেশন- ৬৭৫৩)</b>",
        "bookID": "95.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 163650,
        "last_updated": null
    },
    {
        "banglaURN": 6072480,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 95,
        "bookName": null,
        "babNumber": 1567,
        "babName": null,
        "hadithNumber": 7248,
        "hadithSanad": "",
        "hadithText": "'আবদুল্লাহ্ ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ 'আবদুল্লাহ্ ইব্‌নু ‘উমর (রাঃ) নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণনা করেছেন। তিনি বলেছেনঃ বিলাল (রাঃ) রাত থাকতে আযান দেয়, অতএব তোমরা পানাহার কর যতক্ষন না ইব্‌নু উম্মু মাকতূম (রাঃ) আযান দেয়। [১৮৬] (আধুনিক প্রকাশনী- ৬৭৪১, ইসলামিক ফাউন্ডেশন- ৬৭৫৪)</b>",
        "bookID": "95.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 163660,
        "last_updated": null
    },
    {
        "banglaURN": 6072490,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 95,
        "bookName": null,
        "babNumber": 1567,
        "babName": null,
        "hadithNumber": 7249,
        "hadithSanad": "",
        "hadithText": "'আবদুল্লাহ্‌ (রাঃ) থেকে বর্ণিতঃ যে, তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাদের নিয়ে যুহরে পাঁচ রাক'আত আদায় করলেন। তাকে বলা হল, সালাত কি বাড়ানো হয়েছে? তিনি বললেনঃ তোমার কী হয়েছে? তাঁরা বললেন, আপনি পাঁচ রাক'আত সালাত পড়েছেন। তখন তিনি সালামের পর দু'টো সিজদা দিলেন।(আধুনিক প্রকাশনী- ৬৭৪২, ইসলামিক ফাউন্ডেশন- ৬৭৫৫)</b>",
        "bookID": "95.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 163670,
        "last_updated": null
    },
    {
        "banglaURN": 6072500,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 95,
        "bookName": null,
        "babNumber": 1567,
        "babName": null,
        "hadithNumber": 7250,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ যে, রসূলুল্লাহ্ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) দু'রাকা'আত আদায় করেই সালাত শেষ করে দিলেন। তখন যুল ইয়াদাইন (রাঃ) তাঁকে বললেন, হে আল্লাহর রসূল! সালাত কি সংক্ষিপ্ত করা হয়েছে, না আপনি ভুলে গেছেন। তিনি বললেনঃ যুল ইয়াদাইন কি ঠিক বলছে? লোকেরা বলল, হ্যাঁ। তখন রসূলুল্লাহ্ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) দাঁড়ালেন এবং অবশিষ্ট দু'রাক'আত পড়লেন। তারপর তিনি সালাম ফিরালেন এবং তাকবীর বলে তার সিজদার মত কিংবা তার চেয়ে দীর্ঘ সিজদা করলেন এবং মাথা উঠালেন, তারপর আবার তাকবীর বলে তাঁর সিজদার মত সিজদা করলেন ও মাথা উঠালেন। (আধুনিক প্রকাশনী- ৬৭৪৩, ইসলামিক ফাউন্ডেশন- ৬৭৫৬)</b>",
        "bookID": "95.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 163680,
        "last_updated": null
    },
    {
        "banglaURN": 6072510,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 95,
        "bookName": null,
        "babNumber": 1567,
        "babName": null,
        "hadithNumber": 7251,
        "hadithSanad": "",
        "hadithText": "আবদুল্লাহ্ ইব্‌নু ‘উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, লোকেরা কু'বার মসজিদে ফজরের সালাতে ছিলেন, এমন সময় এক আগন্তুক এসে বলল, রাতে রসূলুল্লাহ্ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর উপর কুরআন অবতীর্ণ করা হয়েছে এবং কা'বার দিকে মুখ করার নির্দেশ দেয়া হয়েছে। তোমরা কা'বার দিকে মুখ করে দাঁড়াও। তখন তাদের মুখ ছিল সিরিয়ার দিকে, অতঃপর তারা কা'বার দিকে ঘুরলেন।(আধুনিক প্রকাশনী- ৬৭৪৪, ইসলামিক ফাউন্ডেশন- ৬৭৫৭)</b>",
        "bookID": "95.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 163690,
        "last_updated": null
    },
    {
        "banglaURN": 6072520,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 95,
        "bookName": null,
        "babNumber": 1567,
        "babName": null,
        "hadithNumber": 7252,
        "hadithSanad": "",
        "hadithText": "বারাআ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, যখন রসূলুল্লাহ্ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) মদীনায় আসলেন, তখন ষোল অথবা সতের মাস বাইতুল মুকাদ্দাসের দিকে মুখ করে সালাত পড়লেন। আর তিনি কা'বার দিকে মুখ করতে খুবই ভালবাসতেন। অতঃপর আল্লাহ্ অবতীর্ণ করলেনঃ \"নিশ্চয়ই আমি তোমার আকাশের দিকে মুখ ফিরিয়ে দেখাকে লক্ষ্য করেছি, যে ক্বিবলা তুমি পছন্দ কর\" - (সূরা আল-বাকারা ২/১৪৪)। তখন তাঁকে কা'বার দিকে ফিরিয়ে দেয়া হয়। তাঁর সঙ্গে এক ব্যক্তি 'আসরের সালাত পড়ছিল। এরপর সে বেরিয়ে আনসারীদের এক গোত্রের নিকট দিয়ে অতিক্রম করল এবং সে সাক্ষ্য দিয়ে বলল যে, সে রসূলুল্লাহ্ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সঙ্গে সালাত পড়ে এসেছে আর কা'বার দিকে মুখ ফিরিয়ে দেয়া হয়েছে। তখন তাঁরা দিক পরিবর্তন করলেন। এ সময় তাঁরা 'আসরের সালাতে রুকূ'র হালতে ছিলেন।(আধুনিক প্রকাশনী- ৬৭৪৫, ইসলামিক ফাউন্ডেশন- ৬৭৫৮)</b>",
        "bookID": "95.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 163700,
        "last_updated": null
    },
    {
        "banglaURN": 6072530,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 95,
        "bookName": null,
        "babNumber": 1567,
        "babName": null,
        "hadithNumber": 7253,
        "hadithSanad": "",
        "hadithText": "আনাস ইব্‌নু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আবূ তালহা আনসারী, আবূ 'উবাইদাহ ইব্‌নু জাররাহ্ ও ইবাই ইব্‌নু কা'বকে আধাপাকা খেজুরের তৈরি শরাব পান করাচ্ছিলাম। তখন তাদের কাছে একজন আগন্তুক এসে বলল, শরাব হারাম করে দেয়া হয়েছে। আবূ তালহা (রাঃ) বললেন, হে আনাস! তুমি উঠে গিয়ে মটকাগুলো ভেঙ্গে ফেল। আনাস (রাঃ) বলেন, আমি উঠে গিয়ে আমাদের ঘটি দিয়ে ওগুলোর তলায় আঘাত করে ভেঙ্গে ফেললাম।(আধুনিক প্রকাশনী- ৬৭৪৬, ইসলামিক ফাউন্ডেশন- ৬৭৫৯)</b>",
        "bookID": "95.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 163710,
        "last_updated": null
    },
    {
        "banglaURN": 6072540,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 95,
        "bookName": null,
        "babNumber": 1567,
        "babName": null,
        "hadithNumber": 7254,
        "hadithSanad": "",
        "hadithText": "হুযাইফা (রাঃ) থেকে বর্ণিতঃ হুযাইফা (রাঃ) থেকে বর্ণনা করেন যে, রসূলুল্লাহ্ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) নাজরানের অধিবাসীদের উদ্দেশে বললেনঃ আমি তোমাদের জন্য অবশ্য অবশ্যই এমন একজন লোক পাঠাব, যিনি পুরোপুরি বিশ্বস্ত। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সাহাবীরা এর জন্য অপেক্ষা করছিলেন। অতঃপর তিনি আবূ 'উবাইদাকে পাঠালেন।(আধুনিক প্রকাশনী- ৬৭৪৭, ইসলামিক ফাউন্ডেশন- ৬৭৬০)</b>",
        "bookID": "95.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 163720,
        "last_updated": null
    },
    {
        "banglaURN": 6072550,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 95,
        "bookName": null,
        "babNumber": 1567,
        "babName": null,
        "hadithNumber": 7255,
        "hadithSanad": "",
        "hadithText": "আনাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ প্রত্যেক উম্মাতে একজন বিশ্বস্ত লোক থাকে আর এ উম্মাতের বিশ্বস্ত লোক হল আবূ 'উবাইদা ইব্‌নুল জাররাহ্ (রাঃ)।(আধুনিক প্রকাশনী- ৬৭৪৮, ইসলামিক ফাউন্ডেশন- ৬৭৬১)</b>",
        "bookID": "95.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 163730,
        "last_updated": null
    },
    {
        "banglaURN": 6072560,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 95,
        "bookName": null,
        "babNumber": 1567,
        "babName": null,
        "hadithNumber": 7256,
        "hadithSanad": "",
        "hadithText": "উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, এক আনসারী ছিলেন, তিনি রসূলুল্লাহ্ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট যা কিছু ঘটত তা আমি তাকে বর্ণনা করতাম। আর যখন আমি রসূলুল্লাহ্ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে অনুপস্থিত থাকতাম আর তিনি উপস্থিত থাকতেন, তখন রসূলুল্লাহ্ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট যা কিছু ঘটত তিনি এসে তা আমাকে বর্ণনা করতেন। (আধুনিক প্রকাশনী- ৬৭৪৯, ইসলামিক ফাউন্ডেশন- ৬৭৬২)</b>",
        "bookID": "95.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 163740,
        "last_updated": null
    },
    {
        "banglaURN": 6072570,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 95,
        "bookName": null,
        "babNumber": 1567,
        "babName": null,
        "hadithNumber": 7257,
        "hadithSanad": "",
        "hadithText": "আলী (রাঃ) থেকে বর্ণিতঃ যে, রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) একটি ক্ষুদ্র সেনাদল পাঠালেন এবং এক ব্যক্তিকে তাঁদের ‘আমীর নিযুক্ত করে দিলেন। তিনি (‘আমির) আগুন জ্বালালেন এবং বললেন, তোমরা এতে প্রবেশ কর। কতক লোক তাতে প্রবেশ করতে যাচ্ছিল। তখন অন্যরা বলল, আমরা তো (মুসলিম হয়ে) আগুন থেকে পালাতে চেয়েছি। অতঃপর তারা এ ঘটনা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট জানাল। তখন যাঁরা আগুনে প্রবেশ করতে চেয়েছিলেন তাদেরকে বললেনঃ যদি তারা তাতে প্রবেশ করত তাহলে কেয়ামত পর্যন্তই সেখানে থাকত। আর অন্যদেরকে বললেনঃ আল্লাহ্‌র নাফরমানীর কাজে কোনরূপ আনুগত্য নেই। আনুগত্য করতে হয় কেবলমাত্র ন্যায়সঙ্গত কাজে।(আধুনিক প্রকাশনী- ৬৭৫০, ইসলামিক ফাউন্ডেশন- ৬৭৬৩)</b>",
        "bookID": "95.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 163750,
        "last_updated": null
    },
    {
        "banglaURN": 6072581,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 95,
        "bookName": "",
        "babNumber": 1567,
        "babName": "",
        "hadithNumber": 7258,
        "hadithSanad": "",
        "hadithText": "আবূ হুরায়রা (রাঃ) ও যায়দ ইব্‌নু খালিদ (রাঃ) থেকে বর্ণিতঃ আবূ হুরায়রা (রাঃ) ও যায়দ ইব্‌নু খালিদ (রাঃ) বর্ণনা করেন যে, দু’ব্যক্তি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট একটি মুকাদ্দামা নিয়ে আসল। (আধুনিক প্রকাশনী- ৬৭৫১, ইসলামিক ফাউন্ডেশন- ৬৭৬৪)</b>",
        "bookID": "95.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 163760,
        "last_updated": null
    },
    {
        "banglaURN": 6072600,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 95,
        "bookName": null,
        "babNumber": 1567,
        "babName": null,
        "hadithNumber": 7260,
        "hadithSanad": "",
        "hadithText": "আবুল ইয়ামান (রহঃ) থেকে বর্ণিতঃ আবুল ইয়ামান (রহঃ) আবূ হুরায়রা (রাঃ) থেকে এ বর্ণনায় উল্লেখ করা হয় যে, তিনি [আবূ হুরায়রা (রাঃ)] বলেছেন,আমরা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট উপস্থিত ছিলাম। এমন সময় একজন গ্রাম্য লোক দাঁড়িয়ে বলল, হে আল্লাহ্‌র রসূল! আল্লাহ তা’আলার কিতাব অনুসারে আমার ফায়সালা করে দিন। তখন তার বিরোধী লোকটি দাঁড়িয়ে বলল, হে আল্লাহ্‌র রসূল! তিনি সত্যই বলেছেন, আল্লাহ্‌র কিতাব অনুসারে তার ফায়সালা করে দিন এবং আমাকে বলার অনুমতি দিন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাকে বললেনঃ তুমি বল। তখন সে বলল, আমার ছেলে এ লোকটির বাড়িতে মজুর ছিল। বর্ণনাকারী বলেন, হাদীসে উক্ত (আরবী) শব্দটির অর্থ মজুর। সে ছেলে এ লোকের স্ত্রীর সঙ্গে যিনা করে। কতক লোক আমাকে বলল যে, আমার ছেলেটির উপর ‘রজম’ কার্যকর হবে। তখন আমি মুক্তিপণ হিসাবে একশ বক্‌রী ও একটি দাসী দেই। অতঃপর আমি আলিমদের নিকট এ বিষয়ে জিজ্ঞেস করি। তাঁরা আমাকে বললেন যে, তাঁর স্ত্রীর জন্য ‘রজম’। আর আমার ছেলের জন্য রয়েছে একশ’ বেত্রাঘাত ও এক বছরের জন্য দেশান্তরের বিধান। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ যে সত্তার হাতে আমার প্রাণ, তাঁর শপথ করে বলছি, অবশ্য অবশ্যই আমি তোমাদের দু’জনের মাঝে সেই মহান আল্লাহ্‌র কিতাব অনুসারে ফায়সালা করব। বক্‌রী ও বাঁদী ফিরিয়ে নাও। তোমার ছেলের জন্য রয়েছে একশ’ বেত্রাঘাত ও একবছরের জন্য দেশান্তরের হুকুম। অতঃপর তিনি আসলাম গোত্রের এক লোককে ডেকে বললেন, হে উনায়স! তুমি এর স্ত্রীর নিকট যাও, যদি সে স্বীকার করে তাহলে তাকে ‘রজম’ করো। উনায়স সেই মহিলার নিকট গেলেন, সে স্বীকার করল, তখন তিনি তাকে রজম করলেন। (আধুনিক প্রকাশনী- ৬৭৫২, ইসলামিক ফাউন্ডেশন- ৬৭৬৪)</b>",
        "bookID": "95.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 163770,
        "last_updated": null
    },
    {
        "banglaURN": 6072610,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 95,
        "bookName": null,
        "babNumber": 1568,
        "babName": null,
        "hadithNumber": 7261,
        "hadithSanad": "",
        "hadithText": "জাবির (রাঃ) থেকে বর্ণিতঃ তিনি বলেন যে, খন্দকের দিনে নবী লোকদের ডাকলেন। যুবায়র (রাঃ) তাতে সাড়া দিলেন। তিনি তাদেরকে আবার আহবান জানালেন, এবারও যুবায়র (রাঃ) সাড়া দিলেন। তিনি আবার তাদের আহবান জানালেন। এবারেও যুবায়র (রাঃ) সাড়া দিলেন। তিনবার। তখন নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ প্রত্যেক নবীর একজন হাওয়ারী (সাহায্যকারী) থাকে, আর যুবায়র হচ্ছে আমার হাওয়ারী।\nসুফিয়ান (রহঃ) বলেন, আমি এ হাদীসটি মুহাম্মদ ইব্‌নু মুনকাদির থেকে হিফয করেছি।  একবার আইউব তাকে বললেন, হে আবূ বকর (রাঃ), আপনি জাবির (রাঃ)-এর হাদীস বর্ণনা করুন। কেননা, জাবির (রাঃ) বর্ণিত হাদীস লোকদের খুবই চমৎকৃত করে। তখন তিনি সে মজলিসে বললেন, আমি জাবির (রাঃ) থেকে শুনেছি। এ বলে তিনি একে একে অনেক হাদীস বর্ণনা করলেন, যেগুলো আমিও জাবির (রাঃ) থেকে শুনেছি। আমি সুফিয়ানকে বললাম যে, সাওরী বলেছেন যে, সেটা ছিল বনূ কুরায়যার যুদ্ধের দিন। তিনি বললেন, তুমি যেভাবে আমার কাছে উপবিষ্ট, ঠিক তেমনি কাছে বসে আমি মুহাম্মাদ ইবনুল মুনকাদির থেকে হিফ্‌য করেছি যে, সেটি ছিল খন্দকের দিন। সুফিয়ান বললেন, ওটা একই দিন। অতঃপর মুচকি হাসলেন। (আধুনিক প্রকাশনী- ৬৭৫৩, ইসলামিক ফাউন্ডেশন- ৬৭৬৫)</b>",
        "bookID": "95.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 163780,
        "last_updated": null
    },
    {
        "banglaURN": 6072620,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 95,
        "bookName": null,
        "babNumber": 1569,
        "babName": null,
        "hadithNumber": 7262,
        "hadithSanad": "",
        "hadithText": "আবূ মূসা আশ‘আরী (রাঃ) থেকে বর্ণিতঃ যে, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) একটি বাগানে প্রবেশ করলেন এবং আমাকে দরজা পাহারা দেয়ার জন্য নির্দেশ দিলেন। এক লোক এসে প্রবেশের অনুমতি চাইল। তিনি বললেনঃ তাকে অনুমতি দাও এবং তাকে জান্নাতের সুসংবাদ দাও। তিনি ছিলেন আবূ বকর (রাঃ)। অতঃপর ‘উমর (রাঃ) আসলেন। তিনি বললেনঃ তাঁকে অনুমতি দাও এবং জান্নাতের সুসংবাদ দাও। তারপর ‘উসমান (রাঃ) আসলেন। তিনি বললেনঃ তাকে অনুমতি দাও এবং জান্নাতের সুসংবাদ দাও।(আধুনিক প্রকাশনী- ৬৭৫৪, ইসলামিক ফাউন্ডেশন- ৬৭৬৬)</b>",
        "bookID": "95.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 163790,
        "last_updated": null
    },
    {
        "banglaURN": 6072630,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 95,
        "bookName": null,
        "babNumber": 1569,
        "babName": null,
        "hadithNumber": 7263,
        "hadithSanad": "",
        "hadithText": "উমর (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি আসলাম। তখন রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাঁর দোতালার কক্ষে ছিলেন। আর রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কালো গোলামটি দরজার সামনে দাঁড়ানো। আমি তাকে বললাম, তুমি বল, এই যে ‘উমর ইব্‌নু খাত্তাব (রাঃ) এসেছে। তিনি আমাকে অনুমতি দিলেন।(আধুনিক প্রকাশনী- ৬৭৫৫, ইসলামিক ফাউন্ডেশন- ৬৭৬৭)</b>",
        "bookID": "95.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 163800,
        "last_updated": null
    },
    {
        "banglaURN": 6072640,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 95,
        "bookName": null,
        "babNumber": 1570,
        "babName": null,
        "hadithNumber": 7264,
        "hadithSanad": "",
        "hadithText": "ইব্‌নু ‘আব্বাস (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) (পারস্যের বাদশাহ) কিস্‌সার নিকট তাঁর চিঠি পাঠালেন। তিনি দূতকে নির্দেশ দিলেন, সে যেন এ চিঠি নিয়ে বাহরাইনের শাসকের নিকট দেয়। আর বাহরাইনের শাসক যেন তা কিসরার কাছে পৌছিয়ে দেয়। কিসরা এ চিঠি পড়ে তা টুক্‌রা টুক্‌রা করে ফেলল। ইব্‌নু শিহাব বলেন, আমার ধারণা ইব্‌নু মুসাইয়্যেব বলেছেন যে, তখন রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাদের উপর বদ্‌ দু’আ করলেন, যেন আল্লাহ তাদেরকেও একেবারে টুকরো টুকরো করে দেন। [১৮৭](আধুনিক প্রকাশনী- ৬৭৫৬, ইসলামিক ফাউন্ডেশন- ৬৭৬৮)</b>",
        "bookID": "95.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 163810,
        "last_updated": null
    },
    {
        "banglaURN": 6072650,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 95,
        "bookName": null,
        "babNumber": 1570,
        "babName": null,
        "hadithNumber": 7265,
        "hadithSanad": "",
        "hadithText": "সালামা ইব্‌নু আক্‌ওয়া (রাঃ) থেকে বর্ণিতঃ বর্ণিত যে, রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আশুরার দিন আসলাম কবীলার এক লোককে বললেনঃ তোমার কওমের মধ্যে ঘোষণা কর, কিংবা বলেছিলেনঃ লোকের মাঝে ঘোষণা কর যে, যারা আহার করেছে তারা যেন অবশিষ্ট দিন পূর্ণ করে, আর যারা আহার করেনি তারা যেন সওম রাখে।(আধুনিক প্রকাশনী- ৬৭৫৭, ইসলামিক ফাউন্ডেশন- ৬৭৬৯)</b>",
        "bookID": "95.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 163820,
        "last_updated": null
    },
    {
        "banglaURN": 6072660,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 95,
        "bookName": null,
        "babNumber": 1571,
        "babName": null,
        "hadithNumber": 7266,
        "hadithSanad": "",
        "hadithText": "আবূ জামরাহ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, ইব্‌নু ‘আব্বাস (রাঃ) আমাকে তার খাটে বসাতেন। তিনি আমাকে বললেন, ‘আবদুল কায়েস গোত্রের প্রতিনিধিদল যখন রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকট আসল। তিনি বললেনঃ এ কোন্‌ প্রতিনিধিদল? তারা বলল, আমরা রাবী’আ গোত্রের। রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ গোত্র ও তার প্রতিনিধিদলকে ধন্যবাদ, যারা অপমানিত হয়নি এবং লজ্জিতও হয়নি। তারা বলল হে, আল্লাহর রসূল! আপনার ও আমাদের মাঝে মুদার গোত্রের কাফিররা (বাধা হয়ে) আছে। কাজেই আমাদের এমন আদেশ দিন, যাতে আমরা জান্নাতে প্রবেশ করতে পারি এবং আমাদের পরবর্তীদেরকেও জানাতে পারি। তারা পানীয় দ্রব্যের ব্যাপারে জিজ্ঞেস করল। তিনি তাদের চারটি বিষয় থেকে নিষেধ করলেন এবং চারটি বিষয়ের আদেশ করলেন। তিনি তাদেরকে আল্লাহ্‌র প্রতি ঈমান আনতে আদেশ করলেন। তিনি বললেনঃ আল্লাহ্‌র প্রতি ঈমান কী তোমরা জান? তারা বলল, আল্লাহ্‌ ও তাঁর রসূলই বেশি জানেন। তিনি বললেনঃ সাক্ষ্য দান করা যে, আল্লাহ্‌ ব্যতীত অন্য কোন ইলাহ্‌ নেই, তিনি একক, তাঁর কোন অংশীদার নেই। আর মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আল্লাহ্‌র রসূল এবং সালাত কায়িম করা, যাকাত দেয়া। ইব্‌নু ‘আব্বাস (রাঃ) বলেন, আমার মনে হয় তাতে সওমের কথাও ছিল। আর গনীমতের মাল হতে পাঁচ ভাগের এক ভাগ দাও এবং তিনি তাদের জন্য দুব্বা (লাউয়ের খোলের পাত্র), হান্‌তাম (মাটির সবুজ রঙের পাত্র), (মুযাফ্‌ফাত এক রকম তৈলাক্ত পাত্র), নাকীর (কাঠের খোদাই করা পাত্র) নিষেধ করলেন। কোন কোন বর্ণনায় ‘নাকীর’-এর জায়গায় ‘মুকাইয়ার’ কথাটির উল্লেখ রয়েছে। এবং তিনি তাদের বললেন, এ কথাগুলো ভাব। ভাবে মনে রেখ এবং তোমাদের পিছনে যারা আছে তাদের কাছে পৌঁছে দিও। [১৮৮](আধুনিক প্রকাশনী- ৬৭৫৮, ইসলামিক ফাউন্ডেশন- ৬৭৭০)</b>",
        "bookID": "95.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 163830,
        "last_updated": null
    },
    {
        "banglaURN": 6072670,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 95,
        "bookName": null,
        "babNumber": 1572,
        "babName": null,
        "hadithNumber": 7267,
        "hadithSanad": "",
        "hadithText": "তওবা আনবারী (রহঃ) থেকে বর্ণিতঃ তিনি বলেন, শা’বী আমাকে বললেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে হাসান (রাঃ) বর্ণিত হাদীসের (অধিক সংখ্যার) বিষয়টি কি দেখতে পাচ্ছেন না? অথচ আমি ইব্‌নু ‘উমর (রাঃ)-এর সঙ্গে দু’বছর কিংবা দেড় বছর থেকেছি। কিন্তু তাঁকে নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে এ হাদীস ব্যতীত অন্য কোন হাদীস বর্ণনা করতে শুনিনি। তিনি বলেছিলেন, নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সাহাবীদের মাঝে কতিপয় ব্যক্তি সমবেত ছিলেন, তাদের মাঝে সা’দও ছিলেন, তারা গোশ্‌ত খাচ্ছিলেন। এমন সময় নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর পত্নীদের কেউ তাদের ডেকে বললেন যে, এটা দবের গোশ্‌ত। তারা (আহার থেকে) বিরত হয়ে গেলেন। তখন রসূলুল্লাহ্‌ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ খাও বা খাওয়াও, এটা হালাল। কিংবা তিনি বললেনঃ কোন অসুবিধে নেই কোন দোষ নেই। তবে এটা আমার খাদ্য নয়।[মুসলিম ৩৪/৭, হাঃ ১৯৪৪] (আধুনিক প্রকাশনী- ৬৭৫৯, ইসলামিক ফাউন্ডেশন- ৬৭৭১)</b>",
        "bookID": "95.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 163840,
        "last_updated": null
    }
]