[
    {
        "englishURN": 821700,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "717.00",
        "babName": "Regarding Someone Who Ruins A Wife For Her Husband",
        "hadithNumber": 2170,
        "hadithText": "<p>\n\nNarrated AbuHurayrah:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: Anyone who incites a woman against her husband or a slave against his master is not one of us.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 921780,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821720,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "719.00",
        "babName": "Regarding The Adhorrence Of Divorce",
        "hadithNumber": 2172,
        "hadithText": "<p>\n\nNarrated Muharib:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: Allah did not make anything lawful more abominable to Him than divorce.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 921800,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821730,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "719.00",
        "babName": "Regarding The Adhorrence Of Divorce",
        "hadithNumber": 2173,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Umar:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: Of all the lawful acts the most detestable to Allah is divorce.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 921810,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821800,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "720.00",
        "babName": "Regarding The Divorce According To The Sunnah",
        "hadithNumber": 2180,
        "hadithText": "<p>\n\nAbdur Rahman ibn Ayman, the client of Urwah, asked Ibn Umar and Abu al-Zubayr was was listening: What do you think if a man divorces his wife while she is menstruating? He said: Abdullah ibn Umar divorced his wife while she was menstruating during the time of the Messenger of Allah (ﷺ).So Umar asked the Messenger of Allah (ﷺ) saying: Abdullah ibn Umar divorced his wife while she was menstruating. Abdullah said: He returned her to me and did not count it (the pronouncement) anything. He said: When she is purified, he may divorce her or keep her with him. Ibn Umar said: The Prophet (ﷺ) recited the Qur'anic verse: O Prophet, when you divorce women, divorce them in the beginning of their waiting period.\"\n</p>\n<p>\nAbu Dawud said: This tradition has been narrated by Yunus b. Jubair, Anas b. Sirin b. Jubair, Zaid b. Aslam, Abu al-Zubair and Mansur from Abu Wa'il on the authority of Ibn 'Umar. They all agreed on the theme that the Prophet (ﷺ) commanded him to take her back (and keep her) till she was purified. Then if he desired, he might divorce her or keep her with him if he wanted to do so. The version narrated by al-Zuhri from Salim from Nafi' on the authority of Ibn 'Umar has: The Prophet (ﷺ) commanded him to take her back (and keep her) till she is purified, and then has menstrual discharge, and then she is purified. Then if he desires, he may divorce her and if he desires he may keep her.\n</p>\n<p>\nAbu Dawud said: A version like that of Nafi' and al-Zuhri has also been transmitted by 'Ata al-Khurasani from al-Hasan on the authority of Ibn 'Umar. All the versions of this tradition contradict the one narrated by Abu al-Zubair.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 921880,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821810,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "721.00",
        "babName": "A Man Takes His Wife Back Without Any Witnesses",
        "hadithNumber": 2181,
        "hadithText": "<p>\n\nNarrated Mutarrif ibn Abdullah:\n</p>\n\n\n\n<p>\n\nImran ibn Husayn was asked about a person who divorces his wife, and then has intercourse with her, but he does not call any witness to her divorce nor to her restoration. He said: You divorced against the sunnah and took her back against the sunnah. Call someone to bear witness to her divorce, and to her return in marriage, and do not repeat it.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 921890,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821820,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "722.00",
        "babName": "Regarding The Sunnah For Divorcing Slaves",
        "hadithNumber": 2182,
        "hadithText": "<p>\n\nNarrated Umar ibn Mu'tab:\n</p>\n\n\n\n<p>\n\nAbu Hasan, a client of Banu Nawfal asked Ibn Abbas: A slave had a wife who was a slave-girl. He divorced her by two pronouncements. Afterwards both of them were freed. Is it permissible for him to ask her in marriage again? He said: Yes. This is a decision given by the Messenger of Allah (ﷺ).\n</p></b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 921900,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821830,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "722.00",
        "babName": "Regarding The Sunnah For Divorcing Slaves",
        "hadithNumber": 2183,
        "hadithText": "<p>\n\nThe aforesaid tradition (No. 2182) has also been transmitted by Ali (ibn al-Mubarak) through a different chain of narrators to the same effect. \n</p>\n\n\n<p>\n\nThis version adds: Ibn Abbas said: There remained one more pronouncement of divorce for you. The Messenger of Allah (ﷺ) took the same decision.\n</p>\n\n<p>\nAbu Dawud said: I heard Ahmad b. Hanbal say: 'Abd al-Razzaq said that Ibn al-Mubarak said to Ma'mar: Who is this Abu al-Hasan ? He bore a big rock.\n</p>\n<p>\nAbu Dawud said: Al-Zuhri has narrated (traditions) on the authority of this Abu al-Hasan. Al-Zuhri said: He was lawyer, and al-Zuhri narrated many traditions from Abu al-Hasan.\n</p>\n<p>\nAbu Dawud said: Abu al-Hasan is well known narrator. This tradition is not practiced.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 921910,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821840,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "722.00",
        "babName": "Regarding The Sunnah For Divorcing Slaves",
        "hadithNumber": 2184,
        "hadithText": "<p>\n\nNarrated Aisha, Ummul Mu'minin:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: The divorce of a slave-woman consists in saying it twice and her waiting period is two menstrual courses (qur') AbuAsim said: A similar tradition has been narrated to me by Muzahir and al-Qasim on the authority of Aisha from the Prophet (ﷺ), except that he said: And her waiting period ('iddah) is two courses.\n</p>\n<p>\nAbu Dawud said: This tradition is obscure.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 921920,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821850,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "723.00",
        "babName": "Regarding A Divorce Before The Marriage",
        "hadithNumber": 2185,
        "hadithText": "<p>\n'Amr b. Shu'aib on his father's authority said that his grandfather (Abdullah ibn Amr ibn al-'As): The Prophet (ﷺ) said: There is no divorce except in what you possess; there is no possession, there is no sale transaction till you possess. The narrator Ibn as-Sabbah added: There is no fulfilling a vow till you possess.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 921930,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821880,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "724.00",
        "babName": "Regarding Divorcing By Mistake",
        "hadithNumber": 2188,
        "hadithText": "<p>\n\nMuhammad ibn Ubayd ibn Abu Salih who lived in Ayliya said: I went out with Adi ibn Adi al-Kindi till we came to Mecca. He sent me to Safiyyah daughter of Shaybah who remembered a tradition (that she had heard) from Aisha. She said: I heard Aisha say: I heard the Messenger of Allah (ﷺ) say: There is no divorce or emancipation in case of constraint or duress (ghalaq).\n</p>\n<p>\nAbu Dawud said: I think ghalaq means anger.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 921960,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821890,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "725.00",
        "babName": "Regarding A Divorce That Was Said In Jest",
        "hadithNumber": 2189,
        "hadithText": "<p>\n\nNarrated AbuHurayrah:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: There are three things which, whether undertaken seriously or in jest, are treated as serious: Marriage, divorce and taking back a wife (after a divorce which is not final)\n</p></b>",
        "bookID": "12.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 921970,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821900,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "726.00",
        "babName": "The Abrogation Of Taking Back A Wife After The Third Divorce",
        "hadithNumber": 2190,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nDivorced women shall wait concerning themselves for three monthly periods. Nor is it lawful for them to hide what Allah hath created in their wombs. This means that if a man divorced his wife he had the right to take her back in marriage though he had divorced her by three pronouncements. This was then repealed (by a Qur'anic verse). Divorce is only permissible twice.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Hasan Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 921980,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821910,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "726.00",
        "babName": "The Abrogation Of Taking Back A Wife After The Third Divorce",
        "hadithNumber": 2191,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nAbd Yazid, the father of Rukanah and his brothers, divorced Umm Rukanah and married a woman of the tribe of Muzaynah. She went to the Prophet (ﷺ) and said: He is of no use to me except that he is as useful to me as a hair; and she took a hair from her head. So separate me from him. The Prophet (ﷺ) became furious. He called on Rukanah and his brothers. He then said to those who were sitting beside him. Do you see so-and-so who resembles Abdu Yazid in respect of so-and-so; and so-and-so who resembles him in respect of so-and-so? They replied: Yes. The Prophet (ﷺ) said to Abdu Yazid: Divorce her. Then he did so. He said: Take your wife, the mother of Rukanah and his brothers, back in marriage. He said: I have divorced her by three pronouncements, Messenger of Allah. He said: I know: take her back. He then recited the verse: \"O Prophet, when you divorce women, divorce them at their appointed periods.\"\n</p>\n<p>\nAbu Dawud said: The tradition narrated by Nafi' b. 'Ujair and 'Abd Allah b. Yazid b. Rukanah from his father on the authority of his grandfather reads: Rukanah divorced his wife absolutely (i.e. irrevocable divorce). The Prophet (ﷺ) restored her to him. This version is sounder (than other versions), for they (i.e. these narrators) are the children of his man, and the members of the family are more aware of his case. Rukanah divorced his wife absolutely (i.e. three divorces in one pronouncement) and the Prophet (ﷺ) made it a single divorce.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 921990,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821940,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "726.00",
        "babName": "The Abrogation Of Taking Back A Wife After The Third Divorce",
        "hadithNumber": 2194,
        "hadithText": "<p>\n\nTawus said: Abu al-Sahba' said to Ibn Abbas: Do you know that a divorce by three pronouncements was made a single one during the time of the Prophet (ﷺ), and of AbuBakr and in the early days of the caliphate of Umar? He replied: Yes.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 922030,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821980,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "729.00",
        "babName": "Regarding The Phrase: 'Your Matter Is In Your Hands'",
        "hadithNumber": 2198,
        "hadithText": "<p>\n\nHammad ibn Zayd said: I asked Ayyub: Do you know anyone who narrates the tradition narrated by Al-Hasan about uttering the words (addressing wife). \"Your matter is in your hand\"? He replied: No, except something similar transmitted by Qatadah from Kathir, the client of Samurah, from AbuSalamah on the authority of AbuHurayrah from the Prophet (ﷺ). Ayyub said: Kathir then came to us; so I asked him (about this matter). He replied: I never narrated it. I mentioned it to Qatadah who said: Yes (he narrated it) but he forgot.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 922070,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822020,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "730.00",
        "babName": "Regarding An Irrevocable (Al-Battah) Divorce",
        "hadithNumber": 2202,
        "hadithText": "<p>\n'Ali b. Yazid b. Rukanah reported on the authority of his father from his grandfather that he  (Rukanah) divorced his wife absolutely; so he came to the Messenger of Allah (ﷺ). He asked (him): What did you intend? He said: A single utterance of divorce. He said: Do you swear by Allah? He replied: I swear by Allah. He said: It stands as you intended.\n</p>\n<p>\nAbu Dawud said: This tradition is sounder than that of Ibn Juraij that Rukanah divorced his wife by three pronouncements, for they are the members of his family and they are more aware for him. The tradition of Ibn Juraij has been narrated by some children of Abu Rafi' from 'Ikrimah on the authority of Ibn 'Abbas.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 922110,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822040,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "732.00",
        "babName": "Regarding A Man Calling His Wife: \"My Sister\"",
        "hadithNumber": 2204,
        "hadithText": "<p>\n\nNarrated Tamimah al-Hujayni:\n</p>\n\n\n\n<p>\n\nA man said to his wife: O my younger sister! The Messenger of Allah (ﷺ)said: Is she your sister? He (the Prophet disliked it and prohibited saying so.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 922130,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822070,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "733.00",
        "babName": "Regarding Az-Zihar",
        "hadithNumber": 2207,
        "hadithText": "<p>\n\nNarrated Salamah ibn Sakhr al-Bayadi:\n</p>\n\n\n\n<p>\n\nI was a man who was more given than others to sexual intercourse with women. When the month of Ramadan came, I feared lest I should have intercourse with my wife, and this evil should remain with me till the morning. So I made my wife like my mother's back to me till the end of Ramadan. But one night when she was waiting upon me, something of her was revealed. Suddenly I jumped upon her. When the morning came I went to my people and informed them about this matter.  \n</p>\n\n\n<p>\n\nI said: Go along with me to the Messenger of Allah (ﷺ).  \n</p>\n\n\n<p>\n\nThey said: No, by Allah. So I went to the Prophet (peace be upon him and informed him of the matter.  \n</p>\n\n\n<p>\n\nHe said: Have you really committed it, Salamah?  I said: I committed it twice, Messenger of Allah. I am content with the Commandment of Allah, the Exalted; so take a decision about me according to what Allah has shown you.  \n</p>\n\n\n<p>\n\nHe said: Free a slave.  I said: By Him Who sent you with truth, I do not possess a neck other than this: and I struck the surface of my neck.  \n</p>\n\n\n<p>\n\nHe said: Then fast two consecutive months. I said: Whatever I suffered is due to fasting.  \n</p>\n\n\n<p>\n\nHe said: Feed sixty poor people with a wasq of dates.  \n</p>\n\n\n<p>\n\nI said: By Him Who sent you with truth, we passed the night hungry; there was no food in our house.  \n</p>\n\n\n<p>\n\nHe said: Then go to the collector of sadaqah of Banu Zurayq; he must give it to you. Then feed sixty poor people with a wasq of dates; and you and your family eat the remaining dates. Then I came back to my people, and said (to them): I found with you poverty and bad opinion; and I found with the Prophet (ﷺ) prosperity and good opinion. He has commanded me to give alms to you.  \n</p>\n\n\n<p>\n\nIbn al-Ala' added: Ibn Idris said: Bayadah is a sub-clan of Banu Zurayq.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 922160,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822080,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "733.00",
        "babName": "Regarding Az-Zihar",
        "hadithNumber": 2208,
        "hadithText": "<p>\n\nNarrated Khuwaylah, daughter of Malik ibn Tha'labah:\n</p>\n\n\n\n<p>\n\nMy husband, Aws ibn as-Samit, pronounced the words: You are like my mother. So I came to the Messenger of Allah (ﷺ), complaining to him about my husband.  \n</p>\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) disputed with me and said: Remain dutiful to Allah; he is your cousin.  \n</p>\n\n\n<p>\n\nI continued (complaining) until the Qur'anic verse came down: \"Certainly has Allah heard the speech of the one who argues with you, [O Muhammad], concerning her husband...\" [58:1] till the prescription of expiation.  \n</p>\n\n\n<p>\n\nHe then said: He should set free a slave.  She said: He cannot afford it.  He said: He should fast for two consecutive months.  She said: Messenger of Allah, he is an old man; he cannot keep fasts.  He said: He should feed sixty poor people.  She said: He has nothing which he may give in alms. At that moment an araq (i.e. date-basket holding fifteen or sixteen sa's) was brought to him.  \n</p>\n\n\n<p>\n\nI said: I shall help him with another date-basked ('araq).  He said: You have done well. Go and feed sixty poor people on his behalf, and return to your cousin.  The narrator said: An araq holds sixty sa's of dates.\n</p>\n<p>\nAbu Dawud said: She atoned on his behalf without seeking his permission.\n</p>\n<p>\nAbu Dawud said: This man (Aws b. al-Samit) is the brother of 'Ubadah b. al-Samit.\n</p></b>",
        "bookID": "12.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 922170,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 822120,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "733.00",
        "babName": "Regarding Az-Zihar",
        "hadithNumber": 2212,
        "hadithText": "<p>\n\nNarrated Hisham b. 'Urwah:\n</p>\n\n\n\n<p>\n\nKhawlah was the wife of Aws ibn as-Samit; he was a man immensely given to sexual intercourse. When his desire for intercourse was intensified, he made his wife like his mother's back. So Allah, the Exalted, sent down Qur'anic verses relating to expiation for zihar.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 922220,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822140,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "733.00",
        "babName": "Regarding Az-Zihar",
        "hadithNumber": 2214,
        "hadithText": "<p>\n\nNarrated Ikrimah:\n</p>\n\n\n\n<p>\n\nA man made his wife like the back of his mother. He then had intercourse with her before he atoned for it. He came to the Prophet (ﷺ) and informed him of this matter. He asked (him): What moved you to the action you have committed? He replied: I saw the whiteness of her shins in moon light. He said: Keep away from her until you expiate for your deed.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 922240,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822180,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "734.00",
        "babName": "Regarding Khul'",
        "hadithNumber": 2218,
        "hadithText": "<p>\n\nNarrated Thawban:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: If any woman asks her husband for divorce without some strong reason, the odour of Paradise will be forbidden to her.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 922290,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822190,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "734.00",
        "babName": "Regarding Khul'",
        "hadithNumber": 2219,
        "hadithText": "<p>\n\nAmrah, daughter of 'Abd al-Rahman ibn Sa'd ibn Zurarah, reported on the authority of Habibah, daughter of Sahl al-Ansariyyah: She (Habibah) was the wife of Thabit ibn Qays ibn Shimmas. The Messenger of Allah (ﷺ) came out one morning and found Habibah by his door.  \n</p>\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) said: Who is this?  She replied: I am Habibah, daughter of Sahl. He asked: What is your case?  She replied: I and Thabit ibn Qays, referring to her husband, cannot live together.  \n</p>\n\n\n<p>\n\nWhen Thabit ibn Qays came, the Messenger of Allah (ﷺ) said to him: This is Habibah, daughter of Sahl, and she has mentioned (about you) what Allah wished to mention.  \n</p>\n\n\n<p>\n\nHabibah said: Messenger of Allah, all that he gave me is with me.  \n</p>\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) said to Thabit ibn Qays: Take it from her. So he took it from her, and she lived among her people (relatives).\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 922300,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822200,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "734.00",
        "babName": "Regarding Khul'",
        "hadithNumber": 2220,
        "hadithText": "<p>\n\nNarrated Aisha, Ummul Mu'minin:\n</p>\n\n\n\n<p>\n\nHabibah daughter of Sahl was the wife of Thabit ibn Qays Shimmas He beat her and broke some of her part. So she came to the Prophet (ﷺ) after morning, and complained to him against her husband. The Prophet (ﷺ) called on Thabit ibn Qays and said (to him): Take a part of her property and separate yourself from her. He asked: Is that right, Messenger of Allah? He said: Yes. He said: I have given her two gardens of mine as a dower, and they are already in her possession. The Prophet (ﷺ) said: Take them and separate yourself from her.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 922310,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822210,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "734.00",
        "babName": "Regarding Khul'",
        "hadithNumber": 2221,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nThe wife of Thabit ibn Qays separated herself from him for a compensation. The Prophet (ﷺ) made her waiting period a menstrual course.\n</p>\n\n<p>\nAbu Dawud said: This tradition has been transmitted by 'Abd al-Razzaq from Ma'mar from 'Amr b. Muslim from 'Ikrimah from the Prophet (ﷺ) in a mursal form (i.e. missing the link of the Companion).\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 922320,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822280,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "737.00",
        "babName": "When Will She Have Such An Option ?",
        "hadithNumber": 2228,
        "hadithText": "<p>\n\nNarrated Aisha, Ummul Mu'minin:\n</p>\n\n\n\n<p>\n\nBarirah was emancipated, and she was the wife of Mughith, a slave of Aal AbuAhmad. The Messenger of Allah (ﷺ) gave her choice, and said to her: If he has intercourse with you, then there is no choice for you.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 922390,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822290,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "738.00",
        "babName": "If Two Slaves Are Set Free Together, Does The Wife Have The Option ?",
        "hadithNumber": 2229,
        "hadithText": "<p>\n\nAl-Qasim said: Aisha intended to set free two slaves of her who were spouses. She, therefore, asked the Prophet (ﷺ) about this matter. He commanded to begin with the man before the woman. The narrator Nasr said: Abu 'Ali al-Hanafi reported it to me on the authority of Ubaydullah.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 922400,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822300,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "739.00",
        "babName": "If One Of The Two Who Are Married Accepts Islam",
        "hadithNumber": 2230,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nA man came after embracing Islam during the time of the Messenger of Allah (ﷺ). Afterwards his wife came after embracing Islam. He said: Messenger of Allah, she embraced Islam along with me; so restore her to me.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 922410,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822310,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "739.00",
        "babName": "If One Of The Two Who Are Married Accepts Islam",
        "hadithNumber": 2231,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nA woman embraced Islam during the time of the Messenger of Allah (ﷺ); she then married. Her (former) husband then came to the Prophet (ﷺ) and said: Messenger of Allah, I have already embraced Islam, and she had the knowledge about my Islam. The Messenger of Allah (ﷺ) took her away from her latter husband and restored her to her former husband.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 922420,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822320,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "740.00",
        "babName": "Up Till When Will She Be Returned To Her Husband If He Accepts Islam After Her ?",
        "hadithNumber": 2232,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) restored his daughter Zaynab to Abul'As on the basis of the previous marriage, and he did not do anything afresh.\n</p>\n\n<p>\nMuhammad b. 'Amr said in his version: After six years. Al-Hasan b. 'Ali said: After two years.\n</p></b>",
        "bookID": "12.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 922430,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 822330,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "741.00",
        "babName": "Regarding A Man Who Was Married To More Than Four Women, Or To Two Sisters, And Then He Accepts Islam",
        "hadithNumber": 2233,
        "hadithText": "<p>\n\nNarrated Al-Harith ibn Qays al-Asadi:\n</p>\n\n\n\n<p>\n\nI embraced Islam while I had eight wives. So I mentioned it to the Prophet (ﷺ). The Prophet (said) said: Select four of them.\n</p>\n<p>\nAbu Dawud said: This tradition has also been narrated to us by Ahmad b. Ibrahim from Hushaim. He said: Qais b. al-Harith instead of al-Harith b. Qais. Ahmad b. Ibrahim said: This is correct, i.e. Qais b. al-Harith.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 922440,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822350,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "741.00",
        "babName": "Regarding A Man Who Was Married To More Than Four Women, Or To Two Sisters, And Then He Accepts Islam",
        "hadithNumber": 2235,
        "hadithText": "<p>\nAl-Dahhak b. Firuz reported on the authority of his father:  I said: Messenger of Allah, I have embraced Islam and two sisters are my wives. He said: Divorce any one of them you wish.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 922460,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822360,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "742.00",
        "babName": "If One Of The Parents Accepts Islam, Who Is The Child Given To ?",
        "hadithNumber": 2236,
        "hadithText": "<p>\n\n'Abd al-Hamid ibn Ja'far reported from his father on the authority of his grandfather Rafi' ibn Sinan that he (Rafi' ibn Sinan) embraced Islam and his wife refused to embrace Islam. She came to the Prophet (ﷺ) and said: My daughter; she is weaned or about to wean. Rafi' said: My daughter. The Prophet (ﷺ) said to him: Be seated on a side. And he said to her: Be seated on a side. He then seated the girl between them, and said to them: Call her. The girl inclined to her mother. The Prophet (ﷺ) said: O Allah! guide her. The daughter then inclined to her father, and he took her.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 922470,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822470,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "743.00",
        "babName": "Regarding Li'an (Mutual Cursing)",
        "hadithNumber": 2247,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nWhen the Prophet (ﷺ) ordered a man and his wife to invoke curses on each other, he ordered a man to put his hand on his mouth when he came to the fifth utterance, saying that it would be the deciding one.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 922580,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822521,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "743.00",
        "babName": "Regarding Li'an (Mutual Cursing)",
        "hadithNumber": 2252,
        "hadithText": "<p>\nIbn ‘Umar said A man invoked curses on his wife (charging her of adultery) during the time of Apostle of Allaah(ﷺ) and disowned the child. The Apostle of Allaah(ﷺ) therefore separated them and attributed the child to the woman.\nAbu Dawud said “The words narrated by Malik alone are “and he attributed the child to the woman.”\"\n</p>\n<p>\nAbu Dawud said: The words narrated by Malik alone are: \"and he attributed the child to the woman.\"\n</p>\n<p>\nYunus narrated from Al Zuhri on the authority of Sahl bin Sa’d in the tradition regarding li’an(invoking curses). He disowned her conception hence her child was attributed to her.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 922620,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822550,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "744.00",
        "babName": "Doubting The Child's Paternity",
        "hadithNumber": 2255,
        "hadithText": "<p>\n\nNarrated AbuHurayrah:\n</p>\n\n\n\n<p>\n\nA bedouin came to the Prophet (ﷺ), and said: My wife has given birth to a black son, and I disown him. He then narrated the rest of the tradition to the same effect.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 922650,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822560,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "745.00",
        "babName": "Severe Reprimand Regarding Negating One's Child",
        "hadithNumber": 2256,
        "hadithText": "<p>\n\nNarrated AbuHurayrah:\n</p>\n\n\n\n<p>\n\nAbuHurayrah heard the Messenger of Allah (ﷺ) say when the verse about invoking curses came down: Any woman who brings to her family one who does not belong to it has nothing to do with Allah (i.e. expects no mercy from Allah), and Allah will not bring her into His Paradise. \n</p>\n\n\n<p>\n\nAllah, the Exalted, will veil Himself from any man who disowns his child when he looks at him, and disgrace him in the presence of all creatures, first and last.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 922660,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822570,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "746.00",
        "babName": "Claiming An Illegitimate Son",
        "hadithNumber": 2257,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: There is no prostitution in Islam. If anyone practised prostitution in pre-Islamic times, the child will be attributed to the master (of the slave-woman). He who claims his child without a valid marriage or ownership will neither inherit nor be inherited.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 922670,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822580,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "746.00",
        "babName": "Claiming An Illegitimate Son",
        "hadithNumber": 2258,
        "hadithText": "<p>\n'Amr b. Shu'aib on his father's authority said that his grandfather reported: The Prophet (ﷺ) decided regarding one who was treated as a member of a family after the death of his father, to whom he was attributed when the heirs said he was one of them, that if he was the child of a slave-woman whom the father owned when he had intercourse with her, he was included among those who sought his inclusion, but received none of the inheritance which was previously divided; he, however, received his portion of the inheritance which had not already been divided; but if the father to whom he was attributed had disowned him, he was not joined to the heirs. \n</p>\n\n\n<p>\n\nIf he was a child of a slave-woman whom the father did not possess or of a free woman with whom he had illicit intercourse, he was not joined to the heirs and did not inherit even if the one to whom he was attributed is the one who claimed paternity, since he was a child of fornication whether his mother was free or a slave.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 922680,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822600,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "747.00",
        "babName": "Regarding Al-Qafah",
        "hadithNumber": 2260,
        "hadithText": "<p>\n\nNarrated Aisha, Ummul Mu'minin:\n</p>\n\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) entered  upon me. The version of Musaddad and Ibn as-Sarh has: one day looking pleased\". The version of Uthman has: \"The lines of his forehead were realised.\" He said: O Aisha, are you not surprised to hear that Mujazziz al-Mudlaji saw that Zayd and Usamah had a rug over them concerning their heads and letting their feet appear. He said: These feet are related.\n</p>\n\n<p>\nAbu Dawud: Usamah was black and Zaid was white.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 922700,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822620,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "748.00",
        "babName": "Those Who Said That Lots Should Be Drawn If They Differ About The Child",
        "hadithNumber": 2262,
        "hadithText": "<p>\n\nNarrated Zayd ibn Arqam:\n</p>\n\n\n\n<p>\n\nI was sitting with the Prophet (ﷺ). A man came from the Yemen, and said: Three men from the people of the Yemen came to Ali, quarrelling about a child, asking him to give a decision. They had had sexual intercourse with a woman during a single state of purity.  \n</p>\n\n\n<p>\n\nHe said to two of them: Give this child to this man (the third person) with pleasure. But they (refused and) cried loudly. Again he said to two of them: Give the child to the man (the third person) willingly. But they (refused and) cried loudly. He then said: You are quarrelsome partners. I shall cast lots among you; he who receives the lot, will acquire the child, and he shall pay two-thirds of the blood-money to both his companions. He then cast lots among them, and gave the child to the one who received the lot. The Messenger of Allah (ﷺ) laughed so much that his canine or molar teeth appeared.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 922720,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822630,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "748.00",
        "babName": "Those Who Said That Lots Should Be Drawn If They Differ About The Child",
        "hadithNumber": 2263,
        "hadithText": "<p>\n\nNarrated Zayd ibn Arqam:\n</p>\n\n\n\n<p>\n\nThree persons were brought to Ali (Allah be pleased with him) when he was in the Yemen. They and sexual intercourse with a woman during a single state of purity. He asked two of them: Do you acknowledge this child for this (man)? They replied: No. He then put this (question) to all of them. Whenever he asked two of them, they replied in the negative. He, therefore, cast a lot among them, and attributed the child to the one who received the lot. He imposed two-third of the blood-money (i.e. the price of the mother) on him. This was then mentioned to the Prophet (ﷺ) and he laughed so much that his molar teeth appeared.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 922730,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822670,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "750.00",
        "babName": "\"The Child Belongs To The Bed\"",
        "hadithNumber": 2267,
        "hadithText": "<p>\n'Amr b. Shu'aib on his father's authority said that his grandfather reported: A man got up and said: Messenger of Allah, so-and-so is my son; I had illicit intercourse with his mother in the pre-Islamic period. The Messenger of Allah (ﷺ) said: There is no unlawful claiming of paternity in Islam. What was done in pre-Islamic times has been annulled. The child is attributed to the one on whose bed it is born, and the fornicator is deprived of any right.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Hasan Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 922770,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822680,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "750.00",
        "babName": "\"The Child Belongs To The Bed\"",
        "hadithNumber": 2268,
        "hadithText": "<p>\n\nRabah said: My people married me to a Roman slave-girl of theirs. I had intercourse with her, and she gave birth to a black (male) child like me. I named it Abdullah. I again had intercourse with her, and she gave birth to a black (male) child like me. I named it Ubaydullah. Then a Roman slave of my people, called Yuhannah, incited her, and spoke to her in his own unintelligible language. She gave birth to a son like a chameleon (red).  \n</p>\n\n\n<p>\n\nI asked her: What is this?  She replied: This belongs to Yuhannah. We then brought the case to Uthman (for a decision). I think Mahdi said these words. He inquired from both of them, and they acknowledged (the facts).  \n</p>\n\n\n<p>\n\nHe then said to them: Do you agree that I take the decision about you, which the Messenger of Allah (ﷺ) had taken? The Messenger of Allah (ﷺ) decided that the child was to attributed to the one on whose bed it was born. And I think he said: He flogged her and flogged him, for they were slaves.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 922780,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822690,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "751.00",
        "babName": "Who Has More Right To Take The Child ?",
        "hadithNumber": 2269,
        "hadithText": "<p>\n'Amr b. Shu'aib on his father's authority said that his grandfather (Abdullah ibn Amr ibn al-'As) reported: A woman said: Messenger of Allah, my womb is a vessel to this son of mine, my breasts, a water-skin for him, and my lap a guard for him, yet his father has divorced me, and wants to take him away from me. The Messenger of Allah (ﷺ) said: You have more right to him as long as you do not marry.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 922790,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822700,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "751.00",
        "babName": "Who Has More Right To Take The Child ?",
        "hadithNumber": 2270,
        "hadithText": "<p>\n\nHilal ibn Usamah quoted Abu Maimunah Salma, client of the people of Medina, as saying: While I was sitting with AbuHurayrah, a Persian woman came to him along with a son of hers. She had been divorced by her husband and they both claimed him.  \n</p>\n\n\n<p>\n\nShe said: AbuHurayrah, speaking to him in Persian, my husband wishes to take my son away.  \n</p>\n\n\n<p>\n\nAbuHurayrah said: Cast lots for him, saying it to her in a foreign language.  \n</p>\n\n\n<p>\n\nThen her husband came and asked: Who is disputing with me about my son?  \n</p>\n\n\n<p>\n\nAbuHurayrah said: O Allah, I do not say this, except that I heard a woman who came to the Messenger of Allah (ﷺ) while I was sitting with him, and she said: My husband wishes to take away my son, Messenger of Allah, and he draws water for me from the well of AbuInabah, and he has been good to me.  \n</p>\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) said: Cast lots for him.  Her husband said: Who is disputing with me about my son?  The Prophet (ﷺ) said: This is your father and this your mother, so take whichever of them you wish by the hand. So he took his mother's hand and she went away with him.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 922800,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822710,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "751.00",
        "babName": "Who Has More Right To Take The Child ?",
        "hadithNumber": 2271,
        "hadithText": "<p>\n\nNarrated Ali ibn AbuTalib:\n</p>\n\n\n\n<p>\n\nZayd ibn Harithah went out to Mecca and brought the daughter of Hamzah with him. Then Ja'far said: I shall take her; I have more right to her; she is my uncle's daughter and her maternal aunt is my wife; the maternal aunt is like mother. Ali said: I am more entitled to take her. She is my uncle's daughter. The daughter of the Messenger of Allah (ﷺ) is my wife, and she has more right to her. Zayd said: I have more right to her. I went out and journeyed to her, and brought her with me. The Prophet (ﷺ) came out. \n</p>\n\n\n<p>\n\nThe narrator mentioned the rest of the tradition. He (i.e. the Prophet) said: As for the girl, I decided in favour of Ja'far. She will live with her maternal aunt. The maternal aunt is like mother.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 922810,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822730,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "751.00",
        "babName": "Who Has More Right To Take The Child ?",
        "hadithNumber": 2273,
        "hadithText": "<p>\n\nNarrated Ali ibn AbuTalib:\n</p>\n\n\n\n<p>\n\nWhen we came out from Mecca, Hamzah's daughter pursued us crying: My uncle. Ali lifted her and took her by the hand. (Addressing Fatimah he said:) Take your uncle's daughter. She then lifted her. The narrator then transmitted the rest of the tradition. Ja'far said: She is my uncle's daughter. Her maternal aunt is my wife. The Prophet (ﷺ) decided in favour of her maternal aunt, and said: The maternal aunt is like mother.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 922830,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822740,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "752.00",
        "babName": "Regarding The Waiting Period Of A Divorced Woman",
        "hadithNumber": 2274,
        "hadithText": "<p>\n\nAmr ibn Muhajir reported on the authority of his father: Asma', daughter of Yazid ibn as-Sakan al-Ansariyyah, was divorced in the time of the Messenger of Allah (ﷺ). No waiting period was prescribed for a divorced woman (at that time). When Asma' was divorced, Allah, the Exalted, sent down the injunction of waiting period for divorce. She is the first of the divorced women about whom the verse relating to waiting period was sent down.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 922840,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822750,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "753.00",
        "babName": "The Abrogation Of The Waiting Period For One Type Of Divorce",
        "hadithNumber": 2275,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nWomen who are divorced shall wait, keeping themselves apart, three monthly courses; and then said: And for such of your women as despair of menstruation, if ye doubt, their period (of waiting) shall be three months. This was abrogated from the former verse. Again he said: (O ye who believe, if ye wed believing women) and divorce them before ye have touched them, then there is no period that ye should reckon.\"\n</p></b>",
        "bookID": "12.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 922850,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822760,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "754.00",
        "babName": "Regarding Taking Divorced Women Back",
        "hadithNumber": 2276,
        "hadithText": "<p>\n\nNarrated Umar ibn al-Khattab:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) divorced Hafsah, but he took her back in marriage.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 922860,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822820,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "755.00",
        "babName": "Regarding The Maintenance Of One Who Has Been Irrevocably Divorced",
        "hadithNumber": 2282,
        "hadithText": "<p>\n\nAbu Salamah reported on the authority of Fatimah daughter of Qays who said to him that she was the wife of AbuHafs ibn al-Mughirah who divorced her by three pronouncements. She said that she came to the Messenger of Allah (ﷺ) and sought his opinion about her going out from her house. He commanded her to shift to (the house of )Ibn Umm Maktum who was blind. Marwan denied to confirm the tradition of Fatimah about the going out of a divorced woman from her house. Urwah said: Aisha objected to Fatimah daughter of Qays.\n</p>\n\n<p>\nAbu Dawud said: Salih b. Kaisan, Ibn Juraij, and Shu'aib b. Abi Hamzah -- all of them narrated on the authority of al-Zuhru in a similar way.\n</p>\n\n</p>\nAbu Dawud said: Shu'aibn b. Abi Hamzah the name of Abu Hamzah is Dinar. He is a client of Ziyad.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 115,
        "matchingArabicURN": 922920,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822850,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "756.00",
        "babName": "Whoever Rejected What Fatimah Bint Qais Said",
        "hadithNumber": 2285,
        "hadithText": "<p>\n\nUrwah said: Aisha (Allah be pleased with her) severely objected to the tradition of Fatimah daughter of Qays. She said: Fatimah lived in a desolate house and she feared for her loneliness there. Hence the Messenger of Allah (ﷺ) accorded permission to her (to leave the place).\n</p></b>",
        "bookID": "12.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 118,
        "matchingArabicURN": 922950,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822860,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "756.00",
        "babName": "Whoever Rejected What Fatimah Bint Qais Said",
        "hadithNumber": 2286,
        "hadithText": "<p>\n\nUrwah ibn az-Zubayr said: Aisha was asked: Did you not see (i.e. known) the statement of Fatimah? She replied: It is not good for her to mention it (to others).\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 119,
        "matchingArabicURN": 922960,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822880,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "756.00",
        "babName": "Whoever Rejected What Fatimah Bint Qais Said",
        "hadithNumber": 2288,
        "hadithText": "<p>\n\nAl-Qasim ibn Muhammad and Sulayman ibn Yasar reported: Yahya ibn Sa'id ibn al-'As divorced the daughter of 'Abd al-Rahman ibn al-Hakam absolutely. 'Abd al-Rahman shifted her (from there). Aisha sent a message to Marwan ibn al-Hakam who was the governor of Medina, and said to him: Fear Allah, and return the woman to her home. Marwan said (according to Sulayman's version): 'Abd al-Rahman forced me. Marwan said (according to the version of al-Qasim): Did not the case of Fatimah daughter of Qays reach you? Aisha replied: There would be no harm to you if you did not make mention of the tradition of Fatimah. Marwan said: If you think that it was due to some evil (i.e. reason), then it is sufficient for you to see that there is also an evil between the two.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 121,
        "matchingArabicURN": 922980,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822920,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "759.00",
        "babName": "The Rulings Of Mourning For Woman Whose Husband Has Died",
        "hadithNumber": 2292,
        "hadithText": "<p>\n\nHumaid ibn Nafi' reported the following three traditions on the authority of Zaynab, daughter of Abu Salamah:  \n</p>\n\n\n<p>\n\nZainab said: I visited Umm Habibah when her father AbuSufyan, died. She asked for some yellow perfume containing saffron (khaluq) or something else. Then she applied it to a girl and touched her cheeks.  \n</p>\n\n\n<p>\n\nShe said: I have no need of perfume, but I heard the Messenger of Allah (ﷺ) say: It is not lawful for a woman who believes in Allah and the Last Day to observe mourning for one who has died, more than three nights, except for four months and ten days in the case of a husband.  \n</p>\n\n\n<p>\n\nZaynab said: I also visited Zaynab, daughter of Jahsh, when her brother died. She asked for some perfume and used it upon herself.  \n</p>\n\n\n<p>\n\nShe then said: I have no need of perfume, but I heard the Messenger of Allah (ﷺ) say when he was on the pulpit: It is not lawful for a woman who believes in Allah and the Last Day to observe mourning for one who has died, more than three nights, except for four months and ten days in the case of a husband.  \n</p>\n\n\n<p>\n\nZaynab said: I heard my mother, Umm Salamah, say: A woman came to the Messenger of Allah (ﷺ) and said: Messenger of Allah, the husband of my daughter has died, and she is suffering from sore eyes; may we put antimony in her eyes?  \n</p>\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) said: No. He said this twice or thrice. Each time he said: No. The Messenger of Allah (ﷺ) said: The waiting period is now four months and ten days. In pre-Islamic days one of you used to throw away a piece of dung at the end of a year.  \n</p>\n\n\n<p>\n\nHumayd said: I asked Zaynab: What do you mean by throwing away a piece of dung at the end of a year.  \n</p>\n\n\n<p>\n\nZaynab replied: When the husband of a woman died, she entered a small cell and put on shabby clothes, not touching perfume or any other thing until a year passed. Then an animal such as donkey or sheep or bird was provided for her. She rubbed herself with it. The animal with which she rubbed herself rarely survived. She then came out and was given a piece of dung which she threw away. She then used perfume or something else which she desired.\n</p>\n\n<p>\nAbu Dawud said: The Arabic word \"hafsh\" means a small cell.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 125,
        "matchingArabicURN": 923020,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822930,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "760.00",
        "babName": "Regarding Such A Woman Moving To Another Residence",
        "hadithNumber": 2293,
        "hadithText": "<p>\n\nZaynab, daughter of Ka'b ibn Ujrah narrated that Furay'ah daughter of Malik ibn Sinan, told her that she came to the Messenger of Allah (ﷺ) and asked him whether she could return to her people, Banu Khidrah, for her husband went out seeking his slaves who ran away. When they met him at al-Qudum, they murdered him.  \n</p>\n\n\n<p>\n\nSo I asked the Messenger of Allah (ﷺ): \"Should I return to my people, for he did not leave any dwelling house of his own and maintenance for me?  \n</p>\n\n\n<p>\n\nShe said: The Messenger of Allah (ﷺ) replied: Yes.  She said: I came out, and when I was in the apartment or in the mosque, he called for me, or he commanded (someone to call me) and, therefore, I was called.  \n</p>\n\n\n<p>\n\nHe said: what did you say? So I repeated my story which I had already mentioned about my husband. Thereupon he said: Stay in your house till the term lapses. She said:  \n</p>\n\n\n<p>\n\nSo I passed my waiting period in it (her house) for four months and ten days. When Uthman ibn Affan became caliph, he sent for me and asked me about that; so I informed him, and he followed it and decided cases accordingly.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 126,
        "matchingArabicURN": 923030,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822970,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "762.00",
        "babName": "What Should A Woman Whose Husband Dies Avoid During Her Waiting Period ?",
        "hadithNumber": 2297,
        "hadithText": "<p>\n\nNarrated Umm Salamah, Ummul Mu'minin:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: A woman whose husband has died must not wear clothes dyed with safflower (usfur) or with red ochre (mishq) and ornaments. She must not apply henna and collyrium.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 130,
        "matchingArabicURN": 923070,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822980,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "762.00",
        "babName": "What Should A Woman Whose Husband Dies Avoid During Her Waiting Period ?",
        "hadithNumber": 2298,
        "hadithText": "<p>\n\nUmm Hakim, daughter of Usayd, reported on the authority of her mother that her husband died and she was suffering from sore eyes. She therefore applied collyrium (jala'). Ahmad said: The correct version is \"glittering collyrium (kuhl al-jala'). She sent her slave-girl to Umm Salamah, and she asked her about the use of glittering collyrium (kuhl al-jala').  \n</p>\n\n\n<p>\n\nShe said: Do not apply it except in the case of dire need which is troubling you. In that case you can use it at night, but you should remove it in the daytime. Then Umm Salamah said: The Messenger of Allah (ﷺ) came to visit me when AbuSalamah died, and I had put the juice of aloes in my eye.  \n</p>\n\n\n<p>\n\nHe asked : What is this, Umm Salamah?  I replied: It is only the juice of aloes and contains no perfume.  He said: It gives the face a glow, so apply it only at night and remove it in daytime, and do not comb yourself with scent or henna, for it is a dye.  I asked: What should I use when I comb myself, Messenger of Allah?  He said: Use lote-tree leaves and smear your head copiously with them.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 131,
        "matchingArabicURN": 923080,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 823000,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "763.00",
        "babName": "The Waiting Period Of A Pregnant Woman",
        "hadithNumber": 2300,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Mas'ud:\n</p>\n\n\n\n<p>\n\nI can invoke the curse of Allah on anyone who wishes: The smaller surat an-Nisa (i.e. Surat at-Talaq) was revealed after the verse regarding the waiting period of four months and ten days had been revealed.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 133,
        "matchingArabicURN": 923100,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 823010,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "764.00",
        "babName": "The Waiting Periid For An Umm Al-Walad",
        "hadithNumber": 2301,
        "hadithText": "<p>\n\nNarrated Amr ibn al-'As:\n</p>\n\n\n\n<p>\n\nDo not confuse us about his Sunnah. Ibn al-Muthanna said: The Sunnah of our Prophet (ﷺ) is that the waiting period of a slave-mother whose husband has died is four months and ten days.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 134,
        "matchingArabicURN": 923110,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 823020,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "765.00",
        "babName": "The Thrice Divorced Woman Cannot Return To Her Husband Until She Re-Marries",
        "hadithNumber": 2302,
        "hadithText": "<p>\n\nNarrated Aisha, Ummul Mu'minin:\n</p>\n\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) was asked about a man who divorced his wife three times, and she married another who entered upon her, but divorced her before having intercourse with her, whether she was lawful for the former husband. She said: The Prophet (ﷺ) replied: She is not lawful for the first (husband) until she tastes the honey of the other husband and he tastes her honey.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 135,
        "matchingArabicURN": 923120,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 823040,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "766.00",
        "babName": "The Gravity Of Fornication",
        "hadithNumber": 2304,
        "hadithText": "<p>\n\nNarrated Jabir ibn Abdullah:\n</p>\n\n\n\n<p>\n\nMusaykah, a slave-girl of some Ansari, came and said: My master forces me to commit fornication. Thereupon the following verse was revealed: \"But force not your maids to prostitution (when they desire chastity).\"\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 137,
        "matchingArabicURN": 923140,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 821710,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "718.00",
        "babName": "Regarding A Woman Who Askd Her Husband To Divorce Another Wife Of His",
        "hadithNumber": 2171,
        "hadithText": "Abu Hurairah reported the Apostle of Allaah(ﷺ) as saying “A woman should not ask for the divorce of her sister to make her bowl vacant for her and to marry him. She will have what is decreed for her.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 921790,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821740,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "720.00",
        "babName": "Regarding The Divorce According To The Sunnah",
        "hadithNumber": 2174,
        "hadithText": "‘Abd Allah bin Umar said that he divorced his wife while she was menstruating during the time of the Apostle of Allaah(ﷺ). So ‘Umar bin Al Khattab asked the Apostle of Allaah(ﷺ) about this matter. The Apostle of Allaah(ﷺ) said “Order him, he must take her back and keep her back till she is purified, then has another menstrual period and is purified. Thereafter if he desires he may divorce her before having intercourse with her, for that is the period of waiting which Allaah the Glorified has commanded for the divorce of women.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 921820,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821750,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "720.00",
        "babName": "Regarding The Divorce According To The Sunnah",
        "hadithNumber": 2175,
        "hadithText": "The aforesaid tradition has also been transmitted by Nafi’ through a different chain of narrators. This version says Ibn ‘Umar divorced a wife of his while she was menstruating pronouncing one divorce. He then narrated the rest of the tradition similar to the one narrated by Malik.</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 921830,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821760,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "720.00",
        "babName": "Regarding The Divorce According To The Sunnah",
        "hadithNumber": 2176,
        "hadithText": "Ibn ‘Umar said that he divorced his wife while she was menstruating. ‘Umar mentioned the matter to the Prophet(ﷺ). He (the Prophet) said “Order him, he must take her back and divorce her when she is purified (from menstrual discharge) or she is pregnant.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 921840,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821770,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "720.00",
        "babName": "Regarding The Divorce According To The Sunnah",
        "hadithNumber": 2177,
        "hadithText": "‘Abd Allah (bin Umar) said that he divorced his wife while she was menstruating. ‘Umar mentioned the matter to the Messenger of Allah(ﷺ). The Messenger of Allah(ﷺ) became angry and said “Command him, he must take her back and keep her back till she is purified, then has another menstrual period and is purified. Then if he desires he may divorce her during the period of purity before he has intercourse with her. This is the divorce for waiting period as commanded by Allaah, the Exalted.</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 921850,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821780,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "720.00",
        "babName": "Regarding The Divorce According To The Sunnah",
        "hadithNumber": 2178,
        "hadithText": "Yunus bin Jubair said that he asked Ibn ‘Umar “How many times did you pronounce divorce to your wife? He replied, once.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 921860,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821790,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "720.00",
        "babName": "Regarding The Divorce According To The Sunnah",
        "hadithNumber": 2179,
        "hadithText": "Yunus bin Jubair said “I asked ‘Abd Allah bin ‘Umar “A man divorced his wife while she was menstruating? He said do you know ‘Abd Allah bin ‘Umar? He said, yes. ‘Abd Allah bin ‘Umar divorced his wife while she was menstruating. So, ‘Umar came to the Prophet (ﷺ) and asked him (about this matter). He said Command him to take her back in marriage he may the divorce her in the beginning of the waiting period. I (Ibn Jubair) asked him “Will this divorce be counted? He said “Why not?” If he was helpless and showed his foolishness (that would have been counted).</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 921870,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821860,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "723.00",
        "babName": "Regarding A Divorce Before The Marriage",
        "hadithNumber": 2186,
        "hadithText": "The above tradition has also been transmitted by ‘Amr bin Shu’aib through a different chain of narrators to the same effect. This version adds “If anyone swears an oath to do an act of disobedience to GOD, his oath is not valid, and if anyone swears an oath to sever relationship, his oath is not valid(i.e., he must not fulfill it)</b>",
        "bookID": "12.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 921940,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821870,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "723.00",
        "babName": "Regarding A Divorce Before The Marriage",
        "hadithNumber": 2187,
        "hadithText": "The above tradition has also been transmitted by ‘Amr bin Shu’aib through a different chain of narrators. This version adds The Prophet (ﷺ) said “There is no vow except in an act which seeks the pleasure of Allah, the Exalted.</b>",
        "bookID": "12.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 921950,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821920,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "726.00",
        "babName": "The Abrogation Of Taking Back A Wife After The Third Divorce",
        "hadithNumber": 2192,
        "hadithText": "<p>\nMujahid said “I was with Ibn ‘Abbas”. A man came to him and said that he divorced his wife by three pronouncements. I kept silence and thought that he was going to restore het to him. He then said “A man goes and commits a foolish act and then says “O, Ibn ‘Abbas! Alaah has said “And for those who fear Allaah, He (ever) prepares a way out.” Since you did not keep duty to Allaah I do not find a way out for you. You disobeyed your Lord and your wife was separated from you. Allaah has said “O Prophet! When you divorce women divorce them in the beginning of their waiting period.”\n</p>\n<p>\nAbu Dawud said “This tradition has been transmitted by Humaid Al A’raj and by others from Mujahid on the authority of Ibn ‘Abbas. Shu’bjh narrated it from ‘Amr bin Murrah from Sa’id bin Jubair on the authority of Ibn ‘Abbas. Ayyub and Ibn ‘Jubair both narrated it from “’Ikrimah bin Khalid from Sa’id bin Jubair on the authority of Ibn ‘Abbas. Ibn Juraij narrated it from ‘Abd Al Hamid bin Rafi’ from ‘Ata from Ibn ‘Abbas. Al A’mash narrated it from Malik bin Al Harith on the authority of Ibn ‘Abbas. They all said about the divorce by three pronouncements. He allowed it and said” (Your wife) has been separated from you similar to the tradition narrated by Isma’il from Ayub from ‘Abd Allaah bin Kathir.”\n</p>\n<p>\nAbu Dawud said “Hammad bin Zaid narrated it from Ayyub from ‘Ikrimah on the authority of Ibn ‘Abbas. This version adds If he said “You are divorced three times saying in one pronouncement, it constitutes a single (divorce). Isma’il bin Ibrahim narrated it from Ayyub from ‘Ikrimah. This is his (‘Ikrimah’s) statement. He did not mention the name of Ibn ‘Abbas. He narrated it as a statement of ‘Ikrimah.”\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 922000,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821921,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "726.00",
        "babName": "The Abrogation Of Taking Back A Wife After The Third Divorce",
        "hadithNumber": 2192,
        "hadithText": "<p>\nAbu Dawud said “The opinion of Ibn ‘Abbas has been mentioned in the following tradition. “Ahmad bin Salih and Muhammad bin Yahya narrated this is the version of Ahmad (bin Salih)” from ‘Abd Ar Razzaq from Ma’mar from Al Zuhri from Abu Salamah din Abd Al Rahman bin ‘Awf and Muhammad bin ‘Abd Al Rahman bin Thawban from Muhammad bin Iyas that Ibn ‘Abbas, Abu Hurairah and ‘Abd Alah bin ‘Amr bin Al ‘As were asked about a virgin who is divorced three times by her husband. They all said “She is not lawful for him until she marries a man other than her former husband.”\nAbu Dawud said “Malik narrated from Yahya bin Sa’id from Bukair bin Al Ashajj from Mu’awiyah bin Abi ‘Ayyash who was present on this occasion when Muhammad bin Iyas bin Al Bukair came to Ibn Al Zubair and Asim in ‘Umar. He asked them about this matter. They replied “Go to Ibn ‘Abbas and Abu Hurairah, I have left them with A’ishah (may Allaah be pleased with her). He then narrated the rest of the tradition.”\n</p>\n<p>\nAbu Dawud said “The statement of Ibn ‘Abbas goes “The divorce by three pronouncements separates the wife from husband whether the marriage has been consummated or not, the previous husband is not lawful for her until she marries a man other than her husband”. This statement is like the tradition which deals with the exchange of money. In this tradition the narrator said “Ibn ‘Abbas withdrew his opinion.”\"\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 922010,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821930,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "726.00",
        "babName": "The Abrogation Of Taking Back A Wife After The Third Divorce",
        "hadithNumber": 2193,
        "hadithText": "Tawus said A man called Abu Al Sahba used to ask Ibn ‘Abbas questions frequently. He asked “Do you know that when a man divorced his wife by three pronouncement before sexual intercourse with her, they (the people) made it a single divorce during the time of the Apostle of Allaah(ﷺ), of Abu Bakr and in the early phase of the caliphate of ‘Umar?” Ibn “Abbas said “Yes, when a man divorced his wife by three pronouncement before sexual intercourse they made it a single divorce during the time of the Apostle of Allaah(ﷺ), of Abu Bakr and in the early phase of the caliphate of ‘Umar. When he saw that the people frequently divorced (by three pronouncements) he said “Make them operative on them (i.e., on women)”.</b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 922020,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821950,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "727.00",
        "babName": "Regarding Statements That Equate To Divorce, And Intentions",
        "hadithNumber": 2195,
        "hadithText": "‘Umar bin Al Khattab reported the Apostle of Allaah(ﷺ) as saying “Actions are to be judged only by intentions and a man will have  only what he intended. When one’s emigration is to Allaah and His Apostle, his emigration is to Allaah and His Apostle but his emigration is to a worldly end at which he aims or to a woman whom he marries , his emigration is to that for which he emigrated.</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 922040,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821960,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "727.00",
        "babName": "Regarding Statements That Equate To Divorce, And Intentions",
        "hadithNumber": 2196,
        "hadithText": "‘Abd Allah bin Ka’b reported “I heard Ka’ab bin Malik. He then narrated his story about the battle of Tabuk.(Narrating the story) he added “When forty out of fifty days passed”, the messenger of the Apostle of Allaah(ﷺ) came and said “The Apostle of Allaah(ﷺ) has commanded you to keep away from your wife. He said “So, I (Ka’b bin Malik)” said “Should I divorce her or what should I do? He said “No, but only keep away from her and do not go near her”. So, I said to my wife “Go to your people and live with them until Allaah, the exalted makes a decision in this matter.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 922050,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821970,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "728.00",
        "babName": "Regarding Allowing The Wife To Choose",
        "hadithNumber": 2197,
        "hadithText": "A’ishah said The Apostle of Allaah(ﷺ) gave us our choice and we chose him so that was not reckoned anything (i.e., divorce)</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 922060,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 821990,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "729.00",
        "babName": "Regarding The Phrase: 'Your Matter Is In Your Hands'",
        "hadithNumber": 2199,
        "hadithText": "Qatadah reported on the authority of Al Hasan the uttering of the words “Your matter is in your hand” amounts to three pronouncements of divorce.</b>",
        "bookID": "12.0",
        "grade1": "Sahih Maqtu'",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 922080,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822000,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "730.00",
        "babName": "Regarding An Irrevocable (Al-Battah) Divorce",
        "hadithNumber": 2200,
        "hadithText": "<p>\nNafi' bun Ujair bin Abd Yazid bin Ruknah reported Ruknah bin ‘Abd Yazid divorced his wife Suhaimah absolutely. The Prophet (ﷺ) was informed about this matter. He said to him (the Prophet) I swear by Allaah that I meant it to be only a single utterance of divorce. The Apostle of Allaah(ﷺ) said “I swear by Allaah that I meant it to be only a single divorce. The Apostle of Allaah(ﷺ) restored her to him, Then he divorced her the second time in the time of ‘Umar and the third time of ‘Uthman.\n</p>\n<p>\nAbu Dawud said “This tradition contains the words of Ibrahim in its beginning and the words of Ibn Al Sarh in the end.\n\n</p></b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 922090,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822010,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "730.00",
        "babName": "Regarding An Irrevocable (Al-Battah) Divorce",
        "hadithNumber": 2201,
        "hadithText": "The tradition mentioned above has also been transmitted by Rukanah bin Yazid from the Prophet (ﷺ) through a different chain of narrators.</b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 922100,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822030,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "731.00",
        "babName": "Regarding Whisperings Of Divorce",
        "hadithNumber": 2203,
        "hadithText": "Abu Hurairah reported the Prophet (ﷺ) as saying “Allah has ignored for my community what comes to their mind, so long as they do not act or pronounce words to that effect.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 922120,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822050,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "732.00",
        "babName": "Regarding A Man Calling His Wife: \"My Sister\"",
        "hadithNumber": 2205,
        "hadithText": "<p>\n\nAbu Tamimah reported from a man of his tribe “The Prophet (ﷺ) heard a man say his wife “O my younger sister! So he prohibited him (addressing his wife in this manner)\n</p>\n<p>\nAbu Dawud said “This tradition has also been transmitted by ‘Abd Al Aziz bin Al Mukhtar from Khalid from Abu ‘Uthman from Abu Thamimah from the Prophet (ﷺ). This has also been narrated by Shu’bah from Khalid from a man on the authority of Abu Thamimah from the Prophet (ﷺ).\n</p></b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 922140,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822060,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "732.00",
        "babName": "Regarding A Man Calling His Wife: \"My Sister\"",
        "hadithNumber": 2206,
        "hadithText": "<p>\nAbu Hurairah reported the Prophet(ﷺ) as saying Abraham(peace be upon him) never told a lie except on three occasions twice for the sake of Allaah. Allaah quoted his words (in the Qur’an) “I am indeed sick” and “Nay, this was done by - this is their biggest one”. Once he was passing through the land of a tyrant (king). He stayed there in a place. People went to the tyrant and informed him saying “A man has come down here; he has a most beautiful woman with him.” So he sent for him (Abraham) and asked about her. He said she is my sister. When he returned to her, he said “he asked me about you and I informed him that you were my sister. Today there is no believer except me and you. You are my sister in the Book of Allaah (i.e., sister in faith). So do not belie me before him. The narrator then narrated the rest of the tradition.\n</p>\n<p>\nAbu Dawud said “A similar tradition has also been narrated by Shu’aib bin Abi Hamza from Abi Al Zinad from Al A’raj on the authority of Abu Hurairah from the Prophet (ﷺ).\n\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 922150,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822090,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "733.00",
        "babName": "Regarding Az-Zihar",
        "hadithNumber": 2209,
        "hadithText": "<p>\nA similar tradition has been transmitted by Ibn Ishaq with a different chain of narrators. But in this version he said ‘Araq is a date-basket holding thirty sa’s.\n</p>\n<p>\nAbu Dawud said “This version is sounder than that of Yahya bin Adam.”\n</p></b>",
        "bookID": "12.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 922180,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 822100,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "733.00",
        "babName": "Regarding Az-Zihar",
        "hadithNumber": 2210,
        "hadithText": "Another version transmitted by Abu Salamah bin ‘Abd Al Rahman has ‘Araq is a date-basket holding fifteen sa’s.</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 922190,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822110,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "733.00",
        "babName": "Regarding Az-Zihar",
        "hadithNumber": 2211,
        "hadithText": "<p>\nThe tradition mentioned above has been transmitted by Sulaiman bin Yasar. This version has “Then some dates were brought to the Apostle of Allaah(ﷺ) and he gave it him. They measured about fifteen sa’s “. He said “Give them in alms”. He said “Is there anyone needier than I and my family. Apostle of Allaah(ﷺ)?” The Apostle of Allaah(ﷺ) said “Eat them, you and your family.”\n</p></b>",
        "bookID": "12.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 922200,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822111,
        "collection": "abudawud",
        "volumeNumber": 2,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "733.00",
        "babName": "Regarding Az-Zihar",
        "hadithNumber": 2211,
        "hadithText": "<p>\nAbu Dawud said “I recited to Muhammad bin Wazir Al Misri and said to him Bishr bin Bakr narrated it to you and Al Auza’i narrated it to us. And he said “At’a narrated it to us on the authority of Aus brother of ‘Ubadah bin Al Samit. The Prophet (ﷺ) gave him fifteen sa’s of wheat to feed sixty poor people.\n</p>\n<p>\nAbu Dawud said At’a did not meet Aws (bin Al Samit) who was one of the people of Badr and died in the early days of Islam. This version is therefore, mursal (i.e., a successor narrated it directly from the Prophet (ﷺ), the link of the Companions is missing). This has been narrated by Al Auza’i from At’a from Aus.\n\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 922210,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822130,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "733.00",
        "babName": "Regarding Az-Zihar",
        "hadithNumber": 2213,
        "hadithText": "A similar tradition has been transmitted by A’ishah through a different chain of narrators.</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 922230,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822150,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "733.00",
        "babName": "Regarding Az-Zihar",
        "hadithNumber": 2215,
        "hadithText": "‘Ikrimah said “A man made his wife like the back of his mother. When he saw the illumination of her shin in the moonlight, he had intercourse with her. He came to the Prophet (ﷺ). He ordered him to atone for it.</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 922250,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822160,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "733.00",
        "babName": "Regarding Az-Zihar",
        "hadithNumber": 2216,
        "hadithText": "A similar tradition has been transmitted by Ibn ‘Abbas from the Prophet (ﷺ) through a different chain of narrators. This version does not mention the word “shin”.</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 922260,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822170,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "733.00",
        "babName": "Regarding Az-Zihar",
        "hadithNumber": 2217,
        "hadithText": "<p>\nA tradition similar to that of Sufyan has been transmitted by ‘Ikrimah from the Prophet(ﷺ) through a different chain of narrators.\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 922270,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822171,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "733.00",
        "babName": "Regarding Az-Zihar",
        "hadithNumber": 2217,
        "hadithText": "<p>\nAbu Dawud said “I heard Muhammad bin Isa narrating this tradition who said Mu’tamar narrated it to us. And he (Mu’tamar) said “ I heard Al Hakam bin Aban narrating this tradition. He did not mention the name of Ibn ‘Abbas.\n</p>\n<p>\nAbu Dawud said “Al Hussain bin Huraith wrote to me saying “Al Fadl bin Musa narrated from Ibn ‘Abbas to the same effect from the Prophet(ﷺ).\n\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 922280,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822220,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "734.00",
        "babName": "Regarding Khul'",
        "hadithNumber": 2222,
        "hadithText": "Ibn ‘Umar said “The waiting period of a woman who separates herself from her husband for compensation is a menstrual period.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih Mauquf",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 922330,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822230,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "735.00",
        "babName": "Regarding A Slave Woman Who Was Married To Slave A Or Free Man And Then Freed",
        "hadithNumber": 2223,
        "hadithText": "Ibn ‘Abbas said “Mughith was a slave.” He said “Apostle of Allaah (ﷺ) make intercession for me to her (Barirah)”. The Apostle of Allaah (ﷺ) said “O Barirah fear Allaah. He is your husband and father of your child”. She said “Apostle of Allaah (ﷺ) do you command me for that? He said No, I am only interceding. Then tears were falling down on his (her husband’s) cheeks. The Apostle of Allaah (ﷺ) said to ‘Abbas “Are you not surprised with the love of Mughith for Barirah and her hatred for him.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 922340,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822240,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "735.00",
        "babName": "Regarding A Slave Woman Who Was Married To Slave A Or Free Man And Then Freed",
        "hadithNumber": 2224,
        "hadithText": "Ibn ‘Abbas said “The husband of Barirah was a black slave called Mughith. The Prophet (ﷺ) gave her choice and commanded her to observe the waiting period.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 922350,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822250,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "735.00",
        "babName": "Regarding A Slave Woman Who Was Married To Slave A Or Free Man And Then Freed",
        "hadithNumber": 2225,
        "hadithText": "While relating the tradition about Barirah A’ishah said “her husband was a slave, so the Prophet(ﷺ) gave her choice. She chose herself. Had he been a free man, he would not given her choice.”</b>",
        "bookID": "12.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 922360,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 822260,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "735.00",
        "babName": "Regarding A Slave Woman Who Was Married To Slave A Or Free Man And Then Freed",
        "hadithNumber": 2226,
        "hadithText": "A’ishah said “The Prophet (ﷺ) gave her choice. Her husband was a slave.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 922370,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 822270,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "736.00",
        "babName": "Who So Said That He Was A Free Man",
        "hadithNumber": 2227,
        "hadithText": "A’ishah said “Barirah’s husband was a free man when she was emancipated. She was given choice. She said “I do not like to remain with him. I have such and such (grievances)”</b>",
        "bookID": "12.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 922380,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 822340,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "741.00",
        "babName": "Regarding A Man Who Was Married To More Than Four Women, Or To Two Sisters, And Then He Accepts Islam",
        "hadithNumber": 2234,
        "hadithText": "The tradition mentioned above has also been transmitted by Qais bin Al Harith through a different chain of narrators to the same effect.</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 922450,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822370,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "743.00",
        "babName": "Regarding Li'an (Mutual Cursing)",
        "hadithNumber": 2237,
        "hadithText": "<p>\nSahl bin Sa’ad Al Sa’idi said that ‘Uwaimir bin Ashqar Al Ajilani came to ‘Asim bin Adl and said to him “Asim tell me about a man who finds a man along with his wife. Should he kill him and then be killed by you, or how should he act? Ask the Apostle of Allaah(ﷺ) ‘Asim, for me about it. ‘Asim then asked the Apostle of Allaah(ﷺ) about it. The Apostle of Allaah(ﷺ) disliked the question and denounced it. What ‘Asim heard from the Apostle of Allaah(ﷺ) fell heavy on him. When ‘Asim returned to his family ‘Uwaimr came to him and asked ‘Asim “What did the Apostle of Allaah(ﷺ) say to you”? Asim replied “You did not do good to me”. The Apostle of Allaah(ﷺ) disliked the question that I asked him. Thereupon ‘Uwaimir said “I swear by Allaah, I shall not leave until I ask him about it. So, ‘Uwaimir came to the Apostle of Allaah(ﷺ) while he was sitting in the midst of the people.” He said “Apostle of Allaah(ﷺ) tell me about a man who finds a man along with his wife. Should he kill him and then be killed by you, or how should he act?” The Apostle of Allaah(ﷺ) said “A revelation has been sent down about you and your wife so go away and bring her. Sahl said “So we cursed one another while I was along with the people who were with the Apostle of Allaah(ﷺ). Then when they finished, ‘Umamir said “I shall have lied against her, Apostle of Allaah(ﷺ) if I keep her. He pronounced her divorce three times before the Apostle of Allaah(ﷺ)commanded him (to do so).\n</p>\n<p>\nIbn Shihab said “Then this became the method of invoking curses.”\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 922480,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822380,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "743.00",
        "babName": "Regarding Li'an (Mutual Cursing)",
        "hadithNumber": 2238,
        "hadithText": "‘Abbas bin Sahl reported on the authority of his father “The Prophet (ﷺ) said to ‘Asim bin ‘Adl. Keep the woman with you till she begets the child.</b>",
        "bookID": "12.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 922490,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822390,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "743.00",
        "babName": "Regarding Li'an (Mutual Cursing)",
        "hadithNumber": 2239,
        "hadithText": "Sahl bin Sa’d Al Sa’idi said “I attended the invoking of the curses with the Messenger of Allah (ﷺ) when I was fifteen. He then narrated the rest of the tradition. In this version he said “She then came out pregnant and the child was ascribed to its mother.</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 922500,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822400,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "743.00",
        "babName": "Regarding Li'an (Mutual Cursing)",
        "hadithNumber": 2240,
        "hadithText": "Sahl bin Sa’ad reported the Apostle of Allaah(ﷺ) as saying  - in the tradition of spouses who invoked curses to each other “Look if she bears a child which has very black eyes, large buttocks, I cannot but imagine that  he (i.e., ‘Uwaimir) has spoken the truth. But, if she bears a reddish child like the lizard with red spots (waharah), I cannot imagine that ‘Uwaimir has lied against her. She gave birth to a child (like that described the Prophet (ﷺ) ) in a detestable manner.</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 922510,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822410,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "743.00",
        "babName": "Regarding Li'an (Mutual Cursing)",
        "hadithNumber": 2241,
        "hadithText": "The tradition mentioned above has also been transmitted by Sahl bin Sa’d Al Sa’idi through a different chain of narrators. This version adds the child was attributed to its mother.</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 922520,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822420,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "743.00",
        "babName": "Regarding Li'an (Mutual Cursing)",
        "hadithNumber": 2242,
        "hadithText": "<p>\nThe tradition mentioned above has also been transmitted by Sahl bin Sa’d Al Sa’idi through a different chain of narrators. This version has “He divorced her three times before the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) implemented it and what is done before the Prophet (ﷺ) is sunnah(model behavior of the Prophet).\n</p>\n<p>\nSahl said “I attended this before the Messenger of Allah(ﷺ). Afterwards the sunnah about those who invoked curses on each other was established that they (the spouses) were separated from each other and they would never be united.”\n\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 922530,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822430,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "743.00",
        "babName": "Regarding Li'an (Mutual Cursing)",
        "hadithNumber": 2243,
        "hadithText": "<p>\nSahl bin Sa’ad said “The version of Musaddad has “I witnessed the invoking of curses by the two spouses during the life time of the Apostle of Allaah(ﷺ) when I was fifteen years old. When they finished invoking curses, the Apostle of Allaah(ﷺ) separated them from each other. Here ends the version of Musaddad. Others said “He was present when the Prophet (ﷺ) separated the spouses who invoked curses on each other. The man (Sahl) said “I shall have lied against her, Apostle of Allaah(ﷺ) if I keep her.\n</p>\n<p>\nAbu Dawud said “Some narrators did not mention the word ‘alaiha(against her).”\n</p>\n<p>\nAbu Dawud said “No one supported Ibn ‘Uyainah that he separated the spouses who invoked curses.”\n\n</p></b>",
        "bookID": "12.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 922540,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 822440,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "743.00",
        "babName": "Regarding Li'an (Mutual Cursing)",
        "hadithNumber": 2244,
        "hadithText": "The tradition mentioned above has also been transmitted by Sahl bin Sa’d through a different chain of narrators.  This version has “She was pregnant, he denied pregnancy from him. So her son was attributed to her. In the law of succession the practice (sunnah) was established that the son gets a share in the inheritance of his mother and the mother gets the share in the inheritance of her son according to the shares prescribed by Allaah the Exalted.</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 922550,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822450,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "743.00",
        "babName": "Regarding Li'an (Mutual Cursing)",
        "hadithNumber": 2245,
        "hadithText": "‘Abd Allah (bin Mas’ud) said “We were in the mosque on the night of a Friday, suddenly a man from the Ansar entered the mosque”. And said “If a man finds a man along with wife and declares (about her adultery) you will flog him. Or if he kills you, you will kill him or if keeps silence he will keep silence in anger. I swear by Allaah, I shall ask the Apostle of Allaah(ﷺ) about it”. On the next day he came to the Apostle of Allaah(ﷺ) and said “If a man finds a man along with wife and declares (about her adultery) you will flog him. Or if he kills you, you will kill him or if keeps silence he will keep silence in anger.” He said “O Allaah, disclose”. He kept on praying until the verses regarding invoking curses (li’an) came down “As for those who accuse their wives but have no witnesses except themselves.” So, the man was first involved in this trial among the people. He and his wife came to the Apostle of Allaah(ﷺ). They invoked curses on each other. The man bore witness before Allaah four times that the thing he said was indeed true. He then invoked curse of Allaah on him for the fifth time if he was a liar. She then wanted to invoke curses of Allaah on him. The Prophet (ﷺ) said “Do not do that. Bust she refused and did so (i.e., invoked curses). When they returned he said “Perhaps she will give birth to a black child with curly hair.</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 922560,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822460,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "743.00",
        "babName": "Regarding Li'an (Mutual Cursing)",
        "hadithNumber": 2246,
        "hadithText": "<p>\nIbn ‘Abbas said “Hilal bin Umayyah accused his wife in the presence of Prophet (ﷺ) of having committed adultery with Sharik bin Sahma’”. The Prophet (ﷺ) said “Produce evidence or you must receive punishment on your back.” He said “Apostle of Allaah(ﷺ) when one of us sees a man having intercourse with his wife should he go and seek evidence?” But the Prophet (ﷺ) merely said “You must produce evidence or you must receive punishment on your back.” Hilal then said “By Him Who sent you with the Truth, I am speaking Truly. May Allaah send down something which will free my back from punishment. Then the following Qur’anic verses were revealed “And those who make charges against their spouses but have no witnesses except themselves” reciting till he reached “one of those who speak the truth”. The Prophet (ﷺ) then returned and sent for them and they came (to him). Hilal bin Umayyah stood up and testified and the Prophet (ﷺ) was saying “Allaah knows that one of you is lying. Will one of you repent?” Then the woman got up and testified, but when she was about to do it a fifth time saying that Allaah’s anger be upon her if he was one of those who spoke the truth, they said to her “this is the deciding one”. Ibn ‘Abbas said “She then hesitated and drew back so that we thought the she would withdraw(what she said) “Look and see whether she gives birth to a child with eyes looking as if they have antimony in them, wide buttocks and fat legs, if she did. Sharik bin Sahma’ will be its father. She then gave birth to a child of a similar description. The Prophet (ﷺ) thereupon said “If it were not for what has already been stated in Allaah’s book I would have dealt severely with her.”\n</p>\n<p>\nAbu Dawud said “This tradition has been transmitted by the people of Medina alone. They narrated the tradition of Hilal on the authority of Ibn Bashshar.”\n\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 922570,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822480,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "743.00",
        "babName": "Regarding Li'an (Mutual Cursing)",
        "hadithNumber": 2248,
        "hadithText": "<p>Ibn ‘Abbas said “Hilal bin Umayyah was one of the three persons whose repentance was accepted by Allaah. One night he returned from his land and found a man along with his wife. He witnessed with his eyes and heard with his ears. He did not threaten him till the morning.” Next day he went to the Apostle of Allaah(ﷺ) in the morning and said Apostle of Allaah(ﷺ) “I came to my wife in the night and found a man along with her. I saw with my own eyes and heard with my own ears. The Apostle of Allaah(ﷺ) disliked what he described and he took it seriously. There upon the following Qur’anic verse came down “And those who make charges against their spouses but have no witnesses except themselves, let the testimony of one of them ....” When the Apostle of Allaah(ﷺ) came to himself (after the revelation ended) he said “Glad tidings to you Hilal, Allaah the exalted has made ease and a way out for you.” Hilal said “I expected that from my Lord. The Apostle of Allaah(ﷺ) said “Send for her. She then came.” The Apostle of Allaah(ﷺ) recited the verses to them and he reminded them and told them that the punishment in the next world was more severe than that in n this world. Hilal said “I swear by Allah I spoke the truth against her.” She said “He told a lie.” The Apostle of Allaah(ﷺ) said “Apply the method of invoking curses on one another. Hilal was told “Bear witness. So he bore witness before Allaah four times that he spoke the truth.” When he was about to utter the fifth time he was told “Hilal fear Allah, for the punishment in this world is easier than that in the next world and this is the deciding one, that will surely cause punishment to you.” He said “I swear by Allaah. Allah will not punish me for this (act), as He did not cause me to be flogged for this (act).” So he bore witness a fifth time invoking the curse of Allah on him if he was of those who tell a lie.  Then the people said to her, Testify. So she gave testimony before Allaah that he was a liar. When she was going to testify the fifth time she was told “Fear Allah, for the punishment in this world is easier than that in the next world. This is the deciding one that will surely cause punishment to you.” She hesitated for a moment. And then said “By Allah, I will not disgrace my people.” So she testified a fifth time invoking the curse of Allah on her if he spoke the truth.  Apostle of Allaah(ﷺ) separated them from each other and decided that the child will not be attributed to its father. Neither she nor her child will be accused of adultery. He who accuses her or her child will be liable to punishment. He also decided that there will be no dwelling and maintenance for her (from the husband) as they were separated without divorce and death. He then said “If she gives birth to a child with reddish hair, light buttocks, wide belly and light shins he will be the child of Hilal. If she bears a dusky child with curly hair, fat limbs, fat shins and fat buttocks he will be the child of the one who was accused of adultery. She gave birth to a child with curly hair, fat limbs, fat shins and fat buttocks. The Apostle of Allaah(ﷺ) said “Had there been no oaths, I would have dealt with her severely.”\n</p>\n<p>\n‘Ikrimah said “Later on he became the chief of the tribe of Mudar. He was not attributed to his father.”\n\n</p></b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 922590,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822490,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "743.00",
        "babName": "Regarding Li'an (Mutual Cursing)",
        "hadithNumber": 2249,
        "hadithText": "Ibn ‘Umar said “The Apostle of Allaah(ﷺ) said to the spouses who invoked curses on each other. Your reckoning is in Allaah’s hands for one of you is liar there is no way for you to (remarry) her. He then asked Apostle of Allaah(ﷺ) what about my property? He replied “There is no property for you. If you have spoken the truth, it is the price for your having had the right to intercourse with her and if you have lied against her it is still more remote for you.</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 922600,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822500,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "743.00",
        "babName": "Regarding Li'an (Mutual Cursing)",
        "hadithNumber": 2250,
        "hadithText": "Sa’d bin Jubair said I asked Ibn ‘Umar A man accused his wife of adultery? He said “The Apostle of Allaah(ﷺ) separated the brother and the sister of Banu Al ‘Ajilan (i.e., husband and wife). He said Allaah knows that one of you is a liar, will one of you repent? He repeated these words three times, but they refused. So he separated them from each other.</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 922610,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822530,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "744.00",
        "babName": "Doubting The Child's Paternity",
        "hadithNumber": 2253,
        "hadithText": "Abu Hurairah said A man from Banu Fazarah came to the Prophet (ﷺ) and said “My wife has given birth to a black son”. He said “Have you any camels?” He said “They are red”. He asked “Is there a dusky one among them?” He replied “Some of them are dusky”. He asked “How do you think they have come about?” He replied “This may be a strain to which they reverted”. He said “And this is perhaps a strain to which the child has reverted.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 922630,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822540,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "744.00",
        "babName": "Doubting The Child's Paternity",
        "hadithNumber": 2254,
        "hadithText": "The tradition mentioned above has also been narrated by Al Zuhri through a different chain of narrators to the same effect.  This version adds “At that time he was hinting at disowning the child.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 922640,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822590,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "746.00",
        "babName": "Claiming An Illegitimate Son",
        "hadithNumber": 2259,
        "hadithText": "The tradition mentioned above has also been transmitted by Muhammad bin Rashid through a different chain of narrators to the same effect.  This version adds “he is the child of fornication for the people of his mother whether she was free or a slave. This attribution of a child to the parents was practiced in the beginning of Islam. The property divided before Islam will not be taken into account.</b>",
        "bookID": "12.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 922690,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822610,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "747.00",
        "babName": "Regarding Al-Qafah",
        "hadithNumber": 2261,
        "hadithText": "<p>\nThe tradition mentioned above has also been transmitted by ibn Shihab through a different chain of narrators to the same effect.  This version adds “She said “he entered upon me looking pleased with the lines of his face brightened. \n</p>\n<p>\nAbu Dawud said “Ibn ‘Uyainah did not remember the words “the lines of his face”.”\n</p>\n<p>\nAbu Dawud said “The words “the lines of his face” have been narrated by Ibn ‘Uyainah himself. He did not hear Al Zuhri say (these words). He heard some person other than Al Zuhri say these words. The words “the lines of his face” occur in the tradition narrated by Al Laith and others.\n</p>\n<p>\nAbu Dawud said “ I heard Ahmad bin Salih say “Usamah was very black like tar and Zaid was white like cotton.”\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 922710,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822640,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "748.00",
        "babName": "Those Who Said That Lots Should Be Drawn If They Differ About The Child",
        "hadithNumber": 2264,
        "hadithText": "Khalil or Ibn Khalil said “A woman was brought to Ali bin Abi Talib(may Allaah be pleased with him). She bore a child from intercourse of three persons. The narrator transmitted the rest of the tradition similar to the previous one. But in this version he did not mention “Yemen” and the Prophet (ﷺ) and his words “give the child willingly.”</b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 922740,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822650,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "749.00",
        "babName": "Regarding The Types Of Marriages That Were Practiced Before Islam",
        "hadithNumber": 2265,
        "hadithText": "A’ishah wife of the Prophet (ﷺ) said “Marriage in pre Islamic times was of four kinds.” One of them was the marriage contracted by the people today. A man asked another man to marry his relative (sister or daughter) to him. He fixed the dower and married her to him. Another kind of marriage was that a man asked his wife when she became pure from menstruation to send fro so and so and have sexual intercourse with him. Her husband kept himself aloof and did not have intercourse with her till It became apparent that she was pregnant from the man who had intercourse with her. When it was manifest that she was pregnant, her husband approached her if he liked. This marriage was called istibda’(to utilize man for intercourse for a noble birth). A third kind of marriage was that a group of people less than ten in number entered upon a woman and had intercourse with her. When she conceived gave birth to a child and a number of days passed after her delivery, she sent for them. No one of them could refuse to attend and they gathered before her. She said to them “You have realized your affair. I have now given birth to a child. And this is your son.  O so and so. She called the name of anyone of them she liked and the child was attributed to him. A fourth kind of marriage was that many people gathered together and entered upon a woman who did not prevent anyone who came to her. They were prostitutes. They hoisted flags at their doors which served as a sign for the one who intended to enter upon them. When she became pregnant and delivered the child , they got together before her and called for the experts of tracing relationship from physical features. They attributed the child to whom they considered and it was given to him. The child was called his son and he could not deny. When Allah sent Muhammad (ﷺ) as a Prophet, he abolished all kinds of marriages prevalent among the people of the pre Islamic times except of the Muslims practiced today.</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 922750,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822660,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "750.00",
        "babName": "\"The Child Belongs To The Bed\"",
        "hadithNumber": 2266,
        "hadithText": "A’ishah said “Sa’d bin Abi Waqqas and ‘Abd bin Zamah disputed amongst themselves about the (relationship of the) son of the slave girl of Zam’ah and brought the case to the Apostle of Allaah(ﷺ). Sa’d said “My brother ‘Utbah enjoined me that when I came to Makkah I should see the son of the slave girl of Zam’ah and take his possession for that is his son”. ‘Abd bin Zam’ah said “He is my brother, the son of my father’s slave girl having been born on my father’s bed”. The Apostle of Allaah(ﷺ) saw his clear resemblance to ‘Utbah. So he said “The child is attributed to the one on whose bed it is born and the fornicator is deprived of any right (lit. the fornicator will have the stone). Veil yourself from him, Saudah. Musaddad added in his version “he is your brother ‘Abd”.</b>",
        "bookID": "12.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 922760,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 822720,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "751.00",
        "babName": "Who Has More Right To Take The Child ?",
        "hadithNumber": 2272,
        "hadithText": "This tradition has been narrated by ‘Abd Al Rahman bin Abi Laila through a different chain of narrators. This version has “He decided that she would be given to Ja’far and said “Her maternal aunt is with him(i.e., his wife).</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 922820,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822770,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "755.00",
        "babName": "Regarding The Maintenance Of One Who Has Been Irrevocably Divorced",
        "hadithNumber": 2277,
        "hadithText": "Abu Salamah bin ‘Abd Al Rahman reported on the authority of Fatimah daughter of Qais Abu ‘Amr bin Hafs divorced her (Fatimah daughter of Qais) absolutely when he was away from home and his agent sent her home barley. She was displeased with it. He said “I swear by Allah, you have no claim on us. She then came to Apostle of Allah (ﷺ) and mentioned that to him. He said to her “No maintenance is due to you from him. He ordered her to spend the waiting period in the house of Umm Sharik but he said afterwards “that is a woman whom my Companions visit. Spend the waiting period in the house of Ibn Umm Maktum for he is blind and you can undress. Then when you are in a position of being remarried, tell me.” She said “When I was in a position to remarry, I mentioned to him that Mu’awiyah bin Abi Sufyan and Abu Jahm had asked me in marriage. The Apostle of Allah (ﷺ)said “As for Abu Jahm, he does not put down his stick from his shoulder, and as for Mu’awiyah he is a poor man who has no property; marry Usamah bin Zaid. I disliked him but he said “Marry Usamah bin Zaid. So, I married him. And Allah prospered him very much and I was envied.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 922870,
        "last_updated": "2015-02-12 13:15:43"
    },
    {
        "englishURN": 822780,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "755.00",
        "babName": "Regarding The Maintenance Of One Who Has Been Irrevocably Divorced",
        "hadithNumber": 2278,
        "hadithText": "Abu Salamah bin ‘Abd Al Rahman said that Fatimah daughter of Qais told him that Abu Hafs Al Mughirah divorced her three times. He then narrated the rest of the tradition. The version has Khalid bin Walid and some people of Banu Makhzum came to the Prophet (ﷺ) and said Prophet of Allaah (ﷺ) Abu Hafs Al Mughirah divorced his wife three times and he has left a little for her. He said “No maintenance is necessary for her. He then transmitted the rest of the tradition. The tradition narrated by Malik is more perfect.</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 922880,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822790,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "755.00",
        "babName": "Regarding The Maintenance Of One Who Has Been Irrevocably Divorced",
        "hadithNumber": 2279,
        "hadithText": "Abu Salamah reported on the authority of Fatimah daughter of Qais that Abu ‘Amr bin Hafs Al Makhzumi divorced her three times. He then narrated the rest of the tradition. He then mentioned about Khalid bin Walid and said that the Prophet (ﷺ) said “There are no maintenance and dwelling for her.” This version has “The Apostle of Allaah(ﷺ) sent a message to her “Do not give her consent for marriage without my permission.””</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 922890,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822800,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "755.00",
        "babName": "Regarding The Maintenance Of One Who Has Been Irrevocably Divorced",
        "hadithNumber": 2280,
        "hadithText": "<p>\nFatimah daughter of Qais said “I was married to a man of Banu Makhzum. He divorced me absolutely. The narrator then transmitted the rest of the tradition like that of Malik. This version has “Do not marry yourself without my permission.”\n</p>\n<p>\nAbu Dawud said Al Sha’bi, Al Bahiyy and ata from abd Al Rahman bin asim and Abu Bakr bin Abi Al Jahm all narrated on the authority of Fatimah daughter of Qais that her husband had divorced her three times.\n\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 113,
        "matchingArabicURN": 922900,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822810,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "755.00",
        "babName": "Regarding The Maintenance Of One Who Has Been Irrevocably Divorced",
        "hadithNumber": 2281,
        "hadithText": "The tradition mentioned above has also been transmitted by Al Sha’bi through a different chain of narrators.  This version has “The husband of Fathima daughter of Qais pronounced her triple divorce. The Prophet (ﷺ) did not allow her to have maintenance and dwelling.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 114,
        "matchingArabicURN": 922910,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822830,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "755.00",
        "babName": "Regarding The Maintenance Of One Who Has Been Irrevocably Divorced",
        "hadithNumber": 2283,
        "hadithText": "<p>\n‘Ubaid Allah said “Marwan sent someone (Qabisah) to Fatimah and asked her (about  the case). She said that she was the wife of Abu Hafs. The Prophet (ﷺ) appointed ‘Ali as governor in a certain part of Yemen. Her husband also proceeded with him. From there he sent a message to her pronouncing one divorce that had yet remained. He commanded ‘Ayyash bin Abi Rabi’ah and Al Harith bin Hisham to provide maintenance to her. They said “By Allah there is no sustenance for her except in case she is pregnant.” She came to the Prophet(ﷺ) who said “There is no sustenance for you except in case you are pregnant. She then asked permission to shift (from her house) and he gave her permission.” She asked “Where should I shift. Apostle of Allaah(ﷺ)? The Apostle of Allaah(ﷺ) said to Ibn Umm Maktum . He was blind. She would undress herself and he could not see her. She lived there till her waiting period passed. The Prophet (ﷺ) married her to Usamah. Qabisah then returned to Marwan and narrated that to him. Marwan said “We did not hear this tradition except from a woman, so we shall follow the reliable practice on which we found the people”. When this reached Fatimah she said “between me and you is the Book of Allah”. Allaah the exalted said “Divorce them for their waiting period...” Thou knowest not it may be that Allaah will afterward bring some new thing to pass. She said “What a new thing will emerge after triple divorce.”\n</p>\n<p>\nAbu Dawud said “A similar tradition has been narrated by Yunus on the authority of Al Zuhri. As for Al Zubaidi he narrated both traditions, the tradition of ‘Ubaid Allah in the version of Ma’mar and the tradition of Abu \nSalamah in the version of ‘Aqil.”\n</p>\n<p>\nAbu Dawud said “Muhammad bin Ishaq narrated on the authority of Al Zuhri that Qabisah bin Dhuwaib transmitted to him the version which was narrated by ‘Ubaid Allah bin ‘Abd Allaah which has Qabisah then returned to Marwan and informed him about that.”\n\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 116,
        "matchingArabicURN": 922930,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822840,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "756.00",
        "babName": "Whoever Rejected What Fatimah Bint Qais Said",
        "hadithNumber": 2284,
        "hadithText": "Abu Ishaq said “I was with Al Aswad in the congregational mosque. He said “Fathimah daughter of Qais came to ‘Umar bin Al Khattab(may Allaah be pleased with him). (When she narrated the tradition about her divorce) he said “We are not to leave the Book of our Lord and the Sunnah of our Prophet (ﷺ) for the statement of a woman, we do not know whether she remembered it or not.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih Mauquf",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 117,
        "matchingArabicURN": 922940,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822870,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "756.00",
        "babName": "Whoever Rejected What Fatimah Bint Qais Said",
        "hadithNumber": 2287,
        "hadithText": "Sulaimah bin Yasar said about leaving the house by Fathimah “That was due to her bad manners.”</b>",
        "bookID": "12.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 120,
        "matchingArabicURN": 922970,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822890,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "756.00",
        "babName": "Whoever Rejected What Fatimah Bint Qais Said",
        "hadithNumber": 2289,
        "hadithText": "Maimun bin Mihram said “I came to Median and went to Sa’id bin Al Musayyab”. I said (to him) Fathimah daughter of Qais was divorced and she shifted from her house. Sa’id said “This woman has perverted people. She was arrogant so she was placed with Ibn Umm Makhtum, the blind.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih Maqtu'",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 122,
        "matchingArabicURN": 922990,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822900,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "757.00",
        "babName": "An Irrevocably Divorced Woman Leaving Her House During The Day",
        "hadithNumber": 2290,
        "hadithText": "Jabir said “My maternal aunt was divorced by three pronouncements and she went out to cut down fruit from her palm trees. A man met her and forbade her (to go out). So she went to the Prophet (ﷺ) and mentioned it to him. He said “Go out, and cut down fruit from your palm trees for perhaps you may give alms (sadaqah) or do an act of kindness.</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 123,
        "matchingArabicURN": 923000,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822910,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "758.00",
        "babName": "The Abrogation Of Maintenance For A Widowed Woman Because Of The Inheritance Due To Her",
        "hadithNumber": 2291,
        "hadithText": "The Qur’anic verse “Those of you who die and leave widows should bequeath for their widows a year’s maintenance and residence was abrogated by the verse containing the laws of succession, as one-fourth or one-eighth share was prescribed for them (i.e., the widows). The waiting period for one year was also repealed as a period of four months ten days was prescribed for them.</b>",
        "bookID": "12.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 124,
        "matchingArabicURN": 923010,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822940,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "761.00",
        "babName": "Those Who Allowed Her To Change Her Residence",
        "hadithNumber": 2294,
        "hadithText": "Ibn ‘Abbas said “The following verse abrogated the rule of passing her waiting period with her people. A  year’s maintenance and residence. She may pass her waiting period now anywhere she wishes. ‘Ata said “If she wishes she can pass her waiting period with the people of her husband and live in the house left by her husband by will. Or she may shift if she wishes according to the pronouncement of Allah the Exalted. But if they leave (the residence) there is no blame on you for what they do. Ata’ said “Then the verses regarding inheritance were revealed. The commandment for living in a house (for one year) was repealed. She may pass her waiting period wherever she wishes.</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 127,
        "matchingArabicURN": 923040,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822950,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "762.00",
        "babName": "What Should A Woman Whose Husband Dies Avoid During Her Waiting Period ?",
        "hadithNumber": 2295,
        "hadithText": "<p>\n‘Umm Athiyah reported the Prophet(ﷺ) as saying “A woman must not observe mourning for more than three (days) except for four months and ten days in the case of a husband  and she must not wear a dyed garment except one of the types made of dyed yarn or apply collyrium or touch perfume except for a little costus or azfar when she has been purified after her menstrual courses.\n</p>\n<p>\nThe narrator Ya’qub mentioned the words “except washed clothes” instead of the words “one of the types made of dyed yarn”. Ya’qub also added “She must not apply Henna”\n</p></b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 128,
        "matchingArabicURN": 923050,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822960,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "762.00",
        "babName": "What Should A Woman Whose Husband Dies Avoid During Her Waiting Period ?",
        "hadithNumber": 2296,
        "hadithText": "The tradition mentioned above has also been narrated by Al ‘Umm Athiyah from the Prophet (ﷺ) through a different chain of narrators. The tradition narrated by Yazid bin Harun from Hisham does perfectly correspond to the tradition transmitted by Ibrahim bin Tahman and ‘Abd Allah Al Shami from Hisham. The narrator Al Misma’I reported Yazid as saying “I do not know but that he said “she should not dye herself.” To this the narrator Harun added “She should not wear colored clothes except one of the types made of dyed yarn.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 129,
        "matchingArabicURN": 923060,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 822990,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "763.00",
        "babName": "The Waiting Period Of A Pregnant Woman",
        "hadithNumber": 2299,
        "hadithText": "‘Ubaid Allah bin ‘Abd Allah bin ‘Utbah said that his father wrote (a letter) to ‘Abd Allaah bin Al Arqam Al Zuhri asking him to visit Subai’ah daughter of Al Harith Al Aslamiyyah and ask her about her story and what the Apostle of Allaah(ﷺ) said to her when she asked his opinion (about her). So, ‘Umar bin Abd allah wrote in reply to ‘Abd Allah bin ‘Utbah informing him what she told him. She told that she was under (i.e., the wife of) Sa’d bin Khawlah who belonged to Banu Amir bin Luwayy. He was one of those who participated in the battle of Badr. He died at the Farwell Pilgrimage while she was pregnant. Soon after his death she gave birth to a child. When she was purified from her bleeding after child birth she adorned herself for seekers in marriage. Then Abu Al Sanabil bin Ba’kah a man from Banu Abd Al Dar entered upon her and said to her “What is the matter seeing you adorned, perhaps you are seeking marriage? I swear by Allah you cannot marry until four months and ten days pass away. Saubai’ah said “When she said this to me, I gathered my clothes on me when the evening came and I came to the Apostle of Allaah(ﷺ) and asked him about that. He told me that I became lawful when I had delivered a child. He suggested me to marry if I wished. Ibn Shihab said “I do not see any harm if she marries when she gives birth to the child, even though she had the bleeding after the child birth, but her husband should not have sexual intercourse till she is purified.</b>",
        "bookID": "12.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 132,
        "matchingArabicURN": 923090,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 823030,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "766.00",
        "babName": "The Gravity Of Fornication",
        "hadithNumber": 2303,
        "hadithText": "‘Abd Allaah (bin Masud) said “I asked Apostle of Allaah(ﷺ) which sin is the gravest?” He replied “That you associate someone with Allaah, while He has created you”. I again asked “Which then?” He replied “That you commit adultery with the wife of your neighbor.” Allaah then revealed the following Qur’anic verse in support of the statement of the Prophet (ﷺ) “Those who invoke not with Allaah any other god nor slay such life as Allaah has made sacred except for just cause nor commit fornication.”</b>",
        "bookID": "12.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 136,
        "matchingArabicURN": 923130,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 823050,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 12,
        "bookName": "Divorce (Kitab Al-Talaq)",
        "babNumber": "766.00",
        "babName": "The Gravity Of Fornication",
        "hadithNumber": 2305,
        "hadithText": "Mu’tamir reported on the authority of his father Sa’id bin Al Hassan explain the Qur’anic verse “But if anyone compels them, yet after such compulsion is Allaah oft-forgiving most merciful(to them), said Allaah is oft-forgiving to those (slave girls) who were compelled (to prostitution)</b>",
        "bookID": "12.0",
        "grade1": "Sahih Maqtu'",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 138,
        "matchingArabicURN": 923150,
        "last_updated": "2012-10-22 00:29:59"
    }
]