[
    {
        "englishURN": 828600,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1056.00",
        "babName": "What Has Been Related About It Being Disliked To Cause Harm With The Will",
        "hadithNumber": 2860,
        "hadithText": "<p>\n\nNarrated AbuSa'id al-Khudri:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: A man giving a dirham as sadaqah (charity) during his life is better than giving one hundred dirhams as sadaqah (charity) at the moment of his death.\n</p></b>",
        "bookID": "17.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 928690,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 828610,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1056.00",
        "babName": "What Has Been Related About It Being Disliked To Cause Harm With The Will",
        "hadithNumber": 2861,
        "hadithText": "<p>\n\nNarrated AbuHurayrah:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: A man or a woman acts in obedience to Allah for sixty years, then when they are about to die they cause injury by their will, so they must go to Hell. Then AbuHurayrah recited: \"After a legacy which you bequeath or a debt, causing no injury...that will be the mighty success.\n</p>\n\n<p>\nAbu Dawud said: Al-Ash'ath b. Jabir is the grandfather of Nasr b. 'Ali.\n</p></b>",
        "bookID": "17.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 928700,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 828640,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1059.00",
        "babName": "What Has Been Related About Willing To An Heir",
        "hadithNumber": 2864,
        "hadithText": "<p>\n\nNarrated AbuHurayrah:\n</p>\n\n\n\n<p>\n\nI heard the Messenger of Allah (ﷺ) say: Allah has appointed for everyone who has a right what is due to him, and no bequest must be made to an heir.\n</p></b>",
        "bookID": "17.0",
        "grade1": "Hasan Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 928730,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 828650,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1060.00",
        "babName": "Mixing One's Food With The Food Of An Orphan",
        "hadithNumber": 2865,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nWhen Allah, Most High, revealed the verses: \"Come not nigh to the orphan's property except to improve it\". And \"Those who unjustly eat up the property of orphans\", everyone who had an orphan with him went and separated his food from his (orphan's) food, and his drink from his drink, and began to detain the remaining food which he (the orphan) himself ate or spoiled. \n</p>\n\n\n<p>\n\nThis fell heavy on them, and they mentioned this to the Messenger of Allah (ﷺ). So Allah, Most High, revealed the verse: \"They ask thee concerning orphans. Say: The best thing to do is what is for their good; if ye mix their affairs with yours, they are your brethren.\" Then they mixed their food with his food and their drink with his drink.\n</p></b>",
        "bookID": "17.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 928740,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 828660,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1061.00",
        "babName": "What Has Been Related About What Is Allowed For The Guardian Of The Orphan To Take From His Wealth",
        "hadithNumber": 2866,
        "hadithText": "<p>\n\nNarrated 'Amr b. Suh'aib:\n</p>\n\n\n\n<p>\n\nOn his father's authority, said that his grandfather told that a man came to the Prophet (ﷺ) and said: I am poor, I have nothing (with me), and I have an orphan. He said: Use the property of your orphan without spending it lavishly, hurrying and taking it as your own property.\n</p></b>",
        "bookID": "17.0",
        "grade1": "Hasan Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 928750,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 828670,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1062.00",
        "babName": "What Has Been Related About When One Ceases Being An Orphan",
        "hadithNumber": 2867,
        "hadithText": "<p>\n\nNarrated Ali ibn AbuTalib:\n</p>\n\n\n\n<p>\n\nI memorised (a tradition) from the Messenger of Allah (ﷺ): There is no orphanhood after puberty, and there is no silence for the whole day till the night.\n</p></b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 928760,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 828690,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1063.00",
        "babName": "What Has Been Related About The Severity Of Consuming The Wealth Of An Orphan",
        "hadithNumber": 2869,
        "hadithText": "<p>\n\n'Umair, A Companion of the Prophet (ﷺ) said: A man asked him (the Prophet): Messenger of Allah, what are the grave sins? He replied: They are nine. He then mentioned the tradition to the same effect. This version adds: \"And disobedience to the Muslim parents, and to violate the sacred House, your qiblah (direction of prayer), in your life and after death.\n</p></b>",
        "bookID": "17.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 928780,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 828750,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1068.00",
        "babName": "What Has Been Related About Giving In Charity For One Who Died Without Leaving A Will",
        "hadithNumber": 2875,
        "hadithText": "<p>\n\nNarrated Aisha, Ummul Mu'minin:\n</p>\n\n\n\n<p>\n\nA woman said: Messenger of Allah, my mother suddenly died; if it had not happened, she would have given sadaqah (charity) and donated (something). Will it suffice if I give sadaqah on her behalf? The Prophet (ﷺ) said: Yes, give sadaqah on her behalf.\n</p></b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 928840,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 828770,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1069.00",
        "babName": "What Has Been Related About The Will Of A Combatant Disbeliever Who Dies, And His Executor Accepts Islam, Does He Have To Carry Out The Will ?",
        "hadithNumber": 2877,
        "hadithText": "<p>\n\nNarrated 'Amr b. Suh'aib:\n</p>\n\n\n\n<p>\n\nOn his father's authority, said that his grandfather told that Al-'As ibn Wa'il left his will that a hundred slaves should be emancipated on his behalf. His son Hisham emancipated fifty slaves and his son Amr intended to emancipate the remaining fifty on his behalf, but he said: I should ask first the Messenger of Allah (ﷺ). He, therefore, came to the Prophet (ﷺ) and said: Messenger of Allah, my father left in his will that a hundred slaves should be emancipated on his behalf and Hisham has emancipated fifty on his behalf and fifty remain. Shall I emancipate them on his behalf? The Messenger of Allah (ﷺ) said: Had he been a Muslim and you had emancipated slaves on his behalf, or given sadaqah on his behalf, or performed the pilgrimage, that would have reached him.\n</p></b>",
        "bookID": "17.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 928860,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 828560,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1054.00",
        "babName": "What Has Been Related About What Is Commanded About The Will",
        "hadithNumber": 2856,
        "hadithText": "Narrated 'Abdullah bin 'Umar:\nThe Messenger of Allah (ﷺ) as saying: It is the duty of a Muslim man who has something which is to be given as bequest not to have it for two nights without having his will written regarding it.</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 928650,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 828570,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1054.00",
        "babName": "What Has Been Related About What Is Commanded About The Will",
        "hadithNumber": 2857,
        "hadithText": "Narrated 'Aishah:\nThe Messenger of Allah (ﷺ) did not leave dinars, dirhams, camels and goats, nor did he leave will for anything.</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 928660,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 828580,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1055.00",
        "babName": "What Has Been Related Regarding What Is Allowed For A Testor To Give From His Wealth",
        "hadithNumber": 2858,
        "hadithText": "Narrated 'Amir b. Sa'd:\nOn the authority of his father (Sa'd b. Abi Waqqas): When he (Sa'd) fell ill at Mecca (according to the version of Ibn Abi Kkalaf) - then the agreed version has: which brought him near to death - the Messenger of Allah (ﷺ) went to visit him. He said: Messenger of Allah, I have a large amount of property, and my daughter is my only heir. May I give two-thirds (of my property) as a sadaqah (charity)? He said: No. He asked: Then a half ? He replied: No. He asked: Then one-third ? He replied: (You may will away) a third and third is a lot. To leave your heirs rich is better than to leave them poor begging from people. You will not spend anything, seeking thereby to please Allah, without being rewarded for it, even the mouthful you give your wife. I said: Messenger of Allah, shall I be left behind form immigration (to Medina)? He said: If you remain behind after me and do good works seeking the pleasure of Allah, your rank will be raised and degree increased. Perhaps you will not remain behind, and some people will benefit from you and others will be harmed by you. He then said: O Allah, complete the immigration of my Companions and do not turn them back. But miserable was Sa'd b. Khawlah. The Messenger of Allah (ﷺ) lamented on him as he died at Mecca.</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 928670,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 828590,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1056.00",
        "babName": "What Has Been Related About It Being Disliked To Cause Harm With The Will",
        "hadithNumber": 2859,
        "hadithText": "Narrated Abu Hurairah:\nA man asked the Messenger of Allah (ﷺ): Messenger of Allah, which sadaqah (charity) is the best ? He replied: (The best sadaqah is) that you give something as sadaqah (charity) when you are healthy, greedy, expect survival and fear poverty, and not that you postpone it until your death. and then you say: For so-and-so is such-and-such, and for so-and-so is such-and-such, while it was already for so-and-so.</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 928680,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 828620,
        "collection": "abudawud",
        "volumeNumber": 2,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1057.00",
        "babName": "What Has Been Related About Accepting The Position Of Executing A Will",
        "hadithNumber": 2862,
        "hadithText": "Narrated Abu Dharr:\n<p>\nThe Messenger of Allah (ﷺ) said to me: Abu Dharr, I see you weak, and I like for you what I like for myself. Do not be a leader of two (persons), and do not be a guardian of an orphan.\n</p>\n<p>\nAbu Dawud said: This has been narrated only by the people of Egypt.\n</p></b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 928710,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 828630,
        "collection": "abudawud",
        "volumeNumber": 2,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1058.00",
        "babName": "What Has Been Related About Abrogating The Will For The Parents And Near Relatives",
        "hadithNumber": 2863,
        "hadithText": "Narrated Ibn 'Abbas:\nThe Qur'anic verse goes: \"(It is prescribed when death approaches any of you), if he leaves any goods, that he may bequest to parents and next to kin.\" The bequest was made in this way until the verse of inheritance repealed it.</b>",
        "bookID": "17.0",
        "grade1": "Hasan Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 928720,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 828680,
        "collection": "abudawud",
        "volumeNumber": 2,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1063.00",
        "babName": "What Has Been Related About The Severity Of Consuming The Wealth Of An Orphan",
        "hadithNumber": 2868,
        "hadithText": "Narrated Abu Hurairah:\n<p>\nThe Messenger of Allah (ﷺ) as saying: Refrain from seven (characteristics) which cause destruction. He was asked: What are they, Messenger of Allah ? He replied: To assign partner to Allah, magic, to kill a soul (man) which is prohibited by Allah except for which is due, to take usury, to consume the property of an orphan, to retreat on the day of the battle, and to slander chaste women, indiscreet but believing.\n</p>\n<p>\nAbu Dawud said: The name Abu al-Ghaith is Salim client of Ibn Muti'. \n</p></b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 928770,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 828700,
        "collection": "abudawud",
        "volumeNumber": 2,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1064.00",
        "babName": "What Has Been Related Of Evidence That The Shroud Is From One's Wealth",
        "hadithNumber": 2870,
        "hadithText": "Narrated Khabbab:\nMus'ab b. 'Umar was killed at the battle of Uhud, and for him only a coarse cloth would be found as shroud. When we covered his head, his feet showed, and when we covered his feet, his head showed. So the Messenger of Allah (ﷺ) said: Cover his head with it (cloth), and put some rushes over his feet.</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 928790,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 828710,
        "collection": "abudawud",
        "volumeNumber": 2,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1065.00",
        "babName": "What Has Been Related About A Man Who GIves A Gift, Then It Is Bequeathed To Him, Or He Inherits It",
        "hadithNumber": 2871,
        "hadithText": "Narrated Buraidah:\nA woman came to the Messenger of Allah (ﷺ) and said: I donated my slave-girl to my mother, but she died and left the slave-girl. He said: Your reward became due, and she came back to you in inheritance. She said: She died while a month's fasting was due from her. Would it be sufficient or be taken as completed if I fast on her behalf ? He said: Yes. She said: She also did not perform Hajj. Would it be sufficient or be taken completed if I perform (Hajj) on her behalf ? He said: Yes.</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 928800,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 828720,
        "collection": "abudawud",
        "volumeNumber": 2,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1066.00",
        "babName": "What Has Been Related About A Man Who Institutes An Endowment",
        "hadithNumber": 2872,
        "hadithText": "Narrated Ibn 'Umar:\n'Umar got some land in Khaibar, and when to the Prophet (ﷺ) and said: I have acquired land in Khaibar which I consider to be more valuable than any I have acquired ; so what do you command me to do with it ? He replied: If you wish, you may make the property as inalienable possession, and give its produce as sadaqah (charity). So 'Umar gave it as a sadaqah declaring that the property must not be sold, given away, or inherited : (and gave its produce as sadaqah to be devoted) to poor, relatives, the emancipation of slaves, Allah's path,  travellers. The narrator Bishr added: \"and guests\". Then the agreed version goes: No sin being committed by the one who administers it if he eats something from it in a reasonable manner, or gives something to a friend, who does not make his own property. The narrator Bishr added: \"(provided) he is not storing-up goods (for himself)\".</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 928810,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 828730,
        "collection": "abudawud",
        "volumeNumber": 2,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1066.00",
        "babName": "What Has Been Related About A Man Who Institutes An Endowment",
        "hadithNumber": 2873,
        "hadithText": "Narrated Yahya b. Sa'id:\n'Abd al-Hamid b. Abd 'Allah b. 'Abd Allah b. 'Umar b. al-Khattab copied to me a document about the religious endowment (waqf) made by 'Umar b. al-Khattab : In the name of Allah, the Compassionate, the Merciful. This is what Allah's servant 'Umar has written about Thamgh. He narrated the tradition like the one transmitted by Nafi'. He added: \"provided he is not storing up goods (for himself)\". The surplus fruit will be devoted to the beggar and the deprived. He then went on with the tradition, saying: If the man in charge of Thamgh wishes to buy a slave for his work for its fruits (by selling them), he may do so. Mu'iqib penned it and 'Abd Allah b. al-Arqam witnessed it : In the name of Allah, the Compassionate, the Merciful. This is what Allah's servant 'Umar , Commander of Faithful, directed, in case of some incident happens to him (i.e. he dies), that Thamg, Sirmah b. al-Akwa', the servant who is there, the hundred shares in (the land of) Khaibr, the servant who is there and the hundred sahres which Muhammad (ﷺ) had donated to me in the valley (nearly) will remain in the custody of Hafsah during her life, then the men of opinion from her family will be in charge of these (endowments), that these will neither be sold not purchased, spending (its produce) where they think (necessary on the beggar, deprived and relatives). There is no harm to the one in charge (of this endowment) if he eats himself, or feeds, or buys slaves with it.</b>",
        "bookID": "17.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 928820,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 828740,
        "collection": "abudawud",
        "volumeNumber": 2,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1067.00",
        "babName": "What Has Been Related About Giving Charity On Behalf Of The Deceased",
        "hadithNumber": 2874,
        "hadithText": "Narrated Abu Hurairah:\nThe Messenger of Allah (ﷺ) as saying: When a man dies, his action discontinues from him except three things, namely, perpetual sadaqah (charity), or the knowledge by which benefit is acquired, or a pious child who prays for him.</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 928830,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 828760,
        "collection": "abudawud",
        "volumeNumber": 2,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1068.00",
        "babName": "What Has Been Related About Giving In Charity For One Who Died Without Leaving A Will",
        "hadithNumber": 2876,
        "hadithText": "Narrated Ibn 'Abbas:\nA man said: Messenger of Allah, my mother has died ; will it benefit her if I give sadaqah on her behalf ? He said: Yes. He said: I have a garden, and I call you to witness that I have given it as sadaqah on her behalf.</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 928850,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 828780,
        "collection": "abudawud",
        "volumeNumber": 2,
        "bookNumber": 17,
        "bookName": "Wills (Kitab Al-Wasaya)",
        "babNumber": "1070.00",
        "babName": "What Has Been Related About A Man Who Dies And Leaves Behind A Debt, And He Has What Will Fulfill The Debt, The Creditors Will Be Asked To Defer Repayment For A While, And The Heirs Should Be Treated With Leniency",
        "hadithNumber": 2878,
        "hadithText": "Narrated Jabir bin ‘Abdullah :\nThat his father died and left a debt of thirty wasqs of a Jew on him. Jabir asked him to defer, but he refused. Jabir then spoke to the Messenger of Allah (ﷺ) asking him to mediate to him on his behalf. The Messenger of Allah (ﷺ) came to the Jew and spoke to him about taking fruit-dates in lieu of the debt that was on him. But he refused. The Messenger of Allah (ﷺ) asked him to defer (the debt) to him, but he refused. He then narrated the rest of the tradition.</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 928870,
        "last_updated": "2012-10-22 00:29:59"
    }
]