[
    {
        "englishURN": 811605,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer (Kitab Al-Salat): Details of Commencing Prayer",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1163,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nIshaq ibn Abdullah ibn Kinanah reported: Al-Walid ibn Utbah or (according to the version of Uthman) al-Walid ibn Uqbah, the then governor of Medina, sent me to Ibn Abbas to ask him about the prayer for rain offered by the Messenger of Allah (ﷺ). He said: The Messenger of Allah (ﷺ) went out wearing old clothes in a humble and lowly manner until he reached the place of prayer. He then ascended the pulpit, but he did not deliver the sermon as you deliver (usually).  He remained engaged in making supplication, showing humbleness (to Allah) and uttering the takbir (Allah is most great). He then offered two rak'ahs of prayer as done on the 'Id (festival).\n</p>\n<p>\nAbu Dawud said: This is the version of al-Nufail. What is correct is Ibn Utbah's\n</p></b>",
        "bookID": "3.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 911680,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811640,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer (Kitab Al-Salat): Details of Commencing Prayer",
        "babNumber": "411.00",
        "babName": "On Raising The Hands While Making Supplication For Rain",
        "hadithNumber": 1164,
        "hadithText": "<p>\n\nNarrated Umayr, the client of AbulLahm:\n</p>\n\n\n\n<p>\n\nUmayr saw the Prophet (ﷺ) praying for rain at Ahjar az-Zayt near az-Zawra', standing, making supplication, praying for rain and raising his hands in front of his face, but not lifting them above his head.\n</p></b>",
        "bookID": "3.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 911710,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811650,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer (Kitab Al-Salat): Details of Commencing Prayer",
        "babNumber": "411.00",
        "babName": "On Raising The Hands While Making Supplication For Rain",
        "hadithNumber": 1165,
        "hadithText": "<p>\n\nNarrated Jabir ibn Abdullah:\n</p>\n\n\n\n<p>\n\nThe people came to the Prophet (ﷺ) weeping (due to drought). He said (making supplication): O Allah! give us rain which will replenish us, abundant, fertilising and profitable, not injurious, granting it now without delay. He (the narrator) said: Thereupon the sky became overcast.\n</p></b>",
        "bookID": "3.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 911720,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811690,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer (Kitab Al-Salat): Details of Commencing Prayer",
        "babNumber": "411.00",
        "babName": "On Raising The Hands While Making Supplication For Rain",
        "hadithNumber": 1169,
        "hadithText": "<p>\n\nNarrated Aisha, Ummul Mu'minin:\n</p>\n\n\n\n<p>\n\nThe people complained to the Messenger of Allah (ﷺ) of the lack of rain, so he gave an order for a pulpit. It was then set up for him in the place of prayer. He fixed a day for the people on which they should come out.  \n</p>\n\n\n<p>\n\nAisha said: The Messenger of Allah (ﷺ), when the rim of the sun appeared, sat down on the pulpit, and having pronounced the greatness of Allah and expressed His praise, he said: You have complained of drought in your homes, and of the delay in receiving rain at the beginning of its season. Allah has ordered you to supplicate Him has and promised that He will answer your prayer.  \n</p>\n\n\n<p>\n\nThen he said: Praise be to Allah, the Lord of the Universe, the Compassionate, the Merciful, the Master of the Day of Judgment. There is no god but Allah Who does what He wishes. O Allah, Thou art Allah, there is no deity but Thou, the Rich, while we are the poor. Send down the rain upon us and make what Thou sendest down a strength and satisfaction for a time.  \n</p>\n\n\n<p>\n\nHe then raised his hands, and kept raising them till the whiteness under his armpits was visible. He then turned his back to the people and inverted or turned round his cloak while keeping his hands aloft. He then faced the people, descended and prayed two rak'ahs.  \n</p>\n\n\n<p>\n\nAllah then produced a cloud, and the storm of thunder and lightning came on. Then the rain fell by Allah's permission, and before he reached his mosque streams were flowing. When he saw the speed with which the people were seeking shelter, he (ﷺ) laughed till his back teeth were visible.  \n</p>\n\n\n<p>\n\nThen he said: I testify that Allah is Omnipotent and that I am Allah's servant and apostle.\n</p>\n<p>\nAbu Dawud said: This is a ghraib (rate) tradition, but its chain is sound. The people of Medina recite \"maliki\" (instead of maaliki) yawm al-din\" (the master of the Day of Judgement). But this tradition (in which the word maalik occurs) is an evidence for them.\n</p></b>",
        "bookID": "3.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 911760,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811700,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer (Kitab Al-Salat): Details of Commencing Prayer",
        "babNumber": "411.00",
        "babName": "On Raising The Hands While Making Supplication For Rain",
        "hadithNumber": 1170,
        "hadithText": "<p>\n\nNarrated Anas ibn Malik:\n</p>\n\n\n\n<p>\n\nThe people of Medina had a drought during the time of the Prophet (ﷺ).  \n</p>\n\n\n<p>\n\nWhile he was preaching on a Friday, a man stood up and said: Messenger of Allah, the horses have perished, the goats have perished, pray to Allah to give us water. He spread his hands and prayed.  \n</p>\n\n\n<p>\n\nAnas said: The sky was like a mirror (there was no cloud). Then the wind rose; a cloud appeared (in the sky) and it spread : the sky poured down the water. We came out (from the mosque after the prayer) passing through the water till we reached our homes. The rain continued till the following Friday. The same or some other person stood up and said: Messenger of Allah, the houses have been demolished, pray to Allah to stop it.  \n</p>\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) smiled and said: (O Allah), the rain may fall around us but not upon us. Then I looked at the cloud which dispersed around Medina just like a crown.\n</p></b>",
        "bookID": "3.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 911770,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811720,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer (Kitab Al-Salat): Details of Commencing Prayer",
        "babNumber": "411.00",
        "babName": "On Raising The Hands While Making Supplication For Rain",
        "hadithNumber": 1172,
        "hadithText": "<p>\n\nNarrated 'Amr b. Suh'aib:\n</p>\n\n\n\n<p>\n\nOn his father's authority, quoted his grandfather as saying: When the Messenger of Allah (ﷺ) prayed for rain, he said: O Allah! Provide water for Your servants and Your cattle, display Your mercy and give life to Your dead land.\n</p>\n<p>\nThis is the wording of Malik.\n</p></b>",
        "bookID": "3.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 911790,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811800,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer (Kitab Al-Salat): Details of Commencing Prayer",
        "babNumber": "413.00",
        "babName": "The View The One Should Bow Four Times (In Two Rak'ahs In The Prayer At An Eclipse)",
        "hadithNumber": 1180,
        "hadithText": "<p>\n\nNarrated Samurah ibn Jundub:\n</p>\n\n\n\n<p>\n\nWhen, a boy from the Ansar and I were shooting (arrows) towards two of our targets, the sun was sighted by the people at the height of two or three lances above the horizon. It became black like the black herb called tannumah.  \n</p>\n\n\n<p>\n\nOne of us said to his companion: Let us go to the mosque; by Allah, this incident of the sun will surely bring something new in the community of the Messenger of Allah (ﷺ).  \n</p>\n\n\n<p>\n\nAs we reached it, we suddenly saw that he (the Prophet) had already come out (of his house). He stepped forward for a long time as much as he could do so in the prayer. But we did not hear his voice. He then performed a bowing and prolonged it as much as he could do in the prayer. But we did not hear his voice. He then prostrated himself with us and prolonged it which he never did in the prayer before. But we did not hear his voice. He then did similarly in the second rak'ah. The sun became bright when he sat after the second rak'ah. Then he uttered the salutation. He then stood up, praised Allah, and extolled Him, and testified that there was no god but Allah and testified that he was His servant and apostle. Ahmad ibn Yunus then narrated the address of the Prophet (ﷺ).\n</p></b>",
        "bookID": "3.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 911870,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811810,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer (Kitab Al-Salat): Details of Commencing Prayer",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 1181,
        "hadithText": "<p>\n\nNarrated Qabisah al-Hilali:\n</p>\n\n\n\n<p>\n\nThere was an eclipse of the sun in the time of the Messenger of Allah (ﷺ). He came out bewildered pulling his garment, and I was in his company at Medina. He prayed two rak'ahs and stood for a long time in them. He then departed and the sun became bright. He then said: There are the signs by means of which Allah, the Exalted, produces dread (in His servants). When you see anything of this nature, then pray as you are praying a fresh obligatory prayer.\n</p></b>",
        "bookID": "3.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 911880,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811890,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer (Kitab Al-Salat): Details of Commencing Prayer",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 1189,
        "hadithText": "<p>\n\nNarrated An-Nu'man ibn Bashir:\n</p>\n\n\n\n<p>\n\nThere was an eclipse of the sun in the time of the Prophet (ﷺ). He began to pray a series of pairs of rak'ahs enquiring about the sun (at the end of them) till it became clear.\n</p></b>",
        "bookID": "3.0",
        "grade1": "Munkar",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 911960,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811900,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer (Kitab Al-Salat): Details of Commencing Prayer",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 1190,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Amr ibn al-'As:\n</p>\n\n\n\n<p>\n\nThere was an eclipse of the sun in the time of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) stood up and he was not going to perform bowing till he bowed; and he was not going to raise his head till he raised (after bowing); and he was not going to prostrate himself till he prostrated himself; and he was not going to raise his head till he raised (at the end of prostration); he did similarly in the second rak'ah, he then puffed in the last prostration saying; Fie, Fie! He then said: My Lord, didst Thou not promise me that Thou wouldst not punish them so long as I will remain among them? Didst Thou not promise me that Thou will not punish them so long as they continue to beg pardon of Thee. The Messenger of Allah (ﷺ) finished the prayer, and the sun was clear. The narrator then narrated the tradition (in full).\n</p></b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 911970,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 811920,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer (Kitab Al-Salat): Details of Commencing Prayer",
        "babNumber": "419.00",
        "babName": "To Offer Prayer When Overwhelming Darkness Prevails Or Some Other Similar Calamity Comes About",
        "hadithNumber": 1192,
        "hadithText": "<p>\n\nNarrated Anas ibn Malik:\n</p>\n\n\n\n<p>\n\nUbaydullah ibn an-Nadr reported on the authority of his father: Darkness prevailed in the time of Anas ibn Malik, I came to Anas and said (to him): AbuHamzah, did anything like this happen to you in the time of the Messenger of Allah (ﷺ)? He replied: Take refuge in Allah. If the wind blew violently, we would run quickly towards the mosque for fear of the coming of the Day of Judgment.\n</p></b>",
        "bookID": "3.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 911990,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811930,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "Prayer (Kitab Al-Salat): Details of Commencing Prayer",
        "babNumber": "420.00",
        "babName": "To Perform Prostration In The Event Of An Accident",
        "hadithNumber": 1193,
        "hadithText": "<p>\n\nIkrimah said: Ibn Abbas was informed that so-and-so, a certain wife of the Prophet (ﷺ), had died. He fell down prostrating himself. He was questioned: Why do you prostrate yourself this moment? He said: The Messenger of Allah (ﷺ) said: When you see a portent (an accident), prostrate yourselves. And which portent (accident) can be greater than the death of a wife of the Prophet (ﷺ).\n</p></b>",
        "bookID": "3.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 912000,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811570,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "410.00",
        "babName": "Prayer for Rain and detailed injunctions about it",
        "hadithNumber": 1157,
        "hadithText": "Abbad b. Tamim (al-Muzini) reported on the authority of his uncle: The Messenger of Allah (ﷺ) took the people out (to the place of prayer) and prayed for rain.  He led them in two rak'ahs of prayer in the course of which he recited from the Qur'an in a loud voice.  He turned around his cloak and raised his hands, prayed for rain and faced the qiblah</b>",
        "bookID": "3.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 911640,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811571,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "410.00",
        "babName": "Prayer for Rain and detailed injunctions about it",
        "hadithNumber": 1158,
        "hadithText": "Abbad b. Tamim al Mazini said on the authority of his uncle (Abd Allah b. Zaid b Asim) who was a Companion of the Messenger of Allah (ﷺ): One day the Messenger of Allah (ﷺ) went out to make supplication for rain.  He turned his back towards the people praying to Allah, the Exalted.  The narrator Sulaiman b. Dawud said: He faced the qiblah and turned around his cloak and then offered two rak'ahs of prayer.  The narrator Ibn Abi Dhi'b said: He recited from the Qur'an in both of them.  The version of Ibn al-Sarh adds: By it he means in a loud voice.</b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 911650,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 811590,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "410.00",
        "babName": "Prayer for Rain and detailed injunctions about it",
        "hadithNumber": 1159,
        "hadithText": "The above-mentioned tradition has also been transmitted by Muhammad b. Muslim through a different chain of narrators.  But there is no mention of prayer in this version. The version adds: \"He turned around his cloak, putting its right side on his left shoulder and its left side on his right shoulder.  Thereafter he made supplication to Allah.\"</b>",
        "bookID": "3.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 911660,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811600,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "410.00",
        "babName": " Prayer for Rain and detailed injunctions about it",
        "hadithNumber": 1160,
        "hadithText": "Abd Allah b. Zaid said: The Messenger of Allah (pbuh)prayed for rain wearing a black robe with ornamented border.  The Messenger of Allah (pbuh)wanted to reverse it from bottom to top by holding the bottom.  But when it was too heavy he turned it round on his shoulders.</b>",
        "bookID": "3.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 911670,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811610,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "410.00",
        "babName": " Prayer for Rain and detailed injunctions about it",
        "hadithNumber": 1161,
        "hadithText": "Abd Allah b. Zaid said: The Messenger of Allah (pbuh)went out to the place of prayer to pray for rain.  When he wanted to make supplication, he faced the qiblah and turned around his cloak.</b>",
        "bookID": "3.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 911690,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811620,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "410.00",
        "babName": "Prayer for Rain and detailed injunctions about it",
        "hadithNumber": 1162,
        "hadithText": "Narrated Abd Allah b. Zaid al Mazini:\nAbd Allah b. Zaid al Mazini said: The Messenger of Allah (pbuh) went out to the place of prayer and made supplication or rain, and turned around his cloak when the faced the qiblah.</b>",
        "bookID": "3.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 911700,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811660,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "411.00",
        "babName": "On Raising the hands while making supplication for rain",
        "hadithNumber": 1166,
        "hadithText": "Narrated Anas:\nThe Prophet (peace be upon him) was not accustomed to raise his hands in any supplication he made except when praying for rain.  He would then raise them high enough so much so that the whiteness of his armpits was visible.</b>",
        "bookID": "3.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 911730,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811670,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "411.00",
        "babName": "On Raising the hands while making supplication for rain",
        "hadithNumber": 1167,
        "hadithText": "Narrated Anas:\nThe Prophet (ﷺ) used to make supplication for rain in this manner.  he spread his hands keeping the inner side (of hands) towards the earth, so I witnessed the whiteness of his armpits.</b>",
        "bookID": "3.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 911740,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811680,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "411.00",
        "babName": "On Raising the hands while making supplication for rain",
        "hadithNumber": 1168,
        "hadithText": "Narrated Muhammad b. Ibrahim:\nA man who witnessed the Prophet (ﷺ)  reported to me that he saw the Prophet (ﷺ) praying at Ahjar al-Zait spreading his hands.</b>",
        "bookID": "3.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 911750,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811710,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "411.00",
        "babName": "On Raising the hands while making supplication for rain",
        "hadithNumber": 1171,
        "hadithText": "Narrated The above mentioned tradition has been narrated by Anas through a different chain of transmitters:\nThe Messenger of Allah (ﷺ) raised his hands in front of his face and said: O Allah! Give us water.  the narrator then reported then reported the tradition like the former.</b>",
        "bookID": "3.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 911780,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811730,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "412.00",
        "babName": "Prayer at an Eclipse",
        "hadithNumber": 1173,
        "hadithText": "Narrated A'ishah (May Allah be pleased with her):\nThere was an eclipse of the sun in the time of the Prophet (ﷺ).  The Prophet stood for a long time, accompanied by the people.  He then bowed, then raised his head, then he bowed and then he raised his head, and again he bowed and prayed two rak'ahs of prayer.  In each rak'ah he bowed three times.  After bowing for the third time he prostrated himself.  He stood for such a long time that some people became unconscious on that occasion and buckets of water had to be poured on them.  When he bowed, he said, Allah is most great; and when he raised his head, he said, Allah listens to him who praises Him, till the sun became bright.  then he said: The sun and the moon are not eclipsed on account of anyone's death or on account of anyone's birth, but they are two of Allah's signs, He produces dread in His servants by means of them.  When they are eclipsed, hasten to prayer</b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 911800,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 811740,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "413.00",
        "babName": "The view that one should bow four times (in two rak'ahs in the prayer at an eclipse)",
        "hadithNumber": 1174,
        "hadithText": "Narrated Jabir b. Abd Allah:\nThere was an eclipse of the sun in the time of the Messenger of Allah (ﷺ) had died.  The people began to to say that there was an eclipse on account of the death of Ibrahim.   The Prophet (ﷺ) stood up and led the people in prayer performing six bowings and four prostrations.  he said: Allah is most great, and then recited from the Qur'an and prolonged the recitation.  He then bowed nearly as long as he stood.  He then raised his head and recited from the Qur'an but it was less than the first (recitation).  He then bowed nearly as long as he stood.  He then raised his head and then recited from the Quran for the third time, but it was less than the second recitation.  He then bowed nearly as long as he stood.  he then raised his head and then recited from the Qur'an for the third time, but it was less than the second recitation.  he then bowed nearly as long as he stood.  Then he raised his head and went down for prostration.  he made two prostrations.  He then stood and made three bowings before prostrating himself, the preceding bowing being more lengthy than the following, but he bowed nearly as long as he stood.  He then stepped back during the prayer and the rows (of the people) too stepped back along with him.  Then he stepped forward and stood in his place, and the rows too stepped forward.  he then finished the prayer and the sun had become bright.  He said: O people, the sun and the moon are two of Allah's signs; they are not eclipsed on account of a man's death.  So when you see anything of that nature, offer prayer until the sun becomes bright.  The narrator then narrated the rest of the tradition.</b>",
        "bookID": "3.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 911810,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 811750,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "413.00",
        "babName": "The view that one should bow four times (in two rak'ahs in the prayer at an eclipse)",
        "hadithNumber": 1175,
        "hadithText": "Narrated Jabir:\nThere was an eclipse of the sun in the time of the Messenger of Allah (ﷺ) on a hot day.  The Messenger of Allah (ﷺ)led his Companions in prayer and prolonged the standing until the people began to fall down.  He then bowed and prolonged it; then he raised his head and prolonged (the stay); then he bowed and prolonged it; then he raised his head and prolonged (the stay); then he made two prostrations and then stood up; then he did in the same manner.  He thus performed four bowings and four prostrations.  Then the narrator narrated the rest of the tradition.</b>",
        "bookID": "3.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 911820,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811760,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "413.00",
        "babName": "The view that one should bow four times (in two rak'ahs in the prayer at an eclipse)",
        "hadithNumber": 1176,
        "hadithText": "Narrated A'ishah (May Allah be pleased with her):\nThere was an eclipse of the sun during the lifetime of the Messenger of Allah (ﷺ)came tot he mosque; he stood up and uttered the takbir (Allah is great); the people stood in rows behind him; the Messenger of Allah (ﷺ) recited from the Quran for a long time; then he uttered the takbir (Allah is most great) and performed bowing for a long time, then he raised his head and said: Allah listens to him who praises Him; our Lord, and to Thee be praise; then he stood up and recited from the Qur'an for a long time, but it was less than the first (recitation); he then bowed for a long time, but it was less than the first bowing; he then said, Allah listens to him who praises Him; our Lord, and to Thee be praise.  he then did so in the second rak'ah.  he thus completed four bowings and four prostrations.  The sun had become bright before he departed.</b>",
        "bookID": "3.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 911830,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811770,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "413.00",
        "babName": "The view that one should bow four times (in two rak'ahs in the prayer at an eclipse)",
        "hadithNumber": 1177,
        "hadithText": "Narrated Abd Allah b. 'Abbas:\nThe Messenger of Allah (ﷺ) prayed at the solar eclipse as reported in the tradition narrated by 'Urwah from Aishah from the Messenger of Allah (ﷺ) that he offered two rak'ahs of prayer bowing twice in each rak'ah.</b>",
        "bookID": "3.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 911840,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811780,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "413.00",
        "babName": "The view that one should bow four times (in two rak'ahs in the prayer at an eclipse)",
        "hadithNumber": 1178,
        "hadithText": "Narrated Ubayy b. Ka'b:\nAn eclipse of the sun took place in the time of the Messenger of Allah (ﷺ).  The Prophet (ﷺ) led them in prayer.  He recited one of the long surahs, bowing five times and prostrating himself twice.  He then stood up for the second rak'ah, recited one of the long surahs, bowed five times, prostrated himself twice, then sat where he was facing the qiblah and made the supplication till the eclipse was over.</b>",
        "bookID": "3.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 911850,
        "last_updated": "2016-01-28 08:13:58"
    },
    {
        "englishURN": 811790,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "413.00",
        "babName": "The view that one should bow four times (in two rak'ahs in the prayer at an eclipse)",
        "hadithNumber": 1179,
        "hadithText": "Narrated Ibn 'Abbas:\nThe Prophet (ﷺ) prayed at solar eclipse; he recited from the Qur'an and then bowed; then he recited from the Qur'an and then bowed; he then recited from the Qur'an and bowed; he then recited fromt eh Qur'an and bowed.  Then he prostrated himself and performed the second rak'ah similar to the first.</b>",
        "bookID": "3.0",
        "grade1": "Munkar",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 911860,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811820,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "413.00",
        "babName": "The view that one should bow four times (in two rak'ahs in the prayer at an eclipse)",
        "hadithNumber": 1182,
        "hadithText": "Narrated Qabisah al Hilali:\nThe solar eclipse took place... The narrator then narrated the tradition like that of Musa.  The narrator again said: Until the stars appear (in the heaven).</b>",
        "bookID": "3.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 911890,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811830,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "414.00",
        "babName": "The recitation of the Quran in the prayer at an eclipse",
        "hadithNumber": 1183,
        "hadithText": "Narrated Aishah:\nThere was an eclipse of the sun in the time of the Messenger of Allah (ﷺ).  The Messenger of Allah (ﷺ) came out and led the people in prayer.  he stood up and I guessed that he recited Surah al-Baqarah.  The narrator then further transmitted the tradition.  He (the Prophet) then prostrated himself twice, and then stood up and prolonged the recitation.  then I guessed his recitation and knew that he recited Surah Al-i-Imran.</b>",
        "bookID": "3.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 911900,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811840,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "414.00",
        "babName": "The recitation of the Quran in the prayer at an eclipse",
        "hadithNumber": 1184,
        "hadithText": "Narrated A'ishah (May Allah be pleased with her):\nThe Messenger of Allah (may peace be upon on him) recited from teh Qur'an in a loud voice in the prayer at an eclipse.</b>",
        "bookID": "3.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 911910,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811850,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "414.00",
        "babName": "The recitation of the Quran in the prayer at an eclipse",
        "hadithNumber": 1185,
        "hadithText": "Narrated Ibn 'Abbas:\nAn eclipse of the sun took place.  the Messenger of Allah (ﷺ) prayed along with the people.  He stood up for a long time nearly equal to the recitation of Surah al Baqarah.  H then bowed.  The narrator then transmitted the rest of the tradition.</b>",
        "bookID": "3.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 911920,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811860,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "415.00",
        "babName": "To call the people for prayer at an eclipse",
        "hadithNumber": 1186,
        "hadithText": "Narrated A'ishah (May Allah be pleased with her):\nThere was an eclipse of the sun.  The Messenger of Allah (ﷺ) commanded a man who summoned: \"The prayer will be held in congregation\"</b>",
        "bookID": "3.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 911930,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811870,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "416.00",
        "babName": "To give alms at an eclipse",
        "hadithNumber": 1187,
        "hadithText": "Narrated A'ishah (May Allah be pleased with her):\nThe sun and the moon are not eclipsed on account of anyone's death or on account of anyone's birth.  So when you see that, supplicate Allah, declare His greatness, and give alms.</b>",
        "bookID": "3.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 911940,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811880,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "417.00",
        "babName": "The manumission of slaves at an eclipse",
        "hadithNumber": 1188,
        "hadithText": "Narrated Asma:\nThe Prophet (peace be upon him) used to command us to free slaves on the occasion of an eclipse</b>",
        "bookID": "3.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 911950,
        "last_updated": "2012-10-22 00:29:58"
    },
    {
        "englishURN": 811910,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 3,
        "bookName": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
        "babNumber": "418.00",
        "babName": "To perform bowing twice in each rak'ah in the prayer at an eclipse",
        "hadithNumber": 1191,
        "hadithText": "Narrated 'Abd al-Rahman b. Samurah :\nDuring the lifetime of the Messenger of Allah (peace be upon him) I was shooting some arrows when an eclipse of the sun tok place.  I, therefore , threw them (the arrows) away and said: I must see how the Messenger of Allah (ﷺ) acts in a solar eclipse today.  So I came to him; he was standing (in prayer) raising his hands, glorifying Allah, praising Him, acknowledging that He is the only Deity, and making supplication till the sun was clear.  He then recited two surahs and prayed two rak'ahs.</b>",
        "bookID": "3.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 911980,
        "last_updated": "2012-10-22 00:29:58"
    }
]