[
    {
        "englishURN": 842280,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1579.00",
        "babName": "Mention Of Tribulations And Their Signs",
        "hadithNumber": 4228,
        "hadithText": "Narrated Hudhaifa:\nThe Messenger of Allah (ﷺ) stood among us (to give us an address) and he left out nothing that would happen up to the last hour without telling of it. Some remembered it and some forgot,  and these Companions of his have known it. When something of it which I have forgotten happens, I remembered it, just as a man remembers another's face when he is a away and recognizes him when he sees him.</b>",
        "bookID": "36.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 942430,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842290,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1579.00",
        "babName": "Mention Of Tribulations And Their Signs",
        "hadithNumber": 4229,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Mas'ud:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: four (majestic) trials (fitnahs) will take place among this community, and in their end there will be destruction.\n</p></b>",
        "bookID": "36.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 942440,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842300,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1579.00",
        "babName": "Mention Of Tribulations And Their Signs",
        "hadithNumber": 4230,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Umar:\n</p>\n\n\n\n<p>\n\nWhen we were sitting with the Messenger of Allah (ﷺ), he talked about periods of trial (fitnahs), mentioning many of them.  \n</p>\n\n\n<p>\n\nWhen he mentioned the one when people should stay in their houses, some asked him: Messenger of Allah, what is the trial (fitnah) of staying at home?  \n</p>\n\n\n<p>\n\nHe replied: It will be flight and plunder. Then will come a test which is pleasant. Its murkiness is due to the fact that it is produced by a man from the people of my house, who will assert that he belongs to me, whereas he does not, for my friends are only the God-fearing. Then the people will unite under a man who will be like a hip-bone on a rib. Then there will be the little black trial which will leave none of this community without giving him a slap, and when people say that it is finished, it will be extended. During it a man will be a believer in the morning and an infidel in the evening, so that the people will be in two camps: the camp of faith which will contain no hypocrisy, and the camp of hypocrisy which will contain no faith. When that happens, expect the Antichrist (Dajjal) that day or the next.\n</p></b>",
        "bookID": "36.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 942450,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842310,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1579.00",
        "babName": "Mention Of Tribulations And Their Signs",
        "hadithNumber": 4231,
        "hadithText": "<p>\n\nNarrated Hudhayfah ibn al-Yaman:\n</p>\n\n\n\n<p>\n\nI swear by Allah, I do not know whether my companions have forgotten or have pretended to forgot. I swear by Allah that the Messenger of Allah (ﷺ) did not omit a leader of a wrong belief (fitnah)--up to the end of the world--whose followers reach the number of three hundred and upwards but he mentioned to us his name, his father's name and the name of his tribe.\n</p></b>",
        "bookID": "36.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 942460,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842320,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1579.00",
        "babName": "Mention Of Tribulations And Their Signs",
        "hadithNumber": 4232,
        "hadithText": "<p>\n\nNarrated Hudhayfah ibn al-Yaman:\n</p>\n\n\n\n<p>\n\nSubay' ibn Khalid said: I came to Kufah at the time when Tustar was conquered. I took some mules from it. When I entered the mosque (of Kufah), I found there some people of moderate stature, and among them was a man whom you could recognize when you saw him that he was from the people of Hijaz.  \n</p>\n\n\n<p>\n\nI asked: Who is he?  The people frowned at me and said: Do you not recognize him? This is Hudhayfah ibn al-Yaman, the companion of the Messenger of Allah (ﷺ).  \n</p>\n\n\n<p>\n\nThen Hudhayfah said: People used to ask the Messenger of Allah (ﷺ) about good, and I used to ask him about evil. Then the people stared hard at him.  \n</p>\n\n\n<p>\n\nHe said: I know the reason why you dislike it. I then asked: Messenger of Allah, will there be evil as there was before, after this good which Allah has bestowed on us?  \n</p>\n\n\n<p>\n\nHe replied: Yes.  I asked: Wherein does the protection from it lie?  He replied: In the sword.  I asked: Messenger of Allah, what will then happen?  \n</p>\n\n\n<p>\n\nHe replied: If Allah has on Earth a caliph who flays your back and takes your property, obey him, otherwise die holding onto the stump of a tree.  \n</p>\n\n\n<p>\n\nI asked: What will come next?  He replied: Then the Antichrist (Dajjal) will come forth accompanied by a river and fire. He who falls into his fire will certainly receive his reward, and have his load taken off him, but he who falls into his river will have his load retained and his reward taken off him.  \n</p>\n\n\n<p>\n\nI then asked: What will come next?  He said: The Last Hour will come.\n</p></b>",
        "bookID": "36.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 942470,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842330,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1579.00",
        "babName": "Mention Of Tribulations And Their Signs",
        "hadithNumber": 4233,
        "hadithText": "<p>\nThe traditions mentioned above has also been transmitted by Khalid b. Khalid al-Yashkuri through different chain of narrators. This version has: I (Hudhaifah) asked : Will any be spared after the use of the sword ? He replied: There will be remnant with specks in its eye and an illusory truce. He then transmitted the rest of the tradition. Qatadah applied this to the apostasy during the Caliphate of Abu Bakr.\n</p>\n<p>\nThe word aqdha' (sing. qadhan) means specks, hudnah means truce and dakhan means malice.\n</p></b>",
        "bookID": "36.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 942480,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842340,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1579.00",
        "babName": "Mention Of Tribulations And Their Signs",
        "hadithNumber": 4234,
        "hadithText": "<p>\n\nNarrated Hudhayfah:\n</p>\n\n\n\n<p>\n\nThe tradition mentioned above (No. 4232) has also been transmitted through a different chain of narrators by Nasr ibn Asim al-Laythi who said: We came to al-Yashkuri with a group of the people of Banu Layth.  \n</p>\n\n\n<p>\n\nHe asked: Who are these people?  We replied: Banu Layth. We have come to you to ask you about the tradition of Hudhayfah. He then mentioned the tradition and said: I asked: Messenger of Allah, will there be evil after this good?  \n</p>\n\n\n<p>\n\nHe replied: There will be trial (fitnah) and evil.  I asked: Messenger of Allah, will there be good after this evil?  He replied: Learn the Book of Allah, Hudhayfah, and adhere to its contents. He said it three times.  \n</p>\n\n\n<p>\n\nI asked: Messenger of Allah, will there be good after this evil?  He replied: An illusory truce and a community with specks in its eye.  I asked: Messenger of Allah, what do you mean by an illusory community?  \n</p>\n\n\n<p>\n\nHe replied: The hearts of the people will not return to their former condition.  I asked: Messenger of Allah, will there be evil after this good?  He replied: There will be wrong belief which will blind and deafen men to the truth in which there will be summoners at the gates of Hell. If you, Hudhayfah, die adhering to a stump, it will be better for you than following any of them.\n</p></b>",
        "bookID": "36.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 942490,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842350,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1579.00",
        "babName": "Mention Of Tribulations And Their Signs",
        "hadithNumber": 4235,
        "hadithText": "The tradition mentioned above has also been transmitted by Hudhaifah through a different chain of narrators from the Prophet (ﷺ). This version says: He said: If you do not find a caliph in those days, then flee away until you die, even of you die holding on (to a stump of a tree). I asked: What will come next ? He replied: If a man wants the mare to bring forth a foal, it will not deliver in till the Last Hour comes.</b>",
        "bookID": "36.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 942500,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842360,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1579.00",
        "babName": "Mention Of Tribulations And Their Signs",
        "hadithNumber": 4236,
        "hadithText": "Narrated Abdullah b. 'Amr:\nThe Prophet (ﷺ) as saying: If a man takes an oath of allegiance to a leader, and puts his hand on his hand and does it with the sincerity of his heart, he should obey him as much as possible. If another man comes and contests him, then behead the other one. The narrator 'Abd al-Rahman said: I asked: Have you heard this from the Messenger of Allah ? He said: My ears heard it and my heart retained it. I said: Your cousin Mu'awiyah orders us that we should do this and do that. He replied: Obey him in the acts of obedience to Allah, and disobey him in the acts of disobedience to Allah.</b>",
        "bookID": "36.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 942510,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842370,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1579.00",
        "babName": "Mention Of Tribulations And Their Signs",
        "hadithNumber": 4237,
        "hadithText": "<p>\n\nNarrated Abu Hurairah:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) as saying: Woe to Arabs because of evil which has drawn near! He will escape who restrains his hand.\n</p></b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 942520,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 842371,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1579.00",
        "babName": "Mention Of Tribulations And Their Signs",
        "hadithNumber": 4237,
        "hadithText": "Abu Dawud said: Ibn 'Umar reported the Messenger of Allah (ﷺ) as saying: The Muslims will soon be besieged up to Medina, so that their most distant frontier outpost will be Salah.</b>",
        "bookID": "36.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 942530,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842380,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1579.00",
        "babName": "Mention Of Tribulations And Their Signs",
        "hadithNumber": 4238,
        "hadithText": "Al-Zuhri said: Salah is near Khaibar.</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 942540,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 842390,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1579.00",
        "babName": "Mention Of Tribulations And Their Signs",
        "hadithNumber": 4239,
        "hadithText": "Narrated Thawban:\nThe Messenger of Allah (ﷺ) as saying: Allah, the Exalted, folded for me the earth, or he said (the narrator is doubtful): My Lord folded for me the earth, so much so that I saw its easts and wests (i.e. the extremities). The kingdom of my community will reach as far as the earth was floded for me. The two treasures, the red and the white, were bestowed on me. I prayed to my Lord that He may not destroy my community by prevailing famine, and not give their control to an enemy who annihilates then en masse except from among themselves. My Lord said to me: Muhammad, If I make a decision, it is not withdrawn ; and I shall not destroy them by prevailing famine, and I shall not give their control to an enemy, except from among themselves, who exterminates them en masse, even if they are stormed from all sides of the earth ; only a section of them will destroy another section, and a section will captive another section. I am afraid about my community of those leaders who will lead astray. When the sword is used among my people, it will not be withdrawn from them till the Day of Resurrection, and the Last Hour will not come before the tribes of my people attach themselves to the polytheists and tribes of my people worship idols. There will be among my people thirty great liars each of them asserting that he is (Allah's) prophet, where as I am the seal of the Prophet  s after whom (me) there will be no prophet ; and a section of my people will continue to hold to the truth - (according to the Ibn Isa's version: (will continue to dominate) - the agreed version goes: \"and will not be injured by those who oppose them, till Allah's command comes.\"</b>",
        "bookID": "36.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 942550,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842400,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1579.00",
        "babName": "Mention Of Tribulations And Their Signs",
        "hadithNumber": 4240,
        "hadithText": "<p>\n\nNarrated AbuMalik al-Ash'ari:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: Allah  has protected you from three things: that your Prophet should not invoke a curse on you and should all perish, that those who follow what is false should not prevail over those who follow the truth, and that you should not all agree in an error.\n</p></b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 942560,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 842410,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1579.00",
        "babName": "Mention Of Tribulations And Their Signs",
        "hadithNumber": 4241,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Mas'ud:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: The mill of Islam will go round till the year thirty-five, or thirty-six, or thirty-seven; then if they perish, they will have followed the path of those who perished before them, but if their religion is maintained, it will be maintained for seventy years. I asked: Does it mean seventy years which remain or seventy years which are gone by? He replied: It means (seventy years) that are gone by.\n</p>\n<p>\nAbu Dawud said: Those who recorded Khirash, the name of a narrator, are wrong. (The correct name is Hirash)\n</p></b>",
        "bookID": "36.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 942570,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842420,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1579.00",
        "babName": "Mention Of Tribulations And Their Signs",
        "hadithNumber": 4242,
        "hadithText": "Narrated Abu Hurairah :\nThe Messenger of Allah (ﷺ) as saying: The time will become short, knowledge will be decreased, civil strife (fitan) will appear, niggardliness will be case into people's heart, and harj will be prevalent. He was asked: Messenger of Allah! what is it: He replied: Slaughter, slaughter.</b>",
        "bookID": "36.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 942580,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842430,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1580.00",
        "babName": "The Prohibition Of Participating In The Tribulation",
        "hadithNumber": 4243,
        "hadithText": "<p>\n\nNarrated AbuBakrah:\n</p>\n\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) said: There will be a period of commotion in which the one who lies down will be better than the one who sits, and the one who sits is better than the one who stands, and the one who stands is better than the one who walks, and the one who walks is better than the one who runs (to it).  \n</p>\n\n\n<p>\n\nHe asked: What do you command me to do, Messenger of Allah?  He replied: He who has camels should remain with his camels, he who has sheep should remain with his sheep, and he who has land should remain with his land.  \n</p>\n\n\n<p>\n\nHe asked: If anyone has more of these, (what should he do)?  \n</p>\n\n\n<p>\n\nHe replied: He should take his sword, strike its edge on a stone, and then escape if he can.\n</p></b>",
        "bookID": "36.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 942590,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842440,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1580.00",
        "babName": "The Prohibition Of Participating In The Tribulation",
        "hadithNumber": 4244,
        "hadithText": "<p>\n\nNarrated Sa'd ibn AbuWaqqas:\n</p>\n\n\n\n<p>\n\nI asked: Messenger of Allah! tell me if someone enters my house and extends his hands to kill me (what should I do?) The Messenger of Allah (ﷺ) replied: Be like the two sons of Adam. The narrator Yazid (ibn Khalid) then recited the verse: \"If thou dost stretch they hand against me to slay me.\" [5:28]\n</p></b>",
        "bookID": "36.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 942600,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842450,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1580.00",
        "babName": "The Prohibition Of Participating In The Tribulation",
        "hadithNumber": 4245,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Mas'ud ; Khuraym ibn Fatik:\n</p>\n\n\n\n<p>\n\nThe tradition mentioned above (No. 4243) has also been transmitted by Ibn Mas'ud through a different chain of narrators.  \n</p>\n\n\n<p>\n\nIbn Mas'ud said: I heard the Prophet (ﷺ) say: He then mentioned a portion of the tradition narrated by AbuBakrah (No. 4243).  \n</p>\n\n\n<p>\n\nThis version adds: He (the Prophet) said: All their slain will go to Hell.  I (Wabisah) asked: When will this happen Ibn Mas'ud?  \n</p>\n\n\n<p>\n\nHe replied: This is the period of turmoil (harj) when a man will not be safe from his associates.  \n</p>\n\n\n<p>\n\nI asked: What do you command me (to do) if I happen to live during that period?  He replied: You should restrain your tongue and hand and stay at home.  \n</p>\n\n\n<p>\n\nWhen Uthman was slain, I recollected this tradition. I then rode (on a camel) and came to Damascus. There I met Khuraym ibn Fatik and mentioned this tradition to him. He swore by Allah, there was no god but He, he had heard it from the Messenger of Allah (ﷺ), as Ibn Mas'ud transmitted it to me (Wabisah).\n</p></b>",
        "bookID": "36.0",
        "grade1": "Da'if in chain",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 942610,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842460,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1580.00",
        "babName": "The Prohibition Of Participating In The Tribulation",
        "hadithNumber": 4246,
        "hadithText": "<p>\n\nNarrated AbuMusa al-Ash'ari:\n</p>\n\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) said: Before the Last Hour there will be commotions like pieces of a dark night in which a man will be a believer in the morning and an infidel in the evening, or a believer in the evening and infidel in the morning. He who sits during them will be better than he who gets up and he who walks during them is better than he who runs. So break your bows, cut your bowstrings and strike your swords on stones. If people then come in to one of you, let him be like the better of Adam's two sons.\n</p></b>",
        "bookID": "36.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 942620,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842470,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1580.00",
        "babName": "The Prohibition Of Participating In The Tribulation",
        "hadithNumber": 4247,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Umar:\n</p>\n\n\n\n<p>\n\nAbdurRahman ibn Samurah said: I was holding the hand of Ibn Umar on one of the ways of Medina. He suddenly came to a hanging head. He said: Unhappy is the one who killed him. When he proceeded, he said: I do not consider him but unfortunate. I heard the Messenger of Allah (ﷺ) say: If anyone goes to a man of my community in order to kill him, he should say in this way, the one who kills will go to Hell and the one who is killed will go to Paradise.\n</p>\n\n<p>\nAbu Dawud said: Al-Thawri has transmitted it from 'Awn from 'Abd al-Rahman b. Sumair or Sumairah ; and Laith b. Abu Sulaim transmitted it from 'Awn from 'Abd al-Rahman b. Sumairah.\n</p>\n<p>\nAbu Dawud said: Al-Hasan b. 'Ali said to me: Abu al-Walid transmitted this tradition to us from Abu 'Awanah, and said: It (the name Ibn Samurah) is in my notebook Ibn Sabrah. The people also transmitted it as Samurah and Sumairah. These are wordings of Abu al-Walid.\n</p></b>",
        "bookID": "36.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 942630,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842480,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1580.00",
        "babName": "The Prohibition Of Participating In The Tribulation",
        "hadithNumber": 4248,
        "hadithText": "<p>\n\nNarrated AbuDharr:\n</p>\n\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) said to me: O AbuDharr.  I replied: At thy service and at thy pleasure, Messenger of Allah.  He then mentioned the tradition in which he said: What will you do when there the death of the people (in Medina) and a house will reach the value of a slave (that is, a grave will be sold for a slave).  \n</p>\n\n\n<p>\n\nI replied: Allah and His Apostle know best. Or he said: What Allah and His Apostle choose for me.  \n</p>\n\n\n<p>\n\nHe said: You must show endurance. Or he said; you may endure. He then said to me: What will you do, AbuDharr, when you see the Ahjar az-Zayt covered with blood?  \n</p>\n\n\n<p>\n\nI replied: What Allah and His Apostle choose for me.  \n</p>\n\n\n<p>\n\nHe said: You must go to those who are like-minded.  \n</p>\n\n\n<p>\n\nI asked: Should I not take my sword and put it on my shoulder?  He replied: you would then associate yourself with the people.  I then asked: What do you order me to do?  You must stay at home.  I asked: (What should I do) if people enter my house and find me?  \n</p>\n\n\n<p>\n\nHe replied: If you are afraid the gleam of the sword may dazzle you, put the end of your garment over your face in order that (the one who kills you) may bear the punishment of your sins and his.\n</p>\n\n<p>\nAbu Dawud said: No one mentioned al-Mush'ath in the chain of this tradition except Hammad b. Zaid.\n</p></b>",
        "bookID": "36.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 942640,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842490,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1580.00",
        "babName": "The Prohibition Of Participating In The Tribulation",
        "hadithNumber": 4249,
        "hadithText": "<p>\n\nNarrated AbuMusa al-Ash'ari:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: Before you there will be commotions like pieces of a dark night in which a man will be a believer in the morning and an infidel in the evening. He who sits during them will be better than he who gets up, and he who gets up during them is better than he who walks, and he who walks during them is better than he who runs. They (the people) said: What do you order us to do? He replied: Keep to your houses.\n</p></b>",
        "bookID": "36.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 942650,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842500,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1580.00",
        "babName": "The Prohibition Of Participating In The Tribulation",
        "hadithNumber": 4250,
        "hadithText": "<p>\n\nNarrated Al-Miqdad ibn al-Aswad:\n</p>\n\n\n\n<p>\n\nI swear by Allah, I heard the Messenger of Allah (ﷺ) say: The happy man is he who avoids dissensions: happy is the man who avoids dissensions; happy is the man who avoids dissensions: but how fine is the man who is afflicted and shows endurance.\n</p></b>",
        "bookID": "36.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 942660,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842510,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1581.00",
        "babName": "Regarding Restraining The Tongue",
        "hadithNumber": 4251,
        "hadithText": "<p>\n\nNarrated AbuHurayrah:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: There will be civil strife (fitnah) which will render people deaf, dumb and blind regarding what is right. Those who contemplate it will be drawn by it, and giving rein to the tongue during it will be like smiting with the sword.\n</p></b>",
        "bookID": "36.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 942670,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842520,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1581.00",
        "babName": "Regarding Restraining The Tongue",
        "hadithNumber": 4252,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Amr ibn al-'As:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: There will be civil strife which wipe out the Arabs, and their slain will go to Hell. During it the tongue will be more severe than blows of the sword.\n</p>\n\n<p>\nAbu Dawud said: Al-Thawri transmitted it from Laith, from Tawus on the authority of Al-A'jam.\n</p></b>",
        "bookID": "36.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 942680,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842530,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1581.00",
        "babName": "Regarding Restraining The Tongue",
        "hadithNumber": 4253,
        "hadithText": "'Abd Allah b. 'Abd al-Quddus mentioned in his version: Ziyad, one who has white ears.</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 942690,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 842540,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1582.00",
        "babName": "The Concession Allowing Living As A Bedouin During The Tribulation",
        "hadithNumber": 4254,
        "hadithText": "Narrated Abu Sa’id Al Khudri :\nThe Messenger of Allah (ﷺ) as saying: A Muslim's best property will soon be sheep which he will take to the tops of the mountains and the places where the rain falls, fleeing with his religion from the civil strife (fitan).</b>",
        "bookID": "36.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 942700,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842550,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1583.00",
        "babName": "The Prohibition From Fighting During The Tribulation",
        "hadithNumber": 4255,
        "hadithText": "Ahnaf b. Qais said: I came out with the intention of (participating in) fighting. Abu Bakrah met me and said: Go back, for I heard the Messenger of Allah (ﷺ) say: When two Muslims face each other with their swords, the killer and the slain will go to Hell. He asked: Messenger of Allah, this is the killer (so naturally he should go to Hell), but what is the matter with the slain ? He replied: He intended to kill his companion.</b>",
        "bookID": "36.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 942710,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842560,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1583.00",
        "babName": "The Prohibition From Fighting During The Tribulation",
        "hadithNumber": 4256,
        "hadithText": "The tradition mentioned above has also been transmitted briefly by al-Hasan through a different chain of narrators to the same effect.</b>",
        "bookID": "36.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 942720,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 842570,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1584.00",
        "babName": "Regarding The Gravity Of Killing A Believer",
        "hadithNumber": 4257,
        "hadithText": "<p>\n\nNarrated AbudDarda' and Ubadah ibn as-Samit:\n</p>\n\n\n\n<p>\n\nKhalid ibn Dihqan said: When we were engaged in the battle of Constantinople at Dhuluqiyyah, a man of the people of Palestine, who was one of their nobility and elite and whose rank was known to them, came forward. He was called Hani ibn Kulthum ibn Sharik al-Kinani. He greeted Abdullah ibn Zakariyya who knew his rank.  \n</p>\n\n\n<p>\n\nKhalid said to us: Abdullah ibn AbuZakariyya told us: I heard Umm ad-Darda' say: I heard AbudDarda' say: I heard the Messenger of Allah (ﷺ) say: It is hoped that Allah may forgive every sin, except in the case of one who dies a polytheist, or one who purposely kills a believer.  \n</p>\n\n\n<p>\n\nHani ibn Kulthum ar-Rabi' then said: I heard Mahmud ibn ar-Rabi' transmitting a tradition from Ubadah ibn as-Samit who transmitted from the Messenger of Allah (ﷺ) who said: If a man kills a believer unjustly, Allah will not accept any action or duty of his, obligatory or supererogatory. \n</p>\n\n\n<p>\n\nKhalid then said to us: Ibn AbuZakariyya transmitted a tradition to us from Umm ad-Darda' on the authority of AbudDarda' from the Messenger of Allah (ﷺ) who said: A believer will continue to go on quickly and well so long as he does not shed unlawful blood; when he sheds unlawful blood, he becomes slow and heavy-footed. \n</p>\n\n\n<p>\n\nA similar tradition has been transmitted by Hani ibn Kulthum from Mahmud ibn ar-Rabi' on the authority of Ubadah ibn as-Samit from the Messenger of Allah (ﷺ).\n</p></b>",
        "bookID": "36.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 942730,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842580,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1584.00",
        "babName": "Regarding The Gravity Of Killing A Believer",
        "hadithNumber": 4258,
        "hadithText": "<p>\nKhalid b. Dihqan said: I asked Yahya b. Yahya al-Ghassani about the word i'tabata bi qatlihi spoken by him (as mentioned in the previous tradition). He said: It means those people who fight during the period of commotion (fitnah), and one of them kills (the other people) presuming that he is in the right, so he does not beg pardon of Allah of that (sin).\n</p>\n<p>\nAbu Dawud said: And he said: The word fa'tabata means \"he shed blood profusely\"\n</p></b>",
        "bookID": "36.0",
        "grade1": "Sahih Maqtu'",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 942740,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842590,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1584.00",
        "babName": "Regarding The Gravity Of Killing A Believer",
        "hadithNumber": 4259,
        "hadithText": "<p>\n\nNarrated Zayd ibn Thabit:\n</p>\n\n\n\n<p>\n\nThe verse \"If a man kills a believer intentionally, his recompense is Hell to abide therein for ever\" was revealed six months after the verse \"And those who invoke not with Allah any other god, nor slay such life as Allah has made sacred, except for just cause in Surat al-Furqan.\n</p></b>",
        "bookID": "36.0",
        "grade1": "Munkar",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 942750,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842600,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1584.00",
        "babName": "Regarding The Gravity Of Killing A Believer",
        "hadithNumber": 4260,
        "hadithText": "Sa'id bin Jubair said: I asked Ibn 'Abbas (about the verse relating to intentional homicide in Surat An-Nisa') He said: When the verse \"Those who invoke not with Allah any other god, nor slay such life as Allah had made sacred, except for just cause\" was revealed, the polytheists of Mecca said: We have killed the soul prohibited by Allah, invoked another god along with Allah for worship, and committed shameful deeds. So Allah revealed the verse \"unless he repents, believes, and works righteous deeds, for Allah will change the evil of such persons into good.\" This is meant for them. As regards the verse \"if a man kills a believer intentionally, his recompense is Hell\" He said: If a man knows the command of Islam and intentionally kills a believer, his repentance wil not be accepted. I then mentioned it to Mujahid. He said: \"Except the one who is ashamed (of his sin).\"</b>",
        "bookID": "36.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 942760,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842610,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1584.00",
        "babName": "Regarding The Gravity Of Killing A Believer",
        "hadithNumber": 4261,
        "hadithText": "The tradition mentioned above has also been transmitted by Sa'id b. Jubair from Ibn 'Abbas through a different chain of narrators. Ibn 'Abbas said: The verse: \"Those who invoke not with Allah\" applied to polytheists. He said: About them another verse, \"Say: O my servants who have transgressed against their souls\" was also revealed.</b>",
        "bookID": "36.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 942770,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842620,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1584.00",
        "babName": "Regarding The Gravity Of Killing A Believer",
        "hadithNumber": 4262,
        "hadithText": "Ibn 'Abbas said: No other verse has repealed the verse \"If a man kills a believer intentionally\"</b>",
        "bookID": "36.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 942780,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842630,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1584.00",
        "babName": "Regarding The Gravity Of Killing A Believer",
        "hadithNumber": 4263,
        "hadithText": "About the verse \"If a man kills a believer intentionally\" Abu Mijlaz said: This is his recompense. If Allah wishes to disregard him, He may do do.</b>",
        "bookID": "36.0",
        "grade1": "Hasan Maqtu'",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 942790,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842640,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1585.00",
        "babName": "Hope Of Forgiveness For Murder",
        "hadithNumber": 4264,
        "hadithText": "<p>\n\nNarrated Sa'id ibn Zayd:\n</p>\n\n\n\n<p>\n\nWe were with the Prophet (ﷺ). He mentioned civil strife (fitnah) and expressed its gravity. We or the people said: Messenger of Allah, if this happens to us it will destroy us. The Messenger of Allah (ﷺ) said; No. It is enough for you that you would be killed. Sa'id said: I saw that my brethren were killed.\n</p></b>",
        "bookID": "36.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 942800,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 842650,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 36,
        "bookName": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)",
        "babNumber": "1585.00",
        "babName": "Hope Of Forgiveness For Murder",
        "hadithNumber": 4265,
        "hadithText": "<p>\n\nNarrated AbuMusa:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: This people of mine is one to which mercy is shown. It will have no punishment in the next world, but its punishment in this world will be trials, earthquakes and being killed.\n</p></b>",
        "bookID": "36.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 942810,
        "last_updated": "2012-10-22 00:29:59"
    }
]