[
    {
        "englishURN": 843390,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1605.00",
        "babName": "PUNISHMENT OF AN APOSTATE",
        "hadithNumber": 4339,
        "hadithText": "<p>\n\nNarrated Aisha, Ummul Mu'minin:\n</p>\n\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) Said:  The blood of a Muslim man who testifies that there is no god but Allah and that Muhammad is Allah's Apostle  should not lawfully be shed except only for one of three reasons: a man who committed fornication after marriage, in which case he should be stoned; one who goes forth to fight with Allah and His Apostle, in which case he should be killed or crucified or exiled from the land; or one who commits murder for which he is killed.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 943560,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843410,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1605.00",
        "babName": "PUNISHMENT OF AN APOSTATE",
        "hadithNumber": 4341,
        "hadithText": "<p>\n\nNarrated Mu'adh ibn Jabal:\n</p>\n\n\n\n<p>\n\nAbuMusa said: Mu'adh came to me when I was in the Yemen. A man who was Jew embraced Islam and then retreated from Islam. When Mu'adh came, he said: I will not come down from my mount until he is killed. He was then killed. One of them said: He was asked to repent before that.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 943580,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843450,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1605.00",
        "babName": "PUNISHMENT OF AN APOSTATE",
        "hadithNumber": 4345,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nAbdullah ibn AbuSarh used to write (the revelation) for the Messenger of Allah (ﷺ). Satan made him slip, and he joined the infidels. The Messenger of Allah (ﷺ) commanded to kill him on the day of Conquest (of Mecca). Uthman ibn Affan sought protection for him. The Messenger of Allah (ﷺ) gave him protection.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Hasan in chain",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 943610,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843460,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1605.00",
        "babName": "PUNISHMENT OF AN APOSTATE",
        "hadithNumber": 4346,
        "hadithText": "<p>\n\nNarrated Sa'd ibn AbuWaqqas:\n</p>\n\n\n\n<p>\n\nOn the day of the conquest of Mecca, Abdullah ibn Sa'd ibn AbuSarh hid himself with Uthman ibn Affan.  \n</p>\n\n\n<p>\n\nHe brought him and made him stand before the Prophet (ﷺ), and said: Accept the allegiance of Abdullah, Messenger of Allah! He raised his head and looked at him three times, refusing him each time, but accepted his allegiance after the third time.  \n</p>\n\n\n<p>\n\nThen turning to his companions, he said: Was not there a wise man among you who would stand up to him when he saw that I had withheld my hand from accepting his allegiance, and kill him?  \n</p>\n\n\n<p>\n\nThey said: We did not know what you had in your heart, Messenger of Allah! Why did you not give us a signal with your eye?  \n</p>\n\n\n<p>\n\nHe said: It is not advisable for a Prophet to play deceptive tricks with the eyes.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 943620,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843480,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1606.00",
        "babName": "PUNISHMENT OF A MAN WHO ABUSES THE PROPHET (MAY PEACE BE UPON HIM)",
        "hadithNumber": 4348,
        "hadithText": "<p>\n\nNarrated Abdullah Ibn Abbas:\n</p>\n\n\n\n<p>\n\nA blind man had a slave-mother who used to abuse the Prophet (ﷺ) and disparage him. He forbade her but she did not stop. He rebuked her but she did not give up her habit. One night she began to slander the Prophet (ﷺ) and abuse him. So he took a dagger, placed it on her belly, pressed it, and killed her. A child who came between her legs was smeared with the blood that was there. When the morning came, the Prophet (ﷺ) was informed about it.  \n</p>\n\n\n<p>\n\nHe assembled the people and said: I adjure by Allah the man who has done this action and I adjure him by my right to him that he should stand up. Jumping over the necks of the people and trembling the man stood up.  \n</p>\n\n\n<p>\n\nHe sat before the Prophet (ﷺ) and said: Messenger of Allah! I am her master; she used to abuse you and disparage you. I forbade her, but she did not stop, and I rebuked her, but she did not abandon her habit. I have two sons like pearls from her, and she was my companion. Last night she began to abuse and disparage you. So I took a dagger, put it on her belly and pressed it till I killed her.  \n</p>\n\n\n<p>\n\nThereupon the Prophet (ﷺ) said: Oh be witness, no retaliation is payable for her blood.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 943640,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843490,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1606.00",
        "babName": "PUNISHMENT OF A MAN WHO ABUSES THE PROPHET (MAY PEACE BE UPON HIM)",
        "hadithNumber": 4349,
        "hadithText": "<p>\n\nNarrated Ali ibn AbuTalib:\n</p>\n\n\n\n<p>\n\nA Jewess used to abuse the Prophet (ﷺ) and disparage him. A man strangled her till she died. The Messenger of Allah (ﷺ) declared that no recompense was payable for her blood.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Da'if in chain",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 943650,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843500,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1606.00",
        "babName": "PUNISHMENT OF A MAN WHO ABUSES THE PROPHET (MAY PEACE BE UPON HIM)",
        "hadithNumber": 4350,
        "hadithText": "<p>\n\nNarrated AbuBakr:\n</p>\n\n\n\n<p>\n\nAbuBarzah said: I was with AbuBakr. He became angry at a man and uttered hot words. I said: Do you permit me, Caliph of the Messenger of Allah (ﷺ), that I cut off his neck? These words of mine removed his anger; he stood and went in. He then sent for me and said: What did you say just now? I said: (I had said:) Permit me that I cut off his neck. He said: Would you do it if I ordered you? I said: Yes. He said: No, I swear by Allah, this is not allowed for any man after Muhammad (ﷺ).\n</p>\n\n<p>\nAbu Dawud said: This is Yazid's version. Ahmad bin Hanbal said: That is, Abu Bakr has no powers to slay a man except for three reasons which the Messenger of Allah (ﷺ) had mentioned: disbelief after belief, fornication after marriage, or killing a man without (murdering) any man by him. The Prophet (ﷺ) had powers to kill.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 943660,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843560,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1607.00",
        "babName": "FIGHTING AGAINST ALLAH AND PROPHET (SAWS)",
        "hadithNumber": 4356,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Umar:\n</p>\n\n\n\n<p>\n\nSome people raided the camels of the Prophet (ﷺ), drove them off, and apostatised. They killed the herdsman of the Messenger of Allah (ﷺ) who was a believer. He (the Prophet) sent (people) in pursuit of them and they were caught. He had their hands and feet cut off, and their eyes put out. The verse regarding fighting against Allah and His Prophet (ﷺ) was then revealed. These were the people about whom Anas ibn Malik informed al-Hajjaj when he asked him.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Hasan Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 943720,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843570,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1607.00",
        "babName": "FIGHTING AGAINST ALLAH AND PROPHET (SAWS)",
        "hadithNumber": 4357,
        "hadithText": "<p>\n\nNarrated AbuzZinad:\n</p>\n\n\n\n<p>\n\nWhen the Messenger of Allah (ﷺ) cut off (the hands and feet of) those who had stolen his camels and he had their eyes put out by fire (heated nails), Allah reprimanded him on that (action), and Allah, the Exalted, revealed: \"The punishment of those who wage war against Allah and His Apostle  and strive with might and main for mischief through the land is execution or crucifixion.\"\n</p></b>",
        "bookID": "39.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 943730,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843590,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1607.00",
        "babName": "FIGHTING AGAINST ALLAH AND PROPHET (SAWS)",
        "hadithNumber": 4359,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nThe verse \"The punishment of those who wage war against Allah and His Apostle, and strive with might and main for mischief through the land is execution, or crucifixion, or the cutting off of hands and feet from opposite side or exile from the land...most merciful\" was revealed about polytheists. If any of them repents before they are arrested, it does not prevent from inflicting on him the prescribed punishment which he deserves.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 943750,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843620,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1608.00",
        "babName": "INTERCESSION REGARDING PRESCRIBED PUNISHMENTS",
        "hadithNumber": 4362,
        "hadithText": "<p>\n\nNarrated Aisha, Ummul Mu'minin:\n</p>\n\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) Said: Forgive the people of good qualities their slips, but not faults to which prescribed penalties apply.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 943780,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843630,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1609.00",
        "babName": "FORGIVING FAULTS WHICH INVOLVE PRESCRIBED PUNISHMENTS BEFORE THEY ARE REPORTED TO THE AUTHORITIES",
        "hadithNumber": 4363,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Amr ibn al-'As:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: Forgive the infliction of prescribed penalties among yourselves, for any prescribed penalty of which I hear must be carried out.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 943790,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843640,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1610.00",
        "babName": "CONCEALING CRIME OF CRIMINALS TO WHOM PRESCRIBE PUNISHMENT APPLIES",
        "hadithNumber": 4364,
        "hadithText": "<p>\n\nNarrated Nu'aym:\n</p>\n\n\n\n<p>\n\nMa'iz came to the Prophet (ﷺ) and admitted (having committed adultery) four times in his presence so he ordered him to be stoned to death, but said to Huzzal: If you had covered him with your garment, it would have been better for you.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 943800,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843660,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1611.00",
        "babName": "ON A MAN TO WHOM PRESCRIBED PUNISHMENT APPLIES COMES AND ACCEPTS THE CRIME",
        "hadithNumber": 4366,
        "hadithText": "<p>\n\nNarrated Wa'il ibn Hujr:\n</p>\n\n\n\n<p>\n\nWhen a woman went out in the time of the Prophet (ﷺ) for prayer, a man attacked her and overpowered (raped) her.  \n</p>\n\n\n<p>\n\nShe shouted and he went off, and when a man came by, she said: That (man) did such and such to me. And when a company of the Emigrants came by, she said: That man did such and such to me. They went and seized the man  whom they thought had had intercourse with her and brought him to her.  \n</p>\n\n\n<p>\n\nShe said: Yes, this is he. Then they brought him to the Messenger of Allah (ﷺ).  \n</p>\n\n\n<p>\n\nWhen he (the Prophet) was about to pass sentence, the man who (actually) had assaulted her stood up and said: Messenger of Allah, I am the man who did it to her.  \n</p>\n\n\n<p>\n\nHe (the Prophet) said to her: Go away, for Allah has forgiven you. But he told the man some good words (AbuDawud said: meaning the man who was seized), and of the man who had had intercourse with her, he said: Stone him to death. \n</p>\n\n\n<p>\n\nHe also said: He has repented to such an extent that if the people of Medina had repented similarly, it would have been accepted from them.\n</p>\n\n<p>\nAbu Dawud said: Asbat bin Nasr has also transmitted it from Simak.\n</p></b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 943820,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 843670,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1612.00",
        "babName": "SUGGESTIONS TO A CRIMINAL TO WHOM THE PRESCRIBED PUNISHMENT APPLIES",
        "hadithNumber": 4367,
        "hadithText": "<p>\n\nNarrated AbuUmayyah al-Makhzumi:\n</p>\n\n\n\n<p>\n\nA thief who had accepted (having committed theft) was brought to the Prophet (ﷺ), but no good were found with him. The Messenger of Allah (ﷺ), said to him: I do not think you have stolen. He said: Yes, I have. He repeated it twice or thrice. So he gave orders. His hand was cut off and he was then brought to him. He said: Ask Allah's pardon and turn to Him in repentance. He said: I ask Allah's pardon and turn to Him in repentance. He (the Prophet) then said: O Allah, accept his repentance.\n</p>\n<p>\nAbu Dawud said: It has been transmitted by 'Amr b. Asim, from Hammam, from Ishaq b. 'Abd Allah from Abu Ummayyah, a man of the Ansar from the Prophet (ﷺ).\n</p></b>",
        "bookID": "39.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 943830,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843690,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1614.00",
        "babName": "INVESTIGATION BY BEATING A CRIMINAL",
        "hadithNumber": 4369,
        "hadithText": "<p>\n\nAzhar ibn Abdullah al-Harari said: Some goods of the people of Kila' were stolen. They accused some men of the weavers (of theft). They came to an-Nu'man ibn Bashir, the companion of the Prophet (ﷺ). He confined them for some days and then set them free.  \n</p>\n\n\n<p>\n\nThey came to an-Nu'man and said: You have set them free without beating and investigation. An-Nu'man said: What do you want? You want me to beat them. If your goods are found with them, then it is all right; otherwise, I shall take (retaliation) from your back as I have taken from their backs.  They asked: Is this your decision?  He said: This is the decision of Allah and His Apostle (ﷺ).\n</p>\n\n<p>\nAbu Dawud said: By this statement he frightened them ; that is, beating is not necessary except after acknowledgement.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 943850,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843730,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1615.00",
        "babName": "FOR HOW MUCH PROPERTY A THIEF’S HAND SHOULD BE CUT OFF?",
        "hadithNumber": 4373,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Umar:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) had a man's hand cut off who had stolen from the place reserved for women a shield whose price was three dirhams.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 943890,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843740,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1615.00",
        "babName": "FOR HOW MUCH PROPERTY A THIEF’S HAND SHOULD BE CUT OFF?",
        "hadithNumber": 4374,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) had a man's hand cut off for (stealing) a shield whose price was a dinar or ten dirhams.\n</p>\n\n<p>\nAbu Dawud said: Muhammad bin Salamah and Sa'dan bin Yahya have transmitted it from Ibn Ishaq through his chain of narrators.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Shadh",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 943900,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843750,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1615.00",
        "babName": "FOR HOW MUCH PROPERTY A THIEF’S HAND SHOULD BE CUT OFF?",
        "hadithNumber": 4375,
        "hadithText": "<p>\n\nNarrated Rafi' ibn Khadij:\n</p>\n\n\n\n<p>\n\nMuhammad ibn Yahya ibn Hibban said: A slave stole a plant of a palm-tree from the orchard of a man and planted it in the orchard of his master. The owner of the plant went out in search of the plant and he found it. He solicited help against the slave from Marwan ibn al-Hakam who was the Governor of Medina at that time. Marwan confined the slave and intended to cut off his hand. The slave's master went to Rafi' ibn Khadij and asked him about it.  \n</p>\n\n\n<p>\n\nHe told him that he had heard the Messenger of Allah (ﷺ) say: The hand is not to be cut off for taking fruit or the pith of the palm-tree.  \n</p>\n\n\n<p>\n\nThe man then said: Marwan has seized my slave and wants to cut off his hand. I wish you to go with me to him and tell him that which you have heard from the Messenger of Allah (ﷺ). So Rafi' ibn Khadij went with him and came to Marwan ibn al-Hakam.  \n</p>\n\n\n<p>\n\nRafi' said to him: I heard the Messenger of Allah (ﷺ) say: The hand is not to be cut off for taking fruit or the pith of the palm-tree. So Marwan gave orders to release the slave and then he was released.\n</p>\n\n<p>\nAbu Dawud said: Kathar means pith of the palm-tree.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 943910,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843770,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1615.00",
        "babName": "FOR HOW MUCH PROPERTY A THIEF’S HAND SHOULD BE CUT OFF?",
        "hadithNumber": 4377,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Amr ibn al-'As:\n</p>\n\n\n\n<p>\n\nThe Messenger of Allah  (ﷺ) was asked about fruit which was bung up and said: If a needy person takes some with his mouth and does not take a supply away in his garment, there is nothing on him, but he who carries any of it is to be fined twice the value and punished, and he who steals any of it after it has been put in the place where dates are dried to have his hand cut off if their value reaches the value of a shield. If he steals a thing less in value than it, he is to be find twice the value and punished.\n</p>\n\n<p>\nAbu Dawud said: Jarin means the place where dates are dried.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 943930,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843780,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1616.00",
        "babName": "THE HAND IS NOT TO BE CUT OFF FOR SNATCHING AND TREACHERY",
        "hadithNumber": 4378,
        "hadithText": "<p>\n\nNarrated Jabir ibn Abdullah:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: Cutting of hand is not to be inflicted on one who plunders, but he who plunders conspicuously does not belong to us.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 943940,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843800,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1617.00",
        "babName": "ON A MAN WHO STEALS FROM A FORTIFIED PLACE",
        "hadithNumber": 4380,
        "hadithText": "<p>\n\nNarrated Safwan bin Umayyah:\n</p>\n\n<p>\nI was sleeping in the mosque on a cloak mine whose price was thirty dirhams. A man came and pinched it away from me. The man was seized and brought to the Messenger of Allah (ﷺ). He ordered that his hand should be cut off. I came to him and said: Do you cut off only for thirty dirhams ? I sell it to him and make the payment of its price a loan ? He said: Why did you not do so before bringing him to me ?\n</p>\n\n<p>\n\nAbu Dawud said: Za'idah has also transmitted it from Simak from Ju'ayd ibn Hujayr. He said: Safwan slept. Mujahid and Tawus said: While he was sleeping a thief came and stole the cloak from beneath his head. The version of AbuSalamah ibn AbdurRahman has: He snatched it away from beneath his head and he awoke. He cried and he (the thief) was seized. Az-Zuhri narrated from Safwan ibn Abdullah. His version has: He slept in the mosque and used his cloak as pillow. A thief came and took his cloak. The thief was seized and brought to the Prophet (ﷺ).\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 943970,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843820,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1618.00",
        "babName": "CUTTING OF THE HAND IN CASE ONE DENIES THE LOAN",
        "hadithNumber": 4382,
        "hadithText": "<p>\n\nNarrated Aisha, Ummul Mu'minin:\n</p>\n\n\n\n<p>\n\nA woman borrowed jewellery through some known persons and she herself was unknown. She then sold them. She was seized and brought to the Prophet (ﷺ). He gave orders that her hand should be cut off. It is this woman about whom Usamah interceded and of her the Messenger of Allah (ﷺ) said whatever he said.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 943990,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843840,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1619.00",
        "babName": "ON A LUNATIC WHO COMMITS THEFT OR A CRIME TO WHICH THE PRESCRIBED PUNISMENT APPLIES.",
        "hadithNumber": 4384,
        "hadithText": "<p>\n\nNarrated Aisha, Ummul Mu'minin:\n</p>\n\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) said: There are three (persons) whose actions are not recorded: a sleeper till he awakes, an idiot till he is restored to reason, and a boy till he reaches puberty.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 944010,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843850,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1619.00",
        "babName": "ON A LUNATIC WHO COMMITS THEFT OR A CRIME TO WHICH THE PRESCRIBED PUNISMENT APPLIES.",
        "hadithNumber": 4385,
        "hadithText": "<p>\n\nNarrated Ali ibn AbuTalib:\n</p>\n\n\n\n<p>\n\nIbn Abbas said: A lunatic woman who had committed adultery was brought to Umar. He consulted the people and ordered that she should be stoned. \n</p>\n\n\n<p>\n\nAli ibn AbuTalib passed by and said: What is the matter with this (woman)? They said: This is a lunatic woman belonging to a certain family. She has committed adultery. Umar has given orders that she should be stoned.  \n</p>\n\n\n<p>\n\nHe said: Take her back. He then came to him and said: Commander of the Faithful, do you not know that there are three people whose actions are not recorded: a lunatic till he is restored to reason, a sleeper till he awakes, and a boy till he reaches puberty?  \n</p>\n\n\n<p>\n\nHe said: Yes.  He then asked: Why is it that this woman is being stoned?  \n</p>\n\n\n<p>\n\nHe said: There is nothing.  He then said: Let her go.  He (Umar) let her go and began to utter: Allah is most great.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 944020,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843870,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1619.00",
        "babName": "ON A LUNATIC WHO COMMITS THEFT OR A CRIME TO WHICH THE PRESCRIBED PUNISMENT APPLIES.",
        "hadithNumber": 4387,
        "hadithText": "<p>\n\nNarrated Ali ibn AbuTalib:\n</p>\n\n\n\n<p>\n\nIbn Abbas said: A lunatic woman passed by Ali ibn AbuTalib. He then mentioned the rest of the tradition to the same effect as Uthman mentioned. This version has: Do you not remember that the Messenger of Allah (ﷺ) has said: There are three whose actions are not recorded: a lunatic whose mind is deranged till he is restored to consciousness, a sleeper till he awakes, and a boy till he reaches puberty?\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 944040,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843880,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1619.00",
        "babName": "ON A LUNATIC WHO COMMITS THEFT OR A CRIME TO WHICH THE PRESCRIBED PUNISMENT APPLIES.",
        "hadithNumber": 4388,
        "hadithText": "<p>\n\nNarrated Ali ibn AbuTalib:\n</p>\n\n\n\n<p>\n\nAbuZubyan said: A woman who had committed adultery was brought to Umar. He gave orders that she should be stoned. \n</p>\n\n\n<p>\n\nAli passed by just then. He seized her and let her go. Umar was informed of it.  He said: Ask Ali to come to me.  Ali came to him and said: Commander of the Faithful, you know that the Messenger of Allah (ﷺ) said: There are three (people) whose actions are not recorded: A boy till he reaches puberty, a sleeper till he awakes, a lunatic till he is restored to reason. This is an idiot (mad) woman belonging to the family of so and so. Someone might have done this action with her when she suffered the fit of lunacy.  \n</p>\n\n\n<p>\n\nUmar said: I do not know.  Ali said: I do not know.\n</p></b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 944050,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 843890,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1619.00",
        "babName": "ON A LUNATIC WHO COMMITS THEFT OR A CRIME TO WHICH THE PRESCRIBED PUNISMENT APPLIES.",
        "hadithNumber": 4389,
        "hadithText": "<p>\n\nNarrated Ali ibn AbuTalib:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: There are three (persons) whose actions are not recorded: a sleeper till he awakes, a boy till he reaches puberty, and a lunatic till he comes to reason.\n</p>\n\n<p>\nAbu Dawud said: Ibn Juraij has transmitted it from Al-Qasim b. Yazid on the authority of 'Ali from the Prophet (ﷺ). This version adds: \"and an old man who is feeble-minded.\"\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 944060,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843900,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1620.00",
        "babName": "ON A BOY WHO COMMITS A CRIME TO WHICH THE PRESCRIBED PUNISHMENT APPEALS",
        "hadithNumber": 4390,
        "hadithText": "<p>\n\nNarrated Atiyyah al-Qurazi:\n</p>\n\n\n\n<p>\n\nI was among the captives of Banu Qurayzah. They (the Companions) examined us, and those who had begun to grow hair (pubes) were killed, and those who had not were not killed. I was among those who had not grown hair.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 944070,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843940,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1621.00",
        "babName": "ON A MAN WHO COMMITS THEFT DURING A WARLIKE EXPEDITION - SHOULD HIS HAND BE CUT OFF ?",
        "hadithNumber": 4394,
        "hadithText": "<p>\n\nNarrated Busr ibn Artat:\n</p>\n\n\n\n<p>\n\nJunadah ibn AbuUmayyah said: We were with Busr ibn Artat on the sea (on an expedition). A thief called Misdar who had stolen a bukhti she-camel was brought. He said: I heard the Messenger of Allah (ﷺ) say: Hands are not to be cut off during a warlike expedition. Had it not been so, I would have cut it off.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 944110,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843950,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1622.00",
        "babName": "ON CUTTING THE HAND OF A MAN WHO STEALS THE SHROUD OF A DEAD BODY FROM THE GRAVE",
        "hadithNumber": 4395,
        "hadithText": "<p>\n\nNarrated AbuDharr:\n</p>\n\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) said to me: O AbuDharr: I replied: At your service and at your pleasure, Messenger of Allah! He said: how will you do when death smites people, and a house, meaning a grave, will cost as much as a slave. I said: Allah and His Apostle know best, or he said: What Allah and His Apostle choose for me. He said: Show endurance, or he said: You may show endurance.\n</p>\n\n<p>\nAbu Dawud said: Hammad b. Abi Sulaiman said: The hand of one who rifles a grave should be cut off because he had entered the deceased's house.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 944120,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843960,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1623.00",
        "babName": "ON A THIEF WHO COMMITS THEFT REPEATEDLY",
        "hadithNumber": 4396,
        "hadithText": "<p>\n\nNarrated Jabir ibn Abdullah:\n</p>\n\n\n\n<p>\n\nA thief was brought to the Prophet (ﷺ).  He said: Kill him.  The people said: He has committed theft, Messenger of Allah!  Then he said: Cut off his hand. So his (right) hand was cut off.  He was brought a second time and he said: Kill him.  The people said: He has committed theft, Messenger of Allah!  Then he said: Cut off his foot. \n</p>\n\n\n<p>\n\nSo his (left) foot was cut off. \n</p>\n\n\n<p>\n\nHe was brought a third time and he said: Kill him.  \n</p>\n\n\n<p>\n\nThe people said: He has committed theft, Messenger of Allah!  \n</p>\n\n\n<p>\n\nSo he said: Cut off his hand. (So his (left) hand was cut off.) \n</p>\n\n\n<p>\n\nHe was brought a fourth time and he said: Kill him.  \n</p>\n\n\n<p>\n\nThe people said: He has committed theft, Messenger of Allah!  \n</p>\n\n\n<p>\n\nSo he said: Cut off his foot. So his (right) foot was cut off. \n</p>\n\n\n<p>\n\nHe was brought a fifth time and he said: Kill him. \n</p>\n\n\n<p>\n\nSo we took him away and killed him. We then dragged him and cast him into a well and threw stones over him.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 944130,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843970,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1624.00",
        "babName": "HANGING THE HAND OF A THIEF ON HIS NECK",
        "hadithNumber": 4397,
        "hadithText": "<p>\n'Abd al-Rahman b. Muhariz said:\n</p>\n<p>\nWe asked Fadalah b. 'Ubaid about the hanging the (amputated) hand on the neck of a thief whether it was a sunnan. He said: A thief was brought to the Messenger of Allah (ﷺ) and his hand was cut off. Thereafter he commanded for it, and it was hung on his neck.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 944140,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843980,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1625.00",
        "babName": "SALE OF A SLAVE WHEN HE COMMITS THEFT",
        "hadithNumber": 4398,
        "hadithText": "<p>\n\nNarrated AbuHurayrah:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) as saying:  When a slave steals, sell him, even though it be for half an uqiyah.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 944150,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844030,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1606.00",
        "babName": "STONING OF A FORNICATOR",
        "hadithNumber": 4403,
        "hadithText": "<p>\n\nNarrated Ubadah ibn as-Samit:\n</p>\n\n\n\n<p>\n\nThe tradition mentioned above (No. 4401) has also been transmitted by Ubadah ibn as-Samit through a different chain of narrators.  \n</p>\n\n\n<p>\n\nThis version has: The people said to Sa'd ibn Ubadah: AbuThabit, the prescribed punishments have been revealed: if you find a man with your wife, what will you do?  \n</p>\n\n\n<p>\n\nHe said: I shall strike them with a sword so much that they become silent (i.e. die). Should I go and gather four witnesses? Until that (time) the need would be fulfilled.  \n</p>\n\n\n<p>\n\nSo they went away and gathered with the Messenger of Allah (ﷺ) and said: Messenger of Allah! did you not see AbuThabit. He said so-and-so.  \n</p>\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) said: The sword is a sufficient witness. He then said: No, no, a furious and a jealous man may follow this course.\n</p>\n\n<p>\nAbu Dawud said: This tradition has been transmitted by Waki' from al-Fadl b. Dilham from al-Hasan, from Qabisah b. Huraith, from Salamah b. al-Muhabbaq, from the Prophet (ﷺ). And this is the chain of the tradition narrated by Ibn al-Muhabbaq to the effect that a man had sexual intercourse with a slave girl of his wife.\n</p>\n<p>\nAbu Dawud said: Al-Fadl b. Dilham was not the memoriser of traditions. He was a butcher in Wasit.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 944200,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844050,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1627.00",
        "babName": "STONING OF MA’IZ B. MALIK",
        "hadithNumber": 4405,
        "hadithText": "<p>\n\nNarrated Nu'aym ibn Huzzal:\n</p>\n\n\n\n<p>\n\nYazid ibn Nu'aym ibn Huzzal, on his father's authority said: Ma'iz ibn Malik was an orphan under the protection of my father. He had illegal sexual intercourse with a slave-girl belonging to a clan. My father said to him: Go to the Messenger of Allah (ﷺ) and inform him of what you have done, for he may perhaps ask Allah for your forgiveness. His purpose in that was simply a hope that it might be a way of escape for him.  \n</p>\n\n\n<p>\n\nSo he went to him and said: Messenger of Allah! I have committed fornication, so inflict on me the punishment ordained by Allah. He (the Prophet) turned away from him, so he came back and said: Messenger of Allah! I have committed fornication, so inflict on me the punishment ordained by Allah. He (again) turned away from him, so he came back and said: Messenger of Allah! I have committed fornication, so inflict on me the punishment ordained by Allah.  \n</p>\n\n\n<p>\n\nWhen he uttered it four times, the Messenger of Allah (ﷺ) said: You have said it four times. With whom did you commit it?  \n</p>\n\n\n<p>\n\nHe replied: With so and so.  He asked: Did you lie down with her?  He replied: Yes.  He asked: Had your skin been in contact with hers?  He replied. Yes.  He asked: Did you have intercourse with her?  He said: Yes. So he (the Prophet) gave orders that he should be stoned to death. He was then taken out to the Harrah, and while he was being stoned he felt the effect of the stones and could not bear it and fled. But Abdullah ibn Unays encountered him when those who had been stoning him could not catch up with him. He threw the bone of a camel's foreleg at him, which hit him and killed him. They then went to the Prophet (ﷺ) and reported it to him.  \n</p>\n\n\n<p>\n\nHe said: Why did you not leave him alone. Perhaps he might have repented and been forgiven by Allah.\n</p></b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 944220,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 844060,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1627.00",
        "babName": "STONING OF MA’IZ B. MALIK",
        "hadithNumber": 4406,
        "hadithText": "<p>\n\nNarrated Jabir ibn Abdullah:\n</p>\n\n\n\n<p>\n\nMuhammad ibn Ishaq said: I mentioned the story of Ma'iz ibn Malik to Asim ibn Umar ibn Qatadah.  He said to me: Hasan ibn Muhammad ibn Ali ibn AbuTalib said to me: Some men of the tribe of Aslam whom I do not blame and whom you like have transmitted to me the saying of the Messenger of Allah (ﷺ): Why did you not leave him alone? \n</p>\n\n\n<p>\n\nHe said: But I did not understand this tradition. So I went to Jabir ibn Abdullah and said (to him): Some men of the tribe of Aslam narrate that the Messenger of Allah (ﷺ) said when they mentioned to him the anxiety of Ma'iz when the stones hurt him: \"Why did you not leave him alone?' But I do not know this tradition.  \n</p>\n\n\n<p>\n\nHe said: My cousin, I know this tradition more than the people. I was one of those who had stoned the man.  When we came out with him, stoned him and he felt the effect of the stones, he cried: O people! return me to the Messenger of Allah (ﷺ). My people killed me and deceived me; they told me that the Messenger of Allah (ﷺ) would not kill me. We did not keep away from him till we killed him. When we returned to the Messenger of Allah (ﷺ) we informed him of it.  \n</p>\n\n\n<p>\n\nHe said: Why did you not leave him alone and bring him to me? and he said this so that the Messenger of Allah (ﷺ) might ascertain it from him. But he did not say this to abandon the prescribed punishment. He said: I then understood the intent of the tradition.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 944230,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844070,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1627.00",
        "babName": "STONING OF MA’IZ B. MALIK",
        "hadithNumber": 4407,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nMa'iz ibn Malik came to the Prophet (ﷺ) and said that he had committed fornication and he (the Prophet) turned away from him. He repeated it many times, but he (the Prophet) turned away from him. He asked his people: Is he mad? They replied: There is no defect in him. He asked: Have you done it with her? He replied: Yes. so he ordered that he should be stoned to death. He was taken out and stoned to death, and he (the Prophet) did not pray over him.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih in chain",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 944240,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844120,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1627.00",
        "babName": "STONING OF MA’IZ B. MALIK",
        "hadithNumber": 4412,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nMa'iz ibn Malik came to the Prophet (ﷺ) and admitted fornication twice. But he drove him away. He then came and admitted fornication twice. But he drove him away. He then came and admitted fornication twice. He (the Prophet) said: You have testified to yourself four times. Take him away and stone him to death.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 944290,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844130,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1627.00",
        "babName": "STONING OF MA’IZ B. MALIK",
        "hadithNumber": 4413,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said to Ma'iz ibn Malik: Perhaps you kissed, or squeezed, or looked. He said: No. He then said: Did you have intercourse with her? He said: Yes. On the (reply) he (the Prophet) gave order that he should be stoned to death. The narrator did not mention \"on the authority of Ibn 'Abbas\". This is Wahb's version.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 944300,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844140,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1627.00",
        "babName": "STONING OF MA’IZ B. MALIK",
        "hadithNumber": 4414,
        "hadithText": "<p>\n\nNarrated AbuHurayrah:\n</p>\n\n\n\n<p>\n\nA man of the tribe of Aslam came to the Prophet (ﷺ) and testified four times against himself that he had had illicit intercourse with a woman, while all the time the Prophet (ﷺ) was turning away from him.  \n</p>\n\n\n<p>\n\nThen when he confessed a fifth time, he turned round and asked: Did you have intercourse with her? He replied: Yes.  He asked: Have you done it so that your sexual organ penetrated hers? He replied: Yes.  He asked: Have you done it like a collyrium stick when enclosed in its case and a rope in a well? He replied: Yes. He asked: Do you know what fornication is?  He replied: Yes. I have done with her unlawfully what a man may lawfully do with his wife.  \n</p>\n\n\n<p>\n\nHe then asked: What do you want from what you have said?  He said: I want you to purify me. So he gave orders regarding him and he was stoned to death. Then the Prophet (ﷺ) heard one of his companions saying to another: Look at this man whose fault was concealed by Allah but who would not leave the matter alone, so that he was stoned like a dog. He said nothing to them but walked on for a time till he came to the corpse of an ass with its legs in the air.  \n</p>\n\n\n<p>\n\nHe asked: Where are so and so?  They said: Here we are, Messenger of Allah (ﷺ)!  He said: Go down and eat some of this ass's corpse. They replied: Messenger of Allah! Who can eat any of this?  He said: The dishonour you have just shown to your brother is more serious than eating some of it. By Him in Whose hand my soul is, he is now among the rivers of Paradise and plunging into them.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 944310,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844200,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1627.00",
        "babName": "STONING OF MA’IZ B. MALIK",
        "hadithNumber": 4420,
        "hadithText": "<p>\n\nNarrated Buraydah ibn al-Hasib:\n</p>\n\n\n\n<p>\n\nWe, the Companions of the Messenger of Allah (ﷺ), used to talk mutually: Would that al-Ghamidiyyah and Ma'iz ibn Malik had withdrawn after their confession; or he said: Had they not withdrawn after their confession, he would not have pursued them (for punishment). He had them stoned after the fourth (confession).\n</p></b>",
        "bookID": "39.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 944370,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844210,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1627.00",
        "babName": "STONING OF MA’IZ B. MALIK",
        "hadithNumber": 4421,
        "hadithText": "<p>\n\nNarrated Al-Lajlaj al-Amiri:\n</p>\n\n\n\n<p>\n\nI was working in the market. A woman passed carrying a child. The people rushed towards her, and I also rushed along with them.  \n</p>\n\n\n<p>\n\nI then went to the Prophet (ﷺ) while he was asking: Who is the father of this (child) who is with you? She remained silent.  \n</p>\n\n\n<p>\n\nA young man by her side said: I am his father, Messenger of Allah!  \n</p>\n\n\n<p>\n\nHe then turned towards her and asked: Who is the father of this child with you?  \n</p>\n\n\n<p>\n\nThe young man said: I am his father, Messenger of Allah! The Messenger of Allah (ﷺ) then looked at some of those who were around him and asked them about him. They said: We only know good (about him).  \n</p>\n\n\n<p>\n\nThe Prophet (ﷺ) said to him: Are you married?  He said: Yes. So he gave orders regarding him and he was stoned to death.  \n</p>\n\n\n<p>\n\nHe (the narrator) said: We took him out, dug a pit for him and put him in it. We then threw stones at him until he died. A man then came asking about the man who was stoned.  \n</p>\n\n\n<p>\n\nWe brought him to the Prophet (ﷺ) and said: This man has come asking about the wicked man.  \n</p>\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) said: He is more agreeable than the fragrance of musk in the eyes of Allah. The man was his father. We then helped him in washing, shrouding and burying him. (The narrator said:) I do not know whether he said or did not say \"in praying over him.\" This is the tradition of Abdah, and it is more accurate.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Hasan in chain",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 944380,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844230,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1627.00",
        "babName": "STONING OF MA’IZ B. MALIK",
        "hadithNumber": 4423,
        "hadithText": "<p>\n\nNarrated Sahl ibn Sa'd:\n</p>\n\n\n\n<p>\n\nA man came to the Prophet (ﷺ) and confessed before him that he had committed fornication with a woman whom he named. The Messenger of Allah (ﷺ) sent for the woman and asked her about it. But she denied that she had committed fornication. So he inflicted the prescribed punishment of flogging on him, and let her go.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 944400,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844240,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1627.00",
        "babName": "STONING OF MA’IZ B. MALIK",
        "hadithNumber": 4424,
        "hadithText": "<p>\n\nNarrated Jabir ibn Abdullah:\n</p>\n\n\n\n<p>\n\nA man committed fornication with a woman. So the Messenger of Allah (ﷺ) ordered regarding him and the prescribed punishment of flogging was inflicted on him. He was then informed that he was married. So he commanded regarding him and he was stoned to death.\n</p>\n<p>\nAbu Dawud said: This tradition has been transmitted by Muhammad b. Bakr al-Barsani from Ibn Juraij as a statement of Jabir, and Abu 'Asim has transmitted it from Ibn Juraid similar to that of Ibn Wahb. He did not mention the Prophet (ﷺ). But he said: A man committed fornication, but did not know that he was married ; so he was flogged. It was then known that he was married, so he was stoned to death.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Da'if in chain",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 944410,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844260,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1628.00",
        "babName": "ON A WOMAN OF THE TRIBE OF JUHAINAH WHOM THE PROPHET (saws) ORDERED TO BE STONED FOR COMITTING FORNI",
        "hadithNumber": 4426,
        "hadithText": "<p>\n\nNarrated Imran ibn Husayn:\n</p>\n\n\n\n<p>\n\nA woman belonging to the tribe of Juhaynah (according to the version of Aban) came to the Prophet (ﷺ) and said that she had committed fornication and that she was pregnant. The Messenger of Allah (ﷺ) called her guardian.  \n</p>\n\n\n<p>\n\nThen the Messenger of Allah (ﷺ) said to him: Be good to her, and when she bears a child, bring her (to me). When she gave birth to the child, he brought her (to him). The Prophet (ﷺ) gave orders regarding her, and her clothes were tied to her. He then commanded regarding her and she was stoned to death. He commanded the people (to pray) and they prayed over her.  \n</p>\n\n\n<p>\n\nThereupon Umar said: Are you praying over her, Messenger of Allah, when she has committed fornication?  \n</p>\n\n\n<p>\n\nHe said: By Him in Whose hand my soul is, she has repented to such an extent that if it were divided among the seventy people of Medina, it would have been enough for them all. And what do you find better than the fact that she gave her life.  \n</p>\n\n\n<p>\n\nAban did not say in his version: Then her clothes were tied to her.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 944430,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844290,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1628.00",
        "babName": "ON A WOMAN OF THE TRIBE OF JUHAINAH WHOM THE PROPHET (saws) ORDERED TO BE STONED FOR COMITTING FORNI",
        "hadithNumber": 4429,
        "hadithText": "<p>\n\nNarrated Zakariya Abi 'Imran:\n</p>\n\n\n\n<p>\nI heard an old man who transmitted from Abu Bakrah on this father's authority that the Prophet (ﷺ) had a woman stoned and a pit was dug up to her breasts.\n</p>\n<p>\nAbu Dawud said: A man made me understand it from  'Uthman (b. Abi Shaibah)\n</p>\n<p>\nAbu Dawud said: Al-Ghassani said: Juhainah, Ghamid and Bariq as the same.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 944460,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844330,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1629.00",
        "babName": "STONING A JEW AND JEWEES FOR COMMITING FORNICATION",
        "hadithNumber": 4433,
        "hadithText": "<p>\n\nNarrated Al-Bara' ibn Azib:\n</p>\n\n\n\n<p>\n\nThe people passed by the Messenger of Allah (ﷺ) with a Jew who was blackened with charcoal and who was being flogged.  \n</p>\n\n\n<p>\n\nHe called them and said: Is this the prescribed punishment for a fornicator?  \n</p>\n\n\n<p>\n\nThey said: Yes.  He then called on a learned man among them and asked him: I adjure you by Allah Who revealed the Torah to Moses, do you find this prescribed punishment for a fornicator in your divine Book?  \n</p>\n\n\n<p>\n\nHe said: By Allah, no. If you had not adjured me about this, I should not have informed you. We find stoning to be prescribed punishment for a fornicator in our Divine Book. But it (fornication) became frequent in our people of rank; so when we seized a person of rank, we left him alone, and when we seized a weak person, we inflicted the prescribed punishment on him. So we said: Come, let us agree on something which may be enforced equally on people of higher and lower rank. So we agreed to blacken the face of a criminal with charcoal, and flog him, and we abandoned stoning.  \n</p>\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) then said: O Allah, I am the first to give life to Thy command which they have killed. So he commanded regarding him (the Jew) and he was stoned to death.  \n</p>\n\n\n<p>\n\nAllah Most High then sent down: \"O Apostle, let not those who race one another into unbelief, make thee grieve...\" up to \"They say: If you are given this, take it, but if not, beware!....\" up to \"And if any do fail to judge by (the light of) what Allah hath revealed, they are (no better than) unbelievers,\" about Jews, up to \"And if any do fail to judge by (the right of) what Allah hath revealed, they are no better than) wrong-doers\" about Jews: and revealed the verses up to \"And if any do fail to judge by (the light of) what Allah hath revealed, they are (no better than) those who rebel.\" About this he said: This whole verse was revealed about the infidels.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 944510,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844340,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1629.00",
        "babName": "STONING A JEW AND JEWEES FOR COMMITING FORNICATION",
        "hadithNumber": 4434,
        "hadithText": "<p>\n\nNarrated Abdullah Ibn Umar:\n</p>\n\n\n\n<p>\n\nA group of Jews came and invited the Messenger of Allah (ﷺ) to Quff. So he visited them in their school.  \n</p>\n\n\n<p>\n\nThey said: AbulQasim, one of our men has committed fornication with a woman; so pronounce judgment upon them.  They placed a cushion for the Messenger of Allah (ﷺ) who sat on it and said: Bring the Torah. It was then brought. He then withdrew the cushion from beneath him and placed the Torah on it saying: I believed in thee and in Him Who revealed thee. \n</p>\n\n\n<p>\n\nHe then said: Bring me one who is learned among you. Then a young man was brought. The transmitter then mentioned the rest of the tradition of stoning similar to the one transmitted by Malik from Nafi'(No. 4431).\n</p></b>",
        "bookID": "39.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 944520,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844350,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1629.00",
        "babName": "STONING A JEW AND JEWEES FOR COMMITING FORNICATION",
        "hadithNumber": 4435,
        "hadithText": "<p>\n\nNarrated AbuHurayrah:\n</p>\n\n\n\n<p>\n\n(This is Ma'mar's version which is more accurate.) A man and a woman of the Jews committed fornication.  \n</p>\n\n\n<p>\n\nSome of them said to the others: Let us go to this Prophet, for he has been sent with an easy law. If he gives a judgment lighter than stoning, we shall accept it, and argue about it with Allah, saying: It is a judgment of one of your prophets. So they came to the Prophet (ﷺ) who was sitting in the mosque among his companions.  \n</p>\n\n\n<p>\n\nThey said: AbulQasim, what do you think about a man and a woman who committed fornication? He did not speak to them a word till he went to their school.  \n</p>\n\n\n<p>\n\nHe stood at the gate and said: I adjure you by Allah Who revealed the Torah to Moses, what (punishment) do you find in the Torah for a person who commits fornication, if he is married?  \n</p>\n\n\n<p>\n\nThey said: He shall be blackened with charcoal, taken round a donkey among the people, and flogged. A young man among them kept silent.  \n</p>\n\n\n<p>\n\nWhen the Prophet (ﷺ) emphatically adjured him, he said: By Allah, since you have adjured us (we inform you that) we find stoning in the Torah (is the punishment for fornication).  \n</p>\n\n\n<p>\n\nThe Prophet (ﷺ) said: So when did you lessen the severity of Allah's command? He said:  \n</p>\n\n\n<p>\n\nA relative of one of our kings had committed fornication, but his stoning was suspended. Then a man of a family of common people committed fornication. He was to have been stoned, but his people intervened and said: Our man shall not be stoned until you bring your man and stone him. So they made a compromise on this punishment between them.  \n</p>\n\n\n<p>\n\nThe Prophet (ﷺ) said: So I decide in accordance with what the Torah says. He then commanded regarding them and they were stoned to death.  \n</p>\n\n\n<p>\n\nAz-Zuhri said: We have been informed that this verse was revealed about them: \"It was We Who revealed the Law (to Moses): therein was guidance and light. By its standard have been judged the Jews, by the Prophet who bowed (as in Islam) to Allah's will.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 944530,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844410,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1630.00",
        "babName": "ON A MAN WHO COMMITS FORNICATION WITH HIS FEMALE RELATIVE WITHIN PROHIBITED DEGREES",
        "hadithNumber": 4441,
        "hadithText": "<p>\n\nNarrated Al-Bara' ibn Azib:\n</p>\n\n\n\n<p>\n\nwhile I was wandering in search of my camels which had strayed, a caravan or some horsemen carrying a standard came forward. The bedouin began to go round me for my position with the Prophet (ﷺ). They came to a domed structure, took out a man from it, and struck his neck. I asked about him. They told me that he had married his father's wife.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 944590,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844420,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1630.00",
        "babName": "ON A MAN WHO COMMITS FORNICATION WITH HIS FEMALE RELATIVE WITHIN PROHIBITED DEGREES",
        "hadithNumber": 4442,
        "hadithText": "<p>\n\nNarrated Al-Bara' ibn Azib:\n</p>\n\n\n\n<p>\n\nI met my uncle who was carrying a standard. I asked him: Where are you going? He said: The Messenger of Allah (ﷺ) has sent me to a man who has married his father's wife. He has ordered me to cut off his head and take his property.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 944600,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844430,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1631.00",
        "babName": "ON A MAN WHO COMMITS FORNICATION WITH HIS WIFE'S SLAVE GIRL",
        "hadithNumber": 4443,
        "hadithText": "<p>\n\nNarrated An-Nu'man ibn Bashir:\n</p>\n\n\n\n<p>\n\nHabib ibn Salim said: A man called AbdurRahman ibn Hunayn had intercourse with his wife's slave-girl. The matter was brought to an-Nu'man ibn Bashir who was the Governor of Kufah. He said: I shall decide between you in accordance with the decision of the Messenger of Allah (ﷺ). If she made her lawful for you, I shall flog you one hundred lashes. If she did not make her lawful for you, I shall stone you to death. So they found that she had made her lawful for him. He, therefore, flogged him one hundred lashes.\n</p>\n<p>\nQatadah said: I wrote to Habib b. Salim; so he wrote this (tradition) to me.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 944610,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844440,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1631.00",
        "babName": "ON A MAN WHO COMMITS FORNICATION WITH HIS WIFE'S SLAVE GIRL",
        "hadithNumber": 4444,
        "hadithText": "<p>\n\nNarrated An-Nu'man ibn Bashir:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: about a man who had (unlawful) intercourse with his wife's slave girl: If she made her lawful for him, he will be flogged one hundred lashes; if she did not make her lawful for him, I shall stone him.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 944620,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844450,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1631.00",
        "babName": "ON A MAN WHO COMMITS FORNICATION WITH HIS WIFE'S SLAVE GIRL",
        "hadithNumber": 4445,
        "hadithText": "<p>\n\nNarrated Salamah ibn al-Muhabbaq:\n</p>\n\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) made a decision about a man who had intercourse with his wife's slave-girl as follows. If he forced her, she is free, and he shall give her mistress a slave-girl similar to her; if she asked him to have intercourse voluntarily, she will belong to him, and he shall give her mistress a slave-girl similar to her.\n</p>\n\n<p>\nAbu Dawud said: This tradition has been transmitted by Yunus b. 'Ubaid, 'Amr b. Dinar, Mansur b. Zadhan and Salam from al-Hasan to the same effect. But yunus and Mansur did not mention Qabisah.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 944630,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844460,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1631.00",
        "babName": "ON A MAN WHO COMMITS FORNICATION WITH HIS WIFE'S SLAVE GIRL",
        "hadithNumber": 4446,
        "hadithText": "<p>\n\nNarrated Salamah ibn al-Muhabbaq:\n</p>\n\n\n\n<p>\n\nA similar tradition (to the No. 4445) has also been transmitted by Salamah ibn al-Muhabbaq from the Prophet (ﷺ). \n</p>\n\n\n<p>\n\nThis version has: If she asked her to have intercourse with her voluntarily, then she and a similar slave-girl would be given to her mistress from his property.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 944640,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844470,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1632.00",
        "babName": "ON A MAN WHO DOES AS LOT'S PEOPLE DID",
        "hadithNumber": 4447,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: If you find anyone doing as Lot's people did, kill the one who does it, and the one to whom it is done.\n</p>\n<p>\nAbu Dawud said: A similar tradition has also been transmitted by Sulaiman b. Bilal from 'Amr b. Abi 'Umar. And 'Abbad b. Mansur transmitted it from 'Ikrimah on the authority of Ibn 'Abbas who transmitted it from the Prophet (ﷺ). It has also been transmitted by Ibn Juraij from Ibrahim from Dawud b. Al-Husain from 'Ikrimah on the authority of Ibn 'Abbas who transmitted it from the Prophet (ﷺ).\n</p></b>",
        "bookID": "39.0",
        "grade1": "Hasan Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 944650,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844480,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1632.00",
        "babName": "ON A MAN WHO DOES AS LOT'S PEOPLE DID",
        "hadithNumber": 4448,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nIf a man who is not married is seized committing sodomy, he will be stoned to death.\n</p>\n\n<p>\nAbu Dawud said: The tradition of 'Asim proved the tradition of 'Amir b. Abi 'Amr as weak.\n</p></b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 113,
        "matchingArabicURN": 944660,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 844490,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1633.00",
        "babName": "ON THE PUNISHMENT OF A MAN WHO HAS SEXUAL INTERCOURSE WITH AN ANIMAL",
        "hadithNumber": 4449,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: If anyone has sexual intercourse with an animal, kill him and kill it along with him. I (Ikrimah) said: I asked him (Ibn Abbas): What offence can be attributed to the animal/ He replied: I think he (the Prophet) disapproved of its flesh being eaten when such a thing had been done to it.\n</p>\n<p>\nAbu Dawud said: This is not a strong tradition.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Hasan Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 114,
        "matchingArabicURN": 944670,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844500,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1633.00",
        "babName": "ON THE PUNISHMENT OF A MAN WHO HAS SEXUAL INTERCOURSE WITH AN ANIMAL",
        "hadithNumber": 4450,
        "hadithText": "<p>\n'Asim reported from Abu Razin on the authority of Ibn 'Abbas saying: There is no prescribed punishment for one who has sexual intercourse with an animal.\n</p>\n<p>\nAbu Dawud said: 'Ata is also so. Al Hakam said: I think he should be flogged, but the number should not reach the one of the prescribed punishment. Al-Hasan said: He is like a fornicator.\n</p>\n<p>\nAbu Dawud said: THe tradition of 'Asim proves the tradition of 'Amr b. Abi 'Amr as weak.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 115,
        "matchingArabicURN": 944680,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844510,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1634.00",
        "babName": "ON A MAN WHO CONFESSES COMMITTING FORNICATION WITH A WOMAN WHO DOES NOT CONFESS",
        "hadithNumber": 4451,
        "hadithText": "<p>\n\nNarrated Sahl ibn Sa'd:\n</p>\n\n\n\n<p>\n\nA man came to the Prophet (ﷺ) and made acknowledgment before him that he had committed fornication with a woman whom he named. The Messenger of Allah (ﷺ) sent someone to the woman and he asked her about it. She denied that she had committed fornication. So he gave him the prescribed punishment of lashes and left her.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 116,
        "matchingArabicURN": 944690,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844520,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1634.00",
        "babName": "ON A MAN WHO CONFESSES COMMITTING FORNICATION WITH A WOMAN WHO DOES NOT CONFESS",
        "hadithNumber": 4452,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nA man of Bakr ibn Layth came to the Prophet (ﷺ) and made confession four times that he had committed fornication with a woman, so he had a hundred lashes administered to him. The man had not been married. He then asked him to produce proof against the woman, and she said: I swear by Allah, Messenger of Allah, that he has lied. Then he was given the punishment of eighty lashes of falsehood.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Munkar",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 117,
        "matchingArabicURN": 944700,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844570,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1637.00",
        "babName": "INFLICTING PRESCRIBED PUNISHMENT ON A PERSON WHO IS SICK",
        "hadithNumber": 4457,
        "hadithText": "<p>\n\nNarrated Abu Umamah b. Sahl Hunaif:\n</p>\n\n\n\n<p>\n\nAbuUmamah ibn Sahl ibn Hunayf said that some companions of the Messenger of Allah (ﷺ) told that one of their men suffered so much from some illness that he pined away until he was skin and bone (i.e. only a skeleton). A slave-girl of someone visited him, and he was cheered by her and had unlawful intercourse with her. When his people came to visit the patient, he told them about it.  \n</p>\n\n\n<p>\n\nHe said: Ask the Messenger of Allah (ﷺ) about the legal verdict for me, for I have had unlawful intercourse with a slave-girl who visited me.  \n</p>\n\n\n<p>\n\nSo they mentioned it to the Messenger of Allah (ﷺ) saying: We have never seen anyone (so weak) from illness as he is. If we bring him to you, his bones will disintegrate. He is only skin and bone. So the Messenger of Allah (ﷺ) commanded them to take one hundred twigs and strike him once.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 122,
        "matchingArabicURN": 944750,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844580,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1637.00",
        "babName": "INFLICTING PRESCRIBED PUNISHMENT ON A PERSON WHO IS SICK",
        "hadithNumber": 4458,
        "hadithText": "<p>\n\nNarrated Ali ibn AbuTalib:\n</p>\n\n\n\n<p>\n\nA slave-girl belonging to the house of the Messenger of Allah (ﷺ) committed fornication. He (the Prophet) said: Rush up, Ali, and inflict the prescribed punishment on her. I then hurried up, and saw that blood was flowing from her, and did not stop. So I came to him and he said: Have you finished inflicting (punishment on her)? I said: I went to her while her blood was flowing. He said: Leave her alone till her bleeding stops; then inflict the prescribed punishment on her. And inflict the prescribed punishment on those whom your right hands possess (i.e. slaves).\n</p>\n\n<p>\nAbu Dawud said: A similar tradition has been transmitted by Abu al-Ahwas from 'Abd al-A'la, and also by Shu'bah from 'Abd al-A'la. This version has: He said: Do not give her beating until she gives birth to a child. But the former (version) is sounder.\n</p></b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 123,
        "matchingArabicURN": 944760,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 844590,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1638.00",
        "babName": "ON A PERSON WHO LAUNCHES A CHARGE OF FORNICATION AGAINST ANOTHER PERSON",
        "hadithNumber": 4459,
        "hadithText": "<p>\n\nNarrated Aisha, Ummul Mu'minin:\n</p>\n\n\n\n<p>\n\nWhen my vindication came down, the Prophet (ﷺ) mounted the pulpit and mentioned that, and recited the Qur'an. Then when he came down from the pulpit he ordered regarding the two men and the woman, and they were given the prescribed punishment.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 124,
        "matchingArabicURN": 944770,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844600,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1638.00",
        "babName": "ON A PERSON WHO LAUNCHES A CHARGE OF FORNICATION AGAINST ANOTHER PERSON",
        "hadithNumber": 4460,
        "hadithText": "<p>\n\nThe tradition mentioned above (No. 4459) has also been transmitted by Muhammad ibn Ishaq through a different chain of narrators. But he did not mention Aisha. \n</p>\n\n\n<p>\n\nThis version has: He (the Prophet) commanded regarding the two men and the woman who spoke obscenity were Hassan ibn Thabit and Mistah ibn Uthathah. An-Nufayl said: It is said that the woman was Hammah daughter of Jahsh.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Hasan li ghairih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 125,
        "matchingArabicURN": 944780,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844610,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1639.00",
        "babName": "PRESCRIBED PUNISHMENT FOR DRINKING WINE",
        "hadithNumber": 4461,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) did not prescribe any punishment for drinking wine. Ibn Abbas said: A man who had drunk wine and become intoxicated was found staggering on the road, so he was taken to the Prophet (ﷺ). When he was opposite al-Abbas's house, he escaped, and going in to al-Abbas, he grasped hold of him. When that was mentioned to the Prophet (ﷺ), he laughed and said: Did he do that? and he gave no command regarding him.\n</p>\n<p>\nAbu Dawud said: This tradition of al-Hasan b. 'Ali has been transmitted only by the people of Medina.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 126,
        "matchingArabicURN": 944790,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844650,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1639.00",
        "babName": "PRESCRIBED PUNISHMENT FOR DRINKING WINE",
        "hadithNumber": 4465,
        "hadithText": "<p>\n\nHudayn ibn al-Mundhir ar-Ruqashi, who was AbuSasan, said: I was present with Uthman ibn Affan when al-Walid ibn Uqbah was brought to him. Humran and another man bore witness against him (for drinking wine). One of them testified that he had seen him drinking wine, and the other testified that he had seen him vomiting it.  \n</p>\n\n\n<p>\n\nUthman said: He could not vomit it, unless he did not drink it. He said to Ali: Inflict the prescribed punishment on him. Ali said to al-Hasan: Inflict the prescribed punishment on him.  \n</p>\n\n\n<p>\n\nAl-Hasan said: He who has enjoyed its pleasure should also bear its burden.  So Ali said to Abdullah ibn Ja'far: Inflict the prescribed punishment on him. He took a whip and struck him with it while Ali was counting.  \n</p>\n\n\n<p>\n\nWhen he reached (struck) forty (lashes), he said: It is sufficient. The Prophet (ﷺ) gave forty lashes. I think he also said: \"And AbuBakr gave forty lashes, and Uthman eighty. This is all sunnah (standard practice). And this is dearer to me.\"\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 130,
        "matchingArabicURN": 944830,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844660,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1639.00",
        "babName": "PRESCRIBED PUNISHMENT FOR DRINKING WINE",
        "hadithNumber": 4466,
        "hadithText": "<p>\n\nNarrated Ali ibn AbuTalib:\n</p>\n\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) and AbuBakr gave forty lashes for drinking wine and Umar made it eighty. And all this is sunnah, the model and standard practice.\n</p>\n<p>\nAbu Dawud said: Al-Asma'i explaning the maxim, \"He who enjoys its cold should bear its heat,\" said: He who enjoys the easy if it should also take the responsibility of the hard of it.\n</p>\n<p>\nAbu Dawud said: Hudain b. al-Mundhir Abu Sasan was the leader of his tribe.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 131,
        "matchingArabicURN": 944840,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844670,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1640.00",
        "babName": "ON A MAN WHO DRINKS WINE REPEATEDLY",
        "hadithNumber": 4467,
        "hadithText": "<p>\n\nNarrated Mu'awiyah ibn AbuSufyan:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: If they (the people) drink wine, flog them, again if they drink it, flog them. Again if they drink it, kill them.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Hasan Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 132,
        "matchingArabicURN": 944850,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844690,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1640.00",
        "babName": "ON A MAN WHO DRINKS WINE REPEATEDLY",
        "hadithNumber": 4469,
        "hadithText": "<p>\n\nNarrated AbuHurayrah:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: If he is intoxicated, flog him; again if he is intoxicated, flog him; again if he is intoxicated, flog him if he does it again a fourth time, kill him. \n</p>\n\n\n<p>\n\nAbu Dawud said: And there is a similar tradition of Umar ibn AbuSalamah, from his father, on the authority of AbuHurayrah, from the Prophet (ﷺ): If he drinks wine, flog him if he does it so again, a fourth time, kill him.\n</p>\n<p>Abu Dawud said: And there is similar tradition of Suhail from Abu Salih on the authority of Abu Hurairah, from the Prophet (ﷺ): It they drink a fourth time, kill them. And there is similar tradition of Ibn Abi Nu'm on the authority of Ibn 'Umar from Prophet (ﷺ). There is also similar tradition of 'Abd Allah b. 'Amr from the Prophet (ﷺ), and from Sharid from the Prophet (ﷺ). And in the tradition of al-Jadli from Mu'awiyah, the Prophet (ﷺ) said: If he does so again third or fourth time, kill him.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Hasan Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 134,
        "matchingArabicURN": 944870,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844700,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1640.00",
        "babName": "ON A MAN WHO DRINKS WINE REPEATEDLY",
        "hadithNumber": 4470,
        "hadithText": "<p>\n\nNarrated Qabisah ibn Dhuwayb:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: If anyone drinks wine, flog him; if he repeats it, flog him, and if he repeats it, flog him. If he does it again a third or a fourth time, kill him. A man who had drunk wine was brought (to him) and he gave him lashes. He was again brought to him, and he flogged him. He was again brought to him and he flogged him. He was again brought to him and he flogged him. The punishment of killing (for drinking) was  repealed, and a concession was allowed.\n</p>\n<p>\nSufyan said: Al-Zuhri transmitted this tradition when Mansur b. al-Mu'tamir amd Mukhawwal b. Rashid were present with him. He said to them: Take this tradition as a present to the people of Iraq.\n</p>\n<p>\nAbu Dawud said: This tradition has been transmitted by al-Sharid b. Suwaid, Sharahbil b. Aws, 'Abd Allah b. 'Amr, 'Abd Allah b. 'Umar, Abu Ghutaif al-Kindi, and Abu Salamah b. 'Abd al-Rahman from Abu Hurairah.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 135,
        "matchingArabicURN": 944880,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844720,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1640.00",
        "babName": "ON A MAN WHO DRINKS WINE REPEATEDLY",
        "hadithNumber": 4472,
        "hadithText": "<p>\n\nNarrated AbdurRahman ibn Azhar:\n</p>\n\n\n\n<p>\n\nI can still picture myself looking at the Messenger of Allah (ﷺ) who was among the camps of the Companions seeking the camp of Khalid ibn al-Walid, when a man who had drunk wine was brought before him. He asked the people: Beat him. Some struck him with sandals, some with sticks and some with fresh branches of the palm-tree (mitakhah). Ibn Wahb said: This (mitakhah) means green palm fronds. Then the apostle of Allah (ﷺ) took some dust from the ground and threw it on his face.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Hasan Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 137,
        "matchingArabicURN": 944900,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844730,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1640.00",
        "babName": "ON A MAN WHO DRINKS WINE REPEATEDLY",
        "hadithNumber": 4473,
        "hadithText": "<p>\n\nNarrated AbdurRahman ibn al-Azhar:\n</p>\n\n\n\n<p>\n\nA man who had drunk wine was brought before the Prophet (ﷺ) when he was in Hunayn. He threw some dust on his face. He then ordered his Companions and they beat him with their sandals and whatever they had in their hands. He then said to them: Leave him,  and they left him. The Messenger of Allah (ﷺ) then died, and AbuBakr gave forty lashes for drinking wine, and then Umar in the beginning of his Caliphate inflicted forty stripes and at the end of his Caliphate he inflicted eighty stripes. Uthman (after him) inflicted both punishments, eighty and forty stripes, and finally Mu'awiyah established eighty stripes.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 138,
        "matchingArabicURN": 944910,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844740,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1640.00",
        "babName": "ON A MAN WHO DRINKS WINE REPEATEDLY",
        "hadithNumber": 4474,
        "hadithText": "<p>\n\nNarrated AbdurRahman ibn Azhar:\n</p>\n\n\n\n<p>\n\nI saw the Messenger of Allah (ﷺ) on the morning of the conquest of Mecca when I was a young boy. He was walking among the people, seeking the camp of Khalid ibn al-Walid. A man who had drunk wine was brought (before him) and he ordered them (to beat him). So they beat him with what they had in their hands. Some struck him with whips, some with sticks and some with sandals. The Messenger of Allah (ﷺ) threw some dust on his face.  \n</p>\n\n\n<p>\n\nWhen a man who had drunk wine was brought before AbuBakr, he asked them (i.e. the people) about the number of beatings which they gave him. They numbered it forty. So AbuBakr gave him forty lashes.  \n</p>\n\n\n<p>\n\nWhen Umar came to power, Khalid ibn al-Walid wrote to him: The people have become addicted to drinking wine and they look down upon the prescribed punishment and its penalty.  \n</p>\n\n\n<p>\n\nHe said: They are with you, ask them. The immigrants who embraced Islam in the beginning were with him. He asked them and they agreed on the fact that (a drunkard) should be given eighty lashes.  \n</p>\n\n\n<p>\n\nAli said: When a man drinks wine, he tells lies. I, therefore, think that he should be prescribed punishment that is prescribed for telling lies..\n</p>\n<p>\nAbu Dawud said: 'Uqail b. Khalid included in the chain of this tradition: \"Abd Allah b. Abd al-Rahman b. al-Azhar from his father\" between al-Zuhri and Ibn al-Azhar.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 139,
        "matchingArabicURN": 944920,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844750,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1641.00",
        "babName": "INFLICTING PRESCRIBED PUNISHMENT IN THE MOSQUE",
        "hadithNumber": 4475,
        "hadithText": "<p>\n\nNarrated Hakim ibn Hizam:\n</p>\n\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) forbade to take retaliation in the mosque, to recite verses in it and to inflict the prescribed punishments in it.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 140,
        "matchingArabicURN": 944930,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844780,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1643.00",
        "babName": "ON STRIKING THE FACE WHILE INFLICTING PRESCRIBED PUNISHMENT",
        "hadithNumber": 4478,
        "hadithText": "<p>\n\nNarrated AbuHurayrah:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: When one of you inflicts a beating, he should avoid striking the face.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 143,
        "matchingArabicURN": 944960,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843370,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1605.00",
        "babName": "PUNISHMENT OF AN APOSTATE",
        "hadithNumber": 4337,
        "hadithText": "‘Ikrimah said: ‘Ali burned some people who retreated from Islam. When Ibn ‘Abbas was informed of it, he said: If it had been I, I would not have burned them, for the Messenger of Allah (ﷺ) said: Do not inflict Allah’s punishment on anyone, but would have had killed them on account of the statement of the Messenger of Allah (ﷺ). The Apostle said: Kill those who change their religion. When ‘Ali was informed about it he said: How truly Ibn ‘Abbas said!</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 943540,
        "last_updated": "2015-04-07 11:05:20"
    },
    {
        "englishURN": 843380,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1605.00",
        "babName": "PUNISHMENT OF AN APOSTATE",
        "hadithNumber": 4338,
        "hadithText": "`Abd Allah (b. Mas`ud) reported the Messenger of Allah (peace be upon him) as saying: The blood of a Muslim man who testifies that there is no god but Allah and that I am the Messenger of Allah should not be lawfully shed but only for one of three reasons: married fornicator, soul for soul, and one who deserts his religion separating himself from the community.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 943550,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843400,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1605.00",
        "babName": "PUNISHMENT OF AN APOSTATE",
        "hadithNumber": 4340,
        "hadithText": "Abu Burdah said on the authority of Abu Musa : I went to the Prophet (ﷺ) while two men who were Ash’ arIs were with me. One of them was on my right and the other on my left side. Bothe of them asked him for employment. The prophet (ﷺ) was silent. He asked : What do you say Abu Musa, or ‘Abd Allah b. Qais (Abu Musa’s name)? I replied: By him who has sent you with truth, they did not inform me of what they had in their hearts, and I did not know that they would ask for an employment. He said  : I have  the scene before my eyes that he had his toothstick below his lip  which receded. He (the prophet) said: We will never or will not put in charge of our work anyone who asks for it. But go, ye, Abu Musa, or ‘Abd Allah b. Qais. He then sent him as a Governor of the Yemen, After him he sent Muadh b. Jabal. When Muadh came to him, he said: come down , and he put a cushion for him.  He saw that a man was chained with him. He asked : What is this? He replied: He was a Jew and he accepted Islam. He then converted to his religion, an evil religion. He said: I will not sit until he is killed according to the decision of Allah and his Apostle (ﷺ). He said: Yes, be seated. He said: I will not sit until he is killed according to the decision of Allah and his Apostle (peace be upon him). He said it three times. He then commanded for it and he was killed. Both of them then discussed the question of prayer and vigilance at night. One of them, probably Muadh, said : So far as I am concerned, I sleep and I keep vigilance: I keep vigilance and I sleep: I hope for the same reward for my sleep as for my vigilance.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 943570,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843420,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1605.00",
        "babName": "PUNISHMENT OF AN APOSTATE",
        "hadithNumber": 4342,
        "hadithText": "Abu Burdah said: A man who turned back from Islam was brought to Abu Musa. He invited him to repent for twenty days or about so. Muadh then came and invited him (to embrace Islam) but he refused. So he was beheaded.</b>",
        "bookID": "39.0",
        "grade1": "Sahih in chain",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 943590,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843430,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1605.00",
        "babName": "PUNISHMENT OF AN APOSTATE",
        "hadithNumber": 4343,
        "hadithText": "The tradition mention above has also been transmitted by Abu Musa through a different chain if narrators. But there is no mention of demand of repentance.</b>",
        "bookID": "39.0",
        "grade1": "Da'if in chain",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 943600,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843470,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1605.00",
        "babName": "PUNISHMENT OF AN APOSTATE",
        "hadithNumber": 4347,
        "hadithText": "Jarir reported the prophet (ﷺ) as saying: When a slave runs away and reverts to polytheism, he may lawfully be killed.</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 943630,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 843510,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1607.00",
        "babName": "FIGHTING AGAINST ALLAH AND PROPHET (SAWS)",
        "hadithNumber": 4351,
        "hadithText": "Anas b. Malik said: Some people of ‘Ukl or ‘Urainah’ came to the Messenger of Allah (ﷺ) and found Madinah unhealthy. So the Messenger of Allah (ﷺ) ordered them to go to the camels (of the sadaqah) and ordered them to drink some of their urine and milk. They went there when they became well, they killed the herdsman of the Messenger of Allah (ﷺ) and drove off the camels. The news about them reached the prophet (ﷺ) early in the morning. So he sent people in pursuit of them, and they were brought when they day had risen high. He ordered and their hands and feet were cut off and nails were drawn into their eyes, and they were thrown out of Harrah. They begged for water but were not supplied water. Abu Qilabah said: They were people who had stolen, killed, apostatized after their faith and fought against Allah and his Apostle (ﷺ).</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 943670,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843520,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1607.00",
        "babName": "FIGHTING AGAINST ALLAH AND PROPHET (SAWS)",
        "hadithNumber": 4352,
        "hadithText": "The tradition mentioned above has also been transmitted by the narrator Ayyub through different chain. This version has : So he (the prophet) order nails to be heated and had them blinded with them, and he had their hands and feet cut off, and did not cauterise them to stop the flow of blood.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 943680,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843530,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1607.00",
        "babName": "FIGHTING AGAINST ALLAH AND PROPHET (SAWS)",
        "hadithNumber": 4353,
        "hadithText": "The tradition mentioned above has also been transmitted by Anas. B. Malik through a different chain of narrators. This version says : The Messenger of Allah (ﷺ) sent some people who were experts in tracking in pursuit of them and they were brought (to him). Allah , the Exalted, then revealed the verse about it : “ The punishment of those who wage war against Allah and his Apostle and strive for mischief through the land.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 943690,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843540,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1607.00",
        "babName": "FIGHTING AGAINST ALLAH AND PROPHET (SAWS)",
        "hadithNumber": 4354,
        "hadithText": "The tradition mentioned above has also been transmitted by Anas. B. Malik through a different chain of narrators. This version has : Anas said : I saw one of them biting the earth with this mouth (teeth) on account of thirst and this they died.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 943700,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843550,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1607.00",
        "babName": "FIGHTING AGAINST ALLAH AND PROPHET (SAWS)",
        "hadithNumber": 4355,
        "hadithText": "A similar tradition has also been transmitted by Anas bin Malik through a different chain of narrators. This version adds: He then forbade disfiguring. This version does not mention the words “ from opposite sides” . This tradition has been narrated by Shu’bah from Qatadah and Salam bin Miskin from Thabit on the authority of Anas. They did not mention the words “from opposite side”. I did not find these words “their hands and feet were cut off from opposite sides”. In any version except in the version of Hammad bin Salamah.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 943710,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843580,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1607.00",
        "babName": "FIGHTING AGAINST ALLAH AND PROPHET (SAWS)",
        "hadithNumber": 4358,
        "hadithText": "Muhammad bin Sirin  said : This happened before the prescribed punishments(hudud) were revealed, meaning the tradition of Anas.</b>",
        "bookID": "39.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 943740,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843600,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1608.00",
        "babName": "INTERCESSION REGARDING PRESCRIBED PUNISHMENTS",
        "hadithNumber": 4360,
        "hadithText": "‘A’ishah said: The Quraish were anxious about the Makhzumi woman who had committed theft, They said : Who will speak to the Messenger of Allah(ﷺ) about her ? Then they said: Who will be bold enough for it but Uasmah bin Zaid,  the prophet’s (ﷺ) friend! So Usamah spoke to him, and the Messenger of Allah(ﷺ) said : Are you interceding regarding one of the punishments prescribed by  Allah ? He then got up and gave an address, saying : What destroyed your predecessors  was just that when a person of rank among them committed a theft, They left him alone , and when a weak one of them committed a theft, they inflicted the prescribed punishment on him . I swear by Allah that if Fatimah daughter of Muhammad should steal, I would have her hand cut off.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 943760,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843610,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1608.00",
        "babName": "INTERCESSION REGARDING PRESCRIBED PUNISHMENTS",
        "hadithNumber": 4361,
        "hadithText": "<p>\n’A’ishah said: A Makhzumi woman used to borrow goods and deny having received them, so the prophet (ﷺ) gave orders that her hand should be cut off. The narrator than transmitted the rest of the tradition like that of al-laith, saying : So the prophet (ﷺ) had her hand cut off.\n</p>\n<p>\nAbu dawud said: Ibn Wahb transmitted this tradition from Yunus on the authority of al-Zuhri, and in this version he said al-Laith has said: A woman committed theft during the lifetime of the Prophet (ﷺ) on the occasion of the Conquest (of Mecca). It has been transmitted by al-Laith from Yunus on the authority of Ibn Shihab through his chain of narrators. He said in this version: A woman borrowed goods. Mas'ud bin al-Aswad also transmitted a similar tradition from the Prophet (ﷺ) and said: A velvet was stolen from the house of the Messenger of Allah (ﷺ).\n</p>\n<p>\nAbu Dawud said: Abu al-Zubair reported on the authority of Jabir: A woman committed theft and took refuge with Zainab daughter of Prophet (ﷺ).\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 943770,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843650,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1610.00",
        "babName": "CONCEALING CRIME OF CRIMINALS TO WHOM PRESCRIBE PUNISHMENT APPLIES",
        "hadithNumber": 4365,
        "hadithText": "Ibn al-Muakadir said: Huzzal had ordered Ma’iz to go to the prophet (ﷺ) and tell him(about his having committed adultery).</b>",
        "bookID": "39.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 943810,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843680,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1613.00",
        "babName": "ACKNOWLEDGEMENT OF A CRIMINAL WHO DOES NOT NAME HIS CRIME DEFINITELY",
        "hadithNumber": 4368,
        "hadithText": "Abu ‘Umamah said :A man came to the prophet (ﷺ) and said : Messenger of Allah ! I have committed a crime which involves prescribed punishment so inflict it on me . He said : Have you not performed ablution when you came? He said : Yes, He said: Have you not prayed with us when we prayed ? He said : Yes .He then said : Go off, for Allah, the Exalted, forgave you.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 943840,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843700,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1615.00",
        "babName": "FOR HOW MUCH PROPERTY A THIEF’S HAND SHOULD BE CUT OFF?",
        "hadithNumber": 4370,
        "hadithText": "‘A’ishah said: The prophet (ﷺ) used to cut off a thief’s hand for a quarter of a dinar and upwards.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 943860,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843710,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1615.00",
        "babName": "FOR HOW MUCH PROPERTY A THIEF’S HAND SHOULD BE CUT OFF?",
        "hadithNumber": 4371,
        "hadithText": "<p>\n‘A’ishah reported the prophet (ﷺ) as saying : A thief’s hand should be cut off for a quarter of a dinar and upwards.\n</p>\n<p>\nAhmed b. Salih said: The amputation (of a thief’s hand) is for a quarter of a dinar and upwards.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 943870,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843720,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1615.00",
        "babName": "FOR HOW MUCH PROPERTY A THIEF’S HAND SHOULD BE CUT OFF?",
        "hadithNumber": 4372,
        "hadithText": "Ibn ‘Umar’ said: The Messenger of Allah (ﷺ) had thief’s hand cut off for a shield worth three dirhams.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 943880,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843760,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1615.00",
        "babName": "FOR HOW MUCH PROPERTY A THIEF’S HAND SHOULD BE CUT OFF?",
        "hadithNumber": 4376,
        "hadithText": "This tradition has also been transmitted by  Muhammad bin Yahya bin Hibban through a different chain of narrators. This version adds : Marwan gave him some lashes and let him go.</b>",
        "bookID": "39.0",
        "grade1": "Shadh",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 943920,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843790,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1616.00",
        "babName": "THE HAND IS NOT TO BE CUT OFF FOR SNATCHING AND TREACHERY",
        "hadithNumber": 4379,
        "hadithText": "<p>\nThe tradition mentioned above has also been transmitted by Jabir through a different chain of narrators. This version adds : Cutting of the hand is not be inflicted on one who snatches something.\n</p>\n<p>\nAbu Dawud  said : Ibn Juraij did not hear these two traditions from Abu al-Zubair, I have been informed by Ahmad. B. Hanbal  saving : Ibn Juraij heard them from Yasin al-Zayyat.\n</p>\n<p>\nAby Dawud said: Al-Mughirah b. Muslim has transmitted it from Abu al-Zubair from Jabir From the prophet(ﷺ).\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 943960,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843810,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1618.00",
        "babName": "CUTTING OF THE HAND IN CASE ONE DENIES THE LOAN",
        "hadithNumber": 4381,
        "hadithText": "<p>\nIbn ‘Umar said: A Makhzuml  woman used to borrow goods and deny having received them, so the prophet (ﷺ) gave orders and her hand was cut off.\n</p>\n<p>\nAbu Dawud said: Juwairiyyah has transmitted it from Nafi from Ibn ‘Umar or from Safiyyah daughter of Abu ‘Ubaid. This version adds: The prophet (ﷺ) got up and gave an address saying : Is there any woman who repents to Allah, the Exalted, and to his Apostle? He said it three times, That( woman) was present there but she did not get up and speak. Ibn Ghunj transmitted it from Nafi from Safiyyah daughter of Abu ‘Ubaid. This version has : He witnessed to her.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 943980,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843830,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1618.00",
        "babName": "CUTTING OF THE HAND IN CASE ONE DENIES THE LOAN",
        "hadithNumber": 4383,
        "hadithText": "‘A’ishah said : A Makhzuml woman used to borrow goods and deny having received them. The prophet (ﷺ) gave orders that her hand should be cut off. He (the narrator) then narrated the tradition similar to the one transmitted by Qutaibah from al-Laith from Ibn Shahib. This version adds: The prophet(ﷺ) had her hand cut off.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 944000,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843860,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1619.00",
        "babName": "ON A LUNATIC WHO COMMITS THEFT OR A CRIME TO WHICH THE PRESCRIBED PUNISMENT APPLIES.",
        "hadithNumber": 4386,
        "hadithText": "A similar tradition has also been transmitted by al-A’mash through a different chain of narrators. He also said : “... . Till he reaches puberty , and a lunatic till he is restored to consciousness.”   ‘Umar then began to utter: Allah is most great.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 944030,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843910,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1620.00",
        "babName": "ON A BOY WHO COMMITS A CRIME TO WHICH THE PRESCRIBED PUNISHMENT APPEALS",
        "hadithNumber": 4391,
        "hadithText": "The tradition mentioned above has also been transmitted by ‘Abd al- Malik b. ‘Umar through a different chain of narrators. This version has: They uncovered my private parts, and when they found that the hair had not begun to grow they put me among the captives.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 944080,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843920,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1620.00",
        "babName": "ON A BOY WHO COMMITS A CRIME TO WHICH THE PRESCRIBED PUNISHMENT APPEALS",
        "hadithNumber": 4392,
        "hadithText": "Ibn ‘Umar said: He was presented before the prophet (ﷺ) on the day of Uhd when he was fourteen years old, but he did not allow him (to participate in the battle). He was again presented before him on the day of Khandaq when he was fifteen years old, Then he allowed him.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 944090,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843930,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1620.00",
        "babName": "ON A BOY WHO COMMITS A CRIME TO WHICH THE PRESCRIBED PUNISHMENT APPEALS",
        "hadithNumber": 4393,
        "hadithText": "Nafi ‘said: When I mentioned this tradition to ‘Umar.b.’Abd al-Aziz he said : This prescribed punishment is between the minor and the major.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 944100,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843990,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1626.00",
        "babName": "STONING OF A FORNICATOR",
        "hadithNumber": 4399,
        "hadithText": "Ibn ‘Abbas said: The Qur’anic verse goes: “If any of your woman are guilty of lewdness, take the evidence of four (reliable) witnesses from amongst you against them, and if they testify, Confine them to houses until death do chain them or Allah ordains for them some (other) way. Allah then mentioned man after woman and combined them in another verse :  “If two men among you are guilty of lewdness, punish them both. If they repent and amend, leave them alone. This command was abrogated by the verse relating to flogging : “The woman and the man guilty of adultery or fornication – flog  each of them with one hundred stripes.</b>",
        "bookID": "39.0",
        "grade1": "Hasan in chain",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 944160,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844000,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1626.00",
        "babName": "STONING OF A FORNICATOR",
        "hadithNumber": 4400,
        "hadithText": "<p>\nMujahid said: “Apponting a way in the verse (iv.15) means prescribed punishment.\n\n</p>\n<p>\nSufiyan said: “Punish them “refers to unmarried, and “confine them to houses” refers to the women who are married.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Hasan Maqtu'",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 944170,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844010,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1626.00",
        "babName": "STONING OF A FORNICATOR",
        "hadithNumber": 4401,
        "hadithText": "‘Ubadah b. al-Samit reported the Messenger of Allah(ﷺ) as sayings: Receive my teachings, receive my teachings. Allah has appointed a way for those women. If the parties have been married, they shall receive a hundred lashes and stoned to death. If the parties are unmarried, they shall receive a hundred lashes and banished for a year.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 944180,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844020,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1626.00",
        "babName": "STONING OF A FORNICATOR",
        "hadithNumber": 4402,
        "hadithText": "A similar tradition has been transmitted by al-Hasan through a chain of Yahya and to the same effect. This version adds: They shall receive a hundred lashes and toned to death.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 944190,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844040,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1626.00",
        "babName": "STONING OF A FORNICATOR",
        "hadithNumber": 4404,
        "hadithText": "‘Abd Allah b. ‘Abbas said: ‘Umar b. al-Khattab gave an address saying: Allah sent Muhammad (ﷺ) with truth and sent down the Books of him, and the verse of stoning was included in what He sent down to him. We read it and memorized it. The Messenger of Allah (ﷺ) had people stoned to death and we have done it also since his death. I am afraid the people might say with the passage of time: We do not find the verse of stoning in the Books of Allah, and thus they stray by abandoning a duty which Allah had received. Stoning is a duty laid down (by Allah) for married men and women who commit fornication when proof is established, or if there is pregnancy, or a confession. I swear by Allah, had it not been so that the people might say: ‘Umar made an addition to Allah’s Book, I would have written it (there).</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 944210,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844080,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1627.00",
        "babName": "STONING OF MA’IZ B. MALIK",
        "hadithNumber": 4408,
        "hadithText": "Jabir b. Samurah said: I saw Ma’iz b. Malik when he was brought to the Prophet (ﷺ). He was a small and muscular man. He did not wear the loose outer garment. He made confession about him four times that he committed fornication. The Messenger of Allah (ﷺ) said: Perhaps you kissed her. He said that this most discarded man has committed fornication. He said: So he had him stoned to death and gave an address, saying: Beware, whenever we go out on an expedition in the path of Allah, one of them (I.e. the people) lags behind with a bleating sound like that of a he-goat, and gives modicum of his milk(i.e. sperm) to one of the women. If Allah gives control over any of them, I shall deter him from them (i.e. women) by punishing him severely.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 944250,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844090,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1627.00",
        "babName": "STONING OF MA’IZ B. MALIK",
        "hadithNumber": 4409,
        "hadithText": "Simak said: I heard this tradition from Jabir b. Samurah. But the first version is more perfect. This version has: He repeated twice, Simak said: I narrated to Sa’id b. Jubair. He said: He repeated it four times.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 944260,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844100,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1627.00",
        "babName": "STONING OF MA’IZ B. MALIK",
        "hadithNumber": 4410,
        "hadithText": "Shu’bah said: I asked Simak about the meaning of KUTHBAH. He said: A small quantity of milk.</b>",
        "bookID": "39.0",
        "grade1": "Sahih Maqtu'",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 944270,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844110,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1627.00",
        "babName": "STONING OF MA’IZ B. MALIK",
        "hadithNumber": 4411,
        "hadithText": "Ibn ‘Abbas said: The Messenger of Allah (ﷺ) asked Ma’iz b. Malik : Is what I have heard about you is true? He said: What have you heard about me? He said: I have heard that you have had intercourse with a girl belonging to the family of so and so. He said: Yes. He then testified four times. He (The prophet) then gave order regarding him and he was stoned to death.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 944280,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844150,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1627.00",
        "babName": "STONING OF MA’IZ B. MALIK",
        "hadithNumber": 4415,
        "hadithText": "A similar tradition has also been transmitted by Abu Hurrairah through a different chain of narrators. This version adds: The narrator Hasan b. “All said: The transmitters have differed in the wordings (of this tradition) reported to me. Some said: He (Ma’iz) was tied to a tree, and others said: He was made to stand.</b>",
        "bookID": "39.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 944320,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844160,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1627.00",
        "babName": "STONING OF MA’IZ B. MALIK",
        "hadithNumber": 4416,
        "hadithText": "Jabir b. ‘Abd Allah said: A man of the tribe of Asalam came to the Messenger of Allah (ﷺ) and made confession of fornication. He (the prophet) turned away from him. When he testified against him four times, the Prophet (ﷺ) said: Are you mad? He said: No. he asked: Are you married? He replied: Yes. The Prophet (ﷺ) then commanded regarding him and he was stoned in the place of prayer. Then when the stones hurt him, he fled, but was overtaken and stoned to death. The Prophet (ﷺ) then spoke well of him and did not pray over him.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 944330,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844170,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1627.00",
        "babName": "STONING OF MA’IZ B. MALIK",
        "hadithNumber": 4417,
        "hadithText": "Abu Sa’id said: When the Prophet (May peace e upon him) commanded to stone Ma’iz b. Malik, we took him out to Baql. I swear by Allah, we did not tie him, nor did we dig a pit for him. But he was standing before us. The narrator Abu Kamil said: So we threw at him bones, clods of mud and pieces of earthenware. He ran away and we ran after him till he came to a side of the Harrah. He stood there before us and we threw at him big stones of the Harrah until he died. He (the Prophet) did not ask forgiveness for him, nor did he speak ill of him.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 944340,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844180,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1627.00",
        "babName": "STONING OF MA’IZ B. MALIK",
        "hadithNumber": 4418,
        "hadithText": "Abu Nadrah said: A man came to Prophet (ﷺ). He then mentioned a similar tradition but not completely. This version has: People began to speak ill of him but he (the Prophet) forbade them. Then they began to ask forgiveness from him, but he forbade them by saying. He is a man who had committed a sin. Allah will call him to account himself.</b>",
        "bookID": "39.0",
        "grade1": "Da'if mursal",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 944350,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844190,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1627.00",
        "babName": "STONING OF MA’IZ B. MALIK",
        "hadithNumber": 4419,
        "hadithText": "Buraidah said. : The Prophet (ﷺ) smelt the breath of Ma’iz.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 944360,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844220,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1627.00",
        "babName": "STONING OF MA’IZ B. MALIK",
        "hadithNumber": 4422,
        "hadithText": "A part of tradition has also been transmitted by al-Lajlaj from the Prophet (ﷺ) through a different chain of narrators.</b>",
        "bookID": "39.0",
        "grade1": "Hasan in chain",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 944390,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844250,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1627.00",
        "babName": "STONING OF MA’IZ B. MALIK",
        "hadithNumber": 4425,
        "hadithText": "Jabir said: A man committed fornication with a woman. It was not known that he was married. So he was flogged. It was then known that he was married, so he was stoned to death.</b>",
        "bookID": "39.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 944420,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844270,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1628.00",
        "babName": "ON A WOMAN OF THE TRIBE OF JUHAINAH WHOM THE PROPHET (saws) ORDERED TO BE STONED FOR COMITTING FORNI",
        "hadithNumber": 4427,
        "hadithText": "Al-Auza’i said: The word shukkta means tied, meaning her clothes were tied on her.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 944440,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844280,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1628.00",
        "babName": "ON A WOMAN OF THE TRIBE OF JUHAINAH WHOM THE PROPHET (saws) ORDERED TO BE STONED FOR COMITTING FORNI",
        "hadithNumber": 4428,
        "hadithText": ") Buraidah said: A woman of Ghamid came to the Prophet (ﷺ) and said: I have committed fornication. He said: Go back. She returned, and on the next day she came to him again, and said: Perhaps you want to send me back as you did to Ma’iz b. Malik. I swear by Allah, I am pregnant. He said to her: Go back. She then returned and came to him the next day. He said to her: Go back until you give birth to a child. She then returned. When she gave birth to a child, she brought the child to him, and said: Here it is! I have given birth to it. He said: Go back, and suckle him until you wean him. When she had weaned him, she brought him (the boy) to him with something in his hand which he was eating. The boy was then given to a certain man of the Muslims and he (the Prophet) commanded regarding her. So a pit was dug for her, and he gave orders about her and she was stoned to death. Khalid was one of those who were throwing stones at her. He threw a stone at her. When a drop blood fell on his cheeks, he abused her. The Prophet (ﷺ) said to him: Gently, Khalid. By Him in whose hand my soul is, she has reported to such an extent that if one who wrongfully takes extra tax were to repent to a like extent, he would be forgiven. Then giving command regarding her, prayed over her and she was buried.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 944450,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844300,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1628.00",
        "babName": "ON A WOMAN OF THE TRIBE OF JUHAINAH WHOM THE PROPHET (saws) ORDERED TO BE STONED FOR COMITTING FORNI",
        "hadithNumber": 4430,
        "hadithText": "Abu Hurairah and Zaid b. Khalid al-Juhani said: Two men brought a dispute before the Messenger of Allah (ﷺ). One of them said: Pronounce judgement between us in accordance with Allah’s Book, Messenger of Allah! The other who had more understanding said: Yes, Messenger of Allah! Pronounce judgement between us in accordance with Allah’s Book, and allow me to speak. He (the Prophet) said: Speak, He then said: My son who was a hired servant with this(man) committed fornication with his wife, and when I was told that my son must be stoned to death, I ransomed him with a hundred sheep and a slave girl of mine; but when I asked the learned, they told me that my son should receive a hundred lashes and be banished for a year, and that stoning to death applied only to man’s wife. The apostle of Allah (ﷺ) replied: By him in whose hand my soul is, I shall certainly pronounce judgment between you in accordance with Allah’s Book. Your sheep and your slave girl must be returned to you, and your son shall receive a hundred lashes and be banished for a year. And he commanded Unias al-Aslami go to that man’s wife, and if she confessed, he should stone her to death. She confessed and he stoned her.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 944480,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844310,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1629.00",
        "babName": "STONING A JEW AND JEWEES FOR COMMITING FORNICATION",
        "hadithNumber": 4431,
        "hadithText": "Ibn ‘Umar said: some jews came to the Messenger of Allah (ﷺ) and mentioned to him that a man and a women of their number had committed fornication. The Messenger of Allah (ﷺ) asked them: What do you find in the Torah about stoning? They replied: We disgrace them and they should be flogged. ‘Abd Allah b. Salam said: You lie; it contains (instruction for) stoning. So they brought the Torah and spread it out, and one of them put his hand over the verse of stoning and read what preceded it and what followed it. ‘Abd Allah b. Salam said to him: Lift your hand. When he did so, the verse of stoning was seen to be in it. They then said: He has spoken the truth, Muhammad, the verse of stoning is in it. The Messenger of Allah (ﷺ) then gave command regarding them, and they were stoned to death. ‘Abd Allah b. ‘Umar said: I saw the man leaning on the woman protecting her from the stones.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 944490,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844320,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1629.00",
        "babName": "STONING A JEW AND JEWEES FOR COMMITING FORNICATION",
        "hadithNumber": 4432,
        "hadithText": "Al-Bara’ b. Azib said: The people passed by the Messenger of Allah (ﷺ) with a jew whose face blackened with charcoal and he was being taken around. He adjured them by Allah and asked: What is the prescribed punishment for a fornicator in your Divine book? He (the narrator) said: They referred him to a man of them. The Prophet (ﷺ) adjured him and asked: What is the punishment for a fornication in your Divine Book? He replied: Stoning. But fornication spread among our people of rank, so we disliked that a person of rank should be left alone and the punishment be inflicted on one who is lower in rank than him. So we suspended it for us. The Messenger of Allah (ﷺ) then commanded regarding him and he was stoned to death. He then said: O Allah! I am the first to give life to a command of Thy Book which they had killed.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 944500,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844360,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1629.00",
        "babName": "STONING A JEW AND JEWEES FOR COMMITING FORNICATION",
        "hadithNumber": 4436,
        "hadithText": "Abu Hurairah said: A man and a woman of the Jews who were married committed fornication at the time when the Messenger of Allah (ﷺ) came to Medina. Stoning was a prescribed punishment for them in accordance with the Torah, but they abandoned it and followed tajbiyyah, meaning, the man was beaten a hundred times with a rope painted with tar and was seated on a donkey with his face towards the tail of the donkey. Their rabbis then assembled and sent some people to the Messenger of Allah (ﷺ). They said to them: Ask him about the prescribed punishment for fornication. The transmitter then mentioned the rest of the tradition. They version adds: They were not the followers of his religion, and he (the prophet) was to pronounce judgment between them. So he was given a choice in this verse:”If they do come to thee, either judge between them, or decline to interfere.</b>",
        "bookID": "39.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 944540,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844370,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1629.00",
        "babName": "STONING A JEW AND JEWEES FOR COMMITING FORNICATION",
        "hadithNumber": 4437,
        "hadithText": "Jabir b. ‘Abd Allah said: The Jews brought a man and a woman of them who had committed fornication. He said: Bring me two learned men or yours. So they brought the two sons of Suriya. He adjured them and said: How do you think about the matter if these two persons bear witness to the effect that they have seen his sexual organ in her female organ (penetrated) like a collyrium stick when enclosed in its case, they will be stoned to death. He asked: What is there which prevents you from stoning them: They replied : Our rule has gone, so we disapproved of killing. The Messenger of Allah (ﷺ) then called four witnesses. They brought four witnesses. Who testified that they had seen his sexual organ (penetrated) in her female organ like a collyrium stick when enclosed in its case. The Prophet (ﷺ) then gave orders for stoning them.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 944550,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844380,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1629.00",
        "babName": "STONING A JEW AND JEWEES FOR COMMITING FORNICATION",
        "hadithNumber": 4438,
        "hadithText": "A similar tradition has also been transmitted by Ibrahim and al-Sha’bi from the Prophet (ﷺ) through a different chain of narrators. But this version does not mention the words: He called the witnesses who testified.</b>",
        "bookID": "39.0",
        "grade1": "Sahih li ghairih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 944560,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844390,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1629.00",
        "babName": "STONING A JEW AND JEWEES FOR COMMITING FORNICATION",
        "hadithNumber": 4439,
        "hadithText": "A similar tradition has also been transmitted by al-Sha’bi through a different chain of narrators.</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 944570,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 844400,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1629.00",
        "babName": "STONING A JEW AND JEWEES FOR COMMITING FORNICATION",
        "hadithNumber": 4440,
        "hadithText": "Jabir bin ‘Abd Allah said: The Prophet (ﷺ) had a man and a woman of the Jews who had committed fornication stoned to death.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 944580,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844530,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1635.00",
        "babName": "ON A MAN WHO DOES WITH A WOMAN EVERYTHING EXCEPT SEXUAL INTERCOURES (I.E, KISSING AND EMBRACING) AND",
        "hadithNumber": 4453,
        "hadithText": "‘Abd Allah (b. Mas’ud) said: A man came to the Prophet (ﷺ) and said: I contacted directly a women at the furthest part of the city (i.e., Medina), and I did with her everything except sexual intercourse. So here I am; inflict any punishment you wish. Thereupon ‘Umar said: Allah has concealed your fault; it would have been better if you also had concealed it yourself. The Prophet (ﷺ) sent a men after him. (When he came) he recited the verse: “And establish regular prayers at the two ends of the day and at the approaches of the night. . .” up to the end of the verse. A man from the people got up and asked: Is it particular to him, Messenger of Allah, or for the people in general? He replied: It is all the people.</b>",
        "bookID": "39.0",
        "grade1": "Hasan Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 118,
        "matchingArabicURN": 944710,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844540,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1636.00",
        "babName": "ON A SLAVEGIRL WHO COMMITS FORNICATION, BUT SHE IS NOT MARRIED",
        "hadithNumber": 4454,
        "hadithText": "<p>\nAbu Hurairah and Zaid b. Khalid al-Juhani said: The Messenger of Allah (ﷺ) was asked about a slave-woman who commits fornication, and she is not married: If she commits fornication, flog her: if she commits fornication again flog her; if only for a rope of hair (dafir).\n</p>\n<p>\nIbn Shihab: I do not know whether he (the Prophet) said it is a third or a fourth time.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 119,
        "matchingArabicURN": 944720,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844550,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1636.00",
        "babName": "ON A SLAVEGIRL WHO COMMITS FORNICATION, BUT SHE IS NOT MARRIED",
        "hadithNumber": 4455,
        "hadithText": "Abu Hurairah reported the Prophet (ﷺ) as saying: When the slave-woman of any of you commits fornication, he should inflict the prescribed punishment on her, but not hurl reproaches at her. This is to be done up to three times. If she a fourth time, he should flog her, and sell her even if only for a rope of hair.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 120,
        "matchingArabicURN": 944730,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844560,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1636.00",
        "babName": "ON A SLAVEGIRL WHO COMMITS FORNICATION, BUT SHE IS NOT MARRIED",
        "hadithNumber": 4456,
        "hadithText": "This tradition has been transmitted by Abu Hurairah from the Prophet (ﷺ). This version has: He said each time: He should give her the appropriate beating according to Allah’s Book, but not Hurl reproaches at her. He said a fourth time: If she does it again, he should give her the appropriate beating according to Allah’s Book, and then should sell her even if only for a rope of hair.</b>",
        "bookID": "39.0",
        "grade1": "Sahih li ghairih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 121,
        "matchingArabicURN": 944740,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844620,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1639.00",
        "babName": "PRESCRIBED PUNISHMENT FOR DRINKING WINE",
        "hadithNumber": 4462,
        "hadithText": "Abu Hurairah said: When a man who had drunk wine was brought to the Messenger of Allah (ﷺ), he said: Beat him. Abu Hurairah said: Some struck him with their hands, some with their garment. When he turned his face, some people said: Allah put you shame! The Messenger of Allah (ﷺ) said: Do not say like that and help the devil to get power over him.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 127,
        "matchingArabicURN": 944800,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844630,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1639.00",
        "babName": "PRESCRIBED PUNISHMENT FOR DRINKING WINE",
        "hadithNumber": 4463,
        "hadithText": "The tradition mentioned above has also been transmitted by Ibn al- Had through a different chain of narrators to the same effect. He said after the word “beating”: The Messenger of Allah (ﷺ) then said to his Companions:  Reproach him, and they faced him and said: You have not respected Allah, you have not feared Allah and you have not shown shame before the Messenger of Allah (ﷺ). Then they released him. Some have also added similar words.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 128,
        "matchingArabicURN": 944810,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844640,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1639.00",
        "babName": "PRESCRIBED PUNISHMENT FOR DRINKING WINE",
        "hadithNumber": 4464,
        "hadithText": "<p>\nAnas b. Malik said: The Prophet (ﷺ) gave a beating with palm-branches and sandals for drinking wine and Abu Bakr gave lashes. When ‘Umar came to power, he called upon people and said to them: The people are living now near watering placing, and, according to Musaddad’s version, “near villages and watering places, so what do you say about the punishment for (drinking) wine? ‘Abd al-Rahman b. ‘Awf said: We think that you should prescribe the lightest punishment. So he fixed eight lashes for it.\n</p>\n<p>\nAbu Dawud said: It has also been transmitted by Ibn Al 'Arubah from Qatadah from the Prophet (ﷺ) to the effect that he gave a beating forty times with palm branches and sandals. And Shu'bah narrated it from Qatadah on the authority of Anas from Prophet (ﷺ). This version has: He gave a beating with two palm-branches about forty times.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 129,
        "matchingArabicURN": 944820,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844680,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1640.00",
        "babName": "ON A MAN WHO DRINKS WINE REPEATEDLY",
        "hadithNumber": 4468,
        "hadithText": "<p>\nThe tradition mentioned above has also been transmitted by Ibn ‘Umar through a different chain of narrators to the same effect. This version has : I think he said for the fifth time: If he drinks it, kill him.\n</p>\n<p>\nAbu Dawud said: And similarly the word “a fifth time” occurs in the tradition of Abu Ghutaif.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Da'if in chain",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 133,
        "matchingArabicURN": 944860,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844710,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1640.00",
        "babName": "ON A MAN WHO DRINKS WINE REPEATEDLY",
        "hadithNumber": 4471,
        "hadithText": "’Ali said: I shall not pay blood-money or (he said) : I am not going to pay blood-money for him on whom I inflicted the prescribed punishment except for the one who drank wine, for the Messenger of Allah (ﷺ) did not prescribe anything definite. It is a thing which we have decided (by agreement) ourselves.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 136,
        "matchingArabicURN": 944890,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844760,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1642.00",
        "babName": "FLOGGING",
        "hadithNumber": 4476,
        "hadithText": "Abu Burdah reported the Messenger of Allah (ﷺ) as saying: No more than ten lashes are to be given, except in the case of one of the punishment prescribed by Allah, the Exalted.</b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 141,
        "matchingArabicURN": 944940,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844770,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1642.00",
        "babName": "FLOGGING",
        "hadithNumber": 4477,
        "hadithText": "The tradition mentioned above has also been transmitted by Abu Burdah al-Ansari through a different chain of narrators. This version has: I heard the Messenger of Allah (ﷺ) say. . . He then mentioned the tradition to the same effect.</b>",
        "bookID": "39.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 142,
        "matchingArabicURN": 944950,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 844291,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1628.00",
        "babName": "ON A WOMAN OF THE TRIBE OF JUHAINAH WHOM THE PROPHET (saws) ORDERED TO BE STONED FOR COMITTING FORNI",
        "hadithNumber": 4429,
        "hadithText": "<p>\nAbu Dawud said: A similar tradition has been transmitted by Zakariya b. Salim through a different chain of narrators. This version adds: He (the Prophet) then threw a pebble like a gram at her. He then said: Throw at her and avoid her face. When se died, he took her out and prayed over her. About repentance he said similar to the tradition on Buraidah.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Da'if in chain",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 944470,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 843781,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 39,
        "bookName": "Prescribed Punishments (Kitab Al-Hudud)",
        "babNumber": "1616.00",
        "babName": "THE HAND IS NOT TO BE CUT OFF FOR SNATCHING AND TREACHERY",
        "hadithNumber": 4378,
        "hadithText": "<p>\n\nNarrated Jabir ibn Abdullah:\n</p>\n\n<p>\nHe also said through this chain: The Messenger of Allah (ﷺ) said: Cutting of the hand is not to be inflicted on one who is treacherous.\n</p></b>",
        "bookID": "39.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 943950,
        "last_updated": "2012-10-22 00:29:59"
    }
]