[
    {
        "englishURN": 844790,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1644.00",
        "babName": "A Life For A Life",
        "hadithNumber": 4479,
        "hadithText": "<p>\n\nNarrated Abdullah Ibn Abbas:\n</p>\n\n\n\n<p>\n\nQurayzah and Nadir (were two Jewish tribes). An-Nadir were nobler than Qurayzah. When a man of Qurayzah killed a man of an-Nadir, he would be killed. But if a man of an-Nadir killed a man of Qurayzah, a hundred wasq of dates would be paid as blood-money. When Prophethood was bestowed upon the Prophet (ﷺ), a man of an-Nadir killed a man of Qurayzah.  \n</p>\n\n\n<p>\n\nThey said: Give him to us, we shall kill him.  They replied: We have the Prophet (ﷺ) between you and us. So they came to him.  \n</p>\n\n\n<p>\n\nThereupon the following verse was revealed: \"If thou judge, judge in equity between them.\" \"In equity\" means life for a life.  \n</p>\n\n\n<p>\n\nThe following verse was then revealed: \"Do they seek of a judgment of (the days) ignorance?\"\n</p>\n\n<p>\nAbu Dawud said: Quraizah and al-Nadir were the descendants of Harun the Prophet (peace be upon him)\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 944970,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844800,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1645.00",
        "babName": "A Man Is Not To Be Punished For The Wrongs Done By His Father Or Brother",
        "hadithNumber": 4480,
        "hadithText": "<p>\n\nNarrated AbuRimthah:\n</p>\n\n\n\n<p>\n\nI went to the Prophet (ﷺ) with my father. The Messenger of Allah (ﷺ) then asked my father: Is this your son? He replied: Yes, by the Lord of the Ka'bah. He again said: Is it true? He said: I bear witness to it. The Messenger of Allah (ﷺ) then smiled for my resemblance with my father, and for the fact that my father took an oath upon me. He then said: He will not bring evil on you, nor will you bring evil on him. The Messenger of Allah (ﷺ) recited  the verse: \"No bearer of burdens can bear the burden of another.\"\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 944980,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844810,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1646.00",
        "babName": "The Imam Enjoining A Pardon In The Case Of Bloodshed",
        "hadithNumber": 4481,
        "hadithText": "<p>\n\nNarrated AbuShurayh al-Khuza'i:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: If a relative of anyone is killed, or if he suffers khabl, which means a wound, he may choose one of the three things: he may retaliate, or forgive, or receive compensation. But if he wishes a fourth (i.e. something more), hold his hands. After this whoever exceeds the limits shall be in grave penalty.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 944990,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844820,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1646.00",
        "babName": "The Imam Enjoining A Pardon In The Case Of Bloodshed",
        "hadithNumber": 4482,
        "hadithText": "<p>\n\nNarrated Anas ibn Malik:\n</p>\n\n\n\n<p>\n\nI never saw the Messenger of Allah (ﷺ) that some dispute which involved retaliation was brought to him but he commanded regarding it for remission.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 945000,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844830,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1646.00",
        "babName": "The Imam Enjoining A Pardon In The Case Of Bloodshed",
        "hadithNumber": 4483,
        "hadithText": "<p>\n\nNarrated AbuHurayrah:\n</p>\n\n\n\n<p>\n\nA man was killed in the lifetime of the Prophet (ﷺ). The matter was brought to the Prophet (ﷺ). He entrusted him to the legal guardian of the slain. The slayer said: Messenger of Allah, I swear by Allah, I did not intend to kill him. The Messenger of Allah (ﷺ) said to the legal guardian: Now if he is true and you kill him, you will enter Hell-fire. So he let him go. His hands were tied with a strap. He came out pulling his strap. Hence he was called Dhu an-Nis'ah (possessor of strap).\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 945010,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844840,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1646.00",
        "babName": "The Imam Enjoining A Pardon In The Case Of Bloodshed",
        "hadithNumber": 4484,
        "hadithText": "<p>\n\nNarrated Wa'il ibn Hujr:\n</p>\n\n\n\n<p>\n\nI was with the Prophet (ﷺ) when a man who was a murderer and had a strap round his neck was brought to him.  \n</p>\n\n\n<p>\n\nHe then called the legal guardian of the victim and asked him: Do you forgive him?  \n</p>\n\n\n<p>\n\nHe said: No.  He asked: Will you accept the blood-money?  He said: No.  He asked: Will you kill him?  He said: Yes.  He said: Take him. When he turned his back, he said: Do you forgive him?  He said: No.  He said: Will you accept the blood-money?  He said: No.  He said: Will you kill him?  He said: Yes.  He said: Take him. After repeating all this a fourth time, he said: If you forgive him, he will bear the burden of his own sin and the sin of the victim. He then forgave him.  He (the narrator) said: I saw him pulling the strap.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 945020,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844870,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1646.00",
        "babName": "The Imam Enjoining A Pardon In The Case Of Bloodshed",
        "hadithNumber": 4487,
        "hadithText": "<p>\n\nNarrated AbuUmamah ibn Sahl:\n</p>\n\n\n\n<p>\n\nWe were with Uthman when he was besieged in the house. There was an entrance to the house. He who entered it heard the speech of those who were in the Bilat. Uthman then entered it. He came out to us, looking pale.  \n</p>\n\n\n<p>\n\nHe said: They are threatening to kill me now.  We said: Allah will be sufficient for you against them, Commander of the Faithful!  He asked: Why kill me? I heard the Messenger of Allah (ﷺ) say: It is not lawful to kill a man who is a Muslim except for one of the three reasons: Kufr (disbelief) after accepting Islam, fornication after marriage, or wrongfully killing someone, for which he may be killed. \n</p>\n\n\n<p>\n\nI swear by Allah, I have not committed fornication before or after the coming of Islam, nor did I ever want another religion for me instead of my religion since Allah gave guidance to me, nor have I killed anyone. So for what reason do you want to kill me?\n</p>\n\n<p>\nAbu Dawud said: 'Uthman and Abu Bakr (Allah be pleased with them) abandoned drinking wine in pre-Islamic times.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 945050,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844880,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1646.00",
        "babName": "The Imam Enjoining A Pardon In The Case Of Bloodshed",
        "hadithNumber": 4488,
        "hadithText": "<p>\n\nNarrated Ziyad ibn Sa'd ibn Dumayrah as-Sulami:\n</p>\n\n\n\n<p>\n\nOn the authority of his father (Sa'd) and his grandfather (Dumayrah) (according to Musa's version) who were present in the battle of Hunayn with the Messenger of Allah (ﷺ): After the advent of Islam, Muhallam ibn Jaththamah al-Laythi killed a man of Ashja'. \n</p>\n\n\n<p>\n\nThat was the first blood-money decided by the Messenger of Allah (ﷺ) (for payment). Uyaynah spoke about the killing of al-Ashja'i, for he belonged to Ghatafan, and al-Aqra' ibn Habis spoke on behalf of Muhallam, for he belonged to Khunduf. The voices rose high, and the dispute and noise grew.  \n</p>\n\n\n<p>\n\nSo the Messenger of Allah (ﷺ) said: Do you not accept blood-money, Uyaynah?  \n</p>\n\n\n<p>\n\nUyaynah then said: No, I swear by Allah, until I cause his women to suffer the same fighting and grief as he caused my women to suffer. Again the voices rose high, and the dispute and noise grew.  \n</p>\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) said: Do you not accept the blood-money Uyaynah? Uyaynah gave the same reply as before, and a man of Banu Layth called Mukaytil stood up. He had a weapon and a skin shield in his hand.  \n</p>\n\n\n<p>\n\nHe said: I do not find in the beginning of Islam any illustration for what he has done except the one that \"some sheep came on, and those in the front were shot; hence those in the rear ran away\". (The other example is that) \"make a law today and change it.\"  \n</p>\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) said: Fifty (camels) here immediately and fifty when we return to Medina. This happened during some of his journeys. Muhallam was a tall man of dark complexion. He was with the people. They continued (to make effort for him) until he was released. He sat before the Messenger of Allah (ﷺ), with his eyes flowing.  \n</p>\n\n\n<p>\n\nHe said: Messenger of Allah! I have done (the act) of which you have been informed. I repent to Allah, the Exalted, so ask Allah's forgiveness for me. Messenger of Allah!  \n</p>\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) then said: Did you kill him with your weapon at the beginning of Islam. O Allah! do not forgive Muhallam. He said these words loudly.  \n</p>\n\n\n<p>\n\nAbuSalamah added: He (Muhallam) then got up while he was wiping his tears with the end of his garment.  \n</p>\n\n\n<p>\n\nIbn Ishaq said: His people alleged that the Messenger of Allah (ﷺ) asked forgiveness for him after that.\n</p>\n<p>\nAbu Dawud said: Al-Nadr b. Shumail said: al-ghiyar means blood-wit.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 945060,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844890,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1647.00",
        "babName": "The Heir Of The One Who Was Killed Deliberately Taking The Diyah",
        "hadithNumber": 4489,
        "hadithText": "<p>\n\nNarrated AbuShurayb al-Ka'bi:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: Then you, Khuza'ah, have killed this man of Hudhayl, but I will pay his blood-wit. After these words of mine if a man of anyone is killed, his people will have a choice to accept blood-wit or to kill him.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 945070,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844910,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1647.00",
        "babName": "The Heir Of The One Who Was Killed Deliberately Taking The Diyah",
        "hadithNumber": 4491,
        "hadithText": "<p>\n\nNarrated 'Amr b. Shu'aib:\n</p>\n\n\n\n<p>\nOn his father's authority said that his grandfather reported the Prophet (ﷺ) said: A believer will not be killed for an infidel. If anyone kills a man deliberately, he is to be handed over to the relatives of the one who has been killed. If they wish, they may kill, but if they wish, they may accept blood-wit\n</p></b>",
        "bookID": "40.0",
        "grade1": "Hasan Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 945090,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844920,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1648.00",
        "babName": "One Who Kills After Accepting The Diyah",
        "hadithNumber": 4492,
        "hadithText": "<p>\n\nNarrated Jabir ibn Abdullah:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: I will not forgive anyone who kills after accepting blood-wit\n</p></b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 945100,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844950,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1649.00",
        "babName": "If A Person Gives A Man Poison To Drink Or Eat, And He Dies, Is He Subject To Retaliation ?",
        "hadithNumber": 4495,
        "hadithText": "<p>\n\nNarrated Ibn Shihab:\n</p>\n\n\n\n<p>\n\nJabir ibn Abdullah used to say that a Jewess from the inhabitants of Khaybar poisoned a roasted sheep and presented it to the Messenger of Allah (ﷺ) who took its foreleg and ate from it. A group of his companions also ate with him.  \n</p>\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) then said: Take your hands away (from the food). The Messenger of Allah (ﷺ) then sent someone to the Jewess and he called her.  \n</p>\n\n\n<p>\n\nHe said to her: Have you poisoned this sheep?  The Jewess replied: Who has informed you? He said: This foreleg which I have in my hand has informed me.  She said: Yes.  He said: What did you intend by it?  She said: I thought if you were a prophet, it would not harm you; if you were not a prophet, we should rid ourselves of him (i.e. the Prophet). The Messenger of Allah (ﷺ) then forgave her, and did not punish her. But some of his companions who ate it, died. The Messenger of Allah (ﷺ) had himself cupped on his shoulder on account of that which he had eaten from the sheep. AbuHind cupped him with the horn and knife. He was a client of Banu Bayadah from the Ansar.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 945130,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844960,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1649.00",
        "babName": "If A Person Gives A Man Poison To Drink Or Eat, And He Dies, Is He Subject To Retaliation ?",
        "hadithNumber": 4496,
        "hadithText": "<p>\n\nNarrated AbuSalamah:\n</p>\n\n\n\n<p>\n\nA Jewess presented a roasted sheep to the Messenger of Allah (ﷺ) at Khaybar. \n</p>\n\n\n<p>\n\nHe then mentioned the rest of the tradition like that of Jabir (No. 4495). He said: Then Bashir ibn al-Bara' ibn Ma'rur al-Ansari died. He sent someone to call on the Jewess, and said to her (when she came): What motivated you to do the work you have done?  He then mentioned the rest of the tradition similar to the one mentioned by Jabir (No. 4495). \n</p>\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) then ordered regarding her and she was killed. But he (AbuSalamah) did not mention the matter of cupping.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Hasan Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 945140,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845031,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1650.00",
        "babName": "If A Man Kills His Slave Or Mutilates Him, Should Retaliation Be Imposed On Him ?",
        "hadithNumber": 4503,
        "hadithText": "It was narrated from Hisham, from Qatadah, from Al-Hasan, who said: \"A free man should not be subjected to retaliation in return for a slave.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih Maqtu'",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 945210,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844990,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1649.00",
        "babName": "If A Person Gives A Man Poison To Drink Or Eat, And He Dies, Is He Subject To Retaliation ?",
        "hadithNumber": 4499,
        "hadithText": "<p>\n\nNarrated Ibn Ka'b b. Malik:\n</p>\n\n\n\n<p>\n\nOn the authority of his father: Umm Mubashshir said to the Prophet (ﷺ) during the sickness of which he died: What do you think about your illness, Messenger of Allah (ﷺ)? I do not think about the illness of my son except the poisoned sheep of which he had eaten with you at Khaybar. The Prophet (ﷺ) said: And I do not think about my illness except that. This is the time when it cut off my aorta.\n</p>\n<p>\nAbu Dawud said: Sometime 'Abd al-Razzaq transmitted this tradition, omitting the link of the Companion, from Ma'mar, from al-Zuhri, from the Prophet (ﷺ), and sometimes he transmitted it from al-Zuhri from 'Abd al-Rahman b. Ka'b b. Malik, 'Abd al-Rahman mentioned that Ma'mar sometimes transmitted the tradition in a mursal form (omitting the link of the Companion), and they recorded it. And all this is correct with us. 'Abd al-Razzaq said: When Ibn al-Mubarak came to Ma'mar, he transmitted the traditions in a musnad form (with a perfect chain) which he transmitted as mauquf traditions (statements of the Companions and not of the Prophet).\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih in chain",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 945160,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845010,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1650.00",
        "babName": "If A Man Kills His Slave Or Mutilates Him, Should Retaliation Be Imposed On Him ?",
        "hadithNumber": 4501,
        "hadithText": "<p>\n\nNarrated Samurah:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) Said: If anyone kills his slave, we shall kill him, and if anyone cuts off the nose of his slave, we shall cut off his nose.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 945180,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845040,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1650.00",
        "babName": "If A Man Kills His Slave Or Mutilates Him, Should Retaliation Be Imposed On Him ?",
        "hadithNumber": 4504,
        "hadithText": "<p>\n\nNarrated 'Amr b. Shu'aib:\n</p>\n\n\n\n<p>\nOn his father's authority, said that his grandfather told that a A man came to the Prophet (ﷺ) crying for help. He said: His slave-girl, Messenger of Allah! He said: Woe to you, what happened with you ? He said that it was an evil one. He saw the slave-girl of his master; he became jealous of him, and cut off his penis. The Messenger of Allah (ﷺ) said: Bring the man to me. The man was called, but people could not get control over him. The Messenger of Allah (ﷺ) then said: Go away, you are free. He asked: Messenger of Allah! upon whom does my help lie? He replied: On every believer, or he said: On every Muslim.\n</p>\n<p>\nAbu Dawud said: The name of the man who was emancipated was Rawh b. Dinar\n</p>\n<p>\nAbu Dawud said: The man who cut off the penis was Zinba'\n</p>\n<p>\nAbu Dawud said: The Zinba' Abu Rawh was master of the slave.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 945220,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845070,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1651.00",
        "babName": "Al-Qasamah",
        "hadithNumber": 4507,
        "hadithText": "<p>\n\nNarrated 'Amr b. Shu'aib:\n</p>\n\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) killed a man of Banu Nadr ibn Malik at Harrah ar-Righa' at the bank of Layyat al-Bahrah. The transmitter Mahmud (ibn Khalid) also mentioned the words along with the words \"at Bahrah\" \"the slayer and the slain were from among them\". Mahmud alone transmitted in this tradition the words \"at the bank of Layyah\".\n</p></b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 945250,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 845090,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1652.00",
        "babName": "Not Retaliating On The Basis Of Qasamah",
        "hadithNumber": 4509,
        "hadithText": "<p>\n\nNarrated Rafi' ibn Khadij:\n</p>\n\n\n\n<p>\n\nA man of the Ansar was killed at Khaybar and his relatives went to the Prophet (ﷺ) and mentioned that to him. He asked: Have you two witnesses who can testify to the murderer of your friend? They replied: Messenger of Allah! there was not a single Muslim present, but only Jews who sometimes have the audacity to do even greater crimes than this. He said: Then choose fifty of them and demand that they take an oath; but they refused and the Prophet (ﷺ) paid the blood-wit himself.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih li ghairih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 945270,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845110,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1652.00",
        "babName": "Not Retaliating On The Basis Of Qasamah",
        "hadithNumber": 4511,
        "hadithText": "<p>\n\nNarrated 'Abu Salamah b. 'Abd al-Rahman and Sulaiman b. Yasar:\n</p>\n\n\n\n<p>\n\nOn the authority of some men of the Ansar : The Prophet (ﷺ) said to the Jews and started with them: Fifty of you should take the oaths. But they refused (to take the oaths). He then said to the Ansar: Prove your claim. They said: Do we take the oaths without seeing, Messenger of Allah? The Messenger of Allah (ﷺ) then imposed the blood-wit on the Jews because he (the slain) was found among them.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Shadh",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 945290,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845150,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1654.00",
        "babName": "Should A Muslim Be Killed In Retaliation For A Disbeliever ?",
        "hadithNumber": 4515,
        "hadithText": "<p>\n\nNarrated Qays ibn Abbad :\n</p>\n\n\n\n<p>\n\nI and Ashtar went to Ali and said to him: Did the Messenger of Allah (ﷺ) give you any instruction about anything for which he did not give any instruction to the people in general?  \n</p>\n\n\n<p>\n\nHe said: No, except what is contained in this document of mine. Musaddad said: He then took out a document. Ahmad said: A document from the sheath of his sword.  \n</p>\n\n\n<p>\n\nIt contained: The lives of all Muslims are equal; they are one hand against others; the lowliest of them can guarantee their protection. Beware, a Muslim must not be killed for an infidel, nor must one who has been given a covenant be killed while his covenant holds. If anyone introduces an innovation, he will be responsible for it. If anyone introduces an innovation or gives shelter to a man who introduces an innovation (in religion), he is cursed by Allah, by His angels, and by all the people. \n</p>\n\n\n<p>\n\nMusaddad said: Ibn AbuUrubah's version has: He took out a document.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 945330,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845160,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1654.00",
        "babName": "Should A Muslim Be Killed In Retaliation For A Disbeliever ?",
        "hadithNumber": 4516,
        "hadithText": "<p>\n\nNarrated 'Amr b. Suh'aib:\n</p>\n\n\n\n<p>\n\nOn his father's authority, said that his grandfather reported the Messenger of Allah (ﷺ) said, mentioning the tradition similar to the one transmitted by Ali. This version adds: The most distant of them gives protection as from all, those who are strong among them send back (spoil) to those who are weak among them, and their expeditions sending it back to those who are at home.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Hasan Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 945340,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845190,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1656.00",
        "babName": "Injury Caused Accidentally By The Zakah Collector",
        "hadithNumber": 4519,
        "hadithText": "<p>\n\nNarrated Aisha, Ummul Mu'minin:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) sent AbuJahm ibn Hudhayfah as a collector of zakat. A man quarrelled with him about his sadaqah (i.e. zakat), and AbuJahm struck him and wounded his head. His people came to the Prophet (ﷺ) and said: Revenge, Messenger of Allah!  \n</p>\n\n\n<p>\n\nThe Prophet (ﷺ) said: You may have so much and so much. But they did not agree. He again said: You may have so much and so much. But they did not agree. He again said: You may have so much and so much. So they agreed.  \n</p>\n\n\n<p>\n\nThe Prophet (ﷺ) said: I am going to address the people in the afternoon and tell them about your consent.  \n</p>\n\n\n<p>\n\nThey said: Yes.  Addressing (the people), the Messenger of Allah (ﷺ) said: These people of faith came to me asking for revenge. I presented them with so much and so much and they agreed. Do you agree?  \n</p>\n\n\n<p>\n\nThey said: No. The immigrants (muhajirun) intended (to take revenge) on them. But the Messenger of Allah (ﷺ) commanded them to refrain and they refrained.  \n</p>\n\n\n<p>\n\nHe then called them and increased (the amount), and asked: Do you agree?  They replied: Yes.  He said: I am going to address the people and tell them about your consent.  They said: Yes.  The Prophet (ﷺ) addressed and said: Do you agree?  They said: Yes.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 945370,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845210,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1658.00",
        "babName": "Retaliation Of A Ruler On Himself For Striking Someone",
        "hadithNumber": 4521,
        "hadithText": "<p>\n\nNarrated AbuSa'id al-Khudri:\n</p>\n\n\n\n<p>\n\nWhen the Messenger of Allah (ﷺ) was distributing something, a man came towards him and bent down on him. The Messenger of Allah (ﷺ) struck him with a bough and his face was wounded. The Messenger of Allah (ﷺ) said to him: Come and take retaliation. He said: no, I have forgiven, Messenger of Allah!.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 945390,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845220,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1658.00",
        "babName": "Retaliation Of A Ruler On Himself For Striking Someone",
        "hadithNumber": 4522,
        "hadithText": "<p>\n\nNarrated Abu Firas:\n</p>\n\n\n\n<p>\n\n'Umar b. al-Khattab (ra) addressed us and said: I did not send my collectors (of zakat) so that they strike your bodies and that they take your property. If that is done with someone and he appeals to me, I shall take retaliation on him. Amr ibn al-'As said: If any man (i.e. governor) inflicts disciplinary punishment on his subjects, would you take retaliation on him too? He said: Yes, by Him in Whose hand my soul is, I shall take retaliation on him. I saw that the Messenger of Allah (ﷺ) has given retaliation on himself.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 945400,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845230,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1659.00",
        "babName": "A Woman Has The Right To Waive Retaliation For Killing",
        "hadithNumber": 4523,
        "hadithText": "<p>\n\nNarrated Aisha, Ummul Mu'minin:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) Said: The disputants should refrain from taking retaliation. The one who is nearer should forgive first and then the one who is next to him, even if (the one who forgives) were a woman.\n</p>\n<p>\nAbu Dawud said: I have been informed that forgiving by women in the case of murder is permissible if a woman were one of the heirs (of the slain). I have been told on the authority of Abu 'Ubaid about the meaning of the word yanhajizu, that is, they should refrain from retaliation.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 945410,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845260,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1661.00",
        "babName": "The Amount Of The Diyah",
        "hadithNumber": 4526,
        "hadithText": "<p>\n\nNarrated 'Amr b. Suh'aib:\n</p>\n\n\n\n<p>\n\nOn his father's authority, said that his grandfather reported the  Messenger of Allah (ﷺ) gave judgment that if anyone is killed accidentally, his blood-wit should be one hundred camels: thirty she-camels which had entered their second year, thirty she-camels which had entered their third year, thirty she-camels which had entered their fourth year, and ten male camels which had entered their third year.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 945440,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845270,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1661.00",
        "babName": "The Amount Of The Diyah",
        "hadithNumber": 4527,
        "hadithText": "<p>\n\nNarrated 'Amr b. Suh'aib:\n</p>\n\n\n\n<p>\n\nOn his father's authority, said that his grandfather reported that the  value of the blood-money at the time of the Messenger of Allah (ﷺ) was eight hundred dinars or eight thousand dirhams, and the blood-money for the people of the Book was half of that for Muslims.  \n</p>\n\n\n<p>\n\nHe said: This applied till Umar (Allah be pleased with him) became caliph and he made a speech in which he said: Take note! Camels have become dear. So Umar fixed the value for those who possessed gold at one thousand dinars, for those who possessed silver at twelve thousand (dirhams), for those who possessed cattle at two hundred cows, for those who possessed sheep at two thousand sheep, and for those who possessed suits of clothing at two hundred suits. He left the blood-money for dhimmis (protected people) as it was, not raising it in proportion to the increase he made in the blood-wit.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 945450,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845280,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1661.00",
        "babName": "The Amount Of The Diyah",
        "hadithNumber": 4528,
        "hadithText": "<p>\n\nNarrated Ata' ibn AbuRabah:\n</p>\n\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) gave judgment that blood-wit for those who possessed camels should be one hundred camels, and for those who possessed cattle two hundred cows, and for those who possessed sheep  one thousand sheep, and for those who possessed suits of clothing two hundred suits, and for those who possessed wheat something which the narrator Muhammad (ibn Ishaq) did not remember.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 945460,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845281,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1661.00",
        "babName": "The Amount Of The Diyah",
        "hadithNumber": 4528,
        "hadithText": "<p>\nAbu Dawud said: I read out to Sa'id b. Ya'qub al-Taliqini who said: Abu Tumailah transmitted to us, saying: Muhammad b. Ishaq transmitted to us saying: 'Ata reported Jabir b. 'Abd Allah as saying: The Messenger of Allah (ﷺ) fixed; and he mentioned the tradition like that of Musa; he said: And those who possess corn food should pay something which I do not remember.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 945470,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845290,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1661.00",
        "babName": "The Amount Of The Diyah",
        "hadithNumber": 4529,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Mas'ud:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: The blood-wit for accidental killing should be twenty she-camels which had entered their fourth year, twenty she-camels which had entered their fifth year, twenty she-camels which had entered their second year, twenty she-camels which had entered their third year, and twenty male camels which had entered their second year. It does not beyond Ibn Mas'ud.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 945480,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845300,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1661.00",
        "babName": "The Amount Of The Diyah",
        "hadithNumber": 4530,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nA man of Banu Adi was killed. The Prophet (ﷺ) fixed his blood-wit at the rate of twelve thousand (dirhams).\n</p>\n\n<p>\nAbu Dawud said: Ibn 'Uyainah transmitted it from 'Amr, from 'Ikrimah, from the Prophet (ﷺ), and he did not mention Ibn 'Abbas.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 945490,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845310,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1662.00",
        "babName": "Diyah For A Mistaken Killing That Appears Purposeful",
        "hadithNumber": 4531,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Amr:\n</p>\n\n\n\n<p>\n\n(Musaddad's version has): The Messenger of Allah (ﷺ) made a speech on the day of the conquest of Mecca, and said: Allah is Most Great, three times. He then said: There is no god but Allah alone: He fulfilled His promise, helped His servant, and alone defeated the companies. \n</p>\n\n\n<p>\n\n(The narrator said:) I have remembered from Musaddad up to this. \n</p>\n\n\n<p>\n\nThen the agreed version has: Take note! All the merits mentioned in pre-Islamic times, and the claim made for blood or property are under my feet, except the supply of water to the pilgrims and the custody of the Ka'bah. He then said: The blood-money for unintentional murder which appears intentional, such as is done with a whip and a stick, is one hundred camels, forty of which are pregnant. Musaddad's version is more accurate.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 945500,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845400,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1664.00",
        "babName": "Diyah For Lost Limbs",
        "hadithNumber": 4540,
        "hadithText": "<p>\n\nNarrated AbuMusa:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: The fingers are equal: ten camels for each finger.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 945590,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845410,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1664.00",
        "babName": "Diyah For Lost Limbs",
        "hadithNumber": 4541,
        "hadithText": "<p>\n\nNarrated AbuMusa al-Ash'ari:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: The fingers are equal. I asked: Ten camels for each? He replied: Yes.\n</p>\n\n\n<p>\nAbu Dawud said: Muhammad b. Ja'far transmitted it from Shu'bah, from Ghalib, saying: I heard Masruq b. Aws ; and Isma'il transmitted it, saying: Ghalib al-Tammar transmitted it to me through the chain of Abu al-Walid ; and Hanzlah b. Abi Safiyyah transmitted it from Ghalib through the chain of Isma'il.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 945600,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845430,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1664.00",
        "babName": "Diyah For Lost Limbs",
        "hadithNumber": 4543,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: The fingers are equal and the teeth are equal. The front tooth and the molar tooth are equal, this and that are equal.\n</p>\n\n<p>\nAbu Dawud said: Nadr b. Shumail transmitted it from Shu'bah to the same effect as mentioned by 'Abd al-Samad. Abu Dawud said: al-Darimi narrated it to me from al-Nadr.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 945620,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845440,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1664.00",
        "babName": "Diyah For Lost Limbs",
        "hadithNumber": 4544,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: The teeth are equal, and the fingers are equal.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 945630,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845450,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1664.00",
        "babName": "Diyah For Lost Limbs",
        "hadithNumber": 4545,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) treated the fingers and toes as equal.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 945640,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845460,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1664.00",
        "babName": "Diyah For Lost Limbs",
        "hadithNumber": 4546,
        "hadithText": "<p>\n\nNarrated 'Amr b. Suh'aib:\n</p>\n\n\n\n<p>\n\nOn his father's authority, said that his grandfather said: The Prophet (ﷺ) said in his address while he was leaning against the Ka'bah: (The blood-wit) for each finger is ten camels.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Hasan Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 945650,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845470,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1664.00",
        "babName": "Diyah For Lost Limbs",
        "hadithNumber": 4547,
        "hadithText": "<p>\n\nNarrated 'Amr b. Suh'aib:\n</p>\n\n\n\n<p>\n\nOn his father's authority, said that his grandfather said: The Prophet (ﷺ) said: For each tooth are ten camels.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Hasan Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 945660,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845471,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1664.00",
        "babName": "Diyah For Lost Limbs",
        "hadithNumber": 4547,
        "hadithText": "<p>\nNarrated Abu Dawud:\n</p>\n\n<p>\nI found in my notebook from Shaiban and I did not hear from him ; Abu Bakr, a reliable friend of ours, said: Shaiban - Muhammad b. Rashid - Sulaiman b. Musad - 'Amr b. Suh'aib, On his father's authority, said that his grandfather said: The Messenger of Allah (ﷺ) would fix the blood-money for accidental killing at the rate of four hundred dinars or their equivalent in silver for townsmen, and he would fix it according to the price of camels. So when they were dear, he increased the amount to be paid, and when cheap prices prevailed he reduced the amount to be paid. In the time of the Messenger of Allah (ﷺ) they reached between four hundred and eight hundred dinars, their equivalent in silver being eight thousand dirhams.  \n</p>\n\n\n<p>\n\nHe said: The Messenger of Allah (ﷺ) gave judgment that those who possessed cattle should pay two hundred cows, and those who possessed sheep two thousand sheep.  \n</p>\n\n\n<p>\n\nHe said: The Messenger of Allah (ﷺ) said: The blood-money is to be treated as something to be inherited by the heirs of the one who has been killed, and the remainder should be divided among the agnates.  \n</p>\n\n\n<p>\n\nHe said: The Messenger of Allah (ﷺ) gave judgment that for cutting off a nose completely there was full blood-money, one hundred (camels) were to be paid. If the tip of the nose was cut off, half of the blood-money,i.e. fifty camels were to be paid, or their equivalent in gold or in silver, or a hundred cows, or one thousand sheep. For the hand, when it was cut of,f half of the blood-money was to be paid; for one foot of half, the blood-money was to be paid. For a wound in the head, a third of the blood-money was due, i.e. thirty-three camels and a third of the blood-money, or their equivalent in gold, silver, cows or sheep. For a head thrust which reaches the body, the same blood-money was to be paid. Ten camels were to be paid for every finger, and five camels for every tooth.  \n</p>\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) gave judgment that the blood-money for a woman should be divided among her relatives on her father's side, who did not inherit anything from her except the residence of her heirs. If she was killed, her blood-money should be distributed among her heirs, and they would have the right of taking revenge on the murderer.  \n</p>\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) said: There is nothing for the murderer; and if he (the victim) has no heir, his heir will be the one who is nearest to him among the people, but the murderer should not inherit anything.  \n</p>\n\n\n<p>\n\nMuhammad said: All this has been transmitted to me by Sulayman ibn Musa on the authority of Amr ibn Shu'aib who, on his father's authority, said that his grandfather heard it from the Prophet (ﷺ).\n</p>\n<p>\nAbu Dawud said: Muhammad b. Rashid, an inhabitant of Damascus, fled from Basrah escaping murder.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 945670,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845480,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1664.00",
        "babName": "Diyah For Lost Limbs",
        "hadithNumber": 4548,
        "hadithText": "<p>\n\nNarrated 'Amr b. Suh'aib:\n</p>\n\n\n\n<p>\n\nOn his father's authority, said that his grandfather reported the Prophet (ﷺ) said: Blood-wit for what resembles intentional murder is to be made as severe as that for intentional murder, but the culprit is not to be killed. Khalid gave us some additional information on the authority of Ibn Rashid: That (unintentional murder which resembles intentional murder) means that Satan jumps among the people and then the blood is shed blindly without any malice and weapon.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 945680,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845490,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1664.00",
        "babName": "Diyah For Lost Limbs",
        "hadithNumber": 4549,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Amr ibn al-'As:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: Blood-wit for every wound which lays bare a bone is five camels.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Hasan Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 945690,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845500,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1664.00",
        "babName": "Diyah For Lost Limbs",
        "hadithNumber": 4550,
        "hadithText": "<p>\n\nNarrated 'Amr b. Suh'aib:\n</p>\n\n\n\n<p>\n\nOn his father's authority, said that his grandfather said: The Messenger of Allah (ﷺ) gave judgment that a third of the blood-wit should be paid for an eye fixed in its place.\n</p></b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 945700,
        "last_updated": "2012-10-20 22:13:45"
    },
    {
        "englishURN": 845550,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1665.00",
        "babName": "The Diyah For A Fetus",
        "hadithNumber": 4555,
        "hadithText": "Narrated Ibn 'Abbas:\n<p>\n'Umar asked about the decision of the Prophet (ﷺ) about that (i.e. abortion). Haml b. Malik b. al-Nabhigah got up and said: I was between two women. One of them struck another with a rolling-pin killing both her and what was in her womb. So the Messenger of Allah (ﷺ) gave judgement that the bloodwit for the unborn child should be a male or a female slave of the best quality and the she should be killed.\n</p>\n<p>\nAbu Dawud said: Al-Nadr b. Shumail said: Mistah means a rolling-pin.\n</p>\n<p>\nAbu Dawud said: Abu 'Ubaid said: Mistah means a pole from the tent-poles.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 945750,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845560,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1665.00",
        "babName": "The Diyah For A Fetus",
        "hadithNumber": 4556,
        "hadithText": "<p>\n\nNarrated Tawus:\n</p>\n\n\n\n<p>\n\nUmar stood on the pulpit. He then mentioned the rest of the tradition to the same effect as mentioned before. He did not mention \"that she should be killed\". This version adds: \"a male or a female slave\". Umar then said: Allah is Most Great. Had I not heard it, we would have decided about it something else.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Da'if in chain",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 945760,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845570,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1665.00",
        "babName": "The Diyah For A Fetus",
        "hadithNumber": 4557,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nAbout the story of Haml ibn Malik, Ibn Abbas said: She aborted a child who had grown hair and was dead, and the woman also died. He (the Prophet) gave judgment that the blood-wit was to be paid by the woman's relatives on the father's side. Her uncle said: Messenger of Allah! She has aborted a child who had grown hair. The father of the woman who had slain said: He is a liar: I swear by Allah, he did not raise his voice, or drink or eat. No compensation is to be paid for an offence like this. The Prophet (ﷺ) said: is it a rhymed prose of pre-Islamic Arabia and its soothsaying? Pay a male or female slave of the best quality in compensation for the child.\n</p>\n<p>\nIbn 'Abbas said: The name of one of them was Mulaikah, and the name of the other was Umm Ghutaif.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 945770,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845580,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1665.00",
        "babName": "The Diyah For A Fetus",
        "hadithNumber": 4558,
        "hadithText": "<p>\n\nNarrated Jabir ibn Abdullah:\n</p>\n\n\n\n<p>\n\nOne of the two women of Hudhayl killed the other, Each of them had husband and sons. The Messenger of Allah (ﷺ) fixed the blood-wit for the slain woman to be paid by the woman's relatives on the father's side. He declared her husband and the child innocent. The relatives of the woman who killed said: We shall inherit from her. The Messenger of Allah (ﷺ) said: No, her sons and her husband should inherit from her.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 945780,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845610,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1665.00",
        "babName": "The Diyah For A Fetus",
        "hadithNumber": 4561,
        "hadithText": "<p>\n\nNarrated Buraydah ibn al-Hasib:\n</p>\n\n\n\n<p>\n\nA woman threw a stone at another woman and she aborted. The dispute was brought to the Messenger of Allah (ﷺ). He gave judgment that five hundred sheep should be paid for her (unborn) child, and forbade throwing stones.\n</p>\n\n<p>\nAbu Dawud said: The version of this tradition goes in this way, i.e. five hundred sheep. What is correct is one hundred sheep. Abu Dawud said: 'Abbas transmitted this tradition this way, but it is misunderstanding.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 945810,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845620,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1665.00",
        "babName": "The Diyah For A Fetus",
        "hadithNumber": 4562,
        "hadithText": "<p>\n\nNarrated AbuHurayrah:\n</p>\n\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) gave judgment that a male or a female slave, or a horse or a mule should be paid for a miscarriage.\n</p>\n\n<p>\nAbu Dawud said: Hammad b. Salamah and Khalid b. 'Abd Allah transmitted this tradition from Muhammad b. 'Amr, but they did not mention \"or a horse or a mule\"\n</p></b>",
        "bookID": "40.0",
        "grade1": "Shadh",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 945820,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845640,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1666.00",
        "babName": "The Diyah Of A Mukatib",
        "hadithNumber": 4564,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nThe Messenger of Allah (ﷺ) gave judgment about the slave who had made an agreement to purchase his freedom (mukatab) and he had been killed that blood-wit is paid for him at the rate paid for a free man so far as he has paid the purchase money, and at the rate paid for a slave as the remainder is concerned.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 945840,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845650,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1666.00",
        "babName": "The Diyah Of A Mukatib",
        "hadithNumber": 4565,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: When a mukatab (a slave who has made an agreement to purchase his freedom) gifts blood-money or an inheritance, he can inherit in accordance with the extent to which he has been emancipated.\n</p>\n\n<p>\nAbu Dawud said: Wuhaib transmitted it from Ayyub, from 'Ikrimah, on the authority of 'Ali, from the Prophet (ﷺ): and Hammad b. Zaid and Isma'il have transmitted it in a mursal form (i.e the link of the Companion being missing) from Ayyub, from 'Ikrimah, from the Prophet (ﷺ). Isma'il b. 'Ulayyah has treated it as a statement of 'Ikrimah.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 945850,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845660,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1667.00",
        "babName": "The Diyah Of A Dhimmi",
        "hadithNumber": 4566,
        "hadithText": "<p>\n\nNarrated 'Amr b. Suh'aib:\n</p>\n\n\n\n<p>\n\nOn his father's authority, said that his grandfather reported the Messenger of Allah (ﷺ)  said: The blood-wit for a man who makes a covenant is half of the blood-wit for a free man.\n</p>\n<p>\nAbu Dawud said: It has been transmitted by Usamah b. Zaid al-Laithi and 'Abd al-Rahman b. al-Harith on the authority of 'Amr b. Suh'aib in similar manner.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 945860,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845690,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1669.00",
        "babName": "One Who Practices Medicine Although He Is Not Known For That, And Causes Harm",
        "hadithNumber": 4569,
        "hadithText": "<p>\n\nNarrated 'Amr b. Suh'aib:\n</p>\n\n\n\n<p>\nOn his father's authority, said that his grandfather reported the Messenger of Allah (ﷺ) said: Anyone who practises medicine when he is not known as a practitioner will be held responsible.\n</p>\n<p>\nAbu Dawud said: This has been transmitted by al-Walid alone. We do not know whether it is sound or not.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 945890,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845700,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1669.00",
        "babName": "One Who Practices Medicine Although He Is Not Known For That, And Causes Harm",
        "hadithNumber": 4570,
        "hadithText": "<p>\n\nNarrated AbdulAziz ibn Umar ibn AbdulAziz:\n</p>\n\n\n\n<p>\n\nSome people of the deputation which came to my father reported the Messenger of Allah (ﷺ) as saying: Any physician who practises medicine when he was not known as a practitioner before that and he harms (the patients) he will be held responsible. AbdulAziz said: Here physician does not refer to a man by qualification. it means opening a vein, incision and cauterisation.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 945900,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845710,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1670.00",
        "babName": "The Diyah For Unintentional Killing That Appears Intentional",
        "hadithNumber": 4571,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Amr ibn al-'As:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: Musaddad's version has: He addressed on the day of Conquest. The agreed version then goes: Beware! Every object of pride of pre-Islamic times, whether it is blood-vengeance or property, mentioned or claimed, has been put under my feet except supply of water to the pilgrims and custody of the House (the Ka'bah). He then said: Beware! The blood-wit for unintentional murder, such as is done with a whip and stick, is one hundred camels, forty of which are pregnant.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 945910,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845730,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1671.00",
        "babName": "The Crime Of A Slave Who Belongs To Poor People",
        "hadithNumber": 4573,
        "hadithText": "<p>\n\nNarrated Imran ibn Husayn:\n</p>\n\n\n\n<p>\n\nA servant of some poor people cut off the ear of the servant of some rich people. His people came to the Prophet (ﷺ) and said: Messenger of Allah! we are poor people. So he imposed no compensation on them.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 945930,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845740,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1672.00",
        "babName": "One Who Is Killed Blindly While The People Are Fighting",
        "hadithNumber": 4574,
        "hadithText": "<p>\n\nNarrated Abdullah ibn Abbas:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: If anyone is killed blindly or, when people are throwing stones, by a stone or a whip, his blood-wit is the blood-wit for an accidental murder. But if anyone is killed intentionally, retaliation is due. If anyone tries to prevent it, the curse of Allah, of angels, and of all the people will rest on him.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 945940,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845750,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1673.00",
        "babName": "A Kick From An Animal",
        "hadithNumber": 4575,
        "hadithText": "<p>\n\nNarrated Abu Hurayrah:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: No recompense is to be demanded if one is kicked by an animal.\n</p>\n<p>\nAbu Dawud said: An animal kicks someone with its leg while one is riding on it.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 945950,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845770,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1675.00",
        "babName": "The Fire That Spread",
        "hadithNumber": 4577,
        "hadithText": "<p>\n\nNarrated AbuHurayrah:\n</p>\n\n\n\n<p>\n\nThe Prophet (ﷺ) said: No recompense may be demanded if the fire spreads.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 945970,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844850,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1646.00",
        "babName": "The Imam Enjoining A Pardon In The Case Of Bloodshed",
        "hadithNumber": 4485,
        "hadithText": "The tradition mentioned above has also been transmitted by 'Alqamah b. Wa'il through a different chain of narrators and to the same effect.</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 945030,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 844860,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1646.00",
        "babName": "The Imam Enjoining A Pardon In The Case Of Bloodshed",
        "hadithNumber": 4486,
        "hadithText": "Narrated Wa'il (b. Hujr):\nA man brought an Abyssinian to the Prophet (ﷺ) and said: This man has killed my nephew. He asked: How did you kill him? He replied: I struck his head with axe but I did not intend to kill him. He asked: Have you some money so that you pay his blood-wit? He said: No. He said: What is your opinion if I send you so that you ask the people (for money) and thus collect your blood-wit? He said: No. He asked : Will your masters give you his blood-wit (to pay his relatives)? He said: No. He said to the man. Take him. So he brought him out to kill him. The Messenger of Allah (ﷺ) said: If he kill him, he will be like him. This (statement) reached the man where he was listening to his statement. He said: He is here, order regarding him as you like. The Messenger of Allah (ﷺ) said: Leave him alone. And he once said: He will bear the burden of the sin of the slain and that of his own and thus he will become one of the Companions of Hell. So he let him go.</b>",
        "bookID": "40.0",
        "grade1": "Sahih li ghairih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 945040,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844900,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1647.00",
        "babName": "The Heir Of The One Who Was Killed Deliberately Taking The Diyah",
        "hadithNumber": 4490,
        "hadithText": "Narrated Abu Hurairah:\nWhen Mecca was conquered, the Messenger of Allah (ﷺ) got up and said: If a relative of anyone is killed, he will have a choice between two : he (the slayer) will either pay the blood-wit or he will be killed. A man of the Yemen called Abu Shah stood up and said: Write for me, Messenger of Allah. The narrator al-'Abbas (b. al-Walid) said: Write to me, (you people). The Messenger of Allah (ﷺ) said: Write (you people), for Abu Shah. These are the wordings of the tradition of Ahmad.\n</p>\n<p>\nAbu Dawud said: Write (you people), for me, that is, the address of the Prophet (ﷺ).\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 945080,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844930,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1649.00",
        "babName": "If A Person Gives A Man Poison To Drink Or Eat, And He Dies, Is He Subject To Retaliation ?",
        "hadithNumber": 4493,
        "hadithText": "Narrated Anas bin Malik:\nA Jewess brought a poisoned sheep to the Messenger of Allah (ﷺ), and he ate of it. She was then brought to the Messenger of Allah (ﷺ) who asked her about it. She said: I intended to kill you. He said: Allah will not give you control over it ; or he said : over me. They (the Companions) said: Should we not kill her ? He said: No. He (Anas) said: I always found it in the uvula of the Messenger of Allah (ﷺ)</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 945110,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844940,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1649.00",
        "babName": "If A Person Gives A Man Poison To Drink Or Eat, And He Dies, Is He Subject To Retaliation ?",
        "hadithNumber": 4494,
        "hadithText": "Narrated Abu Hurairah:\n<p>\nA Jewess presented a poisoned sheep to the Prophet (ﷺ), but the Prophet (ﷺ) did not interfere with he.\n</p>\n<p>\nAbu Dawud said: The Jewess who poisoned the Prophet (ﷺ) was sister of Marhab.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Da'if in chain",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 945120,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 844970,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1649.00",
        "babName": "If A Person Gives A Man Poison To Drink Or Eat, And He Dies, Is He Subject To Retaliation ?",
        "hadithNumber": 4497,
        "hadithText": "<p>\nNarrated Abu Hurairah:\n</p>\n<p>\nThe Messenger of Allah (ﷺ) would accept a present, but would not accept alms (sadaqah).\nAnd Wahb bin Baqiyyah narrated to us, elsewhere, from Khalid, from Muhammad ibn Amr said on the authority of AbuSalamah, and he did not mention the name of Abu Hurairah: The Messenger of Allah (ﷺ) used to accept presents but not alms (sadaqah).  \n</p>\n\n\n<p>\n\nThis version adds: So a Jewess presented him at Khaybar with a roasted sheep which she had poisoned. The Messenger of Allah (ﷺ) ate of it and the people also ate.  \n</p>\n\n\n<p>\n\nHe then said: Take away your hands (from the food), for it has informed me that it is poisoned. Bishr ibn al-Bara' ibn Ma'rur al-Ansari died.  \n</p>\n\n\n<p>\n\nSo he (the Prophet) sent for the Jewess (and said to her): What motivated you to do the work you have done?  \n</p>\n\n\n<p>\n\nShe said: If you were a prophet, it would not harm you; but if you were a king, I should  rid the people of you. The Messenger of Allah (ﷺ) then ordered regarding her and she was killed. He then said about the pain of which he died: I continued to feel pain from the morsel which I had eaten at Khaybar. This is the time when it has cut off my aorta.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Hasan Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 945150,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845000,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1649.00",
        "babName": "If A Person Gives A Man Poison To Drink Or Eat, And He Dies, Is He Subject To Retaliation ?",
        "hadithNumber": 4500,
        "hadithText": "Narrated 'Abd al-Rahman b. 'Abd Allah b. Ka'b b. Malik :\nOn the authority of his mother than Umm Mubashshir said (Abu Sa'id b. al-A'rabi said: So he said it on the authority of his mother ; what is correct is: on the authority of his father, instead of his mother): I entered upon the Prophet (ﷺ). He then mentioned the tradition of Makhlad b. Khalid in a way similar to the tradition of Jabir. The narrator said: Then Bishr b. al-Bara' b. Ma'rur died. So he (the Prophet) sent for the Jewess and said: What did motivate you for your work you have done ? He (the narrator) then mentioned the rest of the tradition like the tradition of Jabir. The Messenger of Allah (ﷺ) ordered regarding her and she was killed. He (the narrator in this version) did not mention cupping.</b>",
        "bookID": "40.0",
        "grade1": "Sahih in chain",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 945170,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845020,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1650.00",
        "babName": "If A Man Kills His Slave Or Mutilates Him, Should Retaliation Be Imposed On Him ?",
        "hadithNumber": 4502,
        "hadithText": "Narrated Qatadah:\n<p>\nThrough the same chain of narrators as mentioned before, i.e. Samurah reported the Messenger of Allah (ﷺ) as saying: If anyone castrates his slave, we shall castrate him. He then mentioned the rest of the tradition like that of Sh'ubah and Hammad.\n</p>\n<p>\nAbu Dawud said: Abu Dawud al-Tayalisi transmitted it from Hisham like the tradition of Mu'adh.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 945190,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845030,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1650.00",
        "babName": "If A Man Kills His Slave Or Mutilates Him, Should Retaliation Be Imposed On Him ?",
        "hadithNumber": 4503,
        "hadithText": "Qatadah transmitted the tradition mentioned above through a chain of narrators like that of Shu'bah. This version adds: Then al-Hasan forgot this tradition, and he used to say: A free man is not to be killed for a slave.</b>",
        "bookID": "40.0",
        "grade1": "Sahih Maqtu'",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 945200,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845050,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1651.00",
        "babName": "Al-Qasamah",
        "hadithNumber": 4505,
        "hadithText": "Narrated Sahl b. Abi Hathmah and Rafi' b. Khadij:\n<p>\nMuhayyasah b. Mas'ud and 'Abd Allah b. Sahl came to Khaibar and parted (from each other) among palm trees. 'Abd Allah b. Sahl was killed. The Jews were blamed (for the murder). 'Abd al-Rahman b. Sahl and Huwayyasah and Muhayyasah, the sons of his uncle (Mas'ud) came to the Prophet (ﷺ). 'Abd al-Rahman, who was the youngest, spoke about his brother, but the Messenger of Allah (ﷺ) said to him: (Respect) the elder, (respect) the elder or he said: Let the eldest begin. They then spoke about their friend and the Messenger of Allah (ﷺ) said: Fifty of you should take oaths regarding a man from them (the Jews) and he should be entrusted (to him) with his rope (in his neck). They said: It is a matter which we did not see. How can we take oaths ? He said: The Jews exonerate themselves by the oaths of fifty of them. They said: Messenger of Allah! they are a people who are infidels. So the Messenger of Allah (ﷺ) paid them bloodwit himself. Sahl said: Once I entered the resting place of their camels, and the she-camel struck me with her lef. Hammad said this or (something) similar to it.\n</p>\n<p>\nAbu Dawud said: Another version transmitted by Yahya b. Sa'id has: Would you swear fifty oaths and make you claim regarding your friend or your slain man ? Bishr, the transmitter, did mention blood. 'Abdah transmitted it from Yahya as transmitted by Hammad. Ibn 'Uyainah has also transmitted it from Yahya, and began with his words: The Jew will exonerate themselves by fifty oaths which they will swear. He did not mention the claim.\n</p>\n<p>\nAbu Dawud said: This is a misunderstanding on the part of Ibn 'Uyainah.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 945230,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845060,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1651.00",
        "babName": "Al-Qasamah",
        "hadithNumber": 4506,
        "hadithText": "Sahl b. Abi Hathmah and some senior men of the tribe told that 'Abd Allah b. Abi Sahl and Muhayyasah came to Khaibar on account of the calamity (i.e. famine) that befall them. Muhayyasah came and told the 'Abd Allah b. Sahl had been killed and thrown in a well or stream. He hen came to the Jews and said: I swear by Allah, you have killed him. They said: We swear by Allah, we have not killed him. He then proceeded and came to his tribe  and mentioned this to them. Then he, his brother Huwayyasah, who was older to him, and 'Abd al-Rahman b. Sahl came forward (to the Prophet). Muhayyasah began to speak. It was he who was at Khaibar. The Messenger of Allah (ﷺ) then said to him: Let the eldest (speak), let the eldest (speak), meaning age. So Huwayyasah spoke, and after him Muhayyasah spoke. The Messenger of Allah (ﷺ) then said: They should either pay the bloodwit for you friend or they should be prepared for war. So the Messenger of Allah (ﷺ) wrote to them about it. They wrote (in reply): We swear by Allah, we have not killed him. The Messenger of Allah (ﷺ) then said to Huwayyasah, Muhayyasah and 'Abd al-Rahman: Will you take an oath and thus have the claim to the blood of your friend ? They said: No. He (the Prophet) said: The Jews will then take an oath. They said: They are not Muslims. Then the Messenger of Allah (ﷺ) himself paid the bloodwit. The Messenger of Allah (ﷺ) then sent on one hundred she-camels and they were entered in their house. Sahl said: A red she-camel of them gave me a kick.</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 945240,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845080,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1652.00",
        "babName": "Not Retaliating On The Basis Of Qasamah",
        "hadithNumber": 4508,
        "hadithText": "Narrated Bashir b. Yasar:\nThat a man of the Ansar called Sahl b. Abi Hathmah told him that some people of his tribe went to Khaibar and separated there. They found one of them slain. They said to those with whom they had found him: You have killed our friend. They replied: We did not kill him, nor do we know the slayer. We (the people of the slain) then went to the Prophet of Allah (ﷺ). He said to them: Bring proof against the one who has slain him. They replied: We have no proof. He said: Then they will take an oath for you. They said: We do not accept the oaths of the Jews. The Messenger of Allah (ﷺ) did not like no responsibility should be fixed for his blood. So he himself paid his bloodwit consisting of one hundred camels of sadaqah (i.e. camels sent to the Prophet as zakat).</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 945260,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845100,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1652.00",
        "babName": "Not Retaliating On The Basis Of Qasamah",
        "hadithNumber": 4510,
        "hadithText": "Narrated 'Abd al-Rahman b. Bujaid:\nI swear by Allah, Sahl had a misunderstanding about this tradition. The Messenger of Allah (ﷺ) wrote to the Jews: A slain man has been found amongnst you, so pay his bloodwit. They wrote (to him): Swearing by Allah fifty oaths, we neither killed him nor do we know his slayer. He said: Then the Messenger of Allah (ﷺ) himself paid his bloodwit which consisted of one hundred she-camels.</b>",
        "bookID": "40.0",
        "grade1": "Munkar",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 945280,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845120,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1653.00",
        "babName": "Retaliation On The Killer",
        "hadithNumber": 4512,
        "hadithText": "Narrated Anas:\nA girl was found with her head crushed between two stones. She was asked: Who has done this to you ? Is it so and so ? Is it so and so, until a Jew was named, and she gave a sign with her head. The Jew was caught ad he admitted. So the Prophet (ﷺ) gave command that his head should be crushed with stones.</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 945300,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845130,
        "collection": "abudawud",
        "volumeNumber": 2,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1653.00",
        "babName": "Retaliation On The Killer",
        "hadithNumber": 4513,
        "hadithText": "Narrated Anas:\n<p>\nA Jew killed a girl of the Ansar for her ornaments. He then threw her in a well, and crushed her head with stones. He was then arrested and brought to the Prophet (ﷺ). He ordered regarding him that he should be stoned to death. He was then stoned till he died.\n</p>\n<p>\nAbu Dawud said: It has been transmitted by Ibn Juraij from Ayyub in a similar way.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 945310,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845140,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1653.00",
        "babName": "Retaliation On The Killer",
        "hadithNumber": 4514,
        "hadithText": "Narrated Anas:\nA girl was wearing silver ornaments. A Jew crushed her head with a stone. The Messenger of Allah (ﷺ) entered upon her when she had some breath. He said to her: Who has killed you ? Had so and so killed you ? She replied: No, making a sign with her head. He again asked: Who has killed you ? Has so and so killed you ? She replied: No, making a sign with her head. He again asked: Has so and so killed you ? She said: Yes, making sign with her head. The Messenger of Allah (ﷺ) commanded regarding him, and he was killed between two stones.</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 945320,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845170,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1655.00",
        "babName": "If A Man Finds A Man With His Wife, Should He Kill Him ?",
        "hadithNumber": 4517,
        "hadithText": "Narrated Abu Hurairah:\nThat Sa'd b. 'Ubadah said: Messenger of Allah! If a man finds a man with his wife, should he kill him ? The Messenger of Allah (ﷺ) said: No. Sa'd : Why not, by Him who has honoured you with truth ? The Prophet (ﷺ) said: Listen to what your chief is saying. The narrator 'Abd al-Wahhab said: (Listen) to what Sa'd is saying.</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 945350,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845180,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1655.00",
        "babName": "If A Man Finds A Man With His Wife, Should He Kill Him ?",
        "hadithNumber": 4518,
        "hadithText": "Narrated Abu Hurairah:\nThat Sa'd b. 'Ubadah said to the Messenger of Allah (ﷺ) : What do you think if I find with my wife a man ; should I give him some time until I bring four witnesses ?\" He said: \"Yes\".</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 945360,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845200,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1657.00",
        "babName": "Retaliation Without A Weapon Of Iron",
        "hadithNumber": 4520,
        "hadithText": "Narrated Anas:\nA girl was found with her head crushed between two stoned. She was asked: Who did it with you ? Was it so and so ? Was it so and so ? Until the Jew was named. Thereupon she gave a sign with her head. The Jew was arrested and he admitted. So the Prophet (ﷺ) gave command that his head should be crushed with stones.</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 945380,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845240,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1660.00",
        "babName": "One Who Is Killed In A Fight Among People And His Killer Is Not Known",
        "hadithNumber": 4524,
        "hadithText": "Tawus, in his version said: If anyone is killed. Ibn 'Ubaid in his version said: The Messenger of Allah (ﷺ) said: If anyone is killed in error (blindly) when people are throwing stones, or by beating with whips, or striking with a stick, it is accidental and the compensation for accidental death is due. But if anyone is killed deliberately, retaliation is due. Ibn 'Ubaid in his version: Retaliation of the man is due. The agreed version then goes: If anyone comes in (between the two parties) to prevent it, Allah's curse and anger will rest on him, and neither supererogatory nor obligatory acts will be accepted from him. The version of the tradition of Sufyan is more perfect.</b>",
        "bookID": "40.0",
        "grade1": "Sahih li ghairih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 945420,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845250,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1660.00",
        "babName": "One Who Is Killed In A Fight Among People And His Killer Is Not Known",
        "hadithNumber": 4525,
        "hadithText": "Narrated Ibn 'Abbas:\nThe Messenger of Allah (ﷺ) as saying: He then mentioned the rest of the tradition to the same effect as mentioned by Sufyan.</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 945430,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845320,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1662.00",
        "babName": "Diyah For A Mistaken Killing That Appears Purposeful",
        "hadithNumber": 4532,
        "hadithText": "The tradition mentioned above has also been transmitted by Khalid through the same chain of narrators to the same effect.</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 945510,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 845330,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1662.00",
        "babName": "Diyah For A Mistaken Killing That Appears Purposeful",
        "hadithNumber": 4533,
        "hadithText": "<p>\nThe tradition mentioned above has also been transmitted by Ibn 'Umar from the Prophet (ﷺ) to the same effect. This version has: The Messenger of Allah (ﷺ) addressed on the day of Conquest, or he said: On the conquest of Mecca on the ladder of the House or of the Ka'bah.\n</p>\n<p>\nAbu Dawud said: In a similar way of Ibn 'Uyainah also transmitted it from 'Ali b. Zaid, from al-Qasim b. Rab'iah, from Ibn 'Umar, from the Prophet (ﷺ) ; and Ayyub al-Sukhtiyani transmitted it from al-Qasim b. Rabi'ah from 'Abd Allah b. 'Amr like the tradition of Khalid. Hammad b. Salamah also transmitted it from 'Ali b. Zaid, from Ya'qub al-Sadusi, on the authority of 'Abd Allah b. 'Amr from the Prophet (ﷺ). The statements of Zaid and of Abu Musa are similar to the tradition of the Prophet (ﷺ) and to the tradition of 'Umar (Allah be pleased with him.)\n</p></b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 945520,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845340,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1662.00",
        "babName": "Diyah For A Mistaken Killing That Appears Purposeful",
        "hadithNumber": 4534,
        "hadithText": "Narrated Mujahid:\n'Umar gave judgement that bloodwit for quasi-intentional murder should be thirty she-camels in their fourth year, thirty she-camels in their fifth  year, and forty pregnant she-camels in their sixth year up to the ninth</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 945530,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 845350,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1662.00",
        "babName": "Diyah For A Mistaken Killing That Appears Purposeful",
        "hadithNumber": 4535,
        "hadithText": "Narrated 'Abd Allah (b. Mas'ud):\nThe bloodwit for unintentional murder which resembles intentional is twenty-five she camels which entered their fourth year, twenty five she-camels which had entered their fifth year, twenty five she-camels which had entered their third year, and twenty five camels which had entered their second year.</b>",
        "bookID": "40.0",
        "grade1": "Da'if in chain",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 945540,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845360,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1662.00",
        "babName": "Diyah For A Mistaken Killing That Appears Purposeful",
        "hadithNumber": 4536,
        "hadithText": "Narrated 'Ali:\nThe bloodwit for unintentional murder is in four parts: twenty five she-camels in their fourth year, twenty five she-camels in their fifth year, twenty five she-camels in their third year, and twenty twenty five she-camels in their second year.</b>",
        "bookID": "40.0",
        "grade1": "Da'if in chain",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 945550,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845370,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1662.00",
        "babName": "Diyah For A Mistaken Killing That Appears Purposeful",
        "hadithNumber": 4537,
        "hadithText": "Narrated 'Uthman b. 'Affan and Zaid b. Thabit:\nThe bloodwit for what resembled intentional murder should be forty pregnant she-camels in their fifth year, thirty she-camels in their fourth year, and thirty she-camels in their third year. The bloodwit for unintentional murder is thirty she-camels in their fourth year, thirty she-camels in their third year, and twenty she-camels in their second year.</b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 945560,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845380,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1662.00",
        "babName": "Diyah For A Mistaken Killing That Appears Purposeful",
        "hadithNumber": 4538,
        "hadithText": "Narrated Zaid b. Thabit:\nAbout the bloodwit for quasi-intentional murder..... He then mentioned a similar tradition as mentioned above.</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 945570,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845390,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1663.00",
        "babName": "The Ages Of Camels",
        "hadithNumber": 4539,
        "hadithText": "Narrated Abu Dawud:\n<p>\nAbu Dawud and others have said: When a she-camel enters fourth year, the female is called hiqqah, and the male is called hiqq, for it deserves that it should be loaded and ridden. When a camel enters its fifth year, the male is called Jadha' and the female is called Jadha'ah. When it enters its sixth year, and sheds its front teeth, it is called thani (male) and thaniyyah (female). When it enters its seventh year, it is called raba' and raba'iyyah. When it enters its ninth year and cuts its canine teeth, it is called bazil. When it enters its tenth year, it is called mukhlif. Then there is no name for it, but is called bazil'am and bazil'amain, and mukhlif'am and mukhlif'amain, upto any year it increases. Nad d. Shumail said: Bint makhad is a she-camel of one year, and bin labun is s she-camel of two years, hiqqah is a she-camel of three years, jadha'ah is a she-camel of four years, thani is a camel of five years, raba' is a camel of six years, sadis is a camel of seven years, and bazil is a camel of eight years.\n</p>\n<p>\nAbu Dawud said: Abu Hatim and al-Asma'i said: Al-Jadhu'ah is a time when no tooth is growing. Abu Hatim said: Some of them said: When it sheds its teeth between front and canine teeth, it is called raba' and when it sheds its front teeth, it is called thani. Abu 'Ubaid said: When it becomes pregnant, it is called khalifah, and it remains khalifah for ten months; when it reaches ten months, it is called 'ushara', Abu Hatim said: When it shed its front teeth, it is called thani and when it sheds its teeth between front and canine teeth it is called raba'.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih in chain",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 945580,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845420,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1664.00",
        "babName": "Diyah For Lost Limbs",
        "hadithNumber": 4542,
        "hadithText": "Narrated Ibn 'Abbas:\nThe Messenger of Allah (ﷺ) as saying: This and that are equal, that is, the thumb and the little finger.</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 945610,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845510,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1665.00",
        "babName": "The Diyah For A Fetus",
        "hadithNumber": 4551,
        "hadithText": "Narrated Al-Mughirah b. Shu'bah:\nA man of Hudhail has two wives. One of them struck her fellow-wife with a tent-pole and killed her and her unborn child. They brought the dispute to the Prophet (ﷺ). One of two men said: How can we pay bloodwit for the one who did not make a noise, or ate, nor drank, nor raised his voice ? He (the Prophet) asked: Is it rhymed prose like that of bedouin? He gave judgement that a male or female slave of the best quality should be paid in compensation, and he fixed it to be paid by woman's relatives on her father's side.</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 945710,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845520,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1665.00",
        "babName": "The Diyah For A Fetus",
        "hadithNumber": 4552,
        "hadithText": "<p>\nThe tradition mentioned above has also been transmitted by Mansur through a different chain of narrators and to the same effect. This version adds: The Prophet (ﷺ) fixed the bloodwit for the slain woman to be paid by the relatives of the woman who had slain her, on the father's side.\n</p>\n<p>\nAbu Dawud said: In a similar way it has been transmitted by al-Hakam from Mujahid from al-Mughirah.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 945720,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845530,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1665.00",
        "babName": "The Diyah For A Fetus",
        "hadithNumber": 4553,
        "hadithText": "<p>\nNarrated Al-Miswar b. Makhramah:\n</p>\n<p>\n'Umar consulted the people about the compensation of abortion of woman. Al-Mughirah b. Shu'bah said: I was present with the Messenger of Allah (ﷺ) when he gave judgement that a male or female slave should testify you. So he brought Muhammad b. Maslamah to him. Harun added: He then testified him.\n</p>\n<p>\nImlas means a man striking the belly of his wife.\n</p>\n<p>\nAbu Dawud said: I have been informed that Abu 'Ubaid said: It (abortion) is called imlas because the woman causes it to slip before the time of delivery. Similarly, anything which slips from the hand or from some other thing is called malasa (slipped).\n</p></b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 945730,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 845540,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1665.00",
        "babName": "The Diyah For A Fetus",
        "hadithNumber": 4554,
        "hadithText": "<p>\nThe tradition mentioned above has also been transmitted by 'Umar through a different chain of narrators to the same effect.\n</p>\n<p>\nAbu Dawud said: Hammad b. Zaid and Hammad b. Salamah transmitted it from Hisham b. 'Arubah on his father's authority who said that 'Umar said...\n</p></b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 945740,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 845590,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1665.00",
        "babName": "The Diyah For A Fetus",
        "hadithNumber": 4559,
        "hadithText": "Narrated Abu Hurairah:\nTwo women of Hudhail fought together and one of them threw a stone at the other and killed her. They brought their dispute to the Messenger of Allah (ﷺ) who gave judgement that a male or female slave of the best quality should be given as compensation for her unborn child, and he fixed it to be paid by the woman's relatives on the father's side. He made her sons and those who were with them her heirs. Hamal b. Malik b. al-Nabighah al-Hudhali said: Messenger of Allah ! how should I be fined for one who has not drunk, or eaten or spoken, or raised his voice? - adding that compensation is not to be paid for such (an offense). The Messenger of Allah (ﷺ) said: This man simply belong to the soothsayers on account of his rhymed prose which he has used.</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 945790,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845600,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1665.00",
        "babName": "The Diyah For A Fetus",
        "hadithNumber": 4560,
        "hadithText": "Narrated Abu Hurairah:\nAbout this story: Then the woman, against whom he decided that a male or female should be paid for her, died. The Messenger of Allah (ﷺ) then gave judgement that her sons will inherit from her, and the bloodwit should be paid by her relatives on the father's side.</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 945800,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845630,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1665.00",
        "babName": "The Diyah For A Fetus",
        "hadithNumber": 4563,
        "hadithText": "Narrated Al-Sha'bi:\n<p>\nThe price of a male or a female slave is five hundred dirhams.\n</p>\n<p>\nAbu Dawud said: Rabi'ah said: The price of a male or a female slave is fifty dinars.\n</p></b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 945830,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 845670,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1668.00",
        "babName": "When One Man Attacks Another And He Defends Himself",
        "hadithNumber": 4567,
        "hadithText": "Narrated Safwan b. Ya'la:\nOn this father's authority, said: A servant of mine fought with a man and bit his hand and he drew away his hand. (One of) his front teeth fell out. So he came to the Prophet (ﷺ) who imposed no retaliation for his tooth, saying: Do you intend that he leaves his hand in your mouth so that you crunch it like a male camel ? He said: Ibn Abi Mulaikah told me on the authority of his grandfather that Abu Bakr (ra) imposed no retaliation on him for it, saying: May his tooth go away!</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 945870,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845680,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1668.00",
        "babName": "When One Man Attacks Another And He Defends Himself",
        "hadithNumber": 4568,
        "hadithText": "The tradition mentioned above has also been transmitted by Ya'la b. Umayyah through a different chain of narrators. This version has: The Prophet (ﷺ) said to the man bit him: If you wish that you give him control over your hand and he bites it, and then you drive it away from his mouth (you may do it). He imposed no retaliation for his teeth.</b>",
        "bookID": "40.0",
        "grade1": "Sahih in chain",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 945880,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845720,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1670.00",
        "babName": "The Diyah For Unintentional Killing That Appears Intentional",
        "hadithNumber": 4572,
        "hadithText": "The tradition mentioned above has also been transmitted by Khalid with a different chain of narrators to the same effect.</b>",
        "bookID": "40.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 945920,
        "last_updated": "2012-10-22 00:16:57"
    },
    {
        "englishURN": 845760,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1674.00",
        "babName": "No Recompense Is Due For Al-'Ajma' (Beasts), Mines And Wells",
        "hadithNumber": 4576,
        "hadithText": "Narrated Abu Hurairah:\nThe Messenger of Allah (ﷺ) as saying: No retaliation is payable for a wound caused by a dumb animal, for a mine, and for a well. On the treasure found buried in the land there is a fifth.\n<p>\nAbu Dawud said: A dumb animal means an animal which is free and has not tether, and there is no one (as a watchman) with it. It causes harm by day and not by night.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 945960,
        "last_updated": "2012-10-22 00:29:59"
    },
    {
        "englishURN": 845780,
        "collection": "abudawud",
        "volumeNumber": 3,
        "bookNumber": 40,
        "bookName": "Types of Blood-Wit (Kitab Al-Diyat)",
        "babNumber": "1676.00",
        "babName": "Al-Qasas For A Tooth",
        "hadithNumber": 4578,
        "hadithText": "Narrated Anas bin Malik:\nAl-Rubayyi', sister of Anas b. al-Nadr, broke (one of) the front teeth of a woman. They came to the Prophet (ﷺ). He made a decision in accordance with the Book of Allah that retaliation should be taken. Anas b. al-Nadr said: I swear by Him who has sent you the truth, her front tooth will not be broken today. He replied: Anas ! Allah's decree is retaliation. But the people were agreeable to accepting a fine, so the Prophet (ﷺ) said: Among Allah's servants there are those who, if they adjured Allah, He (Allah) would consent to it.\n</p>\n<p>\nAbu Dawud said: I heard Ahmad b. Hanbal say: He was asked : How retaliation of a tooth is taken ? He said: It is broken with a file.\n</p></b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 945980,
        "last_updated": "2012-10-22 00:29:59"
    }
]