[
    {
        "englishURN": 614870,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud) From The Messenger of Allah (saws)",
        "babNumber": "1.00",
        "babName": "What Has Been Related About Those From Whom Punishment Is Not Required",
        "hadithNumber": 1423,
        "hadithText": "Narrated 'Ali:\nThat the Messenger of Allah (ﷺ) said: \"The pen has been lifted from three; for the sleeping person until he awakens, for the boy until he becomes a young man and for the mentally insane until he regains sanity.\"</b>",
        "bookID": "17.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[He said:] There is something on this topic from 'Aishah.\r\n[Abu 'Eisa said:] The Hadith of 'Ali is Hasan Gharib Hadith from this route. It has been reported from more than one route from 'Ali [from the Prophet (saws)] and some of them mentioned: \"from the boy until he has a wet dream\" and we do not know that Al-Hasan (Al-Basri) heard from 'Ali. \r\nThis Hadith has similarly been reported from 'Ata bin As-Sa'ib, from Abu Zibayn, from 'Ali [bin Abi Talib], from the Prophet (saws). It has been reported from Al-A'mash from Abu Zibyan, from Ibn 'Abbas, from 'Ali in Mawquf not Marfu' form. And this Hadith is acted upon according to the people of knowledge.\r\n[Abu 'Eisa said: Al-Hasan was alive during the time of 'Ali and he saw him but we are not aware of him hearing from him.] Abu Zibyan's name is Husain bin Jundab.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 714870,
        "last_updated": "2015-03-26 11:16:59"
    },
    {
        "englishURN": 614880,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "2.00",
        "babName": "What Has Been Related About Averting Legal Punishments",
        "hadithNumber": 1424,
        "hadithText": "Narrated 'Aishah:\nthat the Messenger of Allah (ﷺ): \"Avert the legal penalties from the Muslims as much as possible, if he has a way out then leave him to his way, for if the Imam makes a mistake in forgiving it would be better than making mistake in punishment.\"</b>",
        "bookID": "17.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 714880,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 614890,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "2.00",
        "babName": "What Has Been Related About Averting Legal Punishments",
        "hadithNumber": 1424,
        "hadithText": "(Another chain) which is similar to the narration of Muhammad bin Rabi'ah (a narrator in no.1424) but he did not narrate it in Marfu' form.</b>",
        "bookID": "17.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[He said:] There are narration on this topic from Abu Hurairah and 'Abdullah bin 'Amr. \r\n[Abu 'Eisa said:] We do not know of the Hadith of 'Aishah to be Marfu' except from the report of Muhammed bin Rabi'ah from Yazid bin Ziyad Ad-Dimashqi, from Az-Zuhri, from 'Urwah from 'Aishah, from the Prophet (saws). Waki' reported it from Yazid bin Ziyad similarly, and he did not narrate it in Marfu' form. The narrations of Waki' is more correct. Statements like this has been reported from more than one of the Companions of the Prophet (saws). Yazid bin Ziyad Ad-Dimashqi is weak in Hadith and Yazid bin Abi Ziyad Al-Kufi is more reliable than this one, and earlier.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 714890,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 614900,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "3.00",
        "babName": "What Has Been Related About Covering (The Faults Of) The Muslim",
        "hadithNumber": 1425,
        "hadithText": "Narrated Abu Hurairah:\nThat the Messenger of Allah (ﷺ) said: \"Whoever relieves a Muslim of a burden from the burdens of the world, Allah will relieve him of a burden from the burdens of the Hereafter. And whoever covers (the faults of) a Muslim, Allah will cover (his faults) for him in the world and the Hereafter. And Allah is engaged in helping the worshipper as long as the worshipper is engaged in helping his brother.\"</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[He said:] There are narrations on this topic from 'Uqbah bin 'Amir and Ibn 'Umar.\r\n[Abu 'Eisa said:] This is how the Hadith of Abu Hurairah was reported by more than one narrator; from Al-A'mash, from Abu Salih, from Abu Hurairah, from the Prophet (saws), similar to the narration of Abu 'Awanah.\r\n",
        "ourHadithNumber": 4,
        "matchingArabicURN": 714900,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 614910,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "3.00",
        "babName": "What Has Been Related About Covering (The Faults Of) The Muslim",
        "hadithNumber": 1425,
        "hadithText": "Asbat bin Muhammad reported it from Al-A'mash who said: \"It has been narrated to me from Abu Salih, from Abu Hurairah, from the Prophet (ﷺ),\" and it is similar. [It is as if this is more correct than the first narration.]\n(Another chain) for this Hadith.</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 714910,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 614920,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "3.00",
        "babName": "What Has Been Related About Covering (The Faults Of) The Muslim",
        "hadithNumber": 1426,
        "hadithText": "Narrated Ibn 'Umar:\nThat the Messenger of Allah (ﷺ) said: \"The Muslim is the brother of the Muslim, he doesn't oppress him and doesn't put him into ruin, and whoever is concerned for the needs of his brother, Allah is concerned for his needs, and whoever relieves a Muslim of a burden, Allah will relieve him of a burden from the burdens of the Day of Judgement and whoever covers (the faults of) a Muslim, Allah will cover (his faults) on the Day of Judgement.\"</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib as a narration of Ibn 'Umar.",
        "ourHadithNumber": 6,
        "matchingArabicURN": 714920,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 614930,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "4.00",
        "babName": "What Has Been Related About Prompting In Cases Of The Legal Punishments",
        "hadithNumber": 1427,
        "hadithText": "Narrated Ibn 'Abbas:\nThat the Prophet (ﷺ) said to Ma'iz bin Malik: \"Is what has reached me about you true?\" He said: \"What has reached you about me?\" He said: \"It has reached me that you had relations with the slave-maid of the family of so-and-so\" He said: \"Yes.\" So he testified four times, and he gave the order that he be stoned.</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[He said:] There is something on this topic from As-Sa'ib bin Zaid.\r\n[Abu 'Eisa said:] The Hadith of Ibn 'Abbas is a Hasan Hadith. Shu'bah reported this Hadith from Simak bin Harb, from Sa'eed bin Jubair in Mursal form without mentioning Ibn 'Abbas in it.",
        "ourHadithNumber": 7,
        "matchingArabicURN": 714930,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 614940,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "5.00",
        "babName": "What Has Been Related About Averting The Legal Punishments From The One Who Confessed If He Changes His Mind",
        "hadithNumber": 1428,
        "hadithText": "Narrated Abu Hurairah:\n\"Ma'iz Al-Aslamu came to the Messenger of Allah (ﷺ) and said that he had committed adultery, so he (ﷺ) turned away from him. Then he approached from his other side and said: '[O Messenger of Allah!] I have committed adultery.' So he turned away from him. The he came from his other side and said: 'O Messenger of Allah! I have committed adultery.' So he gave the order (for stoning) upon the fourth time. He was taken to Al-Harrah and stoned with rocks, he ran swiftly until he passed a man with a camel whip who beat him with it, and the people beat him until he died. They mentioned to the Messenger of Allah (ﷺ), that he ran upon feeling the rocks at the time of death. So the Messenger of Allah (ﷺ) said: 'Why didn't you leave him?'\"</b>",
        "bookID": "17.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan. It has been reported through more than one route from Abu Hurairah. This Hadith has been reported from Az-Zuhri, from Abu Salamah, from Jabir bin 'Abdullah from the Prophet (saws) and it is similar.",
        "ourHadithNumber": 8,
        "matchingArabicURN": 714940,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 614950,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "5.00",
        "babName": "What Has Been Related About Averting The Legal Punishments From The One Who Confessed If He Changes His Mind",
        "hadithNumber": 1429,
        "hadithText": "Narrated Jabir bin 'Abdullah:\n\"A man from the tribe of Aslam came to the Prophet (ﷺ) and confessed adultery. He turned away from him, the he confessed (again). Then he turned away from him (again) until he had testified against himself four times. So the Prophet (ﷺ) said: \"Are you insane?\" He said:\"No\" He said: \"Are you married?\" He said: \"Yes\". So he gave the order and he was stoned at the Musalla. He ran when he was stuck by the stones, and he was caught and stoned until he died. So the Messenger of Allah (ﷺ) spoke well of him but he did not perform the (funeral) Salat for him.</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih. This Hadith is acted upon according to some of the people of knowledge, the punishment is carried out for one who confesses against himself regarding adultery when he does so four times. This is the view of Ahmad and Ishaq. Some of the people of knowledge said that the punishment is carried out when he affirms it one time. This is the view of As-Shafi'i. Those who hold this view use the Hadith of Abu Hurairah and Zaid bin Khalid as proof, in which two men disputed with the Messenger of Allah (saws). One of them said: \"O Messenger of Allah! My son had unlawful sexual relations with this man's wife.\" And it is a lengthy Hadith. The Prophet (saws) said: \"O Unais! Go to this man's wife and if she confesses then stone her.\" And he did not say: \"If she confesses four times.\"",
        "ourHadithNumber": 9,
        "matchingArabicURN": 714950,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 614960,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "6.00",
        "babName": "What Has Been Related About It Being Disliked To Intercede In Legal Punishments",
        "hadithNumber": 1430,
        "hadithText": "Narrated 'Aishah:\n\"The Quraish were troubled by the affair of a woman from the tribe of Makhzum who stole. So they said: 'Who will speak about her to the Messenger of Allah (ﷺ)?' They said: 'Who can do it other than Usamah bin Zaid, the one dear to the Messenger of Allah?' So Usamah spoke with him, the Messenger of Allah (ﷺ) said: 'Do you intercede about a penalty from Allah's penalties?' Then he stood up and adressed the people saying: 'Those before you were only destroyed because they used to leave a noble person if he stole. And if a weak person stole they would establish the penalty upon him. And by Allah! If Fatimah bint Muhammad stole, then I would cut off her hand.\"</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[He said:] There are narrations on this topic from Mas'ud bin Al-Ajma' [and they call him Ibn Al-A'jam], Ibn 'Umar and Jabir.\r\n[Abu 'Eisa said:] The Hadith of 'Aishah is a Hasan Sahih Hadith. [And they call him Mas'ud bin Al-A'jam, and he narrated this Hadith.]",
        "ourHadithNumber": 10,
        "matchingArabicURN": 714960,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 614970,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "7.00",
        "babName": "What Has Been Related About Confirming Stoning",
        "hadithNumber": 1431,
        "hadithText": "'Umar bin Al-Khattab said: \"The Messenger of Allah (ﷺ) stoned, Abu Bakr stoned, and I stoned. If I didn't dislike that I add to the Book of Allah. I would have written it in the Mushaf, for I fear that there will come a people and they will not find it in the Book of Allah, so they will disbelieve in it.\"</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "He said: There is something about this from 'Ali.",
        "ourHadithNumber": 11,
        "matchingArabicURN": 714970,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 614980,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "7.00",
        "babName": "What Has Been Related About Confirming Stoning",
        "hadithNumber": 1432,
        "hadithText": "'Umar bin Al-Khattab said: \"Verily Allah sent Muhammad (ﷺ) with the truth, and he revealed the Book to him. Among what was revealed to him was the Ayah of stoning. So the Messenger of Allah (ﷺ) stoned, and we stoned after him. I fear that time will pass over the people such that someone will say 'We do not see stoning in the Book of Allah.' They will be misguided by leaving an obligation which Allah revealed. Indeed stoning is the retribution for the adulterer if he was married and the evidence has been established, or due to pregnancy, or confession.\"</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[There is something on this topic from 'Ali. Abu 'Eisa said:] This Hadith is Hasan Sahih. [It has been reported through more than one route from 'Umar bin Al-Khattab.]",
        "ourHadithNumber": 12,
        "matchingArabicURN": 714980,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 614990,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "8.00",
        "babName": "What Has Been Related About Stoning The Married Adulterer",
        "hadithNumber": 1433,
        "hadithText": "Narrated 'Ubaidullah bin 'Abdullah bin 'Uthbah:\nThat he heard from Abu Hurairah, Zaid bin Khalid, and Shibl, that they were with the Prophet (ﷺ) and two men came to him disputing. So one of them stood before him and said: \"I ask you by Allah, O Messenger of Allah! Only that you would judge between us by the book of Allah.\" So his disputant said - and he was more eloquent that him: \"I agree of O Messenger of Allah! Judge between us by the Book of Allah, and allow me to speak. My son was a servant for this man and he committed adultery with his wife. So they told me that my son was to be stoned. I paid him one hundred female sheep and a female slave. Then I met some people from the people of knowledge and they said that my son was to be lashed one hundred times, and to be banished for a year and that stoning is only for this man's wife.\" So the Prophet (ﷺ) said: \"By the One in Whose Hand is my soul! I will judge between you two by the Book of Allah. The one hundred female sheep and the female slave should be returned to you. For your son is one hundred lashes and banishment for a year. O Unais! Go to this Man's wife, and if she confesses then stone her.\" He went to her and she confessed, so he stoned her.</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 714990,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615010,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "8.00",
        "babName": "What Has Been Related About Stoning The Married Adulterer",
        "hadithNumber": 1433,
        "hadithText": "(Another chain) with similar.</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[He said:] There are narrations on this topic from Abu Bakr, 'Ubadah bin As-Samit, Abu Hurairah, Abu Sa'eed, Ibn 'Abbas, Jabir bin Samurah, Hazzal, Buraidah, Salamah bin Al-Muhabbaq, Abu Barzah, and 'Imran bin Hussain.\r\n[Abu 'Eisa said:] The Hadith of Abu Hurairah and Zaid bin Khalid is a Hasan Sahih Hadith. This is how it was reported by Malik bin Anas, Ma'mar and others from Az-Zuhri, from 'Ubaidullah bin 'Abdullah [bin 'Utbah], from Abu Hurairah, and Zaid bin Khalid, from the Prophet (saws), they also reported with this chain from the Prophet (saws) that he said: \"If a slave commits adultery lash her, if she commits adultery the fourth time sell her, even for a piece of twisted rope.\" Sufyan bin 'Uyainah reported from Az-Zuhri, from 'Ubaidullah, from Abu Hurairah, Zaid bin Khalid, and Shibl, and they saud: \"We were with the Prophet (saws).\" This is how Ibn 'Uyainah repoted the two Ahadith, from Abu Hurairah, Zaid bin Khalid, and Shibl. But Ibn 'Uyainah's narration is mistaken; Sufyan bin 'Uyainah made the mistake of entering one Hadith in another Hadith. What is correct is what was reported by [Muhammad bin Al-Walid] Az-Zubaidi, Yunus bin Yazid, and the son of Az-Zuhri's brother, from Az-Zuhri, from 'Ubaidullah, from Abu Hurairah and Zaid bin Khalid, from the Prophet (saws), that he said: \"When the female slave commits adultery [then lash her].\" And Az-Zuhri reported from 'Ubaidullah from Shibl bin Khalid, from 'Abdullah bin Malik Al-Awsi, from the Prophet (saws), that he said: \"When the female slave commits adultery.\" And this is what is correct according to the people of Hadith. Shibl bin Khalid did not see the Prophet (saws), Shibl only reported it from 'Abdullah bin Malik Al-Awsi, from the Prophet (saws). This is what is correct, and the narration of Ibn 'Uyainah is not preserved. It was related that he said: \"Shibl bin Hamid\" and this is a mistake, he is only Shibl bin Khalid, and he is also called Shibl bin Khulaid.",
        "ourHadithNumber": 15,
        "matchingArabicURN": 715011,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615000,
        "collection": "tirmidhi",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "8.00",
        "babName": "What Has Been Related About Stoning The Married Adulterer",
        "hadithNumber": 1433,
        "hadithText": "(Another chain) with similar.</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 715000,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615030,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "8.00",
        "babName": "What Has Been Related About Stoning The Married Adulterer",
        "hadithNumber": 1434,
        "hadithText": "Narrated 'Ubadah bin As-Samit:\n\"The Messenger of Allah (ﷺ) said: 'Take from me. For Allah has a way made for them : For the married person who commits adultery with a married person is one hundred lashes, then stoning. And for the virgin who commits adultery with a virgin is one hundred lashes and banishment for a year.\"</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih. This is acted upon according to some of the people of knowledge among the Companions of the Prophet (saws). Among them were 'Ali bin Abi Talib, Ubayy bin Ka'b, 'Abdullah bin Mas'ud, and others. They said the married is lashed and stoned. This was followed by some of the people of knowledge, and it is the view of Ahmad and Ishaq. Some of the people of knowledge among the Companions of Prophet (saws) - among them were Abu Bakr and others - said that the married person is only stoned, not lashed. Similar to this has been reported from the Prophet (saws) in a Hadith other than this one, in the story if Ma'iz and others, in which he ordered stoning and did not order that he be lashed before stoning. This is acted upon to some of the people of knowledge. It is the view of Sufyan Ath-Thawri, Ibn Al-Mubarak, Ash-Shafi'i, and Ahmad. ",
        "ourHadithNumber": 16,
        "matchingArabicURN": 715030,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615040,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "9.00",
        "babName": "Something Else About That Refraining From Stoning The Pregnant Woman Until She Gives Birth ",
        "hadithNumber": 1435,
        "hadithText": "Narrated 'Imran bin Husain:\n\"A woman from Juhainah confessed before the Prophet (ﷺ) that she had committed adultery, and she said: 'I am pregnant.' So the Prophet (ﷺ) called for her guardian and said: 'Be good to her and if she gives birth to her child then tell me.' So he did so, and then he (ﷺ) gave the order that her clothes be bound tightly around her. Then he ordered her to be stoned and she was stoned. Then he performed (funeral) Salat for her. So 'Umar bin Al-Khattab said to him: 'O Messenger of Allah! You stoned her then you prayed for her?!' He said: 'She has repented a repentance that, if distributed among seventy of the people of Al-Madinah, it would have sufficed them. Have you ever seen something more virtuous than her sacrificing herself for the sake of Allah?'\"</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is [Hasan] Sahih.",
        "ourHadithNumber": 17,
        "matchingArabicURN": 715040,
        "last_updated": "2021-04-20 00:42:57"
    },
    {
        "englishURN": 615050,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "10.00",
        "babName": "What Has Been Related About Stoning The People Of The Book",
        "hadithNumber": 1436,
        "hadithText": "Narrated Ibn 'Umar:\nThat the Messenger of Allah (ﷺ) stoned a Jew and Jewess.</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] There are long story in this Hadith, and this Hadith is Hasan Sahih.",
        "ourHadithNumber": 18,
        "matchingArabicURN": 715050,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615060,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "10.00",
        "babName": "What Has Been Related About Stoning The People Of The Book",
        "hadithNumber": 1437,
        "hadithText": "Narrated Jabir bin Samurah:\nThat the Prophet (ﷺ) stoned a Jew and a Jewess.</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "He said: There are narrations on this topic from Ibn 'Umar, Al-Bara', Jabir, Ibn Abi Awfa, 'Abdullah bin Al-Harith bin Jaz', and Ibn 'Abbas.\r\n[Abu 'Eisa said:] The Hadith of Jabir bin Samurah is a Hasan Sahih Gharib Hadith. This is acted upon according to most of the people of knowledge, they said that when the people of Book dispute and they bring their cases to the Muslim judge, then he judges between them according to the Book and the Sunnah with the laws of (Shariah) the Muslims. This is the view of Ahmad and Ishaq. Some of them said that the punishment of adultery is not carried out on them. But the first view is more correct.",
        "ourHadithNumber": 19,
        "matchingArabicURN": 715060,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615070,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "11.00",
        "babName": "What Has Been Related About Banishment",
        "hadithNumber": 1438,
        "hadithText": "Narrated Ibn 'Umar:\nThat the Messenger of Allah (ﷺ) lashed and banished, Abu Bakr lashed and banished, and 'Umar lashed and banished.</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[He said:] There are narrations on this topic from Abu Hurairah, Zaid bin Khalid, and 'Ubadah bin As-Samit.\r\n[Abu 'Eisa said:] The Hadith of Ibn 'Umar is Gharib Hadith. It was reported by more than one narrator from 'Abdullah bin Idris in Marfu' form.",
        "ourHadithNumber": 20,
        "matchingArabicURN": 715070,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615080,
        "collection": "tirmidhi",
        "volumeNumber": 1,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "11.00",
        "babName": "What Has Been Related About Banishment",
        "hadithNumber": 1438,
        "hadithText": "Some of them reported this Hadith from 'Ubaidullah, from Nafi', from Ibn 'Umar: that Aby Bakr lashed and banished, and that 'Umar lashed and banished.</b>",
        "bookID": "17.0",
        "grade1": null,
        "grade2": "",
        "comments": "This was narrated to us by Abu Al-Ashajj( who said): \"'Abdullah bin Idris narrated to us\" and this is how this Hadith was reported in other narrations from Ibn Idris, from 'Ubaidullah bin 'Umar and it is similar to this. Similarly; Muhammad bin Ishaq reported from Nafi', from Ibn 'Umar, that Abu Bakr lashed and banished, and 'Umar lashed and banished. And he did not mention about the Prophet (saws) in it. It is correct that the Prophet (saws) banished. It was reported by Abu Hurairah, Zaid bin Khalid, 'Ubadah bin As-Samit and other from the Prophet (saws).\r\nThis is acted upon according to the people of knowledge among the Companions of the Prophet (saws). Among them Abu Bark, 'Umar, 'Ali, Ubayy bin Ka'b, 'Abdullah bin Mas'ud, Abu Dharr and others. Similarly has been reported from more than one of the Fuqaha from Tabi'in. This is the view of Ath-Thawri, Malik bin Anas, 'Abdullah bin Al-Mubarak, Ash-Shafi'i, Ahmad, and Ishaq.",
        "ourHadithNumber": 21,
        "matchingArabicURN": 715080,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615090,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "12.00",
        "babName": "What Has Been Related About: The Legal Punishments Are Atonement For Those Who Recieve Them",
        "hadithNumber": 1439,
        "hadithText": "Narrated 'Ubadah bin As-Samit:\n\"We were with the Prophet (ﷺ) [in a gathering] and he said: 'Pledge to me that you will not associate [anything as] partners with Allah, and that you will not steal nor commit adultery.' He recited to them the Ayah. (And he said:)'Whoever among you dies, then this reward is with Allah, and whoever among you does some of this and then he is punished, it is atonement for him. And whoever does some of this and Allah covers it for him, then it is up to Allah; if He wills, He will punish them, and if He wills, He will forgive him.'\"</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[He said:] There are narration on this topic from 'Ali, Jarir bin 'Abdullah, and Khuzaimah bin Thabit.\r\n[Abu 'Eisa said:] The Hadith of 'Ubadah bin As-Samit is Hasan Sahih Hadith. Ash-Shafi'i said: \"Regarding this topic - that the legal punishments serve as atonement for those who recieve them - I have not heard anything more appropriate than this Hadith.\" Ash-Shafi'i said: \"It is recommended for anyone who suffers to commit a sin which Allah conceals for him, that he too conceal it, and repent for whatever is between him and his Lord.\" Similarly it has been reported from Abu Bakr and 'Umar, that they ordered a man to cover (the sin he committed).",
        "ourHadithNumber": 22,
        "matchingArabicURN": 715090,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615100,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "13.00",
        "babName": "What Has Been Related About Establishing Legal Punishments Upon The Slave Girl",
        "hadithNumber": 1440,
        "hadithText": "Narrated Abu Hurairah:\nThat the Messenger of Allah (ﷺ) said: \"If one of your slave girl commits illegal sexual intercourse, then whip her three times according to the Book of Allah, and if she does it again then sell her, even if it is for a rope made of hair.\"</b>",
        "bookID": "17.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[He said:] There are narrations on this topic from 'Ali, Abu Hurairah, Zaid bin Khalid, and Shibl - from 'Abdullah bin Malik Al-Awsi.\r\nThe Hadith of Abu Hurairah is a Hasan Sahih Hadith. It has been reported from him through other routes, and this is acted upon according to some of the people of knowledge among the Companions of Prophet (saws) and others. They held the view that a man could implement the legal punishments upon his slaves without resorting to the Sultan. This is the view of Ahmad and Ishaq. Some of them said that he has to bring them to the Sultan, and he may not implement the legal punishments himself. But the first view is more correct.",
        "ourHadithNumber": 23,
        "matchingArabicURN": 715100,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615110,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "13.00",
        "babName": "What Has Been Related About Establishing Legal Punishments Upon The Slave Girl",
        "hadithNumber": 1441,
        "hadithText": "Narrated Abu 'Abdur-Rahman As-Sulami:\n\"Ali gave a Khutbah, and said: 'O people, establish the penalties upon your slaves, those married from them and those unmarried. A slave girl of the Prophet (ﷺ) committed illegal sexual intercourse so he ordered me to whip her. I went to her and she was just experiencing her post-natal bleeding, so I feared that if I were to whip her I would kill her' - or he said: 'She would die' - 'so I went to the Messenger of Allah (ﷺ) and I told that to him. So he said: 'You did well.'\"</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is [Hasan] Sahih. As-Suddi's (a narrator in this chain) name is Isma'il bin 'Abdur-Rahman, and he was one of the Tabi'in. He heard from Anas bin Malik, and saw Husain bin 'Ali bin Abi Talib, may Allah be pleased with him.",
        "ourHadithNumber": 24,
        "matchingArabicURN": 715110,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615120,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "14.00",
        "babName": "What Has Been Related About Legal Punishment For The Drunkard",
        "hadithNumber": 1442,
        "hadithText": "Narrated Abu Sa'eed Al-Khudri:\nThat the Messenger of Allah (ﷺ) implemented the penalty by beating forty times, with two shoes - Mis'ar (one of the narrators) said: \"It think it was for wine.\"</b>",
        "bookID": "17.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[He said:] There are narrations on this topic from 'Ali, 'Abdur-Rahman bin Azhar, Abu Hurairah, As-Sa'ib, Ibn 'Abbas, and 'Uqbah bin Al-Harith.\r\n[Abu 'Eisa said:] The Hadith of Abu Sa'eed is a Hasan Hadith. Abu As-Siddiq An-Naji's name is Bakr bin 'Amr and they also call him Bakr bin Qais.",
        "ourHadithNumber": 25,
        "matchingArabicURN": 715120,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615130,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "14.00",
        "babName": "What Has Been Related About Legal Punishment For The Drunkard",
        "hadithNumber": 1443,
        "hadithText": "Narrated Anas:\nThat a man who had drunk wine was brought to the Prophet (ﷺ), so he beat him about forty times with two stalks of a palm tree. So Abu Bakr did similarly, and by the time 'Umar became Khalifah he sought council from the people. And 'Abdur-Rahman bin 'Awf said: 'I see that the lightest penalty is eighty lashes,' so 'Umar ordered that.</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] The Hadith of Anas is Hasan Sahih Hadith. This is acted upon according to the people of knowledge among the Companions of Prophet (saws) and others. The punishment for intoxication is eighty (lashes).",
        "ourHadithNumber": 26,
        "matchingArabicURN": 715130,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615140,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "15.00",
        "babName": "What Has Been Related About: Whoever Drinks Wine Then Lash Him, And Whoever Does It A Fourth Time, Then Kill Him",
        "hadithNumber": 1444,
        "hadithText": "Narrated Mu'awiyah:\nThat the Messenger of Allah (ﷺ) said: \"Whoever drinks wine, then lash him. If he returns to it, then on the fourth time kill him.\"</b>",
        "bookID": "17.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[He said:] There are narrations on this topic from Abu Hurairah, Ash-Sharid, Shurahbil bin Aws, Jarir, Abu Ar-Ramad Al-Balawi, and 'Abdullah bin 'Amr.\r\n[Abu 'Eisa said:] The Hadith of Mu'awiyah was also reported like this by Ath-Thawri, from 'Asim, from Abu Salih, from Mu'awiyah, from the  Prophet (saws). Ibn Juraij and Ma'mar reported it from Suhail bin Abi Salih, from his father, from Abu Hurairah from the Prophet (saws). [He said:] I heard Muhammad saying: \"The Hadith of Abu Salih from Mu'awiyah from the Prophet (saws) about this topic is more correct than the Hadith of Abu Salih from Abu Hurairah from the Prophet (saws). This was only the earlier order then it was abrogated later.\" This is what was reported from Muhammad bin Ishaq, from Muhammad bin Al-Munkadir, from Jabir bin 'Abdullah, from the Prophet (saws) who said: \"Whoever drinks wine, then lash him, if he returns to it, then on the fourth time kill him.\" He said: \"Then a man who had been drinking was brought to Prophet (saws) a forth time, so he beat him, he did not kill him.\" Similar was reported by Az-Zuhri from Qabisah bin Dhu'aib from the Prophet (saws), he (Qabisah) said: \"so the order to kill was lifted, and that was granted favor (from the Law-Giver).\"",
        "ourHadithNumber": 27,
        "matchingArabicURN": 715140,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615150,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "16.00",
        "babName": "What Has Been Related About: For How Much (Wealth) Is The Thief's Hand Cut Off ?",
        "hadithNumber": 1445,
        "hadithText": "Narrated 'Aishah:\nThat the Prophet (ﷺ) used to cut the hand for a fourth of a Dinar and beyond that.</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] The Hadith of 'Aishah is a Hasan Sahih Hadith. This Hadith is been reported through other routes from 'Amrah, from 'Aishah in Marfu' form. Some of them reported it from 'Amrah, from 'Aishah in Mawquf form.",
        "ourHadithNumber": 28,
        "matchingArabicURN": 715150,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615160,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "16.00",
        "babName": "What Has Been Related About: For How Much (Wealth) Is The Thief's Hand Cut Off ?",
        "hadithNumber": 1446,
        "hadithText": "Narrated Ibn 'Umar:\n\"The Messenger of Allah (ﷺ) cut the hand for a shield worth three Dirham.\"</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[He said:] There are narrations on this topic from Sa'd, 'Abdullah bin 'Amr, Ibn 'Abbas, Abu Hurairah, and Ayman.\r\n[Abu 'Eisa said:] The Hadith of Ibn 'Umar is a Hasan Sahih Hadith. This is acted upon according to some of the people of knowledge among the Companions of the Prophet (saws) and others. Among them were Abu Bakr As-Siddiq who cut for five Dirham. It has been reported that 'Uthman and 'Ali cut for a fourth of a Dinar. It has been reported that Abu Hurairah and Abu Sa'eed said that the hand is cut off for five Dirham. This is acted upon according to some of the Fuqaha' among the Tabi'in, it is the view of Malik bin Anas, As-Shafi'i, Ahmad, and Ishaq. They held the view that the hand was cut off for a fourth of a Dinar and whatever beyond that.\r\nIt has been reported that Ibn Mas'ud said that it is not cut for less than a Dinar or ten Dirham. And this is a Mursal Hadith which was reported by Al-Qasim bin 'Abdur-Rahman from Ibn Mas'ud, and Al-Qasim did not hear from Ibn Mas'ud. This is acted upon according to some of the people of knowledge, it is the view of Sufyan Ath-Thawri and the people of Al-Kufah. They said that the hand is not cut off for less than ten Dirham. It has been reported that 'Ali said that there is no cutting of hand for less than ten Dirham. But its chain of narration is not connected.",
        "ourHadithNumber": 29,
        "matchingArabicURN": 715160,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615170,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "17.00",
        "babName": "What Has Been Related About Hanging The Hand Of The Thief (Around His Neck)",
        "hadithNumber": 1447,
        "hadithText": "'Abdur-Rahman bin Muhariz said: \"I asked Fadalah bin 'Ubaid about hanging the hand around the neck of the thief: 'Is this from the Sunnah?' He said: 'A man came to the Messenger of Allah (ﷺ) with a thief so his hand was cut off, and then he ordered that it be hung around his neck.'\"</b>",
        "bookID": "17.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except as a narration of 'Umar bin 'Ali Al-Muqaddami from Al-Hajjaj bin Artah. 'Abdur-Rahman bin Muhairiz and he is from Ash-Sham",
        "ourHadithNumber": 30,
        "matchingArabicURN": 715170,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615180,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "18.00",
        "babName": "What Has Been Related About The Traitor, The Embezzler And The Plunderer",
        "hadithNumber": 1448,
        "hadithText": "Narrated Jabir :\nThat the Prophet (ﷺ) said: \"There is no cutting of the hand for the traitor, or the embezzler, nor the plunderer.\"</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih. This is acted upon according to the people of knowledge. Mughirah bin Muslim narrated it - just as Ibn Juraij did - from Abu Az-Zubair, from Jabir from the Prophet (saws), and it is similar. Mughirah bin Muslim is from Al-Basrah, and he is the brother of 'Abdul-'Aziz Al-Qasmali. This is what 'Ali bin Al-Madini said.",
        "ourHadithNumber": 31,
        "matchingArabicURN": 715180,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615190,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "19.00",
        "babName": "What Has Been Related About Not Cutting The Hand For (Date) Fruits Or Palm Marrow ",
        "hadithNumber": 1449,
        "hadithText": "Narrated Rafi' bin Khadij:\nThat he heard the Messenger of Allah (ﷺ) say: \"There is no cutting of the hand for fruits or palm marrow.\"</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This is what some of them reported from Yahya bin Sa'eed, from Muhammad bin Yahya bin Habban, from his paternal uncle Wasi' bin Habban, from Rafi' [bin Khadij], from the Prophet (saws), and it is similar to the narration of Al-Laith bin Sa'd. Malik bin Anas and others reported this Hadith from Yahya bin Sa'eed, from Muhammad bin Yahya bin Hibban, from Rafi' bin Khadij, from the Prophet (saws), and they did not mention: \"from Wasi' bin Habban\" in it.",
        "ourHadithNumber": 32,
        "matchingArabicURN": 715190,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615200,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "20.00",
        "babName": "What Has Been Related About The Hands No Being Cut In Battles",
        "hadithNumber": 1450,
        "hadithText": "Narrated Busr Bin Artah:\nThat the Prophet (ﷺ) said: \"The hands are not cut in the battles.\"</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Gharib. Others beside Ibn Lahi'ah reported similar to this with this chain, and he also said: \"Busr bin Abi Artat.\" This is acted upon according to some of the people of knowledge, among them Al-Awza'i. They did not see that the legal punishments should be carried out in battles in the presence of the enemy, fearing that the one the punishment was implemented upon may join the enemy. So when the Imam has left the land of war, and return to the land of Islam, he applies the punishment on those deserving. This was said by Al-Awza'i.",
        "ourHadithNumber": 33,
        "matchingArabicURN": 715200,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615210,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "21.00",
        "babName": "What Has Been Related About A Man Having Relations With The Slave Girl Of His Wife",
        "hadithNumber": 1451,
        "hadithText": "Habib bin Salim said: \"A man was brought to An-Nu'man bin Bashir who had relations with the slave girl of his wife. He said: 'I give you judgement about her case according to the judgement of the Messenger of Allah (ﷺ): If she made her lawful for him, then I will lash him one hundred times, and if she did not make her lawful, then I will stone him.\"</b>",
        "bookID": "17.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 715210,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615220,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "21.00",
        "babName": "What Has Been Related About A Man Having Relations With The Slave Girl Of His Wife",
        "hadithNumber": 1452,
        "hadithText": "(Another chain) from An-Nu'man bin Bashir with similar.</b>",
        "bookID": "17.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[He said:] There is something similar to this topic from Salamah bin Al-Muhabbaq. [Abu 'Eisa said:] The chain of An-Nu'man contains some confusion (Idtirab). He said: I heard Muhammad bin Isma'il saying: \"Qatadah also did not hear this Hadith from Habib bin Salim, he only reported it from Khalid bin 'Urfutah.\" [Abu 'Eisa said:] The people of  knowledge differ over the case of a man who has relations with his wife's slave girl. It has been reported from more than one of the Companions of Prophet (saws) - among them 'Ali and Ibn 'Umar - that he is to be stoned. Ibn Mas'ud said: \"The legal punishment is not required for him, but he may be punished.\" Ahmad and Ishaq followed what was reported from An-Nu'man bin Bashir from Prophet (saws).",
        "ourHadithNumber": 35,
        "matchingArabicURN": 715220,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615230,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "22.00",
        "babName": "What Has Been Relates About A Woman Who Is Forced To Commit Adultery",
        "hadithNumber": 1453,
        "hadithText": "Narrated 'Abdul-Jabbar bin Wa'il bin Hujr:\nThat his father said: \"A woman was forced to commit illegal sexual relations during the time of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) did not enforce the legal punishment upon her, but he enforced it upon the one who had done it to her.\" And the narrator did not mention him assigning a dowry to her.</b>",
        "bookID": "17.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Gharib, and its chain is not connected. This Hadith has been reported through more than one route. [He said:] I heard Muhammad saying: \"Abdul-Jabbar bin Wa'il bin Hujr did not hear from his father, nor did he see him.\" They say that he was born a month after his father died. This Hadith is acted upon according to the people of knowledge among the Companions of the Prophet (saws) and others, in that the legal punishment is not implemented upon the woman who is coerced into committing adultery.\r\n",
        "ourHadithNumber": 36,
        "matchingArabicURN": 715230,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615240,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "22.00",
        "babName": "What Has Been Related About A Woman Who Is Forced To Commit Adultery",
        "hadithNumber": 1454,
        "hadithText": "Narrated 'Alqamah bin Wa'il Al-Kindi:\nFrom his father: \"A women went out during the time of the Prophet (ﷺ) to go to Salat, but she was caught by a man and he had relations with her, so she screamed and he left. Then a man came across her and she said: 'That man has done this and that to me', then she came across a group of Emigrants (Muhajirin) and she said: 'That man did this and that to me.' They went to get the man she thought had relations with her, and they brought him to her. She said: 'Yes, that's him.' So they brought him to the Messenger of Allah (ﷺ), and when he ordered that he be stoned, the man who had relations with her, said: 'O Messenger of Allah, I am the one who had relations with her.' So he said to her: 'Go, for Allah has forgiven you.' Then he said some nice words to the man (who was brought). And he said to the man who had relations with her: 'Stone him.' Then he said: 'He has repented a repentance that, if the inhabitants of Al-Madinah had repented with, it would have been accepted from them.'\"</b>",
        "bookID": "17.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Gharib Sahih. 'Alqamah bin Wa'il bin Hujr heard from his father; he was older that 'Abdul-Jabbar, and 'Abdul-Jabbar did not hear from his father.",
        "ourHadithNumber": 37,
        "matchingArabicURN": 715240,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615250,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "23.00",
        "babName": "What Has Been Related About One Who Commits Bestiality",
        "hadithNumber": 1455,
        "hadithText": "Narrated Ibn 'Abbas:\nThat the Messenger of Allah (ﷺ) said: \"Whomever you see having relations with an animal then kill him and kill animal.\" So it was said to Ibn 'Abbas: \"What is the case of the animal?\" He said: \"I did not hear anything from the Messenger of Allah (ﷺ) about this, but I see that the Messenger of Allah (ﷺ) disliked eating its meat or using it, due to the fact that such a (heinous) thing has been done with that animal.\"</b>",
        "bookID": "17.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] We do not know of this Hadith except from the narration of 'Amr bin Abi 'Amr from 'Ikrimah, from Ibn 'Abbas, from the Prophet (saws). ",
        "ourHadithNumber": 38,
        "matchingArabicURN": 715250,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615260,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "23.00",
        "babName": "What Has Been Related About One Who Commits Bestiality",
        "hadithNumber": 1455,
        "hadithText": "Sufyan Ath-Thawri reported from 'Asim, from Abu Razin, from Ibn 'Abbas who said: \"Whoever has relations with beast, then there is no legal punishment for him.\"</b>",
        "bookID": "17.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "That was narrated to us by Muhammad bin Bash-shar (who said): \" 'Abdur-Rahman bin Mahdi narrated to us, Sufyan Ath-Thawri narrated to us.\" This is more correct than the first Hadith. This is acted upon according to the people of knowledge, it is the view of Ahmad and Ishaq.",
        "ourHadithNumber": 39,
        "matchingArabicURN": 715260,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615270,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "24.00",
        "babName": "What Has Been Related About The Punishment Of The Sodomite",
        "hadithNumber": 1456,
        "hadithText": "Narrated Ibn 'Abbas:\nThat the Messenger of Allah (ﷺ) said: \"Whomever you find doing the actions of the people of Lut then kill the one doing it, and the one it is done to.\"</b>",
        "bookID": "17.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[He said:] There are narrations on this topic from Jabir and Abu Hurairah. \r\n[Abu 'Eisa said:] It is only through this route we know of this to be a Hadith of Ibn 'Abbas from the Prophet (saws). Muhammad bin Ishaq reported this Hadith from 'Amr bin Abi 'Amr, so he said: \"Those who do the act of the people of Lut are cursed.\" And he did not mention killing in it. He did mention: \"Those who have relations with a beast are cursed.\" This Hadith has been reported from 'Asim bin 'Umar, from Suhail bin Abi Salih, from his father, from Abu Hurairah, from the Prophet (saws) saying: \"Kill the doer and the one it is done to.\"\r\n[Abu 'Eisa said:] There is some disparagement in its chain of narration, we do not know of anyone who reported it from Suhail bin Abi Salih besides 'Asim bin 'Umar Al-Umari, and 'Asim bin 'Umar was graded weak in Hadith due to his memory. \r\nThe people of knowledge differ over legal punishment for sodomite. Some of them held the view that he has to be stoned, whether married or not married. This is the view of Malik, Ash-Shafi'i, Ahmad, and Ishaq.\r\nSome of the people of knowledge among the Fuqaha from the Tab'in - among them Al-Hasan Al-Basri, Ibrahim An-Nakha'i, 'Ata bin Abi Rabah, and others - said that the legal punishment for the sodomite is the legal punishment for illegal sexual relations. This is the view of Ath-Thawri and the people of Al-Kufah",
        "ourHadithNumber": 40,
        "matchingArabicURN": 715270,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615280,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "24.00",
        "babName": "What Has Been Related About The Punishment Of The Sodomite",
        "hadithNumber": 1457,
        "hadithText": "Narrated Jabir:\nThat the Messenger of Allah (ﷺ) said: \"What I fear most from my Ummah is the behavior of the people of Lut.\"</b>",
        "bookID": "17.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Gharib, we only know of it from this route, from 'Abdullah bin Muhammad bin 'Aqil bin Abi Talib, from Jabir.",
        "ourHadithNumber": 41,
        "matchingArabicURN": 715280,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615290,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "25.00",
        "babName": "What Has Been Related About The Apostate",
        "hadithNumber": 1458,
        "hadithText": "Narrated 'Ikrimah:\nThat 'Ali burnt some people who apostasized from Islam. This news reached Ibn 'Abbas, so he said: \"If it were me I would have killed them according to the statement of Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) said: 'Whoever changes his religion then kill him.' And I would not have burned them because the Messenger of Allah (ﷺ) said: 'Do not punish with the punishment of Allah.' So this reached 'Ali, and he said: \"Ibn 'Abbas has told the truth.\"</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih. This is acted upon according to the people of knowledge in case of apostasy. \r\nThey disagree in the case of a woman who apostasizes from Islam. A group of the people of knowledge said she is to be killed. This is the view of Al-Awza'i, Ahmad, and Ishaq. Another group said that she is imprisoned not killed. This is the view of Sufyan Ath-Thawri and others from the people of Al-Kufah.",
        "ourHadithNumber": 42,
        "matchingArabicURN": 715290,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615300,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "26.00",
        "babName": "What Has Been Related About One Who Brandishes A Weapon",
        "hadithNumber": 1459,
        "hadithText": "Narrated Abu Musa:\nThat the Prophet (ﷺ) said: \"Whoever carries weapons against us, he is not from us.\"</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "He said: There are narrations on this topic from Ibn 'Umar, Ibn Az-Zubair, Abu Hurairah, and Salamah bin Al-Akwa'.\r\n[Abu 'Eisa said:] The Hadith of Abu Musa is a Hasan Sahih Hadith.",
        "ourHadithNumber": 43,
        "matchingArabicURN": 715300,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615320,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "28.00",
        "babName": "What Has Been Related About The One Who Steals From The Spoils Of War, And What Is To Be Done To Him",
        "hadithNumber": 1461,
        "hadithText": "Narrated Umar:\nThat the Messenger of Allah (ﷺ) said: \"Whomever you find stealing from the spoils of war while in the path of Allah, then burn his belongings.\" Salih (one of the narrators) said: \"I entered upon Maslamah and with him was Salim bin 'Abdullah. There was a man there who had stolen from the spoils of war, so Salim narrated this Hadith. So he ordered accordingly, and his belongings were burnt. There was a Mushaf in his belongings, so Salim said: 'Sell this and give its proceeds as charity.'\"</b>",
        "bookID": "17.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except from this route. This is acted upon according to some of the people of knowledge. It is the view of Al-Awza'i, Ahmad and Ishaq. \r\nHe said: I asked Muhammad about this Hadith and he said: \"This was only reported by Salih bin Muhammad bin Za'idah, and he is Abu Waqid Al-Laithi, and he is Munkar in Hadith.\" Muhammad said: \"There is another Hadith from the Prophet (saws) about stealing from the spoils of war and he did not order burning one's goods in it.\" \r\n[Abu 'Eisa said:] This Hadith is Gharib.",
        "ourHadithNumber": 45,
        "matchingArabicURN": 715320,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615310,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "27.00",
        "babName": "What Has Been Related About The Legal Punishment For The Sahir",
        "hadithNumber": 1460,
        "hadithText": "Narrated Jundab:\nThat he heard the Messenger of Allah (ﷺ) saying: \"The punishment of the Sahir is a strike of the sword.\"</b>",
        "bookID": "17.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] We do not know of this Hadith to be Marfu' except from this route. Isma'il bin Muslim Al-Makki was graded weak in Hadith due to his memory. As of Isma'il bin Muslim Al-'Abdi Al-Basri, Waki' said: \"He is trustworthy.\" It has been reported from Al-Hasan as well. What is correct is from Jundab in Mawquf form.\r\nThis Hadith is acted upon according to some of the people of knowledge among the Companions of the Prophet (saws) and others, and it is the view of Malik bin Anas. As-Shafi'i said that the Sahir is only killed when the magic he practises reaches the level of disbelief, when his behavior is less than disbelief, the he did not see that he should be killed.",
        "ourHadithNumber": 44,
        "matchingArabicURN": 715310,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615330,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "29.00",
        "babName": "What Has Been Related About One Who Says To Another: \"O You Effeminate\"",
        "hadithNumber": 1462,
        "hadithText": "Narrated Ibn 'Abbas:\nThat the Prophet (ﷺ) said: \"If a man says to another man: 'O you Jew' then beat him twenty times. If he says: 'O you effeminate' then beat him twenty times. And whoever has relations with someone that is a Mahram then kill him.\"</b>",
        "bookID": "17.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] We do not know of this Hadith except from this route. Ibrahim bin Isma'il was graded weak in Hadith. \r\nIt has been reported from the Prophet (saws) through other routes; it has been reported from Al-Bara' bin 'Azib and Qurrah bin Iyas Al-Muzani, that a man married a previous wife of his father, so the Prophet (saws) ordered that he be killed. This is acted upon according to our companions. They say that whoever has relations with someone that is a Mahram and he knows, then he is to be killed.\r\nAhmad said whoever has relations with his mother then he is to be killed. Ishaq said that whoever has relations with someone who is a Mahram then he is to be killed.",
        "ourHadithNumber": 46,
        "matchingArabicURN": 715330,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 615340,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 15,
        "bookName": "The Book on Legal Punishments (Al-Hudud)",
        "babNumber": "30.00",
        "babName": "What Has Been Related About At-Taz'it (Unregulated Punishments)",
        "hadithNumber": 1463,
        "hadithText": "Narrated Abu Burdah bun Niyar:\nThat the Messenger of Allah (ﷺ) said: \"No one is to be lashed more than ten lashes except for a legal punishment among Allah's punishments.\"</b>",
        "bookID": "17.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[He said:] Ibn Lahi'ah reported this Hadith from Bukair and he was mistaken in it. He said: \"From 'Abdur-Rahman bin Jabir bin 'Abdullah, from his father, from the Prophet (saws).\" This is a mistake. What is correct is the narration of Al-Laith bin Sa'd. It should be: \"'Abdur-Rahman bin Jabir bin 'Abdullah from Abu Burdah bin Niyar, from the Prophet (saws).\"\r\n[Abu 'Eisa said:] This Hadith is [Hasan] Gharib, we do not know of it except as a narration of Bukair bin Al-Ashajj. The people of knowledge differ over At-Taz'ir and the best thing about At-Taz'ir is this Hadith.",
        "ourHadithNumber": 47,
        "matchingArabicURN": 715340,
        "last_updated": "2012-04-26 14:00:00"
    }
]