[
    {
        "englishURN": 616290,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "1.00",
        "babName": "What Has Been Related About Calling (To Islam) Before Fighting",
        "hadithNumber": 1548,
        "hadithText": "Narrated Abu Al-Bakhtari:\n\"An Army from the armies of the Muslims, whose commander was Salman Al-Farisi, besieged one of the Persian castles. They said: 'O Abu 'Abdullah! Should we charge them?' He said: 'Leave me to call them (to Islam) as I heard the Messenger of Allah (ﷺ) call them.' So Salman went to them and said: 'I am only a man from among you, a Persian, and you see that the Arabs obey me. If you become Muslims then you will have the likes of what we have, and from you will be required that which is required from us. If you refuse, and keep your religion, then we will leave you to it, and you will give us the Jizyah from your hands while you are submissive.' He said to them in Persian: 'And you are other than praiseworthy and if you refuse then we will equally resist you.' They said: 'We will not give you the Jizyah, we will fight you instead.' So they said: 'O Abu 'Abdullah! Should we charge them?' He said: 'No.'\" He said: \"So for three days he called them to the same (things), and then he said: 'Charge them.'\" He said: \"So we charged them, and we conquered the castle.\"</b>",
        "bookID": "21.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "<p>\r\n[He said:] There are narrations on this topic from An-Nu'man bin Muqarrin, Ibn 'Umar, and Ibn 'Abbas.\r\n</p>\r\n<p>\r\nThe Hadith of Salman is a Hasan Hadith, we do not know of it except as a narration of 'Ata bin As-Sa'ib.\r\n</p>\r\n<p>\r\nI heard Muhammad saying: \"Abu Al-Bakhtari did not see Salman because he did not see 'Ali, and Salman died before 'Ali.\"\r\n</p>\r\n<p>\r\nSome of the people of knowledge among the Companions of the Prophet (saws) and others followed this Hadith. They held the view of calling (the enemy to Islam) before fighting. This is the view of Ishaq bin Ibrahim. He said: \"If they are first called then that is good, since it will be more intimidating.\"\r\n</p>\r\n<p>\r\nSome of the people of knowledge said there is no calling today. Ahmad said: \"I do not know of anyone who calls today.\" Ash-Shafi'i said: \"The enemy is not fought until they call them, unless they are in too much of a rush to do that, it it is not done, then the invitation would have been conveyed to them (previously).\"\r\n</p>\r\n",
        "ourHadithNumber": 1,
        "matchingArabicURN": 716290,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616300,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "2.00",
        "babName": "The Prohibition Of Attacking If A Masjid Is Seen Or The Adhan Is Heard",
        "hadithNumber": 1549,
        "hadithText": "Narrated Ibn 'Asim Al-Muzani:\nFrom his father and he was a Companion who said: \"When the Messenger of Allah (ﷺ) dispatched any army or battalion, he would say to them: 'If you see a Masjid, or hear someone calling the Adhan, then do not kill anyone.'\"</b>",
        "bookID": "21.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "This Hadith is Gharib, and it is a Hadith of Ibn 'Uyainah.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 716300,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616310,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "3.00",
        "babName": "Regarding Nighttime And Surprise Attacks",
        "hadithNumber": 1550,
        "hadithText": "Narrated Anas:\n\"When the Messenger of Allah (ﷺ) set out for Khaibar, he approached it at night and when he came to a people during the night, he would not attack them until morning. So when the morning came, the Jews came out with their shovels and baskets, then when they saw him, they said: 'Muhammad! By Allah Muhammad has come with the Khamis (an army).' So the Messenger of Allah (ﷺ) said: 'Allahu Akbar! Khaibar is destroyed, for whenever we approach the land of people - then what an evil morning for those who have been warned.'\"</b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 716310,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616320,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "3.00",
        "babName": "Regarding Nighttime And Surprise Attacks",
        "hadithNumber": 1551,
        "hadithText": "Narrated Abu Talhah:\n\"When the Prophet (ﷺ) overtook a people he would stay at the outskirts of their city for three nights.\"</b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "This Hadith is Hasan Sahih. The (pervious) narration of Humaid from Anas is Hasan Sahih Hadith. Some of the people of knowledge permitted the surprise attack during the night. Some of them disliked it. Ahmad and Ishaq said that there is no harm in attacking the enemy during the night. And the meaning of: \"Muhammad has come with the Khamis\" it means the army is with him.",
        "ourHadithNumber": 4,
        "matchingArabicURN": 716320,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616330,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "4.00",
        "babName": "Regarding Burning And Destroying",
        "hadithNumber": 1552,
        "hadithText": "Narrated Ibn 'Umar:\n\"The Messenger of Allah (ﷺ) burnt the palm trees of Bani Nadir and cut them down at Al-Buwairah. So Allah revealed: Whatever you cut down of their palm trees, or you left them standing on their trunks, then it was by the permission of Allah, and in the order to disgrace the rebellious.(59:5)\"</b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "<p>\r\nThere is something on this topic from Ibn 'Abbas. And this Hadith is Hasan Sahih.\r\n</p>\r\n<p>\r\nSome of the people of knowledge followed this, and they did not see any harm in cutting down the trees and destroying the fortresses.\r\n</p>\r\n<p>\r\nSome of them disliked that. This is the view of Al-Awza'i. Al-Awza'i said: \"Abu Bakr As-Siddiq prohibited [Yazid] from cutting fruit bearing trees or destroying building, and the Muslims acted accordingly afterwards.\"\r\n</p>\r\n<p>\r\nAsh-Shafi'i said: \"There is no harm in burning in the land of the enemy, not cutting down the trees and fruit bearing trees.\" Ahmad said: \"There may be places in which they have no choice about that. But as for haphazardly, then there should be no burning.\" Ishaq said: \"Burning is Sunnah when it will be more offensive to them.\"\r\n</p>",
        "ourHadithNumber": 5,
        "matchingArabicURN": 716330,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616340,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "5.00",
        "babName": "What Has Been Related About The Spoils Of War",
        "hadithNumber": 1553,
        "hadithText": "Narrated Abu Umamah:\nThat the Prophet (ﷺ) said: \"Verily, Allah has honored me over the (other) Prophets\" - or he said: \"My nation over the nations, and He has made the spoils of war lawful for us.\"</b>",
        "bookID": "21.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "<p>\r\nThere are narrations on this topic from 'Ali, Abu Dharr, 'Abdullah bin 'Amr, Abu Musa, and Ibn 'Abbas.\r\n</p>\r\n<p>\r\n[Abu 'Eisa said:] The Hadith of Abu Umamah is a Hasan Sahih Hadith. They say that this Sayyar (a narrator) is Sayyar the freed salve of Banu Mu'awiyah. Sulaiman At-Taimi, 'Abdullah bin Bahir and others reported from him.\r\n</p>",
        "ourHadithNumber": 6,
        "matchingArabicURN": 716340,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616350,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "5.00",
        "babName": "What Has Been Related About The Spoils Of War",
        "hadithNumber": 1553,
        "hadithText": "Another chain from Abu Hurairah who narrated that the Prophet (ﷺ) said: \"I have been honored over the Prophets with six (things): I have been given Jawami' Al-Kalam, I have been aided by (the ability to cause in the enemy) fright, the spoils of war have been made lawful for me, the Earth has been made as a Masjid and purifier for me, and I have been sent to all creatures, and with me Prophethood is sealed.\"</b>",
        "bookID": "21.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "This Hadith is Hasan Sahih.",
        "ourHadithNumber": 7,
        "matchingArabicURN": 716350,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616360,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "6.00",
        "babName": "The Shares Given For The Horse",
        "hadithNumber": 1554,
        "hadithText": "Narrated Ibn 'Umar:\n\"The Messenger of Allah (ﷺ) divided the spoils as two shares for the horse and one share for the man.\"</b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 716360,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616370,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "6.00",
        "babName": "The Shares Given For The Horse",
        "hadithNumber": 1554,
        "hadithText": "<p>\nAnother chain with similar meaning.\n</p>\n<p>\nThere are narrations on this topic from Mujammi' bin Jariyah, Ibn 'Abbas, and Ibn Abi 'Amrah from his father. This Hadith of Ibn 'Umar is a Hasan Sahih Hadith. This is acted upon according to most of the people of knowledge among the Companions of the Prophet (ﷺ) and others.\n</p>\n<p>\nThis is the view of Sufyan At-Thawri, Al-Awzai', Malik bin Anas, Ibn Al-Mubarak, Ash-Shafi'i, Ahmad and Ishaq. They said that the horsemen gets three shares, one share is for him and two shares for his horse. The foot soldiers get one share.\n</p></b>",
        "bookID": "21.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 716370,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616380,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "7.00",
        "babName": "What Has Been Related About The Saraya (Military Unit)",
        "hadithNumber": 1555,
        "hadithText": "Narrated Ibn 'Abbas:\n<p>\nThat the Messenger of Allah (ﷺ) said: \"The best companions are four, the best Saraya (military unit) is four hundred, the best army is four thousand, and twelve thousand will not be beaten due to being too few.\"\n</p>\n<p>\nThis Hadith is Hasan Gharib, it was not narrated with a chain by anyone important besides Jarir bin Hazim, and this Hadith was only reported from Az-Zuhri, from the Prophet (ﷺ) in Mursal form. Hibban bin 'Ali Al-'Anazi reported it from 'Uqail, from Az-Zuhri, from 'Ubaidullah, from 'Ibn Abbas, from the Prophet (ﷺ), and Al-Laith bin Sa'd reported it from Sa'd, from 'Uqail, from Az-Zuhri, from the Prophet (ﷺ) in the Mursal form.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 716380,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616391,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "8.00",
        "babName": "About Who Is Given Spoils Of War (Al-Fay')",
        "hadithNumber": 1556,
        "hadithText": "Narrated Yazid bin Hurmuz:\n<p>\nThat Najdah Al-Haruri wrote to Ibn 'Abbas asking if the Messenger of Allah (ﷺ) would fight along with women, and if he would fix a share of the spoils of war for them. Ibn 'Abbas wrote to him: \"You wrote to me asking me if the Messenger of Allah (ﷺ) would fight along with women. He did fight along with them, as they would treat the wounded. They received something from the spoils of war, but as for their share, then he did not fix a share for them.\"\n</p>\n<p>\nThere is something on this topic from Anas and Umm 'Atiyyah.\n</p>\n<p>\nThis Hadith is Hasan Sahih. This is acted upon according to most of the people of knowledge. It is the view of Sufyan Ath-Thawri and Ash-Shafi'i. Some of them said that a share is given to the woman and the boy, and this is the view of Al-Awza'i.\n</p>\n<p>\nAl-Awza'i said: The Prophet (ﷺ) gave a portion to the boys at Khaibar, and the Aimmah of the Muslims gave a portion to every child born in the land of war.\" Al-Awza'i said: \"The Prophet (ﷺ) gave a portion to the women at Khaibar, and that was followed by the Muslims after him.\" This was narrated to us by 'Ali bin Khashram (who said): \"'Eisa bin Yunus narrated this to us from Al-Awza'i.\"\n</p>\n<p>\nThe meaning of his saying: \"They received something from the spoils of war\" it is said that he conferred something on them (the women) from the spoils of war. \n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 716391,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616410,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "9.00",
        "babName": "Does The Slave Recieve A Share ?",
        "hadithNumber": 1557,
        "hadithText": "Narrated 'Umair, the freed slave of Abil-Lahm:\n<p>\n\"I participated at Khaibar with my masters. They spoke about me to the Messenger of Allah (ﷺ) and told him that I was a slave.\" He said: \"So he ordered me to take up the sword, and I found myself dragging it, so he ordered that I be given something from the goods. I presented a Ruqyah that I used to treat the possessed with, so he ordered me leave some of it and keep some of it.\"\n</p>\n<p>\nThere is something on this topic from Ibn 'Abbas.\n</p>\n<p>\nThis Hadith is Hasan Sahih. This is acted upon according to the some of the people of knowledge. A complete portion is not given to slave, but something is conferred upon him. This is the view of Ath-Thawri, Ash-Shafi'i, Ahmad, and Ishaq.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 716410,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616420,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "10.00",
        "babName": "What Has Been Related About Ahl Adh-Dhimmah Fighting With The Muslims, Are They To Recieve A Share Of The Spoils Of War ?",
        "hadithNumber": 1558,
        "hadithText": "Narrated 'Aishah:\n<p>\nThat the Messenger of Allah (ﷺ) advanced towards Badr till he reached Harrah Al-Wabr where he was met by a man from the idolaters, about whom it was said he was brave and courageous. The Prophet (ﷺ) said to him: \"Do you believe in Allah and his Messenger?\" He said: \"No.\" He said: \"Then return, because we do not seek aid from an idolater.\"\n</p>\n<p>\nThe Hadith has more dialogue than this. And this is a Hasan Gharib Hadith. This is acted upon according to some of the people of knowledge. They say that the people of Adh-Dhimmah do not recieve a share, even it they were to fight along with the Muslims against the enemy.\n</p>\n<p>\nSome of the people of knowledge said that they are given a share when they attend the battle with the Muslims. \n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 716420,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616430,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "10.00",
        "babName": "What Has Been Related About Ahl Adh-Dhimmah Fighting With The Muslims, Are They To Recieve A Share Of The Spoils Of War ?",
        "hadithNumber": 1558,
        "hadithText": "<p>\nIt has been related by Az-Zuhri, that the Prophet (ﷺ) gave a portion to some people among the Jews who fought along with him. This was narrated to us by Qutaibah (who said): \"Abdul-Warith bin Sa'eed narrated to us from 'Urwah bin Thabit, from Az-Zuhri.\" \n</p>\n<p>\nThis Hadith is Hasan Gharib.\n</p></b>",
        "bookID": "21.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 716430,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616440,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "10.00",
        "babName": "What Has Been Related About Ahl Adh-Dhimmah Fighting With The Muslims, Are They To Recieve A Share Of The Spoils Of War ?",
        "hadithNumber": 1559,
        "hadithText": "Narrated Abu Musa:\n<p>\n\"I arrived upon the Messenger of Allah (ﷺ) at Khaibar along with a group of the Ash'ari tribe. He gave us shared along with those that conquered it.\"\n</p>\n<p>\nThis Hadith is Hasan Sahih Gharib. This is acted upon according to some of the people of knowledge. Al-Awza'i said: \"Whoever meets up with the Muslims before the horses, share is distributed, then he is given a share.\" And Buraid's (a narrator) Kunyah is Abu Buraidah and he is trustworthy. Sufyan Ath-Thawri, Ibn 'Uyainah and others report from him.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 716440,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616450,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "11.00",
        "babName": "What Has Been Related About Using The Containers Of The Idolaters",
        "hadithNumber": 1560,
        "hadithText": "Narrated Abu Tha'labah Al-Khushani:\n<p>\n\"The Messenger of Allah (ﷺ) was asked about the pots of the Zorastrians. He said: 'Clean them by washing them, and then cook in them.' And he prohibited every predator and possessor of canines.\"\n</p>\n<p>\nThis Hadith has been reported through routes other than this from Abu Tha'labah. Abu Idris Al-Khawlani reported it from Abu Tha'labah. Abu Qilabah did not hear from Abu Tha'labah, he only reported it from Abu Asma', from Abu Tha'labah.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 716450,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616460,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "11.00",
        "babName": "What Has Been Related About Using The Containers Of The Idolaters",
        "hadithNumber": 1560,
        "hadithText": "<p>\nAnother Chain fro Abu Idris Al-Khawlani 'Ai'dhullah bin 'Ubaidullah who said: \"I heard Abu Tha'labah Al-Khushani saying: 'I went to the Messenger of Allah (ﷺ) and said: \"O Messenger of Allah! We live in a land of the People of the Book and we eat from their containers.\" He said: \"If you find other containers than do not eat from them. If you do not find them, then wash them and eat from them.\"\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.\n</p></b>",
        "bookID": "21.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 716460,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616470,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "12.00",
        "babName": "Regarding The Nafl (An additional gift from the spoils of war that is given to particular fighters)",
        "hadithNumber": 1561,
        "hadithText": "Narrated 'Ubadah bin As-Samit:\n<p>\n\"The Prophet (ﷺ) used to confer a fourth of spoils of war in the early part of the expedition, and a third during the return.\"\n</p>\n<p>\nThere are narrations on this topic from Ibn 'Abbas, Habib bin Maslamh, Ma'n bin Yazid, Ibn 'Umar, and Salamah bin Al-Akwa'. This Hadith of 'Ubadah is a Hasan Hadith. This Hadith has also been reported from Abu Salam from a man among the Companions of the Prophet (ﷺ). \n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 716470,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616480,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "12.00",
        "babName": "Regarding The Nafl (An additional gift from the spoils of war that is given to particular fighters)",
        "hadithNumber": 1561,
        "hadithText": "<p>\nAnother chain from Ibn 'Abbas that the Prophet (ﷺ) took his sword Dhul-Fiqar on the Day of Badr, and it is the one that he saw in the dream on the Day of Uhud.\n</p>\n<p>\nThis Hadith is Hasan Gharib. We only know it from this route through the report of Ibn Abi Az-Zinad.\n</p>\n<p>\nThe people of knowledge differ over giving the Nafl from the Khumus. Malik bin Anas said: \"It has not reached me that the Messenger of Allah (ﷺ) gave the Nafl during every expedition, but it has been conveyed to me that he gave the Nafl in some of them. That is according to the discretion of the Imam during the beginning of the division of the spoils or the end of it.\"\n</p>\n<p>\nIbn Mansur said: \"I said to Ahmad: 'The Prophet (ﷺ) gave the Nafl when he divided the fourth, after the Khumus, and when he was returning (he gave) the third from the Khumus.' So he said: 'The Khumus is taken, and then the Nafl is given from what remains, nothing beyond this.''\"\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is (understood) as Ibn Musayyab said: \"The Nafl is from te Khumus.\" Ishaq said as he said.\n</p></b>",
        "bookID": "21.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 716480,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616490,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "13.00",
        "babName": "What Has Been Related About: Whoever Kills Someone In Battle, Then His Goods Are His",
        "hadithNumber": 1562,
        "hadithText": "Narrated Abu Qatadah:\n<p>\nThat the Messenger of Allah (ﷺ) said: \"Whoever kills someone in battle, having a proof for that, then his goods are his.\"\n</p>\n<p>\n[Abu 'Eisa said:] There is a story with this Hadith.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 716490,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616500,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "13.00",
        "babName": "What Has Been Related About: Whoever Kills Someone In Battle, Then His Goods Are His",
        "hadithNumber": 1562,
        "hadithText": "<p>\nAnother Chain with similar meaning\n</p>\n<p>\nThere are narrations on this topic from 'Awf bin Malik, Khalid bin Al-Walid, Anas, and Samurah.\n</p>\n<p>\nThis Hadith is Hasan Sahih. Abu Muhammad is Nafi' the freed slave of Abu Qatadah.\n</p>\n<p>\nThis is acted upon according to some of the people of knowledge among the Companions of the Prophet (ﷺ) and others. It is the view of Al-Awza'i, Ash-Shafi'i and Ahmad.\n</p>\n<p>\nSome of the people of knowledge said that the Imam takes Khumus from those goods. Ath-Thawri said: \"The Nafl is when the Imam says: 'Whoever got something, then it is his. And whoever killed a fighter, then his goods are his.' So it is allowed, and there is no Khumus taken from it.\" Ishaq said: \"The goods are for the one who did the killing, unless it is something that is a large amount.\" So he saw that the Imam could take the Khumus from that, just as 'Umar bin Al-Khattab did.\n</p></b>",
        "bookID": "21.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 716500,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616510,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "14.00",
        "babName": "About It being Disliked To Sell The Spoils Of War Until It Has Been Distributed",
        "hadithNumber": 1563,
        "hadithText": "Narrated Abu Sa’id Al Khudri :\n<p>\n\"The Messenger of Allah (ﷺ) prohibited selling the spoils of war until it has been distributed.\"\n</p>\n<p>\nThere is something on this topic from Abu Hurairah.\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Gharib.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 716510,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616520,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "15.00",
        "babName": "What Has Been Related About It Being Disliked To Have Intercourse With Pregnant Female Prisoners",
        "hadithNumber": 1564,
        "hadithText": "Narrated Umm Habibah bint 'Irbad bin Sariyah:\n<p>\nFrom her father who told her that the Messenger of Allah (ﷺ) prohibited intercourse with female prisoners, until they deliver what is in their wombs.\"\n</p>\n<p>\n[Abu 'Eisa said:] There is something on this topic from Ruwaifi' bin Thabit, and the Hadith of 'Irbad is a Gharib Hadith. This is acted upon according to the people of knowledge.\n</p>\n<p>\nAl-Awza'i said: \"When a man purchases a slave girl from the captives and she is pregnant, then it has been related from 'Umar bin Al-Khattab that he said: 'Do not have intercourse with the pregnant women until she gives birth.'\" Al-Awza'i said: \"As for the free women, then the Sunnah about them has passed, in that the 'Iddah is observed.\" All of this was narrated to me by 'Ali bin Khushram who said: \" 'Eisa bin Yunus narrated to us from Al-Awza'i.\"\n</p></b>",
        "bookID": "21.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 716520,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616530,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "16.00",
        "babName": "What Has Been Related About The Food Of The Idolaters",
        "hadithNumber": 1565,
        "hadithText": "Narrated Qabisah bin Hulb:\n<p>\nFrom his father, who said: \"I asked the Prophet (ﷺ) about the food of the Christians. He (ﷺ) said: 'Do not allow food to put uneasiness in your chest similar to the doubts of Christianity about it.\"\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan\n</p></b>",
        "bookID": "21.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 716530,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616540,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "16.00",
        "babName": "What Has Been Related About The Food Of The Idolaters",
        "hadithNumber": 1565,
        "hadithText": "Another Chain with similar chain.</b>",
        "bookID": "21.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 716540,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616550,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "16.00",
        "babName": "What Has Been Related About The Food Of The Idolaters",
        "hadithNumber": 1565,
        "hadithText": "<p>\nAnother chain with similar narration.\n</p>\n<p>\nThis is acted upon according to the people of knowledge regarding the permission for the food of the People of the Book.\n</p></b>",
        "bookID": "21.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 716550,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616560,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "17.00",
        "babName": "About It Being Disliked To Separate  (Related) Captives",
        "hadithNumber": 1566,
        "hadithText": "Narrated Abu Ayyub:\n<p>\nThat he heard the Messenger of Allah (ﷺ) say: \"Whoever separates between a mother and her child, then Allah will separate between him and his beloved on the Day of Judgement.\"\n</p>\n<p>\n[Abu 'Eisa said:] There is something on this topic from 'Ali. This Hadith is Hasan Gharib.\n</p>\n<p>\nThis is acted upon according to the people of knowledge among the Companions of the Prophet (ﷺ) and others. They dislike separating the captives, the mother and her child, the son and the father, and brothers.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 716560,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616570,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "18.00",
        "babName": "What Has Been Related About Killing Captives And Ransoming",
        "hadithNumber": 1567,
        "hadithText": "Narrated 'Ali:\n<p>\nThat the Messenger of Allah (ﷺ) said that Jibra'il had indeed descended upon him to say to him: \"Tell them - meaning your Companions - to choose regarding the captives of Badr, between either killing them or ransoming the, so that the amount killed by them will correspond similarly to them.\" So they said: \"Ranson, even though some of us may be killed.\"\n</p>\n<p>\nThere are narrations on this topic from Ibn Mas'ud, Anas, Abu Barzah, and Jubair bin Mut'im.\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of Ath-Thawri. We do not know of it except through the report of Za'idah.\n</p>\n<p>\nAbu Usamah reported similar to this from Hisham, from Ibn Sirin, from 'Abidah, from 'Ali, from the Prophet (ﷺ)\n</p>\n<p>\nIbn 'Awn reported it from Ibn Sirin, from 'Abidah, from 'Ali, from the Prophet (ﷺ) in Mursal form.\n</p>\n<p>\nAbu Dawud Al-Hafiri's ( a narrator in this chain) name is 'Umar bin Sa'd.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 716570,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616580,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "18.00",
        "babName": "What Has Been Related About Killing Captives And Ransoming",
        "hadithNumber": 1568,
        "hadithText": "Narrated 'Imran bin Husain:\n<p>\nThat the Prophet (ﷺ) ransomed two men for the Muslims with a man from the idolaters.\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.\n</p>\n<p>\nThe paternal uncle of Abu Al-Muhallab's name is 'Abdur Rahman bin 'Amr, and they also say it was Muhawiyah bin 'Amr. And Abu Qilabah's name is 'Abdullah bin Zaid Al-Jarmi (narrator in the chain)\n</p>\n<p>\nThis is acted upon according to most of the people of knowledge among the Companions of the Prophet(ﷺ) and others. It is for the Imam to decide to be generous with whom he wills among the captives, or to kill whom he wills among them, or to ransom whom he wills among them. Some of the people of knowledge preferred killing over ransoming.\n</p>\n<p>\nAl-Awzai' said: \"It has been conveyed to me. that this Ayah is abrogated: Thereafter (is the time) either for generosity (to free them without ranson) or ransom (47:4). It was abrogated by: Kill them wherever you find them (2:191). This was narrated to us by Hannad (who said): \"Ibn Al-Mubarak narrated to us, from Al-Awza'i.\"\n</p>\n<p>\nIshaq bin Mansur said: \"I said to Ahmad: 'When the captives are captured' is killing or ransoming better to you?' He said: 'If they are able to ransom' then there is no harm in it. And if they kill, then I do not know of any harm in it.'\" Ishaq said: \"Wiping them out is better to me, unless it is someone well-known, so that it is hoped that a large amount will be obtained for him.\"\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 716580,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616590,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "19.00",
        "babName": "What Has Been Related About The Prohibition Of Killing Women And Children",
        "hadithNumber": 1569,
        "hadithText": "Narrated Ibn 'Umar:\n<p>\nThat a woman was found killed in one of the expeditions of the Messenger of Allah (ﷺ), so the Messenger of Allah (ﷺ) rebuked that, and he prohibited killing women and children. \n</p>\n<p>\nThere are narrations on this topic from Buraidah and Rabah - and they say he was Riyah - bin Ar-Rabi', Al-Aswad bin Sari', Ibn 'Abbas, and As-Sa'b bin Jaththamah.\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih. This is acted upon according to some of the people of knowledge among the Companions of the Prophet (ﷺ) and others. They disliked killing women and children. This is the view of Sufyan Ath-Thawri and Ash-Shafi'i.\n</p>\n<p>\nSome of the people of knowledge made an exception for killing the women who had children with them during night attacks, this is the view of Ahmad and Ishaq, they permitted it in night attacks.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 716590,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616600,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "19.00",
        "babName": "What Has Been Related About The Prohibition Of Killing Women And Children",
        "hadithNumber": 1570,
        "hadithText": "Narrated Ibn 'Abbas:\n<p>\n\"I was informed by As-Sa'b bin Jaththamah who said: \" I said: \"O Messenger of Allah our horses trampled over women and children of the idolaters.\" He said: \"They are from their fathers.'\"\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 716600,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616610,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "20.00",
        "babName": "The Prohibition Of Burning With Fire",
        "hadithNumber": 1572,
        "hadithText": "Narrated Abu Hurairah:\n<p>\n\"The Messenger of Allah (ﷺ) sent us with an army and said: 'If you see so-and-so, and so-and-so' referring to two men from the Quraish: 'then burn them with fire.' Then, upon our departure, the Messenger of Allah (ﷺ) said: 'I ordered you to burn so-and-so, and so-and-so with fire, and indeed, none punishes with fire except Allah. So if you see them, then kill them.'\"\n</p>\n<p>\nThere are narrations on this topic from Ibn 'Abbas and Hamzah bin 'Amr Al-Aslami.\n</p>\n<p>\n[Abu 'Eisa said:] The Hadith of Abu Hurairah is a Hasan Sahih Hadith. This is acted upon according to the people of knowledge. In this Hadith, Muhammad bin Ishaq mentioned a man (narrating) between Sulaiman bin Yasar and Abu Hurairah. Others reported this Hadith the same as Al-Laith reported it(here, without a man between them). The narration of Al-Laith bin Sa'd is more appropriate and more correct.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 716610,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616620,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "21.00",
        "babName": "What Has Been Related About Ghulul",
        "hadithNumber": 1572,
        "hadithText": "Narrated Thawban:\n<p>\nThat the Messenger of Allah (ﷺ) said: \"Whoever dies and he is free of three: Kibr (Pride), Ghulul, and debt, he will enter paradise.\"\n</p>\n<p>\nThere are narrations on this topic from Abu Hurairah and Zaid bin Khalid Al-Juhni\n</p>\n<p>\nFootnote: Ghulul refers to goods stolen from the spoils of war, or concealed, before it is divided among the soldiers\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 716620,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616630,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "21.00",
        "babName": "What Has Been Related About Ghulul",
        "hadithNumber": 1573,
        "hadithText": "Narrated Thawban:\nThat the Messenger of Allah (ﷺ) said: \"Whoever's soul departs from his body while he is free of three: Kanz (buried treasure), Ghulul, and debt, then he will enter paradise.\"\n</p>\n<p>\nThis is how Sa'eed narrated it: \"Kanz\" while Abu 'Awanah said in his narration: \"Kibr\" and he did not mention \"from Ma'dan\" in it. But the narration of Sa'eed is more correct.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 716630,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616640,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "21.00",
        "babName": "What Has Been Related About Ghulul",
        "hadithNumber": 1574,
        "hadithText": "Narrated Simak Abu Rumail Al-Hanafi:\n<p>\n\"I heard Ibn 'Abbas saying: 'Umar bin Al-Khattab narrated to me that he said: \"It was said: 'O Messenger of Allah! So-and-so has been martyred.' He said: \"No! I saw him in the fire of garment he pilfered from the spoils of war.' He said: 'Stand up O 'Umar! Call out that no one enters paradise except the believers.' Three times.\"\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 716640,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616650,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "22.00",
        "babName": "What Has Been Related About Women Going Out For War",
        "hadithNumber": 1575,
        "hadithText": "Narrated Anas:\n<p>\n\"The Messenger of Allah (ﷺ) used to go to battle with Umm Sulaim, and other women with her, from the Ansar, who would give water and attend to the wounded.\"\n</p>\n<p>\n[Abu 'Eisa said:] There is something on this topic from Ar-Rabi' bin Mu'awwidh. This Hadith is Hasan Sahih.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 716650,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616660,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "23.00",
        "babName": "What Has Been Related About Accepting Gifts From The Idolaters",
        "hadithNumber": 1576,
        "hadithText": "Narrated 'Ali:\n<p>\nFrom the Prophet (ﷺ), that Kisra sent him a gift so he accepted, and that kings gave him gifts and he accepted them.\n</p>\n<p>\nThere is something about this from Jabir. This is a Hasan Gharib Hadith. Thuwair (a narrator in the chain) is Ibn Abi Fakhitah, whose name was Sa'eed bin 'Illaqah, and Thuwair's Kunyah was Abu Jahm.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 716660,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616670,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "24.00",
        "babName": "About The Gifts Of The Idolaters Being Disliked",
        "hadithNumber": 1577,
        "hadithText": "Narrated 'Iyad bin Himar:\n<p>\nThat he gave the Prophet (ﷺ) a gift or a camel, so the Prophet (ﷺ) said: \"Have you accepted Islam?\" He said: \"No.\" He said: \"Then I have been prohibited from the Zabd (gift) of the idolaters.\"\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih. And the meaning of his saying: \"I haven been prohibited from the Zabd (gifts) of the idolaters\" is their gifts.\n</p>\n<p>\nIt has been reported about the Messenger (ﷺ) that he used to accept the gifts of the idolaters while a dislike for that is mentioned in this Hadith.\n</p>\n<p>\nAnd the implication is that this was after he used to accept from them, and then he later forbade their gifts.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 716670,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616680,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "25.00",
        "babName": "What Has Been Related About The Prostration Of Gratitude (Sajdah Ash-Shukr)",
        "hadithNumber": 1578,
        "hadithText": "Narrated Abu Bakrah:\n<p>\n\"The Prophet (ﷺ) was met by some affair that made him happy, so he prostrated to Allah.\"\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from this route, as a narration of Bakkar bin 'Abdul-'Aziz.\n</p>\n<p>\nThis is acted upon according to most of the people of knowledge, they held the view that one could perform the prostration of gratitude. And Bakkar bin 'Adbul-'Aziz bin Abi Bakrah is Muqarib (average) in Hadith.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 716680,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616690,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "26.00",
        "babName": "What Has Been Related About The Assurance Of Protection Granted By A Woman And A Slave",
        "hadithNumber": 1579,
        "hadithText": "Narrated Abu Hurairah:\n<p>\nThat the Prophet (ﷺ) said: \"Indeed a woman grants (assurances of protection) to a people\" - meaning it is to be honored - \"from the Muslims.\"\n</p>\n<p>\nThere is something on this topic from Umm Hani, and this Hadith is Hasan Gharib.\n</p>\n<p>\nI asked Muhammad and he said: \"This Hadith is Sahih. Kathir bin Ziad heard from Al-Walid bin Rabah, and Al-Walid bin Rabah heard from Abu Hurairah, and he is Muqarib (average) in Hadith.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 716690,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616700,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "26.00",
        "babName": "What Has Been Related About The Assurance Of Protection Granted By A Woman And A Slave",
        "hadithNumber": 1579,
        "hadithText": "<p>\nAnother chain from Umm Hani' who said: \"I granted asylum for two men among my brother-in-laws. So the Messeneger of Allah (ﷺ) said: 'We grant security to whomever you have granted security.'\"\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.\n</p>\n<p>\nThis is acted upon according to the people of knowledge. They permit assurance of protection by a women. This is the view of Ahmad and Ishaq. They permitted the asylum of a woman and slave\n</p>\n<p>\nIt has been related from other routes from 'Umar bin Al-Khattab that he permitted the asylum granted by a slave.\n</p>\n<p>\nOne of the narrators of this last narration Abu Murrah is the freed slave of 'Aqil bin Abi Talib - they also say that he was freed slave  of Umm Hani' - and his name was Yazid.\n</p>\n<p>\nIt has been related from 'Ali bin Abi Talib and 'Abdullah bin 'Amr that the Prophet (ﷺ) said: \"The covenants of the Muslims are one, it covers the rest of them.\"\n</p>\n<p>\n[Abu 'Eisa said:] According to the people of knowledge, the meaning of this Hadith is that whoever gives assurance of protection among the Muslims, then it is valis to all of them.\n</p></b>",
        "bookID": "21.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 716700,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616710,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "27.00",
        "babName": "What Has Been Related About Breaking Treaties",
        "hadithNumber": 1580,
        "hadithText": "Narrated Abu Al-Faid:\n<p>\n\"I heard Sulaim bin 'Amir saying: 'There was a treaty between Mu'awiyah and the people of Rome. He was making an expedition into their lands so that when the period of the treaty was expires he would attack them. So when a man upon an animal' - or - 'upon a horse said: \"Allahu Akbar! Fulfillment not betrayal!\" - and it turned out to be 'Amr bin 'Abasah - Mu'awiyah asked him about that. He said: \"I heard the Messenger of Allah (ﷺ) said: 'Whoever has a treaty between himself and a people, then let him not violate the treaty nor try to change it until its time has passed, or , in retribution for a similar offense.'\" He said: \"So Mu'awiyah returned with the people.\"\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 716710,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616720,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "28.00",
        "babName": "What Has Been Related About: For Each Person Who Betrays A Treaty There Is A Banner Erected On The Day Of Judgement",
        "hadithNumber": 1581,
        "hadithText": "Narrated Ibn 'Umar:\n<p>\nThe Messenger of Allah (ﷺ) said: \"Indeed the one who betrays will have a banner erected for him on the Day of Judgement.\"\n</p>\n<p>\n[He said:] There are narrations on this topic from 'Ali, 'Abdullah bin Mas'ud, Abu Sa'eed Al-Khudri, and Anas.\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih. \nI asked Muhammad about the Hadith of Suwaid, from Abu Ishaq, from 'Umarah bin 'Umair, from 'Ali, from the Prophet (ﷺ) who said: \"For every person who betrays there will be banner.\" He said: \"I do not know of this Hadith being Marfu'\"\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 716720,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616730,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "29.00",
        "babName": "What Has Been Related About Cessation For Arbitration",
        "hadithNumber": 1582,
        "hadithText": "Narrated Jabir:\n\"On the day of (the battle of) Al-Ahzab, Sa'd bin Mu'adh was struck by an arrow such that the upper vein or lower vein of his forearm was severed. So the Messenger of Allah (ﷺ) tried to stop it with fire, but it made his arm bleed profusely so he left it. Then he did it another time but it caused it to bleed profusely. Upon seeing that he said: 'O Allah! Do not allow my soul depart until my eyes are comforted by elimination of Banu Quraizah.' He pressed his vein closed and it did not bleed a drop before they surrendered to the arbitration of Sa'd bin Mu'adh. He (the Prophet (ﷺ)) sent to him (Sa'd) who judged that their men should be killed, their women should be spared, and that the Muslims may share them among themselves. With this, the Messenger of Allah (ﷺ) said: 'You have judged according to Allah's judgement for them.' And they were four hundred. Then when he finished killing them, his vein opened up and he died.\"\n</p>\n<p>\n[He said:] There are narrations on this topic from Abu Sa'eed and 'Atiyyah Al-Qurazi.\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 716730,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616740,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "29.00",
        "babName": "What Has Been Related About Cessation For Arbitration",
        "hadithNumber": 1583,
        "hadithText": "Narrated Samurah bin Jundab:\n<p>\nThat the Messenger of Allah (ﷺ) said: \"Kill the elder men among the idolaters and spare the Sharkh amont them.\"\n</p>\n<p>\nAnd the Sharkh are the boys who did not begin to grow pubic hair.\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.\n</p>\n<p>\nHajjaj bin Artah narrated similarly from Qatadah.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 716740,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616750,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "29.00",
        "babName": "What Has Been Related About Cessation For Arbitration",
        "hadithNumber": 1584,
        "hadithText": "Narrated 'Atiyyah Al-Qurazi:\n<p>\n\"We were presented to the Messenger of Allah (ﷺ) on the day of (the battle of) Quraizah. Whoever had pubic hair was killed and whoever did not was left to his way. I was of those who did not have pubic hair so I was left to my way.\"\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih. This is acted upon according to some of the people of knowledge. They consider pubic hair an indication of the age of responsibility, if it is not known whether he has had a wet dream, or his age. This is the view of Ahmad and Ishaq.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 716750,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616760,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "30.00",
        "babName": "What Has Been Related About Oaths Of Allegiance",
        "hadithNumber": 1585,
        "hadithText": "Narrated 'Amr bin Shu'aib:\n<p>\nFrom his father, from his grandfather, that the Messenger of Allah (ﷺ) said during his Khutbah: \"Fulfill the allegiances sworn in Jahiliyyah for it\" - meaning Islam - \"does not add to them except in gravity. And do not initiate new allegiances in Islam.\"\n</p>\n<p>\n[He said:] There are narration on this topic from 'Abdur-Rahman bin 'Awf, Umm Salamah, Jubair bin Mut'im, Abu Hurairah, Ibn 'Abbas, and Qais bin 'Asim.\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 716760,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616770,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "31.00",
        "babName": "About Taking The Jizyah From The Zoroastrians",
        "hadithNumber": 1586,
        "hadithText": "Narrated Bajalah bin 'Abdah :\n<p>\n\"I was a scribe for Jaz' bin Mu'awiyah at Manadhir when 'Umar's letter came to us (saying): 'Inspect the Zoroastrians around you to take the Jizyah from them. For indeed 'Abdur-Rahman bin 'Awf informed me that the Messenger of Allah (ﷺ) took the Jizyah from the Zoroastrians of Hajar.'\"\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 716770,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616780,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "31.00",
        "babName": "About Taking The Jizyah From The Zoroastrians",
        "hadithNumber": 1587,
        "hadithText": "Narrated Bajalah:\n<p>\nThat 'Umar would not take the Jizyah from the Zoroastrians until 'Abdur-Rahman bin 'Awf informed him that the Prophet (ﷺ) took Jizyah from the Zoroastrians of Hajar.\"\n</p>\n<p>\nThere is more dialogue in the Hadith than this. And this Hadith is Hasan Sahih.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 716780,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616790,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "31.00",
        "babName": "About Taking The Jizyah From The Zoroastrians",
        "hadithNumber": 1588,
        "hadithText": "Narrated Malik :\nFrom Az-Zuhri, that Sa'ib bin Yazid said: \"The Messenger of Allah (ﷺ) took the Jizyah from the Zoroastrians of Bahrain, and 'Umar took it in Persia, and 'Uthman took it from the Persians.\"\n</p>\n<p>\nI asked Muhammad about this, so he said: \"It is: 'Malik from Az-Zuhri from the Prophet (ﷺ).'\"\n</p></b>",
        "bookID": "21.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 716790,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616800,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "32.00",
        "babName": "What Has Been Related About What Is Lawful From The Wealth Of Ahl Adh-Dhimmah",
        "hadithNumber": 1589,
        "hadithText": "Narrated 'Uqbah bin 'Amir:\n<p>\n\"I said: 'O Messenger of Allah! We come across a people and they do not host us, and they do not give us our rights, and we do not take anything from them. So the Messenger of Allah (ﷺ) said: 'If they refuse such that you can only take by force, then take.'\"\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan. It has been reported by Al-Laith bin Sa'd from Yazid bin Abi Habib as well.\n</p>\n<p>\nThis Hadith only means that they would go out for battles and they would pass a people among whom they would not find any food to buy for a price. So the Prophet (ﷺ) told them: If they refuse to sell you, such that you have to take it forcefully, then take it. This is how the explanation has been related in some of the Ahadith. And it has been related that 'Umar bin Al-Khattab, may Allah be please with him, would order similarly.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 716800,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616810,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "33.00",
        "babName": "What Has Been Related About Hijrah",
        "hadithNumber": 1590,
        "hadithText": "Narrated Ibn 'Abbas:\n<p>\nThat on the day of Conquest of Makkah, the Messenger of Allah (ﷺ) said: \"There is no Hijrah after the conquest, there is only Jihad and intention, and when you are called to go forth (for battle), then go.\"\n</p>\n<p>\n[He said:] There are narrations on this topic from Abu Sa'eed, 'Abdullah bin 'Amr, and 'Abdullah bin Hubshi.\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih. Sufyan Ath-Thawri reported it similarly from Mansur bin Al-Mu'tamir.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 716810,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616820,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "34.00",
        "babName": "What Has Been Related About Giving The Pledge To The Prophet (saws)",
        "hadithNumber": 1591,
        "hadithText": "Narrated Yahya bin Abi Kathir:\n<p>\nFrom Abu Salamah, from Jabir bin Abdullah about the statement of Allah, most High: Allah was pleased with the believers when they gave the pledge to you under the tree (48:18). that Jabir said: \"We pledged to the Messenger of Allah (ﷺ) that we would not flee, and we did not pledge to him for death.\"\n</p>\n<p>\n[He said:] There are narration on this topic from Salamah bin Al-Akwa', Ibn 'Umar, 'Ubadah, and Jarir bin 'Abdullah.\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is been reported from 'Eisa bin Yunus, from Al-Awza'i, from Yahya bin Abi Kathir who said: \"Jabir bin 'Abdullah said\" and he did not mention Abu Salamah on it.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 716820,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616830,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "34.00",
        "babName": "What Has Been Related About Giving The Pledge To The Prophet (saws)",
        "hadithNumber": 1592,
        "hadithText": "Narrated Yazid bin Abi 'Ubaid:\n<p>\n\"I said to Salamah bin Al-Akwa': \"For what did you pledge to the Messenger of Allah (ﷺ) on the Day of Al-Hudaibiyyah?\" He said: \"For death.\"\n</p>\n<p>\nThis Hadith is Hasan Sahih.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 716830,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616840,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "34.00",
        "babName": "What Has Been Related About Giving The Pledge To The Prophet (saws)",
        "hadithNumber": 1593,
        "hadithText": "Narrated Ibn 'Umar:\n<p>\n\"We used to pledge to the Messenger of Allah (ﷺ) to hear and obey.\" So he would say to us: \"As much as you are able.\"\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 716840,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616850,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "34.00",
        "babName": "What Has Been Related About Giving The Pledge To The Prophet (saws)",
        "hadithNumber": 1594,
        "hadithText": "Narrated Jabir bin ‘Abdullah :\n<p>\n\"We did not pledge to the Messenger of Allah (ﷺ) for death, but only that we would not flee.\"\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih, meaning both of the Ahadith are Sahih. Some of his Companions pledged to him for death, they said only: \"We will not leave from in front of you as long as we are not killed.\" While others pledged him by saying: \"We will not flee.\"\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 716850,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616860,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "35.00",
        "babName": "What Has Been Related About Violating A Pledge",
        "hadithNumber": 1595,
        "hadithText": "Narrated Abu Hurairah:\n<p>\nThat the Messenger of Allah (ﷺ) said: \"Three will not be spoken to by Allah on the Day of Judgement, nor will they be purified, and for them is a painful torment: A man that gave a pledge to an Imam, and if he gives to him he fulfills it, and if he does not give to him he does not fulfill not fulfill it.\"\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 716860,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616870,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "36.00",
        "babName": "What Has Been Related About A Slave's Pledge",
        "hadithNumber": 1596,
        "hadithText": "Narrated Jabir:\n<p>\n\"A slave came to give the pledge to the Prophet (ﷺ) for Hijrah, but the Prophet (ﷺ) did not realize that he was a slave. So his master came, and the Prophet (ﷺ) said: 'Sell him to me.' So he purchased him for two black slaves. After this he (ﷺ) would not take the pledge from anyone until he asked him if he was a slave.\"\n</p>\n<p>\n[He said:] There is something on this topic from Ibn 'Abbas.\n</p>\n<p>\n[Abu 'Eisa said:] The Hadith of Jabir is Hasan Gharib Sahih, we do not know of it except as a narration of Abu Az-Zubair.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 716870,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616880,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "37.00",
        "babName": "What Has Been Related About The Women's Pledge",
        "hadithNumber": 1597,
        "hadithText": "<p>\nIbn Al-Munkadir heard Umaimah bin Ruqaiqah saying: \"I pledged to the Messenger of Allah (ﷺ) along with some women. He said to us: 'In as much as you are able and capable.' I said: 'Allah and His Messenger are more merciful to us than we are to ourselves,' then I said: 'O Messenger of Allah take the pledge from us.'\" - Sufyan (one of the narrators) said: meaning: 'shake (hands) on it with us' - \"so the Messenger of Allah (ﷺ) said: 'My statement to one hundred women is like my statement to one.'\"\n</p>\n<p>\n[He said:] There are narrations on this topic from 'Aishah, from 'Abdullah bin 'Umar, and Asma' bint Yazid.\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih, we do not know of it except as a narration of Muhammad bin Al-Munkadir.\n</p>\n<p>\nSufyan Ath-Thawri, Malik bin Anas, and others reported this Hadith from Muhammad bin Al-Munkadir similarly. He said: I asked Muhammad about this Hadith and he said: \"I am not aware of a Hadith other than this from Umaimah bint Ruqaiqah.\" There is another woman named Umaimah who narrated from the Messenger of Allah (ﷺ).\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 716880,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616890,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "38.00",
        "babName": "What Has Been Related About The Number Of Companions Who Participated In The Battle Of Badr",
        "hadithNumber": 1598,
        "hadithText": "Narrated Al-Bara' :\n<p>\n\"We used to say that the participants of Badr on the Day of Badr were like the number of companions of Talut, three hundred and thirteen men.\"\n</p>\n<p>\n[He said:] There is something on this topic from Ibn 'Abbas.\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih. Ath-Thawri and others reported it from Abu Ishaq.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 716890,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616900,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "39.00",
        "babName": "What Has Been Related About The Khumus",
        "hadithNumber": 1599,
        "hadithText": "Narrated Ibn 'Abbas:\n<p>\nThat the Prophet (ﷺ) said to a delegation from 'Abdul-Qais: \"I order you to give the Khumus from your spoils of war.\"\n</p>\n<p>\nHe said: There is a story with this Hadith\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 716900,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616910,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "39.00",
        "babName": "What Has Been Related About The Khumus",
        "hadithNumber": 1599,
        "hadithText": "Another chain with similar narration.</b>",
        "bookID": "21.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 716910,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616920,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "40.00",
        "babName": "What Has Been Related About Looting Being Disliked",
        "hadithNumber": 1600,
        "hadithText": "Narrated 'Abayah bin Rifa'ah:\n<p>\nFrom his father, from his grandfather Rafi' bin Khadij, who said: \"We were with the Messenger of Allah (ﷺ) on a journey, when the hasty people went rushing ahead to the sheep to cook them, while the Messenger of Allah (ﷺ) was in the rear of the people. Then he passed the kettled and ordered that they be weighed, then he distributed it between them and equated a camel to ten sheep.\"\n</p>\n<p>\n[Abu 'Eisa said:] Sufyan Ath-Thawri reported it from his father, from 'Abayah, from his grandfather Rafi' bin Khadij, and he did not mention \"from his father\" in it.\n</p>\n<p>\nThis was narrated to us by Mahmud bin Ghailan (who said:) \"Waki' narrated it to us from Sufyan.\" And this is more correct. 'Abayah bin Rifa'ah heard from his grandfather Rafi' bin Khadij.\n</p>\n<p>\nHe said: There are narrations on this topic from Tha'labah bin Al-Hakam, Anas, Abu Rihanah, Abu Ad-Darda, 'Abdur-Rahman bin Samurah, Zaid bin Khalid, Jabir, Abu Hurairah, and Abu Ayyub.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 716921,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616940,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "40.00",
        "babName": "What Has Been Related About Looting Being Disliked",
        "hadithNumber": 1601,
        "hadithText": "Narrated Anas:\n<p>\nThat the Messenger of Allah (ﷺ) said: \"Whoever plunders then he is not of us.\"\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib as a Hadith of Anas.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 716940,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616950,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "41.00",
        "babName": "What Has Been Related About Greeting The People Of The Book With Salam",
        "hadithNumber": 1602,
        "hadithText": "Narrated Abu Hurairah:\n<p>\nThat the Messenger of Allah (ﷺ) said: \"Do not precede the Jews and the Christians with the Salam. And if one you meets one of them in the path, then force him to its narrow portion.\"\n</p>\n<p>\n[He said:] There are narrations on this topic from Ibn 'Umar, Anas, and Abu Basrah Al-Ghifari the Companion of the Prophet (ﷺ).\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih. And regarding the meaning of this Hadith: \"Do not precede the Jews and the Christians\": Some of the poeple of knowledge said that it only means that it is disliked because it would be honoring them, and the Muslims were ordered to humiliate them. For this reason, when one of them is met on the path, then the path is not yielded for him, because doing so would amount to honoring them.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 716950,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616960,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "41.00",
        "babName": "What Has Been Related About Greeting The People Of The Book With Salam",
        "hadithNumber": 1603,
        "hadithText": "Narrated Ibn 'Umar:\n<p>\nThat the Messenger of Allah (ﷺ) said: \"Indeed when a Jew gives Salam to one of you, then he is only saying: 'As-Samu 'Alaikum' (Death be upon you) so say: \"Alaik (And upon you).'\"\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 716960,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616970,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "42.00",
        "babName": "What Has Been Related About It Being Disliked To Live Among The Idolaters",
        "hadithNumber": 1604,
        "hadithText": "Narrated Qais bin Abu Hazim:\n<p>\nFrom Jarir bin 'Abdullah that the Messenger of Allah (ﷺ) sent a military expedition to Khath'am. So some people (living there) sought safety by prostrating, but they were met quickly and killed. News of this reached the Prophet (ﷺ) upon which he commanded that they be given half of the 'Aql (blood money). And he said: \"I am free from every Muslim that lives among the idolaters.\" They said:\"O Messenger of Allah: How is that ?\" He said: \"They should not see each other's campfires.\"\n</p></b>",
        "bookID": "21.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 716970,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616980,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "42.00",
        "babName": "What Has Been Related About It Being Disliked To Live Among The Idolaters",
        "hadithNumber": 1605,
        "hadithText": "Narrated Qais bin Abu Hazim:\n<p>\nSimilar to the narration of Abu Mu'aqiyah (no. 1604) but he did not mention in it: \"from Jarir\" in it, and that is more correct.\n</p>\n<p>\nThere is something on this topic from Samurah.\n</p>\n<p>\n[Abu 'Eisa said:] Most of the companions of Isma'il said: \"From Isma'il, from Qais bin Abu Hazim, that the Messenger of Allah (ﷺ) sent a military expedition.\" and they did not mention: \"from Jarir\" in it.\n</p>\n<p>\nHammad bin Salamah reported similar to the narration of Abu Mu'awiyah, from Al-Hajjaj bin Artah, from Isma'il bin Abi Khalid, from Qais from Jarir\n</p>\n<p>\n[He said:] I heard Muhammad saying: \"What is correct is the narration of Qais from the Prophet (ﷺ) in Mursal form.\"\n</p>\n<p>\nSamurah bin Jundab repoted that the Prophet (ﷺ) said: \"Do not live among the idolaters, and do not assemble with them, for whoever lives among them or assembles with them then he is similar to them.\"\n</p>\n</p></b>",
        "bookID": "21.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 716980,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 616990,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "43.00",
        "babName": "What Has Been Related About Expelling The Jews And The Christians From The Arabian Peninsula",
        "hadithNumber": 1606,
        "hadithText": "Narrated 'Umar bin Al-Khattab:\nThat the Messenger of Allah (ﷺ) said: \"If I live - if Allah wills - I will expel the Jews and the Christians from the Arabian Peninsula.\"</b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 716990,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 617000,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "43.00",
        "babName": "What Has Been Related About Expelling The Jews And The Christians From The Arabian Peninsula",
        "hadithNumber": 1607,
        "hadithText": "Narrated Jabir bin ‘Abdullah :\n<p>\n\"Umar bin Al-Khattab informed me that he heard the Messenger of Allah (ﷺ) say: 'I will expel the Jews and the Christians from the Arabian Peninsula, and I will not leave anyone in it except a Muslim.\"\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 717000,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 617010,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "44.00",
        "babName": "What Has Been Related About What The Messenger Of Allah (saws) Left Behind",
        "hadithNumber": 1608,
        "hadithText": "Narrated Abu Hurairah:\n<p>\n\"Fatimah came to Abu Bakr and said: 'Who will inherit from you?' He said: 'My family and my son.' She said: 'So what about me? I do not get inheritance from my father?' So Abu Bakr said: 'I heard the Messenger of Allah (ﷺ) say: 'We are not inherited from' but I support those whom the Messenger of Allah (ﷺ) used to support, and I spend upon those whom the Messenger of Allah (ﷺ) spent upon.\"\n</p>\n<p>\n[Abu 'Eisa said:] There are narrations on this topic from 'Umar, Talhah, Az-Zubair, 'Abdur-Rahman bin 'Awf, Sa'd and 'Aishah.\n</p>\n<p>\nThe Hadith of Abu Hurairah is Hasan Gharib from this route. It is only reported with a chain by Hammad bin Salamah and 'Abdul Wahhab bin 'Ata, from Muhammad bin 'Amr, from Abu Salamah, from Abu Hurairah.\n</p>\n<p>\nI asked Muhammad about this Hadith and he said: \"No one is known to have reported it from Muhammad bin 'Amr, from Abu Salamah, from Abu Hurairah except from Hammad bin Salamah. 'Abdul Wahhab bin 'Ata reported it from Muhammad bib 'Amr, from Abu Salamah, and from Abu Hurairah and it is similar to the narration of Hammad bin Salamah. And this Hadith has been reported through other routes from Abu Bakr As-Siddiq, from the Prophet (ﷺ).\n</p></b>",
        "bookID": "21.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 717010,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 617020,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "44.00",
        "babName": "What Has Been Related About What The Messenger Of Allah (saws) Left Behind",
        "hadithNumber": 1609,
        "hadithText": "Narrated Abu Hurairah:\n<p>\nThat Fatimah came to Abu Bakr and 'Umar may Allah be pleased with them both, to ask them about her inheritance from the Messenger of Allah (ﷺ). They said: \"We heard the Messenger of Allah (ﷺ) say: 'I am not inherited from.'\" So she said: 'By Allah! I will never talk to you two again.' So she died having not talked to them.\"\n</p>\n<p>\n'Ali bin 'Eisa said: \"The meaning of not speaking to you two is: 'Never again regarding this inheritance, because you two are truthful.'\"\n</p></b>",
        "bookID": "21.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 717020,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 617030,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "44.00",
        "babName": "What Has Been Related About What The Messenger Of Allah (saws) Left Behind",
        "hadithNumber": 1610,
        "hadithText": "Narrated Malik bin Aws bin Al-Hadathan:\n<p>\n\"I entered upon 'Umar bin Al-Khattab. (Then) Uthman bin 'Affan, Az-Zubair, 'Abdur-Rahman bin Awf, and Sa'd bin Abi Waqqas entered. Then 'Ali and Al-'Abbas came disputing. 'Umar said to them: ' I ask you, by Allah the One by Whose Will the heavens and the earth are maintained, do you know that the Messenger of Allah (ﷺ) said: \"We are not inherited from, what we leave is charity?\" They said: 'Yes.' 'Umar said: 'When the Messenger of Allah (ﷺ) died, Abu Bakr said: \"I am the caretaker of the Messenger of Allah (ﷺ)\" So you and he went to Abu Bakr and you sought your inheritance from the son of your brother, and he sought the inheritance of his wife from her father. So Abu Bakr said that the Messenger of Allah (ﷺ) said: \"We are not inherited from, what we leave is charity.\" And Allah knows that he is truthful, innocent, instructing and following the truth.'\"\n</p>\n<p>\n[Abu 'Eisa said:] There is a lengthy story along with the Hadith. And this Hadith is Hasan Sahih Gharib as a narration of Malik bin Anas.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 717030,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 617040,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "45.00",
        "babName": "What Has Been Related About What The Prophet (saws) Said On The Day Of The Conquest: Verily This Is Not To Be Battled Over After Today",
        "hadithNumber": 1611,
        "hadithText": "Narrated Al-Harith bin Malik bin Al-Barsa':\n<p>\n\"On the day of the Conquest of Makkah, I heard the Prophet (ﷺ) saying: 'This is not to be battled over after today, until the Day of Judgement.'\"\n</p>\n<p>\n[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Abbas, Sulaiman bin Surad, and Muti'\n</p>\n<p>\nThis Hadith is Hasan Sahih, and it is a narration of Zakariyya bin Abi Za'idah from Ash-Sha'bi, we do not know of it except from his narration.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 717040,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 617050,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "46.00",
        "babName": "What Has Been Related About The Hour In Which It Is Recommend To Fight",
        "hadithNumber": 1612,
        "hadithText": "Narrated An-Nu'man bin Muqarrin :\n<p>\n\"I fought along with the Prophet (ﷺ), and if Fajr had begun he would wait until the sun rose, and when it rose he would fight. And if it was the middle of the daytime, he would wait until the sun passed the zenit, and when it passed the zenith he would fight until 'Asr. Then he would wait until he prayed 'Asr, then he would fight.\" He said: \"And it is used to be said during that (time) the the wind of victory was raging, and the believers would supplicate for their armies in their Salat.\"\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith has been reported from An-Nu'man bin Muqarrin through a chain that is more connected that this. Qatadah did not see An-Nu'man bin Muqarrin. An-Nu'man died during the Khilafah of 'Umar.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 717050,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 617060,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "46.00",
        "babName": "What Has Been Related About The Hour In Which It Is Recommend To Fight",
        "hadithNumber": 1613,
        "hadithText": "Narrated Ma'qil bin Yasar:\n<p>\n\"Umar bin Al-Khattab sent An-Nu'man bin Muqarrin to Al-Hurmuzan.\" And he mentioned the Hadith in its entirety. An-Nu'man bin Muqarrin said: \"I participated (in battles) with the Messenger of Allah (ﷺ). So when he did not fight in the beginning if the daytime, he would wait until the sun passed the zenith, and the wind of victory would rage, and victory would descent upon them.\"\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih. 'Alqamah bin 'Abdullah (one of the narrators) is the brother of Bakr bin 'Abdullah Al-Muzani. \n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 717060,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 617070,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "47.00",
        "babName": "What Has Been Related About At-Tiyarah (Bad Omens)",
        "hadithNumber": 1614,
        "hadithText": "Narrated 'Abdullah bin Mas'ud:\n<p>\nThat the Messenger of Allah (ﷺ) said: \"At-Tiyarah is from Shirk, and none among us (it influences) except that Allah will remove it with Tawakkul (reliance).\"\n</p>\n<p>\n[Abu 'Eisa said:] I heard Muhammad bin Isma'il saying: \"Sulaiman bin Harb used to say about this Hadith: 'And none among us (it influences) except that Allah will remove it with Tawakkul (reliance)' - Sulaiman would say: 'To me, this is a saying of 'Abdullah bin Mas'ud.'\"\n</p>\n<p>\nThere are narrations on this topic from Sa'd, Abu Hurairah, Habis At-Tamimi, 'Aishah and Ibn 'Umar.\n</p>\n<p>\nThis Hadith is Hasan Sahih, we do not know of it except as a narration of Salamah bin Khuail. Shu'bah also reported this Hadith from Salamah.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 717070,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 617080,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "47.00",
        "babName": "What Has Been Related About At-Tiyarah (Bad Omens)",
        "hadithNumber": 1615,
        "hadithText": "Narrated Anas:\n<p>\nThat the Messenger of Allah (ﷺ) said: \"There is no 'Adwa and no Tiyarah, and I like Fa'l.\" They said: \"O Messenger of Allah! What is Fa'l?\" He said: \"A good statement.\"\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 717080,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 617090,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "47.00",
        "babName": "What Has Been Related About At-Tiyarah (Bad Omens)",
        "hadithNumber": 1616,
        "hadithText": "Narrated Anas bin Malik:\n<p>\nThat the Prophet (ﷺ) used to like it when he set out upon an affair if he heard: \"O directed one, O successful one.\"\n</p>\n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.\n</p></b>",
        "bookID": "21.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 717090,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 617100,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "48.00",
        "babName": "What Has Been Related About The Exhortation Of The Prophet (saws) Regarding Fighting",
        "hadithNumber": 1617,
        "hadithText": "Narrated Sulaiman bin Buraidah:\n<p>\nFrom his father who said: \"When the Messenger of Allah (sawS) sent a commander of an army, he would exhort him concerning himself to have Taqwa of Allah, and he would exhort him to be good to those who are with him among the Muslims. He would say: 'Fight in the Name of Allah, in the cause of Allah. Fight those who disbelieve in Allah, and do not steal from the spoils of war or be treacherous, nor mutilate, and do not kill a child. When you meet your enemy among the idolaters, then call them to one of the three options or choices, whichever of them they respond to then accept it from them, and refrain from them. Call them to Islam, and to relocate from their land to the land of Emigrants. Inform them that if they do that, then they will have similar to what those who emigrated have, and from them will be required similar to what is required from those who have emigrated. And if they refuse to relocate, then inform them that they will be like the Bedouins among the Muslim, and they will be treated the same as Bedouins are\ntreated. There is no war spoils or Fay' for them, unless they fight along with the Muslims. If they refuse then seek aid from Allah against them and fight them. And if you lay siege to a fortress and they want you to grant them covenant from Allah and a covenant of His Prophet, then do not grant them the covenant of Allah nor the covenant of His Prophet. Rather grant them your own covenant and the covenant of your companions, it will be better than breaking Allah's covenant and the covenant of His Messenger. And if you lay siege to the people of a fortress and they want you to lift the siege for negotiating upon the judgement of Allah, then do not stop, but rather make them surrender to your judgement, for you do not know if you will come upon the judgement of Allah regarding them or not.' Or similar to that.\"\n</p>\n<p>\n[Abu 'Eisa said:] There is something on this topic from An-Nu'man bin Muqarrin, and the Hadith of Buraidah is a Hasan Sahih Hadith\n</p></b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 717100,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 617110,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "48.00",
        "babName": "What Has Been Related About The Exhortation Of The Prophet (saws) Regarding Fighting",
        "hadithNumber": 1617,
        "hadithText": "<p>\nMuhammad bin Bash-shar narrated to us (he said): \"Abu Ahmad narrated to us from Sufyan (who said): \"Alqamah bin Marthad narrated to us' - and it is similar in its meaning, but he added in it: \"if they refuse, then take the Jizyah from them, and it they refuse then seek aid from Allah against them.\"\n</p>\n<p>\n[Abu 'Eisa said:] This is how it was reported from Waki' and others from Sufyan. And other than Muhammad bin Bash-shar reported it from 'Abdur-Rahman bin Mahdi, and he mentioned the matter of the Jizyah in it.\n</p></b>",
        "bookID": "21.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 717110,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 617120,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "48.00",
        "babName": "What Has Been Related About The Exhortation Of The Prophet (saws) Regarding Fighting",
        "hadithNumber": 1618,
        "hadithText": "Narrated Anas bin Malik:\nThat the Prophet (ﷺ) would not attack except near the time of Fajr, so if he heard the Adhan he would refrain, and if not, then he would attack. So he listened one day and heard a man saying: \"Allahu Akbar, Allahu Akbar,\" so he said: \"Upon the Fitrah.\" Then he said: \"I bear witness that none has the right to be worshipped but Allah.\" So he said: \"You have departed from the Fire.\"</b>",
        "bookID": "21.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 717120,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 617130,
        "collection": "tirmidhi",
        "volumeNumber": 3,
        "bookNumber": 19,
        "bookName": "The Book on Military Expeditions",
        "babNumber": "48.00",
        "babName": "What Has Been Related About The Exhortation Of The Prophet (saws) Regarding Fighting",
        "hadithNumber": 1618,
        "hadithText": "Another chain with similar narrations. \n<p>\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.\n</p></b>",
        "bookID": "21.0",
        "grade1": null,
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 717130,
        "last_updated": "2012-04-26 14:00:00"
    }
]