[
    {
        "englishURN": 628050,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Chapters on Faith From the Messenger of Allah (SAW)",
        "babNumber": "1.00",
        "babName": "What Has Been Related About \"I Have Been Ordered To Fight The People Until They Say: La Ilaha Illallah\"",
        "hadithNumber": 2606,
        "hadithText": "Narrated Abu Hurairah:\nnarrated that the Messenger of Allah (ﷺ) said: \"I have been ordered to fight the people until they say La Ilaha Illallah\", and if they say that, then their blood and wealth will be protected from me, except what it makes obligatory upon them, and their reckoning is up to Allah.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "There are narrations on this topic from Jabir, Abu Sa'eed and Ibn 'Umar.\r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
        "ourHadithNumber": 1,
        "matchingArabicURN": 728050,
        "last_updated": "2013-05-01 05:15:40"
    },
    {
        "englishURN": 628060,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "1.00",
        "babName": "What Has Been Related About \"I Have Been Ordered To Fight The People Until They Say: La Ilaha Illallah\"",
        "hadithNumber": 2607,
        "hadithText": "Narrated Abu Hurairah:\nsaid: \"When the Messenger of Allah (ﷺ) died and Abu Bakr became the Khalifah after him, whoever disbelieved from the Arabs disbelieved, so Umar bin Al-Khattab said to Abu Bakr: 'How will you fight the people while the Messenger of Allah has said: 'I have been ordered to fight the people until they say La Ilaha Illallah, and if they say that, then their blood and wealth will be protected from me, except what it makes obligatory upon them, and their reckoning is with Allah?' So Abu Bakr said: 'By Allah I will fight whoever differentiates between Salat and Zakat. For indeed, Zakat is the right due upon wealth. And by Allah! If they withhold even (camel) tethers which they used to give to the Messenger of Allah (ﷺ) I will fight them for withholding it.' So Umar bin Al-Khattab said: 'By Allah! I saw that Allah had opened Abu Bakr's chest to fighting, so I knew that it was correct.'\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih.\r\n\r\nShu'aib bin Abu Hamzah reported it similarly from Az-Zuhri, from Ubaidullah bin Abdullah bin Utbah from Abu Hurairah. Imran al-Qattan reported this Hadith from Ma'mar from Az-Zuhri, from Anas bin Malik, from Abu Bakr, but this narration is mistaken in narrating from Ma'mar.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 728060,
        "last_updated": "2012-04-26 14:00:00"
    },
    {
        "englishURN": 628070,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "2.00",
        "babName": "What Has Been Related About The State of The Prophet (SAW): \"I Have Been Ordered To FIght The People Until They Say La Ilaha Illallah And Establish The Salah",
        "hadithNumber": 2608,
        "hadithText": "Narrated Anas bin Malik:\nthat the Messenger of Allah (ﷺ) said: \"I have been ordered to fight the people until they bear witness to La Ilaha Illallah, and that Muhammad is His servant and Messenger, and they face our Qiblah, eat our slaughtered (meat), and perform our Salat. And if they do that, then their blood and wealth will be unlawful to us, except with its due right. For them shall be whatever is for the Muslims, and they shall be obliged with that which the Muslims are obliged.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "There are narrations on this topic from Mu'adh bin Jabal and Abu Hurairah.\r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib from this route. Yahya bin Ayyub reported it similarly from Humaid bin Anas.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 728070,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628080,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "3.00",
        "babName": "What Has Been Related About \"Islam Is Based Upon Five.\"",
        "hadithNumber": 2609,
        "hadithText": "Narrated Ibn 'Umar:\nthat the Messenger of Allah (ﷺ) said: \"Islam is based upon five: the testimony of La Ilaha Illallah, and that Muhammad is the Messenger of Allah, the establishment of the Salat, giving the Zakat, fasting (the month of) Ramadan, and performing Hajj to the House.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "There is something on this topic from Jarir bin Abdullah.\r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.\r\nSimilar to this had been reported through other routes from Ibn Umar from the Prophet (SAW). Su'air bin Al-Khims is trustworthy according to the people of Hadith.\r\n(Another chain with similar narration) from 'Ikrimah bin Khalid Al-Makhzumi from Ibn Umar from the Prophet (SAW)\r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
        "ourHadithNumber": 4,
        "matchingArabicURN": 728080,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628100,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "4.00",
        "babName": "What Has Been Related About Jibril Describing Iman and Islam to the Prophet (SAW)",
        "hadithNumber": 2610,
        "hadithText": "Narrated Abdullah bin Buraidah from Yahya bin Ya'mur who said:\n\"The first person to speak about Al-Qadar was Ma'bad Al-Juhani.\" He said: \"Humaid bin Abdur-Rahman Al-Himyari and I went out until we reached Al-Madinah, and we said: 'If we could only meet someone among the companions of the Prophet (ﷺ) so we could ask him about what those people have innovated.\" [He said:] \"So we met him - meaning Abdullah bin 'Umar - while he was leaving the Masjid.\" [He said:] \"My companion and I were on either side of him.\" [He said:] I thought my companion was going to leave the speaking to me so I said: \"O Abu Abdur-Rahman! There is a group of people who recite the Qur'an and seek knowledge, and they claim there is no Al-Qadar, and that the affair is left to chance.' He said: \"Whenever you meet those people, then tell them that I am not of them and they are not of me. By the One Whom Abdullah swears by! If one of them were to spend gold the like of Uhud (mountain) in charity, it would not be accepted from him until he believes in Al-Qadar; the good of it and the bad of it.'\" He said: \"Then he began to narrate, he said: \"'Umar bin Al-Khattab said: \"We were with the Messenger of Allah when a man came with extremely white garments, and extremely black hair. He had no appearance of traveling visible on him, yet none of us recognized him. He came until he reached the Prophet (ﷺ). He put his knees up against his knees, and then said: \"O Muhammad! What is Iman?' He said 'To believe in Allah, His Angels, His, Books, His Messengers, the Day of Judgement, and Al-Qadar, the good of it and the bad of it.' He said: 'Then what is Islam?' He said: 'Testifying to La Ilaha Illallah, and that Muhammad is His servant and Messenger, establishing the Salat, giving the Zakat, performing Hajj to the House, and fasting (the month of) Ramadan.' He said: 'Then what is Ihsan?' He said 'That (is) you worship Allah as if you see Him, and although you do not see Him, He certainly sees you.' He said: 'For all of those he replied to him: 'You have told the truth.'\" He said: \"So we were amazed at him, he would ask, and then tell him that he is telling the truth. He said: 'Then when is the Hour?' He (ﷺ) said: 'The one being asked knows no more than the questioner.' He said: 'Then what are its signs?' He said: 'That the slave woman gives birth to her master, and that the naked, poor, and bare-footed shepherds rival each other in the height of the buildings.'\" 'Umar said: 'Then the Prophet (ﷺ) met me three days after that and said: 'O 'Umar! Do you know who the questioner was? It was Jibril. He came to teach you about the matters of your religion.'\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "(Another chain) with similar in meaning.\r\n(Another chain) with similar in meaning.\r\nThere are narrations on this topic from Talhah bin Ubaidullah, Anas bin Malik and ABu Hurairah.\r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.\r\nSimilar to this has been reported through other routes [from 'Umar]. And this Hadith has been reported from Ibn 'Umar from the Prophet (SAW); but what is correct is that it is from Ibn 'Umar, from 'Umar from the Prophet (SAW)",
        "ourHadithNumber": 5,
        "matchingArabicURN": 728100,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628130,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "5.00",
        "babName": "What Has Been Related Linking The Obligations To Iman",
        "hadithNumber": 2611,
        "hadithText": "Narrated Ibn 'Abbas:\n\"A delegation of Abdul-Qais came to the Messenger of Allah (ﷺ) and said: 'We are a tribe from Rabi'ah, and we cannot come to you except during the sacred months. So order us with something that we can take from you, and then we call those who are behind us to it.'\n\nSo he said: 'I order you with four things: To testify to La Ilaha Illallah, and that I am the Messenger of Allah; to establish the Salat, to give the Zakat, and to give the Khumus from the spoils of war that you gain.'\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "(Another chain) with similar narration from the Prophet (SAW).\r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.\r\nAbu Jamrah Ad-Duba'i's (a narrator in the chain) name is Nasr bin Imran. Shu'bah also reported it from Abu Jamrah but he added: \"Do you know what Iman is? To testify to La Ilaha Illallah, and that I am the Messenger of Allah,\" and then he mentioned the Hadith.\r\nI heard Qutaibah bin Sa'eed say: \"I have not seen the likes of these four great Fuqaha': Malik bin Anas, Laith bin Sa'd, 'Abbad bin 'Abbad Al-Muhallabi and Abdul Wahhab Ath-Thaqafi.\" Qutaibah said: \"We used to be happy to return everyday from 'Abbad bin 'Abbad with two Hadith.\" 'Abbad bin 'Abbad is among the sons of Al-Muhallab bin Abi Sufrah.",
        "ourHadithNumber": 6,
        "matchingArabicURN": 728130,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628150,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "6.00",
        "babName": "Regarding The Completion Of Faith, Its Increasing And Decreasing",
        "hadithNumber": 2612,
        "hadithText": "Narrated 'Aishah:\nthat the Messenger of Allah (ﷺ) said: \"Indeed among the believers with the most complete faith is the one who is the best in conduct, and the most kind to his family.\"</b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "There are narrations on this topic from Abu Hurairah and Anas bin Malik.\r\n[Abu 'Eisa said:] This Hadith is Hasan [Sahih]; we do not know of Abu Qilabah hearing from Aishah. Abu Qilabah reported Ahadith other than this one from Abdullah bin Yazid - Aishas foster son - from Aishah.\r\nAbu Qilabah's name is Abdullah bin Zaid Al-Jarmi.\r\nIbn Abi 'Umar narrated to us (he said): \"Sufyan bin Uyainah narrated to us, he said: 'Ayyub As-Sakhtiyani mentioned Abu Qilabah, then said: \"By Allah! He was among the insightful Fuqaha'.\"",
        "ourHadithNumber": 7,
        "matchingArabicURN": 728150,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628160,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "6.00",
        "babName": "Regarding The Completion Of Faith, Its Increasing And Decreasing",
        "hadithNumber": 2613,
        "hadithText": "Narrated Abu Hurairah:\nthat the Messenger of Allah (ﷺ) delivered a Khtubah in which he exhorted them, then he said: \"O women! Give charity for you are the majority of the people of the Fire.\" A woman among them said: \"And why is that O Messenger of Allah?\" He said: \"Because of your cursing so much.\" - meaning your ungratefulness towards your husbands. He said: \"And I have not seen any among those lacking in intellect and religion who are more difficult upon people possessing reason and insight than you.\" A woman among them said: \"And what is the deficiency of her intellect and religion?\" He said: \"The testimony of two women among you is like the testimony of a man, and the deficiency in your religion is menstruation, because one of you will go three or four days without performing Salat.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "There are narrations on this topic from Abu Sa'eed and Ibn 'Umar.\r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih [from this route].",
        "ourHadithNumber": 8,
        "matchingArabicURN": 728160,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628170,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "6.00",
        "babName": "Regarding The Completion Of Faith, Its Increasing And Decreasing",
        "hadithNumber": 2614,
        "hadithText": "Narrated Abu Hurairah:\nthat the Messenger of Allah (ﷺ) said: \"Faith has seventy-some odd doors, the lowest of which is removing something harmful from the road, and its highest is the statement 'La Ilaha Illallah.'\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih. Suhail bin Abi Salih narrated it this way from 'Abdullah bin Dinar, from Abu Salih from Abu Hurairah.\r\nUmarah bin Ghaziyyah narrated this Hadith from Abu Salih, from Abu Hurairah from the Prophet (SAW), that he said: \"Faith has sixty-four doors.\"\r\nThis was narrated to us by Qutaibah (he said): \"Bakr bin Mudar narrated to us from Umarah bin Ghaziyyah, from Abu Salih, from Abu Hurairah from the Prophet (SAW).",
        "ourHadithNumber": 9,
        "matchingArabicURN": 728170,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628190,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "7.00",
        "babName": "What Has Been Related About \"Al-Haya' (Modesty) Is Part of Faith\"",
        "hadithNumber": 2615,
        "hadithText": "Narrated Ibn 'Umar:\nthat the Messenger of Allah (ﷺ) passed by a man and he was chastising his brother about modesty, so the Messenger of Allah (ﷺ) said: \"Al-Haya' is part of faith.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[He said:] This Hadith is Hasan Sahih.\r\nThere are narrations on this topic from Abu Hurairah, [Abu Bakrah and Abu Umamah].",
        "ourHadithNumber": 10,
        "matchingArabicURN": 728190,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628200,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "8.00",
        "babName": "What Has Been Related About The Scaredness Of Salat",
        "hadithNumber": 2616,
        "hadithText": "Narrated Mu'adh bin Jabal:\n\"I accompanied the Prophet (ﷺ) on a journey. One day I was near him while we were moving so I said: 'O Messenger of Allah! Inform me about an action by which I will be admitted into Paradise, and which will keep me far from the Fire.' He said: 'You have asked me about something great, but it is easy for whomever Allah makes it easy: Worship Allah and do not associate any partners with Him, establish the Salat, give the Zakat, fast Ramadan and perform Hajj to the HOuse.' Then he said: 'Shall I not guide you to the doors of good? Fasting is a shield, and charity extinguishes sins like water extinguishes fire - and a man's praying in depths of the night.'\" He said: \"Then he recited: 'Their sides forsake their beds to call upon their Lord.' Until he reached: 'What they used to do.' [32:16-17]\n\nThen he said: 'Shall I not inform you about the head of the entire matter, and its pillar, and its hump?' I said: 'Of course O Messenger of Allah! He said: 'The head of the matter is Islam, and its pillar is the Salat, and its hump is Jihad.' Then he said: 'Shall I not inform you about what governs all of that?' I said: 'Of course O Messenger of Allah!'\" He (ﷺ) said: \"So he grabbed his tongue. He said 'Restrain this.' I said: 'O Prophet of Allah! Will we be taken to account for what we say?' He said: 'May your mother grieve your loss O Mu'adh! Are the people tossed into the Fire upon their faces, or upon their noses, except because of what their tongues have wrought'\"</b>",
        "bookID": "40.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
        "ourHadithNumber": 11,
        "matchingArabicURN": 728200,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628210,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "8.00",
        "babName": "What Has Been Related About The Sacredness Of Salat",
        "hadithNumber": 2617,
        "hadithText": "Narrated Abu Sa'eed:\nthat the Messenger of Allah (ﷺ) said: \"If you see a man who comes to the Masjid then bear witness to his faith.\" Because Allah, the Exalted, says: Only those who believe in Allah, and the Last Day, and establish the Salat, and give the Zakat (should) maintain the Masajid until the end of the Ayah (9:18)</b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Gharib.",
        "ourHadithNumber": 12,
        "matchingArabicURN": 728210,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628220,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "9.00",
        "babName": "What Has Been Related About Abandoning The Salat",
        "hadithNumber": 2618,
        "hadithText": "Narrated Jabir:\nthat the Prophet (ﷺ) said: \"Between disbelief and faith is abandoning the Salat.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 728220,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628230,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "9.00",
        "babName": "What Has Been Related About Abandoning The Salat",
        "hadithNumber": 2619,
        "hadithText": "Narrated Al-A'mash:\nSimilar to the previous chain and said: \"Between a slave and Shirk or disbelief is abandoning the Salat.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih.\r\nAbu Sufyan's name is Talhah bin Nafi'.",
        "ourHadithNumber": 14,
        "matchingArabicURN": 728230,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628240,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "9.00",
        "babName": "What Has Been Related About Abandoning The Salat",
        "hadithNumber": 2620,
        "hadithText": "Narrated Jabir:\nthat the Messenger of Allah (ﷺ) said: \"Between a slave of Allah and disbelief is abandoning the Salat.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih.\r\n\r\nAbu Az-Zubair's (a narrator in the chain) name is Muhammad Bin Muslim Bin Tadrus.",
        "ourHadithNumber": 15,
        "matchingArabicURN": 728240,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628250,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "9.00",
        "babName": "What Has Been Related About Abandoning The Salat",
        "hadithNumber": 2621,
        "hadithText": "Narrated Abdullah bin Buraidah narrated from his father:\nthat the Messenger of Allah (ﷺ) said: \"The covenant between us and them is the Salat, so whoever abandons it he has committed disbelief.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "There are narrations on this topic from Anas and Ibn Abbas.\r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.",
        "ourHadithNumber": 16,
        "matchingArabicURN": 728250,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628260,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "9.00",
        "babName": "What Has Been Related About Abandoning The Salat",
        "hadithNumber": 2622,
        "hadithText": "Narrated Abdullah bin Shaqiq Al-'Uqayli:\nThe Companions of Muhammad (ﷺ) didn't consider leaving anything to be disblief except for the Salat.</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] I heard Abu Mus'ab Al-Madani say: \"Whoever said: 'Faith is merely statements' then he should be told to repent, and he either repents or his neck should be severed.\"",
        "ourHadithNumber": 17,
        "matchingArabicURN": 728260,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628270,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "10.00",
        "babName": "The Hadith: \"He Has Tasted The Sweetness Of Faith\" And The Hadith: \"There Are Three Things For Which Whomever Has Them Then He Has Tasted The Sweetness Of Faith\"",
        "hadithNumber": 2623,
        "hadithText": "Narrated Al-Abbas bin Abdul-Muttalib:\nthat he heard the Messenger of Allah (ﷺ) say: \"Whoever is pleased with Allah as (his) Lord, and Islam as (his) religion, and Muhammad as (his) Prophet, then he has tasted the sweetness of faith.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
        "ourHadithNumber": 18,
        "matchingArabicURN": 728270,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628280,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "10.00",
        "babName": "The Hadith: ",
        "hadithNumber": 2624,
        "hadithText": "Narrated Anas bin Malik:\nthat the Messenger of Allah (ﷺ) said: \"There are three things for which whomever has them, then he has tasted the sweetness of faith: The one for whom Allah and His Messenger are more beloved than anything else; whoever loves someone and he does not love him except for the sake of Allah, and whoever hates to return to disbelief after Allah has saved him from it, just as he hates to be thrown into fire.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih.\r\nQatadah reported it from Anas bin Malik from the Prophet (SAW).",
        "ourHadithNumber": 19,
        "matchingArabicURN": 728280,
        "last_updated": "2014-12-18 08:12:53"
    },
    {
        "englishURN": 628290,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "11.00",
        "babName": "What Has Been Related About \"The Adulterer Does Not Commit Adultery While He Is A Believer\"",
        "hadithNumber": 2625,
        "hadithText": "Narrated Abu Hurairah:\nthat the Messenger of Allah (ﷺ) said: \"The adulterer is not a believer while he is committing adultery, and the thief is not a believer while he is stealing, but there is a chance for repentance; (if he repents, Allah will accept the repentance).\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "There are narrations on this topic from Ibn 'Abbas, 'Aishah, 'Abdullah bin Abi Awfa.\r\n[Abu 'Eisa said:] The Hadith of Abu Hurairah is a Hasan Sahih Gharib Hadith from this route.\r\nIt has been reported from Abu Hurairah from the Prophet (SAW) that he said: \"If a worshiper commits adultery then faith leaves him, so it remains above his head like a shadow, then if he leaves that action the faith returns to him.\"\r\nIt was reported that Abu Ja'far Muhammad bin Ali said: \"In this is a departure from faith to Islam.\"\r\nThrough other routes, it has been reported that the Prophet (SAW) said about adultery and theft: \"Whoever does any of that then the penalty (for the crime) is implemented upon him, that will be an atonement for his sin. And whoever does any of that, and Allah covers it for him, then it is up to Allah, the Exalted - if He wishes, He punishes him on the Day of Judgment, and if He wishes, He forgives him. This was narrated by Ali bin Abi Talib, Ubadah bin As-Samit and Khuzaymah bin Thabit from the Prophet (SAW).",
        "ourHadithNumber": 20,
        "matchingArabicURN": 728290,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628300,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "11.00",
        "babName": "What Has Been Related About \"The Adulterer Does Not Commit Adultery While He Is A Believer\"",
        "hadithNumber": 2626,
        "hadithText": "Narrated Ali bin Abu Talib:\nthat the Prophet (ﷺ) said: \"Whoever is penalized (for a crime) then his punishment has been hastened for him in the world, for Allah is more just than to double the punishment upon His slave in the Hereafter. And whoever does a punishable act and then Allah covers it for him and forgives him, then Allah is more kind than to recount something which He has already forgiven.\"</b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Gharib [Sahih]. This is the saying of the people of knowledge, and I do not know anyone who made Takfir of anyone for adultery, theft or drinking intoxicants.",
        "ourHadithNumber": 21,
        "matchingArabicURN": 728300,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628310,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "12.00",
        "babName": "What Has Been Related [About] \"The Muslims Is The One From (The Harm Of) Whose Tongue And Hand (other) Muslims Are Safe\"",
        "hadithNumber": 2627,
        "hadithText": "Narrated Abu Hurairah:\nthat the Messenger of Allah (ﷺ) said: \"The Muslim is the one from (the harm of) whose tongue and hand (other) Muslims are safe, and the believer is the one with whom the people trust their blood and their wealth.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih.\r\nIt has been related that the Prophet (SAW) was asked: \"Which of the Muslims is the most virtuous?\" He said: \"From (the harm of) whose tongue and hand (other) Muslims are safe.\" [There are narrations on this topic from Jabir, Abu Musa and 'Abdullah bin 'Amr regarding this topic].",
        "ourHadithNumber": 22,
        "matchingArabicURN": 728310,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628320,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "12.00",
        "babName": "What Has Been Related [About] \"The Muslims Is The One From (The Harm Of) Whose Tongue And Hand (other) Muslims Are Safe\"",
        "hadithNumber": 2628,
        "hadithText": "Narrated Abu Musa Al-Ash'ari:\nthat the Prophet (ﷺ) was asked: \"Which of the Muslims is most virtuous?\" He said: \"The one from (the harm of) whose tongue and hand (other) Muslims are safe.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Sahih Gharib [Hasan] as a narration of Abu Musa Al-Ash'ari from the Prophet (SAW).\r\nThere are narrations on this topic from Jabir, Abu Musa, and 'Abdullah bin 'Amr. The Hadith of Abu Hurairah is a Hasan Sahih Hadith.",
        "ourHadithNumber": 23,
        "matchingArabicURN": 728320,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628330,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "13.00",
        "babName": "What Has Been Related About \"Islam Began As Something Strange And It Will Return To Being Something Strange\"",
        "hadithNumber": 2629,
        "hadithText": "Narrated 'Abdullah bin Mas'ud:\nthat the Messenger of Allah (ﷺ) said: \"Indeed Islam began as something strange and it will return to being strange as it began. So Tuba is for the strangers.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "There are narrations on this topic from Sa'd, Ibn 'Umar, Jabir, Anas and 'Abdullah bin 'Amr. [Abu 'Eisa said:] This Hadith is Hasan Gharib Sahih as a narration of Ibn Mas'ud, and we only know of it as a narration of Hafs bin Ghiyath from Al-A'mash. And Abu Al-Ahwas's name is 'Awf bin Malik bin Nadlah Al-Jushami (narrators in the chain), and Hafs was the only one who narrated it.",
        "ourHadithNumber": 24,
        "matchingArabicURN": 728330,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628340,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "13.00",
        "babName": "What Has Been Related About \"Islam Began As Something Strange And It Will Return To Being Something Strange\"",
        "hadithNumber": 2630,
        "hadithText": "Narrated Kathir bin 'Abdullah bin 'Amr bin 'Awf bin Zaid bin Milhah narrated from his father, from his grandfather:\nthat the Messenger of Allah (ﷺ) said: \"Indeed the religion with creep into the Hijaz just like a snake creeps into its hole, and the religion will cling to the Hijaz just like the female mountain goat cling to the peak of a mountain. Indeed the religion began as something strange and it will return to being strange. So Tuba is for the strangers who correct what the people have corrupted from my Sunnah after me.\"</b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan [Sahih].",
        "ourHadithNumber": 25,
        "matchingArabicURN": 728340,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628350,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "14.00",
        "babName": "What Has Been Related About The Signs Of The Hypocrite",
        "hadithNumber": 2631,
        "hadithText": "Narrated Abu Hurairah:\nthat the Messenger of Allah (ﷺ) said: \"The sign of a hypocrite is that whenever he speaks he lies, and whenever he makes a promise he does not fulfill it, and if he is entrusted he betrays.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of Al-'Ala. It has been reported through other routes from Abu Hurairah from the Prophet (SAW).\r\nThere are narrations on this topic from 'Abdullah bin Mas'ud, Anas and Jabir.\r\n(Another chain) from Abu Hurairah that the Prophet (SAW) said similarly with the same meaning.\r\n[Abu 'Eisa said:] This is a Sahih Hadith. Abu Suhail is the paternal uncle of Malak bin Anas, and his name is Nafi' bin Malik bin Abi 'Amir Al-Asbahi Al-Khawlani.",
        "ourHadithNumber": 26,
        "matchingArabicURN": 728350,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628370,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "14.00",
        "babName": "What Has Been Related About The Signs Of The Hypocrite",
        "hadithNumber": 2632,
        "hadithText": "Narrated 'Abdullah bin 'Amr:\nthat the Prophet (ﷺ) said: There are four things that whoever has them, then he is a hypocrite, and whoever has one attribute from among them, then he has an attribute of hypocrisy,until he leaves it: Whoever lies whenever he speaks, he does not fulfill whenever he promises, he is vulgar whenever he argues, and whenever he makes an agreement he proves treacherous.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "He said: This Hadith is Hasan Sahih.\r\nAccording to the people of knowledge, this only means the hypocrisy of action, and during the time of the Messenger of Allah (SAW) there was only hypocrisy of rejection (in the hearts). Similar to this has been narrated from Al-Hasan Al-Basri regarding this, he said: \"Hypocrisy is of two types, hypocrisy of action and hypocrisy if rejection.\"\r\n(Another chain) with similar narration.\r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
        "ourHadithNumber": 27,
        "matchingArabicURN": 728370,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628390,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "14.00",
        "babName": "What Has Been Related About The Signs Of The Hypocrite",
        "hadithNumber": 2633,
        "hadithText": "Narrated Zaid bin Arqam:\nthat the Messenger of Allah (ﷺ) said: \"Whenever a man makes a promise and he intends to fulfill it, but he does not fulfill it, then there is no burden upon him.\"</b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Gharib, its chain is not strong. 'Ali bin Abdul-A'la is trustworthy, Abu an-Nu'man is unknown and Abu Waqqas is unknown.",
        "ourHadithNumber": 28,
        "matchingArabicURN": 728390,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628400,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "15.00",
        "babName": "What Has Been Related That \"Verbally Abusing A Muslim Is Disobedience\"",
        "hadithNumber": 2634,
        "hadithText": "Narrated Ibn Mas'ud:\nthat the Messenger of Allah (ﷺ) said: \"A Muslim's fighting his brother is disbelief, and verbally abusing him is disobedience.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "There are narrations on this topic from Sa'd and 'Abdullah bin Mughaffal.\r\n\r\n[Abu 'Eisa said:] The Hadith of Ibn Mas'ud is a Hasan Sahih Hadith. It has been reported from 'Abdullah bin Mas'ud from other routes.",
        "ourHadithNumber": 29,
        "matchingArabicURN": 728400,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628410,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "15.00",
        "babName": "What Has Been Related That \"Verbally Abusing A Muslim Is Disobedience\"",
        "hadithNumber": 2635,
        "hadithText": "Narrated Ibn Mas'ud:\nthat the Messenger of Allah (ﷺ) said: \"Verbally abusing a Muslim is disobedience and fighting him is disbelief.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih. [And the meaning of this Hadith: \"Fighting him is disbelief does not refer to the disbelief that is equal to apostasy from Islam. The proof for this is that it has been reported that the Prophet (SAW) said: \"Whoever is killed on purpose, then those responsible for the one killed have a choice, if they want, they can kill him, and if they want they can forgive him.\"\r\n\r\nWhile if killing was disbelief, it would be obligatory. It has been reported from Ibn Abbas, Tawus, 'Ata' and other among the people of knowledge that they said: \"It is a disbelief below disbelief, and a sin below a sin.\"]",
        "ourHadithNumber": 30,
        "matchingArabicURN": 728410,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628420,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "16.00",
        "babName": "What Has Been Related About The One Who Accuses His Brother Of Disbelief",
        "hadithNumber": 2636,
        "hadithText": "Narrated Ad-Dhahak:\nthat the Prophet (ﷺ) said: \"It is not for a slave (of Allah) to vow about something he does not possess, and cursing a believer is like killing him, and whoever accuses a believer of disbelief, then it is like he has killed him, and whoever kills himself with something, then Allah will punish him with whatever he killed himself with on the Day of Judgement.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "There are narrations on this topic from Abu Dharr and Ibn 'Umar. \r\n\r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
        "ourHadithNumber": 31,
        "matchingArabicURN": 728420,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628430,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "16.00",
        "babName": "What Has Been Related About The One Who Accuses His Brother Of Disbelief",
        "hadithNumber": 2637,
        "hadithText": "Narrated Ibn 'Umar:\nIbn 'Umar narrated that the Prophet (ﷺ) said: \"Whoever says to his brother 'disbeliever' then it will have settled upon one of them.\" Sahih</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib and the meaning of '(Ba')' is settled.",
        "ourHadithNumber": 32,
        "matchingArabicURN": 728430,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628440,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "17.00",
        "babName": "What Has Been Related About Whoever Dies While He Bears Witness To La Ilaha Illallah",
        "hadithNumber": 2638,
        "hadithText": "Narrated As-Sunabihi:\nfrom Ubadah bin As-Samit, he said: \"I entered upon him while he was dying, so I cried, and he said: \"There now, why are you crying? For by Allah, if I am a martyr , then I will intercede for you, and if I can I will benefit you,' then he said: 'By Allah! There is no Hadith which I heard from the Messenger of Allah (ﷺ) which is good for you but I narrate it to you today, while I am near death. I heard the Messenger of Allah (ﷺ) say: \"Whoever testifies to La Ilaha Illallah and that Muhammad is the Messenger of Allah, then Allah has forbidden the fire for him.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "There are narrations on this topic from Abu Bakr, 'Umar, 'Uhtman, 'Ali, Talhah, Jabir, Ibn 'Umar and Zaid bin Khalid.\r\n[He said: I heard Ibn Abi 'Umar say: \"I heard Ibn Uyainah say: 'Muhammad bin 'Ajlan (a narrator in the chain) was trustworthy and reliable in Hadith)\r\nAs-Sunaibi is 'Abdur-Rahman bin Usailah Abu Abdullah.\r\nAbu 'Eisa said: This Hadith is Hasan Sahih Gharib from this route.\r\nIt has been related from Az-Zuhri that he was asked about the statement of the Prophet (SAW): \"Whoever says La Ilaha Illallah, will enter paradise,\" so he said: \"That was only in the beginning of Islam before the revelations of the obligations and the commands and prohibitions.\"\r\n[Abu 'Eisa said:] According to some of the people of knowledge, the meaning of this Hadith is that people of Tawhid will enter Paradise, even if they are punished in the Fire because of their sins, so they will not dwell eternally in the Fire.\r\nIt has been related from ['Abdullah] bin Mas'ud, Abu Dharr, 'Imran bin Husain, Jabir bin 'Abdullah, Ibn Abbas, Abu Sa'eed Al-Khudri and Anas bin Malik that the Prophet (SAW) said: \"A group of people from the people of Tawhid will come out of the Fire and enter Paradise.\"\r\nThis is what has been reported from Sa'eed bin Jubair, Ibrahim An-Nakha'i, and others among the Tabi-in - and it has been reported through other routes from Abu Hurairah, from the Prophet (SAW) - regarding the explanation of the Ayah: And those who disbelieve wish that they were Muslims (15:2). They said: \"When the people of Tawhid are taken out from the Fire and admitted into Paradise, those who disbelieved will wish that they had been Muslims\".",
        "ourHadithNumber": 33,
        "matchingArabicURN": 728440,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628450,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "17.00",
        "babName": "What Has Been Related About Whoever Dies While He Bears Witness To La Ilaha Illallah",
        "hadithNumber": 2639,
        "hadithText": "Narrated 'Abdullah bin 'Amr bin Al-'As:\nthat the Messenger of Allah (ﷺ) said: \"Indeed Allah will distinguish a man from my Ummah before all of creation on the Day of Judgement. Ninety-nine scrolls will be laid out for him, each scroll is as far as the eye can see, then He will say: 'Do you deny any of this? Have those who recorded this wronged you?' He will say: 'No, O Lord!' He will say: Do you have an excuse?' He will say: 'No, O Lord!' So He will say: 'Rather you have a good deed with us, so you shall not be wronged today.\" Then He will bring out a card (Bitaqah); on it will be: \"I testify to La \nIlaha Illallah, and I testify that Muhammad is His servant and Messenger.\" He will say: 'Bring your scales.' He will say: 'O Lord! What good is this card next to these scrolls?' He will say: 'You shall not be wronged.' He said: 'The scrolls will be put on a pan (of the scale), and the card on (the other) pan: the scrolls will be light, and the card will be heavy, nothing is heavier than the Name of Allah.'\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Gharib.\r\n\r\nAnother chain with similar in meaning. The Bitaqah is a small piece (of paper).",
        "ourHadithNumber": 34,
        "matchingArabicURN": 728450,
        "last_updated": "2013-05-01 23:01:32"
    },
    {
        "englishURN": 628470,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "18.00",
        "babName": "What Has Been Related About The Splitting That Will Occur In This Ummah",
        "hadithNumber": 2640,
        "hadithText": "Narrated Abu Hurairah:\nthat the Messenger of Allah (ﷺ) said: \"The Jews split into seventy-one sects, or seventy-two sects, and the Christians similarly, and my Ummah will split into seventy-three sects.\"</b>",
        "bookID": "40.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "There are narrations on this topic from Sa'd and 'Abdullah bin 'Amr and 'Awf bin Malik.\r\n[Abu 'Eisa said:] This Hadith of Abu Hurairah is a Hasan Sahih Hadith.",
        "ourHadithNumber": 35,
        "matchingArabicURN": 728470,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628480,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "18.00",
        "babName": "What Has Been Related About The Splitting That Will Occur In This Ummah",
        "hadithNumber": 2641,
        "hadithText": "Narrated 'Abdullah bin 'Amr:\nthat the Messenger of Allah (ﷺ) said: \"What befell the children of Isra'il will befall my Ummah, step by step, such that if there was one who had intercourse with his mother in the open, then there would be someone from my Ummah who would do that. Indeed the children of Isra'il split into seventy-two sects, and my Ummah will split into seventy-three sects. All of them are in the Fire Except one sect.\" He said: \"And which is it O Messenger of Allah?\" He said: \"What I am upon and my Companions.\"</b>",
        "bookID": "40.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Gharib, and explanative, and we do not know of its like except through this route.",
        "ourHadithNumber": 36,
        "matchingArabicURN": 728480,
        "last_updated": "2013-05-01 23:06:06"
    },
    {
        "englishURN": 628490,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "18.00",
        "babName": "What Has Been Related About The Splitting That Will Occur In This Ummah",
        "hadithNumber": 2642,
        "hadithText": "Narrated 'Abdullah bin 'Amr:\nthat the Messenger of Allah (ﷺ) said: \"Indeed Allah, the Blessed and Exalted, created His creation in darkness, then He cast His Light upon them, so whoever is touched by that light he is guided, and whoever is not, he goes astray. It is for this reason that I say that the pens have dried with Allah's knowledge.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan.",
        "ourHadithNumber": 37,
        "matchingArabicURN": 728490,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628500,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "18.00",
        "babName": "What Has Been Related About The Splitting That Will Occur In This Ummah",
        "hadithNumber": 2643,
        "hadithText": "Narrated Mu'adh bin Jabal:\nthat the Messenger of Allah (ﷺ) said: \"Do you know what Allah's right upon His slaves is?\" I said: \"Allah and His Messenger know best.\" He said: \"His right upon them is that they worship Him alone and do not associate any partners with Him.\" He said: \"And do you know what their right over Allah is if they do that?\" I said: \"Allah and His Messenger know best.\" He said: \"That He will not punish them.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "This hadith is Hasan Sahih.\r\nIt has been reported through other routes from Mu'adh bin Jabal",
        "ourHadithNumber": 38,
        "matchingArabicURN": 728500,
        "last_updated": "2013-05-01 14:24:19"
    },
    {
        "englishURN": 628510,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 38,
        "bookName": "The Book on Faith",
        "babNumber": "18.00",
        "babName": "What Has Been Related About The Splitting That Will Occur In This Ummah",
        "hadithNumber": 2644,
        "hadithText": "Narrated Abu Dharr:\nthat the Messenger of Allah (ﷺ) said: \"Jibril came to me and gave me glad tidings, that whoever dies without associating  anything with Allah, then he will enter Paradise. I said: \"Even if he commits adultery and theft?\" He said: \"Yes.\"</b>",
        "bookID": "40.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "Sahih\r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.\r\n\r\nThere is something on this topic from Abu Ad-Darda.",
        "ourHadithNumber": 39,
        "matchingArabicURN": 728510,
        "last_updated": "2013-05-01 14:24:19"
    }
]