[
    {
        "englishURN": 631090,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "1.00",
        "babName": "What Has Been Related About The Virtues Of Fatihatil-Kitab (Surat Al-Fatihah)",
        "hadithNumber": 2875,
        "hadithText": "Narrated Abu Hurairah:\nthat the Messenger of Allah (ﷺ) came out to Ubayy bin Ka'b, and the Messenger of Allah (ﷺ) said: \"O Ubayy!\" And he was performing Salat, so Ubayy turned around but he did not respond to him, so Ubayy finished his Salat quickly. Then he turned to the Messenger of Allah (ﷺ) and said: 'As-Salamu 'Alaikum, O Messenger of Allah!' The Messenger of Allah (ﷺ) said: 'Wa 'Alaikum As-Salam - what prevented you from responding to me when I called you Ubayy?' He said: 'O Messenger of Allah! I was performing Salat.' So he said: 'Do you not find among what Allah revealed to me: Respond to Allah and to the Messenger when they call you to what gives you life?' He said: 'Of course, I shall not repeat that, if Allah wills.' He said: 'Would you like for me to teach you a Surah the likes of which has neither been revealed in the Tawrah, nor the Injil, nor the Zabur, nor in the entire Qur'an?' He said: \"Yes, O Messenger of Allah!' The Messenger of Allah (ﷺ) said: 'What do you recite in your Salat?' He said: 'I recite Umm Al-Qur'an.' So the Messenger of Allah (ﷺ) said: 'By the One in Whose Hand is my soul! The like of it has neither been revealed in the Tawrah, nor the Injil nor the Zabur, nor in the Furqan. It is the seven oft-repeated, and the Magnificent Qur'an which I was given.'\"</b>",
        "bookID": "45.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih. There are narrations on this topic from Anas bin Malik [and also from Abu Sa'eed bin Al-Mu'alla].",
        "ourHadithNumber": 1,
        "matchingArabicURN": 731090,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631100,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "2.00",
        "babName": "What Has Been Related About Surat Al-Baqarah and Ayat Al-Kursi",
        "hadithNumber": 2876,
        "hadithText": "Narrated Abu Hurairah:\n\"The Messenger of Allah (ﷺ) sent an expedition force [comprised] of many, and he asked each what he could recite, so each one of them mentioned what he could recite - meaning what he had memorized of the Qur'an. He came to one of the youngest men among them and said: 'What have you memorized O so-and-so?' He said: 'I memorized this and that and Surat Al-Baqarah.' He said: 'You memorized Surat Al-Baqarah?' He said: \"Yes.' He said: \"Then go, for you are their commander.' A man among their chief said: 'By Allah [O Messenger of Allah]! Nothing prevented me from learning Surat Al-Baqarah except fearing that I would not be able to stand with (in voluntary night prayer).' The Messenger of Allah (ﷺ) said: 'Learn the Qur'an to recite it, for indeed the parable of the Qur'an for the one who recites it and stands with it (in prayer) is that of a bag full of musk whose scent fills the air all around. And the parable of the one who learns it then sleeps while it is in his memory is that of a bag containing musk that is tied shut.'\"</b>",
        "bookID": "45.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan. [Al-Laith bin Sa'd] reported similar to this Hadith from Sa'eed Al-Maqburi, from 'Ata the freed slave of Abu Ahmad from the Prophet (SAW) in Mursal form.\r\n(Another chain) from 'Ata the freed slave of Abu Ahmad, from the Prophet (SAW) in Mursal form and it is similar in meaning, and he did not mention: \"From Abu Hurairah\" in it. There is something on this topic from Ubayy bin Ka'b.",
        "ourHadithNumber": 2,
        "matchingArabicURN": 731101,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631120,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "2.00",
        "babName": "What Has Been Related About Surat Al-Baqarah and Ayat Al-Kursi",
        "hadithNumber": 2877,
        "hadithText": "Narrated Abu Hurairah:\nthat the Messenger of Allah (ﷺ) said: \"Do not turn your houses into graves. Indeed Ash-Shaitan does not enter the house in which Surat Al-Baqarah is recited.\"</b>",
        "bookID": "45.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "This Hadith is Hasan Sahih.",
        "ourHadithNumber": 3,
        "matchingArabicURN": 731120,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631130,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "2.00",
        "babName": "What Has Been Related About Surat Al-Baqarah and Ayat Al-Kursi",
        "hadithNumber": 2878,
        "hadithText": "Narrated Abu Hurairah:\nthat the Messenger of Allah (ﷺ): \"For everything there is a hump (pinnacle) and the hump (pinnacle) of the Qur'an is Surat Al-Baqarah, in it there is an Ayah which is the master of the Ayat in the Qur'an; [it is] Ayat Al-Kursi.\"</b>",
        "bookID": "45.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except through the narration of Hakim bin Jubair. Shu'bah criticized him and graded him weak.",
        "ourHadithNumber": 4,
        "matchingArabicURN": 731130,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631140,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "2.00",
        "babName": "What Has Been Related About Surat Al-Baqarah and Ayat Al-Kursi",
        "hadithNumber": 2879,
        "hadithText": "Narrated Abu Hurairah:\nthat the Messenger of Allah (ﷺ) said: \"Whoever recites Ha Mim Al-Mu'min - up to - To Him is the return (40:1-3) and Ayat Al-Kursi when he reaches (gets up in) the morning, he will be protected by them until the evening. And whoever recites them when he reaches the evening, he will be protected by them until the morning.\"</b>",
        "bookID": "45.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Gharib. Some of the people of knowledge criticized 'Abdur-Rahman bin Abi Bakr bin Abi Mulaikah Al-Mulaiki (a narrator in the chain) due to his memory. [Zuwarah bin Mus'ab is Ibn 'Abdur-Rahman bin 'Awf, and he is the grandfather of Abu Mus'ab Al-Madani].",
        "ourHadithNumber": 5,
        "matchingArabicURN": 731140,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631150,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "3.00",
        "babName": "The Hadith of Abu Ayyub Regarding The Ghoul",
        "hadithNumber": 2880,
        "hadithText": "Narrated 'Abdur-Rahman bin Abi Laila:\nthat Abu Ayyub Al-Ansari had a store house in which he kept dates. A ghoul would come and take from it, so he complained about that to the Prophet (ﷺ). So he said: \"Go, and when you see her say: 'In the Name of Allah, answer to the Messenger of Allah (ﷺ).'\" He said: \"So I caught her, and she swore that she would not return, so I released her.\" He went to the Prophet (ﷺ) and he said: \"What did your captive do?\" He said: \"She swore not to return.\" He said: \"She has lied, and she will come again to lie.\" He said: \"I caught her another time and she swore that she would not return, so I released her, and went to the Prophet (ﷺ).\" He said: \"What did your captive do?\" He said: \"She swore that she would not return.\" So he said: \"She lied and she will come again to lie.\" So he caught her and said: \"I shall not let you go until you accompany me to the Prophet (ﷺ).\" She said: \"I shall tell you something: If you recite Ayat Al-Kursi in your home, then no Shaitan, nor any other shall come near you.\" So he went to the Prophet (ﷺ) and he said: \"What did your captive do?\" He said: \"I informed him of what she said, and he said: 'She told the truth and she is a continuous liar.'\"</b>",
        "bookID": "45.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Gharib.",
        "ourHadithNumber": 6,
        "matchingArabicURN": 731150,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631170,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "4.00",
        "babName": "What Has Been Related About The End Of Surat Al-Baqarah",
        "hadithNumber": 2881,
        "hadithText": "Narrated Abu Mas'ud Al-Ansari:\nthat the Messenger of Allah (ﷺ) said: \"Whoever recites the last two Ayat of Surat Al-Baqarah during the night, they shall suffice him.\"</b>",
        "bookID": "45.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
        "ourHadithNumber": 7,
        "matchingArabicURN": 731170,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631180,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "4.00",
        "babName": "What Has Been Related About The End Of Surat Al-Baqarah",
        "hadithNumber": 2882,
        "hadithText": "Narrated An-Nu'man bin Bashir:\nthat the Prophet (ﷺ) said: \"Indeed Allah wrote in a book two thousand years before He created the heavens and the earth, and He sent down two Ayat from it to end Surat Al-Baqarah with. If they are recited for three nights in a home, no Shaitan shall come near it.\"</b>",
        "bookID": "45.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is [Hasan] Gharib.",
        "ourHadithNumber": 8,
        "matchingArabicURN": 731180,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631190,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "5.00",
        "babName": "What Has Been Related About Surat Al 'Imran",
        "hadithNumber": 2883,
        "hadithText": "Narrated An-Nawwas bin Sam'an:\nthat the Prophet (ﷺ) said: \"The Qur'an shall come, and its people who acted according to it in the world. Surat Al-Baqarah and Al 'Imran shall be in front of it. An-Nawwas said: \"The Messenger of Allah (ﷺ) stated three parables about them which I have not since forgotten, he said: \"They will come as if they are two shades between which there is illumination, or as if they are two shady clouds, or as if they are shadows of lines of birds arguing on behalf of their people.\"</b>",
        "bookID": "45.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "There is something on this topic from Buraidah and Abu Umamah.\r\n[Abu 'Eisa said:] This Hadith is Hasan Gharib [from this route].\r\nAccording to the people of knowledge, the meaning of this Hadith is that the rewards of having recited them shall come. This is how some of the people of knowledge explained this Hadith and similar Ahadith regarding the coming of the rewards for reciting the Qur'an. And in the Hadith of An-Nawwas bin Sam'an from the Prophet (SAW) is what proves what they explained since the Prophet (SAW) said: \"And its people who acted according to it in the world.\" So in this there is proof that it refers to the coming of the reward for the actions.'",
        "ourHadithNumber": 9,
        "matchingArabicURN": 731190,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631195,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "5.00",
        "babName": "What Has Been Related About Surat Al 'Imran",
        "hadithNumber": 2884,
        "hadithText": "Narrated 'Abdullah bin Mas'ud:\n\"Allah has not created in the heavens nor in the earth what is more magnificent than Ayat Al-Kursi.\" Sufyan said: \"Because Ayat Al-Kursi is the Speech of Allah, and Allah's Speech is greater than Allah's creation of the heavens and the earth.\"</b>",
        "bookID": "45.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 731195,
        "last_updated": "2021-06-02 21:42:10"
    },
    {
        "englishURN": 631200,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "6.00",
        "babName": "What Has Been Related About [The Virtue] Of Surat Al-Kahf",
        "hadithNumber": 2885,
        "hadithText": "Narrated Abu Ishaq:\nhearing Al-Bara say: \"There was a man reciting [Surat] Al-Kahf when he saw his riding animal stamping his feet, so he looked and there was something like a shadow or cloud, so he went to the Messenger of Allah (ﷺ) and mentioned that to him. The Prophet (ﷺ) said: \"That was the tranquility which descends with the Qur'an, or descends because of the Qur'an.\"</b>",
        "bookID": "45.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih. There is something on this topic from Usaid bin Hudair.",
        "ourHadithNumber": 11,
        "matchingArabicURN": 731200,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631210,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "6.00",
        "babName": "What Has Been Related About [The Virtue] Of Surat Al-Kahf",
        "hadithNumber": 2886,
        "hadithText": "Narrated Abu Ad-Darda:\nthat the Prophet (ﷺ) said: \"Whoever recites three Ayat from the beginning of Al-Kahf he is protected from the turmoil of the Dajjal.\"</b>",
        "bookID": "45.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "(Another route) with this chain and similar in meaning.\r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
        "ourHadithNumber": 12,
        "matchingArabicURN": 731211,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631230,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "7.00",
        "babName": "What Has Been Related About [The Virtue] of Ya Sin",
        "hadithNumber": 2887,
        "hadithText": "Narrated Anas:\nthat the Messenger of Allah (ﷺ) said: \"Indeed for everything there is a heart, and the Qur'an's heart is Ya Sin. Whoever recites Ya Sin, then for its recitation, Allah writes for him that he recited the Qur'an ten times.\"</b>",
        "bookID": "45.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except as a narration of Humaid bin 'Abdur-Rahman. And in Al-Basrah, they did not know it as a narration from Qatadah except through this route. Harun Abu Muhammad is a Shaikh who is unknown.\r\n(Another chain) with this.\r\nThere is something on this topic from Abu Bakr As-Siddiq, but the Hadith of Abu Bakr is not correct because its chain is weak.\r\nThere is something on this topic from Abu Hurairah.",
        "ourHadithNumber": 13,
        "matchingArabicURN": 731231,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631250,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "8.00",
        "babName": "What Has Been Related About [The Virtue Of] Ha Mim Ad-Dukhan",
        "hadithNumber": 2888,
        "hadithText": "Narrated Abu Hurairah:\nthat the Messenger of Allah (ﷺ) said: \"Whoever recites Ha Mim Ad-Dukhan during the night, in the morning seventy thousand angels seek forgiveness for him.\"</b>",
        "bookID": "45.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except through this route. 'Umar bin Abi Khath'am (a narrator in the chain) was graded weak, Muhammad said: \"He is Munkar in Hadith.\"",
        "ourHadithNumber": 14,
        "matchingArabicURN": 731250,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631260,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "8.00",
        "babName": "What Has Been Related About [The Virtue Of] Ha Mim Ad-Dukhan",
        "hadithNumber": 2889,
        "hadithText": "Narrated Abu Hurairah:\nthat the Messenger of Allah (ﷺ) said: \"Whoever recites Ha Mum Ad-Dukhan during Friday night, he shall be forgiven.\"</b>",
        "bookID": "45.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith [is Gharib] we do not know of it except through this route. Hisham Abu Al-Miqdam was graded weak, and Al-Hasan did not hear from Abu Hurairah. This is what Ayyub, Yunus bin 'Ubaid and 'Ali bin Zaid said.",
        "ourHadithNumber": 15,
        "matchingArabicURN": 731260,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631270,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "9.00",
        "babName": "What Has Been Related About [The Virtue Of] Surat Al-Mulk",
        "hadithNumber": 2890,
        "hadithText": "Narrated Ibn 'Abbas:\n\"One of the companions of the Prophet (ﷺ) pitched a tent on a grave without knowing that it was a grave. Suddenly he heard a person from the grave reciting Surah al-Mulk till he completed it. So he went to the Prophet (ﷺ) and said: 'Oh Messenger of Allah, I pitched my tent on a grave without realizing that is was a grave. Then suddenly I heard a person from the grave reciting Surah al-Mulk till he completed it.' The Messenger of Allah (ﷺ) said: 'It is the defender, it is the deliverer - it delivers from the punishment of the grave.'\"</b>",
        "bookID": "45.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is [Hasan] Gharib from this route, and there is something on this topic from Abu Hurairah.",
        "ourHadithNumber": 16,
        "matchingArabicURN": 731270,
        "last_updated": "2015-04-28 12:23:25"
    },
    {
        "englishURN": 631280,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "9.00",
        "babName": "What Has Been Related About [The Virtue Of] Surat Al-Mulk",
        "hadithNumber": 2891,
        "hadithText": "Narrated Abu Hurairah:\nthat the Prophet (ﷺ) said: \"Indeed there is a Surah in the Qur'an of thirty Ayat, which intercedes for a man until he is forgiven. It is [Surah] Tabarak Alladhi Biyadihil-Mulk.\"</b>",
        "bookID": "45.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan.",
        "ourHadithNumber": 17,
        "matchingArabicURN": 731280,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631290,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "9.00",
        "babName": "What Has Been Related About [The Virtue Of] Surat Al-Mulk",
        "hadithNumber": 2892,
        "hadithText": "Narrated Jabir:\nThe Prophet (ﷺ) would not sleep until he recited Alif Lam Mim Tanzil and: Tabarak Alladhi Biyadihil-Mulk.\"\nThis Hadith was reported similarly by more than one from Laith bin Abi Sulaim. Mughirah bin Muslim reported it from Abu Az-Zubair, from Jabir from the Prophet (ﷺ) and it is similar to this.\nZuhair reported it and said: \"I said to Abu Az-Zubair: 'Did you hear Jabir mentioning this Hadith?' He said: 'Safwan or Ibn Safwan informed me of it.'\" It is as if Zuhair rejected the idea that this Hadith was from Abu Az-Zubair from Jabir.\n(Another chain) with similar in meaning.\n(Another chain) that Tawus said: \"They are seventy good merits more of virtue in it than every Surah in the Qur'an.\"</b>",
        "bookID": "45.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 731292,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631320,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "10.00",
        "babName": "What Has Been Related About Idha Zulzilat",
        "hadithNumber": 2893,
        "hadithText": "Narrated Anas bin Malik:\nthat the Messenger of Allah (ﷺ) said: \"Whoever recites Idha Zulzilat, it equals half of the Qur'an for him. Whoever recites: Qul Ya Ayyuhal-Kafirun it equals a fourth of the Qur'an for him. And whoever recites: Qul Huwa Allahu Ahad it equals a third of the Qur'an for him.\"</b>",
        "bookID": "45.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except as a narration of this Shaikh Al-Hasan bin Salm. And there is something on this topic from Ibn 'Abbas.",
        "ourHadithNumber": 19,
        "matchingArabicURN": 731320,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631330,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "10.00",
        "babName": "What Has Been Related About Idha Zulzilat",
        "hadithNumber": 2894,
        "hadithText": "Narrated Ibn 'Abbas:\nthat the Messenger of Allah (ﷺ) said: \"Idha Zulzilat is equal to half of the Qur'an, Qul Huwa Allahu Ahad is equal to a third of the Qur'an, and Yul Ya Ayyuhal-Kafirun is equal to a fourth of the Qur'an.\"</b>",
        "bookID": "45.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Gharib we do not know of it except from the narration of Yaman bin Al-Mughirah.",
        "ourHadithNumber": 20,
        "matchingArabicURN": 731330,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631340,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "10.00",
        "babName": "What Has Been Related About Idha Zulzilat",
        "hadithNumber": 2895,
        "hadithText": "Narrated Anas bin Malik:\nthat the Messenger of Allah (ﷺ) said to a man among his Companions: \"Have you married O so-and-so?\" He said: \"No by Allah O Messenger of Allah! And I do not have anything to marry with.\" He said: \"Do you not know: Qul Huwa Allahu Ahad?\" He said: \"Of course.\" He said: \"It is a third of the Qur'an.\" He said: \"Do you not know Idha Ja Nasrullahi Wal-Fath?\" He said: \"Of course.\" He said: \"It is a fourth of the Qur'an.\" He said: \"Do you not know Qul Ya Ayyuhal-Kafirun?\" He said: \"Of course.\" He said: \"It is a fourth of the Qur'an.\" He said: \"Do you not know Idha Zulzilat Al-Ard?\" He said: \"Of course.\" He said: \"It is a fourth of the Qur'an.\" He said: \"Marry, marry.\"</b>",
        "bookID": "45.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan.",
        "ourHadithNumber": 21,
        "matchingArabicURN": 731340,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631350,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "11.00",
        "babName": "What Has Been Related About Surat Al-Ikhlas",
        "hadithNumber": 2896,
        "hadithText": "Narrated Abu Ayyub:\nthat the Messenger of Allah (ﷺ) said: \"Would one of you like to recite a third of the Qur'an during a night? Whoever recited: Allaahu Al-Wahid As-Samad then he has recited a third of the Qur'an.\"</b>",
        "bookID": "45.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "There are narrations on this topic from Abu Ad-Darda, Abu Sa'eed, Qatadah bin An-Nu'man, Abu Hurairah, Anas, Ibn 'Umar and Abu Mas'ud.\r\n[Abu 'Eisa said:] This Hadith is Hasan, and we do not know of anyone who reported this Hadith better than the narration of Za'idah, and Isra'il and Al-Fudail bin Iyad followed up on it (reporting similarly).\r\nShu'bah and more than one of the trustworthy narrators reported this Hadith from Mansur with Idtirab in it (meaning that there is some confusion in it).",
        "ourHadithNumber": 22,
        "matchingArabicURN": 731350,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631360,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "11.00",
        "babName": "What Has Been Related About Surat Al-Ikhlas",
        "hadithNumber": 2897,
        "hadithText": "Narrated Abu Hurairah:\n\"I went out with the Messenger of Allah and heard a man reciting Qul Huwa Allahu Ahad [Allahus-Samad] so the Messenger of Allah (ﷺ) said: 'It is obligatory.' I said: 'What is obligatory?' He said: 'Paradise.'\"</b>",
        "bookID": "45.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib, we do not know of it except as a narration of Malik bin Anas. Ibn Hunain (a narrator in the chain) is 'Ubaid bin Hunain.",
        "ourHadithNumber": 23,
        "matchingArabicURN": 731360,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631370,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "11.00",
        "babName": "What Has Been Related About Surat Al-Ikhlas",
        "hadithNumber": 2898,
        "hadithText": "Narrated Anas bin Malik:\nthat the Prophet (ﷺ) said: \"Whoever recited Qul Huwa Allahu Ahad two hundred times everyday, fifty years worth of his sins will be removed - unless he owed a debt.\"\n\nAnd another narration with this chain, from the Prophet (ﷺ) that he said: \"Whoever wants to sleep upon his bed and sleeps on his right side, then he recites Qul Huwa Allahu Ahad one hundred times, then on the Day of Judgement the Lord, Blessed and Most High shall say: 'O My slave! Enter Paradise on your right.'\"</b>",
        "bookID": "45.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Gharib as a narration of Thabit from Anas. This Hadith has also been reported through routes other than this, from Thabit.",
        "ourHadithNumber": 24,
        "matchingArabicURN": 731371,
        "last_updated": "2021-06-08 01:32:23"
    },
    {
        "englishURN": 631390,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "11.00",
        "babName": "What Has Been Related About Surat Al-Ikhlas",
        "hadithNumber": 2899,
        "hadithText": "Narrated Abu Hurairah:\nthat the Messenger of Allah (ﷺ) said: \"Qul Huwa Allahu Ahad is equal to a third of the Qur'an.\"</b>",
        "bookID": "45.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
        "ourHadithNumber": 25,
        "matchingArabicURN": 731390,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631400,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "11.00",
        "babName": "What Has Been Related About Surat Al-Ikhlas",
        "hadithNumber": 2900,
        "hadithText": "Narrated Abu Hurairah:\nthat the Messenger of Allah (ﷺ) said: \"Gather and I shall recite to you one third of the Qur'an.\" He said: \"So whoever was to gather did so, then the Messenger of Allah (ﷺ) came out and recited Qul Huwa Allahu Ahad. Then he went back in. Some of them said to each other: \"The Messenger of Allah (ﷺ) said: 'I shall recite to you one third of the Qur'an' I thought that this was news from the Heavens.\" Allah's Prophet (ﷺ) came out and said: \"Indeed I said that I would recite to you one third of the Qur'an, and it is indeed equal to one third of the Qur'an.\"</b>",
        "bookID": "45.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib from this route. Abu Hazim Al-Ashja'i's (a narrator in the chain) name is Salman.",
        "ourHadithNumber": 26,
        "matchingArabicURN": 731400,
        "last_updated": "2021-06-08 01:34:07"
    },
    {
        "englishURN": 631410,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "11.00",
        "babName": "What Has Been Related About Surat Al-Ikhlas",
        "hadithNumber": 2901,
        "hadithText": "Narrated Anas bin Malik:\n\"There was a man from the Ansar who led them (in Salat) at Masjid Quba. Every time he was to recite a Surah for them during Salat, he would begin by reciting Qul Huwa Allahu Ahad until he finished, then he would recite another Surah with it. He did that in each Rak'ah. His companions talked to him and said: 'You recite this Surah. You should either recite it or leave it and recite another Surah.'\" He said: \"I shall not leave it, if you would like me to lead you with it then I shall do so, and if you do not like it then I shall leave you.\" And they considered him the best among them, and they did not like the idea of someone else leading them. So when the Prophet (ﷺ) came to them they informed him about what had happened and he (ﷺ) said: \"O so-and-so! What prevents you from doing what your companions told you to do, why do recite this Surah in every Rak'ah\" He said: \"O Messenger of Allah! Indeed I love it.\" So the Messenger of Allah (ﷺ) said: \"Your love for it shall have you admitted into Paradise.\"</b>",
        "bookID": "45.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Gharib [Sahih] from this route, as a narration of 'Ubaidullah bin 'Umar from Thabit Al-Bunani.\r\nMubarak bin Fadalah has reported from Thabit Al-Bunani, from Anas that a man said: \"O Messenger of Allah! I love this Surah; Qul Huwa Allahu Ahad\". So he said: \"Your love for it shall have you admitted into Paradise.\"",
        "ourHadithNumber": 27,
        "matchingArabicURN": 731411,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631430,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "12.00",
        "babName": "What Has Been Related About Mu'awwidhatain",
        "hadithNumber": 2902,
        "hadithText": "Narrated 'Uqbah bin 'Amir Al-Juhani:\nthat the Prophet (ﷺ) said: \"Some Ayat have been revealed to me the likes of which have not been seen: Qul A'udhu Birabbin-Nas until the end of the Surah and Qul A'udhu Birabbil-Falaq until the end of the Surah.\"</b>",
        "bookID": "45.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
        "ourHadithNumber": 28,
        "matchingArabicURN": 731430,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631440,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "12.00",
        "babName": "What Has Been Related About Mu'awwidhatain",
        "hadithNumber": 2903,
        "hadithText": "Narrated 'Uqbah bin 'Amir:\n\"The Messenger of Allah (ﷺ) ordered me to recite Al-Mu'awwidhatain at the end of every Salat.\"</b>",
        "bookID": "45.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Gharib.",
        "ourHadithNumber": 29,
        "matchingArabicURN": 731440,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631450,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "13.00",
        "babName": "What Has Been Related About The Virtue Of Reciting The Qur'an",
        "hadithNumber": 2904,
        "hadithText": "Narrated 'Aishah:\nthat the Messenger of Allah (ﷺ) said: \"The one who recites the Qur'an and he is proficient with it, then he is with the noble and blessed Angels (As-Safaratil-Kiramil-Bararah), and the one who recites it\" - Hisham said: \"And it is hard for him\" - Shu'bah said: \"And it is difficult for him, - then he gets two rewards.\"</b>",
        "bookID": "45.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
        "ourHadithNumber": 30,
        "matchingArabicURN": 731450,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631460,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "13.00",
        "babName": "What Has Been Related About The Virtue Of Reciting The Qur'an",
        "hadithNumber": 2905,
        "hadithText": "Narrated 'Ali bin Abi Talib:\nthat the Messenger of Allah (ﷺ) said: \"Whoever recites the Qur'an and memorizes it, making lawful what it makes lawful, and unlawful what it makes unlawful, Allah will admit him to Paradise due to it, and grant him intercession for ten of his family members who were to be consigned to the Fire.\"</b>",
        "bookID": "45.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "This Hadith is Gharib, we do not know of it except through this route, and its chain is not Sahih. Hafs bin Sulaiman (a narrator in the chain) is Abu 'Umar Bazzar from Al-Kufah who was graded weak in Hadith.",
        "ourHadithNumber": 31,
        "matchingArabicURN": 731460,
        "last_updated": "2021-06-08 01:40:18"
    },
    {
        "englishURN": 631470,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "14.00",
        "babName": "What Has Been Related About The Virtues Of The Qur'an",
        "hadithNumber": 2906,
        "hadithText": "Narrated Al-Harith Al-A'war:\n\"I passed by the Masjid when the people were absorbed in story-telling. So I entered upon 'Ali and said: 'O Commander of the believers! Do you not see the people are becoming engrossed in story-telling?' He said: 'They have been consumed with it?' I said: \"Yes.' He said: 'As for me, I heard the Messenger of Allah (ﷺ) saying: \"Indeed there comes a Fitnah\" So I said: \"What is the way out from it O Messenger of Allah?\" He said: \"Allah's book. In it is news for what happened before you, and information about what comes after you, and judgement for what happens between you. It is the Criterion (between right and wrong) without jest. Whoever among the oppressive abandons it, Allah crushes him, and whoever seeks guidance from other than it, then Allah leaves him to stray. It is the firm rope of Allah, it is the wise remembrance, it is the straight path, and it is the one that the desires can not distort, nor can the tongues twist it, nor can the scholars ever have enough of it, and it shall not become dull from reciting it much, and the amazement of it does not diminish. It is the one that when the Jinns hear it, they did not hesitate to say about it: 'Verily, we have heard a wonderful Recitation (this Qur'an)! 'It guides to the Right Path, and we have believed therein.' Whoever speaks according to it then he has said the truth, and whoever acts according to it he is rewarded, and whoever judges by it he has judged justly, and whoever invites to it then he guides to the straight path.\" Take this O A'war!'.\"</b>",
        "bookID": "45.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except through the narration of Hamzah Az-Zayyat, and in its chain there is an unknown person. There is also criticism about the narrations of Al-Harith.",
        "ourHadithNumber": 32,
        "matchingArabicURN": 731470,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631490,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "15.00",
        "babName": "What Has Been Related About Teaching The Qur'an",
        "hadithNumber": 2908,
        "hadithText": "Narrated 'Uthman [bin 'Affan]:\nthat the Messenger of Allah (ﷺ) said: \"The best of you - or the most virtuous of you - is he who learns the Qur'an and teaches it.\"</b>",
        "bookID": "45.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "This Hadith is Hasan Sahih. This is how 'Abdur-Rahman bin Mahdi and others reported it from Sufyan Ath-Thawri: \"From 'Alqamah, from Marthad, from Abu 'Abdur-Rahman from 'Uthman from the Prophet (SAW).\" And Sufyan did not mention \"from Sa'd bin 'Ubaidah\" in it. Yahya bin Sa'eed Al-Qattan reported this Hadith from Sufyan and Shu'bah, from 'Alqamah bin Marthad, from Sa'd bin 'Ubdaidah, from Abu 'Abdur-Rahman, from 'Uthman, from the Prophet (SAW).\r\n(Another chain of narration)\r\nMuhammad bin Bash-shar said: \"Sufyan's companions did not mention in it from Sufyan:  'From Sa'd bin 'Ubaidah.'\" Muhammad bin Bash-shar said: \"And it is more correct.\"\r\n[Abu 'Eisa said:] Shu'bah added \"Sa'd bin 'Ubaidah\" to the chain of this Hadith and it appears that the narration of Sufyan is more appropriate.\r\n'Ali bin 'Abdullah said: \"Yahya bin Sa'eed said: 'No one is equal to Shu'bah to me, but when Sufyan contradicts him, then take the saying of Sufyan.'\"\r\n[Abu 'Eisa said:] I heard 'Ammar mentioning that Waki said: \"Shu'bah said: 'Sufyan has a better memory than me, there is nothing that Sufyan narrated to me from anyone, and then I later asked him about it, except that I found it just as he had narrated it to me.'\"\r\nThere are narrations on this topic from 'Ali and Sa'd.",
        "ourHadithNumber": 34,
        "matchingArabicURN": 731491,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631510,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "15.00",
        "babName": "What Has Been Related About Teaching The Qur'an",
        "hadithNumber": 2909,
        "hadithText": "Narrated 'Ali bin Abi Talib:\nthat the Messenger of Allah (ﷺ) said: \"The best of you is he who learns the Qur'an and teaches it.\"</b>",
        "bookID": "45.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] We do not know this to be a Hadith of 'Ali from the Prophet (SAW), except through the narration of 'Abdur-Rahman bin Ishaq.",
        "ourHadithNumber": 35,
        "matchingArabicURN": 731510,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631520,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "16.00",
        "babName": "What Has Been Related Regarding Reciting A Letter Of The Qur'an And The Reward For That",
        "hadithNumber": 2910,
        "hadithText": "Narrated Muhammad bin Ka'b Al-Qurazi:\n\"I heard 'Abdullah bin Mas'ud saying: 'The Messenger of Allah (ﷺ) said: \"[Whoever recites a letter] from Allah's Book, then he receives the reward from it, and the reward of ten the like of it. I do not say that Alif Lam Mim is a letter, but Alif is a letter, Lam is a letter and Mim is a letter.\"</b>",
        "bookID": "45.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib from this route. I heard Qutaibah bin Sa'eed saying: \"It has reached me that Muhammad bin Ka'b Al-Qurazi was born during the life of the Prophet (SAW).\" This Hadith was reported through routes other than this from Ibn Mas'ud, it was reported by Abu Al-Ahwas from 'Abdullah bin Mas'ud, and some of them reported it in Marfu form, while some of them reported it in Mawquf form from Ibn Mas'ud. Muhammad bin Ka'b Al-Qurazi's Kunyah is Abu Hamzah.",
        "ourHadithNumber": 36,
        "matchingArabicURN": 731520,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631530,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "17.00",
        "babName": "The Worshipers Shall Not Draw Nearer To Allah With Similar To What Came From Him",
        "hadithNumber": 2911,
        "hadithText": "Narrated Zaid bin Artah:\nnarrated from Abu Umamah, that he Prophet (ﷺ) said: \"Allah does not listen to anything more virtuous from the worshiper than the two Rak'ah of Salat he performs. And the righteousness spreads over the head of a worshiper as long as he remains in his Salat. And the worshipers shall not draw nearer to Allah, Mighty and Sublime is He, with similar to what came from Him.\"</b>",
        "bookID": "45.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "Abu An-Nadr said: \"Meaning the Qur'an.\" This Hadith has been reported from Zaid bin Artah from Jubair bin Nufair from the Prophet (SAW) in Mursal form.",
        "ourHadithNumber": 37,
        "matchingArabicURN": 731530,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631540,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "17.00",
        "babName": "The Worshipers Shall Not Draw Nearer To Allah With Similar To What Came From Him",
        "hadithNumber": 2912,
        "hadithText": "Narrated Jubair bin Nufair:\nthat the Prophet (ﷺ) said: \"You shall not return to Allah with what is more virtuous than what came from Him.\" Meaning the Qur'an.</b>",
        "bookID": "45.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except through this route. Bakr bin Khunais was criticized by Ibn Al-Mubarak and he later abandoned him.",
        "ourHadithNumber": 38,
        "matchingArabicURN": 731540,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631550,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "18.00",
        "babName": "'Indeed, The One Who Does Not Have The Qur'an Inside Him (His Heart), Is Like The Ruined House'",
        "hadithNumber": 2913,
        "hadithText": "Narrated Ibn 'Abbas:\nthat the Messenger of Allah (ﷺ) said: \"Indeed, the one who does not have the Qur'an inside him (his heart), is like the ruined house.\"</b>",
        "bookID": "45.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "This Hadith is Hasan Sahih.",
        "ourHadithNumber": 39,
        "matchingArabicURN": 731550,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631560,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "18.00",
        "babName": "'Indeed, The One Who Does Not Have The Qur'an Inside Him (His Heart), Is Like The Ruined House'",
        "hadithNumber": 2914,
        "hadithText": "Narrated 'Abdullah bin 'Amr:\nthat the Prophet (ﷺ) said: \"It shall be said - meaning to the one who memorized the Qur'an - 'Recite, and rise up, recite (melodiously) as you would recite in the world. For indeed your rank shall be at the last Ayah you recited.'\"</b>",
        "bookID": "45.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
        "ourHadithNumber": 40,
        "matchingArabicURN": 731561,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631580,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "18.00",
        "babName": "'Indeed, The One Who Does Not Have The Qur'an Inside Him (His Heart), Is Like The Ruined House'",
        "hadithNumber": 2915,
        "hadithText": "Narrated Abu Hurairah:\nthat the Prophet (ﷺ) said: \"The one who memorized the Qur'an shall come on the Day of Judgement and (the reward for reciting the Qur'an) says: 'O Lord! Decorate him.\" So he is donned with a crown of nobility. Then it says: \"O Lord! Give him more!' So he is donned with a suit of nobility. Then it says: \"O Lord! Be pleased with him.' So He is pleased with him and says: \"Recite and rise up, and be increased in reward with every Ayah.'\"</b>",
        "bookID": "45.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan [Sahih].\r\n(Another chain) from Abu Hurairah with similar, but he did not narrate it in Marfu form.\r\n[Abu 'Eisa said:] This is more correct to us than the narration of 'Abdus-Samad from Shu'bah (no. 2915).\r\n(Another chain) with similar in meaning.",
        "ourHadithNumber": 41,
        "matchingArabicURN": 731581,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631600,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "19.00",
        "babName": "'I Have Not Seen A Sin Worse Than A Surah Which A Man Learned And Then Forgot'",
        "hadithNumber": 2916,
        "hadithText": "Narrated Al-Muttalib bin 'Abullah bin Hantab:\nfrom Anas bin Malik that the Messenger of Allah (ﷺ) said: \"The rewards for my Ummah were displayed before me, even (the reward for) the dust that a man comes out of the Masjid with. The sins of my Ummah were displayed before me, and I have not seen a sin worse than a Surah or Ayah of the Qur'an which a man learned and then forgot.\"</b>",
        "bookID": "45.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except through this route. I mentioned it to Muhammad bin Isma'il, and he did not know it and considered it Gharib. Muhammad said: \"I do not know of Al-Muttalib bin 'Abdullah bin Hantab hearing from any one of the Companions of the Prophet (SAW), except for his saying: 'Someone who attended a Khutbah of the Prophet (SAW) narrated to me.'\"\r\nAnd I heard 'Abdullah bin 'Abdur-Rahman saying: \"We do not know of Al-Muttalib hearing from any one of the Companions of the Prophet (SAW).\" 'Abdullah said: ''Ali bin Al-Madini rejected the idea that Al-Muttalib heard from Anas.'",
        "ourHadithNumber": 42,
        "matchingArabicURN": 731600,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631610,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "20.00",
        "babName": "'Whoever Recites the Qur'an, Then Let Him Ask Allah By It'",
        "hadithNumber": 2917,
        "hadithText": "Narrated Al-Hasan:\nthat 'Imran bin Husain passed by a reciter reciting then he began begging. So he ('Imran) said: 'Indeed we are from Allah and to Him shall we return.' Then he said: 'I heard the Messenger of Allah (ﷺ) saying: 'Whoever recites the Qur'an, then let him ask Allah by it. For indeed there will come a people, who will recite the Qur'an, asking from the people because of it.'\"</b>",
        "bookID": "45.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "Mahmud said: \"This is Khaithamah (a narrator in the chain) Al-Basri, the one that Jabir Al-Ju'fi reported from. It is not Khaithamah bin 'Abdur-Rahman.\"\r\n[Abu 'Eisa said:] This Hadith is Hasan and this Khaithamah is from Al-Basrah, and his Kunyah is Abu Nasr. He reported narrations from Anas bin Malik, and Jabir Al-Ju'fi reported from this Khaithamah as well.",
        "ourHadithNumber": 43,
        "matchingArabicURN": 731610,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631620,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "20.00",
        "babName": "'Whoever Recites the Qur'an, Then Let Him Ask Allah By It'",
        "hadithNumber": 2918,
        "hadithText": "Narrated Suhaib:\nthat the Messenger of Allah (ﷺ) said: \"He does not believe in the Qur'an who makes lawful what it prohibits.\"</b>",
        "bookID": "45.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This chain for this Hadith is not that strong. Waki was contradicted in his narration. Muhammad said: \"There is no harm in (taking) the narrations of Abu Farwah Yazid bin Sinan Ar-Rahawi, except what his son Muhammad reported from him, for he reported Munkar narrations from him.\"\r\n[Abu 'Eisa said:] Muhammad bin Sinan reported this Hadith from his father, and added in this chain: \"From Mujahid, from Sa'eed bin Al-Musayyab, from Suhaib.\" And no one corroborated Muhammad bin Yazid in his narration, and he is weak. Abu Al-Mubarak is an unknown narrator.",
        "ourHadithNumber": 44,
        "matchingArabicURN": 731620,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631630,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "20.00",
        "babName": "'Whoever Recites the Qur'an, Then Let Him Ask Allah By It'",
        "hadithNumber": 2919,
        "hadithText": "Narrated 'Uqbah bin 'Amir:\nthat the Messenger of Allah (ﷺ) said: \"The one who recites the Qur'an aloud is like the one who gives charity publicly, and the one who recites the Qur'an quietly is like the one who gives charity secretly.\"</b>",
        "bookID": "45.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Gharib. The meaning of this Hadith is that the one who is quiet with his recitation of the Qur'an is better than the one who is loud with his recitation of the Qur'an, because secret charity is more virtuous according to the people of knowledge than public charity. The meaning of this, according to the people of knowledge, is only for the sake of keeping a man safe from arrogance, because it is not feared that the one who does his deeds in secret would suffer from arrogance, as it is feared he would when doing so publicly.",
        "ourHadithNumber": 45,
        "matchingArabicURN": 731630,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631640,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "21.00",
        "babName": "Reciting Surah Bani Isra'il and Az-Zumar Prior to Sleeping",
        "hadithNumber": 2920,
        "hadithText": "Narrated 'Aishah:\n\"The Prophet (ﷺ) would not sleep until he recited Surat Bani Isra'il and Az-Zumar.\"</b>",
        "bookID": "45.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Gharib. Abu Lubabah (a narrator in the chain) is a Shaikh from Al-Basrah, Hammad bin Zaid reported other narrations from him, and it is said that his name is Marwan. Muhammad bin Isma'il reported that to us in Kitab At-Tarikh.",
        "ourHadithNumber": 46,
        "matchingArabicURN": 731640,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631650,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "21.00",
        "babName": "Reciting Surah Bani Isra'il and Az-Zumar Prior to Sleeping",
        "hadithNumber": 2921,
        "hadithText": "Narrated 'Irbad bin Sariyah:\nthat the Prophet (ﷺ) would recite the Musabbihat (Chapters 17, 57, 59, 61, 62, 64 & 87) before sleep and say \"Indeed there is an Ayah in them that is better than one thousand Ayat.\"</b>",
        "bookID": "45.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Gharib.",
        "ourHadithNumber": 47,
        "matchingArabicURN": 731650,
        "last_updated": "2021-06-08 01:58:54"
    },
    {
        "englishURN": 631660,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "22.00",
        "babName": "Regarding The Virtues Of Reciting The End Of Surat Al-Hashr",
        "hadithNumber": 2922,
        "hadithText": "Narrated Ma'qil bin Yasar:\nthat the Prophet (ﷺ) said: \"Whoever says three times when he gets up in the morning: 'A'udhu Billahis-Sami Al-'Alim Min Ash-Shaitanir-Rajim' and he recites three Ayat from the end of Surah Al-Hashr - Allah appoints seventy-thousand angels who say Salat upon him until the evening. If he dies on that day, he dies a martyr, and whoever reaches the evening, he holds the same status.\"</b>",
        "bookID": "45.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except this route.",
        "ourHadithNumber": 48,
        "matchingArabicURN": 731660,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631670,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "23.00",
        "babName": "What Has Been Related About How The Prophet (SAW) Recited",
        "hadithNumber": 2923,
        "hadithText": "Narrated Ya'la bin Mamlak:\nthat he asked Umm Salamah, the wife of the Prophet (ﷺ), about the recitation of the Prophet (ﷺ) and his Salat. She said: \"What can you do compared to his Salat? He would pray and then sleep as long as he had prayed. Then he would pray as long as he had slept. Then he slept as long as he had prayed until the morning.' Then she described his recitation. So she described his recitation as word by word.\"</b>",
        "bookID": "45.0",
        "grade1": "Hasan",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. We do not know of it except as a narration of Laith bin Sa'd, from Ibn Abi Mulaikah, from Ya'la bin Mamlak, from Umm Salamah.\r\nIbn Juraij reported this Hadith from Ibn Abi Mulaikah, from Umm Salamah, that the Prophet (SAW) would separate (word from word in) his recitation, and the narration, of Al-Laith is more correct.",
        "ourHadithNumber": 49,
        "matchingArabicURN": 731670,
        "last_updated": "2021-06-08 02:01:45"
    },
    {
        "englishURN": 631680,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "23.00",
        "babName": "What Has Been Related About How The Prophet (SAW) Recited",
        "hadithNumber": 2924,
        "hadithText": "Narrated 'Abdullah bin Abi Qais [A man from Al-Basrah]:\n\"I asked 'Aishah about the Witr of the Messenger of Allah (ﷺ), how would he perform Witr, was it during the first part of the night or the end of it? She said: 'All of that. Sometimes he would perform Witr during the first part of the night, and sometimes he would perform Witr during the end of it.' So I said: 'All praise is due to Allah who made the matter accommodating.' I said: 'How was his recitation, was he quiet with recitations or loud?' She said: 'He would do all of that. Sometimes he would recite quietly and sometimes aloud.' I said: 'All praise is due to Allah who made the matter accommodating. He said: 'I said: 'How would he deal with sexual impurity? Would he perform Ghusl prior to sleeping or would he sleep prior to Ghusl?' She said: 'He would do all of that. Sometimes he would perform Ghusl then sleep, and sometimes he would perform Wudu and then sleep.' I said: 'Allah praise is due to Allah who made the matter accommodating.'\"</b>",
        "bookID": "45.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Gharib from this route.",
        "ourHadithNumber": 50,
        "matchingArabicURN": 731680,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631690,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "24.00",
        "babName": "'Which Man Will Bring Me To His People To Convey The Speed Of My Lord",
        "hadithNumber": 2925,
        "hadithText": "Narrated Jabir bin 'Abdullah:\n\"During the Mawqif (hajj season), the Prophet (ﷺ) would present himself and say: 'Which man will bring me to his people? For indeed the Quraish have prevented me from conveying the Speech of my Lord.'\"</b>",
        "bookID": "45.0",
        "grade1": "Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.",
        "ourHadithNumber": 51,
        "matchingArabicURN": 731690,
        "last_updated": "2021-06-08 02:05:17"
    },
    {
        "englishURN": 631700,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "25.00",
        "babName": "",
        "hadithNumber": 2926,
        "hadithText": "Narrated 'Atiyyah:\nfrom Abu Sa'eed, that the Messenger of Allah (ﷺ) said: \"The Lord, Blessed and Most High is He, has said: 'Whoever is too busy with the Qur'an for remembering Me and asking Me, then I shall give him more than what I give to those who ask.' And the virtue of Allah's Speech over the speech of others is like the virtue of Allah over His creation.</b>",
        "bookID": "45.0",
        "grade1": "Da'if",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Gharib.",
        "ourHadithNumber": 52,
        "matchingArabicURN": 731700,
        "last_updated": "2014-11-14 21:38:58"
    },
    {
        "englishURN": 631482,
        "collection": "tirmidhi",
        "volumeNumber": 5,
        "bookNumber": 42,
        "bookName": "Chapters on The Virtues of the Qur'an",
        "babNumber": "15.00",
        "babName": "What Has Been Related About Teaching The Qur'an",
        "hadithNumber": 2907,
        "hadithText": "Narrated Abu 'Abdur-Rahman:\nfrom 'Uthman bin 'Affan that the Messenger of Allah (ﷺ) said: \"The best of you is he who learns the Qur'an and teaches it.\" Abu 'Abdur-Rahman said: \"So that is why I sit at this seat of mine.\" And he taught the Qur'an during the time of 'Uthman until Al-Hajjaj bin Yusuf came. (Sahih)</b>",
        "bookID": "45.0",
        "grade1": "Sah, Sahih",
        "grade2": "",
        "comments": "[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
        "ourHadithNumber": 33,
        "matchingArabicURN": 731480,
        "last_updated": "2021-06-07 21:47:57"
    }
]