[
    {
        "arabicURN": 367020,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "1.00",
        "hadithNumber": "2548 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب بِرِّ الْوَالِدَيْنِ وَأَنَّهُمَا أَحَقُّ بِهِ ‏‏ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدِ بْنِ جَمِيلِ بْنِ طَرِيفٍ الثَّقَفِيُّ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا \n جَرِيرٌ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ\n اللَّهِ صلى الله عليه وسلم فَقَالَ مَنْ أَحَقُّ النَّاسِ بِحُسْنِ صَحَابَتِي قَالَ ‏\"‏ أُمُّكَ ‏\"‏ ‏.‏ قَالَ\n ثُمَّ مَنْ قَالَ ‏\"‏ ثُمَّ أُمُّكَ ‏\"‏ ‏.‏ قَالَ ثُمَّ مَنْ قَالَ ‏\"‏ ثُمَّ أُمُّكَ ‏\"‏ ‏.‏ قَالَ ثُمَّ مَنْ قَالَ ‏\"‏ ثُمَّ أَبُوكَ ‏\"‏\n ‏.‏ وَفِي حَدِيثِ قُتَيْبَةَ مَنْ أَحَقُّ بِحُسْنِ صَحَابَتِي وَلَمْ يَذْكُرِ النَّاسَ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 1,
        "matchingEnglishURN": 261800,
        "last_updated": null
    },
    {
        "arabicURN": 367030,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "1.00",
        "hadithNumber": "2548 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب بِرِّ الْوَالِدَيْنِ وَأَنَّهُمَا أَحَقُّ بِهِ ‏‏ ",
        "hadithText": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِيُّ حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنْ عُمَارَةَ،\n بْنِ الْقَعْقَاعِ عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ مَنْ أَحَقُّ بِحُسْنِ\n الصُّحْبَةِ قَالَ ‏\"‏ أُمُّكَ ثُمَّ أُمُّكَ ثُمَّ أُمُّكَ ثُمَّ أَبُوكَ ثُمَّ أَدْنَاكَ أَدْنَاكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 2,
        "matchingEnglishURN": 261810,
        "last_updated": null
    },
    {
        "arabicURN": 367040,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "1.00",
        "hadithNumber": "2548 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب بِرِّ الْوَالِدَيْنِ وَأَنَّهُمَا أَحَقُّ بِهِ ‏‏ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَرِيكٌ، عَنْ عُمَارَةَ، وَابْنِ، شُبْرُمَةَ عَنْ أَبِي،\n زُرْعَةَ عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم ‏.‏ فَذَكَرَ بِمِثْلِ حَدِيثِ\n جَرِيرٍ وَزَادَ فَقَالَ ‏\"‏ نَعَمْ وَأَبِيكَ لَتُنَبَّأَنَّ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 3,
        "matchingEnglishURN": 261820,
        "last_updated": null
    },
    {
        "arabicURN": 367050,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "1.00",
        "hadithNumber": "2548 d",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب بِرِّ الْوَالِدَيْنِ وَأَنَّهُمَا أَحَقُّ بِهِ ‏‏ ",
        "hadithText": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ، ح وَحَدَّثَنِي أَحْمَدُ،\n بْنُ خِرَاشٍ حَدَّثَنَا حَبَّانُ، حَدَّثَنَا وُهَيْبٌ، كِلاَهُمَا عَنِ ابْنِ شُبْرُمَةَ، بِهَذَا الإِسْنَادِ فِي حَدِيثِ\n وُهَيْبٍ مَنْ أَبَرُّ وَفِي حَدِيثِ مُحَمَّدِ بْنِ طَلْحَةَ أَىُّ النَّاسِ أَحَقُّ مِنِّي بِحُسْنِ الصُّحْبَةِ ثُمَّ ذَكَرَ\n بِمِثْلِ حَدِيثِ جَرِيرٍ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 4,
        "matchingEnglishURN": 261830,
        "last_updated": null
    },
    {
        "arabicURN": 367060,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "1.00",
        "hadithNumber": "2549 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب بِرِّ الْوَالِدَيْنِ وَأَنَّهُمَا أَحَقُّ بِهِ ‏‏ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ \n حَبِيبٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ الْقَطَّانَ - عَنْ سُفْيَانَ،\n وَشُعْبَةَ قَالاَ حَدَّثَنَا حَبِيبٌ، عَنْ أَبِي الْعَبَّاسِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ جَاءَ رَجُلٌ إِلَى\n النَّبِيِّ صلى الله عليه وسلم يَسْتَأْذِنُهُ فِي الْجِهَادِ فَقَالَ ‏\"‏ أَحَىٌّ وَالِدَاكَ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ\n ‏\"‏ فَفِيهِمَا فَجَاهِدْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 5,
        "matchingEnglishURN": 261840,
        "last_updated": null
    },
    {
        "arabicURN": 367090,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "1.00",
        "hadithNumber": "2549 d",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب بِرِّ الْوَالِدَيْنِ وَأَنَّهُمَا أَحَقُّ بِهِ ‏‏ ",
        "hadithText": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ،\n عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، أَنَّ نَاعِمًا، مَوْلَى أُمِّ سَلَمَةَ حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ\n قَالَ أَقْبَلَ رَجُلٌ إِلَى نَبِيِّ اللَّهِ صلى الله عليه وسلم فَقَالَ أُبَايِعُكَ عَلَى الْهِجْرَةِ وَالْجِهَادِ\n أَبْتَغِي الأَجْرَ مِنَ اللَّهِ ‏.‏ قَالَ ‏\"‏ فَهَلْ مِنْ وَالِدَيْكَ أَحَدٌ حَىٌّ ‏\"‏ ‏.‏ قَالَ نَعَمْ بَلْ كِلاَهُمَا ‏.‏ قَالَ\n ‏\"‏ فَتَبْتَغِي الأَجْرَ مِنَ اللَّهِ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ فَارْجِعْ إِلَى وَالِدَيْكَ فَأَحْسِنْ صُحْبَتَهُمَا\n ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 7,
        "matchingEnglishURN": 261860,
        "last_updated": null
    },
    {
        "arabicURN": 367100,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "2.00",
        "hadithNumber": "2550 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَقْدِيمِ بِرِّ الْوَالِدَيْنِ عَلَى التَّطَوُّعِ بِالصَّلاَةِ وَغَيْرِهَا ‏‏ ",
        "hadithText": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، حَدَّثَنَا حُمَيْدُ بْنُ هِلاَلٍ، عَنْ \n أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ كَانَ جُرَيْجٌ يَتَعَبَّدُ فِي صَوْمَعَةٍ فَجَاءَتْ أُمُّهُ ‏.‏ قَالَ حُمَيْدٌ\n فَوَصَفَ لَنَا أَبُو رَافِعٍ صِفَةَ أَبِي هُرَيْرَةَ لِصِفَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم أُمَّهُ حِينَ\n دَعَتْهُ كَيْفَ جَعَلَتْ كَفَّهَا فَوْقَ حَاجِبِهَا ثُمَّ رَفَعَتْ رَأْسَهَا إِلَيْهِ تَدْعُوهُ فَقَالَتْ يَا جُرَيْجُ أَنَا\n أُمُّكَ كَلِّمْنِي ‏.‏ فَصَادَفَتْهُ يُصَلِّي فَقَالَ اللَّهُمَّ أُمِّي وَصَلاَتِي ‏.‏ فَاخْتَارَ صَلاَتَهُ فَرَجَعَتْ ثُمَّ عَادَتْ\n فِي الثَّانِيَةِ فَقَالَتْ يَا جُرَيْجُ أَنَا أُمُّكَ فَكَلِّمْنِي ‏.‏ قَالَ اللَّهُمَّ أُمِّي وَصَلاَتِي ‏.‏ فَاخْتَارَ صَلاَتَهُ\n فَقَالَتِ اللَّهُمَّ إِنَّ هَذَا جُرَيْجٌ وَهُوَ ابْنِي وَإِنِّي كَلَّمْتُهُ فَأَبَى أَنْ يُكَلِّمَنِي اللَّهُمَّ فَلاَ تُمِتْهُ حَتَّى\n تُرِيَهُ الْمُومِسَاتِ ‏.‏ قَالَ وَلَوْ دَعَتْ عَلَيْهِ أَنْ يُفْتَنَ لَفُتِنَ ‏.‏ قَالَ وَكَانَ رَاعِي ضَأْنٍ يَأْوِي إِلَى\n دَيْرِهِ - قَالَ - فَخَرَجَتِ امْرَأَةٌ مِنَ الْقَرْيَةِ فَوَقَعَ عَلَيْهَا الرَّاعِي فَحَمَلَتْ فَوَلَدَتْ غُلاَمًا فَقِيلَ\n لَهَا مَا هَذَا قَالَتْ مِنْ صَاحِبِ هَذَا الدَّيْرِ ‏.‏ قَالَ فَجَاءُوا بِفُئُوسِهِمْ وَمَسَاحِيهِمْ فَنَادَوْهُ فَصَادَفُوهُ\n يُصَلِّي فَلَمْ يُكَلِّمْهُمْ - قَالَ - فَأَخَذُوا يَهْدِمُونَ دَيْرَهُ فَلَمَّا رَأَى ذَلِكَ نَزَلَ إِلَيْهِمْ فَقَالُوا لَهُ سَلْ\n هَذِهِ - قَالَ - فَتَبَسَّمَ ثُمَّ مَسَحَ رَأْسَ الصَّبِيِّ فَقَالَ مَنْ أَبُوكَ قَالَ أَبِي رَاعِي الضَّأْنِ ‏.‏\n فَلَمَّا سَمِعُوا ذَلِكَ مِنْهُ قَالُوا نَبْنِي مَا هَدَمْنَا مِنْ دَيْرِكَ بِالذَّهَبِ وَالْفِضَّةِ ‏.‏ قَالَ لاَ وَلَكِنْ أَعِيدُوهُ\n تُرَابًا كَمَا كَانَ ثُمَّ عَلاَهُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 8,
        "matchingEnglishURN": 261870,
        "last_updated": null
    },
    {
        "arabicURN": 367110,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "2.00",
        "hadithNumber": "2550 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَقْدِيمِ بِرِّ الْوَالِدَيْنِ عَلَى التَّطَوُّعِ بِالصَّلاَةِ وَغَيْرِهَا ‏‏ ",
        "hadithText": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا جَرِيرُ بْنُ حَازِمٍ، حَدَّثَنَا \n مُحَمَّدُ بْنُ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لَمْ يَتَكَلَّمْ فِي الْمَهْدِ\n إِلاَّ ثَلاَثَةٌ عِيسَى ابْنُ مَرْيَمَ وَصَاحِبُ جُرَيْجٍ وَكَانَ جُرَيْجٌ رَجُلاً عَابِدًا فَاتَّخَذَ صَوْمَعَةً فَكَانَ\n فِيهَا فَأَتَتْهُ أُمُّهُ وَهُوَ يُصَلِّي فَقَالَتْ يَا جُرَيْجُ ‏.‏ فَقَالَ يَا رَبِّ أُمِّي وَصَلاَتِي ‏.‏ فَأَقْبَلَ عَلَى\n صَلاَتِهِ فَانْصَرَفَتْ فَلَمَّا كَانَ مِنَ الْغَدِ أَتَتْهُ وَهُوَ يُصَلِّي فَقَالَتْ يَا جُرَيْجُ فَقَالَ يَا رَبِّ أُمِّي\n وَصَلاَتِي فَأَقْبَلَ عَلَى صَلاَتِهِ فَانْصَرَفَتْ فَلَمَّا كَانَ مِنَ الْغَدِ أَتَتْهُ وَهُوَ يُصَلِّي فَقَالَتْ يَا جُرَيْجُ\n ‏.‏ فَقَالَ أَىْ رَبِّ أُمِّي وَصَلاَتِي ‏.‏ فَأَقْبَلَ عَلَى صَلاَتِهِ فَقَالَتِ اللَّهُمَّ لاَ تُمِتْهُ حَتَّى يَنْظُرَ إِلَى\n وُجُوهِ الْمُومِسَاتِ ‏.‏ فَتَذَاكَرَ بَنُو إِسْرَائِيلَ جُرَيْجًا وَعِبَادَتَهُ وَكَانَتِ امْرَأَةٌ بَغِيٌّ يُتَمَثَّلُ بِحُسْنِهَا\n فَقَالَتْ إِنْ شِئْتُمْ لأَفْتِنَنَّهُ لَكُمْ - قَالَ - فَتَعَرَّضَتْ لَهُ فَلَمْ يَلْتَفِتْ إِلَيْهَا فَأَتَتْ رَاعِيًا كَانَ يَأْوِي\n إِلَى صَوْمَعَتِهِ فَأَمْكَنَتْهُ مِنْ نَفْسِهَا فَوَقَعَ عَلَيْهَا فَحَمَلَتْ فَلَمَّا وَلَدَتْ قَالَتْ هُوَ مِنْ جُرَيْجٍ\n ‏.‏ فَأَتَوْهُ فَاسْتَنْزَلُوهُ وَهَدَمُوا صَوْمَعَتَهُ وَجَعَلُوا يَضْرِبُونَهُ فَقَالَ مَا شَأْنُكُمْ قَالُوا زَنَيْتَ بِهَذِهِ\n الْبَغِيِّ فَوَلَدَتْ مِنْكَ ‏.‏ فَقَالَ أَيْنَ الصَّبِيُّ فَجَاءُوا بِهِ فَقَالَ دَعُونِي حَتَّى أُصَلِّيَ فَصَلَّى فَلَمَّا\n انْصَرَفَ أَتَى الصَّبِيَّ فَطَعَنَ فِي بَطْنِهِ وَقَالَ يَا غُلاَمُ مَنْ أَبُوكَ قَالَ فُلاَنٌ الرَّاعِي - قَالَ\n - فَأَقْبَلُوا عَلَى جُرَيْجٍ يُقَبِّلُونَهُ وَيَتَمَسَّحُونَ بِهِ وَقَالُوا نَبْنِي لَكَ صَوْمَعَتَكَ مِنْ ذَهَبٍ ‏.‏ قَالَ\n لاَ أَعِيدُوهَا مِنْ طِينٍ كَمَا كَانَتْ ‏.‏ فَفَعَلُوا ‏.‏ وَبَيْنَا صَبِيٌّ يَرْضَعُ مِنْ أُمِّهِ فَمَرَّ رَجُلٌ رَاكِبٌ\n عَلَى دَابَّةٍ فَارِهَةٍ وَشَارَةٍ حَسَنَةٍ فَقَالَتْ أُمُّهُ اللَّهُمَّ اجْعَلِ ابْنِي مِثْلَ هَذَا ‏.‏ فَتَرَكَ الثَّدْىَ وَأَقْبَلَ\n إِلَيْهِ فَنَظَرَ إِلَيْهِ فَقَالَ اللَّهُمَّ لاَ تَجْعَلْنِي مِثْلَهُ ‏.‏ ثُمَّ أَقْبَلَ عَلَى ثَدْيِهِ فَجَعَلَ يَرْتَضِعُ ‏.‏ قَالَ فَكَأَنِّي\n أَنْظُرُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ يَحْكِي ارْتِضَاعَهُ بِإِصْبَعِهِ السَّبَّابَةِ فِي\n فَمِهِ فَجَعَلَ يَمُصُّهَا ‏.‏ قَالَ وَمَرُّوا بِجَارِيَةٍ وَهُمْ يَضْرِبُونَهَا وَيَقُولُونَ زَنَيْتِ سَرَقْتِ ‏.‏ وَهِيَ\n تَقُولُ حَسْبِيَ اللَّهُ وَنِعْمَ الْوَكِيلُ ‏.‏ فَقَالَتْ أُمُّهُ اللَّهُمَّ لاَ تَجْعَلِ ابْنِي مِثْلَهَا ‏.‏ فَتَرَكَ الرَّضَاعَ وَنَظَرَ\n إِلَيْهَا فَقَالَ اللَّهُمَّ اجْعَلْنِي مِثْلَهَا ‏.‏ فَهُنَاكَ تَرَاجَعَا الْحَدِيثَ فَقَالَتْ حَلْقَى مَرَّ رَجُلٌ حَسَنُ الْهَيْئَةِ\n فَقُلْتُ اللَّهُمَّ اجْعَلِ ابْنِي مِثْلَهُ ‏.‏ فَقُلْتَ اللَّهُمَّ لاَ تَجْعَلْنِي مِثْلَهُ ‏.‏ وَمَرُّوا بِهَذِهِ الأَمَةِ وَهُمْ يَضْرِبُونَهَا\n وَيَقُولُونَ زَنَيْتِ سَرَقْتِ ‏.‏ فَقُلْتُ اللَّهُمَّ لاَ تَجْعَلِ ابْنِي مِثْلَهَا ‏.‏ فَقُلْتَ اللَّهُمَّ اجْعَلْنِي مِثْلَهَا قَالَ\n إِنَّ ذَاكَ الرَّجُلَ كَانَ جَبَّارًا فَقُلْتُ اللَّهُمَّ لاَ تَجْعَلْنِي مِثْلَهُ ‏.‏ وَإِنَّ هَذِهِ يَقُولُونَ لَهَا زَنَيْتِ ‏.‏ وَلَمْ\n تَزْنِ وَسَرَقْتِ وَلَمْ تَسْرِقْ فَقُلْتُ اللَّهُمَّ اجْعَلْنِي مِثْلَهَا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 9,
        "matchingEnglishURN": 261880,
        "last_updated": null
    },
    {
        "arabicURN": 367120,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "3.00",
        "hadithNumber": "2551 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب رَغِمَ أَنْفُ مَنْ أَدْرَكَ أَبَوَيْهِ أَوْ أَحَدَهُمَا عِنْدَ الْكِبَرِ فَلَمْ يَدْخُلِ الْجَنَّةَ ‏",
        "hadithText": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ،\n عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ رَغِمَ أَنْفُ ثُمَّ رَغِمَ أَنْفُ ثُمَّ رَغِمَ أَنْفُ ‏\"‏ ‏.‏ قِيلَ مَنْ\n يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ مَنْ أَدْرَكَ أَبَوَيْهِ عِنْدَ الْكِبَرِ أَحَدَهُمَا أَوْ كِلَيْهِمَا فَلَمْ يَدْخُلِ الْجَنَّةَ ‏\"‏\n ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 10,
        "matchingEnglishURN": 261890,
        "last_updated": null
    },
    {
        "arabicURN": 367130,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "3.00",
        "hadithNumber": "2551 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب رَغِمَ أَنْفُ مَنْ أَدْرَكَ أَبَوَيْهِ أَوْ أَحَدَهُمَا عِنْدَ الْكِبَرِ فَلَمْ يَدْخُلِ الْجَنَّةَ ‏",
        "hadithText": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ\n قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ رَغِمَ أَنْفُهُ ثُمَّ رَغِمَ أَنْفُهُ ثُمَّ رَغِمَ أَنْفُهُ ‏\"‏ ‏.‏ قِيلَ مَنْ\n يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ مَنْ أَدْرَكَ وَالِدَيْهِ عِنْدَ الْكِبَرِ أَحَدَهُمَا أَوْ كِلَيْهِمَا ثُمَّ لَمْ يَدْخُلِ الْجَنَّةَ\n ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 11,
        "matchingEnglishURN": 261900,
        "last_updated": null
    },
    {
        "arabicURN": 367140,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "3.00",
        "hadithNumber": "2551 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب رَغِمَ أَنْفُ مَنْ أَدْرَكَ أَبَوَيْهِ أَوْ أَحَدَهُمَا عِنْدَ الْكِبَرِ فَلَمْ يَدْخُلِ الْجَنَّةَ ‏",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ سُلَيْمَانَ بْنِ بِلاَلٍ، حَدَّثَنِي \n سُهَيْلٌ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ رَغِمَ أَنْفُهُ\n ‏\"‏ ‏.‏ ثَلاَثًا ثُمَّ ذَكَرَ مِثْلَهُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 12,
        "matchingEnglishURN": 261910,
        "last_updated": null
    },
    {
        "arabicURN": 367150,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "4.00",
        "hadithNumber": "2552 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ صِلَةِ أَصْدِقَاءِ الأَبِ وَالأُمِّ وَنَحْوِهِمَا ‏‏ ",
        "hadithText": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي \n سَعِيدُ بْنُ أَبِي أَيُّوبَ، عَنِ الْوَلِيدِ بْنِ أَبِي الْوَلِيدِ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ،\n أَنَّ رَجُلاً، مِنَ الأَعْرَابِ لَقِيَهُ بِطَرِيقِ مَكَّةَ فَسَلَّمَ عَلَيْهِ عَبْدُ اللَّهِ وَحَمَلَهُ عَلَى حِمَارٍ كَانَ يَرْكَبُهُ\n وَأَعْطَاهُ عِمَامَةً كَانَتْ عَلَى رَأْسِهِ فَقَالَ ابْنُ دِينَارٍ فَقُلْنَا لَهُ أَصْلَحَكَ اللَّهُ إِنَّهُمُ الأَعْرَابُ وَإِنَّهُمْ\n يَرْضَوْنَ بِالْيَسِيرِ ‏.‏ فَقَالَ عَبْدُ اللَّهِ إِنَّ أَبَا هَذَا كَانَ وُدًّا لِعُمَرَ بْنِ الْخَطَّابِ وَإِنِّي سَمِعْتُ رَسُولَ\n اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنَّ أَبَرَّ الْبِرِّ صِلَةُ الْوَلَدِ أَهْلَ وُدِّ أَبِيهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 13,
        "matchingEnglishURN": 261920,
        "last_updated": null
    },
    {
        "arabicURN": 367160,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "4.00",
        "hadithNumber": "2552 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ صِلَةِ أَصْدِقَاءِ الأَبِ وَالأُمِّ وَنَحْوِهِمَا ‏‏ ",
        "hadithText": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي حَيْوَةُ بْنُ شُرَيْحٍ، عَنِ ابْنِ،\n الْهَادِ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ النَّبِيِّ صلى الله عليه وسلم قَالَ\n ‏\"‏ أَبَرُّ الْبِرِّ أَنْ يَصِلَ الرَّجُلُ وُدَّ أَبِيهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 14,
        "matchingEnglishURN": 261930,
        "last_updated": null
    },
    {
        "arabicURN": 367170,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "4.00",
        "hadithNumber": "2552 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ صِلَةِ أَصْدِقَاءِ الأَبِ وَالأُمِّ وَنَحْوِهِمَا ‏‏ ",
        "hadithText": "حَدَّثَنَا حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي،\n وَاللَّيْثُ بْنُ سَعْدٍ جَمِيعًا عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ أُسَامَةَ بْنِ الْهَادِ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ،\n عَنِ ابْنِ عُمَرَ، أَنَّهُ كَانَ إِذَا خَرَجَ إِلَى مَكَّةَ كَانَ لَهُ حِمَارٌ يَتَرَوَّحُ عَلَيْهِ إِذَا مَلَّ رُكُوبَ الرَّاحِلَةِ\n وَعِمَامَةٌ يَشُدُّ بِهَا رَأْسَهُ فَبَيْنَا هُوَ يَوْمًا عَلَى ذَلِكَ الْحِمَارِ إِذْ مَرَّ بِهِ أَعْرَابِيٌّ فَقَالَ أَلَسْتَ\n ابْنَ فُلاَنِ بْنِ فُلاَنٍ قَالَ بَلَى ‏.‏ فَأَعْطَاهُ الْحِمَارَ وَقَالَ ارْكَبْ هَذَا وَالْعِمَامَةَ - قَالَ - اشْدُدْ\n بِهَا رَأْسَكَ ‏.‏ فَقَالَ لَهُ بَعْضُ أَصْحَابِهِ غَفَرَ اللَّهُ لَكَ أَعْطَيْتَ هَذَا الأَعْرَابِيَّ حِمَارًا كُنْتَ تَرَوَّحُ\n عَلَيْهِ وَعِمَامَةً كُنْتَ تَشُدُّ بِهَا رَأْسَكَ ‏.‏ فَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم\n يَقُولُ ‏\"‏ إِنَّ مِنْ أَبَرِّ الْبِرِّ صِلَةَ الرَّجُلِ أَهْلَ وُدِّ أَبِيهِ بَعْدَ أَنْ يُوَلِّيَ ‏\"‏ ‏.‏ وَإِنَّ أَبَاهُ كَانَ صَدِيقًا\n لِعُمَرَ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 15,
        "matchingEnglishURN": 261940,
        "last_updated": null
    },
    {
        "arabicURN": 367180,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "5.00",
        "hadithNumber": "2553 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَفْسِيرِ الْبِرِّ وَالإِثْمِ ‏‏ ",
        "hadithText": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، عَنْ \n عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِيهِ، عَنِ النَّوَّاسِ بْنِ سَمْعَانَ الأَنْصَارِيِّ، قَالَ سَأَلْتُ\n رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْبِرِّ وَالإِثْمِ فَقَالَ ‏\"‏ الْبِرُّ حُسْنُ الْخُلُقِ وَالإِثْمُ مَا حَاكَ\n فِي صَدْرِكَ وَكَرِهْتَ أَنْ يَطَّلِعَ عَلَيْهِ النَّاسُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 16,
        "matchingEnglishURN": 261950,
        "last_updated": null
    },
    {
        "arabicURN": 367190,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "5.00",
        "hadithNumber": "2553 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَفْسِيرِ الْبِرِّ وَالإِثْمِ ‏‏ ",
        "hadithText": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، حَدَّثَنِي مُعَاوِيَةُ، - يَعْنِي\n ابْنَ صَالِحٍ - عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِيهِ، عَنْ نَوَّاسِ بْنِ سِمْعَانَ، قَالَ أَقَمْتُ\n مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِالْمَدِينَةِ سَنَةً مَا يَمْنَعُنِي مِنَ الْهِجْرَةِ إِلاَّ الْمَسْأَلَةُ كَانَ\n أَحَدُنَا إِذَا هَاجَرَ لَمْ يَسْأَلْ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ شَىْءٍ - قَالَ - فَسَأَلْتُهُ\n عَنِ الْبِرِّ وَالإِثْمِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْبِرُّ حُسْنُ الْخُلُقِ وَالإِثْمُ مَا حَاكَ\n فِي نَفْسِكَ وَكَرِهْتَ أَنْ يَطَّلِعَ عَلَيْهِ النَّاسُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 17,
        "matchingEnglishURN": 261960,
        "last_updated": null
    },
    {
        "arabicURN": 367200,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "6.00",
        "hadithNumber": "2554",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب صِلَةِ الرَّحِمِ وَتَحْرِيمِ قَطِيعَتِهَا ‏‏ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدِ بْنِ جَمِيلِ بْنِ طَرِيفِ بْنِ عَبْدِ اللَّهِ الثَّقَفِيُّ، وَمُحَمَّدُ بْنُ عَبَّادٍ،\n قَالاَ حَدَّثَنَا حَاتِمٌ، - وَهُوَ ابْنُ إِسْمَاعِيلَ - عَنْ مُعَاوِيَةَ، - وَهُوَ ابْنُ أَبِي مُزَرِّدٍ مَوْلَى بَنِي\n هَاشِمٍ - حَدَّثَنِي عَمِّي أَبُو الْحُبَابِ، سَعِيدُ بْنُ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ\n صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ خَلَقَ الْخَلْقَ حَتَّى إِذَا فَرَغَ مِنْهُمْ قَامَتِ الرَّحِمُ فَقَالَتْ هَذَا\n مَقَامُ الْعَائِذِ مِنَ الْقَطِيعَةِ ‏.‏ قَالَ نَعَمْ أَمَا تَرْضَيْنَ أَنْ أَصِلَ مَنْ وَصَلَكِ وَأَقْطَعَ مَنْ قَطَعَكِ قَالَتْ\n بَلَى ‏.‏ قَالَ فَذَاكَ لَكِ ‏\"‏ ‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اقْرَءُوا إِنْ شِئْتُمْ ‏<A id=\"q1\" name=\"q1\" href=\"javascript:openquran(46,22,24)\"><c_q1>{‏\n فَهَلْ عَسَيْتُمْ إِنْ تَوَلَّيْتُمْ أَنْ تُفْسِدُوا فِي الأَرْضِ وَتُقَطِّعُوا أَرْحَامَكُمْ * أُولَئِكَ الَّذِينَ لَعَنَهُمُ\n اللَّهُ فَأَصَمَّهُمْ وَأَعْمَى أَبْصَارَهُمْ * أَفَلاَ يَتَدَبَّرُونَ الْقُرْآنَ أَمْ عَلَى قُلُوبٍ أَقْفَالُهَا‏}</c_q1></a>‏ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 18,
        "matchingEnglishURN": 261970,
        "last_updated": null
    },
    {
        "arabicURN": 367210,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "6.00",
        "hadithNumber": "2555",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب صِلَةِ الرَّحِمِ وَتَحْرِيمِ قَطِيعَتِهَا ‏‏ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لأَبِي بَكْرٍ - قَالاَ حَدَّثَنَا \n وَكِيعٌ، عَنْ مُعَاوِيَةَ بْنِ أَبِي مُزَرِّدٍ، عَنْ يَزِيدَ بْنِ رُومَانَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ قَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الرَّحِمُ مُعَلَّقَةٌ بِالْعَرْشِ تَقُولُ مَنْ وَصَلَنِي وَصَلَهُ اللَّهُ وَمَنْ\n قَطَعَنِي قَطَعَهُ اللَّهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 19,
        "matchingEnglishURN": 261980,
        "last_updated": null
    },
    {
        "arabicURN": 367220,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "6.00",
        "hadithNumber": "2556 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب صِلَةِ الرَّحِمِ وَتَحْرِيمِ قَطِيعَتِهَا ‏‏ ",
        "hadithText": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ مُحَمَّدِ،\n بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَدْخُلُ الْجَنَّةَ قَاطِعٌ\n ‏\"‏ ‏.‏ قَالَ ابْنُ أَبِي عُمَرَ قَالَ سُفْيَانُ يَعْنِي قَاطِعَ رَحِمٍ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 20,
        "matchingEnglishURN": 261990,
        "last_updated": null
    },
    {
        "arabicURN": 367230,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "6.00",
        "hadithNumber": "2556 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب صِلَةِ الرَّحِمِ وَتَحْرِيمِ قَطِيعَتِهَا ‏‏ ",
        "hadithText": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ مَالِكٍ، عَنِ الزُّهْرِيِّ،\n أَنَّ مُحَمَّدَ بْنَ جُبَيْرِ بْنِ مُطْعِمٍ، أَخْبَرَهُ أَنَّ أَبَاهُ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم\n قَالَ ‏\"‏ لاَ يَدْخُلُ الْجَنَّةَ قَاطِعُ رَحِمٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 21,
        "matchingEnglishURN": 262000,
        "last_updated": null
    },
    {
        "arabicURN": 367240,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "6.00",
        "hadithNumber": "2556 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب صِلَةِ الرَّحِمِ وَتَحْرِيمِ قَطِيعَتِهَا ‏‏ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، عَنْ عَبْدِ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ،\n بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ وَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 22,
        "matchingEnglishURN": 262010,
        "last_updated": null
    },
    {
        "arabicURN": 367250,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "6.00",
        "hadithNumber": "2557 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب صِلَةِ الرَّحِمِ وَتَحْرِيمِ قَطِيعَتِهَا ‏‏ ",
        "hadithText": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ،\n عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنْ سَرَّهُ أَنْ يُبْسَطَ\n عَلَيْهِ رِزْقُهُ أَوْ يُنْسَأَ فِي أَثَرِهِ فَلْيَصِلْ رَحِمَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 23,
        "matchingEnglishURN": 262020,
        "last_updated": null
    },
    {
        "arabicURN": 367260,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "6.00",
        "hadithNumber": "2557 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب صِلَةِ الرَّحِمِ وَتَحْرِيمِ قَطِيعَتِهَا ‏‏ ",
        "hadithText": "وَحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ،\n خَالِدٍ قَالَ قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم\n قَالَ ‏\"‏ مَنْ أَحَبَّ أَنْ يُبْسَطَ لَهُ فِي رِزْقِهِ وَيُنْسَأَ لَهُ فِي أَثَرِهِ فَلْيَصِلْ رَحِمَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 24,
        "matchingEnglishURN": 262030,
        "last_updated": null
    },
    {
        "arabicURN": 367270,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "6.00",
        "hadithNumber": "2558 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب صِلَةِ الرَّحِمِ وَتَحْرِيمِ قَطِيعَتِهَا ‏‏ ",
        "hadithText": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا \n مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ الْعَلاَءَ بْنَ عَبْدِ الرَّحْمَنِ، يُحَدِّثُ عَنْ أَبِيهِ، عَنْ أَبِي،\n هُرَيْرَةَ أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ إِنَّ لِي قَرَابَةً أَصِلُهُمْ وَيَقْطَعُونِي وَأُحْسِنُ إِلَيْهِمْ وَيُسِيئُونَ\n إِلَىَّ وَأَحْلُمُ عَنْهُمْ وَيَجْهَلُونَ عَلَىَّ ‏.‏ فَقَالَ ‏\"‏ لَئِنْ كُنْتَ كَمَا قُلْتَ فَكَأَنَّمَا تُسِفُّهُمُ الْمَلَّ وَلاَ يَزَالُ\n مَعَكَ مِنَ اللَّهِ ظَهِيرٌ عَلَيْهِمْ مَا دُمْتَ عَلَى ذَلِكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 25,
        "matchingEnglishURN": 262040,
        "last_updated": null
    },
    {
        "arabicURN": 367280,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "7.00",
        "hadithNumber": "2558 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنِ التَّحَاسُدِ، وَالتَّبَاغُضِ، وَالتَّدَابُرِ، ‏‏ ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ،\n أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَبَاغَضُوا وَلاَ تَحَاسَدُوا وَلاَ تَدَابَرُوا وَكُونُوا\n عِبَادَ اللَّهِ إِخْوَانًا وَلاَ يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلاَثٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 26,
        "matchingEnglishURN": 262050,
        "last_updated": null
    },
    {
        "arabicURN": 367310,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "7.00",
        "hadithNumber": "2559 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنِ التَّحَاسُدِ، وَالتَّبَاغُضِ، وَالتَّدَابُرِ، ‏‏ ",
        "hadithText": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ، وَعَمْرٌو النَّاقِدُ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، عَنِ \n الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ وَزَادَ ابْنُ عُيَيْنَةَ ‏\"‏ وَلاَ تَقَاطَعُوا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 28,
        "matchingEnglishURN": 262070,
        "last_updated": null
    },
    {
        "arabicURN": 367320,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "7.00",
        "hadithNumber": "2559 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنِ التَّحَاسُدِ، وَالتَّبَاغُضِ، وَالتَّدَابُرِ، ‏‏ ",
        "hadithText": "حَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ،\n بْنُ حُمَيْدٍ كِلاَهُمَا عَنْ عَبْدِ الرَّزَّاقِ، جَمِيعًا عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ ‏.‏ أَمَّا رِوَايَةُ\n يَزِيدَ عَنْهُ فَكَرِوَايَةِ سُفْيَانَ عَنِ الزُّهْرِيِّ يَذْكُرُ الْخِصَالَ الأَرْبَعَةَ جَمِيعًا وَأَمَّا حَدِيثُ عَبْدِ الرَّزَّاقِ\n ‏\"‏ وَلاَ تَحَاسَدُوا وَلاَ تَقَاطَعُوا وَلاَ تَدَابَرُوا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 29,
        "matchingEnglishURN": 262080,
        "last_updated": null
    },
    {
        "arabicURN": 367350,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "8.00",
        "hadithNumber": "2560 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الْهَجْرِ فَوْقَ ثَلاَثٍ بِلاَ عُذْرٍ شَرْعِيٍّ ‏‏ ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ عَطَاءِ بْنِ يَزِيدَ،\n اللَّيْثِيِّ عَنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَحِلُّ لِمُسْلِمٍ\n أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلاَثِ لَيَالٍ يَلْتَقِيَانِ فَيُعْرِضُ هَذَا وَيُعْرِضُ هَذَا وَخَيْرُهُمَا الَّذِي يَبْدَأُ\n بِالسَّلاَمِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 31,
        "matchingEnglishURN": 262100,
        "last_updated": null
    },
    {
        "arabicURN": 367360,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "8.00",
        "hadithNumber": "2560 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الْهَجْرِ فَوْقَ ثَلاَثٍ بِلاَ عُذْرٍ شَرْعِيٍّ ‏‏ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالُوا حَدَّثَنَا \n سُفْيَانُ، ح وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وَحَدَّثَنَا حَاجِبُ،\n بْنُ الْوَلِيدِ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَمُحَمَّدُ،\n بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ عَنْ عَبْدِ الرَّزَّاقِ، عَنْ مَعْمَرٍ، كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِإِسْنَادِ مَالِكٍ وَمِثْلِ\n حَدِيثِهِ إِلاَّ قَوْلَهُ ‏\"‏ فَيُعْرِضُ هَذَا وَيُعْرِضُ هَذَا ‏\"‏ ‏.‏ فَإِنَّهُمْ جَمِيعًا قَالُوا فِي حَدِيثِهِمْ غَيْرَ\n مَالِكٍ ‏\"‏ فَيَصُدُّ هَذَا وَيَصُدُّ هَذَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 32,
        "matchingEnglishURN": 262110,
        "last_updated": null
    },
    {
        "arabicURN": 367370,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "8.00",
        "hadithNumber": "2561",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الْهَجْرِ فَوْقَ ثَلاَثٍ بِلاَ عُذْرٍ شَرْعِيٍّ ‏‏ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ، - وَهُوَ ابْنُ\n عُثْمَانَ - عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ\n يَحِلُّ لِلْمُؤْمِنِ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلاَثَةِ أَيَّامٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 33,
        "matchingEnglishURN": 262120,
        "last_updated": null
    },
    {
        "arabicURN": 367380,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "8.00",
        "hadithNumber": "2562",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الْهَجْرِ فَوْقَ ثَلاَثٍ بِلاَ عُذْرٍ شَرْعِيٍّ ‏‏ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - عَنِ الْعَلاَءِ، عَنْ \n أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ هِجْرَةَ بَعْدَ ثَلاَثٍ ‏\"‏\n ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 34,
        "matchingEnglishURN": 262130,
        "last_updated": null
    },
    {
        "arabicURN": 367390,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "9.00",
        "hadithNumber": "2563 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الظَّنِّ وَالتَّجَسُّسِ وَالتَّنَافُسِ وَالتَّنَاجُشِ وَنَحْوِهَا ‏‏ ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ \n أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِيَّاكُمْ وَالظَّنَّ فَإِنَّ الظَّنَّ أَكْذَبُ الْحَدِيثِ\n وَلاَ تَحَسَّسُوا وَلاَ تَجَسَّسُوا وَلاَ تَنَافَسُوا وَلاَ تَحَاسَدُوا وَلاَ تَبَاغَضُوا وَلاَ تَدَابَرُوا وَكُونُوا\n عِبَادَ اللَّهِ إِخْوَانًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 35,
        "matchingEnglishURN": 262140,
        "last_updated": null
    },
    {
        "arabicURN": 367400,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "9.00",
        "hadithNumber": "2563 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الظَّنِّ وَالتَّجَسُّسِ وَالتَّنَافُسِ وَالتَّنَاجُشِ وَنَحْوِهَا ‏‏ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - عَنِ الْعَلاَءِ، عَنْ \n أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَهَجَّرُوا وَلاَ تَدَابَرُوا\n وَلاَ تَحَسَّسُوا وَلاَ يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 36,
        "matchingEnglishURN": 262150,
        "last_updated": null
    },
    {
        "arabicURN": 367410,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "9.00",
        "hadithNumber": "2563 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الظَّنِّ وَالتَّجَسُّسِ وَالتَّنَافُسِ وَالتَّنَاجُشِ وَنَحْوِهَا ‏‏ ",
        "hadithText": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي،\n هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَحَاسَدُوا وَلاَ تَبَاغَضُوا وَلاَ تَجَسَّسُوا\n وَلاَ تَحَسَّسُوا وَلاَ تَنَاجَشُوا وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 37,
        "matchingEnglishURN": 262160,
        "last_updated": null
    },
    {
        "arabicURN": 367420,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "9.00",
        "hadithNumber": "2563 d",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الظَّنِّ وَالتَّجَسُّسِ وَالتَّنَافُسِ وَالتَّنَاجُشِ وَنَحْوِهَا ‏‏ ",
        "hadithText": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَعَلِيُّ بْنُ نَصْرٍ الْجَهْضَمِيُّ، قَالاَ حَدَّثَنَا وَهْبُ،\n بْنُ جَرِيرٍ حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ‏\"‏ لاَ تَقَاطَعُوا وَلاَ تَدَابَرُوا وَلاَ تَبَاغَضُوا\n وَلاَ تَحَاسَدُوا وَكُونُوا إِخْوَانًا كَمَا أَمَرَكُمُ اللَّهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 38,
        "matchingEnglishURN": 262170,
        "last_updated": null
    },
    {
        "arabicURN": 367430,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "9.00",
        "hadithNumber": "2563 e",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الظَّنِّ وَالتَّجَسُّسِ وَالتَّنَافُسِ وَالتَّنَاجُشِ وَنَحْوِهَا ‏‏ ",
        "hadithText": "وَحَدَّثَنِي أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ، حَدَّثَنَا حَبَّانُ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا سُهَيْلٌ، عَنْ \n أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَبَاغَضُوا وَلاَ تَدَابَرُوا وَلاَ\n تَنَافَسُوا وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا ‏\"‏ ‏.‏ <br><p>\n</bdo>",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 39,
        "matchingEnglishURN": 262180,
        "last_updated": null
    },
    {
        "arabicURN": 367440,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "10.00",
        "hadithNumber": "2564 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ ظُلْمِ الْمُسْلِمِ وَخَذْلِهِ وَاحْتِقَارِهِ وَدَمِهِ وَعِرْضِهِ وَمَالِهِ ‏‏ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا دَاوُدُ، - يَعْنِي ابْنَ قَيْسٍ - عَنْ أَبِي،\n سَعِيدٍ مَوْلَى عَامِرِ بْنِ كُرَيْزٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n ‏\"‏ لاَ تَحَاسَدُوا وَلاَ تَنَاجَشُوا وَلاَ تَبَاغَضُوا وَلاَ تَدَابَرُوا وَلاَ يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ\n وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا ‏.‏ الْمُسْلِمُ أَخُو الْمُسْلِمِ لاَ يَظْلِمُهُ وَلاَ يَخْذُلُهُ وَلاَ يَحْقِرُهُ ‏.‏ التَّقْوَى\n هَا هُنَا ‏\"‏ ‏.‏ وَيُشِيرُ إِلَى صَدْرِهِ ثَلاَثَ مَرَّاتٍ ‏\"‏ بِحَسْبِ امْرِئٍ مِنَ الشَّرِّ أَنْ يَحْقِرَ أَخَاهُ الْمُسْلِمَ\n كُلُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ حَرَامٌ دَمُهُ وَمَالُهُ وَعِرْضُهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 40,
        "matchingEnglishURN": 262190,
        "last_updated": null
    },
    {
        "arabicURN": 367450,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "10.00",
        "hadithNumber": "2564 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ ظُلْمِ الْمُسْلِمِ وَخَذْلِهِ وَاحْتِقَارِهِ وَدَمِهِ وَعِرْضِهِ وَمَالِهِ ‏‏ ",
        "hadithText": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ أُسَامَةَ، -\n وَهُوَ ابْنُ زَيْدٍ - أَنَّهُ سَمِعَ أَبَا سَعِيدٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ كُرَيْزٍ يَقُولُ سَمِعْتُ أَبَا،\n هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ فَذَكَرَ نَحْوَ حَدِيثِ دَاوُدَ وَزَادَ وَنَقَصَ\n وَمِمَّا زَادَ فِيهِ ‏\"‏ إِنَّ اللَّهَ لاَ يَنْظُرُ إِلَى أَجْسَادِكُمْ وَلاَ إِلَى صُوَرِكُمْ وَلَكِنْ يَنْظُرُ إِلَى قُلُوبِكُمْ\n ‏\"‏ ‏.‏ وَأَشَارَ بِأَصَابِعِهِ إِلَى صَدْرِهِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 41,
        "matchingEnglishURN": 262200,
        "last_updated": null
    },
    {
        "arabicURN": 367460,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "10.00",
        "hadithNumber": "2564 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ ظُلْمِ الْمُسْلِمِ وَخَذْلِهِ وَاحْتِقَارِهِ وَدَمِهِ وَعِرْضِهِ وَمَالِهِ ‏‏ ",
        "hadithText": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا كَثِيرُ بْنُ هِشَامٍ، حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ، عَنْ يَزِيدَ بْنِ،\n الأَصَمِّ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ لاَ يَنْظُرُ إِلَى\n صُوَرِكُمْ وَأَمْوَالِكُمْ وَلَكِنْ يَنْظُرُ إِلَى قُلُوبِكُمْ وَأَعْمَالِكُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 42,
        "matchingEnglishURN": 262210,
        "last_updated": null
    },
    {
        "arabicURN": 367490,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "11.00",
        "hadithNumber": "2565 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنِ الشَّحْنَاءِ، وَالتَّهَاجُرِ، ‏‏",
        "hadithText": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ مُسْلِمِ بْنِ أَبِي مَرْيَمَ، عَنْ أَبِي صَالِحٍ، سَمِعَ \n أَبَا هُرَيْرَةَ، رَفَعَهُ مَرَّةً قَالَ ‏\"‏ تُعْرَضُ الأَعْمَالُ فِي كُلِّ يَوْمِ خَمِيسٍ وَاثْنَيْنِ فَيَغْفِرُ اللَّهُ عَزَّ\n وَجَلَّ فِي ذَلِكَ الْيَوْمِ لِكُلِّ امْرِئٍ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا إِلاَّ امْرَأً كَانَتْ بَيْنَهُ وَبَيْنَ أَخِيهِ شَحْنَاءُ\n فَيُقَالُ ارْكُوا هَذَيْنِ حَتَّى يَصْطَلِحَا ارْكُوا هَذَيْنِ حَتَّى يَصْطَلِحَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 44,
        "matchingEnglishURN": 262230,
        "last_updated": null
    },
    {
        "arabicURN": 367500,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "11.00",
        "hadithNumber": "2565 d",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنِ الشَّحْنَاءِ، وَالتَّهَاجُرِ، ‏‏",
        "hadithText": "حَدَّثَنَا أَبُو الطَّاهِرِ، وَعَمْرُو بْنُ سَوَّادٍ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنَا مَالِكُ بْنُ،\n أَنَسٍ عَنْ مُسْلِمِ بْنِ أَبِي مَرْيَمَ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله\n عليه وسلم قَالَ ‏\"‏ تُعْرَضُ أَعْمَالُ النَّاسِ فِي كُلِّ جُمُعَةٍ مَرَّتَيْنِ يَوْمَ الاِثْنَيْنِ وَيَوْمَ الْخَمِيسِ\n فَيُغْفَرُ لِكُلِّ عَبْدٍ مُؤْمِنٍ إِلاَّ عَبْدًا بَيْنَهُ وَبَيْنَ أَخِيهِ شَحْنَاءُ فَيُقَالُ اتْرُكُوا - أَوِ ارْكُوا - هَذَيْنِ\n حَتَّى يَفِيئَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 45,
        "matchingEnglishURN": 262240,
        "last_updated": null
    },
    {
        "arabicURN": 367510,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "12.00",
        "hadithNumber": "2566",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فِي فَضْلِ الْحُبِّ فِي اللَّهِ ‏‏ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ،\n الرَّحْمَنِ بْنِ مَعْمَرٍ عَنْ أَبِي الْحُبَابِ، سَعِيدِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ\n صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ يَقُولُ يَوْمَ الْقِيَامَةِ أَيْنَ الْمُتَحَابُّونَ بِجَلاَلِي الْيَوْمَ أُظِلُّهُمْ فِي\n ظِلِّي يَوْمَ لاَ ظِلَّ إِلاَّ ظِلِّي ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 46,
        "matchingEnglishURN": 262250,
        "last_updated": null
    },
    {
        "arabicURN": 367520,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "12.00",
        "hadithNumber": "2567 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فِي فَضْلِ الْحُبِّ فِي اللَّهِ ‏‏ ",
        "hadithText": "حَدَّثَنِي عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَبِي رَافِعٍ،\n عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ أَنَّ رَجُلاً زَارَ أَخًا لَهُ فِي قَرْيَةٍ أُخْرَى\n فَأَرْصَدَ اللَّهُ لَهُ عَلَى مَدْرَجَتِهِ مَلَكًا فَلَمَّا أَتَى عَلَيْهِ قَالَ أَيْنَ تُرِيدُ قَالَ أُرِيدُ أَخًا لِي فِي هَذِهِ\n الْقَرْيَةِ ‏.‏ قَالَ هَلْ لَكَ عَلَيْهِ مِنْ نِعْمَةٍ تَرُبُّهَا قَالَ لاَ غَيْرَ أَنِّي أَحْبَبْتُهُ فِي اللَّهِ عَزَّ وَجَلَّ ‏.‏\n قَالَ فَإِنِّي رَسُولُ اللَّهِ إِلَيْكَ بِأَنَّ اللَّهَ قَدْ أَحَبَّكَ كَمَا أَحْبَبْتَهُ فِيهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 47,
        "matchingEnglishURN": 262261,
        "last_updated": null
    },
    {
        "arabicURN": 367530,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "12.00",
        "hadithNumber": "2567 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فِي فَضْلِ الْحُبِّ فِي اللَّهِ ‏‏ ",
        "hadithText": "قَالَ الشَّيْخُ أَبُو أَحْمَدَ أَخْبَرَنِي أَبُو بَكْرٍ، مُحَمَّدُ بْنُ زَنْجُويَهْ الْقُشَيْرِيُّ حَدَّثَنَا عَبْدُ،\n الأَعْلَى بْنُ حَمَّادٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 48,
        "matchingEnglishURN": 262262,
        "last_updated": null
    },
    {
        "arabicURN": 367540,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "13.00",
        "hadithNumber": "2568 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ عِيَادَةِ الْمَرِيضِ ‏‏ ",
        "hadithText": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَأَبُو الرَّبِيعِ الزَّهْرَانِيُّ، قَالاَ حَدَّثَنَا حَمَّادٌ، - يَعْنِيَانِ ابْنَ\n زَيْدٍ - عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي أَسْمَاءَ، عَنْ ثَوْبَانَ، قَالَ أَبُو الرَّبِيعِ رَفَعَهُ إِلَى\n النَّبِيِّ صلى الله عليه وسلم وَفِي حَدِيثِ سَعِيدٍ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n ‏\"‏ عَائِدُ الْمَرِيضِ فِي مَخْرَفَةِ الْجَنَّةِ حَتَّى يَرْجِعَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 49,
        "matchingEnglishURN": 262270,
        "last_updated": null
    },
    {
        "arabicURN": 367550,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "13.00",
        "hadithNumber": "2568 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ عِيَادَةِ الْمَرِيضِ ‏‏ ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا هُشَيْمٌ، عَنْ خَالِدٍ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي،\n أَسْمَاءَ عَنْ ثَوْبَانَ، مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ قَالَ رَسُولُ اللَّهِ صلى الله\n عليه وسلم ‏\"‏ مَنْ عَادَ مَرِيضًا لَمْ يَزَلْ فِي خُرْفَةِ الْجَنَّةِ حَتَّى يَرْجِعَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 50,
        "matchingEnglishURN": 262280,
        "last_updated": null
    },
    {
        "arabicURN": 367560,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "13.00",
        "hadithNumber": "2568 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ عِيَادَةِ الْمَرِيضِ ‏‏ ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا خَالِدٌ، عَنْ أَبِي قِلاَبَةَ،\n عَنْ أَبِي أَسْمَاءَ الرَّحَبِيِّ، عَنْ ثَوْبَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ الْمُسْلِمَ إِذَا\n عَادَ أَخَاهُ الْمُسْلِمَ لَمْ يَزَلْ فِي خُرْفَةِ الْجَنَّةِ حَتَّى يَرْجِعَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 51,
        "matchingEnglishURN": 262290,
        "last_updated": null
    },
    {
        "arabicURN": 367570,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "13.00",
        "hadithNumber": "2568 d",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ عِيَادَةِ الْمَرِيضِ ‏‏ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنْ يَزِيدَ، - وَاللَّفْظُ لِزُهَيْرٍ\n - حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا عَاصِمٌ الأَحْوَلُ، عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ، - وَهُوَ أَبُو قِلاَبَةَ\n - عَنْ أَبِي الأَشْعَثِ الصَّنْعَانِيِّ، عَنْ أَبِي أَسْمَاءَ الرَّحَبِيِّ، عَنْ ثَوْبَانَ، مَوْلَى رَسُولِ اللَّهِ صلى\n الله عليه وسلم عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ عَادَ مَرِيضًا لَمْ يَزَلْ فِي\n خُرْفَةِ الْجَنَّةِ ‏\"‏ ‏.‏ قِيلَ يَا رَسُولَ اللَّهِ وَمَا خُرْفَةُ الْجَنَّةِ قَالَ ‏\"‏ جَنَاهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 52,
        "matchingEnglishURN": 262300,
        "last_updated": null
    },
    {
        "arabicURN": 367580,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "13.00",
        "hadithNumber": "2568 e",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ عِيَادَةِ الْمَرِيضِ ‏‏ ",
        "hadithText": "حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، عَنْ عَاصِمٍ الأَحْوَلِ، بِهَذَا الإِسْنَادِ\n ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 53,
        "matchingEnglishURN": 262310,
        "last_updated": null
    },
    {
        "arabicURN": 367590,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "13.00",
        "hadithNumber": "2569",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ عِيَادَةِ الْمَرِيضِ ‏‏ ",
        "hadithText": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ،\n عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ عَزَّ\n وَجَلَّ يَقُولُ يَوْمَ الْقِيَامَةِ يَا ابْنَ آدَمَ مَرِضْتُ فَلَمْ تَعُدْنِي ‏.‏ قَالَ يَا رَبِّ كَيْفَ أَعُودُكَ وَأَنْتَ\n رَبُّ الْعَالَمِينَ ‏.‏ قَالَ أَمَا عَلِمْتَ أَنَّ عَبْدِي فُلاَنًا مَرِضَ فَلَمْ تَعُدْهُ أَمَا عَلِمْتَ أَنَّكَ لَوْ عُدْتَهُ\n لَوَجَدْتَنِي عِنْدَهُ يَا ابْنَ آدَمَ اسْتَطْعَمْتُكَ فَلَمْ تُطْعِمْنِي ‏.‏ قَالَ يَا رَبِّ وَكَيْفَ أُطْعِمُكَ وَأَنْتَ رَبُّ\n الْعَالَمِينَ ‏.‏ قَالَ أَمَا عَلِمْتَ أَنَّهُ اسْتَطْعَمَكَ عَبْدِي فُلاَنٌ فَلَمْ تُطْعِمْهُ أَمَا عَلِمْتَ أَنَّكَ لَوْ أَطْعَمْتَهُ\n لَوَجَدْتَ ذَلِكَ عِنْدِي يَا ابْنَ آدَمَ اسْتَسْقَيْتُكَ فَلَمْ تَسْقِنِي ‏.‏ قَالَ يَا رَبِّ كَيْفَ أَسْقِيكَ وَأَنْتَ رَبُّ\n الْعَالَمِينَ قَالَ اسْتَسْقَاكَ عَبْدِي فُلاَنٌ فَلَمْ تَسْقِهِ أَمَا إِنَّكَ لَوْ سَقَيْتَهُ وَجَدْتَ ذَلِكَ عِنْدِي ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 54,
        "matchingEnglishURN": 262320,
        "last_updated": null
    },
    {
        "arabicURN": 367600,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "14.00",
        "hadithNumber": "2570 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب ثَوَابِ الْمُؤْمِنِ فِيمَا يُصِيبُهُ مِنْ مَرَضٍ أَوْ حُزْنٍ أَوْ نَحْوِ ذَلِكَ حَتَّى الشَّوْكَةِ يُش",
        "hadithText": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ،\n عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ مَسْرُوقٍ، قَالَ قَالَتْ عَائِشَةُ مَا رَأَيْتُ\n رَجُلاً أَشَدَّ عَلَيْهِ الْوَجَعُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ وَفِي رِوَايَةِ عُثْمَانَ مَكَانَ\n الْوَجَعِ وَجَعًا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 55,
        "matchingEnglishURN": 262330,
        "last_updated": null
    },
    {
        "arabicURN": 367610,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "14.00",
        "hadithNumber": "2570 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب ثَوَابِ الْمُؤْمِنِ فِيمَا يُصِيبُهُ مِنْ مَرَضٍ أَوْ حُزْنٍ أَوْ نَحْوِ ذَلِكَ حَتَّى الشَّوْكَةِ يُش",
        "hadithText": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، أَخْبَرَنِي أَبِي ح، وَحَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ\n حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، ح وَحَدَّثَنِي بِشْرُ بْنُ خَالِدٍ، أَخْبَرَنَا مُحَمَّدٌ، - يَعْنِي ابْنَ جَعْفَرٍ - كُلُّهُمْ\n عَنْ شُعْبَةَ، عَنِ الأَعْمَشِ، ح وَحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، ح وَحَدَّثَنَا ابْنُ،\n نُمَيْرٍ حَدَّثَنَا مُصْعَبُ بْنُ الْمِقْدَامِ، كِلاَهُمَا عَنْ سُفْيَانَ، عَنِ الأَعْمَشِ، بِإِسْنَادِ جَرِيرٍ مِثْلَ حَدِيثِهِ\n ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 56,
        "matchingEnglishURN": 262340,
        "last_updated": null
    },
    {
        "arabicURN": 367620,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "14.00",
        "hadithNumber": "2571 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب ثَوَابِ الْمُؤْمِنِ فِيمَا يُصِيبُهُ مِنْ مَرَضٍ أَوْ حُزْنٍ أَوْ نَحْوِ ذَلِكَ حَتَّى الشَّوْكَةِ يُش",
        "hadithText": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ\n أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ،\n عَنْ عَبْدِ اللَّهِ، قَالَ دَخَلْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ يُوعَكُ فَمَسِسْتُهُ بِيَدِي\n فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّكَ لَتُوعَكُ وَعْكًا شَدِيدًا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏\n أَجَلْ إِنِّي أُوعَكُ كَمَا يُوعَكُ رَجُلاَنِ مِنْكُمْ ‏\"‏ ‏.‏ قَالَ فَقُلْتُ ذَلِكَ أَنَّ لَكَ أَجْرَيْنِ فَقَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\"‏ أَجَلْ ‏\"‏ ‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْ\n مُسْلِمٍ يُصِيبُهُ أَذًى مِنْ مَرَضٍ فَمَا سِوَاهُ إِلاَّ حَطَّ اللَّهُ بِهِ سَيِّئَاتِهِ كَمَا تَحُطُّ الشَّجَرَةُ وَرَقَهَا\n ‏\"‏ ‏.‏ وَلَيْسَ فِي حَدِيثِ زُهَيْرٍ فَمَسِسْتُهُ بِيَدِي ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 57,
        "matchingEnglishURN": 262350,
        "last_updated": null
    },
    {
        "arabicURN": 367630,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "14.00",
        "hadithNumber": "2571 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب ثَوَابِ الْمُؤْمِنِ فِيمَا يُصِيبُهُ مِنْ مَرَضٍ أَوْ حُزْنٍ أَوْ نَحْوِ ذَلِكَ حَتَّى الشَّوْكَةِ يُش",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنِي \n مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا سُفْيَانُ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا \n عِيسَى بْنُ يُونُسَ، وَيَحْيَى بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي غَنِيَّةَ، كُلُّهُمْ عَنِ الأَعْمَشِ، بِإِسْنَادِ جَرِيرٍ\n ‏.‏ نَحْوَ حَدِيثِهِ وَزَادَ فِي حَدِيثِ أَبِي مُعَاوِيَةَ قَالَ ‏\"‏ نَعَمْ وَالَّذِي نَفْسِي بِيَدِهِ مَا عَلَى الأَرْضِ\n مُسْلِمٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 58,
        "matchingEnglishURN": 262360,
        "last_updated": null
    },
    {
        "arabicURN": 367640,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "14.00",
        "hadithNumber": "2572 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب ثَوَابِ الْمُؤْمِنِ فِيمَا يُصِيبُهُ مِنْ مَرَضٍ أَوْ حُزْنٍ أَوْ نَحْوِ ذَلِكَ حَتَّى الشَّوْكَةِ يُش",
        "hadithText": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنْ جَرِيرٍ، قَالَ زُهَيْرٌ حَدَّثَنَا \n جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، قَالَ دَخَلَ شَبَابٌ مِنْ قُرَيْشٍ عَلَى عَائِشَةَ وَهِيَ\n بِمِنًى وَهُمْ يَضْحَكُونَ فَقَالَتْ مَا يُضْحِكُكُمْ قَالُوا فُلاَنٌ خَرَّ عَلَى طُنُبِ فُسْطَاطٍ فَكَادَتْ عُنُقُهُ\n أَوْ عَيْنُهُ أَنْ تَذْهَبَ ‏.‏ فَقَالَتْ لاَ تَضْحَكُوا فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ\n ‏\"‏ مَا مِنْ مُسْلِمٍ يُشَاكُ شَوْكَةً فَمَا فَوْقَهَا إِلاَّ كُتِبَتْ لَهُ بِهَا دَرَجَةٌ وَمُحِيَتْ عَنْهُ بِهَا خَطِيئَةٌ\n ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 59,
        "matchingEnglishURN": 262370,
        "last_updated": null
    },
    {
        "arabicURN": 367650,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "14.00",
        "hadithNumber": "2572 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب ثَوَابِ الْمُؤْمِنِ فِيمَا يُصِيبُهُ مِنْ مَرَضٍ أَوْ حُزْنٍ أَوْ نَحْوِ ذَلِكَ حَتَّى الشَّوْكَةِ يُش",
        "hadithText": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ وَاللَّفْظُ لَهُمَا ح وَحَدَّثَنَا إِسْحَاقُ الْحَنْظَلِيُّ،\n قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ \n الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا يُصِيبُ الْمُؤْمِنَ مِنْ\n شَوْكَةٍ فَمَا فَوْقَهَا إِلاَّ رَفَعَهُ اللَّهُ بِهَا دَرَجَةً أَوْ حَطَّ عَنْهُ بِهَا خَطِيئَةً ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 60,
        "matchingEnglishURN": 262380,
        "last_updated": null
    },
    {
        "arabicURN": 367660,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "14.00",
        "hadithNumber": "2572 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب ثَوَابِ الْمُؤْمِنِ فِيمَا يُصِيبُهُ مِنْ مَرَضٍ أَوْ حُزْنٍ أَوْ نَحْوِ ذَلِكَ حَتَّى الشَّوْكَةِ يُش",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ،\n عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تُصِيبُ الْمُؤْمِنَ شَوْكَةٌ فَمَا\n فَوْقَهَا إِلاَّ قَصَّ اللَّهُ بِهَا مِنْ خَطِيئَتِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 61,
        "matchingEnglishURN": 262390,
        "last_updated": null
    },
    {
        "arabicURN": 367670,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "14.00",
        "hadithNumber": "2572 d",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب ثَوَابِ الْمُؤْمِنِ فِيمَا يُصِيبُهُ مِنْ مَرَضٍ أَوْ حُزْنٍ أَوْ نَحْوِ ذَلِكَ حَتَّى الشَّوْكَةِ يُش",
        "hadithText": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامٌ، بِهَذَا الإِسْنَادِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 62,
        "matchingEnglishURN": 262393,
        "last_updated": null
    },
    {
        "arabicURN": 367680,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "14.00",
        "hadithNumber": "2572 e",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب ثَوَابِ الْمُؤْمِنِ فِيمَا يُصِيبُهُ مِنْ مَرَضٍ أَوْ حُزْنٍ أَوْ نَحْوِ ذَلِكَ حَتَّى الشَّوْكَةِ يُش",
        "hadithText": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ، وَيُونُسُ بْنُ يَزِيدَ،\n عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ\n ‏\"‏ مَا مِنْ مُصِيبَةٍ يُصَابُ بِهَا الْمُسْلِمُ إِلاَّ كُفِّرَ بِهَا عَنْهُ حَتَّى الشَّوْكَةِ يُشَاكُهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 63,
        "matchingEnglishURN": 262394,
        "last_updated": null
    },
    {
        "arabicURN": 367690,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "14.00",
        "hadithNumber": "2572 f",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب ثَوَابِ الْمُؤْمِنِ فِيمَا يُصِيبُهُ مِنْ مَرَضٍ أَوْ حُزْنٍ أَوْ نَحْوِ ذَلِكَ حَتَّى الشَّوْكَةِ يُش",
        "hadithText": "حَدَّثَنَا أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ،\n عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى\n الله عليه وسلم قَالَ ‏\"‏ لاَ يُصِيبُ الْمُؤْمِنَ مِنْ مُصِيبَةٍ حَتَّى الشَّوْكَةِ إِلاَّ قُصَّ بِهَا مِنْ خَطَايَاهُ\n أَوْ كُفِّرَ بِهَا مِنْ خَطَايَاهُ ‏\"‏ ‏.‏ لاَ يَدْرِي يَزِيدُ أَيَّتُهُمَا قَالَ عُرْوَةُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 64,
        "matchingEnglishURN": 262400,
        "last_updated": null
    },
    {
        "arabicURN": 367700,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "14.00",
        "hadithNumber": "2572 g",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب ثَوَابِ الْمُؤْمِنِ فِيمَا يُصِيبُهُ مِنْ مَرَضٍ أَوْ حُزْنٍ أَوْ نَحْوِ ذَلِكَ حَتَّى الشَّوْكَةِ يُش",
        "hadithText": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنَا حَيْوَةُ، حَدَّثَنَا ابْنُ الْهَادِ،\n عَنْ أَبِي بَكْرِ بْنِ حَزْمٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم\n يَقُولُ ‏\"‏ مَا مِنْ شَىْءٍ يُصِيبُ الْمُؤْمِنَ حَتَّى الشَّوْكَةِ تُصِيبُهُ إِلاَّ كَتَبَ اللَّهُ لَهُ بِهَا حَسَنَةً أَوْ حُطَّتْ\n عَنْهُ بِهَا خَطِيئَةٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 65,
        "matchingEnglishURN": 262410,
        "last_updated": null
    },
    {
        "arabicURN": 367710,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "14.00",
        "hadithNumber": "2573",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب ثَوَابِ الْمُؤْمِنِ فِيمَا يُصِيبُهُ مِنْ مَرَضٍ أَوْ حُزْنٍ أَوْ نَحْوِ ذَلِكَ حَتَّى الشَّوْكَةِ يُش",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الْوَلِيدِ بْنِ،\n كَثِيرٍ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ، وَأَبِي، هُرَيْرَةَ أَنَّهُمَا\n سَمِعَا رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَا يُصِيبُ الْمُؤْمِنَ مِنْ وَصَبٍ وَلاَ نَصَبٍ وَلاَ\n سَقَمٍ وَلاَ حَزَنٍ حَتَّى الْهَمِّ يُهَمُّهُ إِلاَّ كُفِّرَ بِهِ مِنْ سَيِّئَاتِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 66,
        "matchingEnglishURN": 262420,
        "last_updated": null
    },
    {
        "arabicURN": 367720,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "14.00",
        "hadithNumber": "2574",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب ثَوَابِ الْمُؤْمِنِ فِيمَا يُصِيبُهُ مِنْ مَرَضٍ أَوْ حُزْنٍ أَوْ نَحْوِ ذَلِكَ حَتَّى الشَّوْكَةِ يُش",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ كِلاَهُمَا عَنِ ابْنِ عُيَيْنَةَ، - وَاللَّفْظُ\n لِقُتَيْبَةَ - حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ مُحَيْصِنٍ، شَيْخٍ مِنْ قُرَيْشٍ سَمِعَ مُحَمَّدَ بْنَ قَيْسِ بْنِ مَخْرَمَةَ،\n يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ، قَالَ لَمَّا نَزَلَتْ <A id=\"q1\" name=\"q1\" href=\"javascript:openquran(3,123,123)\"><c_q1>‏{‏ مَنْ يَعْمَلْ سُوءًا يُجْزَ بِهِ‏}‏</c_q1></a> بَلَغَتْ مِنَ الْمُسْلِمِينَ مَبْلَغًا\n شَدِيدًا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَارِبُوا وَسَدِّدُوا فَفِي كُلِّ مَا يُصَابُ بِهِ\n الْمُسْلِمُ كَفَّارَةٌ حَتَّى النَّكْبَةِ يُنْكَبُهَا أَوِ الشَّوْكَةِ يُشَاكُهَا ‏\"‏ ‏.‏ قَالَ مُسْلِمٌ هُوَ عُمَرُ بْنُ عَبْدِ الرَّحْمَنِ\n بْنِ مُحَيْصِنٍ مِنْ أَهْلِ مَكَّةَ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 67,
        "matchingEnglishURN": 262430,
        "last_updated": null
    },
    {
        "arabicURN": 367730,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "14.00",
        "hadithNumber": "2575",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب ثَوَابِ الْمُؤْمِنِ فِيمَا يُصِيبُهُ مِنْ مَرَضٍ أَوْ حُزْنٍ أَوْ نَحْوِ ذَلِكَ حَتَّى الشَّوْكَةِ يُش",
        "hadithText": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا الْحَجَّاجُ الصَّوَّافُ،\n حَدَّثَنِي أَبُو الزُّبَيْرِ، حَدَّثَنَا جَابِرُ بْنُ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ عَلَى\n أُمِّ السَّائِبِ أَوْ أُمِّ الْمُسَيَّبِ فَقَالَ ‏\"‏ مَا لَكِ يَا أُمَّ السَّائِبِ أَوْ يَا أُمَّ الْمُسَيَّبِ تُزَفْزِفِينَ ‏\"‏ ‏.‏\n قَالَتِ الْحُمَّى لاَ بَارَكَ اللَّهُ فِيهَا ‏.‏ فَقَالَ ‏\"‏ لاَ تَسُبِّي الْحُمَّى فَإِنَّهَا تُذْهِبُ خَطَايَا بَنِي آدَمَ\n كَمَا يُذْهِبُ الْكِيرُ خَبَثَ الْحَدِيدِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 68,
        "matchingEnglishURN": 262440,
        "last_updated": null
    },
    {
        "arabicURN": 367740,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "14.00",
        "hadithNumber": "2576",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب ثَوَابِ الْمُؤْمِنِ فِيمَا يُصِيبُهُ مِنْ مَرَضٍ أَوْ حُزْنٍ أَوْ نَحْوِ ذَلِكَ حَتَّى الشَّوْكَةِ يُش",
        "hadithText": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَبِشْرُ بْنُ الْمُفَضَّلِ،\n قَالاَ حَدَّثَنَا عِمْرَانُ أَبُو بَكْرٍ، حَدَّثَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ، قَالَ قَالَ لِي ابْنُ عَبَّاسٍ أَلاَ أُرِيكَ\n امْرَأَةً مِنْ أَهْلِ الْجَنَّةِ قُلْتُ بَلَى ‏.‏ قَالَ هَذِهِ الْمَرْأَةُ السَّوْدَاءُ أَتَتِ النَّبِيَّ صلى الله عليه وسلم\n قَالَتْ إِنِّي أُصْرَعُ وَإِنِّي أَتَكَشَّفُ فَادْعُ اللَّهَ لِي ‏.‏ قَالَ ‏\"‏ إِنْ شِئْتِ صَبَرْتِ وَلَكِ الْجَنَّةُ وَإِنْ\n شِئْتِ دَعَوْتُ اللَّهَ أَنْ يُعَافِيَكِ ‏.‏ قَالَتْ أَصْبِرُ ‏.‏ قَالَتْ فَإِنِّي أَتَكَشَّفُ فَادْعُ اللَّهَ أَنْ لاَ أَتَكَشَّفَ\n ‏.‏ فَدَعَا لَهَا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 69,
        "matchingEnglishURN": 262450,
        "last_updated": null
    },
    {
        "arabicURN": 367750,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "15.00",
        "hadithNumber": "2577 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الظُّلْمِ ‏‏ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ بَهْرَامَ الدَّارِمِيُّ، حَدَّثَنَا مَرْوَانُ، - يَعْنِي ابْنَ\n مُحَمَّدٍ الدِّمَشْقِيَّ - حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ، عَنْ رَبِيعَةَ بْنِ يَزِيدَ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ،\n عَنْ أَبِي ذَرٍّ، عَنِ النَّبِيِّ صلى الله عليه وسلم فِيمَا رَوَى عَنِ اللَّهِ، تَبَارَكَ وَتَعَالَى أَنَّهُ قَالَ\n ‏\"‏ يَا عِبَادِي إِنِّي حَرَّمْتُ الظُّلْمَ عَلَى نَفْسِي وَجَعَلْتُهُ بَيْنَكُمْ مُحَرَّمًا فَلاَ تَظَالَمُوا يَا عِبَادِي\n كُلُّكُمْ ضَالٌّ إِلاَّ مَنْ هَدَيْتُهُ فَاسْتَهْدُونِي أَهْدِكُمْ يَا عِبَادِي كُلُّكُمْ جَائِعٌ إِلاَّ مَنْ أَطْعَمْتُهُ فَاسْتَطْعِمُونِي\n أُطْعِمْكُمْ يَا عِبَادِي كُلُّكُمْ عَارٍ إِلاَّ مَنْ كَسَوْتُهُ فَاسْتَكْسُونِي أَكْسُكُمْ يَا عِبَادِي إِنَّكُمْ تُخْطِئُونَ\n بِاللَّيْلِ وَالنَّهَارِ وَأَنَا أَغْفِرُ الذُّنُوبَ جَمِيعًا فَاسْتَغْفِرُونِي أَغْفِرْ لَكُمْ يَا عِبَادِي إِنَّكُمْ لَنْ تَبْلُغُوا\n ضَرِّي فَتَضُرُّونِي وَلَنْ تَبْلُغُوا نَفْعِي فَتَنْفَعُونِي يَا عِبَادِي لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ\n كَانُوا عَلَى أَتْقَى قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ مَا زَادَ ذَلِكَ فِي مُلْكِي شَيْئًا يَا عِبَادِي لَوْ أَنَّ أَوَّلَكُمْ\n وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَفْجَرِ قَلْبِ رَجُلٍ وَاحِدٍ مَا نَقَصَ ذَلِكَ مِنْ مُلْكِي شَيْئًا\n يَا عِبَادِي لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ قَامُوا فِي صَعِيدٍ وَاحِدٍ فَسَأَلُونِي فَأَعْطَيْتُ\n كُلَّ إِنْسَانٍ مَسْأَلَتَهُ مَا نَقَصَ ذَلِكَ مِمَّا عِنْدِي إِلاَّ كَمَا يَنْقُصُ الْمِخْيَطُ إِذَا أُدْخِلَ الْبَحْرَ يَا عِبَادِي\n إِنَّمَا هِيَ أَعْمَالُكُمْ أُحْصِيهَا لَكُمْ ثُمَّ أُوَفِّيكُمْ إِيَّاهَا فَمَنْ وَجَدَ خَيْرًا فَلْيَحْمَدِ اللَّهَ وَمَنْ وَجَدَ\n غَيْرَ ذَلِكَ فَلاَ يَلُومَنَّ إِلاَّ نَفْسَهُ ‏\"‏ ‏.‏ قَالَ سَعِيدٌ كَانَ أَبُو إِدْرِيسَ الْخَوْلاَنِيُّ إِذَا حَدَّثَ بِهَذَا\n الْحَدِيثِ جَثَا عَلَى رُكْبَتَيْهِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 70,
        "matchingEnglishURN": 262460,
        "last_updated": null
    },
    {
        "arabicURN": 367760,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "15.00",
        "hadithNumber": "2577 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الظُّلْمِ ‏‏ ",
        "hadithText": "حَدَّثَنِيهِ أَبُو بَكْرِ بْنُ إِسْحَاقَ، حَدَّثَنَا أَبُو مُسْهِرٍ، حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ، بِهَذَا\n الإِسْنَادِ غَيْرَ أَنَّ مَرْوَانَ أَتَمُّهُمَا حَدِيثًا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 71,
        "matchingEnglishURN": 262465,
        "last_updated": null
    },
    {
        "arabicURN": 367770,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "15.00",
        "hadithNumber": "2577 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الظُّلْمِ ‏‏ ",
        "hadithText": "قَالَ أَبُو إِسْحَاقَ حَدَّثَنَا بِهَذَا الْحَدِيثِ الْحَسَنُ، وَالْحُسَيْنُ، ابْنَا بِشْرٍ وَمُحَمَّدُ بْنُ يَحْيَى\n قَالُوا حَدَّثَنَا أَبُو مُسْهِرٍ، ‏.‏ فَذَكَرُوا الْحَدِيثَ بِطُولِهِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 72,
        "matchingEnglishURN": 262467,
        "last_updated": null
    },
    {
        "arabicURN": 367780,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "15.00",
        "hadithNumber": "2577 d",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الظُّلْمِ ‏‏ ",
        "hadithText": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، كِلاَهُمَا عَنْ عَبْدِ الصَّمَدِ بْنِ عَبْدِ،\n الْوَارِثِ حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي أَسْمَاءَ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم فِيمَا يَرْوِي عَنْ رَبِّهِ تَبَارَكَ وَتَعَالَى ‏\"‏ إِنِّي حَرَّمْتُ عَلَى\n نَفْسِي الظُّلْمَ وَعَلَى عِبَادِي فَلاَ تَظَالَمُوا ‏\"‏ ‏.‏ وَسَاقَ الْحَدِيثَ بِنَحْوِهِ وَحَدِيثُ أَبِي إِدْرِيسَ\n الَّذِي ذَكَرْنَاهُ أَتَمُّ مِنْ هَذَا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 73,
        "matchingEnglishURN": 262470,
        "last_updated": null
    },
    {
        "arabicURN": 367790,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "15.00",
        "hadithNumber": "2578",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الظُّلْمِ ‏‏ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا دَاوُدُ، - يَعْنِي ابْنَ قَيْسٍ - عَنْ عُبَيْدِ،\n اللَّهِ بْنِ مِقْسَمٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ اتَّقُوا الظُّلْمَ\n فَإِنَّ الظُّلْمَ ظُلُمَاتٌ يَوْمَ الْقِيَامَةِ وَاتَّقُوا الشُّحَّ فَإِنَّ الشُّحَّ أَهْلَكَ مَنْ كَانَ قَبْلَكُمْ حَمَلَهُمْ عَلَى\n أَنْ سَفَكُوا دِمَاءَهُمْ وَاسْتَحَلُّوا مَحَارِمَهُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 74,
        "matchingEnglishURN": 262480,
        "last_updated": null
    },
    {
        "arabicURN": 367800,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "15.00",
        "hadithNumber": "2579",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الظُّلْمِ ‏‏ ",
        "hadithText": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ الْمَاجِشُونُ، عَنْ عَبْدِ اللَّهِ،\n بْنِ دِينَارٍ عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ الظُّلْمَ ظُلُمَاتٌ يَوْمَ\n الْقِيَامَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 75,
        "matchingEnglishURN": 262490,
        "last_updated": null
    },
    {
        "arabicURN": 367810,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "15.00",
        "hadithNumber": "2580",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الظُّلْمِ ‏‏ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ،\n أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الْمُسْلِمُ أَخُو الْمُسْلِمِ لاَ يَظْلِمُهُ وَلاَ يُسْلِمُهُ مَنْ\n كَانَ فِي حَاجَةِ أَخِيهِ كَانَ اللَّهُ فِي حَاجَتِهِ وَمَنْ فَرَّجَ عَنْ مُسْلِمٍ كُرْبَةً فَرَّجَ اللَّهُ عَنْهُ بِهَا\n كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 76,
        "matchingEnglishURN": 262500,
        "last_updated": null
    },
    {
        "arabicURN": 367820,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "15.00",
        "hadithNumber": "2581",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الظُّلْمِ ‏‏ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ\n - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَتَدْرُونَ\n مَا الْمُفْلِسُ ‏\"‏ ‏.‏ قَالُوا الْمُفْلِسُ فِينَا مَنْ لاَ دِرْهَمَ لَهُ وَلاَ مَتَاعَ ‏.‏ فَقَالَ ‏\"‏ إِنَّ الْمُفْلِسَ مِنْ أُمَّتِي\n يَأْتِي يَوْمَ الْقِيَامَةِ بِصَلاَةٍ وَصِيَامٍ وَزَكَاةٍ وَيَأْتِي قَدْ شَتَمَ هَذَا وَقَذَفَ هَذَا وَأَكَلَ مَالَ هَذَا وَسَفَكَ\n دَمَ هَذَا وَضَرَبَ هَذَا فَيُعْطَى هَذَا مِنْ حَسَنَاتِهِ وَهَذَا مِنْ حَسَنَاتِهِ فَإِنْ فَنِيَتْ حَسَنَاتُهُ قَبْلَ\n أَنْ يُقْضَى مَا عَلَيْهِ أُخِذَ مِنْ خَطَايَاهُمْ فَطُرِحَتْ عَلَيْهِ ثُمَّ طُرِحَ فِي النَّارِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 77,
        "matchingEnglishURN": 262510,
        "last_updated": null
    },
    {
        "arabicURN": 367830,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "15.00",
        "hadithNumber": "2582",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الظُّلْمِ ‏‏ ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنُونَ ابْنَ\n جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ\n ‏\"‏ لَتُؤَدُّنَّ الْحُقُوقَ إِلَى أَهْلِهَا يَوْمَ الْقِيَامَةِ حَتَّى يُقَادَ لِلشَّاةِ الْجَلْحَاءِ مِنَ الشَّاةِ الْقَرْنَاءِ ‏\"‏\n ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 78,
        "matchingEnglishURN": 262520,
        "last_updated": null
    },
    {
        "arabicURN": 367840,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "15.00",
        "hadithNumber": "2583",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الظُّلْمِ ‏‏ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا بُرَيْدُ بْنُ أَبِي بُرْدَةَ،\n عَنْ أَبِيهِ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ\n يُمْلِي لِلظَّالِمِ فَإِذَا أَخَذَهُ لَمْ يُفْلِتْهُ ‏\"‏ ‏.‏ ثُمَّ قَرَأَ ‏<A id=\"q2\" name=\"q2\" href=\"javascript:openquran(10,102,102)\"><c_q2>{‏ وَكَذَلِكَ أَخْذُ رَبِّكَ إِذَا أَخَذَ الْقُرَى وَهِيَ ظَالِمَةٌ\n إِنَّ أَخْذَهُ أَلِيمٌ شَدِيدٌ‏}</c_q2></a>‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 79,
        "matchingEnglishURN": 262530,
        "last_updated": null
    },
    {
        "arabicURN": 367850,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "16.00",
        "hadithNumber": "2584 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب نَصْرِ الأَخِ ظَالِمًا أَوْ مَظْلُومًا ‏‏ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ،\n قَالَ اقْتَتَلَ غُلاَمَانِ غُلاَمٌ مِنَ الْمُهَاجِرِينَ وَغُلاَمٌ مِنَ الأَنْصَارِ فَنَادَى الْمُهَاجِرُ أَوِ الْمُهَاجِرُونَ\n يَا لَلْمُهَاجِرِينَ ‏.‏ وَنَادَى الأَنْصَارِيُّ يَا لَلأَنْصَارِ ‏.‏ فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n فَقَالَ ‏\"‏ مَا هَذَا دَعْوَى أَهْلِ الْجَاهِلِيَّةِ ‏\"‏ ‏.‏ قَالُوا لاَ يَا رَسُولَ اللَّهِ إِلاَّ أَنَّ غُلاَمَيْنِ اقْتَتَلاَ\n فَكَسَعَ أَحَدُهُمَا الآخَرَ قَالَ ‏\"‏ فَلاَ بَأْسَ وَلْيَنْصُرِ الرَّجُلُ أَخَاهُ ظَالِمًا أَوْ مَظْلُومًا إِنْ كَانَ\n ظَالِمًا فَلْيَنْهَهُ فَإِنَّهُ لَهُ نَصْرٌ وَإِنْ كَانَ مَظْلُومًا فَلْيَنْصُرْهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 80,
        "matchingEnglishURN": 262540,
        "last_updated": null
    },
    {
        "arabicURN": 367860,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "16.00",
        "hadithNumber": "2584 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب نَصْرِ الأَخِ ظَالِمًا أَوْ مَظْلُومًا ‏‏ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَأَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ، وَابْنُ أَبِي،\n عُمَرَ - وَاللَّفْظُ لاِبْنِ أَبِي شَيْبَةَ - قَالَ ابْنُ عَبْدَةَ أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا سُفْيَانُ بْنُ،\n عُيَيْنَةَ قَالَ سَمِعَ عَمْرٌو، جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي\n غَزَاةٍ فَكَسَعَ رَجُلٌ مِنَ الْمُهَاجِرِينَ رَجُلاً مِنَ الأَنْصَارِ فَقَالَ الأَنْصَارِيُّ يَا لَلأَنْصَارِ وَقَالَ\n الْمُهَاجِرِيُّ يَا لَلْمُهَاجِرِينَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا بَالُ دَعْوَى الْجَاهِلِيَّةِ\n ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ كَسَعَ رَجُلٌ مِنَ الْمُهَاجِرِينَ رَجُلاً مِنَ الأَنْصَارِ ‏.‏ فَقَالَ ‏\"‏ دَعُوهَا\n فَإِنَّهَا مُنْتِنَةٌ ‏\"‏ ‏.‏ فَسَمِعَهَا عَبْدُ اللَّهِ بْنُ أُبَىٍّ فَقَالَ قَدْ فَعَلُوهَا وَاللَّهِ لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ\n لَيُخْرِجَنَّ الأَعَزُّ مِنْهَا الأَذَلَّ ‏.‏ قَالَ عُمَرُ دَعْنِي أَضْرِبْ عُنُقَ هَذَا الْمُنَافِقِ فَقَالَ ‏\"‏ دَعْهُ لاَ\n يَتَحَدَّثُ النَّاسُ أَنَّ مُحَمَّدًا يَقْتُلُ أَصْحَابَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 81,
        "matchingEnglishURN": 262550,
        "last_updated": null
    },
    {
        "arabicURN": 367870,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "16.00",
        "hadithNumber": "2584 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب نَصْرِ الأَخِ ظَالِمًا أَوْ مَظْلُومًا ‏‏ ",
        "hadithText": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَإِسْحَاقُ بْنُ مَنْصُورٍ، وَمُحَمَّدُ بْنُ رَافِعٍ، قَالَ ابْنُ رَافِعٍ\n حَدَّثَنَا وَقَالَ الآخَرَانِ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنْ عَمْرِو بْنِ دِينَارٍ،\n عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كَسَعَ رَجُلٌ مِنَ الْمُهَاجِرِينَ رَجُلاً مِنَ الأَنْصَارِ فَأَتَى النَّبِيَّ صلى\n الله عليه وسلم فَسَأَلَهُ الْقَوَدَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ دَعُوهَا فَإِنَّهَا مُنْتِنَةٌ ‏\"‏\n ‏.‏ قَالَ ابْنُ مَنْصُورٍ فِي رِوَايَتِهِ عَمْرٌو قَالَ سَمِعْتُ جَابِرًا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 82,
        "matchingEnglishURN": 262560,
        "last_updated": null
    },
    {
        "arabicURN": 367880,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "17.00",
        "hadithNumber": "2585",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَرَاحُمِ الْمُؤْمِنِينَ وَتَعَاطُفِهِمْ وَتَعَاضُدِهِمْ ‏‏ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو عَامِرٍ الأَشْعَرِيُّ قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ،\n وَأَبُو أُسَامَةَ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، وَابْنُ، إِدْرِيسَ وَأَبُو\n أُسَامَةَ كُلُّهُمْ عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم ‏\"‏ الْمُؤْمِنُ لِلْمُؤْمِنِ كَالْبُنْيَانِ يَشُدُّ بَعْضُهُ بَعْضًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 83,
        "matchingEnglishURN": 262570,
        "last_updated": null
    },
    {
        "arabicURN": 367890,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "17.00",
        "hadithNumber": "2586 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَرَاحُمِ الْمُؤْمِنِينَ وَتَعَاطُفِهِمْ وَتَعَاضُدِهِمْ ‏‏ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا زَكَرِيَّاءُ، عَنِ الشَّعْبِيِّ، عَنِ \n النُّعْمَانِ بْنِ بَشِيرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَثَلُ الْمُؤْمِنِينَ فِي تَوَادِّهِمْ\n وَتَرَاحُمِهِمْ وَتَعَاطُفِهِمْ مَثَلُ الْجَسَدِ إِذَا اشْتَكَى مِنْهُ عُضْوٌ تَدَاعَى لَهُ سَائِرُ الْجَسَدِ بِالسَّهَرِ\n وَالْحُمَّى ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 84,
        "matchingEnglishURN": 262580,
        "last_updated": null
    },
    {
        "arabicURN": 367900,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "17.00",
        "hadithNumber": "2586 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَرَاحُمِ الْمُؤْمِنِينَ وَتَعَاطُفِهِمْ وَتَعَاضُدِهِمْ ‏‏ ",
        "hadithText": "حَدَّثَنَا إِسْحَاقُ الْحَنْظَلِيُّ، أَخْبَرَنَا جَرِيرٌ، عَنْ مُطَرِّفٍ، عَنِ الشَّعْبِيِّ، عَنِ النُّعْمَانِ بْنِ،\n بَشِيرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم بِنَحْوِهِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 85,
        "matchingEnglishURN": 262590,
        "last_updated": null
    },
    {
        "arabicURN": 367910,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "17.00",
        "hadithNumber": "2586 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَرَاحُمِ الْمُؤْمِنِينَ وَتَعَاطُفِهِمْ وَتَعَاضُدِهِمْ ‏‏ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو سَعِيدٍ الأَشَجُّ قَالاَ حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ،\n عَنِ الشَّعْبِيِّ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْمُؤْمِنُونَ\n كَرَجُلٍ وَاحِدٍ إِنِ اشْتَكَى رَأْسُهُ تَدَاعَى لَهُ سَائِرُ الْجَسَدِ بِالْحُمَّى وَالسَّهَرِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 86,
        "matchingEnglishURN": 262600,
        "last_updated": null
    },
    {
        "arabicURN": 367920,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "17.00",
        "hadithNumber": "2586 d",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَرَاحُمِ الْمُؤْمِنِينَ وَتَعَاطُفِهِمْ وَتَعَاضُدِهِمْ ‏‏ ",
        "hadithText": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، عَنِ الأَعْمَشِ،\n عَنْ خَيْثَمَةَ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْمُسْلِمُونَ\n كَرَجُلٍ وَاحِدٍ إِنِ اشْتَكَى عَيْنُهُ اشْتَكَى كُلُّهُ وَإِنِ اشْتَكَى رَأْسُهُ اشْتَكَى كُلُّهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 87,
        "matchingEnglishURN": 262610,
        "last_updated": null
    },
    {
        "arabicURN": 367930,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "17.00",
        "hadithNumber": "2586 e",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَرَاحُمِ الْمُؤْمِنِينَ وَتَعَاطُفِهِمْ وَتَعَاضُدِهِمْ ‏‏ ",
        "hadithText": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، عَنِ الأَعْمَشِ، عَنِ الشَّعْبِيِّ، عَنِ النُّعْمَانِ،\n بْنِ بَشِيرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 88,
        "matchingEnglishURN": 262620,
        "last_updated": null
    },
    {
        "arabicURN": 367940,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "18.00",
        "hadithNumber": "2587",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنِ السِّبَابِ، ‏‏",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنُونَ ابْنَ\n جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ\n ‏\"‏ الْمُسْتَبَّانِ مَا قَالاَ فَعَلَى الْبَادِئِ مَا لَمْ يَعْتَدِ الْمَظْلُومُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 89,
        "matchingEnglishURN": 262630,
        "last_updated": null
    },
    {
        "arabicURN": 367950,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "19.00",
        "hadithNumber": "2588",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب اسْتِحْبَابِ الْعَفْوِ وَالتَّوَاضُعِ ‏‏ ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ\n جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ\n ‏\"‏ مَا نَقَصَتْ صَدَقَةٌ مِنْ مَالٍ وَمَا زَادَ اللَّهُ عَبْدًا بِعَفْوٍ إِلاَّ عِزًّا وَمَا تَوَاضَعَ أَحَدٌ لِلَّهِ إِلاَّ رَفَعَهُ\n اللَّهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 90,
        "matchingEnglishURN": 262640,
        "last_updated": null
    },
    {
        "arabicURN": 367960,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "20.00",
        "hadithNumber": "2589",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الْغِيبَةِ ‏‏ ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، عَنِ الْعَلاَءِ، عَنْ \n أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَتَدْرُونَ مَا الْغِيبَةُ ‏\"‏ ‏.‏\n قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ ذِكْرُكَ أَخَاكَ بِمَا يَكْرَهُ ‏\"‏ ‏.‏ قِيلَ أَفَرَأَيْتَ إِنْ كَانَ فِي\n أَخِي مَا أَقُولُ قَالَ ‏\"‏ إِنْ كَانَ فِيهِ مَا تَقُولُ فَقَدِ اغْتَبْتَهُ وَإِنْ لَمْ يَكُنْ فِيهِ فَقَدْ بَهَتَّهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 91,
        "matchingEnglishURN": 262650,
        "last_updated": null
    },
    {
        "arabicURN": 367970,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "21.00",
        "hadithNumber": "2590 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب بِشَارَةِ مَنْ سَتَرَ اللَّهُ تَعَالَى عَيْبَهُ فِي الدُّنْيَا بِأَنْ يَسْتُرَ عَلَيْهِ فِي الآخِرَةِ",
        "hadithText": "حَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامٍ الْعَيْشِيُّ، حَدَّثَنَا يَزِيدُ، - يَعْنِي ابْنَ زُرَيْعٍ - حَدَّثَنَا رَوْحٌ،\n عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَسْتُرُ اللَّهُ\n عَلَى عَبْدٍ فِي الدُّنْيَا إِلاَّ سَتَرَهُ اللَّهُ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 92,
        "matchingEnglishURN": 262660,
        "last_updated": null
    },
    {
        "arabicURN": 367980,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "21.00",
        "hadithNumber": "2590 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب بِشَارَةِ مَنْ سَتَرَ اللَّهُ تَعَالَى عَيْبَهُ فِي الدُّنْيَا بِأَنْ يَسْتُرَ عَلَيْهِ فِي الآخِرَةِ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا سُهَيْلٌ، عَنْ أَبِيهِ،\n عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَسْتُرُ عَبْدٌ عَبْدًا فِي الدُّنْيَا إِلاَّ\n سَتَرَهُ اللَّهُ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 93,
        "matchingEnglishURN": 262670,
        "last_updated": null
    },
    {
        "arabicURN": 367990,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "22.00",
        "hadithNumber": "2591 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب مُدَارَاةِ مَنْ يُتَّقَى فُحْشُهُ ‏‏ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ\n وَابْنُ نُمَيْرٍ كُلُّهُمْ عَنِ ابْنِ عُيَيْنَةَ، - وَاللَّفْظُ لِزُهَيْرٍ - قَالَ حَدَّثَنَا سُفْيَانُ، - وَهُوَ ابْنُ عُيَيْنَةَ\n - عَنِ ابْنِ الْمُنْكَدِرِ، سَمِعَ عُرْوَةَ بْنَ الزُّبَيْرِ، يَقُولُ حَدَّثَتْنِي عَائِشَةُ، أَنَّ رَجُلاً، اسْتَأْذَنَ عَلَى\n النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ ائْذَنُوا لَهُ فَلَبِئْسَ ابْنُ الْعَشِيرَةِ أَوْ بِئْسَ رَجُلُ الْعَشِيرَةِ\n ‏\"‏ ‏.‏ فَلَمَّا دَخَلَ عَلَيْهِ أَلاَنَ لَهُ الْقَوْلَ قَالَتْ عَائِشَةُ فَقُلْتُ يَا رَسُولَ اللَّهِ قُلْتَ لَهُ الَّذِي قُلْتَ\n ثُمَّ أَلَنْتَ لَهُ الْقَوْلَ قَالَ ‏\"‏ يَا عَائِشَةُ إِنَّ شَرَّ النَّاسِ مَنْزِلَةً عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ مَنْ وَدَعَهُ\n أَوْ تَرَكَهُ النَّاسُ اتِّقَاءَ فُحْشِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 94,
        "matchingEnglishURN": 262680,
        "last_updated": null
    },
    {
        "arabicURN": 368000,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "22.00",
        "hadithNumber": "2591 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب مُدَارَاةِ مَنْ يُتَّقَى فُحْشُهُ ‏‏ ",
        "hadithText": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، كِلاَهُمَا عَنْ عَبْدِ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ،\n عَنِ ابْنِ الْمُنْكَدِرِ، فِي هَذَا الإِسْنَادِ ‏.‏ مِثْلَ مَعْنَاهُ غَيْرَ أَنَّهُ قَالَ ‏\"‏ بِئْسَ أَخُو الْقَوْمِ وَابْنُ الْعَشِيرَةِ\n ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 95,
        "matchingEnglishURN": 262690,
        "last_updated": null
    },
    {
        "arabicURN": 368010,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "23.00",
        "hadithNumber": "2592 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ الرِّفْقِ ‏‏ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، حَدَّثَنَا مَنْصُورٌ، عَنْ \n تَمِيمِ بْنِ سَلَمَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هِلاَلٍ، عَنْ جَرِيرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ\n ‏\"‏ مَنْ يُحْرَمِ الرِّفْقَ يُحْرَمِ الْخَيْرَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 96,
        "matchingEnglishURN": 262700,
        "last_updated": null
    },
    {
        "arabicURN": 368020,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "23.00",
        "hadithNumber": "2592 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ الرِّفْقِ ‏‏ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو سَعِيدٍ الأَشَجُّ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ\n قَالُوا حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ،\n حَدَّثَنَا حَفْصٌ، - يَعْنِي ابْنَ غِيَاثٍ - كُلُّهُمْ عَنِ الأَعْمَشِ، ح وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ،\n بْنُ إِبْرَاهِيمَ - وَاللَّفْظُ لَهُمَا - قَالَ زُهَيْرٌ حَدَّثَنَا وَقَالَ، إِسْحَاقُ أَخْبَرَنَا جَرِيرٌ، عَنِ الأَعْمَشِ،\n عَنْ تَمِيمِ بْنِ سَلَمَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هِلاَلٍ الْعَبْسِيِّ، قَالَ سَمِعْتُ جَرِيرًا، يَقُولُ سَمِعْتُ \n رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنْ يُحْرَمِ الرِّفْقَ يُحْرَمِ الْخَيْرَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 97,
        "matchingEnglishURN": 262710,
        "last_updated": null
    },
    {
        "arabicURN": 368030,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "23.00",
        "hadithNumber": "2592 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ الرِّفْقِ ‏‏ ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، عَنْ مُحَمَّدِ بْنِ أَبِي إِسْمَاعِيلَ،\n عَنْ عَبْدِ الرَّحْمَنِ بْنِ هِلاَلٍ، قَالَ سَمِعْتُ جَرِيرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله\n عليه وسلم ‏\"‏ مَنْ حُرِمَ الرِّفْقَ حُرِمَ الْخَيْرَ أَوْ مَنْ يُحْرَمِ الرِّفْقَ يُحْرَمِ الْخَيْرَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 98,
        "matchingEnglishURN": 262720,
        "last_updated": null
    },
    {
        "arabicURN": 368040,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "23.00",
        "hadithNumber": "2593",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ الرِّفْقِ ‏‏ ",
        "hadithText": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي حَيْوَةُ، حَدَّثَنِي \n ابْنُ الْهَادِ، عَنْ أَبِي بَكْرِ بْنِ حَزْمٍ، عَنْ عَمْرَةَ، - يَعْنِي بِنْتَ عَبْدِ الرَّحْمَنِ - عَنْ عَائِشَةَ، زَوْجِ\n النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ يَا عَائِشَةُ إِنَّ اللَّهَ\n رَفِيقٌ يُحِبُّ الرِّفْقَ وَيُعْطِي عَلَى الرِّفْقِ مَا لاَ يُعْطِي عَلَى الْعُنْفِ وَمَا لاَ يُعْطِي عَلَى مَا سِوَاهُ\n ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 99,
        "matchingEnglishURN": 262730,
        "last_updated": null
    },
    {
        "arabicURN": 368050,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "23.00",
        "hadithNumber": "2594 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ الرِّفْقِ ‏‏ ",
        "hadithText": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنِ الْمِقْدَامِ، - وَهُوَ\n ابْنُ شُرَيْحِ بْنِ هَانِئٍ - عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم عَنِ النَّبِيِّ\n صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ الرِّفْقَ لاَ يَكُونُ فِي شَىْءٍ إِلاَّ زَانَهُ وَلاَ يُنْزَعُ مِنْ شَىْءٍ إِلاَّ\n شَانَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 100,
        "matchingEnglishURN": 262740,
        "last_updated": null
    },
    {
        "arabicURN": 368060,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "23.00",
        "hadithNumber": "2594 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ الرِّفْقِ ‏‏ ",
        "hadithText": "حَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ،\n سَمِعْتُ الْمِقْدَامَ بْنَ شُرَيْحِ بْنِ هَانِئٍ، بِهَذَا الإِسْنَادِ وَزَادَ فِي الْحَدِيثِ رَكِبَتْ عَائِشَةُ بَعِيرًا\n فَكَانَتْ فِيهِ صُعُوبَةٌ فَجَعَلَتْ تُرَدِّدُهُ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ عَلَيْكِ بِالرِّفْقِ\n ‏\"‏ ‏.‏ ثُمَّ ذَكَرَ بِمِثْلِهِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 101,
        "matchingEnglishURN": 262750,
        "last_updated": null
    },
    {
        "arabicURN": 368070,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "24.00",
        "hadithNumber": "2595 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنْ لَعْنِ الدَّوَابِّ، وَغَيْرِهَا، ‏‏",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ عُلَيَّةَ، قَالَ زُهَيْرٌ\n حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمُهَلَّبِ، عَنْ عِمْرَانَ بْنِ،\n حُصَيْنٍ قَالَ بَيْنَمَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي بَعْضِ أَسْفَارِهِ وَامْرَأَةٌ مِنَ الأَنْصَارِ\n عَلَى نَاقَةٍ فَضَجِرَتْ فَلَعَنَتْهَا فَسَمِعَ ذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ خُذُوا\n مَا عَلَيْهَا وَدَعُوهَا فَإِنَّهَا مَلْعُونَةٌ ‏\"‏ ‏.‏ قَالَ عِمْرَانُ فَكَأَنِّي أَرَاهَا الآنَ تَمْشِي فِي النَّاسِ\n مَا يَعْرِضُ لَهَا أَحَدٌ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 102,
        "matchingEnglishURN": 262760,
        "last_updated": null
    },
    {
        "arabicURN": 368080,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "24.00",
        "hadithNumber": "2595 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنْ لَعْنِ الدَّوَابِّ، وَغَيْرِهَا، ‏‏",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو الرَّبِيعِ، قَالاَ حَدَّثَنَا حَمَّادٌ، وَهُوَ ابْنُ زَيْدٍ ح وَحَدَّثَنَا \n ابْنُ أَبِي عُمَرَ، حَدَّثَنَا الثَّقَفِيُّ، كِلاَهُمَا عَنْ أَيُّوبَ، بِإِسْنَادِ إِسْمَاعِيلَ ‏.‏ نَحْوَ حَدِيثِهِ إِلاَّ أَنَّ فِي\n حَدِيثِ حَمَّادٍ قَالَ عِمْرَانُ فَكَأَنِّي أَنْظُرُ إِلَيْهَا نَاقَةً وَرْقَاءَ وَفِي حَدِيثِ الثَّقَفِيِّ فَقَالَ ‏\"‏ خُذُوا\n مَا عَلَيْهَا وَأَعْرُوهَا فَإِنَّهَا مَلْعُونَةٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 103,
        "matchingEnglishURN": 262770,
        "last_updated": null
    },
    {
        "arabicURN": 368090,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "24.00",
        "hadithNumber": "2596 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنْ لَعْنِ الدَّوَابِّ، وَغَيْرِهَا، ‏‏",
        "hadithText": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، فُضَيْلُ بْنُ حُسَيْنٍ حَدَّثَنَا يَزِيدُ، - يَعْنِي ابْنَ زُرَيْعٍ -\n حَدَّثَنَا التَّيْمِيُّ، عَنْ أَبِي عُثْمَانَ، عَنْ أَبِي بَرْزَةَ الأَسْلَمِيِّ، قَالَ بَيْنَمَا جَارِيَةٌ عَلَى نَاقَةٍ عَلَيْهَا\n بَعْضُ مَتَاعِ الْقَوْمِ إِذْ بَصُرَتْ بِالنَّبِيِّ صلى الله عليه وسلم وَتَضَايَقَ بِهِمُ الْجَبَلُ فَقَالَتْ حَلْ\n اللَّهُمَّ الْعَنْهَا ‏.‏ قَالَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ تُصَاحِبُنَا نَاقَةٌ عَلَيْهَا لَعْنَةٌ ‏\"‏\n ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 104,
        "matchingEnglishURN": 262780,
        "last_updated": null
    },
    {
        "arabicURN": 368100,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "24.00",
        "hadithNumber": "2596 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنْ لَعْنِ الدَّوَابِّ، وَغَيْرِهَا، ‏‏",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا الْمُعْتَمِرُ، ح وَحَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا \n يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ - جَمِيعًا عَنْ سُلَيْمَانَ التَّيْمِيِّ، بِهَذَا الإِسْنَادِ وَزَادَ فِي حَدِيثِ الْمُعْتَمِرِ\n ‏\"‏ لاَ ايْمُ اللَّهِ لاَ تُصَاحِبُنَا رَاحِلَةٌ عَلَيْهَا لَعْنَةٌ مِنَ اللَّهِ ‏\"‏ ‏.‏ أَوْ كَمَا قَالَ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 105,
        "matchingEnglishURN": 262790,
        "last_updated": null
    },
    {
        "arabicURN": 368110,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "24.00",
        "hadithNumber": "2597 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنْ لَعْنِ الدَّوَابِّ، وَغَيْرِهَا، ‏‏",
        "hadithText": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي سُلَيْمَانُ، - وَهُوَ ابْنُ\n بِلاَلٍ - عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، حَدَّثَهُ عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى\n الله عليه وسلم قَالَ ‏\"‏ لاَ يَنْبَغِي لِصِدِّيقٍ أَنْ يَكُونَ لَعَّانًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 106,
        "matchingEnglishURN": 262801,
        "last_updated": null
    },
    {
        "arabicURN": 368120,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "24.00",
        "hadithNumber": "2597 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنْ لَعْنِ الدَّوَابِّ، وَغَيْرِهَا، ‏‏",
        "hadithText": "حَدَّثَنِيهِ أَبُو كُرَيْبٍ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ،\n الرَّحْمَنِ بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 107,
        "matchingEnglishURN": 262802,
        "last_updated": null
    },
    {
        "arabicURN": 368130,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "24.00",
        "hadithNumber": "2598 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنْ لَعْنِ الدَّوَابِّ، وَغَيْرِهَا، ‏‏",
        "hadithText": "حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنِي حَفْصُ بْنُ مَيْسَرَةَ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ عَبْدَ الْمَلِكِ،\n بْنَ مَرْوَانَ بَعَثَ إِلَى أُمِّ الدَّرْدَاءِ بِأَنْجَادٍ مِنْ عِنْدِهِ فَلَمَّا أَنْ كَانَ ذَاتَ لَيْلَةٍ قَامَ عَبْدُ الْمَلِكِ\n مِنَ اللَّيْلِ فَدَعَا خَادِمَهُ فَكَأَنَّهُ أَبْطَأَ عَلَيْهِ فَلَعَنَهُ فَلَمَّا أَصْبَحَ قَالَتْ لَهُ أُمُّ الدَّرْدَاءِ سَمِعْتُكَ\n اللَّيْلَةَ لَعَنْتَ خَادِمَكَ حِينَ دَعَوْتَهُ ‏.‏ فَقَالَتْ سَمِعْتُ أَبَا الدَّرْدَاءِ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم ‏\"‏ لاَ يَكُونُ اللَّعَّانُونَ شُفَعَاءَ وَلاَ شُهَدَاءَ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 108,
        "matchingEnglishURN": 262810,
        "last_updated": null
    },
    {
        "arabicURN": 368140,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "24.00",
        "hadithNumber": "2598 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنْ لَعْنِ الدَّوَابِّ، وَغَيْرِهَا، ‏‏",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو غَسَّانَ الْمِسْمَعِيُّ وَعَاصِمُ بْنُ النَّضْرِ التَّيْمِيُّ\n قَالُوا حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، كِلاَهُمَا\n عَنْ مَعْمَرٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، فِي هَذَا الإِسْنَادِ بِمِثْلِ مَعْنَى حَدِيثِ حَفْصِ بْنِ مَيْسَرَةَ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 109,
        "matchingEnglishURN": 262820,
        "last_updated": null
    },
    {
        "arabicURN": 368150,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "24.00",
        "hadithNumber": "2598 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنْ لَعْنِ الدَّوَابِّ، وَغَيْرِهَا، ‏‏",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، عَنْ هِشَامِ بْنِ سَعْدٍ، عَنْ \n زَيْدِ بْنِ أَسْلَمَ، وَأَبِي، حَازِمٍ عَنْ أُمِّ الدَّرْدَاءِ، عَنْ أَبِي الدَّرْدَاءِ، سَمِعْتُ رَسُولَ اللَّهِ صلى الله\n عليه وسلم يَقُولُ ‏\"‏ إِنَّ اللَّعَّانِينَ لاَ يَكُونُونَ شُهَدَاءَ وَلاَ شُفَعَاءَ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 110,
        "matchingEnglishURN": 262830,
        "last_updated": null
    },
    {
        "arabicURN": 368160,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "24.00",
        "hadithNumber": "2599",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنْ لَعْنِ الدَّوَابِّ، وَغَيْرِهَا، ‏‏",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، وَابْنُ أَبِي عُمَرَ، قَالاَ حَدَّثَنَا مَرْوَانُ، - يَعْنِيَانِ الْفَزَارِيَّ -\n عَنْ يَزِيدَ، - وَهُوَ ابْنُ كَيْسَانَ - عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قِيلَ يَا رَسُولَ اللَّهِ\n ادْعُ عَلَى الْمُشْرِكِينَ قَالَ ‏\"‏ إِنِّي لَمْ أُبْعَثْ لَعَّانًا وَإِنَّمَا بُعِثْتُ رَحْمَةً ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 111,
        "matchingEnglishURN": 262840,
        "last_updated": null
    },
    {
        "arabicURN": 368170,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "25.00",
        "hadithNumber": "2600 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب مَنْ لَعَنَهُ النَّبِيُّ صلى الله عليه وسلم أَوْ سَبَّهُ أَوْ دَعَا عَلَيْهِ",
        "hadithText": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ،\n عَنْ عَائِشَةَ، قَالَتْ دَخَلَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم رَجُلاَنِ فَكَلَّمَاهُ بِشَىْءٍ لاَ\n أَدْرِي مَا هُوَ فَأَغْضَبَاهُ فَلَعَنَهُمَا وَسَبَّهُمَا فَلَمَّا خَرَجَا قُلْتُ يَا رَسُولَ اللَّهِ مَنْ أَصَابَ مِنَ\n الْخَيْرِ شَيْئًا مَا أَصَابَهُ هَذَانِ قَالَ ‏\"‏ وَمَا ذَاكِ ‏\"‏ ‏.‏ قَالَتْ قُلْتُ لَعَنْتَهُمَا وَسَبَبْتَهُمَا قَالَ ‏\"‏\n أَوَمَا عَلِمْتِ مَا شَارَطْتُ عَلَيْهِ رَبِّي قُلْتُ اللَّهُمَّ إِنَّمَا أَنَا بَشَرٌ فَأَىُّ الْمُسْلِمِينَ لَعَنْتُهُ أَوْ سَبَبْتُهُ\n فَاجْعَلْهُ لَهُ زَكَاةً وَأَجْرًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 112,
        "matchingEnglishURN": 262850,
        "last_updated": null
    },
    {
        "arabicURN": 368180,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "25.00",
        "hadithNumber": "2600 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب مَنْ لَعَنَهُ النَّبِيُّ صلى الله عليه وسلم أَوْ سَبَّهُ أَوْ دَعَا عَلَيْهِ",
        "hadithText": "حَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَاهُ \n عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَلِيُّ بْنُ خَشْرَمٍ، جَمِيعًا عَنْ عِيسَى بْنِ يُونُسَ،\n كِلاَهُمَا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ‏.‏ نَحْوَ حَدِيثِ جَرِيرٍ وَقَالَ فِي حَدِيثِ عِيسَى فَخَلَوَا\n بِهِ فَسَبَّهُمَا وَلَعَنَهُمَا وَأَخْرَجَهُمَا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 113,
        "matchingEnglishURN": 262860,
        "last_updated": null
    },
    {
        "arabicURN": 368190,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "25.00",
        "hadithNumber": "2601 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب مَنْ لَعَنَهُ النَّبِيُّ صلى الله عليه وسلم أَوْ سَبَّهُ أَوْ دَعَا عَلَيْهِ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي صَالِحٍ،\n عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ إِنَّمَا أَنَا بَشَرٌ فَأَيُّمَا\n رَجُلٍ مِنَ الْمُسْلِمِينَ سَبَبْتُهُ أَوْ لَعَنْتُهُ أَوْ جَلَدْتُهُ فَاجْعَلْهَا لَهُ زَكَاةً وَرَحْمَةً ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 114,
        "matchingEnglishURN": 262870,
        "last_updated": null
    },
    {
        "arabicURN": 368200,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "25.00",
        "hadithNumber": "2602 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب مَنْ لَعَنَهُ النَّبِيُّ صلى الله عليه وسلم أَوْ سَبَّهُ أَوْ دَعَا عَلَيْهِ",
        "hadithText": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ\n صلى الله عليه وسلم مِثْلَهُ إِلاَّ أَنَّ فِيهِ ‏\"‏ زَكَاةً وَأَجْرًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 115,
        "matchingEnglishURN": 262880,
        "last_updated": null
    },
    {
        "arabicURN": 368210,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "25.00",
        "hadithNumber": "2602 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب مَنْ لَعَنَهُ النَّبِيُّ صلى الله عليه وسلم أَوْ سَبَّهُ أَوْ دَعَا عَلَيْهِ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا إِسْحَاقُ،\n بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، كِلاَهُمَا عَنِ الأَعْمَشِ، بِإِسْنَادِ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ ‏.‏\n مِثْلَ حَدِيثِهِ غَيْرَ أَنَّ فِي، حَدِيثِ عِيسَى جَعَلَ ‏\"‏ وَأَجْرًا ‏\"‏ ‏.‏ فِي حَدِيثِ أَبِي هُرَيْرَةَ وَجَعَلَ\n ‏\"‏ وَرَحْمَةً ‏\"‏ ‏.‏ فِي حَدِيثِ جَابِرٍ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 116,
        "matchingEnglishURN": 262890,
        "last_updated": null
    },
    {
        "arabicURN": 368220,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "25.00",
        "hadithNumber": "2601 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب مَنْ لَعَنَهُ النَّبِيُّ صلى الله عليه وسلم أَوْ سَبَّهُ أَوْ دَعَا عَلَيْهِ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُغِيرَةُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْحِزَامِيَّ - عَنْ \n أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ اللَّهُمَّ إِنِّي\n أَتَّخِذُ عِنْدَكَ عَهْدًا لَنْ تُخْلِفَنِيهِ فَإِنَّمَا أَنَا بَشَرٌ فَأَىُّ الْمُؤْمِنِينَ آذَيْتُهُ شَتَمْتُهُ لَعَنْتُهُ جَلَدْتُهُ فَاجْعَلْهَا\n لَهُ صَلاَةً وَزَكَاةً وَقُرْبَةً تُقَرِّبُهُ بِهَا إِلَيْكَ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 117,
        "matchingEnglishURN": 262900,
        "last_updated": null
    },
    {
        "arabicURN": 368230,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "25.00",
        "hadithNumber": "2601 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب مَنْ لَعَنَهُ النَّبِيُّ صلى الله عليه وسلم أَوْ سَبَّهُ أَوْ دَعَا عَلَيْهِ",
        "hadithText": "حَدَّثَنَاهُ ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا أَبُو الزِّنَادِ، بِهَذَا الإِسْنَادِ نَحْوَهُ إِلاَّ\n أَنَّهُ قَالَ ‏\"‏ أَوْ جَلَدُّهُ ‏\"‏ ‏.‏ قَالَ أَبُو الزِّنَادِ وَهِيَ لُغَةُ أَبِي هُرَيْرَةَ وَإِنَّمَا هِيَ ‏\"‏ جَلَدْتُهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 118,
        "matchingEnglishURN": 262910,
        "last_updated": null
    },
    {
        "arabicURN": 368240,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "25.00",
        "hadithNumber": "2601 d",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب مَنْ لَعَنَهُ النَّبِيُّ صلى الله عليه وسلم أَوْ سَبَّهُ أَوْ دَعَا عَلَيْهِ",
        "hadithText": "حَدَّثَنِي سُلَيْمَانُ بْنُ مَعْبَدٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ،\n عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِنَحْوِهِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 119,
        "matchingEnglishURN": 262920,
        "last_updated": null
    },
    {
        "arabicURN": 368250,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "25.00",
        "hadithNumber": "2601 e",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب مَنْ لَعَنَهُ النَّبِيُّ صلى الله عليه وسلم أَوْ سَبَّهُ أَوْ دَعَا عَلَيْهِ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ سَالِمٍ، مَوْلَى النَّصْرِيِّينَ\n قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ اللَّهُمَّ إِنَّمَا\n مُحَمَّدٌ بَشَرٌ يَغْضَبُ كَمَا يَغْضَبُ الْبَشَرُ وَإِنِّي قَدِ اتَّخَذْتُ عِنْدَكَ عَهْدًا لَنْ تُخْلِفَنِيهِ فَأَيُّمَا مُؤْمِنٍ\n آذَيْتُهُ أَوْ سَبَبْتُهُ أَوْ جَلَدْتُهُ فَاجْعَلْهَا لَهُ كَفَّارَةً وَقُرْبَةً تُقَرِّبُهُ بِهَا إِلَيْكَ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 120,
        "matchingEnglishURN": 262930,
        "last_updated": null
    },
    {
        "arabicURN": 368260,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "25.00",
        "hadithNumber": "2601 f",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب مَنْ لَعَنَهُ النَّبِيُّ صلى الله عليه وسلم أَوْ سَبَّهُ أَوْ دَعَا عَلَيْهِ",
        "hadithText": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي \n سَعِيدُ بْنُ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ اللَّهُمَّ\n فَأَيُّمَا عَبْدٍ مُؤْمِنٍ سَبَبْتُهُ فَاجْعَلْ ذَلِكَ لَهُ قُرْبَةً إِلَيْكَ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 121,
        "matchingEnglishURN": 262940,
        "last_updated": null
    },
    {
        "arabicURN": 368270,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "25.00",
        "hadithNumber": "2601 g",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب مَنْ لَعَنَهُ النَّبِيُّ صلى الله عليه وسلم أَوْ سَبَّهُ أَوْ دَعَا عَلَيْهِ",
        "hadithText": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ زُهَيْرٌ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ،\n حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ، عَنْ عَمِّهِ، حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ\n سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ اللَّهُمَّ إِنِّي اتَّخَذْتُ عِنْدَكَ عَهْدًا لَنْ تُخْلِفَنِيهِ\n فَأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ أَوْ جَلَدْتُهُ فَاجْعَلْ ذَلِكَ كَفَّارَةً لَهُ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 122,
        "matchingEnglishURN": 262950,
        "last_updated": null
    },
    {
        "arabicURN": 368300,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "25.00",
        "hadithNumber": "2603",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب مَنْ لَعَنَهُ النَّبِيُّ صلى الله عليه وسلم أَوْ سَبَّهُ أَوْ دَعَا عَلَيْهِ",
        "hadithText": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَأَبُو مَعْنٍ الرَّقَاشِيُّ - وَاللَّفْظُ لِزُهَيْرٍ - قَالاَ حَدَّثَنَا عُمَرُ،\n بْنُ يُونُسَ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، حَدَّثَنَا إِسْحَاقُ بْنُ أَبِي طَلْحَةَ، حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ،\n قَالَ كَانَتْ عِنْدَ أُمِّ سُلَيْمٍ يَتِيمَةٌ وَهِيَ أُمُّ أَنَسٍ فَرَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم الْيَتِيمَةَ\n فَقَالَ ‏\"‏ آنْتِ هِيَهْ لَقَدْ كَبِرْتِ لاَ كَبِرَ سِنُّكِ ‏\"‏ ‏.‏ فَرَجَعَتِ الْيَتِيمَةُ إِلَى أُمِّ سُلَيْمٍ تَبْكِي فَقَالَتْ\n أُمُّ سُلَيْمٍ مَا لَكِ يَا بُنَيَّةُ قَالَتِ الْجَارِيَةُ دَعَا عَلَىَّ نَبِيُّ اللَّهِ صلى الله عليه وسلم أَنْ لاَ يَكْبَرَ\n سِنِّي فَالآنَ لاَ يَكْبَرُ سِنِّي أَبَدًا - أَوْ قَالَتْ قَرْنِي - فَخَرَجَتْ أُمُّ سُلَيْمٍ مُسْتَعْجِلَةً تَلُوثُ خِمَارَهَا\n حَتَّى لَقِيَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم\n ‏\"‏ مَا لَكِ يَا أُمَّ سُلَيْمٍ ‏\"‏ ‏.‏ فَقَالَتْ يَا نَبِيَّ اللَّهِ أَدَعَوْتَ عَلَى يَتِيمَتِي قَالَ ‏\"‏ وَمَا ذَاكِ يَا أُمَّ\n سُلَيْمٍ ‏\"‏ ‏.‏ قَالَتْ زَعَمَتْ أَنَّكَ دَعَوْتَ أَنْ لاَ يَكْبَرَ سِنُّهَا وَلاَ يَكْبَرَ قَرْنُهَا - قَالَ - فَضَحِكَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ يَا أُمَّ سُلَيْمٍ أَمَا تَعْلَمِينَ أَنَّ شَرْطِي عَلَى رَبِّي\n أَنِّي اشْتَرَطْتُ عَلَى رَبِّي فَقُلْتُ إِنَّمَا أَنَا بَشَرٌ أَرْضَى كَمَا يَرْضَى الْبَشَرُ وَأَغْضَبُ كَمَا يَغْضَبُ\n الْبَشَرُ فَأَيُّمَا أَحَدٍ دَعَوْتُ عَلَيْهِ مِنْ أُمَّتِي بِدَعْوَةٍ لَيْسَ لَهَا بِأَهْلٍ أَنْ تَجْعَلَهَا لَهُ طَهُورًا وَزَكَاةً\n وَقُرْبَةً يُقَرِّبُهُ بِهَا مِنْهُ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ وَقَالَ أَبُو مَعْنٍ يُتَيِّمَةٌ ‏.‏ بِالتَّصْغِيرِ فِي الْمَوَاضِعِ الثَّلاَثَةِ\n مِنَ الْحَدِيثِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 124,
        "matchingEnglishURN": 262970,
        "last_updated": null
    },
    {
        "arabicURN": 368310,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "25.00",
        "hadithNumber": "2604 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب مَنْ لَعَنَهُ النَّبِيُّ صلى الله عليه وسلم أَوْ سَبَّهُ أَوْ دَعَا عَلَيْهِ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، ح وَحَدَّثَنَا ابْنُ بَشَّارٍ، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى -\n قَالاَ حَدَّثَنَا أُمَيَّةُ بْنُ خَالِدٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي حَمْزَةَ الْقَصَّابِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كُنْتُ\n أَلْعَبُ مَعَ الصِّبْيَانِ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَتَوَارَيْتُ خَلْفَ بَابٍ - قَالَ -\n فَجَاءَ فَحَطَأَنِي حَطْأَةً وَقَالَ ‏\"‏ اذْهَبْ وَادْعُ لِي مُعَاوِيَةَ ‏\"‏ ‏.‏ قَالَ فَجِئْتُ فَقُلْتُ هُوَ يَأْكُلُ\n - قَالَ - ثُمَّ قَالَ لِيَ ‏\"‏ اذْهَبْ وَادْعُ لِي مُعَاوِيَةَ ‏\"‏ ‏.‏ قَالَ فَجِئْتُ فَقُلْتُ هُوَ يَأْكُلُ فَقَالَ ‏\"‏\n لاَ أَشْبَعَ اللَّهُ بَطْنَهُ ‏\"‏ ‏.‏ قَالَ ابْنُ الْمُثَنَّى قُلْتُ لأُمَيَّةَ مَا حَطَأَنِي قَالَ قَفَدَنِي قَفْدَةً ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 125,
        "matchingEnglishURN": 262980,
        "last_updated": null
    },
    {
        "arabicURN": 368320,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "25.00",
        "hadithNumber": "2604 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب مَنْ لَعَنَهُ النَّبِيُّ صلى الله عليه وسلم أَوْ سَبَّهُ أَوْ دَعَا عَلَيْهِ",
        "hadithText": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنَا أَبُو\n حَمْزَةَ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ كُنْتُ أَلْعَبُ مَعَ الصِّبْيَانِ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم فَاخْتَبَأْتُ مِنْهُ ‏.‏ فَذَكَرَ بِمِثْلِهِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 126,
        "matchingEnglishURN": 262990,
        "last_updated": null
    },
    {
        "arabicURN": 368330,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "26.00",
        "hadithNumber": "2526 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب ذَمِّ ذِي الْوَجْهَيْنِ وَتَحْرِيمِ فِعْلِهِ ‏‏ ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ \n أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ مِنْ شَرِّ النَّاسِ ذَا الْوَجْهَيْنِ\n الَّذِي يَأْتِي هَؤُلاَءِ بِوَجْهٍ وَهَؤُلاَءِ بِوَجْهٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 127,
        "matchingEnglishURN": 263000,
        "last_updated": null
    },
    {
        "arabicURN": 368340,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "26.00",
        "hadithNumber": "2526 d",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب ذَمِّ ذِي الْوَجْهَيْنِ وَتَحْرِيمِ فِعْلِهِ ‏‏ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ \n يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله\n عليه وسلم يَقُولُ ‏\"‏ إِنَّ شَرَّ النَّاسِ ذُو الْوَجْهَيْنِ الَّذِي يَأْتِي هَؤُلاَءِ بِوَجْهٍ وَهَؤُلاَءِ بِوَجْهٍ\n ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 128,
        "matchingEnglishURN": 263010,
        "last_updated": null
    },
    {
        "arabicURN": 368370,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "27.00",
        "hadithNumber": "2605 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الْكَذِبِ وَبَيَانِ مَا يُبَاحُ مِنْهُ ‏‏ ",
        "hadithText": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي \n حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ أُمَّهُ أُمَّ كُلْثُومٍ بِنْتَ عُقْبَةَ بْنِ أَبِي مُعَيْطٍ، وَكَانَتْ، مِنَ الْمُهَاجِرَاتِ\n الأُوَلِ اللاَّتِي بَايَعْنَ النَّبِيَّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صلى الله\n عليه وسلم وَهُوَ يَقُولُ ‏\"‏ لَيْسَ الْكَذَّابُ الَّذِي يُصْلِحُ بَيْنَ النَّاسِ وَيَقُولُ خَيْرًا وَيَنْمِي خَيْرًا\n ‏\"‏ ‏.‏ قَالَ ابْنُ شِهَابٍ وَلَمْ أَسْمَعْ يُرَخَّصُ فِي شَىْءٍ مِمَّا يَقُولُ النَّاسُ كَذِبٌ إِلاَّ فِي ثَلاَثٍ\n الْحَرْبُ وَالإِصْلاَحُ بَيْنَ النَّاسِ وَحَدِيثُ الرَّجُلِ امْرَأَتَهُ وَحَدِيثُ الْمَرْأَةِ زَوْجَهَا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 130,
        "matchingEnglishURN": 263030,
        "last_updated": null
    },
    {
        "arabicURN": 368380,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "27.00",
        "hadithNumber": "2605 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الْكَذِبِ وَبَيَانِ مَا يُبَاحُ مِنْهُ ‏‏ ",
        "hadithText": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ،\n حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمِ بْنِ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ شِهَابٍ، بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ غَيْرَ أَنَّفِي حَدِيثِ صَالِحٍ وَقَالَتْ وَلَمْ أَسْمَعْهُ يُرَخِّصُ فِي شَىْءٍ مِمَّا يَقُولُ النَّاسُ إِلاَّ فِي ثَلاَثٍ\n ‏.‏ بِمِثْلِ مَا جَعَلَهُ يُونُسُ مِنْ قَوْلِ ابْنِ شِهَابٍ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 131,
        "matchingEnglishURN": 263040,
        "last_updated": null
    },
    {
        "arabicURN": 368390,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "27.00",
        "hadithNumber": "2605 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الْكَذِبِ وَبَيَانِ مَا يُبَاحُ مِنْهُ ‏‏ ",
        "hadithText": "وَحَدَّثَنَاهُ عَمْرٌو النَّاقِدُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ،\n بِهَذَا الإِسْنَادِ إِلَى قَوْلِهِ ‏\"‏ وَنَمَى خَيْرًا ‏\"‏ ‏.‏ وَلَمْ يَذْكُرْ مَا بَعْدَهُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 132,
        "matchingEnglishURN": 263050,
        "last_updated": null
    },
    {
        "arabicURN": 368400,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "28.00",
        "hadithNumber": "2606",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ النَّمِيمَةِ ‏‏ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، سَمِعْتُ \n أَبَا إِسْحَاقَ، يُحَدِّثُ عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ إِنَّ مُحَمَّدًا صلى الله\n عليه وسلم قَالَ ‏\"‏ أَلاَ أُنَبِّئُكُمْ مَا الْعَضْهُ هِيَ النَّمِيمَةُ الْقَالَةُ بَيْنَ النَّاسِ ‏\"‏ ‏.‏ وَإِنَّ مُحَمَّدًا صلى\n الله عليه وسلم قَالَ ‏\"‏ إِنَّ الرَّجُلَ يَصْدُقُ حَتَّى يُكْتَبَ صِدِّيقًا وَيَكْذِبُ حَتَّى يُكْتَبَ كَذَّابًا ‏\"‏\n ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 133,
        "matchingEnglishURN": 263060,
        "last_updated": null
    },
    {
        "arabicURN": 368410,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "29.00",
        "hadithNumber": "2607 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب قُبْحِ الْكَذِبِ وَحُسْنِ الصِّدْقِ وَفَضْلِهِ ‏‏ ",
        "hadithText": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ\n أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ الصِّدْقَ يَهْدِي إِلَى الْبِرِّ وَإِنَّ الْبِرَّ يَهْدِي إِلَى الْجَنَّةِ وَإِنَّ الرَّجُلَ\n لَيَصْدُقُ حَتَّى يُكْتَبَ صِدِّيقًا وَإِنَّ الْكَذِبَ يَهْدِي إِلَى الْفُجُورِ وَإِنَّ الْفُجُورَ يَهْدِي إِلَى النَّارِ وَإِنَّ\n الرَّجُلَ لَيَكْذِبُ حَتَّى يُكْتَبَ كَذَّابًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 134,
        "matchingEnglishURN": 263070,
        "last_updated": null
    },
    {
        "arabicURN": 368420,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "29.00",
        "hadithNumber": "2607 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب قُبْحِ الْكَذِبِ وَحُسْنِ الصِّدْقِ وَفَضْلِهِ ‏‏ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَهَنَّادُ بْنُ السَّرِيِّ، قَالاَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ \n مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n ‏\"‏ إِنَّ الصِّدْقَ بِرٌّ وَإِنَّ الْبِرَّ يَهْدِي إِلَى الْجَنَّةِ وَإِنَّ الْعَبْدَ لَيَتَحَرَّى الصِّدْقَ حَتَّى يُكْتَبَ عِنْدَ اللَّهِ\n صِدِّيقًا وَإِنَّ الْكَذِبَ فُجُورٌ وَإِنَّ الْفُجُورَ يَهْدِي إِلَى النَّارِ وَإِنَّ الْعَبْدَ لَيَتَحَرَّى الْكَذِبَ حَتَّى يُكْتَبَ\n كَذَّابًا ‏\"‏ ‏.‏ قَالَ ابْنُ أَبِي شَيْبَةَ فِي رِوَايَتِهِ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 135,
        "matchingEnglishURN": 263080,
        "last_updated": null
    },
    {
        "arabicURN": 368430,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "29.00",
        "hadithNumber": "2607 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب قُبْحِ الْكَذِبِ وَحُسْنِ الصِّدْقِ وَفَضْلِهِ ‏‏ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَوَكِيعٌ، قَالاَ حَدَّثَنَا الأَعْمَشُ،\n ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ عَلَيْكُمْ بِالصِّدْقِ فَإِنَّ الصِّدْقَ يَهْدِي إِلَى الْبِرِّ وَإِنَّ الْبِرَّ\n يَهْدِي إِلَى الْجَنَّةِ وَمَا يَزَالُ الرَّجُلُ يَصْدُقُ وَيَتَحَرَّى الصِّدْقَ حَتَّى يُكْتَبَ عِنْدَ اللَّهِ صِدِّيقًا وَإِيَّاكُمْ\n وَالْكَذِبَ فَإِنَّ الْكَذِبَ يَهْدِي إِلَى الْفُجُورِ وَإِنَّ الْفُجُورَ يَهْدِي إِلَى النَّارِ وَمَا يَزَالُ الرَّجُلُ يَكْذِبُ\n وَيَتَحَرَّى الْكَذِبَ حَتَّى يُكْتَبَ عِنْدَ اللَّهِ كَذَّابًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 136,
        "matchingEnglishURN": 263090,
        "last_updated": null
    },
    {
        "arabicURN": 368440,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "29.00",
        "hadithNumber": "2607 d",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب قُبْحِ الْكَذِبِ وَحُسْنِ الصِّدْقِ وَفَضْلِهِ ‏‏ ",
        "hadithText": "حَدَّثَنَا مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ، أَخْبَرَنَا ابْنُ مُسْهِرٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ،\n إِبْرَاهِيمَ الْحَنْظَلِيُّ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، كِلاَهُمَا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ‏.‏ وَلَمْ يَذْكُرْ\n فِي حَدِيثِ عِيسَى ‏\"‏ وَيَتَحَرَّى الصِّدْقَ وَيَتَحَرَّى الْكَذِبَ ‏\"‏ ‏.‏ وَفِي حَدِيثِ ابْنِ مُسْهِرٍ ‏\"‏ حَتَّى\n يَكْتُبَهُ اللَّهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 137,
        "matchingEnglishURN": 263100,
        "last_updated": null
    },
    {
        "arabicURN": 368450,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "30.00",
        "hadithNumber": "2608 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ مَنْ يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ وَبِأَىِّ شَىْءٍ يَذْهَبُ الْغَضَبُ ‏‏ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، - وَاللَّفْظُ لِقُتَيْبَةَ - قَالاَ حَدَّثَنَا جَرِيرٌ،\n عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ قَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا تَعُدُّونَ الرَّقُوبَ فِيكُمْ ‏\"‏ ‏.‏ قَالَ قُلْنَا الَّذِي لاَ يُولَدُ\n لَهُ ‏.‏ قَالَ ‏\"‏ لَيْسَ ذَاكَ بِالرَّقُوبِ وَلَكِنَّهُ الرَّجُلُ الَّذِي لَمْ يُقَدِّمْ مِنْ وَلَدِهِ شَيْئًا ‏\"‏ ‏.‏ قَالَ ‏\"‏ فَمَا\n تَعُدُّونَ الصُّرَعَةَ فِيكُمْ ‏\"‏ ‏.‏ قَالَ قُلْنَا الَّذِي لاَ يَصْرَعُهُ الرِّجَالُ ‏.‏ قَالَ ‏\"‏ لَيْسَ بِذَلِكَ وَلَكِنَّهُ\n الَّذِي يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 138,
        "matchingEnglishURN": 263110,
        "last_updated": null
    },
    {
        "arabicURN": 368460,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "30.00",
        "hadithNumber": "2608 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ مَنْ يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ وَبِأَىِّ شَىْءٍ يَذْهَبُ الْغَضَبُ ‏‏ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا إِسْحَاقُ،\n بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، كِلاَهُمَا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ مِثْلَ مَعْنَاهُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 139,
        "matchingEnglishURN": 263120,
        "last_updated": null
    },
    {
        "arabicURN": 368470,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "30.00",
        "hadithNumber": "2609 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ مَنْ يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ وَبِأَىِّ شَىْءٍ يَذْهَبُ الْغَضَبُ ‏‏ ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَعَبْدُ الأَعْلَى بْنُ حَمَّادٍ، قَالاَ كِلاَهُمَا قَرَأْتُ عَلَى مَالِكٍ\n عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم\n قَالَ ‏\"‏ لَيْسَ الشَّدِيدُ بِالصُّرَعَةِ إِنَّمَا الشَّدِيدُ الَّذِي يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 140,
        "matchingEnglishURN": 263130,
        "last_updated": null
    },
    {
        "arabicURN": 368480,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "30.00",
        "hadithNumber": "2609 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ مَنْ يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ وَبِأَىِّ شَىْءٍ يَذْهَبُ الْغَضَبُ ‏‏ ",
        "hadithText": "حَدَّثَنَا حَاجِبُ بْنُ الْوَلِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي \n حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ\n ‏\"‏ لَيْسَ الشَّدِيدُ بِالصُّرَعَةِ ‏\"‏ ‏.‏ قَالُوا فَالشَّدِيدُ أَيُّمَ هُوَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الَّذِي يَمْلِكُ نَفْسَهُ\n عِنْدَ الْغَضَبِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 141,
        "matchingEnglishURN": 263140,
        "last_updated": null
    },
    {
        "arabicURN": 368490,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "30.00",
        "hadithNumber": "2609 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ مَنْ يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ وَبِأَىِّ شَىْءٍ يَذْهَبُ الْغَضَبُ ‏‏ ",
        "hadithText": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ،\n ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ بَهْرَامَ، أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، كِلاَهُمَا\n عَنِ الزُّهْرِيِّ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه\n وسلم بِمِثْلِهِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 142,
        "matchingEnglishURN": 263150,
        "last_updated": null
    },
    {
        "arabicURN": 368500,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "30.00",
        "hadithNumber": "2610 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ مَنْ يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ وَبِأَىِّ شَىْءٍ يَذْهَبُ الْغَضَبُ ‏‏ ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَمُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ ابْنُ الْعَلاَءِ،\n حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ سُلَيْمَانَ بْنِ صُرَدٍ، قَالَ اسْتَبَّ رَجُلاَنِ\n عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَجَعَلَ أَحَدُهُمَا تَحْمَرُّ عَيْنَاهُ وَتَنْتَفِخُ أَوْدَاجُهُ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنِّي لأَعْرِفُ كَلِمَةً لَوْ قَالَهَا لَذَهَبَ عَنْهُ الَّذِي يَجِدُ أَعُوذُ بِاللَّهِ\n مِنَ الشَّيْطَانِ الرَّجِيمِ ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ وَهَلْ تَرَى بِي مِنْ جُنُونٍ قَالَ ابْنُ الْعَلاَءِ فَقَالَ وَهَلْ\n تَرَى ‏.‏ وَلَمْ يَذْكُرِ الرَّجُلَ",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 143,
        "matchingEnglishURN": 263160,
        "last_updated": null
    },
    {
        "arabicURN": 368510,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "30.00",
        "hadithNumber": "2610 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ مَنْ يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ وَبِأَىِّ شَىْءٍ يَذْهَبُ الْغَضَبُ ‏‏ ",
        "hadithText": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا أَبُو أُسَامَةَ، سَمِعْتُ الأَعْمَشَ، يَقُولُ سَمِعْتُ \n عَدِيَّ بْنَ ثَابِتٍ، يَقُولُ حَدَّثَنَا سُلَيْمَانُ بْنُ صُرَدٍ، قَالَ اسْتَبَّ رَجُلاَنِ عِنْدَ النَّبِيِّ صلى الله عليه\n وسلم فَجَعَلَ أَحَدُهُمَا يَغْضَبُ وَيَحْمَرُّ وَجْهُهُ فَنَظَرَ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم فَقَالَ\n ‏\"‏ إِنِّي لأَعْلَمُ كَلِمَةً لَوْ قَالَهَا لَذَهَبَ ذَا عَنْهُ أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ ‏\"‏ ‏.‏ فَقَامَ إِلَى\n الرَّجُلِ رَجُلٌ مِمَّنْ سَمِعَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ أَتَدْرِي مَا قَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم آنِفًا قَالَ ‏\"‏ إِنِّي لأَعْلَمُ كَلِمَةً لَوْ قَالَهَا لَذَهَبَ ذَا عَنْهُ أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ\n الرَّجِيمِ ‏\"‏ ‏.‏ فَقَالَ لَهُ الرَّجُلُ أَمَجْنُونًا تَرَانِي",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 144,
        "matchingEnglishURN": 263170,
        "last_updated": null
    },
    {
        "arabicURN": 368520,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "30.00",
        "hadithNumber": "2610 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ مَنْ يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ وَبِأَىِّ شَىْءٍ يَذْهَبُ الْغَضَبُ ‏‏ ",
        "hadithText": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ\n ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 145,
        "matchingEnglishURN": 263180,
        "last_updated": null
    },
    {
        "arabicURN": 368530,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "31.00",
        "hadithNumber": "2611 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب خُلِقَ الإِنْسَانُ خَلْقًا لاَ يَتَمَالَكُ ‏‏ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ \n ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لَمَّا صَوَّرَ اللَّهُ آدَمَ فِي الْجَنَّةِ\n تَرَكَهُ مَا شَاءَ اللَّهُ أَنْ يَتْرُكَهُ فَجَعَلَ إِبْلِيسُ يُطِيفُ بِهِ يَنْظُرُ مَا هُوَ فَلَمَّا رَآهُ أَجْوَفَ عَرَفَ\n أَنَّهُ خُلِقَ خَلْقًا لاَ يَتَمَالَكُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 146,
        "matchingEnglishURN": 263190,
        "last_updated": null
    },
    {
        "arabicURN": 368540,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "31.00",
        "hadithNumber": "2611 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب خُلِقَ الإِنْسَانُ خَلْقًا لاَ يَتَمَالَكُ ‏‏ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ نَافِعٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادٌ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 147,
        "matchingEnglishURN": 263200,
        "last_updated": null
    },
    {
        "arabicURN": 368550,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "32.00",
        "hadithNumber": "2612 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنْ ضَرْبِ الْوَجْهِ، ‏‏",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا الْمُغِيرَةُ، - يَعْنِي الْحِزَامِيَّ - عَنِ أَبِي،\n الزِّنَادِ عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا قَاتَلَ\n أَحَدُكُمْ أَخَاهُ فَلْيَجْتَنِبِ الْوَجْهَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 148,
        "matchingEnglishURN": 263210,
        "last_updated": null
    },
    {
        "arabicURN": 368560,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "32.00",
        "hadithNumber": "2612 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنْ ضَرْبِ الْوَجْهِ، ‏‏",
        "hadithText": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي الزِّنَادِ،\n بِهَذَا الإِسْنَادِ وَقَالَ ‏\"‏ إِذَا ضَرَبَ أَحَدُكُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 149,
        "matchingEnglishURN": 263220,
        "last_updated": null
    },
    {
        "arabicURN": 368570,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "32.00",
        "hadithNumber": "2612 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنْ ضَرْبِ الْوَجْهِ، ‏‏",
        "hadithText": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ،\n عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا قَاتَلَ أَحَدُكُمْ أَخَاهُ فَلْيَتَّقِ الْوَجْهَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 150,
        "matchingEnglishURN": 263230,
        "last_updated": null
    },
    {
        "arabicURN": 368580,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "32.00",
        "hadithNumber": "2612 d",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنْ ضَرْبِ الْوَجْهِ، ‏‏",
        "hadithText": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، سَمِعَ أَبَا،\n أَيُّوبَ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا قَاتَلَ أَحَدُكُمْ\n أَخَاهُ فَلاَ يَلْطِمَنَّ الْوَجْهَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 151,
        "matchingEnglishURN": 263240,
        "last_updated": null
    },
    {
        "arabicURN": 368590,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "32.00",
        "hadithNumber": "2612 e",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنْ ضَرْبِ الْوَجْهِ، ‏‏",
        "hadithText": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنِي أَبِي، حَدَّثَنَا الْمُثَنَّى، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ،\n حَاتِمٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنِ الْمُثَنَّى بْنِ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَبِي أَيُّوبَ، عَنْ \n أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَفِي حَدِيثِ ابْنِ حَاتِمٍ عَنِ النَّبِيِّ\n صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا قَاتَلَ أَحَدُكُمْ أَخَاهُ فَلْيَجْتَنِبِ الْوَجْهَ فَإِنَّ اللَّهَ خَلَقَ آدَمَ\n عَلَى صُورَتِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 152,
        "matchingEnglishURN": 263250,
        "last_updated": null
    },
    {
        "arabicURN": 368600,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "32.00",
        "hadithNumber": "2612 f",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنْ ضَرْبِ الْوَجْهِ، ‏‏",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي عَبْدُ الصَّمَدِ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ يَحْيَى،\n بْنِ مَالِكٍ الْمَرَاغِيِّ - وَهُوَ أَبُو أَيُّوبَ - عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم\n قَالَ ‏\"‏ إِذَا قَاتَلَ أَحَدُكُمْ أَخَاهُ فَلْيَجْتَنِبِ الْوَجْهَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 153,
        "matchingEnglishURN": 263260,
        "last_updated": null
    },
    {
        "arabicURN": 368610,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "33.00",
        "hadithNumber": "2613 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب الْوَعِيدِ الشَّدِيدِ لِمَنْ عَذَّبَ النَّاسَ بِغَيْرِ حَقٍّ ‏‏ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ \n أَبِيهِ، عَنْ هِشَامِ بْنِ حَكِيمِ بْنِ حِزَامٍ، قَالَ مَرَّ بِالشَّامِ عَلَى أُنَاسٍ وَقَدْ أُقِيمُوا فِي الشَّمْسِ\n وَصُبَّ عَلَى رُءُوسِهِمُ الزَّيْتُ فَقَالَ مَا هَذَا قِيلَ يُعَذَّبُونَ فِي الْخَرَاجِ ‏.‏ فَقَالَ أَمَا إِنِّي سَمِعْتُ\n رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنَّ اللَّهَ يُعَذِّبُ الَّذِينَ يُعَذِّبُونَ فِي الدُّنْيَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 154,
        "matchingEnglishURN": 263270,
        "last_updated": null
    },
    {
        "arabicURN": 368620,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "33.00",
        "hadithNumber": "2613 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب الْوَعِيدِ الشَّدِيدِ لِمَنْ عَذَّبَ النَّاسَ بِغَيْرِ حَقٍّ ‏‏ ",
        "hadithText": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، قَالَ مَرَّ هِشَامُ بْنُ حَكِيمِ\n بْنِ حِزَامٍ عَلَى أُنَاسٍ مِنَ الأَنْبَاطِ بِالشَّامِ قَدْ أُقِيمُوا فِي الشَّمْسِ فَقَالَ مَا شَأْنُهُمْ قَالُوا\n حُبِسُوا فِي الْجِزْيَةِ ‏.‏ فَقَالَ هِشَامٌ أَشْهَدُ لَسَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ\n ‏\"‏ إِنَّ اللَّهَ يُعَذِّبُ الَّذِينَ يُعَذِّبُونَ النَّاسَ فِي الدُّنْيَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 155,
        "matchingEnglishURN": 263280,
        "last_updated": null
    },
    {
        "arabicURN": 368630,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "33.00",
        "hadithNumber": "2613 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب الْوَعِيدِ الشَّدِيدِ لِمَنْ عَذَّبَ النَّاسَ بِغَيْرِ حَقٍّ ‏‏ ",
        "hadithText": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، وَأَبُو مُعَاوِيَةَ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا \n جَرِيرٌ، كُلُّهُمْ عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ وَزَادَ فِي حَدِيثِ جَرِيرٍ قَالَ وَأَمِيرُهُمْ يَوْمَئِذٍ عُمَيْرُ بْنُ\n سَعْدٍ عَلَى فِلَسْطِينَ فَدَخَلَ عَلَيْهِ فَحَدَّثَهُ فَأَمَرَ بِهِمْ فَخُلُّوا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 156,
        "matchingEnglishURN": 263290,
        "last_updated": null
    },
    {
        "arabicURN": 368640,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "33.00",
        "hadithNumber": "2613 d",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب الْوَعِيدِ الشَّدِيدِ لِمَنْ عَذَّبَ النَّاسَ بِغَيْرِ حَقٍّ ‏‏ ",
        "hadithText": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ،\n بْنِ الزُّبَيْرِ أَنَّ هِشَامَ بْنَ حَكِيمٍ، وَجَدَ رَجُلاً وَهُوَ عَلَى حِمْصَ يُشَمِّسُ نَاسًا مِنَ النَّبَطِ فِي\n أَدَاءِ الْجِزْيَةِ فَقَالَ مَا هَذَا إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنَّ اللَّهَ\n يُعَذِّبُ الَّذِينَ يُعَذِّبُونَ النَّاسَ فِي الدُّنْيَا ‏\"‏ ‏.‏ \n</bdo>",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 157,
        "matchingEnglishURN": 263300,
        "last_updated": null
    },
    {
        "arabicURN": 368650,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "34.00",
        "hadithNumber": "2614 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب أَمْرِ مَنْ مَرَّ بِسِلاَحٍ فِي مَسْجِدٍ أَوْ سُوقٍ أَوْ غَيْرِهِمَا مِنَ الْمَوَاضِعِ الْجَامِعَةِ لِ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ،\n أَبُو بَكْرٍ حَدَّثَنَا - سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، سَمِعَ جَابِرًا، يَقُولُ مَرَّ رَجُلٌ فِي الْمَسْجِدِ\n بِسِهَامٍ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمْسِكْ بِنِصَالِهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 158,
        "matchingEnglishURN": 263310,
        "last_updated": null
    },
    {
        "arabicURN": 368660,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "34.00",
        "hadithNumber": "2614 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب أَمْرِ مَنْ مَرَّ بِسِلاَحٍ فِي مَسْجِدٍ أَوْ سُوقٍ أَوْ غَيْرِهِمَا مِنَ الْمَوَاضِعِ الْجَامِعَةِ لِ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو الرَّبِيعِ، قَالَ أَبُو الرَّبِيعِ حَدَّثَنَا وَقَالَ، يَحْيَى - وَاللَّفْظُ\n لَهُ - أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَجُلاً، مَرَّ بِأَسْهُمٍ\n فِي الْمَسْجِدِ قَدْ أَبْدَى نُصُولَهَا فَأُمِرَ أَنْ يَأْخُذَ بِنُصُولِهَا كَىْ لاَ يَخْدِشَ مُسْلِمًا ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 159,
        "matchingEnglishURN": 263320,
        "last_updated": null
    },
    {
        "arabicURN": 368670,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "34.00",
        "hadithNumber": "2614 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب أَمْرِ مَنْ مَرَّ بِسِلاَحٍ فِي مَسْجِدٍ أَوْ سُوقٍ أَوْ غَيْرِهِمَا مِنَ الْمَوَاضِعِ الْجَامِعَةِ لِ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ \n أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ أَمَرَ رَجُلاً كَانَ يَتَصَدَّقُ بِالنَّبْلِ\n فِي الْمَسْجِدِ أَنْ لاَ يَمُرَّ بِهَا إِلاَّ وَهُوَ آخِذٌ بِنُصُولِهَا ‏.‏ وَقَالَ ابْنُ رُمْحٍ كَانَ يَصَّدَّقُ بِالنَّبْلِ\n ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 160,
        "matchingEnglishURN": 263330,
        "last_updated": null
    },
    {
        "arabicURN": 368680,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "34.00",
        "hadithNumber": "2615 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب أَمْرِ مَنْ مَرَّ بِسِلاَحٍ فِي مَسْجِدٍ أَوْ سُوقٍ أَوْ غَيْرِهِمَا مِنَ الْمَوَاضِعِ الْجَامِعَةِ لِ",
        "hadithText": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي،\n مُوسَى أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا مَرَّ أَحَدُكُمْ فِي مَجْلِسٍ أَوْ سُوقٍ وَبِيَدِهِ\n نَبْلٌ فَلْيَأْخُذْ بِنِصَالِهَا ثُمَّ لْيَأْخُذْ بِنِصَالِهَا ثُمَّ لْيَأْخُذْ بِنِصَالِهَا ‏\"‏ ‏.‏ قَالَ فَقَالَ أَبُو مُوسَى وَاللَّهِ\n مَا مُتْنَا حَتَّى سَدَّدْنَاهَا بَعْضُنَا فِي وُجُوهِ بَعْضٍ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 161,
        "matchingEnglishURN": 263340,
        "last_updated": null
    },
    {
        "arabicURN": 368690,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "34.00",
        "hadithNumber": "2615 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب أَمْرِ مَنْ مَرَّ بِسِلاَحٍ فِي مَسْجِدٍ أَوْ سُوقٍ أَوْ غَيْرِهِمَا مِنَ الْمَوَاضِعِ الْجَامِعَةِ لِ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَرَّادٍ الأَشْعَرِيُّ، وَمُحَمَّدُ بْنُ الْعَلاَءِ، - وَاللَّفْظُ لِعَبْدِ اللَّهِ - قَالاَ\n حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم\n قَالَ ‏\"‏ إِذَا مَرَّ أَحَدُكُمْ فِي مَسْجِدِنَا أَوْ فِي سُوقِنَا وَمَعَهُ نَبْلٌ فَلْيُمْسِكْ عَلَى نِصَالِهَا بِكَفِّهِ\n أَنْ يُصِيبَ أَحَدًا مِنَ الْمُسْلِمِينَ مِنْهَا بِشَىْءٍ ‏\"‏ ‏.‏ أَوْ قَالَ ‏\"‏ لِيَقْبِضْ عَلَى نِصَالِهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 162,
        "matchingEnglishURN": 263350,
        "last_updated": null
    },
    {
        "arabicURN": 368700,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "35.00",
        "hadithNumber": "2616 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنِ الإِشَارَةِ، بِالسِّلاَحِ إِلَى مُسْلِمٍ ‏ ‏",
        "hadithText": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، قَالَ عَمْرٌو حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ \n أَيُّوبَ، عَنِ ابْنِ سِيرِينَ، سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ أَبُو الْقَاسِمِ صلى الله عليه وسلم ‏\"‏\n مَنْ أَشَارَ إِلَى أَخِيهِ بِحَدِيدَةٍ فَإِنَّ الْمَلاَئِكَةَ تَلْعَنُهُ حَتَّى وَإِنْ كَانَ أَخَاهُ لأَبِيهِ وَأُمِّهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 163,
        "matchingEnglishURN": 263360,
        "last_updated": null
    },
    {
        "arabicURN": 368710,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "35.00",
        "hadithNumber": "2616 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنِ الإِشَارَةِ، بِالسِّلاَحِ إِلَى مُسْلِمٍ ‏ ‏",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنِ ابْنِ عَوْنٍ، عَنْ مُحَمَّدٍ،\n عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 164,
        "matchingEnglishURN": 263370,
        "last_updated": null
    },
    {
        "arabicURN": 368720,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "35.00",
        "hadithNumber": "2617",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنِ الإِشَارَةِ، بِالسِّلاَحِ إِلَى مُسْلِمٍ ‏ ‏",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ\n هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يُشِيرُ أَحَدُكُمْ إِلَى أَخِيهِ بِالسِّلاَحِ فَإِنَّهُ لاَ يَدْرِي أَحَدُكُمْ\n لَعَلَّ الشَّيْطَانَ يَنْزِعُ فِي يَدِهِ فَيَقَعُ فِي حُفْرَةٍ مِنَ النَّارِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 165,
        "matchingEnglishURN": 263380,
        "last_updated": null
    },
    {
        "arabicURN": 368730,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "36.00",
        "hadithNumber": "1914 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ إِزَالَةِ الأَذَى عَنِ الطَّرِيقِ، ‏ ‏",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي،\n صَالِحٍ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَمَا رَجُلٌ يَمْشِي بِطَرِيقٍ\n وَجَدَ غُصْنَ شَوْكٍ عَلَى الطَّرِيقِ فَأَخَّرَهُ فَشَكَرَ اللَّهُ لَهُ فَغَفَرَ لَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 166,
        "matchingEnglishURN": 263390,
        "last_updated": null
    },
    {
        "arabicURN": 368740,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "36.00",
        "hadithNumber": "1914 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ إِزَالَةِ الأَذَى عَنِ الطَّرِيقِ، ‏ ‏",
        "hadithText": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ\n قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَرَّ رَجُلٌ بِغُصْنِ شَجَرَةٍ عَلَى ظَهْرِ طَرِيقٍ فَقَالَ\n وَاللَّهِ لأُنَحِّيَنَّ هَذَا عَنِ الْمُسْلِمِينَ لاَ يُؤْذِيهِمْ ‏.‏ فَأُدْخِلَ الْجَنَّةَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 167,
        "matchingEnglishURN": 263400,
        "last_updated": null
    },
    {
        "arabicURN": 368750,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "36.00",
        "hadithNumber": "1914 d",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ إِزَالَةِ الأَذَى عَنِ الطَّرِيقِ، ‏ ‏",
        "hadithText": "حَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، حَدَّثَنَا شَيْبَانُ، عَنِ الأَعْمَشِ، عَنْ \n أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لَقَدْ رَأَيْتُ رَجُلاً يَتَقَلَّبُ\n فِي الْجَنَّةِ فِي شَجَرَةٍ قَطَعَهَا مِنْ ظَهْرِ الطَّرِيقِ كَانَتْ تُؤْذِي النَّاسَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 168,
        "matchingEnglishURN": 263410,
        "last_updated": null
    },
    {
        "arabicURN": 368760,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "36.00",
        "hadithNumber": "1914 e",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ إِزَالَةِ الأَذَى عَنِ الطَّرِيقِ، ‏ ‏",
        "hadithText": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَبِي رَافِعٍ،\n عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ شَجَرَةً كَانَتْ تُؤْذِي الْمُسْلِمِينَ\n فَجَاءَ رَجُلٌ فَقَطَعَهَا فَدَخَلَ الْجَنَّةَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 169,
        "matchingEnglishURN": 263420,
        "last_updated": null
    },
    {
        "arabicURN": 368770,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "36.00",
        "hadithNumber": "2618 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ إِزَالَةِ الأَذَى عَنِ الطَّرِيقِ، ‏ ‏",
        "hadithText": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ أَبَانَ بْنِ صَمْعَةَ، حَدَّثَنِي أَبُو\n الْوَازِعِ حَدَّثَنِي أَبُو بَرْزَةَ، قَالَ قُلْتُ يَا نَبِيَّ اللَّهِ عَلِّمْنِي شَيْئًا أَنْتَفِعُ بِهِ قَالَ ‏\"‏ اعْزِلِ الأَذَى\n عَنْ طَرِيقِ الْمُسْلِمِينَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 170,
        "matchingEnglishURN": 263430,
        "last_updated": null
    },
    {
        "arabicURN": 368780,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "36.00",
        "hadithNumber": "2618 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ إِزَالَةِ الأَذَى عَنِ الطَّرِيقِ، ‏ ‏",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو بَكْرِ بْنُ شُعَيْبِ بْنِ الْحَبْحَابِ، عَنْ أَبِي الْوَازِعِ،\n الرَّاسِبِيِّ عَنْ أَبِي بَرْزَةَ الأَسْلَمِيِّ، أَنَّ أَبَا بَرْزَةَ، قَالَ قُلْتُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم\n يَا رَسُولَ اللَّهِ إِنِّي لاَ أَدْرِي لَعَسَى أَنْ تَمْضِيَ وَأَبْقَى بَعْدَكَ فَزَوِّدْنِي شَيْئًا يَنْفَعُنِي اللَّهُ بِهِ\n ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ افْعَلْ كَذَا افْعَلْ كَذَا - أَبُو بَكْرٍ نَسِيَهُ - وَأَمِرَّ\n الأَذَى عَنِ الطَّرِيقِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 171,
        "matchingEnglishURN": 263440,
        "last_updated": null
    },
    {
        "arabicURN": 368790,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "37.00",
        "hadithNumber": "2242 d",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ تَعْذِيبِ الْهِرَّةِ وَنَحْوِهَا مِنَ الْحَيَوَانِ الَّذِي لاَ يُؤْذِي ‏ ‏",
        "hadithText": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ بْنِ عُبَيْدٍ الضُّبَعِيُّ، حَدَّثَنَا جُوَيْرِيَةُ، - يَعْنِي\n ابْنَ أَسْمَاءَ - عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ عُذِّبَتِ\n امْرَأَةٌ فِي هِرَّةٍ سَجَنَتْهَا حَتَّى مَاتَتْ فَدَخَلَتْ فِيهَا النَّارَ لاَ هِيَ أَطْعَمَتْهَا وَسَقَتْهَا إِذْ هِيَ\n حَبَسَتْهَا وَلاَ هِيَ تَرَكَتْهَا تَأْكُلُ مِنْ خَشَاشِ الأَرْضِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 172,
        "matchingEnglishURN": 263450,
        "last_updated": null
    },
    {
        "arabicURN": 368800,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "37.00",
        "hadithNumber": "2242 e",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ تَعْذِيبِ الْهِرَّةِ وَنَحْوِهَا مِنَ الْحَيَوَانِ الَّذِي لاَ يُؤْذِي ‏ ‏",
        "hadithText": "حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، وَعَبْدُ اللَّهِ بْنُ جَعْفَرِ بْنِ يَحْيَى بْنِ خَالِدٍ، جَمِيعًا عَنْ \n مَعْنِ بْنِ عِيسَى، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم\n بِمَعْنَى حَدِيثِ جُوَيْرِيَةَ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 173,
        "matchingEnglishURN": 263455,
        "last_updated": null
    },
    {
        "arabicURN": 368810,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "37.00",
        "hadithNumber": "2242 f",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ تَعْذِيبِ الْهِرَّةِ وَنَحْوِهَا مِنَ الْحَيَوَانِ الَّذِي لاَ يُؤْذِي ‏ ‏",
        "hadithText": "وَحَدَّثَنِيهِ نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ \n نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ عُذِّبَتِ امْرَأَةٌ فِي هِرَّةٍ\n أَوْثَقَتْهَا فَلَمْ تُطْعِمْهَا وَلَمْ تَسْقِهَا وَلَمْ تَدَعْهَا تَأْكُلُ مِنْ خَشَاشِ الأَرْضِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 174,
        "matchingEnglishURN": 263460,
        "last_updated": null
    },
    {
        "arabicURN": 368820,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "37.00",
        "hadithNumber": "2242 g",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ تَعْذِيبِ الْهِرَّةِ وَنَحْوِهَا مِنَ الْحَيَوَانِ الَّذِي لاَ يُؤْذِي ‏ ‏",
        "hadithText": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ عُبَيْدِ اللَّهِ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ،\n عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 175,
        "matchingEnglishURN": 263470,
        "last_updated": null
    },
    {
        "arabicURN": 368830,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "37.00",
        "hadithNumber": "2619",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ تَعْذِيبِ الْهِرَّةِ وَنَحْوِهَا مِنَ الْحَيَوَانِ الَّذِي لاَ يُؤْذِي ‏ ‏",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ\n هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ دَخَلَتِ امْرَأَةٌ النَّارَ مِنْ جَرَّاءِ هِرَّةٍ لَهَا - أَوْ هِرٍّ - رَبَطَتْهَا\n فَلاَ هِيَ أَطْعَمَتْهَا وَلاَ هِيَ أَرْسَلَتْهَا تُرَمِّمُ مِنْ خَشَاشِ الأَرْضِ حَتَّى مَاتَتْ هَزْلاً ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 176,
        "matchingEnglishURN": 263480,
        "last_updated": null
    },
    {
        "arabicURN": 368840,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "38.00",
        "hadithNumber": "2620",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب تَحْرِيمِ الْكِبْرِ ‏ ‏",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ يُوسُفَ الأَزْدِيُّ، حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا \n الأَعْمَشُ، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ أَبِي مُسْلِمٍ الأَغَرِّ، أَنَّهُ حَدَّثَهُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، وَأَبِي،\n هُرَيْرَةَ قَالاَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْعِزُّ إِزَارُهُ وَالْكِبْرِيَاءُ رِدَاؤُهُ فَمَنْ\n يُنَازِعُنِي عَذَّبْتُهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 177,
        "matchingEnglishURN": 263490,
        "last_updated": null
    },
    {
        "arabicURN": 368850,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "39.00",
        "hadithNumber": "2621",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنْ تَقْنِيطِ الإِنْسَانِ، مِنْ رَحْمَةِ اللَّهِ تَعَالَى ‏ ‏",
        "hadithText": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، عَنْ مُعْتَمِرِ بْنِ سُلَيْمَانَ، عَنْ أَبِيهِ، حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ،\n عَنْ جُنْدَبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حَدَّثَ ‏\"‏ أَنَّ رَجُلاً قَالَ وَاللَّهِ لاَ يَغْفِرُ اللَّهُ\n لِفُلاَنٍ وَإِنَّ اللَّهَ تَعَالَى قَالَ مَنْ ذَا الَّذِي يَتَأَلَّى عَلَىَّ أَنْ لاَ أَغْفِرَ لِفُلاَنٍ فَإِنِّي قَدْ غَفَرْتُ لِفُلاَنٍ\n وَأَحْبَطْتُ عَمَلَكَ ‏\"‏ ‏.‏ أَوْ كَمَا قَالَ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 178,
        "matchingEnglishURN": 263500,
        "last_updated": null
    },
    {
        "arabicURN": 368860,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "40.00",
        "hadithNumber": "2622",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ الضُّعَفَاءِ وَالْخَامِلِينَ ‏ ‏",
        "hadithText": "حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنِي حَفْصُ بْنُ مَيْسَرَةَ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ،\n عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ رُبَّ أَشْعَثَ مَدْفُوعٍ\n بِالأَبْوَابِ لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 179,
        "matchingEnglishURN": 263510,
        "last_updated": null
    },
    {
        "arabicURN": 368890,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "41.00",
        "hadithNumber": "2623 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنْ قَوْلِ، هَلَكَ النَّاسُ ‏ ‏",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ رَوْحِ بْنِ الْقَاسِمِ، ح وَحَدَّثَنِي \n أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ سُلَيْمَانَ بْنِ بِلاَلٍ، جَمِيعًا عَنْ سُهَيْلٍ،\n بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 181,
        "matchingEnglishURN": 263530,
        "last_updated": null
    },
    {
        "arabicURN": 368900,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "42.00",
        "hadithNumber": "2624 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب الْوَصِيَّةِ بِالْجَارِ وَالإِحْسَانِ إِلَيْهِ ‏ ‏",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، ح وَحَدَّثَنَا قُتَيْبَةُ، وَمُحَمَّدُ بْنُ رُمْحٍ، عَنِ \n اللَّيْثِ بْنِ سَعْدٍ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ، وَيَزِيدُ بْنُ هَارُونَ، كُلُّهُمْ عَنْ \n يَحْيَى بْنِ سَعِيدٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، - وَاللَّفْظُ لَهُ - حَدَّثَنَا عَبْدُ الْوَهَّابِ، - يَعْنِي\n الثَّقَفِيَّ - سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، أَخْبَرَنِي أَبُو بَكْرٍ، - وَهُوَ ابْنُ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ\n - أَنَّ عَمْرَةَ، حَدَّثَتْهُ أَنَّهَا، سَمِعَتْ عَائِشَةَ، تَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ\n ‏\"‏ مَا زَالَ جِبْرِيلُ يُوصِينِي بِالْجَارِ حَتَّى ظَنَنْتُ أَنَّهُ لَيُوَرِّثَنَّهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 182,
        "matchingEnglishURN": 263540,
        "last_updated": null
    },
    {
        "arabicURN": 368910,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "42.00",
        "hadithNumber": "2624 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب الْوَصِيَّةِ بِالْجَارِ وَالإِحْسَانِ إِلَيْهِ ‏ ‏",
        "hadithText": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، حَدَّثَنِي هِشَامُ بْنُ عُرْوَةَ،\n عَنْ أَبِيهِ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 183,
        "matchingEnglishURN": 263550,
        "last_updated": null
    },
    {
        "arabicURN": 368920,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "42.00",
        "hadithNumber": "2625 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب الْوَصِيَّةِ بِالْجَارِ وَالإِحْسَانِ إِلَيْهِ ‏ ‏",
        "hadithText": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ عُمَرَ بْنِ مُحَمَّدٍ،\n عَنْ أَبِيهِ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا زَالَ جِبْرِيلُ\n يُوصِينِي بِالْجَارِ حَتَّى ظَنَنْتُ أَنَّهُ سَيُوَرِّثُهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 184,
        "matchingEnglishURN": 263560,
        "last_updated": null
    },
    {
        "arabicURN": 368930,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "42.00",
        "hadithNumber": "2625 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب الْوَصِيَّةِ بِالْجَارِ وَالإِحْسَانِ إِلَيْهِ ‏ ‏",
        "hadithText": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لإِسْحَاقَ - قَالَ أَبُو\n كَامِلٍ حَدَّثَنَا وَقَالَ، إِسْحَاقُ أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ الْعَمِّيُّ، حَدَّثَنَا أَبُو عِمْرَانَ،\n الْجَوْنِيُّ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n ‏\"‏ يَا أَبَا ذَرٍّ إِذَا طَبَخْتَ مَرَقَةً فَأَكْثِرْ مَاءَهَا وَتَعَاهَدْ جِيرَانَكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 185,
        "matchingEnglishURN": 263570,
        "last_updated": null
    },
    {
        "arabicURN": 368940,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "42.00",
        "hadithNumber": "2625 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب الْوَصِيَّةِ بِالْجَارِ وَالإِحْسَانِ إِلَيْهِ ‏ ‏",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ إِدْرِيسَ، أَخْبَرَنَا شُعْبَةُ، ح وَحَدَّثَنَا أَبُو\n كُرَيْبٍ حَدَّثَنَا ابْنُ إِدْرِيسَ، أَخْبَرَنَا شُعْبَةُ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ،\n عَنْ أَبِي ذَرٍّ، قَالَ إِنَّ خَلِيلِي صلى الله عليه وسلم أَوْصَانِي ‏\"‏ إِذَا طَبَخْتَ مَرَقًا فَأَكْثِرْ مَاءَهُ\n ثُمَّ انْظُرْ أَهْلَ بَيْتٍ مِنْ جِيرَانِكَ فَأَصِبْهُمْ مِنْهَا بِمَعْرُوفٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 186,
        "matchingEnglishURN": 263580,
        "last_updated": null
    },
    {
        "arabicURN": 368950,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "43.00",
        "hadithNumber": "2626",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب اسْتِحْبَابِ طَلاَقَةِ الْوَجْهِ عِنْدَ اللِّقَاءِ ‏ ‏",
        "hadithText": "حَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا أَبُو عَامِرٍ، - يَعْنِي\n الْخَزَّازَ - عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ لِيَ\n النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ تَحْقِرَنَّ مِنَ الْمَعْرُوفِ شَيْئًا وَلَوْ أَنْ تَلْقَى أَخَاكَ بِوَجْهٍ طَلْقٍ\n ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 187,
        "matchingEnglishURN": 263590,
        "last_updated": null
    },
    {
        "arabicURN": 368960,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "44.00",
        "hadithNumber": "2627",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب اسْتِحْبَابِ الشَّفَاعَةِ فِيمَا لَيْسَ بِحَرَامٍ ‏ ‏",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، وَحَفْصُ بْنُ غِيَاثٍ، عَنْ بُرَيْدِ،\n بْنِ عَبْدِ اللَّهِ عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا\n أَتَاهُ طَالِبُ حَاجَةٍ أَقْبَلَ عَلَى جُلَسَائِهِ فَقَالَ ‏\"‏ اشْفَعُوا فَلْتُؤْجَرُوا وَلْيَقْضِ اللَّهُ عَلَى لِسَانِ\n نَبِيِّهِ مَا أَحَبَّ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 188,
        "matchingEnglishURN": 263600,
        "last_updated": null
    },
    {
        "arabicURN": 369010,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "46.00",
        "hadithNumber": "2630",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ الإِحْسَانِ إِلَى الْبَنَاتِ ‏ ‏",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا بَكْرٌ، - يَعْنِي ابْنَ مُضَرَ - عَنِ ابْنِ الْهَادِ، أَنَّ زِيَادَ،\n بْنَ أَبِي زِيَادٍ مَوْلَى ابْنِ عَيَّاشٍ حَدَّثَهُ عَنْ عِرَاكِ بْنِ مَالِكٍ، سَمِعْتُهُ يُحَدِّثُ، عُمَرَ بْنَ عَبْدِ الْعَزِيزِ\n عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ جَاءَتْنِي مِسْكِينَةٌ تَحْمِلُ ابْنَتَيْنِ لَهَا فَأَطْعَمْتُهَا ثَلاَثَ تَمَرَاتٍ فَأَعْطَتْ\n كُلَّ وَاحِدَةٍ مِنْهُمَا تَمْرَةً وَرَفَعَتْ إِلَى فِيهَا تَمْرَةً لِتَأْكُلَهَا فَاسْتَطْعَمَتْهَا ابْنَتَاهَا فَشَقَّتِ التَّمْرَةَ\n الَّتِي كَانَتْ تُرِيدُ أَنْ تَأْكُلَهَا بَيْنَهُمَا فَأَعْجَبَنِي شَأْنُهَا فَذَكَرْتُ الَّذِي صَنَعَتْ لِرَسُولِ اللَّهِ صلى\n الله عليه وسلم فَقَالَ ‏\"‏ إِنَّ اللَّهَ قَدْ أَوْجَبَ لَهَا بِهَا الْجَنَّةَ أَوْ أَعْتَقَهَا بِهَا مِنَ النَّارِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 191,
        "matchingEnglishURN": 263630,
        "last_updated": null
    },
    {
        "arabicURN": 369020,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "46.00",
        "hadithNumber": "2631",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ الإِحْسَانِ إِلَى الْبَنَاتِ ‏ ‏",
        "hadithText": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ، عَنْ \n عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ أَنَسٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم ‏\"‏ مَنْ عَالَ جَارِيَتَيْنِ حَتَّى تَبْلُغَا جَاءَ يَوْمَ الْقِيَامَةِ أَنَا وَهُوَ ‏\"‏ ‏.‏ وَضَمَّ أَصَابِعَهُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 192,
        "matchingEnglishURN": 263640,
        "last_updated": null
    },
    {
        "arabicURN": 369030,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "47.00",
        "hadithNumber": "2632 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ مَنْ يَمُوتُ لَهُ وَلَدٌ فَيَحْتَسِبُهُ ‏ ‏",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ،\n عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَمُوتُ لأَحَدٍ مِنَ الْمُسْلِمِينَ ثَلاَثَةٌ\n مِنَ الْوَلَدِ فَتَمَسَّهُ النَّارُ إِلاَّ تَحِلَّةَ الْقَسَمِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 193,
        "matchingEnglishURN": 263650,
        "last_updated": null
    },
    {
        "arabicURN": 369040,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "47.00",
        "hadithNumber": "2632 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ مَنْ يَمُوتُ لَهُ وَلَدٌ فَيَحْتَسِبُهُ ‏ ‏",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالُوا حَدَّثَنَا سُفْيَانُ،\n بْنُ عُيَيْنَةَ ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، وَابْنُ، رَافِعٍ عَنْ عَبْدِ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كِلاَهُمَا عَنِ \n الزُّهْرِيِّ، ‏.‏ بِإِسْنَادِ مَالِكٍ وَبِمَعْنَى حَدِيثِهِ إِلاَّ أَنَّ فِي حَدِيثِ سُفْيَانَ ‏\"‏ فَيَلِجَ النَّارَ إِلاَّ تَحِلَّةَ\n الْقَسَمِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 194,
        "matchingEnglishURN": 263660,
        "last_updated": null
    },
    {
        "arabicURN": 369050,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "47.00",
        "hadithNumber": "2632 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ مَنْ يَمُوتُ لَهُ وَلَدٌ فَيَحْتَسِبُهُ ‏ ‏",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - عَنْ سُهَيْلٍ، عَنْ \n أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِنِسْوَةٍ مِنَ الأَنْصَارِ ‏\"‏ لاَ\n يَمُوتُ لإِحْدَاكُنَّ ثَلاَثَةٌ مِنَ الْوَلَدِ فَتَحْتَسِبَهُ إِلاَّ دَخَلَتِ الْجَنَّةَ ‏\"‏ ‏.‏ فَقَالَتِ امْرَأَةٌ مِنْهُنَّ أَوِ اثْنَيْنِ\n يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ أَوِ اثْنَيْنِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 195,
        "matchingEnglishURN": 263670,
        "last_updated": null
    },
    {
        "arabicURN": 369060,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "47.00",
        "hadithNumber": "2633",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ مَنْ يَمُوتُ لَهُ وَلَدٌ فَيَحْتَسِبُهُ ‏ ‏",
        "hadithText": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، فُضَيْلُ بْنُ حُسَيْنٍ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الرَّحْمَنِ،\n بْنِ الأَصْبَهَانِيِّ عَنْ أَبِي صَالِحٍ، ذَكْوَانَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ\n اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ ذَهَبَ الرِّجَالُ بِحَدِيثِكَ فَاجْعَلْ لَنَا مِنْ نَفْسِكَ\n يَوْمًا نَأْتِيكَ فِيهِ تُعَلِّمُنَا مِمَّا عَلَّمَكَ اللَّهُ ‏.‏ قَالَ ‏\"‏ اجْتَمِعْنَ يَوْمَ كَذَا وَكَذَا ‏\"‏ ‏.‏ فَاجْتَمَعْنَ فَأَتَاهُنَّ\n رَسُولُ اللَّهِ صلى الله عليه وسلم فَعَلَّمَهُنَّ مِمَّا عَلَّمَهُ اللَّهُ ثُمَّ قَالَ ‏\"‏ مَا مِنْكُنَّ مِنِ امْرَأَةٍ تُقَدِّمُ\n بَيْنَ يَدَيْهَا مِنْ وَلَدِهَا ثَلاَثَةً إِلاَّ كَانُوا لَهَا حِجَابًا مِنَ النَّارِ ‏\"‏ ‏.‏ فَقَالَتِ امْرَأَةٌ وَاثْنَيْنِ وَاثْنَيْنِ\n وَاثْنَيْنِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَاثْنَيْنِ وَاثْنَيْنِ وَاثْنَيْنِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 196,
        "matchingEnglishURN": 263680,
        "last_updated": null
    },
    {
        "arabicURN": 369070,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "47.00",
        "hadithNumber": "2634",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ مَنْ يَمُوتُ لَهُ وَلَدٌ فَيَحْتَسِبُهُ ‏ ‏",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنَا عُبَيْدُ،\n اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَصْبَهَانِيِّ، فِي هَذَا الإِسْنَادِ\n ‏.‏ بِمِثْلِ مَعْنَاهُ وَزَادَا جَمِيعًا عَنْ شُعْبَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَصْبَهَانِيِّ قَالَ سَمِعْتُ أَبَا\n حَازِمٍ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ قَالَ ‏\"‏ ثَلاَثَةً لَمْ يَبْلُغُوا الْحِنْثَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 197,
        "matchingEnglishURN": 263690,
        "last_updated": null
    },
    {
        "arabicURN": 369080,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "47.00",
        "hadithNumber": "2635",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ مَنْ يَمُوتُ لَهُ وَلَدٌ فَيَحْتَسِبُهُ ‏ ‏",
        "hadithText": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، - وَتَقَارَبَا فِي اللَّفْظِ - قَالاَ حَدَّثَنَا \n الْمُعْتَمِرُ، عَنْ أَبِيهِ، عَنْ أَبِي السَّلِيلِ، عَنْ أَبِي حَسَّانَ، قَالَ قُلْتُ لأَبِي هُرَيْرَةَ إِنَّهُ قَدْ مَاتَ لِيَ\n ابْنَانِ فَمَا أَنْتَ مُحَدِّثِي عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم بِحَدِيثٍ تُطَيِّبُ بِهِ أَنْفُسَنَا عَنْ\n مَوْتَانَا قَالَ قَالَ نَعَمْ ‏\"‏ صِغَارُهُمْ دَعَامِيصُ الْجَنَّةِ يَتَلَقَّى أَحَدُهُمْ أَبَاهُ - أَوْ قَالَ أَبَوَيْهِ\n - فَيَأْخُذُ بِثَوْبِهِ - أَوْ قَالَ بِيَدِهِ - كَمَا آخُذُ أَنَا بِصَنِفَةِ ثَوْبِكَ هَذَا فَلاَ يَتَنَاهَى - أَوْ قَالَ\n فَلاَ يَنْتَهِي - حَتَّى يُدْخِلَهُ اللَّهُ وَأَبَاهُ الْجَنَّةَ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ سُوَيْدٍ قَالَ حَدَّثَنَا أَبُو السَّلِيلِ\n وَحَدَّثَنِيهِ عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا يَحْيَى - يَعْنِي ابْنَ سَعِيدٍ - عَنِ التَّيْمِيِّ بِهَذَا الإِسْنَادِ\n وَقَالَ فَهَلْ سَمِعْتَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم شَيْئًا تُطَيِّبُ بِهِ أَنْفُسَنَا عَنْ مَوْتَانَا\n قَالَ نَعَمْ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 198,
        "matchingEnglishURN": 263700,
        "last_updated": null
    },
    {
        "arabicURN": 369090,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "47.00",
        "hadithNumber": "2636 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ مَنْ يَمُوتُ لَهُ وَلَدٌ فَيَحْتَسِبُهُ ‏ ‏",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَأَبُو سَعِيدٍ الأَشَجُّ\n - وَاللَّفْظُ لأَبِي بَكْرٍ - قَالُوا حَدَّثَنَا حَفْصٌ، - يَعْنُونَ ابْنَ غِيَاثٍ ح وَحَدَّثَنَا عُمَرُ بْنُ حَفْصِ،\n بْنِ غِيَاثٍ حَدَّثَنَا أَبِي، عَنْ جَدِّهِ، طَلْقِ بْنِ مُعَاوِيَةَ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ \n أَبِي هُرَيْرَةَ، قَالَ أَتَتِ امْرَأَةٌ النَّبِيَّ صلى الله عليه وسلم بِصَبِيٍّ لَهَا فَقَالَتْ يَا نَبِيَّ اللَّهِ ادْعُ\n اللَّهَ لَهُ فَلَقَدْ دَفَنْتُ ثَلاَثَةً قَالَ ‏\"‏ دَفَنْتِ ثَلاَثَةً ‏\"‏ ‏.‏ قَالَتْ نَعَمْ ‏.‏ قَالَ ‏\"‏ لَقَدِ احْتَظَرْتِ بِحِظَارٍ\n شَدِيدٍ مِنَ النَّارِ ‏\"‏ ‏.‏ قَالَ عُمَرُ مِنْ بَيْنِهِمْ عَنْ جَدِّهِ ‏.‏ وَقَالَ الْبَاقُونَ عَنْ طَلْقٍ ‏.‏ وَلَمْ يَذْكُرُوا\n الْجَدَّ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 199,
        "matchingEnglishURN": 263710,
        "last_updated": null
    },
    {
        "arabicURN": 369100,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "47.00",
        "hadithNumber": "2636 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ مَنْ يَمُوتُ لَهُ وَلَدٌ فَيَحْتَسِبُهُ ‏ ‏",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا جَرِيرٌ، عَنْ طَلْقِ بْنِ مُعَاوِيَةَ،\n النَّخَعِيِّ أَبِي غِيَاثٍ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَتِ امْرَأَةٌ\n إِلَى النَّبِيِّ صلى الله عليه وسلم بِابْنٍ لَهَا فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّهُ يَشْتَكِي وَإِنِّي أَخَافُ\n عَلَيْهِ قَدْ دَفَنْتُ ثَلاَثَةً ‏.‏ قَالَ ‏\"‏ لَقَدِ احْتَظَرْتِ بِحِظَارٍ شَدِيدٍ مِنَ النَّارِ ‏\"‏ ‏.‏ قَالَ زُهَيْرٌ عَنْ\n طَلْقٍ ‏.‏ وَلَمْ يَذْكُرِ الْكُنْيَةَ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 200,
        "matchingEnglishURN": 263720,
        "last_updated": null
    },
    {
        "arabicURN": 369110,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "48.00",
        "hadithNumber": "2637 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب إِذَا أَحَبَّ اللَّهُ عَبْدًا حَبَّبَهُ إِلَى عِبَادِهِ ‏ ‏",
        "hadithText": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ\n قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ إِذَا أَحَبَّ عَبْدًا دَعَا جِبْرِيلَ فَقَالَ إِنِّي أُحِبُّ\n فُلاَنًا فَأَحِبَّهُ - قَالَ - فَيُحِبُّهُ جِبْرِيلُ ثُمَّ يُنَادِي فِي السَّمَاءِ فَيَقُولُ إِنَّ اللَّهَ يُحِبُّ فُلاَنًا\n فَأَحِبُّوهُ ‏.‏ فَيُحِبُّهُ أَهْلُ السَّمَاءِ - قَالَ - ثُمَّ يُوضَعُ لَهُ الْقَبُولُ فِي الأَرْضِ ‏.‏ وَإِذَا أَبْغَضَ\n عَبْدًا دَعَا جِبْرِيلَ فَيَقُولُ إِنِّي أُبْغِضُ فُلاَنًا فَأَبْغِضْهُ - قَالَ - فَيُبْغِضُهُ جِبْرِيلُ ثُمَّ يُنَادِي\n فِي أَهْلِ السَّمَاءِ إِنَّ اللَّهَ يُبْغِضُ فُلاَنًا فَأَبْغِضُوهُ - قَالَ - فَيُبْغِضُونَهُ ثُمَّ تُوضَعُ لَهُ الْبَغْضَاءُ\n فِي الأَرْضِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 201,
        "matchingEnglishURN": 263730,
        "last_updated": null
    },
    {
        "arabicURN": 369120,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "48.00",
        "hadithNumber": "2637 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب إِذَا أَحَبَّ اللَّهُ عَبْدًا حَبَّبَهُ إِلَى عِبَادِهِ ‏ ‏",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ - وَقَالَ\n قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي الدَّرَاوَرْدِيَّ، ح وَحَدَّثَنَاهُ سَعِيدُ بْنُ عَمْرٍو الأَشْعَثِيُّ، أَخْبَرَنَا \n عَبْثَرٌ، عَنِ الْعَلاَءِ بْنِ الْمُسَيَّبِ، ح وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي \n مَالِكٌ، - وَهُوَ ابْنُ أَنَسٍ - كُلُّهُمْ عَنْ سُهَيْلٍ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّ حَدِيثَ، الْعَلاَءِ بْنِ الْمُسَيَّبِ\n لَيْسَ فِيهِ ذِكْرُ الْبُغْضِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 202,
        "matchingEnglishURN": 263740,
        "last_updated": null
    },
    {
        "arabicURN": 369130,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "48.00",
        "hadithNumber": "2637 c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب إِذَا أَحَبَّ اللَّهُ عَبْدًا حَبَّبَهُ إِلَى عِبَادِهِ ‏ ‏",
        "hadithText": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ،\n بْنِ أَبِي سَلَمَةَ الْمَاجِشُونُ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، قَالَ كُنَّا بِعَرَفَةَ فَمَرَّ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ\n وَهُوَ عَلَى الْمَوْسِمِ فَقَامَ النَّاسُ يَنْظُرُونَ إِلَيْهِ فَقُلْتُ لأَبِي يَا أَبَتِ إِنِّي أَرَى اللَّهَ يُحِبُّ عُمَرَ\n بْنَ عَبْدِ الْعَزِيزِ ‏.‏ قَالَ وَمَا ذَاكَ قُلْتُ لِمَا لَهُ مِنَ الْحُبِّ فِي قُلُوبِ النَّاسِ ‏.‏ فَقَالَ بِأَبِيكَ أَنْتَ\n سَمِعْتَ أَبَا هُرَيْرَةَ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ جَرِيرٍ\n عَنْ سُهَيْلٍ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 203,
        "matchingEnglishURN": 263750,
        "last_updated": null
    },
    {
        "arabicURN": 369140,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "49.00",
        "hadithNumber": "2638 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب الأَرْوَاحِ جُنُودٌ مُجَنَّدَةٌ ‏ ‏",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - عَنْ سُهَيْلٍ، عَنْ \n أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الأَرْوَاحُ جُنُودٌ مُجَنَّدَةٌ\n فَمَا تَعَارَفَ مِنْهَا ائْتَلَفَ وَمَا تَنَاكَرَ مِنْهَا اخْتَلَفَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 204,
        "matchingEnglishURN": 263760,
        "last_updated": null
    },
    {
        "arabicURN": 369150,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "49.00",
        "hadithNumber": "2638 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب الأَرْوَاحِ جُنُودٌ مُجَنَّدَةٌ ‏ ‏",
        "hadithText": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا كَثِيرُ بْنُ هِشَامٍ، حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ، حَدَّثَنَا \n يَزِيدُ بْنُ الأَصَمِّ، عَنْ أَبِي هُرَيْرَةَ، بِحَدِيثٍ يَرْفَعُهُ قَالَ ‏\"‏ النَّاسُ مَعَادِنُ كَمَعَادِنِ الْفِضَّةِ وَالذَّهَبِ\n خِيَارُهُمْ فِي الْجَاهِلِيَّةِ خِيَارُهُمْ فِي الإِسْلاَمِ إِذَا فَقُهُوا وَالأَرْوَاحُ جُنُودٌ مُجَنَّدَةٌ فَمَا تَعَارَفَ\n مِنْهَا ائْتَلَفَ وَمَا تَنَاكَرَ مِنْهَا اخْتَلَفَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 205,
        "matchingEnglishURN": 263770,
        "last_updated": null
    },
    {
        "arabicURN": 369160,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "50.00",
        "hadithNumber": "2639 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب الْمَرْءُ مَعَ مَنْ أَحَبَّ ‏ ‏",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ،\n أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ أَعْرَابِيًّا، قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم مَتَى السَّاعَةُ\n قَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا أَعْدَدْتَ لَهَا ‏\"‏ ‏.‏ قَالَ حُبَّ اللَّهِ وَرَسُولِهِ ‏.‏\n قَالَ ‏\"‏ أَنْتَ مَعَ مَنْ أَحْبَبْتَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 206,
        "matchingEnglishURN": 263780,
        "last_updated": null
    },
    {
        "arabicURN": 369190,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "50.00",
        "hadithNumber": "2639 d",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب الْمَرْءُ مَعَ مَنْ أَحَبَّ ‏ ‏",
        "hadithText": "حَدَّثَنِي أَبُو الرَّبِيعِ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادٌ، - يَعْنِي ابْنَ زَيْدٍ - حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ،\n عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ\n اللَّهِ مَتَى السَّاعَةُ قَالَ ‏\"‏ وَمَا أَعْدَدْتَ لِلسَّاعَةِ ‏\"‏ ‏.‏ قَالَ حُبَّ اللَّهِ وَرَسُولِهِ قَالَ ‏\"‏ فَإِنَّكَ\n مَعَ مَنْ أَحْبَبْتَ ‏\"‏ ‏.‏ قَالَ أَنَسٌ فَمَا فَرِحْنَا بَعْدَ الإِسْلاَمِ فَرَحًا أَشَدَّ مِنْ قَوْلِ النَّبِيِّ صلى\n الله عليه وسلم ‏\"‏ فَإِنَّكَ مَعَ مَنْ أَحْبَبْتَ ‏\"‏ ‏.‏ قَالَ أَنَسٌ فَأَنَا أُحِبُّ اللَّهَ وَرَسُولَهُ وَأَبَا بَكْرٍ\n وَعُمَرَ فَأَرْجُو أَنْ أَكُونَ مَعَهُمْ وَإِنْ لَمْ أَعْمَلْ بِأَعْمَالِهِمْ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 208,
        "matchingEnglishURN": 263800,
        "last_updated": null
    },
    {
        "arabicURN": 369200,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "50.00",
        "hadithNumber": "2639 e",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب الْمَرْءُ مَعَ مَنْ أَحَبَّ ‏ ‏",
        "hadithText": "حَدَّثَنَاهُ مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ،\n عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم وَلَمْ يَذْكُرْ قَوْلَ أَنَسٍ فَأَنَا أُحِبُّ ‏.‏ وَمَا\n بَعْدَهُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 209,
        "matchingEnglishURN": 263810,
        "last_updated": null
    },
    {
        "arabicURN": 369210,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "50.00",
        "hadithNumber": "2639 f",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب الْمَرْءُ مَعَ مَنْ أَحَبَّ ‏ ‏",
        "hadithText": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ،\n عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، قَالَ بَيْنَمَا\n أَنَا وَرَسُولُ اللَّهِ، صلى الله عليه وسلم خَارِجَيْنِ مِنَ الْمَسْجِدِ فَلَقِينَا رَجُلاً عِنْدَ سُدَّةِ الْمَسْجِدِ\n فَقَالَ يَا رَسُولَ اللَّهِ مَتَى السَّاعَةُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا أَعْدَدْتَ لَهَا\n ‏\"‏ ‏.‏ قَالَ فَكَأَنَّ الرَّجُلَ اسْتَكَانَ ثُمَّ قَالَ يَا رَسُولَ اللَّهِ مَا أَعْدَدْتُ لَهَا كَبِيرَ صَلاَةٍ وَلاَ صِيَامٍ\n وَلاَ صَدَقَةٍ وَلَكِنِّي أُحِبُّ اللَّهَ وَرَسُولَهُ ‏.‏ قَالَ ‏\"‏ فَأَنْتَ مَعَ مَنْ أَحْبَبْتَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 210,
        "matchingEnglishURN": 263820,
        "last_updated": null
    },
    {
        "arabicURN": 369220,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "50.00",
        "hadithNumber": "2639 g",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب الْمَرْءُ مَعَ مَنْ أَحَبَّ ‏ ‏",
        "hadithText": "حَدَّثَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ الْعَزِيزِ الْيَشْكُرِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ،\n جَبَلَةَ أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ أَنَسٍ، عَنِ \n النَّبِيِّ صلى الله عليه وسلم بِنَحْوِهِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 211,
        "matchingEnglishURN": 263830,
        "last_updated": null
    },
    {
        "arabicURN": 369260,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "50.00",
        "hadithNumber": "2640 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب الْمَرْءُ مَعَ مَنْ أَحَبَّ ‏ ‏",
        "hadithText": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ،\n عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ\n اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ تَرَى فِي رَجُلٍ أَحَبَّ قَوْمًا وَلَمَّا يَلْحَقْ\n بِهِمْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْمَرْءُ مَعَ مَنْ أَحَبَّ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 213,
        "matchingEnglishURN": 263850,
        "last_updated": null
    },
    {
        "arabicURN": 369270,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "50.00",
        "hadithNumber": "2640 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب الْمَرْءُ مَعَ مَنْ أَحَبَّ ‏ ‏",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، ح وَحَدَّثَنِيهِ بِشْرُ،\n بْنُ خَالِدٍ أَخْبَرَنَا مُحَمَّدٌ، - يَعْنِي ابْنَ جَعْفَرٍ - كِلاَهُمَا عَنْ شُعْبَةَ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا \n أَبُو الْجَوَّابِ، حَدَّثَنَا سُلَيْمَانُ بْنُ قَرْمٍ، جَمِيعًا عَنْ سُلَيْمَانَ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، عَنِ \n النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 214,
        "matchingEnglishURN": 263860,
        "last_updated": null
    },
    {
        "arabicURN": 369280,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "50.00",
        "hadithNumber": "2641",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب الْمَرْءُ مَعَ مَنْ أَحَبَّ ‏ ‏",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا ابْنُ،\n نُمَيْرٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَمُحَمَّدُ بْنُ عُبَيْدٍ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ أَبِي مُوسَى، قَالَ\n أَتَى النَّبِيَّ صلى الله عليه وسلم رَجُلٌ ‏.‏ فَذَكَرَ بِمِثْلِ حَدِيثِ جَرِيرٍ عَنِ الأَعْمَشِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 215,
        "matchingEnglishURN": 263870,
        "last_updated": null
    },
    {
        "arabicURN": 369290,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "51.00",
        "hadithNumber": "2642 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب إِذَا أُثْنِيَ عَلَى الصَّالِحِ فَهِيَ بُشْرَى وَلاَ تَضُرُّهُ ‏ ‏",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو الرَّبِيعِ، وَأَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ - وَاللَّفْظُ\n لِيَحْيَى - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ،\n عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ قِيلَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَرَأَيْتَ\n الرَّجُلَ يَعْمَلُ الْعَمَلَ مِنَ الْخَيْرِ وَيَحْمَدُهُ النَّاسُ عَلَيْهِ قَالَ ‏\"‏ تِلْكَ عَاجِلُ بُشْرَى الْمُؤْمِنِ ‏\"‏\n ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 216,
        "matchingEnglishURN": 263880,
        "last_updated": null
    },
    {
        "arabicURN": 369300,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "51.00",
        "hadithNumber": "2642 b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب إِذَا أُثْنِيَ عَلَى الصَّالِحِ فَهِيَ بُشْرَى وَلاَ تَضُرُّهُ ‏ ‏",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، عَنْ وَكِيعٍ، ح وَحَدَّثَنَا مُحَمَّدُ،\n بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي عَبْدُ الصَّمَدِ، ح وَحَدَّثَنَا \n إِسْحَاقُ، أَخْبَرَنَا النَّضْرُ، كُلُّهُمْ عَنْ شُعْبَةَ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، بِإِسْنَادِ حَمَّادِ بْنِ زَيْدٍ ‏.‏\n بِمِثْلِ حَدِيثِهِ غَيْرَ أَنَّ فِي، حَدِيثِهِمْ عَنْ شُعْبَةَ غَيْرَ عَبْدِ الصَّمَدِ وَيُحِبُّهُ النَّاسُ عَلَيْهِ ‏.‏ وَفِي\n حَدِيثِ عَبْدِ الصَّمَدِ وَيَحْمَدُهُ النَّاسُ ‏.‏ كَمَا قَالَ حَمَّادٌ ‏.‏ \n</bdo>",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 217,
        "matchingEnglishURN": 263890,
        "last_updated": null
    },
    {
        "arabicURN": 367331,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "7.00",
        "hadithNumber": "2559 d, e",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنِ التَّحَاسُدِ، وَالتَّبَاغُضِ، وَالتَّدَابُرِ، ‏‏ ",
        "hadithText": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّوسلم قَالَ ‏\"‏ لاَ تَحَاسَدُوا وَلاَ تَبَاغَضُوا وَلاَ تَقَاطَعُوا وَكُونُوا عِبَادَ\n اللَّهِ إِخْوَانًا ‏\"‏ ‏.‏ <br><p>\n حَدَّثَنِيهِ عَلِيُّ بْنُ نَصْرٍ الْجَهْضَمِيُّ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ\n مِثْلَهُ وَزَادَ ‏\"‏ كَمَا أَمَرَكُمُ اللَّهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 30,
        "matchingEnglishURN": 262090,
        "last_updated": null
    },
    {
        "arabicURN": 367471,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "11.00",
        "hadithNumber": "2565 a, b",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنِ الشَّحْنَاءِ، وَالتَّهَاجُرِ، ‏‏",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ سُهَيْلٍ، عَنْ أَبِيهِ،\n عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ تُفْتَحُ أَبْوَابُ الْجَنَّةِ يَوْمَ الاِثْنَيْنِ\n وَيَوْمَ الْخَمِيسِ فَيُغْفَرُ لِكُلِّ عَبْدٍ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا إِلاَّ رَجُلاً كَانَتْ بَيْنَهُ وَبَيْنَ أَخِيهِ شَحْنَاءُ\n فَيُقَالُ أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا\n ‏\"‏ ‏.‏ <br><p>\n حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَحْمَدُ بْنُ عَبْدَةَ،\n الضَّبِّيُّ عَنْ عَبْدِ الْعَزِيزِ الدَّرَاوَرْدِيِّ، كِلاَهُمَا عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، بِإِسْنَادِ مَالِكٍ نَحْوَ حَدِيثِهِ\n غَيْرَ أَنَّ فِي حَدِيثِ الدَّرَاوَرْدِيِّ ‏\"‏ إِلاَّ الْمُتَهَاجِرَيْنِ ‏\"‏ ‏.‏ مِنْ رِوَايَةِ ابْنِ عَبْدَةَ وَقَالَ قُتَيْبَةُ ‏\"‏\n إِلاَّ الْمُهْتَجِرَيْنِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 43,
        "matchingEnglishURN": 262220,
        "last_updated": null
    },
    {
        "arabicURN": 368281,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "25.00",
        "hadithNumber": "2602 c, d",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب مَنْ لَعَنَهُ النَّبِيُّ صلى الله عليه وسلم أَوْ سَبَّهُ أَوْ دَعَا عَلَيْهِ",
        "hadithText": "حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، وَحَجَّاجُ بْنُ الشَّاعِرِ، قَالاَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ،\n قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ سَمِعْتُ رَسُولَ\n اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنَّمَا أَنَا بَشَرٌ وَإِنِّي اشْتَرَطْتُ عَلَى رَبِّي عَزَّ وَجَلَّ أَىُّ\n عَبْدٍ مِنَ الْمُسْلِمِينَ سَبَبْتُهُ أَوْ شَتَمْتُهُ أَنْ يَكُونَ ذَلِكَ لَهُ زَكَاةً وَأَجْرًا ‏\"‏ ‏.‏ <br><p>\n حَدَّثَنِيهِ ابْنُ أَبِي خَلَفٍ، حَدَّثَنَا رَوْحٌ، ح وَحَدَّثَنَاهُ عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا أَبُو عَاصِمٍ،\n جَمِيعًا عَنِ ابْنِ جُرَيْجٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 123,
        "matchingEnglishURN": 262960,
        "last_updated": null
    },
    {
        "arabicURN": 369171,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "50.00",
        "hadithNumber": "2639 b, c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب الْمَرْءُ مَعَ مَنْ أَحَبَّ ‏ ‏",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ عَبْدِ،\n اللَّهِ بْنِ نُمَيْرٍ وَابْنُ أَبِي عُمَرَ - وَاللَّفْظُ لِزُهَيْرٍ - قَالُوا حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسٍ،\n قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ مَتَى السَّاعَةُ قَالَ ‏\"‏ وَمَا أَعْدَدْتَ لَهَا ‏\"‏ ‏.‏ فَلَمْ يَذْكُرْ كَبِيرًا\n ‏.‏ قَالَ وَلَكِنِّي أُحِبُّ اللَّهَ وَرَسُولَهُ ‏.‏ قَالَ ‏\"‏ فَأَنْتَ مَعَ مَنْ أَحْبَبْتَ ‏\"‏ ‏.‏ <br><p>\n حَدَّثَنِيهِ مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ، حَدَّثَنَا \n عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ رَجُلاً، مِنَ الأَعْرَابِ أَتَى\n رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ مَا أَعْدَدْتُ لَهَا مِنْ كَثِيرٍ أَحْمَدُ عَلَيْهِ\n نَفْسِي ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 207,
        "matchingEnglishURN": 263790,
        "last_updated": null
    },
    {
        "arabicURN": 367071,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "1.00",
        "hadithNumber": "2549 b, c",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب بِرِّ الْوَالِدَيْنِ وَأَنَّهُمَا أَحَقُّ بِهِ ‏‏ ",
        "hadithText": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ حَبِيبٍ، سَمِعْتُ أَبَا الْعَبَّاسِ،\n سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ، يَقُولُ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم ‏.‏\n فَذَكَرَ بِمِثْلِهِ ‏.‏ قَالَ مُسْلِمٌ أَبُو الْعَبَّاسِ اسْمُهُ السَّائِبُ بْنُ فَرُّوخَ الْمَكِّيُّ ‏.‏ <br><p>\n حَدَّثَنَا أَبُو كُرَيْبٍ، أَخْبَرَنَا ابْنُ بِشْرٍ، عَنْ مِسْعَرٍ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا \n مُعَاوِيَةُ بْنُ عَمْرٍو، عَنْ أَبِي إِسْحَاقَ، ح وَحَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ،\n الْجُعْفِيُّ عَنْ زَائِدَةَ، كِلاَهُمَا عَنِ الأَعْمَشِ، جَمِيعًا عَنْ حَبِيبٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 6,
        "matchingEnglishURN": 261850,
        "last_updated": null
    },
    {
        "arabicURN": 367291,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "7.00",
        "hadithNumber": "2559 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنِ التَّحَاسُدِ، وَالتَّبَاغُضِ، وَالتَّدَابُرِ، ‏‏ ",
        "hadithText": "حَدَّثَنَا حَاجِبُ بْنُ الْوَلِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، حَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ الزُّبَيْدِيُّ،\n عَنِ الزُّهْرِيِّ، أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ح <br><p>\n وَحَدَّثَنِيهِ حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنِي ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ،\n عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ مَالِكٍ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 27,
        "matchingEnglishURN": 262060,
        "last_updated": null
    },
    {
        "arabicURN": 368351,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "26.00",
        "hadithNumber": "2526 e",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب ذَمِّ ذِي الْوَجْهَيْنِ وَتَحْرِيمِ فِعْلِهِ ‏‏ ",
        "hadithText": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنِي ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي \n سَعِيدُ بْنُ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ح <br><p>\n وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ،\n قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَجِدُونَ مِنْ شَرِّ النَّاسِ ذَا الْوَجْهَيْنِ الَّذِي يَأْتِي\n هَؤُلاَءِ بِوَجْهٍ وَهَؤُلاَءِ بِوَجْهٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 129,
        "matchingEnglishURN": 263020,
        "last_updated": null
    },
    {
        "arabicURN": 368871,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "41.00",
        "hadithNumber": "2623 a",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب النَّهْىِ عَنْ قَوْلِ، هَلَكَ النَّاسُ ‏ ‏",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ سُهَيْلِ بْنِ أَبِي،\n صَالِحٍ عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ح <br><p>\n وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ \n أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا قَالَ الرَّجُلُ هَلَكَ النَّاسُ\n ‏.‏ فَهُوَ أَهْلَكُهُمْ ‏\"‏ ‏.‏ قَالَ أَبُو إِسْحَاقَ لاَ أَدْرِي أَهْلَكَهُمْ بِالنَّصْبِ أَوْ أَهْلَكُهُمْ بِالرَّفْعِ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 180,
        "matchingEnglishURN": 263520,
        "last_updated": null
    },
    {
        "arabicURN": 369232,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "50.00",
        "hadithNumber": "2639 h",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب الْمَرْءُ مَعَ مَنْ أَحَبَّ ‏ ‏",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، ح <br><p>\n وَحَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ \n قَتَادَةَ، سَمِعْتُ أَنَسًا، ح <br><p>\n وَحَدَّثَنَا أَبُو غَسَّانَ الْمِسْمَعِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا مُعَاذٌ، - يَعْنِي ابْنَ\n هِشَامٍ - حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْحَدِيثِ\n ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 212,
        "matchingEnglishURN": 263840,
        "last_updated": null
    },
    {
        "arabicURN": 368991,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "46.00",
        "hadithNumber": "2629",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب فَضْلِ الإِحْسَانِ إِلَى الْبَنَاتِ ‏ ‏",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ قُهْزَاذَ، حَدَّثَنَا سَلَمَةُ بْنُ سُلَيْمَانَ، أَخْبَرَنَا عَبْدُ اللَّهِ،\n أَخْبَرَنَا مَعْمَرٌ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرِ بْنِ حَزْمٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ،\n ح <br><p>\n وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ بَهْرَامَ، وَأَبُو بَكْرِ بْنُ إِسْحَاقَ - وَاللَّفْظُ لَهُمَا\n - قَالاَ أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ، أَنَّأَخْبَرَهُ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ جَاءَتْنِي امْرَأَةٌ\n وَمَعَهَا ابْنَتَانِ لَهَا فَسَأَلَتْنِي فَلَمْ تَجِدْ عِنْدِي شَيْئًا غَيْرَ تَمْرَةٍ وَاحِدَةٍ فَأَعْطَيْتُهَا إِيَّاهَا فَأَخَذَتْهَا\n فَقَسَمَتْهَا بَيْنَ ابْنَتَيْهَا وَلَمْ تَأْكُلْ مِنْهَا شَيْئًا ثُمَّ قَامَتْ فَخَرَجَتْ وَابْنَتَاهَا فَدَخَلَ عَلَىَّ النَّبِيُّ\n صلى الله عليه وسلم فَحَدَّثْتُهُ حَدِيثَهَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنِ ابْتُلِيَ مِنَ\n الْبَنَاتِ بِشَىْءٍ فَأَحْسَنَ إِلَيْهِنَّ كُنَّ لَهُ سِتْرًا مِنَ النَّارِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 190,
        "matchingEnglishURN": 263620,
        "last_updated": null
    },
    {
        "arabicURN": 368971,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 46,
        "babNumber": "45.00",
        "hadithNumber": "2628",
        "bookName": " كتاب البر والصلة والآداب",
        "babName": " باب اسْتِحْبَابِ مُجَالَسَةِ الصَّالِحِينَ وَمُجَانَبَةِ قُرَنَاءِ السَّوْءِ ‏ ‏",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ، عَنْ \n جَدِّهِ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم ح <br><p>\n وَحَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِيُّ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ،\n عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّمَا مَثَلُ الْجَلِيسِ\n الصَّالِحِ وَالْجَلِيسِ السَّوْءِ كَحَامِلِ الْمِسْكِ وَنَافِخِ الْكِيرِ فَحَامِلُ الْمِسْكِ إِمَّا أَنْ يُحْذِيَكَ وَإِمَّا\n أَنْ تَبْتَاعَ مِنْهُ وَإِمَّا أَنْ تَجِدَ مِنْهُ رِيحًا طَيِّبَةً وَنَافِخُ الْكِيرِ إِمَّا أَنْ يُحْرِقَ ثِيَابَكَ وَإِمَّا أَنْ\n تَجِدَ رِيحًا خَبِيثَةً ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "45.0",
        "grade1": null,
        "ourHadithNumber": 189,
        "matchingEnglishURN": 263610,
        "last_updated": null
    }
]