[
    {
        "arabicURN": 376440,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2956",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي الدَّرَاوَرْدِيَّ - عَنِ الْعَلاَءِ، عَنْ \n أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الدُّنْيَا سِجْنُ الْمُؤْمِنِ\n وَجَنَّةُ الْكَافِرِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 1,
        "matchingEnglishURN": 270580,
        "last_updated": null
    },
    {
        "arabicURN": 376450,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2957 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا سُلَيْمَانُ، - يَعْنِي ابْنَ بِلاَلٍ - عَنْ \n جَعْفَرٍ، عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَرَّ بِالسُّوقِ\n دَاخِلاً مِنْ بَعْضِ الْعَالِيَةِ وَالنَّاسُ كَنَفَتَهُ فَمَرَّ بِجَدْىٍ أَسَكَّ مَيِّتٍ فَتَنَاوَلَهُ فَأَخَذَ بِأُذُنِهِ ثُمَّ قَالَ\n ‏\"‏ أَيُّكُمْ يُحِبُّ أَنَّ هَذَا لَهُ بِدِرْهَمٍ ‏\"‏ ‏.‏ فَقَالُوا مَا نُحِبُّ أَنَّهُ لَنَا بِشَىْءٍ وَمَا نَصْنَعُ بِهِ قَالَ ‏\"‏\n أَتُحِبُّونَ أَنَّهُ لَكُمْ ‏\"‏ ‏.‏ قَالُوا وَاللَّهِ لَوْ كَانَ حَيًّا كَانَ عَيْبًا فِيهِ لأَنَّهُ أَسَكُّ فَكَيْفَ وَهُوَ مَيِّتٌ\n فَقَالَ ‏\"‏ فَوَاللَّهِ لَلدُّنْيَا أَهْوَنُ عَلَى اللَّهِ مِنْ هَذَا عَلَيْكُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 2,
        "matchingEnglishURN": 270590,
        "last_updated": null
    },
    {
        "arabicURN": 376460,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2957 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، وَإِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ عَرْعَرَةَ السَّامِيُّ، قَالاَ\n حَدَّثَنَا عَبْدُ الْوَهَّابِ، - يَعْنِيَانِ الثَّقَفِيَّ - عَنْ جَعْفَرٍ، عَنْ أَبِيهِ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى\n الله عليه وسلم ‏.‏ بِمِثْلِهِ غَيْرَ أَنَّ فِي حَدِيثِ الثَّقَفِيِّ فَلَوْ كَانَ حَيًّا كَانَ هَذَا السَّكَكُ بِهِ عَيْبًا\n ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 3,
        "matchingEnglishURN": 270600,
        "last_updated": null
    },
    {
        "arabicURN": 376470,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2958 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ مُطَرِّفٍ، عَنْ أَبِيهِ، قَالَ أَتَيْتُ\n النَّبِيَّ صلى الله عليه وسلم وَهُوَ يَقْرَأُ ‏{‏ أَلْهَاكُمُ التَّكَاثُرُ‏}‏ قَالَ ‏\"‏ يَقُولُ ابْنُ آدَمَ مَالِي مَالِي\n - قَالَ - وَهَلْ لَكَ يَا ابْنَ آدَمَ مِنْ مَالِكَ إِلاَّ مَا أَكَلْتَ فَأَفْنَيْتَ أَوْ لَبِسْتَ فَأَبْلَيْتَ أَوْ تَصَدَّقْتَ\n فَأَمْضَيْتَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 4,
        "matchingEnglishURN": 270610,
        "last_updated": null
    },
    {
        "arabicURN": 376480,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2958 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، وَقَالاَ،\n جَمِيعًا حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ سَعِيدٍ، ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنَا \n أَبِي كُلُّهُمْ، عَنْ قَتَادَةَ، عَنْ مُطَرِّفٍ، عَنْ أَبِيهِ، قَالَ انْتَهَيْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم ‏.‏\n فَذَكَرَ بِمِثْلِ حَدِيثِ هَمَّامٍ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 5,
        "matchingEnglishURN": 270620,
        "last_updated": null
    },
    {
        "arabicURN": 376490,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2959 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ، عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي،\n هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ يَقُولُ الْعَبْدُ مَالِي مَالِي إِنَّمَا لَهُ مِنْ مَالِهِ\n ثَلاَثٌ مَا أَكَلَ فَأَفْنَى أَوْ لَبِسَ فَأَبْلَى أَوْ أَعْطَى فَاقْتَنَى وَمَا سِوَى ذَلِكَ فَهُوَ ذَاهِبٌ وَتَارِكُهُ\n لِلنَّاسِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 6,
        "matchingEnglishURN": 270631,
        "last_updated": null
    },
    {
        "arabicURN": 376500,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2959 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "وَحَدَّثَنِيهِ أَبُو بَكْرِ بْنُ إِسْحَاقَ، أَخْبَرَنَا ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، أَخْبَرَنِي \n الْعَلاَءُ بْنُ عَبْدِ الرَّحْمَنِ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 7,
        "matchingEnglishURN": 270632,
        "last_updated": null
    },
    {
        "arabicURN": 376510,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2960",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَزُهَيْرُ بْنُ حَرْبٍ، كِلاَهُمَا عَنِ ابْنِ عُيَيْنَةَ، قَالَ\n يَحْيَى أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ\n قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَتْبَعُ الْمَيِّتَ ثَلاَثَةٌ فَيَرْجِعُ اثْنَانِ وَيَبْقَى وَاحِدٌ يَتْبَعُهُ\n أَهْلُهُ وَمَالُهُ وَعَمَلُهُ فَيَرْجِعُ أَهْلُهُ وَمَالُهُ وَيَبْقَى عَمَلُهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 8,
        "matchingEnglishURN": 270640,
        "last_updated": null
    },
    {
        "arabicURN": 376520,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2961 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ، - يَعْنِي ابْنَ حَرْمَلَةَ بْنِ عِمْرَانَ التُّجِيبِيَّ -\n أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ،\n أَخْبَرَهُ أَنَّ عَمْرَو بْنَ عَوْفٍ وَهُوَ حَلِيفُ بَنِي عَامِرِ بْنِ لُؤَىٍّ وَكَانَ شَهِدَ بَدْرًا مَعَ رَسُولِ\n اللَّهِ صلى الله عليه وسلم أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ أَبَا عُبَيْدَةَ بْنَ\n الْجَرَّاحِ إِلَى الْبَحْرَيْنِ يَأْتِي بِجِزْيَتِهَا وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم هُوَ صَالَحَ\n أَهْلَ الْبَحْرَيْنِ وَأَمَّرَ عَلَيْهِمُ الْعَلاَءَ بْنَ الْحَضْرَمِيِّ فَقَدِمَ أَبُو عُبَيْدَةَ بِمَالٍ مِنَ الْبَحْرَيْنِ فَسَمِعَتِ\n الأَنْصَارُ بِقُدُومِ أَبِي عُبَيْدَةَ فَوَافَوْا صَلاَةَ الْفَجْرِ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا\n صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم انْصَرَفَ فَتَعَرَّضُوا لَهُ فَتَبَسَّمَ رَسُولُ اللَّهِ صلى الله\n عليه وسلم حِينَ رَآهُمْ ثُمَّ قَالَ ‏\"‏ أَظُنُّكُمْ سَمِعْتُمْ أَنَّ أَبَا عُبَيْدَةَ قَدِمَ بِشَىْءٍ مِنَ الْبَحْرَيْنِ ‏\"‏\n ‏.‏ فَقَالُوا أَجَلْ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ ‏\"‏ فَأَبْشِرُوا وَأَمِّلُوا مَا يَسُرُّكُمْ فَوَاللَّهِ مَا الْفَقْرَ أَخْشَى\n عَلَيْكُمْ ‏.‏ وَلَكِنِّي أَخْشَى عَلَيْكُمْ أَنْ تُبْسَطَ الدُّنْيَا عَلَيْكُمْ كَمَا بُسِطَتْ عَلَى مَنْ كَانَ قَبْلَكُمْ فَتَنَافَسُوهَا\n كَمَا تَنَافَسُوهَا وَتُهْلِكَكُمْ كَمَا أَهْلَكَتْهُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 9,
        "matchingEnglishURN": 270650,
        "last_updated": null
    },
    {
        "arabicURN": 376530,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2961 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ،\n بْنِ سَعْدٍ حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا أَبُو\n الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ، كِلاَهُمَا عَنِ الزُّهْرِيِّ، بِإِسْنَادِ يُونُسَ وَمِثْلِ حَدِيثِهِ غَيْرَ أَنَّ فِي حَدِيثِ\n صَالِحٍ ‏\"‏ وَتُلْهِيَكُمْ كَمَا أَلْهَتْهُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 10,
        "matchingEnglishURN": 270660,
        "last_updated": null
    },
    {
        "arabicURN": 376540,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2962",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا عَمْرُو بْنُ سَوَّادٍ الْعَامِرِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ،\n الْحَارِثِ أَنَّ بَكْرَ بْنَ سَوَادَةَ، حَدَّثَهُ أَنَّ يَزِيدَ بْنَ رَبَاحٍ - هُوَ أَبُو فِرَاسٍ مَوْلَى عَبْدِ اللَّهِ بْنِ\n عَمْرِو بْنِ الْعَاصِ - حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، عَنْ رَسُولِ اللَّهِ صلى الله\n عليه وسلم أَنَّهُ قَالَ ‏\"‏ إِذَا فُتِحَتْ عَلَيْكُمْ فَارِسُ وَالرُّومُ أَىُّ قَوْمٍ أَنْتُمْ ‏\"‏ ‏.‏ قَالَ عَبْدُ الرَّحْمَنِ\n بْنُ عَوْفٍ نَقُولُ كَمَا أَمَرَنَا اللَّهُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَوْ غَيْرَ ذَلِكَ تَتَنَافَسُونَ\n ثُمَّ تَتَحَاسَدُونَ ثُمَّ تَتَدَابَرُونَ ثُمَّ تَتَبَاغَضُونَ أَوْ نَحْوَ ذَلِكَ ثُمَّ تَنْطَلِقُونَ فِي مَسَاكِينِ الْمُهَاجِرِينَ\n فَتَجْعَلُونَ بَعْضَهُمْ عَلَى رِقَابِ بَعْضٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 11,
        "matchingEnglishURN": 270670,
        "last_updated": null
    },
    {
        "arabicURN": 376550,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2963 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ قُتَيْبَةُ حَدَّثَنَا وَقَالَ، يَحْيَى أَخْبَرَنَا \n الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ الْحِزَامِيُّ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ\n اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا نَظَرَ أَحَدُكُمْ إِلَى مَنْ فُضِّلَ عَلَيْهِ فِي الْمَالِ وَالْخَلْقِ فَلْيَنْظُرْ\n إِلَى مَنْ هُوَ أَسْفَلَ مِنْهُ مِمَّنْ فُضِّلَ عَلَيْهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 12,
        "matchingEnglishURN": 270680,
        "last_updated": null
    },
    {
        "arabicURN": 376560,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2963 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ \n أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ أَبِي الزِّنَادِ سَوَاءً ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 13,
        "matchingEnglishURN": 270690,
        "last_updated": null
    },
    {
        "arabicURN": 376570,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2963 c",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ،\n ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَوَكِيعٌ، عَنِ الأَعْمَشِ،\n عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ انْظُرُوا إِلَى\n مَنْ أَسْفَلَ مِنْكُمْ وَلاَ تَنْظُرُوا إِلَى مَنْ هُوَ فَوْقَكُمْ فَهُوَ أَجْدَرُ أَنْ لاَ تَزْدَرُوا نِعْمَةَ اللَّهِ ‏\"‏ ‏.‏ قَالَ\n أَبُو مُعَاوِيَةَ ‏\"‏ عَلَيْكُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 14,
        "matchingEnglishURN": 270700,
        "last_updated": null
    },
    {
        "arabicURN": 376580,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2964",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا إِسْحَاقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ،\n حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرَةَ، أَنَّ أَبَا هُرَيْرَةَ، حَدَّثَهُ أَنَّهُ، سَمِعَ النَّبِيَّ صلى الله عليه\n وسلم يَقُولُ ‏\"‏ إِنَّ ثَلاَثَةً فِي بَنِي إِسْرَائِيلَ أَبْرَصَ وَأَقْرَعَ وَأَعْمَى فَأَرَادَ اللَّهُ أَنْ يَبْتَلِيَهُمْ\n فَبَعَثَ إِلَيْهِمْ مَلَكًا فَأَتَى الأَبْرَصَ فَقَالَ أَىُّ شَىْءٍ أَحَبُّ إِلَيْكَ قَالَ لَوْنٌ حَسَنٌ وَجِلْدٌ حَسَنٌ\n وَيَذْهَبُ عَنِّي الَّذِي قَدْ قَذِرَنِي النَّاسُ ‏.‏ قَالَ فَمَسَحَهُ فَذَهَبَ عَنْهُ قَذَرُهُ وَأُعْطِيَ لَوْنًا حَسَنًا\n وَجِلْدًا حَسَنًا قَالَ فَأَىُّ الْمَالِ أَحَبُّ إِلَيْكَ قَالَ الإِبِلُ - أَوْ قَالَ الْبَقَرُ شَكَّ إِسْحَاقُ - إِلاَّ\n أَنَّ الأَبْرَصَ أَوِ الأَقْرَعَ قَالَ أَحَدُهُمَا الإِبِلُ وَقَالَ الآخَرُ الْبَقَرُ - قَالَ فَأُعْطِيَ نَاقَةً عُشَرَاءَ\n فَقَالَ بَارَكَ اللَّهُ لَكَ فِيهَا - قَالَ - فَأَتَى الأَقْرَعَ فَقَالَ أَىُّ شَىْءٍ أَحَبُّ إِلَيْكَ قَالَ شَعَرٌ\n حَسَنٌ وَيَذْهَبُ عَنِّي هَذَا الَّذِي قَذِرَنِي النَّاسُ ‏.‏ قَالَ فَمَسَحَهُ فَذَهَبَ عَنْهُ وَأُعْطِيَ شَعَرًا\n حَسَنًا - قَالَ - فَأَىُّ الْمَالِ أَحَبُّ إِلَيْكَ قَالَ الْبَقَرُ ‏.‏ فَأُعْطِيَ بَقَرَةً حَامِلاً فَقَالَ بَارَكَ اللَّهُ\n لَكَ فِيهَا - قَالَ - فَأَتَى الأَعْمَى فَقَالَ أَىُّ شَىْءٍ أَحَبُّ إِلَيْكَ قَالَ أَنْ يَرُدَّ اللَّهُ إِلَىَّ بَصَرِي\n فَأُبْصِرَ بِهِ النَّاسَ - قَالَ - فَمَسَحَهُ فَرَدَّ اللَّهُ إِلَيْهِ بَصَرَهُ ‏.‏ قَالَ فَأَىُّ الْمَالِ أَحَبُّ إِلَيْكَ\n قَالَ الْغَنَمُ ‏.‏ فَأُعْطِيَ شَاةً وَالِدًا فَأُنْتِجَ هَذَانِ وَوَلَّدَ هَذَا - قَالَ - فَكَانَ لِهَذَا وَادٍ مِنَ الإِبِلِ\n وَلِهَذَا وَادٍ مِنَ الْبَقَرِ وَلِهَذَا وَادٍ مِنَ الْغَنَمِ ‏.‏ قَالَ ثُمَّ إِنَّهُ أَتَى الأَبْرَصَ فِي صُورَتِهِ وَهَيْئَتِهِ فَقَالَ\n رَجُلٌ مِسْكِينٌ قَدِ انْقَطَعَتْ بِيَ الْحِبَالُ فِي سَفَرِي فَلاَ بَلاَغَ لِيَ الْيَوْمَ إِلاَّ بِاللَّهِ ثُمَّ بِكَ أَسْأَلُكَ\n بِالَّذِي أَعْطَاكَ اللَّوْنَ الْحَسَنَ وَالْجِلْدَ الْحَسَنَ وَالْمَالَ بَعِيرًا أَتَبَلَّغُ عَلَيْهِ فِي سَفَرِي ‏.‏ فَقَالَ\n الْحُقُوقُ كَثِيرَةٌ ‏.‏ فَقَالَ لَهُ كَأَنِّي أَعْرِفُكَ أَلَمْ تَكُنْ أَبْرَصَ يَقْذَرُكَ النَّاسُ فَقِيرًا فَأَعْطَاكَ اللَّهُ\n فَقَالَ إِنَّمَا وَرِثْتُ هَذَا الْمَالَ كَابِرًا عَنْ كَابِرٍ ‏.‏ فَقَالَ إِنْ كُنْتَ كَاذِبًا فَصَيَّرَكَ اللَّهُ إِلَى مَا\n كُنْتَ ‏.‏ قَالَ وَأَتَى الأَقْرَعَ فِي صُورَتِهِ فَقَالَ لَهُ مِثْلَ مَا قَالَ لِهَذَا وَرَدَّ عَلَيْهِ مِثْلَ مَا رَدَّ عَلَى\n هَذَا فَقَالَ إِنْ كُنْتَ كَاذِبًا فَصَيَّرَكَ اللَّهُ إِلَى مَا كُنْتَ ‏.‏ قَالَ وَأَتَى الأَعْمَى فِي صُورَتِهِ وَهَيْئَتِهِ\n فَقَالَ رَجُلٌ مِسْكِينٌ وَابْنُ سَبِيلٍ انْقَطَعَتْ بِيَ الْحِبَالُ فِي سَفَرِي فَلاَ بَلاَغَ لِيَ الْيَوْمَ إِلاَّ بِاللَّهِ\n ثُمَّ بِكَ أَسْأَلُكَ بِالَّذِي رَدَّ عَلَيْكَ بَصَرَكَ شَاةً أَتَبَلَّغُ بِهَا فِي سَفَرِي فَقَالَ قَدْ كُنْتُ أَعْمَى فَرَدَّ\n اللَّهُ إِلَىَّ بَصَرِي فَخُذْ مَا شِئْتَ وَدَعْ مَا شِئْتَ فَوَاللَّهِ لاَ أَجْهَدُكَ الْيَوْمَ شَيْئًا أَخَذْتَهُ لِلَّهِ فَقَالَ\n أَمْسِكْ مَالَكَ فَإِنَّمَا ابْتُلِيتُمْ فَقَدْ رُضِيَ عَنْكَ وَسُخِطَ عَلَى صَاحِبَيْكَ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 15,
        "matchingEnglishURN": 270710,
        "last_updated": null
    },
    {
        "arabicURN": 376590,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2965",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ، - وَاللَّفْظُ لإِسْحَاقَ - قَالَ\n عَبَّاسٌ حَدَّثَنَا وَقَالَ، إِسْحَاقُ أَخْبَرَنَا - أَبُو بَكْرٍ الْحَنَفِيُّ، حَدَّثَنَا بُكَيْرُ بْنُ مِسْمَارٍ، حَدَّثَنِي \n عَامِرُ بْنُ سَعْدٍ، قَالَ كَانَ سَعْدُ بْنُ أَبِي وَقَّاصٍ فِي إِبِلِهِ فَجَاءَهُ ابْنُهُ عُمَرُ فَلَمَّا رَآهُ سَعْدٌ\n قَالَ أَعُوذُ بِاللَّهِ مِنْ شَرِّ هَذَا الرَّاكِبِ فَنَزَلَ فَقَالَ لَهُ أَنَزَلْتَ فِي إِبِلِكَ وَغَنَمِكَ وَتَرَكْتَ النَّاسَ\n يَتَنَازَعُونَ الْمُلْكَ بَيْنَهُمْ فَضَرَبَ سَعْدٌ فِي صَدْرِهِ فَقَالَ اسْكُتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله\n عليه وسلم يَقُولُ ‏\"‏ إِنَّ اللَّهَ يُحِبُّ الْعَبْدَ التَّقِيَّ الْغَنِيَّ الْخَفِيَّ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 16,
        "matchingEnglishURN": 270720,
        "last_updated": null
    },
    {
        "arabicURN": 376601,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2966 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ إِسْمَاعِيلَ، عَنْ قَيْسٍ،\n عَنْ سَعْدٍ، ح \n \n وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي وَابْنُ، بِشْرٍ قَالاَ حَدَّثَنَا إِسْمَاعِيلُ،\n عَنْ قَيْسٍ، قَالَ سَمِعْتُ سَعْدَ بْنَ أَبِي وَقَّاصٍ، يَقُولُ وَاللَّهِ إِنِّي لأَوَّلُ رَجُلٍ مِنَ الْعَرَبِ رَمَى\n بِسَهْمٍ فِي سَبِيلِ اللَّهِ وَلَقَدْ كُنَّا نَغْزُو مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مَا لَنَا طَعَامٌ نَأْكُلُهُ\n إِلاَّ وَرَقُ الْحُبْلَةِ وَهَذَا السَّمُرُ حَتَّى إِنَّ أَحَدَنَا لَيَضَعُ كَمَا تَضَعُ الشَّاةُ ثُمَّ أَصْبَحَتْ بَنُو أَسَدٍ\n تُعَزِّرُنِي عَلَى الدِّينِ لَقَدْ خِبْتُ إِذًا وَضَلَّ عَمَلِي وَلَمْ يَقُلِ ابْنُ نُمَيْرٍ إِذًا ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 17,
        "matchingEnglishURN": 270730,
        "last_updated": null
    },
    {
        "arabicURN": 376620,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2966 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "وَحَدَّثَنَاهُ يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا وَكِيعٌ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، بِهَذَا الإِسْنَادِ\n وَقَالَ حَتَّى إِنْ كَانَ أَحَدُنَا لَيَضَعُ كَمَا تَضَعُ الْعَنْزُ مَا يَخْلِطُهُ بِشَىْءٍ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 18,
        "matchingEnglishURN": 270740,
        "last_updated": null
    },
    {
        "arabicURN": 376630,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2967 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، حَدَّثَنَا حُمَيْدُ بْنُ هِلاَلٍ، عَنْ \n خَالِدِ بْنِ عُمَيْرٍ الْعَدَوِيِّ، قَالَ خَطَبَنَا عُتْبَةُ بْنُ غَزْوَانَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ أَمَّا\n بَعْدُ فَإِنَّ الدُّنْيَا قَدْ آذَنَتْ بِصُرْمٍ وَوَلَّتْ حَذَّاءَ وَلَمْ يَبْقَ مِنْهَا إِلاَّ صُبَابَةٌ كَصُبَابَةِ الإِنَاءِ يَتَصَابُّهَا\n صَاحِبُهَا وَإِنَّكُمْ مُنْتَقِلُونَ مِنْهَا إِلَى دَارٍ لاَ زَوَالَ لَهَا فَانْتَقِلُوا بِخَيْرِ مَا بِحَضْرَتِكُمْ فَإِنَّهُ قَدْ\n ذُكِرَ لَنَا أَنَّ الْحَجَرَ يُلْقَى مِنْ شَفَةِ جَهَنَّمَ فَيَهْوِي فِيهَا سَبْعِينَ عَامًا لاَ يُدْرِكُ لَهَا قَعْرًا وَوَاللَّهِ\n لَتُمْلأَنَّ أَفَعَجِبْتُمْ وَلَقَدْ ذُكِرَ لَنَا أَنَّ مَا بَيْنَ مِصْرَاعَيْنِ مِنْ مَصَارِيعِ الْجَنَّةِ مَسِيرَةُ أَرْبَعِينَ سَنَةً\n وَلَيَأْتِيَنَّ عَلَيْهَا يَوْمٌ وَهُوَ كَظِيظٌ مِنَ الزِّحَامِ وَلَقَدْ رَأَيْتُنِي سَابِعَ سَبْعَةٍ مَعَ رَسُولِ اللَّهِ صلى\n الله عليه وسلم مَا لَنَا طَعَامٌ إِلاَّ وَرَقُ الشَّجَرِ حَتَّى قَرِحَتْ أَشْدَاقُنَا فَالْتَقَطْتُ بُرْدَةً فَشَقَقْتُهَا\n بَيْنِي وَبَيْنَ سَعْدِ بْنِ مَالِكٍ فَاتَّزَرْتُ بِنِصْفِهَا وَاتَّزَرَ سَعْدٌ بِنِصْفِهَا فَمَا أَصْبَحَ الْيَوْمَ مِنَّا أَحَدٌ\n إِلاَّ أَصْبَحَ أَمِيرًا عَلَى مِصْرٍ مِنَ الأَمْصَارِ وَإِنِّي أَعُوذُ بِاللَّهِ أَنْ أَكُونَ فِي نَفْسِي عَظِيمًا وَعِنْدَ\n اللَّهِ صَغِيرًا وَإِنَّهَا لَمْ تَكُنْ نُبُوَّةٌ قَطُّ إِلاَّ تَنَاسَخَتْ حَتَّى يَكُونَ آخِرُ عَاقِبَتِهَا مُلْكًا فَسَتَخْبُرُونَ\n وَتُجَرِّبُونَ الأُمَرَاءَ بَعْدَنَا ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 19,
        "matchingEnglishURN": 270750,
        "last_updated": null
    },
    {
        "arabicURN": 376640,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2967 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "وَحَدَّثَنِي إِسْحَاقُ بْنُ عُمَرَ بْنِ سَلِيطٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، حَدَّثَنَا حُمَيْدُ بْنُ،\n هِلاَلٍ عَنْ خَالِدِ بْنِ عُمَيْرٍ، وَقَدْ أَدْرَكَ الْجَاهِلِيَّةَ قَالَ خَطَبَ عُتْبَةُ بْنُ غَزْوَانَ وَكَانَ أَمِيرًا\n عَلَى الْبَصْرَةِ ‏.‏ فَذَكَرَ نَحْوَ حَدِيثِ شَيْبَانَ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 20,
        "matchingEnglishURN": 270760,
        "last_updated": null
    },
    {
        "arabicURN": 376650,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2967 c",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا وَكِيعٌ، عَنْ قُرَّةَ بْنِ خَالِدٍ، عَنْ حُمَيْدِ،\n بْنِ هِلاَلٍ عَنْ خَالِدِ بْنِ عُمَيْرٍ، قَالَ سَمِعْتُ عُتْبَةَ بْنَ غَزْوَانَ، يَقُولُ لَقَدْ رَأَيْتُنِي سَابِعَ سَبْعَةٍ\n مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مَا طَعَامُنَا إِلاَّ وَرَقُ الْحُبْلَةِ حَتَّى قَرِحَتْ أَشْدَاقُنَا ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 21,
        "matchingEnglishURN": 270770,
        "last_updated": null
    },
    {
        "arabicURN": 376660,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2968",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ \n أَبِي هُرَيْرَةَ، قَالَ قَالُوا يَا رَسُولَ اللَّهِ هَلْ نَرَى رَبَّنَا يَوْمَ الْقِيَامَةِ قَالَ ‏\"‏ هَلْ تُضَارُّونَ فِي\n رُؤْيَةِ الشَّمْسِ فِي الظَّهِيرَةِ لَيْسَتْ فِي سَحَابَةٍ ‏\"‏ ‏.‏ قَالُوا لاَ ‏.‏ قَالَ ‏\"‏ فَهَلْ تُضَارُّونَ فِي\n رُؤْيَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ لَيْسَ فِي سَحَابَةٍ ‏\"‏ ‏.‏ قَالُوا لاَ ‏.‏ قَالَ ‏\"‏ فَوَالَّذِي نَفْسِي بِيَدِهِ لاَ تُضَارُّونَ\n فِي رُؤْيَةِ رَبِّكُمْ إِلاَّ كَمَا تُضَارُّونَ فِي رُؤْيَةِ أَحَدِهِمَا - قَالَ - فَيَلْقَى الْعَبْدَ فَيَقُولُ أَىْ فُلْ\n أَلَمْ أُكْرِمْكَ وَأُسَوِّدْكَ وَأُزَوِّجْكَ وَأُسَخِّرْ لَكَ الْخَيْلَ وَالإِبِلَ وَأَذَرْكَ تَرْأَسُ وَتَرْبَعُ فَيَقُولُ بَلَى\n ‏.‏ قَالَ فَيَقُولُ أَفَظَنَنْتَ أَنَّكَ مُلاَقِيَّ فَيَقُولُ لاَ ‏.‏ فَيَقُولُ فَإِنِّي أَنْسَاكَ كَمَا نَسِيتَنِي ‏.‏ ثُمَّ يَلْقَى\n الثَّانِيَ فَيَقُولُ أَىْ فُلْ أَلَمْ أُكْرِمْكَ وَأُسَوِّدْكَ وَأُزَوِّجْكَ وَأُسَخِّرْ لَكَ الْخَيْلَ وَالإِبِلَ وَأَذَرْكَ تَرْأَسُ\n وَتَرْبَعُ فَيَقُولُ بَلَى أَىْ رَبِّ ‏.‏ فَيَقُولُ أَفَظَنَنْتَ أَنَّكَ مُلاَقِيَّ فَيَقُولُ لاَ ‏.‏ فَيَقُولُ فَإِنِّي أَنْسَاكَ\n كَمَا نَسِيتَنِي ‏.‏ ثُمَّ يَلْقَى الثَّالِثَ فَيَقُولُ لَهُ مِثْلَ ذَلِكَ فَيَقُولُ يَا رَبِّ آمَنْتُ بِكَ وَبِكِتَابِكَ وَبِرُسُلِكَ\n وَصَلَّيْتُ وَصُمْتُ وَتَصَدَّقْتُ ‏.‏ وَيُثْنِي بِخَيْرٍ مَا اسْتَطَاعَ فَيَقُولُ هَا هُنَا إِذًا - قَالَ - ثُمَّ يُقَالُ\n لَهُ الآنَ نَبْعَثُ شَاهِدَنَا عَلَيْكَ ‏.‏ وَيَتَفَكَّرُ فِي نَفْسِهِ مَنْ ذَا الَّذِي يَشْهَدُ عَلَىَّ فَيُخْتَمُ عَلَى فِيهِ\n وَيُقَالُ لِفَخِذِهِ وَلَحْمِهِ وَعِظَامِهِ انْطِقِي فَتَنْطِقُ فَخِذُهُ وَلَحْمُهُ وَعِظَامُهُ بِعَمَلِهِ وَذَلِكَ لِيُعْذِرَ مِنْ\n نَفْسِهِ ‏.‏ وَذَلِكَ الْمُنَافِقُ وَذَلِكَ الَّذِي يَسْخَطُ اللَّهُ عَلَيْهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 22,
        "matchingEnglishURN": 270780,
        "last_updated": null
    },
    {
        "arabicURN": 376670,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2969",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ النَّضْرِ بْنِ أَبِي النَّضْرِ، حَدَّثَنِي أَبُو النَّضْرِ، هَاشِمُ بْنُ الْقَاسِمِ\n حَدَّثَنَا عُبَيْدُ اللَّهِ الأَشْجَعِيُّ، عَنْ سُفْيَانَ الثَّوْرِيِّ، عَنْ عُبَيْدٍ الْمُكْتِبِ، عَنْ فُضَيْلٍ، عَنِ الشَّعْبِيِّ،\n عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كُنَّا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَضَحِكَ فَقَالَ ‏\"‏ هَلْ\n تَدْرُونَ مِمَّ أَضْحَكُ ‏\"‏ ‏.‏ قَالَ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ مِنْ مُخَاطَبَةِ الْعَبْدِ رَبَّهُ يَقُولُ\n يَا رَبِّ أَلَمْ تُجِرْنِي مِنَ الظُّلْمِ قَالَ يَقُولُ بَلَى ‏.‏ قَالَ فَيَقُولُ فَإِنِّي لاَ أُجِيزُ عَلَى نَفْسِي إِلاَّ\n شَاهِدًا مِنِّي قَالَ فَيَقُولُ كَفَى بِنَفْسِكَ الْيَوْمَ عَلَيْكَ شَهِيدًا وَبِالْكِرَامِ الْكَاتِبِينَ شُهُودًا - قَالَ\n - فَيُخْتَمُ عَلَى فِيهِ فَيُقَالُ لأَرْكَانِهِ انْطِقِي ‏.‏ قَالَ فَتَنْطِقُ بِأَعْمَالِهِ - قَالَ - ثُمَّ يُخَلَّى بَيْنَهُ\n وَبَيْنَ الْكَلاَمِ - قَالَ - فَيَقُولُ بُعْدًا لَكُنَّ وَسُحْقًا ‏.‏ فَعَنْكُنَّ كُنْتُ أُنَاضِلُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 23,
        "matchingEnglishURN": 270790,
        "last_updated": null
    },
    {
        "arabicURN": 376680,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "1055 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ،\n عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ اجْعَلْ\n رِزْقَ آلِ مُحَمَّدٍ قُوتًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 24,
        "matchingEnglishURN": 270800,
        "last_updated": null
    },
    {
        "arabicURN": 376690,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "1055 c",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، وَأَبُو كُرَيْبٍ قَالُوا\n حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ\n قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ اجْعَلْ رِزْقَ آلِ مُحَمَّدٍ قُوتًا ‏\"‏ ‏.‏ وَفِي رِوَايَةِ\n عَمْرٍو ‏\"‏ اللَّهُمَّ ارْزُقْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 25,
        "matchingEnglishURN": 270810,
        "last_updated": null
    },
    {
        "arabicURN": 376700,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "1055 d",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "وَحَدَّثَنَاهُ أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ سَمِعْتُ الأَعْمَشَ، ذَكَرَ عَنْ عُمَارَةَ،\n بْنِ الْقَعْقَاعِ بِهَذَا الإِسْنَادِ وَقَالَ ‏\"‏ كَفَافًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 26,
        "matchingEnglishURN": 270820,
        "last_updated": null
    },
    {
        "arabicURN": 376710,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2970 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ، زُهَيْرٌ\n حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ مَا شَبِعَ آلُ مُحَمَّدٍ\n صلى الله عليه وسلم مُنْذُ قَدِمَ الْمَدِينَةَ مِنْ طَعَامِ بُرٍّ ثَلاَثَ لَيَالٍ تِبَاعًا حَتَّى قُبِضَ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 27,
        "matchingEnglishURN": 270830,
        "last_updated": null
    },
    {
        "arabicURN": 376720,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2970 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ قَالَ إِسْحَاقُ\n أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ،\n قَالَتْ مَا شَبِعَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثَلاَثَةَ أَيَّامٍ تِبَاعًا مِنْ خُبْزِ بُرٍّ حَتَّى مَضَى\n لِسَبِيلِهِ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 28,
        "matchingEnglishURN": 270840,
        "last_updated": null
    },
    {
        "arabicURN": 376730,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2970 c",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ،\n عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ، يُحَدِّثُ عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، أَنَّهَا\n قَالَتْ مَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مِنْ خُبْزِ شَعِيرٍ يَوْمَيْنِ مُتَتَابِعَيْنِ حَتَّى قُبِضَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 29,
        "matchingEnglishURN": 270850,
        "last_updated": null
    },
    {
        "arabicURN": 376740,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2970 d",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ،\n عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ مَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مِنْ خُبْزِ بُرٍّ فَوْقَ ثَلاَثٍ\n ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 30,
        "matchingEnglishURN": 270860,
        "last_updated": null
    },
    {
        "arabicURN": 376750,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2970 e",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ \n أَبِيهِ، قَالَ قَالَتْ عَائِشَةُ مَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مِنْ خُبْزِ الْبُرِّ ثَلاَثًا حَتَّى\n مَضَى لِسَبِيلِهِ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 31,
        "matchingEnglishURN": 270870,
        "last_updated": null
    },
    {
        "arabicURN": 376760,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2971",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، عَنْ مِسْعَرٍ، عَنْ هِلاَلِ بْنِ حُمَيْدٍ، عَنْ عُرْوَةَ، عَنْ \n عَائِشَةَ، قَالَتْ مَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم يَوْمَيْنِ مِنْ خُبْزِ بُرٍّ إِلاَّ وَأَحَدُهُمَا\n تَمْرٌ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 32,
        "matchingEnglishURN": 270880,
        "last_updated": null
    },
    {
        "arabicURN": 376770,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2972 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، قَالَ وَيَحْيَى بْنُ يَمَانٍ حَدَّثَنَا عَنْ \n هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ إِنْ كُنَّا آلَ مُحَمَّدٍ صلى الله عليه وسلم لَنَمْكُثُ\n شَهْرًا مَا نَسْتَوْقِدُ بِنَارٍ إِنْ هُوَ إِلاَّ التَّمْرُ وَالْمَاءُ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 33,
        "matchingEnglishURN": 270890,
        "last_updated": null
    },
    {
        "arabicURN": 376780,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2972 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، وَابْنُ، نُمَيْرٍ عَنْ \n هِشَامِ بْنِ عُرْوَةَ، بِهَذَا الإِسْنَادِ إِنْ كُنَّا لَنَمْكُثُ ‏.‏ وَلَمْ يَذْكُرْ آلَ مُحَمَّدٍ ‏.‏ وَزَادَ أَبُو كُرَيْبٍ فِي\n حَدِيثِهِ عَنِ ابْنِ نُمَيْرٍ إِلاَّ أَنْ يَأْتِيَنَا اللُّحَيْمُ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 34,
        "matchingEnglishURN": 270900,
        "last_updated": null
    },
    {
        "arabicURN": 376790,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2973",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ بْنِ كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ \n أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَمَا فِي رَفِّي مِنْ شَىْءٍ يَأْكُلُهُ\n ذُو كَبِدٍ إِلاَّ شَطْرُ شَعِيرٍ فِي رَفٍّ لِي فَأَكَلْتُ مِنْهُ حَتَّى طَالَ عَلَىَّ فَكِلْتُهُ فَفَنِيَ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 35,
        "matchingEnglishURN": 270910,
        "last_updated": null
    },
    {
        "arabicURN": 376800,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2972 c",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ يَزِيدَ بْنِ،\n رُومَانَ عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّهَا كَانَتْ تَقُولُ وَاللَّهِ يَا ابْنَ أُخْتِي إِنْ كُنَّا لَنَنْظُرُ إِلَى الْهِلاَلِ\n ثُمَّ الْهِلاَلِ ثُمَّ الْهِلاَلِ ثَلاَثَةَ أَهِلَّةٍ فِي شَهْرَيْنِ وَمَا أُوقِدَ فِي أَبْيَاتِ رَسُولِ اللَّهِ صلى الله عليه\n وسلم نَارٌ - قَالَ - قُلْتُ يَا خَالَةُ فَمَا كَانَ يُعَيِّشُكُمْ قَالَتِ الأَسْوَدَانِ التَّمْرُ وَالْمَاءُ إِلاَّ أَنَّهُ\n قَدْ كَانَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم جِيرَانٌ مِنَ الأَنْصَارِ وَكَانَتْ لَهُمْ مَنَائِحُ فَكَانُوا\n يُرْسِلُونَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ أَلْبَانِهَا فَيَسْقِينَاهُ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 36,
        "matchingEnglishURN": 270920,
        "last_updated": null
    },
    {
        "arabicURN": 376810,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2974",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي أَبُو صَخْرٍ، عَنْ يَزِيدَ،\n بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ ح وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أَبُو صَخْرٍ،\n عَنِ ابْنِ قُسَيْطٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ\n لَقَدْ مَاتَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَمَا شَبِعَ مِنْ خُبْزٍ وَزَيْتٍ فِي يَوْمٍ وَاحِدٍ مَرَّتَيْنِ\n ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 37,
        "matchingEnglishURN": 270930,
        "last_updated": null
    },
    {
        "arabicURN": 376821,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2975 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَكِّيُّ الْعَطَّارُ، عَنْ مَنْصُورٍ،\n عَنْ أُمِّهِ، عَنْ عَائِشَةَ، ح \n \n وَحَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ الْعَطَّارُ، حَدَّثَنِي مَنْصُورُ،\n بْنُ عَبْدِ الرَّحْمَنِ الْحَجَبِيُّ عَنْ أُمِّهِ، صَفِيَّةَ عَنْ عَائِشَةَ، قَالَتْ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم حِينَ شَبِعَ النَّاسُ مِنَ الأَسْوَدَيْنِ التَّمْرِ وَالْمَاءِ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 38,
        "matchingEnglishURN": 270940,
        "last_updated": null
    },
    {
        "arabicURN": 376840,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2975 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ مَنْصُورِ بْنِ صَفِيَّةَ،\n عَنْ أُمِّهِ، عَنْ عَائِشَةَ، قَالَتْ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَدْ شَبِعْنَا مِنَ الأَسْوَدَيْنِ\n الْمَاءِ وَالتَّمْرِ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 39,
        "matchingEnglishURN": 270950,
        "last_updated": null
    },
    {
        "arabicURN": 376850,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2975 c",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا الأَشْجَعِيُّ، ح وَحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، حَدَّثَنَا أَبُو أَحْمَدَ،\n كِلاَهُمَا عَنْ سُفْيَانَ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّ فِي، حَدِيثِهِمَا عَنْ سُفْيَانَ وَمَا شَبِعْنَا مِنَ الأَسْوَدَيْنِ\n ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 40,
        "matchingEnglishURN": 270960,
        "last_updated": null
    },
    {
        "arabicURN": 376860,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2976 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، وَابْنُ أَبِي عُمَرَ، قَالاَ حَدَّثَنَا مَرْوَانُ، - يَعْنِيَانِ الْفَزَارِيَّ -\n عَنْ يَزِيدَ، - وَهُوَ ابْنُ كَيْسَانَ - عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ وَالَّذِي نَفْسِي بِيَدِهِ\n - وَقَالَ ابْنُ عَبَّادٍ وَالَّذِي نَفْسُ أَبِي هُرَيْرَةَ بِيَدِهِ - مَا أَشْبَعَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم أَهْلَهُ ثَلاَثَةَ أَيَّامٍ تِبَاعًا مِنْ خُبْزِ حِنْطَةٍ حَتَّى فَارَقَ الدُّنْيَا ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 41,
        "matchingEnglishURN": 270970,
        "last_updated": null
    },
    {
        "arabicURN": 376870,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2976 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ يَزِيدَ بْنِ كَيْسَانَ، حَدَّثَنِي أَبُو\n حَازِمٍ قَالَ رَأَيْتُ أَبَا هُرَيْرَةَ يُشِيرُ بِإِصْبَعِهِ مِرَارًا يَقُولُ وَالَّذِي نَفْسُ أَبِي هُرَيْرَةَ بِيَدِهِ مَا\n شَبِعَ نَبِيُّ اللَّهِ صلى الله عليه وسلم وَأَهْلُهُ ثَلاَثَةَ أَيَّامٍ تِبَاعًا مِنْ خُبْزِ حِنْطَةٍ حَتَّى فَارَقَ\n الدُّنْيَا ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 42,
        "matchingEnglishURN": 270980,
        "last_updated": null
    },
    {
        "arabicURN": 376880,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2977 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالاَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ \n سِمَاكٍ، قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ، يَقُولُ أَلَسْتُمْ فِي طَعَامٍ وَشَرَابٍ مَا شِئْتُمْ لَقَدْ رَأَيْتُ\n نَبِيَّكُمْ صلى الله عليه وسلم وَمَا يَجِدُ مِنَ الدَّقَلِ مَا يَمْلأُ بِهِ بَطْنَهُ ‏.‏ وَقُتَيْبَةُ لَمْ يَذْكُرْ بِهِ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 43,
        "matchingEnglishURN": 270990,
        "last_updated": null
    },
    {
        "arabicURN": 376890,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2977 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا زُهَيْرٌ، ح وَحَدَّثَنَا إِسْحَاقُ،\n بْنُ إِبْرَاهِيمَ أَخْبَرَنَا الْمُلاَئِيُّ، حَدَّثَنَا إِسْرَائِيلُ، كِلاَهُمَا عَنْ سِمَاكٍ، بِهَذَا الإِسْنَادِ ‏.‏ نَحْوَهُ وَزَادَ\n فِي حَدِيثِ زُهَيْرٍ وَمَا تَرْضَوْنَ دُونَ أَلْوَانِ التَّمْرِ وَالزُّبْدِ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 44,
        "matchingEnglishURN": 271000,
        "last_updated": null
    },
    {
        "arabicURN": 376900,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2978",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ،\n بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، قَالَ سَمِعْتُ النُّعْمَانَ، يَخْطُبُ قَالَ ذَكَرَ عُمَرُ\n مَا أَصَابَ النَّاسُ مِنَ الدُّنْيَا فَقَالَ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَظَلُّ الْيَوْمَ\n يَلْتَوِي مَا يَجِدُ دَقَلاً يَمْلأُ بِهِ بَطْنَهُ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 45,
        "matchingEnglishURN": 271010,
        "last_updated": null
    },
    {
        "arabicURN": 376911,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "0.10",
        "hadithNumber": "2979 a, b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب ",
        "hadithText": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أَبُو\n هَانِئٍ سَمِعَ أَبَا عَبْدِ الرَّحْمَنِ الْحُبُلِيَّ، يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ، وَسَأَلَهُ،\n رَجُلٌ فَقَالَ أَلَسْنَا مِنْ فُقَرَاءِ الْمُهَاجِرِينَ فَقَالَ لَهُ عَبْدُ اللَّهِ أَلَكَ امْرَأَةٌ تَأْوِي إِلَيْهَا قَالَ نَعَمْ\n ‏.‏ قَالَ أَلَكَ مَسْكَنٌ تَسْكُنُهُ قَالَ نَعَمْ قَالَ فَأَنْتَ مِنَ الأَغْنِيَاءِ قَالَ فَإِنَّ لِي خَادِمًا قَالَ فَأَنْتَ\n مِنَ الْمُلُوكِ ‏.‏ \n \n قَالَ أَبُو عَبْدِ الرَّحْمَنِ وَجَاءَ ثَلاَثَةُ نَفَرٍ إِلَى عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ وَأَنَا\n عِنْدَهُ فَقَالُوا يَا أَبَا مُحَمَّدٍ إِنَّا وَاللَّهِ مَا نَقْدِرُ عَلَى شَىْءٍ لاَ نَفَقَةٍ وَلاَ دَابَّةٍ وَلاَ مَتَاعٍ ‏.‏ فَقَالَ\n لَهُمْ مَا شِئْتُمْ إِنْ شِئْتُمْ رَجَعْتُمْ إِلَيْنَا فَأَعْطَيْنَاكُمْ مَا يَسَّرَ اللَّهُ لَكُمْ وَإِنْ شِئْتُمْ ذَكَرْنَا أَمْرَكُمْ\n لِلسُّلْطَانِ وَإِنْ شِئْتُمْ صَبَرْتُمْ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنَّ فُقَرَاءَ\n الْمُهَاجِرِينَ يَسْبِقُونَ الأَغْنِيَاءَ يَوْمَ الْقِيَامَةِ إِلَى الْجَنَّةِ بِأَرْبَعِينَ خَرِيفًا ‏\"‏ ‏.‏ قَالُوا فَإِنَّا نَصْبِرُ\n لاَ نَسْأَلُ شَيْئًا ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 46,
        "matchingEnglishURN": 271020,
        "last_updated": null
    },
    {
        "arabicURN": 376930,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "1.00",
        "hadithNumber": "2980 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب لاَ تَدْخُلُوا مَسَاكِنَ الَّذِينَ ظَلَمُوا أَنْفُسَهُمْ إِلاَّ أَنْ تَكُونُوا بَاكِينَ ‏.‏ ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، جَمِيعًا عَنْ إِسْمَاعِيلَ،\n قَالَ ابْنُ أَيُّوبَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ دِينَارٍ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ،\n بْنَ عُمَرَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَصْحَابِ الْحِجْرِ ‏\"‏ لاَ تَدْخُلُوا عَلَى\n هَؤُلاَءِ الْقَوْمِ الْمُعَذَّبِينَ إِلاَّ أَنْ تَكُونُوا بَاكِينَ فَإِنْ لَمْ تَكُونُوا بَاكِينَ فَلاَ تَدْخُلُوا عَلَيْهِمْ أَنْ\n يُصِيبَكُمْ مِثْلُ مَا أَصَابَهُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 47,
        "matchingEnglishURN": 271030,
        "last_updated": null
    },
    {
        "arabicURN": 376940,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "1.00",
        "hadithNumber": "2980 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب لاَ تَدْخُلُوا مَسَاكِنَ الَّذِينَ ظَلَمُوا أَنْفُسَهُمْ إِلاَّ أَنْ تَكُونُوا بَاكِينَ ‏.‏ ",
        "hadithText": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، -\n وَهُوَ يَذْكُرُ الْحِجْرَ مَسَاكِنَ ثَمُودَ - قَالَ سَالِمُ بْنُ عَبْدِ اللَّهِ إِنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ قَالَ مَرَرْنَا\n مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى الْحِجْرِ فَقَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم\n ‏\"‏ لاَ تَدْخُلُوا مَسَاكِنَ الَّذِينَ ظَلَمُوا أَنْفُسَهُمْ إِلاَّ أَنْ تَكُونُوا بَاكِينَ حَذَرًا أَنْ يُصِيبَكُمْ مِثْلُ مَا\n أَصَابَهُمْ ‏\"‏ ‏.‏ ثُمَّ زَجَرَ فَأَسْرَعَ حَتَّى خَلَّفَهَا ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 48,
        "matchingEnglishURN": 271040,
        "last_updated": null
    },
    {
        "arabicURN": 376950,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "1.00",
        "hadithNumber": "2981 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب لاَ تَدْخُلُوا مَسَاكِنَ الَّذِينَ ظَلَمُوا أَنْفُسَهُمْ إِلاَّ أَنْ تَكُونُوا بَاكِينَ ‏.‏ ",
        "hadithText": "حَدَّثَنِي الْحَكَمُ بْنُ مُوسَى أَبُو صَالِحٍ، حَدَّثَنَا شُعَيْبُ بْنُ إِسْحَاقَ، أَخْبَرَنَا عُبَيْدُ اللَّهِ،\n عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، أَخْبَرَهُ أَنَّ النَّاسَ نَزَلُوا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم\n عَلَى الْحِجْرِ أَرْضِ ثَمُودَ فَاسْتَقَوْا مِنْ آبَارِهَا وَعَجَنُوا بِهِ الْعَجِينَ فَأَمَرَهُمْ رَسُولُ اللَّهِ صلى\n الله عليه وسلم أَنْ يُهَرِيقُوا مَا اسْتَقَوْا وَيَعْلِفُوا الإِبِلَ الْعَجِينَ وَأَمَرَهُمْ أَنْ يَسْتَقُوا مِنَ الْبِئْرِ\n الَّتِي كَانَتْ تَرِدُهَا النَّاقَةُ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 49,
        "matchingEnglishURN": 271050,
        "last_updated": null
    },
    {
        "arabicURN": 376960,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "1.00",
        "hadithNumber": "2981 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب لاَ تَدْخُلُوا مَسَاكِنَ الَّذِينَ ظَلَمُوا أَنْفُسَهُمْ إِلاَّ أَنْ تَكُونُوا بَاكِينَ ‏.‏ ",
        "hadithText": "وَحَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، حَدَّثَنِي عُبَيْدُ اللَّهِ،\n بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ غَيْرَ أَنَّهُ قَالَ فَاسْتَقَوْا مِنْ بِئَارِهَا وَاعْتَجَنُوا بِهِ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 50,
        "matchingEnglishURN": 271060,
        "last_updated": null
    },
    {
        "arabicURN": 376970,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "2.00",
        "hadithNumber": "2982",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب الإِحْسَانِ إِلَى الأَرْمَلَةِ وَالْمِسْكِينِ وَالْيَتِيمِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا مَالِكٌ، عَنْ ثَوْرِ بْنِ زَيْدٍ، عَنْ أَبِي الْغَيْثِ،\n عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ السَّاعِي عَلَى الأَرْمَلَةِ وَالْمِسْكِينِ\n كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ - وَأَحْسِبُهُ قَالَ - وَكَالْقَائِمِ لاَ يَفْتُرُ وَكَالصَّائِمِ لاَ يُفْطِرُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 51,
        "matchingEnglishURN": 271070,
        "last_updated": null
    },
    {
        "arabicURN": 376980,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "2.00",
        "hadithNumber": "2983",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب الإِحْسَانِ إِلَى الأَرْمَلَةِ وَالْمِسْكِينِ وَالْيَتِيمِ ",
        "hadithText": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى، حَدَّثَنَا مَالِكٌ، عَنْ ثَوْرِ بْنِ زَيْدٍ،\n الدِّيلِيِّ قَالَ سَمِعْتُ أَبَا الْغَيْثِ، يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم ‏\"‏ كَافِلُ الْيَتِيمِ لَهُ أَوْ لِغَيْرِهِ أَنَا وَهُوَ كَهَاتَيْنِ فِي الْجَنَّةِ ‏\"‏ ‏.‏ وَأَشَارَ مَالِكٌ بِالسَّبَّابَةِ\n وَالْوُسْطَى ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 52,
        "matchingEnglishURN": 271080,
        "last_updated": null
    },
    {
        "arabicURN": 376990,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "3.00",
        "hadithNumber": "533 c",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب فَضْلِ بِنَاءِ الْمَسَاجِدِ ",
        "hadithText": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي \n عَمْرٌو، - وَهُوَ ابْنُ الْحَارِثِ - أَنَّ بُكَيْرًا، حَدَّثَهُ أَنَّ عَاصِمَ بْنَ عُمَرَ بْنِ قَتَادَةَ حَدَّثَهُ أَنَّهُ، سَمِعَ \n عُبَيْدَ اللَّهِ الْخَوْلاَنِيَّ، يَذْكُرُ أَنَّهُ سَمِعَ عُثْمَانَ بْنَ عَفَّانَ، عِنْدَ قَوْلِ النَّاسِ فِيهِ حِينَ بَنَى مَسْجِدَ\n رَسُولِ اللَّهِ صلى الله عليه وسلم إِنَّكُمْ قَدْ أَكْثَرْتُمْ وَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه\n وسلم يَقُولُ ‏\"‏ مَنْ بَنَى مَسْجِدًا - قَالَ بُكَيْرٌ حَسِبْتُ أَنَّهُ قَالَ - يَبْتَغِي بِهِ وَجْهَ اللَّهِ بَنَى اللَّهُ\n لَهُ مِثْلَهُ فِي الْجَنَّةِ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ هَارُونَ ‏\"‏ بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 53,
        "matchingEnglishURN": 271090,
        "last_updated": null
    },
    {
        "arabicURN": 377000,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "3.00",
        "hadithNumber": "533 d",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب فَضْلِ بِنَاءِ الْمَسَاجِدِ ",
        "hadithText": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، كِلاَهُمَا عَنِ الضَّحَّاكِ، - قَالَ ابْنُ الْمُثَنَّى\n حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ، - أَخْبَرَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، حَدَّثَنِي أَبِي، عَنْ مَحْمُودِ بْنِ لَبِيدٍ،\n أَنَّ عُثْمَانَ بْنَ عَفَّانَ، أَرَادَ بِنَاءَ الْمَسْجِدِ فَكَرِهَ النَّاسُ ذَلِكَ وَأَحَبُّوا أَنْ يَدَعَهُ عَلَى هَيْئَتِهِ\n فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنْ بَنَى مَسْجِدًا لِلَّهِ بَنَى اللَّهُ لَهُ فِي\n الْجَنَّةِ مِثْلَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 54,
        "matchingEnglishURN": 271100,
        "last_updated": null
    },
    {
        "arabicURN": 377010,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "3.00",
        "hadithNumber": "533 e",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب فَضْلِ بِنَاءِ الْمَسَاجِدِ ",
        "hadithText": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ، وَعَبْدُ الْمَلِكِ بْنُ،\n الصَّبَّاحِ كِلاَهُمَا عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّ فِي، حَدِيثِهِمَا ‏\"‏ بَنَى اللَّهُ\n لَهُ بَيْتًا فِي الْجَنَّةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 55,
        "matchingEnglishURN": 271110,
        "last_updated": null
    },
    {
        "arabicURN": 377020,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "4.00",
        "hadithNumber": "2984 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب الصَّدَقَةِ فِي الْمَسَاكِينِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لأَبِي بَكْرٍ - قَالاَ حَدَّثَنَا \n يَزِيدُ بْنُ هَارُونَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، عَنْ وَهْبِ بْنِ كَيْسَانَ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ،\n اللَّيْثِيِّ عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَا رَجُلٌ بِفَلاَةٍ مِنَ الأَرْضِ\n فَسَمِعَ صَوْتًا فِي سَحَابَةٍ اسْقِ حَدِيقَةَ فُلاَنٍ ‏.‏ فَتَنَحَّى ذَلِكَ السَّحَابُ فَأَفْرَغَ مَاءَهُ فِي حَرَّةٍ\n فَإِذَا شَرْجَةٌ مِنْ تِلْكَ الشِّرَاجِ قَدِ اسْتَوْعَبَتْ ذَلِكَ الْمَاءَ كُلَّهُ فَتَتَبَّعَ الْمَاءَ فَإِذَا رَجُلٌ قَائِمٌ\n فِي حَدِيقَتِهِ يُحَوِّلُ الْمَاءَ بِمِسْحَاتِهِ فَقَالَ لَهُ يَا عَبْدَ اللَّهِ مَا اسْمُكَ قَالَ فُلاَنٌ ‏.‏ لِلاِسْمِ الَّذِي\n سَمِعَ فِي السَّحَابَةِ فَقَالَ لَهُ يَا عَبْدَ اللَّهِ لِمَ تَسْأَلُنِي عَنِ اسْمِي فَقَالَ إِنِّي سَمِعْتُ صَوْتًا\n فِي السَّحَابِ الَّذِي هَذَا مَاؤُهُ يَقُولُ اسْقِ حَدِيقَةَ فُلاَنٍ لاِسْمِكَ فَمَا تَصْنَعُ فِيهَا قَالَ أَمَّا\n إِذَا قُلْتَ هَذَا فَإِنِّي أَنْظُرُ إِلَى مَا يَخْرُجُ مِنْهَا فَأَتَصَدَّقُ بِثُلُثِهِ وَآكُلُ أَنَا وَعِيَالِي ثُلُثًا وَأَرُدُّ\n فِيهَا ثُلُثَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 56,
        "matchingEnglishURN": 271120,
        "last_updated": null
    },
    {
        "arabicURN": 377030,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "4.00",
        "hadithNumber": "2984 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب الصَّدَقَةِ فِي الْمَسَاكِينِ ",
        "hadithText": "وَحَدَّثَنَاهُ أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ، أَخْبَرَنَا أَبُو دَاوُدَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ،\n حَدَّثَنَا وَهْبُ بْنُ كَيْسَانَ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ قَالَ ‏\"‏ وَأَجْعَلُ ثُلُثَهُ فِي الْمَسَاكِينِ وَالسَّائِلِينَ\n وَابْنِ السَّبِيلِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 57,
        "matchingEnglishURN": 271130,
        "last_updated": null
    },
    {
        "arabicURN": 377040,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "5.00",
        "hadithNumber": "2985",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب مَنْ أَشْرَكَ فِي عَمَلِهِ غَيْرَ اللَّهِ ",
        "hadithText": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا رَوْحُ بْنُ الْقَاسِمِ،\n عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَعْقُوبَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم ‏\"‏ قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى أَنَا أَغْنَى الشُّرَكَاءِ عَنِ الشِّرْكِ مَنْ عَمِلَ عَمَلاً\n أَشْرَكَ فِيهِ مَعِي غَيْرِي تَرَكْتُهُ وَشِرْكَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 58,
        "matchingEnglishURN": 271140,
        "last_updated": null
    },
    {
        "arabicURN": 377050,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "5.00",
        "hadithNumber": "2986",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب مَنْ أَشْرَكَ فِي عَمَلِهِ غَيْرَ اللَّهِ ",
        "hadithText": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنِي أَبِي، عَنْ إِسْمَاعِيلَ بْنِ سُمَيْعٍ، عَنْ مُسْلِمٍ،\n الْبَطِينِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n ‏\"‏ مَنْ سَمَّعَ سَمَّعَ اللَّهُ بِهِ وَمَنْ رَاءَى رَاءَى اللَّهُ بِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 59,
        "matchingEnglishURN": 271150,
        "last_updated": null
    },
    {
        "arabicURN": 377060,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "5.00",
        "hadithNumber": "2987 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب مَنْ أَشْرَكَ فِي عَمَلِهِ غَيْرَ اللَّهِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، قَالَ\n سَمِعْتُ جُنْدُبًا الْعَلَقِيَّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ يُسَمِّعْ يُسَمِّعِ اللَّهُ\n بِهِ وَمَنْ يُرَائِي يُرَائِي اللَّهُ بِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 60,
        "matchingEnglishURN": 271160,
        "last_updated": null
    },
    {
        "arabicURN": 377070,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "5.00",
        "hadithNumber": "2987 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب مَنْ أَشْرَكَ فِي عَمَلِهِ غَيْرَ اللَّهِ ",
        "hadithText": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا الْمُلاَئِيُّ، حَدَّثَنَا سُفْيَانُ، بِهَذَا الإِسْنَادِ وَزَادَ\n وَلَمْ أَسْمَعْ أَحَدًا غَيْرَهُ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 61,
        "matchingEnglishURN": 271170,
        "last_updated": null
    },
    {
        "arabicURN": 377080,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "5.00",
        "hadithNumber": "2987 c",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب مَنْ أَشْرَكَ فِي عَمَلِهِ غَيْرَ اللَّهِ ",
        "hadithText": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الأَشْعَثِيُّ، أَخْبَرَنَا سُفْيَانُ، عَنِ الْوَلِيدِ بْنِ حَرْبٍ، - قَالَ سَعِيدٌ\n أَظُنُّهُ قَالَ ابْنُ الْحَارِثِ بْنِ أَبِي مُوسَى - قَالَ سَمِعْتُ سَلَمَةَ بْنَ كُهَيْلٍ، قَالَ سَمِعْتُ جُنْدُبًا،\n - وَلَمْ أَسْمَعْ أَحَدًا يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم غَيْرَهُ - يَقُولُ سَمِعْتُ\n رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ بِمِثْلِ حَدِيثِ الثَّوْرِيِّ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 62,
        "matchingEnglishURN": 271180,
        "last_updated": null
    },
    {
        "arabicURN": 377090,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "5.00",
        "hadithNumber": "2987 d",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب مَنْ أَشْرَكَ فِي عَمَلِهِ غَيْرَ اللَّهِ ",
        "hadithText": "وَحَدَّثَنَاهُ ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الصَّدُوقُ الأَمِينُ الْوَلِيدُ بْنُ حَرْبٍ، بِهَذَا\n الإِسْنَادِ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 63,
        "matchingEnglishURN": 271190,
        "last_updated": null
    },
    {
        "arabicURN": 377100,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "6.00",
        "hadithNumber": "2988 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب التَّكَلُّمِ بِالْكَلِمَةِ يَهْوِي بِهَا فِي النَّارِ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا بَكْرٌ، - يَعْنِي ابْنَ مُضَرَ - عَنِ ابْنِ الْهَادِ، عَنْ مُحَمَّدِ،\n بْنِ إِبْرَاهِيمَ عَنْ عِيسَى بْنِ طَلْحَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم\n يَقُولُ ‏\"‏ إِنَّ الْعَبْدَ لَيَتَكَلَّمُ بِالْكَلِمَةِ يَنْزِلُ بِهَا فِي النَّارِ أَبْعَدَ مَا بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 64,
        "matchingEnglishURN": 271200,
        "last_updated": null
    },
    {
        "arabicURN": 377110,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "6.00",
        "hadithNumber": "2988 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب التَّكَلُّمِ بِالْكَلِمَةِ يَهْوِي بِهَا فِي النَّارِ ",
        "hadithText": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ الدَّرَاوَرْدِيُّ، عَنْ يَزِيدَ بْنِ،\n الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عِيسَى بْنِ طَلْحَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى\n الله عليه وسلم قَالَ ‏\"‏ إِنَّ الْعَبْدَ لَيَتَكَلَّمُ بِالْكَلِمَةِ مَا يَتَبَيَّنُ مَا فِيهَا يَهْوِي بِهَا فِي النَّارِ أَبْعَدَ\n مَا بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 65,
        "matchingEnglishURN": 271210,
        "last_updated": null
    },
    {
        "arabicURN": 377120,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "7.00",
        "hadithNumber": "2989 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب عُقُوبَةِ مَنْ يَأْمُرُ بِالْمَعْرُوفِ وَلاَ يَفْعَلُهُ وَيَنْهَى عَنِ الْمُنْكَرِ وَيَفْعَلُهُ ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَإِسْحَاقُ\n بْنُ إِبْرَاهِيمَ وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لأَبِي كُرَيْبٍ - قَالَ يَحْيَى وَإِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرُونَ\n حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الأَعْمَشُ عَنْ شَقِيقٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ قَالَ قِيلَ لَهُ أَلاَ تَدْخُلُ\n عَلَى عُثْمَانَ فَتُكَلِّمَهُ فَقَالَ أَتُرَوْنَ أَنِّي لاَ أُكَلِّمُهُ إِلاَّ أُسْمِعُكُمْ وَاللَّهِ لَقَدْ كَلَّمْتُهُ فِيمَا بَيْنِي وَبَيْنَهُ\n مَا دُونَ أَنْ أَفْتَتِحَ أَمْرًا لاَ أُحِبُّ أَنْ أَكُونَ أَوَّلَ مَنْ فَتَحَهُ وَلاَ أَقُولُ لأَحَدٍ يَكُونُ عَلَىَّ أَمِيرًا\n إِنَّهُ خَيْرُ النَّاسِ ‏.‏ بَعْدَ مَا سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ يُؤْتَى بِالرَّجُلِ\n يَوْمَ الْقِيَامَةِ فَيُلْقَى فِي النَّارِ فَتَنْدَلِقُ أَقْتَابُ بَطْنِهِ فَيَدُورُ بِهَا كَمَا يَدُورُ الْحِمَارُ بِالرَّحَى\n فَيَجْتَمِعُ إِلَيْهِ أَهْلُ النَّارِ فَيَقُولُونَ يَا فُلاَنُ مَا لَكَ أَلَمْ تَكُنْ تَأْمُرُ بِالْمَعْرُوفِ وَتَنْهَى عَنِ الْمُنْكَرِ\n فَيَقُولُ بَلَى قَدْ كُنْتُ آمُرُ بِالْمَعْرُوفِ وَلاَ آتِيهِ وَأَنْهَى عَنِ الْمُنْكَرِ وَآتِيهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 66,
        "matchingEnglishURN": 271220,
        "last_updated": null
    },
    {
        "arabicURN": 377130,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "7.00",
        "hadithNumber": "2989 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب عُقُوبَةِ مَنْ يَأْمُرُ بِالْمَعْرُوفِ وَلاَ يَفْعَلُهُ وَيَنْهَى عَنِ الْمُنْكَرِ وَيَفْعَلُهُ ",
        "hadithText": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، قَالَ كُنَّا\n عِنْدَ أُسَامَةَ بْنِ زَيْدٍ فَقَالَ رَجُلٌ مَا يَمْنَعُكَ أَنْ تَدْخُلَ عَلَى عُثْمَانَ فَتُكَلِّمَهُ فِيمَا يَصْنَعُ وَسَاقَ\n الْحَدِيثَ بِمِثْلِهِ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 67,
        "matchingEnglishURN": 271230,
        "last_updated": null
    },
    {
        "arabicURN": 377140,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "8.00",
        "hadithNumber": "2990",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب النَّهْىِ عَنْ هَتْكِ الإِنْسَانِ، سِتْرَ نَفْسِهِ ",
        "hadithText": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ حَاتِمٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ حَدَّثَنِي وَقَالَ،\n الآخَرَانِ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ، عَنْ عَمِّهِ، قَالَ قَالَ سَالِمٌ\n سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ كُلُّ أُمَّتِي مُعَافَاةٌ\n إِلاَّ الْمُجَاهِرِينَ وَإِنَّ مِنَ الإِجْهَارِ أَنْ يَعْمَلَ الْعَبْدُ بِاللَّيْلِ عَمَلاً ثُمَّ يُصْبِحُ قَدْ سَتَرَهُ رَبُّهُ فَيَقُولُ\n يَا فُلاَنُ قَدْ عَمِلْتُ الْبَارِحَةَ كَذَا وَكَذَا وَقَدْ بَاتَ يَسْتُرُهُ رَبُّهُ فَيَبِيتُ يَسْتُرُهُ رَبُّهُ وَيُصْبِحُ يَكْشِفُ\n سِتْرَ اللَّهِ عَنْهُ ‏\"‏ ‏.‏ قَالَ زُهَيْرٌ ‏\"‏ وَإِنَّ مِنَ الْهِجَارِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 68,
        "matchingEnglishURN": 271240,
        "last_updated": null
    },
    {
        "arabicURN": 377150,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "9.00",
        "hadithNumber": "2991 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب تَشْمِيتِ الْعَاطِسِ وَكَرَاهَةِ التَّثَاؤُبِ ",
        "hadithText": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا حَفْصٌ، - وَهُوَ ابْنُ غِيَاثٍ - عَنْ سُلَيْمَانَ،\n التَّيْمِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ عَطَسَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم رَجُلاَنِ فَشَمَّتَ أَحَدَهُمَا\n وَلَمْ يُشَمِّتِ الآخَرَ فَقَالَ الَّذِي لَمْ يُشَمِّتْهُ عَطَسَ فُلاَنٌ فَشَمَّتَّهُ وَعَطَسْتُ أَنَا فَلَمْ تُشَمِّتْنِي ‏.‏\n قَالَ ‏\"‏ إِنَّ هَذَا حَمِدَ اللَّهَ وَإِنَّكَ لَمْ تَحْمَدِ اللَّهَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 69,
        "matchingEnglishURN": 271250,
        "last_updated": null
    },
    {
        "arabicURN": 377160,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "9.00",
        "hadithNumber": "2991 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب تَشْمِيتِ الْعَاطِسِ وَكَرَاهَةِ التَّثَاؤُبِ ",
        "hadithText": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو خَالِدٍ، - يَعْنِي الأَحْمَرَ - عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ \n أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 70,
        "matchingEnglishURN": 271260,
        "last_updated": null
    },
    {
        "arabicURN": 377170,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "9.00",
        "hadithNumber": "2992",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب تَشْمِيتِ الْعَاطِسِ وَكَرَاهَةِ التَّثَاؤُبِ ",
        "hadithText": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، - وَاللَّفْظُ لِزُهَيْرٍ - قَالاَ حَدَّثَنَا \n الْقَاسِمُ بْنُ مَالِكٍ، عَنْ عَاصِمِ بْنِ كُلَيْبٍ، عَنْ أَبِي بُرْدَةَ، قَالَ دَخَلْتُ عَلَى أَبِي مُوسَى وَهْوَ فِي\n بَيْتِ بِنْتِ الْفَضْلِ بْنِ عَبَّاسٍ فَعَطَسْتُ فَلَمْ يُشَمِّتْنِي وَعَطَسَتْ فَشَمَّتَهَا فَرَجَعْتُ إِلَى أُمِّي\n فَأَخْبَرْتُهَا فَلَمَّا جَاءَهَا قَالَتْ عَطَسَ عِنْدَكَ ابْنِي فَلَمْ تُشَمِّتْهُ وَعَطَسَتْ فَشَمَّتَّهَا ‏.‏ فَقَالَ\n إِنَّ ابْنَكِ عَطَسَ فَلَمْ يَحْمَدِ اللَّهَ فَلَمْ أُشَمِّتْهُ وَعَطَسَتْ فَحَمِدَتِ اللَّهَ فَشَمَّتُّهَا سَمِعْتُ رَسُولَ\n اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِذَا عَطَسَ أَحَدُكُمْ فَحَمِدَ اللَّهَ فَشَمِّتُوهُ فَإِنْ لَمْ يَحْمَدِ اللَّهَ\n فَلاَ تُشَمِّتُوهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 71,
        "matchingEnglishURN": 271270,
        "last_updated": null
    },
    {
        "arabicURN": 377181,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "9.00",
        "hadithNumber": "2993",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب تَشْمِيتِ الْعَاطِسِ وَكَرَاهَةِ التَّثَاؤُبِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، عَنْ إِيَاسِ،\n بْنِ سَلَمَةَ بْنِ الأَكْوَعِ عَنْ أَبِيهِ، ح \n \n وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبُو النَّضْرِ، هَاشِمُ بْنُ الْقَاسِمِ\n حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، حَدَّثَنِي إِيَاسُ بْنُ سَلَمَةَ بْنِ الأَكْوَعِ، أَنَّ أَبَاهُ، حَدَّثَهُ أَنَّهُ، سَمِعَ النَّبِيَّ\n صلى الله عليه وسلم وَعَطَسَ رَجُلٌ عِنْدَهُ فَقَالَ لَهُ ‏\"‏ يَرْحَمُكَ اللَّهُ ‏\"‏ ‏.‏ ثُمَّ عَطَسَ أُخْرَى\n فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الرَّجُلُ مَزْكُومٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 72,
        "matchingEnglishURN": 271280,
        "last_updated": null
    },
    {
        "arabicURN": 377200,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "9.00",
        "hadithNumber": "2994",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب تَشْمِيتِ الْعَاطِسِ وَكَرَاهَةِ التَّثَاؤُبِ ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، قَالُوا حَدَّثَنَا \n إِسْمَاعِيلُ، - يَعْنُونَ ابْنَ جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى\n الله عليه وسلم قَالَ ‏\"‏ التَّثَاؤُبُ مِنَ الشَّيْطَانِ فَإِذَا تَثَاءَبَ أَحَدُكُمْ فَلْيَكْظِمْ مَا اسْتَطَاعَ ‏\"‏\n ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 73,
        "matchingEnglishURN": 271290,
        "last_updated": null
    },
    {
        "arabicURN": 377210,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "9.00",
        "hadithNumber": "2995 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب تَشْمِيتِ الْعَاطِسِ وَكَرَاهَةِ التَّثَاؤُبِ ",
        "hadithText": "حَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، مَالِكُ بْنُ عَبْدِ الْوَاحِدِ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا \n سُهَيْلُ بْنُ أَبِي صَالِحٍ، قَالَ سَمِعْتُ ابْنًا، لأَبِي سَعِيدٍ الْخُدْرِيِّ يُحَدِّثُ أَبِي عَنْ أَبِيهِ، قَالَ قَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا تَثَاوَبَ أَحَدُكُمْ فَلْيُمْسِكْ بِيَدِهِ عَلَى فِيهِ فَإِنَّ الشَّيْطَانَ\n يَدْخُلُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 74,
        "matchingEnglishURN": 271300,
        "last_updated": null
    },
    {
        "arabicURN": 377220,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "9.00",
        "hadithNumber": "2995 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب تَشْمِيتِ الْعَاطِسِ وَكَرَاهَةِ التَّثَاؤُبِ ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ سُهَيْلٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي،\n سَعِيدٍ عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا تَثَاوَبَ أَحَدُكُمْ فَلْيُمْسِكْ بِيَدِهِ\n فَإِنَّ الشَّيْطَانَ يَدْخُلُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 75,
        "matchingEnglishURN": 271310,
        "last_updated": null
    },
    {
        "arabicURN": 377230,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "9.00",
        "hadithNumber": "2995 c",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب تَشْمِيتِ الْعَاطِسِ وَكَرَاهَةِ التَّثَاؤُبِ ",
        "hadithText": "حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ،\n عَنِ ابْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا تَثَاوَبَ\n أَحَدُكُمْ فِي الصَّلاَةِ فَلْيَكْظِمْ مَا اسْتَطَاعَ فَإِنَّ الشَّيْطَانَ يَدْخُلُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 76,
        "matchingEnglishURN": 271320,
        "last_updated": null
    },
    {
        "arabicURN": 377240,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "9.00",
        "hadithNumber": "2995 d",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب تَشْمِيتِ الْعَاطِسِ وَكَرَاهَةِ التَّثَاؤُبِ ",
        "hadithText": "حَدَّثَنَاهُ عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، أَوْ عَنِ ابْنِ أَبِي،\n سَعِيدٍ عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ بِشْرٍ وَعَبْدِ\n الْعَزِيزِ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 77,
        "matchingEnglishURN": 271330,
        "last_updated": null
    },
    {
        "arabicURN": 377250,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "10.00",
        "hadithNumber": "2996",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب فِي أَحَادِيثَ مُتَفَرِّقَةٍ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ، حَدَّثَنَا \n عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم ‏\"‏ خُلِقَتِ الْمَلاَئِكَةُ مِنْ نُورٍ وَخُلِقَ الْجَانُّ مِنْ مَارِجٍ مِنْ نَارٍ وَخُلِقَ آدَمُ مِمَّا\n وُصِفَ لَكُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 78,
        "matchingEnglishURN": 271340,
        "last_updated": null
    },
    {
        "arabicURN": 377260,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "11.00",
        "hadithNumber": "2997 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب فِي الْفَأْرِ وَأَنَّهُ مَسْخٌ ",
        "hadithText": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرُّزِّيُّ،\n جَمِيعًا عَنِ الثَّقَفِيِّ، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا خَالِدٌ، عَنْ مُحَمَّدِ بْنِ،\n سِيرِينَ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فُقِدَتْ أُمَّةٌ مِنْ بَنِي\n إِسْرَائِيلَ لاَ يُدْرَى مَا فَعَلَتْ وَلاَ أُرَاهَا إِلاَّ الْفَأْرَ أَلاَ تَرَوْنَهَا إِذَا وُضِعَ لَهَا أَلْبَانُ الإِبِلِ لَمْ\n تَشْرَبْهُ وَإِذَا وُضِعَ لَهَا أَلْبَانُ الشَّاءِ شَرِبَتْهُ ‏\"‏ ‏.‏ قَالَ أَبُو هُرَيْرَةَ فَحَدَّثْتُ هَذَا الْحَدِيثَ كَعْبًا\n فَقَالَ آنْتَ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قُلْتُ نَعَمْ ‏.‏ قَالَ ذَلِكَ مِرَارًا ‏.‏ قُلْتُ\n أَأَقْرَأُ التَّوْرَاةَ قَالَ إِسْحَاقُ فِي رِوَايَتِهِ ‏\"‏ لاَ نَدْرِي مَا فَعَلَتْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 79,
        "matchingEnglishURN": 271350,
        "last_updated": null
    },
    {
        "arabicURN": 377270,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "11.00",
        "hadithNumber": "2997 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب فِي الْفَأْرِ وَأَنَّهُ مَسْخٌ ",
        "hadithText": "وَحَدَّثَنِي أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ مُحَمَّدٍ، عَنْ \n أَبِي هُرَيْرَةَ، قَالَ ‏\"‏ الْفَأْرَةُ مَسْخٌ وَآيَةُ ذَلِكَ أَنَّهُ يُوضَعُ بَيْنَ يَدَيْهَا لَبَنُ الْغَنَمِ فَتَشْرَبُهُ وَيُوضَعُ\n بَيْنَ يَدَيْهَا لَبَنُ الإِبِلِ فَلاَ تَذُوقُهُ ‏\"‏ ‏.‏ فَقَالَ لَهُ كَعْبٌ أَسَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله\n عليه وسلم قَالَ أَفَأُنْزِلَتْ عَلَىَّ التَّوْرَاةُ",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 80,
        "matchingEnglishURN": 271360,
        "last_updated": null
    },
    {
        "arabicURN": 377281,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "12.00",
        "hadithNumber": "2998 a, b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب لاَ يُلْدَغُ الْمُؤْمِنُ مِنْ جُحْرٍ مَرَّتَيْنِ",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ \n أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يُلْدَغُ الْمُؤْمِنُ مِنْ جُحْرٍ وَاحِدٍ مَرَّتَيْنِ\n ‏\"‏ ‏.‏ \n \n وَحَدَّثَنِيهِ أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، ح\n وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ حَاتِمٍ، قَالاَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي،\n ابْنِ شِهَابٍ عَنْ عَمِّهِ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ\n ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 81,
        "matchingEnglishURN": 271370,
        "last_updated": null
    },
    {
        "arabicURN": 377300,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "13.00",
        "hadithNumber": "2999",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب الْمُؤْمِنُ أَمْرُهُ كُلُّهُ خَيْرٌ ",
        "hadithText": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ الأَزْدِيُّ، وَشَيْبَانُ بْنُ فَرُّوخَ، جَمِيعًا عَنْ سُلَيْمَانَ بْنِ الْمُغِيرَةِ،\n - وَاللَّفْظُ لِشَيْبَانَ - حَدَّثَنَا سُلَيْمَانُ، حَدَّثَنَا ثَابِتٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ صُهَيْبٍ،\n قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ عَجَبًا لأَمْرِ الْمُؤْمِنِ إِنَّ أَمْرَهُ كُلَّهُ خَيْرٌ وَلَيْسَ\n ذَاكَ لأَحَدٍ إِلاَّ لِلْمُؤْمِنِ إِنْ أَصَابَتْهُ سَرَّاءُ شَكَرَ فَكَانَ خَيْرًا لَهُ وَإِنْ أَصَابَتْهُ ضَرَّاءُ صَبَرَ فَكَانَ\n خَيْرًا لَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 82,
        "matchingEnglishURN": 271380,
        "last_updated": null
    },
    {
        "arabicURN": 377310,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "14.00",
        "hadithNumber": "3000 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب النَّهْىِ عَنِ الْمَدْحِ، إِذَا كَانَ فِيهِ إِفْرَاطٌ وَخِيفَ مِنْهُ فِتْنَةٌ عَلَى الْمَمْدُوحِ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ عَبْدِ الرَّحْمَنِ،\n بْنِ أَبِي بَكْرَةَ عَنْ أَبِيهِ، قَالَ مَدَحَ رَجُلٌ رَجُلاً عِنْدَ النَّبِيِّ صلى الله عليه وسلم - قَالَ -\n فَقَالَ ‏\"‏ وَيْحَكَ قَطَعْتَ عُنُقَ صَاحِبِكَ قَطَعْتَ عُنُقَ صَاحِبِكَ ‏\"‏ ‏.‏ مِرَارًا ‏\"‏ إِذَا كَانَ أَحَدُكُمْ\n مَادِحًا صَاحِبَهُ لاَ مَحَالَةَ فَلْيَقُلْ أَحْسِبُ فُلاَنًا وَاللَّهُ حَسِيبُهُ وَلاَ أُزَكِّي عَلَى اللَّهِ أَحَدًا أَحْسِبُهُ\n إِنْ كَانَ يَعْلَمُ ذَاكَ كَذَا وَكَذَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 83,
        "matchingEnglishURN": 271390,
        "last_updated": null
    },
    {
        "arabicURN": 377320,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "14.00",
        "hadithNumber": "3000 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب النَّهْىِ عَنِ الْمَدْحِ، إِذَا كَانَ فِيهِ إِفْرَاطٌ وَخِيفَ مِنْهُ فِتْنَةٌ عَلَى الْمَمْدُوحِ",
        "hadithText": "وَحَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ عَبَّادِ بْنِ جَبَلَةَ بْنِ أَبِي رَوَّادٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ،\n ح وَحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ، أَخْبَرَنَا غُنْدَرٌ، قَالَ شُعْبَةُ حَدَّثَنَا عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ عَبْدِ،\n الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ ذُكِرَ عِنْدَهُ رَجُلٌ فَقَالَ\n رَجُلٌ يَا رَسُولَ اللَّهِ مَا مِنْ رَجُلٍ بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم أَفْضَلُ مِنْهُ فِي كَذَا\n وَكَذَا ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَيْحَكَ قَطَعْتَ عُنُقَ صَاحِبِكَ ‏\"‏ ‏.‏ مِرَارًا يَقُولُ\n ذَلِكَ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنْ كَانَ أَحَدُكُمْ مَادِحًا أَخَاهُ لاَ مَحَالَةَ فَلْيَقُلْ\n أَحْسِبُ فُلاَنًا إِنْ كَانَ يُرَى أَنَّهُ كَذَلِكَ وَلاَ أُزَكِّي عَلَى اللَّهِ أَحَدًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 84,
        "matchingEnglishURN": 271401,
        "last_updated": null
    },
    {
        "arabicURN": 377330,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "14.00",
        "hadithNumber": "3000 c",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب النَّهْىِ عَنِ الْمَدْحِ، إِذَا كَانَ فِيهِ إِفْرَاطٌ وَخِيفَ مِنْهُ فِتْنَةٌ عَلَى الْمَمْدُوحِ",
        "hadithText": "وَحَدَّثَنِيهِ عَمْرٌو النَّاقِدُ، حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، ح وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،\n حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ، كِلاَهُمَا عَنْ شُعْبَةَ، بِهَذَا الإِسْنَادِ ‏.‏ نَحْوَ حَدِيثِ يَزِيدَ بْنِ زُرَيْعٍ وَلَيْسَ\n فِي حَدِيثِهِمَا فَقَالَ رَجُلٌ مَا مِنْ رَجُلٍ بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم أَفْضَلُ مِنْهُ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 85,
        "matchingEnglishURN": 271402,
        "last_updated": null
    },
    {
        "arabicURN": 377340,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "14.00",
        "hadithNumber": "3001",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب النَّهْىِ عَنِ الْمَدْحِ، إِذَا كَانَ فِيهِ إِفْرَاطٌ وَخِيفَ مِنْهُ فِتْنَةٌ عَلَى الْمَمْدُوحِ",
        "hadithText": "حَدَّثَنِي أَبُو جَعْفَرٍ، مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّاءَ، عَنْ بُرَيْدِ بْنِ،\n عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ سَمِعَ النَّبِيُّ صلى الله عليه وسلم\n رَجُلاً يُثْنِي عَلَى رَجُلٍ وَيُطْرِيهِ فِي الْمِدْحَةِ فَقَالَ ‏\"‏ لَقَدْ أَهْلَكْتُمْ أَوْ قَطَعْتُمْ ظَهْرَ الرَّجُلِ ‏\"‏\n ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 86,
        "matchingEnglishURN": 271410,
        "last_updated": null
    },
    {
        "arabicURN": 377350,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "14.00",
        "hadithNumber": "3002 a",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب النَّهْىِ عَنِ الْمَدْحِ، إِذَا كَانَ فِيهِ إِفْرَاطٌ وَخِيفَ مِنْهُ فِتْنَةٌ عَلَى الْمَمْدُوحِ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، جَمِيعًا عَنِ ابْنِ مَهْدِيٍّ، - وَاللَّفْظُ\n لاِبْنِ الْمُثَنَّى قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ حَبِيبٍ، عَنْ مُجَاهِدٍ، عَنْ أَبِي مَعْمَرٍ،\n قَالَ قَامَ رَجُلٌ يُثْنِي عَلَى أَمِيرٍ مِنَ الأُمَرَاءِ فَجَعَلَ الْمِقْدَادُ يَحْثِي عَلَيْهِ التُّرَابَ وَقَالَ أَمَرَنَا\n رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ نَحْثِيَ فِي وُجُوهِ الْمَدَّاحِينَ التُّرَابَ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 87,
        "matchingEnglishURN": 271420,
        "last_updated": null
    },
    {
        "arabicURN": 377360,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "14.00",
        "hadithNumber": "3002 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب النَّهْىِ عَنِ الْمَدْحِ، إِذَا كَانَ فِيهِ إِفْرَاطٌ وَخِيفَ مِنْهُ فِتْنَةٌ عَلَى الْمَمْدُوحِ",
        "hadithText": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا \n مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ هَمَّامِ بْنِ الْحَارِثِ، أَنَّ رَجُلاً، جَعَلَ\n يَمْدَحُ عُثْمَانَ فَعَمِدَ الْمِقْدَادُ فَجَثَا عَلَى رُكْبَتَيْهِ - وَكَانَ رَجُلاً ضَخْمًا - فَجَعَلَ يَحْثُو فِي\n وَجْهِهِ الْحَصْبَاءَ فَقَالَ لَهُ عُثْمَانُ مَا شَأْنُكَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ\n ‏\"‏ إِذَا رَأَيْتُمُ الْمَدَّاحِينَ فَاحْثُوا فِي وُجُوهِهِمُ التُّرَابَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 88,
        "matchingEnglishURN": 271430,
        "last_updated": null
    },
    {
        "arabicURN": 377370,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "14.00",
        "hadithNumber": "3002 c",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب النَّهْىِ عَنِ الْمَدْحِ، إِذَا كَانَ فِيهِ إِفْرَاطٌ وَخِيفَ مِنْهُ فِتْنَةٌ عَلَى الْمَمْدُوحِ",
        "hadithText": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ \n مَنْصُورٍ، ح وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الأَشْجَعِيُّ، عُبَيْدُ اللَّهِ بْنُ عُبَيْدِ الرَّحْمَنِ عَنْ \n سُفْيَانَ الثَّوْرِيِّ، عَنِ الأَعْمَشِ، وَمَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ هَمَّامٍ، عَنِ الْمِقْدَادِ، عَنِ النَّبِيِّ صلى\n الله عليه وسلم بِمِثْلِهِ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 89,
        "matchingEnglishURN": 271440,
        "last_updated": null
    },
    {
        "arabicURN": 377380,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "15.00",
        "hadithNumber": "3003",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب مُنَاوَلَةِ الأَكْبَرِ ",
        "hadithText": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنِي أَبِي، حَدَّثَنَا صَخْرٌ، - يَعْنِي ابْنَ جُوَيْرِيَةَ\n - عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَرَانِي\n فِي الْمَنَامِ أَتَسَوَّكُ بِسِوَاكٍ فَجَذَبَنِي رَجُلاَنِ أَحَدُهُمَا أَكْبَرُ مِنَ الآخَرِ فَنَاوَلْتُ السِّوَاكَ الأَصْغَرَ\n مِنْهُمَا فَقِيلَ لِي كَبِّرْ ‏.‏ فَدَفَعْتُهُ إِلَى الأَكْبَرِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 90,
        "matchingEnglishURN": 271450,
        "last_updated": null
    },
    {
        "arabicURN": 377390,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "16.00",
        "hadithNumber": "2493 b",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب التَّثَبُّتِ فِي الْحَدِيثِ وَحُكْمِ كِتَابَةِ الْعِلْمِ ",
        "hadithText": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، حَدَّثَنَا بِهِ، سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ هِشَامٍ، عَنْ أَبِيهِ، قَالَ\n كَانَ أَبُو هُرَيْرَةَ يُحَدِّثُ وَيَقُولُ اسْمَعِي يَا رَبَّةَ الْحُجْرَةِ اسْمَعِي يَا رَبَّةَ الْحُجْرَةِ ‏.‏ وَعَائِشَةُ\n تُصَلِّي فَلَمَّا قَضَتْ صَلاَتَهَا قَالَتْ لِعُرْوَةَ أَلاَ تَسْمَعُ إِلَى هَذَا وَمَقَالَتِهِ آنِفًا إِنَّمَا كَانَ النَّبِيُّ\n صلى الله عليه وسلم يُحَدِّثُ حَدِيثًا لَوْ عَدَّهُ الْعَادُّ لأَحْصَاهُ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 91,
        "matchingEnglishURN": 271460,
        "last_updated": null
    },
    {
        "arabicURN": 377400,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "16.00",
        "hadithNumber": "3004",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب التَّثَبُّتِ فِي الْحَدِيثِ وَحُكْمِ كِتَابَةِ الْعِلْمِ ",
        "hadithText": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ الأَزْدِيُّ، حَدَّثَنَا هَمَّامٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ،\n عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَكْتُبُوا عَنِّي وَمَنْ\n كَتَبَ عَنِّي غَيْرَ الْقُرْآنِ فَلْيَمْحُهُ وَحَدِّثُوا عَنِّي وَلاَ حَرَجَ وَمَنْ كَذَبَ عَلَىَّ - قَالَ هَمَّامٌ أَحْسِبُهُ\n قَالَ - مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 92,
        "matchingEnglishURN": 271470,
        "last_updated": null
    },
    {
        "arabicURN": 377410,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "17.00",
        "hadithNumber": "3005",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب قِصَّةِ أَصْحَابِ الأُخْدُودِ وَالسَّاحِرِ وَالرَّاهِبِ وَالْغُلاَمِ ",
        "hadithText": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ،\n أَبِي لَيْلَى عَنْ صُهَيْبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ كَانَ مَلِكٌ فِيمَنْ كَانَ قَبْلَكُمْ\n وَكَانَ لَهُ سَاحِرٌ فَلَمَّا كَبِرَ قَالَ لِلْمَلِكِ إِنِّي قَدْ كَبِرْتُ فَابْعَثْ إِلَىَّ غُلاَمًا أُعَلِّمْهُ السِّحْرَ ‏.‏ فَبَعَثَ\n إِلَيْهِ غُلاَمًا يُعَلِّمُهُ فَكَانَ فِي طَرِيقِهِ إِذَا سَلَكَ رَاهِبٌ فَقَعَدَ إِلَيْهِ وَسَمِعَ كَلاَمَهُ فَأَعْجَبَهُ فَكَانَ\n إِذَا أَتَى السَّاحِرَ مَرَّ بِالرَّاهِبِ وَقَعَدَ إِلَيْهِ فَإِذَا أَتَى السَّاحِرَ ضَرَبَهُ فَشَكَا ذَلِكَ إِلَى الرَّاهِبِ\n فَقَالَ إِذَا خَشِيتَ السَّاحِرَ فَقُلْ حَبَسَنِي أَهْلِي ‏.‏ وَإِذَا خَشِيتَ أَهْلَكَ فَقُلْ حَبَسَنِي السَّاحِرُ\n ‏.‏ فَبَيْنَمَا هُوَ كَذَلِكَ إِذْ أَتَى عَلَى دَابَّةٍ عَظِيمَةٍ قَدْ حَبَسَتِ النَّاسَ فَقَالَ الْيَوْمَ أَعْلَمُ آلسَّاحِرُ\n أَفْضَلُ أَمِ الرَّاهِبُ أَفْضَلُ فَأَخَذَ حَجَرًا فَقَالَ اللَّهُمَّ إِنْ كَانَ أَمْرُ الرَّاهِبِ أَحَبَّ إِلَيْكَ مِنْ أَمْرِ\n السَّاحِرِ فَاقْتُلْ هَذِهِ الدَّابَّةَ حَتَّى يَمْضِيَ النَّاسُ ‏.‏ فَرَمَاهَا فَقَتَلَهَا وَمَضَى النَّاسُ فَأَتَى\n الرَّاهِبَ فَأَخْبَرَهُ فَقَالَ لَهُ الرَّاهِبُ أَىْ بُنَىَّ أَنْتَ الْيَوْمَ أَفْضَلُ مِنِّي ‏.‏ قَدْ بَلَغَ مِنْ أَمْرِكَ مَا\n أَرَى وَإِنَّكَ سَتُبْتَلَى فَإِنِ ابْتُلِيتَ فَلاَ تَدُلَّ عَلَىَّ ‏.‏ وَكَانَ الْغُلاَمُ يُبْرِئُ الأَكْمَهَ وَالأَبْرَصَ وَيُدَاوِي\n النَّاسَ مِنْ سَائِرِ الأَدْوَاءِ فَسَمِعَ جَلِيسٌ لِلْمَلِكِ كَانَ قَدْ عَمِيَ فَأَتَاهُ بِهَدَايَا كَثِيرَةٍ فَقَالَ مَا\n هَا هُنَا لَكَ أَجْمَعُ إِنْ أَنْتَ شَفَيْتَنِي فَقَالَ إِنِّي لاَ أَشْفِي أَحَدًا إِنَّمَا يَشْفِي اللَّهُ فَإِنْ أَنْتَ آمَنْتَ\n بِاللَّهِ دَعَوْتُ اللَّهَ فَشَفَاكَ ‏.‏ فَآمَنَ بِاللَّهِ فَشَفَاهُ اللَّهُ فَأَتَى الْمَلِكَ فَجَلَسَ إِلَيْهِ كَمَا كَانَ يَجْلِسُ\n فَقَالَ لَهُ الْمَلِكُ مَنْ رَدَّ عَلَيْكَ بَصَرَكَ قَالَ رَبِّي ‏.‏ قَالَ وَلَكَ رَبٌّ غَيْرِي قَالَ رَبِّي وَرَبُّكَ اللَّهُ\n ‏.‏ فَأَخَذَهُ فَلَمْ يَزَلْ يُعَذِّبُهُ حَتَّى دَلَّ عَلَى الْغُلاَمِ فَجِيءَ بِالْغُلاَمِ فَقَالَ لَهُ الْمَلِكُ أَىْ بُنَىَّ قَدْ\n بَلَغَ مِنْ سِحْرِكَ مَا تُبْرِئُ الأَكْمَهَ وَالأَبْرَصَ وَتَفْعَلُ وَتَفْعَلُ ‏.‏ فَقَالَ إِنِّي لاَ أَشْفِي أَحَدًا إِنَّمَا\n يَشْفِي اللَّهُ ‏.‏ فَأَخَذَهُ فَلَمْ يَزَلْ يُعَذِّبُهُ حَتَّى دَلَّ عَلَى الرَّاهِبِ فَجِيءَ بِالرَّاهِبِ فَقِيلَ لَهُ ارْجِعْ\n عَنْ دِينِكَ ‏.‏ فَأَبَى فَدَعَا بِالْمِئْشَارِ فَوَضَعَ الْمِئْشَارَ فِي مَفْرِقِ رَأْسِهِ فَشَقَّهُ حَتَّى وَقَعَ شِقَّاهُ\n ثُمَّ جِيءَ بِجَلِيسِ الْمَلِكِ فَقِيلَ لَهُ ارْجِعْ عَنْ دِينِكَ ‏.‏ فَأَبَى فَوَضَعَ الْمِئْشَارَ فِي مَفْرِقِ رَأْسِهِ\n فَشَقَّهُ بِهِ حَتَّى وَقَعَ شِقَّاهُ ثُمَّ جِيءَ بِالْغُلاَمِ فَقِيلَ لَهُ ارْجِعْ عَنْ دِينِكَ ‏.‏ فَأَبَى فَدَفَعَهُ إِلَى\n نَفَرٍ مِنْ أَصْحَابِهِ فَقَالَ اذْهَبُوا بِهِ إِلَى جَبَلِ كَذَا وَكَذَا فَاصْعَدُوا بِهِ الْجَبَلَ فَإِذَا بَلَغْتُمْ ذُرْوَتَهُ\n فَإِنْ رَجَعَ عَنْ دِينِهِ وَإِلاَّ فَاطْرَحُوهُ فَذَهَبُوا بِهِ فَصَعِدُوا بِهِ الْجَبَلَ فَقَالَ اللَّهُمَّ اكْفِنِيهِمْ بِمَا\n شِئْتَ ‏.‏ فَرَجَفَ بِهِمُ الْجَبَلُ فَسَقَطُوا وَجَاءَ يَمْشِي إِلَى الْمَلِكِ فَقَالَ لَهُ الْمَلِكُ مَا فَعَلَ أَصْحَابُكَ\n قَالَ كَفَانِيهِمُ اللَّهُ ‏.‏ فَدَفَعَهُ إِلَى نَفَرٍ مِنْ أَصْحَابِهِ فَقَالَ اذْهَبُوا بِهِ فَاحْمِلُوهُ فِي قُرْقُورٍ فَتَوَسَّطُوا\n بِهِ الْبَحْرَ فَإِنْ رَجَعَ عَنْ دِينِهِ وَإِلاَّ فَاقْذِفُوهُ ‏.‏ فَذَهَبُوا بِهِ فَقَالَ اللَّهُمَّ اكْفِنِيهِمْ بِمَا شِئْتَ\n ‏.‏ فَانْكَفَأَتْ بِهِمُ السَّفِينَةُ فَغَرِقُوا وَجَاءَ يَمْشِي إِلَى الْمَلِكِ فَقَالَ لَهُ الْمَلِكُ مَا فَعَلَ أَصْحَابُكَ\n قَالَ كَفَانِيهِمُ اللَّهُ ‏.‏ فَقَالَ لِلْمَلِكِ إِنَّكَ لَسْتَ بِقَاتِلِي حَتَّى تَفْعَلَ مَا آمُرُكَ بِهِ ‏.‏ قَالَ وَمَا هُوَ\n قَالَ تَجْمَعُ النَّاسَ فِي صَعِيدٍ وَاحِدٍ وَتَصْلُبُنِي عَلَى جِذْعٍ ثُمَّ خُذْ سَهْمًا مِنْ كِنَانَتِي ثُمَّ ضَعِ\n السَّهْمَ فِي كَبِدِ الْقَوْسِ ثُمَّ قُلْ بِاسْمِ اللَّهِ رَبِّ الْغُلاَمِ ‏.‏ ثُمَّ ارْمِنِي فَإِنَّكَ إِذَا فَعَلْتَ ذَلِكَ قَتَلْتَنِي\n ‏.‏ فَجَمَعَ النَّاسَ فِي صَعِيدٍ وَاحِدٍ وَصَلَبَهُ عَلَى جِذْعٍ ثُمَّ أَخَذَ سَهْمًا مِنْ كِنَانَتِهِ ثُمَّ وَضَعَ السَّهْمَ\n فِي كَبِدِ الْقَوْسِ ثُمَّ قَالَ بِاسْمِ اللَّهِ رَبِّ الْغُلاَمِ ‏.‏ ثُمَّ رَمَاهُ فَوَقَعَ السَّهْمُ فِي صُدْغِهِ فَوَضَعَ\n يَدَهُ فِي صُدْغِهِ فِي مَوْضِعِ السَّهْمِ فَمَاتَ فَقَالَ النَّاسُ آمَنَّا بِرَبِّ الْغُلاَمِ آمَنَّا بِرَبِّ الْغُلاَمِ\n آمَنَّا بِرَبِّ الْغُلاَمِ ‏.‏ فَأُتِيَ الْمَلِكُ فَقِيلَ لَهُ أَرَأَيْتَ مَا كُنْتَ تَحْذَرُ قَدْ وَاللَّهِ نَزَلَ بِكَ حَذَرُكَ قَدْ\n آمَنَ النَّاسُ ‏.‏ فَأَمَرَ بِالأُخْدُودِ فِي أَفْوَاهِ السِّكَكِ فَخُدَّتْ وَأَضْرَمَ النِّيرَانَ وَقَالَ مَنْ لَمْ يَرْجِعْ\n عَنْ دِينِهِ فَأَحْمُوهُ فِيهَا ‏.‏ أَوْ قِيلَ لَهُ اقْتَحِمْ ‏.‏ فَفَعَلُوا حَتَّى جَاءَتِ امْرَأَةٌ وَمَعَهَا صَبِيٌّ لَهَا\n فَتَقَاعَسَتْ أَنْ تَقَعَ فِيهَا فَقَالَ لَهَا الْغُلاَمُ يَا أُمَّهِ اصْبِرِي فَإِنَّكِ عَلَى الْحَقِّ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 93,
        "matchingEnglishURN": 271480,
        "last_updated": null
    },
    {
        "arabicURN": 377421,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "18.00",
        "hadithNumber": "3006-3014",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب حَدِيثِ جَابِرٍ الطَّوِيلِ وَقِصَّةِ أَبِي الْيَسَرِ ",
        "hadithText": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، وَمُحَمَّدُ بْنُ عَبَّادٍ، - وَتَقَارَبَا فِي لَفْظِ الْحَدِيثِ - وَالسِّيَاقُ\n لِهَارُونَ قَالاَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ عَنْ يَعْقُوبَ بْنِ مُجَاهِدٍ أَبِي حَزْرَةَ عَنْ عُبَادَةَ بْنِ\n الْوَلِيدِ بْنِ عُبَادَةَ بْنِ الصَّامِتِ قَالَ خَرَجْتُ أَنَا وَأَبِي نَطْلُبُ الْعِلْمَ فِي هَذَا الْحَىِّ مِنَ الأَنْصَارِ\n قَبْلَ أَنْ يَهْلِكُوا فَكَانَ أَوَّلُ مَنْ لَقِينَا أَبَا الْيَسَرِ صَاحِبَ رَسُولِ اللَّهِ صلى الله عليه وسلم\n وَمَعَهُ غُلاَمٌ لَهُ مَعَهُ ضِمَامَةٌ مِنْ صُحُفٍ وَعَلَى أَبِي الْيَسَرِ بُرْدَةٌ وَمَعَافِرِيٌّ وَعَلَى غُلاَمِهِ بُرْدَةٌ\n وَمَعَافِرِيٌّ فَقَالَ لَهُ أَبِي يَا عَمِّ إِنِّي أَرَى فِي وَجْهِكَ سَفْعَةً مِنْ غَضَبٍ ‏.‏ قَالَ أَجَلْ كَانَ لِي\n عَلَى فُلاَنِ بْنِ فُلاَنٍ الْحَرَامِيِّ مَالٌ فَأَتَيْتُ أَهْلَهُ فَسَلَّمْتُ فَقُلْتُ ثَمَّ هُوَ قَالُوا لاَ ‏.‏ فَخَرَجَ عَلَىَّ\n ابْنٌ لَهُ جَفْرٌ فَقُلْتُ لَهُ أَيْنَ أَبُوكَ قَالَ سَمِعَ صَوْتَكَ فَدَخَلَ أَرِيكَةَ أُمِّي ‏.‏ فَقُلْتُ اخْرُجْ إِلَىَّ فَقَدْ\n عَلِمْتُ أَيْنَ أَنْتَ ‏.‏ فَخَرَجَ فَقُلْتُ مَا حَمَلَكَ عَلَى أَنِ اخْتَبَأْتَ مِنِّي قَالَ أَنَا وَاللَّهِ أُحَدِّثُكَ ثُمَّ\n لاَ أَكْذِبُكَ خَشِيتُ وَاللَّهِ أَنْ أُحَدِّثَكَ فَأَكْذِبَكَ وَأَنْ أَعِدَكَ فَأُخْلِفَكَ وَكُنْتَ صَاحِبَ رَسُولِ اللَّهِ\n صلى الله عليه وسلم وَكُنْتُ وَاللَّهِ مُعْسِرًا ‏.‏ قَالَ قُلْتُ آللَّهِ ‏.‏ قَالَ اللَّهِ ‏.‏ قُلْتُ آللَّهِ ‏.‏ قَالَ اللَّهِ\n ‏.‏ قُلْتُ آللَّهِ ‏.‏ قَالَ اللَّهِ ‏.‏ قَالَ فَأَتَى بِصَحِيفَتِهِ فَمَحَاهَا بِيَدِهِ فَقَالَ إِنْ وَجَدْتَ قَضَاءً فَاقْضِنِي\n وَإِلاَّ أَنْتَ فِي حِلٍّ فَأَشْهَدُ بَصَرُ عَيْنَىَّ هَاتَيْنِ - وَوَضَعَ إِصْبَعَيْهِ عَلَى عَيْنَيْهِ - وَسَمْعُ أُذُنَىَّ\n هَاتَيْنِ وَوَعَاهُ قَلْبِي هَذَا - وَأَشَارَ إِلَى مَنَاطِ قَلْبِهِ - رَسُولَ اللَّهِ صلى الله عليه وسلم\n وَهُوَ يَقُولُ ‏\"‏ مَنْ أَنْظَرَ مُعْسِرًا أَوْ وَضَعَ عَنْهُ أَظَلَّهُ اللَّهُ فِي ظِلِّهِ ‏\"‏ ‏.‏ قَالَ فَقُلْتُ لَهُ أَنَا يَا\n عَمِّ لَوْ أَنَّكَ أَخَذْتَ بُرْدَةَ غُلاَمِكَ وَأَعْطَيْتَهُ مَعَافِرِيَّكَ وَأَخَذْتَ مَعَافِرِيَّهُ وَأَعْطَيْتَهُ بُرْدَتَكَ فَكَانَتْ\n عَلَيْكَ حُلَّةٌ وَعَلَيْهِ حُلَّةٌ ‏.‏ فَمَسَحَ رَأْسِي وَقَالَ اللَّهُمَّ بَارِكْ فِيهِ يَا ابْنَ أَخِي بَصَرُ عَيْنَىَّ هَاتَيْنِ\n وَسَمْعُ أُذُنَىَّ هَاتَيْنِ وَوَعَاهُ قَلْبِي هَذَا - وَأَشَارَ إِلَى مَنَاطِ قَلْبِهِ - رَسُولَ اللَّهِ صلى الله\n عليه وسلم وَهُوَ يَقُولُ ‏\"‏ أَطْعِمُوهُمْ مِمَّا تَأْكُلُونَ وَأَلْبِسُوهُمْ مِمَّا تَلْبَسُونَ ‏\"‏ ‏.‏ وَكَانَ أَنْ أَعْطَيْتُهُ\n مِنْ مَتَاعِ الدُّنْيَا أَهْوَنَ عَلَىَّ مِنْ أَنْ يَأْخُذَ مِنْ حَسَنَاتِي يَوْمَ الْقِيَامَةِ ‏.‏ \n \n ثُمَّ مَضَيْنَا حَتَّى أَتَيْنَا جَابِرَ بْنَ عَبْدِ اللَّهِ فِي مَسْجِدِهِ وَهُوَ يُصَلِّي فِي ثَوْبٍ وَاحِدٍ\n مُشْتَمِلاً بِهِ فَتَخَطَّيْتُ الْقَوْمَ حَتَّى جَلَسْتُ بَيْنَهُ وَبَيْنَ الْقِبْلَةِ فَقُلْتُ يَرْحَمُكَ اللَّهُ أَتُصَلِّي فِي ثَوْبٍ\n وَاحِدٍ وَرِدَاؤُكَ إِلَى جَنْبِكَ قَالَ فَقَالَ بِيَدِهِ فِي صَدْرِي هَكَذَا وَفَرَّقَ بَيْنَ أَصَابِعِهِ وَقَوَّسَهَا\n أَرَدْتُ أَنْ يَدْخُلَ عَلَىَّ الأَحْمَقُ مِثْلُكَ فَيَرَانِي كَيْفَ أَصْنَعُ فَيَصْنَعُ مِثْلَهُ ‏.‏ أَتَانَا رَسُولُ اللَّهِ\n صلى الله عليه وسلم فِي مَسْجِدِنَا هَذَا وَفِي يَدِهِ عُرْجُونُ ابْنِ طَابٍ فَرَأَى فِي قِبْلَةِ الْمَسْجِدِ\n نُخَامَةً فَحَكَّهَا بِالْعُرْجُونِ ثُمَّ أَقْبَلَ عَلَيْنَا فَقَالَ ‏\"‏ أَيُّكُمْ يُحِبُّ أَنْ يُعْرِضَ اللَّهُ عَنْهُ ‏\"‏ ‏.‏ قَالَ\n فَخَشَعْنَا ثُمَّ قَالَ ‏\"‏ أَيُّكُمْ يُحِبُّ أَنْ يُعْرِضَ اللَّهُ عَنْهُ ‏\"‏ ‏.‏ قَالَ فَخَشَعْنَا ثُمَّ قَالَ ‏\"‏ أَيُّكُمْ يُحِبُّ\n أَنْ يُعْرِضَ اللَّهُ عَنْهُ ‏\"‏ ‏.‏ قُلْنَا لاَ أَيُّنَا يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ فَإِنَّ أَحَدَكُمْ إِذَا قَامَ يُصَلِّي\n فَإِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قِبَلَ وَجْهِهِ فَلاَ يَبْصُقَنَّ قِبَلَ وَجْهِهِ وَلاَ عَنْ يَمِينِهِ وَلْيَبْصُقْ عَنْ يَسَارِهِ\n تَحْتَ رِجْلِهِ الْيُسْرَى فَإِنْ عَجِلَتْ بِهِ بَادِرَةٌ فَلْيَقُلْ بِثَوْبِهِ هَكَذَا ‏\"‏ ‏.‏ ثُمَّ طَوَى ثَوْبَهُ بَعْضَهُ عَلَى\n بَعْضٍ فَقَالَ ‏\"‏ أَرُونِي عَبِيرًا ‏\"‏ ‏.‏ فَقَامَ فَتًى مِنَ الْحَىِّ يَشْتَدُّ إِلَى أَهْلِهِ فَجَاءَ بِخَلُوقٍ فِي\n رَاحَتِهِ فَأَخَذَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَجَعَلَهُ عَلَى رَأْسِ الْعُرْجُونِ ثُمَّ لَطَخَ بِهِ\n عَلَى أَثَرِ النُّخَامَةِ ‏.‏ فَقَالَ جَابِرٌ فَمِنْ هُنَاكَ جَعَلْتُمُ الْخَلُوقَ فِي مَسَاجِدِكُمْ ‏.‏ سِرْنَا مَعَ رَسُولِ\n اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ بَطْنِ بُوَاطٍ وَهُوَ يَطْلُبُ الْمَجْدِيَّ بْنَ عَمْرٍو الْجُهَنِيَّ وَكَانَ\n النَّاضِحُ يَعْتَقِبُهُ مِنَّا الْخَمْسَةُ وَالسِّتَّةُ وَالسَّبْعَةُ فَدَارَتْ عُقْبَةُ رَجُلٍ مِنَ الأَنْصَارِ عَلَى نَاضِحٍ\n لَهُ فَأَنَاخَهُ فَرَكِبَهُ ثُمَّ بَعَثَهُ فَتَلَدَّنَ عَلَيْهِ بَعْضَ التَّلَدُّنِ فَقَالَ لَهُ شَأْ لَعَنَكَ اللَّهُ ‏.‏ فَقَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ هَذَا اللاَّعِنُ بَعِيرَهُ ‏\"‏ ‏.‏ قَالَ أَنَا يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏\n انْزِلْ عَنْهُ فَلاَ تَصْحَبْنَا بِمَلْعُونٍ لاَ تَدْعُوا عَلَى أَنْفُسِكُمْ وَلاَ تَدْعُوا عَلَى أَوْلاَدِكُمْ وَلاَ تَدْعُوا\n عَلَى أَمْوَالِكُمْ لاَ تُوَافِقُوا مِنَ اللَّهِ سَاعَةً يُسْأَلُ فِيهَا عَطَاءٌ فَيَسْتَجِيبُ لَكُمْ ‏\"‏ ‏.‏ سِرْنَا مَعَ\n رَسُولِ اللَّهِ صلى الله عليه وسلم حَتَّى إِذَا كَانَتْ عُشَيْشِيَةٌ وَدَنَوْنَا مَاءً مِنْ مِيَاهِ الْعَرَبِ قَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ رَجُلٌ يَتَقَدَّمُنَا فَيَمْدُرُ الْحَوْضَ فَيَشْرَبُ وَيَسْقِينَا ‏\"‏\n ‏.‏ قَالَ جَابِرٌ فَقُمْتُ فَقُلْتُ هَذَا رَجُلٌ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n ‏\"‏ أَىُّ رَجُلٍ مَعَ جَابِرٍ ‏\"‏ ‏.‏ فَقَامَ جَبَّارُ بْنُ صَخْرٍ فَانْطَلَقْنَا إِلَى الْبِئْرِ فَنَزَعْنَا فِي الْحَوْضِ\n سَجْلاً أَوْ سَجْلَيْنِ ثُمَّ مَدَرْنَاهُ ثُمَّ نَزَعْنَا فِيهِ حَتَّى أَفْهَقْنَاهُ فَكَانَ أَوَّلَ طَالِعٍ عَلَيْنَا رَسُولُ\n اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَتَأْذَنَانِ ‏\"‏ ‏.‏ قُلْنَا نَعَمْ يَا رَسُولَ اللَّهِ ‏.‏ فَأَشْرَعَ نَاقَتَهُ\n فَشَرِبَتْ شَنَقَ لَهَا فَشَجَتْ فَبَالَتْ ثُمَّ عَدَلَ بِهَا فَأَنَاخَهَا ثُمَّ جَاءَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم إِلَى الْحَوْضِ فَتَوَضَّأَ مِنْهُ ثُمَّ قُمْتُ فَتَوَضَّأْتُ مِنْ مُتَوَضَّإِ رَسُولِ اللَّهِ صلى الله عليه\n وسلم فَذَهَبَ جَبَّارُ بْنُ صَخْرٍ يَقْضِي حَاجَتَهُ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِيُصَلِّيَ\n وَكَانَتْ عَلَىَّ بُرْدَةٌ ذَهَبْتُ أَنْ أُخَالِفَ بَيْنَ طَرَفَيْهَا فَلَمْ تَبْلُغْ لِي وَكَانَتْ لَهَا ذَبَاذِبُ فَنَكَّسْتُهَا\n ثُمَّ خَالَفْتُ بَيْنَ طَرَفَيْهَا ثُمَّ تَوَاقَصْتُ عَلَيْهَا ثُمَّ جِئْتُ حَتَّى قُمْتُ عَنْ يَسَارِ رَسُولِ اللَّهِ صلى\n الله عليه وسلم فَأَخَذَ بِيَدِي فَأَدَارَنِي حَتَّى أَقَامَنِي عَنْ يَمِينِهِ ثُمَّ جَاءَ جَبَّارُ بْنُ صَخْرٍ فَتَوَضَّأَ\n ثُمَّ جَاءَ فَقَامَ عَنْ يَسَارِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخَذَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم بِيَدَيْنَا جَمِيعًا فَدَفَعَنَا حَتَّى أَقَامَنَا خَلْفَهُ فَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n يَرْمُقُنِي وَأَنَا لاَ أَشْعُرُ ثُمَّ فَطِنْتُ بِهِ فَقَالَ هَكَذَا بِيَدِهِ يَعْنِي شُدَّ وَسَطَكَ فَلَمَّا فَرَغَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ يَا جَابِرُ ‏\"‏ ‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ إِذَا كَانَ\n وَاسِعًا فَخَالِفْ بَيْنَ طَرَفَيْهِ وَإِذَا كَانَ ضَيِّقًا فَاشْدُدْهُ عَلَى حِقْوِكَ ‏\"‏ ‏.‏ سِرْنَا مَعَ رَسُولِ اللَّهِ\n صلى الله عليه وسلم وَكَانَ قُوتُ كُلِّ رَجُلٍ مِنَّا فِي كُلِّ يَوْمٍ تَمْرَةً فَكَانَ يَمَصُّهَا ثُمَّ يَصُرُّهَا\n فِي ثَوْبِهِ وَكُنَّا نَخْتَبِطُ بِقِسِيِّنَا وَنَأْكُلُ حَتَّى قَرِحَتْ أَشْدَاقُنَا فَأُقْسِمُ أُخْطِئَهَا رَجُلٌ مِنَّا يَوْمًا\n فَانْطَلَقْنَا بِهِ نَنْعَشُهُ فَشَهِدْنَا أَنَّهُ لَمْ يُعْطَهَا فَأُعْطِيَهَا فَقَامَ فَأَخَذَهَا ‏.‏ سِرْنَا مَعَ رَسُولِ\n اللَّهِ صلى الله عليه وسلم حَتَّى نَزَلْنَا وَادِيًا أَفْيَحَ فَذَهَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n يَقْضِي حَاجَتَهُ فَاتَّبَعْتُهُ بِإِدَاوَةٍ مِنْ مَاءٍ فَنَظَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمْ يَرَ شَيْئًا\n يَسْتَتِرُ بِهِ فَإِذَا شَجَرَتَانِ بِشَاطِئِ الْوَادِي فَانْطَلَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى\n إِحْدَاهُمَا فَأَخَذَ بِغُصْنٍ مِنْ أَغْصَانِهَا فَقَالَ ‏\"‏ انْقَادِي عَلَىَّ بِإِذْنِ اللَّهِ ‏\"‏ ‏.‏ فَانْقَادَتْ مَعَهُ\n كَالْبَعِيرِ الْمَخْشُوشِ الَّذِي يُصَانِعُ قَائِدَهُ حَتَّى أَتَى الشَّجَرَةَ الأُخْرَى فَأَخَذَ بِغُصْنٍ مِنْ أَغْصَانِهَا\n فَقَالَ ‏\"‏ انْقَادِي عَلَىَّ بِإِذْنِ اللَّهِ ‏\"‏ ‏.‏ فَانْقَادَتْ مَعَهُ كَذَلِكَ حَتَّى إِذَا كَانَ بِالْمَنْصَفِ مِمَّا بَيْنَهُمَا\n لأَمَ بَيْنَهُمَا - يَعْنِي جَمَعَهُمَا - فَقَالَ ‏\"‏ الْتَئِمَا عَلَىَّ بِإِذْنِ اللَّهِ ‏\"‏ ‏.‏ فَالْتَأَمَتَا قَالَ جَابِرٌ فَخَرَجْتُ\n أُحْضِرُ مَخَافَةَ أَنْ يُحِسَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِقُرْبِي فَيَبْتَعِدَ - وَقَالَ مُحَمَّدُ\n بْنُ عَبَّادٍ فَيَتَبَعَّدَ - فَجَلَسْتُ أُحَدِّثُ نَفْسِي فَحَانَتْ مِنِّي لَفْتَةٌ فَإِذَا أَنَا بِرَسُولِ اللَّهِ صلى\n الله عليه وسلم مُقْبِلاً وَإِذَا الشَّجَرَتَانِ قَدِ افْتَرَقَتَا فَقَامَتْ كُلُّ وَاحِدَةٍ مِنْهُمَا عَلَى سَاقٍ فَرَأَيْتُ\n رَسُولَ اللَّهِ صلى الله عليه وسلم وَقَفَ وَقْفَةً فَقَالَ بِرَأْسِهِ هَكَذَا - وَأَشَارَ أَبُو إِسْمَاعِيلَ\n بِرَأْسِهِ يَمِينًا وَشِمَالاً - ثُمَّ أَقْبَلَ فَلَمَّا انْتَهَى إِلَىَّ قَالَ ‏\"‏ يَا جَابِرُ هَلْ رَأَيْتَ مَقَامِي ‏\"‏ ‏.‏\n قُلْتُ نَعَمْ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ فَانْطَلِقْ إِلَى الشَّجَرَتَيْنِ فَاقْطَعْ مِنْ كُلِّ وَاحِدَةٍ مِنْهُمَا غُصْنًا\n فَأَقْبِلْ بِهِمَا حَتَّى إِذَا قُمْتَ مَقَامِي فَأَرْسِلْ غُصْنًا عَنْ يَمِينِكَ وَغُصْنًا عَنْ يَسَارِكَ ‏\"‏ ‏.‏ قَالَ\n جَابِرٌ فَقُمْتُ فَأَخَذْتُ حَجَرًا فَكَسَرْتُهُ وَحَسَرْتُهُ فَانْذَلَقَ لِي فَأَتَيْتُ الشَّجَرَتَيْنِ فَقَطَعْتُ مِنْ\n كُلِّ وَاحِدَةٍ مِنْهُمَا غُصْنًا ثُمَّ أَقْبَلْتُ أَجُرُّهُمَا حَتَّى قُمْتُ مَقَامَ رَسُولِ اللَّهِ صلى الله عليه وسلم\n أَرْسَلْتُ غُصْنًا عَنْ يَمِينِي وَغُصْنًا عَنْ يَسَارِي ثُمَّ لَحِقْتُهُ فَقُلْتُ قَدْ فَعَلْتُ يَا رَسُولَ اللَّهِ فَعَمَّ\n ذَاكَ قَالَ ‏\"‏ إِنِّي مَرَرْتُ بِقَبْرَيْنِ يُعَذَّبَانِ فَأَحْبَبْتُ بِشَفَاعَتِي أَنْ يُرَفَّهَ عَنْهُمَا مَا دَامَ الْغُصْنَانِ\n رَطْبَيْنِ ‏\"‏ ‏.‏ قَالَ فَأَتَيْنَا الْعَسْكَرَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا جَابِرُ نَادِ\n بِوَضُوءٍ ‏\"‏ ‏.‏ فَقُلْتُ أَلاَ وَضُوءَ أَلاَ وَضُوءَ أَلاَ وَضُوءَ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مَا وَجَدْتُ فِي\n الرَّكْبِ مِنْ قَطْرَةٍ وَكَانَ رَجُلٌ مِنَ الأَنْصَارِ يُبَرِّدُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم الْمَاءَ فِي\n أَشْجَابٍ لَهُ عَلَى حِمَارَةٍ مِنْ جَرِيدٍ قَالَ فَقَالَ لِيَ ‏\"‏ انْطَلِقْ إِلَى فُلاَنِ بْنِ فُلاَنٍ الأَنْصَارِيِّ\n فَانْظُرْ هَلْ فِي أَشْجَابِهِ مِنْ شَىْءٍ ‏\"‏ ‏.‏ قَالَ فَانْطَلَقْتُ إِلَيْهِ فَنَظَرْتُ فِيهَا فَلَمْ أَجِدْ فِيهَا إِلاَّ\n قَطْرَةً فِي عَزْلاَءِ شَجْبٍ مِنْهَا لَوْ أَنِّي أُفْرِغُهُ لَشَرِبَهُ يَابِسُهُ ‏.‏ فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله\n عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي لَمْ أَجِدْ فِيهَا إِلاَّ قَطْرَةً فِي عَزْلاَءِ شَجْبٍ مِنْهَا لَوْ أَنِّي\n أُفْرِغُهُ لَشَرِبَهُ يَابِسُهُ قَالَ ‏\"‏ اذْهَبْ فَأْتِنِي بِهِ ‏\"‏ ‏.‏ فَأَتَيْتُهُ بِهِ فَأَخَذَهُ بِيَدِهِ فَجَعَلَ يَتَكَلَّمُ بِشَىْءٍ\n لاَ أَدْرِي مَا هُوَ وَيَغْمِزُهُ بِيَدَيْهِ ثُمَّ أَعْطَانِيهِ فَقَالَ ‏\"‏ يَا جَابِرُ نَادِ بِجَفْنَةٍ ‏\"‏ ‏.‏ فَقُلْتُ يَا جَفْنَةَ\n الرَّكْبِ ‏.‏ فَأُتِيتُ بِهَا تُحْمَلُ فَوَضَعْتُهَا بَيْنَ يَدَيْهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِهِ\n فِي الْجَفْنَةِ هَكَذَا فَبَسَطَهَا وَفَرَّقَ بَيْنَ أَصَابِعِهِ ثُمَّ وَضَعَهَا فِي قَعْرِ الْجَفْنَةِ وَقَالَ ‏\"‏ خُذْ يَا\n جَابِرُ فَصُبَّ عَلَىَّ وَقُلْ بِاسْمِ اللَّهِ ‏\"‏ ‏.‏ فَصَبَبْتُ عَلَيْهِ وَقُلْتُ بِاسْمِ اللَّهِ ‏.‏ فَرَأَيْتُ الْمَاءَ يَتَفَوَّرُ\n مِنْ بَيْنِ أَصَابِعِ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ فَارَتِ الْجَفْنَةُ وَدَارَتْ حَتَّى امْتَلأَتْ فَقَالَ\n ‏\"‏ يَا جَابِرُ نَادِ مَنْ كَانَ لَهُ حَاجَةٌ بِمَاءٍ ‏\"‏ ‏.‏ قَالَ فَأَتَى النَّاسُ فَاسْتَقَوْا حَتَّى رَوَوْا قَالَ\n فَقُلْتُ هَلْ بَقِيَ أَحَدٌ لَهُ حَاجَةٌ فَرَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ مِنَ الْجَفْنَةِ وَهِيَ\n مَلأَى ‏.‏ وَشَكَا النَّاسُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم الْجُوعَ فَقَالَ ‏\"‏ عَسَى اللَّهُ أَنْ\n يُطْعِمَكُمْ ‏\"‏ ‏.‏ فَأَتَيْنَا سِيفَ الْبَحْرِ فَزَخَرَ الْبَحْرُ زَخْرَةً فَأَلْقَى دَابَّةً فَأَوْرَيْنَا عَلَى شِقِّهَا النَّارَ\n فَاطَّبَخْنَا وَاشْتَوَيْنَا وَأَكَلْنَا حَتَّى شَبِعْنَا ‏.‏ قَالَ جَابِرٌ فَدَخَلْتُ أَنَا وَفُلاَنٌ وَفُلاَنٌ حَتَّى عَدَّ\n خَمْسَةً فِي حِجَاجِ عَيْنِهَا مَا يَرَانَا أَحَدٌ حَتَّى خَرَجْنَا فَأَخَذْنَا ضِلَعًا مِنْ أَضْلاَعِهِ فَقَوَّسْنَاهُ\n ثُمَّ دَعَوْنَا بِأَعْظَمِ رَجُلٍ فِي الرَّكْبِ وَأَعْظَمِ جَمَلٍ فِي الرَّكْبِ وَأَعْظَمِ كِفْلٍ فِي الرَّكْبِ فَدَخَلَ\n تَحْتَهُ مَا يُطَأْطِئُ رَأْسَهُ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 94,
        "matchingEnglishURN": 271490,
        "last_updated": null
    },
    {
        "arabicURN": 377442,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "19.00",
        "hadithNumber": "2009 c",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب فِي حَدِيثِ الْهِجْرَةِ وَيُقَالُ لَهُ حَدِيثُ الرَّحْلِ ",
        "hadithText": "حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ،\n قَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ، يَقُولُ جَاءَ أَبُو بَكْرٍ الصِّدِّيقُ إِلَى أَبِي فِي مَنْزِلِهِ فَاشْتَرَى مِنْهُ\n رَحْلاً فَقَالَ لِعَازِبٍ ابْعَثْ مَعِيَ ابْنَكَ يَحْمِلْهُ مَعِي إِلَى مَنْزِلِي فَقَالَ لِي أَبِي احْمِلْهُ ‏.‏ فَحَمَلْتُهُ\n وَخَرَجَ أَبِي مَعَهُ يَنْتَقِدُ ثَمَنَهُ فَقَالَ لَهُ أَبِي يَا أَبَا بَكْرٍ حَدِّثْنِي كَيْفَ صَنَعْتُمَا لَيْلَةَ سَرَيْتَ مَعَ\n رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ أَسْرَيْنَا لَيْلَتَنَا كُلَّهَا حَتَّى قَامَ قَائِمُ الظَّهِيرَةِ وَخَلاَ\n الطَّرِيقُ فَلاَ يَمُرُّ فِيهِ أَحَدٌ حَتَّى رُفِعَتْ لَنَا صَخْرَةٌ طَوِيلَةٌ لَهَا ظِلٌّ لَمْ تَأْتِ عَلَيْهِ الشَّمْسُ\n بَعْدُ فَنَزَلْنَا عِنْدَهَا فَأَتَيْتُ الصَّخْرَةَ فَسَوَّيْتُ بِيَدِي مَكَانًا يَنَامُ فِيهِ النَّبِيُّ صلى الله عليه\n وسلم فِي ظِلِّهَا ثُمَّ بَسَطْتُ عَلَيْهِ فَرْوَةً ثُمَّ قُلْتُ نَمْ يَا رَسُولَ اللَّهِ وَأَنَا أَنْفُضُ لَكَ مَا حَوْلَكَ\n فَنَامَ وَخَرَجْتُ أَنْفُضُ مَا حَوْلَهُ فَإِذَا أَنَا بِرَاعِي غَنَمٍ مُقْبِلٍ بِغَنَمِهِ إِلَى الصَّخْرَةِ يُرِيدُ مِنْهَا\n الَّذِي أَرَدْنَا فَلَقِيتُهُ فَقُلْتُ لِمَنْ أَنْتَ يَا غُلاَمُ فَقَالَ لِرَجُلٍ مِنْ أَهْلِ الْمَدِينَةِ قُلْتُ أَفِي غَنَمِكَ\n لَبَنٌ قَالَ نَعَمْ ‏.‏ قُلْتُ أَفَتَحْلُبُ لِي قَالَ نَعَمْ ‏.‏ فَأَخَذَ شَاةً فَقُلْتُ لَهُ انْفُضِ الضَّرْعَ مِنَ الشَّعَرِ\n وَالتُّرَابِ وَالْقَذَى - قَالَ فَرَأَيْتُ الْبَرَاءَ يَضْرِبُ بِيَدِهِ عَلَى الأُخْرَى يَنْفُضُ - فَحَلَبَ لِي فِي\n قَعْبٍ مَعَهُ كُثْبَةً مِنْ لَبَنٍ قَالَ وَمَعِي إِدَاوَةٌ أَرْتَوِي فِيهَا لِلنَّبِيِّ صلى الله عليه وسلم لِيَشْرَبَ\n مِنْهَا وَيَتَوَضَّأَ - قَالَ - فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم وَكَرِهْتُ أَنْ أُوقِظَهُ مِنْ نَوْمِهِ\n فَوَافَقْتُهُ اسْتَيْقَظَ فَصَبَبْتُ عَلَى اللَّبَنِ مِنَ الْمَاءِ حَتَّى بَرَدَ أَسْفَلُهُ فَقُلْتُ يَا رَسُولَ اللَّهِ اشْرَبْ\n مِنْ هَذَا اللَّبَنِ - قَالَ - فَشَرِبَ حَتَّى رَضِيتُ ثُمَّ قَالَ ‏\"‏ أَلَمْ يَأْنِ لِلرَّحِيلِ ‏\"‏ ‏.‏ قُلْتُ بَلَى ‏.‏\n قَالَ فَارْتَحَلْنَا بَعْدَ مَا زَالَتِ الشَّمْسُ وَاتَّبَعَنَا سُرَاقَةُ بْنُ مَالِكٍ - قَالَ - وَنَحْنُ فِي جَلَدٍ\n مِنَ الأَرْضِ فَقُلْتُ يَا رَسُولَ اللَّهِ أُتِينَا فَقَالَ ‏\"‏ لاَ تَحْزَنْ إِنَّ اللَّهَ مَعَنَا ‏\"‏ ‏.‏ فَدَعَا عَلَيْهِ رَسُولُ\n اللَّهِ صلى الله عليه وسلم فَارْتَطَمَتْ فَرَسُهُ إِلَى بَطْنِهَا أُرَى فَقَالَ إِنِّي قَدْ عَلِمْتُ أَنَّكُمَا قَدْ\n دَعَوْتُمَا عَلَىَّ فَادْعُوَا لِي فَاللَّهُ لَكُمَا أَنْ أَرُدَّ عَنْكُمَا الطَّلَبَ ‏.‏ فَدَعَا اللَّهَ فَنَجَى فَرَجَعَ لاَ\n يَلْقَى أَحَدًا إِلاَّ قَالَ قَدْ كَفَيْتُكُمْ مَا هَا هُنَا فَلاَ يَلْقَى أَحَدًا إِلاَّ رَدَّهُ - قَالَ - وَوَفَى لَنَا ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 95,
        "matchingEnglishURN": 271501,
        "last_updated": null
    },
    {
        "arabicURN": 377443,
        "collection": "muslim",
        "volumeNumber": 1,
        "bookNumber": 56,
        "babNumber": "19.00",
        "hadithNumber": "2009 d",
        "bookName": " كتاب الزهد والرقائق",
        "babName": " باب فِي حَدِيثِ الْهِجْرَةِ وَيُقَالُ لَهُ حَدِيثُ الرَّحْلِ ",
        "hadithText": "وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، ح وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ،\n أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ، كِلاَهُمَا عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ اشْتَرَى\n أَبُو بَكْرٍ مِنْ أَبِي رَحْلاً بِثَلاَثَةَ عَشَرَ دِرْهَمًا وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ زُهَيْرٍ عَنْ أَبِي\n إِسْحَاقَ وَقَالَ فِي حَدِيثِهِ مِنْ رِوَايَةِ عُثْمَانَ بْنِ عُمَرَ فَلَمَّا دَنَا دَعَا عَلَيْهِ رَسُولُ اللَّهِ صلى\n الله عليه وسلم فَسَاخَ فَرَسُهُ فِي الأَرْضِ إِلَى بَطْنِهِ وَوَثَبَ عَنْهُ وَقَالَ يَا مُحَمَّدُ قَدْ عَلِمْتُ\n أَنَّ هَذَا عَمَلُكَ فَادْعُ اللَّهَ أَنْ يُخَلِّصَنِي مِمَّا أَنَا فِيهِ وَلَكَ عَلَىَّ لأُعَمِّيَنَّ عَلَى مَنْ وَرَائِي وَهَذِهِ\n كِنَانَتِي فَخُذْ سَهْمًا مِنْهَا فَإِنَّكَ سَتَمُرُّ عَلَى إِبِلِي وَغِلْمَانِي بِمَكَانِ كَذَا وَكَذَا فَخُذْ مِنْهَا حَاجَتَكَ\n قَالَ ‏\"‏ لاَ حَاجَةَ لِي فِي إِبِلِكَ ‏\"‏ ‏.‏ فَقَدِمْنَا الْمَدِينَةَ لَيْلاً فَتَنَازَعُوا أَيُّهُمْ يَنْزِلُ عَلَيْهِ رَسُولُ\n اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَنْزِلُ عَلَى بَنِي النَّجَّارِ أَخْوَالِ عَبْدِ الْمُطَّلِبِ أُكْرِمُهُمْ بِذَلِكَ\n ‏\"‏ ‏.‏ فَصَعِدَ الرِّجَالُ وَالنِّسَاءُ فَوْقَ الْبُيُوتِ وَتَفَرَّقَ الْغِلْمَانُ وَالْخَدَمُ فِي الطُّرُقِ يُنَادُونَ يَا\n مُحَمَّدُ يَا رَسُولَ اللَّهِ يَا مُحَمَّدُ يَا رَسُولَ اللَّهِ ‏.‏",
        "annotations": null,
        "bookID": "55.0",
        "grade1": null,
        "ourHadithNumber": 96,
        "matchingEnglishURN": 271502,
        "last_updated": null
    }
]