[
    {
        "urduURN": 4143570,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 1,
        "babName": "مرتد ( دین اسلام سے پھر جانے والے ) کے حکم کا بیان ۔",
        "hadithNumber": 4351,
        "hadithSanad": "عکرمہ سے روایت ہے کہ",
        "hadithText": "علی رضی اللہ عنہ نے کچھ لوگوں کو جو اسلام سے پھر گئے تھے آگ میں جلوا دیا ، ابن عباس رضی اللہ عنہما کو یہ بات معلوم ہوئی تو انہوں نے کہا : مجھے یہ زیب نہیں دیتا کہ میں انہیں جلاؤں ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے : ” تم انہیں وہ عذاب نہ دو جو اللہ کے ساتھ مخصوص ہے “ میں تو رسول اللہ صلی اللہ علیہ وسلم کے قول کی رو سے انہیں قتل کر دیتا کیونکہ آپ صلی اللہ علیہ وسلم نے فرمایا ہے : ” جو اسلام چھوڑ کر کوئی اور دین اختیار کر لے اسے قتل کر دو “ پھر جب علی رضی اللہ عنہ کو یہ بات پہنچی تو انہوں نے کہا : اللہ ابن عباس کی ماں پر رحم فرمائے انہوں نے بڑی اچھی بات کہی ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 943540,
        "last_updated": null
    },
    {
        "urduURN": 4143580,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 1,
        "babName": "مرتد ( دین اسلام سے پھر جانے والے ) کے حکم کا بیان ۔",
        "hadithNumber": 4352,
        "hadithSanad": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” کسی مسلمان آدمی کا جو صرف اللہ کے معبود ہونے ، اور میرے اللہ کے رسول ہونے کی گواہی دیتا ہو خون حلال نہیں ، سوائے تین صورتوں کے : یا تو وہ شادی شدہ زانی ہو ، یا اس نے کسی کا قتل کیا ہو تو اس کو اس کے بدلہ قتل کیا جائے گا ، یا اپنا دین چھوڑ کر مسلمانوں کی جماعت سے علیحدہ ہو گیا ہو “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 943550,
        "last_updated": null
    },
    {
        "urduURN": 4143590,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 1,
        "babName": "مرتد ( دین اسلام سے پھر جانے والے ) کے حکم کا بیان ۔",
        "hadithNumber": 4353,
        "hadithSanad": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” کسی مسلمان شخص کا خون جو صرف اللہ کے معبود ہونے اور میرے اللہ کے رسول ہونے کی گواہی دیتا ہو حلال نہیں سوائے تین صورتوں کے ایک وہ شخص جو شادی شدہ ہو اور اس کے بعد زنا کا ارتکاب کرے تو وہ رجم کیا جائے گا ، دوسرے وہ شخص جو اللہ اور اس کے رسول سے لڑنے نکلا ہو تو وہ قتل کیا جائے گا ، یا اسے سولی دے دی جائے گی ، یا وہ جلا وطن کر دیا جائے گا ، تیسرے جس نے کسی کو قتل کیا ہو تو اس کے بدلے وہ قتل کیا جائے گا “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 943560,
        "last_updated": null
    },
    {
        "urduURN": 4143600,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 1,
        "babName": "مرتد ( دین اسلام سے پھر جانے والے ) کے حکم کا بیان ۔",
        "hadithNumber": 4354,
        "hadithSanad": "ابوموسیٰ اشعری رضی اللہ عنہ کہتے ہیں",
        "hadithText": "میں نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا ، میرے ساتھ قبیلہ اشعر کے دو شخص تھے ، ایک میرے دائیں طرف تھا دوسرا بائیں طرف ، تو دونوں نے آپ سے عامل کا عہدہ طلب کیا ، اور آپ صلی اللہ علیہ وسلم خاموش رہے ، پھر فرمایا : ” ابوموسیٰ ! “ یا فرمایا : ” عبداللہ بن قیس ! تم کیا کہتے ہو ؟ “ میں نے عرض کیا : قسم ہے اس ذات کی جس نے آپ کو حق کے ساتھ بھیجا ، ان دونوں نے مجھے اس چیز سے آگاہ نہیں کیا تھا جو ان کے دل میں تھا ، اور مجھے نہیں معلوم تھا کہ وہ آپ سے عامل بنائے جانے کا مطالبہ کریں گے ، گویا میں اس وقت آپ کی مسواک کو دیکھ رہا ہوں ، وہ آپ صلی اللہ علیہ وسلم کے مسوڑھے کے نیچے تھی اور مسوڑھا اس کی وجہ سے اوپر اٹھا ہوا تھا ، پھر آپ صلی اللہ علیہ وسلم نے فرمایا : ” ہم اپنے کام پر اس شخص کو ہرگز عامل نہیں بنائیں گے یا عامل نہیں بناتے جو عامل بننے کی خواہش کرے ، لیکن اے ابوموسیٰ ! “ یا آپ نے فرمایا : ” اے عبداللہ بن قیس ! اس کام کے لیے تم جاؤ “ چنانچہ آپ صلی اللہ علیہ وسلم نے انہیں بھیج دیا ، پھر ان کے پیچھے معاذ بن جبل رضی اللہ عنہ کو بھیجا ، جب معاذ بن جبل رضی اللہ عنہ ان کے پاس آئے تو انہوں نے کہا : اترو ، اور ایک گاؤ تکیہ ان کے لیے لگا دیا ، تو اچانک وہ کیا دیکھتے ہیں کہ ایک آدمی ان کے پاس بندھا ہوا ہے ، معاذ رضی اللہ عنہ نے پوچھا : یہ کیسا آدمی ہے ؟ ابوموسیٰ نے کہا : یہ ایک یہودی تھا جو اسلام لے آیا تھا ، لیکن اب پھر وہ اپنے باطل دین کی طرف پھر گیا ہے ، معاذ رضی اللہ عنہ نے کہا : اللہ اور اس کے رسول کے فیصلہ کے مطابق جب تک یہ قتل نہ کر دیا جائے میں نہیں بیٹھ سکتا ، ابوموسیٰ نے کہا : اچھا بیٹھئیے ، معاذ نے پھر کہا : اللہ اور اس کے رسول کے فیصلہ کی رو سے جب تک وہ قتل نہ کر دیا جائے میں نہیں بیٹھ سکتا ، آپ نے تین بار ایسا کہا ، چنانچہ انہوں نے اس کے قتل کا حکم دیا ، وہ قتل کر دیا گیا ، ( پھر وہ بیٹھے ) پھر ان دونوں نے آپس میں قیام اللیل ( تہجد کی نماز ) کا ذکر کیا تو ان دونوں میں سے ایک نے غالباً وہ معاذ بن جبل رضی اللہ عنہ تھے کہا : رہا میں ، تو میں سوتا بھی ہوں ، اور قیام بھی کرتا ہوں ، یا کہا قیام بھی کرتا ہوں اور سوتا بھی ہوں ، اور بحالت نیند بھی اسی ثواب کی امید رکھتا ہوں جو بحالت قیام رکھتا ہوں ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 943570,
        "last_updated": null
    },
    {
        "urduURN": 4143610,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 1,
        "babName": "مرتد ( دین اسلام سے پھر جانے والے ) کے حکم کا بیان ۔",
        "hadithNumber": 4355,
        "hadithSanad": "ابوموسیٰ اشعری رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "میرے پاس معاذ رضی اللہ عنہ آئے ، میں یمن میں تھا ، ایک یہودی نے اسلام قبول کر لیا ، پھر وہ اسلام سے مرتد ہو گیا ، تو جب معاذ رضی اللہ عنہ آئے کہنے تو لگے : میں اس وقت تک اپنی سواری سے نہیں اتر سکتا جب تک وہ قتل نہ کر دیا جائے چنانچہ وہ قتل کر دیا گیا ، اس سے پہلے اسے توبہ کے لیے کہا جا چکا تھا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 943580,
        "last_updated": null
    },
    {
        "urduURN": 4143620,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 1,
        "babName": "مرتد ( دین اسلام سے پھر جانے والے ) کے حکم کا بیان ۔",
        "hadithNumber": 4356,
        "hadithSanad": "اس سند سے بھی ابوبردہ رضی اللہ عنہ سے یہی واقعہ مروی ہے ، وہ کہتے ہیں",
        "hadithText": "ابوموسیٰ رضی اللہ عنہ کے پاس ایک شخص کو لے کر آیا گیا جو اسلام سے مرتد گیا تھا ، بیس دن تک یا اس کے لگ بھگ وہ اسے اسلام کی دعوت دیتے رہے کہ اسی دوران معاذ رضی اللہ عنہ آ گئے تو آپ نے بھی اسے اسلام کی دعوت دی لیکن اس نے انکار کر دیا تو آپ نے اس کی گردن مار دی ۔ ابوداؤد کہتے ہیں : اسے عبدالملک بن عمیر نے ابوبردہ سے روایت کیا ہے لیکن انہوں نے اس میں ” توبہ کرانے کا ذکر نہیں کیا ہے “ اور اسے ابن فضیل نے شیبانی سے شیبانی نے سعید بن ابی بردہ سے ، ابوبردہ نے اپنے والد ابوبردہ سے اور ابوبردہ نے ابوموسیٰ اشعری سے روایت کیا ہے اور اس میں بھی انہوں نے ” توبہ کرانے کا ذکر نہیں کیا ہے “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 943590,
        "last_updated": null
    },
    {
        "urduURN": 4143630,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 1,
        "babName": "مرتد ( دین اسلام سے پھر جانے والے ) کے حکم کا بیان ۔",
        "hadithNumber": 4357,
        "hadithSanad": "قاسم سے بھی یہی واقعہ مروی ہے اس میں ہے کہ",
        "hadithText": "جب تک اس کی گردن مار نہیں دی گئی وہ سواری سے نیچے نہیں اترے اور انہوں نے اس سے توبہ نہیں کرائی ۱؎ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 943600,
        "last_updated": null
    },
    {
        "urduURN": 4143640,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 1,
        "babName": "مرتد ( دین اسلام سے پھر جانے والے ) کے حکم کا بیان ۔",
        "hadithNumber": 4358,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "عبداللہ بن سعد بن ابی سرح ۱؎ رسول اللہ صلی اللہ علیہ وسلم کا منشی تھا ، پھر شیطان نے اس کو بہکا لیا ، اور وہ کافروں سے جا ملا تو رسول اللہ صلی اللہ علیہ وسلم نے فتح مکہ کے دن اس کے قتل کا حکم دیا ، پھر عثمان بن عفان رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے اس کے لیے امان مانگی تو آپ نے اسے امان دی ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 943610,
        "last_updated": null
    },
    {
        "urduURN": 4143650,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 1,
        "babName": "مرتد ( دین اسلام سے پھر جانے والے ) کے حکم کا بیان ۔",
        "hadithNumber": 4359,
        "hadithSanad": "سعد رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "جب مکہ فتح ہوا تو عبداللہ بن سعد بن ابی سرح عثمان بن عفان رضی اللہ عنہ کے پاس چھپ گیا ، پھر آپ نے اسے نبی اکرم صلی اللہ علیہ وسلم کے پاس لا کھڑا کیا ، اور عرض کیا : اللہ کے رسول ! عبداللہ سے بیعت لے لیجئے ، آپ صلی اللہ علیہ وسلم نے اپنا سر اٹھایا اور اس کی طرف تین بار دیکھا ، ہر بار آپ انکار فرماتے رہے ، پھر تین دفعہ کے بعد آپ نے اس سے بیعت لے لی پھر آپ صلی اللہ علیہ وسلم اپنے صحابہ کی جانب متوجہ ہوئے اور فرمایا : ” کیا تم میں کوئی ایسا نیک بخت انسان نہیں تھا کہ اس وقت اسے کھڑا ہوا پا کر قتل کر دیتا ، جب اس نے یہ دیکھ لیا تھا کہ میں اس سے بیعت کے لیے اپنا ہاتھ روکے ہوئے ہوں “ تو لوگوں نے عرض کیا : اللہ کے رسول ! آپ کا جو منشا تھا ہمیں معلوم نہ ہو سکا ، آپ نے اپنی آنکھ سے ہمیں اشارہ کیوں نہیں کر دیا ۱؎ ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” کسی نبی کو یہ بات زیب نہیں دیتی کہ وہ کنکھیوں سے پوشیدہ اشارے کرے “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 943620,
        "last_updated": null
    },
    {
        "urduURN": 4143660,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 1,
        "babName": "مرتد ( دین اسلام سے پھر جانے والے ) کے حکم کا بیان ۔",
        "hadithNumber": 4360,
        "hadithSanad": "جریر رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "میں نے نبی اکرم صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : ” جب غلام دارالحرب بھاگ جائے تو اس کا خون مباح ہو گیا ۱؎ “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 943630,
        "last_updated": null
    },
    {
        "urduURN": 4143670,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 2,
        "babName": "نبی اکرم صلی+اللہ+علیہ+وسلم کی شان میں گستاخی کرنے والے کا حکم ۔",
        "hadithNumber": 4361,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما کا بیان ہے کہ",
        "hadithText": "ایک نابینا شخص کے پاس ایک ام ولد تھی جو نبی اکرم صلی اللہ علیہ وسلم کو گالیاں دیتی اور آپ کی ہجو کیا کرتی تھی ، وہ نابینا اسے روکتا تھا لیکن وہ نہیں رکتی تھی ، وہ اسے جھڑکتا تھا لیکن وہ کسی طرح باز نہیں آتی تھی حسب معمول ایک رات اس نے آپ صلی اللہ علیہ وسلم کی ہجو شروع کی ، اور آپ کو گالیاں دینے لگی ، تو اس ( اندھے ) نے ایک چھری لی اور اسے اس کے پیٹ پر رکھ کر خوب زور سے دبا کر اسے ہلاک کر دیا ، اس کے دونوں پاؤں کے درمیان اس کے پیٹ سے ایک بچہ گرا جس نے اس جگہ کو جہاں وہ تھی خون سے لت پت کر دیا ، جب صبح ہوئی تو آپ صلی اللہ علیہ وسلم سے اس حادثہ کا ذکر کیا گیا ، آپ نے لوگوں کو اکٹھا کیا ، اور فرمایا : ” جس نے یہ کیا ہے میں اس سے اللہ کا اور اپنے حق کا واسطہ دے کر کہتا ہوں کہ وہ کھڑا ہو جائے “ تو وہ اندھا کھڑا ہو گیا اور لوگوں کی گردنیں پھاندتے اور ہانپتے کانپتے آ کر آپ صلی اللہ علیہ وسلم کے سامنے بیٹھ گیا ، اور عرض کرنے لگا : اللہ کے رسول میں اس کا مولی ہوں ، وہ آپ کو گالیاں دیتی اور آپ کی ہجو کیا کرتی تھی ، میں اسے منع کرتا تھا لیکن وہ نہیں رکتی تھی ، میں اسے جھڑکتا تھا لیکن وہ کسی صورت سے باز نہیں آتی تھی ، میرے اس سے موتیوں کے مانند دو بچے ہیں ، وہ مجھے بڑی محبوب تھی تو جب کل رات آئی حسب معمول وہ آپ کو گالیاں دینے لگی ، اور ہجو کرنی شروع کی ، میں نے ایک چھری اٹھائی اور اسے اس کے پیٹ پر رکھ کر خوب زور سے دبا دیا ، وہ اس کے پیٹ میں گھس گئی یہاں تک کہ میں نے اسے مار ہی ڈالا ، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” لوگو ! سنو تم گواہ رہنا کہ اس کا خون لغو ہے “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 943640,
        "last_updated": null
    },
    {
        "urduURN": 4143680,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 2,
        "babName": "نبی اکرم صلی+اللہ+علیہ+وسلم کی شان میں گستاخی کرنے والے کا حکم ۔",
        "hadithNumber": 4362,
        "hadithSanad": "علی رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "ایک یہودی عورت نبی اکرم صلی اللہ علیہ وسلم کو گالیاں دیتی اور آپ کی ہجو کیا کرتی تھی ، تو ایک شخص نے اس کا گلا گھونٹ دیا ، یہاں تک کہ وہ مر گئی تو رسول اللہ صلی اللہ علیہ وسلم نے اس کا خون باطل ٹھہرا دیا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 943650,
        "last_updated": null
    },
    {
        "urduURN": 4143690,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 2,
        "babName": "نبی اکرم صلی+اللہ+علیہ+وسلم کی شان میں گستاخی کرنے والے کا حکم ۔",
        "hadithNumber": 4363,
        "hadithSanad": "ابوبرزہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "میں ابوبکر رضی اللہ عنہ کے پاس تھا ، وہ ایک شخص پر ناراض ہوئے اور بہت سخت ناراض ہوئے تو میں نے عرض کیا : اللہ کے رسول کے خلیفہ ! مجھے اجازت دیجئیے میں اس کی گردن مار دوں ، میری اس بات نے ان کے غصہ کو ٹھنڈا کر دیا ، پھر وہ اٹھے اور اندر چلے گئے ، پھر مجھ کو بلایا اور پوچھا : ابھی تم نے کیا کہا تھا ؟ میں نے کہا : میں نے کہا تھا : مجھے اجازت دیجئیے ، میں اس کی گردن مار دوں ، بولے : اگر میں تمہیں حکم دے دیتا تو تم اسے کر گزرتے ؟ میں نے عرض کیا : ہاں ، ضرور ، بولے : نہیں ، قسم اللہ کی ! محمد صلی اللہ علیہ وسلم کے بعد کسی آدمی کو بھی یہ مرتبہ حاصل نہیں ۱؎ ۔ ابوداؤد کہتے ہیں : یہ یزید کے الفاظ ہیں ، احمد بن حنبل کہتے ہیں : یعنی ابوبکر ایسا نہیں کر سکتے تھے کہ وہ کسی شخص کو بغیر ان تین باتوں میں سے کسی ایک کے جسے رسول اللہ صلی اللہ علیہ وسلم نے بیان کیا ہے قتل کرنے کا حکم دے دیں : ایک ایمان کے بعد کافر ہو جانا دوسرے شادی شدہ ہونے کے بعد زنا کرنا ، تیسرے بغیر نفس کے کسی نفس کو قتل کرنا ، البتہ نبی اکرم صلی اللہ علیہ وسلم قتل کر سکتے تھے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 943660,
        "last_updated": null
    },
    {
        "urduURN": 4143700,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 3,
        "babName": "اللہ و رسول سے محاربہ ( جنگ ) کا بیان ۔",
        "hadithNumber": 4364,
        "hadithSanad": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "قبیلہ عکل ، یا قبیلہ عرینہ کے کچھ لوگ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے تو مدینہ کی آب و ہوا انہیں راس نہ آئی ، رسول اللہ صلی اللہ علیہ وسلم نے انہیں دودھ والی چند اونٹنیاں دلوائیں ، اور انہیں حکم دیا کہ وہ ان کے پیشاب اور دودھ پئیں ، وہ ( اونٹنیاں لے کر ) چلے گئے جب وہ صحت یاب ہو گئے تو رسول اللہ صلی اللہ علیہ وسلم کے چرواہے کو قتل کر ڈالا ، اور اونٹ ہانک لے گئے تو نبی اکرم صلی اللہ علیہ وسلم کو صبح ہی صبح اس کی خبر مل گئی ، چنانچہ آپ نے ان کے تعاقب میں لوگوں کو روانہ کیا ، تو ابھی دن بھی اوپر نہیں چڑھنے پایا تھا کہ انہیں پکڑ کر لے آیا گیا ، آپ صلی اللہ علیہ وسلم نے حکم دیا تو ان کے ہاتھ اور پیر کاٹ دئیے گئے ، ان کی آنکھوں میں گرم سلائیاں پھیر دی گئیں ، اور وہ گرم سیاہ پتھریلی زمین میں ڈال دیئے گئے ، وہ پانی مانگتے تھے لیکن انہیں پانی نہیں دیا جاتا تھا ، ابوقلابہ کہتے ہیں : ان لوگوں نے چوری کی تھی ، قتل کیا تھا ، ایمان لانے کے بعد کافر ہو گئے تھے اور اللہ اور اس کے رسول سے جنگ کی تھی ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 943670,
        "last_updated": null
    },
    {
        "urduURN": 4143710,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 3,
        "babName": "اللہ و رسول سے محاربہ ( جنگ ) کا بیان ۔",
        "hadithNumber": 4365,
        "hadithSanad": "اس سند سے بھی ایوب سے یہی حدیث مروی ہے اس میں ہے",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے سلائیوں کو گرم کرنے کا حکم دیا تو وہ گرم کی گئیں ، پھر انہیں آپ صلی اللہ علیہ وسلم نے ان کی آنکھوں میں پھیر دیں ، ان کے ہاتھ اور پیر کاٹ ڈالے ، اور ان کو یکبارگی ہی نہیں مار ڈالا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 943680,
        "last_updated": null
    },
    {
        "urduURN": 4143720,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 3,
        "babName": "اللہ و رسول سے محاربہ ( جنگ ) کا بیان ۔",
        "hadithNumber": 4366,
        "hadithSanad": "انس بن مالک رضی اللہ عنہ سے بھی یہی حدیث مروی ہے اس میں ہے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ان کے تعاقب میں کچھ مخبر بھیجے تو انہیں پکڑ کر لایا گیا ، تو اللہ تعالیٰ نے اس سلسلہ میں آیت کریمہ «إنما جزاء الذين يحاربون الله ورسوله ويسعون في الأرض فسادا» ” جو اللہ اور اس کے رسول سے لڑیں اور زمین میں فساد کرتے پھریں ان کی سزا یہی ہے کہ وہ قتل کر دئیے جائیں “ ( سورۃ المائدہ : ۳۳ ) اتاری ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 943690,
        "last_updated": null
    },
    {
        "urduURN": 4143730,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 3,
        "babName": "اللہ و رسول سے محاربہ ( جنگ ) کا بیان ۔",
        "hadithNumber": 4367,
        "hadithSanad": "انس بن مالک رضی اللہ عنہ سے بھی یہی حدیث مروی ہے اس میں انس کہتے ہیں کہ",
        "hadithText": "میں نے ان میں سے ایک شخص کو دیکھا کہ وہ پیاس کی وجہ سے زمین کو اپنے منہ سے کاٹتا تھا یہاں تک کہ وہ سب ( پیاس سے تڑپ تڑپ کر ) مر گئے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 943700,
        "last_updated": null
    },
    {
        "urduURN": 4143740,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 3,
        "babName": "اللہ و رسول سے محاربہ ( جنگ ) کا بیان ۔",
        "hadithNumber": 4368,
        "hadithSanad": "اس سند سے بھی انس بن مالک سے یہی حدیث انہیں جیسے الفاظ سے مروی ہے",
        "hadithText": "اس میں یہ اضافہ ہے ” پھر آپ نے مثلہ سے منع فرما دیا “ اور اس میں یہ ذکر نہیں ہے کہ ایک طرف کا ہاتھ کاٹا تو دوسرے طرف کا پیر ۔ شعبہ نے قتادہ اور سلام بن مسکین سے انہوں نے ثابت سے ، ثابت نے انس سے روایت کی ہے لیکن ان دونوں نے بھی یہ ذکر نہیں کیا ہے کہ ایک طرف کا ہاتھ کاٹا ، تو دوسری طرف کا پیر اور مجھے حماد بن سلمہ کے علاوہ کسی کی روایت میں یہ اضافہ نہیں ملا کہ ایک طرف کا ہاتھ کاٹا تو دوسری طرف کا پیر ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 943710,
        "last_updated": null
    },
    {
        "urduURN": 4143750,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 3,
        "babName": "اللہ و رسول سے محاربہ ( جنگ ) کا بیان ۔",
        "hadithNumber": 4369,
        "hadithSanad": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "کچھ لوگوں نے نبی اکرم صلی اللہ علیہ وسلم کے اونٹوں کو لوٹ کر انہیں ہنکا لے گئے ، اسلام سے مرتد ہو گئے ، اور آپ صلی اللہ علیہ وسلم کے مومن چرواہے کو قتل کر دیا ، تو آپ نے ان کے تعاقب میں کچھ لوگوں کو بھیجا ، وہ پکڑے گئے ، تو آپ صلی اللہ علیہ وسلم نے ان کے ہاتھ اور پیر کاٹ دیئے گئے ، اور ان کی آنکھوں پر گرم سلائیاں پھیر دیں ، انہیں لوگوں کے متعلق آیت محاربہ نازل ہوئی ، اور انہیں لوگوں کے متعلق انس بن مالک رضی اللہ عنہ نے حجاج کو خبر دی تھی جس وقت اس نے آپ سے پوچھا تھا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 943720,
        "last_updated": null
    },
    {
        "urduURN": 4143760,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 3,
        "babName": "اللہ و رسول سے محاربہ ( جنگ ) کا بیان ۔",
        "hadithNumber": 4370,
        "hadithSanad": "ابوالزناد سے روایت ہے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے جب ان لوگوں کے ( ہاتھ پاؤں ) کاٹے جنہوں نے آپ کے اونٹ چرائے تھے اور ان کی آنکھوں میں آگ کی سلائیاں پھیریں تو اللہ تعالیٰ نے آپ پر اس سلسلہ میں عتاب فرمایا : اور آیت محاربہ «إنما جزاء الذين يحاربون الله ورسوله ويسعون في الأرض فسادا أن يقتلوا أو يصلبوا» ” جو اللہ اور اس کے رسول سے لڑیں اور زمین میں فساد کرتے پھریں ان کی سزا یہی ہے کہ وہ قتل کر دئیے جائیں یا سولی پر چڑھا دئیے جائیں ( سورۃ المائدہ : ۳۳ ) اخیر تک نازل فرمائی ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 943730,
        "last_updated": null
    },
    {
        "urduURN": 4143770,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 3,
        "babName": "اللہ و رسول سے محاربہ ( جنگ ) کا بیان ۔",
        "hadithNumber": 4371,
        "hadithSanad": "محمد بن سیرین کہتے ہیں کہ",
        "hadithText": "یہ حدود کے نازل کئے جانے سے پہلے کی ہے یعنی انس رضی اللہ عنہ کی روایت ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 943740,
        "last_updated": null
    },
    {
        "urduURN": 4143780,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 3,
        "babName": "اللہ و رسول سے محاربہ ( جنگ ) کا بیان ۔",
        "hadithNumber": 4372,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "آیت کریمہ «إنما جزاء الذين يحاربون الله ورسوله ويسعون في الأرض فسادا أن يقتلوا أو يصلبوا أو تقطع أيديهم وأرجلهم من خلاف أو ينفوا من الأرض» سے «غفور رحيم» تک مشرکین کے متعلق نازل ہوئی ہے تو جو اس پر قابو پائے جانے سے پہلے توبہ کر لے تو ایسا نہ ہو گا کہ اس کے ذمہ سے حد ساقط ہو جائے ۲؎ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 943750,
        "last_updated": null
    },
    {
        "urduURN": 4143790,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 4,
        "babName": "شرعی حدود کو ختم کرنے کے لیے سفارش نہیں کی جا سکتی ۔",
        "hadithNumber": 4373,
        "hadithSanad": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ",
        "hadithText": "قریش کو ایک مخزومی عورت جس نے چوری کی تھی کے معاملہ نے فکرمند کر دیا ، وہ کہنے لگے : اس عورت کے سلسلہ میں کون رسول اللہ صلی اللہ علیہ وسلم سے بات کرے گا ؟ لوگوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم کے چہیتے اسامہ بن زید رضی اللہ عنہما کے سوا اور کس کو اس کی جرات ہو سکتی ہے ؟ چنانچہ اسامہ رضی اللہ عنہ نے آپ سے اس سلسلہ میں گفتگو کی تو آپ صلی اللہ علیہ وسلم نے فرمایا : ” اسامہ ! کیا تم اللہ کے حدود میں سے ایک حد کے سلسلہ میں مجھ سے سفارش کرتے ہو ! “ پھر آپ صلی اللہ علیہ وسلم کھڑے ہوئے اور خطبہ دیا ، آپ نے اس خطبہ میں فرمایا : ” تم سے پہلے کے لوگ اسی وجہ سے ہلاک ہوئے کیونکہ ان میں جب کوئی معزز آدمی چوری کرتا تو اسے چھوڑ دیتے اور جب کسی کمزور سے یہ جرم سرزد ہو جاتا تو اس پر حد قائم کرتے ، قسم اللہ کی اگر فاطمہ بنت محمد بھی چوری کرے تو میں اس کا ہاتھ بھی کاٹ ڈالوں گا “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 943760,
        "last_updated": null
    },
    {
        "urduURN": 4143800,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 4,
        "babName": "شرعی حدود کو ختم کرنے کے لیے سفارش نہیں کی جا سکتی ۔",
        "hadithNumber": 4374,
        "hadithSanad": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ",
        "hadithText": "ایک مخزومی عورت سامان مانگ کر لے جایا کرتی اور واپسی کے وقت اس کا انکار کر دیا کرتی تھی ، تو نبی اکرم صلی اللہ علیہ وسلم نے حکم دیا کہ اس کا ہاتھ کاٹ لیا جائے ۔ اور معمر نے لیث جیسی روایت بیان کی اس میں ہے تو نبی اکرم صلی اللہ علیہ وسلم نے اس کا ہاتھ کاٹ لیا ۔ ابوداؤد کہتے ہیں : ابن وہب نے اس حدیث کو یونس سے ، یونس نے زہری سے روایت کیا ، اور اس میں ویسے ہی ہے جیسے لیث نے کہا ہے کہ ایک عورت نے نبی اکرم صلی اللہ علیہ وسلم کے عہد میں فتح مکہ کے سال چوری کی ۔ اور اسے لیث نے یونس سے ، یونس نے ابن شہاب سے اسی سند سے روایت کیا ہے اس میں ہے کہ اس عورت نے ( کوئی چیز ) منگنی ( مانگ کر ) لی تھی ( پھر وہ مکر گئی تھی ) ۔ اور اسے مسعود بن اسود نے نبی اکرم صلی اللہ علیہ وسلم سے اسی حدیث کے مثل روایت کیا ہے اس میں یہ ہے کہ اس نے نبی اکرم صلی اللہ علیہ وسلم کے گھر سے ایک چادر چرائی تھی ۔ اور ابوزبیر نے جابر سے اسے یوں روایت کیا ہے کہ ایک عورت نے چوری کی ، پھر اس نے رسول اللہ صلی اللہ علیہ وسلم کی صاحبزادی زینب کی پناہ لی ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 943770,
        "last_updated": null
    },
    {
        "urduURN": 4143810,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 4,
        "babName": "شرعی حدود کو ختم کرنے کے لیے سفارش نہیں کی جا سکتی ۔",
        "hadithNumber": 4375,
        "hadithSanad": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” صاحب حیثیت اور محترم وبا وقار لوگوں کی لغزشوں کو معاف کر دیا کرو سوائے حدود کے “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 943780,
        "last_updated": null
    },
    {
        "urduURN": 4143820,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 5,
        "babName": "حاکم تک پہنچنے سے پہلے حد کو نظرانداز کرنا جائز ہے ۔",
        "hadithNumber": 4376,
        "hadithSanad": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما سے روایت ہے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” حدود کو آپس میں نظر انداز کرو ، جب حد میں سے کوئی چیز میرے پاس پہنچ گئی تو وہ واجب ہو گئی “ ( اسے معاف نہیں کیا جا سکتا ) ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 943790,
        "last_updated": null
    },
    {
        "urduURN": 4143830,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 6,
        "babName": "حد والوں پر پردہ ڈالنے کا بیان ۔",
        "hadithNumber": 4377,
        "hadithSanad": "نعیم بن ہزال اسلمی رضی اللہ عنہ روایت کرتے ہیں کہ",
        "hadithText": "ماعز رضی اللہ عنہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے اور آپ کے پاس چار دفعہ زنا کا اقرار کیا ، تو آپ نے انہیں رجم کرنے کا حکم دیا ، اور ہزال ( جس نے ان سے اقرار کے لیے کہا تھا ) سے کہا : ” اگر تم اسے اپنے کپڑے ڈال کر چھپا لیتے تو یہ تمہارے لیے زیادہ بہتر ہوتا “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 943800,
        "last_updated": null
    },
    {
        "urduURN": 4143840,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 6,
        "babName": "حد والوں پر پردہ ڈالنے کا بیان ۔",
        "hadithNumber": 4378,
        "hadithSanad": "ابن المنکدر سے روایت ہے کہ",
        "hadithText": "ہزال رضی اللہ عنہ نے ماعز رضی اللہ عنہ سے کہا تھا کہ وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس جائیں اور آپ کو بتا دیں ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 943810,
        "last_updated": null
    },
    {
        "urduURN": 4143850,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 7,
        "babName": "جس نے حد کا کام کیا پھر خود آ کر اقرار جرم کیا اس کے حکم کا بیان ۔",
        "hadithNumber": 4379,
        "hadithSanad": "وائل رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "ایک عورت رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں نماز پڑھنے کے ارادہ سے نکلی تو اس سے ایک مرد ملا اور اسے دبوچ لیا ، اور اس سے اپنی خواہش پوری کی تو وہ چلائی ، وہ جا چکا تھا ، اتنے میں اس کے پاس سے ایک اور شخص گزرا تو وہ کہنے لگی کہ اس ( فلاں ) نے میرے ساتھ ایسا ایسا کیا ہے ، اتنے میں مہاجرین کی ایک جماعت بھی آ گئی ان سے بھی اس نے یہی کہا کہ اس نے اس کے ساتھ ایسا ایسا کیا ہے ، تو وہ سب گئے اور اس شخص کو پکڑا جس کے متعلق اس نے کہا تھا کہ اس نے اس کے ساتھ زنا کیا ہے ، اور اسے لے کر آئے ، تو اس نے کہا : ہاں اسی نے کیا ہے ، چنانچہ وہ لوگ اسے لے کر نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے ، تو آپ صلی اللہ علیہ وسلم نے اس کے سلسلہ میں حکم دیا ( کہ اس پر حد جاری کی جائے ) یہ دیکھ کر اصل شخص جس نے اس سے صحبت کی تھی کھڑا ہو گیا ، اور کہنے لگا : اللہ کے رسول ! فی الواقع یہ کام میں نے کیا ہے ، تو آپ صلی اللہ علیہ وسلم نے اس عورت سے فرمایا : ” تم جاؤ اللہ تعالیٰ نے تمہیں بخش دیا ( کیونکہ یہ تیری رضا مندی سے نہیں ہوا تھا ) اور اس آدمی سے بھلی بات کہی “ ۔ ابوداؤد کہتے ہیں : مراد وہ آدمی ہے ( ناحق ) جو پکڑا گیا تھا ، اور اس آدمی کے متعلق جس نے زنا کیا تھا فرمایا : ” اس کو رجم کر دو “ پھر آپ صلی اللہ علیہ وسلم نے فرمایا : ” اس نے ایسی توبہ کی ہے کہ سارے مدینہ کے لوگ ایسی توبہ کریں تو ان کی طرف سے وہ قبول ہو جائے “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 943820,
        "last_updated": null
    },
    {
        "urduURN": 4143860,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 8,
        "babName": "حد میں ایسی بات کی تلقین کا بیان جس سے حد جاتی رہے ۔",
        "hadithNumber": 4380,
        "hadithSanad": "ابوامیہ مخزومی رضی اللہ عنہ سے روایت ہے کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم کے پاس ایک چور لایا گیا جس نے چوری کا اعتراف کر لیا تھا ، لیکن اس کے پاس کوئی سامان نہیں پایا گیا ، تو رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا : ” میں نہیں سمجھتا کہ تم نے چوری کی ہے “ اس نے کہا : کیوں نہیں ، ضرور چرایا ہے ، اسی طرح اس نے آپ سے دو یا تین بار دہرایا ، پھر آپ صلی اللہ علیہ وسلم نے اس پر حد جاری کرنے کا حکم فرمایا ، تو اس کا ہاتھ کاٹ لیا گیا ، اور اسے لایا گیا ، تو آپ نے فرمایا : ” اللہ سے مغفرت طلب کرو ، اور اس سے توبہ کرو “ اس نے کہا : میں اللہ سے مغفرت طلب کرتا ہوں ، اور اس سے توبہ کرتا ہوں ، تو آپ نے تین بار فرمایا : ” اے اللہ اس کی توبہ قبول فرما “ ۔ ابوداؤد کہتے ہیں : عمرو بن عاصم نے اسے ہمام سے ، ہمام نے اسحاق بن عبداللہ سے ، اسحاق نے ابوامیہ انصاری سے اور انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے مرفوعاً روایت کی ہے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 943830,
        "last_updated": null
    },
    {
        "urduURN": 4143870,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 9,
        "babName": "آدمی یہ اعتراف کرے کہ وہ حد کا مستحق ہے لیکن جرم نہ بتائے اس کے حکم کا بیان ۔",
        "hadithNumber": 4381,
        "hadithSanad": "ابوامامہ رضی اللہ عنہ کا بیان ہے کہ",
        "hadithText": "ایک شخص نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا اور عرض کیا : اللہ کے رسول ! میں حد کا مرتکب ہو گیا ہوں تو آپ مجھ پر حد جاری کر دیجئیے ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” کیا جس وقت تم آئے تو وضو کیا ؟ “ اس نے کہا : ہاں ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” جس وقت ہم نے نماز پڑھی تم کیا تو نے بھی نماز پڑھی ؟ “ اس نے کہا : ہاں ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” جاؤ اللہ نے تمہیں معاف کر دیا “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 943840,
        "last_updated": null
    },
    {
        "urduURN": 4143880,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 10,
        "babName": "جرم کی تفتیش میں مجرم کو مارنا پیٹنا کیسا ہے ؟",
        "hadithNumber": 4382,
        "hadithSanad": "ازہر بن عبداللہ حرازی کا بیان ہے کہ",
        "hadithText": "کلاع کے کچھ لوگوں کا مال چرایا گیا تو انہوں نے کچھ کپڑا بننے والوں پر الزام لگایا اور انہیں صحابی رسول نعمان بن بشیر رضی اللہ عنہما کے پاس لے کر آئے ، تو آپ نے انہیں چند دنوں تک قید میں رکھا پھر چھوڑ دیا ، پھر وہ سب نعمان رضی اللہ عنہ کے پاس آئے ، اور کہا کہ آپ نے انہیں بغیر مارے اور بغیر پوچھ تاچھ کئے چھوڑ دیا ، نعمان رضی اللہ عنہ نے کہا : تم کیا چاہتے ہو اگر تمہاری یہی خواہش ہے تو میں ان کی پٹائی کرتا ہوں ، اگر تمہارا سامان ان کے پاس نکلا تو ٹھیک ہے ورنہ اتنا ہی تمہاری پٹائی ہو گی جتنا ان کو مارا تھا ، تو انہوں نے پوچھا : یہ آپ کا فیصلہ ہے ؟ نعمان رضی اللہ عنہ نے کہا : نہیں ، بلکہ یہ اللہ اور اس کے رسول صلی اللہ علیہ وسلم کا فیصلہ ہے ۔ ابوداؤد کہتے ہیں : اس قول سے نعمان رضی اللہ عنہ نے ڈرا دیا ، مطلب یہ ہے کہ مارنا پیٹنا اعتراف کے بعد ہی واجب ہوتا ہے ۱؎ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 943850,
        "last_updated": null
    },
    {
        "urduURN": 4143890,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 11,
        "babName": "چور کا ہاتھ کتنے مال کی چوری میں کاٹا جائے ؟",
        "hadithNumber": 4383,
        "hadithSanad": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم چوتھائی دینار یا اس سے زائد میں ( چور کا ہاتھ ) کاٹتے تھے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 943860,
        "last_updated": null
    },
    {
        "urduURN": 4143900,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 11,
        "babName": "چور کا ہاتھ کتنے مال کی چوری میں کاٹا جائے ؟",
        "hadithNumber": 4384,
        "hadithSanad": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” چور کا ہاتھ چوتھائی دینار ، یا اس سے زائد میں کاٹا جائے “ ۔ احمد بن صالح کہتے ہیں : چور کا ہاتھ چوتھائی دینار یا اس سے زائد میں کٹے گا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 943870,
        "last_updated": null
    },
    {
        "urduURN": 4143910,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 11,
        "babName": "چور کا ہاتھ کتنے مال کی چوری میں کاٹا جائے ؟",
        "hadithNumber": 4385,
        "hadithSanad": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ایک ڈھال میں جس کی قیمت تین درہم تھی ( چور کا ہاتھ ) کاٹا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 943880,
        "last_updated": null
    },
    {
        "urduURN": 4143920,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 11,
        "babName": "چور کا ہاتھ کتنے مال کی چوری میں کاٹا جائے ؟",
        "hadithNumber": 4386,
        "hadithSanad": "عبداللہ بن عمر رضی اللہ عنہما نے لوگوں سے بیان کیا ہے کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے ایک شخص کا ہاتھ کاٹا جس نے عورتوں کے چبوترہ سے ایک ڈھال چرائی تھی جس کی قیمت تین درہم تھی ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 943890,
        "last_updated": null
    },
    {
        "urduURN": 4143930,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 11,
        "babName": "چور کا ہاتھ کتنے مال کی چوری میں کاٹا جائے ؟",
        "hadithNumber": 4387,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کا ہاتھ ایک ڈھال کے ( چرانے پر ) کاٹا جس کی قیمت ایک دینار یا دس درہم تھی ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 943900,
        "last_updated": null
    },
    {
        "urduURN": 4143940,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 12,
        "babName": "جن چیزوں کی چوری میں ہاتھ نہیں کاٹا جائے گا ان کا بیان ۔",
        "hadithNumber": 4388,
        "hadithSanad": "محمد بن یحییٰ بن حبان سے روایت ہے کہ",
        "hadithText": "ایک غلام نے ایک کھجور کے باغ سے ایک شخص کے کھجور کا پودا چرا لیا اور اسے لے جا کر اپنے مالک کے باغ میں لگا دیا ، پھر پودے کا مالک اپنا پودا ڈھونڈنے نکلا تو اسے ( ایک باغ میں لگا ) پایا تو اس نے مروان بن حکم سے جو اس وقت مدینہ کے حاکم تھے غلام کے خلاف شکایت کی مروان نے اس غلام کو قید کر لیا اور اس کا ہاتھ کاٹنا چاہا تو غلام کا مالک رافع بن خدیج رضی اللہ عنہ کے پاس گیا ، اور ان سے اس سلسلہ میں مسئلہ دریافت کیا تو انہوں نے اسے بتایا کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے : ” پھل اور جمار ( کھجور کے درخت کے پیڑی کا گابھا ) کی چوری میں ہاتھ نہیں کٹے گا “ تو اس شخص نے کہا : مروان نے میرے غلام کو پکڑ رکھا ہے وہ اس کا ہاتھ کاٹنا چاہتے ہیں میری خواہش ہے کہ آپ میرے ساتھ ان کے پاس چلیں اور اسے وہ بتائیں جو آپ نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے ، تو رافع بن خدیج رضی اللہ عنہ اس کے ساتھ چلے ، اور مروان کے پاس آئے ، اور ان سے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے : ” پھل اور گابھا کے ( چرانے میں ) ہاتھ نہیں کٹے گا “ مروان نے یہ سنا تو اس غلام کو چھوڑ دینے کا حکم دے دیا ، چنانچہ اسے چھوڑ دیا گیا ۔ ابوداؤد کہتے ہیں : «کثر» کے معنیٰ «جمار» کے ہیں ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 943910,
        "last_updated": null
    },
    {
        "urduURN": 4143950,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 12,
        "babName": "جن چیزوں کی چوری میں ہاتھ نہیں کاٹا جائے گا ان کا بیان ۔",
        "hadithNumber": 4389,
        "hadithSanad": "اس سند سے بھی محمد بن یحییٰ بن حبان سے یہی حدیث مروی ہے",
        "hadithText": "اس میں ہے مروان نے اسے کچھ کوڑے مار کر چھوڑ دیا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 943920,
        "last_updated": null
    },
    {
        "urduURN": 4143960,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 12,
        "babName": "جن چیزوں کی چوری میں ہاتھ نہیں کاٹا جائے گا ان کا بیان ۔",
        "hadithNumber": 4390,
        "hadithSanad": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم سے لٹکے ہوئے پھلوں کے متعلق دریافت کیا گیا تو آپ نے فرمایا : ” جس ضرورت مند نے اسے کھا لیا ، اور جمع کر کے نہیں رکھا تو اس پر کوئی گناہ نہیں ، اور جو اس میں سے کچھ لے جائے تو اس پر اس کا دوگنا تاوان اور سزا ہو گی اور جو اسے کھلیان میں جمع کئے جانے کے بعد چرائے اور وہ ڈھال کی قیمت کو پہنچ رہا ہو تو پھر اس کا ہاتھ کاٹا جائے گا “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 943930,
        "last_updated": null
    },
    {
        "urduURN": 4143970,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 13,
        "babName": "کھلم+کھلا چھین کر بھاگ جانا یا امانت میں خیانت کرنے سے ہاتھ نہیں کاٹا جائے گا ۔",
        "hadithNumber": 4391,
        "hadithSanad": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” اعلانیہ زبردستی کسی کا مال لے کر بھاگ جانے والے کا ہاتھ نہیں کاٹا جائے گا ۱؎ ، اور جو اعلانیہ کسی کا مال لوٹ لے وہ ہم میں سے نہیں “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 943940,
        "last_updated": null
    },
    {
        "urduURN": 4143980,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 13,
        "babName": "کھلم+کھلا چھین کر بھاگ جانا یا امانت میں خیانت کرنے سے ہاتھ نہیں کاٹا جائے گا ۔",
        "hadithNumber": 4392,
        "hadithSanad": "اور اسی سند سے مروی ہے",
        "hadithText": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” امانت میں خیانت کرنے والے کا ہاتھ نہیں کاٹا جائے گا “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 943950,
        "last_updated": null
    },
    {
        "urduURN": 4143990,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 13,
        "babName": "کھلم+کھلا چھین کر بھاگ جانا یا امانت میں خیانت کرنے سے ہاتھ نہیں کاٹا جائے گا ۔",
        "hadithNumber": 4393,
        "hadithSanad": "جابر رضی اللہ عنہ نبی اکرم صلی اللہ علیہ وسلم سے اسی کے مثل روایت کرتے ہیں",
        "hadithText": "اس میں اتنا اضافہ ہے ” اور نہ اچکے کا ہاتھ کاٹا جائے گا “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 943960,
        "last_updated": null
    },
    {
        "urduURN": 4144000,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 14,
        "babName": "جو شخص کسی چیز کو محفوظ مقام سے چرائے اس کے حکم کا بیان ۔",
        "hadithNumber": 4394,
        "hadithSanad": "صفوان بن امیہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "میں مسجد میں سویا ہوا تھا ، میرے اوپر میری ایک اونی چادر پڑی تھی جس کی قیمت تیس درہم تھی ، اتنے میں ایک شخص آیا اور اسے مجھ سے چھین کر لے کر بھاگا ، لیکن وہ پکڑ لیا گیا ، اور اسے نبی اکرم صلی اللہ علیہ وسلم کے پاس لایا گیا ، تو آپ صلی اللہ علیہ وسلم نے اس کے متعلق حکم دیا کہ اس کا ہاتھ کاٹ لیا جائے ، تو میں آپ کے پاس آیا اور عرض کیا : کیا تیس درہم کی وجہ سے آپ اس کا ہاتھ کاٹ ڈالیں گے ؟ میں اسے اس کے ہاتھ بیچ دیتا ہوں ، اور اس کی قیمت اس پر ادھار چھوڑ دیتا ہوں ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” میرے پاس لانے سے پہلے ہی ایسے ایسے کیوں نہیں کر لیا “ ۔ ابوداؤد کہتے ہیں : اسے زائدہ نے سماک سے ، سماک نے جعید بن حجیر سے روایت کیا ہے ، اس میں ہے : ” صفوان سو گئے تھے اتنے میں چور آیا “ ۔ اور طاؤس و مجاہد نے اس کو یوں روایت کیا ہے کہ وہ سوئے تھے اتنے میں ایک چور آیا ، اور ان کے سر کے نیچے سے چادر چرا لی ۔ اور ابوسلمہ بن عبدالرحمٰن نے اسے یوں روایت کیا ہے کہ اس نے اسے ان کے سر کے نیچے سے کھینچا ، تو وہ جاگ گئے ، اور چلائے ، اور وہ پکڑ لیا گیا ۔ اور زہری نے صفوان بن عبداللہ سے اسے یوں روایت کیا ہے کہ وہ مسجد میں سوئے اور انہوں نے اپنی چادر کو تکیہ بنا لیا ، اتنے میں ایک چور آیا ، اور اس نے ان کی چادر چرا لی ، تو اسے پکڑ لیا گیا ، اور نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں لایا گیا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 943970,
        "last_updated": null
    },
    {
        "urduURN": 4144010,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 15,
        "babName": "منگنی ( مانگے کی چیز ) لے کر کوئی مکر جائے تو اس کا ہاتھ کاٹا جائے گا ۔",
        "hadithNumber": 4395,
        "hadithSanad": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ",
        "hadithText": "قبیلہ مخزوم کی ایک عورت لوگوں سے چیزیں منگنی ( مانگ کر ) لے کر مکر جایا کرتی تھی ، تو نبی اکرم صلی اللہ علیہ وسلم نے اس کے متعلق حکم دیا تو اس کا ہاتھ کاٹ لیا گیا ۔ ابوداؤد کہتے ہیں : اسے جویریہ نے نافع سے ، نافع نے ابن عمر سے یا صفیہ بنت ابی عبید سے روایت کیا ہے ، اس میں یہ اضافہ ہے کہ نبی اکرم صلی اللہ علیہ وسلم خطبہ کے لیے کھڑے ہوئے ، اور آپ نے تین بار فرمایا : ” کیا کوئی عورت ہے جو اللہ اور اس کے رسول کے سامنے توبہ کرے ؟ وہ وہاں موجود تھی لیکن وہ نہ کھڑی ہوئی اور نہ کچھ بولی “ ۔ اور اسے ابن غنج نے نافع سے ، نافع نے صفیہ بنت ابی عبید سے روایت کیا ہے ، اس میں ہے کہ آپ نے اس کے خلاف گواہی دی ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 943980,
        "last_updated": null
    },
    {
        "urduURN": 4144020,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 15,
        "babName": "منگنی ( مانگے کی چیز ) لے کر کوئی مکر جائے تو اس کا ہاتھ کاٹا جائے گا ۔",
        "hadithNumber": 4396,
        "hadithSanad": "ابن شہاب زہری کہتے ہیں کہ",
        "hadithText": "عروہ بیان کرتے تھے کہ ام المؤمنین عائشہ رضی اللہ عنہا نے کہا ہے کہ ایک عورت نے جسے کوئی نہیں جانتا تھا چند معروف لوگوں کی شہادت اور ذمہ داری پر ایک زیور منگنی لی اور اسے بیچ کر کھا گئی تو اسے پکڑ کر نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں لایا گیا ، تو آپ نے اس کا ہاتھ کاٹنے کا حکم دیا ، یہ وہی عورت ہے جس کے سلسلہ میں اسامہ بن زید رضی اللہ عنہما نے سفارش کی تھی ، اور اس کے بارے میں رسول اللہ صلی اللہ علیہ وسلم کو جو فرمانا تھا فرمایا تھا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 943990,
        "last_updated": null
    },
    {
        "urduURN": 4144030,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 15,
        "babName": "منگنی ( مانگے کی چیز ) لے کر کوئی مکر جائے تو اس کا ہاتھ کاٹا جائے گا ۔",
        "hadithNumber": 4397,
        "hadithSanad": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ",
        "hadithText": "قبیلہ مخزوم کی ایک عورت سامان منگنی ( مانگ کر ) لیتی اور اس سے مکر جایا کرتی تھی ، تو نبی اکرم صلی اللہ علیہ وسلم نے اس کا ہاتھ کاٹنے کا حکم دیا ۔ معمر نے اسی طرح کی روایت بیان کی جیسے قتیبہ نے لیث سے ، لیث نے ابن شہاب سے بیان کی ہے ، اس میں اتنا اضافہ ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے اس کا ہاتھ کاٹ لیا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 944000,
        "last_updated": null
    },
    {
        "urduURN": 4144040,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 16,
        "babName": "دیوانہ اور پاگل چوری کرے یا حد کا ارتکاب کرے تو کیا حکم ہے ؟",
        "hadithNumber": 4398,
        "hadithSanad": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” تین شخصوں سے قلم اٹھا لیا گیا ہے ، سوئے ہوئے شخص سے یہاں تک کہ وہ بیدار ہو جائے ، دیوانہ سے یہاں تک کہ اسے عقل آ جائے ، اور بچہ سے یہاں تک کہ وہ بالغ ہو جائے “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 944010,
        "last_updated": null
    },
    {
        "urduURN": 4144050,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 16,
        "babName": "دیوانہ اور پاگل چوری کرے یا حد کا ارتکاب کرے تو کیا حکم ہے ؟",
        "hadithNumber": 4399,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "عمر رضی اللہ عنہ کے پاس ایک پاگل عورت لائی گئی جس نے زنا کا ارتکاب کیا تھا ، آپ نے اس کے سلسلہ میں کچھ لوگوں سے مشورہ کیا ، پھر آپ نے اسے رجم کئے جانے کا حکم دے دیا ، تو اسے لے کر لوگ علی بن ابی طالب رضی اللہ عنہ کے پاس سے گزرے تو انہوں نے لوگوں سے پوچھا : کیا معاملہ ہے ؟ لوگوں نے بتایا کہ ایک پاگل عورت ہے جس نے زنا کا ارتکاب کیا ہے ، عمر نے اسے رجم کئے جانے کا حکم دیا ہے ، تو علی رضی اللہ عنہ نے کہا : اسے واپس لے چلو ، پھر وہ عمر رضی اللہ عنہ کے پاس آئے اور کہا : امیر المؤمنین ! کیا آپ کو یہ معلوم نہیں کہ قلم تین شخصوں سے اٹھا لیا گیا ہے : دیوانہ سے یہاں تک کہ اسے عقل آ جائے ، سوئے ہوئے سے یہاں تک کہ وہ بیدار ہو جائے ، اور بچہ سے یہاں تک کہ وہ بالغ ہو جائے ، کہا : کیوں نہیں ؟ ضرور معلوم ہے ، تو بولے : پھر یہ کیوں رجم کی جا رہی ہے ؟ بولے : کوئی بات نہیں ، تو علی رضی اللہ عنہ نے کہا : پھر اسے چھوڑیئے ، تو انہوں نے اسے چھوڑ دیا ، اور لگے اللہ اکبر کہنے ۱؎ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 944020,
        "last_updated": null
    },
    {
        "urduURN": 4144060,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 16,
        "babName": "دیوانہ اور پاگل چوری کرے یا حد کا ارتکاب کرے تو کیا حکم ہے ؟",
        "hadithNumber": 4400,
        "hadithSanad": "اس سند سے اعمش سے",
        "hadithText": "اسی جیسی حدیث مروی ہے اس میں بھی «حتى يعقل» ہے اور «عن المجنون حتى يبرأ» کے بجائے «حتى يفيق» ہے ، اور «فجعل يكبر» کے بجائے «فجعل عمر يكبر» ہے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 944030,
        "last_updated": null
    },
    {
        "urduURN": 4144070,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 16,
        "babName": "دیوانہ اور پاگل چوری کرے یا حد کا ارتکاب کرے تو کیا حکم ہے ؟",
        "hadithNumber": 4401,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "اسے علی بن ابی طالب رضی اللہ عنہ کے پاس سے گزارا گیا ، آگے اسی طرح جیسے عثمان بن ابی شیبہ کی روایت کا مفہوم ہے ، اس میں ہے : کیا آپ کو یاد نہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے : ” قلم تین آدمیوں سے اٹھا لیا گیا ہے : مجنون سے جس کی عقل جاتی رہے یہاں تک کہ صحت یاب ہو جائے ، سوئے ہوئے شخص سے یہاں تک کہ وہ بیدار ہو جائے ، بچے سے یہاں تک کہ وہ بالغ ہو جائے “ تو عمر رضی اللہ عنہ بولے : تم نے سچ کہا ، پھر انہوں نے اسے چھوڑ دیا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 944040,
        "last_updated": null
    },
    {
        "urduURN": 4144080,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 16,
        "babName": "دیوانہ اور پاگل چوری کرے یا حد کا ارتکاب کرے تو کیا حکم ہے ؟",
        "hadithNumber": 4402,
        "hadithSanad": "ابوظبیان جنی کہتے ہیں کہ",
        "hadithText": "عمر رضی اللہ عنہ کے پاس ایک عورت لائی گئی جس نے زنا کا ارتکاب کیا تھا ، تو انہوں نے اسے رجم کرنے کا حکم دیا ، علی رضی اللہ عنہ کا وہاں سے گزر ہوا ، انہوں نے اسے پکڑا اور چھوڑ دیا ، تو عمر کو اس کی خبر دی گئی تو انہوں نے کہا : علی رضی اللہ عنہ کو میرے پاس بلاؤ ، چنانچہ علی رضی اللہ عنہ آئے اور کہنے لگے : امیر المؤمنین ! آپ کو معلوم ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے : ” قلم تین شخصوں سے اٹھا لیا گیا ہے : بچہ سے یہاں تک کہ وہ بالغ ہو جائے ، سوئے ہوئے شخص سے یہاں تک کہ وہ بیدار ہو جائے ، اور دیوانہ سے یہاں تک کہ وہ اچھا ہو جائے “ اور یہ تو دیوانی اور پاگل ہے ، فلاں قوم کی ہے ، ہو سکتا ہے اس کے پاس جو آیا ہو اس حالت میں آیا ہو کہ وہ دیوانگی کی شدت میں مبتلاء رہی ہو ، تو عمر رضی اللہ عنہ نے کہا : مجھے نہیں معلوم کہ وہ اس وقت دیوانی تھی ، اس پر علی رضی اللہ عنہ نے کہا : مجھے یہ بھی نہیں معلوم کہ وہ نہیں تھی ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 944050,
        "last_updated": null
    },
    {
        "urduURN": 4144090,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 16,
        "babName": "دیوانہ اور پاگل چوری کرے یا حد کا ارتکاب کرے تو کیا حکم ہے ؟",
        "hadithNumber": 4403,
        "hadithSanad": "علی رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” قلم تین آدمیوں سے اٹھا لیا گیا ہے : سوئے ہوئے شخص سے یہاں تک کہ وہ بیدار ہو جائے ، بچے سے یہاں تک کہ وہ بالغ ہو جائے ، اور دیوانے سے یہاں تک کہ اسے عقل آ جائے “ ۔ ابوداؤد کہتے ہیں : اسے ابن جریج نے قاسم بن یزید سے انہوں نے علی رضی اللہ عنہ سے ، علی رضی اللہ عنہ نے نبی اکرم صلی اللہ علیہ وسلم سے مرفوعاً روایت کیا ہے ، اور اس میں ” کھوسٹ بوڑھے “ کا اضافہ ہے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 944060,
        "last_updated": null
    },
    {
        "urduURN": 4144100,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 17,
        "babName": "نابالغ لڑکا حد کا مرتکب ہو جائے تو اس کے حکم کا بیان ۔",
        "hadithNumber": 4404,
        "hadithSanad": "عطیہ قرظی کہتے ہیں کہ",
        "hadithText": "بنی قریظہ کے قیدیوں میں میں بھی تھا تو لوگ دیکھتے تھے جس کے زیر ناف کے بال اگے ہوتے انہیں قتل کر دیتے تھے اور جن کے بال نہیں اگے تھے انہیں قتل نہیں کرتے ، تو میں ان لوگوں میں سے تھا جن کے بال نہیں اگے تھے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 944070,
        "last_updated": null
    },
    {
        "urduURN": 4144110,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 17,
        "babName": "نابالغ لڑکا حد کا مرتکب ہو جائے تو اس کے حکم کا بیان ۔",
        "hadithNumber": 4405,
        "hadithSanad": "عبدالملک بن عمیر سے بھی یہی حدیث مروی ہے",
        "hadithText": "اس میں ہے انہوں نے میرے زیر ناف کا حصہ کھولا تو دیکھا کہ وہ اگا نہیں تھا تو مجھے قیدی بنا لیا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 944080,
        "last_updated": null
    },
    {
        "urduURN": 4144120,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 17,
        "babName": "نابالغ لڑکا حد کا مرتکب ہو جائے تو اس کے حکم کا بیان ۔",
        "hadithNumber": 4406,
        "hadithSanad": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ",
        "hadithText": "وہ نبی اکرم صلی اللہ علیہ وسلم کے سامنے غزوہ احد کے دن پیش کئے گئے تو ان کی عمر چودہ سال کی تھی آپ نے انہیں جنگ میں شمولیت کی اجازت نہیں دی ، اور غزوہ خندق میں پیش ہوئے تو پندرہ سال کے تھے تو آپ صلی اللہ علیہ وسلم نے انہیں اجازت دے دی ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 944090,
        "last_updated": null
    },
    {
        "urduURN": 4144130,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 17,
        "babName": "نابالغ لڑکا حد کا مرتکب ہو جائے تو اس کے حکم کا بیان ۔",
        "hadithNumber": 4407,
        "hadithSanad": "نافع کہتے ہیں اس حدیث کو میں نے عمر بن عبدالعزیز سے بیان کیا",
        "hadithText": "تو انہوں نے کہا : یہی بالغ اور نابالغ کی حد ہے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 944100,
        "last_updated": null
    },
    {
        "urduURN": 4144140,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 18,
        "babName": "کیا جنگ میں چوری کرنے والے کا ہاتھ کاٹا جائے گا ؟",
        "hadithNumber": 4408,
        "hadithSanad": "جنادہ بن ابی امیہ کہتے ہیں کہ",
        "hadithText": "ہم بسر بن ارطاۃ کے ساتھ سمندری سفر پر تھے کہ ان کے پاس ایک چور لایا گیا جس کا نام مصدر تھا اس نے ایک اونٹ چرایا تھا تو آپ نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے : ” سفر میں ہاتھ نہیں کاٹا جائے گا “ اگر آپ کا یہ فرمان نہ ہوتا تو میں ضرور اسے کاٹ ڈالتا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 944110,
        "last_updated": null
    },
    {
        "urduURN": 4144150,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 19,
        "babName": "کفن چور کے ہاتھ کاٹنے کا بیان ۔",
        "hadithNumber": 4409,
        "hadithSanad": "ابوذر رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” ابوذر ! “ میں نے کہا : حاضر ہوں ، اور حکم بجا لانے کے لیے تیار ہوں ، اللہ کے رسول ! آپ صلی اللہ علیہ وسلم نے فرمایا : ” اس وقت تمہارا کیا حال ہو گا جب لوگوں کو موت پہنچے گی اور گھر یعنی قبر ایک خادم کے بدلہ میں خریدی جائیگی ؟ “ میں نے عرض کیا : اللہ اور اس کے رسول کو زیادہ معلوم ہے ، یا جو اللہ اور اس کے رسول کو پسند ہو ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” صبر کو لازم پکڑنا “ یا فرمایا : ” اس دن صبر کرنا “ ۔ ابوداؤد کہتے ہیں : حماد بن ابی سلیمان کہتے ہیں : کفن چور کا ہاتھ کاٹا جائے گا کیونکہ وہ میت کے گھر میں گھسا ہے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 944120,
        "last_updated": null
    },
    {
        "urduURN": 4144160,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 20,
        "babName": "باربار چوری کرنے والے کی سزا کا بیان ۔",
        "hadithNumber": 4410,
        "hadithSanad": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم کے پاس ایک چور لایا گیا ، آپ نے فرمایا : ” اسے قتل کر دو “ لوگوں نے کہا : اللہ کے رسول ! اس نے صرف چوری کی ہے ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” اس کا ہاتھ کاٹ دو “ تو اس کا ہاتھ کاٹ دیا گیا ، پھر اسی شخص کو دوسری بار لایا گیا ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” اسے قتل کر دو “ لوگوں نے پھر یہی کہا : اللہ کے رسول ! اس نے صرف چوری ہی کی ہے ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” اچھا اس کا ہاتھ کاٹ دو “ تو اس کا ہاتھ کاٹ دیا گیا ، پھر وہی شخص تیسری بار لایا گیا ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” اس کو قتل کر دو “ لوگوں نے کہا : اللہ کے رسول ! اس نے صرف چوری ہی تو کی ہے ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” اچھا اس کا ایک پیر کاٹ دو “ پھر اسے پانچویں بار لایا گیا ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” اسے قتل کر دو “ ۔ جابر رضی اللہ عنہ کہتے ہیں : ہم اسے لے گئے اور ہم نے اسے قتل کر دیا ، اور گھسیٹ کر اسے ایک کنویں میں ڈال دیا ، اور اس پر پتھر مارے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 944130,
        "last_updated": null
    },
    {
        "urduURN": 4144170,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 21,
        "babName": "چور کا ہاتھ کاٹ کر اس کے گلے میں لٹکانے کا بیان ۔",
        "hadithNumber": 4411,
        "hadithSanad": "عبدالرحمٰن بن محیریز کہتے ہیں کہ",
        "hadithText": "میں نے فضالہ بن عبید سے چور کا ہاتھ کاٹ کر اس کے گلے میں لٹکانے کے متعلق پوچھا کہ کیا یہ مسنون ہے ؟ تو آپ نے کہا : رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک چور لایا گیا تو اس کا ہاتھ کاٹا گیا پھر آپ نے اس کے متعلق حکم دیا تو اسے اس کے گلے میں لٹکا دیا گیا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 944140,
        "last_updated": null
    },
    {
        "urduURN": 4144180,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 22,
        "babName": "غلام چوری کرے تو اسے بیچ ڈالنے کا بیان ۔",
        "hadithNumber": 4412,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” جب غلام چوری کرے تو اسے بیچ ڈالو اگرچہ ایک نش ۱؎ میں ہو “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 944150,
        "last_updated": null
    },
    {
        "urduURN": 4144190,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 23,
        "babName": "شادی+شدہ زانی کے رجم کا بیان ۔",
        "hadithNumber": 4413,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "اللہ تعالیٰ نے فرمایا : «واللاتي يأتين الفاحشة من نسائكم فاستشهدوا عليهن أربعة منكم فإن شهدوا فأمسكوهن في البيوت حتى يتوفاهن الموت أو يجعل الله لهن سبيلا» ” تمہاری عورتوں میں سے جو بےحیائی کا کام کریں ان پر اپنے میں سے چار گواہ طلب کرو ، اگر وہ گواہی دیں تو ان عورتوں کو گھروں میں قید رکھو یہاں تک کہ موت ان کی عمریں پوری کر دے یا اللہ ان کے لیے کوئی اور راستہ نکال دے “ ( سورۃ النساء : ۱۵ ) اور مرد کا ذکر عورت کے بعد کیا ، پھر ان دونوں کا ایک ساتھ ذکر کیا فرمایا : «واللذان يأتيانها منكم فآذوهما فإن تابا وأصلحا فأعرضوا عنهما» ” تم میں دونوں جو ایسا کر لیں انہیں ایذا دو اور اگر وہ توبہ اور اصلاح کر لیں تو ان سے منہ پھیر لو “ ( سورۃ النساء : ۱۶ ) ، پھر یہ «جَلْد» والی آیت «الزانية والزاني فاجلدوا كل واحد منهما مائة جلدة» ” زنا کرنے والی عورت اور زنا کرنے والے مرد دونوں کو سو سو کوڑے مارو “ ( سورۃ النور : ۲ ) منسوخ کر دی گئی ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 944160,
        "last_updated": null
    },
    {
        "urduURN": 4144200,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 23,
        "babName": "شادی+شدہ زانی کے رجم کا بیان ۔",
        "hadithNumber": 4414,
        "hadithSanad": "مجاہد کہتے ہیں کہ",
        "hadithText": "«سبیل» سے مراد حد ہے ۔ سفیان کہتے ہیں : «فآذوهما» سے مراد کنوارا مرد اور کنواری عورت ہے ، اور «فأمسكوهن في البيوت» سے مراد غیر کنواری عورتیں ہیں ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 944170,
        "last_updated": null
    },
    {
        "urduURN": 4144210,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 23,
        "babName": "شادی+شدہ زانی کے رجم کا بیان ۔",
        "hadithNumber": 4415,
        "hadithSanad": "عبادہ بن صامت رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” مجھ سے سیکھ لو ، مجھ سے سیکھ لو ، اللہ تعالیٰ نے ان کے لیے راہ نکال دی ہے غیر کنوارہ مرد غیر کنواری عورت کے ساتھ زنا کرے تو سو کوڑے اور رجم ہے اور کنوارا مرد کنواری عورت کے ساتھ زنا کرے تو سو کوڑے اور ایک سال کی جلا وطنی ہے “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 944180,
        "last_updated": null
    },
    {
        "urduURN": 4144220,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 23,
        "babName": "شادی+شدہ زانی کے رجم کا بیان ۔",
        "hadithNumber": 4416,
        "hadithSanad": "اس طریق سے بھی حسن سے یحییٰ والی سند ہی سے اسی مفہوم کی حدیث مروی ہے",
        "hadithText": "اس میں ہے ( جب غیر کنوارا مرد غیر کنواری عورت کے ساتھ زنا کرے تو ) سو کوڑے اور رجم ہے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 944190,
        "last_updated": null
    },
    {
        "urduURN": 4144230,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 23,
        "babName": "شادی+شدہ زانی کے رجم کا بیان ۔",
        "hadithNumber": 4417,
        "hadithSanad": "عبادہ بن صامت رضی اللہ عنہ نبی اکرم صلی اللہ علیہ وسلم سے یہی حدیث روایت کرتے ہیں اس میں ہے کہ",
        "hadithText": "کچھ لوگوں نے سعد بن عبادہ سے کہا : اے ابوثابت ! حدود نازل ہو چکے ہیں اگر آپ اپنی بیوی کے ساتھ کسی مرد کو پائیں تو کیا کریں ، انہوں نے کہا : ان دونوں کا کام تلوار سے تمام کر دوں گا ، کیا میں چار گواہ جمع کرنے جاؤں گا تب تک تو وہ اپنا کام پورا کر چکے گا ، چنانچہ وہ چلے اور رسول اللہ صلی اللہ علیہ وسلم کے پاس پہنچے اور ان لوگوں نے عرض کیا : اللہ کے رسول ! کیا آپ نے ابوثابت کو نہیں سنا وہ ایسا ایسا کہہ رہے ہیں تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” ازروئے گواہ تلوار ہی کافی ہے “ پھر آپ صلی اللہ علیہ وسلم نے فرمایا : ” نہیں ، نہیں ، اسے قتل مت کرنا کیونکہ مجھے اندیشہ ہے کہ غصہ ور ، اور غیرت مند پیچھے پڑ کر ( بغیر اس کی تحقیق کئے کہ اس سے زنا سرزد ہوا ہے یا نہیں محض گمان ہی پر ) اسے قتل نہ کر ڈالیں “ ۔ ابوداؤد کہتے ہیں : اس حدیث کا ابتدائی حصہ وکیع نے فضل بن دلہم سے ، فضل نے حسن سے ، حسن نے قبیصہ بن حریث سے ، قبیصہ نے سلمہ بن محبق سے سلمہ نے نبی اکرم صلی اللہ علیہ وسلم سے مرفوعاً روایت کیا ہے ، یہ سند جس کا ذکر وکیع نے کیا ہے ابن محبق والی روایت کی سند ہے جس میں ہے کہ ایک شخص نے اپنی بیوی کی لونڈی سے مجامعت کر لی ۔ ابوداؤد کہتے ہیں : فضل بن دلہم حافظ حدیث نہیں تھے ، وہ واسط میں ایک قصاب تھے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 944200,
        "last_updated": null
    },
    {
        "urduURN": 4144240,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 23,
        "babName": "شادی+شدہ زانی کے رجم کا بیان ۔",
        "hadithNumber": 4418,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "عمر رضی اللہ عنہ نے خطبہ دیا اس میں آپ نے کہا : اللہ نے محمد صلی اللہ علیہ وسلم کو حق کے ساتھ بھیجا اور آپ پر کتاب نازل فرمائی ، تو جو آیتیں آپ پر نازل ہوئیں ان میں آیت رجم بھی ہے ، ہم نے اسے پڑھا ، اور یاد رکھا ، خود رسول اللہ صلی اللہ علیہ وسلم نے رجم کیا ، آپ کے بعد ہم نے بھی رجم کیا ، اور مجھے اندیشہ ہے کہ اگر زیادہ عرصہ گزر جائے تو کوئی کہنے والا یہ نہ کہے کہ ہم اللہ کی کتاب میں آیت رجم نہیں پاتے ، تو وہ اس فریضہ کو جسے اللہ نے نازل فرمایا ہے چھوڑ کر گمراہ ہو جائے ، لہٰذا مردوں اور عورتوں میں سے جو زنا کرے اسے رجم ( سنگسار ) کرنا برحق ہے ، جب وہ شادی شدہ ہو اور دلیل قائم ہو چکی ہو ، یا حمل ہو جائے یا اعتراف کرے ، اور قسم اللہ کی اگر لوگ یہ نہ کہتے کہ عمر نے اللہ کی کتاب میں زیادتی کی ہے تو میں اسے یعنی آیت رجم کو مصحف میں لکھ دیتا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 944210,
        "last_updated": null
    },
    {
        "urduURN": 4144250,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 24,
        "babName": "ماعز+بن+مالک رضی+اللہ+عنہ کے رجم کا بیان ۔",
        "hadithNumber": 4419,
        "hadithSanad": "نعیم بن ہزال بن یزید اسلمی رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "میرے والد کی گود میں ماعز بن مالک یتیم تھے محلہ کی ایک لڑکی سے انہوں نے زنا کیا ، ان سے میرے والد نے کہا : جاؤ جو تم نے کیا ہے رسول اللہ صلی اللہ علیہ وسلم کو بتا دو ، ہو سکتا ہے وہ تمہارے لیے اللہ سے مغفرت کی دعا کریں ، اس سے وہ یہ چاہتے تھے کہ ان کے لیے کوئی سبیل نکلے چنانچہ وہ آپ کے پاس آئے اور انہوں نے عرض کیا : اللہ کے رسول ! میں نے زنا کر لیا ہے مجھ پر اللہ کی کتاب کو قائم کیجئے ، آپ صلی اللہ علیہ وسلم نے ان سے اپنا چہرہ پھیر لیا ، پھر وہ دوبارہ آئے اور انہوں نے عرض کیا : اللہ کے رسول ! میں نے زنا کر لیا ہے ، مجھ پر اللہ کی کتاب کو قائم کیجئے ، یہاں تک کہ ایسے ہی چار بار انہوں نے کہا تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا : ” تم چار بار کہہ چکے کہ میں نے زنا کر لیا ہے تو یہ بتاؤ کہ کس سے کیا ہے ؟ “ انہوں نے کہا : فلاں عورت سے ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” کیا تم اس کے ساتھ سوئے تھے ؟ “ ماعز نے کہا : ہاں ، آپ صلی اللہ علیہ وسلم نے پوچھا : ” کیا تم اس سے چمٹے تھے ؟ “ انہوں نے کہا : ہاں ، پھر آپ صلی اللہ علیہ وسلم نے پوچھا : ” کیا تم نے اس سے جماع کیا تھا ؟ “ انہوں نے کہا : ہاں ، تو آپ صلی اللہ علیہ وسلم نے انہیں رجم ( سنگسار ) کئے جانے کا حکم دیا ، انہیں حرہ ۱؎ میں لے جایا گیا ، جب لوگ انہیں پتھر مارنے لگے تو وہ پتھروں کی اذیت سے گھبرا کے بھاگے ، تو وہ عبداللہ بن انیس کے سامنے آ گئے ، ان کے ساتھی تھک چکے تھے ، تو انہوں نے اونٹ کا کھر نکال کر انہیں مارا تو انہیں مار ہی ڈالا ، پھر نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے ، اور ان سے اسے بیان کیا ، تو آپ صلی اللہ علیہ وسلم نے فرمایا : ” تم نے اسے چھوڑ کیوں نہیں دیا ۲؎ ، شاید وہ توبہ کرتا اور اللہ اس کی توبہ قبول کر لیتا “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 944220,
        "last_updated": null
    },
    {
        "urduURN": 4144260,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 24,
        "babName": "ماعز+بن+مالک رضی+اللہ+عنہ کے رجم کا بیان ۔",
        "hadithNumber": 4420,
        "hadithSanad": "محمد بن اسحاق کہتے ہیں کہ",
        "hadithText": "میں نے عاصم بن عمر بن قتادہ سے ماعز بن مالک رضی اللہ عنہ کے واقعہ کا ذکر کیا تو انہوں نے مجھ سے کہا کہ مجھ سے حسن بن محمد بن علی بن ابی طالب نے بیان کیا ہے وہ کہتے ہیں : مجھے قبیلہ اسلم کے کچھ لوگوں نے جو تمہیں محبوب ہیں اور جنہیں میں متہم نہیں قرار دیتا بتایا ہے کہ «فهلا تركتموه» رسول اللہ صلی اللہ علیہ وسلم کا قول ہے ، حسن کہتے ہیں : میں نے یہ حدیث سمجھی نہ تھی ، تو میں جابر بن عبداللہ رضی اللہ عنہما کے پاس آیا ، اور ان سے کہا کہ قبیلہ اسلم کے کچھ لوگ بیان کرتے ہیں کہ لوگوں نے پتھر پڑنے سے ماعز کی گھبراہٹ کا جب رسول اللہ صلی اللہ علیہ وسلم سے ذکر کیا تو آپ نے ان سے فرمایا : ” تم نے اسے چھوڑ کیوں نہیں دیا “ یہ بات میرے سمجھ میں نہیں آئی ، تو جابر رضی اللہ عنہ نے کہا : بھتیجے ! میں اس حدیث کا سب سے زیادہ جانکار ہوں ، میں ان لوگوں میں سے تھا جنہوں نے انہیں رجم کیا جب ہم انہیں لے کر نکلے اور رجم کرنے لگے اور پتھر ان پر پڑنے لگا تو وہ چلائے اور کہنے لگے : لوگو ! مجھے رسول اللہ صلی اللہ علیہ وسلم کے پاس واپس لے چلو ، میری قوم نے مجھے مار ڈالا ، ان لوگوں نے مجھے دھوکہ دیا ہے ، انہوں نے مجھے یہ بتایا تھا کہ رسول اللہ صلی اللہ علیہ وسلم مجھے مار نہیں ڈالیں گے ، لیکن ہم لوگوں نے انہیں جب تک مار نہیں ڈالا چھوڑا نہیں ، پھر جب ہم لوٹ کر رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور آپ سے اس کا ذکر کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : ” تم نے اسے چھوڑ کیوں نہیں دیا ، میرے پاس لے آتے “ یہ آپ صلی اللہ علیہ وسلم نے اس لیے فرمایا تاکہ آپ ان سے مزید تحقیق کر لیتے ، نہ اس لیے کہ آپ انہیں چھوڑ دیتے ، اور حد قائم نہ کرتے ، وہ کہتے ہیں : تو میں اس وقت حدیث کا مطلب سمجھ سکا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 944230,
        "last_updated": null
    },
    {
        "urduURN": 4144270,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 24,
        "babName": "ماعز+بن+مالک رضی+اللہ+عنہ کے رجم کا بیان ۔",
        "hadithNumber": 4421,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ",
        "hadithText": "ماعز بن مالک رضی اللہ عنہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے ، اور انہوں نے عرض کیا کہ میں نے زنا کر لیا ہے ، آپ نے ان سے منہ پھیر لیا ، پھر انہوں نے کئی بار یہی بات دہرائی ، ہر بار آپ صلی اللہ علیہ وسلم اپنا منہ پھیر لیتے تھے ، پھر آپ نے ان کی قوم کے لوگوں سے پوچھا : ” کیا یہ دیوانہ تو نہیں ؟ “ لوگوں نے کہا : نہیں ایسی کوئی بات نہیں ، پھر آپ صلی اللہ علیہ وسلم نے پوچھا : ” کیا واقعی تم نے ایسا کیا ہے ؟ “ انہوں نے عرض کیا : ہاں واقعی ، تو آپ صلی اللہ علیہ وسلم نے انہیں سنگسار کئے جانے کا حکم دیا ، تو انہیں لا کر سنگسار کر دیا گیا ، اور آپ نے ان پر جنازہ کی نماز نہیں پڑھی ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 944240,
        "last_updated": null
    },
    {
        "urduURN": 4144280,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 24,
        "babName": "ماعز+بن+مالک رضی+اللہ+عنہ کے رجم کا بیان ۔",
        "hadithNumber": 4422,
        "hadithSanad": "جابر بن سمرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "ماعز بن مالک کو جس وقت نبی اکرم صلی اللہ علیہ وسلم کے پاس لایا گیا ، میں نے انہیں دیکھا کہ وہ ایک پست قد فربہ آدمی تھے ، ان کے جسم پر چادر نہ تھی ، انہوں نے اپنے خلاف خود ہی چار مرتبہ گواہیاں دیں کہ انہوں نے زنا کیا ہے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” ہو سکتا ہے تم نے بوسہ لیا ہو ؟ “ انہوں نے کہا : نہیں ، قسم اللہ کی اس رذیل ترین نے زنا کیا ہے ، پھر آپ صلی اللہ علیہ وسلم نے انہیں رجم کیا ، پھر خطبہ دیا ، اور فرمایا : ” آگاہ رہو جب ہم اللہ کی راہ میں جہاد کے لیے چلے جاتے ہیں ، اور ان میں سے کوئی ان خاندانوں باقی رہ جاتا ہے تو وہ ویسے ہی پھنکارتا ہے جیسے بکرا جفتی کے وقت بکری پر پھنکارتا ہے ، پھر وہ ان عورتوں میں سے کسی کو تھوڑا سامان ( جیسے دودھ اور کھجور وغیرہ دے کر اس سے زنا کر بیٹھتا ہے ) تو سن لو ! اگر اللہ ایسے کسی آدمی پر ہمیں قدرت بخشے گا تو میں اسے ان سے روکوں گا ( یعنی سزا دوں گا رجم کی یا کوڑے کی ) “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 944250,
        "last_updated": null
    },
    {
        "urduURN": 4144290,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 24,
        "babName": "ماعز+بن+مالک رضی+اللہ+عنہ کے رجم کا بیان ۔",
        "hadithNumber": 4423,
        "hadithSanad": "سماک کہتے ہیں",
        "hadithText": "میں نے جابر بن سمرہ رضی اللہ عنہ سے یہی حدیث سنی ہے ، اور پہلی روایت زیادہ کامل ہے ، اس میں ہے کہ آپ صلی اللہ علیہ وسلم نے ماعز کے اقرار کو دوبار رد کیا ، سماک کہتے ہیں : میں نے اسے سعید بن جبیر سے بیان کیا تو انہوں نے کہا : ” آپ نے ان کے اقرار کو چار بار رد کیا تھا “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 944260,
        "last_updated": null
    },
    {
        "urduURN": 4144300,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 24,
        "babName": "ماعز+بن+مالک رضی+اللہ+عنہ کے رجم کا بیان ۔",
        "hadithNumber": 4424,
        "hadithSanad": "شعبہ کہتے ہیں",
        "hadithText": "میں نے سماک سے «کثبہ» کے بارے میں پوچھا کہ وہ کیا ہے تو انہوں نے کہا : «کثبہ» تھوڑے دودھ کو کہتے ہیں ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 944270,
        "last_updated": null
    },
    {
        "urduURN": 4144310,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 24,
        "babName": "ماعز+بن+مالک رضی+اللہ+عنہ کے رجم کا بیان ۔",
        "hadithNumber": 4425,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ماعز بن مالک رضی اللہ عنہ سے فرمایا : ” کیا تمہارے متعلق جو بات مجھے معلوم ہوئی ہے صحیح ہے ؟ “ وہ بولے : میرے متعلق آپ کو کون سی بات معلوم ہوئی ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : ” مجھے یہ بات پہنچی ہے کہ تم نے بنی فلاں کی باندی سے زنا کیا ہے ؟ “ انہوں نے کہا : ہاں ، پھر چار بار اس کی گواہی دی ، تو آپ نے انہیں رجم کرنے کا حکم دیا ، چنانچہ وہ رجم کر دیئے گئے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 944280,
        "last_updated": null
    },
    {
        "urduURN": 4144320,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 24,
        "babName": "ماعز+بن+مالک رضی+اللہ+عنہ کے رجم کا بیان ۔",
        "hadithNumber": 4426,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "ماعز بن مالک رضی اللہ عنہ نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں آئے ، اور انہوں نے زنا کا دو بار اقرار کیا ، تو آپ صلی اللہ علیہ وسلم نے انہیں بھگا دیا ، وہ پھر آئے اور انہوں نے پھر دو بار زنا کا اقرار کیا ، تو آپ صلی اللہ علیہ وسلم نے فرمایا : ” تم نے اپنے خلاف چار بار گواہی دے دی ، لے جاؤ اسے سنگسار کر دو “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 944290,
        "last_updated": null
    },
    {
        "urduURN": 4144330,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 24,
        "babName": "ماعز+بن+مالک رضی+اللہ+عنہ کے رجم کا بیان ۔",
        "hadithNumber": 4427,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے ماعز بن مالک رضی اللہ عنہ سے فرمایا : ” شاید تو نے بوسہ لیا ہو گا ، یا ہاتھ سے چھوا ہو گا ، یا دیکھا ہو گا ؟ “ انہوں نے کہا : نہیں ، ایسا نہیں ہوا ہے ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” پھر کیا تم نے اس سے جماع کیا ہے ؟ “ انہوں نے عرض کیا : جی ہاں ، تو اس اقرار کے بعد آپ نے انہیں رجم کرنے کا حکم دیا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 944300,
        "last_updated": null
    },
    {
        "urduURN": 4144340,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 24,
        "babName": "ماعز+بن+مالک رضی+اللہ+عنہ کے رجم کا بیان ۔",
        "hadithNumber": 4428,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "قبیلہ اسلم کا ایک شخص نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا اور اس نے اپنے خلاف چار بار گواہی دی کہ اس نے ایک عورت سے جو اس کے لیے حرام تھی زنا کر لیا ہے ، ہر بار آپ صلی اللہ علیہ وسلم اپنا منہ اس کی طرف سے پھیر لیتے تھے ، پانچویں بار آپ اس کی طرف متوجہ ہوئے اور فرمایا : ” کیا تم نے اس سے جماع کیا ہے ؟ “ اس نے کہا : جی ہاں ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” تیرا عضو اس کے عضو میں غائب ہو گیا “ بولا : جی ہاں ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” ایسے ہی جیسے سلائی سرمہ دانی میں ، اور رسی کنویں میں داخل ہو جاتی ہے “ اس نے کہا : ہاں ایسے ہی ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” تجھے معلوم ہے زنا کیا ہے ؟ “ اس نے کہا : ہاں ، میں نے اس سے حرام طور پر وہ کام کیا ہے ، جو آدمی اپنی بیوی سے حلال طور پر کرتا ہے ، آپ صلی اللہ علیہ وسلم نے کہا : ” اچھا ، اب تیرا اس سے کیا مطلب ہے ؟ “ اس نے کہا : میں چاہتا ہوں آپ مجھے گناہ سے پاک کر دیجئیے ، پھر آپ نے حکم دیا تو وہ رجم کر دیا گیا ، پھر آپ نے اس کے ساتھیوں میں سے دو شخصوں کو یہ کہتے سنا کہ اس شخص کو دیکھو ، اللہ نے اس کی ستر پوشی کی ، لیکن یہ خود اپنے آپ کو نہیں بچا سکا یہاں تک کہ پتھروں سے اسی طرح مارا گیا جیسے کتا مارا جاتا ہے ، آپ صلی اللہ علیہ وسلم یہ سن کر خاموش رہے ، اور تھوڑی دیر چلتے رہے ، یہاں تک کہ ایک مرے ہوئے گدھے کی لاش پر سے گزرے جس کے پاؤں اٹھے تھے ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” فلاں اور فلاں کہاں ہیں ؟ “ وہ دونوں بولے : ہم حاضر ہیں اللہ کے رسول ! آپ صلی اللہ علیہ وسلم نے فرمایا : ” اترو اور اس گدھے کا گوشت کھاؤ “ ان دونوں نے کہا : اللہ کے رسول ! اس کا گوشت کون کھائے گا ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : ” تم نے ابھی جو اپنے بھائی کی عیب جوئی کی ہے وہ اس کے کھانے سے زیادہ سخت ہے ، قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے وہ اس وقت جنت کی نہروں میں غوطے کھا رہا ہے “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 944310,
        "last_updated": null
    },
    {
        "urduURN": 4144350,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 24,
        "babName": "ماعز+بن+مالک رضی+اللہ+عنہ کے رجم کا بیان ۔",
        "hadithNumber": 4429,
        "hadithSanad": "اس سند سے بھی ابوہریرہ سے ایسی ہی حدیث مروی ہے",
        "hadithText": "اس میں اتنا اضافہ ہے کہ لوگوں میں اختلاف ہے کچھ لوگوں کا کہنا ہے کہ اسے ایک درخت سے باندھ دیا گیا تھا اور کچھ کا کہنا ہے کہ اسے ( میدان میں ) کھڑا کر دیا گیا تھا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 944320,
        "last_updated": null
    },
    {
        "urduURN": 4144360,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 24,
        "babName": "ماعز+بن+مالک رضی+اللہ+عنہ کے رجم کا بیان ۔",
        "hadithNumber": 4430,
        "hadithSanad": "جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ",
        "hadithText": "قبیلہ اسلم کا ایک شخص رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور اس نے زنا کا اقرار کیا ، آپ صلی اللہ علیہ وسلم نے اس سے اپنا منہ پھیر لیا ، پھر اس نے آ کر اعتراف کیا ، آپ صلی اللہ علیہ وسلم نے پھر اس سے اپنا منہ پھیر لیا ، یہاں تک کہ اس نے اپنے خلاف چار بار گواہیاں دیں ، تو نبی اکرم صلی اللہ علیہ وسلم نے اس سے فرمایا : ” کیا تجھے جنون ہے ؟ “ اس نے کہا : ایسی کوئی بات نہیں ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” کیا تو شادی شدہ ہے “ اس نے کہا : ہاں ، اس پر نبی اکرم صلی اللہ علیہ وسلم نے ان کے متعلق حکم دیا ، تو انہیں عید گاہ میں رجم کر دیا گیا ، جب ان پر پتھروں کی بارش ہونے لگی تو وہ بھاگے ، پھر پکڑ لیے گئے ، اور پتھروں سے مارے گئے ، یہاں تک کہ ان کی موت ہو گئی ، پھر نبی اکرم صلی اللہ علیہ وسلم نے ان کی تعریف فرمائی اور ان پر نماز جنازہ نہیں پڑھی ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 944330,
        "last_updated": null
    },
    {
        "urduURN": 4144370,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 24,
        "babName": "ماعز+بن+مالک رضی+اللہ+عنہ کے رجم کا بیان ۔",
        "hadithNumber": 4431,
        "hadithSanad": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "جب نبی اکرم صلی اللہ علیہ وسلم نے ماعز بن مالک رضی اللہ عنہ کے رجم کا حکم دیا تو ہم انہیں لے کر بقیع کی طرف چلے ، قسم اللہ کی ! نہ ہم نے انہیں باندھا ، نہ ہم نے ان کے لیے گڑھا کھودا ، لیکن وہ خود کھڑے ہو گئے ، ہم نے انہیں ہڈیوں ، ڈھیلوں اور مٹی کے برتن کے ٹوٹے ہوئے ٹکڑوں سے مار ا ، تو وہ ادھر ادھر دوڑنے لگے ، ہم بھی ان کے پیچھے دوڑے یہاں تک کہ وہ حرہ پتھریلی جگہ کی طرف آئے تو وہ کھڑے ہو گئے ہم نے انہیں حرہ کے بڑے بڑے پتھروں سے مارا یہاں تک کہ وہ ٹھنڈے ہو گئے ، تو نہ تو آپ نے ان کی مغفرت کے لیے دعا کی ، اور نہ ہی انہیں برا کہا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 944340,
        "last_updated": null
    },
    {
        "urduURN": 4144380,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 24,
        "babName": "ماعز+بن+مالک رضی+اللہ+عنہ کے رجم کا بیان ۔",
        "hadithNumber": 4432,
        "hadithSanad": "ابونضرہ سے روایت ہے",
        "hadithText": "ایک شخص نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا ، آگے اسی جیسی روایت ہے ، اور پوری نہیں ہے اس میں ہے : لوگ اسے برا بھلا کہنے لگے ، تو آپ نے انہیں منع فرمایا ، پھر لوگ اس کی مغفرت کی دعا کرنے لگے تو آپ صلی اللہ علیہ وسلم نے انہیں روک دیا ، اور فرمایا : ” وہ ایک شخص تھا جس نے گناہ کیا ، اب اللہ اس سے سمجھ لے گا ( چاہے گا تو معاف کر دے ورنہ اسے سزا دے گا تم کیوں دخل دیتے ہو ) “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 944350,
        "last_updated": null
    },
    {
        "urduURN": 4144390,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 24,
        "babName": "ماعز+بن+مالک رضی+اللہ+عنہ کے رجم کا بیان ۔",
        "hadithNumber": 4433,
        "hadithSanad": "بریدہ رضی اللہ عنہ روایت کرتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے ماعز کا منہ سونگھا ( اس خیال سے کہ کہیں اس نے شراب نہ پی ہو ) ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 944360,
        "last_updated": null
    },
    {
        "urduURN": 4144400,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 24,
        "babName": "ماعز+بن+مالک رضی+اللہ+عنہ کے رجم کا بیان ۔",
        "hadithNumber": 4434,
        "hadithSanad": "بریدہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "ہم رسول اللہ صلی اللہ علیہ وسلم کے اصحاب کا ذکر کیا کرتے تھے کہ غامدیہ ۱؎ اور ماعز بن مالک رضی اللہ عنہما دونوں اگر اقرار سے پھر جاتے ، یا اقرار کے بعد پھر اقرار نہ کرتے تو آپ ان دونوں کو سزا نہ دیتے ، آپ صلی اللہ علیہ وسلم نے ان دونوں کو اس وقت رجم کیا جب وہ چار چار بار اقرار کر چکے تھے ( اور ان کے اقرار میں کسی طرح کا کوئی شک باقی نہیں رہ گیا تھا ) ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 944370,
        "last_updated": null
    },
    {
        "urduURN": 4144410,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 24,
        "babName": "ماعز+بن+مالک رضی+اللہ+عنہ کے رجم کا بیان ۔",
        "hadithNumber": 4435,
        "hadithSanad": "خالد بن لجلاج کا بیان ہے کہ",
        "hadithText": "ان کے والد الجلاج نے انہیں بتایا کہ وہ بیٹھے بازار میں کام کر رہے تھے اتنے میں ایک عورت ایک لڑکے کو لیے گزری تو لوگ اس کو دیکھ کر اٹھ کھڑے ہوئے ان اٹھنے والوں میں میں بھی تھا ، اور میں نبی اکرم صلی اللہ علیہ وسلم کے پاس پہنچا آپ اس سے پوچھ رہے تھے : ” اس بچہ کا باپ کون ہے ؟ “ وہ عورت چپ تھی ، ایک نوجوان جو اس کے برابر میں تھا بولا : اللہ کے رسول ! میں اس کا باپ ہوں ، آپ صلی اللہ علیہ وسلم پھر اس عورت کی طرف متوجہ ہوئے ، اور پوچھا : ” اس بچے کا باپ کون ہے ؟ “ تو نوجوان نے پھر کہا : اللہ کے رسول ! میں اس کا باپ ہوں ، یہ سن کر رسول اللہ صلی اللہ علیہ وسلم نے اپنے اردگرد جو لوگ بیٹھے تھے ان میں سے کسی کی طرف دیکھا ، آپ ان سے اس نوجوان کے متعلق دریافت فرما رہے تھے ؟ تو لوگوں نے کہا : ہم تو اسے نیک ہی جانتے ہیں ، پھر نبی اکرم صلی اللہ علیہ وسلم نے اس سے پوچھا : ” کیا تم شادی شدہ ہو ؟ “ اس نے کہا : جی ہاں ، تو آپ صلی اللہ علیہ وسلم نے اسے رجم کرنے کا حکم دیا ، چنانچہ وہ رجم کر دیا گیا ، اس میں ہے کہ ہم اس کو لے کر نکلے اور ایک گڑھے میں اسے گاڑا پھر پتھروں سے اسے مارا یہاں تک کہ وہ ٹھنڈا ہو گیا ، اتنے میں ایک شخص آیا ، اور اس رجم کئے گئے شخص کے متعلق پوچھنے لگا ، تو اسے لے کر ہم نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے ، اور ہم نے کہا : یہ اس خبیث کے متعلق پوچھ رہا ہے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” وہ اللہ کے نزدیک مشک کی بو سے بھی زیادہ پاکیزہ ہے “ پھر پتا چلا کہ وہ اس کا باپ تھا ہم نے اس کے غسل اور کفن دفن میں اس کی مدد کی ۔ ابوداؤد کہتے ہیں : مجھے معلوم نہیں کہ انہوں نے ” اور اس پر نماز پڑھنے میں بھی ( مدد کی ) کہا یا نہیں “ یہ عبدہ کی روایت ہے ، اور زیادہ کامل ہے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 944380,
        "last_updated": null
    },
    {
        "urduURN": 4144420,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 24,
        "babName": "ماعز+بن+مالک رضی+اللہ+عنہ کے رجم کا بیان ۔",
        "hadithNumber": 4436,
        "hadithSanad": "اس سند سے بھی الجلاج سے یہی",
        "hadithText": "روایت مرفوعاً آئی ہے اس میں اس حدیث کا کچھ حصہ ہے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 944390,
        "last_updated": null
    },
    {
        "urduURN": 4144430,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 24,
        "babName": "ماعز+بن+مالک رضی+اللہ+عنہ کے رجم کا بیان ۔",
        "hadithNumber": 4437,
        "hadithSanad": "سہل بن سعد رضی اللہ عنہما سے روایت ہے کہ",
        "hadithText": "ایک شخص نے نبی اکرم صلی اللہ علیہ وسلم کے پاس آ کر اقرار کیا کہ اس نے ایک عورت سے جس کا اس نے آپ سے نام لیا ، زنا کیا ہے ، تو آپ صلی اللہ علیہ وسلم نے اس عورت کو بلوایا ، اور اس کے بارے میں اس سے پوچھا تو اس نے اس بات سے انکار کیا کہ اس نے زنا کیا ہے ، تو آپ نے اس مرد پر حد نافذ کی ، اسے سو کوڑے لگائے اور عورت کو چھوڑ دیا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 944400,
        "last_updated": null
    },
    {
        "urduURN": 4144440,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 24,
        "babName": "ماعز+بن+مالک رضی+اللہ+عنہ کے رجم کا بیان ۔",
        "hadithNumber": 4438,
        "hadithSanad": "جابر رضی اللہ عنہ سے روایت ہے کہ",
        "hadithText": "ایک شخص نے ایک عورت سے زنا کیا تو نبی اکرم صلی اللہ علیہ وسلم نے اس کے متعلق حکم دیا تو اسے حد میں کوڑے لگائے گئے پھر آپ کو بتایا گیا کہ وہ تو شادی شدہ تھا تو آپ نے حکم دیا کہ اسے رجم کر دیا جائے چنانچہ وہ رجم کر دیا گیا ۔ ابوداؤد کہتے ہیں : اس حدیث کو محمد بن بکر برسانی نے ابن جریج سے جابر پر موقوفاً روایت کیا ہے ، اور ابوعاصم نے ابن جریج سے اسی طرح روایت کیا ہے جیسے ابن وہب نے کیا ہے ، اس میں انہوں نے نبی اکرم صلی اللہ علیہ وسلم کا ذکر نہیں کیا ہے اس میں ہے کہ ایک شخص نے زنا کیا ، اس کے شادی شدہ ہونے کا علم نہیں تھا ، تو اسے کوڑے مارے گئے ، پھر پتہ چلا کہ وہ شادی شدہ ہے تو اسے رجم کر دیا گیا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 944410,
        "last_updated": null
    },
    {
        "urduURN": 4144450,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 24,
        "babName": "ماعز+بن+مالک رضی+اللہ+عنہ کے رجم کا بیان ۔",
        "hadithNumber": 4439,
        "hadithSanad": "جابر رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "ایک شخص نے ایک عورت سے زنا کیا لیکن یہ پتہ نہیں چلا کہ وہ شادی شدہ ہے تو اسے کوڑے لگائے گئے ، پھر معلوم ہوا کہ وہ شادی شدہ ہے تو اسے رجم کر دیا گیا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 944420,
        "last_updated": null
    },
    {
        "urduURN": 4144460,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 25,
        "babName": "قبیلہ+جہینہ کی ایک عورت کا ذکر جسے نبی اکرم صلی+اللہ+علیہ+وسلم نے رجم کرنے کا حکم دیا ۔",
        "hadithNumber": 4440,
        "hadithSanad": "عمران بن حصین رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "قبیلہ جہینہ کی ایک عورت نبی اکرم صلی اللہ علیہ وسلم کے پاس آئی ، اور اس نے عرض کیا کہ اس نے زنا کیا ہے ، اور وہ حاملہ ہے تو نبی اکرم صلی اللہ علیہ وسلم نے اس کے ولی کو بلوایا ، اور اس سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” اس کے ساتھ بھلائی سے پیش آنا ، اور جب یہ حمل وضع کر چکے تو اسے لے کر آنا “ چنانچہ جب وہ حمل وضع کر چکی تو وہ اسے لے کر آیا ، نبی اکرم صلی اللہ علیہ وسلم نے حکم دیا تو اس کے کپڑے باندھ دیئے گئے ، پھر آپ صلی اللہ علیہ وسلم نے اسے رجم کرنے کا حکم دیا تو اسے رجم کر دیا گیا ، پھر آپ نے لوگوں کو حکم دیا تو لوگوں نے اس کے جنازہ کی نماز پڑھی ، عمر رضی اللہ عنہ کہنے لگے : اللہ کے رسول ! ہم اس کی نماز جنازہ پڑھیں حالانکہ اس نے زنا کیا ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : ” قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے ، اس نے ایسی توبہ کی ہے کہ اگر وہ اہل مدینہ کے ستر آدمیوں میں تقسیم کر دی جائے تو انہیں کافی ہو گی ، کیا تم اس سے بہتر کوئی بات پاؤ گے کہ اس نے اپنی جان قربان کر دی ؟ “ ۔ ابان کی روایت میں ” اس کے کپڑے باندھ دیئے گئے تھے “ کے الفاظ نہیں ہیں ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 944430,
        "last_updated": null
    },
    {
        "urduURN": 4144470,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 25,
        "babName": "قبیلہ+جہینہ کی ایک عورت کا ذکر جسے نبی اکرم صلی+اللہ+علیہ+وسلم نے رجم کرنے کا حکم دیا ۔",
        "hadithNumber": 4441,
        "hadithSanad": "اوزاعی سے مروی ہے",
        "hadithText": "اس میں ہے «فشكت عليها ثيابها» کے معنی یہ ہیں کہ اس کے کپڑے باندھ دیئے گئے تھے ( تاکہ پتھر مارنے میں وہ نہ کھلیں ) ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 944440,
        "last_updated": null
    },
    {
        "urduURN": 4144480,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 25,
        "babName": "قبیلہ+جہینہ کی ایک عورت کا ذکر جسے نبی اکرم صلی+اللہ+علیہ+وسلم نے رجم کرنے کا حکم دیا ۔",
        "hadithNumber": 4442,
        "hadithSanad": "بریدہ رضی اللہ عنہ روایت کرتے ہیں کہ",
        "hadithText": "قبیلہ غامد کی ایک عورت نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں آئی اور عرض کیا : میں نے زنا کر لیا ہے ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” واپس جاؤ “ ، چنانچہ وہ واپس چلی گئی ، دوسرے دن وہ پھر آئی ، اور کہنے لگی : شاید جیسے آپ نے ماعز بن مالک کو لوٹایا تھا ، اسی طرح مجھے بھی لوٹا رہے ہیں ، قسم اللہ کی میں تو حاملہ ہوں ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” جاؤ واپس جاؤ “ چنانچہ وہ پھر واپس چلی گئی ، پھر تیسرے دن آئی تو آپ نے اس سے فرمایا : ” جاؤ واپس جاؤ بچہ پیدا ہو جائے پھر آنا “ چنانچہ وہ چلی گئی ، جب اس نے بچہ جن دیا تو بچہ کو لے کر پھر آئی ، اور کہا : اسے میں جن چکی ہوں ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” جاؤ واپس جاؤ اور اسے دودھ پلاؤ یہاں تک کہ اس کا دودھ چھڑا دو “ دودھ چھڑا کر پھر وہ لڑکے کو لے کر آئی ، اور بچہ کے ہاتھ میں کوئی چیز تھی جسے وہ کھا رہا تھا ، تو بچہ کے متعلق آپ نے حکم دیا کہ اسے مسلمانوں میں سے کسی شخص کو دے دیا جائے ، اور اس کے متعلق حکم دیا کہ اس کے لیے گڈھا کھودا جائے ، اور حکم دیا کہ اسے رجم کر دیا جائے ، تو وہ رجم کر دی گئی ۔ خالد رضی اللہ عنہ اسے رجم کرنے والوں میں سے تھے انہوں نے اسے ایک پتھر مارا تو اس کے خون کا ایک قطرہ ان کے رخسار پر آ کر گرا تو اسے برا بھلا کہنے لگے ، ان سے نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” خالد ! قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے ، اس نے ایسی توبہ کی ہے کہ ٹیکس اور چنگی وصول کرنے والا بھی ایسی توبہ کرتا تو اس کی بھی بخشش ہو جاتی “ ، پھر آپ نے حکم دیا تو اس کی نماز جنازہ پڑھی گئی اور اسے دفن کیا گیا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 944450,
        "last_updated": null
    },
    {
        "urduURN": 4144490,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 25,
        "babName": "قبیلہ+جہینہ کی ایک عورت کا ذکر جسے نبی اکرم صلی+اللہ+علیہ+وسلم نے رجم کرنے کا حکم دیا ۔",
        "hadithNumber": 4443,
        "hadithSanad": "ابوبکرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے ایک عورت کو رجم کرنا چاہا تو اس کے لیے ایک گڈھا سینے تک کھودا گیا ۔ ابوداؤد کہتے ہیں : غسانی کا کہنا ہے کہ جہینہ ، غامد اور بارق تینوں ایک ہی قبیلہ ہے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 944460,
        "last_updated": null
    },
    {
        "urduURN": 4144500,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 25,
        "babName": "قبیلہ+جہینہ کی ایک عورت کا ذکر جسے نبی اکرم صلی+اللہ+علیہ+وسلم نے رجم کرنے کا حکم دیا ۔",
        "hadithNumber": 4444,
        "hadithSanad": "ابوداؤد کہتے ہیں",
        "hadithText": "مجھ سے یہ حدیث عبدالصمد بن عبدالوارث کے واسطہ سے بیان کی گئی ہے ، زکریا بن سلیم نے اسی سند سے اسی جیسی حدیث بیان کی ہے ، اس میں اتنا اضافہ ہے کہ آپ صلی اللہ علیہ وسلم نے اسے چنے کے برابر ایک کنکری سے مارا ، پھر آپ صلی اللہ علیہ وسلم نے فرمایا : ” مارو لیکن چہرے کو بچا کر مارنا “ پھر جب وہ مر گئی تو آپ نے اسے نکالا ، پھر اس پر نماز پڑھی ، اور توبہ کے سلسلہ میں ویسے ہی فرمایا جیسے بریدہ کی روایت میں ہے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 944470,
        "last_updated": null
    },
    {
        "urduURN": 4144510,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 25,
        "babName": "قبیلہ+جہینہ کی ایک عورت کا ذکر جسے نبی اکرم صلی+اللہ+علیہ+وسلم نے رجم کرنے کا حکم دیا ۔",
        "hadithNumber": 4445,
        "hadithSanad": "ابوہریرہ اور زید بن خالد جہنی رضی اللہ عنہما روایت کرتے ہیں کہ",
        "hadithText": "دو آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس جھگڑا لے گئے ، ان میں سے ایک نے کہا : اللہ کے رسول ! ہمارے مابین اللہ کی کتاب کی روشنی میں فیصلہ فرما دیجئیے ، اور دوسرے نے جو ان دونوں میں زیادہ سمجھ دار تھا کہا : ہاں ، اللہ کے رسول ! ہمارے درمیان اللہ کی کتاب سے فیصلہ فرمائیے ، لیکن پہلے مجھے کچھ کہنے کی اجازت دیجئیے ، آپ نے فرمایا : ” اچھا کہو “ اس نے کہنا شروع کیا : میرا بیٹا اس کے یہاں «عسیف» یعنی مزدور تھا ، اس نے اس کی بیوی سے زنا کر لیا تو ان لوگوں نے مجھے بتایا کہ میرے بیٹے پر رجم ہے ، تو میں نے اسے اپنی سو بکریاں اور ایک لونڈی فدیئے میں دے دی ، پھر میں نے اہل علم سے مسئلہ پوچھا ، تو ان لوگوں نے مجھے بتایا کہ میرے بیٹے پر سو کوڑے اور ایک سال کی جلا وطنی ہے ، اور رجم اس کی بیوی پر ہے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” سنو ! قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے ، میں ضرور بالضرور تم دونوں کے درمیان اللہ کی کتاب سے فیصلہ کروں گا ، رہی تمہاری بکریاں اور تمہاری لونڈی تو یہ تمہیں واپس ملیں گی “ اور اس کے بیٹے کو آپ نے سو کوڑے لگوائے ، اور اسے ایک سال کے لیے جلا وطن کر دیا ، اور انیس اسلمی کو حکم دیا کہ وہ اس دوسرے شخص کی بیوی کے پاس جائیں ، اور اس سے پوچھیں اگر وہ اقرار کرے تو اسے رجم کر دیں ، چنانچہ اس نے اقرار کر لیا ، تو انہوں نے اسے رجم کر دیا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 944480,
        "last_updated": null
    },
    {
        "urduURN": 4144520,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 26,
        "babName": "دو یہودیوں کے رجم کا بیان ۔",
        "hadithNumber": 4446,
        "hadithSanad": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "یہود نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں آئے اور آپ سے ذکر کیا کہ ان میں سے ایک مرد اور ایک عورت نے زنا کر لیا ہے ، تو ان سے رسول اللہ صلی اللہ علیہ وسلم نے پوچھا : ” تم تورات میں زنا کے معاملہ میں کیا حکم پاتے ہو ؟ “ تو ان لوگوں نے کہا : ہم انہیں رسوا کرتے اور کوڑے لگاتے ہیں ، تو عبداللہ بن سلام رضی اللہ عنہ نے کہا : تم لوگ جھوٹ کہتے ہو ، اس میں تو رجم کا حکم ہے ، چنانچہ وہ لوگ تورات لے کر آئے ، اور اسے کھولا تو ان میں سے ایک نے آیت رجم پر اپنا ہاتھ رکھ لیا ، پھر وہ اس کے پہلے اور بعد کی آیتیں پڑھنے لگا ، تو عبداللہ بن سلام نے اس سے کہا : اپنا ہاتھ اٹھاؤ ، اس نے اٹھایا تو وہیں آیت رجم ملی ، تو وہ کہنے لگے : صحیح ہے اے محمد ! اس میں رجم کی آیت موجود ہے ، تو رسول اللہ صلی اللہ علیہ وسلم نے ان دونوں کے رجم کا حکم دے دیا ، چنانچہ وہ دونوں رجم کر دیے گئے ۔ عبداللہ بن عمر کہتے ہیں : میں نے اس شخص کو دیکھا کہ وہ عورت کو پتھر سے بچانے کے لیے اس پر جھک جھک جایا کرتا تھا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 944490,
        "last_updated": null
    },
    {
        "urduURN": 4144530,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 26,
        "babName": "دو یہودیوں کے رجم کا بیان ۔",
        "hadithNumber": 4447,
        "hadithSanad": "براء بن عازب رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے پاس سے لوگ ایک یہودی کو لے کر گزرے جس کو ہاتھ منہ کالا کر کے گھمایا جا رہا تھا ، تو آپ صلی اللہ علیہ وسلم نے ان سے اللہ کا واسطہ دے کر پوچھا کہ ان کی کتاب میں زانی کی حد کیا ہے ؟ ان لوگوں نے آپ کو اپنے میں سے ایک شخص کی طرف اشارہ کر کے پوچھنے کے لیے کہا تو نبی اکرم صلی اللہ علیہ وسلم نے اس سے اللہ کا واسطہ دے کر پوچھا کہ تمہاری کتاب میں زانی کی حد کیا ہے ؟ تو اس نے کہا : رجم ہے ، لیکن زنا کا جرم ہمارے معزز لوگوں میں عام ہو گیا ، تو ہم نے یہ پسند نہیں کیا کہ معزز اور شریف آدمی کو چھوڑ دیا جائے اور جو ایسے نہ ہوں ان پر حد جاری کی جائے ، تو ہم نے اس حکم ہی کو اپنے اوپر سے اٹھا لیا ، چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے اسے رجم کا حکم دیا تو وہ رجم کر دیا گیا ، پھر آپ صلی اللہ علیہ وسلم نے فرمایا : ” اے اللہ ! میں وہ پہلا شخص ہوں جس نے تیری کتاب میں سے اس حکم کو زندہ کیا ہے جس پر لوگوں نے عمل چھوڑ دیا تھا “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 944500,
        "last_updated": null
    },
    {
        "urduURN": 4144540,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 26,
        "babName": "دو یہودیوں کے رجم کا بیان ۔",
        "hadithNumber": 4448,
        "hadithSanad": "براء بن عازب رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے سامنے سے ایک یہودی گزارا گیا جس کے منہ پر سیاہی ملی گئی تھی ، اسے کوڑے مارے گئے تھے تو آپ نے انہیں بلایا اور پوچھا : کیا تورات میں تم زانی کی یہی حد پاتے ہو ؟ لوگوں نے کہا : جی ہاں ، پھر آپ نے ان کے علماء میں سے ایک شخص کو بلایا اور اس سے فرمایا : ہم تم سے اس اللہ کا جس نے تورات نازل کی ہے واسطہ دے کر پوچھتے ہیں ، بتاؤ کیا تم اپنی کتاب میں زانی کی یہی حد پاتے ہو ؟ اس نے اللہ کا نام لے کر کہا : نہیں ، اور اگر آپ مجھے اتنی بڑی قسم نہ دیتے تو میں آپ کو ہرگز نہ بتاتا ، ہماری کتاب میں زانی کی حد رجم ہے ، لیکن جب ہمارے معزز اور شریف لوگوں میں اس کا کثرت سے رواج ہو گیا تو جب ہم کسی معزز شخص کو اس جرم میں پکڑتے تھے تو اسے چھوڑ دیتے تھے اور اگر کسی کمزور کو پکڑتے تو اس پر حد قائم کرتے تھے ، پھر ہم نے کہا : آؤ ہم تم اس بات پر متفق ہو جائیں کہ اسے شریف اور کم حیثیت دونوں پر جاری کریں گے ، تو ہم نے منہ کالا کرنے اور کوڑے لگانے پر اتفاق کر لیا ، اور رجم کو چھوڑ دیا ، یہ سن کر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” اے اللہ ! میں پہلا وہ شخص ہوں جس نے تیرے حکم کو زندہ کیا ہے ، جبکہ ان لوگوں نے اسے ختم کر دیا تھا “ پھر آپ نے اسے رجم کا حکم دیا ، چنانچہ وہ رجم کر دیا گیا ، اس پر اللہ نے یہ آیت «يا أيها الرسول لا يحزنك الذين يسارعون في الكفر» سے «يقولون إن أوتيتم هذا فخذوه وإن لم تؤتوه فاحذروا» ” اے رسول ! آپ ان لوگوں کے پیچھے نہ کڑھئیے جو کفر میں سبقت کر رہے ہیں ، خواہ وہ ان ( منافقوں ) میں سے ہوں جو زبانی تو ایمان کا دعویٰ کرتے ہیں ، لیکن حقیقتاً ان کے دل میں ایمان نہیں ، اور یہودیوں میں سے کچھ لوگ ایسے ہیں جو غلط باتیں سننے کے عادی ہیں ، اور ان لوگوں کے جاسوس ہیں جو اب تک آپ کے پاس نہیں آئے ، وہ کلمات کے اصلی موقع کو چھوڑ کر انہیں متغیر کر دیا کرتے ہیں ، کہتے ہیں کہ اگر تم یہی حکم دیئے جاؤ تو قبول کرنا ، اور یہ حکم دیئے جاؤ تو الگ تھلگ رہنا “ ( سورۃ المائدہ : ۴۱ ) تک ، اور «ومن لم يحكم بما أنزل الله فأولئك هم الظالمون» ” ہم نے تورات نازل فرمائی جس میں ہدایت و نور ہے ، یہودیوں میں اس تورات کے ساتھ اللہ تعالیٰ کے ماننے والے انبیاء ( علیہم السلام ) اور اہل اللہ ، اور علماء فیصلہ کرتے تھے کیونکہ انہیں اللہ کی اس کتاب کی حفاظت کا حکم دیا گیا تھا ۔ اور اس پر اقراری گواہ تھے اب چاہیئے کہ لوگوں سے نہ ڈرو ، اور صرف میرا ڈر رکھو ، میری آیتوں کو تھوڑے تھوڑے مول پر نہ بیچو ، جو لوگ اللہ کی اتاری ہوئی وحی کے ساتھ فیصلے نہ کریں وہ ( پورے اور پختہ ) کافر ہیں “ ( سورۃ المائدہ : ۴۴ ) تک ، اور «ومن لم يحكم بما أنزل الله فأولئك هم الظالمون» ” اور ہم نے یہودیوں کے ذمہ تورات میں یہ بات مقرر کر دی تھی کہ جان کے بدلے جان ، اور آنکھ کے بدلے آنکھ ، اور ناک کے بدلے ناک ، اور کان کے بدلے کان ، اور دانت کے بدلے دانت ، اور خاص زخموں کا بھی بدلہ ہے ، پھر جو شخص اس کو معاف کر دے تو وہ اس کے لیے کفارہ ہے ، اور جو اللہ کے نازل کئے ہوئے مطابق حکم نہ کریں ، وہی لوگ ظالم ہیں ( سورۃ المائدہ : ۴۵ ) تک یہود کے متعلق اتاری ، نیز «ومن لم يحكم بما أنزل الله فأولئك هم الفاسقون» ” اور انجیل والوں کو بھی چاہیئے کہ اللہ تعالیٰ نے جو کچھ انجیل میں نازل فرمایا ہے اسی کے مطابق حکم کریں ، اور جو اللہ تعالیٰ کے نازل کردہ سے ہی حکم نہ کریں وہ ( بدکار ) فاسق ہیں “ ( سورۃ المائدہ : ۴۷ ) تک اتاری ۔ یہ ساری آیتیں کافروں کے متعلق نازل ہوئی ہیں ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 944510,
        "last_updated": null
    },
    {
        "urduURN": 4144550,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 26,
        "babName": "دو یہودیوں کے رجم کا بیان ۔",
        "hadithNumber": 4449,
        "hadithSanad": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "یہود کے کچھ لوگ آئے اور رسول اللہ صلی اللہ علیہ وسلم کو بلا کر قف ۱؎ لے گئے آپ ان کے پاس بیت المدارس ( مدرسہ ) میں آئے تو وہ کہنے لگے : ابوالقاسم ! ہم میں سے ایک شخص نے ایک عورت سے زنا کر لیا ہے ، آپ ان کا فیصلہ کر دیجئیے ، ان لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کے لیے ایک گاؤ تکیہ لگایا ، آپ اس پر ٹیک لگا کر بیٹھے ، پھر آپ نے فرمایا : ” میرے پاس تورات لاؤ “ چنانچہ وہ لائی گئی ، آپ نے اپنے نیچے سے گاؤ تکیہ نکالا ، اور تورات کو اس پر رکھا اور فرمایا : ” میں تجھ پر ایمان لایا اور اس نبی پر جس پر اللہ نے تجھے نازل کیا ہے “ پھر آپ نے فرمایا : ” جو تم میں سب سے بڑا عالم ہو اسے بلاؤ “ چنانچہ ایک نوجوان کو بلا کر لایا گیا آگے واقعہ رجم کا اسی طرح ذکر ہے جیسے مالک کی روایت میں ہے جسے انہوں نے نافع سے روایت کیا ہے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 944520,
        "last_updated": null
    },
    {
        "urduURN": 4144560,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 26,
        "babName": "دو یہودیوں کے رجم کا بیان ۔",
        "hadithNumber": 4450,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "یہود کے ایک مرد اور ایک عورت نے زنا کیا تو ان میں سے بعض بعض سے کہنے لگے : ہم سب اس نبی کے پاس چلیں کیونکہ وہ تخفیف و آسانی کے لیے بھیجا گیا ہے ، اگر اس نے رجم کے علاوہ کوئی اور فتویٰ دیا تو ہم اسے مان لیں گے ، اور اسے اللہ کے سامنے دلیل بنائیں گے ، ہم کہیں گے کہ یہ تیرے نبیوں میں سے ایک نبی کا فتویٰ ہے ، چنانچہ وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے ، آپ مسجد نبوی میں اپنے صحابہ میں بیٹھے ہوئے تھے ، اور پوچھنے لگے : آپ اس مرد اور عورت کے متعلق کیا کہتے ہیں جس نے زنا کیا ہو ؟ آپ صلی اللہ علیہ وسلم نے انہیں کوئی جواب نہیں دیا جب تک کہ آپ ان کے مدرسہ میں نہیں آ گئے ، پھر مدرسہ کے دروازے پر کھڑے ہو کر آپ صلی اللہ علیہ وسلم نے فرمایا : ” میں تم سے اس اللہ کا واسطہ دے کر پوچھتا ہوں جس نے موسیٰ پر تورات نازل کی ہے بتاؤ تم تورات میں اس شخص کا کیا حکم پاتے ہو جو شادی شدہ ہو کر زنا کرے ؟ “ لوگوں نے کہا : اس کا منہ کالا کیا جائے گا ، اسے گدھے پر بٹھا کر پھرایا جائے گا ، اور کوڑے لگائے جائیں گے ( «تَجبیہ» یہ ہے کہ مرد اور عورت کو گدھے پر اس طرح سوار کیا جائے کہ ان کی گدی ایک دوسرے کے مقابل میں ہو ، اور انہیں پھرایا جائے ) ان میں کا ایک نوجوان چپ رہا ، تو جب نبی اکرم صلی اللہ علیہ وسلم نے اس کو خاموش دیکھا تو اس سے سخت قسم دلا کر پوچھا ، تو اس نے اللہ کا نام لے کر کہا : جب آپ نے ہمیں قسم دلائی ہے تو صحیح یہی ہے کہ تورات میں ایسے شخص کا حکم رجم ہے ، یہ سن کر نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” پھر کب سے تم لوگوں نے اللہ کے اس حکم کو چھوڑ رکھا ہے ؟ “ تو اس نے بتایا : ہمارے بادشاہوں میں ایک بادشاہ کے کسی رشتہ دار نے زنا کیا تو اس نے اسے رجم نہیں کیا ، پھر ایک عام شخص نے زنا کیا ، تو بادشاہ نے اسے رجم کرنا چاہا تو اس کی قوم کے لوگ آڑے آ گئے ، اور کہنے لگے : ہمارے آدمی کو اس وقت تک رجم نہیں کیا جا سکتا جب تک کہ آپ اپنے آدمی کو لا کر رجم نہ کر دیں ، چنانچہ اس سزا پر لوگوں نے آپس میں مصالحت کر لی تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” میں تو وہی فیصلہ کروں گا جو تورات میں ہے “ چنانچہ آپ صلی اللہ علیہ وسلم نے ان دونوں کو رجم کرنے کا حکم دیا تو انہیں رجم کر دیا گیا ۔ زہری کہتے ہیں : ہمیں یہ بات معلوم ہوئی ہے کہ آیت کریمہ «إنا أنزلنا التوراة فيها هدى ونور يحكم بها النبيون الذين أسلموا» ” ہم نے تورات نازل کیا جس میں ہدایت اور نور ہے اللہ کے ماننے والے انبیاء کرام اسی سے فیصلہ کرتے تھے “ ( المائدہ : ۴۴ ) انہیں کے بارے میں اتری ہے ، اور نبی اکرم صلی اللہ علیہ وسلم بھی انہیں میں سے تھے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 944530,
        "last_updated": null
    },
    {
        "urduURN": 4144570,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 26,
        "babName": "دو یہودیوں کے رجم کا بیان ۔",
        "hadithNumber": 4451,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "یہود کے ایک مرد اور ایک عورت نے زنا کیا وہ دونوں شادی شدہ تھے ، جب رسول اللہ صلی اللہ علیہ وسلم ہجرت کر کے مدینہ آئے تو تورات میں رجم کا حکم تحریر تھا ، لیکن انہوں نے اسے چھوڑے رکھا تھا اور اس کے بدلہ «تَجبیہ» کو اختیار کر لیا تھا ، تارکول ملی ہوئی رسی سے اسے سو بار مارا جاتا ، اسے گدھے پر سوار کیا جاتا اور اس کا چہرہ گدھے کے پچھاڑی کی طرف ہوتا ، تو ان کے علماء میں سے کچھ عالم اکٹھا ہوئے ان لوگوں نے کچھ لوگوں کو رسول اللہ صلی اللہ علیہ وسلم کے پاس بھیجا اور کہا جا کر ان سے زنا کی حد کے متعلق پوچھو ، پھر انہوں نے پوری حدیث بیان کی ، اس میں ہے : چونکہ وہ آپ صلی اللہ علیہ وسلم کے دین پر نہیں تھے کہ آپ ان کے درمیان فیصلہ کریں اسی لیے آپ کو اس سلسلہ میں اختیار دیا گیا اور فرمایا گیا «فإن جاءوك فاحكم بينهم أو أعرض عنهم» ” اگر وہ تمہارے پاس آئیں تو تمہیں اختیار ہے چاہو تو ان کے درمیان فیصلہ کر دو اور چاہو تو ٹال دو ( سورۃ المائدہ : ۴۲ ) ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 944540,
        "last_updated": null
    },
    {
        "urduURN": 4144580,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 26,
        "babName": "دو یہودیوں کے رجم کا بیان ۔",
        "hadithNumber": 4452,
        "hadithSanad": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "یہود اپنے میں سے ایک مرد اور ایک عورت کو لے کر آئے ان دونوں نے زنا کیا تھا ، تو آپ صلی اللہ علیہ وسلم نے فرمایا : ” دو ایسے شخصوں کو جو تمہارے سب سے بڑے عالم ہوں لے کر میرے پاس آؤ “ تو وہ لوگ صوریا کے دونوں لڑکوں کو لے کر آئے ، آپ صلی اللہ علیہ وسلم نے اللہ کا واسطہ دے کر ان دونوں سے پوچھا : ” تم تورات میں ان دونوں کا حکم کیا پاتے ہو ؟ “ ان دونوں نے کہا : ہم تورات میں یہی پاتے ہیں کہ جب چار گواہ گواہی دیدیں کہ انہوں نے مرد کے ذکر کو عورت کے فرج میں ایسے ہی دیکھا ہے جیسے سلائی سرمہ دانی میں تو وہ رجم کر دئیے جائیں گے ، آپ صلی اللہ علیہ وسلم نے پوچھا : ” تو پھر انہیں رجم کرنے سے کون سی چیز روک رہی ہے ؟ “ انہوں نے کہا : ہماری سلطنت تو رہی نہیں اس لیے اب ہمیں قتل اچھا نہیں لگتا ، پھر رسول اللہ صلی اللہ علیہ وسلم نے گواہوں کو بلایا ، وہ چار گواہ لے کر آئے ، انہوں نے گواہی دی کہ انہوں نے مرد کے ذکر کو عورت کی فرج میں ایسے ہی دیکھا ہے جیسے سلائی سرمہ دانی میں ، چنانچہ نبی اکرم صلی اللہ علیہ وسلم نے ان دونوں کو رجم کرنے کا حکم دے دیا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 944550,
        "last_updated": null
    },
    {
        "urduURN": 4144590,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 26,
        "babName": "دو یہودیوں کے رجم کا بیان ۔",
        "hadithNumber": 4453,
        "hadithSanad": "ابراہیم اور شعبی سے روایت ہے",
        "hadithText": "وہ دونوں نبی اکرم صلی اللہ علیہ وسلم سے اسی طرح روایت کرتے ہیں لیکن اس میں راوی نے یہ ذکر نہیں کیا ہے کہ آپ نے گواہوں کو بلایا ، اور انہوں نے گواہی دی ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 944560,
        "last_updated": null
    },
    {
        "urduURN": 4144600,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 26,
        "babName": "دو یہودیوں کے رجم کا بیان ۔",
        "hadithNumber": 4454,
        "hadithSanad": "اس سند سے بھی",
        "hadithText": "شعبی سے اسی جیسی حدیث مروی ہے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 944570,
        "last_updated": null
    },
    {
        "urduURN": 4144610,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 26,
        "babName": "دو یہودیوں کے رجم کا بیان ۔",
        "hadithNumber": 4455,
        "hadithSanad": "جابر بن عبداللہ رضی اللہ عنہما کو کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے یہود کے ایک مرد اور ایک عورت کو جنہوں نے زنا کیا تھا رجم کیا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 944580,
        "last_updated": null
    },
    {
        "urduURN": 4144620,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 27,
        "babName": "محرم سے زنا کرنے والے کے حکم کا بیان ۔",
        "hadithNumber": 4456,
        "hadithSanad": "براء بن عازب رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "میں اپنے ایک گمشدہ اونٹ کو ڈھونڈ رہا تھا کہ اسی دوران کچھ سوار آئے ، ان کے ساتھ ایک جھنڈا تھا ، تو دیہاتی لوگ نبی اکرم صلی اللہ علیہ وسلم سے میری قربت کی وجہ سے میرے اردگرد گھومنے لگے ، اتنے میں وہ ایک قبہ کے پاس آئے ، اور اس میں سے ایک شخص کو نکالا اور اس کی گردن مار دی ، تو میں نے اس کے متعلق ان سے پوچھا تو انہوں نے بتایا کہ اس نے اپنے باپ کی بیوی سے شادی کر رکھی تھی ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 944590,
        "last_updated": null
    },
    {
        "urduURN": 4144630,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 27,
        "babName": "محرم سے زنا کرنے والے کے حکم کا بیان ۔",
        "hadithNumber": 4457,
        "hadithSanad": "براء بن عازب رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "میں اپنے چچا سے ملا ان کے ساتھ ایک جھنڈا تھا میں نے ان سے پوچھا : کہاں کا ارادہ ہے ؟ کہا : مجھے رسول اللہ صلی اللہ علیہ وسلم نے اس آدمی کی طرف بھیجا ہے جس نے اپنے باپ کی بیوی سے شادی کر رکھی ہے ، اور حکم دیا ہے کہ میں اس کی گردن مار دوں اور اس کا مال لے لوں ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 944600,
        "last_updated": null
    },
    {
        "urduURN": 4144640,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 28,
        "babName": "بیوی کی لونڈی سے زنا کرنے والے شخص کے حکم کا بیان ۔",
        "hadithNumber": 4458,
        "hadithSanad": "حبیب بن سالم سے روایت ہے کہ",
        "hadithText": "عبدالرحمٰن بن حنین نامی ایک شخص نے اپنی بیوی کی لونڈی سے صحبت کر لی ، معاملہ کوفہ کے امیر نعمان بن بشیر رضی اللہ عنہما کے پاس لایا گیا ، تو انہوں نے کہا : میں بالکل رسول اللہ صلی اللہ علیہ وسلم کے فیصلہ کے مطابق تمہارا فیصلہ کروں گا ، اگر تمہاری بیوی نے اسے تمہارے لیے حلال کر دیا تھا تو تمہیں سو کوڑے ماروں گا ، اور اگر اسے تمہارے لیے حلال نہیں کیا تھا تو میں تمہیں رجم کروں گا ، پھر پتا چلا کہ اس کی بیوی نے اس کے لیے اس لونڈی کو حلال کر دیا تھا تو آپ نے اسے سو کوڑے مارے ۔ قتادہ کہتے ہیں : میں نے حبیب بن سالم کو لکھا تو انہوں نے یہ حدیث مجھے لکھ بھیجی ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 944610,
        "last_updated": null
    },
    {
        "urduURN": 4144650,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 28,
        "babName": "بیوی کی لونڈی سے زنا کرنے والے شخص کے حکم کا بیان ۔",
        "hadithNumber": 4459,
        "hadithSanad": "نعمان بن بشیر رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے اس شخص کے بارے میں فرمایا جو اپنی بیوی کی لونڈی سے جماع کرتا ہو : ” اگر اس کی بیوی نے اس کے لیے لونڈی کو حلال کر دیا ہو تو اسے سو کوڑے مارے جائیں ، اور اگر حلال نہ کیا ہو تو میں اسے رجم کروں گا “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 944620,
        "last_updated": null
    },
    {
        "urduURN": 4144660,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 28,
        "babName": "بیوی کی لونڈی سے زنا کرنے والے شخص کے حکم کا بیان ۔",
        "hadithNumber": 4460,
        "hadithSanad": "سلمہ بن محبق رضی اللہ عنہ سے روایت ہے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کے متعلق جس نے اپنی بیوی کی لونڈی سے صحبت کر لی تھی فیصلہ کیا کہ اگر اس نے جبراً جماع کیا ہے تو لونڈی آزاد ہے ، اور اس کی مالکہ کو اسے ویسی ہی لونڈی دینی ہو گی ، اور اگر لونڈی نے خوشی سے اس کی مان لی ہے تو وہ اس کی ہو جائیگی ، اور اسے لونڈی کی مالکہ کو ویسی ہی لونڈی دینی ہو گی ۱؎ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 944630,
        "last_updated": null
    },
    {
        "urduURN": 4144670,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 28,
        "babName": "بیوی کی لونڈی سے زنا کرنے والے شخص کے حکم کا بیان ۔",
        "hadithNumber": 4461,
        "hadithSanad": "سلمہ بن محبق رضی اللہ عنہ نبی اکرم صلی اللہ علیہ وسلم سے اسی جیسی حدیث روایت کرتے ہیں مگر اس میں ہے کہ",
        "hadithText": "اگر اس نے اس کی بات بخوشی مان لی ہو ، تو وہ لونڈی اور اسی جیسی ایک اور لونڈی خاوند کے مال سے اس کی مالکن کو دلائی جائے گی ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 944640,
        "last_updated": null
    },
    {
        "urduURN": 4144680,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 29,
        "babName": "اغلام+بازی ( قوم لوط کے فعل ) کی سزا کا بیان ۔",
        "hadithNumber": 4462,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” جسے قوم لوط کا عمل ( اغلام بازی ) کرتے ہوئے پاؤ تو کرنے والے اور جس کے ساتھ کیا گیا ہے دونوں کو قتل کر دو “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 944650,
        "last_updated": null
    },
    {
        "urduURN": 4144690,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 29,
        "babName": "اغلام+بازی ( قوم لوط کے فعل ) کی سزا کا بیان ۔",
        "hadithNumber": 4463,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما سے",
        "hadithText": "کنوارے کے بارے میں جو اغلام بازی میں پکڑا جائے مروی ہے کہ اسے سنگسار کر دیا جائے گا ۔ ابوداؤد کہتے ہیں : عاصم والی روایت عمرو بن ابی عمرو والی روایت کی تضعیف کرتی ہے ۱؎ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 113,
        "matchingArabicURN": 944660,
        "last_updated": null
    },
    {
        "urduURN": 4144700,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 30,
        "babName": "جانور سے جماع کرنے والے کی سزا کا بیان ۔",
        "hadithNumber": 4464,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” جو کسی جانور سے جماع کرے اسے قتل کر دو ، اور اس کے ساتھ اس جانور کو بھی قتل کر دو “ ۔ عکرمہ کہتے ہیں : میں نے ابن عباس سے پوچھا : اس چوپایہ کا کیا جرم ہے ؟ تو انہوں نے کہا : میں یہ سمجھتا ہوں کہ آپ نے یہ صرف اس وجہ سے فرمایا کہ ایسے جانور کے گوشت کھانے کو آپ نے برا جانا ۔ ابوداؤد کہتے ہیں : یہ حدیث قوی نہیں ہے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 114,
        "matchingArabicURN": 944670,
        "last_updated": null
    },
    {
        "urduURN": 4144710,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 30,
        "babName": "جانور سے جماع کرنے والے کی سزا کا بیان ۔",
        "hadithNumber": 4465,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "جو چوپائے سے جماع کرے اس پر حد نہیں ہے ، ابوداؤد کہتے ہیں : اسی طرح عطاء نے کہا ہے ۔ اور حکم کہتے ہیں : میری رائے یہ ہے کہ اسے کوڑے مارے جائیں ، لیکن اتنے کوڑے جو حد سے کم ہوں ۔ اور حسن کہتے ہیں : وہ زانی ہی کے درجہ میں ہے یعنی اس کی وہی سزا ہو گی جو زانی کی ہے ۔ ابوداؤد کہتے ہیں : عاصم کی حدیث عمرو بن ابی عمرو کی حدیث کی تضعیف کر رہی ہے ۱؎ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 115,
        "matchingArabicURN": 944680,
        "last_updated": null
    },
    {
        "urduURN": 4144720,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 31,
        "babName": "جب مرد زنا کا اقرار کرے اور عورت انکار کرے تو کیا ہو گا ؟",
        "hadithNumber": 4466,
        "hadithSanad": "سہل بن سعد رضی اللہ عنہ سے روایت ہے کہ",
        "hadithText": "ایک شخص نے نبی اکرم صلی اللہ علیہ وسلم کے پاس آ کر یہ اعتراف کیا کہ اس نے ایک عورت سے جس کا اس نے نام لیا زنا کیا ہے ، تو آپ نے اس عورت کو بلوایا ، اور اس سے اس بارے میں پوچھا ، اس نے انکار کیا ، تو آپ نے حد میں صرف مرد کو کوڑے مارے ، اور عورت کو چھوڑ دیا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 116,
        "matchingArabicURN": 944690,
        "last_updated": null
    },
    {
        "urduURN": 4144730,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 31,
        "babName": "جب مرد زنا کا اقرار کرے اور عورت انکار کرے تو کیا ہو گا ؟",
        "hadithNumber": 4467,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ",
        "hadithText": "قبیلہ بکر بن لیث کے ایک شخص نے نبی اکرم صلی اللہ علیہ وسلم کے پاس آ کر چار بار اقرار کیا کہ اس نے ایک عورت سے زنا کیا ہے تو آپ نے اسے سو کوڑے لگائے ، وہ کنوارا تھا ، پھر اس سے عورت کے خلاف گواہی طلب کی تو عورت نے کہا : قسم اللہ کی وہ جھوٹا ہے ، اللہ کے رسول ! تو اس پر آپ نے بہتان کے بھی اسی ( ۸۰ ) کوڑے لگائے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 117,
        "matchingArabicURN": 944700,
        "last_updated": null
    },
    {
        "urduURN": 4144740,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 32,
        "babName": "آدمی عورت سے جماع کے علاوہ سارے کام کر لے پھر گرفتاری سے پہلے توبہ کر لے تو کیا حکم ہے ؟",
        "hadithNumber": 4468,
        "hadithSanad": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں",
        "hadithText": "ایک شخص نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں آیا اور عرض کیا : مدینہ کے آخری کنارے کی ایک عورت سے میں لطف اندوز ہوا ، لیکن جماع نہیں کیا ، تو اب میں حاضر ہوں میرے اوپر جو چاہیئے حد قائم کیجئے ، عمر رضی اللہ عنہ نے کہا : اللہ نے تیری پردہ پوشی کی تھی تو تو خود بھی پردہ پوشی کرتا تو بہتر ہوتا ، رسول اللہ صلی اللہ علیہ وسلم نے اسے کوئی جواب نہیں دیا ، تو وہ شخص چلا گیا ، پھر اس کے پیچھے نبی اکرم صلی اللہ علیہ وسلم نے ایک شخص کو بھیجا ، وہ اسے بلا کر لایا تو آپ نے اس پر یہ آیت تلاوت فرمائی «وأقم الصلاة طرفى النهار وزلفا من الليل» ” دن کے دونوں سروں میں نماز قائم کرو اور رات کی کچھ ساعتوں میں بھی “ ۔ ( ھود : ۱۱۴ )  ۱؎ تو ان میں سے ایک شخص نے پوچھا : اللہ کے رسول ! کیا یہ اسی کے لیے خاص ہے ، یا سارے لوگوں کے لیے ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : ” سارے لوگوں کے لیے ہے “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 118,
        "matchingArabicURN": 944710,
        "last_updated": null
    },
    {
        "urduURN": 4144750,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 33,
        "babName": "غیر شادی+شدہ لونڈی زنا کرے تو اس کا کیا حکم ہے ؟",
        "hadithNumber": 4469,
        "hadithSanad": "ابوہریرہ اور زید بن خالد جہنی رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم سے پوچھا گیا کہ لونڈی جب زنا کرے اور وہ شادی شدہ نہ ہو ( تو اس کا کیا حکم ہے ) تو آپ صلی اللہ علیہ وسلم نے فرمایا : ” اگر وہ زنا کرے تو اسے کوڑے لگاؤ ، پھر اگر وہ زنا کرے تو اسے پھر کوڑے لگاؤ ، پھر اگر وہ زنا کرے تو اسے پھر کوڑے لگاؤ ، پھر اگر وہ زنا کرے تو اسے بیچ دو ، گو ایک رسی ہی کے عوض میں ہو “ ۔ ابن شہاب زہری کہتے ہیں : مجھے اچھی طرح معلوم نہیں کہ یہ آپ نے تیسری بار میں فرمایا : یا چوتھی بار میں اور «ضفیر»  کے معنی ” رسی “ کے ہیں ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 119,
        "matchingArabicURN": 944720,
        "last_updated": null
    },
    {
        "urduURN": 4144760,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 33,
        "babName": "غیر شادی+شدہ لونڈی زنا کرے تو اس کا کیا حکم ہے ؟",
        "hadithNumber": 4470,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” جب تم میں سے کسی کی لونڈی زنا کرے تو اس پر حد قائم کرنا چاہیئے ، یہ نہیں کہ اسے ڈانٹ ڈپٹ کر چھوڑ دے ، ایسا وہ تین بار کرے ، پھر اگر وہ چوتھی بار بھی زنا کرے تو چاہیئے کہ ایک رسی کے عوض یا بال کی رسی کے عوض اسے بیچ دے “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 120,
        "matchingArabicURN": 944730,
        "last_updated": null
    },
    {
        "urduURN": 4144770,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 33,
        "babName": "غیر شادی+شدہ لونڈی زنا کرے تو اس کا کیا حکم ہے ؟",
        "hadithNumber": 4471,
        "hadithSanad": "اس سند سے بھی ابوہریرہ رضی اللہ عنہ سے یہی حدیث مرفوعاً مروی ہے ، اس میں ہے کہ",
        "hadithText": "ہر بار اسے اللہ کی کتاب کے موافق یعنی پچاس کوڑے مارے ۱؎ اور صرف ڈانٹ ڈپٹ کر نہ چھوڑ دے ، یا حد لگانے کے بعد پھر نہ ڈانٹے ، اور چوتھی بار میں فرمایا : اگر وہ پھر زنا کرے تو پھر اسے اللہ کی کتاب کے موافق حد لگائے ، پھر چاہیئے کہ اسے بیچ دے ، گو بال کی ایک رسی ہی کے بدلے کیوں نہ ہو ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 121,
        "matchingArabicURN": 944740,
        "last_updated": null
    },
    {
        "urduURN": 4144780,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 34,
        "babName": "مریض پر حد نافذ کرنے کے حکم کا بیان ۔",
        "hadithNumber": 4472,
        "hadithSanad": "ابوامامہ اسعد بن سہل بن حنیف انصاری رضی اللہ عنہما سے روایت ہے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے کچھ انصاری صحابہ نے انہیں بتایا کہ انصاریوں میں کا ایک آدمی بیمار ہوا وہ اتنا کمزور ہو گیا کہ صرف ہڈی اور چمڑا باقی رہ گیا ، اس کے پاس انہیں میں سے کسی کی ایک لونڈی آئی تو وہ اسے پسند آ گئی اور وہ اس سے جماع کر بیٹھا ، پھر جب اس کی قوم کے لوگ اس کی عیادت کرنے آئے تو انہیں اس کی خبر دی ، اور کہا میرے متعلق رسول اللہ صلی اللہ علیہ وسلم سے مسئلہ پوچھو ، کیونکہ میں نے ایک لونڈی سے صحبت کر لی ہے ، جو میرے پاس آئی تھی ، چنانچہ انہوں نے یہ واقعہ رسول اللہ صلی اللہ علیہ وسلم سے ذکر کیا ، اور کہا : ہم نے تو اتنا بیمار اور ناتواں کسی کو نہیں دیکھا جتنا وہ ہے ، اگر ہم اسے لے کر آپ کے پاس آئیں تو اس کی ہڈیاں جدا ہو جائیں ، وہ صرف ہڈی اور چمڑے کا ڈھانچہ ہے ، تو رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا کہ درخت کی سو ٹہنیاں لیں ، اور اس سے اسے ایک بار مار دیں ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 122,
        "matchingArabicURN": 944750,
        "last_updated": null
    },
    {
        "urduURN": 4144790,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 34,
        "babName": "مریض پر حد نافذ کرنے کے حکم کا بیان ۔",
        "hadithNumber": 4473,
        "hadithSanad": "علی رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے اہل بیت میں سے کسی کی لونڈی نے حرام کاری کر لی تو آپ نے فرمایا : ” علی ! جاؤ اور اس پر حد قائم کرو “ میں گیا تو کیا دیکھتا ہوں کہ اس کا خون بہے چلا جا رہا ہے ، رکتا ہی نہیں ، یہ دیکھ کر میں آپ کے پاس واپس آ گیا ، تو آپ صلی اللہ علیہ وسلم نے پوچھا : ” علی ! کیا حد لگا کر آ گئے ؟ “ میں نے عرض کیا : اللہ کے رسول ! میں اس کے پاس آیا دیکھا تو اس کا خون بہ رہا ہے ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” اچھا بند ہونے تک رکے رہو ، جب بند ہو جائے تو اسے ضرور حد لگاؤ ، اور حدوں کو اپنے غلاموں اور لونڈیوں پر بھی قائم کیا کرو “ ۔ ابوداؤد کہتے ہیں : اسی طرح ابوالاحوص نے عبدالاعلیٰ سے روایت کیا ہے ، اور اسے شعبہ نے بھی عبدالاعلی سے روایت کیا ہے ، اس میں ہے آپ صلی اللہ علیہ وسلم نے فرمایا : ” اسے حد نہ لگانا جب تک وہ بچہ جن نہ دے “ لیکن پہلی روایت زیادہ صحیح ہے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 123,
        "matchingArabicURN": 944760,
        "last_updated": null
    },
    {
        "urduURN": 4144800,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 35,
        "babName": "زنا کی تہمت کی حد کا بیان ۔",
        "hadithNumber": 4474,
        "hadithSanad": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ",
        "hadithText": "جب میری برات کی آیتیں نازل ہوئیں تو نبی اکرم صلی اللہ علیہ وسلم منبر پر کھڑے ہوئے ، آپ نے اس کا ذکر کیا ، اور قرآن کی ان آیتوں کی تلاوت کی ، پھر جب منبر پر سے اترے تو آپ صلی اللہ علیہ وسلم نے دو مردوں اور ایک عورت کے سلسلے میں حکم دیا تو ان پر حد جاری کیا گیا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 124,
        "matchingArabicURN": 944770,
        "last_updated": null
    },
    {
        "urduURN": 4144810,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 35,
        "babName": "زنا کی تہمت کی حد کا بیان ۔",
        "hadithNumber": 4475,
        "hadithSanad": "اس سند سے بھی محمد بن اسحاق سے یہی حدیث مروی ہے",
        "hadithText": "اس میں انہوں نے عائشہ رضی اللہ عنہا کا ذکر نہیں کیا ہے اس میں ہے : آپ نے دو مردوں اور ایک عورت کو جنہوں نے بری بات منہ سے نکالی تھی ( کوڑے لگانے کا ) حکم دیا ، وہ حسان بن ثابت رضی اللہ عنہ اور مسطح بن اثاثہ رضی اللہ عنہ تھے نفیل کہتے ہیں : اور لوگ کہتے ہیں کہ عورت حمنہ بنت جحش رضی اللہ عنہا تھیں ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 125,
        "matchingArabicURN": 944780,
        "last_updated": null
    },
    {
        "urduURN": 4144820,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 36,
        "babName": "شراب کی حد کا بیان ۔",
        "hadithNumber": 4476,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے شراب کے حد کی تعیین نہیں فرمائی ، ابن عباس رضی اللہ عنہما کہتے ہیں کہ ایک شخص نے شراب پی اور بدمست ہو کر جھومتے ہوئے راستے میں لوگوں کو چلتے ملا تو اسے پکڑ کر وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس لے کر آئے جب وہ عباس رضی اللہ عنہ کے گھر کے سامنے ہوا تو چھڑا کر بھاگا اور عباس رضی اللہ عنہ کے مکان میں جا گھسا ، اور ان سے چمٹ گیا ، پھر یہ قصہ نبی اکرم صلی اللہ علیہ وسلم سے ذکر کیا گیا تو آپ ہنسے ، اور صرف اتنا فرمایا : ” کیا اس نے ایسا کیا ہے ؟ “ آپ نے اس کے بارے میں کوئی اور حکم نہیں دیا ۔ ابوداؤد کہتے ہیں : حسن بن علی کی اس حدیث کی روایت میں اہل مدینہ منفرد ہیں ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 126,
        "matchingArabicURN": 944790,
        "last_updated": null
    },
    {
        "urduURN": 4144830,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 36,
        "babName": "شراب کی حد کا بیان ۔",
        "hadithNumber": 4477,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "ایک شخص رسول اللہ صلی اللہ علیہ وسلم کے پاس لایا گیا جس نے شراب پی رکھی تھی ، تو آپ نے فرمایا : ” اسے مارو “ ابوہریرہ رضی اللہ عنہ کہتے ہیں : تو ہم میں سے کسی نے ہاتھ سے ، کسی نے جوتے سے ، اور کسی نے کپڑے سے ، اسے مارا ، پھر جب فارغ ہوئے تو کسی نے کہا : اللہ تجھے رسوا کرے ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” ایسا نہ کہو اس کے خلاف شیطان کی مدد نہ کرو “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 127,
        "matchingArabicURN": 944800,
        "last_updated": null
    },
    {
        "urduURN": 4144840,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 36,
        "babName": "شراب کی حد کا بیان ۔",
        "hadithNumber": 4478,
        "hadithSanad": "ابن الہاد سے اسی سند سے اسی مفہوم کی روایت آئی ہے اس میں ہے کہ",
        "hadithText": "اسے مار چکنے کے بعد رسول اللہ صلی اللہ علیہ وسلم نے اپنے اصحاب سے فرمایا : ” تم لوگ اسے زبانی عار دلاؤ “ ، تو لوگ اس کی طرف یہ کہتے ہوئے متوجہ ہوئے : ” نہ تو تو اللہ سے ڈرا ، نہ اس سے خوف کھایا نہ رسول اللہ صلی اللہ علیہ وسلم سے شرمایا “ پھر لوگوں نے اسے چھوڑ دیا ، اور اس کے آخر میں ہے : ” لیکن یوں کہو : اے اللہ اس کو بخش دے ، اس پر ر حم فرما “ کچھ لوگوں نے اس سیاق میں کچھ کمی بیشی کی ہے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 128,
        "matchingArabicURN": 944810,
        "last_updated": null
    },
    {
        "urduURN": 4144850,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 36,
        "babName": "شراب کی حد کا بیان ۔",
        "hadithNumber": 4479,
        "hadithSanad": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے شراب پینے پر کھجور کی ٹہنیوں اور جوتوں سے مارا ، اور ابوبکر رضی اللہ عنہ نے چالیس کوڑے لگائے ، پھر جب عمر رضی اللہ عنہ خلیفہ ہوئے تو آپ نے لوگوں کو بلایا ، اور ان سے کہا : لوگ گاؤں سے قریب ہو گئے ہیں ( اور مسدد کی روایت میں ہے ) بستیوں اور گاؤں سے قریب ہو گئے ہیں ( یعنی شراب زیادہ پینے لگے ہیں ) تو اب شراب کی حد کے بارے میں تمہاری کیا رائے ہے ؟ تو عبدالرحمٰن بن عوف نے ان سے کہا : ہماری رائے یہ ہے کہ سب سے ہلکی جو حد ہے وہی آپ اس میں مقرر کر دیں ، چنانچہ اسی ( ۸۰ ) کوڑے مارنے کا حکم ہوا ( کیونکہ سب سے ہلکی حد یہی حدقذف تھی ) ۔ ابوداؤد کہتے ہیں : اسے ابن ابی عروبہ نے قتادہ سے ، قتادہ نے نبی اکرم صلی اللہ علیہ وسلم سے مرفوعاً روایت کیا ہے کہ آپ صلی اللہ علیہ وسلم نے کھجور کی ٹہنیوں اور جوتوں سے چالیس مار ماریں ۔ اور اسے شعبہ نے قتادہ سے ، قتادہ نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کیا ہے کہ آپ نے کھجور کی دو ٹہنیوں سے چالیس کے قریب مار ماریں ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 129,
        "matchingArabicURN": 944820,
        "last_updated": null
    },
    {
        "urduURN": 4144860,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 36,
        "babName": "شراب کی حد کا بیان ۔",
        "hadithNumber": 4480,
        "hadithSanad": "حضین بن منذر رقاشی ابوساسان کہتے ہیں کہ",
        "hadithText": "میں عثمان بن عفان رضی اللہ عنہ کے پاس موجود تھا کہ ولید بن عقبہ کو ان کے پاس لایا گیا ، اور حمران اور ایک اور شخص نے اس کے خلاف گواہی دی ، ان میں سے ایک نے گواہی دی کہ اس نے شراب پی ہے ، اور دوسرے نے گواہی دی کہ میں نے اسے ( شراب ) قے کرتے دیکھا ہے ، تو عثمان نے کہا : جب تک پیئے گا نہیں قے نہیں کر سکتا ، پھر انہوں نے علی رضی اللہ عنہ سے کہا : تم اس پر حد قائم کرو ، تو علی نے حسن رضی اللہ عنہ سے کہا : تم اس پر حد قائم کرو ، تو حسن نے کہا : جو خلافت کی آسانیوں اور خیرات کا ذمہ دار رہا ہے وہی اس کی سختیوں اور برائیوں کا بھی ذمہ دار ہے ، پھر علی رضی اللہ عنہ نے عبداللہ بن جعفر سے کہا : تم اس پر حد قائم کرو ، تو انہوں نے کوڑا لے کر اسے مارنا شروع کیا ، اور علی رضی اللہ عنہ گننے لگے ، تو جب چالیس کوڑے ہوئے تو علی رضی اللہ عنہ نے کہا : بس کافی ہے ، اس لیے کہ رسول اللہ صلی اللہ علیہ وسلم نے چالیس کوڑے ہی مارے ہیں ، اور میرا خیال ہے انہوں نے یہ بھی کہا کہ ابوبکر رضی اللہ عنہ نے بھی چالیس کوڑے مارے ہیں ، اور عمر رضی اللہ عنہ نے اسی ، اور سب سنت ہے ، اور یہ چالیس کوڑے مجھے زیادہ پسند ہیں ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 130,
        "matchingArabicURN": 944830,
        "last_updated": null
    },
    {
        "urduURN": 4144870,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 36,
        "babName": "شراب کی حد کا بیان ۔",
        "hadithNumber": 4481,
        "hadithSanad": "علی رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ نے شراب میں چالیس کوڑے ہی مارے ، اور عمر رضی اللہ عنہ نے اسی کوڑے پورے کئے ، اور یہ سب سنت ہے ۔ ابوداؤد کہتے ہیں : اصمعی کہتے ہیں : «من تولى قارها ول شديدها من تولى هينها» کے معنی یہ ہیں جو خلافت کی آسانیوں کا ذمہ دار رہا ہے اسی کو اس کی دشواریوں کا ذمہ دار رہنا چاہیئے ۔ ابوداؤد کہتے ہیں : یہ اپنی قوم کے سردار تھے یعنی حضین بن منذر ابوساسان ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 131,
        "matchingArabicURN": 944840,
        "last_updated": null
    },
    {
        "urduURN": 4144880,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 37,
        "babName": "جو باربار شراب پیئے اس کی سزا کا بیان ۔",
        "hadithNumber": 4482,
        "hadithSanad": "معاویہ بن ابی سفیان رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” جب وہ شراب پئیں تو انہیں کوڑے لگاؤ ، پھر پئیں تو پھر کوڑے لگاؤ ، پھر پئیں تو پھر کوڑے لگاؤ ، پھر پئیں تو انہیں قتل کر دو “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 132,
        "matchingArabicURN": 944850,
        "last_updated": null
    },
    {
        "urduURN": 4144890,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 37,
        "babName": "جو باربار شراب پیئے اس کی سزا کا بیان ۔",
        "hadithNumber": 4483,
        "hadithSanad": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ایسے ہی فرمایا ہے ، اس میں یہ ہے کہ میرا خیال ہے کہ پانچویں بار میں فرمایا : ” پھر اگر وہ پئے تو اسے قتل کر دو “ ۔ ابوداؤد کہتے ہیں : اسی طرح ابوغطیف کی روایت میں پانچویں بار کا ذکر ہے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 133,
        "matchingArabicURN": 944860,
        "last_updated": null
    },
    {
        "urduURN": 4144900,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 37,
        "babName": "جو باربار شراب پیئے اس کی سزا کا بیان ۔",
        "hadithNumber": 4484,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” شرابی جب نشہ سے مست ہو جائے تو اسے کوڑے مارو ، پھر اگر نشہ سے مست ہو جائے تو اسے پھر کوڑے مارو ، پھر اگر نشہ سے مست ہو جائے تو اسے پھر کوڑے مارو ، اور اگر چوتھی بار پھر ایسا ہی کرے تو اسے قتل کر دو “ ۔ ابوداؤد کہتے ہیں : اسی طرح عمر بن ابی سلمہ کی روایت ہے جسے وہ اپنے والد سے اور ابوسلمہ ابوہریرہ سے اور ابوہریرہ نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ کوئی شراب پئے تو اسے کوڑے لگاؤ ، اور اگر چوتھی بار پھر ویسے ہی کرے تو اسے قتل کر دو ۔ ابوداؤد کہتے ہیں : اسی طرح سہیل کی حدیث ہے جسے وہ ابوصالح سے اور ابوصالح ابوہریرہ سے اور ابوہریرہ نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ اگر وہ چوتھی دفعہ پئے تو اسے قتل کر دو “ ۔ اور اسی طرح ابن ابی نعم کی روایت بھی ہے جسے وہ ابن عمر رضی اللہ عنہما سے اور ابن عمر نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے ہیں ۔ اور اسی طرح عبداللہ بن عمرو رضی اللہ عنہما اور شرید رضی اللہ عنہ کی مرفوع روایت بھی ہے ، اور جدلی کی روایت میں ہے جسے وہ معاویہ رضی اللہ عنہ سے روایت کرتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” اگر وہ تیسری یا چوتھی بار پھر کرے تو اسے قتل کر دو “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 134,
        "matchingArabicURN": 944870,
        "last_updated": null
    },
    {
        "urduURN": 4144910,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 37,
        "babName": "جو باربار شراب پیئے اس کی سزا کا بیان ۔",
        "hadithNumber": 4485,
        "hadithSanad": "قبیصہ بن ذؤیب رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” جو شراب پئے تو اسے کوڑے لگاؤ ، اگر پھر پئے تو پھر کوڑے لگاؤ ، اگر پھر پئے تو پھر کوڑے لگاؤ ، پھر اگر وہ تیسری یا چوتھی دفعہ پئے تو اسے قتل کر دو “ تو ایک شخص لایا گیا جس نے شراب پی رکھی تھی ، تو آپ نے اسے کوڑے لگائے ، پھر اسے لایا گیا ، آپ نے پھر اسے کوڑے لگائے ، پھر اسے لایا گیا ، تو آپ نے اسے کوڑے لگائے ، پھر لایا گیا تو پھر آپ نے کوڑے ہی لگائے ، اور قتل کا حکم اٹھا دیا اور رخصت ہو گئی ۔ سفیان کہتے ہیں : زہری نے اس حدیث کو بیان کیا اور ان کے پاس منصور بن معتمر اور مخول بن راشد موجود تھے تو انہوں نے ان دونوں سے کہا : تم دونوں اہل عراق کے لیے یہ حدیث یہاں سے تحفے میں لیتے جانا ۔ ابوداؤد کہتے ہیں : اس حدیث کو شرید بن سوید ، شرحبیل بن اوس ، عبداللہ بن عمرو ، عبداللہ بن عمر ، ابوغطیف کندی اور ابوسلمہ بن عبدالرحمٰن نے ابوہریرہ سے روایت کیا ہے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 135,
        "matchingArabicURN": 944880,
        "last_updated": null
    },
    {
        "urduURN": 4144920,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 37,
        "babName": "جو باربار شراب پیئے اس کی سزا کا بیان ۔",
        "hadithNumber": 4486,
        "hadithSanad": "علی رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "میں جس پر حد قائم کروں اور وہ مر جائے تو میں اس کی دیت نہیں دوں گا ، یا میں اس کی دیت دینے والا نہیں سوائے شراب پینے والے کے ، کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے شراب پینے والے کی کوئی حد مقرر نہیں کی ہے ، یہ تو ایک ایسی چیز ہے جسے ہم نے خود مقرر کی ہے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 136,
        "matchingArabicURN": 944890,
        "last_updated": null
    },
    {
        "urduURN": 4144930,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 37,
        "babName": "جو باربار شراب پیئے اس کی سزا کا بیان ۔",
        "hadithNumber": 4487,
        "hadithSanad": "عبدالرحمٰن بن ازہر رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "گویا میں اس وقت رسول اللہ صلی اللہ علیہ وسلم کو دیکھ رہا ہوں آپ کجاؤں کے درمیان میں کھڑے تھے ، خالد بن ولید رضی اللہ عنہ کا کجاوہ ڈھونڈ رہے تھے ، آپ اسی حالت میں تھے کہ اتنے میں ایک شخص لایا گیا جس نے شراب پی رکھی تھی ، تو آپ صلی اللہ علیہ وسلم نے لوگوں سے کہا : ” اسے مارو “ ، تو کسی نے جوتے سے ، کسی نے چھڑی سے ، اور کسی نے کھجور کی ٹہنی سے اسے مارا ( ابن وہب کہتے ہیں ) «ميتخة» کے معنی کھجور کی تر ٹہنی کے ہیں پھر رسول اللہ صلی اللہ علیہ وسلم نے زمین سے مٹی لی اور اس کے چہرے پر ڈال دی ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 137,
        "matchingArabicURN": 944900,
        "last_updated": null
    },
    {
        "urduURN": 4144940,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 37,
        "babName": "جو باربار شراب پیئے اس کی سزا کا بیان ۔",
        "hadithNumber": 4488,
        "hadithSanad": "عبدالرحمٰن بن ازہر رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم کے پاس ایک شرابی لایا گیا ، اور آپ حنین میں تھے ، آپ نے اس کے منہ پر خاک ڈال دی ، پھر اپنے اصحاب کو حکم دیا تو انہوں نے اسے اپنے جوتوں سے ، اور جو چیزیں ان کے ہاتھوں میں تھیں ان سے مارا ، یہاں تک کہ آپ فرمانے لگے : ” بس کرو ، بس کرو “ تب لوگوں نے اسے چھوڑا ، پھر رسول اللہ صلی اللہ علیہ وسلم وفات پا گئے تو آپ کے بعد ابوبکر رضی اللہ عنہ بھی شراب کی حد میں چالیس کوڑے مارتے رہے ، پھر عمر رضی اللہ عنہ نے بھی اپنی خلافت کے شروع میں چالیس کوڑے ہی مارے ، پھر خلافت کے اخیر میں انہوں نے اسی کوڑے مارے ، پھر عثمان رضی اللہ عنہ نے کبھی اسی کوڑے اور کبھی چالیس کوڑے مارے ، پھر معاویہ رضی اللہ عنہ نے اسی کوڑوں کی تعیین کر دی ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 138,
        "matchingArabicURN": 944910,
        "last_updated": null
    },
    {
        "urduURN": 4144950,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 37,
        "babName": "جو باربار شراب پیئے اس کی سزا کا بیان ۔",
        "hadithNumber": 4489,
        "hadithSanad": "عبدالرحمٰن بن ازہر کہتے ہیں کہ",
        "hadithText": "میں نے فتح مکہ کے دوسرے دن صبح کو رسول اللہ صلی اللہ علیہ وسلم کو دیکھا میں ایک کمسن لڑکا تھا ، لوگوں میں گھس کر آیا جایا کرتا تھا ، آپ خالد بن ولید رضی اللہ عنہ کی قیام گاہ ڈھونڈ رہے تھے کہ اتنے میں ایک شرابی لایا گیا ، آپ نے اسے مارنے کا حکم دیا ، تو لوگوں کے ہاتھوں میں جو چیز بھی تھی اسی سے انہوں نے اس کی پٹائی کی ، کسی نے اسے کوڑے سے ، کسی نے لاٹھی سے ، کسی نے جوتے سے پیٹا ، اور رسول اللہ صلی اللہ علیہ وسلم نے اس کے منہ پر مٹی ڈال دی ، پھر جب ابوبکر رضی اللہ عنہ کا زمانہ آیا تو ان کے پاس ایک شرابی لایا گیا تو انہوں نے لوگوں سے نبی اکرم صلی اللہ علیہ وسلم کی اس مار کے متعلق دریافت کیا جسے آپ نے مارا تھا تو لوگوں نے اس کا اندازہ لگایا کہ یہ چالیس کوڑے رہے ہوں گے ، تو ابوبکر رضی اللہ عنہ نے اس کی حد چالیس کوڑے مقرر کر دی ، پھر جب عمر رضی اللہ عنہ کا زمانہ آیا تو خالد بن ولید نے انہیں لکھا کہ لوگ کثرت سے شراب پینے لگے ہیں اور اس کی حد اور سزا کو کوئی اہمیت نہیں دیتے اور لکھا کہ لوگ آپ کے پاس ہیں ان سے پوچھ لیں ، اس وقت ان کے پاس مہاجرین اولین موجود تھے ، آپ نے ان سے پوچھا تو سب کا اس بات پر اتفاق ہو گیا کہ اسی کوڑے مارے جائیں ، علی رضی اللہ عنہ نے کہا : آدمی جب شراب پیتا ہے تو بہتان باندھتا ہے اس لیے میری رائے یہ ہے کہ اس کی حد بہتان کی حد کر دی جائے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 139,
        "matchingArabicURN": 944920,
        "last_updated": null
    },
    {
        "urduURN": 4144960,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 38,
        "babName": "مسجد میں حدود کا نفاذ ممنوع ہے ۔",
        "hadithNumber": 4490,
        "hadithSanad": "حکیم بن حزام رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے مسجد میں قصاص لینے ، اشعار پڑھنے اور حد قائم کرنے سے منع فرمایا ہے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 140,
        "matchingArabicURN": 944930,
        "last_updated": null
    },
    {
        "urduURN": 4144970,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 39,
        "babName": "تعزیر کا بیان ۔",
        "hadithNumber": 4491,
        "hadithSanad": "ابوبردہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” کوڑے دس سے زیادہ نہ مارے جائیں سوائے اللہ کی حدود میں سے کسی حد میں ۱؎ “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 141,
        "matchingArabicURN": 944940,
        "last_updated": null
    },
    {
        "urduURN": 4144980,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 39,
        "babName": "تعزیر کا بیان ۔",
        "hadithNumber": 4492,
        "hadithSanad": "جابر رضی اللہ عنہ بیان کرتے ہیں کہ",
        "hadithText": "انہوں نے ابوبردہ انصاری سے سنا ہے وہ کہہ رہے تھے : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے پھر انہوں نے اسی مفہوم کی حدیث ذکر کی ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 142,
        "matchingArabicURN": 944950,
        "last_updated": null
    },
    {
        "urduURN": 4144990,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 47,
        "bookName": "حدود اور تعزیرات کا بیان",
        "babNumber": 40,
        "babName": "حد میں چہرے پر مارنا منع ہے ۔",
        "hadithNumber": 4493,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” جب کوئی کسی کو مارے تو چہرے پر مارنے سے بچے “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 143,
        "matchingArabicURN": 944960,
        "last_updated": null
    }
]