[
    {
        "urduURN": 4146030,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 1,
        "babName": "سنت و عقائد کی شرح و تفسیر ۔",
        "hadithNumber": 4596,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” یہود اکہتر یا بہتر فرقوں میں بٹ گئے ، نصاریٰ اکہتر یا بہتر فرقوں میں بٹ گئے اور میری امت تہتر فرقوں میں بٹ جائے گی ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 945990,
        "last_updated": null
    },
    {
        "urduURN": 4146040,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 1,
        "babName": "سنت و عقائد کی شرح و تفسیر ۔",
        "hadithNumber": 4597,
        "hadithSanad": "ابوعامر عبداللہ بن لحی حمصی ہوزنی کہتے ہیں کہ",
        "hadithText": "معاویہ رضی اللہ عنہ نے ہمارے درمیان کھڑے ہو کر کہا : سنو ! رسول اللہ صلی اللہ علیہ وسلم ہمارے درمیان کھڑے ہوئے اور فرمایا : ” سنو ! تم سے پہلے جو اہل کتاب تھے ، بہتر ( ۷۲ ) فرقوں میں بٹ گئے ، اور یہ امت تہتر ( ۷۳ ) فرقوں میں بٹ جائے گی ، بہتر فرقے جہنم میں ہوں گے اور ایک جنت میں اور یہی «الجماعة» ہے “ ۔ ابن یحییٰ اور عمرو نے اپنی روایت میں اتنا مزید بیان کیا : ” اور عنقریب میری امت میں ایسے لوگ نکلیں گے جن میں گمراہیاں اسی طرح سمائی ہوں گی ، جس طرح کتے کا اثر اس شخص پر چھا جاتا ہے جسے اس نے کاٹ لیا ہو ۱؎ “ ۔ اور عمرو کی روایت میں «لصاحبه» کے بجائے «بصاحبه» ہے اس میں یہ بھی ہے : کوئی رگ اور کوئی جوڑ ایسا باقی نہیں رہتا جس میں اس کا اثر داخل نہ ہوا ہو ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 946000,
        "last_updated": null
    },
    {
        "urduURN": 4146050,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 2,
        "babName": "قرآن میں جھگڑنا اور متشابہ آیات کے چکر میں پڑنا منع ہے ۔",
        "hadithNumber": 4598,
        "hadithSanad": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے آیت کریمہ «هو الذي أنزل عليك الكتاب منه آيات محكمات» سے لے کر «أولو الألباب» ۱؎ تک تلاوت کی اور فرمایا : ” جب تم ایسے لوگوں کو دیکھو جو متشابہ آیات کے پیچھے پڑتے ہوں تو جان لو کہ یہی لوگ ہیں جن کا اللہ نے نام لیا ہے تو ان سے بچو ۲؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 946010,
        "last_updated": null
    },
    {
        "urduURN": 4146060,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 3,
        "babName": "بدعتیوں اور ہوا پرستوں کی صحبت سے بچنے اور ان سے بغض و نفرت رکھنے کا بیان ۔",
        "hadithNumber": 4599,
        "hadithSanad": "ابوذر رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” سب سے افضل عمل اللہ کے واسطے محبت کرنا اور اللہ ہی کے واسطے دشمنی رکھنا ہے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 946020,
        "last_updated": null
    },
    {
        "urduURN": 4146070,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 3,
        "babName": "بدعتیوں اور ہوا پرستوں کی صحبت سے بچنے اور ان سے بغض و نفرت رکھنے کا بیان ۔",
        "hadithNumber": 4600,
        "hadithSanad": "عبداللہ بن کعب سے روایت ہے",
        "hadithText": "( جب کعب رضی اللہ عنہ نابینا ہو گئے تو ان کے بیٹوں میں عبداللہ آپ کے قائد تھے ) وہ کہتے ہیں : میں نے کعب بن مالک سے سنا ( ابن السرح ان کے غزوہ تبوک میں نبی اکرم صلی اللہ علیہ وسلم سے پیچھے رہ جانے کا واقعہ ذکر کر کے کہتے ہیں کہ کعب نے کہا ) رسول اللہ صلی اللہ علیہ وسلم نے مسلمانوں کو ہم تینوں سے گفتگو کرنے سے منع فرما دیا یہاں تک کہ جب لمبا عرصہ ہو گیا تو میں ابوقتادہ رضی اللہ عنہ کے باغ کی دیوار کود کر ان کے پاس گیا ، وہ میرے چچا زاد بھائی تھے ، میں نے انہیں سلام کیا تو قسم اللہ کی ! انہوں نے میرے سلام کا جواب نہیں دیا ، پھر راوی نے ان کی توبہ کے نازل ہونے کا قصہ بیان کیا ۱؎ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 946030,
        "last_updated": null
    },
    {
        "urduURN": 4146080,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 4,
        "babName": "اہل+بدعت کو سلام نہ کرنے کا بیان ۔",
        "hadithNumber": 4601,
        "hadithSanad": "عمار بن یاسر رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "میں اپنے گھر والوں کے پاس آیا ، میرے دونوں ہاتھ پھٹ گئے تھے ، تو انہوں نے میرے ( ہاتھوں پر ) زعفران مل دیا ، صبح کو میں نبی اکرم صلی اللہ علیہ وسلم کے پاس گیا اور سلام کیا تو آپ نے مجھے جواب نہیں دیا اور فرمایا : ” جاؤ اسے دھو ڈالو “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 946040,
        "last_updated": null
    },
    {
        "urduURN": 4146090,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 4,
        "babName": "اہل+بدعت کو سلام نہ کرنے کا بیان ۔",
        "hadithNumber": 4602,
        "hadithSanad": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ",
        "hadithText": "ام المؤمنین صفیہ بنت حیی رضی اللہ عنہا کا ایک اونٹ بیمار ہو گیا اور ام المؤمنین زینب رضی اللہ عنہا کے پاس ایک فاضل سواری تھی تو رسول اللہ صلی اللہ علیہ وسلم نے زینب سے فرمایا : ” تم اسے ایک اونٹ دے دو “ وہ بولیں : میں اس یہودن کو دے دوں ؟ اس پر رسول اللہ صلی اللہ علیہ وسلم ناراض ہو گئے اور ذی الحجہ ، محرم اور صفر کے چند دنوں تک ان سے بات چیت ترک رکھی ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 946050,
        "last_updated": null
    },
    {
        "urduURN": 4146100,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 5,
        "babName": "قرآن کے بارے میں جھگڑنے کی ممانعت کا بیان ۔",
        "hadithNumber": 4603,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” قرآن کے بارے میں جھگڑنا کفر ہے ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 946060,
        "last_updated": null
    },
    {
        "urduURN": 4146110,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 6,
        "babName": "سنت کی پیروی ضروری ہے ۔",
        "hadithNumber": 4604,
        "hadithSanad": "مقدام بن معد یکرب رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” سنو ، مجھے کتاب ( قرآن ) دی گئی ہے اور اس کے ساتھ اسی کے مثل ایک اور چیز بھی ( یعنی سنت ) ، قریب ہے کہ ایک آسودہ آدمی اپنے تخت پر ٹیک لگائے ہوئے کہے ۱؎ : اس قرآن کو لازم پکڑو ، جو کچھ تم اس میں حلال پاؤ اسی کو حلال سمجھو ، اور جو اس میں حرام پاؤ ، اسی کو حرام سمجھو ، سنو ! تمہارے لیے پالتو گدھے کا گوشت حلال نہیں ، اور نہ کسی نوکیلے دانت والے درندے کا ، اور نہ تمہارے لیے کسی ذمی کی پڑی ہوئی چیز حلال ہے سوائے اس کے کہ اس کا مالک اس سے دستبردار ہو جائے ، اور اگر کوئی کسی قوم میں قیام کرے تو ان پر اس کی ضیافت لازم ہے ، اور اگر وہ اس کی ضیافت نہ کریں تو اسے حق ہے کہ وہ ان سے مہمانی کے بقدر لے لے ۲؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 946070,
        "last_updated": null
    },
    {
        "urduURN": 4146120,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 6,
        "babName": "سنت کی پیروی ضروری ہے ۔",
        "hadithNumber": 4605,
        "hadithSanad": "ابورافع رضی اللہ عنہ سے روایت ہے کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” میں تم میں سے کسی کو اپنے تخت پر ٹیک لگائے ہرگز اس حال میں نہ پاؤں کہ اس کے پاس میرے احکام اور فیصلوں میں سے کوئی حکم آئے جن کا میں نے حکم دیا ہے یا جن سے روکا ہے اور وہ یہ کہے : یہ ہم نہیں جانتے ، ہم نے تو اللہ کی کتاب میں جو کچھ پایا بس اسی کی پیروی کی ہے ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 946080,
        "last_updated": null
    },
    {
        "urduURN": 4146130,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 6,
        "babName": "سنت کی پیروی ضروری ہے ۔",
        "hadithNumber": 4606,
        "hadithSanad": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” جو ہمارے اس دین میں کوئی ایسی نئی بات پیدا کرے جو اس میں نہیں ہے تو وہ مردود ہے “ ۔ ابن عیسیٰ کی روایت میں ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” جو کوئی ایسا کام کرے جو ہمارے طریقے کے خلاف ہو تو وہ مردود ہے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 946090,
        "last_updated": null
    },
    {
        "urduURN": 4146140,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 6,
        "babName": "سنت کی پیروی ضروری ہے ۔",
        "hadithNumber": 4607,
        "hadithSanad": "عبدالرحمٰن بن عمرو سلمی اور حجر بن حجر کہتے ہیں کہ",
        "hadithText": "ہم عرباض بن ساریہ رضی اللہ عنہ کے پاس آئے ، یہ ان لوگوں میں سے ہیں جن کے بارے میں آیت کریمہ «ولا على الذين إذا ما أتوك لتحملهم قلت لا أجد ما أحملكم عليه» ۱؎ نازل ہوئی ، تو ہم نے سلام کیا اور عرض کیا : ہم آپ کے پاس آپ سے ملنے ، آپ کی عیادت کرنے ، اور آپ سے علم حاصل کرنے کے لیے آئے ہیں ، اس پر عرباض رضی اللہ عنہ نے کہا : ایک دن ہمیں رسول اللہ صلی اللہ علیہ وسلم نے نماز پڑھائی ، پھر ہماری طرف متوجہ ہوئے اور ہمیں دل موہ لینے والی نصیحت کی جس سے آنکھیں اشک بار ہو گئیں ، اور دل کانپ گئے ، پھر ایک شخص نے عرض کیا : اللہ کے رسول ! یہ تو کسی رخصت کرنے والے کی سی نصیحت ہے ، تو آپ ہمیں کیا وصیت فرما رہے ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : ” میں تمہیں اللہ سے ڈرنے ، امیر کی بات سننے اور اس کی اطاعت کرنے کی وصیت کرتا ہوں ، خواہ وہ کوئی حبشی غلام ہی کیوں نہ ہو ، اس لیے کہ جو میرے بعد تم میں سے زندہ رہے گا عنقریب وہ بہت سے اختلافات دیکھے گا ، تو تم میری سنت اور ہدایت یافتہ خلفاء راشدین کے طریقہ کار کو لازم پکڑنا ، تم اس سے چمٹ جانا ، اور اسے دانتوں سے مضبوط پکڑ لینا ، اور دین میں نکالی گئی نئی باتوں سے بچتے رہنا ، اس لیے کہ ہر نئی بات بدعت ہے ، اور ہر بدعت گمراہی ہے ۲؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 946100,
        "last_updated": null
    },
    {
        "urduURN": 4146150,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 6,
        "babName": "سنت کی پیروی ضروری ہے ۔",
        "hadithNumber": 4608,
        "hadithSanad": "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے تین بار فرمایا : ” سنو ، بہت زیادہ بحث و تکرار کرنے اور جھگڑنے والے ہلاک ہو گئے ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 946110,
        "last_updated": null
    },
    {
        "urduURN": 4146160,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 7,
        "babName": "سنت پر عمل کرنے کی دعوت دینے والوں کے اجر+و+ثواب کا بیان ۔",
        "hadithNumber": 4609,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” جو شخص دوسروں کو نیک عمل کی دعوت دیتا ہے تو اس کی دعوت سے جتنے لوگ ان نیک باتوں پر عمل کرتے ہیں ان سب کے برابر اس دعوت دینے والے کو بھی ثواب ملتا ہے ، اور عمل کرنے والوں کے ثواب میں سے کوئی کمی نہیں کی جاتی ، اور جو کسی گمراہی و ضلالت کی طرف بلاتا ہے تو جتنے لوگ اس کے بلانے سے اس پر عمل کرتے ہیں ان سب کے برابر اس کو گناہ ہوتا ہے اور ان کے گناہوں میں ( بھی ) کوئی کمی نہیں ہوتی “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 946120,
        "last_updated": null
    },
    {
        "urduURN": 4146170,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 7,
        "babName": "سنت پر عمل کرنے کی دعوت دینے والوں کے اجر+و+ثواب کا بیان ۔",
        "hadithNumber": 4610,
        "hadithSanad": "سعد بن ابی وقاص رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” مسلمانوں کے حق میں سب سے بڑا مجرم وہ مسلمان ہے جو ایسی چیز کے بارے میں سوال کرے جو حرام نہیں کی گئی تھی لیکن اس کے سوال کرنے کی وجہ سے مسلمانوں پر حرام کر دی گئی ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 946130,
        "last_updated": null
    },
    {
        "urduURN": 4146180,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 7,
        "babName": "سنت پر عمل کرنے کی دعوت دینے والوں کے اجر+و+ثواب کا بیان ۔",
        "hadithNumber": 4611,
        "hadithSanad": "ابوادریس خولانی کہتے ہیں کہ",
        "hadithText": "یزید بن عمیرہ ( جو معاذ بن جبل رضی اللہ عنہ کے شاگردوں میں سے تھے ) نے انہیں خبر دی ہے کہ وہ جب بھی کسی مجلس میں وعظ کہنے کو بیٹھتے تو کہتے : اللہ بڑا حاکم اور عادل ہے ، شک کرنے والے تباہ ہو گئے تو ایک روز معاذ بن جبل رضی اللہ عنہ کہنے لگے : تمہارے بعد بڑے بڑے فتنے ہوں گے ، ان ( دنوں ) میں مال کثرت سے ہو گا ، قرآن آسان ہو جائے گا ، یہاں تک کہ اسے مومن و منافق ، مرد و عورت ، چھوٹے بڑے ، غلام اور آزاد سبھی حاصل کر لیں گے ، تو قریب ہے کہ کہنے والا کہے : لوگوں کو کیا ہو گیا ہے ؟ میری پیروی نہیں کرتے ، حالانکہ میں نے قرآن پڑھا ہے ، وہ میری پیروی اس وقت تک نہیں کریں گے جب تک کہ میں ان کے لیے اس کے علاوہ کوئی نئی چیز نہ نکالوں ، لہٰذا جو نئی چیز نکالی جائے تم اس سے بچو ۱؎ اس لیے کہ ہر وہ نئی چیز جو نکالی جائے گمراہی ہے ، اور میں تمہیں حکیم و دانا کی گمراہی سے ڈراتا ہوں ، اس لیے کہ بسا اوقات شیطان ، حکیم و دانا شخص کی زبانی گمراہی کی بات کہتا ہے اور کبھی کبھی منافق بھی حق بات کہتا ہے ۔ میں نے معاذ سے کہا : ( اللہ آپ پر رحم کرے ) مجھے کیسے معلوم ہو گا کہ حکیم و دانا گمراہی کی بات کہتا ہے ، اور منافق حق بات ؟ وہ بولے : کیوں نہیں ، حکیم و عالم کی ان مشہور باتوں سے بچو ، جن کے متعلق یہ کہا جاتا ہو کہ وہ یوں نہیں ہے ، لیکن یہ چیز تمہیں خود اس حکیم سے نہ پھیر دے ، اس لیے کہ امکان ہے کہ وہ ( اپنی پہلی بات سے ) پھر جائے اور حق پر آ جائے ، اور جب تم حق بات سنو تو اسے لے لو ، اس لیے کہ حق میں ایک نور ہوتا ہے ۔ ابوداؤد کہتے ہیں : اس قصے میں معمر نے زہری سے «ولا يثنينك ذلك عنه» کے بجائے «ولا ينئينك ذلك عنه» روایت کی ہے اور صالح بن کیسان نے زہری سے اس میں «المشتهرات» کے بجائے «المشبهات» روایت کی ہے اور «ولا يثنينك» ہی روایت کی ہے جیسا کہ عقیل کی روایت میں ہے ۔ ابن اسحاق نے زہری سے روایت کی ہے : کیوں نہیں ، جب کسی حکیم و عالم کا قول تم پر مشتبہ ہو جائے یہاں تک کہ تم کہنے لگو کہ اس بات سے اس کا کیا مقصد ہے ؟ ( تو سمجھ لو کہ یہ حکیم و عالم کی زبانی گمراہی کی بات ہے ) ۲؎ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 946140,
        "last_updated": null
    },
    {
        "urduURN": 4146190,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 7,
        "babName": "سنت پر عمل کرنے کی دعوت دینے والوں کے اجر+و+ثواب کا بیان ۔",
        "hadithNumber": 4612,
        "hadithSanad": "سفیان ثوری کہتے ہیں کہ",
        "hadithText": "ایک شخص نے خط لکھ کر عمر بن عبدالعزیز سے تقدیر کے بارے میں سوال کیا تو انہوں نے ( جواب میں ) لکھا : امابعد ! میں تمہیں اللہ سے ڈرنے اور اس کے دین کے سلسلہ میں میانہ روی اختیار کرنے ، اس کے نبی کی سنت کی پیروی کرنے کی اور بدعتیوں نے جو بدعتیں سنت کے جاری اور ضروریات کے لیے کافی ہو جانے کے بعد ایجاد کی ہیں ان کے چھوڑ دینے کی وصیت کرتا ہوں ، لہٰذا تم پر سنت کا دامن تھامے رہنا لازم ہے ، اللہ کے حکم سے یہی چیز تمہارے لیے گمراہی سے بچنے کا ذریعہ ہو گی ۔ پھر یہ بھی جان لو کہ لوگوں نے کوئی بدعت ایسی نہیں نکالی ہے جس کے خلاف پہلے سے کوئی دلیل موجود نہ رہی ہو یا اس کے بدعت ہونے کے سلسلہ میں کوئی نصیحت آمیز بات نہ ہو ، اس لیے کہ سنت کو جس نے جاری کیا ہے ، ( اللہ تعالیٰ یا نبی اکرم صلی اللہ علیہ وسلم ) وہ جانتا تھا کہ اس کی مخالفت میں کیا وبال ہے ، کیا کیا غلطیاں ، لغزشیں ، حماقتیں اور انتہا پسندیاں ہیں ( ابن کثیر کی روایت میں «من قد علم» کا لفظ نہیں ہے ) لہٰذا تم اپنے آپ کو اسی چیز سے خوش رکھو جس سے قوم ( سلف ) نے اپنے آپ کو خوش رکھا ہے ، اس لیے کہ وہ دین کے بڑے واقف کار تھے ، جس بات سے انہوں نے روکا ہے گہری بصیرت سے روکا ہے ، انہیں معاملات کے سمجھنے پر ہم سے زیادہ دسترس تھی ، اور تمام خوبیوں میں وہ ہم سے فائق تھے ، لہٰذا اگر ہدایت وہ ہوتی جس پر تم ہو تو اس کا مطلب یہ ہوا کہ تم ان سے آگے بڑھ گئے ، اور اگر تم یہ کہتے ہو کہ جن لوگوں نے بدعتیں نکالی ہیں وہ اگلے لوگوں کی راہ پر نہیں چلے اور ان سے اعراض کیا تو واقعہ بھی یہی ہے کہ اگلے لوگ ہی فائق و برتر تھے انہوں نے جتنا کچھ بیان کر دیا ہے اور جو کچھ کہہ دیا ہے شافی و کافی ہے ، لہٰذا اب دین میں نہ اس سے کم کی گنجائش ہے نہ زیادہ کی ، اور حال یہ ہے کہ کچھ لوگوں نے اس میں کمی کر ڈالی تو وہ جفا کار ٹھہرے اور کچھ لوگوں نے زیادتی کی تو وہ غلو کا شکار ہو گئے ، اور اگلے لوگ ان دونوں انتہاؤں کے بیچ سیدھی راہ پر رہے ، اور تم نے ایمان بالقدر کے اقرار کے بارے میں بھی پوچھا ہے تو باذن اللہ تم نے یہ سوال ایک ایسے شخص سے کیا ہے جو اس کو خوب جانتا ہے ، ان لوگوں نے جتنی بھی بدعتیں ایجاد کی ہیں ان میں اثر کے اعتبار سے ایمان بالقدر کے اقرار سے زیادہ واضح اور ٹھوس کوئی نہیں ہے ، اس کا تذکرہ تو جاہلیت میں جہلاء نے بھی کیا ہے ، وہ اپنی گفتگو اور اپنے شعر میں اس کا تذکرہ کرتے تھے ، اس کے ذریعے وہ اپنے آپ کو کسی فوت ہو جانے والے کے غم میں تسلی دیتے ہیں ۔ پھر اسلام نے اس خیال کو مزید پختگی بخشی ، رسول اللہ صلی اللہ علیہ وسلم نے اس کا ذکر ایک یا دو حدیثوں میں نہیں بلکہ کئی حدیثوں میں کیا ، اور اس کو مسلمانوں نے آپ صلی اللہ علیہ وسلم سے سنا ، پھر آپ کی زندگی میں بھی اسے بیان کیا اور آپ صلی اللہ علیہ وسلم کی وفات کے بعد بھی ، اس پر یقین کر کے ، اس کو تسلیم کر کے اور اپنے کو اس سے کمزور سمجھ کے ، کوئی چیز ایسی نہیں جس کو اللہ کا علم محیط نہ ہو ، اور جو اس کے نوشتہ میں نہ آ چکی ہو ، اور اس میں اس کی تقدیر جاری نہ ہو چکی ہو ، اس کے باوجود اس کا ذکر اس کی کتاب محکم میں ہے ، اسی سے لوگوں نے اسے حاصل کیا ، اسی سے اسے سیکھا ۔ اور اگر تم یہ کہو : اللہ نے ایسی آیت کیوں نازل فرمائی ؟ اور ایسا کیوں کہا ( جو آیات تقدیر کے خلاف ہیں ) ؟ تو ( جان لو ) ان لوگوں نے بھی اس میں سے وہ سب پڑھا تھا جو تم نے پڑھا ہے لیکن انہیں اس کی تاویل و تفسیر کا علم تھا جس سے تم ناواقف ہو ، اس کے بعد بھی وہ اسی بات کے قائل تھے : ہر بات اللہ کی تقدیر اور اس کے لکھے ہوئے کے مطابق ہے جو مقدر میں لکھا ہے وہ ہو گا ، جو اللہ نے چاہا ، وہی ہوا ، جو نہیں چاہا ، نہیں ہوا ۔ اور ہم تو اپنے لیے نہ کسی ضرر کے مالک ہیں اور نہ ہی کسی نفع کے پھر اس اعتقاد کے بعد بھی اگلے لوگ اچھے کام کرتے رہے اور بر ے کاموں سے ڈرتے رہے ۱؎ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 946150,
        "last_updated": null
    },
    {
        "urduURN": 4146200,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 7,
        "babName": "سنت پر عمل کرنے کی دعوت دینے والوں کے اجر+و+ثواب کا بیان ۔",
        "hadithNumber": 4613,
        "hadithSanad": "نافع کہتے ہیں کہ",
        "hadithText": "ابن عمر رضی اللہ عنہما کا ایک شامی دوست تھا جو ان سے خط و کتابت رکھتا تھا ، تو عبداللہ بن عمر نے اسے لکھا کہ مجھے معلوم ہوا ہے کہ تم نے تقدیر کے سلسلے میں ( سلف کے قول کے خلاف ) کوئی بات کہی ہے ، لہٰذا اب تم مجھ سے خط و کتابت نہ رکھنا ، اس لیے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے : ” میری امت میں کچھ ایسے لوگ ہوں گے جو تقدیر کو جھٹلائیں گے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 946160,
        "last_updated": null
    },
    {
        "urduURN": 4146210,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 7,
        "babName": "سنت پر عمل کرنے کی دعوت دینے والوں کے اجر+و+ثواب کا بیان ۔",
        "hadithNumber": 4614,
        "hadithSanad": "خالد الحذاء کہتے ہیں کہ",
        "hadithText": "میں نے حسن ( حسن بصری ) سے کہا : اے ابوسعید ! آدم کے سلسلہ میں مجھے بتائیے کہ وہ آسمان کے لیے پیدا کئے گئے ، یا زمین کے لیے ؟ آپ نے کہا : نہیں ، بلکہ زمین کے لیے ، میں نے عرض کیا : آپ کا کیا خیال ہے ؟ اگر وہ نافرمانی سے بچ جاتے اور درخت کا پھل نہ کھاتے ، انہوں نے کہا : یہ ان کے بس میں نہ تھا ، میں نے کہا : مجھے اللہ کے فرمان «ما أنتم عليه بفاتنين * إلا من هو صال الجحيم» ” شیاطین تم میں سے کسی کو اس کے راستے سے گمراہ نہیں کر سکتے سوائے اس کے جو جہنم میں جانے والا ہو “ ( الصافات : ۱۶۳ ) کے بارے میں بتائیے ، انہوں نے کہا : ” شیاطین اپنی گمراہی کا شکار صرف اسی کو بنا سکتے ہیں جس پر اللہ نے جہنم واجب کر دی ہے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 946170,
        "last_updated": null
    },
    {
        "urduURN": 4146220,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 7,
        "babName": "سنت پر عمل کرنے کی دعوت دینے والوں کے اجر+و+ثواب کا بیان ۔",
        "hadithNumber": 4615,
        "hadithSanad": "",
        "hadithText": "حسن بصری سے اللہ تعالیٰ کے قول «ولذلك خلقهم» ” اور اسی کے لیے انہیں پیدا کیا “ ( سورۃ ھود : ۱۱۹ ) کے بارے میں روایت ہے ، انہوں نے کہا : انہیں پیدا کیا اس ( جنت ) کے لیے اور انہیں پیدا کیا اس ( جہنم ) کے لیے ۱؎ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 946180,
        "last_updated": null
    },
    {
        "urduURN": 4146230,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 7,
        "babName": "سنت پر عمل کرنے کی دعوت دینے والوں کے اجر+و+ثواب کا بیان ۔",
        "hadithNumber": 4616,
        "hadithSanad": "خالد الخداء کہتے ہیں کہ",
        "hadithText": "میں نے حسن بصری سے کہا «ما أنتم عليه بفاتنين * إلا من هو صال الجحيم» تو انہوں نے کہا : «إلا من هو صال الجحيم» کا مطلب ہے : سوائے اس کے جس کے لیے اللہ نے واجب کر دیا ہے کہ وہ جہنم میں جائے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 946190,
        "last_updated": null
    },
    {
        "urduURN": 4146240,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 7,
        "babName": "سنت پر عمل کرنے کی دعوت دینے والوں کے اجر+و+ثواب کا بیان ۔",
        "hadithNumber": 4617,
        "hadithSanad": "حمید کہتے ہیں کہ",
        "hadithText": "حسن بصری کہتے تھے : آسمان سے زمین پر گر پڑنا اس بات سے مجھے زیادہ عزیز ہے کہ میں کہوں : معاملہ تو میرے ہاتھ میں ہے ۱؎ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 946200,
        "last_updated": null
    },
    {
        "urduURN": 4146250,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 7,
        "babName": "سنت پر عمل کرنے کی دعوت دینے والوں کے اجر+و+ثواب کا بیان ۔",
        "hadithNumber": 4618,
        "hadithSanad": "حمید کہتے ہیں کہ",
        "hadithText": "حسن ہمارے پاس مکہ تشریف لائے تو اہل مکہ کے فقہاء نے مجھ سے کہا کہ میں ان سے درخواست کروں کہ وہ ان کے لیے ایک دن نشست رکھیں ، اور وعظ فرمائیں ، وہ اس کے لیے راضی ہو گئے تو لوگ اکٹھا ہوئے اور آپ نے انہیں خطاب کیا ، میں نے ان سے بڑا خطیب کسی کو نہیں دیکھا ، ایک شخص نے سوال کیا : اے ابوسعید ! شیطان کو کس نے پیدا کیا ؟ انہوں نے کہا : سبحان اللہ ! کیا اللہ کے سوا کوئی اور خالق ہے ؟ اللہ نے شیطان کو پیدا کیا اور اسی نے خیر پیدا کیا ، اور شر پیدا کیا ، وہ شخص بولا : اللہ انہیں غارت کرے ، کس طرح یہ لوگ اس بزرگ پر جھوٹ باندھتے ہیں ۱؎ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 946210,
        "last_updated": null
    },
    {
        "urduURN": 4146260,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 7,
        "babName": "سنت پر عمل کرنے کی دعوت دینے والوں کے اجر+و+ثواب کا بیان ۔",
        "hadithNumber": 4619,
        "hadithSanad": "sanad",
        "hadithText": "حسن بصری آیت کریمہ : «كذلك نسلكه في قلوب المجرمين» ” اسی طرح سے ہم اسے مجرموں کے دل میں ڈالتے ہیں “ ( سورۃ الحجر : ۱۱۲ ) کے سلسلہ میں کہتے ہیں : اس سے مراد شرک ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 946220,
        "last_updated": null
    },
    {
        "urduURN": 4146270,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 7,
        "babName": "سنت پر عمل کرنے کی دعوت دینے والوں کے اجر+و+ثواب کا بیان ۔",
        "hadithNumber": 4620,
        "hadithSanad": "sanad",
        "hadithText": "حسن بصری آیت کریمہ : «وحيل بينهم وبين ما يشتهون» ” ان کے اور ان کی خواہشات کے درمیان حائل ہو گئی “ ( سورۃ سبا : ۵۴ ) کی تفسیر میں کہتے ہیں : اس کا مطلب ہے ان کے اور ان کے ایمان کے درمیان حائل ہو گئی ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 946230,
        "last_updated": null
    },
    {
        "urduURN": 4146280,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 7,
        "babName": "سنت پر عمل کرنے کی دعوت دینے والوں کے اجر+و+ثواب کا بیان ۔",
        "hadithNumber": 4621,
        "hadithSanad": "ابن عون کہتے ہیں کہ",
        "hadithText": "میں ملک شام میں چل رہا تھا تو ایک شخص نے پیچھے سے مجھے پکارا جب میں مڑا تو دیکھا رجاء بن حیوہ ہیں ، انہوں نے کہا : اے ابوعون ! یہ کیا ہے جو لوگ حسن کے بارے میں ذکر کرتے ہیں ؟ میں نے کہا : لوگ حسن پر بہت زیادہ جھوٹ باندھتے ہیں ۱؎ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 946240,
        "last_updated": null
    },
    {
        "urduURN": 4146290,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 7,
        "babName": "سنت پر عمل کرنے کی دعوت دینے والوں کے اجر+و+ثواب کا بیان ۔",
        "hadithNumber": 4622,
        "hadithSanad": "ایوب کہتے ہیں",
        "hadithText": "حسن پر جھوٹ دو قسم کے لوگ باندھتے ہیں : ایک تو قدریہ ، جو چاہتے ہیں کہ اس طرح سے ان کے خیال و نظریہ کا لوگ اعتبار کریں گے ، اور دوسرے وہ لوگ جن کے دلوں میں ان کے خلاف عداوت اور بغض ہے ، وہ کہتے ہیں : کیا یہ ان کا قول نہیں ؟ کیا یہ ان کا قول نہیں ؟ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 946250,
        "last_updated": null
    },
    {
        "urduURN": 4146300,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 7,
        "babName": "سنت پر عمل کرنے کی دعوت دینے والوں کے اجر+و+ثواب کا بیان ۔",
        "hadithNumber": 4623,
        "hadithSanad": "یحییٰ بن کثیر بن عنبری کہتے ہیں کہ",
        "hadithText": "قرہ بن خالد ہم سے کہا کرتے تھے : اے نوجوانو ! حسن کو قدریہ مت سمجھو ، ان کی رائے سنت اور صواب تھی ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 946260,
        "last_updated": null
    },
    {
        "urduURN": 4146310,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 7,
        "babName": "سنت پر عمل کرنے کی دعوت دینے والوں کے اجر+و+ثواب کا بیان ۔",
        "hadithNumber": 4624,
        "hadithSanad": "ابن عون کہتے ہیں کہ",
        "hadithText": "اگر ہمیں یہ معلوم ہوتا کہ حسن کی بات ( غلط معنی کے ساتھ شہرت کے ) اس مقام کو پہنچ جائے گی جہاں وہ پہنچ گئی تو ہم لوگ ان کے اس قول کے بارے میں ان کے رجوع کی بابت ایک کتاب لکھتے اور اس پر لوگوں کو گواہ بناتے ، لیکن ہم نے سوچا کہ ایک بات ہے جو نکل گئی ہے اور اس کے خلاف معنی پر محمول نہیں کی جائے گی ۱؎ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 946270,
        "last_updated": null
    },
    {
        "urduURN": 4146320,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 7,
        "babName": "سنت پر عمل کرنے کی دعوت دینے والوں کے اجر+و+ثواب کا بیان ۔",
        "hadithNumber": 4625,
        "hadithSanad": "ایوب کہتے ہیں کہ",
        "hadithText": "مجھ سے حسن بصری نے کہا : میں اب دوبارہ کبھی اس میں سے کوئی بات نہیں کہوں گا ، ( جس سے تقدیر کی نفی کا گمان ہوتا ) ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 946280,
        "last_updated": null
    },
    {
        "urduURN": 4146330,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 7,
        "babName": "سنت پر عمل کرنے کی دعوت دینے والوں کے اجر+و+ثواب کا بیان ۔",
        "hadithNumber": 4626,
        "hadithSanad": "عثمان کہتے ہیں کہ",
        "hadithText": "حسن نے جب بھی کسی آیت کی تفسیر کی تو تقدیر کا اثبات کیا ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 946290,
        "last_updated": null
    },
    {
        "urduURN": 4146340,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 8,
        "babName": "صحابہ+کرام رضی+اللہ+عنہم میں سب افضل کون ہے پھر اس کے بعد کون ہے ؟",
        "hadithNumber": 4627,
        "hadithSanad": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "ہم نبی اکرم صلی اللہ علیہ وسلم کے زمانے میں کہا کرتے تھے : ہم ابوبکر رضی اللہ عنہ کے برابر کسی کو نہیں جانتے ، پھر عمر رضی اللہ عنہ کے ، پھر عثمان رضی اللہ عنہ کے ، پھر نبی اکرم صلی اللہ علیہ وسلم کے صحابہ کو چھوڑ دیتے ، ان میں کسی کو کسی پر فضیلت نہیں دیتے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 946300,
        "last_updated": null
    },
    {
        "urduURN": 4146350,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 8,
        "babName": "صحابہ+کرام رضی+اللہ+عنہم میں سب افضل کون ہے پھر اس کے بعد کون ہے ؟",
        "hadithNumber": 4628,
        "hadithSanad": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کی زندگی میں ہم لوگ کہا کرتے تھے کہ نبی اکرم صلی اللہ علیہ وسلم کی امت میں آپ صلی اللہ علیہ وسلم کے بعد سب سے افضل ابوبکر ہیں ، پھر عمر ، پھر عثمان ہیں ، رضی اللہ عنہم اجمعین ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 946310,
        "last_updated": null
    },
    {
        "urduURN": 4146360,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 8,
        "babName": "صحابہ+کرام رضی+اللہ+عنہم میں سب افضل کون ہے پھر اس کے بعد کون ہے ؟",
        "hadithNumber": 4629,
        "hadithSanad": "محمد بن حنفیہ کہتے ہیں کہ",
        "hadithText": "میں نے اپنے والد علی بن ابی طالب رضی اللہ عنہ سے پوچھا : رسول اللہ صلی اللہ علیہ وسلم کے بعد لوگوں میں سب سے بہتر کون تھا ؟ انہوں نے کہا : ابوبکر رضی اللہ عنہ ، میں نے کہا : پھر کون ؟ پھر عمر رضی اللہ عنہ ، پھر مجھے اس بات سے ڈر ہوا کہ میں کہوں پھر کون ؟ اور وہ کہیں عثمان رضی اللہ عنہ ، چنانچہ میں نے کہا : پھر آپ ؟ اے ابا جان ! وہ بولے : میں تو مسلمانوں میں کا صرف ایک فرد ہوں ۱؎ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 946320,
        "last_updated": null
    },
    {
        "urduURN": 4146370,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 8,
        "babName": "صحابہ+کرام رضی+اللہ+عنہم میں سب افضل کون ہے پھر اس کے بعد کون ہے ؟",
        "hadithNumber": 4630,
        "hadithSanad": "سفیان کہتے تھے : جو یہ کہے کہ",
        "hadithText": "علی رضی اللہ عنہ ان دونوں ( ابوبکر رضی اللہ عنہ اور عمر رضی اللہ عنہ ) سے خلافت کے زیادہ حقدار تھے تو اس نے ابوبکر ، عمر ، مہاجرین اور انصار کو خطاکار ٹھہرایا ، اور میں نہیں سمجھتا کہ اس کے اس عقیدے کے ہوتے ہوئے اس کا کوئی عمل آسمان کو اٹھ کر جائے گا ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 946330,
        "last_updated": null
    },
    {
        "urduURN": 4146380,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 8,
        "babName": "صحابہ+کرام رضی+اللہ+عنہم میں سب افضل کون ہے پھر اس کے بعد کون ہے ؟",
        "hadithNumber": 4631,
        "hadithSanad": "سفیان ثوری کہا کرتے تھے",
        "hadithText": "خلفاء پانچ ہیں : ابوبکر رضی اللہ عنہ ، عمر رضی اللہ عنہ ، عثمان رضی اللہ عنہ ، علی رضی اللہ عنہ اور عمر بن عبدالعزیز رحمہ اللہ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 946340,
        "last_updated": null
    },
    {
        "urduURN": 4146390,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4632,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "ابوہریرہ رضی اللہ عنہ بیان کرتے تھے کہ ایک شخص رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور کہنے لگا : میں نے رات کو بادل کا ایک ٹکڑا دیکھا ، جس سے گھی اور شہد ٹپک رہا تھا ، پھر میں نے لوگوں کو دیکھا وہ اپنے ہاتھوں کو پھیلائے اسے لے رہے ہیں ، کسی نے زیادہ لیا کسی نے کم ، اور میں نے دیکھا کہ ایک رسی آسمان سے زمین تک لٹکی ہوئی ہے ، پھر میں نے آپ کو دیکھا اللہ کے رسول ! کہ آپ نے اسے پکڑ ا اور اس سے اوپر چلے گئے ، پھر ایک اور شخص نے اسے پکڑا اور وہ بھی اوپر چلا گیا ، پھر ایک اور شخص نے اسے پکڑا اور وہ بھی اوپر چلا گیا ، پھر اسے ایک اور شخص نے پکڑا تو وہ ٹوٹ گئی پھر اسے جوڑا گیا ، تو وہ بھی اوپر چلا گیا ۔ ابوبکر رضی اللہ عنہ نے کہا : میرے ماں باپ آپ پر قربان جائیں مجھے اس کی تعبیر بیان کرنے دیجئیے آپ صلی اللہ علیہ وسلم نے فرمایا : ” اس کی تعبیر بیان کرو “ وہ بولے : بادل کے ٹکڑے سے مراد اسلام ہے ، اور ٹپکنے والے گھی اور شہد سے قرآن کی حلاوت ( شیرینی ) اور نرمی مراد ہے ، کم اور زیادہ لینے والوں سے مراد قرآن کو کم یا زیادہ حاصل کرنے والے لوگ ہیں ، آسمان سے زمین تک پہنچی ہوئی رسی سے مراد حق ہے جس پر آپ ہیں ، آپ اسے پکڑے ہوئے ہیں ، اللہ آپ کو اٹھا لے گا ، پھر آپ صلی اللہ علیہ وسلم کے بعد ایک اور شخص اسے پکڑے گا تو وہ بھی اٹھ جائے گا ، پھر ایک اور شخص پکڑے گا تو وہ بھی اٹھ جائے گا ، پھر اسے ایک اور شخص پکڑے گا ، تو وہ ٹوٹ جائے گی تو اسے جوڑا جائے گا ، پھر وہ بھی اٹھ جائے گا ، اللہ کے رسول ! آپ مجھے بتائیے کہ میں نے صحیح کہا یا غلط ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” کچھ صحیح کہا اور کچھ غلط “ کہا : اللہ کے رسول ! میں آپ کو قسم دلاتا ہوں کہ آپ مجھے بتائیے کہ میں نے کیا غلطی کی ، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” قسم نہ دلاؤ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 946350,
        "last_updated": null
    },
    {
        "urduURN": 4146400,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4633,
        "hadithSanad": "اس سند سے بھی ابن عباس رضی اللہ عنہما سے یہی قصہ مرفوعاً مروی ہے",
        "hadithText": "لیکن اس میں یہ ہے کہ آپ نے ان کو بتانے سے انکار کر دیا ، ( کہ انہوں نے کیا غلطی کی ہے ) ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 946360,
        "last_updated": null
    },
    {
        "urduURN": 4146410,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4634,
        "hadithSanad": "ابوبکرہ رضی اللہ عنہ سے روایت ہے کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے ایک دن فرمایا : ” تم میں سے کسی نے خواب دیکھا ہے ؟ “ ایک شخص بولا : میں نے دیکھا : گویا ایک ترازو آسمان سے اترا ، آپ صلی اللہ علیہ وسلم کو اور ابوبکر کو تولا گیا ، تو آپ ابوبکر سے بھاری نکلے ، پھر عمر اور ابوبکر کو تولا گیا تو ابوبکر بھاری نکلے ، پھر عمر اور عثمان کو تولا گیا تو عمر بھاری نکلے ، پھر ترازو اٹھا لیا گیا ، تو ہم نے رسول اللہ صلی اللہ علیہ وسلم کے چہرے میں ناپسندیدگی دیکھی ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 946370,
        "last_updated": null
    },
    {
        "urduURN": 4146420,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4635,
        "hadithSanad": "ابوبکرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے ایک دن فرمایا : ” تم میں سے کس نے خواب دیکھا ہے ؟ “ پھر راوی نے اسی مفہوم کی حدیث بیان کی اور چہرے پر ناگواری دیکھنے کا ذکر نہیں کیا بلکہ یوں کہا : رسول اللہ صلی اللہ علیہ وسلم کو وہ ( خواب ) برا لگا ، اور فرمایا : ” وہ نبوت کی خلافت ہے ، پھر اس کے بعد اللہ جسے چاہے گا سلطنت عطا کرے گا “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 946380,
        "last_updated": null
    },
    {
        "urduURN": 4146430,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4636,
        "hadithSanad": "جابر بن عبداللہ رضی اللہ عنہما بیان کرتے تھے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” آج کی رات ایک صالح شخص کو خواب میں دکھایا گیا کہ ابوبکر کو رسول اللہ صلی اللہ علیہ وسلم سے جوڑ دیا گیا ہے ، اور عمر کو ابوبکر سے اور عثمان کو عمر سے “ ۔ جابر کہتے ہیں : جب ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس سے اٹھ کر آئے تو ہم نے کہا : مرد صالح سے مراد تو رسول اللہ صلی اللہ علیہ وسلم ہیں ، اور بعض کا بعض سے جوڑے جانے کا مطلب یہ ہے کہ یہی لوگ اس امر ( دین ) کے والی ہوں گے جس کے ساتھ اللہ نے اپنے نبی اکرم صلی اللہ علیہ وسلم کو مبعوث فرمایا ہے ۔ ابوداؤد کہتے ہیں : اسے یونس اور شعیب نے بھی روایت کیا ہے ، لیکن ان دونوں نے عمرو بن ابان کا ذکر نہیں کیا ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 946390,
        "last_updated": null
    },
    {
        "urduURN": 4146440,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4637,
        "hadithSanad": "سمرہ بن جندب رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "ایک شخص نے کہا : اللہ کے رسول ! میں نے دیکھا گویا کہ آسمان سے ایک ڈول لٹکایا گیا پہلے ابوبکر آئے تو اس کی دونوں لکڑیاں پکڑ کر اس میں سے تھوڑا سا پیا ، پھر عمر آئے تو اس کی دونوں لکڑیاں پکڑیں اور انہوں نے خوب سیر ہو کر پیا ، پھر عثمان آئے اور اس کی دونوں لکڑیاں پکڑیں اور خوب سیر ہو کر پیا ، پھر علی آئے اور اس کی دونوں لکڑیاں پکڑیں ، تو وہ چھلک گیا اور اس میں سے کچھ ان کے اوپر بھی پڑ گیا ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 946400,
        "last_updated": null
    },
    {
        "urduURN": 4146450,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4638,
        "hadithSanad": "مکحول نے کہا",
        "hadithText": "رومی شام میں چالیس دن تک لوٹ کھسوٹ کرتے رہیں گے اور سوائے دمشق اور عمان کے کوئی شہر بھی ان سے نہ بچے گا ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 946410,
        "last_updated": null
    },
    {
        "urduURN": 4146460,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4639,
        "hadithSanad": "عبدالعزیز بن علاء کہتے ہیں کہ انہوں نے ابو الأ عیس عبدالرحمٰن بن سلمان کو کہتے سنا کہ",
        "hadithText": "عجم کے بادشاہوں میں سے ایک بادشاہ تمام شہروں پر غالب آ جائے گا سوائے دمشق کے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 946420,
        "last_updated": null
    },
    {
        "urduURN": 4146470,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4640,
        "hadithSanad": "مکحول کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” مسلمانوں کا خیمہ لڑائیوں کے وقت ایک ایسی سر زمین میں ہو گا جسے غوطہٰ ۱؎ کہا جاتا ہے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 946430,
        "last_updated": null
    },
    {
        "urduURN": 4146480,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4641,
        "hadithSanad": "عوف الا عرابی کہتے ہیں کہ",
        "hadithText": "میں نے حجاج کو خطبہ میں یہ کہتے سنا : عثمان کی مثال اللہ کے نزدیک عیسیٰ بن مریم کی طرح ہے ، پھر انہوں نے آیت کریمہ «إذ قال الله يا عيسى إني متوفيك ورافعك إلى ومطهرك من الذين كفروا» ” جب اللہ نے کہا کہ : اے عیسیٰ ! میں تجھے پورا لینے والا ہوں ، اور تجھے اپنی جانب اٹھانے والا ہوں ، اور تجھے کافروں سے پاک کرنے والا ہوں “ ( سورۃ آل عمران : ۵۵ ) پڑھی اور اپنے ہاتھ سے ہماری اور اہل شام کی طرف اشارہ کر رہے تھے ۱؎ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 946440,
        "last_updated": null
    },
    {
        "urduURN": 4146490,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4642,
        "hadithSanad": "ربیع بن خالد ضبی کہتے ہیں کہ",
        "hadithText": "میں نے حجاج کو خطبہ دیتے سنا ، اس نے اپنے خطبے میں کہا : تم میں سے کسی کا پیغام بر جو اس کی ضرورت سے ( پیغام لے جا رہا ) ہو زیادہ درجے والا ہے ، یا وہ جو اس کے گھربار میں اس کا قائم مقام اور خلیفہ ہو ؟ تو میں نے اپنے دل میں کہا : اللہ کا میرے اوپر حق ہے کہ میں تیرے پیچھے کبھی نماز نہ پڑھوں ، اور اگر مجھے ایسے لوگ ملے جو تجھ سے جہاد کریں تو میں ضرور ان کے ساتھ تجھ سے جہاد کروں گا ۔ اسحاق نے اپنی روایت میں اتنا اضافہ کیا ہے : چنانچہ انہوں نے جماجم میں جنگ کی یہاں تک کہ مارے گئے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 946450,
        "last_updated": null
    },
    {
        "urduURN": 4146500,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4643,
        "hadithSanad": "عاصم کہتے ہیں کہ",
        "hadithText": "میں نے حجاج کو منبر پر کہتے سنا : جہاں تک تم سے ہو سکے اللہ سے ڈرو ، اس میں کوئی شرط یا استثناء نہیں ہے ، امیر المؤمنین عبدالملک کی بات سنو اور مانو ، اس میں بھی کوئی شرط اور استثناء نہیں ہے ، اللہ کی قسم ، اگر میں نے لوگوں کو مسجد کے ایک دروازے سے نکلنے کا حکم دیا پھر وہ لوگ کسی دوسرے دروازے سے نکلے تو ان کے خون اور ان کے مال میرے لیے حلال ہو جائیں گے ، اللہ کی قسم ! اگر مضر کے قصور پر میں ربیعہ کو پکڑ لوں ، تو یہ میرے لیے اللہ کی جانب سے حلال ہے ، اور کون مجھے عبدہذیل ( عبداللہ بن مسعود ہذلی ) کے سلسلہ میں معذور سمجھے گا جو کہتے ہیں کہ ان کی قرآت اللہ کی طرف سے ہے قسم اللہ کی ، وہ سوائے اعرابیوں کے رجز کے کچھ نہیں ، اللہ نے اس قرآت کو اپنے نبی علیہ السلام پر نہیں نازل فرمایا ، اور کون ان عجمیوں کے سلسلہ میں مجھے معذور سمجھے گا جن میں سے کوئی کہتا ہے کہ وہ پتھر پھینک رہا ہے ، پھر کہتا ہے ، دیکھو پتھر کہاں گرتا ہے ؟ ( فساد کی بات کہہ کر دیکھتا ہے کہ دیکھوں اس کا کہاں اثر ہوتا ہے ) اور کچھ نئی بات پیش آئی ہے ، اللہ کی قسم ، میں انہیں اسی طرح نیست و نابود کر دوں گا ، جیسے گزشتہ کل ختم ہو گیا ( جو اب کبھی نہیں آنے والا ) ۔ عاصم کہتے ہیں : میں نے اس کا تذکرہ اعمش سے کیا تو وہ بولے : اللہ کی قسم میں نے بھی اسے ، اس سے سنا ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 946460,
        "last_updated": null
    },
    {
        "urduURN": 4146510,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4644,
        "hadithSanad": "اعمش کہتے ہیں کہ",
        "hadithText": "میں نے حجاج کو منبر پر کہتے سنا : یہ گورے ( عجمی ) قیمہ بنائے جانے کے قابل ہیں قیمہ ، موالی ( غلامو ) سنو ، اللہ کی قسم ، اگر میں لکڑی پر لکڑی ماروں تو انہیں اسی طرح برباد کر کے رکھ دوں جس طرح گزرا ہوا کل ختم ہو گیا ، یعنی عجمیوں کو ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 946470,
        "last_updated": null
    },
    {
        "urduURN": 4146520,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4645,
        "hadithSanad": "سلیمان الاعمش کہتے ہیں",
        "hadithText": "میں نے حجاج کے ساتھ جمعہ کی نماز پڑھی ، اس نے خطبہ دیا ، پھر راوی ابوبکر بن عیاش والی روایت ( ۴۶۴۳ ) ذکر کی ، اس میں ہے کہ اس نے کہا : سنو اور اللہ کے خلیفہ اور اس کے منتخب عبدالملک بن مروان کی اطاعت کرو ، اس کے بعد آگے کی حدیث بیان کی اور کہا : اگر میں مضر کے جرم میں ربیعہ کو پکڑوں ( تو یہ غلط نہ ہو گا ) اور عجمیوں والی بات کا ذکر نہیں کیا ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 946480,
        "last_updated": null
    },
    {
        "urduURN": 4146530,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4646,
        "hadithSanad": "سفینہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” خلافت علی منہاج النبوۃ ( نبوت کی خلافت ) تیس سال رہے گی ۱؎ ، پھر اللہ تعالیٰ سلطنت یا اپنی سلطنت جسے چاہے گا دے گا “ سعید کہتے ہیں : سفینہ نے مجھ سے کہا : اب تم شمار کر لو : ابوبکر رضی اللہ عنہ دو سال ، عمر رضی اللہ عنہ دس سال ، عثمان رضی اللہ عنہ بارہ سال ، اور علی رضی اللہ عنہ اتنے سال ۔ سعید کہتے ہیں : میں نے سفینہ رضی اللہ عنہ سے کہا : یہ لوگ ( مروانی ) کہتے ہیں کہ علی رضی اللہ عنہ خلیفہ نہیں تھے ، انہوں نے کہا : بنی زرقاء یعنی بنی مروان کے ۲؎ چوتڑ جھوٹ بولتے ہیں ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 946490,
        "last_updated": null
    },
    {
        "urduURN": 4146540,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4647,
        "hadithSanad": "سفینہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” خلافت علی منہاج النبوۃ ( نبوت کی خلافت ) تیس سال ہے ، پھر اللہ تعالیٰ سلطنت جسے چاہے گا یا اپنی سلطنت جسے چاہے گا ، دے گا “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 946500,
        "last_updated": null
    },
    {
        "urduURN": 4146550,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4648,
        "hadithSanad": "عبداللہ بن ظالم مازنی کہتے ہیں کہ",
        "hadithText": "میں نے سعید بن زید بن عمرو بن نفیل رضی اللہ عنہ کو کہتے سنا : جب فلاں شخص کوفہ میں آیا تو فلاں شخص خطبہ کے لیے کھڑا ہوا ۱؎ ، سعید بن زید نے میرا ہاتھ پکڑ کر کہا : ۲؎ کیا تم اس ظالم ۳؎ کو نہیں دیکھتے ۴؎ پھر انہوں نے نو آدمیوں کے بارے میں گواہی دی کہ وہ جنت میں ہیں ، اور کہا : اگر میں دسویں شخص ( کے جنت میں داخل ہونے ) کی گواہی دوں تو گنہگار نہ ہوں گا ، ( ابن ادریس کہتے ہیں : عرب لوگ ( «إیثم» کے بجائے ) «آثم» کہتے ہیں ) ، میں نے پوچھا : اور وہ نو کون ہیں ؟ کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، اس وقت آپ حراء ( پہاڑی ) پر تھے : ” حراء ٹھہر جا ( مت ہل ) اس لیے کہ تیرے اوپر نبی ہے یا صدیق ہے یا پھر شہید “ میں نے عرض کیا : اور نو کون ہیں ؟ انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم ، ابوبکر ، عمر ، عثمان ، علی ، طلحہ ، زبیر ، سعد بن ابی وقاص اور عبدالرحمٰن بن عوف رضی اللہ عنہم ، میں نے عرض کیا : اور دسواں آدمی کون ہے ؟ تو تھوڑا ہچکچائے پھر کہا : میں ۔ ابوداؤد کہتے ہیں : اسے اشجعی نے سفیان سے ، سفیان نے منصور سے ، منصور نے ہلال بن یساف سے ، ہلال نے ابن حیان سے اور ابن حیان نے عبداللہ بن ظالم سے اسی سند سے روایت کیا ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 946510,
        "last_updated": null
    },
    {
        "urduURN": 4146560,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4649,
        "hadithSanad": "عبدالرحمٰن بن اخنس سے روایت ہے کہ",
        "hadithText": "وہ مسجد میں تھے ، ایک شخص نے علی رضی اللہ عنہ کا ( برائی کے ساتھ ) تذکرہ کیا ، تو سعید بن زید رضی اللہ عنہ کھڑے ہو گئے اور فرمایا : میں گواہی دیتا ہوں رسول اللہ صلی اللہ علیہ وسلم پر کہ میں نے آپ کو فرماتے سنا : ” دس لوگ جنتی ہیں : ابوبکر جنتی ہیں ، عمر جنتی ہیں ، عثمان جنتی ہیں ، علی جنتی ہیں ، طلحہ جنتی ہیں ، زبیر بن عوام جنتی ہیں ، سعد بن مالک جنتی ہیں اور عبدالرحمٰن بن عوف جنتی ہیں “ اور اگر میں چاہتا تو دسویں کا نام لیتا ، وہ کہتے ہیں : لوگوں نے عرض کیا : وہ کون ہیں ؟ تو وہ خاموش رہے ، لوگوں نے پھر پوچھا : وہ کون ہیں ؟ تو کہا : وہ سعید بن زید ہیں ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 946520,
        "last_updated": null
    },
    {
        "urduURN": 4146570,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4650,
        "hadithSanad": "ریاح بن حارث کہتے ہیں",
        "hadithText": "میں کوفہ کی مسجد میں فلاں شخص ۱؎ کے پاس بیٹھا تھا ، ان کے پاس کوفہ کے لوگ جمع تھے ، اتنے میں سعید بن زید بن عمرو بن نفیل رضی اللہ عنہ آئے ، تو انہوں نے انہیں خوش آمدید کہا ، اور دعا دی ، اور اپنے پاؤں کے پاس انہیں تخت پر بٹھایا ، پھر اہل کوفہ میں سے قیس بن علقمہ نامی ایک شخص آیا ، تو انہوں نے اس کا استقبال کیا ، لیکن اس نے برا بھلا کہا اور سب وشتم کیا ، سعید بولے : یہ شخص کسے برا بھلا کہہ رہا ہے ؟ انہوں نے کہا : علی رضی اللہ عنہ کو کہہ رہا ہے ، وہ بولے : کیا میں دیکھ نہیں رہا ہوں کہ رسول اللہ صلی اللہ علیہ وسلم کے اصحاب کو تمہارے پاس برا بھلا کہا جا رہا ہے لیکن تم نہ منع کرتے ہو نہ اس سے روکتے ہو ، میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے اور مجھے کیا پڑی ہے کہ میں رسول اللہ صلی اللہ علیہ وسلم کی طرف سے ایسی بات کہوں جو آپ نے نہ فرمائی ہو کہ کل جب میں آپ سے ملوں تو آپ مجھ سے اس کے بارے میں سوال کریں : ” ابوبکر جنتی ہیں ، عمر جنتی ہیں “ پھر اوپر جیسی حدیث بیان فرمایا ، پھر ان ( صحابہ ) میں سے کسی کا رسول اللہ صلی اللہ علیہ وسلم کے ساتھ کسی جنگ میں شرکت جس میں اس چہرہ غبار آلود ہو جائے یہ زیادہ بہتر ہے اس سے کہ تم میں کا کوئی شخص اپنی عمر بھر عمل کرے اگرچہ اس کی عمر نوح کی عمر ہو ۲؎ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 946530,
        "last_updated": null
    },
    {
        "urduURN": 4146580,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4651,
        "hadithSanad": "انس بن مالک رضی اللہ عنہ بیان کرتے ہیں",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم احد پہاڑ پر چڑھے پھر آپ کے پیچھے ابوبکر ، عمر ، عثمان رضی اللہ عنہم بھی چڑھے ، تو وہ ان کے ساتھ ہلنے لگا ، نبی اکرم صلی اللہ علیہ وسلم نے اسے اپنے پاؤں سے مارا اور فرمایا : ” ٹھہر جا اے احد ! ( تیرے اوپر ) ایک نبی ، ایک صدیق اور دو شہید ہیں ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 946540,
        "last_updated": null
    },
    {
        "urduURN": 4146590,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4652,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” میرے پاس جبرائیل آئے ، انہوں نے میرا ہاتھ پکڑا ، اور مجھے جنت کا وہ دروازہ دکھایا جس سے میری امت داخل ہو گی “ ابوبکر رضی اللہ عنہ نے کہا : اللہ کے رسول ! میری خواہش ہے کہ آپ کے ساتھ میں بھی ہوتا تاکہ میں اسے دیکھتا ، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” سنو اے ابوبکر ! میری امت میں سے تم ہی سب سے پہلے جنت میں داخل ہو گے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 946550,
        "last_updated": null
    },
    {
        "urduURN": 4146600,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4653,
        "hadithSanad": "جابر رضی اللہ عنہ سے روایت ہے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” جہنم میں ان لوگوں میں سے کوئی بھی داخل نہیں ہو گا ، جنہوں نے درخت کے نیچے بیعت کی ( یعنی صلح حدیبیہ کے وقت بیعت رضوان میں شریک رہے ) “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 946560,
        "last_updated": null
    },
    {
        "urduURN": 4146610,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4654,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ( موسیٰ کی روایت میں «فلعل الله» کا لفظ ہے ، اور ابن سنان کی روایت میں «اطلع الله» ہے ) ” اللہ تعالیٰ بدر والوں کی طرف متوجہ ہوا اور انہیں نظر رحمت و مغفرت سے دیکھا تو فرمایا : جو عمل چاہو کرو میں نے تمہیں معاف کر دیا ہے ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 946570,
        "last_updated": null
    },
    {
        "urduURN": 4146620,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4655,
        "hadithSanad": "مسور بن مخرمہ رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم حدیبیہ کے زمانے میں نکلے ، پھر راوی نے حدیث بیان کی ، وہ کہتے ہیں کہ آپ کے پاس وہ یعنی عروہ بن مسعود آیا اور نبی اکرم صلی اللہ علیہ وسلم سے گفتگو کرنے لگا ، جب وہ آپ سے بات کرتا ، تو آپ کی ڈاڑھی پر ہاتھ لگاتا ، مغیرہ بن شعبہ رضی اللہ عنہ نبی اکرم صلی اللہ علیہ وسلم کے پاس کھڑے تھے ، ان کے پاس تلوار تھی اور سر پر خود ، انہوں نے تلوار کے پر تلے کے نچلے حصہ سے اس کے ہاتھ پر مارا اور کہا : اپنا ہاتھ ان کی ڈاڑھی سے دور رکھ ، عروہ نے اپنا سر اٹھایا اور بولا : یہ کون ہے ؟ لوگوں نے کہا : مغیرہ بن شعبہ ہیں ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 946580,
        "last_updated": null
    },
    {
        "urduURN": 4146630,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 9,
        "babName": "خلفاء کا بیان ۔",
        "hadithNumber": 4656,
        "hadithSanad": "عمر بن خطاب رضی اللہ عنہ کے مؤذن اقرع کہتے ہیں",
        "hadithText": "مجھے عمر نے ایک پادری کے پاس بلانے کے لیے بھیجا ، میں اسے بلا لایا ، تو عمر نے اس سے کہا : کیا تم کتاب میں مجھے ( میرا حال ) پاتے ہو ؟ وہ بولا : ہاں ، انہوں نے کہا : کیسا پاتے ہو ؟ وہ بولا : میں آپ کو قرن پاتا ہوں ، تو انہوں نے اس پر درہ اٹھایا اور کہا : قرن کیا ہے ؟ وہ بولا : لوہے کی طرح مضبوط اور سخت امانت دار ، انہوں نے کہا : جو میرے بعد آئے گا تم اسے کیسے پاتے ہو ؟ وہ بولا : میں اسے نیک خلیفہ پاتا ہوں ، سوائے اس کے کہ وہ اپنے رشتہ داروں کو ترجیح دے گا ، عمر نے کہا : اللہ عثمان پر رحم کرے ، ( تین مرتبہ ) پھر کہا : ان کے بعد والے کو تم کیسے پاتے ہو ؟ وہ بولا : وہ تو لوہے کا میل ہے ( یعنی برابر تلوار سے کام رہنے کی وجہ سے ان کا بدن اور ہاتھ گویا دونوں ہی زنگ آلود ہو جائیں گے ) عمر نے اپنا ہاتھ اس کے سر پر رکھا ، اور فرمایا : اے گندے ! بدبودار ( تو یہ کیا کہتا ہے ) اس نے کہا : اے امیر المؤمنین ! وہ ایک نیک خلیفہ ہو گا لیکن جب وہ خلیفہ بنایا جائے گا تو حال یہ ہو گا کہ تلوار بے نیام ہو گی ، خون بہہ رہا ہو گا ، ( یعنی اس کی خلافت فتنہ کے وقت ہو گی ) ۔ ابوداؤد کہتے ہیں : «الدفر» کے معنی «نتن» یعنی بدبو کے ہیں ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 946590,
        "last_updated": null
    },
    {
        "urduURN": 4146640,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 10,
        "babName": "صحابہ+کرام رضی+اللہ+عنہم کی فضیلت کا بیان ۔",
        "hadithNumber": 4657,
        "hadithSanad": "عمران بن حصین رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” میری امت کے سب سے بہتر لوگ وہ ہیں جن میں مجھے مبعوث کیا گیا ، پھر وہ جو ان سے قریب ہیں ، پھر وہ جو ان سے قریب ہیں “ اللہ ہی زیادہ جانتا ہے کہ آپ صلی اللہ علیہ وسلم نے تیسرے کا ذکر کیا یا نہیں ، ” پھر کچھ لوگ رونما ہوں گے جو بلا گواہی طلب کئے گواہی دیتے پھریں گے ، نذر مانیں گے لیکن پوری نہ کریں گے ، خیانت کرنے لگیں گے جس سے ان پر سے بھروسہ اٹھ جائے گا ، اور ان میں موٹاپا عام ہو گا ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 946600,
        "last_updated": null
    },
    {
        "urduURN": 4146650,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 11,
        "babName": "صحابہ+کرام رضی+اللہ+عنہم کو برا+بھلا کہنا منع ہے ۔",
        "hadithNumber": 4658,
        "hadithSanad": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” میرے صحابہ کو برا بھلا نہ کہو ، اس ذات کی قسم ! جس کے ہاتھ میں میری جان ہے ، اگر تم میں سے کوئی احد ( پہاڑ ) کے برابر سونا خرچ کر دے تو وہ ان کے ایک مد یا نصف مد کے برابر بھی نہ ہو گا ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 946610,
        "last_updated": null
    },
    {
        "urduURN": 4146660,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 11,
        "babName": "صحابہ+کرام رضی+اللہ+عنہم کو برا+بھلا کہنا منع ہے ۔",
        "hadithNumber": 4659,
        "hadithSanad": "عمرو بن ابی قرہ کہتے ہیں کہ",
        "hadithText": "حذیفہ رضی اللہ عنہ مدائن میں تھے اور وہ ان باتوں کا ذکر کیا کرتے تھے ، جو رسول اللہ صلی اللہ علیہ وسلم نے اپنے اصحاب میں سے بعض لوگوں سے غصہ کی حالت میں فرمائی تھیں ، پھر ان میں سے کچھ لوگ جو حذیفہ سے باتیں سنتے چل کر سلمان رضی اللہ عنہ کے پاس آتے اور ان سے حذیفہ رضی اللہ عنہ کی باتوں کا تذکرہ کرتے تو سلمان رضی اللہ عنہ کہتے : حذیفہ ہی اپنی کہی باتوں کو بہتر جانتے ہیں ، تو وہ لوگ حذیفہ کے پاس لوٹ کر آتے اور ان سے کہتے : ہم نے آپ کی باتوں کا تذکرہ سلمان سے کیا تو انہوں نے نہ آپ کی تصدیق کی اور نہ تکذیب ، یہ سن کر حذیفہ سلمان کے پاس آئے ، وہ اپنی ترکاری کے کھیت میں تھے کہنے لگے : اے سلمان ! ان باتوں میں میری تصدیق کرنے سے آپ کو کون سی چیز روک رہی ہے جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنی ہیں ؟ تو سلمان نے کہا : رسول اللہ صلی اللہ علیہ وسلم بلاشبہ کبھی غصے میں اپنے بعض اصحاب سے کچھ باتیں کہہ دیتے اور کبھی خوش ہوتے تو خوشی میں اپنے بعض اصحاب سے کچھ باتیں کہہ دیتے ، تو کیا آپ اس وقت تک باز نہ آئیں گے جب تک کہ بعض لوگوں کے دلوں میں بعض لوگوں کی محبت اور بعض دوسروں کے دلوں میں بعض کی دشمنی نہ ڈال دیں اور ان کو اختلاف میں مبتلا نہ کر دیں ، حالانکہ آپ جانتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنے ایک خطبہ میں فرمایا : ” میں نے اپنی امت کے کسی فرد کو غصے کی حالت میں اگر برا بھلا کہا یا اسے لعن طعن کی تو میں بھی تو آدم کی اولاد میں سے ہوں ، مجھے بھی غصہ آتا ہے جیسے انہیں آتا ہے ، لیکن اللہ نے مجھے رحمۃ للعالمین بنا کر بھیجا ہے تو ( اے اللہ ) میرے برا بھلا کہنے اور لعن طعن کو ان لوگوں کے لیے قیامت کے روز رحمت بنا دے “ اللہ کی قسم یا تو آپ اپنی اس حرکت سے باز آ جائیں ورنہ میں عمر بن الخطاب ( امیر المؤمنین ) کو لکھ بھیجوں گا ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 946620,
        "last_updated": null
    },
    {
        "urduURN": 4146670,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 12,
        "babName": "ابوبکر رضی+اللہ+عنہ کی خلافت کا بیان ۔",
        "hadithNumber": 4660,
        "hadithSanad": "حارث بن ہشام عبداللہ بن زمعہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "جب رسول اللہ صلی اللہ علیہ وسلم کی بیماری سخت ہوئی اور میں آپ ہی کے پاس مسلمانوں کی ایک جماعت کے ساتھ تھا تو بلال رضی اللہ عنہ نے آپ کو نماز کے لیے بلایا ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” کسی سے کہو جو لوگوں کو نماز پڑھائے “ عبداللہ بن زمعہ نکلے تو دیکھا کہ لوگوں میں عمر رضی اللہ عنہ موجود ہیں ، ابوبکر رضی اللہ عنہ موقع پر موجود نہ تھے ، میں نے کہا : اے عمر ! اٹھیے نماز پڑھائیے ، تو وہ بڑھے اور انہوں نے اللہ اکبر کہا ، وہ بلند آواز شخص تھے ، رسول اللہ صلی اللہ علیہ وسلم نے جب ان کی آواز سنی تو فرمایا : ” ابوبکر کہاں ہیں ؟ اللہ کو یہ پسند نہیں اور مسلمانوں کو بھی ، اللہ کو یہ پسند نہیں اور مسلمانوں کو بھی “ تو ابوبکر رضی اللہ عنہ کو بلا بھیجا ، وہ عمر کے نماز پڑھا چکنے کے بعد آئے تو انہوں نے لوگوں کو ( پھر سے ) نماز پڑھائی ۱؎ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 946630,
        "last_updated": null
    },
    {
        "urduURN": 4146680,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 12,
        "babName": "ابوبکر رضی+اللہ+عنہ کی خلافت کا بیان ۔",
        "hadithNumber": 4661,
        "hadithSanad": "عبیداللہ بن عبداللہ بن عتبہ سے روایت ہے کہ",
        "hadithText": "عبداللہ بن زمعہ رضی اللہ عنہ نے انہیں یہی بات بتائی اور کہا : جب نبی اکرم صلی اللہ علیہ وسلم نے عمر رضی اللہ عنہ کی آواز سنی تو آپ نکلے یہاں تک کہ حجرے سے اپنا سر نکالا ، پھر فرمایا : ” نہیں ، نہیں ، نہیں ، ابن ابی قحافہ ( یعنی ابوبکر ) کو چاہیئے کہ لوگوں کو نماز پڑھائیں “ آپ صلی اللہ علیہ وسلم یہ غصے میں فرما رہے تھے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 946640,
        "last_updated": null
    },
    {
        "urduURN": 4146690,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 13,
        "babName": "فتنہ و فساد کے وقت خاموش رہنے کا بیان ۔",
        "hadithNumber": 4662,
        "hadithSanad": "ابوبکرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے حسن بن علی رضی اللہ عنہما کو فرمایا : ” میرا یہ بیٹا سردار ہے اور مجھے امید ہے کہ اللہ تعالیٰ اس کے ذریعے میری امت کے دو گروہوں میں صلح کرائے گا “ ۔ حماد کی روایت میں ہے : ” شاید اللہ تعالیٰ اس کے ذریعے مسلمانوں کے دو بڑے گروہوں میں صلح کرائے گا ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 946650,
        "last_updated": null
    },
    {
        "urduURN": 4146700,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 13,
        "babName": "فتنہ و فساد کے وقت خاموش رہنے کا بیان ۔",
        "hadithNumber": 4663,
        "hadithSanad": "محمد بن سیرین کہتے ہیں کہ",
        "hadithText": "حذیفہ رضی اللہ عنہ نے کہا : لوگوں میں کوئی ایسا نہیں جس کو فتنہ پہنچے اور مجھے اس کے فتنے میں پڑنے کا خوف نہ ہو ، سوائے محمد بن مسلمہ کے کیونکہ ان کے بارے میں رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” تمہیں کوئی فتنہ ضرر نہ پہنچائے گا “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 946660,
        "last_updated": null
    },
    {
        "urduURN": 4146710,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 13,
        "babName": "فتنہ و فساد کے وقت خاموش رہنے کا بیان ۔",
        "hadithNumber": 4664,
        "hadithSanad": "ثعلبہ بن ضبیعہ کہتے ہیں کہ",
        "hadithText": "ہم حذیفہ رضی اللہ عنہ کے پاس گئے تو آپ نے کہا : میں ایک ایسے شخص کو جانتا ہوں جسے فتنے کچھ بھی ضرر نہ پہنچا سکیں گے ، ہم نکلے تو دیکھا کہ ایک خیمہ نصب ہے ، ہم اندر گئے تو اس میں محمد بن مسلمہ رضی اللہ عنہ ملے ، ہم نے ان سے پوچھا ( کہ آبادی چھوڑ کر خیمہ میں کیوں ہیں ؟ ) تو فرمایا : میں نہیں چاہتا کہ تمہارے شہروں کی کوئی برائی مجھ سے چمٹے ، اس لیے جب تک فتنہ فرو نہ ہو جائے اور معاملہ واضح اور صاف نہ ہو جائے شہر کو نہیں جاؤں گا ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 946670,
        "last_updated": null
    },
    {
        "urduURN": 4146720,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 13,
        "babName": "فتنہ و فساد کے وقت خاموش رہنے کا بیان ۔",
        "hadithNumber": 4665,
        "hadithSanad": "ضبیعہ بن حصین ثعلبی سے بھی",
        "hadithText": "اسی مفہوم کی حدیث مروی ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 946680,
        "last_updated": null
    },
    {
        "urduURN": 4146730,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 13,
        "babName": "فتنہ و فساد کے وقت خاموش رہنے کا بیان ۔",
        "hadithNumber": 4666,
        "hadithSanad": "قیس بن عباد کہتے ہیں کہ",
        "hadithText": "میں نے علی رضی اللہ عنہ سے کہا : ہمیں آپ ( معاویہ رضی اللہ عنہ سے جنگ کے لیے ) اپنی اس روانگی کے متعلق بتائیے کہ آیا رسول اللہ صلی اللہ علیہ وسلم کا کوئی حکم ہے جو انہوں نے آپ کو دیا ہے یا آپ کا اپنا خیال ہے جسے آپ درست سمجھتے ہیں ، وہ بولے : مجھے رسول اللہ صلی اللہ علیہ وسلم نے کوئی حکم نہیں دیا بلکہ یہ میری رائے ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 946690,
        "last_updated": null
    },
    {
        "urduURN": 4146740,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 13,
        "babName": "فتنہ و فساد کے وقت خاموش رہنے کا بیان ۔",
        "hadithNumber": 4667,
        "hadithSanad": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” مسلمانوں میں اختلاف کے وقت ایک فرقہ نکلے گا جسے دونوں گروہوں میں سے جو حق سے قریب تر ہو گا قتل کرے گا “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 946700,
        "last_updated": null
    },
    {
        "urduURN": 4146750,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 14,
        "babName": "انبیاء و رسل علیہم+السلام کو ایک دوسرے پر فضیلت دینا کیسا ہے ؟",
        "hadithNumber": 4668,
        "hadithSanad": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” نبیوں کو ایک دوسرے پر فضیلت نہ دو ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 946710,
        "last_updated": null
    },
    {
        "urduURN": 4146760,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 14,
        "babName": "انبیاء و رسل علیہم+السلام کو ایک دوسرے پر فضیلت دینا کیسا ہے ؟",
        "hadithNumber": 4669,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” کسی بندے کے لیے درست نہیں کہ وہ کہے کہ میں یونس بن متی سے بہتر ہوں ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 946720,
        "last_updated": null
    },
    {
        "urduURN": 4146770,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 14,
        "babName": "انبیاء و رسل علیہم+السلام کو ایک دوسرے پر فضیلت دینا کیسا ہے ؟",
        "hadithNumber": 4670,
        "hadithSanad": "عبداللہ بن جعفر رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم فرماتے تھے : ” کسی نبی کے لیے یہ کہنا مناسب نہیں کہ میں یونس بن متی سے بہتر ہوں “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 946730,
        "last_updated": null
    },
    {
        "urduURN": 4146780,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 14,
        "babName": "انبیاء و رسل علیہم+السلام کو ایک دوسرے پر فضیلت دینا کیسا ہے ؟",
        "hadithNumber": 4671,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "یہود کے ایک شخص نے کہا : قسم اس ذات کی جس نے موسیٰ علیہ السلام کو چن لیا ، یہ سن کر مسلمان نے یہودی کے چہرہ پر طمانچہ رسید کر دیا ، یہودی رسول اللہ صلی اللہ علیہ وسلم کے پاس گیا اور اس کی شکایت کی تو آپ نے فرمایا : ” مجھے موسیٰ علیہ السلام پر فضیلت نہ دو ، ( پہلا صور پھونکنے سے ) سب لوگ بیہوش ہو جائیں گے تو سب سے پہلے میں ہوش میں آؤں گا ، اس وقت موسیٰ علیہ السلام عرش کا ایک کنارا مضبوطی سے پکڑے ہوئے ہوں گے ، تو مجھے نہیں معلوم کہ آیا وہ ان لوگوں میں سے تھے جو بیہوش ہو گئے تھے اور مجھ سے پہلے ہوش میں آ گئے ، یا ان لوگوں میں سے تھے جنہیں اللہ نے بیہوش ہونے سے محفوظ رکھا ۱؎ “ ۔ ابوداؤد کہتے ہیں : ابن یحییٰ کی حدیث زیادہ کامل ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 946740,
        "last_updated": null
    },
    {
        "urduURN": 4146790,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 14,
        "babName": "انبیاء و رسل علیہم+السلام کو ایک دوسرے پر فضیلت دینا کیسا ہے ؟",
        "hadithNumber": 4672,
        "hadithSanad": "انس رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم کو کہا : اے مخلوق میں سے سب سے بہتر ! تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” یہ شان تو ابراہیم علیہ السلام کی ہے ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 946750,
        "last_updated": null
    },
    {
        "urduURN": 4146800,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 14,
        "babName": "انبیاء و رسل علیہم+السلام کو ایک دوسرے پر فضیلت دینا کیسا ہے ؟",
        "hadithNumber": 4673,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” میں اولاد آدم کا سردار ہوں ، اور میں سب سے پہلا شخص ہوں جو اپنی قبر سے باہر آئے گا ، سب سے پہلے سفارش کرنے والا ہوں اور میری ہی سفارش سب سے پہلے قبول ہو گی “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 946760,
        "last_updated": null
    },
    {
        "urduURN": 4146810,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 14,
        "babName": "انبیاء و رسل علیہم+السلام کو ایک دوسرے پر فضیلت دینا کیسا ہے ؟",
        "hadithNumber": 4674,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” مجھے نہیں معلوم کہ تبع قابل ملامت ہے یا نہیں ، اور نہ مجھے یہ معلوم ہے کہ عزیر نبی ہیں یا نہیں ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 946770,
        "last_updated": null
    },
    {
        "urduURN": 4146820,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 14,
        "babName": "انبیاء و رسل علیہم+السلام کو ایک دوسرے پر فضیلت دینا کیسا ہے ؟",
        "hadithNumber": 4675,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا : ” میں ابن مریم سے لوگوں میں سب سے زیادہ قریب ہوں ، انبیاء علیہم السلام علاتی بھائی ہیں ، میرے اور ان کے درمیان کوئی نبی نہیں ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 946780,
        "last_updated": null
    },
    {
        "urduURN": 4146830,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 15,
        "babName": "ارجاء کی تردید کا بیان ۔",
        "hadithNumber": 4676,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” ایمان کی ستر سے کچھ زیادہ شاخیں ہیں ، ان میں سب سے افضل ” لا إله إلا الله “ کہنا ، اور سب سے کم تر راستے سے ہڈی ہٹانا ہے ۲؎ ، اور حیاء ایمان کی ایک شاخ ہے ۳؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 946790,
        "last_updated": null
    },
    {
        "urduURN": 4146840,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 15,
        "babName": "ارجاء کی تردید کا بیان ۔",
        "hadithNumber": 4677,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "عبدالقیس کا وفد جب رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا تو آپ نے انہیں ایمان باللہ کا حکم دیا اور پوچھا : ” کیا تم جانتے ہو : ایمان باللہ کیا ہے ؟ “ وہ بولے : اللہ اور اس کے رسول زیادہ جانتے ہیں ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” اس بات کی شہادت دینی کہ اللہ کے سوا کوئی معبود برحق نہیں اور محمد اللہ کے رسول ہیں ، نماز کی اقامت ، زکاۃ کی ادائیگی ، رمضان کے روزے رکھنا ، اور مال غنیمت میں سے پانچواں حصہ ادا کرو “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 946800,
        "last_updated": null
    },
    {
        "urduURN": 4146850,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 15,
        "babName": "ارجاء کی تردید کا بیان ۔",
        "hadithNumber": 4678,
        "hadithSanad": "جابر رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” بندے اور کفر کے درمیان حد فاصل نماز کا ترک کرنا ہے ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 946810,
        "last_updated": null
    },
    {
        "urduURN": 4146860,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 15,
        "babName": "ارجاء کی تردید کا بیان ۔",
        "hadithNumber": 4679,
        "hadithSanad": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” عقل اور دین میں ناقص ہوتے ہوئے عقل والے پر غلبہ پانے والا میں نے تم عورتوں سے زیادہ کسی کو نہیں دیکھا “ ( ایک عورت ) نے کہا : عقل اور دین میں کیا نقص ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : ” عقل کا نقص تو یہ ہے کہ دو عورتوں کی گواہی ایک مرد کی گواہی کے برابر ہوتی ہے ، اور دین کا نقص یہ ہے کہ ( حیض و نفاس میں ) تم میں کوئی نہ روزے رکھتی ہے اور نہ نماز پڑھتی ہے ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 946820,
        "last_updated": null
    },
    {
        "urduURN": 4146870,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 16,
        "babName": "ایمان کی کمی اور زیادتی کے دلائل کا بیان ۔",
        "hadithNumber": 4680,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "جب ( نماز میں ) نبی اکرم صلی اللہ علیہ وسلم نے کعبہ کی طرف رخ کرنا شروع کیا تو لوگ کہنے لگے : اللہ کے رسول ! ان لوگوں کا کیا ہو گا جو مر گئے ، اور وہ بیت المقدس کی طرف نماز پڑھتے تھے ؟ تو اللہ تعالیٰ نے یہ آیت نازل فرمائی «وما كان الله ليضيع إيمانكم» ” ایسا نہیں ہے کہ اللہ تمہارے ایمان یعنی نماز ضائع فرما دے “ ( البقرہ : ۱۴۳ ) ۱؎ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 946830,
        "last_updated": null
    },
    {
        "urduURN": 4146880,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 16,
        "babName": "ایمان کی کمی اور زیادتی کے دلائل کا بیان ۔",
        "hadithNumber": 4681,
        "hadithSanad": "ابوامامہ رضی اللہ عنہ سے روایت ہے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” جس نے اللہ ہی کے رضا کے لیے محبت کی ، اللہ ہی کے رضا کے لیے دشمنی کی ، اللہ ہی کے رضا کے لیے دیا ، اللہ ہی کے رضا کے لیے منع کر دیا تو اس نے اپنا ایمان مکمل کر لیا ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 946840,
        "last_updated": null
    },
    {
        "urduURN": 4146890,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 16,
        "babName": "ایمان کی کمی اور زیادتی کے دلائل کا بیان ۔",
        "hadithNumber": 4682,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” مومنوں میں سب سے کامل ایمان والا وہ ہے جو ان میں سب سے بہتر اخلاق والا ہے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 946850,
        "last_updated": null
    },
    {
        "urduURN": 4146900,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 16,
        "babName": "ایمان کی کمی اور زیادتی کے دلائل کا بیان ۔",
        "hadithNumber": 4683,
        "hadithSanad": "سعد بن ابی وقاص رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے کچھ لوگوں کو دیا اور ان میں سے ایک شخص کو کچھ نہیں دیا تو سعد نے عرض کیا : اللہ کے رسول ! آپ نے فلاں اور فلاں کو دیا لیکن فلاں کو کچھ بھی نہیں دیا حالانکہ وہ مومن ہے ، تو آپ صلی اللہ علیہ وسلم نے فرمایا : ” یا مسلم ہے “ سعد نے تین بار یہی عرض کیا اور نبی اکرم صلی اللہ علیہ وسلم کہتے رہے : ” یا مسلم ہے “ پھر آپ نے فرمایا : ” میں بعض لوگوں کو دیتا ہوں اور ان میں تجھے جو زیادہ محبوب ہے اسے چھوڑ دیتا ہوں ، میں اسے کچھ بھی نہیں دیتا ، ایسا اس اندیشے سے کہ کہیں وہ جہنم میں اوندھے منہ نہ ڈال دیئے جائیں ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 946860,
        "last_updated": null
    },
    {
        "urduURN": 4146910,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 16,
        "babName": "ایمان کی کمی اور زیادتی کے دلائل کا بیان ۔",
        "hadithNumber": 4684,
        "hadithSanad": "sanad",
        "hadithText": "ابن شہاب زہری آیت کریمہ «قل لم تؤمنوا ولكن قولوا أسلمنا» ” آپ کہہ دیجئیے تم ایمان نہیں لائے بلکہ یوں کہو کہ مسلمان ہوئے “ ( سورۃ الحجرات : ۱۴ ) کی تفسیر میں کہتے ہیں : ہم سمجھتے ہیں کہ ( اس آیت میں ) اسلام سے مراد زبان سے کلمے کی ادائیگی اور ایمان سے مراد عمل ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 946870,
        "last_updated": null
    },
    {
        "urduURN": 4146920,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 16,
        "babName": "ایمان کی کمی اور زیادتی کے دلائل کا بیان ۔",
        "hadithNumber": 4685,
        "hadithSanad": "سعد بن ابی وقاص رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے مسلمانوں میں کچھ تقسیم فرمایا تو میں نے عرض کیا : فلاں کو بھی دیجئیے ، وہ بھی مومن ہے ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” یا مسلم ہے ، میں ایک شخص کو کچھ عطا کرتا ہوں حالانکہ اس کے علاوہ دوسرا مجھے اس سے زیادہ محبوب ہوتا ہے ( جس کو نہیں دیتا ) اس اندیشے سے کہ کہیں ایسا نہ ہو کہ میں اس کو نہ دوں تو وہ اوندھے منہ ( جہنم میں ) ڈال دیا جائے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 946880,
        "last_updated": null
    },
    {
        "urduURN": 4146930,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 16,
        "babName": "ایمان کی کمی اور زیادتی کے دلائل کا بیان ۔",
        "hadithNumber": 4686,
        "hadithSanad": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” تم لوگ میرے بعد کافر نہ ہو جانا کہ تم میں سے بعض بعض کی گردن مارنے لگے ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 946890,
        "last_updated": null
    },
    {
        "urduURN": 4146940,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 16,
        "babName": "ایمان کی کمی اور زیادتی کے دلائل کا بیان ۔",
        "hadithNumber": 4687,
        "hadithSanad": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” جو مسلمان کسی مسلمان کو کافر قرار دے تو اگر وہ کافر ہے ( تو کوئی بات نہیں ) ورنہ وہ ( قائل ) خود کافر ہو جائے گا “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 946900,
        "last_updated": null
    },
    {
        "urduURN": 4146950,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 16,
        "babName": "ایمان کی کمی اور زیادتی کے دلائل کا بیان ۔",
        "hadithNumber": 4688,
        "hadithSanad": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” چار خصلتیں جس میں ہوں وہ خالص منافق ہے اور جس میں ان میں سے کوئی ایک خصلت ہو تو اس میں نفاق کی ایک خصلت ہے یہاں تک کہ وہ اسے چھوڑ دے : جب بات کرے تو جھوٹ بولے ، وعدہ کرے تو وعدہ خلافی کرے ، معاہدہ کرے تو اس کو نہ نبھائے ، اگر کسی سے جھگڑا کرے تو گالی گلوچ دے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 946910,
        "last_updated": null
    },
    {
        "urduURN": 4146960,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 16,
        "babName": "ایمان کی کمی اور زیادتی کے دلائل کا بیان ۔",
        "hadithNumber": 4689,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” زانی زنا کے وقت مومن نہیں رہتا ، چور چوری کے وقت مومن نہیں رہتا ، شرابی شراب پیتے وقت مومن نہیں رہتا ( یعنی ایمان اس سے جدا ہو جاتا ہے پھر بعد میں واپس آ جاتا ہے ) توبہ کا دروازہ اس کے بعد بھی کھلا ہوا ہے “ ( یعنی اگر توبہ کر لے تو توبہ قبول ہو جائے گی اللہ بخشنے والا ہے ) ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 946920,
        "last_updated": null
    },
    {
        "urduURN": 4146970,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 16,
        "babName": "ایمان کی کمی اور زیادتی کے دلائل کا بیان ۔",
        "hadithNumber": 4690,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” جب آدمی زنا کرتا ہے تو ایمان اس سے نکل جاتا ہے اور بادل کے ٹکڑے کی طرح اس کے اوپر لٹکا رہتا ہے ، پھر جب زنا سے الگ ہوتا ہے تو دوبارہ ایمان اس کی طرف لوٹ آتا ہے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 946930,
        "last_updated": null
    },
    {
        "urduURN": 4146980,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 17,
        "babName": "تقدیر ( قضاء و قدر ) کا بیان ۔",
        "hadithNumber": 4691,
        "hadithSanad": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” قدریہ ( منکرین تقدیر ) اس امت ( محمدیہ ) کے مجوس ہیں ، اگر وہ بیمار پڑیں تو ان کی عیادت نہ کرو ، اور اگر وہ مر جائیں تو ان کے جنازے میں شریک مت ہو ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 946940,
        "last_updated": null
    },
    {
        "urduURN": 4146990,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 17,
        "babName": "تقدیر ( قضاء و قدر ) کا بیان ۔",
        "hadithNumber": 4692,
        "hadithSanad": "حذیفہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” ہر امت کے مجوس ہوتے ہیں ، اس امت کے مجوس وہ لوگ ہیں جو تقدیر کے منکر ہیں ، ان میں کوئی مر جائے تو تم اس کے جنازے میں شرکت نہ کرو ، اور اگر کوئی بیمار پڑے ، تو اس کی عیادت نہ کرو ، یہ دجال کی جماعت کے لوگ ہیں ، اللہ ان کو دجال کے زمانے تک باقی رکھے گا “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 946950,
        "last_updated": null
    },
    {
        "urduURN": 4147000,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 17,
        "babName": "تقدیر ( قضاء و قدر ) کا بیان ۔",
        "hadithNumber": 4693,
        "hadithSanad": "ابوموسی اشعری رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” اللہ تعالیٰ نے آدم کو ایک مٹھی مٹی سے پیدا کیا جس کو اس نے ساری زمین سے لیا تھا ، چنانچہ آدم کی اولاد اپنی مٹی کی مناسبت سے مختلف رنگ کی ہے ، کوئی سفید ، کوئی سرخ ، کوئی کالا اور کوئی ان کے درمیان ، کوئی نرم خو ، تو کوئی درشت خو ، سخت گیر ، کوئی خبیث تو کوئی پاک باز “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 946960,
        "last_updated": null
    },
    {
        "urduURN": 4147010,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 17,
        "babName": "تقدیر ( قضاء و قدر ) کا بیان ۔",
        "hadithNumber": 4694,
        "hadithSanad": "علی رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "ہم مدینہ کے قبرستان بقیع غرقد میں ایک جنازے میں شریک تھے ، جس میں رسول اللہ صلی اللہ علیہ وسلم بھی تھے ، آپ آئے اور بیٹھ گئے ، آپ کے پاس ایک چھڑی تھی ، چھڑی سے زمین کریدنے لگے ، پھر اپنا سر اٹھایا اور فرمایا : ” اللہ تعالیٰ نے تم میں سے ہر ایک متنفس کا ٹھکانہ جنت یا دوزخ میں لکھ دیا ہے ، اور یہ بھی کہ وہ نیک بخت ہو گا یا بدبخت “ لوگوں میں سے ایک شخص نے عرض کیا : اللہ کے نبی ! پھر ہم کیوں نہ اپنے لکھے پر اعتماد کر کے بیٹھ رہیں اور عمل ترک کر دیں کیونکہ جو نیک بختوں میں سے ہو گا وہ لازماً نیک بختی کی طرف جائے گا اور جو بدبختوں میں سے ہو گا وہ ضرور بدبختی کی طرف جائے گا ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : ” عمل کرو ، ہر ایک کے لیے اس کا عمل آسان ہے ، اہل سعادت کے لیے سعادت کی راہیں آسان کر دی جاتی ہیں اور بدبختوں کے لیے بدبختی کی راہیں آسان کر دی جاتی ہیں “ پھر نبی اکرم صلی اللہ علیہ وسلم نے اللہ تعالیٰ کا یہ فرمان سنایا : ” جو شخص اللہ کے راستے میں خرچ کرے ، اللہ سے ڈرے ، اور کلمہ توحید کی تصدیق کرے تو ہم اس کے لیے آسانی اور خوشی کی راہ آسان کر دیں گے ، اور جو شخص بخل کرے ، دنیوی شہوات میں پڑ کر جنت کی نعمتوں سے بے پروائی برتے اور کلمہ توحید کو جھٹلائے تو ہم اس کے لیے سختی اور بدبختی کی راہ آسان کر دیں گے “ ۱؎ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 946970,
        "last_updated": null
    },
    {
        "urduURN": 4147020,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 17,
        "babName": "تقدیر ( قضاء و قدر ) کا بیان ۔",
        "hadithNumber": 4695,
        "hadithSanad": "یحییٰ بن یعمر کہتے ہیں کہ",
        "hadithText": "بصرہ میں سب سے پہلے معبد جہنی نے تقدیر کا انکار کیا ، ہم اور حمید بن عبدالرحمٰن حمیری حج یا عمرے کے لیے چلے ، تو ہم نے دل میں کہا : اگر ہماری ملاقات رسول اللہ صلی اللہ علیہ وسلم کے کسی صحابی سے ہوئی تو ہم ان سے تقدیر کے متعلق لوگ جو باتیں کہتے ہیں اس کے بارے میں دریافت کریں گے ، تو اللہ نے ہماری ملاقات عبداللہ بن عمر رضی اللہ عنہما سے کرا دی ، وہ ہمیں مسجد میں داخل ہوتے ہوئے مل گئے ، چنانچہ میں نے اور میرے ساتھی نے انہیں گھیر لیا ، میرا خیال تھا کہ میرے ساتھی گفتگو کا موقع مجھے ہی دیں گے اس لیے میں نے کہا : ابوعبدالرحمٰن ! ہماری طرف کچھ ایسے لوگ ظاہر ہوئے ہیں جو قرآن پڑھتے اور اس میں علمی باریکیاں نکالتے ہیں ، کہتے ہیں : تقدیر کوئی چیز نہیں ۱؎ ، سارے کام یوں ہی ہوتے ہیں ، تو آپ نے عرض کیا : جب تم ان سے ملنا تو انہیں بتا دینا کہ میں ان سے بری ہوں ، اور وہ مجھ سے بری ہیں ( میرا ان سے کوئی تعلق نہیں ) ، اس ہستی کی قسم ، جس کی قسم عبداللہ بن عمر کھایا کرتا ہے ، اگر ان میں ایک شخص کے پاس احد کے برابر سونا ہو اور وہ اسے اللہ کی راہ میں خرچ کر دے تو بھی اللہ اس کے کسی عمل کو قبول نہ فرمائے گا ، جب تک کہ وہ تقدیر پر ایمان نہ لے آئے ، پھر آپ نے کہا : مجھ سے عمر بن خطاب رضی اللہ عنہ نے بیان کیا کہ ایک بار ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس تھے کہ اچانک ایک شخص ہمارے سامنے نمودار ہوا جس کا لباس نہایت سفید اور بال انتہائی کالے تھے ، اس پر نہ تو سفر کے آثار دکھائی دے رہے تھے ، اور نہ ہی ہم اسے پہچانتے تھے ، یہاں تک کہ وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس جا کر بیٹھ گیا ، اس نے اپنے گھٹنے نبی اکرم صلی اللہ علیہ وسلم کے گھٹنوں سے ملا دئیے ، اور اپنی ہتھیلیوں کو آپ کی رانوں پر رکھ لیا اور عرض کیا : محمد ! مجھے اسلام کے بارے میں بتائیے ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” اسلام یہ ہے کہ تم گواہی دو کہ اللہ کے سوا کوئی معبود برحق نہیں اور محمد اللہ کے رسول ہیں ، نماز قائم کرو ، زکاۃ دو ، رمضان کے روز ے رکھو ، اور اگر پہنچنے کی قدرت ہو تو بیت اللہ کا حج کرو “ وہ بولا : آپ نے سچ کہا ، عمر بن خطاب کہتے ہیں : ہمیں اس پر تعجب ہوا کہ وہ آپ سے سوال بھی کرتا ہے اور تصدیق بھی کرتا ہے ۔ اس نے کہا : مجھے ایمان کے بارے میں بتائیے ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” ایمان یہ ہے کہ تم اللہ پر ، اس کے فرشتوں پر ، اس کی کتابوں پر ، اس کے رسولوں پر ، آخرت کے دن پر اور تقدیر ۲؎ کے بھلے یا برے ہونے پر ایمان لاؤ “ اس نے کہا : آپ نے سچ کہا ۔ پھر پوچھا : مجھے احسان کے بارے میں بتائیے ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” تم اللہ کی عبادت اس طرح کرو گویا تم اسے دیکھ رہے ہو ، اور اگر یہ کیفیت پیدا نہ ہو سکے تو ( یہ تصور رکھو کہ ) وہ تو تمہیں ضرور دیکھ رہا ہے “ اس نے کہا : مجھے قیامت کے بارے میں بتائیے ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” جس سے پوچھا جا رہا ہے ، وہ اس بارے میں پوچھنے والے سے زیادہ نہیں جانتا “ ۳؎ ۔ اس نے کہا : تو مجھے اس کی علامتیں ہی بتا دیجئیے ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” اس کی علامتوں میں سے یہ ہے کہ لونڈی اپنی مالکن کو جنے گی ۴؎ ، اور یہ کہ تم ننگے پیر اور ننگے بدن ، محتاج ، بکریوں کے چرواہوں کو دیکھو گے کہ وہ اونچی اونچی عمارتیں بنانے میں فخر و مباہات کریں گے “ پھر وہ چلا گیا ، پھر میں تین ۵؎ ( ساعت ) تک ٹھہرا رہا ، پھر آپ صلی اللہ علیہ وسلم نے فرمایا : ” اے عمر ! کیا تم جانتے ہو کہ پوچھنے والا کون تھا ؟ “ میں نے عرض کیا : اللہ اور اس کے رسول زیادہ جانتے ہیں ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” وہ جبرائیل تھے ، تمہیں تمہارا دین سکھانے آئے تھے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 946980,
        "last_updated": null
    },
    {
        "urduURN": 4147030,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 17,
        "babName": "تقدیر ( قضاء و قدر ) کا بیان ۔",
        "hadithNumber": 4696,
        "hadithSanad": "یحییٰ بن یعمر اور حمید بن عبدالرحمٰن کہتے ہیں کہ",
        "hadithText": "ہم عبداللہ بن عمر رضی اللہ عنہما سے ملے تو ہم نے آپ سے تقدیر کے بارے میں جو کچھ لوگ کہتے ہیں اس کا ذکر کیا ۔ پھر راوی نے اسی طرح کی روایت ذکر کی اور اس میں یہ اضافہ کیا کہ آپ سے مزینہ یا جہینہ ۱؎ کے ایک شخص نے پوچھا : اے اللہ کے رسول ! پھر ہم کیا جان کر عمل کریں ؟ کیا یہ جان کر کہ جو کچھ ہم کر رہے ہیں وہ سب پہلے ہی تقدیر میں لکھا جا چکا ہے ، یا یہ جان کر کہ ( پہلے سے نہیں لکھا گیا ہے ) نئے سرے سے ہونا ہے ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” یہ جان کر کہ جو کچھ ہونا ہے سب تقدیر میں لکھا جا چکا ہے “ پھر اس شخص نے یا کسی دوسرے نے کہا : تو آخر یہ عمل کس لیے ہے ؟ ۲؎ ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” اہل جنت کے لیے اہل جنت والے اعمال آسان کر دئیے جاتے ہیں اور اہل جہنم کو اہل جہنم کے اعمال آسان کر دیئے جاتے ہیں “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 946990,
        "last_updated": null
    },
    {
        "urduURN": 4147040,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 17,
        "babName": "تقدیر ( قضاء و قدر ) کا بیان ۔",
        "hadithNumber": 4697,
        "hadithSanad": "یحییٰ بن یعمر سے یہی حدیث کچھ الفاظ کی کمی اور بیشی کے ساتھ مروی ہے",
        "hadithText": "اس نے پوچھا : اسلام کیا ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : ” نماز کی اقامت ، زکاۃ کی ادائیگی ، بیت اللہ کا حج ، ماہ رمضان کے روزے رکھنا اور جنابت لاحق ہونے پر غسل کرنا “ ۔ ابوداؤد کہتے ہیں : علقمہ مرجئی ہیں ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 947000,
        "last_updated": null
    },
    {
        "urduURN": 4147050,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 17,
        "babName": "تقدیر ( قضاء و قدر ) کا بیان ۔",
        "hadithNumber": 4698,
        "hadithSanad": "ابوذر اور ابوہریرہ رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم اپنے اصحاب کے بیچ میں اس طرح بیٹھتے تھے کہ جب کوئی اجنبی شخص آتا تو وہ بغیر پوچھے آپ کو پہچان نہیں پاتا تھا ، تو ہم نے رسول اللہ صلی اللہ علیہ وسلم سے درخواست کی کہ ہم آپ کے لیے ایک ایسی جائے نشست بنا دیں کہ جب بھی کوئی اجنبی آئے تو وہ آپ کو پہچان لے ، ابوہریرہ رضی اللہ عنہ کہتے ہیں : چنانچہ ہم نے آپ کے لیے ایک مٹی کا چبوترا بنا دیا ، تو آپ صلی اللہ علیہ وسلم اس پر بیٹھتے اور ہم آپ کے اردگرد بیٹھتے ، آگے ابوہریرہ رضی اللہ عنہ نے اسی جیسی روایت ذکر کی ، اس میں ہے کہ ایک شخص آیا ، پھر انہوں نے اس کی ہیئت ذکر کی ، یہاں تک کہ اس نے بیٹھے ہوئے لوگوں کے کنارے سے ہی آپ کو یوں سلام کیا : السلام علیک یا محمد ! تو نبی اکرم صلی اللہ علیہ وسلم نے اسے سلام کا جواب دیا ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 947010,
        "last_updated": null
    },
    {
        "urduURN": 4147060,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 17,
        "babName": "تقدیر ( قضاء و قدر ) کا بیان ۔",
        "hadithNumber": 4699,
        "hadithSanad": "ابن دیلمی ۱؎ کہتے ہیں کہ",
        "hadithText": "میں ابی بن کعب رضی اللہ عنہ کے پاس آیا اور ان سے کہا : میرے دل میں تقدیر کے بارے میں کچھ شبہ پیدا ہو گیا ہے ، لہٰذا آپ مجھے کوئی ایسی چیز بتائیے جس سے یہ امید ہو کہ اللہ اس شبہ کو میرے دل سے نکال دے گا ، فرمایا : اگر اللہ تعالیٰ آسمان والوں اور زمین والوں کو عذاب دینا چاہے تو دے سکتا ہے ، اور عذاب دینے میں وہ ظالم نہیں ہو گا ، اور اگر ان پر رحم کرے تو اس کی رحمت ان کے لیے ان کے اعمال سے بہت بہتر ہے ، اگر تم احد کے برابر سونا اللہ کی راہ میں خرچ کر دو تو اللہ اس کو تمہاری طرف سے قبول نہیں فرمائے گا جب تک کہ تم تقدیر پر ایمان نہ لے آؤ اور یہ جان لو کہ جو کچھ تمہیں پہنچا ہے وہ ایسا نہیں ہے کہ نہ پہنچتا ، اور جو کچھ تمہیں نہیں پہنچا وہ ایسا نہیں کہ تمہیں پہنچ جاتا ، اور اگر تم اس عقیدے کے علاوہ کسی اور عقیدے پر مر گئے تو ضرور جہنم میں داخل ہو گے ۔ ابن دیلمی کہتے ہیں : پھر میں عبداللہ بن مسعود رضی اللہ عنہ کے پاس آیا تو انہوں نے بھی اسی طرح کی بات کہی ، پھر میں حذیفہ بن یمان رضی اللہ عنہ کے پاس آیا تو انہوں نے بھی اسی طرح کی بات کہی ، پھر میں زید بن ثابت رضی اللہ عنہ کے پاس آیا تو انہوں نے مجھ سے اسی کے مثل نبی اکرم صلی اللہ علیہ وسلم کی ایک مرفوع روایت بیان کی ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 947020,
        "last_updated": null
    },
    {
        "urduURN": 4147070,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 17,
        "babName": "تقدیر ( قضاء و قدر ) کا بیان ۔",
        "hadithNumber": 4700,
        "hadithSanad": "ابوحفصہ کہتے ہیں کہ",
        "hadithText": "عبادہ بن صامت رضی اللہ عنہ نے اپنے بیٹے سے کہا : اے میرے بیٹے ! تم ایمان کی حقیقت کا مزہ ہرگز نہیں پا سکتے جب تک کہ تم یہ نہ جان لو کہ جو کچھ تمہیں ملا ہے وہ ایسا نہیں کہ نہ ملتا اور جو کچھ نہیں ملا ہے ایسا نہیں کہ وہ تمہیں مل جاتا ، میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے : ” سب سے پہلی چیز جسے اللہ تعالیٰ نے پیدا کیا ، قلم ہے ، اللہ تعالیٰ نے اس سے کہا : لکھ ، قلم نے کہا : اے میرے رب ! میں کیا لکھوں ؟ اللہ تعالیٰ نے کہا : قیامت تک ہونے والی ساری چیزوں کی تقدیریں لکھ “ اے میرے بیٹے ! میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے : ” جو اس کے علاوہ ( کسی اور عقیدے ) پر مرا تو وہ مجھ سے نہیں “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 947030,
        "last_updated": null
    },
    {
        "urduURN": 4147080,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 17,
        "babName": "تقدیر ( قضاء و قدر ) کا بیان ۔",
        "hadithNumber": 4701,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” آدم اور موسیٰ نے بحث کی تو موسیٰ نے کہا : اے آدم ! آپ ہمارے باپ ہیں ، آپ ہی نے ہمیں محرومی سے دو چار کیا ، اور ہمیں جنت سے نکلوایا ، آدم نے کہا : تم موسیٰ ہو تمہیں اللہ تعالیٰ نے اپنی گفتگو کے لیے چن لیا ، اور تمہارے لیے تورات کو اپنے ہاتھ سے لکھا ، تم مجھے ایسی بات پر ملامت کرتے ہو جسے اس نے میرے لیے مجھے پیدا کرنے سے چالیس سال پہلے ہی لکھ دیا تھا ، پس آدم موسیٰ پر غالب آ گئے “ ۱؎ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 947040,
        "last_updated": null
    },
    {
        "urduURN": 4147090,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 17,
        "babName": "تقدیر ( قضاء و قدر ) کا بیان ۔",
        "hadithNumber": 4702,
        "hadithSanad": "عمر بن خطاب رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” موسیٰ ( علیہ السلام ) نے کہا : اے میرے رب ! ہمیں آدم علیہ السلام کو دکھا جنہوں نے ہمیں اور خود کو جنت سے نکلوایا ، تو اللہ نے انہیں آدم علیہ السلام کو دکھایا ، موسیٰ علیہ السلام نے کہا : آپ ہمارے باپ آدم ہیں ؟ تو آدم علیہ السلام نے ان سے کہا : ہاں ، انہوں نے کہا : آپ ہی ہیں جس میں اللہ نے اپنی روح پھونکی ، جسے تمام نام سکھائے اور فرشتوں کو حکم دیا تو انہوں نے آپ کو سجدہ کیا ؟ انہوں نے کہا : ہاں ، انہوں نے کہا : تو پھر کس چیز نے آپ کو اس پر آمادہ کیا کہ آپ نے ہمیں اور خود کو جنت سے نکلوا دیا ؟ تو آدم نے ان سے کہا : اور تم کون ہو ؟ وہ بولے : میں موسیٰ ہوں ، انہوں نے کہا : تم بنی اسرائیل کے وہی نبی ہو جس سے اللہ نے پردے کے پیچھے سے گفتگو کی اور تمہارے اور اپنے درمیان اپنی مخلوق میں سے کوئی قاصد مقرر نہیں کیا ؟ کہا : ہاں ، آدم علیہ السلام نے کہا : تو کیا تمہیں یہ بات معلوم نہیں کہ وہ ( جنت سے نکالا جانا ) میرے پیدا کئے جانے سے پہلے ہی کتاب میں لکھا ہوا تھا ؟ کہا : ہاں معلوم ہے ، انہوں نے کہا : پھر ایک چیز کے بارے میں جس کے متعلق اللہ تعالیٰ کا فیصلہ میرے پیدا کئے جانے سے پہلے ہی مقدر ہو چکا تھا کیوں مجھے ملامت کرتے ہو ؟ “ یہاں پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” تو آدم ، موسیٰ پر غالب آ گئے ، تو آدم موسیٰ پر غالب آ گئے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 947050,
        "last_updated": null
    },
    {
        "urduURN": 4147100,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 17,
        "babName": "تقدیر ( قضاء و قدر ) کا بیان ۔",
        "hadithNumber": 4703,
        "hadithSanad": "مسلم بن یسار جہنی سے روایت ہے کہ",
        "hadithText": "عمر بن خطاب رضی اللہ عنہ سے اس آیت «وإذ أخذ ربك من بني آدم من ظهورهم» کے متعلق پوچھا گیا ۱؎ ۔ ( حدیث بیان کرتے وقت ) قعنبی نے آیت پڑھی تو آپ نے کہا : جب نبی اکرم صلی اللہ علیہ وسلم سے اس آیت کے بارے میں سوال کیا گیا تو میں نے آپ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : ” اللہ تعالیٰ نے آدم کو پیدا کیا ، پھر ان کی پیٹھ پر اپنا داہنا ہاتھ پھیرا ، اس سے اولاد نکالی اور کہا : میں نے انہیں جنت کے لیے پیدا کیا ہے ، اور یہ جنتیوں کے کام کریں گے ، پھر ان کی پیٹھ پر ہاتھ پھیرا تو اس سے بھی اولاد نکالی اور کہا : میں نے انہیں جہنمیوں کے لیے پیدا کیا ہے اور یہ اہل جہنم کے کام کریں گے “ تو ایک شخص نے کہا : اللہ کے رسول ! پھر عمل سے کیا فائدہ ؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” اللہ تعالیٰ جب بندے کو جنت کے لیے پیدا کرتا ہے تو اس سے جنتیوں کے کام کراتا ہے ، یہاں تک کہ وہ جنتیوں کے اعمال میں سے کسی عمل پر مر جاتا ہے ، تو اس کی وجہ سے اسے جنت میں داخل کر دیتا ہے ، اور جب کسی بندے کو جہنم کے لیے پیدا کرتا ہے تو اس سے جہنمیوں کے کام کراتا ہے یہاں تک کہ وہ جہنمیوں کے اعمال میں سے کسی عمل پر مر جاتا ہے تو اس کی وجہ سے اسے جہنم میں داخل کر دیتا ہے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 947060,
        "last_updated": null
    },
    {
        "urduURN": 4147110,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 17,
        "babName": "تقدیر ( قضاء و قدر ) کا بیان ۔",
        "hadithNumber": 4704,
        "hadithSanad": "نعیم بن ربیعہ کہتے ہیں کہ",
        "hadithText": "میں عمر بن خطاب رضی اللہ عنہ کے پاس تھا ، پھر انہوں نے یہی حدیث روایت کی ، مالک کی روایت زیادہ کامل ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 947070,
        "last_updated": null
    },
    {
        "urduURN": 4147120,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 17,
        "babName": "تقدیر ( قضاء و قدر ) کا بیان ۔",
        "hadithNumber": 4705,
        "hadithSanad": "ابی بن کعب رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” وہ لڑکا جسے خضر ( علیہ السلام ) نے قتل کر دیا تھا طبعی طور پر کافر تھا اگر وہ زندہ رہتا تو اپنے ماں باپ کو سرکشی اور کفر میں مبتلا کر دیتا “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 947080,
        "last_updated": null
    },
    {
        "urduURN": 4147130,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 17,
        "babName": "تقدیر ( قضاء و قدر ) کا بیان ۔",
        "hadithNumber": 4706,
        "hadithSanad": "ابی بن کعب رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو اللہ تعالیٰ کے فرمان «وأما الغلام فكان أبواه مؤمنين» ” اور رہا لڑکا تو اس کے ماں باپ مومن تھے “ ( سورۃ الکہف : ۸۰ ) کے بارے میں فرماتے سنا کہ وہ پیدائش کے دن ہی کافر پیدا ہوا تھا ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 947090,
        "last_updated": null
    },
    {
        "urduURN": 4147140,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 17,
        "babName": "تقدیر ( قضاء و قدر ) کا بیان ۔",
        "hadithNumber": 4707,
        "hadithSanad": "ابی بن کعب رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” خضر ( علیہ السلام ) نے ایک لڑکے کو بچوں کے ساتھ کھیلتے دیکھا تو اس کا سر پکڑا ، اور اسے اکھاڑ لیا ، تو موسیٰ ( علیہ السلام ) نے کہا : کیا تم نے بےگناہ نفس کو مار ڈالا ؟ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 947100,
        "last_updated": null
    },
    {
        "urduURN": 4147150,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 17,
        "babName": "تقدیر ( قضاء و قدر ) کا بیان ۔",
        "hadithNumber": 4708,
        "hadithSanad": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں",
        "hadithText": "ہم سے رسول اللہ صلی اللہ علیہ وسلم نے ( آپ صادق اور آپ کی صداقت مسلم ہے ) بیان فرمایا : ” تم میں سے ہر شخص کا تخلیقی نطفہ چالیس دن تک اس کی ماں کے پیٹ میں جمع رکھا جاتا ہے ، پھر اتنے ہی دن وہ خون کا جما ہوا ٹکڑا رہتا ہے ، پھر وہ اتنے ہی دن گوشت کا لوتھڑا رہتا ہے ، پھر اس کے پاس ایک فرشتہ بھیجا جاتا ہے اور اسے چار باتوں کا حکم دیا جاتا ہے : تو وہ اس کا رزق ، اس کی عمر ، اس کا عمل لکھتا ہے ، پھر لکھتا ہے : آیا وہ بدبخت ہے یا نیک بخت ، پھر وہ اس میں روح پھونکتا ہے ، اب اگر تم میں سے کوئی جنتیوں کے عمل کرتا ہے ، یہاں تک کہ اس ( شخص ) کے اور اس ( جنت ) کے درمیان صرف ایک ہاتھ یا ایک ہاتھ کے برابر فاصلہ رہ جاتا ہے کہ کتاب ( تقدیر ) اس پر سبقت کر جاتی ہے اور وہ جہنمیوں کے کام کر بیٹھتا ہے تو وہ داخل جہنم ہو جاتا ہے ، اور تم میں سے کوئی شخص جہنمیوں کے کام کرتا ہے یہاں تک کہ اس ( شخص ) کے اور اس ( جہنم ) کے درمیان صرف ایک ہاتھ یا ایک ہاتھ کے برابر کا فاصلہ رہ جاتا ہے کہ کتاب ( تقدیر ) اس پر سبقت کر جاتی ہے ، اب وہ جنتیوں کے کام کرنے لگتا ہے تو داخل جنت ہو جاتا ہے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 113,
        "matchingArabicURN": 947110,
        "last_updated": null
    },
    {
        "urduURN": 4147160,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 17,
        "babName": "تقدیر ( قضاء و قدر ) کا بیان ۔",
        "hadithNumber": 4709,
        "hadithSanad": "عمران بن حصین رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا گیا : اللہ کے رسول ! کیا جنتی اور جہنمی پہلے ہی معلوم ہو چکے ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : ” ہاں “ اس نے کہا : پھر عمل کرنے والے کس بنا پر عمل کریں ؟ آپ نے فرمایا : ” ہر ایک کو توفیق اسی بات کی دی جاتی ہے جس کے لیے وہ پیدا کیا گیا ہے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 114,
        "matchingArabicURN": 947120,
        "last_updated": null
    },
    {
        "urduURN": 4147170,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 17,
        "babName": "تقدیر ( قضاء و قدر ) کا بیان ۔",
        "hadithNumber": 4710,
        "hadithSanad": "عمر بن خطاب رضی اللہ عنہ کہتے ہیں",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” تم منکرین تقدیر کے پاس نہ بیٹھو اور نہ ہی ان سے سلام و کلام کی ابتداء کرو “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 115,
        "matchingArabicURN": 947130,
        "last_updated": null
    },
    {
        "urduURN": 4147180,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 18,
        "babName": "کفار اور مشرکین کی اولاد کے انجام کا بیان ۔",
        "hadithNumber": 4711,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم سے مشرکین کی اولاد کے بارے میں پوچھا گیا ، تو آپ نے فرمایا : ” اللہ بہتر جانتا ہے کہ وہ زندہ رہتے تو کیا عمل کرتے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 116,
        "matchingArabicURN": 947140,
        "last_updated": null
    },
    {
        "urduURN": 4147190,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 18,
        "babName": "کفار اور مشرکین کی اولاد کے انجام کا بیان ۔",
        "hadithNumber": 4712,
        "hadithSanad": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ",
        "hadithText": "میں نے عرض کیا : اللہ کے رسول ! مومنوں کے بچوں کا کیا حال ہو گا ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : ” وہ اپنے ماں باپ کے حکم میں ہوں گے “ میں نے عرض کیا : اللہ کے رسول ! بغیر کسی عمل کے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : ” اللہ زیادہ بہتر جانتا ہے کہ وہ کیا عمل کرتے “ میں نے عرض کیا : اللہ کے رسول ! اور مشرکین کے بچے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : ” اپنے ماں باپ کے حکم میں ہوں گے “ میں نے عرض یا بغیر کسی عمل کے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : ” اللہ بہتر جانتا ہے کہ وہ کیا عمل کرتے “ ۱؎ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 117,
        "matchingArabicURN": 947150,
        "last_updated": null
    },
    {
        "urduURN": 4147200,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 18,
        "babName": "کفار اور مشرکین کی اولاد کے انجام کا بیان ۔",
        "hadithNumber": 4713,
        "hadithSanad": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم کے پاس انصار کا ایک بچہ نماز پڑھنے کے لیے لایا گیا ، میں نے عرض کیا : اللہ کے رسول ! زندگی کے مزے تو اس بچے کے لیے ہیں ، اس نے نہ کوئی گناہ کیا اور نہ ہی وہ اسے ( گناہ کو ) سمجھتا تھا ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” عائشہ ! کیا تم ایسا سمجھتی ہو حالانکہ ایسا نہیں ہے ؟ اللہ تعالیٰ نے جنت کو پیدا کیا اور اس کے لیے لوگ بھی پیدا کئے اور جنت کو ان لوگوں کے لیے جب بنایا جب وہ اپنے آباء کی پشتوں میں تھے ، اور جہنم کو پیدا کیا اور اس کے لیے لوگ بھی پیدا کئے گئے اور جہنم کو ان لوگوں کے لیے پیدا کیا جب کہ وہ اپنے آباء کی پشتوں میں تھے “ ۱؎ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 118,
        "matchingArabicURN": 947160,
        "last_updated": null
    },
    {
        "urduURN": 4147210,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 18,
        "babName": "کفار اور مشرکین کی اولاد کے انجام کا بیان ۔",
        "hadithNumber": 4714,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” ہر بچہ فطرت ( اسلام ) پر پیدا ہوتا ہے ، پھر اس کے والدین اسے یہودی یا نصرانی بنا ڈالتے ہیں ، جیسے اونٹ صحیح و سالم جانور سے پیدا ہوتا ہے تو کیا تمہیں اس میں کوئی کنکٹا نظر آتا ہے ؟ “ لوگوں نے عرض کیا : اللہ کے رسول ! آپ کا اس کے بارے میں کیا خیال ہے جو بچپنے میں مر جائے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : ” اللہ خوب جانتا ہے کہ وہ کیا عمل کرتے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 119,
        "matchingArabicURN": 947170,
        "last_updated": null
    },
    {
        "urduURN": 4147220,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 18,
        "babName": "کفار اور مشرکین کی اولاد کے انجام کا بیان ۔",
        "hadithNumber": 4715,
        "hadithSanad": "ابن وہب کہتے ہیں کہ",
        "hadithText": "میں نے مالک کو کہتے سنا ، ان سے پوچھا گیا : اہل بدعت ( قدریہ ) اس حدیث سے ہمارے خلاف استدلال کرتے ہیں ؟ مالک نے کہا : تم حدیث کے آخری ٹکڑے سے ان کے خلاف استدلال کرو ، اس لیے کہ اس میں ہے : صحابہ نے پوچھا کہ بچپن میں مرنے والے کا کیا حکم ہے ؟ تو آپ نے فرمایا : ” اللہ خوب جانتا ہے کہ وہ کیا عمل کرتے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 120,
        "matchingArabicURN": 947180,
        "last_updated": null
    },
    {
        "urduURN": 4147230,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 18,
        "babName": "کفار اور مشرکین کی اولاد کے انجام کا بیان ۔",
        "hadithNumber": 4716,
        "hadithSanad": "حجاج بن منہال کہتے کہ",
        "hadithText": "میں نے حماد بن سلمہ کو «كل مولود يولد على الفطرة» ” ہر بچہ فطرت ( اسلام ) پر پیدا ہوتا ہے “ ۱؎ کی تفسیر کرتے سنا ، آپ نے کہا : ہمارے نزدیک اس سے مراد وہ عہد ہے جو اللہ نے ان سے اسی وقت لے لیا تھا ، جب وہ اپنے آباء کی پشتوں میں تھے ، اللہ نے ان سے پوچھا تھا : «ألست بربكم قالوا بلى» ” کیا میں تمہارا رب ( معبود ) نہیں ہوں ؟ “ تو انہوں نے کہا تھا : کیوں نہیں ، ضرور ہیں ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 121,
        "matchingArabicURN": 947190,
        "last_updated": null
    },
    {
        "urduURN": 4147240,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 18,
        "babName": "کفار اور مشرکین کی اولاد کے انجام کا بیان ۔",
        "hadithNumber": 4717,
        "hadithSanad": "عامر شعبی کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” «وائدہ» ( زندہ درگور کرنے والی ) اور «مؤودہ» ( زندہ درگور کی گئی دونوں ) جہنم میں ہیں “ ۱؎ ۔ یحییٰ بن زکریا کہتے ہیں : میرے والد نے کہا : مجھ سے ابواسحاق نے بیان کیا ہے کہ عامر شعبی نے ان سے اسے بیان کیا ہے ، وہ علقمہ سے اور علقمہ ، ابن مسعود رضی اللہ عنہ سے اور ابن مسعود نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے ہیں ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 122,
        "matchingArabicURN": 947200,
        "last_updated": null
    },
    {
        "urduURN": 4147250,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 18,
        "babName": "کفار اور مشرکین کی اولاد کے انجام کا بیان ۔",
        "hadithNumber": 4718,
        "hadithSanad": "انس رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "ایک شخص نے عرض کیا : اللہ کے رسول ! میرے والد کہاں ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : ” تمہارے والد جہنم میں ہیں “ جب وہ پیٹھ پھیر کر چلا تو آپ صلی اللہ علیہ وسلم نے فرمایا : ” میرے والد اور تیرے والد دونوں جہنم میں ہیں “ ۱؎ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 123,
        "matchingArabicURN": 947210,
        "last_updated": null
    },
    {
        "urduURN": 4147260,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 18,
        "babName": "کفار اور مشرکین کی اولاد کے انجام کا بیان ۔",
        "hadithNumber": 4719,
        "hadithSanad": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” شیطان ابن آدم ( انسان ) کے بدن میں اسی طرح دوڑتا ہے جس طرح خون رگوں میں گردش کرتا ہے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 124,
        "matchingArabicURN": 947220,
        "last_updated": null
    },
    {
        "urduURN": 4147270,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 18,
        "babName": "کفار اور مشرکین کی اولاد کے انجام کا بیان ۔",
        "hadithNumber": 4720,
        "hadithSanad": "عمر بن خطاب رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” منکرین تقدیر کے پاس نہ بیٹھو اور نہ ہی ان سے بات چیت میں پہل کرو ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 125,
        "matchingArabicURN": 947230,
        "last_updated": null
    },
    {
        "urduURN": 4147280,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 19,
        "babName": "جہمیہ کا بیان ۔",
        "hadithNumber": 4721,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” لوگ ایک دوسرے سے برابر سوال کرتے رہیں گے یہاں تک کہ یہ کہا جائے گا ، اللہ نے تمام مخلوقات کو پیدا کیا تو اللہ کو کس نے پیدا کیا ؟ لہٰذا تم میں سے کسی کو اس سلسلے میں اگر کوئی شبہ گزرے تو وہ یوں کہے : میں اللہ پر ایمان لایا “ ۱؎ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 126,
        "matchingArabicURN": 947240,
        "last_updated": null
    },
    {
        "urduURN": 4147290,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 19,
        "babName": "جہمیہ کا بیان ۔",
        "hadithNumber": 4722,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ، پھر اس جیسی روایت ذکر کی ، البتہ اس میں ہے ، آپ نے فرمایا : ” جب لوگ ایسا کہیں تو تم کہو : «الله أحد * الله الصمد * لم يلد ولم يولد * ولم يكن له كفوا أحد» ” اللہ ایک ہے وہ بے نیاز ہے ۱؎ ، اس نے نہ کسی کو جنا اور نہ وہ کسی سے جنا گیا اور نہ کوئی اس کا ہمسر ہے “ پھر وہ اپنے بائیں جانب تین مرتبہ تھوکے اور شیطان سے پناہ مانگے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 127,
        "matchingArabicURN": 947250,
        "last_updated": null
    },
    {
        "urduURN": 4147300,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 19,
        "babName": "جہمیہ کا بیان ۔",
        "hadithNumber": 4723,
        "hadithSanad": "عباس بن عبدالمطلب رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "میں بطحاء میں ایک جماعت کے ساتھ تھا ، جس میں رسول اللہ صلی اللہ علیہ وسلم بھی موجود تھے ، اتنے میں بادل کا ایک ٹکڑا ان کے پاس سے گزرا تو آپ نے اس کی طرف دیکھ کر پوچھا : ” تم اسے کیا نام دیتے ہو ؟ “ لوگوں نے عرض کیا : «سحاب» ( بادل ) ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” اور «مزن» بھی “ لوگوں نے کہا : ہاں «مزن» بھی ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” اور «عنان» بھی “ لوگوں نے عرض کیا : اور «عنان» بھی ، ( ابوداؤد کہتے ہیں : «عنان» کو میں اچھی طرح ضبط نہ کر سکا ) آپ صلی اللہ علیہ وسلم نے پوچھا : ” کیا تمہیں معلوم ہے کہ آسمان اور زمین کے درمیان کتنی دوری ہے ؟ “ لوگوں نے عرض کیا : ہمیں نہیں معلوم ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” ان دونوں کے درمیان اکہتر یا بہتر یا تہتر سال کی مسافت ہے ، پھر اسی طرح اس کے اوپر آسمان ہے “ یہاں تک کہ آپ صلی اللہ علیہ وسلم نے سات آسمان گنائے ” پھر ساتویں کے اوپر ایک سمندر ہے جس کی سطح اور تہہ میں اتنی دوری ہے جتنی کہ ایک آسمان اور دوسرے آسمان کے درمیان ہے ، پھر اس کے اوپر آٹھ جنگلی بکرے ہیں جن کے کھروں اور گھٹنوں کے درمیان اتنی لمبائی ہے جتنی ایک آسمان سے دوسرے آسمان تک کی دوری ہے ، پھر ان کی پشتوں پر عرش ہے ، جس کے نچلے حصہ اور اوپری حصہ کے درمیان کی مسافت اتنی ہے جتنی ایک آسمان سے دوسرے آسمان کی ، پھر اس کے اوپر اللہ تعالیٰ ہے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 128,
        "matchingArabicURN": 947260,
        "last_updated": null
    },
    {
        "urduURN": 4147310,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 19,
        "babName": "جہمیہ کا بیان ۔",
        "hadithNumber": 4724,
        "hadithSanad": "اس سند سے بھی سماک",
        "hadithText": "سے اسی مفہوم کی حدیث مروی ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 129,
        "matchingArabicURN": 947270,
        "last_updated": null
    },
    {
        "urduURN": 4147320,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 19,
        "babName": "جہمیہ کا بیان ۔",
        "hadithNumber": 4725,
        "hadithSanad": "اس سند سے بھی سماک",
        "hadithText": "سے اسی لمبی حدیث کا مفہوم مروی ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 130,
        "matchingArabicURN": 947280,
        "last_updated": null
    },
    {
        "urduURN": 4147330,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 19,
        "babName": "جہمیہ کا بیان ۔",
        "hadithNumber": 4726,
        "hadithSanad": "جبیر بن مطعم رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک اعرابی آیا اور کہا : اللہ کے رسول ! لوگ مصیبت میں پڑ گئے ، گھربار تباہ ہو گئے ، مال گھٹ گئے ، جانور ہلاک ہو گئے ، لہٰذا آپ ہمارے لیے بارش کی دعا کیجئے ، ہم آپ کو سفارشی بناتے ہیں اللہ کے دربار میں ، اور اللہ کو سفارشی بناتے ہیں آپ کے دربار میں ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” تمہارا برا ہو ، سمجھتے ہو تم کیا کہہ رہے ہو ؟ “ پھر رسول اللہ صلی اللہ علیہ وسلم سبحان اللہ کہنے لگے ، اور برابر کہتے رہے یہاں تک کہ اس کا اثر آپ صلی اللہ علیہ وسلم کے اصحاب کے چہروں پر دیکھا گیا ، پھر فرمایا : ” تمہارا برا ہو اللہ کو اس کی مخلوق میں سے کسی کے دربار میں سفارشی نہیں بنایا جا سکتا ، اللہ کی شان اس سے بہت بڑی ہے ، تمہارا برا ہو ! کیا تم جانتے ہو اللہ کیا ہے ، اس کا عرش اس کے آسمانوں پر اس طرح ہے ( آپ نے انگلیوں سے گنبد کے طور پر اشارہ کیا ) اور وہ چرچراتا ہے جیسے پالان سوار کے بیٹھنے سے چرچراتا ہے ، ( ابن بشار کی حدیث میں ہے ) اللہ تعالیٰ اپنے عرش کے اوپر ہے ، اور اس کا عرش اس کے آسمانوں کے اوپر ہے “ اور پھر پوری حدیث ذکر کی ۔ عبدالاعلی ، ابن مثنی اور ابن بشار تینوں نے یعقوب بن عتبہ اور جبیر بن محمد بن جبیر سے ان دونوں نے محمد بن جبیر سے اور محمد بن جبیر نے جبیر بن مطعم سے روایت کی ہے ۔ البتہ احمد بن سعید کی سند والی حدیث ہی صحیح ہے ، اس پر ان کی موافقت ایک جماعت نے کی ہے ، جس میں یحییٰ بن معین اور علی بن مدینی بھی شامل ہیں اور اسے ایک جماعت نے ابن اسحاق سے روایت کیا ہے جیسا کہ احمد بن سعید نے بھی کہا ہے ، اور عبدالاعلی ، ابن مثنی اور ابن بشار کا سماع جیسا کہ مجھے معلوم ہوا ہے ، ایک ہی نسخے سے ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 131,
        "matchingArabicURN": 947290,
        "last_updated": null
    },
    {
        "urduURN": 4147340,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 19,
        "babName": "جہمیہ کا بیان ۔",
        "hadithNumber": 4727,
        "hadithSanad": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” مجھے اجازت ملی ہے کہ میں عرش کے اٹھانے والے فرشتوں میں سے ایک فرشتے کا حال بیان کروں جو عرش کو اٹھائے ہوئے ہیں ، اس کے کان کی لو سے اس کے مونڈھے تک کا فاصلہ سات سو برس کی مسافت ہے ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 132,
        "matchingArabicURN": 947300,
        "last_updated": null
    },
    {
        "urduURN": 4147350,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 19,
        "babName": "جہمیہ کا بیان ۔",
        "hadithNumber": 4728,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کے غلام ابو یونس سلیم بن جبیر کہتے ہیں کہ",
        "hadithText": "میں نے ابوہریرہ رضی اللہ عنہ کو آیت کریمہ «إن الله يأمركم أن تؤدوا الأمانات إلى أهلها *** إلى قوله تعالى *** سميعا بصيرا» ” اللہ تمہیں حکم دیتا ہے کہ تم امانتوں کو ان کے مالکوں تک پہنچا دو ۔ ۔ ۔ اللہ سننے اور دیکھنے والا ہے “ ( سورۃ النساء : ۵۸ ) تک پڑھتے سنا ، وہ کہتے ہیں : میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ اپنے انگوٹھے کو اپنے کان پر اور انگوٹھے کے قریب والی انگلی کو آنکھ پر رکھتے ، ( یعنی شہادت کی انگلی کو ) ، ابوہریرہ کہتے ہیں : میں نے رسول اللہ صلی اللہ علیہ وسلم کو اسے پڑھتے اور اپنی دونوں انگلیوں کو رکھتے دیکھا ۔ ابن یونس کہتے ہیں : عبداللہ بن یزید مقری نے کہا : یعنی «إن الله سميع بصير‏» پر انگلی رکھتے تھے ، مطلب یہ ہے کہ اللہ کے کان اور آنکھ ہے ۔ ابوداؤد کہتے ہیں : یہ جہمیہ کا رد ہے ۱؎ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 133,
        "matchingArabicURN": 947310,
        "last_updated": null
    },
    {
        "urduURN": 4147360,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 20,
        "babName": "رویت باری تعالیٰ کا بیان ۔",
        "hadithNumber": 4729,
        "hadithSanad": "جریر بن عبداللہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "ہم لوگ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ بیٹھے ہوئے تھے کہ آپ نے چودہویں شب کے چاند کی طرف دیکھا ، اور فرمایا : ” تم لوگ عنقریب اپنے رب کو دیکھو گے ، جیسے تم اسے دیکھ رہے ہو ، تمہیں اس کے دیکھنے میں کوئی زحمت نہ ہو گی ، لہٰذا اگر تم قدرت رکھتے ہو کہ تم فجر اور عصر کی نماز میں مغلوب نہ ہو تو ایسا کرو “ پھر آپ نے یہ آیت «فسبح بحمد ربك قبل طلوع الشمس وقبل غروبها» ” اور اپنے رب کی تسبیح کرو ، سورج کے نکلنے اور ڈوبنے سے پہلے “ ( سورۃ طہٰ : ۱۳۰ ) پڑھی ۱؎ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 134,
        "matchingArabicURN": 947320,
        "last_updated": null
    },
    {
        "urduURN": 4147370,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 20,
        "babName": "رویت باری تعالیٰ کا بیان ۔",
        "hadithNumber": 4730,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "کچھ لوگوں نے عرض کیا : اللہ کے رسول ! کیا قیامت کے دن ہم اپنے رب کو دیکھیں گے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : ” کیا تمہیں دوپہر کے وقت سورج کو دیکھنے میں کوئی زحمت ہوتی ہے جب کہ وہ بدلی میں نہ ہو ؟ “ لوگوں نے کہا : نہیں ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” کیا تم چودہویں رات کے چاند کو دیکھنے میں دقت محسوس کرتے ہو ، جب کہ وہ بدلی میں نہ ہو ؟ “ لوگوں نے عرض کیا : نہیں ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” اس ذات کی قسم جس کے ہاتھ میں میری جان ہے تمہیں اللہ کے دیدار میں کوئی دقت نہ ہو گی مگر اتنی ہی جتنی ان دونوں میں سے کسی ایک کے دیکھنے میں ہوتی ہے ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 135,
        "matchingArabicURN": 947330,
        "last_updated": null
    },
    {
        "urduURN": 4147380,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 20,
        "babName": "رویت باری تعالیٰ کا بیان ۔",
        "hadithNumber": 4731,
        "hadithSanad": "ابورزین عقیلی رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "میں نے عرض کیا : اللہ کے رسول ! کیا ہم میں سے ہر ایک اپنے رب کو ( قیامت کے دن ) بلا رکاوٹ دیکھے گا ؟ اور اس کی مخلوق میں اس کی مثال کیا ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : ” اے ابورزین ! کیا تم سب چودہویں کا چاند بلا رکاوٹ نہیں دیکھتے ؟ “ میں نے عرض کیا : کیوں نہیں ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” تو اللہ تو اور بھی بڑا ہے “ ابن معاذ کی روایت میں ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا : ” یہ تو اللہ کی مخلوقات میں سے ایک مخلوق ہے ، اللہ تو اس سے بہت بڑا اور عظیم ہے ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 136,
        "matchingArabicURN": 947340,
        "last_updated": null
    },
    {
        "urduURN": 4147390,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 21,
        "babName": "جہمیہ کے رد کا بیان ۔",
        "hadithNumber": 4732,
        "hadithSanad": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” قیامت کے روز اللہ آسمانوں کو لپیٹ دے گا ، پھر انہیں اپنے دائیں ہاتھ میں لے لے گا ، اور کہے گا : میں ہوں بادشاہ ، کہاں ہیں ظلم و قہر کرنے والے ؟ کہاں ہیں تکبر اور گھمنڈ کرنے والے ؟ پھر زمینوں کو لپیٹے گا ، پھر انہیں اپنے دوسرے ہاتھ میں لے لے گا ، پھر کہے گا : میں ہوں بادشاہ ، کہاں ہیں ظلم و قہر کرنے والے ؟ کہاں ہیں اترانے والے ؟ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 137,
        "matchingArabicURN": 947350,
        "last_updated": null
    },
    {
        "urduURN": 4147400,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 21,
        "babName": "جہمیہ کے رد کا بیان ۔",
        "hadithNumber": 4733,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” ہمارا رب ہر رات آسمان دنیا پر اترتا ہے ، جب رات کا آخری تہائی حصہ باقی رہ جاتا ہے اور کہتا ہے : کون ہے جو مجھے پکارے ، میں اس کی پکار کو قبول کروں ؟ کون ہے جو مجھ سے مانگے میں اسے دوں ؟ کون ہے جو مجھ سے مغفرت طلب کرے میں اسے معاف کر دوں ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 138,
        "matchingArabicURN": 947360,
        "last_updated": null
    },
    {
        "urduURN": 4147410,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 22,
        "babName": "قرآن کے کلام اللہ ہونے کا بیان ۔",
        "hadithNumber": 4734,
        "hadithSanad": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم خود کو موقف ( عرفات میں ٹھہرنے کی جگہ ) میں لوگوں پر پیش کرتے تھے اور فرماتے : ” کیا کوئی ایسا شخص نہیں ہے جو مجھے اپنی قوم کے پاس لے چلے ، قریش نے مجھے میرے رب کا کلام پہنچانے سے روک دیا ہے ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 139,
        "matchingArabicURN": 947370,
        "last_updated": null
    },
    {
        "urduURN": 4147420,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 22,
        "babName": "قرآن کے کلام اللہ ہونے کا بیان ۔",
        "hadithNumber": 4735,
        "hadithSanad": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں",
        "hadithText": "میرے جی میں میرا معاملہ اس سے کمتر تھا کہ اللہ تعالیٰ میرے بارے میں ایسی گفتگو فرمائے گا کہ وہ ہمیشہ تلاوت کی جائے گی ۱؎ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 140,
        "matchingArabicURN": 947380,
        "last_updated": null
    },
    {
        "urduURN": 4147430,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 22,
        "babName": "قرآن کے کلام اللہ ہونے کا بیان ۔",
        "hadithNumber": 4736,
        "hadithSanad": "عامر بن شہر رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "میں نجاشی کے پاس تھا کہ ان کے ایک لڑکے نے انجیل کی ایک آیت پڑھی ، تو میں ہنس پڑا انہوں نے کہا : کیا تم اللہ کے کلام پر ہنستے ہو ؟</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 141,
        "matchingArabicURN": 947390,
        "last_updated": null
    },
    {
        "urduURN": 4147440,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 22,
        "babName": "قرآن کے کلام اللہ ہونے کا بیان ۔",
        "hadithNumber": 4737,
        "hadithSanad": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم حسن اور حسین رضی اللہ عنہما کے لیے ( ان الفاظ میں ) اللہ تعالیٰ پناہ مانگتے تھے «أعيذكما بكلمات الله التامة من كل شيطان وهامة ومن كل عين لامة» ” میں تم دونوں کے لیے پناہ مانگتا ہوں اللہ کے پورے کلمات کے ذریعہ ، ہر شیطان سے ، ہر زہریلے کیڑے ( سانپ بچھو وغیرہ ) سے اور ہر نظر بد والی آنکھ سے “ پھر فرماتے : ” تمہارے باپ ( ابراہیم ) اسماعیل و اسحاق کے لیے بھی انہی کلمات کے ذریعہ پناہ مانگتے تھے “ ۔ ابوداؤد کہتے ہیں : یہ اس بات کی دلیل ہے کہ قرآن مخلوق نہیں ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 142,
        "matchingArabicURN": 947400,
        "last_updated": null
    },
    {
        "urduURN": 4147450,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 22,
        "babName": "قرآن کے کلام اللہ ہونے کا بیان ۔",
        "hadithNumber": 4738,
        "hadithSanad": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” جب اللہ تعالیٰ وحی کے لیے کلام کرتا ہے تو سبھی آسمان والے آواز سنتے ہیں جیسے کسی چکنے پتھر پر زنجیر کھینچی جا رہی ہو ، پھر وہ بیہوش کر دئیے جاتے ہیں اور اسی حال میں رہتے ہیں یہاں تک کہ ان کے پاس جبرائیل آتے ہیں ، جب جبرائیل ان کے پاس آتے ہیں تو ان کی غشی جاتی رہتی ہے ، پھر وہ کہتے ہیں : اے جبرائیل ! تمہارے رب نے کیا کہا ؟ وہ کہتے ہیں : حق ( فرمایا ) تو وہ سب کہتے ہیں حق ( فرمایا ) حق ( فرمایا ) “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 143,
        "matchingArabicURN": 947410,
        "last_updated": null
    },
    {
        "urduURN": 4147460,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 23,
        "babName": "شفاعت کا بیان ۔",
        "hadithNumber": 4739,
        "hadithSanad": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” میری شفاعت ۱؎ میری امت کے کبیرہ گناہ کرنے والوں کے لیے ہے ۲؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 144,
        "matchingArabicURN": 947420,
        "last_updated": null
    },
    {
        "urduURN": 4147470,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 23,
        "babName": "شفاعت کا بیان ۔",
        "hadithNumber": 4740,
        "hadithSanad": "عمران بن حصین رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” کچھ لوگ جہنم سے محمد ( صلی اللہ علیہ وسلم ) کی سفارش پر نکالے جائیں گے ، وہ جنت میں داخل ہوں گے ، اور وہ «جهنميين» جہنمی کہہ کر پکارے جائیں گے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 145,
        "matchingArabicURN": 947430,
        "last_updated": null
    },
    {
        "urduURN": 4147480,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 23,
        "babName": "شفاعت کا بیان ۔",
        "hadithNumber": 4741,
        "hadithSanad": "جابر رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "میں نے نبی اکرم صلی اللہ علیہ وسلم کو فرماتے سنا : ” جنت والے اس میں کھائیں گے پیئیں گے ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 146,
        "matchingArabicURN": 947440,
        "last_updated": null
    },
    {
        "urduURN": 4147490,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 24,
        "babName": "قیامت اور صور کا بیان ۔",
        "hadithNumber": 4742,
        "hadithSanad": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” «صور» ایک سنکھ ہے ، جس میں پھونک ماری جائے گی “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 147,
        "matchingArabicURN": 947450,
        "last_updated": null
    },
    {
        "urduURN": 4147500,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 24,
        "babName": "قیامت اور صور کا بیان ۔",
        "hadithNumber": 4743,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” زمین ابن آدم ( انسان ) کے تمام اعضاء ( جسم ) کو بجز ریڑھ کی نچلی ہڈی کے کھا جاتی ہے اس لیے کہ وہ اسی سے پیدا ہوا ہے ۱؎ ، اور اسی سے اسے دوبارہ جوڑ کر اٹھایا جائے گا “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 148,
        "matchingArabicURN": 947460,
        "last_updated": null
    },
    {
        "urduURN": 4147510,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 25,
        "babName": "جنت اور جہنم کی تخلیق کا بیان ۔",
        "hadithNumber": 4744,
        "hadithSanad": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” جب اللہ نے جنت کو پیدا کیا تو جبرائیل سے فرمایا : جاؤ اور اسے دیکھو ، وہ گئے اور اسے دیکھا ، پھر واپس آئے ، اور کہنے لگے : اے میرے رب ! تیری عزت کی قسم ، اس کے متعلق جو کوئی بھی سنے گا وہ اس میں ضرور داخل ہو گا ، پھر ( اللہ نے ) اسے مکروہات ( ناپسندیدہ ) ( چیزوں ) سے گھیر دیا ، پھر فرمایا : اے جبرائیل ! جاؤ اور اسے دیکھو ، وہ گئے اور اسے دیکھا ، پھر لوٹ کر آئے تو بولے : اے میرے رب ! تیری عزت کی قسم ! مجھے ڈر ہے کہ اس میں کوئی داخل نہ ہو سکے گا ، جب اللہ نے جہنم کو پیدا کیا تو فرمایا : اے جبرائیل ! جاؤ اور اسے دیکھو ، وہ گئے اور اسے دیکھا ، پھر واپس آئے اور کہنے لگے : اے میرے رب ! تیری عزت کی قسم ! جو اس کے متعلق سنے گا اس میں داخل نہ ہو گا ، تو اللہ نے اسے مرغوب اور پسندیدہ چیزوں سے گھیر دیا ، پھر فرمایا : جبرائیل ! جاؤ اور اسے دیکھو ، وہ گئے ، جہنم کو دیکھا پھر واپس آئے اور عرض کیا : اے میرے رب ! تیری عزت کی قسم ! مجھے ڈر ہے کہ کوئی بھی ایسا نہیں بچے گا جو اس میں داخل نہ ہو ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 149,
        "matchingArabicURN": 947470,
        "last_updated": null
    },
    {
        "urduURN": 4147520,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 26,
        "babName": "حوض+کوثر کا بیان ۔",
        "hadithNumber": 4745,
        "hadithSanad": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” تمہارے سامنے ( قیامت کے دن ) ایک حوض ہو گا ، جس کے دونوں کناروں کے درمیان اتنا فاصلہ ہے جتنا «جرباء» اور «اذرح» ۱؎ کے درمیان ہے ۲؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 150,
        "matchingArabicURN": 947480,
        "last_updated": null
    },
    {
        "urduURN": 4147530,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 26,
        "babName": "حوض+کوثر کا بیان ۔",
        "hadithNumber": 4746,
        "hadithSanad": "زید بن ارقم رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے ، ہم نے ایک جگہ پڑاؤ کیا تو آپ نے فرمایا : ” تم لوگ ان لوگوں کے ایک لاکھ حصوں میں کا ایک حصہ بھی نہیں ہو جو لوگ حشر میں حوض کوثر پر آئیں گے “ ۔ راوی ( ابوحمزہ ) کہتے ہیں : میں نے زید بن ارقم رضی اللہ عنہ سے کہا : اس دن آپ لوگ کتنے تھے ؟ کہا : سات سویا آٹھ سو ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 151,
        "matchingArabicURN": 947490,
        "last_updated": null
    },
    {
        "urduURN": 4147540,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 26,
        "babName": "حوض+کوثر کا بیان ۔",
        "hadithNumber": 4747,
        "hadithSanad": "مختار بن فلفل کہتے ہیں کہ",
        "hadithText": "میں نے انس بن مالک رضی اللہ عنہ کو کہتے سنا : ( ایک بار ) رسول اللہ صلی اللہ علیہ وسلم پر ہلکی اونگھ طاری ہوئی ، پھر آپ صلی اللہ علیہ وسلم نے مسکراتے ہوئے سر اٹھایا ، تو یا تو آپ نے لوگوں سے کہا ، یا لوگوں نے آپ سے کہا : اللہ کے رسول ! آپ کو ہنسی کیوں آئی ؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا : ” ابھی میرے اوپر ایک سورت نازل ہوئی “ پھر آپ صلی اللہ علیہ وسلم نے پڑھا : «بسم الله الرحمن الرحيم إنا أعطيناك الكوثر» یہاں تک کہ سورت ختم کر لی ، جب آپ صلی اللہ علیہ وسلم اسے پڑھ چکے تو آپ نے فرمایا : ” کیا تم جانتے ہو کوثر کیا ہے ؟ “ لوگوں نے کہا : اللہ اور اس کے رسول زیادہ جانتے ہیں ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” وہ جنت کی ایک نہر ہے جس کا وعدہ مجھ سے میرے رب نے کیا ہے اور اس پر بڑا خیر ہے ، اس پر ایک حوض ہے جس پر قیامت کے دن میری امت ( پینے ) آئے گی ، اس کے برتن ستاروں کی تعداد میں ہوں گے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 152,
        "matchingArabicURN": 947500,
        "last_updated": null
    },
    {
        "urduURN": 4147550,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 26,
        "babName": "حوض+کوثر کا بیان ۔",
        "hadithNumber": 4748,
        "hadithSanad": "انس بن مالک رضی اللہ عنہ کہتے ہیں",
        "hadithText": "جب اللہ کے نبی اکرم صلی اللہ علیہ وسلم کو معراج میں جنت میں لے جایا گیا تو آپ کے سامنے ایک نہر لائی گئی ، جس کے دونوں کنارے «مجیّب» یا کہا «مجوّف» ( خول دار ) یاقوت کے تھے ، آپ صلی اللہ علیہ وسلم کے ساتھ جو فرشتہ تھا اس نے اپنا ہاتھ مارا اور اندر سے مشک نکالی ، تو محمد صلی اللہ علیہ وسلم نے اپنے ساتھ والے فرشتے سے پوچھا یہ کیا ہے ؟ اس نے کہا : یہی کوثر ہے جسے اللہ تعالیٰ نے آپ کو عطا کیا ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 153,
        "matchingArabicURN": 947510,
        "last_updated": null
    },
    {
        "urduURN": 4147560,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 26,
        "babName": "حوض+کوثر کا بیان ۔",
        "hadithNumber": 4749,
        "hadithSanad": "عبدالسلام بن ابی حازم ابوطالوت بیان کرتے ہیں کہ",
        "hadithText": "میں نے ابوبرزہ رضی اللہ عنہ کو دیکھا وہ عبیداللہ بن زیاد کے ہاں گئے ، پھر مجھ سے فلاں شخص نے بیان کیا جو ان کی جماعت میں شریک تھا ، ( مسلم نے اس کا نام ذکر کیا ہے ) جب انہیں عبیداللہ نے دیکھا تو بولا : دیکھو تمہارا یہ محمدی موٹا ٹھگنا ہے ، تو شیخ ( ابوبرزہ ) اس کے اس طعنہ اور توہین کو سمجھ گئے اور بولے : مجھے یہ گمان نہ تھا کہ میں ایسے لوگوں میں باقی رہ جاؤں گا جو محمد صلی اللہ علیہ وسلم کی صحبت کا مجھے طعنہ دیں گے ، تو عبیداللہ نے ان سے کہا : محمد صلی اللہ علیہ وسلم کی صحبت تو آپ کے لیے فخر کی بات ہے ، نہ کہ عیب کی ، پھر کہنے لگا : میں نے آپ کو اس لیے بلایا ہے کہ میں آپ سے حوض کوثر کے بارے میں معلوم کروں ، کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم سے اس کے متعلق کچھ ذکر فرماتے سنا ہے ؟ تو ابوبرزہ رضی اللہ عنہ نے کہا : ہاں ایک بار نہیں ، دو بار نہیں ، تین بار نہیں ، چار بار نہیں ، پانچ بار نہیں ( یعنی بہت بار سنا ہے ) تو جو شخص اسے جھٹلائے اللہ اسے اس حوض میں سے نہ پلائے ، پھر غصے میں وہ نکل کر چلے گئے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 154,
        "matchingArabicURN": 947520,
        "last_updated": null
    },
    {
        "urduURN": 4147570,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 27,
        "babName": "قبر میں سوال کئے جانے اور قبر کے عذاب کا بیان ۔",
        "hadithNumber": 4750,
        "hadithSanad": "براء بن عازب رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” مسلمان سے جب قبر میں سوال ہوتا ہے اور وہ گواہی دیتا ہے کہ اللہ کے سوا کوئی معبود برحق نہیں اور محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں “ ۔ تو یہی مراد ہے اللہ کے قول «يثبت الله الذين آمنوا بالقول الثابت» ” اللہ ایمان والوں کو پکی بات کے ساتھ مضبوط کرتا ہے “ ( سورۃ ابراہیم : ۲۷ ) سے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 155,
        "matchingArabicURN": 947530,
        "last_updated": null
    },
    {
        "urduURN": 4147580,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 27,
        "babName": "قبر میں سوال کئے جانے اور قبر کے عذاب کا بیان ۔",
        "hadithNumber": 4751,
        "hadithSanad": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "اللہ کے نبی اکرم صلی اللہ علیہ وسلم بنی نجار کے کھجور کے ایک باغ میں داخل ہوئے ، تو ایک آواز سنی ، آپ صلی اللہ علیہ وسلم گھبرا اٹھے ، فرمایا : ” یہ قبریں کس کی ہیں ؟ “ لوگوں نے عرض کیا : زمانہ جاہلیت میں مرنے والوں کی ہیں ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” تم لوگ جہنم کے عذاب سے اور دجال کے فتنے سے اللہ کی پناہ مانگو “ لوگوں نے عرض کیا : ایسا کیوں ؟ اللہ کے رسول ! آپ صلی اللہ علیہ وسلم نے فرمایا : ” مومن جب قبر میں رکھا جاتا ہے تو اس کے پاس ایک فرشتہ آتا ہے ، اور اس سے کہتا ہے : تم کس کی عبادت کرتے تھے ؟ تو اگر اللہ اسے ہدایت دیئے ہوتا ہے تو وہ کہتا ہے : میں اللہ کی عبادت کرتا تھا ؟ پھر اس سے کہا جاتا ہے ، تم اس شخص کے بارے میں کیا کہتے تھے ؟ ۱؎ تو وہ کہتا ہے : وہ اللہ کے بندے اور اس کے رسول ہیں ، پھر اس کے علاوہ اور کچھ نہیں پوچھا جاتا ، پھر اسے ایک گھر کی طرف لے جایا جاتا ہے ، جو اس کے لیے جہنم میں تھا اور اس سے کہا جاتا ہے : یہ تمہارا گھر ہے جو تمہارے لیے جہنم میں تھا ، لیکن اللہ نے تمہیں اس سے بچا لیا ، تم پر رحم کیا اور اس کے بدلے میں تمہیں جنت میں ایک گھر دیا ، تو وہ کہتا ہے : مجھے چھوڑ دو کہ میں جا کر اپنے گھر والوں کو بشارت دے دوں ، لیکن اس سے کہا جاتا ہے ، ٹھہرا رہ ، اور جب کافر قبر میں رکھا جاتا ہے ، تو اس کے پاس ایک فرشتہ آتا ہے اور اس سے ڈانٹ کر کہتا ہے : تو کس کی عبادت کرتا تھا ؟ تو وہ کہتا ہے : میں نہیں جانتا ، تو اس سے کہا جاتا ہے : نہ تو نے جانا اور نہ کتاب پڑھی ( یعنی قرآن ) ، پھر اس سے کہا جاتا ہے : تو اس شخص کے بارے میں کیا کہتا تھا ؟ تو وہ کہتا ہے : وہی کہتا تھا جو لوگ کہتے تھے ، تو وہ اسے لوہے کے ایک گرز سے اس کے دونوں کانوں کے درمیان مارتا ہے ، تو وہ اس طرح چلاتا ہے کہ اس کی آواز آدمی اور جن کے علاوہ ساری مخلوق سنتی ہے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 156,
        "matchingArabicURN": 947540,
        "last_updated": null
    },
    {
        "urduURN": 4147590,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 27,
        "babName": "قبر میں سوال کئے جانے اور قبر کے عذاب کا بیان ۔",
        "hadithNumber": 4752,
        "hadithSanad": "عبدالوہاب سے اسی جیسی سند سے اس طرح کی حدیث مروی ہے",
        "hadithText": "اس میں ہے : ” جب بندہ قبر میں رکھ دیا جاتا ہے ، اور اس کے رشتہ دار واپس لوٹتے ہیں تو وہ ان کے جوتوں کی چاپ سنتا ہے ، اتنے میں اس کے پاس دو فرشتے آتے ہیں ، اور اس سے کہتے ہیں پھر انہوں نے پہلی حدیث کے قریب قریب بیان کیا ، اور اس میں اس طرح ہے : رہے کافر اور منافق تو وہ دونوں اس سے کہتے ہیں “ راوی نے ” منافق “ کا اضافہ کیا ہے اور اس میں ہے : ” اسے ہر وہ شخص سنتا ہے جو اس کے قریب ہوتا ہے ، سوائے آدمی اور جن کے ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 157,
        "matchingArabicURN": 947550,
        "last_updated": null
    },
    {
        "urduURN": 4147600,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 27,
        "babName": "قبر میں سوال کئے جانے اور قبر کے عذاب کا بیان ۔",
        "hadithNumber": 4753,
        "hadithSanad": "براء بن عازب رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ انصار کے ایک شخص کے جنازے میں نکلے ، ہم قبر کے پاس پہنچے ، وہ ابھی تک تیار نہ تھی ، تو رسول اللہ صلی اللہ علیہ وسلم بیٹھ گئے اور ہم بھی آپ کے اردگرد بیٹھ گئے گویا ہمارے سروں پر چڑیاں بیٹھی ہیں ، آپ صلی اللہ علیہ وسلم کے ہاتھ میں ایک لکڑی تھی ، جس سے آپ زمین کرید رہے تھے ، پھر آپ صلی اللہ علیہ وسلم نے سر اٹھایا اور فرمایا : ” قبر کے عذاب سے اللہ کی پناہ طلب کرو “ اسے دو بار یا تین بار فرمایا ، یہاں جریر کی روایت میں اتنا اضافہ ہے : اور فرمایا : ” اور وہ ان کے جوتوں کی چاپ سن رہا ہوتا ہے جب وہ پیٹھ پھیر کر لوٹتے ہیں ، اسی وقت اس سے پوچھا جاتا ہے ، اے جی ! تمہارا رب کون ہے ؟ تمہارا دین کیا ہے ؟ اور تمہارا نبی کون ہے ؟ “ ہناد کی روایت کے الفاظ ہیں ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” پھر اس کے پاس دو فرشتے آتے ہیں ، اسے بٹھاتے ہیں اور اس سے پوچھتے ہیں : تمہارا رب ( معبود ) کون ہے ؟ تو وہ کہتا ہے ، میرا رب ( معبود ) اللہ ہے ، پھر وہ دونوں اس سے پوچھتے ہیں : تمہارا دین کیا ہے ؟ وہ کہتا ہے : میرا دین اسلام ہے ، پھر پوچھتے ہیں : یہ کون ہے جو تم میں بھیجا گیا تھا ؟ وہ کہتا ہے : وہ اللہ کے رسول صلی اللہ علیہ وسلم ہیں ، پھر وہ دونوں اس سے کہتے ہیں : تمہیں یہ کہاں سے معلوم ہوا ؟ وہ کہتا ہے : میں نے اللہ کی کتاب پڑھی اور اس پر ایمان لایا اور اس کو سچ سمجھا “ جریر کی روایت میں یہاں پر یہ اضافہ ہے : ” اللہ تعالیٰ کے قول «يثبت الله الذين آمنوا» سے یہی مراد ہے “ ( پھر دونوں کی روایتوں کے الفاظ ایک جیسے ہیں ) آپ صلی اللہ علیہ وسلم نے فرمایا : ” پھر ایک پکارنے والا آسمان سے پکارتا ہے : میرے بندے نے سچ کہا لہٰذا تم اس کے لیے جنت کا بچھونا بچھا دو ، اور اس کے لیے جنت کی طرف کا ایک دروازہ کھول دو ، اور اسے جنت کا لباس پہنا دو “ آپ صلی اللہ علیہ وسلم فرماتے ہیں : ” پھر جنت کی ہوا اور اس کی خوشبو آنے لگتی ہے ، اور تا حد نگاہ اس کے لیے قبر کشادہ کر دی جاتی ہے “ ۔ اور رہا کافر تو آپ صلی اللہ علیہ وسلم نے اس کی موت کا ذکر کیا اور فرمایا : ” اس کی روح اس کے جسم میں لوٹا دی جاتی ہے ، اس کے پاس دو فرشتے آتے ہیں ، اسے اٹھاتے ہیں اور پوچھتے ہیں : تمہارا رب کون ہے ؟ وہ کہتا ہے : ہا ہا ! مجھے نہیں معلوم ، وہ دونوں اس سے پوچھتے ہیں : یہ آدمی کون ہے جو تم میں بھیجا گیا تھا ؟ وہ کہتا ہے : ہا ہا ! مجھے نہیں معلوم ، پھر وہ دونوں اس سے پوچھتے ہیں : تمہارا دین کیا ہے ؟ وہ کہتا ہے : ہا ہا ! مجھے نہیں معلوم ، تو پکارنے والا آسمان سے پکارتا ہے : اس نے جھوٹ کہا ، اس کے لیے جہنم کا بچھونا بچھا دو اور جہنم کا لباس پہنا دو ، اور اس کے لیے جہنم کی طرف دروازہ کھول دو ، تو اس کی تپش اور اس کی زہریلی ہوا ( لو ) آنے لگتی ہے اور اس کی قبر تنگ کر دی جاتی ہے یہاں تک کہ اس کی پسلیاں ادھر سے ادھر ہو جاتی ہیں “ جریر کی روایت میں یہ اضافہ ہے : ” پھر اس پر ایک اندھا گونگا ( فرشتہ ) مقرر کر دیا جاتا ہے ، اس کے ساتھ لوہے کا ایک گرز ہوتا ہے اگر وہ اسے کسی پہاڑ پر بھی مارے تو وہ بھی خاک ہو جائے ، چنانچہ وہ اسے اس کی ایک ضرب لگاتا ہے جس کو مشرق و مغرب کے درمیان کی ساری مخلوق سوائے آدمی و جن کے سنتی ہے اور وہ مٹی ہو جاتا ہے “ آپ صلی اللہ علیہ وسلم فرماتے ہیں : ” پھر اس میں روح لوٹا دی جاتی ہے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 158,
        "matchingArabicURN": 947560,
        "last_updated": null
    },
    {
        "urduURN": 4147610,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 27,
        "babName": "قبر میں سوال کئے جانے اور قبر کے عذاب کا بیان ۔",
        "hadithNumber": 4754,
        "hadithSanad": "ابوعمر زاذان کہتے ہیں کہ",
        "hadithText": "میں نے براء رضی اللہ عنہ کو نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے سنا ، پھر انہوں نے اسی طرح کی حدیث ذکر کی ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 159,
        "matchingArabicURN": 947570,
        "last_updated": null
    },
    {
        "urduURN": 4147620,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 28,
        "babName": "ترازو کا بیان ۔",
        "hadithNumber": 4755,
        "hadithSanad": "حسن بصری کہتے ہیں کہ",
        "hadithText": "ام المؤمنین عائشہ رضی اللہ عنہا نے جہنم کا ذکر کیا تو رونے لگیں ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” تم کیوں روتی ہو ؟ “ ، وہ بولیں : مجھے جہنم یاد آ گئی تو رونے لگی ، کیا آپ قیامت کے دن اپنے گھر والوں کو یاد کریں گے ؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” تین جگہوں پر تو وہاں کوئی کسی کو یاد نہیں کرے گا : ایک میزان کے پاس یہاں تک کہ یہ معلوم ہو جائے کہ اس کا میزان ہلکا ہے یا بھاری ہے ، دوسرے کتاب کے وقت جب کہا جائے گا : آؤ پڑھو اپنی اپنی کتاب یہاں تک کہ یہ معلوم ہو جائے کہ اس کی کتاب کس میں دی جائے گی آیا دائیں ہاتھ میں یا بائیں ہاتھ میں ، یا پھر پیٹھ کے پیچھے سے اور تیسرے پل صراط کے پاس جب وہ جہنم پر رکھا جائے گا “ ۔ یعقوب نے «عن يونس» کے الفاظ سے روایت کی اور یہ حدیث اسی کے الفاظ میں ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 160,
        "matchingArabicURN": 947580,
        "last_updated": null
    },
    {
        "urduURN": 4147630,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 29,
        "babName": "دجال کا بیان ۔",
        "hadithNumber": 4756,
        "hadithSanad": "ابوعبیدہ بن جراح رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "میں نے نبی اکرم صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : ” نوح کے بعد کوئی ایسا نبی نہیں ہوا جس نے اپنی قوم کو دجال سے نہ ڈرایا ہو اور میں بھی تمہیں اس سے ڈراتا ہوں “ پھر رسول اللہ صلی اللہ علیہ وسلم نے ہمارے سامنے اس کی صفت بیان کی اور فرمایا : ” شاید اسے وہ شخص پائے جس نے مجھے دیکھا اور میری بات سنی “ لوگوں نے عرض کیا : اس دن ہمارے دل کیسے ہوں گے ؟ کیا اسی طرح جیسے آج ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : ” اس سے بھی بہتر “ ( کیونکہ فتنہ و فساد کے باوجود ایمان پر قائم رہنا زیادہ مشکل ہے ) ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 161,
        "matchingArabicURN": 947590,
        "last_updated": null
    },
    {
        "urduURN": 4147640,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 29,
        "babName": "دجال کا بیان ۔",
        "hadithNumber": 4757,
        "hadithSanad": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم لوگوں میں کھڑے ہوئے ، اللہ کی لائق شان حمد و ثنا بیان فرمائی ، پھر دجال کا ذکر کیا اور فرمایا : ” میں تمہیں اس سے ڈراتا ہوں ، کوئی نبی ایسا نہیں گزرا جس نے اپنی قوم کو اس سے ڈرایا نہ ہو ، نوح ( علیہ السلام ) نے بھی اپنی قوم کو اس سے ڈرایا تھا ، لیکن میں تمہیں اس کے بارے میں ایسی بات بتا رہا ہوں جو کسی نبی نے اپنی قوم کو نہیں بتائی : وہ کانا ہو گا اور اللہ کانا نہیں ہے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 162,
        "matchingArabicURN": 947600,
        "last_updated": null
    },
    {
        "urduURN": 4147650,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 30,
        "babName": "خوارج کے قتل کا بیان ۔",
        "hadithNumber": 4758,
        "hadithSanad": "ابوذر رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” جس نے جماعت ۲؎ سے ایک بالشت بھی علیحدگی اختیار کی تو اس نے اسلام کا قلادہ اپنی گردن سے اتار پھینکا “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 163,
        "matchingArabicURN": 947610,
        "last_updated": null
    },
    {
        "urduURN": 4147660,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 30,
        "babName": "خوارج کے قتل کا بیان ۔",
        "hadithNumber": 4759,
        "hadithSanad": "ابوذر رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” تمہارا کیا حال ہو گا ۱؎ جب میرے بعد حکمراں اس مال فے کو اپنے لیے مخصوص کر لیں گے “ میں نے عرض کیا : تب تو اس ذات کی قسم ، جس نے آپ کو حق کے ساتھ بھیجا ہے ، میں اپنی تلوار اپنے کندھے پر رکھوں گا ، پھر اس سے ان کے ساتھ لڑوں گا یہاں تک کہ میں آپ سے ملاقات کروں یا آ ملوں ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” کیا میں تمہیں اس سے بہتر چیز نہ بتاؤں ؟ تم صبر کرنا یہاں تک کہ تم مجھ سے آ ملو “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 164,
        "matchingArabicURN": 947620,
        "last_updated": null
    },
    {
        "urduURN": 4147670,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 30,
        "babName": "خوارج کے قتل کا بیان ۔",
        "hadithNumber": 4760,
        "hadithSanad": "ام المؤمنین ام سلمہ رضی اللہ عنہا کہتی ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” عنقریب تم پر ایسے حاکم ہوں گے جن سے تم معروف ( نیک اعمال ) ہوتے بھی دیکھو گے اور منکر ( خلاف شرع امور ) بھی دیکھو گے ، تو جس نے منکر کا انکار کیا ، ( ابوداؤد کہتے ہیں : ہشام کی روایت میں «بلسانہ» کا لفظ بھی ہے ( جس نے منکر کا ) اپنی زبان سے انکار کیا ) تو وہ بری ہو گیا اور جس نے دل سے برا جانا وہ بھی بچ گیا ، البتہ جس نے اس کام کو پسند کیا اور اس کی پیروی کی تو وہ بچ نہ سکے گا “ عرض کیا گیا : اللہ کے رسول ! کیا ہم انہیں قتل نہ کر دیں ؟ ( سلیمان ابن داود طیالسی ) کی روایت میں ہے : کیا ہم ان سے قتال نہ کریں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : ” نہیں جب تک کہ وہ نماز پڑھتے رہیں ۱؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 165,
        "matchingArabicURN": 947630,
        "last_updated": null
    },
    {
        "urduURN": 4147680,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 30,
        "babName": "خوارج کے قتل کا بیان ۔",
        "hadithNumber": 4761,
        "hadithSanad": "اس سند سے بھی ام سلمہ رضی اللہ عنہا نے نبی اکرم صلی اللہ علیہ وسلم سے اسی مفہوم کی حدیث روایت کی ہے ، البتہ اس میں یہ ہے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا : ” جس نے ناپسند کیا تو وہ بری ہو گیا اور جس نے کھل کر انکار کر دیا تو وہ محفوظ ہو گیا “ قتادہ کہتے ہیں : مطلب یہ ہے کہ جس نے دل سے اس کا انکار کیا اور جس نے دل سے اسے ناپسند کیا ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 166,
        "matchingArabicURN": 947640,
        "last_updated": null
    },
    {
        "urduURN": 4147690,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 30,
        "babName": "خوارج کے قتل کا بیان ۔",
        "hadithNumber": 4762,
        "hadithSanad": "عرفجہ رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا : ” میری امت میں کئی بار شر و فساد ہوں گے ، تو متحد مسلمانوں کے شرازہ کو منتشر کرنے والے کی گردن تلوار سے اڑا دو خواہ وہ کوئی بھی ہو “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 167,
        "matchingArabicURN": 947650,
        "last_updated": null
    },
    {
        "urduURN": 4147700,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 31,
        "babName": "خوارج سے قتال کا بیان ۔",
        "hadithNumber": 4763,
        "hadithSanad": "عبیدہ سے روایت ہے کہ",
        "hadithText": "علی رضی اللہ عنہ نے اہل نہروان ۱؎ کا ذکر کیا اور کہا : ان میں چھوٹے ہاتھ کا ایک آدمی ہے ، اگر مجھے تمہارے اترانے کا اندیشہ نہ ہوتا تو میں تمہیں بتاتا کہ اللہ تعالیٰ نے محمد صلی اللہ علیہ وسلم کی زبان سے کس چیز کا وعدہ کیا ہے ان لوگوں کے لیے جو ان سے جنگ کریں گے ، راوی کہتے ہیں : میں نے کہا : کیا آپ نے اسے اللہ کے رسول صلی اللہ علیہ وسلم سے سنا ہے ؟ انہوں نے کہا : ہاں رب کعبہ کی قسم ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 168,
        "matchingArabicURN": 947660,
        "last_updated": null
    },
    {
        "urduURN": 4147710,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 31,
        "babName": "خوارج سے قتال کا بیان ۔",
        "hadithNumber": 4764,
        "hadithSanad": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں",
        "hadithText": "علی رضی اللہ عنہ نے نبی اکرم صلی اللہ علیہ وسلم کے پاس مٹی سے آلودہ سونے کا ایک ٹکڑا بھیجا ۱؎ ، آپ صلی اللہ علیہ وسلم نے اسے چار لوگوں : اقرع بن حابس حنظلی مجاشعی ، عیینہ بن بدر فزاری ، زید الخیل طائی جو بنی نبہان کے ایک فرد ہیں اور علقمہ بن علاثہ عامری جو بنی کلاب سے ہیں کے درمیان تقسیم کر دیا ، اس پر قریش اور انصار کے لوگ ناراض ہو گئے اور کہنے لگے : آپ اہل نجد کے رئیسوں کو دیتے ہیں اور ہمیں چھوڑ دیتے ہیں ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” میں ان کی تالیف قلب کرتا ہوں “ اتنے میں ایک شخص آیا ( جس کی آنکھیں دھنسی ہوئی ، رخسار ابھرے ہوئے اور پیشانی بلند ، داڑھی گھنی اور سر منڈا ہوا تھا ) اور کہنے لگا : اے محمد ! اللہ سے ڈرو ، آپ صلی اللہ علیہ وسلم نے فرمایا : ” جب میں ہی اس کی نافرمانی کرنے لگوں گا تو کون اس کی فرمانبرداری کرے گا ، اللہ تو زمین والوں میں مجھے امانت دار سمجھتا ہے اور تم مجھے امانت دار نہیں سمجھتے ؟ “ تو ایک شخص نے اس کے قتل کی اجازت چاہی ، میرا خیال ہے وہ خالد بن ولید رضی اللہ عنہ تھے ، تو آپ صلی اللہ علیہ وسلم نے منع فرمایا ، اور جب وہ لوٹ گیا تو آپ نے فرمایا : ” اس کی نسل میں کچھ ایسے لوگ ہوں گے جو قرآن پڑھیں گے ، وہ ان کے گلوں سے نیچے نہیں اترے گا ، وہ اسلام سے اسی طرح نکل جائیں گے جیسے تیر اس شکار کے جسم سے نکل جاتا ہے جسے تیر مارا جاتا ہے ، وہ اہل اسلام کو قتل کریں گے اور بت پوجنے والوں کو چھوڑ دیں گے ، اگر میں نے انہیں پایا تو میں انہیں قوم عاد کی طرح قتل کروں گا ۲؎ “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 169,
        "matchingArabicURN": 947670,
        "last_updated": null
    },
    {
        "urduURN": 4147720,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 31,
        "babName": "خوارج سے قتال کا بیان ۔",
        "hadithNumber": 4765,
        "hadithSanad": "ابو سعید خدری اور انس بن مالک رضی اللہ عنہما سے روایت ہے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ” میری امت میں اختلاف اور تفرقہ ہو گا ، کچھ ایسے لوگ ہوں گے ، جو باتیں اچھی کریں گے لیکن کام برے کریں گے ، وہ قرآن پڑھیں گے لیکن وہ ان کے حلق سے نیچے نہ اترے گا ، وہ دین سے اسی طرح نکل جائیں گے جس طرح تیر شکار سے نکل جاتا ہے ، وہ ( اپنی روش سے ) باز نہیں آئیں گے جب تک تیر سوفار ( اپنی ابتدائی جگہ ) پر الٹا نہ آ جائے ، وہ سب لوگوں اور مخلوقات میں بدترین لوگ ہیں ، بشارت ہے اس کے لیے جو انہیں قتل کرے یا جسے وہ قتل کریں ، وہ کتاب اللہ کی طرف بلائیں گے ، حالانکہ وہ اس کی کسی چیز سے کچھ بھی تعلق نہیں رکھتے ہوں گے ، جو ان سے قتال کرے گا ، وہ لوگوں میں سب سے زیادہ اللہ سے قریب ہو گا “ لوگوں نے عرض کیا : اللہ کے رسول ! ان کی نشانی کیا ہو گی ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : ” سر منڈانا “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 170,
        "matchingArabicURN": 947680,
        "last_updated": null
    },
    {
        "urduURN": 4147730,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 31,
        "babName": "خوارج سے قتال کا بیان ۔",
        "hadithNumber": 4766,
        "hadithSanad": "انس رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے اسی طرح فرمایا ، البتہ اس میں یہ ہے کہ آپ نے فرمایا : ” ان کی علامت سر منڈانا اور بالوں کو جڑ سے ختم کرنا ہے ، لہٰذا جب تم انہیں دیکھو تو انہیں قتل کر دو “ ۔ ابوداؤد کہتے ہیں : «تسبید» : بال کو جڑ سے ختم کرنے کو کہتے ہیں ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 171,
        "matchingArabicURN": 947690,
        "last_updated": null
    },
    {
        "urduURN": 4147740,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 31,
        "babName": "خوارج سے قتال کا بیان ۔",
        "hadithNumber": 4767,
        "hadithSanad": "سوید بن غفلہ کہتے ہیں کہ",
        "hadithText": "علی رضی اللہ عنہ نے کہا : جب میں رسول اللہ صلی اللہ علیہ وسلم کی کوئی حدیث تم سے بیان کروں تو آسمان سے میرا گر جانا مجھے اس بات سے زیادہ محبوب ہے کہ میں آپ پر جھوٹ بولوں ، اور جب میں تم سے اس کے متعلق کوئی بات کروں جو ہمارے اور تمہارے درمیان ہے تو جنگ چالاکی و فریب دہی ہوتی ہی ہے ، میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا : ” آخری زمانے میں کچھ ایسے لوگ آئیں گے جو کم عمر اور کم عقل ہوں گے ، جو تمام مخلوقات میں بہتر شخص کی طرح باتیں کریں گے ، وہ اسلام سے اس طرح نکل جائیں گے جس طرح تیر شکار سے نکل جاتا ہے ، ان کا ایمان ان کی گردنوں سے نیچے نہ اترے گا ، لہٰذا جہاں کہیں تم ان سے ملو تم انہیں قتل کر دو ، اس لیے کہ ان کا قتل کرنا ، قیامت کے روز اس شخص کے لیے اجر و ثواب کا باعث ہو گا جو انہیں قتل کرے گا “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 172,
        "matchingArabicURN": 947700,
        "last_updated": null
    },
    {
        "urduURN": 4147750,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 31,
        "babName": "خوارج سے قتال کا بیان ۔",
        "hadithNumber": 4768,
        "hadithSanad": "زید بن وہب جہنی بیان کرتے ہیں کہ",
        "hadithText": "وہ اس فوج میں شامل تھے جو علی رضی اللہ عنہ کے ساتھ تھی ، اور جو خوارج کی طرف گئی تھی ، علی نے کہا : اے لوگو ! میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے : ” میری امت میں کچھ لوگ ایسے نکلیں گے کہ وہ قرآن پڑھیں گے ، تمہارا پڑھنا ان کے پڑھنے کے مقابلے کچھ نہ ہو گا ، نہ تمہاری نماز ان کی نماز کے مقابلے کچھ ہو گی ، اور نہ ہی تمہارا روزہ ان کے روزے کے مقابلے کچھ ہو گا ، وہ قرآن پڑھیں گے ، اور سمجھیں گے کہ وہ ان کے لیے ( ثواب ) ہے حالانکہ وہ ان پر ( عذاب ) ہو گا ، ان کی صلاۃ ان کے حلق سے نیچے نہ اترے گی ، وہ اسلام سے نکل جائیں گے ، جس طرح تیر شکار سے نکل جاتا ہے ، اگر ان لوگوں کو جو انہیں قتل کریں گے ، یہ معلوم ہو جائے کہ ان کے لیے ان کے نبی اکرم صلی اللہ علیہ وسلم کی زبانی کس چیز کا فیصلہ کیا گیا ہے ، تو وہ ضرور اسی عمل پر بھروسہ کر لیں گے ( اور دوسرے نیک اعمال چھوڑ بیٹھیں گے ) ان کی نشانی یہ ہے کہ ان میں ایک ایسا آدمی ہو گا جس کے بازو ہو گا ، لیکن ہاتھ نہ ہو گا ، اس کے بازو پر پستان کی گھنڈی کی طرح ایک گھنڈی ہو گی ، اس کے اوپر کچھ سفید بال ہوں گے “ تو کیا تم لوگ معاویہ اور اہل شام سے لڑنے جاؤ گے ، اور انہیں اپنی اولاد اور اسباب پر چھوڑ دو گے ( کہ وہ ان پر قبضہ کریں اور انہیں برباد کریں ) اللہ کی قسم مجھے امید ہے کہ یہی وہ لوگ ہیں ( جن کے بارے میں نبی اکرم صلی اللہ علیہ وسلم کا فرمان ہے ) اس لیے کہ انہوں نے ناحق خون بہایا ہے ، لوگوں کی چراگاہوں پر شب خون مارا ہے ، چلو اللہ کے نام پر ۔ سلمہ بن کہیل کہتے ہیں : پھر زید بن وہب نے مجھے ایک ایک مقام بتایا ( جہاں سے ہو کر وہ خارجیوں سے لڑنے گئے تھے ) یہاں تک کہ وہ ہمیں لے کر ایک پل سے گزرے ۔ وہ کہتے ہیں : جب ہماری مڈبھیڑ ہوئی تو خارجیوں کا سردار عبداللہ بن وہب راسبی تھا اس نے ان سے کہا : نیزے پھینک دو اور تلواروں کو میان سے کھینچ لو ، مجھے اندیشہ ہے کہ کہیں وہ تم سے اسی طرح صلح کا مطالبہ نہ کریں جس طرح انہوں نے تم سے حروراء کے دن کیا تھا ، چنانچہ انہوں نے اپنے نیز ے پھینک دئیے ، تلواریں کھینچ لیں ، لوگوں ( مسلمانوں ) نے انہیں اپنے نیزوں سے روکا اور انہوں نے انہیں ایک پر ایک کر کے قتل کیا اور ( مسلمانوں میں سے ) اس دن صرف دو آدمی شہید ہوئے ، علی رضی اللہ عنہ نے کہا : ان میں «مخدج» یعنی لنجے کو تلاش کرو ، لیکن وہ نہ پا سکے ، تو آپ خود اٹھے اور ان لوگوں کے پاس آئے جو ایک پر ایک کر کے مارے گئے تھے ، آپ نے کہا : انہیں نکالو ، تو انہوں نے اسے دیکھا کہ وہ سب سے نیچے زمین پر پڑا ہے ، آپ نے نعرہ تکبیر بلند کیا اور بولے : اللہ نے سچ فرمایا اور اس کے رسول نے ساری باتیں پہنچا دیں ۔ پھر عبیدہ سلمانی آپ کی طرف اٹھ کر آئے کہنے لگے : اے امیر المؤمنین ! قسم ہے اس ذات کی جس کے سوا کوئی لائق عبادت نہیں کیا آپ نے اسے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے ؟ وہ بولے : ہاں ، اللہ کی قسم جس کے سوا کوئی لائق عبادت نہیں ، یہاں تک کہ انہوں نے انہیں تین بار قسم دلائی اور وہ ( تینوں بار ) قسم کھاتے رہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 173,
        "matchingArabicURN": 947710,
        "last_updated": null
    },
    {
        "urduURN": 4147760,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 31,
        "babName": "خوارج سے قتال کا بیان ۔",
        "hadithNumber": 4769,
        "hadithSanad": "ابوالوضی کہتے ہیں کہ",
        "hadithText": "علی رضی اللہ عنہ نے کہا : «مخدج» ( لنجے ) کو تلاش کرو ، پھر راوی نے پوری حدیث بیان کی ، اس میں ہے : لوگوں نے اسے مٹی میں پڑے ہوئے مقتولین کے نیچے سے ڈھونڈ نکالا ، گویا میں اس کی طرف دیکھ رہا ہوں ، وہ ایک حبشی ہے چھوٹا سا کرتا پہنے ہوئے ہے ، اس کا ایک ہاتھ عورت کے پستان کی طرح ہے ، جس پر ایسے چھوٹے چھوٹے بال ہیں ، جیسے جنگلی چوہے کی دم پر ہوتے ہیں ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 174,
        "matchingArabicURN": 947720,
        "last_updated": null
    },
    {
        "urduURN": 4147770,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 31,
        "babName": "خوارج سے قتال کا بیان ۔",
        "hadithNumber": 4770,
        "hadithSanad": "ابومریم کہتے ہیں کہ",
        "hadithText": "یہ «مخدج» ( لنجا ) مسجد میں اس دن ہمارے ساتھ تھا ہم اس کے ساتھ رات دن بیٹھا کرتے تھے ، وہ فقیر تھا ، میں نے اسے دیکھا کہ وہ مسکینوں کے ساتھ آ کر علی رضی اللہ عنہ کے کھانے پر لوگوں کے ساتھ شریک ہوتا تھا اور میں نے اسے اپنا ایک کپڑا دیا تھا ۔ ابومریم کہتے ہیں : لوگ «مخدج» ( لنجے ) کو «نافعا ذا الثدية» ( پستان والا ) کا نام دیتے تھے ، اس کے ہاتھ میں عورت کے پستان کی طرح گوشت ابھرا ہوا تھا ، اس کے سرے پر ایک گھنڈی تھی جیسے پستان میں ہوتی ہے اس پر بلی کی مونچھوں کی طرح چھوٹے چھوٹے بال تھے ۔ ابوداؤد کہتے ہیں : لوگوں کے نزدیک اس کا نام حرقوس تھا ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 175,
        "matchingArabicURN": 947730,
        "last_updated": null
    },
    {
        "urduURN": 4147780,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 32,
        "babName": "چوروں سے مقابلہ کرنے کا بیان ۔",
        "hadithNumber": 4771,
        "hadithSanad": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” جس کا مال لینے کا ناحق ارادہ کیا جائے اور وہ ( اپنے مال کے بچانے کے لیے ) لڑے اور مارا جائے تو وہ شہید ہے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 176,
        "matchingArabicURN": 947740,
        "last_updated": null
    },
    {
        "urduURN": 4147790,
        "collection": "abudawud",
        "volumeNumber": 1,
        "bookNumber": 49,
        "bookName": "سنتوں کا بیان",
        "babNumber": 32,
        "babName": "چوروں سے مقابلہ کرنے کا بیان ۔",
        "hadithNumber": 4772,
        "hadithSanad": "سعید بن زید رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : ” جو اپنا مال بچانے میں مارا جائے وہ شہید ہے اور جو اپنے بال بچوں کو بچانے یا اپنی جان بچانے یا اپنے دین کو بچانے میں مارا جائے وہ بھی شہید ہے “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 177,
        "matchingArabicURN": 947750,
        "last_updated": null
    }
]