[
    {
        "arabicURN": 1323970,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "1.00",
        "hadithNumber": "2308",
        "bookName": " كتاب الأحكام ",
        "babName": " باب ذِكْرِ الْقُضَاةِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُعَلَّى بْنُ مَنْصُورٍ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، عَنْ عُثْمَانَ بْنِ مُحَمَّدٍ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ مَنْ جُعِلَ قَاضِيًا بَيْنَ النَّاسِ فَقَدْ ذُبِحَ بِغَيْرِ سِكِّينٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 1,
        "matchingEnglishURN": 1266260,
        "last_updated": null
    },
    {
        "arabicURN": 1323980,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "1.00",
        "hadithNumber": "2309",
        "bookName": " كتاب الأحكام ",
        "babName": " باب ذِكْرِ الْقُضَاةِ ",
        "hadithText": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ عَبْدِ الأَعْلَى، عَنْ بِلاَلِ بْنِ أَبِي مُوسَى، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ سَأَلَ الْقَضَاءَ وُكِلَ إِلَى نَفْسِهِ وَمَنْ جُبِرَ عَلَيْهِ نَزَلَ إِلَيْهِ مَلَكٌ فَسَدَّدَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 2,
        "matchingEnglishURN": 1266270,
        "last_updated": null
    },
    {
        "arabicURN": 1323990,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "1.00",
        "hadithNumber": "2310",
        "bookName": " كتاب الأحكام ",
        "babName": " باب ذِكْرِ الْقُضَاةِ ",
        "hadithText": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَعْلَى، وَأَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ أَبِي الْبَخْتَرِيِّ، عَنْ عَلِيٍّ، قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى الْيَمَنِ فَقُلْتُ يَا رَسُولَ اللَّهِ تَبْعَثُنِي وَأَنَا شَابٌّ أَقْضِي بَيْنَهُمْ وَلاَ أَدْرِي مَا الْقَضَاءُ قَالَ فَضَرَبَ فِي صَدْرِي بِيَدِهِ ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ اهْدِ قَلْبَهُ وَثَبِّتْ لِسَانَهُ ‏\"‏ ‏.‏ قَالَ فَمَا شَكَكْتُ بَعْدُ فِي قَضَاءٍ بَيْنَ اثْنَيْنِ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 3,
        "matchingEnglishURN": 1266280,
        "last_updated": null
    },
    {
        "arabicURN": 1324000,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "2.00",
        "hadithNumber": "2311",
        "bookName": " كتاب الأحكام ",
        "babName": " باب التَّغْلِيظِ فِي الْحَيْفِ وَالرِّشْوَةِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلاَّدٍ الْبَاهِلِيُّ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، حَدَّثَنَا مُجَالِدٌ، عَنْ عَامِرٍ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْ حَاكِمٍ يَحْكُمُ بَيْنَ النَّاسِ إِلاَّ جَاءَ يَوْمَ الْقِيَامَةِ وَمَلَكٌ آخِذٌ بِقَفَاهُ ثُمَّ يَرْفَعُ رَأْسَهُ إِلَى السَّمَاءِ فَإِنْ قَالَ أَلْقِهِ أَلْقَاهُ فِي مَهْوَاةٍ أَرْبَعِينَ خَرِيفًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 4,
        "matchingEnglishURN": 1266290,
        "last_updated": null
    },
    {
        "arabicURN": 1324010,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "2.00",
        "hadithNumber": "2312",
        "bookName": " كتاب الأحكام ",
        "babName": " باب التَّغْلِيظِ فِي الْحَيْفِ وَالرِّشْوَةِ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بِلاَلٍ، عَنْ عِمْرَانَ الْقَطَّانِ، عَنْ حُسَيْنٍ، - يَعْنِي ابْنَ عِمْرَانَ - عَنْ أَبِي إِسْحَاقَ الشَّيْبَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ مَعَ الْقَاضِي مَا لَمْ يَجُرْ فَإِذَا جَارَ وَكَلَهُ إِلَى نَفْسِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 5,
        "matchingEnglishURN": 1266300,
        "last_updated": null
    },
    {
        "arabicURN": 1324020,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "2.00",
        "hadithNumber": "2313",
        "bookName": " كتاب الأحكام ",
        "babName": " باب التَّغْلِيظِ فِي الْحَيْفِ وَالرِّشْوَةِ ",
        "hadithText": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ خَالِهِ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَعْنَةُ اللَّهِ عَلَى الرَّاشِي وَالْمُرْتَشِي ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 6,
        "matchingEnglishURN": 1266310,
        "last_updated": null
    },
    {
        "arabicURN": 1324030,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "3.00",
        "hadithNumber": "2314",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الْحَاكِمِ يَجْتَهِدُ فَيُصِيبُ الْحَقَّ ",
        "hadithText": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ، حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ اللَّهِ بْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ أَبِي قَيْسٍ، - مَوْلَى عَمْرِو بْنِ الْعَاصِ - عَنْ عَمْرِو بْنِ الْعَاصِ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِذَا حَكَمَ الْحَاكِمُ فَاجْتَهَدَ فَأَصَابَ فَلَهُ أَجْرَانِ وَإِذَا حَكَمَ فَاجْتَهَدَ فَأَخْطَأَ فَلَهُ أَجْرٌ ‏\"‏ ‏.‏ <br><p>\nقَالَ يَزِيدُ فَحَدَّثْتُ بِهِ أَبَا بَكْرِ بْنَ عَمْرِو بْنِ حَزْمٍ، فَقَالَ هَكَذَا حَدَّثَنِيهِ أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَة‏.‏َ",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 7,
        "matchingEnglishURN": 1266320,
        "last_updated": null
    },
    {
        "arabicURN": 1324050,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "3.00",
        "hadithNumber": "2315",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الْحَاكِمِ يَجْتَهِدُ فَيُصِيبُ الْحَقَّ ",
        "hadithText": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ تَوْبَةَ، حَدَّثَنَا خَلَفُ بْنُ خَلِيفَةَ، حَدَّثَنَا أَبُو هَاشِمٍ، قَالَ لَوْلاَ حَدِيثُ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الْقُضَاةُ ثَلاَثَةٌ اثْنَانِ فِي النَّارِ وَوَاحِدٌ فِي الْجَنَّةِ رَجُلٌ عَلِمَ الْحَقَّ فَقَضَى بِهِ فَهُوَ فِي الْجَنَّةِ وَرَجُلٌ قَضَى لِلنَّاسِ عَلَى جَهْلٍ فَهُوَ فِي النَّارِ وَرَجُلٌ جَارَ فِي الْحُكْمِ فَهُوَ فِي النَّارِ ‏\"‏ ‏.‏ لَقُلْنَا إِنَّ الْقَاضِيَ إِذَا اجْتَهَدَ فَهُوَ فِي الْجَنَّةِ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 8,
        "matchingEnglishURN": 1266330,
        "last_updated": null
    },
    {
        "arabicURN": 1324060,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "4.00",
        "hadithNumber": "2316",
        "bookName": " كتاب الأحكام ",
        "babName": " باب لاَ يَحْكُمُ الْحَاكِمُ وَهُوَ غَضْبَانُ ",
        "hadithText": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، وَأَحْمَدُ بْنُ ثَابِتٍ الْجَحْدَرِيُّ، قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، أَنَّهُ سَمِعَ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَقْضِي الْقَاضِي بَيْنَ اثْنَيْنِ وَهُوَ غَضْبَانُ ‏\"‏ ‏.‏ قَالَ هِشَامٌ لاَ يَنْبَغِي لِلْحَاكِمِ أَنْ يَقْضِيَ بَيْنَ اثْنَيْنِ وَهُوَ غَضْبَانُ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 9,
        "matchingEnglishURN": 1266340,
        "last_updated": null
    },
    {
        "arabicURN": 1324070,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "5.00",
        "hadithNumber": "2317",
        "bookName": " كتاب الأحكام ",
        "babName": " باب قَضِيَّةِ الْحَاكِمِ لاَ تُحِلُّ حَرَامًا وَلاَ تُحَرِّمُ حَلاَلاً ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّكُمْ تَخْتَصِمُونَ إِلَىَّ وَإِنَّمَا أَنَا بَشَرٌ وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ وَإِنَّمَا أَقْضِي بَيْنَكُمْ عَلَى نَحْوٍ مِمَّا أَسْمَعُ مِنْكُمْ فَمَنْ قَضَيْتُ لَهُ مِنْ حَقِّ أَخِيهِ شَيْئًا فَلاَ يَأْخُذْهُ فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنَ النَّارِ يَأْتِي بِهَا يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 10,
        "matchingEnglishURN": 1266350,
        "last_updated": null
    },
    {
        "arabicURN": 1324080,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "5.00",
        "hadithNumber": "2318",
        "bookName": " كتاب الأحكام ",
        "babName": " باب قَضِيَّةِ الْحَاكِمِ لاَ تُحِلُّ حَرَامًا وَلاَ تُحَرِّمُ حَلاَلاً ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا أَنَا بَشَرٌ وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ فَمَنْ قَطَعْتُ لَهُ مِنْ حَقِّ أَخِيهِ قِطْعَةً فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنَ النَّارِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 11,
        "matchingEnglishURN": 1266360,
        "last_updated": null
    },
    {
        "arabicURN": 1324090,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "6.00",
        "hadithNumber": "2319",
        "bookName": " كتاب الأحكام ",
        "babName": " باب مَنِ ادَّعَى مَا لَيْسَ لَهُ وَخَاصَمَ فِيهِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ بْنِ عَبْدِ الْوَارِثِ بْنِ سَعِيدٍ أَبُو عُبَيْدَةَ، حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي أَبِي، حَدَّثَنِي الْحُسَيْنُ بْنُ ذَكْوَانَ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، قَالَ حَدَّثَنِي يَحْيَى بْنُ يَعْمُرَ، أَنَّ أَبَا الأَسْوَدِ الدِّيلِيَّ، حَدَّثَهُ عَنْ أَبِي ذَرٍّ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنِ ادَّعَى مَا لَيْسَ لَهُ فَلَيْسَ مِنَّا وَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 12,
        "matchingEnglishURN": 1266370,
        "last_updated": null
    },
    {
        "arabicURN": 1324100,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "6.00",
        "hadithNumber": "2320",
        "bookName": " كتاب الأحكام ",
        "babName": " باب مَنِ ادَّعَى مَا لَيْسَ لَهُ وَخَاصَمَ فِيهِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ ثَعْلَبَةَ بْنِ سَوَاءٍ، حَدَّثَنِي عَمِّي، مُحَمَّدُ بْنُ سَوَاءٍ عَنْ حُسَيْنٍ الْمُعَلِّمِ، عَنْ مَطَرٍ الْوَرَّاقِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَعَانَ عَلَى خُصُومَةٍ بِظُلْمٍ - أَوْ يُعِينُ عَلَى ظُلْمٍ - لَمْ يَزَلْ فِي سَخَطِ اللَّهِ حَتَّى يَنْزِعَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 13,
        "matchingEnglishURN": 1266380,
        "last_updated": null
    },
    {
        "arabicURN": 1324110,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "7.00",
        "hadithNumber": "2321",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الْبَيِّنَةُ عَلَى الْمُدَّعِي وَالْيَمِينُ عَلَى الْمُدَّعَى عَلَيْهِ ",
        "hadithText": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى الْمِصْرِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَنْبَأَنَا ابْنُ جُرَيْجٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لَوْ يُعْطَى النَّاسُ بِدَعْوَاهُمُ ادَّعَى نَاسٌ دِمَاءَ رِجَالٍ وَأَمْوَالَهُمْ وَلَكِنِ الْيَمِينُ عَلَى الْمُدَّعَى عَلَيْهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 14,
        "matchingEnglishURN": 1266390,
        "last_updated": null
    },
    {
        "arabicURN": 1324120,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "7.00",
        "hadithNumber": "2322",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الْبَيِّنَةُ عَلَى الْمُدَّعِي وَالْيَمِينُ عَلَى الْمُدَّعَى عَلَيْهِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، وَأَبُو مُعَاوِيَةَ قَالاَ حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنِ الأَشْعَثِ بْنِ قَيْسٍ، قَالَ كَانَ بَيْنِي وَبَيْنَ رَجُلٍ مِنَ الْيَهُودِ أَرْضٌ فَجَحَدَنِي فَقَدَّمْتُهُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلْ لَكَ بَيِّنَةٌ ‏\"‏ ‏.‏ قُلْتُ لاَ ‏.‏ قَالَ لِلْيَهُودِيِّ ‏\"‏ احْلِفْ ‏\"‏ ‏.‏ قُلْتُ إِذًا يَحْلِفَ فَيَذْهَبَ بِمَالِي ‏.‏ فَأَنْزَلَ اللَّهُ سُبْحَانَهُ ‏<A id=\"q1\" name=\"q1\" href=\"javascript:openquran(2,77,77)\"><c_q1>{إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلاً}</c_q1></a>‏ إِلَى آخِرِ الآيَةِ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 15,
        "matchingEnglishURN": 1266400,
        "last_updated": null
    },
    {
        "arabicURN": 1324130,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "8.00",
        "hadithNumber": "2323",
        "bookName": " كتاب الأحكام ",
        "babName": " باب مَنْ حَلَفَ عَلَى يَمِينٍ فَاجِرَةٍ لِيَقْتَطِعَ بِهَا مَالاً ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا وَكِيعٌ، وَأَبُو مُعَاوِيَةَ قَالاَ حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ عَلَى يَمِينٍ وَهُوَ فِيهَا فَاجِرٌ يَقْتَطِعُ بِهَا مَالَ امْرِئٍ مُسْلِمٍ لَقِيَ اللَّهَ وَهُوَ عَلَيْهِ غَضْبَانُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 16,
        "matchingEnglishURN": 1266410,
        "last_updated": null
    },
    {
        "arabicURN": 1324140,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "8.00",
        "hadithNumber": "2324",
        "bookName": " كتاب الأحكام ",
        "babName": " باب مَنْ حَلَفَ عَلَى يَمِينٍ فَاجِرَةٍ لِيَقْتَطِعَ بِهَا مَالاً ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الْوَلِيدِ بْنِ كَثِيرٍ، عَنْ مُحَمَّدِ بْنِ كَعْبٍ، أَنَّهُ سَمِعَ أَخَاهُ عَبْدَ اللَّهِ بْنَ كَعْبٍ، أَنَّ أَبَا أُمَامَةَ الْحَارِثِيَّ، حَدَّثَهُ أَنَّهُ، سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ يَقْتَطِعُ رَجُلٌ حَقَّ امْرِئٍ مُسْلِمٍ بِيَمِينِهِ إِلاَّ حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ وَأَوْجَبَ لَهُ النَّارَ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ مِنَ الْقَوْمِ يَا رَسُولَ اللَّهِ وَإِنْ كَانَ شَيْئًا يَسِيرًا قَالَ ‏\"‏ وَإِنْ كَانَ سِوَاكًا مِنْ أَرَاكٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 17,
        "matchingEnglishURN": 1266420,
        "last_updated": null
    },
    {
        "arabicURN": 1324150,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "9.00",
        "hadithNumber": "2325",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الْيَمِينِ عِنْدَ مَقَاطِعِ الْحُقُوقِ ",
        "hadithText": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ ثَابِتٍ الْجَحْدَرِيُّ، حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى، قَالاَ حَدَّثَنَا هَاشِمُ بْنُ هَاشِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ نِسْطَاسٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ بِيَمِينٍ آثِمَةٍ عِنْدَ مِنْبَرِي هَذَا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ وَلَوْ عَلَى سِوَاكٍ أَخْضَرَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 18,
        "matchingEnglishURN": 1266430,
        "last_updated": null
    },
    {
        "arabicURN": 1324160,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "9.00",
        "hadithNumber": "2326",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الْيَمِينِ عِنْدَ مَقَاطِعِ الْحُقُوقِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، وَزَيْدُ بْنُ أَخْزَمَ، قَالاَ حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ، حَدَّثَنَا الْحَسَنُ بْنُ يَزِيدَ بْنِ فَرُّوخَ، - قَالَ مُحَمَّدُ بْنُ يَحْيَى وَهُوَ أَبُو يُونُسَ الْقَوِيُّ - قَالَ سَمِعْتُ أَبَا سَلَمَةَ، يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يَحْلِفُ عِنْدَ هَذَا الْمِنْبَرِ عَبْدٌ وَلاَ أَمَةٌ عَلَى يَمِينٍ آثِمَةٍ وَلَوْ عَلَى سِوَاكٍ رَطْبٍ إِلاَّ وَجَبَتْ لَهُ النَّارُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 19,
        "matchingEnglishURN": 1266440,
        "last_updated": null
    },
    {
        "arabicURN": 1324170,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "10.00",
        "hadithNumber": "2327",
        "bookName": " كتاب الأحكام ",
        "babName": " باب بِمَا يُسْتَحْلَفُ أَهْلُ الْكِتَابِ ",
        "hadithText": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَعَا رَجُلاً مِنْ عُلَمَاءِ الْيَهُودِ فَقَالَ ‏\"‏ أَنْشُدُكَ بِاللَّهِ الَّذِي أَنْزَلَ التَّوْرَاةَ عَلَى مُوسَى ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 20,
        "matchingEnglishURN": 1266450,
        "last_updated": null
    },
    {
        "arabicURN": 1324180,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "10.00",
        "hadithNumber": "2328",
        "bookName": " كتاب الأحكام ",
        "babName": " باب بِمَا يُسْتَحْلَفُ أَهْلُ الْكِتَابِ ",
        "hadithText": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ مُجَالِدٍ، أَنْبَأَنَا عَامِرٌ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِيَهُودِيَّيْنِ ‏\"‏ نَشَدْتُكُمَا بِاللَّهِ الَّذِي أَنْزَلَ التَّوْرَاةَ عَلَى مُوسَى عَلَيْهِ السَّلاَمُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 21,
        "matchingEnglishURN": 1266460,
        "last_updated": null
    },
    {
        "arabicURN": 1324190,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "11.00",
        "hadithNumber": "2329",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الرَّجُلاَنِ يَدَّعِيَانِ السِّلْعَةَ وَلَيْسَ بَيْنَهُمَا بَيِّنَةٌ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ خِلاَسٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ ذَكَرَ أَنَّ رَجُلَيْنِ، ادَّعَيَا دَابَّةً وَلَمْ يَكُنْ بَيْنَهُمَا بَيِّنَةٌ فَأَمَرَهُمَا النَّبِيُّ صلى الله عليه وسلم أَنْ يَسْتَهِمَا عَلَى الْيَمِينِ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 22,
        "matchingEnglishURN": 1266470,
        "last_updated": null
    },
    {
        "arabicURN": 1324200,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "11.00",
        "hadithNumber": "2330",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الرَّجُلاَنِ يَدَّعِيَانِ السِّلْعَةَ وَلَيْسَ بَيْنَهُمَا بَيِّنَةٌ ",
        "hadithText": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، وَمُحَمَّدُ بْنُ مَعْمَرٍ، وَزُهَيْرُ بْنُ مُحَمَّدٍ، قَالُوا حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، عَنْ أَبِي مُوسَى، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اخْتَصَمَ إِلَيْهِ رَجُلاَنِ بَيْنَهُمَا دَابَّةٌ وَلَيْسَ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ فَجَعَلَهَا بَيْنَهُمَا نِصْفَيْنِ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 23,
        "matchingEnglishURN": 1266480,
        "last_updated": null
    },
    {
        "arabicURN": 1324210,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "12.00",
        "hadithNumber": "2331",
        "bookName": " كتاب الأحكام ",
        "babName": " باب مَنْ سُرِقَ لَهُ شَىْءٌ فَوَجَدَهُ فِي يَدِ رَجُلٍ اشْتَرَاهُ ",
        "hadithText": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا حَجَّاجٌ، عَنْ سَعِيدِ بْنِ عُبَيْدِ بْنِ زَيْدِ بْنِ عُقْبَةَ، عَنْ أَبِيهِ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا ضَاعَ لِلرَّجُلِ مَتَاعٌ أَوْ سُرِقَ لَهُ مَتَاعٌ فَوَجَدَهُ فِي يَدِ رَجُلٍ يَبِيعُهُ فَهُوَ أَحَقُّ بِهِ وَيَرْجِعُ الْمُشْتَرِي عَلَى الْبَائِعِ بِالثَّمَنِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 24,
        "matchingEnglishURN": 1266490,
        "last_updated": null
    },
    {
        "arabicURN": 1324220,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "13.00",
        "hadithNumber": "2332",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الْحُكْمِ فِيمَا أَفْسَدَتِ الْمَوَاشِي بِاللَّيْلِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ ابْنَ مُحَيِّصَةَ الأَنْصَارِيَّ، أَخْبَرَهُ أَنَّ نَاقَةً لِلْبَرَاءِ كَانَتْ ضَارِيَةً دَخَلَتْ فِي حَائِطِ قَوْمٍ فَأَفْسَدَتْ فِيهِ فَكُلِّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِيهَا فَقَضَى أَنَّ حِفْظَ الأَمْوَالِ عَلَى أَهْلِهَا بِالنَّهَارِ وَعَلَى أَهْلِ الْمَوَاشِي مَا أَصَابَتْ مَوَاشِيهِمْ بِاللَّيْلِ ‏.‏ <br><p>\nحَدَّثَنَا الْحَسَنُ بْنُ عَلِيِّ بْنِ عَفَّانَ، حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، عَنْ سُفْيَانَ، عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى، عَنِ الزُّهْرِيِّ، عَنْ حَرَامِ بْنِ مُحَيِّصَةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، أَنَّ نَاقَةً، لآلِ الْبَرَاءِ أَفْسَدَتْ شَيْئًا فَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 25,
        "matchingEnglishURN": 1266500,
        "last_updated": null
    },
    {
        "arabicURN": 1324240,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "14.00",
        "hadithNumber": "2333",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الْحُكْمِ فِيمَنْ كَسَرَ شَيْئًا ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَرِيكُ بْنُ عَبْدِ اللَّهِ، عَنْ قَيْسِ بْنِ وَهْبٍ، عَنْ رَجُلٍ، مِنْ بَنِي سُوَاءَةَ قَالَ قُلْتُ لِعَائِشَةَ أَخْبِرِينِي عَنْ خُلُقِ، رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَتْ أَوَمَا تَقْرَأُ الْقُرْآنَ ‏<A id=\"q2\" name=\"q2\" href=\"javascript:openquran(67,4,4)\"><c_q2>{وَإِنَّكَ لَعَلَى خُلُقٍ عَظِيمٍ}</c_q2></a>‏ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَعَ أَصْحَابِهِ فَصَنَعْتُ لَهُ طَعَامًا وَصَنَعَتْ حَفْصَةُ لَهُ طَعَامًا ‏.‏ قَالَتْ فَسَبَقَتْنِي حَفْصَةُ فَقُلْتُ لِلْجَارِيَةِ انْطَلِقِي فَأَكْفِئِي قَصْعَتَهَا فَلَحِقَتْهَا وَقَدْ هَوَتْ أَنْ تَضَعَ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَكْفَأَتْهَا فَانْكَسَرَتِ الْقَصْعَةُ وَانْتَشَرَ الطَّعَامُ ‏.‏ قَالَتْ فَجَمَعَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَمَا فِيهَا مِنَ الطَّعَامِ عَلَى النِّطَعِ فَأَكَلُوا ثُمَّ بَعَثَ بِقَصْعَتِي فَدَفَعَهَا إِلَى حَفْصَةَ فَقَالَ ‏\"‏ خُذُوا ظَرْفًا مَكَانَ ظَرْفِكُمْ ‏\"‏ ‏.‏ قَالَتْ فَمَا رَأَيْتُ ذَلِكَ فِي وَجْهِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 26,
        "matchingEnglishURN": 1266510,
        "last_updated": null
    },
    {
        "arabicURN": 1324250,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "14.00",
        "hadithNumber": "2334",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الْحُكْمِ فِيمَنْ كَسَرَ شَيْئًا ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم عِنْدَ إِحْدَى أُمَّهَاتِ الْمُؤْمِنِينَ فَأَرْسَلَتْ أُخْرَى بِقَصْعَةٍ فِيهَا طَعَامٌ فَضَرَبَتْ يَدَ الرَّسُولِ فَسَقَطَتِ الْقَصْعَةُ فَانْكَسَرَتْ فَأَخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْكِسْرَتَيْنِ فَضَمَّ إِحْدَاهُمَا إِلَى الأُخْرَى فَجَعَلَ يَجْمَعُ فِيهَا الطَّعَامَ وَيَقُولُ ‏\"‏ غَارَتْ أُمُّكُمْ كُلُوا ‏\"‏ ‏.‏ فَأَكَلُوا حَتَّى جَاءَتْ بِقَصْعَتِهَا الَّتِي فِي بَيْتِهَا فَدَفَعَ الْقَصْعَةَ الصَّحِيحَةَ إِلَى الرَّسُولِ وَتَرَكَ الْمَكْسُورَةَ فِي بَيْتِ الَّتِي كَسَرَتْهَا ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 27,
        "matchingEnglishURN": 1266520,
        "last_updated": null
    },
    {
        "arabicURN": 1324260,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "15.00",
        "hadithNumber": "2335",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الرَّجُلِ يَضَعُ خَشَبَةً عَلَى جِدَارِ جَارِهِ ",
        "hadithText": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا اسْتَأْذَنَ أَحَدَكُمْ جَارُهُ أَنْ يَغْرِزَ خَشَبَةً فِي جِدَارِهِ فَلاَ يَمْنَعْهُ ‏\"‏ ‏.‏ فَلَمَّا حَدَّثَهُمْ أَبُو هُرَيْرَةَ طَأْطَئُوا رُءُوسَهُمْ فَلَمَّا رَآهُمْ قَالَ مَالِي أَرَاكُمْ عَنْهَا مُعْرِضِينَ وَاللَّهِ لأَرْمِيَنَّ بِهَا بَيْنَ أَكْتَافِكُمْ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 28,
        "matchingEnglishURN": 1266530,
        "last_updated": null
    },
    {
        "arabicURN": 1324270,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "15.00",
        "hadithNumber": "2336",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الرَّجُلِ يَضَعُ خَشَبَةً عَلَى جِدَارِ جَارِهِ ",
        "hadithText": "حَدَّثَنَا أَبُو بِشْرٍ، بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، أَنَّ هِشَامَ بْنَ يَحْيَى، أَخْبَرَهُ أَنَّ عِكْرِمَةَ بْنَ سَلَمَةَ أَخْبَرَهُ أَنَّ أَخَوَيْنِ مِنْ بَلْمُغِيرَةَ أَعْتَقَ أَحَدُهُمَا أَنْ لاَ يَغْرِزَ خَشَبًا فِي جِدَارِهِ فَأَقْبَلَ مُجَمِّعُ بْنُ يَزِيدَ وَرِجَالٌ كَثِيرٌ مِنَ الأَنْصَارِ فَقَالُوا نَشْهَدُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَمْنَعْ أَحَدُكُمْ جَارَهُ أَنْ يَغْرِزَ خَشَبَةً فِي جِدَارِهِ ‏\"‏ ‏.‏ فَقَالَ يَا أَخِي إِنَّكَ مَقْضِيٌّ لَكَ عَلَىَّ وَقَدْ حَلَفْتُ فَاجْعَلْ أُسْطُوَانًا دُونَ حَائِطِي أَوْ جِدَارِي فَاجْعَلْ عَلَيْهِ خَشَبَكَ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 29,
        "matchingEnglishURN": 1266540,
        "last_updated": null
    },
    {
        "arabicURN": 1324280,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "15.00",
        "hadithNumber": "2337",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الرَّجُلِ يَضَعُ خَشَبَةً عَلَى جِدَارِ جَارِهِ ",
        "hadithText": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي ابْنُ لَهِيعَةَ، عَنْ أَبِي الأَسْوَدِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَمْنَعْ أَحَدُكُمْ جَارَهُ أَنْ يَضَعَ خَشَبَةً عَلَى جِدَارِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 30,
        "matchingEnglishURN": 1266550,
        "last_updated": null
    },
    {
        "arabicURN": 1324290,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "16.00",
        "hadithNumber": "2338",
        "bookName": " كتاب الأحكام ",
        "babName": " باب إِذَا تَشَاجَرُوا فِي قَدْرِ الطَّرِيقِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا مُثَنَّى بْنُ سَعِيدٍ الضُّبَعِيُّ، عَنْ قَتَادَةَ، عَنْ بَشِيرِ بْنِ كَعْبٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اجْعَلُوا الطَّرِيقَ سَبْعَةَ أَذْرُعٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 31,
        "matchingEnglishURN": 1266560,
        "last_updated": null
    },
    {
        "arabicURN": 1324300,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "16.00",
        "hadithNumber": "2339",
        "bookName": " كتاب الأحكام ",
        "babName": " باب إِذَا تَشَاجَرُوا فِي قَدْرِ الطَّرِيقِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، وَمُحَمَّدُ بْنُ عُمَرَ بْنِ هَيَّاجٍ، قَالاَ حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا اخْتَلَفْتُمْ فِي الطَّرِيقِ فَاجْعَلُوهُ سَبْعَةَ أَذْرُعٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 32,
        "matchingEnglishURN": 1266570,
        "last_updated": null
    },
    {
        "arabicURN": 1324310,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "17.00",
        "hadithNumber": "2340",
        "bookName": " كتاب الأحكام ",
        "babName": " باب مَنْ بَنَى فِي حَقِّهِ مَا يَضُرُّ بِجَارِهِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ رَبِّهِ بْنُ خَالِدٍ النُّمَيْرِيُّ أَبُو الْمُغَلِّسِ، حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، حَدَّثَنَا إِسْحَاقُ بْنُ يَحْيَى بْنِ الْوَلِيدِ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى أَنْ ‏\"‏ لاَ ضَرَرَ وَلاَ ضِرَارَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 33,
        "matchingEnglishURN": 1266580,
        "last_updated": null
    },
    {
        "arabicURN": 1324320,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "17.00",
        "hadithNumber": "2341",
        "bookName": " كتاب الأحكام ",
        "babName": " باب مَنْ بَنَى فِي حَقِّهِ مَا يَضُرُّ بِجَارِهِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا مَعْمَرٌ، عَنْ جَابِرٍ الْجُعْفِيِّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ ضَرَرَ وَلاَ ضِرَارَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 34,
        "matchingEnglishURN": 1266590,
        "last_updated": null
    },
    {
        "arabicURN": 1324330,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "17.00",
        "hadithNumber": "2342",
        "bookName": " كتاب الأحكام ",
        "babName": " باب مَنْ بَنَى فِي حَقِّهِ مَا يَضُرُّ بِجَارِهِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنْ لُؤْلُؤَةَ، عَنْ أَبِي صِرْمَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ ضَارَّ أَضَرَّ اللَّهُ بِهِ وَمَنْ شَاقَّ شَقَّ اللَّهُ عَلَيْهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 35,
        "matchingEnglishURN": 1266600,
        "last_updated": null
    },
    {
        "arabicURN": 1324340,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "18.00",
        "hadithNumber": "2343",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الرَّجُلاَنِ يَدَّعِيَانِ فِي خُصٍّ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، وَعَمَّارُ بْنُ خَالِدٍ الْوَاسِطِيُّ، قَالاَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنْ دَهْثَمِ بْنِ قُرَّانٍ، عَنْ نِمْرَانَ بْنِ جَارِيَةَ، عَنْ أَبِيهِ، أَنَّ قَوْمًا، اخْتَصَمُوا إِلَى النَّبِيِّ صلى الله عليه وسلم فِي خُصٍّ كَانَ بَيْنَهُمْ فَبَعَثَ حُذَيْفَةَ يَقْضِي بَيْنَهُمْ فَقَضَى لِلَّذِينَ يَلِيهِمُ الْقِمْطُ فَلَمَّا رَجَعَ إِلَى النَّبِيِّ صلى الله عليه وسلم أَخْبَرَهُ فَقَالَ ‏\"‏ أَصَبْتَ وَأَحْسَنْتَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 36,
        "matchingEnglishURN": 1266610,
        "last_updated": null
    },
    {
        "arabicURN": 1324350,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "19.00",
        "hadithNumber": "2344",
        "bookName": " كتاب الأحكام ",
        "babName": " باب مَنِ اشْتَرَطَ الْخَلاَصَ ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ، حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا بِيعَ الْبَيْعُ مِنْ رَجُلَيْنِ فَالْبَيْعُ لِلأَوَّلِ ‏\"‏ ‏.‏ قَالَ أَبُو الْوَلِيدِ فِي هَذَا الْحَدِيثِ إِبْطَالُ الْخَلاَصِ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 37,
        "matchingEnglishURN": 1266620,
        "last_updated": null
    },
    {
        "arabicURN": 1324360,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "20.00",
        "hadithNumber": "2345",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الْقَضَاءِ بِالْقُرْعَةِ ",
        "hadithText": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمُهَلَّبِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ رَجُلاً، كَانَ لَهُ سِتَّةُ مَمْلُوكِينَ لَيْسَ لَهُ مَالٌ غَيْرُهُمْ فَأَعْتَقَهُمْ عِنْدَ مَوْتِهِ فَجَزَّأَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَعْتَقَ اثْنَيْنِ وَأَرَقَّ أَرْبَعَةً ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 38,
        "matchingEnglishURN": 1266630,
        "last_updated": null
    },
    {
        "arabicURN": 1324370,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "20.00",
        "hadithNumber": "2346",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الْقَضَاءِ بِالْقُرْعَةِ ",
        "hadithText": "حَدَّثَنَا جَمِيلُ بْنُ الْحَسَنِ الْعَتَكِيُّ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ خِلاَسٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلَيْنِ، تَدَارَءَا فِي بَيْعٍ لَيْسَ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ فَأَمَرَهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَسْتَهِمَا عَلَى الْيَمِينِ أَحَبَّا ذَلِكَ أَمْ كَرِهَا ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 39,
        "matchingEnglishURN": 1266640,
        "last_updated": null
    },
    {
        "arabicURN": 1324380,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "20.00",
        "hadithNumber": "2347",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الْقَضَاءِ بِالْقُرْعَةِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ يَمَانٍ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا سَافَرَ أَقْرَعَ بَيْنَ نِسَائِهِ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 40,
        "matchingEnglishURN": 1266650,
        "last_updated": null
    },
    {
        "arabicURN": 1324390,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "20.00",
        "hadithNumber": "2348",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الْقَضَاءِ بِالْقُرْعَةِ ",
        "hadithText": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا الثَّوْرِيُّ، عَنْ صَالِحٍ الْهَمْدَانِيِّ، عَنِ الشَّعْبِيِّ، عَنْ عَبْدِ خَيْرٍ الْحَضْرَمِيِّ، عَنْ زَيْدِ بْنِ أَرْقَمَ، قَالَ أُتِيَ عَلِيُّ بْنُ أَبِي طَالِبٍ وَهُوَ بِالْيَمَنِ فِي ثَلاَثَةٍ قَدْ وَقَعُوا عَلَى امْرَأَةٍ فِي طُهْرٍ وَاحِدٍ فَسَأَلَ اثْنَيْنِ فَقَالَ أَتُقِرَّانِ لِهَذَا بِالْوَلَدِ فَقَالاَ لاَ ‏.‏ ثُمَّ سَأَلَ اثْنَيْنِ فَقَالَ أَتُقِرَّانِ لِهَذَا بِالْوَلَدِ فَقَالاَ لاَ ‏.‏ فَجَعَلَ كُلَّمَا سَأَلَ اثْنَيْنِ أَتُقِرَّانِ لِهَذَا بِالْوَلَدِ قَالاَ لاَ ‏.‏ فَأَقْرَعَ بَيْنَهُمْ وَأَلْحَقَ الْوَلَدَ بِالَّذِي أَصَابَتْهُ الْقُرْعَةُ وَجَعَلَ عَلَيْهِ ثُلُثَىِ الدِّيَةِ فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 41,
        "matchingEnglishURN": 1266660,
        "last_updated": null
    },
    {
        "arabicURN": 1324400,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "21.00",
        "hadithNumber": "2349",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الْقَافَةِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَهِشَامُ بْنُ عَمَّارٍ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ مَسْرُورًا وَهُوَ يَقُولُ ‏\"‏ يَا عَائِشَةُ أَلَمْ تَرَىْ أَنَّ مُجَزِّزًا الْمُدْلِجِيَّ دَخَلَ عَلَىَّ فَرَأَى أُسَامَةَ وَزَيْدًا عَلَيْهِمَا قَطِيفَةٌ قَدْ غَطَّيَا رُءُوسَهُمَا وَقَدْ بَدَتْ أَقْدَامُهُمَا فَقَالَ ‏\"‏ إِنَّ هَذِهِ الأَقْدَامَ بَعْضُهَا مِنْ بَعْضٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 42,
        "matchingEnglishURN": 1266670,
        "last_updated": null
    },
    {
        "arabicURN": 1324410,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "21.00",
        "hadithNumber": "2350",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الْقَافَةِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا إِسْرَائِيلُ، حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ قُرَيْشًا، أَتَوُا امْرَأَةً كَاهِنَةً فَقَالُوا لَهَا أَخْبِرِينَا أَشْبَهَنَا أَثَرًا بِصَاحِبِ الْمَقَامِ ‏.‏ فَقَالَتْ إِنْ أَنْتُمْ جَرَرْتُمْ كِسَاءً عَلَى هَذِهِ السِّهْلَةِ ثُمَّ مَشَيْتُمْ عَلَيْهَا أَنْبَأْتُكُمْ ‏.‏ قَالَ فَجَرُّوا كِسَاءً ثُمَّ مَشَى النَّاسُ عَلَيْهَا فَأَبْصَرَتْ أَثَرَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَقَالَتْ هَذَا أَقْرَبُكُمْ إِلَيْهِ شَبَهًا ‏.‏ ثُمَّ مَكَثُوا بَعْدَ ذَلِكَ عِشْرِينَ سَنَةً أَوْ مَا شَاءَ اللَّهُ ثُمَّ بَعَثَ اللَّهُ مُحَمَّدًا صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 43,
        "matchingEnglishURN": 1266680,
        "last_updated": null
    },
    {
        "arabicURN": 1324420,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "22.00",
        "hadithNumber": "2351",
        "bookName": " كتاب الأحكام ",
        "babName": " باب تَخْيِيرِ الصَّبِيِّ بَيْنَ أَبَوَيْهِ ",
        "hadithText": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ زِيَادِ بْنِ سَعْدٍ، عَنْ هِلاَلِ بْنِ أَبِي مَيْمُونَةَ، عَنْ أَبِي مَيْمُونَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَيَّرَ غُلاَمًا بَيْنَ أَبِيهِ وَأُمِّهِ وَقَالَ ‏\"‏ يَا غُلاَمُ هَذِهِ أُمُّكَ وَهَذَا أَبُوكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 44,
        "matchingEnglishURN": 1266690,
        "last_updated": null
    },
    {
        "arabicURN": 1324430,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "22.00",
        "hadithNumber": "2352",
        "bookName": " كتاب الأحكام ",
        "babName": " باب تَخْيِيرِ الصَّبِيِّ بَيْنَ أَبَوَيْهِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ عُثْمَانَ الْبَتِّيِّ، عَنْ عَبْدِ الْحَمِيدِ بْنِ سَلَمَةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ أَبَوَيْهِ، اخْتَصَمَا إِلَى النَّبِيِّ صلى الله عليه وسلم أَحَدُهُمَا كَافِرٌ وَالآخَرُ مُسْلِمٌ فَخَيَّرَهُ فَتَوَجَّهَ إِلَى الْكَافِرِ فَقَالَ ‏\"‏ اللَّهُمَّ اهْدِهِ ‏\"‏ ‏.‏ فَتَوَجَّهَ إِلَى الْمُسْلِمِ فَقَضَى لَهُ بِهِ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 45,
        "matchingEnglishURN": 1266700,
        "last_updated": null
    },
    {
        "arabicURN": 1324440,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "23.00",
        "hadithNumber": "2353",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الصُّلْحِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا كَثِيرُ بْنُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عَوْفٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ الصُّلْحُ جَائِزٌ بَيْنَ الْمُسْلِمِينَ إِلاَّ صُلْحًا حَرَّمَ حَلاَلاً أَوْ أَحَلَّ حَرَامًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 46,
        "matchingEnglishURN": 1266710,
        "last_updated": null
    },
    {
        "arabicURN": 1324450,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "24.00",
        "hadithNumber": "2354",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الْحَجْرِ عَلَى مَنْ يُفْسِدُ مَالَهُ ",
        "hadithText": "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَجُلاً، كَانَ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي عُقْدَتِهِ ضَعْفٌ وَكَانَ يُبَايِعُ وَأَنَّ أَهْلَهُ أَتَوُا النَّبِيَّ صلى الله عليه وسلم فَقَالُوا يَا رَسُولَ اللَّهِ احْجُرْ عَلَيْهِ ‏.‏ فَدَعَاهُ النَّبِيُّ صلى الله عليه وسلم فَنَهَاهُ عَنْ ذَلِكَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي لاَ أَصْبِرُ عَنِ الْبَيْعِ ‏.‏ فَقَالَ ‏\"‏ إِذَا بَايَعْتَ فَقُلْ هَا وَلاَ خِلاَبَةَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 47,
        "matchingEnglishURN": 1266720,
        "last_updated": null
    },
    {
        "arabicURN": 1324460,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "24.00",
        "hadithNumber": "2355",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الْحَجْرِ عَلَى مَنْ يُفْسِدُ مَالَهُ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانٍ، قَالَ هُوَ جَدِّي مُنْقِذُ بْنُ عَمْرٍو وَكَانَ رَجُلاً قَدْ أَصَابَتْهُ آمَّةٌ فِي رَأْسِهِ فَكَسَرَتْ لِسَانَهُ وَكَانَ لاَ يَدَعُ عَلَى ذَلِكَ التِّجَارَةَ وَكَانَ لاَ يَزَالُ يُغْبَنُ فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ فَقَالَ لَهُ ‏\"‏ إِذَا أَنْتَ بَايَعْتَ فَقُلْ لاَ خِلاَبَةَ ‏.‏ ثُمَّ أَنْتَ فِي كُلِّ سِلْعَةٍ ابْتَعْتَهَا بِالْخِيَارِ ثَلاَثَ لَيَالٍ فَإِنْ رَضِيتَ فَأَمْسِكْ وَإِنْ سَخِطْتَ فَارْدُدْهَا عَلَى صَاحِبِهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 48,
        "matchingEnglishURN": 1266730,
        "last_updated": null
    },
    {
        "arabicURN": 1324470,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "25.00",
        "hadithNumber": "2356",
        "bookName": " كتاب الأحكام ",
        "babName": " باب تَفْلِيسِ الْمُعْدَمِ وَالْبَيْعِ عَلَيْهِ لِغُرَمَائِهِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ أُصِيبَ رَجُلٌ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي ثِمَارٍ ابْتَاعَهَا فَكَثُرَ دَيْنُهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَصَدَّقُوا عَلَيْهِ ‏\"‏ ‏.‏ فَتَصَدَّقَ النَّاسُ عَلَيْهِ فَلَمْ يَبْلُغْ ذَلِكَ وَفَاءَ دَيْنِهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خُذُوا مَا وَجَدْتُمْ وَلَيْسَ لَكُمْ إِلاَّ ذَلِكَ ‏\"‏ ‏.‏ يَعْنِي الْغُرَمَاءَ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 49,
        "matchingEnglishURN": 1266740,
        "last_updated": null
    },
    {
        "arabicURN": 1324480,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "25.00",
        "hadithNumber": "2357",
        "bookName": " كتاب الأحكام ",
        "babName": " باب تَفْلِيسِ الْمُعْدَمِ وَالْبَيْعِ عَلَيْهِ لِغُرَمَائِهِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُسْلِمِ بْنِ هُرْمُزٍ، عَنْ سَلَمَةَ الْمَكِّيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَلَعَ مُعَاذَ بْنَ جَبَلٍ مِنْ غُرَمَائِهِ ثُمَّ اسْتَعْمَلَهُ عَلَى الْيَمَنِ فَقَالَ مُعَاذٌ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَخْلَصَنِي بِمَالِي ثُمَّ اسْتَعْمَلَنِي ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 50,
        "matchingEnglishURN": 1266750,
        "last_updated": null
    },
    {
        "arabicURN": 1324490,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "26.00",
        "hadithNumber": "2358",
        "bookName": " كتاب الأحكام ",
        "babName": " باب مَنْ وَجَدَ مَتَاعَهُ بِعَيْنِهِ عِنْدَ رَجُلٍ قَدْ أَفْلَسَ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، جَمِيعًا عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ وَجَدَ مَتَاعَهُ بِعَيْنِهِ عِنْدَ رَجُلٍ قَدْ أَفْلَسَ فَهُوَ أَحَقُّ بِهِ مِنْ غَيْرِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 51,
        "matchingEnglishURN": 1266760,
        "last_updated": null
    },
    {
        "arabicURN": 1324500,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "26.00",
        "hadithNumber": "2359",
        "bookName": " كتاب الأحكام ",
        "babName": " باب مَنْ وَجَدَ مَتَاعَهُ بِعَيْنِهِ عِنْدَ رَجُلٍ قَدْ أَفْلَسَ ",
        "hadithText": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ أَيُّمَا رَجُلٍ بَاعَ سِلْعَةً فَأَدْرَكَ سِلْعَتَهُ بِعَيْنِهَا عِنْدَ رَجُلٍ وَقَدْ أَفْلَسَ وَلَمْ يَكُنْ قَبَضَ مِنْ ثَمَنِهَا شَيْئًا فَهِيَ لَهُ ‏.‏ وَإِنْ كَانَ قَبَضَ مِنْ ثَمَنِهَا شَيْئًا فَهُوَ أُسْوَةُ الْغُرَمَاءِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 52,
        "matchingEnglishURN": 1266770,
        "last_updated": null
    },
    {
        "arabicURN": 1324510,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "26.00",
        "hadithNumber": "2360",
        "bookName": " كتاب الأحكام ",
        "babName": " باب مَنْ وَجَدَ مَتَاعَهُ بِعَيْنِهِ عِنْدَ رَجُلٍ قَدْ أَفْلَسَ ",
        "hadithText": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ، وَعَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، قَالاَ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنْ أَبِي الْمُعْتَمِرِ بْنِ عَمْرِو بْنِ رَافِعٍ، عَنِ ابْنِ خَلْدَةَ الزُّرَقِيِّ، وَكَانَ، قَاضِيًا بِالْمَدِينَةِ قَالَ جِئْنَا أَبَا هُرَيْرَةَ فِي صَاحِبٍ لَنَا قَدْ أَفْلَسَ فَقَالَ هَذَا الَّذِي قَضَى فِيهِ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَيُّمَا رَجُلٍ مَاتَ أَوْ أَفْلَسَ فَصَاحِبُ الْمَتَاعِ أَحَقُّ بِمَتَاعِهِ إِذَا وَجَدَهُ بِعَيْنِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 53,
        "matchingEnglishURN": 1266780,
        "last_updated": null
    },
    {
        "arabicURN": 1324520,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "26.00",
        "hadithNumber": "2361",
        "bookName": " كتاب الأحكام ",
        "babName": " باب مَنْ وَجَدَ مَتَاعَهُ بِعَيْنِهِ عِنْدَ رَجُلٍ قَدْ أَفْلَسَ ",
        "hadithText": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ، حَدَّثَنَا الْيَمَانُ بْنُ عَدِيٍّ، حَدَّثَنِي الزَّبِيدِيُّ، مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَيُّمَا امْرِئٍ مَاتَ وَعِنْدَهُ مَالُ امْرِئٍ بِعَيْنِهِ اقْتَضَى مِنْهُ شَيْئًا أَوْ لَمْ يَقْتَضِ فَهُوَ أُسْوَةُ الْغُرَمَاءِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 54,
        "matchingEnglishURN": 1266790,
        "last_updated": null
    },
    {
        "arabicURN": 1324530,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "27.00",
        "hadithNumber": "2362",
        "bookName": " كتاب الأحكام ",
        "babName": " باب كَرَاهِيَةِ الشَّهَادَةِ لِمَنْ لَمْ يُسْتَشْهَدْ ",
        "hadithText": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَعَمْرُو بْنُ رَافِعٍ، قَالاَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ السَّلْمَانِيِّ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَىُّ النَّاسِ خَيْرٌ قَالَ ‏\"‏ قَرْنِي ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ يَجِيءُ قَوْمٌ تَبْدُرُ شَهَادَةُ أَحَدِهِمْ يَمِينَهُ وَيَمِينُهُ شَهَادَتَهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 55,
        "matchingEnglishURN": 1266800,
        "last_updated": null
    },
    {
        "arabicURN": 1324540,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "27.00",
        "hadithNumber": "2363",
        "bookName": " كتاب الأحكام ",
        "babName": " باب كَرَاهِيَةِ الشَّهَادَةِ لِمَنْ لَمْ يُسْتَشْهَدْ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْجَرَّاحِ، حَدَّثَنَا جَرِيرٌ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ خَطَبَنَا عُمَرُ بْنُ الْخَطَّابِ بِالْجَابِيَةِ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ فِينَا مِثْلَ مُقَامِي فِيكُمْ فَقَالَ ‏\"‏ احْفَظُونِي فِي أَصْحَابِي ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ يَفْشُو الْكَذِبُ حَتَّى يَشْهَدَ الرَّجُلُ وَمَا يُسْتَشْهَدُ وَيَحْلِفَ وَمَا يُسْتَحْلَفُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 56,
        "matchingEnglishURN": 1266810,
        "last_updated": null
    },
    {
        "arabicURN": 1324550,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "28.00",
        "hadithNumber": "2364",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الرَّجُلِ عِنْدَهُ الشَّهَادَةُ لاَ يَعْلَمُ بِهَا صَاحِبُهَا ",
        "hadithText": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَمُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الْجُعْفِيُّ، قَالاَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ الْعُكْلِيُّ، أَخْبَرَنِي أُبَىُّ بْنُ عَبَّاسِ بْنِ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، حَدَّثَنِي أَبُو بَكْرِ بْنُ عَمْرِو بْنِ حَزْمٍ، حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عُثْمَانَ بْنِ عَفَّانَ، حَدَّثَنِي خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ، أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرَةَ الأَنْصَارِيُّ، أَنَّهُ سَمِعَ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ، يَقُولُ إِنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ خَيْرُ الشُّهُودِ مَنْ أَدَّى شَهَادَتَهُ قَبْلَ أَنْ يُسْأَلَهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 57,
        "matchingEnglishURN": 1266820,
        "last_updated": null
    },
    {
        "arabicURN": 1324560,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "29.00",
        "hadithNumber": "2365",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الإِشْهَادِ عَلَى الدُّيُونِ ",
        "hadithText": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ يُوسُفَ الْجُبَيْرِيُّ، وَجَمِيلُ بْنُ الْحَسَنِ الْعَتَكِيُّ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ مَرْوَانَ الْعِجْلِيُّ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي نَضْرَةَ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ تَلاَ هَذِهِ الآيَةَ ‏<A id=\"q3\" name=\"q3\" href=\"javascript:openquran(1,282,282)\"><c_q3>{‏يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا تَدَايَنْتُمْ بِدَيْنٍ إِلَى أَجَلٍ مُسَمًّى ‏}</c_q3></a>‏ حَتَّى بَلَغَ ‏<A id=\"q4\" name=\"q4\" href=\"javascript:openquran(1,283,283)\"><c_q4>{‏فَإِنْ أَمِنَ بَعْضُكُمْ بَعْضًا‏}</c_q4></a>‏ فَقَالَ هَذِهِ نَسَخَتْ مَا قَبْلَهَا ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 58,
        "matchingEnglishURN": 1266830,
        "last_updated": null
    },
    {
        "arabicURN": 1324570,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "30.00",
        "hadithNumber": "2366",
        "bookName": " كتاب الأحكام ",
        "babName": " باب مَنْ لاَ تَجُوزُ شَهَادَتُهُ ",
        "hadithText": "حَدَّثَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الرَّقِّيُّ، حَدَّثَنَا مَعْمَرُ بْنُ سُلَيْمَانَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالاَ حَدَّثَنَا حَجَّاجُ بْنُ أَرْطَاةَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَجُوزُ شَهَادَةُ خَائِنٍ وَلاَ خَائِنَةٍ وَلاَ مَحْدُودٍ فِي الإِسْلاَمِ وَلاَ ذِي غِمْرٍ عَلَى أَخِيهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 59,
        "matchingEnglishURN": 1266840,
        "last_updated": null
    },
    {
        "arabicURN": 1324580,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "30.00",
        "hadithNumber": "2367",
        "bookName": " كتاب الأحكام ",
        "babName": " باب مَنْ لاَ تَجُوزُ شَهَادَتُهُ ",
        "hadithText": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي نَافِعُ بْنُ يَزِيدَ، عَنِ ابْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ تَجُوزُ شَهَادَةُ بَدَوِيٍّ عَلَى صَاحِبِ قَرْيَةٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 60,
        "matchingEnglishURN": 1266850,
        "last_updated": null
    },
    {
        "arabicURN": 1324590,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "31.00",
        "hadithNumber": "2368",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الْقَضَاءِ بِالشَّاهِدِ وَالْيَمِينِ ",
        "hadithText": "حَدَّثَنَا أَبُو مُصْعَبٍ الْمَدِينِيُّ، أَحْمَدُ بْنُ عَبْدِ اللَّهِ الزُّهْرِيُّ وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ قَالاَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى بِالْيَمِينِ مَعَ الشَّاهِدِ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 61,
        "matchingEnglishURN": 1266860,
        "last_updated": null
    },
    {
        "arabicURN": 1324600,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "31.00",
        "hadithNumber": "2369",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الْقَضَاءِ بِالشَّاهِدِ وَالْيَمِينِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَضَى بِالْيَمِينِ مَعَ الشَّاهِدِ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 62,
        "matchingEnglishURN": 1266870,
        "last_updated": null
    },
    {
        "arabicURN": 1324610,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "31.00",
        "hadithNumber": "2370",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الْقَضَاءِ بِالشَّاهِدِ وَالْيَمِينِ ",
        "hadithText": "حَدَّثَنَا أَبُو إِسْحَاقَ الْهَرَوِيُّ، إِبْرَاهِيمُ بْنُ عَبْدِ اللَّهِ بْنِ حَاتِمٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ الْمَخْزُومِيُّ، حَدَّثَنَا سَيْفُ بْنُ سُلَيْمَانَ الْمَكِّيُّ، أَخْبَرَنِي قَيْسُ بْنُ سَعْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم بِالشَّاهِدِ وَالْيَمِينِ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 63,
        "matchingEnglishURN": 1266880,
        "last_updated": null
    },
    {
        "arabicURN": 1324620,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "31.00",
        "hadithNumber": "2371",
        "bookName": " كتاب الأحكام ",
        "babName": " باب الْقَضَاءِ بِالشَّاهِدِ وَالْيَمِينِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، - مَوْلَى الْمُنْبَعِثِ - عَنْ رَجُلٍ، مِنْ أَهْلِ مِصْرَ عَنْ سُرَّقٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَجَازَ شَهَادَةَ الرَّجُلِ وَيَمِينَ الطَّالِبِ ‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 64,
        "matchingEnglishURN": 1266890,
        "last_updated": null
    },
    {
        "arabicURN": 1324630,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "32.00",
        "hadithNumber": "2372",
        "bookName": " كتاب الأحكام ",
        "babName": " باب شَهَادَةِ الزُّورِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، حَدَّثَنَا سُفْيَانُ الْعُصْفُرِيُّ، عَنْ أَبِيهِ، عَنْ حَبِيبِ بْنِ النُّعْمَانِ الأَسَدِيِّ، عَنْ خُرَيْمِ بْنِ فَاتِكٍ الأَسَدِيِّ، قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم الصُّبْحَ فَلَمَّا انْصَرَفَ قَامَ قَائِمًا فَقَالَ ‏\"‏ عُدِلَتْ شَهَادَةُ الزُّورِ بِالإِشْرَاكِ بِاللَّهِ ‏\"‏ ‏.‏ ثَلاَثَ مَرَّاتٍ ثُمَّ تَلاَ هَذِهِ الآيَةَ ‏<A id=\"q5\" name=\"q5\" href=\"javascript:openquran(21,30,30)\"><c_q5>{‏وَاجْتَنِبُوا قَوْلَ الزُّورِ حُنَفَاءَ لِلَّهِ غَيْرَ مُشْرِكِينَ بِه‏}</c_q5></a>‏‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 65,
        "matchingEnglishURN": 1266900,
        "last_updated": null
    },
    {
        "arabicURN": 1324640,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "32.00",
        "hadithNumber": "2373",
        "bookName": " كتاب الأحكام ",
        "babName": " باب شَهَادَةِ الزُّورِ ",
        "hadithText": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ الْفُرَاتِ، عَنْ مُحَارِبِ بْنِ دِثَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏{‏لَنْ تَزُولَ قَدَمُ شَاهِدِ الزُّورِ حَتَّى يُوجِبَ اللَّهُ لَهُ النَّارَ‏}‏‏.‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 66,
        "matchingEnglishURN": 1266910,
        "last_updated": null
    },
    {
        "arabicURN": 1324650,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 13,
        "babNumber": "33.00",
        "hadithNumber": "2374",
        "bookName": " كتاب الأحكام ",
        "babName": " باب شَهَادَةِ أَهْلِ الْكِتَابِ بَعْضُهُمْ عَلَى بَعْضٍ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ مُجَالِدٍ، عَنْ عَامِرٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَجَازَ شَهَادَةَ أَهْلِ الْكِتَابِ بَعْضِهِمْ عَلَى بَعْضٍ ‏.‏ \n‏",
        "annotations": null,
        "bookID": "13.0",
        "grade1": null,
        "ourHadithNumber": 67,
        "matchingEnglishURN": 1266920,
        "last_updated": null
    }
]