[
    {
        "arabicURN": 1326080,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 19,
        "babNumber": "1.00",
        "hadithNumber": "2512",
        "bookName": " كتاب العتق ",
        "babName": " باب الْمُدَبَّرِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ ذصلى الله عليه وسلم بَاعَ الْمُدَبَّرَ ‏.‏",
        "annotations": null,
        "bookID": "19.0",
        "grade1": null,
        "ourHadithNumber": 1,
        "matchingEnglishURN": 1268300,
        "last_updated": null
    },
    {
        "arabicURN": 1326090,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 19,
        "babNumber": "1.00",
        "hadithNumber": "2513",
        "bookName": " كتاب العتق ",
        "babName": " باب الْمُدَبَّرِ ",
        "hadithText": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ دَبَّرَ رَجُلٌ مِنَّا غُلاَمًا وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ فَبَاعَهُ النَّبِيُّ صلى الله عليه وسلم فَاشْتَرَاهُ ابْنُ النَّحَّامِ رَجُلٌ مِنْ بَنِي عَدِيٍّ ‏.‏",
        "annotations": null,
        "bookID": "19.0",
        "grade1": null,
        "ourHadithNumber": 2,
        "matchingEnglishURN": 1268310,
        "last_updated": null
    },
    {
        "arabicURN": 1326100,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 19,
        "babNumber": "1.00",
        "hadithNumber": "2514",
        "bookName": " كتاب العتق ",
        "babName": " باب الْمُدَبَّرِ ",
        "hadithText": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ ظَبْيَانَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ الْمُدَبَّرُ مِنَ الثُّلُثِ ‏\"‏ ‏.‏ قَالَ ابْنُ مَاجَهْ سَمِعْتُ عُثْمَانَ - يَعْنِي ابْنَ أَبِي شَيْبَةَ - يَقُولُ هَذَا خَطَأٌ يَعْنِي حَدِيثَ ‏\"‏ الْمُدَبَّرُ مِنَ الثُّلُثِ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ لَيْسَ لَهُ أَصْلٌ ‏.‏",
        "annotations": null,
        "bookID": "19.0",
        "grade1": null,
        "ourHadithNumber": 3,
        "matchingEnglishURN": 1268320,
        "last_updated": null
    },
    {
        "arabicURN": 1326110,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 19,
        "babNumber": "2.00",
        "hadithNumber": "2515",
        "bookName": " كتاب العتق ",
        "babName": " باب أُمَّهَاتِ الأَوْلاَدِ ",
        "hadithText": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا شَرِيكٌ، عَنْ حُسَيْنِ بْنِ عَبْدِ اللَّهِ بْنِ عُبَيْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَيُّمَا رَجُلٍ وَلَدَتْ أَمَتُهُ مِنْهُ فَهِيَ مُعْتَقَةٌ عَنْ دُبُرٍ مِنْهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "19.0",
        "grade1": null,
        "ourHadithNumber": 4,
        "matchingEnglishURN": 1268330,
        "last_updated": null
    },
    {
        "arabicURN": 1326120,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 19,
        "babNumber": "2.00",
        "hadithNumber": "2516",
        "bookName": " كتاب العتق ",
        "babName": " باب أُمَّهَاتِ الأَوْلاَدِ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ يُوسُفَ، حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا أَبُو بَكْرٍ يَعْنِي النَّهْشَلِيَّ، عَنِ الْحُسَيْنِ بْنِ عَبْدِ اللَّهِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ ذُكِرَتْ أُمُّ إِبْرَاهِيمَ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَقَالَ ‏\"‏ أَعْتَقَهَا وَلَدُهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "19.0",
        "grade1": null,
        "ourHadithNumber": 5,
        "matchingEnglishURN": 1268340,
        "last_updated": null
    },
    {
        "arabicURN": 1326130,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 19,
        "babNumber": "2.00",
        "hadithNumber": "2517",
        "bookName": " كتاب العتق ",
        "babName": " باب أُمَّهَاتِ الأَوْلاَدِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، وَإِسْحَاقُ بْنُ مَنْصُورٍ، قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ كُنَّا نَبِيعُ سَرَارِينَا وَأُمَّهَاتِ أَوْلاَدِنَا وَالنَّبِيُّ صلى الله عليه وسلم فِينَا حَىٌّ لاَ نَرَى بِذَلِكَ بَأْسًا ‏.‏",
        "annotations": null,
        "bookID": "19.0",
        "grade1": null,
        "ourHadithNumber": 6,
        "matchingEnglishURN": 1268350,
        "last_updated": null
    },
    {
        "arabicURN": 1326140,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 19,
        "babNumber": "3.00",
        "hadithNumber": "2518",
        "bookName": " كتاب العتق ",
        "babName": " باب الْمُكَاتَبِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنِ ابْنِ عَجْلاَنَ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ثَلاَثَةٌ كُلُّهُمْ حَقٌّ عَلَى اللَّهِ عَوْنُهُ الْغَازِي فِي سَبِيلِ اللَّهِ وَالْمُكَاتَبُ الَّذِي يُرِيدُ الأَدَاءَ وَالنَّاكِحُ الَّذِي يُرِيدُ التَّعَفُّفَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "19.0",
        "grade1": null,
        "ourHadithNumber": 7,
        "matchingEnglishURN": 1268351,
        "last_updated": null
    },
    {
        "arabicURN": 1326150,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 19,
        "babNumber": "3.00",
        "hadithNumber": "2519",
        "bookName": " كتاب العتق ",
        "babName": " باب الْمُكَاتَبِ ",
        "hadithText": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَمُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ حَجَّاجٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَيُّمَا عَبْدٍ كُوتِبَ عَلَى مِائَةِ أُوقِيَّةٍ فَأَدَّاهَا إِلاَّ عَشْرَ أُوقِيَّاتٍ فَهُوَ رَقِيقٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "19.0",
        "grade1": null,
        "ourHadithNumber": 8,
        "matchingEnglishURN": 1268360,
        "last_updated": null
    },
    {
        "arabicURN": 1326160,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 19,
        "babNumber": "3.00",
        "hadithNumber": "2520",
        "bookName": " كتاب العتق ",
        "babName": " باب الْمُكَاتَبِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ نَبْهَانَ، - مَوْلَى أُمِّ سَلَمَةَ - عَنْ أُمِّ سَلَمَةَ، أَنَّهَا أَخْبَرَتْ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\"‏ إِذَا كَانَ لإِحْدَاكُنَّ مُكَاتَبٌ وَكَانَ عِنْدَهُ مَا يُؤَدِّي فَلْتَحْتَجِبْ مِنْهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "19.0",
        "grade1": null,
        "ourHadithNumber": 9,
        "matchingEnglishURN": 1268370,
        "last_updated": null
    },
    {
        "arabicURN": 1326170,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 19,
        "babNumber": "3.00",
        "hadithNumber": "2521",
        "bookName": " كتاب العتق ",
        "babName": " باب الْمُكَاتَبِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ بَرِيرَةَ أَتَتْهَا وَهِيَ مُكَاتَبَةٌ قَدْ كَاتَبَهَا أَهْلُهَا عَلَى تِسْعِ أَوَاقٍ فَقَالَتْ لَهَا إِنْ شَاءَ أَهْلُكِ عَدَدْتُ لَهُمْ عَدَّةً وَاحِدَةً وَكَانَ الْوَلاَءُ لِي قَالَ فَأَتَتْ أَهْلَهَا فَذَكَرَتْ ذَلِكَ لَهُمْ فَأَبَوْا إِلاَّ أَنْ تَشْتَرِطَ الْوَلاَءَ لَهُمْ فَذَكَرَتْ عَائِشَةُ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ افْعَلِي ‏\"‏ ‏.‏ قَالَتْ فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَخَطَبَ النَّاسَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\"‏ مَا بَالُ رِجَالٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ كُلُّ شَرْطٍ لَيْسَ فِي كِتَابِ اللَّهِ فَهُوَ بَاطِلٌ وَإِنْ كَانَ مِائَةَ شَرْطٍ كِتَابُ اللَّهِ أَحَقُّ وَشَرْطُ اللَّهِ أَوْثَقُ وَالْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "19.0",
        "grade1": null,
        "ourHadithNumber": 10,
        "matchingEnglishURN": 1268380,
        "last_updated": null
    },
    {
        "arabicURN": 1326180,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 19,
        "babNumber": "4.00",
        "hadithNumber": "2522",
        "bookName": " كتاب العتق ",
        "babName": " باب الْعِتْقِ ",
        "hadithText": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ شُرَحْبِيلَ بْنِ السِّمْطِ، قَالَ قُلْتُ لِكَعْبٍ يَا كَعْبَ بْنَ مُرَّةَ حَدِّثْنَا عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَاحْذَرْ ‏.‏ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنْ أَعْتَقَ امْرَأً مُسْلِمًا كَانَ فِكَاكَهُ مِنَ النَّارِ يُجْزِئُ بِكُلِّ عَظْمٍ مِنْهُ عَظْمٌ مِنْهُ وَمَنْ أَعْتَقَ امْرَأَتَيْنِ مُسْلِمَتَيْنِ كَانَتَا فِكَاكَهُ مِنَ النَّارِ يُجْزِئُ بِكُلِّ عَظْمَيْنِ مِنْهُمَا عَظْمٌ مِنْهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "19.0",
        "grade1": null,
        "ourHadithNumber": 11,
        "matchingEnglishURN": 1268390,
        "last_updated": null
    },
    {
        "arabicURN": 1326190,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 19,
        "babNumber": "4.00",
        "hadithNumber": "2523",
        "bookName": " كتاب العتق ",
        "babName": " باب الْعِتْقِ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ أَبِي مُرَاوِحٍ، عَنْ أَبِي ذَرٍّ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَىُّ الرِّقَابِ أَفْضَلُ قَالَ ‏\"‏ أَنْفَسُهَا عِنْدَ أَهْلِهَا وَأَغْلاَهَا ثَمَنًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "19.0",
        "grade1": null,
        "ourHadithNumber": 12,
        "matchingEnglishURN": 1268400,
        "last_updated": null
    },
    {
        "arabicURN": 1326200,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 19,
        "babNumber": "5.00",
        "hadithNumber": "2524",
        "bookName": " كتاب العتق ",
        "babName": " باب مَنْ مَلَكَ ذَا رَحِمٍ مَحْرَمٍ فَهُوَ حُرٌّ ",
        "hadithText": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ، وَإِسْحَاقُ بْنُ مَنْصُورٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ قَتَادَةَ، وَعَاصِمٍ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ مَلَكَ ذَا رَحِمٍ مَحْرَمٍ فَهُوَ حُرٌّ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "19.0",
        "grade1": null,
        "ourHadithNumber": 13,
        "matchingEnglishURN": 1268410,
        "last_updated": null
    },
    {
        "arabicURN": 1326210,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 19,
        "babNumber": "5.00",
        "hadithNumber": "2525",
        "bookName": " كتاب العتق ",
        "babName": " باب مَنْ مَلَكَ ذَا رَحِمٍ مَحْرَمٍ فَهُوَ حُرٌّ ",
        "hadithText": "حَدَّثَنَا رَاشِدُ بْنُ سَعِيدٍ الرَّمْلِيُّ، وَعُبَيْدُ اللَّهِ بْنُ الْجَهْمِ الأَنْمَاطِيُّ، قَالاَ حَدَّثَنَا ضَمْرَةُ بْنُ رَبِيعَةَ، عَنْ سُفْيَانَ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ مَلَكَ ذَا رَحِمٍ مَحْرَمٍ فَهُوَ حُرٌّ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "19.0",
        "grade1": null,
        "ourHadithNumber": 14,
        "matchingEnglishURN": 1268420,
        "last_updated": null
    },
    {
        "arabicURN": 1326220,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 19,
        "babNumber": "6.00",
        "hadithNumber": "2526",
        "bookName": " كتاب العتق ",
        "babName": " باب مَنْ أَعْتَقَ عَبْدًا وَاشْتَرَطَ خِدْمَتَهُ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُعَاوِيَةَ الْجُمَحِيُّ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ سَعِيدِ بْنِ جُمْهَانَ، عَنْ سَفِينَةَ أَبِي عَبْدِ الرَّحْمَنِ، قَالَ أَعْتَقَتْنِي أُمُّ سَلَمَةَ وَاشْتَرَطَتْ عَلَىَّ أَنْ أَخْدُمَ النَّبِيَّ صلى الله عليه وسلم مَا عَاشَ ‏.‏",
        "annotations": null,
        "bookID": "19.0",
        "grade1": null,
        "ourHadithNumber": 15,
        "matchingEnglishURN": 1268430,
        "last_updated": null
    },
    {
        "arabicURN": 1326230,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 19,
        "babNumber": "7.00",
        "hadithNumber": "2527",
        "bookName": " كتاب العتق ",
        "babName": " باب مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ  ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، وَمُحَمَّدُ بْنُ بِشْرٍ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَعْتَقَ نَصِيبًا لَهُ فِي مَمْلُوكٍ أَوْ شِقْصًا فَعَلَيْهِ خَلاَصُهُ مِنْ مَالِهِ إِنْ كَانَ لَهُ مَالٌ فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ اسْتُسْعِيَ الْعَبْدُ فِي قِيمَتِهِ غَيْرَ مَشْقُوقٍ عَلَيْهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "19.0",
        "grade1": null,
        "ourHadithNumber": 16,
        "matchingEnglishURN": 1268440,
        "last_updated": null
    },
    {
        "arabicURN": 1326240,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 19,
        "babNumber": "7.00",
        "hadithNumber": "2528",
        "bookName": " كتاب العتق ",
        "babName": " باب مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ  ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ أُقِيمَ عَلَيْهِ بِقِيمَةِ عَدْلٍ فَأَعْطَى شُرَكَاءَهُ حِصَصَهُمْ إِنْ كَانَ لَهُ مِنَ الْمَالِ مَا يَبْلُغُ ثَمَنَهُ وَعَتَقَ عَلَيْهِ الْعَبْدُ وَإِلاَّ فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "19.0",
        "grade1": null,
        "ourHadithNumber": 17,
        "matchingEnglishURN": 1268450,
        "last_updated": null
    },
    {
        "arabicURN": 1326250,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 19,
        "babNumber": "8.00",
        "hadithNumber": "2529",
        "bookName": " كتاب العتق ",
        "babName": " باب مَنْ أَعْتَقَ عَبْدًا وَلَهُ مَالٌ  ",
        "hadithText": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي ابْنُ لَهِيعَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، جَمِيعًا عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ، عَنْ بُكَيْرِ بْنِ الأَشَجِّ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَعْتَقَ عَبْدًا وَلَهُ مَالٌ فَمَالُ الْعَبْدِ لَهُ إِلاَّ أَنْ يَشْتَرِطَ السَّيِّدُ مَالَهُ فَيَكُونَ لَهُ ‏\"‏ ‏.‏ وَقَالَ ابْنُ لَهِيعَةَ إِلاَّ أَنْ يَسْتَثْنِيَهُ السَّيِّدُ ‏.‏",
        "annotations": null,
        "bookID": "19.0",
        "grade1": null,
        "ourHadithNumber": 18,
        "matchingEnglishURN": 1268460,
        "last_updated": null
    },
    {
        "arabicURN": 1326280,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 19,
        "babNumber": "9.00",
        "hadithNumber": "2531",
        "bookName": " كتاب العتق ",
        "babName": " باب عِتْقِ وَلَدِ الزِّنَا  ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ زَيْدِ بْنِ جُبَيْرٍ، عَنْ أَبِي يَزِيدَ الضِّنِّيِّ، عَنْ مَيْمُونَةَ بِنْتِ سَعْدٍ، - مَوْلاَةِ النَّبِيِّ صلى الله عليه وسلم - أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنْ وَلَدِ الزِّنَا فَقَالَ ‏\"‏ نَعْلاَنِ أُجَاهِدُ فِيهِمَا خَيْرٌ مِنْ أَنْ أُعْتِقَ وَلَدَ الزِّنَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "19.0",
        "grade1": null,
        "ourHadithNumber": 20,
        "matchingEnglishURN": 1268480,
        "last_updated": null
    },
    {
        "arabicURN": 1326290,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 19,
        "babNumber": "10.00",
        "hadithNumber": "2532",
        "bookName": " كتاب العتق ",
        "babName": " باب مَنْ أَرَادَ عِتْقَ عَبْدِهِ وَامْرَأَتِهِ فَلْيَبْدَأْ بِالرَّجُلِ  ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلاَنِيُّ، وَإِسْحَاقُ بْنُ مَنْصُورٍ، قَالاَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، أَنَّهَا كَانَ لَهَا غُلاَمٌ وَجَارِيَةٌ زَوْجٌ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي أُرِيدُ أَنْ أُعْتِقَهُمَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنْ أَعْتَقْتِهِمَا فَابْدَئِي بِالرَّجُلِ قَبْلَ الْمَرْأَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "19.0",
        "grade1": null,
        "ourHadithNumber": 21,
        "matchingEnglishURN": 1268490,
        "last_updated": null
    },
    {
        "arabicURN": 1326271,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 19,
        "babNumber": "8.00",
        "hadithNumber": "2530",
        "bookName": " كتاب العتق ",
        "babName": " باب مَنْ أَعْتَقَ عَبْدًا وَلَهُ مَالٌ  ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا سَعِيدُ بْنُ مُحَمَّدٍ الْجَرْمِيُّ، حَدَّثَنَا الْمُطَّلِبُ بْنُ زِيَادٍ، عَنْ إِسْحَاقَ بْنِ إِبْرَاهِيمَ، عَنْ جَدِّهِ، عُمَيْرٍ - وَهُوَ مَوْلَى ابْنِ مَسْعُودٍ - أَنَّ عَبْدَ اللَّهِ، قَالَ لَهُ يَا عُمَيْرُ إِنِّي أُعْتِقُكَ عِتْقًا هَنِيئًا إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ أَيُّمَا رَجُلٍ أَعْتَقَ غُلاَمًا وَلَمْ يُسَمِّ مَالَهُ فَالْمَالُ لَهُ ‏\"‏ ‏.‏ فَأَخْبِرْنِي مَا مَالُكَ ‏.‏ <br><p>\n\n<p> حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا الْمُطَّلِبُ بْنُ زِيَادٍ، عَنْ إِسْحَاقَ بْنِ إِبْرَاهِيمَ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ لِجَدِّي فَذَكَرَ نَحْوَهُ ‏.‏",
        "annotations": null,
        "bookID": "19.0",
        "grade1": null,
        "ourHadithNumber": 19,
        "matchingEnglishURN": 1268470,
        "last_updated": null
    }
]