[
    {
        "arabicURN": 1327130,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "1.00",
        "hadithNumber": "2615",
        "bookName": " كتاب الديات ",
        "babName": " باب التَّغْلِيظِ فِي قَتْلِ مُسْلِمٍ ظُلْمًا ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَعَلِيُّ بْنُ مُحَمَّدٍ، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالُوا حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَوَّلُ مَا يُقْضَى بَيْنَ النَّاسِ يَوْمَ الْقِيَامَةِ فِي الدِّمَاءِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 1,
        "matchingEnglishURN": 1269320,
        "last_updated": null
    },
    {
        "arabicURN": 1327140,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "1.00",
        "hadithNumber": "2616",
        "bookName": " كتاب الديات ",
        "babName": " باب التَّغْلِيظِ فِي قَتْلِ مُسْلِمٍ ظُلْمًا ",
        "hadithText": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الأَعْمَشُ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تُقْتَلُ نَفْسٌ ظُلْمًا إِلاَّ كَانَ عَلَى ابْنِ آدَمَ الأَوَّلِ كِفْلٌ مِنْ دَمِهَا لأَنَّهُ أَوَّلُ مَنْ سَنَّ الْقَتْلَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 2,
        "matchingEnglishURN": 1269330,
        "last_updated": null
    },
    {
        "arabicURN": 1327150,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "1.00",
        "hadithNumber": "2617",
        "bookName": " كتاب الديات ",
        "babName": " باب التَّغْلِيظِ فِي قَتْلِ مُسْلِمٍ ظُلْمًا ",
        "hadithText": "حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنِ الأَزْهَرِ الْوَاسِطِيُّ، حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ الأَزْرَقُ، عَنْ شَرِيكٍ، عَنْ عَاصِمٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَوَّلُ مَا يُقْضَى بَيْنَ النَّاسِ يَوْمَ الْقِيَامَةِ فِي الدِّمَاءِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 3,
        "matchingEnglishURN": 1269340,
        "last_updated": null
    },
    {
        "arabicURN": 1327160,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "1.00",
        "hadithNumber": "2618",
        "bookName": " كتاب الديات ",
        "babName": " باب التَّغْلِيظِ فِي قَتْلِ مُسْلِمٍ ظُلْمًا ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَائِذٍ، عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ لَقِيَ اللَّهَ لاَ يُشْرِكُ بِهِ شَيْئًا لَمْ يَتَنَدَّ بِدَمٍ حَرَامٍ دَخَلَ الْجَنَّةَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 4,
        "matchingEnglishURN": 1269350,
        "last_updated": null
    },
    {
        "arabicURN": 1327170,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "1.00",
        "hadithNumber": "2619",
        "bookName": " كتاب الديات ",
        "babName": " باب التَّغْلِيظِ فِي قَتْلِ مُسْلِمٍ ظُلْمًا ",
        "hadithText": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا مَرْوَانُ بْنُ جَنَاحٍ، عَنْ أَبِي الْجَهْمِ الْجُوزَجَانِيِّ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لَزَوَالُ الدُّنْيَا أَهْوَنُ عَلَى اللَّهِ مِنْ قَتْلِ مُؤْمِنٍ بِغَيْرِ حَقٍّ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 5,
        "matchingEnglishURN": 1269360,
        "last_updated": null
    },
    {
        "arabicURN": 1327180,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "1.00",
        "hadithNumber": "2620",
        "bookName": " كتاب الديات ",
        "babName": " باب التَّغْلِيظِ فِي قَتْلِ مُسْلِمٍ ظُلْمًا ",
        "hadithText": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، حَدَّثَنَا يَزِيدُ بْنُ زِيَادٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَعَانَ عَلَى قَتْلِ مُؤْمِنٍ بِشَطْرِ كَلِمَةٍ لَقِيَ اللَّهَ عَزَّ وَجَلَّ مَكْتُوبٌ بَيْنَ عَيْنَيْهِ آيِسٌ مِنْ رَحْمَةِ اللَّهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 6,
        "matchingEnglishURN": 1269370,
        "last_updated": null
    },
    {
        "arabicURN": 1327190,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "2.00",
        "hadithNumber": "2621",
        "bookName": " كتاب الديات ",
        "babName": " باب هَلْ لِقَاتِلِ مُؤْمِنٍ تَوْبَةٌ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمَّارٍ الدُّهْنِيِّ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، قَالَ سُئِلَ ابْنُ عَبَّاسٍ عَمَّنْ قَتَلَ مُؤْمِنًا مُتَعَمِّدًا ثُمَّ تَابَ وَآمَنَ وَعَمِلَ صَالِحًا ثُمَّ اهْتَدَى ‏.‏ قَالَ وَيْحَهُ وَأَنَّى لَهُ الْهُدَى سَمِعْتُ نَبِيَّكُمْ صلى الله عليه وسلم يَقُولُ ‏\"‏ يَجِيءُ الْقَاتِلُ وَالْمَقْتُولُ يَوْمَ الْقِيَامَةِ مُتَعَلِّقٌ بِرَأْسِ صَاحِبِهِ يَقُولُ رَبِّ سَلْ هَذَا لِمَ قَتَلَنِي ‏\"‏ ‏.‏ وَاللَّهِ لَقَدْ أَنْزَلَهَا اللَّهُ عَزَّ وَجَلَّ عَلَى نَبِيِّكُمْ ثُمَّ مَا نَسَخَهَا بَعْدَ مَا أَنْزَلَهَا ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 7,
        "matchingEnglishURN": 1269380,
        "last_updated": null
    },
    {
        "arabicURN": 1327240,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "3.00",
        "hadithNumber": "2623",
        "bookName": " كتاب الديات ",
        "babName": " باب مَنْ قُتِلَ لَهُ قَتِيلٌ فَهُوَ بِالْخِيَارِ بَيْنَ إِحْدَى ثَلاَثٍ ",
        "hadithText": "حَدَّثَنَا عُثْمَانُ، وَأَبُو بَكْرٍ ابْنَا أَبِي شَيْبَةَ قَالاَ حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، ح وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، قَالَ حَدَّثَنَا جَرِيرٌ، وَعَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، جَمِيعًا عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنِ الْحَارِثِ بْنِ فُضَيْلٍ، أَظُنُّهُ عَنِ ابْنِ أَبِي الْعَوْجَاءِ، وَاسْمُهُ، سُفْيَانُ عَنْ أَبِي شُرَيْحٍ الْخُزَاعِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أُصِيبَ بِدَمٍ أَوْ خَبْلٍ - وَالْخَبْلُ الْجُرْحُ - فَهُوَ بِالْخِيَارِ بَيْنَ إِحْدَى ثَلاَثٍ فَإِنْ أَرَادَ الرَّابِعَةَ فَخُذُوا عَلَى يَدَيْهِ أَنْ يَقْتُلَ أَوْ يَعْفُوَ أَوْ يَأْخُذَ الدِّيَةَ فَمَنْ فَعَلَ شَيْئًا مِنْ ذَلِكَ فَعَادَ فَإِنَّ لَهُ نَارَ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 9,
        "matchingEnglishURN": 1269400,
        "last_updated": null
    },
    {
        "arabicURN": 1327250,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "3.00",
        "hadithNumber": "2624",
        "bookName": " كتاب الديات ",
        "babName": " باب مَنْ قُتِلَ لَهُ قَتِيلٌ فَهُوَ بِالْخِيَارِ بَيْنَ إِحْدَى ثَلاَثٍ ",
        "hadithText": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، حَدَّثَنَا الْوَلِيدُ، حَدَّثَنَا الأَوْزَاعِيُّ، حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ قُتِلَ لَهُ قَتِيلٌ فَهُوَ بِخَيْرِ النَّظَرَيْنِ إِمَّا أَنْ يَقْتُلَ وَإِمَّا أَنْ يُفْدَى ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 10,
        "matchingEnglishURN": 1269410,
        "last_updated": null
    },
    {
        "arabicURN": 1327260,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "4.00",
        "hadithNumber": "2625",
        "bookName": " كتاب الديات ",
        "babName": " باب مَنْ قَتَلَ عَمْدًا فَرَضُوا بِالدِّيَةِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ زَيْدِ بْنِ ضُمَيْرَةَ، حَدَّثَنِي أَبِي وَعَمِّي، وَكَانَا، شَهِدَا حُنَيْنًا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالاَ صَلَّى النَّبِيُّ صلى الله عليه وسلم الظُّهْرَ ثُمَّ جَلَسَ تَحْتَ شَجَرَةٍ فَقَامَ إِلَيْهِ الأَقْرَعُ بْنُ حَابِسٍ - وَهُوَ سَيِّدُ خِنْدِفَ يَرُدُّ - عَنْ دَمِ مُحَلِّمِ بْنِ جَثَّامَةَ وَقَامَ عُيَيْنَةُ بْنُ حِصْنٍ يَطْلُبُ بِدَمِ عَامِرِ بْنِ الأَضْبَطِ وَكَانَ أَشْجَعِيًّا فَقَالَ لَهُمُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ تَقْبَلُونَ الدِّيَةَ ‏\"‏ ‏.‏ فَأَبَوْا فَقَامَ رَجُلٌ مِنْ بَنِي لَيْثٍ يُقَالُ لَهُ مُكَيْتِلٌ فَقَالَ يَا رَسُولَ اللَّهِ وَاللَّهِ مَا شَبَّهْتُ هَذَا الْقَتِيلَ فِي غُرَّةِ الإِسْلاَمِ إِلاَّ كَغَنَمٍ وَرَدَتْ فَرُمِيَتْ فَنَفَرَ آخِرُهَا ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَكُمْ خَمْسُونَ فِي سَفَرِنَا وَخَمْسُونَ إِذَا رَجَعْنَا ‏\"‏ ‏.‏ فَقَبِلُوا الدِّيَةَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 11,
        "matchingEnglishURN": 1269420,
        "last_updated": null
    },
    {
        "arabicURN": 1327270,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "4.00",
        "hadithNumber": "2626",
        "bookName": " كتاب الديات ",
        "babName": " باب مَنْ قَتَلَ عَمْدًا فَرَضُوا بِالدِّيَةِ ",
        "hadithText": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ الدِّمَشْقِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ، عَنْ سُلَيْمَانَ بْنِ مُوسَى، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ قَتَلَ عَمْدًا دُفِعَ إِلَى أَوْلِيَاءِ الْقَتِيلِ فَإِنْ شَاءُوا قَتَلُوا وَإِنْ شَاءُوا أَخَذُوا الدِّيَةَ وَذَلِكَ ثَلاَثُونَ حِقَّةً وَثَلاَثُونَ جَذَعَةً وَأَرْبَعُونَ خَلِفَةً وَذَلِكَ عَقْلُ الْعَمْدِ مَا صُولِحُوا عَلَيْهِ فَهُوَ لَهُمْ وَذَلِكَ تَشْدِيدُ الْعَقْلِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 12,
        "matchingEnglishURN": 1269430,
        "last_updated": null
    },
    {
        "arabicURN": 1327300,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "5.00",
        "hadithNumber": "2628",
        "bookName": " كتاب الديات ",
        "babName": " باب دِيَةِ شِبْهِ الْعَمْدِ مُغَلَّظَةً ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الزُّهْرِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ جُدْعَانَ، سَمِعَهُ مِنَ الْقَاسِمِ بْنِ رَبِيعَةَ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ يَوْمَ فَتْحِ مَكَّةَ وَهُوَ عَلَى دَرَجِ الْكَعْبَةِ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ فَقَالَ ‏\"‏ الْحَمْدُ لِلَّهِ الَّذِي صَدَقَ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الأَحْزَابَ وَحْدَهُ أَلاَ إِنَّ قَتِيلَ الْخَطَإِ قَتِيلَ السَّوْطِ وَالْعَصَا فِيهِ مِائَةٌ مِنَ الإِبِلِ مِنْهَا أَرْبَعُونَ خَلِفَةً فِي بُطُونِهَا أَوْلاَدُهَا أَلاَ إِنَّ كَلَّ مَأْثُرَةٍ كَانَتْ فِي الْجَاهِلِيَّةِ وَدَمٍ تَحْتَ قَدَمَىَّ هَاتَيْنِ إِلاَّ مَا كَانَ مِنْ سِدَانَةِ الْبَيْتِ وَسِقَايَةِ الْحَاجِّ أَلاَ إِنِّي قَدْ أَمْضَيْتُهُمَا لأَهْلِهِمَا كَمَا كَانَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 14,
        "matchingEnglishURN": 1269450,
        "last_updated": null
    },
    {
        "arabicURN": 1327310,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "6.00",
        "hadithNumber": "2629",
        "bookName": " كتاب الديات ",
        "babName": "باب دِيَةِ الْخَطَإِ\t",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُعَاذُ بْنُ هَانِئٍ، حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ جَعَلَ الدِّيَةَ اثْنَىْ عَشَرَ أَلْفًا ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 15,
        "matchingEnglishURN": 1269460,
        "last_updated": null
    },
    {
        "arabicURN": 1327320,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "6.00",
        "hadithNumber": "2630",
        "bookName": " كتاب الديات ",
        "babName": " باب دِيَةِ الْخَطَإِ ",
        "hadithText": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ الْمَرْوَزِيُّ، أَنْبَأَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا مُحَمَّدُ بْنُ رَاشِدٍ، عَنْ سُلَيْمَانَ بْنِ مُوسَى، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ قُتِلَ خَطَأً فَدِيَتُهُ مِنَ الإِبِلِ ثَلاَثُونَ بِنْتَ مَخَاضٍ وَثَلاَثُونَ ابْنَةَ لَبُونٍ وَثَلاَثُونَ حِقَّةً وَعَشَرَةُ بَنِي لَبُونٍ ‏\"‏ ‏.‏ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُقَوِّمُهَا عَلَى أَهْلِ الْقُرَى أَرْبَعَمِائَةِ دِينَارٍ أَوْ عَدْلَهَا مِنَ الْوَرِقِ وَيُقَوِّمُهَا عَلَى أَزْمَانِ الإِبِلِ إِذَا غَلَتْ رَفَعَ فِي ثَمَنِهَا وَإِذَا هَانَتْ نَقَصَ مِنْ ثَمَنِهَا عَلَى نَحْوِ الزَّمَانِ مَا كَانَ فَبَلَغَ قِيمَتُهَا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم مَا بَيْنَ الأَرْبَعِمِائَةِ دِينَارٍ إِلَى ثَمَانِمِائَةِ دِينَارٍ أَوْ عَدْلُهَا مِنَ الْوَرِقِ ثَمَانِيَةُ آلاَفِ دِرْهَمٍ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَّ مَنْ كَانَ عَقْلُهُ فِي الْبَقَرِ عَلَى أَهْلِ الْبَقَرِ مِائَتَىْ بَقَرَةٍ وَمَنْ كَانَ عَقْلُهُ فِي الشَّاءِ عَلَى أَهْلِ الشَّاءِ أَلْفَىْ شَاةٍ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 16,
        "matchingEnglishURN": 1269470,
        "last_updated": null
    },
    {
        "arabicURN": 1327330,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "6.00",
        "hadithNumber": "2631",
        "bookName": " كتاب الديات ",
        "babName": " باب دِيَةِ الْخَطَإِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ السَّلاَمِ بْنُ عَاصِمٍ، حَدَّثَنَا الصَّبَّاحُ بْنُ مُحَارِبٍ، حَدَّثَنَا حَجَّاجُ بْنُ أَرْطَاةَ، حَدَّثَنَا زَيْدُ بْنُ جُبَيْرٍ، عَنْ خِشْفِ بْنِ مَالِكٍ الطَّائِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فِي دِيَةِ الْخَطَإِ عِشْرُونَ حِقَّةً وَعِشْرُونَ جَذَعَةً وَعِشْرُونَ بِنْتَ مَخَاضٍ وَعِشْرُونَ بِنْتَ لَبُونٍ وَعِشْرُونَ بَنِي مَخَاضٍ ذُكُورٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 17,
        "matchingEnglishURN": 1269480,
        "last_updated": null
    },
    {
        "arabicURN": 1327340,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "6.00",
        "hadithNumber": "2632",
        "bookName": " كتاب الديات ",
        "babName": " باب دِيَةِ الْخَطَإِ ",
        "hadithText": "حَدَّثَنَا الْعَبَّاسُ بْنُ جَعْفَرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم جَعَلَ الدِّيَةَ اثْنَىْ عَشَرَ أَلْفًا قَالَ ذَلِكَ قَوْلُهُ ‏<A id=\"q1\" name=\"q1\" href=\"javascript:openquran(8,74,74)\"><c_q1>{وَمَا نَقَمُوا إِلاَّ أَنْ أَغْنَاهُمُ اللَّهُ وَرَسُولُهُ مِنْ فَضْلِهِ}</c_q1></a>‏ قَالَ بِأَخْذِهِمُ الدِّيَةَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 18,
        "matchingEnglishURN": 1269490,
        "last_updated": null
    },
    {
        "arabicURN": 1327350,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "7.00",
        "hadithNumber": "2633",
        "bookName": " كتاب الديات ",
        "babName": " باب الدِّيَةِ عَلَى الْعَاقِلَةِ فَإِنْ لَمْ تَكُنْ لَهُ عَاقِلَةٌ فَفِي بَيْتِ الْمَالِ ",
        "hadithText": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا أَبِي، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عُبَيْدِ بْنِ نَضْلَةَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم بِالدِّيَةِ عَلَى الْعَاقِلَةِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 19,
        "matchingEnglishURN": 1269500,
        "last_updated": null
    },
    {
        "arabicURN": 1327360,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "7.00",
        "hadithNumber": "2634",
        "bookName": " كتاب الديات ",
        "babName": " باب الدِّيَةِ عَلَى الْعَاقِلَةِ فَإِنْ لَمْ تَكُنْ لَهُ عَاقِلَةٌ فَفِي بَيْتِ الْمَالِ ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ دُرُسْتَ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ، عَنْ عَلِيِّ بْنِ أَبِي طَلْحَةَ، عَنْ رَاشِدِ بْنِ سَعْدٍ، عَنْ أَبِي عَامِرٍ الْهَوْزَنِيِّ، عَنِ الْمِقْدَامِ الشَّامِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَنَا وَارِثُ مَنْ لاَ وَارِثَ لَهُ أَعْقِلُ عَنْهُ وَأَرِثُهُ وَالْخَالُ وَارِثُ مَنْ لاَ وَارِثَ لَهُ يَعْقِلُ عَنْهُ وَيَرِثُهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 20,
        "matchingEnglishURN": 1269510,
        "last_updated": null
    },
    {
        "arabicURN": 1327370,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "8.00",
        "hadithNumber": "2635",
        "bookName": " كتاب الديات ",
        "babName": " باب مَنْ حَالَ بَيْنَ وَلِيِّ الْمَقْتُولِ وَبَيْنَ الْقَوَدِ أَوِ الدِّيَةِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ كَثِيرٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، رَفَعَهُ إِلَى النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ قَتَلَ فِي عِمِّيَّةٍ أَوْ عَصَبِيَّةٍ بِحَجَرٍ أَوْ سَوْطٍ أَوْ عَصًا فَعَلَيْهِ عَقْلُ الْخَطَإِ وَمَنْ قَتَلَ عَمْدًا فَهُوَ قَوَدٌ وَمَنْ حَالَ بَيْنَهُ وَبَيْنَهُ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ لاَ يُقْبَلُ مِنْهُ صَرْفٌ وَلاَ عَدْلٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 21,
        "matchingEnglishURN": 1269520,
        "last_updated": null
    },
    {
        "arabicURN": 1327380,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "9.00",
        "hadithNumber": "2636",
        "bookName": " كتاب الديات ",
        "babName": " باب مَا لاَ قَوَدَ فِيهِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، وَعَمَّارُ بْنُ خَالِدٍ الْوَاسِطِيُّ، حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنْ دَهْثَمِ بْنِ قُرَّانَ، حَدَّثَنِي نِمْرَانُ بْنُ جَارِيَةَ، عَنْ أَبِيهِ، أَنَّ رَجُلاً، ضَرَبَ رَجُلاً عَلَى سَاعِدِهِ بِالسَّيْفِ فَقَطَعَهَا مِنْ غَيْرِ مَفْصِلٍ فَاسْتَعْدَى عَلَيْهِ النَّبِيَّ صلى الله عليه وسلم فَأَمَرَ لَهُ بِالدِّيَةِ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أُرِيدُ الْقِصَاصَ ‏.‏ فَقَالَ ‏\"‏ خُذِ الدِّيَةَ بَارَكَ اللَّهُ لَكَ فِيهَا ‏\"‏ ‏.‏ وَلَمْ يَقْضِ لَهُ بِالْقِصَاصِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 22,
        "matchingEnglishURN": 1269530,
        "last_updated": null
    },
    {
        "arabicURN": 1327390,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "9.00",
        "hadithNumber": "2637",
        "bookName": " كتاب الديات ",
        "babName": " باب مَا لاَ قَوَدَ فِيهِ ",
        "hadithText": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، عَنْ مُعَاذِ بْنِ مُحَمَّدٍ الأَنْصَارِيِّ، عَنِ ابْنِ صُهْبَانَ، عَنِ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ قَوَدَ فِي الْمَأْمُومَةِ وَلاَ الْجَائِفَةِ وَلاَ الْمُنَقِّلَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 23,
        "matchingEnglishURN": 1269540,
        "last_updated": null
    },
    {
        "arabicURN": 1327400,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "10.00",
        "hadithNumber": "2638",
        "bookName": " كتاب الديات ",
        "babName": " باب الْجَارِحِ يَفْتَدِي بِالْقَوَدِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ أَبَا جَهْمِ بْنَ حُذَيْفَةَ مُصَدِّقًا فَلاَجَّهُ رَجُلٌ فِي صَدَقَتِهِ فَضَرَبَهُ أَبُو جَهْمٍ فَشَجَّهُ فَأَتَوُا النَّبِيَّ صلى الله عليه وسلم فَقَالُوا الْقَوَدَ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَكُمْ كَذَا وَكَذَا ‏\"‏ ‏.‏ فَلَمْ يَرْضَوْا فَقَالَ ‏\"‏ لَكُمْ كَذَا وَكَذَا ‏\"‏ ‏.‏ فَرَضُوا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنِّي خَاطِبٌ عَلَى النَّاسِ وَمُخْبِرُهُمْ بِرِضَاكُمْ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ فَخَطَبَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ إِنَّ هَؤُلاَءِ اللَّيْثِيِّينِ أَتَوْنِي يُرِيدُونَ الْقَوَدَ فَعَرَضْتُ عَلَيْهِمْ كَذَا وَكَذَا أَرَضِيتُمْ ‏\"‏ ‏.‏ قَالُوا لاَ ‏.‏ فَهَمَّ بِهِمُ الْمُهَاجِرُونَ فَأَمَرَ النَّبِيُّ صلى الله عليه وسلم أَنْ يَكُفُّوا فَكَفُّوا ثُمَّ دَعَاهُمْ فَزَادَهُمْ فَقَالَ ‏\"‏ أَرَضِيتُمْ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ قَالَ ‏\"‏ إِنِّي خَاطِبٌ عَلَى النَّاسِ وَمُخْبِرُهُمْ بِرِضَاكُمْ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ فَخَطَبَ النَّبِيُّ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ أَرَضِيتُمْ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ قَالَ ابْنُ مَاجَهْ سَمِعْتُ مُحَمَّدَ بْنَ يَحْيَى يَقُولُ تَفَرَّدَ بِهَذَا مَعْمَرٌ لاَ أَعْلَمُ رَوَاهُ غَيْرُهُ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 24,
        "matchingEnglishURN": 1269550,
        "last_updated": null
    },
    {
        "arabicURN": 1327410,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "11.00",
        "hadithNumber": "2639",
        "bookName": " كتاب الديات ",
        "babName": " باب دِيَةِ الْجَنِينِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْجَنِينِ بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ فَقَالَ الَّذِي قُضِيَ عَلَيْهِ أَنَعْقِلُ مَنْ لاَ شَرِبَ وَلاَ أَكَلْ وَلاَ صَاحَ وَلاَ اسْتَهَلّ وَمِثْلُ ذَلِكَ يُطَلّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ هَذَا لَيَقُولُ بِقَوْلِ شَاعِرٍ فِيهِ غُرَّةٌ عَبْدٌ أَوْ أَمَةٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 25,
        "matchingEnglishURN": 1269560,
        "last_updated": null
    },
    {
        "arabicURN": 1327420,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "11.00",
        "hadithNumber": "2640",
        "bookName": " كتاب الديات ",
        "babName": " باب دِيَةِ الْجَنِينِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، قَالَ اسْتَشَارَ عُمَرُ بْنُ الْخَطَّابِ النَّاسَ فِي إِمْلاَصِ الْمَرْأَةِ يَعْنِي سِقْطَهَا فَقَالَ الْمُغِيرَةُ بْنُ شُعْبَةَ شَهِدْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى فِيهِ بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ ‏.‏ فَقَالَ عُمَرُ ائْتِنِي بِمَنْ يَشْهَدُ مَعَكَ ‏.‏ فَشَهِدَ مَعَهُ مُحَمَّدُ بْنُ مَسْلَمَةَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 26,
        "matchingEnglishURN": 1269570,
        "last_updated": null
    },
    {
        "arabicURN": 1327430,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "11.00",
        "hadithNumber": "2641",
        "bookName": " كتاب الديات ",
        "babName": " باب دِيَةِ الْجَنِينِ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ، حَدَّثَنَا أَبُو عَاصِمٍ، أَخْبَرَنِي ابْنُ جُرَيْجٍ، حَدَّثَنِي عَمْرُو بْنُ دِينَارٍ، أَنَّهُ سَمِعَ طَاوُسًا، عَنِ ابْنِ عَبَّاسٍ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، أَنَّهُ نَشَدَ النَّاسَ قَضَاءَ النَّبِيِّ صلى الله عليه وسلم فِي ذَلِكَ يَعْنِي فِي الْجَنِينِ فَقَامَ حَمَلُ بْنُ مَالِكِ بْنِ النَّابِغَةِ فَقَالَ كُنْتُ بَيْنَ امْرَأَتَيْنِ لِي فَضَرَبَتْ إِحْدَاهُمَا الأُخْرَى بِمِسْطَحٍ فَقَتَلَتْهَا وَقَتَلَتْ جَنِينَهَا فَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْجَنِينِ بِغُرَّةٍ عَبْدٍ وَأَنْ تُقْتَلَ بِهَا ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 27,
        "matchingEnglishURN": 1269580,
        "last_updated": null
    },
    {
        "arabicURN": 1327440,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "12.00",
        "hadithNumber": "2642",
        "bookName": " كتاب الديات ",
        "babName": " باب الْمِيرَاثِ مِنَ الدِّيَةِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ عُمَرَ، كَانَ يَقُولُ الدِّيَةُ لِلْعَاقِلَةِ وَلاَ تَرِثُ الْمَرْأَةُ مِنْ دِيَةِ زَوْجِهَا شَيْئًا حَتَّى كَتَبَ إِلَيْهِ الضَّحَّاكُ بْنُ سُفْيَانَ أَنَّ النَّبِيَّ صلى الله عليه وسلم وَرَّثَ امْرَأَةَ أَشْيَمَ الضِّبَابِيِّ مِنْ دِيَةِ زَوْجِهَا ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 28,
        "matchingEnglishURN": 1269590,
        "last_updated": null
    },
    {
        "arabicURN": 1327450,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "12.00",
        "hadithNumber": "2643",
        "bookName": " كتاب الديات ",
        "babName": " باب الْمِيرَاثِ مِنَ الدِّيَةِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ رَبِّهِ بْنُ خَالِدٍ النُّمَيْرِيُّ، حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ إِسْحَاقَ بْنِ يَحْيَى بْنِ الْوَلِيدِ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَضَى لِحَمَلِ بْنِ مَالِكٍ الْهُذَلِيِّ اللِّحْيَانِيِّ بِمِيرَاثِهِ مِنَ امْرَأَتِهِ الَّتِي قَتَلَتْهَا امْرَأَتُهُ الأُخْرَى ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 29,
        "matchingEnglishURN": 1269600,
        "last_updated": null
    },
    {
        "arabicURN": 1327460,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "13.00",
        "hadithNumber": "2644",
        "bookName": " كتاب الديات ",
        "babName": " باب دِيَةِ الْكَافِرِ ",
        "hadithText": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَيَّاشٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى أَنَّ عَقْلَ أَهْلِ الْكِتَابَيْنِ نِصْفُ عَقْلِ الْمُسْلِمِينَ وَهُمُ الْيَهُودُ وَالنَّصَارَى ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 30,
        "matchingEnglishURN": 1269610,
        "last_updated": null
    },
    {
        "arabicURN": 1327470,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "14.00",
        "hadithNumber": "2645",
        "bookName": " كتاب الديات ",
        "babName": " باب الْقَاتِلُ لاَ يَرِثُ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ إِسْحَاقَ بْنِ أَبِي فَرْوَةَ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الْقَاتِلُ لاَ يَرِثُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 31,
        "matchingEnglishURN": 1269620,
        "last_updated": null
    },
    {
        "arabicURN": 1327480,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "14.00",
        "hadithNumber": "2646",
        "bookName": " كتاب الديات ",
        "babName": " باب الْقَاتِلُ لاَ يَرِثُ ",
        "hadithText": "حَدَّثَنَا أَبُو كُرَيْبٍ، وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ الْكِنْدِيُّ، قَالاَ حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، أَنَّ أَبَا قَتَادَةَ، - رَجُلٌ مِنْ بَنِي مُدْلِجٍ - قَتَلَ ابْنَهُ فَأَخَذَ مِنْهُ عُمَرُ مِائَةً مِنَ الإِبِلِ ثَلاَثِينَ حِقَّةً وَثَلاَثِينَ جَذَعَةً وَأَرْبَعِينَ خَلِفَةً ‏.‏ فَقَالَ أَيْنَ أَخُو الْمَقْتُولِ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لَيْسَ لِقَاتِلٍ مِيرَاثٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 32,
        "matchingEnglishURN": 1269630,
        "last_updated": null
    },
    {
        "arabicURN": 1327490,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "15.00",
        "hadithNumber": "2647",
        "bookName": " كتاب الديات ",
        "babName": " باب عَقْلُ الْمَرْأَةِ عَلَى عَصَبَتِهَا وَمِيرَاثُهَا لِوَلَدِهَا ",
        "hadithText": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَنْبَأَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا مُحَمَّدُ بْنُ رَاشِدٍ، عَنْ سُلَيْمَانَ بْنِ مُوسَى، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَعْقِلَ الْمَرْأَةَ عَصَبَتُهَا مَنْ كَانُوا وَلاَ يَرِثُوا مِنْهَا شَيْئًا إِلاَّ مَا فَضَلَ عَنْ وَرَثَتِهَا وَإِنْ قُتِلَتْ فَعَقْلُهَا بَيْنَ وَرَثَتِهَا فَهُمْ يَقْتُلُونَ قَاتِلَهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 33,
        "matchingEnglishURN": 1269640,
        "last_updated": null
    },
    {
        "arabicURN": 1327500,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "15.00",
        "hadithNumber": "2648",
        "bookName": " كتاب الديات ",
        "babName": " باب عَقْلُ الْمَرْأَةِ عَلَى عَصَبَتِهَا وَمِيرَاثُهَا لِوَلَدِهَا ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا الْمُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا مُجَالِدٌ، عَنِ الشَّعْبِيِّ، عَنْ جَابِرٍ، قَالَ جَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم الدِّيَةَ عَلَى عَاقِلَةِ الْقَاتِلَةِ فَقَالَتْ عَاقِلَةُ الْمَقْتُولَةِ يَا رَسُولَ اللَّهِ مِيرَاثُهَا لَنَا ‏.‏ قَالَ ‏\"‏ لاَ مِيرَاثُهَا لِزَوْجِهَا وَوَلَدِهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 34,
        "matchingEnglishURN": 1269650,
        "last_updated": null
    },
    {
        "arabicURN": 1327510,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "16.00",
        "hadithNumber": "2649",
        "bookName": " كتاب الديات ",
        "babName": " باب الْقِصَاصِ فِي السِّنِّ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى أَبُو مُوسَى، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، وَابْنُ أَبِي عَدِيٍّ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ كَسَرَتِ الرُّبَيِّعُ عَمَّةُ أَنَسٍ ثَنِيَّةَ جَارِيَةٍ فَطَلَبُوا الْعَفْوَ فَأَبَوْا فَعَرَضَ عَلَيْهِمُ الأَرْشَ فَأَبَوْا فَأَتَوُا النَّبِيَّ صلى الله عليه وسلم فَأَمَرَ بِالْقِصَاصِ ‏.‏ فَقَالَ أَنَسُ بْنُ النَّضْرِ يَا رَسُولَ اللَّهِ تُكْسَرُ ثَنِيَّةُ الرُّبَيِّعِ وَالَّذِي بَعَثَكَ بِالْحَقِّ لاَ تُكْسَرُ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يَا أَنَسُ كِتَابُ اللَّهِ الْقِصَاصُ ‏\"‏ ‏.‏ قَالَ فَرَضِيَ الْقَوْمُ فَعَفَوْا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنْ عِبَادِ اللَّهِ مَنْ لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 35,
        "matchingEnglishURN": 1269660,
        "last_updated": null
    },
    {
        "arabicURN": 1327520,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "17.00",
        "hadithNumber": "2650",
        "bookName": " كتاب الديات ",
        "babName": " باب دِيَةِ الأَسْنَانِ ",
        "hadithText": "حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنِي شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الأَسْنَانُ سَوَاءٌ الثَّنِيَّةُ وَالضِّرْسُ سَوَاءٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 36,
        "matchingEnglishURN": 1269670,
        "last_updated": null
    },
    {
        "arabicURN": 1327530,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "17.00",
        "hadithNumber": "2651",
        "bookName": " كتاب الديات ",
        "babName": " باب دِيَةِ الأَسْنَانِ ",
        "hadithText": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ الْبَالِسِيُّ، حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ بْنِ شَقِيقٍ، حَدَّثَنَا أَبُو حَمْزَةَ الْمَرْوَزِيُّ، حَدَّثَنَا يَزِيدُ النَّحْوِيُّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَضَى فِي السِّنِّ خَمْسًا مِنَ الإِبِلِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 37,
        "matchingEnglishURN": 1269680,
        "last_updated": null
    },
    {
        "arabicURN": 1327540,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "18.00",
        "hadithNumber": "2652",
        "bookName": " كتاب الديات ",
        "babName": " باب دِيَةِ الأَصَابِعِ ",
        "hadithText": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ جَعْفَرٍ، وَابْنُ أَبِي عَدِيٍّ، قَالُوا حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ هَذِهِ وَهَذِهِ سَوَاءٌ ‏\"‏ ‏.‏ يَعْنِي الْخِنْصَرَ وَالإِبْهَامَ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 38,
        "matchingEnglishURN": 1269690,
        "last_updated": null
    },
    {
        "arabicURN": 1327550,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "18.00",
        "hadithNumber": "2653",
        "bookName": " كتاب الديات ",
        "babName": " باب دِيَةِ الأَصَابِعِ ",
        "hadithText": "حَدَّثَنَا جَمِيلُ بْنُ الْحَسَنِ الْعَتَكِيُّ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، عَنْ مَطَرٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الأَصَابِعُ سَوَاءٌ كُلُّهُنَّ فِيهِنَّ عَشْرٌ عَشْرٌ مِنَ الإِبِلِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 39,
        "matchingEnglishURN": 1269700,
        "last_updated": null
    },
    {
        "arabicURN": 1327560,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "18.00",
        "hadithNumber": "2654",
        "bookName": " كتاب الديات ",
        "babName": " باب دِيَةِ الأَصَابِعِ ",
        "hadithText": "حَدَّثَنَا رَجَاءُ بْنُ الْمُرَجَّى السَّمَرْقَنْدِيُّ، حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ غَالِبٍ التَّمَّارِ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ مَسْرُوقِ بْنِ أَوْسٍ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الأَصَابِعُ سَوَاءٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 40,
        "matchingEnglishURN": 1269710,
        "last_updated": null
    },
    {
        "arabicURN": 1327570,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "19.00",
        "hadithNumber": "2655",
        "bookName": " كتاب الديات ",
        "babName": " باب الْمُوضِحَةِ ",
        "hadithText": "حَدَّثَنَا جَمِيلُ بْنُ الْحَسَنِ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ مَطَرٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ فِي الْمَوَاضِحِ خَمْسٌ خَمْسٌ مِنَ الإِبِلِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 41,
        "matchingEnglishURN": 1269720,
        "last_updated": null
    },
    {
        "arabicURN": 1327580,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "20.00",
        "hadithNumber": "2656",
        "bookName": " كتاب الديات ",
        "babName": " باب مَنْ عَضَّ رَجُلاً فَنَزَعَ يَدَهُ فَنَدَرَ ثَنَايَاهُ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ عَطَاءٍ، عَنْ صَفْوَانَ بْنِ عَبْدِ اللَّهِ، عَنْ عَمَّيْهِ، يَعْلَى وَسَلَمَةَ ابْنَىْ أُمَيَّةَ قَالاَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ وَمَعَنَا صَاحِبٌ لَنَا فَاقْتَتَلَ هُوَ وَرَجُلٌ آخَرُ وَنَحْنُ بِالطَّرِيقِ ‏.‏ قَالَ فَعَضَّ الرَّجُلُ يَدَ صَاحِبِهِ فَجَذَبَ صَاحِبُهُ يَدَهُ مِنْ فِيهِ فَطَرَحَ ثَنِيَّتَهُ فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم يَلْتَمِسُ عَقْلَ ثَنِيَّتِهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَعْمِدُ أَحَدُكُمْ إِلَى أَخِيهِ فَيَعَضُّهُ كَعِضَاضِ الْفَحْلِ ثُمَّ يَأْتِي يَلْتَمِسُ الْعَقْلَ لاَ عَقْلَ لَهَا ‏\"‏ ‏.‏ قَالَ فَأَبْطَلَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 42,
        "matchingEnglishURN": 1269730,
        "last_updated": null
    },
    {
        "arabicURN": 1327590,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "20.00",
        "hadithNumber": "2657",
        "bookName": " كتاب الديات ",
        "babName": " باب مَنْ عَضَّ رَجُلاً فَنَزَعَ يَدَهُ فَنَدَرَ ثَنَايَاهُ ",
        "hadithText": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ رَجُلاً، عَضَّ رَجُلاً عَلَى ذِرَاعِهِ فَنَزَعَ يَدَهُ فَوَقَعَتْ ثَنِيَّتُهُ فَرُفِعَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَبْطَلَهَا ‏.‏ وَقَالَ ‏\"‏ يَقْضَمُ أَحَدُكُمْ كَمَا يَقْضَمُ الْفَحْلُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 43,
        "matchingEnglishURN": 1269740,
        "last_updated": null
    },
    {
        "arabicURN": 1327600,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "21.00",
        "hadithNumber": "2658",
        "bookName": " كتاب الديات ",
        "babName": " باب لاَ يُقْتَلُ مُسْلِمٌ بِكَافِرٍ ",
        "hadithText": "حَدَّثَنَا عَلْقَمَةُ بْنُ عَمْرٍو الدَّارِمِيُّ، حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنْ مُطَرِّفٍ، عَنِ الشَّعْبِيِّ، عَنْ أَبِي جُحَيْفَةَ، قَالَ قُلْتُ لِعَلِيِّ بْنِ أَبِي طَالِبٍ هَلْ عِنْدَكُمْ شَىْءٌ مِنَ الْعِلْمِ لَيْسَ عِنْدَ النَّاسِ قَالَ لاَ وَاللَّهِ مَا عِنْدَنَا إِلاَّ مَا عِنْدَ النَّاسِ إِلاَّ أَنْ يَرْزُقَ اللَّهُ رَجُلاً فَهْمًا فِي الْقُرْآنِ أَوْ مَا فِي هَذِهِ الصَّحِيفَةِ فِيهَا الدِّيَاتُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَنْ لاَ يُقْتَلَ مُسْلِمٌ بِكَافِرٍ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 44,
        "matchingEnglishURN": 1269750,
        "last_updated": null
    },
    {
        "arabicURN": 1327610,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "21.00",
        "hadithNumber": "2659",
        "bookName": " كتاب الديات ",
        "babName": " باب لاَ يُقْتَلُ مُسْلِمٌ بِكَافِرٍ ",
        "hadithText": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَيَّاشٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يُقْتَلُ مُسْلِمٌ بِكَافِرٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 45,
        "matchingEnglishURN": 1269760,
        "last_updated": null
    },
    {
        "arabicURN": 1327620,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "21.00",
        "hadithNumber": "2660",
        "bookName": " كتاب الديات ",
        "babName": " باب لاَ يُقْتَلُ مُسْلِمٌ بِكَافِرٍ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى الصَّنْعَانِيُّ، حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ أَبِيهِ، عَنْ حَنَشٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ وَلاَ ذُو عَهْدٍ فِي عَهْدِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 46,
        "matchingEnglishURN": 1269770,
        "last_updated": null
    },
    {
        "arabicURN": 1327630,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "22.00",
        "hadithNumber": "2661",
        "bookName": " كتاب الديات ",
        "babName": " باب لا يُقْتَلُ الْوَالِدُ بِوَلَدِهِ ",
        "hadithText": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ إِسْمَاعِيلَ بْنِ مُسْلِمٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يُقْتَلُ بِالْوَلَدِ الْوَالِدُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 47,
        "matchingEnglishURN": 1269780,
        "last_updated": null
    },
    {
        "arabicURN": 1327640,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "22.00",
        "hadithNumber": "2662",
        "bookName": " كتاب الديات ",
        "babName": " باب لا يُقْتَلُ الْوَالِدُ بِوَلَدِهِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ حَجَّاجٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ يُقْتَلُ الْوَالِدُ بِالْوَلَدِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 48,
        "matchingEnglishURN": 1269790,
        "last_updated": null
    },
    {
        "arabicURN": 1327650,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "23.00",
        "hadithNumber": "2663",
        "bookName": " كتاب الديات ",
        "babName": " باب هَلْ يُقْتَلُ الْحُرُّ بِالْعَبْدِ ",
        "hadithText": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ وَمَنْ جَدَعَهُ جَدَعْنَاهُ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 49,
        "matchingEnglishURN": 1269800,
        "last_updated": null
    },
    {
        "arabicURN": 1327660,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "23.00",
        "hadithNumber": "2664",
        "bookName": " كتاب الديات ",
        "babName": " باب هَلْ يُقْتَلُ الْحُرُّ بِالْعَبْدِ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا ابْنُ الطَّبَّاعِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي فَرْوَةَ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ، عَنْ أَبِيهِ، عَنْ عَلِيٍّ، وَعَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَتَلَ رَجُلٌ عَبْدَهُ عَمْدًا مُتَعَمِّدًا فَجَلَدَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مِائَةً وَنَفَاهُ سَنَةً وَمَحَا سَهْمَهُ مِنَ الْمُسْلِمِينَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 50,
        "matchingEnglishURN": 1269810,
        "last_updated": null
    },
    {
        "arabicURN": 1327670,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "24.00",
        "hadithNumber": "2665",
        "bookName": " كتاب الديات ",
        "babName": " باب يُقْتَادُ مِنَ الْقَاتِلِ كَمَا قَتَلَ ",
        "hadithText": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ هَمَّامِ بْنِ يَحْيَى، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ يَهُودِيًّا، رَضَخَ رَأْسَ امْرَأَةٍ بَيْنَ حَجَرَيْنِ فَقَتَلَهَا فَرَضَخَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَأْسَهُ بَيْنَ حَجَرَيْنِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 51,
        "matchingEnglishURN": 1269820,
        "last_updated": null
    },
    {
        "arabicURN": 1327680,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "24.00",
        "hadithNumber": "2666",
        "bookName": " كتاب الديات ",
        "babName": " باب يُقْتَادُ مِنَ الْقَاتِلِ كَمَا قَتَلَ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ هِشَامِ بْنِ زَيْدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ يَهُودِيًّا، قَتَلَ جَارِيَةً عَلَى أَوْضَاحٍ لَهَا فَقَالَ لَهَا ‏\"‏ أَقَتَلَكِ فُلاَنٌ ‏\"‏ ‏.‏ فَأَشَارَتْ بِرَأْسِهَا أَنْ لاَ ثُمَّ سَأَلَهَا الثَّانِيَةَ فَأَشَارَتْ بِرَأْسِهَا أَنْ لاَ ثُمَّ سَأَلَهَا الثَّالِثَةَ فَأَشَارَتْ بِرَأْسِهَا أَنْ نَعَمْ فَقَتَلَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ حَجَرَيْنِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 52,
        "matchingEnglishURN": 1269830,
        "last_updated": null
    },
    {
        "arabicURN": 1327690,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "25.00",
        "hadithNumber": "2667",
        "bookName": " كتاب الديات ",
        "babName": " باب لاَ قَوَدَ إِلاَّ بِالسَّيْفِ ",
        "hadithText": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُسْتَمِرِّ الْعُرُوقِيُّ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ سُفْيَانَ، عَنْ جَابِرٍ، عَنْ أَبِي عَازِبٍ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ قَوَدَ إِلاَّ بِالسَّيْفِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 53,
        "matchingEnglishURN": 1269840,
        "last_updated": null
    },
    {
        "arabicURN": 1327700,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "25.00",
        "hadithNumber": "2668",
        "bookName": " كتاب الديات ",
        "babName": " باب لاَ قَوَدَ إِلاَّ بِالسَّيْفِ ",
        "hadithText": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُسْتَمِرِّ، حَدَّثَنَا الْحُرُّ بْنُ مَالِكٍ الْعَنْبَرِيُّ، حَدَّثَنَا مُبَارَكُ بْنُ فَضَالَةَ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ قَوَدَ إِلاَّ بِالسَّيْفِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 54,
        "matchingEnglishURN": 1269850,
        "last_updated": null
    },
    {
        "arabicURN": 1327710,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "26.00",
        "hadithNumber": "2669",
        "bookName": " كتاب الديات ",
        "babName": " باب لاَ يَجْنِي أَحَدٌ عَلَى أَحَدٍ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ شَبِيبِ بْنِ غَرْقَدَةَ، عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الأَحْوَصِ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ فِي حِجَّةِ الْوَدَاعِ ‏\"‏ أَلاَ لاَ يَجْنِي جَانٍ إِلاَّ عَلَى نَفْسِهِ لاَ يَجْنِي وَالِدٌ عَلَى وَلَدِهِ وَلاَ مَوْلُودٌ عَلَى وَالِدِهِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 55,
        "matchingEnglishURN": 1269860,
        "last_updated": null
    },
    {
        "arabicURN": 1327720,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "26.00",
        "hadithNumber": "2670",
        "bookName": " كتاب الديات ",
        "babName": " باب لاَ يَجْنِي أَحَدٌ عَلَى أَحَدٍ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، حَدَّثَنَا جَامِعُ بْنُ شَدَّادٍ، عَنْ طَارِقٍ الْمُحَارِبِيِّ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَرْفَعُ يَدَيْهِ حَتَّى رَأَيْتُ بَيَاضَ إِبْطَيْهِ يَقُولُ ‏\"‏ أَلاَ لاَ تَجْنِي أُمٌّ عَلَى وَلَدٍ أَلاَ لاَ تَجْنِي أُمٌّ عَلَى وَلَدٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 56,
        "matchingEnglishURN": 1269870,
        "last_updated": null
    },
    {
        "arabicURN": 1327730,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "26.00",
        "hadithNumber": "2671",
        "bookName": " كتاب الديات ",
        "babName": " باب لاَ يَجْنِي أَحَدٌ عَلَى أَحَدٍ ",
        "hadithText": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا هُشَيْمٌ، عَنْ يُونُسَ، عَنْ حُصَيْنِ بْنِ أَبِي الْحُرِّ، عَنِ الْخَشْخَاشِ الْعَنْبَرِيِّ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم وَمَعِي ابْنِي فَقَالَ ‏\"‏ لاَ تَجْنِي عَلَيْهِ وَلاَ يَجْنِي عَلَيْكَ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 57,
        "matchingEnglishURN": 1269880,
        "last_updated": null
    },
    {
        "arabicURN": 1327740,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "26.00",
        "hadithNumber": "2672",
        "bookName": " كتاب الديات ",
        "babName": " باب لاَ يَجْنِي أَحَدٌ عَلَى أَحَدٍ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عَقِيلٍ، حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، حَدَّثَنَا أَبُو الْعَوَّامِ الْقَطَّانُ، عَنْ مُحَمَّدِ بْنِ جُحَادَةَ، عَنْ زِيَادِ بْنِ عِلاَقَةَ، عَنْ أُسَامَةَ بْنِ شَرِيكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَجْنِي نَفْسٌ عَلَى أُخْرَى ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 58,
        "matchingEnglishURN": 1269890,
        "last_updated": null
    },
    {
        "arabicURN": 1327750,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "27.00",
        "hadithNumber": "2673",
        "bookName": " كتاب الديات ",
        "babName": " باب الْجُبَارِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْعَجْمَاءُ جَرْحُهَا جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَالْبِئْرُ جُبَارٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 59,
        "matchingEnglishURN": 1269900,
        "last_updated": null
    },
    {
        "arabicURN": 1327760,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "27.00",
        "hadithNumber": "2674",
        "bookName": " كتاب الديات ",
        "babName": " باب الْجُبَارِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا كَثِيرُ بْنُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عَوْفٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ الْعَجْمَاءُ جَرْحُهَا جُبَارٌ وَالْمَعْدِنُ جُبَارٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 60,
        "matchingEnglishURN": 1269910,
        "last_updated": null
    },
    {
        "arabicURN": 1327770,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "27.00",
        "hadithNumber": "2675",
        "bookName": " كتاب الديات ",
        "babName": " باب الْجُبَارِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ رَبِّهِ بْنُ خَالِدٍ النُّمَيْرِيُّ، حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنِي مُوسَى بْنُ عُقْبَةَ، حَدَّثَنِي إِسْحَاقُ بْنُ يَحْيَى بْنِ الْوَلِيدِ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَّ الْمَعْدِنَ جُبَارٌ وَالْبِئْرَ جُبَارٌ وَالْعَجْمَاءُ جَرْحُهَا جُبَارٌ ‏.‏ وَالْعَجْمَاءُ الْبَهِيمَةُ مِنَ الأَنْعَامِ وَغَيْرِهَا ‏.‏ وَالْجُبَارُ هُوَ الْهَدَرُ الَّذِي لاَ يُغَرَّمُ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 61,
        "matchingEnglishURN": 1269920,
        "last_updated": null
    },
    {
        "arabicURN": 1327780,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "27.00",
        "hadithNumber": "2676",
        "bookName": " كتاب الديات ",
        "babName": " باب الْجُبَارِ ",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ الأَزْهَرِ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ النَّارُ جُبَارٌ وَالْبِئْرُ جُبَارٌ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 62,
        "matchingEnglishURN": 1269930,
        "last_updated": null
    },
    {
        "arabicURN": 1327790,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "28.00",
        "hadithNumber": "2677",
        "bookName": " كتاب الديات ",
        "babName": " باب الْقَسَامَةِ ",
        "hadithText": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ، حَدَّثَنَا بِشْرُ بْنُ عُمَرَ، سَمِعْتُ مَالِكَ بْنَ أَنَسٍ، حَدَّثَنِي أَبُو لَيْلَى بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَهْلِ بْنِ حُنَيْفٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، أَنَّهُ أَخْبَرَهُ عَنْ رِجَالٍ، مِنْ كُبَرَاءِ قَوْمِهِ أَنَّ عَبْدَ، اللَّهِ بْنَ سَهْلٍ وَمُحَيِّصَةَ خَرَجَا إِلَى خَيْبَرَ مِنْ جَهْدٍ أَصَابَهُمْ فَأُتِيَ مُحَيِّصَةُ فَأُخْبِرَ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ قَدْ قُتِلَ وَأُلْقِيَ فِي فَقِيرٍ أَوْ عَيْنٍ بِخَيْبَرَ فَأَتَى يَهُودَ فَقَالَ أَنْتُمْ وَاللَّهِ قَتَلْتُمُوهُ ‏.‏ قَالُوا وَاللَّهِ مَا قَتَلْنَاهُ ‏.‏ ثُمَّ أَقْبَلَ حَتَّى قَدِمَ عَلَى قَوْمِهِ فَذَكَرَ ذَلِكَ لَهُمْ ثُمَّ أَقْبَلَ هُوَ وَأَخُوهُ حُوَيِّصَةُ وَهُوَ أَكْبَرُ مِنْهُ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ فَذَهَبَ مُحَيِّصَةُ يَتَكَلَّمُ وَهُوَ الَّذِي كَانَ بِخَيْبَرَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِمُحَيِّصَةَ ‏\"‏ كَبِّرْ كَبِّرْ ‏\"‏ ‏.‏ يُرِيدُ السِّنَّ فَتَكَلَّمَ حُوَيِّصَةُ ثُمَّ تَكَلَّمَ مُحَيِّصَةُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِمَّا أَنْ يَدُوا صَاحِبَكُمْ وَإِمَّا أَنْ يُؤْذِنُوا بِحَرْبٍ ‏\"‏ ‏.‏ فَكَتَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَيْهِمْ فِي ذَلِكَ فَكَتَبُوا إِنَّا وَاللَّهِ مَا قَتَلْنَاهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِحُوَيِّصَةَ وَمُحَيِّصَةَ وَعَبْدِ الرَّحْمَنِ ‏\"‏ تَحْلِفُونَ وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ ‏\"‏ ‏.‏ قَالُوا لاَ ‏.‏ قَالَ ‏\"‏ فَتَحْلِفُ لَكُمْ يَهُودُ ‏\"‏ ‏.‏ قَالُوا لَيْسُوا بِمُسْلِمِينَ فَوَدَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ عِنْدِهِ فَبَعَثَ إِلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم مِائَةَ نَاقَةٍ حَتَّى أُدْخِلَتْ عَلَيْهِمُ الدَّارَ فَقَالَ سَهْلٌ فَلَقَدْ رَكَضَتْنِي مِنْهَا نَاقَةٌ حَمْرَاءُ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 63,
        "matchingEnglishURN": 1269940,
        "last_updated": null
    },
    {
        "arabicURN": 1327800,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "28.00",
        "hadithNumber": "2678",
        "bookName": " كتاب الديات ",
        "babName": " باب الْقَسَامَةِ ",
        "hadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ حَجَّاجٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ حُوَيِّصَةَ، وَمُحَيِّصَةَ، ابْنَىْ مَسْعُودٍ وَعَبْدَ اللَّهِ وَعَبْدَ الرَّحْمَنِ ابْنَىْ سَهْلٍ خَرَجُوا يَمْتَارُونَ بِخَيْبَرَ فَعُدِيَ عَلَى عَبْدِ اللَّهِ فَقُتِلَ فَذُكِرَ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ تُقْسِمُونَ وَتَسْتَحِقُّونَ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نُقْسِمُ وَلَمْ نَشْهَدْ قَالَ ‏\"‏ فَتُبْرِئُكُمْ يَهُودُ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ إِذًا تَقْتُلُنَا ‏.‏ قَالَ فَوَدَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ عِنْدِهِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 64,
        "matchingEnglishURN": 1269950,
        "last_updated": null
    },
    {
        "arabicURN": 1327810,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "29.00",
        "hadithNumber": "2679",
        "bookName": " كتاب الديات ",
        "babName": " باب مَنْ مَثَّلَ بِعَبْدِهِ فَهُوَ حُرٌّ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ السَّلاَمِ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي فَرْوَةَ، عَنْ سَلَمَةَ بْنِ رَوْحِ بْنِ زِنْبَاعٍ، عَنْ جَدِّهِ، أَنَّهُ قَدِمَ عَلَى النَّبِيِّ صلى الله عليه وسلم وَقَدْ خَصَى غُلاَمًا لَهُ فَأَعْتَقَهُ النَّبِيُّ صلى الله عليه وسلم بِالْمُثْلَةِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 65,
        "matchingEnglishURN": 1269960,
        "last_updated": null
    },
    {
        "arabicURN": 1327820,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "29.00",
        "hadithNumber": "2680",
        "bookName": " كتاب الديات ",
        "babName": " باب مَنْ مَثَّلَ بِعَبْدِهِ فَهُوَ حُرٌّ ",
        "hadithText": "حَدَّثَنَا رَجَاءُ بْنُ الْمُرَجَّى السَّمَرْقَنْدِيُّ، حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ، حَدَّثَنَا أَبُو حَمْزَةَ الصَّيْرَفِيُّ، حَدَّثَنِي عَمْرُو بْنُ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم صَارِخًا فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا لَكَ ‏\"‏ ‏.‏ قَالَ سَيِّدِي رَآنِي أُقَبِّلُ جَارِيَةً لَهُ فَجَبَّ مَذَاكِيرِي ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عَلَىَّ بِالرَّجُلِ ‏\"‏ ‏.‏ فَطُلِبَ فَلَمْ يُقْدَرْ عَلَيْهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اذْهَبْ فَأَنْتَ حُرٌّ ‏\"‏ ‏.‏ قَالَ عَلَى مَنْ نُصْرَتِي يَا رَسُولَ اللَّهِ قَالَ يَقُولُ أَرَأَيْتَ إِنِ اسْتَرَقَّنِي مَوْلاَىَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ عَلَى كُلِّ مُؤْمِنٍ أَوْ مُسْلِمٍ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 66,
        "matchingEnglishURN": 1269970,
        "last_updated": null
    },
    {
        "arabicURN": 1327830,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "30.00",
        "hadithNumber": "2681",
        "bookName": " كتاب الديات ",
        "babName": " باب أَعَفُّ النَّاسِ قِتْلَةً أَهْلُ الإِيمَانِ ",
        "hadithText": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا هُشَيْمٌ، عَنْ مُغِيرَةَ، عَنْ شِبَاكٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ قَالَ عَبْدُ اللَّهِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنْ أَعَفِّ النَّاسِ قِتْلَةً أَهْلَ الإِيمَانِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 67,
        "matchingEnglishURN": 1269980,
        "last_updated": null
    },
    {
        "arabicURN": 1327840,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "30.00",
        "hadithNumber": "2682",
        "bookName": " كتاب الديات ",
        "babName": " باب أَعَفُّ النَّاسِ قِتْلَةً أَهْلُ الإِيمَانِ ",
        "hadithText": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، عَنْ مُغِيرَةَ، عَنْ شِبَاكٍ، عَنْ إِبْرَاهِيمَ، عَنْ هُنَىِّ بْنِ نُوَيْرَةَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ أَعَفَّ النَّاسِ قِتْلَةً أَهْلُ الإِيمَانِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 68,
        "matchingEnglishURN": 1269990,
        "last_updated": null
    },
    {
        "arabicURN": 1327850,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "31.00",
        "hadithNumber": "2683",
        "bookName": " كتاب الديات ",
        "babName": " باب الْمُسْلِمُونَ تَتَكَافَأُ دِمَاؤُهُمْ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى الصَّنْعَانِيُّ، حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ أَبِيهِ، عَنْ حَنَشٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الْمُسْلِمُونَ تَتَكَافَأُ دِمَاؤُهُمْ وَهُمْ يَدٌ عَلَى مَنْ سِوَاهُمْ يَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ وَيُرَدُّ عَلَى أَقْصَاهُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 69,
        "matchingEnglishURN": 1270000,
        "last_updated": null
    },
    {
        "arabicURN": 1327860,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "31.00",
        "hadithNumber": "2684",
        "bookName": " كتاب الديات ",
        "babName": " باب الْمُسْلِمُونَ تَتَكَافَأُ دِمَاؤُهُمْ ",
        "hadithText": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ أَبُو ضَمْرَةَ، عَنْ عَبْدِ السَّلاَمِ بْنِ أَبِي الْجَنُوبِ، عَنِ الْحَسَنِ، عَنْ مَعْقِلِ بْنِ يَسَارٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْمُسْلِمُونَ يَدٌ عَلَى مَنْ سِوَاهُمْ وَتَتَكَافَأُ دِمَاؤُهُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 70,
        "matchingEnglishURN": 1270010,
        "last_updated": null
    },
    {
        "arabicURN": 1327870,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "31.00",
        "hadithNumber": "2685",
        "bookName": " كتاب الديات ",
        "babName": " باب الْمُسْلِمُونَ تَتَكَافَأُ دِمَاؤُهُمْ ",
        "hadithText": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَيَّاشٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَدُ الْمُسْلِمِينَ عَلَى مَنْ سِوَاهُمْ تَتَكَافَأُ دِمَاؤُهُمْ وَيُجِيرُ عَلَى الْمُسْلِمِينَ أَدْنَاهُمْ وَيَرُدُّ عَلَى الْمُسْلِمِينَ أَقْصَاهُمْ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 71,
        "matchingEnglishURN": 1270020,
        "last_updated": null
    },
    {
        "arabicURN": 1327880,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "32.00",
        "hadithNumber": "2686",
        "bookName": " كتاب الديات ",
        "babName": " باب مَنْ قَتَلَ مُعَاهِدًا ",
        "hadithText": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْحَسَنِ بْنِ عَمْرٍو، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ قَتَلَ مُعَاهِدًا لَمْ يَرَحْ رَائِحَةَ الْجَنَّةِ وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ أَرْبَعِينَ عَامًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 72,
        "matchingEnglishURN": 1270030,
        "last_updated": null
    },
    {
        "arabicURN": 1327890,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "32.00",
        "hadithNumber": "2687",
        "bookName": " كتاب الديات ",
        "babName": " باب مَنْ قَتَلَ مُعَاهِدًا ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مَعْدِيُّ بْنُ سُلَيْمَانَ، أَنْبَأَنَا ابْنُ عَجْلاَنَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ قَتَلَ مُعَاهِدًا لَهُ ذِمَّةُ اللَّهِ وَذِمَّةُ رَسُولِهِ لَمْ يَرَحْ رَائِحَةَ الْجَنَّةِ وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ سَبْعِينَ عَامًا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 73,
        "matchingEnglishURN": 1270040,
        "last_updated": null
    },
    {
        "arabicURN": 1327910,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "33.00",
        "hadithNumber": "2688",
        "bookName": " كتاب الديات ",
        "babName": "باب مَنْ أَمِنَ رَجُلاً عَلَى دَمِهِ فَقَتَلَهُ ‏",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ رِفَاعَةَ بْنِ شَدَّادٍ الْقِتْبَانِيِّ، قَالَ لَوْلاَ كَلِمَةٌ سَمِعْتُهَا مِنْ، عَمْرِو بْنِ الْحَمِقِ الْخُزَاعِيِّ لَمَشَيْتُ فِيمَا بَيْنَ رَأْسِ الْمُخْتَارِ وَجَسَدِهِ سَمِعْتُهُ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَمِنَ رَجُلاً عَلَى دَمِهِ فَقَتَلَهُ فَإِنَّهُ يَحْمِلُ لِوَاءَ غَدْرٍ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 74,
        "matchingEnglishURN": 1270050,
        "last_updated": null
    },
    {
        "arabicURN": 1327920,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "33.00",
        "hadithNumber": "2689",
        "bookName": " كتاب الديات ",
        "babName": "باب مَنْ أَمِنَ رَجُلاً عَلَى دَمِهِ فَقَتَلَهُ ‏",
        "hadithText": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا أَبُو لَيْلَى، عَنْ أَبِي عُكَّاشَةَ، عَنْ رِفَاعَةَ، قَالَ دَخَلْتُ عَلَى الْمُخْتَارِ فِي قَصْرِهِ فَقَالَ قَامَ جِبْرَائِيلُ مِنْ عِنْدِي السَّاعَةَ ‏.‏ فَمَا مَنَعَنِي مِنْ ضَرْبِ عُنُقِهِ إِلاَّ حَدِيثٌ سَمِعْتُهُ مِنْ سُلَيْمَانَ بْنِ صُرَدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\"‏ إِذَا أَمِنَكَ الرَّجُلُ عَلَى دَمِهِ فَلاَ تَقْتُلْهُ ‏\"‏ ‏.‏ فَذَاكَ الَّذِي مَنَعَنِي مِنْهُ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 75,
        "matchingEnglishURN": 1270060,
        "last_updated": null
    },
    {
        "arabicURN": 1327930,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "34.00",
        "hadithNumber": "2690",
        "bookName": " كتاب الديات ",
        "babName": " باب الْعَفْوِ عَنِ الْقَاتِلِ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَتَلَ رَجُلٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَرُفِعَ ذَلِكَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَدَفَعَهُ إِلَى وَلِيِّ الْمَقْتُولِ فَقَالَ الْقَاتِلُ يَا رَسُولَ اللَّهِ وَاللَّهِ مَا أَرَدْتُ قَتْلَهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِلْوَلِيِّ ‏\"‏ أَمَا إِنَّهُ إِنْ كَانَ صَادِقًا ثُمَّ قَتَلْتَهُ دَخَلْتَ النَّارَ ‏\"‏ ‏.‏ قَالَ فَخَلَّى سَبِيلَهُ ‏.‏ قَالَ وَكَانَ مَكْتُوفًا بِنِسْعَةٍ فَخَرَجَ يَجُرُّ نِسْعَتَهُ فَسُمِّيَ ذَا النِّسْعَةِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 76,
        "matchingEnglishURN": 1270070,
        "last_updated": null
    },
    {
        "arabicURN": 1327960,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "35.00",
        "hadithNumber": "2692",
        "bookName": " كتاب الديات ",
        "babName": " باب الْعَفْوِ فِي الْقِصَاصِ ",
        "hadithText": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَنْبَأَنَا حَبَّانُ بْنُ هِلاَلٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ الْمُزَنِيُّ، عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ، قَالَ لاَ أَعْلَمُهُ إِلاَّ عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ مَا رُفِعَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم شَىْءٌ فِيهِ الْقِصَاصُ إِلاَّ أَمَرَ فِيهِ بِالْعَفْوِ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 78,
        "matchingEnglishURN": 1270090,
        "last_updated": null
    },
    {
        "arabicURN": 1327970,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "35.00",
        "hadithNumber": "2693",
        "bookName": " كتاب الديات ",
        "babName": " باب الْعَفْوِ فِي الْقِصَاصِ ",
        "hadithText": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ يُونُسَ بْنِ أَبِي إِسْحَاقَ، عَنْ أَبِي السَّفَرِ، قَالَ قَالَ أَبُو الدَّرْدَاءِ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَا مِنْ رَجُلٍ يُصَابُ بِشَىْءٍ مِنْ جَسَدِهِ فَيَتَصَدَّقُ بِهِ إِلاَّ رَفَعَهُ اللَّهُ بِهِ دَرَجَةً أَوْ حَطَّ عَنْهُ بِهِ خَطِيئَةً ‏\"‏ ‏.‏ سَمِعَتْهُ أُذُنَاىَ وَوَعَاهُ قَلْبِي ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 79,
        "matchingEnglishURN": 1270100,
        "last_updated": null
    },
    {
        "arabicURN": 1327980,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "36.00",
        "hadithNumber": "2694",
        "bookName": " كتاب الديات ",
        "babName": " باب الْحَامِلِ يَجِبُ عَلَيْهَا الْقَوَدُ ",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا أَبُو صَالِحٍ، عَنِ ابْنِ لَهِيعَةَ، عَنِ ابْنِ أَنْعُمٍ، عَنْ عُبَادَةَ بْنِ نُسَىٍّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ، حَدَّثَنَا مُعَاذُ بْنُ جَبَلٍ، وَأَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ وَعُبَادَةُ بْنُ الصَّامِتِ وَشَدَّادُ بْنُ أَوْسٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الْمَرْأَةُ إِذَا قَتَلَتْ عَمْدًا لاَ تُقْتَلُ حَتَّى تَضَعَ مَا فِي بَطْنِهَا إِنْ كَانَتْ حَامِلاً وَحَتَّى تُكَفِّلَ وَلَدَهَا وَإِنْ زَنَتْ لَمْ تُرْجَمْ حَتَّى تَضَعَ مَا فِي بَطْنِهَا وَحَتَّى تُكَفِّلَ وَلَدَهَا ‏\"‏ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 80,
        "matchingEnglishURN": 1270110,
        "last_updated": null
    },
    {
        "arabicURN": 1327205,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "2.00",
        "hadithNumber": "2622",
        "bookName": " كتاب الديات ",
        "babName": " باب هَلْ لِقَاتِلِ مُؤْمِنٍ تَوْبَةٌ ",
        "hadithText": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا هَمَّامُ بْنُ يَحْيَى، عَنْ قَتَادَةَ، عَنْ أَبِي الصِّدِّيقِ النَّاجِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ أَلاَ أُخْبِرُكُمْ بِمَا، سَمِعْتُ مِنْ، فِي رَسُولِ اللَّهِ صلى الله عليه وسلم سَمِعَتْهُ أُذُنَاىَ وَوَعَاهُ قَلْبِي ‏\"‏ إِنَّ عَبْدًا قَتَلَ تِسْعَةً وَتِسْعِينَ نَفْسًا ثُمَّ عَرَضَتْ لَهُ التَّوْبَةُ فَسَأَلَ عَنْ أَعْلَمِ أَهْلِ الأَرْضِ فَدُلَّ عَلَى رَجُلٍ فَأَتَاهُ ‏.‏ فَقَالَ إِنِّي قَتَلْتُ تِسْعَةً وَتِسْعِينَ نَفْسًا فَهَلْ لِي مِنْ تَوْبَةٍ قَالَ بَعْدَ تِسْعَةٍ وَتِسْعِينَ نَفْسًا ‏.‏ قَالَ فَانْتَضَى سَيْفَهُ فَقَتَلَهُ فَأَكْمَلَ بِهِ الْمِائَةَ ثُمَّ عَرَضَتْ لَهُ التَّوْبَةُ فَسَأَلَ عَنْ أَعْلَمِ أَهْلِ الأَرْضِ فَدُلَّ عَلَى رَجُلٍ فَأَتَاهُ فَقَالَ إِنِّي قَتَلْتُ مِائَةَ نَفْسٍ فَهَلْ لِي مِنْ تَوْبَةٍ قَالَ فَقَالَ وَيْحَكَ وَمَنْ يَحُولُ بَيْنَكَ وَبَيْنَ التَّوْبَةِ اخْرُجْ مِنَ الْقَرْيَةِ الْخَبِيثَةِ الَّتِي أَنْتَ فِيهَا إِلَى الْقَرْيَةِ الصَّالِحَةِ قَرْيَةِ كَذَا وَكَذَا فَاعْبُدْ رَبَّكَ فِيهَا ‏.‏ فَخَرَجَ يُرِيدُ الْقَرْيَةَ الصَّالِحَةَ فَعَرَضَ لَهُ أَجَلُهُ فِي الطَّرِيقِ فَاخْتَصَمَتْ فِيهِ مَلاَئِكَةُ الرَّحْمَةِ وَمَلاَئِكَةُ الْعَذَابِ قَالَ إِبْلِيسُ أَنَا أَوْلَى بِهِ إِنَّهُ لَمْ يَعْصِنِي سَاعَةً قَطُّ ‏.‏ قَالَ فَقَالَتْ مَلاَئِكَةُ الرَّحْمَةِ إِنَّهُ خَرَجَ تَائِبًا ‏\"‏ ‏.‏ <br><p>\n قَالَ هَمَّامٌ فَحَدَّثَنِي حُمَيْدٌ الطَّوِيلُ، عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي رَافِعٍ، قَالَ فَبَعَثَ اللَّهُ عَزَّ وَجَلَّ مَلَكًا فَاخْتَصَمُوا إِلَيْهِ ثُمَّ رَجَعُوا فَقَالَ انْظُرُوا أَىَّ الْقَرْيَتَيْنِ كَانَتْ أَقْرَبَ فَأَلْحِقُوهُ بِأَهْلِهَا ‏.‏ <br><p>\n حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا هَمَّامُ بْنُ يَحْيَى، عَنْ قَتَادَةَ، عَنْ أَبِي الصِّدِّيقِ النَّاجِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ أَلاَ أُخْبِرُكُمْ بِمَا، سَمِعْتُ مِنْ، فِي رَسُولِ اللَّهِ صلى الله عليه وسلم سَمِعَتْهُ أُذُنَاىَ وَوَعَاهُ قَلْبِي ‏\"‏ إِنَّ عَبْدًا قَتَلَ تِسْعَةً وَتِسْعِينَ نَفْسًا ثُمَّ عَرَضَتْ لَهُ التَّوْبَةُ فَسَأَلَ عَنْ أَعْلَمِ أَهْلِ الأَرْضِ فَدُلَّ عَلَى رَجُلٍ فَأَتَاهُ ‏.‏ فَقَالَ إِنِّي قَتَلْتُ تِسْعَةً وَتِسْعِينَ نَفْسًا فَهَلْ لِي مِنْ تَوْبَةٍ قَالَ بَعْدَ تِسْعَةٍ وَتِسْعِينَ نَفْسًا ‏.‏ قَالَ فَانْتَضَى سَيْفَهُ فَقَتَلَهُ فَأَكْمَلَ بِهِ الْمِائَةَ ثُمَّ عَرَضَتْ لَهُ التَّوْبَةُ فَسَأَلَ عَنْ أَعْلَمِ أَهْلِ الأَرْضِ فَدُلَّ عَلَى رَجُلٍ فَأَتَاهُ فَقَالَ إِنِّي قَتَلْتُ مِائَةَ نَفْسٍ فَهَلْ لِي مِنْ تَوْبَةٍ قَالَ فَقَالَ وَيْحَكَ وَمَنْ يَحُولُ بَيْنَكَ وَبَيْنَ التَّوْبَةِ اخْرُجْ مِنَ الْقَرْيَةِ الْخَبِيثَةِ الَّتِي أَنْتَ فِيهَا إِلَى الْقَرْيَةِ الصَّالِحَةِ قَرْيَةِ كَذَا وَكَذَا فَاعْبُدْ رَبَّكَ فِيهَا ‏.‏ فَخَرَجَ يُرِيدُ الْقَرْيَةَ الصَّالِحَةَ فَعَرَضَ لَهُ أَجَلُهُ فِي الطَّرِيقِ فَاخْتَصَمَتْ فِيهِ مَلاَئِكَةُ الرَّحْمَةِ وَمَلاَئِكَةُ الْعَذَابِ قَالَ إِبْلِيسُ أَنَا أَوْلَى بِهِ إِنَّهُ لَمْ يَعْصِنِي سَاعَةً قَطُّ ‏.‏ قَالَ فَقَالَتْ مَلاَئِكَةُ الرَّحْمَةِ إِنَّهُ خَرَجَ تَائِبًا ‏\"‏ ‏.‏ <br><p>\n قَالَ هَمَّامٌ فَحَدَّثَنِي حُمَيْدٌ الطَّوِيلُ، عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي رَافِعٍ، قَالَ فَبَعَثَ اللَّهُ عَزَّ وَجَلَّ مَلَكًا فَاخْتَصَمُوا إِلَيْهِ ثُمَّ رَجَعُوا فَقَالَ انْظُرُوا أَىَّ الْقَرْيَتَيْنِ كَانَتْ أَقْرَبَ فَأَلْحِقُوهُ بِأَهْلِهَا ‏.‏ <br><p>\n قَالَ قَتَادَةُ فَحَدَّثَنَا الْحَسَنُ، قَالَ لَمَّا حَضَرَهُ الْمَوْتُ احْتَفَزَ بِنَفْسِهِ فَقَرُبَ مِنَ الْقَرْيَةِ الصَّالِحَةِ وَبَاعَدَ مِنْهُ الْقَرْيَةَ الْخَبِيثَةَ فَأَلْحَقُوهُ بِأَهْلِ الْقَرْيَةِ الصَّالِحَةِ ‏.‏ <br><p>\n قَالَ أَبُو الْحَسَنِ الْقَطَّانُ حَدَّثَنَا أَبُو الْعَبَّاسِ بْنُ عَبْدِ اللَّهِ بْنِ إِسْمَاعِيلَ الْبَغْدَادِيُّ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا هَمَّامٌ، فَذَكَرَ نَحْوَهُ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 8,
        "matchingEnglishURN": 1269390,
        "last_updated": null
    },
    {
        "arabicURN": 1327941,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "34.00",
        "hadithNumber": "2691",
        "bookName": " كتاب الديات ",
        "babName": null,
        "hadithText": "حَدَّثَنَا أَبُو عُمَيْرٍ، عِيسَى بْنُ مُحَمَّدٍ النَّحَّاسُ وَعِيسَى بْنُ يُونُسَ وَالْحُسَيْنُ بْنُ أَبِي السَّرِيِّ الْعَسْقَلاَنِيُّ قَالُوا حَدَّثَنَا ضَمْرَةُ بْنُ رَبِيعَةَ، عَنِ ابْنِ شَوْذَبٍ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ أَتَى رَجُلٌ بِقَاتِلِ وَلِيِّهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اعْفُ ‏\"‏ ‏.‏ فَأَبَى فَقَالَ ‏\"‏ خُذْ أَرْشَكَ ‏\"‏ ‏.‏ فَأَبَى ‏.‏ قَالَ ‏\"‏ اذْهَبْ فَاقْتُلْهُ فَإِنَّكَ مِثْلُهُ ‏\"‏ ‏.‏ قَالَ فَلُحِقَ بِهِ فَقِيلَ لَهُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ قَالَ ‏\"‏ اقْتُلْهُ فَإِنَّكَ مِثْلُهُ ‏\"‏ ‏.‏ فَخَلَّى سَبِيلَهُ ‏.‏ قَالَ فَرُئِيَ يَجُرُّ نِسْعَتَهُ ذَاهِبًا إِلَى أَهْلِهِ ‏.‏ قَالَ كَأَنَّهُ قَدْ كَانَ أَوْثَقَهُ ‏.‏ <br><p>\n<p> قَالَ أَبُو عُمَيْرٍ فِي حَدِيثِهِ قَالَ ابْنُ شَوْذَبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، فَلَيْسَ لأَحَدٍ بَعْدَ النَّبِيِّ صلى الله عليه وسلم أَنْ يَقُولَ ‏\"‏ اقْتُلْهُ فَإِنَّكَ مِثْلُهُ ‏\"‏ ‏.‏ قَالَ ابْنُ مَاجَهْ هَذَا حَدِيثُ الرَّمْلِيِّينَ لَيْسَ إِلاَّ عِنْدَهُمْ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 77,
        "matchingEnglishURN": 1270080,
        "last_updated": null
    },
    {
        "arabicURN": 1327281,
        "collection": "ibnmajah",
        "volumeNumber": 1,
        "bookNumber": 21,
        "babNumber": "5.00",
        "hadithNumber": "2627",
        "bookName": " كتاب الديات ",
        "babName": null,
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، وَمُحَمَّدُ بْنُ جَعْفَرٍ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ أَيُّوبَ، سَمِعْتُ الْقَاسِمَ بْنَ رَبِيعَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ قَتِيلُ الْخَطَإِ شِبْهِ الْعَمْدِ قَتِيلُ السَّوْطِ وَالْعَصَا مِائَةٌ مِنَ الإِبِلِ أَرْبَعُونَ مِنْهَا خَلِفَةً فِي بُطُونِهَا أَوْلاَدُهَا ‏\"‏ ‏.‏ <br><p>\n<p> حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنِ الْقَاسِمِ بْنِ رَبِيعَةَ، عَنْ عُقْبَةَ بْنِ أَوْسٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏",
        "annotations": null,
        "bookID": "21.0",
        "grade1": null,
        "ourHadithNumber": 13,
        "matchingEnglishURN": 1269440,
        "last_updated": null
    }
]