[
    {
        "arabicURN": 516040,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "1.00",
        "hadithNumber": "1600",
        "bookName": " كتاب القسامة ",
        "babName": " باب تَبْدِئَةِ أَهْلِ الدَّمِ فِي الْقَسَامَةِ",
        "hadithText": "قَالَ يَحْيَى عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، أَنَّهُ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ الأَنْصَارِيَّ وَمُحَيِّصَةَ بْنَ مَسْعُودٍ خَرَجَا إِلَى خَيْبَرَ فَتَفَرَّقَا فِي حَوَائِجِهِمَا فَقُتِلَ عَبْدُ اللَّهِ بْنُ سَهْلٍ فَقَدِمَ مُحَيِّصَةُ فَأَتَى هُوَ وَأَخُوهُ حُوَيِّصَةُ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ إِلَى النَّبِيِّ صلى الله عليه وسلم فَذَهَبَ عَبْدُ الرَّحْمَنِ لِيَتَكَلَّمَ لِمَكَانِهِ مِنْ أَخِيهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَبِّرْ كَبِّرْ ‏\"‏ ‏.‏ فَتَكَلَّمَ حُوَيِّصَةُ وَمُحَيِّصَةُ فَذَكَرَا شَأْنَ عَبْدِ اللَّهِ بْنِ سَهْلٍ ‏.‏ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَحْلِفُونَ خَمْسِينَ يَمِينًا وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ أَوْ قَاتِلِكُمْ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ لَمْ نَشْهَدْ وَلَمْ نَحْضُرْ ‏.‏ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَتُبْرِئُكُمْ يَهُودُ بِخَمْسِينَ يَمِينًا ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نَقْبَلُ أَيْمَانَ قَوْمٍ كُفَّارٍ قَالَ يَحْيَى بْنُ سَعِيدٍ فَزَعَمَ بُشَيْرُ بْنُ يَسَارٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَدَاهُ مِنْ عِنْدِهِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا وَالَّذِي سَمِعْتُ مِمَّنْ أَرْضَى فِي الْقَسَامَةِ وَالَّذِي اجْتَمَعَتْ عَلَيْهِ الأَئِمَّةُ فِي الْقَدِيمِ وَالْحَدِيثِ أَنْ يَبْدَأَ بِالأَيْمَانِ الْمُدَّعُونَ فِي الْقَسَامَةِ فَيَحْلِفُونَ وَأَنَّ الْقَسَامَةَ لاَ تَجِبُ إِلاَّ بِأَحَدِ أَمْرَيْنِ إِمَّا أَنْ يَقُولَ الْمَقْتُولُ دَمِي عِنْدَ فُلاَنٍ أَوْ يَأْتِيَ وُلاَةُ الدَّمِ بِلَوْثٍ مِنْ بَيِّنَةٍ وَإِنْ لَمْ تَكُنْ قَاطِعَةً عَلَى الَّذِي يُدَّعَى عَلَيْهِ الدَّمُ فَهَذَا يُوجِبُ الْقَسَامَةَ لِلْمُدَّعِينَ الدَّمَ عَلَى مَنِ ادَّعَوْهُ عَلَيْهِ وَلاَ تَجِبُ الْقَسَامَةُ عِنْدَنَا إِلاَّ بِأَحَدِ هَذَيْنِ الْوَجْهَيْنِ ‏.‏ قَالَ مَالِكٌ وَتِلْكَ السُّنَّةُ الَّتِي لاَ اخْتِلاَفَ فِيهَا عِنْدَنَا وَالَّذِي لَمْ يَزَلْ عَلَيْهِ عَمَلُ النَّاسِ أَنَّ الْمُبَدَّئِينَ بِالْقَسَامَةِ أَهْلُ الدَّمِ وَالَّذِينَ يَدَّعُونَهُ فِي الْعَمْدِ وَالْخَطَإِ ‏.‏ قَالَ مَالِكٌ وَقَدْ بَدَّأَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْحَارِثِيِّينَ فِي قَتْلِ صَاحِبِهِمُ الَّذِي قُتِلَ بِخَيْبَرَ ‏.‏ قَالَ مَالِكٌ فَإِنْ حَلَفَ الْمُدَّعُونَ اسْتَحَقُّوا دَمَ صَاحِبِهِمْ وَقَتَلُوا مَنْ حَلَفُوا عَلَيْهِ وَلاَ يُقْتَلُ فِي الْقَسَامَةِ إِلاَّ وَاحِدٌ لاَ يُقْتَلُ فِيهَا اثْنَانِ يَحْلِفُ مِنْ وُلاَةِ الدَّمِ خَمْسُونَ رَجُلاً خَمْسِينَ يَمِينًا فَإِنْ قَلَّ عَدَدُهُمْ أَوْ نَكَلَ بَعْضُهُمْ رُدَّتِ الأَيْمَانُ عَلَيْهِمْ إِلاَّ أَنْ يَنْكُلَ أَحَدٌ مِنْ وُلاَةِ الْمَقْتُولِ وُلاَةِ الدَّمِ الَّذِينَ يَجُوزُ لَهُمُ الْعَفْوُ عَنْهُ فَإِنْ نَكَلَ أَحَدٌ مِنْ أُولَئِكَ فَلاَ سَبِيلَ إِلَى الدَّمِ إِذَا نَكَلَ أَحَدٌ مِنْهُمْ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَإِنَّمَا تُرَدُّ الأَيْمَانُ عَلَى مَنْ بَقِيَ مِنْهُمْ إِذَا نَكَلَ أَحَدٌ مِمَّنْ لاَ يَجُوزُ لَهُ عَفْوٌ فَإِنْ نَكَلَ أَحَدٌ مِنْ وُلاَةِ الدَّمِ الَّذِينَ يَجُوزُ لَهُمُ الْعَفْوُ عَنِ الدَّمِ وَإِنْ كَانَ وَاحِدًا فَإِنَّ الأَيْمَانَ لاَ تُرَدُّ عَلَى مَنْ بَقِيَ مِنْ وُلاَةِ الدَّمِ إِذَا نَكَلَ أَحَدٌ مِنْهُمْ عَنِ الأَيْمَانِ وَلَكِنِ الأَيْمَانُ إِذَا كَانَ ذَلِكَ تُرَدُّ عَلَى الْمُدَّعَى عَلَيْهِمْ فَيَحْلِفُ مِنْهُمْ خَمْسُونَ رَجُلاً خَمْسِينَ يَمِينًا فَإِنْ لَمْ يَبْلُغُوا خَمْسِينَ رَجُلاً رُدَّتِ الأَيْمَانُ عَلَى مَنْ حَلَفَ مِنْهُمْ فَإِنْ لَمْ يُوجَدْ أَحَدٌ إِلاَّ الَّذِي ادُّعِيَ عَلَيْهِ حَلَفَ هُوَ خَمْسِينَ يَمِينًا وَبَرِئَ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَإِنَّمَا فُرِقَ بَيْنَ الْقَسَامَةِ فِي الدَّمِ وَالأَيْمَانِ فِي الْحُقُوقِ أَنَّ الرَّجُلَ إِذَا دَايَنَ الرَّجُلَ اسْتَثْبَتَ عَلَيْهِ فِي حَقِّهِ وَأَنَّ الرَّجُلَ إِذَا أَرَادَ قَتْلَ الرَّجُلِ لَمْ يَقْتُلْهُ فِي جَمَاعَةٍ مِنَ النَّاسِ وَإِنَّمَا يَلْتَمِسُ الْخَلْوَةَ ‏.‏ قَالَ فَلَوْ لَمْ تَكُنِ الْقَسَامَةُ إِلاَّ فِيمَا تَثْبُتُ فِيهِ الْبَيِّنَةُ وَلَوْ عُمِلَ فِيهَا كَمَا يُعْمَلُ فِي الْحُقُوقِ هَلَكَتِ الدِّمَاءُ وَاجْتَرَأَ النَّاسُ عَلَيْهَا إِذَا عَرَفُوا الْقَضَاءَ فِيهَا وَلَكِنْ إِنَّمَا جُعِلَتِ الْقَسَامَةُ إِلَى وُلاَةِ الْمَقْتُولِ يُبَدَّءُونَ بِهَا فِيهَا لِيَكُفَّ النَّاسُ عَنِ الدَّمِ وَلِيَحْذَرَ الْقَاتِلُ أَنْ يُؤْخَذَ فِي مِثْلِ ذَلِكَ بِقَوْلِ الْمَقْتُولِ ‏.‏ قَالَ يَحْيَى وَقَدْ قَالَ مَالِكٌ فِي الْقَوْمِ يَكُونُ لَهُمُ الْعَدُوُّ يُتَّهَمُونَ بِالدَّمِ فَيَرُدُّ وُلاَةُ الْمَقْتُولِ الأَيْمَانَ عَلَيْهِمْ وَهُمْ نَفَرٌ لَهُمْ عَدَدٌ أَنَّهُ يَحْلِفُ كُلُّ إِنْسَانٍ مِنْهُمْ عَنْ نَفْسِهِ خَمْسِينَ يَمِينًا وَلاَ تُقْطَعُ الأَيْمَانُ عَلَيْهِمْ بِقَدْرِ عَدَدِهِمْ وَلاَ يَبْرَءُونَ دُونَ أَنْ يَحْلِفَ كُلُّ إِنْسَانٍ عَنْ نَفْسِهِ خَمْسِينَ يَمِينًا ‏.‏ قَالَ مَالِكٌ وَهَذَا أَحْسَنُ مَا سَمِعْتُ فِي ذَلِكَ ‏.‏ قَالَ وَالْقَسَامَةُ تَصِيرُ إِلَى عَصَبَةِ الْمَقْتُولِ وَهُمْ وُلاَةُ الدَّمِ الَّذِينَ يَقْسِمُونَ عَلَيْهِ وَالَّذِينَ يُقْتَلُ بِقَسَامَتِهِمْ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 2,
        "matchingEnglishURN": 416560,
        "last_updated": null
    },
    {
        "arabicURN": 516030,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "1.00",
        "hadithNumber": "1599",
        "bookName": " كتاب القسامة ",
        "babName": " باب تَبْدِئَةِ أَهْلِ الدَّمِ فِي الْقَسَامَةِ",
        "hadithText": "حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي لَيْلَى بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَهْلٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، أَنَّهُ أَخْبَرَهُ رِجَالٌ، مِنْ كُبَرَاءِ قَوْمِهِ أَنَّ عَبْدَ، اللَّهِ بْنَ سَهْلٍ وَمُحَيِّصَةَ خَرَجَا إِلَى خَيْبَرَ مِنْ جَهْدٍ أَصَابَهُمْ فَأُتِيَ مُحَيِّصَةُ فَأُخْبِرَ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ قَدْ قُتِلَ وَطُرِحَ فِي فَقِيرِ بِئْرٍ أَوْ عَيْنٍ فَأَتَى يَهُودَ فَقَالَ أَنْتُمْ وَاللَّهِ قَتَلْتُمُوهُ ‏.‏ فَقَالُوا وَاللَّهِ مَا قَتَلْنَاهُ ‏.‏ فَأَقْبَلَ حَتَّى قَدِمَ عَلَى قَوْمِهِ فَذَكَرَ لَهُمْ ذَلِكَ ثُمَّ أَقْبَلَ هُوَ وَأَخُوهُ حُوَيِّصَةُ وَهُوَ أَكْبَرُ مِنْهُ وَعَبْدُ الرَّحْمَنِ فَذَهَبَ مُحَيِّصَةُ لِيَتَكَلَّمَ وَهُوَ الَّذِي كَانَ بِخَيْبَرَ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَبِّرْ كَبِّرْ ‏\"‏ يُرِيدُ السِّنَّ فَتَكَلَّمَ حُوَيِّصَةُ ثُمَّ تَكَلَّمَ مُحَيِّصَةُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِمَّا أَنْ يَدُوا صَاحِبَكُمْ وَإِمَّا أَنْ يُؤْذِنُوا بِحَرْبٍ ‏\"‏ ‏.‏ فَكَتَبَ إِلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ذَلِكَ فَكَتَبُوا إِنَّا وَاللَّهِ مَا قَتَلْنَاهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِحُوَيِّصَةَ وَمُحَيِّصَةَ وَعَبْدِ الرَّحْمَنِ ‏\"‏ أَتَحْلِفُونَ وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ ‏\"‏ ‏.‏ فَقَالُوا لاَ ‏.‏ قَالَ ‏\"‏ أَفَتَحْلِفُ لَكُمْ يَهُودُ ‏\"‏ قَالُوا لَيْسُوا بِمُسْلِمِينَ ‏.‏ فَوَدَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ عِنْدِهِ فَبَعَثَ إِلَيْهِمْ بِمِائَةِ نَاقَةٍ حَتَّى أُدْخِلَتْ عَلَيْهِمُ الدَّارَ ‏.‏ قَالَ سَهْلٌ لَقَدْ رَكَضَتْنِي مِنْهَا نَاقَةٌ حَمْرَاءُ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 1,
        "matchingEnglishURN": 416550,
        "last_updated": null
    },
    {
        "arabicURN": 516041,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "2.00",
        "hadithNumber": "1600",
        "bookName": "كتاب القسامة",
        "babName": "باب مَنْ تَجُوزُ قَسَامَتُهُ فِي الْعَمْدِ مِنْ وُلاَةِ الدَّم",
        "hadithText": "قَالَ يَحْيَى قَالَ مَالِكٌ الأَمْرُ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا أَنَّهُ لاَ يَحْلِفُ فِي الْقَسَامَةِ فِي الْعَمْدِ أَحَدٌ مِنَ النِّسَاءِ وَإِنْ لَمْ يَكُنْ لِلْمَقْتُولِ وُلاَةٌ إِلاَّ النِّسَاءُ فَلَيْسَ لِلنِّسَاءِ فِي قَتْلِ الْعَمْدِ قَسَامَةٌ وَلاَ عَفْوٌ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ فِي الرَّجُلِ يُقْتَلُ عَمْدًا أَنَّهُ إِذَا قَامَ عَصَبَةُ الْمَقْتُولِ أَوْ مَوَالِيهِ فَقَالُوا نَحْنُ نَحْلِفُ وَنَسْتَحِقُّ دَمَ صَاحِبِنَا ‏.‏ فَذَلِكَ لَهُمْ ‏.‏ قَالَ مَالِكٌ فَإِنْ أَرَادَ النِّسَاءُ أَنْ يَعْفُونَ عَنْهُ فَلَيْسَ ذَلِكَ لَهُنَّ الْعَصَبَةُ وَالْمَوَالِي ‏.‏ أَوْلَى بِذَلِكَ مِنْهُنَّ لأَنَّهُمْ هُمُ الَّذِينَ اسْتَحَقُّوا الدَّمَ وَحَلَفُوا عَلَيْهِ ‏.‏ قَالَ مَالِكٌ وَإِنْ عَفَتِ الْعَصَبَةُ أَوِ الْمَوَالِي بَعْدَ أَنْ يَسْتَحِقُّوا الدَّمَ وَأَبَى النِّسَاءُ وَقُلْنَ لاَ نَدَعُ قَاتِلَ صَاحِبِنَا فَهُنَّ أَحَقُّ وَأَوْلَى بِذَلِكَ لأَنَّ مَنْ أَخَذَ الْقَوَدَ أَحَقُّ مِمَّنْ تَرَكَهُ مِنَ النِّسَاءِ وَالْعَصَبَةِ إِذَا ثَبَتَ الدَّمُ وَوَجَبَ الْقَتْلُ ‏.‏ قَالَ مَالِكٌ لاَ يُقْسِمُ فِي قَتْلِ الْعَمْدِ مِنَ الْمُدَّعِينَ إِلاَّ اثْنَانِ فَصَاعِدًا تُرَدَّدُ الأَيْمَانُ عَلَيْهِمَا حَتَّى يَحْلِفَا خَمْسِينَ يَمِينًا ثُمَّ قَدِ اسْتَحَقَّا الدَّمَ وَذَلِكَ الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ وَإِذَا ضَرَبَ النَّفَرُ الرَّجُلَ حَتَّى يَمُوتَ تَحْتَ أَيْدِيهِمْ قُتِلُوا بِهِ جَمِيعًا فَإِنْ هُوَ مَاتَ بَعْدَ ضَرْبِهِمْ كَانَتِ الْقَسَامَةُ وَإِذَا كَانَتِ الْقَسَامَةُ لَمْ تَكُنْ إِلاَّ عَلَى رَجُلٍ وَاحِدٍ وَلَمْ يُقْتَلْ غَيْرُهُ وَلَمْ نَعْلَمْ قَسَامَةً كَانَتْ قَطُّ إِلاَّ عَلَى رَجُلٍ وَاحِدٍ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 3,
        "matchingEnglishURN": 416570,
        "last_updated": null
    },
    {
        "arabicURN": 516042,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "3.00",
        "hadithNumber": "1600",
        "bookName": "كتاب القسامة",
        "babName": "باب الْقَسَامَةِ فِي قَتْلِ الْخَطَإ",
        "hadithText": "قَالَ يَحْيَى قَالَ مَالِكٌ الْقَسَامَةُ فِي قَتْلِ الْخَطَإِ يُقْسِمُ الَّذِينَ يَدَّعُونَ الدَّمَ وَيَسْتَحِقُّونَهُ بِقَسَامَتِهِمْ يَحْلِفُونَ خَمْسِينَ يَمِينًا تَكُونُ عَلَى قَسْمِ مَوَارِيثِهِمْ مِنَ الدِّيَةِ فَإِنْ كَانَ فِي الأَيْمَانِ كُسُورٌ إِذَا قُسِمَتْ بَيْنَهُمْ نُظِرَ إِلَى الَّذِي يَكُونُ عَلَيْهِ أَكْثَرُ تِلْكَ الأَيْمَانِ إِذَا قُسِمَتْ فَتُجْبَرُ عَلَيْهِ تِلْكَ الْيَمِينُ ‏.‏ قَالَ مَالِكٌ فَإِنْ لَمْ يَكُنْ لِلْمَقْتُولِ وَرَثَةٌ إِلاَّ النِّسَاءُ فَإِنَّهُنَّ يَحْلِفْنَ وَيَأْخُذْنَ الدِّيَةَ فَإِنْ لَمْ يَكُنْ لَهُ وَارِثٌ إِلاَّ رَجُلٌ وَاحِدٌ حَلَفَ خَمْسِينَ يَمِينًا وَأَخَذَ الدِّيَةَ وَإِنَّمَا يَكُونَ ذَلِكَ فِي قَتْلِ الْخَطَإِ وَلاَ يَكُونُ فِي قَتْلِ الْعَمْدِ ‏.‏",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 4,
        "matchingEnglishURN": 416580,
        "last_updated": null
    },
    {
        "arabicURN": 516043,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "4.00",
        "hadithNumber": "1600",
        "bookName": "كتاب القسامة",
        "babName": " باب الْمِيرَاثِ فِي الْقَسَامَة",
        "hadithText": "قَالَ يَحْيَى قَالَ مَالِكٌ إِذَا قَبِلَ وُلاَةُ الدَّمِ الدِّيَةَ فَهِيَ مَوْرُوثَةٌ عَلَى كِتَابِ اللَّهِ يَرِثُهَا بَنَاتُ الْمَيِّتِ وَأَخَوَاتُهُ وَمَنْ يَرِثُهُ مِنَ النِّسَاءِ فَإِنْ لَمْ يُحْرِزِ النِّسَاءُ مِيرَاثَهُ كَانَ مَا بَقِيَ مِنْ دِيَتِهِ لأَوْلَى النَّاسِ بِمِيرَاثِهِ مَعَ النِّسَاءِ ‏.‏ قَالَ مَالِكٌ إِذَا قَامَ بَعْضُ وَرَثَةِ الْمَقْتُولِ الَّذِي يُقْتَلُ خَطَأً يُرِيدُ أَنْ يَأْخُذَ مِنَ الدِّيَةِ بِقَدْرِ حَقِّهِ مِنْهَا وَأَصْحَابُهُ غَيَبٌ لَمْ يَأْخُذْ ذَلِكَ وَلَمْ يَسْتَحِقَّ مِنَ الدِّيَةِ شَيْئًا قَلَّ وَلاَ كَثُرَ دُونَ أَنْ يَسْتَكْمِلَ الْقَسَامَةَ يَحْلِفُ خَمْسِينَ يَمِينًا فَإِنْ حَلَفَ خَمْسِينَ يَمِينًا اسْتَحَقَّ حِصَّتَهُ مِنَ الدِّيَةِ وَذَلِكَ أَنَّ الدَّمَ لاَ يَثْبُتُ إِلاَّ بِخَمْسِينَ يَمِينًا وَلاَ تَثْبُتُ الدِّيَةُ حَتَّى يَثْبُتَ الدَّمُ فَإِنْ جَاءَ بَعْدَ ذَلِكَ مِنَ الْوَرَثَةِ أَحَدٌ حَلَفَ مِنَ الْخَمْسِينَ يَمِينًا بِقَدْرِ مِيرَاثِهِ وَأَخَذَ حَقَّهُ حَتَّى يَسْتَكْمِلَ الْوَرَثَةُ حُقُوقَهُمْ إِنْ جَاءَ أَخٌ لأُمٍّ فَلَهُ السُّدُسُ وَعَلَيْهِ مِنَ الْخَمْسِينَ يَمِينًا السُّدُسُ فَمَنْ حَلَفَ اسْتَحَقَّ مِنَ الدِّيَةِ وَمَنْ نَكَلَ بَطَلَ حَقُّهُ وَإِنْ كَانَ بَعْضُ الْوَرَثَةِ غَائِبًا أَوْ صَبِيًّا لَمْ يَبْلُغْ حَلَفَ الَّذِينَ حَضَرُوا خَمْسِينَ يَمِينًا فَإِنْ جَاءَ الْغَائِبُ بَعْدَ ذَلِكَ أَوْ بَلَغَ الصَّبِيُّ الْحُلُمَ حَلَفَ كُلٌّ مِنْهُمَا يَحْلِفُونَ عَلَى قَدْرِ حُقُوقِهِمْ مِنَ الدِّيَةِ وَعَلَى قَدْرِ مَوَارِيثِهِمْ مِنْهَا ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَهَذَا أَحْسَنُ مَا سَمِعْتُ ‏.",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 5,
        "matchingEnglishURN": 416590,
        "last_updated": null
    },
    {
        "arabicURN": 516044,
        "collection": "malik",
        "volumeNumber": 1,
        "bookNumber": 44,
        "babNumber": "5.00",
        "hadithNumber": "1600",
        "bookName": "كتاب القسامة",
        "babName": "باب الْقَسَامَةِ فِي الْعَبِيد",
        "hadithText": "قَالَ يَحْيَى قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي الْعَبِيدِ أَنَّهُ إِذَا أُصِيبَ الْعَبْدُ عَمْدًا أَوْ خَطَأً ثُمَّ جَاءَ سَيِّدُهُ بِشَاهِدٍ حَلَفَ مَعَ شَاهِدِهِ يَمِينًا وَاحِدَةً ثُمَّ كَانَ لَهُ قِيمَةُ عَبْدِهِ وَلَيْسَ فِي الْعَبِيدِ قَسَامَةٌ فِي عَمْدٍ وَلاَ خَطَإٍ وَلَمْ أَسْمَعْ أَحَدًا مِنْ أَهْلِ الْعِلْمِ قَالَ ذَلِكَ ‏.‏ قَالَ مَالِكٌ فَإِنْ قُتِلَ الْعَبْدُ عَمْدًا أَوْ خَطَأً لَمْ يَكُنْ عَلَى سَيِّدِ الْعَبْدِ الْمَقْتُولِ قَسَامَةٌ وَلاَ يَمِينٌ وَلاَ يَسْتَحِقُّ سَيِّدُهُ ذَلِكَ إِلاَّ بِبَيِّنَةٍ عَادِلَةٍ أَوْ بِشَاهِدٍ فَيَحْلِفُ مَعَ شَاهِدِهِ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَهَذَا أَحْسَنُ مَا سَمِعْتُ ‏.",
        "annotations": null,
        "bookID": "44.0",
        "grade1": null,
        "ourHadithNumber": 6,
        "matchingEnglishURN": 416600,
        "last_updated": null
    }
]