[
    {
        "arabicURN": 1902230,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 33,
        "babNumber": "33.00",
        "hadithNumber": "222",
        "bookName": "باب كيف كان كلام رسول الله صلى الله عليه وسلم",
        "babName": "باب كيف كان كلام رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ الْبَصْرِيُّ، قَالَ‏:‏ حَدَّثَنَا حُمَيْدُ بْنُ الأَسْوَدِ، عَنِ أُسَامَةَ بْنِ زَيْدٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ‏:‏ مَا كَانَ رَسُولُ اللهِ صلى الله عليه وسلم يَسْرُدُ سرْدَكُمْ هَذَا، وَلَكِنَّهُ كَانَ يَتَكَلَّمُ بِكَلامٍ بَيِّنٍ فَصْلٍ، يَحْفَظُهُ مَنْ جَلَسَ إِلَيْهِ‏.‏",
        "annotations": null,
        "bookID": "33.0",
        "grade1": null,
        "ourHadithNumber": 1,
        "matchingEnglishURN": 1802120,
        "last_updated": null
    },
    {
        "arabicURN": 1902240,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 33,
        "babNumber": "33.00",
        "hadithNumber": "223",
        "bookName": "باب كيف كان كلام رسول الله صلى الله عليه وسلم",
        "babName": "باب كيف كان كلام رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، قَالَ‏:‏ حَدَّثَنَا أَبُو قُتَيْبَةَ سَلْمُ بْنُ قُتَيْبَةَ، عَنْ عَبْدِ اللهِ بْنِ الْمُثَنَّى، عَنْ ثُمَامَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم، يُعِيدُ الْكَلِمَةَ ثَلاثًا لِتُعْقَلَ عَنْهُ‏.‏",
        "annotations": null,
        "bookID": "33.0",
        "grade1": null,
        "ourHadithNumber": 2,
        "matchingEnglishURN": 1802130,
        "last_updated": null
    },
    {
        "arabicURN": 1902250,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 33,
        "babNumber": "33.00",
        "hadithNumber": "224",
        "bookName": "باب كيف كان كلام رسول الله صلى الله عليه وسلم",
        "babName": "باب كيف كان كلام رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، قَالَ‏:‏ حَدَّثَنَا جُمَيْعُ بْنُ عُمَرَ بْنِ عَبْدِ الرَّحْمَنِ الْعِجْلِيُّ، قَالَ‏:‏ حدَّثنِي رَجُلٌ مِنْ بَنِي تَمِيمٍ مِنْ وَلَدِ أَبِي هَالَةَ زَوْجِ خَدِيجَةَ يُكْنَى أَبَا عَبْدِ اللهِ، عَنِ ابْنٍ لأَبِي هَالَةَ، عَنِ الْحَسَنِ بْنِ عَلِيٍّ، قَالَ‏:‏ سَأَلْتُ خَالِي هِنْدُ بْنُ أَبِي هَالَةَ، وَكَانَ وَصَّافًا، فَقُلْتُ‏:‏ صِفْ لِي مَنْطِقَ رَسُولِ اللهِ صلى الله عليه وسلم، قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم مُتَوَاصِلَ الأَحْزَانِ، دَائِمَ الْفِكْرَةِ، لَيْسَتْ لَهُ رَاحَةٌ، طَوِيلُ السَّكْتِ، لا يَتَكَلَّمُ فِي غَيْرِ حَاجَةٍ، يَفْتَتِحُ الْكَلامَ، وَيَخْتِمُهُ بِاسْمِ اللهِ تَعَالَى، وَيَتَكَلَّمُ بِجَوَامِعِ الْكَلِمِ، كَلامُهُ فَصْلٌ، لا فُضُولَ، وَلا تَقْصِيرَ، لَيْسَ بِالْجَافِي، وَلا الْمُهِينِ، يُعَظِّمُ النِّعْمَةَ وَإِنْ دَقَّتْ لا يَذُمُّ مِنْهَا شَيْئًا، غَيْرَ أَنَّهُ لَمْ يَكُنْ يَذُمُّ ذَوَّاقًا وَلا يَمْدَحُهُ، وَلا تُغْضِبُهُ الدُّنْيَا، وَلا مَا كَانَ لَهَا، فَإِذَا تُعُدِّيَ الْحَقُّ، لَمْ يَقُمْ لِغَضَبِهِ شَيْءٌ، حَتَّى يَنْتَصِرَ لَهُ، وَلا يَغْضَبُ لِنَفْسِهِ، وَلا يَنْتَصِرُ لَهَا، إِذَا أَشَارَ بِكَفِّهِ كُلِّهَا، وَإِذَا تَعَجَّبَ قَلَبَهَا، وَإِذَا تَحَدَّثَ اتَّصَلَ بِهَا، وَضَرَبَ بِرَاحَتِهِ الْيُمْنَى بَطْنَ إِبْهَامِهِ الْيُسْرَى، وَإِذَا غَضِبَ أَعْرَضَ وَأَشَاحَ، وَإِذَا فَرِحَ غَضَّ طَرْفَهُ، جُلُّ ضَحِكِهِ التَّبَسُّمُ، يَفْتَرُّ عَنْ مِثْلِ حَبِّ الْغَمَامِ‏.‏\n</bdo>",
        "annotations": null,
        "bookID": "33.0",
        "grade1": null,
        "ourHadithNumber": 3,
        "matchingEnglishURN": 1802140,
        "last_updated": null
    }
]