[
    {
        "arabicURN": 1903430,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 48,
        "babNumber": "48.00",
        "hadithNumber": "342",
        "bookName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا عَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ الْمُقْرِئِ، قَالَ‏:‏ حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ، قَالَ‏:‏ حَدَّثَنِي أَبُو عُثْمَانَ الْوَلِيدُ بْنُ أَبِي الْوَلِيدِ، عَنْ سُلَيْمَانَ بْنِ خَارِجَةَ، عَنْ خَارِجَةَ بْنِ زَيْدِ بْنِ ثَابِتٍ، قَالَ‏:‏ دَخَلَ نَفَرٌ عَلَى زَيْدِ بْنِ ثَابِتٍ، فَقَالُوا لَهُ‏:‏ حَدِّثْنَا أَحَادِيثَ رَسُولِ اللهِ صلى الله عليه وسلم، قَالَ‏:‏ مَاذَا أُحَدِّثُكُمْ‏؟‏ كُنْتُ جَارَهُ فَكَانَ إِذَا نَزَلَ عَلَيْهِ الْوَحْيُ بَعَثَ إِلَيَّ فَكَتَبْتُهُ لَهُ، فَكُنَّا إِذَا ذَكَرْنَا الدُّنْيَا ذَكَرَهَا مَعَنَا، وَإِذَا ذَكَرْنَا الآخِرَةَ ذَكَرَهَا مَعَنَا، وَإِذَا ذَكَرْنَا الطَّعَامَ ذَكَرَهُ مَعَنَا، فَكُلُّ هَذَا أُحَدِّثُكُمْ عَنِ رَسُولِ اللهِ صلى الله عليه وسلم‏.‏",
        "annotations": null,
        "bookID": "48.0",
        "grade1": null,
        "ourHadithNumber": 1,
        "matchingEnglishURN": 1803250,
        "last_updated": null
    },
    {
        "arabicURN": 1903440,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 48,
        "babNumber": "48.00",
        "hadithNumber": "343",
        "bookName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى، قَالَ‏:‏ حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ زِيَادِ بْنِ أَبِي زِيَادٍ، عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ، عَنْ عَمْرِو بْنِ الْعَاصِ، قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم، يُقْبِلُ بِوَجْهِهِ وَحَدِيثِهِ عَلَى أَشَرِّ الْقَوْمِ، يَتَأَلَّفُهُمْ بِذَلِكَ فَكَانَ يُقْبِلُ بِوَجْهِهِ وَحَدِيثِهِ عَلَيَّ، حَتَّى ظَنَنْتُ أَنِّي خَيْرُ الْقَوْمِ، فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، أَنَا خَيْرٌ أَوْ أَبُو بَكْرٍ‏؟‏ فَقَالَ‏:‏ أَبُو بَكْرٍ، فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، أَنَا خَيْرٌ أَوْ عُمَرُ‏؟‏ فَقَالَ‏:‏ عُمَرُ، فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، أَنَا خَيْرٌ أَوْ عُثْمَانُ‏؟‏ فَقَالَ‏:‏ عُثْمَانُ، فَلَمَّا سَأَلْتُ رَسُولَ اللهِ صلى الله عليه وسلم، فَصَدَقَنِي فَلَوَدِدْتُ أَنِّي لَمْ أَكُنْ سَأَلْتُهُ‏.‏",
        "annotations": null,
        "bookID": "48.0",
        "grade1": null,
        "ourHadithNumber": 2,
        "matchingEnglishURN": 1803260,
        "last_updated": null
    },
    {
        "arabicURN": 1903450,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 48,
        "babNumber": "48.00",
        "hadithNumber": "344",
        "bookName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ‏:‏ حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ الضُّبَعِيُّ، عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ‏:‏ خَدَمْتُ رَسُولَ اللهِ صلى الله عليه وسلم عَشْرَ سِنِينَ، فَمَا قَالَ لِي أُفٍّ قَطُّ، وَمَا قَالَ لِشَيْءٍ صَنَعْتُهُ، لِمَ صَنَعْتَهُ، وَلا لِشَيْءٍ تَرَكْتُهُ، لِمَ تَرَكْتَهُ‏؟‏ وَكَانَ رَسُولُ اللهِ صلى الله عليه وسلم، مِنْ أَحْسَنِ النَّاسِ خُلُقًا، وَلا مَسَسْتُ خَزًّا وَلا حَرِيرًا، وَلا شَيْئًا كَانَ أَلْيَنَ مِنْ كَفِّ رَسُولِ اللهِ صلى الله عليه وسلم، وَلا شَمَمْتُ مِسْكًا قَطُّ، وَلا عِطْرًا كَانَ أَطْيَبَ مِنْ عَرَقِ رسول الله صلى الله عليه وسلم‏.‏",
        "annotations": null,
        "bookID": "48.0",
        "grade1": null,
        "ourHadithNumber": 3,
        "matchingEnglishURN": 1803270,
        "last_updated": null
    },
    {
        "arabicURN": 1903460,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 48,
        "babNumber": "48.00",
        "hadithNumber": "345",
        "bookName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَحَمْدُ بْنُ عَبْدَةَ هُوَ الضَّبِّيُّ، وَالْمَعْنَى وَاحِدٌ، قَالا‏:‏ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ سَلْمٍ الْعَلَوِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ رَسُولِ اللهِ صلى الله عليه وسلم، أَنَّهُ كَانَ عِنْدَهُ رَجُلٌ بِهِ أَثَرُ صُفْرَةٍ، قَالَ‏:‏ وَكَانَ رَسُولُ اللهِ صلى الله عليه وسلم، لا يكَادُ يُواجِهُ أَحَدًا بِشَيْءٍ يَكْرَهُهُ، فَلَمَّا قَامَ، قَالَ لِلْقَوْمِ‏:‏ لَوْ قُلْتُمْ لَهُ يَدَعُ هَذِهِ الصُّفْرَةَ‏.‏",
        "annotations": null,
        "bookID": "48.0",
        "grade1": null,
        "ourHadithNumber": 4,
        "matchingEnglishURN": 1803280,
        "last_updated": null
    },
    {
        "arabicURN": 1903470,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 48,
        "babNumber": "48.00",
        "hadithNumber": "346",
        "bookName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي عَبْدِ اللهِ الْجَدَلِيِّ وَاسْمُهُ عَبْدُ بْنُ عَبْدٍ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ‏:‏ لَمْ يَكُنْ رَسُولُ اللهِ صلى الله عليه وسلم، فَاحِشًا، وَلا مُتَفَحِّشًا وَلا صَخَّابًا فِي الأَسْوَاقِ، وَلا يَجْزِئُ بِالسَّيِّئَةِ السَّيِّئَةَ، وَلَكِنْ يَعْفُو وَيَصْفَحُ‏.‏",
        "annotations": null,
        "bookID": "48.0",
        "grade1": null,
        "ourHadithNumber": 5,
        "matchingEnglishURN": 1803290,
        "last_updated": null
    },
    {
        "arabicURN": 1903480,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 48,
        "babNumber": "48.00",
        "hadithNumber": "347",
        "bookName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا هَارُونُ بْنُ إِسْحَاقَ الْهَمْدَانِيُّ، قَالَ‏:‏ حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ‏:‏ مَا ضَرَبَ رَسُولُ اللهِ صلى الله عليه وسلم، بِيَدِهِ شَيْئًا قَطُّ، إِلا أَنْ يُجَاهِدَ فِي سَبِيلِ اللهِ، وَلا ضَرَبَ خَادِمًا َوِلا امْرَأَةً‏.‏",
        "annotations": null,
        "bookID": "48.0",
        "grade1": null,
        "ourHadithNumber": 6,
        "matchingEnglishURN": 1803300,
        "last_updated": null
    },
    {
        "arabicURN": 1903490,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 48,
        "babNumber": "48.00",
        "hadithNumber": "348",
        "bookName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ، قَالَ‏:‏ حَدَّثَنَا فُضَيْلُ بْنُ عِيَاضٍ، عَنْ مَنْصُورٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ‏:‏ مَا رَأَيْتُ رَسُولَ اللهِ صلى الله عليه وسلم مُنْتَصِرًا مِنْ مَظْلَمَةٍ ظُلِمَهَا قَطُّ، مَا لَمْ يُنْتَهَكْ مِنْ مَحَارِمِ اللهِ تَعَالَى شَيْءٌ، فَإِذَا انْتُهِكَ مِنْ مَحَارِمِ اللهِ شَيْءٌ كَانَ مِنْ أَشَدِّهِمْ فِي ذَلِكَ غَضَبًا، وَمَا خُيِّرَ بَيْنَ أَمْرَيْنِ، إِلا اخْتَارَ أَيْسَرَهُمَا، مَا لَمْ يَكُنْ مَأْثَمًا‏.‏",
        "annotations": null,
        "bookID": "48.0",
        "grade1": null,
        "ourHadithNumber": 7,
        "matchingEnglishURN": 1803310,
        "last_updated": null
    },
    {
        "arabicURN": 1903500,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 48,
        "babNumber": "48.00",
        "hadithNumber": "349",
        "bookName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتِ‏:‏ اسْتَأْذَنَ رَجُلٌ عَلَى رَسُولِ اللهِ صلى الله عليه وسلم، وَأَنَا عِنْدَهُ، فَقَالَ‏:‏ بِئْسَ ابْنُ الْعَشِيرَةِ أَوْ أَخُو الْعَشِيرَةِ، ثُمَّ أَذِنَ لَهُ، فَأَلانَ لَهُ الْقَوْلَ، فَلَمَّا خَرَجَ، قُلْتُ‏:‏ يَا رَسُولَ اللهِ، قُلْتَ مَا قُلْتَ ثُمَّ أَلَنْتَ لَهُ الْقَوْلَ‏؟‏ فَقَالَ‏:‏ يَا عَائِشَةُ، إِنَّ مِنْ شَرِّ النَّاسِ مَنْ تَرَكَهُ النَّاسُ أَوْ وَدَعَهُ النَّاسُ اتِّقَاءَ فُحْشِهِ‏.‏",
        "annotations": null,
        "bookID": "48.0",
        "grade1": null,
        "ourHadithNumber": 8,
        "matchingEnglishURN": 1803320,
        "last_updated": null
    },
    {
        "arabicURN": 1903510,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 48,
        "babNumber": "48.00",
        "hadithNumber": "350",
        "bookName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، قَالَ‏:‏ حَدَّثَنَا جُمَيْعُ بْنُ عُمَرَ بْنِ عَبْدِ الرَّحْمَنِ الْعِجْلِيُّ، قَالَ‏:‏ أَنْبَأَنَا رَجُلٌ مِنْ بَنِي تَمِيمٍ مِنْ وَلَدِ أَبِي هَالَةَ زَوْجِ خَدِيجَةَ، وَيُكْنَى أَبَا عَبْدِ اللهِ، عَنِ ابْنٍ لأَبِي هَالَةَ، عَنِ الْحَسَنِ بْنِ عَلِيٍّ، قَالَ‏:‏ قَالَ الْحُسَيْنُ‏:‏ سَأَلْتُ أَبي عَنْ سِيرَةِ النَّبِيِّ صلى الله عليه وسلم، فِي جُلَسَائِهِ، فَقَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم، دَائِمَ الْبِشْرِ، سَهْلَ الْخُلُقِ، لَيِّنَ الْجَانِبِ، لَيْسَ بِفَظٍّ وَلا غَلِيظٍ، وَلا صَخَّابٍ وَلا فَحَّاشٍ، وَلا عَيَّابٍ وَلا مُشَاحٍ، يَتَغَافَلُ عَمَّا لا يَشْتَهِي، وَلا يُؤْيِسُ مِنْهُ رَاجِيهِ وَلا يُخَيَّبُ فِيهِ، قَدْ تَرَكَ نَفْسَهُ مِنْ ثَلاثٍ‏:‏ الْمِرَاءِ، وَالإِكْثَارِ، وَمَا لا يَعْنِيهِ، وَتَرَكَ النَّاسَ مِنْ ثَلاثٍ‏:‏ كَانَ لا يَذُمُّ أَحَدًا، وَلا يَعِيبُهُ، وَلا يَطْلُبُ عَوْرتَهُ، وَلا يَتَكَلَّمُ إِلا فِيمَا رَجَا ثَوَابَهُ، وَإِذَا تَكَلَّمَ أَطْرَقَ جُلَسَاؤُهُ، كَأَنَّمَا عَلَى رُؤُوسِهِمُ الطَّيْرُ، فَإِذَا سَكَتَ تَكَلَّمُوا لا يَتَنَازَعُونَ عِنْدَهُ الْحَدِيثَ، وَمَنْ تَكَلَّمَ عِنْدَهُ أَنْصَتُوا لَهُ حَتَّى يَفْرُغَ، حَدِيثُهُمْ عِنْدَهُ حَدِيثُ أَوَّلِهِمْ، يَضْحَكُ مِمَّا يَضْحَكُونَ مِنْهُ، وَيَتَعَجَّبُ مِمَّا يَتَعَجَّبُونَ مِنْهُ، وَيَصْبِرُ لِلْغَرِيبِ عَلَى الْجَفْوَةِ فِي مَنْطِقِهِ وَمَسْأَلَتِهِ، حَتَّى إِنْ كَانَ أَصْحَابُهُ، وَيَقُولُ‏:‏ إِذَا رَأَيْتُمْ طَالِبَ حَاجَةٍ يِطْلُبُهَا فَأَرْفِدُوهُ، وَلا يَقْبَلُ الثَّنَاءَ إِلا مِنْ مُكَافِئٍ وَلا يَقْطَعُ عَلَى أَحَدٍ حَدِيثَهُ حَتَّى يَجُوزَ فَيَقْطَعُهُ بِنَهْيٍ أَوْ قِيَامٍ‏.‏",
        "annotations": null,
        "bookID": "48.0",
        "grade1": null,
        "ourHadithNumber": 9,
        "matchingEnglishURN": 1803330,
        "last_updated": null
    },
    {
        "arabicURN": 1903520,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 48,
        "babNumber": "48.00",
        "hadithNumber": "351",
        "bookName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، قَالَ‏:‏ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللهِ، يَقُولُ‏:‏ مَا سُئِلَ رَسُولُ اللهِ صلى الله عليه وسلم، شَيْئًا قَطُّ فَقَالَ‏:‏ لا‏.‏",
        "annotations": null,
        "bookID": "48.0",
        "grade1": null,
        "ourHadithNumber": 10,
        "matchingEnglishURN": 1803340,
        "last_updated": null
    },
    {
        "arabicURN": 1903530,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 48,
        "babNumber": "48.00",
        "hadithNumber": "352",
        "bookName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا عَبْدُ اللهِ بْنُ عِمْرَانَ أَبُو الْقَاسِمِ الْقُرَشِيُّ الْمَكِّيُّ، قَالَ‏:‏ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم، أَجْوَدَ النَّاسِ بِالْخَيْرِ، وَكَانَ أَجْوَدَ مَا يَكُونُ فِي شَهْرِ رَمَضَانَ، حَتَّى يَنْسَلِخَ، فَيَأْتِيهِ جِبْرِيلُ، فَيَعْرِضُ عَلَيْهِ الْقُرْآنَ، فَإِذَا لَقِيَهُ جِبْرِيلُ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم، أَجْوَدَ بِالْخَيْرِ مِنَ الرِّيحِ الْمُرْسَلَةِ‏.‏",
        "annotations": null,
        "bookID": "48.0",
        "grade1": null,
        "ourHadithNumber": 11,
        "matchingEnglishURN": 1803350,
        "last_updated": null
    },
    {
        "arabicURN": 1903540,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 48,
        "babNumber": "48.00",
        "hadithNumber": "353",
        "bookName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ‏:‏ أَخْبَرَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم، لا يَدَّخِرُ شَيْئًا لِغَدٍ‏.‏",
        "annotations": null,
        "bookID": "48.0",
        "grade1": null,
        "ourHadithNumber": 12,
        "matchingEnglishURN": 1803360,
        "last_updated": null
    },
    {
        "arabicURN": 1903550,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 48,
        "babNumber": "48.00",
        "hadithNumber": "354",
        "bookName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا هَارُونُ بْنُ مُوسَى بْنِ أَبِي عَلْقَمَةَ الْمَدِينِيُّ، قَالَ‏:‏ حَدَّثَنِي أَبِي، عَنْ هِشَامِ بْنِ سَعْدٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، أَنَّ رَجُلا جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم، فَسَأَلَهُ أَنْ يُعْطِيَهُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ مَا عِنْدِي شَيْءٌ، وَلَكِنِ ابْتَعْ عَلَيَّ، فَإِذَا جَاءَنِي شَيْءٌ قَضَيْتُهُ فَقَالَ عُمَرُ‏:‏ يَا رَسُولَ اللهِ، قَدْ أَعْطَيْتُهُ فَمَّا كَلَّفَكَ اللَّهُ مَا لا تَقْدِرُ عَلَيْهِ، فَكَرِهَ النَّبِيُّ صلى الله عليه وسلم قَوْلَ عُمَرَ، فَقَالَ رَجُلٌ مِنَ الأَنْصَارِ‏:‏ يَا رَسُولَ اللهِ، أَنْفِقْ وَلا تَخَفْ مِنْ ذِي الْعَرْشِ إِقْلالا، فَتَبَسَّمَ رَسُولُ اللهِ صلى الله عليه وسلم وَعُرِفَ فِي وَجْهِهِ الْبِشْرَ لِقَوْلِ الأَنْصَارِيِّ، ثُمَّ قَالَ‏:‏ بِهَذَا أُمِرْتُ‏.‏",
        "annotations": null,
        "bookID": "48.0",
        "grade1": null,
        "ourHadithNumber": 13,
        "matchingEnglishURN": 1803370,
        "last_updated": null
    },
    {
        "arabicURN": 1903560,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 48,
        "babNumber": "48.00",
        "hadithNumber": "355",
        "bookName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ‏:‏ أَخْبَرَنَا شَرِيكٌ، عَنْ عَبْدِ اللهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، عَنِ الرُّبَيِّعِ بِنْتِ مُعَوِّذِ بْنِ عَفْرَاءَ، قَالَتْ‏:‏ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم، بِقِنَاعٍ مِنْ رُطَبٍ وَأَجْرٍ زُغْبٍ، فَأَعْطَانِي مِلْءَ كَفِّهِ حُلِيًّا وَذَهَبًا‏.‏",
        "annotations": null,
        "bookID": "48.0",
        "grade1": null,
        "ourHadithNumber": 14,
        "matchingEnglishURN": 1803380,
        "last_updated": null
    },
    {
        "arabicURN": 1903570,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 48,
        "babNumber": "48.00",
        "hadithNumber": "356",
        "bookName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في خلق رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، وَغَيْرُ وَاحِدٍ، قَالُوا‏:‏ حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ‏:‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم، كَانَ يَقْبَلُ الْهَدِيَّةَ، وَيُثِيبُ عَلَيْهَا‏.‏",
        "annotations": null,
        "bookID": "48.0",
        "grade1": null,
        "ourHadithNumber": 15,
        "matchingEnglishURN": 1803390,
        "last_updated": null
    }
]