[
    {
        "arabicURN": 1903660,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 51,
        "babNumber": "51.00",
        "hadithNumber": "365",
        "bookName": "باب ماجاء في قراءة رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في قراءة رسول الله صلى الله عليه وسلم",
        "hadithText": "عن سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ، وَغَيْرُ وَاحِدٍ، قَالُوا‏:‏ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ أَبِيهِ، قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِنَّ لِي أَسْمَاءً، أَنَا مُحَمَّدٌ، وَأَنَا أَحْمَدُ، وَأَنَا الْمَاحِي الَّذِي يَمْحُو اللَّهُ بِيَ الْكُفْرَ، وَأَنَا الْحَاشِرُ الَّذِي يُحْشَرُ النَّاسُ عَلَى قَدَمِي، وَأَنَا الْعَاقِبُ الَّذِي لَيْسَ بَعْدَهُ نَبِيٌّ‏.‏",
        "annotations": null,
        "bookID": "51.0",
        "grade1": null,
        "ourHadithNumber": 1,
        "matchingEnglishURN": 1803590,
        "last_updated": null
    },
    {
        "arabicURN": 1903670,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 51,
        "babNumber": "51.00",
        "hadithNumber": "366, 367",
        "bookName": "باب ماجاء في قراءة رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في قراءة رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ الْكُوفِيُّ، قَالَ‏:‏ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنْ عَاصِمٍ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ، قَالَ‏:‏ لَقِيتُ النَّبِيَّ صلى الله عليه وسلم، فِي بَعْضِ طُرُقِ الْمَدِينَةِ، فَقَالَ‏:‏ أَنَا مُحَمَّدٌ، وَأَنَا أَحْمَدُ، وَأَنَا نَبِيُّ الرَّحْمَةِ، وَنَبِيُّ التَّوْبَةِ، وَأَنَا الْمُقَفَّى، وَأَنَا الْحَاشِرُ، وَنَبِيُّ الْمَلاحِمِ‏.‏\n<p>\nحَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ‏:‏ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ، قَالَ‏:‏ أَنْبَأَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ عَاصِمٍ، عَنْ زِرٍّ، عَنْ حُذَيْفَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم، نَحْوَهُ بِمَعْنَاهُ، هَكَذَا، قَالَ حَمَّادُ بْنُ سَلَمَةَ، عَنْ عَاصِمٍ، عَنْ زِرٍّ، عَنْ حُذَيْفَةَ‏.‏",
        "annotations": null,
        "bookID": "51.0",
        "grade1": null,
        "ourHadithNumber": 2,
        "matchingEnglishURN": 1803600,
        "last_updated": null
    }
]