[
    {
        "arabicURN": 1903690,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 52,
        "babNumber": "52.00",
        "hadithNumber": "370",
        "bookName": "باب ماجاء في عيش رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في عيش رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ سِمَاكِ بْنِ حَرْبٍ، قَالَ‏:‏ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ، يَقُولُ‏:‏ أَلَسْتُمْ فِي طَعَامٍ وَشَرَابٍ مَا شِئِتُمْ‏؟‏ لَقَدْ رَأَيْتُ نَبِيَّكُمْ صلى الله عليه وسلم، وَمَا يَجِدُ مِنَ الدَّقَلِ، مَا يَمْلأُ بَطْنَهُ‏.‏",
        "annotations": null,
        "bookID": "52.0",
        "grade1": null,
        "ourHadithNumber": 1,
        "matchingEnglishURN": 1803500,
        "last_updated": null
    },
    {
        "arabicURN": 1903700,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 52,
        "babNumber": "52.00",
        "hadithNumber": "371",
        "bookName": "باب ماجاء في عيش رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في عيش رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا هَارُونُ بْنُ إِسْحَاقَ، قَالَ‏:‏ حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ‏:‏ إِنْ كُنَّا آلَ مُحَمَّدٍ نَمكُثُ شَهْرًا مَا نَسْتَوْقِدُ بِنَارٍ، إِنْ هُوَ إِلا التَّمْرُ وَالْمَاءُ‏.‏",
        "annotations": null,
        "bookID": "52.0",
        "grade1": null,
        "ourHadithNumber": 2,
        "matchingEnglishURN": 1803510,
        "last_updated": null
    },
    {
        "arabicURN": 1903710,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 52,
        "babNumber": "52.00",
        "hadithNumber": "372",
        "bookName": "باب ماجاء في عيش رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في عيش رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا عَبْدُ اللهِ بْنُ أَبِي زِيَادٍ، قَالَ‏:‏ حَدَّثَنَا سَيَّارٌ، قَالَ‏:‏ حَدَّثَنَا سَهْلُ بْنُ أَسْلَمَ، عَنْ يَزِيدَ بْنِ أَبِي مَنْصُورٍ، عَنْ أَنَسٍ، عَنْ أَبِي طَلْحَةَ، قَالَ‏:‏ شَكَوْنَا إِلَى رَسُولِ اللهِ صلى الله عليه وسلم، الْجُوعَ وَرَفَعْنَا عَنْ بُطُونِنَا عَنْ حَجَرٍ، فَرَفَعَ رَسُولُ اللهِ صلى الله عليه وسلم، عَنْ بَطْنِهِ عَنْ حَجَرَيْنِ قَالَ أَبُو عِيسَى‏:‏ هَذَا حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ أَبِي طَلْحَةَ لا نَعْرِفُهُ إِلا مِنْ هَذَا الْوَجْهِ، وَمَعْنَى قَوْلِهِ‏:‏ وَرَفَعْنَا عَنْ بُطُونِنَا عَنْ حَجَرٍ حَجَرٍ، كَانَ أَحَدُهُمْ يَشُدُّ فِي بَطْنِهِ الْحَجَرَ مِنَ الْجُهْدِ وَالضَّعْفِ الَّذِي بِهِ مِنَ الْجُوعِ‏.‏",
        "annotations": null,
        "bookID": "52.0",
        "grade1": null,
        "ourHadithNumber": 3,
        "matchingEnglishURN": 1803520,
        "last_updated": null
    },
    {
        "arabicURN": 1903720,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 52,
        "babNumber": "52.00",
        "hadithNumber": "373",
        "bookName": "باب ماجاء في عيش رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في عيش رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، قَالَ‏:‏ حَدَّثَنَا شَيْبَانُ أَبُو مُعَاوِيَةَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ‏:‏ خَرَجَ رَسُولُ اللهِ صلى الله عليه وسلم، فِي سَاعَةٍ لا يَخْرُجُ فِيهَا، وَلا يَلْقَاهُ فِيهَا أَحَدٌ، فَأَتَاهُ أَبُو بَكْرٍ، فَقَالَ‏:‏ مَا جَاءَ بِكَ يَا أَبَا بَكْرٍ‏؟‏، قَالَ‏:‏ خَرَجْتُ أَلْقَى رَسُولَ اللهِ صلى الله عليه وسلم وَأَنْظُرُ فِي وَجْهِهِ، وَالتَّسْلِيمَ عَلَيْهِ، فَلَمْ يَلْبَثْ أَنْ جَاءَ عُمَرُ، فَقَالَ‏:‏ مَا جَاءَ بِكَ يَا عُمَرُ‏؟‏، قَالَ‏:‏ الْجُوعُ يَا رَسُولَ اللهِ، قَالَ صلى الله عليه وسلم‏:‏ وَأَنَا قَدْ وَجَدْتُ بَعْضَ ذَلِكَ، فَانْطَلَقُوا إِلَى مَنْزِلِ أَبِي الْهَيْثَمِ بْنِ التَّيْهَانِ الأَنْصَارِيِّ، وَكَانَ رَجُلا كَثِيرَ النَّخْلِ وَالشَّاءِ، وَلَمْ يَكُنْ لَهُ خَدَمٌ، فَلَمْ يَجِدُوهُ، فَقَالُوا لامْرَأَتِهِ‏:‏ أَيْنَ صَاحِبُكِ‏؟‏ فَقَالَتِ‏:‏ انْطَلَقَ يَسْتَعْذِبُ لَنَا الْمَاءَ، فَلَمْ يَلْبَثُوا أَنْ جَاءَ أَبُو الْهَيْثَمِ بِقِرْبَةٍ يَزْعَبُهَا، فَوَضَعَهَا ثُمَّ جَاءَ يَلْتَزِمُ النَّبِيَّ صلى الله عليه وسلم وَيُفَدِّيهِ بِأَبِيهِ وَأُمِّهِ، ثُمَّ انْطَلَقَ بِهِمْ إِلَى حَدِيقَتِهِ فَبَسَطَ لَهُمْ بِسَاطًا، ثُمَّ انْطَلَقَ إِلَى نَخْلَةٍ فَجَاءَ بِقِنْوٍ فَوَضَعَهُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ أَفَلا تَنَقَّيْتَ لَنَا مِنْ رُطَبِهِ‏؟‏ فَقَالَ‏:‏ يَا رَسُولَ اللهِ، إِنِّي أَرَدْتُ أَنْ تَخْتَارُوا، أَوْ تَخَيَّرُوا مِنْ رُطَبِهِ وَبُسْرِهِ، فَأَكَلُوا وَشَرِبُوا مِنْ ذَلِكَ الْمَاءِ فَقَالَ صلى الله عليه وسلم‏:‏ هَذَا وَالَّذِي نَفْسِي بِيَدِهِ مِنِ النَّعِيمِ الَّذِي تُسْأَلُونَ عَنْهُ يَوْمَ الْقِيَامَةِ ظِلٌّ بَارِدٌ، وَرُطَبٌ طَيِّبٌ، وَمَاءٌ بَارِدٌ فَانْطَلَقَ أَبُو الْهَيْثَمِ لِيَصْنَعَ لَهُمْ طَعَامًا فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ لا تَذْبَحَنَّ ذَاتَ دَرٍّ، فَذَبَحَ لَهُمْ عَنَاقًا أَوْ جَدْيًا، فَأَتَاهُمْ بِهَا فَأَكَلُوا، فَقَالَ صلى الله عليه وسلم‏:‏ هَلْ لَكَ خَادِمٌ‏؟‏، قَالَ‏:‏ لا، قَالَ‏:‏ فَإِذَا أَتَانَا، سَبْيٌ، فَأْتِنَا فَأُتِيَ النَّبِيُّ صلى الله عليه وسلم بِرَأْسَيْنِ لَيْسَ مَعَهُمَا ثَالِثٌ، فَأَتَاهُ أَبُو الْهَيْثَمِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ اخْتَرْ مِنْهُمَا فَقَالَ‏:‏ يَا رَسُولَ اللهِ، اخْتَرْ لِي فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ إِنَّ الْمُسْتَشَارَ مُؤْتَمَنٌ، خُذْ هَذَا، فَإِنِّي رَأَيْتُهُ يُصَلِّي، وَاسْتَوْصِ بِهِ مَعْرُوفًا فَانْطَلَقَ أَبُو الْهَيْثَمِ إِلَى امْرَأَتِهِ، فَأَخْبَرَهَا بِقَوْلِ رَسُولِ اللهِ صلى الله عليه وسلم، فَقَالَتِ امْرَأَتُهُ‏:‏ مَا أَنْتَ بِبَالِغٍ حَقَّ مَا، قَالَ فِيهِ النَّبِيُّ صلى الله عليه وسلم إِلا بِأَنْ تَعْتِقَهُ، قَالَ‏:‏ فَهُوَ عَتِيقٌ، فَقَالَ صلى الله عليه وسلم‏:‏ إِنَّ اللَّهَ لَمْ يَبْعَثْ نَبِيًّا وَلا خَلِيفَةً إِلا وَلَهُ بِطَانَتَانِ‏:‏ بِطَانَةٌ تَأْمُرُهُ بِالْمَعْرُوفِ وَتَنْهَاهُ عَنِ الْمُنْكَرِ، وَبِطَانَةٌ لا تَأْلُوهُ خَبَالا، وَمَنْ يُوقَ بِطَانَةَ السُّوءِ فَقَدْ وُقِيَ‏.‏",
        "annotations": null,
        "bookID": "52.0",
        "grade1": null,
        "ourHadithNumber": 4,
        "matchingEnglishURN": 1803530,
        "last_updated": null
    },
    {
        "arabicURN": 1903730,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 52,
        "babNumber": "52.00",
        "hadithNumber": "374",
        "bookName": "باب ماجاء في عيش رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في عيش رسول الله صلى الله عليه وسلم",
        "hadithText": "حدثنا عمر بن إسماعيل بن مجالد بن سعيد، حدثني أبي عن بيان حدثني قيس بن حازم، قال‏:‏ سمعت سعد بن أبي وقاص يقول‏:‏ إني لأَوْل رَجل أَهْرَقَ دَمًا فِي سَبِيلِ اللهِ ‏,‏ وَإِنْي لأَوْل رَجلٍ رَمَى بِسَهْمٍ فِى سَبِيلِ اللهِ َلقَدْ رَأَيْتُنِي أغزوا فِي الْعِصَابَةَ مِنْ أَصْحَابِ مُحَمْدٍ صلى الله عليه وسلم مَا نَأكُلْ إلاَّ وَرَقَ الشَجَرِ وَالْحُبْلَةَ حَتَّى تَقَرَحَتْ أَشْدَاقُنَا وَإِنْ أَحَدُنَا لَيَضَعُ كَمَا تَضَعُ الشَّاةُ وَالبَعِير وَأَصْبَحَتْ بَنُو أَسَدٍ يَعَزِّرُونَنِى فِي الدِّينِ ‏,‏ لَقَدْ خِبْتُ إذَنْ وَخَسِرْت وَضَلَ عَمَلِي‏.‏‏.‏",
        "annotations": null,
        "bookID": "52.0",
        "grade1": null,
        "ourHadithNumber": 5,
        "matchingEnglishURN": 1803540,
        "last_updated": null
    },
    {
        "arabicURN": 1903740,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 52,
        "babNumber": "52.00",
        "hadithNumber": "375",
        "bookName": "باب ماجاء في عيش رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في عيش رسول الله صلى الله عليه وسلم",
        "hadithText": "حدثنا محمد بن بشار ‏,‏ حدثنا صفوان بن عيسى ‏,‏ حدثنا محمد بن عمرو بن عيسى أبو نعامة العدوي ‏,‏ قال‏:‏ سمعت خَالِدِ بْنِ عُمَيْرٍ ‏,‏ وشويسًا ‏,‏ أبا الرقاد قالا‏:‏ بعث عمر بن الخطاب عُتْبَةُ بْنُ غَزْوَانَ وقَالَ انطلق أنت ومن معك ‏,‏ حتى إذا كنتم في أقصى أرض العرب ‏,‏ وأدنى بلاد أرض العجم ‏,‏ فأقبلوا حتى إذا كانوا بالمربد وجدوا هذا المكان ‏,‏ فقالوا‏:‏ ما هذه‏؟‏ هذه البصرة‏.‏ فسارواحتى إذا بلغوا حيال الجسر الصغير ‏,‏ فقالوا‏:‏ هاهنا أمرتم ‏,‏ فنزلوا فذكروا الحديث بطوله‏.‏‏.‏",
        "annotations": null,
        "bookID": "52.0",
        "grade1": null,
        "ourHadithNumber": 6,
        "matchingEnglishURN": 1803550,
        "last_updated": null
    },
    {
        "arabicURN": 1903750,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 52,
        "babNumber": "52.00",
        "hadithNumber": "376",
        "bookName": "باب ماجاء في عيش رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في عيش رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ‏:‏ حَدَّثَنَا رَوْحُ بْنُ أَسْلَمَ أَبُو حَاتِمٍ الْبَصْرِيُّ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، قَالَ‏:‏ حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ لَقَدْ أُخِفْتُ فِي اللهِ وَمَا يَخَافُ أَحَدٌ، وَلَقَدْ أُوذِيتُ فِي اللهِ وَمَا يُؤْذَى أَحَدٌ، وَلَقَدْ أَتَتْ عَلَيَّ ثَلاثُونَ مِنْ بَيْنِ لَيْلَةٍ وَيَوْمٍ، وَمَا لِي وَلِبِلالٍ طَعَامٌ يَأْكُلُهُ ذُو كَبِدٍ، إِلا شَيْءٌ يُوَارَيِهِ إِبِطُ بِلالٍ‏.‏",
        "annotations": null,
        "bookID": "52.0",
        "grade1": null,
        "ourHadithNumber": 7,
        "matchingEnglishURN": 1803560,
        "last_updated": null
    },
    {
        "arabicURN": 1903760,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 52,
        "babNumber": "52.00",
        "hadithNumber": "377",
        "bookName": "باب ماجاء في عيش رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في عيش رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ‏:‏ حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، قَالَ‏:‏ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ الْعَطَّارُ، قَالَ‏:‏ حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ‏:‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم، لَمْ يَجْتَمِعْ عِنْدَهُ غَدَاءٌ وَلا عَشَاءٌ مِنْ خُبْزٍ وَلَحْمٍ، إِلا عَلَى ضَفَفٍ‏.‏",
        "annotations": null,
        "bookID": "52.0",
        "grade1": null,
        "ourHadithNumber": 8,
        "matchingEnglishURN": 1803570,
        "last_updated": null
    },
    {
        "arabicURN": 1903770,
        "collection": "shamail",
        "volumeNumber": 1,
        "bookNumber": 52,
        "babNumber": "52.00",
        "hadithNumber": "378",
        "bookName": "باب ماجاء في عيش رسول الله صلى الله عليه وسلم",
        "babName": "باب ماجاء في عيش رسول الله صلى الله عليه وسلم",
        "hadithText": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ أَبِي فُدَيْكٍ، قَالَ‏:‏ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ مُسْلِمِ بْنِ جُنْدُبٍ، عَنْ نَوْفَلِ بْنِ إِيَاسٍ الْهُذَلِيِّ، قَال‏:‏ كَانَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ لَنَا جَلِيسًا، وَكَانَ نِعْمَ الْجَلِيسُ، وَإِنَّهُ انْقَلَبَ بِنَا ذَاتَ يَوْمٍ، حَتَّى إِذَا دَخَلْنَا بَيْتَهُ وَدَخَلَ فَاغْتَسَلَ، ثُمَّ خَرَجَ وَأُتَيْنَا بِصَحْفَةٍ فِيهَا خُبْزٌ وَلَحْمٌ، فَلَمَّا وُضِعَتْ بَكَى عَبْدُ الرَّحْمَنِ، فَقُلْتُ لَهُ‏:‏ يَا أَبَا مُحَمَّدٍ، مَا يُبْكِيكَ‏؟‏ فَقَالَ‏:‏ هَلكَ رَسُولُ اللهِ صلى الله عليه وسلم، وَلَمْ يَشْبَعْ هُوَ وَأَهْلُ بَيْتِهِ مِنْ خُبْزِ الشَّعِيرِ فَلا أَرَانَا أُخِّرْنَا لِمَا هُوَ خَيْرٌ لَنَا‏.‏",
        "annotations": null,
        "bookID": "52.0",
        "grade1": null,
        "ourHadithNumber": 9,
        "matchingEnglishURN": 1803580,
        "last_updated": null
    }
]