[
    {
        "urduURN": 4005990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 603,
        "hadithSanad": "ہم سے عمران بن میسرہ نے بیان کیا ، کہا کہ ہم سے عبدالوارث بن سعید نے بیان کیا ، کہا کہ ہم سے خالد حذاء نے ابوقلابہ عبداللہ بن زید سے ، انھوں نے حضرت انس رضی اللہ عنہ سے کہ",
        "hadithText": "( نماز کے وقت کے اعلان کے لیے ) لوگوں نے آگ اور ناقوس کا ذکر کیا ۔ پھر یہود و نصاریٰ کا ذکر آ گیا ۔ پھر بلال رضی اللہ عنہ کو یہ حکم ہوا کہ اذان کے کلمات دو دو مرتبہ کہیں اور اقامت میں ایک ایک مرتبہ ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 184010,
        "last_updated": null
    },
    {
        "urduURN": 4006000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 604,
        "hadithSanad": "ہم سے محمود بن غیلان نے بیان کیا ، کہا کہ ہم سے عبدالرزاق بن ہمام نے ، کہا کہ ہمیں عبدالملک ابن جریج نے خبر دی ، کہا کہ مجھے نافع نے خبر دی کہ عبداللہ بن عمر رضی اللہ عنہما کہتے تھے کہ",
        "hadithText": "جب مسلمان ( ہجرت کر کے ) مدینہ پہنچے تو وقت مقرر کر کے نماز کے لیے آتے تھے ۔ اس کے لیے اذان نہیں دی جاتی تھی ۔ ایک دن اس بارے میں مشورہ ہوا ۔ کسی نے کہا نصاریٰ کی طرح ایک گھنٹہ لے لیا جائے اور کسی نے کہا کہ یہودیوں کی طرح نرسنگا ( بگل بنا لو ، اس کو پھونک دیا کرو ) لیکن حضرت عمر رضی اللہ عنہ نے فرمایا کہ کسی شخص کو کیوں نہ بھیج دیا جائے جو نماز کے لیے پکار دیا کرے ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے ( اسی رائے کو پسند فرمایا اور بلال سے ) فرمایا کہ بلال ! اٹھ اور نماز کے لیے اذان دے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 184020,
        "last_updated": null
    },
    {
        "urduURN": 4006010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 605,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا سماک بن عطیہ سے ، انھوں نے ایوب سختیانی سے ، انھوں نے ابوقلابہ سے ، انھوں نے انس رضی اللہ عنہ سے کہ",
        "hadithText": "حضرت بلال رضی اللہ عنہ کو حکم دیا گیا کہ اذان کے کلمات دو دو مرتبہ کہیں اور سوا «قد قامت الصلوة» کے تکبیر کے کلمات ایک ایک دفعہ کہیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 184030,
        "last_updated": null
    },
    {
        "urduURN": 4006020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 606,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم سے عبدالوہاب ثقفی نے بیان کیا ، کہا ہم سے خالد بن مہران حذاء نے ابوقلابہ عبدالرحمٰن بن زید حرمی سے بیان کیا ، انھوں نے انس بن مالک رضی اللہ عنہ سے کہ",
        "hadithText": "جب مسلمان زیادہ ہو گئے تو مشورہ ہوا کہ کسی ایسی چیز کے ذریعہ نماز کے وقت کا اعلان ہو جسے سب لوگ سمجھ لیں ۔ کچھ لوگوں نے ذکر کیا کہ آگ روشن کی جائے ۔ یا نرسنگا کے ذریعہ اعلان کریں ۔ لیکن آخر میں بلال کو حکم دیا گیا کہ اذان کے کلمات دو دو دفعہ کہیں اور تکبیر کے ایک ایک دفعہ ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 184040,
        "last_updated": null
    },
    {
        "urduURN": 4006030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 607,
        "hadithSanad": "ہم سے علی بن عبداللہ بن مدینی نے بیان کیا ، کہا کہ ہم سے اسماعیل بن ابراہیم بن علیہ نے بیان کیا ، کہا ہم سے خالد حذاء نے ابوقلابہ سے بیان کیا ، انھوں نے انس رضی اللہ عنہ سے کہ",
        "hadithText": "بلال رضی اللہ عنہ کو حکم دیا گیا کہ اذان کے کلمات دو دو دفعہ کہیں اور تکبیر میں یہی کلمات ایک ایک دفعہ ۔ اسماعیل نے بتایا کہ میں نے ایوب سختیانی سے اس حدیث کا ذکر کیا تو انھوں نے کہا مگر لفظ «قد قامت الصلوة» دو ہی دفعہ کہا جائے گا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 184050,
        "last_updated": null
    },
    {
        "urduURN": 4006040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 608,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا ہمیں امام مالک نے ابولزناد سے خبر دی ، انھوں نے اعرج سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب نماز کے کے لیے اذان دی جاتی ہے تو شیطان پادتا ہوا بڑی تیزی کے ساتھ پیٹھ موڑ کر بھاگتا ہے ۔ تاکہ اذان کی آواز نہ سن سکے اور جب اذان ختم ہو جاتی ہے تو پھر واپس آ جاتا ہے ۔ لیکن جوں ہی تکبیر شروع ہوئی وہ پھر پیٹھ موڑ کر بھاگتا ہے ۔ جب تکبیر بھی ختم ہو جاتی ہے تو شیطان دوبارہ آ جاتا ہے اور نمازی کے دل میں وسوسے ڈالتا ہے ۔ کہتا ہے کہ فلاں بات یاد کر فلاں بات یاد کر ۔ ان باتوں کی شیطان یاد دہانی کراتا ہے جن کا اسے خیال بھی نہ تھا اور اس طرح اس شخص کو یہ بھی یاد نہیں رہتا کہ اس نے کتنی رکعتیں پڑھی ہیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 184060,
        "last_updated": null
    },
    {
        "urduURN": 4006050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 609,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انھوں نے کہا کہ ہمیں امام مالک نے عبدالرحمٰن بن عبداللہ بن عبدالرحمٰن بن ابی صعصعہ انصاری سے خبر دی ، پھر عبدالرحمٰن مازنی اپنے والد عبداللہ سے بیان کرتے ہیں کہ ان کے والد نے انہیں خبر دی کہ حضرت ابو سعید خدری رضی اللہ عنہ صحابی نے ان سے بیان کیا کہ",
        "hadithText": "میں دیکھتا ہوں کہ تمہیں بکریوں اور جنگل میں رہنا پسند ہے ۔ اس لیے جب تم جنگل میں اپنی بکریوں کو لیے ہوئے موجود ہو اور نماز کے لیے اذان دو تو تم بلند آواز سے اذان دیا کرو ۔ کیونکہ جن و انس بلکہ تمام ہی چیزیں جو مؤذن کی آواز سنتی ہیں قیامت کے دن اس پر گواہی دیں گی ۔ حضرت ابوسعید رضی اللہ عنہ نے فرمایا کہ یہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 184070,
        "last_updated": null
    },
    {
        "urduURN": 4006060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 610,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے اسماعیل بن جعفر انصاری نے حمید سے بیان کیا ، انھوں نے حضرت انس رضی اللہ عنہ سے انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم ہمیں ساتھ لے کر کہیں جہاد کے لیے تشریف لے جاتے ، تو فوراً ہی حملہ نہیں کرتے تھے ۔ صبح ہوتی اور پھر آپ انتظار کرتے اگر اذان کی آواز سن لیتے تو حملہ کا ارادہ ترک کر دیتے اور اگر اذان کی آواز نہ سنائی دیتی تو حملہ کرتے تھے ۔ انس رضی اللہ عنہ نے کہا کہ ہم خیبر کی طرف گئے اور رات کے وقت وہاں پہنچے ۔ صبح کے وقت جب اذان کی آواز نہیں سنائی دی تو آپ اپنی سواری پر بیٹھ گئے اور میں ابوطلحہ رضی اللہ عنہ کے پیچھے بیٹھ گیا ۔ چلنے میں میرے قدم نبی کریم صلی اللہ علیہ وسلم کے قدم مبارک سے چھو چھو جاتے تھے ۔ انس رضی اللہ عنہ نے کہا کہ خبیر کے لوگ اپنے ٹوکروں اور کدالوں کو لیے ہوئے ( اپنے کام کاج کو ) باہر نکلے ۔ تو انھوں نے رسول کریم صلی اللہ علیہ وسلم کو دیکھا ، اور چلا اٹھے کہ ” «محمد والله محمد» ( صلی اللہ علیہ وسلم ) پوری فوج سمیت آ گئے ۔ “ انس رضی اللہ عنہ نے کہا کہ جب نبی کریم صلی اللہ علیہ وسلم نے انہیں دیکھا تو آپ نے فرمایا «الله أكبر ،‏‏‏‏ ‏‏‏‏ الله أكبر» خیبر پر خرابی آ گئی ۔ بیشک جب ہم کسی قوم کے میدان میں اتر جائیں تو ڈرائے ہوئے لوگوں کی صبح بری ہو گی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 184080,
        "last_updated": null
    },
    {
        "urduURN": 4006070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 611,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انھوں نے کہا کہ ہمیں امام مالک نے ابن شہاب زہری سے خبر دی ، انھوں نے عطاء بن یزید لیثی سے ، انھوں نے ابو سعید خدری رضی اللہ عنہ سے ، انھوں نے رسول کریم صلی اللہ علیہ وسلم سے",
        "hadithText": "کہ جب تم اذان سنو تو جس طرح مؤذن کہتا ہے اسی طرح تم بھی کہو ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 184090,
        "last_updated": null
    },
    {
        "urduURN": 4006080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 612,
        "hadithSanad": "ہم سے معاذ بن فضالہ نے بیان کیا ، انھوں نے کہا کہ ہم سے ہشام دستوائی نے یحییٰ بن ابی کثیر سے بیان کیا ، انھوں نے محمد بن ابراہیم بن حارث سے کہا کہ مجھ سے عیسیٰ بن طلحہ نے بیان کیا کہ",
        "hadithText": "انھوں نے معاویہ بن ابی سفیان سے ایک دن سنا آپ ( جواب میں ) مؤذن کے ہی الفاظ کو دہرا رہے تھے ۔ «أشهد أن محمدا رسول الله» تک ۔ ہم سے اسحاق بن راہویہ نے بیان کیا ، کہا کہ ہم سے وہب بن جریر نے بیان کیا ، کہا کہ ہم سے ہشام دستوائی نے یحییٰ بن ابی کثیر سے اسی طرح حدیث بیان کی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 184100,
        "last_updated": null
    },
    {
        "urduURN": 4006090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 613,
        "hadithSanad": "یحییٰ نے کہا کہ مجھ سے میرے بعض بھائیوں نے حدیث بیان کی کہ",
        "hadithText": "جب مؤذن نے «حى على الصلاة‏» کہا تو معاویہ رضی اللہ عنہ نے «لا حول ولا قوة إلا بالله‏» کہا اور کہنے لگے کہ ہم نے نبی کریم صلی اللہ علیہ وسلم سے ایسا ہی کہتے سنا ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 184111,
        "last_updated": null
    },
    {
        "urduURN": 4006100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 614,
        "hadithSanad": "ہم سے علی بن عیاش ہمدانی نے بیان کیا ، انھوں نے کہا کہ ہم سے شعیب بن ابی حمزہ نے بیان کیا ، انھوں نے محمد بن المنکدر سے بیان کیا ، انھوں نے جابر بن عبداللہ رضی اللہ عنہ سے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ",
        "hadithText": "جو شخص اذان سن کر یہ کہے «اللهم رب هذه الدعوة التامة والصلاة القائمة آت محمدا الوسيلة والفضيلة وابعثه مقاما محمودا الذي وعدته» اسے قیامت کے دن میری شفاعت ملے گی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 184130,
        "last_updated": null
    },
    {
        "urduURN": 4006110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 615,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا کہ ہمیں امام مالک نے سمی سے جو ابوبکر عبدالرحمٰن بن حارث کے غلام تھے خبر دی ، انھوں نے ابوصالح ذکوان سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اگر لوگوں کو معلوم ہوتا کہ اذان کہنے اور نماز پہلی صف میں پڑھنے سے کتنا ثواب ملتا ہے ۔ پھر ان کے لیے قرعہ ڈالنے کے سوائے اور کوئی چارہ نہ باقی رہتا ، تو البتہ اس پر قرعہ اندازی ہی کرتے اور اگر لوگوں کو معلوم ہو جاتا کہ نماز کے لیے جلدی آنے میں کتنا ثواب ملتا ہے تو اس کے لیے دوسرے سے آگے بڑھنے کی کوشش کرتے ۔ اور اگر لوگوں کو معلوم ہو جاتا کہ عشاء اور صبح کی نماز کا ثواب کتنا ملتا ہے ، تو ضرور چوتڑوں کے بل گھسیٹتے ہوئے ان کے لیے آتے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 184140,
        "last_updated": null
    },
    {
        "urduURN": 4006120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 616,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے حماد بن زید نے ایوب سختیانی اور عبدالحمید بن دینار صاحب الزیادی اور عاصم احول سے بیان کیا ، انھوں نے عبداللہ بن حارث بصریٰ سے ، انھوں نے کہا کہ",
        "hadithText": "ابن عباس رضی اللہ عنہما نے ایک دن ہم کو جمعہ کا خطبہ دیا ۔ بارش کی وجہ سے اس دن اچھی خاصی کیچڑ ہو رہی تھی ۔ مؤذن جب «حى على الصلاة‏» پر پہنچا تو آپ نے اس سے «الصلاة في الرحال‏» کہنے کے لیے فرمایا کہ لوگ نماز اپنی قیام گاہوں پر پڑھ لیں ۔ اس پر لوگ ایک دوسرے کو دیکھنے لگے ۔ ابن عباس رضی اللہ عنہما نے کہا کہ اسی طرح مجھ سے جو افضل تھے ، انھوں نے بھی کیا تھا اور اس میں شک نہیں کہ جمعہ واجب ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 184150,
        "last_updated": null
    },
    {
        "urduURN": 4006130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 617,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا امام مالک سے ، انھوں نے ابن شہاب سے ، انھوں نے سالم بن عبداللہ بن عمر رضی اللہ عنہما سے ، انھوں نے اپنے والد عبداللہ بن عمر سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ بلال تو رات رہے اذان دیتے ہیں ۔ اس لیے تم لوگ کھاتے پیتے رہو ۔ یہاں تک کہ ابن ام مکتوم اذان دیں ۔ راوی نے کہا کہ وہ نابینا تھے اور اس وقت تک اذان نہیں دیتے تھے جب تک ان سے کہا نہ جاتا کہ صبح ہو گئی ۔ صبح ہو گئی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 184160,
        "last_updated": null
    },
    {
        "urduURN": 4006140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 618,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا کہ ہمیں امام مالک نے نافع سے خبر دی ، انھوں نے عبداللہ بن عمر رضی اللہ عنہما سے ، انھوں نے کہا مجھے ام المؤمنین حضرت حفصہ رضی اللہ عنہا نے خبر دی کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم کی عادت تھی کہ جب مؤذن صبح کی اذان صبح صادق کے طلوع ہونے کے بعد دے چکا ہوتا تو آپ صلی اللہ علیہ وسلم اذان اور تکبیر کے بیچ نماز قائم ہونے سے پہلے دو ہلکی سی رکعتیں پڑھتے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 184170,
        "last_updated": null
    },
    {
        "urduURN": 4006150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 619,
        "hadithSanad": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، انھوں نے کہا کہ ہم سے شیبان نے یحییٰ بن ابی کثیر سے بیان کیا ، انھوں نے ابوسلمہ بن عبدالرحمٰن بن عوف سے ، انھوں نے حضرت عائشہ صدیقہ رضی اللہ عنہا سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم فجر کی اذان اور اقامت کے درمیان دو ہلکی سی رکعتیں پڑھتے تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 184180,
        "last_updated": null
    },
    {
        "urduURN": 4006160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 620,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا کہ ہمیں امام مالک نے عبداللہ بن دینار سے خبر دی ، انھوں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ۔ دیکھو بلال رضی اللہ عنہ رات رہے میں اذان دیتے ہیں ، اس لیے تم لوگ ( سحری ) کھا پی سکتے ہو ۔ جب تک ابن ام مکتوم اذان نہ دیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 184190,
        "last_updated": null
    },
    {
        "urduURN": 4006170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 621,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، کہا کہ ہم سے زہیر بن معاویہ جعفی نے بیان کیا ، کہا کہ ہم سے سلیمان بن طرخان تیمی نے بیان کیا ابوعثمان عبدالرحمٰن نہدی سے ، انھوں نے عبداللہ بن مسعود رضی اللہ عنہما سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ بلال کی اذان تمہیں سحری کھانے سے نہ روک دے کیونکہ وہ رات رہے سے اذان دیتے ہیں یا ( یہ کہا کہ ) پکارتے ہیں ۔ تاکہ جو لوگ عبادت کے لیے جاگے ہیں وہ آرام کرنے کے لیے لوٹ جائیں اور جو ابھی سوئے ہوئے ہیں وہ ہوشیار ہو جائیں ۔ کوئی یہ نہ سمجھ بیٹھے کہ فجر یا صبح صادق ہو گئی اور آپ نے اپنی انگلیوں کے اشارے سے ( طلوع صبح کی کیفیت ) بتائی ۔ انگلیوں کو اوپر کی طرف اٹھایا اور پھر آہستہ سے انہیں نیچے لائے اور پھر فرمایا کہ اس طرح ( فجر ہوتی ہے ) حضرت زہیر راوی نے بھی شہادت کی انگلی ایک دوسری پر رکھی ، پھر انہیں دائیں بائیں جانب پھیلا دیا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 184200,
        "last_updated": null
    },
    {
        "urduURN": 4006180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 622,
        "hadithSanad": "مجھ سے اسحاق بن راہویہ نے بیان کیا ، انھوں نے کہا ہمیں ابواسامہ حماد بن اسامہ نے خبر دی ، کہا ہم سے عبداللہ بن عمر نے بیان کیا ، انھوں نے قاسم بن محمد سے اور انھوں نے حضرت عائشہ صدیقہ رضی اللہ عنہا سے بیان کیا اور نافع نے ابن عمر سے یہ حدیث بیان کی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ( بلال رات رہے میں اذان دیتے ہیں ۔ عبداللہ ابن ام مکتوم کی اذان تک تم ( سحری ) کھا پی سکتے ہو ) ۔\nآپ صلی اللہ علیہ وسلم نے فرمایا کہ بلال رات رہے میں اذان دیتے ہیں ۔ عبداللہ ابن ام مکتوم کی اذان تک تم ( سحری ) کھا پی سکتے ہو ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 184210,
        "last_updated": null
    },
    {
        "urduURN": 4006200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 624,
        "hadithSanad": "ہم سے اسحاق بن شاہین واسطی نے بیان کیا ، کہا کہ ہم سے خالد بن عبداللہ طحان نے سعد بن ایاس جریری سے بیان کیا ، انھوں نے عبداللہ بن بریدہ سے ، انھوں نے عبداللہ بن مغفل مزنی سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے تین مرتبہ فرمایا کہ ہر دو اذانوں ( اذان و اقامت ) کے درمیان ایک نماز ( کا فصل ) دوسری نماز سے ہونا چاہیے ( تیسری مرتبہ فرمایا کہ ) جو شخص ایسا کرنا چاہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 184230,
        "last_updated": null
    },
    {
        "urduURN": 4006210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 625,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، انھوں نے کہا کہ ہم سے محمد بن جعفر غندر نے بیان کیا ، انھوں نے کہا کہ ہم سے شعبہ بن حجاج نے بیان کیا ، کہا کہ میں نے عمرو بن عامر انصاری سے سنا ، وہ حضرت انس بن مالک رضی اللہ عنہ سے بیان کرتے تھے کہ",
        "hadithText": "آپ نے فرمایا کہ ( عہدرسالت میں ) جب مؤذن اذان دیتا تو نبی کریم صلی اللہ علیہ وسلم کے صحابہ ستونوں کی طرف لپکتے ۔ جب نبی کریم صلی اللہ علیہ وسلم اپنے حجرہ سے باہر تشریف لاتے تو لوگ اسی طرح نماز پڑھتے ہوئے ملتے ۔ یہ جماعت مغرب سے پہلے کی دو رکعتیں تھیں ۔ اور ( مغرب میں ) اذان اور تکبیر میں کوئی زیادہ فاصلہ نہیں ہوتا تھا ۔ اور عثمان بن جبلہ اور ابوداؤد طیالسی نے شعبہ سے اس ( حدیث میں یوں نقل کیا ہے کہ ) اذان اور تکبیر میں بہت تھوڑا سا فاصلہ ہوتا تھا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 184240,
        "last_updated": null
    },
    {
        "urduURN": 4006220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 626,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، انھوں نے کہا کہ ہمیں شعیب نے خبر دی ، انھوں نے زہری سے ، انھوں نے کہا کہ مجھے عروہ بن زبیر نے خبر دی کہ ام المؤمنین حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ",
        "hadithText": "جب مؤذن صبح کی دوسری اذان دے کر چپ ہوتا تو رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوتے اور فرض سے پہلے دو رکعت ( سنت فجر ) ہلکی پھلکی ادا کرتے صبح صادق روشن ہو جانے کے بعد پھر داہنی کروٹ پر لیٹ رہتے ۔ یہاں تک کہ مؤذن تکبیر کہنے کی اطلاع دینے کے لیے آپ صلی اللہ علیہ وسلم کے پاس آتا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 184250,
        "last_updated": null
    },
    {
        "urduURN": 4006230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 627,
        "hadithSanad": "ہم سے عبداللہ بن یزید مقری نے بیان کیا ، انھوں نے کہا کہ ہم سے کہمس بن حسن نے بیان کیا ، انھوں نے عبداللہ بن بریدہ سے ، انھوں نے عبداللہ بن مغفل رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہر دو اذانوں ( اذان و تکبیر ) کے بیچ میں نماز ہے ۔ ہر دو اذانوں کے درمیان نماز ہے ۔ پھر تیسری مرتبہ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر کوئی پڑھنا چاہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 184260,
        "last_updated": null
    },
    {
        "urduURN": 4006240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 628,
        "hadithSanad": "ہم سے معلی بن سعد اسد بصریٰ نے بیان کیا ، کہا ہم سے وہیب بن خالد نے ابوایوب سے بیان کیا ، انھوں نے ابوقلابہ سے ، انھوں نے مالک بن حویرث رضی اللہ عنہ سے ، کہا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں اپنی قوم ( بنی لیث ) کے چند آدمیوں کے ساتھ حاضر ہوا اور میں نے آپ صلی اللہ علیہ وسلم کی خدمت شریف میں بیس راتوں تک قیام کیا ۔ آپ صلی اللہ علیہ وسلم بڑے رحم دل اور ملنسار تھے ۔ جب آپ صلی اللہ علیہ وسلم نے ہمارے اپنے گھر پہنچنے کا شوق محسوس کر لیا تو فرمایا کہ اب تم جا سکتے ہو ۔ وہاں جا کر اپنی قوم کو دین سکھاؤ اور ( سفر میں ) نماز پڑھتے رہنا ۔ جب نماز کا وقت آ جائے تو تم میں سے ایک شخص اذان دے اور جو تم میں سب سے بڑا ہو وہ امامت کرائے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 184270,
        "last_updated": null
    },
    {
        "urduURN": 4006250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 629,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا کہ ہم سے شعبہ نے مہاجر ابوالحسن سے بیان کیا ، انھوں نے زید بن وہب سے ، انھوں نے حضرت ابوذرغفاری رضی اللہ عنہ سے ، انھوں نے کہا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھے ۔ مؤذن نے اذان دینی چاہی تو آپ صلی اللہ علیہ وسلم نے فرمایا ٹھنڈا ہونے دے ۔ پھر مؤذن نے اذان دینی چاہی تو آپ صلی اللہ علیہ وسلم نے پھر یہی فرمایا کہ ٹھنڈا ہونے دے ۔ یہاں تک کہ سایہ ٹیلوں کے برابر ہو گیا ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ گرمی کی شدت دوزخ کی بھاپ سے پیدا ہوتی ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 184280,
        "last_updated": null
    },
    {
        "urduURN": 4006260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 630,
        "hadithSanad": "ہم سے محمد بن یوسف فریابی نے بیان کیا ، کہا کہ ہم سے سفیان ثوری نے خالد حذاء سے ، انھوں نے ابوقلابہ عبداللہ بن زید سے ، انھوں نے مالک بن حویرث سے ، انھوں نے کہا کہ",
        "hadithText": "دو شخص نبی کریم صلی اللہ علیہ وسلم کی خدمت میں آئے یہ کسی سفر میں جانے والے تھے ۔ آپ صلی اللہ علیہ وسلم نے ان سے فرمایا کہ دیکھو جب تم سفر میں نکلو تو ( نماز کے وقت راستے میں ) اذان دینا پھر اقامت کہنا ، پھر جو شخص تم میں عمر میں بڑا ہو نماز پڑھائے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 184290,
        "last_updated": null
    },
    {
        "urduURN": 4006270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 631,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا کہ ہمیں عبدالوہاب نے خبر دی ، کہا کہ ہمیں ابوایوب سختیانی نے ابوقلابہ سے خبر دی ، انھوں نے کہا کہ ہم سے مالک بن حویرث نے بیان کیا ، کہا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت اقدس میں حاضر ہوئے ۔ ہم سب ہم عمر اور نوجوان ہی تھے ۔ آپ صلی اللہ علیہ وسلم کی خدمت مبارک میں ہمارا بیس دن و رات قیام رہا ۔ آپ صلی اللہ علیہ وسلم بڑے ہی رحم دل اور ملنسار تھے ۔ جب آپ صلی اللہ علیہ وسلم نے دیکھا کہ ہمیں اپنے وطن واپس جانے کا شوق ہے تو آپ صلی اللہ علیہ وسلم نے پوچھا کہ تم لوگ اپنے گھر کسے چھوڑ کر آئے ہو ۔ ہم نے بتایا ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اچھا اب تم اپنے گھر جاؤ اور ان گھر والوں کے ساتھ رہو اور انہیں بھی دین سکھاؤ اور دین کی باتوں پر عمل کرنے کا حکم کرو ۔ مالک نے بہت سی چیزوں کا ذکر کیا جن کے متعلق ابوایوب نے کہا کہ ابوقلابہ نے یوں کہا وہ باتیں مجھ کو یاد ہیں یا یوں کہا مجھ کو یاد نہیں ۔ اور آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اسی طرح نماز پڑھنا جیسے تم نے مجھے نماز پڑھتے ہوئے دیکھا ہے اور جب نماز کا وقت آ جائے تو کوئی ایک اذان دے اور جو تم میں سب سے بڑا ہو وہ نماز پڑھائے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 184300,
        "last_updated": null
    },
    {
        "urduURN": 4006280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 632,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا کہ ہم سے یحییٰ بن سعید قطان نے عبیداللہ بن عمر عمری سے بیان کیا ، انھوں نے کہا کہ مجھ سے نافع نے بیان کیا کہ",
        "hadithText": "عبداللہ بن عمر رضی اللہ عنہما نے ایک سرد رات میں مقام ضجنان پر اذان دی پھر فرمایا «ألا صلوا في الرحال‏» کہ لوگو ! اپنے اپنے ٹھکانوں میں نماز پڑھ لو اور ہمیں آپ نے بتلایا کہ نبی کریم صلی اللہ علیہ وسلم مؤذن سے اذان کے لیے فرماتے اور یہ بھی فرماتے کہ مؤذن اذان کے بعد کہہ دے کہ لوگو ! اپنے ٹھکانوں میں نماز پڑھ لو ۔ یہ حکم سفر کی حالت میں یا سردی یا برسات کی راتوں میں تھا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 184310,
        "last_updated": null
    },
    {
        "urduURN": 4006290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 633,
        "hadithSanad": "ہم سے اسحاق بن منصور نے بیان کیا ، انھوں نے کہا کہ ہمیں جعفر بن عون نے خبر دی ، انھوں نے کہا کہ ہم سے ابوالعمیس نے بیان کیا ، انھوں نے عون بن ابی حجیفہ سے ابوحجیفہ کے واسطہ سے بیان کیا ، کہا کہ",
        "hadithText": "میں نے رسول کریم صلی اللہ علیہ وسلم کو ابطح میں دیکھا کہ بلال حاضر ہوئے اور آپ صلی اللہ علیہ وسلم کو نماز کی خبر دی پھر بلال رضی اللہ عنہ برچھی لے کر آگے بڑھے اور اسے آپ صلی اللہ علیہ وسلم کے سامنے ( بطور سترہ ) مقام ابطح میں گاڑ دیا اور آپ صلی اللہ علیہ وسلم نے ( اس کو سترہ بنا کر ) نماز پڑھائی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 184320,
        "last_updated": null
    },
    {
        "urduURN": 4006300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 634,
        "hadithSanad": "ہم سے محمد بن یوسف فریابی نے بیان کیا ، کہا کہ ہم سے سفیان ثوری نے عون بن ابی حجیفہ سے بیان کیا ، انھوں نے اپنے باپ سے کہ",
        "hadithText": "انھوں نے بلال رضی اللہ عنہ کو اذان دیتے ہوئے دیکھا ۔ وہ کہتے ہیں میں بھی ان کے منہ کے ساتھ ادھر ادھر منہ پھیرنے لگا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 184330,
        "last_updated": null
    },
    {
        "urduURN": 4006310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 635,
        "hadithSanad": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، کہا کہ ہم سے شیبان بن عبدالرحمٰن نے یحییٰ بن ابی کثیر سے بیان کیا ، انھوں نے عبداللہ بن ابی قتادہ سے ، انھوں نے اپنے والد ابوقتادہ رضی اللہ عنہ سے ، انھوں نے کہا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز میں تھے ۔ آپ صلی اللہ علیہ وسلم نے کچھ لوگوں کے چلنے پھرنے اور بولنے کی آواز سنی ۔ نماز کے بعد آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کیا قصہ ہے لوگوں نے کہا کہ ہم نماز کے لیے جلدی کر رہے تھے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایسا نہ کرو ۔ بلکہ جب تم نماز کے لیے آؤ تو وقار اور سکون کو ملحوظ رکھو ، نماز کا جو حصہ پاؤ اسے پڑھو اور اور جو رہ جائے اسے ( بعد ) میں پورا کر لو ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 184340,
        "last_updated": null
    },
    {
        "urduURN": 4006320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 636,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے محمد بن عبدالرحمٰن بن ابی ذئب نے بیان کیا ، کہا کہ ہم سے امام زہری نے سعید بن مسیب سے بیان کیا ، انھوں نے ابوہریرہ رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے ( دوسری سند ) اور زہری نے ابوسلمہ سے ، انھوں نے ابوہریرہ رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا تم لوگ تکبیر کی آواز سن لو تو نماز کے لیے ( معمولی چال سے ) چل پڑو ۔ سکون اور وقار کو ( بہرحال ) پکڑے رکھو اور دوڑ کے مت آؤ ۔ پھر نماز کا جو حصہ ملے اسے پڑھ لو ، اور جو نہ مل سکے اسے بعد میں پورا کر لو ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 184350,
        "last_updated": null
    },
    {
        "urduURN": 4006330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 637,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا کہ ہم سے ہشام دستوائی نے بیان کیا ، کہا مجھے یحییٰ نے عبداللہ عبدالوہاب  بن ابی قتادہ سے یہ حدیث لکھ کر بھیجی کہ وہ اپنے باپ ( ابوقتادہ ) سے بیان کرتے تھے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جب نماز کے لیے تکبیر کہی جائے تو اس وقت تک نہ کھڑے ہو جب تک مجھے نکلتے ہوئے نہ دیکھ لو ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 184360,
        "last_updated": null
    },
    {
        "urduURN": 4006340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 638,
        "hadithSanad": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، کہا ہم سے شیبان نے یحییٰ بن ابی کثیر سے بیان کیا ، انھوں نے عبداللہ بن ابی قتادہ سے ، انھوں نے اپنے باپ ابوقتادہ حارث بن ربعی رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ نماز کی تکبیر ہو تو جب تک مجھے دیکھ نہ لو کھڑے نہ ہو اور آہستگی کو لازم رکھو ۔ شیبان کے ساتھ اس حدیث کو یحییٰ سے علی بن مبارک نے بھی روایت کیا ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 184370,
        "last_updated": null
    },
    {
        "urduURN": 4006350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 639,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا کہ ہم سے ابراہیم بن سعد نے بیان کیا ، وہ صالح بن کیسان سے ، وہ ابن شہاب سے ، وہ ابوسلمہ بن عبدالرحمٰن سے ، وہ ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم ( ایک دن حجرے سے ) باہر تشریف لائے ، اقامت کہی جا چکی تھی اور صفیں برابر کی جا چکی تھیں ۔ آپ صلی اللہ علیہ وسلم جب مصلے پر کھڑے ہوئے تو ہم انتظار کر رہے تھے کہ اب آپ صلی اللہ علیہ وسلم تکبیر کہتے ہیں ۔ لیکن آپ صلی اللہ علیہ وسلم واپس تشریف لے گئے اور فرمایا کہ اپنی اپنی جگہ پر ٹھہرے رہو ۔ ہم اسی حالت میں ٹھہرے رہے یہاں تک کہ آپ صلی اللہ علیہ وسلم دوبارہ تشریف لائے ، تو سرمبارک سے پانی ٹپک رہا تھا ۔ آپ صلی اللہ علیہ وسلم نے غسل کیا تھا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 184380,
        "last_updated": null
    },
    {
        "urduURN": 4006360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 640,
        "hadithSanad": "ہم سے اسحاق بن منصور نے بیان کیا ، کہا کہ ہمیں محمد بن یوسف فریابی نے خبر دی کہ کہا ہم سے اوزاعی نے ابن شہاب زہری سے بیان کیا ، انھوں نے ابوسلمہ بن عبدالرحمٰن سے ، انھوں نے ابوہریرہ رضی اللہ عنہ سے کہ انھوں نے فرمایا کہ",
        "hadithText": "نماز کے لیے اقامت کہی جا چکی تھی اور لوگوں نے صفیں سیدھی کر لی تھیں ۔ پھر رسول کریم صلی اللہ علیہ وسلم تشریف لائے اور آگے بڑھے ۔ لیکن حالت جنابت میں تھے ( مگر پہلے خیال نہ رہا ) اس لیے آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم لوگ اپنی اپنی جگہ ٹھہرے رہو ۔ پھر آپ صلی اللہ علیہ وسلم واپس تشریف لائے تو آپ صلی اللہ علیہ وسلم غسل کئے ہوئے تھے اور سرمبارک سے پانی ٹپک رہا تھا ۔ پھر آپ صلی اللہ علیہ وسلم نے لوگوں کو نماز پڑھائی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 184390,
        "last_updated": null
    },
    {
        "urduURN": 4006370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 641,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، انھوں نے کہا کہ ہم سے شیبان نے یحییٰ کے واسطہ سے بیان کیا ، انھوں نے کہا کہ میں نے ابوسلمہ سے سنا ، وہ کہتے تھے کہ ہمیں جابر بن عبداللہ انصاری رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی خدمت میں عمر بن خطاب رضی اللہ عنہ غزوہ خندق کے دن حاضر ہوئے اور عرض کی یا رسول اللہ ! قسم خدا کی سورج غروب ہونے کو ہی تھا کہ میں اب عصر کی نماز پڑھ سکا ہوں ۔ آپ جب حاضر خدمت ہوئے تو روزہ افطار کرنے کا وقت آ چکا تھا ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ قسم اللہ کی میں نے بھی تو نماز عصر نہیں پڑھی ہے ۔ پھر آپ صلی اللہ علیہ وسلم بطحان کی طرف گئے ۔ میں آپ صلی اللہ علیہ وسلم کے ساتھ ہی تھا ۔ آپ صلی اللہ علیہ وسلم نے وضو کیا ، پھر عصر کی نماز پڑھی ۔ سورج ڈوب چکا تھا ۔ پھر اس کے بعد مغرب کی نماز پڑھی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 184400,
        "last_updated": null
    },
    {
        "urduURN": 4006380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 642,
        "hadithSanad": "ہم سے ابومعمر عبداللہ بن عمرو نے بیان کیا ، کہا کہ ہم سے عبدالوارث بن سعید نے بیان کیا ، کہا کہ ہم سے عبدالعزیز بن صہیب نے حضرت انس رضی اللہ عنہ سے بیان کیا ، انھوں نے کہا کہ",
        "hadithText": "نماز کے لیے تکبیر ہو چکی تھی اور نبی کریم صلی اللہ علیہ وسلم کسی شخص سے مسجد کے ایک گوشے میں چپکے چپکے کان میں باتیں کر رہے تھے ۔ پھر آپ صلی اللہ علیہ وسلم نماز کے لیے جب تشریف لائے تو لوگ سو رہے تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 184410,
        "last_updated": null
    },
    {
        "urduURN": 4006390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 643,
        "hadithSanad": "ہم سے عیاش بن ولید نے بیان کیا ، کہا کہ ہم سے عبدالاعلیٰ نے بیان کیا ، کہا کہ ہم سے حمید طویل نے بیان کیا ، کہا کہ",
        "hadithText": "میں نے ثابت بنانی سے ایک شخص کے متعلق مسئلہ دریافت کیا جو نماز کے لیے تکبیر ہونے کے بعد گفتگو کرتا رہے ۔ اس پر انھوں نے انس بن مالک رضی اللہ عنہ سے بیان کیا کہ انھوں نے فرمایا کہ تکبیر ہو چکی تھی ۔ اتنے میں ایک شخص نبی کریم صلی اللہ علیہ وسلم سے راستہ میں ملا اور آپ صلی اللہ علیہ وسلم کو نماز کے لیے تکبیر کہی جانے کے بعد بھی روکے رکھا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 184420,
        "last_updated": null
    },
    {
        "urduURN": 4006400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 644,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا کہ ہمیں امام مالک نے ابوالزناد سے خبر دی ، انھوں نے اعرج سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا اس ذات کی قسم جس کے ہاتھ میں میری جان ہے میں نے ارادہ کر لیا تھا کہ لکڑیوں کے جمع کرنے کا حکم دوں ۔ پھر نماز کے لیے کہوں ، اس کے لیے اذان دی جائے پھر کسی شخص سے کہوں کہ وہ امامت کرے اور میں ان لوگوں کی طرف جاؤں ( جو نماز باجماعت میں حاضر نہیں ہوتے ) پھر انہیں ان کے گھروں سمیت جلا دوں ۔ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے اگر یہ جماعت میں نہ شریک ہونے والے لوگ اتنی بات جان لیں کہ انہیں مسجد میں ایک اچھے قسم کی گوشت والی ہڈی مل جائے گی یا دو عمدہ کھر ہی مل جائیں گے تو یہ عشاء کی جماعت کے لیے مسجد میں ضرور حاضر ہو جائیں</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 184430,
        "last_updated": null
    },
    {
        "urduURN": 4006410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 645,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انھوں نے کہا کہ ہمیں امام مالک نے خبر دی ، انھوں نے نافع سے ، انھوں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جماعت کے ساتھ نماز اکیلے نماز پڑھنے سے ستائیس درجہ زیادہ فضیلت رکھتی ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 184440,
        "last_updated": null
    },
    {
        "urduURN": 4006420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 646,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انھوں نے کہا کہ مجھ سے لیث نے بیان کیا ، انھوں نے کہا کہ مجھ سے یزید بن ہاد نے بیان کیا ، انھوں نے عبداللہ بن خباب سے ، انھوں نے حضرت ابو سعید خدری رضی اللہ عنہ سے کہ انھوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا",
        "hadithText": "آپ صلی اللہ علیہ وسلم فرماتے تھے کہ جماعت سے نماز تنہا نماز پڑھنے سے پچیس درجہ زیادہ فضیلت رکھتی ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 184450,
        "last_updated": null
    },
    {
        "urduURN": 4006430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 647,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انھوں نے کہا کہ ہم سے عبدالواحد نے بیان کیا ، انھوں نے کہا کہ ہم سے اعمش نے بیان کیا ، انھوں نے کہا کہ میں نے ابوصالح سے سنا ، انھوں نے کہا کہ میں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ آدمی کی جماعت کے ساتھ نماز گھر میں یا بازار میں پڑھنے سے پچیس درجہ زیادہ بہتر ہے ۔ وجہ یہ ہے کہ جب ایک شخص وضو کرتا ہے اور اس کے تمام آداب کو ملحوظ رکھ کر اچھی طرح وضو کرتا ہے پھر مسجد کا راستہ پکڑتا ہے اور سوا نماز کے اور کوئی دوسرا ارادہ اس کا نہیں ہوتا ، تو ہر قدم پر اس کا ایک درجہ بڑھتا ہے اور ایک گناہ معاف کیا جاتا ہے اور جب نماز سے فارغ ہو جاتا ہے تو فرشتے اس وقت تک اس کے لیے برابر دعائیں کرتے رہتے ہیں جب تک وہ اپنے مصلے پر بیٹھا رہے ۔ کہتے ہیں «اللهم صل عليه ،‏‏‏‏ اللهم ارحمه‏» اے اللہ ! اس پر اپنی رحمتیں نازل فرما ۔ اے اللہ ! اس پر رحم کر اور جب تک تم نماز کا انتظار کرتے رہو گویا تم نماز ہی میں مشغول ہو ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 184460,
        "last_updated": null
    },
    {
        "urduURN": 4006440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 648,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، ، انہوں نے کہا کہ ہم سے شعیب نے ، انھوں نے کہا ہم سے زہری نے بیان کیا ، انھوں نے کہا کہ مجھے سعید بن مسیب اور ابوسلمہ بن عبدالرحمٰن نے خبر دی کہ حضرت ابوہریرہ رضی اللہ عنہ نے کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ جماعت سے نماز اکیلے پڑھنے سے پچیس درجہ زیادہ بہتر ہے ۔ اور رات دن کے فرشتے فجر کی نماز میں جمع ہوتے ہیں ۔ پھر ابوہریرہ رضی اللہ عنہ نے فرمایا کہ اگر تم پڑھنا چاہو تو ( سورۃ بنی اسرائیل ) کی یہ آیت پڑھو «إن قرآن الفجر كان مشهودا‏» یعنی فجر میں قرآن پاک کی تلاوت پر فرشتے حاضر ہوتے ہیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 184470,
        "last_updated": null
    },
    {
        "urduURN": 4006450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 649,
        "hadithSanad": "شعیب نے فرمایا کہ مجھ سے نافع نے ابن عمر رضی اللہ عنہما کے واسطہ سے اس طرح حدیث بیان کی کہ",
        "hadithText": "جماعت کی نماز اکیلے کی نماز سے ستائیس درجہ زیادہ فضیلت رکھتی ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 184480,
        "last_updated": null
    },
    {
        "urduURN": 4006460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 650,
        "hadithSanad": "ہم سے عمر بن حفص نے بیان کیا ، کہا کہ مجھ سے میرے باپ نے بیان کیا ، کہا کہ ہم سے اعمش نے بیان کیا ، کہا کہ میں نے سالم سے سنا ۔ کہا کہ میں نے ام الدرداء سے سنا ، آپ نے فرمایا کہ",
        "hadithText": "( ایک مرتبہ ) ابودرداء آئے ، بڑے ہی خفا ہو رہے تھے ۔ میں نے پوچھا کہ کیا بات ہوئی ، جس نے آپ کو غضبناک بنا دیا ۔ فرمایا : خدا کی قسم ! حضرت محمد صلی اللہ علیہ وسلم کی شریعت کی کوئی بات اب میں نہیں پاتا ۔ سوا اس کے کہ جماعت کے ساتھ یہ لوگ نماز پڑھ لیتے ہیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 184490,
        "last_updated": null
    },
    {
        "urduURN": 4006470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 651,
        "hadithSanad": "ہم سے محمد بن علاء نے بیان کیا ، کہا کہ ہم سے ابواسامہ نے برید بن عبداللہ سے بیان کیا ، انھوں نے ابوبردہ سے ، انھوں نے ابوموسیٰ رضی اللہ عنہ سے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ",
        "hadithText": "نماز میں ثواب کے لحاظ سے سب سے بڑھ کر وہ شخص ہوتا ہے ، جو ( مسجد میں نماز کے لیے ) زیادہ سے زیادہ دور سے آئے اور جو شخص نماز کے انتظار میں بیٹھا رہتا ہے اور پھر امام کے ساتھ پڑھتا ہے اس شخص سے اجر میں بڑھ کر ہے جو ( پہلے ہی ) پڑھ کر سو جائے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 184500,
        "last_updated": null
    },
    {
        "urduURN": 4006480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 652,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے امام مالک سے بیان کیا ، انھوں نے ابوبکر بن عبدالرحمٰن کے غلام سمی نامی سے ، انھوں نے ابوصالح سمان سے ، انھوں نے ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ایک شخص کہیں جا رہا تھا ۔ راستے میں اس نے کانٹوں کی بھری ہوئی ایک ٹہنی دیکھی ، پس اسے راستے سے دور کر دیا ۔ اللہ تعالیٰ ( صرف اسی بات پر ) راضی ہو گیا اور اس کی بخشش کر دی ۔\nپھر آپ نے فرمایا کہشہداء پانچ قسم کے ہوتے ہیں ۔ طاعون میں مرنے والے ، پیٹ کے عارضے ( ہیضے وغیرہ ) میں مرنے والے اور ڈوب کر مرنے والے اور جو دیوار وغیرہ کسی بھی چیز سے دب کر مر جائے اور خدا کے راستے میں ( جہاد کرتے ہوئے ) شہید ہونے والے اور آپ نے فرمایا کہ اگر لوگوں کو معلوم ہو جائے کہ اذان دینے اور پہلی صف میں شریک ہونے کا ثواب کتنا ہے اور پھر اس کے سوا کوئی چارہ کار نہ ہو کہ قرعہ ڈالا جائے تو لوگ ان کے لیے قرعہ ہی ڈالا کریں ۔\t\nاور اگر لوگوں کو یہ معلوم ہو جائے کہ ظہر کی نماز کے لیے سویرے جانے میں کیا ثواب ہے تو اس کے لیے ایک دوسرے پر سبقت لے جانے کی کوشش کریں اور اگر یہ جان جائیں کہ عشاء اور صبح کی نماز کے فضائل کتنے ہیں ، تو گھٹنوں کے بل گھسٹتے ہوئے ان کے لیے آئیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 184512,
        "last_updated": null
    },
    {
        "urduURN": 4006510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 655,
        "hadithSanad": "ہم سے محمد بن عبداللہ بن حوشب نے بیان کیا ، انھوں نے کہا کہ ہم سے عبدالوہاب ثقفی نے بیان کیا ، انھوں نے کہا کہ مجھ سے حمید طویل نے انس بن مالک رضی اللہ عنہ سے بیان کیا ، انھوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اے بنوسلمہ والو ! کیا تم اپنے قدموں کا ثواب نہیں چاہتے ؟\nاور ابن ابی مریم نے بیان میں یہ زیادہ کہا ہے کہمجھے یحییٰ بن ایوب نے خبر دی ، کہا کہ مجھ سے حمید طویل نے بیان کیا ، کہا کہ مجھ سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ بنوسلمہ والوں نے یہ ارادہ کیا کہ اپنے مکان ( جو مسجد سے دور تھے ) چھوڑ دیں اور آنحضرت صلی اللہ علیہ وسلم کے قریب آ رہیں ۔ ( تاکہ باجماعت کے لیے مسجدنبوی کا ثواب حاصل ہو ) لیکن آنحضرت صلی اللہ علیہ وسلم کو مدینہ کا اجاڑ دینا برا معلوم ہوا ۔ آپ نے فرمایا کہ تم لوگ اپنے قدموں کا ثواب نہیں چاہتے ؟ مجاہد نے کہا ( سورۃ یٰسین میں ) «وآثارهم» سے قدم مراد ہیں ۔ یعنی زمین پر چلنے سے پاؤں کے نشانات ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 184541,
        "last_updated": null
    },
    {
        "urduURN": 4006530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 657,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا کہ ہم سے میرے باپ نے بیان کیا ، انھوں نے کہا کہ ہم سے اعمش نے بیان کیا ، انھوں نے کہا کہ مجھ سے ابوصالح ذکوان نے بیان کیا ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کیا ، انھوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ منافقوں پر فجر اور عشاء کی نماز سے زیادہ اور کوئی نماز بھاری نہیں اور اگر انہیں معلوم ہوتا کہ ان کا ثواب کتنا زیادہ ہے ( اور چل نہ سکتے ) تو گھٹنوں کے بل گھسیٹ کر آتے اور میرا تو ارادہ ہو گیا تھا کہ مؤذن سے کہوں کہ وہ تکبیر کہے ، پھر میں کسی کو نماز پڑھانے کے لیے کہوں اور خود آگ کی چنگاریاں لے کر ان سب کے گھروں کو جلا دوں جو ابھی تک نماز کے لیے نہیں نکلے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 184560,
        "last_updated": null
    },
    {
        "urduURN": 4006540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 658,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے یزید بن زریع نے بیان کیا ، کہا کہ ہم سے خالد حذاء نے ابوقلابہ عبداللہ بن زید سے ، انھوں نے مالک بن حویرث سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا جب نماز کا وقت آ جائے تو تم دونوں اذان دو اور اقامت کہو ، پھر جو تم میں بڑا ہے وہ امام بنے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 184570,
        "last_updated": null
    },
    {
        "urduURN": 4006550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 659,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا امام مالک سے ، انھوں نے ابوالزناد سے ، انھوں نے اعرج سے ، انھوں نے ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ملائکہ تم میں سے اس نمازی کے لیے اس وقت تک یوں دعا کرتے رہتے ہیں ۔ جب تک ( نماز پڑھنے کے بعد ) وہ اپنے مصلے پر بیٹھا رہے «اللهم اغفر له ،‏‏‏‏ ‏‏‏‏ اللهم ارحمه‏» کہ اے اللہ ! اس کی مغفرت کر ۔ اے اللہ ! اس پر رحم کر ۔ تم میں سے وہ شخص جو صرف نماز کی وجہ سے رکا ہوا ہے ۔ گھر جانے سے سوا نماز کے اور کوئی چیز اس کے لیے مانع نہیں ، تو اس کا ( یہ سارا وقت ) نماز ہی میں شمار ہو گا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 184580,
        "last_updated": null
    },
    {
        "urduURN": 4006560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 660,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے عبیداللہ بن عمر عمری سے بیان کیا ، کہا کہ مجھ سے خبیب بن عبدالرحمٰن نے بیان کیا حفص بن عاصم سے ، انھوں نے ابوہریرہ رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ سات طرح کے آدمی ہوں گے ۔ جن کو اللہ اس دن اپنے سایہ میں جگہ دے گا ۔ جس دن اس کے سایہ کے سوا اور کوئی سایہ نہ ہو گا ۔ اول انصاف کرنے والا بادشاہ ، دوسرے وہ نوجوان جو اپنے رب کی عبادت میں جوانی کی امنگ سے مصروف رہا ، تیسرا ایسا شخص جس کا دل ہر وقت مسجد میں لگا رہتا ہے ، چوتھے دو ایسے شخص جو اللہ کے لیے باہم محبت رکھتے ہیں اور ان کے ملنے اور جدا ہونے کی بنیاد یہی «للهى» ( اللہ کے لیے محبت ) محبت ہے ، پانچواں وہ شخص جسے کسی باعزت اور حسین عورت نے ( برے ارادہ سے ) بلایا لیکن اس نے کہہ دیا کہ میں اللہ سے ڈرتا ہوں ، چھٹا وہ شخص جس نے صدقہ کیا ، مگر اتنے پوشیدہ طور پر کہ بائیں ہاتھ کو بھی خبر نہیں ہوئی کہ داہنے ہاتھ نے کیا خرچ کیا ۔ ساتواں وہ شخص جس نے تنہائی میں اللہ کو یاد کیا اور ( بے ساختہ ) آنکھوں سے آنسو جاری ہو گئے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 184590,
        "last_updated": null
    },
    {
        "urduURN": 4006570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 661,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا کہ ہم سے اسماعیل بن جعفر نے بیان کیا حمید طویل سے ، انھوں نے کہا کہ انس بن مالک رضی اللہ عنہ سے دریافت کیا گیا کہ",
        "hadithText": "کیا رسول اللہ صلی اللہ علیہ وسلم نے کوئی انگوٹھی پہنی ہے ؟ آپ نے فرمایا کہ ہاں ! ایک رات عشاء کی نماز میں آپ صلی اللہ علیہ وسلم نے آدھی رات تک دیر کی ۔ نماز کے بعد ہماری طرف متوجہ ہوئے اور فرمایا ، لوگ نماز پڑھ کر سو چکے ہوں گے ۔ اور تم لوگ اس وقت تک نماز ہی کی حالت میں تھے جب تک تم نماز کا انتظار کرتے رہے ۔ حضرت انس رضی اللہ عنہ نے فرمایا جیسے اس وقت میں آپ صلی اللہ علیہ وسلم کی انگوٹھی کی چمک دیکھ رہا ہوں ( یعنی آپ صلی اللہ علیہ وسلم کی انگوٹھی کی چمک کا سماں میری آنکھوں میں ہے ) ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 184600,
        "last_updated": null
    },
    {
        "urduURN": 4006580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 662,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا کہ ہم سے یزید بن ہارون واسطی نے بیان کیا ، کہا کہ ہمیں محمد بن مطرف نے زید بن اسلم سے خبر دی ، انھوں نے عطاء بن یسار سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انھوں نے حضرت نبی کریم صلی اللہ علیہ وسلم سے",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص مسجد میں صبح شام بار بار حاضری دیتا ہے ۔ اللہ تعالیٰ جنت میں اس کی مہمانی کا سامان کرے گا ۔ وہ صبح شام جب بھی مسجد میں جائے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 184610,
        "last_updated": null
    },
    {
        "urduURN": 4006590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 663,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا کہ ہم سے ابراہیم بن سعد نے اپنے باپ سعد بن ابراہیم سے بیان کیا ، انھوں نے حفص بن عاصم سے ، انھوں نے عبداللہ بن مالک بن بحینہ سے ، کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کا گزر ایک شخص پر ہوا ( دوسری سند ) امام بخاری نے کہا کہ مجھ سے عبدالرحمٰن بن بشر نے بیان کیا ، کہا کہ ہم سے بہز بن اسد نے بیان کیا ۔ کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ مجھے سعد بن ابراہیم نے خبر دی ، کہا کہ میں نے حفص بن عاصم سے سنا ، کہا کہ میں نے قبیلہ ازد کے ایک صاحب سے جن کا نام مالک بن بحینہ رضی اللہ عنہ تھا ، سنا کہ رسول اللہ صلی اللہ علیہ وسلم کی نظر ایک ایسے نمازی پر پڑی جو تکبیر کے بعد دو رکعت نماز پڑھ رہا تھا ۔ آنحضور صلی اللہ علیہ وسلم جب نماز سے فارغ ہو گئے تو لوگ اس شخص کے اردگرد جمع ہو گئے اور آنحضور صلی اللہ علیہ وسلم نے فرمایا کیا صبح کی چار رکعتیں پڑھتا ہے ؟ کیا صبح کی چار رکعتیں ہو گئیں ؟ اس حدیث کی متابعت غندر اور معاذ نے شعبہ سے کی ہے جو مالک سے روایت کرتے ہیں ۔ ابن اسحاق نے سعد سے ، انھوں نے حفص سے ، وہ عبداللہ بن بحینہ سے اور حماد نے کہا کہ ہمیں سعد نے حفص کے واسطہ سے خبر دی اور وہ مالک کے واسطہ سے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 184621,
        "last_updated": null
    },
    {
        "urduURN": 4006600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 664,
        "hadithSanad": "ہم سے عمرو بن حفص بن غیاث نے بیان کیا ، کہا کہ مجھ سے میرے باپ حفص بن غیاث نے بیان کیا ، کہا کہ ہم سے اعمش نے ابراہیم نخعی سے بیان کیا کہ حضرت اسود بن یزید نخعی نے کہا کہ",
        "hadithText": "ہم حضرت عائشہ رضی اللہ عنہا کی خدمت میں حاضر تھے ۔ ہم نے نماز میں ہمیشگی اور اس کی تعظیم کا ذکر کیا ۔ حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم کے مرض الموت میں جب نماز کا وقت آیا اور اذان دی گئی تو فرمایا کہ ابوبکر سے کہو کہ لوگوں کو نماز پڑھائیں ۔ اس وقت آپ صلی اللہ علیہ وسلم سے کہا گیا کہ ابوبکر بڑے نرم دل ہیں ۔ اگر وہ آپ صلی اللہ علیہ وسلم کی جگہ کھڑے ہوں گے تو نماز پڑھانا ان کے لیے مشکل ہو جائے گی ۔ آپ صلی اللہ علیہ وسلم نے پھر وہی حکم فرمایا ، اور آپ صلی اللہ علیہ وسلم کے سامنے پھر وہی بات دہرا دی گئی ۔ تیسری مرتبہ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم تو بالکل یوسف کی ساتھ والی عورتوں کی طرح ہو ۔ ( کہ دل میں کچھ ہے اور ظاہر کچھ اور کر رہی ہو ) ابوبکر سے کہو کہ وہ نماز پڑھائیں ۔ آخر ابوبکر رضی اللہ عنہ نماز پڑھانے کے لیے تشریف لائے ۔ اتنے میں نبی کریم صلی اللہ علیہ وسلم نے مرض میں کچھ کمی محسوس کی اور دو آدمیوں کا سہارا لے کر باہر تشریف لے گئے ۔ گویا میں اس وقت آپ صلی اللہ علیہ وسلم کے قدموں کو دیکھ رہی ہوں کہ تکلیف کی وجہ سے زمین پر لکیر کرتے جاتے تھے ۔ ابوبکر رضی اللہ عنہ نے یہ دیکھ کر چاہا کہ پیچھے ہٹ جائیں ۔ لیکن آنحضور صلی اللہ علیہ وسلم نے اشارہ سے انہیں اپنی جگہ رہنے کے لیے کہا ۔ پھر ان کے قریب آئے اور بازو میں بیٹھ گئے ۔ جب اعمش نے یہ حدیث بیان کی ، ان سے پوچھا گیا کہ کیا نبی کریم صلی اللہ علیہ وسلم نے نماز پڑھائی ۔ اور ابوبکر رضی اللہ عنہ نے آپ کی اقتداء کی اور لوگوں نے ابوبکر رضی اللہ عنہ کی نماز کی اقتداء کی ؟ حضرت اعمش نے سر کے اشارہ سے بتلایا کہ ہاں ۔ ابوداؤد طیالسی نے اس حدیث کا ایک ٹکڑا شعبہ سے روایت کیا ہے اور شعبہ نے اعمش سے اور ابومعاویہ نے اس روایت میں یہ زیادہ کیا کہ آنحضرت صلی اللہ علیہ وسلم حضرت ابوبکر رضی اللہ عنہ کے بائیں طرف بیٹھے ۔ پس ابوبکر رضی اللہ عنہ کھڑے ہو کر نماز پڑھ رہے تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 184640,
        "last_updated": null
    },
    {
        "urduURN": 4006610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 665,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا کہ ہمیں ہشام بن یوسف نے خبر دی معمر سے ، انھوں نے زہری سے ، کہا کہ مجھے عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے خبر دی کہ حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم بیمار ہو گئے اور تکلیف زیادہ بڑھ گئی تو آپ صلی اللہ علیہ وسلم نے اپنی بیویوں سے اس کی اجازت لی کہ بیماری کے دن میرے گھر میں گزاریں ۔ انھوں نے اس کی آپ صلی اللہ علیہ وسلم کو اجازت دے دی ۔ پھر آپ صلی اللہ علیہ وسلم باہر تشریف لے گئے ۔ آپ صلی اللہ علیہ وسلم کے قدم زمین پر لکیر کر رہے تھے ۔ آپ صلی اللہ علیہ وسلم اس وقت عباس رضی اللہ عنہ اور ایک اور شخص کے بیچ میں تھے ( یعنی دونوں حضرات کا سہارا لیے ہوئے تھے ) عبیداللہ راوی نے بیان کیا کہ میں نے یہ حدیث حضرت عائشہ رضی اللہ عنہا کی عبداللہ بن عباس رضی اللہ عنہما سے بیان کی ، تو آپ نے فرمایا اس شخص کو بھی جانتے ہو ، جن کا نام حضرت عائشہ رضی اللہ عنہا نے نہیں لیا ۔ میں نے کہا کہ نہیں ! آپ نے فرمایا کہ وہ دوسرے آدمی حضرت علی رضی اللہ عنہ تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 184650,
        "last_updated": null
    },
    {
        "urduURN": 4006620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 666,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا کہ ہمیں امام مالک نے نافع سے خبر دی کہ",
        "hadithText": "حضرت عبداللہ بن عمر رضی اللہ عنہما نے ایک ٹھنڈی اور برسات کی رات میں اذان دی ، پھر یوں پکار کر کہہ دیا «ألا صلوا في الرحال‏» کہ لوگو ! اپنی قیام گاہوں پر ہی نماز پڑھ لو ۔ پھر فرمایا کہ نبی کریم صلی اللہ علیہ وسلم سردی و بارش کی راتوں میں مؤذن کو حکم دیتے تھے کہ وہ اعلان کر دے کہ لوگو اپنی قیام گاہوں پر ہی نماز پڑھ لو ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 184660,
        "last_updated": null
    },
    {
        "urduURN": 4006630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 667,
        "hadithSanad": "ہم سے اسماعیل بن ابی عتبان نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک رحمہ اللہ نے بیان کیا ، انہوں نے کہا ہم سے ابن شہاب نے بیان کیا ، انہوں نے محمود بن ربیع انصاری سے کہ",
        "hadithText": "بن مالک انصاری رضی اللہ عنہ نابینا تھے اور وہ اپنی قوم کے امام تھے ۔ انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا کہ یا رسول اللہ ! اندھیری اور سیلاب کی راتیں ہوتی ہیں اور میں اندھا ہوں ، اس لیے آپ میرے گھر میں کسی جگہ نماز پڑھ لیجیئے تاکہ میں وہیں اپنی نماز کی جگہ بنا لوں ۔ پھر رسول اللہ صلی اللہ علیہ وسلم ان کے گھر تشریف لائے اور پوچھا کہ تم کہاں نماز پڑھنا پسند کرو گے ۔ انھوں نے گھر میں ایک جگہ بتلا دی اور رسول اللہ صلی اللہ علیہ وسلم نے وہاں نماز پڑھی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 184670,
        "last_updated": null
    },
    {
        "urduURN": 4006640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 668,
        "hadithSanad": "ہم سے عبداللہ بن عبدالوہاب بصریٰ نے بیان کیا ، کہا کہ ہم سے حماد بن زید نے بیان کیا ، کہا کہ ہم سے عبدالحمید صاحب الزیادی نے بیان کیا کہ کہا میں نے عبداللہ بن حارث بن نوفل سے سنا ، انہوں نے کہا کہ",
        "hadithText": "ہمیں ایک دن ابن عباس رضی اللہ عنہما نے جب کہ بارش کی وجہ سے کیچڑ ہو رہی تھی خطبہ سنایا ۔ پھر مؤذن کو حکم دیا اور جب وہ «حى على الصلاة‏» پر پہنچا تو آپ نے فرمایا کہ آج یوں پکار دو «الصلاة في الرحال» کہ نماز اپنی قیام گاہوں پر پڑھ لو ۔ لوگ ایک دوسرے کو ( حیرت کی وجہ سے ) دیکھنے لگے ۔ جیسے اس کو انھوں نے ناجائز سمجھا ۔ ابن عباس رضی اللہ عنہما نے فرمایا کہ ایسا معلوم ہوتا ہے کہ تم نے شاید اس کو برا جانا ہے ۔ ایسا تو مجھ سے بہتر ذات یعنی رسول اللہ صلی اللہ علیہ وسلم نے بھی کیا تھا ۔ بیشک جمعہ واجب ہے مگر میں نے یہ پسند نہیں کیا کہ «حى على الصلاة‏» کہہ کر تمہیں باہر نکالوں ( اور تکلیف میں مبتلا کروں ) اور حماد عاصم سے ، وہ عبداللہ بن حارث سے ، وہ ابن عباس رضی اللہ عنہما سے ، اسی طرح روایت کرتے ہیں ۔ البتہ انھوں نے اتنا اور کہا کہ ابن عباس رضی اللہ عنہما نے فرمایا کہ مجھے اچھا معلوم نہیں ہوا کہ تمہیں گنہگار کروں اور تم اس حالت میں آؤ کہ تم مٹی میں گھٹنوں تک آلودہ ہو گئے ہو ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 184680,
        "last_updated": null
    },
    {
        "urduURN": 4006650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 669,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا کہ ہم سے ہشام دستوائی نے یحییٰ بن کثیر سے بیان کیا ، انہوں نے ابوسلمہ بن عبدالرحمٰن سے ، انہوں نے کہا کہ",
        "hadithText": "میں نے ابو سعید خدری رضی اللہ عنہ سے ( شب قدر کو ) پوچھا ۔ آپ نے فرمایا کہ بادل کا ایک ٹکڑا آیا اور برسا یہاں تک کہ ( مسجد کی چھت ) ٹپکنے لگی جو کھجور کی شاخوں سے بنائی گئی تھی ۔ پھر نماز کے لیے تکبیر ہوئی ۔ میں نے دیکھا کہ نبی کریم صلی اللہ علیہ وسلم کیچڑ اور پانی میں سجدہ کر رہے تھے ۔ کیچڑ کا نشان آپ کی پیشانی پر بھی میں نے دیکھا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 184690,
        "last_updated": null
    },
    {
        "urduURN": 4006660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 670,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ ہم سے انس بن سیرین نے بیان کیا ، کہا کہ میں نے انس رضی اللہ عنہ سے سنا کہ",
        "hadithText": "انصار میں سے ایک مرد نے عذر پیش کیا کہ میں آپ کے ساتھ نماز میں شریک نہیں ہو سکتا اور وہ موٹا آدمی تھا ۔ اس نے نبی کریم صلی اللہ علیہ وسلم کے لیے کھانا تیار کیا اور آپ صلی اللہ علیہ وسلم کو اپنے گھر دعوت دی اور آپ صلی اللہ علیہ وسلم کے لیے ایک چٹائی بچھا دی اور اس کے ایک کنارہ کو ( صاف کر کے ) دھو دیا ۔ آنحضور صلی اللہ علیہ وسلم نے اس بوریے پر دو رکعتیں پڑھیں ۔ آل جارود کے ایک شخص ( عبدالحمید ) نے انس رضی اللہ عنہ سے پوچھا کہ کیا نبی کریم صلی اللہ علیہ وسلم چاشت کی نماز پڑھتے تھے تو انھوں نے فرمایا کہ اس دن کے سوا اور کبھی میں نے آپ صلی اللہ علیہ وسلم کو پڑھتے نہیں دیکھا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 184700,
        "last_updated": null
    },
    {
        "urduURN": 4006670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 671,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے ہشام بن عروہ سے بیان کیا ، کہا کہ مجھ سے میرے باپ نے بیان کیا ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے سنا ، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر شام کا کھانا سامنے رکھا جائے اور ادھر نماز کے لیے تکبیر بھی ہونے لگے تو پہلے کھانا کھا لو ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 184710,
        "last_updated": null
    },
    {
        "urduURN": 4006680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 672,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث بن سعد نے بیان کیا ، انہوں نے عقیل سے ، انہوں نے ابن شہاب سے بیان کیا ، انہوں نے انس بن مالک رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جب شام کا کھانا حاضر کیا جائے تو مغرب کی نماز سے پہلے کھانا کھا لو اور کھانے میں بے مزہ بھی نہ ہونا چاہئے اور اپنا کھانا چھوڑ کر نماز میں جلدی مت کرو ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 184720,
        "last_updated": null
    },
    {
        "urduURN": 4006690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 673,
        "hadithSanad": "ہم سے عبید بن اسماعیل نے بیان کیا ابواسامہ حماد بن اسامہ سے ، انہوں نے عبیداللہ سے ، انہوں نے نافع سے ، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ",
        "hadithText": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جب تم میں سے کسی کا شام کا کھانا تیار ہو چکا ہو اور تکبیر بھی کہی جا چکی ہو تو پہلے کھانا کھا لو اور نماز کے لیے جلدی نہ کرو ، کھانے سے فراغت کر لو ۔ اور عبداللہ بن عمر رضی اللہ عنہما کے لیے کھانا رکھ دیا جاتا ، ادھر اقامت بھی ہو جاتی لیکن آپ کھانے سے فارغ ہونے تک نماز میں شریک نہیں ہوتے تھے ۔ آپ امام کی قرآت برابر سنتے رہتے تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 184730,
        "last_updated": null
    },
    {
        "urduURN": 4006700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 674,
        "hadithSanad": "زہیر اور وہب بن عثمان نے موسیٰ بن عقبہ سے بیان کیا ، انہوں نے نافع سے ، انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر تم میں سے کوئی کھانا کھا رہا ہو تو جلدی نہ کرے ، بلکہ پوری طرح کھا لے گو ( اگرچہ ) نماز کھڑی کیوں نہ ہو گئی ہو ۔ ابوعبداللہ حضرت امام بخاری رحمہ اللہ نے کہا اور مجھ سے ابراہیم بن المنذر نے وہب بن عثمان سے یہ حدیث بیان کی اور وہب مدنی ہیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 184740,
        "last_updated": null
    },
    {
        "urduURN": 4006710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 675,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا کہ ہم سے ابراہیم بن سعد نے صالح بن کیسان سے بیان کیا ، انہوں نے ابن شہاب سے ، انہوں نے کہا کہ مجھ کو جعفر بن عمرو بن امیہ نے خبر دی کہ ان کے باپ عمرو بن امیہ نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ صلی اللہ علیہ وسلم بکری کی ران کا گوشت کاٹ کاٹ کر کھا رہے تھے ۔ اتنے میں آپ صلی اللہ علیہ وسلم نماز کے لیے بلائے گئے آپ صلی اللہ علیہ وسلم کھڑے ہوئے اور چھری ڈال دی ، پھر آپ صلی اللہ علیہ وسلم نے نماز پڑھائی اور وضو نہیں کیا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 184750,
        "last_updated": null
    },
    {
        "urduURN": 4006720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 676,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ ہم سے حکم بن عتبہ نے ابراہیم نخعی سے بیان کیا ، انہوں نے اسود بن یزید سے ، انہوں نے کہا کہ میں نے حضرت عائشہ رضی اللہ عنہا سے پوچھا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم اپنے گھر میں کیا کیا کرتے تھے آپ نے بتلایا کہ حضور صلی اللہ علیہ وسلم اپنے گھر کے کام کاج یعنی اپنے گھر والیوں کی خدمت کیا کرتے تھے اور جب نماز کا وقت ہوتا تو فوراً ( کام کاج چھوڑ کر ) نماز کے لیے چلے جاتے تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 184760,
        "last_updated": null
    },
    {
        "urduURN": 4006730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 677,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے وہیب بن خالد نے بیان کیا ، کہا کہ ہم سے ایوب سختیانی نے ابوقلابہ عبداللہ بن زید سے بیان کیا ، انہوں نے کہا کہ مالک بن حویرث ( صحابی ) ایک دفعہ ہماری اس مسجد میں تشریف لائے اور فرمایا کہ",
        "hadithText": "میں تم لوگوں کو نماز پڑھاؤں گا اور میری نیت نماز پڑھنے کی نہیں ہے ، میرا مقصد صرف یہ ہے کہ تمہیں نماز کا وہ طریقہ سکھا دوں جس طریقہ سے نبی کریم صلی اللہ علیہ وسلم نماز پڑھا کرتے تھے ۔ میں نے ابوقلابہ سے پوچھا کہ انہوں نے کس طرح نماز پڑھی تھی ؟ انہوں نے بتلایا کہ ہمارے شیخ ( عمر بن سلمہ ) کی طرح ۔ شیخ جب سجدہ سے سر اٹھاتے تو ذرا بیٹھ جاتے پھر کھڑے ہوتے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 184770,
        "last_updated": null
    },
    {
        "urduURN": 4006740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 678,
        "hadithSanad": "ہم سے اسحاق بن نصر نے بیان کیا ، کہا کہ ہم سے حسین بن علی بن ولید نے زائدہ بن قدامہ سے بیان کیا ، انہوں نے عبدالملک بن عمیر سے ، کہا کہ مجھ سے ابوبردہ عامر نے بیان کیا ، انہوں نے ابوموسیٰ اشعری رضی اللہ عنہ سے ، آپ نے فرمایا کہ",
        "hadithText": "آپ نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم بیمار ہوئے اور جب بیماری شدت اختیار کر گئی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ ابوبکر ( رضی اللہ عنہ ) سے کہو کہ وہ لوگوں کو نماز پڑھائیں ۔ اس پر حضرت عائشہ رضی اللہ عنہا بولیں کہ وہ نرم دل ہیں جب آپ کی جگہ کھڑے ہوں گے تو ان کے لئے نماز پڑھانا مشکل ہو گا ۔ آپ صلی اللہ علیہ وسلم نے پھر فرمایا کہ ابوبکر سے کہو کہ وہ نماز پڑھائیں ۔ حضرت عائشہ رضی اللہ عنہا نے پھر وہی بات کہی ۔ آپ صلی اللہ علیہ وسلم نے پھر فرمایا کہ ابوبکر سے کہو کہ نماز پڑھائیں ، تم لوگ صواحب یوسف ( زلیخا ) کی طرح ( باتیں بناتی ) ہو ۔ آخر ابوبکر صدیق رضی اللہ عنہ کے پاس آدمی بلانے آیا اور آپ نے لوگوں کو نبی کریم صلی اللہ علیہ وسلم کی زندگی میں ہی نماز پڑھائی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 184780,
        "last_updated": null
    },
    {
        "urduURN": 4006750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 679,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہوں نے کہا کہ ہمیں امام مالک رحمہ اللہ نے ہشام بن عروہ سے خبر دی ، انہوں نے اپنے باپ عروہ بن زبیر سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے ، انہوں نے کہا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیماری میں فرمایا کہ ابوبکر ( رضی اللہ عنہ ) سے نماز پڑھانے کے لیے کہو ۔ حضرت عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ میں نے عرض کیا کہ ابوبکر آپ کی جگہ کھڑے ہوں گے تو روتے روتے وہ ( قرآن مجید ) سنا نہ سکیں گے ، اس لیے آپ عمر رضی اللہ عنہ سے کہئے کہ وہ نماز پڑھائیں ۔ آپ فرماتی تھیں کہ میں نے حفصہ رضی اللہ عنہا سے کہا کہ وہ بھی کہیں کہ اگر ابوبکر آپ کی جگہ کھڑے ہوئے تو روتے روتے لوگوں کو ( قرآن ) نہ سنا سکیں گے ۔ اس لیے عمر رضی اللہ عنہ سے کہئے کہ وہ نماز پڑھائیں ۔ حفصہ رضی اللہ عنہا ( ام المؤمنین اور حضرت عمر رضی اللہ عنہ کی صاحبزادی ) نے بھی اسی طرح کہا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ خاموش رہو ۔ تم صواحب یوسف کی طرح ہو ۔ ابوبکر سے کہو کہ وہ لوگوں کو نماز پڑھائیں ۔ پس حضرت حفصہ رضی اللہ عنہ نے حضرت عائشہ رضی اللہ عنہا سے کہا ۔ بھلا مجھ کو کہیں تم سے بھلائی پہنچ سکتی ہے ؟</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 184790,
        "last_updated": null
    },
    {
        "urduURN": 4006760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 680,
        "hadithSanad": "ہم سے ابوالیمان حکم بن نافع نے بیان کیا ، کہا کہ ہمیں شعیب بن ابی حمزہ نے زہری سے خبر دی ، کہا کہ مجھے انس بن مالک انصاری رضی اللہ عنہ نے خبر دی .... آپ نبی کریم صلی اللہ علیہ وسلم کی پیروی کرنے والے ، آپ کے خادم اور صحابی تھے ....",
        "hadithText": "کہ آنحضور صلی اللہ علیہ وسلم کے مرض الموت میں ابوبکر صدیق رضی اللہ عنہ نماز پڑھاتے تھے ۔ پیر کے دن جب لوگ نماز میں صف باندھے کھڑے ہوئے تھے تو آنحضور صلی اللہ علیہ وسلم حجرہ کا پردہ ہٹائے کھڑے ہوئے ، ہماری طرف دیکھ رہے تھے ۔ آپ صلی اللہ علیہ وسلم کا چہرہ مبارک ( حسن و جمال اور صفائی میں ) گویا مصحف کا ورق تھا ۔ آپ صلی اللہ علیہ وسلم مسکرا کر ہنسنے لگے ۔ ہمیں اتنی خوشی ہوئی کہ خطرہ ہو گیا کہ کہیں ہم سب آپ صلی اللہ علیہ وسلم کو دیکھنے ہی میں نہ مشغول ہو جائیں اور نماز توڑ دیں ۔ حضرت ابوبکر رضی اللہ عنہ الٹے پاؤں پیچھے ہٹ کر صف کے ساتھ آ ملنا چاہتے تھے ۔ انہوں نے سمجھا کہ نبی کریم صلی اللہ علیہ وسلم نماز کے لیے تشریف لا رہے ہیں ، لیکن آپ صلی اللہ علیہ وسلم نے ہمیں اشارہ کیا کہ نماز پوری کر لو ۔ پھر آپ صلی اللہ علیہ وسلم نے پردہ ڈال دیا ۔ پس آنحضرت صلی اللہ علیہ وسلم کی وفات اسی دن ہو گئی ۔ («اناللہ و انا الیہ راجعون»)</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 184800,
        "last_updated": null
    },
    {
        "urduURN": 4006770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 681,
        "hadithSanad": "ہم سے ابومعمر عبداللہ بن عمر منقری نے بیان کیا ، کہا کہ ہم سے عبدالوارث بن سعید نے بیان کیا ۔ کہا کہ ہم سے عبدالعزیز بن صہیب نے انس بن مالک رضی اللہ عنہ سے بیان کیا ، آپ نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ( ایام بیماری میں ) تین دن تک باہر تشریف نہیں لائے ۔ ان ہی دنوں میں ایک دن نماز قائم کی گئی ۔ حضرت ابوبکر رضی اللہ عنہ آگے بڑھنے کو تھے کہ نبی کریم صلی اللہ علیہ وسلم نے ( حجرہ مبارک کا ) پردہ اٹھایا ۔ جب حضور صلی اللہ علیہ وسلم کا چہرہ مبارک دکھائی دیا ۔ تو آپ صلی اللہ علیہ وسلم کے روئے پاک و مبارک سے زیادہ حسین منظر ہم نے کبھی نہیں دیکھا تھا ۔ ( قربان اس حسن و جمال کے ) پھر آپ صلی اللہ علیہ وسلم نے حضرت ابوبکر صدیق رضی اللہ عنہ کو آگے بڑھنے کے لیے اشارہ کیا اور آپ صلی اللہ علیہ وسلم نے پردہ گرا دیا اور اس کے بعد وفات تک کوئی آپ صلی اللہ علیہ وسلم کو دیکھنے پر قادر نہ ہو سکا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 184810,
        "last_updated": null
    },
    {
        "urduURN": 4006780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 682,
        "hadithSanad": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، کہا کہ مجھ سے عبداللہ بن وہب نے بیان کیا ، کہا کہ مجھ سے یونس بن یزید ایلی نے ابن شہاب سے بیان کیا ، انہوں نے حمزہ بن عبداللہ سے ، انہوں نے اپنے باپ عبداللہ بن عمر رضی اللہ عنہما سے خبر دی کہ",
        "hadithText": "جب رسول کریم صلی اللہ علیہ وسلم کی بیماری شدت اختیار کر گئی اور آپ صلی اللہ علیہ وسلم سے نماز کے لیے کہا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ ابوبکر سے کہو کہ وہ نماز پڑھائیں ۔ عائشہ رضی اللہ عنہا نے عرض کیا کہ ابوبکر کچے دل کے آدمی ہیں ۔ جب وہ قرآن مجید پڑھتے ہیں تو بہت رونے لگتے ہیں ۔ لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ ان ہی سے کہو کہ نماز پڑھائیں ۔ دوبارہ انہوں نے پھر وہی عذر دہرایا ۔ آپ صلی اللہ علیہ وسلم نے پھر فرمایا کہ ان سے نماز پڑھانے کے لیے کہو ۔ تم تو بالکل صواحب یوسف کی طرح ہو ۔ اس حدیث کی متابعت محمد بن ولید زبیدی اور زہری کے بھتیجے اور اسحاق بن یحییٰ کلبی نے زہری سے کی ہے اور عقیل اور معمر نے زہری سے ، انہوں نے حمزہ بن عبداللہ بن عمر سے ، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 184820,
        "last_updated": null
    },
    {
        "urduURN": 4006790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 683,
        "hadithSanad": "ہم سے زکریابن یحییٰ بلخی نے بیان کیا ، انہوں نے کہا کہ ہم سے عبداللہ بن نمیر نے بیان کیا ، انہوں نے کہا کہ ہمیں ہشام بن عروہ نے اپنے والد عروہ سے خبر دی ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے ۔ آپ نے کہا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیماری میں حکم دیا کہ ابوبکر لوگوں کو نماز پڑھائیں ۔ اس لیے آپ لوگوں کو نماز پڑھاتے تھے ۔ عروہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک دن اپنے آپ کو کچھ ہلکا پایا اور باہر تشریف لائے ۔ اس وقت حضرت ابوبکر رضی اللہ عنہ نماز پڑھا رہے تھے ۔ انھوں نے جب حضور اکرم صلی اللہ علیہ وسلم کو دیکھا تو پیچھے ہٹنا چاہا ، لیکن آنحضور صلی اللہ علیہ وسلم نے اشارے سے انہیں اپنی جگہ قائم رہنے کا حکم فرمایا ۔ پس رسول کریم صلی اللہ علیہ وسلم ابوبکر صدیق رضی اللہ عنہ کے بازو میں بیٹھ گئے ۔ ابوبکر رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کی اقتداء کر رہے تھے اور لوگ ابوبکر رضی اللہ عنہ کی پیروی کرتے تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 184830,
        "last_updated": null
    },
    {
        "urduURN": 4006800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 684,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہمیں امام مالک نے ابوحازم سلمہ بن دینار سے خبر دی ، انہوں نے سہل بن سعد ساعدی ( صحابی رضی اللہ عنہ ) سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم بنی عمرو بن عوف میں ( قباء میں ) صلح کرانے کے لیے گئے ، پس نماز کا وقت آ گیا ۔ مؤذن ( حضرت بلال رضی اللہ عنہ نے ) ابوبکر رضی اللہ عنہ سے آ کر کہا کہ کیا آپ نماز پڑھائیں گے ۔ میں تکبیر کہوں ۔ ابوبکر رضی اللہ نے فرمایا کہ ہاں چنانچہ ابوبکر صدیق رضی اللہ عنہ نے نماز شروع کر دی ۔ اتنے میں رسول کریم صلی اللہ علیہ وسلم تشریف لے آئے تو لوگ نماز میں تھے ۔ آپ صلی اللہ علیہ وسلم صفوں سے گزر کر پہلی صف میں پہنچے ۔ لوگوں نے ایک ہاتھ کو دوسرے پر مارا ( تاکہ حضرت ابوبکر رضی اللہ عنہ آنحضور صلی اللہ علیہ وسلم کی آمد پر آگاہ ہو جائیں ) لیکن ابوبکر رضی اللہ عنہ نماز میں کسی طرف توجہ نہیں دیتے تھے ۔ جب لوگوں نے متواتر ہاتھ پر ہاتھ مارنا شروع کیا تو صدیق اکبر رضی اللہ عنہ متوجہ ہوئے اور رسول کریم صلی اللہ علیہ وسلم کو دیکھا ۔ آپ صلی اللہ علیہ وسلم نے اشارہ سے انہیں اپنی جگہ رہنے کے لیے کہا ۔ ( کہ نماز پڑھائے جاؤ ) لیکن انھوں نے اپنے ہاتھ اٹھا کر اللہ کا شکر کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے ان کو امامت کا اعزاز بخشا ، پھر بھی وہ پیچھے ہٹ گئے اور صف میں شامل ہو گئے ۔ اس لیے نبی کریم صلی اللہ علیہ وسلم نے آگے بڑھ کر نماز پڑھائی ۔ نماز سے فارغ ہو کر آپ صلی اللہ علیہ وسلم نے فرمایا کہ ابوبکر جب میں نے آپ کو حکم دے دیا تھا پھر آپ ثابت قدم کیوں نہ رہے ۔ حضرت ابوبکر رضی اللہ عنہ بولے کہ ابوقحافہ کے بیٹے ( یعنی ابوبکر ) کی یہ حیثیت نہ تھی کہ رسول اللہ صلی اللہ علیہ وسلم کے سامنے نماز پڑھا سکیں ۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے لوگوں کی طرف خطاب کرتے ہوئے فرمایا کہ عجیب بات ہے ۔ میں نے دیکھا کہ تم لوگ بکثرت تالیاں بجا رہے تھے ۔ ( یاد رکھو ) اگر نماز میں کوئی بات پیش آ جائے تو سبحان اللہ کہنا چاہئے جب وہ یہ کہے گا تو اس کی طرف توجہ کی جائے گی اور یہ تالی بجانا عورتوں کے لیے ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 184840,
        "last_updated": null
    },
    {
        "urduURN": 4006810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 685,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا کہ ہمیں حماد بن زید نے خبر دی ایوب سختیانی سے ، انہوں نے ابوقلابہ سے ، انہوں نے مالک بن حویرث رضی اللہ عنہ سے ، انہوں نے بیان کیا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں اپنے ملک سے حاضر ہوئے ۔ ہم سب ہم عمر نوجوان تھے ۔ تقریباً بیس راتیں ہم آپ کی خدمت میں ٹھہرے رہے ۔ آپ صلی اللہ علیہ وسلم بڑے ہی رحم دل تھے ۔ آپ صلی اللہ علیہ وسلم نے ( ہماری غربت کا حال دیکھ کر ) فرمایا کہ جب تم لوگ اپنے گھروں کو جاؤ تو اپنے قبیلہ والوں کو دین کی باتیں بتانا اور ان سے نماز پڑھنے کے لیے کہنا کہ فلاں نماز فلاں وقت اور فلاں نماز فلاں وقت پڑھیں ۔ اور جب نماز کا وقت ہو جائے تو کوئی ایک اذان دے اور جو عمر میں بڑا ہو وہ امامت کرائے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 184850,
        "last_updated": null
    },
    {
        "urduURN": 4006820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 686,
        "hadithSanad": "ہم سے معاذ بن اسد نے بیان کیا ، کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی ، کہا کہ ہمیں معمر نے زہری سے خبر دی ، کہا کہ مجھے محمود بن ربیع نے خبر دی ، کہا کہ میں نے عتبان بن مالک انصاری رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے ( میرے گھر تشریف لانے کی ) اجازت چاہی اور میں نے آپ کو اجازت دی ، آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تم لوگ اپنے گھر میں جس جگہ پسند کرو میں نماز پڑھ دوں میں جہاں چاہتا تھا اس کی طرف میں نے اشارہ کیا ۔ پھر آپ کھڑے ہو گئے اور ہم نے آپ کے پیچھے صف باندھ لی ۔ پھر آپ نے جب سلام پھیرا تو ہم نے بھی سلام پھیرا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 184860,
        "last_updated": null
    },
    {
        "urduURN": 4006830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 687,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، کہا کہ ہمیں زائدہ بن قدامہ نے موسیٰ بن ابی عائشہ سے خبر دی ، انہوں نے عبیداللہ بن عبداللہ بن عتبہ سے ، انہوں نے کہا کہ",
        "hadithText": "میں حضرت عائشہ رضی اللہ عنہا کی خدمت میں حاضر ہوا اور کہا ، کاش ! رسول اللہ صلی اللہ علیہ وسلم کی بیماری کی حالت آپ ہم سے بیان کرتیں ، ( تو اچھا ہوتا ) انھوں نے فرمایا کہ ہاں ضرور سن لو ۔ آپ صلی اللہ علیہ وسلم کا مرض بڑھ گیا ۔ تو آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کیا لوگوں نے نماز پڑھ لی ؟ ہم نے عرض کی جی نہیں یا رسول اللہ ! لوگ آپ کا انتظام کر رہے ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میرے لیے ایک لگن میں پانی رکھ دو ۔ حضرت عائشہ رضی اللہ عنہا نے کہا کہ ہم نے پانی رکھ دیا اور آپ صلی اللہ علیہ وسلم نے بیٹھ کر غسل کیا ۔ پھر آپ اٹھنے لگے ، لیکن آپ بیہوش ہو گئے ۔ جب ہوش ہوا تو پھر آپ نے پوچھا کہ کیا لوگوں نے نماز پڑھ لی ہے ۔ ہم نے عرض کی نہیں حضور ! لوگ آپ کا انتظار کر رہے ہیں ۔ آپ صلی اللہ علیہ وسلم نے ( پھر ) فرمایا کہ لگن میں میرے لیے پانی رکھ دو ۔ حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ ہم نے پھر پانی رکھ دیا اور آپ صلی اللہ علیہ وسلم نے بیٹھ کر غسل فرمایا ۔ پھر اٹھنے کی کوشش کی لیکن ( دوبارہ ) پھر آپ بیہوش ہو گئے ۔ جب ہوش ہوا تو آپ نے پھر یہی فرمایا کہ کیا لوگوں نے نماز پڑھ لی ہے ۔ ہم نے عرض کی کہ نہیں یا رسول اللہ ! لوگ آپ کا انتظار کر رہے ہیں ۔ آپ صلی اللہ علیہ وسلم نے پھر فرمایا کہ لگن میں پانی لاؤ اور آپ صلی اللہ علیہ وسلم نے بیٹھ کر غسل کیا ۔ پھر اٹھنے کی کوشش کی ، لیکن پھر آپ بیہوش ہو گئے ۔ پھر جب ہوش ہوا تو آپ صلی اللہ علیہ وسلم نے پوچھا کہ کیا لوگوں نے نماز پڑھ لی ہم نے عرض کی کہ نہیں یا رسول اللہ ! وہ آپ کا انتظار کر رہے ہیں ۔ لوگ مسجد میں عشاء کی نماز کے لیے بیٹھے ہوئے نبی کریم صلی اللہ علیہ وسلم کا انتظار کر رہے تھے ۔ آخر آپ صلی اللہ علیہ وسلم نے حضرت ابوبکر رضی اللہ عنہ کے پاس آدمی بھیجا اور حکم فرمایا کہ وہ نماز پڑھا دیں ۔ بھیجے ہوئے شخص نے آ کر کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے آپ کو نماز پڑھانے کے لیے حکم فرمایا ہے ۔ ابوبکر رضی اللہ عنہ بڑے نرم دل انسان تھے ۔ انھوں نے حضرت عمر رضی اللہ عنہ سے کہا کہ تم نماز پڑھاؤ ، لیکن حضرت عمر رضی اللہ عنہ نے جواب دیا کہ آپ اس کے زیادہ حقدار ہیں ۔ آخر ( بیماری ) کے دنوں میں حضرت ابوبکر رضی اللہ عنہ نماز پڑھاتے رہے ۔ پھر جب نبی کریم صلی اللہ علیہ وسلم کو مزاج کچھ ہلکا معلوم ہوا تو دو مردوں کا سہارا لے کر جن میں ایک حضرت عباس رضی اللہ عنہ تھے ظہر کی نماز کے لیے گھر سے باہر تشریف لائے اور ابوبکر رضی اللہ عنہ نماز پڑھا رہے تھے ، جب انھوں نے آنحضور صلی اللہ علیہ وسلم کو دیکھا تو پیچھے ہٹنا چاہا ، لیکن نبی کریم صلی اللہ علیہ وسلم نے اشارے سے انہیں روکا کہ پیچھے نہ ہٹو ! پھر آپ نے ان دونوں مردوں سے فرمایا کہ مجھے ابوبکر کے بازو میں بٹھا دو ۔ چنانچہ دونوں نے آپ کو ابوبکر رضی اللہ عنہ کے بازو میں بٹھا دیا ۔ راوی نے کہا کہ پھر ابوبکر رضی اللہ عنہ نماز میں نبی کریم صلی اللہ علیہ وسلم کی پیروی کر رہے تھے اور لوگ ابوبکر رضی اللہ عنہ کی نماز کی پیروی کر رہے تھے ۔ نبی کریم صلی اللہ علیہ وسلم بیٹھے بیٹھے نماز پڑھ رہے تھے ۔ عبیداللہ نے کہا کہ پھر میں عبداللہ بن عباس رضی اللہ عنہما کی خدمت میں گیا اور ان سے عرض کی کہ حضرت عائشہ رضی اللہ عنہا نے آنحضرت صلی اللہ علیہ وسلم کی بیماری کے بارے میں جو حدیث بیان کی ہے کیا میں وہ آپ کو سناؤں ؟ انھوں نے فرمایا کہ ضرور سناؤ ۔ میں نے یہ حدیث سنا دی ۔ انھوں نے کسی بات کا انکار نہیں کیا ۔ صرف اتنا کہا کہ عائشہ رضی اللہ عنہا نے ان صاحب کا نام بھی تم کو بتایا جو حضرت عباس رضی اللہ عنہ کے ساتھ تھے ۔ میں نے کہا نہیں ۔ آپ نے فرمایا وہ حضرت علی رضی اللہ عنہ تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 184870,
        "last_updated": null
    },
    {
        "urduURN": 4006840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 688,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا کہا کہ ہم سے امام مالک رحمہ اللہ نے ہشام بن عروہ سے بیان کیا ۔ انہوں نے اپنے باپ عروہ سے انہوں نے ام المؤمنین حضرت عائشہ رضی اللہ عنہا سے کہ آپ نے بتلایا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے ایک مرتبہ بیماری کی حالت میں میرے ہی گھر میں نماز پڑھی ۔ آپ صلی اللہ علیہ وسلم بیٹھ کر نماز پڑھ رہے تھے اور لوگ آپ صلی اللہ علیہ وسلم کے پیچھے کھڑے ہو کر پڑھ رہے تھے ۔ آپ صلی اللہ علیہ وسلم نے ان کو بیٹھنے کا اشارہ کیا اور نماز سے فارغ ہونے کے بعد فرمایا کہ امام اس لیے ہے کہ اس کی پیروی کی جائے ۔ اس لیے جب وہ رکوع میں جائے تو تم بھی رکوع میں جاؤ اور جب وہ سر اٹھائے تو تم بھی سر اٹھاؤ اور جب وہ «سمع الله لمن حمده‏» کہے تو تم «ربنا ولك الحمد‏» کہو اور جب وہ بیٹھ کر نماز پڑھے تو تم بھی بیٹھ کر نماز پڑھو ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 184880,
        "last_updated": null
    },
    {
        "urduURN": 4006850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 689,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا کہ ہمیں امام مالک رحمہ اللہ نے ابن شہاب سے خبر دی ، انہوں نے انس بن مالک رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم ایک گھوڑے پر سوار ہوئے تو آپ صلی اللہ علیہ وسلم اس پر سے گر پڑے ۔ اس سے آپ صلی اللہ علیہ وسلم کے دائیں پہلو پر زخم آئے ۔ تو آپ صلی اللہ علیہ وسلم نے کوئی نماز پڑھی ۔ جسے آپ صلی اللہ علیہ وسلم بیٹھ کر پڑھ رہے تھے ۔ اس لیے ہم نے بھی آپ صلی اللہ علیہ وسلم کے پیچھے بیٹھ کر نماز پڑھی ۔ جب آپ صلی اللہ علیہ وسلم فارغ ہوئے تو فرمایا کہ امام اس لیے مقرر کیا گیا ہے کہ اس کی اقتداء کی جائے ۔ اس لیے جب وہ کھڑے ہو کر نماز پڑھے تو تم بھی کھڑے ہو کر پڑھو اور جب وہ رکوع کرے تو تم بھی رکوع کرو ۔ جب وہ رکوع سے سر اٹھائے تو تم بھی اٹھاؤ اور جب وہ «سمع الله لمن حمده‏» کہے تو تم «ربنا ولك الحمد‏» کہو اور جب وہ بیٹھ کر نماز پڑھے تو تم بھی بیٹھ کر پڑھو ۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے کہا کہ حمیدی نے آپ صلی اللہ علیہ وسلم کے اس قول ’’ جب امام بیٹھ کر نماز پڑھے تو تم بھی بیٹھ کر پڑھو ۔ ‘‘ کے متعلق کہا ہے کہ یہ ابتداء میں آپ صلی اللہ علیہ وسلم کی پرانی بیماری کا واقعہ ہے ۔ اس کے بعد آخری بیماری میں آپ صلی اللہ علیہ وسلم نے خود بیٹھ کر نماز پڑھی تھی اور لوگ آپ صلی اللہ علیہ وسلم کے پیچھے کھڑے ہو کر اقتداء کر رہے تھے ۔ آپ صلی اللہ علیہ وسلم نے اس وقت لوگوں کو بیٹھنے کی ہدایت نہیں فرمائی اور اصل یہ ہے کہ جو فعل آپ صلی اللہ علیہ وسلم کا آخری ہو اس کو لینا چاہئے اور پھر جو اس سے آخری ہو ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 184890,
        "last_updated": null
    },
    {
        "urduURN": 4006860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 690,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، انہوں نے کہا کہ ہم سے یحییٰ بن سعید نے سفیان سے بیان کیا ، انہوں نے کہا کہ مجھ سے ابواسحاق نے بیان کیا ، کہا کہ مجھ سے عبداللہ بن یزید نے بیان کیا ، کہا کہ مجھ سے براء بن عازب رضی اللہ عنہ نے بیان کیا ، وہ جھوٹے نہیں تھے ۔ ( بلکہ نہایت ہی سچے تھے ) انہوں نے بتلایا کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم «سمع الله لمن حمده‏» کہتے تو ہم میں سے کوئی بھی اس وقت تک نہ جھکتا جب تک آنحضور صلی اللہ علیہ وسلم سجدہ میں نہ چلے جاتے پھر ہم لوگ سجدہ میں جاتے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 184900,
        "last_updated": null
    },
    {
        "urduURN": 4006870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 691,
        "hadithSanad": "ہم سے حجاج بن منہال نے بیان کیا ، انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا ، انہوں نے محمد بن زیاد سے بیان کیا ، کہا کہ میں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، وہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے تھے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا کیا تم میں وہ شخص جو ( رکوع یا سجدہ میں ) امام سے پہلے اپنا سر اٹھا لیتا ہے اس بات سے نہیں ڈرتا کہ کہیں اللہ پاک اس کا سر گدھے کے سر کی طرح بنا دے یا اس کی صورت کو گدھے کی سی صورت بنا دے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 184920,
        "last_updated": null
    },
    {
        "urduURN": 4006880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 692,
        "hadithSanad": "ہم سے ابراہیم بن المنذر حزامی نے بیان کیا ، انہوں نے کہا کہ ہم سے انس بن عیاض نے بیان کیا انہوں نے عبیداللہ عمری سے ، انہوں نے حضرت نافع سے انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے کہ",
        "hadithText": "جب پہلے مہاجرین رسول اللہ صلی اللہ علیہ وسلم کی ہجرت سے بھی پہلے قباء کے مقام عصبہ میں پہنچے تو ان کی امامت ابوحذیفہ کے غلام سالم رضی اللہ عنہ کیا کرتے تھے ۔ آپ کو قرآن مجید سب سے زیادہ یاد تھا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 184930,
        "last_updated": null
    },
    {
        "urduURN": 4006890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 693,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ مجھ سے ابوالتیاح یزید بن حمید ضبعی نے انس بن مالک رضی اللہ عنہ سے بیان کیا ، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا ( اپنے حاکم کی ) سنو اور اطاعت کرو ، خواہ ایک ایسا حبشی ( غلام تم پر ) کیوں نہ حاکم بنا دیا جائے جس کا سر سوکھے ہوئے انگور کے برابر ہو ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 184940,
        "last_updated": null
    },
    {
        "urduURN": 4006900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 694,
        "hadithSanad": "ہم سے فضل بن سہل نے بیان کیا ، کہا کہ ہم سے حسن بن موسیٰ اشیب نے بیان کیا ، کہا کہ ہم سے ابوعبدالرحمن بن عبداللہ بن دینار نے بیان کیا زید بن اسلم سے ، انہوں نے عطاء بن یسار سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ امام لوگوں کو نماز پڑھاتے ہیں ۔ پس اگر امام نے ٹھیک نماز پڑھائی تو اس کا ثواب تمہیں ملے گا اور اگر غلطی کی تو بھی ( تمہاری نماز کا ) ثواب تم کو ملے گا اور غلطی کا وبال ان پر رہے گا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 184950,
        "last_updated": null
    },
    {
        "urduURN": 4006910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 695,
        "hadithSanad": "امام بخاری رحمہ اللہ نے کہا کہ ہم سے محمد بن یوسف فریابی نے کہا کہ ہم سے امام اوزاعی نے بیان کیا ، کہا ہم سے امام زہری نے حمید بن عبدالرحمٰن سے نقل کیا ۔ انہوں نے عبیداللہ بن عدی بن خیار سے کہ",
        "hadithText": "وہ خود حضرت عثمان غنی رضی اللہ عنہ کے پاس گئے ۔ جب کہ باغیوں نے ان کو گھیر رکھا تھا ۔ انھوں نے کہا کہ آپ ہی عام مسلمانوں کے امام ہیں مگر آپ پر جو مصیبت ہے وہ آپ کو معلوم ہے ۔ ان حالات میں باغیوں کا مقررہ امام نماز پڑھا رہا ہے ۔ ہم ڈرتے ہیں کہ اس کے پیچھے نماز پڑھ کر گنہگار نہ ہو جائیں ۔ حضرت عثمان رضی اللہ عنہ نے جواب دیا نماز تو جو لوگ کام کرتے ہیں ان کاموں میں سب سے بہترین کام ہے ۔ تو وہ جب اچھا کام کریں تم بھی اس کے ساتھ مل کر اچھا کام کرو اور جب وہ برا کام کریں تو تم ان کی برائی سے الگ رہو اور محمد بن یزید زبیدی نے کہا کہ امام زہری نے فرمایا کہ ہم تو یہ سمجھتے ہیں کہ ہیجڑے کے پیچھے نماز نہ پڑھیں ۔ مگر ایسی ہی لاچاری ہو تو اور بات ہے جس کے بغیر کوئی چارہ نہ ہو ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 184960,
        "last_updated": null
    },
    {
        "urduURN": 4006920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 696,
        "hadithSanad": "ہم سے محمد بن ابان نے بیان کیا ، کہا کہ ہم سے غندر محمد بن جعفر نے بیان کیا شعبہ سے ، انہوں نے ابوالتیاح سے ، انہوں نے انس بن مالک سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ابوذر سے فرمایا ( حاکم کی ) سن اور اطاعت کر ۔ خواہ وہ ایک ایسا حبشی غلام ہی کیوں نہ ہو جس کا سر منقے کے برابر ہو ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 184970,
        "last_updated": null
    },
    {
        "urduURN": 4006930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 697,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا کہ ہم سے شعبہ نے حکم سے بیان کیا ، انہوں نے کہا کہ میں نے سعید بن جبیر سے سنا ، وہ حضرت ابن عباس رضی اللہ عنہما سے بیان کرتے تھے کہ انہوں نے بتلایا کہ",
        "hadithText": "ایک رات میں اپنی خالہ ام المؤمنین میمونہ رضی اللہ عنہا کے گھر پر رہ گیا ۔ رسول اللہ صلی اللہ علیہ وسلم عشاء کی نماز کے بعد جب ان کے گھر تشریف لائے تو یہاں چار رکعت نماز پڑھی ۔ پھر آپ صلی اللہ علیہ وسلم سو گئے پھر نماز ( تہجد کے لیے ) آپ صلی اللہ علیہ وسلم اٹھے ( اور نماز پڑھنے لگے ) تو میں بھی اٹھ کر آپ صلی اللہ علیہ وسلم کی بائیں طرف کھڑا ہو گیا ، لیکن آپ صلی اللہ علیہ وسلم نے مجھے اپنی داہنی طرف کر لیا ۔ آپ صلی اللہ علیہ وسلم نے پانچ رکعت نماز پڑھی ۔ پھر دو رکعت ( سنت فجر ) پڑھ کر سو گئے اور میں نے آپ صلی اللہ علیہ وسلم کے خراٹے کی آواز بھی سنی ۔ پھر آپ صلی اللہ علیہ وسلم فجر کی نماز کے لیے برآمد ہوئے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 184980,
        "last_updated": null
    },
    {
        "urduURN": 4006940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 698,
        "hadithSanad": "ہم سے احمد بن صالح نے بیان کیا ، کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا ، کہا کہ ہم سے عمرو بن حارث مصری نے عبد ربہ بن سعید سے بیان کیا ، انہوں نے مخرمہ بن سلیمان سے ، انہوں نے ابن عباس رضی اللہ عنہما کے غلام کریب سے انہوں نے ابن عباس رضی اللہ عنہما سے ۔ آپ نے بتلایا کہ",
        "hadithText": "میں ایک رات ام المؤمنین میمونہ کے ہاں سو گیا ۔ اس رات نبی کریم صلی اللہ علیہ وسلم کی بھی وہیں سونے کی باری تھی ۔ آپ صلی اللہ علیہ وسلم نے وضو کیا اور نماز پڑھنے کے لیے کھڑے ہو گئے ۔ میں آپ صلی اللہ علیہ وسلم کے بائیں طرف کھڑا ہو گیا ۔ اس لیے آپ صلی اللہ علیہ وسلم نے مجھے پکڑ کر دائیں طرف کر دیا ۔ پھر تیرہ رکعت ( وتر سمیت ) نماز پڑھی اور سو گئے ۔ یہاں تک کہ خراٹے لینے لگے اور نبی کریم صلی اللہ علیہ وسلم جب سوتے تو خراٹے لیتے تھے ۔ پھر مؤذن آیا تو آپ صلی اللہ علیہ وسلم باہر تشریف لے گئے ۔ آپ صلی اللہ علیہ وسلم نے اس کے بعد ( فجر کی ) نماز پڑھی اور وضو نہیں کیا ۔ عمرو نے بیان کیا میں نے یہ حدیث بکیر بن عبداللہ کے سامنے بیان کی تو انھوں نے فرمایا کہ یہ حدیث مجھ سے کریب نے بھی بیان کی تھی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 184990,
        "last_updated": null
    },
    {
        "urduURN": 4006950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 699,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے اسماعیل بن ابراہیم نے ایوب سختیانی سے بیان کیا ، انہوں نے عبداللہ بن سعید بن جبیر سے ، انہوں نے اپنے باپ سے ، انہوں نے ابن عباس رضی اللہ عنہما سے کہ آپ نے بتلایا کہ",
        "hadithText": "میں نے ایک دفعہ اپنی خالہ میمونہ رضی اللہ عنہا کے گھر رات گذاری ۔ نبی کریم صلی اللہ علیہ وسلم رات میں نماز پڑھنے کے لیے کھڑے ہوئے تو میں بھی آپ صلی اللہ علیہ وسلم کے ساتھ نماز میں شریک ہو گیا ۔ میں ( غلطی سے ) آپ صلی اللہ علیہ وسلم کے بائیں طرف کھڑا ہو گیا تھا ۔ پھر آپ صلی اللہ علیہ وسلم نے میرا سر پکڑ کے دائیں طرف کر دیا ۔ ( تاکہ صحیح طور پر کھڑا ہو جاؤں ) ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 185000,
        "last_updated": null
    },
    {
        "urduURN": 4006960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 700,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا کہ ہم سے شعبہ نے عمرو بن دینار سے بیان کیا ، انہوں نے جابر بن عبداللہ سے کہ",
        "hadithText": "معاذ بن جبل رضی اللہ عنہ ، نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتے پھر واپس آ کر اپنی قوم کی امامت کیا کرتے تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 185010,
        "last_updated": null
    },
    {
        "urduURN": 4006970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 701,
        "hadithSanad": "( دوسری سند ) اور مجھ سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے غندر محمد بن جعفر نے بیان کیا ، کہا کہ ہم سے شعبہ نے عمرو سے بیان کیا ، کہا کہ میں نے جابر بن عبداللہ انصاری سے سنا ، آپ نے فرمایا کہ",
        "hadithText": "معاذ بن جبل رضی اللہ عنہ ، نبی کریم صلی اللہ علیہ وسلم کے ساتھ ( فرض ) نماز پڑھتے پھر واپس جا کر اپنی قوم کے لوگوں کو ( وہی ) نماز پڑھایا کرتے تھے ۔ ایک بار عشاء میں انھوں نے سورۃ البقرہ شروع کی ۔ ( مقتدیوں میں سے ) ایک شخص نماز توڑ کر چل دیا ۔ معاذ رضی اللہ عنہ اس کو برا کہنے لگے ۔ یہ خبر آنحضور صلی اللہ علیہ وسلم کو پہنچی ( اس شخص نے جا کر معاذ کی شکایت کی ) آپ صلی اللہ علیہ وسلم نے معاذ کو فرمایا تو بلا میں ڈالنے والا ہے ، بلا میں ڈالنے والا ، بلا میں ڈالنے والا تین بار فرمایا ۔ یا یوں فرمایا کہ تو فسادی ہے ، فسادی ، فسادی ۔ پھر آپ صلی اللہ علیہ وسلم نے معاذ کو حکم فرمایا کہ مفصل کے بیچ کی دو سورتیں پڑھا کرے ۔ عمرو بن دینار نے کہا کہ مجھے یاد نہ رہیں ( کہ کون سی سورتوں کا آپ نے نام لیا ۔ )</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 185020,
        "last_updated": null
    },
    {
        "urduURN": 4006980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 702,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، کہا کہ ہم سے زہیر بن معاویہ نے بیان کیا ، کہا کہ ہم سے اسماعیل بن ابی خالد نے بیان کیا ، کہا کہ میں نے قیس بن ابی حازم سے سنا ، کہا کہ مجھے ابومسعود انصاری نے خبر دی کہ",
        "hadithText": "ایک شخص نے کہا کہ یا رسول اللہ ! قسم اللہ کی میں صبح کی نماز میں فلاں کی وجہ سے دیر میں جاتا ہوں ، کیونکہ وہ نماز کو بہت لمبا کر دیتے ہیں ، میں نے رسول اللہ صلی اللہ علیہ وسلم کو نصیحت کے وقت اس دن سے زیادہ ( کبھی بھی ) غضب ناک نہیں دیکھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم میں سے کچھ لوگ یہ چاہتے ہیں کہ ( عوام کو عبادت سے یا دین سے ) نفرت دلا دیں ، خبردار تم میں لوگوں کو جو شخص بھی نماز پڑھائے تو ہلکی پڑھائے ۔ کیونکہ نمازیوں میں کمزور ، بوڑھے اور ضرورت والے سب ہی قسم کے لوگ ہوتے ہیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 185030,
        "last_updated": null
    },
    {
        "urduURN": 4006990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 703,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہوں نے کہا کہ ہمیں امام مالک نے ابوالزناد سے خبر دی ، انہوں نے اعرج سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ۔ جب کوئی تم میں سے لوگوں کو نماز پڑھائے تو تخفیف کرے کیونکہ جماعت میں ضعیف بیمار اور بوڑھے ( سب ہی ) ہوتے ہیں ، لیکن اکیلا پڑھے تو جس قدر جی چاہے طول دے سکتا ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 185040,
        "last_updated": null
    },
    {
        "urduURN": 4007000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 704,
        "hadithSanad": "ہم سے محمد بن یوسف فریابی نے بیان کیا ، کہا کہ ہم سے سفیان ثوری نے بیان کیا اسماعیل بن ابی خالد سے ، انہوں نے قیس بن ابی حازم سے ، انہوں نے ابومسعود انصاری رضی اللہ عنہ سے ، آپ نے فرمایا کہ",
        "hadithText": "ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم سے کہا کہ یا رسول اللہ ! میں فجر کی نماز میں تاخیر کر کے اس لیے شریک ہوتا ہوں کہ فلاں صاحب فجر کی نماز بہت طویل کر دیتے ہیں ۔ اس پر آپ صلی اللہ علیہ وسلم اس قدر غصہ ہوئے کہ میں نے نصیحت کے وقت اس دن سے زیادہ غضب ناک آپ صلی اللہ علیہ وسلم کو کبھی نہیں دیکھا ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا لوگو ! تم میں بعض لوگ ( نماز سے لوگوں کو ) دور کرنے کا باعث ہیں ۔ پس جو شخص امام ہو اسے ہلکی نماز پڑھنی چاہئے اس لیے کہ اس کے پیچھے کمزور ، بوڑھے اور ضرورت والے سب ہی ہوتے ہیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 185050,
        "last_updated": null
    },
    {
        "urduURN": 4007010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 705,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ ہم سے محارب بن دثار نے بیان کیا ، کہا کہ میں نے جابر بن عبداللہ انصاری سے سنا ، آپ نے بتلایا کہ",
        "hadithText": "ایک شخص پانی اٹھانے والا دو اونٹ لئے ہوئے آیا ، رات تاریک ہو چکی تھی ۔ اس نے معاذ رضی اللہ عنہ کو نماز پڑھاتے ہوئے پایا ۔ اس لیے اپنے اونٹوں کو بٹھا کر ( نماز میں شریک ہونے کے لیے ) معاذ رضی اللہ عنہ کی طرف بڑھا ۔ معاذ رضی اللہ عنہ نے نماز میں سورۃ البقرہ یا سورۃ نساء شروع کی ۔ چنانچہ وہ شخص نیت توڑ کر چل دیا ۔ پھر اسے معلوم ہوا کہ معاذ رضی اللہ عنہ نے مجھ کو برا بھلا کہا ہے ۔ اس لیے وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور معاذ کی شکایت کی ، نبی کریم صلی اللہ علیہ وسلم نے اس سے فرمایا ، معاذ ! کیا تم لوگوں کو فتنہ میں ڈالتے ہو ۔ آپ صلی اللہ علیہ وسلم نے تین مرتبہ ( «فتان» یا «فاتن» ) فرمایا : «سبح اسم ربك ،‏‏‏‏ ‏‏‏‏ والشمس وضحاها ،‏‏‏‏ ‏‏‏‏ والليل إذا يغشى» ( سورتیں ) تم نے کیوں نہ پڑھیں ، کیونکہ تمہارے پیچھے بوڑھے ، کمزور اور حاجت مند نماز پڑھتے ہیں ۔ شعبہ نے کہا کہ میرا خیال ہے کہ یہ آخری جملہ ( کیونکہ تمہارے پیچھے الخ ) حدیث میں داخل ہے ۔ شعبہ کے ساتھ اس کی متابعت سعید بن مسروق ، مسعر اور شیبانی نے کی ہے اور عمرو بن دینار ، عبیداللہ بن مقسم اور ابوالزبیر نے بھی اس حدیث کو جابر کے واسطہ سے بیان کیا ہے کہ معاذ نے عشاء میں سورۃ البقرہ پڑھی تھی اور شعبہ کے ساتھ اس روایت کی متابعت اعمش نے محارب کے واسطہ سے کی ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 185060,
        "last_updated": null
    },
    {
        "urduURN": 4007020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 706,
        "hadithSanad": "ہم سے ابومعمر عبداللہ بن عمرو نے بیان کیا ، کہا کہ ہم سے عبدالوارث بن سعید نے بیان کیا ، کہا کہ ہم سے عبدالعزیز بن صہیب نے انس بن مالک رضی اللہ عنہ سے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نماز کو مختصر اور پوری پڑھتے تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 185070,
        "last_updated": null
    },
    {
        "urduURN": 4007030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 707,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا کہ ہم سے ولید بن مسلم نے بیان کیا ، کہا کہ ہم سے امام عبدالرحمٰن بن عمرو اوزاعی نے یحییٰ بن ابی کثیر سے بیان کیا ، انہوں نے عبداللہ بن ابی قتادہ سے ، انہوں نے اپنے باپ ابوقتادہ حارث بن ربعی سے ، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نماز دیر تک پڑھنے کے ارادہ سے کھڑا ہوتا ہوں ۔ لیکن کسی بچے کے رونے کی آواز سن کر نماز کو ہلکی کر دیتا ہوں ، کیونکہ اس کی ماں کو ( جو نماز میں شریک ہو گی ) تکلیف میں ڈالنا برا سمجھتا ہوں ۔ ولید بن مسلم کے ساتھ اس روایت کی متابعت بشر بن بکر ، بقیہ بن ولید اور ابن مبارک نے اوزاعی کے واسطہ سے کی ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 185080,
        "last_updated": null
    },
    {
        "urduURN": 4007040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 708,
        "hadithSanad": "ہم سے خالد بن مخلد نے بیان کیا ، کہا کہ ہم سے سلیمان بن بلال نے بیان کیا ، کہا کہ ہم سے شریک بن عبداللہ بن ابی نمر قریشی نے بیان کیا ، کہا کہ میں نے انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بتلایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم سے زیادہ ہلکی لیکن کامل نماز میں نے کسی امام کے پیچھے کبھی نہیں پڑھی ۔ آپ صلی اللہ علیہ وسلم کا یہ حال تھا کہ اگر آپ صلی اللہ علیہ وسلم بچے کے رونے کی آواز سن لیتے تو اس خیال سے کہ اس کی ماں کہیں پریشانی میں نہ مبتلا ہو جائے نماز مختصر کر دیتے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 185090,
        "last_updated": null
    },
    {
        "urduURN": 4007050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 709,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا کہ ہم سے یزید بن زریع نے بیان کیا ، کہا کہ ہم سے سعید بن ابی عروبہ نے بیان کیا ۔ کہا کہ ہم سے قتادہ نے بیان کیا کہ انس بن مالک رضی اللہ عنہ نے ان سے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میں نماز شروع کر دیتا ہوں ۔ ارادہ یہ ہوتا ہے کہ نماز طویل کروں ، لیکن بچے کے رونے کی آواز سن کر مختصر کر دیتا ہوں کیونکہ مجھے معلوم ہے کہ ماں کے دل پر بچے کے رونے سے کیسی چوٹ پڑتی ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 185100,
        "last_updated": null
    },
    {
        "urduURN": 4007060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 710,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہمیں محمد بن ابراہیم بن عدی نے سعید بن ابی عروبہ کے واسطہ سے خبر دی ، انہوں نے قتادہ سے ، انہوں نے انس بن مالک رضی اللہ عنہ سے ، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نماز کی نیت باندھتا ہوں ، ارادہ یہ ہوتا ہے کہ نماز کو طویل کروں گا ، لیکن بچے کے رونے کی آواز سن کر مختصر کر دیتا ہوں کیونکہ میں اس درد کو سمجھتا ہوں جو بچے کے رونے کی وجہ سے ماں کو ہو جاتا ہے ۔ اور موسیٰ بن اسماعیل نے کہا ہم سے ابان بن یزید نے بیان کیا ، کہا ہم سے قتادہ نے ، کہا ہم سے انس نے آنحضرت صلی اللہ علیہ وسلم سے یہی حدیث بیان کی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 185111,
        "last_updated": null
    },
    {
        "urduURN": 4007070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 711,
        "hadithSanad": "ہم سے سلیمان بن حرب اور ابوالنعمان محمد بن فضل نے بیان کیا ، انہوں نے کہا کہ ہم سے حماد بن زید نے بیان کیا ، انہوں نے ایوب سختیانی سے ، انہوں نے عمرو بن دینار سے ، انہوں نے جابر رضی اللہ عنہ سے فرمایا کہ",
        "hadithText": "معاذ رضی اللہ عنہ ، نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتے پھر واپس آ کر اپنی قوم کو نماز پڑھاتے تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 185130,
        "last_updated": null
    },
    {
        "urduURN": 4007080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 712,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے عبداللہ بن داؤد نے بیان کیا ، کہا کہ ہم سے اعمش نے ابراہیم نخعی سے بیان کیا ، انہوں نے اسود سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے کہ",
        "hadithText": "آپ نے بتلایا کہ نبی کریم صلی اللہ علیہ وسلم کے مرض الوفات میں حضرت بلال رضی اللہ عنہ نماز کی اطلاع دینے کے لیے حاضر خدمت ہوئے ۔ آپ نے فرمایا کہ ابوبکر سے نماز پڑھانے کے لیے کہو ۔ میں نے عرض کیا کہ ابوبکر کچے دل کے آدمی ہیں اگر آپ کی جگہ کھڑے ہوں گے تو رو دیں گے اور قرآت نہ کر سکیں گے ۔ آپ نے فرمایا کہ ابوبکر سے کہو وہ نماز پڑھائیں ۔ میں نے وہی عذر پھر دہرایا ۔ پھر آپ نے تیسری یا چوتھی مرتبہ فرمایا کہ تم لوگ تو بالکل صواحب یوسف کی طرح ہو ۔ ابوبکر سے کہو کہ وہ نماز پڑھائیں ۔ خیر ابوبکر رضی اللہ عنہ نے نماز شروع کرا دی ۔ پھر نبی کریم صلی اللہ علیہ وسلم ( اپنا مزاج ذرا ہلکا پا کر ) دو آدمیوں کا سہارا لیے ہوئے باہر تشریف لائے ۔ گویا میری نظروں کے سامنے وہ منظر ہے کہ آپ کے قدم زمین پر نشان کر رہے تھے ۔ ابوبکر آپ کو دیکھ کر پیچھے ہٹنے لگے ۔ لیکن آپ نے اشارہ سے انہیں نماز پڑھانے کے لیے کہا ۔ ابوبکر پیچھے ہٹ گئے اور نبی کریم صلی اللہ علیہ وسلم ان کے بازو میں بیٹھے ۔ حضرت ابوبکر رضی اللہ عنہ لوگوں کو نبی کریم صلی اللہ علیہ وسلم کی تکبیر سنا رہے تھے ۔ عبداللہ بن داؤد کے ساتھ اس حدیث کو محاضر نے بھی اعمش سے روایت کیا ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 185140,
        "last_updated": null
    },
    {
        "urduURN": 4007090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 713,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا کہ ہم سے ابومعاویہ محمد بن حازم نے بیان کیا ، انہوں نے اعمش کے واسطے سے بیان کیا ، انہوں نے ابراہیم نخعی سے ، انہوں نے اسود سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے ۔ آپ نے بتلایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم زیادہ بیمار ہو گئے تھے تو بلال رضی اللہ عنہ آپ صلی اللہ علیہ وسلم کو نماز کی خبر دینے آئے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ابوبکر سے نماز پڑھانے کے لیے کہو ۔ میں نے کہا کہ یا رسول اللہ ! ابوبکر ایک نرم دل آدمی ہیں اور جب بھی وہ آپ کی جگہ کھڑے ہوں گے لوگوں کو ( شدت گریہ کی وجہ سے ) آواز نہیں سنا سکیں گے ۔ اس لیے اگر عمر رضی اللہ عنہ سے کہتے تو بہتر تھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ابوبکر سے نماز پڑھانے کے لیے کہو ۔ پھر میں نے حفصہ رضی اللہ عنہا سے کہا کہ تم کہو کہ ابوبکر نرم دل آدمی ہیں اور اگر آپ کی جگہ کھڑے ہوئے تو لوگوں کو اپنی آواز نہیں سنا سکیں گے ۔ اس لیے اگر عمر سے کہیں تو بہتر ہو گا ۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم لوگ صواحب یوسف سے کم نہیں ہو ۔ ابوبکر سے کہو کہ نماز پڑھائیں ۔ جب ابوبکر رضی اللہ عنہ نماز پڑھانے لگے تو آنحضور صلی اللہ علیہ وسلم نے اپنے مرض میں کچھ ہلکا پن محسوس فرمایا اور دو آدمیوں کا سہارا لے کر کھڑے ہو گئے ۔ آپ صلی اللہ علیہ وسلم کے پاؤں زمین پر نشان کر رہے تھے ۔ اس طرح چل کر آپ صلی اللہ علیہ وسلم مسجد میں داخل ہوئے ۔ جب ابوبکر نے آپ صلی اللہ علیہ وسلم کی آہٹ پائی تو پیچھے ہٹنے لگے اس لیے رسول اللہ صلی اللہ علیہ وسلم نے اشارہ سے روکا پھر نبی کریم صلی اللہ علیہ وسلم ابوبکر رضی اللہ عنہ کے بائیں طرف بیٹھ گئے تو ابوبکر کھڑے ہو کر نماز پڑھ رہے تھے ۔ اور رسول اللہ صلی اللہ علیہ وسلم بیٹھ کر ۔ ابوبکر رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کی اقتداء کر رہے تھے اور لوگ ابوبکر رضی اللہ عنہ کی اقتداء ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 185150,
        "last_updated": null
    },
    {
        "urduURN": 4007100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 714,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، انہوں نے حضرت امام مالک بن انس سے بیان کیا ، انہوں نے ایوب بن ابی تمیمہ سختیانی سے ، انہوں نے محمد بن سیرین سے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ( ظہر کی نماز میں ) دو رکعت پڑھ کر نماز ختم کر دی تو آپ صلی اللہ علیہ وسلم سے ذوالیدین نے کہا کہ یا رسول اللہ ! کیا نماز کم ہو گئی ہے یا آپ بھول گئے ہیں ؟ اس پر آپ صلی اللہ علیہ وسلم نے ( اور لوگوں کی طرف دیکھ کر ) پوچھا کیا ذوالیدین صحیح کہتے ہیں ؟ لوگوں نے کہا کہ ہاں ! پھر آپ صلی اللہ علیہ وسلم اٹھے اور دوسری دو رکعتیں بھی پڑھیں ۔ پھر سلام پھیرا ۔ پھر تکبیر کہی اور سجدہ کیا پہلے کی طرح یا اس سے کچھ لمبا سجدہ ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 185160,
        "last_updated": null
    },
    {
        "urduURN": 4007110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 715,
        "hadithSanad": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا ، کہا کہ ہم سے شعبہ نے سعد بن ابراہیم سے بیان کیا ، وہ ابوسلمہ بن عبدالرحمٰن سے ، وہ حضرت ابوہریرہ رضی اللہ عنہ سے ، آپ نے بتلایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ( ایک مرتبہ ) ظہر کی صرف دو ہی رکعتیں پڑھیں ( اور بھول سے سلام پھیر دیا ) پھر کہا گیا کہ آپ نے صرف دو ہی رکعتیں پڑھی ہیں ۔ پس آپ صلی اللہ علیہ وسلم نے دو رکعتیں اور پڑھیں پھر سلام پھیرا ۔ پھر دو سجدے کئے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 185170,
        "last_updated": null
    },
    {
        "urduURN": 4007120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 716,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ ہم سے امام مالک بن انس نے ہشام بن عروہ سے بیان کیا ، انہوں نے اپنے باپ سے ، انہوں نے ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے مرض الوفات میں فرمایا کہ ابوبکر سے لوگوں کو نماز پڑھانے کے لیے کہو ۔ حضرت عائشہ رضی اللہ عنہا کہتی ہیں کہ میں نے عرض کی کہ ابوبکر اگر آپ کی جگہ کھڑے ہوئے تو رونے کی وجہ سے لوگوں کو اپنی آواز نہ سنا سکیں گے ۔ اس لیے آپ عمر رضی اللہ عنہ سے فرمائیے کہ وہ نماز پڑھائیں ۔ آپ نے پھر فرمایا کہ نہیں ابوبکر ہی سے نماز پڑھانے کے لیے کہو ۔ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ میں نے حفصہ رضی اللہ عنہا سے کہا کہ تم بھی تو آنحضرت صلی اللہ علیہ وسلم سے عرض کرو کہ اگر ابوبکر آپ کی جگہ کھڑے ہوئے تو آپ کو یاد کر کے گریہ و زاری کی وجہ سے لوگوں کو قرآن نہ سنا سکیں گے ۔ اس لیے عمر رضی اللہ عنہ سے کہئے کہ وہ نماز پڑھائیں ۔ حضرت حفصہ رضی اللہ عنہا نے بھی کہہ دیا ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ بس چپ رہو ، تم لوگ صواحب یوسف سے کسی طرح کم نہیں ہو ۔ ابوبکر سے کہو کہ وہ نماز پڑھائیں ۔ بعد میں حضرت حفصہ رضی اللہ عنہا نے حضرت عائشہ رضی اللہ عنہا سے کہا ۔ بھلا مجھ کو تم سے کہیں بھلائی ہونی ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 185180,
        "last_updated": null
    },
    {
        "urduURN": 4007130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 717,
        "hadithSanad": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا ، انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا ، انہوں نے کہا کہ مجھ سے عمرو بن مرہ نے بیان کیا ، انہوں نے کہا کہ میں نے سالم بن ابوالجعد سے سنا ، انہوں نے کہا کہ میں نے نعمان بن بشیر رضی اللہ عنہ سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ نماز میں اپنی صفوں کو برابر کر لو ، نہیں تو اللہ تعالیٰ تمہارا منہ الٹ دے گا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 185190,
        "last_updated": null
    },
    {
        "urduURN": 4007140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 718,
        "hadithSanad": "ہم سے ابومعمر نے بیان کیا ، کہا کہ ہم سے عبدالوارث نے عبدالعزیز بن صہیب سے بیان کیا ، انہوں نے حضرت انس رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ صفیں سیدھی کر لو ۔ میں تمہیں اپنی پیٹھ کے پیچھے سے دیکھ رہا ہوں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 113,
        "matchingArabicURN": 185200,
        "last_updated": null
    },
    {
        "urduURN": 4007150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 719,
        "hadithSanad": "ہم سے احمد بن ابی رجاء نے بیان کیا ، انہوں نے کہا کہ ہم سے معاویہ بن عمرو نے بیان کیا ، انہوں نے کہا کہ ہم سے زائدہ بن قدامہ نے بیان کیا ، کہا کہ ہم سے حمید طویل نے بیان کیا ، کہا کہ ہم سے انس بن مالک رضی اللہ عنہ نے بیان کیا ، انہوں نے کہا کہ",
        "hadithText": "نماز کے لیے تکبیر کہی گئی تو رسول اللہ صلی اللہ علیہ وسلم نے اپنا منہ ہماری طرف کیا اور فرمایا کہ اپنی صفیں برابر کر لو اور مل کر کھڑے ہو جاؤ ۔ میں تم کو اپنی پیٹھ کے پیچھے سے بھی دیکھتا رہتا ہوں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 114,
        "matchingArabicURN": 185210,
        "last_updated": null
    },
    {
        "urduURN": 4007160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 720,
        "hadithSanad": "ہم سے ابوعاصم ضحاک بن مخلد نے امام مالک کے واسطہ سے بیان کیا ، انہوں نے سمی سے ، انہوں نے ابوصالح ذکوان سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ڈوبنے والے ، پیٹ کی بیماری میں مرنے والے ، طاعون میں مرنے والے اور دب کر مرنے والے شہید ہیں ۔\nفرمایا کہاگر لوگ جان لیں جو ثواب نماز کے لیے جلدی آنے میں ہے تو ایک دوسرے سے آگے بڑھیں اور اگر عشاء اور صبح کی نماز کے ثواب کو جان لیں تو اس کے لیے ضرور آئیں ۔ خواہ سرین کے بل آنا پڑے اور اگر پہلی صف کے ثواب کو جان لیں تو اس کے لیے قرعہ اندازی کریں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 115,
        "matchingArabicURN": 185221,
        "last_updated": null
    },
    {
        "urduURN": 4007180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 722,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، انہوں نے کہا کہ ہم کو عبدالرزاق نے خبر دی ، انہوں نے کہا کہ ہمیں معمر نے ہمام بن منبہ کے واسطہ سے خبر دی ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ امام اس لیے ہوتا ہے تاکہ اس کی پیروی کی جائے ، اس لیے تم اس سے اختلاف نہ کرو ۔ جب وہ رکوع کرے تو تم بھی رکوع کرو اور جب وہ «سمع الله لمن حمده‏» کہے تو تم «ربنا لك الحمد‏» کہو اور جب وہ سجدہ کرے تو تم بھی سجدہ کرو ۔ اور جب وہ بیٹھ کر نماز پڑھے تو تم سب بھی بیٹھ کر پڑھو اور نماز میں صفیں برابر رکھو ، کیونکہ نماز کا حسن صفوں کے برابر رکھنے میں ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 116,
        "matchingArabicURN": 185240,
        "last_updated": null
    },
    {
        "urduURN": 4007190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 723,
        "hadithSanad": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا ، کہا کہ ہم کو شعبہ نے قتادہ کے واسطہ سے خبر دی ، انہوں نے حضرت انس رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ صفیں برابر رکھو کیونکہ صفوں کا برابر رکھنا نماز کے قائم کرنے میں داخل ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 117,
        "matchingArabicURN": 185250,
        "last_updated": null
    },
    {
        "urduURN": 4007200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 724,
        "hadithSanad": "ہم سے معاذ بن اسد نے بیان کیا ، انہوں نے کہا کہ ہم سے فضل بن موسیٰ نے بیان کیا ، انہوں نے کہا ہم سے سعید بن عبید طائی نے بیان کیا بشیر بن یسار انصاری سے ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے کہ",
        "hadithText": "جب وہ ( بصرہ سے ) مدینہ آئے ، تو آپ سے پوچھا گیا کہ نبی کریم صلی اللہ علیہ وسلم کے عہد مبارک اور ہمارے اس دور میں آپ نے کیا فرق پایا ۔ فرمایا کہ اور تو کوئی بات نہیں صرف لوگ صفیں برابر نہیں کرتے ۔ اور عقبہ بن عبید نے بشیر بن یسار سے یوں روایت کیا کہ انس رضی اللہ عنہ ہمارے پاس مدینہ تشریف لائے ۔ پھر یہی حدیث بیان کی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 118,
        "matchingArabicURN": 185260,
        "last_updated": null
    },
    {
        "urduURN": 4007210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 725,
        "hadithSanad": "ہم سے عمرو بن خالد نے بیان کیا ، کہا کہ ہم سے زہیر بن معاویہ نے حمید سے بیان کیا ، انہوں نے حضرت انس رضی اللہ عنہ سے ، انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا ، صفیں برابر کر لو ۔ میں تمہیں اپنے پیچھے سے بھی دیکھتا رہتا ہوں اور ہم میں سے ہر شخص یہ کرتا کہ ( صف میں ) اپنا کندھا اپنے ساتھی کے کندھے سے اور اپنا قدم ( پاؤں ) اس کے قدم ( پاؤں ) سے ملا دیتا تھا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 119,
        "matchingArabicURN": 185270,
        "last_updated": null
    },
    {
        "urduURN": 4007220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 726,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا کہ ہم سے داؤد بن عبدالرحمٰن نے عمرو بن دینار سے بیان کیا ، انہوں نے ابن عباس رضی اللہ عنہما کے غلام کریب سے انہوں نے حضرت عبداللہ بن عباس رضی اللہ عنہما سے ، ، آپ نے بتلایا کہ",
        "hadithText": "ایک رات میں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ ( آپ کے گھر میں تہجد کی ) نماز پڑھی ۔ میں آپ کے بائیں طرف کھڑا ہو گیا ۔ اس لیے آپ صلی اللہ علیہ وسلم نے پیچھے سے میرا سر پکڑ کر مجھے اپنے دائیں طرف کر دیا ۔ پھر نماز پڑھی اور آپ صلی اللہ علیہ وسلم سو گئے جب مؤذن ( نماز کی اطلاع دینے ) آیا تو آپ صلی اللہ علیہ وسلم نماز پڑھانے کے لیے کھڑے ہوئے اور وضو نہیں کیا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 120,
        "matchingArabicURN": 185280,
        "last_updated": null
    },
    {
        "urduURN": 4007230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 727,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، ان سے سفیان بن عیینہ نے بیان کیا ، وہ اسحٰق بن عبداللہ بن ابی طلحہ سے وہ انس بن مالک رضی اللہ عنہ سے انہوں نے بتلایا کہ",
        "hadithText": "میں نے اور ایک یتیم لڑکے ( ضمیرہ بن ابی ضمیرہ ) نے جو ہمارے گھر میں موجود تھا ، آنحضرت صلی اللہ علیہ وسلم کے پیچھے نماز پڑھی اور میری والدہ ام سلیم ہمارے پیچھے تھیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 121,
        "matchingArabicURN": 185290,
        "last_updated": null
    },
    {
        "urduURN": 4007240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 728,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے ثابت بن یزید نے بیان کیا ، کہا کہ ہم سے عاصم احول نے عامر شعبی سے بیان کیا ، انہوں نے ابن عباس رضی اللہ عنہما سے ، آپ نے بتلایا کہ",
        "hadithText": "میں ایک رات نبی کریم صلی اللہ علیہ وسلم کے بائیں طرف ( آپ صلی اللہ علیہ وسلم کے گھر میں ) نماز ( تہجد ) پڑھنے کے لیے کھڑا ہو گیا ۔ اس لیے آپ صلی اللہ علیہ وسلم نے میرا سر یا بازو پکڑ کر مجھ کو اپنی دائیں طرف کھڑا کر دیا ۔ آپ صلی اللہ علیہ وسلم نے اپنے ہاتھ سے اشارہ کیا تھا کہ پیچھے سے گھوم آؤ ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 122,
        "matchingArabicURN": 185300,
        "last_updated": null
    },
    {
        "urduURN": 4007250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 729,
        "hadithSanad": "ہم سے محمد بن سلام بیکندی نے بیان کیا ، کہا کہ ہم سے عبدہ بن سلیمان نے یحییٰ بن سعید انصاری کے واسطہ سے بیان کیا ، انہوں نے عمرہ بنت عبدالرحمٰن سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے ، آپ نے بتلایا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم رات میں اپنے حجرہ کے اندر ( تہجد کی ) نماز پڑھتے تھے ۔ حجرے کی دیواریں پست تھیں اس لیے لوگوں نے نبی کریم صلی اللہ علیہ وسلم کو دیکھ لیا اور کچھ لوگ آپ صلی اللہ علیہ وسلم کی اقتداء میں نماز کے لیے کھڑے ہو گئے ۔ صبح کے وقت لوگوں نے اس کا ذکر دوسروں سے کیا ۔ پھر جب دوسری رات آپ صلی اللہ علیہ وسلم کھڑے ہوئے تو کچھ لوگ آپ صلی اللہ علیہ وسلم کی اقتداء میں اس رات بھی کھڑے ہو گئے ۔ یہ صورت دو یا تین رات تک رہی ۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم بیٹھ رہے اور نماز کے مقام پر تشریف نہیں لائے ۔ پھر صبح کے وقت لوگوں نے اس کا ذکر کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں ڈرا کہ کہیں رات کی نماز ( تہجد ) تم پر فرض نہ ہو جائے ۔ ( اس خیال سے میں نے یہاں کا آنا ناغہ کر دیا ) ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 123,
        "matchingArabicURN": 185310,
        "last_updated": null
    },
    {
        "urduURN": 4007260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 730,
        "hadithSanad": "ہم سے ابراہیم بن المنذر نے بیان کیا ، کہا کہ ہم سے محمد بن اسماعیل بن ابی فدیک نے بیان کیا ، کہا کہ ہم سے محمد بن عبدالرحمٰن بن ابی ذئب نے بیان کیا ، مقبری کے واسطہ سے ، انہوں نے ابوسلمہ بن عبدالرحمٰن سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے پاس ایک چٹائی تھی ۔ جسے آپ صلی اللہ علیہ وسلم دن میں بچھاتے تھے اور رات میں اس کا پردہ کر لیتے تھے ۔ پھر چند لوگ آپ صلی اللہ علیہ وسلم کے پاس کھڑے ہوئے یا آپ صلی اللہ علیہ وسلم کی طرف جھکے اور آپ صلی اللہ علیہ وسلم کے پیچھے نماز پڑھنے لگے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 124,
        "matchingArabicURN": 185320,
        "last_updated": null
    },
    {
        "urduURN": 4007270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 731,
        "hadithSanad": "ہم سے عبدالاعلیٰ بن حماد نے بیان کیا ، کہا کہ ہم سے وہیب بن خالد نے بیان کیا ، کہا ہم سے موسیٰ بن عقبہ نے بیان کیا ، ابوالنضر سالم سے ، انہوں نے بسر بن سعید سے ، انہوں نے زید بن ثابت رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے رمضان میں ایک حجرہ بنا لیا یا اوٹ ( پردہ ) بسر بن سعید نے کہا میں سمجھتا ہوں وہ بورئیے کا تھا ۔ آپ نے کئی رات اس میں نماز پڑھی ۔ صحابہ میں سے بعض حضرات نے ان راتوں میں آپ کی اقتداء کی ۔ جب آپ کو اس کا علم ہوا تو آپ نے بیٹھ رہنا شروع کیا ( نماز موقوف رکھی ) پھر برآمد ہوئے اور فرمایا تم نے جو کیا وہ مجھ کو معلوم ہے ، لیکن لوگو ! تم اپنے گھروں میں نماز پڑھتے رہو کیونکہ بہتر نماز آدمی کی وہی ہے جو اس کے گھر میں ہو ۔ مگر فرض نماز ( مسجد میں پڑھنی ضروری ہے ) اور عفان بن مسلم نے کہا کہ ہم سے وہیب نے بیان کیا ، کہا کہ ہم سے موسیٰ بن عقبہ نے بیان کیا ، کہا کہ میں نے ابوالنضر ابن ابی امیہ سے سنا ، وہ بسر بن سعید سے روایت کرتے تھے ، وہ زید بن ثابت سے ، وہ نبی کریم صلی اللہ علیہ وسلم سے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 125,
        "matchingArabicURN": 185331,
        "last_updated": null
    },
    {
        "urduURN": 4007280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 732,
        "hadithSanad": "ہم سے ابوالیمان حکم بن نافع نے یہ بیان کیا ، انہوں نے کہا کہ ہم سے شعیب نے زہری کے واسطہ سے بیان کیا ، انہوں نے کہا کہ مجھے انس بن مالک انصاری رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم ایک گھوڑے پر سوار ہوئے اور ( گر جانے کی وجہ سے ) آپ صلی اللہ علیہ وسلم کے دائیں پہلو میں زخم آ گئے ۔ حضرت انس رضی اللہ عنہ نے بتلایا کہ اس دن ہمیں آپ صلی اللہ علیہ وسلم نے ایک نماز پڑھائی ، چونکہ آپ صلی اللہ علیہ وسلم بیٹھے ہوئے تھے ، اس لیے ہم نے بھی آپ صلی اللہ علیہ وسلم کے پیچھے بیٹھ کر نماز پڑھی ۔ پھر سلام کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا کہ امام اس لیے ہے کہ اس کی پیروی کی جائے ۔ اس لیے جب وہ کھڑے ہو کر نماز پڑھے تو تم بھی کھڑے ہو کر پڑھو اور جب وہ رکوع کرے تو تم بھی رکوع کرو اور جب وہ سر اٹھائے تو تم بھی اٹھاؤ اور جب وہ سجدہ کرے تو تم بھی کرو اور جب وہ «سمع الله لمن حمده‏» کہے تو تم «ربنا ولك الحمد» کہو ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 126,
        "matchingArabicURN": 185350,
        "last_updated": null
    },
    {
        "urduURN": 4007290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 733,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث بن سعد نے بیان کیا ، انہوں نے ابن شہاب زہری سے بیان کیا ، انہوں نے انس بن مالک رضی اللہ عنہ سے ، انہوں نے فرمایا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم گھوڑے سے گر گئے اور آپ صلی اللہ علیہ وسلم زخمی ہو گئے ، اس لیے آپ صلی اللہ علیہ وسلم نے بیٹھ کر نماز پڑھی اور ہم نے بھی آپ صلی اللہ علیہ وسلم کی اقتداء میں بیٹھ کر نماز پڑھی ۔ پھر نماز پڑھ کر آپ صلی اللہ علیہ وسلم نے فرمایا کہ امام اس لیے ہے کہ اس کی پیروی کی جائے ۔ اس لیے جب وہ تکبیر کہے تو تم بھی تکبیر کہو ۔ جب وہ رکوع کرے تو تم بھی رکوع کرو ۔ جب وہ سر اٹھائے تو تم بھی اٹھاؤ اور جب وہ «سمع الله لمن حمده‏» کہے تو تم «ربنا لك الحمد» اور جب وہ سجدہ کرے تو تم بھی کرو ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 127,
        "matchingArabicURN": 185360,
        "last_updated": null
    },
    {
        "urduURN": 4007300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 734,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا کہ ہمیں شعیب نے خبر دی ، انہوں نے کہا کہ ابوالزناد نے مجھ سے بیان کیا اعرج کے واسطہ سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے انہوں نے کہا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، امام اس لیے ہے کہ اس کی پیروی کی جائے ، اس لیے جب وہ تکبیر کہے تو تم بھی تکبیر کہو ۔ جب وہ رکوع کرے تو تم بھی رکوع کرو اور جب وہ «سمع الله لمن حمده‏» کہے تو تم «ربنا ولك الحمد» اور جب وہ سجدہ کرے تو تم بھی سجدہ کرو اور جب وہ بیٹھ کر نماز پڑھے تو تم سب بھی بیٹھ کر نماز پڑھو ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 128,
        "matchingArabicURN": 185370,
        "last_updated": null
    },
    {
        "urduURN": 4007310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 736,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا کہ ہم کو عبداللہ بن مبارک نے خبر دی ، کہا کہ ہم کو یونس بن یزید ایلی نے زہری سے خبر دی ، انہوں نے کہا کہ مجھے سالم بن عبداللہ بن عمر رضی اللہ عنہما نے عبداللہ بن عمر رضی اللہ عنہما سے خبر دی ، انہوں نے بتلایا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ",
        "hadithText": "جب آپ صلی اللہ علیہ وسلم نماز کے لیے کھڑے ہوئے تو تکبیر تحریمہ کے وقت آپ صلی اللہ علیہ وسلم نے رفع یدین کیا ۔ آپ صلی اللہ علیہ وسلم کے دونوں ہاتھ اس وقت مونڈھوں ( کندھوں ) تک اٹھے اور اسی طرح جب آپ صلی اللہ علیہ وسلم رکوع کے لیے تکبیر کہتے اس وقت بھی ( رفع یدین ) کرتے ۔ اس وقت آپ صلی اللہ علیہ وسلم کہتے «سمع الله لمن حمده» البتہ سجدہ میں آپ رفع یدین نہیں کرتے تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 130,
        "matchingArabicURN": 185390,
        "last_updated": null
    },
    {
        "urduURN": 4007320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 737,
        "hadithSanad": "ہم سے اسحاق بن شاہین واسطی نے بیان کیا ، کہا کہ ہم سے خالد بن عبداللہ طحان نے بیان کیا خالد حذاء سے ، انہوں نے ابوقلابہ سے کہ انہوں نے مالک بن حویرث صحابی کو دیکھا کہ",
        "hadithText": "جب وہ نماز شروع کرتے تو تکبیر تحریمہ کے ساتھ رفع یدین کرتے ، پھر جب رکوع میں جاتے اس وقت بھی رفع یدین کرتے اور جب رکوع سے سر اٹھاتے تب بھی کرتے اور انھوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم بھی اسی طرح کیا کرتے تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 131,
        "matchingArabicURN": 185400,
        "last_updated": null
    },
    {
        "urduURN": 4007330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 738,
        "hadithSanad": "ہم سے ابوالیمان حکم بن نافع نے بیان کیا ، انہوں نے کہا کہ ہمیں شعیب نے زہری سے خبر دی ، انہوں نے کہا کہ مجھے سالم بن عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو دیکھا کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نماز تکبیر تحریمہ سے شروع کرتے اور تکبیر کہتے وقت اپنے دونوں ہاتھوں کو کندھوں تک اٹھا کر لے جاتے اور جب رکوع کے لیے تکبیر کہتے تب بھی اسی طرح کرتے اور جب «سمع الله لمن حمده» کہتے تب بھی اسی طرح کرتے اور «ربنا ولك الحمد» کہتے ۔ سجدہ کرتے وقت یا سجدے سے سر اٹھاتے وقت اس طرح رفع یدین نہیں کرتے تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 132,
        "matchingArabicURN": 185410,
        "last_updated": null
    },
    {
        "urduURN": 4007340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 739,
        "hadithSanad": "ہم سے عیاش بن ولید نے بیان کیا ، کہا کہ ہم سے عبدالاعلیٰ بن عبدالاعلی نے بیان کیا ، کہا کہ ہم سے عبیداللہ عمری نے نافع سے بیان کیا کہ",
        "hadithText": "عبداللہ بن عمر رضی اللہ عنہما جب نماز میں داخل ہوتے تو پہلے تکبیر تحریمہ کہتے اور ساتھ ہی رفع یدین کرتے ۔ اسی طرح جب وہ رکوع کرتے تب اور جب «سمع الله لمن حمده» کہتے تب بھی ( رفع یدین کرتے ) دونوں ہاتھوں کو اٹھاتے اور جب قعدہ اولیٰ سے اٹھتے تب بھی رفع یدین کرتے ۔ آپ نے اس فعل کو نبی کریم صلی اللہ علیہ وسلم تک پہنچایا ۔ ( کہ آنحضرت صلی اللہ علیہ وسلم اسی طرح نماز پڑھا کرتے تھے ۔ )</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 133,
        "matchingArabicURN": 185420,
        "last_updated": null
    },
    {
        "urduURN": 4007350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 740,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا امام مالک رحمہ اللہ سے ، انہوں نے ابوحازم بن دینار سے ، انہوں نے سہل بن سعد رضی اللہ عنہ سے کہ",
        "hadithText": "لوگوں کو حکم دیا جاتا تھا کہ نماز میں دایاں ہاتھ بائیں کلائی پر رکھیں ، ابوحازم بن دینار نے بیان کیا کہ مجھے اچھی طرح یاد ہے کہ آپ اسے رسول اللہ صلی اللہ علیہ وسلم تک پہنچاتے تھے ۔ اسماعیل بن ابی اویس نے کہا کہ یہ بات آنحضرت صلی اللہ علیہ وسلم تک پہنچائی جاتی تھی یوں نہیں کہا کہ پہنچاتے تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 134,
        "matchingArabicURN": 185430,
        "last_updated": null
    },
    {
        "urduURN": 4007360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 741,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک رحمہ اللہ نے ابوالزناد سے بیان کیا ، انھوں نے اعرج سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ، کیا تم سمجھتے ہو کہ میرا منہ ادھر ( قبلہ کی طرف ) ہے ۔ خدا کی قسم تمہارا رکوع اور تمہارا خشوع مجھ سے کچھ چھپا ہوا نہیں ہے ، میں تمہیں اپنے پیچھے سے بھی دیکھتا رہتا ہوں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 135,
        "matchingArabicURN": 185440,
        "last_updated": null
    },
    {
        "urduURN": 4007370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 742,
        "hadithSanad": "ہم سے محمد بشار نے بیان کیا ، انھوں نے کہا کہ ہم سے غندر نے بیان کیا ، انھوں نے کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ میں نے قتادہ سے سنا ، وہ انس بن مالک رضی اللہ عنہ سے بیان کرتے تھے اور وہ نبی کریم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا رکوع اور سجود پوری طرح کیا کرو ۔ خدا کی قسم ! میں تمہیں اپنے پیچھے سے بھی دیکھتا رہتا ہوں یا اس طرح کہا کہ پیٹھ پیچھے سے جب تم رکوع کرتے ہو اور سجدہ کرتے ہو ( تو میں تمہیں دیکھتا ہوں ) ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 136,
        "matchingArabicURN": 185450,
        "last_updated": null
    },
    {
        "urduURN": 4007380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 743,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، انھوں نے کہا کہ ہم سے شعبہ نے قتادہ رضی اللہ عنہ کے واسطے سے بیان کیا ، انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم اور ابوبکر اور عمر رضی اللہ عنہما نماز «الحمد لله رب العالمين‏» سے شروع کرتے تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 137,
        "matchingArabicURN": 185460,
        "last_updated": null
    },
    {
        "urduURN": 4007390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 744,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انھوں نے کہا کہ ہم سے عبدالواحد بن زیاد نے بیان کیا ، انھوں نے کہا کہ ہم سے عمارہ بن قعقاع نے بیان کیا ، انھوں نے کہا کہ ہم سے ابوزرعہ نے بیان کیا ، انھوں نے کہا کہ ہم سے ابوہریرہ رضی اللہ عنہ نے بیان کیا ، انھوں نے فرمایا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم تکبیر تحریمہ اور قرآت کے درمیان تھوڑی دیر چپ رہتے تھے ۔ ابوزرعہ نے کہا میں سمجھتا ہوں ابوہریرہ رضی اللہ عنہ نے یوں کہا یا رسول اللہ ! آپ پر میرے ماں باپ فدا ہوں ۔ آپ اس تکبیر اور قرآت کے درمیان کی خاموشی کے بیچ میں کیا پڑھتے ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں پڑھتا ہوں «اللهم باعد بيني وبين خطاياى كما باعدت بين المشرق والمغرب ،‏‏‏‏ ‏‏‏‏ اللهم نقني من الخطايا كما ينقى الثوب الأبيض من الدنس ،‏‏‏‏ ‏‏‏‏ اللهم اغسل خطاياى بالماء والثلج والبرد» اے اللہ ! میرے اور میرے گناہوں کے درمیان اتنی دوری کر جتنی مشرق اور مغرب میں ہے ۔ اے اللہ ! مجھے گناہوں سے اس طرح پاک کر جیسے سفید کپڑا میل سے پاک ہوتا ہے ۔ اے اللہ ! میرے گناہوں کو پانی ، برف اور اولے سے دھو ڈال ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 138,
        "matchingArabicURN": 185470,
        "last_updated": null
    },
    {
        "urduURN": 4007400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 745,
        "hadithSanad": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا کہ ہمیں نافع بن عمر نے خبر دی ، کہا کہ مجھ سے ابن ابی ملیکہ نے اسماء بنت ابی بکر سے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے سورج گہن کی نماز پڑھی ۔ آپ صلی اللہ علیہ وسلم جب کھڑے ہوئے تو دیر تک کھڑے رہے پھر رکوع میں گئے تو دیر تک رکوع میں رہے ۔ پھر رکوع سے سر اٹھایا تو دیر تک کھڑے ہی رہے ۔ پھر ( دوبارہ ) رکوع میں گئے اور دیر تک رکوع کی حالت میں رہے اور پھر سر اٹھایا ، پھر سجدہ کیا اور دیر تک سجدہ میں رہے ۔ پھر سر اٹھایا اور پھر سجدہ کیا اور دیر تک سجدہ میں رہے پھر کھڑے ہوئے اور دیر تک کھڑے ہی رہے ۔ پھر رکوع کیا اور دیر تک رکوع میں رہے ۔ پھر آپ صلی اللہ علیہ وسلم نے سر اٹھایا اور دیر تک کھڑے رہے ۔ پھر ( دوبارہ ) رکوع کیا اور آپ صلی اللہ علیہ وسلم دیر تک رکوع کی حالت میں رہے ۔ پھر سر اٹھایا ۔ پھر آپ صلی اللہ علیہ وسلم سجدہ میں چلے گئے اور دیر تک سجدہ میں رہے ۔ جب نماز سے فارغ ہوئے تو فرمایا کہ جنت مجھ سے اتنی نزدیک ہو گئی تھی کہ اگر میں چاہتا تو اس کے خوشوں میں سے کوئی خوشہ تم کو توڑ کر لا دیتا اور مجھ سے دوزخ بھی اتنی قریب ہو گئی تھی کہ میں بول پڑا کہ میرے مالک میں تو اس میں سے نہیں ہوں ؟ میں نے وہاں ایک عورت کو دیکھا ۔ نافع بیان کرتے ہیں کہ مجھے خیال ہے کہ ابن ابی ملیکہ نے بتلایا کہ اس عورت کو ایک بلی نوچ رہی تھی ، میں نے پوچھا کہ اس کی کیا وجہ ہے ؟ جواب ملا کہ اس عورت نے اس بلی کو باندھے رکھا تھا تاآنکہ بھوک کی وجہ سے وہ مر گئی ، نہ تو اس نے اسے کھانا دیا اور نہ چھوڑا کہ وہ خود کہیں سے کھا لیتی ۔ نافع نے بیان کیا کہ میرا خیال ہے کہ ابن ابی ملیکہ نے یوں کہا کہ نہ چھوڑا کہ وہ زمین کے کیڑے وغیرہ کھا لیتی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 139,
        "matchingArabicURN": 185480,
        "last_updated": null
    },
    {
        "urduURN": 4007410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 746,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے عبدالواحد نے بیان کیا ، کہا کہ ہم سے اعمش نے عمارہ بن عمیر سے بیان کیا ، انھوں نے ( عبداللہ بن مخبرہ ) ابومعمر سے ، انھوں نے بیان کیا کہ ہم نے خباب بن ارت رضی اللہ عنہ صحابی سے پوچھا",
        "hadithText": "کیا رسول اللہ صلی اللہ علیہ وسلم ظہر اور عصر کی رکعتوں میں ( فاتحہ کے سوا ) اور کچھ قرآت کرتے تھے ؟ انھوں نے فرمایا کہ ہاں ۔ ہم نے عرض کی کہ آپ لوگ یہ بات کس طرح سمجھ جاتے تھے ۔ فرمایا کہ آپ صلی اللہ علیہ وسلم کی داڑھی مبارک کے ہلنے سے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 140,
        "matchingArabicURN": 185490,
        "last_updated": null
    },
    {
        "urduURN": 4007420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 747,
        "hadithSanad": "ہم سے حجاج بن منہال نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ ہمیں ابواسحاق عمرو بن عبداللہ سبیعی نے خبر دی ، کہا کہ میں نے عبداللہ بن یزید رضی اللہ عنہ سے سنا کہ آپ خطبہ دے رہے تھے ۔ آپ نے بیان کیا کہ ہم سے براء بن عازب رضی اللہ عنہ نے بیان کیا اور وہ جھوٹے نہیں تھے کہ",
        "hadithText": "جب وہ ( صحابہ ) نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتے تو آنحضرت صلی اللہ علیہ وسلم کے رکوع سے سر اٹھانے کے بعد اس وقت تک کھڑے رہتے جب تک دیکھتے کہ آپ صلی اللہ علیہ وسلم سجدہ میں چلے گئے ہیں ( اس وقت وہ بھی سجدے میں جاتے ) ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 141,
        "matchingArabicURN": 185500,
        "last_updated": null
    },
    {
        "urduURN": 4007430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 748,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، انھوں نے کہا کہ مجھے امام مالک نے زید بن اسلم سے بیان کیا ، انھوں نے عطاء بن یسار سے ، انھوں نے عبداللہ بن عباس رضی اللہ عنہما سے ، انھوں نے فرمایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے عہد میں سورج گہن ہوا تو آپ صلی اللہ علیہ وسلم نے گہن کی نماز پڑھی ۔ لوگوں نے پوچھا کہ یا رسول اللہ ! ہم نے دیکھا کہ ( نماز میں ) آپ صلی اللہ علیہ وسلم اپنی جگہ سے کچھ لینے کو آگے بڑھے تھے پھر ہم نے دیکھا کہ کچھ پیچھے ہٹے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے جنت دیکھی تو اس میں سے ایک خوشہ لینا چاہا اور اگر میں لے لیتا تو اس وقت تک تم اسے کھاتے رہتے جب تک دنیا موجود ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 142,
        "matchingArabicURN": 185510,
        "last_updated": null
    },
    {
        "urduURN": 4007440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 749,
        "hadithSanad": "ہم سے محمد بن سنان نے بیان کیا ، انھوں نے کہا کہ ہم سے فلیح بن سلیمان نے بیان کیا ، انھوں نے کہا کہ ہم سے ہلال بن علی نے بیان کیا انس بن مالک رضی اللہ عنہ سے ۔ آپ نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ہم کو نماز پڑھائی ۔ پھر منبر پر تشریف لائے اور اپنے ہاتھ سے قبلہ کی طرف اشارہ کر کے فرمایا کہ ابھی جب میں نماز پڑھا رہا تھا تو جنت اور دوزخ کو اس دیوار پر دیکھا ۔ اس کی تصویریں اس دیوار میں قبلہ کی طرف نمودار ہوئیں تو میں نے آج کی طرح خیر اور شر کبھی نہیں دیکھی ۔ آپ صلی اللہ علیہ وسلم نے قول مذکور تین بار فرمایا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 143,
        "matchingArabicURN": 185520,
        "last_updated": null
    },
    {
        "urduURN": 4007450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 750,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، انھوں نے کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا ، انھوں نے کہا کہ ہم سے سعید بن مہران ابن ابی عروبہ نے بیان کیا ، انھوں نے کہا کہ ہم سے قتادہ نے بیان کیا کہ انس بن مالک رضی اللہ عنہ نے ان سے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ لوگوں کا کیا حال ہے جو نماز میں اپنی نظریں آسمان کی طرف اٹھاتے ہیں ۔ آپ صلی اللہ علیہ وسلم نے اس سے نہایت سختی سے روکا ۔ یہاں تک آپ صلی اللہ علیہ وسلم نے فرمایا کہ لوگ اس حرکت سے باز آ جائیں ورنہ ان کی بینائی اچک لی جائے گی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 144,
        "matchingArabicURN": 185530,
        "last_updated": null
    },
    {
        "urduURN": 4007460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 751,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے ابوالاحوص سلام بن سلیم نے بیان کیا ، کہا کہ ہم سے اشعت بن سلیم نے بیان کیا اپنے والد کے واسطے سے ، انھوں نے مسروق بن اجدع سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے آپ نے بتلایا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے نماز میں ادھر ادھر دیکھنے کے بارے میں پوچھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ تو ڈاکہ ہے جو شیطان بندے کی نماز پر ڈالتا ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 145,
        "matchingArabicURN": 185540,
        "last_updated": null
    },
    {
        "urduURN": 4007470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 752,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے زہری سے بیان کیا ، انھوں نے عروہ سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک دھاری دار چادر میں نماز پڑھی ۔ پھر فرمایا کہ اس کے نقش و نگار نے مجھے غافل کر دیا ۔ اسے لے جا کر ابوجہم کو واپس کر دو اور ان سے ( بجائے اس کے ) سادی چادر مانگ لاؤ ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 146,
        "matchingArabicURN": 185550,
        "last_updated": null
    },
    {
        "urduURN": 4007480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 753,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انھوں نے کہا کہ ہم سے لیث بن سعد نے نافع سے بیان کیا ، انھوں نے ابن عمر رضی اللہ عنہما سے آپ نے بتلایا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے مسجد میں قبلہ کی دیوار پر رینٹ دیکھی ۔ آپ صلی اللہ علیہ وسلم اس وقت لوگوں کو نماز پڑھا رہے تھے ۔ آپ صلی اللہ علیہ وسلم نے ( نماز ہی میں ) رینٹ کو کھرچ ڈالا ۔ پھر نماز سے فارغ ہونے کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب کوئی نماز میں ہوتا ہے تو اللہ تعالیٰ اس کے منہ کے سامنے ہوتا ہے ۔ اس لیے کوئی شخص سامنے کی طرف نماز میں نہ تھوکے ۔ اس حدیث کی روایت موسیٰ بن عقبہ اور عبدالعزیز ابن ابی رواد نے نافع سے کی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 147,
        "matchingArabicURN": 185560,
        "last_updated": null
    },
    {
        "urduURN": 4007490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 754,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انھوں نے کہا کہ ہم سے لیث بن سعد نے بیان کیا ، انھوں نے عقیل بن خالد سے بیان کیا ، انھوں نے ابن شہاب سے ، انھوں نے کہا کہ مجھے انس بن مالک رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "( حضور صلی اللہ علیہ وسلم کے مرض وفات میں ) مسلمان فجر کی نماز پڑھ رہے تھے ، اچانک رسول اللہ صلی اللہ علیہ وسلم نے حضرت عائشہ رضی اللہ عنہا کے حجرہ سے پردہ ہٹایا ۔ آپ صلی اللہ علیہ وسلم نے صحابہ کو دیکھا ۔ سب لوگ صفیں باندھے ہوئے تھے ۔ آپ صلی اللہ علیہ وسلم ( خوشی سے ) خوب کھل کر مسکرائے اور ابوبکر رضی اللہ عنہ نے ( آپ صلی اللہ علیہ وسلم کو دیکھ کر ) پیچھے ہٹنا چاہا تاکہ صف میں مل جائیں ۔ آپ نے سمجھا کہ آنحضور صلی اللہ علیہ وسلم تشریف لا رہے ہیں ۔ صحابہ ( آپ صلی اللہ علیہ وسلم کو دیکھ کر خوشی سے اس قدر بےقرار ہوئے کہ گویا ) نماز ہی چھوڑ دیں گے ۔ لیکن آنحضرت صلی اللہ علیہ وسلم نے اشارہ کیا کہ اپنی نماز پوری کر لو اور پردہ ڈال لیا ۔ اسی دن چاشت کو آپ صلی اللہ علیہ وسلم نے وفات پائی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 148,
        "matchingArabicURN": 185570,
        "last_updated": null
    },
    {
        "urduURN": 4007500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 755,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے ابوعوانہ وضاح یشکری نے بیان کیا ، کہا کہ ہم سے عبدالملک بن عمیر نے جابر بن سمرہ رضی اللہ عنہ سے بیان کیا ، کہا کہ",
        "hadithText": "اہل کوفہ نے حضرت سعد بن ابی وقاص رضی اللہ عنہ کی حضرت عمر فاروق رضی اللہ عنہ سے شکایت کی ۔ اس لیے حضرت عمر رضی اللہ عنہ نے ان کو مغزول کر کے حضرت عمار رضی اللہ عنہ کو کوفہ کا حاکم بنایا ، تو کوفہ والوں نے سعد کے متعلق یہاں تک کہہ دیا کہ وہ تو اچھی طرح نماز بھی نہیں پڑھا سکتے ۔ چنانچہ حضرت عمر رضی اللہ عنہ نے ان کو بلا بھیجا ۔ آپ نے ان سے پوچھا کہ اے ابواسحاق ! ان کوفہ والوں کا خیال ہے کہ تم اچھی طرح نماز نہیں پڑھا سکتے ہو ۔ اس پر آپ نے جواب دیا کہ خدا کی قسم میں تو انہیں نبی کریم صلی اللہ علیہ وسلم ہی کی طرح نماز پڑھاتا تھا ، اس میں کوتاہی نہیں کرتا عشاء کی نماز پڑھاتا تو اس کی دو پہلی رکعات میں ( قرآت ) لمبی کرتا اور دوسری دو رکعتیں ہلکی پڑھاتا ۔ حضرت عمر رضی اللہ عنہ نے فرمایا کہ اے ابواسحاق ! مجھ کو تم سے امید بھی یہی تھی ۔ پھر آپ نے حضرت سعد رضی اللہ عنہ کے ساتھ ایک یا کئی آدمیوں کو کوفہ بھیجا ۔ قاصد نے ہر ہر مسجد میں جا کر ان کے متعلق پوچھا ۔ سب نے آپ کی تعریف کی لیکن جب مسجد بنی عبس میں گئے ۔ تو ایک شخص جس کا نام اسامہ بن قتادہ اور کنیت ابوسعدہ تھی کھڑا ہوا ۔ اس نے کہا کہ جب آپ نے خدا کا واسطہ دے کر پوچھا ہے تو ( سنیے کہ ) سعد نہ فوج کے ساتھ خود جہاد کرتے تھے ، نہ مال غنیمت کی تقسیم صحیح کرتے تھے اور نہ فیصلے میں عدل و انصاف کرتے تھے ۔ حضرت سعد رضی اللہ عنہ نے ( یہ سن کر ) فرمایا کہ خدا کی قسم میں ( تمہاری اس بات پر ) تین دعائیں کرتا ہوں ۔ اے اللہ ! اگر تیرا یہ بندہ جھوٹا ہے اور صرف ریا و نمود کے لیے کھڑا ہوا ہے تو اس کی عمردراز کر اور اسے خوب محتاج بنا اور اسے فتنوں میں مبتلا کر ۔ اس کے بعد ( وہ شخص اس درجہ بدحال ہوا کہ ) جب اس سے پوچھا جاتا تو کہتا کہ ایک بوڑھا اور پریشان حال ہوں مجھے سعد رضی اللہ عنہ کی بددعا لگ گئی ۔ عبدالملک نے بیان کیا کہ میں نے اسے دیکھا اس کی بھویں بڑھاپے کی وجہ سے آنکھوں پر آ گئی تھی ۔ لیکن اب بھی راستوں میں وہ لڑکیوں کو چھیڑتا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 149,
        "matchingArabicURN": 185580,
        "last_updated": null
    },
    {
        "urduURN": 4007510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 756,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، انھوں نے کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، کہا کہ ہم سے زہری نے بیان کیا محمود بن ربیع سے ، انھوں نے حضرت عبادہ بن صامت رضی اللہ عنہ سے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، جس شخص نے سورۃ الفاتحہ نہ پڑھی اس کی نماز نہیں ہوئی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 150,
        "matchingArabicURN": 185590,
        "last_updated": null
    },
    {
        "urduURN": 4007520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 757,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے عبیداللہ عمری سے بیان کیا ، کہا کہ مجھ سے سعید بن ابی سعید مقبری نے اپنے باپ ابوسعید مقبری سے بیان کیا ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم مسجد میں تشریف لائے اس کے بعد ایک اور شخص آیا ۔ اس نے نماز پڑھی ، پھر نبی کریم صلی اللہ علیہ وسلم کو سلام کیا ۔ آپ نے سلام کا جواب دے کر فرمایا کہ واپس جاؤ اور پھر نماز پڑھ ، کیونکہ تو نے نماز نہیں پڑھی ۔ وہ شخص واپس گیا اور پہلے کی طرح نماز پڑھی اور پھر آ کر سلام کیا ۔ لیکن آپ نے اس مرتبہ بھی یہی فرمایا کہ واپس جا اور دوبارہ نماز پڑھ ، کیونکہ تو نے نماز نہیں پڑھی ۔ آپ نے اس طرح تین مرتبہ کیا ۔ آخر اس شخص نے کہا کہ اس ذات کی قسم ! جس نے آپ کو حق کے ساتھ مبعوث کیا ہے ۔ میں اس کے علاوہ اور کوئی اچھا طریقہ نہیں جانتا ، اس لیے آپ مجھے نماز سکھا دیجئیے ۔ آپ نے فرمایا کہ جب نماز کے لیے کھڑا ہو تو پہلے تکبیر تحریمہ کہہ ۔ پھر آسانی کے ساتھ جتنا قرآن تجھ کو یاد ہو اس کی تلاوت کر ۔ اس کے بعد رکوع کر ، اچھی طرح سے رکوع ہو لے تو پھر سر اٹھا کر پوری طرح کھڑا ہو جا ۔ اس کے بعد سجدہ کر پورے اطمینان کے ساتھ ۔ پھر سر اٹھا اور اچھی طرح بیٹھ جا ۔ اسی طرح اپنی تمام نماز پوری کر ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 151,
        "matchingArabicURN": 185600,
        "last_updated": null
    },
    {
        "urduURN": 4007530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 758,
        "hadithSanad": "ہم سے ابوالنعمان محمد بن فضل نے بیان کیا ، کہا کہ ہم سے ابوعوانہ وضاح یشکری نے عبدالملک بن عمیر سے بیان کیا ، انھوں نے جابر بن سمرہ سے کہ سعد بن ابی وقاص رضی اللہ عنہ نے حضرت عمر رضی اللہ عنہ سے کہا",
        "hadithText": "میں ان ( کوفہ والوں ) کو نبی کریم صلی اللہ علیہ وسلم کی طرح نماز پڑھاتا تھا ۔ ظہر اور عصر کی دونوں نمازیں ، کسی قسم کا نقص ان میں نہیں چھوڑتا تھا ۔ پہلی دو رکعتیں لمبی پڑھتا اور دوسری دو رکعتیں ہلکی ۔ تو حضرت عمر رضی اللہ عنہ نے فرمایا کہ مجھ کو تم سے امید بھی یہی تھی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 152,
        "matchingArabicURN": 185610,
        "last_updated": null
    },
    {
        "urduURN": 4007540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 759,
        "hadithSanad": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، انھوں نے کہا کہ ہم سے شیبان نے بیان کیا ، انھوں نے یحییٰ بن ابی کثیر سے بیان کیا ، انھوں نے عبداللہ بن ابی قتادہ سے ، انھوں نے اپنے باپ ابوقتادہ رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ظہر کی پہلی دو رکعتوں میں سورۃ الفاتحہ اور ہر رکعت میں ایک ایک سورت پڑھتے تھے ، ان میں بھی قرآت کرتے تھے لیکن آخری دو رکعتیں ہلکی پڑھاتے تھے کبھی کبھی ہم کو بھی کوئی آیت سنا دیا کرتے تھے ۔ عصر میں آپ صلی اللہ علیہ وسلم سورۃ الفاتحہ اور سورتیں پڑھتے تھے ، اس کی بھی پہلی دو رکعتیں لمبی پڑھتے ۔ اسی طرح صبح کی نماز کی پہلی رکعت لمبی کرتے اور دوسری ہلکی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 153,
        "matchingArabicURN": 185620,
        "last_updated": null
    },
    {
        "urduURN": 4007550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 760,
        "hadithSanad": "ہم سے عمر بن حفص نے بیان کیا کہ کہا ہم سے میرے والد نے ، انھوں نے کہا کہ ہم سے سلیمان بن مہران اعمش نے بیان کیا ، کہا کہ مجھ سے عمارہ بن عمیر نے بیان کیا ابومعمر عبداللہ بن مخبرہ سے ، کہا کہ ہم نے خباب بن ارت سے پوچھا",
        "hadithText": "کیا نبی کریم صلی اللہ علیہ وسلم ظہر اور عصر میں قرآت کیا کرتے تھے ؟ تو انھوں نے بتلایا کہ ہاں ، ہم نے پوچھا کہ آپ لوگوں کو کس طرح معلوم ہوتا تھا ؟ فرمایا کہ آپ صلی اللہ علیہ وسلم کی داڑھی مبارک کے ہلنے سے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 154,
        "matchingArabicURN": 185630,
        "last_updated": null
    },
    {
        "urduURN": 4007560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 761,
        "hadithSanad": "ہم سے محمد بن یوسف بیکندی نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے اعمش سے ، انھوں نے عمارہ بن عمیر سے ، انھوں نے ابومعمر سے کہ میں نے خباب بن الارت سے پوچھا کہ",
        "hadithText": "کیا نبی کریم صلی اللہ علیہ وسلم ظہر اور عصر کی نمازوں میں قرآت کیا کرتے تھے ؟ تو انھوں نے کہا کہ ہاں ! میں نے کہا کہ آنحضرت صلی اللہ علیہ وسلم کی قرآت کرنے کو آپ لوگ کس طرح معلوم کر لیتے تھے ؟ فرمایا کہ آپ صلی اللہ علیہ وسلم کی داڑھی مبارک کے ہلنے سے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 155,
        "matchingArabicURN": 185640,
        "last_updated": null
    },
    {
        "urduURN": 4007570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 762,
        "hadithSanad": "ہم سے مکی بن ابراہیم نے بیان کیا ، انھوں نے ہشام دستوائی سے ، انھوں نے یحییٰ بن ابی کثیر سے ، انھوں نے عبداللہ بن ابی قتادہ سے ، انھوں نے اپنے باپ حضرت ابوقتادہ رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ظہر اور عصر کی دو رکعات میں سورۃ الفاتحہ اور ایک ایک سورۃ پڑھتے تھے ۔ اور آپ صلی اللہ علیہ وسلم کبھی کبھی کوئی آیت ہمیں سنا بھی دیا کرتے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 156,
        "matchingArabicURN": 185650,
        "last_updated": null
    },
    {
        "urduURN": 4007580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 763,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انھوں نے کہا کہ ہمیں امام مالک نے ابن شہاب سے خبر دی ، انھوں نے عبیداللہ بن عبداللہ بن عتبہ سے بیان کیا ، انھوں نے حضرت عبداللہ بن عباس رضی اللہ عنہما سے بیان کیا ، انھوں نے کہا کہ",
        "hadithText": "ام فضل رضی اللہ عنہا ( ان کی ماں ) نے انہیں «والمرسلات عرفا» پڑھتے ہوئے سنا ۔ پھر کہا کہ اے بیٹے ! تم نے اس سورت کی تلاوت کر کے مجھے یاد دلایا ۔ میں آخر عمر میں آنحضرت صلی اللہ علیہ وسلم کو مغرب میں یہی سورت پڑھتے ہوئے سنتی تھی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 157,
        "matchingArabicURN": 185660,
        "last_updated": null
    },
    {
        "urduURN": 4007590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 764,
        "hadithSanad": "ہم سے ابوعاصم نبیل نے بیان کیا ، انھوں نے عبدالملک ابن جریج سے ، انھوں نے ابن ابی ملیکہ ( زہیر بن عبداللہ ) سے ، انھوں نے عروہ بن زبیر سے ، انھوں نے مروان بن حکم سے ، اس نے کہا",
        "hadithText": "زید بن ثابت نے مجھے ٹوکا کہ تمہیں کیا ہو گیا ہے کہ تم مغرب میں چھوٹی چھوٹی سورتیں پڑھتے ہو ۔ میں نے نبی کریم صلی اللہ علیہ وسلم کو دو لمبی سورتوں میں سے ایک سورت پڑھتے ہوئے سنا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 158,
        "matchingArabicURN": 185670,
        "last_updated": null
    },
    {
        "urduURN": 4007600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 765,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا کہ ہمیں امام مالک نے ابن شہاب سے خبر دی ، انھوں نے محمد بن جبیر بن مطعم سے ، انھوں نے اپنے باپ ( جبیر بن مطعم ) سے ، انھوں نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو مغرب میں سورۃ الطور پڑھتے ہوئے سنا تھا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 159,
        "matchingArabicURN": 185680,
        "last_updated": null
    },
    {
        "urduURN": 4007610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 766,
        "hadithSanad": "ہم سے ابوالنعمان محمد بن فضل نے بیان کیا ، کہا کہ ہم سے معتمر بن سلیمان نے بیان کیا اپنے باپ سے ، انھوں نے بکر بن عبداللہ سے ، انھوں نے ابورافع سے ، انھوں نے بیان کیا کہ",
        "hadithText": "میں نے ابوہریرہ رضی اللہ عنہ کے ساتھ عشاء کی نماز پڑھی ۔ اس میں آپ نے «إذا السماء انشقت‏» پڑھی اور سجدہ ( تلاوت ) کیا ۔ میں نے ان سے اس کے متعلق معلوم کیا تو بتلایا کہ میں نے ابوالقاسم صلی اللہ علیہ وسلم کے پیچھے بھی ( اس آیت میں تلاوت کا ) سجدہ کیا ہے اور زندگی بھر میں اس میں سجدہ کروں گا ، یہاں تک کہ میں آپ صلی اللہ علیہ وسلم سے مل جاؤں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 160,
        "matchingArabicURN": 185690,
        "last_updated": null
    },
    {
        "urduURN": 4007620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 767,
        "hadithSanad": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا عدی بن ثابت سے ، انھوں نے بیان کیا کہ میں نے براء بن عازب سے سنا کہ",
        "hadithText": "میں نے رسول کریم صلی اللہ علیہ وسلم سے سنا ۔ آپ صلی اللہ علیہ وسلم سفر میں تھے کہ عشاء کی دو پہلی رکعات میں سے کسی ایک رکعت میں آپ صلی اللہ علیہ وسلم نے «والتين والزيتون‏» پڑھی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 161,
        "matchingArabicURN": 185700,
        "last_updated": null
    },
    {
        "urduURN": 4007630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 768,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے یزید بن زریع نے بیان کیا ، کہا کہ ہم سے تیمی نے ابوبکر سے ، انھوں نے ابورافع سے ، انھوں نے کہا کہ",
        "hadithText": "میں نے حضرت ابوہریرہ رضی اللہ عنہ کے ساتھ عشاء پڑھی ، آپ نے «إذا السماء انشقت‏» اور سجدہ کیا ۔ اس پر میں نے کہا کہ یہ سجدہ کیسا ہے ؟ آپ نے جواب دیا کہ اس سورت میں میں نے ابوالقاسم صلی اللہ علیہ وسلم کے پیچھے سجدہ کیا تھا ۔ اس لیے میں بھی ہمیشہ اس میں سجدہ کروں گا ، یہاں تک کہ آپ سے مل جاؤں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 162,
        "matchingArabicURN": 185710,
        "last_updated": null
    },
    {
        "urduURN": 4007640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 769,
        "hadithSanad": "ہم سے خلاد بن یحییٰ نے بیان کیا ، انھوں نے کہا کہ ہم سے مسعر بن کدام نے بیان کیا ، انھوں نے کہا کہ مجھ سے عدی بن ثابت نے کہا ۔ انھوں نے براء رضی اللہ عنہ سے سنا ، انھوں نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم کو عشاء میں «والتين والزيتون‏» پڑھتے سنا ۔ میں نے آپ صلی اللہ علیہ وسلم سے زیادہ اچھی آواز یا اچھی قرآت والا کسی کو نہیں پایا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 163,
        "matchingArabicURN": 185720,
        "last_updated": null
    },
    {
        "urduURN": 4007650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 770,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے ابوعون محمد بن عبداللہ ثقفی سے بیان کیا ، انھوں نے کہا کہ میں نے جابر بن سمرہ سے سنا ، انھوں نے بیان کیا کہ",
        "hadithText": "امیرالمؤمنین حضرت عمر رضی اللہ عنہ نے حضرت سعد بن ابی وقاص رضی اللہ عنہ سے کہا کہ آپ کی شکایت کوفہ والوں نے تمام ہی باتوں میں کی ہے ، یہاں تک کہ نماز میں بھی ۔ انھوں نے کہا کہ میرا عمل تو یہ ہے کہ پہلی دو رکعات میں قرآت لمبی کرتا ہوں اور دوسری دو میں مختصر جس طرح میں نے نبی کریم صلی اللہ علیہ وسلم کے پیچھے نماز پڑھی تھی اس میں کسی قسم کی کمی نہیں کرتا ۔ حضرت عمر رضی اللہ عنہ نے فرمایا کہ سچ کہتے ہو ۔ تم سے امید بھی اسی کی ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 164,
        "matchingArabicURN": 185730,
        "last_updated": null
    },
    {
        "urduURN": 4007660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 771,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انھوں نے کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ ہم سے سیار ابن سلامہ نے بیان کیا ، انھوں نے بیان کیا کہ",
        "hadithText": "میں اپنے باپ کے ساتھ ابوبرزہ اسلمی صحابی رضی اللہ عنہ کے پاس گیا ۔ ہم نے آپ سے نماز کے وقتوں کے متعلق پوچھا تو انھوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم ظہر کی نماز سورج ڈھلنے پر پڑھتے تھے ۔ عصر جب پڑھتے تو مدینہ کے انتہائی کنارہ تک ایک شخص چلا جاتا ۔ لیکن سورج اب بھی باقی رہتا ۔ مغرب کے متعلق جو کچھ آپ نے کہا وہ مجھے یاد نہیں رہا اور عشاء کے لیے تہائی رات تک دیر کرنے میں کوئی حرج محسوس نہیں کرتے تھے اور آپ اس سے پہلے سونے کو اور اس کے بعد بات چیت کرنے کو ناپسند کرتے تھے ۔ جب نماز صبح سے فارغ ہوتے تو ہر شخص اپنے قریب بیٹھے ہوئے کو پہچان سکتا تھا ۔ آپ دونوں رکعات میں یا ایک میں ساٹھ سے لے کر سو تک آیتیں پڑھتے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 165,
        "matchingArabicURN": 185740,
        "last_updated": null
    },
    {
        "urduURN": 4007670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 772,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے اسماعیل بن ابراہیم نے بیان کیا ، کہا کہ ہمیں عبدالملک ابن جریج نے خبر دی ، کہا کہ مجھے عطاء بن ابی رباح نے خبر دی کہ انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، وہ فرماتے تھے کہ",
        "hadithText": "ہر نماز میں قرآن مجید کی تلاوت کی جائے گی ۔ جن میں نبی کریم صلی اللہ علیہ وسلم نے ہمیں قرآن سنایا تھا ہم بھی تمہیں ان میں سنائیں گے اور جن نمازوں میں آپ صلی اللہ علیہ وسلم نے آہستہ قرآت کی ہم بھی ان میں آہستہ ہی قرآت کریں گے اور اگر سورۃ الفاتحہ ہی پڑھو جب بھی کافی ہے ، لیکن اگر زیادہ پڑھ لو تو اور بہتر ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 166,
        "matchingArabicURN": 185750,
        "last_updated": null
    },
    {
        "urduURN": 4007680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 773,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، انہوں نے کہا کہ ہم سے ابوعوانہ وضاح یشکری نے ابوبشر سے بیان کیا ، انہوں نے سعید بن جبیر سے ، انہوں نے حضرت عبداللہ بن عباس رضی اللہ عنہما سے ، انہوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ایک مرتبہ چند صحابہ رضی اللہ عنہم کے ساتھ عکاظ کے بازار کی طرف گئے ۔ ان دنوں شیاطین کو آسمان کی خبریں لینے سے روک دیا گیا تھا اور ان پر انگارے ( شہاب ثاقب ) پھینکے جانے لگے تھے ۔ تو وہ شیاطین اپنی قوم کے پاس آئے اور پوچھا کہ بات کیا ہوئی ۔ انھوں نے کہا کہ ہمیں آسمان کی خبریں لینے سے روک دیا گیا ہے اور ( جب ہم آسمان کی طرف جاتے ہیں تو ) ہم پر شہاب ثاقب پھینکے جاتے ہیں ۔ شیاطین نے کہا کہ آسمان کی خبریں لینے سے روکنے کی کوئی نئی وجہ ہوئی ہے ۔ اس لیے تم مشرق و مغرب میں ہر طرف پھیل جاؤ اور اس سبب کو معلوم کرو جو تمہیں آسمان کی خبریں لینے سے روکنے کا سبب ہوا ہے ۔ وجہ معلوم کرنے کے لیے نکلے ہوئے شیاطین تہامہ کی طرف گئے جہاں نبی کریم صلی اللہ علیہ وسلم عکاظ کے بازار کو جاتے ہوئے مقام نخلہ میں اپنے اصحاب کے ساتھ نماز فجر پڑھ رہے تھے ۔ جب قرآن مجید انہوں نے سنا تو غور سے اس کی طرف کان لگا دئیے ۔ پھر کہا ۔ خدا کی قسم یہی ہے جو آسمان کی خبریں سننے سے روکنے کا باعث بنا ہے ۔ پھر وہ اپنی قوم کی طرف لوٹے اور کہا قوم کے لوگو ! ہم نے حیرت انگیز قرآن سنا جو سیدھے راستے کی طرف ہدایت کرتا ہے ۔ اس لیے ہم اس پر ایمان لاتے ہیں اور اپنے رب کے ساتھ کسی کو شریک نہیں ٹھہراتے ۔ اس پر نبی کریم صلی اللہ علیہ وسلم پر یہ آیت نازل ہوئی «قل أوحي إلى‏» ( آپ کہیئے کہ مجھے وحی کے ذریعہ بتایا گیا ہے ) اور آپ پر جنوں کی گفتگو وحی کی گئی تھی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 167,
        "matchingArabicURN": 185760,
        "last_updated": null
    },
    {
        "urduURN": 4007690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 774,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے اسماعیل بن علیہ نے بیان کیا ، کہا کہ ہم سے ایوب سختیانی نے عکرمہ سے بیان کیا ، انہوں نے ابن عباس رضی اللہ عنہما سے ، آپ نے بتلایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کو جن نمازوں میں بلند آواز سے قرآن مجید پڑھنے کا حکم ہوا تھا ۔ آپ صلی اللہ علیہ وسلم نے ان میں بلند آواز سے پڑھا اور جن میں آہستہ سے پڑھنے کا حکم ہوا تھا ان میں آپ صلی اللہ علیہ وسلم نے آہستہ سے پڑھا اور تیرا رب بھولنے والا نہیں اور رسول اللہ صلی اللہ علیہ وسلم کی زندگی تمہارے لیے بہترین نمونہ ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 168,
        "matchingArabicURN": 185770,
        "last_updated": null
    },
    {
        "urduURN": 4007700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 775,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ ہم سے عمرو بن مرہ نے بیان کیا ، انہوں نے کہا کہ میں نے ابووائل شقیق بن مسلم سے سنا کہ",
        "hadithText": "ایک شخص عبداللہ بن مسعود رضی اللہ عنہما کی خدمت میں حاضر ہوا اور کہا کہ میں نے رات ایک رکعت میں مفصل کی سورۃ پڑھی ۔ آپ نے فرمایا کہ کیا اسی طرح ( جلدی جلدی ) پڑھی جیسے شعر پڑھے جاتے ہیں ۔ میں ان ہم معنی سورتوں کو جانتا ہوں جنہیں نبی کریم صلی اللہ علیہ وسلم ایک ساتھ ملا کر پڑھتے تھے ۔ آپ نے مفصل کی بیس سورتوں کا ذکر کیا ۔ ہر رکعت کے لیے دو دو سورتیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 170,
        "matchingArabicURN": 185790,
        "last_updated": null
    },
    {
        "urduURN": 4007710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 776,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا کہ ہم سے ہمام بن یحییٰ نے بیان کیا ، انہوں نے یحییٰ بن ابی کثیر کے واسطے سے بیان کیا ، انہوں نے عبداللہ بن ابی قتادہ سے ، انہوں نے اپنے باپ ابوقتادہ رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ظہر کی دو پہلی رکعتوں میں سورۃ الفاتحہ اور دو سورتیں پڑھتے تھے اور آخری دو رکعات میں صرف سورۃ الفاتحہ پڑھتے ۔ کبھی کبھی ہمیں ایک آیت سنا بھی دیا کرتے تھے اور پہلی رکعت میں قرآت دوسری رکعت سے زیادہ کرتے تھے ۔ عصر اور صبح کی نماز میں بھی آپ کا یہی معمول تھا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 171,
        "matchingArabicURN": 185800,
        "last_updated": null
    },
    {
        "urduURN": 4007720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 777,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا کہ ہم سے جریر بن عبدالحمید نے اعمش سے بیان کیا ، وہ عمارہ بن عمیر سے ، وہ ابومعمر عبداللہ بن مخبرہ سے ، انہوں نے بیان کیا کہ ہم نے خباب بن ارت رضی اللہ عنہ سے کہا کہ",
        "hadithText": "کیا رسول اللہ صلی اللہ علیہ وسلم ظہر اور عصر میں قرآن مجید پڑھتے تھے ؟ انھوں نے جواب دیا کہ ہاں ! ہم نے پوچھا کہ آپ کو معلوم کس طرح ہوتا تھا ۔ انھوں نے بتایا کہ آپ صلی اللہ علیہ وسلم کی ریش مبارک کے ہلنے سے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 172,
        "matchingArabicURN": 185810,
        "last_updated": null
    },
    {
        "urduURN": 4007730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 778,
        "hadithSanad": "ہم سے محمد بن یوسف فریابی نے بیان کیا ، انہوں نے کہا کہ ہم سے امام عبدالرحمٰن اوزاعی نے بیان کیا ، انہوں نے کہا کہ مجھ سے یحییٰ بن ابی کثیر نے بیان کیا ، انہوں نے کہا کہ",
        "hadithText": "مجھ سے عبداللہ بن ابی قتادہ نے بیان کیا ، وہ اپنے والد ابوقتادہ رضی اللہ عنہ سے کہ نبی کریم صلی اللہ علیہ وسلم ظہر اور عصر کی دو پہلی رکعتوں میں سورۃ الفاتحہ اور کوئی اور سورۃ پڑھتے تھے ۔ کبھی کبھی آپ صلی اللہ علیہ وسلم کوئی آیت ہمیں سنا بھی دیا کرتے تھے ۔ پہلی رکعت میں قرآت زیادہ طویل کرتے تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 173,
        "matchingArabicURN": 185820,
        "last_updated": null
    },
    {
        "urduURN": 4007740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 779,
        "hadithSanad": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، انہوں نے کہا کہ ہم سے ہشام دستوائی نے بیان کیا ، انہوں نے یحییٰ بن ابی کثیر سے بیان کیا ، انہوں نے عبداللہ بن ابی قتادہ سے ، انہوں نے اپنے والد ابوقتادہ رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ظہر کی پہلی رکعت میں ( قرآت ) طویل کرتے تھے اور دوسری رکعت میں مختصر ۔ صبح کی نماز میں بھی آپ صلی اللہ علیہ وسلم اسی طرح کرتے تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 174,
        "matchingArabicURN": 185830,
        "last_updated": null
    },
    {
        "urduURN": 4007750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 780,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہوں نے کہا کہ ہمیں امام مالک نے خبر دی انہوں نے ابن شہاب سے ، انہوں نے سعید بن مسیب اور ابوسلمہ بن عبدالرحمٰن کے واسطے سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جب امام «آمين» کہے تو تم بھی «آمين» کہو ۔ کیونکہ جس کی «آمين» ملائکہ کے آمین کے ساتھ ہو گئی اس کے پچھلے تمام گناہ معاف کر دئیے جائیں گے ۔ ابن شہاب نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم «آمين» کہتے تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 175,
        "matchingArabicURN": 185840,
        "last_updated": null
    },
    {
        "urduURN": 4007760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 781,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا ، انہوں نے کہا کہ ہمیں امام مالک نے ابوالزناد سے خبر دی ، انہوں نے اعرج سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جب کوئی تم میں سے «آمين» کہے اور فرشتوں نے بھی اسی وقت آسمان پر «آمين» کہی ۔ اس طرح ایک کی «آمين» دوسرے کے «آمين» کے ساتھ مل گئی تو اس کے پچھلے تمام گناہ معاف ہو جاتے ہیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 176,
        "matchingArabicURN": 185850,
        "last_updated": null
    },
    {
        "urduURN": 4007770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 782,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، انہوں نے امام مالک رحمہ اللہ سے ، انہوں نے ابوبکر بن عبدالرحمٰن کے غلام سمی سے ، انہوں نے ابوصالح سمان سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جب «غير المغضوب عليهم ولا الضالين‏» کہے تو تم بھی «آمين» کہو کیونکہ جس نے فرشتوں کے ساتھ «آمين» کہی اس کے پچھلے تمام گناہ معاف کر دیئے جاتے ہیں ۔ سمی کے ساتھ اس حدیث کو محمد بن عمرو نے ابوسلمہ سے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے ، انہوں نے آنحضرت صلی اللہ علیہ وسلم سے روایت کیا ۔ اور نعیم مجمر نے بھی ابوہریرہ رضی اللہ عنہ سے ، انہوں نے آنحضرت صلی اللہ علیہ وسلم سے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 177,
        "matchingArabicURN": 185860,
        "last_updated": null
    },
    {
        "urduURN": 4007780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 783,
        "hadithSanad": "ہم سے موسیٰ بن اسمعیل نے بیان کیا ، کہا کہ ہم سے ہمام بن یحییٰ نے زیادہ بن حسان اعلم سے بیان کیا ، انہوں نے حضرت حسن رحمہ اللہ علیہ سے ، انہوں نے حضرت ابوبکرہ رضی اللہ عنہ سے کہ",
        "hadithText": "وہ رسول اللہ صلی اللہ علیہ وسلم کی طرف ( نماز پڑھنے کے لیے ) گئے ۔ آپ صلی اللہ علیہ وسلم اس وقت رکوع میں تھے ۔ اس لیے صف تک پہنچنے سے پہلے ہی انہوں نے رکوع کر لیا ، پھر اس کا ذکر نبی کریم صلی اللہ علیہ وسلم سے کیا تو آپ نے فرمایا کہ اللہ تمہارا شوق اور زیادہ کرے لیکن دوبارہ ایسا نہ کرنا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 178,
        "matchingArabicURN": 185870,
        "last_updated": null
    },
    {
        "urduURN": 4007790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 784,
        "hadithSanad": "ہم سے اسحاق بن شاہین واسطی نے بیان کیا ، انہوں نے کہا کہ ہم سے خالد بن عبداللہ طحان نے سعید بن ایاس جریری سے بیان کیا ، انہوں نے ابوالعلاء یزید بن عبداللہ سے ، انہوں نے مطرف بن عبداللہ سے ، انہوں نے عمران بن حصین سے کہ",
        "hadithText": "انہوں نے حضرت علی رضی اللہ عنہ کے ساتھ بصرہ میں ایک مرتبہ نماز پڑھی ۔ پھر کہا کہ ہمیں انہوں نے وہ نماز یاد دلا دی جو کہ ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ پڑھا کرتے تھے ۔ پھر کہا کہ حضرت علی رضی اللہ عنہ جب سر اٹھاتے اور جب سر جھکاتے اس وقت تکبیر کہتے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 179,
        "matchingArabicURN": 185880,
        "last_updated": null
    },
    {
        "urduURN": 4007800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 785,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا کہ ہمیں امام مالک رحمہ اللہ علیہ نے ابن شہاب سے خبر دی ، انہوں نے ابوسلمہ بن عبدالرحمٰن سے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "آپ لوگوں کو نماز پڑھاتے تھے تو جب بھی وہ جھکتے اور جب بھی وہ اٹھتے تکبیر ضرور کہتے ۔ پھر جب فارغ ہوتے تو فرماتے کہ میں نماز پڑھنے میں تم سب لوگوں سے زیادہ رسول اللہ صلی اللہ علیہ وسلم کی نماز سے مشابہت رکھنے والا ہوں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 180,
        "matchingArabicURN": 185890,
        "last_updated": null
    },
    {
        "urduURN": 4007810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 786,
        "hadithSanad": "ہم سے ابوالنعمان محمد بن فضل نے بیان کیا ، انہوں نے کہا کہ ہم سے حماد بن زید نے بیان کیا ، انہوں نے غیلان بن جریر سے بیان کیا ، انہوں نے مطرف بن عبداللہ بن شخیر سے ، انہوں نے کہا کہ",
        "hadithText": "میں نے اور عمران بن حصین نے علی بن ابی طالب رضی اللہ عنہ کے پیچھے نماز پڑھی ۔ تو وہ جب بھی سجدہ کرتے تو تکبیر کہتے ۔ اسی طرح جب سر اٹھاتے تو تکبیر کہتے ۔ جب دو رکعات کے بعد اٹھتے تو تکبیر کہتے ۔ جب نماز ختم ہوئی تو عمران بن حصین نے میرا ہاتھ پکڑ کر کہا کہ حضرت علی رضی اللہ عنہ نے آج حضرت محمد صلی اللہ علیہ وسلم کی نماز یاد دلائی ، یا یہ کہا کہ اس شخص نے ہم کو آنحضرت صلی اللہ علیہ وسلم کی نماز کی طرح آج نماز پڑھائی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 181,
        "matchingArabicURN": 185900,
        "last_updated": null
    },
    {
        "urduURN": 4007820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 787,
        "hadithSanad": "ہم سے عمرو بن عون نے بیان کیا ، کہا کہ ہمیں ہشیم بن بشیر نے ابوبشر حفص بن ابی وحشیہ سے خبر دی ، انہوں نے عکرمہ سے ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نے ایک شخص کو مقام ابراہیم میں ( نماز پڑھتے ہوئے ) دیکھا کہ ہر جھکنے اور اٹھنے پر وہ تکبیر کہتا تھا ۔ اسی طرح کھڑے ہوتے وقت اور بیٹھتے وقت بھی ۔ میں نے ابن عباس رضی اللہ عنہما کو اس کی اطلاع دی ۔ آپ نے فرمایا ، ارے تیری ماں مرے ! کیا یہ رسول اللہ صلی اللہ علیہ وسلم کی سی نماز نہیں ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 182,
        "matchingArabicURN": 185910,
        "last_updated": null
    },
    {
        "urduURN": 4007830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 788,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے ہمام بن یحییٰ نے قتادہ سے بیان کیا ، وہ عکرمہ سے ، کہا کہ",
        "hadithText": "میں نے مکہ میں ایک بوڑھے کے پیچھے ( ظہر کی ) نماز پڑھی ۔ انہوں نے ( تمام نماز میں ) بائیس تکبیریں کہیں ۔ اس پر میں نے ابن عباس رضی اللہ عنہما سے کہا کہ یہ بوڑھا بالکل بے عقل معلوم ہوتا ہے ابن عباس رضی اللہ عنہما نے فرمایا تمہاری ماں تمہیں روئے یہ تو ابوالقاسم صلی اللہ علیہ وسلم کی سنت ہے ۔ اور موسیٰ بن اسماعیل نے یوں بھی بیان کیا کہ ہم سے ابان نے بیان کیا ، کہ کہا ہم سے قتادہ نے ، انہوں نے کہا کہ ہم سے عکرمہ نے یہ حدیث بیان کی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 183,
        "matchingArabicURN": 185920,
        "last_updated": null
    },
    {
        "urduURN": 4007840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 789,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث بن سعد نے عقیل بن خالد کے واسطے سے بیان کیا ، انہوں نے ابن شہاب سے ، انہوں نے کہا کہ مجھے ابوبکر بن عبدالرحمٰن بن حارث نے خبری دی کہ",
        "hadithText": "انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے بتلایا کہ آنحضرت صلی اللہ علیہ وسلم جب نماز کے لیے کھڑے ہوتے تو تکبیر کہتے ۔ پھر جب رکوع کرتے تب بھی تکبیر کہتے تھے ۔ پھر جب سر اٹھاتے تو «سمع الله لمن حمده‏» کہتے اور کھڑے ہی کھڑے «ربنا لك الحمد‏» کہتے ۔ پھر جب ( دوسرے ) سجدہ کے لیے جھکتے تب تکبیر کہتے اور جب سجدہ سے سر اٹھاتے تب بھی تکبیر کہتے ۔ اسی طرح آپ تمام نماز پوری کر لیتے تھے ۔ قعدہ اولیٰ سے اٹھنے پر بھی تکبیر کہتے تھے ۔ ( اس حدیث میں ) عبداللہ بن صالح نے لیث کے واسطے سے ( بجائے «ربنا لك الحمد‏» کے ) «ربنا ولك الحمد‏» نقل کیا ہے ۔ ( «ربنا لك الحمد‏» کہے یا «ربنا ولك الحمد‏» واؤ کے ساتھ ہر دو طریقہ درست ہے ) ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 184,
        "matchingArabicURN": 185930,
        "last_updated": null
    },
    {
        "urduURN": 4007850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 791,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، سلیمان بن اعمش کے واسطہ سے کہا میں نے زید بن وہب سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "حذیفہ بن یمان رضی اللہ عنہ نے ایک شخص کو دیکھا کہ نہ رکوع پوری طرح کرتا ہے نہ سجدہ ۔ اس لیے آپ نے اس سے کہا کہ تم نے نماز ہی نہیں پڑھی اور اگر تم مر گئے تو تمہاری موت اس سنت پر نہیں ہو گی جس پر اللہ تعالیٰ نے محمد صلی اللہ علیہ وسلم کو پیدا کیا تھا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 186,
        "matchingArabicURN": 185950,
        "last_updated": null
    },
    {
        "urduURN": 4007860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 792,
        "hadithSanad": "ہم سے بدل بن محبر نے بیان کیا ، انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا ، انہوں نے کہا کہ مجھے حکم نے ابن ابی لیلیٰ سے خبر دی ، انہوں نے براء بن عازب رضی اللہ عنہ سے ، انہوں نے بتلایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے رکوع و سجود ، دونوں سجدوں کے درمیان کا وقفہ اور جب رکوع سے سر اٹھاتے تو تقریباً سب برابر تھے ۔ سوا قیام اور تشہد کے قعود کے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 187,
        "matchingArabicURN": 185960,
        "last_updated": null
    },
    {
        "urduURN": 4007870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 793,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے عبیداللہ عمری سے بیان کیا ، انہوں نے کہا کہ مجھ سے سعید بن ابی سعید مقبری نے اپنے والد سے بیان کیا ، انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم مسجد میں تشریف لے گئے ۔ اتنے میں ایک شخص آیا اور نماز پڑھنے لگا ۔ نماز کے بعد اس نے آ کر نبی کریم صلی اللہ علیہ وسلم کو سلام کیا ۔ آپ صلی اللہ علیہ وسلم نے سلام کا جواب دے کر فرمایا کہ واپس جا کر دوبارہ نماز پڑھ ، کیونکہ تو نے نماز نہیں پڑھی ۔ چنانچہ اس نے دوبارہ نماز پڑھی اور واپس آ کر پھر آپ صلی اللہ علیہ وسلم کو سلام کیا ، آپ نے اس مرتبہ بھی یہی فرمایا کہ دوبارہ جا کر نماز پڑھ ، کیونکہ تو نے نماز نہیں پڑھی ۔ تین بار اسی طرح ہوا ۔ آخر اس شخص نے کہا کہ اس ذات کی قسم ! جس نے آپ کو مبعوث کیا ۔ میں تو اس سے اچھی نماز نہیں پڑھ سکتا ۔ اس لیے آپ مجھے سکھلائیے ۔ آپ نے فرمایا جب تو نماز کے لیے کھڑا ہو تو ( پہلے ) تکبیر کہہ پھر قرآن مجید سے جو کچھ تجھ سے ہو سکے پڑھ ، اس کے بعد رکوع کر اور پوری طرح رکوع میں چلا جا ۔ پھر سر اٹھا اور پوری طرح کھڑا ہو جا ۔ پھر جب تو سجدہ کرے تو پوری طرح سجدہ میں چلا جا ۔ پھر ( سجدہ سے ) سر اٹھا کر اچھی طرح بیٹھ جا ۔ دوبارہ بھی اسی طرح سجدہ کر ۔ یہی طریقہ نماز کے تمام ( رکعتوں میں ) اختیار کر ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 188,
        "matchingArabicURN": 185970,
        "last_updated": null
    },
    {
        "urduURN": 4007880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 794,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا ، انہوں نے کہا منصور بن معتمر نے بیان کیا ، انہوں نے ابوالضحیٰ مسلم بن صبیح سے ، انہوں نے مسروق سے ، انہوں نے عائشہ رضی اللہ عنہا سے ، انہوں نے فرمایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم رکوع اور سجدہ میں «سبحانك اللهم ربنا وبحمدك ،‏‏‏‏ اللهم اغفر لي» پڑھا کرتے تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 189,
        "matchingArabicURN": 185980,
        "last_updated": null
    },
    {
        "urduURN": 4007890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 795,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انہوں نے کہا کہ ہم سے ابن ابی ذئب نے بیان کیا ، انہوں نے سعید مقبری سے بیان کیا ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جب «سمع الله لمن حمده» کہتے تو اس کے بعد «اللهم ربنا ولك الحمد» بھی کہتے ۔ اسی طرح جب آپ صلی اللہ علیہ وسلم رکوع کرتے اور سر اٹھاتے تو تکبیر کہتے ۔ دونوں سجدوں سے کھڑے ہوتے وقت بھی آپ صلی اللہ علیہ وسلم «الله أكبر» کہا کرتے تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 190,
        "matchingArabicURN": 185990,
        "last_updated": null
    },
    {
        "urduURN": 4007900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 796,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہوں نے کہا کہ ہمیں امام مالک نے سمی سے خبر دی ، انہوں نے ابوصالح ذکوان کے واسطے سے بیان کیا ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جب امام «سمع الله لمن حمده» کہے تو تم «اللهم ربنا ولك الحمد» کہو ۔ کیونکہ جس کا یہ کہنا فرشتوں کے کہنے کے ساتھ ہو گا ، اس کے پچھلے تمام گناہ بخش دیے جائیں گے</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 191,
        "matchingArabicURN": 186000,
        "last_updated": null
    },
    {
        "urduURN": 4007910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 797,
        "hadithSanad": "ہم سے معاذ بن فضالہ نے بیان کیا ، انہوں نے ہشام دستوائی سے ، انہوں نے یحییٰ بن ابی کثیر سے ، انہوں نے ابوسلمہ سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انہوں نے کہا کہ",
        "hadithText": "لو میں تمہیں نبی کریم صلی اللہ علیہ وسلم کی نماز کے قریب قریب کر دوں گا ۔ چنانچہ حضرت ابوہریرہ رضی اللہ عنہ ، ظہر ، عشاء اور صبح کی آخری رکعات میں قنوت پڑھا کرتے تھے ۔ «سمع الله لمن حمده» کے بعد ۔ یعنی مومنین کے حق میں دعا کرتے اور کفار پر لعنت بھیجتے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 192,
        "matchingArabicURN": 186010,
        "last_updated": null
    },
    {
        "urduURN": 4007920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 798,
        "hadithSanad": "ہم سے عبداللہ بن ابی الاسود نے بیان کیا ، انہوں نے کہا کہ ہم سے اسماعیل بن علیہ نے بیان کیا ، انہوں نے خالد بن حذاء سے بیان کیا ، انہوں نے ابوقلابہ ( عبداللہ بن زید ) سے ، انہوں نے انس رضی اللہ عنہ سے کہ",
        "hadithText": "آپ نے فرمایا کہ دعا قنوت فجر اور مغرب کی نمازوں میں پڑھی جاتی ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 193,
        "matchingArabicURN": 186020,
        "last_updated": null
    },
    {
        "urduURN": 4007930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 799,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا امام مالک رضی اللہ عنہ سے ، انہوں نے نعیم بن عبداللہ مجمر سے ، انہوں نے علی بن یحییٰ بن خلاد زرقی سے ، انہوں نے اپنے باپ سے ، انہوں نے رفاعہ بن رافع زرقی سے ، انہوں نے کہا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کی اقتداء میں نماز پڑھ رہے تھے ۔ جب آپ رکوع سے سر اٹھاتے تو «سمع الله لمن حمده » کہتے ۔ ایک شخص نے پیچھے سے کہا «ربنا ولك الحمد ،‏‏‏‏ حمدا كثيرا طيبا مباركا فيه» آپ صلی اللہ علیہ وسلم نے نماز سے فارغ ہو کر دریافت فرمایا کہ کس نے یہ کلمات کہے ہیں ، اس شخص نے جواب دیا کہ میں نے ۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے تیس سے زیادہ فرشتوں کو دیکھا کہ ان کلمات کو لکھنے میں وہ ایک دوسرے پر سبقت لے جانا چاہتے تھے ۔ ( اس سے ان کلمات کی فضیلت ثابت ہوئی ) ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 194,
        "matchingArabicURN": 186030,
        "last_updated": null
    },
    {
        "urduURN": 4007940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 800,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا کہ ہم سے شعبہ نے ثابت بنانی سے بیان کیا ، انہوں نے کہا کہ",
        "hadithText": "حضرت انس رضی اللہ عنہ ہمیں نبی کریم صلی اللہ علیہ وسلم کی نماز کا طریقہ بتلاتے تھے ۔ چنانچہ آپ صلی اللہ علیہ وسلم نماز پڑھتے اور جب اپنا سر رکوع سے اٹھاتے تو اتنی دیر تک کھڑے رہتے کہ ہم سوچنے لگتے کہ آپ صلی اللہ علیہ وسلم بھول گئے ہیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 195,
        "matchingArabicURN": 186040,
        "last_updated": null
    },
    {
        "urduURN": 4007950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 801,
        "hadithSanad": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا ، کہا کہ ہم سے شعبہ نے حکم سے بیان کیا ، انہوں نے ابن ابی لیلیٰ سے ، انہوں نے براء بن عازب رضی اللہ عنہ سے ، انہوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے رکوع ، سجدہ ، رکوع سے سر اٹھاتے وقت اور دونوں سجدوں کے درمیان کا بیٹھنا تقریباً برابر ہوتا تھا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 196,
        "matchingArabicURN": 186050,
        "last_updated": null
    },
    {
        "urduURN": 4007960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 802,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، انہوں نے کہا کہ ہم سے حماد بن زید نے بیان کیا ، انہوں نے ایوب سختیانی سے ، انہوں نے ابوقلابہ سے کہ",
        "hadithText": "مالک بن حویرث رضی اللہ عنہ ہمیں ( نماز پڑھ کر ) دکھلاتے کہ نبی کریم صلی اللہ علیہ وسلم کس طرح نماز پڑھتے تھے اور یہ نماز کا وقت نہیں تھا ۔ چنانچہ آپ ( ایک مرتبہ ) کھڑے ہوئے اور پوری طرح کھڑے رہے ۔ پھر جب رکوع کیا اور پوری طمانیت کے ساتھ سر اٹھایا تب بھی تھوڑی دیر سیدھے کھڑے رہے ۔ ابوقلابہ نے بیان کیا کہ مالک رضی اللہ عنہ نے ہمارے اس شیخ ابویزید کی طرح نماز پڑھائی ۔ ابویزید جب دوسرے سجدہ سے سر اٹھاتے تو پہلے اچھی طرح بیٹھ لیتے پھر کھڑے ہوتے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 197,
        "matchingArabicURN": 186060,
        "last_updated": null
    },
    {
        "urduURN": 4007970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 803,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا کہ ہمیں شعیب نے خبر دی ، انہوں نے زہری سے ، انہوں نے کہا کہ مجھ کو ابوبکر بن عبدالرحمٰن بن حارث بن ہشام اور ابوسلمہ بن عبدالرحمٰن نے خبر دی کہ",
        "hadithText": "حضرت ابوہریرہ رضی اللہ عنہ تمام نمازوں میں تکبیر کہا کرتے تھے ۔ خواہ فرض ہوں یا نہ ہوں ۔ رمضان کا مہینہ ہو یا کوئی اور مہینہ ہو ، چنانچہ جب آپ نماز کے لیے کھڑے ہوتے تو تکبیر کہتے ، رکوع میں جاتے تو تکبیر کہتے ۔ پھر «سمع الله لمن حمده‏» کہتے اور اس کے بعد «ربنا ولك الحمد‏» سجدہ سے پہلے ، پھر جب سجدہ کے لیے جھکتے تو «الله أكبر‏» کہتے ۔ پھر سجدہ سے سر اٹھاتے تو «الله أكبر‏» کہتے ۔ پھر دوسرا سجدہ کرتے وقت «الله أكبر‏» کہتے ۔ اسی طرح سجدہ سے سر اٹھاتے تو «الله أكبر‏» کہتے ۔ دو رکعات کے بعد قعدہ اولیٰ کرنے کے بعد جب کھڑے ہوتے تب بھی تکبیر کہتے اور آپ ہر رکعت میں ایسا ہی کرتے یہاں تک کہ نماز سے فارغ ہونے تک ۔ نماز سے فارغ ہونے کے بعد فرماتے کہ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے میں تم میں سب سے زیادہ نبی کریم صلی اللہ علیہ وسلم کی نماز سے مشابہ ہوں ۔ اور آپ اسی طرح نماز پڑھتے رہے یہاں تک کہ آپ دنیا سے تشریف لے گئے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 198,
        "matchingArabicURN": 186070,
        "last_updated": null
    },
    {
        "urduURN": 4007980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 804,
        "hadithSanad": "ابوبکر اور ابوسلمہ دونوں نے کہا کہ حضرت ابوہریرہ رضی اللہ عنہ نے بتلایا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم جب سرمبارک ( رکوع سے ) اٹھاتے تو «سمع الله لمن حمده ،‏‏‏‏ ربنا ولك الحمد‏» کہہ کر چند لوگوں کے لیے دعائیں کرتے اور نام لے لے کر فرماتے ۔ یا اللہ ولید بن ولید ، سلمہ بن ہشام ، عیاش بن ابی ربیعہ اور تمام کمزور مسلمانوں کو ( کفار سے ) نجات دے ۔ اے اللہ ! قبیلہ مضر کے لوگوں کو سختی کے ساتھ کچل دے اور ان پر قحط مسلط کر جیسا کہ یوسف علیہ السلام کے زمانہ میں آیا تھا ۔ ان دنوں پورب والے قبیلہ مضر کے لوگ مخالفین میں تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 199,
        "matchingArabicURN": 186080,
        "last_updated": null
    },
    {
        "urduURN": 4007990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 805,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے باربار زہری سے یہ بیان کیا کہ انہوں نے کہا کہ میں نے انس بن مالک رضی اللہ عنہ کو یہ کہتے ہوئے سنا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم گھوڑے سے زمین پر گر گئے ۔ سفیان نے اکثر ( بجائے عن فرس کے ) من فرس کہا ۔ اس گرنے سے آپ صلی اللہ علیہ وسلم کا دایاں پہلو زخمی ہو گیا تو ہم آپ صلی اللہ علیہ وسلم کی خدمت میں عیادت کی غرض سے حاضر ہوئے ۔ اتنے میں نماز کا وقت ہو گیا اور آپ صلی اللہ علیہ وسلم نے ہمیں بیٹھ کر نماز پڑھائی ۔ ہم بھی بیٹھ گئے ۔ سفیان نے ایک مرتبہ کہا کہ ہم نے بھی بیٹھ کر نماز پڑھی ۔ جب آپ صلی اللہ علیہ وسلم نماز سے فارغ ہو گئے تو فرمایا کہ امام اس لیے ہے کہ اس کی اقتداء کی جائے ۔ اس لیے جب وہ تکبیر کہے تو تم بھی تکبیر کہو ۔ جب رکوع کرے تو تم بھی رکوع کرو ۔ جب سر اٹھائے تو تم بھی سر اٹھاؤ اور جب وہ «سمع الله لمن حمده‏» کہے تو تم «ربنا ولك الحمد‏» اور جب سجدہ کرے تو تم بھی سجدہ کرو ۔ ( سفیان نے اپنے شاگرد علی بن مدینی سے پوچھا کہ ) کیا معمر نے بھی اسی طرح حدیث بیان کی تھی ۔ ( علی کہتے ہیں کہ ) میں نے کہا جی ہاں ۔ اس پر سفیان بولے کہ معمر کو حدیث یاد تھی ۔ زہری نے یوں کہا «ولك الحمد‏» ۔ سفیان نے یہ بھی کہا کہ مجھے یاد ہے کہ زہری نے یوں کہا آپ کا دایاں بازو چھل گیا تھا ۔ جب ہم زہری کے پاس سے نکلے ابن جریج نے کہا میں زہری کے پاس موجود تھا تو انہوں نے یوں کہا کہ آپ کی داہنی پنڈلی چھل گئی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 200,
        "matchingArabicURN": 186090,
        "last_updated": null
    },
    {
        "urduURN": 4008000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 806,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا کہ ہمیں شعیب نے زہری سے خبر دی ، انہوں نے بیان کیا کہ مجھے سعید بن مسیب اور عطاء بن یزید لیثی نے خبر دی کہ ابوہریرہ رضی اللہ عنہ نے انہیں خبر دی کہ",
        "hadithText": "لوگوں نے پوچھا یا رسول اللہ ! کیا ہم اپنے رب کو قیامت میں دیکھ سکیں گے ؟ آپ نے ( جواب کے لیے ) پوچھا ، کیا تمہیں چودھویں رات کے چاند کے دیکھنے میں جب کہ اس کے قریب کہیں بادل بھی نہ ہو شبہ ہوتا ہے ؟ لوگ بولے ہرگز نہیں یا رسول اللہ ! پھر آپ نے پوچھا اور کیا تمہیں سورج کے دیکھنے میں جب کہ اس کے قریب کہیں بادل بھی نہ ہو شبہ ہوتا ہے ۔ لوگوں نے کہا کہ نہیں یا رسول اللہ ! پھر آپ نے فرمایا کہ رب العزت کو تم اسی طرح دیکھو گے ۔ لوگ قیامت کے دن جمع کئے جائیں گے ۔ پھر اللہ تعالیٰ فرمائے گا کہ جو جسے پوجتا تھا وہ اس کے ساتھ ہو جائے ۔ چنانچہ بہت سے لوگ سورج کے پیچھے ہو لیں گے ، بہت سے چاند کے اور بہت سے بتوں کے ساتھ ہو لیں گے ۔ یہ امت باقی رہ جائے گی ۔ اس میں منافقین بھی ہوں گے ۔ پھر اللہ تعالیٰ ایک نئی صورت میں آئے گا اور ان سے کہے گا کہ میں تمہارا رب ہوں ۔ وہ منافقین کہیں گے کہ ہم یہیں اپنے رب کے آنے تک کھڑے رہیں گے ۔ جب ہمارا رب آئے گا تو ہم اسے پہچان لیں گے ۔ پھر اللہ عزوجل ان کے پاس ( ایسی صورت میں جسے وہ پہچان لیں ) آئے گا اور فرمائے گا کہ میں تمہارا رب ہوں ۔ وہ بھی کہیں گے کہ بیشک تو ہمارا رب ہے ۔ پھر اللہ تعالیٰ بلائے گا ۔ پل صراط جہنم کے بیچوں بیچ رکھا جائے گا اور آنحضرت صلی اللہ علیہ وسلم فرماتے ہیں کہ میں اپنی امت کے ساتھ اس سے گزرنے والا سب سے پہلا رسول ہوں گا ۔ اس روز سوا انبیاء کے کوئی بھی بات نہ کر سکے گا اور انبیاء بھی صرف یہ کہیں گے ۔ اے اللہ ! مجھے محفوظ رکھیو ! اے اللہ ! مجھے محفوظ رکھیو ! اور جہنم میں سعدان کے کانٹوں کی طرح آنکس ہوں گے ۔ سعدان کے کانٹے تو تم نے دیکھے ہوں گے ؟ صحابہ رضی اللہ عنہم نے عرض کیا کہا ہاں ! ( آپ نے فرمایا ) تو وہ سعدان کے کانٹوں کی طرح ہوں گے ۔ البتہ ان کے طول و عرض کو سوا اللہ تعالیٰ کے اور کوئی نہیں جانتا ۔ یہ آنکس لوگوں کو ان کے اعمال کے مطابق کھینچ لیں گے ۔ بہت سے لوگ اپنے عمل کی وجہ سے ہلاک ہوں گے ۔ بہت سے ٹکڑے ٹکڑے ہو جائیں گے ۔ پھر ان کی نجات ہو گی ۔ جہنمیوں میں سے اللہ تعالیٰ جس پر رحم فرمانا چاہے گا تو ملائکہ کو حکم دے گا کہ جو خالص اللہ تعالیٰ ہی کی عبادت کرتے تھے انہیں باہر نکال لو ۔ چنانچہ ان کو وہ باہر نکالیں گے اور موحدوں کو سجدے کے آثار سے پہچانیں گے ۔ اللہ تعالیٰ نے جہنم پر سجدہ کے آثار کا جلانا حرام کر دیا ہے ۔ چنانچہ یہ جب جہنم سے نکالے جائیں گے تو اثر سجدہ کے سوا ان کے جسم کے تمام ہی حصوں کو آگ جلا چکی ہو گی ۔ جب جہنم سے باہر ہوں گے تو بالکل جل چکے ہوں گے ۔ اس لیے ان پر آب حیات ڈالا جائے گا ۔ جس سے وہ اس طرح ابھر آئیں گے ۔ جیسے سیلاب کے کوڑے کرکٹ پر سیلاب کے تھمنے کے بعد سبزہ ابھر آتا ہے ۔ پھر اللہ تعالیٰ بندوں کے حساب سے فارغ ہو جائے گا ۔ لیکن ایک شخص جنت اور دوزخ کے درمیان اب بھی باقی رہ جائے گا ۔ یہ جنت میں داخل ہونے والا آخری دوزخی شخص ہو گا ۔ اس کا منہ دوزخ کی طرف ہو گا ۔ اس لیے کہے گا کہ اے میرے رب ! میرے منہ کو دوزخ کی طرف سے پھیر دے ۔ کیونکہ اس کی بدبو مجھ کو مارے ڈالتی ہے اور اس کی چمک مجھے جلائے دیتی ہے ۔ اللہ تعالیٰ پوچھے گا کیا اگر تیری یہ تمنا پوری کر دوں تو تو دوبارہ کوئی نیا سوال تو نہیں کرے گا ؟ بندہ کہے گا نہیں تیری بزرگی کی قسم ! اور جیسے جیسے اللہ چاہے گا وہ قول و قرار کرے گا ۔ آخر اللہ تعالیٰ جہنم کی طرف سے اس کا منہ پھیر دے گا ۔ جب وہ جنت کی طرف منہ کرے گا اور اس کی شادابی نظروں کے سامنے آئی تو اللہ نے جتنی دیر چاہا وہ چپ رہے گا ۔ لیکن پھر بول پڑے گا اے اللہ ! مجھے جنت کے دروازے کے قریب پہنچا دے ۔ اللہ تعالیٰ پوچھے گا کیا تو نے عہد و پیمان نہیں باندھا تھا کہ اس ایک سوال کے سوا اور کوئی سوال تو نہیں کرے گا ۔ بندہ کہے گا اے میرے رب ! مجھے تیری مخلوق میں سب سے زیادہ بدنصیب نہ ہونا چاہئے ۔ اللہ رب العزت فرمائے گا کہ پھر کیا ضمانت ہے کہ اگر تیری یہ تمنا پوری کر دی گئی تو دوسرا کوئی سوال تو نہیں کرے گا ۔ بندہ کہے گا نہیں تیری عزت کی قسم اب دوسرا سوال کوئی تجھ سے نہیں کروں گا ۔ چنانچہ اپنے رب سے ہر طرح عہد و پیمان باندھے گا اور جنت کے دروازے تک پہنچا دیا جائے گا ۔ دروازہ پر پہنچ کر جب جنت کی پنہائی ، تازگی اور مسرتوں کو دیکھے گا تو جب تک اللہ تعالیٰ چاہے گا وہ بندہ چپ رہے گا ۔ لیکن آخر بول پڑے گا کہ اے اللہ ! مجھے جنت کے اندر پہنچا دے ۔ اللہ تعالیٰ فرمائے گا ۔ افسوس اے ابن آدم ! تو ایسا دغاباز کیوں بن گیا ؟ کیا ( ابھی ) تو نے عہد و پیمان نہیں باندھا تھا کہ جو کچھ مجھے دیا گیا ، اس سے زیادہ اور کچھ نہ مانگوں گا ۔ بندہ کہے گا اے رب ! مجھے اپنی سب سے زیادہ بدنصیب مخلوق نہ بنا ۔ اللہ پاک ہنس دے گا اور اسے جنت میں بھی داخلہ کی اجازت عطا فرما دے گا اور پھر فرمائے گا مانگ کیا ہے تیری تمنا ۔ چنانچہ وہ اپنی تمنائیں ( اللہ تعالیٰ کے سامنے ) رکھے گا اور جب تمام تمنائیں ختم ہو جائیں گی تو اللہ تعالیٰ فرمائے گا کہ فلاں چیز اور مانگو ، فلاں چیز کا مزید سوال کرو ۔ خود اللہ پاک ہی یاددہانی کرائے گا ۔ اور جب وہ تمام تمنائیں پوری ہو جائیں گی تو فرمائے گا کہ تمہیں یہ سب اور اتنی ہی اور دی گئیں ۔ حضرت ابو سعید خدری رضی اللہ عنہ نے حضرت ابوہریرہ رضی اللہ عنہ سے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ یہ اور اس سے دس گنا اور زیادہ تمہیں دی گئیں ۔ اس پر حضرت ابوہریرہ رضی اللہ عنہ نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم کی یہی بات صرف مجھے یاد ہے کہ تمہیں یہ تمنائیں اور اتنی ہی اور دی گئیں ۔ لیکن حضرت ابوسعید رضی اللہ عنہ نے فرمایا کہ میں نے آپ کو یہ کہتے سنا تھا کہ یہ اور اس کی دس گنا تمنائیں تجھ کو دی گئیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 201,
        "matchingArabicURN": 186100,
        "last_updated": null
    },
    {
        "urduURN": 4008010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 807,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ مجھ سے بکر بن مضر نے جعفر بن ربیعہ سے بیان کیا ، انہوں نے عبدالرحمٰن بن ہرمز سے ، انہوں نے عبداللہ بن مالک بن بحینہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جب نماز پڑھتے سجدے میں اپنے دونوں بازوؤں کو اس قدر پھیلا دیتے کہ بغل کی سفیدی ظاہر ہو جاتی تھی ۔ لیث بن سعد نے بیان کیا کہ مجھ سے بھی جعفر بن ربیعہ نے اسی طرح حدیث بیان کی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 202,
        "matchingArabicURN": 186110,
        "last_updated": null
    },
    {
        "urduURN": 4008020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 808,
        "hadithSanad": "ہم سے صلت بن محمد بصریٰ نے بیان کیا ، کہا ہم سے مہدی بن میمون نے واصل سے بیان کیا ، انہوں نے ابووائل سے ، انہوں نے حذیفہ رضی اللہ عنہ سے کہ",
        "hadithText": "انہوں نے ایک شخص کو دیکھا جو رکوع اور سجدہ پوری طرح نہیں کرتا تھا ۔ جب وہ نماز پڑھ چکا تو انہوں نے اس سے فرمایا کہ تو نے نماز ہی نہیں پڑھی ۔ ابووائل نے کہا کہ مجھے یاد آتا ہے کہ حذیفہ نے یہ فرمایا کہ اگر تم مر گئے تو تمہاری موت محمد صلی اللہ علیہ وسلم کے طریق پر نہیں ہو گی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 203,
        "matchingArabicURN": 186120,
        "last_updated": null
    },
    {
        "urduURN": 4008030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 809,
        "hadithSanad": "ہم سے قبیصہ بن عقبہ نے بیان کیا ، کہا کہ ہم سے سفیان ثوری نے عمرو بن دینار سے بیان کیا ، انہوں نے طاؤس سے ، انہوں نے حضرت ابن عباس رضی اللہ عنہما سے ، آپ نے بتلایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کو سات اعضاء پر سجدہ کا حکم دیا گیا ۔ اس طرح کہ نہ بالوں کو اپنے سمیٹتے نہ کپڑے کو ( وہ سات اعضاء یہ ہیں ) پیشانی ( مع ناک ) دونوں ہاتھ ، دونوں گھٹنے اور دونوں پاؤں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 204,
        "matchingArabicURN": 186130,
        "last_updated": null
    },
    {
        "urduURN": 4008040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 810,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے ، انہوں نے عمرو سے ، انہوں نے طاؤس سے ، انہوں نے حضرت ابن عباس رضی اللہ عنہما سے ، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہمیں سات اعضاء پر اس طرح سجدہ کا حکم ہوا ہے کہ ہم نہ بال سمیٹیں نہ کپڑے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 205,
        "matchingArabicURN": 186140,
        "last_updated": null
    },
    {
        "urduURN": 4008050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 811,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے اسرائیل نے ابواسحاق سے بیان کیا ، انہوں نے عبداللہ بن یزید سے ، انہوں نے کہا کہ ہم سے براء بن عازب رضی اللہ عنہ نے بیان کیا ، وہ جھوٹ نہیں بول سکتے تھے ۔ آپ نے فرمایا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کی اقتداء میں نماز پڑھتے تھے ۔ جب آپ «سمع الله لمن حمده‏» کہتے ( یعنی رکوع سے سر اٹھاتے ) تو ہم میں سے کوئی اس وقت تک اپنی پیٹھ نہ جھکاتا جب تک آپ صلی اللہ علیہ وسلم اپنی پیشانی زمین پر نہ رکھ دیتے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 206,
        "matchingArabicURN": 186150,
        "last_updated": null
    },
    {
        "urduURN": 4008060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 812,
        "hadithSanad": "ہم سے معلی بن اسد نے بیان کیا ، انہوں نے کہا ہم سے وہیب بن خالد نے بیان کیا ، انہوں نے عبداللہ بن طاؤس سے ، انہوں نے اپنے باپ سے ، انہوں نے حضرت ابن عباس رضی اللہ عنہما سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا مجھے سات اعضاء پر سجدہ کرنے کا حکم ہوا ہے ۔ پیشانی پر اور اپنے ہاتھ سے ناک کی طرف اشارہ کیا اور دونوں ہاتھ اور دونوں گھٹنے اور دونوں پاؤں کی انگلیوں پر ۔ اس طرح کہ ہم نہ کپڑے سمیٹیں نہ بال ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 207,
        "matchingArabicURN": 186160,
        "last_updated": null
    },
    {
        "urduURN": 4008070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 813,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا کہ ہم سے ہمام بن یحییٰ نے یحییٰ بن ابی کثیر سے بیان کیا ، انہوں نے ابوسلمہ بن عبدالرحمٰن سے ، انہوں نے بیان کیا کہ",
        "hadithText": "میں ابو سعید خدری رضی اللہ عنہ کی خدمت میں حاضر ہوا ۔ میں نے عرض کی کہ فلاں نخلستان میں کیوں نہ چلیں سیر بھی کریں گے اور کچھ باتیں بھی کریں گے ۔ چنانچہ آپ تشریف لے چلے ۔ ابوسلمہ نے بیان کیا کہ میں نے راہ میں کہا کہ شب قدر سے متعلق آپ نے اگر کچھ نبی کریم صلی اللہ علیہ وسلم سے سنا ہے تو اسے بیان کیجئے ۔ انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے رمضان کے پہلے عشرے میں اعتکاف کیا اور ہم بھی آپ کے ساتھ اعتکاف میں بیٹھ گئے ، لیکن جبرائیل علیہ السلام نے آ کر بتایا کہ آپ جس کی تلاش میں ہیں ( شب قدر ) وہ آگے ہے ۔ چنانچہ آپ نے دوسرے عشرے میں بھی اعتکاف کیا اور آپ کے ساتھ ہم نے بھی ۔ جبرائیل علیہ السلام دوبارہ آئے اور فرمایا کہ آپ جس کی تلاش میں ہیں وہ ( رات ) آگے ہے ۔ پھر آپ نے بیسویں رمضان کی صبح کو خطبہ دیا ۔ آپ نے فرمایا کہ جس نے میرے ساتھ اعتکاف کیا ہو وہ دوبارہ کرے ۔ کیونکہ شب قدر مجھے معلوم ہو گئی لیکن میں بھول گیا اور وہ آخری عشرہ کی طاق راتوں میں ہے اور میں نے خود کو کیچڑ میں سجدہ کرتے دیکھا ۔ مسجد کی چھت کھجور کی ڈالیوں کی تھی ۔ مطلع بالکل صاف تھا کہ اتنے میں ایک پتلا سا بادل کا ٹکڑا آیا اور برسنے لگا ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے ہم کو نماز پڑھائی اور میں نے رسول اللہ صلی اللہ علیہ وسلم کی پیشانی اور ناک پر کیچڑ کا اثر دیکھا ۔ آپ کا خواب سچا ہو گیا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 208,
        "matchingArabicURN": 186170,
        "last_updated": null
    },
    {
        "urduURN": 4008080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 814,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ، کہا کہ ہمیں سفیان نے ابوحازم سلمہ بن دینار کے واسطے سے خبر دی ، انہوں نے سہل بن سعد سے ، انہوں نے کہا کہ",
        "hadithText": "کچھ لوگ آنحضرت صلی اللہ علیہ وسلم کے ساتھ تہبند چھوٹے ہونے کی وجہ سے انہیں گردنوں سے باندھ کر نماز پڑھتے تھے اور عورتوں سے کہہ دیا گیا تھا کہ جب تک مرد اچھی طرح بیٹھ نہ جائیں تم اپنے سروں کو ( سجدہ سے ) نہ اٹھاؤ ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 209,
        "matchingArabicURN": 186180,
        "last_updated": null
    },
    {
        "urduURN": 4008090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 815,
        "hadithSanad": "ہم سے ابوالنعمان محمد بن فضل نے بیان کیا ، انہوں نے کہا کہ ہم سے حماد بن زید نے عمرو بن دینار سے بیان کیا ، انہوں نے طاؤس سے ، انہوں نے ابن عباس رضی اللہ عنہما سے ، آپ نے فرمایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کو حکم تھا کہ سات ہڈیوں پر سجدہ کریں اور بال اور کپڑے نہ سمیٹیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 210,
        "matchingArabicURN": 186190,
        "last_updated": null
    },
    {
        "urduURN": 4008100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 816,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے ابوعوانہ وضاح نے ، عمرو بن دینار سے بیان کیا ، انہوں نے طاؤس سے ، انہوں نے حضرت ابن عباس سے ، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا مجھے سات ہڈیوں پر اس طرح سجدہ کا حکم ہوا ہے کہ نہ بال سمیٹوں اور نہ کپڑے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 211,
        "matchingArabicURN": 186200,
        "last_updated": null
    },
    {
        "urduURN": 4008110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 817,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے ، سفیان ثوری سے ، انہوں نے کہا کہ مجھ سے منصور بن معتمر نے مسلم بن صبیح سے بیان کیا ، انہوں نے مسروق سے ، ان سے حضرت عائشہ صدیقہ رضی اللہ عنہا نے فرمایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم سجدہ اور رکوع میں اکثر یہ پڑھا کرتے تھے ۔ «سبحانك اللهم ربنا وبحمدك ،‏‏‏‏ اللهم اغفر لي» ( اس دعا کو پڑھ کر ) آپ قرآن کے حکم پر عمل کرتے تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 212,
        "matchingArabicURN": 186210,
        "last_updated": null
    },
    {
        "urduURN": 4008120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 818,
        "hadithSanad": "ہم سے ابو النعمان محمد بن فضل نے بیان کیا ، کہا کہ ہم سے حماد بن زید نے ایوب سختیانی سے بیان کیا ، انہوں نے ابوقلابہ عبداللہ بن زید سے ، کہ مالک بن حویرث رضی اللہ عنہ نے اپنے ساتھیوں سے کہا کہ",
        "hadithText": "میں تمہیں نبی کریم صلی اللہ علیہ وسلم کی نماز کیوں نہ سکھا دوں ۔ ابوقلابہ نے کہا یہ نماز کا وقت نہیں تھا ( مگر آپ ہمیں سکھانے کے لیے ) کھڑے ہوئے ۔ پھر رکوع کیا اور تکبیر کہی پھر سر اٹھایا اور تھوڑی دیر کھڑے رہے ۔ پھر سجدہ کیا اور تھوڑی دیر کے لیے سجدہ سے سر اٹھایا اور پھر سجدہ کیا اور سجدہ سے تھوڑی دیر کے لیے سر اٹھایا ۔ انہوں نے ہمارے شیخ عمرو بن سلمہ کی طرح نماز پڑھی ایوب سختیانی نے کہا کہ وہ عمرو بن سلمہ نماز میں ایک ایسی چیز کیا کرتے تھے کہ دوسرے لوگوں کو اس طرح کرتے میں نے نہیں دیکھا ۔ آپ تیسری یا چوتھی رکعت پر ( سجدہ سے فارغ ہو کر کھڑے ہونے سے پہلے ) بیٹھتے تھے ۔ ( یعنی جلسہ استراحت کرتے تھے ) ۔\n( پھر نماز سکھلانے کے بعدمالک بن حویرث نے بیان کیا کہ )ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آپ صلی اللہ علیہ وسلم کے یہاں ٹھہرے رہے آپ صلی اللہ علیہ وسلم نے فرمایا کہ ( بہتر ہے ) تم اپنے گھروں کو واپس جاؤ ۔ دیکھو یہ نماز فلاں وقت اور یہ نماز فلاں وقت پڑھنا ۔ جب نماز کا وقت ہو جائے تو ایک شخص تم میں سے اذان دے اور جو تم میں بڑا ہو وہ نماز پڑھائے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 213,
        "matchingArabicURN": 186221,
        "last_updated": null
    },
    {
        "urduURN": 4008140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 820,
        "hadithSanad": "ہم سے محمد بن عبد الرحیم صاعقہ نے بیان کیا ، انہوں نے کہا کہ ہم سے ابو احمد محمد بن عبداللہ زبیری نے کہا کہ ہم سے مسعر بن کدام نے حکم عتیبہ کوفی سے انہوں نے عبدالرحمٰن بن ابی لیلیٰ سے انہوں نے براء بن عازب رضی اللہ عنہ سے انہوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کا سجدہ ، رکوع اور دونوں سجدوں کے درمیان بیٹھنے کی مقدار تقریباً برابر ہوتی تھی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 214,
        "matchingArabicURN": 186240,
        "last_updated": null
    },
    {
        "urduURN": 4008150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 821,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا کہ ہم سے حماد بن زید نے ثابت سے بیان کیا ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے ، انہوں نے فرمایا کہ",
        "hadithText": "میں نے جس طرح نبی کریم صلی اللہ علیہ وسلم کو نماز پڑھتے دیکھا تھا بالکل اسی طرح تم لوگوں کو نماز پڑھانے میں کسی قسم کی کوئی کمی نہیں چھوڑتا ہوں ۔ ثابت نے بیان کیا کہ حضرت انس بن مالک رضی اللہ عنہ ایک ایسا عمل کرتے تھے جسے میں تمہیں کرتے نہیں دیکھتا ۔ جب وہ رکوع سے سر اٹھاتے تو اتنی دیر تک کھڑے رہتے کہ دیکھنے والا سمجھتا کہ بھول گئے ہیں اور اسی طرح دونوں سجدوں کے درمیان اتنی دیر تک بیٹھتے رہتے کہ دیکھنے والا سمجھتا کہ بھول گئے ہیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 215,
        "matchingArabicURN": 186250,
        "last_updated": null
    },
    {
        "urduURN": 4008160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 822,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، انہوں نے کہا ہم سے محمد بن جعفر نے بیان کیا ، انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا ، انہوں نے کہا کہ میں نے قتادہ سے سنا ، انہوں نے انس بن مالک رضی اللہ عنہ سے انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ سجدہ میں اعتدال کو ملحوظ رکھو اور اپنے بازو کتوں کی طرح نہ پھیلایا کرو ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 216,
        "matchingArabicURN": 186260,
        "last_updated": null
    },
    {
        "urduURN": 4008170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 823,
        "hadithSanad": "ہم سے محمد بن صباح نے بیان کیا ، انہوں نے کہا کہ ہمیں ہشیم نے خبر دی ، انہوں نے کہا ہمیں خالد حذاء نے خبر دی ، ابوقلابہ سے ، انہوں نے بیان کیا کہ مجھے مالک بن حویرث لیثی رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "آپ نے نبی کریم صلی اللہ علیہ وسلم کو نماز پڑھتے دیکھا ۔ آپ صلی اللہ علیہ وسلم جب طاق رکعت میں ہوتے تو اس وقت تک نہ اٹھتے جب تک تھوڑی دیر بیٹھ نہ لیتے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 217,
        "matchingArabicURN": 186270,
        "last_updated": null
    },
    {
        "urduURN": 4008180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 824,
        "hadithSanad": "ہم سے معلی بن اسد نے بیان کیا ، انہوں نے کہا کہ ہم سے وہیب نے بیان کیا ، انہوں نے ایوب سختیانی سے ، انہوں نے ابوقلابہ سے ، انہوں نے بیان کیا کہ حضرت مالک بن حویرث رضی اللہ عنہ ہمارے یہاں تشریف لائے اور آپ نے ہماری اس مسجد میں نماز پڑھائی ۔ آپ نے فرمایا کہ",
        "hadithText": "میں نماز پڑھا رہا ہوں لیکن میری نیت کسی فرض کی ادائیگی نہیں ہے بلکہ میں صرف تم کو یہ دکھانا چاہتا ہوں کہ نبی کریم کس طرح نماز پڑھا کرتے تھے ۔ ایوب سختیانی نے بیان کیا کہ میں نے ابوقلابہ سے پوچھا کہ مالک رضی اللہ عنہ کس طرح نماز پڑھتے تھے ؟ تو انہوں نے فرمایا کہ ہمارے شیخ عمرو بن سلمہ کی طرح ۔ ایوب نے بیان کیا کہ شیخ تمام تکبیرات کہتے تھے اور جب دوسرے سجدہ سے سر اٹھاتے تو تھوڑی دیر بیٹھتے اور زمین کا سہارا لے کر پھر اٹھتے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 218,
        "matchingArabicURN": 186280,
        "last_updated": null
    },
    {
        "urduURN": 4008190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 825,
        "hadithSanad": "ہم سے یحییٰ بن صالح نے بیان کیا ، کہا کہ ہم سے فلج بن سلیمان نے ، انہوں نے سعید بن حارث سے ، انہوں نے کہا کہ",
        "hadithText": "ہمیں ابو سعید خدری رضی اللہ عنہ نے نماز پڑھائی اور جب انہوں نے سجدہ سے سر اٹھایا تو پکار کر تکبیر کہی پھر جب سجدہ کیا تو ایسا ہی کیا پھر سجدہ سے سر اٹھایا تو بھی ایسا ہی کیا اسی طرح جب دو رکعتیں پڑھ کر کھڑے ہوئے اس وقت بھی آپ نے بلند آواز سے تکبیر کہی اور فرمایا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو اسی طرح کرتے دیکھا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 219,
        "matchingArabicURN": 186290,
        "last_updated": null
    },
    {
        "urduURN": 4008200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 826,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، انہوں نے کہا کہ ہم سے حماد بن زید نے بیان کیا ، انہوں نے کہا کہ ہم سے غیلان بن جریر نے بیان کیا ، انہوں نے مطرف بن عبداللہ سے ، انہوں نے کہا کہ",
        "hadithText": "میں نے اور عمران بن حصین رضی اللہ عنہما نے علی بن ابی طالب رضی اللہ عنہ کی اقتداء میں نماز پڑھی ۔ آپ نے جب سجدہ کیا ، سجدہ سے سر اٹھایا دو رکعتوں کے بعد کھڑے ہوئے تو ہر مرتبہ تکبیر کہی ۔ جب آپ نے سلام پھیر دیا تو عمران بن حصین نے میرا ہاتھ پکڑ کر کہا کہ انہوں نے واقعی ہمیں حضرت محمد صلی اللہ علیہ وسلم کی طرح نماز پڑھائی ہے یا یہ کہا کہ مجھے انہوں نے حضرت محمد صلی اللہ علیہ وسلم کی نماز یاد دلا دی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 220,
        "matchingArabicURN": 186300,
        "last_updated": null
    },
    {
        "urduURN": 4008210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 827,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، انہوں نے امام مالک رحمہ اللہ سے ، انہوں نے عبدالرحمٰن بن قاسم کے واسطے سے بیان کیا ، انہوں نے عبداللہ بن عبداللہ سے انہوں نے خبر دی کہ",
        "hadithText": "حضرت عبداللہ بن عمر رضی اللہ عنہما کو وہ ہمیشہ دیکھتے کہ آپ نماز میں چارزانو بیٹھتے ہیں میں ابھی نوعمر تھا میں نے بھی اسی طرح کرنا شروع کر دیا لیکن حضرت عبداللہ بن عمر رضی اللہ عنہما نے اس سے روکا اور فرمایا کہ نماز میں سنت یہ ہے کہ ( تشہد میں ) دایاں پاؤں کھڑا رکھے اور بایاں پھیلادے میں نے کہا کہ آپ تو اسی ( میری ) طرح کرتے ہیں آپ بولے کہ ( کمزوری کی وجہ سے ) میرے پاؤں میرا بوجھ نہیں اٹھا پاتے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 221,
        "matchingArabicURN": 186310,
        "last_updated": null
    },
    {
        "urduURN": 4008220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 828,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث نے بیان کیا ، انہوں نے خالد سے بیان کیا ، ان سے سعید نے بیان کیا ، ان سے محمد بن عمرو بن حلحلہ نے بیان کیا ، ان سے محمد بن عمرو بن عطاء نے بیان کیا ( دوسری سند ) اور کہا کہ مجھ سے لیث نے بیان کیا ، اور ان سے یزید بن ابی حبیب اور یزید بن محمد نے بیان کیا ، ان سے محمد بن عمرو بن حلحلہ نے بیان کیا ، ان سے محمد بن عمرو بن عطاء نے بیان کیا کہ",
        "hadithText": "وہ نبی کریم صلی اللہ علیہ وسلم کے چند اصحاب رضوان اللہ علیہم اجمعین کے ساتھ بیٹھے ہوئے تھے کہ نبی کریم صلی اللہ علیہ وسلم کی نماز کا ذکر ہونے لگا تو ابو حمید ساعدی رضی اللہ عنہ نے کہا کہ مجھے نبی کریم صلی اللہ علیہ وسلم کی نماز تم سب سے زیادہ یاد ہے میں نے آپ کو دیکھا کہ جب آپ تکبیر کہتے تو اپنے ہاتھوں کو کندھوں تک لے جاتے ، جب آپ رکوع کرتے تو گھٹنوں کو اپنے ہاتھوں سے پوری طرح پکڑ لیتے اور پیٹھ کو جھکا دیتے ۔ پھر جب رکوع سے سر اٹھاتے تو اس طرح سیدھے کھڑے ہو جاتے کہ تمام جوڑ سیدھے ہو جاتے ۔ جب آپ سجدہ کرتے تو آپ اپنے ہاتھوں کو ( زمین پر ) اس طرح رکھتے کہ نہ بالکل پھیلے ہوئے ہوتے اور نہ سمٹے ہوئے ۔ پاؤں کی انگلیوں کے منہ قبلہ کی طرف رکھتے ۔ جب آپ صلی اللہ علیہ وسلم دو رکعتوں کے بعد بیٹھتے تو بائیں پاؤں پر بیٹھتے اور دایاں پاؤں کھڑا رکھتے اور جب آخری رکعت میں بیٹھتے بائیں پاؤں کو آگے کر لیتے اور دائیں کو کھڑا کر دیتے پھر مقعد پر بیٹھتے ۔ لیث نے یزید بن ابی حبیب سے اور یزید بن محمد بن حلحلہ سے سنا اور محمد بن حلحلہ نے ابن عطاء سے ، اور ابوصالح نے لیث سے «كل فقار مكانه» نقل کیا ہے اور ابن مبارک نے یحییٰ بن ایوب سے بیان کیا انھوں نے کہا کہ مجھ سے یزید بن ابی حبیب نے بیان کیا کہ محمد بن عمرو بن حلحلہ نے ان سے حدیث میں «كل فقار» بیان کیا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 222,
        "matchingArabicURN": 186320,
        "last_updated": null
    },
    {
        "urduURN": 4008230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 829,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، انہوں نے کہا کہ شعیب نے ہمیں خبر دی ، انہوں نے زہری سے خبر دی ، انہوں نے کہا کہ مجھ سے عبدالرحمٰن بن ہرمز نے بیان کیا جو مولی بن عبدالمطلب ( یا مولی ربیعہ بن حارث ) تھے ، کہ عبداللہ بن بحینہ رضی اللہ عنہ جو صحابی رسول اور بنی عبد مناف کے حلیف قبیلہ ازدشنوہ سے تعلق رکھتے تھے ، نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے انہیں ظہر کی نماز پڑھائی اور دو رکعتوں پر بیٹھنے کے بجائے کھڑے ہو گئے ، چنانچہ سارے لوگ بھی ان کے ساتھ کھڑے ہو گئے ، جب نماز ختم ہونے والی تھی اور لوگ آپ صلی اللہ علیہ وسلم کے سلام پھیرنے کا انتظار کر رہے تھے تو آپ صلی اللہ علیہ وسلم نے «الله أكبر‏» کہا اور سلام پھیرنے سے پہلے دو سجدے کئے ، پھر سلام پھیرا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 223,
        "matchingArabicURN": 186330,
        "last_updated": null
    },
    {
        "urduURN": 4008240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 830,
        "hadithSanad": "قتیبہ بن سعید نے بیان کیا ، کہا کہ ہم سے بکر بن مضر نے جعفر بن ربیعہ سے بیان کیا ، انہوں نے اعرج سے بیان کیا ، ان سے عبداللہ بن مالک بن بحینہ رضی اللہ عنہ نے ، کہا کہ",
        "hadithText": "ہمیں رسول اللہ صلی اللہ علیہ وسلم نے نماز ظہر پڑھائی ۔ آپ کو چاہیے تھا بیٹھنا لیکن آپ صلی اللہ علیہ وسلم ( بھول کر ) کھڑے ہو گئے پھر نماز کے آخر میں بیٹھے ہی بیٹھے دو سجدے کئے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 224,
        "matchingArabicURN": 186340,
        "last_updated": null
    },
    {
        "urduURN": 4008250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 831,
        "hadithSanad": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، کہا کہ ہم سے اعمش نے شقیق بن سلمہ سے بیان کیا کہ عبداللہ بن مسعود رضی اللہ عنہما نے فرمایا کہ",
        "hadithText": "جب ہم نبی کریم صلی اللہ علیہ وسلم کے پیچھے نماز پڑھتے تو کہتے ( ترجمہ ) سلام ہو جبرائیل اور میکائیل پر سلام ہو فلاں اور فلاں پر ( اللہ پر سلام ) نبی کریم صلی اللہ علیہ وسلم ایک روز ہماری طرف متوجہ ہوئے اور فرمایا اللہ تو خود ” سلام “ ہے ۔ ( تم اللہ کو کیا سلام کرتے ہو ) اس لیے جب تم میں سے کوئی نماز پڑھے تو یہ کہے «التحيات لله ،‏‏‏‏ والصلوات والطيبات ،‏‏‏‏ السلام عليك أيها النبي ورحمة الله وبركاته ،‏‏‏‏ السلام علينا وعلى عباد الله الصالحين‏» تمام آداب بندگی ، تمام عبادات اور تمام بہترین تعریفیں اللہ کے لیے ہیں ۔ آپ پر سلام ہو اے نبی اور اللہ کی رحمتیں اور اس کی برکتیں ہم پر سلام اور اللہ کے تمام صالح بندوں پر سلام ۔ جب تم یہ کہو گے تو تمہارا سلام آسمان و زمین میں جہاں کوئی اللہ کا نیک بندہ ہے اس کو پہنچ جائے گا ۔ میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں اور گواہی دیتا ہوں کہ محمد اس کے بندے اور رسول ہیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 225,
        "matchingArabicURN": 186350,
        "last_updated": null
    },
    {
        "urduURN": 4008260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 832,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، انہوں نے کہا کہ ہمیں شعیب نے زہری سے خبر دی ، انہوں نے کہا کہ ہمیں عروہ بن زبیر نے خبر دی ، انہیں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ صدیقہ رضی اللہ عنہا نے خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نماز میں یہ دعا پڑھتے تھے «اللهم إني أعوذ بك من عذاب القبر وأعوذ بك من فتنة المسيح الدجال ،‏‏‏‏ وأعوذ بك من فتنة المحيا وفتنة الممات ،‏‏‏‏ اللهم إني أعوذ بك من المأثم والمغرم» اے اللہ قبر کے عذاب سے میں تیری پناہ مانگتا ہوں ۔ زندگی کے اور موت کے فتنوں سے تیری پناہ مانگتا ہوں ۔ دجال کے فتنہ سے تیری پناہ مانگتا ہوں اور اے اللہ میں تیری پناہ مانگتا ہوں گناہوں سے اور قرض سے ۔ کسی ( یعنی ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا ) نے آنحضور صلی اللہ علیہ وسلم سے عرض کی کہ آپ صلی اللہ علیہ وسلم تو قرض سے بہت ہی زیادہ پناہ مانگتے ہیں ! اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب کوئی مقروض ہو جائے تو وہ جھوٹ بولتا ہے اور وعدہ خلاف ہو جاتا ہے ۔\n\nاور اسی سند کے ساتھ زہری سے روایت ہے انہوں نے کہا کہ مجھے عروہ بن زبیر رضی اللہ عنہ نے خبر دی کہ حضرت عائشہ صدیقہ رضی اللہ عنہا نے کہا کہمیں نے رسول اللہ صلی اللہ علیہ وسلم کو نماز میں دجال کے فتنے سے پناہ مانگتے سنا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 226,
        "matchingArabicURN": 186361,
        "last_updated": null
    },
    {
        "urduURN": 4008280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 834,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا کہ ہم سے لیث بن سعد نے یزید بن ابی حبیب سے بیان کیا ، ان سے ابو الخیر مرثد بن عبداللہ نے ان سے عبداللہ بن عمرو رضی اللہ عنہما نے ، ان سے ابوبکر صدیق رضی اللہ عنہ نے کہ",
        "hadithText": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا کہ آپ صلی اللہ علیہ وسلم مجھے کوئی ایسی دعا سکھا دیجئیے جسے میں نماز میں پڑھا کروں ۔ آپ نے فرمایا کہ یہ دعا پڑھا کرو «اللهم إني ظلمت نفسي ظلما كثيرا ولا يغفر الذنوب إلا أنت ،‏‏‏‏ فاغفر لي مغفرة من عندك ،‏‏‏‏ وارحمني إنك أنت الغفور الرحيم» اے اللہ ! میں نے اپنی جان پر ( گناہ کر کے ) بہت زیادہ ظلم کیا پس گناہوں کو تیرے سوا کوئی دوسرا معاف کرنے والا نہیں ۔ مجھے اپنے پاس سے بھرپور مغفرت عطا فرما اور مجھ پر رحم کر کہ مغفرت کرنے والا اور رحم کرنے والا بیشک وشبہ تو ہی ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 227,
        "matchingArabicURN": 186380,
        "last_updated": null
    },
    {
        "urduURN": 4008290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 835,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے اعمش سے بیان کیا ، انہوں نے کہا کہ مجھ سے شقیق نے عبداللہ بن مسعود رضی اللہ عنہما سے بیان کیا ، انہوں نے فرمایا کہ",
        "hadithText": "( پہلے ) جب ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتے تو ہم ( قعدہ میں ) یہ کہا کرتے تھے کہ اس کے بندوں کی طرف سے اللہ پر سلام ہو اور فلاں پر اور فلاں پر سلام ہو ۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ نہ کہو کہ ” اللہ پر سلام ہو “ کیونکہ اللہ تو خود سلام ہے ۔ بلکہ یہ کہو «التحيات لله ،‏‏‏‏ والصلوات والطيبات ،‏‏‏‏ السلام عليك أيها النبي ورحمة الله وبركاته ،‏‏‏‏ السلام علينا وعلى عباد الله الصالحين‏» آداب بندگان اور تمام عبادات اور تمام پاکیزہ خیراتیں اللہ ہی کے لیے ہیں آپ پر اے نبی سلام ہو اور اللہ کی رحمتیں اور برکتیں نازل ہوں ہم پر اور اللہ کے صالح بندوں پر سلام ہو اور جب تم یہ کہو گے تو آسمان پر خدا کے تمام بندوں کو پہنچے گا آپ صلی اللہ علیہ وسلم نے فرمایا کہ آسمان اور زمین کے درمیان تمام بندوں کو پہنچے گا «أشهد أن لا إله إلا الله ،‏‏‏‏ وأشهد أن محمدا عبده ورسوله» میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں اور میں گواہی دیتا ہوں کہ حضرت محمد اس کے بندے اور رسول ہیں ۔ اس کے بعد دعا کا اختیار ہے جو اسے پسند ہو کرے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 228,
        "matchingArabicURN": 186390,
        "last_updated": null
    },
    {
        "urduURN": 4008300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 836,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا کہ ہم سے ہشام دستوائی نے یحییٰ بن ابی کثیر سے بیان کیا ان سے ابوسلمہ بن عبدالرحمٰن نے انہوں نے کہا کہ میں نے ابو سعید خدری رضی اللہ عنہ سے دریافت کیا تو آپ نے بتلایا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو کیچڑ میں سجدہ کرتے ہوئے دیکھا ۔ مٹی کا اثر آپ صلی اللہ علیہ وسلم کی پیشانی پر صاف ظاہر تھا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 229,
        "matchingArabicURN": 186400,
        "last_updated": null
    },
    {
        "urduURN": 4008310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 837,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا کہ ہم سے ابرہیم بن سعد نے بیان کیا ، انہوں نے کہا کہ ہم سے ابن شہاب زہری نے ہند بنت حارث سے حدیث بیان کی کہ ( ام المؤمنین حضرت ) ام سلمہ رضی اللہ عنہ نے فرمایا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم جب ( نماز سے ) سلام پھیرتے تو سلام کے ختم ہوتے ہی عورتیں کھڑی ہو جاتیں ( باہر آنے کے لیے ) اور آپ صلی اللہ علیہ وسلم کھڑے ہونے سے پہلے تھوڑی دیر ٹھہرے رہتے تھے ۔ ابن شہاب رحمہ اللہ نے کہا میں سمجھتا ہوں اور پورا علم تو اللہ ہی کو ہے آپ صلی اللہ علیہ وسلم اس لیے ٹھہر جاتے تھے کہ عورتیں جلدی چلی جائیں اور مرد نماز سے فارغ ہو کر ان کو نہ پائیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 230,
        "matchingArabicURN": 186410,
        "last_updated": null
    },
    {
        "urduURN": 4008320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 838,
        "hadithSanad": "ہم سے حبان بن موسیٰ نے بیان کیا ، کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی ، کہا کہ ہمیں معمر بن راشد نے زہری سے خبر دی ، انہیں محمود بن ربیع انصاری نے انہیں عتبان بن مالک رضی اللہ عنہ نے آپ نے فرمایا کہ",
        "hadithText": "ہم نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی ۔ پھر جب آپ صلی اللہ علیہ وسلم نے سلام پھیرا تو ہم نے بھی سلام پھیرا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 231,
        "matchingArabicURN": 186420,
        "last_updated": null
    },
    {
        "urduURN": 4008330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 839,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی کہا کہ ہمیں معمر نے زہری سے خبر دی کہا کہ مجھے محمود بن ربیع نے خبر دی ، وہ کہتے تھے کہ",
        "hadithText": "مجھے رسول اللہ صلی اللہ علیہ وسلم پوری طرح یاد ہیں اور آپ صلی اللہ علیہ وسلم کا میرے گھر کے ڈول سے کلی کرنا بھی یاد ہے ( جو آپ صلی اللہ علیہ وسلم نے میرے منہ میں ڈالی تھی ) ۔\n\nانہوں نے بیان کیا کہ میں نے عتبان بن مالک انصاری سے سنا ، پھر بنی سالم کے ایک شخص سے اس کی مزید تصدیق ہوئی ۔ عتبان رضی اللہ عنہ نے کہا کہمیں اپنی قوم بنی سالم کی امامت کیا کرتا تھا ۔ میں آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کی کہ حضور میری آنکھ خراب ہو گئی ہے اور ( برسات میں ) پانی سے بھرے ہوئے نالے میرے اور میری قوم کی مسجد کے بیچ میں رکاوٹ بن جاتے ہیں ۔ میں چاہتا ہوں کہ آپ میرے مکان پر تشریف لا کر کسی ایک جگہ نماز ادا فرمائیں تاکہ میں اسے اپنی نماز کے لیے مقرر کر لوں رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ انشاء اللہ تعالیٰ میں تمہاری خواہش پوری کروں گا صبح کو جب دن چڑھ گیا تو نبی کریم صلی اللہ علیہ وسلم تشریف لائے ۔ ابوبکر رضی اللہ عنہ آپ صلی اللہ علیہ وسلم کے ساتھ تھے ۔ آپ صلی اللہ علیہ وسلم نے ( اندر آنے کی ) اجازت چاہی اور میں نے دے دی ۔ آپ صلی اللہ علیہ وسلم بیٹھے نہیں بلکہ پوچھا کہ گھر کے کس حصہ میں نماز پڑھوانا چاہتے ہو ۔ ایک جگہ کی طرف جسے میں نے نماز پڑھنے کے لیے پسند کیا تھا ۔ اشارہ کیا ۔ آپ صلی اللہ علیہ وسلم ( نماز کے لیے ) کھڑے ہوئے اور ہم نے آپ صلی اللہ علیہ وسلم کے پیچھے صف بنائی ۔ پھر آپ صلی اللہ علیہ وسلم نے سلام پھیرا اور جب آپ صلی اللہ علیہ وسلم نے سلام پھیرا تو ہم نے بھی پھیرا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 232,
        "matchingArabicURN": 186431,
        "last_updated": null
    },
    {
        "urduURN": 4008350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 841,
        "hadithSanad": "ہم سے اسحاق بن نصر نے بیان کیا ، انہوں نے کہا کہ ہمیں عبدالرزاق بن ہمام نے خبر دی انہوں نے کہا کہ ہمیں عبدالملک بن جریج نے خبر دی انہوں نے کہا کہ مجھ کو عمرو بن دینار نے خبر دی کہ عبداللہ بن عباس رضی اللہ عنہما کے غلام ابو معبد نے انہیں خبر دی اور انہیں عبداللہ بن عباس رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "بلند آواز سے ذکر ، فرض نماز سے فارغ ہونے پر نبی کریم صلی اللہ علیہ وسلم کے زمانہ مبارک میں جاری تھا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 233,
        "matchingArabicURN": 186450,
        "last_updated": null
    },
    {
        "urduURN": 4008360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 842,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، انہوں نے کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، انہوں نے کہا کہ ہم سے عمرو بن دینار نے بیان کیا ، کہا کہ مجھے ابو معبد نے ابن عباس رضی اللہ عنہما سے خبر دی کہ آپ نے فرمایا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کی نماز ختم ہونے کو تکبیر («الله اكبر») کی وجہ سے سمجھ جاتا تھا ۔ علی بن مدینی نے کہا کہ ہم سے سفیان نے عمرو کے حوالے سے بیان کیا کہ ابومعبد ابن عباس کے غلاموں میں سب سے زیادہ قابل اعتماد تھے ۔ علی بن مدینی نے بتایا کہ ان کا نام نافذ تھا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 234,
        "matchingArabicURN": 186460,
        "last_updated": null
    },
    {
        "urduURN": 4008370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 843,
        "hadithSanad": "ہم سے محمد بن ابی بکر نے بیان کیا ، انہوں نے کہا کہ ہم سے معتمر بن سلیمان نے بیان کیا ، ان سے عبیداللہ عمری نے بیان کیا ، ان سے سمی نے بیان کیا ، ان سے ابوصالح ذکوان نے بیان کیا ان سے ابوہریرہ رضی اللہ عنہ نے فرمایا کہ",
        "hadithText": "نادار لوگ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور کہا کہ امیر و رئیس لوگ بلند درجات اور ہمیشہ رہنے والی جنت حاصل کر چکے حالانکہ جس طرح ہم نماز پڑھتے ہیں وہ بھی پڑھتے ہیں اور جیسے ہم روزے رکھتے ہیں وہ بھی رکھتے ہیں لیکن مال و دولت کی وجہ سے انہیں ہم پر فوقیت حاصل ہے کہ اس کی وجہ سے وہ حج کرتے ہیں ۔ عمرہ کرتے ہیں ۔ جہاد کرتے ہیں اور صدقے دیتے ہیں ( اور ہم محتاجی کی وجہ سے ان کاموں کو نہیں کر پاتے ) اس پر آپ نے فرمایا کہ لو میں تمہیں ایک ایسا عمل بتاتا ہوں کہ اگر تم اس کی پابندی کرو گے تو جو لوگ تم سے آگے بڑھ چکے ہیں انہیں تم پالو گے اور تمہارے مرتبہ تک پھر کوئی نہیں پہنچ سکتا اور تم سب سے اچھے ہو جاؤ گے سوا ان کے جو یہی عمل شروع کر دیں ہر نماز کے بعد تینتیس تینتیس مرتبہ تسبیح «سبحان الله» ، تحمید «الحمد لله» ، تکبیر «الله أكبر» کہا کرو ۔ پھر ہم میں اختلاف ہو گیا کسی نے کہا کہ ہم تسبیح «سبحان الله» تینتیس مرتبہ ، تحمید «الحمد لله» تینتیس مرتبہ اور تکبیر «الله أكبر» چونتیس مرتبہ کہیں گے ۔ میں نے اس پر آپ صلی اللہ علیہ وسلم سے دوبارہ معلوم کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ «سبحان الله» ، «الحمد لله» اور «الله أكبر» کہو تاآنکہ ہر ایک ان میں سے تینتیس مرتبہ ہو جائے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 235,
        "matchingArabicURN": 186470,
        "last_updated": null
    },
    {
        "urduURN": 4008380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 844,
        "hadithSanad": "ہم سے محمد بن یوسف فریابی نے بیان کیا ، انہوں نے کہا کہ ہم سے سفیان ثوری نے عبدالملک بن عمیر سے بیان کیا ، ان سے مغیرہ بن شعبہ کے کاتب وراد نے ، انہوں نے بیان کیا کہ",
        "hadithText": "مجھ سے مغیرہ بن شعبہ رضی اللہ عنہ نے معاویہ رضی اللہ عنہ کو ایک خط میں لکھوایا کہ نبی کریم صلی اللہ علیہ وسلم ہر فرض نماز کے بعد یہ دعا پڑھتے تھے «لا إله إلا الله وحده لا شريك له ،‏‏‏‏ ‏‏‏‏ له الملك ،‏‏‏‏ ‏‏‏‏ وله الحمد ،‏‏‏‏ ‏‏‏‏ وهو على كل شىء قدير ،‏‏‏‏ ‏‏‏‏ اللهم لا مانع لما أعطيت ،‏‏‏‏ ‏‏‏‏ ولا معطي لما منعت ،‏‏‏‏ ‏‏‏‏ ولا ينفع ذا الجد منك الجد» اللہ کے سوا کوئی لائق عبادت نہیں ۔ اس کا کوئی شریک نہیں ۔ بادشاہت اس کی ہے اور تمام تعریف اسی کے لیے ہے ۔ وہ ہر چیز پر قادر ہے ۔ اے اللہ جسے تو دے اس سے روکنے والا کوئی نہیں اور جسے تو نہ دے اسے دینے والا کوئی نہیں اور کسی مالدار کو اس کی دولت و مال تیری بارگاہ میں کوئی نفع نہ پہنچا سکیں گے ۔ شعبہ نے بھی عبدالملک سے اسی طرح روایت کی ہے ۔ حسن نے فرمایا کہ ( حدیث میں لفظ ) «جد» کے معنی مال داری کے ہیں اور حکم ، قاسم بن مخیمرہ سے وہ وراد کے واسطے سے اسی طرح روایت کرتے ہیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 236,
        "matchingArabicURN": 186480,
        "last_updated": null
    },
    {
        "urduURN": 4008390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 845,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا کہ ہم سے جریر بن حازم نے بیان کیا ، انہوں نے کہا کہ ہم سے ابورجاء عمران بن تمیم نے سمرہ بن جندب رضی اللہ عنہ سے نقل کیا ، انہوں نے بتلایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جب نماز ( فرض ) پڑھا چکتے تو ہماری طرف منہ کرتے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 237,
        "matchingArabicURN": 186490,
        "last_updated": null
    },
    {
        "urduURN": 4008400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 846,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، انہوں نے امام مالک سے بیان کیا ، انہوں نے صالح بن کیسان سے بیان کیا ، ان سے عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے بیان کیا ، ان سے زید بن خالد جہنی رضی اللہ عنہ نے بیان کیا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ہمیں حدیبیہ میں صبح کی نماز پڑھائی اور رات کو بارش ہو چکی تھی نماز سے فارغ ہونے کے بعد آپ صلی اللہ علیہ وسلم نے لوگوں کی طرف منہ کیا اور فرمایا معلوم ہے تمہارے رب نے کیا فرمایا ہے ۔ لوگوں نے کہا کہ اللہ اور اس کے رسول خوب جانتے ہیں ( آپ صلی اللہ علیہ وسلم نے فرمایا کہ ) تمہارے رب کا ارشاد ہے کہ صبح ہوئی تو میرے کچھ بندے مجھ پر ایمان لائے ۔ اور کچھ میرے منکر ہوئے جس نے کہا کہ اللہ کے فضل اور اس کی رحمت سے ہمارے لیے بارش ہوئی تو وہ میرا مومن ہے اور ستاروں کا منکر اور جس نے کہا کہ فلاں تارے کے فلانی جگہ پر آنے سے بارش ہوئی وہ میرا منکر ہے اور ستاروں کا مومن ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 238,
        "matchingArabicURN": 186500,
        "last_updated": null
    },
    {
        "urduURN": 4008410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 847,
        "hadithSanad": "ہم سے عبداللہ بن منیر نے بیان کیا ، انہوں نے یزید بن ہارون سے سنا ، انہیں حمید ذیلی نے خبر دی ، اور انہیں انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ایک رات ( عشاء کی ) نماز میں دیر فرمائی تقریباً آدھی رات تک ۔ پھر آخر حجرہ سے باہر تشریف لائے اور نماز کے بعد ہماری طرف منہ کیا اور فرمایا کہ دوسرے لوگ نماز پڑھ کر سو چکے لیکن تم لوگ جب تک نماز کا انتظار کرتے رہے گویا کہ نماز میں رہے ( یعنی تم کو نماز کا ثواب ملتا رہا ) ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 239,
        "matchingArabicURN": 186510,
        "last_updated": null
    },
    {
        "urduURN": 4008420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 848,
        "hadithSanad": "اور ہم سے آدم بن ابی ایاس نے کہا کہ ان سے شعبہ نے بیان کیا ان سے ایوب سختیانی نے ان سے نافع نے ، فرمایا کہ",
        "hadithText": "حضرت عبداللہ بن عمر رضی اللہ عنہما ( نفل ) اسی جگہ پر پڑھتے تھے اور جس جگہ فرض پڑھتے اور قاسم بن محمد بن ابی بکر نے بھی اسی طرح کیا ہے اور ابوہریرہ رضی اللہ عنہ سے مرفوعاً روایت ہے کہ امام اپنی ( فرض پڑھنے کی ) جگہ پر نفل نہ پڑھے اور یہ صحیح نہیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 240,
        "matchingArabicURN": 186520,
        "last_updated": null
    },
    {
        "urduURN": 4008430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 849,
        "hadithSanad": "ہم سے ابوالولیدہشام بن عبدالملک نے بیان کیا ، انہوں نے کہا کہ ہم سے ابراہیم بن سعد نے بیان کیا انہوں نے کہا کہ ہم سے زہری نے ہند بنت حارث سے بیان کیا ان سے ام المؤمنین حضرت ام سلمہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جب سلام پھیرتے تو کچھ دیر اپنی جگہ پر بیٹھے رہتے ۔ ابن شہاب نے کہا اللہ بہتر جانے ہم تو یہ سمجھتے ہیں کہ یہ آپ اس لیے کرتے تھے تاکہ عورتیں پہلے چلی جائیں ۔\n\nاور ابوسعید بن ابی مریم نے کہا کہ ہمیں نافع بن یزید نے خبر دی انہوں نے کہا کہ مجھ سے جعفر بن ربیعہ نے بیان کیا کہ ابن شہاب زہری نے انہیں لکھ بھیجا کہ مجھ سے ہند بنت حارث فراسیہ نے بیان کیا اور ان سے نبی کریم صلی اللہ علیہ وسلم کی پاک بیوی ام سلمہ رضی اللہ عنہا نے ( ہندان کی صحبت میں رہتی تھیں ) انہوں نے فرمایا کہجب نبی کریم صلی اللہ علیہ وسلم سلام پھیرتے تو عورتیں لوٹ کر جانے لگتیں اور نبی کریم صلی اللہ علیہ وسلم کے اٹھنے سے پہلے اپنے گھروں میں داخل ہو چکی ہوتیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 241,
        "matchingArabicURN": 186531,
        "last_updated": null
    },
    {
        "urduURN": 4008450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 851,
        "hadithSanad": "ہم سے محمد بن عبید نے بیان کیا ، کہا کہ ہم سے عیسیٰ بن یونس نے عمر بن سعید سے یہ حدیث بیان کی ، انہوں نے کہا کہ مجھے ابن ابی ملیکہ نے خبر دی ان سے عقبہ بن حارث رضی اللہ عنہ نے فرمایا کہ",
        "hadithText": "میں نے مدینہ میں نبی کریم صلی اللہ علیہ وسلم کی اقتداء میں ایک مرتبہ عصر کی نماز پڑھی ۔ سلام پھیرنے کے بعد آپ صلی اللہ علیہ وسلم جلدی سے اٹھ کھڑے ہوئے اور صفوں کو چیرتے ہوئے آپ صلی اللہ علیہ وسلم اپنی کسی بیوی کے حجرہ میں گئے ۔ لوگ آپ صلی اللہ علیہ وسلم کی اس تیزی کی وجہ سے گھبرا گئے ۔ پھر جب آپ صلی اللہ علیہ وسلم باہر تشریف لائے اور جلدی کی وجہ سے لوگوں کے تعجب کو محسوس فرمایا تو فرمایا کہ ہمارے پاس ایک سونے کا ڈلا ( تقسیم کرنے سے ) بچ گیا تھا مجھے اس میں دل لگا رہنا برا معلوم ہوا ، میں نے اس کے بانٹ دینے کا حکم دے دیا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 242,
        "matchingArabicURN": 186550,
        "last_updated": null
    },
    {
        "urduURN": 4008460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 852,
        "hadithSanad": "ہم سے ابو الولید نے بیان کیا ، انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا ، انہوں نے سلیمان سے بیان کیا ، ان سے عمارہ بن عمیر نے ، ان سے اسود بن یزید نے بیان کیا کہ عبداللہ بن مسعود رضی اللہ عنہ نے فرمایا کہ",
        "hadithText": "کوئی شخص اپنی نماز میں سے کچھ بھی شیطان کا حصہ نہ لگائے اس طرح کہ داہنی طرف ہی لوٹنا اپنے لیے ضروری قرار دے لے ۔ میں نے نبی کریم صلی اللہ علیہ وسلم کو اکثر بائیں طرف سے لوٹتے دیکھا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 243,
        "matchingArabicURN": 186560,
        "last_updated": null
    },
    {
        "urduURN": 4008470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 853,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے ، عبیداللہ بکیری سے بیان کیا ، کہا کہ مجھ سے نافع نے ابن عمر رضی اللہ عنہما سے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے جنگ خیبر کے موقع پر کہا تھا کہ جو شخص اس درخت یعنی لہسن کو کھائے ہوئے ہو اسے ہماری مسجد میں نہ آنا چاہیے ( کچا لہسن یا پیاز کھانا مراد ہے کہ اس سے منہ میں بو پیدا ہو جاتی ہے ) ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 244,
        "matchingArabicURN": 186570,
        "last_updated": null
    },
    {
        "urduURN": 4008480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 854,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا کہ ہم سے ابوعاصم ضحاک بن مخلد نے بیان کیا ، کہا کہ ہمیں ابن جریج نے خبر دی کہا کہ مجھے عطاء بن ابی رباح نے خبر دی کہا کہ میں نے جابر بن عبداللہ انصاری رضی اللہ عنہما سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص یہ درخت کھائے ( آپ کی مراد لہسن سے تھی ) تو وہ ہماری مسجد میں نہ آئے عطاء نے کہا میں نے جابر سے پوچھا کہ آپ کی مراد اس سے کیا تھی ۔ انہوں نے جواب دیا کہ آپ کی مراد صرف کچے لہسن سے تھی ۔ مخلد بن یزید نے ابن جریج کے واسطہ سے ( الانیہ کے بجائے ) الانتنہ نقل کیا ہے ( یعنی آپ صلی اللہ علیہ وسلم کی مراد صرف لہسن کی بدبو سے تھی ) ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 245,
        "matchingArabicURN": 186580,
        "last_updated": null
    },
    {
        "urduURN": 4008490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 855,
        "hadithSanad": "ہم سے سعید بن عفیر نے بیان کیا ، کہا کہ ہم سے ابن وہب نے یونس سے بیان کیا ، ان سے ابن شہاب نے کہ عطاء جابر بن عبداللہ سے روایت کرتے تھے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جو لہسن یا پیاز کھائے ہوئے ہو تو وہ ہم سے دور رہے یا ( یہ کہا کہ اسے ) ہماری مسجد سے دور رہنا چاہیے یا اسے اپنے گھر میں ہی بیٹھنا چاہیے ۔ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ایک ہانڈی لائی گئی جس میں کئی قسم کی ہری ترکاریاں تھیں ۔ ( پیاز یا گندنا بھی ) آپ صلی اللہ علیہ وسلم نے اس میں بو محسوس کی اور اس کے متعلق دریافت کیا ۔ اس سالن میں جتنی ترکاریاں ڈالیں گئی تھیں وہ آپ صلی اللہ علیہ وسلم کو بتا دی گئیں ۔ وہاں ایک صحابی موجود تھے آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کی طرف یہ سالن بڑھا دو ۔ آپ صلی اللہ علیہ وسلم نے اسے کھانا پسند نہیں فرمایا اور فرمایا کہ تم لوگ کھا لو ۔ میری جن سے سرگوشی رہتی ہے تمہاری نہیں رہتی اور احمد بن صالح نے ابن وہب سے یوں نقل کیا کہ تھال آپ صلی اللہ علیہ وسلم کی خدمت میں لائی گئی تھی ۔ ابن وہب نے کہا کہ طبق جس میں ہری ترکاریاں تھیں اور لیث اور ابوصفوان نے یونس سے روایت میں ہانڈی کا قصہ نہیں بیان کیا ہے ۔ امام بخاری رحمہ اللہ نے ( یا سعید یا ابن وہب نے کہا ) میں نہیں کہہ سکتا کہ یہ خود زہری کا قول ہے یا حدیث میں داخل ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 246,
        "matchingArabicURN": 186590,
        "last_updated": null
    },
    {
        "urduURN": 4008500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 856,
        "hadithSanad": "ہم سے ابو معمر نے بیان کیا ، ان سے عبدالوارث بن سعید نے بیان کیا ، ان سے عبد العزیز بن صہیب نے بیان کیا ، کہ حضرت انس بن مالک رضی اللہ عنہ سے ایک شخص نے پوچھا کہ",
        "hadithText": "آپ نے نبی کریم صلی اللہ علیہ وسلم سے لہسن کے بارے میں کیا سنا ہے ۔ انہوں نے بتایا کہ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص اس درخت کو کھائے وہ ہمارے قریب نہ آئے ہمارے ساتھ نماز نہ پڑھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 247,
        "matchingArabicURN": 186600,
        "last_updated": null
    },
    {
        "urduURN": 4008510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 857,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا کہ ہم سے غندر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، انہوں نے سلیمان شیبانی سے سنا ، انہوں نے شعبی سے ، انہوں نے بیان کیا کہ مجھے ایک ایسے شخص نے خبر دی",
        "hadithText": "جو ( ایک مرتبہ ) نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک اکیلی الگ تھلگ ٹوٹی ہوئی قبر پر سے گزر رہے تھے وہاں آنحضرت صلی اللہ علیہ وسلم نے نماز پڑھائی اور لوگ آپ صلی اللہ علیہ وسلم کے پیچھے صف باندھے ہوئے تھے ۔ سلیمان نے کہا کہ میں نے شعبی سے پوچھا کہ ابوعمرو آپ سے یہ کس نے بیان کیا تو انہوں نے کہا کہ ابن عباس رضی اللہ عنہما نے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 248,
        "matchingArabicURN": 186610,
        "last_updated": null
    },
    {
        "urduURN": 4008520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 858,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، انہوں نے کہا کہ ہم سے سفیان نے بیان کیا ، انہوں نے کہا کہ مجھ سے صفوان بن سلیم نے عطاء سے بیان کیا ، ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا",
        "hadithText": "ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جمعہ کے دن ہر بالغ کے لیے غسل ضروری ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 249,
        "matchingArabicURN": 186620,
        "last_updated": null
    },
    {
        "urduURN": 4008530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 859,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہ کہا ہم سے سفیان بن عیینہ نے عمرو بن دینار سے بیان کیا ، کہا کہ مجھے کریب نے خبر دی ابن عباس سے ، انہوں نے بیان کیا کہ",
        "hadithText": "ایک رات میں اپنی خالہ میمونہ رضی اللہ عنہا کے یہاں سویا اور رسول کریم صلی اللہ علیہ وسلم بھی وہاں سو گئے ۔ پھر رات کا ایک حصہ جب گزر گیا آپ صلی اللہ علیہ وسلم کھڑے ہوئے اور ایک لٹکی ہوئی مشک سے ہلکا سا وضو کیا ۔ عمرو ( راوی حدیث نے ) اس وضو کو بہت ہی ہلکا بتلایا ( یعنی اس میں آپ صلی اللہ علیہ وسلم نے بہت کم پانی استعمال فرمایا ) پھر آپ صلی اللہ علیہ وسلم نماز کے لیے کھڑے ہوئے اس کے بعد میں نے بھی اٹھ کر اسی طرح وضو کیا جیسے آپ صلی اللہ علیہ وسلم نے کیا تھا پھر میں آپ صلی اللہ علیہ وسلم کے بائیں طرف کھڑا ہو گیا ۔ لیکن آپ صلی اللہ علیہ وسلم نے مجھے داہنی طرف پھیر دیا پھر اللہ تعالیٰ نے جتنا چاہا آپ صلی اللہ علیہ وسلم نے نماز پڑھی پھر آپ صلی اللہ علیہ وسلم لیٹ رہے پھر سو گئے ۔ یہاں تک کہ آپ صلی اللہ علیہ وسلم خراٹے لینے لگے ۔ آخر مؤذن نے آ کر آپ صلی اللہ علیہ وسلم کو نماز کی خبر دی اور آپ صلی اللہ علیہ وسلم اس کے ساتھ نماز کے لیے تشریف لے گئے اور نماز پڑھائی مگر ( نیا ) وضو نہیں کیا سفیان نے کہا ۔ ہم نے عمرو بن دینار سے کہا کہ لوگ کہتے ہیں کہ ( سوتے وقت ) آپ صلی اللہ علیہ وسلم کی ( صرف ) آنکھیں سوتی تھیں لیکن دل نہیں سوتا تھا ۔ عمرو بن دینار نے جواب دیا کہ میں نے عبید بن عمیر سے سنا وہ کہتے تھے کہ انبیاء کا خواب بھی وحی ہوتا ہے پھر عبید نے اس آیت کی تلاوت کی «إني أرى في المنام أني أذبحك‏» ( ترجمہ ) میں نے خواب دیکھا ہے کہ تمہیں ذبح کر رہا ہوں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 250,
        "matchingArabicURN": 186630,
        "last_updated": null
    },
    {
        "urduURN": 4008540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 860,
        "hadithSanad": "ہم سے اسماعیل بن اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک رحمہ اللہ نے اسحاق بن عبداللہ بن ابی طلحہ سے بیان کیا ، ان سے انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "( ان کی ماں ) اسحاق کی دادی ملیکہ رضی اللہ عنہا نے رسول اللہ صلی اللہ علیہ وسلم کو کھانے پر بلایا جسے انہوں نے آپ صلی اللہ علیہ وسلم کے لیے بطور ضیافت تیار کیا تھا ۔ آپ صلی اللہ علیہ وسلم نے کھانا کھایا پھر فرمایا کہ چلو میں تمہیں نماز پڑھا دوں ۔ ہمارے یہاں ایک بوریا تھا جو پرانا ہونے کی وجہ سے سیاہ ہو گیا تھا ۔ میں نے اسے پانی سے صاف کیا ۔ پھر رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے اور ( پیچھے ) میرے ساتھ یتیم لڑکا ( ضمیرہ بن سعد ) کھڑا ہوا ۔ میری بوڑھی دادی ( ملیکہ ام سلیم ) ہمارے پیچھے کھڑی ہوئیں پھر رسول اللہ صلی اللہ علیہ وسلم نے ہمیں دو رکعت نماز پڑھائی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 251,
        "matchingArabicURN": 186640,
        "last_updated": null
    },
    {
        "urduURN": 4008550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 861,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، ان سے امام مالک نے بیان کیا ، ان سے ابن شہاب زہری نے بیان کیا ، ان سے عبیداللہ بن عبداللہ بن عتبہ نے بیان کیا ، ان سے عبداللہ بن عباس رضی اللہ عنہما نے ، آپ نے فرمایا کہ",
        "hadithText": "میں ایک گدھی پر سوار ہو کر آیا ۔ ابھی میں جوانی کے قریب تھا ( لیکن بالغ نہ تھا ) اور آنحضرت صلی اللہ علیہ وسلم منیٰ میں لوگوں کو نماز پڑھا رہے تھے ۔ آپ صلی اللہ علیہ وسلم کے سامنے دیوار وغیرہ ( آڑ ) نہ تھی ۔ میں صف کے ایک حصے کے آگے سے گزر کر اترا ۔ گدھی چرنے کے لیے چھوڑ دی اور خود صف میں شامل ہو گیا ۔ کسی نے مجھ پر اعتراض نہیں کیا ( حالانکہ میں نابالغ تھا ) ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 252,
        "matchingArabicURN": 186650,
        "last_updated": null
    },
    {
        "urduURN": 4008560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 862,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، انہوں نے کہا کہ ہمیں شعیب نے زہری سے خبر دی ، انہوں نے کہا کہ مجھے عروہ بن زبیر نے خبر دی کہ ام المؤمنین حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک رات عشاء میں دیر کی اور عیاش نے ہم سے عبد الاعلیٰ سے بیان کیا ، انہوں نے کہا کہ ہم سے معمر نے زہری سے بیان کیا ، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم نے عشاء میں ایک مرتبہ دیر کی ۔ یہاں تک کہ حضرت عمر رضی اللہ عنہ نے آواز دی کہ عورتیں اور بچے سو گئے ۔ انہوں نے فرمایا کہ پھر نبی کریم صلی اللہ علیہ وسلم باہر آئے اور فرمایا کہ ( اس وقت ) روئے زمین پر تمہارے سوا اور کوئی اس نماز کو نہیں پڑھتا ، اس زمانہ میں مدینہ والوں کے سوا اور کوئی نماز نہیں پڑھتا تھا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 253,
        "matchingArabicURN": 186660,
        "last_updated": null
    },
    {
        "urduURN": 4008570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 863,
        "hadithSanad": "ہم سے عمرو بن علی فلاس نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا ، کہا کہ ہم سے سفیان ثوری نے بیان کیا ، کہا کہ مجھ سے عبدالرحمٰن بن عابس نے بیان کیا ، کہا کہ میں نے ابن عباس رضی اللہ عنہما سے سنا اور ان سے ایک شخص نے یہ پوچھا تھا کہ",
        "hadithText": "کیا تم نے ( عورتوں کا ) نکلنا عید کے دن آنحضرت صلی اللہ علیہ وسلم کے ساتھ دیکھا ہے ؟ انہوں نے کہا ہاں دیکھا ہے اگر میں آپ کا رشتہ دار عزیز نہ ہوتا تو کبھی نہ دیکھتا ( یعنی میری کم سنی اور قرابت کی وجہ سے آنحضرت صلی اللہ علیہ وسلم مجھ کو اپنے ساتھ رکھتے تھے ) کثیر بن صلت کے مکان کے پاس جو نشان ہے پہلے وہاں آپ صلی اللہ علیہ وسلم تشریف لائے وہاں آپ صلی اللہ علیہ وسلم نے خطبہ سنایا پھر آپ صلی اللہ علیہ وسلم عورتوں کے پاس تشریف لائے اور انہیں بھی وعظ و نصیحت کی ۔ آپ صلی اللہ علیہ وسلم نے ان سے خیرات کرنے کے لیے کہا ، چنانچہ عورتوں نے اپنے چھلے اور انگوٹھیاں اتار اتار کر بلال رضی اللہ عنہ کے کپڑے میں ڈالنی شروع کر دیے ۔ آخر آنحضور صلی اللہ علیہ وسلم بلال رضی اللہ عنہ کے ساتھ گھر تشریف لائے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 254,
        "matchingArabicURN": 186670,
        "last_updated": null
    },
    {
        "urduURN": 4008580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 864,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، کہا کہ ہمیں شعیب نے زہری سے خبر دی ، انہوں نے کہا کہ مجھے عروہ بن زبیر نے عائشہ رضی اللہ عنہا سے بیان کیا ، آپ رضی اللہ عنہ نے فرمایا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ایک مرتبہ عشاء کی نماز میں اتنی دیر کی کہ عمر رضی اللہ عنہ کو کہنا پڑا کہ عورتیں اور بچے سو گئے ۔ پھر نبی کریم صلی اللہ علیہ وسلم ( حجرے سے ) تشریف لائے اور فرمایا کہ دیکھو روئے زمین پر اس نماز کا ( اس وقت ) تمہارے سوا اور کوئی انتظار نہیں کر رہا ہے ۔ ان دنوں مدینہ کے سوا اور کہیں نماز نہیں پڑھی جاتی تھی اور لوگ عشاء کی نماز شفق ڈوبنے کے بعد سے رات کی پہلی تہائی گزرنے تک پڑھا کرتے تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 255,
        "matchingArabicURN": 186680,
        "last_updated": null
    },
    {
        "urduURN": 4008590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 865,
        "hadithSanad": "ہم سے عبیداللہ بن موسیٰ نے حنظلہ بن ابی سفیان سے بیان کیا ، ان سے سالم بن عبداللہ بن عمر نے ، ان سے ان کے باپ ابن عمر رضی اللہ عنہما نے ، وہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے تھے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر تمہاری بیویاں تم سے رات میں مسجد آنے کی اجازت مانگیں تو تم لوگ انہیں اس کی اجازت دے دیا کرو ۔ عبیداللہ کے ساتھ اس حدیث کو شعبہ نے بھی اعمش سے روایت کیا ، انہوں نے مجاہد سے ، انہوں نے ابن عمر رضی اللہ عنہما سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 256,
        "matchingArabicURN": 186690,
        "last_updated": null
    },
    {
        "urduURN": 4008600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 866,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، انہوں نے کہا کہ ہم سے عثمان بن عمر نے بیان کیا ، انہوں نے کہا ہمیں یونس بن یزید نے زہری سے خبر دی ، انہوں نے کہا کہ مجھے ہند بنت حارث نے خبر دی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ام سلمہ رضی اللہ عنہا نے انہیں خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں عورتیں فرض نماز سے سلام پھیرنے کے فوراً بعد ( باہر آنے کے لیے ) اٹھ جاتی تھیں ۔ رسول اللہ صلی اللہ علیہ وسلم اور مرد نماز کے بعد اپنی جگہ بیٹھے رہتے ۔ جب تک اللہ کو منظور ہوتا ۔ پھر جب رسول اللہ صلی اللہ علیہ وسلم اٹھتے تو دوسرے مرد بھی کھڑے ہو جاتے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 257,
        "matchingArabicURN": 186700,
        "last_updated": null
    },
    {
        "urduURN": 4008610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 867,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، انہوں نے امام مالک رحمہ اللہ سے بیان کیا ، ( دوسری سند ) اور ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہیں امام مالک رحمہ اللہ نے یحییٰ بن سعید انصاری سے خبر دی ، انہیں عمرہ بنت عبدالرحمٰن نے ، ان سے حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم صبح کی نماز پڑھ لیتے پھر عورتیں چادریں لپیٹ کر ( اپنے گھروں کو ) واپس ہو جاتی تھیں ۔ اندھیرے سے ان کی پہچان نہ ہو سکتی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 258,
        "matchingArabicURN": 186710,
        "last_updated": null
    },
    {
        "urduURN": 4008620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 868,
        "hadithSanad": "ہم سے محمد بن مسکین نے بیان کیا ، کہا کہ ہم سے بشر بن بکر نے بیان کیا ، کہا کہ ہمیں امام اوزاعی نے خبر دی ، کہا کہ مجھ سے یحییٰ بن ابی کثیر نے بیان کیا ، ان سے عبداللہ بن ابی قتادہ انصاری نے ، ان سے ان کے والد ابوقتادہ انصاری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں نماز کے لیے کھڑا ہوتا ہوں ، میرا ارادہ یہ ہوتا ہے کہ نماز لمبی کروں لیکن کسی بچے کے رونے کی آواز سن کر نماز کو مختصر کر دیتا ہوں کہ مجھے اس کی ماں کو تکلیف دینا برا معلوم ہوتا ہے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 259,
        "matchingArabicURN": 186720,
        "last_updated": null
    },
    {
        "urduURN": 4008630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 869,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا کہ ہمیں امام مالک رحمہ اللہ نے یحییٰ بن سعید سے خبر دی ، ان سے عمرہ بنت عبدالرحمٰن نے ، ان سے حضرت عائشہ رضی اللہ عنہا نے ، انہوں نے فرمایا کہ",
        "hadithText": "آج عورتوں میں جو نئی باتیں پیدا ہو گئی ہیں اگر رسول کریم صلی اللہ علیہ وسلم انہیں دیکھ لیتے تو ان کو مسجد میں آنے سے روک دیتے جس طرح بنی اسرائیل کی عورتوں کو روک دیا گیا تھا ۔ میں نے پوچھا کہ کیا بنی اسرائیل کی عورتوں کو روک دیا گیا تھا ؟ آپ نے فرمایا کہ ہاں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 260,
        "matchingArabicURN": 186730,
        "last_updated": null
    },
    {
        "urduURN": 4008640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 870,
        "hadithSanad": "ہم سے یحییٰ بن قزعہ نے بیان کیا ، انہوں نے کہا کہ ہم سے ابراہیم بن سعد نے بیان کیا ، انہوں نے زہری سے بیان کیا ، ان سے ہند بنت حارث نے بیان کیا ، اس سے ام سلمہ رضی اللہ عنہا نے ، انہوں نے فرمایا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم جب سلام پھیرتے تو آپ صلی اللہ علیہ وسلم کے سلام پھیرتے ہی عورتیں جانے کے لیے اٹھ جاتی تھیں اور آنحضور صلی اللہ علیہ وسلم تھوڑی دیر ٹھہرے رہتے کھٹرے نہ ہوتے ۔ زہری نے کہا کہ ہم یہ سمجھتے ہیں ، آگے اللہ جانے ، یہ اس لیے تھا تاکہ عورتیں مردوں سے پہلے نکل جائیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 261,
        "matchingArabicURN": 186740,
        "last_updated": null
    },
    {
        "urduURN": 4008650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 871,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے ، ان سے حضرت انس رضی اللہ عنہ نے فرمایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ( میری ماں ) ام سلیم کے گھر میں نماز پڑھائی ۔ میں اور یتیم مل کر آپ صلی اللہ علیہ وسلم کے پیچھے کھڑے ہوئے اور ام سلیم رضی اللہ عنہا ہمارے پیچھے تھیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 262,
        "matchingArabicURN": 186750,
        "last_updated": null
    },
    {
        "urduURN": 4008660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 872,
        "hadithSanad": "ہم سے یحییٰ بن موسیٰ نے بیان کیا ، کہا کہ ہم سے سعید بن منصور نے بیان کیا ، کہا کہ ہم سے فلیح بن سلیمان نے عبدالرحمٰن بن قاسم سے بیان کیا ، ان سے اس کے باپ ( قاسم بن محمد بن ابی بکر ) نے ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم صبح کی نماز منہ اندھیرے پڑھتے تھے ۔ مسلمانوں کی عورتیں جب ( نماز پڑھ کر ) واپس ہوتیں تو اندھیرے کی وجہ سے ان کی پہچان نہ ہوتی یا وہ ایک دوسری کو نہ پہچان سکتیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 263,
        "matchingArabicURN": 186760,
        "last_updated": null
    },
    {
        "urduURN": 4008670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 873,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے یزید بن زریع نے بیان کیا ، ان سے معمر نے ، ان سے زہری نے ، ان سے سالم بن عبداللہ بن عمر نے ، ان سے ان کے باپ نے ، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی ہے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب تم میں سے کسی کی بیوی ( نماز پڑھنے کے لیے مسجد میں آنے کی ) اس سے اجازت مانگے تو شوہر کو چاہیے کہ اس کو نہ روکے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 264,
        "matchingArabicURN": 186770,
        "last_updated": null
    },
    {
        "urduURN": 4008680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 874,
        "hadithSanad": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے ، ان سے حضرت انس رضی اللہ عنہ نے فرمایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ( میری ماں ) ام سلیم کے گھر میں نماز پڑھائی ۔ میں اور یتیم مل کر آپ صلی اللہ علیہ وسلم کے پیچھے کھڑے ہوئے اور ام سلیم رضی اللہ عنہا ہمارے پیچھے تھیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 265,
        "matchingArabicURN": 186780,
        "last_updated": null
    },
    {
        "urduURN": 4008690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں («صفة الصلوة»)",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 875,
        "hadithSanad": "ہم سے یحییٰ بن قزعہ نے بیان کیا ، انہوں نے کہا کہ ہم سے ابراہیم بن سعد نے بیان کیا ، انہوں نے زہری سے بیان کیا ، ان سے ہند بنت حارث نے بیان کیا ، ان سے ام سلمہ رضی اللہ عنہا نے ، انہوں نے فرمایا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم جب سلام پھیرتے تو آپ صلی اللہ علیہ وسلم کے سلام پھیرتے ہی عورتیں جانے کے لیے اٹھ جاتی تھیں اور آنحضور صلی اللہ علیہ وسلم تھوڑی دیر ٹھہرے رہتے کھڑے نہ ہوتے ۔ زہری نے کہا کہ ہم یہ سمجھتے ہیں ، آگے اللہ جانے ، یہ اس لیے تھا تاکہ عورتیں مردوں سے پہلے نکل جائیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 266,
        "matchingArabicURN": 186790,
        "last_updated": null
    },
    {
        "urduURN": 4006863,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": "کتاب اذان کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 690,
        "hadithSanad": "",
        "hadithText": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے سفیان ثوری نے ، انھوں نے ابواسحٰق سے جیسے اوپر گزرا ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 184910,
        "last_updated": null
    },
    {
        "urduURN": 4007845,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 11,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 790,
        "hadithSanad": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ابویعفور اکبر سے ، انہوں نے بیان کیا کہ میں نے مصعب بن سعد سے سنا ، انہوں نے کہا کہ",
        "hadithText": "میں نے اپنے والد کے پہلو میں نماز پڑھی اور اپنی دونوں ہتھیلیوں کو ملا کر رانوں کے درمیان رکھ لیا ۔ اس پر میرے باپ نے مجھے ٹوکا اور فرمایا کہ ہم بھی پہلے اسی طرح کرتے تھے ۔ لیکن بعد میں اس سے روک دئیے گئے اور حکم ہوا کہ ہم اپنے ہاتھوں کو گھٹنوں پر رکھیں ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 185,
        "matchingArabicURN": 185940,
        "last_updated": null
    },
    {
        "urduURN": 4007695,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 774,
        "hadithSanad": "عبیداللہ بن عمر نے ثابت رضی اللہ عنہ سے انہوں نے حضرت انس رضی اللہ عنہ سے نقل کیا کہ",
        "hadithText": "انصار میں سے ایک شخص ( کلثوم بن ہدم ) قباء کی مسجد میں لوگوں کی امامت کیا کرتا تھا ۔ وہ جب بھی کوئی سورۃ ( سورۃ الفاتحہ کے بعد ) شروع کرتا تو پہلے «قل هو الله أحد‏» پڑھ لیتا ۔ پھر کوئی دوسری سورۃ پڑھتا ۔ ہر رکعت میں اس کا یہی عمل تھا ۔ اس کے ساتھیوں نے اس سلسلے میں اس پر اعتراض کیا اور کہا کہ تم پہلے یہ سورۃ پڑھتے ہو اور صرف اسی کو کافی خیال نہیں کرتے بلکہ دوسری سورۃ بھی ( اس کے ساتھ ) ضرور پڑھتے ہو ۔ یا تو تمہیں صرف اسی کو پڑھنا چاہئے ورنہ اسے چھوڑ دینا چاہئے اور بجائے اس کے کوئی دوسری سورۃ پڑھنی چاہئے ۔ اس شخص نے کہا کہ میں اسے نہیں چھوڑ سکتا اب اگر تمہیں پسند ہے کہ میں تمہیں نماز پڑھاؤں تو برابر پڑھتا رہوں گا ورنہ میں نماز پڑھانا چھوڑ دوں گا ۔ لوگ سمجھتے تھے کہ یہ ان سب سے افضل ہیں اس لیے وہ نہیں چاہتے تھے کہ ان کے علاوہ کوئی اور شخص نماز پڑھائے ۔ جب نبی کریم صلی اللہ علیہ وسلم تشریف لائے تو ان لوگوں نے آپ کو واقعہ کی خبر دی ۔ آپ صلی اللہ علیہ وسلم نے ان کو بلا کر پوچھا کہ اے فلاں ! تمہارے ساتھی جس طرح کہتے ہیں اس پر عمل کرنے سے تم کو کون سی رکاوٹ ہے اور ہر رکعت میں اس سورۃ کو ضروری قرار دے لینے کا سبب کیا ہے ۔ انھوں نے کہا کہ حضور ! میں اس سورۃ سے محبت رکھتا ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس سورۃ کی محبت تمہیں جنت میں لے جائے گی ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 169,
        "matchingArabicURN": 185780,
        "last_updated": null
    },
    {
        "urduURN": 4007305,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 10,
        "bookName": null,
        "babNumber": null,
        "babName": "",
        "hadithNumber": 735,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، انہوں نے امام مالک سے ، انہوں نے ابن شہاب زہری سے ، انہوں نے سالم بن عبداللہ سے ، انہوں نے اپنے باپ ( عبداللہ بن عمر رضی اللہ عنہما ) سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نماز شروع کرتے وقت اپنے دونوں ہاتھوں کو کندھوں تک اٹھاتے ، اسی طرح جب رکوع کے لیے «الله اكبر» کہتے اور جب اپنا سر رکوع سے اٹھاتے تو دونوں ہاتھ بھی اٹھاتے ( رفع یدین کرتے ) اور رکوع سے سرمبارک اٹھاتے ہوئے «سمع الله لمن حمده ،‏‏‏‏ ‏‏‏‏ ربنا ولك الحمد» کہتے تھے ۔ سجدہ میں جاتے وقت رفع یدین نہیں کرتے تھے ۔</b>",
        "bookID": "10.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 129,
        "matchingArabicURN": 185380,
        "last_updated": null
    }
]