[
    {
        "urduURN": 4009880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 14,
        "bookName": "کتاب نماز وتر کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 991,
        "hadithSanad": "اور اسی سند کے ساتھ نافع سے روایت ہے کہ",
        "hadithText": "عبداللہ بن عمر رضی اللہ عنہما وتر کی جب تین رکعتیں پڑھتے تو دو رکعت پڑھ کر سلام پھیرتے یہاں تک کہ ضرورت سے بات بھی کرتے ۔</b>",
        "bookID": "14.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 108770,
        "last_updated": null
    },
    {
        "urduURN": 4009890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 14,
        "bookName": "کتاب نماز وتر کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 992,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، ان سے امام مالک نے بیان کیا ، ان سے مخرمہ بن سلیمان نے بیان کیا ، ان سے کریب نے اور انہیں حضرت عبداللہ بن عباس رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "آپ ایک رات اپنی خالہ ام المؤمنین میمونہ رضی اللہ عنہا کے یہاں سوئے ( آپ رضی اللہ عنہ نے کہا کہ ) میں تکیہ کے عرض میں لیٹ گیا اور رسول اللہ صلی اللہ علیہ وسلم اور آپ کی بیوی لمبائی میں لیٹیں ، آپ صلی اللہ علیہ وسلم سو گئے جب آدھی رات گزر گئی یا اس کے لگ بھگ تو آپ صلی اللہ علیہ وسلم بیدار ہوئے نیند کے اثر کو چہرہ مبارک پر ہاتھ پھیر کر آپ صلی اللہ علیہ وسلم نے دور کیا ۔ اس کے بعد آل عمران کی دس آیتیں پڑھیں ۔ پھر ایک پرانی مشک پانی کی بھری ہوئی لٹک رہی تھی ۔ آپ صلی اللہ علیہ وسلم اس کے پاس گئے اور اچھی طرح وضو کیا اور نماز کے لیے کھڑے ہو گئے ۔ میں نے بھی ایسا ہی کیا ۔ آپ صلی اللہ علیہ وسلم پیار سے اپنا داہنا ہاتھ میرے سر رکھ کر اور میرا کان پکڑ کر اسے ملنے لگے ۔ پھر آپ صلی اللہ علیہ وسلم نے دو رکعت نماز پڑھی ، پھر دو رکعت ، پھر دو رکعت ، پھر دو رکعت ، پھر دو رکعت ، پھر دو رکعت سب بارہ رکعتیں پھر ایک رکعت وتر پڑھ کر آپ صلی اللہ علیہ وسلم لیٹ گئے ، یہاں تک کہ مؤذن صبح صادق کی اطلاع دینے آیا تو آپ صلی اللہ علیہ وسلم نے پھر کھڑے ہو کر دو رکعت سنت نماز پڑھی ۔ پھر باہر تشریف لائے اور صبح کی نماز پڑھائی ۔</b>",
        "bookID": "14.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 108780,
        "last_updated": null
    },
    {
        "urduURN": 4009900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 14,
        "bookName": "کتاب نماز وتر کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 993,
        "hadithSanad": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، انہوں نے کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا ، انہوں نے کہا کہ ہمیں عمرو بن حارث نے خبر دی ، ان سے عبدالرحمٰن بن قاسم نے اپنے باپ قاسم سے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، رات کی نماز دو ، دو رکعتیں ہے اور جب تو ختم کرنا چاہے تو ایک رکعت وتر پڑھ لے جو ساری نماز کو طاق بنا دے گی ۔ قاسم بن محمد نے بیان کیا کہ ہم نے بہت سوں کو تین رکعت وتر پڑھتے بھی پایا ہے اور تین یا ایک ( رکعت وتر ) سب جائز اور مجھ کو امید ہے کہ کسی میں قباحت نہ ہو گی ۔</b>",
        "bookID": "14.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 108790,
        "last_updated": null
    },
    {
        "urduURN": 4009910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 14,
        "bookName": "کتاب نماز وتر کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 994,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا کہ ہمیں شعیب نے زہری سے خبر دی ، انہوں نے کہا کہ مجھ سے عروہ بن زبیر نے بیان کیا کہ حضرت عائشہ رضی اللہ عنہا نے انہیں خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم گیارہ رکعتیں ( وتر اور تہجد کی ) پڑھتے تھے ، آپ صلی اللہ علیہ وسلم کی یہی نماز تھی ۔ مراد ان کی رات کی نماز تھی ۔ آپ صلی اللہ علیہ وسلم کا سجدہ ان رکعتوں میں اتنا لمبا ہوتا تھا کہ سر اٹھانے سے پہلے تم میں سے کوئی شخص بھی پچاس آیتیں پڑھ سکتا اور فجر کی نماز فرض سے پہلے آپ صلی اللہ علیہ وسلم سنت دو رکعتیں پڑھتے تھے اس کے بعد ( ذرا دیر ) داہنے پہلو پر لیٹ رہتے یہاں تک کہ مئوذن بلانے کے لئے آپ صلی اللہ علیہ وسلم کے پاس آتا ۔</b>",
        "bookID": "14.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 108800,
        "last_updated": null
    },
    {
        "urduURN": 4009920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 14,
        "bookName": "کتاب نماز وتر کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 995,
        "hadithSanad": "ہم سے ابو نعمان نے بیان کیا ، کہا کہ ہم سے حماد بن زید نے بیان کیا ، کہا کہ ہم سے انس بن سیرین نے بیان کیا ، کہا کہ میں نے ابن عمر رضی اللہ عنہما سے پوچھا کہ",
        "hadithText": "نماز صبح سے پہلے کی دو رکعتوں کے متعلق آپ کا کیا خیال ہے ؟ کیا میں ان میں لمبی قرآت کر سکتا ہوں ؟ انہوں نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم تو رات کی نماز ( تہجد ) دو ، دو رکعت کر کے پڑھتے تھے پھر ایک رکعت پڑھ کر ان کو طاق بنا لیتے اور صبح کی نماز سے پہلے کی دو رکعتیں ( سنت فجر تو ) اس طرح پڑھتے گویا اذان ( اقامت ) کی آواز آپ کے کان میں پڑ رہی ہے ۔ حماد کی اس سے مراد یہ ہے کہ آپ جلدی پڑھ لیتے ۔</b>",
        "bookID": "14.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 108810,
        "last_updated": null
    },
    {
        "urduURN": 4009930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 14,
        "bookName": "کتاب نماز وتر کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 996,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا کہ مجھ سے میرے باپ نے بیان کیا ، انہوں نے کہا کہ ہم سے اعمش نے بیان کیا ، کہا کہ مجھ سے مسلم بن کیسان نے بیان کیا ، ان سے مسروق نے ، ان سے حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے رات کے ہر حصہ میں بھی وتر پڑھی ہے اور آخیر میں آپ صلی اللہ علیہ وسلم کا وتر صبح کے قریب پہنچا ۔</b>",
        "bookID": "14.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 108820,
        "last_updated": null
    },
    {
        "urduURN": 4009940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 14,
        "bookName": "کتاب نماز وتر کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 997,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے ہشام بن عروہ نے بیان کیا ، کہا کہ مجھ سے میرے باپ نے عائشہ رضی اللہ عنہا سے بیان کیا کہ",
        "hadithText": "آپ نے فرمایا نبی کریم صلی اللہ علیہ وسلم ( تہجد کی ) نماز پڑھتے رہتے اور میں آپ صلی اللہ علیہ وسلم کے بستر پر عرض میں لیٹی رہتی ۔ جب وتر پڑھنے لگتے تو مجھے بھی جگا دیتے اور میں بھی وتر پڑھ لیتی ۔</b>",
        "bookID": "14.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 108830,
        "last_updated": null
    },
    {
        "urduURN": 4009950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 14,
        "bookName": "کتاب نماز وتر کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 998,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید نے بیان کیا ، ان سے عبیداللہ عمری نے ان سے نافع نے عبداللہ بن عمر رضی اللہ عنہما سے بیان کیا",
        "hadithText": "اور ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ وتر رات کی تمام نمازوں کے بعد پڑھا کرو ۔</b>",
        "bookID": "14.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 108840,
        "last_updated": null
    },
    {
        "urduURN": 4009960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 14,
        "bookName": "کتاب نماز وتر کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 999,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، انہوں نے کہا کہ ہم سے امام مالک نے بیان کیا ، انہوں نے ابوبکر بن عمر بن عبدالرحمٰن بن عبداللہ بن عمر بن خطاب سے بیان کیا اور ان کو سعید بن یسار نے بتلایا کہ",
        "hadithText": "میں عبداللہ بن عمر رضی اللہ عنہما کے ساتھ مکہ کے راستے میں تھا ۔ سعید نے کہا کہ جب راستے میں مجھے طلوع فجر کا خطرہ ہوا تو سواری سے اتر کر میں نے وتر پڑھ لیا اور پھر عبداللہ بن عمر رضی اللہ عنہما سے جا ملا ۔ آپ نے پوچھا کہ کہاں رک گئے تھے ؟ میں نے کہا کہ اب صبح کا وقت ہونے ہی والا تھا اس لیے میں سواری سے اتر کر وتر پڑھنے لگا ۔ اس پر حضرت عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ کیا تمہارے لیے نبی کریم صلی اللہ علیہ وسلم کا عمل اچھا نمونہ نہیں ہے ۔ میں نے عرض کیا کیوں نہیں بیشک ہے ۔ آپ نے بتلایا کہ نبی کریم صلی اللہ علیہ وسلم تو اونٹ ہی پر وتر پڑھ لیا کرتے تھے ۔</b>",
        "bookID": "14.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 108850,
        "last_updated": null
    },
    {
        "urduURN": 4009970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 14,
        "bookName": "کتاب نماز وتر کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1000,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے جویریہ بن اسماء نے بیان کیا ، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم سفر میں اپنی سواری ہی پر رات کی نماز اشاروں سے پڑھ لیتے تھے خواہ سواری کا رخ کسی طرف ہو جاتا آپ صلی اللہ علیہ وسلم اشاروں سے پڑھتے رہتے مگر فرائض اس طرح نہیں پڑھتے تھے اور وتر اپنی اونٹنی پر پڑھ لیتے ۔</b>",
        "bookID": "14.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 108860,
        "last_updated": null
    },
    {
        "urduURN": 4009980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 14,
        "bookName": "کتاب نماز وتر کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1001,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب سختیانی نے ان سے محمد بن سیرین نے ، انہوں نے کہا کہ انس بن مالک رضی اللہ عنہ سے پوچھا گیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے صبح کی نماز میں قنوت پڑھا ہے ؟ آپ نے فرمایا کہ ہاں پھر پوچھا گیا کہ کیا رکوع سے پہلے ؟ تو آپ نے فرمایا کہ رکوع کے بعد تھوڑے دنوں تک ۔</b>",
        "bookID": "14.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 108870,
        "last_updated": null
    },
    {
        "urduURN": 4009990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 14,
        "bookName": "کتاب نماز وتر کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1002,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے عبدالواحد بن زیاد نے بیان کیا ، کہا کہ ہم سے عاصم بن سلیمان نے بیان کیا ، انہوں نے کہا کہ",
        "hadithText": "میں نے انس بن مالک رضی اللہ عنہ سے قنوت کے بارے میں پوچھا تو آپ نے فرمایا کہ دعائے قنوت ( حضور اکرم صلی اللہ علیہ وسلم کے دور میں ) پڑھی جاتی تھی ۔ میں نے پوچھا کہ رکوع سے پہلے یا اس کے بعد ؟ آپ نے فرمایا کہ رکوع سے پہلے ۔ عاصم نے کہا کہ آپ ہی کے حوالے سے فلاں شخص نے خبر دی ہے کہ آپ نے رکوع کے بعد فرمایا تھا ۔ اس کا جواب حضرت انس نے یہ دیا کہ انہوں نے غلط سمجھا ۔ رسول اللہ صلی اللہ علیہ وسلم نے رکوع کے بعد صرف ایک مہینہ دعائے قنوت پڑھی تھی ۔ ہوا یہ تھا کہ آپ صلی اللہ علیہ وسلم نے صحابہ میں سے ستر قاریوں کے قریب مشرکوں کی ایک قوم ( بنی عامر ) کی طرف سے ان کو تعلیم دینے کے لیے بھیجے تھے ، یہ لوگ ان کے سوا تھے جن پر آپ نے بددعا کی تھی ۔ ان میں اور آنحضرت صلی اللہ علیہ وسلم کے درمیان عہد تھا ، لیکن انہوں نے عہد شکنی کی ( اور قاریوں کو مار ڈالا ) تو آنحضرت صلی اللہ علیہ وسلم ایک مہینہ تک ( رکوع کے بعد ) قنوت پڑھتے رہے ان پر بددعا کرتے رہے ۔</b>",
        "bookID": "14.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 108880,
        "last_updated": null
    },
    {
        "urduURN": 4010000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 14,
        "bookName": "کتاب نماز وتر کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1003,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، کہا کہ ہم سے زائدہ نے بیان کیا ، ان سے تیمی نے ، ان سے ابو مجلز نے ، ان سے انس بن مالک رضی اللہ عنہ کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک مہینہ تک دعا قنوت پڑھی اور اس میں قبائل رعل و ذکوان پر بددعا کی تھی ۔</b>",
        "bookID": "14.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 108890,
        "last_updated": null
    },
    {
        "urduURN": 4010010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 14,
        "bookName": "کتاب نماز وتر کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1004,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہمیں اسماعیل بن علیہ نے خبر دی ، کہا کہ ہمیں خالد حذاء نے خبر دی ، انہیں ابوقلابہ نے ، انہیں انس بن مالک رضی اللہ عنہ نے ، آپ نے فرمایا کہ",
        "hadithText": "آنحضور صلی اللہ علیہ وسلم کے عہد میں قنوت مغرب اور فجر میں پڑھی جاتی تھی ۔</b>",
        "bookID": "14.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 108900,
        "last_updated": null
    },
    {
        "urduURN": 4009875,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 14,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 990,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا کہ ہمیں امام مالک رحمہ اللہ نے نافع اور عبداللہ ابن دینار سے خبر دی اور انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "ایک شخص نے نبی کریم صلی اللہ علیہ وسلم سے رات میں نماز کے متعلق معلوم کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ رات کی نماز دو دو رکعت ہے پھر جب کوئی صبح ہو جانے سے ڈرے تو ایک رکعت پڑھ لے ، وہ اس کی ساری نماز کو طاق بنا دے گی ۔</b>",
        "bookID": "14.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 108760,
        "last_updated": null
    }
]