[
    {
        "urduURN": 4010620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 17,
        "bookName": "کتاب سجود قرآن کے مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1068,
        "hadithSanad": "ہم سے محمد بن یوسف فریابی نے بیان کیا ، انہوں نے کہا کہ ہم سے سفیان ثوری نے بیان کیا ، انہوں نے سعد بن ابراہیم بن عبدالرحمٰن بن عوف سے بیان کیا ، ان سے عبدالرحمٰن بن ہرمز اعرج نے ، ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جمعہ کے دن فجر کی نماز میں «الم تنزيل‏ السجدة» اور «هل أتى على الإنسان‏» ( سورۃ دھر ) پڑھا کرتے تھے ۔</b>",
        "bookID": "17.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 109540,
        "last_updated": null
    },
    {
        "urduURN": 4010630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 17,
        "bookName": "کتاب سجود قرآن کے مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1069,
        "hadithSanad": "ہم سے سلیمان بن حرب اور ابوالنعمان بن فضل نے بیان کیا ، ان دونوں نے کہا کہ ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب نے بیان کیا ، ان سے عکرمہ نے بیان کیا اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے فرمایا کہ",
        "hadithText": "سورۃ ص کا سجدہ کچھ تاکیدی سجدوں میں سے نہیں ہے اور میں نے نبی کریم صلی اللہ علیہ وسلم کو سجدہ کرتے ہوئے دیکھا ۔</b>",
        "bookID": "17.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 109550,
        "last_updated": null
    },
    {
        "urduURN": 4010640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 17,
        "bookName": "کتاب سجود قرآن کے مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1070,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، کہا کہ ہم سے شعبہ نے ، ابواسحاق سے بیان کیا ، ان سے اسود نے ، ان سے عبداللہ بن مسعود رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے سورۃ النجم کی تلاوت کی اور اس میں سجدہ کیا اس وقت قوم کا کوئی فرد ( مسلمان اور کافر ) بھی ایسا نہ تھا جس نے سجدہ نہ کیا ہو ۔ البتہ ایک شخص ( امیہ بن خلف ) نے ہاتھ میں کنکری یا مٹی لے کر اپنے چہرہ تک اٹھائی اور کہا کہ میرے لیے یہی کافی ہے ۔ عبداللہ بن مسعود رضی اللہ عنہما نے کہا کہ بعد میں میں نے دیکھا کہ وہ کفرکی حالت ہی میں قتل ہوا ۔</b>",
        "bookID": "17.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 109560,
        "last_updated": null
    },
    {
        "urduURN": 4010650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 17,
        "bookName": "کتاب سجود قرآن کے مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1071,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے عبدالوارث نے بیان کیا ، کہا ہم سے ایوب سختیانی نے بیان کیا ، ان سے عکرمہ نے ، ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے سورۃ النجم میں سجدہ کیا تو مسلمانوں ، مشرکوں اور جن و انس سب نے آپ صلی اللہ علیہ وسلم کے ساتھ سجدہ کیا ۔ اس حدیث کی روایت ابراہیم بن طہمان نے بھی ایوب سختیانی سے کی ہے ۔</b>",
        "bookID": "17.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 109570,
        "last_updated": null
    },
    {
        "urduURN": 4010660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 17,
        "bookName": "کتاب سجود قرآن کے مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1072,
        "hadithSanad": "ہم سے سلیمان بن داؤد ابوالربیع نے بیان کیا ، انہوں نے کہا کہ ہم سے اسماعیل بن جعفر نے بیان کیا ، کہا کہ ہمیں یزید بن خصیفہ نے خبر دی ، انہیں ( یزید بن عبداللہ ) ابن قسیط نے ، اور انہیں عطاء بن یسار نے کہ",
        "hadithText": "انہوں نے زید بن ثابت رضی اللہ عنہ سے سوال کیا ۔ آپ نے یقین کے ساتھ اس امر کا اظہار کیا کہ نبی کریم صلی اللہ علیہ وسلم کے سامنے سورۃ النجم کی تلاوت آپ نے کی تھی اور آنحضور صلی اللہ علیہ وسلم نے اس میں سجدہ نہیں کیا ۔</b>",
        "bookID": "17.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 109580,
        "last_updated": null
    },
    {
        "urduURN": 4010670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 17,
        "bookName": "کتاب سجود قرآن کے مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1073,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے ابن ابی ذئب نے بیان کیا ، کہا کہ ہم سے یزید بن عبداللہ بن قسیط نے بیان کیا ، ان سے عطاء بن یسار نے ، ان سے زید بن ثابت رضی اللہ عنہ نے کہا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کے سامنے سورۃ النجم کی تلاوت کی اور آپ صلی اللہ علیہ وسلم نے اس میں سجدہ نہیں کیا ۔</b>",
        "bookID": "17.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 109590,
        "last_updated": null
    },
    {
        "urduURN": 4010680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 17,
        "bookName": "کتاب سجود قرآن کے مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1074,
        "hadithSanad": "ہم سے مسلم بن ابراہیم اور معاذ بن فضالہ نے بیان کیا ، انہوں نے کہا کہ ہم سے ہشام بن ابی عبداللہ دستوائی نے بیان کیا ، ان سے یحییٰ بن ابی کثیر نے ، ان سے ابوسلمہ نے کہا کہ",
        "hadithText": "میں نے ابوہریرہ رضی اللہ عنہ کو سورۃ «إذا السماء انشقت‏» پڑھتے دیکھا ۔ آپ نے اس میں سجدہ کیا میں نے کہا کہ اے ابوہریرہ ! کیا میں نے آپ کو سجدہ کرتے ہوئے نہیں دیکھا ہے ۔ آپ نے کہا کہ اگر میں نبی کریم صلی اللہ علیہ وسلم کو سجدہ کرتے نہ دیکھتا تو میں بھی نہ کرتا ۔</b>",
        "bookID": "17.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 109600,
        "last_updated": null
    },
    {
        "urduURN": 4010690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 17,
        "bookName": "کتاب سجود قرآن کے مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1075,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے یحیی بن سعید قطان نے بیان کیا ، کہا کہ ہم سے عبیداللہ عمری نے بیان کیا کہا کہ ہم سے نافع نے بیان کیا ان سے ابن عمر رضی اللہ عنہما نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ہماری موجودگی میں آیت سجدہ پڑھتے اور سجدہ کرتے تو ہم بھی آپ صلی اللہ علیہ وسلم کے ساتھ ( ہجوم کی وجہ سے ) اس طرح سجدہ کرتے کہ پیشانی رکھنے کی جگہ بھی نہ ملتی جس پر سجدہ کرتے ۔</b>",
        "bookID": "17.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 109610,
        "last_updated": null
    },
    {
        "urduURN": 4010700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 17,
        "bookName": "کتاب سجود قرآن کے مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1076,
        "hadithSanad": "ہم سے بشر بن آدم نے بیان کیا ، کہا کہ ہم سے علی بن مسہر نے بیان کیا ، کہا کہ ہمیں عبیداللہ عمری نے خبر دی ، انہیں نافع نے اور نافع کو ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم آیت سجدہ کی تلاوت اگر ہماری موجودگی میں کرتے تو آپ صلی اللہ علیہ وسلم کے ساتھ ہم بھی سجدہ کرتے تھے ۔ اس وقت اتنا اژدھام ہو جاتا کہ سجدہ کے لیے پیشانی رکھنے کی جگہ نہ ملتی جس پر سجدہ کرنے والا سجدہ کر سکے ۔</b>",
        "bookID": "17.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 109620,
        "last_updated": null
    },
    {
        "urduURN": 4010710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 17,
        "bookName": "کتاب سجود قرآن کے مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1077,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، انہوں نے کہا کہ ہمیں ہشام بن یوسف نے خبر دی اور انہیں ابن جریج نے خبر دی ، انہوں نے کہا کہ مجھے ابوبکر بن ابی ملیکہ نے خبر دی ، انہیں عثمان بن عبدالرحمٰن تیمی نے اور انہیں ربیعہ بن عبداللہ بن ہدیر تیمی نے کہا ۔ ۔ ۔ ابوبکر بن ابی ملیکہ نے بیان کیا کہ",
        "hadithText": "ربیعہ بہت اچھے لوگوں میں سے تھے ربیعہ نے وہ حال بیان کیا جو حضرت عمر بن خطاب رضی اللہ عنہ کی مجلس میں انہوں نے دیکھا ۔ حضرت عمر رضی اللہ عنہ نے جمعہ کے دن منبر پر سورۃ النحل پڑھی جب سجدہ کی آیت ( « ولله يسجد ما في السمٰوٰت » ) آخر تک پہنچے تو منبر پر سے اترے اور سجدہ کیا تو لوگوں نے بھی ان کے ساتھ سجدہ کیا ۔ دوسرے جمعہ کو پھر یہی سورت پڑھی جب سجدہ کی آیت پر پہنچے تو کہنے لگے لوگو ! ہم سجدہ کی آیت پڑھتے چلے جاتے ہیں پھر جو کوئی سجدہ کرے اس نے اچھا کیا اور جو کوئی نہ کرے تو اس پر کچھ گناہ نہیں اور حضرت عمر رضی اللہ عنہ نے سجدہ نہیں کیا اور نافع نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے نقل کیا کہ اللہ تعالیٰ نے سجدہ تلاوت فرض نہیں کیا ہماری خوشی پر رکھا ۔</b>",
        "bookID": "17.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 109630,
        "last_updated": null
    },
    {
        "urduURN": 4010720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 17,
        "bookName": "کتاب سجود قرآن کے مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1078,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے معتمر بن سلیمان نے بیان کیا ، کہا کہ میں نے اپنے باپ سے سنا کہا کہ ہم سے بکر بن عبداللہ مزنی نے بیان کیا ، ان سے ابورافع نے کہا کہ",
        "hadithText": "میں نے ابوہریرہ رضی اللہ عنہ کے ساتھ نماز عشاء پڑھی ۔ آپ نے «إذا السماء انشقت‏» کی تلاوت کی اور سجدہ کیا ۔ میں نے عرض کیا کہ آپ نے یہ کیا کیا ؟ انہوں نے اس کا جواب دیا کہ میں نے اس میں ابوالقاسم صلی اللہ علیہ وسلم کی اقتداء میں سجدہ کیا تھا اور ہمیشہ سجدہ کرتا ہوں گا تاآنکہ آپ صلی اللہ علیہ وسلم سے جا ملوں ۔</b>",
        "bookID": "17.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 109640,
        "last_updated": null
    },
    {
        "urduURN": 4010730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 17,
        "bookName": "کتاب سجود قرآن کے مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1079,
        "hadithSanad": "ہم سے صدقہ بن فضل نے بیان کیا ، ان سے یحیی بن سعیدقطان نے بیان کیا ، ان سے عبیداللہ نے ، ان سے نافع نے ، اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کسی ایسی سورۃ کی تلاوت کرتے جس میں سجدہ ہوتا پھر آپ صلی اللہ علیہ وسلم سجدہ کرتے اور ہم بھی آپ صلی اللہ علیہ وسلم کے ساتھ سجدہ کرتے یہاں تک کہ ہم میں کسی کو اپنی پیشانی رکھنے کی جگہ نہ ملتی ۔ ( معلوم ہوا کہ ایسی حالت میں سجدہ نہ کیا جائے تو کوئی حرج نہیں ہے ) «والله أعلم» ۔</b>",
        "bookID": "17.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 109650,
        "last_updated": null
    },
    {
        "urduURN": 4010615,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 17,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1067,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے غندر محمد بن جعفر نے بیان کیا کہا کہ ہم سے شعبہ نے بیان کیا اور ان سے ابواسحاق نے انہوں نے کہا کہ میں نے اسود سے سنا انہوں نے عبداللہ بن مسعود رضی اللہ عنہما سے کہ",
        "hadithText": "مکہ میں نبی کریم صلی اللہ علیہ وسلم نے سورۃ النجم کی تلاوت کی اور سجدہ تلاوت کیا آپ صلی اللہ علیہ وسلم کے پاس جتنے آدمی تھے ( مسلمان اور کافر ) ان سب نے بھی آپ صلی اللہ علیہ وسلم کے ساتھ سجدہ کیا البتہ ایک بوڑھا شخص ( امیہ بن خلف ) اپنے ہاتھ میں کنکری یا مٹی اٹھا کر اپنی پیشانی تک لے گیا اور کہا میرے لیے یہی کافی ہے میں نے دیکھا کہ بعد میں وہ بوڑھا حالت کفر میں ہی مارا گیا ۔</b>",
        "bookID": "17.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 109530,
        "last_updated": null
    }
]