[
    {
        "urduURN": 4014010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1395,
        "hadithSanad": "ہم سے ابوعاصم ضحاک بن مخلد نے بیان کیا ‘ ان سے زکریا بن اسحاق نے بیان کیا ‘ ان سے یحییٰ بن عبداللہ بن صیفی نے بیان کیا ، ان سے ابومعبد نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے جب معاذ رضی اللہ عنہ کو یمن ( کا حاکم بنا کر ) بھیجا تو فرمایا کہ تم انہیں اس کلمہ کی گواہی کی دعوت دینا کہ اللہ کے سوا کوئی معبود نہیں اور یہ کہ میں اللہ کا رسول ہوں ۔ اگر وہ لوگ یہ بات مان لیں تو پھر انہیں بتانا کہ اللہ تعالیٰ نے ان پر روزانہ پانچ وقت کی نمازیں فرض کی ہیں ۔ اگر وہ لوگ یہ بات بھی مان لیں تو پھر انہیں بتانا کہ اللہ تعالیٰ نے ان کے مال پر کچھ صدقہ فرض کیا ہے جو ان کے مالدار لوگوں سے لے کر انہیں کے محتاجوں میں لوٹا دیا جائے گا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 112910,
        "last_updated": null
    },
    {
        "urduURN": 4014020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1396,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ‘ کہا کہ ہم سے شعبہ نے محمد بن عثمان بن عبداللہ بن موہب سے بیان کیا ہے ‘ ان سے موسیٰ بن طلحہ نے اور ان سے ابوایوب رضی اللہ عنہ نے کہ",
        "hadithText": "ایک شخص نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا کہ آپ مجھے کوئی ایسا عمل بتائیے جو مجھے جنت میں لے جائے ۔ اس پر لوگوں نے کہا کہ آخر یہ کیا چاہتا ہے ۔ لیکن نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ تو بہت اہم ضرورت ہے ۔ ( سنو ) اللہ کی عبادت کرو اور اس کا کوئی شریک نہ ٹھہراو ۔ نماز قائم کرو ۔ زکوٰۃ دو اور صلہ رحمی کرو ۔ اور بہز نے کہا کہ ہم سے شعبہ نے بیان کیا کہ ہم سے محمد بن عثمان اور ان کے باپ عثمان بن عبداللہ نے بیان کیا کہ ان دونوں صاحبان نے موسیٰ بن طلحہ سے سنا اور انہوں نے ابوایوب سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے اسی حدیث کی طرح ( سنا ) ابوعبداللہ ( امام بخاری ) نے کہا کہ مجھے ڈر ہے کہ محمد سے روایت غیر محفوظ ہے اور روایت عمرو بن عثمان سے ( محفوظ ہے ) ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 112921,
        "last_updated": null
    },
    {
        "urduURN": 4014030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1397,
        "hadithSanad": "ہم سے محمد بن عبدالرحیم نے بیان کیا ‘ کہا کہ ہم سے عفان بن مسلم نے بیان کیا ‘ کہا کہ ہم سے وہیب بن خالد نے بیان کیا ان سے یحییٰ بن سعید بن حیان نے ‘ ان سے ابوزرعہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "ایک دیہاتی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں آیا اور عرض کی کہ آپ مجھے کوئی ایسا کام بتلائیے جس پر اگر میں ہمیشگی کروں تو جنت میں داخل ہو جاؤں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کی عبادت کر ‘ اس کا کسی کو شریک نہ ٹھہرا ‘ فرض نماز قائم کر ‘ فرض زکوٰۃ دے اور رمضان کے روزے رکھ ۔ دیہاتی نے کہا اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ‘ ان عملوں پر میں کوئی زیادتی نہیں کروں گا ۔ جب وہ پیٹھ موڑ کر جانے لگا تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر کوئی ایسے شخص کو دیکھنا چاہے جو جنت والوں میں سے ہو تو وہ اس شخص کو دیکھ لے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 112941,
        "last_updated": null
    },
    {
        "urduURN": 4014040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1398,
        "hadithSanad": "ہم سے حجاج بن منہال نے حدیث بیان کی ‘ کہا کہ ہم سے حماد بن زید نے بیان کیا ‘ کہا کہ ہم سے ابوجمرہ نصر بن عمران ضبعی نے بیان کیا ‘ کہا کہ میں نے ابن عباس رضی اللہ عنہما سے سنا ‘ آپ نے بتلایا کہ",
        "hadithText": "قبیلہ عبدالقیس کا وفد نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کی کہ یا رسول اللہ ! ہم قبیلہ ربیعہ کی ایک شاخ ہیں اور قبیلہ مضر کے کافر ہمارے اور آپ صلی اللہ علیہ وسلم کے درمیان پڑتے ہیں ۔ اس لیے ہم آپ صلی اللہ علیہ وسلم کی خدمت میں صرف حرمت کے مہینوں ہی میں حاضر ہو سکتے ہیں ( کیونکہ ان مہینوں میں لڑائیاں بند ہو جاتی ہیں اور راستے پرامن ہو جاتے ہیں ) آپ صلی اللہ علیہ وسلم ہمیں کچھ ایسی باتیں بتلا دیجئیے جس پر ہم خود بھی عمل کریں اور اپنے قبیلہ کے لوگوں سے بھی ان پر عمل کرنے کے لیے کہیں جو ہمارے ساتھ نہیں آ سکے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں تمہیں چار باتوں کا حکم دیتا ہوں اور چار چیزوں سے روکتا ہوں ۔ اللہ تعالیٰ پر ایمان لانے اور اس کی وحدانیت کی شہادت دینے کا ( یہ کہتے ہوئے ) آپ صلی اللہ علیہ وسلم نے اپنی انگلی سے ایک طرف اشارہ کیا ۔ نماز قائم کرنا ‘ پھر زکوٰۃ ادا کرنا اور مال غنیمت سے پانچواں حصہ ادا کرنے ( کا حکم دیتا ہوں ) اور میں تمہیں کدو کے تونبی سے اور حنتم ( سبز رنگ کا چھوٹا سا مرتبان جیسا گھڑا ) فقیر ( کھجور کی جڑ سے کھودا ہوا ایک برتن ) اور زفت لگا ہوا برتن ( زفت بصرہ میں ایک قسم کا تیل ہوتا تھا ) کے استعمال سے منع کرتا ہوں ۔ سلیمان اور ابوالنعمان نے حماد کے واسطہ سے یہی روایت اس طرح بیان کی ہے ۔ «الإيمان بالله شهادة أن لا إله إلا الله» یعنی اللہ پر ایمان لانے کا مطلب «لا إله إلا الله» کی گواہی دینا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 112960,
        "last_updated": null
    },
    {
        "urduURN": 4014050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1399,
        "hadithSanad": "ہم سے ابوالیمان حکم بن نافع نے بیان کیا ‘ کہا کہ ہمیں شعیب بن ابی حمزہ نے خبر دی ‘ ان سے زہری نے کہا کہ ہم سے عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے بیان کیا کہ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جب رسول اللہ صلی اللہ علیہ وسلم فوت ہو گئے اور ابوبکر رضی اللہ عنہ خلیفہ ہوئے تو عرب کے کچھ قبائل کافر ہو گئے ( اور کچھ نے زکوٰۃ سے انکار کر دیا اور حضرت ابوبکر رضی اللہ عنہ نے ان سے لڑنا چاہا ) تو عمر رضی اللہ عنہ نے فرمایا کہ آپ رسول اللہ صلی اللہ علیہ وسلم کے اس فرمان کی موجودگی میں کیونکر جنگ کر سکتے ہیں ” مجھے حکم ہے لوگوں سے اس وقت تک جنگ کروں جب تک کہ وہ «لا إله إلا الله» کی شہادت نہ دیدیں اور جو شخص اس کی شہادت دیدے تو میری طرف سے اس کا مال و جان محفوظ ہو جائے گا ۔ سوا اسی کے حق کے ( یعنی قصاص وغیرہ کی صورتوں کے ) اور اس کا حساب اللہ تعالیٰ کے ذمہ ہو گا ۔ \n<span class=urdu_sanad>اس پر حضرت ابوبکر صدیق رضی اللہ عنہ نے جواب دیا کہ</span> قسم اللہ کی میں ہر اس شخص سے جنگ کروں گا جو زکوٰۃ اور نماز میں تفریق کرے گا ۔ ( یعنی نماز تو پڑھے مگر زکوٰۃ کے لیے انکار کر دے ) کیونکہ زکوٰۃ مال کا حق ہے ۔ خدا کی قسم اگر انہوں نے زکوٰۃ میں چار مہینے کی ( بکری کے ) بچے کو دینے سے بھی انکار کیا جسے وہ رسول اللہ صلی اللہ علیہ وسلم کو دیتے تھے تو میں ان سے لڑوں گا ۔ حضرت عمر رضی اللہ عنہ نے فرمایا کہ بخدا یہ بات اس کا نتیجہ تھی کہ اللہ تعالیٰ نے ابوبکر رضی اللہ عنہ کا سینہ اسلام کے لیے کھول دیا تھا اور بعد میں ، میں بھی اس نتیجہ پر پہنچا کہ ابوبکر رضی اللہ عنہ ہی حق پر تھے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 112971,
        "last_updated": null
    },
    {
        "urduURN": 4014070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1401,
        "hadithSanad": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا ‘ کہا کہ مجھ سے میرے والد نے بیان کیا ‘ کہا کہ ہم سے اسماعیل بن خالد نے بیان کیا ‘ ان سے قیس بن ابی حازم نے بیان کیا کہ جریر بن عبداللہ رضی اللہ عنہ نے کہا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے نماز قائم کرنے ‘ زکوٰۃ دینے اور ہر مسلمان کے ساتھ خیر خواہی کرنے پر بیعت کی تھی ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 112990,
        "last_updated": null
    },
    {
        "urduURN": 4014080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1402,
        "hadithSanad": "ہم سے ابولیمان حکم بن نافع نے بیان کیا ‘ کہا کہ ہمیں شعیب بن ابی حمزہ نے خبر دی ‘ کہا کہ ہم سے ابوالزناد نے بیان کیا کہ عبدالرحمٰن بن ہر مزا عرج نے ان سے بیان کیا کہ انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا ‘ آپ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اونٹ ( قیامت کے دن ) اپنے مالکوں کے پاس جنہوں نے ان کا حق ( زکوٰۃ ) نہ ادا کیا کہ اس سے زیادہ موٹے تازے ہو کر آئیں گے ( جیسے دنیا میں تھے ) اور انہیں اپنے کھروں سے روندیں گے ۔ بکریاں بھی اپنے ان مالکوں کے پاس جنہوں نے ان کے حق نہیں دئیے تھے پہلے سے زیادہ موٹی تازی ہو کر آئیں گی اور انہیں اپنے کھروں سے روندیں گی اور اپنے سینگوں سے ماریں گی ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اس کا حق یہ بھی ہے کہ اسے پانی ہی پر ( یعنی جہاں وہ چراگاہ میں چر رہی ہوں ) دوہا جائے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ کوئی شخص قیامت کے دن اس طرح نہ آئے کہ وہ اپنی گردن پر ایک ایسی بکری اٹھائے ہوئے ہو جو چلا رہی ہو اور وہ (شخص) مجھ سے کہے کہ اے محمد ( صلی اللہ علیہ وسلم ) ! مجھے عذاب سے بچائیے میں اسے یہ جواب دوں گا کہ تیرے لیے میں کچھ نہیں کر سکتا ( میرا کام پہنچانا تھا ) سو میں نے پہنچا دیا ۔ اسی طرح کوئی شخص اپنی گردن پر اونٹ لیے ہوئے قیامت کے دن نہ آئے کہ اونٹ چلا رہا ہو اور وہ خود مجھ سے فریاد کرے ‘ اے محمد ( صلی اللہ علیہ وسلم ) ! مجھے بچائیے اور میں یہ جواب دے دوں کہ تیرے لیے میں کچھ نہیں کر سکتا ۔ میں نے تجھ کو ( خدا کا حکم زکوٰۃ ) پہنچا دیا تھا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 113000,
        "last_updated": null
    },
    {
        "urduURN": 4014090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1403,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ‘ انہوں نے کہا ہم سے ہاشم بن قاسم نے بیان کیا کہ ہم سے عبدالرحمٰن بن عبداللہ بن دینار نے اپنے والد سے بیان کیا ‘ ان سے ابوصالح سمان نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا کہ جسے اللہ نے مال دیا اور اس نے اس کی زکوٰۃ نہیں ادا کی تو قیامت کے دن اس کا مال نہایت زہریلے گنجے سانپ کی شکل اختیار کر لے گا ۔ اس کی آنکھوں کے پاس دو سیاہ نقطے ہوں گے ۔ جیسے سانپ کے ہوتے ہیں ‘ پھر وہ سانپ اس کے دونوں جبڑوں سے اسے پکڑ لے گا اور کہے گا کہ میں تیرا مال اور خزانہ ہوں ۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے یہ آیت پڑھی ” اور وہ لوگ یہ گمان نہ کریں کہ اللہ تعالیٰ نے انہیں جو کچھ اپنے فضل سے دیا ہے وہ اس پر بخل سے کام لیتے ہیں کہ ان کا مال ان کے لیے بہتر ہے ۔ بلکہ وہ برا ہے جس مال کے معاملہ میں انہوں نے بخل کیا ہے ۔ قیامت میں اس کا طوق بنا کر ان کی گردن میں ڈالا جائے گا ۔ “</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 113010,
        "last_updated": null
    },
    {
        "urduURN": 4014100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1404,
        "hadithSanad": "ہم سے احمد بن شبیب بن سعید نے بیان کیا ‘ انہوں نے کہا ہم سے میرے والد شبیب نے بیان کیا ‘ انہوں نے کہا کہ ہم سے یونس نے بیان کیا ‘ ان سے ابن شہاب نے ‘ ان سے خالد بن اسلم نے ‘ انہوں نے بیان کیا کہ",
        "hadithText": "ہم عبداللہ بن عمر رضی اللہ عنہما کے ساتھ کہیں جا رہے تھے ۔ ایک اعرابی نے آپ سے پوچھا کہ مجھے اللہ تعالیٰ کے اس فرمان کی تفسیر بتلائیے ” جو لوگ سونے اور چاندی کا خزانہ بنا کر رکھتے ہیں ۔ “ حضرت ابن عمر رضی اللہ عنہما نے اس کا جواب دیا کہ اگر کسی نے سونا چاندی جمع کیا اور اس کی زکوٰۃ نہ دی تو اس کے لیے «ويل» ( خرابی ) ہے ۔ یہ حکم زکوٰۃ کے احکام نازل ہونے سے پہلے تھا لیکن جب اللہ تعالیٰ نے زکوٰۃ کا حکم نازل کر دیا تو اب وہی زکوٰۃ مال و دولت کو پاک کر دینے والی ہے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 113020,
        "last_updated": null
    },
    {
        "urduURN": 4014110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1405,
        "hadithSanad": "ہم سے اسحاق بن یزید نے حدیث بیان کی ‘ انہوں نے کہا کہ ہمیں شعیب بن اسحاق نے خبر دی ‘ انہوں نے کہا کہ ہمیں امام اوزاعی نے خبر دی ‘ انہوں نے کہا کہ مجھے یحییٰ بن ابی کثیر نے خبر دی کہ عمرو بن یحییٰ بن عمارہ نے انہیں خبر دی اپنے والد یحییٰ بن عمارہ بن ابوالحسن سے اور انہوں نے ابو سعید خدری رضی اللہ عنہ سے انہوں نے بیان کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا پانچ اوقیہ سے کم چاندی میں زکوٰۃ نہیں ہے اور پانچ اونٹوں سے کم میں زکوٰۃ نہیں ہے اور پانچ وسق سے کم ( غلہ ) میں زکوٰۃ نہیں ہے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 113030,
        "last_updated": null
    },
    {
        "urduURN": 4014120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1406,
        "hadithSanad": "ہم سے علی بن ابی ہاشم نے بیان کیا ‘ انہوں نے ہشیم سے سنا ‘ کہا کہ ہمیں حصین نے خبر دی ‘ انہیں زید بن وہب نے کہا کہ",
        "hadithText": "میں مقام ربذہ سے گزر رہا تھا کہ ابوذر رضی اللہ عنہ دکھائی دیئے ۔ میں نے پوچھا کہ آپ یہاں کیوں آ گئے ہیں ؟ انہوں نے جواب دیا کہ میں شام میں تھا تو معاویہ رضی اللہ عنہ سے میرا اختلاف ( قرآن کی آیت ) ” جو لوگ سونا اور چاندی جمع کرتے ہیں اور انہیں اللہ کی راہ میں خرچ نہیں کرتے “ کے متعلق ہو گیا ۔ معاویہ رضی اللہ عنہ کا کہنا یہ تھا کہ یہ آیت اہل کتاب کے بارے میں نازل ہوئی ہے اور میں یہ کہتا تھا کہ اہل کتاب کے ساتھ ہمارے متعلق بھی یہ نازل ہوئی ہے ۔ اس اختلاف کے نتیجہ میں میرے اور ان کے درمیان کچھ تلخی پیدا ہو گئی ۔ چنانچہ انہوں نے عثمان رضی اللہ عنہ ( جو ان دنوں خلیفۃ المسلمین تھے ) کے یہاں میری شکایت لکھی ۔ عثمان رضی اللہ عنہ نے مجھے لکھا کہ میں مدینہ چلا آؤں ۔ چنانچہ میں چلا آیا ۔ ( وہاں جب پہنچا ) تو لوگوں کا میرے یہاں اس طرح ہجوم ہونے لگا جیسے انہوں نے مجھے پہلے دیکھا ہی نہ ہو ۔ پھر جب میں نے لوگوں کے اس طرح اپنی طرف آنے کے متعلق عثمان رضی اللہ عنہ سے کہا تو انہوں نے فرمایا کہ اگر مناسب سمجھو تو یہاں کا قیام چھوڑ کر مدینہ سے قریب ہی کہیں اور جگہ الگ قیام اختیار کر لو ۔ یہی بات ہے جو مجھے یہاں ( ربذہ ) تک لے آئی ہے ۔ اگر وہ میرے اوپر ایک حبشی کو بھی امیر مقرر کر دیں تو میں اس کی بھی سنوں گا اور اطاعت کروں گا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 113040,
        "last_updated": null
    },
    {
        "urduURN": 4014130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1407,
        "hadithSanad": "ہم سے عیاش بن ولید نے بیان کیا ‘ انہوں نے کہا کہ ہم سے عبدالاعلیٰ نے بیان کیا ‘ کہا کہ ہم سے سعید جریری نے ابوالعلاء یزید سے بیان کیا ‘ ان سے احنف بن قیس نے ‘ انہوں نے کہا کہ",
        "hadithText": "میں بیٹھا تھا ( دوسری سند ) اور امام بخاری رحمہ اللہ نے فرمایا کہ مجھ سے اسحاق بن منصور نے بیان کیا ‘ انہوں نے کہا کہ ہم سے عبدالصمد بن عبدالوارث نے بیان کیا ‘ انہوں نے کہا کہ مجھ سے میرے باپ نے بیان کیا ‘ انہوں نے کہا مجھ سے سعید جریری نے بیان کیا ‘ کہا کہ ہم سے ابوالعلاء بن شخیر نے بیان کیا ‘ ان سے احنف بن قیس نے بیان کیا کہ میں قریش کی ایک مجلس میں بیٹھا ہوا تھا ۔ اتنے میں سخت بال ‘ موٹے کپڑے اور موٹی جھوٹی حالت میں ایک شخص آیا اور کھڑے ہو کر سلام کیا اور کہا کہ خزانہ جمع کرنے والوں کو اس پتھر کی بشارت ہو جو جہنم کی آگ میں تپایا جائے گا اور اس کی چھاتی کی بھٹنی پر رکھ دیا جائے گا جو مونڈھے کی طرف سے پار ہو جائے گا ۔ اس طرح وہ پتھر برابر ڈھلکتا رہے گا ۔ یہ کہہ کر وہ صاحب چلے گئے اور ایک ستون کے پاس ٹیک لگا کر بیٹھ گئے ۔ میں بھی ان کے ساتھ چلا اور ان کے قریب بیٹھ گیا ۔ اب تک مجھے یہ معلوم نہ تھا کہ یہ کون صاحب ہیں ۔ میں نے ان سے کہا کہ میرا خیال ہے کہ آپ کی بات قوم نے پسند نہیں کی ۔ انہوں نے کہا یہ سب تو بیوقوف ہیں ۔ \n<span class=urdu_sanad>مجھ سے میرے خلیل نے کہا تھا میں نے پوچھا کہ آپ کے خلیل کون ہیں ؟ جواب دیا کہ رسول اللہ صلی اللہ علیہ وسلم اے ابوذر ! کیا احد پہاڑ تو دیکھتا ہے ۔ ابوذر رضی اللہ عنہ کا بیان تھا کہ</span> اس وقت میں نے سورج کی طرف نظر اٹھا کر دیکھا کہ کتنا دن ابھی باقی ہے ۔ کیونکہ مجھے ( آپ کی بات سے ) یہ خیال گزرا کہ آپ اپنے کسی کام کے لیے مجھے بھیجیں گے ۔ میں نے جواب دیا کہ جی ہاں ( احد پہاڑ میں نے دیکھا ہے ) آپ نے فرمایا کہ اگر میرے پاس احد پہاڑ کے برابر سونا ہو میں اس کے سوا دوست نہیں رکھتا کہ صرف تین دینار بچا کر باقی تمام کا تمام ( اللہ کے راستے میں ) دے ڈالوں ( ابوذر رضی اللہ عنہ نے پھر فرمایا کہ ) ان لوگوں کو کچھ معلوم نہیں یہ دنیا جمع کرنے کی فکر کرتے ہیں ۔ ہرگز نہیں خدا کی قسم نہ میں ان کی دنیا ان سے مانگتا ہوں اور نہ دین کا کوئی مسئلہ ان سے پوچھتا ہوں تاآنکہ میں اللہ تعالیٰ سے جا ملوں ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 113051,
        "last_updated": null
    },
    {
        "urduURN": 4014150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1409,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ‘ کہا کہ ہم سے یحییٰ بن سعید نے اسماعیل بن ابی خالد سے بیان کیا ، کہا کہ مجھ سے قیس بن ابی حازم نے بیان کیا اور ان سے ابن مسعود رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "حسد ( رشک ) کرنا صرف دو ہی آدمیوں کے ساتھ جائز ہو سکتا ہے ۔ ایک تو اس شخص کے ساتھ جسے اللہ نے مال دیا اور اسے حق اور مناسب جگہوں میں خرچ کرنے کی توفیق دی ۔ دوسرے اس شخص کے ساتھ جسے اللہ تعالیٰ نے حکمت ( عقل علم قرآن و حدیث اور معاملہ فہمی ) دی اور وہ اپنی حکمت کے مطابق حق فیصلے کرتا ہے اور لوگوں کو اس کی تعلیم دیتا ہے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 113070,
        "last_updated": null
    },
    {
        "urduURN": 4014160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1410,
        "hadithSanad": "ہم سے عبداللہ بن منیر نے بیان کیا ‘ انہوں نے ابوالنضر سالم بن ابی امیہ سے سنا ‘ انہوں نے بیان کیا کہ مجھ سے عبدالرحمٰن بن عبداللہ بن دینار نے بیان کیا ‘ ان سے ان کے والد نے ‘ ان سے ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو شخص حلال کمائی سے ایک کھجور کے برابر صدقہ کرے اور اللہ تعالیٰ صرف حلال کمائی کے صدقہ کو قبول کرتا ہے تو اللہ تعالیٰ اسے اپنے داہنے ہاتھ سے قبول کرتا ہے پھر صدقہ کرنے والے کے فائدے کے لیے اس میں زیادتی کرتا ہے ۔ بالکل اسی طرح جیسے کوئی اپنے جانور کے بچے کو کھلا پلا کر بڑھاتا ہے تاآنکہ اس کا صدقہ پہاڑ کے برابر ہو جاتا ہے ۔ عبدالرحمٰن کے ساتھ اس روایت کی متابعت سلیمان نے عبداللہ بن دینار کی روایت سے کی ہے اور ورقاء نے ابن دینار سے کہا ‘ ان سے سعید بن یسار نے ‘ ان سے ابوہریرہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے اور اس کی روایت مسلم بن ابی مریم ‘ زید بن اسلم اور سہیل نے ابوصالح سے کی ‘ ان سے ابوہریرہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 113081,
        "last_updated": null
    },
    {
        "urduURN": 4014170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1411,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ‘ انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا ‘ انہوں نے کہا کہ ہم سے سعید بن خالد نے بیان کیا ‘ انہوں نے کہا کہ میں نے حارثہ بن وہب رضی اللہ عنہ سے سنا ‘ انہوں نے فرمایا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا تھا کہ صدقہ کرو ‘ ایک ایسا زمانہ بھی تم پر آنے والا ہے جب ایک شخص اپنے مال کا صدقہ لے کر نکلے گا اور کوئی اسے قبول کرنے والا نہیں پائے گا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 113100,
        "last_updated": null
    },
    {
        "urduURN": 4014180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1412,
        "hadithSanad": "ہم سے ابوالیمان حکم بن نافع نے بیان کیا ‘ انہوں نے کہا کہ ہمیں شعیب نے خبر دی ‘ کہا کہ ہم سے ابوالزناد نے بیان کیا ‘ ان سے عبدالرحمٰن بن ہر مزاعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا قیامت آنے سے پہلے مال و دولت کی اس قدر کثرت ہو جائے گی اور لوگ اس قدر مالدار ہو جائیں گے کہ اس وقت صاحب مال کو اس کی فکر ہو گی کہ اس کی زکوٰۃ کون قبول کرے اور اگر کسی کو دینا بھی چاہے گا تو اس کو یہ جواب ملے گا کہ مجھے اس کی حاجت نہیں ہے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 113110,
        "last_updated": null
    },
    {
        "urduURN": 4014190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1413,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ‘ کہا کہ ہم سے ابوعاصم نبیل نے بیان کیا ‘ کہا کہ ہمیں سعدان بن بشیر نے خبر دی ‘ کہا کہ ہم سے ابومجاہد سعد طائی نے بیان کیا ‘ کہا کہ ہم سے محل بن خلیفہ طائی نے بیان کیا ‘ کہا کہ میں نے عدی بن حاتم طائی رضی اللہ عنہ سے سنا ‘ انہوں نے کہا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں موجود تھا کہ دو شخص آئے ‘ ایک فقر و فاقہ کی شکایت لیے ہوئے تھا اور دوسرے کو راستوں کے غیر محفوظ ہونے کی شکایت تھی ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جہاں تک راستوں کے غیر محفوظ ہونے کا تعلق ہے تو بہت جلد ایسا زمانہ آنے والا ہے کہ جب ایک قافلہ مکہ سے کسی محافظ کے بغیر نکلے گا ۔ ( اور اسے راستے میں کوئی خطرہ نہ ہو گا ) اور رہا فقر و فاقہ تو قیامت اس وقت تک نہیں آئے گی جب تک ( مال و دولت کی کثرت کی وجہ سے یہ حال نہ ہو جائے کہ ) ایک شخص اپنا صدقہ لے کر تلاش کرے لیکن کوئی اسے لینے والا نہ ملے ۔ پھر اللہ تعالیٰ کے درمیان کوئی پردہ نہ ہو گا اور نہ ترجمانی کے لیے کوئی ترجمان ہو گا ۔ پھر اللہ تعالیٰ اس سے پوچھے گا کہ کیا میں نے تجھے دنیا میں مال نہیں دیا تھا ؟ وہ کہے گا کہ ہاں دیا تھا ۔ پھر اللہ تعالیٰ پوچھے گا کہ کیا میں نے تیرے پاس پیغمبر نہیں بھیجا تھا ؟ وہ کہے گا کہ ہاں بھیجا تھا ۔ پھر وہ شخص اپنے دائیں طرف دیکھے گا تو آگ کے سوا اور کچھ نظر نہیں آئے گا پھر بائیں طرف دیکھے گا اور ادھر بھی آگ ہی آگ ہو گی ۔ پس تمہیں جہنم سے ڈرنا چاہیے خواہ ایک کھجور کے ٹکڑے ہی ( کا صدقہ کر کے اس سے اپنا بچاؤ کر سکو ) اگر یہ بھی میسر نہ آ سکے تو اچھی بات ہی منہ سے نکالے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 113120,
        "last_updated": null
    },
    {
        "urduURN": 4014200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1414,
        "hadithSanad": "ہم سے محمد بن علاء نے بیان کیا ‘ انہوں نے کہا کہ ہم سے ابواسامہ ( حماد بن اسامہ ) نے بیان کیا ‘ انہوں نے کہا ہم سے برید بن عبداللہ نے ‘ ان سے ابوبردہ نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ لوگوں پر ضرور ایک زمانہ ایسا آ جائے گا کہ ایک شخص سونے کا صدقہ لے کر نکلے گا لیکن کوئی اسے لینے والا نہیں ملے گا اور یہ بھی ہو گا کہ ایک مرد کی پناہ میں چالیس چالیس عورتیں ہو جائیں گی کیونکہ مردوں کی کمی ہو جائے گی اور عورتوں کی زیادتی ہو گی ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 113130,
        "last_updated": null
    },
    {
        "urduURN": 4014210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1415,
        "hadithSanad": "ہم سے ابوقدامہ عبیداللہ بن سعید نے بیان کیا ‘ کہا ہم سے ابوالنعمان حکم بن عبداللہ بصریٰ نے بیان کیا ‘ کہا ہم سے شعبہ بن حجاج نے بیان کیا ‘ ان سے سلیمان اعمش نے ‘ ان سے ابووائل نے اور ان سے ابومسعود انصاری رضی اللہ عنہ نے فرمایا کہ",
        "hadithText": "جب آیت صدقہ نازل ہوئی تو ہم بوجھ ڈھونے کا کام کیا کرتے تھے ( تاکہ اس طرح جو مزدوری ملے اسے صدقہ کر دیا جائے ) اسی زمانہ میں ایک شخص ( عبدالرحمٰن بن عوف ) آیا اور اس نے صدقہ کے طور پر کافی چیزیں پیش کیں ۔ اس پر لوگوں نے یہ کہنا شروع کیا کہ یہ آدمی ریاکار ہے ۔ پھر ایک اور شخص ( ابوعقیل نامی ) آیا اور اس نے صرف ایک صاع کا صدقہ کیا ۔ اس کے بارے میں لوگوں نے یہ کہہ دیا کہ اللہ تعالیٰ کو ایک صاع صدقہ کی کیا حاجت ہے ۔ اس پر یہ آیت نازل ہوئی «الذين يلمزون المطوعين من المؤمنين في الصدقات والذين لا يجدون إلا جهدهم» ” وہ لوگ جو ان مومنوں پر عیب لگاتے ہیں جو صدقہ زیادہ دیتے ہیں اور ان پر بھی جو محنت سے کما کر لاتے ہیں ۔ ( اور کم صدقہ کرتے ہیں ) “ آخر تک ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 113140,
        "last_updated": null
    },
    {
        "urduURN": 4014220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1416,
        "hadithSanad": "ہم سے سعید بن یحییٰ نے بیان کیا ، کہا مجھ سے میرے والد نے بیان کیا ، کہا کہ ہم سے اعمش نے بیان کیا ، ان سے شقیق نے اور ان سے ابومسعود انصاریرضی اللہ تعالیٰ عنہ نے کہا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے جب ہمیں صدقہ کرنے کا حکم دیا تو ہم میں سے بہت سے بازار جا کر بوجھ اٹھانے کی مزدوری کرتے اور اس طرح ایک مد ( غلہ یا کھجور وغیرہ ) حاصل کرتے ۔ ( جسے صدقہ کر دیتے ) لیکن آج ہم میں سے بہت سوں کے پاس لاکھ لاکھ ( درہم یا دینار ) موجود ہیں ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 113150,
        "last_updated": null
    },
    {
        "urduURN": 4014230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1417,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ‘ کہا کہ ہم سے شعبہ نے بیان کیا اور ان سے ابواسحاق عمرو بن عبداللہ سبیعی نے کہا کہ میں نے عبداللہ بن معقل سے سنا ‘ انہوں نے کہا کہ میں نے عدی بن حاتم رضی اللہ عنہ سے سنا ‘ انہوں نے کہا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ کہتے سنا کہ جہنم سے بچو اگرچہ کھجور کا ایک ٹکڑا دے کر ہی سہی ( مگر ضرور صدقہ کر کے دوزخ کی آگ سے بچنے کی کوشش کرو ) ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 113160,
        "last_updated": null
    },
    {
        "urduURN": 4014240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1418,
        "hadithSanad": "ہم سے بشر بن محمد نے بیان کیا ‘ کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی ‘ کہا کہ ہمیں معمر نے زہری سے خبر دی ‘ انہوں نے کہا کہ مجھ سے عبداللہ بن ابی بکر بن حزم نے بیان کیا ‘ ان سے عروہ بن زبیر نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "ایک عورت اپنی دو بچیوں کو لیے مانگتی ہوئی آئی ۔ میرے پاس ایک کھجور کے سوا اس وقت اور کچھ نہ تھا میں نے وہی دے دی ۔ وہ ایک کھجور اس نے اپنی دونوں بچیوں میں تقسیم کر دی اور خود نہیں کھائی ۔ پھر وہ اٹھی اور چلی گئی ۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم تشریف لائے تو میں نے آپ صلی اللہ علیہ وسلم سے اس کا حال بیان کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جس نے ان بچیوں کی وجہ سے خود کو معمولی سی بھی تکلیف میں ڈالا تو بچیاں اس کے لیے دوزخ سے بچاؤ کے لیے آڑ بن جائیں گی ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 113170,
        "last_updated": null
    },
    {
        "urduURN": 4014250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1419,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ کہا کہ ہم سے عبدالواحد بن زیاد نے بیان کیا ‘ کہا کہ ہم سے عمارہ بن قعقاع نے بیان کیا ‘ کہا کہ ہم سے ابوزرعہ نے بیان کیا ‘ کہا کہ ہم سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک شخص نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور کہا کہ یا رسول اللہ ! کس طرح کے صدقہ میں سب سے زیادہ ثواب ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس صدقہ میں جسے تم صحت کے ساتھ بخل کے باوجود کرو ۔ تمہیں ایک طرف تو فقیری کا ڈر ہو اور دوسری طرف مالدار بننے کی تمنا اور امید ہو اور ( اس صدقہ خیرات میں ) ڈھیل نہ ہونی چاہیے کہ جب جان حلق تک آ جائے تو اس وقت تو کہنے لگے کہ فلاں کے لیے اتنا اور فلاں کے لیے اتنا حالانکہ وہ تو اب فلاں کا ہو چکا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 113180,
        "last_updated": null
    },
    {
        "urduURN": 4014260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1420,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ کہا کہ ہم سے ابوعوانہ وضاح یشکری نے بیان کیا ‘ ان سے فراس بن یحییٰ نے ان سے شعبی نے ، ان سے مسروق نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی بعض بیویوں نے آپ صلی اللہ علیہ وسلم سے پوچھا کہ سب سے پہلے ہم میں آخرت میں آپ صلی اللہ علیہ وسلم سے کون جا کر ملے گی تو آپ صلی اللہ علیہ وسلم نے فرمایا جس کا ہاتھ سب سے زیادہ لمبا ہو گا ۔ اب ہم نے لکڑی سے ناپنا شروع کر دیا تو سودہ رضی اللہ عنہا سب سے لمبے ہاتھ والی نکلیں ۔ ہم نے بعد میں سمجھا کہ لمبے ہاتھ والی ہونے سے آپ صلی اللہ علیہ وسلم کی مراد صدقہ زیادہ کرنے والی سے تھی ۔ اور سودہ رضی اللہ عنہا ہم سب سے پہلے نبی کریم صلی اللہ علیہ وسلم سے جا کر ملیں ‘ صدقہ کرنا آپ صلی اللہ علیہ وسلم کو بہت محبوب تھا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 113190,
        "last_updated": null
    },
    {
        "urduURN": 4014270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1421,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ‘ کہا کہ ہمیں شعیب نے خبر دی ‘ کہا کہ ہم سے ابوالزناد نے بیان کیا ‘ ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ایک شخص نے ( بنی اسرائیل میں سے ) کہا کہ مجھے ضرور صدقہ ( آج رات ) دینا ہے ۔ چنانچہ وہ اپنا صدقہ لے کر نکلا اور ( ناواقفی سے ) ایک چور کے ہاتھ میں رکھ دیا ۔ صبح ہوئی تو لوگوں نے کہنا شروع کیا کہ آج رات کسی نے چور کو صدقہ دے دیا ۔ اس شخص نے کہا کہ اے اللہ ! تمام تعریف تیرے ہی لیے ہے ۔ ( آج رات ) میں پھر ضرور صدقہ کروں گا ۔ چنانچہ وہ دوبارہ صدقہ لے کر نکلا اور اس مرتبہ ایک فاحشہ کے ہاتھ میں دے آیا ۔ جب صبح ہوئی تو پھر لوگوں میں چرچا ہوا کہ آج رات کسی نے فاحشہ عورت کو صدقہ دے دیا ۔ اس شخص نے کہا اے اللہ ! تمام تعریف تیرے ہی لیے ہے ‘ میں زانیہ کو اپنا صدقہ دے آیا ۔ اچھا آج رات پھر ضرور صدقہ نکالوں گا ۔ چنانچہ اپنا صدقہ لیے ہوئے وہ پھر نکلا اور اس مرتبہ ایک مالدار کے ہاتھ پر رکھ دیا ۔ صبح ہوئی تو لوگوں کی زبان پر ذکر تھا کہ ایک مالدار کو کسی نے صدقہ دے دیا ہے ۔ اس شخص نے کہا کہ اے اللہ ! حمد تیرے ہی لیے ہے ۔ میں اپنا صدقہ ( لاعلمی سے ) چور ‘ فاحشہ اور مالدار کو دے آیا ۔ ( اللہ تعالیٰ کی طرف سے ) بتایا گیا کہ جہاں تک چور کے ہاتھ میں صدقہ چلے جانے کا سوال ہے ۔ تو اس میں اس کا امکان ہے کہ وہ چوری سے رک جائے ۔ اسی طرح فاحشہ کو صدقہ کا مال مل جانے پر اس کا امکان ہے کہ وہ زنا سے رک جائے اور مالدار کے ہاتھ میں پڑ جانے کا یہ فائدہ ہے کہ اسے عبرت ہو اور پھر جو اللہ عزوجل نے اسے دیا ہے ‘ وہ خرچ کرے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 113200,
        "last_updated": null
    },
    {
        "urduURN": 4014280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1422,
        "hadithSanad": "ہم سے محمد بن یوسف فریابی نے بیان کیا ‘ کہا کہ ہم اسرائیل بن یونس نے بیان کیا ‘ کہا کہ ہم سے ابوجویریہ ( حطان بن خفاف ) نے بیان کیا کہ معن بن یزید نے ان سے بیان کیا ‘ انہوں نے کہا کہ",
        "hadithText": "میں نے اور میرے والد اور دادا ( اخفش بن حبیب ) نے رسول اللہ صلی اللہ علیہ وسلم کے ہاتھ پر بیعت کی تھی ۔ آپ نے میری منگنی بھی کرائی اور آپ ہی نے نکاح بھی پڑھایا تھا اور میں آپ کی خدمت میں ایک مقدمہ لے کر حاضر ہوا تھا ۔ وہ یہ کہ میرے والد یزید نے کچھ دینار خیرات کی نیت سے نکالے اور ان کو انہوں نے مسجد میں ایک شخص کے پاس رکھ دیا ۔ میں گیا اور میں نے ان کو اس سے لے لیا ۔ پھر جب میں انہیں لے کر والد صاحب کے پاس آیا تو انہوں نے فرمایا کہ قسم اللہ کی میرا ارادہ تجھے دینے کا نہیں تھا ۔ یہی مقدمہ میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لے کر حاضر ہوا اور آپ نے یہ فیصلہ دیا کہ دیکھو یزید جو تم نے نیت کی تھی اس کا ثواب تمہیں مل گیا اور معن ! جو تو نے لے لیا وہ اب تیرا ہو گیا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 113210,
        "last_updated": null
    },
    {
        "urduURN": 4014290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1423,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ‘ کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا عبیداللہ عمری سے ، انہوں نے کہا کہ مجھ سے خبیب بن عبدالرحمٰن نے حفص بن عاصم سے بیان کیا ، ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا سات قسم کے آدمیوں کو اللہ تعالیٰ اپنے ( عرش کے ) سایہ میں رکھے گا جس دن اس کے سوا اور کوئی سایہ نہ ہو گا ۔ انصاف کرنے والا حاکم ‘ وہ نوجوان جو اللہ تعالیٰ کی عبادت میں جوان ہوا ہو ‘ وہ شخص جس کا دل ہر وقت مسجد میں لگا رہے ‘ دو ایسے شخص جو اللہ کے لیے محبت رکھتے ہیں ‘ اسی پر وہ جمع ہوئے اور اسی پر جدا ہوئے ‘ ایسا شخص جسے کسی خوبصورت اور عزت دار عورت نے بلایا لیکن اس نے یہ جواب دیا کہ میں اللہ سے ڈرتا ہوں ‘ وہ انسان جو صدقہ کرے اور اسے اس درجہ چھپائے کہ بائیں ہاتھ کو بھی خبر نہ ہو کہ داہنے ہاتھ نے کیا خرچ کیا اور وہ شخص جو اللہ کو تنہائی میں یاد کرے اور اس کی آنکھیں آنسوؤں سے بہنے لگ جائیں ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 113220,
        "last_updated": null
    },
    {
        "urduURN": 4014300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1424,
        "hadithSanad": "ہم سے علی بن جعد نے بیان کیا ‘ کہا کہ ہمیں شعبہ نے خبر دی ‘ کہا کہ مجھے معبد بن خالد نے خبر دی ‘ کہا کہ میں نے حارثہ بن وہب خزاعی رضی اللہ عنہ سے سنا ۔ انہوں نے کہا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ‘ آپ صلی اللہ علیہ وسلم نے فرمایا کہ صدقہ کیا کرو پس عنقریب ایک ایسا زمانہ آنے والا ہے جب آدمی اپنا صدقہ لے کر نکلے گا ( کوئی اسے قبول کر لے مگر جب وہ کسی کو دے گا تو وہ ) آدمی کہے گا کہ اگر اسے تم کل لائے ہوتے تو میں لے لیتا لیکن آج مجھے اس کی حاجت نہیں رہی ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 113230,
        "last_updated": null
    },
    {
        "urduURN": 4014310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1425,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ‘ کہا ہم سے جریر نے بیان کیا ‘ ان سے منصور نے ۔ ان سے شقیق نے ‘ ان سے مسروق نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اگر عورت اپنے شوہر کے مال سے کچھ خرچ کرے اور اس کی نیت شوہر کی پونجی برباد کرنے کی نہ ہو تو اسے خرچ کرنے کا ثواب ملے گا اور شوہر کو بھی اس کا ثواب ملے گا اس نے کمایا ہے اور خزانچی کا بھی یہی حکم ہے ۔ ایک کا ثواب دوسرے کے ثواب میں کوئی کمی نہیں کرتا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 113240,
        "last_updated": null
    },
    {
        "urduURN": 4014320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1426,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ‘ کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی ‘ انہیں یونس نے ، انہیں زہری نے ، انہوں نے کہا مجھے سعید بن مسیب نے خبر دی ‘ انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا بہترین خیرات وہ ہے جس کے دینے کے بعد آدمی مالدار رہے ۔ پھر صدقہ پہلے انہیں دو جو تمہاری زیر پرورش ہیں ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 113250,
        "last_updated": null
    },
    {
        "urduURN": 4014330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1427,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ کہا کہ ہم سے وہیب نے بیان کیا ‘ کہا کہ ہم سے ہشام بن عروہ نے اپنے باپ سے بیان کیا ‘ ان سے حکیم بن حزام رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اوپر والا ہاتھ نیچے والے ہاتھ سے بہتر ہے اور پہلے انہیں دو جو تمہارے بال بچے اور عزیز ہیں اور بہترین صدقہ وہ ہے جسے دے کر آدمی مالدار رہے اور جو کوئی سوال سے بچنا چاہے گا اسے اللہ تعالیٰ بھی محفوظ رکھتا ہے اور جو دوسروں ( کے مال ) سے بےنیاز رہتا ہے ‘ اسے اللہ تعالیٰ بےنیاز ہی بنا دیتا ہے ۔ \n\nاور وہیب نے بیان کیا کہ ہم سے ہشام نے اپنے والد سے بیان کیا ‘ ان سے ابوہریرہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے ایسا ہی بیان فرمایا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 113261,
        "last_updated": null
    },
    {
        "urduURN": 4014350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1429,
        "hadithSanad": "ہم سے ابوالنعمان نے بیان کیا ‘ کہا کہ ہم سے حماد بن زید نے بیان کیا ‘ ان سے ایوب نے ‘ ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ۔ ( دوسری سند ) اور ہم سے عبداللہ بن مسلمہ نے بیان کیا ‘ ان سے مالک نے ‘ ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب کہ آپ منبر پر تشریف رکھتے تھے ۔ آپ نے صدقہ اور کسی کے سامنے ہاتھ نہ پھیلانے کا اور دوسروں سے مانگنے کا ذکر فرمایا اور فرمایا کہ اوپر والا ہاتھ نیچے والے ہاتھ سے بہتر ہے ۔ اوپر کا ہاتھ خرچ کرنے والے کا ہے اور نیچے کا ہاتھ مانگنے والے کا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 113280,
        "last_updated": null
    },
    {
        "urduURN": 4014360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1430,
        "hadithSanad": "ہم سے ابوعاصم نبیل نے عمر بن سعید سے بیان کیا ‘ ان سے ابن ابی ملیکہ نے کہ عقبہ بن حارث رضی اللہ عنہ نے ان سے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے عصر کی نماز ادا کی پھر جلدی سے آپ صلی اللہ علیہ وسلم گھر میں تشریف لے گئے ۔ تھوڑی دیر بعد باہر تشریف لے آئے ۔ اس پر میں نے پوچھا یا کسی اور نے پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں گھر کے اندر صدقہ کے سونے کا ایک ٹکڑا چھوڑ آیا تھا مجھے یہ بات پسند نہیں آئی کہ اسے تقسیم کئے بغیر رات گزاروں پس میں نے اس کو بانٹ دیا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 113290,
        "last_updated": null
    },
    {
        "urduURN": 4014370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1431,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ‘ کہا کہ ہم سے شعبہ نے بیان کیا ‘ کہا کہ ہم سے عدی بن ثابت نے بیان کیا ‘ ان سے سعید بن جبیر نے ‘ ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم عید کے دن نکلے ۔ پس آپ صلی اللہ علیہ وسلم نے ( عیدگاہ میں ) دو رکعت نماز پڑھائی ۔ نہ آپ صلی اللہ علیہ وسلم نے اس سے پہلے کوئی نماز پڑھی اور نہ اس کے بعد ۔ پھر آپ صلی اللہ علیہ وسلم عورتوں کی طرف آئے ۔ بلال رضی اللہ عنہ آپ صلی اللہ علیہ وسلم کے ساتھ تھے ۔ انہیں آپ صلی اللہ علیہ وسلم نے وعظ و نصیحت کی اور ان کو صدقہ کرنے کے لیے حکم فرمایا ۔ چنانچہ عورتیں کنگن اور بالیاں ( بلال رضی اللہ عنہ کے کپڑے میں ) ڈالنے لگیں ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 113300,
        "last_updated": null
    },
    {
        "urduURN": 4014380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1432,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ کہا کہ ہم سے عبدالواحد بن زیاد نے بیان کیا ‘ کہا کہ ہم سے ابوبردہ بن عبداللہ بن ابی بردہ نے بیان کیا ‘ کہا کہ ہم سے ابوبردہ بن ابی موسیٰ نے بیان کیا ‘ اور ان سے ان کے باپ ابوموسیٰ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے پاس اگر کوئی مانگنے والا آتا یا آپ صلی اللہ علیہ وسلم کے سامنے کوئی حاجت پیش کی جاتی تو آپ صلی اللہ علیہ وسلم صحابہ کرام سے فرماتے کہ تم سفارش کرو کہ اس کا ثواب پاؤ گے اور اللہ پاک اپنے نبی کی زبان سے جو فیصلہ چاہے گا وہ دے گا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 113310,
        "last_updated": null
    },
    {
        "urduURN": 4014390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1433,
        "hadithSanad": "ہم سے صدقہ بن فضل نے بیان کیا ‘ کہا کہ ہمیں عبدہ نے ہشام سے خبر دی ’ انہیں ان کی بیوی فاطمہ بنت منذر نے اور ان سے اسماء رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "مجھ سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ خیرات کو مت روک ورنہ تیرا رزق بھی روک دیا جائے گا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 113321,
        "last_updated": null
    },
    {
        "urduURN": 4014400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1434,
        "hadithSanad": "ہم سے ابوعاصم ( ابوعاصم ضحاک ) نے بیان کیا اور ان سے ابن جریج نے بیان کیا ۔ ( دوسری سند ) اور مجھ سے محمد بن عبدالرحیم نے بیان کیا ‘ ان سے حجاج بن محمد نے بیان کیا اور انہوں نے کہا کہ ہم سے ابن جریج نے بیان کیا کہ مجھے ابن ابی ملیکہ نے خبر دی ‘ انہیں عباد بن عبداللہ بن زبیر نے اسماء بنت ابی بکر رضی اللہ عنہما سے خبر دی کہ",
        "hadithText": "وہ نبی کریم صلی اللہ علیہ وسلم کے ہاں آئیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ( مال کو ) تھیلی میں بند کر کے نہ رکھنا ورنہ اللہ پاک بھی تمہارے لیے اپنے خزانے میں بندش لگا دے گا ۔ جہاں تک ہو سکے لوگوں میں خیر خیرات تقسیم کرتی رہ ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 113340,
        "last_updated": null
    },
    {
        "urduURN": 4014410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1435,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ‘ کہا کہ ہم سے جریر نے اعمش سے بیان کیا ‘ ان سے ابووائل نے ‘ انہوں نے حذیفہ بن یمان رضی اللہ عنہ سے کہ عمر بن خطاب رضی اللہ عنہ نے فرمایا کہ",
        "hadithText": "فتنہ سے متعلق رسول اللہ صلی اللہ علیہ وسلم کی حدیث آپ لوگوں میں کس کو یاد ہے ؟ حذیفہ رضی اللہ عنہ نے بیان کیا کہ میں نے کہا میں اس طرح یاد رکھتا ہوں جس طرح نبی اکرم صلی اللہ علیہ وسلم نے اس کو بیان فرمایا تھا ۔ اس پر حضرت عمر رضی اللہ عنہ نے فرمایا کہ تمہیں اس کے بیان پر جرات ہے ۔ اچھا تو آنحضور صلی اللہ علیہ وسلم نے فتنوں کے بارے میں کیا فرمایا تھا ؟ میں نے کہا کہ ( آپ صلی اللہ علیہ وسلم نے فرمایا تھا ) انسان کی آزمائش ( فتنہ ) اس کے خاندان ‘ اولاد اور پڑوسیوں میں ہوتی ہے اور نماز ‘ صدقہ اور اچھی باتوں کے لیے لوگوں کو حکم کرنا اور بری باتوں سے منع کرنا اس فتنے کا کفارہ بن جاتی ہیں ۔ اعمش نے کہا ابووائل کبھی یوں کہتے تھے ۔ نماز اور صدقہ اور اچھی باتوں کا حکم دینا بری بات سے روکنا ‘ یہ اس فتنے کو مٹا دینے والے نیک کام ہیں ۔ پھر اس فتنے کے متعلق عمر رضی اللہ عنہ نے فرمایا کہ میری مراد اس فتنہ سے نہیں ۔ میں اس فتنے کے بارے میں پوچھنا چاہتا ہوں جو سمندر کی طرح ٹھاٹھیں مارتا ہوا پھیلے گا ۔ حذیفہ رضی اللہ عنہ نے بیان کیا ‘ میں نے کہا کہ امیرالمؤمنین آپ اس فتنے کی فکر نہ کیجئے آپ کے اور اس فتنہ کے درمیان ایک بند دروازہ ہے ۔ عمر رضی اللہ عنہ نے پوچھا کہ وہ دروازہ توڑ دیا جائے گا یا صرف کھولا جائے گا ۔ انہوں نے بتلایا نہیں بلکہ وہ دروازہ توڑ دیا جائے گا ۔ اس پر عمر رضی اللہ عنہ نے فرمایا کہ جب دروازہ توڑ دیا جائے گا تو پھر کبھی بھی بند نہ ہو سکے گا ابووائل نے کہا کہ ہاں پھر ہم رعب کی وجہ سے حذیفہ رضی اللہ عنہ سے یہ نہ پوچھ سکے کہ وہ دروازہ کون ہے ؟ اس لیے ہم نے مسروق سے کہا کہ تم پوچھو ۔ انہوں نے کہا کہ مسروق رحمتہ اللہ علیہ نے پوچھا تو حذیفہ رضی اللہ عنہ نے فرمایا کہ دروازہ سے مراد خود حضرت عمر رضی اللہ عنہ ہی تھے ۔ ہم نے پھر پوچھا تو کیا عمر رضی اللہ عنہ جانتے تھے کہ آپ کی مراد کون تھی ؟ انہوں نے کہا ہاں جیسے دن کے بعد رات کے آنے کو جانتے ہیں اور یہ اس لیے کہ میں نے جو حدیث بیان کی وہ غلط نہیں تھی ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 113350,
        "last_updated": null
    },
    {
        "urduURN": 4014420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1436,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ‘ کہا کہ ہم سے ہشام نے بیان کیا ‘ کہا کہ ہمیں معمر نے زہری سے خبر دی ‘ انہیں عروہ نے اور ان سے حکیم بن حزام رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے عرض کیا یا رسول اللہ ! ان نیک کاموں سے متعلق آپ کیا فرماتے ہیں جنہیں میں جاہلیت کے زمانہ میں صدقہ ‘ غلام آزاد کرنے اور صلہ رحمی کی صورت میں کیا کرتا تھا ۔ کیا ان کا مجھے ثواب ملے گا ؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تم اپنی ان تمام نیکیوں کے ساتھ اسلام لائے ہو جو پہلے گزر چکی ہیں ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 113360,
        "last_updated": null
    },
    {
        "urduURN": 4014430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1437,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ انہوں نے کہا کہ ہم سے جریر نے اعمش سے بیان کیا ‘ ان سے ابووائل نے ‘ ان سے مسروق نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا کہ جب بیوی اپنے خاوند کے کھانے میں سے کچھ صدقہ کرے اور اس کی نیت اسے برباد کرنے کی نہیں ہوتی تو اسے بھی اس کا ثواب ملتا ہے اور اس کے خاوند کو کمانے کا ثواب ملتا ہے ۔ اسی طرح خزانچی کو بھی اس کا ثواب ملتا ہے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 113370,
        "last_updated": null
    },
    {
        "urduURN": 4014440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1438,
        "hadithSanad": "ہم سے محمد بن علاء نے بیان کیا ‘ کہا کہ ہم سے ابواسامہ نے بیان کیا ‘ ان سے برید بن عبداللہ نے ‘ ان سے ابوبردہ نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا",
        "hadithText": "«خازن» مسلمان امانتدار جو کچھ بھی خرچ کرتا ہے اور بعض دفعہ فرمایا وہ چیز پوری طرح دیتا ہے جس کا اسے سرمایہ کے مالک کی طرف سے حکم دیا گیا اور اس کا دل بھی اس سے خوش ہے اور اسی کو دیا ہے جسے دینے کے لیے مالک نے کہا تھا تو وہ دینے والا بھی صدقہ دینے والوں میں سے ایک ہے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 113380,
        "last_updated": null
    },
    {
        "urduURN": 4014450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1439,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ‘ کہا کہ ہمیں شعبہ نے خبر دی ‘ کہا کہ ہم سے منصور بن معمر اور اعمش دونوں نے بیان کیا ‘ ان سے ابووائل نے ‘ ان سے مسروق نے اور ان سے عائشہ رضی اللہ عنہا نے نبی کریم صلی اللہ علیہ وسلم کے حوالہ سے کہ",
        "hadithText": "جب کوئی عورت اپنے شوہر کے گھر ( کے مال ) سے صدقہ کرے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 113390,
        "last_updated": null
    },
    {
        "urduURN": 4014460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1440,
        "hadithSanad": "( دوسری سند ) امام بخاری نے کہا اور مجھ سے عمر بن حفص نے بیان کیا ‘ کہا کہ مجھ سے میرے باپ حفص بن غیاث نے بیان کیا ‘ کہا کہ ہم سے اعمش نے بیان کیا ‘ ان سے ابووائل شقیق نے ‘ ان سے مسروق نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا",
        "hadithText": "جب بیوی اپنے شوہر کے مال میں سے کسی کو کھلائے اور اس کا ارادہ گھر کو بگاڑنے کا بھی نہ ہو تو اسے اس کا ثواب ملتا ہے اور شوہر کو بھی ویسا ہی ثواب ملتا ہے اور خزانچی کو بھی ویسا ہی ثواب ملتا ہے ۔ شوہر کو کمانے کی وجہ سے ثواب ملتا ہے اور عورت کو خرچ کرنے کی وجہ سے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 113400,
        "last_updated": null
    },
    {
        "urduURN": 4014470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1441,
        "hadithSanad": "ہم سے یحییٰ بن یحییٰ نے بیان کیا ، کہا کہ ہم سے جریر بن عبدالحمید نے منصور سے بیان کیا ، ان سے ابووائل شقیق نے ، ان سے مسروق نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جب عورت اپنے گھر کے کھانے کی چیز سے اللہ کی راہ میں خرچ کرے اور اس کا ارادہ گھر کو بگاڑنے کا نہ ہو تو اسے اس کا ثواب ملے گا اور شوہر کو کمانے کا ثواب ملے گا ‘ اسی طرح خزانچی کو بھی ایسا ہی ثواب ملے گا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 113410,
        "last_updated": null
    },
    {
        "urduURN": 4014480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1442,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ‘ کہا کہ ہم سے میرے بھائی ابوبکر بن ابی اویس نے بیان کیا ‘ ان سے سلیمان بن بلال نے ‘ ان سے معاویہ بن ابی مزرد نے ‘ ان سے ابوالحباب سعید بن یسار نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا",
        "hadithText": "کوئی دن ایسا نہیں جاتا کہ جب بندے صبح کو اٹھتے ہیں تو دو فرشتے آسمان سے نہ اترتے ہوں ۔ ایک فرشتہ تو یہ کہتا ہے کہ اے اللہ ! خرچ کرنے والے کو اس کا بدلہ دے ۔ اور دوسرا کہتا ہے کہ اے اللہ ! «ممسك» اور بخیل کے مال کو تلف کر دے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 113420,
        "last_updated": null
    },
    {
        "urduURN": 4014490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1443,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ کہا کہ ہم سے وہیب نے بیان کیا ‘ کہا کہ ہم سے عبداللہ بن طاؤس نے بیان کیا ‘ ان سے ان کے باپ طاؤس نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ",
        "hadithText": "بخیل اور صدقہ دینے والے کی مثال ایسے دو شخصوں کی طرح ہے جن کے بدن پر لوہے کے دو کرتے ہیں ۔ ( دوسری سند ) امام بخاری رحمہ اللہ نے کہا اور ہم سے ابوالیمان نے بیان کیا ‘ کہا کہ ہمیں شعیب نے خبر دی ‘ کہا کہ ہمیں ابوالزناد نے خبر دی کہ عبداللہ بن ہرمز اعرج نے ان سے بیان کیا اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا اور ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم کو یہ کہتے سنا کہ بخیل اور خرچ کرنے والے کی مثال ایسے دو شخصوں کی سی ہے جن کے بدن پر لوہے کے دو کرتے ہوں چھاتیوں سے ہنسلی تک ۔ خرچ کرنے کا عادی ( سخی ) خرچ کرتا ہے تو اس کے تمام جسم کو ( وہ کرتہ ) چھپا لیتا ہے یا ( راوی نے یہ کہا کہ ) تمام جسم پر وہ پھیل جاتا ہے اور اس کی انگلیاں اس میں چھپ جاتی ہے اور چلنے میں اس کے پاؤں کا نشان مٹتا جاتا ہے ۔ لیکن بخیل جب بھی خرچ کرنے کا ارادہ کرتا ہے تو اس کرتے کا ہر حلقہ اپنی جگہ سے چمٹ جاتا ہے ۔ بخیل اسے کشادہ کرنے کی کوشش کرتا ہے لیکن وہ کشادہ نہیں ہو پاتا ۔ عبداللہ بن طاؤس کے ساتھ اس حدیث کو حسن بن مسلم نے بھی طاؤس سے روایت کیا ‘ اس میں دو کرتے ہیں ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 113430,
        "last_updated": null
    },
    {
        "urduURN": 4014500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1444,
        "hadithSanad": "اور حنظلہ نے طاؤس سے دو زرہیں نقل کیا ہے اور لیث بن سعد نے کہا مجھ سے جعفر بن ربیعہ نے بیان کیا ‘ انہوں نے عبدالرحمٰن بن ہر مز سے سنا کہا کہ میں نے ابوہریرہ رضی اللہ عنہ سے سنا",
        "hadithText": "انہوں نے آنحضرت صلی اللہ علیہ وسلم سے پھر یہی حدیث بیان کی اس میں دو زرہیں ہیں ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 113440,
        "last_updated": null
    },
    {
        "urduURN": 4014510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1445,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ‘ کہا کہ ہم سے شعبہ نے بیان کیا ‘ کہا کہ ہم سے سعید بن ابی بردہ نے بیان کیا ‘ ان سے ان کے باپ ابوبردہ نے ان کے دادا ابوموسیٰ اشعری سے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ",
        "hadithText": "ہر مسلمان پر صدقہ کرنا ضروری ہے ۔ لوگوں نے پوچھا اے اللہ کے نبی ! اگر کسی کے پاس کچھ نہ ہو ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر اپنے ہاتھ سے کچھ کما کر خود کو بھی نفع پہنچائے اور صدقہ بھی کرے ۔ لوگوں نے کہا اگر اس کی طاقت نہ ہو ؟ فرمایا کہ پھر کسی حاجت مند فریادی کی مدد کرے ۔ لوگوں نے کہا اگر اس کی بھی سکت نہ ہو ۔ فرمایا پھر اچھی بات پر عمل کرے اور بری باتوں سے باز رہے ۔ اس کا یہی صدقہ ہے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 113450,
        "last_updated": null
    },
    {
        "urduURN": 4014520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1446,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ‘ کہا کہ ہم سے ابوشہاب نے بیان کیا ‘ ان سے خالد حذاء نے ‘ ان سے حفصہ بنت سیرین نے اور ان سے ام عطیہ رضی اللہ عنہا نے کہ",
        "hadithText": "نسیبہ نامی ایک انصاری عورت کے ہاں کسی نے ایک بکری بھیجی ( یہ نسیبہ نامی انصاری عورت خود ام عطیہ رضی اللہ عنہا ہی کا نام ہے ) ۔ اس بکری کا گوشت انہوں نے حضرت عائشہ رضی اللہ عنہا کے یہاں بھی بھیج دیا ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے ان سے دریافت کیا کہ تمہارے پاس کھانے کو کوئی چیز ہے ؟ عائشہ رضی اللہ عنہا نے کہا کہ اور تو کوئی چیز نہیں البتہ اس بکری کا گوشت جو نسیبہ رضی اللہ عنہا نے بھیجا تھا ‘ وہ موجود ہے ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ وہی لاؤ اب اس کا کھانا درست ہو گیا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 113460,
        "last_updated": null
    },
    {
        "urduURN": 4014530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1447,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ‘ انہوں نے کہا کہ ہمیں امام مالک نے خبر دی ‘ انہیں عمرو بن یحییٰ مازنی نے ‘ انہیں ان کے باپ یحییٰ نے ۔ انہوں نے کہا کہ میں نے حضرت ابو سعید خدری رضی اللہ عنہ سے سنا ‘ انہوں نے کہا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ پانچ اونٹ سے کم میں زکوٰۃ نہیں اور پانچ اوقیہ سے کم ( چاندی ) میں زکوٰۃ نہیں ۔ اسی طرح پانچ وسق سے کم ( غلہ ) میں زکوٰۃ نہیں ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 0,
        "last_updated": null
    },
    {
        "urduURN": 4014540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1448,
        "hadithSanad": "ہم سے محمد بن عبداللہ نے بیان کیا ۔ کہا کہ مجھ سے میرے والد عبداللہ بن مثنی نے بیان کیا ۔ کہا کہ مجھ سے ثمامہ بن عبداللہ نے بیان کیا ۔ ان سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "ابوبکر صدیق رضی اللہ عنہ نے انہیں ( اپنے دور خلافت میں فرض زکوٰۃ سے متعلق ہدایت دیتے ہوئے ) اللہ اور رسول کے حکم کے مطابق یہ فرمان لکھا کہ جس کا صدقہ ”بنت مخاض“ تک پہنچ گیا ہو اور اس کے پاس ”بنت مخاض“ نہیں بلکہ ”بنت لبون“ ہے ۔ تو اس سے وہی لے لیا جائے گا اور اس کے بدلہ میں صدقہ وصول کرنے والا بیس درہم یا دو بکریاں زائد دیدے گا اور اگر اس کے پاس ”بنت مخاض“ نہیں ہے بلکہ ”ابن لبون“ ہے تو یہ ”ابن لبون“ ہی لے لیا جائے گا اور اس صورت میں کچھ نہیں دیا جائے گا ‘ وہ مادہ یا نر اونٹ جو تیسرے سال میں لگا ہو ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 113490,
        "last_updated": null
    },
    {
        "urduURN": 4014550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1449,
        "hadithSanad": "ہم سے مؤمل بن ہشام نے بیان کیا ‘ کہا کہ ہم سے اسماعیل نے ایوب سے بیان کیا اور ان سے عطاء  بن ابی رباح نے کہ ابن عباس رضی اللہ عنہما نے بتلایا",
        "hadithText": "اس وقت میں موجود تھا جب رسول اللہ صلی اللہ علیہ وسلم نے خطبہ سے پہلے نماز ( عید ) پڑھی ۔ پھر آپ صلی اللہ علیہ وسلم نے دیکھا کہ عورتوں تک آپ صلی اللہ علیہ وسلم کی آواز نہیں پہنچی ‘ اس لیے آپ صلی اللہ علیہ وسلم ان کے پاس بھی آئے ۔ آپ صلی اللہ علیہ وسلم کے ساتھ بلال رضی اللہ عنہ تھے جو اپنا کپڑا پھیلائے ہوئے تھے ۔ آپ صلی اللہ علیہ وسلم نے عورتوں کو وعظ سنایا اور ان سے صدقہ کرنے کے لیے فرمایا اور عورتیں ( اپنا صدقہ بلال رضی اللہ عنہ کے کپڑے میں ) ڈالنے لگیں ۔ یہ کہتے وقت ایوب نے اپنے کان اور گلے کی طرف اشارہ کیا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 113500,
        "last_updated": null
    },
    {
        "urduURN": 4014560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1450,
        "hadithSanad": "ہم سے محمد بن عبداللہ انصاری نے بیان کیا ‘ کہا کہ مجھ سے میرے والد نے بیان کیا ‘ کہا کہ مجھ سے ثمامہ نے بیان کیا ‘ اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ابوبکر رضی اللہ عنہ نے انہیں وہی چیز لکھی تھی جسے رسول اللہ صلی اللہ علیہ وسلم نے ضروری قرار دیا تھا ۔ یہ کہ زکوٰۃ ( کی زیادتی ) کے خوف سے جدا جدا مال کو یکجا اور یکجا مال کو جدا جدا نہ کیا جائے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 113510,
        "last_updated": null
    },
    {
        "urduURN": 4014570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1451,
        "hadithSanad": "ہم سے محمد بن عبداللہ نے بیان کیا ‘ کہا کہ مجھ سے میرے باپ نے بیان کیا ‘ کہا کہ مجھ سے ثمامہ نے بیان کیا اور ان سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "ابوبکر رضی اللہ عنہ نے انہیں فرض زکوٰۃ میں وہی بات لکھی تھی جو رسول اللہ صلی اللہ علیہ وسلم نے مقرر فرمائی تھی اس میں یہ بھی لکھوایا تھا کہ جب دو شریک ہوں تو وہ اپنا حساب برابر کر لیں ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 113520,
        "last_updated": null
    },
    {
        "urduURN": 4014580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1452,
        "hadithSanad": "ہم سے علی بن عبداللہ بن مدینی نے بیان کیا ‘ کہا کہ مجھ سے ولید بن مسلم نے بیان کیا ‘ کہا کہ ہم سے امام اوزاعی نے بیان کیا ‘ کہا کہ مجھ سے ابن شہاب نے بیان کیا ‘ ان سے عطاء بن یزید نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے کہ",
        "hadithText": "ایک دیہاتی نے رسول اللہ صلی اللہ علیہ وسلم سے ہجرت کے متعلق پوچھا ( یعنی یہ کہ آپ صلی اللہ علیہ وسلم اجازت دیں تو میں مدینہ میں ہجرت کر آؤں ) آپ صلی اللہ علیہ وسلم نے فرمایا ۔ افسوس ! اس کی تو شان بڑی ہے ۔ کیا تیرے پاس زکوٰۃ دینے کے لیے کچھ اونٹ ہیں جن کی تو زکوٰۃ دیا کرتا ہے ؟ اس نے کہا کہ ہاں ! اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر کیا ہے سمندروں کے اس پار ( جس ملک میں تو رہے وہاں ) عمل کرتا رہ اللہ تیرے کسی عمل کا ثواب کم نہیں کرے گا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 113530,
        "last_updated": null
    },
    {
        "urduURN": 4014590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1453,
        "hadithSanad": "ہم سے محمد بن عبداللہ انصاری نے بیان کیا ‘ کہا کہ مجھ سے میرے باپ نے بیان کیا ‘ کہا کہ مجھ سے ثمامہ نے بیان کیا اور ان سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "ابوبکر رضی اللہ عنہ نے ان کے پاس فرض زکوٰۃ کے ان فریضوں کے متعلق لکھا تھا جن کا اللہ نے اپنے رسول صلی اللہ علیہ وسلم کو حکم دیا ہے ۔ یہ کہ جس کے اونٹوں کی زکوٰۃ ”جذعہ“ تک پہنچ جائے اور وہ ”جذعہ“ اس کے پاس نہ ہو بلکہ ”حقہ“ ہو تو اس سے زکوٰۃ میں ”حقہ“ ہی لے لیا جائے گا لیکن اس کے ساتھ دو بکریاں بھی لی جائیں گی ‘ اگر ان کے دینے میں اسے آسانی ہو ورنہ بیس درہم لیے جائیں گے ۔ ( تاکہ ”حقہ“ کی کمی پوری ہو جائے ) اور اگر کسی پر زکوٰۃ میں ”حقہ“ واجب ہو اور ”حقہ“ اس کے پاس نہ ہو بلکہ ”جذعہ“ ہو تو اس سے ”جذعہ“ ہی لے لیا جائے گا اور زکوٰۃ وصول کرنے والا زکوٰۃ دینے والے کو بیس درہم یا دو بکریاں دے گا اور اگر کسی پر زکوٰۃ ”حقہ“ کے برابر واجب ہو گئی اور اس کے پاس صرف ”بنت لبون“ ہے تو اس سے ”بنت لبون“ لے لی جائے گی اور زکوٰۃ دینے والے کو دو بکریاں یا بیس درہم ساتھ میں اور دینے پڑیں گے اور اگر کسی پر زکوٰۃ ”بنت لبون“ واجب ہو اور اس کے پاس ”حقہ“ ہو تو ”حقہ“ ہی اس سے لے لیا جائے گا اور اس صورت میں زکوٰۃ وصول کرنے والا بیس درہم یا دو بکریاں زکوٰۃ دینے والے کو دے گا اور کسی کے پاس زکوٰۃ میں ”بنت لبون“ واجب ہوا اور ”بنت لبون“ اس کے پاس نہیں بلکہ ”بنت مخاض“ ہے تو اس سے ”بنت مخاض“ ہی لے لیا جائے گا ۔ لیکن زکوٰۃ دینے والا اس کے ساتھ بیس درہم یا دو بکریاں دے گا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 113540,
        "last_updated": null
    },
    {
        "urduURN": 4014600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1454,
        "hadithSanad": "ہم سے محمد بن عبداللہ بن مثنیٰ انصاری نے بیان کیا ‘ انہوں نے کہا کہ مجھ سے میرے والد نے بیان کیا ‘ انہوں نے کہا کہ مجھ ثمامہ بن عبداللہ بن انس نے بیان کیا ‘ ان سے انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "ابوبکر رضی اللہ عنہ نے جب انہیں بحرین ( کا حاکم بنا کر ) بھیجا تو ان کو یہ پروانہ لکھ دیا ۔  شروع اللہ کے نام سے جو بڑا مہربان نہایت رحم کرنے والا ہے ۔  یہ زکوٰۃ کا وہ فریضہ ہے جسے رسول اللہ صلی اللہ علیہ وسلم نے مسلمانوں کے لیے فرض قرار دیا ہے اور رسول اللہ صلی اللہ علیہ وسلم کو اللہ تعالیٰ نے اس کا حکم دیا ۔ اس لیے جو شخص مسلمانوں سے اس پروانہ کے مطابق زکوٰۃ مانگے تو مسلمانوں کو اسے دے دینا چاہیے اور اگر کوئی اس سے زیادہ مانگے تو ہرگز نہ دے ۔ چوبیس یا اس سے کم اونٹوں میں ہر پانچ اونٹ پر ایک بکری دینی ہو گی ۔ ( پانچ سے کم میں کچھ نہیں ) لیکن جب اونٹوں کی تعداد پچیس تک پہنچ جائے تو پچیس سے پینتیس تک ایک ایک برس کی اونٹنی واجب ہو گی جو مادہ ہوتی ہے ۔ جب اونٹ کی تعداد چھتیس تک پہنچ جائے ( تو چھتیس سے ) پینتالیس تک دو برس کی مادہ واجب ہو گی ۔ جب تعداد چھیالیس تک پہنچ جائے ( تو چھیالیس سے ) ساٹھ تک میں تین برس کی اونٹنی واجب ہو گی جو جفتی کے قابل ہوتی ہے ۔ جب تعداد اکسٹھ تک پہنچ جائے ( تو اکسٹھ سے ) پچھتر تک چار برس کی مادہ واجب ہو گی ۔ جب تعداد چھہتر تک پہنچ جائے ( تو چھہتر سے ) نوے تک دو دو برس کی دو اونٹنیاں واجب ہوں گی ۔ جب تعداد اکیانوے تک پہنچ جائے تو ( اکیانوے سے ) ایک سو بیس تک تین تین برس کی دو اونٹنیاں واجب ہوں گی جو جفتی کے قابل ہوں ۔ پھر ایک سو بیس سے بھی تعداد آگے بڑھ جائے تو ہر چالیس پر دو برس کی اونٹنی واجب ہو گی اور ہر پچاس پر ایک تین برس کی ۔ اور اگر کسی کے پاس چار اونٹ سے زیادہ نہیں تو اس پر زکوٰۃ واجب نہ ہو گی مگر جب ان کا مالک اپنی خوشی سے کچھ دے اور ان بکریوں کی زکوٰۃ جو ( سال کے اکثر حصے جنگل یا میدان وغیرہ میں ) چر کر گزارتی ہیں اگر ان کی تعداد چالیس تک پہنچ گئی ہو تو ( چالیس سے ) ایک سو بیس تک ایک بکری واجب ہو گی اور جب ایک سو بیس سے تعداد بڑھ جائے ( تو ایک سو بیس سے ) سے دو سو تک دو بکریاں واجب ہوں گی ۔ اگر دو سو سے بھی تعداد بڑھ جائے تو ( تو دو سو سے ) تین سو تک تین بکریاں واجب ہوں گی اور جب تین سو سے بھی تعداد آگے نکل جائے تو اب ہر ایک سو پر ایک بکری واجب ہو گی ۔ اگر کسی شخص کی چرنے والی بکریاں چالیس سے ایک بھی کم ہوں تو ان پر زکوٰۃ واجب نہیں ہو گی مگر اپنی خوشی سے مالک کچھ دینا چاہے تو دے سکتا ہے ۔ اور چاندی میں زکوٰۃ چالیسواں حصہ واجب ہو گی لیکن اگر کسی کے پاس ایک سو نوے ( درہم ) سے زیادہ نہیں ہیں تو اس پر زکوٰۃ واجب نہیں ہو گی مگر خوشی سے کچھ اگر مالک دینا چاہیے تو اور بات ہے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 113550,
        "last_updated": null
    },
    {
        "urduURN": 4014610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1455,
        "hadithSanad": "ہم سے محمد بن عبداللہ نے بیان کیا ‘ انہوں نے کہا کہ مجھ سے میرے باپ نے بیان کیا ‘ انہوں نے کہا مجھ سے ثمامہ نے بیان کیا ‘ ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "حضرت ابوبکر رضی اللہ عنہ نے انہیں رسول اللہ صلی اللہ علیہ وسلم کے بیان کردہ احکام زکوٰۃ کے مطابق لکھا کہ زکوٰۃ میں بوڑھے ، عیبی اور نر نہ لیے جائیں ‘ البتہ اگر صدقہ وصول کرنے والا مناسب سمجھے تو لے سکتا ہے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 113560,
        "last_updated": null
    },
    {
        "urduURN": 4014620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1456,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا کہ ہمیں شعیب نے خبر دی اور انہیں زہری نے ( دوسری سند ) اور لیث بن سعد نے بیان کیا کہ مجھ سے عبدالرحمٰن بن خالد نے بیان کیا ‘ ان سے ابن شہاب نے ‘ ان سے عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے کہ ابوہریرہ رضی اللہ عنہ نے بتلایا کہ",
        "hadithText": "ابوبکر رضی اللہ عنہ نے ( آنحضور صلی اللہ علیہ وسلم کی وفات کے فوراً بعد زکوٰۃ دینے سے انکار کرنے والوں کے متعلق فرمایا تھا ) قسم اللہ کی اگر یہ مجھے بکری کے ایک بچہ کو بھی دینے سے انکار کریں گے جسے یہ رسول اللہ صلی اللہ علیہ وسلم کو دیا کرتے تھے تو میں ان کے اس انکار پر ان سے جہاد کروں گا ۔ \n<span class=urdu_sanad>عمر رضی اللہ عنہ نے فرمایا</span> اس کے سوا اور کوئی بات نہیں تھی جیسا کہ میں سمجھتا ہوں کہ اللہ تعالیٰ نے ابوبکر رضی اللہ عنہ کو جہاد کے لیے «شرح صدر» عطا فرمایا تھا اور پھر میں نے بھی یہی سمجھا کہ فیصلہ انہیں کا حق تھا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 113571,
        "last_updated": null
    },
    {
        "urduURN": 4014640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1458,
        "hadithSanad": "ہم سے امیہ بن بسطام نے بیان کیا ‘ انہوں نے کہا ہم سے زید بن زریع نے بیان کیا ‘ انہوں نے کہا کہ ہم سے روح بن قاسم نے بیان کیا ‘ ان سے اسماعیل بن امیہ نے ‘ ان سے یحییٰ بن عبداللہ بن صیفی نے ‘ ان سے ابومعبد نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "جب رسول اللہ صلی اللہ علیہ وسلم نے معاذ رضی اللہ عنہ کو یمن بھیجا تو ان سے فرمایا کہ دیکھو ! تم ایک ایسی قوم کے پاس جا رہے ہو جو اہل کتاب ( عیسائی یہودی ) ہیں ۔ اس لیے سب سے پہلے انہیں اللہ کی عبادت کی دعوت دینا ۔ جب وہ اللہ تعالیٰ کو پہچان لیں ( یعنی اسلام قبول کر لیں ) تو انہیں بتانا کہ اللہ تعالیٰ نے ان کے لیے دن اور رات میں پانچ نمازیں فرض کی ہیں ۔ جب وہ اسے بھی ادا کریں تو انہیں بتانا کہ اللہ تعالیٰ نے ان پر زکوٰۃ فرض قرار دی ہے جو ان کے سرمایہ داروں سے لی جائے گی ( جو صاحب نصاب ہوں گے ) اور انہیں کے فقیروں میں تقسیم کر دی جائے گی ۔ جب وہ اسے بھی مان لیں تو ان سے زکوٰۃ وصول کر ۔ البتہ ان کی عمدہ چیزیں ( زکوٰۃ کے طور پر لینے سے ) پرہیز کرنا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 113590,
        "last_updated": null
    },
    {
        "urduURN": 4014650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1459,
        "hadithSanad": "ہم عبداللہ بن یوسف تنیسی نے بیان کیا ‘ انہوں نے کہا کہ ہمیں امام مالک نے خبر دی ‘ انہیں محمد بن عبدالرحمٰن بن ابی صعصعہ مازنی نے ‘ انہیں ان کے باپ نے اور انہیں حضرت ابو سعید خدری رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ",
        "hadithText": "پانچ وسق سے کم کھجوروں میں زکوٰۃ نہیں اور پانچ اوقیہ سے کم چاندی میں زکوٰۃ نہیں ۔ اسی طرح پانچ اونٹوں سے کم میں زکوٰۃ نہیں ہے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 113600,
        "last_updated": null
    },
    {
        "urduURN": 4014660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1460,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ‘ کہا کہ ہم سے میرے باپ نے بیان کیا ‘ کہا کہ ہم سے اعمش نے معرور بن سوید سے بیان کیا ‘ ان سے ابوذر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کے قریب پہنچ گیا تھا اور آپ صلی اللہ علیہ وسلم فرما رہے تھے ۔ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے یا ( آپ صلی اللہ علیہ وسلم نے قسم اس طرح کھائی ) اس ذات کی قسم جس کے سوا کوئی معبود نہیں ۔ یا جن الفاظ کے ساتھ بھی آپ نے قسم کھائی ہو ( اس تاکید کے بعد فرمایا ) کوئی بھی ایسا شخص جس کے پاس اونٹ گائے یا بکری ہو اور وہ اس کا حق ادا نہ کرتا ہو تو قیامت کے دن اسے لایا جائے گا ۔ دنیا سے زیادہ بڑی اور موٹی تازہ کر کے ۔ پھر وہ اپنے مالک کو اپنے کھروں سے روندے گی اور سینگ مارے گی ۔ جب آخری جانور اس پر سے گزر جائے گا تو پہلا جانور پھر لوٹ کر آئے گا ۔ ( اور اسے اپنے سینگ مارے گا اور کھروں سے روندے گا ) اس وقت تک ( یہ سلسلہ برابر قائم رہے گا ) جب تک لوگوں کا فیصلہ نہیں ہو جاتا ۔ اس حدیث کو بکیر بن عبداللہ نے ابوصالح سے روایت کیا ہے ‘ انہوں نے ابوہریرہ رضی اللہ عنہ سے اور انہوں نبی کریم صلی اللہ علیہ وسلم سے ۔ باب اپنے رشتہ داروں کو زکوٰۃ دینا اور نبی کریم صلی اللہ علیہ وسلم نے ( زینب کے حق میں فرمایا جو عبداللہ بن مسعود کی بیوی تھی ) اس کو دو گنا ثواب ملے گا ‘ ناطہٰ جوڑنے اور صدقے کا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 113610,
        "last_updated": null
    },
    {
        "urduURN": 4014670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1461,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ کہا کہ ہم سے امام مالک رحمہ اللہ نے بیان کیا ‘ ان سے اسحاق بن عبداللہ بن ابی طلحہ نے ‘ کہ انہوں نے انس بن مالک رضی اللہ عنہ سے سنا ‘ انہوں نے کہا کہ",
        "hadithText": "ابوطلحہ رضی اللہ عنہ مدینہ میں انصار میں سب سے زیادہ مالدار تھے ۔ اپنے کھجور کے باغات کی وجہ سے ۔ اور اپنے باغات میں سب سے زیادہ پسند انہیں بیرحاء کا باغ تھا ۔ یہ باغ مسجد نبوی کے بالکل سامنے تھا ۔ اور رسول اللہ صلی اللہ علیہ وسلم اس میں تشریف لے جایا کرتے اور اس کا میٹھا پانی پیا کرتے تھے ۔ انس رضی اللہ عنہ نے بیان کیا کہ جب یہ آیت نازل ہوئی «لن تنالوا البر حتى تنفقوا مما تحبون‏» یعنی ” تم نیکی کو اس وقت تک نہیں پا سکتے جب تک تم اپنی پیاری سے پیاری چیز نہ خرچ کرو ۔ “ یہ سن کر ابوطلحہ رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا کہ اے اللہ کے رسول ! اللہ تبارک وتعالیٰ فرماتا ہے کہ تم اس وقت تک نیکی کو نہیں پا سکتے جب تک تم اپنی پیاری سے پیاری چیز نہ خرچ کرو ۔ اور مجھے بیرحاء کا باغ سب سے زیادہ پیارا ہے ۔ اس لیے میں اسے اللہ تعالیٰ کے لیے خیرات کرتا ہوں ۔ اس کی نیکی اور اس کے ذخیرہ آخرت ہونے کا امیدوار ہوں ۔ اللہ کے حکم سے جہاں آپ صلی اللہ علیہ وسلم مناسب سمجھیں اسے استعمال کیجئے ۔ راوی نے بیان کیا کہ یہ سن کر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ خوب ! یہ تو بڑا ہی آمدنی کا مال ہے ۔ یہ تو بہت ہی نفع بخش ہے ۔ اور جو بات تم نے کہی میں نے وہ سن لی ۔ اور میں مناسب سمجھتا ہوں کہ تم اسے اپنے نزدیکی رشتہ داروں کو دے ڈالو ۔ ابوطلحہ رضی اللہ عنہ نے کہا ۔ یا رسول اللہ ! میں ایسا ہی کروں گا ۔ چنانچہ انہوں نے اسے اپنے رشتہ داروں اور چچا کے لڑکوں کو دے دیا ۔ عبداللہ بن یوسف کے ساتھ اس روایت کی متابعت روح نے کی ہے ۔ یحییٰ بن یحییٰ اور اسماعیل نے مالک کے واسطہ سے ( «رابح» کے بجائے ) «رائح» نقل کیا ہے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 113620,
        "last_updated": null
    },
    {
        "urduURN": 4014680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1462,
        "hadithSanad": "ہم سے سعید بن ابی مریم نے بیان کیا ‘ انہوں نے کہا کہ ہمیں محمد بن جعفر نے خبر دی ‘ انہوں نے کہا کہ مجھے زید بن اسلم نے خبر دی ‘ انہیں عیاض بن عبداللہ نے ‘ اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا ‘ کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم عید الاضحی یا عیدالفطر میں عیدگاہ تشریف لے گئے ۔ پھر ( نماز کے بعد ) لوگوں کو وعظ فرمایا اور صدقہ کا حکم دیا ۔ فرمایا : لوگو ! صدقہ دو ۔ پھر آپ صلی اللہ علیہ وسلم عورتوں کی طرف گئے اور ان سے بھی یہی فرمایا کہ عورتو ! صدقہ دو کہ میں نے جہنم میں بکثرت تم ہی کو دیکھا ہے ۔ عورتوں نے پوچھا کہ یا رسول اللہ ! ایسا کیوں ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ‘ اس لیے کہ تم لعن وطعن زیادہ کرتی ہو اور اپنے شوہر کی ناشکری کرتی ہو ۔ میں نے تم سے زیادہ عقل اور دین کے اعتبار سے ناقص ایسی کوئی مخلوق نہیں دیکھی جو کار آزمودہ مرد کی عقل کو بھی اپنی مٹھی میں لے لیتی ہو ۔ ہاں اے عورتو ! پھر آپ صلی اللہ علیہ وسلم واپس گھر پہنچے تو ابن مسعود رضی اللہ عنہ کی بیوی زینب رضی اللہ عنہا آئیں اور اجازت چاہی ۔ آپ صلی اللہ علیہ وسلم سے کہا گیا کہ یہ زینب آئی ہیں ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کون سی زینب ( کیونکہ زینب نام کی بہت سی عورتیں تھیں ) کہا گیا کہ ابن مسعود رضی اللہ عنہ کی بیوی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ۔ اچھا انہیں اجازت دے دو ‘ چنانچہ اجازت دے دی گئی ۔ انہوں نے آ کر عرض کیا کہ یا رسول اللہ ! آج آپ نے صدقہ کا حکم دیا تھا ۔ اور میرے پاس بھی کچھ زیور ہے جسے میں صدقہ کرنا چاہتی تھی ۔ لیکن ( میرے خاوند ) ابن مسعود رضی اللہ عنہ یہ خیال کرتے ہیں کہ وہ اور ان کے لڑکے اس کے ان ( مسکینوں ) سے زیادہ مستحق ہیں جن پر میں صدقہ کروں گی ۔ رسول اللہ صلی اللہ علیہ وسلم نے اس پر فرمایا کہ ابن مسعود رضی اللہ عنہ نے صحیح کہا ۔ تمہارے شوہر اور تمہارے لڑکے اس صدقہ کے ان سے زیادہ مستحق ہیں جنہیں تم صدقہ کے طور پر دو گی ۔ ( معلوم ہوا کہ اقارب اگر محتاج ہوں تو صدقہ کے اولین مستحق وہی ہیں ) ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 113630,
        "last_updated": null
    },
    {
        "urduURN": 4014690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1463,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ‘ انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا ‘ انہوں نے کہا کہ ہم سے عبداللہ بن دینار نے بیان کیا ‘ انہوں نے کہا کہ میں نے سلیمان بن یسار سے سنا ‘ ان سے عراک بن مالک نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا",
        "hadithText": "مسلمان پر اس کے گھوڑے اور غلام کی زکوٰۃ واجب نہیں ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 113640,
        "last_updated": null
    },
    {
        "urduURN": 4014700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1464,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ‘ انہوں نے کہا کہ ہم سے یحییٰ بن سعید نے بیان کیا ، ان سے خثیم بن عراک بن مالک نے ، انہوں نے کہا کہ مجھ سے میرے باپ نے بیان کیا ، اور ان سے ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم کے حوالہ سے ( دوسری سند ) اور ہم سے سلیمان بن حرب نے بیان کیا ، کہا کہ ہم سے وہیب بن خالد نے بیان کیا ، کہا کہ ہم سے خثیم بن عراک بن مالک نے بیان کیا ، انہوں نے اپنے باپ سے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا مسلمان پر نہ اس کے غلام میں زکوٰۃ فرض ہے اور نہ گھوڑے میں ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 113650,
        "last_updated": null
    },
    {
        "urduURN": 4014710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1465,
        "hadithSanad": "ہم سے معاذ بن فضالہ نے بیان کیا ‘ کہا کہ مجھ سے ہشام دستوائی نے ‘ یحییٰ سے بیان کیا ۔ ان سے ہلال بن ابی میمونہ نے بیان کیا ‘ کہا کہ ہم سے عطاء بن یسار نے بیان کیا ‘ اور انہوں نے ابو سعید خدری رضی اللہ عنہ سے سنا ‘ وہ کہتے تھے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ایک دن منبر پر تشریف فرما ہوئے ۔ ہم بھی آپ صلی اللہ علیہ وسلم کے اردگرد بیٹھ گئے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں تمہارے متعلق اس بات سے ڈرتا ہوں کہ تم پر دنیا کی خوشحالی اور اس کی زیبائش و آرائش کے دروازے کھول دئیے جائیں گے ۔ ایک شخص نے عرض کیا ۔ یا رسول اللہ ! کیا اچھائی برائی پیدا کرے گی ؟ اس پر نبی کریم صلی اللہ علیہ وسلم خاموش ہو گئے ۔ اس لیے اس شخص سے کہا جانے لگا کہ کیا بات تھی ۔ تم نے نبی کریم صلی اللہ علیہ وسلم سے ایک بات پوچھی لیکن آنحضور صلی اللہ علیہ وسلم تم سے بات نہیں کرتے ۔ پھر ہم نے محسوس کیا کہ آپ صلی اللہ علیہ وسلم پر وحی نازل ہو رہی ہے ۔ بیان کیا کہ پھر آنحضور صلی اللہ علیہ وسلم نے پسینہ صاف کیا ( جو وحی نازل ہوتے وقت آپ صلی اللہ علیہ وسلم کو آنے لگتا تھا ) پھر پوچھا کہ سوال کرنے والے صاحب کہاں ہیں ۔ ہم نے محسوس کیا کہ آپ صلی اللہ علیہ وسلم نے اس کے ( سوال کی ) تعریف کی ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اچھائی برائی نہیں پیدا کرتی ( مگر بے موقع استعمال سے برائی پیدا ہوتی ہے ) کیونکہ موسم بہار میں بعض ایسی گھاس بھی اگتی ہیں جو جان لیوا یا تکلیف دہ ثابت ہوتی ہیں ۔ البتہ ہریالی چرنے والا وہ جانور بچ جاتا ہے کہ خوب چرتا ہے اور جب اس کی دونوں کوکھیں بھر جاتی ہیں تو سورج کی طرف رخ کر کے پاخانہ پیشاب کر دیتا ہے اور پھر چرتا ہے ۔ اسی طرح یہ مال و دولت بھی ایک خوشگوار سبزہ زار ہے ۔ اور مسلمان کا وہ مال کتنا عمدہ ہے جو مسکین ‘ یتیم اور مسافر کو دیا جائے ۔ یا جس طرح نبی کریم صلی اللہ علیہ وسلم نے ارشاد فرمایا ۔ ہاں اگر کوئی شخص زکوٰۃ حقدار ہونے کے بغیر لیتا ہے تو اس کی مثال ایسے شخص کی سی ہے جو کھاتا ہے لیکن اس کا پیٹ نہیں بھرتا ۔ اور قیامت کے دن یہ مال اس کے خلاف گواہ ہو گا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 113660,
        "last_updated": null
    },
    {
        "urduURN": 4014720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1466,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ‘ کہا کہ ہم سے میرے باپ نے بیان کیا ‘ کہا کہ ہم سے اعمش نے بیان کیا ‘ ان سے شقیق نے ‘ ان سے عمرو بن الحارث نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ کی بیوی زینب رضی اللہ عنہا نے ۔ ( اعمش نے ) کہا کہ میں نے اس حدیث کا ذکر ابراہیم نحعی سے کیا ۔ تو انہوں نے بھی مجھ سے ابوعبیدہ سے بیان کیا ۔ ان سے عمرو بن حارث نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ کی بیوی زینب نے ‘ بالکل اسی طرح حدیث بیان کی ( جس طرح شقیق نے کی کہ ) زینب رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میں مسجد نبوی میں تھی ۔ رسول اللہ صلی اللہ علیہ وسلم کو میں نے دیکھا ۔ آپ صلی اللہ علیہ وسلم یہ فرما رہے تھے ‘ صدقہ کرو ‘ خواہ اپنے زیور ہی میں سے دو ۔ اور زینب اپنا صدقہ اپنے شوہر حضرت عبداللہ بن مسعود رضی اللہ عنہ اور چند یتیموں پر بھی جو ان کی پرورش میں تھے خرچ کیا کرتی تھیں ۔ اس لیے انہوں نے اپنے خاوند سے کہا کہ آپ رسول اللہ صلی اللہ علیہ وسلم سے پوچھئے کہ کیا وہ صدقہ بھی مجھ سے کفایت کرے گا جو میں آپ پر اور ان چند یتیموں پر خرچ کروں جو میری سپردگی میں ہیں ۔ لیکن عبداللہ بن مسعود رضی اللہ عنہ نے کہا کہ تم خود جا کر رسول اللہ صلی اللہ علیہ وسلم سے پوچھ لو ۔ آخر میں خود رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی ۔ اس وقت میں نے آپ صلی اللہ علیہ وسلم کے دروازے پر ایک انصاری خاتون کو پایا ۔ جو میری ہی جیسی ضرورت لے کر موجود تھیں ۔ ( جو زینب ابومسعود انصاری کی بیوی تھیں ) پھر ہمارے سامنے سے بلال گذرے ۔ تو ہم نے ان سے کہا کہ آپ رسول اللہ صلی اللہ علیہ وسلم سے یہ مسئلہ دریافت کیجئے کہ کیا وہ صدقہ مجھ سے کفایت کرے گا جسے میں اپنے شوہر اور اپنی زیر تحویل چند یتیم بچوں پر خرچ کر دوں ۔ ہم نے بلال سے یہ بھی کہا کہ ہمارا نام نہ لینا ۔ وہ اندر گئے اور آپ صلی اللہ علیہ وسلم سے عرض کیا کہ دو عورتیں مسئلہ دریافت کرتی ہیں ۔ تو حضور صلی اللہ علیہ وسلم نے فرمایا کہ یہ دونوں کون ہیں ؟ بلال رضی اللہ عنہ نے کہہ دیا کہ زینب نام کی ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ کون سی زینب ؟ بلال رضی اللہ عنہ نے کہا کہ عبداللہ بن مسعود رضی اللہ عنہ کی بیوی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں ! بیشک درست ہے ۔ اور انہیں دو گنا ثواب ملے گا ۔ ایک قرابت داری کا اور دوسرا خیرات کرنے کا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 113670,
        "last_updated": null
    },
    {
        "urduURN": 4014730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1467,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ‘ کہا کہ ہم سے عبدہ نے ‘ ان سے ہشام نے بیان کیا ‘ ان سے ان کے باپ نے ‘ ان سے زینب بنت ام سلمہ نے ‘ ان سے ام سلمہ نے ‘ انہوں نے کہا کہ",
        "hadithText": "میں نے عرض کیا ‘ یا رسول اللہ ! اگر میں ابوسلمہ ( اپنے پہلے خاوند ) کے بیٹوں پر خرچ کروں تو درست ہے یا نہیں ۔ کیونکہ وہ میری بھی اولاد ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں ان پر خرچ کر ۔ تو جو کچھ بھی ان پر خرچ کرے گی اس کا ثواب تجھ کو ملے گا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 113680,
        "last_updated": null
    },
    {
        "urduURN": 4014740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1468,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ‘ کہا کہ ہمیں شعیب نے خبر دی ‘ کہا کہ ہم سے ابوالزناد نے اعرج سے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے زکوٰۃ وصول کرنے کا حکم دیا ۔ پھر آپ صلی اللہ علیہ وسلم سے کہا گیا کہ ابن جمیل اور خالد بن ولید اور عباس بن عبدالمطلب نے زکوٰۃ دینے سے انکار کر دیا ہے ۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ابن جمیل یہ شکر نہیں کرتا کہ کل تک وہ فقیر تھا ۔ پھر اللہ نے اپنے رسول کی دعا کی برکت سے اسے مالدار بنا دیا ۔ باقی رہے خالد ‘ تو ان پر تم لوگ ظلم کرتے ہو ۔ انہوں نے تو اپنی زرہیں اللہ تعالیٰ کے راستے میں وقف کر رکھی ہیں ۔ اور عباس بن عبدالمطلب ‘ تو وہ رسول اللہ صلی اللہ علیہ وسلم کے چچا ہیں ۔ اور ان کی زکوٰۃ انہی پر صدقہ ہے ۔ اور اتنا ہی اور انہیں میری طرف سے دینا ہے ۔ اس روایت کی متابعت ابوالزناد نے اپنے والد سے کی اور ابن اسحاق نے ابوالزناد سے یہ الفاظ بیان کیے ۔ «هي عليه ومثلها معها» ( صدقہ کے لفظ کے بغیر ) اور ابن جریج نے کہا کہ مجھ سے اعرج سے اسی طرح یہ حدیث بیان کی گئی ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 113690,
        "last_updated": null
    },
    {
        "urduURN": 4014750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1469,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ کہا کہ ہمیں امام مالک نے ‘ ابن شہاب سے خبر دی ‘ انہیں عطاء بن یزید لیثی نے اور انہیں ابو سعید خدری رضی اللہ عنہ نے کہ",
        "hadithText": "انصار کے کچھ لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے سوال کیا تو آپ صلی اللہ علیہ وسلم نے انہیں دیا ۔ پھر انہوں نے سوال کیا اور آپ صلی اللہ علیہ وسلم نے پھر دیا ۔ یہاں تک کہ جو مال آپ صلی اللہ علیہ وسلم کے پاس تھا ۔ اب وہ ختم ہو گیا ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر میرے پاس جو مال و دولت ہو تو میں اسے بچا کر نہیں رکھوں گا ۔ مگر جو شخص سوال کرنے سے بچتا ہے تو اللہ تعالیٰ بھی اسے سوال کرنے سے محفوظ ہی رکھتا ہے ۔ اور جو شخص بے نیازی برتتا ہے تو اللہ تعالیٰ اسے بےنیاز بنا دیتا ہے اور جو شخص اپنے اوپر زور ڈال کر بھی صبر کرتا ہے تو اللہ تعالیٰ بھی اسے صبر و استقلال دے دیتا ہے ۔ اور کسی کو بھی صبر سے زیادہ بہتر اور اس سے زیادہ بے پایاں خیر نہیں ملی ۔ ( صبر تمام نعمتوں سے بڑھ کر ہے ) ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 113700,
        "last_updated": null
    },
    {
        "urduURN": 4014760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1470,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ کہا کہ ہمیں امام مالک رحمہ اللہ نے خبر دی ‘ انہیں ابوالزناد نے ‘ انہیں اعرج نے ‘ انہیں ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا",
        "hadithText": "اس ذات کی قسم جس کے ہاتھ میں میری جان ہے اگر کوئی شخص رسی سے لکڑیوں کا بوجھ باندھ کر اپنی پیٹھ پر جنگل سے اٹھا لائے ( پھر انہیں بازار میں بیچ کر اپنا رزق حاصل کرے ) تو وہ اس شخص سے بہتر ہے جو کسی کے پاس آ کر سوال کرے ۔ پھر جس سے سوال کیا گیا ہے وہ اسے دے یا نہ دے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 113710,
        "last_updated": null
    },
    {
        "urduURN": 4014770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1471,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ کہا کہ ہم سے وہیب نے بیان کیا ‘ کہا کہ ہم سے ہشام بن عروہ نے بیان کیا ‘ ان سے ان کے والد نے ‘ ان سے زبیر بن عوام رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا",
        "hadithText": "تم میں سے کوئی بھی اگر ( ضرورت مند ہو تو ) اپنی رسی لے کر آئے اور لکڑیوں کا گٹھا باندھ کر اپنی پیٹھ پر رکھ کر لائے ۔ اور اسے بیچے ۔ اس طرح اللہ تعالیٰ اس کی عزت کو محفوظ رکھ لے تو یہ اس سے اچھا ہے کہ وہ لوگوں سے سوال کرتا پھرے ‘ اسے وہ دیں یا نہ دیں ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 113720,
        "last_updated": null
    },
    {
        "urduURN": 4014780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1472,
        "hadithSanad": "ہم سے عبد ان نے بیان کیا ‘ کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی ‘ کہا کہ ہمیں یونس نے خبر دی ‘ انہیں زہری نے ‘ انہیں عروہ بن زبیر اور سعید بن مسیب نے کہ حکیم بن حزام رضی اللہ عنہ نے کہا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے کچھ مانگا ۔ آپ صلی اللہ علیہ وسلم نے عطا فرمایا ۔ میں نے پھر مانگا اور آپ صلی اللہ علیہ وسلم نے پھر عطا فرمایا ۔ میں نے پھر مانگا آپ صلی اللہ علیہ وسلم نے پھر بھی عطا فرمایا ۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے ارشاد فرمایا ۔ اے حکیم ! یہ دولت بڑی سرسبز اور بہت ہی شیریں ہے ۔ لیکن جو شخص اسے اپنے دل کو سخی رکھ کر لے تو اس کی دولت میں برکت ہوتی ہے ۔ اور جو لالچ کے ساتھ لیتا ہے تو اس کی دولت میں کچھ بھی برکت نہیں ہو گی ۔ اس کا حال اس شخص جیسا ہو گا جو کھاتا ہے لیکن آسودہ نہیں ہوتا ( یاد رکھو ) اوپر کا ہاتھ نیچے کے ہاتھ سے بہتر ہے ۔ حکیم بن حزام رضی اللہ عنہ نے کہا ‘ کہ میں نے عرض کی اس ذات کی قسم ! جس نے آپ کو سچائی کے ساتھ مبعوث کیا ہے ۔ اب اس کے بعد میں کسی سے کوئی چیز نہیں لوں گا ۔ تاآنکہ اس دنیا ہی سے میں جدا ہو جاؤں ۔ چنانچہ حضرت ابوبکر رضی اللہ عنہ حکیم رضی اللہ عنہ کو ان کا معمول دینے کو بلاتے تو وہ لینے سے انکار کر دیتے ۔ پھر حضرت عمر رضی اللہ عنہ نے بھی انہیں ان کا حصہ دینا چاہا تو انہوں نے اس کے لینے سے انکار کر دیا ۔ اس پر حضرت عمر رضی اللہ عنہ نے فرمایا کہ مسلمانو ! میں تمہیں حکیم بن حزام کے معاملہ میں گواہ بناتا ہوں کہ میں نے ان کا حق انہیں دینا چاہا لیکن انہوں نے لینے سے انکار کر دیا ۔ غرض حکیم بن حزام رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے بعد اسی طرح کسی سے بھی کوئی چیز لینے سے ہمیشہ انکار ہی کرتے رہے ۔ یہاں تک کہ وفات پا گئے ۔ حضرت عمر رضی اللہ عنہ ”مال فے“ یعنی ملکی آمدنی سے ان کا حصہ ان کو دینا چاہتے تھے مگر انہوں نے وہ بھی نہیں لیا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 113730,
        "last_updated": null
    },
    {
        "urduURN": 4014790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1473,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ انہوں نے کہا کہ ہم سے لیث نے بیان کیا ‘ ان سے یونس نے ‘ ان سے زہری نے ‘ ان سے سالم نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "میں نے حضرت عمر رضی اللہ عنہ سے سنا وہ کہتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم مجھے کوئی چیز عطا فرماتے تو میں عرض کرتا کہ آپ صلی اللہ علیہ وسلم مجھ سے زیادہ محتاج کو دے دیجئیے ۔ لیکن آنحضور صلی اللہ علیہ وسلم فرماتے کہ لے لو ‘ اگر تمہیں کوئی ایسا مال ملے جس پر تمہارا خیال نہ لگا ہوا ہو اور نہ تم نے اسے مانگا ہو تو اسے قبول کر لیا کرو ۔ اور جو نہ ملے تو اس کی پرواہ نہ کرو اور اس کے پیچھے نہ پڑو ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 113740,
        "last_updated": null
    },
    {
        "urduURN": 4014800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1474,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ انہوں نے کہا کہ ہم سے لیث نے بیان کیا ‘ ان سے عبیداللہ بن ابی جعفر نے کہا ‘ کہ میں نے حمزہ بن عبداللہ بن عمر سے سنا ‘ انہوں نے کہا کہ میں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا ‘ انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا :",
        "hadithText": "آدمی ہمیشہ لوگوں کے سامنے ہاتھ پھیلاتا رہتا ہے یہاں تک کہ وہ قیامت کے دن اس طرح اٹھے گا کہ اس کے چہرے پر ذرا بھی گوشت نہ ہو گا ۔ \n<span class=urdu_sanad>اور آپ صلی اللہ علیہ وسلم نے فرمایا کہ</span> قیامت کے دن سورج اتنا قریب ہو جائے گا کہ پسینہ آدھے کان تک پہنچ جائے گا ۔ لوگ اسی حال میں اپنی مخلصی کے لیے حضرت آدم علیہ السلام سے فریاد کریں گے ۔ پھر موسیٰ علیہ السلام سے ۔ اور پھر محمد صلی اللہ علیہ وسلم سے ۔ عبداللہ نے اپنی روایت میں یہ زیادتی کی ہے کہ مجھ سے لیث نے بیان کیا ‘ کہا کہ مجھ سے ابن ابی جعفر نے بیان کیا ‘ کہ پھر آنحضور صلی اللہ علیہ وسلم شفاعت کریں گے کہ مخلوق کا فیصلہ کیا جائے ۔ پھر آپ صلی اللہ علیہ وسلم بڑھیں گے اور جنت کے دروازے کا حلقہ تھام لیں گے ۔ اور اسی دن اللہ تعالیٰ آپ کو ”مقام محمود“ عطا فرمائے گا ۔ جس کی تمام اہل محشر تعریف کریں گے ۔ اور معلی بن اسد نے کہا کہ ہم سے وہیب نے نعمان بن راشد سے بیان کیا ‘ ان سے زہری کے بھائی عبداللہ بن مسلم نے ‘ ان سے حمزہ بن عبداللہ نے ‘ اور انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا ‘ انہوں نے آنحضرت صلی اللہ علیہ وسلم سے پھر اتنی ہی حدیث بیان کی جو سوال کے باب میں ہے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 113752,
        "last_updated": null
    },
    {
        "urduURN": 4014820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1476,
        "hadithSanad": "ہم سے حجاج بن منہال نے بیان کیا ۔ انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا ۔ انہوں نے کہا کہ مجھے محمد بن زیاد نے خبر دی انہوں نے کہا کہ",
        "hadithText": "میں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا مسکین وہ نہیں جسے ایک دو لقمے در در پھرائیں ۔ مسکین تو وہ ہے جس کے پاس مال نہیں ۔ لیکن اسے سوال سے شرم آتی ہے اور وہ لوگوں سے چمٹ کر نہیں مانگتا ( مسکین وہ جو کمائے مگر بقدر ضرورت نہ پا سکے ) ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 113780,
        "last_updated": null
    },
    {
        "urduURN": 4014830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1477,
        "hadithSanad": "ہم سے یعقوب بن ابراہیم نے بیان کیا ، کہا کہ ہم سے اسماعیل بن علیہ نے بیان کیا ‘ کہا کہ ہم سے خالد حذاء نے بیان کیا ‘ ان سے ابن اشوع نے ‘ ان سے عامر شعبی نے ۔ کہا کہ مجھ سے مغیرہ بن شعبہ رضی اللہ عنہ کے منشی وراد نے بیان کیا ۔ کہ",
        "hadithText": "معاویہ رضی اللہ عنہ نے مغیرہ بن شعبہ رضی اللہ عنہ کو لکھا کہ انہیں کوئی ایسی حدیث لکھئے جو آپ نے رسول اللہ صلی اللہ علیہ وسلم سے سنی ہو ۔ مغیرہ رضی اللہ عنہ نے لکھا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ تمہارے لیے تین باتیں پسند نہیں کرتا ۔ بلاوجہ کی گپ شپ ، فضول خرچی اور لوگوں سے بہت مانگنا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 113790,
        "last_updated": null
    },
    {
        "urduURN": 4014840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1478,
        "hadithSanad": "ہم سے محمد بن غریر زہری نے بیان کیا ‘ کہا کہ ہم سے یعقوب بن ابراہیم نے اپنے باپ سے بیان کیا ‘ ان سے صالح بن کیسان نے ان سے ابن شہاب نے ‘ انہوں نے کہا کہ مجھے عامر بن سعد بن ابی وقاص نے اپنے باپ سعد بن ابی وقاص سے خبر دی ۔ انہوں نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے چند اشخاص کو کچھ مال دیا ۔ اسی جگہ میں بھی بیٹھا ہوا تھا ۔ انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے ان کے ساتھ ہی بیٹھے ہوئے شخص کو چھوڑ دیا اور انہیں کچھ نہیں دیا ۔ حالانکہ ان لوگوں میں وہی مجھے زیادہ پسند تھا ۔ آخر میں نے رسول اللہ صلی اللہ علیہ وسلم کے قریب جا کر چپکے سے عرض کیا ‘ فلاں شخص کو آپ نے کچھ بھی نہیں دیا ؟ واللہ میں اسے مومن خیال کرتا ہوں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ یا مسلمان ؟ انہوں نے بیان کیا کہ اس پر میں تھوڑی دیر تک خاموش رہا ۔ لیکن میں ان کے متعلق جو کچھ جانتا تھا اس نے مجھے مجبور کیا ‘ اور میں نے عرض کیا ‘ یا رسول اللہ ! آپ فلاں شخص سے کیوں خفا ہیں ‘ واللہ ! میں اسے مومن سمجھتا ہوں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ‘ یا مسلمان ؟ تین مرتبہ ایسا ہی ہوا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک شخص کو دیتا ہوں ( اور دوسرے کو نظرانداز کر جاتا ہوں ) حالانکہ وہ دوسرا میری نظر میں پہلے سے زیادہ پیارا ہوتا ہے ۔ کیونکہ ( جس کو میں دیتا ہوں نہ دینے کی صورت میں ) مجھے ڈر اس بات کا رہتا ہے کہ کہیں اسے چہرے کے بل گھسیٹ کر جہنم میں نہ ڈال دیا جائے ۔ اور ( یعقوب بن ابراہیم ) اپنے والد سے ‘ وہ صالح سے ‘ وہ اسماعیل بن محمد سے ‘ انہوں نے بیان کیا کہ میں نے اپنے والد سے سنا کہ وہ یہی حدیث بیان کر رہے تھے ۔ انہوں نے کہا کہ پھر آنحضرت صلی اللہ علیہ وسلم نے اپنا ہاتھ میری گردن اور مونڈھے کے بیچ میں مارا ۔ اور فرمایا ۔ سعد ! ادھر سنو ۔ میں ایک شخص کو دیتا ہوں ۔ آخر حدیث تک ۔ ابوعبداللہ ( امام بخاری رحمتہ اللہ علیہ ) نے کہا کہ ( قرآن مجید میں لفظ ) «كبكبوا‏» اوندھے لٹا دینے کے معنی میں ہے ۔ اور سورۃ الملک میں جو «مكبا‏» کا لفظ ہے وہ «أكب» سے نکلا ہے ۔ «أكب» لازم ہے یعنی اوندھا گرا ۔ اور اس کا متعدی «كب» ہے ۔ کہتے ہیں کہ «كبه الله لوجهه» یعنی اللہ نے اسے اوندھے منہ گرا دیا ۔ اور «كببته» یعنی میں نے اس کو اوندھا گرایا ۔ امام بخاری رحمہ اللہ نے کہا صالح بن کیسان عمر میں زہری سے بڑے تھے وہ عبداللہ بن عمر رضی اللہ عنہما سے ملے ہیں ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 113800,
        "last_updated": null
    },
    {
        "urduURN": 4014850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1479,
        "hadithSanad": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ‘ کہا کہ مجھ سے امام مالک رحمہ اللہ نے ابوالزناد سے بیان کیا ‘ ان سے اعرج نے ‘ اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا",
        "hadithText": "مسکین وہ نہیں ہے جو لوگوں کا چکر کاٹتا پھرتا ہے تاکہ اسے دو ایک لقمہ یا دو ایک کھجور مل جائیں ۔ بلکہ اصلی مسکین وہ ہے جس کے پاس اتنا مال نہیں کہ وہ اس کے ذریعہ سے بےپرواہ ہو جائے ۔ اس حال میں بھی کسی کو معلوم نہیں کہ کوئی اسے صدقہ ہی دیدے اور نہ وہ خود ہاتھ پھیلانے کے لیے اٹھتا ہے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 113810,
        "last_updated": null
    },
    {
        "urduURN": 4014860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1480,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ‘ کہا کہ مجھ سے میرے باپ نے بیان کیا ‘ کہا کہ ہم سے اعمش نے بیان کیا ‘ کہا کہ ہم سے ابوصالح ذکوان نے بیان کیا ‘ اور ان سے ابوہریرہ رضی اللہ عنہ نے ‘ کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا",
        "hadithText": "اگر تم میں سے کوئی شخص اپنی رسی لے کر ( میرا خیال ہے کہ آپ صلی اللہ علیہ وسلم نے یوں فرمایا ) پہاڑوں میں چلا جائے پھر لکڑیاں جمع کر کے انہیں فروخت کرے ۔ اس سے کھائے بھی اور صدقہ بھی کرے ۔ یہ اس کے لیے اس سے بہتر ہے کہ لوگوں کے سامنے ہاتھ پھیلائے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 113820,
        "last_updated": null
    },
    {
        "urduURN": 4014870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1481,
        "hadithSanad": "ہم سے سہل بن بکار نے بیان کیا ‘ کہا کہ ہم سے وہیب بن خالد نے ‘ ان سے عمرو بن یحییٰ نے ‘ ان سے عباس بن سہل ساعدی نے ‘ ان سے ابو حمید ساعدی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم غزوہ تبوک کے لیے نبی کریم صلی اللہ علیہ وسلم کے ساتھ جا رہے تھے ۔ جب آپ صلی اللہ علیہ وسلم وادی قریٰ ( مدینہ منورہ اور شام کے درمیان ایک قدیم آبادی ) سے گزرے تو ہماری نظر ایک عورت پر پڑی جو اپنے باغ میں کھڑی ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے صحابہ رضوان اللہ علیہم اجمعین سے فرمایا کہ اس کے پھلوں کا اندازہ لگاؤ ( کہ اس میں کتنی کھجور نکلے گی ) حضور اکرم صلی اللہ علیہ وسلم نے دس وسق کا اندازہ لگایا ۔ پھر اس عورت سے فرمایا کہ یاد رکھنا اس میں سے جتنی کھجور نکلے ۔ جب ہم تبوک پہنچے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ آج رات بڑے زور کی آندھی چلے گی اس لیے کوئی شخص کھڑا نہ رہے ۔ اور جس کے پاس اونٹ ہوں تو وہ اسے باندھ دیں ۔ چنانچہ ہم نے اونٹ باندھ لیے ۔ اور آندھی بڑے زور کی آئی ۔ ایک شخص کھڑا ہوا تھا ۔ تو ہوا نے اسے ”جبل طے“ پر جا پھینکا ۔ اور ایلہ کے حاکم ( یوحنا بن روبہ ) نے نبی کریم صلی اللہ علیہ وسلم کو سفید خچر اور ایک چادر کا تحفہ بھیجا ۔ آنحضور صلی اللہ علیہ وسلم نے تحریری طور پر اسے اس کی حکومت پر برقرار رکھا پھر جب وادی قریٰ ( واپسی میں ) پہنچے تو آپ صلی اللہ علیہ وسلم نے اسی عورت سے پوچھا کہ تمہارے باغ میں کتنا پھل آیا تھا اس نے کہا کہ آپ صلی اللہ علیہ وسلم کے اندازہ کے مطابق دس وسق آیا تھا ۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں مدینہ جلد جانا چاہتا ہوں ۔ اس لیے جو کوئی میرے ساتھ جلدی چلنا چاہے وہ میرے ساتھ جلد روانہ ہو پھر جب ( ابن بکار امام بخاری رحمہ اللہ کے شیخ نے ایک ایسا جملہ کہا جس کے معنے یہ تھے ) کہ مدینہ دکھائی دینے لگا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ ہے طابہ ! پھر آپ صلی اللہ علیہ وسلم نے احد پہاڑ دیکھا تو فرمایا کہ یہ پہاڑ ہم سے محبت رکھتا ہے اور ہم بھی اس سے محبت رکھتے ہیں ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کیا میں انصار کے سب سے اچھے خاندان کی نشاندہی نہ کروں ؟ صحابہ نے عرض کی کہ ضرور کیجئے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ بنو نجار کا خاندان ۔ پھر بنو عبدالاشہل کا خاندان ، پھر بنو ساعدہ کا یا ( یہ فرمایا کہ ) بنی حارث بن خزرج کا خاندان ۔ اور فرمایا کہ انصار کے تمام ہی خاندانوں میں خیر ہے ‘ ابوعبداللہ ( قاسم بن سلام ) نے کہا کہ جس باغ کی چہار دیواری ہو اسے حدیقہ کہیں گے ۔ اور جس کی چہار دیواری نہ ہو اسے حدیقہ نہیں کہیں گے ۔ \n<span class=urdu_sanad>اور سلیمان بن بلال نے کہا کہ مجھ سے عمرو نے اس طرح بیان کیا کہ پھر بنی حارث بن خزرج کا خاندان اور پھر بنو ساعدہ کا خاندان ۔ اور سلیمان نے سعد بن سعید سے بیان کیا ‘ ان سے عمارہ بن غزنیہ نے ‘ ان سے عباس نے ‘ ان سے ان کے باپ ( سہل ) نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا</span> احد وہ پہاڑ ہے جو ہم سے محبت رکھتا ہے اور ہم اس سے محبت رکھتے ہیں ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 113831,
        "last_updated": null
    },
    {
        "urduURN": 4014890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1483,
        "hadithSanad": "ہم سے سعید بن ابی مریم نے بیان کیا ‘ کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا ‘ کہا کہ مجھے یونس بن یزید نے خبر دی ‘ انہیں شہاب نے ‘ انہیں سالم بن عبداللہ بن عمر نے ‘ انہیں ان کے والد نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ وہ زمین جسے آسمان ( بارش کا پانی ) یا چشمہ سیراب کرتا ہو ۔ یا وہ خودبخود نمی سے سیراب ہو جاتی ہو تو اس کی پیداوار سے دسواں حصہ لیا جائے اور وہ زمین جسے کنویں سے پانی کھینچ کر سیراب کیا جاتا ہو تو اس کی پیداوار سے بیسواں حصہ لیا جائے ۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے کہا کہ یہ حدیث یعنی عبداللہ بن عمر رضی اللہ عنہما کی حدیث کہ جس کھیتی میں آسمان کا پانی دیا جائے ‘ دسواں حصہ ہے پہلی حدیث یعنی ابوسعید کی حدیث کی تفسیر ہے ۔ اس میں زکوٰۃ کی کوئی مقدار مذکور نہیں ہے اور اس میں مذکور ہے ۔ اور زیادتی قبول کی جاتی ہے ۔ اور گول مول حدیث کا حکم صاف صاف حدیث کے موافق لیا جاتا ہے ۔ جب اس کا راوی ثقہ ہو ۔ جیسے فضل بن عباس رضی اللہ عنہ نے روایت کیا کہ نبی کریم صلی اللہ علیہ وسلم نے کعبہ میں نماز نہیں پڑھی ۔ لیکن بلال رضی اللہ عنہ نے بتلایا کہ آپ صلی اللہ علیہ وسلم نے نماز ( کعبہ میں ) پڑھی تھی ۔ اس موقع پر بھی بلال رضی اللہ عنہ کی بات قبول کی گئی اور فضل رضی اللہ عنہ کا قول چھوڑ دیا گیا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 113850,
        "last_updated": null
    },
    {
        "urduURN": 4014900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1484,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ‘ انہوں نے کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا ‘ انہوں نے کہا کہ ہم سے امام مالک رحمہ اللہ نے بیان کیا ‘ انہوں نے کہا کہ مجھ سے محمد بن عبداللہ بن عبدالرحمٰن بن ابی صعصعہ نے بیان کیا ‘ ان سے ان کے باپ نے بیان کیا اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا",
        "hadithText": "پانچ وسق سے کم میں زکوٰۃ نہیں ہے ‘ اور پانچ مہار اونٹوں سے کم میں زکوٰۃ نہیں ہے ۔ اور چاندی کے پانچ اوقیہ سے کم میں زکوٰۃ نہیں ہے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 113860,
        "last_updated": null
    },
    {
        "urduURN": 4014910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1485,
        "hadithSanad": "ہم سے عمر بن محمد بن حسن اسدی نے بیان کیا ‘ انہوں نے کہا کہ ہم سے میرے باپ نے بیان کیا ‘ انہوں نے کہا کہ ہم سے ابراہیم بن طہمان نے بیان کیا ‘ ان سے محمد بن زیاد نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے پاس توڑنے کے وقت زکوٰۃ کی کھجور لائی جاتی ، ہر شخص اپنی زکوٰۃ لاتا اور نوبت یہاں تک پہنچتی کہ کھجور کا ایک ڈھیر لگ جاتا ۔ ( ایک مرتبہ ) حسن اور حسین رضی اللہ عنہما ایسی ہی کھجوروں سے کھیل رہے تھے کہ ایک نے ایک کھجور اٹھا کر اپنے منہ میں رکھ لی ۔ رسول اللہ صلی اللہ علیہ وسلم نے جونہی دیکھا تو ان کے منہ سے وہ کھجور نکال لی ۔ اور فرمایا کہ کیا تمہیں معلوم نہیں کہ محمد صلی اللہ علیہ وسلم کی اولاد زکوٰۃ کا مال نہیں کھا سکتی ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 113870,
        "last_updated": null
    },
    {
        "urduURN": 4014920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1486,
        "hadithSanad": "ہم سے حجاج بن منہال نے بیان کیا ‘ کہا کہ ہم سے شعبہ نے بیان کیا ‘ کہا کہ مجھے عبداللہ بن دینار نے خبر دی ‘ کہا کہ میں نے ابن عمر رضی اللہ عنہما سے سنا ‘ انہوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے کھجور کو ( درخت پر ) اس وقت تک بیچنے سے منع فرمایا ہے جب تک اس کی پختگی ظاہر نہ ہو ۔ اور ابن عمر رضی اللہ عنہما سے جب پوچھتے کہ اس کی پختگی کیا ہے ، وہ کہتے کہ جب یہ معلوم ہو جائے کہ اب یہ پھل آفت سے بچ رہے گا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 113880,
        "last_updated": null
    },
    {
        "urduURN": 4014930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1487,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ انہوں نے کہا کہ مجھ سے لیث نے بیان کیا ‘ انہوں نے کہا کہ مجھ سے خالد بن یزید نے بیان کیا ‘ ان سے عطاء  بن ابی رباح نے بیان کیا اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے پھل کو اس وقت تک بیچنے سے منع فرمایا جب تک ان کی پختگی کھل نہ جائے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 113890,
        "last_updated": null
    },
    {
        "urduURN": 4014940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1488,
        "hadithSanad": "ہم سے قتیبہ نے امام مالک سے بیان کیا ‘ ان سے حمید نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے جب تک پھل پر سرخی نہ آ جائے ‘ انہیں بیچنے سے منع فرمایا ہے ۔ انہوں نے بیان کیا کہ مراد یہ ہے کہ جب تک وہ پک کر سرخ نہ ہو جائیں ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 113900,
        "last_updated": null
    },
    {
        "urduURN": 4014950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1489,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ کہا کہ ہم سے لیث نے بیان کیا ‘ ان سے عقیل نے ‘ ان سے ابن شہاب نے ‘ ان سے سالم نے کہ عبداللہ بن عمر رضی اللہ عنہما بیان کرتے تھے کہ",
        "hadithText": "عمر بن خطاب رضی اللہ عنہ نے ایک گھوڑا اللہ کے راستہ میں صدقہ کیا ۔ پھر اسے آپ نے دیکھا کہ وہ بازار میں فروخت ہو رہا ہے ۔ اس لیے ان کی خواہش ہوئی کہ اسے وہ خود ہی خرید لیں ۔ اور اجازت لینے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے ۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اپنا صدقہ واپس نہ لو ۔ اسی وجہ سے اگر ابن عمر رضی اللہ عنہما اپنا دیا ہوا کوئی صدقہ خرید لیتے ‘ تو پھر اسے صدقہ کر دیتے تھے ۔ ( اپنے استعمال میں نہ رکھتے تھے ۔ باب اور حدیث میں مطابقت ظاہر ہے ) ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 113910,
        "last_updated": null
    },
    {
        "urduURN": 4014960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1490,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ کہا کہ ہمیں امام مالک بن انس نے خبر دی ‘ انہیں زید بن اسلم نے اور ان سے ان کے باپ نے بیان کیا ‘ کہ میں نے عمر رضی اللہ عنہ کو یہ کہتے سنا کہ",
        "hadithText": "انہوں نے ایک گھوڑا اللہ تعالیٰ کے راستہ میں ایک شخص کو سواری کے لیے دے دیا ۔ لیکن اس شخص نے گھوڑے کو خراب کر دیا ۔ اس لیے میں نے چاہا کہ اسے خرید لوں ۔ میرا یہ بھی خیال تھا کہ وہ اسے سستے داموں بیچ ڈالے گا ۔ چنانچہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کے متعلق پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اپنا صدقہ واپس نہ لو ۔ خواہ وہ تمہیں ایک درہم ہی میں کیوں نہ دے کیونکہ دیا ہوا صدقہ واپس لینے والے کی مثال قے کر کے چاٹنے والے کی سی ہے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 113920,
        "last_updated": null
    },
    {
        "urduURN": 4014970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1491,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ‘ انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا ‘ انہوں نے کہا کہ ہم سے محمد بن زیاد نے بیان کیا ‘ کہا کہ میں نے ابوہریرہ رضی اللہ عنہ سے سنا ‘ انہوں نے بیان کیا کہ",
        "hadithText": "حسن بن علی رضی اللہ عنہما نے زکوٰۃ کی کھجوروں کے ڈھیر سے ایک کھجور اٹھا کر اپنے منہ میں ڈال لی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ چھی چھی ! نکالو اسے ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ کیا تمہیں معلوم نہیں کہ ہم لوگ صدقہ کا مال نہیں کھاتے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 113930,
        "last_updated": null
    },
    {
        "urduURN": 4014980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1492,
        "hadithSanad": "ہم سے سعید بن عفیر نے بیان کیا ‘ کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا ‘ ان سے یونس نے ‘ ان سے ابن شہاب نے ‘ کہا کہ مجھ سے عبیداللہ بن عبداللہ نے بیان کیا ‘ اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے میمونہ رضی اللہ عنہا کی باندی کو جو بکری صدقہ میں کسی نے دی تھی وہ مری ہوئی دیکھی ۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم لوگ اس کے چمڑے کو کیوں نہیں کام میں لائے ۔ لوگوں نے کہا کہ یہ تو مردہ ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ حرام تو صرف اس کا کھانا ہے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 113940,
        "last_updated": null
    },
    {
        "urduURN": 4014990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1493,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ‘ کہا کہ ہم سے شعبہ نے بیان کیا ‘ کہا کہ ہم سے حکم بن عتبہ نے بیان کیا ‘ ان سے ابراہیم نخعی نے ‘ ان سے اسود نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "ان کا ارادہ ہوا کہ بریرہ رضی اللہ عنہا کو ( جو باندی تھیں ) آزاد کر دینے کے لیے خرید لیں ۔ لیکن اس کے اصل مالک یہ چاہتے تھے کہ ولاء انہیں کے لیے رہے ۔ اس کا ذکر عائشہ رضی اللہ عنہا نے نبی کریم صلی اللہ علیہ وسلم سے کیا ۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم خرید کر آزاد کر دو ‘ ولاء تو اسی کی ہوتی ہے ‘ جو آزاد کرے ۔ انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں گوشت پیش کیا گیا ۔ میں نے کہا کہ یہ بریرہ رضی اللہ عنہا کو کسی نے صدقہ کے طور پر دیا ہے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ ان کے لیے صدقہ تھا ۔ لیکن اب ہمارے لیے یہ ہدیہ ہے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 113950,
        "last_updated": null
    },
    {
        "urduURN": 4015000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1494,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ‘ انہوں نے کہا کہ ہم سے یزید بن زریع نے بیان کیا ‘ انہوں نے کہا کہ ہم سے خالد حذاء نے بیان کیا ‘ ان سے حفصہ بنت سیرین نے اور ان سے ام عطیہ انصاریہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا کے یہاں تشریف لائے اور دریافت فرمایا کہ کیا تمہارے پاس کچھ ہے ؟ عائشہ رضی اللہ عنہا نے جواب دیا کہ نہیں کوئی چیز نہیں ۔ ہاں نسیبہ رضی اللہ عنہا کا بھیجا ہوا اس بکری کا گوشت ہے جو انہیں صدقہ کے طور پر ملی ہے ۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا لاؤ خیرات تو اپنے ٹھکانے پہنچ گئی ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 113960,
        "last_updated": null
    },
    {
        "urduURN": 4015010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1495,
        "hadithSanad": "ہم سے یحییٰ بن موسیٰ نے بیان کیا ‘ انہوں نے کہا کہ ہم سے وکیع نے بیان کیا ‘ کہا کہ ہم سے شعبہ نے بیان کیا ‘ قتادہ سے اور وہ انس رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی خدمت میں وہ گوشت پیش کیا گیا جو بریرہ رضی اللہ عنہا کو صدقہ کے طور پر ملا تھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کو یہ گوشت ان پر صدقہ تھا ۔ لیکن ہمارے لیے یہ ہدیہ ہے ۔ ابوداؤد نے کہا کہ ہمیں شعبہ نے خبر دی ۔ انہیں قتادہ نے کہ انہوں نے انس رضی اللہ عنہ سے سنا وہ نبی کریم صلی اللہ علیہ وسلم سے بیان کرتے تھے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 113971,
        "last_updated": null
    },
    {
        "urduURN": 4015020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1496,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ‘ انہوں نے کہا کہ ہمیں عبداللہ نے خبر دی ‘ انہوں نے کہا کہ ہمیں زکریا ابن اسحاق نے خبر دی ‘ انہیں یحییٰ بن عبداللہ بن صیفی نے ‘ انہیں ابن عباس رضی اللہ عنہما کے غلام ابومعبدنے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے معاذ رضی اللہ عنہ کو جب یمن بھیجا ‘ تو ان سے فرمایا کہ تم ایک ایسی قوم کے پاس جا رہے ہو جو اہل کتاب ہیں ۔ اس لیے جب تم وہاں پہنچو تو پہلے انہیں دعوت دو کہ وہ اس بات کی گواہی دیں کہ اللہ کے سوا کوئی معبود نہیں اور محمد ( صلی اللہ علیہ وسلم ) اللہ کے سچے رسول ہیں ۔ وہ اس بات میں جب تمہاری بات مان لیں تو انہیں بتاؤ کہ اللہ تعالیٰ نے ان پر روزانہ دن رات میں پانچ وقت کی نمازیں فرض کی ہیں ۔ جب وہ تمہاری یہ بات بھی مان لیں تو انہیں بتاؤ کہ ان کے لیے اللہ تعالیٰ نے زکوٰۃ دینا ضروری قرار دیا ہے ‘ یہ ان کے مالداروں سے لی جائے گی اور ان کے غریبوں پر خرچ کی جائے گی ۔ پھر جب وہ اس میں بھی تمہاری بات مان لیں تو ان کے اچھے مال لینے سے بچو اور مظلوم کی آہ سے ڈرو کہ اس کے اور اللہ تعالیٰ کے درمیان کوئی رکاوٹ نہیں ہوتی ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 113990,
        "last_updated": null
    },
    {
        "urduURN": 4015030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1497,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، کہا کہ ہم سے شعبہ نے عمرو بن مرہ سے بیان کیا ‘ ان سے عبداللہ بن ابی اوفی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جب کوئی قوم اپنی زکوٰۃ لے کر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوتی تو آپ صلی اللہ علیہ وسلم ان کے لیے دعا فرماتے «اللهم صل على آل فلان» اے اللہ ! آل فلاں کو خیر و برکت عطا فرما ‘ میرے والد بھی اپنی زکوٰۃ لے کر حاضر ہوئے تو آپ صلی اللہ علیہ وسلم نے فرمایا «اللهم صل على آل أبي أوفى» اے اللہ ! آل ابی اوفی کو خیر و برکت عطا فرما ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 114000,
        "last_updated": null
    },
    {
        "urduURN": 4015040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1498,
        "hadithSanad": "اور لیث نے کہا کہ مجھ سے جعفر بن ربیعہ نے بیان کیا ‘ انہوں نے عبدالرحمٰن بن ہرمز سے ‘ انہوں نے ابوہریرہ رضی اللہ عنہ سے ‘ انہوں نے آنحضرت صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "بنی اسرائیل میں ایک شخص تھا جس نے دوسرے بنی اسرائیل کے شخص سے ہزار اشرفیاں قرض مانگیں ۔ اس نے اللہ کے بھروسے پر اس کو دے دیں ۔ اب جس نے قرض لیا تھا وہ سمندر پر گیا کہ سوار ہو جائے اور قرض خواہ کا قرض ادا کرے لیکن سواری نہ ملی ۔ آخر اس نے قرض خواہ تک پہنچنے سے ناامید ہو کر ایک لکڑی لی اس کو کریدا اور ہزار اشرفیاں اس میں بھر کر وہ لکڑی سمندر میں پھینک دی ۔ اتفاق سے قرض خواہ کام کاج کو باہر نکلا ‘ سمندر پر پہنچا تو ایک لکڑی دیکھی اور اس کو گھر میں جلانے کے خیال سے لے آیا ۔ پھر پوری حدیث بیان کی ۔ جب لکڑی کو چیرا تو اس میں اشرفیاں پائیں ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 114010,
        "last_updated": null
    },
    {
        "urduURN": 4015050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1499,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ انہوں نے کہا کہ ہمیں امام مالک نے خبر دی ‘ انہیں ابن شہاب نے ‘ ان سے سعید بن مسیب اور ابوسلمہ بن عبدالرحمٰن نے بیان کیا ‘ اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا",
        "hadithText": "جانور سے جو نقصان پہنچے اس کا کچھ بدلہ نہیں اور کنویں کا بھی یہی حال ہے اور کان کا بھی یہی حکم ہے اور رکاز میں سے پانچواں حصہ لیا جائے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 114020,
        "last_updated": null
    },
    {
        "urduURN": 4015060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1500,
        "hadithSanad": "ہم سے یوسف بن موسیٰ نے بیان کیا ‘ انہوں نے کہا کہ ہم سے ابواسامہ نے بیان کیا ‘ انہوں نے کہا کہ ہم سے ہشام بن عروہ نے بیان کیا ‘ ان سے ان کے باپ ( عروہ بن زبیر ) نے بیان کیا ‘ ان سے حضرت ابو حمید ساعدی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے بنی اسد کے ایک شخص عبداللہ بن لتبیہ کو بنی سلیم کی زکوٰۃ وصول کرنے پر مقرر فرمایا ۔ جب وہ آئے تو آپ صلی اللہ علیہ وسلم نے ان سے حساب لیا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 114030,
        "last_updated": null
    },
    {
        "urduURN": 4015070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1501,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ‘ کہا کہ ہم سے یحییٰ قطان نے بیان کیا ‘ ان سے شعبہ نے کہا کہ ہم سے قتادہ نے بیان کیا ‘ اور ان سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "عرینہ کے کچھ لوگوں کو مدینہ کی آب و ہوا موافق نہیں آئی ۔ رسول اللہ صلی اللہ علیہ وسلم نے انہیں اس کی اجازت دے دی کہ وہ زکوٰۃ کے اونٹوں میں جا کر ان کا دودھ اور پیشاب استعمال کریں ( کیونکہ وہ ایسے مرض میں مبتلا تھے جس کی دوا یہی تھی ) لیکن انہوں نے ( ان اونٹوں کے ) چرواہے کو مار ڈالا اور اونٹوں کو لے کر بھاگ نکلے ۔ رسول اللہ صلی اللہ علیہ وسلم نے ان کے پیچھے آدمی دوڑائے آخر وہ لوگ پکڑ لائے گئے ۔ آپ صلی اللہ علیہ وسلم نے ان کے ہاتھ اور پاؤں کٹوا دئیے اور ان کی آنکھوں میں گرم سلائیاں پھروا دیں پھر انہیں دھوپ میں ڈلوا دیا ( جس کی شدت کی وجہ سے ) وہ پتھر چبانے لگے تھے ۔ اس روایت کی متابعت ابوقلابہ ثابت اور حمید نے انس رضی اللہ عنہ کے واسطہ سے کی ہے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 114040,
        "last_updated": null
    },
    {
        "urduURN": 4015080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1502,
        "hadithSanad": "ہم سے ابراہیم بن المنذر نے بیان کیا ‘ کہا کہ ہم سے ولید نے بیان کیا ‘ کہا کہ ہم سے ابوعمرو اوزاعی نے بیان کیا ‘ کہا کہ مجھ سے اسحاق بن عبداللہ بن ابی طلحہ نے بیان کیا ‘ کہا کہ مجھ سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں عبداللہ بن ابی طلحہ کو لے کر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا کہ آپ صلی اللہ علیہ وسلم ان کی تحنیک کر دیں ۔ ( یعنی اپنے منہ سے کوئی چیز چبا کر ان کے منہ میں ڈال دیں ) میں نے اس وقت دیکھا کہ آپ صلی اللہ علیہ وسلم کے ہاتھ میں داغ لگانے کا آلہ تھا اور آپ صلی اللہ علیہ وسلم زکوٰۃ کے اونٹوں پر داغ لگا رہے تھے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 114050,
        "last_updated": null
    },
    {
        "urduURN": 4015090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1503,
        "hadithSanad": "ہم سے یحییٰ بن محمد بن سکن نے بیان کیا ‘ انہوں نے کہا کہ ہم سے محمد بن جھضم نے بیان کیا ‘ انہوں نے کہا کہ ہم سے اسماعیل بن جعفر نے بیان کیا ‘ ان سے عمر بن نافع نے ان سے ان کے باپ نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فطر کی زکوٰۃ ( صدقہ فطر ) ایک صاع کھجور یا ایک صاع جَو فرض قرار دی تھی ۔ غلام ‘ آزاد ‘ مرد ‘ عورت ‘ چھوٹے اور بڑے تمام مسلمانوں پر ۔ آپ صلی اللہ علیہ وسلم کا حکم یہ تھا کہ نماز ( عید ) کے لیے جانے سے پہلے یہ صدقہ ادا کر دیا جائے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 114060,
        "last_updated": null
    },
    {
        "urduURN": 4015100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1504,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ انہوں نے کہا کہ ہمیں امام مالک نے خبر دی ‘ انہیں نافع نے ‘ اور انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فطر کی زکوٰۃ آزاد یا غلام ‘ مرد یا عورت تمام مسلمانوں پر ایک صاع کھجور یا جَو فرض کی تھی ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 114070,
        "last_updated": null
    },
    {
        "urduURN": 4015110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1505,
        "hadithSanad": "ہم سے قبیصہ بن عقبہ نے بیان کیا ‘ انہوں نے کہا کہ ہم سے سفیان نے بیان کیا ‘ انہوں نے کہا کہ ہم سے زیدبن اسلم نے بیان کیا ‘ انہوں نے کہا کہ ہم سے عیاض بن عبداللہ نے بیان کیا اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم ایک صاع ”جو“ کا صدقہ دیا کرتے تھے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 114080,
        "last_updated": null
    },
    {
        "urduURN": 4015120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1506,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ انہوں نے کہا کہ ہمیں امام مالک نے خبر دی ‘ ان سے زید بن اسلم نے بیان کیا ‘ ان سے عیاض بن عبداللہ بن سعد بن ابی سرح عامری نے بیان کیا ‘ کہ انہوں نے حضرت ابو سعید خدری رضی اللہ عنہ سے سنا ۔ آپ فرماتے تھے کہ",
        "hadithText": "ہم فطرہ کی زکوٰۃ ایک صاع اناج یا گیہوں یا ایک صاع جَو یا ایک صاع کھجور یا ایک صاع پنیر یا ایک صاع زبیب ( خشک انگور یا انجیر ) نکالا کرتے تھے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 114090,
        "last_updated": null
    },
    {
        "urduURN": 4015130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1507,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ‘ انہوں نے کہا کہ ہم سے لیث نے نافع کے واسطہ سے بیان کیا ‘ ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ایک صاع کھجور یا ایک صاع جَو کی زکوٰۃ فطر دینے کا حکم فرمایا تھا ۔ عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ پھر لوگوں نے اسی کے برابر دو مد ( آدھا صاع ) گیہوں کر لیا تھا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 114100,
        "last_updated": null
    },
    {
        "urduURN": 4015140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1508,
        "hadithSanad": "ہم سے عبداللہ بن منیر نے بیان کیا ‘ انہوں نے یزید بن ابی حکیم عدنی سے سنا ‘ انہوں نے کہا کہ ہم سے سفیان ثوری نے بیان کیا ‘ ان سے زیدبن اسلم نے بیان کیا ‘ انہوں نے کہا کہ مجھ سے عیاض بن عبداللہ بن سعد بن ابی سرح نے بیان کیا اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں صدقہ فطر ایک صاع گیہوں یا ایک صاع کھجور یا ایک صاع جَو یا ایک صاع ”زبیب“ ( خشک انگور یا خشک انجیر ) نکالتے تھے ۔ پھر جب معاویہ رضی اللہ عنہ مدینہ میں آئے اور گیہوں کی آمدنی ہوئی تو کہنے لگے میں سمجھتا ہوں اس کا ایک مد دوسرے اناج کے دو مد کے برابر ہے ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 114110,
        "last_updated": null
    },
    {
        "urduURN": 4015150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1509,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا انہوں نے کہا کہ ہم سے حفص بن میسرہ نے بیان کیا ‘ انہوں نے کہا کہ مجھ سے موسیٰ بن عقبہ نے بیان کیا ‘ ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے صدقہ فطر نماز ( عید ) کے لیے جانے سے پہلے پہلے نکالنے کا حکم دیا تھا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 114120,
        "last_updated": null
    },
    {
        "urduURN": 4015160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1510,
        "hadithSanad": "ہم سے معاذ بن فضالہ نے بیان کیا ‘ انہوں نے کہا کہ ہم سے ابوعمر حفص بن میسرہ نے بیان کیا ‘ ان سے زیدبن اسلم نے بیان کیا ‘ ان سے عیاض بن عبداللہ بن سعد نے ‘ ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں عیدالفطر کے دن ( کھانے کے غلہ سے ) ایک صاع نکالتے تھے ۔ ابوسعید رضی اللہ عنہ نے بیان کیا کہ ہمارا کھانا ( ان دنوں ) جَو ، زبیب ، پنیر اور کھجور تھا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 114130,
        "last_updated": null
    },
    {
        "urduURN": 4015170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1511,
        "hadithSanad": "ہم سے ابوالنعمان نے بیان کیا ‘ انہوں نے کہا کہ ہم سے حماد بن زید نے بیان کیا ‘ انہوں نے کہا کہ ہم سے ایوب نے بیان کیا ‘ ان سے نافع نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے صدقہ فطر یا یہ کہا کہ صدقہ رمضان مرد ، عورت ، آزاد اور غلام ( سب پر ) ایک صاع کھجور یا ایک صاع جَو فرض قرار دیا تھا ۔ پھر لوگوں نے آدھا صاع گیہوں اس کے برابر قرار دے لیا ۔ لیکن ابن عمر رضی اللہ عنہما کھجور دیا کرتے تھے ۔ ایک مرتبہ مدینہ میں کھجور کا قحط پڑا تو آپ نے جو صدقہ میں نکالا ۔ ابن عمر رضی اللہ عنہما چھوٹے بڑے سب کی طرف سے یہاں تک کہ میرے بیٹوں کی طرف سے بھی صدقہ فطر نکالتے تھے ۔ ابن عمر رضی اللہ عنہما صدقہ فطر ہر فقیر کو جو اسے قبول کرتا ، دے دیا کرتے تھے ۔ اور لوگ صدقہ فطر ایک یا دو دن پہلے ہی دے دیا کرتے تھے ۔ امام بخاری رحمہ اللہ نے کہا میرے بیٹوں سے نافع کے بیٹے مراد ہیں ۔ امام بخاری نے کہا وہ عید سے پہلے جو صدقہ دے دیتے تھے تو اکٹھا ہونے کے لیے نہ فقیروں کے لیے ( پھر وہ جمع کر کے فقراء میں تقسیم کر دیا جاتا ) ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 114140,
        "last_updated": null
    },
    {
        "urduURN": 4015180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 24,
        "bookName": "کتاب زکوۃ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1512,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ‘ انہوں نے کہا کہ ہم سے یحییٰ قطان نے عبیداللہ عمری کے واسطے سے بیان کیا ‘ انہوں نے کہا کہ مجھ سے نافع نے بیان کیا کہ حضرت عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ایک صاع جَو یا ایک صاع کھجور کا صدقہ فطر ، چھوٹے ، بڑے ، آزاد اور غلام سب پر فرض قرار دیا ۔</b>",
        "bookID": "24.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 114150,
        "last_updated": null
    }
]