[
    {
        "urduURN": 4017740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1773,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا کہ ہم کو امام مالک نے خبر دی ، انہیں ابوبکر بن عبدالرحمٰن کے غلام سمی نے خبر دی ، انہیں ابوصالح سمان نے خبر دی اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ایک عمرہ کے بعد دوسرا عمرہ دونوں کے درمیان کے گناہوں کا کفارہ ہے اور حج مبرور کی جزا جنت کے سوا اور کچھ نہیں ہے ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 116780,
        "last_updated": null
    },
    {
        "urduURN": 4017750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1774,
        "hadithSanad": "ہم سے احمد بن محمد نے بیان کیا ، انہیں عبداللہ بن مبارک نے خبر دی ، انہیں ابن جریج نے خبر دی کہ",
        "hadithText": "عکرمہ بن خالد نے حضرت ابن عمر رضی اللہ عنہما سے حج سے پہلے عمرہ کرنے کے بارے میں پوچھا تو انہوں نے کہا کوئی حرج نہیں ، عکرمہ نے کہا حضرت ابن عمر رضی اللہ عنہما نے بتلایا کہ نبی کریم صلی اللہ علیہ وسلم نے حج کرنے سے پہلے عمرہ ہی کیا تھا اور ابراہیم بن سعد نے محمد بن اسحاق سے بیان کیا ، ان سے عکرمہ بن خالد نے بیان کیا کہ میں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے پوچھا پھر یہی حدیث بیان کی ۔ ہم سے عمرو بن علی فلاس نے بیان کیا ، ان سے ابوعاصم نے بیان کیا ، انہیں ابن جریج نے خبر دی ، ان سے عکرمہ بن خالد نے بیان کیا کہ میں نے ابن عمر رضی اللہ عنہما سے پوچھا پھر یہی حدیث بیان کی ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 0,
        "last_updated": null
    },
    {
        "urduURN": 4017760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1775,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، ان سے جریر نے بیان کیا ، ان سے منصور نے ، ان سے مجاہد نے بیان کیا کہ",
        "hadithText": "میں اور عروہ بن زبیر مسجد نبوی میں داخل ہوئے ، وہاں عبداللہ بن عمر رضی اللہ عنہما حضرت عائشہ رضی اللہ عنہا کے حجرہ کے پاس بیٹھے ہوئے تھے ، کچھ لوگ مسجد نبوی میں اشراق کی نماز پڑھ رہے تھے ۔ انہوں نے بیان کیا کہ ہم نے عبداللہ بن عمر سے ان لوگوں کی اس نماز کے متعلق پوچھا تو آپ نے فرمایا کہ بدعت ہے ، پھر ان سے پوچھا کہ نبی کریم صلی اللہ علیہ وسلم نے کتنے عمرے کئے تھے ؟ انہوں نے کہا کہ چار ، ایک ان میں سے رجب میں کیا تھا ، لیکن ہم نے پسند نہیں کیا کہ ان کی اس بات کی تردید کریں ۔ \n<span class=urdu_sanad>مجاہد نے بیان کیا کہ</span> ہم نے ام المؤمنین عائشہ رضی اللہ عنہا کے حجرہ سے ان کے مسواک کرنے کی آواز سنی تو عروہ نے پوچھا اے میری ماں ! اے ام المؤمنین ! ابوعبدالرحمٰن کی بات آپ سن رہی ہیں ؟ عائشہ رضی اللہ عنہا نے پوچھا وہ کیا کہہ رہے ہیں ؟ انہوں نے کہا کہہ رہے ہیں کہ رسول کریم صلی اللہ علیہ وسلم نے چار عمرے کئے تھے جن میں سے ایک رجب میں کیا تھا ، انہوں نے فرمایا کہ اللہ ابوعبدالرحمٰن پر رحم کرے ! آنحضرت صلی اللہ علیہ وسلم نے تو کوئی عمرہ ایسا نہیں کیا جس میں وہ خود موجود نہ رہے ہوں ، آپ صلی اللہ علیہ وسلم نے رجب میں تو کبھی عمرہ ہی نہیں کیا ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 116811,
        "last_updated": null
    },
    {
        "urduURN": 4017780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1777,
        "hadithSanad": "ہم سے ابوعاصم نے بیان کیا ، کہا ہم کو ابن جریج نے خبر دی ، کہا کہ مجھے عطاء  بن ابی رباح نے خبر دی ، ان سے عروہ بن زبیر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے عائشہ رضی اللہ عنہا سے پوچھاتو آپ نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم نے رجب میں کوئی عمرہ نہیں کیا تھا ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 116830,
        "last_updated": null
    },
    {
        "urduURN": 4017790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1778,
        "hadithSanad": "ہم سے حسان بن حسان نے بیان کیا کہ ہم سے ہمام بن یحییٰ نے بیان کیا ، ان سے قتادہ نے کہ",
        "hadithText": "میں نے انس رضی اللہ عنہ سے پوچھا کہ نبی کریم صلی اللہ علیہ وسلم نے کتنے عمرے کئے تھے ؟ تو آپ نے فرمایا کہ چار ، عمرہ حدیبیہ ذی قعدہ میں جہاں پر مشرکین نے آپ صلی اللہ علیہ وسلم کو روک دیا تھا ، پھر آئندہ سال ذی قعدہ ہی میں ایک عمرہ قضاء جس کے متعلق آپ صلی اللہ علیہ وسلم نے مشرکین سے صلح کی تھی اور تیسرا عمرہ جعرانہ جس موقع پر آپ صلی اللہ علیہ وسلم نے غالباً حنین کی غنیمت تقسیم کی تھی ، چوتھا حج کے ساتھ میں نے پوچھا اور آنحضرت صلی اللہ علیہ وسلم نے حج کتنے کئے ؟ فرمایا کہ ایک ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 116840,
        "last_updated": null
    },
    {
        "urduURN": 4017800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1779,
        "hadithSanad": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا ، کہا کہ ہم سے ہمام نے بیان کیا ، ان سے قتادہ نے بیان کیا کہ",
        "hadithText": "میں نے انس رضی اللہ عنہ سے آنحضرت صلی اللہ علیہ وسلم کے عمرہ کے متعلق پوچھا تو آپ نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم نے ایک عمرہ وہاں کیا جہاں سے آپ صلی اللہ علیہ وسلم کو مشرکین نے واپس کر دیا تھا اور دوسرے سال ( اسی ) عمرہ حدیبیہ ( کی قضاء ) کی تھی اور ایک عمرہ ذی قعدہ میں اور ایک اپنے حج کے ساتھ کیا تھا ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 116850,
        "last_updated": null
    },
    {
        "urduURN": 4017810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1780,
        "hadithSanad": "ہم سے ہدبہ بن خالد نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، اس روایت میں یوں ہے کہ",
        "hadithText": "جو عمرہ آنحضرت صلی اللہ علیہ وسلم نے اپنے حج کے ساتھ کیا تھا اس کے سوا تمام عمرے ذی قعدہ ہی میں کئے تھے ۔ حدیبیہ کا عمرہ اور دوسرے سال اس کی قضاء کا عمرہ تھا ۔ ( کیونکہ آپ صلی اللہ علیہ وسلم نے قران کیا تھا اورحجۃ الوداع سے متعلق ہے ) اور جعرانہ کا عمرہ جب آپ صلی اللہ علیہ وسلم نے جنگ حنین کی غیمت تقسیم کی تھی ۔ پھر ایک عمرہ اپنے حج کے ساتھ کیا تھا ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 116860,
        "last_updated": null
    },
    {
        "urduURN": 4017820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1781,
        "hadithSanad": "ہم سے احمد بن عثمان نے بیان کیا ، انہوں نے کہا ہم سے شریح بن مسلمہ نے بیان کیا ، انہوں نے کہا کہ ہم سے ابراہیم بن یوسف نے بیان کیا ، ان سے ان کے باپ نے اور ان سے ابواسحٰق نے بیان کیا کہ میں نے مسروق ، عطاء اور مجاہد رحمہم اللہ تعالیٰ سے پوچھا تو ان سب حضرات نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے حج سے پہلے ذی قعدہ ہی میں عمرے کئے تھے اور انہوں نے بیان کیا کہ میں نے براء بن عازب رضی اللہ عنہ سے سنا ، انہوں نے فرمایا کہ نبی کریم صلی اللہ علیہ وسالم نے ماہ ذی قعدہ میں حج سے پہلے دو عمرے کئے تھے ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 116870,
        "last_updated": null
    },
    {
        "urduURN": 4017830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1782,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ بن قطان نے بیان کیا ، ان سے ابن جریج نے ، ان سے عطاء  بن ابی رباح نے بیان کیا کہ میں نے عبداللہ بن عباس رضی اللہ عنہما سے سنا ، انہوں نے ہمیں خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ایک انصاری خاتون ( ام سنان رضی اللہ عنہا ) سے ( ابن عباس رضی اللہ عنہما نے ان کا نام بتایا تھا لیکن مجھے یاد نہ رہا ) پوچھا کہ تو ہمارے ساتھ حج کیوں نہیں کرتی ؟ وہ کہنے لگی کہ ہمارے پاس ایک اونٹ تھا ، جس پر ابوفلاں ( یعنی اس کا خاوند ) اور اس کا بیٹا سوار ہو کر حج کے لیے چل دیئے اور ایک اونٹ انہوں نے چھوڑا ہے ، جس سے پانی لایا جاتا ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کے اچھا جب رمضان آئے تو عمرہ کر لینا کیونکہ رمضان کا عمرہ ایک حج کے برابر ہوتا ہے یا اسی جیسی کوئی بات آپ صلی اللہ علیہ وسلم نے فرمائی ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 116880,
        "last_updated": null
    },
    {
        "urduURN": 4017840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1783,
        "hadithSanad": "ہم سے محمد بن سلام بیکندی نے بیان کیا ، کہا کہ ہم کو ابومعاویہ نے خبر دی ، ان سے ہشام نے بیان کیا ، ان سے ان کے والد عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا ، کہ",
        "hadithText": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مدینہ سے نکلے تو ذی الحجہ کا چاند نکلنے والا تھا ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر کوئی حج کا احرام باندھنا چاہتا ہے تو وہ حج کا باندھ لے اور اگر کوئی عمرہ کا باندھنا چاہتا ہے تو وہ عمرہ کا باندھ لے ۔ اگر میرے ساتھ ہدی نہ ہوتی تو میں بھی عمرہ کا احرام باندھتا ۔ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ ہم میں بعض نے تو عمرہ کا احرام باندھا اور بعض نے حج کا احرام باندھا ۔ میں بھی ان لوگوں میں تھی جنہوں نے عمرہ کا احرام باندھا تھا ، لیکن عرفہ کا دن آیا تو میں اس وقت حائضہ تھی ، چنانچہ میں نے اس کی حضور صلی اللہ علیہ وسلم سے شکایت کی آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر عمرہ چھوڑ دے اور سر کھول دے اور اس میں کنگھا کر لے پھر حج کا احرام باندھا لینا ۔ ( میں نے ایسا ہی کیا ) جب محصب میں قیام کی رات آئی تو حضور صلی اللہ علیہ وسلم نے عبدالرحمٰن کو میرے ساتھ تنعیم بھیجا ، وہاں سے میں نے عمرہ کا احرام اپنے اس عمرہ کے بدلہ میں باندھا ( جس کو توڑ ڈالا تھا ) ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 116890,
        "last_updated": null
    },
    {
        "urduURN": 4017850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1784,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے ، انہوں نے عمرو بن اوس سے سنا ، ان کو عبدالرحمٰن بن ابی بکر رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے انہیں حکم دیا کہ عائشہ رضی اللہ عنہا کو اپنے ساتھ سواری پر لے جائیں اور تنعیم سے انہیں عمرہ کرا لائیں ۔ سفیان بن عیینہ نے کہیں یوں کہا میں نے عمرو بن دینار سے سنا ، کہیں یوں کہا میں نے کئی بار اس حدیث کو عمرو بن دینار سے سنا ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 116900,
        "last_updated": null
    },
    {
        "urduURN": 4017860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1785,
        "hadithSanad": "ہم سے محمد بن مثنی نے بیان کیا ، ان سے عبدالوہاب بن عبدالمجید نے ، ان سے حبیب معلم نے ، ان سے عطاء  بن ابی رباح نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم اور آپ کے اصحاب نے حج کا احرام باندھا تھا اور آنحضرت صلی اللہ علیہ وسلم اور طلحہ رضی اللہ عنہ کے سوا قربانی کسی کے پاس نہیں تھی ۔ ان ہی دنوں میں حضرت علی رضی اللہ عنہ یمن سے آئے تو ان کے ساتھ بھی قربانی تھی ۔ انہوں نے کہا کہ جس چیز کا احرام رسول اللہ صلی اللہ علیہ وسلم نے باندھا ہے میرا بھی احرام وہی ہے ، آنحضرت صلی اللہ علیہ وسلم نے اپنے اصحاب کو ( مکہ میں پہنچ کر ) اس کی اجازت دے دی تھی کہ اپنے حج کو عمرہ میں تبدیل کر دیں اور بیت اللہ کا طواف اور صفا و مروہ کی سعی کر کے بال ترشوا لیں اور احرام کھول دیں ، لیکن وہ لوگ ایسا نہ کریں جن کے ساتھ قربانی ہو ۔ اس پر لوگوں نے کہا کہ ہم منیٰ سے حج کے لیے اس طرح سے جائیں گے کہ ہمارے ذکر سے منی ٹپک رہی ہو ۔ یہ بات رسول اللہ صلی اللہ علیہ وسلم تک پہنچی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو بات اب ہوئی اگر پہلے سے معلوم ہوتی تو میں اپنے ساتھ ہدی نہ لاتا اور اگر میرے ساتھ ہدی نہ ہوتی تو ( افعال عمرہ ادا کرنے کے بعد ) میں بھی احرام کھول دیتا ۔ عائشہ رضی اللہ عنہا ( اس حج میں ) حائضہ ہو گئی تھیں اس لیے انہوں نے اگرچہ تمام مناسک ادا کئے لیکن بیت اللہ کا طواف نہیں کیا ۔ پھر جب وہ پاک ہو گئیں اور طواف کر لیا تو عرض کی یا رسول اللہ ! سب لوگ حج اور عمرہ دونوں کر کے واپس ہو رہے ہیں لیکن میں صرف حج کر سکی ہوں ، آپ صلی اللہ علیہ وسلم نے اس پر عبدالرحمٰن بن ابوبکر رضی اللہ عنہما سے کہا کہ انہیں ہمراہ لے کر تنعیم جائیں اور عمرہ کرا لائیں ، یہ عمرہ حج کے بعد ذی الحجہ کے ہی مہینہ میں ہوا تھا ۔ آنحضرت صلی اللہ علیہ وسلم جب جمرہ عقبہ کی رمی کر رہے تھے تو سراقہ بن مالک بن جعشم آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور پوچھا کہ یا رسول اللہ ! کیا یہ ( عمرہ اور حج کے درمیان احرام کھول دینا ) صرف آپ ہی کے لیے ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں بلکہ ہمیشہ کے لیے ہے ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 116910,
        "last_updated": null
    },
    {
        "urduURN": 4017870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1786,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا کہ ہم سے یحییٰ بن قطان نے بیان کیا ، ان سے ہشام بن عروہ نے بیان کیا ، کہا کہ مجھے میرے والد عروہ نے خبر دی کہا کہ",
        "hadithText": "مجھے عائشہ رضی اللہ عنہا نے خبر دی انہوں نے کہا کہ ذی الحجہ کا چاند نکلنے والا تھا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مدینہ سے حج کے لیے چلے آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جو عمرہ کا احرام باندھنا چاہے وہ عمرہ کا باندھ لے اور جو حج کا باندھنا چاہے وہ حج کا باندھ لے ، اگر میں اپنے ساتھ قربانی نہ لاتا تو میں بھی عمرہ کا ہی احرام باندھتا ، چنانچہ بہت سے لوگوں نے عمرہ کا احرام باندھا اور بہتوں نے حج کا ۔ میں بھی ان لوگوں میں تھی جنہوں نے عمرہ کا احرام باندھا تھا ۔ مگر میں مکہ میں داخل ہونے سے پہلے حائضہ ہو گئی ، عرفہ کا دن آ گیا اور ابھی میں حائضہ ہی تھی ، اس کا رونا میں رسول اللہ صلی اللہ علیہ وسلم کے سامنے روئی ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ عمرہ چھوڑ دے اور سر کھول لے اور کنگھا کر لے پھر حج کا احرام باندھ لینا ، چنانچہ میں نے ایسا ہی کیا ، اس کے بعد جب محصب کی رات آئی تو آنحضرت صلی اللہ علیہ وسلم نے میرے ساتھ عبدالرحمٰن کو تنعیم بھیجا وہ مجھے اپنی سواری پر پیچھے بٹھا کر لے گئے وہاں سے عائشہ رضی اللہ عنہا نے اپنے ( چھوڑے ہوئے ) عمرے کے بجائے دوسرے عمرہ کا احرام باندھا اس طرح اللہ تعالیٰ نے ان کا بھی حج اور عمرہ دونوں ہی پورے کر دیئے نہ تو اس کے لیے انہیں قربانی لانی پڑی نہ صدقہ دینا پڑا اور نہ روزہ رکھنا پڑا ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 116920,
        "last_updated": null
    },
    {
        "urduURN": 4017880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1787,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ان سے یزید بن زریع نے بیان کیا ، ان سے ابن عون نے بیان کیا ، ان سے قاسم بن محمد نے اور دوسری ( روایت میں ) ابن عون ، ابراہیم سے روایت کرتے ہیں اور وہ اسود سے ، انہوں نے بیان کیا کہ",
        "hadithText": "حضرت عائشہ رضی اللہ عنہا نے کہا یا رسول اللہ ! لوگ تو دو نسک ( حج اور عمرہ ) کر کے واپس ہو رہے ہیں اور میں نے صرف ایک نسک ( حج ) کیا ہے ؟ اس پر ان سے کہا گیا کہ پھر انتظار کریں اور جب پاک ہو جائیں تو تنعیم جا کر وہاں سے ( عمرہ کا ) احرام باندھیں ، پھر ہم سے فلاں جگہ آملیں اور یہ کہ اس عمرہ کا ثواب تمہارے خرچ اور محنت کے مطابق ملے گا ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 116930,
        "last_updated": null
    },
    {
        "urduURN": 4017890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1788,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے افلح بن حمید نے بیان کیا ، ان سے قاسم بن محمد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "حج کے مہینوں اور آداب میں ہم حج کا احرام باندھ کر مدینہ سے چلے اور مقام سرف میں پڑاؤ کیا ، نبی کریم صلی اللہ علیہ وسلم نے اپنے اصحاب سے فرمایا کہ جس کے ساتھ قربانی نہ ہو اور وہ چاہے کہ اپنے حج کے احرام کو عمرہ میں بدل دے تو وہ ایسا کرسکتاہے ، لیکن جس کے ساتھ قربانی ہے وہ ایسا نہیں کر سکتا ۔ نبی کریم صلی اللہ علیہ وسلم اور آپ کے اصحاب میں سے بعض مقدور والوں کے ساتھ قربانی تھی ، اس لیے ان کا ( احرام صرف ) عمرہ کا نہیں رہا ، پھر نبی کریم صلی اللہ علیہ وسلم میرے یہاں تشریف لائے تو میں رو رہی تھی ، آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ رو کیوں رہی ہو ؟ میں نے کہا آپ صلی اللہ علیہ نے اپنے اصحاب سے جو کچھ فرمایا میں سن رہی تھی ، اب تو میرا عمرہ رہ گیا آپ صلی اللہ علیہ وسلم نے پوچھا کیا بات ہوئی ؟ میں نے کہا کہ میں نماز نہیں پڑھ سکتی ( حیض کی وجہ سے ) آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ کوئی حرج نہیں ، تو بھی آدم کی بیٹیوں میں سے ایک ہے ، اور جو ان سب کے مقدر میں لکھا ہے وہی تمہارا بھی مقدرہے ۔ اب حج کا احرام باندھ لے شاید اللہ تعالیٰ تمہیں عمرہ بھی نصیب کرے ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نے حج کا احرام باندھ لیا پھر جب ہم ( حج سے فارغ ہو کر اور ) منی سے نکل کر محصب میں اترے تو آنحضرت صلی اللہ علیہ وسلم نے عبدالرحمٰن کو بلایا اور ان سے کہا کہ اپنی بہن کو حد حرم سے باہر لے جا ( تنعیم ) تاکہ وہ وہاں سے عمرہ کا احرام باندھ لیں ، پھر طواف و سعی کروہم تمہارا انتظار یہیں کریں گے ۔ ہم آدھی رات کو آپ کی خدمت میں پہنچے تو آپ صلی اللہ علیہ وسلم نے پوچھا کیا فارغ ہو گئے ؟ میں نے کہا ہاں ، آنحضرت صلی اللہ علیہ وسلم نے اس کے بعد اپنے اصحاب میں کوچ کا اعلان کر دیا ۔ بیت اللہ کا طوف وداع کرنے والے لوگ صبح کی نماز سے پہلے ہی روانہ ہو گئے اور مدینہ کی طرف چل دیئے ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 116940,
        "last_updated": null
    },
    {
        "urduURN": 4017900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1789,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا کہ ہم سے ہمام نے بیان کیا ، ان سے عطابن ابی رباح نے بیان کیا ، انہوں نے کہا کہ مجھ سے صفوان بن یعلیٰ بن امیہ نے بیان کیا ، ان سے ان کے والد نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جعرانہ میں تھے ، تو آپ صلی اللہ علیہ وسلم کی خدمت میں ایک شخص حاضر ہوا جبہ پہنے ہوئے اور اس پر خلوق یا زردی کا نشان تھا ۔ اس نے پوچھا مجھے اپنے عمرہ میں آپ صلی اللہ علیہ وسلم کس طرح کرنے کا حکم دیتے ہیں ؟ اس پر اللہ تعالیٰ نے نبی کریم صلی اللہ علیہ وسلم پر وحی نازل کی اور آپ صلی اللہ علیہ وسلم پر کپڑا ڈال دیا گیا ، میری بڑی آرزو تھی کہ جب حضور صلی اللہ علیہ وسلم پر وحی نازل ہو رہی ہو تو میں آپ صلی اللہ علیہ وسلم کو دیکھوں ۔ عمر رضی اللہ عنہ نے فرمایا یہاں آؤ نبی کریم صلی اللہ علیہ وسلم پر جب وحی نازل ہو رہی ہو ، اس وقت تم حضور صلی اللہ علیہ وسلم کو دیکھنے کے آرزو مند ہو ؟ میں نے کہا ہاں ! انہوں نے کپڑے کا کنارہ اٹھایا اور میں نے اس میں سے آپ صلی اللہ علیہ وسلم کو دیکھا آپ زور زور سے خراٹے لے رہے تھے ، میرا خیال ہے کہ انہوں نے بیان کیا ” جیسے اونٹ کے سانس کی آواز ہوتی ہے “ پھر جب وحی اترنی بند ہوئی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ پوچھنے والا کہاں ہے جو عمرہ کے بارے میں پوچھتا تھا ؟ اپنا جبہ اتار دے ، خلوق کے اثر کو دھو ڈال اور ( زعفران کی ) زردی صاف کر لے اور جس طرح حج میں کرتے ہو اسی طرح اس میں بھی کرو ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 116950,
        "last_updated": null
    },
    {
        "urduURN": 4017910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1790,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو امام مالک نے خبر دی ، انہیں ہشام بن عروہ نے ، انہیں ان کے والد ( عروہ بن زبیر ) نے کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ صدیقہ رضی اللہ عنہا سے پوچھا جب کہ ابھی میں نوعمر تھا کہ اللہ تعالیٰ کا ارشاد ” صفا اور مروہ دونوں اللہ تعالیٰ کی نشانیاں ہیں اس لیے جو شخص بیت اللہ کا حج یا عمرہ کرے اس کے لیے ان کی سعی کرنے میں کوئی گناہ نہیں “ اس لیے میں سمجھتا ہوں کہ اگر کوئی ان کی سعی نہ کرے تو اس پر کوئی گناہ نہ ہو گا ۔ یہ سن کر حضرت عائشہ صدیقہ رضی اللہ عنہا نے فرمایا کہ ہرگز نہیں ۔ اگر مطلب یہ ہوتا جیسا کہ تم بتا رہے ہو پھر تو ان کی سعی نہ کرنے میں واقعی کوئی حرج نہیں تھا ، لیکن یہ آیت تو انصار کے بارے میں نازل ہوئی ہے جو منات بت کے نام کا احرام باندھتے تھے جو قدید کے مقابل میں رکھا ہوا تھا وہ صفا اور مروہ کی سعی کو اچھا نہیں سمجھتے تھے ، جب اسلام آیا تو انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کے بارے میں پوچھا اور اس پر اللہ تعالیٰ نے یہ آیت نازل فرمائی کہ ” صفا اور مروہ دونوں اللہ کی نشانیاں ہیں اس لیے جو شخص بیت اللہ کا حج یا عمرہ کرے اس کے یے ان کی سعی کرنے میں کوئی گناہ نہیں “ سفیان اور ابومعاویہ نے ہشام سے یہ زیادتی نکالی ہے کہ جو کوئی صفا مروہ کا پھیرا نہ کرے تو اللہ اس کا حج اور عمرہ پورا نہ کرے گا ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 116960,
        "last_updated": null
    },
    {
        "urduURN": 4017920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1791,
        "hadithSanad": "ہم سے اسحاق بن ابراہیم نے بیان کیا ، ان سے جریر نے ، ان سے اسماعیل نے ، ان سے عبداللہ بن ابی اوفی نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے عمرہ بھی کیا اور ہم نے بھی آپ صلی اللہ علیہ وسلم کے ساتھ عمرہ کیا ، چنانچہ جب آپ صلی اللہ علیہ وسلم مکہ میں داخل ہوئے تو آپ صلی اللہ علیہ وسلم نے پہلے ( بیت اللہ کا ) طواف کیا اور آپ صلی اللہ علیہ وسلم کے ساتھ ہم نے بھی طواف کیا ، پھر صفا اور مروہ آئے اور ہم بھی آپ صلی اللہ علیہ وسلم کے ساتھ آئے ۔ ہم آپ صلی اللہ علیہ وسلم کی مکہ والوں سے حفاظت کر رہے تھے کہ کہیں کوئی کافر تیر نہ چلا دے ، میرے ایک ساتھی نے ابن ابی اوفی سے پوچھا کیا آنحضرت صلی اللہ علیہ وسلم کعبہ میں اندر داخل ہوئے تھے ؟ انہوں نے فرمایا کہ نہیں ۔ \n<span class=urdu_sanad>کہا انہوں نے پھر پوچھا کہ</span> آنحضرت صلی اللہ علیہ وسلم نے حضرت خدیجہ رضی اللہ عنہا کے متعلق کیا کچھ فرمایا تھا ؟ انہوں نے کہا کہ آپ نے فرمایا تھا ” خدیجہ رضی اللہ عنہا کو جنت میں ایک موتی کے گھر کی بشارت ہو ، جس میں نہ کسی قسم کا شور و غل ہو گا نہ کوئی تکلیف ہو گی ۔ “</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 116971,
        "last_updated": null
    },
    {
        "urduURN": 4017940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1793,
        "hadithSanad": "ہم سے حمیدی نے بیان کیا ، ان سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے کہا کہ",
        "hadithText": "ہم نے ابن عمر رضی اللہ عنہما سے ایک ایسے شخص کے بارے میں دریافت کیا جو عمرہ کے لیے بیت اللہ کا طواف تو کرتا ہے لیکن صفا اور مروہ کی سعی نہیں کرتا ، کیا وہ ( صرف بیت اللہ کے طواف کے بعد ) اپنی بیوی سے ہمبستر ہو سکتا ہے ؟ انہوں نے اس کا جواب یہ دیا کہ نبی کریم صلی اللہ علیہ وسلم ( مکہ ) تشریف لائے اور آپ صلی اللہ علیہ وسلم نے بیت اللہ کا سات چکروں کے ساتھ طواف کیا ، پھر مقام ابراہیم علیہ السلام کے قریب دو رکعت نماز پڑھی ، اس کے بعد صفا اور مروہ کی سات مرتبہ سعی کی ” اور رسول اللہ صلی اللہ علیہ وسلم کی زندگی تمہارے لیے بہترین نمونہ ہے ۔ “ \n<span class=urdu_sanad>انہوں نے بیان کیا کہ</span> ہم نے جابر بن عبداللہ رضی اللہ عنہما سے بھی اس کے متعلق سوال کیا تو آپ نے فرمایا صفا اور مروہ کی سعی سے پہلے اپنی بیوی کے قریب بھی نہ جانا چاہئے ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 116991,
        "last_updated": null
    },
    {
        "urduURN": 4017960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1795,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، ان سے غندر بن محمد بن جعفر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے قیس بن مسلم نے بیان کیا ، ان سے طارق بن شہاب نے بیان کیا ، اور ان سے ابوموسیٰ اشعری نے بیان کیا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں بطحاء میں حاضر ہوا آپ وہاں ( حج کے لیے جاتے ہوئے اترے ہوئے تھے ) آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کیا تمہارا حج ہی کا ارادہ ہے ؟ میں نے کہا ، جی ہاں ۔ آپ صلی اللہ علیہ وسلم نے پوچھا اور احرام کس چیز کا باندھا ہے ؟ میں نے کہا میں نے اسی کا احرام باندھا ہے ، جس کا نبی کریم صلی اللہ علیہ وسلم نے احرام باندھا ہو ، آپ صلی اللہ علیہ وسلم نے فرمایا تو نے اچھا کیا ، اب بیت اللہ کا طواف اور صفا اور مروہ کی سعی کر لے پھر احرام کھول ڈال ، چنانچہ میں نے بیت اللہ کا طوا ف کیا اور صفا اور مروہ کی سعی ، پھر میں بنو قیس کی ایک عورت کے پاس آیا اور انہوں نے میرے سر کی جوئیں نکالیں ، اس کے بعد میں نے حج کا احرام باندھا ۔ میں ( آنحضرت صلی اللہ علیہ وسلم کی وفات کے بعد ) اسی کے مطابق لوگوں کو مسئلہ بتایا کرتا تھا ، جب عمر رضی اللہ عنہ کی خلافت کا دور آیا تو آپ رضی اللہ عنہ نے فرمایا کہ ہمیں کتاب اللہ پر عمل کرنا چاہے کہ اس میں ہمیں ( حج اور عمرہ ) پورا کرنے کا حکم ہوا ہے اور رسول اللہ صلی اللہ علیہ وسلم کی سنت پر عمل کرنا چاہیے کہ اس وقت آپ صلی اللہ علیہ وسلم نے احرام نہیں کھولا تھا جب تک ہدی کی قربانی نہیں ہو گئی تھی ۔ لہٰذا ہدی ساتھ لانے والوں کے واسطے ایسا ہی کرنے کا حکم ہے ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 117010,
        "last_updated": null
    },
    {
        "urduURN": 4017970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1796,
        "hadithSanad": "ہم سے احمد بن عیسیٰ نے بیان کیا ، انہوں نے کہا ہم سے ابن وہب نے بیان کیا ، انہیں عمرو نے خبر دی ، انہیں ابوالاسود نے کہ",
        "hadithText": "اسماء بنت ابی بکر رضی اللہ عنہا کے غلام عبداللہ نے ان سے بیان کیا ، انہوں نے اسماء رضی اللہ عنہا سے سنا تھا ، وہ جب بھی حجون پہاڑ سے ہو کر گزرتیں تو یہ کہتیں رحمتیں نازل ہوں اللہ کی محمد صلی اللہ علیہ وسلم پر ، ہم نے آپ صلی اللہ علیہ وسلم کے ساتھ یہیں قیام کیا تھا ، ان دنوں ہمارے ( سامان ) بہت ہلکے پھلکے تھے ، سواریاں اور زادراہ کی بھی کمی تھی ، میں نے ، میری بہن عائشہ رضی اللہ عنہا نے ، زبیر اور فلاں فلاں رضی اللہ عنہم نے عمرہ کیا اور جب بیت اللہ کا طواف کر چکے تو ( صفا اور مروہ کی سعی کے بعد ) ہم حلال ہو گئے ، حج کا احرام ہم نے شام کو باندھا تھا ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 117020,
        "last_updated": null
    },
    {
        "urduURN": 4017980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1797,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہمیں امام مالک نے خبر دی ، انہیں نافع نے اور انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم جب کسی غزوہ یا حج و عمرہ سے واپس ہوتے تو جب بھی کسی بلند جگہ کا چڑھاؤ ہوتا تو تین مرتبہ «الله اكبر» کہتے اور یہ دعا پڑھتے «لا إله إلا الله وحده لا شريك له ،‏‏‏‏ ‏‏‏‏ له الملك ،‏‏‏‏ ‏‏‏‏ وله الحمد ،‏‏‏‏ ‏‏‏‏ وهو على كل شىء قدير ،‏‏‏‏ ‏‏‏‏ آيبون تائبون عابدون ساجدون لربنا حامدون ،‏‏‏‏ ‏‏‏‏ صدق الله وعده ونصر عبده وهزم الأحزاب وحده» ” اللہ کے سوا کوئی معبود نہیں وہ اکیلا ہے اس کا کوئی شریک نہیں ، ملک اسی کا ہے اور حمد اسی کے لیے ہے وہ ہرچیز پر قادر ہے ، ہم واپس ہو رہے ہیں ، توبہ کرتے ہوئے عبادت کرتے ہوئے اپنے رب کے حضور سجدہ کرتے ہوئے اور اس کی حمد کرتے ہوئے ، اللہ نے اپنا وعدہ سچا کر دکھایا ، اپنے بندے کی مدد کی اور سارے لشکر کو تنہا شکست دے دی ۔ ( فتح مکہ کی طرف اشارہ ہے ) ۔ “</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 117030,
        "last_updated": null
    },
    {
        "urduURN": 4017990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1798,
        "hadithSanad": "ہم سے معلی بن اسد نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، ان سے خالد نے بیان کیا ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم مکہ تشریف لائے تو بنو عبدالمطلب کے چند بچوں نے آپ صلی اللہ علیہ وسلم کا استقبال کیا ، آپ صلی اللہ علیہ وسلم نے ایک بچے کو ( اپنی سواری کے ) آگے بٹھا لیا اور دوسرے کو پیچھے ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 117040,
        "last_updated": null
    },
    {
        "urduURN": 4018000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1799,
        "hadithSanad": "ہم سے احمد بن حجاج نے بیان کیا ، انہوں نے کہا ہم سے انس بن عیاض نے بیان کیا ، ان سے عبیداللہ نے ، ان سے نافع نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جب مکہ تشریف لے جاتے تو مسجد شجرہ میں نماز پڑھتے ۔ اور جب واپس ہوتے تو ذو الحلیفہ کی وادی کے نشیب میں نماز پڑھتے ۔ آپ صلی اللہ علیہ وسلم صبح تک ساری رات وہیں رہتے ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 117050,
        "last_updated": null
    },
    {
        "urduURN": 4018010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1800,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے بیان کیا ، ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم ( سفر سے ) رات کو گھر نہیں پہنچتے تھے یا صبح کے وقت پہنچ جاتے یا دوپہر بعد ( زوال سے لے کر غروب آفتاب تک کسی بھی وقت تشریف لاتے ) ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 117060,
        "last_updated": null
    },
    {
        "urduURN": 4018020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1801,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے محارب بن دثار نے اور ان سے جابر رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ( سفر سے ) گھر رات کے وقت اترنے سے منع فرمایا ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 117070,
        "last_updated": null
    },
    {
        "urduURN": 4018030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1802,
        "hadithSanad": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا کہ ہم کو محمد بن جعفر نے خبر دی ، کہا کہ مجھے حمید طویل نے خبر دی انہوں نے انس بن مالک رضی اللہ عنہ سے سنا کہ آپ رضی اللہ عنہ نے کہا کہ",
        "hadithText": "جب رسول اللہ صلی اللہ علیہ وسلم سفر سے مدینہ واپس ہوتے اور مدینہ کے بالائی علاقوں پر نظر پڑتی تو اپنی اونٹنی کو تیز کر دیتے ، کوئی دوسرا جانور ہوتا تو اسے بھی ایڑ لگاتے ۔ ابوعبداللہ امام بخاری نے کہا کہ حارث بن عمیر نے حمید سے یہ لفظ زیادہ کئے ہیں کہ ” مدینہ سے محبت کی وجہ سے سواری تیز کر دیتے تھے ۔ “ ہم سے قتیبہ نے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے حمید طویل نے اور ان سے انس رضی اللہ عنہ نے ، انھوں نے ( درجات کے بجائے ) «جدرات» کہا ، اس کی متابعت حارث بن عمیر نے کی ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 0,
        "last_updated": null
    },
    {
        "urduURN": 4018040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1803,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ابواسحاق نے کہ میں نے براء بن عازب رضی اللہ عنہ سے سنا ، انہوں نے کہا کہ",
        "hadithText": "یہ آیت ہمارے بارے میں نازل ہوئی ۔ انصار جب حج کے لیے آتے تو ( احرام کے بعد ) گھروں میں دروازوں سے نہیں جاتے بلکہ دیواروں سے کود کر ( گھر کے اندر ) داخل ہوا کرتے تھے پھر ( اسلام لانے کے بعد ) ایک انصاری شخص آیا اور دروازے سے گھر میں داخل ہو گیا اس پر لوگوں نے لعنت ملامت کی تو یہ وحی نازل ہوئی کہ ” یہ کوئی نیکی نہیں ہے کہ گھروں میں پیچھے سے ( دیواروں پر چڑھ کر ) آؤ بلکہ نیک وہ شخص ہے جو تقویٰ اختیار کرے اور گھروں میں ان کے دروازوں سے آیا کرو ۔ “</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 117100,
        "last_updated": null
    },
    {
        "urduURN": 4018050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1804,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، ان سے سمی نے ، ان سے ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا سفر عذاب کا ایک ٹکڑا ہے ، آدمی کو کھانے پینے اور سونے ( ہر ایک چیز ) سے روک دیتا ہے ، اس لیے جب کوئی اپنی ضرورت پوری کر چکے تو فوراً گھر واپس آ جائے ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 117110,
        "last_updated": null
    },
    {
        "urduURN": 4018060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 26,
        "bookName": "کتاب عمرہ کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1805,
        "hadithSanad": "ہم سے سعید بن ابی مریم نے بیان کیا ، انہوں نے کہا ہم کو محمد بن جعفر نے خبر دی ، انہوں نے کہا کہ مجھے زید بن اسلم نے خبر دی ، ان سے ان کے باپ نے بیان کیا کہ",
        "hadithText": "میں حضرت عبداللہ بن عمر رضی اللہ عنہما کے ساتھ مکہ کے راستے میں تھا کہ انہیں ( اپنی بیوی ) صفیہ بنت ابی عبید کی سخت بیماری کی خبر ملی اور وہ نہایت تیزی سے چلنے لگے ، پھر جب سرخی غروب ہو گئی تو سواری سے نیچے اترے اور مغرب اور عشاء ایک ساتھ ملا کر پڑھیں ، اس کے بعد فرمایا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ جب جلدی چلنا ہوتا تو مغرب میں دیر کر کے دونوں ( عشاء اور مغرب ) کو ایک ساتھ ملا کر پڑھتے تھے ۔</b>",
        "bookID": "26.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 117120,
        "last_updated": null
    }
]