[
    {
        "urduURN": 4018070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 27,
        "bookName": "کتاب",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1806,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں نافع نے کہ",
        "hadithText": "عبداللہ بن عمر رضی اللہ عنہما فساد کے زمانہ میں عمرہ کرنے کے لیے جب مکہ جانے لگے تو آپ نے فرمایا کہ اگر مجھے کعبہ شریف پہنچنے سے روک دیا گیا تو میں بھی وہی کام کروں گا جو رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ہم لوگوں نے کیا تھا ، چنانچہ آپ نے بھی صرف عمرہ کا احرام باندھا کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے بھی حدیبیہ کے سال صرف عمرہ کا احرام باندھا تھا ۔</b>",
        "bookID": "27.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 117130,
        "last_updated": null
    },
    {
        "urduURN": 4018080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 27,
        "bookName": "کتاب",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1807,
        "hadithSanad": "ہم سے عبداللہ بن محمد بن اسماء نے بیان کیا ، کہا ہم سے جویریہ نے نافع سے بیان کیا ، انہیں عبیداللہ بن عبداللہ اور سالم بن عبداللہ نے خبر دی کہ",
        "hadithText": "جن دنوں عبداللہ بن زبیر رضی اللہ عنہما پر حجاج کی لشکر کشی ہو رہی تھی تو عبداللہ بن عمر رضی اللہ عنہما سے لوگوں نے کہا ( کیونکہ آپ مکہ جانا چاہتے تھے ) کہ اگر آپ اس سال حج نہ کریں تو کوئی نقصان نہیں کیونکہ ڈر اس کا ہے کہ کہیں آپ کو بیت اللہ پہنچنے سے روک نہ دیا جائے ۔ آپ بولے کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ گئے تھے اور کفار قریش ہمارے بیت اللہ تک پہنچنے میں حائل ہو گئے تھے ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے اپنی قربانی نحر کی اور سر منڈالیا ، عبداللہ نے کہا کہ میں تمہیں گواہ بناتا ہوں کہ میں نے بھی انشاءاللہ عمرہ اپنے پر واجب قرار دے لیا ہے ۔ میں ضرور جاؤں گا اور اگر مجھے بیت اللہ تک پہنچنے کا راستہ مل گیا تو طواف کروں گا ، لیکن اگر مجھے روک دیا گیا تو میں بھی وہی کام کروں گا جو نبی کریم صلی اللہ علیہ وسلم نے کیا تھا ، میں اس وقت بھی آپ صلی اللہ علیہ وسلم کے ساتھ موجود تھا چنانچہ آپ نے ذو الحلیفہ سے عمرہ کا احرام باندھا پھر تھوڑی دور چل کر فرمایا کہ حج اور عمرہ تو ایک ہی ہیں ، اب میں بھی تمہیں گواہ بناتا ہوں کہ میں نے عمرہ کے ساتھ حج بھی اپنے اوپر واجب قرار دے لیا ہے ، آپ نے حج اور عمرہ دونوں سے ایک ساتھ فارغ ہو کر ہی دسویں ذی الحجہ کو احرام کھولا اور قربانی کی ۔ آپ فرماتے تھے کہ جب تک حاجی مکہ پہنچ کر ایک طواف زیارت نہ کر لے پورا احرام نہ کھولنا چاہئے ۔</b>",
        "bookID": "27.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 117140,
        "last_updated": null
    },
    {
        "urduURN": 4018090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 27,
        "bookName": "کتاب",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1808,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے جویریہ نے بیان کیا",
        "hadithText": "ان سے نافع نے کہ عبداللہ رضی اللہ عنہ کے کسی بیٹے نے ان سے کہا تھا کاش آپ اس سال رک جاتے ( تو اچھا ہوتا اسی اوپر والے واقعہ کی طرف اشارہ ہے ) ۔</b>",
        "bookID": "27.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 117150,
        "last_updated": null
    },
    {
        "urduURN": 4018100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 27,
        "bookName": "کتاب",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1809,
        "hadithSanad": "ہم سے محمد نے بیان کیا ، کہا کہ ہم سے یحییٰ بن صالح نے بیان کیا ، ان سے معاویہ بن سلام نے بیان کیا ، ان سے یحییٰ بن ابی کثیر نے بیان کیا ، ان سے عکرمہ نے بیان کیا کہ",
        "hadithText": "ابن عباس رضی اللہ عنہما نے ان سے فرمایا رسول اللہ صلی اللہ علیہ وسلم جب حدیبیہ کے سال مکہ جانے سے روک دیئے گئے تو آپ نے حدیبیہ ہی میں اپنا سر منڈوایا اور ازواج مطہرات کے پاس گئے اور قربانی کو نحر کیا ، پھر آئندہ سال ایک دوسرا عمرہ کیا ۔</b>",
        "bookID": "27.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 117160,
        "last_updated": null
    },
    {
        "urduURN": 4018110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 27,
        "bookName": "کتاب",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1810,
        "hadithSanad": "ہم سے احمد بن محمد نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا کہ ہم کو یونس نے خبر دی ، ان سے زہری نے کہا کہ مجھے سالم نے خبر دی ، کہا کہ",
        "hadithText": "ابن عمر رضی اللہ عنہما فرمایا کرتے تھے کیا تمہارے لیے رسول اللہ صلی اللہ علیہ وسلم کی سنت کافی نہیں ہے کہ اگر کسی کو حج سے روک دیا جائے ، ہو سکے تو وہ بیت اللہ کا طواف کر لے اور صفا اور مروہ کی سعی ، پھر وہ ہر چیز سے حلال ہو جائے ، یہاں تک کہ وہ دوسرے سال حج کر لے پھر قربانی کرے ، اگر قربانی نہ ملے تو روزہ رکھے ، عبداللہ سے روایت ہے کہ ہمیں معمر نے خبر دی ، ان سے زہری نے بیان کیا کہ مجھ سے سالم نے بیان کیا ، ان سے ابن عمر رضی اللہ عنہما نے اسی پہلی روایت کی طرح بیان کیا ۔</b>",
        "bookID": "27.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 117171,
        "last_updated": null
    },
    {
        "urduURN": 4018120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 27,
        "bookName": "کتاب",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1811,
        "hadithSanad": "ہم سے محمود نے بیان کیا ، کہا ہم کو عبدالرزاق نے خبر دی ، کہا کہ ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں عروہ نے اور انہیں مسور رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ( صلح حدیبیہ کے موقع پر ) قربانی سر منڈوانے سے پہلے کی تھی ۔ اور آپ صلی اللہ علیہ وسلم نے اصحاب کو بھی اسی کا حکم دیا تھا ۔</b>",
        "bookID": "27.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 117190,
        "last_updated": null
    },
    {
        "urduURN": 4018130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 27,
        "bookName": "کتاب",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1812,
        "hadithSanad": "ہم سے محمد بن عبدالرحیم نے بیان کیا ، انہوں نے کہا کہ ہم کو ابوبدر شجاع بن ولید نے خبر دی ، انہوں نے کہا کہ ہم سے معمر بن محمد عمری نے بیان کیا اور ان سے نافع نے بیان کیا کہ",
        "hadithText": "عبداللہ اور سالم نے عبداللہ بن عمر رضی اللہ عنہما سے گفتگو کی ، ( کہ وہ اس سال مکہ نہ جائیں ) تو انہوں نے فرمایا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ عمرہ کا احرام باندھ کر گئے تھے اور کفارقریش نے ہمیں بیت اللہ سے روک دیا تھا تو رسول اللہ صلی اللہ علیہ وسلم نے اپنی قربانی کو نحر کیا اور سر منڈایا ۔</b>",
        "bookID": "27.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 117200,
        "last_updated": null
    },
    {
        "urduURN": 4018140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 27,
        "bookName": "کتاب",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1813,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے نافع نے بیان کیا کہ",
        "hadithText": "فتنہ کے زمانہ میں جب عبداللہ بن عمر رضی اللہ عنہما مکہ کے ارادے سے چلے تو فرمایا کہ اگر مجھے بیت اللہ تک پہنچے سے روک دیا گیا تو میں بھی وہی کام کروں گا جو ( حدیبیہ کے سال ) میں نے رسول کریم صلی اللہ علیہ وسلم کے ساتھ کیا تھا ۔ آپ نے عمرہ کا احرام باندھا کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے بھی حدیبیہ کے سال عمرہ ہی کا احرام باندھا تھا ۔ پھر آپ نے کچھ غور کر کے فرمایا کہ عمرہ اور حج تو ایک ہی ہے ، اس کے بعد اپنے ساتھیوں سے بھی یہی فرمایا کہ یہ دونوں تو ایک ہی ہیں ۔ میں تمہیں گواہ بناتا ہوں کہ عمرہ کے ساتھ اب حج بھی اپنے لیے میں نے واجب قرار دیے لیا ہے پھر ( مکہ پہنچ کر ) آپ نے دونوں کے لیے ایک ہی طواف کیا ۔ آپ کا خیال تھا کہ یہ کافی ہے اور آپ قربانی کا جانور بھی ساتھ لے گئے تھے ۔</b>",
        "bookID": "27.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 117220,
        "last_updated": null
    },
    {
        "urduURN": 4018150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 27,
        "bookName": "کتاب",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1814,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا کہ ہم کو امام مالک نے خبر دی ، انہیں حمید بن قیس نے ، انہیں مجاہد نے ، انہیں عبدالرحمٰن بن ابی لیلیٰ نے اور انہیں کعب بن عجرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے ان سے فرمایا ، غالباً جوؤں سے تم کو تکلیف ہے ، انہوں نے کہا کہ جی ہاں یا رسول اللہ ! آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر اپنا سر منڈالے اور تین دن کے روزے رکھ لے یا چھ مسکینوں کو کھانا کھلا دے یا ایک بکری ذبح کر ۔</b>",
        "bookID": "27.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 117230,
        "last_updated": null
    },
    {
        "urduURN": 4018160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 27,
        "bookName": "کتاب",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1815,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، انہوں نے کہا کہ مجھ سے مجاہد نے بیان کیا ، انہوں نے کہا کہ میں نے عبدالرحمٰن بن ابی لیلیٰ سے سنا ، ان سے کعب بن عجرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم حدیبیہ میں میرے پاس آ کر کھڑے ہوئے تو جوئیں میرے سر سے برابر گر رہی تھیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا یہ جوئیں تو تمہارے لیے تکلیف دہ ہیں ۔ میں نے کہا جی ہاں ، آپ صلی اللہ علیہ وسلم نے فرمایا پھر سر منڈالے یا آپ صلی اللہ علیہ وسلم نے صرف یہ لفظ فرمایا کہ منڈالے ۔ انہوں نے بیان کیا کہ یہ آیت میرے ہی بارے میں نازل ہوئی تھی کہ ” اگر تم میں کوئی مریض ہو یا اس کے سر میں کوئی تکلیف ہو “ آخر آیت تک ، پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا تین دن کے روزے رکھ لے یا ایک فرق غلہ سے چھ مسکینوں کو کھانا دے یا جو میسر ہو اس کی قربانی کر دے ۔</b>",
        "bookID": "27.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 117240,
        "last_updated": null
    },
    {
        "urduURN": 4018170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 27,
        "bookName": "کتاب",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1816,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے عبدالرحمٰن بن اصبہانی نے ، ان سے عبداللہ بن معقل نے بیان کیا کہ",
        "hadithText": "میں کعب بن عجرہ رضی اللہ عنہ کے پاس بیٹھا ہوا تھا ، میں نے ان سے فدیہ کے بارے میں پوچھا تو انہوں نے کہا کہ ( قرآن شریف کی آیت ) اگرچہ خاص میرے بارے میں نازل ہوئی تھی لیکن اس کا حکم تم سب کے لیے ہے ۔ ہوا یہ کہ مجھے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لایا گیا تو جوئیں سر سے میرے چہرے پر گر رہی تھیں ۔ آپ صلی اللہ علیہ وسلم نے ( یہ دیکھ کر فرمایا ) میں نہیں سمجھتا تھا کہ تمہیں اتنی زیادہ تکلیف ہو گی یا ( آپ نے یوں فرمایا کہ ) میں نہیں سمجھتا تھا کہ جہد ( مشقت ) تمہیں اس حد تک ہو گی ، کیا تجھ میں بکری ( بطور فدیہ ) دینے کی طاقت ہے ؟ میں نے کہا کہ نہیں ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر تین دن کے روزے رکھ یا چھ مسکینوں کو کھانا کھلا ، ہر مسکین کو آدھا صاع کھلانا ۔</b>",
        "bookID": "27.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 117250,
        "last_updated": null
    },
    {
        "urduURN": 4018180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 27,
        "bookName": "کتاب",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1817,
        "hadithSanad": "ہم سے اسحاق نے بیان کیا ، کہا ہم سے روح نے بیان کیا ، ان سے شبل بن عباد نے بیان کیا ، ان سے ابن ابی نجیح نے بیان کیا ، ان سے مجاہد نے بیان کیا کہ مجھ سے عبدالرحمٰن بن ابی لیلیٰ نے بیان کیا اور ان سے کعب بن عجرۃ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے انہیں دیکھا تو جوئیں ان کے چہرے پر گر رہی تھیں ، آپ صلی اللہ علیہ وسلم نے پوچھا کیا ان جوؤں سے تمہیں تکلیف ہے ؟ انہوں نے کہا کہ جی ہاں ، آپ صلی اللہ علیہ وسلم نے انہیں حکم دیا کہ اپنا سر منڈا لیں ۔ وہ اس وقت حدیبہ میں تھے ۔ ( صلح حدیبیہ کے سال ) اور کسی کو یہ معلوم نہیں تھا کہ وہ حدیبیہ ہی میں رہ جائیں گے بلکہ سب کی خواہش یہ تھی کہ مکہ میں داخل ہوں ۔ پھر اللہ تعالیٰ نے فدیہ کا حکم نازل فرمایا اور رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا کہ چھ مسکینوں کو ایک فرق ( یعنی تین صاع غلہ ) تقسیم کر دیا جائے یا ایک بکری کی قربانی کرے یا تین دن کے روزے رکھے ۔</b>",
        "bookID": "27.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 117260,
        "last_updated": null
    },
    {
        "urduURN": 4018190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 27,
        "bookName": "کتاب",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1818,
        "hadithSanad": "اور محمد بن یوسف سے روایت ہے کہ ہم کو ورقاء نے بیان کیا ، ان سے ابن ابی نجیح نے بیان کیا ، ان سے مجاہد نے بیان کیا ، انہیں عبدالرحمٰن بن ابی لیلیٰ نے خبر دی اور انہیں کعب بن عجرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے انہیں دیکھا تو جوئیں ان کے چہرہ پر گر رہی تھی ، پھر یہی حدیث بیان کی ۔</b>",
        "bookID": "27.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 117270,
        "last_updated": null
    },
    {
        "urduURN": 4018200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 27,
        "bookName": "کتاب",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1819,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے منصور نے ، ان سے ابوحازم نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس شخص نے اس گھر ( کعبہ ) کا حج کیا اور اس میں نہ «رفث» یعنی شہوت کی بات منہ سے نکالی اور نہ کوئی گناہ کا کام کیا تو وہ اس دن کی طرح واپس ہو گا جس دن اس کی ماں نے اسے جنا تھا ۔</b>",
        "bookID": "27.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 117280,
        "last_updated": null
    },
    {
        "urduURN": 4018210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 27,
        "bookName": "کتاب",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1820,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے منصور نے ، ان سے ابوحازم نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس نے اس گھر کا حج کیا اور نہ شہوت کی فحش باتیں کیں ، نہ گناہ کیا تو وہ اس دن کی طرح واپس ہو گا جس دن اس کی ماں نے اسے جنا تھا ۔</b>",
        "bookID": "27.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 117290,
        "last_updated": null
    }
]