[
    {
        "urduURN": 4018680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1868,
        "hadithSanad": "ہم سے ابومعمر نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، ان سے ابوالتیاح نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جب مدینہ ( ہجرت کر کے ) تشریف لائے تو آنحضرت صلی اللہ علیہ وسلم نے مسجد کی تعمیر کا حکم دیا ، آپ صلی اللہ علیہ وسلم نے فرمایا اے بنو نجار تم ( اپنی اس زمین کی ) مجھ سے قیمت لے لو لیکن انہوں نے عرض کی کہ ہم اس کی قیمت صرف اللہ تعالیٰ سے مانگتے ہیں ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے مشرکین کی قبروں کے متعلق فرمایا اور وہ اکھاڑی دی گئیں ، ویرانہ کے متعلق حکم دیا اور وہ برابر کر دیا گیا ، کھجور کے درختوں کے متعلق حکم دیا اور وہ کاٹ دیئے گئے اور وہ درخت قبلہ کی طرف بچھا دیئے گئے ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 117790,
        "last_updated": null
    },
    {
        "urduURN": 4018690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1869,
        "hadithSanad": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے میرے بھائی عبدالحمید نے بیان کیا ، ان سے سلیمان بن بلال نے ، ان سے عبیداللہ نے ، ان سے سعید مقبری نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا مدینہ کے دونوں پتھریلے کناروں میں جو زمین ہے وہ میری زبان پر حرم ٹھہرائی گئی ۔ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم بنو حارثہ کے پاس آئے اور فرمایا بنوحارثہ ! میرا خیال ہے کہ تم لوگ حرم سے باہر ہو گئے ہو ، پھر آپ صلی اللہ علیہ وسلم نے مڑ کر دیکھا اور فرمایا کہ نہیں بلکہ تم لوگ حرم کے اندر ہی ہو ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 117800,
        "last_updated": null
    },
    {
        "urduURN": 4018700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1870,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے عبدالرحمٰن بن مہدی نے بیان کیا ، ان سے سفیان ثوری نے ، ان سے اعمش نے ، ان سے ان کے والد یزید بن شریک نے اور ان سے علی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میرے پاس کتاب اللہ اور نبی کریم صلی اللہ علیہ وسلم کے اس صحیفہ کے سوا جو نبی کریم صلی اللہ علیہ وسلم کے حوالہ سے ہے اور کوئی چیز ( شرعی احکام سے متعلق ) لکھی ہوئی صورت میں نہیں ہے ۔ اس صحیفہ میں یہ بھی لکھا ہوا ہے کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا مدینہ عائر پہاڑی سے لے کر فلاں مقام تک حرم ہے ، جس نے اس حد میں کوئی بدعت نکالی یا کسی بدعتی کو پناہ دی تو اس پر اللہ اور تمام ملائکہ اور انسانوں کی لعنت ہے ، نہ اس کی کوئی فرض عبادت مقبول ہے نہ نفل اور آپ صلی اللہ علیہ وسلم نے فرمایا کہ تمام مسلمانوں میں سے کسی کا بھی عہد کافی ہے اس لیے اگر کسی مسلمان کی ( دی ہوئی امان میں دوسرے مسلمان نے ) بدعہدی کی تو اس پر اللہ تعالیٰ اور تمام ملائکہ اور انسانوں کی لعنت ہے ۔ نہ اس کی کوئی فرض عبادت مقبول ہے نہ نفل ، اور جو کوئی اپنے مالک کو چھوڑ کر اس کی اجازت کے بغیر کسی دوسرے کو مالک بنائے ، اس پر اللہ اور تمام ملائکہ اور انسانوں کی لعنت ہے ، نہ اس کی کوئی فرض عبادت مقبول ہے نہ نفل ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 117810,
        "last_updated": null
    },
    {
        "urduURN": 4018710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1871,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہمیں امام مالک رحمہ اللہ نے خبر دی ، انہیں یحییٰ بن سعید نے ، انہوں نے بیان کیا کہ میں نے ابوالحباب سعید بن یسار سے سنا ، انہوں نے کہا کہ",
        "hadithText": "میں نے ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ مجھے ایک ایسے شہر ( میں ہجرت ) کا حکم ہوا ہے جو دوسرے شہروں کو کھا لے گا ۔ ( یعنی سب کا سردار بنے گا ) منافقین اسے یثرب کہتے ہیں لیکن اس کا نام مدینہ ہے وہ ( برے ) لوگوں کو اس طرح باہر کر دیتا ہے جس طرح بھٹی لوہے کے زنگ کو نکال دیتی ہے ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 117820,
        "last_updated": null
    },
    {
        "urduURN": 4018720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1872,
        "hadithSanad": "ہم سے خالد بن مخلد نے بیان کیا ، کہا کہ ہم سے سلیمان بن بلال نے بیان کیا ، کہا کہ مجھ سے عمرو بن یحییٰ نے بیان کیا ، ان سے عباس بن سہل بن سعد نے اور ان سے ابو حمید ساعدی رضی اللہ عنہ نے یہ بیان کیا کہ",
        "hadithText": "ہم غزوہ تبوک سے نبی کریم صلی اللہ علیہ وسلم کے ساتھ واپس ہوتے ہوئے جب مدینہ کے قریب پہنچے تو آپ نے فرمایا کہ یہ طابہ آ گیا ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 117830,
        "last_updated": null
    },
    {
        "urduURN": 4018730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1873,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہمیں امام مالک نے خبر دی ، انہیں ابن شہاب زہری نے ، انہیں سعید بن مسیب نے کہ",
        "hadithText": "ابوہریرہ رضی اللہ عنہ فرمایا کرتے تھے اگر میں مدینہ میں ہرن چرتے ہوئے دیکھوں تو انہیں کبھی نہ چھیڑوں کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ مدینہ کی زمین دونوں پتھریلے میدانوں کے بیچ میں حرم ہے ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 117840,
        "last_updated": null
    },
    {
        "urduURN": 4018740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1874,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہمیں شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، کہا کہ مجھے سعید بن مسیب نے خبر دی ، ان سے ابوہریرہ رضی اللہ عنہ نے کہا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم لوگ مدینہ کو بہتر حالت میں چھوڑ جاؤ گے پھر وہ ایسا اجاڑ ہو جائے گا کہ پھر وہاں وحشی جانور ، درند اور پرند بسنے لگیں گے اور آخر میں مزینہ کے دو چرواہے مدینہ آئیں گے تاکہ اپنی بکریوں کو ہانک لے جائیں لیکن وہاں انہیں صرف وحشی جانور نظر آئیں گے آخر ثنیۃ الوداع تک جب پہنچیں گے تو اپنے منہ کے بل گر پڑیں گے ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 117850,
        "last_updated": null
    },
    {
        "urduURN": 4018750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1875,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہمیں امام مالک نے خبر دی ، انہیں ہشام بن عروہ نے ، انہیں ان کے والد عروہ بن زبیر نے خبر دی ، انہیں عبداللہ بن زبیر رضی اللہ عنہمانے اور ان سے سفیان بن ابی زہیر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا کہ آپ نے فرمایا کہ یمن فتح ہو گا تو لوگ اپنی سواریوں کو دوڑاتے ہوئے لائیں گے اور اپنے گھر والوں کو اور ان کو جو ان کی بات مان جائیں گے سوار کر کے مدینہ سے ( واپس یمن کو ) لے جائیں گے کاش ! انہیں معلوم ہوتا کہ مدینہ ہی ان کے لیے بہتر تھا اور عراق فتح ہو گا تو کچھ لوگ اپنی سواریوں کو تیز دوڑاتے ہوئے لائیں گے اور اپنے گھر والوں کو اور جو ان کی بات مانیں گے اپنے ساتھ ( عراق واپس ) لے جائیں گے کاش ! انہیں معلوم ہوتا کہ مدینہ ہی ان کے لیے بہتر تھا ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 117860,
        "last_updated": null
    },
    {
        "urduURN": 4018760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1876,
        "hadithSanad": "ہم سے ابراہیم بن المنذر نے بیان کیا ، انہوں نے کہا کہ ہم سے انس بن عیاض نے بیان کیا ، انہوں نے کہا کہ مجھ سے عبیداللہ عمری نے بیان کیا ، انہوں نے کہا کہ",
        "hadithText": "ہم سے خبیب بن عبدالرحمٰن نے ، ان سے حفص بن عاصم نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ( قیامت کے قریب ) ایمان مدینہ میں اس طرح سمٹ آئے گا جیسے سانپ سمٹ کر اپنے بل میں آ جایا کرتا ہے ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 117870,
        "last_updated": null
    },
    {
        "urduURN": 4018770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1877,
        "hadithSanad": "ہم سے حسین بن حرث نے بیان کیا ، کہا ہمیں فضل بن موسیٰ نے خبر دی ، انہیں جعید بن عبدالرحمٰن نے اور ان سے عائشہ رضی اللہ عنہا نے فرمایا کہ میں نے سعد بن ابی وقاص رضی اللہ عنہ سے سنا تھا کہ",
        "hadithText": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا تھا کہ اہل مدینہ کے ساتھ جو شخص بھی فریب کرے گا وہ اس طرح گھل جائے گا جیسے نمک میں پانی گھل جایا کرتا ہے ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 117880,
        "last_updated": null
    },
    {
        "urduURN": 4018780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1878,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ابن شہاب زہری نے ، کہا کہ مجھے عروہ نے خبر دی اور انہوں نے اسامہ بن زید رضی اللہ عنہما سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم مدینہ کے محلات میں سے ایک محل یعنی اونچے مکان پر چڑھے پھر فرمایا کہ جو کچھ میں دیکھ رہا ہوں کیا تمہیں نظر آ رہا ہے ؟ میں بوندوں کے گرنے کی جگہ کی طرح تمہارے گھروں پر فتنوں کے نازل ہونے کی جگہوں کو دیکھ رہا ہوں ۔ اس روایت کی متابعت معمر اور سلیمان بن کثیر نے زہری کے واسطہ سے کی ہے ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 117890,
        "last_updated": null
    },
    {
        "urduURN": 4018790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1879,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے ابراہیم بن سعد نے بیان کیا ، ان سے ان کے والد نے ، ان سے ان کے دادا نے اور ان سے ابوبکرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا مدینہ پر دجال کا رعب بھی نہیں پڑے گا اس دور میں مدینہ کے سات دورازے ہوں گے اور ہر دروازے پر دو فرشتے ہوں گے ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 117900,
        "last_updated": null
    },
    {
        "urduURN": 4018800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1880,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، انہوں نے کہا کہ مجھے سے امام مالک نے بیان کیا ، ان سے نعیم بن عبداللہ المجمر نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ مدینہ کے راستوں پر فرشتے ہیں نہ اس میں طاعون آ سکتا ہے نہ دجال ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 117910,
        "last_updated": null
    },
    {
        "urduURN": 4018810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1881,
        "hadithSanad": "ہم سے ابراہیم بن المنذر نے بیان کیا ، ان سے ولید نے بیان کیا ، ان سے ابوعمرو اوزاعی نے بیان کیا ، ان سے اسحٰق نے بیان کیا ، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا کوئی ایسا شہر نہیں ملے گا جسے دجال پامال نہ کرے گا ، سوائے مکہ اور مدینہ کے ، ان کے ہر راستے پر صف بستہ فرشتے کھڑے ہوں گے جو ان کی حفاظت کریں گے پھر مدینہ کی زمین تین مرتبہ کانپے گی جس سے ایک ایک کافر اور منافق کو اللہ تعالیٰ اس میں سے باہر کر دے گا ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 117920,
        "last_updated": null
    },
    {
        "urduURN": 4018820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1882,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، انہوں نے بیان کیا کہ مجھے عبیداللہ بن عتبہ نے خبر دی کہ ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم سے رسول اللہ صلی اللہ علیہ وسلم نے دجال کے متعلق ایک لمبی حدیث بیان کی ، آپ صلی اللہ علیہ وسلم نے اپنی حدیث میں یہ بھی فرمایا تھا کہ دجال مدینہ کی ایک کھاری شور زمین تک پہنچے گا اس پر مدینہ میں داخلہ تو حرام ہو گا ۔ ( مدینہ سے ) اس دن ایک شخص اس کی طرف نکل کر بڑھے گا ، یہ لوگوں میں ایک بہترین نیک مرد ہو گا یا ( یہ فرمایا کہ ) بزرگ ترین لوگوں میں سے ہو گا وہ شخص کہے گا کہ میں گواہی دیتا ہوں کہ تو وہی دجال ہے جس کے متعلق ہمیں رسول اللہ صلی اللہ علیہ وسلم نے اطلاع دی تھی دجال کہے گا کیا میں اسے قتل کر کے پھر زندہ کر ڈالوں تو تم لوگوں کو میرے معاملہ میں کوئی شبہ رہ جائے گا ؟ اس کے حواری کہیں گے نہیں ، چنانچہ دجال انہیں قتل کر کے پھر زندہ کر دے گا ۔ جب دجال انہیں زندہ کر دے گا تو وہ بندہ کہے گا بخدا اب تو مجھ کو پورا حال معلوم ہو گیا کہ تو ہی دجال ہے دجال کہے گا لاؤ اسے پھر قتل کر دوں لیکن اس مرتبہ وہ قابو نہ پا سکے گا ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 117930,
        "last_updated": null
    },
    {
        "urduURN": 4018830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1883,
        "hadithSanad": "ہم سے عمرو بن عباس نے بیان کیا ، کہا ہم سے عبدالرحمٰن نے بیان کیا ، ان سے سفیان نے بیان کیا ، ان سے محمد بن منکدر نے اور ان سے جابر رضی اللہ عنہ نے کہ",
        "hadithText": "ایک اعرابی نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر اسلام پر بیعت کی ، دوسرے دن آیا تو اسے بخار چڑھا ہوا تھا کہنے لگا کہ میری بیعت توڑ دیجئیے ! تین بار اس نے یہی کہا آپ صلی اللہ علیہ وسلم نے انکار کیا پھر فرمایا کہ مدینہ کی مثال بھٹی کی سی ہے کہ میل کچیل کو دور کر کے خالص جوہر کو نکھار دیتی ہے ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 117940,
        "last_updated": null
    },
    {
        "urduURN": 4018840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1884,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عدی بن ثابت نے ، ان سے عبداللہ بن یزید نے بیان کیا کہ میں نے زید بن ثابت رضی اللہ عنہ سے سنا ، آپ فرما رہے تھے کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ سلم جنگ احد کے لیے نکلے تو جو لوگ آپ صلی اللہ علیہ وسلم کے ساتھ تھے ان میں سے کچھ لوگ واپس آ گئے ( یہ منافقین تھے ) پھر بعض نے تو یہ کہا کہ ہم چل کر انہیں قتل کر دیں گے اور ایک جماعت نے کہا کہ قتل نہ کرنا چاہئے اس پر یہ آیت نازل ہوئی «فما لكم في المنافقين فئتين‏» اور نبی کریم صلی اللہ علیہ وسلم نے ارشاد فرمایا کہ مدینہ ( برے ) لوگوں کو اس طرح دور کر دیتا ہے جس طرح آگ میل کچیل دور کر دیتی ہے ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 117950,
        "last_updated": null
    },
    {
        "urduURN": 4018850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1885,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، انہوں نے کہا ہم سے وہب بن جریر نے بیان کیا ، ان سے ان کے والد نے بیان کیا ، انہوں نے یونس بن شہاب سے سنا اور انہوں نے انس رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کے اے اللہ ! جتنی مکہ میں برکت عطا فرمائی ہے مدینہ میں اس سے دگنی برکت کر ۔ جریر کے ساتھ اس روایت کی متابعت عثمان بن عمر نے یونس کے واسطہ کے ساتھ کی ہے ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 117960,
        "last_updated": null
    },
    {
        "urduURN": 4018860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1886,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے حمید نے اور ان سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جب کبھی سفر سے واپس آتے اور مدینہ کی دیواروں کو دیکھتے تو اپنی سواری تیز فرما دیتے اور اگر کسی جانور کی پشت پر ہوتے تو مدینہ کی محبت میں اسے ایڑ لگاتے ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 117970,
        "last_updated": null
    },
    {
        "urduURN": 4018870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1887,
        "hadithSanad": "ہم سے محمد بن سلام بیکندی نے بیان کیا ، کہا کہ ہمیں مروان بن معاویہ فزاری نے خبر دی ، انہیں حمید طویل نے خبر دی اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ بنو سلمہ نے چاہا کہ",
        "hadithText": "اپنے دور والے مکانات چھوڑ کر مسجد نبوی سے قریب اقامت اختیار کر لیں لیکن رسول اللہ صلی اللہ علیہ وسلم نے یہ پسند نہ کیا کہ مدینہ کے کسی حصہ سے بھی رہائش ترک کی جائے ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ اے بنو سلمہ ! تم اپنے قدموں کا ثواب نہیں چاہتے ، چنانچہ بنوسلمہ نے ( اپنی اصلی اقامت گاہ میں ) رہائش باقی رکھی ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 117980,
        "last_updated": null
    },
    {
        "urduURN": 4018880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1888,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، ان سے یحییٰ قطان نے بیان کیا ، ان سے عبیداللہ بن عمر نے بیان کیا کہ مجھ سے خبیب بن عبدالرحمٰن نے بیان کیا ، ان سے حفص بن عاصم نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میرے گھر اور میرے منبر کے درمیان ( والی جگہ ) جنت کے باغوں میں سے ایک باغ ہے اور میرا منبر قیامت کے دن میرے حوض ( کوثر ) پر ہو گا ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 117990,
        "last_updated": null
    },
    {
        "urduURN": 4018890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1889,
        "hadithSanad": "ہم سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "جب رسول کریم صلی اللہ علیہ وسلم مدینہ تشریف لائے تو ابوبکر اور بلال رضی اللہ عنہما بخار میں مبتلا ہو گئے ، ابوبکر رضی اللہ عنہ جب بخار میں مبتلا ہوئے تو یہ شعر پڑھتے :  ہر آدمی اپنے گھر والوں میں صبح کرتا ہے حالانکہ اس کی موت اس کی جوتی کے تسمہ سے بھی زیادہ قریب ہے ۔ اور بلال رضی اللہ عنہ کا جب بخار اترتا تو آپ بلند آواز سے یہ اشعار پڑھتے :  کاش ! میں ایک رات مکہ کی وادی میں گزار سکتا اور میرے چاروں طرف اذخر اور جلیل ( گھاس ) ہوتیں ۔  کاش ! ایک دن میں مجنہ کے پانی پر پہنچتا اور کاش ! میں شامہ اور طفیل ( پہاڑوں ) کو دیکھ سکتا ۔ کہا کہ اے میرے اللہ ! شیبہ بن ربیعہ ، عتبہ بن ربیعہ اور امیہ بن خلف مردودوں پر لعنت کر ۔ انہوں نے اپنے وطن سے اس وبا کی زمین میں نکالا ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے یہ سن کر فرمایا اے اللہ ! ہمارے دلوں میں مدینہ کی محبت اسی طرح پیدا کر دے جس طرح مکہ کی محبت ہے بلکہ اس سے بھی زیادہ ! اے اللہ ! ہمارے صاع اور ہمارے مد میں برکت عطا فرما اور مدینہ کی آب و ہوا ہمارے لیے صحت خیز کر دے یہاں کے بخار کو جحیفہ میں بھیج دے ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ جب ہم مدینہ آئے تو یہ خدا کی سب سے زیادہ وبا والی سر زمین تھی ۔ انہوں نے کہا مدینہ میں بطحان نامی ایک نالہ سے ذرا ذرا بدمزہ اور بدبودار پانی بہا کرتا تھا ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 118000,
        "last_updated": null
    },
    {
        "urduURN": 4018900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": "کتاب مدینہ کے فضائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1890,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، ان سے خالد بن یزید نے ، ان سے سعید بن ابی ہلال نے ، ان سے زید بن اسلم نے ، ان سے ان کے والد نے اور ان سے عمر رضی اللہ عنہ نے جو فرمایا کرتے تھے",
        "hadithText": "اے اللہ ! مجھے اپنے راستے میں شہادت عطا کر اور میری موت اپنے رسول صلی اللہ علیہ وسلم کے شہر میں مقدر کر دے ۔ ابن زریع نے روح بن قاسم سے ، انہوں نے زید بن اسلم سے ، انہوں نے اپنی والدہ سے ، انہوں نے حفصہ بنت عمر رضی اللہ عنہما سے بیان کیا کہ میں نے عمر رضی اللہ عنہ سے اسی طرح سنا تھا ، ہشام نے بیان کیا ، ان سے زید نے ، ان سے ان کے والد نے ، ان سے حفصہ رضی اللہ عنہا نے کہ میں نے عمر رضی اللہ عنہ سے سنا پھر یہی حدیث روایت کی ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 118011,
        "last_updated": null
    },
    {
        "urduURN": 4018675,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 28,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 1867,
        "hadithSanad": "ہم سے ابوالنعمان نے بیان کیا ، ان سے ثابت بن یزید نے بیان کیا ، ان سے ابوعبدالرحمٰن احول عاصم نے بیان کیا ، اور ان سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا مدینہ حرم ہے فلاں جگہ سے فلاں جگہ تک ( یعنی جبل عیر سے ثور تک ) اس حد میں کوئی درخت نہ کاٹا جائے نہ کوئی بدعت کی جائے اور جس نے بھی یہاں کوئی بدعت نکالی اس پر اللہ تعالیٰ اور تمام ملائکہ اور انسانوں کی لعنت ہے ۔</b>",
        "bookID": "29.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 117780,
        "last_updated": null
    }
]