[
    {
        "urduURN": 4020430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، ان سے شعیب نے بیان کیا ، ان سے زہری نے ، کہا کہ مجھے سعید بن مسیب اور ابوسلمہ بن عبدالرحمٰن نے خبر دی کہ ابوہریر رضی اللہ عنہ نے کہا ، تم لوگ کہتے ہو کہ",
        "hadithText": "ابوہریرہ ( رضی اللہ عنہ ) تو رسول اللہ صلی اللہ علیہ وسلم سے احادیث بہت زیادہ بیان کرتا ہے ، اور یہ بھی کہتے ہو کہ مہاجرین و انصار ابوہریرہ ( رضی اللہ عنہ ) کی طرح کیوں حدیث نہیں بیان کرتے ؟ اصل وجہ یہ ہے کہ میرے بھائی مہاجرین بازار کی خریدوفروخت میں مشغول رہا کرتے تھے ۔ اور میں اپنا پیٹ بھرنے کے بعد پھر برابر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر رہتا ، اس لیے جب یہ بھائی غیر حاضر ہوتے تو میں اس وقت بھی حاضر رہتا اور میں ( وہ باتیں آپ سے سن کر ) یاد کر لیتا جسے ان حضرات کو ( اپنے کاروبار کی مشغولیت کی وجہ سے یا تو سننے کا موقعہ نہیں ملتا تھا یا ) وہ بھول جایا کرتے تھے ۔ اسی طرح میرے بھائی انصار اپنے اموال ( کھیتوں اور باغوں ) میں مشغول رہتے ، لیکن میں صفہ میں مقیم مسکینوں میں سے ایک مسکین آدمی تھا ۔ جب یہ حضرات انصار بھولتے تو میں اسے یاد رکھتا ۔ ایک مرتبہ رسول کریم صلی اللہ علیہ وسلم نے ایک حدیث بیان کرتے ہوئے فرمایا تھا کہ جو کوئی اپنا کپڑا پھیلائے اور اس وقت تک پھیلائے رکھے جب تک اپنی یہ گفتگو نہ پوری کر لوں ، پھر ( جب میری گفتگو پوری ہو جائے تو ) اس کپڑے کو سمیٹ لے تو وہ میری باتوں کو ( اپنے دل و دماغ میں ہمیشہ ) یاد رکھے گا ، چنانچہ میں نے اپنا کمبل اپنے سامنے پھیلا دیا ، پھر جب رسول اللہ صلی اللہ علیہ وسلم نے اپنا مقالہ مبارک ختم فرمایا ، تو میں نے اسے سمیٹ کر اپنے سینے سے لگا لیا اور اس کے بعد پھر کبھی میں آپ کی کوئی حدیث نہیں بھولا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 119620,
        "last_updated": null
    },
    {
        "urduURN": 4020440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا ، ان سے ابراہیم بن سعد نے بیان کیا ، ان سے ان کے والد سعد نے بیان کیا ، ان سے ان کے دادا ( ابرہیم بن عبدالرحمٰن بن عوف رضی اللہ عنہ ) نے بیان کیا کہ عبدالرحمٰن بن عوف رضی اللہ عنہ نے کہا کہ",
        "hadithText": "جب ہم مدینہ آئے تو رسول اللہ صلی اللہ علیہ وسلم نے میرے اور سعد بن ربیع انصاری کے درمیان بھائی چارہ کرا دیا ۔ سعد بن ربیع رضی اللہ عنہ نے کہا کہ میں انصار کے سب سے زیادہ مالدار لوگوں میں سے ہوں ۔ اس لیے اپنا آدھا مال میں آپ کو دیتا ہوں اور آپ خود دیکھ لیں کہ میری دو بیویوں میں سے آپ کو کون زیادہ پسند ہے ۔ میں آپ کے لیے انہیں اپنے سے الگ کر دوں گا ( یعنی طلاق دے دوں گا ) جب ان کی عدت پوری ہو جائے تو آپ ان سے نکاح کر لیں ۔ بیان کیا کہ اس پر عبدالرحمٰن رضی اللہ عنہ نے فرمایا ، مجھے ان کی ضرورت نہیں ۔ کیا یہاں کوئی بازار ہے جہاں کاروبار ہوتا ہو ؟ سعد رضی اللہ عنہ نے ” سوق قینقاع “ کا نام لیا ۔ بیان کیا کہ جب صبح ہوئی تو عبدالرحمٰن رضی اللہ عنہ پنیر اور گھی لائے ۔ راوی نے بیان کیا کہ پھر وہ تجارت کے لیے بازار آنے جانے لگے ۔ کچھ دنوں کے بعد ایک دن وہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو زرد رنگ کا نشان ( کپڑے یا جسم پر ) تھا ۔ رسول اللہ نے دریافت فرمایا کیا تم نے شادی کر لی ہے ؟ انہوں نے کہا کہ ہاں ، آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کس سے ؟ بولے کہ ایک انصاری خاتون سے ۔ دریافت فرمایا اور مہر کتنا دیا ہے ؟ عرض کیا کہ ایک گٹھلی برابر سونا دیا ہے یا ( یہ کہا کہ ) سونے کی ایک گٹھلی دی ہے ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اچھا تو ولیمہ کر خواہ ایک بکری ہی کا ہو ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 119630,
        "last_updated": null
    },
    {
        "urduURN": 4020450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، ان سے زہیر نے بیان کیا ، ان سے حمید نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جب عبدالرحمٰن بن عوف رضی اللہ عنہ مدینہ آئے ، تو رسول اللہ صلی اللہ علیہ وسلم نے ان کا بھائی چارہ سعد بن ربیع انصاری رضی اللہ عنہ سے کرا دیا ۔ سعد رضی اللہ عنہ مالدار آدمی تھے ۔ انہوں نے عبدالرحمٰن رضی اللہ عنہ سے کہا میں اور آپ میرے مال سے آدھا آدھا لے لیں ۔ اور میں ( اپنی ایک بیوی سے ) آپ کی شادی کرا دوں ۔ عبدالرحمٰن رضی اللہ عنہ نے اس کے جواب میں کہا اللہ تعالیٰ آپ کے اہل اور آپ کے مال میں برکت عطا فرمائے ، مجھے تو آپ بازار کا راستہ بتا دیجئیے ، پھر وہ بازار سے اس وقت تک واپس نہ ہوئے جب تک نفع میں کافی پنیر اور گھی نہ بچا لیا ۔ اب وہ اپنے گھر والوں کے پاس آئے کچھ دن گزرے ہوں گے یا اللہ نے جتنا چاہا ۔ اس کے بعد وہ آئے کہ ان پر زردی کا نشان تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا یہ زردی کیسی ہے ؟ عرض کیا ، یا رسول اللہ ! میں نے ایک انصاری عورت سے شادی کر لی ہے ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ انہیں مہر میں کیا دیا ہے ؟ عرض کیا ” سونے کی ایک گٹھلی “ یا ( یہ کہا کہ ) ” ایک گٹھلی برابر سونا “ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اچھا اب ولیمہ کر ، اگرچہ ایک بکری ہی کا ہو ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 119640,
        "last_updated": null
    },
    {
        "urduURN": 4020460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے ، ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "عکاظ مجنہ ، اور ذوالمجاز عہد جاہلیت کے بازار تھے ۔ جب اسلام آیا تو ایسا ہوا کہ مسلمان لوگ ( خریدوفروخت کے لیے ان بازاروں میں جانا ) گناہ سمجھنے لگے ۔ اس لیے یہ آیت نازل ہوئی ” تمہارے لیے اس میں کوئی حرج نہیں اگر تم اپنے رب کے فضل ( یعنی رزق حلال ) کی تلاش کرو حج کے موسم میں “ یہ ابن عباس رضی اللہ عنہما کی قرآت ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 119650,
        "last_updated": null
    },
    {
        "urduURN": 4020470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا کہ ہم سے ابراہیم بن ابی عدی نے بیان کیا ، ان سے عبداللہ بن عون نے ، ان سے شعبی نے ، انہوں نے نعمان بن بشیر رضی اللہ عنہ سے سنا ، انہوں نے کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ( دوسری سند امام بخاری نے کہا ) اور ہم سے علی بن عبداللہ نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ابوفروہ نے ، ان سے شعبی نے ، کہا کہ میں نے نعمان بن بشیر رضی اللہ عنہ سے سنا ، اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے ( تیسری سند ) اور ہم سے عبداللہ بن محمد نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ابوفروہ نے ، انہوں نے شعبی سے سنا ، انہوں نے نعمان بن بشیر رضی اللہ عنہ سے سنا اور انہوں نبی کریم صلی اللہ علیہ وسلم سے ( چوتھی سند ) اور ہم سے محمد بن کثیر نے بیان کیا ، کہا کہ ہم کو سفیان ثوری نے خبر دی ، انہیں ابوفروہ نے ، انہیں شعبی نے اور ان سے سے نعمان بن بشیر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا حلال بھی کھلا ہوا ہے اور حرام بھی ظاہر ہے لیکن ان دونوں کے درمیان کچھ مشتبہ چیزیں ہیں ۔ پس جو شخص ان چیزوں کو چھوڑے جن کے گناہ ہونے یا نہ ہونے میں شبہ ہے وہ ان چیزوں کو تو ضروری ہی چھوڑ دے گا جن کا گناہ ہونا ظاہر ہے لیکن جو شخص شبہ کی چیزوں کے کرنے کی جرات کرے گا تو قریب ہے کہ وہ ان گناہوں میں مبتلا ہو جائے جو بالکل واضح طور پر گناہ ہیں ( لوگو یاد رکھو ) گناہ اللہ تعالیٰ کی چراگاہ ہے جو ( جانور بھی ) چراگاہ کے اردگرد چرے گا اس کا چراگاہ کے اندر چلا جانا غیر ممکن نہیں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 119660,
        "last_updated": null
    },
    {
        "urduURN": 4020480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ، کہا کہ ہم کو سفیان ثوری نے خبر دی ، انہیں عبداللہ بن عبدالرحمٰن بن ابی حسین نے خبر دی ، ان سے عبداللہ بن ابی ملیکہ نے بیان کیا ، ان سے عقبہ بن حارث رضی اللہ عنہ نے کہ",
        "hadithText": "ایک سیاہ فام خاتون آئیں اور دعویٰ کیا کہ انہوں نے ان دونوں ( عقبہ اور ان کی بیوی ) کو دودھ پلایا ہے ۔ عقبہ نے اس امر کا ذکر رسول اللہ صلی اللہ علیہ وسلم سے کیا تو آپ صلی اللہ علیہ وسلم نے اپنا چہرہ مبارک پھیر لیا اور مسکرا کر فرمایا ۔ اب جب کہ ایک بات کہہ دی گئی تو تم دونوں ایک ساتھ کس طرح رہ سکتے ہو ۔ ان کے نکاح میں ابواہاب تمیمی کی صاحب زادی تھیں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 119670,
        "last_updated": null
    },
    {
        "urduURN": 4020490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے یحییٰ بن قزعہ نے بیان کیا ، کہا کہ ہم سے امام مالک رحمہ اللہ نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عروہ بن زبیر رضی اللہ عنہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "عتبہ بن ابی وقاص ( کافر ) نے اپنے بھائی سعد بن ابی وقاص ( مسلمان ) کو ( مرتے وقت ) وصیت کی تھی کہ زمعہ کی باندی کا لڑکا میرا ہے ۔ اس لیے اسے تم اپنے قبضہ میں لے لینا ۔ انہوں نے کہا کہ فتح مکہ کے سال سعد رضی اللہ عنہ بن ابی وقاص نے اسے لے لیا ، اور کہا کہ یہ میرے بھائی کا لڑکا ہے اور وہ اس کے متعلق مجھے وصیت کر گئے ہیں ، لیکن عبد بن زمعہ نے اٹھ کر کہا کہ میرے باپ کی لونڈی کا بچہ ہے ، میرے باپ کے بستر پر پیدا ہوا ہے ۔ آخر دونوں یہ مقدمہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں لے گئے ۔ سعد رضی اللہ عنہ نے عرض کیا یا رسول اللہ ! یہ میرے بھائی کا لڑکا ہے اور مجھے اس کی انہوں نے وصیت کی تھی ۔ اور عبد بن زمعہ نے عرض کیا ، یہ میرا بھائی ہے اور میرے باپ کی لونڈی کا لڑکا ہے ۔ انہیں کے بستر پر اس کی پیدائش ہوئی ہے ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، عبد بن زمعہ ! لڑکا تو تمہارے ہی ساتھ رہے گا ۔ اس کے بعد فرمایا ، بچہ اسی کا ہوتا ہے جو جائز شوہر یا مالک ہو جس کے بستر پر وہ پیدا ہوا ہو ۔ اور حرام کار کے حصہ میں پتھر وں کی سزا ہے ۔ پھر سودہ بنت زمعہ رضی اللہ عنہا سے جو آنحضرت صلی اللہ علیہ وسلم کی بیوی تھیں ، فرمایا کہ اس لڑکے سے پردہ کیا کر ، کیونکہ آپ صلی اللہ علیہ وسلم نے عتبہ کی شباہت اس لڑکے میں محسوس کر لی تھی ۔ اس کے بعد اس لڑکے نے سودہ رضی اللہ عنہ کو کبھی نہ دیکھا یہاں تک کہ وہ اللہ تعالیٰ سے جا ملا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 119680,
        "last_updated": null
    },
    {
        "urduURN": 4020500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ مجھے عبداللہ بن ابی سفر نے خبر دی ، انہیں شعبی نے ، ان سے عدی بن حاتم رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے «معراض» ( تیر کے شکار ) کے متعلق پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر اس کے دھار کی طرف سے لگے تو کھا ۔ اگر چوڑائی سے لگے تو مت کھا ۔ کیونکہ وہ مردار ہے ، میں نے عرض کیا یا رسول اللہ ! میں اپنا کتا ( شکار کے لیے ) چھوڑتا ہوں اور بسم اللہ پڑھ لیتا ہوں ، پھر اس کے ساتھ مجھے ایک ایسا کتا اور ملتا ہے جس پر میں نے بسم اللہ نہیں پڑھی ہے ۔ میں یہ فیصلہ نہیں کر پاتاکہ دونوں میں کون سے کتے نے شکار پکڑا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، ایسے شکار کا گوشت نہ کھا ۔ کیونکہ تو نے بسم اللہ تو اپنے کتے کے لیے پڑھی ہے ۔ دوسرے کے لیے تو نہیں پڑھی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 119690,
        "last_updated": null
    },
    {
        "urduURN": 4020510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے قبیصہ بن عقبہ نے بیان کیا ، کہا کہ ہم سے سفیان ثوری نے بیان کیا ، ان سے منصور نے ، ان سے طلحہ بن مصرف نے ، ان سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ایک گری ہوئی کھجور پر گزرے ، تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر اس کے صدقہ ہونے کا شبہ نہ ہوتا تو میں اسے کھا لیتا ۔ اور ہمام بن منبہ نے ابوہریرہ رضی اللہ عنہ سے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، میں اپنے بستر پر پڑی ہوئی ایک کھجور پاتا ہوں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 119700,
        "last_updated": null
    },
    {
        "urduURN": 4020520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے زہری نے ، ان سے عباد بن تمیم نے اور ان سے ان کے چچا عبداللہ بن زید مازنی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے سامنے ایک ایسے شخص کا ذکر آیا جسے نماز میں کچھ شبہ ہوا نکلنے کا ہو جاتا ہے ۔ آیا اسے نماز توڑ دینی چاہئے ؟ فرمایا کہ نہیں ۔ جب تک وہ آواز نہ سن لے یا بدبو نہ محسوس کر لے ( اس وقت تک نماز نہ توڑے ) ابن ابی حفصہ نے زہری سے بیان کیا ( ایسے شخص پر ) وضو واجب نہیں جب تک حدث کی بدبو نہ محسوس کرے یا آواز نہ سن لے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 119710,
        "last_updated": null
    },
    {
        "urduURN": 4020530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے احمد بن مقدام عجلی نے بیان کیا ، انہوں نے کہا کہ ہم سے محمد بن عبدالرحمٰن طفاوی نے بیان کیا ، انہوں نے کہا کہ ہم سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے والد ( عروہ بن زبیر ) نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "کچھ لوگوں نے عرض کیا یا رسول اللہ ! بہت سے لوگ ہمارے یہاں گوشت لاتے ہیں ۔ ہمیں یہ معلوم نہیں کہ اللہ کا نام انہوں نے ذبح کے وقت لیا تھا یا نہیں ؟ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تم بسم اللہ پڑھ کے اسے کھا لیا کرو ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 119720,
        "last_updated": null
    },
    {
        "urduURN": 4020540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے طلق بن غنام نے بیان کیا ، کہا کہ ہم سے زائدہ بن قدامہ نے بیان کیا ، ان سے حصین نے ، ان سے سالم بن ابی الجعد نے کہ مجھ سے جابر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جمعہ کی نماز پڑھ رہے تھے ۔ ( یعنی خطبہ سن رہے تھے ) کہ ملک شام سے کچھ اونٹ کھانے کا سامان تجارت لے کر آئے ۔ ( سب نمازی ) لوگ ان کی طرف متوجہ ہو گئے اور رسول اللہ صلی اللہ علیہ وسلم کے ساتھ بارہ آدمیوں کے سوا اور کوئی باقی نہ رہا ۔ اس پر یہ آیت نازل ہوئی «وإذا رأوا تجارة أو لهوا انفضوا إليها‏» ” جب وہ مال تجارت یا کوئی تماشا دیکھتے ہیں تو اس کی طرف دوڑ پڑتے ہیں ۔ “</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 119730,
        "last_updated": null
    },
    {
        "urduURN": 4020550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے ابن ابی ذئب نے بیان کیا ، کہا کہ ہم سے سعید مقبری نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا لوگوں پر ایک ایسا زمانہ آئے گا کہ انسان کوئی پرواہ نہیں کرے گا کہ جو اس نے حاصل کیا ہے وہ حلال سے ہے یا حرام سے ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 119740,
        "last_updated": null
    },
    {
        "urduURN": 4020560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابوعاصم نے بیان کیا ، انہوں نے کہا کہ ہم سے ابن جریج نے بیان کیا ، کہ مجھے عمرو بن دینار نے خبر دی اور ان سے ابوالمنہال نے بیان کیا کہ",
        "hadithText": "میں سونے چاندی کی تجارت کیا کرتا تھا ۔ اس لیے میں نے زید بن ارقم رضی اللہ عنہ سے اس کے متعلق پوچھا تو انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ اور مجھ سے فضل بن یعقوب نے بیان کیا ، کہا کہ ہم سے حجاج بن محمد نے بیان کیا کہ ابن جریج نے بیان کیا کہ مجھے عمرو بن دینار اور عامر بن مصعب نے خبر دی ، ان دونوں حضرات نے ابوالمنہال سے سنا ۔ انہوں نے بیان کیا کہ میں نے براء بن عازب اور زید بن ارقم رضی اللہ عنہما سے سونے چاندی کی تجارت کے متعلق پوچھا ، تو ان دونوں بزرگوں نے فرمایا کہ ہم نبی کریم صلی اللہ علیہ وسلم کے عہد میں تاجر تھے ، اس لیے ہم نے آپ صلی اللہ علیہ وسلم سے سونے چاندی کے متعلق پوچھا تھا ۔ آپ صلی اللہ علیہ وسلم نے جواب یہ دیا تھا کہ ( لین دین ) ہاتھوں ہاتھ ہو تو کوئی حرج نہیں لیکن ادھار کی صورت میں جائز نہیں ہے ۔ \n\nاور ( سورۃ الجمعہ میں ) اللہ تعالیٰ کا فرمان کہ ” جب نماز ہو جائے تو زمین میں پھیل جاؤ اور اللہ کا فضل تلاش کرو “</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 119751,
        "last_updated": null
    },
    {
        "urduURN": 4020580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا کہ ہم کو مخلد بن یزید نے خبر دی ، کہا کہ ہمیں ابن جریج نے خبر دی ، کہا کہ مجھے عطابن ابی رباح نے خبر دی ، انہیں عبید بن عمیر نے کہ",
        "hadithText": "ابوموسیٰ اشعری رضی اللہ عنہ نے عمر بن خطاب رضی اللہ عنہ سے ملنے کی اجازت چاہی لیکن اجازت نہیں ملی ۔ غالباً آپ اس وقت کام میں مشغول تھے ۔ اس لیے ابوموسیٰ رضی اللہ عنہ واپس لوٹ گئے ۔ پھر عمر رضی اللہ عنہ فارغ ہوئے تو فرمایا کیا میں نے عبداللہ بن قیس ( ابوموسیٰ رضی اللہ عنہ ) کی آوازنہیں سنی تھی ۔ انہیں اندر آنے کی اجازت دے دو ۔ کہا گیا وہ لوٹ کر چلے گئے ۔ تو عمر رضی اللہ عنہ نے انہیں بلا لیا ۔ ابوموسیٰ رضی اللہ عنہ نے کہا کہ ہمیں اسی کا حکم ( آنحضرت صلی اللہ علیہ وسلم سے ) تھا ( کہ تین مرتبہ اجازت چاہنے پر اگر اندر جانے کی اجازت نہ ملے تو واپس لوٹ جانا چاہئے ) اس پر عمر رضی اللہ عنہ نے فرمایا ، اس حدیث پر کوئی گواہ لاؤ ۔ ابوموسیٰ رضی اللہ عنہ انصار کی مجلس میں گئے اور ان سے اس حدیث کے متعلق پوچھا ( کہ کیا کسی نے اسے آنحضرت صلی اللہ علیہ وسلم سے سنا ہے ) ان لوگوں نے کہا کہ اس کی گواہی تو تمہارے ساتھ وہ دے گا جو ہم سب میں بہت ہی کم عمر ہے ۔ وہ ابو سعید خدری رضی اللہ عنہ کو اپنے ساتھ لے گئے ۔ عمر رضی اللہ عنہ نے یہ سن کر فرمایا کہ نبی کریم صلی اللہ علیہ وسلم کا ایک حکم مجھ سے پوشیدہ رہ گیا ۔ افسوس کہ مجھے بازاروں کی خریدوفروخت نے مشغول رکھا ۔ آپ کی مردا تجارت سے تھی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 119770,
        "last_updated": null
    },
    {
        "urduURN": 4020590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "لیث نے کہا کہ مجھ سے جعفر بن ربیعہ نے بیان کیا ، ان سے عبدالرحمٰن بن ہرمز نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے بنی اسرائیل کے ایک شخص کا ذکر کیا ۔ جس نے سمندر کا سفر کیا تھا اور اپنی ضرورت پوری کی تھی ۔ پھر پوری حدیث بیان کی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 119780,
        "last_updated": null
    },
    {
        "urduURN": 4020600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا کہ مجھ سے محمد بن فضیل نے بیان کیا ، ان سے حصین نے بیان کیا ، ان سے سالم بن ابی الجعد نے بیان کیا اور ان سے جابر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "( تجارتی ) اونٹوں ( کا قافلہ ) آیا ۔ ہم اس وقت نبی کریم صلی اللہ علیہ وسلم کے ساتھ جمعہ ( کے خطبہ ) میں شریک تھے ۔ بارہ صحابہ کے سوا باقی تمام حضرات ادھر چلے گئے اس پر یہ آیت اتری «وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما» ” جب سوداگری یا تماشا دیکھتے ہیں تو اس کی طرف دوڑ پڑتے ہیں اور آپ کو کھڑا چھوڑ دیتے ہیں ۔ “</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 119790,
        "last_updated": null
    },
    {
        "urduURN": 4020610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، انہوں نے کہا کہ ہم سے جریر نے بیان کیا ، ان سے منصور نے ، ان سے ابووائل نے ، ان سے مسروق نے ، اور ان سے ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جب عورت اپنے گھر کا کھانا ( غلہ وغیرہ ) بشرطیکہ گھر بگاڑنے کی نیت نہ ہو خرچ کرے تو اسے خرچ کرنے کا ثواب ملتا ہے اور اس کے شوہر کو کمانے کا اور خزانچی کو بھی ایسا ہی ثواب ملتا ہے ایک کا ثواب دوسرے کے ثواب کو کم نہیں کرتا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 119800,
        "last_updated": null
    },
    {
        "urduURN": 4020620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "مجھ سے یحییٰ بن جعفر نے بیان کیا ، انہوں نے کہا کہ ہم سے عبدالرزاق نے بیان کیا ، ان سے معمر نے بیان کیا ، ان سے ہمام نے بیان کیا ، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، اگر عورت اپنے شوہر کی کمائی اس کی اجازت کے بغیر بھی ( اللہ کے راستے میں ) خرچ کرتی ہے تو اسے آدھا ثواب ملتا ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 119810,
        "last_updated": null
    },
    {
        "urduURN": 4020630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن یعقوب کرمانی نے بیان کیا ، کہا کہ ہم سے حسان بن ابراہیم نے بیان کیا ، ان سے یونس نے بیان کیا ، ان سے محمد بن مسلم نے بیان کیا ، ان سے انس بن مالک رضی اللہ عنہ نے کیا کہ",
        "hadithText": "میں نے سنا رسول اللہ صلی اللہ علیہ وسلم فرما رہے تھے کہ جو شخص اپنی روزی میں کشادگی چاہتا ہو یا عمر کی دارازی چاہتا ہو تو اسے چاہئیے کہ صلہ رحمی کرے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 119820,
        "last_updated": null
    },
    {
        "urduURN": 4020640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے معلی بن اسد نے بیان کیا ، انہوں نے کہا کہ ہم سے عبدالواحد نے بیان کیا ، کہا کہ ہم سے اعمش نے بیان کیا کہ",
        "hadithText": "ابراہیم نخعی کی مجلس میں ہم نے ادھار لین دین میں ( سامان ) گروی رکھنے کا ذکر کیا تو انہوں نے کہا کہ مجھ سے اسود نے عائشہ رضی اللہ عنہا سے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ایک یہودی سے کچھ غلہ ایک مدت مقرر کر کے ادھا خریدا اور اپنی لوہے کی ایک زرہ اس کے پاس گروی رکھی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 119830,
        "last_updated": null
    },
    {
        "urduURN": 4020650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا کہ ہم سے ہشام نے بیان کیا ، ان سے قتادہ نے بیان کیا ، ان سے انس رضی اللہ عنہ نے ( دوسری سند ) اور مجھ سے محمد بن عبداللہ بن حوشب نے بیان کیا ، کہا کہ ہم سے اسباط ابوالیسع بصریٰ نے ، کہا کہ ہم سے ہشام دستوائی نے ، انہوں نے قتادہ سے ، انہوں نے انس رضی اللہ عنہ سے کہ",
        "hadithText": "وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں جَو کی روٹی اور بدبودار چربی ( سالن کے طور پر ) لے گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس وقت اپنی زرہ مدینہ میں ایک یہودی کے یہاں گروی رکھی تھی اور اس سے اپنے گھر والوں کے لیے قرض لیا تھا ۔ میں نے خود آپ کو یہ فرماتے سنا کہ محمد صلی اللہ علیہ وسلم کے گھرانے میں کوئی شام ایسی نہیں آئی جس میں ان کے پاس ایک صاع گیہوں یا ایک صاع کوئی غلہ موجود رہا ہو ، حالانکہ آپ صلی اللہ علیہ وسلم کی گھر والیوں کی تعداد نو تھی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 119840,
        "last_updated": null
    },
    {
        "urduURN": 4020660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، انہوں نے کہا کہ مجھ سے عبداللہ بن وہب نے بیان کیا ، ان سے عروہ بن زبیر رضی اللہ عنہ نے کہا کہ حضرت عائشہ رضی اللہ عنہا نے کہا کہ",
        "hadithText": "جب حضرت ابوبکر رضی اللہ عنہ خلفیہ ہوئے تو فرمایا ، میری قوم جانتی ہے کہ میرا ( تجارتی ) کاروبار میرے گھر والوں کی گذران کے لیے کافی رہا ہے ، لیکن اب میں مسلمانوں کے کام میں مشغول ہو گیا ہوں ، اس لیے آل ابوبکر اب بیت المال میں سے کھائے گی ، اور ابوبکر مسلمانوں کا مال تجارت بڑھاتا رہے گا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 119850,
        "last_updated": null
    },
    {
        "urduURN": 4020670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "مجھ سے محمد نے بیان کیا ، کہا کہ ہم سے عبداللہ بن یزید نے بیان کیا ، ان سے سعید بن ابی ایوب نے بیان کیا ، کہا کہ مجھ سے ابوالاسود نے بیان کیا ، ان سے عروہ نے کہ حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے صحابہ رضی اللہ عنہم اپنے کام اپنے ہی ہاتھوں سے کیا کرتے تھے اور ( زیادہ محنت و مشقت کی وجہ سے ) ان کے جسم سے ( پسینے کی ) بو آ جاتی تھی ۔ اس لیے ان سے کہا گیا کہ اگر تم غسل کر لیا کرو تو بہتر ہو گا ۔ اس کی روایت ہمام نے اپنے والد سے اور انہوں نے اپنے باپ سے اور انہوں نے عائشہ رضی اللہ عنہا سے کی ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 119860,
        "last_updated": null
    },
    {
        "urduURN": 4020680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، انہوں نے کہا کہ ہم کو عیسیٰ بن یونس نے خبر دی ، انہیں ثور نے خبر دی ، انہیں خالد بن معدان نے اور انہیں مقدام رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کسی انسان نے اس شخص سے بہتر روزی نہیں کھائی ، جو خود اپنے ہاتھوں سے کما کر کھاتا ہے اللہ کے نبی داؤد علیہ السلام بھی اپنے ہاتھ سے کام کر کے روزی کھایا کرتے تھے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 119870,
        "last_updated": null
    },
    {
        "urduURN": 4020690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے یحییٰ بن موسیٰ نے بیان کیا ، کہا کہ ہم سے عبدالرزاق نے بیان کیا ، کہا کہ ہمیں معمر نے خبر دی ، انہیں ہمام بن منبہ نے ، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا ، اور ان سے نبی کریم صلی اللہ علیہ وسلم نے کہ",
        "hadithText": "داؤد علیہ السلام صرف اپنے ہاتھ کی کمائی سے کھایا کرتے تھے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 119880,
        "last_updated": null
    },
    {
        "urduURN": 4020700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے عبدالرحمٰن بن عوف رضی اللہ عنہ کے غلام ابی عبید نے ، انہوں نے ابوہریرہ رضی اللہ عنہ کو یہ کہتے سنا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا وہ شخص جو لکڑی کا گھٹا اپنی پیٹھ پر لاد کر لائے ، اس سے بہتر ہے جو کسی کے سامنے ہاتھ پھیلائے چاہئیے وہ اسے کچھ دیدے یا نہ دے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 119890,
        "last_updated": null
    },
    {
        "urduURN": 4020710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے یحییٰ بن موسیٰ نے بیان کیا ، کہا کہ ہم سے وکیع نے بیان کیا ، کہا کہ ہم سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے والد نے اور ان سے زبیر بن عوام رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر کوئی اپنی رسیوں کو سنبھال لے اور ان میں لکڑی باندھ کر لائے تو وہ اس سے بہتر ہے جو لوگوں سے مانگتا ہے پھرتا ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 119900,
        "last_updated": null
    },
    {
        "urduURN": 4020720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے علی بن عیاش نے بیان کیا ، کہا کہ ہم سے ابوغسان محمد بن مطرف نے بیان کیا ، کہا کہ مجھ سے محمد بن منکدر نے بیان کیا ، اور ان سے جابر بن عبداللہ انصاری رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ ایسے شخص پر رحم کرے جو بیچتے وقت اور خریدتے وقت اور تقاضا کرتے وقت فیاضی اور نرمی سے کام لیتا ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 119910,
        "last_updated": null
    },
    {
        "urduURN": 4020730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، کہا کہ ہم سے زہیر نے بیان کیا کہا کہ ہم سے منصور نے ، ان سے ربعی بن حراش نے بیان کیا اور ان سے حذیفہ بن یمان رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، تم سے پہلے گذشتہ امتوں کے کسی شخص کی روح کے پاس ( موت کے وقت ) فرشتے آئے اور پوچھا کہ تو نے کچھ اچھے کام بھی کئے ہیں ؟ روح نے جواب دیا کہ میں اپنے نوکروں سے کہا کرتا تھا کہ وہ مالدار لوگوں کو ( جو ان کے مقروض ہوں ) مہت دے دیا کریں اور ان پر سختی نہ کریں ۔ اور محتاجوں کو معاف کر دیا کریں ۔ روای نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، پھر فرشتوں نے بھی اس سے درگزر کیا اور سختی نہیں کی اور ابومالک نے ربعی سے ( اپنی روایت میں یہ الفاظ ) بیان کئے ہیں ” کھاتے کماتے کے ساتھ ( اپنا حق لیتے وقت ) نرم معاملہ کرتا تھا اور تنگ حال مقروض کو مہلت دیتا تھا ۔ اس کی متابعت شعبہ نے کی ہے ۔ ان سے عبدالملک نے اور ان سے ربعی نے بیان کیا ، ابوعوانہ نے کہا کہ ان سے عبدالملک نے ربعی سے بیان کیا کہ ( اس روح نے یہ الفاظ کہے تھے ) میں کھاتے کماتے کو مہلت دے دیتا تھا اور تنگ حال والے مقروض سے درگزر کرتا تھا اور نعیم بن ابی ہند نے بیان کیا ، ان سے ربعی نے ( کہ روح نے یہ الفاظ کہے تھے ) میں کھاتے کماتے لوگوں کے ( جن پر میرا کوئی حق واجب ہوتا ) عذر قبول کر لیا کرتا تھا اور تنگ حال والے سے درگزر کر دیتا تھا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 119920,
        "last_updated": null
    },
    {
        "urduURN": 4020740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ہشام بن عمار نے بیان کیا ، کہا کہ ہم سے یحییٰ بن حمزہ نے بیان کیا ، ان سے محمد بن ولید زبیدی نے بیان کیا ، ان سے زہری نے ، ان سے عبیداللہ بن عبداللہ نے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، ایک تاجر لوگوں کو قرض دیا کرتا تھا جب کسی تنگ دست کو دیکھتا تو اپنے نوکروں سے کہہ دیتا کہ اس سے درگزر کر جاؤ ۔ شاید کہ اللہ تعالیٰ بھی ہم سے ( آخرت میں ) درگزر فرمائے ۔ چنانچہ اللہ تعالیٰ نے ( اس کے مرنے کے بعد ) اس کو بخش دیا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 119930,
        "last_updated": null
    },
    {
        "urduURN": 4020750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے ان سے صالح ابوخلیل نے ، ان سے عبیداللہ بن حارث نے ، انہوں نے حکیم بن حزام رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، خریدنے اور بیچنے والوں کو اس وقت تک اختیار ( بیع ختم کر دینے کا ) ہے جب تک دونوں جدا نہ ہوں یا آپ صلی اللہ علیہ وسلم نے ( «ما لم يتفرقا» کے بجائے ) «حتى يتفرقا» فرمایا ۔ ( آنحضرت صلی اللہ علیہ وسلم نے مزید ارشاد فرمایا ) پس اگر دونوں نے سچائی سے کام لیا اور ہر بات صاف صاف کھول دی تو ان کی خریدوفروخت میں برکت ہوتی ہے لیکن اگر کوئی بات چھپا رکھی یا جھوٹ کہی تو ان کی برکت ختم کر دی جاتی ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 119940,
        "last_updated": null
    },
    {
        "urduURN": 4020760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا کہ ہم سے شیبان نے بیان کیا ، ان سے یحییٰ نے ، ان سے ابوسلمہ نے ، ان سے ابوسعید رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہمیں ( نبی کریم صلی اللہ علیہ وسلم کی طرف سے ) مختلف قسم کی کھجوریں ایک ساتھ ملا کرتی تھیں اور ہم دو صاع کھجور ایک صاع کے بدلے میں بیچ دیا کرتے تھے ۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ دو صاع ایک صاع کے بدلہ میں نہ بیچی جائے اور نہ دو درہم ایک درہم کے بدلے بیچے جائیں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 119950,
        "last_updated": null
    },
    {
        "urduURN": 4020770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا کہ مجھ سے میرے باپ نے بیان کیا ، کہ ہم سے اعمش نے بیان کیا ، کہا کہ مجھ سے شقیق نے بیان کیا ، اور ان سے ابومسعود رضی اللہ عنہ نے کہ",
        "hadithText": "انصار میں سے ایک صحابی جن کی کنیت ابوشعیب رضی اللہ عنہ تھی ، تشریف لائے اور اپنے غلام سے جو قصاب تھا ۔ فرمایا کہ میرے لیے اتنا کھانا تیار کر جو پانچ آدمی کے لیے کافی ہو ۔ میں نے نبی کریم صلی اللہ علیہ وسلم کی اور آپ کے ساتھ اور چار آدمیوں کی دعوت کا ارادہ کیا ، کیونکہ میں نے آپ صلی اللہ علیہ وسلم کے چہرہ مبارک پر بھوک کا اثر نمایاں دیکھا ہے ۔ چنانچہ انہوں نے آنحضرت صلی اللہ علیہ وسلم کو بلایا ۔ آپ صلی اللہ علیہ وسلم کے ساتھ ایک اور صاحب بھی آ گئے ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہمارے ساتھ ایک اور صاحب زائد آ گئے ہیں ۔ مگر آپ چاہیں تو انہیں بھی اجازت دے سکتے ہیں ، اور اگر چاہیں تو واپس کر سکتے ہیں ۔ انہوں نے کہا کہ نہیں ، بلکہ میں انہیں بھی اجازت دیتا ہوں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 119960,
        "last_updated": null
    },
    {
        "urduURN": 4020780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے بدل بن محبر نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ ہم سے قتادہ نے ، کہا کہ میں نے ابوخلیل سے سنا ، وہ عبداللہ بن حارث سے نقل کرتے تھے اور وہ حکیم بن حزام رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، خریدوفروخت کرنے والوں کو اختیار ہے جب تک وہ ایک دوسرے سے جدا نہ ہوں ( کہ بیع فسخ کر دیں یا رکھیں ) یا آپ نے ( «ما لم يتفرقا» کے بجائے ) «حتى يتفرقا» فرمایا ۔ پس اگر دونوں نے سچائی اختیار کی اور ہر بات کھول کھول کر بیان کی تو ان کی خریدوفروخت میں برکت ہو گی اور اگر انہوں نے کچھ چھپائے رکھا یا جھوٹ بولا تو ان کے خریدوفروخت کی برکت ختم کر دی جائے گی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 119970,
        "last_updated": null
    },
    {
        "urduURN": 4020790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا کہا کہ ہم سے ابن ابی ذئب نے بیان کیا ، ان سے سعید مقبری نے بیان کیا ، اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، ایک زمانہ ایسا آئے گا کہ انسان اس کی پرواہ نہیں کرے گا کہ مال اس نے کہاں سے لیا ، حلال طریقہ سے یا حرام طریقہ سے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 119980,
        "last_updated": null
    },
    {
        "urduURN": 4020800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے غندر نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے منصور نے ، ان سے ابوالضحیٰ نے ، ان سے مسروق نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "جب ( سورۃ ) بقرہ کی آخری آیتیں «الذين يأكلون الربا *** الخ» نازل ہوئیں تو نبی کریم صلی اللہ علیہ وسلم نے انہیں صحابہ رضی اللہ عنہم کو مسجد میں پڑھ کر سنایا ۔ اس کے بعد ان پر شراب کی تجارت حرام کر دیا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 119990,
        "last_updated": null
    },
    {
        "urduURN": 4020810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے جریر بن حازم نے ، کہا کہ ہم سے ابورجاء بصریٰ نے بیان کیا ، ان سے سمرہ بن جندب رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، رات ( خواب میں ) میں نے دو آدمی دیکھے ، وہ دونوں میرے پاس آئے اور مجھے بیت المقدس میں لے گئے ، پھر ہم سب وہاں سے چلے یہاں تک کہ ہم ایک خون کی نہر پر آئے ، وہاں ( نہر کے کنارے ) ایک شخص کھڑا ہوا تھا ، اورنہر کے بیچ میں بھی ایک شخص کھڑا تھا ۔ ( نہر کے کنارے پر ) کھڑے ہونے والے کے سامنے پتھر پڑے ہوئے تھے ۔ بیچ نہر والا آدمی آتا اور جونہی وہ چاہتا کہ باہر نکل جائے فوراً ہی باہر والا شخص اس کے منہ پر پتھر کھینچ کر مارتا جو اسے وہیں لوٹا دیتا تھا جہاں وہ پہلے تھا ۔ اسی طرح جب بھی وہ نکلنا چاہتا کنارے پر کھڑا ہوا شخص اس کے منہ پر پتھر کھینچ مارتا اور وہ جہاں تھا وہیں پھر لوٹ جاتا ۔ میں نے ( اپنے ساتھیوں سے جو فرشتے تھے ) پوچھا کہ یہ کیا ہے ، تو انہوں نے اس کا جواب یہ دیا کہ نہر میں تم نے جس شخص کو دیکھا وہ سود کھانے والا انسان ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 120000,
        "last_updated": null
    },
    {
        "urduURN": 4020820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے عون بن ابی جحیفہ نے بیان کیا کہ",
        "hadithText": "میں نے اپنے والد کو ایک پچھنا لگانے والا غلام خریدتے دیکھا ۔ میں نے یہ دیکھ کر ان سے اس کے متعلق پوچھا تو انہوں نے جواب دیا کہ نبی کریم صلی اللہ علیہ وسلم نے کتے کی قیمت لینے اور خون کی قیمت لینے سے منع فرمایا ہے ، آپ نے گودنے والی اور گدوانے والی کو ( گودنا لگوانے سے ) سود لینے والے اور سود دینے والے کو ( سود لینے یا دینے سے ) منع فرمایا اور تصویر بنانے والے پر لعنت بھیجی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 120010,
        "last_updated": null
    },
    {
        "urduURN": 4020830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، ان سے یونس نے ، ان سے ابن شہاب نے کہ سعید بن مسیب نے بیان کیا کہ ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے خود نبی کریم صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا کہ ( سامان بیچتے وقت دکاندار کے ) قسم کھانے سے سامان تو جلدی بک جاتا ہے لیکن وہ قسم برکت کو مٹا دینے والی ہوتی ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 120020,
        "last_updated": null
    },
    {
        "urduURN": 4020840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عمرو بن محمد نے بیان کیا ، کہا کہ ہم سے ہشیم نے بیان کیا ، کہا کہ ہم کو عوام بن حوشب نے خبر دی ، انہیں ابراہیم بن عبدالرحمٰن نے اور انہیں عبداللہ بن ابی اوفی رضی اللہ عنہ نے کہ",
        "hadithText": "بازار میں ایک شخص نے ایک سامان دکھا کر قسم کھائی کہ اس کی اتنی قیمت لگ چکی ہے ۔ حالانکہ اس کی اتنی قیمت نہیں لگی تھی اس قسم سے اس کا مقصد ایک مسلمان کو دھوکہ دینا تھا ۔ اس پر یہ آیت اتری «إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا» ” جو لوگ اللہ کے عہد اور اپنی قسموں کو تھوڑی قیمت کے بدلہ میں بیچتے ہیں ۔ “</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 120030,
        "last_updated": null
    },
    {
        "urduURN": 4020850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، انہوں نے کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی ، انہوں نے کہا کہ ہمیں یونس نے خبر دی ، انہوں نے کہا کہ ہم سے ابن شہاب نے ، انہوں نے کہا کہ ہمیں زین العابدین علی بن حسین رضی اللہ عنہ نے خبر دی ، انہیں حسین بن علی رضی اللہ عنہ نے خبر دی کہ علی رضی اللہ عنہ نے فرمایا کہ",
        "hadithText": "غنیمت کے مال میں سے میرے حصے میں ایک اونٹ آیا تھا اور ایک دوسرا اونٹ مجھے نبی کریم صلی اللہ علیہ وسلم نے ” خمس “ میں سے دیا تھا ۔ پھر جب میرا ارادہ رسول اللہ صلی اللہ علیہ وسلم کی صاحبزادی فاطمہ رضی اللہ عنہا کی رخصتی کرا کے لانے کا ہوا تو میں نے بنی قینقاع کے ایک سنار سے طے کیا کہ وہ میرے ساتھ چلے اور ہم دونوں مل کر اذخر گھاس ( جمع کر کے ) لائیں کیونکہ میرا ارادہ تھا کہ اسے سناروں کے ہاتھ بیچ کر اپنی شادمی کے ولیمہ میں اس کی قیمت کو لگاؤں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 120040,
        "last_updated": null
    },
    {
        "urduURN": 4020860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے اسحاق بن شاہین نے بیان کیا ، کہا کہ ہم سے خالد بن عبداللہ نے بیان کیا ، ، ان سے خالد نے ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، اللہ تعالیٰ نے مکہ کو حرمت ولا شہر قرار دیا ہے ۔ یہ نہ مجھ سے پہلے کسی کے لیے حلال تھا اور نہ میرے بعد کسی کے لیے حلال ہو گا ۔ میرے لیے بھی ایک دن چند لمحات کے لیے حلال ہوا تھا ۔ سو اب اس کی نہ گھاس کاٹی جائے ، نہ اس کے درخت کاٹے جائیں ، نہ اس کے شکار بھگائے جائیں ، اور نہ اس میں کوئی گری ہوئی چیز اٹھائی جائے ۔ صرف «معرف» ( یعنی گمشدہ چیز کو اصل مالک تک اعلان کے ذریعہ پہنچانے والے ) کو اس کی اجازت ہے ۔ عباس بن عبدالمطلب رضی اللہ عنہ نے عرض کیا کہ اذخر کے لیے اجازت دے دیجئیے ، کہ یہ ہمارے سناروں اور ہمارے گھروں کی چھتوں کے کام میں آتی ہے ۔ تو آپ صلی اللہ علیہ وسلم نے اذخر کی اجازت دے دی ۔ عکرمہ نے کہا ، یہ بھی معلوم ہے کہ حرم کے شکار کو بھگانے کا مطلب کیا ہے ؟ اس کا مطلب یہ ہے کہ ( کسی درخت کے سائے تلے اگر وہ بیٹھا ہوا ہو تو ) تم سائے سے اسے ہٹا کر خود وہاں بیٹھ جاؤ ۔ عبدالوہاب نے خالد سے ( اپنی روایت میں یہ الفاظ ) بیان کئے کہ ( اذخر ) ہمارے سناروں اور ہماری قبروں کے کام میں آتی ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 120050,
        "last_updated": null
    },
    {
        "urduURN": 4020870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے محمد بن ابی عدی نے بیان کیا ، ان سے شعبہ نے ، ان سے سلیمان نے ، ان سے ابوالضحیٰ نے ، ان سے مسروق نے اور ان سے خباب بن ارت رضی اللہ عنہ نے کہ",
        "hadithText": "جاہلیت کے زمانہ میں میں لوہار کا کام کیا کرتا تھا ۔ عاص بن وائل ( کافر ) پر میرا کچھ قرض تھا میں ایک دن اس پر تقاضا کرنے گیا ۔ اس نے کہا کہ جب تک تو محمد صلی اللہ علیہ وسلم کا انکار نہیں کرے گا میں تیرا قرض نہیں دوں گا ۔ میں نے جواب دیا کہ میں آپ کا انکار اس وقت تک نہیں کروں گا جب تک اللہ تعالیٰ تیری جان نہ لے لے ، پھر تو دوبارہ اٹھایا جائے ، اس نے کہا کہ پھر مجھے بھی مہلت دے کہ میں مر جاؤں ، پھر دوبارہ اٹھایا جاؤں اور مجھے مال اور اولاد ملے اس وقت میں بھی تمہارا قرض ادا کر دوں گا ۔ اس پر آیت نازل ہوئی «أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا * أطلع الغيب أم اتخذ عند الرحمن عهدا» ” کیا تم نے اس شخص کو دیکھا جس نے ہماری آیات کو نہ مانا اور کہا ( آخرت میں ) مجھے مال اور دولت دی جائے گی ، کیا اسے غیب کی خبر ہے ؟ یا اس نے اللہ تعالیٰ کے ہاں سے کوئی اقرار لے لیا ہے ۔ “</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 120060,
        "last_updated": null
    },
    {
        "urduURN": 4020880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا کہ ہم کو امام مالک نے خبر دی ، انہیں اسحاق بن عبداللہ بن ابی طلحہ نے خبر دی ، انہوں نے انس بن مالک رضی اللہ عنہ کو یہ کہتے سنا کہ",
        "hadithText": "ایک درزی نے رسول اللہ صلی اللہ علیہ وسلم کو کھانے پر بلایا ۔ انس بن مالک رضی اللہ عنہ نے کہا میں بھی اس دعوت میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ گیا ۔ اس درزی نے روٹی اور شوربا جس میں کدو اور بھنا ہوا گوشت تھا ، رسول اللہ صلی اللہ علیہ وسلم کے سامنے پیش کر دیا ۔ میں نے دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم کدو کے قتلے پیالے میں تلاش کر رہے تھے ۔ اسی دن سے میں بھی برابر کدو کو پسند کرتا ہوں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 120070,
        "last_updated": null
    },
    {
        "urduURN": 4020890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ ہم سے یعقوب بن عبدالرحمٰن نے بیان کیا ، ان سے ابوحازم نے کہا کہ میں نے سہل بن سعد رضی اللہ عنہ سے سنا ، انہوں نے کہا کہ",
        "hadithText": "ایک عورت ” بردہ “ لے کر آئی ۔ سہل رضی اللہ عنہ نے پوچھا ، تمہیں معلوم بھی ہے کہ ” بردہ “ کسے کہتے ہیں ۔ کہا گیا جی ہاں ! بردہ ، حاشیہ دار چادر کو کہتے ہیں ۔ تو اس عورت نے کہا ، یا رسول اللہ ! میں نے خاص آپ کو پہنانے کے لیے یہ چادر اپنے ہاتھ سے بنی ہے ، آپ صلی اللہ علیہ وسلم نے اسے لے لیا ۔ آپ صلی اللہ علیہ وسلم کو اس کی ضرورت بھی تھی ۔ پھر آپ صلی اللہ علیہ وسلم باہر تشریف لائے تو آپ صلی اللہ علیہ وسلم اسی چادر کو بطور ازار کے پہنے ہوئے تھے ، حاضرین میں سے ایک صاحب بولے ، یا رسول اللہ ! یہ تو مجھے دے دیجئیے ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ اچھا لے لینا ۔ اس کے بعد آپ صلی اللہ علیہ وسلم مجلس میں تھوڑی دیر تک بیٹھے رہے پھر واپس تشریف لے گئے پھر ازار کو تہ کر کے ان صاحب کے پاس بھجوا دیا ۔ لوگوں نے کہا تم نے آنحضرت صلی اللہ علیہ وسلم سے یہ ازار مانگ کر اچھا نہیں کیا کیونکہ تمہیں معلوم ہے کہ آپ صلی اللہ علیہ وسلم کسی سائل کے سوال کو رد نہیں کیا کرتے ہیں ۔ اس پر ان صحابی نے کہا کہ واللہ ! میں نے تو صرف اس لیے یہ چادر مانگی ہے کہ جب میں مروں تو یہ میرا کفن بنے ۔ سہل رضی اللہ عنہ نے فرمایا کہ وہ چادر ہی ان کا کفن بنی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 120080,
        "last_updated": null
    },
    {
        "urduURN": 4020900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا کہ ہم سے عبدالعزیز نے بیان کیا ان سے ابوحازم نے بیان کیا کہ",
        "hadithText": "کچھ لوگ سہل بن سعد ساعدی رضی اللہ عنہ کے یہاں منبرنبوی کے متعلق پوچھنے آئے ۔ انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فلاں عورت کے یہاں جن کا نام بھی سہل رضی اللہ عنہ نے لیا تھا ، اپنا آدمی بھیجا کہ وہ اپنے بڑھئی غلام سے کہیں کہ میرے لیے کچھ لکڑیوں کو جوڑ کر منبر تیار کر دے ، تاکہ لوگوں کو وعظ کرنے کے لیے میں اس پر بیٹھ جایا کروں ۔ چنانچہ اس عورت نے اپنے غلام سے غابہ کے جھاؤ کی لکڑی کا منبر بنانے کے لیے کہا ۔ پھر ( جب منبر تیار ہو گیا تو ) انہوں نے اسے آپ صلی اللہ علیہ وسلم کی خدمت میں بھیجا ۔ وہ منبر آپ صلی اللہ علیہ وسلم کے حکم سے ( مسجد میں ) رکھا گیا ۔ اور آپ صلی اللہ علیہ وسلم اس پر بیٹھے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 120090,
        "last_updated": null
    },
    {
        "urduURN": 4020910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے خلاد بن یحییٰ نے بیان کیا ، کہا کہ ہم سے عبدالواحد بن ایمن نے بیان کیا ، ان سے ان کے والد نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے کہ",
        "hadithText": "ایک انصاری عورت نے رسول کریم صلی اللہ علیہ وسلم سے عرض کیا ، یا رسول اللہ ! میں آپ کے لیے کوئی ایسی چیز کیوں نہ بنوا دوں جس پر آپ صلی اللہ علیہ وسلم وعظ کے وقت بیٹھا کریں ۔ کیونکہ میرے پاس ایک غلام بڑھئی ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اچھا تمہاری مرضی ۔ راوی نے بیان کیا کہ پھر جب منبر آپ صلی اللہ علیہ وسلم کے لیے اس نے تیار کیا ۔ تو جمعہ کے دن جب آنحضرت صلی اللہ علیہ وسلم اس منبر پر بیٹھے تو اس کھجور کی لکڑی سے رونے کی آواز آنے لگی ۔ جس پر ٹیک دے کر آپ صلی اللہ علیہ وسلم پہلے خطبہ دیا کرتے تھے ۔ ایسا معلوم ہوتا تھا کہ وہ پھٹ جائے گی ۔ یہ دیکھ کر نبی کریم صلی اللہ علیہ وسلم منبر پر سے اترے اور اسے پکڑ کر اپنے سینے سے لگا لیا ۔ اس وقت بھی وہ لکڑی اس چھوٹے بچے کی طرح سسکیاں بھر رہی تھی جسے چپ کرانے کی کوشش کی جاتی ہے ۔ اس کے بعد وہ چپ ہو گئی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، کہ اس کے رونے کی وجہ یہ تھی کہ یہ لکڑی خطبہ سنا کرتی تھی اس لیے روئی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 120100,
        "last_updated": null
    },
    {
        "urduURN": 4020920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے یوسف بن عیسیٰ نے بیان کیا ، کہا کہ ہم سے ابومعاویہ نے بیان کیا ، کہا کہ ہم سے اعمش نے بیان کیا ، ان سے ابراہیم نخعی نے ، ان سے اسود بن یزید نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ایک یہودی سے کچھ غلہ ادھار خریدا ۔ اور اپنی زرہ اس کے پاس گروی رکھوائی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 120110,
        "last_updated": null
    },
    {
        "urduURN": 4020930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے عبدالوہاب نے بیان کیا ، کہا کہ ہم سے عبیداللہ نے بیان کیا ، ان سے وہب بن کیسان نے بیان کیا اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک غزوہ ( ذات الرقاع یا تبوک ) میں تھا ۔ میرا اونٹ تھک کر سست ہو گیا ۔ اتنے میں میرے پاس نبی کریم صلی اللہ علیہ وسلم تشریف لائے اور فرمایا جابر ! میں نے عرض کیا ، حضور حاضر ہوں ۔ فرمایا کیا بات ہوئی ؟ میں نے کہا کہ میرا اونٹ تھک کر سست ہو گیا ہے ، چلتا ہی نہیں اس لیے میں پیچھے رہ گیا ہوں ۔ پھر آپ اپنی سواری سے اترے اور میرے اسی اونٹ کو ایک ٹیرھے منہ کی لکڑی سے کھینچنے لگے ( یعنی ہانکنے لگے ) اور فرمایا کہ اب سوار ہو جا ۔ چنانچہ میں سوار ہو گیا ۔ اب تو یہ حال ہوا کہ مجھے اسے رسول اللہ صلی اللہ علیہ وسلم کے برابر پہنچنے سے روکنا پڑ جاتا تھا ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ، جابر تو نے شادی بھی کر لی ہے ؟ میں نے عرض کی جی ہاں ! دریافت فرمایا کسی کنواری لڑکی سے کی ہے یا بیوہ سے ۔ میں نے عرض کیا کہ میں نے تو ایک بیوہ سے کر لی ہے ۔ فرمایا ، کسی کنواری لڑکی سے کیوں نہ کی کہ تم اس کے ساتھ کھیلتے اور وہ بھی تمہارے ساتھ کھیلتی ۔ ( حضرت جابر بھی کنورے تھے ) میں نے عرض کیا کہ میری کئی بہنیں ہیں ۔ ( اور میری ماں کا انتقال ہو چکا ہے ) اس لیے میں نے یہی پسند کیا کہ ایسی عورت سے شادی کروں ، جو انہیں جمع رکھے ۔ ان کے کنگھا کرے اور ان کی نگرانی کرے ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اچھا اب تم گھر پہنچ کر خیر و عافیت کے ساتھ خوب مزے اڑانا ۔ اس کے بعد فرمایا ، کیا تم اپنا اونٹ بیچو گے ؟ میں نے کہا جی ہاں ! چنانچہ آپ صلی اللہ علیہ وسلم نے ایک اوقیہ چاندی میں خرید لیا ، رسول اللہ صلی اللہ علیہ وسلم مجھ سے پہلے ہی مدینہ پہنچ گئے تھے ۔ اور میں دوسرے دن صبح کو پہنچا ۔ پھر ہم مسجد آئے تو آنحضرت صلی اللہ علیہ وسلم مسجد کے دروازہ پر ملے ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ، کیا ابھی آئے ہو ؟ میں نے عرض کیا کہ جی ہاں ! فرمایا ، پھر اپنا اونٹ چھوڑ دے اور مسجد میں جا کے دو رکعت نماز پڑھ ۔ میں اندر گیا اور نماز پڑھی ۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے بلال رضی اللہ عنہ کو حکم دیا کہ میرے لیے ایک اوقیہ چاندی تول دے ۔ انہوں نے ایک اوقیہ چاندی جھکتی ہوئی تول دی ۔ میں پیٹھ موڑ کر چلا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ جابر کو ذرا بلاؤ ۔ میں نے سوچا کہ شاید اب میرا اونٹ پھر مجھے واپس کریں گے ۔ حالانکہ اس سے زیادہ ناگوار میرے لیے کوئی چیز نہیں تھی ۔ چنانچہ آپ صلی اللہ علیہ وسلم نے یہی فرمایا کہ یہ اپنا اونٹ لے جا اور اس کی قیمت بھی تمہاری ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 120120,
        "last_updated": null
    },
    {
        "urduURN": 4020940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، انہوں نے کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "عکاظ ، مجنہ اور ذوالمجاز یہ سب زمانہ جاہلیت کے بازار تھے ۔ جب اسلام آیا تو لوگوں نے ان میں تجارت کو گناہ سمجھا ۔ اس پر اللہ تعالیٰ نے یہ آیت نازل کی «ليس عليكم جناح‏** في مواسم الحج» ، ابن عباس رضی اللہ عنہما نے اسی طرح قرآت کی ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 120130,
        "last_updated": null
    },
    {
        "urduURN": 4020950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا کہ عمرو بن دینار نے کہا",
        "hadithText": "یہاں ( مکہ میں ) ایک شخص نواس نام کا تھا ۔ اس کے پاس ایک بیمار اونٹ تھا ۔ حضرت عبداللہ بن عمر رضی اللہ عنہما گئے اور اس کے شریک سے وہی اونٹ خرید لائے ۔ وہ شخص آیا تو اس کے ساجھی نے کہا کہ ہم نے تو وہ اونٹ بیچ دیا ۔ اس نے پوچھا کہ کسے بیچا ؟ شریک نے کہا کہ ایک شیخ کے ہاتھوں جو اس طرح کے تھے ۔ اس نے کہا افسوس ! وہ تو عبداللہ بن عمر رضی اللہ عنہما تھے ۔ چنانچہ وہ آپ کی خدمت میں حاضر ہوا اور عرض کیا کہ میرے ساتھی نے آپ کو مریض اونٹ بیچ دیا ہے اور آپ سے اس نے اس کے مرض کی وضاحت بھی نہیں کی ۔ عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ پھر اسے واپس لے جاؤ ۔ بیان کیا کہ جب وہ اس کو لے جانے لگا تو عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ اچھا رہنے دو ہم رسول اللہ صلی اللہ علیہ وسلم کے فیصلہ پر راضی ہیں ( آپ نے فرمایا تھا کہ ) «لا عدوى‏.‏» ( یعنی امراض چھوت والے نہیں ہوتے ) علی بن عبداللہ مدینی نے کہا کہ سفیان نے اس روایت کو عمرو سے سنا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 120140,
        "last_updated": null
    },
    {
        "urduURN": 4020960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، کہا کہ ہم سے امام مالک نے کہا ، ان سے یحییٰ بن سعید نے کہا ، ان سے ابن افلح نے ، ان سے ابوقتادہ رضی اللہ عنہ کے غلام ابومحمد نے اور ان سے ابوقتادہ رضی اللہ عنہ نے کہ",
        "hadithText": "ہم غزوہ حنین کے سال رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نکلے ۔ نبی کریم صلی اللہ علیہ وسلم نے مجھے ایک زرہ تحفہ دی اور میں نے اسے بیچ دیا ۔ پھر میں نے اس کی قیمت سے قبیلہ بنی سلمہ میں ایک باغ خرید لیا ۔ یہ پہلی جائیداد تھی جسے میں نے اسلام لانے کے بعد حاصل کیا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 120150,
        "last_updated": null
    },
    {
        "urduURN": 4020970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا کہ ہم سے عبدالواحد نے بیان کیا ، انہوں نے کہا کہ ہم سے ابوبردہ بن عبداللہ نے بیان کیا ، انہوں نے کہا کہ میں نے ابوبردہ بن ابی موسیٰ سے سنا اور ان سے ان کے والد موسیٰ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا نیک ساتھی اور برے ساتھی کی مثال کستوری بیچنے والے عطار اور لوہار کی سی ہے ۔ مشک بیچنے والے کے پاس سے تم دو اچھائیوں میں سے ایک نہ ایک ضرور پا لو گے ۔ یا تو مشک ہی خرید لو گے ورنہ کم از کم اس کی خوشبو تو ضرور ہی پا سکو گے ۔ لیکن لوہار کی بھٹی یا تمہارے بدن اور کپڑے کو جھلسا دے گی ورنہ بدبو تو اس سے تم ضرور پا لو گے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 120160,
        "last_updated": null
    },
    {
        "urduURN": 4020980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک رحمہ اللہ نے خبر دی ، انہیں حمید نے ، اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ابوطیبہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کے پچھنا لگایا تو آپ صلی اللہ علیہ وسلم نے ایک صاع کھجور ( بطور اجرت ) انہیں دینے کے لیے حکم فرمایا ۔ اور ان کے مالک کو فرمایا کہ ان کے خراج میں کمی کر دیں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 120170,
        "last_updated": null
    },
    {
        "urduURN": 4020990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے خالد نے جو عبداللہ کے بیٹے ہیں بیان کیا ، ان سے خالد حذاء نے بیان کیا ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے پچھنا لگوایا اور جس نے پچھنا لگایا اسے آپ صلی اللہ علیہ وسلم نے اس کی اجرت بھی دی ، اگر اس کی اجرت حرام ہوتی تو آپ صلی اللہ علیہ وسلم اس کو ہرگز نہ دیتے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 120180,
        "last_updated": null
    },
    {
        "urduURN": 4021000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے ابوبکر بن حفص نے بیان کیا ، ان سے سالم بن عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ ان کے باپ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے عمر رضی اللہ عنہ کے یہاں ایک ریشمی جبہ بھیجا ۔ پھر آپ صلی اللہ علیہ وسلم نے دیکھا کہ حضرت عمر رضی اللہ عنہ اسے ( ایک دن ) پہنے ہوئے ہیں ۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا میں نے اسے تمہارے پاس اس لیے نہیں بھیجا تھا کہ تم اسے پہن لو ، اسے تو وہی لوگ پہنتے ہیں جن کا آخرت میں کوئی حصہ نہیں ۔ میں نے تو اس لیے بھیجا تھا کہ تم اس سے ( بیچ کر ) فائدہ اٹھاؤ ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 120190,
        "last_updated": null
    },
    {
        "urduURN": 4021010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں نافع نے ، انہیں قاسم بن محمد نے اور انہیں ام المؤمنین عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "انہوں نے ایک گدا خریدا جس پر مورتیں تھیں ۔ رسول کریم صلی اللہ علیہ وسلم کی نظر جوں ہی اس پر پڑی ، آپ صلی اللہ علیہ وسلم دروازے پر ہی کھڑے ہو گئے اور اندر داخل نہیں ہوئے ۔ ( عائشہ رضی اللہ عنہا نے بیان کیا کہ ) میں نے آپ صلی اللہ علیہ وسلم کے چہرہ مبارک پر ناپسندیدگی کے آثار دیکھے تو عرض کیا ، یا رسول اللہ ! میں اللہ کی بارگاہ میں توبہ کرتی ہوں اور اس کے رسول اللہ صلی اللہ علیہ وسلم سے معافی مانگتی ہوں ، فرمائیے مجھ سے کیا غلطی ہوئی ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ، یہ گدا کیسا ہے ؟ میں نے کہا کہ میں نے یہ آپ ہی کے لیے خریدا ہے تاکہ آپ اس پر بیٹھیں اور اس سے ٹیک لگائیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، لیکن اس طرح کی مورتیں بنانے والے لوگ قیامت کے دن عذاب کئے جائیں گے ۔ اور ان سے کہا جائے گا کہ تم لوگوں نے جس چیز کو بنایا اسے زندہ کر دکھاؤ ۔ آپ صلی اللہ علیہ وسلم نے یہ بھی فرمایا کہ جن گھروں میں تصویریں ہوتی ہیں ( رحمت کے ) فرشتے ان میں داخل نہیں ہوتے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 120200,
        "last_updated": null
    },
    {
        "urduURN": 4021020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے عبدالوارث نے ، ان سے ابوالتیاح نے ، اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اے بنو نجار ! اپنے باغ کی قیمت مقرر کر دو ۔ ( آپ صلی اللہ علیہ وسلم نے اس جگہ کو مسجد کے لیے خریدنا چاہتے تھے ) اس باغ میں کچھ حصہ تو ویرانہ اور کچھ حصے میں کھجور کے درخت تھے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 120210,
        "last_updated": null
    },
    {
        "urduURN": 4021030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے صدقہ بن فضل نے بیان کیا ، کہا کہ ہم کو عبدالوہاب نے خبر دی ، کہا کہ میں نے یحییٰ بن سعید سے سنا ، کہا کہ میں نے نافع سے سنا اور انہوں نے ابن عمر رضی اللہ عنہما سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، خریدوفروخت کرنے والوں کو جب تک وہ جدا نہ ہوں اختیار ہوتا ہے ، یا خود بیع میں اختیار کی شرط ہو ۔ ( تو شرط کے مطابق اختیار ہوتا ہے ) نافع نے کہا کہ جب عبداللہ بن عمر رضی اللہ عنہما کوئی ایسی چیز خریدتے جو انہیں پسند ہوتی تو ( خریدنے کے بعد ) اپنے معاملہ دار سے جدا ہو جاتے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 120220,
        "last_updated": null
    },
    {
        "urduURN": 4021040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، کہا کہ ہم سے ہمام نے بیان کیا ، ان سے قتادہ نے ، ان سے ابولخلیل نے ، ان سے عبداللہ بن حارث نے اور ان سے حکیم بن حزام رضی اللہ عنہ نے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، بیچنے اور خریدنے والوں کو جب تک وہ جدا نہ ہوں ( معاملہ کو باقی رکھنے یا توڑ دینے کا ) اختیار ہوتا ہے ۔ احمد نے یہ زیادتی کی کہ ہم سے بہز نے بیان کیا کہ ہمام نے بیان کیا کہ میں نے اس کا ذکر ابوالتیاح کے سامنے کیا تو انہوں نے بتلایا کہ جب عبداللہ بن حارث نے یہ حدیث بیان کی تھی ، تو میں بھی اس وقت ابوالخلیل کے ساتھ موجود تھا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 120231,
        "last_updated": null
    },
    {
        "urduURN": 4021050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابوالنعمان نے بیان کیا ، کہا کہ ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب سختیانی نے بیان کیا ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، خریدنے والے اور بیچنے والے کو ( بیع توڑ دینے کا ) اس وقت تک اختیار ہے جب تک وہ جدا نہ ہو جائیں ۔ یا دونوں میں سے کوئی ایک اپنے دوسرے فریق سے یہ نہ کہہ دے کہ پسند کر لو ۔ کبھی یہ بھی کہا کہ ” یا اختیار کی شرط کے ساتھ بیع ہو ۔ “</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 120250,
        "last_updated": null
    },
    {
        "urduURN": 4021060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "مجھ سے اسحاق بن منصور نے بیان کیا ، کہا کہ ہم کو حبان بن ہلال نے خبر دی ، کہا کہ ہم سے شعبہ نے بیان کیا ، کہ ان کو قتادہ نے خبر دی کہ مجھے صالح ابوالخلیل نے خبر دی ، انہیں عبداللہ بن حارث نے ، کہا کہ میں نے حکیم بن حزام رضی اللہ عنہ سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا خریدنے اور بیچنے والے جب تک ایک دوسرے سے الگ الگ نہ ہو جائیں انہیں اختیار باقی رہتا ہے ۔ اب اگر دونوں نے سچائی اختیار کی اور ہر بات صاف صاف بیان اور واضح کر دی ، تو ان کی خریدوفروخت میں برکت ہوتی ہے ۔ لیکن اگر انہوں نے کوئی بات چھپائی یا جھوٹ بولا تو ان کی خریدوفروخت میں سے برکت مٹا دی جاتی ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 120260,
        "last_updated": null
    },
    {
        "urduURN": 4021070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں نافع نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، خریدنے اور بیچنے والے دونوں کو اس وقت تک اختیار ہوتا ہے ، جب تک وہ ایک دوسرے سے جدا نہ ہوں ۔ مگر بیع خیار میں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 120270,
        "last_updated": null
    },
    {
        "urduURN": 4021080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جب دو شخصوں نے خریدوفروخت کی تو جب تک وہ دونوں جدا نہ ہو جائیں ، انہیں ( بیع کو توڑ دینے کا ) اختیار باقی رہتا ہے ۔ یہ اس صورت میں کہ دونوں ایک ہی جگہ رہیں ، لیکن اگر ایک نے دوسرے کو پسند کرنے کے لیے کہا اور اس شرط پر بیع ہوئی ، اور دونوں نے بیع کا قطعی فیصلہ کر لیا ، تو بیع اسی وقت منعقد ہو جائے گی ۔ اسی طرح اگر دونوں فریق بیع کے بعد ایک دوسرے سے جدا ہو گئے ، اور بیع سے کسی فریق نے بھی انکار نہیں کیا ، تو بھی بیع لازم ہو جاتی ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 120280,
        "last_updated": null
    },
    {
        "urduURN": 4021090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن یوسف فریابی نے بیان کیا ، کہا کہ ہم سے سفیان ثوری نے بیان کیا ، ان سے عبداللہ بن دینار نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، کسی بھی خریدنے اور بیچنے والے میں اس وقت تک بیع پختہ نہیں ہوتی جب تک وہ دونوں جدا نہ ہو جائیں ۔ البتہ وہ بیع جس میں مشترکہ اختیار کی شرط لگا دی گئی ہو اس سے الگ ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 120290,
        "last_updated": null
    },
    {
        "urduURN": 4021100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "مجھ سے اسحاق بن منصور نے بیان کیا ، کہا کہ ہم سے حبان نے بیان کیا ، کہ ہم سے ہمام نے بیان کیا ، ان سے قتادہ نے ، ان سے ابوخلیل نے ، ان سے عبداللہ بن حارث نے اور ان سے حکیم بن حزام رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، بیچنے اور خریدنے والے کو جب تک وہ جدا نہ ہوں ( بیع توڑ دینے کا ) اختیار ہے ۔ ہمام راوی نے کہا کہ میں نے اپنی کتاب میں لفظ «يختار» تین مرتبہ لکھا ہوا پایا ۔ پس اگر دونوں نے سچائی اختیار کی اور بات صاف صاف واضح کر دی تو انہیں ان کی بیع میں برکت ملتی ہے اور اگر انہوں نے جھوٹی باتیں بنائیں اور ( کسی عیب کو ) چھپایا تو تھوڑا سا نفع شاید وہ کما لیں ، لیکن ان کی بیع میں برکت نہیں ہو گی ۔ ( حبان نے ) کہا کہ ہم سے ہمام نے بیان کیا ، ان سے ابوالتیاح نے بیان کیا ، انہوں نے عبداللہ بن حارث سے سنا کہ یہی حدیث وہ حکیم بن حزام رضی اللہ عنہ سے بحوالہ نبی کریم صلی اللہ علیہ وسلم روایت کرتے تھے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 120301,
        "last_updated": null
    },
    {
        "urduURN": 4021110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "حمیدی نے کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو نے بیان کیا اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھے ۔ میں حضرت عمر رضی اللہ عنہ کے ایک نئے اور سرکش اونٹ پر سوار تھا ۔ اکثر وہ مجھے مغلوب کر کے سب سے آگے نکل جاتا ، لیکن حضرت عمر رضی اللہ عنہ اسے ڈانٹ کر پیچھے واپس کر دیتے ۔ وہ پھر آگے بڑھ جاتا ۔ آخر نبی کریم صلی اللہ علیہ وسلم نے حضرت عمر رضی اللہ عنہ سے فرمایا کہ یہ اونٹ مجھے بیچ ڈال ۔ حضرت عمر رضی اللہ عنہ نے کہا یا رسول اللہ ! یہ تو آپ ہی کا ہے ۔ لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہیں مجھے یہ اونٹ دیدے ۔ چنانچہ عمر رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کو وہ اونٹ بیچ ڈالا ۔ اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، عبداللہ بن عمر ! اب یہ اونٹ تیرا ہو گیا جس طرح تو چاہے اسے استعمال کر ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 120320,
        "last_updated": null
    },
    {
        "urduURN": 4021120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ابوعبداللہ امام بخاری نے کہا کہ لیث بن سعد نے بیان کیا کہ مجھ سے عبدالرحمٰن بن خالد نے بیان کیا ، ان سے ابن شہاب نے ، ان سے سالم بن عبداللہ نے ، اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا ، کہ",
        "hadithText": "میں نے امیرالمؤمنین عثمان رضی اللہ عنہ کو اپنی وادی قریٰ کی زمین ، ان کی خیبر کی زمین کے بدلے میں بیچی تھی ۔ پھر جب ہم نے بیع کر لی تو میں الٹے پاؤں ان کے گھر سے اس خیال سے باہر نکل گیا کہ کہیں وہ بیع فسخ نہ کر دیں ۔ کیونکہ شریعت کا قاعدہ یہ تھا کہ بیچنے اور خریدنے والے کو ( بیع توڑنے کا ) اختیار اس وقت تک رہتا ہے جب تک وہ ایک دوسرے سے جدا نہ ہو جائیں ۔ عبداللہ رضی اللہ عنہ نے کہا کہ جب ہماری خریدوفروخت پوری ہو گئی اور میں نے غور کیا تو معلوم ہوا کہ میں نے عثمان رضی اللہ عنہ کو نقصان پہنچایا ہے کیونکہ ( اس تبادلہ کے نتیجے میں ، میں نے ان کی پہلی زمین سے ) انہیں تین دن کے سفر کی دوری پر ثمود کی زمین کی طرف دھکیل دیا تھا اور انہوں نے مجھے ( میری مسافت کم کر کے ) مدینہ سے صرف تین دن کے سفر کی دوری پر لا چھوڑا تھا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 120330,
        "last_updated": null
    },
    {
        "urduURN": 4021130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک رحمہ اللہ نے خبر دی ، انہیں عبداللہ بن دینار نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "ایک شخص ( حبان بن منقذ رضی اللہ عنہ ) نے نبی کریم صلی اللہ علیہ وسلم سے عرض کیا کہ وہ اکثر خریدوفروخت میں دھوکہ کھا جاتے ہیں ۔ اس پر آپ صلی اللہ علیہ وسلم نے ان سے فرمایا کہ جب تم کسی چیز کی خریدوفروخت کرو تو یوں کہہ دیا کرو کہ ” بھائی دھوکہ اور فریب کا کام نہیں ۔ “</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 120340,
        "last_updated": null
    },
    {
        "urduURN": 4021140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن صباح نے بیان کیا ، کہا کہ ہم سے اسماعیل بن زکریا نے بیان کیا ، ان سے محمد بن سوقہ نے ، ان سے نافع بن جبیر بن مطعم نے بیان کیا ، کہا کہ مجھ سے عائشہ رضی اللہ عنہا نے بیان کیا ، کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، قیامت کے قریب ایک لشکر کعبہ پر چڑھائی کرے گا ۔ جب وہ مقام بیداء میں پہنچے گا تو انہیں اول سے آخر تک سب کو زمین میں دھنسا دیا جائے گا ۔ حضرت عائشہ رضی اللہ عنہا نے بیان کیا ، کہ میں نے کہا ، یا رسول اللہ ! اسے شروع سے آخر تک کیوں کر دھنسایا جائے گا جب کہ وہیں ان کے بازار بھی ہوں گے اور وہ لوگ بھی ہوں گے جو ان لشکریوں میں سے نہیں ہوں گے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں ! شروع سے آخر تک ان سب کو دھنسا دیا جائے گا ۔ پھر ان کی نیتوں کے مطابق وہ اٹھائے جائیں گے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 120350,
        "last_updated": null
    },
    {
        "urduURN": 4021150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، کہا کہ ہم سے جریر نے بیان کیا ، ان سے اعمش نے ، ان سے ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جماعت کے ساتھ کسی کی نماز بازار میں یا اپنے گھر میں نماز پڑھنے سے درجوں میں کچھ اوپر بیس درجے زیادہ فضیلت رکھتی ہے ۔ کیونکہ جب ایک شخص اچھی طرح وضو کرتا ہے پھر مسجد میں صرف نماز کے ارادہ سے آتا ہے ۔ نماز کے سوا اور کوئی چیز اسے لے جانے کا باعث نہیں بنتی تو جو بھی قدم وہ اٹھاتا ہے اس سے ایک درجہ اس کا بلند ہوتا ہے یا اس کی وجہ سے ایک گناہ اس کا معاف ہوتا ہے اور جب تک ایک شخص اپنے مصلے پر بیٹھا رہتا ہے جس پر اس نے نماز پڑھی ہے تو فرشتے برابر اس کے لیے رحمت کی دعائیں یوں کرتے رہتے ہیں «اللهم صل عليه ،‏‏‏‏ ‏‏‏‏ اللهم ارحمه» ” اے اللہ ! اس پر اپنی رحمتیں نازل فرما ، اے اللہ اس پر رحم فرما ۔ “ یہ اس وقت تک ہوتا رہتا ہے جب تک وہ وضو توڑ کر فرشتوں کو تکلیف نہ پہنچائے جتنی دیر تک بھی آدمی نماز کی وجہ سے رکا رہتا ہے وہ سب نماز ہی میں شمار ہوتا ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 120360,
        "last_updated": null
    },
    {
        "urduURN": 4021160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے حمید طویل نے بیان کیا ، اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ایک مرتبہ بازار میں تھے ۔ کہ ایک شخص نے پکارا یا ابا القاسم ! آپ صلی اللہ علیہ وسلم نے اس کی طرف دیکھا ۔ ( کیونکہ آپ کی کنیت ابوالقاسم ہی تھی ) اس پر اس شخص نے کہا کہ میں نے تو اس کو بلایا تھا ۔ ( یعنی ایک دوسرے شخص کو جو ابوالقاسم ہی کنیت رکھتا تھا ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم لوگ میرے نام پر نام رکھا کرو لیکن میری کنیت تم اپنے لیے نہ رکھو ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 120370,
        "last_updated": null
    },
    {
        "urduURN": 4021170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا کہ ہم سے زبیر نے بیان کیا ، ان سے حمید نے ، اور ان سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "ایک شخص نے بقیع میں ( کسی کو ) پکارا ” اے ابوالقاسم “ نبی کریم صلی اللہ علیہ وسلم نے اس کی طرف دیکھا ، تو اس شخص نے کہا کہ میں نے آپ کو نہیں پکارا ۔ اس دوسرے آدمی کو پکارا تھا ، آپ صلی اللہ علیہ وسلم نے فرمایا میرے نام پر نام رکھا کرو لیکن میری کنیت نہ رکھا کرو ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 120380,
        "last_updated": null
    },
    {
        "urduURN": 4021180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عبیداللہ بن یزید نے ان سے نافع بن جبیر بن مطعم نے اور ان سے ابوہریرہ دوسی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم دن کے ایک حصہ میں تشریف لے چلے ۔ نہ آپ صلی اللہ علیہ وسلم نے مجھ سے کوئی بات کی اور نہ میں نے آپ صلی اللہ علیہ وسلم سے ۔ اسی طرح آپ صلی اللہ علیہ وسلم بنی قینقاع کے بازار میں آئے پھر ( واپس ہوئے اور ) فاطمہ رضی اللہ عنہا کے گھر کے آنگن میں بیٹھ گئے اور فرمایا ، وہ بچہ کہاں ہے ، وہ بچہ کہاں ہے ؟ فاطمہ رضی اللہ عنہا ( کسی مشغولیت کی وجہ سے فوراً ) آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر نہ ہو سکیں ۔ میں نے خیال کیا ، ممکن ہے حسن رضی اللہ عنہ کو کرتا وغیرہ پہنا رہی ہوں یا نہلا رہی ہوں ۔ تھوڑی ہی دیر بعد حسن رضی اللہ عنہ دوڑتے ہوئے آئے ، آپ صلی اللہ علیہ وسلم نے ان کو سینے سے لگا لیا اور بوسہ لیا ، پھر فرمایا اے اللہ ؟ ! اسے محبوب رکھ اور اس شخص کو بھی محبوب رکھ جو اس سے محبت رکھے ۔ سفیان نے کہا کہ عبیداللہ نے مجھے خبر دی ، انہوں نے نافع بن جبیر کو دیکھا کہ انہوں نے وتر کی نماز صرف ایک ہی رکعت پڑھی تھی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 120390,
        "last_updated": null
    },
    {
        "urduURN": 4021190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابراہیم بن المنذر نے بیان کیا ، کہا کہ ہم سے ابوضمرہ انس بن عیاض نے بیان کیا ، کہا کہ ہم سے موسیٰ بن عقبہ نے بیان کیا ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "صحابہ رضی اللہ عنہم نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں غلہ قافلوں سے خریدتے تھے تو آپ ان کے پاس کوئی آدمی بھیج کر وہیں پر جہاں انہوں نے غلہ خریدا ہوتا ۔ اس غلے کو بیچنے سے منع فرما دیتے اور اسے وہاں سے لا کر بیچنے کا حکم ہوتا جہاں عام طور پر غلہ بکتا تھا ۔ \n<span class=urdu_sanad>کہا کہ ہم سے ابن عمر رضی اللہ عنہما نے یہ بھی بیان کیا کہ</span> نبی کریم صلی اللہ علیہ وسلم نے پوری طرح اپنے قبضہ میں کرنے سے پہلے اسے بیچنے سے منع فرمایا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 120401,
        "last_updated": null
    },
    {
        "urduURN": 4021210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن سنان نے بیان کیا ، کہا کہ ہم سے فلیح نے بیان کیا ، ان سے ہلال بن علی نے بیان کیا ، ان سے عطاء بن یسار نے کہ میں عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے ملا اور عرض کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کی جو صفات توریت میں آئی ہیں ان کے متعلق مجھے کچھ بتائیے ۔ انہوں نے کہا کہ ہاں ! قسم خدا کی ! آپ صلی اللہ علیہ وسلم کی تورات میں بالکل بعض وہی صفات آئی ہیں جو قرآن شریف میں مذکور ہیں ۔ جیسے کہ ” اے نبی ! ہم نے تمہیں گواہ ، خوشخبری دینے والا ، ڈرانے والا ، اور ان پڑھ قوم کی حفاظت کرنے والا بنا کر بھیجا ہے ۔ تم میرے بندے اور میرے رسول ہو ۔ میں نے تمہارا نام متوکل رکھا ہے ۔ تم نہ بدخو ہو ، نہ سخت دل اور نہ بازاروں میں شور غل مچانے والے ، ( اور تورات میں یہ بھی لکھا ہوا ہے کہ ) وہ ( میرا بندہ اور رسول ) برائی کا بدلہ برائی سے نہیں لے گا ۔ بلکہ معاف اور درگزر کرے گا ۔ اللہ تعالیٰ اس وقت تک اس کی روح قبض نہیں کرے گا جب تک ٹیڑھی شریعت کو اس سے سیدھی نہ کرا لے ، یعنی لوگ «لا إله إلا الله» نہ کہنے لگیں اور اس کے ذریعہ وہ اندھی آنکھوں کو بینا ، بہرے کانوں کو شنوا اور پردہ پڑے ہوئے دلوں کو پردے کھول دے گا ۔ اس حدیث کی متابعت عبدالعزیز بن ابی سلمہ نے ہلال سے کی ہے ۔ اور سعید نے بیان کیا کہ ان سے ہلال نے ، ان سے عطاء نے کہ «غلف» ہر اس چیز کو کہتے ہیں جو پردے میں ہو ۔ «سيف أغلف ،‏‏‏‏ وقوس غلفاء» اسی سے ہے اور «رجل أغلف» اس شخص کو کہتے ہیں جس کا ختنہ نہ ہوا ہو ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 120420,
        "last_updated": null
    },
    {
        "urduURN": 4021220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہمیں امام مالک نے خبر دی ، انہیں نافع نے ، انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جب کوئی شخص کسی قسم کا غلہ خریدے تو جب تک اس پر پوری طرح قبضہ نہ کر لے ، اسے نہ بیچے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 120430,
        "last_updated": null
    },
    {
        "urduURN": 4021230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا ہمیں جریر نے خبر دی ، انہیں مغیرہ نے ، انہیں عامر شعبی نے اور ان سے جابر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جب عبداللہ بن عمرو بن حرام رضی اللہ عنہ ( میرے باپ ) شہید ہو گئے تو ان کے ذمے ( لوگوں کا ) کچھ قرض باقی تھا ۔ اس لیے میں نے نبی کریم صلی اللہ علیہ وسلم کے ذریعہ کوشش کی کہ قرض خواہ کچھ اپنے قرضوں کو معاف کر دیں ۔ نبی کریم صلی اللہ علیہ وسلم نے یہی چاہا ، لیکن وہ نہیں مانے ۔ آپ صلی اللہ علیہ وسلم نے مجھ سے فرمایا کہ جاؤ اپنی تمام کھجور کی قسموں کو الگ الگ کر لو ۔ عجوہ ( ایک خاص قسم کی کھجور ) کو الگ رکھ اور عذق زید ( کھجور کی ایک قسم ) کو الگ کر ۔ پھر مجھے بلا بھیج ۔ میں نے ایسا ہی کیا اور نبی کریم صلی اللہ علیہ وسلم کو کہلا بھیجا ۔ آپ صلی اللہ علیہ وسلم تشریف لائے اور کھجوروں کے ڈھیر پر یا بیچ میں بیٹھ گئے اور فرمایا کہ اب ان قرض خواہوں کو ناپ کر دو ۔ میں نے ناپنا شروع کیا ۔ جتنا قرض لوگوں کاتھا ۔ میں نے سب کو ادا کر دیا ، پھر بھی تمام کھجور جوں کی توں تھی ۔ اس میں سے ایک دانہ برابر کی کمی نہیں ہوئی تھی ۔ فراس نے بیان کیا کہ ان سے شعبی نے ، اور ان سے جابر رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے کہ ” برابر ان کے لیے تولتے رہے ، یہاں تک کہ ان کا پورا قرض ادا ہو گیا ۔ “ اور ہشام نے کہا ، ان سے وہب نے ، اور ان سے جابر رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، کھجور توڑ اور اپنا قرض پورا ادا کر دے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 120440,
        "last_updated": null
    },
    {
        "urduURN": 4021240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا کہ ہم سے ولید نے بیان کیا ، ان سے ثور نے ، ان سے خالد بن معدان نے اور ان سے مقدام بن معدیکرب رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اپنے غلے کو ناپ لیا کرو ۔ اس میں تمہیں برکت ہو گی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 120450,
        "last_updated": null
    },
    {
        "urduURN": 4021250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے وہیب نے بیان کیا ، کہا کہ ہم سے عمرو بن یحییٰ نے بیان کیا ، ان سے عباد بن تمیم انصاری نے اور ان سے عبداللہ بن زید رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، ابراہیم علیہ السلام نے مکہ کو حرام قرار دیا ۔ اور اس کے لیے دعا فرمائی ۔ میں بھی مدینہ کو اسی طرح حرام قرار دیتا ہوں جس طرح ابراہیم علیہ السلام نے مکہ کو حرام قرار دیا تھا ۔ اور اس کے لیے ، اس کے مد اور صاع ( غلہ ناپنے کے دو پیمانے ) کی برکت کے لیے اس طرح دعا کرتا ہوں جس طرح ابراہیم علیہ السلام نے مکہ کے لیے دعا کی تھی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 120460,
        "last_updated": null
    },
    {
        "urduURN": 4021260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "مجھ سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، کہا کہ ہم سے امام مالک نے بیان کیا ، ان سے اسحٰق بن عبداللہ بن ابی طلحہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، اے اللہ ! انہیں ان کے پیمانوں میں برکت دے ، اے اللہ ! انہیں ان کے صاع اور مد میں برکت دے ۔ آپ صلی اللہ علیہ وسلم کی مراد اہل مدینہ تھے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 120470,
        "last_updated": null
    },
    {
        "urduURN": 4021270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے اسحاق بن ابراہیم نے بیان کیا ، کہا کہ ہم کو ولید بن مسلم نے خبر دی ، انہیں اوزاعی نے ، انہیں زہری نے ، انہیں سالم نے ، اور ان سے ان کے باپ نے بیان کیا ، کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں ان لوگوں کو دیکھا جو اناج کے ڈھیر ( بغیر تولے ہوئے محض اندازہ کر کے ) خرید لیتے ان کو مار پڑتی تھی ۔ اس لیے کہ جب تک اپنے گھر نہ لے جائیں نہ بچیں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 120480,
        "last_updated": null
    },
    {
        "urduURN": 4021280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے وہیب نے بیان کیا ، ان سے ابن طاؤس نے ، ان سے ان کے باپ نے ، ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے غلہ پر پوری طرح قبضہ سے پہلے اسے بیچنے سے منع فرمایا ۔ طاؤس نے کہا کہ میں نے ابن عباس رضی اللہ عنہما سے پوچھا کہ ایسا کیوں ہے ؟ تو انہوں نے فرمایا کہ یہ تو روپے کا روپوں کے بدلے بیچنا ہوا جب کہ ابھی غلہ تو میعاد ہی پر دیا جائے گا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 120490,
        "last_updated": null
    },
    {
        "urduURN": 4021290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "مجھ سے ابوالولید نے بیان کیا ، انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے عبداللہ بن دینار نے بیان کیا کہ میں نے حضرت عبداللہ بن عمر رضی اللہ عنہما کو یہ کہتے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو شخص بھی کوئی غلہ خریدے تو اس پر قبضہ کرنے سے پہلے اسے نہ بیچے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 120500,
        "last_updated": null
    },
    {
        "urduURN": 4021300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے علی بن مدینی نے بیان کیا ، کہا کہ ہم سے سفیان نے بیان کیا کہ عمرو بن دینار ان سے بیان کرتے تھے ، اور ان سے زہری نے ، ان سے مالک بن اوس نے ، کہ انہوں نے پوچھا کہ",
        "hadithText": "آپ لوگوں میں سے کوئی بیع صرف ( یعنی دینار ، درہم ، اشرفی وغیرہ بدلنے کا کام ) کرتا ہے ۔ طلحہ نے کہا کہ میں کرتا ہوں ، لیکن اس وقت کر سکوں گا جب کہ ہمارا خزانچی غابہ سے آ جائے گا ۔ سفیان نے بیان کیا کہ زہری سے ہم نے اسی طرح حدیث یاد کی تھی ۔ اس میں کوئی زیادتی نہیں تھی ۔ پھر انہوں نے کہا کہ مجھے مالک بن اوس نے خبر دی کہ انہوں نے عمر بن خطاب رضی اللہ عنہ سے سنا ۔ وہ رسول اللہ صلی اللہ علیہ وسلم سے نقل کرتے تھے کہ آپ صلی اللہ علیہ وسلم نے فرمایا ، سونا سونے کے بدلے میں ( خریدنا ) سود میں داخل ہے مگر یہ کہ نقدا نقد ہو ۔ گیہوں ، گیہوں کے بدلے میں ( خریدنا بیچنا ) سود میں داخل ہے مگر یہ کہ نقدا نقد ہو ، کھجور ، کھجور کے بدلے میں سود ہے مگر یہ کہ نقدا نقد ہو اور جَو ، جَو کے بدلے میں سود ہے مگر یہ کہ نقدا نقد ہو ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 120510,
        "last_updated": null
    },
    {
        "urduURN": 4021310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا کہ ہم سے سفیان نے بیان کیا ، کہا جو کچھ ہم نے عمرو بن دینار سے ( سن کر ) یاد کر رکھا ہے ( وہ یہ ہے کہ ) انہوں نے طاؤس سے سنا ، وہ کہتے تھے کہ",
        "hadithText": "میں نے ابن عباس رضی اللہ عنہما کو یہ فرماتے سنا تھا کہ نبی کریم صلی اللہ علیہ وسلم نے جس چیز سے منع فرمایا تھا ، وہ اس غلہ کی بیع تھی جس پر ابھی قبضہ نہ کیا گیا ہو ، ابن عباس رضی اللہ عنہما نے فرمایا ، میں تو تمام چیزوں کو اسی کے حکم میں سمجھتا ہوں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 120520,
        "last_updated": null
    },
    {
        "urduURN": 4021320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، کہا کہ ہم سے امام مالک نے بیان کیا ، ان سے نافع نے ، ان سے ابن عمر رضی اللہ عنہمانے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جو شخص بھی جب غلہ خریدے تو جب تک اسے پوری طرح قبضہ میں نہ لے لے ، نہ بیچے ۔ اسماعیل نے یہ زیادتی کی ہے کہ جو شخص کوئی غلہ خریدے تو اس پر قبضہ کرنے سے پہلے نہ بیچے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 120530,
        "last_updated": null
    },
    {
        "urduURN": 4021330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث نے بیان کیا ، ان سے یونس نے ، ان سے ابن شہاب نے بیان کیا ، کہ مجھے سالم بن عبداللہ رضی اللہ عنہ نے خبر دی ، ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں دیکھا کہ لوگوں کو اس پر تنبیہ کی جاتی جب وہ غلہ کا ڈھیر خرید کر کے اپنے ٹھکانے پر لانے سے پہلے ہی اس کو بیچ ڈالتے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 120540,
        "last_updated": null
    },
    {
        "urduURN": 4021340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے فروہ بن ابی مغراء نے بیان کیا ، کہا کہ ہم کو علی بن مسہر نے خبر دی ، انہیں ہشام نے ، انہیں ان کے باپ نے ، اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "ایسے دن ( مکی زندگی میں ) بہت ہی کم آئے ، جن میں نبی کریم صلی اللہ علیہ وسلم صبح و شام میں کسی نہ کسی وقت ابوبکر رضی اللہ عنہ کے گھر تشریف نہ لائے ہوں ۔ پھر جب آپ صلی اللہ علیہ وسلم کو مدینہ کی طرف ہجرت کی اجازت دی گئی ، تو ہماری گھبراہٹ کا سبب یہ ہوا کہ آپ ( معمول کے خلاف اچانک ) ظہر کے وقت ہمارے گھر تشریف لائے ۔ جب حضرت ابوبکر رضی اللہ عنہ کو آپ صلی اللہ علیہ وسلم کی آمد کی اطلاع دی گئی تو انہوں نے بھی یہی کہا کہ نبی کریم صلی اللہ علیہ وسلم اس وقت ہمارے یہاں کوئی نئی بات پیش آنے ہی کی وجہ سے تشریف لائے ہیں ۔ جب آپ صلی اللہ علیہ وسلم ابوبکر رضی اللہ عنہ کے پاس پہنچے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس وقت جو لوگ تمہارے پاس ہوں انہیں ہٹا دو ۔ ابوبکر رضی اللہ عنہ نے عرض کیا ، یا رسول اللہ ! یہاں تو صرف میری یہی دو بیٹیاں ہیں یعنی عائشہ اور اسماء رضی اللہ عنہما ۔ اب آپ صلی اللہ علیہ وسلم نے فرمایا کہ تمہیں معلوم بھی ہے مجھے تو یہاں سے نکلنے کی اجازت مل گئی ہے ۔ ابوبکر رضی اللہ عنہ نے عرض کیا میرے پاس دو اونٹنیاں ہیں جنہیں میں نے نکلنے ہی کے لیے تیار کر رکھا تھا ۔ آپ ان میں سے ایک لے لیجئے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اچھا ، قیمت کے بدلے میں ، میں نے ایک اونٹنی لے لی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 120550,
        "last_updated": null
    },
    {
        "urduURN": 4021350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے نافع نے ، اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، کوئی شخص اپنے بھائی کی خریدوفروخت میں دخل اندازی نہ کرے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 120560,
        "last_updated": null
    },
    {
        "urduURN": 4021360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا کہ ہم سے سفیان نے بیان کیا ، ان سے زہری نے بیان کیا ، ان سے سعید بن مسیب نے بیان کیا ، اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے اس سے منع فرمایا کہ کوئی شہری کسی دیہاتی کا مال و اسباب بیچے اور یہ کہ کوئی ( سامان خریدنے کی نیت کے بغیر دوسرے اصل خریداروں سے ) بڑھ کر بولی نہ دے ۔ اسی طرح کوئی شخص اپنے بھائی کے سودے میں مداخلت نہ کرے ۔ کوئی شخص ( کسی عورت کو ) دوسرے کے پیغام نکاح ہوتے ہوئے اپنا پیغام نہ بھیجے ۔ اور کوئی عورت اپنی کسی دینی بہن کو اس نیت سے طلاق نہ دلوائے کہ اس کے حصہ کو خود حاصل کر لے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 120570,
        "last_updated": null
    },
    {
        "urduURN": 4021370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے بشیر بن محمد نے بیان کیا ، کہا کہ ہم کو عبداللہ بن مبارک نے خبر دی ، انہیں حسین مکتب نے خبر دی ، انہیں عطاء  بن ابی رباح نے اور انہیں جابر بن عبداللہ رضی اللہ عنہما نے کہ",
        "hadithText": "ایک شخص نے اپنا ایک غلام اپنے مرنے کے بعد کی شرط کے ساتھ آزاد کیا ۔ لیکن اتفاق سے وہ شخص مفلس ہو گیا ، تو نبی کریم صلی اللہ علیہ وسلم نے اس کے غلام کو لے کر فرمایا کہ اسے مجھ سے کون خریدے گا ۔ اس پر نعیم بن عبداللہ رضی اللہ عنہ نے اسے اتنی اتنی قیمت پر خرید لیا اور آپ صلی اللہ علیہ وسلم نے غلام ان کے حوالہ کر دیا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 120580,
        "last_updated": null
    },
    {
        "urduURN": 4021380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، کہا کہ ہم سے امام مالک نے بیان کیا ، ان سے نافع نے ، اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے «نجش» ( فریب ، دھوکہ ) سے منع فرمایا تھا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 120590,
        "last_updated": null
    },
    {
        "urduURN": 4021390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہیں امام مالک نے خبر دی ، انہیں نافع نے ، اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے حمل کے حمل کی بیع سے منع فرمایا ۔ اس بیع کا طریقہ جاہلیت میں رائج تھا ۔ ایک شخص ایک اونٹ یا اونٹنی خریدتا اور قیمت دینے کی میعاد یہ مقرر کرتا کہ ایک اونٹنی جنے پھر اس کے پیٹ کی اونٹنی بڑی ہو کر جنے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 120600,
        "last_updated": null
    },
    {
        "urduURN": 4021400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے سعید بن عفیر نے بیان کیا ، کہا کہ مجھ سے لیث بن سعد نے بیان کیا ، کہا کہ مجھ سے عقیل نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، کہ مجھے عامر بن سعید نے خبر دی ، اور انہیں ابو سعید خدری رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے منابذہ کی بیع سے منع فرمایا تھا ۔ اس کا طریقہ یہ تھا کہ ایک آدمی بیچنے کے لیے اپنا کپڑا دوسرے شخص کی طرف ( جو خریدار ہوتا ) پھینکتا اور اس سے پہلے کہ وہ اسے الٹے پلٹے یا اس کی طرف دیکھے ( صرف پھینک دینے کی وجہ سے وہ بیع لازم سمجھی جاتی تھی ) اسی طرح آنحضرت صلی اللہ علیہ وسلم نے بیع ملامسۃ سے بھی منع فرمایا ۔ اس کا یہ طریقہ تھا کہ ( خریدنے والا ) کپڑے کو بغیر دیکھے صرف اسے چھو دیتا ( اور اسی سے بیع لازم ہو جاتی تھی اسے بھی دھوکہ کی بیع قرار دیا گیا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 120610,
        "last_updated": null
    },
    {
        "urduURN": 4021410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے قتبیہ نے بیان کیا ، کہا کہ ہم سے عبدالوہاب نے بیان کیا ، ان سے محمد بن سیرین نے ، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "دو طرح کے لباس پہننے منع ہیں ۔ کہ کوئی آدمی ایک ہی کپڑے میں گوٹ مار کر بیٹھے ، پھر اسے مونڈے پر اٹھا کر ڈال لے ( اور شرمگاہ کھلی رہے ) اور دو طرح کی بیع سے منع کیا ایک بیع ملامسۃ سے اور دوسری بیع منابذہ سے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 120620,
        "last_updated": null
    },
    {
        "urduURN": 4021420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے اسماعیل بن اویس نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے محمد بن یحییٰ بن حبان نے اور ابوالزناد نے ، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے بیع ملامسۃ اور بیع منابذہ سے منع فرمایا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 120630,
        "last_updated": null
    },
    {
        "urduURN": 4021430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عیاش بن ولید نے بیان کیا ، ان سے عبدالاعلیٰ نے بیان کیا ، ان سے معمر نے بیان کیا ، ان سے زہری نے ، ان سے عطاء بن یزید نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے دو طرح کے لباس سے منع فرمایا ، اور دو طرح کی بیع ، بیع ملامسۃ اور بیع منابذہ سے منع فرمایا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 120640,
        "last_updated": null
    },
    {
        "urduURN": 4021440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ ہم سے لیث بن سعد نے بیان کیا ، ان سے جعفر بن ربیعہ نے ، ان سے عبدالرحمٰن بن ہرمز اعرج نے ، ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( بیچنے کے لیے ) اونٹنی اور بکری کے تھنوں میں دودھ کو روک کر نہ رکھو ۔ اگر کسی نے ( دھوکہ میں آ کر ) کوئی ایسا جانور خرید لیا تو اسے دودھ دوہنے کے بعد دونوں اختیارات ہیں چاہے تو جانور کو رکھ لے ، اور چاہے تو واپس کر دے ۔ اور ایک صاع کھجور اس کے ساتھ دودھ کے بدل دیدے ۔ ابوصالح ، مجاہد ، ولید بن رباح اور موسیٰ بن یسار سے بواسطہ ابوہریرہ رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم سے روایت ایک صاع کھجور ہی کی ہے ۔ بعض راویوں نے ابن سیرین سے ایک صاع کھجور کی روایت کی ہے اور یہ کہ خریدار کو ( صورت مذکورہ میں ) تین دن کا اختیار ہو گا ۔ اگرچہ بعض دوسرے راویوں نے ابن سیرین ہی سے ایک صاع کھجور کی بھی روایت کی ہے ، لیکن تین دن کے اختیار کا ذکر نہیں کیا اور ( تاوان میں ) کھجور دینے کی روایات ہی زیادہ ہیں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 120650,
        "last_updated": null
    },
    {
        "urduURN": 4021450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے معمتر نے بیان کیا ، کہا کہ میں نے اپنے باپ سے سنا ، وہ کہتے تھے کہ ہم سے ابوعثمان نے بیان کیا اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے کہا کہ",
        "hadithText": "جو شخص «مصراة» بکری خریدے اور اسے واپس کرنا چاہے تو ( اصل مالک کو ) اس کے ساتھ ایک صاع بھی دے ۔ اور نبی کریم صلی اللہ علیہ وسلم نے قافلہ والوں سے ( جو مال بیچنے لائیں ) آگے بڑھ کر خریدنے سے منع فرمایا ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 120660,
        "last_updated": null
    },
    {
        "urduURN": 4021460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں ابوالزناد نے ، انہیں اعرج نے ، اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ( تجارتی ) قافلوں کی پیشوائی ( ان کا سامان شہر پہنچے سے پہلے ہی خرید لینے کی غرض سے ) نہ کرو ۔ ایک شخص کسی دوسرے کی بیع پر بیع نہ کرے اور کوئی «نجش» (دھوکہ فریب ) نہ کرے اور کوئی شہری ، بدوی کا مال نہ بیچے اور بکری کے تھن میں دودھ نہ روکے ۔ لیکن اگر کوئی اس ( آخری ) صورت میں جانور خرید لے تو اسے دوہنے کے بعد دونوں طرح کے اختیارات ہیں ۔ اگر وہ اس بیع پر راضی ہے تو جانور کو روک سکتا ہے اور اگر وہ راضی نہیں تو ایک صاع کھجور اس کے ساتھ دے کر اسے واپس کر دے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 120670,
        "last_updated": null
    },
    {
        "urduURN": 4021470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن عمرو نے بیان کیا ، کہا کہ ہم سے مکی بن ابراہیم نے بیان کیا ، انہیں ابن جریج نے خبر دی ، کہا کہ مجھے زیادنے خبر دی کہ عبدالرحمٰن بن زید کے غلام ثابت نے انہیں خبر دی ، کہ انہوں نے ابوہریرہ رضی اللہ عنہ کو یہ کہتے سنا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس شخص نے «مصراة» بکری خریدی اور اسے دوہا ۔ تو اگر وہ اس معاملہ پر راضی ہے تو اسے اپنے لیے روک لے اور اگر راضی نہیں ہے تو ( واپس کر دے اور ) اس کے دودھ کے بدلے میں ایک صاع کھجور دیدے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 120680,
        "last_updated": null
    },
    {
        "urduURN": 4021480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، کہا کہ مجھے سعید مقبری نے خبر دی ، ان سے ان کے باپ نے ، اور انہوں نے ابوہریرہ رضی اللہ عنہ کو یہ کہتے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب کوئی باندی زنا کرے اور اس کے زنا کا ثبوت ( شرعی ) مل جائے تو اسے کوڑے لگوائے ، پھر اس کی لعنت ملامت نہ کرے ۔ اس کے بعد اگر پھر وہ زنا کرے تو پھر کوڑے لگوائے مگر پھر لعنت ملامت نہ کرے ۔ پھر اگر تیسری مرتبہ بھی زنا کرے تو اسے بیچ دے چاہے بال کی ایک رسی کے بدلہ ہی میں کیوں نہ ہو ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 120690,
        "last_updated": null
    },
    {
        "urduURN": 4021490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، کہا کہ مجھ سے امام مالک رحمہ اللہ نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عبیداللہ بن عبداللہ نے اور ان سے ابوہریرہ رضی اللہ عنہ اور زید بن خالد رضی اللہ عنہ نے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم سے پوچھا گیا کہ اگر کوئی غیر شادی شدہ باندی زنا کرے ( تو اس کا کیا حکم ہے ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے کوڑے لگاؤ ۔ اگر پھر زنا کرے تو پھر کوڑے لگاؤ ۔ پھر بھی اگر زنا کرے تو اسے بیچ دو ، اگرچہ ایک رسی ہی کے بدلے میں وہ فروخت ہو ۔ ابن شہاب نے کہا کہ مجھے یہ معلوم نہیں کہ ( بیچنے کے لیے ) آپ صلی اللہ علیہ وسلم نے تیسری مرتبہ فرمایا تھا یا چوتھی مرتبہ ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 120700,
        "last_updated": null
    },
    {
        "urduURN": 4021500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہمیں شعیب نے خبر دی ، انہیں زہری نے ، ان سے عروہ بن زبیر رضی اللہ عنہ نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم تشریف لائے تو میں نے آپ صلی اللہ علیہ وسلم سے ( بریرہ رضی اللہ عنہا کے خریدنے کا ) ذکر کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا تم خرید کر آزاد کر دو ۔ ولاء تو اسی کی ہوتی ہے جو آزاد کرے ۔ پھر آپ صلی اللہ علیہ وسلم منبر پر تشریف لائے اور فرمایا ” لوگوں کو کیا ہو گیا ہے کہ ( خریدوفروخت میں ) ایسی شرطیں لگاتے ہیں جن کی کوئی اصل کتاب اللہ میں نہیں ہے جو شخص بھی کوئی ایسی شرط لگائے گا جس کی اصل کتاب اللہ میں نہ ہو وہ شرط باطل ہو گی ۔ خواہ سو شرطیں ہی کیوں نہ لگا لے کیونکہ اللہ ہی کی شرط حق اور مضبوط ہے ( اور اسی کا اعتبار ہے ) ۔ “</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 120710,
        "last_updated": null
    },
    {
        "urduURN": 4021510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے حسان بن ابی عباد نے بیان کیا ، کہا کہ ہم سے ہمام نے بیان کیا ، کہا کہ میں نے نافع سے سنا ، وہ عبداللہ بن عمر رضی اللہ عنہما سے روایت کرتے تھے کہ",
        "hadithText": "حضرت عائشہ رضی اللہ عنہا ، بریرہ رضی اللہ عنہا کی ( جو باندی تھیں ) قیمیت لگا رہی تھیں ( تاکہ انہیں خرید کر آزاد کر دیں ) کہ نبی کریم صلی اللہ علیہ وسلم نماز کے لیے ( مسجد میں ) تشریف لے گئے ۔ پھر جب آپ صلی اللہ علیہ وسلم تشریف لائے تو عائشہ رضی اللہ عنہا نے کہا کہ ( بریرہ رضی اللہ عنہا کے مالکوں نے تو ) اپنے لیے ولاء کی شرط کے بغیر انہیں بیچنے سے انکار کر دیا ہے ۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ولاء تو اسی کی ہوتی ہے جو آزاد کرے ۔ میں نے نافع سے پوچھا کہ بریرہ رضی اللہ عنہا کے شوہر آزاد تھے یا غلام ، تو انہوں نے فرمایا کہ مجھے معلوم نہیں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 120720,
        "last_updated": null
    },
    {
        "urduURN": 4021520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، ان سے سفیان نے ، ان سے اسماعیل نے ، ان سے قیس نے ، انہوں نے جریر رضی اللہ عنہ سے یہ سنا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے اس بات کی شہادت پر کہ اللہ کے سوا کوئی معبود نہیں اور محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں ۔ اور نماز قائم کرنے اور زکوٰۃ دینے اور ( اپنے مقررہ امیر کی بات ) سننے اور اس کی اطاعت کرنے پر اور ہر مسلمان کے ساتھ خیر خواہی کرنے کی بیعت کی تھی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 120730,
        "last_updated": null
    },
    {
        "urduURN": 4021530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے صلت بن محمد نے بیان کیا ، کہا کہ ہم سے عبدالواحد نے بیان کیا ، کہا کہ ہم سے معمر نے بیان کیا ، ان سے عبداللہ بن طاؤس نے ، ان سے ان کے باپ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( تجارتی ) قافلوں سے آگے جا کر نہ ملا کرو ( ان کو منڈی میں آنے دو ) اور کوئی شہری ، کسی دیہاتی کا سامان نہ بیچے ، انہوں نے بیان کیا کہ اس پر میں نے ابن عباس رضی اللہ عنہما سے پوچھا کہ حضور اکرم صلی اللہ علیہ وسلم کے اس ارشاد کا کہ ” کوئی شہری کسی دیہاتی کا مال نہ بیچے “ کا مطلب کیا ہے ؟ تو انہوں نے فرمایا کہ مطلب یہ ہے کہ اس کا دلال نہ بنے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 120740,
        "last_updated": null
    },
    {
        "urduURN": 4021540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "مجھ سے عبداللہ بن صباح نے بیان کیا ، کہا کہ ہم سے ابوعلی حنفی نے بیان کیا ، ان سے عبدالرحمٰن بن عبداللہ بن دینار نے بیان کیا ، کہا کہ مجھ سے میرے والد نے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے اس سے منع فرمایا کہ کوئی شہری ، کسی دیہاتی کا مال بیچے ۔ یہی ابن عباس رضی اللہ عنہما نے بھی کہا ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 120750,
        "last_updated": null
    },
    {
        "urduURN": 4021550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے مکی بن ابراہیم نے بیان کیا ، کہا کہ مجھے ابن جریج نے خبر دی ، انہیں ابن شہاب نے ، انہیں سعید بن مسیب نے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، کوئی شخص اپنے کسی بھائی کے مول پر مول نہ کرے اور کوئی «نجش» (دھوکہ ، فریب ) نہ کرے ، اور نہ کوئی شہری ، کسی دیہاتی کے لیے بیچے یا مول لے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 120760,
        "last_updated": null
    },
    {
        "urduURN": 4021560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا کہ ہم سے معاذ بن معاذ نے بیان کیا ، ان سے عبداللہ بن عون نے بیان کیا ، ان سے محمد بن سیرین نے کہ انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہمیں اس سے روکا گیا کہ کوئی شہری کسی دیہاتی کا مال تجارت بیچے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 120770,
        "last_updated": null
    },
    {
        "urduURN": 4021570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے عبدالوہاب نے بیان کیا ، ان سے عبیداللہ عمری نے بیان کیا ، ان سے سعید بن ابی سعید نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ( تجارتی قافلوں سے ) آگے بڑھ کر ملنے سے منع فرمایا ہے اور بستی والوں کو باہر والوں کا مال بیچنے سے بھی منع فرمایا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 113,
        "matchingArabicURN": 120780,
        "last_updated": null
    },
    {
        "urduURN": 4021580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "مجھ سے عیاش بن عبدالولید نے بیان کیا ، کہا کہ ہم سے عبدالاعلیٰ نے بیان کیا ، کہا کہ ہم سے معمر نے بیان کیا ، ان سے ابن طاؤس نے ، ان سے ان کے باپ نے بیان کیا کہ میں نے ابن عباس رضی اللہ عنہما سے پوچھا کہ",
        "hadithText": "آنحضرت صلی اللہ علیہ وسلم کے اس ارشاد کا مطلب کیا ہے کہ کوئی شہری کسی دیہاتی کا مال نہ بیچے ؟ تو انہوں نے کہا کہ مطلب یہ ہے کہ اس کا دلال نہ بنے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 114,
        "matchingArabicURN": 120790,
        "last_updated": null
    },
    {
        "urduURN": 4021590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے یزید بن زریع نے بیان کیا ، کہ ہم سے تیمی نے بیان کیا ، ان سے ابوعثمان نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جو کوئی دودھ جمع کی ہوئی بکری خریدے ( وہ بکری پھیر دے ) اور اس کے ساتھ ایک صاع دیدے اور آنحضرت صلی اللہ علیہ وسلم نے قافلہ والوں سے آگے بڑھ کر ملنے سے منع فرمایا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 115,
        "matchingArabicURN": 120800,
        "last_updated": null
    },
    {
        "urduURN": 4021600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک رحمہ اللہ نے خبر دی ، انہیں نافع نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کوئی شخص کسی دوسرے کی بیع پر بیع نہ کرے اور جو مال باہر سے آ رہا ہو اس سے آگے جا کر نہ ملے جب تک وہ بازار میں نہ آئے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 116,
        "matchingArabicURN": 120810,
        "last_updated": null
    },
    {
        "urduURN": 4021610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے جویریہ نے بیان کیا ، ان سے نافع نے اور ان سے عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم آگے قافلوں کے پاس خود ہی پہنچ جایا کرتے تھے اور ( شہر میں پہنچنے سے پہلے ہی ) ان سے غلہ خرید لیا کرتے ، لیکن نبی کریم صلی اللہ علیہ وسلم نے ہمیں اس بات سے منع فرمایا کہ ہم اس مال کو اسی جگہ بیچیں جب تک اناج کے بازار میں نہ لائیں ۔ امام بخاری رحمہ اللہ نے کہا کہ عبداللہ بن عمر رضی اللہ عنہما کا یہ ملنا بازار کے بلند کنارے پر تھا ۔ ( جدھر سے سوداگر آیا کرتے تھے ) اور یہ بات عبیداللہ کی حدیث سے نکلتی ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 117,
        "matchingArabicURN": 120820,
        "last_updated": null
    },
    {
        "urduURN": 4021620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے یحییٰ بن قطان نے بیان کیا ، ان سے عبیداللہ نے ، کہا کہ مجھ سے نافع نے بیان کیا ، اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "لوگ بازار کی بلند جانب جا کر غلہ خریدتے اور وہیں بیچنے لگتے ۔ اس لیے رسول اللہ صلی اللہ علیہ وسلم نے اس سے منع فرمایا کہ غلہ وہاں نہ بیچیں جب تک اس کو اٹھوا کر دوسری جگہ نہ لے جائیں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 118,
        "matchingArabicURN": 120830,
        "last_updated": null
    },
    {
        "urduURN": 4021630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں ہشام بن عروہ نے ، انہیں ان کے باپ عروہ نے ، اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میرے پاس بریرہ رضی اللہ عنہا ( جو اس وقت تک باندی تھیں ) آئیں اور کہنے لگیں کہ میں نے اپنے مالکوں سے نو اوقیہ چاندی پر کتابت کر لی ہے ۔ شرط یہ ہوئی ہے کہ ہر سال ایک اوقیہ چاندی انہیں دیا کروں ۔ اب آپ بھی میری کچھ مدد کیجئے ۔ اس پر میں نے اس سے کہا کہ اگر تمہارے مالک یہ پسند کریں کہ یک مشت ان کا سب روپیہ میں ان کے لیے ( ابھی ) مہیا کر دوں اور تمہارا ترکہ میرے لیے ہو تو میں ایسا بھی کر سکتی ہوں ۔ بریرہ رضی اللہ عنہا اپنے مالکوں کے پاس گئیں ۔ اور عائشہ رضی اللہ عنہا کی تجویز ان کے سامنے رکھی ۔ لیکن انہوں نے اس سے انکار کیا ، پھر بریرہ رضی اللہ عنہا ان کے یہاں واپس آئیں تو رسول اللہ صلی اللہ علیہ وسلم ( عائشہ رضی اللہ عنہا کے یہاں ) بیٹھے ہوئے تھے ۔ انہوں نے کہا کہ میں نے تو آپ کی صورت ان کے سامنے رکھی تھی مگر وہ نہیں مانتے بلکہ کہتے ہیں کہ ترکہ تو ہمارا ہی رہے گا ۔ آنحضرت صلی اللہ علیہ وسلم نے یہ بات سنی اور عائشہ رضی اللہ عنہا نے بھی آپ کو حقیقت حال سے خبر کی ۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ بریرہ کو تم لے لو اور انہیں ترکہ کی شرط لگانے دو ۔ ترکہ تو اسی کا ہوتا ہے جو آزاد کرئے ۔ عائشہ رضی اللہ عنہا نے ایسا ہی کیا ۔ پھر نبی کریم صلی اللہ علیہ وسلم اٹھ کر لوگوں کے مجمع میں تشریف لے گئے اور اللہ کی حمد و ثنا کے بعد فرمایا ، امابعد ! کچھ لوگوں کو کیا ہو گیا ہے کہ وہ ( خریدوفروخت میں ) ایسی شرطیں لگاتے ہیں جن کی کتاب اللہ میں کوئی اصل نہیں ہے ۔ جو کوئی شرط ایسی لگائی جائے جس کی اصل کتاب اللہ میں نہ ہو وہ باطل ہو گی ۔ خواہ ایسی سو شرطیں کوئی کیوں نہ لگائے ۔ اللہ تعالیٰ کا حکم سب پر مقدم ہے اور اللہ کی شرط ہی بہت مضبوط ہے اور ولاء تو اسی کی ہوتی ہے جو آزاد کرے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 119,
        "matchingArabicURN": 120840,
        "last_updated": null
    },
    {
        "urduURN": 4021640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک رحمہ اللہ نے خبر دی ، انہیں نافع نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "ام المؤمنین حضرت عائشہ رضی اللہ عنہا نے چاہا کہ ایک باندی کو خرید کر آزاد کر دیں ، لیکن ان کے مالکوں نے کہا کہ ہم انہیں اس شرط پر آپ کو بیچ سکتے ہیں کہ ان کی ولاء ہمارے ساتھ رہے ۔ اس کا ذکر جب عائشہ رضی اللہ عنہا نے رسول اللہ صلی اللہ علیہ وسلم کے سامنے کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس شرط کی وجہ سے تم قطعاً نہ رکو ۔ ولاء تو اسی کی ہوتی ہے جو آزاد کرے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 120,
        "matchingArabicURN": 120850,
        "last_updated": null
    },
    {
        "urduURN": 4021650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے مالک بن اوس نے ، انہوں نے حضرت عمر رضی اللہ عنہ سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، گیہوں کو گیہوں کے بدلہ میں بیچنا سود ہے ، لیکن یہ کہ سودا ہاتھوں ہاتھ ہو ۔ جَو کو جَو کے بدلہ میں بیچنا سود ہے ، لیکن یہ کہ ہاتھوں ہاتھ ہو ۔ اور کھجور کو کھجور کے بدلہ میں بیچنا سود ہے لیکن یہ کہ سودا ہاتھوں ہاتھ ، نقدا نقد ہو ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 121,
        "matchingArabicURN": 120860,
        "last_updated": null
    },
    {
        "urduURN": 4021660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، کہا کہ ہم سے امام مالک نے بیان کیا ، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے مزابنہ سے منع فرمایا ، مزابنہ یہ کہ درخت پر لگی ہوئی کھجور خشک کھجور کے بدلہ ماپ کر کے بیچی جائے ۔ اسی طرح بیل پر لگے ہوئے انگور کو منقیٰ کے بدل بیچنا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 122,
        "matchingArabicURN": 120870,
        "last_updated": null
    },
    {
        "urduURN": 4021670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابوالنعمان نے بیان کیا ، کہا کہ ہم سے حماد بن زید نے ، ان سے ایوب نے ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے مزابنہ سے منع فرمایا ۔ انہوں نے بیان کیا کہ مزابنہ یہ ہے کہ کوئی شخص درخت پر کی کھجور سوکھی کھجور کے بدل ماپ تول کر بیچے ۔ اور خریدار کہے اگر درخت کا پھل اس سوکھے پھل سے زیادہ نکلے تو وہ اس کا ہے اور کم نکلے تو وہ نقصان بھر دے گا ۔ \n<span class=urdu_sanad>عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا ، کہ مجھ سے زید بن ثابت رضی اللہ عنہ نے بیان کیا کہ</span> نبی کریم صلی اللہ علیہ وسلم نے مجھے عرایا کی اجازت دے دی تھی جو اندازے ہی سے بیع کی ایک صورت ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 123,
        "matchingArabicURN": 120881,
        "last_updated": null
    },
    {
        "urduURN": 4021690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں ابن شہاب نے ، اور انہیں مالک بن اوس رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "انہیں سو اشرفیاں بدلنی تھیں ۔ ( انہوں نے بیان کیا کہ ) پھر مجھے طلحہ بن عبیداللہ رضی اللہ عنہما نے بلایا ۔ اور ہم نے ( اپنے معاملہ کی ) بات چیت کی ۔ اور ان سے میرا معاملہ طے ہو گیا ۔ وہ سونے ( اشرفیوں ) کو اپنے ہاتھ میں لے کر الٹنے پلٹنے لگے اور کہنے لگے کہ ذرا میرے خزانچی کو غابہ سے آ لینے دو ۔ عمر رضی اللہ عنہ بھی ہماری باتیں سن رہے تھے ، آپ نے فرمایا خدا کی قسم ! جب تک تم طلحہ سے روپیہ لے نہ لو ، ان سے جدا نہ ہونا کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے کہ سونا سونے کے بدلہ میں اگر نقد نہ ہو تو سود ہو جاتا ہے ۔ گیہوں ، گیہوں کے بدلے میں اگر نقد نہ ہو تو سود ہو جاتا ہے ۔ جَو ، جَو کے بدلہ میں اگر نقد نہ ہو تو سود ہو جاتا ہے اور کھجور ، کھجور کے بدلہ میں اگر نقد نہ ہو تو سود ہو جاتی ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 124,
        "matchingArabicURN": 120900,
        "last_updated": null
    },
    {
        "urduURN": 4021700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے صدقہ بن فضل نے بیان کیا ، انہوں نے کہا کہ ہم کو اسماعیل بن علیہ نے خبر دی ، کہا کہ مجھے یحییٰ بن ابی اسحاق نے خبر دی ، ان سے عبدالرحمٰن بن ابی بکرہ نے بیان کیا ، ان سے ابوبکرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، سونا سونے کے بدلے میں اس وقت تک نہ بیچو جب تک ( دونوں طرف سے ) برابر برابر ( کی لین دین ) نہ ہو ۔ اسی طرح چاندی ، چاندی کے بدلہ میں اس وقت تک نہ بیچو جب تک ( دونوں طرف سے ) برابر برابر نہ ہو ۔ البتہ سونا ، چاندی کے بدل اور چاندی سونے کے بدل میں جس طرح چاہو بیچو ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 125,
        "matchingArabicURN": 120910,
        "last_updated": null
    },
    {
        "urduURN": 4021710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبیداللہ بن سعد نے بیان کیا ، کہا کہ مجھ سے میرے چچا نے بیان کیا ، کہا ہم سے زہری کے بھتیجے نے بیان کیا ، ان سے ان کے چچا نے بیان کیا کہ مجھ سے سالم بن عبداللہ رضی اللہ عنہ نے بیان کیا ، ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ ابو سعید خدری رضی اللہ عنہ نے اسی طرح ایک حدیث رسول اللہ صلی اللہ علیہ وسلم کے حوالہ سے بیان کی",
        "hadithText": "( جیسے ابوبکرہ رضی اللہ عنہ یا حضرت عمر رضی اللہ عنہ سے گزری ) پھر ایک مرتبہ عبداللہ بن عمر رضی اللہ عنہما کی ان سے ملاقات ہوئی تو انہوں نے پوچھا ، اے ابوسعید ! آپ رسول اللہ صلی اللہ علیہ وسلم کے حوالہ سے یہ کون سی حدیث بیان کرتے ہیں ؟ ابو سعید خدری رضی اللہ عنہ نے فرمایا کہ حدیث بیع صرف ( یعنی روپیہ اشرفیاں بدلنے یا تڑوانے ) سے متعلق ہے ۔ میں نے رسول اللہ صلی اللہ علیہ وسلم کا فرمان سنا تھا کہ سونا سونے کے بدلے میں برابر برابر ہی بیچا جا سکتا ہے اور چاندی ، چاندی کے بدلہ میں برابر برابر ہی بیچی جا سکتی ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 126,
        "matchingArabicURN": 120920,
        "last_updated": null
    },
    {
        "urduURN": 4021720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں نافع نے اور انہیں ابو سعید خدری رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، سونا سونے کے بدلے اس وقت تک نہ بیچو جب تک دونوں طرف سے برابر برابر نہ ہو ، دونوں طرف سے کسی کمی یا زیادتی کو روا نہ رکھو ، اور چاندی کو چاندی کے بدلے میں اس وقت تک نہ بیچو جب تک دونوں طرف سے برابر برابر نہ ہو ۔ دونوں طرف سے کسی کمی یا زیادتی کو روا نہ رکھو اور نہ ادھار کو نقد کے بدلے میں بیچو ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 127,
        "matchingArabicURN": 120930,
        "last_updated": null
    },
    {
        "urduURN": 4021730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا کہ ہم سے ضحاک بن مخلد نے بیان کیا ، کہا کہ ہم سے ابن جریج نے بیان کیا ، کہا کہ مجھے عمرو بن دینار نے خبر دی ، انہیں ابوصالح زیات نے خبر دی ، اور انہوں نے ابو سعید خدری رضی اللہ عنہ کو یہ کہتے سنا کہ",
        "hadithText": "دینار ، دینار کے بدلے میں اور درہم ، درہم کے بدلے میں ( بیچا جا سکتا ہے ) اس پر میں نے ان سے کہا کہ ابن عباس رضی اللہ عنہما تو اس کی اجازت نہیں دیتے ۔ ابوسعید رضی اللہ عنہ نے بیان کیا کہ پھر میں نے ابن عباس رضی اللہ عنہما سے اس کے متعلق پوچھا کہ آپ نے یہ نبی کریم صلی اللہ علیہ وسلم سے سنا تھا یا کتاب اللہ میں آپ نے اسے پایا ہے ؟ انہوں نے کہا کہ ان میں سے کسی بات کا میں دعویدار نہیں ہوں ۔ رسول اللہ صلی اللہ علیہ وسلم ( کی احادیث ) کو آپ لوگ مجھ سے زیادہ جانتے ہیں ۔ البتہ مجھے اسامہ رضی اللہ عنہ نے خبر دی تھی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ( مذکورہ صورتوں میں ) سود صرف ادھار کی صورت میں ہوتا ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 128,
        "matchingArabicURN": 120941,
        "last_updated": null
    },
    {
        "urduURN": 4021740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا کہ مجھے حبیب بن ابی ثابت نے خبر دی ، کہا کہ میں نے ابوالمنہال سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نے براء بن عازب اور زید بن ارقم رضی اللہ عنہما سے بیع صرف کے متعلق پوچھا تو ان دونوں حضرات نے ایک دوسرے کے متعلق فرمایا کہ یہ مجھ سے بہتر ہیں ۔ آخر دونوں حضرات نے بتلایا کہ رسول اللہ صلی اللہ علیہ وسلم نے سونے کو چاندی کے بدلے میں ادھار کی صورت میں بیچنے سے منع فرمایا ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 129,
        "matchingArabicURN": 120960,
        "last_updated": null
    },
    {
        "urduURN": 4021750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عمران بن میسرہ نے بیان کیا ، کہا کہ ہم سے عباد بن عوام نے ، کہا کہ ہم کو یحییٰ بن ابی اسحٰق نے خبر دی ، ان سے عبدالرحمٰن بن ابی بکرہ رضی اللہ عنہ نے بیان کیا ، اور ان سے ان کے باپ حضرت ابوبکرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے چاندی ، چاندی کے بدلے میں اور سونا سونے کے بدلے میں بیچنے سے منع فرمایا ہے ۔ مگر یہ کہ برابر برابر ہو ۔ البتہ سونا چاندی کے بدلے میں جس طرح چاہیں خریدیں ۔ اسی طرح چاندی سونے کے بدلے جس طرح چاہیں خریدیں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 130,
        "matchingArabicURN": 120970,
        "last_updated": null
    },
    {
        "urduURN": 4021760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا اور ان سے عقیل نے ، ان سے ابن شہاب نے ، انہیں سالم بن عبداللہ نے خبر دی ، اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، پھل ( درخت پر کا ) اس وقت تک نہ بیچو جب تک اس کا پکا ہونا نہ کھل جائے ۔ اور درخت پر لگی ہوئی کھجور کو خشک کھجور کے بدلے میں نہ بیچو ۔ \n<span class=urdu_sanad>سالم نے بیان کیا کہ مجھے عبداللہ رضی اللہ عنہ نے خبر دی ، اور انہیں زید بن ثابت رضی اللہ عنہ نے کہ</span> بعد میں رسول اللہ صلی اللہ علیہ وسلم نے بیع عریہ کی تر یا خشک کھجور کے بدلہ میں اجازت دے دی تھی لیکن اس کے سوا کسی صورت کی اجازت نہیں دی تھی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 131,
        "matchingArabicURN": 120981,
        "last_updated": null
    },
    {
        "urduURN": 4021780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا کہ ہم کو امام مالک نے خبر دی ، انہیں نافع نے ، انہیں عبداللہ بن عمر رضی اللہ عنہمانے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے مزابنہ سے منع فرمایا ، مزابنہ درخت پر لگی ہوئی کھجور کو ٹوٹی ہوئی کھجور کے بدلے ناپ کر اور درخت کے انگور کو خشک انگور کے بدلے میں ناپ کر بیچنے کو کہتے ہیں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 132,
        "matchingArabicURN": 121000,
        "last_updated": null
    },
    {
        "urduURN": 4021790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا کہ ہم کو امام مالک نے خبر دی ، انہیں داؤد بن حصین نے ، انہیں ابن ابی احمد کے غلام ابوسفیان نے اور انہیں ابو سعید خدری رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے مزابنہ اور محاقلہ سے منع فرمایا ، مزابنہ درخت پر لگی کھجور ، توڑی ہوئی کھجور کے بدلے میں خریدنے کو کہتے ہیں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 133,
        "matchingArabicURN": 121010,
        "last_updated": null
    },
    {
        "urduURN": 4021800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے معاویہ نے بیان کیا ، ان سے شیبانی نے ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے محاقلہ اور مزابنہ سے منع فرمایا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 134,
        "matchingArabicURN": 121020,
        "last_updated": null
    },
    {
        "urduURN": 4021810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، کہا کہ ہم سے امام مالک نے بیان کیا ، ان سے نافع نے ، ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے صاحب عریہ کو اس کی اجازت دی کہ اپنا عریہ اس کے اندازے برابر میوے کے بدل بیچ ڈالے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 135,
        "matchingArabicURN": 121030,
        "last_updated": null
    },
    {
        "urduURN": 4021820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے یحییٰ بن سلیمان نے بیان کیا کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا ، انہیں ابن جریج نے خبر دی ، انہیں عطاء اور ابوزبیر نے اور انہیں جابر رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے کھجور کے پکنے سے پہلے بیچنے سے منع کیا ہے اور یہ کہ اس میں سے ذرہ برابر بھی درہم و دینا کے سوا کسی اور چیز ( سوکھے پھل ) کے بدلے نہ بیچی جائے البتہ عریہ کی اجازت دی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 136,
        "matchingArabicURN": 121040,
        "last_updated": null
    },
    {
        "urduURN": 4021830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ، انہوں نے کہا کہ میں نے امام مالک سے سنا ، ان سے عبیداللہ بن ربیع نے پوچھا کہ کیا آپ سے داؤد نے سفیان سے اور انہوں نے ابوہریرہ رضی اللہ عنہ سے یہ حدیث بیان کی تھی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے پانچ وسق یا اس سے کم میں بیع عریہ کی اجازت دے دی ہے ؟ تو انہوں نے کہا کہ ہاں !</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 137,
        "matchingArabicURN": 121050,
        "last_updated": null
    },
    {
        "urduURN": 4021840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا کہ یحییٰ بن سعید نے بیان کیا کہ میں نے بشیر سے سنا ، انہوں نے بیان کیا کہ میں نے سہل بن ابی حثمہ رضی اللہ عنہ سے سنا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے درخت پر لگی ہوئی کھجور کو توڑی ہوئی کھجور کے بدلے بیچنے سے منع فرمایا ، البتہ عریہ کی آپ صلی اللہ علیہ وسلم نے اجازت دی کہ اندازہ کر کے یہ بیع کی جا سکتی ہے کہ عریہ والے اس کے بدل تازہ کھجور کھائیں ۔ سفیان نے دوسری مرتبہ یہ روایت بیان کی ، لیکن آنحضرت صلی اللہ علیہ وسلم نے عریہ کی اجازت دے دی تھی ۔ کہ اندازہ کر کے یہ بیع کی جا سکتی ہے ، کھجور ہی کے بدلے میں ۔ دونوں کا مفہوم ایک ہی ہے ۔ سفیان نے بیان کیا کہ میں نے یحییٰ سے پوچھا ، اس وقت میں ابھی کم عمر تھا کہ مکہ کے لوگ کہتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم نے عریہ کی اجازت دی ہے تو انہوں نے پوچھا کہ اہل مکہ کو یہ کس طرح معلوم ہوا ؟ میں نے کہا کہ وہ لوگ جابر رضی اللہ عنہ سے روایت کرتے ہیں ۔ اس پر وہ خاموش ہو گئے ۔ سفیان نے کہا کہ میری مراد اس سے یہ تھی کہ جابر رضی اللہ عنہ مدینہ والے ہیں ۔ سفیان سے پوچھا گیا کہ کیا ان کی حدیث میں یہ ممانعت نہیں ہے کہ پھلوں کو بیچنے سے آپ صلی اللہ علیہ وسلم نے منع فرمایا جب تک ان کی پختگی نہ کھل جائے انہوں نے کہا کہ نہیں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 138,
        "matchingArabicURN": 121060,
        "last_updated": null
    },
    {
        "urduURN": 4021850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا کہ ہم کو امام عبداللہ بن مبارک نے خبر دی ، انہوں نے کہا کہ ہمیں موسیٰ بن عقبہ نے ، انہیں نافع نے ، انہیں عبداللہ بن عمر رضی اللہ عنہما نے ، انہیں زید بن ثابت رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے عریہ کی اجازت دی کہ وہ اندازے سے بیچی جا سکتی ہے ۔ موسیٰ بن عقبہ نے کہا کہ عرایا کچھ معین درخت جن کا میوہ تو اترے ہوئے میوے کے بدل خریدے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 139,
        "matchingArabicURN": 121070,
        "last_updated": null
    },
    {
        "urduURN": 4021860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "لیث بن سعد نے ابوزناد عبداللہ بن ذکوان سے نقل کیا کہ عروہ بن زبیر ، بنوحارثہ کے سہل بن ابی حثمہ انصاری رضی اللہ عنہ سے نقل کرتے تھے اور وہ زید بن ثابت رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں لوگ پھلوں کی خریدوفروخت ( درختوں پر پکنے سے پہلے ) کرتے تھے ۔ پھر جب پھل توڑنے کا وقت آتا ، اور مالک ( قیمت کا ) تقاضا کرنے آتے تو خریدار یہ عذر کرنے لگتے کہ پہلے ہی اس کا گابھا خراب اور کالا ہو گیا ، اس کو بیماری ہو گئی ، یہ تو ٹھٹھر گیا پھل بہت ہی کم آئے ۔ اسی طرح مختلف آفتوں کو بیان کر کے مالکوں سے جھگڑتے ( تاکہ قیمت میں کمی کرا لیں ) جب رسول اللہ صلی اللہ علیہ وسلم کے پاس اس طرح کے مقدمات بکثرت آنے لگے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب اس طرح جھگڑے ختم نہیں ہو سکتے تو تم لوگ بھی میوہ کے پکنے سے پہلے ان کو نہ بیچا کرو ۔ گویا مقدمات کی کثرت کی وجہ سے آپ صلی اللہ علیہ وسلم نے یہ بطور مشورہ فرمایا تھا ۔ خارجہ بن زید بن ثابت رضی اللہ عنہ نے مجھے خبر دی کہ زید بن ثابت رضی اللہ عنہ اپنے باغ کے پھل اس وقت تک نہیں بیچتے جب تک ثریا نہ طلوع ہو جاتا اور زردی اور سرخی ظاہر نہ ہو جاتی ۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے کہا کہ اس کی روایت علی بن بحر نے بھی کی ہے کہ ہم سے حکام بن سلم نے بیان کیا ، ان سے عنبسہ نے بیان کیا ، ان سے زکریا نے ، ان سے ابوالزناد نے ، ان سے عروہ نے اور ان سے سہل بن سعد نے اور ان سے زید بن ثابت نے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 140,
        "matchingArabicURN": 121080,
        "last_updated": null
    },
    {
        "urduURN": 4021870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں نافع نے ، انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے پختہ ہونے سے پہلے پھلوں کو بیچنے سے منع کیا تھا ۔ آپ صلی اللہ علیہ وسلم کی ممانعت بیچنے والے اور خریدنے والے دونوں کو تھی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 141,
        "matchingArabicURN": 121100,
        "last_updated": null
    },
    {
        "urduURN": 4021880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابن مقاتل نے بیان کیا ، کہا کہ ہم کو عبداللہ بن مبارک نے خبر دی ، انہیں حمید طویل نے اور انہیں انس رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے پکنے سے پہلے درخت پر کھجور کو بیچنے سے منع فرمایا ہے ، ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے کہا کہ ( «حتى تزهو‏.‏» سے ) مراد یہ ہے کہ جب تک وہ پک کر سرخ نہ ہو جائیں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 142,
        "matchingArabicURN": 121110,
        "last_updated": null
    },
    {
        "urduURN": 4021890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید نے بیان کیا ، ان سے سلیم بن حیان نے ، ان سے سعید بن مینا نے بیان کیا ، کہا کہ میں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے پھلوں کا «تشقح‏.‏» سے پہلے بیچنے سے منع کیا تھا ۔ پوچھا گیا کہ «تشقح‏.‏» کسے کہتے ہیں تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ مائل بہ زردی یا مائل بہ سرخی ہونے کو کہتے ہیں کہ اسے کھایا جا سکے ( پھل کا پختہ ہونا مراد ہے ) ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 143,
        "matchingArabicURN": 121120,
        "last_updated": null
    },
    {
        "urduURN": 4021900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "مجھ سے علی بن ہشیم نے بیان کیا کہ ہم سے معلی بن منصور نے بیان کیا ، ان سے ہشیم نے بیان کیا ، انہیں حمید نے خبر دی اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے پختہ ہونے سے پہلے پھلوں کو بیچنے سے منع فرمایا ہے اور کھجور کے باغ کو «زهو» سے پہلے بیچنے سے منع فرمایا ، آپ صلی اللہ علیہ وسلم سے پوچھا گیا کہ «زهو» کسے کہتے ہیں تو آپ صلی اللہ علیہ وسلم نے جواب دیا مائل بہ سرخی یا مائل بہ زردی ہونے کو کہتے ہیں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 144,
        "matchingArabicURN": 121130,
        "last_updated": null
    },
    {
        "urduURN": 4021910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں حمید نے اور انہیں انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے پھلوں کو «زهو» سے پہلے بیچنے سے منع فرمایا ہے ۔ ان سے پوچھا گیا کہ کہ «زهو» کسے کہتے ہیں تو جواب دیا کہ سرخ ہونے کو ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تمہی بتاؤ ، اللہ تعالیٰ کے حکم سے پھلوں پر کوئی آفت آ جائے ، تو تم اپنے بھائی کا مال آخر کس چیز کے بدلے لو گے ؟</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 145,
        "matchingArabicURN": 121140,
        "last_updated": null
    },
    {
        "urduURN": 4021920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "لیث نے کہا کہ مجھے سے یونس نے بیان کیا انہوں نے کہا کہ ہم سے ابن شہاب نے بیان کیا ، انہوں نے کہا کہ",
        "hadithText": "ایک شخص نے اگر پختہ ہونے سے پہلے ہی ( درخت پر ) پھل خریدے ، پھر ان پر کوئی آفت آ گئی تو جتنا نقصان ہوا ، وہ سب اصل مالک کو بھرنا پڑے گا ۔ مجھے سالم بن عبداللہ نے خبر دی ، اور انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، پختہ ہونے سے پہلے پھلوں کو نہ بیچو ، اور نہ درخت پر لگی ہوئی کھجور کو ٹوٹی ہوئی کھجور کے بدلے میں بیچو ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 146,
        "matchingArabicURN": 121150,
        "last_updated": null
    },
    {
        "urduURN": 4021930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عمرو بن حفص بن غیاث نے بیان کیا ، کہا کہ مجھ سے میرے باپ نے بیان کیا ، ان سے اعمش نے بیان کیا ، کہا کہ",
        "hadithText": "ہم نے ابراہیم کے سامنے قرض میں گروی رکھنے کا ذکر کیا تو انہوں نے کہا کہ اس میں کوئی حرج نہیں ہے ۔ پھر ہم سے اسود کے واسطہ سے بیان کیا کہ ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے مقررہ مدت کے قرض پر ایک یہودی سے غلہ خریدا اور اپنی زرہ اس کے یہاں گروی رکھی تھی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 147,
        "matchingArabicURN": 121160,
        "last_updated": null
    },
    {
        "urduURN": 4021940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، انہوں نے کہا ہم سے امام مالک نے بیان کیا ، ان سے عبدالمجید بن سہل بن عبدالرحمٰن نے ، ان سے سعید بن مسیب نے ، ان سے ابو سعید خدری رضی اللہ عنہ نے ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے خیبر میں ایک شخص کو تحصیل دار بنایا ۔ وہ صاحب ایک عمدہ قسم کی کھجور لائے ۔ رسول اللہ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کیا خیبر کی تمام کھجور اسی طرح کی ہوتی ہیں ۔ انہوں نے جواب دیا کہ نہیں خدا کی قسم یا رسول اللہ ! ہم تو اسی طرح ایک صاع کھجور ( اس سے گھٹیا کھجوروں کے ) دو صاع دے کر خریدتے ہیں ۔ اور دو صاع تین صاع کے بدلے میں لیتے ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایسا نہ کرو ۔ البتہ گھٹیا کھجور کو پہلے بیچ کر ان پیسوں سے اچھی قسم کی کھجور خرید سکتے ہو ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 148,
        "matchingArabicURN": 121170,
        "last_updated": null
    },
    {
        "urduURN": 4021950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے کہا کہ مجھ سے ابراہیم نے کہا ، انہیں ہشام نے خبر دی ، انہوں نے کہا کہ میں نے ابن ابی ملیکہ سے سنا ، وہ عبداللہ بن عمر رضی اللہ عنہما کے غلام نافع سے خبر دیتے تھے کہ",
        "hadithText": "جو بھی کھجور کا درخت پیوند لگانے کے بعد بیجا جائے اور بیچتے وقت پھلوں کا کوئی ذکر نہ ہوا ہو تو پھل اسی کے ہوں گے جس نے پیوند لگایا ہے ۔ غلام اور کھیت کا بھی یہی حال ہے ۔ نافع نے ان تینوں چیزوں کا نام لیا تھا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 149,
        "matchingArabicURN": 121180,
        "last_updated": null
    },
    {
        "urduURN": 4021960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں نافع نے ، انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اگر کسی نے کھجور کے ایسے درخت بیچے ہوں جن کو پیوندی کیا جا چکا تھا تو اس کا پھل بیچنے والے ہی کا رہتا ہے ۔ البتہ اگر خریدنے والے نے شرط لگا دی ہو ۔ ( کہ پھل سمیت سودا ہو رہا ہے تو پھل بھی خریدار کی ملکیت میں آ جائیں گے ) ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 150,
        "matchingArabicURN": 121190,
        "last_updated": null
    },
    {
        "urduURN": 4021970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، ان سے نافع نے ، ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا ، کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے مزابنہ سے منع فرمایا ۔ یعنی باغ کے پھلوں کو اگر وہ کھجور ہیں تو ٹوٹی ہوئی کھجور کے بدلے میں ناپ کر بیچا جائے ۔ اور اگر انگور ہیں تو اسے خشک انگور کے بدلے ناپ کر بیچا جائے اور اگر وہ کھیتی ہے تو ناپ کر غلہ کے بدلے میں بیچا جائے ۔ آپ صلی اللہ علیہ وسلم نے ان تمام قسموں کے لین دین سے منع فرمایا ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 151,
        "matchingArabicURN": 121200,
        "last_updated": null
    },
    {
        "urduURN": 4021980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، ان سے نافع نے ، اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس شخص نے بھی کسی کھجور کے درخت کو پیوندی بنایا ۔ پھر اس درخت ہی کو بیچ دیا تو ( اس موسم کا پھل ) اسی کا ہو گا جس نے پیوندی کیا ہے ، لیکن اگر خریدار نے پھلوں کی بھی شرط لگا دی ہے ( تو یہ امر دیگر ہے ) ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 152,
        "matchingArabicURN": 121210,
        "last_updated": null
    },
    {
        "urduURN": 4021990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے اسحاق بن وہب نے بیان کیا ، انہوں نے کہا کہ ہم سے عمر بن یونس نے بیان کیا ، انہوں نے کہا کہ مجھ سے میرے باپ نے بیان کیا ، انہوں نے کہا کہ مجھ سے اسحاق بن ابی طلحہ انصاری نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے محاقلہ ، مخاضرہ ، ملامسہ ، منابذہ اور مزابنہ سے منع فرمایا ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 153,
        "matchingArabicURN": 121220,
        "last_updated": null
    },
    {
        "urduURN": 4022000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، کہا کہ ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے حمید نے اور ان سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے درخت کو «زهو‏.‏» سے پہلے ٹوٹی ہوئی کھجور کے بدلے بیچنے سے منع فرمایا ۔ ہم نے پوچھا کہ «زهو‏.‏» کیا ہے ؟ انہوں نے فرمایا کہ وہ پک کے سرخ ہو جائے یا زرد ہو جائے ۔ تم ہی بتاؤ کہ اگر اللہ کے حکم سے پھل نہ آ سکا تو تم کس چیز کے بدلے میں اپنے بھائی ( خریدار ) کا مال اپنے لیے حلال کرو گے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 154,
        "matchingArabicURN": 121230,
        "last_updated": null
    },
    {
        "urduURN": 4022010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابوالولید ہشام بن عبدالملک سے بیان کیا ، کہا کہ ہم سے ابوعوانہ نے بیان کیا ، ان سے ابوبشر نے ، ان سے مجاہد نے ، اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "میں رسول کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر تھا ۔ آپ صلی اللہ علیہ وسلم کھجور کا گابھا کھا رہے تھے ۔ اسی وقت آپ صلی اللہ علیہ وسلم نے فرمایا کہ درختوں میں ایک درخت مرد مومن کی مثال ہے میرے دل میں آیا کہ کہوں کہ یہ کھجور کا درخت ہے ، لیکن حاضرین میں ، میں ہی سب سے چھوٹی عمر کا تھا ( اس لیے بطور ادب میں چپ رہا ) پھر آپ صلی اللہ علیہ وسلم نے خود ہی فرمایا کہ وہ کھجور کا درخت ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 155,
        "matchingArabicURN": 121240,
        "last_updated": null
    },
    {
        "urduURN": 4022020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا کہ ہم کو امام مالک نے خبر دی ، انہیں حمید طویل نے اور انہیں انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کو ابوطیبہ نے پچھنا لگایا تو آپ صلی اللہ علیہ وسلم نے انہیں ایک صاع کھجور ( مزدوری میں ) دینے کا حکم فرمایا ۔ اور اس کے مالکوں سے فرمایا کہ وہ اس کے خراج میں کچھ کمی کر دیں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 156,
        "matchingArabicURN": 121250,
        "last_updated": null
    },
    {
        "urduURN": 4022030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا کہ ہم سے سفیان نے بیان کیا ، ان سے ہشام نے ، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ معاویہ رضی اللہ عنہ کی والدہ حضرت ہندہ رضی اللہ عنہا نے رسول کریم صلی اللہ علیہ وسلم سے کہا کہ",
        "hadithText": "ابوسفیان بخیل آدمی ہے ۔ تو کیا اگر میں ان کے مال سے چھپا کر کچھ لے لیا کروں تو کوئی حرج ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم اپنے لیے اور اپنے بیٹوں کے لیے نیک نیتی کے ساتھ اتنا لے سکتی ہو جو تم سب کے لیے کافی ہو جایا کرے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 157,
        "matchingArabicURN": 121260,
        "last_updated": null
    },
    {
        "urduURN": 4022040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "مجھ سے اسحاق نے بیان کیا ، کہا ہم سے ابن نمیر نے بیان کیا ، کہا کہ ہمیں ہشام نے خبر دی ( دوسری سند ) اور مجھ سے محمد نے بیان کیا کہا کہ میں نے عثمان بن فرقد سے سنا ، انہوں نے کہا کہ میں نے ہشام بن عروہ سے سنا ، وہ اپنے باپ سے بیان کرتے تھے کہ انہوں نے عائشہ رضی اللہ عنہا سے سنا ، وہ فرماتی تھیں کہ",
        "hadithText": "( قرآن کی آیت ) «ومن كان غنيا فليستعفف ومن كان فقيرا فليأكل بالمعروف‏» جو شخص مالدار ہو وہ ( اپنی زیر پرورش یتیم کا مال ہضم کرنے سے ) اپنے کو بچائے ۔ اور جو فقیر ہو وہ نیک نیتی کے ساتھ اس میں سے کھا لے ۔ “ یہ آیت یتیموں کے ان سر پرستوں کے متعلق نازل ہوئی تھی جو ان کی اور ان کے مال کی نگرانی اور دیکھ بھال کرتے ہوں کہ اگر وہ فقیر ہیں تو ( اس خدمت کے عوض ) نیک نیتی کے ساتھ اس میں سے کھا سکتے ہیں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 158,
        "matchingArabicURN": 121270,
        "last_updated": null
    },
    {
        "urduURN": 4022050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمود نے بیان کیا ، کہا کہ ہم سے عبدالرزاق نے بیان کیا ، انہیں معمر نے خبر دی ، انہیں زہری نے ، انہیں ابوسلمہ نے اور انہیں جابر رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے شفعہ کا حق ہر اس مال میں قرار دیا تھا جو تقسیم نہ ہوا ہو ، لیکن اس کی حد بندی ہو جائے اور راستے بھی پھیر دیئے جائیں تو اب شفعہ کا حق باقی نہیں رہا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 159,
        "matchingArabicURN": 121280,
        "last_updated": null
    },
    {
        "urduURN": 4022060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن محبوب نے بیان کیا ، انہوں نے کہا کہ ہم سے عبدالواحد نے بیان کیا ، ان سے معمر نے بیان کیا ، ان سے زہری نے ، ان سے ابوسلمہ بن عبدالرحمٰن نے اور ان سے حضرت جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ہر ایسے مال میں شفعہ کا حق قائم رکھا جو تقسیم نہ ہوا ہو ، لیکن جب اس کی حدود قائم ہو گئی ہوں اور راستہ بھی پھیر دیا گیا ہو تو اب شفعہ کا حق باقی نہیں رہا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 160,
        "matchingArabicURN": 121290,
        "last_updated": null
    },
    {
        "urduURN": 4022070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے یعقوب بن ابراہیم نے بیان کیا ، کہا کہ ہم سے ابوعاصم نے بیان کیا کہا کہ ہم کو ابن جریج نے خبر دی ، کہا کہ مجھے موسیٰ بن عقبہ نے خبر دی ، انہیں نافع نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا ، تین شخص کہیں باہر جا رہے تھے کہ اچانک بارش ہونے لگی ۔ انہوں نے ایک پہاڑ کے غار میں جا کر پناہ لی ۔ اتفاق سے پہاڑ کی ایک چٹان اوپر سے لڑھکی ( اور اس غار کے منہ کو بند کر دیا جس میں یہ تینوں پناہ لیے ہوئے تھے ) اب ایک نے دوسرے سے کہا کہ اپنے سب سے اچھے عمل کا جو تم نے کبھی کیا ہو ، نام لے کر اللہ تعالیٰ سے دعا کرو ۔ اس پر ان میں سے ایک نے یہ دعا کی ” اے اللہ ! میرے ماں باپ بہت ہی بوڑھے تھے ۔ میں باہر لے جا کر اپنے مویشی چراتا تھا ۔ پھر جب شام کو واپس آتا تو ان کا دودھ نکالتا اور برتن میں پہلے اپنے والدین کو پیش کرتا ۔ جب میرے والدین پی چکتے تو پھر بچوں کو اور اپنی بیوی کو پلاتا ۔ اتفاق سے ایک رات واپسی میں دیر ہو گئی اور جب میں گھر لوٹا تو والدین سو چکے تھے ۔ اس نے کہا کہ پھر میں نے پسند نہیں کیا کہ انہیں جگاؤں بچے میرے قدموں میں بھوکے پڑے رو رہے تھے ۔ میں برابر دودھ کا پیالہ لیے والدین کے سامنے اسی طرح کھڑا رہا یہاں تک کہ صبح ہو گئی ۔ اے اللہ ! اگر تیرے نزدیک بھی میں نے یہ کام صرف تیری رضا حاصل کرنے کے لیے کیا تھا ، تو ہمارے لیے اس چٹان کو ہٹا کر اتنا راستہ تو بنا دے کہ ہم آسمان کو تو دیکھ سکیں “ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ۔ چنانچہ وہ پتھر کچھ ہٹ گیا ۔ دوسرے شخص نے دعا کی ” اے اللہ ! تو خوب جانتا ہے کہ مجھے اپنے چچا کی ایک لڑکی سے اتنی زیادہ محبت تھی جتنی ایک مرد کو کسی عورت سے ہو سکتی ہے ۔ اس لڑکی نے کہا تم مجھ سے اپنی خواہش اس وقت تک پوری نہیں کر سکتے جب تک مجھے سو اشرفی نہ دے دو ۔ میں نے ان کے حاصل کرنے کی کوشش کی ، اور آخر اتنی اشرفی جمع کر لی ۔ پھر جب میں اس کی دونوں رانوں کے درمیان بیٹھا ۔ تو وہ بولی ، اللہ سے ڈر ، اور مہر کو ناجائز طریقے پر نہ توڑ ۔ اس پر میں کھڑا ہو گیا اور میں نے اسے چھوڑ دیا ۔ اب اگر تیرے نزدیک بھی میں نے یہ عمل تیری ہی رضا کے لیے کیا تھا تو ہمارے لیے ( نکلنے کا ) راستہ بنا دے “ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ۔ چنانچہ وہ پتھر دو تہائی ہٹ گیا ۔ تیسرے شخص نے دعا کی ” اے اللہ ! تو جانتا ہے کہ میں نے ایک مزدور سے ایک فرق جوار پر کام کرایا تھا ۔ جب میں نے اس کی مزدوری اسے دے دی تو اس نے لینے سے انکار کر دیا ۔ میں نے اس جوار کو لے کر بو دیا ( کھیتی جب کٹی تو اس میں اتنی جوار پیدا ہوئی کہ ) اس سے میں نے ایک بیل اور ایک چرواہا خرید لیا ۔ کچھ عرصہ بعد پھر اس نے آ کر مزدوری مانگی کہ خدا کے بندے مجھے میرا حق دیدے ۔ میں نے کہا کہ اس بیل اور اس کے چرواہے کے پاس جاؤ کہ یہ تمہارے ہی ملک ہیں ۔ اس نے کہا کہ مجھ سے مذاق کرتے ہو ۔ میں نے کہا ” میں مذاق نہیں کرتا “ واقعی یہ تمہارے ہی ہیں ۔ تو اے اللہ ! اگر تیرے نزدیک یہ کام میں نے صرف تیری رضا حاصل کرنے کے لیے کیا تھا تو یہاں ہمارے لیے ( اس چٹان کو ہٹا کر ) راستہ بنا دے ۔ چنانچہ وہ غار پورا کھل گیا اور وہ تینوں شخص باہر آ گئے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 162,
        "matchingArabicURN": 121310,
        "last_updated": null
    },
    {
        "urduURN": 4022080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابوالنعمان نے بیان کیا ، کہا کہ ہم سے معتمر بن سلیمان نے بیان کیا ، ان سے ان کے والد نے ان سے عبدالرحمٰن بن ابی بکر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ہم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں موجود تھے کہ ایک مسٹنڈا لمبے قد والا مشرک بکریاں ہانکتا ہوا آیا ۔ آپ صلی اللہ علیہ وسلم نے اس سے فرمایا کہ یہ بیچنے کے لیے ہیں یا عطیہ ہیں ؟ یا آپ صلی اللہ علیہ وسلم نے یہ فرمایا کہ ( یہ بیچنے کے لیے ہیں ) یا ہبہ کرنے کے لیے ؟ اس نے کہا کہ نہیں بلکہ بیچنے کے لیے ہیں ۔ چنانچہ آپ صلی اللہ علیہ وسلم نے اس سے ایک بکری خرید لی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 163,
        "matchingArabicURN": 121320,
        "last_updated": null
    },
    {
        "urduURN": 4022090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا کہ ہم کو شعیب نے خبر دی ، ان سے ابوالزناد نے بیان کیا ، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، ابراہیم علیہ السلام نے سارہ رضی اللہ عنہا کے ساتھ ( نمرود کے ملک سے ) ہجرت کی تو ایک ایسے شہر میں پہنچے جہاں ایک بادشاہ رہتا تھا یا ( یہ فرمایا کہ ) ایک ظالم بادشاہ رہتا تھا ۔ اس سے ابراہیم علیہ السلام کے متعلق کسی نے کہہ دیا کہ وہ ایک نہایت ہی خوبصورت عورت لے کر یہاں آئے ہیں ۔ بادشاہ نے آپ علیہ السلام سے پچھوا بھیجا کہ ابراہیم ! یہ عورت جو تمہارے ساتھ ہے تمہاری کیا ہوتی ہے ؟ انہوں نے فرمایا کہ یہ میری بہن ہے ۔ پھر جب ابراہیم علیہ السلام سارہ رضی اللہ عنہا کے یہاں آئے تو ان سے کہا کہ میری بات نہ جھٹلانا ، میں تمہیں اپنی بہن کہہ آیا ہوں ۔ خدا کی قسم ! آج روئے زمین پر میرے اور تمہارے سوا کوئی مومن نہیں ہے ۔ چنانچہ آپ علیہ السلام نے سارہ رضی اللہ عنہا کو بادشاہ کے یہاں بھیجا ، یا بادشاہ حضرت سارہ رضی اللہ عنہا کے پاس گیا ۔ اس وقت حضرت سارہ رضی اللہ عنہا وضو کر کے نماز پڑھنے کھڑی ہو گئی تھیں ۔ انہوں نے اللہ کے حضور میں یہ دعا کی کہ ” اے اللہ ! اگر میں تجھ پر اور تیرے رسول ( ابراہیم علیہ السلام ) پر ایمان رکھتی ہوں اور اگر میں نے اپنے شوہر کے سوا اپنی شرمگاہ کی حفاظت کی ہے ، تو تو مجھ پر ایک کافر کو مسلط نہ کر ۔ “ اتنے میں بادشاہ تھرایا اور اس کا پاؤں زمین میں دھنس گیا ۔ اعرج نے کہا کہ ابوسلمہ بن عبدالرحمٰن نے بیان کیا ، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا ، کہ حضرت سارہ رضی اللہ عنہا نے اللہ کے حضور میں دعا کی کہ اے اللہ ! اگر یہ مر گیا تو لوگ کہیں گے کہ اسی نے مارا ہے ۔ چنانچہ وہ پھر چھوٹ گیا اور حضرت سارہ رضی اللہ عنہا کی طرف بڑھا ۔ حضرت سارہ رضی اللہ عنہا وضو کر کے پھر نماز پڑھنے لگی تھیں اور یہ دعا کرتی جاتی تھیں ” اے اللہ ! اگر میں تجھ پر اور تیرے رسول پر ایمان رکھتی ہوں اور اپنے شوہر ( حضرت ابراہیم علیہ السلام ) کے سوا اور ہر موقع پر میں نے اپنی شرمگاہ کی حفاظت کی ہے تو تو مجھ پر اس کافر کو مسلط نہ کر ۔ “ چنانچہ وہ پھر تھرایا ، کانپا اور اس کے پاؤس زمین میں دھنس گئے ۔ عبدالرحمٰن نے بیان کیا کہ ابوسلمہ نے بیان کیا ابوہریرہ رضی اللہ عنہ سے کہ حضرت سارہ رضی اللہ عنہا نے پھر وہی دعا کی کہ ” اے اللہ ! اگر یہ مر گیا تو لوگ کہیں گے کہ اسی نے مارا ہے ۔ “ اب دوسری مرتبہ یا تیسری مرتبہ بھی وہ بادشاہ چھوڑ دیا گیا ۔ آخر وہ کہنے لگا کہ تم لوگوں نے میرے یہاں ایک شیطان بھیج دیا ۔ اسے ابراہیم ( علیہ السلام ) کے پاس لے جاؤ اور انہیں آجر ( حضرت ہاجرہ ) کو بھی دے دو ۔ پھر حضرت سارہ ابراہیم علیہ السلام کے پاس آئیں اور ان سے کہا کہ دیکھتے نہیں اللہ نے کافر کو کس طرح ذلیل کیا اور ساتھ میں ایک لڑکی بھی دلوا دی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 164,
        "matchingArabicURN": 121330,
        "last_updated": null
    },
    {
        "urduURN": 4022100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عروہ نے ، ان سے عائشہ رضی اللہ عنہا نے بیان کیا ، کہ",
        "hadithText": "سعد بن ابی وقاص اور عبد بن زمعہ رضی اللہ عنہ کا ایک بچے کے بارے میں جھگڑا ہوا ۔ سعد رضی اللہ عنہ نے کہا کہ یا رسول اللہ ! یہ میرے بھائی عتبہ بن ابی وقاص کا بیٹا ہے ۔ اس نے وصیت کی تھی کہ یہ اب اس کا بیٹا ہے ۔ آپ خود میرے بھائی سے اس کی مشابہت دیکھ لیں ۔ لیکن عبد بن زمعہ رضی اللہ عنہ نے کہا یا رسول اللہ ! یہ تو میرا بھائی ہے ۔ میرے باپ کے بستر پر پیدا ہوا ہے ۔ اور اس کی باندی کے پیٹ کا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے بچے کی صورت دیکھی تو صاف عتبہ سے ملتی تھی ۔ لیکن آپ صلی اللہ علیہ وسلم نے یہی فرمایا کے اے عبد ! یہ بچہ تیرے ہی ساتھ رہے گا ، کیونکہ بچہ فراش کے تابع ہوتا ہے اور زانی کے حصہ میں صرف پتھر ہے اور اے سودہ بنت زمعہ ! اس لڑکے سے تو پردہ کیا کر ، چنانچہ سودہ رضی اللہ عنہا نے پھر اسے کبھی نہیں دیکھا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 165,
        "matchingArabicURN": 121340,
        "last_updated": null
    },
    {
        "urduURN": 4022110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے غندر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے سعد نے اور ان سے ان کے والد نے بیان کیا ، کہ عبدالرحمٰن بن عوف رضی اللہ عنہ نے صہیب رضی اللہ عنہ سے کہا ،",
        "hadithText": "اللہ سے ڈر اور اپنے باپ کے سوا کسی اور کا بیٹا نہ بن ۔ صہیب رضی اللہ عنہ نے کہا کہ اگر مجھے اتنی اتنی دولت بھی مل جائے تو بھی میں یہ کہنا پسند نہیں کرتا ۔ مگر واقعہ یہ ہے کہ میں تو بچپن ہی میں چرا لیا گیا تھا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 166,
        "matchingArabicURN": 121350,
        "last_updated": null
    },
    {
        "urduURN": 4022120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابوالولیمان نے بیان کیا ، کہا کہ ہم کو شعیب نے خبر دی ، انہیں زہری نے ، کہا کہ مجھے عروہ بن زبیر رضی اللہ عنہ نے خبر دی انہیں حکیم بن حزام رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "انہوں نے پوچھا یا رسول اللہ ! ان نیک کاموں کے متعلق آپ کا کیا حکم ہے ، جنہیں میں جاہلیت کے زمانہ میں صلہ رحمی ، غلام آزاد کرنے اور صدقہ دینے کے سلسلہ میں کیا کرتا تھا کیا ان اعمال کا بھی مجھے ثواب ملے گا ؟ حضرت حکیم بن حزام رضی اللہ عنہ فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جتنی نیکیاں تم پہلے کر چکے ہو ان سب کے ساتھ اسلام لائے ہو ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 167,
        "matchingArabicURN": 121360,
        "last_updated": null
    },
    {
        "urduURN": 4022130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے زہیر بن حرب نے بیان کیا ، کہا کہ ہم سے یعقوب بن ابراہیم نے بیان کیا ، ان سے ان کے باپ نے بیان کیا ، ان سے صالح نے بیان کیا ، کہ مجھ سے ابن شہاب نے بیان کیا ، انہیں عبیداللہ بن عبداللہ نے خبر دی اور انہیں عبداللہ بن عباس رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کا گزر ایک مردہ بکری پر ہوا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کے چمڑے سے تم لوگوں نے کیوں نہیں فائدہ اٹھایا ؟ صحابہ نے عرض کیا ، کہ وہ تو مردار ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ مردار کا صرف کھانا منع ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 168,
        "matchingArabicURN": 121370,
        "last_updated": null
    },
    {
        "urduURN": 4022150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، ان سے ابن شہاب نے ، ان سے ابن مسیب نے اور انہوں نے ابوہریرہ رضی اللہ عنہ کو یہ فرماتے سنا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ، وہ زمانہ آنے والا ہے جب ابن مریم ( عیسیٰ علیہ السلام ) تم میں ایک عادل اور منصف حاکم کی حیثیت سے اتریں گے ۔ وہ صلیب کو توڑ ڈالیں گے ، سوروں کو مار ڈالیں گے اور جزیہ کو ختم کر دیں گے ۔ اس وقت مال کی اتنی زیادتی ہو گی کہ کوئی لینے والا نہ رہے گا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 169,
        "matchingArabicURN": 121380,
        "last_updated": null
    },
    {
        "urduURN": 4022160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے حمیدی نے بیان کیا ، ان سے سفیان نے ، ان سے عمرو بن دینار نے بیان کیا ، کہا کہ مجھے طاؤس نے خبر دی ، انہوں نے ابن عباس رضی اللہ عنہما سے سنا ، آپ فرماتے تھے کہ",
        "hadithText": "عمر رضی اللہ عنہ کو معلوم ہوا کہ فلاں شخص نے شراب فروخت کی ہے ، تو آپ نے فرمایا کہ اسے اللہ تعالیٰ تباہ و برباد کر دے ۔ کیا اسے معلوم نہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا ، اللہ تعالیٰ یہود کو برباد کرے کہ چربی ان پر حرام کی گئی تھی لیکن ان لوگوں نے اسے پگھلا کر فروخت کیا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 170,
        "matchingArabicURN": 121390,
        "last_updated": null
    },
    {
        "urduURN": 4022170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، انہیں عبداللہ بن مبارک نے خبر دی ، انہیں یونس نے خبر دی ، انہیں ابن شہاب نے کہ میں نے سعید بن مسیب سے سنا ، انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اللہ یہودیوں کو تباہ کرے ، ظالموں پر چربی حرام کر دی گئی تھی ، لیکن انہوں نے اسے بیچ کر اس کی قیمت کھائی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 171,
        "matchingArabicURN": 121400,
        "last_updated": null
    },
    {
        "urduURN": 4022180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ، انہوں نے کہا کہ ہم سے یزید بن زریع نے بیان کیا ، انہیں عوف بن ابی حمید نے خبر دی ، انہیں سعید بن ابی حسن نے ، کہا کہ",
        "hadithText": "میں ابن عباس رضی اللہ عنہما کی خدمت میں حاضر تھا کہ ایک شخص ان کے پاس آیا ، اور کہا کہ اے ابوعباس ! میں ان لوگوں میں سے ہوں ، جن کی روزی اپنے ہاتھ کی صنعت پر موقوف ہے اور میں یہ مورتیں بناتا ہوں ۔ ابن عباس رضی اللہ عنہما نے اس پر فرمایا کہ میں تمہیں صرف وہی بات بتلاؤں گا جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنی ہے ۔ انہوں نے کہا کہ میں نے آپ کو یہ فرماتے ہوئے سنا تھا کہ جس نے بھی کوئی مورت بنائی تو اللہ تعالیٰ اسے اس وقت تک عذاب کرتا رہے گا جب تک وہ شخص اپنی مورت میں جان نہ ڈال دے اور وہ کبھی اس میں جان نہیں ڈال سکتا ( یہ سن کر ) اس شخص کا سانس چڑھ گیا اور چہرہ زرد پڑ گیا ۔ ابن عباس رضی اللہ عنہما نے فرمایا کہ افسوس ! اگر تم مورتیں بنانی ہی چاہتے ہو تو ان درختوں کی اور ہر اس چیز کی جس میں جان نہیں ہے مورتیں بنا سکتے ہو ۔ ابوعبداللہ امام بخاری نے کہا کہ سعید بن ابی عروبہ نے نضر بن انس سے صرف یہی ایک حدیث سنی ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 172,
        "matchingArabicURN": 121410,
        "last_updated": null
    },
    {
        "urduURN": 4022190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے اعمش نے بیان کیا ، ان سے ابوضحی نے ، ان سے مسروق نے ، ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "جب سورۃ البقرہ کی تمام آیتیں نازل ہو چکیں تو نبی کریم صلی اللہ علیہ وسلم باہر تشریف لائے اور فرمایا کہ شراب کی سوداگری حرام قرار دی گئی ہے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 173,
        "matchingArabicURN": 121420,
        "last_updated": null
    },
    {
        "urduURN": 4022200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "مجھ سے بشر بن مرحوم نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سلیم نے بیان کیا ، ان سے اسماعیل بن امیہ نے ، ان سے سعید بن ابی سعید نے ، اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ کا ارشاد ہے کہ تین طرح کے لوگ ایسے ہوں گے جن کا قیامت کے دن میں مدعی بنوں گا ، ایک وہ شخص جس نے میرے نام پر عہد کیا اور وہ توڑ دیا ، وہ شخص جس نے کسی آزاد انسان کو بیچ کر اس کی قیمت کھائی اور وہ شخص جس نے کوئی مزدور اجرت پر رکھا ، اس سے پوری طرح کام لیا ، لیکن اس کی مزدوری نہیں دی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 174,
        "matchingArabicURN": 121430,
        "last_updated": null
    },
    {
        "urduURN": 4022210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا کہ ہم سے حماد بن زید نے بیان کیا ، ان سے ثابت نے ، ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "قیدیوں میں حضرت صفیہ رضی اللہ عنہا بھی تھیں ۔ پہلے تو وہ دحیہ کلبی رضی اللہ عنہ کو ملیں پھر نبی کریم صلی اللہ علیہ وسلم کے نکاح میں آئیں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 175,
        "matchingArabicURN": 121440,
        "last_updated": null
    },
    {
        "urduURN": 4022220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا کہ ہم کو شعیب نے خبر دی ، ان سے زہیر نے بیان کیا کہ مجھے ابن محیریز نے خبر دی اور انہیں ابو سعید خدری رضی اللہ عنہ نے خبر دی ، کہ",
        "hadithText": "وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر تھے ۔ ( ایک انصاری صحابی نے ) نبی کریم صلی اللہ علیہ وسلم سے پوچھا کہ یا رسول اللہ ! لڑائی میں ہم لونڈیوں کے پاس جماع کے لیے جاتے ہیں ۔ ہمارا ارادہ انہیں بیچنے کا بھی ہوتا ہے ۔ تو آپ عزل کر لینے کے متعلق کیا فرماتے ہیں ؟ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا ، اچھا تم لوگ ایسا کرتے ہو ؟ اگر تم ایسا نہ کرو پھر بھی کوئی حرج نہیں ۔ اس لیے کہ جس روح کی بھی پیدائش اللہ تعالیٰ نے قسمت میں لکھ دی ہے وہ پیدا ہو کر ہی رہے گی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 176,
        "matchingArabicURN": 121450,
        "last_updated": null
    },
    {
        "urduURN": 4022230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابن نمیر نے بیان کیا ، کہا کہ ہم سے وکیع نے بیان کیا ، ان سے اسماعیل نے بیان کیا ، ان سے سلمہ بن کہیل نے ، ان سے عطاء نے اور ان سے جابر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے مدبر غلام بیچا تھا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 177,
        "matchingArabicURN": 121460,
        "last_updated": null
    },
    {
        "urduURN": 4022240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، ان سے سفیان نے بیان کیا ، ان سے عمرو نے ، انہوں نے جابر بن عبداللہ رضی اللہ عنہما کو یہ کہتے سنا تھا کہ",
        "hadithText": "مدبر غلام کو رسول اللہ صلی اللہ علیہ وسلم نے بیچا تھا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 178,
        "matchingArabicURN": 121470,
        "last_updated": null
    },
    {
        "urduURN": 4022250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "مجھ سے زہیر بن حرب نے بیان کیا ، انہوں نے کہا کہ ہم سے یعقوب نے بیان کیا ، ان سے ان کے والد نے بیان کیا ، انہوں نے کہا کہ ہم سے صالح نے بیان کیا کہ ابن شہاب نے بیان کیا ، انہیں عبیداللہ نے خبر دی ، انہیں زید بن خالد اور ابوہریرہ رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "ان دونوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ سے غیر شادی شدہ باندی کے متعلق جو زنا کر لے سوال کیا گیا ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے کوڑے لگاؤ ، پھر اگر وہ زنا کر لے تو اسے کوڑے لگاؤ ۔ اور پھر اسے بیچ دو ۔ ( آخری جملہ آپ نے ) تیسری یا چوتھی مرتبہ کے بعد ( فرمایا تھا ) ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 179,
        "matchingArabicURN": 121480,
        "last_updated": null
    },
    {
        "urduURN": 4022260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا کہ مجھے لیث نے خبر دی ، انہیں سعید نے ، انہیں ان کے والد نے ، اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم سے میں نے خود سنا ہے کہ جب کوئی باندی زنا کرائے اور وہ ثابت ہو جائے تو اس پر حد زنا جاری کی جائے ، البتہ اسے لعنت ملامت نہ کی جائے ۔ پھر اگر وہ زنا کرائے تو اس پر اس مرتبہ بھی حد جاری کی جائے ، لیکن کسی قسم کی لعنت ملامت نہ کی جائے ۔ تیسری مرتبہ بھی اگر زنا کرے اور زنا ثابت ہو جائے تو اسے بیچ ڈالے خواہ بال کی ایک رسی کے بدلے ہی کیوں نہ ہو ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 180,
        "matchingArabicURN": 121490,
        "last_updated": null
    },
    {
        "urduURN": 4022270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبدالغفار بن داؤد نے بیان کیا ، انہوں نے کہا کہ ہم سے یعقوب بن عبدالرحمٰن نے بیان کیا ، ان سے عمرو بن ابی عمرو نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم خیبر تشریف لائے اور اللہ تعالیٰ نے قلعہ فتح کرا دیا تو آپ صلی اللہ علیہ وسلم کے سامنے صفیہ بنت حیی بن اخطب رضی اللہ عنہا کے حسن کی تعریف کی گئی ۔ ان کا شوہر قتل ہو گیا تھا ۔ وہ خود ابھی دلہن تھیں ۔ پس رسول اللہ صلی اللہ علیہ وسلم نے انہیں اپنے لیے پسند کر لیا ۔ پھر روانگی ہوئی ۔ جب آپ سد الروحاء پہنچے تو پڑاؤ ہوا ۔ اور آپ صلی اللہ علیہ وسلم نے وہیں ان کے ساتھ خلوت کی ۔ پھر ایک چھوٹے دستر خوان پر حیس تیار کر کے رکھوایا ۔ اور رسول اللہ صلی اللہ علیہ وسلم نے صحابہ سے فرمایا کہ اپنے قریب کے لوگوں کو ولیمہ کی خبر کر دو ۔ صفیہ رضی اللہ عنہا کے ساتھ نکاح کا یہی ولیمہ رسول اللہ صلی اللہ علیہ وسلم نے کیا تھا ۔ پھر جب ہم مدینہ کی طرف چلے تو میں نے دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم نے عباء سے صفیہ رضی اللہ عنہا کے لیے پردہ کرایا ۔ اور اپنے اونٹ کو پاس بٹھا کر اپنا ٹخنہ بچھا دیا ۔ صفیہ رضی اللہ عنہا اپنا پاؤں آپ صلی اللہ علیہ وسلم کے ٹخنے پر رکھ کر سوار ہو گئیں ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 181,
        "matchingArabicURN": 121500,
        "last_updated": null
    },
    {
        "urduURN": 4022280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، انہوں نے کہا کہ ہم سے یزید بن ابی حبیب نے بیان کیا ، ان سے عطاء  بن ابی رباح نے بیان کیا ، اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے کہ",
        "hadithText": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، فتح مکہ کے سال آپ صلی اللہ علیہ وسلم نے فرمایا ، آپ کا قیام ابھی مکہ ہی میں تھا کہ اللہ اور اس کے رسول نے شراب ، مردار ، سور اور بتوں کا بیچنا حرام قرار دے دیا ہے ۔ اس پر پوچھا گیا کہ یا رسول اللہ ! مردار کی چربی کے متعلق کیا حکم ہے ؟ اسے ہم کشتیوں پر ملتے ہیں ۔ کھالوں پر اس سے تیل کا کام لیتے ہیں اور لوگ اس سے اپنے چراغ بھی جلاتے ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہیں وہ حرام ہے ۔ اسی موقع پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ یہودیوں کو برباد کرے اللہ تعالیٰ نے جب چربی ان پر حرام کی تو ان لوگوں نے پگھلا کر اسے بیچا اور اس کی قیمت کھائی ۔ ابوعاصم نے کہا کہ ہم سے عبدالحمید نے بیان کیا ، ان سے یزید نے بیان کیا ، انہیں عطاء نے لکھا کہ میں نے جابر رضی اللہ عنہ سے سنا اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 182,
        "matchingArabicURN": 121511,
        "last_updated": null
    },
    {
        "urduURN": 4022290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں ابن شہاب نے ، انہیں ابی بکر بن عبدالرحمٰن نے اور انہیں ابومسعود انصاری رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے کتے کی قیمت ، زانیہ کی اجرت اور کاہن کی اجرت سے منع فرمایا تھا ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 183,
        "matchingArabicURN": 121530,
        "last_updated": null
    },
    {
        "urduURN": 4022300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 33,
        "bookName": "کتاب خرید و فروخت کے مسائل کا بیان",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے حجاج بن منہال نے بیان کیا ، ان سے شعبہ نے بیان کیا ، کہا کہ مجھے عون بن ابی حجیفہ نے خبر دی ، کہا کہ",
        "hadithText": "میں نے اپنے والد کو دیکھا کہ ایک پچھنا لگانے والے ( غلام ) کو خرید رہے ہیں ۔ اس پر میں نے اس کے متعلق ان سے پوچھا تو انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے خون کی قیمت ، کتے کی قیمت ، باندی کی ( ناجائز ) کمائی سے منع فرمایا تھا ۔ اور گودنے والیوں اور گدوانے والیوں ، سود لینے والوں اور دینے والوں پر لعنت کی تھی اور تصویر بنانے والے پر بھی لعنت کی تھی ۔</b>",
        "bookID": "34.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 184,
        "matchingArabicURN": 121540,
        "last_updated": null
    }
]