[
    {
        "urduURN": 4022310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 34,
        "bookName": "کتاب بیع سلم کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے صدقہ بن فضل نے بیان کیا ، انہیں سفیان بن عیینہ نے خبر دی ، انہیں ابن ابی نجیح نے خبر دی ، انہیں عبداللہ بن کثیر نے ، انہیں ابومنہال نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "جب رسول اللہ صلی اللہ علیہ وسلم مدینہ تشریف لائے تو لوگ کھجور میں دو اور تین سال تک کے لیے بیع سلم کرتے تھے ۔ آپ صلی اللہ علیہ وسلم نے انہیں ہدایت فرمائی کہ جسے کسی چیز کی بیع سلم کرنی ہے ، اسے مقررہ وزن اور مقررہ مدت کے لیے ٹھہرا کر کرے ۔</b>",
        "bookID": "35.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 121570,
        "last_updated": null
    },
    {
        "urduURN": 4022320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 34,
        "bookName": "کتاب بیع سلم کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، ان سے سفیان نے بیان کیا ، ان سے ابن ابی نجیح نے ، ان سے عبداللہ بن کثیر نے ، اور ان سے ابومنہال نے بیان کیا کہ میں نے حضرت عبداللہ بن عباس رضی اللہ عنہما سے سنا انہوں نے فرمایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ( مدینہ ) تشریف لائے اور آپ صلی اللہ علیہ وسلم نے فرمایا کہ مقررہ وزن اور مقررہ مدت تک کے لیے ( بیع سلم ) ہونی چاہئے ۔</b>",
        "bookID": "35.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 121590,
        "last_updated": null
    },
    {
        "urduURN": 4022330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 34,
        "bookName": "کتاب بیع سلم کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے ابن ابی مجالد نے ( تیسری سند ) اور ہم سے یحییٰ نے بیان کیا ، ان سے وکیع نے بیان کیا ، ان سے شعبہ نے ، ان سے محمد بن ابی مجالد نے ۔ ( دوسری سند ) ہم سے حفص بن عمر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، کہا کہ مجھے محمد اور عبداللہ بن ابی مجالد نے خبر دی ، انہوں نے بیان کیا کہ",
        "hadithText": "عبداللہ بن شداد بن الہاد اور ابوبردہ میں بیع سلم کے متعلق باہم اختلاف ہوا ۔ تو ان حضرات نے مجھے ابن ابی اوفی رضی اللہ عنہ کی خدمت میں بھیجا ۔ چنانچہ میں نے ان سے پوچھا تو انہوں نے کہا کہ ہم رسول اللہ صلی اللہ علیہ وسلم ، ابوبکر اور عمر رضی اللہ عنہما کے زمانوں میں گیہوں ، جَو ، منقی اور کھجور کی بیع سلم کرتے تھے ۔ پھر میں نے ابن ابزیٰ رضی اللہ عنہ سے پوچھا تو انہوں نے بھی یہی جواب دیا ۔</b>",
        "bookID": "35.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 121601,
        "last_updated": null
    },
    {
        "urduURN": 4022340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 34,
        "bookName": "کتاب بیع سلم کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا کہ ہم سے عبدالواحد نے بیان کیا ، ان سے شیبانی نے بیان کیا ، ان سے محمد بن ابی مجالد نے بیان کیا ، کہا کہ",
        "hadithText": "مجھے عبداللہ بن شداد اور ابوبردہ نے عبداللہ بن ابی اوفی رضی اللہ عنہما کے یہاں بھیجا اور ہدایت کی کہ ان سے پوچھو کہ کیا نبی کریم صلی اللہ علیہ وسلم کے اصحاب آپ کے زمانے میں گیہوں کی بیع سلم کرتے تھے ؟ عبداللہ رضی اللہ عنہ نے جواب دیا کہ ہم شام کے انباط ( ایک کاشتکار قوم ) کے ساتھ گیہوں ، جوار ، زیتون کی مقررہ وزن اور مقررہ مدت کے لیے سودا کیا کرتے تھے ۔ میں نے پوچھا کیا صرف اسی شخص سے آپ لوگ یہ بیع کیا کرتے تھے جس کے پاس اصل مال موجود ہوتا تھا ؟ انہوں نے فرمایا کہ ہم اس کے متعلق پوچھتے ہی نہیں تھے ۔ اس کے بعد ان دونوں حضرات نے مجھے عبدالرحمٰن بن ابزیٰ رضی اللہ عنہ کے خدمت میں بھیجا ۔ میں نے ان سے بھی پوچھا ۔ انہوں نے بھی یہی کہا کہ نبی کریم صلی اللہ علیہ وسلم کے اصحاب آپ کے عہد مبارک میں بیع سلم کیا کرتے تھے اور ہم یہ بھی نہیں پوچھتے تھے کہ ان کے کھیتی بھی ہے یا نہیں ۔</b>",
        "bookID": "35.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 121621,
        "last_updated": null
    },
    {
        "urduURN": 4022350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 34,
        "bookName": "کتاب بیع سلم کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، انہیں عمرو نے خبر دی ، انہوں نے کہا کہ میں نے ابوالبختری طائی سے سنا ، انہوں نے کہا کہ",
        "hadithText": "میں نے ابن عباس رضی اللہ عنہما سے کھجور کے درخت میں بیع سلم کے متعلق پوچھا تو آپ نے فرمایا کہ درخت پر پھل کو بیچنے سے آنحضرت صلی اللہ علیہ وسلم نے اس وقت تک کے لیے منع فرمایا تھا جب تک وہ کھانے کے قابل نہ ہو جائے یا اس کا وزن نہ کیا جا سکے ۔ ایک شخص نے پوچھا کہ کیا چیز وزن کی جائے گی ۔ اس پر ابن عباس رضی اللہ عنہما کے قریب ہی بیٹھے ہوئے ایک شخص نے کہا کہ مطلب یہ ہے کہ اندازہ کرنے کے قابل ہو جائے اور معاذ نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے عمرو نے کہ ابوالبختری نے کہا کہ میں نے ابن عباس رضی اللہ عنہما سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے منع کیا تھا ۔ پھر یہی حدیث بیان کی ۔</b>",
        "bookID": "35.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 121651,
        "last_updated": null
    },
    {
        "urduURN": 4022360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 34,
        "bookName": "کتاب بیع سلم کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے عمرو نے ، ان سے ابوالبختری نے بیان کیا کہ",
        "hadithText": "میں نے ابن عمر رضی اللہ عنہما سے کھجور میں جب کہ وہ درخت پر لگی ہوئی ہو بیع سلم کے متعلق پوچھا ، تو انہوں نے کہا کہ جب تک وہ کسی قابل نہ ہو جائے اس کی بیع سے آنحضرت صلی اللہ علیہ وسلم نے منع فرمایا ہے ۔ اسی طرح چاندی کو ادھار ، نقد کے بدلے بیچنے سے منع فرمایا ۔ پھر میں نے ابن عباس رضی اللہ عنہما سے کھجور کی درخت پر بیع سلم کے متعلق پوچھا تو آپ نے بھی یہی کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے اس وقت تک کھجور کی بیع سے منع فرمایا تھا جب تک وہ کھائی نہ جا سکے یا ( یہ فرمایا کہ ) جب تک وہ اس قابل نہ ہو جائے کہ اسے کوئی کھا سکے اور جب تک وہ تولنے کے قابل نہ ہو جائے ۔</b>",
        "bookID": "35.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 121671,
        "last_updated": null
    },
    {
        "urduURN": 4022370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 34,
        "bookName": "کتاب بیع سلم کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے غندر نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے عمرو نے ، ان سے ابوالبختری نے کہ",
        "hadithText": "میں نے ابن عمر رضی اللہ عنہما سے کھجور کی درخت پر بیع سلم کے متعلق پوچھا تو انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے پھل کو اس وقت تک بیچنے سے منع فرمایا ہے جب تک وہ نفع اٹھانے کے قابل نہ ہو جائے ، اسی طرح چاندی کو سونے کے بدلے بیچنے سے جب کہ ایک ادھار اور دوسرا نقد ہو منع فرمایا ہے ۔ پھر میں نے ابن عباس رضی اللہ عنہما سے پوچھا تو انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے کھجور کو درخت پر بیچنے سے جب تک وہ کھانے کے قابل نہ ہو جائے ، اسی طرح جب تک وہ وزن کرنے کے قابل نہ ہو جائے منع فرمایا ہے ۔ میں نے پوچھا کہ وزن کئے جانے کا کیا مطلب ہے ؟ تو ایک صاحب نے جو ان کے پاس بیٹھے ہوئے تھے کہا کہ مطلب یہ ہے کہ جب تک وہ اس قابل نہ ہو جائے کہ وہ اندازہ کی جا سکے ۔</b>",
        "bookID": "35.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 121691,
        "last_updated": null
    },
    {
        "urduURN": 4022380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 34,
        "bookName": "کتاب بیع سلم کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا کہ ہم سے یعلیٰ بن عبیداللہ نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، ان سے ابراہیم نے ، ان سے اسود نے بیان کیا ان سے ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ایک یہودی سے ادھار غلہ خریدا اور اپنی ایک لوہے کی زرہ اس کے پاس گروی رکھی ۔</b>",
        "bookID": "35.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 121710,
        "last_updated": null
    },
    {
        "urduURN": 4022390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 34,
        "bookName": "کتاب بیع سلم کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن محبوب نے بیان کیا ، کہا ہم سے عبدالواحد بن زیاد نے بیان کیا ، ان سے اعمش نے بیان کیا ، انہوں نے کہا کہ",
        "hadithText": "ہم نے ابراہیم نخعی کے سامنے بیع سلم میں گروی رکھنے کا ذکر کیا تو انہوں نے کہا ہم سے اسود نے بیان کیا ، اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ایک یہودی سے ایک مقررہ مدت کے لیے غلہ خریدا اور اس کے پاس اپنی لوہے کی زرہ گروی رکھ دی تھی ۔</b>",
        "bookID": "35.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 121720,
        "last_updated": null
    },
    {
        "urduURN": 4022400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 34,
        "bookName": "کتاب بیع سلم کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، انہوں نے کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ابن ابی نجیح نے ، ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم مدینہ تشریف لائے تو لوگ پھلوں میں دو اور تین سال تک کے لیے بیع سلم کیا کرتے تھے ۔ آپ صلی اللہ علیہ وسلم نے انہیں ہدایت کی کہ پھلوں میں بیع سلم مقررہ پیمانے اور مقررہ مدت کے لیے کیا کرو ۔ اور عبداللہ بن ولید نے کہا ہم سے سفیان بن عیینہ نے کہا ، ان سے ابن ابی نجیح نے بیان کیا ، اس روایت میں یوں ہے کہ ” پیمانے اور وزن کی تعیین کے ساتھ “ ( بیع سلم ہونی چاہئیے ) ۔</b>",
        "bookID": "35.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 121731,
        "last_updated": null
    },
    {
        "urduURN": 4022410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 34,
        "bookName": "کتاب بیع سلم کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، انہوں نے کہا کہ ہم کو عبداللہ نے خبر دی ، انہوں نے کہا کہ ہم کو سفیان نے خبر دی ، انہیں سلیمان شیبانی نے ، انہیں محمد بن ابی مجالد نے ، کہا کہ",
        "hadithText": "مجھے ابوبردہ اور عبداللہ بن شداد نے عبدالرحمٰن بن ابزیٰ اور عبداللہ بن ابی اوفی رضی اللہ عنہما کی خدمت میں بھیجا ۔ میں نے ان دونوں حضرات سے بیع سلم کے متعلق پوچھا تو انہوں نے کہا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں غنیمت کا مال پاتے ، پھر شام کے انباط ( ایک کاشتکار قوم ) ہمارے یہاں آتے تو ہم ان سے گیہوں ، جَو اور منقی کی بیع سلم ایک مدت مقرر کر کے کر لیا کرتے تھے ۔ انہوں نے کہا کہ پھر میں نے پوچھا کہ ان کے پاس اس وقت یہ چیزیں موجود بھی ہوتی تھیں یا نہیں ؟ اس پر انہوں نے کہا کہ ہم اس کے متعلق ان سے کچھ پوچھتے ہی نہیں تھے ۔</b>",
        "bookID": "35.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 121750,
        "last_updated": null
    },
    {
        "urduURN": 4022420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 34,
        "bookName": "کتاب بیع سلم کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہیں جویریہ نے خبر دی ، انہیں نافع نے اور ان سے عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "لوگ اونٹ وغیرہ حمل کے حمل ہونے کی مدت تک کے لیے بیچتے تھے ۔ نبی کریم صلی اللہ علیہ وسلم نے اس سے منع فرمایا ۔ نافع نے «حبل الحبلة» کی تفسیر یہ کی ” یہاں تک کہ اونٹی کے پیٹ میں جو کچھ ہے وہ اسے جن لے ۔ “</b>",
        "bookID": "35.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 121760,
        "last_updated": null
    },
    {
        "urduURN": 4022305,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 34,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2239,
        "hadithSanad": "ہم سے عمرو بن زرارہ نے بیان کیا ، کہا کہ ہم کو اسماعیل بن علیہ نے خبر دی ، انہیں ابن ابی نجیح نے خبر دی ، انہیں عبداللہ بن کثیر نے ، انہیں ابومنہال نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم مدینہ تشریف لائے تو ( مدینہ کے ) لوگ پھلوں میں ایک سال یا دو سال کے لیے بیع سلم کرتے تھے ۔ یا انہوں نے یہ کہا کہ دو سال اور تین سال ( کے لیے کرتے تھے ) شک اسماعیل کو ہوا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص بھی کھجور میں بیع سلم کرے ، اسے مقررہ پیمانے یا مقررہ وزن کے ساتھ کرنی چاہئیے ۔</b>",
        "bookID": "35.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 121550,
        "last_updated": null
    },
    {
        "urduURN": 4022345,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 35,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2245,
        "hadithSanad": "ہم سے اسحاق بن شاہین نے بیان کیا ، کہا کہ ہم سے خالد بن عبداللہ نے بیان کیا ، ان سے شیبانی نے ، ان سے محمد بن ابی مجالد نے یہی حدیث ۔ اس روایت میں یہ بیان کیا کہ",
        "hadithText": "ہم ان سے گیہوں اور جَو میں بیع سلم کیا کرتے تھے ۔ اور عبداللہ بن ولید نے بیان کیا ، ان سے سفیان نے ، ان سے شیبانی نے بیان کیا ، اس میں انہوں نے زیتون کا بھی نام لیا ہے ۔ ہم سے قتیبہ نے بیان کیا ، ان سے جریر نے بیان کیا ، ان سے شیبانی نے ، اور اس میں بیان کیا کہ گیہوں ، جَو اور منقی میں ( بیع سلم کیا کرتے تھے ) ۔</b>",
        "bookID": "35.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 121640,
        "last_updated": null
    }
]