[
    {
        "urduURN": 4001350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 135,
        "hadithSanad": "ہم سے اسحاق بن ابراہیم الحنظلی نے بیان کیا ۔ انہیں عبدالرزاق نے خبر دی ، انہیں معمر نے ہمام بن منبہ کے واسطے سے بتلایا کہ انھوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص حدث کرے اس کی نماز قبول نہیں ہوتی جب تک کہ وہ ( دوبارہ ) وضو نہ کر لے ۔ حضرموت کے ایک شخص نے پوچھا کہ حدث ہونا کیا ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ( پاخانہ کے مقام سے نکلنے والی ) آواز والی یا بےآواز والی ہوا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 101350,
        "last_updated": null
    },
    {
        "urduURN": 4001360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 136,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، ان سے لیث نے خالد کے واسطے سے نقل کیا ، وہ سعید بن ابی ہلال سے نقل کرتے ہیں ، وہ نعیم المجمر سے ، وہ کہتے ہیں کہ",
        "hadithText": "میں ( ایک مرتبہ ) ابوہریرہ رضی اللہ عنہ کے ساتھ مسجد کی چھت پر چڑھا ۔ تو آپ نے وضو کیا اور کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا کہ آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ میری امت کے لوگ وضو کے نشانات کی وجہ سے قیامت کے دن سفید پیشانی اور سفید ہاتھ پاؤں والوں کی شکل میں بلائے جائیں گے ۔ تو تم میں سے جو کوئی اپنی چمک بڑھانا چاہتا ہے تو وہ بڑھا لے ( یعنی وضو اچھی طرح کرے ) ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 101360,
        "last_updated": null
    },
    {
        "urduURN": 4001370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 137,
        "hadithSanad": "ہم سے علی نے بیان کیا ، ان سے سفیان نے ، ان سے زہری نے سعید بن المسیب کے واسطے سے نقل کیا ، وہ عبادہ بن تمیم سے روایت کرتے ہیں ، وہ اپنے چچا ( عبداللہ بن زید ) سے روایت کرتے ہیں کہ",
        "hadithText": "انھوں نے رسول کریم صلی اللہ علیہ وسلم سے شکایت کی کہ ایک شخص ہے جسے یہ خیال ہوتا ہے کہ نماز میں کوئی چیز ( یعنی ہوا نکلتی ) معلوم ہوئی ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ( نماز سے ) نہ پھرے یا نہ مڑے ، جب تک آواز نہ سنے یا بو نہ پائے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 101370,
        "last_updated": null
    },
    {
        "urduURN": 4001380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 138,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، ان سے سفیان نے عمرو کے واسطے سے نقل کیا ، انہیں کریب نے ابن عباس رضی اللہ عنہما سے خبر دی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم سوئے یہاں تک کہ آپ صلی اللہ علیہ وسلم خراٹے لینے لگے ۔ پھر آپ صلی اللہ علیہ وسلم نے نماز پڑھی اور کبھی ( راوی نے یوں ) کہا کہ آپ صلی اللہ علیہ وسلم لیٹ گئے ۔ پھر خراٹے لینے لگے ۔ پھر آپ صلی اللہ علیہ وسلم کھڑے ہوئے اس کے بعد نماز پڑھی ۔ پھر سفیان نے ہم سے دوسری مرتبہ یہی حدیث بیان کی عمرو سے ، انھوں نے کریب سے ، انھوں نے ابن عباس رضی اللہ عنہما سے نقل کیا کہ وہ کہتے تھے کہ ( ایک مرتبہ ) میں نے اپنی خالہ ( ام المؤمنین ) حضرت میمونہ رضی اللہ عنہا کے گھر رات گزاری ، تو ( میں نے دیکھا کہ ) رسول اللہ صلی اللہ علیہ وسلم رات کو اٹھے ۔ جب تھوڑی رات باقی رہ گئی ۔ تو آپ صلی اللہ علیہ وسلم نے اٹھ کر ایک لٹکے ہوئے مشکیزے سے ہلکا سا وضو کیا ۔ عمرو اس کا ہلکا پن اور معمولی ہونا بیان کرتے تھے اور آپ کھڑے ہو کر نماز پڑھنے لگے ، تو میں نے بھی اسی طرح وضو کیا ۔ جس طرح آپ صلی اللہ علیہ وسلم نے کیا تھا ۔ پھر آ کر آپ کے بائیں طرف کھڑا ہو گیا اور کبھی سفیان نے «عن يساره» کی بجائے «عن شماله» کا لفظ کہا ( مطلب دونوں کا ایک ہی ہے ) پھر آپ صلی اللہ علیہ وسلم نے مجھے پھیر لیا اور اپنی داہنی جانب کر لیا ۔ پھر نماز پڑھی جس قدر اللہ کو منظور تھا ۔ پھر آپ لیٹ گئے اور سو گئے ۔ حتیٰ کہ خراٹوں کی آواز آنے لگی ۔ پھر آپ کی خدمت میں مؤذن حاضر ہوا اور اس نے آپ کو نماز کی اطلاع دی ۔ آپ صلی اللہ علیہ وسلم اس کے ساتھ نماز کے لیے تشریف لے گئے ۔ پھر آپ نے نماز پڑھی اور وضو نہیں کیا ۔ ( سفیان کہتے ہیں کہ ) ہم نے عمرو سے کہا ، کچھ لوگ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کی آنکھیں سوتی تھیں ، دل نہیں سوتا تھا ۔ عمرو نے کہا میں نے عبید بن عمیر سے سنا ، وہ کہتے تھے کہ انبیاء علیہم السلام کے خواب بھی وحی ہوتے ہیں ۔ پھر ( قرآن کی یہ ) آیت پڑھی ۔ ” میں خواب میں دیکھتا ہوں کہ میں تجھے ذبح کر رہا ہوں ۔ “</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 101380,
        "last_updated": null
    },
    {
        "urduURN": 4001390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 139,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، ان سے امام مالک رحمہ اللہ نے موسیٰ بن عقبہ کے واسطے سے بیان کیا ، انھوں نے کریب مولیٰ ابن عباس سے ، انھوں نے اسامہ بن زید رضی اللہ عنہما سے سنا ، وہ کہتے تھے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم میدان عرفات سے واپس ہوئے ۔ جب گھاٹی میں پہنچے تو آپ صلی اللہ علیہ وسلم اتر گئے ۔ آپ صلی اللہ علیہ وسلم نے ( پہلے ) پیشاب کیا ، پھر وضو کیا اور خوب اچھی طرح نہیں کیا ۔ تب میں نے کہا ، یا رسول اللہ ! نماز کا وقت ( آ گیا ) آپ صلی اللہ علیہ وسلم نے فرمایا : نماز ، تمہارے آگے ہے ( یعنی مزدلفہ چل کر پڑھیں گے ) جب مزدلفہ میں پہنچے تو آپ نے خوب اچھی طرح وضو کیا ، پھر جماعت کھڑی کی گئی ، آپ صلی اللہ علیہ وسلم نے مغرب کی نماز پڑھی ، پھر ہر شخص نے اپنے اونٹ کو اپنی جگہ بٹھلایا ، پھر عشاء کی جماعت کھڑی کی گئی اور آپ صلی اللہ علیہ وسلم نے نماز پڑھی اور ان دونوں نمازوں کے درمیان کوئی نماز نہیں پڑھی ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 101390,
        "last_updated": null
    },
    {
        "urduURN": 4001400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 140,
        "hadithSanad": "ہم سے محمد بن عبدالرحیم نے روایت کیا ، انھوں نے کہا مجھ کو ابوسلمہ الخزاعی منصور بن سلمہ نے خبر دی ، انھوں نے کہا ہم کو ابن بلال یعنی سلیمان نے زید بن اسلم کے واسطے سے خبر دی ، انھوں نے عطاء بن یسار سے سنا ، انھوں نے حضرت عبداللہ بن عباس رضی اللہ عنہما سے نقل کیا کہ",
        "hadithText": "( ایک مرتبہ ) انھوں نے ( یعنی ابن عباس رضی اللہ عنہما نے ) وضو کیا تو اپنا چہرہ دھویا ( اس طرح کہ پہلے ) پانی کے ایک چلو سے کلی کی اور ناک میں پانی دیا ۔ پھر پانی کا ایک اور چلو لیا ، پھر اس کو اس طرح کیا ( یعنی ) دوسرے ہاتھ کو ملایا ۔ پھر اس سے اپنا چہرہ دھویا ۔ پھر پانی کا دوسرا چلو لیا اور اس سے اپنا داہنا ہاتھ دھویا ۔ پھر پانی کا ایک اور چلو لے کر اس سے اپنا بایاں ہاتھ دھویا ۔ اس کے بعد اپنے سر کا مسح کیا ۔ پھر پانی کا چلو لے کر داہنے پاؤں پر ڈالا اور اسے دھویا ۔ پھر دوسرے چلو سے اپنا پاؤں دھویا ۔ یعنی بایاں پاؤں اس کے بعد کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو اسی طرح وضو کرتے ہوئے دیکھا ہے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 101400,
        "last_updated": null
    },
    {
        "urduURN": 4001410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 141,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے جریر نے منصور کے واسطے سے روایت کیا ، انھوں نے سالم ابن ابی الجعد سے نقل کیا ، وہ کریب سے ، وہ ابن عباس رضی اللہ عنہما سے روایت کرتے ہیں ، وہ اس حدیث کو نبی کریم صلی اللہ علیہ وسلم تک پہنچاتے تھے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا ” جب تم میں سے کوئی اپنی بیوی سے جماع کرے تو کہے «بسم الله اللهم جنبنا الشيطان وجنب الشيطان ما رزقتنا‏» ” اللہ کے نام کے ساتھ شروع کرتا ہوں ۔ اے اللہ ! ہمیں شیطان سے بچا اور شیطان کو اس چیز سے دور رکھ جو تو ( اس جماع کے نتیجے میں ) ہمیں عطا فرمائے ۔ “ یہ دعا پڑھنے کے بعد ( جماع کرنے سے ) میاں بیوی کو جو اولاد ملے گی اسے شیطان نقصان نہیں پہنچا سکتا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 101410,
        "last_updated": null
    },
    {
        "urduURN": 4001420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 142,
        "hadithSanad": "ہم سے آدم نے بیان کیا ، ان سے شعبہ نے عبدالعزیز بن صہیب کے واسطے سے بیان کیا ، انھوں نے حضرت انس رضی اللہ عنہ سے سنا ، وہ کہتے تھے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم جب ( قضائے حاجت کے لیے ) بیت الخلاء میں داخل ہوتے تو یہ ( دعا ) پڑھتے «اللهم إني أعوذ بك من الخبث والخبائث» اے اللہ ! میں ناپاک جنوں اور ناپاک جنیوں سے تیری پناہ مانگتا ہوں ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 101420,
        "last_updated": null
    },
    {
        "urduURN": 4001430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 143,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا کہ ہم سے ہاشم ابن القاسم نے ، کہا کہ ان سے ورقاء بن یشکری نے عبیداللہ بن ابی یزید سے نقل کیا ، وہ ابن عباس رضی اللہ عنہما سے روایت کرتے ہیں کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم بیت الخلاء میں تشریف لے گئے ۔ میں نے ( بیت الخلاء کے قریب ) آپ صلی اللہ علیہ وسلم کے لیے وضو کا پانی رکھ دیا ۔ ( باہر نکل کر ) آپ صلی اللہ علیہ وسلم نے پوچھا یہ کس نے رکھا ؟ جب آپ صلی اللہ علیہ وسلم کو بتلایا گیا تو آپ نے ( میرے لیے دعا کی اور ) فرمایا «اللهم فقهه في الدين» اے اللہ ! اس کو دین کی سمجھ عطا فرمائیو ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 101430,
        "last_updated": null
    },
    {
        "urduURN": 4001440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 144,
        "hadithSanad": "ہم سے آدم نے بیان کیا ، کہا کہ ہم سے ابن ابی ذئب نے ، کہا کہ ہم سے زہری نے عطاء بن یزید اللیثی کے واسطے سے نقل کیا ، وہ حضرت ابوایوب انصاری رضی اللہ عنہ سے روایت کرتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جب تم میں سے کوئی بیت الخلاء میں جائے تو قبلہ کی طرف منہ کرے نہ اس کی طرف پشت کرے ( بلکہ ) مشرق کی طرف منہ کر لو یا مغرب کی طرف ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 101440,
        "last_updated": null
    },
    {
        "urduURN": 4001450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 145,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انھوں نے کہا کہ ہم کو امام مالک نے یحییٰ بن سعید سے خبر دی ۔ وہ محمد بن یحییٰ بن حبان سے ، وہ اپنے چچا واسع بن حبان سے روایت کرتے ہیں ، وہ عبداللہ بن عمر رضی اللہ عنہما سے روایت کرتے ہیں ۔ وہ فرماتے تھے کہ",
        "hadithText": "لوگ کہتے تھے کہ جب قضاء حاجت کے لیے بیٹھو تو نہ قبلہ کی طرف منہ کرو نہ بیت المقدس کی طرف ( یہ سن کر ) عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ ایک دن میں اپنے گھر کی چھت پر چڑھا تو میں نے آنحضرت صلی اللہ علیہ وسلم کو دیکھا کہ آپ بیت المقدس کی طرف منہ کر کے دو اینٹوں پر قضاء حاجت کے لیے بیٹھے ہیں ۔ پھر عبداللہ بن عمر رضی اللہ عنہما نے ( واسع سے ) کہا کہ شاید تم ان لوگوں میں سے ہو جو اپنے چوتڑوں کے بل نماز پڑھتے ہیں ۔ تب میں نے کہا خدا کی قسم ! میں نہیں جانتا ( کہ آپ کا مطلب کیا ہے ) امام مالک رحمہ اللہ نے کہا کہ عبداللہ بن عمر رضی اللہ عنہما نے اس سے وہ شخص مراد لیا جو نماز میں زمین سے اونچا نہ رہے ، سجدہ میں زمین سے چمٹ جائے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 101450,
        "last_updated": null
    },
    {
        "urduURN": 4001460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 146,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انھوں نے کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے ابن شہاب کے واسطے سے نقل کیا ، وہ عروہ بن زبیر سے ، وہ حضرت عائشہ رضی اللہ عنہا سے روایت کرتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کی بیویاں رات میں مناصع کی طرف قضاء حاجت کے لیے جاتیں اور مناصع ایک کھلا میدان ہے ۔ تو حضرت عمر رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم سے کہا کرتے تھے کہ اپنی بیویوں کو پردہ کرائیے ۔ مگر رسول اللہ صلی اللہ علیہ وسلم نے اس پر عمل نہیں کیا ۔ ایک روز رات کو عشاء کے وقت حضرت سودہ بنت زمعہ رضی اللہ عنہا ، رسول اللہ صلی اللہ علیہ وسلم کی اہلیہ جو دراز قد عورت تھیں ، ( باہر ) گئیں ۔ حضرت عمر رضی اللہ عنہ نے انہیں آواز دی ( اور کہا ) ہم نے تمہیں پہچان لیا اور ان کی خواہش یہ تھی کہ پردہ ( کا حکم ) نازل ہو جائے ۔ چنانچہ ( اس کے بعد ) اللہ نے پردہ ( کا حکم ) نازل فرما دیا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 101460,
        "last_updated": null
    },
    {
        "urduURN": 4001470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 147,
        "hadithSanad": "ہم سے زکریا نے بیان کیا ، کہا کہ ہم سے ابواسامہ نے ہشام بن عروہ کے واسطے سے بیان کیا ، وہ اپنے باپ سے ، وہ عائشہ رضی اللہ عنہا سے ، وہ رسول اللہ صلی اللہ علیہ وسلم سے نقل کرتی ہیں کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے ( اپنی بیویوں سے ) فرمایا کہ تمہیں قضاء حاجت کے لیے باہر نکلنے کی اجازت ہے ۔ ہشام کہتے ہیں کہ حاجت سے مراد پاخانے کے لیے ( باہر ) جانا ہے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 101470,
        "last_updated": null
    },
    {
        "urduURN": 4001480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 148,
        "hadithSanad": "ہم سے ابراہیم بن المنذر نے بیان کیا ، انھوں نے کہا کہ ہم سے انس بن عیاض نے عبیداللہ بن عمر کے واسطے سے بیان کیا ، وہ محمد بن یحییٰ بن حبان سے نقل کرتے ہیں ، وہ واسع بن حبان سے ، وہ عبداللہ بن عمر رضی اللہ عنہما سے روایت کرتے ہیں کہ",
        "hadithText": "( ایک دن میں اپنی بہن اور رسول اللہ صلی اللہ علیہ وسلم کی اہلیہ محترمہ ) حفصہ رضی اللہ عنہا کے مکان کی چھت پر اپنی کسی ضرورت سے چڑھا ، تو مجھے رسول اللہ صلی اللہ علیہ وسلم قضاء حاجت کرتے وقت قبلہ کی طرف پشت اور شام کی طرف منہ کئے ہوئے نظر آئے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 101480,
        "last_updated": null
    },
    {
        "urduURN": 4001490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 149,
        "hadithSanad": "ہم سے یعقوب بن ابراہیم نے بیان کیا ، انھوں نے کہا کہ ہم سے یزید بن ہارون نے بیان کیا ، انھوں نے کہا ، ہمیں یحییٰ نے محمد بن یحییٰ بن حبان سے خبر دی ، انہیں ان کے چچا واسع بن حبان نے بتلایا ، انہیں عبداللہ بن عمر رضی اللہ عنہما نے خبر دی ، وہ کہتے ہیں کہ",
        "hadithText": "ایک دن میں اپنے گھر کی چھت پر چڑھا ، تو مجھے رسول اللہ صلی اللہ علیہ وسلم دو اینٹوں پر ( قضاء حاجت کے وقت ) بیت المقدس کی طرف منہ کئے ہوئے نظر آئے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 101490,
        "last_updated": null
    },
    {
        "urduURN": 4001500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 150,
        "hadithSanad": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا ، ان سے شعبہ نے ابومعاذ سے جن کا نام عطاء بن ابی میمونہ تھا نقل کیا ، انھوں نے انس بن مالک رضی اللہ عنہ سے سنا ، وہ کہتے تھے کہ",
        "hadithText": "جب رسول اللہ صلی اللہ علیہ وسلم رفع حاجت کے لیے نکلتے تو میں اور ایک لڑکا اپنے ساتھ پانی کا برتن لے آتے تھے ۔ مطلب یہ ہے کہ اس پانی سے رسول اللہ صلی اللہ علیہ وسلم طہارت کیا کرتے تھے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 101500,
        "last_updated": null
    },
    {
        "urduURN": 4001510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 151,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، انھوں نے کہا ہم سے شعبہ نے بیان کیا ، وہ عطاء بن ابی میمونہ سے نقل کرتے ہیں ، انھوں نے انس رضی اللہ عنہ سے سنا ، وہ کہتے ہیں کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم قضاء حاجت کے لیے نکلتے ، میں اور ایک لڑکا دونوں آپ صلی اللہ علیہ وسلم کے پیچھے جاتے تھے اور ہمارے ساتھ پانی کا ایک برتن ہوتا تھا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 101510,
        "last_updated": null
    },
    {
        "urduURN": 4001520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 152,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، ان سے محمد بن جعفر نے ، ان سے شعبہ نے عطاء بن ابی میمونہ کے واسطے سے بیان کیا ، انھوں نے انس بن مالک سے سنا ، وہ کہتے تھے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم بیت الخلاء میں جاتے تو میں اور ایک لڑکا پانی کا برتن اور نیزہ لے کر چلتے تھے ۔ پانی سے آپ طہارت کرتے تھے ، ( دوسری سند سے ) نضر اور شاذان نے اس حدیث کی شعبہ سے متابعت کی ہے ۔ عنزہ لاٹھی کو کہتے ہیں جس پر پھلکا لگا ہوا ہو ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 101520,
        "last_updated": null
    },
    {
        "urduURN": 4001530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 153,
        "hadithSanad": "ہم سے معاذ بن فضالہ نے بیان کیا ، انھوں نے کہا کہ ہم سے ہشام دستوائی نے یحییٰ بن ابی کثیر کے واسطے سے بیان کیا ، وہ عبداللہ بن ابی قتادہ سے ، وہ اپنے باپ ابوقتادہ رضی اللہ عنہ سے روایت کرتے ہیں ۔ وہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جب تم میں سے کوئی پانی پئے تو برتن میں سانس نہ لے اور جب بیت الخلاء میں جائے تو اپنی شرمگاہ کو داہنے ہاتھ سے نہ چھوئے اور نہ داہنے ہاتھ سے استنجاء کرے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 101530,
        "last_updated": null
    },
    {
        "urduURN": 4001540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 154,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے اوزاعی نے یحییٰ بن کثیر کے واسطے سے بیان کیا ، وہ عبداللہ بن ابی قتادہ کے واسطے سے بیان کرتے ہیں ، وہ اپنے باپ سے روایت کرتے ہیں ، وہ نبی کریم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا جب تم میں سے کوئی پیشاب کرے تو اپنا عضو اپنے داہنے ہاتھ سے نہ پکڑے ، نہ داہنے ہاتھ سے طہارت کرے ، نہ ( پانی پیتے وقت ) برتن میں سانس لے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 101540,
        "last_updated": null
    },
    {
        "urduURN": 4001550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 155,
        "hadithSanad": "ہم سے احمد بن محمد المکی نے بیان کیا ، کہا کہ ہم سے عمرو بن یحییٰ بن سعید بن عمرو المکی نے اپنے دادا کے واسطے سے بیان کیا ۔ وہ ابوہریرہ رضی اللہ عنہ سے نقل کرتے ہیں ، وہ کہتے ہیں کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم ( ایک مرتبہ ) رفع حاجت کے لیے تشریف لے گئے ۔ آپ صلی اللہ علیہ وسلم کی عادت مبارکہ تھی کہ آپ صلی اللہ علیہ وسلم ( چلتے وقت ) ادھر ادھر نہیں دیکھا کرتے تھے ۔ تو میں بھی آپ صلی اللہ علیہ وسلم کے پیچھے پیچھے آپ صلی اللہ علیہ وسلم کے قریب پہنچ گیا ۔ ( مجھے دیکھ کر ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ مجھے پتھر ڈھونڈ دو ، تاکہ میں ان سے پاکی حاصل کروں ، یا اسی جیسا ( کوئی لفظ ) فرمایا اور فرمایا کہ ہڈی اور گوبر نہ لانا ۔ چنانچہ میں اپنے دامن میں پتھر ( بھر کر ) آپ صلی اللہ علیہ وسلم کے پاس لے گیا اور آپ صلی اللہ علیہ وسلم کے پہلو میں رکھ دئیے اور آپ صلی اللہ علیہ وسلم کے پاس سے ہٹ گیا ، جب آپ صلی اللہ علیہ وسلم ( قضاء حاجت سے ) فارغ ہوئے تو آپ صلی اللہ علیہ وسلم نے پتھروں سے استنجاء کیا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 101550,
        "last_updated": null
    },
    {
        "urduURN": 4001560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 156,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے زہیر نے ابواسحاق کے واسطے سے نقل کیا ، ابواسحاق کہتے ہیں کہ اس حدیث کو ابوعبیدہ نے ذکر نہیں کیا ۔ لیکن عبدالرحمٰن بن الاسود نے اپنے باپ سے ذکر کیا ، انھوں نے عبداللہ بن مسعود رضی اللہ عنہما سے سنا ، وہ کہتے تھے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم رفع حاجت کے لیے گئے ۔ تو آپ صلی اللہ علیہ وسلم نے مجھے فرمایا کہ میں تین پتھر تلاش کر کے آپ کے پاس لاؤں ۔ لیکن مجھے دو پتھر ملے ۔ تیسرا ڈھونڈا مگر مل نہ سکا ۔ تو میں نے خشک گوبر اٹھا لیا ۔ اس کو لے کر آپ صلی اللہ علیہ وسلم کے پاس آ گیا ۔ آپ صلی اللہ علیہ وسلم نے پتھر ( تو ) لے لیے ( مگر ) گوبر پھینک دیا اور فرمایا یہ خود ناپاک ہے ۔ ( اور یہ حدیث ) ابراہم بن یوسف نے اپنے باپ سے بیان کی ۔ انھوں نے ابواسحاق سے سنا ، ان سے عبدالرحمٰن نے بیان کیا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 101560,
        "last_updated": null
    },
    {
        "urduURN": 4001570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 157,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، ان سے سفیان نے زید بن اسلم کے واسطے سے بیان کیا ، وہ عطاء بن یسار سے ، وہ ابن عباس رضی اللہ عنہما سے روایت کرتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے وضو میں ہر عضو کو ایک ایک مرتبہ دھویا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 101570,
        "last_updated": null
    },
    {
        "urduURN": 4001580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 158,
        "hadithSanad": "ہم سے حسین بن عیسیٰ نے بیان کیا ، انھوں نے کہا ہم سے یونس بن محمد نے بیان کیا ، انھوں نے کہا ہم سے فلیح بن سلیمان نے عبداللہ بن ابی بکر بن محمد بن عمرو بن حزم کے واسطے سے بیان کیا ، وہ عباد بن تمیم سے نقل کرتے ہیں ، وہ عبداللہ بن زید رضی اللہ عنہ کے واسطے سے بیان کرتے ہیں کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے وضو میں اعضاء کو دو دو بار دھویا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 101580,
        "last_updated": null
    },
    {
        "urduURN": 4001590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 159,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ الاویسی نے بیان کیا ، انھوں نے کہا مجھ سے ابراہیم بن سعد نے بیان کیا ، وہ ابن شہاب سے نقل کرتے ہیں ، انہیں عطاء بن یزید نے خبر دی ، انہیں حمران حضرت عثمان کے مولیٰ نے خبر دی کہ",
        "hadithText": "انھوں نے حضرت عثمان بن عفان رضی اللہ عنہ کو دیکھا ، انھوں نے ( حمران سے ) پانی کا برتن مانگا ۔ ( اور لے کر پہلے ) اپنی ہتھیلیوں پر تین مرتبہ پانی ڈالا پھر انہیں دھویا ۔ اس کے بعد اپنا داہنا ہاتھ برتن میں ڈالا ۔ اور ( پانی لے کر ) کلی کی اور ناک صاف کی ، پھر تین بار اپنا چہرہ دھویا اور کہنیوں تک تین بار دونوں ہاتھ دھوئے پھر اپنے سر کا مسح کیا پھر ( پانی لے کر ) ٹخنوں تک تین مرتبہ اپنے دونوں پاؤں دھوئے ۔ پھر کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے کہ جو شخص میری طرح ایسا وضو کرے ، پھر دو رکعت پڑھے ، جس میں اپنے نفس سے کوئی بات نہ کرے ۔ تو اس کے گذشتہ گناہ معاف کر دئیے جاتے ہیں ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 101590,
        "last_updated": null
    },
    {
        "urduURN": 4001600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 160,
        "hadithSanad": "اور روایت کی عبدالعزیز نے ابراہیم سے ، انھوں نے صالح بن کیسان سے ، انھوں نے ابن شہاب سے ، لیکن عروہ حمران سے روایت کرتے ہیں کہ",
        "hadithText": "جب حضرت عثمان رضی اللہ عنہ نے وضو کیا تو فرمایا میں تم کو ایک حدیث سناتا ہوں ، اگر قرآن پاک کی ایک آیت ( نازل ) نہ ہوتی تو میں یہ حدیث تم کو نہ سناتا ۔ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے کہ آپ صلی اللہ علیہ وسلم فرماتے تھے کہ جب بھی کوئی شخص اچھی طرح وضو کرتا ہے اور ( خلوص کے ساتھ ) نماز پڑھتا ہے تو اس کے ایک نماز سے دوسری نماز کے پڑھنے تک کے گناہ معاف کر دئیے جاتے ہیں ۔ عروہ کہتے ہیں وہ آیت یہ ہے «إن الذين يكتمون ما أنزلنا من البينات‏» ( جس کا ترجمہ یہ ہے کہ ) جو لوگ اللہ کی اس نازل کی ہوئی ہدایت کو چھپاتے ہیں جو اس نے لوگوں کے لیے اپنی کتاب میں بیان کی ہے ۔ ان پر اللہ کی لعنت ہے اور ( دوسرے ) لعنت کرنے والوں کی لعنت ہے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 101600,
        "last_updated": null
    },
    {
        "urduURN": 4001610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 161,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا انہیں یونس نے زہری کے واسطے سے خبر دی ، کہا انہیں ابوادریس نے بتایا ، انھوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، وہ نبی کریم صلی اللہ علیہ وسلم سے نقل کرتے ہیں کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا جو شخص وضو کرے اسے چاہیے کہ ناک صاف کرے اور جو پتھر سے استنجاء کرے اسے چاہیے کہ طاق عدد ( یعنی ایک یا تین یا پانچ ہی ) سے کرے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 101610,
        "last_updated": null
    },
    {
        "urduURN": 4001620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 162,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو مالک نے ابوالزناد کے واسطے سے خبر دی ، وہ اعرج سے ، وہ ابوہریرہ رضی اللہ عنہ سے نقل کرتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جب تم میں سے کوئی وضو کرے تو اسے چاہیے کہ اپنی ناک میں پانی دے پھر ( اسے ) صاف کرے اور جو شخص پتھروں سے استنجاء کرے اسے چاہیے کہ بے جوڑ عدد ( یعنی ایک یا تین ) سے استنجاء کرے اور جب تم میں سے کوئی سو کر اٹھے ، تو وضو کے پانی میں ہاتھ ڈالنے سے پہلے اسے دھو لے ۔ کیونکہ تم میں سے کوئی نہیں جانتا کہ رات کو اس کا ہاتھ کہاں رہا ہے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 101620,
        "last_updated": null
    },
    {
        "urduURN": 4001630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 163,
        "hadithSanad": "ہم سے موسیٰ نے بیان کیا ، ان سے ابوعوانہ نے ، وہ ابوبشر سے ، وہ یوسف بن ماہک سے ، وہ عبداللہ بن عمرو رضی اللہ عنہما سے روایت کرتے ہیں ، وہ کہتے ہیں کہ",
        "hadithText": "( ایک مرتبہ ) رسول اللہ صلی اللہ علیہ وسلم ایک سفر میں ہم سے پیچھے رہ گئے ۔ پھر ( تھوڑی دیر بعد ) آپ صلی اللہ علیہ وسلم نے ہم کو پا لیا اور عصر کا وقت آ پہنچا تھا ۔ ہم وضو کرنے لگے اور ( اچھی طرح پاؤں دھونے کی بجائے جلدی میں ) ہم پاؤں پر مسح کرنے لگے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا «ويل للأعقاب من النار» ’’ ایڑیوں کے لیے آگ کا عذاب ہے ‘‘ دو مرتبہ یا تین مرتبہ فرمایا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 101630,
        "last_updated": null
    },
    {
        "urduURN": 4001640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 164,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے زہری کے واسطے سے خبر دی ، کہا ہم کو عطاء بن یزید نے حمران مولیٰ عثمان بن عفان رضی اللہ عنہ کے واسطے سے خبر دی ، انھوں نے حضرت عثمان رضی اللہ عنہ کو دیکھا کہ",
        "hadithText": "انھوں نے وضو کا پانی منگوایا اور اپنے دونوں ہاتھوں پر برتن سے پانی ( لے کر ) ڈالا ۔ پھر دونوں ہاتھوں کو تین دفعہ دھویا ۔ پھر اپنا داہنا ہاتھ وضو کر کے پانی میں ڈالا ۔ پھر کلی کی ، پھر ناک میں پانی دیا ، پھر ناک صاف کی ۔ پھر تین دفعہ اپنا منہ دھویا اور کہنیوں تک تین دفعہ ہاتھ دھوئے ، پھر اپنے سر کا مسح کیا ۔ پھر ہر ایک پاؤں تین دفعہ دھویا ۔ پھر فرمایا میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ میرے اس وضو جیسا وضو فرمایا کرتے تھے اور آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص میرے اس وضو جیسا وضو کرے اور ( حضور قلب سے ) دو رکعت پڑھے جس میں اپنے دل سے باتیں نہ کرے ۔ تو اللہ تعالیٰ اس کے پچھلے گناہ معاف کر دیتا ہے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 101640,
        "last_updated": null
    },
    {
        "urduURN": 4001650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 165,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انھوں نے کہا ہم سے شعبہ نے بیان کیا ، انھوں نے کہا ہم سے محمد بن زیاد نے بیان کیا ، وہ کہتے ہیں کہ میں نے ابوہریرہ رضی اللہ عنہ سے سنا",
        "hadithText": "وہ ہمارے پاس سے گزرے اور لوگ لوٹے سے وضو کر رہے تھے ۔ آپ نے کہا اچھی طرح وضو کرو کیونکہ ابوالقاسم صلی اللہ علیہ وسلم نے فرمایا ( خشک ) ایڑیوں کے لیے آگ کا عذاب ہے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 101650,
        "last_updated": null
    },
    {
        "urduURN": 4001660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 166,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو مالک نے سعید المقبری کے واسطے سے خبر دی ، وہ عبیداللہ بن جریج سے نقل کرتے ہیں کہ انھوں نے عبداللہ بن عمر سے کہا",
        "hadithText": "اے ابوعبدالرحمن ! میں نے تمہیں چار ایسے کام کرتے ہوئے دیکھا ہے جنھیں تمہارے ساتھیوں کو کرتے ہوئے نہیں دیکھا ۔ وہ کہنے لگے ، اے ابن جریج ! وہ کیا ہیں ؟ ابن جریج نے کہا کہ میں نے طواف کے وقت آپ کو دیکھا کہ دو یمانی رکنوں کے سوا کسی اور رکن کو آپ نہیں چھوتے ہو ۔ ( دوسرے ) میں نے آپ کو بستی جوتے پہنے ہوئے دیکھا اور ( تیسرے ) میں نے دیکھا کہ آپ زرد رنگ استعمال کرتے ہو اور ( چوتھی بات ) میں نے یہ دیکھی کہ جب آپ مکہ میں تھے ، لوگ ( ذی الحجہ کا ) چاند دیکھ کر لبیک پکارنے لگتے ہیں ۔ ( اور ) حج کا احرام باندھ لیتے ہیں اور آپ آٹھویں تاریخ تک احرام نہیں باندھتے ۔ حضرت عبداللہ بن عمر رضی اللہ عنہما نے جواب دیا کہ ( دوسرے ) ارکان کو تو میں یوں نہیں چھوتا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یمانی رکنوں کے علاوہ کسی اور رکن کو چھوتے ہوئے نہیں دیکھا اور رہے جوتے ، تو میں نے رسول اللہ صلی اللہ علیہ وسلم کو ایسے جوتے پہنے ہوئے دیکھا کہ جن کے چمڑے پر بال نہیں تھے اور آپ انہیں کو پہنے پہنے وضو فرمایا کرتے تھے ، تو میں بھی انہی کو پہننا پسند کرتا ہوں اور زرد رنگ کی بات یہ ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو زرد رنگ رنگتے ہوئے دیکھا ہے ۔ تو میں بھی اسی رنگ سے رنگنا پسند کرتا ہوں اور احرام باندھنے کا معاملہ یہ ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو اس وقت تک احرام باندھتے ہوئے نہیں دیکھا جب تک آپ کی اونٹنی آپ کو لے کر نہ چل پڑتی ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 101660,
        "last_updated": null
    },
    {
        "urduURN": 4001670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 167,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، ان سے اسماعیل نے ، ان سے خالد نے حفصہ بنت سیرین کے واسطے سے نقل کیا ، وہ ام عطیہ سے روایت کرتی ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے اپنی ( مرحومہ ) صاحبزادی ( حضرت زینب رضی اللہ عنہا ) کو غسل دینے کے وقت فرمایا تھا کہ غسل داہنی طرف سے دو ، اور اعضاء وضو سے غسل کی ابتداء کرو ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 101670,
        "last_updated": null
    },
    {
        "urduURN": 4001680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 168,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، انہیں اشعث بن سلیم نے خبر دی ، ان کے باپ نے مسروق سے سنا ، وہ ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا سے روایت کرتے ہیں کہ وہ فرماتی ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم جوتا پہننے ، کنگھی کرنے ، وضو کرنے اور اپنے ہر کام میں داہنی طرف سے کام کی ابتداء کرنے کو پسند فرمایا کرتے تھے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 101680,
        "last_updated": null
    },
    {
        "urduURN": 4001690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 169,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انھوں نے کہا کہ ہم کو مالک نے اسحاق بن عبداللہ بن ابی طلحہ سے خبر دی ، وہ انس بن مالک رضی اللہ عنہ سے نقل کرتے ہیں ، وہ فرماتے ہیں کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ نماز عصر کا وقت آ گیا ، لوگوں نے پانی تلاش کیا ، جب انہیں پانی نہ ملا ، تو رسول اللہ صلی اللہ علیہ وسلم کے پاس ( ایک برتن میں ) وضو کے لیے پانی لایا گیا ۔ رسول اللہ صلی اللہ علیہ وسلم نے اس میں اپنا ہاتھ ڈال دیا اور لوگوں کو حکم دیا کہ اسی ( برتن ) سے وضو کریں ۔ حضرت انس رضی اللہ عنہ کہتے ہیں کہ میں نے دیکھا آپ کی انگلیوں کے نیچے سے پانی ( چشمے کی طرح ) ابل رہا تھا ۔ یہاں تک کہ ( قافلے کے ) آخری آدمی نے بھی وضو کر لیا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 101690,
        "last_updated": null
    },
    {
        "urduURN": 4001700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 170,
        "hadithSanad": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے اسرائیل نے عاصم کے واسطے سے بیان کیا ، وہ ابن سیرین سے نقل کرتے ہیں ، وہ کہتے ہیں کہ میں نے عبیدہ رضی اللہ عنہ سے کہا کہ",
        "hadithText": "ہمارے پاس رسول اللہ صلی اللہ علیہ وسلم کے کچھ بال ( مبارک ) ہیں ، جو ہمیں حضرت انس رضی اللہ عنہ سے یا انس رضی اللہ عنہ کے گھر والوں کی طرف سے ملے ہیں ۔ ( یہ سن کر ) عبیدہ نے کہا کہ اگر میرے پاس ان بالوں میں سے ایک بال بھی ہو تو وہ میرے لیے ساری دنیا اور اس کی ہر چیز سے زیادہ عزیز ہے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 101700,
        "last_updated": null
    },
    {
        "urduURN": 4001710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 171,
        "hadithSanad": "ہم سے محمد بن عبدالرحیم نے بیان کیا ، انھوں نے کہا ہم کو سعید بن سلیمان نے خبر دی انھوں نے ، کہا ہم سے عباد نے ابن عون کے واسطے سے بیان کیا ۔ وہ ابن سیرین سے ، وہ حضرت انس بن مالک رضی اللہ عنہ سے نقل کرتے ہیں کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے ( حجۃ الوداع میں ) جب سر کے بال منڈوائے تو سب سے پہلے ابوطلحہ رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم کے بال لیے تھے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 101710,
        "last_updated": null
    },
    {
        "urduURN": 4001720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 172,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہیں امام مالک نے ابوالزناد سے خبر دی ، وہ اعرج سے ، وہ ابوہریرہ رضی اللہ عنہ سے روایت کرتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جب کتا تم میں سے کسی کے برتن میں سے ( کچھ ) پی لے تو اس کو سات مرتبہ دھو لو ( تو پاک ہو جائے گا ) ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 101720,
        "last_updated": null
    },
    {
        "urduURN": 4001730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 173,
        "hadithSanad": "ہم سے اسحاق نے بیان کیا ، کہا ہم کو عبدالصمد نے خبر دی ، کہا ہم کو عبدالرحمٰن بن عبداللہ بن دینار نے بیان کیا ، انھوں نے اپنے باپ سے سنا ، وہ ابوصالح سے ، وہ ابوہریرہ رضی اللہ عنہ سے ، وہ رسول کریم صلی اللہ علیہ وسلم سے نقل کرتے ہیں",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک شخص نے ایک کتے کو دیکھا ، جو پیاس کی وجہ سے گیلی مٹی کھا رہا تھا ۔ تو اس شخص نے اپنا موزہ لیا اور اس سے پانی بھر کر پلانے لگا ، حتیٰ کہ اس کو خوب سیراب کر دیا ۔ اللہ نے اس شخص کے اس کام کی قدر کی اور اسے جنت میں داخل کر دیا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 101730,
        "last_updated": null
    },
    {
        "urduURN": 4001740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 174,
        "hadithSanad": "احمد بن شبیب نے کہا کہ ہم سے میرے والد نے یونس کے واسطے سے بیان کیا ، وہ ابن شہاب سے نقل کرتے ہیں ، انھوں نے کہا مجھ سے حمزہ بن عبداللہ نے اپنے باپ ( یعنی حضرت عبداللہ بن عمر رضی اللہ عنہما ) کے واسطے سے بیان کیا ۔ وہ کہتے تھے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں کتے مسجد میں آتے جاتے تھے لیکن لوگ ان جگہوں پر پانی نہیں چھڑکتے تھے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 101740,
        "last_updated": null
    },
    {
        "urduURN": 4001750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 175,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، کہا کہ ہم سے شعبہ نے ابن ابی السفر کے واسطے سے بیان کیا ، وہ شعبی سے نقل فرماتے ہیں ، وہ عدی بن حاتم سے روایت کرتے ہیں کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے ( کتے کے شکار کے متعلق ) دریافت کیا ۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب تو اپنے سدھائے ہوئے کتے کو چھوڑے اور وہ شکار کر لے تو ، تو اس ( شکار ) کو کھا اور اگر وہ کتا اس شکار میں سے خود ( کچھ ) کھا لے تو ، تو ( اس کو ) نہ کھائیو ۔ کیونکہ اب اس نے شکار اپنے لیے پکڑا ہے ۔ میں نے کہا کہ بعض دفعہ میں ( شکار کے لیے ) اپنے کتے چھوڑتا ہوں ، پھر اس کے ساتھ دوسرے کتے کو بھی پاتا ہوں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ۔ پھر مت کھا ۔ کیونکہ تم نے «بسم الله» اپنے کتے پر پڑھی تھی ۔ دوسرے کتے پر نہیں پڑھی ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 101750,
        "last_updated": null
    },
    {
        "urduURN": 4001760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 176,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انھوں نے کہا ہم سے ابن ابی ذئب نے بیان کیا ، انھوں نے کہا ہم سے سعید المقبری نے بیان کیا ، وہ حضرت ابوہریرہ سے روایت کرتے ہیں ، وہ کہتے ہیں کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا کہ بندہ اس وقت تک نماز ہی میں رہتا ہے جب تک وہ مسجد میں نماز کا انتظار کرتا ہے ۔ تاوقیتکہ وہ حدث نہ کرے ۔ ایک عجمی آدمی نے پوچھا کہ اے ابوہریرہ ! حدث کیا چیز ہے ؟ انھوں نے فرمایا کہ ہوا جو پیچھے سے خارج ہو ۔ ( جسے عرف عام میں گوز مارنا کہتے ہیں ) ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 101760,
        "last_updated": null
    },
    {
        "urduURN": 4001770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 177,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا ہم سے ابن عیینہ نے ، وہ زہری سے ، وہ عباد بن تمیم سے ، وہ اپنے چچا سے ، وہ رسول اللہ صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ ( نمازی نماز سے ) اس وقت تک نہ پھرے جب تک ( ریح کی ) آواز نہ سن لے یا اس کی بو نہ پا لے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 101770,
        "last_updated": null
    },
    {
        "urduURN": 4001780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 178,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، کہا ہم سے جریر نے اعمش کے واسطے سے بیان کیا ، وہ منذر سے ، وہ ابویعلیٰ ثوری سے ، وہ محمد ابن الحنفیہ سے نقل کرتے ہیں کہ حضرت علی رضی اللہ عنہ نے فرمایا کہ",
        "hadithText": "میں ایسا آدمی تھا جس کو سیلان مذی کی شکایت تھی ، مگر رسول اللہ صلی اللہ علیہ وسلم سے دریافت کرتے ہوئے مجھے شرم آئی ۔ تو میں نے ابن الاسود کو حکم دیا ، انھوں نے آپ صلی اللہ علیہ وسلم سے پوچھا ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس میں وضو کرنا فرض ہے ۔ اس روایت کو شعبہ نے بھی اعمش سے روایت کیا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 101780,
        "last_updated": null
    },
    {
        "urduURN": 4001790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 179,
        "hadithSanad": "ہم سے سعد بن حفص نے بیان کیا ، انھوں نے کہا ہم سے شیبان نے یحییٰ کے واسطے سے نقل کیا ، وہ عطاء بن یسار سے نقل کرتے ہیں ، انہیں زید بن خالد نے خبر دی کہ انھوں نے حضرت عثمان بن عفان رضی اللہ عنہ سے پوچھا کہ",
        "hadithText": "اگر کوئی شخص صحبت کرے اور منی نہ نکلے ۔ فرمایا کہ وضو کرے جس طرح نماز کے لیے وضو کرتا ہے اور اپنے عضو کو دھولے ۔ حضرت عثمان رضی اللہ عنہ کہتے ہیں کہ ( یہ ) میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے ۔ ( زید بن خالد کہتے ہیں کہ ) پھر میں نے اس کے بارے میں حضرت علی ، زبیر ، طلحہ اور ابی بن کعب رضی اللہ عنہم سے دریافت کیا ۔ سب نے اس شخص کے بارے میں یہی حکم دیا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 101790,
        "last_updated": null
    },
    {
        "urduURN": 4001800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 180,
        "hadithSanad": "ہم سے اسحاق بن منصور نے بیان کیا ، کہا ہمیں نضر نے خبر دی ، کہا ہم کو شعبہ نے حکم کے واسطے سے بتلایا ، وہ ذکوان سے ، وہ ابوصالح سے ، وہ ابو سعید خدری سے روایت کرتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ایک انصاری کو بلایا ۔ وہ آئے تو ان کے سر سے پانی ٹپک رہا تھا ۔ رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، شاید ہم نے تمہیں جلدی میں ڈال دیا ۔ انھوں نے کہا ، جی ہاں ۔ تب رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جب کوئی جلدی ( کا کام ) آ پڑے یا تمہیں انزال نہ ہو تو تم پر وضو ہے ( غسل ضروری نہیں ) ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 101800,
        "last_updated": null
    },
    {
        "urduURN": 4001810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 181,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو یزید بن ہارون نے یحییٰ سے خبر دی ، وہ موسیٰ بن عقبہ سے ، وہ کریب ابن عباس کے آزاد کردہ غلام سے ، وہ اسامہ بن زید سے نقل کرتے ہیں کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم جب عرفہ سے لوٹے ، تو ( پہاڑ کی ) گھاٹی کی جانب مڑ گئے ، اور رفع حاجت کی ۔ اسامہ کہتے ہیں کہ پھر ( آپ صلی اللہ علیہ وسلم نے وضو کیا اور ) میں آپ صلی اللہ علیہ وسلم کے ( اعضاء ) پر پانی ڈالنے لگا اور آپ صلی اللہ علیہ وسلم وضو فرماتے رہے ۔ میں نے کہا یا رسول اللہ ! آپ ( اب ) نماز پڑھیں گے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا نماز کا مقام تمہارے سامنے ( یعنی مزدلفہ میں ) ہے ۔ وہاں نماز پڑھی جائے گی ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 101810,
        "last_updated": null
    },
    {
        "urduURN": 4001820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 182,
        "hadithSanad": "ہم سے عمرو بن علی نے بیان کیا ، انھوں نے کہا ہم سے عبدالوہاب نے بیان کیا ، انھوں نے کہا میں نے یحییٰ بن سعید سے سنا ، انھوں نے کہا مجھے سعد بن ابراہیم نے نافع بن جبیر بن مطعم سے بتلایا ۔ انھوں نے عروہ بن مغیرہ بن شعبہ سے سنا ، وہ مغیرہ بن شعبہ رضی اللہ عنہ سے نقل کرتے ہیں کہ",
        "hadithText": "وہ ایک سفر میں رسول کریم صلی اللہ علیہ وسلم کے ساتھ تھے ۔ ( وہاں ) آپ رفع حاجت کے لیے تشریف لے گئے ( جب آپ واپس آئے ، آپ صلی اللہ علیہ وسلم نے وضو شروع کیا ) تو مغیرہ بن شعبہ آپ کے ( اعضاء وضو ) پر پانی ڈالنے لگے ۔ آپ صلی اللہ علیہ وسلم وضو کر رہے تھے آپ نے اپنے منہ اور ہاتھوں کو دھویا ، سر کا مسح کیا اور موزوں پر مسح کیا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 101820,
        "last_updated": null
    },
    {
        "urduURN": 4001830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 183,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، کہا مجھ سے امام مالک نے مخرمہ بن سلیمان کے واسطے سے نقل کیا ، وہ کریب ابن عباس رضی اللہ عنہما کے آزاد کردہ غلام سے نقل کرتے ہیں کہ عبداللہ بن عباس رضی اللہ عنہما نے انہیں خبر دی کہ",
        "hadithText": "انھوں نے ایک رات رسول کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ اور اپنی خالہ حضرت میمونہ رضی اللہ عنہا کے گھر میں گزاری ۔ ( وہ فرماتے ہیں کہ ) میں تکیہ کے عرض ( یعنی گوشہ ) کی طرف لیٹ گیا اور رسول کریم صلی اللہ علیہ وسلم اور آپ کی اہلیہ نے ( معمول کے مطابق ) تکیہ کی لمبائی پر ( سر رکھ کر ) آرام فرمایا ۔ رسول اللہ صلی اللہ علیہ وسلم سوتے رہے اور جب آدھی رات ہو گئی یا اس سے کچھ پہلے یا اس کے کچھ بعد آپ بیدار ہوئے اور اپنے ہاتھوں سے اپنی نیند کو دور کرنے کے لیے آنکھیں ملنے لگے ۔ پھر آپ نے سورۃ آل عمران کی آخری دس آیتیں پڑھیں ، پھر ایک مشکیزہ کے پاس جو ( چھت میں ) لٹکا ہوا تھا آپ کھڑے ہو گئے اور اس سے وضو کیا ، خوب اچھی طرح ، پھر کھڑے ہو کر نماز پڑھنے لگے ۔ ابن عباس رضی اللہ عنہما کہتے ہیں میں نے بھی کھڑے ہو کر اسی طرح کیا ، جس طرح آپ صلی اللہ علیہ وسلم نے وضو کیا تھا ۔ پھر جا کر میں بھی آپ کے پہلوئے مبارک میں کھڑا ہو گیا ۔ آپ نے اپنا داہنا ہاتھ میرے سر پر رکھا اور میرا دایاں کان پکڑ کر اسے مروڑنے لگے ۔ پھر آپ نے دو رکعتیں پڑھیں ۔ اس کے بعد پھر دو رکعتیں پڑھیں ۔ پھر دو رکعتیں پڑھیں ۔ پھر دو رکعتیں ، پھر دو رکعتیں ، پھر دو رکعتیں پڑھ کر اس کے بعد آپ نے وتر پڑھا اور لیٹ گئے ، پھر جب مؤذن آپ صلی اللہ علیہ وسلم کے پاس آیا ، تو آپ نے اٹھ کر دو رکعت معمولی ( طور پر ) پڑھیں ۔ پھر باہر تشریف لا کر صبح کی نماز پڑھی ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 101830,
        "last_updated": null
    },
    {
        "urduURN": 4001840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 184,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، کہا مجھ سے مالک نے ہشام بن عروہ کے واسطے سے نقل کیا ، وہ اپنی بیوی فاطمہ سے ، وہ اپنی دادی اسماء بنت ابی بکر سے روایت کرتی ہیں ، وہ کہتی ہیں کہ",
        "hadithText": "میں رسول اللہ صلی اللہ علیہ وسلم کی زوجہ محترمہ عائشہ رضی اللہ عنہا کے پاس ایسے وقت آئی جب کہ سورج کو گہن لگ رہا تھا اور لوگ کھڑے ہو کر نماز پڑھ رہے تھے ، کیا دیکھتی ہوں وہ بھی کھڑے ہو کر نماز پڑھ رہی ہیں ۔ میں نے کہا کہ لوگوں کو کیا ہو گیا ہے ؟ تو انھوں نے اپنے ہاتھ سے آسمان کی طرف اشارہ کر کے کہا ، سبحان اللہ ! میں نے کہا ( کیا یہ ) کوئی ( خاص ) نشانی ہے ؟ تو انھوں نے اشارے سے کہا کہ ہاں ۔ تو میں بھی آپ کے ساتھ نماز کے لیے کھڑی ہو گئی ۔ ( آپ نے اتنا فرمایا کہ ) مجھ پر غشی طاری ہونے لگی اور میں اپنے سر پر پانی ڈالنے لگی ۔ جب رسول اللہ صلی اللہ علیہ وسلم نماز سے فارغ ہوئے تو آپ نے اللہ کی حمد و ثنا بیان کی اور فرمایا ، آج کوئی چیز ایسی نہیں رہی جس کو میں نے اپنی اسی جگہ نہ دیکھ لیا ہو حتیٰ کہ جنت اور دوزخ کو بھی دیکھ لیا ۔ اور مجھ پر یہ وحی کی گئی ہے کہ تم لوگوں کو قبروں میں آزمایا جائے گا ۔ دجال جیسی آزمائش یا اس کے قریب قریب ۔ ( راوی کا بیان ہے کہ ) میں نہیں جانتی کہ اسماء نے کون سا لفظ کہا ۔ تم میں سے ہر ایک کے پاس ( اللہ کے فرشتے ) بھیجے جائیں گے اور اس سے کہا جائے گا کہ تمہارا اس شخص ( یعنی محمد صلی اللہ علیہ وسلم ) کے بارے میں کیا خیال ہے ؟ پھر اسماء نے لفظ ایماندار کہا یا یقین رکھنے والا کہا ۔ مجھے یاد نہیں ۔ ( بہرحال وہ شخص ) کہے گا کہ محمد صلی اللہ علیہ وسلم اللہ کے سچے رسول ہیں ۔ وہ ہمارے پاس نشانیاں اور ہدایت کی روشنی لے کر آئے ۔ ہم نے ( اسے ) قبول کیا ، ایمان لائے ، اور ( آپ کا ) اتباع کیا ۔ پھر ( اس سے ) کہہ دیا جائے گا تو سو جا درحالیکہ تو مرد صالح ہے اور ہم جانتے تھے کہ تو مومن ہے ۔ اور بہرحال منافق یا شکی آدمی ، اسماء نے کون سا لفظ کہا مجھے یاد نہیں ۔ ( جب اس سے پوچھا جائے گا ) کہے گا کہ میں ( کچھ ) نہیں جانتا ، میں نے لوگوں کو جو کہتے سنا ، وہی میں نے بھی کہہ دیا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 101840,
        "last_updated": null
    },
    {
        "urduURN": 4001850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 185,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انھوں نے کہا ہم کو امام مالک نے عمرو بن یحییٰ المازنی سے خبر دی ، وہ اپنے باپ سے نقل کرتے ہیں کہ ایک آدمی نے عبداللہ بن زید رضی اللہ عنہ جو عمرو بن یحییٰ کے دادا ہیں ، سے پوچھا کہ",
        "hadithText": "کیا آپ مجھے دکھا سکتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے کس طرح وضو کیا ہے ؟ عبداللہ بن زید رضی اللہ عنہ نے کہا کہ ہاں ! پھر انھوں نے پانی کا برتن منگوایا پہلے پانی اپنے ہاتھوں پر ڈالا اور دو مرتبہ ہاتھ دھوئے ۔ پھر تین مرتبہ کلی کی ، تین بار ناک صاف کی ، پھر تین دفعہ اپنا چہرہ دھویا ۔ پھر کہنیوں تک اپنے دونوں ہاتھ دو دو مرتبہ دھوئے ۔ پھر اپنے دونوں ہاتھوں سے اپنے سر کا مسح کیا ۔ اس طور پر اپنے ہاتھ ( پہلے ) آگے لائے پھر پیچھے لے گئے ۔ ( مسح ) سر کے ابتدائی حصے سے شروع کیا ۔ پھر دونوں ہاتھ گدی تک لے جا کر وہیں واپس لائے جہاں سے ( مسح ) شروع کیا تھا ، پھر اپنے پیر دھوئے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 101850,
        "last_updated": null
    },
    {
        "urduURN": 4001860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 186,
        "hadithSanad": "ہم سے موسیٰ نے بیان کیا ، انھوں نے کہا ہم سے وہیب نے بیان کیا ، انھوں نے عمرو سے ، انھوں نے اپنے باپ ( یحییٰ ) سے خبر دی ، انھوں نے کہا کہ میری موجودگی میں عمرو بن حسن نے عبداللہ بن زید رضی اللہ عنہ سے",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے وضو کے بارے میں پوچھا تو انھوں نے پانی کا طشت منگوایا اور ان ( پوچھنے والوں ) کے لیے رسول اللہ صلی اللہ علیہ وسلم کا سا وضو کیا ۔ ( پہلے طشت سے ) اپنے ہاتھوں پر پانی گرایا ۔ پھر تین بار ہاتھ دھوئے ، پھر اپنا ہاتھ طشت میں ڈالا ( اور پانی لیا ) پھر کلی کی ، ناک میں پانی ڈالا ، ناک صاف کی ، تین چلوؤں سے ، پھر اپنا ہاتھ طشت میں ڈالا اور تین مرتبہ منہ دھویا ۔ پھر اپنے دونوں ہاتھ کہنیوں تک دو بار دھوئے ۔ پھر اپنا ہاتھ طشت میں ڈالا اور سر کا مسح کیا ۔ ( پہلے ) آگے لائے پھر پیچھے لے گئے ، ایک بار ۔ پھر ٹخنوں تک اپنے دونوں پاؤں دھوئے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 101860,
        "last_updated": null
    },
    {
        "urduURN": 4001870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 187,
        "hadithSanad": "ہم سے آدم نے بیان کیا ، انھوں نے کہا ہم سے شعبہ نے بیان کیا ، انھوں نے کہا ہم سے حکم نے بیان کیا ، انھوں نے ابوحجیفہ رضی اللہ عنہ سے سنا ، وہ کہتے تھے کہ",
        "hadithText": "( ایک دن ) رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس دوپہر کے وقت تشریف لائے تو آپ صلی اللہ علیہ وسلم کے لیے وضو کا پانی حاضر کیا گیا جس سے آپ صلی اللہ علیہ وسلم نے وضو فرمایا ۔ لوگ آپ صلی اللہ علیہ وسلم کے وضو کا بچا ہوا پانی لے کر اسے ( اپنے بدن پر ) پھیرنے لگے ۔ آپ صلی اللہ علیہ وسلم نے ظہر کی دو رکعتیں ادا کیں اور عصر کی بھی دو رکعتیں اور آپ صلی اللہ علیہ وسلم کے سامنے ( آڑ کے لیے ) ایک نیزہ تھا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 101870,
        "last_updated": null
    },
    {
        "urduURN": 4001880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 188,
        "hadithSanad": "( اور ایک دوسری حدیث میں ) ابوموسیٰ اشعری رضی اللہ عنہ کہتے ہیں کہ",
        "hadithText": "نبی اکرم صلی اللہ علیہ وسلم نے ایک پیالہ منگوایا ۔ جس میں پانی تھا ۔ اس سے آپ صلی اللہ علیہ وسلم نے اپنے ہاتھ دھوئے اور اسی پیالہ میں منہ دھویا اور اس میں کلی فرمائی ، پھر فرمایا ، تو تم لوگ اس کو پی لو اور اپنے چہروں اور سینوں پر ڈال لو ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 101880,
        "last_updated": null
    },
    {
        "urduURN": 4001890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 189,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے یعقوب بن ابراہیم بن سعد نے ، کہا ہم سے میرے باپ نے ، انھوں نے صالح سے سنا ۔ انھوں نے ابن شہاب سے ، کہا انہیں محمود بن الربیع نے خبر دی ، ابن شہاب کہتے ہیں",
        "hadithText": "محمود وہی ہیں کہ جب وہ چھوٹے تھے تو رسول کریم صلی اللہ علیہ وسلم نے ان ہی کے کنویں ( کے پانی ) سے ان کے منہ میں کلی ڈالی تھی اور عروہ نے اسی حدیث کو مسور وغیرہ سے بھی روایت کیا ہے اور ہر ایک ( راوی ) ان دونوں میں سے ایک دوسرے کی تصدیق کرتے ہیں کہ جب رسول کریم صلی اللہ علیہ وسلم وضو فرماتے تو آپ صلی اللہ علیہ وسلم کے بچے ہوئے وضو کے پانی پر صحابہ رضی اللہ عنہم جھگڑنے کے قریب ہو جاتے تھے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 101890,
        "last_updated": null
    },
    {
        "urduURN": 4001900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 190,
        "hadithSanad": "ہم سے عبدالرحمٰن بن یونس نے بیان کیا ، انھوں نے کہا ہم سے حاتم بن اسماعیل نے جعد کے واسطے سے بیان کیا ، کہا انھوں نے سائب بن یزید سے سنا ، وہ کہتے تھے کہ",
        "hadithText": "میری خالہ مجھے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں لے گئیں اور عرض کیا کہ یا رسول اللہ ! میرا یہ بھانجا بیمار ہے ، آپ صلی اللہ علیہ وسلم نے میرے سر پر اپنا ہاتھ پھیرا اور میرے لیے برکت کی دعا فرمائی ، پھر آپ صلی اللہ علیہ وسلم نے وضو کیا اور میں نے آپ صلی اللہ علیہ وسلم کے وضو کا بچا ہوا پانی پیا ۔ پھر میں آپ صلی اللہ علیہ وسلم کی کمر کے پیچھے کھڑا ہو گیا اور میں نے مہر نبوت دیکھی جو آپ صلی اللہ علیہ وسلم کے مونڈھوں کے درمیان ایسی تھی جیسے چھپر کھٹ کی گھنڈی ۔ ( یا کبوتر کا انڈا ) ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 101900,
        "last_updated": null
    },
    {
        "urduURN": 4001910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 191,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، انھوں نے کہا ہم سے خالد بن عبداللہ نے بیان کیا ، ان سے عمرو بن یحییٰ نے اپنے باپ ( یحییٰ ) کے واسطے سے بیان کیا ، وہ عبداللہ بن زید رضی اللہ عنہ سے نقل کرتے ہیں کہ",
        "hadithText": "( وضو کرتے وقت ) انھوں نے برتن سے ( پہلے ) اپنے دونوں ہاتھوں پر پانی ڈالا ۔ پھر انہیں دھویا ۔ پھر دھویا ۔ ( یا یوں کہا کہ ) کلی کی اور ناک میں ایک چلو سے پانی ڈالا ۔ اور تین مرتبہ اسی طرح کیا ۔ پھر تین مرتبہ اپنا چہرہ دھویا پھر کہنیوں تک اپنے دونوں ہاتھ دو دو بار دھوئے ۔ پھر سر کا مسح کیا ۔ اگلی جانب اور پچھلی جانب کا اور ٹخنوں تک اپنے دونوں پاؤں دھوئے ، پھر کہا کہ رسول اللہ صلی اللہ علیہ وسلم کا وضو اسی طرح ہوا کرتا تھا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 101910,
        "last_updated": null
    },
    {
        "urduURN": 4001920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 192,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، انھوں نے کہا ہم سے وہیب نے بیان کیا ، ان سے عمرو بن یحییٰ نے اپنے باپ ( یحییٰ ) کے واسطے سے بیان کیا ، وہ کہتے ہیں کہ",
        "hadithText": "میری موجودگی میں عمرو بن حسن نے عبداللہ بن زید رضی اللہ عنہ سے رسول کریم صلی اللہ علیہ وسلم کے وضو کے بارے میں پوچھا ۔ تو عبداللہ بن زید رضی اللہ عنہ نے پانی کا ایک طشت منگوایا ، پھر ان ( لوگوں ) کے دکھانے کے لیے وضو ( شروع ) کیا ۔ ( پہلے ) طشت سے اپنے ہاتھوں پر پانی گرایا ۔ پھر انہیں تین بار دھویا ۔ پھر اپنا ہاتھ برتن کے اندر ڈالا ، پھر کلی کی اور ناک میں پانی ڈال کر ناک صاف کی ، تین چلوؤں سے تین دفعہ ۔ پھر اپنا ہاتھ برتن کے اندر ڈالا اور اپنے منہ کو تین بار دھویا ۔ پھر اپنا ہاتھ برتن کے اندر ڈالا اور دونوں ہاتھ کہنیوں تک دو دو بار دھوئے ( پھر ) سر پر مسح کیا اس طرح کہ ( پہلے ) آگے کی طرف اپنا ہاتھ لائے پھر پیچھے کی طرف لے گئے ۔ پھر برتن میں اپنا ہاتھ ڈالا اور اپنے دونوں پاؤں دھوئے ( دوسری روایت میں ) ہم سے موسیٰ نے ، ان سے وہیب نے بیان کیا کہ آپ نے سر کا مسح ایک دفعہ کیا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 101920,
        "last_updated": null
    },
    {
        "urduURN": 4001930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 193,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو مالک نے نافع سے خبر دی ، وہ عبداللہ بن عمر رضی اللہ عنہما سے روایت کرتے ہیں ۔ وہ فرماتے ہیں کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم کے زمانے میں عورت اور مرد سب ایک ساتھ ( ایک ہی برتن سے ) وضو کیا کرتے تھے ۔ ( یعنی وہ مرد اور عورتیں جو ایک دوسرے کے محرم ہوتے ) ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 101930,
        "last_updated": null
    },
    {
        "urduURN": 4001940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 194,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، انھوں نے کہا ہم سے شعبہ نے محمد بن المنکدر کے واسطے سے ، انھوں نے حضرت جابر رضی اللہ عنہ سے سنا ، وہ کہتے تھے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم میری مزاج پرسی کے لیے تشریف لائے ۔ میں بیمار تھا ایسا کہ مجھے ہوش تک نہیں تھا ۔ آپ صلی اللہ علیہ وسلم نے وضو کیا اور اپنے وضو کا پانی مجھ پر چھڑکا ، تو مجھے ہوش آ گیا ۔ میں نے عرض کیا ، یا رسول اللہ ! میرا وارث کون ہو گا ؟ میرا تو صرف ایک کلالہ وارث ہے ۔ اس پر آیت میراث نازل ہوئی ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 101940,
        "last_updated": null
    },
    {
        "urduURN": 4001950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 195,
        "hadithSanad": "ہم سے عبداللہ بن منیر نے بیان کیا ، انھوں نے عبداللہ بن بکر سے سنا ، کہا ہم کو حمید نے یہ حدیث بیان کی ۔ انھوں نے انس سے نقل کیا ۔ وہ کہتے ہیں کہ",
        "hadithText": "( ایک مرتبہ ) نماز کا وقت آ گیا ، تو جس شخص کا مکان قریب ہی تھا وہ وضو کرنے اپنے گھر چلا گیا اور کچھ لوگ ( جن کے مکان دور تھے ) رہ گئے ۔ تو رسول کریم صلی اللہ علیہ وسلم کے پاس پتھر کا ایک لگن لایا گیا ۔ جس میں کچھ پانی تھا اور وہ اتنا چھوٹا تھا کہ آپ اس میں اپنی ہتھیلی نہیں پھیلا سکتے تھے ۔ ( مگر ) سب نے اس برتن کے پانی سے وضو کر لیا ، ہم نے حضرت انس رضی اللہ عنہ سے پوچھا کہ تم کتنے نفر تھے ؟ کہا اسی ( 80 ) سے کچھ زیادہ ہی تھے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 101950,
        "last_updated": null
    },
    {
        "urduURN": 4001960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 196,
        "hadithSanad": "ہم سے محمد بن العلاء نے بیان کیا ، انھوں نے کہا ہم سے ابواسامہ نے برید کے واسطے سے بیان کیا ، وہ ابوبردہ سے ، وہ ابوموسیٰ رضی اللہ عنہ سے روایت کرتے ہیں کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے ایک پیالہ منگایا جس میں پانی تھا ۔ پھر اس میں آپ صلی اللہ علیہ وسلم نے اپنے دونوں ہاتھوں اور چہرے کو دھویا اور اسی میں کلی کی ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 101960,
        "last_updated": null
    },
    {
        "urduURN": 4001970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 197,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، انھوں نے کہا ہم سے عبدالعزیز بن ابی سلمہ نے بیان کیا ، ان سے عمرو بن یحییٰ نے اپنے باپ کے واسطے سے بیان کیا ، وہ عبداللہ بن زید سے نقل کرتے ہیں ، وہ کہتے ہیں کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم ( ہمارے گھر ) تشریف لائے ، ہم نے آپ صلی اللہ علیہ وسلم کے لیے تانبے کے برتن میں پانی نکالا ۔ ( اس سے ) آپ صلی اللہ علیہ وسلم نے وضو کیا ۔ تین بار چہرہ دھویا ، دو دو بار ہاتھ دھوئے اور سر کا مسح کیا ۔ ( اس طرح کہ ) پہلے آگے کی طرف ( ہاتھ ) لائے ۔ پھر پیچھے کی جانب لے گئے اور پیر دھوئے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 101970,
        "last_updated": null
    },
    {
        "urduURN": 4001980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 198,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے زہری سے خبر دی ، کہا مجھے عبیداللہ بن عبداللہ بن عتبہ نے خبر دی تحقیق حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ",
        "hadithText": "جب رسول کریم صلی اللہ علیہ وسلم بیمار ہوئے اور آپ صلی اللہ علیہ وسلم کی بیماری زیادہ ہو گئی تو آپ صلی اللہ علیہ وسلم نے اپنی ( دوسری ) بیویوں سے اس بات کی اجازت لے لی کہ آپ کی تیمارداری میرے ہی گھر کی جائے ۔ انھوں نے آپ کو اجازت دے دی ، ( ایک روز ) رسول کریم صلی اللہ علیہ وسلم دو آدمیوں کے درمیان ( سہارا لے کر ) گھر سے نکلے ۔ آپ کے پاؤں ( کمزوری کی وجہ سے ) زمین پر گھسٹتے جاتے تھے ، حضرت عباس رضی اللہ عنہ اور ایک آدمی کے درمیان ( آپ باہر ) نکلے تھے ۔ عبیداللہ ( راوی حدیث ) کہتے ہیں کہ میں نے یہ حدیث عبداللہ بن عباس رضی اللہ عنہما کو سنائی ، تو وہ بولے ، تم جانتے ہو دوسرا آدمی کون تھا ، میں نے عرض کیا کہ نہیں ۔ کہنے لگے وہ علی رضی اللہ عنہ تھے ۔ پھر حضرت عائشہ رضی اللہ عنہا بیان فرماتی تھیں کہ جب نبی کریم صلی اللہ علیہ وسلم اپنے گھر میں داخل ہوئے اور آپ صلی اللہ علیہ وسلم کا مرض بڑھ گیا ۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا میرے اوپر ایسی سات مشکوں کا پانی ڈالو ، جن کے سربند نہ کھولے گئے ہوں ۔ تاکہ میں ( سکون کے بعد ) لوگوں کو کچھ وصیت کروں ۔ ( چنانچہ ) آپ کو حضرت حفصہ رسول اللہ صلی اللہ علیہ وسلم کی ( دوسری ) بیوی کے لگن میں ( جو تانبے کا تھا ) بیٹھا دیا گیا اور ہم نے آپ پر ان مشکوں سے پانی بہانا شروع کیا ۔ جب آپ ہم کو اشارہ فرمانے لگے کہ بس اب تم نے اپنا کام پورا کر دیا تو اس کے بعد آپ لوگوں کے پاس باہر تشریف لے گئے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 101980,
        "last_updated": null
    },
    {
        "urduURN": 4001990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 199,
        "hadithSanad": "ہم سے خالد بن مخلد نے بیان کیا ، انھوں نے کہا ہم سے سلیمان نے ، کہا مجھ سے عمرو بن یحییٰ نے اپنے باپ ( یحییٰ ) کے واسطے سے بیان کیا ، وہ کہتے ہیں کہ",
        "hadithText": "میرے چچا بہت زیادہ وضو کیا کرتے تھے ( یا یہ کہ وضو میں بہت پانی بہاتے تھے ) ایک دن انھوں نے عبداللہ بن زید رضی اللہ عنہ سے کہا کہ مجھے بتلائیے رسول اللہ صلی اللہ علیہ وسلم کس طرح وضو کیا کرتے تھے ۔ انھوں نے پانی کا ایک طشت منگوایا ۔ اس کو ( پہلے ) اپنے ہاتھوں پر جھکایا ۔ پھر دونوں ہاتھ تین بار دھوئے ۔ پھر اپنا ہاتھ طشت میں ڈال کر ( پانی لیا اور ) ایک چلو سے کلی کی اور تین مرتبہ ناک صاف کی ۔ پھر اپنے ہاتھوں سے ایک چلو ( پانی ) لیا اور تین بار اپنا چہرہ دھویا ۔ پھر کہنیوں تک اپنے دونوں ہاتھ دو دو بار دھوئے ۔ پھر ہاتھ میں پانی لے کر اپنے سر کا مسح کیا ۔ تو ( پہلے اپنے ہاتھ ) پیچھے لے گئے ، پھر آگے کی طرف لائے ۔ پھر اپنے دونوں پاؤں دھوئے ۔ اور فرمایا کہ میں نے رسول کریم صلی اللہ علیہ وسلم کو اسی طرح وضو کرتے دیکھا ہے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 101990,
        "last_updated": null
    },
    {
        "urduURN": 4002000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 200,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے حماد نے ، وہ ثابت سے ، وہ حضرت انس رضی اللہ عنہ سے روایت کرتے ہیں کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے پانی کا ایک برتن طلب فرمایا ۔ تو آپ صلی اللہ علیہ وسلم کے لیے ایک چوڑے منہ کا پیالہ لایا گیا جس میں کچھ تھوڑا پانی تھا ، آپ صلی اللہ علیہ وسلم نے اپنی انگلیاں اس میں ڈال دیں ۔ انس کہتے ہیں کہ میں پانی کی طرف دیکھنے لگا ۔ پانی آپ صلی اللہ علیہ وسلم کی انگلیوں کے درمیان سے پھوٹ رہا تھا ۔ انس رضی اللہ عنہ کہتے ہیں کہ اس ( ایک پیالہ ) پانی سے جن لوگوں نے وضو کیا ، وہ ستر ( 70 ) سے اسی ( 80 ) تک تھے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 102000,
        "last_updated": null
    },
    {
        "urduURN": 4002010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 201,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے مسعر نے ، کہا مجھ سے ابن جبیر نے ، انھوں نے حضرت انس رضی اللہ عنہ کو یہ فرماتے ہوئے سنا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم جب دھوتے یا ( یہ کہا کہ ) جب نہاتے تو ایک صاع سے لے کر پانچ مد تک ( پانی استعمال فرماتے تھے ) اور جب وضو فرماتے تو ایک مد ( پانی ) سے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 102010,
        "last_updated": null
    },
    {
        "urduURN": 4002020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 202,
        "hadithSanad": "ہم سے اصبغ ابن الفرج نے بیان کیا ، وہ ابن وہب سے کرتے ہیں ، کہا مجھ سے عمرو نے بیان کیا ، کہا مجھ سے ابوالنضر نے ابوسلمہ بن عبدالرحمٰن کے واسطے سے نقل کیا ، وہ عبداللہ بن عمر سے ، وہ سعد بن ابی وقاص سے ، وہ رسول کریم صلی اللہ علیہ وسلم سے نقل کرتے ہیں کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے موزوں پر مسح کیا ۔ عبداللہ بن عمر رضی اللہ عنہما نے اپنے والد ماجد عمر رضی اللہ عنہ سے اس کے بارے میں پوچھا تو انھوں نے کہا ( سچ ہے اور یاد رکھو ) جب تم سے سعد رسول اللہ صلی اللہ علیہ وسلم کی کوئی حدیث بیان فرمائیں ۔ تو اس کے متعلق ان کے سوا ( کسی ) دوسرے آدمی سے مت پوچھو اور موسیٰ بن عقبہ کہتے ہیں کہ مجھے ابوالنضر نے بتلایا ، انہیں ابوسلمہ نے خبر دی کہ سعد بن ابی وقاص نے ان سے ( رسول اللہ صلی اللہ علیہ وسلم کی یہ ) حدیث بیان کی ۔ پھر عمر رضی اللہ عنہ نے ( اپنے بیٹے ) عبداللہ سے ایسا کہا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 102020,
        "last_updated": null
    },
    {
        "urduURN": 4002030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 203,
        "hadithSanad": "ہم سے عمرو بن خالد الحرانی نے بیان کیا ، کہا ہم سے لیث نے یحییٰ بن سعید کے واسطے سے نقل کیا ، وہ سعد بن ابراہیم سے ، وہ نافع بن جبیر سے وہ عروہ ابن المغیرہ سے وہ اپنے باپ مغیرہ بن شعبہ سے روایت کرتے ہیں وہ رسول کریم صلی اللہ علیہ وسلم سے نقل کرتے ہیں ۔",
        "hadithText": "( ایک دفعہ ) آپ صلی اللہ علیہ وسلم رفع حاجت کے لیے باہر گئے تو مغیرہ پانی کا ایک برتن لے کر آپ صلی اللہ علیہ وسلم کے پیچھے گئے ، جب آپ صلی اللہ علیہ وسلم قضاء حاجت سے فارغ ہو گئے تو مغیرہ نے ( آپ صلی اللہ علیہ وسلم کو وضو کراتے ہوئے ) آپ صلی اللہ علیہ وسلم ( کے اعضاء مبارکہ ) پر پانی ڈالا ۔ آپ صلی اللہ علیہ وسلم نے وضو کیا اور موزوں پر مسح فرمایا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 102030,
        "last_updated": null
    },
    {
        "urduURN": 4002040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 204,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے شیبان نے یحییٰ کے واسطے سے نقل کیا ، وہ ابوسلمہ سے ، انھوں نے جعفر بن عمرو بن امیہ الضمری سے نقل کیا ، انہیں ان کے باپ نے خبر دی کہ",
        "hadithText": "انھوں نے رسول کریم صلی اللہ علیہ وسلم کو موزوں پر مسح کرتے ہوئے دیکھا ۔ اس حدیث کی متابعت میں حرب اور ابان نے یحییٰ سے حدیث نقل کی ہے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 102040,
        "last_updated": null
    },
    {
        "urduURN": 4002050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 205,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا ہمیں عبداللہ نے خبر دی ، کہا ہم کو اوزاعی نے یحییٰ کے واسطے سے خبر دی ، وہ ابوسلمہ سے ، وہ جعفر بن عمرو سے ، وہ اپنے باپ سے روایت کرتے ہیں کہ",
        "hadithText": "میں نے رسول کریم صلی اللہ علیہ وسلم کو اپنے عمامے اور موزوں پر مسح کرتے دیکھا ۔ اس کو روایت کیا معمر نے یحییٰ سے ، وہ ابوسلمہ سے ، انھوں نے عمرو سے متابعت کی اور کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا ( آپ واقعی ایسا ہی کیا کرتے تھے ) ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 102050,
        "last_updated": null
    },
    {
        "urduURN": 4002060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 206,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے زکریا نے یحییٰ کے واسطے سے نقل کیا ، وہ عامر سے وہ عروہ بن مغیرہ سے ، وہ اپنے باپ ( مغیرہ ) سے روایت کرتے ہیں کہ",
        "hadithText": "میں ایک سفر میں رسول کریم صلی اللہ علیہ وسلم کے ساتھ تھا ، تو میں نے چاہا ( کہ وضو کرتے وقت ) آپ صلی اللہ علیہ وسلم کے موزے اتار ڈالوں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ انہیں رہنے دو ۔ چونکہ جب میں نے انہیں پہنا تھا تو میرے پاؤں پاک تھے ۔ ( یعنی میں وضو سے تھا ) پس آپ صلی اللہ علیہ وسلم نے ان پر مسح کیا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 102060,
        "last_updated": null
    },
    {
        "urduURN": 4002070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 207,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انھوں نے کہا ہمیں امام مالک نے زید بن اسلم سے خبر دی ، وہ عطاء بن یسار سے ، وہ عبداللہ بن عباس رضی اللہ عنہما سے نقل کرتے ہیں کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے بکری کا شانہ کھایا ۔ پھر نماز پڑھی اور وضو نہیں کیا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 102070,
        "last_updated": null
    },
    {
        "urduURN": 4002080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 208,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہمیں لیث نے عقیل سے خبر دی ، وہ ابن شہاب سے روایت کرتے ہیں ، انہیں جعفر بن عمرو بن امیہ نے اپنے باپ عمرو سے خبر دی کہ",
        "hadithText": "انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ صلی اللہ علیہ وسلم بکری کے شانہ سے کاٹ کاٹ کر کھا رہے تھے ، پھر آپ صلی اللہ علیہ وسلم نماز کے لیے بلائے گئے تو آپ صلی اللہ علیہ وسلم نے چھری ڈال دی اور نماز پڑھی ، نیا وضو نہیں کیا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 102080,
        "last_updated": null
    },
    {
        "urduURN": 4002090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 209,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا مجھے امام مالک نے یحیٰی بن سعید کے واسطے سے خبر دی ، وہ بشیر بن یسار بنی حارثہ کے آزاد کردہ غلام سے روایت کرتے ہیں کہ سوید بن نعمان رضی اللہ عنہ نے انہیں خبر دی کہ",
        "hadithText": "فتح خیبر والے سال وہ رسول کریم صلی اللہ علیہ وسلم کے ساتھ صہبا کی طرف ، جو خیبر کے قریب ایک جگہ ہے پہنچے ۔ آپ صلی اللہ علیہ وسلم نے عصر کی نماز پڑھی ، پھر ناشتہ منگوایا گیا تو سوائے ستو کے اور کچھ نہیں لایا گیا ۔ پھر آپ صلی اللہ علیہ وسلم نے حکم دیا تو وہ بھگو دیے گئے ۔ پھر رسول کریم صلی اللہ علیہ وسلم نے کھایا اور ہم نے ( بھی ) کھایا ۔ پھر مغرب ( کی نماز ) کے لئے کھڑے ہو گئے ۔ آپ صلی اللہ علیہ وسلم نے کلی کی اور ہم نے ( بھی ) پھر آپ صلی اللہ علیہ وسلم نے نماز پڑھی اور نیا وضو نہیں کیا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 102090,
        "last_updated": null
    },
    {
        "urduURN": 4002100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 210,
        "hadithSanad": "ہم سے اصبغ نے بیان کیا ، کہا مجھے ابن وہب نے خبر دی ، کہا مجھے عمرو نے بکیر سے ، انھوں نے کریب سے ، ان کو حضرت میمونہ زوجہ رسول کریم صلی اللہ علیہ وسلم نے بتلایا کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے ان کے یہاں ( بکری کا ) شانہ کھایا پھر نماز پڑھی اور نیا وضو نہیں فرمایا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 102100,
        "last_updated": null
    },
    {
        "urduURN": 4002110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 211,
        "hadithSanad": "ہم سے یحییٰ بن بکیر اور قتیبہ نے بیان کیا ، انھوں نے کہا ہم سے لیث نے بیان کیا ، وہ عقیل سے ، وہ ابن شہاب سے ، وہ عبیداللہ بن عبداللہ بن عتبہ سے ، وہ عبداللہ بن عباس رضی اللہ عنہما سے روایت کرتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے دودھ پیا ، پھر کلی کی اور فرمایا اس میں چکنائی ہوتی ہے ۔ اس حدیث میں عقیل کی یونس اور صالح بن کیسان نے زہری سے متابعت کی ہے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 102110,
        "last_updated": null
    },
    {
        "urduURN": 4002120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 212,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا مجھ کو مالک نے ہشام سے ، انھوں نے اپنے باپ سے خبر دی ، انھوں نے عائشہ رضی اللہ عنہا سے نقل کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا کہ جب نماز پڑھتے وقت تم میں سے کسی کو اونگھ آ جائے ، تو چاہیے کہ وہ سو رہے یہاں تک کہ نیند ( کا اثر ) اس سے ختم ہو جائے ۔ اس لیے کہ جب تم میں سے کوئی شخص نماز پڑھنے لگے اور وہ اونگھ رہا ہو تو وہ کچھ نہیں جانے گا کہ وہ ( خدا سے ) مغفرت طلب کر رہا ہے یا اپنے نفس کو بددعا دے رہا ہے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 102120,
        "last_updated": null
    },
    {
        "urduURN": 4002130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 213,
        "hadithSanad": "ہم سے ابومعمر نے بیان کیا ، کہا ہم سے عبدالوارث نے ، کہا ہم سے ایوب نے ابوقلابہ کے واسطے سے نقل کیا ، وہ حضرت انس رضی اللہ عنہ سے روایت کرتے ہیں ، وہ رسول اللہ صلی اللہ علیہ وسلم سے",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب تم نماز میں اونگھنے لگو تو سو جانا چاہیے ۔ پھر اس وقت نماز پڑھے جب جان لے کہ وہ کیا پڑھ رہا ہے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 102130,
        "last_updated": null
    },
    {
        "urduURN": 4002140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 214,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے سفیان نے عمرو بن عامر کے واسطے سے بیان کیا ، کہا میں نے حضرت انس رضی اللہ عنہ سے سنا ۔ ( دوسری سند سے ) ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے ، وہ سفیان سے روایت کرتے ہیں ، ان سے عمرو بن عامر نے بیان کیا ، وہ حضرت انس رضی اللہ عنہ سے روایت کرتے ہیں ۔ انھوں نے فرمایا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم ہر نماز کے لیے نیا وضو فرمایا کرتے تھے ۔ میں نے کہا تم لوگ کس طرح کرتے تھے ، کہنے لگے ہم میں سے ہر ایک کو اس کا وضو اس وقت تک کافی ہوتا ، جب تک کوئی وضو توڑنے والی چیز پیش نہ آ جاتی ۔ ( یعنی پیشاب ، پاخانہ ، یا نیند وغیرہ ) ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 102140,
        "last_updated": null
    },
    {
        "urduURN": 4002150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 215,
        "hadithSanad": "ہم سے خالد بن مخلد نے بیان کیا ، انھوں نے کہا ہم سے سلیمان نے بیان کیا ، انھوں نے کہا مجھے یحییٰ بن سعید نے خبر دی ، انہیں بشیر بن یسار نے خبر دی ، انھوں نے کہا مجھے سوید بن نعمان رضی اللہ عنہ نے بتلایا انھوں نے کہا کہ",
        "hadithText": "ہم خیبر والے سال رسول کریم صلی اللہ علیہ وسلم کے ہمراہ جب صہباء میں پہنچے تو رسول کریم صلی اللہ علیہ وسلم نے ہمیں عصر کی نماز پڑھائی ۔ جب نماز پڑھ چکے تو آپ صلی اللہ علیہ وسلم نے کھانے منگوائے ۔ مگر ( کھانے میں ) صرف ستو ہی لایا گیا ۔ سو ہم نے ( اسی کو ) کھایا اور پیا ۔ پھر رسول کریم صلی اللہ علیہ وسلم مغرب کی نماز کے لیے کھڑے ہو گئے ۔ تو آپ صلی اللہ علیہ وسلم نے کلی کی ، پھر ہمیں مغرب کی نماز پڑھائی اور ( نیا ) وضو نہیں کیا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 102150,
        "last_updated": null
    },
    {
        "urduURN": 4002160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 216,
        "hadithSanad": "ہم سے عثمان نے بیان کیا ، کہا ہم سے جریر نے منصور کے واسطے سے نقل کیا ، وہ مجاہد سے وہ ابن عباس رضی اللہ عنہما سے روایت کرتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم ایک دفعہ مدینہ یا مکے کے ایک باغ میں تشریف لے گئے ۔ ( وہاں ) آپ صلی اللہ علیہ وسلم نے دو شخصوں کی آواز سنی جنھیں ان کی قبروں میں عذاب کیا جا رہا تھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ان پر عذاب ہو رہا ہے اور کسی بہت بڑے گناہ کی وجہ سے نہیں پھر آپ صلی اللہ علیہ وسلم نے فرمایا بات یہ ہے کہ ایک شخص ان میں سے پیشاب کے چھینٹوں سے بچنے کا اہتمام نہیں کرتا تھا اور دوسرا شخص چغل خوری کیا کرتا تھا ۔ پھر آپ صلی اللہ علیہ وسلم نے ( کھجور کی ) ایک ڈالی منگوائی اور اس کو توڑ کر دو ٹکڑے کیا اور ان میں سے ( ایک ایک ٹکڑا ) ہر ایک کی قبر پر رکھ دیا ۔ لوگوں نے آپ صلی اللہ علیہ وسلم سے پوچھا کہ یا رسول اللہ ! یہ آپ صلی اللہ علیہ وسلم نے کیوں کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا اس لیے کہ جب تک یہ ڈالیاں خشک ہوں شاید اس وقت تک ان پر عذاب کم ہو جائے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 102160,
        "last_updated": null
    },
    {
        "urduURN": 4002170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 217,
        "hadithSanad": "ہم سے یعقوب بن ابراہیم نے بیان کیا ، انھوں نے کہا ہم کو اسماعیل بن ابراہیم نے خبر دی ، کہا مجھے روح بن القاسم نے بتلایا ، کہا مجھ سے عطاء بن ابی میمونہ نے بیان کیا ، وہ انس بن مالک رضی اللہ عنہ سے روایت کرتے ہیں کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم جب رفع حاجت کے لیے باہر تشریف لے جاتے تو میں آپ صلی اللہ علیہ وسلم کے پاس پانی لاتا ۔ آپ صلی اللہ علیہ وسلم اس سے استنجاء فرماتے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 102170,
        "last_updated": null
    },
    {
        "urduURN": 4002180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 218,
        "hadithSanad": "ہم سے محمد بن المثنی نے بیان کیا ، انھوں نے کہا ہم سے محمد بن حازم نے بیان کیا ، انھوں نے کہا ہم سے اعمش نے مجاہد کے واسطے سے روایت کیا ، وہ طاؤس سے ، وہ حضرت عبداللہ بن عباس رضی اللہ عنہما سے روایت کرتے ہیں کہ",
        "hadithText": "( ایک مرتبہ ) رسول اللہ صلی اللہ علیہ وسلم دو قبروں پر گزرے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ ان دونوں قبر والوں کو عذاب دیا جا رہا ہے اور کسی بڑے گناہ پر نہیں ۔ ایک تو ان میں سے پیشاب سے احتیاط نہیں کرتا تھا اور دوسرا چغل خوری کیا کرتا تھا ۔ پھر آپ صلی اللہ علیہ وسلم نے ایک ہری ٹہنی لے کر بیچ سے اس کے دو ٹکڑے کئے اور ہر ایک قبر پر ایک ٹکڑا گاڑ دیا ۔ لوگوں نے پوچھا کہ یا رسول اللہ ! آپ صلی اللہ علیہ وسلم نے ( ایسا ) کیوں کیا ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ، شاید جب تک یہ ٹہنیاں خشک نہ ہوں ان پر عذاب میں کچھ تخفیف رہے ۔ ابن المثنی نے کہا کہ اس حدیث کو ہم سے وکیع نے بیان کیا ، ان سے اعمش نے ، انھوں نے مجاہد سے اسی طرح سنا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 102180,
        "last_updated": null
    },
    {
        "urduURN": 4002190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 219,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ہمام نے ، کہا ہم سے اسحاق نے انس بن مالک کے واسطے سے نقل کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے ایک دیہاتی کو مسجد میں پیشاب کرتے ہوئے دیکھا تو لوگوں سے آپ صلی اللہ علیہ وسلم نے فرمایا اسے چھوڑ دو جب وہ فارغ ہو گیا تو پانی منگا کر آپ نے ( اس جگہ ) بہا دیا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 102190,
        "last_updated": null
    },
    {
        "urduURN": 4002200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 220,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، انھوں نے کہا ہمیں شعیب نے زہری کے واسطے سے خبر دی ، انھوں نے کہا مجھے عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے خبر دی کہ حضرت ابوہریرہ رضی اللہ عنہ نے فرمایا کہ",
        "hadithText": "ایک اعرابی کھڑا ہو کر مسجد میں پیشاب کرنے لگا ۔ تو لوگ اس پر جھپٹنے لگے ۔ ( یہ دیکھ کر ) رسول کریم صلی اللہ علیہ وسلم نے لوگوں سے فرمایا کہ اسے چھوڑ دو اور اس کے پیشاب پر پانی کا بھرا ہوا ڈول یا کچھ کم بھرا ہوا ڈول بہا دو ۔ کیونکہ تم نرمی کے لیے بھیجے گئے ہو ، سختی کے لیے نہیں ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 102200,
        "last_updated": null
    },
    {
        "urduURN": 4002210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 221,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا ہمیں عبداللہ نے خبر دی ، کہا ہمیں یحییٰ بن سعید نے خبر دی ، کہا میں نے انس بن مالک رضی اللہ عنہ سے سنا ، وہ رسول کریم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ",
        "hadithText": "ایک دیہاتی شخص آیا اور اس نے مسجد کے ایک کونے میں پیشاب کر دیا ۔ لوگوں نے اس کو منع کیا تو رسول کریم صلی اللہ علیہ وسلم نے انہیں روک دیا ۔ جب وہ پیشاب کر کے فارغ ہوا تو آپ صلی اللہ علیہ وسلم نے اس ( کے پیشاب ) پر ایک ڈول پانی بہانے کا حکم دیا ۔ چنانچہ بہا دیا گیا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 102210,
        "last_updated": null
    },
    {
        "urduURN": 4002220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے خالد بن مخلد نے بیان کیا ، کہا ہم سے سلیمان نے یحییٰ بن سعید کے واسطے سے بیان کیا ، کہا میں نے انس بن مالک رضی اللہ عنہ سے سنا ، وہ کہتے ہیں کہ",
        "hadithText": "ایک دیہاتی شخص آیا اور اس نے مسجد کے ایک کونے میں پیشاب کر دیا ۔ لوگوں نے اس کو منع کیا تو رسول کریم صلی اللہ علیہ وسلم نے انہیں روک دیا ۔ جب وہ پیشاب کر کے فارغ ہوا تو آپ صلی اللہ علیہ وسلم نے اس ( کے پیشاب ) پر ایک ڈول پانی بہانے کا حکم دیا ۔ چنانچہ بہا دیا گیا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 0,
        "last_updated": null
    },
    {
        "urduURN": 4002230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 222,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو مالک نے ہشام بن عروہ سے خبر دی ، انھوں نے اپنے باپ ( عروہ ) سے ، انھوں نے ام المؤمنین حضرت عائشہ رضی اللہ عنہا سے روایت کی ہے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم کے پاس ایک بچہ لایا گیا ۔ اس نے آپ صلی اللہ علیہ وسلم کے کپڑے پر پیشاب کر دیا تو آپ صلی اللہ علیہ وسلم نے پانی منگایا اور اس پر ڈال دیا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 102230,
        "last_updated": null
    },
    {
        "urduURN": 4002240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 223,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہمیں مالک نے ابن شہاب سے خبر دی ، وہ عبیداللہ بن عبداللہ بن عتبہ ( بن مسعود ) سے یہ حدیث روایت کرتے ہیں ، وہ ام قیس بنت محصن نامی ایک خاتون سے کہ",
        "hadithText": "وہ رسول کریم صلی اللہ علیہ وسلم کی خدمت اقدس میں اپنا چھوٹا بچہ لے کر آئیں ۔ جو کھانا نہیں کھاتا تھا ۔ ( یعنی شیرخوار تھا ) رسول کریم صلی اللہ علیہ وسلم نے اسے اپنی گود میں بٹھا لیا ۔ اس بچے نے آپ صلی اللہ علیہ وسلم کے کپڑے پر پیشاب کر دیا ۔ آپ صلی اللہ علیہ وسلم نے پانی منگا کر کپڑے پر چھڑک دیا اور اسے نہیں دھویا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 102240,
        "last_updated": null
    },
    {
        "urduURN": 4002250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 224,
        "hadithSanad": "ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے اعمش کے واسطے سے نقل کیا ، وہ ابووائل سے ، وہ حذیفہ رضی اللہ عنہ سے روایت کرتے ہیں کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کسی قوم کی کوڑی پر تشریف لائے ( پس ) آپ صلی اللہ علیہ وسلم نے وہاں کھڑے ہو کر پیشاب کیا ۔ پھر پانی منگایا ۔ میں آپ صلی اللہ علیہ وسلم کے پاس پانی لے کر آیا تو آپ صلی اللہ علیہ وسلم نے وضو فرمایا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 102250,
        "last_updated": null
    },
    {
        "urduURN": 4002260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 225,
        "hadithSanad": "ہم سے عثمان ابن ابی شیبہ نے بیان کیا ، کہا ہم سے جریر نے منصور کے واسطے سے بیان کیا ، وہ ابووائل سے ، وہ حذیفہ سے روایت کرتے ہیں ۔ وہ کہتے ہیں کہ",
        "hadithText": "( ایک مرتبہ ) میں اور رسول کریم صلی اللہ علیہ وسلم جا رہے تھے کہ ایک قوم کی کوڑی پر ( جو ) ایک دیوار کے پیچھے ( تھی ) پہنچے ۔ تو آپ صلی اللہ علیہ وسلم اس طرح کھڑے ہو گئے جس طرح ہم تم میں سے کوئی ( شخص ) کھڑا ہوتا ہے ۔ پھر آپ صلی اللہ علیہ وسلم نے پیشاب کیا اور میں ایک طرف ہٹ گیا ۔ تب آپ صلی اللہ علیہ وسلم نے مجھے اشارہ کیا تو آپ صلی اللہ علیہ وسلم کے پاس ( پردہ کی غرض سے ) آپ صلی اللہ علیہ وسلم کی ایڑیوں کے قریب کھڑا ہو گیا ۔ یہاں تک کہ آپ صلی اللہ علیہ وسلم پیشاب سے فارغ ہو گئے ۔ ( بوقت ضرورت ایسا بھی کیا جا سکتا ہے ۔ )</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 102260,
        "last_updated": null
    },
    {
        "urduURN": 4002270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 226,
        "hadithSanad": "ہم سے محمد بن عرعرہ نے بیان کیا ، کہا ہم سے شعبہ نے منصور کے واسطے سے بیان کیا ، وہ ابووائل سے نقل کرتے ہیں ، وہ کہتے ہیں کہ",
        "hadithText": "ابوموسیٰ اشعری پیشاب ( کے بارہ ) میں سختی سے کام لیتے تھے اور کہتے تھے کہ بنی اسرائیل میں جب کسی کے کپڑے کو پیشاب لگ جاتا ۔ تو اسے کاٹ ڈالتے ۔ ابوحذیفہ کہتے ہیں کہ کاش ! وہ اپنے اس تشدد سے رک جاتے ( کیونکہ ) رسول اللہ صلی اللہ علیہ وسلم کسی قوم کی کوڑی پر تشریف لائے اور آپ صلی اللہ علیہ وسلم نے وہاں کھڑے ہو کر پیشاب کیا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 102270,
        "last_updated": null
    },
    {
        "urduURN": 4002280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 227,
        "hadithSanad": "ہم سے محمد ابن المثنی نے بیان کیا ، انھوں نے کہا ہم سے یحییٰ نے ہشام کے واسطے سے بیان کیا ، ان سے فاطمہ نے اسماء کے واسطے سے ، وہ کہتی ہیں کہ",
        "hadithText": "ایک عورت نے رسول کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر عرض کی کہ حضور فرمائیے ہم میں سے کسی عورت کو کپڑے میں حیض آ جائے ( تو ) وہ کیا کرے ، آپ صلی اللہ علیہ وسلم نے فرمایا ( کہ پہلے ) اسے کھرچے ، پھر پانی سے رگڑے اور پانی سے دھو ڈالے اور اسی کپڑے میں نماز پڑھ لے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 102280,
        "last_updated": null
    },
    {
        "urduURN": 4002290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 228,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا مجھ سے ابومعاویہ نے ، کہا ہم سے ہشام بن عروہ نے اپنے باپ ( عروہ ) کے واسطے سے ، وہ حضرت عائشہ رضی اللہ عنہا سے نقل کرتے ہیں ، وہ فرماتی ہیں کہ",
        "hadithText": "ابوحبیش کی بیٹی فاطمہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور اس نے کہا کہ میں ایک ایسی عورت ہوں جسے استحاضہ کی بیماری ہے ۔ اس لیے میں پاک نہیں رہتی تو کیا میں نماز چھوڑ دوں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا نہیں ، یہ ایک رگ ( کا خون ) ہے حیض نہیں ہے ۔ تو جب تجھے حیض آئے تو نماز چھوڑ دے اور جب یہ دن گزر جائیں تو اپنے ( بدن اور کپڑے ) سے خون کو دھو ڈال پھر نماز پڑھ ۔ ہشام کہتے ہیں کہ میرے باپ عروہ نے کہا کہ حضور صلی اللہ علیہ وسلم نے یہ ( بھی ) فرمایا کہ پھر ہر نماز کے لیے وضو کر یہاں تک کہ وہی ( حیض کا ) وقت پھر آ جائے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 102290,
        "last_updated": null
    },
    {
        "urduURN": 4002300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 229,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا مجھے عبداللہ ابن مبارک نے خبر دی ، کہا مجھے عمرو بن میمون الجزری نے بتلایا ، وہ سلیمان بن یسار سے ، وہ حضرت عائشہ رضی اللہ عنہا سے ۔ آپ فرماتی ہیں کہ",
        "hadithText": "میں رسول کریم صلی اللہ علیہ وسلم کے کپڑے سے جنابت کو دھوتی تھی ۔ پھر ( اس کو پہن کر ) آپ صلی اللہ علیہ وسلم نماز کے لیے تشریف لے جاتے اور پانی کے دھبے آپ صلی اللہ علیہ وسلم کے کپڑے میں ہوتے تھے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 102300,
        "last_updated": null
    },
    {
        "urduURN": 4002310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 230,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، کہا ہم سے یزید نے ، کہا ہم سے عمرو نے سلیمان سے روایت کیا ، انھوں نے کہا کہ میں نے حضرت عائشہ رضی اللہ عنہا سے سنا ( دوسری سند یہ ہے ) ہم سے مسدد نے بیان کیا ، کہا ہم سے عبدالواحد نے ، کہا ہم سے عمرو بن میمون نے سلیمان بن یسار کے واسطے سے نقل کیا ، وہ کہتے ہیں کہ",
        "hadithText": "میں نے حضرت عائشہ رضی اللہ عنہا سے اس منی کے بارہ میں پوچھا جو کپڑے کو لگ جائے ۔ تو انھوں نے فرمایا کہ میں منی کو رسول کریم صلی اللہ علیہ وسلم کے کپڑے سے دھو ڈالتی تھی پھر آپ نماز کے لیے باہر تشریف لے جاتے اور دھونے کا نشان ( یعنی ) پانی کے دھبے آپ صلی اللہ علیہ وسلم کے کپڑے میں باقی ہوتے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 102310,
        "last_updated": null
    },
    {
        "urduURN": 4002320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 231,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انھوں نے کہا ہم سے عبدالواحد نے بیان کیا ، انھوں نے کہا ہم سے عمرو بن میمون نے ، وہ کہتے ہیں کہ",
        "hadithText": "میں نے اس کپڑے کے متعلق جس میں جنابت ( ناپاکی ) کا اثر آ گیا ہو ، سلیمان بن یسار سے سنا وہ کہتے تھے کہ حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ میں رسول کریم صلی اللہ علیہ وسلم کے کپڑے سے منی کو دھو ڈالتی تھی پھر آپ صلی اللہ علیہ وسلم نماز کے لیے باہر نکلتے اور دھونے کا نشان یعنی پانی کے دھبے کپڑے میں ہوتے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 102320,
        "last_updated": null
    },
    {
        "urduURN": 4002330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 232,
        "hadithSanad": "ہم سے عمرو بن خالد نے بیان کیا ، کہا ہم سے زہیر نے ، کہا ہم سے عمرو بن میمون بن مہران نے ، انھوں نے سلیمان بن یسار سے ، وہ حضرت عائشہ رضی اللہ عنہا سے روایت کرتے ہیں کہ",
        "hadithText": "وہ رسول کریم صلی اللہ علیہ وسلم کے کپڑے سے منی کو دھو ڈالتی تھیں ( وہ فرماتی ہیں کہ ) پھر ( کبھی ) میں ایک دھبہ یا کئی دھبے دیکھتی تھی ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 102330,
        "last_updated": null
    },
    {
        "urduURN": 4002340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 233,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، انھوں نے حماد بن زید سے ، وہ ایوب سے ، وہ ابوقلابہ سے ، وہ حضرت انس رضی اللہ عنہ سے روایت کرتے ہیں کہ",
        "hadithText": "کچھ لوگ عکل یا عرینہ ( قبیلوں ) کے مدینہ میں آئے اور بیمار ہو گئے ۔ رسول اللہ صلی اللہ علیہ وسلم نے انہیں لقاح میں جانے کا حکم دیا اور فرمایا کہ وہاں اونٹوں کا دودھ اور پیشاب پئیں ۔ چنانچہ وہ لقاح چلے گئے اور جب اچھے ہو گئے تو رسول کریم صلی اللہ علیہ وسلم کے چرواہے کو قتل کر کے وہ جانوروں کو ہانک کر لے گئے ۔ علی الصبح رسول کریم صلی اللہ علیہ وسلم کے پاس ( اس واقعہ کی ) خبر آئی ۔ تو آپ نے ان کے پیچھے آدمی دوڑائے ۔ دن چڑھے وہ حضور صلی اللہ علیہ وسلم کی خدمت میں پکڑ کر لائے گئے ۔ آپ کے حکم کے مطابق ان کے ہاتھ پاؤں کاٹ دئیے گئے اور آنکھوں میں گرم سلاخیں پھیر دی گئیں اور ( مدینہ کی ) پتھریلی زمین میں ڈال دئیے گئے ۔ ( پیاس کی شدت سے ) وہ پانی مانگتے تھے مگر انہیں پانی نہیں دیا جاتا تھا ۔ ابوقلابہ نے ( ان کے جرم کی سنگینی ظاہر کرتے ہوئے ) کہا کہ ان لوگوں نے چوری کی اور چرواہوں کو قتل کیا اور ( آخر ) ایمان سے پھر گئے اور اللہ اور اس کے رسول سے جنگ کی ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 102340,
        "last_updated": null
    },
    {
        "urduURN": 4002350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 234,
        "hadithSanad": "ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے ، کہا مجھے ابوالتیاح یزید بن حمید نے حضرت انس رضی اللہ عنہ سے خبر دی ، وہ کہتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم مسجد کی تعمیر سے پہلے نماز بکریوں کے باڑے میں پڑھ لیا کرتے تھے ۔ ( معلوم ہوا کہ بکریوں وغیرہ کے باڑے میں بوقت ضرورت نماز پڑھی جا سکتی ہے ) ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 102350,
        "last_updated": null
    },
    {
        "urduURN": 4002360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 235,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، انھوں نے کہا مجھ کو مالک نے ابن شہاب کے واسطے سے روایت کی ، وہ عبیداللہ بن عبداللہ بن عتبہ بن مسعود سے ، وہ حضرت عبداللہ بن عباس رضی اللہ عنہما سے وہ ام المؤمنین حضرت میمونہ رضی اللہ عنہا سے روایت کرتے ہیں کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم سے چوہے کے بارہ میں پوچھا گیا جو گھی میں گر گیا تھا ۔ فرمایا اس کو نکال دو اور اس کے آس پاس ( کے گھی ) کو نکال پھینکو اور اپنا ( باقی ) گھی استعمال کرو ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 102360,
        "last_updated": null
    },
    {
        "urduURN": 4002370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 236,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے معن نے ، کہا ہم سے مالک نے ابن شہاب کے واسطے سے بیان کیا ، وہ عبیداللہ ابن عبداللہ بن عتبہ بن مسعود سے ، وہ ابن عباس رضی اللہ عنہما سے وہ حضرت میمونہ رضی اللہ عنہا سے نقل کرتے ہیں کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم سے چوہے کے بارے میں دریافت کیا گیا جو گھی میں گر گیا تھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس چوہے کو اور اس کے آس پاس کے گھی کو نکال کر پھینک دو ۔ معن کہتے ہیں کہ مالک نے اتنی بار کہ میں گن نہیں سکتا ( یہ حدیث ) ابن عباس سے اور انھوں نے حضرت میمونہ رضی اللہ عنہا سے روایت کی ہے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 102370,
        "last_updated": null
    },
    {
        "urduURN": 4002380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 237,
        "hadithSanad": "ہم سے احمد بن محمد نے بیان کیا ، انھوں نے کہا ہمیں عبداللہ نے خبر دی ، انھوں نے کہا مجھے معمر نے ہمام بن منبہ سے خبر دی اور وہ حضرت ابوہریرہ رضی اللہ عنہ سے روایت کرتے ہیں ، وہ رسول اللہ صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا ہر زخم جو اللہ کی راہ میں مسلمان کو لگے وہ قیامت کے دن اسی حالت میں ہو گا جس طرح وہ لگا تھا ۔ اس میں سے خون بہتا ہو گا ۔ جس کا رنگ ( تو ) خون کا سا ہو گا اور خوشبو مشک کی سی ہو گی ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 102380,
        "last_updated": null
    },
    {
        "urduURN": 4002390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 238,
        "hadithSanad": "ہم سے ابوالیمان بیان کیا ، کہا ہم کو شعیب نے خبر دی ، کہا مجھے ابوالزناد نے خبر دی کہ ان سے عبدالرحمٰن بن ہرمزالاعرج نے بیان کیا ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم فرماتے تھے کہ",
        "hadithText": "ہم ( لوگ ) دنیا میں پچھلے زمانے میں آئے ہیں ( مگر آخرت میں ) سب سے آگے ہیں ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 102390,
        "last_updated": null
    },
    {
        "urduURN": 4002400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 239,
        "hadithSanad": "اور اسی سند سے",
        "hadithText": "( یہ بھی ) فرمایا کہ تم میں سے کوئی ٹھہرے ہوئے پانی میں جو جاری نہ ہو پیشاب نہ کرے ۔ پھر اسی میں غسل کرنے لگے ؟</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 102400,
        "last_updated": null
    },
    {
        "urduURN": 4002410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 240,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا مجھے میرے باپ ( عثمان ) نے شعبہ سے خبر دی ، انھوں نے ابواسحاق سے ، انھوں نے عمرو بن میمون سے ، انھوں نے عبداللہ سے وہ کہتے ہیں کہ",
        "hadithText": "ایک دفعہ رسول کریم صلی اللہ علیہ وسلم کعبہ شریف میں سجدہ میں تھے ۔ ( ایک دوسری سند سے ) ہم سے احمد بن عثمان نے بیان کیا ، کہا ہم سے شریح بن مسلمہ نے ، کہا ہم سے ابراہیم بن یوسف نے اپنے باپ کے واسطے سے بیان کیا ، وہ ابواسحاق سے روایت کرتے ہیں ۔ ان سے عمرو بن میمون نے بیان کیا کہ عبداللہ بن مسعود رضی اللہ عنہما نے ان سے حدیث بیان کی کہ ایک دفعہ رسول کریم صلی اللہ علیہ وسلم کعبہ کے نزدیک نماز پڑھ رہے تھے اور ابوجہل اور اس کے ساتھی ( بھی وہیں ) بیٹھے ہوئے تھے تو ان میں سے ایک نے دوسرے سے کہا کہ تم میں سے کوئی شخص ہے جو قبیلے کی ( جو ) اونٹنی ذبح ہوئی ہے ( اس کی ) اوجھڑی اٹھا لائے اور ( لا کر ) جب محمد صلی اللہ علیہ وسلم سجدہ میں جائیں تو ان کی پیٹھ پر رکھ دے ۔ یہ سن کر ان میں سے ایک سب سے زیادہ بدبخت ( آدمی ) اٹھا اور وہ اوجھڑی لے کر آیا اور دیکھتا رہا جب آپ نے سجدہ کیا تو اس نے اس اوجھڑی کو آپ کے دونوں کندھوں کے درمیان رکھ دیا ( عبداللہ بن مسعود کہتے ہیں ) میں یہ ( سب کچھ ) دیکھ رہا تھا مگر کچھ نہ کر سکتا تھا ۔ کاش ! ( اس وقت ) مجھے روکنے کی طاقت ہوتی ۔ عبداللہ کہتے ہیں کہ وہ ہنسنے لگے اور ( ہنسی کے مارے ) لوٹ پوٹ ہونے لگے اور رسول اللہ صلی اللہ علیہ وسلم سجدہ میں تھے ( بوجھ کی وجہ سے ) اپنا سر نہیں اٹھا سکتے تھے ۔ یہاں تک کہ حضرت فاطمہ رضی اللہ عنہا آئیں اور وہ بوجھ آپ کی پیٹھ سے اتار کر پھینکا ، تب آپ صلی اللہ علیہ وسلم نے سر اٹھایا پھر تین بار فرمایا ۔ یا اللہ ! تو قریش کو پکڑ لے ، یہ ( بات ) ان کافروں پر بہت بھاری ہوئی کہ آپ صلی اللہ علیہ وسلم نے انہیں بددعا دی ۔ عبداللہ کہتے ہیں کہ وہ سمجھتے تھے کہ اس شہر ( مکہ ) میں جو دعا کی جائے وہ ضرور قبول ہوتی ہے پھر آپ نے ( ان میں سے ) ہر ایک کا ( جدا جدا ) نام لیا کہ اے اللہ ! ان ظالموں کو ضرور ہلاک کر دے ۔ ابوجہل ، عتبہ بن ربیعہ ، شیبہ بن ربیعہ ، ولید بن عتبہ ، امیہ بن خلف اور عقبہ بن ابی معیط کو ۔ ساتویں ( آدمی ) کا نام ( بھی ) لیا مگر مجھے یاد نہیں رہا ۔ اس ذات کی قسم جس کے قبضے میں میری جان ہے کہ جن لوگوں کے ( بددعا کرتے وقت ) آپ صلی اللہ علیہ وسلم نے نام لیے تھے ، میں نے ان کی ( لاشوں ) کو بدر کے کنویں میں پڑا ہوا دیکھا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 102410,
        "last_updated": null
    },
    {
        "urduURN": 4002420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 241,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے سفیان نے حمید کے واسطے سے بیان کیا ، وہ حضرت انس رضی اللہ عنہ سے روایت کرتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ( ایک مرتبہ ) اپنے کپڑے میں تھوکا ۔ ابوعبداللہ امام بخاری رحمہ اللہ علیہ نے فرمایا کہ سعید بن ابی مریم نے اس حدیث کو طوالت کے ساتھ بیان کیا انھوں نے کہا ہم کو خبر دی یحییٰ بن ایوب نے ، کہا مجھ سے حمید نے بیان کیا ، کہا میں نے انس سے سنا ، وہ آنحضرت صلی اللہ علیہ وسلم سے روایت کرتے ہیں ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 102420,
        "last_updated": null
    },
    {
        "urduURN": 4002430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 242,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے ، ان سے زہری نے ابوسلمہ کے واسطے سے بیان کیا ، وہ حضرت عائشہ رضی اللہ عنہا سے وہ رسول کریم صلی اللہ علیہ وسلم سے روایت کرتی ہیں کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ پینے کی ہر وہ چیز جو نشہ لانے والی ہو حرام ہے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 102430,
        "last_updated": null
    },
    {
        "urduURN": 4002440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 243,
        "hadithSanad": "ہم سے محمد نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے ابن ابی حازم کے واسطے سے نقل کیا ، انھوں نے سہل بن سعد الساعدی سے سنا کہ",
        "hadithText": "لوگوں نے ان سے پوچھا ، اور ( میں اس وقت سہل کے اتنا قریب تھا کہ ) میرے اور ان کے درمیان کوئی دوسرا حائل نہ تھا کہ رسول اللہ صلی اللہ علیہ وسلم کے ( احد کے ) زخم کا علاج کس دوا سے کیا گیا تھا ۔ انھوں نے کہا کہ اس بات کا جاننے والا ( اب ) مجھ سے زیادہ کوئی نہیں رہا ۔ علی رضی اللہ عنہ اپنی ڈھال میں پانی لاتے اور حضرت فاطمہ رضی اللہ عنہا آپ صلی اللہ علیہ وسلم کے منہ سے خون دھوتیں پھر ایک بوریا کا ٹکڑا جلایا گیا اور آپ صلی اللہ علیہ وسلم کے زخم میں بھر دیا گیا ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 102440,
        "last_updated": null
    },
    {
        "urduURN": 4002450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 244,
        "hadithSanad": "ہم سے ابوالنعمان نے بیان کیا ، کہا ہم سے حماد بن زید نے غیلان بن جریر کے واسطے سے نقل کیا ، وہ ابوبردہ سے وہ اپنے باپ سے نقل کرتے ہیں کہ",
        "hadithText": "میں ( ایک مرتبہ ) رسول کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو میں نے آپ کو اپنے ہاتھ سے مسواک کرتے ہوئے پایا اور آپ صلی اللہ علیہ وسلم کے منہ سے اع اع کی آواز نکل رہی تھی اور مسواک آپ صلی اللہ علیہ وسلم کے منہ میں تھی جس طرح آپ صلی اللہ علیہ وسلم قے کر رہے ہوں ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 102450,
        "last_updated": null
    },
    {
        "urduURN": 4002460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 245,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے جریر نے منصور کے واسطے سے ، وہ ابووائل سے ، وہ حضرت حذیفہ سے روایت کرتے ہیں کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم جب رات کو اٹھتے تو اپنے منہ کو مسواک سے صاف کرتے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 102460,
        "last_updated": null
    },
    {
        "urduURN": 4002470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 246,
        "hadithSanad": "عفان نے کہا کہ ہم سے صخر بن جویریہ نے نافع کے واسطے سے بیان کیا ، وہ ابن عمر رضی اللہ عنہما سے نقل کرتے ہیں کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا کہ میں نے دیکھا کہ ( خواب میں ) مسواک کر رہا ہوں تو میرے پاس دو آدمی آئے ۔ ایک ان میں سے دوسرے سے بڑا تھا ، تو میں نے چھوٹے کو مسواک دے دی پھر مجھ سے کہا گیا کہ بڑے کو دو ۔ تب میں نے ان میں سے بڑے کو دی ۔ ابوعبداللہ بخاری کہتے ہیں کہ اس حدیث کو نعیم نے ابن المبارک سے ، وہ اسامہ سے ، وہ نافع سے ، انھوں نے ابن عمر رضی اللہ عنہما سے مختصر طور پر روایت کیا ہے ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 102470,
        "last_updated": null
    },
    {
        "urduURN": 4002480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 4,
        "bookName": "کتاب وضو کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 247,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، انھوں نے کہا ہم کو عبداللہ نے خبر دی ، انھوں نے کہا ہمیں سفیان نے منصور کے واسطے سے خبر دی ، انھوں نے سعد بن عبیدہ سے ، وہ براء بن عازب رضی اللہ عنہما سے روایت کرتے ہیں ، وہ کہتے ہیں کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا کہ جب تم اپنے بستر پر لیٹنے آؤ تو اس طرح وضو کرو جس طرح نماز کے لیے کرتے ہو ۔ پھر داہنی کروٹ پر لیٹ کر یوں کہو «اللهم أسلمت وجهي إليك ،‏‏‏‏ ‏‏‏‏ وفوضت أمري إليك ،‏‏‏‏ ‏‏‏‏ وألجأت ظهري إليك ،‏‏‏‏ ‏‏‏‏ رغبة ورهبة إليك ،‏‏‏‏ ‏‏‏‏ لا ملجأ ولا منجا منك إلا إليك ،‏‏‏‏ ‏‏‏‏ اللهم آمنت بكتابك الذي أنزلت ،‏‏‏‏ ‏‏‏‏ وبنبيك الذي أرسلت‏» ” اے اللہ ! میں نے اپنا چہرہ تیری طرف جھکا دیا ۔ اپنا معاملہ تیرے ہی سپرد کر دیا ۔ میں نے تیرے ثواب کی توقع اور تیرے عذاب کے ڈر سے تجھے ہی پشت پناہ بنا لیا ۔ تیرے سوا کہیں پناہ اور نجات کی جگہ نہیں ۔ اے اللہ ! جو کتاب تو نے نازل کی میں اس پر ایمان لایا ۔ جو نبی تو نے بھیجا میں اس پر ایمان لایا ۔ “ تو اگر اس حالت میں اسی رات مر گیا تو فطرت پر مرے گا اور اس دعا کو سب باتوں کے اخیر میں پڑھ ۔ حضرت براء رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے سامنے اس دعا کو دوبارہ پڑھا ۔ جب میں «اللهم آمنت بكتابك الذي أنزلت» پر پہنچا تو میں نے «ورسولك‏» ( کا لفظ ) کہہ دیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا نہیں ( یوں کہو ) «ونبيك الذي أرسلت» ۔</b>",
        "bookID": "4.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 113,
        "matchingArabicURN": 102480,
        "last_updated": null
    }
]