[
    {
        "urduURN": 4023710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2386,
        "hadithSanad": "ہم سے معلی بن اسد نے بیان کیا ، ان سے عبدالواحد نے بیان کیا ، ان سے اعمش نے بیان کیا ، انہوں نے بیان کیا کہ ابراہیم کی خدمت میں ہم نے بیع سلم میں رہن کا ذکر کیا ، تو انہوں نے بیان کیا کہ مجھ سے اسود نے بیان کیا اور ان سے عائشہ رضی اللہ عنہما نے بیان کیا",
        "hadithText": "کہ نبی کریم صلی اللہ علیہ وسلم نے ایک یہودی سے غلہ ایک خاص مدت ( کے قرض پر ) خریدا ، اور اپنی لوہے کی زرہ اس کے پاس رہن رکھ دی ۔</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 123010,
        "last_updated": null
    },
    {
        "urduURN": 4023720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2387,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا ، ان سے سلیمان بن بلال نے بیان کیا ، ان سے ثور بن زید نے ، ان سے ابو غیث نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو کوئی لوگوں کا مال قرض کے طور پر ادا کرنے کی نیت سے لیتا ہے تو اللہ تعالیٰ بھی اس کی طرف سے ادا کرے گا اور جو کوئی نہ دینے کے لیے لے ، تو اللہ تعالیٰ بھی اس کو تباہ کر دے گا ۔</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 123020,
        "last_updated": null
    },
    {
        "urduURN": 4023730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2388,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، کہا کہ ہم سے ابوشہاب نے بیان کیا ، ان سے اعمش نے ، ان سے زید بن وہب نے اور ان سے ابوذر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھا ۔ آپ صلی اللہ علیہ وسلم نے جب دیکھا ، آپ کی مراد احد پہاڑ ( کو دیکھنے ) سے تھی ۔ تو فرمایا کہ میں یہ بھی پسند نہیں کروں گا کہ احد پہاڑ سونے کا ہو جائے تو اس میں سے میرے پاس ایک دینار کے برابر بھی تین دن سے زیادہ باقی رہے ۔ سوا اس دینار کے جو میں کسی کا قرض ادا کرنے کے لیے رکھ لوں ۔ پھر فرمایا ، ( دنیا میں ) دیکھو جو زیادہ ( مال ) والے ہیں وہی محتاج ہیں ۔ سوا ان کے جو اپنے مال و دولت کو یوں اور یوں خرچ کریں ۔ ابوشہاب راوی نے اپنے سامنے اور دائیں طرف اور بائیں طرف اشارہ کیا ، لیکن ایسے لوگوں کی تعدا د کم ہوتی ہے ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا یہیں ٹھہرے رہو اور آپ صلی اللہ علیہ وسلم تھوڑی دور آگے کی طرف بڑھے ۔ میں نے کچھ آواز سنی ( جیسے آپ صلی اللہ علیہ وسلم کسی سے باتیں کر رہے ہوں ) میں نے چاہا کہ آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو جاؤں ۔ لیکن آپ صلی اللہ علیہ وسلم کا یہ فرمان یاد آیا کہ ” یہیں اس وقت تک ٹھہرے رہنا جب تک میں نہ آ جاؤں “ اس کے بعد جب آپ صلی اللہ علیہ وسلم تشریف لائے تو میں نے پوچھا یا رسول اللہ ! ابھی میں نے کچھ سنا تھا ۔ یا ( راوی نے یہ کہا کہ ) میں نے کوئی آواز سنی تھی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، تم نے بھی سنا ! میں نے عرض کیا کہ ہاں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میرے پاس جبرائیل علیہ السلام آئے تھے اور کہہ گئے ہیں کہ تمہاری امت کا جو شخص بھی اس حالت میں مرے کہ وہ اللہ کے ساتھ کسی کو شریک نہ ٹھہراتا ہو ، تو وہ جنت میں داخل ہو گا ۔ میں نے پوچھا کہ اگرچہ وہ اس طرح ( کے گناہ ) کرتا رہا ہو ۔ تو آپ نے کہا کہ ہاں ۔</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 123030,
        "last_updated": null
    },
    {
        "urduURN": 4023740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2389,
        "hadithSanad": "ہم سے احمد بن شبیب بن سعید نے بیان کیا ، کہا کہ ہم سے ہمارے والد نے بیان کیا ، ان سے یونس نے کہ ابن شہاب نے بیان کیا ، ان سے عبیداللہ بن عبداللہ بن عتبہ نے بیان کیا ، اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، اگر میرے پاس احد پہاڑ کے برابر بھی سونا ہو تب بھی مجھے یہ پسند نہیں کہ تین دن گزر جائیں اور اس ( سونے ) کا کوئی حصہ میرے پاس رہ جائے ۔ سوا اس کے جو میں کسی قرض کے دینے کے لیے رکھ چھوڑوں ۔ اس کی روایت صالح اور عقیل نے زہری سے کی ہے ۔</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 123040,
        "last_updated": null
    },
    {
        "urduURN": 4023750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2390,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، انہیں سلمہ بن کہیل نے خبر دی ، کہا کہ میں نے ابوسلمہ سے سنا ، وہ ہمارے گھر میں ابوہریرہ رضی اللہ عنہ سے حدیث بیان کر رہے تھے کہ",
        "hadithText": "ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم سے اپنے قرض کا تقاضا کیا اور سخت سست کہا ۔ صحابہ رضی اللہ عنہم نے اس کو سزا دینی چاہی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے کہنے دو ۔ صاحب حق کے لیے کہنے کا حق ہوتا ہے اور اسے ایک اونٹ خرید کر دے دو ۔ لوگوں نے عرض کیا کہ اس کے اونٹ سے ( جو اس نے آپ کو قرض دیا تھا ) اچھی عمر ہی کا اونٹ مل رہا ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہی خرید کے اسے دے دو ۔ کیونکہ تم میں اچھا وہی ہے جو قرض ادا رکرنے میں سب سے اچھا ہو ۔ ( حدیث اور باب کی مطابقت ظاہر ہے )</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 123050,
        "last_updated": null
    },
    {
        "urduURN": 4023760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2391,
        "hadithSanad": "ہم سے مسلم نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے عبدالملک نے ، ان سے ربعی بن حراش نے اور ان سے حذیفہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک شخص کا انتقال ہوا ( قبر میں ) اس سے سوال ہوا ، تمہارے پاس کوئی نیکی ہے ؟ اس نے کہا کہ میں لوگوں سے خریدوفروخت کرتا تھا ۔ ( اور جب کسی پر میرا قرض ہوتا ) تو میں مالداروں کو مہلت دیا کرتا تھا اور تنگ دستوں کے قرض کو معاف کر دیا کرتا تھا اس پر اس کی بخشش ہو گئی ۔ ابومسعود رضی اللہ عنہ نے بیان کیا کہ میں نے یہی نبی کریم صلی اللہ علیہ وسلم سے سنا ہے ۔</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 123060,
        "last_updated": null
    },
    {
        "urduURN": 4023770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2392,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، ان سے یحییٰ قطان نے ، ان سے سفیان ثوری نے کہ مجھ سے سلمہ بن کہیل نے بیان کیا ، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "ایک شخص نبی کریم صلی اللہ علیہ وسلم سے اپنا قرض کا اونٹ مانگنے آیا ۔ تو آپ صلی اللہ علیہ وسلم نے صحابہ سے فرمایا کہ اسے اس کا اونٹ دے دو ۔ صحابہ نے عرض کیا کہ قرض خواہ کے اونٹ سے اچھی عمر کا ہی اونٹ مل رہا ہے ۔ اس پر اس شخص ( قرض خواہ ) نے کہا مجھے تم نے میرا پورا حق دیا ۔ تمہیں اللہ تمہارا حق پورا پورا دے ! رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اسے وہی اونٹ دے دو کیونکہ بہترین شخص وہ ہے جو سب سے زیادہ بہتر طریقہ پراپنا قرض ا دا کرتا ہو ۔</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 123070,
        "last_updated": null
    },
    {
        "urduURN": 4023780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2393,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، ان سے سفیان بن عیینہ نے بیان کیا ، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم پر ایک شخص کا ایک خاص عمر کا اونٹ قرض تھا ۔ وہ شخص آپ صلی اللہ علیہ وسلم سے تقاضا کرنے آیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے اونٹ دے دو ۔ صحابہ نے تلاش کیا لیکن ایسا ہی اونٹ مل سکا جو قرض خواہ کے اونٹ سے اچھی عمر کا تھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہی دے دو ۔ اس پر اس شخص نے کہا کہ آپ نے مجھے میرا حق پوری طرح دیا اللہ آپ کو بھی اس کا بدلہ پورا پورا دے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم میں بہتر آدمی وہ ہے جو قرض ادا کرنے میں بھی سب سے بہتر ہو ۔</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 123080,
        "last_updated": null
    },
    {
        "urduURN": 4023790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2394,
        "hadithSanad": "ہم سے خلاد نے بیان کیا ، ان سے مسعر نے بیان کیا ، ان سے محارب بن دثار نے بیان کیا ، اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آپ مسجدنبوی میں تشریف رکھتے تھے ۔ مسعر نے بیان کیا کہ میرا خیا ل ہے کہ انہوں نے چاشت کے وقت کا ذکر کیا ۔ ( کہ اس وقت خدمت نبوی میں حاضر ہوا ) پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ دو رکعت نماز پڑھ لو ۔ میرا آپ پر قرض تھا ۔ آپ نے اسے ادا کیا ، بلکہ زیادہ بھی دے دیا ۔</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 123090,
        "last_updated": null
    },
    {
        "urduURN": 4023800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2395,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا کہ ہم کو عبداللہ بن مبارک نے خبر دی ، انہیں یونس نے خبر دی ، انہیں زہری نے بیان کیا ، ان سے کعب بن مالک نے بیان کیا ، اور انہیں جابر بن عبداللہ رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "ان کے والد ( عبداللہ رضی اللہ عنہ ) احد کے دن شہید کر دیئے گئے تھے ۔ ان پر قرض چلا آ رہا تھا ۔ قرض خواہوں نے اپنے حق کے مطالبے میں سختی اختیار کی تو میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ آپ نے ان سے دریافت فرما لیا کہ وہ میرے باغ کی کھجور لے لیں ۔ اور میرے والد کو معاف کر دیں ۔ لیکن قرض خواہوں نے اس سے انکار کیا تو نبی کریم صلی اللہ علیہ وسلم نے انہیں میرے باغ کا میوہ نہیں دیا ۔ اور فرمایا کہ ہم صبح کو تمہارے باغ میں آئیں گے ۔ چنانچہ جب صبح ہوئی تو آپ ہمارے باغ میں تشریف لائے ۔ آپ درختوں میں پھرتے رہے ۔ اور اس کے میوے میں برکت کی دعا فرماتے رہے ۔ پھر میں نے کھجور توڑی اور ان کا تمام قرض ادا کرنے کے بعد بھی کھجور باقی بچ گئی ۔</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 123100,
        "last_updated": null
    },
    {
        "urduURN": 4023810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2396,
        "hadithSanad": "ہم سے ابراہیم بن المنذر نے کہا کہ ہم سے انس نے بیان کیا ، ان سے ہشام نے ، ان سے وہب بن کیسان نے اور انہیں جابر بن عبداللہ رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "جب ان کے والد شہید ہوئے تو ایک یہودی کا تیس وسق قرض اپنے اوپر چھوڑ گئے ۔ جابر رضی اللہ عنہ نے اس سے مہلت مانگی ، لیکن وہ نہیں مانا ۔ پھر جابر رضی اللہ عنہ آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تاکہ آپ اس یہودی ( ابوشحم ) سے ( مہلت دینے کی ) سفارش کریں ۔ رسول اللہ صلی اللہ علیہ وسلم تشریف لائے اور یہودی سے یہ فرمایا کہ جابر رضی اللہ عنہ کے باغ کے پھل ( جو بھی ہوں ) اس قرض کے بدلے میں لے لے ۔ جو ان کے والد کے اوپر اس کا ہے ، اس نے اس سے بھی انکار کیا ۔ اب رسول کریم صلی اللہ علیہ وسلم باغ میں داخل ہوئے اور اس میں چلتے رہے پھر جابر رضی اللہ عنہ سے آپ صلی اللہ علیہ وسلم نے فرمایا کہ باغ کا پھل توڑ کے اس کا قرض ادا کرو ۔ جب رسول اللہ صلی اللہ علیہ وسلم واپس تشریف لائے تو انہوں نے باغ کی کھجوریں توڑیں اور یہودی کا تیس وسق ادا کر دیا ۔ سترہ وسق اس میں سے بچ بھی رہا ۔ جابر رضی اللہ عنہ آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تاکہ آپ کو بھی یہ اطلاع دیں ۔ آپ اس وقت عصر کی نماز پڑھ رہے تھے ۔ جب آپ صلی اللہ علیہ وسلم فارغ ہوئے تو انہوں نے آپ صلی اللہ علیہ وسلم کو اطلاع دی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کی خبر ابن خطاب کو بھی کر دو ۔ چنانچہ جابر رضی اللہ عنہ حضرت عمر رضی اللہ عنہ کے یہاں گئے ۔ حضرت عمر رضی اللہ عنہ نے فرمایا ، میں تو اسی وقت سمجھ گیا تھا جب رسول اللہ صلی اللہ علیہ باغ میں چل رہے تھے کہ اس میں ضرور برکت ہو گئی ۔</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 123110,
        "last_updated": null
    },
    {
        "urduURN": 4023820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2397,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا کہ ہمیں شعیب نے خبر دی ، وہ زہری سے روایت کرتے ہیں ( دوسری سند ) ہم سے اسماعیل نے بیان کیا ، کہا کہ مجھ سے میرے بھائی عبدالحمید نے بیان کیا ، ان سے سلیمان نے ، ان سے محمد بن ابی عتیق نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے عروہ نے بیان کیا ، اور انہیں عائشہ رضی اللہ عنہا نے خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نماز میں دعا کرتے تو یہ بھی کہتے ” اے اللہ ! میں گناہ اور قرض سے تیری پناہ مانگتا ہوں ۔ “ کسی نے عرض کیا یا رسول اللہ ! آپ قرض سے اتنی پناہ مانگتے ہیں ؟ آپ نے جواب دیا کہ جب آدمی مقروض ہوتا ہے تو جھوٹ بولتا ہے اور وعدہ کر کے اس کی خلاف ورزی کرتا ہے ۔</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 123120,
        "last_updated": null
    },
    {
        "urduURN": 4023830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2398,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے عدی بن ثابت نے ، ان سے ابوحازم نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو شخص ( اپنے انتقال کے وقت ) مال چھوڑے تو وہ اس کے وارثوں کا ہے اور جو قرض چھوڑے تو وہ ہمارے ذمہ ہے ۔</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 123130,
        "last_updated": null
    },
    {
        "urduURN": 4023840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2399,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، انہوں نے کہا کہ ہم سے ابوعامر نے بیان کیا ، ان سے فلیح نے بیان کیا ، ان سے ہلال بن علی نے ، ان سے عبدالرحمٰن بن ابی عمرہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، ہر مومن کا میں دنیا و آخرت میں سب سے زیادہ قریب ہوں ۔ اگر تم چاہو تو یہ آیت پڑھ لو ” نبی مومنوں سے ان کی جان سے بھی زیادہ قریب ہے ۔ “ اس لیے جو مومن بھی انتقال کر جائے اور مال چھوڑ جائے تو چاہئے کہ ورثاء اس کے مالک ہوں ۔ وہ جو بھی ہوں اور جو شخص قرض چھوڑ جائے یا اولاد چھوڑ جائے تو وہ میرے پاس آ جائیں کہ ان کا ولی میں ہوں ۔</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 123140,
        "last_updated": null
    },
    {
        "urduURN": 4023850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2400,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے عبدالاعلیٰ نے بیان کیا ، ان سے معمر نے ، ان سے ہمام بن منبہ ، وہب بن منبہ کے بھائی نے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، مالدار کی طرف سے ( قرض کی ادائیگی میں ) ٹال مٹول کرنا ظلم ہے ۔</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 123150,
        "last_updated": null
    },
    {
        "urduURN": 4023860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2401,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، ان سے یحییٰ نے بیان کیا ، ان سے شعبہ نے ، ان سے سلمہ نے ، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ایک شخص قرض مانگنے اور سخت تقاضا کرنے لگا ۔ صحابہ رضی اللہ عنہم نے اس کی گوشمالی کرنی چاہی تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اسے چھوڑ دو ، حقدار ایسی باتیں کہہ سکتا ہے ۔</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 123160,
        "last_updated": null
    },
    {
        "urduURN": 4023870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2402,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، ان سے زہیر نے بیان کیا ، انہوں نے کہا ان سے یحییٰ بن سعید نے بیان کیا ، کہا کہ مجھے ابوبکر بن محمد بن عمرو بن حزم نے خبر دی ۔ انہیں عمر بن عبدالعزیز نے خبر دی ، انہیں ابوبکر بن عبدالرحمٰن بن حارث بن ہشام نے خبر دی ، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، آپ بیان کرتے تھے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا یایہ بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا ، جو شخص ہو بہو اپنا مال کسی شخص کے پاس پا لے جب کہ وہ شخص دیوالیہ قرار دیا جا چکا ہو تو صاحب مال ہی اس کا دوسروں کے مقابلے میں زیادہ مستحق ہے ۔</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 123170,
        "last_updated": null
    },
    {
        "urduURN": 4023880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2403,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے یزید بن زریع نے بیان کیا ، ان سے حسین معلم نے بیان کیا ، ان سے عطاء  بن ابی رباح نے بیان کیا ، اور ان سے جابر بن عبدللہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک شخص نے اپنا ایک غلام اپنی موت کے ساتھ آزاد کرنے کے لیے کہا ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس غلام کو مجھ سے کون خریدتا ہے ؟ نعیم بن عبداللہ نے اسے خرید لیا اور آنحضرت صلی اللہ علیہ وسلم نے اس کی قیمت ( آٹھ سو درہم ) وصول کر کے اس کے مالک کو دے دی ۔</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 123180,
        "last_updated": null
    },
    {
        "urduURN": 4023890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2404,
        "hadithSanad": "لیث نے بیان کیا کہ مجھ سے جعفر بن ربیعہ نے بیان کیا ، ان سے عبدالرحمٰن بن ہرمز نے اور ان سے ابوہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے کسی اسرائیلی شخص کا تذکر فرمایا جس نے دوسرے اسرائیلی شخص سے قرض مانگا تھا اور اس نے ایک مقررہ مدت کے لیے اسے قرض دے دیا ۔ ( جس کا ذکر پہلے گزر چکا ہے )</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 123190,
        "last_updated": null
    },
    {
        "urduURN": 4023900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2405,
        "hadithSanad": "ہم سے موسیٰ نے بیان کیا کہا کہ ہم سے ا بوعوانہ نے بیان کیا ، ان سے مغیرہ نے ، ان سے عامر نے ، اور ان سے جابر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "( میرے والد ) عبداللہ رضی اللہ عنہ شہید ہوئے تو اپنے پیچھے بال بچے اور قرض چھوڑ گئے ۔ میں قرض خواہوں کے پاس گیا کہ اپنا کچھ قرض معاف کر دیں ، لیکن انہوں نے انکار کیا ، پھر میں نبی کریم صلی للہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ آپ صلی اللہ علیہ وسلم سے ان کی سفارش کروائی ۔ انہوں نے اس کے باوجود بھی انکار کیا ۔ آخر آپ صلی اللہ علیہ ولم نے فرمایا کہ ( اپنے باغ کی ) تمام کھجور کی قسمیں الگ الگ کر لو ۔ عذق بن زید الگ ، لین الگ ، اور عجوہ الگ ( یہ سب عمدہ قسم کی کھجوروں کے نام ہیں ) اس کے بعد قرض خواہوں کو بلاؤ اور میں بھی آؤں گا ۔ چنانچہ میں نے ایسا کر دیا ۔ جب نبی کریم صلی اللہ علیہ وسلم تشریف لائے تو آپ صلی اللہ علیہ وسلم ان کے ڈھیر پر بیٹھ گئے ۔ اور ہر قرض خواہ کے لیے ماپ شروع کر دی ۔ یہاں تک کہ سب کا قرض پورا ہو گیا اور کھجور اسی طرح باقی بچ رہی جیسے پہلے تھی ۔ گویا کسی نے اسے چھوا تک نہیں ۔ \nاور ایک مرتبہ میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک جہاد میں ایک اونٹ پر سوار ہو کر گیا ۔ اونٹ تھک گیا ۔ اس لیے میں لوگوں سے پیچھے رہ گیا ۔ اتنے میں نبی کریم صلی اللہ علیہ وسلم نے اسے پیچھے سے مارا اور فرمایا کہ یہ اونٹ مجھے بیچ دو ۔ مدینہ تک اس پر سواری کی تمہیں اجازت ہے ۔ پھر جب ہم مدینہ سے قریب ہوئے تو میں نے نبی کریم صلی اللہ علیہ وسلم سے اجازت چاہی ، عرض کیا کہ یا رسول اللہ ! میں نے ابھی نئی شادی کی ہے ۔ آپ نے دریافت فرمایا ، کنواری سے کی ہے یا بیوہ سے ؟ میں نے کہا کہ بیوہ سے ۔ میرے والد عبداللہ رضی اللہ عنہ شہید ہوئے تو اپنے پیچھے کئی چھوٹی بچیاں چھوڑ گئے ہیں ۔ اس لیے میں نے بیوہ سے کی تاکہ انہیں تعلیم دے اور ادب سکھاتی رہے ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا ، اچھا اب اپنے گھر جاؤ ۔ چنانچہ میں گھر گیا ۔ میں نے جب اپنے ماموں سے اونٹ بیچنے کا ذکر کیا تو انہوں نے مجھے ملامت کی ۔ اس لیے میں نے ان سے اونٹ کے تھک جانے اور نبی اکرم صلی اللہ علیہ وسلم کے واقعہ کا بھی ذکر کیا ۔ اور آپ کے اونٹ کو مارنے کا بھی ۔ جب نبی کریم صلی اللہ علیہ وسلم مدینہ پہنچے تو میں بھی صبح کے وقت اونٹ لے کر آپ کی خدمت میں حاضر ہوا ۔ آپ نے مجھے اونٹ کی قیمت بھی دے دی ، اور وہ اونٹ بھی مجھے واپس بخش دیا اور قوم کے ساتھ میرا ( مال غنیمت کا ) حصہ بھی مجھ کو بخش دیا ۔</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 123201,
        "last_updated": null
    },
    {
        "urduURN": 4023920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2407,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عبداللہ بن دینار نے بیان کیا ، انہوں نے عمر رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم سے ایک شخص نے عرض کیا کہ خریدوفروخت میں مجھے دھوکا دے دیا جاتا ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب خریدوفروخت کیا کرو ، تو کہہ دیا کر کہ کوئی دھوکا نہ ہو ۔ چنانچہ پھر وہ شخص اسی طرح کہا کرتا تھے ۔</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 123220,
        "last_updated": null
    },
    {
        "urduURN": 4023930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2408,
        "hadithSanad": "ہم سے عثمان بن ابی شبیہ نے بیان کیا ، ان سے جریر نے بیان کیا ، ان سے منصور نے ، ان سے شعبی نے ، ان سے مغیرہ بن شعبہ کے غلام وراد نے اور ان سے مغیرہ بن شعبہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اللہ تعالیٰ نے تم پر ماں ( اور باپ ) کی نافرمانی لڑکیوں کو زندہ دفن کرنا ، ( واجب حقوق کی ) ادائیگی نہ کرنا اور ( دوسروں کا مال ناجائز طریقہ پر ) دبالینا حرام قرار دیا ہے ۔ اور فضول بکواس کرنے اورکثرت سے سوال کرنے اور مال ضائع کرنے کو مکروہ قرار دیا ہے ۔</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 123230,
        "last_updated": null
    },
    {
        "urduURN": 4023940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 43,
        "bookName": "کتاب قرض لینے ادا کرنے حجر اور مفلسی منظور کرنے کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2409,
        "hadithSanad": "ہم سے ابوالیمان حکم بن نافع نے بیان کیا ، کہا کہ ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا انہیں سالم بن عبداللہ نے خبر دی اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے سنا ، تم میں سے ہر فرد ایک طرح کا حاکم ہے اور اس کی رعیت کے بارے میں اس سے سوال ہو گا ۔ پس بادشاہ حاکم ہی ہے اور اس کی رعیت کے بارے میں اس سے سوال ہو گا ۔ ہر انسان اپنے گھر کا حاکم ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا ۔ عورت اپنے شوہر کے گھر کی حاکم ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا ۔ خادم اپنے آقا کے مال کا حاکم ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا ۔ انہوں نے بیان کیا کہ یہ سب میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا ۔ اور میں سمجھتا ہوں کہ نبی کریم صلی اللہ علیہ وسلم نے یہ بھی فرمایا تھا کہ مرد اپنے والد کے مال کا حاکم ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا ۔ پس ہر شخص حاکم ہے اور ہر شخص سے اس کی رعیت کے بارے میں سوال ہو گا ۔</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 123240,
        "last_updated": null
    },
    {
        "urduURN": 4023705,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 43,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2385,
        "hadithSanad": "ہم سے محمد بن یوسف بیکندی نے بیان کیا ، کہا کہ ہم کو جریر نے خبری دی ، انہیں مغیرہ نے ، انہیں شعبی نے اور ان سے جابر بن عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک غزوہ میں شریک تھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، اپنے اونٹ کے بارے میں تمہاری کیا رائے ہے ۔ کیا تم اسے بیچو گے ؟ میں نے کہا ہاں ، چنانچہ اونٹ میں نے آپ صلی اللہ علیہ وسلم کو بیچ دیا ۔ اور جب آپ صلی اللہ علیہ وسلم مدینہ پہنچے ۔ تو صبح اونٹ کو لے کر میں آپ کی خدمت میں حاضر ہو گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے مجھے اس کی قیمت ادا کر دی ۔</b>",
        "bookID": "43.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 123000,
        "last_updated": null
    }
]