[
    {
        "urduURN": 4023950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 44,
        "bookName": "کتاب نالشوں اور جھگڑوں کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2411,
        "hadithSanad": "ہم سے یحییٰ بن قزعہ نے بیان کیا ، کہا کہ ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے ابن شہاب نے ، ان سے ابوسلمہ اور عبدالرحمٰن اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "دو شخصوں نے جن میں ایک مسلمان تھا اور دوسرا یہودی ، ایک دوسرے کو برا بھلا کہا ۔ مسلمان نے کہا ، اس ذا ت کی قسم ! جس نے محمد ( صلی اللہ علیہ وسلم ) کو تمام دنیا والوں پر بزرگی دی ۔ اور یہودی نے کہا ، اس ذا ت کی قسم جس نے موسیٰ ( علیہ الصلٰوۃ و السلام ) کو تمام دنیا والوں پر بزرگی دی ۔ اس پر مسلمان نے ہاتھ اٹھا کر یہودی کے طمانچہ مارا ۔ وہ یہودی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ اور مسلمان کے ساتھ اپنے واقعہ کو بیان کیا ۔ پھر حضور صلی اللہ علیہ وسلم نے اس مسلمان کو بلایا اور ان سے واقعہ کے متعلق پوچھا ۔ انہوں نے آپ کو اس کی تفصیل بتا دی ۔ آپ نے اس کے بعد فرمایا ، مجھے موسیٰ علیہ السلام پر ترجیح نہ دو ۔ لوگ قیامت کے دن بیہوش کر دیئے جائیں گے ۔ میں بھی بیہوش ہو جاؤں گا ۔ بے ہوشی سے ہوش میں آنے والا سب سے پہلا شخص میں ہوں گا ، لیکن موسیٰ علیہ السلام کو عرش الٰہی کا کنارہ پکڑے ہوئے پاؤں گا ۔ اب مجھے معلوم نہیں کہ موسیٰ علیہ السلام بھی بیہوش ہونے والوں میں ہوں گے اور مجھ سے پہلے انہیں ہوش آ جائے گا ۔ یا اللہ تعالیٰ نے ان کو ان لوگوں میں رکھا ہے جو بے ہوشی سے مستثنیٰ ہیں ۔</b>",
        "bookID": "44.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 123260,
        "last_updated": null
    },
    {
        "urduURN": 4023960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 44,
        "bookName": "کتاب نالشوں اور جھگڑوں کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2412,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے وہیب نے بیان کیا ، کہا کہ ہم سے عمرو بن یحییٰ نے بیان کیا ، ان سے ان کے باپ یحییٰ بن عمارہ نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم تشریف فرما تھے کہ ایک یہودی آیا اور کہا کہ اے ابوالقاسم ! آپ کے اصحاب میں سے ایک نے مجھے طمانچہ مارا ہے ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ، کس نے ؟ اس نے کہا کہ ایک انصاری نے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ انہیں بلاؤ ۔ وہ آئے تو آنحضرت صلی اللہ علیہ وسلم نے پوچھا کیا تم نے اسے مارا ہے ؟ انہوں نے کہا کہ میں نے اسے بازار میں یہ قسم کھاتے سنا ۔ اس ذات کی قسم ! جس نے موسیٰ علیہ السلام کو تمام انسانوں پر بزرگی دی ۔ میں نے کہا ، او خبیث ! کیا محمد صلی اللہ علیہ وسلم پر بھی ! مجھے غصہ آیا اور میں نے اس کے منہ پر تھپڑ دے مارا ۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا دیکھو انبیاء میں باہم ایک دوسرے پر اس طرح بزرگی نہ دیا کرو ۔ لوگ قیامت میں بیہوش ہو جائیں گے ۔ اپنی قبر سے سب سے پہلے نکلنے والا میں ہی ہوں گا ۔ لیکن میں دیکھوں گا کہ موسیٰ علیہ السلام عرش الٰہی کا پایہ پکڑے ہوئے ہیں ۔ اب مجھے معلوم نہیں کہ موسیٰ علیہ السلام بھی بیہوش ہوں گے اور مجھ سے پہلے ہوش میں آ جائیں گے یا انہیں پہلی بے ہوشی جو طور پر ہو چکی ہے وہی کافی ہو گی ۔</b>",
        "bookID": "44.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 123270,
        "last_updated": null
    },
    {
        "urduURN": 4023970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 44,
        "bookName": "کتاب نالشوں اور جھگڑوں کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2413,
        "hadithSanad": "ہم سے موسیٰ نے بیان کیا ، کہا کہ ہم سے ہمام نے بیان کیا ، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک یہودی نے ایک لڑکی کا سر دو پتھروں کے درمیان رکھ کر کچل دیا تھا ۔ ( اس میں کچھ جان باقی تھی ) اس سے پوچھا گیا کہ تیرے ساتھ یہ کس نے کیا ہے ؟ کیا فلاں نے ، فلاں نے ؟ جب اس یہودی کا نام آیا تو اس نے اپنے سر سے اشارہ کیا ( کہ ہاں ) یہودی پکڑا گیا اور اس نے بھی جرم کا اقرار کر لیا ، نبی کریم صلی اللہ علیہ وسلم نے حکم دیا اور اس کا سر بھی دو پتھروں کے درمیان رکھ کر کچل دیا گیا ۔</b>",
        "bookID": "44.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 123280,
        "last_updated": null
    },
    {
        "urduURN": 4023980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 44,
        "bookName": "کتاب نالشوں اور جھگڑوں کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2414,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے عبدالعزیز بن مسلم نے بیان کیا ، ان سے عبداللہ بن دینار نے بیان کیا ، انہوں نے کہا کہ میں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا ، آپ نے کہا کہ",
        "hadithText": "ایک صحابی کوئی چیز خریدتے وقت دھوکا کھا جایا کرتے تھے ۔ نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ جب تو خریدا کرے تو یہ کہہ دے کہ کوئی دھوکا نہ ہو ۔ پس وہ اسی طرح کہا کرتے تھے ۔</b>",
        "bookID": "44.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 123290,
        "last_updated": null
    },
    {
        "urduURN": 4023990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 44,
        "bookName": "کتاب نالشوں اور جھگڑوں کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2415,
        "hadithSanad": "ہم سے عاصم بن علی نے بیان کیا ، کہا کہ ہم سے ابن ابی ذئب نے بیان کیا ، ان سے محمد بن منکدر نے اور ان سے جابر رضی اللہ عنہ نے کہ",
        "hadithText": "ایک شخص نے اپنا ایک غلام آزاد کیا ، لیکن اس کے پاس اس کے سوا اور کوئی مال نہ تھا ۔ اس لیے نبی کریم صلی اللہ علیہ وسلم نے اسے اس کا غلام واپس کرا دیا ۔ اور اسے نعیم بن نحام نے خرید لیا ۔</b>",
        "bookID": "44.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 123300,
        "last_updated": null
    },
    {
        "urduURN": 4024000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 44,
        "bookName": "کتاب نالشوں اور جھگڑوں کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد نے بیان کیا ، کہا کہ ہم کو ابومعاویہ نے خبر دی ، انہیں اعمش نے ، انہیں شقیق نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ جس نے کوئی جھوٹی قسم جان بوجھ کر کھائی تاکہ کسی مسلمان کا مال ناجائز طور پر حاصل کر لے ۔ تو وہ اللہ تعالیٰ ٰکے سامنے اس حالت میں حاضر ہو گا کہ اللہ پاک اس پر نہایت ہی غضبناک ہو گا ۔ راوی نے بیان کیا کہ اس پر اشعث رضی اللہ عنہ نے کہا کہ اللہ کی قسم ! مجھ سے ہی متعلق ایک مسئلے میں رسول کریم صلی اللہ علیہ وسلم نے یہ فرمایا تھا ۔ میرے اور ایک یہودی کے درمیان ایک زمین کا جھگڑا تھا ۔ اس نے انکار کیا تو میں نے مقدمہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں پیش کیا ۔ آنحضرت صلی اللہ علیہ وسلم نے مجھ سے دریافت فرمایا ، کیا تمہارے پاس کوئی گواہ ہے ؟ میں نے کہا کہ نہیں ۔ انہوں نے بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم نے یہودی سے فرمایا کہ پھر تو قسم کھا ۔ اشعث رضی اللہ عنہ نے بیان کیا کہ میں نے عرض کیا ، یا رسول اللہ ! پھر تو یہ جھوٹی قسم کھا لے گا اور میرا مال اڑا لے جائے گا ۔ اس پر اللہ تعالیٰ ٰنے یہ آیت نازل فرمائی ، بیشک وہ لوگ جو اللہ کے عہد اور اپنی قسموں سے تھوڑی پونچی خریدتے ہیں ۔ آخر آیت تک ۔</b>",
        "bookID": "44.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 123311,
        "last_updated": null
    },
    {
        "urduURN": 4024010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 44,
        "bookName": "کتاب نالشوں اور جھگڑوں کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2418,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، انہوں نے کہا کہ ہم سے عثمان بن عمر نے بیان کیا ، انہوں نے کہا کہ ہم کو یونس نے خبر دی ، انہیں زہری نے ، انہیں عبداللہ بن کعب بن مالک رضی اللہ عنہ نے ، انہوں نے کعب رضی اللہ عنہ سے روایت کیا کہ",
        "hadithText": "انہوں نے ابن ابی حدرد رضی اللہ عنہ سے مسجد میں اپنے قرض کا تقاضا کیا ۔ اور دونوں کی آواز اتنی بلند ہو گئی کہ رسول کریم صلی اللہ علیہ وسلم نے بھی گھر میں سن لی ۔ آپ نے حجرہ مبارک کا پردہ اٹھا کر پکارا اے کعب ! انہوں نے عرض کیا ، یا رسول اللہ صلی اللہ علیہ وسلم میں حاضر ہوں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اپنے قرض میں سے اتنا کم کر دے اور آپ نے آدھا قرض کم کر دینے کا اشارہ کیا ۔ انہوں نے کہا کہ میں نے کم کر دیا ۔ پھر آپ نے ابن ابی حدرد رضی اللہ عنہ سے فرمایا کہ اٹھ اب قرض ادا کر دے ۔</b>",
        "bookID": "44.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 123330,
        "last_updated": null
    },
    {
        "urduURN": 4024020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 44,
        "bookName": "کتاب نالشوں اور جھگڑوں کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2419,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں ابن شہاب نے ، انہیں عروہ بن زبیر رضی اللہ عنہ نے ، انہیں عبدالرحمٰن بن عبدالقاری نے کہ انہوں نے عمر بن خطاب رضی اللہ عنہ سے سنا کہ وہ بیان کرتے تھے کہ",
        "hadithText": "میں نے ہشام بن حکیم بن حزام رضی اللہ عنہ کو سورۃ الفرقان ایک دفعہ اس قرآت سے پڑھتے سنا جو اس کے خلاف تھی جو میں پڑھتا تھا ۔ حالانکہ میری قرآت خود رسول اللہ صلی اللہ علیہ وسلم نے مجھے سکھائی تھی ۔ قریب تھا کہ میں فوراً ہی ان پر کچھ کر بیٹھوں ، لیکن میں نے انہیں مہلت دی کہ وہ ( نماز سے ) فارغ ہو لیں ۔ اس کے بعد میں نے ان کے گلے میں چادر ڈال کر ان کو گھسیٹا اور رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر کیا ۔ میں نے آپ سے کہا کہ میں نے انہیں اس قرآت کے خلاف پڑھتے سنا ہے جو آپ نے مجھے سکھائی ہے ۔ حضور اکرم صلی اللہ علیہ وسلم نے مجھ سے فرمایا کہ پہلے انہیں چھوڑ دے ۔ پھر ان سے فرمایا کہ اچھا اب تم قرآت سناؤ ۔ انہوں نے وہی اپنی قرآت سنائی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسی طرح نازل ہوئی تھی ۔ اس کے بعد مجھ سے آپ صلی اللہ علیہ وسلم نے فرمایا کہ اب تم بھی پڑھو ، میں نے بھی پڑھ کر سنایا ۔ آپ نے اس پر فرمایا کہ اسی طرح نازل ہوئی ۔ قرآن سات قراتوں میں نازل ہوا ہے ۔ تم کو جس میں آسانی ہو اسی طرح سے پڑھ لیا کرو ۔</b>",
        "bookID": "44.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 123340,
        "last_updated": null
    },
    {
        "urduURN": 4024030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 44,
        "bookName": "کتاب نالشوں اور جھگڑوں کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2420,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے محمد بن عدی نے بیان کیا ، ان سے شعبہ نے ، ان سے سعد بن ابراہیم نے ، ان سے حمید بن عبدالرحمٰن نے ، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، میں نے تو یہ ارادہ کر لیا تھا کہ نماز کی جماعت قائم کرنے کا حکم دے کر خود ان لوگوں کے گھروں میں جاؤں جو جماعت میں حاضر نہیں ہوتے اور ان کے گھر کو جلا دوں ۔</b>",
        "bookID": "44.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 123350,
        "last_updated": null
    },
    {
        "urduURN": 4024040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 44,
        "bookName": "کتاب نالشوں اور جھگڑوں کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2421,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا کہ ہم سے سفیان نے بیان کیا ، ان سے زہری نے ، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "زمعہ کی ایک باندی کے لڑے کے بارے میں عبد بن زمعہ رضی اللہ عنہ اور سعد بن ابی وقاص رضی اللہ عنہ اپنا جھگڑا رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لے کر گئے ۔ حضرت سعد رضی اللہ عنہ نے کہا یا رسول اللہ ! میرے بھائی نے مجھ کو وصیت کی تھی کہ جب میں ( مکہ ) آؤں اور زمعہ کی باندی کے لڑکے کو دیکھوں تو اسے اپنی پرورش میں لے لوں ۔ کیونکہ وہ انہیں کا لڑکا ہے ۔ اور عبد بن زمعہ نے کہا کہ وہ میرا بھائی ہے اور میرے باپ کی باندی کا لڑکا ہے ۔ میرے والد ہی کے ” فراش “ میں اس کی پیدائش ہوئی ہے ۔ نبی کریم صلی اللہ علیہ وسلم نے بچے کے اندر ( عتبہ کی ) واضح مشابہت دیکھی ۔ لیکن فرمایا کہ اے عبد بن زمعہ ! لڑکا تو تمہاری ہی پرورش میں رہے گا کیونکہ لڑکا ” فراش “ کے تابع ہوتا ہے اور سودہ تو اس لڑکے سے پردہ کیا کر ۔</b>",
        "bookID": "44.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 123360,
        "last_updated": null
    },
    {
        "urduURN": 4024050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 44,
        "bookName": "کتاب نالشوں اور جھگڑوں کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2422,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث نے بیان کیا ، ان سے سعید بن ابی سعید نے اور انہوں نے ابوہریرہ رضی اللہ عنہ کو یہ کہتے سنا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے چند سواروں کا ایک لشکر نجد کی طرف بھیجا ۔ یہ لوگ بنو حنیفہ کے ایک شخص کو جس کا نام ثمامہ بن اثال تھا اور جو اہل یمامہ کا سردار تھا ، پکڑ لائے اور اسے مسجدنبوی کے ایک ستون میں باندھ دیا ۔ پھر رسول کریم صلی اللہ علیہ وسلم تشریف لائے اور آپ صلی اللہ علیہ وسلم نے پوچھا ، ثمامہ ! تو کس خیال میں ہے ؟ انہوں نے کہا اے محمد ( صلی اللہ علیہ وسلم ) میں اچھا ہوں ۔ پھر انہوں نے پوری حدیث ذکر کی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ ثمامہ کو چھوڑ دو ۔</b>",
        "bookID": "44.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 123370,
        "last_updated": null
    },
    {
        "urduURN": 4024060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 44,
        "bookName": "کتاب نالشوں اور جھگڑوں کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2423,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، کہا کہ مجھ سے سعید بن ابی سعید نے بیان کیا ، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، آپ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے سواروں کا ایک لشکر نجد کی طرف بھیجا جو بنوحنیفہ کے ایک شخص ثمامہ بن اثال کو پکڑ لائے ۔ اور مسجد کے ایک ستون سے اس کو باندھ دیا ۔</b>",
        "bookID": "44.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 123380,
        "last_updated": null
    },
    {
        "urduURN": 4024070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 44,
        "bookName": "کتاب نالشوں اور جھگڑوں کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2424,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث نے بیان کیا ، انہوں نے کہا کہ مجھ سے جعفر بن ربیعہ نے بیان کیا ، اور یحییٰ بن بکیر کے علاوہ نے بیان کیا کہ مجھ سے لیث نے بیان کیا ، کہا کہ مجھ سے جعفر بن ربیعہ نے بیان کیا ، ان سے عبدالرحمٰن بن ہرمز نے ، ان سے عبداللہ بن کعب بن مالک انصاری نے ، اور ان سے کعب بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "عبداللہ بن ابی حدرد اسلمی رضی اللہ عنہ پر ان کا قرض تھا ، ان سے ملاقات ہوئی تو انہوں نے ان کا پیچھا کیا ۔ پھر دونوں کی گفتگو تیز ہونے لگی ۔ اور آواز بلند ہو گئی ۔ اتنے میں رسول کریم صلی اللہ علیہ وسلم کا ادھر سے گزر ہوا ۔ اور آپ صلی اللہ علیہ وسلم نے فرمایا ، اے کعب ! اور آپ نے اپنے ہاتھ سے اشارہ کر کے گویا یہ فرمایا کہ آدھے قرض کی کمی کر دے ۔ چنانچہ انہوں نے آدھا لے لیا اور آدھا قرض معاف کر دیا ۔</b>",
        "bookID": "44.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 123390,
        "last_updated": null
    },
    {
        "urduURN": 4024080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 44,
        "bookName": "کتاب نالشوں اور جھگڑوں کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2425,
        "hadithSanad": "ہم سے اسحاق بن راہویہ نے بیان کیا ، کہا کہ ہم سے وہب بن جریر بن حازم نے بیان کیا ، انہیں شعبہ نے خبر دی ، انہیں اعمش نے ، انہیں ابوالضحیٰ نے ، انہیں مسروق نے ، اور ان سے خباب رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں جاہلیت کے زمانہ میں لوہے کا کام کرتا تھا اور عاص بن وائل ( کافر ) پر میرے کچھ روپے قرض تھے ۔ میں اس کے پاس تقاضا کرنے گیا تو اس نے مجھ سے کہا کہ جب تک تو محمد ( صلی اللہ علیہ وسلم ) کا انکار نہیں کرے گا میں تیرا قرض ادا نہیں کروں گا ۔ میں نے کہا ہرگز نہیں ، اللہ کی قسم ! میں حضرت محمد صلی اللہ علیہ وسلم کا انکار کبھی نہیں کر سکتا ، یہاں تک کہ اللہ تعالیٰ تمہیں مارے اور پھر تم کو اٹھائے ۔ وہ کہنے لگا کہ پھر مجھ سے بھی تقاضا نہ کر ۔ میں جب مر کے دوبارہ زندہ ہوں گا تو مجھے ( دوسری زندگی میں ) مال اور اولاد دی جائے گی تو تمہارا قرض بھی ادا کر دوں گا ۔ اس پر یہ آیت نازل ہوئی ” تم نے اس شخص کو دیکھا جس نے ہماری آیتوں کا انکار کیا اور کہا کہ مجھے مال اور اولاد ضرور دی جائے گی ۔ “ آخر آیت تک ۔</b>",
        "bookID": "44.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 123400,
        "last_updated": null
    },
    {
        "urduURN": 4023945,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 44,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2410,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا کہ عبدالملک بن میسرہ نے مجھے خبری دی کہا کہ میں نے نزال بن سمرہ سے سنا ، اور انہوں نے عبداللہ بن مسعود رضی اللہ عنہما سے سنا ، انہوں نے کہا کہ",
        "hadithText": "میں نے ایک شخص کو قرآن کی آیت اس طرح پڑھتے سنا کہ رسول اللہ صلی اللہ علیہ سلم سے میں نے اس کے خلاف سنا تھا ۔ اس لیے میں ان کا ہاتھ تھامے آپ کی خدمت میں لے گیا ۔ آپ نے ( میرا اعتراض سن کر ) فرمایا کہ تم دونوں درست ہو ۔ شعبہ نے بیان کیا کہ میں سجھتا ہوں کہ آپ نے یہ بھی فرمایا کہ اختلاف نہ کرو ، کیونکہ تم سے پہلے لوگ اختلاف ہی کی وجہ سے تباہ ہو گئے ۔</b>",
        "bookID": "44.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 123250,
        "last_updated": null
    }
]