[
    {
        "urduURN": 4024090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 45,
        "bookName": "کتاب لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2427,
        "hadithSanad": "ہم سے عمرو بن عباس نے بیان کیا ، کہا کہ ہم سے عبدالرحمٰن بن مہدی نے بیان کیا ، کہا ہم سے سفیان نے ، ان سے ربیعہ نے ، ان سے منبعث کے غلام یزید نے ، اور ان سے زید بن خالد جہنی رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ایک دیہاتی حاضر ہوا ۔ اور راستے میں پڑی ہوئی کسی چیز کو اٹھانے کے بارے میں آپ سے سوال کیا ۔ آپ نے ان سے فرمایا کہ ایک سال تک اس کا اعلان کرتا رہ ۔ پھر اس کے برتن کی بناوٹ اور اس کے بندھن کو ذہن میں رکھ ۔ اگر کوئی ایسا شخص آئے جو اس کی نشانیاں ٹھیک ٹھیک بتا دے ( تو اسے اس کا مال واپس کر دے ) ورنہ اپنی ضروریات میں خرچ کر ۔ صحابی نے پوچھا ، یا رسول اللہ ! ایسی بکری کا کیا کیا جائے جس کے مالک کا پتہ نہ ہو ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہ یا تو تمہاری ہو گی یا تمہارے بھائی ( مالک ) کو مل جائے گی یا پھر بھیڑئیے کا لقمہ بنے گی ۔ صحابہ نے پھر پوچھا اور اس اونٹ کا کیا کیا جائے جو راستہ بھول گیا ہو ؟ اس پر رسول کریم صلی اللہ علیہ وسلم کے چہرہ مبارک کا رنگ بدل گیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، تمہیں اس سے کیا مطلب ؟ اس کے ساتھ خود اس کے کھر ہیں ۔ ( جن سے وہ چلے گا ) اس کا مشکیزہ ہے ، پانی پر وہ خود پہنچ جائے گا ۔ اور درخت کے پتے وہ خود کھا لے گا ۔</b>",
        "bookID": "45.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 123420,
        "last_updated": null
    },
    {
        "urduURN": 4024100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 45,
        "bookName": "کتاب لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2428,
        "hadithSanad": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے سلیمان تیمی نے بیان کیا ، ان سے یحییٰ بن سعید انصاری نے ، ان سے منبعث کے غلام یزید نے ، انہوں نے زید بن خالد سے سنا ، انہوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم سے لقطہٰ کے متعلق پوچھا گیا ۔ وہ یقین رکھتے تھے کہ آپ صلی اللہ علیہ وسلم نے فرمایا اس کے برتن کی بناوٹ اور اس کے بندھن کو ذہن میں رکھ ، پھر ایک سال تک اس کا اعلان کرتا رہ ۔ یزید بیان کرتے تھے کہ اگر اسے پہچاننے والا ( اس عرصہ میں ) نہ ملے تو پانے والے کو اپنی ضروریات میں خرچ کر لینا چاہئے ۔ اور یہ اس کے پاس امانت کے طور پر ہو گا ۔ اس آخری ٹکڑے ( کہ اس کے پاس امانت کے طور پر ہو گا ) کے متعلق مجھے معلوم نہیں کہ یہ رسول اللہ صلی اللہ علیہ وسلم کی حدیث ہے یا خود انہوں نے اپنی طرف سے یہ بات کہی ہے ۔ پھر پوچھا ، راستہ بھولی ہوئی بکری کے متعلق آپ کا کیا ارشاد ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے پکڑ لو ۔ وہ یا تمہاری ہو گی ( جب کہ اصل مالک نہ ملے ) یا تمہارے بھائی ( مالک ) کے پاس پہنچ جائے گی ، یا پھر اسے بھیڑیا اٹھا لے جائے گا ۔ یزید نے بیان کیا کہ اس کا بھی اعلان کیا جائے گا ۔ پھر صحابی نے پوچھا ، راستہ بھولے ہوئے اونٹ کے بارے میں آپ کا کیا ارشاد ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے آزاد رہنے دو ، اس کے ساتھ اس کے کھر بھی ہیں اور اس کا مشکیزہ بھی ، خود پانی پر پہنچ جائے گا اور خود ہی درخت کے پتے کھا لے گا اور اس طرح وہ اپنے مالک تک پہنچ جائے گا ۔</b>",
        "bookID": "45.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 123430,
        "last_updated": null
    },
    {
        "urduURN": 4024110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 45,
        "bookName": "کتاب لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2429,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں ربیعہ بن ابی عبدالرحمٰن نے ، انہیں منبعث کے غلام یزید نے اور ان سے زید بن خالد رضی اللہ عنہ نے کہ",
        "hadithText": "ایک شخص نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ صلی اللہ علیہ وسلم سے لقطہٰ کے بارے میں سوال کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کے برتن کی بناوٹ اور اس کے بندھن کو ذہن میں یاد رکھ کر ایک سال تک اس کا اعلان کرتا رہ ۔ اگر مالک مل جائے ( تو اسے دیدے ) و رنہ اپنی ضرورت میں خرچ کر ۔ انہوں نے پوچھا اور اگر راستہ بھولی ہوئی بکری ملے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہ تمہاری ہو گی یا تمہارے بھائی کی ہو گی ۔ ورنہ پھر بھیڑیا اسے اٹھا لے جائے گا صحابی نے پوچھا اور اونٹ جو راستہ بھول جائے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا تمہیں اس سے کیا مطلب ؟ اس کے ساتھ خود اس کا مشکیزہ ہے ، اس کے کھر ہیں ، پانی پر وہ خود ہی پہنچ جائے گا اور خود ہی درخت کے پتے کھا لے گا ۔ اور اس طرح کسی نہ کسی دن اس کا مالک اسے خود پالے گا ۔</b>",
        "bookID": "45.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 123440,
        "last_updated": null
    },
    {
        "urduURN": 4024120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 45,
        "bookName": "کتاب لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2430,
        "hadithSanad": "اور لیث بن سعد نے بیان کیا کہ مجھ سے جعفر بن ربیعہ نے بیان کیا ، ان سے عبدالرحمٰن بن ہرمز نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے بنی اسرائیل کے ایک مرد کا ذکر کیا ۔ پھر پوری حدیث بیان کی ( جو اس سے پہلے گز رچکی ہے ) کہ ( قرض دینے والا ) باہر یہ دیکھنے کے لیے نکلا کہ ممکن ہے کوئی جہاز اس کا روپیہ لے کر آیا ہو ۔ ( دریا کے کنارے پر جب وہ پہنچا ) تو اسے ایک لکڑی ملی جسے اس نے اپنے گھر کے ایندھن کے لیے اٹھا لیا ۔ لیکن جب اسے چیرا تو اس میں روپیہ اور خط پایا ۔</b>",
        "bookID": "45.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 123450,
        "last_updated": null
    },
    {
        "urduURN": 4024130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 45,
        "bookName": "کتاب لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2431,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، کہا کہ ہم سے سفیان ثوری نے بیان کیا ، ان سے منصور بن معتمر نے ، ان سے طلحہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی راستے میں ایک کھجور پر نظر پڑی ۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر اس کا ڈر نہ ہوتا کہ صدقہ کی ہے تو میں خو داسے کھا لیتا ۔</b>",
        "bookID": "45.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 123460,
        "last_updated": null
    },
    {
        "urduURN": 4024140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 45,
        "bookName": "کتاب لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2432,
        "hadithSanad": "اور یحییٰ بن سعید قطان نے بیان کیا ، کہ ہم سے سفیان ثوری نے بیان کیا ، کہا مجھ سے منصور نے بیان کیا ، اور زائدہ بن قدامہ نے بھی منصور سے بیان کیا ، اور ان سے طلحہ نے ، کہا کہ ہم سے انس رضی اللہ عنہ نے حدیث بیان کی ( دوسری سند ) اور ہم سے محمد بن مقاتل نے بیان کیا ، انہیں عبداللہ بن مبارک نے خبر دی ، انہیں معمر نے ، انہیں ہمام بن منبہ نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میں اپنے گھر جاتا ہوں ، وہاں مجھے میرے بستر پر کھجور پڑی ہوئی ملتی ہے ۔ میں اسے کھانے کے لیے اٹھا لیتا ہوں ۔ لیکن پھر یہ ڈر ہوتا ہے کہ کہیں صدقہ کی کھجور نہ ہو ۔ تو میں اسے پھینک دیتا ہوں ۔</b>",
        "bookID": "45.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 123470,
        "last_updated": null
    },
    {
        "urduURN": 4024150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 45,
        "bookName": "کتاب لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2433,
        "hadithSanad": "اور احمد بن سعد نے کہا ، ان سے روح نے بیان کیا ، ان سے زکریا نے بیان کیا ، ان سے عمرو بن دینار نے بیان کیا ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، مکہ کے درخت نہ کاٹے جائیں ، وہاں کے شکار نہ چھیڑے جائیں ، اور وہاں کے لقطہٰ کو صرف وہی اٹھائے جو اعلان کرے ، اور اس کی گھاس نہ کاٹی جائے ۔ حضرت عباس رضی اللہ عنہ نے کہا کہ یا رسول اللہ ! اذخر کی اجازت دے دیجئیے چنانچہ آنحضرت صلی اللہ علیہ وسلم نے اذخر کی اجازت دے دی ۔</b>",
        "bookID": "45.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 123480,
        "last_updated": null
    },
    {
        "urduURN": 4024160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 45,
        "bookName": "کتاب لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2434,
        "hadithSanad": "ہم سے یحییٰ بن موسیٰ نے بیان کیا ، ان سے ولید بن مسلم نے بیان کیا ، ان سے امام اوزاعی نے بیان کیا ، کہا کہ مجھ سے یحییٰ بن ابی کثیر نے بیان کیا ، کہا کہ مجھ سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا ، کہا کہ",
        "hadithText": "مجھ سے ابوہریرہ رضی اللہ عنہ نے بیان کیا ، انہوں نے کہا کہ جب اللہ تعالیٰ نے رسول کریم صلی اللہ علیہ وسلم کو مکہ فتح کرا دیا تو آپ صلی اللہ علیہ وسلم لوگوں کے سامنے کھڑے ہوئے اور اللہ تعالیٰ کی حمد و ثنا کے بعد فرمایا اللہ تعالیٰ نے ہاتھیوں کے لشکر کو مکہ سے روک دیا تھا ، لیکن اپنے رسول اور مسلمانوں کو اسے فتح کرا دیا ۔ دیکھو ! یہ مکہ مجھ سے پہلے کسی کے لیے حلال نہیں ہوا تھا ( یعنی وہاں لڑنا ) اور میرے لیے صرف دن کے تھوڑے سے حصے میں درست ہوا ۔ اب میرے بعد کسی کے لیے درست نہیں ہو گا ۔ پس اس کے شکار نہ چھیڑے جائیں اور نہ اس کے کانٹے کاٹے جائیں ۔ یہاں کی گری ہوئی چیز صرف اسی کے لیے حلال ہو گی جو اس کا اعلان کرے ۔ جس کا کوئی آدمی قتل کیا گیا ہو اسے دو باتوں کا اختیار ہے یا ( قاتل سے ) فدیہ ( مال ) لے لے ، یا جان کے بدلے جان لے ۔ حضرت عباس رضی اللہ عنہ نے کہا ، یا رسول اللہ ! اذخر کاٹنے کی اجازت ہو ، کیونکہ ہم اسے اپنی قبروں اور گھروں میں استعمال کرتے ہیں ۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اچھا اذخر کاٹنے کی اجاز ت ہے ۔ پھر ابوشاہ یمن کے ایک صحابی نے کھڑے ہو کر کہا ، یا رسول اللہ ! میرے لیے یہ خطبہ لکھوا دیجئیے ، چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے صحابہ کو حکم فرمایا کہ ابوشاہ کے لیے یہ خطبہ لکھ دو ۔ میں نے امام اوزاعی سے پوچھا کہ اس سے کیا مراد ہے کہ ” میرے لیے اسے لکھوا دیجئیے “ تو انہوں نے کہا کہ وہی خطبہ مراد ہے جو انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے ( مکہ میں ) سنا تھا ۔</b>",
        "bookID": "45.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 123490,
        "last_updated": null
    },
    {
        "urduURN": 4024170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 45,
        "bookName": "کتاب لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2435,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی نافع سے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، کوئی شخص کسی دوسرے کے دودھ کے جانور کو مالک کی اجازت کے بغیر نہ دوہے ۔ کیا کوئی شخص یہ پسند کرے گا کہ ایک غیر شخص اس کے گودام میں پہنچ کر اس کا ذخیرہ کھولے اور وہاں سے اس کا غلہ چرا لائے ، لوگوں کے مویشی کے تھن بھی ان کے لیے کھانا یعنی ( دودھ کے ) گودا م ہیں ۔ اس لیے انہیں بھی مالک کی اجازت کے بغیر نہ دودھا جائے ۔</b>",
        "bookID": "45.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 123500,
        "last_updated": null
    },
    {
        "urduURN": 4024180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 45,
        "bookName": "کتاب لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2436,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا کہ ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے ربیعہ بن عبدالرحمٰن نے ، ان سے منبعث کے غلام یزید نے ، اور ان سے زید بن خالد جہنی رضی اللہ عنہ نے کہ",
        "hadithText": "ایک شخص نے رسول کریم صلی اللہ علیہ وسلم سے لقطہٰ کے بارے میں پوچھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک سال تک اس کا اعلان کرتا رہ ۔ پھر اس کے بندھن اور برتن کی بناوٹ کو ذہن میں یاد رکھ ۔ اور اسے اپنی ضروریات میں خرچ کر ۔ اس کا مالک اگر اس کے بعد آئے تو اسے واپس کر دے ۔ صحابہ رضی اللہ عنہم نے پوچھا یا رسول اللہ ! راستہ بھولی ہوئی بکری کا کیا کیا جائے ؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے پکڑ لو ، کیونکہ وہ یا تمہاری ہو گی یا تمہارے بھائی کی ہو گی یا پھر بھیڑیئے کی ہو گی ۔ صحابہ نے پوچھا ، یا رسول اللہ ! راستہ بھولے ہوئے اونٹ کا کیا کیا جائے ؟ آپ اس پر غصہ ہو گئے اور چہرہ مبارک سرخ ہو گیا ( یا راوی نے وجنتاہ کے بجائے ) احمر وجہہ کہا ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا ، تمہیں اس سے کیا مطلب ؟ اس کے ساتھ خود اس کے کھر اور اس کا مشکیزہ ہے ۔ اسی طرح اسے اس کا اصل مالک مل جائے گا ۔</b>",
        "bookID": "45.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 123510,
        "last_updated": null
    },
    {
        "urduURN": 4024190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 45,
        "bookName": "کتاب لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2437,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے سلمہ بن کہیل نے بیان کیا کہ میں نے سوید بن غفلہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں سلمان بن ربیعہ اور زید بن صوحان کے ساتھ ایک جہاد میں شریک تھا ۔ میں نے ایک کوڑا پایا ( اور اس کو اٹھا لیا ) دونوں میں سے ایک نے مجھ سے کہا کہ اسے پھینک دے ۔ میں نے کہا کہ ممکن ہے مجھے اس کا مالک مل جائے ۔ ( تو اس کو دے دوں گا ) ورنہ خود اس سے نفع اٹھاؤں گا ۔ جہاد سے واپس ہونے کے بعد ہم نے حج کیا ۔ جب میں مدینے گیا تو میں نے ابی بن کعب رضی اللہ عنہ سے اس کے بارے میں پوچھا ، انہوں نے بتلایا کہ نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں مجھ کو ایک تھیلی مل گئی تھی ۔ جس میں سو دینار تھے ۔ میں اسے لے کر آنحضرت صلی اللہ علیہ وسلم کی خدمت میں گیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک سال تک اس کا اعلان کرتا رہ ، میں نے ایک سال تک اس کا اعلان کیا اور پھر حاضر ہوا ۔ ( کہ مالک ابھی تک نہیں ملا ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک سال تک اور اعلان کر ، میں نے ایک سال تک اس کا پھر اعلان کیا ، اور حاضر خدمت ہوا ۔ اس مرتبہ بھی آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک سال تک اس کا پھر اعلان کر ، میں نے پھر ایک سال تک اعلان کیا اور جب چوتھی مرتبہ حاضر ہوا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ رقم کے عدد ، تھیلی کا بندھن ، اور اس کی ساخت کو خیال میں رکھ ، اگر اس کا مالک مل جائے تو اسے دیدے ورنہ اسے اپنی ضروریات میں خرچ کر ۔ ہم سے عبدان نے بیان کیا کہا کہ مجھے میرے باپ نے خبر دی شعبہ سے اور انہیں سلمہ نے یہی حدیث ، شعبہ نے بیان کیا کہ پھر اس کے بعد مکہ میں سلمہ سے ملا ، تو انہوں نے کہا کہ مجھے خیال نہیں ( اس حدیث میں سوید نے ) تین سال تک بتلانے کا ذکر کیا تھا یا ایک سال کا ۔</b>",
        "bookID": "45.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 123520,
        "last_updated": null
    },
    {
        "urduURN": 4024200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 45,
        "bookName": "کتاب لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2438,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، کہا کہ ہم سے سفیان ثوری نے بیان کیا ربیعہ سے ، ان سے منبعث کے غلام یزید نے ، اور ان سے زید بن خالد رضی اللہ عنہ نے کہا کہ",
        "hadithText": "ایک دیہاتی نے رسول اللہ صلی اللہ علیہ وسلم سے لقطہٰ کے متعلق پوچھا ، تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک سال تک اس کا اعلان کرتا رہ ، اگر کوئی ایسا شخص آ جائے جو اس کی بناوٹ اور بندھن کے بارے میں صحیح صحیح بتائے ( تو اسے دیدے ) ورنہ اپنی ضروریات میں اسے خرچ کر ۔ انہوں نے جب ایسے اونٹ کے متعلق بھی پوچھا جو راستہ بھول گیا ہو ۔ تو آپ کے چہرہ مبارک کا رنگ بدل گیا اور آپ صلی اللہ علیہ وسلم نے فرمایا کہ تمہیں اس سے کیا مطلب ؟ اس کے ساتھ اس کا مشکیزہ اور اس کے کھر موجود ہیں ۔ وہ خود پانی تک پہنچ سکتا ہے ۔ اور درخت کے پتے کھا سکتا ہے اور اس طرح وہ اپنے مالک تک پہنچ سکتا ہے ۔ انہوں نے راستہ بھولی ہوئی بکری کے متعلق بھی پوچھا ، تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ یا وہ تمہاری ہو گی یا تمہارے بھائی ( اصل مالک ) کو مل جائے گی ۔ ورنہ اسے بھیڑیا اٹھا لے جائے گا ۔</b>",
        "bookID": "45.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 123540,
        "last_updated": null
    },
    {
        "urduURN": 4024210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 45,
        "bookName": "کتاب لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2439,
        "hadithSanad": "ہم سے اسحاق بن ابراہیم نے بیان کیا ، کہا کہ ہم کو نضر نے خبر دی ، کہا کہ ہم کو اسرائیل نے خبر دی ابواسحاق سے کہ مجھے براء  بن عازب رضی اللہ عنہ نے ابوبکر رضی اللہ عنہ سے خبر دی ( دوسری سند ) ہم سے عبداللہ بن رجاء نے بیان کیا ، کہا کہ ہم سے اسرائیل نے بیان کیا ابواسحاق سے ، اور انہوں نے ابوبکر رضی اللہ عنہ سے کہ",
        "hadithText": "( ہجرت کر کے مدینہ جاتے وقت ) میں نے تلاش کیا تو مجھے ایک چرواہا ملا جو اپنی بکریاں چرا رہا تھا ۔ میں نے اس سے پوچھا کہ تم کس کے چرواہے ہو ؟ اس نے کہا کہ قریش کے ایک شخص کا ۔ اس نے قریشی کا نام بھی بتایا ، جسے میں جانتا تھا ۔ میں نے اس سے پوچھا کیا تمہارے ریوڑ کی بکریوں میں دودھ بھی ہے ؟ اس نے کہا کہ ہاں ! میں نے اس سے کہا کیا تم میرے لیے دودھ دوہ لو گے ؟ اس نے کہا ، ہاں ضرور ! چنانچہ میں نے اس سے دوہنے کے لیے کہا ۔ وہ اپنے ریوڑ سے ایک بکری پکڑ لایا ۔ پھر میں نے اس سے بکری کا تھن گردوغبار سے صاف کرنے کے لیے کہا ۔ پھر میں نے اس سے اپنا ہاتھ صاف کرنے کے لیے کہا ۔ اس نے ویسا ہی کیا ۔ ایک ہاتھ کو دوسرے پر مار کر صاف کر لیا ۔ اور ایک پیالہ دودھ دوہا ۔ رسول اللہ صلی اللہ علیہ وسلم کے لیے میں نے ایک برتن ساتھ لیا تھا ۔ جس کے منہ پر کپڑا بندھا ہوا تھا ۔ میں نے پانی دودھ پر بہایا ۔ جس سے اس کا نچلا حصہ ٹھنڈا ہو گیا پھر دودھ لے کر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ اور عرض کیا کہ دودھ حاضر ہے ۔ یا رسول اللہ ! پی لیجئے ، آپ نے اسے پیا ، یہاں تک کہ میں خوش ہو گیا ۔</b>",
        "bookID": "45.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 123550,
        "last_updated": null
    },
    {
        "urduURN": 4024085,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 45,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2426,
        "hadithSanad": "ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ( دوسری سند ) اور مجھ سے محمد بن بشار نے بیان کیا ، ان سے غندر نے ، ان سے شعبہ نے ، ان سے سلمہ نے کہ میں نے سوید بن غفلہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نے ابی بن کعب رضی اللہ عنہ سے ملاقات کی تو انہوں نے کہا کہ میں نے سو دینار کی ایک تھیلی ( کہیں راستے میں پڑی ہوئی ) پائی ۔ میں اسے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لایا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک سال تک اس کا اعلان کرتا رہ ۔ میں نے ایک سال تک اس کا اعلان کیا ، لیکن مجھے کوئی ایسا شخص نہیں ملا جو اسے پہچان سکتا ۔ اس لیے میں پھر آنحضرت صلی اللہ علیہ وسلم کی خدمت میں آیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک سال تک اس کاا علان کرتا رہ ۔ میں نے پھر ( سال بھر ) اعلان کیا ۔ لیکن ان کا مالک مجھے نہیں ملا ۔ تیسری مرتبہ حاضر ہوا ، تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس تھیلی کی بناوٹ ، دینار کی تعداد اور تھیلی کے بندھن کو محفوظ رکھ ۔ اگر اس کا مالک آ جائے تو ( علامت پوچھ کے ) اسے واپس کر دینا ، ورنہ اپنے خرچ میں اسے استعمال کر لے چنانچہ میں اسے اپنے اخراجات میں لایا ۔ ( شعبہ نے بیان کیا کہ ) پھر میں نے سلمہ سے اس کے بعد مکہ میں ملاقات کی تو انہوں کہا کہ مجھے یاد نہیں رسول کریم صلی اللہ علیہ وسلم نے ( حدیث میں ) تین سال تک ( اعلان کرنے کے لیے فرمایا تھا ) یا صرف ایک سال کے لیے ۔</b>",
        "bookID": "45.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 123410,
        "last_updated": null
    },
    {
        "urduURN": 4024192,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 45,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2437,
        "hadithSanad": "ہم سے عبدان نے بیان کیا کہا کہ مجھے میرے باپ نے خبر دی شعبہ سے اور انہیں سلمہ نے یہی حدیث ، شعبہ نے بیان کیا",
        "hadithText": "کہ پھر اس کے بعد مکہ میں سلمہ سے ملا ، تو انہوں نے کہا کہ مجھے خیال نہیں ( اس حدیث میں سوید نے ) تین سال تک بتلانے کا ذکر کیا تھا یا ایک سال کا ۔</b>",
        "bookID": "45.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 123530,
        "last_updated": null
    }
]