[
    {
        "urduURN": 4024650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 47,
        "bookName": "کتاب شراکت کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2483,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں وہب بن کیسان نے اور انہیں جابر بن عبداللہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ( رجب 7ھ میں ) ساحل بحر کی طرف ایک لشکر بھیجا ۔ اور اس کاامیر ابوعبیدہ بن جراح رضی اللہ عنہ کو بنایا ۔ فوجیوں کی تعداد تین سو تھی اور میں بھی ان میں شریک تھا ۔ ہم نکلے اور ابھی راستے ہی میں تھے کہ توشہ ختم ہو گیا ۔ ابوعبیدہ رضی اللہ عنہ نے حکم دیا کہ تمام فوجی اپنے توشے ( جو کچھ بھی باقی رہ گئے ہوں ) ایک جگہ جمع کر دیں ۔ سب کچھ جمع کرنے کے بعد کھجوروں کے کل دو تھیلے ہو سکے اور روزانہ ہمیں اسی میں سے تھوڑی تھوڑی کھجور کھانے کے لیے ملنے لگی ۔ جب اس کا بھی اکثر حصہ ختم ہو گیا تو ہمیں صرف ایک ایک کھجور ملتی رہی ۔ میں ( وہب بن کیسان ) نے جابر رضی اللہ عنہ سے کہا بھلا ایک کھجور سے کیا ہوتا ہو گا ؟ انہوں نے بتلایا کہ اس کی قدر ہمیں اس وقت معلوم ہوئی جب وہ بھی ختم ہو گئی تھی ۔ انہوں نے بیان کیا کہ آخر ہم سمندر تک پہنچ گئے ۔ اتفاق سے سمندر میں ہمیں ایک ایسی مچھلی مل گئی جو ( اپنے جسم میں ) پہاڑ کی طرح معلوم ہوتی تھی ۔ سارا لشکر اس مچھلی کو اٹھارہ راتوں تک کھاتا رہا ۔ پھر ابوعبیدہ رضی اللہ عنہ نے اس کی دونوں پسلیوں کو کھڑا کرنے کا حکم دیا ۔ اس کے بعد اونٹوں کو ان کے تلے سے چلنے کا حکم دیا ۔ اور وہ ان پسلیوں کے نیچے سے ہو کر گزرے ، لیکن اونٹ نے ان کو چھوا تک نہیں ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 124000,
        "last_updated": null
    },
    {
        "urduURN": 4024660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 47,
        "bookName": "کتاب شراکت کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2484,
        "hadithSanad": "ہم سے بشر بن مرحوم نے بیان کیا ، کہا کہ ہم سے حاتم بن اسماعیل نے بیان کیا ، ان سے یزید بن ابی عبیدہ نے اور ان سے سلمہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "( غزوہ ہوازن میں ) لوگوں کے توشے ختم ہو گئے اور فقر و محتاجی آ گئی ، تو لوگ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے ۔ اپنے اونٹوں کو ذبح کرنے کی اجازت لینے ( تاکہ انہیں کے گوشت سے پیٹ بھر سکیں ) آپ صلی اللہ علیہ وسلم نے انہیں اجازت دے دی ۔ راستے میں حضرت عمر رضی اللہ عنہ کی ملاقات ان سے ہو گئی تو انہیں بھی ان لوگوں نے اطلاع دی ۔ عمر رضی اللہ عنہ نے کہا اونٹوں کو کاٹ ڈالو گے تو پھر تم کیسے زندہ رہو گے ۔ چنانچہ آپ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور کہا ، یا رسول اللہ ! اگر انہوں نے اونٹ بھی ذبح کر لیے تو پھر یہ لوگ کیسے زندہ رہیں گے ۔ رسول کریم صلی اللہ علیہ وسلم نے فرمایا کہ اچھا ، تمام لوگوں میں اعلان کر دو کہ ان کے پاس جو کچھ توشے بچ رہے ہیں وہ لے کر یہاں آ جائیں ۔ اس کے لیے ایک چمڑے کا دسترخوان بچھا دیا گیا ۔ اور لوگوں نے توشے اسی دسترخوان پر لا کررکھ دئیے ۔ اس کے بعد رسول کریم صلی اللہ علیہ وسلم اٹھے اور اس میں برکت کی دعا فرمائی ۔ اب آپ صلی اللہ علیہ وسلم نے پھر سب لوگوں کو اپنے اپنے برتنوں کے ساتھ بلایا اور سب نے دونوں ہاتھوں سے توشے اپنے برتنوں میں بھر لیے ۔ جب سب لوگ بھر چکے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں اور یہ کہ میں اللہ کا سچا رسول ہوں “ ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 124010,
        "last_updated": null
    },
    {
        "urduURN": 4024670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 47,
        "bookName": "کتاب شراکت کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2485,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، انہوں نے کہا کہ ہم سے اوزاعی نے بیان کیا ، انہوں نے کہا کہ ہم سے ابوالنجاشی نے بیان کیا کہا کہ میں نے رافع بن خدیج رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ عصر کی نماز پڑھ کر اونٹ ذبح کرتے تو انہیں دس حصوں میں تقسیم کرتے اور پھر سورج غروب ہونے سے پہلے ہی ہم اس کا پکا ہوا گوشت بھی کھا لیتے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 124020,
        "last_updated": null
    },
    {
        "urduURN": 4024680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 47,
        "bookName": "کتاب شراکت کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2486,
        "hadithSanad": "ہم سے محمد بن علاء نے بیان کیا ، کہا ہم سے حماد بن اسامہ نے بیان کیا ، ان سے برید نے ، ان سے ابوبردہ نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، قبیلہ اشعر کے لوگوں کا جب جہاد کے موقع پر توشہ کم ہو جاتا یا مدینہ ( کے قیام ) میں ان کے بال بچوں کے لیے کھانے کی کمی ہو جاتی تو جو کچھ بھی ان کے پاس توشہ ہوتا تو وہ ایک کپڑے میں جمع کر لیتے ہیں ۔ پھر آپس میں ایک برتن سے برابر تقسیم کر لیتے ہیں ۔ پس وہ میرے ہیں اور میں ان کا ہوں ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 124030,
        "last_updated": null
    },
    {
        "urduURN": 4024690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 47,
        "bookName": "کتاب شراکت کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2487,
        "hadithSanad": "ہم سے محمد بن عبداللہ بن مثنیٰ نے بیان کیا ، انہوں نے کہا کہ مجھ سے میرے والد نے بیان نے بیان کیا ، انہوں نے کہا کہ مجھ سے ثمامہ بن عبداللہ بن انس نے بیان کیا ، ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ابوبکر رضی اللہ عنہ نے ان کے لیے فرض زکوٰۃ کا بیان تحریر کیا تھا جو رسول اللہ صلی اللہ علیہ وسلم نے مقرر کی تھی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب کسی مال میں دو آدمی ساجھی ہوں تو وہ زکوٰۃ میں ایک دوسرے سے برابر برابر مجرا کر لیں ۔ ( یعنی رکوٰۃ کی رقم آپس میں برابر تقسیم کر لیں ) ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 124040,
        "last_updated": null
    },
    {
        "urduURN": 4024700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 47,
        "bookName": "کتاب شراکت کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2488,
        "hadithSanad": "ہم سے علی بن حکم انصاری نے بیان کیا ، کہا ہم سے ابوعوانہ نے بیان کیا ، ان سے سعید بن مسروق نے ، ان سے عبایہ بن رفاعہ بن رافع بن خدیج رضی اللہ عنہ نے اور ان سے ان کے دادا ( رافع بن خدیج رضی اللہ عنہ ) نے بیان کیا کہ",
        "hadithText": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مقام ذوالحلیفہ میں ٹھہرے ہوئے تھے ۔ لوگوں کو بھوک لگی ۔ ادھر ( غنیمت میں ) اونٹ اور بکریاں ملی تھیں ۔ انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم لشکر کے پیچھے کے لوگوں میں تھے ۔ لوگوں نے جلدی کی اور ( تقسیم سے پہلے ہی ) ذبح کر کے ہانڈیاں چڑھا دیں ۔ لیکن بعد میں نبی کریم صلی اللہ علیہ وسلم نے حکم دیا اور وہ ہانڈیاں اوندھا دی گئیں ۔ پھر آپ نے ان کو تقسیم کیا اور دس بکریوں کو ایک اونٹ کے برابر رکھا ۔ ایک اونٹ اس میں سے بھاگ گیا تو لوگ اسے پکڑنے کی کوشش کرنے لگے ۔ لیکن اس نے سب کو تھکا دیا ۔ قوم کے پاس گھوڑے کم تھے ۔ ایک صحابی تیر لے کر اونٹ کی طرف جھپٹے ۔ اللہ نے اس کو ٹھہرا دیا ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ ان جانوروں میں بھی جنگلی جانوروں کی طرح سرکشی ہوتی ہے ۔ اس لیے ان جانوروں میں سے بھی اگر کوئی تمہیں عاجز کر دے تو اس کے ساتھ تم ایسا ہی معاملہ کیا کرو ۔ پھر میرے دادا نے عرض کیا کہ کل دشمن کے حملہ کا خوف ہے ، ہمارے پاس چھریاں نہیں ہیں ( تلواروں سے ذبح کریں تو ان کے خراب ہونے کا ڈر ہے جب کہ جنگ سامنے ہے ) کیا ہم بانس کے کھپچی سے ذبح کر سکتے ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ، جو چیز بھی خون بہا دے اور ذبیحہ پر اللہ تعالیٰ کا نام لیا گیا ہو ، تو اس کے کھانے میں کوئی حرج نہیں ۔ سوائے دانت اور ناخن کے ۔ اس کی وجہ میں تمہیں بتاتا ہوں ۔ دانت تو ہڈی ہے اور ناخن حبشیوں کی چھری ہے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 124050,
        "last_updated": null
    },
    {
        "urduURN": 4024710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 47,
        "bookName": "کتاب شراکت کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2489,
        "hadithSanad": "ہم سے خلاد بن یحییٰ نے بیان کیا ، انہوں نے کہا ہم سے سفیان ثوری نے بیان کیا ، کہا ہم سے جبلہ بن سحیم نے بیان کیا ، انہوں نے کہا کہ میں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا ۔ انہوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے اس سے منع فرمایا تھا کہ کوئی شخص اپنے ساتھیوں کی اجازت کے بغیر ( دسترخوان پر ) دو دو کھجور ایک ساتھ ملا کر کھائے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 124060,
        "last_updated": null
    },
    {
        "urduURN": 4024720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 47,
        "bookName": "کتاب شراکت کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2490,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے جبلہ نے بیان کیا ، کہ",
        "hadithText": "ہمارا قیام مدینہ میں تھا اور ہم پر قحط کا دور دورہ ہوا ۔ عبداللہ بن زبیر رضی اللہ عنہما ہمیں کھجور کھانے کے لیے دیتے تھے اور عبداللہ بن عمر رضی اللہ عنہما گزرتے ہوئے یہ کہہ کر جایا کرتے تھے کہ دو دو کھجور ایک ساتھ ملا کر نہ کھانا کیونکہ نبی کریم صلی اللہ علیہ وسلم نے اپنے دوسرے ساتھی کی اجازت کے بغیر ایسا کرنے سے منع فرمایا ہے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 124070,
        "last_updated": null
    },
    {
        "urduURN": 4024730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 47,
        "bookName": "کتاب شراکت کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2491,
        "hadithSanad": "ہم سے عمران بن میسرہ ابوالحسن بصری نے بیان کیا ، کہا کہ ہم سے عبدالوارث بن سعید نے بیان کیا ، کہا ہم سے ایوب سختیانی نے ، کہا ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا جو شخص مشترک ( ساجھے ) کے غلام میں اپنا حصہ آزاد کر دے اور اس کے پاس سارے غلام کی قیمت کے موافق مال ہو تو وہ پورا آزاد ہو جائے گا ۔ اگر اتنا مال نہ ہو تو بس جتنا حصہ اس کا تھا اتنا ہی آزاد ہوا ۔ ایوب نے کہا کہ یہ مجھے معلوم نہیں کہ روایت کا یہ آخری حصہ ” غلام کا وہی حصہ آزاد ہو گا جو اس نے آزاد کیا ہے “ یہ نافع کا اپنا قول ہے یا نبی کریم صلی اللہ علیہ وسلم کی حدیث میں داخل ہے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 124080,
        "last_updated": null
    },
    {
        "urduURN": 4024740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 47,
        "bookName": "کتاب شراکت کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2492,
        "hadithSanad": "ہم سے بشیر بن محمد نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو سعید بن ابی عروبہ نے خبر دی ، انہیں قتادہ نے ، انہیں نضر بن انس نے ، انہیں بشیر بن نہیک نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو شخص مشترک غلام میں سے اپنا حصہ آزاد کر دے تو اس کے لیے ضروری ہے کہ اپنے مال سے غلام کو پوری آزادی دلا دے ۔ لیکن اگر اس کے پاس اتنا مال نہیں ہے تو انصاف کے ساتھ غلام کی قیمت لگائی جائے ۔ پھر غلام سے کہا جائے کہ ( اپنی آزادی کی ) کوشش میں وہ باقی حصہ کی قیمت خود کما کر ادا کر لے ۔ لیکن غلام پر اس کے لیے کوئی دباو نہ ڈالا جائے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 124090,
        "last_updated": null
    },
    {
        "urduURN": 4024750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 47,
        "bookName": "کتاب شراکت کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2493,
        "hadithSanad": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، کہا کہ ہم سے زکریا نے ، کہا میں نے عامر بن شعبہ سے سنا ، انہوں نے بیان کیا کہ میں نے نعمان بن بشیر رضی اللہ عنہ سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ کی حدود پر قائم رہنے والے اور اس میں گھس جانے والے ( یعنی خلاف کرنے والے ) کی مثال ایسے لوگوں کی سی ہے جنہوں نے ایک کشتی کے سلسلے میں قرعہ ڈالا ۔ جس کے نتیجہ میں بعض لوگوں کو کشتی کے اوپر کا حصہ اور بعض کو نیچے کا ۔ پس جو لوگ نیچے والے تھے ، انہیں ( دریا سے ) پانی لینے کے لیے اوپر والوں کے پاس سے گزرنا پڑتا ۔ انہوں نے سوچا کہ کیوں نہ ہم اپنے ہی حصہ میں ایک سوراخ کر لیں تاکہ اوپر والوں کو ہم کوئی تکلیف نہ دیں ۔ اب اگر اوپر والے بھی نیچے والوں کو من مانی کرنے دیں گے تو کشتی والے تمام ہلاک ہو جائیں گے اور اگر اوپر والے نیچے والوں کا ہاتھ پکڑلیں تو یہ خود بھی بچیں گے اور ساری کشتی بھی بچ جائے گی ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 124100,
        "last_updated": null
    },
    {
        "urduURN": 4024760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 47,
        "bookName": "کتاب شراکت کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2494,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ عامری اویسی نے بیان کیا ، انہوں نے کہا ہم سے ابراہیم بن سعد نے بیان کیا ، انہوں نے کہا ہم سے صالح نے ، ان سے ابن شہاب نے بیان کیا ، کہ مجھے عروہ بن زبیر نے خبر دی اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے پوچھا تھا ( دوسری سند ) اور لیث نے بیان کیا کہ مجھ سے یونس نے بیان کیا ، ان سے ابن شہاب نے ، انہیں عروہ بن زبیر نے خبر دی کہ",
        "hadithText": "انہوں نے عائشہ رضی اللہ عنہا سے ( سورۃ نساء میں ) اس آیت کے بارے میں پوچھا ” اگر تم کو یتیموں میں انصاف نہ کرنے کا ڈر ہو تو جو عورتیں پسند آئیں دو دو تین تین چار چار نکاح میں لاؤ “ انہوں نے کہا میرے بھانجے یہ آیت اس یتیم لڑکی کے بارے میں ہے جو اپنے ولی ( محافظ رشتہ دار جیسے چچیرا بھائی ، پھوپھی زاد یا ماموں زاد بھائی ) کی پرورش میں ہو اور ترکے کے مال میں اس کی ساجھی ہو اور وہ اس کی مالداری اور خوبصورتی پر فریفتہ ہو کر اس سے نکاح کر لینا چاہے لیکن پورا مہر انصاف سے جتنا اس کو اور جگہ ملتا وہ نہ دے ، تو اسے اس سے منع کر دیا گیا کہ ایسی یتیم لڑکیوں سے نکاح کرے ۔ البتہ اگر ان کے ساتھ ان کے ولی انصاف کر سکیں اور ان کی حسب حیثیت بہتر سے بہتر طرز عمل مہر کے بارے میں اختیار کریں ( تو اس صورت میں نکاح کرنے کی اجازت ہے ) اور ان سے یہ بھی کہہ دیا گیا کہ ان کے سوا جو بھی عورت انہیں پسند ہو ان سے وہ نکاح کر سکتے ہیں ۔ عروہ بن زبیر نے کہا کہ عائشہ رضی اللہ عنہا نے بتلایا ، پھر لوگوں نے اس آیت کے نازل ہونے کے بعد ( ایسی لڑکیوں سے نکاح کی اجازت کے بارے میں ) مسئلہ پوچھا تو اللہ تعالیٰ نے یہ آیت نازل کی ” اور آپ سے عورتوں کے بارے میں یہ لوگ سوال کرتے ہیں “ ۔ آگے فرمایا اور تم ان سے نکاح کرنا چاہتے ہو ۔ یہ جو اس آیت میں ہے اور جو قرآن میں تم پر پڑھا جاتا ہے اس سے مراد پہلی آیت ہے یعنی ” اگر تم کو یتیموںمیں انصاف نہ ہوسکنے کا ڈر ہو تو دوسری عورتیں جو بھلی لگیں ان سے نکاح کر لو “ ۔ حضرت عائشہ رضی اللہ عنہا نے کہا یہ جو اللہ نے دوسری آیت میں فرمایا اور تم ان سے نکاح کرنا چاہتے ہو اس سے یہ غرض ہے کہ جو یتیم لڑکی تمہاری پرورش میں ہو اور مال اور جمال کم رکھتی ہو اس سے تو تم نفرت کرتے ہو ، اس لیے جس یتیم لڑکی کے مال اور جمال میں تم کو رغبت ہو اس سے بھی نکاح نہ کرو مگر اس صورت میں جب انصاف کے ساتھ ان کا پورا مہر ادا کرو ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 124110,
        "last_updated": null
    },
    {
        "urduURN": 4024770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 47,
        "bookName": "کتاب شراکت کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2495,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے ہشام بن یوسف نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں زبیری نے ، انہیں ابوسلمہ نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے شفعہ کا حق ایسے اموال ( زمین جائیداد وغیرہ ) میں دیا تھا جن کی تقسیم نہ ہوئی ہو ۔ لیکن جب اس کی حد بندی ہو جائے اور راستے بھی بدل دیے جائیں تو پھر شفعہ کا کوئی حق باقی نہیں رہے گا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 124120,
        "last_updated": null
    },
    {
        "urduURN": 4024780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 47,
        "bookName": "کتاب شراکت کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2496,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے عبدالواحد نے بیان کیا ، انہوں نے کہا ہم سے معمر نے بیان کیا ، ان سے زہری نے بیان کیا ، ان سے ابوسلمہ نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ہر اس جائیداد میں شفعہ کا حق دیا تھا جس کی شرکاء میں ابھی تقسیم نہ ہوئی ہو ۔ لیکن اگر حد بندی ہو جائے اور راستے الگ ہو جائیں تو پھر شفعہ کا حق باقی نہیںرہتا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 124130,
        "last_updated": null
    },
    {
        "urduURN": 4024790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 47,
        "bookName": "کتاب شراکت کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عمرو بن علی فلاس نے بیان کیا ، کہا کہ ہم سے ابوعاصم نے بیان کیا ، ان سے عثمان نے جو اسود کے بیٹے ہیں ، کہا کہ مجھے سلیمان بن ابی مسلم نے خبر دی ، انہوں نے کہا کہ",
        "hadithText": "میں نے ابوالمنہال سے بیع صرف نقد کے بارے میں پوچھا تو انہوں نے کہا کہ میں نے اور میرے ایک شریک نے کوئی چیز ( سونے اور چاندی کی ) خریدی نقد پر بھی اور ادھار پر بھی ۔ پھر ہمارے یہاں براء  بن عازب رضی اللہ عنہ آئے تو ہم نے ان سے اس کے بارے میں پوچھا ۔ انہوں نے کہا کہ میں نے اور میرے شریک زید بن ارقم رضی اللہ عنہ نے بھی یہ بیع کی تھی اور ہم نے اس کے متعلق رسول کریم صلی اللہ علیہ وسلم سے پوچھا تھا تو آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ جو نقد ہو وہ لے لو اور جو ادھار ہو اسے چھوڑ دو ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 124140,
        "last_updated": null
    },
    {
        "urduURN": 4024800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 47,
        "bookName": "کتاب شراکت کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2499,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے جویریہ بنت اسماء نے بیان کیا ، ان سے نافع نے اور ان سے عبداللہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے خیبر کی زمین یہودیوں کو اس شرط پر دے دی تھی کہ وہ اس میں محنت کریں اور بوئیں جوتیں ۔ پیداوار کا آدھا حصہ انہیں ملا کرے گا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 124150,
        "last_updated": null
    },
    {
        "urduURN": 4024810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 47,
        "bookName": "کتاب شراکت کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2500,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے یزید بن ابی حبیب نے ، ان سے ابوالخیر نے اور ان سے عقبہ بن عامر رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے انہیں بکریاں دی تھیں کہ قربانی کے لیے ان کو صحابہ میں تقسیم کر دیں ۔ پھر ایک سال کا بکری کا بچہ بچ گیا تو انہوں نے آنحضرت صلی اللہ علیہ وسلم سے اس کا ذکر کیا ۔ آپ صلی اللہ علیہ وسلم نے عقبہ سے فرمایا تو اس کی قربانی کر لے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 124160,
        "last_updated": null
    },
    {
        "urduURN": 4024820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 47,
        "bookName": "کتاب شراکت کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے اصبغ بن فرج نے بیان کیا ، کہا کہ مجھے عبداللہ بن وہب نے خبر دی ، کہا مجھے سعید بن ابی ایوب نے خبر دی ، انہیں زہرہ بن معبد نے ، انہیں ان کے دادا عبداللہ بن ہشام رضی اللہ عنہ نے",
        "hadithText": "انہوں نے نبی کریم صلی اللہ علیہ وسلم کو پایا تھا ۔ ان کی والدہ زینب بنت حمید رضی اللہ عنہا رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آپ کو لے کر حاضر ہوئیں اور عرض کیا کہ یا رسول اللہ ! اس سے بیعت لے لیجئے ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ تو ابھی بچہ ہے ۔ پھر آپ نے ان کے سر پر ہاتھ پھیرا اور ان کے لیے دعا کی اور زہرہ بن معبد سے روایت ہے کہ ان کے داد عبداللہ بن ہشام رضی اللہ عنہ انہیں اپنے ساتھ بازار لے جاتے ۔ وہاں وہ غلہ خریدتے ۔ پھر عبداللہ بن عمر اور عبداللہ بن زبیر رضی اللہ عنہم ان سے ملتے تو وہ کہتے کہ ہمیں بھی اس اناج میں شریک کر لو ۔ کیونکہ آپ کے لیے رسول اللہ صلی اللہ علیہ وسلم نے برکت کی دعا کی ہے ۔ چنانچہ عبداللہ بن ہشام انہیں بھی شریک کر لیتے اور کبھی پورا ایک اونٹ ( مع غلہ ) نفع میں پیدا کر لیتے اور اس کو گھر بھیج دیتے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 124171,
        "last_updated": null
    },
    {
        "urduURN": 4024830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 47,
        "bookName": "کتاب شراکت کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2503,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے جویریہ بنت اسماء نے بیان کیا ، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے کسی ساجھے کے غلام کا اپنا حصہ آزاد کر دیا تو اس کے لیے ضروری ہے کہ اگر غلام کی انصاف کے موافق قیمت کے برابر اس کے پاس مال ہو تو وہ سارا غلام آزاد کرا دے ۔ اس طرح دوسرے ساجھیوں کو ان کے حصے کی قیمت ادا کر دی جائے اور اس آزاد کیے ہوئے غلام کا پیچھا چھوڑ دیا جائے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 124190,
        "last_updated": null
    },
    {
        "urduURN": 4024840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 47,
        "bookName": "کتاب شراکت کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2504,
        "hadithSanad": "ہم سے ابوالنعمان نے بیان کیا ، کہا ہم سے جریر بن حازم نے بیان کیا ، ان سے قتادہ نے ، ان سے نضر بن انس نے ، ان سے بشیر بن نہیک نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس نے کسی ( ساجھے کے ) غلام کا اپنا حصہ آزاد کر دیا تو اگر اس کے پاس مال ہے تو پورا غلام آزاد ہو جائے گا ۔ ورنہ باقی حصوں کو آزاد کرانے کے لیے اس سے محنت مزدوری کرائی جائے ۔ لیکن اس سلسلے میں اس پر کوئی دباو نہ ڈالا جائے ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 124200,
        "last_updated": null
    },
    {
        "urduURN": 4024850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 47,
        "bookName": "کتاب شراکت کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابوالنعمان نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، انہیں عبدالملک بن جریج نے خبر دی ، انہیں عطاء نے اور انہیں جابر رضی اللہ عنہ نے اور ( ابن جریج اسی حدیث کی دوسری روایت ) طاوس سے کرتے ہیں کہ ابن عباس رضی اللہ عنہما نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم چوتھی ذی الحجہ کی صبح کو حج کا تلبیہ کہتے ہوئے جس کے ساتھ کوئی اور چیز ( عمرہ ) نہ ملاتے ہوئے ( مکہ میں ) داخل ہوئے ۔ جب ہم مکہ پہنچے تو آپ کے حکم سے ہم نے اپنے حج کو عمرہ کر ڈالا ۔ آپ نے یہ بھی فرمایا کہ ( عمرہ کے افعال ادا کرنے کے بعد حج کے احرام تک ) ہماری بیویاں ہمارے لیے حلال رہیں گی ۔ اس پر لوگوں میں چرچا ہونے لگا ۔ عطاء نے بیان کیا کہ جابر رضی اللہ عنہ نے کہا کہ کچھ لوگ کہنے لگے کیا ہم میں سے کوئی منیٰ اس طرح جائے کہ منی اس کے ذکر سے ٹپک رہی ہو ۔ جابر نے ہاتھ سے اشارہ بھی کیا ۔ یہ بات نبی کریم صلی اللہ علیہ وسلم تک پہنچی تو آپ خطبہ دینے کھڑے ہوئے اور فرمایا مجھے معلوم ہوا ہے کہ بعض لوگ اس طرح کی باتیں کر رہے ہیں ۔ اللہ کی قسم میں ان لوگوں سے زیادہ نیک اور اللہ سے ڈرنے والا ہوں ۔ اگر مجھے وہ بات پہلے ہی معلوم ہوتی جو اب معلوم ہوئی ہے تو میں قربانی کے جانور اپنے ساتھ نہ لاتا اور اگر میرے ساتھ قربانی کے جانور نہ ہوتے تو میں بھی احرام کھول دیتا ۔ اس پرسراقہ بن مالک بن جعشم کھڑے ہوئے اور کہا یا رسول اللہ صلی اللہ علیہ وسلم ! کیا یہ حکم ( حج کے ایام میں عمرہ ) خاص ہمارے ہی لیے ہے یا ہمیشہ کے لیے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہیں بلکہ ہمیشہ کے لیے ہے ۔ جابر رضی اللہ عنہ نے کہا کہ علی بن ابی طالب رضی اللہ عنہ ( یمن سے ) آئے ۔ اب عطاء اور طاؤس میں سے ایک تو یوں کہتا ہے حضرت علی رضی اللہ عنہ نے احرام کے وقت یوں کہا تھا ۔ لبیک بما اہل بہ رسول اللہ صلی اللہ علیہ وسلم اور دوسرا یوں کہتا ہے کہ انہوں نے لبیک بحجۃ رسول اللہ صلی اللہ علیہ وسلم کہا تھا ۔ نبی کریم صلی اللہ علیہ وسلم نے انہیں حکم دیا کہ وہ اپنے احرام پر قائم رہیں ( جیسا بھی انہوں نے باندھا ہے ) اور انہیں اپنی قربانی میں شریک کر لیا ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 124211,
        "last_updated": null
    },
    {
        "urduURN": 4024860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 47,
        "bookName": "کتاب شراکت کے مسائل کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2507,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا کہ ہم کو وکیع نے خبر دی ، انہیں سفیان ثوری نے ، انہیں ان کے والد سعید بن مسروق نے ، انہیں عبا یہ بن رفاعہ نے اور ان سے ان کے دادا رافع بن خدیج رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ تہامہ کے مقام ذوالحلیفہ میں تھے ( غنیمت میں ) ہمیں بکریاں اور اونٹ ملے تھے ۔ بعض لوگوں نے جلدی کی اور ( جانور ذبح کر کے ) گوشت کو ہانڈیوں میں چڑھا دیا ۔ پھر رسول اللہ صلی اللہ علیہ وسلم تشریف لائے ۔ آپ کے حکم سے گوشت کی ہانڈیوں کو الٹ دیا گیا ۔ پھر ( آپ نے تقسیم میں ) دس بکریوں کا ایک اونٹ کے برابر حصہ رکھا ۔ ایک اونٹ بھاگ کھڑا ہوا ۔ قوم کے پاس گھوڑوں کی کمی تھی ۔ ایک شخص نے اونٹ کو تیرمار کر روک لیا ۔ رسول کریم صلی اللہ علیہ وسلم نے فرمایا کہ ان جانوروں میں بھی جنگی جانوروںکی طرح وحشت ہوتی ہے ۔ اس لیے جب تک ان کو نہ پکڑسکو تو تم ان کے ساتھ ہی ایسا سلوک کیا کرو ۔ عبایہ نے بیان کیا کہ میرے دادا نے عرض کیا ، یا رسول اللہ ! ہمیں امید ہے یا خطرہ ہے کہ کہیں کل دشمن سے مڈبھیڑ نہ ہو جائے اور چھری ہمارے ساتھ نہیں ہے ۔ کیا دھار دار لکڑی سے ہم ذبح کر سکتے ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ، لیکن ذبح کرنے میں جلدی کرو ۔ جو چیز خون بہادے ( اسی سے کاٹ ڈالو ) اگر اس پر اللہ کا نام لیا جائے تو اس کو کھاؤ اورناخن اور دانت سے ذبح نہ کرو ۔ اس کی وجہ میں بتلاتا ہوں دانت تو ہڈی ہے اور ناخن حبشیوں کی چھریاں ہیں ۔</b>",
        "bookID": "47.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 124230,
        "last_updated": null
    }
]