[
    {
        "urduURN": 4024870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 48,
        "bookName": "کتاب رہن کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2508,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے ہشام دستوائی نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا ، اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے اپنی زرہ جو کے بدلے گروی رکھی تھی ۔ ایک دن میں خود آپ کے پاس جو کی روٹی اور باسی چربی لے کر حاضر ہوا تھا ۔ میں نے خود آپ سے سنا تھا ۔ آپ فرما رہے تھے کہ آل محمد ( صلی اللہ علیہ وسلم ) پر کوئی صبح اور کوئی شام ایسی نہیں آئی کہ ایک صاع سے زیادہ کچھ اور موجود رہا ہو ، حالانکہ آپ کے نو گھر تھے ۔</b>",
        "bookID": "48.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 124240,
        "last_updated": null
    },
    {
        "urduURN": 4024880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 48,
        "bookName": "کتاب رہن کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2509,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے عبدالواحد بن زیاد نے بیان کیا ، انہوں نے کہا کہ ہم سے اعمش نے بیان کیا کہ",
        "hadithText": "ہم نے ابراہیم نخعی رحمہ اللہ کے یہاں قرض میں رہن اور ضامن کا ذکر کیا تو انہوں نے کہا کہ ہم سے اسود نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ایک یہودی سے غلہ خریدا ایک مقررہ مدت کے قرض پر اور اپنی زرہ اس کے ہاں گروی رکھی تھی ۔</b>",
        "bookID": "48.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 124250,
        "last_updated": null
    },
    {
        "urduURN": 4024890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 48,
        "bookName": "کتاب رہن کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2510,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا کہ عمرو بن دینار نے بیان کیا کہ میں نے جابر بن عبداللہ رضی للہ عنہما سے سنا وہ کہہ رہے تھے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کعب بن اشرف ( یہودی اسلام کا پکا دشمن ) کا کام کون تمام کرے گا کہ اس نے اللہ اور اس کے رسول صلی اللہ علیہ وسلم کو بہت تکلیف دے رکھی ہے ۔ محمد بن مسلمہ رضی اللہ عنہ نے کہا کہ میں ( یہ خدمت انجام دوں گا ) چنانچہ وہ اس کے پاس گئے اور کہا کہ ایک یا دو وسق غلہ قرض لینے کے ارادے سے آیا ہوں ۔ کعب نے کہا لیکن تمہیں اپنی بیویوں کو میرے یہاں گروی رکھنا ہو گا ۔ محمد بن مسلمہ اور اس کے ساتھیوں نے کہا کہ ہم اپنی بیویوں کو تمہارے پاس کس طرح گروی رکھ سکتے ہیں جب کہ تم سارے عرب میں خوبصورت ہو ۔ اس نے کہا کہ پھر اپنی اولاد گروی رکھ دو ۔ انہوں نے کہا کہ ہم اپنی اولاد کس طرح رہن رکھ سکتے ہیں اسی پر انہیں گالی دی جایا کرے گی کہ ایک دو وسق غلے کے لیے رہن رکھ دیے گئے تھے تو ہمارے لیے بڑی شرم کی بات ہو گی ۔ البتہ ہم اپنے ہتھیار تمہارے یہاں رہن رکھ سکتے ہیں ۔ سفیان نے کہا کہ مراد لفظ ” لامہ “ سے ہتھیار ہیں ۔ پھر محمد بن مسلمہ رضی اللہ عنہ اس سے دوبارہ ملنے کا وعدہ کر کے ( چلے آئے اور رات کو اس کے یہاں پہنچ کر ) اسے قتل کر دیا ۔ پھر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آپ کو خبر دی ۔</b>",
        "bookID": "48.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 124260,
        "last_updated": null
    },
    {
        "urduURN": 4024900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 48,
        "bookName": "کتاب رہن کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2511,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا کہ ہم سے زکریابن ابی زائدہ نے بیان کیا ، ان سے عامر شعبی نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا گروی جانور پر اس کا خرچ نکالنے کے لیے سواری کی جائے ، دودھ والا جانور گروی ہو تو اس کا دودھ پیا جائے ۔</b>",
        "bookID": "48.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 124270,
        "last_updated": null
    },
    {
        "urduURN": 4024910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 48,
        "bookName": "کتاب رہن کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2512,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، انہیں زکریا نے خبر دی ، انہیں شعبی نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، گروی جانور پر اس کے خرچ کے بدل سواری کی جائے ۔ اسی طرح دودھ والے جانور کا جب وہ گروی ہو تو خرچ کے بدل اس کا دودھ پیا جائے اور جو کوئی سواری کرے یا دودھ پئے وہی اس کا خرچ اٹھائے ۔</b>",
        "bookID": "48.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 124280,
        "last_updated": null
    },
    {
        "urduURN": 4024920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 48,
        "bookName": "کتاب رہن کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2513,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے اعمش نے ، ان سے ابراہیم نے ، ان سے اسود نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے کچھ مدت ٹھہرا کر ایک یہودی سے غلہ خریدا اور اپنی زرہ اس کے پاس گروی رکھی ۔</b>",
        "bookID": "48.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 124290,
        "last_updated": null
    },
    {
        "urduURN": 4024930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 48,
        "bookName": "کتاب رہن کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2514,
        "hadithSanad": "ہم سے خلاد بن یحییٰ نے بیان کیا ، کہا ہم سے نافع بن عمر نے بیان کیا ، ان سے ابن ابی ملیکہ نے کہ",
        "hadithText": "میں نے عبداللہ بن عباس رضی اللہ عنہما کی خدمت میں ( دو عوتوں کے مقدمہ میں ) لکھا تو اس کے جواب میں انہوں نے تحریر فرمایا کہ نبی کریم صلی اللہ علیہ وسلم نے فیصلہ کیا تھا کہ ( اگر مدعی گواہ نہ پیش کر سکے ) تو مدعیٰ علیہ سے قسم لی جائے گی ۔</b>",
        "bookID": "48.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 124300,
        "last_updated": null
    },
    {
        "urduURN": 4024940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 48,
        "bookName": "کتاب رہن کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے منصور نے ، ان سے ابووائل نے کہ عبداللہ بن مسعود رضی اللہ عنہما نے کہا کہ",
        "hadithText": "جو شخص جان بوجھ کر اس نیت سے جھوٹی قسم کھائے کہ اس طرح دوسرے کے مال پر اپنی ملکیت جمائے تو وہ اللہ تعالیٰ سے اس حال میں ملے گا کہ اللہ تعالیٰ اس پر غضبناک ہو گا ۔ اس ارشاد کی تصدیق میں اللہ تعالیٰ نے ( سورۃ آل عمران میں ) یہ آیت نازل فرمائی ” وہ لوگ جو اللہ کے عہد اور اپنی قسموں کے ذریعہ دنیا کی تھوڑی پونجی خریدتی ہیں “ آخر آیت تک انہوں نے تلاوت کی ۔ ابووائل نے کہا اس کے بعد اشعث بن قیس رضی اللہ عنہ ہمارے گھر تشریف لائے اور پوچھا کہ ابوعبدالرحمن ( ابومسعود رضی اللہ عنہ ) نے تم سے کون سی حدیث بیان کی ہے ؟ انہوں نے کہا کہ ہم نے حدیث بالا ان کے سامنے پیش کر دی ۔ اس پر انہوں نے کہا کہ انہوں نے سچ بیان کیا ہے ۔ میرا ایک ( یہودی ) شخص سے کنویں کے معاملے میں جھگڑا ہوا تھا ۔ ہم اپناجھگڑا لے کر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم اپنے گواہ لاؤ ورنہ دوسرے فریق سے قسم لی جائے گی ۔ میں نے عرض کیا پھر یہ تو قسم کھا لے گا اور ( جھوٹ بولنے پر ) اسے کچھ پرواہ نہ ہو گی ۔ رسول کریم صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص جان بوجھ کر کسی کا مال ہڑپ کرنے کے لیے جھوٹی قسم کھائے تو اللہ تعالیٰ سے وہ اس حال میں ملے گا کہ وہ اس پر نہایت غضبناک ہو گا ۔ اللہ تعالیٰ نے اس کی تصدیق میں یہ آیت نازل کی ۔ اس کے بعد انہوں نے وہی آیت پڑھی ” جو لوگ اللہ کے عہد اوراپنی قسموں کے ذریعہ تھوڑی پونجی خریدتے ہیں “ ۔ آیت ولہم عذاب الیم تک ۔</b>",
        "bookID": "48.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 124311,
        "last_updated": null
    }
]