[
    {
        "urduURN": 4024950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2517,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، انہوں نے کہا کہ ہم سے عاصم بن محمد نے بیان کیا ، انہوں نے کہا کہ مجھ سے واقد بن محمد نے بیان کیا ، انہوں نے کہا کہ مجھ سے علی بن حسین کے ساتھی سعید بن مرجانہ نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس شخص نے بھی کسی مسلمان ( غلام ) کو آزاد کیا تو اللہ تعالیٰ اس غلام کے جسم کے ہر عضو کی آزادی کے بدلے اس شخص کے جسم کے بھی ایک ایک عضو کو دوزخ سے آزاد کرے گا ۔ سعید بن مرجانہ نے بیان کیا کہ پھر میں علی بن حسین ( زین العابدین رحمہ اللہ ) کے یہاں گیا ( اور ان سے حدیث بیان کی ) وہ اپنے ایک غلام کی طرف متوجہ ہوئے ۔ جس کی عبداللہ بن جعفر دس ہزار درہم یا ایک ہزار دینار قیمت دے رہے تھے اور آپ نے اسے آزاد کر دیا ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 124330,
        "last_updated": null
    },
    {
        "urduURN": 4024960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2518,
        "hadithSanad": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے ، ان سے ان کے والد نے ، ان سے ابو مرواح نے اور ان سے ابوذر غفاری رضی اللہ عنہ نے کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا کہ کون سا عمل افضل ہے ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ پر ایمان لانا اور اس کی راہ میں جہاد کرنا ۔ میں نے پوچھا اور کس طرح کا غلام آزاد کرنا افضل ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ، جو سب سے زیادہ قیمتی ہو اور مالک کی نظر میں جو بہت زیادہ پسندیدہ ہو ۔ میں نے عرض کیا کہ اگر مجھ سے یہ نہ ہو سکا ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ، کہ پھر کسی مسلمان کاریگر کی مدد کر یا کسی بے ہنر کی ۔ انہوں نے کہا کہ اگر میں یہ بھی نہ کر سکا ؟ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر لوگوں کو اپنے شر سے محفوظ کر دے کہ یہ بھی ایک صدقہ ہے جسے تم خود اپنے اوپر کرو گے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 124340,
        "last_updated": null
    },
    {
        "urduURN": 4024970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2519,
        "hadithSanad": "ہم سے موسیٰ بن مسعود نے بیان کیا ، انہوں نے کہا کہ ہم سے زائدۃ بن قدامہ نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے فاطمہ بن منذر نے اور ان سے اسماء بنت ابی بکر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے سورج گرہن کے وقت غلام آزاد کرنے کا حکم فرمایا ہے ۔ موسیٰ کے ساتھ اس حدیث کو علی بن مدینی نے بھی عبدالعزیز دراوردی سے روایت کیا ہے ۔ انہوں نے ہشام سے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 124350,
        "last_updated": null
    },
    {
        "urduURN": 4024980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2520,
        "hadithSanad": "ہم سے محمد بن ابی بکر نے بیان کیا ، انہوں نے کہا ہم سے عثام نے بیان کیا ، انہوں نے کہا ہم سے ہشام نے بیان کیا ، ان سے فاطمہ بن منذر نے بیان کیا اور ان سے اسماء بنت ابی بکر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ہمیں سورج گرہن کے وقت غلام آزاد کرنے کا حکم دیا جاتا تھا ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 124360,
        "last_updated": null
    },
    {
        "urduURN": 4024990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2521,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے ، ان سے سالم نے اور ان سے ان کے والد نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا دو ساجھیوں کے درمیان ساجھے کے غلام کو اگر کسی ایک ساجھی نے آزاد کیا ، تو اگر آزاد کرنے والا مالدار ہے تو باقی حصوں کی قیمت کا اندازہ کیا جائے گا ۔ پھر ( اسی کی طرف سے ) پورے غلام کو آزاد کر دیا جائے گا ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 124370,
        "last_updated": null
    },
    {
        "urduURN": 4025000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2522,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں نافع نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا",
        "hadithText": "جس نے کسی مشترک غلام میں اپنے حصے کو آزاد کر دیا اور اس کے پاس اتنا مال ہے کہ غلام کی پوری قیمت ادا ہو سکے تو اس کی قیمت انصاف کے ساتھ لگائی جائے گی اور باقی ساجھیوں کو ان کے حصے کی قیمت ( اسی کے مال سے ) دے کر غلام کو اسی کی طرف سے آزاد کر دیا جائے گا ۔ ورنہ غلام کا جو حصہ آزاد ہو چکا وہ ہو چکا ۔ باقی حصوں کی آزادی کے لیے غلام کو خودکوشش کر کے قیمت ادا کرنی ہو گی ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 124380,
        "last_updated": null
    },
    {
        "urduURN": 4025010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2523,
        "hadithSanad": "ہم سے عبیدبن اسماعیل نے بیان کیا ، ان سے ابواسامہ نے بیان کیا ، ان سے عبیداللہ نے ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس نے کسی مشترک غلام کے اپنے حصے کو آزاد کیا اور اس کے پاس غلام کی پوری قیمت ادا کرنے کے لیے مال بھی ہے تو پورا غلام اسے آزاد کرانا لازم ہے لیکن اگر اس کے پاس اتنا مال نہ ہو جس سے پورے غلام کی صحیح قیمت ادا کی جا سکے ۔ تو پھر غلام کا جو حصہ آزاد ہو گیا وہی آزاد ہوا ۔ ہم سے مسدد نے بیان کیا ، ان سے بشر نے بیان کیا اور ان سے عبیداللہ نے اختصار کے ساتھ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 0,
        "last_updated": null
    },
    {
        "urduURN": 4025020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2524,
        "hadithSanad": "ہم سے ابوالنعمان نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے کسی ( ساجھے ) غلام کا اپنا حصہ آزاد کر دیا ۔ یا ( آپ صلی اللہ علیہ وسلم نے ) یہ الفاظ فرمائے شرکا لہ فی عبد ( شک راوی حدیث ایوب سختیانی کو ہوا ) اور اس کے پاس اتنا مال بھی تھا جس سے پورے غلام کی مناسب قیمت ادا کی جا سکتی تھی تو وہ غلام پوری طرح آزاد سمجھا جائے گا ۔ ( باقی حصوں کی قیمت اس کو دینی ہو گی ) نافع نے بیان کیا ورنہ اس کا جو حصہ آزاد ہو گیا بس وہ آزاد ہو گیا ۔ ایوب نے کہا کہ مجھے معلوم نہیں یہ ( آخری ٹکڑا ) خود نافع نے اپنی طرف سے کہا تھا یا یہ بھی حدیث میں شامل ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 124410,
        "last_updated": null
    },
    {
        "urduURN": 4025030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2525,
        "hadithSanad": "ہم سے احمد بن مقدام نے بیان کیا ، انہوں نے کہا ہم سے فضیل بن سلیمان نے بیان کیا ، انہوں نے کہا ہم سے موسیٰ بن عقبہ نے بیان کیا ، انہوں نے کہا مجھ کو نافع نے خبر دی کہ",
        "hadithText": "عبداللہ بن عمر رضی اللہ عنہما غلام یا باندی کے بارے میں یہ فتویٰ دیا کرتے تھے کہ اگر وہ کئی ساجھیوں کے درمیان مشترک ہو اور ایک شریک اپنا حصہ آزاد کر دے تو ابن عمر رضی اللہ عنہما فرماتے تھے کہ اس شخص پر پورے غلام کے آزاد کرانے کی ذمہ داری ہو گی لیکن یہ اس صورت میں جب شخص مذکور کے پاس اتنا مال ہو جس سے پورے غلام کی قیمت ادا کی جا سکے ۔ غلام کی مناسب قیمت لگا کر دوسرے ساجھیوں کو ان کے حصوں کے مطابق ادائیگی کر دی جائے گی اور غلام کو آزاد کر دیا جائے گا ۔ ابن عمر رضی اللہ عنہما یہ فتویٰ نبی کریم صلی اللہ علیہ وسلم سے نقل کرتے تھے اور لیث بن ابی ذئب ، ابن اسحاق ، جویریہ ، یحییٰ بن سعید اور اسماعیل بن امیہ بھی نافع سے اس حدیث کو روایت کرتے ہیں ، وہ عبداللہ بن عمر رضی اللہ عنہما سے اور وہ نبی کریم صلی اللہ علیہ وسلم سے مختصر طور پر ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 124420,
        "last_updated": null
    },
    {
        "urduURN": 4025040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2526,
        "hadithSanad": "ہم سے احمد بن ابی رجاء نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ بن آدم نے بیان کیا ، کہا ہم سے جریر بن حازم نے بیان کیا ، کہا میں نے قتادہ سے سنا ، کہا کہ مجھ سے نضر بن انس بن مالک نے بیان کیا ، ان سے بشیر بن نہیک نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جس نے کسی غلام کا ایک حصہ آزاد کیا ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 124430,
        "last_updated": null
    },
    {
        "urduURN": 4025050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2527,
        "hadithSanad": "دوسری سند ) ہم سے مسدد نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، ان سے سعید بن ابی عروبہ نے ، ان سے قتادہ نے ان سے نضر بن انس نے ، ان سے بشیر بن نہیک نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے کسی ساجھے کے غلام کا اپنا حصہ آزاد کیا تو اس کی پوری آزادی اسی کے ذمہ ہے ۔ بشرطیکہ اس کے پاس مال ہو ۔ ورنہ غلام کی قیمت لگائی جائے گی اور ( اس سے اپنے بقیہ حصوں کی قیمت ادا کرنے کی ) کوشش کے لیے کہا جائے گا ۔ لیکن اس پر کوئی سختی نہ کی جائے گی ۔ سعید کے ساتھ اس حدیث کو حجاج بن حجاج اور ابان اورموسیٰ بن خلف نے بھی قتادہ سے روایت کیا ۔ شعبہ نے اسے مختصر کر دیا ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 124440,
        "last_updated": null
    },
    {
        "urduURN": 4025060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2528,
        "hadithSanad": "ہم سے حمیدی نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، کہا ہم سے مسعر نے بیان کیا ، ان سے قتادہ نے ، ان سے زرارہ بن اوفی نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ نے میری امت کے دلوں میں پیدا ہونے والے وسوسوں کو معاف کر دیا ہے جب تک وہ انہیں عمل یا زبان پر نہ لائیں ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 124450,
        "last_updated": null
    },
    {
        "urduURN": 4025070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2529,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ، انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ بن سعید نے بیان کیا ، ان سے محمد بن ابراہیم تیمی نے ، ان سے علقمہ بن وقاص لیثی نے ، کہا کہ میں نے عمر بن خطاب رضی اللہ عنہ سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اعمال کا مدار نیت پر ہے اور ہر شخص کو اس کی نیت کے مطابق پھل ملتا ہے ۔ پس جس کی ہجرت اللہ اور اس کے رسول کے لیے ہو ، وہ اللہ اور اس کے رسول کے لیے سمجھی جائے گی اور جس کی ہجرت دنیا کے لیے ہو گی یا کسی عورت سے شادی کرنے کے لیے تو یہ ہجرت محض اسی کے لیے ہو گی جس کی نیت سے اس نے ہجرت کی ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 124460,
        "last_updated": null
    },
    {
        "urduURN": 4025080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2530,
        "hadithSanad": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا ، ان سے محمد بن بشر نے ، ان سے اسماعیل نے ، ان سے قیس نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "جب وہ اسلام قبول کرنے کے ارادے سے ( مدینہ کے لیے ) نکلے تو ان کے ساتھ ان کا غلام بھی تھا ۔ ( راستے میں ) وہ دونوں ایک دوسرے سے بچھڑ گئے ۔ پھر جب ابوہریرہ رضی اللہ عنہ ( مدینہ پہنچنے کے بعد ) حضور اکرم صلی اللہ علیہ وسلم کی خدمت میں بیٹھے ہوئے تھے تو ان کا غلام بھی اچانک آ گیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، ابوہریرہ ! یہ لو تمہارا غلام بھی آ گیا ۔ ابوہریرہ رضی اللہ عنہ نے کہا ، حضور ! میں آپ کو گواہ بناتا ہوں کہ یہ غلام اب آزاد ہے ۔ راوی نے کہا کہ ابوہریرہ رضی اللہ عنہ نے مدینہ پہنچ کر یہ شعر کہے تھے ۔ ہے پیاری گو کٹھن ہے اور لمبی میری رات ، پر دلائی اس نے دالکفر سے میری نجات ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 124470,
        "last_updated": null
    },
    {
        "urduURN": 4025090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2531,
        "hadithSanad": "ہم سے عبیداللہ بن سعید نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، کہا ہم سے اسماعیل نے بیان کیا ، ان سے قیس نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "جب میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تھا تو آتے ہوئے راستے میں یہ شعرکہا تھا : ہے پیاری گو کٹھن ہے اور لمبی میری رات پر دلائی اس نے دارالکفر سے مجھ کو نجات انہوں نے بیان کیا کہ راستے میں میرا غلام مجھ سے بچھڑ گیا تھا ۔ پھر جب میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو اسلام پر قائم رہنے کے لیے میں نے آپ صلی اللہ علیہ وسلم سے بیعت کر لی ۔ میں ابھی آپ کے پاس بیٹھا ہی ہوا تھا کہ وہ غلام دکھائی دیا ۔ رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، ابوہریرہ ! یہ دیکھ تیرا غلام بھی آ گیا ۔ میں نے کہا ، حضور وہ اللہ کے لیے آزاد ہے ۔ پھر میں نے اسے آزاد کر دیا ۔ امام بخاری فرماتے ہیں کہ ابو کریب نے ( اپنی روایت میں ) ابواسامہ سے یہ لفظ نہیں روایت کیا کہ وہ آزاد ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 124480,
        "last_updated": null
    },
    {
        "urduURN": 4025100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2532,
        "hadithSanad": "ہم سے شہاب بن عباد نے بیان کیا ، کہا ہم سے ابراہیم بن حمید نے بیان کیا ، ان سے اسماعیل نے ، ان سے قیس نے کہ",
        "hadithText": "جب ابوہریرہ رضی اللہ عنہ آ رہے تھے تو ان کے ساتھ ان کا غلام بھی تھا ، آپ اسلام کے ارادے سے آ رہے تھے ۔ اچانک راستے میں وہ غلام بھول کر الگ ہو گیا ( پھر یہی حدیث بیان کی ) اس میں یوں ہے اور ابوہریرہ رضی اللہ عنہ نے کہا تھا ، میں آپ صلی اللہ علیہ وسلم کو گواہ بناتا ہوں کہ وہ اللہ کے لیے ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 124490,
        "last_updated": null
    },
    {
        "urduURN": 4025110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2533,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، ان سے عروہ بن زبیر نے بیان کیا کہ",
        "hadithText": "عائشہ رضی اللہ عنہا نے فرمایا عتبہ بن ابی وقاص نے اپنے بھائی سعد بن ابی وقاص رضی اللہ عنہ کو وصیت کی تھی کہ زمعہ کی باندی کے بچے کو اپنے قبضے میں لے لیں ۔ اس نے کہا تھا کہ وہ لڑکا میرا ہے ۔ پھر جب فتح مکہ کے موقع پر رسول کریم صلی اللہ علیہ وسلم ( مکہ ) تشریف لائے ، تو سعد رضی اللہ عنہ نے زمعہ کی باندی کے لڑکے کو لے لیا اوررسول کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے ، عبد بن زمعہ بھی ساتھ تھے ۔ سعد رضی اللہ عنہ نے عرض کیا ، یا رسول اللہ ! یہ میرے بھائی کا لڑکا ہے ، انہوں نے مجھے وصیت کی تھی کہ یہ انہیں کا لڑکا ہے ۔ لیکن عبد بن زمعہ نے عرض کیا یا رسول اللہ ! یہ میرا بھائی ہے ۔ جو زمعہ ( میرے والد ) کی باندی کا لڑکا ہے ۔ انہیں کے ” فراش “ پر پیدا ہوا ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے زمعہ کی باندی کے لڑکے کو دیکھا تو واقعی وہ عتبہ کی صورت پر تھا ۔ لیکن آپ صلی اللہ علیہ وسلم نے فرمایا ، اے عبد بن زمعہ ! یہ تمہاری پرورش میں رہے گا ۔ کیونکہ بچہ تمہارے والد ہی کے ” فرش “ پر پیدا ہوا ہے ۔ آپ نے ساتھ ہی یہ بھی فرما دیا کہ ” اے سودہ بن زمعہ ! ( رضی اللہ عنہا ام المؤمنین ) اس سے پردہ کیا کر “ یہ ہدایت آپ نے اس لیے کی تھی کہ بچے میں عتبہ کی شباہت دیکھ لی تھی ۔ سودہ رضی اللہ عنہا آنحضرت صلی اللہ علیہ وسلم کی بیوی تھیں ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 124500,
        "last_updated": null
    },
    {
        "urduURN": 4025120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2534,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عمرو بن دینار نے بیان کیا ، انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا ، انہوں نے کہا کہ",
        "hadithText": "ہم میں سے ایک شخص نے اپنی موت کے بعد اپنے غلام کی آزادی کے لیے کہا تھا ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے اس غلام کو بلایا اور اسے بیچ دیا ۔ جابر رضی اللہ عنہ نے بیان کیا کہ پھر وہ غلام اپنی آزادی کے پہلے ہی سال مرگیا تھا ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 124510,
        "last_updated": null
    },
    {
        "urduURN": 4025130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2535,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، انہوں نے کہا مجھے عبداللہ بن دینار نے خبر دی ، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا ، آپ بیان کیا کرتے تھے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ولاء کے بیچنے اور اس کے ہبہ کرنے سے منع فرمایا تھا ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 124520,
        "last_updated": null
    },
    {
        "urduURN": 4025140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2536,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے جریرنے بیان کیا ، ان سے منصور نے ، ان سے ابراہیم نے ، ان سے اسود نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "بریرہ رضی اللہ عنہا کو میں نے خریدا تو ان کے مالکوں نے ولاء کی شرط لگائی ( کہ آزادی کے بعد وہ انہیں کے حق میں قائم رہے گی ) میں نے رسول کریم صلی اللہ علیہ وسلم سے اس کا ذکر کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا تم انہیں آزاد کر دو ، ولاء تو اسی کی ہوتی ہے جو قیمت دے کر کسی غلام کو آزاد کر دے ۔ پھر میں نے انہیں آزاد کر دیا ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے بریرہ رضی اللہ عنہا کو بلایا اور ان کے شوہر کے سلسلے میں انہیں اختیار دیا ۔ بریرہ نے کہا کہ اگر وہ مجھے فلاں فلاں چیز بھی دیں تب بھی میں اس کے پاس نہ رہوں گی ۔ چنانچہ وہ اپنے شوہر سے جدا ہو گئیں ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 124530,
        "last_updated": null
    },
    {
        "urduURN": 4025150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2537,
        "hadithSanad": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، کہا ہم سے اسماعیل بن ابراہیم بن عقبہ نے بیان کیا ، ان سے موسیٰ نے ، ان سے ابن شہاب نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "انصار کے بعض لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے ملاقات کی اور اجازت چاہی اور آ کر عرض کیا کہ آپ ہمیں اس کی اجازت دے دیجئیے کہ ہم اپنے بھانجے عباس کا فد یہ معاف کر دیں آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ایک درہم بھی نہ چھوڑو ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 124540,
        "last_updated": null
    },
    {
        "urduURN": 4025160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2538,
        "hadithSanad": "ہم سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام نے ، انہیں ان کے والد نے خبر دی کہ",
        "hadithText": "حکیم بن حزام رضی اللہ عنہ نے اپنے کفر کے زمانے میں سو غلام آزاد کیے تھے اور سو اونٹ لوگوں کی سواری کے لیے دیے تھے ۔ پھر جب اسلام لائے تو سو اونٹ لوگوں کی سواری کے لیے دیے اور سو غلام آزاد کیے ۔ پھر انہوں نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا ، یا رسول اللہ ! بعض ان نیک اعمال کے متعلق آپ کا کیا خیال ہے جنہیں میں بہ نیت ثواب کفر کے زمانہ میں کیا کرتا تھا ( ہشام بن عروہ نے کہا کہ اتحنث بہا کے معنی تبرربہا کے ہیں ) انہوں نے کہا کہ رسول کریم صلی اللہ علیہ وسلم نے اس پر فرمایا ” جو نیکیاں تم پہلے کر چکے ہو وہ سب قائم رہیں گی “ ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 124550,
        "last_updated": null
    },
    {
        "urduURN": 4025170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابن ابی مریم نے بیان کیا ، کہا کہ مجھے لیث نے خبر دی ، انہیں عقیل نے ، انہیں ابن شہاب نے کہ عروہ نے ذکر کیا کہ مروان اور مسور بن مخرمہ نے انہیں خبر دی کہ",
        "hadithText": "جب ہوازن قبیلہ کی بھیجے ہوئے لوگ ( مسلمان ہو کر ) آنحضرت صلی اللہ علیہ وسلم کے پاس آئے ۔ آپ صلی اللہ علیہ وسلم نے کھڑے ہو کر ان سے ملاقات فرمائی ، پھر ان لوگوں نے آپ صلی اللہ علیہ وسلم کے سامنے درخواست کی کہ ان کے اموال اور قیدی واپس کر دیے جائیں ۔ آپ صلی اللہ علیہ وسلم کھڑے ہوئے ( خطبہ سنایا ) آپ صلی اللہ علیہ وسلم نے فرمایا تم دیکھتے ہو میرے ساتھ جو لوگ ہیں ( میں اکیلا ہوتا تو تم کو واپس کر دیتا ) اور بات وہی مجھے پسند ہے جو سچ ہو ۔ اس لیے دو چیزوں میں سے ایک ہی تمہیں اختیار کرنی ہو گی ، یا اپنا مال واپس لے لو ، یا اپنے قیدیوں کو چھڑا لو ، اسی لیے میں نے ان کی تقسیم میں بھی دیر کی تھی ۔ نبی کریم صلی اللہ علیہ وسلم نے طائف سے لوٹتے ہوئے ( جعرانہ میں ) ہوازن والوں کا وہاں پر کئی راتوں تک انتظار کیا تھا ۔ جب ان لوگوں پر یہ بات پوری طرح ظاہر ہو گئی کہ نبی کریم صلی اللہ علیہ وسلم دوچیزوں ( مال اور قیدی ) میں سے صرف ایک ہی کو واپس فرما سکتے ہیں ۔ تو انہوں نے کہا کہ ہمیں ہمارے آدمی ہی واپس کر دیجئیے جو آپ کی قید میں ہیں ۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم نے لوگوں سے خطاب فرمایا ، اللہ کی تعریف اس کی شان کے مطابق کرنے کے بعد فرمایا ، امابعد ! یہ تمہارے بھائی ہمارے پاس نادم ہو کر آئے ہیں اور میرا بھی خیال یہ ہے کہ ان کے آدمی جو ہماری قید میں ہیں ، انہیں واپس کر دیے جائیں ۔ اب جو شخص اپنی خوشی سے ان کے آدمیوں کو واپس کرے وہ ایسا کر لے اور جو شخص اپنے حصے کو چھوڑنا نہ چاہے ( اور اس شرط پر اپنے قیدیوں کو آزاد کرنے کے لیے تیار ہو کہ ان قیدیوں کے بدلے میں ) ہم اسے اس کے بعد سب سے پہلی مال غنیمت میں سے جو اللہ تعالیٰ ہمیں دے گا اس کے ( اس ) حصے کا بدلہ اس کے حوالہ کر دیں گے تو وہ ایسا کر لے ۔ لوگ اس پر بول پڑے کہ ہم اپنی خوشی سے قیدی کو واپس کرنے کے لیے تیار ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا ، لیکن ہم پر یہ ظاہر نہ ہو سکا کہ کس نے ہمیں اجازت دی ہے اور کس نے نہیں دی ہے ۔ اس لیے سب لوگ ( اپنے خیموں میں ) واپس جائیں اور سب کے ذمہ دار آ کر ان کی رائے سے ہمیں آگاہ کریں ۔ چنانچہ سب لوگ چلے آئے اور ان کے سرداروں نے ( ان سے گفتگو کی ) پھر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر آپ کو خبر دی کہ سب نے اپنی خوشی سے اجازت دے دی ہے ۔ یہی وہ خبر ہے جو ہمیں ہوازن کے قیدیوں کے سلسلے میں معلوم ہوئی ہے ۔ ( زہری نے کہا ) اور انس رضی اللہ عنہ نے بیان کیا کہ عباس رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے ( جب بحرین سے مال آیا ) کہا تھا کہ ( بدر کے موقع پر ) میں نے اپنا بھی فد یہ دیا تھا اور عقیل رضی اللہ عنہ کا بھی ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 124560,
        "last_updated": null
    },
    {
        "urduURN": 4025180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2541,
        "hadithSanad": "ہم سے علی بن حسن نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو ابن عون نے خبر دی ، انہوں نے بیان کیا کہ میں نے نافع رحمہ اللہ کو لکھا تو انہوں نے مجھے جواب دیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے بنو المصطلق پر جب حملہ کیا تو وہ بالکل غافل تھے اور ان کے مویشی پانی پی رہے تھے ۔ ان کے لڑنے والوں کو قتل کیا گیا ، عورتوں بچوں کو قید کر لیا گیا ۔ انہیں قیدیوں میں جویر یہ رضی اللہ عنہا ( ام المؤمنین ) بھی تھیں ۔ ( نافع رحمہ اللہ نے لکھا تھا کہ ) یہ حدیث مجھ سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کی تھی ، وہ خود بھی اسلامی فوج کے ہمراہ تھے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 124570,
        "last_updated": null
    },
    {
        "urduURN": 4025190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2542,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں ربیعہ بن ابی عبدالرحمٰن نے ، انہیں محمد بن یحییٰ بن حبان نے ، ان سے ابن محیریز نے کہ",
        "hadithText": "میں نے ابوسعید رضی اللہ عنہ کو دیکھا تو ان سے ایک سوال کیا ، آپ نے جواب میں کہا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ غزوہ بنی مصطلق کے لیے نکلے ۔ اس غزوے میں ہمیں ( قبیلہ بنی مصطلق کے ) عرب قیدی ہاتھ آئے ( راستے ہی میں ) ہمیں عورتوں کی خواہش ہوئی اور عورت سے الگ رہنا ہم کو مشکل ہو گیا ۔ ہم نے چاہا کہ عزل کر لیں ۔ جب رسول اللہ صلی اللہ علیہ وسلم سے اس بارے میں پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا ، تم عزل کر سکتے ہو ، اس میں کوئی قباحت نہیں لیکن جن روحوں کی بھی قیامت تک کے لیے پیدائش مقدر ہو چکی ہے وہ تو ضرور پیدا ہو کر رہیں گی ( لہٰذا تمہارا عزل کرنا بیکار ہے )</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 124580,
        "last_updated": null
    },
    {
        "urduURN": 4025200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2543,
        "hadithSanad": "ہم سے زہیر بن حرب نے بیان کیا ، کہا کہ ہم سے جریر بن عبدالحمید نے بیان کیا ، ان سے عمارہ بن قعقاع ، ان سے ابوزرعہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہا کہ",
        "hadithText": "میں بنوتمیم سے ہمیشہ محبت کرتا رہا ہوں ( دوسری سند امام بخاری رحمہ اللہ نے کہا ) مجھ سے ابن سلام نے بیان کیا ، کہا ہم کو جریر بن عبدالحمید نے خبر دی ، انہیں مغیرہ نے ، انہیں حارث نے ، انہیں ابوزرعہ نے اور انہیں ابوہریرہ رضی اللہ عنہ نے ، ( تیسری سند ) اور مغیرہ نے عمارہ سے روایت کی ، انہوں نے ابوزرعہ سے کہ ابوہریرہ رضی اللہ عنہ نے فرمایا ، تین باتوں کی وجہ سے جنہیں میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے ۔ میں بنو تمیم سے ہمیشہ محبت کرتا ہوں ۔ رسول کریم صلی اللہ علیہ وسلم نے ان کے بارے میں فرمایا کہ یہ لوگ دجال کے مقابلے میں میری امت میں سب سے زیادہ سخت مخالف ثابت ہوں گے ۔ انہوں نے بیان کیا کہ ( ایک مرتبہ ) بنوتمیم کے یہاں سے زکوٰۃ ( وصول ہو کر آئی ) تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا یہ ہماری قوم کی زکوٰۃ ہے ۔ بنوتمیم کی ایک عورت قید ہو کر حضرت عائشہ رضی اللہ عنہا کے پاس تھی تو آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ اسے آزاد کر دے کہ یہ حضرت اسماعیل علیہ السلام کی اولاد میں سے ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 124590,
        "last_updated": null
    },
    {
        "urduURN": 4025210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2544,
        "hadithSanad": "ہم سے اسحاق بن ابراہیم نے بیان کیا ، انہوں نے محمد بن فضیل سے سنا ، انہوں نے مطرف سے ، انہوں نے شعبی سے ، انہوں نے ابوبردہ سے ، انہوں نے حضرت ابوموسیٰ رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جس شخص کے پاس کوئی لونڈی ہو اور وہ اس کی اچھی پرورش کرے اور اس کے ساتھ اچھا معاملہ کرے ، پھر اسے آزاد کر کے اس سے نکاح کر لے تو اس کو دوہرا ثواب ملے گا ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 124600,
        "last_updated": null
    },
    {
        "urduURN": 4025220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2545,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ہم سے واصل بن حیان نے جو کبڑے تھے ، بیان کیا ، کہا کہ میں نے معرور بن سوید سے سنا ، انہوں نے کہا کہ",
        "hadithText": "میں نے ابوذر غفاری رضی اللہ عنہ کو دیکھا کہ ان کے بدن پر بھی ایک جوڑا تھا اور ان کے غلام کے بدن پر بھی اسی قسم کا ایک جوڑا تھا ۔ ہم نے اس کا سبب پوچھا تو انہوں نے بتلایا کہ ایک دفعہ میری ایک صاحب ( یعنی بلال رضی اللہ عنہ سے ) سے کچھ گالی گلوچ ہو گئی تھی ۔ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے میری شکایت کی ، آپ صلی اللہ علیہ وسلم نے مجھ سے پوچھا کہ کیا تم نے انہیں ان کی ماں کی طرف سے عار دلائی ہے ؟ پھر آپ صلی اللہ علیہ وسلم نے فرمایا ، تمہارے غلام بھی تمہارے بھائی ہیں اگرچہ اللہ تعالیٰ نے انہیں تمہاری ماتحتی میں دے رکھا ہے ۔ اس لیے جس کا بھی کوئی بھائی اس کے قبضہ میں ہو اسے وہی کھلائے جو وہ خود کھاتا ہے اور وہی پہنائے جو وہ خود پہنتا ہے اور ان پر ان کی طاقت سے زیادہ بوجھ نہ ڈالے ۔ لیکن اگر ان کی طاقت سے زیادہ بوجھ ڈالو تو پھر ان کی خود مدد بھی کر دیا کرو ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 124610,
        "last_updated": null
    },
    {
        "urduURN": 4025230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2546,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، انہوں نے امام مالک سے ، انہوں نے نافع سے ، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، غلام جو اپنے آقا کا خیرخواہ بھی ہو اور اپنے رب کی عبادت بھی اچھی طرح کرتا ہو تو اسے دو گنا ثواب ملتا ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 124620,
        "last_updated": null
    },
    {
        "urduURN": 4025240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2547,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو سفیان ثوری نے خبر دی صالح سے ، انہوں نے شعبی سے ، انہوں نے ابوبردہ سے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا جس کسی کے پاس بھی کوئی باندی ہو اور وہ اسے پورے حسن و خوبی کے ساتھ ادب سکھائے ، پھر آزاد کر کے اس سے شادی کر لے تو اسے دوگنا ثواب ملتا ہے اور جو غلام اللہ تعالیٰ کے حقوق بھی ادا کرے اور اپنے آقاؤں کے بھی تو اسے بھی دوگنا ثواب ملتا ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 124630,
        "last_updated": null
    },
    {
        "urduURN": 4025250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2548,
        "hadithSanad": "ہم سے بشر بن محمد نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو یونس نے خبر دی ، انہوں نے زہری سے سنا ، انہوں نے کہا کہ میں نے سعید بن مسیب سے سنا ، انہوں نے کہا کہ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا غلام جو کسی کی ملکیت میں ہو اور نیکوکار ہو تو اسے دو ثواب ملتے ہیں اور حضرت ابوہریرۃ رضی اللہ عنہ نے کہا ، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے اگر اللہ تعالیٰ کے راستے میں جہاد ، حج اور والدہ کی خدمت ( کی روک ) نہ ہوتی تو میں پسند کرتاکہ غلام رہ کر مروں ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 124640,
        "last_updated": null
    },
    {
        "urduURN": 4025260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2549,
        "hadithSanad": "ہم سے اسحاق بن نصر نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، انہوں نے اعمش سے ، ان سے ابوصالح نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کتنا اچھا ہے کسی کا وہ غلام جو اپنے رب کی عبادت تمام حسن و خوبی کے ساتھ بجا لائے اور اپنے مالک کی خیرخواہی بھی کرتا رہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 124650,
        "last_updated": null
    },
    {
        "urduURN": 4025270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2550,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے یحییٰ قطان نے بیان کیا ، ان سے عبیداللہ نے ، ان سے نافع نے کہا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ جب غلام اپنے آقا کی خیرخواہی کرے اور اپنے رب کی عبادت تمام حسن و خوبی کے ساتھ بجا لائے تو اسے دوگنا ثواب ملتا ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 124660,
        "last_updated": null
    },
    {
        "urduURN": 4025280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2551,
        "hadithSanad": "ہم سے محمد بن علاء نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، انہوں نے برید بن عبداللہ سے ، وہ ابوبردہ سے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ غلام جو اپنے رب کی عبادت احسن طریق کے ساتھ بجا لائے اور اپنے آقا کے جو اس پر خیرخواہی اور فرماں برداری ( کے حقوق ہیں ) انہیں بھی ادا کرتا رہے ، تو اسے دوگنا ثواب ملتا ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 124670,
        "last_updated": null
    },
    {
        "urduURN": 4025290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2552,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں ہمام بن منبہ نے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، وہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا ۔ کوئی شخص ( کسی غلام یا کسی بھی شخص سے ) یہ نہ کہے ” اپنے رب ( مراد آقا ) کو کھانا کھلا ، اپنے رب کو وضوکرا ، اپنے رب کو پانی پلا “ ۔ بلکہ صرف میرے سردار ، میرے آقا کے الفاظ کہنا چاہئے ۔ اسی طرح کوئی شخص یہ نہ کہے ۔ ” میرا بندہ ، میری بندی ، بلکہ یوں کہنا چاہئے میرا چھوکرا ، میری چھوکری ، میرا غلام ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 124680,
        "last_updated": null
    },
    {
        "urduURN": 4025300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2553,
        "hadithSanad": "ہم سے ابوالنعمان نے بیان کیا ، انہوں نے کہا ہم سے جریر بن حازم نے بیان کیا ، انہوں نے نافع سے ، وہ حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت کرتے ہیں کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جس نے غلام کا اپنا حصہ آزاد کر دیا ، اور اس کے پاس اتنا مال بھی ہو جس سے غلام کی واجبی قیمت ادا کی جا سکے تو اسی کے مال سے پورا غلام آزاد کیا جائے گا ورنہ جتنا آزاد ہو گیا ہو گیا ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 124690,
        "last_updated": null
    },
    {
        "urduURN": 4025310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2554,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ قطان نے بیان کیا ، ان سے عبیداللہ عمری نے بیان کیا کہ مجھ سے نافع نے بیان کیا ، حضرت عبداللہ بن عمر رضی اللہ عنہما سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تم میں سے ہر شخص حاکم ہے اور اس کی رعایا کے بارے میں سوال ہو گا ۔ پس لوگوں کا واقعی امیر ایک حاکم ہے اور اس سے اس کی رعایا کے بارے میں سوال ہو گا ۔ اور ہر آدمی اپنے گھر والوں پر حاکم ہے اور اس سے اس کی رعایا کے بارے میں سوال ہو گا ۔ اور عورت اپنے شوہر کے گھر اور اس کے بچوں پر حاکم ہے اس سے اس کی رعایا کے بارے میں سوال ہو گا ۔ اور غلام اپنے آقا ( سید ) کے مال کا حاکم ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا ۔ پس جان لو کہ تم میں سے ہر ایک حاکم ہے اور ہر ایک سے اس کی رعیت کے بارے میں ( قیامت کے دن ) پوچھ ہو گی ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 124700,
        "last_updated": null
    },
    {
        "urduURN": 4025320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا زہری سے ، ان سے عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے بیان کیا ، کہا میں نے ابوہریرہ اور زید بن خالد رضی اللہ عنہما سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ جب باندی زنا کرائے تو اسے ( بطور حد شرعی ) کوڑے لگاؤ پھر اگر کرئے تو اسے کوڑے لگاؤ تیسری یا چوتھی بار میں ( آپ صلی اللہ علیہ وسلم نے فرمایا کہ ) پھر اسے بیچ دو ، خواہ قیمت میں ایک رسی ہی ملے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 124710,
        "last_updated": null
    },
    {
        "urduURN": 4025330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2557,
        "hadithSanad": "ہم سے حجاج بن منہال نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا مجھے محمد بن زیاد نے خبر دی ، انہوں نے کہا کہ",
        "hadithText": "میں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ جب کسی کا غلام کھانا لائے اور وہ اسے اپنے ساتھ ( کھلانے کے لیے ) نہ بٹھا سکے تو اسے ایک یا دو نوالے ضرور کھلا دے یا آپ صلی اللہ علیہ وسلم نے لقمۃ او لقمتین کے بدل اکلۃ او اکلتین فرمایا ( یعنی ایک یا دو لقمے ) کیونکہ اسی نے اس کو تیار کرنے کی تکلیف اٹھائی ہے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 124720,
        "last_updated": null
    },
    {
        "urduURN": 4025340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2558,
        "hadithSanad": "سے ابوالیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا کہ مجھے سالم بن عبداللہ بن عمر نے خبر دی اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "انہوں نے رسول کریم صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہر آدمی حاکم ہے اور اس سے اس کی رعایا کے بارے میں سوال ہو گا ۔ امام حاکم ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا ۔ مرد اپنے گھر کے معاملات کا افسر ہے اور اس سے اس کی رعایا کے بارے میں سوال ہو گا ۔ عورت اپنے شوہر کے گھر کی افسر ہے اور اس سے اس کی رعایا کے بارے میں سوال ہو گا ۔ خادم اپنے سید کے مال کا محافظ ہے اور اس سے اس کے بارے میں سوال ہو گا ۔ انہوں نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے یہ باتیں سنی ہیں اور مجھے خیال ہے کہ آپ صلی اللہ علیہ وسلم نے یہ بھی فرمایا تھا کہ مرد اپنے باپ کے مال کا محافظ ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا ۔ غرض تم میں سے ہر فرد حاکم ہے اور سب سے اس کی رعیت کے بارے میں سوال ہو گا ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 124730,
        "last_updated": null
    },
    {
        "urduURN": 4025350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 49,
        "bookName": "کتاب غلاموں کی آزادی کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2559,
        "hadithSanad": "ہم سے محمد بن عبیداللہ نے بیان کیا ، کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا ، کہا کہ مجھ سے امام مالک بن انس نے بیان کیا ، کہا کہ مجھے ابن فلاں ( ابن سمعان ) نے خبر دی ، انہیں سعید مقبری نے ، انہیں ان کے باپ نے اور انہیں ابوہریرہ رضی اللہ عنہ نے ، نبی کریم صلی اللہ علیہ وسلم سے ۔  ( دوسری سند اور امام بخاری نے کہا ) اور ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، کہا ہم کو معمر نے خبر دی ہمام سے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جب کوئی کسی سے جھگڑا کرے تو چہرے ( پر مارنے ) سے پرہیز کرے ۔</b>",
        "bookID": "49.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 124740,
        "last_updated": null
    }
]