[
    {
        "urduURN": 4025470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2567,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا ، کہا ہم سے ابن ابی حازم نے بیان کیا ، ان سے ان کے والد نے یزید بن رومان سے ، وہ عروہ سے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "آپ نے عروہ سے کہا ، میرے بھانجے ! آنحضرت صلی اللہ علیہ وسلم کے عہد مبارک میں ( یہ حال تھا کہ ) ہم ایک چاند دیکھتے ، پھر دوسرا دیکھتے ، پھر تیسرا دیکھتے ، اسی طرح دو دو مہینے گزر جاتے اور رسول کریم صلی اللہ علیہ وسلم کے گھروں میں ( کھانا پکانے کے لیے ) آگ نہ جلتی تھی ۔ میں نے پوچھا خالہ اماں ! پھر آپ لوگ زندہ کس طرح رہتی تھیں ؟ آپ نے فرمایا کہ صرف دو کالی چیزوں کھجور اور پانی پر ۔ البتہ رسول اللہ صلی اللہ علیہ وسلم کے چند انصاری پڑوسی تھے ۔ جن کے پاس دودھ دینے والی بکریاں تھیں اور وہ رسول کریم صلی اللہ علیہ وسلم کے یہاں بھی ان کا دودھ تحفہ کے طور پر پہنچا جایا کرتے تھے ۔ آپ صلی اللہ علیہ وسلم اسے ہمیں بھی پلا دیا کرتے تھے ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 124820,
        "last_updated": null
    },
    {
        "urduURN": 4025480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2568,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے محمد بن ابی عدی نے بیان کیا شعبہ سے ، وہ سلیمان سے ، وہ ابوحازم سے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، اگر مجھے بازو اور پائے ( کے گوشت ) پر بھی دعوت دی جائے تو میں قبول کر لوں گا اور مجھے بازو یا پائے ( کے گوشت ) کا تحفہ بھیجا جائے تو اسے بھی قبول کر لوں گا ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 124830,
        "last_updated": null
    },
    {
        "urduURN": 4025490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2569,
        "hadithSanad": "ہم سے سعید بن ابی مریم نے بیان ، کہا ہم سے ابوغسان محمد بن مطرف نے بیان کیا ، کہا کہ مجھ سے ابوحازم سلمہ بن دینار نے بیان کیا سہل بن سعد ساعدی رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک مہاجرہ عورت کے پاس ( اپنا آدمی ) بھیجا ۔ ان کا ایک غلام بڑھئی تھا ۔ ان سے آپ نے فرمایا کہ اپنے غلام سے ہمارے لیے لکڑیوں کا ایک منبر بنانے کے لیے کہیں ۔ چنانچہ انہوں نے اپنے غلام سے کہا ۔ وہ غابہ سے جا کر جھاو کاٹ لایا اور اسی کا ایک منبر بنا دیا ۔ جب وہ منبر بنا چکے تو اس عورت نے رسول کریم صلی اللہ علیہ وسلم کی خدمت میں کہلا بھیجا کہ منبر بن کر تیار ہے ۔ آپ صلی اللہ علیہ وسلم نے کہلوایا کہ اسے میرے پاس بھجوا دیں ۔ جب لوگ اسے لائے تو آنحضرت صلی اللہ علیہ وسلم نے خود اسے اٹھایا اور جہاں تم اب دیکھ رہے ہو ۔ وہیں آپ صلی اللہ علیہ وسلم نے اسے رکھا ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 124840,
        "last_updated": null
    },
    {
        "urduURN": 4025500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2570,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے محمد بن جعفر نے بیان کیا ابوحازم سے ، وہ عبداللہ بن ابی قتادہ سلمی سے اور ان سے ان کے باپ نے بیان کیا کہ",
        "hadithText": "مکہ کے راستے میں ایک جگہ میں رسول اللہ صلی اللہ علیہ وسلم کے چند ساتھیوں کے ساتھ بیٹھا ہوا تھا ۔ رسول کریم صلی اللہ علیہ وسلم ہم سے آگے قیام فرما تھے ۔ ( حجۃ الوداع کے موقع پر ) اور لوگ تو احرام باندھے ہوئے تھے لیکن میرا احرام نہیں تھا ۔ میرے ساتھیوں نے ایک گورخر دیکھا ۔ میں اس وقت اپنی جوتی گانٹھنے میں مشغول تھا ۔ ان لوگوں نے مجھ کو کچھ خبر نہیں دی ۔ لیکن ان کی خواہش یہی تھی کہ کسی طرح میں گورخر کو دیکھ لوں ۔ چنانچہ میں نے جو نظر اٹھائی تو گورخر دکھائی دیا ۔ میں فوراً گھوڑے کے پاس گیا اور اس پر زین کس کر سوار ہو گیا ، مگر اتفاق سے ( جلدی میں ) کوڑا اور نیزہ دونوں بھول گیا ۔ اس لیے میں نے اپنے ساتھیوں سے کہا کہ وہ مجھے کوڑا اور نیزہ اٹھا دیں ۔ انہوں نے کہا ہرگز نہیں قسم اللہ کی ، ہم تمہارے ( شکار میں ) کسی قسم کی مدد نہیں کر سکتے ۔ ( کیونکہ ہم سب لوگ حالت احرام میں ہیں ) مجھے اس پر غصہ آیا اور میں نے خود ہی اتر کر دونوں چیزیں لے لیں ۔ پھر سوار ہو کر گورخر پر حملہ کیا اور اس کو شکار کر لایا ۔ وہ مر بھی چکا تھا ۔ اب لوگوں نے کہا کہ اسے کھانا چاہئے ۔ لیکن پھر احرام کی حالت میں اسے کھانے ( کے جواز ) پر شبہ ہوا ۔ ( لیکن بعض لوگوں نے شبہ نہیں کیا اور گوشت کھایا ) پھر ہم آگے بڑھے اور میں نے اس گورخر کا ایک بازو چھپا رکھا تھا ۔ جب ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس پہنچے تو اس کے متعلق آپ سے سوال کیا ، ( آپ نے محرم کے لیے شکار کے گوشت کھانے کا فتویٰ دیا ) اور دریافت فرمایا کہ اس میں سے کچھ بچا ہوا گوشت تمہارے پاس موجود بھی ہے ؟ میں نے کہا کہ جی ہاں ! اور وہی بازو آپ کی خدمت میں پیش کیا ۔ آپ نے اسے تناول فرمایا ۔ یہاں تک کہ وہ ختم ہو گیا ۔ آپ بھی اس وقت احرام سے تھے ( ابوحازم نے کہا کہ ) مجھ سے یہی حدیث زید بن اسلم نے بیان کی ، ان سے عطاء بن یسار نے اور ان سے ابوقتادہ رضی اللہ عنہ نے ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 124850,
        "last_updated": null
    },
    {
        "urduURN": 4025510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2571,
        "hadithSanad": "ہم سے خالد بن مخلد نے بیان کیا ، کہا ہم سے سلیمان بن بلال نے ، کہا کہ مجھ سے ابوطوالہ نے جن کا نام عبداللہ بن عبدالرحمٰن تھا کہ میں نے انس رضی اللہ عنہ سے سنا ، وہ کہتے تھے کہ",
        "hadithText": "( ایک مرتبہ ) رسول کریم صلی اللہ علیہ وسلم ہمارے اسی گھر میں تشریف لائے اور پانی طلب فرمایا ۔ ہمارے پاس ایک بکری تھی ، اسے ہم نے دوہا ۔ پھر میں نے اسی کنویں کا پانی ملا کر آپ کی خدمت میں ( لسی بنا کر ) پیش کیا ، حضرت ابوبکر رضی اللہ عنہ آپ صلی اللہ علیہ وسلم کی بائیں طرف بیٹھے ہوئے تھے اور حضرت عمر رضی اللہ عنہ سامنے تھے اور ایک دیہاتی آپ کے دائیں طرف تھا ۔ جب آپ صلی اللہ علیہ وسلم پی کر فارغ ہوئے تو ( پیالے میں کچھ دودھ بچ گیا تھا اس لیے ) حضرت عمر رضی اللہ عنہ نے عرض کیا کہ یہ حضرت ابوبکر رضی اللہ عنہ ہیں ۔ لیکن آپ نے اسے دیہاتی کو عطا فرمایا ۔ ( کیونکہ وہ دائیں طرف تھا ) پھر آپ صلی اللہ علیہ وسلم نے فرمایا ، دائیں طرف بیٹھنے والے ، دائیں طرف بیٹھنے والے ہی حق رکھتے ہیں ۔ پس خبردار دائیں طرف ہی سے شروع کیا کرو ۔ انس رضی اللہ عنہ نے کہا کہ یہی سنت ہے ، یہی سنت ہے ، تین مرتبہ ( آپ نے اس بات کو دہرایا ) ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 124860,
        "last_updated": null
    },
    {
        "urduURN": 4025520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2572,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ہشام بن زید بن انس بن مالک نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "مرالظہران نامی جگہ میں ہم نے ایک خرگوش کا پیچھا کیا ۔ لوگ ( اس کے پیچھے ) دوڑے اور اسے تھکا دیا اور میں نے قریب پہنچ کر اسے پکڑ لیا ۔ پھر ابوطلحہ رضی اللہ عنہ کے ہاں لایا ۔ انہوں نے اسے ذبح کیا اور اس کے پیچھے کا یا دونوں رانوں کا گوشت نبی کریم صلی اللہ علیہ وسلم کی خدمت میں بھیجا ۔ ( شعبہ نے بعد میں یقین کے ساتھ ) کہا کہ دونوں رانیں انہوں نے بھیجی تھیں ، اس میں کوئی شک نہیں ۔ حضور اکرم صلی اللہ علیہ وسلم نے اسے قبول فرمایا تھا میں نے پوچھا اور اس میں سے آپ نے کچھ تناول بھی فرمایا ؟ انہوں نے بیان کیا کہ ہاں ! کچھ تناول فرمایا تھا ۔ اس کے بعد پھر انہوں نے کہا کہ آپ نے وہ ہدیہ قبول فرما لیا تھا ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 124870,
        "last_updated": null
    },
    {
        "urduURN": 4025530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2573,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ابن شہاب سے ، وہ عبیداللہ بن عبداللہ بن عتبہ بن مسعود سے ، وہ حضرت عبداللہ بن عباس رضی اللہ عنہما سے اور اور وہ صعب بن جثامہ رضی اللہ عنہ سے کہ",
        "hadithText": "انہوں نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں گورخر کا تحفہ پیش کیا تھا ۔ آپ صلی اللہ علیہ وسلم اس وقت مقام ابواء یا مقام ودان میں تھے ( راوی کو شبہ ہے ) آپ صلی اللہ علیہ وسلم نے ان کا تحفہ واپس کر دیا ۔ پھر ان کے چہرے پر ( رنج کے آثار ) دیکھ کر فرمایا کہ میں نے یہ تحفہ صرف اس لیے واپس کیا ہے کہ ہم احرام باندھے ہوئے ہیں ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 124880,
        "last_updated": null
    },
    {
        "urduURN": 4025540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2574,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا ہم سے عبدہ بن سلیمان نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "لوگ ( رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ) تحائف بھیجنے کے لیے عائشہ رضی اللہ عنہا کی باری کا انتظار کیا کرتے تھے ۔ اپنے ہدایا سے ، یا اس خاص دن کے انتظار سے ( راوی کو شک ہے ) لوگ آنحضرت صلی اللہ علیہ وسلم کی خوشی حاصل کرنا چاہتے تھے ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 124890,
        "last_updated": null
    },
    {
        "urduURN": 4025550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2575,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے جعفر بن ایاس نے بیان کیا ، کہا کہ میں نے سعید بن جبیر سے سنا کہ ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ان کی خالہ ام حفید رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں پنیر ، گھی اور گوہ ( ساہنہ ) کے تحائف بھیجے ۔ آنحضرت صلی اللہ علیہ وسلم نے پنیر اور گھی میں سے تو تناول فرمایا لیکن گوہ پسند نہ ہونے کی وجہ سے چھوڑ دی ۔ ابن عباس رضی اللہ عنہما نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم کے ( اسی ) دسترخوان پر ( گوہ ( ساہنہ ) کو بھی کھایا گیا اور اگر وہ حرام ہوتی تو آپ صلی اللہ علیہ وسلم کے دسترخوان پر کیوں کھائی جاتی ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 124900,
        "last_updated": null
    },
    {
        "urduURN": 4025560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2576,
        "hadithSanad": "ہم سے ابراہیم بن المنذر نے بیان کیا ، انہوں نے کہا ہم سے معن بن عیسیٰ نے بیان کیا ، انہوں نے کہا کہ مجھ سے ابراہیم بن طہمان نے بیان کیا انہوں نے محمد بن زیاد سے اور وہ حضرت ابوہریرہ رضی اللہ عنہ سے روایت کرتے ہیں کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم کی خدمت میں جب کوئی کھانے کی چیز لائی جاتی تو آپ صلی اللہ علیہ وسلم دریافت فرماتے یہ تحفہ ہے یا صدقہ ؟ اگر کہا جاتا کہ صدقہ ہے تو آپ صلی اللہ علیہ وسلم اپنے اصحاب سے فرماتے کہ کھاؤ ، آپ خود نہ کھاتے اور اگر کہا جاتا کہ تحفہ ہے تو آپ صلی اللہ علیہ وسلم خود بھی ہاتھ بڑھاتے اور صحابہ کے ساتھ اسے کھاتے ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 124910,
        "last_updated": null
    },
    {
        "urduURN": 4025570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2577,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ایک مرتبہ گوشت پیش کیا گیا اور یہ بتایا گیا کہ یہ بریرہ رضی اللہ عنہا کو کسی نے بطور صدقہ کے دیا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ان کے لیے یہ صدقہ ہے اور ہمارے لیے ( جب ان کے یہاں سے پہنچا تو ) ہدیہ ہے ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 124920,
        "last_updated": null
    },
    {
        "urduURN": 4025580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2578,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا عبدالرحمٰن بن قاسم سے ، شعبہ نے کہا کہ",
        "hadithText": "میں نے یہ حدیث عبدالرحمٰن سے سنی تھی اور انہوں نے قاسم سے روایت کی ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے کہ انہوں نے بریرہ رضی اللہ عنہا کو ( آزاد کرنے کے لیے ) خریدنا چاہا ۔ لیکن ان کے مالکوں نے ولاء کی شرط اپنے لیے لگائی ۔ جب اس کا ذکر رسول کریم صلی اللہ علیہ وسلم سے ہوا تو آپ نے فرمایا ، تو انہیں خرید کر آزاد کر دے ، ولاء تو اسی کے ساتھ قائم ہوتی ہے جو آزاد کرے ۔ اور بریرہ رضی اللہ عنہا کے یہاں ( صدقہ کا ) گوشت آیا تھا تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اچھا یہ وہی ہے جو بریرہ کو صدقہ میں ملا ہے ۔ یہ ان کے لیے تو صدقہ ہے لیکن ہمارے لیے ( چونکہ ان کے گھر سے بطور ہدیہ ملا ہے ) ہدیہ ہے اور ( آزادی کے بعد بریرہ کو ) اختیار دیا گیا تھا ( کہ اگر چاہیں تو اپنے نکاح کو فسخ کر سکتی ہیں ) عبدالرحمٰن نے پوچھا بریرہ رضی اللہ عنہ کے خاوند ( حضرت مغیث رضی اللہ عنہ ) غلام تھے یا آزاد ؟ شعبہ نے بیان کیا کہ میں نے عبدالرحمٰن سے ان کے خاوند کے متعلق پوچھا تو انہوں نے کہا کہ مجھے معلوم نہیں وہ غلام تھے یا آزاد ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 124930,
        "last_updated": null
    },
    {
        "urduURN": 4025590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2579,
        "hadithSanad": "ہم سے ابوالحسن محمد بن مقاتل نے بیان کیا ، انہوں نے کہا ہم کو خالد بن عبداللہ نے خبر دی ، انہیں خالد حذاء نے حفصہ بنت سیرین سے کہ ام عطیہ رضی اللہ عنہا نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم عائشہ رضی اللہ عنہا کے یہاں تشریف لے گئے اور دریافت فرمایا ، کیا کوئی چیز ( کھانے کی ) تمہارے پاس ہے ؟ انہوں نے کہا کہ ام عطیہ رضی اللہ عنہا کے یہاں جو آپ نے صدقہ کی بکری بھیجی تھی ، اس کا گوشت انہوں نے بھیجا ہے ۔ اس کے سوا اور کچھ نہیں ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہ اپنی جگہ پہنچ چکی ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 124940,
        "last_updated": null
    },
    {
        "urduURN": 4025600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2580,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا کہ ہم سے حماد بن زید نے بیان کیا ہشام سے ، ان سے ان کے والد نے ، ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "لوگ تحائف بھیجنے کے لیے میری باری کا انتظار کیا کرتے تھے ۔ اور ام سلمہ رضی اللہ عنہا نے کہا میری سوکنیں ( امہات المؤمنین رضوان اللہ علیہن ) جمع تھیں اس وقت انہوں نے حضور اکرم صلی اللہ علیہ وسلم سے ( بطور شکایت لوگوں کی اس روش کا ) ذکر کیا ۔ تو آپ نے انہیں کوئی جواب نہیں دیا ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 124950,
        "last_updated": null
    },
    {
        "urduURN": 4025610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2581,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے میرے بھائی عبدالحمید بن ابی اویس نے ، ان سے سلیمان نے ہشام بن عروہ سے ، ان سے ان کے باپ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی ازواج کی دو گروہ میں تھیں ۔ ایک میں عائشہ ، حفصہ ، صفیہ اور سودہ رضوان اللہ علیہن اور دوسری میں ام سلمہ اور بقیہ تمام ازواج مطہرات رضوان اللہ علیہن تھیں ۔ مسلمانوں کو رسول اللہ صلی اللہ علیہ وسلم کی عائشہ رضی اللہ عنہا کے ساتھ محبت کا علم تھا اس لیے جب کسی کے پاس کوئی تحفہ ہوتا اور وہ اسے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں پیش کرنا چاہتا تو انتظار کرتا ۔ جب رسول اللہ صلی اللہ علیہ وسلم کی عائشہ رضی اللہ عنہا کے گھر کی باری ہوتی تو تحفہ دینے والے صاحب اپنا تحفہ آپ صلی اللہ علیہ وسلم کی خدمت میں بھیجتے ۔ اس پر ام سلمہ رضی اللہ عنہا کی جماعت کی ازواج مطہرات نے آپس میں مشورہ کیا اور ام سلمہ رضی اللہ عنہا سے کہا کہ وہ رسول اللہ صلی اللہ علیہ وسلم سے بات کریں تاکہ آپ لوگوں سے فرما دیں کہ جسے آپ کے یہاں تحفہ بھیجنا ہو وہ جہاں بھی آپ صلی اللہ علیہ وسلم ہوں وہیں بھیجا کرے ۔ چنانچہ ان ازواج کے مشورہ کے مطابق انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے کہا لیکن آپ نے انہیں کوئی جواب نہیں دیا ۔ پھر ان خواتین نے پوچھا تو انہوں نے بتا دیا کہ مجھے آپ نے کوئی جواب نہیں دیا ۔ ازواج مطہرات نے کہا کہ پھر ایک مرتبہ کہو ۔ انہوں نے بیان کیا پھر جب آپ کی باری آئی تو دوبارہ انہوں نے آپ صلی اللہ علیہ وسلم سے عرض کیا ۔ اس مرتبہ بھی آپ صلی اللہ علیہ وسلم نے مجھے اس کا کوئی جواب ہی نہیں دیا ۔ ازواج نے اس مرتبہ ان سے کہا کہ آپ صلی اللہ علیہ وسلم کو اس مسئلہ پر بلواو تو سہی ۔ جب ان کی باری آئی تو انہوں نے پھر کہا ۔ آپ صلی اللہ علیہ وسلم نے اس مرتبہ فرمایا ۔ عائشہ رضی اللہ عنہا کے بارے میں مجھے تکلیف نہ دو ۔ عائشہ رضی اللہ عنہا کے سوا اپنی بیویوں میں سے کسی کے کپڑے میں بھی مجھ پر وحی نازل نہیں ہوتی ہے ۔ عائشہ رضی اللہ عنہا نے کہا کہ آپ صلی اللہ علیہ وسلم کے اس ارشاد پر انہوں نے عرض کیا ، آپ کو ایذا پہنچانے کی وجہ سے میں اللہ کے حضور میں توبہ کرتی ہوں ۔ پھر ان ازواج مطہرات نے رسول اللہ صلی اللہ علیہ وسلم کی صاحبزادی حضرت فاطمہ رضی اللہ عنہا کو بلایا اور ان کے ذریعہ آنحضرت صلی اللہ علیہ وسلم کی خدمت میں یہ کہلوایا کہ آپ کی ازواج ابوبکر رضی اللہ عنہ کی بیٹی کے بارے میں اللہ کے لیے آپ سے انصاف چاہتی ہیں ۔ چنانچہ انہوں نے بھی آپ صلی اللہ علیہ وسلم سے بات چیت کی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، میری بیٹی ! کیا تم وہ پسند نہیں کرتی جو میں پسند کروں ؟ انہوں نے جواب دیا کہ کیوں نہیں ، اس کے بعد وہ واپس آ گئیں اور ازواج کو اطلاع دی ۔ انہوں نے ان سے پھر دوبارہ خدمت نبوی میں جانے کے لیے کہا ۔ لیکن آپ نے دوبارہ جانے سے انکار کیا تو انہوں نے زینب بنت جحش رضی اللہ عنہا کو بھیجا ۔ وہ خدمت نبوی میں حاضر ہوئیں تو انہوں نے سخت گفتگو کی اور کہا کہ آپ کی ازواج ابوقحافہ کی بیٹی کے بارے میں آپ سے خدا کے لیے انصاف مانگتی ہیں اور ان کی آواز اونچی ہو گئی ۔ عائشہ رضی اللہ عنہا وہیں بیٹھی ہوئی تھیں ۔ انہوں نے ( ان کے منہ پر ) انہیں بھی برا بھلا کہا ۔ رسول اللہ صلی اللہ علیہ وسلم عائشہ رضی اللہ عنہا کی طرف دیکھنے لگے کہ وہ کچھ بولتی ہیں یا نہیں ۔ راوی نے بیان کیا کہ عائشہ رضی اللہ عنہا بھی بول پڑیں اور زینب رضی اللہ عنہا کی باتوں کا جواب دینے لگیں اور آخر انہیں خاموش کر دیا ۔ پھر رسول کریم صلی اللہ علیہ وسلم نے عائشہ رضی اللہ عنہا کی طرف دیکھ کر فرمایا کہ یہ ابوبکر کی بیٹی ہے ۔ امام بخاری رحمہ اللہ نے کہا کہ آخر کلام فاطمہ رضی اللہ عنہا کے واقعہ سے متعلق ہشام بن عروہ نے ایک اور شخص سے بیان کیا ہے ۔ انہوں نے زہری سے روایت کی اور انہوں نے محمد بن عبدالرحمٰن سے اور ابومروان نے بیان کیا کہ ہشام سے اور انہوں نے عروہ سے کہ لوگ تحائف بھیجنے کے لیے حضرت عائشہ رضی اللہ عنہا کی باری کا انتظار کیا کرتے تھے اور ہشام کی ایک روایت قریش کے ایک صاحب اور ایک دوسرے صاحب سے جو غلاموں میں سے تھے ، بھی ہے ۔ وہ زہری سے نقل کرتے ہیں اور وہ محمد بن عبدالرحمٰن بن حارث بن ہشام سے کہ حضرت عائشہ رضی اللہ عنہا نے کہا جب فاطمہ رضی اللہ عنہا نے ( اندر آنے کی ) اجازت چاہی تو میں اس وقت آپ صلی اللہ علیہ وسلم ہی کی خدمت میں موجود تھی ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 124960,
        "last_updated": null
    },
    {
        "urduURN": 4025620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2582,
        "hadithSanad": "ہم سے ابو معمر نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، ان سے عزرہ بن ثابت انصاری نے بیان کیا ، کہا کہ",
        "hadithText": "مجھ سے ثمامہ بن عبداللہ نے بیان کیا ، عزرہ نے کہا کہ میں ثمامہ بن عبداللہ کی خدمت میں حاضر ہوا تو انہوں نے مجھے خوشبو عنایت فرمائی اور بیان کیا کہ انس رضی اللہ عنہ خوشبو کو واپس نہیں کرتے تھے ۔ ثمامہ نے کہا کہ انس رضی اللہ عنہ کا گمان تھا کہ نبی کریم صلی اللہ علیہ وسلم خوشبو کو واپس نہیں فرمایا کرتے تھے ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 124970,
        "last_updated": null
    },
    {
        "urduURN": 4025630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے سعید بن ابی مریم نے بیان کیا ، ان سے لیث نے بیان کیا ، کہا کہ مجھ سے عقیل نے بیان کیا ابن شہاب سے ، ان سے عروہ نے ذکر کیا کہ مسور بن مخرمہ رضی اللہ عنہ اور مروان بن حکم نے انہیں خبر دی کہ",
        "hadithText": "جب قبیلہ ہوازن کا وفد نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آپ صلی اللہ علیہ وسلم نے لوگوں کو خطاب فرمایا اور اللہ کی شان کے مطابق ثناء کے بعد آپ نے فرمایا : امابعد ! یہ تمہارے بھائی توبہ کر کے ہمارے پاس آئے ہیں اور میں یہی بہتر سمجھتا ہوں کہ ان کے قیدی انہیں واپس کر دئیے جائیں ۔ اب جو شخص اپنی خوشی سے ( قیدیوں کو ) واپس کرنا چاہے وہ واپس کر دے اور جو یہ چاہے کہ انہیں ان کا حصہ ملے ( تو وہ بھی واپس کر دے ) اور ہمیں اللہ تعالیٰ ( اس کے بعد ) سب سے پہلی جو غنیمت دے گا ، اس میں سے ہم اسے معاوضہ دے دیں گے ۔ لوگوں نے کہا ہم اپنی خوشی سے ( ان کے قیدی واپس کر کے ) آپ کا ارشاد تسلیم کرتے ہیں ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 124980,
        "last_updated": null
    },
    {
        "urduURN": 4025640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2585,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے عیسیٰ بن یونس نے بیان کیا ، کہا ہم سے ہشام نے ، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم ہدیہ قبول فرما لیا کرتے ۔ لیکن اس کا بدلہ بھی دے دیا کرتے تھے ۔ اس حدیث کو وکیع اور محاضر نے بھی روایت کیا ، مگر انہوں نے اس کو ہشام سے ، انہوں نے اپنے باپ سے انہوں نے حضرت عائشہ رضی اللہ عنہا سے کے الفاظ نہیں کہے ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 124990,
        "last_updated": null
    },
    {
        "urduURN": 4025650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2586,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو امام مالک نے خبر دی ابن شہاب سے ، وہ حمید بن عبدالرحمٰن اور محمد بن نعمان بن بشیر سے اور ان سے نعمان بن بشیر رضی اللہ عنہما نے کہا",
        "hadithText": "ان کے والد انہیں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لائے اور عرض کیا کہ میں نے اپنے اس بیٹے کو ایک غلام بطور ہبہ دیا ہے ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ، کیا ایسا ہی غلام اپنے دوسرے لڑکوں کو بھی دیا ہے ؟ انہوں نے کہا نہیں ، تو آپ نے فرمایا کہ پھر ( ان سے بھی ) واپس لے لے ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 125000,
        "last_updated": null
    },
    {
        "urduURN": 4025660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2587,
        "hadithSanad": "ہم سے حامد بن عمر نے بیان کیا ، انہوں نے کہا ہم سے ابوعوانہ نے بیان کیا حصین سے ، وہ عامر سے کہ میں نے نعمان بن بشیر رضی اللہ عنہما سے سنا",
        "hadithText": "وہ منبر پر بیان کر رہے تھے کہ میرے باپ نے مجھے ایک عطیہ دیا ، تو عمرہ بنت رواحہ رضی اللہ عنہ ( نعمان کی والدہ ) نے کہا کہ جب تک آپ رسول اللہ صلی اللہ علیہ وسلم کو اس پر گواہ نہ بنائیں میں راضی نہیں ہو سکتی ۔ چنانچہ ( حاضر خدمت ہو کر ) انہوں نے عرض کیا کہ عمرہ بنت رواحہ سے اپنے بیٹے کو میں نے ایک عطیہ دیا تو انہوں نے کہا کہ پہلے میں آپ کو اس پر گواہ بنا لوں ، آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ اسی جیسا عطیہ تم نے اپنی تمام اولاد کو دیا ہے ؟ انہوں نے جواب دیا کہ نہیں ، اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ سے ڈرو اور اپنی اولاد کے درمیان انصاف کو قائم رکھو ۔ چنانچہ وہ واپس ہوئے اور ہدیہ واپس لے لیا ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 125010,
        "last_updated": null
    },
    {
        "urduURN": 4025670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2588,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا کہ ہم کو ہشام نے خبر دی ، انہیں معمرنے ، انہیں زہری نے ، کہا کہ مجھے عبیداللہ بن عبداللہ نے خبر دی کہ",
        "hadithText": "حضرت عائشہ رضی اللہ عنہا نے بیان کیا ، جب رسول کریم صلی اللہ علیہ وسلم کی بیماری بڑھی اور تکلیف شدید ہو گئی تو آپ نے اپنی بیویوں سے میرے گھر میں ایام مرض گزارنے کی اجازت چاہی اور آپ کو بیویوں نے اجازت دے دی تو آپ اس طرح تشریف لائے کہ دونوں قدم زمین پر رگڑ کھا رہے تھے ۔ آپ اس وقت حضرت عباس رضی اللہ عنہ اور ایک اور صاحب کے درمیان تھے ۔ عبیداللہ نے بیان کیا کہ پھر میں نے عائشہ رضی اللہ عنہا کی اس حدیث کا ذکر ابن عباس رضی اللہ عنہما سے کیا ۔ تو انہوں نے مجھ سے پوچھا ، عائشہ رضی اللہ عنہا نے جن کا نام نہیں لیا ، جانتے ہو وہ کون تھے ؟ میں نے کہا کہ نہیں ؟ آپ نے فرمایا کہ وہ حضرت علی بن ابی طالب رضی اللہ عنہ تھے ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 125020,
        "last_updated": null
    },
    {
        "urduURN": 4025680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2589,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے وہیب نے بیان کیا ، کہا ہم سے ابن طاؤس نے بیان کیا ، ان سے ان کے والد نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اپنا ہبہ واپس لینے والا اس کتے کی طرح ہے جو قے کر کے پھر چاٹ جاتا ہے ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 125030,
        "last_updated": null
    },
    {
        "urduURN": 4025690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2590,
        "hadithSanad": "ہم سے ابوعاصم ضحاک بن مخلد نے بیان کیا ، ان سے ابن جریج نے ، ان سے ابن ابی ملیکہ نے ، ان سے عباد بن عبداللہ نے اور ان سے اسماء رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میں نے عرض کیا یا رسول اللہ صلی اللہ علیہ وسلم ! میرے پاس صرف وہی مال ہے جو ( میرے شوہر ) زبیر نے میرے پاس رکھا ہوا ہے تو کیا میں اس میں سے صدقہ کر سکتی ہوں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ، صدقہ کرو ، جوڑ کے نہ رکھو ، کہیں تم سے بھی ۔ ( اللہ کی طرف سے نہ ) روک لیا جائے ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 125040,
        "last_updated": null
    },
    {
        "urduURN": 4025700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2591,
        "hadithSanad": "ہم سے عبیداللہ بن سعید نے بیان کیا ، کہا ہم سے عبداللہ بن نمیر نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، ان سے فاطمہ بنت منذر نے اور ان سے اسماء بنت ابی بکر رضی اللہ عنہا نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، خرچ کیا کر ، گنا نہ کر ، تاکہ تمہیں بھی گن کے نہ ملے اور جوڑ کے نہ رکھو ، تاکہ تم سے بھی اللہ تعالیٰ ( اپنی نعمتوں کو ) نہ چھپا لے ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 125050,
        "last_updated": null
    },
    {
        "urduURN": 4025710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2592,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، ان سے لیث نے ، ان سے یزید بن ابی حبیب نے ، ان سے بکیر نے ، ان سے ابن عباس کے غلام کریب نے اور انہیں ( ام المؤمنین ) حضرت میمونہ بنت حارث رضی اللہ عنہا نے خبر دی کہ",
        "hadithText": "انہوں نے ایک لونڈی نبی کریم صلی اللہ علیہ وسلم سے اجازت لیے بغیر آزاد کر دی ۔ پھر جس دن نبی کریم صلی اللہ علیہ وسلم کی باری آپ کے گھر آنے کی تھی ، انہوں نے خدمت نبوی میں عرض کیا ، یا رسول اللہ صلی اللہ علیہ وسلم ! آپ کو معلوم بھی ہوا ، میں نے ایک لونڈی آزاد کر دی ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، اچھا تم نے آزاد کر دیا ؟ انہوں نے عرض کیا کہ ہاں ! فرمایا کہ اگر اس کے بجائے تم نے اپنے ننھیال والوں کو دی ہوتی تو تمہیں اس سے بھی زیادہ ثواب ملتا ۔ اس حدیث کو بکیر بن مضر نے عمرو بن حارث سے ، انہوں نے بکیر سے ، انہوں نے کریب سے روایت کیا کہ میمونہ رضی اللہ عنہا نے اپنی لونڈی آزاد کر دی ۔ اخیر تک ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 125060,
        "last_updated": null
    },
    {
        "urduURN": 4025720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2593,
        "hadithSanad": "ہم سے حبان بن موسیٰ نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ بن مبارک نے خبر دی ، انہیں یونس نے خبر دی زہری سے ، وہ عروہ سے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم جب سفر کا ارادہ کرتے تو اپنی ازواج کے لیے قرعہ اندازی کرتے اور جن کا قرعہ نکل آتا انہیں کو اپنے ساتھ لے جاتے ۔ آپ صلی اللہ علیہ وسلم کا یہ بھی طریقہ تھا کہ اپنی تمام ازواج کے لیے ایک ایک دن اور رات کی باری مقرر کر دی تھی ، البتہ ( آخر میں ) سودہ بنت زمعہ رضی اللہ عنہا نے اپنی باری عائشہ رضی اللہ عنہا کو دے دی تھی ، اس سے ان کا مقصد رسول اللہ صلی اللہ علیہ وسلم کی رضا حاصل کرنی تھی ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 125070,
        "last_updated": null
    },
    {
        "urduURN": 4025730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2594,
        "hadithSanad": "اور بکر بن مضر نے عمرو بن حارث سے ، انہوں نے بکیر سے ، انہوں نے ابن عباس رضی اللہ عنہما کے غلام کریب سے ( بیان کیا کہ )",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ میمونہ رضی اللہ عنہا نے اپنی ایک لونڈی آزاد کی تو رسول کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ اگر وہ تمہارے ننہیالی والوں کو دی جاتی تو تمہیں زیادہ ثواب ملتا ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 125080,
        "last_updated": null
    },
    {
        "urduURN": 4025740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2595,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، انہوں نے کہا ہم سے محمد بن جعفر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ابوعمران جونی سے ، ان سے بنو تیم بن مرہ کے ایک صاحب طلحہ بن عبداللہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میں نے عرض کیا ، یا رسول اللہ صلی اللہ علیہ وسلم ! میری دو پڑوسی ہیں ، تو مجھے کس کے گھر ہدیہ بھیجنا چاہئے ؟ آپ نے فرمایا کہ جس کا دروازہ تم سے قریب ہو ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 125090,
        "last_updated": null
    },
    {
        "urduURN": 4025750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2596,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ، کہا کہ مجھے عبیداللہ بن عبداللہ بن عتبہ نے خبر دی ، انہیں عبداللہ بن عباس رضی اللہ عنہما نے خبر دی کہ انہوں نے صعب بن جثامہ لیثی رضی اللہ عنہ سے سنا ، وہ اصحاب رسول اللہ صلی اللہ علیہ وسلم میں سے تھے ۔ ان کا بیان تھا کہ",
        "hadithText": "انہوں نے آنحضرت صلی اللہ علیہ وسلم کی خدمت میں ایک گورخر ہدیہ کیا تھا ۔ آپ اس وقت مقام ابواء یا ودان میں تھے اور محرم تھے ۔ آپ نے وہ گورخر واپس کر دیا ۔ صعب رضی اللہ عنہ نے کہا کہ اس کے بعد جب آپ نے میرے چہرے پر ( ناراضی کا اثر ) ہدیہ کی واپسی کی وجہ سے دیکھا ، تو فرمایا کہ ہدیہ واپس کرنا مناسب تو نہ تھا لیکن بات یہ ہے کہ ہم احرام باندھے ہوئے ہیں ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 125100,
        "last_updated": null
    },
    {
        "urduURN": 4025760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2597,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے سفیان بن عینیہ نے بیان کیا ، زہری سے ، وہ عروہ بن زبیر سے ، وہ ابو حمید ساعدی رضی اللہ عنہ سے کہ",
        "hadithText": "قبیلہ ازد کے ایک صحابی کو جنہیں ابن اتبیہ کہتے تھے ، رسول اللہ صلی اللہ علیہ وسلم نے صدقہ وصول کرنے کے لیے عامل بنایا ۔ پھر جب وہ واپس آئے تو کہا کہ یہ تم لوگوں کا ہے ( یعنی بیت المال کا ) اور یہ مجھے ہدیہ میں ملا ہے ۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ وہ اپنے والد یا اپنی والدہ کے گھر میں کیوں نہ بیٹھا رہا ۔ دیکھتا وہاں بھی انہیں ہدیہ ملتا ہے یا نہیں ۔ اس ذات کی قسم ! جس کے ہاتھ میں میری جان ہے ۔ اس ( مال زکوٰۃ ) میں سے اگر کوئی شخص کچھ بھی ( ناجائز ) لے لے گا تو قیامت کے دن اسے وہ اپنی گردن پر اٹھائے ہوئے آئے گا ۔ اگر اونٹ ہے تو وہ اپنی آواز نکالتا ہوا آئے گا ، گائے ہے تو وہ اپنی اور اگر بکری ہے تو وہ اپنی آواز نکالتی ہو گی ۔ پھر آپ نے اپنے ہاتھ اٹھائے یہاں تک کہ ہم نے آپ کی بغل مبارک کی سفیدی بھی دیکھ لی ( اور فرمایا ) اے اللہ ! کیا میں نے تیرا حکم پہنچا دیا ۔ اے اللہ ! کیا میں نے تیرا حکم پہنچا دیا ۔ تین مرتبہ ( آپ صلی اللہ علیہ وسلم نے یہی فرمایا ) ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 125110,
        "last_updated": null
    },
    {
        "urduURN": 4025770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2598,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان بن عینہ نے بیان کیا ، کہا ہم سے محمد بن المنکدر نے بیان کیا ، انہوں نے جابر رضی اللہ عنہ سے سنا ۔ آپ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے مجھ سے وعدہ فرمایا ، اگر بحرین کا مال ( جزیہ کا ) آیا تو میں تمہیں اتنا اتنا تین لپ مال دوں گا ۔ لیکن بحرین سے مال آنے سے پہلے ہی آپ صلی اللہ علیہ وسلم وفات فرما گئے اور حضرت ابوبکر رضی اللہ عنہ نے ایک منادی سے یہ اعلان کرنے کے لیے کہا کہ جس سے نبی کریم صلی اللہ علیہ وسلم کا کوئی وعدہ ہو یا آپ صلی اللہ علیہ وسلم پر اس کا کوئی قرض ہو تو وہ ہمارے پاس آئے ۔ چنانچہ میں آپ کے یہاں گیا اور کہا کہ نبی کریم صلی اللہ علیہ وسلم نے مجھ سے وعدہ کیا تھا ۔ تو انہوں نے تین لپ بھر کر مجھے دئیے ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 125120,
        "last_updated": null
    },
    {
        "urduURN": 4025780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2599,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ابن ابی ملیکہ سے اور وہ مسور بن مخرمہ رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے چند قبائیں تقسیم کیں اور مخرمہ رضی اللہ عنہ کو اس میں سے ایک بھی نہیں دی ۔ انہوں نے ( مجھ سے ) کہا ، بیٹے چلو ، رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں چلیں ۔ میں ان کے ساتھ چلا ۔ پھر انہوں نے کہا کہ اندر جاؤ اور حضور اکرم صلی اللہ علیہ وسلم سے عرض کرو کہ میں آپ کا منتظر کھڑا ہوا ہوں ، چنانچہ میں اندر گیا اور حضور اکرم صلی اللہ علیہ وسلم کو بلا لایا ۔ آپ اس وقت انہیں قباؤں میں سے ایک قباء پہنے ہوئے تھے ۔ آپ نے فرمایا کہ میں نے یہ تمہارے لیے چھپا رکھی تھی ، لو اب یہ تمہاری ہے ۔ مسور نے بیان کیا کہ ( میرے والد ) مخرمہ رضی اللہ عنہ نے قباء کی طرف دیکھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، مخرمہ ! خوش ہو یا نہیں ؟</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 125130,
        "last_updated": null
    },
    {
        "urduURN": 4025790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2600,
        "hadithSanad": "ہم سے محمد بن محبوب نے بیان کیا ، کہا ہم سے عبدالواحد بن زیادہ نے بیان کیا ، کہا ہم سے معمر نے بیان کیا زہری سے ، وہ حمید بن عبدالرحمٰن سے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک دیہاتی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آیا اور کہنے لگا کہ میں تو ہلاک ہو گیا ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ، کیا بات ہوئی ؟ عرض کیا کہ رمضان میں میں نے اپنی بیوی سے ہمبستری کر لی ہے ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ، تمہارے پاس کوئی غلام ہے ؟ کہا کہ نہیں ۔ پھر دریافت فرمایا ، کیا دو مہینے پے در پے روزے رکھ سکتے ہو ؟ کہا کہ نہیں ۔ پھر دریافت فرمایا ، کیا ساٹھ مسکینوں کو کھانا دے سکتے ہو ؟ اس پر بھی جواب تھا کہ نہیں ۔ بیان کیا کہ اتنے میں ایک انصاری عرق لائے ۔ ( عرق کھجور کے پتوں کا بنا ہوا ایک ٹوکرا ہوتا تھا جس میں کھجور رکھی جاتی تھی ) آنحضرت صلی اللہ علیہ وسلم نے اس سے فرمایا کہ اسے لے جا اور صدقہ کر دے انہوں نے عرض کیا ، یا رسول اللہ ! کیا اپنے سے زیادہ ضرورت مند پر صدقہ کر دوں ؟ اور اس ذات کی قسم ! جس نے آپ کو حق کے ساتھ بھیجا ہے کہ سارے مدینے میں ہم سے زیادہ محتاج اور کوئی گھرانہ نہیں ہو گا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا پھر جا ، اپنے ہی گھر والوں کو کھلا دے ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 125140,
        "last_updated": null
    },
    {
        "urduURN": 4025800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2601,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا کہ ہم کو عبداللہ نے خبر دی ، انہیں یونس نے خبر دی اور لیث نے بیان کیا کہ مجھ سے یونس نے بیان کیا ابن شہاب سے ، وہ ابن کعب بن مالک سے اور انہیں جابر بن عبداللہ رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "احد کی لڑائی میں ان کے باپ شہید ہو گئے ( اور قرض چھوڑ گئے ) قرض خواہوں نے تقاضے میں بڑی شدت کی ، تو میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ سے اس سلسلے میں گفتگو کی ، آپ نے ان سے فرمایا کہ وہ میرے باغ کی کھجور لے لیں ( جو بھی ہوں ) اور میرے والد کو ( جو باقی رہ جائے وہ قرض ) معاف کر دیں ۔ لیکن انہوں نے انکار کیا ۔ پھر آپ نے میرا باغ انہیں نہیں دیا اور نہ ان کے لیے پھل تڑوائے ۔ بلکہ فرمایا کہ کل صبح میں تمہارے یہاں آؤں گا ۔ صبح کے وقت آپ تشریف لائے اور کھجور کے درختوں میں ٹہلتے رہے اور برکت کی دعا فرماتے رہے پھر میں نے پھل توڑ کر قرض خواہوں کے سارے قرض ادا کر دئیے اور میرے پاس کھجور بچ بھی گئی ۔ اس کے بعد میں رسول کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ بیٹھے ہوئے تھے ۔ میں نے آپ کو واقعہ کی اطلاع دی ۔ حضرت عمر رضی اللہ عنہ بھی وہیں بیٹھے ہوئے تھے ۔ آپ نے ان سے فرمایا ، عمر ! سن رہے ہو ؟ حضرت عمر رضی اللہ عنہ نے عرض کیا ، ہمیں تو پہلے سے معلوم ہے کہ آپ اللہ کے سچے رسول ہیں ۔ قسم خدا کی ! اس میں کسی شک و شبہ کی گنجائش ہی نہیں کہ آپ اللہ کے سچے رسول ہیں ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 125150,
        "last_updated": null
    },
    {
        "urduURN": 4025810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2602,
        "hadithSanad": "ہم سے یحییٰ بن قزعہ نے بیان کیا ، کہا ہم سے امام مالک نے ، وہ ابوحازم سے ، وہ سہل بن سعد رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی خدمت میں پینے کو کچھ لایا ، ( دودھ یا پانی ) آپ نے اسے نوش فرمایا ، آپ کے دائیں طرف ایک بچہ بیٹھا تھا اور بڑے بوڑھے لوگ بائیں طرف بیٹھے ہوئے تھے ، آپ نے اس بچے سے فرمایا کہ اگر تو اجازت دے ( تو بچا ہوا پانی ) میں ان بڑے لوگوں کو دے دوں ؟ لیکن اس نے کہا کہ یا رسول اللہ ! آپ کے جوٹھے میں سے ملنے والے کسی حصہ کا میں ایثار نہیں کر سکتا ۔ آنحضرت صلی اللہ علیہ وسلم نے پیالہ جھٹکے کے ساتھ اسی کی طرف بڑھا دیا ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 125170,
        "last_updated": null
    },
    {
        "urduURN": 4025820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2603,
        "hadithSanad": "اور ثابت بن محمد نے بیان کیا کہ ہم سے مسعر نے بیان کیا ، ان سے محارب نے اور ان سے جابر رضی اللہ عنہ نے کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ( سفر سے لوٹ کر ) مسجد میں حاضر ہوا تو آپ صلی اللہ علیہ وسلم نے ( میرے اونٹ کی قیمت ) ادا کی اور کچھ زیادہ بھی دیا ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 125180,
        "last_updated": null
    },
    {
        "urduURN": 4025830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2604,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا محارب بن دثار سے اور انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا ، آپ فرماتے تھے کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم کو سفر میں ایک اونٹ بیچا تھا ۔ جب ہم مدینہ پہنچے تو آپ نے فرمایا کہ مسجد میں جا کر دو رکعت نماز پڑھ ، پھر آپ نے وزن کیا ۔ شعبہ نے بیان کیا ، میرا خیال ہے کہ ( جابر رضی اللہ عنہ نے کہا ) میرے لیے وزن کیا ( آپ کے حکم سے حضرت بلال رضی اللہ عنہ نے ) اور ( اس پلڑے کو جس میں سکہ تھا ) جھکا دیا ۔ ( تاکہ مجھے زیادہ ملے ) اس میں سے کچھ تھوڑا سا میرے پاس جب سے محفوظ تھا ۔ لیکن شام والے ( اموی لشکر ) یوم حرہ کے موقع پر مجھ سے چھین کر لے گئے ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 125190,
        "last_updated": null
    },
    {
        "urduURN": 4025840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2605,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، کہا ہم سے امام مالک نے ابوحازم سے ، وہ سہل بن سعد رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں کچھ پینے کو لایا گیا ۔ آپ کی دائیں طرف ایک بچہ تھا اور قوم کے بڑے لوگ بائیں طرف تھے ۔ آپ نے بچے سے فرمایا کہ کیا تمہاری طرف سے اس کی اجازت ہے کہ میں بچا ہوا پانی ان بزرگوں کو دے دوں ؟ تو اس بچے نے کہا کہ نہیں قسم اللہ کی ! میں آپ سے ملنے والے اپنے حصہ کا ہرگز ایثار نہیں کر سکتا ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے مشروب ان کی طرف جھٹکے کے ساتھ بڑھا دیا ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 125200,
        "last_updated": null
    },
    {
        "urduURN": 4025850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2606,
        "hadithSanad": "ہم سے عبداللہ بن عثمان بن جبلہ نے بیان کیا ، انہوں نے کہا کہ مجھے میرے باپ نے خبر دی شعبہ سے ، ان سے سلمہ نے بیان کیا کہ میں نے ابوسلمہ سے سنا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہا کہ",
        "hadithText": "ایک شخص کا رسول اللہ صلی اللہ علیہ وسلم پر قرض تھا ( اس نے سختی کے ساتھ تقاضا کیا ) تو صحابہ اس کی طرف بڑھے ۔ لیکن آپ صلی اللہ علیہ وسلم نے فرمایا اسے چھوڑ دو ، حق والے کو کچھ نہ کچھ کہنے کی گنجائش ہوتی ہی ہے ۔ پھر آپ نے فرمایا کہ اس کے لیے ایک اونٹ اسی کے اونٹ کی عمر کا خرید کر اسے دے دو ۔ صحابہ نے عرض کیا کہ اس سے اچھی عمر کا ہی اونٹ مل رہا ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسی کو خرید کر دے دو کہ تم میں سب سے اچھا آدمی وہ ہے جو قرض کے ادا کرنے میں سب سے اچھا ہو ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 125210,
        "last_updated": null
    },
    {
        "urduURN": 4025860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، ان سے لیث نے ، کہا ہم سے عقیل نے ابن شہاب سے ، وہ عروہ سے کہ مروان بن حکم اور مسور بن مخرمہ رضی اللہ عنہما نے انہیں خبر دی کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم کی خدمت میں جب ہوازن کا وفد مسلمان ہو کر حاضر ہوا اور آپ سے درخواست کی کہ ان کے اموال اور قیدی انہیں واپس کر دئیے جائیں تو آپ نے ان سے فرمایا میرے ساتھ جتنی بڑی جماعت ہے اسے بھی تم دیکھ رہے ہو اور سب سے زیادہ سچی بات ہی مجھے سب سے زیادہ پسند ہے اس لیے تم لوگ ان دو چیزوں میں سے ایک ہی لے سکتے ہو ، یا اپنے قیدی لے لو یا اپنا مال ۔ میں نے تمہارا پہلے ہی انتظار کیا تھا ۔ اور نبی کریم صلی اللہ علیہ وسلم طائف سے واپسی پر تقریباً دس دن تک ( مقام جعرانہ میں ) ان لوگوں کا انتظار فرماتے رہے ۔ پھر جب ان لوگوں کے سامنے یہ بات پوری طرح واضح ہو گئی کہ آنحضرت صلی اللہ علیہ وسلم ان کی صرف ایک ہی چیز واپس فرما سکتے ہیں تو انہوں نے کہا کہ ہم اپنے قیدیوں ہی کو ( واپس لینا ) پسند کرتے ہیں ۔ پھر آپ صلی اللہ علیہ وسلم نے کھڑے ہو کر مسلمانوں کو خطاب کیا ، آپ نے اللہ کی اس کی شان کے مطابق تعریف بیان کی اور فرمایا ، امابعد ! یہ تمہارے بھائی ہمارے پاس اب توبہ کر کے آئے ہیں ۔ میرا خیال یہ ہے کہ انہیں ان کے قیدی واپس کر دوں ۔ اس لیے جو صاحب اپنی خوشی سے واپس کرنا چاہیں وہ ایسا کر لیں اور جو لوگ یہ چاہتے ہوں کہ اپنے حصے کو نہ چھوڑیں بلکہ ہم انہیں اس کے بدلے میں سب سے پہلی غنیمت کے مال میں سے معاوضہ دیں ، تو وہ بھی ( اپنے موجودہ قیدیوں کو ) واپس کر دیں ۔ سب صحابہ نے اس پر کہا ، یا رسول اللہ ! ہم اپنی خوشی سے انہیں واپس کرتے ہیں ۔ آپ نے فرمایا لیکن واضح طور پر اس وقت یہ معلوم نہ ہو سکا کہ کون اپنی خوشی سے دینے کے لیے تیار ہے اور کون نہیں ۔ اس لیے سب لوگ ( اپنے خیموں میں ) واپس جائیں اور تمہارے چودھری لوگ تمہارا معاملہ لا کر پیش کریں ۔ چنانچہ سب لوگ واپس ہو گئے اور نمائندوں نے ان سے گفتگو کی اور واپس ہو کر آنحضرت صلی اللہ علیہ وسلم کو بتایا کہ تمام لوگوں نے خوشی سے اجازت دے دی ہے ۔ قبیلہ ہوازن کے قیدیوں کے متعلق ہمیں یہی بات معلوم ہوئی ہے ۔ ابوعبداللہ امام بخاری نے کہا یہ زہری رحمہ اللہ کا آخری قول تھا ۔ یعنی یہ کہ ” قبیلہ ہوازن کے قیدیوں کے متعلق ہمیں یہی بات معلوم ہوئی ہے “ ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 125220,
        "last_updated": null
    },
    {
        "urduURN": 4025870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2609,
        "hadithSanad": "ہم سے ابن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی شعبہ سے ، انہیں ابوسلمہ بن کہیل نے ، انہیں ابوسلمہ نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک اونٹ بطور قرض لیا ، قرض خواہ تقاضا کرنے آیا ( اور نازیبا گفتگو کی ) تو آپ نے فرمایا کہ حق والے کو کہنے کا حق ہوتا ہے ۔ پھر آپ نے اس سے اچھی عمر کا اونٹ اسے دلا دیا اور فرمایا کہ تم میں افضل وہ ہے جو ادا کرنے میں سب سے بہتر ہو ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 125230,
        "last_updated": null
    },
    {
        "urduURN": 4025880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2610,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے ابن عیینہ نے بیان کیا عمرو سے اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "وہ سفر میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھے اور عمر رضی اللہ عنہ کے ایک سرکش اونٹ پر سوار تھے ۔ وہ اونٹ آنحضرت صلی اللہ علیہ وسلم سے بھی آگے بڑھ جایا کرتا تھا ۔ اس لیے ان کے والد ( عمر رضی اللہ عنہ ) کو تنبیہ کرنی پڑتی تھی کہ اے عبداللہ ! نبی کریم صلی اللہ علیہ وسلم سے آگے کسی کو نہ ہونا چاہئے ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا ! کہ عمر ! اسے مجھے بیچ دے ۔ عمر رضی اللہ عنہ نے عرض کیا یہ تو آپ ہی کا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے اسے خرید لیا ۔ پھر فرمایا ، عبداللہ یہ اب تیرا ہے ۔ جس طرح تو چاہے استعمال کر ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 125240,
        "last_updated": null
    },
    {
        "urduURN": 4025890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2611,
        "hadithSanad": "اور حمیدی نے بیان کیا کہ ہم سے سفیان نے بیان کیا کہ ہم سے عمرو نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھے اور میں ایک سرکش اونٹ پر سوار تھا ۔ نبی کریم صلی اللہ علیہ وسلم نے عمر رضی اللہ عنہ سے فرمایا کہ یہ اونٹ مجھے بیچ دے چنانچہ آپ نے اسے خرید لیا اور پھر فرمایا عبداللہ ! تو یہ اونٹ لے جا ( میں نے یہ تجھ کو بخش دیا ) ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 125250,
        "last_updated": null
    },
    {
        "urduURN": 4025900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2612,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، کہا ہم سے امام مالک نے نافع سے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "عمر رضی اللہ عنہ نے دیکھا کہ مسجد کے دروازے پر ایک ریشمی حلہ ( بک رہا ) ہے ۔ آپ نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا ، کہ کیا اچھا ہوتا اگر آپ اسے خرید لیتے اور جمعہ کے دن اور وفود کی ملاقات کے موقع پر اسے زیب تن فرما لیا کرتے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس کا جواب یہ دیا کہ اسے وہی لوگ پہنتے ہیں جن کا آخرت میں کوئی حصہ نہیں ہو گا ۔ کچھ دنوں بعد آنحضرت صلی اللہ علیہ وسلم کے یہاں بہت سے ( ریشمی ) حلے آئے اور آپ نے ایک حلہ ان میں سے حضرت عمر رضی اللہ عنہ کو بھی عنایت فرمایا ۔ عمر رضی اللہ عنہ نے اس پر عرض کیا کہ آپ یہ مجھے پہننے کے لیے عنایت فرما رہے ہیں ۔ حالانکہ آپ خود عطارد کے حلوں کے بارے میں جو کچھ فرمانا تھا فرما چکے ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے اسے تمہیں پہننے کے لیے نہیں دیا ہے ۔ چنانچہ عمر رضی اللہ عنہ نے اسے اپنے ایک مشرک بھائی کو دے دیا ، جو مکے میں رہتا تھا ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 125260,
        "last_updated": null
    },
    {
        "urduURN": 4025910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2613,
        "hadithSanad": "ہم سے ابوجعفر محمد بن جعفر نے بیان کیا ، کہا ہم سے ابن فضیل نے بیان کیا ، ان سے ان کے والد نے نافع سے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم حضرت فاطمہ رضی اللہ عنہا کے گھر تشریف لے گئے ، لیکن اندر نہیں گئے ۔ اس کے بعد حضرت علی رضی اللہ عنہ گھر آئے تو فاطمہ رضی اللہ عنہا نے ذکر کیا ( کہ آپ صلی اللہ علیہ وسلم گھر میں تشریف نہیں لائے ) علی رضی اللہ عنہ نے اس کا ذکر جب آنحضرت صلی اللہ علیہ وسلم سے کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے اس کے دروازے پر دھاری دار پردہ لٹکا دیکھا تھا ( اس لیے واپس چلا آیا ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ مجھے دنیا ( کی آرائش و زیبائش ) سے کیا سروکار ۔ حضرت علی رضی اللہ عنہ نے آ کر ان سے آپ کی گفتگو کا ذکر کیا تو انہوں نے کہا کہ آپ مجھے جس طرح کا چاہیں اس سلسلے میں حکم فرمائیں ۔ ( آنحضرت صلی اللہ علیہ وسلم کو جب یہ بات پہنچی تو ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ فلاں گھر میں اسے بھجوا دیں ۔ انہیں اس کی ضرورت ہے ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 125270,
        "last_updated": null
    },
    {
        "urduURN": 4025920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2614,
        "hadithSanad": "ہم سے حجاج بن منہال نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا کہ مجھے عبدالمالک بن میسرہ نے خبر دی ، کہا کہ میں نے زید بن وہب سے سنا کہ حضرت علی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے مجھے ایک ریشمی حلہ ہدیہ میں دیا تو میں نے اسے پہن لیا ۔ لیکن جب غصے کے آثار روئے مبارک پر دیکھے تو اسے اپنی عورتوں میں پھاڑ کر تقسیم کر دیا ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 125280,
        "last_updated": null
    },
    {
        "urduURN": 4025930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2615,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے یونس بن محمد نے بیان کیا ، ان سے شیبان نے بیان کیا قتادہ سے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی خدمت میں دبیز قسم کے ریشم کا ایک جبہ ہدیہ کے طور پر پیش کیا گیا ۔ آپ اس کے استعمال سے ( مردوں کو ) منع فرماتے تھے ۔ صحابہ کو بڑی حیرت ہوئی ( کہ کتنا عمدہ ریشم ہے ) آپ صلی اللہ علیہ وسلم نے فرمایا ( تمہیں اس پر حیرت ہے ) اس ذات کی قسم جس کے ہاتھ میں محمد صلی اللہ علیہ وسلم کی جان ہے ، جنت میں سعد بن معاذ رضی اللہ عنہ کے رومال اس سے بھی زیادہ خوبصورت ہیں ۔ \n<span class=urdu_sanad>سعد نے بیان کیا قتادہ سے اور ان سے انس رضی اللہ عنہ نے کہ</span> دومہ ( تبوک کے قریب ایک مقام ) کے اکیدر ( نصرانی ) نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ہدیہ بھیجا تھا ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 125291,
        "last_updated": null
    },
    {
        "urduURN": 4025950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2617,
        "hadithSanad": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ، کہا ہم سے خالد بن حارث نے بیان کیا ، ان سے شعبہ نے ، ان سے ہشام بن زید نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "ایک یہودی عورت نبی کریم صلی اللہ علیہ وسلم کی خدمت میں زہر ملا ہوا بکری کا گوشت لائی ، آپ صلی اللہ علیہ وسلم نے اس میں سے کچھ کھایا ( لیکن فوراً ہی فرمایا کہ اس میں زہر پڑا ہوا ہے ) پھر جب اسے لایا گیا ( اور اس نے زہر ڈالنے کا اقرار بھی کر لیا ) تو کہا گیا کہ کیوں نہ اسے قتل کر دیا جائے ۔ لیکن آپ نے فرمایا کہ نہیں ۔ اس زہر کا اثر میں نے ہمیشہ نبی کریم صلی اللہ علیہ وسلم کے تالو میں محسوس کیا ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 125310,
        "last_updated": null
    },
    {
        "urduURN": 4025960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2618,
        "hadithSanad": "ہم سے ابوالنعمان نے بیان کیا ، انہوں نے کہا ہم سے معتمر بن سلیمان نے بیان کیا ، ان سے ان کے باپ نے بیان کیا ، ان سے ابوعثمان نے بیان کیا اور ان سے عبدالرحمٰن بن ابی بکر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ہم ایک سو تیس آدمی رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( ایک سفر میں ) تھے ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کیا کسی کے ساتھ کھانے کی بھی کوئی چیز ہے ؟ ایک صحابی کے ساتھ تقریباً ایک صاع کھانا ( آٹا ) تھا ۔ وہ آٹا گوندھا گیا ۔ پھر ایک لمبا تڑنگا مشرک پریشان حال بکریاں ہانکتا ہوا آیا ۔ تو نبی اکرم صلی اللہ علیہ وسلم نے دریافت فرمایا یہ بیچنے کے لیے ہیں ۔ یا کسی کا عطیہ ہی یا آپ نے ( عطیہ کی بجائے ) ہبہ فرمایا ۔ اس نے کہا کہ نہیں بیچنے کے لیے ہیں ۔ آپ نے اس سے ایک بکری خریدی پھر وہ ذبح کی گئی ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے اس کی کلیجی بھوننے کے لیے کہا ۔ قسم خدا کی ایک سو تیس اصحاب میں سے ہر ایک کو اس کلیجی میں سے کاٹ کے دیا ۔ جو موجود تھے انہیں تو آپ نے فوراً ہی دے دیا اور جو اس وقت موجود نہیں تھے ان کا حصہ محفوظ رکھ لیا ۔ پھر بکری کے گوشت کو دو بڑی قابوں میں رکھا گیا اور سب نے خوب سیر ہو کر کھایا ۔ جو کچھ قابوں میں بچ گیا تھا اسے اونٹ پر رکھ کر ہم واپس لائے ۔ او کما قال ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 125320,
        "last_updated": null
    },
    {
        "urduURN": 4025970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2619,
        "hadithSanad": "ہم سے خالد بن مخلد نے بیان کیا ، کہا ہم سے سلیمان بن بلال نے بیان کیا ، کہا کہ مجھ سے عبداللہ بن دینار نے بیان کیا اور ان سے عبداللہ بن عمر نے کہ",
        "hadithText": "عمر رضی اللہ عنہ نے دیکھا کہ ایک شخص کے یہاں ایک ریشمی جوڑا بک رہا ہے ۔ تو آپ نے نبی کریم صلی اللہ علیہ وسلم سے کہا کہ آپ یہ جوڑا خرید لیجئیے تاکہ جمعہ کے دن اور جب کوئی وفد آئے تو آپ اسے پہنا کریں ۔ آپ نے فرمایا کہ اسے تو وہ لوگ پہنتے ہیں جن کا آخرت میں کوئی حصہ نہیں ہوتا ۔ پھر نبی کریم صلی اللہ علیہ وسلم کے پاس بہت سے ریشمی جوڑے آئے اور آپ نے ان میں سے ایک جوڑا عمر رضی اللہ عنہ کو بھیجا ۔ عمر رضی اللہ عنہ نے کہا کہ میں اسے کس طرح پہن سکتا ہوں جب کہ آپ خود ہی اس کے متعلق جو کچھ ارشاد فرمانا تھا ، فرما چکے ہیں ۔ آپ نے فرمایا کہ میں نے تمہیں پہننے کے لیے نہیں دیا بلکہ اس لیے دیا کہ تم اسے بیچ دو یا کسی ( غیر مسلم ) کو پہنا دو ۔ چنانچہ عمر رضی اللہ عنہ نے اسے مکے میں اپنے ایک بھائی کے گھر بھیج دیا جو ابھی اسلام نہیں لایا تھا ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 125330,
        "last_updated": null
    },
    {
        "urduURN": 4025980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2620,
        "hadithSanad": "ہم سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ہشام سے ، ان سے ان کے باپ نے اور ان سے اسماء بنت ابی بکر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں میری والدہ ( قتیلہ بنت عبدالعزیٰ ) جو مشرکہ تھیں ، میرے یہاں آئیں ۔ میں نے آپ صلی اللہ علیہ وسلم سے پوچھا ، میں نے یہ بھی کہا کہ وہ ( مجھ سے ملاقات کی ) بہت خواہشمند ہیں ، تو کیا میں اپنی والدہ کے ساتھ صلہ رحمی کر سکتی ہوں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں اپنی والدہ کے ساتھ صلہ رحمی کر ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 125340,
        "last_updated": null
    },
    {
        "urduURN": 4025990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2621,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے ہشام اور شعبہ نے بیان کیا ، انہوں نے کہا کہ ہم سے قتادہ نے بیان کیا سعید بن مسیب سے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اپنا دیا ہوا ہدیہ واپس لینے والا ایسا ہے جیسے اپنی کی ہوئی قے کو چاٹنے والا ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 125350,
        "last_updated": null
    },
    {
        "urduURN": 4026000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2622,
        "hadithSanad": "ہم سے عبدالرحمٰن بن مبارک نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، کہا کہ ہم سے ایوب نے بیان کیا عکرمہ سے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ہم مسلمانوں کو بری مثال نہ اختیار کرنی چاہئے ۔ اس شخص کی سی جو اپنا دیا ہوا ہدیہ واپس لے لے ، وہ اس کتے کی طرح ہے جو اپنی قے خود چاٹتا ہے ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 125360,
        "last_updated": null
    },
    {
        "urduURN": 4026010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2623,
        "hadithSanad": "ہم سے یحییٰ بن قزعہ نے بیان کیا ، کہا ہم سے امام مالک نے بیان کیا زید بن اسلم سے ، ان سے ان کے باپ نے کہ",
        "hadithText": "انہوں نے عمر بن خطاب رضی اللہ عنہ سے سنا ۔ آپ نے فرمایا کہ میں نے ایک گھوڑا اللہ کے راستے میں جہاد کے لیے ( ایک شخص کو ) دیا ) ۔ جسے میں نے وہ گھوڑا دیا تھا ، اس نے اسے دبلا کر دیا ۔ اس لیے میرا ارادہ ہوا کہ اس سے اپنا وہ گھوڑا خرید لوں ، میرا یہ بھی خیال تھا کہ وہ شخص وہ گھوڑا سستے داموں پر بیچ دے گا ۔ لیکن جب میں نے اس کے بارے میں نبی کریم صلی اللہ علیہ وسلم سے پوچھا تو آپ نے فرمایا کہ تم اسے نہ خریدو ، خواہ تمہیں وہ ایک ہی درہم میں کیوں نہ دے ۔ کیونکہ اپنے صدقہ کو واپس لینے والا شخص اس کتے کی طرح ہے جو اپنی ہی قے خود چاٹتا ہے ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 125370,
        "last_updated": null
    },
    {
        "urduURN": 4026020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2624,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا ہم کو ہشام بن یوسف نے خبر دی ، انہیں ابن جریج نے خبر دی ، کہا کہ مجھے عبداللہ بن عبیداللہ بن ابی ملیکہ نے خبر دی کہ ابن جدعان کے غلام بنوصہیب نے دعویٰ کیا کہ",
        "hadithText": "دو مکان اور ایک حجرہ نبی کریم صلی اللہ علیہ وسلم نے صہیب رضی اللہ عنہ کو عنایت فرمایا تھا ( جو وراثت میں انہیں ملنا چاہئے ) خلیفہ مروان بن حکم نے پوچھا کہ تمہارے حق میں اس دعویٰ پر گواہ کون ہے ؟ انہوں نے کہا کہ عبداللہ بن عمر رضی اللہ عنہما ۔ مروان نے آپ کو بلایا تو آپ نے گواہی دی کہ واقعی رسول اللہ صلی اللہ علیہ وسلم نے صہیب رضی اللہ عنہ کو دو مکان اور ایک حجرہ دیا تھا ۔ مروان نے آپ کی گواہی پر فیصلہ ان کے حق میں کر دیا ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 125380,
        "last_updated": null
    },
    {
        "urduURN": 4026030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2625,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، ان سے شیبان نے بیان کیا ، ان سے یحییٰ نے ، ان سے ابوسلمہ نے اور ان سے جابر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے عمریٰ کے متعلق فیصلہ کیا تھا کہ وہ اس کا ہو جاتا ہے جسے ہبہ کیا گیا ہو ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 125390,
        "last_updated": null
    },
    {
        "urduURN": 4026040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2626,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، ان سے قتادہ نے بیان کیا ، ان سے نضر بن انس نے بیان کیا ، ان سے بشیر بن نہیک نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا عمریٰ جائز ہے اور عطاء نے کہا کہ مجھ سے جابر رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے اسی طرح بیان کیا ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 125401,
        "last_updated": null
    },
    {
        "urduURN": 4026050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2627,
        "hadithSanad": "ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا قتادہ سے کہ میں نے انس رضی اللہ عنہ سے سنا ۔ آپ نے بیان کیا کہ",
        "hadithText": "مدینے پر ( دشمن کے حملے کا ) خوف تھا ۔ اس لیے نبی کریم صلی اللہ علیہ وسلم نے ابوطلحہ رضی اللہ عنہ سے ایک گھوڑا جس کا نام مندوب تھا مستعار لیا ، پھر آپ صلی اللہ علیہ وسلم اس پر سوار ہوئے ( صحابہ بھی ساتھ تھے ) پھر جب واپس ہوئے تو فرمایا ، ہمیں تو کوئی خطرہ کی چیز نظر نہ آئی ، البتہ یہ گھوڑا سمندر کی طرح ( تیز دوڑتا ) پایا ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 125420,
        "last_updated": null
    },
    {
        "urduURN": 4026060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2628,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے عبدالواحد بن ایمن نے بیان کیا ، کہا کہ مجھ سے میرے باپ نے بیان کیا ، انہوں نے کہا کہ",
        "hadithText": "میں عائشہ رضی اللہ عنہا کی خدمت میں حاضر ہوا تو آپ قطر ( یمن کا ایک دبیز کھردرا کپڑا ) کی قمیص قیمتی پانچ درہم کی پہنے ہوئے تھیں ۔ آپ نے ( مجھ سے ) فرمایا ۔ ذرا نظر اٹھا کر میری اس لونڈی کو تو دیکھ ۔ اسے گھر میں بھی یہ کپڑے پہننے سے انکار ہے ۔ حالانکہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں میرے پاس اسی کی ایک قمیص تھی ۔ جب کوئی لڑکی دلہن بنائی جاتی تو میرے یہاں آدمی بھیج کر وہ قمیص عاریتاً منگا لیتی تھی ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 125430,
        "last_updated": null
    },
    {
        "urduURN": 4026070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2629,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا ہم سے امام مالک نے بیان کیا ، ان سے ابوالزناد نے ، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، کیا ہی عمدہ ہے ہدیہ اس دودھ دینے والی اونٹنی کا جس نے ابھی حال ہی میں بچہ جنا ہو اور دودھ دینے والی بکری کا جو صبح و شام اپنے دودھ سے برتن بھر دیتی ہے ۔ ہم سے عبداللہ بن یوسف اور اسماعیل نے بیان کیا ، ان سے امام مالک نے بیان کیا کہ ( دودھ دینے والی اونٹنی کا ) صدقہ کیا ہی عمدہ ہے ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 125440,
        "last_updated": null
    },
    {
        "urduURN": 4026080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2630,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو ابن وہب نے خبر دی یونس سے ، انہوں نے ابن شہاب سے ، وہ انس بن مالک رضی اللہ عنہ سے کہ",
        "hadithText": "جب مہاجرین مکہ سے مدینہ آئے تو ان کے ساتھ کوئی بھی سامان نہ تھا ۔ انصار زمین اور جائیداد والے تھے ۔ انصار نے مہاجرین سے یہ معاملہ کر لیا کہ وہ اپنے باغات میں سے انہیں ہر سال پھل دیا کریں گے اور اس کے بدلے مہاجرین ان کے باغات میں کام کیا کریں ۔ حضرت انس رضی اللہ عنہ کی والدہ ام سلیم جو عبداللہ بن ابی طلحہ رضی اللہ عنہما کی بھی والدہ تھیں ، انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو کھجور کا ایک باغ ہدیہ دے دیا تھا لیکن آپ نے وہ باغ اپنی لونڈی ام ایمن رضی اللہ عنہا جو اسامہ بن زید رضی اللہ عنہما کی والدہ تھیں ، عنایت فرما دیا ۔ ابن شہاب نے بیان کیا کہ مجھے انس بن مالک رضی اللہ عنہ نے خبر دی کہ نبی کریم صلی اللہ علیہ وسلم جب خیبر کے یہودیوں کی جنگ سے فارغ ہوئے اور مدینہ تشریف لائے تو مہاجرین نے انصار کو ان کے تحائف واپس کر دئیے جو انہوں نے پھلوں کی صورت میں دے رکھے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے انس رضی اللہ کی والدہ کا باغ بھی واپس کر دیا اور ام ایمن رضی اللہ عنہا کو اس کے بجائے اپنے باغ میں سے ( کچھ درخت ) عنایت فرما دئیے ۔ احمد بن شبیب نے بیان کیا ، انہیں ان کے والد نے خبر دی اور انہیں یونس نے اسی طرح البتہ ( اپنی روایت میں بجائے مکانہن من حائطہٰ کے ) مکانہن من خالصہ بیان کیا ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 125450,
        "last_updated": null
    },
    {
        "urduURN": 4026090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2631,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے عیسیٰ بن یونس نے بیان کیا ، انہوں نے کہا ہم سے اوزاعی نے بیان کیا حسان بن عطیہ سے ، ان سے ابوکبشہ سلولی نے اور انہوں نے عبداللہ بن عمرو رضی اللہ عنہما سے سنا ۔ آپ بیان کرتے تھے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، چالیس خصلتیں جن میں سب سے اعلیٰ و ارفع دودھ دینے والی بکری کا ہدیہ کرنا ہے ۔ ایسی ہیں کہ جو شخص ان میں سے ایک خصلت پر بھی عامل ہو گا ثواب کی نیت سے اور اللہ کے وعدے کو سچا سمجھتے ہوئے تو اللہ تعالیٰ اس کی وجہ سے اسے جنت میں داخل کرے گا ۔ حسان نے کہا کہ دودھ دینے والی بکری کے ہدیہ کو چھوڑ کر ہم نے سلام کا جواب دینا ، چھینکنے والے کا جواب دینا اور تکلیف دینے والی چیز کو راستے سے ہٹا دینے وغیرہ کا شمار کیا ، تو سب پندرہ خصلتیں بھی ہم شمار نہ کر سکے ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 125460,
        "last_updated": null
    },
    {
        "urduURN": 4026100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2632,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے اوزاعی نے بیان کیا ، کہا کہ مجھ سے عطاء نے بیان کیا ، ان سے جابر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم میں سے بہت سے اصحاب کے پاس فالتو زمین بھی تھی ، انہوں نے کہا تھا کہ تہائی یا چوتھائی یا نصف کی بٹائی پر ہم کیوں نہ اسے دے دیا کریں ۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس کے پاس زمین ہو تو اسے خود بونی چاہئے یا پھر کسی اپنے بھائی کو ہدیہ کر دینی چاہئے اور اگر ایسا نہیں کرتا تو پھر زمین اپنے پاس رکھے رہے ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 125470,
        "last_updated": null
    },
    {
        "urduURN": 4026110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2633,
        "hadithSanad": "اور محمد بن یوسف نے بیان کیا ، ان سے اوزاعی نے بیان کیا ، ان سے زہری نے بیان کیا ، ان سے عطاء بن ےزید نے بیان کیا اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک دیہاتی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ سے ہجرت کے لیے پوچھا ۔ آپ نے فرمایا ، خدا تم پر رحم کرے ۔ ہجرت کا تو بڑا ہی دشوار معاملہ ہے ۔ تمہارے پاس اونٹ بھی ہے ؟ انہوں نے کہا جی ہاں ! آپ نے دریافت فرمایا ، اور اس کا صدقہ ( زکوٰۃ ) بھی ادا کرتے ہو ؟ انہوں نے کہا جی ہاں ! آپ نے دریافت فرمایا ، اس میں سے کچھ ہدیہ بھی دیتے ہو ؟ انہوں نے کہا جی ہاں ! آپ نے دریافت فرمایا ، تو تم اسے پانی پلانے کے لیے گھاٹ پر لے جانے والے دن دوہتے ہو گے ؟ انہوں نے کہا جی ہاں ! پھر آپ نے فرمایا کہ سمندروں کے پار بھی اگر تم عمل کرو گے تو اللہ تعالیٰ تمہارے عمل میں سے کوئی چیز کم نہیں کرے گا ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 125480,
        "last_updated": null
    },
    {
        "urduURN": 4026120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2634,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے عبدالوہاب نے بیان کیا ، کہا ہم سے ایوب نے بیان کیا ، ان سے عمرو نے ، ان سے طاوس نے بیان کیا کہ مجھ سے ان میں سب سے زیادہ اس ( مخابرہ ) کے جاننے والے نے بیان کیا ، ان کی مراد ابن عباس رضی اللہ عنہما سے تھی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ایک مرتبہ ایسے کھیت کی طرف تشریف لے گئے جس کی کھیتی لہلہا رہی تھی ، آپ نے دریافت فرمایا کہ یہ کس کا ہے ؟ صحابہ رضی اللہ عنہم نے بتلایا کہ فلاں نے اسے کرایہ پر لیا ہے ۔ اس پر آپ نے فرمایا کہ اگر وہ ہدیتاً دے دیتا تو اس سے بہتر تھا کہ اس پر ایک مقررہ اجرت وصول کرتا ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 125490,
        "last_updated": null
    },
    {
        "urduURN": 4026130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2635,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا کہ ہم کو شعیب نے خبر دی ، ان سے ابوالزناد نے بیان کیا ، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ابراہیم علیہ السلام نے سارہ کے ساتھ ہجرت کی تو انہیں بادشاہ نے آجر کو ( یعنی ہاجرہ کو ) عطیہ میں دے دیا ۔ پھر وہ واپس ہوئیں اور ابراہیم سے کہا ، دیکھا آپ نے اللہ تعالیٰ نے کافر کو کس طرح ذلیل کیا اور ایک لڑکی خدمت کے لیے بھی دے دی ۔ ابن سیرین نے کہا ، ان سے ابوہریرہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے بیان کیا کہ بادشاہ نے ہاجرہ کو ان کی خدمت کے لیے دے دیا تھا ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 125500,
        "last_updated": null
    },
    {
        "urduURN": 4026140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 51,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2636,
        "hadithSanad": "ہم سے حمیدی نے بیان کیا ، کہا ہم کو سفیان نے خبر دی ، کہا کہ میں نے مالک سے سنا ، انہوں نے زید بن اسلم سے پوچھا تھا تو انہوں نے بیان کیا کہ",
        "hadithText": "میں نے اپنے باپ سے سنا وہ بیان کرتے تھے کہ عمر رضی اللہ عنہ نے کہا میں نے ایک گھوڑا اللہ کے راستے میں جہاد کے لیے ایک شخص کو دے دیا تھا ، پھر میں نے دیکھا کہ وہ اسے بیچ رہا ہے ۔ اس لیے میں نے رسول کریم صلی اللہ علیہ وسلم سے پوچھا کہ اسے واپس میں ہی خرید لوں ؟ آپ نے فرمایا اس گھوڑے کو نہ خرید ۔ اپنا دیا ہوا صدقہ واپس نہ لو ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 125510,
        "last_updated": null
    },
    {
        "urduURN": 4025465,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 51,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 2566,
        "hadithSanad": "ہم سے عاصم بن علی ابوالحسین نے بیان کیا ، کہا ہم سے ابن ابی ذئب نے بیان کیا ، ان سے سعید مقبری نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اے مسلمان عورتو ! ہرگز کوئی پڑوسن اپنی دوسری پڑوسن کے لیے ( معمولی ہدیہ کو بھی ) حقیر نہ سمجھے ، خواہ بکری کے کھر کا ہی کیوں نہ ہو ۔</b>",
        "bookID": "51.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 124810,
        "last_updated": null
    }
]