[
    {
        "urduURN": 4031470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3190,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو سفیان ثوری نے خبر دی ، انہیں جامع بن شداد نے ، انہیں صفوان بن محرز نے اور ان سے عمران بن حصین رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "بنی تمیم کے کچھ لوگ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں آئے تو آپ نے ان سے فرمایا کہ اے بنی تمیم کے لوگو ! تمہیں بشارت ہو ۔ وہ کہنے لگے کہ بشارت جب آپ نے ہم کو دی ہے تو اب ہمیں کچھ مال بھی دیجئیے ۔ اس پر آنحضرت صلی اللہ علیہ وسلم کے چہرہ مبارک کا رنگ بدل گیا ، پھر آپ کی خدمت میں یمن کے لوگ آئے تو آپ نے ان سے بھی فرمایا کہ اے یمن والو ! بنوتمیم کے لوگوں نے تو خوشخبری کو قبول نہیں کیا ، اب تم اسے قبول کر لو ۔ انہوں نے عرض کیا کہ ہم نے قبول کیا ۔ پھر آپ مخلوق اور عرش الٰہی کی ابتداء کے بارے میں گفتگو فرمانے لگے ۔ اتنے میں ایک ( نامعلوم ) شخص آیا اور کہا کہ عمران ! تمہاری اونٹنی بھاگ گئی ۔ ( عمران رضی اللہ عنہ کہتے ہیں ) کاش ، میں آپ کی مجلس سے نہ اٹھتا تو بہتر ہوتا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 129060,
        "last_updated": null
    },
    {
        "urduURN": 4031480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3191,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا کہ مجھ سے میرے باپ نے بیان کیا ، کہا کہ ہم سے اعمش نے بیان کیا ، کہا ہم سے جامع بن شداد نے بیان کیا ، ان سے صفوان بن مرحز نے اور ان سے عمران بن حصین رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ اور اپنے اونٹ کو میں نے دروازے ہی پر باندھ دیا ۔ اس کے بعد بنی تمیم کے کچھ لوگ آپ کی خدمت میں حاضر ہوئے ۔ آپ صلی اللہ علیہ وسلم نے ان سے فرمایا اے بنوتمیم ! خوشخبری قبول کرو ۔ انہوں نے دوبار کہا کہ جب آپ نے ہمیں خوشخبری دی ہے تو اب مال بھی دیجئیے ۔ پھر یمن کے چند لوگ خدمت نبوی میں حاضر ہوئے ۔ آپ صلی اللہ علیہ وسلم نے ان سے بھی یہی فرمایا کہ خوشخبری قبول کر لو اے یمن والو ! بنوتمیم والوں نے تو نہیں قبول کی ۔ وہ بولے یا رسول اللہ ! خوشخبری ہم نے قبول کی ۔ پھر وہ کہنے لگے ہم اس لیے حاضر ہوئے ہیں تاکہ آپ سے اس ( عالم کی پیدائش ) کا حال پوچھیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، اللہ تعالیٰ ازل سے موجود تھا اور اس کے سوا کوئی چیز موجود نہ تھی اور اس کا عرش پانی پر تھا ۔ لوح محفوظ میں اس نے ہر چیز کو لکھ لیا تھا ۔ پھر اللہ تعالیٰ نے آسمان و زمین کو پیدا کیا ۔ ( ابھی یہ باتیں ہو ہی رہی تھیں کہ ) ایک پکارنے والے نے آواز دی کہ ابن الحصین ! تمہاری اونٹنی بھاگ گئی ۔ میں اس کے پیچھے دوڑا ۔ دیکھا تو وہ سراب کی آڑ میں ہے ( میرے اور اس کے بیچ میں سراب حائل ہے یعنی وہ ریتی جو دھوپ میں پانی کی طرح چمکتی ہے ) اللہ تعالیٰ کی قسم ، میرا دل بہت پچھتایا کہ کاش ، میں اسے چھوڑ دیا ہوتا ( اور آنحضرت صلی اللہ علیہ وسلم کی حدیث سنی ہوتی ) ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 129070,
        "last_updated": null
    },
    {
        "urduURN": 4031490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3192,
        "hadithSanad": "اور عیسیٰ نے رقبہ سے روایت کیا ، انہوں نے قیس بن مسلم سے ، انھوں نے طارق بن شہاب سے ، انھوں نے بیان کیا کہ میں نے عمر بن خطاب رضی اللہ عنہ سے سنا ، آپ نے کہا کہ",
        "hadithText": "ایک مرتبہ نبی کریم صلی اللہ علیہ وسلم نے منبر پر کھڑے ہو کر ہمیں وعظ فرمایا اور ابتدائے خلق کے بارے میں ہمیں خبر دی ۔ یہاں تک کہ جب جنت والے اپنی منزلوں میں داخل ہو جائیں گے اور جہنم والے اپنے ٹھکانوں کو پہنچ جائیں گے ( وہاں تک ساری تفصیل کو آپ نے بیان فرمایا ) جسے اس حدیث کو یاد رکھنا تھا اس نے یاد رکھا اور جسے بھولنا تھا وہ بھول گیا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 129080,
        "last_updated": null
    },
    {
        "urduURN": 4031500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3193,
        "hadithSanad": "مجھ سے عبداللہ بن ابی شیبہ نے بیان کیا ، ان سے ابواحمد نے بیان کیا ، ان سے سفیان ثوری نے ان سے ابوالزناد نے ، ان سے اعرج نے ، اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ فرماتا ہے کہ ابن آدم نے مجھے گالی دی اور اس کے لیے مناسب نہ تھا کہ وہ مجھے گالی دیتا ۔ اس نے مجھے جھٹلایا اور اس کے لیے یہ بھی مناسب نہ تھا ۔ اس کی گالی یہ ہے کہ وہ کہتا ہے ، میرا بیٹا ہے اور اس کا جھٹلانا یہ ہے کہ وہ کہتا ہے کہ جس طرح اللہ نے مجھے پہلی بار پیدا کیا ، دوبارہ ( موت کے بعد ) وہ مجھے زندہ نہیں کر سکے گا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 129090,
        "last_updated": null
    },
    {
        "urduURN": 4031510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3194,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے مغیرہ بن عبدالرحمن قرشی نے بیان کیا ، انھوں نے کہا کہ ہم سے ابوالزناد نے بیان کیا ، ان سے اعرج نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جب اللہ تعالیٰ مخلوق کو پیدا کر چکا تو اپنی کتاب ( لوح محفوظ ) میں ، جو اس کے پاس عرش پر موجود ہے ، اس نے لکھا کہ میری رحمت میرے غصہ پر غالب ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 129100,
        "last_updated": null
    },
    {
        "urduURN": 4031520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3195,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم کو اسماعیل بن علیہ نے خبر دی ، انہیں علی بن مبارک نے کہا ، ان سے یحییٰ بن ابی کثیر نے بیان کیا ، ان سے محمد بن ابراہیم بن حارث نے ، ان سے ابوسلمہ بن عبدالرحمن نے",
        "hadithText": "ان کا ایک دوسرے صاحب سے ایک زمین کے بارے میں جھگڑا تھا ۔ وہ حضرت عائشہ رضی اللہ عنہا کی خدمت میں حاضر ہوئے اور ان سے واقعہ بیان کیا ۔ انہوں نے ( جواب میں ) فرمایا ، ابوسلمہ ! کسی کی زمین ( کے ناحق لینے ) سے بچو ، کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے کہ اگر ایک بالشت کے برابر بھی کسی نے ( زمین کے بارے میں ) ظلم کیا تو ( قیامت کے دن ) سات زمینوں کا طوق اسے پہنایا جائے گا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 129110,
        "last_updated": null
    },
    {
        "urduURN": 4031530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3196,
        "hadithSanad": "ہم سے بشر بن محمد نے بیان کیا ، انہیں عبداللہ بن مبارک نے خبر دی ، انہیں موسیٰ بن عقبہ نے ، انہیں سالم بن عبداللہ بن عمر نے اور ان سے ان کے والد نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جس نے کسی کی زمین میں سے کچھ ناحق لے لیا تو قیامت کے دن اسے سات زمینوں تک دھنسایا جائے گا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 129120,
        "last_updated": null
    },
    {
        "urduURN": 4031540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3197,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، انہوں نے کہا ہم سے عبدالوہاب ثقفی نے بیان کیا ، انہوں نے کہا ہم سے ایوب سختیانی نے بیان کیا ، انہوں نے کہا کہ",
        "hadithText": "ہم سے محمد بن سیرین نے بیان کیا ، ان سے ابوبکرہ کے صاحبزادے ( عبدالرحمن ) نے بیان کیا اور ان سے ابوبکرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، زمانہ گھوم پھر کر اسی حالت پر آ گیا جیسے اس دن تھا جس دن اللہ تعالیٰ نے آسمان اور زمین پیدا کی تھی ۔ سال بارہ مہینوں کا ہوتا ہے ، چار مہینے اس میں سے حرمت کے ہیں ۔ تین تو پے درپے ۔ ذی قعدہ ، ذی الحجہ اور محرم اور ( چوتھا ) رجب مضر جو جمادی الاخریٰ اور شعبان کے بیچ میں پڑتا ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 129130,
        "last_updated": null
    },
    {
        "urduURN": 4031550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3198,
        "hadithSanad": "ہم سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے سعید بن زید بن عمرو بن نفیل رضی اللہ عنہ نے کہ",
        "hadithText": "ارویٰ بنت ابی اوس سے ان کا ایک ( زمین کے ) بارے میں جھگڑا ہوا ۔ جس کے متعلق ارویٰ کہتی تھی کہ سعید نے میری زمین چھین لی ۔ یہ مقدمہ مروان خلیفہ کے یہاں فیصلہ کے لیے گیا جو مدینہ کا حاکم تھا ۔ سعید رضی اللہ عنہ نے کہا بھلا کیا میں ان کا حق دبالوں گا ، میں گواہی دیتا ہوں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے سنا ہے کہ جس نے ایک بالشت زمین بھی ظلم سے کسی کی دبالی تو قیامت کے دن ساتوں زمینوں کا طوق اس کی گردن میں ڈالا جائے گا ۔ ابن ابی الزناد نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد نے بیان کیا ، اور ان سے سعید بن زید رضی اللہ عنہ نے بیان کیا کہ میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں موجود تھے ۔ ( تب آپ صلی اللہ علیہ وسلم نے یہ حدیث بیان فرمائی تھی ) ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 129140,
        "last_updated": null
    },
    {
        "urduURN": 4031560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3199,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے اعمش نے ، ان سے ابراہیم تیمی نے ، ان سے ان کے باپ یزید بن شریک نے اور ان سے ابو ذرغفاری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے جب سورج غروب ہوا تو ان سے پوچھا کہ تم کو معلوم ہے یہ سورج کہاں جاتا ہے ؟ میں نے عرض کی کہ اللہ اور اس کے رسول ہی کو علم ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ جاتا ہے اور عرش کے نیچے پہنچ کر پہلے سجدہ کرتا ہے ۔ پھر ( دوبارہ آنے ) کی اجازت چاہتا ہے اور اسے اجازت دی جاتی ہے اور وہ دن بھی قریب ہے ، جب یہ سجدہ کرے گا تو اس کا سجدہ قبول نہ ہو گا اور اجازت چاہے گا لیکن اجازت نہ ملے گی ۔ بلکہ اس سے کہا جائے گا کہ جہاں سے آیا تھا وہیں واپس چلا جا ۔ چنانچہ اس دن وہ مغربی ہی سے نکلے گا ۔ اللہ تعالیٰ کے فرمان »والشّمس تجری لمستقرٍّ لّہا ذٰلک تقدیر العزیز العلیم « ( یٰس ٓ : 38 ) میں اسی طرف اشارہ ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 129160,
        "last_updated": null
    },
    {
        "urduURN": 4031570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3200,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، انہوں نے کہا ہم سے عبدالعزیز بن مختار نے بیان کیا ، انہوں نے کہا ہم سے عبداللہ بن فیروز داناج نے بیان کیا ، انہوں نے کہا کہ مجھ سے ابوسلمہ بن عبدالرحمن نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، قیامت کے دن سورج اور چاند دونوں تاریک ( بینور ) ہو جائیں گے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 129170,
        "last_updated": null
    },
    {
        "urduURN": 4031580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3201,
        "hadithSanad": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، کہا کہ مجھ سے عبداللہ بن وہب نے بیان کیا ، کہا کہ مجھے عمرو بن حارث نے خبر دی ، ان سے عبدالرحمن بن قاسم نے بیان کیا ، ان سے ان کے باپ قاسم بن محمد بن ابی بکرنے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا",
        "hadithText": "وہ نبی کریم صلی اللہ علیہ وسلم سے نقل کرتے تھے کہ آپ نے فرمایا کہ سورج اور چاند میں کسی کی موت و حیات کی وجہ سے گرہن نہیں لگتا ۔ بلکہ یہ اللہ تعالیٰ کی نشانیوں میں سے ایک نشانی ہیں ۔ اس لیے جب تم ان کو دیکھو تو نماز پڑھا کرو ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 129180,
        "last_updated": null
    },
    {
        "urduURN": 4031590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3202,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے زید بن اسلم نے ، ان سے عطاء بن یسار نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، سورج اور چاند اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں کسی کی موت و حیات سے ان میں گرہن نہیں لگتا ۔ اس لیے جب تم گرہن دیکھو تو اللہ کی یاد میں لگ جایا کرو ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 129190,
        "last_updated": null
    },
    {
        "urduURN": 4031600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3203,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث بن سعد نے کیا ، انہوں نے کہا ہم سے عقیل نے بیان کیا ، ان سے ابن شہاب نے بیان کیا کہ مجھے عروہ نے خبر دی ، اور انہیں ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا نے خبر دی کہ",
        "hadithText": "جس دن سورج گرہن لگا تو رسول اللہ صلی اللہ علیہ وسلم ( مصلے پر ) کھڑے ہوئے ۔ اللہ اکبر کہا اور بڑی دیر تک قرآت کرتے رہے ۔ پھر آپ صلی اللہ علیہ وسلم نے رکوع کیا ، ایک بہت لمبا رکوع ، پھر سر اٹھا کر سمع اللہ لمن حمدہ کہا اور پہلے کی طرح کھڑے ہو گئے ۔ اس قیام میں بھی لمبی قرآت کی ۔ اگرچہ پہلی قرآت سے کم تھی اور پھر رکوع میں چلے گئے اور دیر تک رکوع میں رہے ، اگرچہ پہلے رکوع سے یہ کم تھا ۔ اس کے بعد سجدہ کیا ، ایک لمبا سجدہ ، دوسری رکعت میں بھی آپ صلی اللہ علیہ وسلم نے اسی طرح کیا اور اس کے بعد سلام پھیرا تو سورج صاف ہو چکا تھا ۔ اب آپ صلی اللہ علیہ وسلم نے صحابہ کو خطاب فرمایا اور سورج اور چاند گرہن کے متعلق بتلایا کہ یہ اللہ تعالیٰ کی نشانیوں میں سے نشانی ہیں اور ان میں کسی کی موت و حیات کی وجہ سے گرہن نہیں لگتا ، اس لیے جب تم گرہن دیکھو تو فوراً نماز کی طرف لپک جاؤ ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 129200,
        "last_updated": null
    },
    {
        "urduURN": 4031610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3204,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے اسماعیل ابی خالد نے بیان کیا ، کہا کہ ہم سے قیس بن ابی حازم نے بیان کیا اور ان سے ابومسعود انصاری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، سورج اور چاند میں کسی کی موت یا حیات پر گرہن نہیں لگتا ۔ بلکہ یہ اللہ کی نشانیوں میں سے نشانی ہیں اس لیے جب تم ان میں گرہن دیکھو تو نماز پڑھو ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 129210,
        "last_updated": null
    },
    {
        "urduURN": 4031620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3205,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے حکم نے ، ان سے مجاہد نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ،بادصبا ( مشرقی ہوا ) کے ذریعہ میری مدد کی گئی اور قوم عاد دبور ( مغربی ہوا ) سے ہلاک کر دی گئی تھی ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 129220,
        "last_updated": null
    },
    {
        "urduURN": 4031630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3206,
        "hadithSanad": "ہم سے مکی بن ابراہیم نے بیان کیا ، کہا ہم سے ابن جریج نے ، ان سے عطاء نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم ابر کا کوئی ایسا ٹکڑا دیکھتے جس سے بارش کی امید ہوتی تو آپ کبھی آگے آتے ، کبھی پیچھے جاتے ، کبھی گھر کے اندر تشریف لاتے ، کبھی باہر آ جاتے اور چہرہ مبارک کا رنگ بدل جاتا ۔ لیکن جب بارش ہونے لگتی تو پھر یہ کیفیت باقی نہ رہتی ۔ ایک مرتبہ حضرت عائشہ رضی اللہ عنہا نے اس کے متعلق آپ سے پوچھا ۔ تو آپ نے فرمایا ۔ میں نہیں جانتا ممکن ہے یہ بادل بھی ویسا ہی ہو جس کے بارے میں قوم عاد نے کہا تھا ، جب انہوں نے بادل کو اپنی وادیوں کی طرف آتے دیکھا تھا ۔ آخر آیت تک ( کہ ان کے لیے رحمت کا بادل آیا ہے ، حالانکہ وہ عذاب کا بادل تھا ) ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 129230,
        "last_updated": null
    },
    {
        "urduURN": 4031640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3207,
        "hadithSanad": "ہم سے ہدبۃ بن خالد نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، کہا ہم سے سعید بن ابی عروبہ اور ہشام دستوائی نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا ، کہا ہم سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا اور ان سے مالک بن صعصعہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ میں ایک دفعہ بیت اللہ کے قریب نیند اور بیداری کی درمیانی حالت میں تھا ، پھر آنحضرت صلی اللہ علیہ وسلم نے دو آدمیوں کے درمیان لیٹے ہوئے ایک تیسرے آدمی کا ذکر فرمایا ۔ اس کے بعد میرے پاس سونے کا ایک طشت لایا گیا ، جو حکمت اور ایمان سے بھرپور تھا ۔ میرے سینے کو پیٹ کے آخری حصے تک چاک کیا گیا ۔ پھر میرا پیٹ زمزم کے پانی سے دھویا گیا اور اسے حکمت اور ایمان سے بھر دیا گیا ۔ اس کے بعد میرے پاس ایک سواری لائی گئی ۔ سفید ، خچر سے چھوٹی اور گدھے سے بڑی یعنی براق ، میں اس پر سوار ہو کر جبرائیل علیہ السلام کے ساتھ چلا ۔ جب ہم آسمان دنیا پر پہنچے تو پوچھا گیا کہ یہ کون صاحب ہیں ؟ انہوں نے کہا کہ جبرائیل ۔ پوچھا گیا کہ آپ کے ساتھ اور کون صاحب آئے ہیں ؟ انہوں نے بتایا کہ محمد ( صلی اللہ علیہ وسلم ) پوچھا گیا کہ کیا انہیں بلانے کے لیے آپ کو بھیجا گیا تھا ؟ انہوں نے کہا کہ ہاں ، اس پر جواب آیا کہ اچھی کشادہ جگہ آنے والے کیا ہی مبارک ہیں ، پھر میں آدم علیہ السلام کی خدمت میں حاضر ہوا ۔ اور انہیں سلام کیا ۔ انہوں نے فرمایا ، آو پیارے بیٹے اور اچھے نبی ۔ اس کے بعد ہم دوسرے آسمان پر پہنچے یہاں بھی وہی سوال ہوا ۔ کون صاحب ہیں ؟ کہا جبرائیل ، سوال ہوا ، آپ کے ساتھ کوئی اور صاحب بھی آئے ہیں ؟ کہا کہ محمد صلی اللہ علیہ وسلم ، سوال ہوا انہیں بلانے کے لیے آپ کو بھیجا گیا تھا ؟ کہا کہ ہاں ۔ اب ادھر سے جواب آیا ، اچھی کشادہ جگہ آئے ہیں ، آنے والے کیا ہی مبارک ہیں ۔ اس کے بعد میں عیسیٰ اور یحییٰ علیہ السلام سے ملا ، ان حضرات نے بھی خوش آمدید ، مرحبا کہا اپنے بھائی اور نبی کو ۔ پھر ہم تیسرے آسمان پر آئے یہاں بھی سوال ہوا کون صاحب ہیں ؟ جواب ملا جبرائیل ، سوال ہوا ، آپ کے ساتھ بھی کوئی ہے ؟ کہا کہ محمد صلی اللہ علیہ وسلم ، سوال ہوا ، انہیں بلانے کے لیے آپ کو بھیجا گیا تھا ؟ انہوں نے بتایا کہ ہاں ، اب آواز آئی اچھی کشادہ جگہ آئے آنے والے کیا ہی صالح ہیں ، یہاں یوسف علیہ السلام سے میں ملا اور انہیں سلام کیا ، انہوں نے فرمایا ، اچھی کشادہ جگہ آئے ہو میرے بھائی اور نبی ، یہاں سے ہم چوتھے آسمان پر آئے اس پر بھی یہی سوال ہوا ، کون صاحب ، جواب دیا کہ جبرائیل ، سوال ہوا ، آپ کے ساتھ اور کون صاحب ہیں ؟ کہا کہ محمد صلی اللہ علیہ وسلم ہیں ۔ پوچھا کیا انہیں لانے کے لیے آپ کو بھیجا گیا تھا ، جواب دیا کہ ہاں ، پھر آواز آئی ، اچھی کشادہ جگہ آئے کیا ہی اچھے آنے والے ہیں ۔ یہاں میں ادریس علیہ السلام سے ملا اور سلام کیا ، انہوں نے فرمایا ، مرحبا ، بھائی اور نبی ۔ یہاں سے ہم پانچویں آسمان پر آئے ۔ یہاں بھی سوال ہوا کہ کون صاحب ؟ جواب دیا کہ جبرائیل ، پوچھا گیا اور آپ کے ساتھ اور کون صاحب آئے ہیں ؟ جواب دیا کہ محمد صلی اللہ علیہ وسلم ، پوچھا گیا ، انہیں بلانے کے لیے بھیجا گیا تھا ؟ کہا کہ ہاں ، آواز آئی ، اچھی کشادہ جگہ آئے ہیں ۔ آنے والے کیا ہی اچھے ہیں ۔ یہاں ہم ہارون علیہ السلام سے ملے اور میں نے انہیں سلام کیا ۔ انہوں نے فرمایا ، مبارک میرے بھائی اور نبی ، تم اچھی کشادہ جگہ آئے ، یہاں سے ہم چھٹے آسمان پر آئے ، یہاں بھی سوال ہوا ، کون صاحب ؟ جواب دیا کہ جبرائیل ، پوچھا گیا ، آپ کے ساتھ اور بھی کوئی ہیں ؟ کہا کہ ہاں محمد صلی اللہ علیہ وسلم ہیں ۔ پوچھا گیا ، کیا انہیں بلایاگیا تھا کہا ہاں ، کہا اچھی کشادہ جگہ آئے ہیں ، اچھے آنے والے ہیں ۔ یہاں میں موسیٰ علیہ السلام سے ملا اور انہیں سلام کیا ۔ انہوں نے فرمایا ، میرے بھائی اور نبی اچھی کشادہ جگہ آئے ، جب میں وہاں سے آگے بڑھنے لگا تو وہ رونے لگے کسی نے پوچھا بزرگوار آپ کیوں رو رہے ہیں ؟ انہوں نے فرمایا کہ اے اللہ ! یہ نوجوان جسے میرے بعد نبوت دی گئی ، اس کی امت میں سے جنت میں داخل ہونے والے ، میری امت کے جنت میں داخل ہونے والے لوگوں سے زیادہ ہوں گے ۔ اس کے بعد ہم ساتویں آسمان پر آئے یہاں بھی سوال ہوا کہ کون صاحب ہیں ؟ جواب دیا کہ جبرائیل ، سوال ہوا کہ کوئی صاحب آپ کے ساتھ بھی ہیں ؟ جواب دیا کہ محمد صلی اللہ علیہ وسلم پوچھا ، انہیں بلانے کے لیے آپ کو بھیجا گیا تھا ؟ مرحبا ، اچھے آنے والے ۔ یہاں میں ابراہیم علیہ السلام سے ملا اور انہیں سلام کیا ۔ انہوں نے فرمایا میرے بیٹے اور نبی ، مبارک ، اچھی کشادہ جگہ آئے ہو ، اس کے بعد مجھے بیت المعمور دکھایا گیا ۔ میں نے جبرائیل علیہ السلام سے اس کے بارے میں پوچھا ، تو انہوں نے بتلایا کہ یہ بیت المعمور ہے ۔ اس میں ستر ہزار فرشتے روزانہ نماز پڑھتے ہیں ۔ اور ایک مرتبہ پڑھ کر جو اس سے نکل جاتا ہے تو پھر کبھی داخل نہیں ہوتا ۔ اور مجھے سدرۃالمنتہیٰ بھی دکھایا گیا ، اس کے پھل ایسے تھے جیسے مقام ہجر کے مٹکے ہوتے ہیں اور پتے ایسے تھے جیسے ہاتھی کے کان ، اس کی جڑ سے چار نہریں نکلتی تھیں ، دو نہریں تو باطنی تھیں اور دو ظاہری ، میں نے جبرائیل علیہ السلام سے پوچھا تو انہوں نے بتایا کہ جو دو باطنی نہریں ہیں وہ تو جنت میں ہیں اور دو ظاہری نہریں دنیا میں نیل اور فرات ہیں ، اس کے بعد مجھ پر پچاس وقت کی نمازیں فرض کی گئیں ۔ میں جب واپس ہوا اور موسیٰ علیہ السلام سے ملا تو انہوں نے پوچھا کہ کیا کر کے آئے ہو ؟ میں نے عرض کیا کہ پچاس نمازیں مجھ پر فرض کی گئی ہیں ۔ انہوں نے فرمایا کہ انسانوں کو میں تم سے زیادہ جانتا ہوں ، بنی اسرائیل کا مجھے برا تجربہ ہو چکا ہے ۔ تمہاری امت بھی اتنی نمازوں کی طاقت نہیں رکھتی ، اس لیے اپنے رب کی بارگاہ میں دوبارہ حاضری دو ، اور کچھ تخفیف کی درخواست کرو ، میں واپس ہوا تو اللہ تعالیٰ نے نمازیں چالیس وقت کی کر دیں ۔ پھر بھی موسیٰ علیہ السلام اپنی بات ( یعنی تخفیف کرانے ) پر مصر رہے ۔ اس مرتبہ تیس وقت کی رہ گئیں ۔ پھر انہوں نے وہی فرمایا اور اس مرتبہ بارگاہ رب العزت میں میری درخواست کی پیشی پر اللہ تعالیٰ نے انہیں دس کر دیا ۔ میں جب موسیٰ علیہ السلام کے پاس آیا تو اب بھی انہوں نے کم کرانے کے لیے اپنا اصرار جاری رکھا ۔ اور اس مرتبہ اللہ تعالیٰ نے پانچ وقت کی کر دیں ۔ اب موسیٰ علیہ السلام سے ملا ، تو انہوں نے پھر دریافت فرمایا کہ کیا ہوا ؟ میں نے کہا کہ اللہ تعالیٰ نے پانچ کر دی ہیں ۔ اس مرتبہ بھی انہوں نے کم کرانے کا اصرار کیا ۔ میں نے کہا کہ اب تو میں اللہ کے سپرد کر چکا ۔ پھر آواز آئی ۔ میں نے اپنا فریضہ ( پانچ نمازوں کا ) جاری کر دیا ۔ اپنے بندوں پر تخفیف کر چکا اور میں ایک نیکی کا بدلہ دس گنا دیتا ہوں ۔ اور ہمام نے کہا ، ان سے قتادہ نے کہا ، ان سے حسن نے ، ان سے ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے بیت المعمور کے بارے میں الگ روایت کی ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 129240,
        "last_updated": null
    },
    {
        "urduURN": 4031650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3208,
        "hadithSanad": "ہم سے حسن بن ربیع نے بیان کیا ، کہا ہم سے ابوالاحوص نے ، ان سے اعمش نے ، ان سے زید بن وہب نے اور ان سے عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم سے صادق المصدوق رسول اللہ صلی اللہ علیہ وسلم نے بیان فرمایا اور فرمایا کہ تمہاری پیدائش کی تیاری تمہاری ماں کے پیٹ میں چالیس دنوں تک ( نطفہ کی صورت ) میں کی جاتی ہے اتنی ہی دنوں تک پھر ایک بستہ خون کے صورت میں اختیار کئے رہتا ہے اور پھر وہ اتنے ہی دنوں تک ایک مضغہ گوشت رہتا ہے ۔ اس کے بعد اللہ تعالیٰ ایک فرشتہ بھیجتا ہے اور اسے چار باتوں ( کے لکھنے ) کا حکم دیتا ہے ۔ اس سے کہا جاتا ہے کہ اس کے عمل ، اس کا رزق ، اس کی مدت زندگی اور یہ کہ بد ہے یا نیک ، لکھ لے ۔ اب اس نطفہ میں روح ڈالی جاتی ہے ( یاد رکھ ) ایک شخص ( زندگی بھر نیک ) عمل کرتا رہتا ہے اور جب جنت اور اس کے درمیان صرف ایک ہاتھ کا فاصلہ رہ جاتا ہے تو اس کی تقدیر سامنے آ جاتی ہے اور دوزخ والوں کے عمل شروع کر دیتا ہے ۔ اسی طرح ایک شخص ( زندگی بھر برے ) کام کرتا رہتا ہے اور جب دوزخ اور اس کے درمیان صرف ایک ہاتھ کا فاصلہ رہ جاتا ہے تو اس کی تقدیر غالب آ جاتی ہے اور جنت والوں کے کام شروع کر دیتا ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 129250,
        "last_updated": null
    },
    {
        "urduURN": 4031660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3209,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو مخلد نے خبر دی ، انہیں ابن جریج نے خبر دی ، کہا کہ مجھے موسیٰ بن عقبہ نے خبر دی ، انہیں نافع نے ، انہوں نے بیان کیا کہ",
        "hadithText": "ابوہریرہ رضی اللہ عنہ نے کہا نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ اور اس روایت کی متابعت ابوعاصم نے ابن جریج سے کی ہے کہ مجھے موسیٰ بن عقبہ نے خبر دی انہیں نافع نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جب اللہ تعالیٰ کسی بندے سے محبت کرتا ہے تو جبرائیل علیہ السلام سے فرماتا ہے کہ اللہ تعالیٰ فلاں شخص سے محبت کرتا ہے ۔ تم بھی اس سے محبت رکھو ، چنانچہ جبرائیل علیہ السلام بھی اس سے محبت رکھنے لگتے ہیں ۔ پھر جبرائیل علیہ السلام تمام اہل آسمان کو پکار دیتے ہیں کہ اللہ تعالیٰ فلاں شخص سے محبت رکھتا ہے ۔ اس لیے تم سب لوگ اس سے محبت رکھو ، چنانچہ تمام آسمان والے اس سے محبت رکھنے لگتے ہیں ۔ اس کے بعد روئے زمین والے بھی اس کو مقبول سمجھتے ہیں ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 129260,
        "last_updated": null
    },
    {
        "urduURN": 4031670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3210,
        "hadithSanad": "ہم سے محمد نے بیان کیا ، انہوں نے کہا ہم سے ابن ابی مریم نے بیان کیا ، انہوں نے کہا کہ ہمیں لیث نے خبر دی ، ان سے ابن ابی جعفر نے بیان کیا ، ان سے محمد بن عبدالرحمن نے بیان کیا ، ان سے عروہ بن زبیر نے بیان کیا اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ عائشہ صدیقہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ۔ آپ نے فرمایا تھا کہ فرشتے عنان میں اترتے ہیں ۔ اور عنان سے مراد بادل ہیں ۔ یہاں فرشتے ان کاموں کا ذکر کرتے ہیں جن کا فیصلہ آسمان میں ہو چکا ہوتا ہے ۔ اور یہیں سے شیاطین کچھ چوری چھپے باتیں اڑا لیتے ہیں ۔ پھر کاہنوں کو اس کی خبر کر دیتے ہیں اور یہ کاہن سو جھوٹ اپنی طرف سے ملا کر اسے بیان کرتے ہیں ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 129270,
        "last_updated": null
    },
    {
        "urduURN": 4031680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3211,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے ابوسلمہ اور اغرنے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب جمعہ کا دن آتا ہے تو مسجد کے ہر دروازے پر فرشتے کھڑے ہو جاتے ہیں اور سب سے پہلے آنے والے اور پھر اس کے بعد آنے والوں کو نمبر وار لکھتے جاتے ہیں ۔ پھر جب امام ( خطبے کے لیے منبر پر ) بیٹھ جاتا ہے تو یہ فرشتے اپنے رجسٹر بند کر لیتے ہیں اور ذکر سننے لگ جاتے ہیں ۔ ( یہ حدیث کتاب الجمعہ میں مذکور ہو چکی ہے یہاں فرشتوں کا وجود ثابت کرنا مقصود ہے )</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 129280,
        "last_updated": null
    },
    {
        "urduURN": 4031690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3212,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا ہم سے زہری نے بیان کیا ، ان سے سعید بن مسیب نے بیان کیا کہ",
        "hadithText": "عمر بن خطاب رضی اللہ عنہ مسجد میں تشریف لائے تو حسان رضی اللہ عنہ نے کہا کہ میں اس وقت یہاں شعر پڑھا کرتا تھا جب آپ سے بہتر شخص ( آنحضرت صلی اللہ علیہ وسلم ) یہاں تشریف رکھتے تھے ۔ پھر حضرت حسان رضی اللہ عنہ حضرت ابوہریرہ رضی اللہ عنہ کی طرف متوجہ ہوئے اور کہا کہ میں تم سے اللہ کا واسطہ دے کر پوچھتا ہو کیا رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے تم نے نہیں سنا تھا کہ اے حسان ! ( کفار مکہ کو ) میری طرف سے جواب دے ۔ اے اللہ ! روح القدس کے ذریعہ حسان کی مدد کر ۔ ابوہریرہ رضی اللہ عنہ نے کہا کہ ہاں بیشک ( میں نے سنا تھا ) ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 129290,
        "last_updated": null
    },
    {
        "urduURN": 4031700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3213,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عدی بن ثابت نے اور ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے حسان رضی اللہ عنہ سے فرمایا ، مشرکین مکہ کی تم بھی ہجو کو یا ( یہ فرمایا کہ ) ان کی ہجو کا جواب دو ، جبرائیل تمہارے ساتھ ہیں ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 129300,
        "last_updated": null
    },
    {
        "urduURN": 4031710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3214,
        "hadithSanad": "ہم سے اسحاق نے بیان کیا ، کہا ہم کووہب بن جریر نے خبر دی ، ان سے میرے والد نے بیان کیا ، انہوں نے کہا کہ میں نے حمید بن ہلال سے سنا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جیسے وہ غبار میری نظروں کے سامنے ہے ۔ موسیٰ نے روایت میں یوں زیادتی کی کہ ” حضرت جبرائیل علیہ السلام کے ( ساتھ آنے والے ) سوار فرشتوں کی وجہ سے ۔ ‘ ‘ جو غبار خاندان بنوغنم کی گلی سے اٹھا تھا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 129310,
        "last_updated": null
    },
    {
        "urduURN": 4031720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3215,
        "hadithSanad": "ہم سے فروہ بن ابی المغراء نے بیان کیا ، کہا ہم سے علی بن مسہر نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے باپ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "حارث بن ہشام رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا کہ وحی آپ کے پاس کس طرح آتی ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ کئی طرح سے آتی ہے ۔ کبھی فرشتہ کے ذریعہ آتی ہے تو وہ گھنٹی بجنے کی آواز کی طرح نازل ہوتی ہے ۔ جب وحی ختم ہو جاتی ہے تو جو کچھ فرشتے نے نازل کیا ہوتا ہے ، میں اسے پوری طرح یاد کر چکا ہوتا ہوں ۔ وحی اترنے کی یہ صورت میرے لیے بہت دشوار ہوتی ہے ۔ کبھی فرشتہ میرے سامنے ایک مرد کی صورت میں آ جاتا ہے وہ مجھ سے باتیں کرتا ہے اور جو کچھ کہہ جاتا ہے میں اسے پوری طرح یاد کر لیتا ہوں ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 129320,
        "last_updated": null
    },
    {
        "urduURN": 4031730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3216,
        "hadithSanad": "ہم سے ادم بن ابی ایاس نے بیان کیا ، کہا ہم سے شیبان نے بیان کیا ، ان سے یحییٰ بن ابی کثیر نے بیا کیا ، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے کہ اللہ کے راستے میں جو شخص کسی چیز کا بھی جوڑا دے ، تو جنت کے چوکیدار فرشتے اسے بلائیں گے کہ فلاں اس دروازے سے اندر آ جا ۔ ابوبکر رضی اللہ عنہ نے اس پر کہا کہ یہ تو وہ شخص ہو گا جسے کوئی نقصان نہ ہو گا ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ مجھے امید ہے کہ تو بھی انہیں میں سے ہو گا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 129330,
        "last_updated": null
    },
    {
        "urduURN": 4031740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3217,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے ہشام نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں ابوسلمہ نے اور انہیں عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک مرتبہ فرمایا ” اے عائشہ ! یہ جبرائیل علیہ السلام آئے ہیں ، تم کو سلام کہہ رہے ہیں ۔ ‘ ‘ عائشہ رضی اللہ عنہا نے جواب میں کہا ، کہ وعلیہ السلام ورحمۃ اللہ وبرکاتہ ۔ آپ وہ چیزیں دیکھتے ہیں جنہیں میں نہیں دیکھ سکتی ، عائشہ رضی اللہ عنہا کی مراد نبی کریم صلی اللہ علیہ وسلم سے تھی ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 129340,
        "last_updated": null
    },
    {
        "urduURN": 4031750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3218,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے عمر بن ذر نے بیان کیا ( دوسری سند ) امام بخاری نے کہا کہ مجھ سے یحییٰ بن جعفر نے بیان کیا ، کہا ہم سے وکیع نے بیان کیا ، ان سے عمر بن ذر نے ، ان سے ان کے والد نے ، ان سے سعید بن جبیر نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے حضرت جبرائیل علیہ السلام سے ایک مرتبہ فرمایا ، ہم سے ملاقات کے لیے جتنی مرتبہ آپ آتے ہیں اس سے زیادہ کیوں نہیں آتے ؟ بیان کیا کہ اس پر یہ آیت نازل ہوئی ” اور ہم نہیں اترتے لیکن تیرے رب کے حکم سے ، اسی کا ہے جو کچھ کہ ہمارے سامنے ہے اور جو کچھ ہمارے پیچھے ہے ‘ ‘ آخر آیت تک ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 129350,
        "last_updated": null
    },
    {
        "urduURN": 4031760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3219,
        "hadithSanad": "ہم سے اسماعیل بن ابی ادریس نے بیان کیا ، کہا کہ مجھ سے سلیمان بن بلال نے بیان کیا ، ان سے یونس بن یزید نے ، ان سے ابن شہاب زبیری نے ، ان سے عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جبرائیل علیہ السلام نے قرآن مجید مجھے ( عرب کے ) ایک ہی محاورے کے مطابق پڑھ کر سکھایا تھا ، لیکن میں اس میں برابر اضافہ کی خواہش کا اظہار کرتا رہا ، تاآنکہ عرب کے سات محاوروں پر اس کا نزول ہوا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 129360,
        "last_updated": null
    },
    {
        "urduURN": 4031770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3220,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو یونس نے خبر دی ، ان سے زہری نے بیان کیا ، کہا مجھ سے عبیداللہ بن عبداللہ نے بیان کیا اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم سب سے زیادہ سخی تھے اور آپ کی سخاوت رمضان شریف کے مہینے میں اور بڑھ جاتی ، جب حضرت جبرائیل علیہ السلام آپ سے ملاقات کے لیے ہر روز آنے لگتے ۔ حضرت جبرائیل علیہ السلام آپ صلی اللہ علیہ وسلم سے رمضان کی ہر رات میں ملاقات کے لیے آتے اور آپ سے قرآن کا دور کیا کرتے تھے ۔ آنحضرت صلی اللہ علیہ وسلم خصوصاً اس دور میں جب حضرت جبرائیل علیہ السلام روزانہ آپ سے ملاقات کے لیے آتے تو آپ خیرات و برکات میں تیز چلنے والی ہوا سے بھی زیادہ سخی ہو جاتے تھے اور عبداللہ بن مبارک سے روایت ہے ، ان سے معمر نے اسی اسناد کے ساتھ اسی طرح بیان کیا اور حضرت ابوہریرہ رضی اللہ عنہ اور حضرت فاطمہ رضی اللہ عنہا نے نقل کیا نبی کریم صلی اللہ علیہ وسلم سے کہ حضرت جبرائیل علیہ السلام آنحضرت صلی اللہ علیہ وسلم کے ساتھ قرآن مجید کا دور کیا کرتے تھے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 129370,
        "last_updated": null
    },
    {
        "urduURN": 4031780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3221,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا",
        "hadithText": "ان سے ابن شہاب نے حضرت عمر بن عبدالعزیز رحمہ اللہ نے ایک دن عصر کی نماز کچھ دیر کر کے پڑھائی ۔ اس پر عروہ بن زبیر رحمہ اللہ نے ان سے کہا ۔ لیکن جبرائیل علیہ السلام ( نماز کا طریقہ آنحضرت صلی اللہ علیہ وسلم کو سکھانے کے لیے ) نازل ہوئے اور رسول اللہ صلی اللہ علیہ وسلم کے آگے ہو کر آپ کو نماز پڑھائی ۔ حضرت عمرو بن عبدالعزیز نے کہا ، عروہ ! آپ کو معلوم بھی ہے آپ کیا کہہ رہے ہیں ؟ عروہ نے کہا کہ ( اور سن لو ) میں نے بشیر بن ابی مسعود سے سنا اور انہوں نے ابومسعود رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے کہ حضرت جبرائیل علیہ السلام نازل ہوئے اور انہوں نے مجھے نماز پڑھائی ۔ میں نے ان کے ساتھ نماز پڑھی ، پھر ( دوسرے وقت کی ) ان کے ساتھ میں نے نماز پڑھی ، پھر ان کے ساتھ میں نے نماز پڑھی ، پھر میں نے ان کے ساتھ نماز پڑھی ، پھر میں نے ان کے ساتھ نماز پڑھی ، اپنی انگلیوں پر آپ نے پانچوں نمازوں کو گن کر بتایا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 129380,
        "last_updated": null
    },
    {
        "urduURN": 4031790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3222,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے ابن ابی عدی نے بیان کیا ، ان سے شعبہ نے ، ان سے حبیب بن ابی ثابت نے ، ان سے زید بن وہب نے اور ان سے ابوذر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جبرائیل علیہ السلام کہہ گئے ہیں کہ تمہاری امت کا جو آدمی اس حالت میں مرے گا کہ وہ اللہ تعالیٰ کے ساتھ کسی کو شریک نہ ٹھہراتا رہا ہو گا ، تو وہ جنت میں داخل ہو گا یا ( آپ نے یہ فرمایا کہ ) جہنم میں داخل نہیں ہو گا ۔ خواہ اس نے اپنی زندگی میں زنا کیا ہو ، خواہ چوری کی ہو ، اور خواہ زنا اور چوری کرتا ہو ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 129390,
        "last_updated": null
    },
    {
        "urduURN": 4031800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3223,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، کہا ہم سے ابوالزناد نے بیان کیا ، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ فرشتے آگے پیچھے زمین پر آتے جاتے رہتے ہیں ، کچھ فرشتے رات کے ہیں اور کچھ دن کے اور یہ سب فجر اور عصر کی نماز میں جمع ہو جاتے ہیں ۔ پھر وہ فرشتے جو تمہارے یہاں رات میں رہے ۔ اللہ کے حضور میں جاتے ہیں ، اللہ تعالیٰ ان سے دریافت فرماتا ہے .... حالانکہ وہ سب سے زیادہ جاننے والا ہے ۔ ۔ ۔ کہ تم نے میرے بندوں کو کس حال میں چھوڑا ، وہ فرشتے عرض کرتے ہیں کہ جب ہم نے انہیں چھوڑا تو وہ ( فجر کی ) نماز پڑھ رہے تھے ۔ اور اسی طرح جب ہم ان کے یہاں گئے تھے ، جب بھی وہ ( عصر ) کی نماز پڑھ رہے تھے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 129400,
        "last_updated": null
    },
    {
        "urduURN": 4031810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3224,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو مخلد بن یزید نے خبر دی ، کہا ہم کو ابن جریج نے خبر دی ، انہیں اسماعیل بن امیہ نے ، ان سے نافع نے بیان کیا ، ان سے قاسم بن محمد نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم کے لیے ایک تکیہ بھرا ، جس پر تصویریں بنی ہوئی تھیں ۔ وہ ایسا ہو گیا جیسے نقشی تکیہ ہوتا ہے ۔ پھر آنحضرت صلی اللہ علیہ وسلم تشریف لائے تو دروازے پر کھڑے ہو گئے اور آپ کے چہرے کا رنگ بدلنے لگا ۔ میں نے عرض کیا ، یا رسول اللہ صلی اللہ علیہ وسلم ! ہم سے کیا غلطی ہوئی ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ تکیہ کیسا ہے ؟ میں نے عرض کیا ، یہ تو میں نے آپ کے لیے بنایا ہے تاکہ آپ اس پر ٹیک لگا سکیں ۔ اس پر آپ نے فرمایا ، کیا تمہیں نہیں معلوم کہ فرشتے اس گھر میں داخل نہیں ہوتے جس میں کوئی تصویر ہوتی ہے اور یہ کہ جو شخص بھی تصویر بنائے گا ، قیامت کے دن اسے اس پر عذاب دیا جائے گا ۔ اس سے کہا جائے گا کہ جس کی مورت تو نے بنائی ، اب اسے زندہ بھی کر کے دکھا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 129410,
        "last_updated": null
    },
    {
        "urduURN": 4031820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3225,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، انہیں معمر نے خبر دی ، انہیں زہری نے ، انہیں عبیداللہ بن عبداللہ نے ، اور انہوں نے ابن عباس رضی اللہ عنہما سے سنا ، وہ کہتے تھے کہ",
        "hadithText": "میں نے ابوطلحہ رضی اللہ عنہ سے سنا ، وہ کہتے تھے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا کہ فرشتے اس گھر میں داخل نہیں ہوتے جس میں کتے ہوں اور اس میں بھی نہیں جس میں جاندار کی تصویر ہو ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 129420,
        "last_updated": null
    },
    {
        "urduURN": 4031830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3226,
        "hadithSanad": "ہم سے احمد بن صالح نے بیان کیا ، کہا ہم سے عبداللہ بن وہب نے بیان کیا ، کہا ہم کو عمرو بن حارث نے خبر دی ، ان سے بکیر بن اشج نے بیان کیا ، ان سے بسر بن سعید نے بیان کیا اور ان سے زید بن خالد جہنی رضی اللہ عنہ نے بیان کیا",
        "hadithText": "اور ( راوی حدیث ) بسر بن سعید کے ساتھ عبیداللہ خولانی بھی روایت حدیث میں شریک ہیں ، جو کہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ میمونہ رضی اللہ عنہا کی پرورش میں تھے ۔ ان دونوں سے زید بن خالد جہنی رضی اللہ عنہ نے بیان کیا کہ ان سے ابوطلحہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، فرشتے اس گھر میں نہیں داخل ہوتے جس میں ( جاندار کی ) تصویر ہو ۔ بسر نے بیان کیا کہ پھر زید بن خالد رضی اللہ عنہ بیمار پڑے اور ہم ان کی عیادت کے لیے ان کے گھر گئے ۔ گھر میں ایک پردہ پڑا ہوا تھا اور اس پر تصویریں بنی ہوئی تھیں ۔ میں نے عبیداللہ خولانی سے کہا ، کیا انہوں نے ہم سے تصویریوں کے متعلق ایک حدیث نہیں بیان کی تھی ؟ انہوں نے بتایا کہ حضرت زید رضی اللہ عنہ نے یہ بھی کہا تھا کہ کپڑے پر اگر نقش و نگار ہوں ( جاندار کی تصویر نہ ہو ) تو وہ اس حکم سے الگ ہے ۔ کیا آپ نے حدیث کا یہ حصہ نہیں سنا تھا ؟ میں نے کہا کہ نہیں ۔ انہوں نے بتایا کہ جی ہاں ! حضرت زید نے یہ بھی بیان کیا تھا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 129430,
        "last_updated": null
    },
    {
        "urduURN": 4031840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3227,
        "hadithSanad": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، کہا کہ مجھ سے عبداللہ بن وہب نے بیان کیا ، کہا کہ مجھ سے عمرونے بیان کیا ، ان سے سالم نے اور ان سے ان کے باپ عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ایک مرتبہ نبی کریم صلی اللہ علیہ وسلم سے جبرائیل علیہ السلام نے آنے کا وعدہ کیا تھا ( لیکن نہیں آئے ) پھر جب آئے تو آنحضرت صلی اللہ علیہ وسلم نے ان سے وجہ پوچھی ، انہوں نے کہا کہ ہم کسی بھی ایسے گھر میں داخل نہیں ہوتے جس میں تصویر یا کتا موجود ہو ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 129440,
        "last_updated": null
    },
    {
        "urduURN": 4031850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3228,
        "hadithSanad": "ہم سے اسماعیل بن ادریس نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے سمی نے بیان کیا ، ان سے ابوصالح نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جب ( نماز میں ) امام کہے کہ سمع اللہ لمن حمدہ تو تم کہا کرو اللہم ربنا لک الحمد کیونکہ جس کا ذکر ملائکہ کے ساتھ موافق ہو جاتا ہے اس کے پچھلے گناہ معاف ہو جاتے ہیں ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 129450,
        "last_updated": null
    },
    {
        "urduURN": 4031860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3229,
        "hadithSanad": "ہم سے ابراہیم بن المنذر نے بیان کیا ، کہا ہم سے محمد بن فلیح نے بیان کیا ، ان سے میرے باپ نے بیان کیا ، ان سے ہلال بن علی نے ، ان سے عبدالرحمن بن ابی عمرہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کوئی شخص نماز کی وجہ سے جب تک کہیں ٹھہرا رہے گا اس کا یہ سارا وقت نماز میں شمار ہو گا اور ملائکہ اس کے لیے یہ دعا کرتے رہیں گے کہ اے اللہ ! اس کی مغفرت فرما ، اور اس پر اپنی رحمت نازل کر ( اس وقت تک ) جب تک وہ نماز سے فارغ ہو کر اپنی جگہ سے اٹھ نہ جائے یا بات نہ کرے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 129460,
        "last_updated": null
    },
    {
        "urduURN": 4031870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3230,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے ، ان سے عطاء بن ابی رباح نے ، ان سے صفوان بن یعلیٰ نے اور ان سے ان کے والد ( یعلیٰ بن امیہ رضی اللہ عنہ ) نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ۔ آپ منبر پر سورۃ الاحزاب کی اس آیت کی تلاوت فرما رہے تھے » ونادوا یا مالک « اور وہ دوزخی پکاریں گی اے مالک ! ( یہ داروغہ جہنم کا نام ہے ) اور سفیان نے کہا کہ عبداللہ بن مسعود رضی اللہ عنہما کی رات میں یوں ہے » ونادوا یا مال « ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 129470,
        "last_updated": null
    },
    {
        "urduURN": 4031880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3231,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو عبداللہ بن وہب نے خبر دی ، کہا کہ مجھے یونس نے خبر دی ، ان سے ابن شہاب نے کہا ، ان سے عروہ نے کہا اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا نے کہا کہ",
        "hadithText": "انہوں نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا ، کیا آپ پر کوئی دن احد کے دن سے بھی زیادہ سخت گزرا ہے ؟ آپ صلی اللہ علیہ وسلم نے اس پر فرمایا کہ تمہاری قوم ( قریش ) کی طرف سے میں نے کتنی مصیبتیں اٹھائی ہیں لیکن اس سارے دور میں عقبہ کا دن مجھ پر سب سے زیادہ سخت تھا یہ وہ موقع تھا جب میں نے ( طائف کے سردار ) کنانہ بن عبد یالیل بن عبد کلال کے ہاں اپنے آپ کو پیش کیا تھا ۔ لیکن اس نے ( اسلام کو قبول نہیں کیا اور ) میری دعوت کو رد کر دیا ۔ میں وہاں سے انتہائی رنجیدہ ہو کر واپس ہوا ۔ پھر جب میں قرن الثعالب پہنچا ، تب مجھ کو کچھ ہوش آیا ، میں نے اپنا سر اٹھایا تو کیا دیکھتا ہوں کہ بدلی کا ایک ٹکڑا میرے اوپر سایہ کئے ہوئے ہے اور میں نے دیکھا کہ حضرت جبرائیل علیہ السلام اس میں موجود ہیں ، انہوں نے مجھے آواز دی اور کہا کہ اللہ تعالیٰ آپ کے بارے میں آپ کی قوم کی باتیں سن چکا اور جو انہوں نے رد کیا ہے وہ بھی سن چکا ۔ آپ کے پاس اللہ تعالیٰ نے پہاڑوں کا فرشتہ بھیجا ہے ، آپ ان کے بارے میں جو چاہیں اس کا اسے حکم دے دیں ۔ اس کے بعد مجھے پہاڑوں کے فرشتے نے آواز دی ، انہوں نے مجھے سلام کیا اور کہا کہ اے محمد صلی اللہ علیہ وسلم ! پھر انہیں نے بھی وہی بات کہی ، آپ جو چاہیں ( اس کا مجھے حکم فرمائیں ) اگر آپ چاہیں تو میں دونوں طرف کے پہاڑ ان پر لا کر ملا دوں ( جن سے وہ چکنا چور ہو جائیں ) نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، مجھے تو اس کی امید ہے کہ اللہ تعالیٰ ان کی نسل سے ایسی اولاد پیدا کرے گا جو اکیلے اللہ کی عبادت کرے گی ، اور اس کے ساتھ کسی کو شریک نہ ٹھہرائے گی ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 129480,
        "last_updated": null
    },
    {
        "urduURN": 4031890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3232,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے ابوعوانہ نے بیان کیا ، کہا ہم سے ابواسحاق شیبانی نے بیان کیا ، کہا کہ",
        "hadithText": "میں نے زر بن حبیش سے اللہ تعالیٰ کے ( سورۃ النجم میں ) ارشاد » فکان قاب قوسین اوادنیٰ فاوحیٰ الی عبدہ ما اوحیٰ « کے متعلق پوچھا ، تو انہوں نے بیان کیا کہ ہم سے ابن مسعود رضی اللہ عنہما نے بیان کیا تھا کہ آنحضرت صلی اللہ علیہ وسلم نے جبرائیل علیہ السلام کو ( اپنی اصلی صورت میں ) دیکھا ، تو ان کے چھ سو بازو تھے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 129490,
        "last_updated": null
    },
    {
        "urduURN": 4031900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3233,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے اعمش نے ، ان سے ابراہیم نے ، ان سے علقمہ نے اور ان سے عبداللہ رضی اللہ عنہ نے",
        "hadithText": "( اللہ تعالیٰ کے ارشاد ) » لقد رای من ایات ربہ الکبریٰ « کے متعلق بتلایا کہ آنحضرت صلی اللہ علیہ وسلم نے ایک سبز رنگ کا بچھونا دیکھا تھا جو آسمان میں سارے کناروں کو گھیرے ہوئے تھا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 129500,
        "last_updated": null
    },
    {
        "urduURN": 4031910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3234,
        "hadithSanad": "ہم سے محمد بن عبداللہ بن اسماعیل نے بیان کیا ، کہا ہم سے محمد بن عبداللہ انصاری نے بیان کیا ، ان سے ابن عون نے ، کہا ہم کو قاسم نے خبر دی اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "جس نے یہ گمان کیا کہ حضرت محمد صلی اللہ علیہ وسلم نے اپنے رب کو دیکھا تھا تو اس نے بڑی جھوٹی بات زبان سے نکالی ، لیکن آپ صلی اللہ علیہ وسلم نے جبرائیل علیہ السلام کو ( معراج کی رات میں ) ان کی اصل صورت میں دیکھا تھا ۔ ان کے وجود نے آسمان کا کنارہ ڈھانپ لیا تھا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 129510,
        "last_updated": null
    },
    {
        "urduURN": 4031920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3235,
        "hadithSanad": "مجھ سے محمد بن یوسف نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، کہا ہم سے زکریابن ابی زائدہ نے بیان کیا ، ان سے سعید بن الاشوع نے ، ان سے شعبی نے اور ان سے مسروق نے بیان کیا کہ",
        "hadithText": "میں نے حضرت عائشہ رضی اللہ عنہا سے پوچھا ( ان کے اس کہنے پر کہ آنحضرت صلی اللہ علیہ وسلم نے اللہ تعالیٰ کو دیکھا نہیں تھا ) پھر اللہ تعالیٰ کے اس ارشاد » ثم دنی فتدلیٰ فکان قاب قوسین او ادنیٰ « کے بارے میں آپ کا کیا خیال ہے ؟ انہوں نے کہا کہ یہ آیت تو جبرائیل علیہ السلام کے بارے میں ہے ، وہ انسانی شکل میں آنحضرت صلی اللہ علیہ وسلم کے پاس آیا کرتے تھے اور اس مرتبہ اپنی اس شکل میں آئے جو اصلی تھی اور انہوں نے تمام آسمان کے کناروں کو ڈھانپ لیا تھا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 129520,
        "last_updated": null
    },
    {
        "urduURN": 4031930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3236,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے ابورجاء نے بیان کیا ، ان سے سمرہ بن جندب رضی اللہ عنہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، میں نے آج رات ( خواب میں ) دیکھا کہ دو شخص میرے پاس آئے ۔ ان دونوں نے مجھے بتایا کہ وہ جو آگ جلا رہا ہے ۔ وہ جہنم کا داروغہ مالک نامی فرشتہ ہے ۔ میں جبرائیل ہوں اور یہ میکائیل ہیں ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 129530,
        "last_updated": null
    },
    {
        "urduURN": 4031940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3237,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے ابوعوانہ نے بیان کیا ، ان سے اعمش نے ، ان سے ابوحازم نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، اگر کسی مرد نے اپنی بیوی کو اپنے بستر پر بلایا ، لیکن اس نے آنے سے انکار کر دیا اور مرد اس پر غصہ ہو کر سو گیا ، تو صبح تک فرشتے اس عورت پر لعنت کرتے رہتے ہیں ۔ اس روایت کی متابعت ، ابوحمزہ ، ابن داوداور ابومعاویہ نے اعمش کے واسطہ سے کی ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 129540,
        "last_updated": null
    },
    {
        "urduURN": 4031950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3238,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو لیث نے خبر دی ، کہا کہ مجھ سے عقیل نے بیان کیا ، ان سے ابن شہاب نے بیان کیا کہ میں نے ابوسلمہ سے سنا ، انھوں نے بیان کیا کہ مجھے جابر بن عبداللہ رضی اللہ عنہما نے خبر دی اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا تھا کہ",
        "hadithText": "( پہلے غار حراء میں جو حضرت جبرائیل علیہ السلام مجھ کو سورۃ اقراء پڑھا کر گئے تھے اس کے بعد ) مجھ پر وحی کا نزول ( تین سال ) بند رہا ۔ ایک بار میں کہیں جا رہا تھا کہ میں نے آسمان میں سے ایک آواز سنی اور نظر آسمان کی طرف اٹھائی ، میں نے دیکھا کہ وہی فرشتہ جو غار حرا میں میرے پاس آیا تھا ( یعنی حضرت جبرائیل علیہ السلام ) آسمان اور زمین کے درمیان ایک کرسی پر بیٹھا ہوا ہے ۔ میں انہیں دیکھ کر اتنا ڈر گیا کہ زمین پر گر پڑا ۔ پھر میں اپنے گھر آیا اور کہنے لگا کہ مجھے کچھ اوڑھا دو ، مجھے کچھ اوڑھا دو ۔ اس کے بعد اللہ تعالیٰ نے یہ آیت نازل فرمائی ۔ » یا ایہا المدثر « اللہ تعالیٰ کے ارشاد فاہجر تک ۔ ابوسلمہ نے کہا کہ آیت میں الرجز سے بت مراد ہیں ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 129550,
        "last_updated": null
    },
    {
        "urduURN": 4031960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3239,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے ( دوسری سند ) امام بخاری نے کہا اور مجھ سے خلیفہ بن خیاط نے بیان کیا کہا ہم سے یزید بن زریع نے بیان کیا ، کہا ہم سے سعید بن عروبہ نے ، ان سے قتادہ نے ، ان سے ابوالعالیہ نے اور ان سے تمہارے نبی کے چچازاد بھائی عبداللہ بن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، شب معراج میں میں نے موسیٰ علیہ السلام کو دیکھا تھا ، گندمی رنگ ، قد لمبا اور بال گھونگھریالے تھے ، ایسے لگتے تھے جیسے قبیلہ شنوہ کا کوئی شخص ہو اور میں نے عیسیٰ علیہ السلام کو بھی دیکھا تھا ۔ درمیانہ قد ، میانہ جسم ، رنگ سرخی اور سفیدی لیے ہوئے اور سر کے بال سیدھے تھے ( یعنی گھونگھریالے نہیں تھے ) اور میں نے جہنم کے داروغہ کو بھی دیکھا اور دجال کو بھی ، منجملہ ان آیات کے جو اللہ تعالیٰ نے مجھ کو دکھائی تھیں ( سورۃ السجدہ میں اسی کا ذکر ہے کہ ) پس ( اے نبی ! ) ان سے ملاقات کے بارے میں آپ کسی قسم کا شک و شبہ نہ کریں ، یعنی موسیٰ علیہ السلام سے ملنے میں ، انس اور ابوبکرہ رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے یوں بیان کیا کہ جب دجال نکلے گا تو فرشتے دجال سے مدینہ کی حفاظت کریں گے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 129560,
        "last_updated": null
    },
    {
        "urduURN": 4031970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3240,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، انہوں نے کہا کہ ہم سے نافع نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رصی اللہ عنہما نے بیان کیا ، انہوں نے کہا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جب کوئی شخص مرتا ہے تو ( روزانہ ) صبح و شام دونوں وقت اس کا ٹھکانا ( جہاں وہ آخرت میں رہے گا ) اسے دکھلایا جاتا ہے ۔ اگر وہ جنتی ہے تو جنت میں اگر وہ دوزخی ہے تو دوزخ میں ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 129570,
        "last_updated": null
    },
    {
        "urduURN": 4031980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3241,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، انہوں نے کہا ہم سے سلم بن زریر نے بیان کیا ، انہوں نے کہا ہم سے ابورجاء نے بیان کیا اور ان سے عمران بن حصین رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، میں نے جنت میں جھانک کر دیکھا تو جنتیوں میں زیادتی غریبوں کی نظر آئی اور میں نے دوزخ میں جھانک کر دیکھا تو دوزخیوں میں کثرت عورتوں کی نظر آئی ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 129580,
        "last_updated": null
    },
    {
        "urduURN": 4031990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3242,
        "hadithSanad": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم سے لیث نے بیان کیا کہا کہ مجھ سے عقیل نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، کہا مجھ کو سعید بن مسیب نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس بیٹھے ہوئے تھے ، تو آپ نے فرمایا کہ میں نے خواب میں جنت دیکھی ، میں نے اس میں ایک عورت کو دیکھا جو ایک محل کے کنارے وضو کر رہی تھی ۔ میں نے پوچھا کہ یہ محل کس کا ہے ؟ تو فرشتوں نے بتایا کہ یہ عمر بن خطاب رضی اللہ عنہ کا محل ہے ۔ مجھے ان کی غیرت یاد آئی اور میں وہاں سے فوراً لوٹ آیا ۔ یہ سن کر عمر رضی اللہ عنہ رو دئیے اور کہنے لگے ، یا رسول اللہ ! کیا میں آپ کے ساتھ بھی غیرت کروں گا ؟</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 129590,
        "last_updated": null
    },
    {
        "urduURN": 4032000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3243,
        "hadithSanad": "ہم سے حجاج بن منہال نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، انہوں نے کہا کہ میں نے ابوعمران جونی سے سنا ، ان سے ابوبکر بن عبداللہ بن قیس اشعری نے بیان کیا اور ان سے ان کے والد نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، ( جنتیوں کا ) خیمہ کیا ہے ، ایک موتی ہے خولدار جس کی بلندی اوپر کو تیس میل تک ہے ۔ اس کے ہر کنارے پر مومن کی ایک بیوی ہو گی جسے دوسرے نہ دیکھ سکیں گے ۔ ابوعبدالصمد اور حارث بن عبید نے ابوعمران سے ( بجائے تیس میل کے ) ساٹھ میل بیان کیا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 129600,
        "last_updated": null
    },
    {
        "urduURN": 4032010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3244,
        "hadithSanad": "ہم سے حمیدی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا ہم سے ابوالزناد نے بیان کیا ، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، اللہ تعالیٰ کا ارشاد ہے کہ میں نے اپنے نیک بندوں کے لیے وہ چیزیں تیار کر رکھی ہیں ، جنہیں نہ آنکھوں نے دیکھا ، نہ کانوں نے سنا اور نہ کسی انسان کے دل میں ان کا کبھی خیال گزرا ہے ۔ اگر جی چاہے تو یہ آیت پڑھ لو ” پس کوئی شخص نہیں جانتاکہ اس کی آنکھوں کی ٹھنڈک کے لیے کیا کیا چیزیں چھپا کر رکھی گئی ہیں “ ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 129610,
        "last_updated": null
    },
    {
        "urduURN": 4032020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3245,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو معمر نے خبر دی ، انہیں ہمام بن منبہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جنت میں داخل ہونے والے سب سے پہلے گروہ کے چہرے ایسے روشن ہوں گے جیسے چودہویں کا چاند روشن ہوتا ہے ۔ نہ اس میں تھوکیں گے نہ ان کی ناک سے کوئی آلائش آئے گی اور نہ پیشاب ، پائخانہ کریں گے ۔ ان کے برتن سونے کے ہوں گے ۔ کنگھے سونے چاندی کے ہوں گے ۔ انگیٹھیوں کا ایندھن عود کا ہو گا ۔ پسینہ مشک جیسا خوشبودار ہو گا اور ہر شخص کی دو بیویاں ہوں گی ۔ جن کا حسن ایسا ہو گا کہ پنڈلیوں کا گودا گوشت کے اوپر سے دکھائی دے گا ۔ نہ جنتیوں میں آپس میں کوئی اختلاف ہو گا اور نہ بغض و عناد ، ان کے دل ایک ہوں گے اور وہ صبح و شام اللہ پاک کی تسبیح و تہلیل میں مشغول رہا کریں گے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 129620,
        "last_updated": null
    },
    {
        "urduURN": 4032030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3246,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، ان سے ابالزناد نے بیان کیا ، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جنت میں داخل ہونے والے سب سے پہلے گروہ کے چہرے ایسے روشن ہوں گے جیسے چودہویں کا چاند ہوتا ہے ۔ جو گروہ اس کے بعد داخل ہو گا ان کے چہرے سب سے زیادہ چمک دار ستارے جیسے روشن ہوں گے ۔ ان کے دل ایک ہوں گے کہ کوئی بھی اختلاف ان میں آپس میں نہ ہو گا اور نہ ایک دوسرے سے بغض و حسد ہو گا ۔ ہر شخص کی دو بیویاں ہوں گی ، ان کی خوبصورتی ایسی ہو گی کہ ان کی پنڈلیوں کا گودا گوشت کے اوپر سے دکھائی دے گا ۔ وہ صبح شام اللہ کی تسبیح کرتے رہیں گے نہ ان کو کوئی بیماری ہو گی ، نہ ان کی ناک میں کوئی آلائش آئے گی اور نہ تھوک آئے گا ۔ ان کے برتن سونے اور چاندی کے اور کنگھے سونے کے ہوں گے اور ان کی انگیٹھیوں کا ایندھن الوہ کا ہو گا ، ابوالیمان نے بیان کیا کہ الوہ سے عود ہندی مراد ہے ۔ اور ان کا پسینہ مشک جیسا ہو گا ۔ مجاہد نے کہا کہ ابکار سے مراد اول فجر ہے ۔ اور العشی سے مراد سورج کا اتنا ڈھل جانا کہ وہ غروب ہوتا نظر آنے لگے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 129630,
        "last_updated": null
    },
    {
        "urduURN": 4032040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3247,
        "hadithSanad": "ہم سے محمد بن ابی بکر مقدمی نے بیان کیا ، انہوں نے کہا ہم سے فضیل بن سلیمان نے بیان کیا ، ان سے ابوحازم نے بیان کیا اور ان سے سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میری امت میں سے ستر ہزار یا ( آپ نے یہ فرمایا کہ ) سات لاکھ کی ایک جماعت جنت میں ایک ہی وقت میں داخل ہوں گی اور ان سب کے چہرے ایسے چمکیں گے جیسے چودہویں کا چاند چمکتا ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 129640,
        "last_updated": null
    },
    {
        "urduURN": 4032050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3248,
        "hadithSanad": "ہم سے عبداللہ بن محمد جعفی نے بیان کیا ، کہا ہم سے یونس بن محمد نے بیان کیا ، ان سے شیبان نے بیان کیا ، ان سے قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا ، انہوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی خدمت میں سندس ( ایک خاص قسم کا ریشم ) کا ایک جبہ تحفہ میں پیش کیا گیا ۔ آپ ( مردوں کے لیے ) ریشم کے استعمال سے پہلے ہی منع فرما چکے تھے ۔ لوگوں نے اس جبے کو بہت ہی پسند کیا ، تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جنت میں سعد بن معاذ کے رو مال اس سے بہتر ہوں گے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 129650,
        "last_updated": null
    },
    {
        "urduURN": 4032060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3249,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ بن سعید نے بیان کیا ، ان سے سفیان نے بیان کیا ، انہوں نے کہا کہ مجھ سے ابواسحاق نے بیان کیا ، کہا کہ میں نے براء بن عازب رضی اللہ عنہما سے سنا ، آپ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ریشم کا ایک کپڑا پیش کیا گیا اس کی خوبصورتی اور نزاکت نے لوگوں کو حیرت میں ڈال دیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جنت میں سعد بن معاذ کے رو مال اس سے بہتر اور افضل ہیں ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 129660,
        "last_updated": null
    },
    {
        "urduURN": 4032070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3250,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے سفیان نے بیان کیا ، ان سے ابوحازم نے اور ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جنت میں ایک کوڑے کی جگہ دنیا سے اور جو کچھ دنیا میں ہے ، سب سے بہتر ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 129670,
        "last_updated": null
    },
    {
        "urduURN": 4032080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3251,
        "hadithSanad": "ہم سے روح بن عبدالمؤمن نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، کہا ہم سے سعید بن ابی عروبہ نے بیان کیا ، ان سے قتادہ نے او ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جنت میں ایک درخت ہے جس کے سائے میں ایک سوار سو سال تک چل سکتا ہے اور پھر بھی اس کو طے نہ کر سکے گا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 129680,
        "last_updated": null
    },
    {
        "urduURN": 4032090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3252,
        "hadithSanad": "ہم سے محمد بن سنان نے بیان کیا ، انہوں نے کہا ہم سے فلیح بن سلیمان نے بیان کیا ، ان سے ہلال بن علی نے بیان کیا ، ان سے عبدالرحمن بن ابی عمرہ نے بیان کیا اور ان سے ابوہریرۃ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جنت میں ایک درخت ہے جس کے سائے میں ایک سوار سو سال تک چل سکے گا اور اگر تمہارا جی چاہے تو یہ آیت پڑھ لو »وظل ممدود « ” اور لمبا سایہ “ ۔ \nاور کسی شخص کے لیے ایک کمان کے برابر جنت میں جگہ اس پوری دنیا سے بہتر ہے جس پر سورج طلوع اور غروب ہوتا ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 129690,
        "last_updated": null
    },
    {
        "urduURN": 4032110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3254,
        "hadithSanad": "ہم سے ابراہیم بن المنذر نے بیان کیا ، کہا ہم سے محمد بن فلیح نے بیان کیا ، کہا ہم سے ہمارے باپ نے بیان کیا ، ان سے ہلال نے ، ان سے عبدالرحمن بن ابی عمرہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "سب سے پہلا گروہ جو جنت میں داخل ہو گا ، ان کے چہرے چودہویں رات کے چاند کی طرح روشن ہوں گے ۔ جو گروہ اس کے بعد داخل ہو گا ان کے چہرے آسمان پر موتی کی طرح چمکنے والے ستاروں میں جو سب سے زیادہ روشن ستارہ ہوتا ہے اس جیسے روشن ہوں گے ، سب کے دل ایک جیسے ہوں گے نہ ان میں بغض و فساد ہو گا اور نہ حسد ، ہر جنتی کی دو حور عین بیویاں ہوں گی ، اتنی حسین کہ ان کی پنڈلی کی ہڈی اور گوشت کے اندر کا گودا بھی دیکھا جا سکے گا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 129700,
        "last_updated": null
    },
    {
        "urduURN": 4032120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3255,
        "hadithSanad": "ہم سے حجاج بن منہال نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا کہ مجھے عدی بن ثابت نے خبر دی ، کہا کہ میں نے براء بن عازب رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "جب رسول اللہ صلی اللہ علیہ وسلم کے ( صاحبزادے ) ابراہیم رضی اللہ عنہ کا انتقال ہوا ، تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جنت میں اسے ایک دودھ پلانے والی انا کے حوالہ کر دیا گیا ہے ( جو ان کو دودھ پلاتی ہے )</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 129710,
        "last_updated": null
    },
    {
        "urduURN": 4032130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3256,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے امام مالک بن انس نے بیان کیا ، ان سے صفوان بن سلیم نے ، ان سے عطاء بن یسار نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جنتی لوگ اپنے سے بلند کمرے والوں کو اوپر اسی طرح دیکھیں گے جیسے چمکتے ستارے کو جو صبح کے وقت رہ گیا ہو ، آسمان کے کنارے پورب یا پچھم میں دیکھتے ہیں ۔ ان میں ایک دوسرے سے افضل ہو گا ۔ لوگوں نے عرض کیا ، یا رسول اللہ ! یہ تو انبیاء کے محل ہوں گے جنہیں ان کے سوار اور کوئی نہ پا سکے گا ۔ آپ نے فرمایا کہ نہیں ، اس ذات کی قسم ! جس کے ہاتھ میں میری جان ہے ۔ یہ ان لوگوں کے لیے ہوں گے جو اللہ تعالیٰ پر ایمان لائے اور انبیاء کی تصدیق کی ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 129720,
        "last_updated": null
    },
    {
        "urduURN": 4032140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3257,
        "hadithSanad": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم سے محمد بن مطرف نے بیان کیا ، کہا کہ مجھ سے ابوحازم نے بیان کیا ، ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جنت کے آٹھ دروازے ہیں ۔ ان میں ایک دروازے کا نام ریان ہے ۔ جس سے داخل ہونے والے صرف روزے دار ہوں گے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 129730,
        "last_updated": null
    },
    {
        "urduURN": 4032150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3258,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے مہاجر ابوالحسن نے بیان کیا کہ میں نے زید بن وہب سے سنا ، انہوں نے بیان کیا کہ میں نے ابوذر رضی اللہ عنہ سے سنا وہ بیان کرتے تھے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ایک سفر میں تھے ( جب حضرت بلال رضی اللہ عنہ ظہر کی اذان دینے اٹھے تو ) آپ نے فرمایا کہ وقت ذرا ٹھنڈا ہو لینے دو ، پھر دوبارہ ( جب وہ اذان کے لیے اٹھے تو پھر ) آپ نے انہیں یہی حکم دیا کہ وقت اور ٹھنڈا ہو لینے دو ، یہاں تک کہ ٹیلوں کے نیچے سے سایہ ڈھل گیا ، اس کے بعد آپ نے فرمایا کہ نماز ٹھنڈے وقت اوقات میں پڑھا کرو ، کیونکہ گرمی کی شدت جہنم کی بھاپ سے پیدا ہوتی ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 129740,
        "last_updated": null
    },
    {
        "urduURN": 4032160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3259,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے اعمش نے ، ان سے ذکو ان نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، نماز ٹھنڈے وقت میں پڑھا کرو ، کیونکہ گرمی کی شدت جہنم کی بھاپ سے پیدا ہوتی ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 129750,
        "last_updated": null
    },
    {
        "urduURN": 4032170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3260,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا کہ ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہوں نے کہا کہ مجھ سے ابوسلمہ بن عبدالرحمن نے بیان کیا اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، آپ بیان کرتے تھے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جہنم نے اپنے رب کے حضور میں شکایت کی اور کہا کہ میرے رب ! میرے ہی بعض حصے نے بعض کو کھا لیا ہے ۔ اللہ تعالیٰ نے اسے دو سانسوں کی اجازت دی ، ایک سانس جاڑے میں اور ایک گرمی میں ۔ تم انتہائی گرمی اور انتہائی سردی جو ان موسموں میں دیکھتے ہو ، اس کا یہی سبب ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 129760,
        "last_updated": null
    },
    {
        "urduURN": 4032180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3261,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے ابوعامر عبدالملک عقدی نے بیان کیا ان سے ہمام بن یحییٰ نے بیان کیا ، ان سے ابوجمرہ نصر بن عمران ضبعی نے بیان کیا کہ",
        "hadithText": "میں مکہ میں ابن عباس رضی اللہ عنہما کی خدمت میں بیٹھا کرتا تھا ۔ وہاں مجھے بخار آنے لگا ۔ ابن عباس رضی اللہ عنہما نے فرمایا کہ اس بخار کو زمزم کے پانی سے ٹھنڈا کر ، کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جہنم کی بھاپ کے اثر سے آتا ہے ، اس لیے اسے پانی سے ٹھنڈا کر لیا کرو یا یہ فرمایا کہ زمزم کے پانی سے ۔ یہ شک ہمام راوی کو ہوا ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 129770,
        "last_updated": null
    },
    {
        "urduURN": 4032190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3262,
        "hadithSanad": "مجھ سے عمرو بن عباس نے بیان کیا ، کہا ہم سے عبدالرحمن بن مہدی نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے ان کے باپ نے ، ان سے عبایہ بن رفاعہ نے بیان کیا ، کہا مجھ کو رافع بن خدیج رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا تھا کہ بخار جہنم کے جوش مارنے کے اثر سے ہوتا ہے اس لیے اسے پانی سے ٹھنڈا کر لیا کرو ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 129780,
        "last_updated": null
    },
    {
        "urduURN": 4032200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3263,
        "hadithSanad": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے زہیر نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، ان سے عروہ بن زبیر نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، بخار جہنم کی بھاپ کے اثر سے ہوتا ہے اسے پانی سے ٹھنڈا کر لیا کرو ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 129790,
        "last_updated": null
    },
    {
        "urduURN": 4032210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3264,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، ان سے یحییٰ نے ، ان سے عبیداللہ نے بیان کیا ، کہا کہ مجھ سے نافع نے بیان کیا اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، بخار جہنم کی بھاپ کے اثر سے ہوتا ہے اس لیے اسے پانی سے ٹھنڈا کر لیا کرو ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 129800,
        "last_updated": null
    },
    {
        "urduURN": 4032220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3265,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک رحمہ اللہ نے بیان کیا ، ان سے ابوالزناد نے ، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، تمہاری ( دنیا کی ) آگ جہنم کی آگ کے مقابلے میں ( اپنی گرمی اور ہلاکت خیزی میں ) سترواں حصہ ہے ۔ کسی نے پوچھا ، یا رسول اللہ ! ( کفار اور گنہگاروں کے عذاب کے لیے ) یہ ہماری دنیا کی آگ بھی بہت تھی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ دنیا کی آگ کے مقابلے میں جہنم کی آگ انہتر گنا بڑھ کر ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 129810,
        "last_updated": null
    },
    {
        "urduURN": 4032230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3266,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے ، انہوں نے عطاء سے سنا ، انہوں نے صفوان بن یعلیٰ سے خبر دی ۔ انہوں نے اپنے والد کے واسطہ سے",
        "hadithText": "انہوں نے نبی کریم صلی اللہ علیہ وسلم کو منبر پر اس طرح آیت پڑھتے سنا » ونادوا یا ملک « ( اور وہ دوزخی پکاریں گے ، اے مالک ! ) ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 129820,
        "last_updated": null
    },
    {
        "urduURN": 4032240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3267,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے اعمش نے ، ان سے ابووائل نے بیان کیا کہ",
        "hadithText": "اسامہ بن زید رضی اللہ عنہما سے کسی نے کہا کہ اگر آپ فلاں صاحب ( عثمان رضی اللہ عنہ ) کے یہاں جا کر ان سے گفتگو کرو تو اچھا ہے ( تاکہ وہ یہ فساد دبانے کی تدبیر کریں ) انہوں نے کہا کیا تم لوگ یہ سمجھتے ہو کہ میں ان سے تم کو سنا کر ( تمہارے سامنے ہی ) بات کرتا ہوں ، میں تنہائی میں ان سے گفتگو کرتا ہوں اس طرح پر کہ فساد کا دروازہ نہیں کھولتا ، میں یہ بھی نہیں چاہتاکہ سب سے پہلے میں فساد کا دروازہ کھولوں اور میں آنحضرت صلی اللہ علیہ وسلم سے ایک حدیث سننے کے بعد یہ بھی نہیں کہتاکہ جو شخص میرے اوپر سردار ہو وہ سب لوگوں میں بہتر ہے ۔ لوگوں نے پوچھا کہ آپ نے آنحضرت صلی اللہ علیہ وسلم سے جو حدیث سنی ہے وہ کیا ہے ؟ حضرت اسامہ نے کہا آنحضرت صلی اللہ علیہ وسلم کو میں نے یہ فرماتے سنا تھا کہ قیامت کے دن ایک شخص کو لایا جائے گا اور جہنم میں ڈال دیا جائے گا ۔ آگ میں اس کی آنتیں باہر نکل آئیں گی اور وہ شخص اس طرح چکر لگانے لگے گا جیسے گدھا اپنی چکی پر گردش کیا کرتا ہے ۔ جہنم میں ڈالے جانے والے اس کے قریب آ کر جمع ہو جائیں گے اور اس سے کہیں گے ، اے فلاں ! آج یہ تمہاری کیا حالت ہے ؟ کیا تم ہمیں اچھے کام کرنے کے لیے نہیں کہتے تھے ، اور کیا تم برے کاموں سے ہمیں منع نہیں کیا کرتے تھے ؟ وہ شخص کہے گا جی ہاں ، میں تمہیں تو اچھے کاموں کا حکم دیتا تھا لیکن خود نہیں کرتا تھا ۔ برے کاموں سے تمہیں منع بھی کرتا تھا ، لیکن میں اسے خود کیا کرتا تھا ۔ اس حدیث کو غندر نے بھی شعبہ سے ، انہوں نے اعمش سے روایت کیا ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 129830,
        "last_updated": null
    },
    {
        "urduURN": 4032250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3268,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا ہم کو عیسیٰ بن یونس نے خبر دی ، انہیں ہشام نے ، انہیں ان کے والد عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم پر ( جب آپ صلی اللہ علیہ وسلم حدیبیہ سے لوٹے تھے ) جادو ہوا تھا ۔ اور لیث بن سعد نے بیان کیا کہ مجھے ہشام نے لکھا تھا ، انہوں نے اپنے والد سے سنا تھا اور یاد رکھا تھا اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا تھا کہ نبی کریم صلی اللہ علیہ وسلم پر جادو کیا گیا تھا ۔ آپ کے ذہن میں بات ہوتی تھی کہ فلاں کام میں کر رہا ہوں حالانکہ آپ اسے نہ کر رہے ہوتے ۔ آخر ایک دن آپ نے دعا کی پھر دعا کی کہ اللہ پاک اس جادو کا اثر دفع کرے ۔ اس کے بعد آپ نے عائشہ رضی اللہ عنہا سے فرمایا کہ تمہیں معلوم بھی ہوا اللہ تعالیٰ نے مجھے وہ تدبیر بتا دی ہے جس میں میری شفاء مقدر ہے ۔ میرے پاس دو آدمی آئے ، ایک تو میرے سر کی طرف بیٹھ گئے اور دوسرا پاؤں کی طرف ۔ پھر ایک نے دوسرے سے کہا ، انہیں بیماری کیا ہے ؟ دوسرے آدمی نے جواب دیا کہ ان پر جادو ہوا ہے ۔ انہوں نے پوچھا ، جادو ان پر کس نے کیا ہے ؟ جواب دیا کہ لبید بن اعصم یہودی نے ، پوچھا کہ وہ جادو ( ٹونا ) رکھا کس چیز میں ہے ؟ کہا کہ کنگھے میں ، کتان میں اور کھجور کے خشک خوشے کے غلاف میں ۔ پوچھا ، اور یہ چیزیں ہیں کہاں ؟ کہا بئر دوران میں ۔ پھر نبی کریم صلی اللہ علیہ وسلم وہاں تشریف لے گئے اور واپس آئے تو حضرت عائشہ رضی اللہ عنہا سے فرمایا ، وہاں کے کھجور کے درخت ایسے ہیں جیسے شیطان کی کھوپڑی ۔ میں نے آنحضرت صلی اللہ علیہ وسلم سے پوچھا ، وہ ٹونا آپ نے نکلوایا بھی ؟ آپ نے فرمایا کہ نہیں مجھے تو اللہ تعالیٰ نے خود شفاء دی اور میں نے اسے اس خیال سے نہیں نکلوایا کہ کہیں اس کی وجہ سے لوگوں میں کوئی جھگڑا کھڑا کر دوں ۔ اس کے بعد وہ کنواں بند کر دیا گیا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 129840,
        "last_updated": null
    },
    {
        "urduURN": 4032260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3269,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا مجھ سے میرے بھائی ( عبدالحمید ) نے بیان کیا ، انہوں نے کہا ہم سے سلیمان بن بلال نے ، ان سے یحییٰ بن سعید نے ، ان سے سعید بن مسیب نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ جب کوئی تم میں سے سویا ہوا ہوتا ہے ، تو شیطان اس کے سر کی گدی پر تین گرہیں لگا دیتا ہے خوب اچھی طرح سے اور ہر گرہ پر یہ افسون پھونک دیتا ہے کہ ابھی بہت رات باقی ہے ۔ پڑا سوتا رہ ۔ لیکن اگر وہ شخص جاگ کر اللہ کا ذکر شروع کرتا ہے تو ایک گرہ کھل جاتی ہے ۔ پھر جب وضو کرتا ہے تو دوسری گرہ کھل جاتی ہے ۔ پھر جب نماز فجر پڑھتا ہے تو تیسری گرہ بھی کھل جاتی ہے اور صبح کو خوش مزاج خوش دل رہتا ہے ۔ ورنہ بدمزاج سست رہ کر وہ دن گزارتا ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 129850,
        "last_updated": null
    },
    {
        "urduURN": 4032270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3270,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے منصور نے ، ان سے ابووائل نے اور ان سے عبداللہ بن مسعودص نے بیان کیا کہ",
        "hadithText": "میں حاضر خدمت تھا تو نبی کریم صلی اللہ علیہ وسلم کے سامنے ایک ایسے شخص کا ذکر آیا ، جو رات بھر دن چڑھے تک پڑا سوتا رہا ہو ، آپ نے فرمایا کہ یہ ایسا شخص ہے جس کے کان یا دونوں کانوں میں شیطان نے پیشاب کر دیا ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 129860,
        "last_updated": null
    },
    {
        "urduURN": 4032280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3271,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، ان سے منصور نے ان سے سالم بن ابی الجعد نے ، ان سے کریب نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جب کوئی شخص اپنی بیوی کے پاس آتا ہے اور یہ دعا پڑتا ہے ” اللہ کے نام سے شروع کرتا ہوں ، اے اللہ ! ہم سے شیطان کو دور رکھ اور جو کچھ ہمیں تو دے ( اولاد ) اس سے بھی شیطان کو دور رکھ ۔ “ پھر اگر ان کے یہاں بچہ پیدا ہوتا ہے تو شیطان اسے کوئی نقصان نہیں پہنچا سکتا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 129870,
        "last_updated": null
    },
    {
        "urduURN": 4032290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3272,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، انہوں نے کہا ہم کو عبدہ نے خبر دی ، انہیں ہشام بن عروہ نے ، انہیں ان کے والد نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جب سورج کا اوپر کا کنارہ نکل آئے تو نماز نہ پڑھو جب تک وہ پوری طرح ظاہر نہ ہو جائے اور جب غروب ہونے لگے تب بھی اس وقت تک کے لیے نماز چھوڑ دو جب تک بالکل غروب نہ ہو جائے ۔ \nاور نماز سورج کے نکلنے اور ڈوبنے کے وقت نہ پڑھو ، کیونکہ سورج شیطان کے سر کے یا شیطانوں کے سر کے دونوں کونوں کے بیچ میں سے نکلتا ہے ۔ عبدہ نے کہا میں نہیں جانتا ہشام نے شیطان کا سر کہا یا شیطانوں کا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 129881,
        "last_updated": null
    },
    {
        "urduURN": 4032310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3274,
        "hadithSanad": "ہم سے ابومعمر نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، کہا ہم سے یونس نے بیان کیا ، ان سے حمید بن بلال نے ، ان سے ابوصالح نے ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اگر تم میں سے نماز پڑھنے میں کسی شخص کے سامنے سے کوئی گزرے تو اسے گزرنے سے روکے ، اگر وہ نہ رکے تو پھر روکے اور اگر اب بھی نہ رکے تو اس سے لڑے وہ شیطان ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 129900,
        "last_updated": null
    },
    {
        "urduURN": 4032320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3275,
        "hadithSanad": "اور عثمان بن ہیشم نے بیان کیا ، کہا ہم سے عوف نے بیان کیا ، ان سے محمد بن سیرین نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ایک مرتبہ صدقہ فطر کے غلہ کی حفاظت پر مجھے مقرر کیا ، ایک شخص آیا اور دونوں ہاتھوں سے غلہ لپ بھربھر کر لینے لگا ۔ میں نے اسے پکڑ لیا اور کہا کہ اب میں تجھے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں پیش کروں گا ۔ پھر انہوں نے آخر تک حدیث بیان کی ، اس ( چور ) نے ابوہریرہ رضی اللہ عنہ سے کہا کہ جب تم اپنے بستر پر سونے کے لیے لیٹنے لگو تو آیۃ الکرسی پڑھ لیا کرو ، اس کی برکت سے اللہ تعالیٰ کی طرف سے تم پر ایک نگہبان مقرر ہو جائے گا اور شیطان تمہارے قریب صبح تک نہ آ سکے گا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ بات تو اس نے سچی کہی ہے اگرچہ وہ خود جھوٹا ہے ۔ وہ شیطان تھا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 129910,
        "last_updated": null
    },
    {
        "urduURN": 4032330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3276,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے بیان کیا ، انہیں عروہ نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، تم میں سے کسی کے پاس شیطان آتا ہے اور تمہارے دل میں پہلے تو یہ سوال پیدا کرتا ہے کہ فلاں چیز کس نے پیدا کی ، فلاں چیز کس نے پیدا کی ؟ اور آخر میں بات یہاں تک پہنچاتا ہے کہ خود تمہارے رب کو کس نے پیدا کیا ؟ جب کسی شخص کو ایسا وسوسہ ڈالے تو اللہ سے پناہ مانگنی چاہئے ، شیطانی خیال کو چھوڑ دے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 129920,
        "last_updated": null
    },
    {
        "urduURN": 4032340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3277,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے بیان کیا ، ان سے ابن شہاب نے ، ان سے تیمیین کے مولیٰ ابن ابی انس نے بیان کیا ، ان سے ان کے والد نے بیان کیا کہ ابوہریرہ رضی اللہ عنہ کو یہ کہتے سنا تھا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب رمضان کا مہینہ آتا ہے تو جنت کے دروازے کھول دئیے جاتے ہیں ۔ جہنم کے دروازے بند کر دئیے جاتے ہیں اور شیاطین کو زنجیروں میں کس دیا جاتا ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 129930,
        "last_updated": null
    },
    {
        "urduURN": 4032350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3278,
        "hadithSanad": "ہم سے حمیدی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے ، کہا ہم سے عمرو بن دینار نے ، کہا کہ",
        "hadithText": "مجھے سعید بن جبیر نے خبر دی ، کہا کہ میں نے ابن عباس رضی اللہ عنہما سے پوچھا ( نوف بکالی کہتا ہے کہ خضر کے پاس جو موسیٰ گئے تھے وہ دوسرے موسیٰ تھے ) تو انہوں نے کہا کہ ہم سے ابی بن کعب نے بیان کیا ، انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے کہ موسیٰ علیہ السلام نے اپنے رفیق سفر ( یوشع بن نون ) سے فرمایا کہ ہمارا کھانا لا ، اس پر انہوں نے بتایا کہ آپ کو معلوم بھی ہے جب ہم نے چٹان پر پڑاو ڈالا تھا تو میں مچھلی وہیں بھول گیا ( اور اپنے ساتھ نہ لا سکا ) اور مجھے اسے یاد رکھنے سے صرف شیطان نے غافل رکھا اور موسیٰ علیہ السلام نے اس وقت تک کوئی تھکن معلوم نہیں کی جب تک اس حد سے نہ گزر لیے ، جہاں کا اللہ تعالیٰ نے حکم دیا تھا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 129940,
        "last_updated": null
    },
    {
        "urduURN": 4032360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3279,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، ان سے امام مالک نے بیان کیا ، ان سے عبداللہ بن دینار نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ مشرق کی طرف اشارہ کر کے فرما رہے تھے کہ ہاں ! فتنہ اسی طرف سے نکلے گا جہاں سے شیطان کے سر کا کونا نکلتا ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 129950,
        "last_updated": null
    },
    {
        "urduURN": 4032370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3280,
        "hadithSanad": "ہم سے یحییٰ بن جعفر نے بیان کیا ، انہوں نے کہا ہم سے محمد بن عبداللہ انصاری نے بیان کیا ، انہوں نے کہا ہم سے ابن جریج نے بیان کیا ، انہوں نے کہا کہ مجھے عطاء  بن ابی رباح نے خبر دی اور انہیں حضرت جابر رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، رات کا اندھیرا شروع ہونے پر یا رات شروع ہونے پر اپنے بچوں کو اپنے پاس ( گھر میں ) روک لو ، کیونکہ شیاطین اسی وقت پھیلنا شروع کرتے ہیں ۔ پھر جب عشاء کے وقت میں سے ایک گھڑی گزر جائے تو انہیں چھوڑ دو ( چلیں پھریں ) پھر اللہ کا نام لے کر اپنا دروازہ بند کرو ، اللہ کا نام لے کر اپنا چراغ بجھا دو ، پانی کے برتن اللہ کا نام لے کر ڈھک دو ، اور دوسرے برتن بھی اللہ کا نام لے کر ڈھک دو ( اور اگر ڈھکن نہ ہو ) تو درمیان میں ہی کوئی چیز رکھ دو ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 129960,
        "last_updated": null
    },
    {
        "urduURN": 4032380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3281,
        "hadithSanad": "ہم سے محمود بن غیلان نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں زین العابدین علی بن حسین رضی اللہ عنہ نے اور ان سے صفیہ بنت حیی رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم اعتکاف میں تھے تو میں رات کے وقت آپ سے ملاقات کے لیے ( مسجد میں ) آئی ، میں آپ سے باتیں کرتی رہی ، پھر جب واپس ہونے کے لیے کھڑی ہوئی تو آپ بھی مجھے چھوڑ آنے کے لیے کھڑے ہوئے ۔ ام المؤمنین حضرت صفیہ رضی اللہ عنہا کا مکان اسامہ بن زید رضی اللہ عنہ کے مکان ہی میں تھا ۔ اسی وقت دو انصاری صحابہ ( اسید بن حضیر ، عبادہ بن بشیر ) گزرے ۔ جب انہوں نے آنحضرت صلی اللہ علیہ وسلم کو دیکھا تو تیز چلنے لگے ۔ آپ نے ان سے فرمایا ، ذرا ٹھہر جاؤ یہ صفیہ بنت حیی ہیں ۔ ان دونوں صحابہ نے عرض کیا ، سبحان اللہ یا رسول اللہ ! ( کیا ہم بھی آپ کے بارے میں کوئی شبہ کر سکتے ہیں ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ شیطان انسان کے اندر خون کی طرح دوڑتا رہتا ہے ۔ اس لیے مجھے ڈر لگا کہ کہیں تمہارے دلوں میں بھی کوئی وسوسہ نہ ڈال دے ، یا آپ نے ( لفظ سوء کی جگہ ) لفظشیئا فرمایا ۔ معنی ایک ہی ہیں ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 129970,
        "last_updated": null
    },
    {
        "urduURN": 4032390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3282,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، ان سے ابوحمزہ نے ، ان سے اعمش نے ، ان سے عدی بن ثابت نے اور ان سے سلیمان بن صرد رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں بیٹھا ہوا تھا اور ( قریب ہی ) دو آدمی آپس میں گالی گلوچ کر رہے تھے کہ ایک شخص کا منہ سرخ ہو گیا اور گردن کی رگیں پھول گئیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ مجھے ایک ایسا کلمہ معلوم ہے کہ اگر یہ شخص اسے پڑھ لے تو اس کا غصہ جاتا رہے گا ۔ ( ترجمہ ) ” میں پناہ مانگتا ہوں اللہ کی شیطان سے “ ۔ تو اس کا غصہ جاتا رہے گا ۔ لوگوں نے اس پر اس سے کہا کہ نبی کریم صلی اللہ علیہ وسلم فرما رہے ہیں کہ تمہیں شیطان سے اللہ کی پناہ مانگنی چاہئے ، اس نے کہا ، کیا میں کوئی دیوانہ ہوں ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 129980,
        "last_updated": null
    },
    {
        "urduURN": 4032400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3283,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے منصور نے بیان کیا ، ان سے سالم بن ابی الجعد نے ، ان سے کریب نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کوئی شخص جب اپنی بیوی کے پاس جائے اور یہ دعا پڑھ لے ۔ ” اے اللہ ! مجھے شیطان سے دور رکھ اور جو میری اولاد پیدا ہو ، اسے بھی شیطان سے دو رکھ “ ۔ پھر اس صحبت سے اگر کوئی بچہ پیدا ہو تو شیطان اسے کوئی نقصان نہ پہنچا سکے گا اور نہ اس پر تسلط قائم کر سکے گا ۔ شعبہ نے بیان کیا اور ہم سے اعمش نے بیان کیا ، ان سے سالم نے ، ان سے کریب نے اور ان سے ابن عباس رضی اللہ عنہما نے ایسی ہی روایت کی ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 129990,
        "last_updated": null
    },
    {
        "urduURN": 4032410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3284,
        "hadithSanad": "ہم سے محمود بن غیلان نے بیان کیا ، کہا ہم سے شبابہ نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے محمد بن زیاد نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک مرتبہ نماز پڑھی اور فارغ ہونے کے بعد فرمایا کہ شیطان میرے سامنے آ گیا تھا اور نماز تڑوانے کی کوششیں شروع کر دی تھیں ، لیکن اللہ تعالیٰ نے مجھے اس پر غالب کر دیا ۔ پھر حدیث کو تفصیل کے ساتھ آخر تک بیان کیا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 130000,
        "last_updated": null
    },
    {
        "urduURN": 4032420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3285,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے اوزاعی نے بیان کیا ، ان سے یحییٰ بن ابی کثیر نے ، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جب نماز کے لیے اذان دی جاتی ہے تو شیطان اپنی پیٹھ پھیر کر گوز مارتا ہوا بھاگتا ہے ۔ جب اذان ختم ہو جاتی ہے تو واپس آ جاتا ہے ۔ پھر جب تکبیر ہونے لگتی ہے تو بھاگ کھڑا ہوتا ہے اور جب تکبیر ختم ہو جاتی ہے تو پھر واپس آ جاتا ہے اور آدمی کے دل میں وساوس ڈالنے لگتا ہے کہ فلاں بات یاد کر اور فلاں بات یاد کر ، نتیجہ یہ ہوتا ہے کہ اس کو یہ بھی یاد نہیں رہتاکہ تین رکعت نماز پڑھی تھی یا چار رکعت ، جب یہ یاد نہ رہے تو سہو کے دو سجدے کرے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 130010,
        "last_updated": null
    },
    {
        "urduURN": 4032430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3286,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں ابوالزناد نے ، انہیں اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، شیطان ہر انسان کی پیدائش کے وقت اپنی انگلی سے اس کے پہلو میں کچوکے لگاتا ہے سوائے عیسیٰ بن مریم علیہ السلام کے جب انہیں وہ کچوکے لگانے گیا تو پردے پر لگا آیا تھا ( جس کے اندر بچہ رہتا ہے ۔ اس کی رسائی وہاں تک نہ ہو سکی ، اللہ نے حضرت عیسیٰ علیہ السلام کو اس کی اس حرکت سے محفوظ رکھا ) .</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 130020,
        "last_updated": null
    },
    {
        "urduURN": 4032440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3287,
        "hadithSanad": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے اسرائیل نے بیان کیا ، ان سے مغیرہ نے ، ان سے ابراہیم نے اور ان سے علقمہ نے بیان کیا کہ",
        "hadithText": "میں شام پہنچا تو لوگوں نے کہا ، ابودرداء آئے انہوں نے کہا ، کیا تم لوگوں میں وہ شخص ہے جس کو اللہ تعالیٰ نے اپنے رسول کی زبان پر ( یعنی آپ کے زمانے سے ) شیطان سے بچا رکھا ہے ۔ ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا اور ان سے مغیرہ نے یہی حدیث ، اس میں یہ ہے ، جنہیں اللہ تعالیٰ نے اپنے نبی کی زبانی شیطان سے اپنی پناہ میں لینے کا اعلان کیا تھا ، آپ کی مراد حضرت عمار رضی اللہ عنہ سے تھی ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 130030,
        "last_updated": null
    },
    {
        "urduURN": 4032450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3288,
        "hadithSanad": "حضرت امام بخاری رحمہ اللہ نے کہا کہ لیث بن سعد نے کہا کہ مجھ سے خالد بن یزید نے بیان کیا ، ان سے سعید بن ابی ہلال نے ، ان سے ابوالاسود نے ، انہیں عروہ نے خبر دی اور انہیں عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، فرشتے ابر میں آپس میں کسی امر میں جو زمین میں ہونے والا ہوتا ہے باتیں کرتے ہیں ۔ عنان سے مراد بادل ہے ۔ تو شیاطین اس میں سے کوئی ایک کلمہ سن لیتے ہیں اور وہی کاہنوں کے کان میں اس طرح لا کر ڈالتے ہیں جیسے شیشے کا منہ ملا کر اس میں کچھ چھوڑتے ہیں اور وہ کاہن اس میں سو جھوٹ اپنی طرف سے ملاتے ہیں ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 130040,
        "last_updated": null
    },
    {
        "urduURN": 4032460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3289,
        "hadithSanad": "ہم سے عاصم بن علی نے بیان کیا ، کہا ہم سے ابن وہب نے بیان کیا ، ان سے سعید مقبری نے ، ان سے ان کے والد نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جمائی شیطان کی طرف سے ہے ۔ پس جب کسی کو جمائی آئے تو جہاں تک ہو سکے اسے روکے ۔ کیونکہ جب کوئی ( جمائی لیتے ہوئے ) ” ہاہا “ کرتا ہے تو شیطان اس پر ہنستا ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 130050,
        "last_updated": null
    },
    {
        "urduURN": 4032470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3290,
        "hadithSanad": "ہم سے زکریابن یحییٰ نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، کہا کہ ہشام نے ہمیں اپنے والد عروہ سے خبر دی اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا ، کہا کہ",
        "hadithText": "احد کی لڑائی میں جب مشرکین کو شکست ہو گئی تو ابلیس نے چلا کر کہا کہ اے اللہ کے بندو ! ( یعنی مسلمانو ) اپنے پیچھے والوں سے بچو ، چنانچہ آگے کے مسلمان پیچھے کی طرف پل پڑے اور پیچھے والوں کو ( جو مسلمان ہی تھے ) انہوں نے مارنا شروع کر دیا ۔ حذیفہ رضی اللہ عنہ نے دیکھا تو ان کے والد یمان رضی اللہ عنہ بھی پیچھے تھے ۔ انہوں نے بہتیرا کہا کہ اے اللہ کے بندو ! یہ میرے والد ہیں ، یہ میرے والد ہیں ۔ لیکن خدا گواہ ہے کہ لوگوں نے جب تک انہیں قتل نہ کر لیا نہ چھوڑا ۔ بعد میں حذیفہ رضی اللہ عنہ نے صرف اتنا کہا کہ خیر ۔ اللہ تمہیں معاف کرے ( کہ تم نے غلط فہمی سے ایک مسلمان کو مار ڈالا ) عروہ نے بیان کیا کہ پھر حذیفہ رضی اللہ عنہ اپنے والد کے قاتلوں کے لیے برابر مغفرت کی دعا کرتے رہے ۔ تاآنکہ اللہ سے جا ملے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 130060,
        "last_updated": null
    },
    {
        "urduURN": 4032480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3291,
        "hadithSanad": "ہم سے حسن بن ربیع نے بیان کیا ، کہا ہم سے ابوالاحوص نے ، ان سے اشعث نے ، ان سے ان کے والد نے ، ان سے مسروق نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے نماز میں ادھر ادھر دیکھنے کے متعلق پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ شیطان کی ایک اچک ہے جو وہ تم میں سے ایک کی نماز سے کچھ اچک لیتا ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 130070,
        "last_updated": null
    },
    {
        "urduURN": 4032490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3292,
        "hadithSanad": "( دوسری سند ) ہم سے ابوالمغیرہ نے بیان کیا ، کہا ہم سے اوزاعی نے بیان کیا ، کہا کہ مجھ سے یحییٰ بن ابی کثیر نے بیان کیا ، ان سے عبداللہ بن ابی قتادہ نے ، ان سے ان کے والد نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے ( مثل روایت سابقہ کی حدیث بیان کی ) مجھ سے سلیمان بن عبدالرحمن نے بیان کیا ، کہا ہم سے ولید نے بیان کیا ، کہا ہم سے اوزاعی نے بیان کیا ، کہا کہ",
        "hadithText": "مجھ سے یحییٰ بن ابی کثیر نے بیان کیا ، کہا کہ مجھ سے عبداللہ بن ابی قتادہ نے بیان کیا اور ان سے ان کے والد نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اچھا خواب اللہ تعالیٰ کی طرف سے ہے اور برا خواب شیطان کی طرف سے ہے ۔ اس لیے اگر کوئی برا اور ڈراونا خواب دیکھے تو بائیں طرف تھوتھو کر کے شیطان کے شر سے اللہ کی پناہ مانگے ۔ اس عمل سے شیطان اسے کوئی نقصان نہ پہنچا سکے گا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 130080,
        "last_updated": null
    },
    {
        "urduURN": 4032500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3293,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں ابوبکر کے غلام سمی نے ، انہیں ابوصالح نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جو شخص دن بھر میں سو مرتبہ یہ دعا پڑھے گا ( ترجمہ ) ” نہیں ہے کوئی معبود ، سوا اللہ تعالیٰ کے ، اس کا کوئی شریک نہیں ، ملک اسی کا ہے ۔ اور تمام تعریف اسی کے لیے ہے اور وہ ہر چیز پر قادر ہے ۔ “ تو اسے دس غلام آزاد کرنے کے برابر ثواب ملے گا ۔ سو نیکیاں اس کے نامہ اعمال میں لکھی جائیں گی اور سو برائیاں اس سے مٹا دی جائیں گی ۔ اس روز دن بھر یہ دعا شیطان سے اس کی حفاظت کرتی رہے گی ۔ تاآنکہ شام ہو جائے اور کوئی شخص اس سے بہتر عمل لے کر نہ آئے گا ، مگر جو اس سے بھی زیادہ یہ کلمہ پڑھ لے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 130090,
        "last_updated": null
    },
    {
        "urduURN": 4032510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3294,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے یعقوب بن ابراہیم نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، ان سے صالح نے ، ان سے ابن شہاب نے بیان کیا ، کہا کہ مجھے عبدالحمید بن عبدالرحمن بن زید نے خبر دی ، انہیں محمد بن سعد بن ابی وقاص ( رضی اللہ عنہ ) نے خبر دی اور ان سے ان کے والد حضرت سعد بن ابی وقاص نے بیان کیا کہ",
        "hadithText": "ایک دفعہ عمر رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہونے کی اجازت چاہی ۔ اس وقت چند قریشی عورتیں ( خود آپ کی بیویاں ) آپ کے پاس بیٹھی آپ سے گفتگو کر رہی تھیں اور آپ سے ( خرچ میں ) بڑھانے کا سوال کر رہی تھیں ۔ خوب آواز بلند کر کے ۔ لیکن جونہی حضرت عمر رضی اللہ عنہ نے اجازت چاہی ، وہ خواتین جلدی سے پردے کے پیچھے چلی گئیں ۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے انہیں اجازت دی ، آنحضرت صلی اللہ علیہ وسلم مسکرا رہے تھے ۔ عمر رضی اللہ عنہ نے کہا ، اللہ تعالیٰ ہمیشہ آپ کو ہنساتا رکھے ، یا رسول اللہ ! آپ نے فرمایا کہ مجھے ان عورتوں پر تعجب ہوا ابھی ابھی میرے پاس تھیں ، لیکن جب تمہاری آواز سنی تو پردے کے پیچھے جلدی سے بھاگ گئیں ۔ حضرت عمر رضی اللہ عنہ نے عرض کیا ، لیکن آپ یا رسول اللہ ! زیادہ اس کے مستحق تھے کہ آپ سے یہ ڈرتیں ، پھر انہوں نے کہا ، اے اپنی جانوں کے دشمنو ! مجھ سے تو تم ڈرتی ہو اور آنحضرت صلی اللہ علیہ وسلم سے نہیں ڈرتیں ۔ ازواج مطہرات بولیں کہ واقعہ یہی ہے کیونکہ آپ رسول اللہ صلی اللہ علیہ وسلم کے برخلاف مزاج میں بہت سخت ہیں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، اس ذات کی قسم ! جس کے ہاتھ میں میری جان ہے ، اگر شیطان بھی کہیں راستے میں تم سے مل جائے ، تو جھٹ وہ راستہ چھوڑ کر دوسرا راستہ اختیار کر لیتا ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 130100,
        "last_updated": null
    },
    {
        "urduURN": 4032520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3295,
        "hadithSanad": "ہم سے ابراہیم بن حمزہ نے بیان کیا ، کہا مجھ سے ابن ابی حازم نے بیان کیا ، ان سے یزید نے ، ان سے محمد بن ابراہیم نے ، ان سے عیسیٰ بن طلحہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جب کوئی شخص سو کر اٹھے اور پھر وضو کرے تو تین مرتبہ ناک جھاڑے ، کیونکہ شیطان رات بھر اس کی ناک کے نتھنے پر بیٹھا رہتا ہے ۔ ( جس سے آدمی پر سستی غالب آجاتی ہے ۔ پس ناک جھاڑنے سے وہ سستی دور ہو جائے گی ) ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 130110,
        "last_updated": null
    },
    {
        "urduURN": 4032530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3296,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے امام مالک نے ، ان سے عبدالرحمن بن عبداللہ بن عبدالرحمن بن ابی صعصعہ انصاری نے اور انہیں ان کے والد نے خبر دی کہ",
        "hadithText": "ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے کہا میں دیکھتا ہوں کہ تم کو جنگل میں رہ کر بکریاں چرانا بہت پسند ہے ۔ اس لیے جب کبھی اپنی بکریوں کے ساتھ تم کسی بیابان میں موجود ہو اور ( وقت ہونے پر ) نماز کے لیے اذان دو تو اذان دیتے ہوئے اپنی آواز خوب بلند کرو ، کیونکہ مؤذن کی آواز اذان کو جہاں تک بھی کوئی انسان ، جن یا کوئی چیز بھی سنے گی تو قیامت کے دن اس کے لیے گواہی دے گی ۔ حضرت ابوسعید رضی اللہ عنہ نے کہا کہ یہ حدیث میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنی تھی ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 130120,
        "last_updated": null
    },
    {
        "urduURN": 4032540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3297,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، انہوں نے کہا ہم سے ہشام بن یوسف نے بیان کیا ، ان سے معمر نے بیان کیا ، ان سے زہری نے بیان کیا ، ان سے سالم نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ۔ آپ منبر پر خطبہ دیتے ہوئے فرما رہے تھے کہ سانپوں کو مار ڈالا کرو ( خصوصاً ) ان کو جن کے سروں پر دو نقطے ہوتے ہیں اور دم بریدہ سانپ کو بھی ، کیونکہ دونوں آنکھ کی روشنی تک ختم کر دیتے ہیں اور حمل تک گرا دیتے ہیں ۔ \n<span class=urdu_sanad>عبداللہ بن عمر رضی اللہ عنہمانے کہا کہ</span> ایک مرتبہ میں ایک سانپ کو مارنے کی کوشش کر رہا تھا کہ مجھ سے ابو لبابہ رضی اللہ عنہ نے پکار کر کہا کہ اسے نہ مارو ، میں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے تو سانپوں کے مارنے کا حکم دیا تھا ۔ انہوں نے بتایا کہ بعد میں پھر آنحضرت نے گھروں میں رہنے والے سانپوں کو جو جن ہوتے ہیں دفعتاً مار ڈالنے سے منع فرمایا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 130131,
        "last_updated": null
    },
    {
        "urduURN": 4032560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3299,
        "hadithSanad": "اور عبدالرزاق نے بھی اس حدیث کو معمر سے روایت کیا ، اس میں یوں ہے کہ",
        "hadithText": "مجھ کو ابولبابہ رضی اللہ عنہ نے دیکھا یا میرے چچا زید بن خطاب نے اور معمر کے ساتھ اس حدیث کو یونس اور ابن عیینہ اور اسحاق کلبی اور زبیدہ نے بھی زہری سے روایت کیا اور صالح اور سالم سے ، انہوں نے ابن ابی حفصہ اور ابن مجمع نے بھی زہری سے انہوں نے ابن عمر رضی اللہ عنہما سے اس میں یوں ہے کہ مجھ کو ابولبابہ اور زید بن خطاب ( دونوں ) نے دیکھا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 130150,
        "last_updated": null
    },
    {
        "urduURN": 4032570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3300,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے عبدالرحمن بن عبداللہ بن عبدالرحمن بن ابی صعصعہ نے ، ان سے ان کے والد نے ، اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، ایک زمانہ آئے گا جب مسلمان کا سب سے عمدہ مال اس کی وہ بکریاں ہوں گی جنہیں وہ پہاڑ کی چوٹیوں اور بارش کی وادیوں میں لے کر چلا جائے گا تاکہ اس طرح اپنے دین و ایمان کو فتنوں سے بچا لے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 130160,
        "last_updated": null
    },
    {
        "urduURN": 4032580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3301,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو امام مالک نے خبر دی ، انہیں ابوالزناد نے خبر دی ، انہیں اعرج نے خبر دی ، اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، کفر کی چوٹی مشرق میں ہے اور فخر اور تکبر کرنا گھوڑے والوں ، اونٹ والوں اور زمینداروں میں ہوتا ہے جو ( عموماً ) گاؤں کے رہنے والے ہوتے ہیں اور بکری والوں میں دل جمعی ہوتی ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 130170,
        "last_updated": null
    },
    {
        "urduURN": 4032590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3302,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ قطان نے بیان کیا ، ان سے اسماعیل نے بیان کیا کہ مجھ سے قیس نے بیان کیا اور ان سے عقبہ بن عمرو ابومسعود رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے یمن کی طرف اپنے ہاتھ سے اشارہ کرتے ہوئے فرمایا کہ ایمان تو ادھر ہے یمن میں ! ہاں ، اور قساوت اور سخت دلی ان لوگوں میں ہے جو اونٹوں کی دمیں پکڑے چلاتے رہتے ہیں ۔ جہاں سے شیطان کی چوٹیاں نمودار ہوں گی ، یعنی ربیعہ اور مضر کی قوموں میں ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 130180,
        "last_updated": null
    },
    {
        "urduURN": 4032600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3303,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے جعفر بن ربیعہ نے ، ان سے اعرج نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جب مرغ کی بانگ سنو تو اللہ سے اس کے فضل کا سوال کیا کرو ، کیونکہ اس نے فرشتے کو دیکھا ہے اور جب گدھے کی آواز سنو تو شیطان سے اللہ کی پناہ مانگو کیونکہ اس نے شیطان کو دیکھا ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 130190,
        "last_updated": null
    },
    {
        "urduURN": 4032610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3304,
        "hadithSanad": "ہم سے اسحاق بن راہویہ نے بیان کیا ، کہا ہم کو روح بن عبادہ نے خبر دی ، کہا ہم کو ابن جریج نے خبر دی ، کہا کہ مجھے عطابن ابی رباح نے خبر دی اور انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جب رات کا اندھیرا شروع ہو یا ( آپ نے یہ فرمایا کہ ) جب شام ہو جائے تو اپنے بچوں کو اپنے پاس روک لیا کرو ، کیونکہ شیاطین اسی وقت پھیلتے ہیں ۔ البتہ جب ایک گھڑی رات گزر جائے تو انہیں چھوڑ دو ، اور اللہ کا نام لے کر دروازے بند کر لو ، کیوں کے شیطان کسی بند دروازے کو نہیں کھول سکتا ، ابن جریج نے بیان کیا کہ مجھے عمرو بن دینار نے خبر دی کہ انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہما سے بالکل اسی طرح حدیث سنی تھی جس طرح مجھے عطاء نے خبر دی تھی ، البتہ انہوں نے اس کا ذکر نہیں کیا کہ ” اللہ کا نام لو “ ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 130200,
        "last_updated": null
    },
    {
        "urduURN": 4032620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3305,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے وہیب نے ، ان سے خالد نے ان سے محمد بن سیرین نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، بنی اسرائیل میں کچھ لوگ غائب ہو گئے ۔ ( ان کی صورتیں مسخ ہو گئیں ) میرا تو یہ خیال ہے کہ انہیں چوہے کی صورت میں مسخ کر دیا گیا ۔ کیونکہ چوہوں کے سامنے جب اونٹ کا دودھ رکھا جاتا ہے تو وہ اسے نہیں پیتے ( کیونکہ بنی اسرائیل کے دین میں اونٹ کا گوشت حرام تھا ) اور اگر بکری کا دودھ رکھا جائے تو پی جاتے ہیں ۔ پھر میں نے یہ حدیث کعب احبار سے بیان کی تو انہوں نے ( حیرت سے ) پوچھا ، کیا واقعی آپ نے آنحضرت صلی اللہ علیہ وسلم یہ حدیث سنی ہے ؟ کئی مرتبہ انہوں نے یہ سوال کیا ۔ اس پر میں نے کہا ( کہ آنحضرت صلی اللہ علیہ وسلم سے نہیں سنی تو پھر کس سے ) کیا میں توراۃ پڑھا کرتا ہوں ؟ ( کہ اس سے نقل کر کے بیان کرتا ہوں ) ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 113,
        "matchingArabicURN": 130210,
        "last_updated": null
    },
    {
        "urduURN": 4032630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3306,
        "hadithSanad": "ہم سے سعید بن عفیر نے بیان کیا ، ان سے ابن وہب نے بیان کیا ، کہا کہ مجھ سے یونس نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عروہ نے ، انہوں نے عائشہ رضی اللہ عنہا سے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے گرگٹ ( چھپکلی ) کے متعلق فرمایا کہ وہ موذی جانور ہے لیکن میں نے آپ سے اسے مار ڈالنے کا حکم نہیں سنا تھا اور سعد بن ابی وقاص بتاتے تھے کہ آنحضرت صلی اللہ علیہ وسلم نے اسے مار ڈالنے کا حکم فرمایا ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 114,
        "matchingArabicURN": 130220,
        "last_updated": null
    },
    {
        "urduURN": 4032640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3307,
        "hadithSanad": "ہم سے صدقہ نے بیان کیا ، انہوں نے کہا ہم کو ابن عیینہ نے خبر دی ، انہوں نے کہا ہم سے عبدالحمید بن جبیر بن شیبہ نے بیان کیا ، ان سے سعید بن مسیب نے بیان کیا اور انہیں ام شریک رضی اللہ عنہا نے خبر دی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے گرگٹ کو مار ڈالنے کا حکم فرمایا ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 115,
        "matchingArabicURN": 130230,
        "last_updated": null
    },
    {
        "urduURN": 4032650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3308,
        "hadithSanad": "ہم سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جس سانپ کے سر پر دو نقطے ہوتے ہیں ، انہیں مار ڈالا کرو ، کیونکہ وہ اندھا بنا دیتے ہیں اور حمل کو بھی نقصان پہنچاتے ہیں ۔ ابواسامہ کے ساتھ اس کو حماد بن سلمہ نے بھی روایت کیا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 116,
        "matchingArabicURN": 130240,
        "last_updated": null
    },
    {
        "urduURN": 4032660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3309,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ قطان نے بیان کیا ، ان سے ہشام نے بیان کیا ، ان سے ان کے والد نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے دم بریدہ سانپ کو مار ڈالنے کا حکم دیا اور فرمایا کہ یہ آنکھوں کو نقصان پہنچاتا ہے اور حمل کو ساقط کر دیتا ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 117,
        "matchingArabicURN": 130250,
        "last_updated": null
    },
    {
        "urduURN": 4032670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3310,
        "hadithSanad": "ہم سے عمرو بن علی فلاس نے بیان کیا ، کہا ہم سے ابن ابی عدی نے بیان کیا ، ان سے ابویونس قشیری ( حاتم بن ابی صغیرہ ) نے ، ان سے ابن ابی ملیکہ نے کہ",
        "hadithText": "ابن عمر رضی اللہ عنہما سانپوں کو پہلے مار ڈالا کرتے تھے لیکن بعد میں انہیں مارنے سے خود ہی منع کرنے لگے ۔ انہوں نے بیان کیا کہ نبی کریم کریم صلی اللہ علیہ وسلم نے اپنی ایک دیوار گروائی تو اس میں سے ایک سانپ کی کینچلی نکلی ، آپ نے فرمایا کہ دیکھو ، وہ سانپ کہاں ہے ۔ صحابہ رضی اللہ عنہم نے تلاش کیا ( اور وہ مل گیا تو ) آپ نے فرمایا کہ اسے مار ڈالو ، میں بھی اسی وجہ سے سانپوں کو مار ڈالا کرتا تھا ۔ \n<span class=urdu_sanad>پھرمیری ملاقات ایک دن ابولبابہ رضی اللہ عنہ سے ہوئی ، تو انہوں نے مجھے خبر دی کہ</span> نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، کہ پتلے یا سفید سانپوں کو نہ مارا کرو ۔ البتہ دم کٹے ہوئے سانپ کو جس پر دو سفید دھاریاں ہوتی ہیں اس کو مار ڈالو ، کیونکہ یہ اتنا زہریلا ہے کہ حاملہ کے حمل کو گرا دیتا ہے اور آدمی کو اندھا بنا دیتا ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 118,
        "matchingArabicURN": 130261,
        "last_updated": null
    },
    {
        "urduURN": 4032690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3312,
        "hadithSanad": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے جریر بن حازم نے بیان کیا اور ان سے نافع نے کہ",
        "hadithText": "ابن عمر رضی اللہ عنہما سانپوں کو مار ڈالا کرتے تھے ۔ \n<span class=urdu_sanad>پھر ان سے ابولبابہ رضی اللہ عنہ نے بیان کیا کہ</span> نبی کریم صلی اللہ علیہ وسلم نے گھروں کے پتلے یا سفید سانپوں کو مارنے سے منع فرمایا ہے تو انہوں نے مارنا چھوڑ دیا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 119,
        "matchingArabicURN": 130280,
        "last_updated": null
    },
    {
        "urduURN": 4032710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3314,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، کہا ہم سے معمر نے بیان کیا ، ان سے زہری نے ، ان سے عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، پانچ جانور موذی ہیں ، انہیں حرم میں بھی مارا جا سکتا ہے ( توحل میں بطریق اولیٰ ان کا مارنا جائز ہو گا ) چوہا ، بچھو ، چیل ، کوا اور کاٹ لینے والا کتا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 120,
        "matchingArabicURN": 130290,
        "last_updated": null
    },
    {
        "urduURN": 4032720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3315,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، انہوں نے کہا ہم کو امام مالک نے خبر دی ، انہیں عبداللہ بن دینار نے اور انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، پانچ جانور ایسے ہیں جنہیں اگر کوئی شخص حالت احرام میں بھی مار ڈالے تو اس پر کوئی گناہ نہیں ۔ بچھو ، چوہا ، کاٹ لینے والا کتا ، کوا اور چیل ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 121,
        "matchingArabicURN": 130300,
        "last_updated": null
    },
    {
        "urduURN": 4032730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3316,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے کثیر نے ، ان سے عطاء نے اور ان سے حضرت جابر بن عبداللہ رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، پانی کے برتنوں کو ڈھک لیا کرو ، مشکیزوں ( کے منہ ) کو باندھ لیا کرو ، دروازے بند کر لیا کرو اور اپنے بچوں کو اپنے پاس جمع کر لیا کرو ، کیونکہ شام ہوتے ہی جنات ( روئے زمین پر ) پھیلتے ہیں اور اچکتے پھرتے ہیں اور سوتے وقت چراغ بجھا لیا کرو ، کیونکہ موذی جانور ( چوہا ) بعض اوقات جلتی بتی کو کھینچ لاتا ہے اور اس طرح سارے گھر کو جلا دیتا ہے ۔ ابن جریج اور حبیب نے بھی اس کو عطاء سے روایت کیا ، اس میں جنات کے بدل شیاطین مذکور ہیں ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 122,
        "matchingArabicURN": 130310,
        "last_updated": null
    },
    {
        "urduURN": 4032740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3317,
        "hadithSanad": "ہم سے عبدہ بن عبداللہ نے بیان کیا ، کہا ہم کو یحییٰ بن آدم نے خبر دی ، انہیں اسرائیل نے ، انہیں منصور نے ، انہیں ابراہیم نے ، انہیں علقمہ نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "( مقام منیٰ میں ) ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک غار میں بیٹھے ہوئے تھے کہ آیت » والمرسلات عرفا « نازل ہوئی ، ابھی ہم آپ کی زبان مبارک سے اسے سن ہی رہے تھے کہ ایک بل میں سے ایک سانپ نکلا ۔ ہم اسے مارنے کے لیے جھپٹے ، لیکن وہ بھاگ گیا اور اپنے بل میں داخل ہو گیا ، ( آنحضرت صلی اللہ علیہ وسلم نے ) اس پر فرمایا ، تمہارے ہاتھ سے وہ اسی طرح بچ نکلا جیسے تم اس کے شر سے بچ گئے اور یحییٰ نے اسرائیل سے روایت کیا ہے ، ان سے اعمش نے ، ان سے ابراہیم نے ، ان سے علقمہ نے اور ان سے عبداللہ رضی اللہ عنہ نے اسی طرح روایت کیا اور کہا کہ آنحضرت صلی اللہ علیہ وسلم کی زبان مبارک سے اس سورۃ کو تازہ بتازہ سن رہے تھے اور اسرائیل کے ساتھ اس حدیث کو ابوعوانہ نے مغیرہ سے روایت کیا اور حفص بن غیاث اور ابومعاویہ اور سلیمان بن قرم نے بھی اعمش سے بیان کیا ، ان سے ابراہیم نے ، ان سے اسود نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 123,
        "matchingArabicURN": 130320,
        "last_updated": null
    },
    {
        "urduURN": 4032750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3318,
        "hadithSanad": "ہم سے نصر بن علی نے بیان کیا ، انہوں نے کہا ہم کو عبدالاعلیٰ نے خبر دی ، انہوں نے کہا ہم سے عبیداللہ بن عمر نے بیان کیا ، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے بیان کیا ، ایک عورت ایک بلی کے سبب سے دوزخ میں گئی ، اس نے بلی کو باندھ کر رکھا نہ تو اسے کھانا دیا اور نہ ہی چھوڑا کہ وہ کیڑے مکوڑے کھا کر اپنی جان بچا لیتی ۔ عبدالاعلیٰ نے کہا اور ہم سے عبیداللہ نے بیان کیا ، ان سے سعید مقبری نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے اسی طرح روایت کیا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 124,
        "matchingArabicURN": 130330,
        "last_updated": null
    },
    {
        "urduURN": 4032760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3319,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابوالزناد نے ، ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، گروہ انبیاء میں سے ایک نبی ایک درخت کے سائے میں اترے ، وہاں انہیں کسی ایک چیونٹی نے کاٹ لیا ۔ تو انہوں نے حکم دیا ، ان کا سارا سامان درخت کے تلے سے اٹھا لیا گیا ۔ پھر چیونٹیوں کا سارا چھتہ جلوا دیا ۔ اس پر اللہ تعالیٰ نے ان پر وحی بھیجی کہ تم کو تو ایک ہی چیونٹی نے کاٹا تھا ، فقط اسی کو جلانا تھا ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 125,
        "matchingArabicURN": 130340,
        "last_updated": null
    },
    {
        "urduURN": 4032770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3320,
        "hadithSanad": "ہم سے خالد بن مخلد نے بیان کیا ، انہوں نے کہا ہم سے سلیمان بن بلال نے بیان کیا ، انہوں نے کہا کہ مجھ سے عتبہ بن مسلم نے بیان کیا ، انہوں نے کہا کہ مجھے عبید بن حنین نے خبر دی ، انہوں نے کہا کہ میں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، وہ بیان کرتے تھے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جب مکھی کسی کے پینے ( یا کھانے کی چیز ) میں پڑ جائے تو اسے ڈبو دے اور پھر نکال کر پھینک دے ۔ کیونکہ اس کے ایک پر میں بیماری ہے اور اس کے دوسرے ( پر ) میں شفاء ہوتی ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 126,
        "matchingArabicURN": 130350,
        "last_updated": null
    },
    {
        "urduURN": 4032780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3321,
        "hadithSanad": "ہم سے حسن بن صباح نے بیان کیا ، کہا ہم سے اسحاق ازرق نے بیان کیا ، کہا ہم سے عوف نے بیان کیا ، ان سے حسن اور ابن سیرین نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، ایک فاحشہ عورت صرف اس وجہ سے بخشی گئی کہ وہ ایک کتے کے قریب سے گزر رہی تھی ، جو ایک کنویں کے قریب کھڑا پیاسا ہانپ رہا تھا ۔ ایسا معلوم ہوتا تھا کہ وہ پیاس کی شدت سے ابھی مر جائے گا ۔ اس عورت نے اپنا موزہ نکالا اور اس میں اپنا دوپٹہ باندھ کر پانی نکالا اور اس کتے کو پلا دیا ، تو اس کی بخشش اسی ( نیکی ) کی وجہ سے ہو گئی ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 127,
        "matchingArabicURN": 130360,
        "last_updated": null
    },
    {
        "urduURN": 4032790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3322,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، کہا کہ میں نے زہری سے اس حدیث کو اس طرح یاد رکھا کہ",
        "hadithText": "مجھ کو کوئی شک ہی نہیں ، جیسے اس میں شک نہیں کہ تو اس جگہ موجود ہے ۔ ( انہوں نے بیان کیا کہ ) مجھے عبیداللہ نے خبر دی ، انہیں ابن عباس رضی اللہ عنہما نے اور انہیں ابوطلحہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( رحمت کے ) فرشتے ان گھروں میں نہیں داخل ہوتے جن میں کتا یا ( جاندار کی ) تصویر ہو ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 128,
        "matchingArabicURN": 130370,
        "last_updated": null
    },
    {
        "urduURN": 4032800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3323,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو امام مالک نے خبر دی ، انہیں نافع نے اور انہیں حضرت عبداللہ بن عمر رضی اللہ عنہمانے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے کتوں کو مارنے کا حکم فرمایا ہے ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 129,
        "matchingArabicURN": 130380,
        "last_updated": null
    },
    {
        "urduURN": 4032810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3324,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، ان سے یحییٰ نے بیان کیا ، ان سے ابوسلمہ نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جو شخص کتا پالے ، اس کے عمل نیک میں سے روزانہ ایک قیراط ( ثواب ) کم کر دیا جاتا ہے ، کھیت کے لیے یا مویشی کے لیے جو کتے پالے جائیں وہ اس سے الگ ہیں ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 130,
        "matchingArabicURN": 130390,
        "last_updated": null
    },
    {
        "urduURN": 4032820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 59,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3325,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، کہا ہم سے سلیمان نے بیان کیا ، کہا کہ مجھے یزید بن خصیفہ نے خبر دی ، کہا کہ مجھے سائب بن یزید نے خبر دی ، انہوں نے سفیان بن ابی زہیر شنوی رضی اللہ عنہ سے سنا ، انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا ، کہ",
        "hadithText": "جس نے کوئی کتا پالا ، نہ تو پالنے والے کا مقصد کھیت کی حفاظت ہے اور نہ مویشیوں کی ، تو روزانہ اس کے نیک عمل میں سے ایک قیراط ( ثواب ) کی کمی ہو جاتی ہے ۔ سائب نے پوچھا ، کیا تم نے خود یہ حدیث رسول کریم صلی اللہ علیہ وسلم سے سنی تھی ؟ انہوں نے کہا ، ہاں ! اس قبلہ کے رب کی قسم ( میں نے خود اس حدیث کو رسول کریم صلی اللہ علیہ وسلم سے سنا ہے ) ۔</b>",
        "bookID": "59.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 131,
        "matchingArabicURN": 130400,
        "last_updated": null
    }
]