[
    {
        "urduURN": 4002950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 294,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے ، کہا میں نے عبدالرحمٰن بن قاسم سے سنا ، کہا میں نے قاسم سے سنا ۔ وہ کہتے تھے میں نے حضرت عائشہ رضی اللہ عنہا سے سنا ۔ آپ فرماتی تھیں کہ",
        "hadithText": "ہم حج کے ارادہ سے نکلے ۔ جب ہم مقام سرف میں پہنچے تو میں حائضہ ہو گئی اور اس رنج میں رونے لگی کہ رسول اللہ صلی اللہ علیہ وسلم تشریف لائے ، آپ صلی اللہ علیہ وسلم نے پوچھا تمہیں کیا ہو گیا ۔ کیا حائضہ ہو گئی ہو ۔ میں نے کہا ، ہاں ! آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ ایک ایسی چیز ہے جس کو اللہ تعالیٰ نے آدم کی بیٹیوں کے لیے لکھ دیا ہے ۔ اس لیے تم بھی حج کے افعال پورے کر لو ۔ البتہ بیت اللہ کا طواف نہ کرنا ۔ حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ رسول کریم صلی اللہ علیہ وسلم نے اپنی بیویوں کی طرف سے گائے کی قربانی کی ۔ ( سرف ایک مقام مکہ سے چھ سات میل کے فاصلہ پر ہے ) ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 102950,
        "last_updated": null
    },
    {
        "urduURN": 4002960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 295,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہمیں خبر دی مالک نے ہشام بن عروہ سے ، وہ اپنے والد سے ، وہ عائشہ رضی اللہ عنہا سے نقل کرتے ہیں کہ آپ نے فرمایا",
        "hadithText": "میں رسول اللہ صلی اللہ علیہ وسلم کے سر مبارک کو حائضہ ہونے کی حالت میں بھی کنگھا کیا کرتی تھی ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 102960,
        "last_updated": null
    },
    {
        "urduURN": 4002970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 296,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، انھوں نے کہا ہم سے ہشام بن یوسف نے بیان کیا ، انھوں نے کہا ابن جریج نے انہیں خبر دی ، انھوں نے کہا مجھے ہشام بن عروہ نے عروہ کے واسطے سے بتایا کہ",
        "hadithText": "ان سے سوال کیا گیا ، کیا حائضہ بیوی میری خدمت کر سکتی ہے ، یا ناپاکی کی حالت میں عورت مجھ سے نزدیک ہو سکتی ہے ؟ عروہ نے فرمایا میرے نزدیک تو اس میں کوئی حرج نہیں ہے ۔ اس طرح کہ عورتیں میری بھی خدمت کرتی ہیں اور اس میں کسی کے لیے بھی کوئی حرج نہیں ۔ اس لیے کہ مجھے حضرت عائشہ رضی اللہ عنہا نے خبر دی کہ وہ رسول کریم صلی اللہ علیہ وسلم کو حائضہ ہونے کی حالت میں کنگھا کیا کرتی تھیں اور رسول اللہ صلی اللہ علیہ وسلم اس وقت مسجد میں معتکف ہوتے ۔ آپ اپنا سر مبارک قریب کر دیتے اور حضرت عائشہ رضی اللہ عنہا اپنے حجرہ ہی سے کنگھا کر دیتیں ، حالانکہ وہ حائضہ ہوتیں ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 102970,
        "last_updated": null
    },
    {
        "urduURN": 4002980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 297,
        "hadithSanad": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، انھوں نے زہیر سے سنا ، انھوں نے منصور بن صفیہ سے کہ ان کی ماں نے ان سے بیان کیا کہ عائشہ رضی اللہ عنہا نے ان سے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم میری گود میں سر رکھ کر قرآن مجید پڑھتے ، حالانکہ میں اس وقت حیض والی ہوتی تھی ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 102980,
        "last_updated": null
    },
    {
        "urduURN": 4002990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 298,
        "hadithSanad": "ہم سے مکی بن ابراہیم نے بیان کیا ، انھوں نے کہا ہم سے ہشام نے یحییٰ بن کثیر کے واسطہ سے بیان کیا ، انھوں نے ابوسلمہ سے کہ زینب بنت ام سلمہ نے ان سے بیان کیا اور ان سے ام سلمہ رضی اللہ عنہا نے کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک چادر میں لیٹی ہوئی تھی ، اتنے میں مجھے حیض آ گیا ۔ اس لیے میں آہستہ سے باہر نکل آئی اور اپنے حیض کے کپڑے پہن لیے ۔ نبی کریم صلی اللہ علیہ وسلم نے پوچھا کیا تمہیں نفاس آ گیا ہے ؟ میں نے عرض کیا ہاں ۔ پھر مجھے آپ صلی اللہ علیہ وسلم نے بلا لیا ، اور میں چادر میں آپ صلی اللہ علیہ وسلم کے ساتھ لیٹ گئی ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 102990,
        "last_updated": null
    },
    {
        "urduURN": 4003000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 299,
        "hadithSanad": "ہم سے قبیصہ بن عقبہ نے بیان کیا ، انھوں نے کہا ہم سے سفیان ثوری نے منصور بن معمر کے واسطے سے ، وہ ابراہیم نخعی سے ، وہ اسود سے ، وہ حضرت عائشہ رضی اللہ عنہا سے نقل کرتے ہیں کہ",
        "hadithText": "انھوں نے فرمایا میں اور نبی کریم صلی اللہ علیہ وسلم ایک ہی برتن میں غسل کرتے تھے ۔ حالانکہ دونوں جنبی ہوتے ۔\nاور آپ صلی اللہ علیہ وسلم مجھے حکم فرماتے ، پس میں ازار باندھ لیتی ، پھر آپ صلی اللہ علیہ وسلم میرے ساتھ مباشرت کرتے ، اس وقت میں حائضہ ہوتی ۔\t\nاور آپ صلی اللہ علیہ وسلم اپنا سرمبارک میری طرف کر دیتے ۔ اس وقت آپ صلی اللہ علیہ وسلم اعتکاف میں بیٹھے ہوئے ہوتے اور میں حیض کی حالت میں ہونے کے باوجود آپ صلی اللہ علیہ وسلم کا سر مبارک دھو دیتی ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 103002,
        "last_updated": null
    },
    {
        "urduURN": 4003030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 302,
        "hadithSanad": "ہم سے اسماعیل بن خلیل نے بیان کیا ، کہا ہم سے علی بن مسہر نے ، ہم سے ابواسحاق سلیمان بن فیروز شیبانی نے عبدالرحمٰن بن اسود کے واسطہ سے ، وہ اپنے والد اسود بن یزید سے ، وہ حضرت عائشہ رضی اللہ عنہا سے کہ",
        "hadithText": "آپ نے فرمایا ہم ازواج میں سے کوئی جب حائضہ ہوتی ، اس حالت میں رسول اللہ صلی اللہ علیہ وسلم اگر مباشرت کا ارادہ کرتے تو آپ صلی اللہ علیہ وسلم ازار باندھنے کا حکم دے دیتے باوجود حیض کی زیادتی کے ۔ پھر بدن سے بدن ملاتے ، آپ نے کہا تم میں ایسا کون ہے جو نبی کریم صلی اللہ علیہ وسلم کی طرح اپنی شہوت پر قابو رکھتا ہو ۔ اس حدیث کی متابعت خالد اور جریر نے شیبانی کی روایت سے کی ہے ۔ ( یہاں بھی مباشرت سے ساتھ لیٹنا بیٹھنا مراد ہے ) ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 103030,
        "last_updated": null
    },
    {
        "urduURN": 4003040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 303,
        "hadithSanad": "ہم سے ابوالنعمان محمد بن فضل نے بیان کیا ، انھوں نے کہا ہم سے عبدالواحد بن زیاد نے بیان کیا ، انھوں نے کہا ہم سے ابواسحاق شیبانی نے بیان کیا ، انھوں نے کہا ہم سے عبداللہ بن شداد نے بیان کیا ، انھوں نے کہا میں نے میمونہ سے سنا ، انھوں نے کہا کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم اپنی بیویوں میں سے کسی سے مباشرت کرنا چاہتے اور وہ حائضہ ہوتی ، تو آپ صلی اللہ علیہ وسلم کے حکم سے ، وہ پہلے ازار باندھ لیتیں ۔ اور سفیان نے شیبانی سے اس کو روایت کیا ہے ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 103040,
        "last_updated": null
    },
    {
        "urduURN": 4003050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 304,
        "hadithSanad": "ہم سے سعید بن ابی مریم نے بیان کیا ، انھوں نے کہا ہم سے محمد بن جعفر نے بیان کیا ، انھوں نے کہا مجھے زید نے اور یہ زید اسلم کے بیٹے ہیں ، انھوں نے عیاض بن عبداللہ سے ، انھوں نے حضرت ابو سعید خدری رضی اللہ عنہ سے کہ آپ نے فرمایا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم عیدالاضحی یا عیدالفطر میں عیدگاہ تشریف لے گئے ۔ وہاں آپ صلی اللہ علیہ وسلم عورتوں کے پاس سے گزرے اور فرمایا اے عورتوں کی جماعت ! صدقہ کرو ، کیونکہ میں نے جہنم میں زیادہ تم ہی کو دیکھا ہے ۔ انھوں نے کہا یا رسول اللہ ! ایسا کیوں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم لعن طعن بہت کرتی ہو اور شوہر کی ناشکری کرتی ہو ، باوجود عقل اور دین میں ناقص ہونے کے میں نے تم سے زیادہ کسی کو بھی ایک عقلمند اور تجربہ کار آدمی کو دیوانہ بنا دینے والا نہیں دیکھا ۔ عورتوں نے عرض کی کہ ہمارے دین اور ہماری عقل میں نقصان کیا ہے یا رسول اللہ ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کیا عورت کی گواہی مرد کی گواہی سے نصف نہیں ہے ؟ انھوں نے کہا ، جی ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا بس یہی اس کی عقل کا نقصان ہے ۔ پھر آپ نے پوچھا کیا ایسا نہیں ہے کہ جب عورت حائضہ ہو تو نہ نماز پڑھ سکتی ہے نہ روزہ رکھ سکتی ہے ، عورتوں نے کہا ایسا ہی ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہی اس کے دین کا نقصان ہے ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 103050,
        "last_updated": null
    },
    {
        "urduURN": 4003060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 305,
        "hadithSanad": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، انھوں نے کہا ہم سے عبدالعزیز بن ابی سلمہ نے بیان کیا ، انھوں نے عبدالرحمٰن بن قاسم سے ، انھوں نے قاسم بن محمد سے ، وہ حضرت عائشہ رضی اللہ عنہا سے ، آپ نے فرمایا کہ",
        "hadithText": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حج کے لیے اس طرح نکلے کہ ہماری زبانوں پر حج کے علاوہ اور کوئی ذکر ہی نہ تھا ۔ جب ہم مقام سرف پہنچے تو مجھے حیض آ گیا ۔ ( اس غم سے ) میں رو رہی تھی کہ نبی کریم صلی اللہ علیہ وسلم تشریف لائے ، آپ صلی اللہ علیہ وسلم نے پوچھا کہ کیوں رو رہی ہو ؟ میں نے کہا کاش ! میں اس سال حج کا ارادہ ہی نہ کرتی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا شاید تمہیں حیض آ گیا ہے ۔ میں نے کہا جی ہاں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا یہ چیز تو اللہ تعالیٰ نے آدم کی بیٹیوں کے لیے مقرر کر دی ہے ۔ اس لیے تم جب تک پاک نہ ہو جاؤ طواف بیت اللہ کے علاوہ حاجیوں کی طرح تمام کام انجام دو ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 103060,
        "last_updated": null
    },
    {
        "urduURN": 4003070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 306,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انھوں نے کہا ہم سے امام مالک نے ہشام بن عروہ کے واسطہ سے بیان کیا ، انھوں نے اپنے والد سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے ، آپ نے بیان کیا کہ",
        "hadithText": "فاطمہ ابی حبیش کی بیٹی نے رسول کریم صلی اللہ علیہ وسلم سے کہا کہ یا رسول اللہ ! میں تو پاک ہی نہیں ہوتی ، تو کیا میں نماز بالکل چھوڑ دوں ۔ آنحضور صلی اللہ علیہ وسلم نے فرمایا کہ یہ رگ کا خون ہے حیض نہیں اس لیے جب حیض کے دن ( جن میں کبھی پہلے تمہیں عادتاً آیا کرتا تھا ) آئیں تو نماز چھوڑ دے اور جب اندازہ کے مطابق وہ دن گزر جائیں ، تو خون دھو ڈال اور نماز پڑھ ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 103070,
        "last_updated": null
    },
    {
        "urduURN": 4003080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 307,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انھوں نے کہا ہمیں امام مالک نے بیان کیا ، انھوں نے ہشام بن عروہ کے واسطے سے ، انھوں نے فاطمہ بنت منذر سے ، انھوں نے اسماء بنت ابی بکر صدیق رضی اللہ عنہما سے ، انھوں نے کہا کہ",
        "hadithText": "ایک عورت نے رسول کریم صلی اللہ علیہ وسلم سے سوال کیا ۔ اس نے پوچھا کہ یا رسول اللہ ! آپ ایک ایسی عورت کے متعلق کیا فرماتے ہیں جس کے کپڑے پر حیض کا خون لگ گیا ہو ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اگر کسی عورت کے کپڑے پر حیض کا خون لگ جائے تو چاہیے کہ اسے رگڑ ڈالے ، اس کے بعد اسے پانی سے دھوئے ، پھر اس کپڑے میں نماز پڑھ لے ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 103080,
        "last_updated": null
    },
    {
        "urduURN": 4003090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 308,
        "hadithSanad": "ہم سے اصبغ نے بیان کیا ، انھوں نے کہا مجھ سے عبداللہ بن وہب نے بیان کیا ، انھوں نے کہا مجھ سے عمرو بن حارث نے عبدالرحمٰن بن قاسم کے واسطے سے بیان کیا ، انھوں نے اپنے والد قاسم بن محمد سے بیان کیا ، وہ حضرت عائشہ رضی اللہ عنہا سے کہ",
        "hadithText": "آپ نے فرمایا کہ ہمیں حیض آتا تو کپڑے کو پاک کرتے وقت ہم خون کو مل دیتے ، پھر اس جگہ کو دھو لیتے اور تمام کپڑے پر پانی بہا دیتے اور اسے پہن کر نماز پڑھتے ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 103090,
        "last_updated": null
    },
    {
        "urduURN": 4003100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 309,
        "hadithSanad": "ہم سے اسحاق بن شاہین ابوبشر واسطی نے بیان کیا ، انھوں نے کہا ہم سے خالد بن عبداللہ نے بیان کیا ، انھوں نے خالد بن مہران سے ، انھوں نے عکرمہ سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے ساتھ آپ صلی اللہ علیہ وسلم کی بعض ازواج نے اعتکاف کیا ، حالانکہ وہ مستحاضہ تھیں اور انہیں خون آتا تھا ۔ اس لیے خون کی وجہ سے طشت اکثر اپنے نیچے رکھ لیتیں ۔ اور عکرمہ نے کہا کہ عائشہ رضی اللہ عنہا نے کسم کا پانی دیکھا تو فرمایا یہ تو ایسا ہی معلوم ہوتا ہے جیسے فلاں صاحبہ کو استحاضہ کا خون آتا تھا ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 103100,
        "last_updated": null
    },
    {
        "urduURN": 4003110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 310,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے یزید بن زریع نے خالد سے ، وہ عکرمہ سے ، وہ عائشہ رضی اللہ عنہا سے ، آپ نے فرمایا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے ساتھ آپ صلی اللہ علیہ وسلم کی ازواج میں سے ایک نے اعتکاف کیا ۔ وہ خون اور زردی ( نکلتے ) دیکھتیں ، طشت ان کے نیچے ہوتا اور نماز ادا کرتی تھیں ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 103110,
        "last_updated": null
    },
    {
        "urduURN": 4003120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 311,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے معتمر بن سلیمان نے خالد کے واسطہ سے بیان کیا ، وہ عکرمہ سے وہ عائشہ رضی اللہ عنہا سے کہ",
        "hadithText": "بعض امہات المؤمنین نے اعتکاف کیا حالانکہ وہ مستحاضہ تھیں ۔ ( اوپر والی روایت میں ان ہی کا ذکر ہے ) ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 103120,
        "last_updated": null
    },
    {
        "urduURN": 4003130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 312,
        "hadithSanad": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، انھوں نے کہا ہم سے ابراہیم بن نافع نے بیان کیا ، انھوں نے عبداللہ ابن ابی نجیح سے ، انھوں نے مجاہد سے کہ حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ",
        "hadithText": "ہمارے پاس صرف ایک کپڑا ہوتا تھا ، جسے ہم حیض کے وقت پہنتے تھے ۔ جب اس میں خون لگ جاتا تو اس پر تھوک ڈال لیتے اور پھر اسے ناخنوں سے مسل دیتے ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 103130,
        "last_updated": null
    },
    {
        "urduURN": 4003140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 313,
        "hadithSanad": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ، انھوں نے کہا ہم سے حماد بن زید نے ایوب سختیانی سے ، انھوں نے حفصہ سے ، وہ ام عطیہ سے ، آپ نے فرمایا کہ",
        "hadithText": "ہمیں کسی میت پر تین دن سے زیادہ سوگ کرنے سے منع کیا جاتا تھا ۔ لیکن شوہر کی موت پر چار مہینے دس دن کے سوگ کا حکم تھا ۔ ان دنوں میں ہم نہ سرمہ لگاتیں نہ خوشبو اور عصب ( یمن کی بنی ہوئی ایک چادر جو رنگین بھی ہوتی تھی ) کے علاوہ کوئی رنگین کپڑا ہم استعمال نہیں کرتی تھیں اور ہمیں ( عدت کے دنوں میں ) حیض کے غسل کے بعد کست اظفار استعمال کرنے کی اجازت تھی اور ہمیں جنازہ کے پیچھے چلنے سے منع کیا جاتا تھا ۔ اس حدیث کو ہشام بن حسان نے حفصہ سے ، انھوں نے ام عطیہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا ہے ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 103140,
        "last_updated": null
    },
    {
        "urduURN": 4003150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 314,
        "hadithSanad": "ہم سے یحییٰ بن موسیٰ نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے منصور بن صفیہ سے ، انھوں نے اپنی ماں صفیہ بنت شیبہ سے ، وہ حضرت عائشہ رضی اللہ عنہا سے کہ آپ نے فرمایا کہ",
        "hadithText": "ایک انصاریہ عورت نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا کہ میں حیض کا غسل کیسے کروں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ مشک میں بسا ہوا کپڑا لے کر اس سے پاکی حاصل کر ۔ اس نے پوچھا ۔ اس سے کس طرح پاکی حاصل کروں ، آپ صلی اللہ علیہ وسلم نے فرمایا ، اس سے پاکی حاصل کر ۔ اس نے دوبارہ پوچھا کہ کس طرح ؟ آپ صلی اللہ علیہ وسلم نے فرمایا سبحان اللہ ! پاکی حاصل کر ۔ پھر میں نے اسے اپنی طرف کھینچ لیا اور کہا کہ اسے خون لگی ہوئی جگہوں پر پھیر لیا کر ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 103150,
        "last_updated": null
    },
    {
        "urduURN": 4003160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 315,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے وہیب بن خالد نے ، کہا ہم سے منصور بن عبدالرحمٰن نے اپنی والدہ صفیہ سے ، وہ عائشہ سے کہ",
        "hadithText": "انصاریہ عورت نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا کہ میں حیض کا غسل کیسے کروں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک مشک میں بسا ہوا کپڑا لے اور پاکی حاصل کر ، یہ آپ صلی اللہ علیہ وسلم نے تین دفعہ فرمایا ۔ پھر آنحضور صلی اللہ علیہ وسلم شرمائے اور آپ صلی اللہ علیہ وسلم نے اپنا چہرہ مبارک پھیر لیا ، یا فرمایا کہ اس سے پاکی حاصل کر ۔ پھر میں نے انہیں پکڑ کر کھینچ لیا اور نبی کریم صلی اللہ علیہ وسلم جو بات کہنی چاہتے تھے وہ میں نے اسے سمجھائی ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 103160,
        "last_updated": null
    },
    {
        "urduURN": 4003170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 316,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے ، کہا ہم سے ابن شہاب زہری نے عروہ کے واسطہ سے کہ حضرت عائشہ رضی اللہ عنہا نے بتلایا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ حجۃ الوداع کیا ، میں تمتع کرنے والوں میں تھی اور ہدی ( یعنی قربانی کا جانور ) اپنے ساتھ نہیں لے گئی تھی ۔ حضرت عائشہ رضی اللہ عنہا نے اپنے متعلق بتایا کہ پھر وہ حائضہ ہو گئیں اور عرفہ کی رات آ گئی اور ابھی تک وہ پاک نہیں ہوئی تھیں ۔ اس لیے انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے کہا کہ حضور آج عرفہ کی رات ہے اور میں عمرہ کی نیت کر چکی تھی ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اپنے سر کو کھول ڈال اور کنگھا کر اور عمرہ کو چھوڑ دے ۔ میں نے ایسا ہی کیا ۔ پھر میں نے حج پورا کیا ۔ اور لیلۃ الحصبہ میں عبدالرحمٰن بن ابوبکر کو آنحضور صلی اللہ علیہ وسلم نے حکم دیا ۔ وہ مجھے اس عمرہ کے بدلہ میں جس کی نیت میں نے کی تھی تنعیم سے ( دوسرا ) عمرہ کرا لائے ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 103170,
        "last_updated": null
    },
    {
        "urduURN": 4003180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 317,
        "hadithSanad": "ہم سے عبید بن اسماعیل نے بیان کیا ، انھوں نے کہا ہم سے ابواسامہ حماد نے ہشام بن عروہ کے واسطے سے بیان کیا ، انھوں نے اپنے والد سے ، انھوں نے عائشہ رضی اللہ عنہا سے کہ انھوں نے فرمایا",
        "hadithText": "ہم ذی الحجہ کا چاند دیکھتے ہی نکلے ۔ رسول کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس کا دل چاہے تو اسے عمرہ کا احرام باندھ لینا چاہیے ۔ کیونکہ اگر میں ہدی ساتھ نہ لاتا تو میں بھی عمرہ کا احرام باندھتا ۔ اس پر بعض صحابہ نے عمرہ کا احرام باندھا اور بعض نے حج کا ۔ میں بھی ان لوگوں میں سے تھی جنہوں نے عمرہ کا احرام باندھا تھا ۔ مگر عرفہ کا دن آ گیا اور میں حیض کی حالت میں تھی ۔ میں نے نبی کریم صلی اللہ علیہ وسلم سے اس کے متعلق شکایت کی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ عمرہ چھوڑ اور اپنا سر کھول اور کنگھا کر اور حج کا احرام باندھ لے ۔ میں نے ایسا ہی کیا ۔ یہاں تک کہ جب حصبہ کی رات آئی تو رسول اللہ صلی اللہ علیہ وسلم نے میرے ساتھ میرے بھائی عبدالرحمٰن بن ابی بکر کو بھیجا ۔ میں تنعیم میں گئی اور وہاں سے اپنے عمرہ کے بدلے دوسرے عمرہ کا احرام باندھا ۔ ہشام نے کہا کہ ان میں سے کسی بات کی وجہ سے بھی نہ ہدی واجب ہوئی اور نہ روزہ اور نہ صدقہ ۔ ( تنعیم حد حرم سے قریب تین میل دور ایک مقام کا نام ہے ) ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 103180,
        "last_updated": null
    },
    {
        "urduURN": 4003190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 318,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے حماد بن زید نے عبیداللہ بن ابی بکر کے واسطے سے ، وہ انس بن مالک رضی اللہ عنہ سے ، وہ نبی کریم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ رحم مادر میں اللہ تعالیٰ نے ایک فرشتہ مقرر کیا ہے ۔ وہ کہتا ہے کہ اے رب ! اب یہ «نطفة» ہے ، اے رب ! اب یہ «علقة» ہو گیا ہے ، اے رب ! اب یہ «مضغة‏» ہو گیا ہے ۔ پھر جب خدا چاہتا ہے کہ اس کی خلقت پوری کرے تو کہتا ہے کہ مذکر یا مونث ، بدبخت ہے یا نیک بخت ، روزی کتنی مقدر ہے اور عمر کتنی ۔ پس ماں کے پیٹ ہی میں یہ تمام باتیں فرشتہ لکھ دیتا ہے ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 103190,
        "last_updated": null
    },
    {
        "urduURN": 4003200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 319,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انھوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، انھوں نے عقیل بن خالد سے ، انھوں نے ابن شہاب سے ، انھوں نے عروہ بن زبیر سے ، انھوں نے عائشہ رضی اللہ عنہا سے ، انھوں نے کہا",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ حجۃ الوداع کے سفر میں نکلے ، ہم میں سے بعض نے عمرہ کا احرام باندھا اور بعض نے حج کا ، پھر ہم مکہ آئے اور آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جس نے عمرہ کا احرام باندھا ہو اور ہدی ساتھ نہ لایا ہو تو وہ حلال ہو جائے اور جس نے عمرہ کا احرام باندھا ہو اور وہ ہدی بھی ساتھ لایا ہو تو وہ ہدی کی قربانی سے پہلے حلال نہ ہو گا ۔ اور جس نے حج کا احرام باندھا ہو تو اسے حج پورا کرنا چاہیے ۔ عائشہ رضی اللہ عنہا نے کہا کہ میں حائضہ ہو گئی اور عرفہ کا دن آ گیا ۔ میں نے صرف عمرہ کا احرام باندھا تھا مجھے نبی کریم صلی اللہ علیہ وسلم نے حکم دیا کہ میں اپنا سر کھول لوں ، کنگھا کر لوں اور حج کا احرام باندھ لوں اور عمرہ چھوڑ دوں ، میں نے ایسا ہی کیا اور اپنا حج پورا کر لیا ۔ پھر میرے ساتھ آنحضرت صلی اللہ علیہ وسلم نے عبدالرحمٰن بن ابی بکر کو بھیجا اور مجھ سے فرمایا کہ میں اپنے چھوٹے ہوئے عمرہ کے عوض تنعیم سے دوسرا عمرہ کروں ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 103200,
        "last_updated": null
    },
    {
        "urduURN": 4003210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 320,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے ہشام بن عروہ سے ، وہ اپنے باپ سے ، وہ حضرت عائشہ سے کہ",
        "hadithText": "فاطمہ بنت ابی حبیش کو استحاضہ کا خون آیا کرتا تھا ۔ تو انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اس کے متعلق پوچھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ رگ کا خون ہے اور حیض نہیں ہے ۔ اس لیے جب حیض کے دن آئیں تو نماز چھوڑ دیا کر اور جب حیض کے دن گزر جائیں تو غسل کر کے نماز پڑھ لیا کر ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 103210,
        "last_updated": null
    },
    {
        "urduURN": 4003220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 321,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ہمام بن یحییٰ نے ، کہا ہم سے قتادہ نے ، کہا مجھ سے معاذہ بنت عبداللہ نے کہ ایک عورت نے عائشہ رضی اللہ عنہا سے پوچھا کہ",
        "hadithText": "جس زمانہ میں ہم پاک رہتے ہیں ۔ ( حیض سے ) کیا ہمارے لیے اسی زمانہ کی نماز کافی ہے ۔ اس پر عائشہ رضی اللہ عنہا نے فرمایا کہ کیا تم حروریہ ہو ؟ ہم نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں حائضہ ہوتی تھیں اور آپ ہمیں نماز کا حکم نہیں دیتے تھے ۔ یا حضرت عائشہ رضی اللہ عنہا نے یہ فرمایا کہ ہم نماز نہیں پڑھتی تھیں ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 103220,
        "last_updated": null
    },
    {
        "urduURN": 4003230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 322,
        "hadithSanad": "ہم سے سعد بن حفص نے بیان کیا ، انھوں نے کہا ہم سے شیبان نحوی نے بیان کیا ، انھوں نے یحییٰ بن ابی کثیر سے ، انھوں نے ابوسلمہ سے ، انھوں نے زینب بنت ابی سلمہ سے ، انھوں نے بیان کیا کہ ام سلمہ رضی اللہ عنہا نے فرمایا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ چادر میں لیٹی ہوئی تھی کہ مجھے حیض آ گیا ، اس لیے میں چپکے سے نکل آئی اور اپنے حیض کے کپڑے پہن لیے ۔ رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، کیا تمہیں حیض آ گیا ہے ؟ میں نے کہا جی ہاں ۔ پھر مجھے آپ نے بلا لیا اور اپنے ساتھ چادر میں داخل کر لیا ۔ زینب نے کہا کہ مجھ سے ام سلمہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم روزے سے ہوتے اور اسی حالت میں ان کا بوسہ لیتے ۔ اور میں نے اور نبی کریم صلی اللہ علیہ وسلم نے ایک ہی برتن میں جنابت کا غسل کیا ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 103230,
        "last_updated": null
    },
    {
        "urduURN": 4003240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 323,
        "hadithSanad": "ہم سے معاذ بن فضالہ نے بیان کیا ، کہا ہم سے ہشام دستوائی نے یحییٰ بن ابی کثیر سے ، وہ ابوسلمہ سے ، وہ زینب بنت ابی سلمہ سے ، وہ ام سلمہ سے ، انھوں نے بتلایا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک چادر میں لیٹی ہوئی تھی کہ مجھے حیض آ گیا ، میں چپکے سے چلی گئی اور حیض کے کپڑے بدل لیے ، آپ نے پوچھا کیا تجھ کو حیض آ گیا ہے ۔ میں نے کہا ، جی ہاں ! پھر مجھے آپ نے بلا لیا اور میں آپ کے ساتھ چادر میں لیٹ گئی ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 103240,
        "last_updated": null
    },
    {
        "urduURN": 4003250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 324,
        "hadithSanad": "ہم سے محمد بن سلام بیکندی نے بیان کیا ، کہا ہم سے عبدالوہاب ثقفی نے ایوب سختیانی سے ، وہ حفصہ بنت سیرین سے ، انھوں نے فرمایا کہ",
        "hadithText": "ہم اپنی کنواری جوان بچیوں کو عیدگاہ جانے سے روکتی تھیں ، پھر ایک عورت آئی اور بنی خلف کے محل میں اتریں اور انھوں نے اپنی بہن ( ام عطیہ ) کے حوالہ سے بیان کیا ، جن کے شوہر نبی کریم صلی اللہ علیہ وسلم کے ساتھ بارہ لڑائیوں میں شریک ہوئے تھے اور خود ان کی اپنی بہن اپنے شوہر کے ساتھ چھ جنگوں میں گئی تھیں ۔ انھوں نے بیان کیا کہ ہم زخمیوں کی مرہم پٹی کیا کرتی تھیں اور مریضوں کی خبرگیری بھی کرتی تھیں ۔ میری بہن نے ایک مرتبہ نبی کریم صلی اللہ علیہ وسلم سے پوچھا کہ اگر ہم میں سے کسی کے پاس چادر نہ ہو تو کیا اس کے لیے اس میں کوئی حرج ہے کہ وہ ( نماز عید کے لیے ) باہر نہ نکلے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا اس کی ساتھی عورت کو چاہیے کہ اپنی چادر کا کچھ حصہ اسے بھی اڑھا دے ، پھر وہ خیر کے مواقع پر اور مسلمانوں کی دعاؤں میں شریک ہوں ، ( یعنی عیدگاہ جائیں ) پھر جب ام عطیہ رضی اللہ عنہا آئیں تو میں نے ان سے بھی یہی سوال کیا ۔ انھوں نے فرمایا ، میرا باپ آپ پر فدا ہو ، ہاں آپ صلی اللہ علیہ وسلم نے یہ فرمایا تھا ۔ اور ام عطیہ رضی اللہ عنہا جب بھی آنحضرت صلی اللہ علیہ وسلم کا ذکر کرتیں تو یہ ضرور فرماتیں کہ میرا باپ آپ صلی اللہ علیہ وسلم پر فدا ہو ۔ ( انھوں نے کہا ) میں نے آپ کو یہ کہتے ہوئے سنا تھا کہ جوان لڑکیاں ، پردہ والیاں اور حائضہ عورتیں بھی باہر نکلیں اور مواقع خیر میں اور مسلمانوں کی دعاؤں میں شریک ہوں اور حائضہ عورت جائے نماز سے دور رہے ۔ حفصہ کہتی ہیں ، میں نے پوچھا کیا حائضہ بھی ؟ تو انھوں نے فرمایا کہ وہ عرفات میں اور فلاں فلاں جگہ نہیں جاتی ۔ یعنی جب وہ ان جملہ مقدس مقامات میں جاتی ہیں تو پھر عیدگاہ کیوں نہ جائیں ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 103250,
        "last_updated": null
    },
    {
        "urduURN": 4003260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 325,
        "hadithSanad": "ہم سے احمد بن ابی رجاء نے بیان کیا ، انھوں نے کہا ہمیں ابواسامہ نے خبر دی ، انھوں نے کہا میں نے ہشام بن عروہ سے سنا ، کہا مجھے میرے والد نے حضرت عائشہ رضی اللہ عنہا کے واسطہ سے خبر دی کہ",
        "hadithText": "فاطمہ بنت ابی حبیش رضی اللہ عنہا نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا کہ مجھے استحاضہ کا خون آتا ہے اور میں پاک نہیں ہو پاتی ، تو کیا میں نماز چھوڑ دیا کروں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا نہیں ۔ یہ تو ایک رگ کا خون ہے ، ہاں اتنے دنوں میں نماز ضرور چھوڑ دیا کر جن میں اس بیماری سے پہلے تمہیں حیض آیا کرتا تھا ۔ پھر غسل کر کے نماز پڑھا کرو ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 103260,
        "last_updated": null
    },
    {
        "urduURN": 4003270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 326,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انھوں نے کہا ہم سے اسماعیل بن علیہ نے بیان کیا ، انھوں نے ایوب سختیانی سے ، وہ محمد بن سیرین سے ، وہ ام عطیہ سے ، آپ نے فرمایا کہ",
        "hadithText": "ہم زرد اور مٹیالے رنگ کو کوئی اہمیت نہیں دیتی تھیں ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 103270,
        "last_updated": null
    },
    {
        "urduURN": 4003280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 327,
        "hadithSanad": "ہم سے ابراہیم بن المنذر حزامی نے بیان کیا ، انھوں نے کہا ہم سے معن بن عیسیٰ نے بیان کیا ، انھوں نے ایوب بن ابی ذئب سے ، انھوں نے ابن شہاب سے ، انھوں نے عروہ اور عمرہ سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے ( جو آنحضرت صلی اللہ علیہ وسلم کی بیوی ہیں ) کہ",
        "hadithText": "ام حبیبہ رضی اللہ عنہا سات سال تک مستحاضہ رہیں ۔ انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اس کے بارے میں پوچھا تو آپ صلی اللہ علیہ وسلم نے انہیں غسل کرنے کا حکم دیا اور فرمایا کہ یہ رگ ( کی وجہ سے بیماری ) ہے ۔ پس ام حبیبہ رضی اللہ عنہا ہر نماز کے لیے غسل کرتی تھیں ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 103280,
        "last_updated": null
    },
    {
        "urduURN": 4003290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 328,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انھوں نے کہا ہمیں امام مالک نے خبر دی ، انھوں نے عبداللہ بن ابی بکر بن عمرو بن حزم سے ، انھوں نے اپنے باپ ابوبکر سے ، انھوں نے عبدالرحمٰن کی بیٹی عمرہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا سے کہ",
        "hadithText": "انھوں نے رسول کریم صلی اللہ علیہ وسلم سے کہا کہ یا رسول اللہ ! صفیہ بنت حیی رضی اللہ عنہا کو ( حج میں ) حیض آ گیا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، شاید کہ وہ ہمیں روکیں گی ۔ کیا انھوں نے تمہارے ساتھ طواف ( زیارت ) نہیں کیا ۔ عورتوں نے جواب دیا کہ کر لیا ہے ۔ آپ نے اس پر فرمایا کہ پھر نکلو ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 103290,
        "last_updated": null
    },
    {
        "urduURN": 4003300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 329,
        "hadithSanad": "ہم سے معلی بن اسد نے بیان کیا ، کہا ہم سے وہیب بن خالد نے عبداللہ بن طاؤس کے حوالہ سے ، وہ اپنے باپ طاؤس بن کیسان سے ، وہ عبداللہ بن عباس رضی اللہ عنہما سے ، آپ نے فرمایا کہ",
        "hadithText": "حائضہ کے لیے ( جب کہ اس نے طواف افاضہ کر لیا ہو ) رخصت ہے کہ وہ گھر جائے ( اور طواف وداع کے لیے نہ رکی رہے ) ۔\nاسے ( بغیر طواف وداع کے ) جانا نہیں چاہیے ۔ پھر میں نے انہیں کہتے ہوئے سنا کہ چلی جائے کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے ان کو اس کی رخصت دی ہے ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 103301,
        "last_updated": null
    },
    {
        "urduURN": 4003320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 331,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، انھوں نے کہا ہم سے زہیر بن معاویہ نے بیان کیا ، انھوں نے کہا ہم سے ہشام بن عروہ نے حضرت عائشہ رضی اللہ عنہا سے ، انھوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جب حیض کا زمانہ آئے تو نماز چھوڑ دے اور جب یہ زمانہ گزر جائے تو خون کو دھو اور نماز پڑھ ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 103320,
        "last_updated": null
    },
    {
        "urduURN": 4003330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 332,
        "hadithSanad": "ہم سے احمد بن ابی سریح نے بیان کیا ، کہا ہم سے شبابہ بن سوار نے ، کہا ہم سے شعبہ نے حسین سے ۔ وہ عبداللہ بن بریدہ سے ، وہ سمرہ بن جندب سے کہ",
        "hadithText": "ایک عورت ( ام کعب ) زچگی میں مر گئی ، تو رسول اللہ صلی اللہ علیہ وسلم نے ان کی نماز جنازہ پڑھی ، اس وقت آپ صلی اللہ علیہ وسلم ان کے ( جسم کے ) وسط میں کھڑے ہو گئے ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 103330,
        "last_updated": null
    },
    {
        "urduURN": 4003340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 6,
        "bookName": "کتاب حیض کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 333,
        "hadithSanad": "ہم سے حسن بن مدرک نے بیان کیا ، انھوں نے کہا ہم سے یحییٰ بن حماد نے بیان کیا ، انھوں نے کہا ہمیں ابوعوانہ وضاح نے اپنی کتاب سے دیکھ کر خبر دی ۔ انھوں نے کہا کہ ہمیں خبر دی سلیمان شیبانی نے عبداللہ بن شداد سے ، انھوں نے کہا",
        "hadithText": "میں نے اپنی خالہ میمونہ رضی اللہ عنہا سے جو نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ تھیں سنا کہ میں حائضہ ہوتی تو نماز نہیں پڑھتی تھی اور یہ کہ آپ رسول اللہ صلی اللہ علیہ وسلم کے ( گھر میں ) نماز پڑھنے کی جگہ کے قریب لیٹی ہوتی تھی ۔ آپ صلی اللہ علیہ وسلم نماز اپنی چٹائی پر پڑھتے ۔ جب آپ صلی اللہ علیہ وسلم سجدہ کرتے تو آپ صلی اللہ علیہ وسلم کے کپڑے کا کوئی حصہ مجھ سے لگ جاتا تھا ۔</b>",
        "bookID": "6.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 103340,
        "last_updated": null
    }
]