[
    {
        "urduURN": 4032830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3326,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، انہوں نے کہا ہم سے عبدالرزاق نے بیان کیا ، ان سے معمر نے ، ان سے ہمام نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ پاک نے آدم علیہ السلام کو پیدا کیا تو ان کو ساٹھ ہاتھ لمبا بنایا پھر فرمایا کہ جا اور ان ملائکہ کو سلام کر ، دیکھنا کن لفظوں میں وہ تمہارے سلام کا جواب دیتے ہیں کیونکہ وہی تمہارا اور تمہاری اولاد کا طریقہ سلام ہو گا ۔ آدم علیہ السلام ( گئے اور ) کہا ، السلام علیکم فرشتوں نے جواب دیا ، السلام علیک و رحمۃ اللہ ۔ انہوں نے و رحمۃ اللہ کا جملہ بڑھا دیا ، پس جو کوئی بھی جنت میں داخل ہو گا وہ آدم علیہ السلام کی شکل اور قامت پر داخل ہو گا ، آدم علیہ السلام کے بعد انسانوں میں اب تک قد چھوٹے ہوتے رہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 171070,
        "last_updated": null
    },
    {
        "urduURN": 4032840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3327,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے عمارہ نے ان سے ابوزرعہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، سب سے پہلا گروہ جو جنت میں داخل ہو گا ان کی صورتیں ایسی روشن ہوں گی جیسے چودھویں کا چاند روشن ہوتا ہے ، پھر جو لوگ اس کے بعد داخل ہوں گے وہ آسمان کے سب سے زیادہ روشن ستارے کی طرح چمکتے ہوں گے ۔ نہ تو ان لوگوں کو پیشاب کی ضرورت ہو گی نہ پاخانہ کی ، نہ وہ تھوکیں گے نہ ناک سے آلائش نکالیں گے ۔ ان کے کنگھے سونے کے ہوں گے اور ان کا پسینہ مشک کی طرح ہو گا ۔ ان کی انگیٹھیوں میں خوشبودار عود جلتا ہو گا ، یہ نہایت پاکیزہ خوشبودار عود ہو گا ۔ ان کی بیویاں بڑی آنکھوں والی حوریں ہوں گی ۔ سب کی صورتیں ایک ہوں گی ۔ یعنی اپنے والد آدم علیہ السلام کے قد و قامت پر ساٹھ ساٹھ ہاتھ اونچے ہوں گے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 171080,
        "last_updated": null
    },
    {
        "urduURN": 4032850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3328,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ قطان نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے باپ نے ، ان سے زینب بنت ابی سلمہ نے ، ان سے ( ام المؤمنین ) ام سلمہ رضی اللہ عنہما نے کہ",
        "hadithText": "ام سلیم رضی اللہ عنہا نے عرض کیا ، یا رسول اللہ ! اللہ تعالیٰ حق بات سے نہیں شرماتا ، تو کیا اگر عورت کو احتلام ہو تو اس پر بھی غسل ہو گا ؟ آپ نے فرمایا کہ ہاں بشرطیکہ وہ تری دیکھ لے ، ام المؤمنین ام سلمہ رضی اللہ عنہا کو اس بات پر ہنسی آ گئی اور فرمانے لگیں ، کیا عورت کو بھی احتلام ہوتا ہے ؟ آپ نے فرمایا ، ( اگر ایسا نہیں ہے ) تو پھر بچے میں ( ماں کی ) مشابہت کہاں سے آتی ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 171090,
        "last_updated": null
    },
    {
        "urduURN": 4032860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3329,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو مروان فزاری نے خبر دی ۔ انہیں حمید نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "حضرت عبداللہ بن سلام رضی اللہ عنہ کو جب رسول کریم صلی اللہ علیہ وسلم کے مدینہ تشریف لانے کی خبر ملی تو وہ آپ کی خدمت میں آئے اور کہا کہ میں آپ سے تین چیزوں کے بارے میں پوچھوں گا ۔ جنہیں نبی کے سوا اور کوئی نہیں جانتا ۔ قیامت کی سب سے پہلی علامت کیا ہے ؟ وہ کون سا کھانا ہے جو سب سے پہلے جنتیوں کو کھانے کے لیے دیا جائے گا ؟ اور کس چیز کی وجہ سے بچہ اپنے باپ کے مشابہ ہوتا ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جبرائیل علیہ السلام نے ابھی ابھی مجھے آ کر اس کی خبر دی ہے ۔ اس پر حضرت عبداللہ رضی اللہ عنہ نے کہا کہ ملائکہ میں تو یہی تو یہودیوں کے دشمن ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، قیامت کی سب سے پہلی علامت ایک آگ کی صورت میں ظاہر ہو گی جو لوگوں کو مشرق سے مغرب کی طرف ہانک لے جائے گی ، سب سے پہلا کھانا جو اہل جنت کی دعوت کے لیے پیش کیا جائے گا ، وہ مچھلی کی کلیجی پر جو ٹکڑا ٹکا رہتا ہے وہ ہو گا اور بچے کی مشابہت کا جہاں تک تعلق ہے تو جب مرد عورت کے قریب جاتا ہے اس وقت اگر مرد کی منی پہل کر جاتی ہے تو بچہ اسی کی شکل و صورت پر ہوتا ہے ۔ اگر عورت کی منی پہل کر جاتی ہے تو پھر بچہ عورت کی شکل و صورت پر ہوتا ہے ( یہ سن کر ) حضرت عبداللہ بن سلام رضی اللہ عنہ بول اٹھے ” میں گواہی دیتا ہوں کہ آپ اللہ کے رسول ہیں ۔ “ پھر عرض کیا ، یا رسول اللہ ! یہود انتہا کی جھوٹی قوم ہے ۔ اگر آپ کے دریافت کرنے سے پہلے میرے اسلام قبول کرنے کے بارے میں انہیں علم ہو گیا تو آپ صلی اللہ علیہ وسلم کے سامنے مجھ پر ہر طرح کی تہمتیں دھرنی شروع کر دیں گے ۔ چنانچہ کچھ یہودی آئے اور حضرت عبداللہ رضی اللہ عنہ کے گھر کے اندر چھپ کر بیٹھ گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے پوچھا تم لوگوں میں عبداللہ بن سلام کون صاحب ہیں ؟ سارے یہودی کہنے لگے وہ ہم میں سب سے بڑے عالم اور سب سے بڑے عالم کے صاحب زادے ہیں ۔ ہم میں سب سے زیادہ بہتر اور ہم میں سب سے بہتر کے صاحب زادے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا ، اگر عبداللہ مسلمان ہو جائیں تو پھر تمہارا کیا خیال ہو گا ؟ انہوں نے کہا ، اللہ تعالیٰ انہیں اس سے محفوظ رکھے ۔ اتنے میں حضرت عبداللہ رضی اللہ عنہ باہر تشریف لائے اور کہا ، میں گواہی دیتا ہوں کہ اللہ کے سوا اور کوئی معبود نہیں اور میں گواہی دیتا ہوں کہ محمد اللہ کے سچے رسول ہیں ۔ اب وہ سب ان کے متعلق کہنے لگے کہ ہم میں سب سے بدترین اور سب سے بدترین کا بیٹا ہے ، وہیں وہ ان کی برائی کرنے لگے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 171100,
        "last_updated": null
    },
    {
        "urduURN": 4032870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3330,
        "hadithSanad": "ہم سے بشر بن محمد نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو معمر نے خبر دی ، انہیں ہمام نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے ، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا ( عبدالرزاق کی ) روایت کی طرح کہ",
        "hadithText": "اگر قوم بنی اسرائیل نہ ہوتی تو گوشت نہ سڑا کرتا اور اگر حواء نہ ہوتیں تو عورت اپنے شوہر سے دغا نہ کرتی ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 171110,
        "last_updated": null
    },
    {
        "urduURN": 4032880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3331,
        "hadithSanad": "ہم سے ابوکریب اور موسیٰ بن حزام نے بیان کیا ، کہا کہ ہم سے حسین بن علی نے بیان کیا ، ان سے زائدہ نے ، ان سے میسرہ اشجعی نے ، ان سے ابوحازم نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، عورتوں کے بارے میں میری وصیت کا ہمیشہ خیال رکھنا ، کیونکہ عورت پسلی سے پیدا کی گئی ہے ۔ پسلی میں بھی سب سے زیادہ ٹیڑھا اوپر کا حصہ ہوتا ہے ۔ اگر کوئی شخص اسے بالکل سیدھی کرنے کی کوشش کرے تو انجام کار توڑ کے رہے گا اور اگر اسے وہ یونہی چھوڑ دے گا تو پھر ہمیشہ ٹیڑھی ہی رہ جائے گی ۔ پس عورتوں کے بارے میں میری نصیحت مانو ، عورتوں سے اچھا سلوک کرو ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 171120,
        "last_updated": null
    },
    {
        "urduURN": 4032890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3332,
        "hadithSanad": "ہم سے عمر بن حفص نے بیان کیا ، کہا ہم سے میرے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا ہم سے زید بن وہب نے بیان کیا ، کہا ہم سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے بیان فرمایا اور آپ سچوں کے سچے تھے کہ انسان کی پیدائش اس کی ماں کے پیٹ میں پہلے چالیس دن تک پوری کی جاتی ہے ۔ پھر وہ اتنے ہی دنوں تک علقہ یعنی غلیظ اور جامد خون کی صورت میں رہتا ہے ۔ پھر اتنے ہی دنوں کے لیے مضغہ ( گوشت کا لوتھڑا ) کی شکل اختیار کر لیتا ہے ۔ پھر ( چوتھے چلہ میں ) اللہ تعالیٰ ایک فرشتہ کو چار باتوں کا حکم دے کر بھیجتا ہے ۔ پس وہ فرشتہ اس کے عمل ، اس کی مدت زندگی ، روزی اور یہ کہ وہ نیک ہے یا بد ، کو لکھ لیتا ہے ۔ اس کے بعد اس میں روح پھونکی جاتی ہے ۔ پس انسان ( زندگی بھر ) دوزخیوں کے کام کرتا رہتا ہے ۔ اور جب اس کے اور دوزخ کے درمیان صرف ایک ہاتھ کا فاصلہ رہ جاتا ہے تو اس کی تقدیر سامنے آتی ہے اور وہ جنتیوں کے کام کرنے لگتا ہے اور جنت میں چلا جاتا ہے ۔ اسی طرح ایک شخص جنتیوں کے کام کرتا رہتا ہے اور جب اس کے اور جنت کے درمیان صرف ایک ہاتھ کا فاصلہ رہ جاتا ہے تو اس کی تقدیر سامنے آتی ہے اور وہ دوزخیوں کے کام شروع کر دیتا ہے اور وہ دوزخ میں چلا جاتا ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 171130,
        "last_updated": null
    },
    {
        "urduURN": 4032900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3333,
        "hadithSanad": "ہم سے ابوالنعمان نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے عبیداللہ بن ابی بکر بن انس نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ نے ماں کے رحم کے لیے ایک فرشتہ مقرر کر دیا ہے وہ فرشتہ عرض کرتا ہے ، اے رب ! یہ نطفہ ہے ، اے رب یہ مضغہ ہے ۔ اے رب ! یہ علقہ ہے ۔ پھر جب اللہ تعالیٰ اسے پیدا کرنے کا ارادہ کرتا ہے تو فرشتہ پوچھتا ہے اے رب ! یہ مرد ہے یا اے رب ! یہ عورت ہے ، اے رب ! یہ بد ہے یا نیک ؟ اس کی روزی کیا ہے ؟ اور مدت زندگی کتنی ہے ؟ چنانچہ اسی کے مطابق ماں کے پیٹ ہی میں سب کچھ فرشتہ رکھ لیتا ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 171140,
        "last_updated": null
    },
    {
        "urduURN": 4032910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3334,
        "hadithSanad": "ہم سے قیس بن حفص نے بیان کیا ، کہا ہم سے خالد بن حارث نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ابوعمران جونی نے اور ان سے حضرت انس رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "اللہ تعالیٰ ( قیامت کے دن ) اس شخص سے پوچھے گا جسے دوزخ کا سب سے ہلکا عذاب کیا گیا ہو گا ۔ اگر دنیا میں تمہاری کوئی چیز ہوتی تو کیا تو اس عذاب سے نجات پانے کے لیے اسے بدلے میں دے سکتا تھا ؟ وہ شخص کہے گا کہ جی ہاں اس پر اللہ تعالیٰ فرمائے گا کہ جب تو آدم کی پیٹھ میں تھا تو میں نے تجھ سے اس سے بھی معمولی چیز کا مطالبہ کیا تھا ( روز ازل میں ) کہ میرا کسی کو بھی شریک نہ ٹھہرانا ، لیکن ( جب تو دنیا میں آیا تو ) اسی شرک کا عمل اختیار کیا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 171150,
        "last_updated": null
    },
    {
        "urduURN": 4032920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3335,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، ان سے اعمش نے بیان کیا ، کہا کہ مجھ سے عبداللہ بن مرہ نے بیان کیا ، ان سے مسروق نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب بھی کوئی انسان ظلم سے قتل کیا جاتا ہے تو آدم علیہ السلام کے سب سے پہلے بیٹے ( قابیل ) کے نامہ اعمال میں بھی اس قتل کا گناہ لکھا جاتا ہے ۔ کیونکہ قتل ناحق کی بنا سب سے پہلے اسی نے قائم کی تھی ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 171160,
        "last_updated": null
    },
    {
        "urduURN": 4032930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3336,
        "hadithSanad": "امام بخاری نے کہا کہ لیث بن سعد نے روایت کیا یحییٰ بن سعید انصاری سے ، ان سے عمرہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے کہ روحوں کے جھنڈ کے جھنڈ الگ الگ تھے ۔ پھر وہاں جن روحوں میں آپس میں پہچان تھی ان میں یہاں بھی محبت ہوتی ہے اور جو وہاں غیر تھیں یہاں بھی وہ خلاف رہتی ہیں اور یحییٰ بن ایوب نے بھی اس حدیث کو روایت کیا ، کہا مجھ سے یحییٰ بن سعید نے بیان کیا ، آخر تک ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 171170,
        "last_updated": null
    },
    {
        "urduURN": 4032940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3337,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، انہیں یونس نے ، انہیں زہری نے کہ سالم نے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم لوگوں میں خطبہ سنانے کھڑے ہوئے ۔ پہلے اللہ تعالیٰ کی ، اس کی شان کے مطابق ثنا بیان کی ، پھر دجال کا ذکر فرمایا اور فرمایا کہ میں تمہیں دجال کے فتنے سے ڈراتا ہوں اور کوئی نبی ایسا نہیں گزرا جس نے اپنی قوم کو اس سے نہ ڈرایا ہو ۔ نوح علیہ السلام نے بھی اپنی قوم کو اس سے ڈرایا تھا ۔ لیکن میں تمہیں اس کے بارے میں ایک ایسی بات بتاتا ہوں جو کسی نبی نے بھی اپنی قوم کو نہیں بتائی تھی ، تمہیں معلوم ہونا چاہئے کہ دجال کانا ہو گا اور اللہ تعالیٰ اس عیب سے پاک ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 171180,
        "last_updated": null
    },
    {
        "urduURN": 4032950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3338,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، ہم سے شیبان نے بیان کیا ، ان سے یحییٰ نے ، ان سے ابوسلمہ نے اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، آپ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، کیوں نہ میں تمہیں دجال کے متعلق ایک ایسی بات بتا دوں جو کسی نبی نے اپنی قوم کو اب تک نہیں بتائی ۔ وہ کانا ہو گا اور جنت اور جہنم جیسی چیز لائے گا ۔ پس جسے وہ جنت کہے گا درحقیقت وہی دوزخ ہو گی اور میں تمہیں اس کے فتنے سے اسی طرح ڈراتا ہوں ، جیسے نوح علیہ السلام نے اپنی قوم کو ڈرایا تھا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 171190,
        "last_updated": null
    },
    {
        "urduURN": 4032960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3339,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، ہم سے عبدالواحد بن زیاد نے بیان کیا ، ہم سے اعمش نے بیان کیا ، ان سے ابوصالح نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( قیامت کے دن ) نوح علیہ السلام بارگاہ الٰہی میں حاضر ہوں گے ۔ اللہ تعالیٰ دریافت فرمائے گا ، کیا ( میرا پیغام ) تم نے پہنچا دیا تھا ؟ نوح علیہ السلام عرض کریں گے میں نے تیرا پیغام پہنچا دیا تھا ، اے رب العزت ! اب اللہ تعالیٰ ان کی امت سے دریافت فرمائے گا ، کیا ( نوح علیہ السلام نے ) تم تک میرا پیغام پہنچا دیا تھا ؟ وہ جواب دیں گے نہیں ، ہمارے پاس تیرا کوئی نبی نہیں آیا ۔ اس پر اللہ تعالیٰ نوح علیہ السلام سے دریافت فرمائے گا ، اس کے لیے آپ کی طرف سے کوئی گواہی بھی دے سکتا ہے ؟ وہ عرض کریں گے کہ محمد صلی اللہ علیہ وسلم اور ان کی امت ( کے لوگ میرے گواہ ہیں ) چنانچہ ہم اس بات کی شہادت دیں گے کہ نوح علیہ السلام نے پیغام خداوندی اپنی قوم تک پہنچایا تھا اور یہی مفہوم اللہ جل ذکرہ کے اس ارشاد کا ہے کہ ” اور اسی طرح ہم نے تمہیں امت وسط بنایا ‘ تاکہ تم لوگوں پر گواہی دو “ ۔ اور وسط کے معنی درمیانی کے ہیں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 171200,
        "last_updated": null
    },
    {
        "urduURN": 4032970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3340,
        "hadithSanad": "مجھ سے اسحاق بن نصر نے بیان کیا ، ہم سے محمد بن عبید نے بیان کیا ، ہم سے ابوحیان یحییٰ بن سعید نے بیان کیا ، ان سے ابوزرعہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک دعوت میں شریک تھے ۔ آپ صلی اللہ علیہ وسلم کی خدمت میں دستی کا گوشت پیش کیا گیا جو آپ کو بہت مرغوب تھا ۔ آپ نے اس دستی کی ہڈی کا گوشت دانتوں سے نکال کر کھایا ۔ پھر فرمایا کہ میں قیامت کے دن لوگوں کا سردار ہوں گا ۔ تمہیں معلوم ہے کہ کس طرح اللہ تعالیٰ ( قیامت کے دن ) تمام مخلوق کو ایک چٹیل میدان میں جمع کرے گا ؟ اس طرح کہ دیکھنے والا سب کو ایک ساتھ دیکھ سکے گا ۔ آواز دینے والے کی آواز ہر جگہ سنی جا سکے گی اور سورج بالکل قریب ہو جائے گا ۔ ایک شخص اپنے قریب کے دوسرے شخص سے کہے گا ، دیکھتے نہیں کہ سب لوگ کیسی پریشانی میں مبتلا ہیں ؟ اور مصیبت کس حد تک پہنچ چکی ہے ؟ کیوں نہ کسی ایسے شخص کی تلاش کی جائے جو اللہ پاک کی بارگاہ میں ہم سب کی شفاعت کے لیے جائے ۔ کچھ لوگوں کا مشورہ ہو گا کہ دادا آدم علیہ السلام اس کے لیے مناسب ہیں ۔ چنانچہ لوگ ان کی خدمت میں حاضر ہوں گے اور عرض کریں گے ، اے باوا آدم ! آپ انسانوں کے دادا ہیں ۔ اللہ پاک نے آپ کو اپنے ہاتھ سے پیدا کیا تھا ، اپنی روح آپ کے اندر پھونکی تھی ، ملائکہ کو حکم دیا تھا اور انہوں نے آپ کو سجدہ کیا تھا اور جنت میں آپ کو ( پیدا کرنے کے بعد ) ٹھہرایا تھا ۔ آپ اپنے رب کے حضور میں ہماری شفاعت کر دیں ۔ آپ خود ملاحظہ فرما سکتے ہیں کہ ہم کس درجہ الجھن اور پریشانی میں مبتلا ہیں ۔ وہ فرمائیں گے کہ ( گناہ گاروں پر ) اللہ تعالیٰ آج اس درجہ غضبناک ہے کہ کبھی اتنا غضبناک نہیں ہوا تھا اور نہ آئندہ کبھی ہو گا اور مجھے پہلے ہی درخت ( جنت ) کے کھانے سے منع کر چکا تھا لیکن میں اس فرمان کو بجا لانے میں کوتاہی کر گیا ۔ آج تو مجھے اپنی ہی پڑی ہے ( نفسی نفسی ) تم لوگ کسی اور کے پاس جاؤ ۔ ہاں ، نوح علیہ السلام کے پاس جاؤ ۔ چنانچہ سب لوگ نوح علیہ السلام کی خدمت میں حاضر ہوں گے اور عرض کریں گے ، اے نوح علیہ السلام ! آپ ( آدم علیہ السلام کے بعد ) روئے زمین پر سب سے پہلے نبی ہیں اور اللہ تعالیٰ نے آپ کو ” عبدشکور “ کہہ کر پکارا ہے ۔ آپ ملاحظہ فرما سکتے ہیں کہ آج ہم کیسی مصیبت و پریشانی میں مبتلا ہیں ؟ آپ اپنے رب کے حضور میں ہماری شفاعت کر دیجئیے ۔ وہ بھی یہی جواب دیں گے کہ میرا رب آج اس درجہ غضبناک ہے کہ اس سے پہلے کبھی ایسا غضبناک نہیں ہوا تھا اور نہ کبھی اس کے بعد اتنا غضبناک ہو گا ۔ آج تو مجھے خود اپنی ہی فکر ہے ۔ ( نفسی نفسی ) تم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں جاؤ چنانچہ وہ لوگ میرے پاس آئیں گے ۔ میں ( ان کی شفاعت کے لیے ) عرش کے نیچے سجدے میں گر پڑوں گا ۔ پھر آواز آئے گی ، اے محمد ! سر اٹھاؤ اور شفاعت کرو ، تمہاری شفاعت قبول کی جائے گی ۔ مانگو تمہیں دیا جائے گا ۔ محمد بن عبیداللہ نے بیان کیا کہ ساری حدیث میں یاد نہ رکھ سکا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 171210,
        "last_updated": null
    },
    {
        "urduURN": 4032980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3341,
        "hadithSanad": "ہم سے نصر بن علی بن نصر نے بیان کیا ، انہوں نے کہا ہم کو ابواحمد نے خبر دی ، انہیں سفیان نے انہیں ابواسحاق نے انہیں اسود بن یزید نے اور انہیں عبداللہ بن مسعود رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ( آیت ) » فہل من مدکر « مشہور قرآت کے مطابق ( ادغام کے ساتھ ) تلاوت فرمائی تھی ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 171220,
        "last_updated": null
    },
    {
        "urduURN": 4032990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3342,
        "hadithSanad": "عبدان نے کہا کہ ہمیں عبداللہ نے خبر دی ، انہیں یونس نے خبر دی اور انہیں زہری نے ، ( دوسری سند ) اور ہم سے احمد بن صالح نے بیان کیا ، کہا ہم سے عنبسہ نے ، ان سے یونس نے ، ان سے ابن شہاب نے بیان کیا اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ ابوذر رضی اللہ عنہ بیان کرتے تھے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، میرے گھر کی چھت کھولی گئی ۔ میرا قیام ان دنوں مکہ میں تھا ۔ پھر جبرائیل علیہ السلام اترے اور میرا سینہ چاک کیا اور اسے زمزم کے پانی سے دھویا ۔ اس کے بعد سونے کا ایک طشت لائے جو حکمت اور ایمان سے لبریز تھا ، اسے میرے سینے میں انڈیل دیا ۔ پھر میرا ہاتھ پکڑ کر آسمان کی طرف لے کر چلے ، جب آسمان دنیا پر پہنچے تو جبرائیل علیہ السلام نے آسمان کے داروغہ سے کہا کہ دروازہ کھولو ، پوچھا کہ کون صاحب ہیں ؟ انہوں نے جواب دیا کہ میں جبرائیل ، پھر پوچھا کہ آپ کے ساتھ کوئی اور بھی ہے ؟ جواب دیا کہ میرے ساتھ محمد صلی اللہ علیہ وسلم ہیں ، پوچھا کہ انہیں لانے کے لیے آپ کو بھیجا گیا تھا ۔ جواب دیا کہ ہاں ، اب دروازہ کھلا ، جب ہم آسمان پر پہنچے تو وہاں ایک بزرگ سے ملاقات ہوئی ، کچھ انسانی روحیں ان کے دائیں طرف تھیں اور کچھ بائیں طرف ، جب وہ دائیں طرف دیکھتے تو ہنس دیتے اور جب بائیں طرف دیکھتے تو رو پڑتے ۔ انہوں نے کہا خوش آمدید ، نیک نبی نیک بیٹے ! میں نے پوچھا ، جبرائیل ! یہ صاحب کون بزرگ ہیں ؟ تو انہوں نے بتایا کہ یہ آدم علیہ السلام ہیں اور یہ انسانی روحیں ان کے دائیں اور بائیں طرف تھیں ان کی اولاد بنی آدم کی روحیں تھیں ان کے جو دائیں طرف تھیں وہ جنتی تھیں اور جو بائیں طرف تھیں وہ دوزخی تھیں ، اسی لیے جب وہ دائیں طرف دیکھتے تو مسکراتے اور جب بائیں طرف دیکھتے تو روتے تھے ، پھر جبرائیل علیہ السلام مجھے اوپر لے کر چڑھے اور دوسرے آسمان پر آئے ، اس آسمان کے داروغہ سے بھی انہوں نے کہا کہ دروازہ کھولو ، انہوں نے بھی اسی طرح کے سوالات کئے جو پہلے آسمان پر ہو چکے تھے ، پھر دروازہ کھولا ، انس رضی اللہ عنہ نے بیان کیا کہ حضرت ابوذر رضی اللہ عنہ نے تفصیل سے بتایا کہ آنحضرت صلی اللہ علیہ وسلم نے مختلف آسمانوں پر ادریس ، موسیٰ عیسیٰ اور ابراہیم علیہم السلام کو پایا ، لیکن انہوں نے ان انبیاء کرام کے مقامات کی کوئی تخصیص نہیں کی ، صرف اتنا کہا کہ آنحضرت صلی اللہ علیہ وسلم نے آدم علیہ السلام کو آسمان دنیا ( پہلے آسمان پر ) پایا اور ابراہیم علیہ السلام کو چھٹے پر اور حضرت انس رضی اللہ عنہ نے بیان کیا کہ پھر جب جبرائیل علیہ السلام ادریس علیہ السلام کے پاس سے گزرے تو انہوں نے کہا خوش آمدید ، نیک نبی نیک بھائی ، میں نے پوچھا کہ یہ کون صاحب ہیں ؟ جبرائیل علیہ السلام نے بتایا کہ یہ ادریس علیہ السلام ہیں ، پھر میں عیسیٰ علیہ السلام کے پاس سے گزرا ، انہوں نے بھی کہا خوش آمدید نیک نبی نیک بھائی ، میں نے پوچھا یہ کون صاحب ہیں ؟ تو بتایا کہ عیسیٰ علیہ السلام ۔ پھر ابراہیم علیہ السلام کے پاس سے گزرا تو انہوں نے فرمایا کہ خوش آمدید نیک نبی اور نیک بیٹے ، میں نے پوچھا یہ کون صاحب ہیں ؟ جواب دیا کہ یہ ابراہیم علیہ السلام ہیں ، ابن شہاب سے زہری نے بیان کیا اور مجھے ایوب بن حزم نے خبر دی کہ ابن عباس رضی اللہ عنہما اور ابوحیہ انصاری رضی اللہ عنہم بیان کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا پھر مجھے اوپر لے کر چڑھے اور میں اتنے بلند مقام پر پہنچ گیا جہاں سے قلم کے لکھنے کی آواز صاف سننے لگی تھی ، ابوبکر بن حزم نے بیان کیا اور انس بن مالک رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا پھر اللہ تعالیٰ نے پچاس وقت کی نمازیں مجھ پر فرض کیں ۔ میں اس فریضہ کے ساتھ واپس ہوا اور جب موسیٰ علیہ السلام کے پاس سے گزرا تو انہوں نے پوچھا کہ آپ کی امت پر کیا چیز فرض کی گئی ہے ؟ میں نے جواب دیا کہ پچاس وقت کی نمازیں ان پر فرض ہوئی ہیں ۔ انہوں نے کہا کہ آپ اپنے رب کے پاس واپس جائیں ، کیونکہ آپ کی امت میں اتنی نمازوں کی طاقت نہیں ہے ، چنانچہ میں واپس ہوا اور رب العالمین کے دربار میں مراجعت کی ، اس کے نتیجے میں اس کا ایک حصہ کم کر دیا گیا ، پھر میں موسیٰ علیہ السلام کے پاس آیا اور اس مرتبہ بھی انہوں نے کہا کہ اپنے رب سے پھر مراجعت کریں پھر انہوں نے اپنی تفصیلات کا ذکر کیا کہ رب العالمین نے ایک حصہ کی پھر کمی کر دی ، پھر میں موسیٰ علیہ السلام کے پاس آیا اور انہیں خبر کی ، انہوں نے کہا کہ آپ اپنے رب سے مراجعت کریں ، کیونکہ آپ کی امت میں اس کی بھی طاقت نہیں ہے ، پھر میں واپس ہوا اور اپنے رب سے پھر مراجعت کی ، اللہ تعالیٰ نے اس مرتبہ فرما دیا کہ نمازیں پانچ وقت کی کر دی گئیں اور ثواب پچاس نمازوں کا ہی باقی رکھا گیا ، ہمارا قول بدلا نہیں کرتا ۔ پھر میں موسیٰ علیہ السلام کے پاس آیا تو انہوں نے اب بھی اسی پر زور دیا کہ اپنے رب سے آپ کو پھر مراجعت کرنی چاہئے ۔ لیکن میں نے کہا کہ مجھے اللہ پاک سے باربار درخواست کرتے ہوئے اب شرم آتی ہے ۔ پھر جبرائیل علیہ السلام مجھے لے کر آگے بڑھے اور سدرۃالمنتہیٰ کے پاس لائے جہاں مختلف قسم کے رنگ نظر آئے ، جنہوں نے اس درخت کو چھپا رکھا تھا میں نہیں جانتا کہ وہ کیا تھے ۔ اس کے بعد مجھے جنت میں داخل کیا گیا تو میں نے دیکھا کہ موتی کے گنبد بنے ہوئے ہیں اور اس کی مٹی مشک کی طرح خوشبودار تھی ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 171230,
        "last_updated": null
    },
    {
        "urduURN": 4033000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3343,
        "hadithSanad": "ہم سے محمد بن عرعرہ نے بیان کیا ، ہم سے شعبہ نے بیان کیا ، ان سے حکم نے ، ان سے مجاہد نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( غزوہ خندق کے موقع پر ) پروا ہوا سے میری مدد کی گئی اور قوم عاد پچھوا ہوا سے ہلاک کر دی گئی تھی ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 171240,
        "last_updated": null
    },
    {
        "urduURN": 4033010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3344,
        "hadithSanad": "( حضرت امام بخاری رحمہ اللہ نے کہا ) کہ ابن کثیر نے بیان کیا ، ان سے سفیان ثوری نے ، ان سے ان کے والد نے ، ان سے ابن ابی نعیم نے اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "حضرت علی رضی اللہ عنہ نے ( یمن سے ) نبی کریم صلی اللہ علیہ وسلم کی خدمت میں کچھ سونا بھیجا تو آپ نے اسے چار آدمیوں میں تقسیم کر دیا ، اقرع بن حابس حنظلی ثم المجاشعی ، عیینہ بن بدر فزاری ، زید طائی بنی نبہان والے اور علقمہ بن علاثہ عامری بنو کلاب والے ، اس پر قریش اور انصار کے لوگوں کو غصہ آیا اور کہنے لگے کہ آنحضرت صلی اللہ علیہ وسلم نے نجد کے بڑوں کو تو دیا لیکن ہمیں نظرانداز کر دیا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں صرف ان کے دل ملانے کے لیے انہیں دیتا ہوں ( کیونکہ ابھی حال ہی میں یہ لوگ مسلمان ہوئے ہیں ) پھر ایک شخص سامنے آیا ، اس کی آنکھیں دھنسی ہوئی تھیں ، کلے پھولے ہوئے تھے ، پیشانی بھی اٹھی ہوئی ، ڈاڑھی بہت گھنی تھی اور سر منڈا ہوا تھا ۔ اس نے کہا اے محمد ! اللہ سے ڈرو ( صلی اللہ علیہ وسلم ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، اگر میں ہی اللہ کی نافرمانی کروں گا تو پھر اس کی فرمانبرداری کون کرے گا ؟ اللہ تعالیٰ نے مجھے روئے زمین پر دیانت دار بنا کر بھیجا ہے ۔ کیا تم مجھے امین نہیں سمجھتے ؟ اس شخص کی اس گستاخی پر ایک صحابی نے اس کے قتل کی اجازت چاہی ، میرا خیال ہے کہ یہ حضرت خالد بن ولید تھے ، لیکن آنحضرت صلی اللہ علیہ وسلم نے انہیں اس سے روک دیا ، پھر وہ شخص وہاں سے چلنے لگا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا اس شخص کی نسل سے یا ( آپ صلی اللہ علیہ وسلم نے فرمایا کہ ) اس شخص کے بعد اسی کی قوم سے ایسے لوگ جھوٹے مسلمان پیدا ہوں گے ، جو قرآن کی تلاوت تو کریں گے ، لیکن قرآن مجید ان کے حلق سے نیچے نہیں اترے گا ، دین سے وہ اس طرح نکل جائیں گے جیسے تیر کمان سے نکل جاتاہے ، یہ مسلمانوں کو قتل کریں گے اور بت پرستوں کو چھوڑ دیں گے ، اگر میری زندگی اس وقت تک باقی رہے تو میں ان کو اس طرح قتل کروں گا جیسے قوم عاد کا ( عذاب الٰہی سے ) قتل ہوا تھا کہ ایک بھی باقی نہ بچا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 171250,
        "last_updated": null
    },
    {
        "urduURN": 4033020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3345,
        "hadithSanad": "ہم سے خالد بن یزید نے بیان کیا ، کہا ہم سے اسرائیل نے بیان کیا ، ان سے ابواسحاق نے ان سے اسود نے کہا کہ میں نے حضرت عبداللہ بن مسعود رضی اللہ عنہما سے سنا ، وہ بیان کرتے تھے کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا آپ آیت فہل من مدکر کی تلاوت فرما رہے تھے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 171260,
        "last_updated": null
    },
    {
        "urduURN": 4033030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3346,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے عروہ بن زبیر نے اور ان سے حضرت زینب بنت ابی سلمہ رضی اللہ عنہا نے ، ان سے ام حبیبہ بنت ابی سفیان نے ، ان سے زینب بنت جحش رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ان کے یہاں تشریف لائے آپ کچھ گھبرائے ہوئے تھے ۔ پھر آپ نے فرمایا کہ اللہ کے سوا اور کوئی معبود نہیں ، ملک عرب میں اس برائی کی وجہ سے بربادی آ جائے گی جس کے دن قریب آنے کو ہیں ، آج یاجوج ماجوج نے دیوار میں اتنا سوراخ کر دیا ہے پھر آنحضرت صلی اللہ علیہ وسلم نے انگوٹھے اور اس کے قریب کی انگلی سے حلقہ بنا کر بتلایا ۔ ام المؤمنین حضرت زینب بنت جحش رضی اللہ عنہا نے بیان کیا کہ میں نے سوال کیا یا رسول اللہ ! کیا ہم اس کے باوجود ہلاک کر دئیے جائیں گے کہ ہم میں نیک لوگ بھی موجود ہوں گے ؟ آپ نے فرمایا کہ جب فسق و فجور بڑھ جائے گا ( تو یقیناً بربادی ہو گی ) ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 171270,
        "last_updated": null
    },
    {
        "urduURN": 4033040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3347,
        "hadithSanad": "ہمیں مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے وہیب نے ، ان سے ابن طاوس نے ، ان سے ان کے والد طاوس نے ، ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اللہ پاک نے یاجوج ماجوج کی دیوار سے اتنا کھول دیا ہے ، پھر آپ نے اپنی انگلیوں سے نوے کا عدد بنا کر بتلایا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 171280,
        "last_updated": null
    },
    {
        "urduURN": 4033050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3348,
        "hadithSanad": "مجھ سے اسحاق بن نصر نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے اعمش نے ، ان سے ابوصالح نے اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ ( قیامت کے دن ) فرمائے گا ، اے آدم ! آدم علیہ السلام عرض کریں گے میں اطاعت کے لیے حاضر ہوں ، مستعد ہوں ، ساری بھلائیاں صرف تیرے ہی ہاتھ میں ہیں ۔ اللہ تعالیٰ فرمائے گا ، جہنم میں جانے والوں کو ( لوگوں میں سے الگ ) نکال لو ۔ حضرت آدم علیہ السلام عرض کریں گے ۔ اے اللہ ! جہنمیوں کی تعداد کتنی ہے ؟ اللہ تعالیٰ فرمائے گا کہ ہر ایک ہزار میں سے نو سو ننانوے ۔ اس وقت ( کی ہولناکی اور وحشت سے ) بچے بوڑھے ہو جائیں گے اور ہر حاملہ عورت اپنا حمل گرا دے گی ۔ اس وقت تم ( خوف و دہشت سے ) لوگوں کو مدہوشی کے عالم میں دیکھو گے ، حالانکہ وہ بیہوش نہ ہوں گے ۔ لیکن اللہ کا عذاب بڑا ہی سخت ہو گا ۔ صحابہ نے عرض کیا یا رسول اللہ ! وہ ایک شخص ہم میں سے کون ہو گا ؟ حضور صلی اللہ علیہ وسلم نے فرمایا کہ تمہیں بشارت ہو ، وہ ایک آدمی تم میں سے ہو گا اور ایک ہزار دوزخی یاجوج ماجوج کی قوم سے ہوں گے ۔ پھر حضور صلی اللہ علیہ وسلم نے فرمایا اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ، مجھے امید ہے کہ تم ( امت مسلمہ ) تمام جنت والوں کے ایک تہائی ہو گے ۔ پھر ہم نے اللہ اکبر کہا تو آپ نے فرمایا کہ مجھے امید ہے کہ تم تمام جنت والوں کے آدھے ہو گے پھر ہم نے اللہ اکبر کہا ، پھر آپ نے فرمایا کہ ( محشر میں ) تم لوگ تمام انسانوں کے مقابلے میں اتنے ہو گے جتنے کسی سفید بیل کے جسم پر ایک سیاہ بال ، یا جتنے کسی سیاہ بیل کے جسم پر ایک سفید بال ہوتا ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 171290,
        "last_updated": null
    },
    {
        "urduURN": 4033060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3349,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو سفیان ثوری نے خبر دی ، ان سے مغیرہ بن نعمان نے بیان کیا ، کہا کہ مجھ سے سعید بن جبیر نے بیان کیا اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا تم لوگ حشر میں ننگے پاؤں ، ننگے جسم اور بن ختنہ اٹھائے جاؤ گے ۔ پھر آپ نے اس آیت کی تلاوت کی کہ ” جیسا کہ ہم نے پیدا کیا تھا پہلی مرتبہ ، ہم ایسے ہی لوٹائیں گے ۔ یہ ہماری طرف سے ایک وعدہ ہے جس کو ہم پورا کر کے رہیں گے ( سورۃ انبیاء ) اور انبیاء میں سب سے پہلے حضرت ابراہیم علیہ السلام کو کپڑا پہنایا جائے گا اور میرے اصحاب میں سے بعض کو جہنم کی طرف لے جایا جائے گا تو میں پکار اٹھوں گا کہ یہ تو میرے اصحاب ہیں ، میرے اصحاب ! لیکن مجھے بتایا جائے گا کہ آپ کی وفات کے بعد ان لوگوں نے پھر کفر اختیار کر لیا تھا ۔ اس وقت میں بھی وہی جملہ کہوں گا جو نیک بندے ( عیسیٰ علیہ السلام ) کہیں گے کہ ” جب تک میں ان کے ساتھ تھا ۔ ان پر نگران تھا ، اللہ تعالیٰ کے ارشاد الحکیم تک ۔ “</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 171300,
        "last_updated": null
    },
    {
        "urduURN": 4033070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3350,
        "hadithSanad": "ہم سے اسماعیل بن عبداللہ نے بیان کیا کہ مجھے میرے بھائی عبدالحمید نے خبر دی ، انہیں ابن ابی ذئب نے ، انہیں سعید مقبری نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ حضرت ابراہیم علیہ السلام اپنے والد آذر سے قیامت کے دن جب ملیں گے تو ان کے ( والد کے ) چہرے پر سیاہی اور غبار ہو گا ۔ حضرت ابراہیم علیہ السلام کہیں گے کہ کیا میں نے آپ سے نہیں کہا تھا کہ میری مخالفت نہ کیجئے ۔ وہ کہیں گے کہ آج میں آپ کی مخالفت نہیں کرتا ۔ حضرت ابراہیم علیہ السلام عرض کریں گے کہ اے رب ! تو نے وعدہ فرمایا تھا کہ مجھے قیامت کے دن رسوا نہیں کرے گا ۔ آج اس رسوائی سے بڑھ کر اور کون سی رسوائی ہو گی کہ میرے والد تیری رحمت سے سب سے زیادہ دور ہیں ۔ اللہ تعالیٰ فرمائے گا کہ میں نے جنت کافروں پر حرام قرار دی ہے ۔ پھر کہا جائے گا کہ اے ابراہیم ! تمہارے قدموں کے نیچے کیا چیز ہے ؟ وہ دیکھیں گے تو ایک ذبح کیا ہوا جانور خون میں لتھڑا ہوا وہاں پڑا ہو گا اور پھر اس کے پاؤں پکڑ کر اسے جہنم میں ڈال دیا جائے گا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 171310,
        "last_updated": null
    },
    {
        "urduURN": 4033080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3351,
        "hadithSanad": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، کہا کہ مجھ سے عبداللہ بن وہب نے بیان کیا ، کہا کہ مجھے عمرو بن حارث نے خبر دی ، ان سے بکیر نے بیان کیا ، ان سے ابن عباس کے مولیٰ کریب نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم بیت اللہ میں داخل ہوئے تو اس میں حضرت ابراہیم اور حضرت مریم علیہما السلام کی تصویریں دیکھیں ، آپ نے فرمایا کہ قریش کو کیا ہو گیا ؟ حالانکہ انہیں معلوم ہے کہ فرشتے کسی ایسے گھر میں داخل نہیں ہوتے جس میں تصویریں رکھی ہوں ، یہ حضرت ابراہیم علیہ السلام کی تصویر ہے اور وہ بھی پانسہ پھینکتے ہوئے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 171320,
        "last_updated": null
    },
    {
        "urduURN": 4033090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3352,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا ہم کو ہشام نے خبر دی ، انہیں معمر نے ، انہیں ایوب نے ، انہیں عکرمہ نے اور انہیں حضرت ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے جب بیت اللہ میں تصویریں دیکھیں تو اندر اس وقت تک داخل نہ ہوئے جب تک وہ مٹا نہ دی گئیں اور آپ نے ابراہیم علیہ السلام اور اسماعیل علیہ السلام کی تصویریں دیکھیں کہ ان کے ہاتھوں میں تیر ( پانسے کے ) تھے تو آپ نے فرمایا ، اللہ ان پر بربادی لائے ۔ واللہ ان حضرات نے کبھی تیر نہیں پھینکے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 171330,
        "last_updated": null
    },
    {
        "urduURN": 4033100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3353,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے یحییٰ بن سعید نے بیان کیا ، کہا ہم سے عبیداللہ نے بیان کیا ، کہا کہ مجھ سے سعید بن ابی سعید نے بیان کیا ، ان سے ان کے والد نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "عرض کیا گیا یا رسول اللہ ! سب سے زیادہ شریف کون ہے ؟ حضور صلی اللہ علیہ وسلم نے فرمایا کہ جو سب سے زیادہ پرہیزگار ہو ۔ صحابہ نے عرض کیا کہ ہم حضور صلی اللہ علیہ وسلم سے اس کے متعلق نہیں پوچھتے ۔ حضور صلی اللہ علیہ وسلم نے فرمایا پھر اللہ کے نبی یوسف بن نبی اللہ بن نبی اللہ بن خلیل اللہ ( سب سے زیادہ شریف ہیں ) صحابہ نے کہا کہ ہم اس کے متعلق بھی نہیں پوچھتے ۔ حضور صلی اللہ علیہ وسلم نے فرمایا کہ اچھا عرب کے خاندانوں کے متعلق تم پوچھنا چاہتے ہو ۔ سنو جو جاہلیت میں شریف تھے اسلام میں بھی وہ شریف ہیں جب کہ دین کی سمجھ انہیں آ جائے ۔ ابواسامہ اور معتمر نے عبیداللہ سے بیان کیا ، ان سے سعید نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 171340,
        "last_updated": null
    },
    {
        "urduURN": 4033110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3354,
        "hadithSanad": "ہم سے مؤمل نے بیان کیا ، کہا ہم سے اسماعیل نے بیان کیا ، کہا ہم سے عوف نے ، کہا ہم سے ابورجاء نے ، کہا ہم سے سمرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا آج کی رات میرے پاس ( خواب میں ) دو فرشتے ( جبرائیل و میکائیل علیہما السلام ) آئے ۔ پھر یہ دونوں فرشتے مجھے ساتھ لے کر ایک لمبے قد کے بزرگ کے پاس گئے ، وہ اتنے لمبے تھے کہ ان کا سر میں نہیں دیکھ پاتا تھا اور یہ حضرت ابراہیم علیہ السلام تھے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 171350,
        "last_updated": null
    },
    {
        "urduURN": 4033120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3355,
        "hadithSanad": "ہم سے بیان بن عمرو نے بیان کیا ، کہا ہم سے نضر نے بیان کیا ، کہا ہم کو ابن عون نے خبر دی ، انہیں مجاہد نے اور انہوں نے حضرت ابن عباس رضی اللہ عنہما سے سنا",
        "hadithText": "آپ کے سامنے لوگ دجال کا تذکرہ کر رہے تھے کہ اس کی پیشانی پر لکھا ہوا ہو گا ” کافر “ یا ( یوں لکھا ہوا ہو گا ) ” ک ف ر “ حضرت ابن عباس رضی اللہ عنہما نے کہا کہ آنحضرت صلی اللہ علیہ وسلم سے میں نے یہ حدیث نہیں سنی تھی ۔ البتہ آپ نے ایک مرتبہ یہ حدیث بیان فرمائی کہ ابراہیم علیہ السلام ( کی شکل و وضع معلوم کرنے ) کے لیے تم اپنے صاحب کو دیکھ سکتے ہو اور حضرت موسیٰ علیہ السلام کا بدن گٹھا ہوا ، گندم گوں ، ایک سرخ اونٹ پر سوار تھے ۔ جس کی نکیل کھجور کی چھال کی تھی ۔ جیسے میں انہیں اس وقت بھی دیکھ رہا ہوں کہ وہ اللہ کی بڑائی بیان کرتے ہوئے وادی میں اتر رہے ہیں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 171360,
        "last_updated": null
    },
    {
        "urduURN": 4033130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3356,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے مغیرہ بن عبدالرحمٰن القرشی نے بیان کیا ، ان سے ابوالزناد نے ، ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، حضرت ابراہیم علیہ السلام نے اسی ( 80 ) سال کی عمر میں بسولے سے ختنہ کیا ۔ \n<span class=urdu_sanad>ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، کہا ہم سے ابوالزناد نے بیان کیا ، پھر یہی حدیث نقل کی</span> لیکن پہلی روایت میں قدوم بہ تشدید دال ہے اور اس میں قدوم بہ تخفیف دال ہے ۔ دونوں کے معنی ایک ہی ہیں ۔ یعنی بسولہ ( جو بڑھیوں کا ایک مشہور ہتھیار ہوتا ہے اسے بسوہ بھی کہتے ہیں ) شعیب کے ساتھ اس حدیث کو عبدالرحمٰن بن اسحاق نے بھی ابوالزناد سے روایت کیا ہے اور عجلان نے ابوہریرہ رضی اللہ عنہ سے اور محمد بن عمرو نے ابوسلمہ سے روایت کیا ہے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 171370,
        "last_updated": null
    },
    {
        "urduURN": 4033150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3357,
        "hadithSanad": "ہم سے سعید بن تلید رعینی نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ بن وہب نے خبر دی ، کہا کہ مجھے جریر بن حازم نے خبر دی ، انہیں ایوب سختیانی نے ، انہیں محمد بن سیرین نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، ابراہیم علیہ السلام نے توریہ تین مرتبہ کے سوا اور کبھی نہیں کیا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 171380,
        "last_updated": null
    },
    {
        "urduURN": 4033160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3358,
        "hadithSanad": "ہم سے محمد بن محبوب نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب نے ، ان سے محمد نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ابراہیم علیہ السلام نے تین مرتبہ جھوٹ بولا تھا ، دو ان میں سے خالص اللہ عزوجل کی رضا کے لیے تھے ۔ ایک تو ان کا فرمانا ( بطور توریہ کے ) کہ ” میں بیمار ہوں “ اور دوسرا ان کا یہ فرمانا کہ ” بلکہ یہ کام تو ان کے بڑے ( بت ) نے کیا ہے “ اور بیان کیا کہ ایک مرتبہ ابراہیم علیہ السلام اور سارہ علیہا السلام ایک ظالم بادشاہ کی حدود سلطنت سے گزر رہے تھے ۔ بادشاہ کو خبر ملی کہ یہاں ایک شخص آیا ہوا ہے اور اس کے ساتھ دنیا کی ایک خوبصورت ترین عورت ہے ۔ بادشاہ نے ابراہیم علیہ السلام کے پاس اپنا آدمی بھیج کر انہیں بلوایا اور حضرت سارہ علیہا السلام کے متعلق پوچھا کہ یہ کون ہیں ؟ حضرت ابراہیم علیہ السلام نے فرمایا کہ یہ میری بہن ہیں ۔ پھر آپ سارہ علیہا السلام کے پاس آئے اور فرمایا کہ اے سارہ ! یہاں میرے اور تمہارے سوا اور کوئی بھی مومن نہیں ہے اور اس بادشاہ نے مجھ سے پوچھا تو میں نے اس سے کہہ دیا کہ تم میری ( دینی اعتبار سے ) بہن ہو ۔ اس لیے اب تم کوئی ایسی بات نہ کہنا جس سے میں جھوٹا بنوں ۔ پھر اس ظالم نے حضرت سارہ کو بلوایا اور جب وہ اس کے پاس گئیں تو اس نے ان کی طرف ہاتھ بڑھانا چاہا لیکن فوراً ہی پکڑ لیا گیا ۔ پھر وہ کہنے لگا کہ میرے لیے اللہ سے دعا کرو ( کہ اس مصیبت سے نجات دے ) میں اب تمہیں کوئی نقصان نہیں پہنچاؤں گا ، چنانچہ انہوں نے اللہ سے دعا کی اور وہ چھوڑ دیا گیا ۔ لیکن پھر دوسری مرتبہ اس نے ہاتھ بڑھایا اور اس مرتبہ بھی اسی طرح پکڑ لیا گیا ، بلکہ اس سے بھی زیادہ سخت اور پھر کہنے لگا کہ اللہ سے میرے لیے دعا کرو ، میں اب تمہیں کوئی نقصان نہیں پہنچاؤں گا ۔ سارہ علیہا السلام نے دعا کی اور وہ چھوڑ دیا گیا ۔ اس کے بعد اس نے اپنے کسی خدمت گار کو بلا کر کہا کہ تم لوگ میرے پاس کسی انسان کو نہیں لائے ہو ، یہ تو کوئی سرکش جن ہے ( جاتے ہوئے ) سارہ علیہ السلام کے لیے اس نے ہاجرہ علیہا السلام کو خدمت کے لیے دیا ۔ جب سارہ آئیں تو ابراہیم علیہ السلام کھڑے نماز پڑھ رہے تھے ۔ آپ نے ہاتھ کے اشارہ سے ان کا حال پوچھا ۔ انہوں نے کہا کہ اللہ تعالیٰ نے کافر یا ( یہ کہا کہ ) فاجر کے فریب کو اسی کے منہ پر دے مارا اور ہاجرہ علیہا السلام کو خدمت کے لیے دیا ۔ ابوہریرہ رضی اللہ عنہ نے کہا کہ اے بنی ماء السماء ( اے آسمانی پانی کی اولاد ! یعنی اہل عرب ) تمہاری والدہ یہی ( حضرت ہاجرہ علیہا السلام ) ہیں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 171390,
        "last_updated": null
    },
    {
        "urduURN": 4033170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3359,
        "hadithSanad": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا یا ابن سلام نے ( ہم سے بیان کیا عبیداللہ بن موسیٰ کے واسطے سے ) انہیں ابن جریج نے خبر دی ، انہیں عبدالحمید بن جبیر نے ، انہیں سعید بن مسیب نے اور انہیں حضرت ام شریک رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے گرگٹ کو مارنے کا حکم دیا تھا اور فرمایا کہ اس نے حضرت ابراہیم علیہ السلام کی آگ پر پھونکا تھا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 171400,
        "last_updated": null
    },
    {
        "urduURN": 4033180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3360,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، ان سے اعمش نے بیان کیا کہا کہ مجھ سے ابراہیم نے بیان کیا ، ان سے علقمہ نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "جب یہ آیت اتری ” جو لوگ ایمان لائے اور اپنے ایمان میں کسی قسم کے ظلم کی ملاوٹ نہ کی “ تو ہم نے عرض کیا یا رسول اللہ ! ہم میں ایسا کون ہو گا جس نے اپنی جان پر ظلم نہ کیا ہو گا ؟ حضور صلی اللہ علیہ وسلم نے فرمایا کہ واقعہ وہ نہیں جو تم سمجھتے ہو ” جس نے اپنے ایمان کے ساتھ ظلم کی ملاوٹ نہ کی “ ( میں ظلم سے مراد ) شرک ہے کیا تم نے لقمان علیہ السلام کی اپنے بیٹے کو یہ نصیحت نہیں سنی کہ ” اے بیٹے ! اللہ کے ساتھ شریک نہ کرنا ، بیشک شرک بہت ہی بڑا ظلم ہے “ ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 171410,
        "last_updated": null
    },
    {
        "urduURN": 4033190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3361,
        "hadithSanad": "ہم سے اسحاق بن ابراہیم بن نصر نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے ابوحیان نے ، ان سے ابوزرعہ نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ایک مرتبہ گوشت پیش کیا گیا تو آپ نے فرمایا کہ اللہ تعالیٰ قیامت کے دن اولین و آخرین کو ایک ہموار اور وسیع میدان میں جمع کرے گا ، اس طرح کہ پکارنے والا سب کو اپنی بات سنا سکے گا اور دیکھنے والا سب کو ایک ساتھ دیکھ سکے گا ( کیونکہ یہ میدان ہموار ہو گا ، زمین کی طرح گول نہ ہو گا ) اور لوگوں سے سورج بالکل قریب ہو جائے گا ۔ پھر آپ نے شفاعت کا ذکر کیا کہ لوگ حضرت ابراہیم علیہ السلام کی خدمت میں حاضر ہوں گے اور عرض کریں گے کہ آپ روئے زمین پر اللہ کے نبی اور خلیل ہیں ۔ ہمارے لیے اپنے رب کے حضور میں شفاعت کیجئے ، پھر انہیں اپنے جھوٹ ( توریہ ) یاد آ جائیں گے اور کہیں گے کہ آج تو مجھے اپنی ہی فکر ہے ۔ تم لوگ حضرت موسیٰ علیہ السلام کے پاس جاؤ ۔ ابوہریرہ رضی اللہ عنہ کے ساتھ حضرت انس رضی اللہ عنہ نے بھی نبی کریم صلی اللہ علیہ وسلم سے اس حدیث کو روایت کیا ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 171420,
        "last_updated": null
    },
    {
        "urduURN": 4033200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3362,
        "hadithSanad": "مجھ سے ابوعبداللہ احمد بن سعید نے بیان کیا ، ہم سے وہب بن جریرنے بیان کیا ، ان سے ان کے والد جریر بن حازم نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے عبداللہ بن سعید بن جبیر نے ، ان سے ان کے والد سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اللہ اسماعیل علیہ السلام کی والدہ ( حضرت ہاجرہ علیہا السلام ) پر رحم کرے ، اگر انہوں نے جلدی نہ کی ہوتی ( اور زمزم کے پانی کے گرد منڈیر نہ بناتیں ) تو آج وہ ایک بہتا ہوا چشمہ ہوتا ۔ \n<span class=urdu_sanad>محمد بن عبداللہ انصاری نے کہا کہ ہم سے اسی طرح یہ حدیث ابن جریج نے بیان کی لیکن کثیر بن کثیر نے مجھ سے یوں بیان کیا کہ</span> میں اور عثمان بن ابوسلیمان دونوں سعید بن جبیر کے پاس بیٹھے ہوئے تھے ، اتنے میں انہوں نے کہا کہ ابن عباس رضی اللہ عنہما نے مجھ سے یہ حدیث اس طرح بیان نہیں کی بلکہ یوں کہا کہ ابراہیم علیہ السلام اپنے بیٹے اسماعیل اور ان کی والدہ حضرت ہاجرہ علیہا السلام اسماعیل علیہ السلام کو لے کر مکہ کی سرزمین کی طرف آئے ۔ حضرت ہاجرہ علیہا السلام اسماعیل علیہ السلام کو دودھ پلاتی تھیں ۔ ان کے ساتھ ایک پرانی مشک تھی ۔ ابن عباس نے اس حدیث کو مرفوع نہیں کیا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 171431,
        "last_updated": null
    },
    {
        "urduURN": 4033220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3364,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں ایوب سختیانی اور کثیر بن کثیر بن مطلب بن ابی وداعہ نے ۔ یہ دونوں کچھ زیادہ اور کمی کے ساتھ بیان کرتے ہیں ، وہ دونوں سعید بن جبیر سے کہ",
        "hadithText": "ابن عباس رضی اللہ عنہما نے بیان کیا ، عورتوں میں کمر پٹہ باندھنے کا رواج اسماعیل علیہ السلام کی والدہ ( ہاجرہ علیہا السلام ) سے چلا ہے ۔ سب سے پہلے انہوں نے کمر پٹہ اس لیے باندھا تھا تاکہ سارہ علیہا السلام ان کا سراغ نہ پائیں ( وہ جلد بھاگ جائیں ) پھر انہیں اور ان کے بیٹے اسماعیل کو ابراہیم ( علیہما السلام ) ساتھ لے کر مکہ میں آئے ، اس وقت ابھی وہ اسماعیل علیہ السلام کو دودھ پلاتی تھیں ۔ ابراہیم علیہ السلام نے دونوں کو کعبہ کے پاس ایک بڑے درخت کے پاس بٹھا دیا جو اس جگہ تھا جہاں اب زمزم ہے ۔ مسجد کی بلند جانب میں ۔ ان دنوں مکہ میں کوئی انسان نہیں تھا ۔ اس لیے وہاں پانی نہیں تھا ۔ ابراہیم علیہ السلام نے ان دونوں کو وہیں چھوڑ دیا اور ان کے لیے ایک چمڑے کے تھیلے میں کھجور اور ایک مشک میں پانی رکھ دیا ۔ پھر ابراہیم علیہ السلام ( اپنے گھر کے لیے ) روانہ ہوئے ۔ اس وقت اسماعیل علیہ السلام کی والدہ ان کے پیچھے پیچھے آئیں اور کہا کہ اے ابراہیم ! اس خشک جنگل میں جہاں کوئی بھی آدمی اور کوئی بھی چیز موجود نہیں ، آپ ہمیں چھوڑ کر کہاں جا رہے ہیں ؟ انہوں نے کئی دفعہ اس بات کو دہرایا لیکن ابراہیم علیہ السلام ان کی طرف دیکھتے نہیں تھے ۔ آخر ہاجرہ علیہا السلام نے پوچھا کیا اللہ تعالیٰ نے آپ کو اس کا حکم دیا ہے ؟ ابراہیم علیہ السلام نے فرمایا کہ ہاں ، اس پر ہاجرہ علیہا السلام بول اٹھیں کہ پھر اللہ تعالیٰ ہماری حفاظت کرے گا ، وہ ہم کو ہلاک نہیں کرے گا ۔ چنانچہ وہ واپس آ گئیں اور ابراہیم علیہ السلام روانہ ہو گئے ۔ جب وہ ثنیہ پہاڑی پر پہنچے جہاں سے وہ دکھائی نہیں دیتے تھے تو ادھر رخ کیا ، جہاں اب کعبہ ہے ( جہاں پر ہاجرہ اور اسماعیل علیہما السلام کو چھوڑ کر آئے تھے ) پھر آپ نے دونوں ہاتھ اٹھا کر یہ دعا کی کہ اے میرے رب ! میں نے اپنی اولاد کو اس بےآب و دانہ میدان میں تیری حرمت والے گھر کے پاس ٹھہرایا ہے ( سورۃ ابراہیم ) یشکرون تک ۔ ادھر اسماعیل علیہ السلام کی والدہ ان کو دودھ پلانے لگیں اور خود پانی پینے لگیں ۔ آخر جب مشک کا سارا پانی ختم ہو گیا تو وہ پیاسی رہنے لگیں اور ان کے لخت جگر بھی پیاسے رہنے لگے ۔ وہ اب دیکھ رہی تھیں کہ سامنے ان کا بیٹا ( پیاس کی شدت سے ) پیچ و تاب کھا رہا ہے یا ( کہا کہ ) زمین پر لوٹ رہا ہے ۔ وہ وہاں سے ہٹ گئیں کیونکہ اس حالت میں بچے کو دیکھنے سے ان کا دل بے چین ہوتا تھا ۔ صفا پہاڑی وہاں سے نزدیک تر تھی ۔ وہ ( پانی کی تلاش میں ) اس پر چڑھ گئیں اور وادی کی طرف رخ کر کے دیکھنے لگیں کہ کہیں کوئی انسان نظر آئے لیکن کوئی انسان نظر نہیں آیا ، وہ صفا سے اتر گئیں اور جب وادی میں پہنچیں تو اپنا دامن اٹھا لیا ( تاکہ دوڑتے وقت نہ الجھیں ) اور کسی پریشان حال کی طرح دوڑنے لگیں پھر وادی سے نکل کر مروہ پہاڑی پر آئیں اور اس پر کھڑی ہو کر دیکھنے لگیں کہ کہیں کوئی انسان نظر آئے لیکن کوئی نظر نہیں آیا ۔ اس طرح انہوں نے سات چکر لگائے ۔ ابن عباس رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( صفا اور مروہ کے درمیان ) لوگوں کے لیے دوڑنا اسی وجہ سے مشروع ہوا ۔ ( ساتویں مرتبہ ) جب وہ مروہ پر چڑھیں تو انہیں ایک آواز سنائی دی ، انہوں نے کہا ، خاموش ! یہ خود اپنے ہی سے وہ کہہ رہی تھیں اور پھر آواز کی طرف انہوں نے کان لگا دئیے ۔ آواز اب بھی سنائی دے رہی تھی پھر انہوں نے کہا کہ تمہاری آواز میں نے سنی ۔ اگر تم میری کوئی مدد کر سکتے ہو تو کرو ۔ کیا دیکھتی ہیں کہ جہاں اب زمزم ( کا کنواں ) ہے ، وہیں ایک فرشتہ موجود ہے ۔ فرشتے نے اپنی ایڑی سے زمین میں گڑھا کر دیا ، یا یہ کہا کہ اپنے بازو سے ، جس سے وہاں پانی ابل آیا ۔ حضرت ہاجرہ نے اسے حوض کی شکل میں بنا دیا اور اپنے ہاتھ سے اس طرح کر دیا ( تاکہ پانی بہنے نہ پائے ) اور چلو سے پانی اپنے مشکیزہ میں ڈالنے لگیں ۔ جب وہ بھر چکیں تو وہاں سے چشمہ پھر ابل پڑا ۔ ابن عباس رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اللہ ! ام اسماعیل پر رحم کرے ، اگر زمزم کو انہوں نے یوں ہی چھوڑ دیا ہوتا یا آپ نے فرمایا کہ چلو سے مشکیزہ نہ بھرا ہوتا تو زمزم ایک بہتے ہوئے چشمے کی صورت میں ہوتا ۔ بیان کیا کہ پھر ہاجرہ علیہ السلام نے خود بھی وہ پانی پیا اور اپنے بیٹے کو بھی پلایا ۔ اس کے بعد ان سے فرشتے نے کہا کہ اپنے برباد ہونے کا خوف ہرگز نہ کرنا کیونکہ یہیں خدا کا گھر ہو گا ، جسے یہ بچہ اور اس کا باپ تعمیر کریں گے اور اللہ اپنے بندوں کو ضائع نہیں کرتا ، اب جہاں بیت اللہ ہے ، اس وقت وہاں ٹیلے کی طرح زمین اٹھی ہوئی تھی ۔ سیلاب کا دھارا آتا اور اس کے دائیں بائیں سے زمین کاٹ کر لے جاتا ۔ اس طرح وہاں کے دن و رات گزرتے رہے اور آخر ایک دن قبیلہ جرہم کے کچھ لوگ وہاں سے گزرے یا ( آپ نے یہ فرمایا کہ ) قبیلہ جرہم کے چند گھرانے مقام کداء ( مکہ کا بالائی حصہ ) کے راستے سے گزر کر مکہ کے نشیبی علاقے میں انہوں نے پڑاو کیا ( قریب ہی ) انہوں نے منڈلاتے ہوئے کچھ پرندے دیکھے ، ان لوگوں نے کہا کہ یہ پرندہ پانی پر منڈلا رہا ہے ۔ حالانکہ اس سے پہلے جب بھی ہم اس میدان سے گزرے ہیں یہاں پانی کا نام و نشان بھی نہ تھا ۔ آخر انہوں نے اپنا ایک آدمی یا دو آدمی بھیجے ۔ وہاں انہوں نے واقعی پانی پایا چنانچہ انہوں نے واپس آ کر پانی کی اطلاع دی ۔ اب یہ سب لوگ یہاں آئے ۔ راوی نے بیان کیا کہ اسماعیل علیہ السلام کی والدہ اس وقت پانی پر ہی بیٹھی ہوئی تھیں ۔ ان لوگوں نے کہا کہ کیا آپ ہمیں اپنے پڑوس میں پڑاو ڈالنے کی اجازت دیں گی ۔ ہاجرہ علیہ السلام نے فرمایا کہ ہاں لیکن اس شرط کے ساتھ کہ پانی پر تمہارا کوئی حق نہیں ہو گا ۔ انہوں نے اسے تسلیم کر لیا ۔ ابن عباس رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اب ام اسماعیل کو پڑوسی مل گئے ۔ انسانوں کی موجودگی ان کے لیے دلجمعی کا باعث ہوئی ۔ ان لوگوں نے خود بھی یہاں قیام کیا اور اپنے قبیلے کے دوسرے لوگوں کو بھی بلوا لیا اور وہ سب لوگ بھی یہیں آ کر ٹھہر گئے ۔ اس طرح یہاں ان کے کئی گھرانے آ کر آباد ہو گئے اور بچہ ( اسماعیل علیہ السلام جرہم کے بچوں میں ) جوان ہوا اور ان سے عربی سیکھ لی ۔ جوانی میں اسماعیل علیہ السلام ایسے خوبصورت تھے کہ آپ پر سب کی نظریں اٹھتی تھیں اور سب سے زیادہ آپ بھلے لگتے تھے ۔ چنانچہ جرہم والوں نے آپ کی اپنے قبیلے کی ایک لڑکی سے شادی کر دی ۔ پھر اسماعیل علیہ السلام کی والدہ ( ہاجرہ علیہا السلام ) کا انتقال ہو گیا ) ۔ اسماعیل علیہ السلام کی شادی کے بعد ابراہیم علیہ السلام یہاں اپنے چھوڑے ہوئے خاندان کو دیکھنے آئے ۔ اسماعیل علیہ السلام گھر پر نہیں تھے ۔ اس لیے آپ نے ان کی بیوی سے اسماعیل علیہ السلام کے متعلق پوچھا ۔ انہوں نے بتایا کہ روزی کی تلاش میں کہیں گئے ہیں ۔ پھر آپ نے ان سے ان کی معاش وغیرہ کے متعلق پوچھا تو انہوں نے کہا کہ حالت اچھی نہیں ہے ، بڑی تنگی سے گزر اوقات ہوتی ہے ۔ اس طرح انہوں نے شکایت کی ۔ ابراہیم علیہ السلام نے ان سے فرمایا کہ جب تمہارا شوہر آئے تو ان سے میرا سلام کہنا اور یہ بھی کہنا کہ وہ اپنے دروازے کی چوکھٹ بدل ڈالیں ۔ پھر جب اسماعیل علیہ السلام واپس تشریف لائے تو جیسے انہوں نے کچھ انسیت سی محسوس کی اور دریافت فرمایا ، کیا کوئی صاحب یہاں آئے تھے ؟ ان کی بیوی نے بتایا کہ ہاں ایک بزرگ اس اس شکل کے یہاں آئے تھے اور آپ کے بارے میں پوچھ رہے تھے ، میں نے انہیں بتایا ( کہ آپ باہر گئے ہوئے ہیں ) پھر انہوں نے پوچھا کہ تمہاری گزر اوقات کا کیا حال ہے ؟ تو میں نے ان سے کہا کہ ہماری گزر اوقات بڑی تنگی سے ہوتی ہے ۔ اسماعیل علیہ السلام نے دریافت کیا کہ انہوں نے تمہیں کچھ نصیحت بھی کی تھی ؟ ان کی بیوی نے بتایا کہ ہاں مجھ سے انہوں نے کہا تھا کہ آپ کو سلام کہہ دوں اور وہ یہ بھی کہہ گئے ہیں کہ آپ اپنے دروازے کی چوکھٹ بدل دیں ۔ اسماعیل علیہ السلام نے فرمایا کہ وہ بزرگ میرے والد تھے اور مجھے یہ حکم دے گئے ہیں کہ میں تمہیں جدا کر دوں ، اب تم اپنے گھر جا سکتی ہو ۔ چنانچہ اسماعیل علیہ السلام نے انہیں طلاق دے دی اور بنی جرہم ہی میں ایک دوسری عورت سے شادی کر لی ۔ جب تک اللہ تعالیٰ کو منظور رہا ، ابراہیم علیہ السلام ان کے یہاں نہیں آئے ۔ پھر جب کچھ دنوں کے بعد وہ تشریف لائے تو اس مرتبہ بھی اسماعیل علیہ السلام اپنے گھر پر موجود نہیں تھے ۔ آپ ان کی بیوی کے یہاں گئے اور ان سے اسماعیل علیہ السلام کے بارے میں پوچھا ۔ انہوں نے بتایا کہ ہمارے لیے روزی تلاش کرنے گئے ہیں ۔ ابراہیم علیہ السلام نے پوچھا تم لوگوں کا حال کیسا ہے ؟ آپ نے ان کی گزر بسر اور دوسرے حالات کے متعلق پوچھا ، انہوں نے بتایا کہ ہمارا حال بہت اچھا ہے ، بڑی فراخی ہے ، انہوں نے اس کے لیے اللہ کی تعریف و ثنا کی ۔ ابراہیم علیہ السلام نے دریافت فرمایا کہ تم لوگ کھاتے کیا ہو ؟ انہوں نے بتایا کہ گوشت ! آپ نے دریافت کیا فرمایا کہ پیتے کیا ہو ؟ بتایا کہ پانی ! ابراہیم علیہ السلام نے ان کے لیے دعا کی ، اے اللہ ان کے گوشت اور پانی میں برکت نازل فرما ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ان دنوں انہیں اناج میسر نہیں تھا ۔ اگر اناج بھی ان کے کھانے میں شامل ہوتا تو ضرور آپ اس میں بھی برکت کی دعا کرتے ۔ صرف گوشت اور پانی کی خوراک میں ہمیشہ گزارہ کرنا مکہ کے سوا اور کسی زمین پر بھی موافق نہیں پڑتا ۔ ابراہیم علیہ السلام نے ( جاتے ہوئے ) اس سے فرمایا کہ جب تمہارے شوہر واپس آ جائیں تو ان سے میرا سلام کہنا اور ان سے کہہ دینا کہ وہ اپنے دروازے کی چوکھٹ باقی رکھیں ۔ جب اسماعیل علیہ السلام تشریف لائے تو پوچھا کہ کیا یہاں کوئی آیا تھا ؟ انہوں نے بتایا کہ جی ہاں ایک بزرگ ، بڑی اچھی شکل و صورت کے آئے تھے ۔ بیوی نے آنے والے بزرگ کی تعریف کی پھر انہوں نے مجھ سے آپ کے متعلق پوچھا ( کہ کہاں ہیں ؟ ) اور میں نے بتا دیا ، پھر انہوں نے پوچھا کہ تمہاری گزر بسر کا کیا حال ہے ۔ تو میں نے بتایا کہ ہم اچھی حالت میں ہیں ۔ اسماعیل علیہ السلام نے دریافت فرمایا کہ کیا انہوں نے تمہیں کوئی وصیت بھی کی تھی ؟ انہوں نے کہا جی ہاں ، انہوں نے آپ کو سلام کہا تھا اور حکم دیا تھا کہ اپنے دروازے کی چوکھٹ کو باقی رکھیں ۔ اسماعیل علیہ السلام نے فرمایا کہ یہ بزرگ میرے والد تھے ، چوکھٹ تم ہو اور آپ مجھے حکم دے گئے ہیں کہ میں تمہیں اپنے ساتھ رکھوں ۔ پھر جتنے دنوں اللہ تعالیٰ کو منظور رہا ، کے بعد ابراہیم علیہ السلام ان کے یہاں تشریف لائے تو دیکھا کہ اسماعیل زمزم کے قریب ایک بڑے درخت کے سائے میں ( جہاں ابراہیم انہیں چھوڑ گئے تھے ) اپنے تیر بنا رہے ہیں ۔ جب اسماعیل علیہ السلام نے ابراہیم علیہ السلام کو دیکھا تو ان کی طرف کھڑے ہو گے اور جس طرح ایک باپ اپنے بیٹے کے ساتھ اور بیٹا اپنے باپ کے ساتھ محبت کرتا ہے وہی طرز عمل ان دونوں نے بھی ایک دوسرے کے ساتھ اختیار کیا ۔ پھر ابراہیم علیہ السلام نے فرمایا ، اسماعیل اللہ نے مجھے ایک حکم دیا ہے ۔ اسماعیل علیہ السلام نے عرض کیا ، آپ کے رب نے جو حکم آپ کو دیا ہے آپ اسے ضرور پورا کریں ۔ انہوں نے فرمایا اور تم بھی میری مدد کر سکو گے ؟ عرض کیا کہ میں آپ کی مدد کروں گا ۔ فرمایا کہ اللہ تعالیٰ نے مجھے حکم دیا ہے کہ میں اسی مقام پر اللہ کا ایک گھر بناؤں اور آپ نے ایک اور اونچے ٹیلے کی طرف اشارہ کیا کہ اس کے چاروں طرف ! کہا کہ اس وقت ان دونوں نے بیت اللہ کی بنیاد پر عمارت کی تعمیر شروع کی ۔ اسماعیل علیہ السلام پتھر اٹھا اٹھا کر کر لاتے اور ابراہیم علیہ السلام تعمیر کرتے جاتے تھے ۔ جب دیواریں بلند ہو گئیں تو اسماعیل یہ پتھر لائے اور ابراہیم علیہ السلام کے لیے اسے رکھ دیا ۔ اب ابراہیم علیہ السلام اس پتھر پر کھڑے ہو کر تعمیر کرنے لگے ، اسماعیل علیہ السلام پتھر دیتے جاتے تھے اور یہ دونوں یہ دعا پڑھتے جاتے تھے ۔ ہمارے رب ! ہماری یہ خدمت تو قبول کر بیشک تو بڑا سننے والا اور جاننے والا ہے ۔ فرمایا کہ یہ دونوں تعمیر کرتے رہے اور بیت اللہ کے چاروں طرف گھوم گھوم کر یہ دعا پڑھتے رہے ۔ ” اے ہمارے رب ! ہماری طرف سے یہ خدمت قبول فرما ۔ بیشک تو بڑا سننے والا بہت جاننے والا ہے “ ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 171450,
        "last_updated": null
    },
    {
        "urduURN": 4033230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3365,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے ابوعامر عبدالملک بن عمرو نے بیان کیا ، کہا کہ ہم سے ابراہیم بن نافع نے بیان کیا ، ان سے کثیر بن کثیر نے ، ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ابراہیم علیہ السلام اور ان کی بیوی ( حضرت سارہ علیہ السلام ) کے درمیان جو کچھ جھگڑا ہونا تھا جب وہ ہوا تو آپ اسماعیل علیہ السلام اور ان کی والدہ ( حضرت ہاجرہ علیہ السلام ) کو لے کر نکلے ، ان کے ساتھ ایک مشکیزہ تھا ۔ جس میں پانی تھا ، اسماعیل علیہ السلام کی والدہ اسی مشکیزہ کا پانی پیتی رہیں اور اپنا دودھ اپنے بچے کو پلاتی رہیں ۔ جب ابراہیم مکہ پہنچے تو انہیں ایک بڑے درخت کے پاس ٹھہرا کر اپنے گھر واپس جانے لگے ۔ اسماعیل علیہ السلام کی والدہ ان کے پیچھے پیچھے آئیں ۔ جب مقام کداء پر پہنچے تو انہوں نے پیچھے سے آواز دی کہ اے ابراہیم ! ہمیں کس پر چھوڑ کر جا رہے ہیں ؟ انہوں نے فرمایا کہ اللہ پر ! ہاجرہ علیہ السلام نے کہا کہ پھر میں اللہ پر خوش ہوں ۔ بیان کیا کہ پھر حضرت ہاجرہ اپنی جگہ پر واپس چلی آئیں اور اسی مشکیزے سے پانی پیتی رہیں اور اپنا دودھ اپنے بچے کو پلاتی رہیں جب پانی ختم ہو گیا تو انہوں نے سوچا کہ ادھر ادھر دیکھنا چاہئے ، ممکن ہے کہ کوئی آدمی نظرآ جائے ۔ راوی نے بیان کیا کہ یہی سوچ کر وہ صفا ( پہاڑی ) پر چڑھ گئیں اور چاروں طرف دیکھا کہ شاید کوئی نظر آ جائے لیکن کوئی نظر نہ آیا ۔ پھر جب وادی میں اتریں تو دوڑ کر مروہ تک آئیں ۔ اسی طرح کئی چکر لگائے ، پھر سوچا کہ چلوں ذرا بچے کو تو دیکھوں کس حالت میں ہے ۔ چنانچہ آئیں اور دیکھا تو بچہ اسی حالت میں تھا ( جیسے تکلیف کے مارے ) موت کے لیے تڑپ رہا ہو ۔ یہ حال دیکھ کر ان سے صبر نہ ہو سکا ، سوچا چلوں دوبارہ دیکھوں ممکن ہے کہ کوئی آدمی نظرآ جائے ، آئیں اور صفا پہاڑ پر چڑھ گئیں اور چاروں طرف نظر پھیر پھیر کر دیکھتی رہیں لیکن کوئی نظر نہ آیا ۔ اس طرح حضرت ہاجرہ علیہ السلام نے سات چکر لگائے پھر سوچا ، چلوں دیکھوں بچہ کس حالت میں ہے ؟ اسی وقت انہیں ایک آواز سنائی دی ۔ انہوں نے ( آواز سے مخاطب ہو کر ) کہا کہ اگر تمہارے پاس کوئی بھلائی ہے تو میری مدد کرو ۔ وہاں جبرائیل علیہ السلام موجود تھے ۔ انہوں نے اپنی ایڑی سے یوں کیا ( اشارہ کر کے بتایا ) اور زمین ایڑی سے کھودی ۔ راوی نے بیان کیا کہ اس عمل کے نتیجے میں وہاں سے پانی پھوٹ پڑا ۔ ام اسماعیل ڈریں ۔ ( کہیں یہ پانی غائب نہ ہو جائے ) پھر وہ زمین کھودنے لگیں ۔ راوی نے بیان کیا کہ ابوالقاسم صلی اللہ علیہ وسلم نے فرمایا ، اگر وہ پانی کو یوں ہی رہنے دیتیں تو پانی زمین پر بہتا رہتا ۔ غرض ہاجرہ علیہ السلام زمزم کا پانی پیتی رہیں اور اپنا دودھ اپنے بچے کو پلاتی رہیں ۔ ابن عباس رضی اللہ عنہما نے بیان کیا کہ اس کے بعد قبیلہ جرہم کے کچھ لوگ وادی کے نشیب سے گزرے ۔ انہیں وہاں پرند نظر آئے ۔ انہیں یہ کچھ خلاف عادت معلوم ہوا ۔ انہوں نے آپس میں کہا کہ پرندہ تو صرف پانی ہی پر ( اس طرح ) منڈلا سکتا ہے ۔ ان لوگوں نے اپنا آدمی وہاں بھیجا ۔ اس نے جا کر دیکھا تو واقعی وہاں پانی موجود تھا ۔ اس نے آ کر اپنے قبیلے والوں کو خبر دی تو یہ سب لوگ یہاں آ گئے اور کہا کہ اے ام اسماعیل ! کیا ہمیں اپنے ساتھ رہنے کی یا ( یہ کہا کہ ) اپنے ساتھ قیام کرنے کی اجازت دیں گی ؟ پھر ان کے بیٹے ( اسماعیل علیہ السلام ) بالغ ہوئے اور قبیلہ جرہم ہی کی ایک لڑکی سے ان کا نکاح ہو گیا ۔ ابن عباس رضی اللہ عنہما نے بیان کیا کہ پھر ابراہیم علیہ السلام کو خیال آیا اور انہوں نے اپنی اہلیہ ( حضرت سارہ علیہا السلام ) سے فرمایا کہ میں جن لوگوں کو ( مکہ میں ) چھوڑ آیا تھا ان کی خبرلینے جاؤں گا ۔ ابن عباس رضی اللہ عنہما نے بیان کیا کہ پھر ابراہیم علیہ السلام مکہ تشریف لائے اور سلام کر کے دریافت فرمایا کہ اسماعیل کہاں ہیں ؟ ان کی بیوی نے بتایا کہ شکار کے لیے گئے ۔ انہوں نے فرمایا کہ جب وہ آئیں تو ان سے کہنا کہ اپنے دروازے کی چوکھٹ بدل ڈالیں ۔ جب اسماعیل علیہ السلام آئے تو ان کی بیوی نے واقعہ کی اطلاع دی ۔ اسماعیل علیہ السلام نے فرمایا کہ تمہیں ہو ( جسے بدلنے کے لیے ابراہیم علیہ السلام کہہ گئے ہیں ) اب تم اپنے گھر جا سکتی ہو ۔ بیان کیا کہ پھر ایک مدت کے بعد دوبارہ ابراہیم علیہ السلام کو خیال ہوا اور انہوں نے اپنی بیوی سے فرمایا کہ میں جن لوگوں کو چھوڑ آیا ہوں انہیں دیکھنے جاؤں گا ۔ راوی نے بیان کیا کہ ابراہیم علیہ السلام تشریف لائے اور دریافت فرمایا کہ اسماعیل کہاں ہیں ؟ ان کی بیوی نے بتایا کہ شکار کے لیے گئے ہیں ۔ انہوں نے یہ بھی کہا کہ آپ ٹھہرئیے اور کھانا تناول فرما لیجئے ۔ ابراہیم علیہ السلام نے دریافت فرمایا کہ تم لوگ کھاتے پیتے کیا ہو ؟ انہوں نے بتایا کہ گوشت کھاتے ہیں اور پانی پیتے ہیں ۔ آپ نے دعا کی کہ اے اللہ ! ان کے کھانے اور ان کے پانی میں برکت نازل فرما ۔ بیان کیا کہ ابوالقاسم صلی اللہ علیہ وسلم نے فرمایا ، ابراہیم علیہ السلام کی اس دعا کی برکت اب تک چلی آ رہی ہے ۔ راوی نے بیان کیا کہ پھر ( تیسری بار ) ابراہیم علیہ السلام کو ایک مدت کے بعد خیال ہوا اور اپنی اہلیہ سے انہوں نے کہا کہ جن کو میں چھوڑ آیا ہوں ان کی خبر لینے مکہ جاؤں گا ۔ چنانچہ آپ تشریف لائے اور اس مرتبہ اسماعیل علیہ السلام سے ملاقات ہوئی ، جو زمزم کے پیچھے اپنے تیر ٹھیک کر رہے تھے ۔ ابراہیم علیہ السلام نے فرمایا ، اے اسماعیل ! تمہارے رب نے مجھے حکم دیا ہے کہ میں یہاں اس کا ایک گھر بناؤں ، بیٹے نے عرض کیا کہ پھر آپ اپنے رب کا حکم بجا لائیے ۔ انہوں نے فرمایا اور مجھے یہ بھی حکم دیا ہے کہ تم اس کام میں میری مدد کرو ۔ عرض کیا کہ میں اس کے لیے تیار ہوں ۔ یا اسی قسم کے اور الفاظ ادا کئے ۔ راوی نے بیان کیا کہ پھر دونوں باپ بیٹے اٹھے ۔ ابراہیم علیہ السلام دیواریں اٹھاتے تھے اور اسماعیل علیہ السلام انہیں پتھر لا لا کر دیتے تھے اور دونوں یہ دعا کرتے جاتے تھے ۔ اے ہمارے رب ! ہماری طرف سے یہ خدمت قبول کر ۔ بیشک تو بڑا سننے والا ، بہت جاننے والا ہے ۔ راوی نے بیان کیا کہ آخر جب دیوار بلند ہو گئی اور بزرگ ( ابراہیم علیہ السلام ) کو پتھر ( دیوار پر ) رکھنے میں دشواری ہوئی تو وہ مقام ( ابراہیم ) کے پتھر پر کھڑے ہوئے اور اسماعیل علیہ السلام ان کو پتھر اٹھا اٹھا کر دیتے جاتے اور ان حضرات کی زبان پر یہ دعا جاری تھی ۔ ” اے ہمارے رب ! ہماری طرف سے اسے قبول فرما لے ۔ بیشک تو بڑا سننے والا بہت جاننے والا ہے “ ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 171460,
        "last_updated": null
    },
    {
        "urduURN": 4033240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3366,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے عبدالواحد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا ہم سے ابراہیم تیمی نے ، ان سے ان کے والد یزید بن شریک نے بیان کیا کہ میں نے حضرت ابوذر رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نے عرض کیا یا رسول اللہ ! سب سے پہلے روئے زمین پر کون سی مسجد بنی ہے ؟ حضور صلی اللہ علیہ وسلم نے فرمایا کہ مسجدالحرام ۔ انہوں نے بیان کیا کہ پھر میں نے عرض کیا اور اور اس کے بعد ؟ فرمایا کہ مسجدالاقصیٰ ( بیت المقدس ) میں نے عرض کیا ، ان دونوں کی تعمیر کے درمیان کتنا فاصلہ رہا ہے ؟ آپ نے فرمایا کہ چالیس سال ۔ پھر فرمایا اب جہاں بھی تجھ کو نماز کا وقت ہو جائے وہاں نماز پڑھ لے ۔ بڑی فضیلت نماز پڑھنا ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 171470,
        "last_updated": null
    },
    {
        "urduURN": 4033250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3367,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، ان سے امام مالک نے ، ان سے مطلب کے آزاد کردہ غلام عمرو بن ابی عمرو نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے احد پہاڑ کو دیکھ کر فرمایا کہ یہ پہاڑ ہم سے محبت رکھتا ہے اور ہم اس سے محبت رکھتے ہیں ۔ اے اللہ ! حضرات ابراہیم علیہ السلام نے مکہ مکرمہ کو حرمت والا شہر قرار دیا تھا اور میں مدینہ کے دو پتھریلے علاقے کے درمیانی علاقے کے حصے کو حرمت والا قرار دیتا ہوں ۔ اس حدیث کو عبداللہ بن زید رضی اللہ عنہ نے بھی نبی کریم صلی اللہ علیہ وسلم سے روایت کیا ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 171480,
        "last_updated": null
    },
    {
        "urduURN": 4033260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3368,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں ابن شہاب نے ، انہیں سالم بن عبداللہ نے کہ عبداللہ بن عمر رضی اللہ عنہما کو ابن ابی بکر نے خبر دی اور انہیں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، تمہیں معلوم نہیں کہ جب تمہاری قوم نے کعبہ کی ( نئی ) تعمیر کی تو کعبہ کی ابراہیمی بنیاد کو چھوڑ دیا ۔ میں نے عرض کیا یا رسول اللہ ! پھر آپ ابراہیمی بنیادوں کے مطابق دوبارہ اس کی تعمیر کیوں نہیں کر دیتے ۔ حضور صلی اللہ علیہ وسلم نے فرمایا کہ اگر تمہاری قوم کا زمانہ کفر سے قریب نہ ہوتا ( تو میں ایسا ہی کرتا ) عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ جب کہ یہ حدیث حضرت عائشہ رضی اللہ عنہما نے رسول اللہ صلی اللہ علیہ وسلم سے سنی ہے تو میرا خیال ہے کہ حضور صلی اللہ علیہ وسلم نے ان دونوں رکنوں کے ، جو حجراسود کے قریب ہیں ، بوسہ لینے کو صرف اسی وجہ سے چھوڑا تھا کہ بیت اللہ حضرت ابراہیم کی بنیاد پر نہیں بنا ہے ( یہ دونوں رکن آگے ہٹ گئے ہیں ) اسماعیل بن ابی اویس نے اس حدیث میں عبداللہ بن محمد بن ابی بکر کہا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 171490,
        "last_updated": null
    },
    {
        "urduURN": 4033270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3369,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ‘ انہوں نے کہا ہم کو مالک بن انس نے خبر دی ۔ انہیں عبداللہ بن ابی بکر بن محمد بن عمر و بن حزم نے ‘ انہیں ان کے والد نے ‘ انہیں عمرو بن سلیم زرقی نے ‘ انہوں نے کہا مجھ کو ابو حمید ساعدی رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "صحابہ نے عرض کیا یا رسول اللہ ! ہم آپ پر کس طرح درود بھیجا کریں ؟ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ یوں کہا کرو ” اے اللہ ! رحمت نازل فرما محمد پر اور ان کی بیویوں پر اور ان کی اولاد پر جیسا کہ تو نے رحمت نازل فرمائی ابراہیم پر اور اپنی برکت نازل فرما محمد پر اور ان کی بیویوں اور اولاد پر جیسا کہ تو نے برکت نازل فرمائی آل ابراہیم پر ۔ بیشک تو انتہائی خوبیوں والا اور عظمت والا ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 171500,
        "last_updated": null
    },
    {
        "urduURN": 4033280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3370,
        "hadithSanad": "ہم سے قیس بن حفص اور موسیٰ بن اسماعیل نے بیان کیا ‘ انہوں نے کہا کہ ہم سے عبدالواحد بن زیاد نے بیان کیا ‘ انہوں نے کہا ہم سے ابو قرہ مسلم بن سالم ہمدانی نے بیان کیا ‘ انہوں نے کہا کہ مجھ سے عبداللہ بن عیسیٰ نے بیان کیا ‘ انہوں نے عبدالرحمٰن بن ابی لیلیٰ سے سنا ‘ انہوں نے بیان کیا کہ",
        "hadithText": "ایک مرتبہ کعب بن عجرہ رضی اللہ عنہ سے میری ملاقات ہوئی تو انہوں نے کہا کیوں نہ تمہیں ( حدیث کا ) ایک تحفہ پہنچا دوں جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا ۔ میں نے عرض کیا جی ہاں مجھے یہ تحفہ ضرور عنایت فرمائیے ۔ انہوں نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم سے پوچھا تھا یا رسول اللہ ہم آپ پر اور آپ کے اہل بیت پر کس طرح درود بھیجا کریں ؟ اللہ تعالیٰ نے سلام بھیجنے کا طریقہ تو ہمیں خود ہی سکھا دیا ہے ۔ حضور صلی اللہ علیہ وسلم نے فرمایا کہ یوں کہا کرو ” اے اللہ ! اپنی رحمت نازل فرما محمد صلی اللہ علیہ وسلم پر اور آل محمد صلی اللہ علیہ وسلم پر جیسا کہ تو نے اپنی رحمت نازل فرمائی ابراہیم پر اور آل ابراہیم علیہ السلام پر ۔ بیشک تو بڑی خوبیوں والا اور بزرگی والا ہے ۔ اے اللہ ! برکت نازل فرما محمد پر اور آل محمد پر جیسا کہ تو نے برکت نازل فرمائی ابراہیم پر اور آل ابراہیم پر ۔ بیشک تو بڑی خوبیوں والا اور بڑی عظمت والا ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 171510,
        "last_updated": null
    },
    {
        "urduURN": 4033290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3371,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ‘ کہا ہم سے جریر نے بیان کیا ‘ ان سے منصور نے ‘ ان سے منہال نے ‘ ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم حضرت حسن و حسین رضی اللہ عنہ کے لئے پناہ طلب کیا کرتے تھے اور فرماتے تھے کہ تمہارے بزرگ دادا ( ابراہیم علیہ السلام ) بھی ان کلمات کے ذریعہ اللہ کی پناہ اسماعیل اور اسحاق علیہ السلام کے لئے مانگا کرتے تھے “ میں پناہ مانگتا ہوں اللہ کے پورے پورے کلمات کے ذریعہ ہر ایک شیطان سے اور ہر زہریلے جانور سے اور ہر نقصان پہنچانے والی نظر بد سے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 171520,
        "last_updated": null
    },
    {
        "urduURN": 4033300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3372,
        "hadithSanad": "ہم سے احمد بن صالح نے بیان کیا ‘ کہا ہم سے عبداللہ بن وہب نے بیان کیا ‘ کہا کہ مجھے یونس نے خبر دی ‘ انہیں ابن شہاب نے ‘ انہیں ابوسلمہ بن عبدالرحمٰن اور سعید بن مسیب نے ‘ انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ ہم حضرت ابراہیم علیہ السلام کے مقابلے میں شک کرنے کے زیادہ مستحق ہیں جب کہ انہوں نے کہا تھا کہ میرے رب ! مجھے دکھا کہ تو مردوں کو کس طرح زندہ کرتا ہے ۔ اللہ تعالیٰ نے فرمایا ‘ کہا کیا تم ایمان نہیں لائے ‘ انہوں نے عرض کیا کہ کیوں نہیں ‘ لیکن یہ صرف اس لئے تاکہ میرے دل کو اور زیادہ اطمینان ہو جائے اور اللہ لوط علیہ السلام پر رحم کر کہ وہ زبردست رکن ( یعنی اللہ تعالیٰ ) کی پناہ لیتے تھے اور اگر میں اتنی مدت تک قید خانے میں رہتا جتنی مدت تک یوسف علیہ السلام رہے تھے تو میں بلانے والے کے بات ضرور مان لیتا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 171530,
        "last_updated": null
    },
    {
        "urduURN": 4033310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3373,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ کہا ہم سے حاتم بن اسماعیل نے بیان کیا ‘ ان سے یزید بن ابی عبید نے اور ان سے سلمہ بن اکوع رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم قبیلہ اسلم کی ایک جماعت سے گزرے جو تیراندازی میں مقابلہ کر رہی تھی ۔ حضور صلی اللہ علیہ وسلم نے فرمایا ‘ اے بنو اسماعیل ! تیراندازی کئے جاؤ کیونکہ تمہارے بزرگ دادا بھی تیرانداز تھے اور میں بنو فلاں کے ساتھ ہوں ۔ راوی نے بیان کیا کہ یہ سنتے ہی دوسرے فریق نے تیراندازی بند کر دی ۔ حضور صلی اللہ علیہ وسلم نے فرمایا ‘ کیا بات ہوئی ‘ تم لوگ تیر کیوں نہیں چلاتے ؟ انہوں نے عرض کیا یا رسول اللہ ! جب آپ فریق مقابل کے ساتھ ہو گئے تو اب ہم کس طرح تیر چلا سکتے ہیں ۔ اس پر حضور صلی اللہ علیہ وسلم نے فرمایا مقابلہ جاری رکھو ‘ میں تم سب کے ساتھ ہوں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 171540,
        "last_updated": null
    },
    {
        "urduURN": 4033320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3374,
        "hadithSanad": "ہم سے اسحاق بن ابراہیم نے بیان کیا ‘ کہا کہ ہم نے معتمر بن سلیمان سے سنا ‘ انہوں نے عبداللہ عمری سے ‘ انہوں نے سعید بن ابی سعید مقبری سے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم سے پوچھا گیا ‘ سب سے زیادہ شریف کون ہے ؟ آپ نے فرمایا کہ جو سب سے زیادہ متقی ہو ‘ وہ سب سے زیادہ شریف ہے صحابہ نے عرض کیا یا رسول اللہ ! ہمارے سوال کا مقصد یہ نہیں ہے ۔ آپ نے فرمایا کہ پھر سب سے زیادہ شریف یوسف بنی اللہ بن نبی اللہ ( یعقوب ) بن نبی اللہ ( اسحاق ) بن خلیل اللہ ( ابراہیم علیہ السلام ) تھے صحابہ نے عرض کیا ‘ ہمارے سوال کا مقصد یہ بھی نہیں ہے ۔ آپ نے فرمایا کہ کیا تم لوگ عرب کے شرفاء کے بارے میں پوچھنا چاہتے ہو ؟ صحابہ نے عرض کیا کہ جی ہاں ۔ آپ نے فرمایا کہ پھر جاہلیت میں جو لوگ شریف اور اچھے عادات و اخلاق کے تھے وہ اسلام لانے کے بعد بھی شریف اور اچھے سمجھے جائیں گے جب کہ وہ دین کی سمجھ بھی حاصل کریں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 171550,
        "last_updated": null
    },
    {
        "urduURN": 4033330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3375,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ‘ کہا ہم کو شعیب نے خبر دی ‘ ان سے ابوالزناد نے بیان کیا ‘ ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ اللہ تعالیٰ حضرت لوط علیہ السلام کی مغفرت فرمائے کہ وہ زبردست رکن ( یعنی اللہ ) کی پناہ میں گئے تھے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 171560,
        "last_updated": null
    },
    {
        "urduURN": 4033340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3376,
        "hadithSanad": "ہم سے محمود نے بیان کیا ‘ کہا ہم سے ابو احمد نے بیان کیا ‘ ان سے سفیان نے بیان کیا ‘ ان سے ابواسحاق نے ‘ ان سے اسود نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ” فھل من مدکر “ پڑھا تھا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 171570,
        "last_updated": null
    },
    {
        "urduURN": 4033350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3377,
        "hadithSanad": "ہم سے حمیدی نے بیان کیا ‘ کہا ہم سے سفیا ن بن عیینہ نے بیان کیا ‘ کہا ہم سے ہشام بن عروہ نے بیان کیا ‘ ان سے ان کے والد نے اور ان سے عبداللہ بن زمعہ نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ( خطبہ کے دوران ) آپ نے قوم کا ذکر کیا جنہوں نے اونٹنی کو ذبح کر دیا تھا ۔ آپ نے فرمایا کہ ( خدا کی قسم بھیجی ہوئی ) اس ( اونٹنی کو ) ذبح کرنے والا قوم کا ایک بہت ہی باعزت آدمی ( قیدار نامی ) تھا ‘ جیسے ہمارے زمانے میں ابو زمعہ ( اسود بن مطلب ) ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 171580,
        "last_updated": null
    },
    {
        "urduURN": 4033360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3378,
        "hadithSanad": "ہم سے محمد بن مسکین ابوالحسن نے بیان کیا ‘ انہوں نے کہا ہم سے یحییٰ بن حسان بن حیان ابو زکریا نے بیان کیا ‘ انہوں نے کہا ہم سے سلیمان نے بیان کیا ‘ ان سے عبداللہ بن دینار نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے جب حجر ( ثمود کی بستی ) میں غزوہ تبوک کے لئے جاتے ہوئے پڑاو کیا تو آپ نے صحابہ رضی اللہ عنہم کو حکم فرمایا کہ یہاں کے کنوؤں کا پانی نہ پینا اور نہ اپنے برتنوں میں ساتھ لینا ۔ صحابہ رضوان اللہ علیہم اجمعین نے عرض کیا کہ ہم نے تو اس سے اپنا آٹا بھی گوندھ لیا ہے اور پانی اپنے برتنوں میں بھی رکھ لیا ہے ۔ حضور صلی اللہ علیہ وسلم نے انہیں حکم دیا کہ گندھا ہوا آٹا پھینک دیا جائے اور ابوذر رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے نقل کیا ہے کہ جس نے آٹا اس پانی سے گوندھ لیا ہو ( وہ اسے پھینک دے ) ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 171590,
        "last_updated": null
    },
    {
        "urduURN": 4033370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3379,
        "hadithSanad": "ہم سے ابراہیم بن المنذر نے بیان کیا‘انہوں نے کہا ہم سے انس بن عیاض نے بیان کیا ‘ ان سے عبیداللہ نے ‘ ان سے نافع نے اور اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "صحابہ نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ ثمود کی بستی حجر میں پڑاؤ کیا تو وہاں کے کنوؤں کا پانی اپنے برتنوں میں بھر لیا اور آٹا بھی اس پانی سے گوندھ لیا ۔ لیکن حضور صلی اللہ علیہ وسلم نے انہیں حکم دیا کہ جو پانی انہوں نے اپنے برتنوں میں بھر لیا ہے اسے انڈیل دیں اور گندھا ہوا آٹا جانوروں کو کھلا دیں ۔ اس کے بجائے حضور صلی اللہ علیہ وسلم نے انہیں یہ حکم دیا کہ اس کنویں سے پانی لیں جس سے صالح علیہ السلام کی اونٹنی پانی پیا کرتی تھی ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 171600,
        "last_updated": null
    },
    {
        "urduURN": 4033380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3380,
        "hadithSanad": "ہم سے محمد نے بیان کیا ‘ کہا ہم کو عبداللہ نے خبر دی ‘ انہیں معمر نے ‘ ان سے زہری نے بیان کیا ‘ کہا مجھ کو سالم بن عبداللہ نے خبر دی اور انہیں ان کے والد ( عبداللہ رضی اللہ عنہ ) نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جب مقام حجر سے گزرے تو فرمایا کہ ان لوگوں کی بستی میں جنہوں نے ظلم کیا تھا نہ داخل ہو ‘ لیکن اس صورت میں کہ تم روتے ہوئے ہو ۔ کہیں ایسا نہ ہو کہ تم پر وہی عذاب آ جائے جو ان پر آیا تھا ۔ پھر آپ نے اپنی چادر چہرہ مبارک پر ڈال لی ۔ آپ اس وقت کجاوے پر تشریف رکھتے تھے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 171610,
        "last_updated": null
    },
    {
        "urduURN": 4033390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3381,
        "hadithSanad": "مجھ سے عبداللہ نے بیان کیا ‘ کہا ہم سے وہب نے بیان کیا ‘ ان سے ان کے والد نے بیان کیا ‘ انہوں نے یونس سے سنا ‘ انہوں نے زہری سے ‘ انہوں نے سالم سے اور ان سے حضرت ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جب تمہیں ان لوگوں کی بستی سے گزرنا پڑے جنہوں نے اپنی جانوں پر ظلم کیا تھا تو روتے ہوئے گزرو ۔ کہیں تمہیں بھی وہ عذاب آ نہ پکڑے جس میں یہ ظالم لوگ گرفتار کئے گئے تھے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 171620,
        "last_updated": null
    },
    {
        "urduURN": 4033400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3382,
        "hadithSanad": "ہم سے اسحاق بن منصور نے بیان کیا ‘ کہا ہم کو عبدالصمد نے خبر دی ‘ کہا ہم سے عبدالرحمٰن بن عبداللہ نے بیان کیا ‘ ان سے ان کے والد نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ شریف بن شریف بن شریف بن شریف ‘ یوسف بن یعقوب بن اسحاق بن ابراہیم علیہ السلام تھے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 171630,
        "last_updated": null
    },
    {
        "urduURN": 4033410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3383,
        "hadithSanad": "مجھ سے عبیدبن اسماعیل نے بیان کیا ‘ کہا ہم سے ابواسامہ نے بیان کیا ‘ ان سے عبیداللہ نے بیان کیا ‘ انہیں سعید بن ابی سعید نے خبر دی اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم سے پوچھا گیا کہ سب سے زیادہ شریف آدمی کون ہے ؟ آپ نے فرمایا ‘ جو اللہ کا خوف زیادہ رکھتا ہو ‘ صحابہ نے عرض کیا کہ ہمارے سوال کا مقصد یہ نہیں ہے ۔ آپ نے فرمایا کہ پھر سب سے زیادہ شریف اللہ کے نبی یوسف بن نبی اللہ بن بنی اللہ بن خلیل اللہ ہیں ۔ صحابہ نے عرض کیا کہ ہمارے سوال کا مقصد یہ بھی نہیں ہے ۔ آپ نے فرمایا تم لوگ عرب کے خانوادوں کے بارے میں پوچھنا چاہتے ہو ۔ دیکھو ! لوگوں کی مثال کانوں کی سی ہے ( کسی کان میں سے اچھا مال نکلتا ہے کسی میں سے برا ) جو لوگ تم میں سے زمانہ جاہلیت میں شریف اور بہتر اخلاق کے تھے وہی اسلام کے بعد بھی اچھے اور شریف ہیں بشرطیکہ وہ دین کی سمجھ حاصل کریں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 171641,
        "last_updated": null
    },
    {
        "urduURN": 4033420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3384,
        "hadithSanad": "ہم سے بدل بن محبر نے بیان کیا ‘ کہا ہم کو شعبہ نے خبر دی ‘ ان سے سعد بن ابراہیم نے بیان کیا ‘ انہوں نے عروہ بن زبیر سے سنا اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ( مرض الموت میں ) ان سے فرمایا ‘ ابوبکر سے کہو کہ لوگوں کو نماز پڑھائیں ‘ عائشہ رضی اللہ عنہا نے عرض کیا کہ وہ بہت نرم دل ہیں ‘ آپ کی جگہ جب کھڑے ہوں گے تو ان پر رقت طاری ہو جائے گی ۔ حضور صلی اللہ علیہ وسلم نے انہیں دوبارہ یہی حکم دیا ۔ لیکن انہوں نے بھی دوبارہ یہی عذر بیان کیا ‘ شعبہ نے بیان کیا کہ حضور صلی اللہ علیہ وسلم نے تیسری یا چوتھی مرتبہ فرمایا کہ تم تو یوسف علیہ السلام کی ساتھ والیاں ہو ۔ ( ظاہر میں کچھ باطن میں کچھ ) ابوبکر رضی اللہ عنہ سے کہو نماز پڑھائیں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 171660,
        "last_updated": null
    },
    {
        "urduURN": 4033430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3385,
        "hadithSanad": "ہم سے ربیع بن یحییٰ بصریٰ نے بیان کیا ‘ کہا ہم سے زائدہ نے بیان کیا ‘ ان سے عبدالملک بن عمیر نے ‘ ان سے ابوبردہ بن ابی موسیٰ نے اور ان سے ان کے والد نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جب بیمار پڑے تو آپ نے فرمایا کہ ابوبکر سے کہو کہ لوگوں کو نماز پڑھائیں ۔ عائشہ رضی اللہ عنہا نے عرض کیا کہ ابوبکر رضی اللہ عنہ نہایت نرم دل انسان ہیں لیکن حضور صلی اللہ علیہ وسلم نے دوبارہ یہی حکم فرمایا اور انہوں نے بھی وہی عذر دہرایا ۔ آخر حضور صلی اللہ علیہ وسلم نے فرمایا کہ ان سے کہو نماز پڑھائیں ۔ تم تو یوسف کی سا تھ والیاں ہو ۔ ظاہر کچھ باطن کچھ ) چنانچہ ابوبکر رضی اللہ عنہ نے حضور صلی اللہ علیہ وسلم کی زندگی میں امامت کی اور حسین بن علی جعفی نے زائدہ سے رجل رقیق کے الفاظ نقل کئے کہ ابوبکر نرم دل آدمی ہیں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 171670,
        "last_updated": null
    },
    {
        "urduURN": 4033440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3386,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا‘انہوں نے کہا ہم کو شعیب نے خبر دی ‘ انہوں نے کہا ہم سے ابوالزناد نے بیان کیا ‘ ان سے اعرج نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے دعا فرمائی ‘ اے اللہ ! عیاش بن ابی ربیعہ کو نجات دے ‘ اے اللہ ! سلمہ بن ہشام کو نجات دے ‘ اے اللہ ! ولید بن ولید کو نجات دے ‘ اے اللہ تمام ضعیف اور کمزور مسلمانوں کو نجات دے ۔ اے اللہ ! قبیلہ مضر کو سخت گرفت میں پکڑ لے ۔ اے اللہ ! یوسف علیہ السلام کے زمانے کی سی قحط سالی ان ( ظالموں ) پر نازل فرما ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 171680,
        "last_updated": null
    },
    {
        "urduURN": 4033450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3387,
        "hadithSanad": "ہم سے عبداللہ بن محمد بن اسماء ابن اخی جویریہ نے بیان کیا ‘ انہوں نے کہا ہم سے جویریہ بن اسماء نے بیان کیا ‘ ان سے مالک نے بیان کیا ‘ ان سے زہری نے بیان کیا ‘ ان کو سعید بن مسیب اور ابوعبیدہ نے خبر دی اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ اللہ تعالیٰ لوط علیہ السلام پر رحم فرمائے کہ وہ زبردست رکن ( یعنی خداوند کریم ) کی پناہ لیتے تھے اور اگر میں اتنی مدت تک قید رہتا جتنی یوسف علیہ السلام رہے تھے اور پھر میرے پاس ( بادشاہ کا آدمی ) بلانے کے لئے آتا تو میں فوراً اس کے ساتھ چلا جاتا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 171690,
        "last_updated": null
    },
    {
        "urduURN": 4033460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3388,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ‘ کہا ہم کو محمد بن فضیل نے خبر دی ‘ کہا ہم سے حصین نے بیان کیا ‘ ان سے سفیان نے ‘ ان سے مسروق نے بیان کیا کہ",
        "hadithText": "میں نے عائشہ رضی اللہ عنہا کی والدہ ام رومان رضی اللہ عنہا سے عائشہ رضی اللہ عنہا کے بارے میں جو بہتان تراشا گیا تھا اس کے متعلق پوچھا تو انہوں نے کہا کہ عائشہ رضی اللہ عنہا کے ساتھ بیٹھی ہوئی تھی کہ ایک انصاریہ عورت ہمارے یہاں آئی اور کہا کہ اللہ فلاں ( مسطح بن اثاثہ ) کو تباہ کر دے اور وہ اسے تباہ کر بھی چکا انہوں نے بیان کیا کہ میں نے کہا آپ یہ کیا کہہ رہی ہیں انہوں نے بتایا کہ اسی نے تو یہ جھوٹ مشہور کیا ہے ۔ پھر انصاریہ عورت نے ( حضرت عائشہ رضی اللہ عنہا پر تہمت کا سارا ) واقعہ بیان کیا ‘ حضرت عائشہ رضی اللہ عنہا نے ( اپنی والدہ سے ) پوچھا کہ کون سا واقعہ ؟ تو ان کی والدہ نے انہیں واقعہ کی تفصیل بتائی ۔ عائشہ نے پوچھا کہ کیا یہ قصہ ابوبکر رضی اللہ عنہ اور رسول اللہ صلی اللہ علیہ وسلم کو بھی معلوم ہو گیا ہے ؟ ان کی والدہ نے بتایا کہ ہاں ۔ یہ سنتے ہی حضرت عائشہ رضی اللہ عنہا بیہوش ہو کر گر پڑیں اور جب ہوش آیا تو جاڑے کے ساتھ بخار چڑھا ہوا تھا ۔ پھر نبی کریم صلی اللہ علیہ وسلم تشریف لائے اور دریافت فرمایا کہ انہیں کیا ہوا ؟ میں نے کہا کہ ایک بات ان سے ایسی کہی گئی تھی اور اسی کے صدمے سے ان کو بخار آ گیا ہے ۔ پھر حضرت عائشہ رضی اللہ عنہا اٹھ کر بیٹھ گئیں اور کہا اللہ کی قسم ! اگر میں قسم کھاؤں جب بھی آپ لوگ میری بات نہیں مان سکتے اور اگر کوئی عذر بیان کروں تو اسے بھی تسلیم نہیں کر سکتے ۔ بس میری اور آپ لوگوں کی مثال یعقوب علیہ السلام اور ان کے بیٹوں کی سی ہے ( کہ انہوں نے اپنے بیٹوں کی من گھڑت کہانی سن کر فرمایا تھا کہ ) ” جو کچھ تم کہہ رہے ہو میں اس پر اللہ ہی کی مدد چاہتا ہوں ۔ “ اس کے بعد آنحضرت صلی اللہ علیہ وسلم واپس تشریف لے گئے اور اللہ تعالیٰ کو جو کچھ منظور تھا وہ نازل فرمایا ۔ جب آنحضرت صلی اللہ علیہ وسلم نے اس کی خبر عائشہ رضی اللہ عنہا کو دی تو انہوں نے کہا کہ اس کے لئے میں صرف اللہ کا شکر ادا کرتی ہوں کسی اور کا نہیں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 171700,
        "last_updated": null
    },
    {
        "urduURN": 4033470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3389,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ کہا ہم سے لیث نے بیان کیا ‘ ان سے عقیل نے ‘ ان سے ابن شہاب نے ‘ کہا کہ",
        "hadithText": "مجھے عروہ نے خبر دی کہ انہوں نے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا سے آیت کے متعلق پوچھاحتیٰ اذا استیئس الرسل وظنوا انھم قد کذبوا ( تشدید کے ساتھ ) ہے یا کذبوا ( بغیر تشدید کے ) یعنی یہاں تک کہ جب انبیاء ناامید ہو گئے اور انہیں خیال گزرنے لگا کہ انہیں جھٹلا دیا گیا تو اللہ کی مدد پہنچی تو انہوں نے کہا کہ ( یہ تشدید کے ساتھ ہے اور مطلب یہ ہے کہ ) ان کی قوم نے انہیں جھٹلایا تھا ۔ میں نے عرض کیا کہ پھر معنی کیسے بنیں گے ‘ پیغمبروں کو یقین تھا ہی کہ ان کی قوم انہیں جھٹلا رہی ہے ۔ پھر قرآن میں لفظ ظن گمان اور خیال کے معنی میں استعمال کیوں کیا گیا ؟ عائشہ رضی اللہ عنہا نے کہا اے چھوٹے سے عروہ ! بیشک ان کو تو یقین تھا میں نے کہا تو شاید اس آیت میں بغیر تشدید کے کذبوا ہو گا یعنی پیغمبر یہ سمجھے کہ اللہ نے جو ان کی مدد کا وعدہ کیا تھا وہ غلط تھا ۔ عائشہ رضی اللہ عنہا نے فرمایا معاذاللہ ! انبیاء اپنے رب کے ساتھ بھلا ایسا گمان کر سکتے ہیں ۔ عائشہ رضی اللہ عنہا نے کہا مراد یہ ہے کہ پیغمبروں کے تابعدار لوگ جو اپنے مالک پر ایمان لائے تھے اور پیغمبروں کی تصدیق کی تھی ان پر جب مدت تک خدا کی آزمائش رہی اور مدد آنے میں دیر ہوئی اور پیغمبر لوگ اپنی قوم کے جھٹلانے والوں سے ناامید ہو گئے ( سمجھے کہ اب وہ ایمان نہیں لائیں گے ) اور انہوں نے یہ گمان کیا کہ جو لوگ ان کے تابعدار بنے ہیں وہ بھی ان کو جھوٹا سمجھنے لگیں گے ‘ اس وقت اللہ کی مدد آن پہنچی ۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے کہا کہ استیاسوا ‘ افتعلوا کے وزن پر ہے جو یئستمنہ سے نکلا ہے ‘ ای من یوسف ( سورۃ یوسف کی آیت کا ایک جملہ ہے یعنی زلیخا یوسف علیہ السلام سے ناامید ہو گئی » لا تایئسوا من رّوح اللّٰہ « ( یوسف : 87 ) یعنی اللہ سے امید رکھو ناامید نہ ہو ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 171710,
        "last_updated": null
    },
    {
        "urduURN": 4033480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3390,
        "hadithSanad": "مجھے عبدہ بن عبداللہ نے خبر دی ‘ انہوں نے کہا ہم سے عبدالصمد نے بیان کیا ۔ ان سے عبدالرحمٰن نے بیان کیا ‘ ان سے ان کے والد عبداللہ بن دینار نے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ شریف بن شریف بن شریف بن شریف یوسف بن یعقوب بن اسحاق بن ابراہیم علیہم السلام ہیں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 171720,
        "last_updated": null
    },
    {
        "urduURN": 4033490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3391,
        "hadithSanad": "مجھ سے عبداللہ بن محمد جعفی نے بیان کیا ‘ کہا ہم سے عبدالرزاق نے بیان کیا ‘ کہا ہم کو معمر نے خبر دی ‘ انہیں ہمام نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ ایوب علیہ السلام ننگے غسل کر رہے تھے کہ سونے کی ٹڈیاں ان پر گرنے لگیں ۔ وہ ان کو اپنے کپڑے میں جمع کرنے لگے ۔ ان کے پروردگار نے ان کو پکارا کہ اے ایوب ! جو کچھ تم دیکھ رہے ہو ( سونے کی ٹڈیاں ) کیا میں نے تمہیں اس سے بےپروا نہیں کر دیا ہے ؟ انہوں نے عرض کیا کہ صحیح ہے ‘ اے رب العزت لیکن تیری برکت سے میں کس طرح بےپروا ہو سکتا ہوں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 171730,
        "last_updated": null
    },
    {
        "urduURN": 4033500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3392,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ‘ کہا ہم سے لیث بن سعد نے بیان کیا ‘ کہا کہ مجھ سے عقیل نے بیان کیا ‘‘ ان سے ابن شہاب نے ‘ انہوں نے عروہ بن زبیر سے سنا ‘ انہوں نے بیان کیا کہ",
        "hadithText": "حضرت عائشہ رضی اللہ عنہا نے کہا ‘ پھر نبی کریم صلی اللہ علیہ وسلم ( غار حراء سے ) ام المؤمنین حضرت خدیجہ رضی اللہ عنہا کے پاس لوٹ آئے تو آپ کا دل دھڑک رہا تھا ۔ حضرت خدیجہ رضی اللہ عنہا آپ کو ورقہ بن نوفل کے پاس لے گئیں ، وہ نصرانی ہو گئے تھے اور انجیل کو عربی میں پڑھتے تھے ۔ ورقہ نے پوچھا کہ آپ کیا دیکھتے ہیں ؟ آپ نے انہیں بتایا تو انہوں نے کہا کہ یہی ہیں وہ ” ناموس “ جنہیں اللہ تعالیٰ نے موسیٰ علیہ السلام کے پاس بھیجا تھا اور اگر میں تمہارے زمانے تک زندہ رہا تو میں تمہاری پوری مدد کروں گا ۔ ناموس محرم راز کو کہتے ہیں جو ایسے راز سے بھی آگاہ ہو جو آدمی دوسروں سے چھپائے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 171740,
        "last_updated": null
    },
    {
        "urduURN": 4033510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3393,
        "hadithSanad": "ہم سے ہدبہ بن خالد نے بیان کیا ‘ کہا ہم سے ہمام نے بیان کیا ‘ ان سے قتادہ نے بیان کیا ‘ ان سے انس بن مالک رضی اللہ عنہ نے اور ان سے حضرت مالک بن صعصعہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ان سے اس رات کے متعلق بیان کیا جس میں آپ کو معراج ہوا کہ جب آپ پانچویں آسمان پر تشریف لے گئے تو وہاں ہارون علیہ السلام سے ملے ۔ جبرائیل علیہ السلام نے بتایا کہ یہ ہارون علیہ السلام ہیں ‘ انہیں سلام کیجئے ۔ میں نے سلام کیا تو انہوں نے جواب دیتے ہوئے فرمایا ‘ خوش آمدید ‘ صالح بھائی اور صالح نبی ۔ اس حدیث کو قتادہ کے ساتھ ثابت بنانی اور عباد بن ابی علی نے بھی انس رضی اللہ عنہ سے ‘ انہوں نے آنحضرت صلی اللہ علیہ وسلم سے روایت کیا ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 171750,
        "last_updated": null
    },
    {
        "urduURN": 4033520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3394,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ‘ کہا ہم کو ہشام بن یوسف نے خبر دی ‘ کہا ہم کومعمر نے خبر دی ‘ انہیں زہری نے ‘ انہیں سعید بن مسیب نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے اس رات کی کیفیت بیان کی جس میں آپ کو معراج ہوا کہ میں نے موسیٰ علیہ السلام کو دیکھا کہ وہ ایک دبلے پتلے سیدھے بالوں والے آدمی ہیں ۔ ایسا معلوم ہوتا تھا کہ قبیلہ شنوہ میں سے ہوں اور میں نے عیسیٰ علیہ السلام کو بھی دیکھا ‘ وہ میانہ قد اور نہایت سرخ و سفید رنگ والے تھے ۔ ایسے تروتازہ اور پاک و صاف کہ معلوم ہوتا تھا کہ ابھی غسل خانہ سے نکلے ہیں اور میں ابرہیم علیہ السلام سے ان کی اولاد میں سب سے زیادہ مشابہ ہوں ۔ پھر دو برتن میرے سامنے لائے گئے ۔ ایک میں دودھ تھا اور دوسرے میں شراب تھی ۔ جبرائیل علیہ السلام نے کہا کہ دونوں چیزوں میں سے آپ کا جو جی چاہے پیجئے ‘ میں نے دودھ کا پیالہ اپنے ہاتھ میں لے لیا اور اسے پی گیا ۔ مجھ سے کہا گیا کہ آپ نے فطرت کو اختیار کیا ( دودھ آدمی کی پیدائشی غذا ہے ) اگر اس کے بجائے آپ نے شراب پی ہوتی تو آپ کی امت گمراہ ہو جاتی ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 171760,
        "last_updated": null
    },
    {
        "urduURN": 4033530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3395,
        "hadithSanad": "مجھ سے محمد بن بشار نے بیان کیا ‘ کہا ہم سے غندر نے بیان کیا ‘ ان سے شعبہ نے بیان کیا ‘ ان سے قتادہ نے بیان کیا ‘ ان سے ابوالعالیہ نے بیان کیا اور ان سے تمہارے نبی کے چچا زاد بھائی یعنی حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کسی شخص کو یوں نہ کہنا چاہئے کہ میں یونس بن متی سے بہتر ہوں ‘ حضور صلی اللہ علیہ وسلم نے ان کا نام ان کے والد کی طرف منسوب کر کے لیا ۔ \n<span class=urdu_sanad>اور حضور صلی اللہ علیہ وسلم نے شب معراج کا ذکر کرتے ہوئے فرمایا کہ</span> موسیٰ علیہ السلام گندم گوں اور دراز قد تھے ۔ ایسا معلوم ہوتا تھا جیسے قبیلہ شنوہ کے کوئی صاحب ہوں اور فرمایا کہ عیسیٰ علیہ السلام گھنگریالے بال والے اور میانہ قد کے تھے اور حضور صلی اللہ علیہ وسلم نے داروغہ جہنم مالک کا بھی ذکر فرمایا اور دجال کا بھی ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 171771,
        "last_updated": null
    },
    {
        "urduURN": 4033550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3397,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ کہا ہم سے ایوب سختیانی نے بیان کیا ‘ ان سے سعید بن جبیر کے صاحبزادے ( عبداللہ ) نے اپنے والد سے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم مدینہ تشریف لائے تو وہاں کے لوگ ایک دن یعنی عاشورا کے دن روزہ رکھتے تھے ۔ ان لوگوں ( یہودیوں ) نے بتایا کہ یہ بڑی عظمت والا دن ہے ‘ اسی دن اللہ تعالیٰ نے موسیٰ علیہ السلام کو نجات دی تھی اور آل فرعون کو غرق کیا تھا ۔ اس کے شکر میں موسیٰ علیہ السلام نے اس دن کا روزہ رکھا تھا ۔ حضور صلی اللہ علیہ وسلم نے فرمایا کہ میں موسیٰ علیہ السلام کا ان سے زیادہ قریب ہوں ۔ چنانچہ آپ نے خود بھی اس دن کا روزہ رکھنا شروع کیا اور صحابہ کو بھی اس کا حکم فرمایا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 171790,
        "last_updated": null
    },
    {
        "urduURN": 4033560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3398,
        "hadithSanad": "ہم سے محمد بن یوسف بیکندی نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے ‘ ان سے عمرو بن یحییٰ نے ‘ ان سے ان کے والد یحییٰ بن عمارہ نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ قیامت کے دن سب لوگ بیہوش ہو جائیں گے ‘ پھر سب سے پہلے میں ہوش میں آؤں گا اور دیکھوں گا کہ موسیٰ عرش کے پایوں میں سے ایک پایہ تھامے ہوئے ہیں ۔ اب مجھے یہ معلوم نہیں کہ وہ مجھ سے پہلے ہوش میں آ گئے ہوں گے یا ( بیہوش ہی نہیں کئے گئے ہوں گے بلکہ ) انہیں کوہ طور کی بے ہوشی کا بدلہ ملا ہو گا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 171800,
        "last_updated": null
    },
    {
        "urduURN": 4033570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3399,
        "hadithSanad": "مجھ سے عبداللہ بن محمد جعفی نے بیان کیا ‘ کہا ہم سے عبدالرزاق نے بیان کیا ‘ کہا ہم کو معمر نے خبر دی ‘ انہیں ہمام نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اگر بنی اسرائیل نہ ہوتے ( سلویٰ کا گوشت جمع کر کے نہ رکھتے ) تو گوشت کبھی نہ سڑتا ۔ اور اگر حوانہ ہوتیں ( یعنی حضرت آدم علیہ السلام سے دغا نہ کرتیں ) تو کوئی عورت اپنے شوہر کی خیانت کبھی نہ کرتی ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 171810,
        "last_updated": null
    },
    {
        "urduURN": 4033580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3400,
        "hadithSanad": "ہم سے عمر بن محمد نے بیان کیا ‘ کہا ہم سے یعقوب بن ابراہیم نے بیان کیا ‘ کہا کہ مجھ سے میرے والد نے بیان کیا ‘ ان سے صالح نے ‘ ان سے ابن شہاب نے ‘ انہیں عبیداللہ بن عبداللہ نے خبر دی اور انہیں حضرت ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "حر بن قیس فزاری رضی اللہ عنہ سے صاحب موسیٰ علیہ السلام کے بارے میں ان کا اختلاف ہوا ۔ پھر حضرت ابی بن کعب رضی اللہ عنہ وہاں سے گزرے تو عبداللہ بن عباس رضی اللہ عنہما نے انہیں بلایا اور کہا کہ میرا اپنے ان ساتھی سے صاحب موسیٰ کے بارے میں اختلاف ہو گیا ہے جن سے ملاقات کے لئے موسیٰ علیہ السلام نے راستہ پوچھا تھا ‘ کیا رسول اللہ صلی اللہ علیہ وسلم سے آپ نے ان کے بارے میں کچھ سنا ہے ؟ انہوں نے فرمایا کہ جی ہاں ‘ میں نے حضور صلی اللہ علیہ وسلم کو یہ فرماتے سنا تھا کہ موسیٰ علیہ السلام نبی اسرائیل کی ایک جماعت میں تشریف رکھتے تھے کہ ایک شخص نے ان سے پوچھا ‘ کیا آپ کسی ایسے شخص کو جانتے ہیں جو اس تمام زمین پر آپ سے زیادہ علم رکھنے والا ہو ؟ انہوں نے فرمایا کہ نہیں ۔ اس پر اللہ تعالیٰ نے موسیٰ علیہ السلام پر وحی نازل کی کہ کیوں نہیں ‘ ہمارا بندہ خضر ہے ۔ موسیٰ علیہ السلام نے ان تک پہنچنے کا راستہ پوچھا تو انہیں مچھلی کو اس کی نشانی کے طور پر بتایا گیا اور کہا گیا کہ جب مچھلی گم ہو جائے ( تو جہاں گم ہوئی ہو وہاں ) واپس آ جانا وہیں ان سے ملاقات ہو گی ۔ چنانچہ موسیٰ علیہ السلام دریا میں ( سفر کے دوران ) مچھلی کی برابر نگرانی کرتے رہے ۔ پھر ان سے ان کے رفیق سفر نے کہا کہ آپ نے خیال نہیں کیا جب ہم چٹان کے پاس ٹھہرے تو میں مچھلی کے متعلق آپ کو بتانا بھول گیا تھا اور مجھے شیطان نے اسے یاد رکھنے سے غافل رکھا ۔ موسیٰ علیہ السلام نے فرمایا کہ اسی کی تو ہمیں تلاش ہے چنانچہ یہ بزرگ اسی راستے سے پیچھے کی طرف لوٹے اور حضرت خضر علیہ السلام سے ملاقات ہوئی ان دونوں کے ہی وہ حالات ہیں جنہیں اللہ تعالیٰ کی کتاب میں بیان فرمایا ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 171820,
        "last_updated": null
    },
    {
        "urduURN": 4033590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3401,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ کہا ہم سے عمرو بن دینار نے بیان کیا ‘ کہا کہ مجھے سعید بن جبیر نے خبر دی ‘ انہوں نے کہا کہ میں نے ابن عباس رضی اللہ عنہما سے عرض کیا کہ",
        "hadithText": "نوف بکالی یہ کہتا ہے کہ موسیٰ ‘ صاحب خضر بنی اسرائیل کے موسیٰ نہیں ہیں بلکہ وہ دوسرے موسیٰ ہیں ۔ حضرت ابن عباس رضی اللہ عنہما نے کہا کہ دشمن خدا نے بالکل غلط بات کہی ہے ۔ حضرت ابی بن کعب رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہوئے ہم سے بیان کیا کہ موسیٰ علیہ السلام نبی اسرائیل کو کھڑے ہو کر خطاب فرما رہے تھے کہ ان سے پوچھا گیا کون سا شخص سب سے زیادہ علم والا ہے ‘ انہوں نے فرمایا کہ میں ۔ اس پر اللہ تعالیٰ نے ان پر عتاب فرمایا کیونکہ انہوں علم کی نسبت اللہ تعالیٰ کی طرف نہیں کی ۔ اللہ تعالیٰ نے ان سے فرمایا کہ کیوں نہیں میرا ایک بندہ ہے جہاں دو دریا آ کر ملتے ہیں وہاں رہتا ہے اور تم سے زیادہ علم والا ہے ۔ انہوں نے عرض کیا اے رب العالمین ! میں ان سے کس طرح مل سکوں گا ؟ سفیان نے ( اپنی روایت میں یہ الفاظ ) بیان کئے کہ ” اے رب ! ” وکیف لی بہ “ اللہ تعالیٰ نے فرمایا کہ ایک مچھلی پکڑ کر اسے اپنے تھیلے میں رکھ لینا ‘ جہاں وہ مچھلی گم ہو جائے بس میرا بندہ وہیں تم کو ملے گا ۔ بعض دفعہ راوی نے ( بجائے فھوثم کے ) فھوثمہ کہا ۔ چنانچہ موسیٰ علیہ السلام نے مچھلی لے لی اور اسے ایک تھیلے میں رکھ لیا ۔ پھر وہ اور ایک ان کے رفیق سفر یوشع بن نون روانہ ہوئے ‘ جب یہ چٹان پر پہنچے تو سر سے ٹیک لگالی ‘ موسیٰ علیہ السلام کو نیند آ گئی اور مچھلی تڑپ کر نکلی اور دریا کے اندر چلی گئی اور اس نے دریا میں اپنا راستہ بنا لیا ۔ اللہ تعالیٰ نے مچھلی سے پانی کے بہاؤ کو روک دیا اور وہ محراب کی طرح ہو گئی ‘ انہوں نے واضح کیا کہ یوں محراب کی طرح ۔ پھر یہ دونوں اس دن اور رات کے باقی حصے میں چلتے رہے ‘ جب دوسرا دن آیا تو موسیٰ علیہ السلام نے اپنے رفیق سفر سے فرمایا کہ اب ہمارا کھانا لاؤ کیونکہ ہم اپنے سفر میں بہت تھک گئے ہیں ۔ موسیٰ علیہ السلام نے اس وقت تک کوئی تھکان محسوس نہیں کی تھی جب تک وہ اس مقررہ جگہ سے آگے نہ بڑھ گئے جس کا اللہ تعالیٰ نے انہیں حکم دیا تھا ۔ ان کے رفیق نے کہا کہ دیکھئیے تو سہی جب چٹان پر اترے تھے تو میں مچھلی ( کے متعلق کہنا ) آپ سے بھول گیا اور مجھے اس کی یاد سے شیطان نے غافل رکھا اور اس مچھلی نے تو وہیں ( چٹان کے قریب ) دریا میں اپنا راستہ عجیب طور پر بنا لیا تھا ۔ مچھلی کو تو راستہ مل گیا اور یہ دونوں حیران تھے ۔ موسیٰ علیہ السلام نے فرمایا کہ یہی وہ جگہ تھی جس کی تلاش میں ہم نکلے ہیں ۔ چنانچہ یہ دونوں اسی راستے سے پیچھے کی طرف واپس ہوئے اور جب اس چٹان پر پہنچے تو وہاں ایک بزرگ اپنا سارا جسم ایک کپڑے میں لپیٹے ہوئے موجود تھے ۔ حضرت موسیٰ علیہ السلام نے انہیں سلام کیا اور انہوں نے جواب دیا پھر کہا کہ تمہارے خطے میں سلام کا رواج کہاں سے آ گیا ؟ موسیٰ علیہ اسلام نے فرمایا کہ میں موسیٰ ہوں ۔ انہوں نے پوچھا ‘ بنی اسرائیل کے موسیٰ ؟ فرمایا کہ جی ہاں ۔ میں آپ کی خدمت میں اس لئے حاضر ہوا ہوں کہ آپ مجھے وہ علم نافع سکھا دیں جو آپ کو سکھایا گیا ہے ۔ انہوں نے فرمایا اے موسیٰ ! میرے پاس اللہ کا دیا ہوا ایک علم ہے اللہ تعالیٰ نے مجھے وہ علم سکھایا ہے اور آپ اس کو نہیں جانتے ۔ اسی طرح آپ کے پاس اللہ کا دیا ہوا ایک علم ہے اللہ تعالیٰ نے آپ کو سکھایا ہے اور میں اسے نہیں جانتا ۔ موسیٰ علیہ السلام نے کہا کیا میں آپ کے ساتھ رہ سکتا ہوں انہوں نے کہا کہ آپ میرے ساتھ صبر نہیں کر سکیں گے اور واقعی آپ ان کاموں کے بارے میں صبر کر بھی کیسے سکتے ہیں جو آپ کے علم میں نہیں ہیں ۔ اللہ تعالیٰ کے ارشاد امراًتک آخر موسیٰ اور خضر علیہم السلام دریا کے کنارے کنارے چلے ۔ پھر ان کے قریب سے ایک کشتی گزری ۔ ان حضرات نے کہا کہ انہیں بھی کشتی والے کشتی پر سوار کر لیں ۔ کشتی والوں نے حضرت خضر علیہ السلام کو پہچان لیا اور کوئی مزدوری لئے بغیر ان کو سوار کر لیا ۔ جب یہ حضرات اس پر سوار ہو گئے تو ایک چڑیا آئی اور کشتی کے ایک کنارے بیٹھ کر اس نے پانی میں اپنی چونچ کو ایک یا دو مرتبہ ڈالا ۔ خضر علیہ السلام نے فرمایا اے موسیٰ ! میرے اور آپ کے علم کی وجہ سے اللہ کے علم میں اتنی بھی کمی نہیں ہوئی جتنی اس چڑیا کے دریا میں چونچ مارنے سے دریا کے پانی میں کمی ہوئی ہو گی ۔ اتنے میں خضر علیہ السلام نے کلہاڑی اٹھائی اور اس کشتی میں سے ایک تختہ نکال لیا ۔ موسیٰ علیہ السلام نے جو نظر اٹھائی تو وہ اپنی کلہاڑی سے تختہ نکال چکے تھے ۔ اس پر حضرت موسیٰ علیہ السلام بول پڑے کہ یہ آپ نے کیا کیا ؟ جن لوگوں نے ہمیں بغیر کسی اجرت کے سوار کر لیا انہیں کی کشتی پر آپ نے بری نظر ڈالی اور اسے چیر دیا کہ سارے کشتی والے ڈوب جائیں ۔ اس میں کوئی شبہ نہیں کہ آپ نے نہایت ناگوار کام کیا ۔ حضرت خضر علیہ السلام نے فرمایا ‘ کیا میں نے آپ سے پہلے ہی نہیں کہہ دیا تھا کہ آپ میرے ساتھ صبر نہیں کر سکتے ۔ موسیٰ علیہ السلام نے فرمایا کہ ( یہ بےصبری اپنے وعدہ کو بھول جانے کی وجہ سے ہوئی ‘ اس لئے ) آپ اس چیز کا مجھ سے مواخذہ نہ کریں جو میں بھول گیا تھا اور میرے معاملے میں تنگی نہ فرمائیں ۔ یہ پہلی بات حضرت موسیٰ علیہ السلام سے بھول کر ہوئی تھی پھر جب دریائی سفر ختم ہوا تو ان کا گزر ایک بچے کے پاس سے ہوا جو دوسرے بچوں کے ساتھ کھیل رہا تھا ۔ حضرت خضر علیہ السلام نے اس کا سر پکڑ کر اپنے ہاتھ سے ( ڈھر سے ) جدا کر دیا ۔ سفیان نے اپنے ہاتھ سے ( جدا کرنے کی کیفیت بتانے کے لئے ) اشارہ کیا جیسے وہ کوئی چیز توڑ رہے ہوں ۔ اس پر حضرت موسیٰ علیہ السلام نے فرمایا کہ آپ نے ایک جان کو ضائع کر دیا ۔ کسی دوسری جان کے بدلے میں بھی یہ نہیں تھا ۔ بلاشبہ آپ نے ایک برا کام کیا ۔ خضر علیہ السلام نے فرمایا ‘ کیا میں نے آپ سے پہلے ہی نہیں کہا تھا کہ آپ میرے ساتھ صبر نہیں کر سکتے ۔ حضرت موسیٰ علیہ السلام نے کہا اچھا اس کے بعد اگر میں نے آپ سے کوئی بات پوچھی تو پھر آپ مجھے ساتھ نہ لے چلئے گا ، بیشک آپ میرے بارے میں حد عذر کو پہنچ چکے ہیں ۔ پھر یہ دونوں آگے بڑھے اور جب ایک بستی میں پہنچے تو بستی والوں سے کہا کہ وہ انہیں اپنا مہمان بنا لیں ‘ لیکن انہوں نے انکار کیا ۔ پھر اس بستی میں انہیں ایک دیوار دکھائی دی جو بس گرنے ہی والی تھی ۔ خضر علیہ السلام نے اپنے ہاتھ سے یوں اشارہ کیا ۔ سفیان نے ( کیفیت بتانے کے لئے ) اس طرح اشارہ کیا جیسے وہ کوئی چیز اوپر کی طرف پھیر رہے ہوں ۔ میں نے سفیان سے ” مائلا “ کا لفظ صرف ایک مرتبہ سنا تھا ۔ حضرت موسیٰ علیہ السلام نے کہا کہ یہ لوگ تو ایسے تھے کہ ہم ان کے یہاں آئے اور انہوں نے ہماری میزبانی سے بھی انکار کیا ۔ پھر ان کی دیوار آپ نے ٹھیک کر دی ‘ اگر آپ چاہتے تو اس کی اجرت ان سے لے سکتے تھے ۔ حضرت خضر علیہ السلام نے فرمایا کہ بس یہاں سے میرے اور آپ کے درمیان جدائی ہو گئی جن باتوں پر آپ صبر نہیں کر سکتے ‘ میں ان کی تاویل و توجیہ اب تم پر واضح کر دوں گا ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ہماری تو خواہش یہ تھی کہ موسیٰ علیہ السلام صبر کرتے اور اللہ تعالیٰ تکوینی واقعات ہمارے لئے بیان کرتا ۔ سفیان نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ اللہ حضرت موسیٰ علیہ السلام پر رحم کرے ‘ اگر انہوں نے صبر کیا ہوتا تو ان کے ( مزید واقعات ) ہمیں معلوم ہوتے حضرت ابن عباس رضی اللہ عنہما نے ( جمہور کی قرآت ورائھمکے بجائے ) ” امامھم ملک یاخذ کل سفینۃ غضبا “ پڑھا ہے ۔ اور وہ بچہ ( جس کی حضرت خضر علیہ السلام نے جان لی تھی ) کافر تھا اور اس کے والدین مومن تھے ۔ پھر مجھ سے سفیان نے بیان کیا کہ میں نے یہ حدیث عمرو بن دینار سے دو مرتبہ سنی تھی اور انہیں سے ( سن کر ) یاد کی تھی ۔ سفیان نے کسی سے پوچھا تھا کہ کیا یہ حدیث آپ نے عمرو بن دینار سے سننے سے پہلے ہی کسی دوسرے شخص سے سن کر ( جس نے عمرو بن دینار سے سنی ہو ) یاد کی تھی ؟ یا ( اس کے بجائے یہ جملہ کہا ) ”تحفظتہ من انسان دو مرتبہ “ ( شک علی بن عبداللہ کو تھا ) تو سفیان نے کہا کہ دوسرے کسی شخص سے سن کر میں یاد کرتا ‘ کیا اس حدیث کو عمرو بن دینار سے میرے سوا کسی اور نے بھی روایت کیا ہے ؟ میں نے ان سے یہ حدیث دو یا تین مرتبہ سنی اور انہیں سے سن کر یاد کی ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 171830,
        "last_updated": null
    },
    {
        "urduURN": 4033600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3402,
        "hadithSanad": "ہم سے محمد بن سعید اصبہانی نے بیان کیا ‘ کہا ہم کو عبداللہ بن مبارک نے خبر دی ‘ انہیں معمر نے ‘ انہیں ہمام بن منبہ نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ خضر علیہ السلام کا یہ نام اس وجہ سے ہوا کہ وہ ایک سوکھی زمین ( جہاں سبزی کا نام بھی نہ تھا ) پر بیٹھے ۔ لیکن جوں ہی وہ وہاں سے اٹھے تو وہ جگہ سرسبز ہو کر لہلہانے لگی ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 171840,
        "last_updated": null
    },
    {
        "urduURN": 4033610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3403,
        "hadithSanad": "مجھ سے اسحاق بن نصرنے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ‘ ان سے معمر نے ‘ ان سے ہمام بن منبہ نے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ۔ انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ نبی اسرائیل کو حکم ہوا تھا کہ بیت المقدس میں سجدہ و رکوع کرتے ہوئے داخل ہوں اور یہ کہتے ہوئے کہ یا اللہ ! ہم کو بخش دے ۔ لیکن انہوں نے اس کو الٹا کیا اور اپنے چوتڑوں کے بل گھسٹتے ہوئے داخل ہوئے اور یہ کہتے ہوئے ” حبۃ فی شعرہ “ ( یعنی بالیوں میں دانے خوب ہوں ) داخل ہوئے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 171850,
        "last_updated": null
    },
    {
        "urduURN": 4033620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3404,
        "hadithSanad": "مجھ سے اسحاق بن ابراہیم نے بیان کیا ‘ کہا ہم سے روح بن عبادہ نے بیان کیا ‘ ان سے عوف بن ابو جمیلہ نے بیان کیا ‘ ان سے امام حسن بصری اور محمد بن سیرین اور خلاس بن عمرو نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ حضرت موسیٰ علیہ السلام بڑے ہی شرم والے اور بدن ڈھانپنے والے تھے ۔ ان کی حیاء کی وجہ سے ان کے بدن کو کوئی حصہ بھی نہیں دیکھا جا سکتا تھا ۔ بنی اسرائیل کے جو لوگ انہیں اذیت پہنچانے کے درپے تھے ‘ وہ کیوں باز رہ سکتے تھے ‘ ان لوگوں نے کہنا شروع کیا کہ اس درجہ بدن چھپانے کا اہتمام صرف اس لئے ہے کہ ان کے جسم میں عیب ہے یا کوڑھ ہے یا ان کے خصیتین بڑھے ہوئے ہیں یا پھر کوئی اور بیماری ہے ۔ ادھر اللہ تعالیٰ کو یہ منظور ہوا کہ موسیٰ علیہ السلام کی ان کی ہفوات سے پاکی دکھلائے ۔ ایک دن حضرت موسیٰ علیہ السلام اکیلے غسل کرنے کے لئے آئے ایک پتھر پر اپنے کپڑے ( اتار کر ) رکھ دیئے ۔ پھر غسل شروع کیا ۔ جب فارغ ہوئے تو کپڑے اٹھانے کے لئے بڑھے لیکن پتھر ان کے کپڑوں سمیت بھاگنے لگا ۔ حضرت موسیٰ علیہ السلام نے اپنا عصا اٹھایا اور پتھر کے پیچھے دوڑے ۔ یہ کہتے ہوئے کہ پتھر ! میرا کپڑا دیدے ۔ آخر نبی اسرائیل کی ایک جماعت تک پہنچ گئے اور ان سب نے آپ کو ننگا دیکھ لیا ‘ اللہ کی مخلوق میں سب سے بہتر حالت میں اور اس طرح اللہ تعالیٰ نے ان کی تہمت سے ان کی برات کر دی ۔ اب پتھر بھی رک گیا اور آپ نے کپڑا اٹھا کر پہنا ۔ پھر پتھر کو اپنے عصا سے مارنے لگے ۔ خدا کی قسم اس پتھر پر حضرت موسیٰ علیہ السلام کے مارنے کی وجہ سے تین یا چار یا پانچ جگہ نشان پڑ گئے تھے ۔ اللہ تعالیٰ کے اس فرمان ” تم ان کی طرح نہ ہو جانا جنہوں نے موسیٰ علیہ السلام کو اذیت دی تھی ‘ پھر ان کی تہمت سے اللہ تعالیٰ نے انہیں بری قرار دیا اور وہ اللہ کی بارگاہ میں بڑی شان والے اور عزت والے تھے ۔ “ میں اسی واقعہ کی طرف اشارہ ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 171860,
        "last_updated": null
    },
    {
        "urduURN": 4033630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3405,
        "hadithSanad": "ہم سے ابو الولید نے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ‘ ان سے اعمش نے بیان کیا کہ میں نے ابووائل سے سنا‘انہوں نے بیان کیا کہ میں نے حضرت عبداللہ بن مسعود رضی اللہ عنہما سے سنا ‘ وہ کہتے تھے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک مرتبہ مال تقسیم کیا ‘ ایک شخص نے کہا کہ یہ ایک ایسی تقسیم ہے جس میں اللہ کی رضا جوئی کا کوئی لحاظ نہیں کیا گیا ۔ میں نے آنحضور صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر آپ کو اس کی خبر دی ۔ آپ غصہ ہوئے اور میں نے آپ کے چہرہ مبارک پر غصے کے آثار دیکھے ۔ پھر فرمایا ‘ اللہ تعالیٰ حضرت موسیٰ علیہ السلام پر رحم فرمائے ‘ ان کو اس سے بھی زیادہ تکلیف دی گئی تھی مگر انہوں نے صبر کیا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 171870,
        "last_updated": null
    },
    {
        "urduURN": 4033640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3406,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ کہا ہم سے لیث نے بیان کیا ‘ ان سے یونس نے ‘ ان سے ابن شہاب نے ‘ ان سے ابوسلمہ بن عبدالرحمٰن نے اور ان سے حضرت جابر بن عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "( ایک مرتبہ ) ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( سفر میں ) پیلو کے پھل توڑنے لگے ۔ آپ نے فرمایا کہ جو سیاہ ہوں انہیں توڑو ‘ کیونکہ وہ زیادہ لذیذ ہوتا ہے ۔ صحابہ رضوان اللہ علیہم اجمعین نے عرض کیا ‘ کیا حضور نے کبھی بکریاں چرائی ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ کوئی نبی ایسا نہیں گزرا جس نے بکریاں نہ چرائی ہوں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 171880,
        "last_updated": null
    },
    {
        "urduURN": 4033650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3407,
        "hadithSanad": "ہم سے یحییٰ بن موسیٰ نے بیان کیا ‘ کہا ہم سے عبدالرزاق نے بیان کیا ‘ کہا ہم کو معمر نے خبر دی ‘ انہیں عبداللہ بن طاوس نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "اللہ تعالیٰ نے حضرت موسیٰ علیہ السلام کے پاس ملک الموت کو بھیجا ‘ جب ملک الموت حضرت موسیٰ علیہ السلام کے پاس آئے تو انہوں نے انہیں چانٹا مارا ( کیونکہ وہ انسان کی صورت میں آیا تھا ) ملک الموت ‘ اللہ رب العزت کی بارگاہ میں واپس ہوئے اور عرض کیا کہ تو نے اپنے ایک ایسے بندے کے پاس مجھے بھیجا جو موت کے لئے تیار نہیں ہے ۔ اللہ تعالیٰ نے فرمایا کہ دوبارہ ان کے پاس جاؤ اور کہو کہ اپنا ہا تھ کسی بیل کی پیٹھ پر رکھیں ، ان کے ہاتھ میں جتنے بال اس کے آ جائیں ان میں سے ہر بال کے بدلے ایک سال کی عمر انہیں دی جائے گی ( ملک الموت دوبارہ آئے اور اللہ تعالیٰ کا فیصلہ سنایا ) حضرت موسیٰ علیہ السلام بولے اے رب ! پھر اس کے بعد کیا ہو گا ؟ اللہ تعالیٰ نے فرمایا کہ پھر موت ہے ۔ حضرت موسیٰ علیہ السلام نے عرض کیا کہ پھر ابھی کیوں نہ آ جائے ۔ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ پھر حضرت موسیٰ علیہ السلام نے اللہ تعالیٰ سے دعا کی کہ بیت المقدس سے مجھے اتنا قریب کر دیا جائے کہ ( جہاں ان کی قبر ہو وہاں سے ) اگر کوئی پتھر پھینکے تو وہ بیت المقدس تک پہنچ سکے ۔ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اگر میں وہاں موجود ہوتا تو بیت المقدس میں ‘ میں تمہیں ان کی قبر دکھاتا جو راستے کے کنارے پر ہے ‘ ریت کے سرخ ٹیلے سے نیچے ۔ عبدالرزاق بن ہمام نے بیان کیا کہ ہمیں معمر نے خبر دی ‘ انہیں ہمام نے اور ان کو ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے اسی طرح بیان کیا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 171890,
        "last_updated": null
    },
    {
        "urduURN": 4033660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3408,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ‘ کہا ہم کو شعیب نے خبر دی ‘ ان سے زہری نے بیان کیا ‘ انہیں ابوسلمہ بن عبدالرحمان اور سعید بن مسیب نے خبر دی اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "مسلمانوں کی جماعت کے ایک آدمی اور یہودیوں میں سے ایک شخص کا جھگڑا ہوا ۔ مسلمان نے کہا کہ اس ذات کی قسم جس نے محمد صلی اللہ علیہ وسلم کو ساری دنیا میں برگذیدہ بنایا ‘ قسم کھاتے ہوئے انہوں نے یہ کہا ۔ اس پر یہودی نے کہا ‘ قسم ہے اس ذات کی جس نے موسیٰ علیہ السلام کو ساری دنیا میں برگزیدہ بنایا ۔ اس پر مسلمان نے اپنا ہاتھ اٹھا کر یہودی کو تھپڑ مار دیا ۔ وہ یہودی ‘ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں آیا اور اپنے اور مسلمان کے جھگڑے کی آپ کو خبر دی ۔ آپ نے اسی موقع پر فرمایا کہ مجھے حضرت موسیٰ علیہ السلام پر ترجیح نہ دیا کرو ۔ لوگ قیامت کے دن بیہوش کر دئے جائیں گے اور سب سے پہلے میں ہوش میں آؤں گا پھر دیکھوں گا کہ حضرت موسیٰ علیہ السلام عرش کا پایہ پکڑ ے ہوئے کھڑے ہیں ۔ اب مجھے معلوم نہیں کہ وہ بھی بیہوش ہونے والوں میں تھے اور مجھ سے پہلے ہی ہوش میں آ گئے یا انہیں اللہ تعالیٰ نے بیہوش ہونے والوں میں ہی نہیں رکھا تھا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 171900,
        "last_updated": null
    },
    {
        "urduURN": 4033670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3409,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ‘ کہا ہم سے ابراہیم بن سعد نے بیان کیا ‘ ان سے ابن شہاب نے ‘ ان سے حمید بن عبد الرحمان نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ حضرت موسیٰ اور حضرت آدم علیہم السلام نے آپس میں بحث کی ۔ حضرت موسیٰ علیہ السلام نے ان سے کہا کہ آپ آدم ہیں جنہیں ان کی لغزش نے جنت سے نکالا ۔ حضرت آدم علیہ السلام بولے اور آپ موسیٰ علیہ السلام ہیں کہ جنہیں اللہ تعالیٰ نے اپنی رسالت اور اپنے کلام سے نوازا ‘ پھر بھی آپ مجھے ایک ایسے معاملے پر ملامت کرتے ہیں جو اللہ تعالیٰ نے میری پیدائش سے بھی پہلے مقدر کر دیا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ چنانچہ حضرت آدم علیہ السلام حضرت موسیٰ علیہ السلام پر غالب آ گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے یہ جملہ دو مرتبہ فرمایا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 171910,
        "last_updated": null
    },
    {
        "urduURN": 4033680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3410,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ‘ کہا ہم سے حصین بن نمیر نے بیان کیا ‘ ان سے حصین بن عبدالرحمٰن نے ‘ ان سے سعید بن جبیر نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ایک دن نبی کریم صلی اللہ علیہ وسلم ہمارے پاس تشریف لائے اور فرمایا کہ میرے سامنے تمام امتیں لائی گئیں اور میں نے دیکھا کہ ایک بہت بڑی جماعت آسمان کے کناروں پر چھائی ہوئی ہے ۔ پھر بتایا گیا کہ یہ اپنی قوم کے ساتھ حضرت موسیٰ علیہ السلام ہیں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 171920,
        "last_updated": null
    },
    {
        "urduURN": 4033690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3411,
        "hadithSanad": "ہم سے یحییٰ بن جعفر نے بیان کیا ‘ انہوں نے کہا ہم سے وکیع نے بیان کیا ‘ ان سے شعبہ نے بیان کیا ‘ ان سے عمرو بن مرہ نے ‘ ان سے مرہ ہمدانی نے اور ان سے حضرت ابوموسیٰ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا مردوں میں تو بہت سے کامل لوگ اٹھے لیکن عورتوں میں فرعون کی بیوی آسیہ اور مریم بنت عمران علیہما السلام کے سوا اور کوئی کامل نہیں پیدا ہوئی ‘ ہاں عورتوں پر حضرت عائشہ رضی اللہ عنہا کی فضیلت ایسی ہے جیسے تمام کھانوں پر ثریدکی فضیلت ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 171930,
        "last_updated": null
    },
    {
        "urduURN": 4033700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3412,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ‘ کہا ہم سے یحییٰ نے بیان کیا ‘ ان سے سفیان بن عیینہ نے بیان کیا ‘ کہا کہ مجھ سے اعمش نے بیان کیا ( دوسری سند ) ہم سے ابونعیم نے بیان کیا ‘ کہا ہم سے سفیان نے بیان کیا ‘ ان سے اعمش نے ‘ ان سے ابووائل نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کوئی شخص میرے متعلق یہ نہ کہے کہ میں حضرت یونس علیہ السلام سے بہتر ہوں ۔ مسدد نے یونس بن متی علیہ السلام کے لفظ بڑھا کر روایت کیا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 171940,
        "last_updated": null
    },
    {
        "urduURN": 4033710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3413,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ‘ ان سے قتادہ نے ‘ ان سے ابو العالیہ نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے کہا",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کسی شخص کے لئے مناسب نہیں کہ مجھے یونس بن متی سے بہتر قرار دے ۔ آپ نے ان کے والد کی طرف منسوب کر کے ان کا نام لیا تھا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 171950,
        "last_updated": null
    },
    {
        "urduURN": 4033720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3414,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ کہا ہم سے لیث بن سعد نے ‘ ان سے عبدا لعزیز بن سلمہ نے ‘ ان سے عبداللہ بن فضیل نے ‘ ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک مرتبہ لوگوں کو ایک یہودی اپنا سامان دکھا رہا تھا لیکن اسے اس کی جو قیمت لگائی گئی اس پر وہ راضی نہ تھا ۔ اس لئے کہنے لگا کہ ہرگز نہیں ، اس ذات کی قسم جس نے موسیٰ کو تمام انسانوں میں برگزیدہ قرار دیا ۔ یہ لفظ ایک انصاری صحابی نے سن لئے اور کھڑے ہو کر انہوں نے ایک تھپڑ اس کے منہ پر مارا اور کہا کہ نبی کریم صلی اللہ علیہ وسلم ابھی ہم میں موجود ہیں اور تو اس طرح قسم کھاتا ہے کہ اس ذات کی قسم جس نے حضرت موسیٰ علیہ السلام کو تمام انسانوں میں برگزیدہ قرار دیا ۔ اس پر وہ یہودی آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور کہا ‘ اے ابوالقاسم ! میرا مسلمانوں کے ساتھ امن اور صلح کا عہد و پیمان ہے ۔ پھر فلاں شخص کا کیا حال ہو گا جس نے میرے منہ پر چانٹا مارا ہے ‘ آنحضرت صلی اللہ علیہ وسلم نے اس صحابی سے دریافت فرمایا کہ تم نے اس کے منہ پر کیوں چانٹا مارا ؟ انہوں نے وجہ بیان کی تو آپ غصے ہو گئے اس قدر کہ غصے کے آثار چہرہ مبارک پر نمایاں ہو گئے ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ کے انبیاء میں آپس میں ایک کو دوسرے پر فضیلت نہ دیا کرو ، جب صور پھونکا جائے گا تو آسمان و زمین کی تمام مخلوق پر بے ہوشی طاری ہو جائے گی ‘ سو ان کے جنہیں اللہ تعالیٰ چاہے گا ۔ پھر دوسری مرتبہ صور پھونکا جائے گا اور سب سے پہلے مجھے اٹھایا جائے گا ‘ لیکن میں دیکھوں گا کہ موسیٰ علیہ السلام عرش کو پکڑے ہوئے کھڑے ہوں گے ‘ اب مجھے معلوم نہیں کہ یہ انہیں طور کی بے ہوشی کا بدلا دیا گیا ہو گا یا مجھ سے بھی پہلے ان کی بے ہوشی ختم کر دی گئی ہو گی ۔ \nاور میں تو یہ بھی نہیں کہہ سکتا کہ کوئی شخص حضرت یونس بن متی سے بہتر ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 171960,
        "last_updated": null
    },
    {
        "urduURN": 4033740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3416,
        "hadithSanad": "ہم سے ابو الولید نے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ‘ ان سے سعد بن ابراہیم نے ‘ انہوں نے حمید بن عبدالرحمٰن سے سنا اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ کسی شخص کے لئے یہ کہنا لائق نہیں کہ میں حضرت یونس بن متی سے افضل ہوں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 171970,
        "last_updated": null
    },
    {
        "urduURN": 4033750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3417,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ‘ کہا ہم سے عبدالرزاق نے بیان کیا ‘ انہیں معمر نے خبر دی ‘ انہیں ہمام نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ حضرت داؤد علیہ السلام کے لئے قرآن ( یعنی زبور ) کی قرآت بہت آسان کر دی گئی تھی ۔ چنانچہ وہ اپنی سواری پر زین کسنے کا حکم دیتے اور زین کسی جانے سے پہلے ہی پوری زبور پڑھ لیتے تھے اور آپ صرف اپنے ہاتھوں کی کمائی کھاتے تھے ۔ اس کی روایت موسیٰ بن عقبہ نے کی ‘ ان سے صفوان نے ‘ ان سے عطاء بن یسار نے ‘ ان سے حضرت ابوہریرہ رضی اللہ عنہ نے ، نبی کریم صلی اللہ علیہ وسلم سے روایت کیا ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 171981,
        "last_updated": null
    },
    {
        "urduURN": 4033760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3418,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ کہا ہم سے لیث بن سعد نے بیان کیا ‘ ان سے عقیل نے ‘ ان سے ابن شہاب نے ‘ انہیں سعید بن مسیب اور ابوسلمہ بن عبدالرحمٰن نے خبر دی اور ان سے حضرت عبداللہ بن عمرو نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کو خبر ملی کہ میں نے کہا ہے کہ اللہ کی قسم ‘ جب تک میں زندہ رہوں گا ‘ دن میں روزے رکھوں گا اور رات بھر عبادت کیا کروں گا ۔ رسول اللہ صلی اللہ علیہ وسلم نے ان سے پوچھا کہ کیا تمہیں نے یہ کہا ہے کہ اللہ کی قسم جب تک زندہ رہوں گا دن بھر روزے رکھوں گا اور رات بھر عبادت کروں گا ؟ میں نے عرض کیا جی ہاں میں نے یہ جملہ کہا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم اسے نبھا نہیں سکو گے ‘ اس لئے روزہ بھی رکھا کرو اور بغیر روزے کے بھی رہا کرو اور رات میں عبادت بھی کیا کرو اور سویا بھی کرو ۔ ہر مہینے میں تین دن روزہ رکھا کرو ‘ کیونکہ ہر نیکی کا بدلہ دس گنا ملتا ہے اس طرح روزہ کا یہ طریقہ بھی ( ثواب کے اعتبار سے ) زندگی بھر کے روزے جیسا ہو جائے گا ۔ میں نے کہا کہ میں اس سے افضل طریقہ کی طاقت رکھتا ہوں ‘ اے اللہ کے رسول صلی اللہ علیہ وسلم ! آپ نے اس پر فرمایا کہ پھر ایک دن روزہ رکھا کرو اور دو دن بغیر روزے کے رہا کرو ۔ انہوں نے بیان کیا کہ میں نے عرض کیا کہ میں اس سے بھی افضل طریقے کی طاقت رکھتا ہوں آپ نے فرمایا کہ پھر ایک دن روزہ رکھا کرو اور ایک دن بغیر روزہ کے رہا کرو ‘ حضرت داؤد علیہ السلام کے روزے کا طریقہ بھی یہی تھا اور یہی سب سے افضل طریقہ ہے ۔ میں نے عرض کیا ‘ یا رسول اللہ ! میں اس سے بھی افضل طریقے کی طاقت رکھتا ہوں ۔ آپ نے فرمایا کہ اس سے افضل اور کوئی طریقہ نہیں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 172000,
        "last_updated": null
    },
    {
        "urduURN": 4033770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3419,
        "hadithSanad": "ہم سے خلاد بن یحییٰ نے بیان کیا ‘ کہا ہم سے مسعر نے بیان کیا ‘ کہا ہم سے حبیب بن ابی ثابت نے بیان کیا ‘ ان سے ابو العباس نے اور ان سے حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے دریافت فرمایا ‘ کیا میری یہ خبر صحیح ہے کہ تم رات بھر عبادت کرتے ہوں اور دن بھر ( روزانہ ) روزہ رکھتے ہو ؟ میں نے عرض کیا کہ جی ہاں ۔ آپ نے فرمایا لیکن تم اسی طرح کرتے رہے تو تمہاری آنکھیں کمزور ہو جائیں گی اور تمہارا جی اکتا جائے گا ۔ ہر مہینے میں تین روزے رکھا کرو کہ یہی ( ثواب کے اعتبار سے ) زندگی بھر کا روزہ ہے ‘ یا ( آپ صلی اللہ علیہ وسلم نے فرمایا کہ ) زندگی بھر کے روزے کی طرح ہے ۔ میں نے عرض کیا کہ میں اپنے میں محسوس کرتا ہوں ‘ مسعر نے بیان کیا کہ آپ کی مراد قوت سے تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر حضرت داؤد علیہ السلام کے روزے کی طرح روزے رکھا کرو ۔ وہ ایک دن روزے رکھا کرتے اور ایک دن بغیر روزے کے رہا کرتے تھے اور دشمن سے مقابلہ کرتے تو میدان سے بھاگا نہیں کرتے تھے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 172010,
        "last_updated": null
    },
    {
        "urduURN": 4033780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3420,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے ‘ ان سے عمرو بن دینار نے ‘ ان سے عمرو بن اوس ثقفی نے ‘ انہوں نے عبداللہ بن عمرو رضی اللہ عنہما سے سنا ۔ انہوں نے بیان کیا کہ",
        "hadithText": "مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا ‘ اللہ تعالیٰ کے نزدیک روزے کا سب سے پسندیدہ طریقہ داؤد علیہ السلام کا طریقہ تھا ۔ آپ ایک دن روزہ رکھتے اور ایک دن بغیر روزے کے رہتے تھے ۔ اسی طرح اللہ تعالیٰ کے نزدیک نماز کا سب سے زیادہ پسندیدہ طریقہ حضرت داؤد علیہ السلام کی نماز کا طریقہ تھا ‘ آپ آدھی رات تک سوتے اور ایک تہائی حصے میں عبادت کیا کرتے تھے ‘ پھر بقیہ چھٹے حصے میں بھی سوتے تھے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 172020,
        "last_updated": null
    },
    {
        "urduURN": 4033790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3421,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم سے سہل بن یوسف نے بیان کیا ، کہا میں نے عوام سے سنا ، ان سے مجاہد نے بیان کیا کہ",
        "hadithText": "میں نے حضرت عباس رضی اللہ سے پوچھا ، کیا میں سورۃ ص میں سجدہ کیا کروں ؟ تو انہوں نے آیت ” » ومن ذریتہ داود وسلیمان « “ تلاوت کی ” » فبھداھم اقتدہ « “ تک نیز انہوں نے کہا کہ تمہارے نبی کریم صلی اللہ علیہ وسلم ان لوگوں میں سے تھے جنہیں انبیاء علیہم السلام کی اقتداء کا حکم تھا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 172030,
        "last_updated": null
    },
    {
        "urduURN": 4033800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3422,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے وہب نے بیان کیا ، ان سے ایوب نے بیان کیا ، ان سے عکرمہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "سورۃ ص کا سجدہ ضروری نہیں ، لیکن میں نے نبی کریم صلی اللہ علیہ وسلم کو اس سورۃ میں سجدہ کرتے دیکھا ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 172040,
        "last_updated": null
    },
    {
        "urduURN": 4033810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3423,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، انہوں نے کہا ہم سے محمد بن جعفر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے محمد بن زیاد نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، ایک سرکش جن کل رات میرے سامنے آ گیا تاکہ میری نماز خراب کر دے لیکن اللہ تعالیٰ نے مجھے اس پر قدرت دے دی اور میں نے اسے پکڑ لیا ۔ پھر میں نے چاہا کہ اسے مسجد کے کسی ستون سے باندھ دوں کہ تم سب لوگ بھی دیکھ سکو ۔ لیکن مجھے اپنے بھائی سلیمان علیہ السلام کی دعا یاد آ گئی کہ ” یا اللہ ! مجھے ایسی سلطنت دے جو میرے سوا کسی کو میسر نہ ہو ، ، اس لئے میں نے اسے نامراد واپس کر دیا ۔ عفریت سرکش کے معنی میں ہے ، خواہ انسانوں میں سے ہو یا جنوں میں سے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 172050,
        "last_updated": null
    },
    {
        "urduURN": 4033820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3424,
        "hadithSanad": "ہم سے خالد بن مخلد نے بیان کیا ، کہا ہم سے مغیرہ بن عبدالرحمان نے بیان کیا ، ان سے ابوالزناد نے ، ان سے اعرج نے ، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، سلیمان بن داؤد علیہما السّلام نے کہا کہ",
        "hadithText": "آج رات میں اپنی ستر بیویوں کے پاس جاؤں گا اور ہر بیوی ایک شہسوار جنے گی جو اللہ کے راستے میں جہاد کرے گا ۔ ان کے ساتھی نے کہا انشاءاللہ ، لیکن انہوں نے نہیں کہا ۔ چنانچہ کسی بیوی کے یہاں بھی بچہ پیدا نہیں ہوا ، صرف ایک کے یہاں ہوا اور اس کی بھی ایک جانب بیکار تھی ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر سلیمان علیہ السلام انشاءاللہ کہہ لیتے ( تو سب کے یہاں بچے پیدا ہوتے ) اور اللہ کے راستے میں جہاد کرتے ۔ شعیب اور ابن ابی الزناد نے بجائے ستر کے ) نوے کہا ہے اور یہی بیان زیادہ صحیح ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 172060,
        "last_updated": null
    },
    {
        "urduURN": 4033830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3425,
        "hadithSanad": "مجھ سے عمر بن حفص نے بیان کیا ، کہا ہم سے میرے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا ہم سے ابراہیم تیمی نے بیان کیا ، ان سے ان کے والد نے اور ان سے حضرت ابوذررضی اللہ عنہ بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا ، یا رسول اللہ ! سب سے پہلے کون سی مسجد بنائی گئی تھی ؟ فرمایا کہ مسجدالحرام ! میں نے سوال کیا ، اس کے بعد کون سی ؟ فرمایا کہ مسجدالاقصیٰ ۔ میں نے سوال کیا اور ان دونوں کی تعمیر کا درمیانی فاصلہ کتنا تھا ؟ فرمایا کہ چالیس سال ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جس جگہ بھی نماز کا وقت ہو جائے فوراً نماز پڑھ لو ۔ تمہارے لئے تمام روئے زمین مسجد ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 172070,
        "last_updated": null
    },
    {
        "urduURN": 4033840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3426,
        "hadithSanad": "ہم سے ابواالیمان نے بیان کیا ، کہا ہم کوشعیب نے خبر دی ، کہا ہم سے ابوالزناد نے بیان کیا ، ان سے عبدالرحمان نے بیان کیا ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا کہ",
        "hadithText": "میری اور تمام انسانوں کی مثال ایک ایسے شخص کی سی ہے جس نے آگ روشن کی ہو ۔ پھر پروانے اور کیڑے مکوڑے اس میں گرنے لگے ہوں ۔ \n<span class=urdu_sanad>اور آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ</span> دو عورتیں تھیں اور دونوں کے ساتھ دونوں کے بچے تھے ۔ اتنے میں ایک بھیڑیا آیا اور ایک عورت کے بچے کو اٹھا لے گیا ۔ ان دونوں میں سے ایک عورت نے کہا بھیڑیا تمہارے بیٹے کو لے گیا ہے اور دوسری نے کہا کہ تمہارے بیٹے کو لے گیا ہے ۔ دونوں داؤد علیہ السلام کے یہاں اپنا مقدمہ لے گئیں ۔ آپ نے بڑی عورت کے حق میں فیصلہ کر دیا ۔ اس کے بعد وہ دونوں حضرت سلیمان بن داؤد علیہ السلام کے یہاں آئیں اور انہیں اس جھگڑے کی خبر دی ۔ انہوں نے فرمایا کہ اچھا چھری لاؤ ۔ اس بچے کے دو ٹکڑے کر کے دونوں کے درمیان بانٹ دوں ۔ چھوٹی عورت نے یہ سن کر کہا ، اللہ آپ پر رحم فرمائے ایسا نہ کیجئے ، میں نے مان لیا کہ اسی بڑی کا لڑکا ہے ۔ اس پر سلیمان علیہ السلام نے اس چھوٹی کے حق میں فیصلہ کیا ۔ حضرت ابوہریرہ رضی اللہ عنہ نے کہا کہ میں نے سکین کا لفظ اسی دن سنا ، ورنہ ہم ہمیشہ ( چھری کے لئے ) مدیہ کا لفظ بولا کرتے تھے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 172081,
        "last_updated": null
    },
    {
        "urduURN": 4033860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3428,
        "hadithSanad": "ہم سے ابو الولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے اعمش نے ، ان سے ابراہیم نے ، ان سے علقمہ نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "جب آیت ” جو لوگ ایمان لائے اور اپنے ایمان میں ظلم کی ملاوٹ نہیں کی “ نازل ہوئی تو نبی کریم صلی اللہ علیہ وسلم کے صحابہ نے عرض کیا ” ہم میں ایسا کون ہو گا جس نے اپنے ایمان میں ظلم نہیں کیا ہو گا “ ۔ اس پر یہ آیت نازل ہوئی ” اللہ کے ساتھ کسی کو شریک نہ ٹھہرا ۔ بیشک شرک ہی ظلم عظیم ہے “ ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 172100,
        "last_updated": null
    },
    {
        "urduURN": 4033870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3429,
        "hadithSanad": "مجھ سے اسحاق بن راہویہ نے بیان کیا ، کہا ہم کو عیسیٰ بن یونس نے خبر دی ، کہا ہم سے اعمش نے بیان کیا ، ان سے ابراہیم نخعی نے ، ان سے علقمہ نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "جب آیت ” جو لوگ ایمان لائے اور اپنے ایمان کے ساتھ ظلم کی ملاوٹ نہیں کی ، ، نازل ہوئی تو مسلمانوں پر بڑا شاق گزرا اور انہوں نے عرض کیا ہم میں کون ایسا ہو سکتا ہے جس نے اپنے ایمان کے ساتھ ظلم کی ملاوٹ نہ کی ہو گی ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس کا یہ مطلب نہیں ، ظلم سے مراد آیت میں شرک ہے ۔ کیا تم نے نہیں سنا کہ حضرت لقمان علیہ السلام نے اپنے بیٹے سے کہا تھا اسے نصیحت کرتے ہوئے کہ ، ، اے بیٹے ! اللہ تعالیٰ کے ساتھ کسی کو شریک نہ ٹھہرا ، بیشک شرک بڑا ہی ظلم ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 172110,
        "last_updated": null
    },
    {
        "urduURN": 4033880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3430,
        "hadithSanad": "ہم سے ہدبہ بن خالد نے بیان کیا ، انہوں نے کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، انہوں نے کہا ہم سے قتادہ نے بیان کیا ، ان سے انس بن مالک رضی اللہ عنہ نے اور ان سے مالک بن صعصعہ رضی اللہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے شب معراج کے متعلق بیان فرمایا کہ پھر آپ اوپر چڑھے اور دوسرے آسمان پر تشریف لے گئے ۔ پھر دروازہ کھولنے کے لئے کہا ۔ پوچھا گیا ، کون ہیں ؟ کہا کہ جبرائیل علیہ السلام ۔ پوچھا گیا ، آپ کے ساتھ کون ہیں ؟ کہا کہ محمد صلی اللہ علیہ وسلم ۔ پوچھا گیا ، کیا انہیں لانے کے لیے بھیجا ، کہا کہ جی ہاں ۔ پھر جب میں وہاں پہنچا تو عیسیٰ اور یحییٰ علیہماالسلام وہاں موجود تھے ۔ یہ دونوں نبی آپس میں خالہ زاد بھائی ہیں ۔ جبرائیل علیہ السلام نے بتایا کہ یہ یحییٰ اور عیسیٰ علیہما السلام ہیں ۔ انہیں سلام کیجئے ۔ میں نے سلام کیا ، دونوں نے جواب دیا اور کہا خوش آمدید نیک بھائی اور نیک نبی ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 172120,
        "last_updated": null
    },
    {
        "urduURN": 4033890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3431,
        "hadithSanad": "ہم سے ابو لیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، کہا انہوں نے کہا کہ مجھ سے سعید بن مسیب نے بیان کیا ، کہا کہ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا کہ ہر ایک بنی آدم جب پیدا ہوتا ہے تو پیدائش کے وقت شیطان اسے چھوتا ہے اور بچہ شیطان کے چھونے سے زور سے چیختا ہے ۔ سوائے مریم اور ان کے بیٹے عیسیٰ علیہما السلام کے ۔ پھر ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ ( اس کی وجہ مریم علیہما السلام کی والدہ کی دعا ہے کہ اے اللہ ! ) میں اسے ( مریم کو ) اور اس کی اولاد کو شیطان رجیم سے تیری پناہ میں دیتی ہوں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 172130,
        "last_updated": null
    },
    {
        "urduURN": 4033900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3432,
        "hadithSanad": "مجھ سے احمد بن ابی رجاء نے بیان کیا ، کہا ہم سے نضر نے بیان کیا ، ان سے ہشام ، کہا کہ مجھے میرے والد نے خبر دی ، کہا کہ میں نے عبداللہ بن جعفر سے سنا ، کہا کہ میں نے حضرت علی رضی اللہ عنہ سے سنا ، آپ نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم فرما رہے تھے کہ مریم بنت عمران ( اپنے زمانہ میں ) سب سے بہترین خاتون تھیں اور اس امت کی سب سے بہترین خاتون حضرت خدیجہ ہیں ( رضی اللہ عنہا ) ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 172140,
        "last_updated": null
    },
    {
        "urduURN": 4033910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3433,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انھوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے عمرو بن مرہ نے ، انہوں نے کہا ہم کہ میں نے مرہ ہمدانی سے سنا ۔ وہ حضرت ابوموسیٰ اشعری رضی اللہ عنہ سے بیان کرتے تھے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا عورتوں پر عائشہ کی فضیلت ایسے ہے جیسے تمام کھانوں پر ثرید کی ۔ مردوں میں سے تو بہت سے کامل ہو گزرے ہیں لیکن عورتوں میں مریم بنت عمران اور فرعون کی بیوی آسیہ کے سوا اور کوئی کامل پیدا نہیں ہوئی ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 172150,
        "last_updated": null
    },
    {
        "urduURN": 4033920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3434,
        "hadithSanad": "اور ابن وہب نے بیان کیا کہ مجھے یونس نے خبر دی ، ان سے ابن شہاب نے بیان کیا ، کہا کہ مجھ سے سعید بن مسیب نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے رسول کریم صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا کہ اونٹ سوار ہونے والیوں ( عربی خواتین ) میں سب سے بہترین قریشی خواتین ہیں ۔ اپنے بچے پر سب سے زیادہ محبت و شفقت کرنے والی اور اپنے شوہر کے مال و اسباب کی سب سے بہتر نگراں و محافظ ۔ حضرت ابوہریرہ رضی اللہ عنہ یہ حدیث بیان کرنے کے بعد کہتے تھے کہ مریم بنت عمران اونٹ پر کبھی سوار نہیں ہوئی تھیں ۔ یونس کے ساتھ اس حدیث کو زہری کے بھتیجے اور اسحاق کلبی نے بھی زہری سے روایت کیا ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 172160,
        "last_updated": null
    },
    {
        "urduURN": 4033930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3435,
        "hadithSanad": "ہم سے صدقہ بن فضل نے بیان کیا ، کہا ہم سے ولید نے بیان کیا ، ان سے اوزاعی نے بیان کیا ، کہا کہ مجھ سے عمیر بن ہانی نے بیان کیا ، کہا کہ مجھ سے جنادہ بن ابی امیہ نے بیان کیا اور ان سے عبادہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جس نے گواہی دی کہ اللہ کے سوا کوئی معبود نہیں ، وہ وحدہ لا شریک ہے اور یہ کہ محمد صلی اللہ علیہ وسلم اس کے بندے اور رسول ہیں اور یہ کہ عیسیٰ علیہ السلام اس کے بندے اور رسول ہیں اور اس کا کلمہ ہیں ، جسے پہنچا دیا تھا اللہ نے مریم تک اور ایک روح ہیں اس کی طرف سے اور یہ کہ جنت حق ہے اور دوزخ حق ہے تو اس نے جو بھی عمل کیا ہو گا ( آخر ) اللہ تعالیٰ اسے جنت میں داخل کرے گا ۔ ولید نے بیان کیا ، کہ مجھ سے ابن جابر نے بیان کیا ، ان سے عمیر نے اور جنادہ نے اور اپنی روایت میں یہ زیادہ کیا ( ایسا شخص ) جنت کے آٹھ دروازوں میں سے جس سے چاہے ( داخل ہو گا ) ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 172170,
        "last_updated": null
    },
    {
        "urduURN": 4033940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3436,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے جریربن حازم نے بیان کیا ، ان سے محمد بن سرین نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا گود میں تین بچوں کے سوا اور کسی نے بات نہیں کی ۔ اول عیسیٰ علیہ السلام ( دوسرے کا واقعہ یہ ہے کہ ) بنی اسرائیل میں ایک بزرگ تھے ، نام جریج تھا ۔ وہ نماز پڑھ رہے تھے کہ ان کی ماں نے انہیں پکارا ۔ انہوں نے ۔ ( اپنے دل میں ) کہا کہ میں والدہ کا جواب دوں یا نماز پڑھتا رہوں ؟ اس پر ان کی والدہ نے ( غصہ ہو کر ) بدعا کی ، اے اللہ ! اس وقت تک اسے موت نہ آئے جب تک یہ زانیہ عورتوں کا منہ نہ دیکھ لے ۔ جریج اپنے عبادت خانے میں رہا کرتے تھے ۔ ایک مرتبہ ان کے سامنے ایک فاحشہ عورت آئی اور ان سے بدکاری چاہی لیکن انہوں نے ( اس کی خواہش پوری کرنے سے ) انکار کیا ۔ پھر ایک چرواہے کے پاس آئی اور اسے اپنے اوپر قابو دے دیا اس سے ایک بچہ پیدا ہوا ۔ اور اس نے ان پر یہ تہمت دھری کہ یہ جریج کا بچہ ہے ۔ ان کی قوم کے لوگ آئے اور ان کا عبادت خانہ توڑ دیا ، انہیں نیچے اتار کر لائے اور انہیں گالیاں دیں ۔ پھر انہوں نے وضو کر کے نماز پڑھی ، اس کے بعد بچے کے پاس آئے اور اس سے پوچھا کہ تیرا باپ کون ہے ؟ بچہ ( اللہ کے حکم سے ) بول پڑا کہ چرواہا ہے اس پر ( ان کی قوم شرمندہ ہوئی اور ) کہا ہم آپ کا عبادت خانہ سونے کا بنائیں گے ۔ لیکن انہوں نے کہا ہرگز نہیں ، مٹی ہی کا بنے گا ( تیسرا واقعہ ) اور ایک بنی اسرائیل کی عورت تھی ، اپنے بچے کو دودھ پلا رہی تھی ۔ قریب سے ایک سوار نہایت عزت والا اور خوش پوش گزرا ، اس عورت نے دعا کی ، اے اللہ ! میرے بچے کو بھی اسی جیسا بنا دے لیکن بچہ ( اللہ کے حکم سے ) بول پڑا کہ اے اللہ ! مجھے اس جیسا نہ بنانا ۔ پھر اس کے سینے سے لگ کر دودھ پینے لگا ۔ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ جیسے میں اس وقت بھی دیکھ رہا ہوں کہ نبی کریم صلی اللہ علیہ وسلم اپنی انگلی چوس رہے ہیں ( بچے کے دودھ پینے لگنے کی کیفیت بتلاتے وقت ) پھر ایک باندی اس کے قریب سے لے جائی گئی ( جسے اس کے مالک مار رہے تھے ) تو اس عورت نے دعا کی کہ اے اللہ ! میرے بچے کو اس جیسا نہ بنانا ۔ بچے نے پھر اس کا پستان چھوڑ دیا اور کہا کہ اے اللہ ! مجھے اسی جیسا بنا دے ۔ اس عورت نے پوچھا ۔ ایسا تو کیوں کہہ رہا ہے ؟ بچے نے کہا کہ وہ سوار ظالموں میں سے ایک ظالم شخص تھا اور اس باندی سے لوگ کہہ رہے تھے کہ تم نے چوری کی اور زنا کیا حالانکہ اس نے کچھ بھی نہیں کیا تھا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 172190,
        "last_updated": null
    },
    {
        "urduURN": 4033950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3437,
        "hadithSanad": "مجھ سے ابراہیم بن موسیٰ نے بیان کیا ، کہا کہ ہم کو ہشام نے خبر دی ، انہیں معمر نے ( دوسری سند ) مجھ سے محمود نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، کہا کہ ہم کو معمر نے خبر دی ، ان سے زہری نے بیان کیا ، کہا مجھ کو سعید بن مسیب نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جس رات میری معراج ہوئی ، میں نے موسیٰ علیہ السلام سے ملاقات کی تھی ۔ راوی نے بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم نے ان کا حلیہ بیان کیا وہ .... میرا خیال ہے کہ معمر نے کہا .... درازقامت اور سیدھے بالوں والے تھے جیسے قبیلہ شنوہ کے لوگ ہوتے ہیں ۔ آپ نے بیان کیا کہ میں نے عیسیٰ علیہ السلام سے بھی ملاقات کی ۔ آنحضرت صلی اللہ علیہ وسلم نے ان کا بھی حلیہ بیان فرمایا کہ درمیانہ قد اور سرخ و سپید تھے ، جیسے ابھی ابھی غسل خانے سے باہر آئے ہوں اور میں نے ابراہیم علیہ السلام سے بھی ملاقات کی تھی اور میں ان کی اولاد میں ان سے سب سے زیادہ مشابہ ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میرے پاس دو برتن لائے گئے ، ایک میں دودھ تھا اور دوسرے میں شراب ۔ مجھ سے کہا گیا کہ جو آپ کا جی چاہے لے لو ۔ میں نے دودھ کا برتن لے لیا اور پی لیا ۔ اس پر مجھ سے کہا گیا کہ فطرت کی آپ نے راہ پالی ، یا فطرت کو آپ نے پا لیا ۔ اس کے بجائے اگر آپ شراب کا برتن لیتے تو آپ کی امت گمراہ ہو جاتی ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 172200,
        "last_updated": null
    },
    {
        "urduURN": 4033960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3438,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو اسرائیل نے خبر دی ، کہا ہم کو عثمان بن مغیرہ نے خبر دی ، انہیں مجاہد نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، میں نے عیسیٰ ، موسیٰ اور ابراہیم علیہم السلام کو دیکھا ۔ عیسیٰ علیہ السلام نہایت سرخ گھونگھریالے بال والے اور چوڑے سینے والے تھے اور موسیٰ علیہ السلام گندم ، گوں درازقامت اور سیدھے بالوں والے تھے جیسے کوئی قبیلہ زط کا آدمی ہو ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 172210,
        "last_updated": null
    },
    {
        "urduURN": 4033970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3439,
        "hadithSanad": "ہم سے ابراہیم بن المنذر نے بیان کیا ، انہوں نے کہا ہم سے ابوضمرہ نے بیان کیا ، انہوں نے کہا ہم سے موسیٰ نے بیان کیا ، ان سے نافع نے بیان کیا کہ حضرت عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ سلم نے ایک دن لوگوں کے سامنے دجال کا ذکر کیا اور فرمایا کہ اس میں کوئی شبہ نہیں کہ اللہ تعا لیٰ کانا نہیں ہے ، لیکن دجال داہنی آنکھ سے کانا ہو گا ، اس کی آنکھ اٹھے ہوئے انگور کی طرح ہو گی ۔ \nاور میں نے رات کعبہ کے پاس خواب میں ایک گندمی رنگ کے آدمی کو دیکھا جو گندمی رنگ کے آدمیوں میں شکل کے اعتبار سے سب سے زیادہ حسین و جمیل تھا ۔ اس کے سر کے بال شانوں تک لٹک رہے تھے ، سر سے پانی ٹپک رہا تھا اور دونوں ہاتھ دو آدمیوں کے شانوں پر رکھے ہوئے وہ بیت اللہ کا طواف کر رہے تھے ۔ میں نے پوچھا یہ کون بزرگ ہیں ؟ تو فرشتوں نے بتایا کہ یہ مسیح ابن مریم ہیں ۔ اس کے بعد میں نے ایک شخص کو دیکھا ، سخت اور مڑے ہوئے بالوں والا جو داہنی آنکھ سے کانا تھا ۔ اسے میں نے ابن قطن سے سب سے زیادہ شکل میں ملتا ہوا پایا ، وہ بھی ایک شخص کے شانوں پر اپنے دونوں ہاتھ رکھے ہوئے بیت اللہ کا طواف کر رہا تھا ۔ میں نے پوچھا ، یہ کون ہیں ؟ فرشتوں نے بتایا کہ یہ دجال ہے ۔ اس روایت کی متابعت عبیداللہ نے نافع سے کی ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 172221,
        "last_updated": null
    },
    {
        "urduURN": 4033990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3441,
        "hadithSanad": "ہم سے احمد بن محمد مکی نے بیان کیا ، کہا کہ میں نے ابراہیم بن سعد سے سنا ، کہا کہ مجھ سے زہری نے بیان کیا ، ان سے سالم نے اور ان سے ان کے والد نے بیان کیا کہ",
        "hadithText": "ہرگز نہیں ۔ خدا کی قسم نبی کریم صلی اللہ علیہ وسلم نے حضرت عیسیٰ کے بارے میں یہ نہیں فرمایا تھا کہ وہ سرخ تھے بلکہ آپ نے یہ فرمایا تھا کہ میں نے خواب میں ایک مرتبہ بیت اللہ کا طواف کرتے ہوئے اپنے کو دیکھا ، اس وقت مجھے ایک صاحب نظر آئے جو گندمی رنگ لٹکے ہوئے بال والے تھے ، دو آدمیوں کے درمیان ان کا سہارا لئے ہوئے اور سر سے پانی صاف کر رہے تھے ۔ میں نے پوچھا کہ آپ کون ہیں ؟ تو فرشتوں نے جواب دیا کہ آپ ابن مریم علیہما السلام ہیں ۔ اس پر میں نے انہیں غور سے دیکھا تو مجھے ایک اور شخص بھی دکھائی دیا جو سرخ ، موٹا ، سر کے بال مڑے ہوئے اور داہنی آنکھ سے کانا تھا ، اس کی آنکھ ایسی دکھائی دیتی تھی جیسے اٹھا ہوا انار ہو ، میں نے پوچھا یہ کون ہے ؟ تو فرشتوں نے بتایا کہ یہ دجال ہے ۔ اس سے شکل و صورت میں ابن قطن بہت زیادہ مشابہ تھا ۔ زہری نے کہا کہ یہ قبیلہ خزاعہ کا ایک شخص تھا جو جاہلیت کے زمانہ میں مر گیا تھا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 172240,
        "last_updated": null
    },
    {
        "urduURN": 4034000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3442,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہیں ابوسلمہ نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے رسول کریم صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ میں ابن مریم علیہما السلام سے دوسروں کے مقابلہ میں زیادہ قریب ہوں ، انبیاء علاتی بھائیوں کی طرح ہیں اور میرے اور عیسیٰ علیہ السلام کے درمیان کوئی نبی نہیں ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 172250,
        "last_updated": null
    },
    {
        "urduURN": 4034010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3443,
        "hadithSanad": "ہم سے محمد بن سنان نے بیان کیا ، کہا ہم سے فلیح بن سلیمان نے بیان کیا ، کہا ہم سے ہلال بن علی نے بیان کیا ، ان سے عبدالرحمٰن بن ابی عمرہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، میں عیسیٰ بن مریم علیہ السلام سے اور لوگوں کی بہ نسبت زیادہ قریب ہوں ، دنیا میں بھی اور آخرت میں بھی اور انبیاء علیہم السلام علاتی بھائیوں ( کی طرح ) ہیں ۔ ان کے مسائل میں اگرچہ اختلاف ہے لیکن دین سب کا ایک ہی ہے ۔ اور ابراہیم بن طہمان نے بیان کیا ، ان سے موسیٰ بن عقبہ نے ، ان سے صفوان بن سلیم نے ، ان سے عطاء بن یسار نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 113,
        "matchingArabicURN": 172261,
        "last_updated": null
    },
    {
        "urduURN": 4034020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3444,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے عبدالر زاق نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں ہمام نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، عیسیٰ ابن مریم علیہما السلام نے ایک شخص کو چوری کرتے ہوئے دیکھا پھر اس سے دریافت فرمایا تو نے چوری کی ہے ؟ اس نے کہا ہرگز نہیں ، اس ذات کی قسم جس کے سوا اور کوئی معبود نہیں ۔ حضرت عیسیٰ علیہ السلام نے فرمایا کہ میں اللہ پر ایمان لایا اور میری آنکھوں کو دھوکا ہوا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 114,
        "matchingArabicURN": 172280,
        "last_updated": null
    },
    {
        "urduURN": 4034030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3445,
        "hadithSanad": "ہم سے حمیدی نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، کہا کہ میں نے زہری سے سنا ، وہ بیان کرتے تھے کہ مجھے عبیداللہ بن عبداللہ نے خبر دی اور انہیں حضرت ابن عباس رضی اللہ عنہما نے ، انہوں نے حضرت عمر رضی اللہ عنہ کو منبر پر یہ کہتے سنا تھا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا مجھے میرے مرتبے سے زیادہ نہ بڑھاؤ جیسے عیسیٰ ابن مریم علیہما السلام کو نصاریٰ نے ان کے رتبے سے زیادہ بڑھا دیا ہے ۔ میں تو صرف اللہ کا بندہ ہوں ، اس لئے یہی کہا کرو ( میرے متعلق ) کہ میں اللہ کا بندہ اور اس کا رسول ہوں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 115,
        "matchingArabicURN": 172290,
        "last_updated": null
    },
    {
        "urduURN": 4034040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3446,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو صالح بن حیی نے خبر دی کہ خراسان کے ایک شخص نے شعبی سے پوچھا تو انہوں نے بیان کیا کہ",
        "hadithText": "مجھے ابوبردہ نے خبر دی اور ان سے حضرت ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے بیان فرمایا ، اگر کوئی شخص اپنی لونڈی کو اچھی طرح ادب سکھلائے اور پورے طور پر اسے دین کی تعلیم دے ۔ پھر اسے آزاد کر کے اس سے نکاح کر لے تو اسے دوگنا ثواب ملتا ہے اور وہ شخص جو پہلے حضرت عیسیٰ علیہ السلام پر ایمان رکھتا تھا ، پھر مجھ پر ایمان لایا تو اسے بھی دوگنا ثواب ملتا ہے اور وہ غلام جو اپنے رب کا بھی ڈر رکھتا ہے اور اپنے آقا کی بھی اطاعت کرتا ہے تو اسے بھی دوگنا ثواب ملتا ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 116,
        "matchingArabicURN": 172300,
        "last_updated": null
    },
    {
        "urduURN": 4034050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3447,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، انہوں نے کہا ہم سے سفیان نے بیان کیا ، انہوں نے کہا کہ ہم سے مغیرہ بن نعمان نے ، انہیں سعید بن جبیر نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ( قیامت کے دن ) تم لوگ ننگے پاؤں ، ننگے بدن اور بغیر ختنہ کے اٹھائے جاؤ گے ۔ پھر آپ نے اس آیت کی تلاوت کی ” جس طرح ہم نے انہیں پہلی مرتبہ پیدا کیا تھا اسی طرح ہم دوبارہ لوٹائیں گے ، یہ ہماری جانب سے وعدہ ہے اور بیشک ہم اسے کرنے والے ہیں ‘‘ پھر سب سے پہلے حضرت ابراہیم علیہ السلام کو کپڑا پہنایا جائے گا ۔ پھر میرے اصحاب کو دائیں ( جنت کی ) طرف لے جایا جائے گا ۔ لیکن کچھ کو بائیں ( جہنم کی ) طرف لے جایا جائے گا ۔ میں کہوں گا کہ یہ تو میرے اصحاب ہیں لیکن مجھے بتایا جائے گا کہ جب آپ ان سے جدا ہوئے تو اسی وقت انہوں نے ارتداد اختیار کر لیا تھا ۔ میں اس وقت وہی کہوں گا جو عبد صالح عیسیٰ ابن مریم علیہما السلام نے کہا تھا کہ جب تک میں ان میں موجود تھا ان کی نگرانی کرتا رہا لیکن جب تو نے مجھے اٹھا لیا تو تو ہی ان کا نگہبان ہے اور تو ہر چیز پر نگہبان ہے ۔ آیت ” العزیز الحکیم تک ‘‘ محمد بن یوسف نے بیان کیا کہ ابوعبداللہ سے روایت ہے اور ان سے قبیصہ نے بیان کیا کہ یہ وہ مرتدین ہیں جنہوں نے حضرت ابوبکر رضی اللہ عنہ کے عہد خلافت میں کفر اختیار کیا تھا اور جن سے ابوبکر رضی اللہ عنہ نے جنگ کی تھی ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 117,
        "matchingArabicURN": 172310,
        "last_updated": null
    },
    {
        "urduURN": 4034060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3448,
        "hadithSanad": "ہم سے اسحاق بن راہویہ نے بیان کیا ، کہا ہم کو یعقوب بن ابراہیم نے خبر دی ، کہا مجھ سے میرے والد نے بیان کیا ، ان سے صالح بن کیسان نے ، ان سے ابن شہاب نے ، ان سے سعید بن مسیب نے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے کہا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ، وہ زمانہ قریب ہے کہ عیسیٰ ابن مریم علیہما السلام تمہارے درمیان ایک عادل حاکم کی حیثیت سے نازل ہوں گے ۔ وہ صلیب کو توڑ دیں گے ، سور کو مار ڈالیں گے اور جزیہ موقوف کر دیں گے ۔ اس وقت مال کی اتنی کثرت ہو جائے گی کہ کوئی اسے لینے والا نہیں ملے گا ۔ اس وقت کا ایک سجدہ دنیا و مافیہا سے بڑھ کر ہو گا ۔ پھر حضرت ابوہریرہ رضی اللہ عنہ نے کہا کہ اگر تمہارا جی چاہے تو یہ آیت پڑھ لو ” اور کوئی اہل کتاب ایسا نہیں ہو گا جو عیسیٰ کی موت سے پہلے اس پر ایمان نہ لائے اور قیامت کے دن وہ ان پر گواہ ہوں گے ‘‘ ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 118,
        "matchingArabicURN": 172320,
        "last_updated": null
    },
    {
        "urduURN": 4034070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3449,
        "hadithSanad": "ہم سے ابن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے یونس نے ، ان سے ابن شہاب نے ، ان سے حضرت ابوقتادہ انصاری رضی اللہ عنہ کے غلام نافع نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا تمہارا اس وقت کیا حال ہو گا جب عیسیٰ ابن مریم تم میں اتریں گے ( تم نماز پڑھ رہے ہو گے ) اور تمہارا امام تم ہی میں سے ہو گا ۔ اس روایت کی متابعت عقیل اور اوزاعی نے کی ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 119,
        "matchingArabicURN": 172330,
        "last_updated": null
    },
    {
        "urduURN": 4034080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3450,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے ابوعوانہ نے بیان کیا ، کہا ہم سے عبدالملک نے بیان کیا ، ان سے ربعی بن حراش نے بیان کیا کہ",
        "hadithText": "حضرت عقبہ بن عمرو رضی اللہ عنہ نے حضرت حذیفہ رضی اللہ عنہ سے کہا ، کیا آپ وہ حدیث ہم سے نہیں بیان کریں گے جو آپ نے رسول اللہ سے سنی تھی ؟ انہوں نے کہا کہ میں نے آنحضرت صلی اللہ علیہ وسلم کو یہ فرماتے سنا تھا کہ جب دجال نکلے گا تو اس کے ساتھ آگ اور پانی دونوں ہوں گے لیکن لوگوں کو جو آگ دکھائی دے گی وہ ٹھنڈا پانی ہو گا اور لوگوں کو جو ٹھنڈا پانی دکھائی دے گا تو وہ جلانے والی آگ ہو گی ۔ اس لیے تم میں سے جو کوئی اس کے زمانے میں ہو تو اسے اس میں گرنا چاہئے جو آگ ہو گی کیونکہ وہی انتہائی شیریں اور ٹھنڈا پانی ہو گا ۔ \n<span class=urdu_sanad>حضرت حذیفہ رضی اللہ عنہ نے فرمایا کہ</span> میں نے آنحضرت صلی اللہ علیہ وسلم کو یہ فرماتے سنا تھا کہ پہلے زمانے میں ایک شخص کے پاس ملک الموت ان کی روح قبض کرنے آئے تو ان سے پوچھا گیا کوئی اپنی نیکی تمہیں یاد ہے ؟ انہوں نے کہا کہ مجھے تو یاد نہیں پڑتی ، ان سے دوبارہ کہا گیا کہ یاد کرو ! انہوں نے کہا کہ مجھے کوئی اپنی نیکی یاد نہیں ، سوا اس کے کہ میں دنیا میں لوگوں کے ساتھ خریدوفروخت کیا کرتا تھا اور لین دین کیا کرتا تھا ، جو لوگ خوشحال ہوتے انہیں تو میں ( اپنا قرض وصول کرتے وقت ) مہلت دیا کرتا تھا اور تنگ ہاتھ والوں کو معاف کر دیا کرتا تھا ۔ اللہ تعالیٰ نے انہیں اسی پر جنت میں داخل کیا ۔ \n<span class=urdu_sanad>اور حضرت حذیفہ رضی اللہ عنہ نے بیان کیا کہ</span> میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے سنا کہ ایک شخص کی موت کا جب وقت آ گیا اور وہ اپنی زندگی سے بالکل مایوس ہو گیا تو اس نے اپنے گھر والوں کو وصیت کی کہ جب میری موت ہو جائے تو میرے لیے بہت ساری لکڑیاں جمع کرنا اور ان میں آگ لگا دینا ۔ جب آگ میرے گوشت کو جلا چکے اور آخری ہڈی کو بھی جلا دے تو ان جلی ہوئی ہڈیوں کو پیس ڈالنا اور کسی تند ہوا والے دن کا انتظار کرنا اور ( ایسے کسی دن ) میری راکھ کو دریا میں بہا دینا ۔ اس کے گھر والوں نے ایسا ہی کیا ۔ لیکن اللہ تعالیٰ نے اس کی راکھ کو جمع کیا اور اس سے پوچھا ایسا تو نے کیوں کروایا تھا ؟ اس نے جواب دیا کہ تیرے ہی خوف سے اے اﷲ ! اللہ تعالیٰ نے اسی وجہ سے اس کی مغفرت فرما دی ۔ حضرت عقبہ بن عمرو رضی اللہ عنہ نے کہا کہ میں نے آپ کو یہ فرماتے سنا تھا کہ یہ شخص کفن چور تھا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 120,
        "matchingArabicURN": 172342,
        "last_updated": null
    },
    {
        "urduURN": 4034110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "مجھ سے بشر بن محمد نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ نے خبر دی ، انہوں نے کہا مجھ کو معمر اور یونس نے خبر دی ، ان سے زہری نے بیان کیا ، انہیں عبیداللہ بن عبداللہ نے خبر دی کہ",
        "hadithText": "حضرت عائشہ رضی اللہ عنہا اور حضرت ابن عباس رضی اللہ عنہما نے بیان کیا ، جب رسول اللہ صلی اللہ علیہ وسلم پر نزع کی حالت طاری ہوئی تو آپ اپنی چادر چہرہ مبارک پر باربار ڈال لیتے پھر جب شدت بڑھتی تو اسے ہٹا دیتے تھے ۔ حضور صلی اللہ علیہ وسلم نے اسی حالت میں فرمایا تھا ، اللہ کی لعنت ہو یہود و نصاریٰ پر کہ انہوں نے اپنے انبیاء کی قبروں کو سجدہ گاہ بنا لیا ۔ آنحضور صلی اللہ علیہ وسلم اس امت کو ان کے کئے سے ڈرانا چاہتے تھے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 121,
        "matchingArabicURN": 172370,
        "last_updated": null
    },
    {
        "urduURN": 4034120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3455,
        "hadithSanad": "مجھ سے محمد بن بشار نے بیان کیا کہ ہم سے محمد بن جعفر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے فرات قزار نے بیان کیا ، انہوں نے ابوحازم سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں حضرت ابوہریرہ رضی اللہ عنہ کی مجلس میں پانچ سال تک بیٹھا ہوں ۔ میں نے انہیں رسول اللہ صلی اللہ علیہ وسلم کی یہ حدیث بیان کرتے سنا کہ آپ نے فرمایا بنی اسرائیل کے انبیاء ان کی سیاسی رہنمائی بھی کیا کرتے تھے ، جب بھی ان کا کوئی نبی ہلاک ہو جاتا تو دوسرے ان کی جگہ آ موجود ہوتے ، لیکن یاد رکھو میرے بعد کوئی نبی نہیں آئے گا ۔ ہاں میرے نائب ہوں گے اور بہت ہوں گے ۔ صحابہ نے عرض کیا کہ ان کے متعلق آپ کا ہمیں کیا حکم ہے ۔ آپ نے فرمایا کہ سب سے پہلے جس سے بیعت کر لو ، بس اسی کی وفاداری پر قائم رہو اور ان کا جو حق ہے اس کی ادائیگی میں کوتاہی نہ کرو کیونکہ اللہ تعالیٰ ان سے قیامت کے دن ان کی رعایا کے بارے میں سوال کرے گا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 122,
        "matchingArabicURN": 172380,
        "last_updated": null
    },
    {
        "urduURN": 4034130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3456,
        "hadithSanad": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم سے ابوغسان نے بیان کیا ، کہا کہ مجھ سے زید بن اسلم نے بیان کیا ، ان سے عطاء بن یسار نے اور ان سے حضرت ابوسعید رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا تم لوگ پہلی امتوں کے طریقوں کی قدم بقدم پیروی کرو گے یہاں تک کہ اگر وہ لوگ کسی ساہنہ کے سوراخ میں داخل ہوئے تو تم بھی اس میں داخل ہو گے ۔ ہم نے پوچھا یا رسول اللہ صلی اللہ علیہ وسلم ! کیا آپ کی مراد پہلی امتوں سے یہود و نصاریٰ ہیں ؟ آپ نے فرمایا کون ہو سکتا ہے ؟</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 123,
        "matchingArabicURN": 172390,
        "last_updated": null
    },
    {
        "urduURN": 4034140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3457,
        "hadithSanad": "ہم سے عمران بن میسرہ نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، کہا ہم سے خالد نے ، ان سے ابوقلابہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "( نماز کے لیے اعلان کے طریقے پر بحث کرتے وقت ) صحابہ نے آگ اور ناقوس کا ذکر کیا ، لیکن بعض نے کہا کہ یہ تو یہود و نصاریٰ کا طریقہ ہے ۔ آخر بلال رضی اللہ عنہ کو حکم ہوا کہ اذان میں ( کلمات ) دو دو دفعہ کہیں اور تکبیر میں ایک ایک دفعہ ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 124,
        "matchingArabicURN": 172400,
        "last_updated": null
    },
    {
        "urduURN": 4034150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3458,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے اعمش نے بیان کیا ، ان سے ابوالضحیٰ نے بیان کیا ، ان سے مسروق نے بیان کیا کہ",
        "hadithText": "حضرت عائشہ رضی اللہ عنہا کوکھ پر ہاتھ رکھنے کو ناپسند کرتی تھیں اور فرماتی تھیں کہ اس طرح یہود کرتے ہیں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 125,
        "matchingArabicURN": 172410,
        "last_updated": null
    },
    {
        "urduURN": 4034160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3459,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے لیث نے بیان کیا ، انہوں نے کہا کہ ہم سے نافع نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، تمہارا زمانہ پچھلی امتوں کے مقابلے میں ایسا ہے جیسے عصر سے مغرب تک کا وقت ہے ، تمہاری مثال یہود و نصاریٰ کے ساتھ ایسی ہے جیسے کسی شخص نے کچھ مزدور لیے اور کہا کہ میرا کام آدھے دن تک کون ایک ایک قیراط کی اجرت پر کرے گا ؟ یہود نے آدھے دن تک ایک ایک قیراط کی مزدوری پر کام کرنا طے کر لیا ۔ پھر اس شخص نے کہا کہ آدھے دن سے عصر کی نماز تک میرا کام کون شخص ایک ایک قیراط کی مزدوری پر کرے گا ۔ اب نصاریٰ ایک ایک قیراط کی مزدوری پر آدھے دن سے عصر کے وقت تک مزدوری کرنے پر تیار ہو گئے ۔ پھر اس شخص نے کہا کہ عصر کی نماز سے سورج ڈوبنے تک دو دو قیراط پر کون شخص میرا کام کرے گا ؟ تمہیں معلوم ہونا چاہئے کہ وہ تمہیں ہو جو دو دو قیراط کی مزدوری پر عصر سے سورج ڈوبنے تک کام کرو گے ، تم آگاہ رہو کہ تمہاری مزدوری دگنی ہے ۔ یہود و نصاریٰ اس فیصلہ پر غصہ ہو گئے اور کہنے لگے کہ کام تو ہم زیادہ کریں اور مزدوری ہمیں کو کم ملے ۔ اللہ تعالیٰ نے ان سے فرمایا کیا میں نے تمہیں تمہارا حق دینے میں کوئی کمی کی ہے ؟ انہوں نے کہا کہ نہیں ۔ اللہ تعالیٰ نے فرمایا کہ پھر یہ میرا فضل ہے ، میں جسے چاہوں زیادہ دوں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 126,
        "matchingArabicURN": 172420,
        "last_updated": null
    },
    {
        "urduURN": 4034170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3460,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو نے ، ان سے طاوس نے ، ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نے حضرت عمر رضی اللہ عنہ سے سنا انھوں نے کہا اللہ تعالیٰ فلاں کو تباہ کرے ۔ انہیں کیا معلوم نہیں کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا تھا ، یہود پر اللہ کی لعنت ہو ، ان کے لیے چربی حرام ہوئی تو انہوں نے اسے پگھلا کر بیچنا شروع کر دیا ۔ اس روایت کو ابن عباس رضی اللہ عنہما کے ساتھ جابر اور ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 127,
        "matchingArabicURN": 172430,
        "last_updated": null
    },
    {
        "urduURN": 4034180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3461,
        "hadithSanad": "ہم سے ابوعاصم ضحاک بن مخلد نے بیان کیا ، کہا ہم کو اوزاعی نے خبر دی ، کہا ہم سے حسان بن عطیہ نے بیان کیا ، ان سے ابوکبشہ نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، میرا پیغام لوگوں کو پہنچاؤ ! اگرچہ ایک ہی آیت ہو اور بنی اسرائیل کے واقعات تم بیان کر سکتے ہو ، ان میں کوئی حرج نہیں اور جس نے مجھ پر قصداً جھوٹ باندھا تو اسے اپنے جہنم کے ٹھکانے کے لیے تیار رہنا چاہئے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 128,
        "matchingArabicURN": 172440,
        "last_updated": null
    },
    {
        "urduURN": 4034190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3462,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے ابراہیم بن سعد نے بیان کیا ، ان سے صالح نے ، ان سے ابن شہاب نے بیان کیا ، ان سے ابوسلمہ نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، یہود و نصاریٰ ) ڈاڑھی وغیرہ ) میں خضاب نہیں لگاتے ، تم لوگ اس کے خلاف طریقہ اختیار کرو ( یعنی خضاب لگایا کرو ) ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 129,
        "matchingArabicURN": 172450,
        "last_updated": null
    },
    {
        "urduURN": 4034200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3463,
        "hadithSanad": "مجھ سے محمد نے بیان کیا ، کہا مجھ سے حجاج نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے حسن نے ، کہا ہم سے حضرت جندب بن عبداللہ نے اسی مسجد میں بیان کیا ( حسن نے کہا کہ ) انہوں نے جب ہم سے بیان کیا ہم اسے بھولے نہیں اور نہ ہمیں اس کا اندیشہ ہے کہ",
        "hadithText": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم کی طرف اس حدیث کی نسبت غلط کی ہو گی ، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، پچھلے زمانے میں ایک شخص ( کے ہاتھ میں ) زخم ہو گیا تھا اور اسے اس سے بڑی تکلیف تھی ، آخر اس نے چھری سے اپنا ہاتھ کاٹ لیا اس کا نتیجہ یہ ہوا کہ خون بہنے لگا اور اسی سے وہ مر گیا پھر اللہ تعالیٰ نے فرمایا کہ میرے بندے نے خود میرے پاس آنے میں جلدی کی اس لیے میں نے بھی جنت کو اس پر حرام کر دیا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 130,
        "matchingArabicURN": 172460,
        "last_updated": null
    },
    {
        "urduURN": 4034210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3464,
        "hadithSanad": "مجھ سے احمد بن اسحاق نے بیان کیا ، کہا ہم سے عمرو بن عاصم نے بیان کیا ، ان سے ہمام نے بیان کیا ، ان سے اسحاق بن عبداللہ نے بیان کیا ، کہا مجھ سے عبدالرحمٰن بن ابی حمزہ نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ( دوسری سند ) اور مجھ سے محمد نے بیان کیا ، کہا ہم سے عبداللہ بن رجاء نے بیان کیا ، انہیں ہمام نے خبر دی ، ان سے اسحاق بن عبداللہ نے بیان کیا ، انہیں عبدالرحمٰن بن ابی عمرہ نے خبر دی اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ،",
        "hadithText": "آپ نے فرمایا کہ بنی اسرائیل میں تین شخص تھے ، ایک کوڑھی ، دوسرا اندھا اور تیسرا گنجا ، اللہ تعالیٰ نے چاہا کہ ان کا امتحان لے ۔ چنانچہ اللہ تعالیٰ نے ان کے پاس ایک فرشتہ بھیجا ۔ فرشتہ پہلے کوڑھی کے پاس آیا اور اس سے پوچھا کہ تمہیں سب سے زیادہ کیا چیز پسند ہے ؟ اس نے جواب دیا کہ اچھا رنگ اور اچھی چمڑی کیونکہ مجھ سے لوگ پرہیز کرتے ہیں ۔ بیان کیا کہ فرشتے نے اس پر اپنا ہاتھ پھیرا تو اس کی بیماری دور ہو گئی اور اس کا رنگ بھی خوبصورت ہو گیا اور چمڑی بھی اچھی ہو گئی ۔ فرشتے نے پوچھا کس طرح کا مال تم زیادہ پسند کرو گے ؟ اس نے کہا کہ اونٹ ! یا اس نے گائے کہی ، اسحاق بن عبداللہ کو اس سلسلے میں شک تھا کہ کوڑھی اور گنجے دونوں میں سے ایک نے اونٹ کی خواہش کی تھی اور دوسرے نے گائے کی ۔ چنانچہ اسے حاملہ اونٹنی دی گئی اور کہا گیا کہ اللہ تعالیٰ تمہیں اس میں برکت دے گا ، پھر فرشتہ گنجے کے پاس آیا اور اس سے پوچھا کہ تمہیں کیا چیز پسند ہے ؟ اس نے کہا کہ عمدہ بال اور موجودہ عیب میرا ختم ہو جائے کیونکہ لوگ اس کی وجہ سے مجھ سے پرہیز کرتے ہیں ۔ بیان کیا کہ فرشتے نے اس کے سر پر ہاتھ پھیرا اور اس کا عیب جاتا رہا اور اس کے بجائے عمدہ بال آ گئے ۔ فرشتے نے پوچھا ، کس طرح کا مال پسند کرو گے ؟ اس نے کہا کہ گائے ! بیان کیا کہ فرشتے نے اسے حاملہ گائے دے دی اور کہا کہ اللہ تعالیٰ اس میں برکت دے گا ۔ پھر اندھے کے پاس فرشتہ آیا اور کہا کہ تمہیں کیا چیز پسند ہے ؟ اس نے کہا کہ اللہ تعالیٰ مجھے آنکھوں کی روشنی دیدے تاکہ میں لوگوں کو دیکھ سکوں ۔ بیان کیا کہ فرشتے نے ہاتھ پھیرا اور اللہ تعالیٰ نے اس کی بینائی اسے واپس دے دی ۔ پھر پوچھا کہ کس طرح کا مال تم پسند کرو گے ؟ اس نے کہا کہ بکریاں ! فرشتے نے اسے حاملہ بکری دے دی ۔ پھر تینوں جانوروں کے بچے پیدا ہوئے ، یہاں تک کہ کوڑھی کے اونٹوں سے اس کی وادی بھر گئی ، گنجے کی گائے بیل سے اس کی وادی بھر گئی اور اندھے کی بکریوں سے اس کی وادی بھر گئی ۔ پھر دوبارہ فرشتہ اپنی اسی پہلی شکل میں کوڑھی کے پاس آیا اور کہا کہ میں ایک نہایت مسکین و فقیر آدمی ہوں ، سفر کا تمام سامان و اسباب ختم ہو چکا ہے اور اللہ تعالیٰ کے سوا اور کسی سے حاجت پوری ہونے کی امید نہیں ، لیکن میں تم سے اسی ذات کا واسطہ دے کر جس نے تمہیں اچھا رنگ اور اچھا چمڑا اور مال عطا کیا ، ایک اونٹ کا سوال کرتا ہوں جس سے سفر کو پورا کر سکوں ۔ اس نے فرشتے سے کہا کہ میرے ذمہ حقوق اور بہت سے ہیں ۔ فرشتہ نے کہا ، غالباً میں تمہیں پہچانتا ہوں ، کیا تمہیں کوڑھ کی بیماری نہیں تھی جس کی وجہ سے لوگ تم سے گھن کھاتے تھے ۔ تم ایک فقیر اور قلاش تھے ۔ پھر تمہیں اللہ تعالیٰ نے یہ چیزیں عطا کیں ؟ اس نے کہا کہ یہ ساری دولت تو میرے باپ دادا سے چلی آ رہی ہے ۔ فرشتے نے کہا کہ اگر تم جھوٹے ہو تو اللہ تمہیں اپنی پہلی حالت پر لوٹا دے ۔ پھر فرشتہ گنجے کے پاس اپنی اسی پہلی صورت میں آیا اور اس سے بھی وہی درخواست کی اور اس نے بھی وہی کوڑھی والا جواب دیا ۔ فرشتے نے کہا کہ اگر تم جھوٹے ہو تو اللہ تعالیٰ تمہیں اپنی پہلی حالت پر لوٹا دے ، اس کے بعد فرشتہ اندھے کے پاس آیا ، اپنی اسی پہلی صورت میں اور کہا کہ میں ایک مسکین آدمی ہوں ، سفر کے تمام سامان ختم ہو چکے ہیں اور سوا اللہ تعالیٰ کے کسی سے حاجت پوری ہونے کی توقع نہیں ۔ میں تم سے اس ذات کا واسطہ دے کر جس نے تمہیں تمہاری بینائی واپس دی ہے ، ایک بکری مانگتا ہوں جس سے اپنے سفر کی ضروریات پوری کر سکوں ۔ اندھے نے جواب دیا کہ واقعی میں اندھا تھا اور اللہ تعالیٰ نے مجھے اپنے فضل سے بینائی عطا فرمائی اور واقعی میں فقیر و محتاج تھا اور اللہ تعالیٰ نے مجھے مالدار بنایا ۔ تم جتنی بکریاں چاہو لے سکتے ہو ، اللہ کی قسم جب تم نے خدا کا واسطہ دیا ہے تو جتنا بھی تمہارا جی چاہے لے جاؤ ، میں تمہیں ہرگز نہیں روک سکتا ۔ فرشتے نے کہا کہ تم اپنا مال اپنے پاس رکھو ، یہ تو صرف امتحان تھا اور اللہ تعالیٰ تم سے راضی اور خوش ہے اور تمہارے دونوں ساتھیوں سے ناراض ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 131,
        "matchingArabicURN": 172470,
        "last_updated": null
    },
    {
        "urduURN": 4034220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3465,
        "hadithSanad": "ہم سے اسماعیل بن خلیل نے بیان کیا ، کہا ہم کو علی بن مسہر نے خبر دی ، انہیں عبیداللہ بن عمر نے ، انہیں نافع نے اور انہیں ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا پچھلے زمانے میں ( بنی اسرائیل میں سے ) تین آدمی کہیں راستے میں جا رہے تھے کہ اچانک بارش نے انہیں آ لیا ۔ وہ تینوں پہاڑ کے ایک کھوہ ( غار ) میں گھس گئے ( جب وہ اندر چلے گئے ) تو غار کا منہ بند ہو گیا ۔ اب تینوں آپس میں یوں کہنے لگے کہ اللہ کی قسم ہمیں اس مصیبت سے اب تو صرف سچائی ہی نجات دلائے گی ۔ بہتر یہ ہے کہ اب ہر شخص اپنے کسی ایسے عمل کو بیان کر کے دعا کرے جس کے بارے میں اسے یقین ہو کہ وہ خالص اللہ تعالیٰ کی رضامندی کے لئے کیا تھا ۔ چنانچہ ایک نے اس طرح دعا کی ، اے اللہ ! تجھ کو خوب معلوم ہے کہ میں نے ایک مزدور رکھا تھا جس نے ایک فرق ( تین صاع ) چاول کی مزدوری پر میرا کام کیا تھا لیکن وہ شخص ( غصہ میں آ کر ) چلا گیا اور اپنے چاول چھوڑ گیا ۔ پھر میں نے اس ایک فرق چاول کو لیا اور اس کی کاشت کی ۔ اس سے اتنا کچھ ہو گیا کہ میں نے پیداوار میں سے گائے بیل خرید لئے ۔ اس کے بہت دن بعد وہی شخص مجھ سے اپنی مزدوری مانگنے آیا ۔ میں نے کہا کہ یہ گائے بیل کھڑے ہیں ان کو لے جا ۔ اس نے کہا کہ میرا تو صرف ایک فرق چاول تم پر ہونا چاہیے تھا ۔ میں نے اس سے کہا یہ سب گائے بیل لے جا کیونکہ اسی ایک فرق کی آمدنی ہے ۔ آخر وہ گائے بیل لے کر چلا گیا ۔ پس اے اللہ ! اگر تو جانتا ہے کہ یہ ایمانداری میں نے صرف تیرے ڈر سے کی تھی تو تو غار کا منہ کھول دے ۔ چنانچہ اسی وقت وہ پتھر کچھ ہٹ گیا ۔ پھر دوسرے نے اس طرح دعا کی ۔ اے اللہ ! تجھے خوب معلوم ہے کہ میرے ماں باپ جب بوڑھے ہو گئے تو میں ان کی خدمت میں روزانہ رات میں اپنی بکریوں کا دودھ لا کر پلایا کرتا تھا ۔ ایک دن اتفاق سے میں دیر سے آیا تو وہ سو چکے تھے ۔ ادھر میرے بیوی اور بچے بھوک سے بلبلا رہے تھے لیکن میری عادت تھی کہ جب تک والدین کو دودھ نہ پلا لوں ، بیوی بچوں کو نہیں دیتا تھا مجھے انہیں بیدار کرنا بھی پسند نہیں تھا اور چھوڑنا بھی پسند نہ تھا ( کیونکہ یہی ان کا شام کا کھانا تھا اور اس کے نہ پینے کی وجہ سے وہ کمزور ہو جاتے ) پس میں ان کا وہیں انتظار کرتا رہا یہاں تک کہ صبح ہو گئی ۔ پس اگر تیرے علم میں بھی میں نے یہ کام تیرے خوف کی وجہ سے کیا تھا تو تو ہماری مشکل دور کر دے ۔ اس وقت وہ پتھر کچھ اور ہٹ گیا اور اب آسمان نظر آنے لگا ۔ پھر تیسرے شخص نے یوں دعا کی ، اے اللہ ! میری ایک چچا زاد بہن تھی جو مجھے سب سے زیادہ محبوب تھی ۔ میں نے ایک بار اس سے صحبت کرنی چاہی ، اس نے انکار کیا مگر اس شرط پر تیار ہوئی کہ میں اسے سو اشرفی لا کر دے دوں ۔ میں نے یہ رقم حاصل کرنے کے لئے کوشش کی ۔ آخر وہ مجھے مل گئی تو میں اس کے پاس آیا اور وہ رقم اس کے حوالے کر دی ۔ اس نے مجھے اپنے نفس پر قدرت دے دی ۔ جب میں اس کے دونوں پاؤں کے درمیان بیٹھ چکا تو اس نے کہا کہ اللہ سے ڈر اور مہر کو بغیر حق کے نہ توڑ ۔ میں ( یہ سنتے ہی ) کھڑا ہو گیا اور سو اشرفی بھی واپس نہیں لی ۔ پس اگر تیرے علم میں بھی میں نے یہ عمل تیرے خوف کی وجہ سے کیا تھا تو تو ہماری مشکل آسان کر دے ۔ اللہ تعالیٰ نے ان کی مشکل دور کر دی اور وہ تینوں باہر نکل آئے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 132,
        "matchingArabicURN": 172480,
        "last_updated": null
    },
    {
        "urduURN": 4034230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3466,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، کہا ہم سے ابوالزناد نے بیان کیا ، ان سے عبدالرحمٰن نے بیان کیا ، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک عورت اپنے بچے کو دودھ پلا رہی تھی کہ ایک سوار ( نام نامعلوم ) ادھر سے گزرا ، وہ اس وقت بھی بچے کو دودھ پلا رہی تھی ( سوار کی شان دیکھ کر ) عورت نے دعا کی اے اللہ ! میرے بچے کو اس وقت تک موت نہ دینا جب تک کہ اس سوار جیسا نہ ہو جائے ۔ اسی وقت ( بقدرت الہٰی ) بچہ بول پڑا ۔ اے اللہ ! مجھے اس جیسا نہ کرنا ۔ اور پھر وہ دودھ پینے لگا ۔ اس کے بعد ایک ( نام نامعلوم ) عورت کو ادھر سے لے جایا گیا ، اسے لے جانے والے اسے گھسیٹ رہے تھے اور اس کا مذاق اڑا رہے تھے ۔ ماں نے دعا کی ، اے اللہ ! میرے بچے کو اس عورت جیسا نہ کرنا ، لیکن بچے نے کہا کہ اے اللہ ! مجھے اسی جیسا بنا دینا ( پھر تو ماں نے پوچھا ، ارے یہ کیا معاملہ ہے ؟ اس بچے نے بتایا کہ سوار تو کافر و ظالم تھا اور عورت کے متعلق لوگ کہتے تھے کہ تو زنا کراتی ہے تو وہ جواب دیتی حسبی اللہ ( اللہ میرے لئے کافی ہے ، وہ میری پاک دامنی جانتا ہے ) لوگ کہتے کہ تو چوری کرتی ہے تو وہ جواب دیتی حسبی اللہ ( اللہ میرے لئے کافی ہے اور وہ میری پاک دامنی جانتا ہے )</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 133,
        "matchingArabicURN": 172490,
        "last_updated": null
    },
    {
        "urduURN": 4034240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3467,
        "hadithSanad": "ہم سے سعید بن تلید نے بیان کیا ، کہا ہم سے ابن وہب نے بیان کیا ، کہا کہ مجھے جریر بن حازم نے خبر دی ، انہیں ایوب نے اور انہیں محمد بن سیرین نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے بیان فرمایا کہ ایک کتا ایک کنویں کے چاروں طرف چکر کاٹ رہا تھا جیسے پیاس کی شدت سے اس کی جان نکل جانے والی ہو کہ بنی اسرائیل کی ایک زانیہ عورت نے اسے دیکھ لیا ۔ اس عورت نے اپنا موزہ اتار کر کتے کو پانی پلایا اور اس کی مغفرت اسی عمل کی وجہ سے ہو گئی ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 134,
        "matchingArabicURN": 172500,
        "last_updated": null
    },
    {
        "urduURN": 4034250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3468,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، کہا ہم سے امام مالک نے بیان کیا ، ان سے ابن شہاب نے ، ان سے حمید بن عبدالرحمٰن نے اور انہوں نے معاویہ بن ابی سفیان رضی اللہ عنہ سے سنا",
        "hadithText": "ایک سال جب وہ حج کے لئے گئے ہوئے تھے تو منبرنبوی پر کھڑے ہو کر انہوں نے پیشانی کے بالوں کا ایک کچھا لیا جو ان کے چوکیدار کے ہاتھ میں تھا اور فرمایا اے مدینہ والو ! تمہارے علماء کدھر گئے میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے ۔ آپ نے اس طرح ( بال جوڑنے کی ) ممانعت فرمائی تھی اور فرمایا تھا کہ بنی اسرائیل پر بربادی اس وقت آئی جب ( شریعت کے خلاف ) ان کی عورتوں نے اس طرح بال سنوارنے شروع کر دیئے تھے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 135,
        "matchingArabicURN": 172510,
        "last_updated": null
    },
    {
        "urduURN": 4034260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3469,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے ان کے والد نے بیان کیا ، ان سے ابوسلمہ نے بیان کیا ، اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، گزشتہ امتوں میں محدث لوگ ہوا کرتے تھے اور اگر میری امت میں کوئی ایسا ہے تو وہ عمر بن خطاب ہیں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 136,
        "matchingArabicURN": 172520,
        "last_updated": null
    },
    {
        "urduURN": 4034270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3470,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا کہا ہم سے محمد بن ابی عدی نے بیان کیا ان سے شعبہ نے ان سے قتادہ نے ان سے ابو صدیق ناجی بکر بن قیس نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا بنی اسرائیل میں ایک شخص تھا ( نام نامعلوم ) جس نے ننانوے خون ناحق کئے تھے پھر وہ نادم ہو کر ) مسئلہ پوچھنے نکلا ۔ وہ ایک درویش کے پاس آیا اور اس سے پوچھا کیا اس گناہ سے توبہ قبول ہونے کی کوئی صورت ہے ؟ درویش نے جواب دیا کہ نہیں ۔ یہ سن کر اس نے اس درویش کو بھی قتل کر دیا ( اور سو خون پورے کر دئیے ) پھر وہ ( دوسروں سے ) پوچھنے لگا ۔ آخر اس کو ایک درویش نے بتایا کہ فلاں بستی میں چلا جا ) ( وہ آدھے راستے بھی نہیں پہنچا تھا کہ ) اس کی موت واقع ہو گئی ۔ مرتے مرتے اس نے اپنا سینہ اس بستی کی طرف جھکا دیا ۔ آخر رحمت کے فرشتوں اور عذاب کے فرشتوں میں باہم جھگڑا ہوا ۔ ( کہ کون اسے لے جائے ) لیکن اللہ تعالیٰ نے اس نصرہ نامی بستی کو ( جہاں وہ توبہ کے لئے جا رہا تھا ) حکم دیا کہ اس کی نعش سے قریب ہو جائے اور دوسری بستی کو ( جہاں سے وہ نکلا تھا ) حکم دیا کہ اس کی نعش سے دور ہو جا ۔ پھر اللہ تعالیٰ نے فرشتوں سے فرمایا کہ اب دونوں کا فاصلہ دیکھو اور ( جب ناپا تو ) اس بستی کو ( جہاں وہ توبہ کے لئے جا رہا تھا ) ایک بالشت نعش سے نزدیک پایا اس لئے وہ بخش دیا گیا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 137,
        "matchingArabicURN": 172530,
        "last_updated": null
    },
    {
        "urduURN": 4034280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3471,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا ہم سے ابوالزناد نے بیان کیا ، ان سے اعرج نے ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے صبح کی نماز پڑھی پھر لوگوں کی طرف متوجہ ہوئے اور فرمایا ایک شخص ( بنی اسرائیل کا ) اپنی گائے ہانکے لئے جا رہا تھا کہ وہ اس پر سوار ہو گیا اور پھر اسے مارا ۔ اس گائے نے ( بقدرت الہیٰ ) کہا کہ ہم جانور سواری کے لئے نہیں پیدا کئے گئے ۔ ہماری پیدائش تو کھیتی کے لئے ہوئی ہے ۔ لوگوں نے کہا سبحان اللہ ! گائے بات کرتی ہے ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں اس بات پر ایمان لاتا ہوں اور ابوبکر اور عمر بھی ۔ حالانکہ یہ دونوں وہاں موجود بھی نہیں تھے ۔ اسی طرح ایک شخص اپنی بکریاں چرا رہا تھا کہ ایک بھیڑیا آیا اور ریوڑ میں سے ایک بکری اٹھا کر لے جانے لگا ۔ ریوڑ والا دوڑا اور اس نے بکری کو بھیڑئیے سے چھڑا لیا ۔ اس پر بھیڑیا ( بقدرت الہیٰ ) بولا ، آج تو تم نے مجھ سے اسے چھڑا لیا لیکن درندوں والے دن میں ( قرب قیامت ) اسے کون بچائے گا جس دن میرے سوا اور کوئی اس کا چرواہا نہ ہو گا ؟ لوگوں نے کہا ، سبحان اللہ ! بھیڑیا باتیں کرتا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں تو اس بات پر ایمان لایا اور ابوبکرو عمر بھی حالانکہ وہ دونوں اس وقت وہاں موجود نہ تھے ۔ امام بخاری رحمہ اللہ نے کہا اور ہم سے علی بن عبداللہ مدینی نے کہا ، ہم سے سفیان بن عیینہ نے بیان کیا ، انہوں نے مسعر سے ، انہوں نے سعد بن ابراہیم سے ، انہوں نے ابوسلمہ سے روایت کیا اور انہوں نے ابوہریرہ رضی اللہ عنہ سے اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے یہی حدیث بیان کی ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 138,
        "matchingArabicURN": 172541,
        "last_updated": null
    },
    {
        "urduURN": 4034290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3472,
        "hadithSanad": "ہم سے اسحاق بن نصر نے بیان کیا ، انہوں نے کہا ہم کو عبدالرزاق نے خبر دی ، انہیں معمر نے ، انہیں ہمام نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ایک شخص نے دوسرے شخص سے مکان خریدا اور مکان کے خریدار کو اس مکان میں ایک گھڑا ملا جس میں سونا تھا جس سے وہ مکان اس نے خریدا تھا اس سے اس نے کہا بھائی گھڑا لے جا ۔ کیونکہ میں نے تم سے گھر خریدا ہے سونا نہیں خریدا تھا لیکن پہلے مالک نے کہا کہ میں نے گھر کو ان تمام چیزوں سمیت تمہیں بیچ دیا تھا جو اس کے اندر موجود ہوں ۔ یہ دونوں ایک تیسرے شخص کے پاس اپنا مقدمہ کے گئے ۔ فیصلہ کرنے والے نے ان سے پوچھا کیا تمہارے کوئی اولاد ہے ؟ اس پر ایک نے کہا کہ میرے ایک لڑکا ہے اور دوسرے نے کہا کہ میری ایک لڑکی ہے ۔ فیصلہ کرنے والے نے ان سے کہا کہ لڑکے کا لڑکی سے نکاح کر دو اور سونا انہیں پر خرچ کر دو اور خیرات بھی کر دو ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 139,
        "matchingArabicURN": 172560,
        "last_updated": null
    },
    {
        "urduURN": 4034300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3473,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا ، انہوں نے کہا مجھ سے امام مالک نے بیان کیا ، ان سے محمد بن منکدر اور عمر بن عبیداللہ کے مولیٰ ابو النضر نے ، ان سے عامر بن سعد بن ابی وقاص نے بیان کیا اور انہوں نے ( عامر نے ) اپنے والد ( سعد بن ابی وقاص رضی اللہ عنہ ) کو اسامہ بن زید رضی اللہ عنہ سے یہ پوچھتے سنا تھا کہ",
        "hadithText": "طاعون کے بارے میں آپ نے آنحضرت صلی اللہ علیہ وسلم سے کیا سنا ہے ؟ انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا طاعون ایک عذاب ہے جو پہلے بنی اسرائیل کے ایک گروہ پر بھیجا گیا تھا یا آپ نے یہ فرمایا کہ ایک گزشتہ امت پر بھیجا گیا تھا ۔ اس لئے جب کسی جگہ کے متعلق تم سنو ( کہ وہاں طاعون پھیلا ہوا ہے ) تو وہاں نہ جاؤ ۔ لیکن اگر کسی ایسی جگہ یہ وبا پھیل جائے جہاں تم پہلے سے موجود ہو تو وہاں سے مت نکلو ۔ ابوالنضر نے کہا یعنی بھاگنے کے سوا اور کوئی غرض نہ ہو تو مت نکلو ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 140,
        "matchingArabicURN": 172570,
        "last_updated": null
    },
    {
        "urduURN": 4034310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3474,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے داؤد بن ابی فرات نے بیان کیا ، کہا ہم سے عبداللہ بن بریدہ نے بیان کیا ، ان سے یحیٰی بن یعمر نے اور ان سے ام المؤمنین حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میں نے آنحضرت صلی اللہ علیہ وسلم سے طاعون کے بارے میں پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ ایک عذاب ہے ، اللہ تعالیٰ جس پر چاہتا ہے بھیجتا ہے لیکن اللہ تعالیٰ نے اس کو مومنوں کے لئے رحمت بنا دیا ہے ۔ اگر کسی شخص کی بستی میں طاعون پھیل جائے اور وہ صبر کے ساتھ اللہ کی رحمت سے امید لگائے ہوئے وہیں ٹھہرا رہے کہ ہو گا وہی جو اللہ تعالیٰ نے قسمت میں لکھا ہے تو اسے شہید کے برابر ثواب ملے گا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 141,
        "matchingArabicURN": 172580,
        "last_updated": null
    },
    {
        "urduURN": 4034320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3475,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے ابن شہاب نے ان سے عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "مخزومیہ خاتون ( فاطمہ بنت اسود ) جس نے ( غزوہ فتح کے موقع پر ) چوری کر لی تھی ، اس کے معاملہ نے قریش کو فکر میں ڈال دیا ۔ انہوں نے آپس میں مشورہ کیا کہ اس معاملہ پر آنحضرت صلی اللہ علیہ وسلم سے گفتگو کون کرے ! آخر یہ طے پایا کہ اسامہ بن زید رضی اللہ عنہ آپ کو بہت عزیز ہیں ۔ ان کے سوا اور کوئی اس کی ہمت نہیں کر سکتا ۔ چنانچہ اسامہ رضی اللہ عنہ نے آنحضرت صلی اللہ علیہ وسلم سے اس بارے میں کچھ کہا تو آپ نے فرمایا ۔ اے اسامہ ! کیا تو اللہ کی حدود میں سے ایک حد کے بارے میں مجھ سے سفارش کرتا ہے ؟ پھر آپ کھڑے ہوئے اور خطبہ دیا ( جس میں ) آپ نے فرمایا ۔ پچھلی بہت سی امتیں اس لئے ہلاک ہو گئیں کہ جب ان کا کوئی شریف آدمی چوری کرتا تو اسے چھوڑ دیتے اور اگر کوئی کمزور چوری کرتا تو اس پر حد قائم کرتے اور اللہ کی قسم ! اگر فاطمہ بنت محمد صلی اللہ علیہ وسلم بھی چوری کرے تو میں اس کا بھی ہاتھ کاٹ ڈالوں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 142,
        "matchingArabicURN": 172590,
        "last_updated": null
    },
    {
        "urduURN": 4034330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3476,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے عبدالملک بن میسرہ نے بیان کیا ، کہا کہ میں نے نزال بن سبرہ ہلالی سے سنا اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نے ایک صحابی ( عمرو بن عاص ) کو قرآن مجید کی ایک آیت پڑھتے سنا ۔ وہی آیت نبی کریم صلی اللہ علیہ وسلم سے اس کے خلاف قرآت کے ساتھ میں سن چکا تھا ، اس لئے میں انہیں ساتھ لے کر آپ کی خدمت میں حاضر ہوا اور آپ سے یہ واقعہ بیان کیا لیکن میں نے آنحضرت صلی اللہ علیہ وسلم کے چہرہ مبارک پر اس کی وجہ سے ناراضی کے آثار دیکھے ۔ آپ نے فرمایا تم دونوں اچھا پڑھتے ہو ۔ آپس میں اختلاف نہ کیا کرو ۔ تم سے پہلے لوگ اسی قسم کے جھگڑوں سے تباہ ہو گئے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 143,
        "matchingArabicURN": 172600,
        "last_updated": null
    },
    {
        "urduURN": 4034340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3477,
        "hadithSanad": "ہم سے عمر بن حفص نے بیان کیا ، کہا ہم سے میرے باپ حفص بن غیاث نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا کہ کہ مجھ سے شقیق بن سلمہ نے بیان کیا کہ",
        "hadithText": "عبداللہ بن مسعود رضی اللہ عنہما نے کہا میں گویا نبی کریم صلی اللہ علیہ وسلم کو اس وقت دیکھ رہا ہوں ۔ آپ بنی اسرائیل کے ایک نبی کا واقعہ بیان کر رہے تھے کہ ان کی قوم نے انہیں مارا اور خون آلود کر دیا ۔ لیکن وہ نبی خون صاف کرتے جاتے اور یہ دعا کرتے کہ اے اللہ ! میری قوم کی مغفرت فرما ۔ یہ لوگ جانتے نہیں ہیں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 144,
        "matchingArabicURN": 172610,
        "last_updated": null
    },
    {
        "urduURN": 4034350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3478,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا ہم سے ابو عوانہ نے بیان کیا ، ان سے قتادہ نے ان سے عقبہ بن عبدالغافر نے ان سے ابو سعید خدری رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے کہ",
        "hadithText": "گزشتہ امتوں میں ایک آدمی کو اللہ تعالیٰ نے خوب دولت دی تھی ۔ جب اس کی موت کا وقت آیا تو اس نے اپنے بیٹوں سے پوچھا میں تمہارے حق میں کیسا باپ ثابت ہوا ؟ بیٹوں نے کہا کہ آپ ہمارے بہترین باپ تھے ۔ اس شخص نے کہا لیکن میں نے عمر بھر کوئی نیک کام نہیں کیا ۔ اس لئے جب میں مر جاؤں تو مجھے جلا ڈالنا ، پھر میری ہڈیوں کو پیس ڈالنا اور ( راکھ کو ) کسی سخت آندھی کے دن ہوا میں اڑا دینا ۔ بیٹوں نے ایسا ہی کیا ۔ لیکن اللہ پاک نے اسے جمع کیا اور پوچھا کہ تو نے ایسا کیوں کیا ؟ اس شخص نے عرض کیا کہ پروردگار تیرے ہی خوف سے چنانچہ اللہ تعالیٰ نے اسے اپنے سایہ رحمت میں جگہ دی ۔ اس حدیث کو معاذ عنبری نے بیان کیا کہ ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے ، انہوں نے عقبہ بن عبدالغافر سے سنا ، انہوں نے ابو سعید خدری رضی اللہ عنہ سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 145,
        "matchingArabicURN": 172621,
        "last_updated": null
    },
    {
        "urduURN": 4034360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3479,
        "hadithSanad": "ہم سے مسدد نے بیان کیا کہا ، ہم سے ابوعوانہ نے ان سے عبدالملک بن عمیر نے ، ان سے ربعی بن حراش نے بیان کیا کہ عقبہ بن عمرو ابومسعود انصاری نے حذیفہ رضی اللہ عنہ سے کہا کہ",
        "hadithText": "آپ نے نبی کریم صلی اللہ علیہ وسلم سے جو حدیثیں سنی ہیں وہ آپ ہم سے کیوں بیان نہیں کرتے ؟ حذیفہ رضی اللہ عنہ نے بیان کیا کہ میں نے آنحضرت صلی اللہ علیہ وسلم کو یہ کہتے سنا تھا کہ ایک شخص کی موت کا وقت جب قریب ہوا اور وہ زندگی سے بالکل ناامید ہو گیا تو اپنے گھر والوں کو وصیت کی کہ جب میری موت ہو جائے تو پہلے میرے لئے بہت سی لکڑیاں جمع کرنا اور اس سے آگ جلانا ۔ جب آگ میرے جسم کو خاکستر بنا چکے اور صرف ہڈیاں باقی رہ جائیں تو ہڈیوں کو پیس لینا اور کسی سخت گرمی کے دن میں یا ( یوں فرمایا کہ ) سخت ہوا کے دن مجھ کو ہوا میں اڑا دینا لیکن اللہ تعالیٰ نے اسے جمع کیا اور پوچھا کہ تو نے ایسا کیوں کیا تھا ؟ اس نے کہا کہ تیرے ہی ڈر سے ۔ آخر اللہ تعالیٰ نے اس کو بخش دیا ۔ عقبہ رضی اللہ عنہ نے کہا کہ میں نے بھی آنحضرت صلی اللہ علیہ وسلم کو فرماتے ہوئے یہ حدیث سنی ہے ۔ ہم سے موسیٰ نے بیان کیا کہا ہم سے ابوعوانہ نے بیان کیا کہا ہم سے عبدالملک نے بیان کیا اور کہا کہ اس روایت میں فی یوم راح ہے ( سوا شک کے ) اس کے معنی بھی کسی تیز ہوا کے دن کے ہیں ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 146,
        "matchingArabicURN": 172640,
        "last_updated": null
    },
    {
        "urduURN": 4034370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3480,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ان سے ابن شہاب نے ان سے عبیداللہ بن عباللہ بن عتبہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ایک شخص لوگوں کو قرض دیا کرتا تھا اور اپنے نوکروں کو اس نے یہ کہہ رکھا تھا کہ جب تم کسی کو مفلس پاؤ ( جو میرا قرض دار ہو ) تو اسے معاف کر دیا کرو ۔ ممکن ہے اللہ تعالیٰ بھی ہمیں معاف فرما دے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب وہ اللہ تعالیٰ سے ملا تو اللہ نے اسے بخش دیا ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 147,
        "matchingArabicURN": 172650,
        "last_updated": null
    },
    {
        "urduURN": 4034380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3481,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا کہا ہم سے ہشام نے بیان کیا کہا ہم کو معمر نے خبر دی ، انہیں زہری نے انہیں حمید بن عبدالرحمان نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ایک شخص بہت گناہ کیا کرتا تھا جب اس کی موت کا وقت قریب آیا تو اپنے بیٹوں سے اس نے کہا کہ جب میں مر جاؤں تو مجھے جلا ڈالنا پھر میری ہڈیوں کو پیس کر ہوا میں اڑا دینا اللہ کی قسم ! اگر میرے رب نے مجھے پکڑ لیا تو مجھے اتنا سخت عذاب کرے گا جو پہلے کسی کو بھی اس نے نہیں کیا ہو گا ۔ جب وہ مر گیا تو ( اس کی وصیت کے مطابق ) اس کے ساتھ ایسا ہی کیا گیا ۔ اللہ تعالیٰ نے زمین کو حکم فرمایا کہ اگر ایک ذرہ بھی کہیں اس کے جسم کا تیرے پاس ہے تو اسے جمع کر کے لا ۔ زمین حکم بجا لائی اور وہ بندہ اب ( اپنے رب کے سامنے ) کھڑا ہوا تھا ۔ اللہ تعالیٰ نے دریافت فرمایا تو نے ایسا کیوں کیا ؟ اس نے عرض کیا اے رب ! تیرے ڈر کی وجہ سے ۔ آخر اللہ تعالیٰ نے اس کی مغفرت کر دی ۔ ابوہریرہ رضی اللہ عنہ کے سوا دوسرے صحابہ نے اس حدیث میں لفظخشیتک کے بدل مخافتک کہا ہے ( دونوں لفظوں کا مطلب ایک ہی ہے ) ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 148,
        "matchingArabicURN": 172660,
        "last_updated": null
    },
    {
        "urduURN": 4034390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3482,
        "hadithSanad": "مجھ سے عبداللہ بن محمد بن اسماء نے بیان کیا کہا ہم سے جویریہ بن اسماء نے بیان کیا ، ان سے نافع نے ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ",
        "hadithText": "( بنی اسرائیل کی ) ایک عورت کو ایک بلی کی وجہ سے عذاب دیا گیا تھا جسے اس نے قید کر رکھا تھا جس سے وہ بلی مر گئی تھی اور اس کی سزا میں وہ عورت دوزخ میں گئی ۔ جب وہ عورت بلی کو باندھے ہوئے تھی تو اس نے اسے کھانے کے لئے کوئی چیز نہ دی ، نہ پینے کے لئے اور نہ اس نے بلی کو چھوڑا ہی کہ وہ زمین کے کیڑے مکوڑے ہی کھا لیتی ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 149,
        "matchingArabicURN": 172670,
        "last_updated": null
    },
    {
        "urduURN": 4034400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3483,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، ان سے زہیر نے کہا ہم سے منصور نے بیان کیا ان سے ربعی بن حراش نے کہا ہم سے ابومسعود عقبہ بن عمرو رضی اللہ عنہ نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا لوگوں نے اگلے پیغمبروں کے کلام جو پائے ان میں یہ بھی ہے کہ جب تجھ میں حیاء نہ ہو تو پھر جو جی چاہے کر ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 150,
        "matchingArabicURN": 172680,
        "last_updated": null
    },
    {
        "urduURN": 4034410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3484,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ان سے منصور نے باین کیا انہوں نے کہا میں نے ربعی بن حراش سے سنا وہ ابومسعود انصاری رضی اللہ عنہ سے روایت کرتے تھے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اگلے پیغمبروں کے کلام میں سے لوگوں نے جو پایا یہ بھی ہے کہ جب تجھ میں حیاء نہ ہو پھر جو جی چاہے کر ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 151,
        "matchingArabicURN": 172690,
        "last_updated": null
    },
    {
        "urduURN": 4034420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3485,
        "hadithSanad": "ہم سے بشر بن محمد نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو یونس نے خبر دی ، انہیں زہری نے ، انہیں سالم نے خبر دی اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ایک شخص تکبر کی وجہ سے اپنا تہبند زمین سے گھسیٹتا ہوا جا رہا تھا کہا سے زمین میں دھنسا دیا اور اب وہ قیامت تک یوں ہی زمین میں دھنستا چلا جائے گا ۔ یونس کے ساتھ اس حدیث کو عبدالرحمٰن بن خالد نے بھی زہری سے روایت کیا ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 152,
        "matchingArabicURN": 172700,
        "last_updated": null
    },
    {
        "urduURN": 4034430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3486,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا کہا ہم سے وہیب نے بیان کیا کہا مجھ سے عبداللہ بن طاؤس نے بیان کیا ان سے ان کے والد نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا",
        "hadithText": "ہم ( دنیا میں ) تمام امتوں کے آخر میں آئے لیکن ( قیامت کے دن ) تمام امتوں سے آگے ہوں گے ۔ صرف اتنا فرق ہے کہ انہیں پہلے کتاب دی گئی اور ہمیں بعد میں ملی اور یہی وہ ( جمعہ کا ) دن ہے جس کے بارے یں لوگوں نے اختلاف کیا ۔ یہودیوں نے تو اسے اس کے دوسرے دن ( ہفتہ کو ) کر لیا اور نصاریٰ نے تیسرے دن ( اتوار کو ) ۔ \nپس ہر مسلمان کو ہفتے میں ایک دن ( یعنی جمعہ کے دن ) تو اسے جسم اور سر کو دھو لینا لازم ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 153,
        "matchingArabicURN": 172711,
        "last_updated": null
    },
    {
        "urduURN": 4034450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 60,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3488,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ان سے عمرو بن مرہ نے کہا کہ میں نے سعید بن مسیب سے سنا آپ نے بیان کیا کہ",
        "hadithText": "معاویہ بن ابی سفیان رضی اللہ عنہ نے مدینہ کے اپنے آخری سفر میں ہمیں خطاب فرمایا اور ( خطبہ کے دوران ) آپ نے بالوں کا ایک گچھا نکالا اور فرمایا ، میں سمجھتا ہوں کہ یہودیوں کے سوا اور کوئی اس طرح نہ کرتا ہو گا اور نبی کریم صلی اللہ علیہ وسلم نے اس طرح بال سنوارنے کا نام الزور ( فریب و جھوٹ ) رکھا ہے ۔ آپ کی مراد وصال فی الشعر سے تھی ۔ یعنی بالوں میں جوڑ لگانے سے تھی ( جیسے اکثر عورتیں مصنوعی بالوں میں جوڑ کیا کرتی ہیں ) آدم کے ساتھ اس حدیث کو غندر نے بھی شعبہ سے روایت کیا ہے ۔</b>",
        "bookID": "60.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 154,
        "matchingArabicURN": 172730,
        "last_updated": null
    }
]