[
    {
        "urduURN": 4034460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3489,
        "hadithSanad": "ہم سے خالد بن یزید الکاہلی نے بیان کیا ، کہا ہم سے ابوبکر بن عیاش نے بیان کیا ، ان سے ابوحصین ( عثمان بن عاصم ) نے ، ان سے سعید بن جبیر نے",
        "hadithText": "اور ان سے ابن عباس رضی اللہ عنہما نے آیت » وجعلنا کم شعوباً وّ قبائل لتعارفوا« کے متعلق فرمایا کہ شعوب بڑے قبیلوں کے معنی میں ہے اور قبائل سے کسی بڑے قبیلے کی شاخیں مراد ہیں ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 131190,
        "last_updated": null
    },
    {
        "urduURN": 4034470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3490,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے عبیداللہ نے بیان کیا ، ان سے سعید بن ابی سعید نے بیان کیا ، ان سے ان کے باپ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک مرتبہ پوچھا گیا ، یا رسول اللہ ! سب سے زیادہ شریف کون ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جو سب سے زیادہ پرہیزگار ہو ، صحابہ نے عرض کیا کہ ہمارا سوال اس کے بارے میں نہیں ہے ، اس پر آپ نے فرمایا کہ پھر ( نسب کی روسے ) اللہ کے نبی یوسف علیہ السلام سب سے زیادہ شریف تھے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 131200,
        "last_updated": null
    },
    {
        "urduURN": 4034480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3491,
        "hadithSanad": "ہم سے قیس بن حفص نے بیان کیا ، کہا ہم سے عبدالواحد بن زیاد نے بیان کیا ، ان سے کلیب بن وائل نے بیان کیا ، کہا کہ",
        "hadithText": "مجھ سے زینب بنت ابی سلمہ رضی اللہ عنہا نے بیان کیا جو نبی کریم صلی اللہ علیہ وسلم کی زیر پرورش رہ چکی تھیں ، کلیب نے بیان کیا کہ ہمیں نے زینب سے پوچھا : کہ نبی کریم صلی اللہ علیہ وسلم کا تعلق قبیلہ مضر سے تھا ؟ انہوں نے کہا پھر کس قبیلہ سے تھا ؟ یقیناً آنحضرت صلی اللہ علیہ وسلم قبیلہ مضر کی شاخ بنی نضر بن کنانہ کی اولاد میں سے تھے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 131210,
        "last_updated": null
    },
    {
        "urduURN": 4034490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3492,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، ان سے عبدالواحد نے ، کہا ہم سے کلیب نے بیان کیا ، اور ان سے ربیبہ نبی کریم صلی اللہ علیہ وسلم نے ، میرا خیال ہے کہ ان سے مراد زینب بنت ابی سلمہ رضی اللہ عنہا ہیں ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے دباء ، حنتم ، نقیر اور مزفت کے استعمال سے منع فرمایا تھا اور میں نے ان سے پوچھا تھا کہ آپ مجھے بتائیے کہ آنحضرت صلی اللہ علیہ وسلم کا تعلق کس قبیلہ سے تھا ؟ کیا واقعی آپ کا تعلق مضر سے تھا ؟ انہوں نے کہا پھر اور کس سے ہو سکتا ہے یقیناً آپ کا تعلق اسی قبیلہ سے تھا ۔ آپ نضر بن کنانہ کی اولاد میں سے تھے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 131220,
        "last_updated": null
    },
    {
        "urduURN": 4034500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3493,
        "hadithSanad": "ہم سے اسحٰق بن ابراہیم نے بیان کیا ، کہا ہم کو جریر نے خبر دی ، انہیں عمارہ نے ، انہیں ابوزرعہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، تم انسانوں کو کان کی طرح پاؤ گے ( بھلائی اور برائی میں ) جو لوگ جاہلیت کے زمانے میں بہتر اور اچھی صفات کے مالک تھے وہ اسلام لانے کے بعد بھی بہتر اور اچھی صفات والے ہیں بشرطیکہ وہ دین کا علم بھی حاصل کریں اور حکومت اور سرداری کے لائق اس کو پاؤ گے جو حکومت اور سرداری کو بہت ناپسند کرتا ہو ۔ \nاور آدمیوں میں سب سے برا اس کو پاؤ گے جو دورخہ ( دوغلا ) ہو ۔ ان لوگوں میں ایک منہ لے کر آئے ، دوسروں میں دوسرا منہ ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 131231,
        "last_updated": null
    },
    {
        "urduURN": 4034520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3495,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے مغیرہ بن عبدالرحمٰن نے بیان کیا ، ان سے ابوالزناد نے ، ان سے اعرج نے اور ا ن سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اس ( خلافت کے ) معاملے میں لوگ قریش کے تابع ہیں ، عام مسلمان قریشی مسلمانوں کے تابع ہیں جس طرح ان کے عام کفار قریشی کفار کے تابع رہتے چلے آئے ہیں ۔ \nاور انسانوں کی مثال کان کی طرح ہے ، جو لوگ جاہلیت کے دور میں شریف تھے وہ اسلام لانے کے بعد بھی شریف ہیں جب کہ انہوں نے دین کی سمجھ بھی حاصل کی ہو تم دیکھو گے کہ بہترین اور لائق وہی ثابت ہوں گے جو خلافت و امارت کے عہدے کو بہت زیادہ ناپسند کرتے رہے ہوں ، یہاں تک کہ وہ اس میں گرفتار ہو جائیں ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 131250,
        "last_updated": null
    },
    {
        "urduURN": 4034540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3497,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے شعبہ نے ، ان سے عبدالملک نے بیان کیا ، ان سے طاوس نے",
        "hadithText": "ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا ” الا المودۃ فی القربیٰ “ کے متعلق ( طاوس نے ) بیان کیا کہ قریش کی کوئی شاخ ایسی نہیں تھی جس میں آنحضرت صلی اللہ علیہ وسلم کی قرابت نہ رہی ہو اور اسی وجہ سے یہ آیت نازل ہوئی تھی کہ میرا مطالبہ صرف یہ ہے کہ تم لوگ میری اور اپنی قرابت داری کا لحاظ کرو ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 131260,
        "last_updated": null
    },
    {
        "urduURN": 4034550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3498,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، انہوں نے کہا : ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے اسماعیل نے ، ان سے قیس نے اور ان سے ابومسعود رضی اللہ عنہ نے بیان کیا ، اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا کہ",
        "hadithText": "آپ نے فرمایا اسی طرف سے فتنے اٹھیں گے یعنی مشرق سے اور بےوفائی اور سخت دلی ان لوگوں میں ہے جو اونٹوں اور گایوں کی دم کے پاس چلاتے رہتے ہیں یعنی ربیعہ اور مضر کے لوگوں میں ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 131270,
        "last_updated": null
    },
    {
        "urduURN": 4034560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3499,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہیں ابوسلمہ بن عبدالرحمٰن نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے کہ فخر اور تکبر ان چیخنے اور شور مچانے والے اونٹ والوں میں ہے اور بکری چرانے والوں میں نرم دلی اور ملائمت ہوتی ہے اور ایمان تو یمن میں ہے حکمت ( حدیث ) بھی یمنی ہے ، ابوعبداللہ یعنی امام بخاری رحمہ اللہ نے کہا کہ یمن کا نام یمن اس لیے ہوا کہ یہ کعبہ کے دائیں جانب ہے اور شام کو شام اس لیے کہتے ہیں کہ یہ کعبہ کے بائیں جانب ہے ” المشامۃ “بائیں جانب کو کہتے ہیں ، بائیں ہاتھ کو ” الشؤمی “ کہتے ہیں اور بائیں جانب کو ” الاشام “ کہتے ہیں ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 131280,
        "last_updated": null
    },
    {
        "urduURN": 4034570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3500,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا کہ محمد بن جبیر بن مطعم بیان کرتے تھے کہ",
        "hadithText": "حضرت معاویہ رضی اللہ عنہ تک یہ بات پہنچی جب وہ قریش کی ایک جماعت میں تھے کہ عبداللہ بن عمرو بن عاص رضی اللہ عنہما یہ حدیث بیان کرتے ہیں کہ عنقریب ( قرب قیامت میں ) بنی قحطان سے ایک حکمراں اٹھے گا ۔ یہ سن کر حضرت معاویہ رضی اللہ عنہ غصہ ہو گئے ، پھر آپ خطبہ دینے اٹھے اور اللہ تعالیٰ کی اس کی شان کے مطابق حمد و ثنا کے بعد فرمایا : لوگو ! مجھے معلوم ہوا ہے کہ بعض لوگ ایسی احادیث بیان کرتے ہیں جو نہ تو قرآن مجید میں موجود ہیں اور نہ رسول اللہ صلی اللہ علیہ وسلم سے منقول ہیں ، دیکھو ! تم میں سب سے جاہل یہی لوگ ہیں ، ان سے اور ان کے خیالات سے بچتے رہو جن خیالات نے ان کو گمراہ کر دیا ہے ۔ میں نے نبی کریم صلی اللہ علیہ وسلم سے یہ سنا ہے کہ یہ خلافت قریش میں رہے گی اور جو بھی ان سے دشمنی کرے گا اللہ تعالیٰ اس کو سرنگوں اور اوندھا کر دے گا جب تک وہ ( قریش ) دین کو قائم رکھیں گے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 131290,
        "last_updated": null
    },
    {
        "urduURN": 4034580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3501,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا ہم سے عاصم بن محمد نے بیان کیا ، کہا کہ میں نے اپنے والد سے سنا اور انہوں نے ابن عمر رضی اللہ عنہما سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، یہ خلافت اس وقت تک قریش کے ہاتھوں میں باقی رہے گی جب تک کہ ان میں دو آدمی بھی باقی رہیں ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 131300,
        "last_updated": null
    },
    {
        "urduURN": 4034590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3502,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے ابن مسیب نے اور ان سے جبیر بن مطعم نے بیان کیا کہ",
        "hadithText": "میں اور عثمان بن عفان رضی اللہ عنہما دونوں مل کر آنحضرت صلی اللہ علیہ وسلم کے پاس گئے اور ہم نے عرض کیا یا رسول اللہ صلی اللہ علیہ وسلم ! بنو مطلب کو تو آپ نے عطا فرمایا اور ہمیں ( بنی امیہ کو ) نظرانداز کر دیا حالانکہ آپ کے لیے ہم اور وہ ایک ہی درجے کے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ( یہ صحیح ہے ) مگر بنو ہاشم اور بنو مطلب ایک ہی ہیں ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 131310,
        "last_updated": null
    },
    {
        "urduURN": 4034600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3503,
        "hadithSanad": "اور لیث نے بیان کیا کہ مجھ سے ابوالاسود محمد نے بیان کیا اور ان سے عروہ بن زبیر نے بیان کیا کہ",
        "hadithText": "عبداللہ بن زبیر رضی اللہ عنہما بنی زہرہ کے چند لوگوں کے ساتھ حضرت عائشہ رضی اللہ عنہا کے پاس گئے حضرت عائشہ رضی اللہ عنہا بنی زہرہ کے ساتھ بہت اچھی طرح پیش آتی تھیں کیونکہ ان لوگوں کی رسول اللہ صلی اللہ علیہ وسلم سے قرابت تھی ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 131320,
        "last_updated": null
    },
    {
        "urduURN": 4034610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3504,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، انہوں نے کہا ہم سے سفیان نے بیان کیا اور ان سے سعد بن ابراہیم نے ( دوسری سند ) یعقوب بن ابراہیم نے کہا کہ ہمارے والد نے ہم سے بیان کیا اور ان سے ان کے والد نے ، کہا مجھ سے عبدالرحمٰن بن ہرمز الاعرج نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، قریش ، انصار ، جہینہ ، مزینہ ، اسلم ، اشجع اور غفار ان سب قبیلوں کے لوگ میرے خیرخواہ ہیں اور ان کا بھی اللہ اور اس کے رسول کے سوا کوئی حمایتی نہیں ہے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 131330,
        "last_updated": null
    },
    {
        "urduURN": 4034620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3505,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم سے لیث بن سعد نے ، کہا کہ مجھ سے ابوالاسود نے ، ان سے عروہ بن زبیر نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ کے بعد عبداللہ بن زبیر رضی اللہ عنہما سے عائشہ رضی اللہ عنہا کو سب سے زیادہ محبت تھی ۔ حضرت عائشہ رضی اللہ عنہا کی عادت تھی کہ اللہ تعالیٰ کی طرف سے جو رزق بھی ان کو ملتا وہ اسے صدقہ کر دیا کرتی تھیں ، عبداللہ بن زبیر رضی اللہ عنہما نے ( کسی سے ) کہا ام المؤمنین کو اس سے روکنا چاہیے ( جب حضرت عائشہ رضی اللہ عنہا کو ان کی بات پہنچی ) تو انہوں نے کہا ، کیا اب میرے ہاتھوں کو روکا جائے گا ، اب اگر میں نے عبداللہ سے بات کی تو مجھ پر نذر واجب ہے ۔ عبداللہ بن زبیر رضی اللہ عنہما نے ( حضرت عائشہ رضی اللہ عنہا کو راضی کرنے کے لیے ) قریش کے چند لوگوں اور خاص طور سے رسول اللہ صلی اللہ علیہ وسلم کے نانہالی رشتہ داروں ( بنوزہرہ ) کو ان کی خدمت میں معافی کی سفارش کے لیے بھیجا لیکن حضرت عائشہ رضی اللہ عنہا پھر بھی نہ مانیں ۔ اس پر بنو زہرہ نے جو رسول اللہ صلی اللہ علیہ وسلم کے ماموں ہوتے تھے اور ان میں عبدالرحمٰن بن اسود بن عبدیغوث اور مسور بن مخرمہ رضی اللہ عنہ بھی تھے ، عبداللہ بن زبیر رضی اللہ عنہما سے کہا کہ جب ہم ان کی اجازت سے وہاں جا بیٹھیں تو تم ایک دفعہ آن کر پردہ میں گھس جاؤ ۔ چنانچہ انہوں نے ایسا ہی کیا ( جب حضرت عائشہ رضی اللہ عنہا خوش ہو گئیں تو ) انہوں نے ان کی خدمت میں دس غلام ( آزاد کرانے کے لیے بطور کفارہ قسم ) بھیجے اور ام المؤمنین نے انہیں آزاد کر دیا ۔ پھر آپ برابر غلام آزاد کرتی رہیں ۔ یہاں تک کہ چالیس غلام آزاد کر دیئے پھر انہوں نے کہا کاش میں نے جس وقت قسم کھائی تھی ( منت مانی تھی ) تو میں کوئی خاص چیز بیان کر دیتی جس کو کر کے میں فارغ ہو جاتی ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 131340,
        "last_updated": null
    },
    {
        "urduURN": 4034630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3506,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے ابن شہاب نے اور ان سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "حضرت عثمان رضی اللہ عنہ نے زید بن ثابت ، عبداللہ بن زبیر ، سعید بن عاص اور عبدالرحمٰن بن حارث بن ہشام رضی اللہ عنہم کو بلایا ( اور ان کو قرآن مجید کی کتابت پر مقرر فرمایا ، چنانچہ ان حضرات نے ) قرآن مجید کو کئی مصحفوں میں نقل فرمایا اور حضرت عثمان رضی اللہ عنہ نے ( ان چاروں میں سے ) تین قریشی صحابہ سے فرمایا تھا کہ جب آپ لوگوں کا زید بن ثابت رضی اللہ عنہ سے ( جو مدینہ منورہ کے رہنے والے تھے ) قرآن کے کسی مقام پر ( اس کے کسی محاورے میں ) اختلاف ہو جائے تو اس کو قریش کے محاورے کے مطابق لکھنا ، کیونکہ قرآن شریف قریش کے محاورہ میں نازل ہوا ہے ۔ انہوں نے ایسا ہی کیا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 131350,
        "last_updated": null
    },
    {
        "urduURN": 4034640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3507,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے یزید بن ابی عبید نے اور ان سے سلمہ بن اکوع رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم قبیلہ اسلم کے صحابہ کی طرف سے گزرے جو بازار میں تیراندازی کر رہے تھے تو آپ نے فرمایا : اے اولاد اسماعیل ! خوب تیراندازی کرو کہ تمہارے باپ حضرت اسماعیل علیہ السلام بھی تیرانداز تھے اور آپ نے فرمایا میں فلاں جماعت کے ساتھ ہوں ، یہ سن کر دوسری جماعت والوں نے ہاتھ روک لیے تو آپ نے دریافت فرمایا کہ کیابات ہوئی ؟ انہوں نے عرض کیا کہ جب آپ دوسرے فریق کے ساتھ ہو گئے تو پھر ہم کیسے تیراندازی کریں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم تیراندازی جاری رکھو ۔ میں تم سب کے ساتھ ہوں ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 131360,
        "last_updated": null
    },
    {
        "urduURN": 4034650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3508,
        "hadithSanad": "ہم سے ابومعمر نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، ان سے حسین بن واقد نے ، ان سے عبداللہ بن بریدہ نے بیان کیا ، کہا مجھ سے یحییٰ بن یعمر نے بیان کیا ، ان سے ابوالاسود دیلی نے بیان کیا اور ان سے ابوذر رضی اللہ عنہ نے کہ",
        "hadithText": "انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے کہ جس شخص نے بھی جان بوجھ کر اپنے باپ کے سوا کسی اور کو اپنا باپ بنایا تو اس نے کفر کیا اور جس شخص نے بھی اپنا نسب کسی ایسی قوم سے ملایا جس سے اس کا کوئی ( نسبی ) تعلق نہیں ہے تو وہ اپنا ٹھکانا جہنم میں بنا لے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 131370,
        "last_updated": null
    },
    {
        "urduURN": 4034660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3509,
        "hadithSanad": "ہم سے علی بن عیاش نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، کہا کہ مجھ سے عبدالواحد بن عبداللہ نصری نے بیان کیا ، کہا کہ میں نے واثلہ بن اسقع رضی اللہ عنہ سے سنا ، وہ بیان کرتے تھے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، سب سے بڑا بہتان اور سخت جھوٹ یہ ہے کہ آدمی اپنے باپ کے سوا کسی اور کو اپنا باپ کہے یا جو چیز اس نے خواب میں نہیں دیکھی ۔ اس کے دیکھنے کا دعویٰ کرے ۔ یا رسول اللہ صلی اللہ علیہ وسلم کی طرف ایسی حدیث منسوب کرے جو آپ نے نہ فرمائی ہو ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 131380,
        "last_updated": null
    },
    {
        "urduURN": 4034670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3510,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے حماد نے بیان کیا ، ان سے ابوجمرہ نے بیان کیا ، کہا کہ میں نے عبداللہ بن عباس رضی اللہ عنہما سے سنا وہ کہتے تھے کہ",
        "hadithText": "قبیلہ عبدالقیس کا وفد رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آیا اور اس نے عرض کیا ، یا رسول اللہ ! ہمارا تعلق قبیلہ ربیعہ سے ہے اور ہمارے اور آپ کے درمیان ( راستے میں ) کفار مضر کا قبیلہ پڑتا ہے ، اس لیے ہم آپ کی خدمت اقدس میں صرف حرمت کے مہینوں میں ہی حاضر ہو سکتے ہیں ۔ مناسب ہوتا اگر آپ ہمیں ایسے احکام بتلا دیتے جن پر ہم خود بھی مضبوطی سے قائم رہتے اور جو لوگ ہمارے پیچھے رہ گئے ہیں انہیں بھی بتا دیتے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں تمہیں چار چیزوں کا حکم دیتا ہوں اور چار چیزوں سے روکتا ہوں ، اول اللہ پر ایمان لانے کا ، یعنی اس کی گواہی دینا کہ اللہ تعالیٰ کے سوا اور کوئی معبود نہیں اور نماز قائم کرنے کا اور زکوٰۃ ادا کرنے کا اور اس بات کا کہ جو کچھ بھی تمہیں مال غنیمت ملے اس میں سے پانچواں حصہ اللہ کو ( یعنی امام وقت کے بیت المال کو ) ادا کرو اور میں تمہیں دباء ، حنتم ، نقیر اور مزفت ( کے استعمال ) سے منع کرتا ہوں ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 131390,
        "last_updated": null
    },
    {
        "urduURN": 4034680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3511,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ، ان سے سالم بن عبداللہ نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نے رسول کریم صلی اللہ علیہ وسلم سے سنا ، آپ منبر پر فرما رہے تھے ، آگاہ ہو جاؤ اس طرف سے فساد پھوٹے گا ۔ آپ نے مشرق کی طرف اشارہ کر کے یہ جملہ فرمایا ، جدھر سے شیطان کا سینگ طلوع ہوتا ہے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 131400,
        "last_updated": null
    },
    {
        "urduURN": 4034690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3512,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے سعد بن ابراہیم نے ، ان سے عبدالرحمٰن بن ہرمز اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، قریش ، انصار ، جہینہ ، مزینہ ، اسلم ، غفار اور اشجع میرے خیرخواہ ہیں ، اور اللہ اور اس کے رسول کے سوا اور کوئی ان کا حمایتی نہیں ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 131410,
        "last_updated": null
    },
    {
        "urduURN": 4034700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3513,
        "hadithSanad": "ہم سے محمد بن غریر زہری نے بیان کیا ، انہوں نے کہا ہم سے یعقوب بن ابراہیم نے بیان کیا ، ان سے ان کے والد نے ، ان سے صالح نے ، ان سے نافع نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے منبر پر فرمایا ، قبیلہ غفار کی اللہ تعالیٰ نے مغفرت فرما دی اور قبیلہ اسلم کو اللہ تعالیٰ نے سلامت رکھا اور قبیلہ عصیہ نے اللہ تعالیٰ کی اور اس کے رسول کی نافرمانی کی ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 131420,
        "last_updated": null
    },
    {
        "urduURN": 4034710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3514,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو عبدالوہاب ثقفی نے خبر دی ، انہیں ایوب نے ، انہیں محمد نے ، انہیں ابوہریرہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے بیان کیا کہ",
        "hadithText": "قبیلہ اسلم کو اللہ تعالیٰ نے سلامت رکھا اور قبیلہ غفار کی اللہ تعالیٰ نے مغفرت فرما دی ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 131430,
        "last_updated": null
    },
    {
        "urduURN": 4034720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3515,
        "hadithSanad": "ہم سے قبیصہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ( دوسری سند ) امام بخاری رحمہ اللہ نے کہا اور مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے عبدالرحمٰن بن مہدی نے بیان کیا ، ان سے سفیان نے ، ان سے عبدالملک بن عمیرنے ، ان سے عبدالرحمٰن بن ابی بکرہ نے اور ان سے ان کے والد ابوبکرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا",
        "hadithText": "بتاو کیا جہینہ ، مزینہ ، اسلم اور غفار کے قبیلے بنی تمیم ، بنی اسد ، بنی عبداللہ بن غطفان اور بنی عامر بن صعصعہ کے مقابلے میں بہتر ہیں ؟ ایک شخص ( اقرع بن حابس ) نے کہا کہ وہ تو تباہ و برباد ہوئے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں یہ چاروں قبیلے بنوتمیم ، بنو اسد ، بنو عبداللہ بن غطفان اور بنو عامر بن صعصعہ کے قبیلوں سے بہتر ہیں ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 131440,
        "last_updated": null
    },
    {
        "urduURN": 4034730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3516,
        "hadithSanad": "مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے محمد بن ابی یعقوب نے بیان کیا ، انہوں نے عبدالرحمٰن بن ابی بکرہ سے سنا ، انہوں نے اپنے والد سے کہ",
        "hadithText": "اقرع بن حابس رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے عرض کیا کہ آپ سے ان لوگوں نے بیعت کی ہے کہ جو حاجیوں کا سامان چرایا کرتے تھے یعنی اسلم اور غفار اور مزینہ کے لوگ ، محمد بن ابی یعقوب نے کہا کہ میں سمجھتا ہوں عبدالرحمٰن نے جہینہ کا بھی ذکر کیا ، شعبہ نے کہا کہ یہ شک محمد بن ابی یعقوب کو ہوا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا : بتلاو اسلم ، غفار ، مزینہ ، اور میں سمجھتا ہوں کہ جہینہ کو بھی کہا یہ چاروں قبیلے بنی تمیم ، بنی عامر اور اسد اور غطفان سے بہتر نہیں ہیں ؟ کیا یہ ( مؤخرالذکر ) خراب اور برباد نہیں ہوئے ؟ اقرع نے کہا : ہاں ، آپ نے فرمایا : قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے ! یہ ان سے بہتر ہیں ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 131450,
        "last_updated": null
    },
    {
        "urduURN": 4034750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3517,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا ، کہا کہ مجھ سے سلیمان بن بلال نے بیان کیا ، ان سے ثور بن زید نے ، ان سے ابولغیث نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، کہ قیامت اس وقت تک قائم نہیں ہو گی جب تک کہ قبیلہ قحطان میں ایک ایسا شخص پیدا نہیں ہو گا جو لوگوں پر اپنی لاٹھی کے زور سے حکومت کرے گا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 131460,
        "last_updated": null
    },
    {
        "urduURN": 4034760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3518,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو مخلد بن یزید نے خبر دی ، کہا ہمیں ابن جریج نے خبر دی ، کہا کہ مجھے عمرو بن دینار نے خبر دی اور انہوں نے جابر رضی اللہ عنہ سے سنا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ جہاد میں شریک تھے ، مہاجرین بڑی تعداد میں آپ کے پاس جمع ہو گئے ۔ وجہ یہ ہوئی کہ مہاجرین میں ایک صاحب تھے بڑے دل لگی کرنے والے ، انہوں نے ایک انصاری کے سرین پر ضرب لگائی ، انصاری بہت سخت غصہ ہوا ، اس نے اپنی برادری والوں کو مدد کے لیے پکارا اور نوبت یہاں تک پہنچی کہ ان لوگوں نے یعنی انصاری نے کہا : اے قبائل انصار ! مدد کو پہنچو ! اور مہاجر نے کہا : اے مہاجرین ! مدد کو پہنچو ! یہ غل سن کر نبی کریم صلی اللہ علیہ وسلم ( خیمہ سے ) باہر تشریف لائے اور فرمایا : کیا بات ہے ؟ یہ جاہلیت کی پکار کیسی ہے ؟ آپ کے صورت حال دریافت کرنے پر مہاجر صحابی کے انصاری صحابی کو مار دینے کا واقعہ بیان کیا گیا تو آپ نے فرمایا : ایسی جاہلیت کی ناپاک باتیں چھوڑ دو اور عبداللہ بن ابی سلول ( منافق ) نے کہا کہ یہ مہاجرین اب ہمارے خلاف اپنی قوم والوں کی دہائی دینے لگے ۔ مدینہ پہنچ کر ہم سمجھ لیں گے ، عزت دار ذلیل کو یقیناً نکال باہر کر دے گا ۔ حضرت عمر رضی اللہ عنہ نے اجازت چاہی یا رسول اللہ صلی اللہ علیہ وسلم ! ہم اس ناپاک پلید عبداللہ بن ابی کو قتل کیوں نہ کر دیں ؟ لیکن آپ نے فرمایا : ایسا نہ ہونا چاہیے کہ لوگ کہیں کہ محمد ( صلی اللہ علیہ وسلم ) اپنے لوگوں کو قتل کر دیا کرتے ہیں ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 131470,
        "last_updated": null
    },
    {
        "urduURN": 4034770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3519,
        "hadithSanad": "ہم سے ثابت بن محمد نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے اعمش نے ، ان سے عبداللہ بن مرہ نے ، ان سے مسروق نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے ان سے نبی کریم صلی اللہ علیہ وسلم نے ، اور سفیان نے زبید سے ، انہوں نے ابراہیم سے ، انہوں نے مسروق سے اور انہوں نے حضرت عبداللہ رضی اللہ عنہ سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، وہ شخص ہم میں سے نہیں ہے جو ( نوحہ کرتے ہوئے ) اپنے رخسار پیٹے ، گریبان پھاڑ ڈالے ، اور جاہلیت کی پکار پکارے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 131480,
        "last_updated": null
    },
    {
        "urduURN": 4034780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3520,
        "hadithSanad": "مجھ سے اسحٰق بن ابراہیم نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ بن آدم نے بیان کیا ، کہا ہم کو اسرائیل نے خبر دی ، انہیں ابوحصین نے ، انہیں ابوصالح نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، عمرو بن لحیی بن قمعہ بن خندف قبیلہ خزاعہ کا باپ تھا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 131490,
        "last_updated": null
    },
    {
        "urduURN": 4034790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3521,
        "hadithSanad": "ہم سے ابولیمان نے بیان کیا ، کہا ہم سے شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہوں نے سعید بن مسیب سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "بحیرہ وہ اونٹنی جس کے دودھ کی ممانعت ہوتی تھی ۔ کیونکہ وہ بتوں کے لیے وقف ہوتی تھی ۔ اس لیے کوئی بھی شخص اس کا دودھ نہیں دوھتا تھا اور سائبہ اسے کہتے جس کو وہ اپنے معبودوں کے لیے چھوڑ دیتے اور ان پر کوئی بوجھ نہ لادتا اور نہ کوئی سواری کرتا ۔ انہوں نے کہا کہ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، میں نے عمرو بن عامر بن لحی خزاعی کو دیکھا کہ جہنم میں وہ اپنی انتڑیاں گھسیٹ رہا تھا اوریہی عمرو وہ پہلا شخص ہے جس نے سائبہ کی رسم نکالی ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 131500,
        "last_updated": null
    },
    {
        "urduURN": 4034810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے زید نے جو اخزم کے بیٹے ہیں ، یبان کیا ، کہا ہم سے ابوقتیبہ سلم بن قتیبہ نے بیان کیا ، ان سے مثنیٰ بن سعید قصیر نے بیان کیا ، کہا کہ مجھ سے ابوجمرہ نے بیان کیا ، کہا کہ ہم سے عبداللہ بن عباس رضی اللہ عنہما نے کہا کہ",
        "hadithText": "کیا میں ابوذر رضی اللہ عنہ کے اسلام کا واقعہ تمہیں سناؤں ؟ ہم نے عرض کیا ضرور سنائیے ۔ انہوں نے بیان کیا کہ ابوذر رضی اللہ عنہ نے بتلایا ۔ میرا تعلق قبیلہ غفار سے تھا ۔ ہمارے یہاں یہ خبر پہنچی تھی کہ مکہ میں ایک شخص پیدا ہوئے ہیں جن کا دعویٰ ہے کہ وہ نبی ہیں ( پہلے تو ) میں نے اپنے بھائی سے کہا کہ اس شخص کے پاس مکہ جا ، اس سے گفتگو کر اور پھر اس کے سارے حالات آ کر مجھے بتا ۔ چنانچہ میرے بھائی خدمت نبوی میں حاضر ہوئے اور آنحضرت صلی اللہ علیہ وسلم سے ملاقات کی اور واپس آ گئے ۔ میں نے پوچھا کہ کیا خبر لائے ؟ انہوں نے کہا ، اللہ کی قسم ! میں نے ایسے شخص کو دیکھا ہے جو اچھے کاموں کے لیے کہتا ہے اور برے کاموں سے منع کرتا ہے ۔ میں نے کہا کہ تمہاری باتوں سے تو میری تشفی نہیں ہوئی ۔ اب میں نے توشے کا تھیلا اور چھڑی اٹھائی اور مکہ آ گیا ۔ وہاں میں کسی کو پہچانتا نہیں تھا اور آپ کے متعلق کسی سے پوچھتے ہوئے بھی ڈر لگتا تھا ۔ میں ( صرف ) زمزم کا پانی پی لیا کرتا تھا ، اور مسجدالحرام میں ٹھہرا ہوا تھا ۔ انہوں نے بیان کیا کہ ایک مرتبہ علی رضی اللہ عنہ میرے سامنے سے گزرے اور بولے معلوم ہوتا ہے کہ آپ اس شہر میں مسافر ہیں ۔ انہوں نے بیان کیا کہ میں نے کہا : جی ہاں ۔ بیان کیا کہ تو پھر میرے گھر چلو ۔ پھر وہ مجھے اپنے گھر ساتھ لے گئے ۔ بیان کیا کہ میں آپ کے ساتھ ساتھ گیا ۔ نہ انہوں نے کوئی بات پوچھی اور نہ میں نے کچھ کہا ۔ صبح ہوئی تو میں پھر مسجدالحرام میں آ گیا تاکہ آنحضرت صلی اللہ علیہ وسلم کے بارے میں کسی سے پوچھوں لیکن آپ کے بارے میں کوئی بتانے والا نہیں تھا ۔ بیان کیا کہ پھر حضرت علی رضی اللہ عنہ میرے سامنے سے گزرے اور بولے کہ کیا ابھی تک آپ اپنے ٹھکانے کو نہیں پا سکے ہیں ؟ بیان کیا ، میں نے کہا کہ نہیں ۔ انہوں نے کہا کہ اچھا پھر میرے ساتھ آئیے ، انہوں نے بیان کیا کہ پھر حضرت علی رضی اللہ عنہ نے پوچھا ۔ آپ کا مطلب کیا ہے ۔ آپ اس شہر میں کیوں آئے ؟ انہوں نے بیان کیا کہ میں نے کہا : آپ اگر ظاہر نہ کریں تو میں آپ کو اپنے معاملے کے بارے میں بتاؤں ۔ انہوں نے کہا کہ میں ایسا ہی کروں گا ۔ تب میں نے ان سے کہا ۔ ہمیں معلوم ہوا ہے کہ یہاں کوئی شخص پیدا ہوئے ہیں جو نبوت کا دعویٰ کرتے ہیں ۔ میں نے پہلے اپنے بھائی کو ان سے بات کرنے کے لیے بھیجا تھا ۔ لیکن جب وہ واپس ہوئے تو انہوں نے مجھے کوئی تشفی بخش اطلاعات نہیں دیں ۔ اس لیے میں اس ارادہ سے آیا ہوں کہ ان سے خود ملاقات کروں ۔ علی رضی اللہ عنہ نے کہا کہ آپ نے اچھا راستہ پایا کہ مجھ سے مل گئے ۔ میں انہیں کے پاس جا رہا ہوں ۔ آپ میرے پیچھے پیچھے چلیں ۔ جہاں میں داخل ہوں آپ بھی داخل ہو جائیں ۔ اگر میں کسی ایسے آدمی کو دیکھوں گا جس سے آپ کے بارے میں مجھے خطرہ ہو گا تو میں کسی دیوار کے پاس کھڑا ہو جاؤں گا ، گویا کہ میں اپنا جوتا ٹھیک کر رہا ہوں ۔ اس وقت آپ آگے بڑھ جائیں چنانچہ وہ چلے اور میں بھی ان کے پیچھے ہو لیا اور آخر میں وہ ایک مکان کے اندر گئے اور میں بھی ان کے ساتھ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں اندر داخل ہو گیا ۔ میں نے آنحضرت صلی اللہ علیہ وسلم سے عرض کیا کہ اسلام کے اصول و ارکان مجھے سمجھا دیجئیے ۔ آپ نے میرے سامنے ان کی وضاحت فرمائی اور میں مسلمان ہو گیا ۔ پھر آپ نے فرمایا : اے ابوذر ! اس معاملے کو ابھی پوشیدہ رکھنا اور اپنے شہر کو چلے جانا ۔ پھر جب تمہیں ہمارے غلبہ کا حال معلوم ہو جائے تب یہاں دوبارہ آنا ۔ میں نے عرض کیا اس ذات کی قسم جس نے آپ کو حق کے ساتھ مبعوث کیا ہے میں تو ان سب کے سامنے اسلام کے کلمہ کا اعلان کروں گا ۔ چنانچہ وہ مسجدالحرام میں آئے ۔ قریش کے لوگ وہاں موجود تھے اور کہا ، اے قریش کی جماعت ! ( سنو ) میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں اور میں گواہی دیتا ہوں کہ محمد اس کے بندے اور اس کے رسول ہیں ۔ ( صلی اللہ علیہ وسلم ) قریشیوں نے کہا کہ اس بددین کی خبر لو ۔ چنانچہ وہ میری طرف لپکے اور مجھے اتنا مارا کہ میں مرنے کے قریب ہو گیا ۔ اتنے میں حضرت عباس رضی اللہ عنہ آ گئے اور مجھ پر گر کر مجھے اپنے جسم سے چھپا لیا اور قریشیوں کی طرف متوجہ ہو کر انہوں کہا ۔ ارے نادانو ! قبیلہ غفار کے آدمی کو قتل کرتے ہو ۔ غفار سے تو تمہاری تجارت بھی ہے اور تمہارے قافلے بھی اس طرف سے گزرتے ہیں ۔ اس پر انہوں نے مجھے چھوڑ دیا ۔ پھر جب دوسری صبح ہوئی تو پھر میں مسجدالحرام میں آیا اور جو کچھ میں نے کل پکارا تھا اسی کو پھر دہرایا ۔ قریشیوں نے پھر کہا : پکڑو اس بددین کو ۔ جو کچھ انہوں نے میرے ساتھ کل کیا تھا وہی آج بھی کیا ۔ اتفاق سے پھر عباس بن عبدالمطلب آ گئے اور مجھ پر گر کر مجھے اپنے جسم سے انہوں نے چھپا لیا اور جیسا ا نہوں نے قریشیوں سے کل کہا تھا ویسا ہی آج بھی کہا ۔ عبداللہ بن عباس رضی اللہ عنہما نے کہا کہ حضرت ابوذر رضی اللہ عنہ کے اسلام قبول کرنے کی ابتداء اس طرح سے ہوئی تھی ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 131510,
        "last_updated": null
    },
    {
        "urduURN": 4034820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3523,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد نے بیان کیا ، ان سے ایوب نے ، ان سے محمد نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، قبیلہ اسلم ، غفار اور مزینہ اور جہنیہ کے کچھ لوگ یا انہوں نے بیان کیا کہ مزینہ کے کچھ لوگ یا ( بیان کیا کہ ) جہینہ کے کچھ لوگ اللہ تعالیٰ کے نزدیک یا بیان کیا کہ قیامت کے دن قبیلہ اسد ، تمیم ، ہوازن اور غطفان سے بہتر ہوں گے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 131520,
        "last_updated": null
    },
    {
        "urduURN": 4034830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3524,
        "hadithSanad": "ہم سے ابولنعمان نے بیان کیا ، انہوں نے کہا ہم سے ابوعوانہ نے بیان کیا ، ان سے بشر نے ، ان سے سعید بن جبیر نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "اگر تم کو عرب کی جہالت معلوم کرنا اچھا لگے تو سورۃ الانعام میں ایک سو تیس آیتوں کے بعد یہ آیتیں پڑھ لو ” یقیناً وہ لوگ تباہ ہوئے جنہوں نے اپنی اولاد کو نادانی سے مارڈالا “ سے لے کر ” وہ گمراہ ہیں ، راہ پانے والے نہیں “ تک ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 131530,
        "last_updated": null
    },
    {
        "urduURN": 4034840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3525,
        "hadithSanad": "ہم سے عمر بن حفص نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، کہا ہم سے اعمش نے ، کہا ان سے عمرو بن مرہ نے ، ان سے سعید بن جبیر نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "جب ( سورۃ الشعراء کی ) یہ آیت اتری ” اے پیغمبر ! اپنے قریبی رشتہ داروں کو ڈرا “ تو نبی کریم صلی اللہ علیہ وسلم نے قریش کے مختلف قبیلوں کو بلایا ” اے بنی فہر ! اے بنی عدی ! جو قریش کے خاندان تھے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 131540,
        "last_updated": null
    },
    {
        "urduURN": 4034850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3526,
        "hadithSanad": "( حضرت امام بخاری رحمہ اللہ نے ) کہا کہ ہم سے قبیصہ نے بیان کیا ، انہیں سفیان نے خبر دی ، انہیں حبیب بن ابی ثابت نے ، انہیں سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "جب یہ آیت ” اور آپ اپنے قریبی رشتہ داروں کو ڈرائیے “ اتری تو آنحضرت صلی اللہ علیہ وسلم نے الگ الگ قبائل کو دعوت دی ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 131550,
        "last_updated": null
    },
    {
        "urduURN": 4034860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3527,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، کہا ہم کو ابوالزناد نے خبر دی ، انہیں اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا : اے عبدمناف کے بیٹو ! اپنی جانوں کو اللہ سے خرید لو ( یعنی نیک کام کر کے انہیں اللہ تعالیٰ کے عذاب سے بچا لو ) اے عبدالمطلب کے بیٹو ! اپنی جانوں کو اللہ تعالیٰ سے خرید لو ، اے زبیر بن عوام کی والدہ ! رسول اللہ صلی اللہ علیہ وسلم کی پھوپھی ، اے فاطمہ بنت محمد ! تم دونوں اپنی جانوں کو اللہ سے بچا لو ۔ میں تمہارے لیے اللہ کی بارگاہ میں کچھ اختیار نہیں رکھتا ۔ تم دونوں میرے مال میں جتنا چاہو مانگ سکتی ہو ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 131560,
        "last_updated": null
    },
    {
        "urduURN": 4034870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3528,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے ، ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے انصار کو خاص طور سے ایک مرتبہ بلایا ، پھر ان سے پوچھا کیا تم لوگوں میں کوئی ایسا شخص بھی رہتا ہے جس کا تعلق تمہارے قبیلے سے نہ ہو ؟ انہوں نے عرض کیا کہ صرف ہمارا ایک بھانجا ایسا ہے ۔ آپ نے فرمایا کہ بھانجا بھی اسی قوم میں داخل ہوتا ہے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 131570,
        "last_updated": null
    },
    {
        "urduURN": 4034880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3529,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "ابوبکر رضی اللہ عنہ ان کے یہاں تشریف لائے تو وہاں ( انصار کی ) دو لڑکیاں دف بجا کر گارہی تھیں ۔ یہ حج کے ایام منیٰ کا واقعہ ہے ، نبی کریم صلی اللہ علیہ وسلم روئے مبارک پر کپڑا ڈالے ہوئے لیٹے ہوئے تھے ۔ حضرت ابوبکر رضی اللہ عنہ نے انہیں ڈانٹا تو آنحضرت صلی اللہ علیہ وسلم نے اپنے چہرہ مبارک سے کپڑا ہٹا کر فرمایا : ابوبکر ! انہیں چھوڑد و ، یہ عید کے دن ہیں ، یہ منیٰ میں ٹھہرنے کے دن تھے ۔ \n<span class=urdu_sanad>اور حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ</span> میں نے دیکھا کہ نبی کریم صلی اللہ علیہ وسلم مجھ کو پردہ میں رکھے ہوئے ہیں اور میں حبشیوں کو دیکھ رہی تھی جو نیزوں کا کھیل مسجد میں کر رہے تھے ۔ حضرت ابوبکر رضی اللہ عنہ نے انہیں ڈانٹا ۔ لیکن آنحضرت صلی اللہ علیہ وسلم نے فرمایا : انہیں چھوڑ دو ، بنی ارفدہ تم بے فکر ہو کر کھیلو ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 131581,
        "last_updated": null
    },
    {
        "urduURN": 4034900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3531,
        "hadithSanad": "مجھ سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے عبدہ نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "حسان بن ثابت رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے مشرکین ( قریش ) کی ہجو کرنے کی اجازت چاہی تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر میں بھی تو ان ہی کے خاندان سے ہوں ۔ اس پر حسان رضی اللہ عنہ نے عرض کیا کہ میں آپ کو ( شعر میں ) اس طرح صاف نکال لے جاؤں گا جیسے آٹے میں سے بال نکال لیا جاتا ہے اور ( ہشام نے ) اپنے والد سے روایت کیا کہ انہوں نے کہا ، حضرت عائشہ رضی اللہ عنہا کے یہاں میں حسان رضی اللہ عنہ کو برا کہنے لگا تو انہوں نے فرمایا ، انہیں برا نہ کہو ، وہ نبی کریم صلی اللہ علیہ وسلم کی طرف سے مدافعت کیا کرتے تھے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 131600,
        "last_updated": null
    },
    {
        "urduURN": 4034910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3532,
        "hadithSanad": "ہم سے ابراہیم بن المنذر نے بیان کیا ، کہا کہ مجھ سے معن نے کہا ، ان سے امام مالک نے ، ان سے ابن شہاب نے ، ان سے محمد بن جیبر بن مطعم نے اور ان سے ان کے والد ( جبیر بن مطعم رضی اللہ عنہ ) نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، میرے پانچ نام ہیں ۔ میں محمد ، احمد اور ماحی ہوں ( یعنی مٹانے والا ہوں ) کہ اللہ تعالیٰ میرے ذریعہ کفر کو مٹائے گا اور میں حاشر ہوں کہ تمام انسانوں کا ( قیامت کے دن ) میرے بعد حشر ہو گا اور میں ” عاقب “ ہوں یعنی خاتم النبین ہوں ۔ میرے بعد کوئی نیا پیغمبر دنیا میں نہیں آئے گا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 131610,
        "last_updated": null
    },
    {
        "urduURN": 4034920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3533,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ابوالزناد نے ، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، تمہیں تعجب نہیں ہوتا کہ اللہ تعالیٰ مجھ سے قریش کی گالیوں اور لعنت ملامت کو کس طرح دور کرتا ہے ۔ مجھے وہ مذمم کہہ کر برا کہتے ، اس پر لعنت کرتے ہیں ۔ حالانکہ میں تو محمد ہوں ۔ ( صلی اللہ علیہ وسلم )</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 131620,
        "last_updated": null
    },
    {
        "urduURN": 4034930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3534,
        "hadithSanad": "ہم سے محمد بن سنان نے بیان کیا ، کہا ہم سے سلیم نے بیان کیا ، کہا ہم سے سعید بن میناء نے بیان کیا اور ان سے حضرت جابر بن عبداللہ رضی اللہ عنہمانے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، میری اور دوسرے انبیاء کی مثال ایسی ہے جیسی کسی شخص نے کوئی گھر بنایا ، اسے خوب آراستہ پیراستہ کر کے مکمل کر دیا ۔ صرف ایک اینٹ کی جگہ خالی چھوڑ دی ۔ لوگ اس گھر میں داخل ہوتے اور تعجب کرتے اور کہتے کاش یہ ایک اینٹ کی جگہ خالی نہ رہتی تو کیسا اچھا مکمل گھر ہوتا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 131630,
        "last_updated": null
    },
    {
        "urduURN": 4034940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3535,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے عبداللہ بن دینار نے ، ان سے ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میری اور مجھ سے پہلے کے تمام انبیاء کی مثال ایسی ہے جیسے ایک شخص نے ایک گھر بنایا اور اس میں ہر طرح کی زینت پیدا کی لیکن ایک کونے میں ایک اینٹ کی جگہ چھوٹ گئی ۔ اب تمام لوگ آتے ہیں اور مکان کو چاروں طرف سے گھوم کر دیکھتے ہیں اور تعجب میں پڑ جاتے ہیں لیکن یہ بھی کہتے جاتے ہیں کہ یہاں پر ایک اینٹ کیوں نہ رکھی گئی ؟ تو میں ہی وہ اینٹ ہوں اور میں خاتم النبیین ہوں ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 131640,
        "last_updated": null
    },
    {
        "urduURN": 4034950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3536,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عروہ بن زبیر نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ترسٹھ سال کی عمر میں وفات پائی اور ابن شہاب نے کہا کہ مجھ سے سعید بن مسیب نے اسی طرح بیان کیا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 131650,
        "last_updated": null
    },
    {
        "urduURN": 4034960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3537,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے حمید نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم بازار میں تھے کہ ایک صاحب کی آواز آئی ۔ یا اباالقاسم ! آپ ان کی طرف متوجہ ہوئے ( معلوم ہوا کہ انہوں نے کسی اور کو پکارا ہے ) اس پر آپ نے فرمایا : میرے نام پر نام رکھو لیکن میری کنیت مت رکھو ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 131660,
        "last_updated": null
    },
    {
        "urduURN": 4034970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3538,
        "hadithSanad": "ہم سے محمد بن کثیرنے بیان کیا ، کہا ہم کو شعبہ نے خبر دی ، انہیں منصور نے ، انہیں سالم بن ابی الجعد نے اور انہیںحضرت جابر رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، میرے نام پر نام رکھا کرو لیکن میری کنیت نہ رکھا کرو ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 131670,
        "last_updated": null
    },
    {
        "urduURN": 4034980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3539,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے سفیان نے بیان کیا ، ان سے ایوب نے ، ان سے ابن سیرین نے بیان کیا اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، آپ نے بیان کیا کہ",
        "hadithText": "ابوالقاسم صلی اللہ علیہ وسلم نے فرمایا ، میرے نام پر نام رکھو لیکن میری کنیت نہ رکھاکرو ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 131680,
        "last_updated": null
    },
    {
        "urduURN": 4034990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3540,
        "hadithSanad": "مجھ سے اسحٰق بن راہویہ نے بیان کیا ، کہا ہم کو فضل بن موسیٰ نے خبر دی ، انہیں جعد بن عبدالرحمٰن نے کہ",
        "hadithText": "میں نے سائب بن یزید رضی اللہ عنہ کو چورانوے سال کی عمر میں دیکھا کہ خاصے قوی و توانا تھے ۔ انہوں نے کہا کہ مجھے یقین ہے کہ میرے کانوں اور آنکھوں سے جو میں نفع حاصل کر رہا ہوں وہ صرف رسول اللہ صلی اللہ علیہ وسلم کی دعا کی برکت ہے ۔ میری خالہ مجھے ایک مرتبہ آپ کی خدمت میں لے گئیں ۔ اور عرض کیا : یا رسول اللہ ! یہ میرا بھانجا بیمار ہے ، آپ اس کے لیے دعا فرما دیں ۔ انہوں نے بیان کیا کہ پھر آپ نے میرے لیے دعا فرمائی ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 131690,
        "last_updated": null
    },
    {
        "urduURN": 4035000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3541,
        "hadithSanad": "ہم سے محمدبن عبیداللہ نے بیان کیا ، کہا ہم سے حاتم بن اسماعیل نے بیان کیا ، ان سے جعید بن عبدالرحمٰن نے بیان کیا اور انہوں نے سائب بن یزید رضی اللہ عنہ سے سنا کہ",
        "hadithText": "میری خالہ مجھے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لے کر حاضر ہوئیں اور انہوں نے عرض کیا : یا رسول اللہ ! میرا بھانجا بیمار ہو گیا ہے ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے میرے سر پر دست مبارک پھیرا اور میرے لیے برکت کی دعا فرمائی ۔ اس کے بعد آپ نے وضو کیا تو میں نے آپ کے وضو کا پانی پیا ، پھر آپ کی پیٹھ کی طرف جاکے کھڑا ہو گیا اور میں نے مہر نبوت کو آپ کے دونوں مونڈھوں کے درمیان دیکھا ۔ محمد بن عبیداللہ نے کہا کہحجلہ ، حجل الفرس سے مشتق ہے جو گھوڑے کی اس سفیدی کو کہتے ہیں جو اس کی دونوں آنکھوں کے بیچ میں ہوتی ہے ۔ ابراہیم بن حمزہ نے کہا : مثل رزالحجلۃ یعنی رائے مہملہپہلے پھر زائے معجمہ ۔ امام بخاری رحمہ اللہ نے کہا کہ صحیح یہ ہے کہ رائے مہملہ پہلے ہے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 131700,
        "last_updated": null
    },
    {
        "urduURN": 4035010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3542,
        "hadithSanad": "ہم سے ابوعاصم نے بیان کیا ، ان سے عمر بن سعید بن ابی حسین نے بیان کیا ، ان سے ابن ابی ملیکہ نے اور ان سے عقبہ بن حارث نے کہ",
        "hadithText": "حضرت ابوبکر رضی اللہ عنہ عصر کی نماز سے فارغ ہو کر مسجد سے باہر نکلے تو دیکھا کہ حضرت حسن بچوں کے ساتھ کھیل رہے ہیں ۔ حضرت صدیق رضی اللہ عنہ نے ان کو اپنے کندھے پر بٹھا لیا اور فرمایا : میرے باپ تم پر قربان ہوں تم میں نبی کریم صلی اللہ علیہ وسلم کی شباہت ہے ۔ علی کی نہیں ۔ یہ سن کر حضرت علی ہنس رہے تھے ( خوش ہو رہے تھے ) ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 131710,
        "last_updated": null
    },
    {
        "urduURN": 4035020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3543,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، کہا ہم سے زبیر نے بیان کیا ، کہا ہم سے اسماعیل بن ابی خالد نے بیان کیا اور ان سے ابوحجیفہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کو میں نے دیکھا تھا ۔ حضرت حسن رضی اللہ عنہ میں آپ کی پوری شباہت موجود تھی ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 131720,
        "last_updated": null
    },
    {
        "urduURN": 4035030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3544,
        "hadithSanad": "مجھ سے عمرو بن علی فلاس نے بیان کیا ، کہا ہم سے ابن فضیل نے بیان کیا ، کہا ہم سے اسماعیل بن ابی خالد نے بیان کیا ، کہا کہ میں نے ابوجحیفہ رضی اللہ عنہ سے سنا ۔ وہ بیان کرتے تھے کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم کو دیکھا ہے ، حسن بن علی رضی اللہ عنہ میں آپ کی شباہت پوری طرح موجود تھی ۔ اسماعیل بن ابی خالد نے کہا ، میں نے ابوجحیفہ رضی اللہ عنہ سے عرض کیا کہ آپ آنحضرت صلی اللہ علیہ وسلم کی صفت بیان کریں ۔ انہوں نے کہا آپ سفید رنگ کے تھے ، کچھ بال سفید ہو گئے تھے اور آپ نے ہمیں تیرہ اونٹنیوں کے دیئے جانے کا حکم کیا تھا ۔ لیکن ابھی ہم نے ان اونٹنیوں کو اپنے قبضہ میں بھی نہیں لیا تھا کہ آپ کی وفات ہو گئی ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 131730,
        "last_updated": null
    },
    {
        "urduURN": 4035040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3545,
        "hadithSanad": "ہم سے عبداللہ بن رجاء نے بیان کیا ، کہا ہم سے اسرائیل نے بیان کیا ، ان سے ابواسحٰق نے ، ان سے وہب نے ، ان سے ابوجحیفہ سوائی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم کو دیکھا ۔ آپ کے نچلے ہونٹ مبارک کے نیچے ٹھوڑی کے کچھ بال سفید تھے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 131740,
        "last_updated": null
    },
    {
        "urduURN": 4035050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3546,
        "hadithSanad": "ہم سے عصام بن خالد نے بیان کیا ، انہوں نے کہا ہم سے حریز بن عثمان نے بیان کیا",
        "hadithText": "اور انہوں نے نبی کریم صلی اللہ علیہ وسلم کے صحابی عبداللہ بن بسر رضی اللہ عنہ سے پوچھا ، کیا رسول اللہ صلی اللہ علیہ وسلم بوڑھے ہو گئے تھے ؟ انہوں نے کہا کہ آپ کی ٹھوڑی کے چند بال سفید ہو گئے تھے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 131750,
        "last_updated": null
    },
    {
        "urduURN": 4035060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3547,
        "hadithSanad": "مجھ سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ مجھ سے لیث نے بیان کیا ، ان سے خالد نے ، ان سے سعید بن ابی ہلال نے ، ان سے ربیعہ بن ابی عبدالرحمٰن نے بیان کیا کہ",
        "hadithText": "میں نے انس بن مالک رضی اللہ عنہ سے سنا ، آپ نے نبی کریم صلی اللہ علیہ وسلم کے اوصاف مبارکہ بیان کرتے ہوئے بتلایا کہ آپ درمیانہ قد کے تھے ۔ نہ بہت لمبے اور نہ چھوٹے قد والے ۔ رنگ کھلتا ہوا تھا ( سرخ و سفید ) نہ خالی سفید تھے اور نہ بالکل گندم گوں ۔ آپ کے بال نہ بالکل مڑے ہوئے سخت قسم کے تھے اور نہ سیدھے لٹکے ہوئے ہی تھے ۔ نزول وحی کے وقت آپ کی عمر چالیس سال تھی ۔ مکہ میں آپ نے دس سال تک قیام فرمایا اور اس پورے عرصہ میں آپ پر وحی نازل ہوتی رہی اور مدینہ میں بھی آپ کا قیام دس سال تک رہا ۔ آپ کے سر اور داڑھی میں بیس بال بھی سفید نہیں ہوئے تھے ۔ ربیعہ ( راوی حدیث ) نے بیان کیا کہ پھر میں نے آپ صلی اللہ علیہ وسلم کا ایک بال دیکھا تو وہ لال تھا میں نے اس کے متعلق پوچھا تو مجھے بتایا گیا کہ خوشبو لگاتے لگاتے لال ہو گیا ہے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 131760,
        "last_updated": null
    },
    {
        "urduURN": 4035070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3548,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو مالک بن انس نے خبر دی ، انہیں ربیعہ بن ابی عبدالرحمٰن نے اور انہوں نے انس بن مالک رضی اللہ عنہ سے سنا ، آپ نے کہا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نہ بہت لمبے تھے اور نہ چھوٹے قد کے ، نہ بالکل سفید تھے اور نہ گندمی رنگ کے ۔ نہ آپ کے بال بہت زیادہ گھونگھریالے تھے اور نہ بالکل سیدھے لٹکے ہوئے ، اللہ تعالیٰ نے آپ کو چالیس سال کی عمر میں نبوت دی اور آپ نے مکہ میں دس سال تک قیام کیا اور مدینہ میں دس سال تک قیام کیا ۔ جب اللہ تعالیٰ نے آپ کو وفات دی تو آپ کے سر اور داڑھی کے بیس بال بھی سفید نہیں تھے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 131770,
        "last_updated": null
    },
    {
        "urduURN": 4035080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3549,
        "hadithSanad": "ہم سے ابوعبداللہ احمد بن سعید نے بیان کیا ، کہا ہم سے اسحٰق بن منصور نے بیان کیا ، کہا ہم سے ابراہیم بن یوسف نے بیان کیا ، ان سے ان کے والد نے ، ان سے ابواسحٰق نے بیان کیا کہ میں نے براء  بن عازب رضی اللہ عنہما سے سنا ، آپ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم حسن و جمال میں بھی سب سے بڑھ کر تھے اور جسمانی ساخت میں بھی سب سے بہتر تھے ۔ آپ کا قد نہ بہت لانبا تھا اور نہ چھوٹا ( بلکہ درمیانہ قد تھا ) ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 131780,
        "last_updated": null
    },
    {
        "urduURN": 4035090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3550,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، ان سے قتادہ نے کہ",
        "hadithText": "میں نے انس رضی اللہ عنہ سے پوچھا کیا رسول اللہ صلی اللہ علیہ وسلم نے کبھی خضاب بھی استعمال فرمایا تھا ؟ انہوں نے کہا کہ آپ نے کبھی خضاب نہیں لگایا ۔ صرف آپ کی دو نوں کنپٹیوں پر ( سر میں ) چند بال سفید تھے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 131790,
        "last_updated": null
    },
    {
        "urduURN": 4035100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3551,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، ہم سے شعبہ نے بیان کیا ، ان سے ابواسحٰق نے اور ان سے براء  بن عازب رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم درمیانہ قد کے تھے ۔ آپ کا سینہ بہت کشادہ اور کھلا ہوا تھا ۔ آپ کے ( سر کے ) بال کانوں کی لو تک لٹکتے رہتے تھے ۔ میں نے آنحضرت صلی اللہ علیہ وسلم کو ایک مرتبہ ایک سرخ جوڑے میں دیکھا ۔ میں نے آپ سے بڑھ کر حسین کسی کو نہیں دیکھا تھا ۔ یوسف بن ابی اسحٰق نے اپنے والد کے واسطہ سے ” الی منکبیہ “ بیان کیا ( بجائے لفظ ” شحمۃ اذنیہ ) یعنی آپ کے بال مونڈھوں تک پہنچتے تھے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 131800,
        "last_updated": null
    },
    {
        "urduURN": 4035110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3552,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے زہیر نے بیان کیا ، ان سے ابواسحٰق نے بیان کیا کہ",
        "hadithText": "کسی نے براء رضی اللہ عنہ سے پوچھا ، کیا رسول اللہ صلی اللہ علیہ وسلم کا چہرہ تلوار کی طرح ( لمبا پتلا ) تھا ؟ انہوں نے کہا نہیں ، چہرہ مبارک چاند کی طرح ( گول اور خوبصورت ) تھا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 131810,
        "last_updated": null
    },
    {
        "urduURN": 4035120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3553,
        "hadithSanad": "ہم سے ابوعلی حسن بن منصور نے بیان کیا ، کہا ہم سے حجاج بن محمد الاعور نے مصیصہ ( شہر میں ) بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے حکم نے بیان کیا کہ میں نے ابوجحیفہ رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم دوپہر کے وقت سفر کے ارادہ سے نکلے ۔ بطحاء نامی جگہ پر پہنچ کر آپ نے وضو کیا اور ظہر کی نماز دو رکعت ( قصر ) پڑھی پھر عصر کی بھی دو رکعت ( قصر ) پڑھی ۔ آپ کے سامنے ایک چھوٹا سا نیزہ ( بطور سترہ ) گڑا ہوا تھا ۔ عون نے اپنے والد سے اس روایت میں یہ زیادہ کیا ہے کہ ابوجحیفہ رضی اللہ عنہ نے کہا کہ اس نیزہ کے آگے سے آنے جانے والے آ جا رہے تھے ۔ پھر صحابہ آپ کے پاس آ گئے اور آپ کے مبارک ہاتھوں کو تھام کر اپنے چہروں پر پھیرنے لگے ۔ ابوجحیفہ رضی اللہ عنہ نے بیان کیا کہ میں نے بھی آپ کے دست مبارک کو اپنے چہرے پر رکھا ۔ اس وقت وہ برف سے بھی زیادہ ٹھنڈا اور مشک سے بھی زیادہ خوشبودار تھا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 131820,
        "last_updated": null
    },
    {
        "urduURN": 4035130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3554,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا ہم سے عبداللہ نے بیان کیا ، کہا ہم کو یونس نے خبر دی ، ان سے زہری نے بیان کیا ، کہا مجھ سے عبیداللہ بن عبداللہ نے بیان کیا اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم سب سے زیادہ سخی تھے اور رمضان میں جب آپ سے جبرائیل علیہ السلام کی ملاقات ہوتی تو آپ کی سخاوت اور بھی بڑھ جایا کرتی تھی ۔ جبرائیل علیہ السلام رمضان کی ہر رات میں آپ سے ملاقات کے لیے تشریف لاتے اور آپ کے ساتھ قرآن مجید کا دور کرتے ۔ اس وقت رسول اللہ صلی اللہ علیہ وسلم خیر و بھلائی کے معاملے میں تیز چلنے والی ہوا سے بھی زیادہ سخی ہو جاتے تھے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 131830,
        "last_updated": null
    },
    {
        "urduURN": 4035140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3555,
        "hadithSanad": "ہم سے یحییٰ بن موسیٰ نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، کہا ہم سے ابن جریج نے بیان کیا ، کہا کہ مجھے ابن شہاب نے خبر دی ، انہیں عروہ نے اور انہیں عائشہ رضی اللہ عنہا نے",
        "hadithText": "ایک مرتبہ رسول اللہ صلی اللہ علیہ وسلم ان کے یہاں بہت ہی خوش خوش داخل ہوئے ، خوشی اور مسرت سے پیشانی کی لکیریں چمک رہی تھیں ۔ پھر آپ نے فرمایا : عائشہ ! تم نے سنا نہیں مجزز مدلجی نے زید و اسامہ کے صرف قدم دیکھ کر کیا بات کہی ؟ اس نے کہا کہ ایک کے پاؤں دوسرے کے پاؤں سے ملتے ہوئے نظر آتے ہیں ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 131840,
        "last_updated": null
    },
    {
        "urduURN": 4035150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3556,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے عبدالرحمٰن بن عبداللہ بن کعب نے اور ان سے عبداللہ بن کعب نے بیان کیا کہ میں نے کعب بن مالک رضی اللہ عنہ سے سنا ،",
        "hadithText": "آپ غزوہ تبوک میں اپنے پیچھے رہ جانے کا واقعہ بیان کر رہے تھے ۔ انہوں نے بیان کیا کہ پھر میں نے ( توبہ قبول ہونے کے بعد ) حاضر ہو کر رسول اللہ صلی اللہ علیہ وسلم کو سلام کیا تو چہرہ مبارک مسرت و خوشی سے چمک رہا تھا ۔ جب بھی حضور صلی اللہ علیہ وسلم کسی بات پر مسرور ہوتے تو چہرہ مبارک چمک اٹھتا ، ایسا معلوم ہوتا جیسے چاند کا ٹکڑا ہو اور آپ کی خوشی کو ہم اسی سے پہچان جاتے تھے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 131850,
        "last_updated": null
    },
    {
        "urduURN": 4035160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3557,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے یعقوب بن عبدالرحمٰن نے بیان کیا ، ان سے عمرو بن ابی عمرو نے ، ان سے سعید مقبری نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا میں ( حضرت آدم سے لے کر ) برابر آدمیوں کے بہتر قرنوں میں ہوتا آیا ہوں ( یعنی شریف اور پاکیزہ نسلوں میں ) یہاں تک کہ وہ قرن آیا جس میں میں پیدا ہوا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 131860,
        "last_updated": null
    },
    {
        "urduURN": 4035170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3558,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے یونس نے ، ان سے ابن شہاب نے بیان کیا ، کہا مجھ کو عبیداللہ بن عبداللہ نے خبر دی اور انہیں عبداللہ بن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم ( سر کے آگے کے بالوں کو پیشانی پر ) پڑا رہنے دیتے تھے اور مشرکین کی یہ عادت تھی کہ وہ آگے کے سر کے بال دو حصوں میں تقسیم کر لیتے تھے ( پیشانی پر پڑا نہیں رہنے دیتے تھے ) اور اہل کتاب ( یہود و نصاریٰ ) سرکے آگے کے بال پیشانی پر پڑا رہنے دیتے تھے ۔ آنحضرت صلی اللہ علیہ وسلم ان معاملات میں جن کے متعلق اللہ تعالیٰ کا کوئی حکم آپ کو نہ ملا ہوتا ۔ اہل کتاب کی موافقت پسند فرماتے ( اور حکم نازل ہونے کے بعد وحی پر عمل کرتے تھے ) پھر حضور صلی اللہ علیہ وسلم بھی سر میں مانگ نکالنے لگے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 131870,
        "last_updated": null
    },
    {
        "urduURN": 4035180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3559,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، ان سے ابوحمزہ نے ، ان سے اعمش نے ، ان سے ابووائل نے ، ان سے مسروق نے اور ان سے عبداللہ بن عمرو رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم بدزبان اور لڑنے جھگڑنے والے نہیں تھے ۔ آپ فرمایا کرتے تھے کہ تم میں سب سے بہتر وہ شخص ہے جس کے اخلاق سب سے اچھے ہوں ( جو لوگوں سے کشادہ پیشانی سے پیش آئے )</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 131880,
        "last_updated": null
    },
    {
        "urduURN": 4035190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3560,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں ابن شہاب نے ، انہیں عروہ بن زبیر نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم سے جب بھی دو چیزوں میں سے کسی ایک کے اختیار کرنے کے لیے کہا گیا تو آپ نے ہمیشہ اسی کو اختیار فرمایا جس میں آپ کو زیادہ آسانی معلوم ہوئی بشرطیکہ اس میں کوئی گناہ نہ ہو ۔ کیونکہ اگر اس میں گناہ کا کوئی شائبہ بھی ہوتا تو آپ اس سے سب سے زیادہ دور رہتے اور آنحضرت صلی اللہ علیہ وسلم نے اپنی ذات کے لیے کبھی کسی سے بد لہ نہیں لیا ۔ لیکن اگر اللہ کی حرمت کو کوئی توڑ تا تو آپ اس سے ضرور بدلہ لیتے تھے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 131890,
        "last_updated": null
    },
    {
        "urduURN": 4035200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3561,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد نے بیان کیا ، ان سے ثابت نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نہ تو نبی کریم صلی اللہ علیہ وسلم کی ہتھیلی سے زیادہ نرم و نازک کوئی حریر و دیباج میرے ہاتھوں نے کبھی چھوا اور نہ میں نے رسول اللہ صلی اللہ علیہ وسلم کی خوشبو سے زیادہ بہتر اور پاکیزہ کوئی خوشبو یا عطر سونگھا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 131900,
        "last_updated": null
    },
    {
        "urduURN": 4035210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3562,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ نے بیان کیا ، ان سے شعبہ نے ، ان سے قتادہ نے ، ان سے عبداللہ ابن ابی عتبہ نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم پردہ نشیں کنواری لڑکیوں سے بھی زیادہ شرمیلے تھے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 131910,
        "last_updated": null
    },
    {
        "urduURN": 4035220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3563,
        "hadithSanad": "مجھ علی بن جعد نے بیان کیا ، انہوں نے کہا کہ ہم کو شعبہ نے خبر دی ، انہیں اعمش نے ، انہیں ابوحازم نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے کبھی کسی کھانے میں عیب نہیں نکالا ، اگر آپ کو مرغوب ہوتا تو کھاتے ورنہ چھوڑ دیتے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 131930,
        "last_updated": null
    },
    {
        "urduURN": 4035230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3564,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے بکربن مضر نے بیان کیا ، ان سے جعفر بن ربیعہ نے ، ان سے اعرج نے ، ان سے عبداللہ بن مالک بن بحینہ اسدی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جب سجدہ کرتے تو دونوں ہاتھ پیٹ سے الگ رکھتے یہاں تک کہ آپ کی بغلیں ہم لوگ دیکھ لیتے ، ابن بکیر نے بکر سے روایت کی اس میں یوں ہے ، یہاں تک کہ آپ کی بغلوں کی سفیدی دکھائی دیتی تھی ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 131940,
        "last_updated": null
    },
    {
        "urduURN": 4035240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3565,
        "hadithSanad": "ہم سے عبدالاعلی بن حماد نے بیان کیا ، انہوں نے کہا ہم سے یزید بن زریع نے بیان کیا ، انہوں نے کہا ہم سے سعید نے بیان کیا ، انہوں نے قتادہ سے ، انہوں نے انس بن مالک رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم دعا استسقاء کے سوا اور کسی دعا میں ( زیادہ اونچا ) ہاتھ نہیں اٹھاتے تھے ۔ اس دعا میں آپ اتنا اونچا ہاتھ اٹھاتے کہ بغل مبارک کی سفیدی دکھائی دیتی تھی ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 131950,
        "last_updated": null
    },
    {
        "urduURN": 4035250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3566,
        "hadithSanad": "ہم سے حسن بن صباح بزار نے بیان کیا ، کہا ہم سے محمد بن سابق نے بیان کیا ، کہا ہم سے مالک بن مغول نے بیان کیا ، کہا کہ میں نے عون بن ابی جحیفہ سے سنا ، وہ اپنے والد ( ابوجحیفہ رضی اللہ عنہ ) سے نقل کرتے تھے کہ",
        "hadithText": "میں سفر کے ارادہ سے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آپ ابطح میں ( محصب میں ) خیمہ کے اندر تشریف رکھتے تھے ۔ کڑی دوپہر کا وقت تھا ۔ اتنے میں بلال رضی اللہ عنہ نے باہر نکل کر نماز کے لئے اذان دی اور اندر آ گئے اور حضرت بلال رضی اللہ عنہ نے آنحضرت صلی اللہ علیہ وسلم کے وضو کا بچا ہوا پانی نکالا تو لوگ اسے لینے کے لیے ٹوٹ پڑے ۔ پھر حضرت بلال رضی اللہ عنہ نے ایک نیزہ نکالا اور آنحضرت صلی اللہ علیہ وسلم باہر تشریف لائے ، گویا آپ کی پنڈلیوں کی چمک اب بھی میری نظروں کے سامنے ہے ۔ بلال رضی اللہ عنہ نے ( سترہ کے لیے ) نیزہ گاڑ دیا ۔ آپ نے ظہر اور عصر کی دو دو رکعت قصر نماز پڑھائی ، گدھے اور عورتیں آپ کے سامنے سے گزر رہی تھیں ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 131960,
        "last_updated": null
    },
    {
        "urduURN": 4035260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3567,
        "hadithSanad": "مجھ سے حسن بن صباح بزار نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے زہری نے ، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم اس قدر ٹھہر ٹھہر کر باتیں کرتے کہ اگر کوئی شخص ( آپ کے الفاظ ) گن لینا چاہتا تو گن سکتا تھا ۔ \n<span class=urdu_sanad>اور لیث نے بیان کیا کہ مجھ سے یونس نے بیان کیا ، ان سے ابن شہاب نے بیان کیا کہ مجھے عروہ بن زبیرنے خبر دی اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ</span> ( حضرت ابوہریرہ رضی اللہ عنہ ) پر تمہیں تعجب نہیں ہوا ۔ وہ آئے اور میرے حجرہ کے ایک کونے میں بیٹھ کر رسول اللہ صلی اللہ علیہ وسلم کی احادیث مجھے سنانے کے لیے بیان کرنے لگے ۔ میں اس وقت نماز پڑھ رہی تھی ۔ پھر وہ میری نماز ختم ہونے سے پہلے ہی اٹھ کر چلے گئے ۔ اگر وہ مجھے مل جاتے تو میں ان کی خبر لیتی کہ رسول اللہ صلی اللہ علیہ وسلم تمہاری طرح یوں جلدی جلدی باتیں نہیں کیا کرتے تھے ۔ نبی کریم صلی اللہ علیہ وسلم کی آنکھیں ظاہر میں سوتی تھیں لیکن دل غافل نہیں ہوتا تھا اس کی روایت سعید بن میناء نے جابر رضی اللہ عنہ سے کی ہے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 131971,
        "last_updated": null
    },
    {
        "urduURN": 4035280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3569,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، ان سے امام مالک نے ، ان سے سعید مقبری نے ، ان سے ابوسلمہ بن عبدالرحمٰن نے انہوں نے عائشہ رضی اللہ عنہا سے پوچھا کہ",
        "hadithText": "رمضان شریف میں رسول اللہ صلی اللہ علیہ وسلم کی نماز ( تہجد یا تراویح ) کی کیا کیفیت ہوتی تھی ؟ انہوں نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم رمضان مبارک یا دوسرے کسی بھی مہینے میں گیارہ رکعت سے زیادہ نہیں پڑھتے تھے ( ان ہی کو تہجد کہو یا تراویح ) پہلے آپ چار رکعت پڑھتے ، وہ رکعتیں کتنی لمبی ہوتی تھیں ۔ کتنی اس میں خوبی ہوتی تھیں اس کے بارے میں نہ پوچھو ۔ پھر آپ چار رکعتیں پڑھتے ۔ یہ چاروں بھی کتنی لمبی ہوتیں اور ان میں کتنی خوبی ہوتی ۔ اس کے متعلق نہ پوچھو ۔ پھر آپ تین رکعت وتر پڑھتے ، میں نے عرض کیا یا رسول اللہ ! آپ وتر پڑھنے سے پہلے کیوں سو جاتے ہیں ؟ آپ نے فرمایا : میری آنکھیں سوتی ہیں لیکن میرا دل بیدار رہتا ہے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 131990,
        "last_updated": null
    },
    {
        "urduURN": 4035290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3570,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے میرے بھائی ( عبدالحمید ) نے بیان کیا ، ان سے سلیمان بن بلال نے ، ان سے شریک بن عبداللہ بن ابی نمر نے ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا",
        "hadithText": "وہ مسجدالحرام سے نبی کریم صلی اللہ علیہ وسلم کی معراج کا واقعہ بیان کر رہے تھے کہ ( معراج سے پہلے ) تین فرشتے آئے ۔ یہ آپ پر وحی نازل ہونے سے بھی پہلے کا واقعہ ہے ۔ اس وقت آپ مسجدالحرام میں ( دو آدمیوں حضرت حمزہ اور جعفر بن ابی طالب کے درمیان ) سو رہے تھے ۔ ایک فرشتے نے پوچھا : وہ کون ہیں ؟ ( جن کو لے جانے کا حکم ہے ) دوسرے نے کہا کہ وہ درمیان والے ہیں ۔ وہی سب سے بہتر ہیں ۔ تیسرے نے کہا کہ پھر جو سب سے بہتر ہیں انہیں ساتھ لے چلو ۔ اس رات صرف اتنا ہی واقعہ ہو کر رہ گیا ۔ پھر آپ نے انہیں نہیں دیکھا ۔ لیکن فرشتے ایک اور رات میں آئے ۔ آپ دل کی نگاہ سے دیکھتے تھے اور آپ کی آنکھیں سوتی تھیں پر دل نہیں سوتا تھا ، اور تمام انبیاء کی یہی کیفیت ہوتی ہے کہ جب ان کی آنکھیں سوتی ہیں تو دل اس وقت بھی بیدار ہوتا ہے ۔ غرض کہ پھر جبرائیل علیہ السلام نے آپ کو اپنے ساتھ لیا اور آسمان پر چڑھا لے گئے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 132000,
        "last_updated": null
    },
    {
        "urduURN": 4035300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3571,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا ہم سے سلم بن زریر نے بیان کیا ، انہوں نے ابورجاء سے سنا کہ ہم سے عمران بن حصین رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "وہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھے ، رات بھر سب لوگ چلتے رہے جب صبح کا وقت قریب ہوا تو پڑاو کیا ( چونکہ ہم تھکے ہوئے تھے ) اس لیے سب لوگ اتنی گہری نیند سو گئے کہ سورج پوری طرح نکل آیا ۔ سب سے پہلے ابوبکر صدیق رضی اللہ عنہ جاگے ۔ لیکن آنحضرت صلی اللہ علیہ وسلم کو ، جب آپ سوتے ہوتے تو جگاتے نہیں تھے تاآنکہ آپ خود ہی جاگتے ، پھر عمر رضی اللہ عنہ بھی جاگ گئے ۔ آخر ابوبکر رضی اللہ عنہ آپ کے سرمبارک کے قریب بیٹھ گئے اور بلند آواز سے اللہ اکبر کہنے لگے ۔ اس سے آنحضرت صلی اللہ علیہ وسلم بھی جاگ گئے اور وہاں سے کوچ کا حکم دے دیا ۔ ( پھر کچھ فاصلے پر تشریف لائے ) اور یہاں آپ اترے اور آپ نے ہمیں صبح کی نماز پڑھائی ۔ ایک شخص ہم سے دور کونے میں بیٹھا رہا ۔ اس نے ہمارے ساتھ نماز نہیں پڑھی ۔ آنحضرت صلی اللہ علیہ وسلم جب نماز سے فارغ ہوئے تو آپ نے اس سے فرمایا : اے فلاں ! ہمارے ساتھ نماز پڑھنے سے تجھے کس چیز نے روکا ؟ اس نے عرض کیا کہ مجھے غسل کی حاجت ہو گئی ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے اسے حکم دیا کہ پاک مٹی سے تیمم کر لو ( پھر اس نے بھی تیمم کے بعد ) نماز پڑھی ۔ حضرت عمر ان رضی اللہ عنہ کہتے ہیں کہ پھر آنحضور صلی اللہ علیہ وسلم نے مجھے چند سواروں کے ساتھ آگے بھیج دیا ۔ ( تاکہ پانی تلاش کریں کیونکہ ) ہمیں سخت پیاس لگی ہوئی تھی ، اب ہم اسی حالت میں چل رہے تھے کہ ہمیں ایک عورت ملی جو دو مشکوں کے درمیان ( سواری پر ) اپنے پاؤں لٹکائے ہوئے جا رہی تھی ۔ ہم نے اس سے کہا کہ پانی کہاں ملتا ہے ؟ اس نے جواب دیا کہ یہاں پانی نہیں ہے ۔ ہم نے اس سے پوچھا کہ تمہارے گھر سے پانی کتنے فاصلے پر ہے ؟ اس نے جواب دیا کہ ایک دن ایک رات کا فاصلہ ہے ، ہم نے اس سے کہا کہ اچھا تم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں چلو ، وہ بولی رسول اللہ کے کیا معنی ہیں ؟ عمران رضی اللہ عنہ کہتے ہیں ، آخر ہم اسے آنحضور صلی اللہ علیہ وسلم کی خدمت میں لائے ، اس نے آپ سے بھی وہی کہا جو ہم سے کہہ چکی تھی ۔ ہاں اتنا اور کہا کہ وہ یتیم بچوں کی ماں ہے ( اس لیے واجب الرحم ہے ) آنحضرت صلی اللہ علیہ وسلم کے حکم سے اس کے دونوں مشکیزوں کو اتارا گیا اور آپ نے ان کے دہانوں پر دست مبارک پھیرا ۔ ہم چالیس پیاسے آدمیوں نے اس میں سے خوب سیراب ہو کر پیا اور اپنے تمام مشکیزے اور بالٹیاں بھی بھر لیں صرف ہم نے اونٹوں کو پانی نہیں پلایا ، اس کے باوجود اس کی مشکیں پانی سے اتنی بھری ہوئی تھیں کہ معلوم ہو تاتھا ابھی بہہ پڑیں گی ۔ اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جو کچھ تمہارے پاس ہے ( کھانے کی چیزوں میں سے ) میرے پاس لاؤ ۔ چنانچہ اس عورت کے لیے روٹی کے ٹکڑے اور کھجوریں لا کر جمع کر دیں گئیں ۔ پھر جب وہ اپنے قبیلے میں آئی تو اپنے آدمیوں سے اس نے کہا کہ آج میں سب سے بڑے جادوگر سے مل کر آئی ہوں یا پھر جیسا کہ ( اس کے ماننے والے ) لوگ کہتے ہیں ، وہ واقعی نبی ہے ۔ آخر اللہ تعالیٰ نے اس کے قبیلے کو اسی عورت کی وجہ سے ہدایت دی ، وہ خود بھی اسلام لائی اور تمام قبیلے والوں نے بھی اسلام قبول کر لیا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 132010,
        "last_updated": null
    },
    {
        "urduURN": 4035310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3572,
        "hadithSanad": "مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے ابن ابی عدی نے بیان کیا ، ان سے سعید بن ابی عروبہ نے ، ان سے قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ایک برتن حاضر کیا گیا ( پانی کا ) آنحضرت صلی اللہ علیہ وسلم اس وقت ( مدینہ کے نزدیک ) مقام زوراء میں تشریف رکھتے تھے ، آپ نے اس برتن میں ہاتھ رکھا تو اس میں سے پانی آپ کی انگلیوں کے درمیان سے پھوٹنے لگا اور اسی پانی سے پوری جماعت نے وضو کیا ۔ قتادہ نے کہا کہ میں نے انس رضی اللہ عنہ سے پوچھا : آپ لوگ کتنی تعداد میں تھے ؟ انہوں نے فرمایا کہ تین سو رہے ہوں گے یا تین سو کے قریب رہے ہوں گے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 132020,
        "last_updated": null
    },
    {
        "urduURN": 4035320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3573,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، انہوں نے کہا کہ ہم سے امام مالک نے بیان کیا ، ان سے اسحٰق بن عبداللہ بن ابی طلحہ نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا ، عصر کی نماز کا وقت ہو گیا تھا ، اور لوگ وضو کا پانی تلاش کر رہے تھے لیکن پانی کا کہیں پتہ نہیں تھا ، پھر آنحضرت صلی اللہ علیہ وسلم کی خدمت میں ( ایک برتن کے اندر ) وضو کا پانی لایا گیا ۔ آپ نے اپنا ہاتھ اس برتن میں رکھا اور لوگوں سے فرمایا کہ اسی پانی سے وضو کریں ۔ میں نے دیکھا کہ پانی آپ کی انگلیوں کے نیچے سے ابل رہا تھا چنانچہ لوگوں نے وضو کیا یہاں تک کہ ہر شخص نے وضو کر لیا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 132030,
        "last_updated": null
    },
    {
        "urduURN": 4035330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3574,
        "hadithSanad": "ہم سے عبدالرحمٰن بن مبارک نے بیان کیا ، انہوں نے کہا ہم سے حزم بن مہران نے بیان کیا ، انہوں نے کہا کہ میں نے امام حسن بصری سے سنا ، انہوں نے کہا کہ ہم سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کسی سفر میں تھے اور آپ کے ساتھ کچھ صحابہ کرام بھی تھے ، چلتے چلتے نماز کا وقت ہو گیا تو وضو کے لیے کہیں پانی نہیں ملا ۔ آخر جماعت میں سے ایک صاحب اٹھے اور ایک بڑے سے پیالے میں تھوڑا سا پانی لے کر حاضر خدمت ہوئے ۔ نبی کریم صلی اللہ علیہ وسلم نے اسے لیا اور اس کے پانی سے وضو کیا ۔ پھر آپ نے اپنا ہاتھ پیالے پر رکھا اور فرمایا کہ آو وضو کرو ، پوری جماعت نے وضو کیا اور تمام آداب و سنن کے ساتھ پوری طرح کر لیا ۔ ہم تعداد میں ستر یا اسی کے لگ بھگ تھے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 132040,
        "last_updated": null
    },
    {
        "urduURN": 4035340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3575,
        "hadithSanad": "ہم سے عبداللہ بن منیر نے بیان کیا ، انہوں نے یزید بن ہارون سے سنا ، کہا کہ مجھ کو حمید نے خبر دی اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نماز کا وقت ہو چکا تھا ، مسجدنبوی سے جن کے گھر قریب تھے انہوں نے تو وضو کر لیا لیکن بہت سے لوگ باقی رہ گئے ۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم کی خدمت میں پتھر کی بنی ہوئی ایک لگن لائی گئی ۔ اس میں پانی تھا ، آپ نے اپنا ہاتھ اس پر رکھا لیکن اس کا منہ اتنا تنگ تھا کہ آپ اس کے اندر اپنا ہاتھ پھیلا کر نہیں رکھ سکتے تھے ، چنانچہ آپ نے انگلیاں ملا لیں اور لگن کے اندر ہاتھ کو ڈال دیا پھر ( اسی پانی سے ) جتنے لوگ باقی رہ گئے تھے سب نے وضو کیا ۔ میں نے پوچھا کہ آپ حضرات کی تعداد کیا تھی ؟ انس رضی اللہ عنہ نے بتایا کہ اسّی آدمی تھے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 132050,
        "last_updated": null
    },
    {
        "urduURN": 4035350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3576,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے عبدالعزیز بن مسلم نے بیان کیا ، ان سے حصین نے بیان کیا ، ان سے سالم بن ابی الجعد نے اور ان سے حضرت جابر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "صلح حدیبیہ کے دن لوگوں کو پیاس لگی ہوئی تھی نبی کریم صلی اللہ علیہ وسلم کے سامنے ایک چھاگل رکھا ہوا تھا آپ نے فرمایا کیا بات ہے ؟ لوگوں نے کہا کہ جو پانی آپ کے سامنے ہے ۔ ، اس پانی کے سوا نہ تو ہمارے پاس وضو کے لیے کوئی دوسرا پانی ہے اور نہ پینے کے لیے ۔ آپ نے اپنا ہاتھ چھاگل میں رکھ دیا اور پانی آپ کی انگلیوں کے درمیان میں سے چشمے کی طرح پھوٹنے لگا اور ہم سب لوگوں نے اس پانی کو پیا بھی اور اس سے وضو بھی کیا ۔ میں نے پوچھا آپ لوگ کتنی تعداد میں تھے ؟ کہا کہ اگر ہم ایک لاکھ بھی ہوتے تو وہ پانی کافی ہوتا ۔ ویسے ہماری تعداد اس وقت پندرہ سو تھی ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 132060,
        "last_updated": null
    },
    {
        "urduURN": 4035360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3577,
        "hadithSanad": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے اسرائیل نے بیان کیا ، ان سے ابواسحٰق نے ، ان سے براء  بن عازب رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "صلح حدیبیہ کے دن ہم چودہ سو کی تعداد میں تھے ۔ حدیبیہ ایک کنویں کا نام ہے ہم نے اس سے اتنا پانی کھینچا کہ اس میں ایک قطرہ بھی باقی نہ رہا ( جب رسول کریم صلی اللہ علیہ وسلم کو اس کی خبر ہوئی تو آپ تشریف لائے ) اور کنویں کے کنارے بیٹھ کر پانی کی دعا کی اور اس پانی سے کلی کی اور کلی کا پانی کنویں میں ڈال دیا ۔ ابھی تھوڑی دیر بھی نہیں ہوئی تھی کہ کنواں پھر پانی سے بھر گیا ۔ ہم بھی اس سے خوب سیر ہوئے اور ہمارے اونٹ بھی سیراب ہو گئے ۔ یا پانی پی کر لوٹے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 132070,
        "last_updated": null
    },
    {
        "urduURN": 4035370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3578,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو مالک نے خبر دی ، انہیں اسحٰق بن عبداللہ بن ابی طلحہ نے اور انہوں نے انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے کہا کہ",
        "hadithText": "ابوطلحہ رضی اللہ عنہ نے ( میری والدہ ) ام سلیم رضی اللہ عنہما سے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کی آواز سنی تو آپ کی آواز میں بہت ضعف معلوم ہوا ۔ میرا خیال ہے کہ آپ بہت بھوکے ہیں کیا تمہارے پاس کچھ کھانا ہے ؟ انہوں نے کہا جی ہاں ، چنانچہ انہوں نے جو کی چند روٹیاں نکالیں ، پھر اپنی اوڑھنی نکالی او اس میں روٹیوں کو لپیٹ کر میرے ہاتھ میں چھپا دیا اور اس اوڑھنی کا دوسرا حصہ میرے بدن پر باندھ دیا ۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں مجھے بھیجا ۔ میں جو گیا تو آپ مسجد میں تشریف رکھتے تھے ۔ آپ کے ساتھ بہت سے صحابہ بھی بیٹھے ہوئے تھے ۔ میں آپ کے پاس کھڑا ہو گیا تو آپ نے فرمایا کیا ابوطلحہ نے تمہیں بھیجا ہے ؟ میں نے عرض کیا جی ہاں ۔ آپ نے دریافت فرمایا ، کچھ کھانا دے کر ؟ میں نے عرض کیا جی ہاں ، جو صحابہ آپ کے ساتھ اس وقت موجود تھے ، ان سب سے آپ نے فرمایا کہ چلو اٹھو ، آنحضرت تشریف لانے لگے اور میں آپ کے آگے آگے لپک رہا تھا اور ابوطلحہ رضی اللہ عنہ کے گھر پہنچ کر میں نے انہیں خبر دی ۔ ابوطلحہ رضی اللہ عنہ بولے ، ام سلیم ! حضور اکرم صلی اللہ علیہ وسلم تو بہت سے لوگوں کو ساتھ لائے ہیں ہمارے پاس اتنا کھانا کہاں ہے کہ سب کو کھلایا جا سکے ؟ ام سلیم رضی اللہ عنہ نے کہا : اللہ اور اس کے رسول صلی اللہ علیہ وسلم زیادہ جانتے ہیں ( ہم فکر کیوں کریں ؟ ) خیر ابوطلحہ آگے بڑھ کر آنحضرت صلی اللہ علیہ وسلم سے ملے ۔ اب رسول اللہ صلی اللہ علیہ وسلم کے ساتھ وہ بھی چل رہے تھے ۔ ام سلیم نے وہی روٹی لا کر آپ کے سامنے رکھ دی ، پھر آنحضرت صلی اللہ علیہ وسلم کے حکم سے روٹیوں کا چورا کر دیا گیا ، ام سلیم رضی اللہ عنہا نے کپی نچوڑ کر اس پر کچھ گھی ڈال دیا ، اور اس طرح سالن ہو گیا ، آپ نے اس کے بعد اس پر دعا کی جو کچھ بھی اللہ تعالیٰ نے چاہا ۔ پھر فرمایا دس آدمیوں کو بلا لو ، انہوں نے ایسا ہی کیا ، ان سب نے روٹی پیٹ بھر کر کھائی اور جب یہ لوگ باہر گئے تو آپ نے فرمایا کہ پھر دس آدمیوں کو بلا لو ۔ چنانچہ دس آدمیوں کو بلایا گیا ، انہوں نے بھی پیٹ بھر کر کھایا ، جب یہ لوگ باہر گئے تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر دس ہی آدمیوں کو اندر بلا لو ۔ انہوں نے ایسا ہی کیا اور انہوں نے بھی پیٹ بھر کر کھایا ۔ جب وہ باہر گئے تو آپ نے فرمایا کہ پھر دس آدمیوں کو دعوت دے دو ۔ اس طرح سب لوگوں نے پیٹ بھر کر کھانا کھایا ۔ ان لوگوں کی تعداد ستر یا اسی تھی ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 132080,
        "last_updated": null
    },
    {
        "urduURN": 4035380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3579,
        "hadithSanad": "مجھ سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے ابواحمد زبیری نے بیان کیا ، کہا ہم سے اسرائیل نے بیان کیا ، ان سے منصور نے ، ان سے ابراہیم نے ان سے علقمہ نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "معجزات کو ہم تو باعث برکت سمجھتے تھے اور تم لوگ ان سے ڈرتے ہو ۔ ایک مرتبہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھے اور پانی تقریباً ختم ہو گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جو کچھ بھی پانی بچ گیا ہو اسے تلاش کرو ۔ چنانچہ لوگ ایک برتن میں تھوڑا سا پانی لائے ۔ آپ نے اپنا ہاتھ برتن میں ڈال دیا اور فرمایا ، برکت والا پانی لو اور برکت تو اللہ تعالیٰ ہی کی طرف سے ہوتی ہے ، میں نے دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم کی انگلیوں کے درمیان میں سے پانی فوارے کی طرح پھوٹ رہا تھا اور ہم تو آنحضرت صلی اللہ علیہ وسلم کے زمانے میں کھاتے وقت کھانے کے تسبیح سنتے تھے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 132090,
        "last_updated": null
    },
    {
        "urduURN": 4035390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3580,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے زکریا نے بیان کیا کہا کہ مجھ سے عامر نے ، کہا کہ مجھ سے جابر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ان کے والد ( عبداللہ بن عمرو بن حرام ، جنگ احد میں ) شہید ہو گئے تھے ۔ اور وہ مقروض تھے ۔ میں رسول کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور میں نے عرض کیا کہ میرے والد اپنے اوپر قرض چھوڑ گئے ۔ ادھر میرے پاس سوا اس پیداوار کے جو کھجوروں سے ہو گی اور کچھ نہیں ہے اور اس کی پیداوار سے تو برسوں میں قرض ادا نہیں ہو سکتا ۔ اس لیے آپ میرے ساتھ تشریف لے چلیے تاکہ قرض خواہ آپ کو دیکھ کر زیادہ منہ نہ پھاڑیں ۔ آپ تشریف لائے ( لیکن وہ نہیں مانے ) تو آپ کھجور کے جو ڈھیر لگے ہوئے تھے پہلے ان میں سے ایک کے چاروں طرف چلے اور دعا کی ۔ اسی طرح دوسرے ڈھیر کے بھی ۔ پھر آپ اس پر بیٹھ گئے اور فرمایا کہ کھجوریں نکال کر انہیں دو ۔ چنانچہ سارا قرض ادا ہو گیا اور جتنی کھجوریں قرض میں دی تھیں اتنی ہی بچ گئیں ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 132100,
        "last_updated": null
    },
    {
        "urduURN": 4035400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3581,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے معتمر نے بیان کیا ، ان سے ان کے والد سلیمان نے بیان کیا ، کہا ہم سے ابوعثمان نہدی نے بیان کیا اور ان سے عبدالرحمٰن بن ابی بکر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "صفہ والے محتاج اور غریب لوگ تھے ، اور نبی کریم صلی اللہ علیہ وسلم نے ایک مرتبہ فرمایا تھا کہ جس کے گھر میں دو آدمیوں کا کھانا ہو تو وہ ایک تیسرے کو بھی اپنے ساتھ لیتا جائے اور جس کے گھر چار آدمیوں کا کھانا ہو وہ پانچواں آدمی اپنے ساتھ لیتا جائے یا چھٹے کو بھی یا آپ نے اسی طرح کچھ فرمایا ( راوی کو پانچ اور چھ میں شک ہے ) خیر تو ابوبکر رضی اللہ عنہ تین اصحاب صفہ کو اپنے ساتھ لائے اور آنحضرت صلی اللہ علیہ وسلم اپنے ساتھ دس اصحاب کو لے گئے اور گھر میں میں تھا اور میرے ماں باپ تھے ۔ ابوعثمان نے کہا مجھ کو یاد نہیں عبدالرحمٰن نے یہ بھی کہا ، اور میری عورت اور خادم جو میرے اور ابوبکر رضی اللہ عنہ دونوں کے گھروں میں کام کرتا تھا ۔ لیکن خود ابوبکر رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ کھانا کھایا اور عشاء کی نماز تک وہاں ٹھہرے رہے ( مہمانوں کو پہلے ہی بھیج چکے تھے ) اس لیے انہیں اتنا ٹھہرنا پڑا کہ آنحضرت صلی اللہ علیہ وسلم نے کھانا کھا لیا ۔ پھر اللہ تعالیٰ کو جتنامنظور تھا اتنا حصہ رات کا جب گزر گیا تو آپ گھر واپس آئے ۔ ان کی بیوی نے ان سے کہا ، کیا بات ہوئی ۔ آپ کو اپنے مہمان یاد نہیں رہے ؟ انہوں نے پوچھا : کیا مہمانوں کو اب تک کھانا نہیں کھلایا ؟ بیوی نے کہا کہ مہمانوں نے آپ کے آنے تک کھانے سے انکار کیا ۔ ان کے سامنے کھانا پیش کیا گیا تھا لیکن وہ نہیں مانے ۔ عبدالرحمٰن کہتے ہیں کہ میں تو جلدی سے چھپ گیا ( کیونکہ ابوبکر غصہ ہو گئے تھے ) آپ نے ڈانٹا ، اے پاجی ! اور بہت برا بھلا کہا ، پھر ( مہمانوں سے ) کہا چلو اب کھاؤ اور خود قسم کھا لی کہ میں تو کبھی نہ کھاؤں گا ۔ عبدالرحمٰن رضی اللہ عنہ نے بیان کیا کہ خدا کی قسم ، پھر ہم جو لقمہ بھی ( اس کھانے میں سے ) اٹھاتے تو جیسے نیچے سے کھانا اور زیادہ ہو جاتا تھا ( اتنی اس میں برکت ہوئی ) سب لوگوں نے شکم سیر ہو کر کھایا اور کھانا پہلے سے بھی زیادہ بچ رہا ۔ ابوبکر رضی اللہ عنہ نے جو دیکھا تو کھانا جوں کا توں تھا یا پہلے سے بھی زیادہ ۔ اس پر انہوں نے اپنی بیوی سے کہا ، اے بنی فراس کی بہن ( دیکھو تو یہ کیا معاملہ ہوا ) انہوں نے کہا ، کچھ بھی نہیں ، میری آنکھوں کی ٹھنڈک کی قسم ، کھانا تو پہلے سے تین گنا زیادہ معلوم ہوتا ہے ، پھر وہ کھانا ابوبکر رضی اللہ عنہ نے بھی کھایا اور فرمایا کہ یہ میرا قسم کھانا تو شیطان کا اغوا تھا ۔ ایک لقمہ کھا کر اسے آپ آنحضرت صلی اللہ علیہ وسلم کی خدمت میں لے گئے وہاں وہ صبح تک رکھا رہا ۔ اتفاق سے ایک کافر قوم جس کا ہم مسلمانوں سے معاہدہ تھا اور معاہدہ کی مدت ختم ہو چکی تھی ۔ ان سے لڑنے کے لیے فوج جمع کی گئی ۔ پھر ہم بارہ ٹکڑیاں ہو گئے اور ہر آدمی کے ساتھ کتنے آدمی تھے خدا معلوم مگر اتنا ضرور معلوم ہے کہ آپ نے ان نقیبوں کو لشکر والوں کے ساتھ بھیجا ۔ حاصل یہ کہ فوج والوں نے اس میں سے کھایا ۔ یا عبدالرحمٰن نے کچھ ایسا ہی کہا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 132110,
        "last_updated": null
    },
    {
        "urduURN": 4035410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3582,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے حماد نے بیان کیا ، ان سے عبدالعزیز نے اور ان سے انس رضی اللہ عنہ نے اس حدیث کو یونس سے بھی روایت کیا ہے ۔ ان سے ثابت نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں ایک سال قحط پڑا ۔ آپ جمعہ کی نماز کے لیے خطبہ دے رہے تھے کہ ایک شخص نے کھڑے ہو کر کہا : یا رسول اللہ ! گھوڑے بھوک سے ہلاک ہو گئے اور بکریاں بھی ہلاک ہو گئیں ، آپ اللہ تعالیٰ سے دعا کیجئے کہ وہ ہم پر پانی برسائے ۔ آنحضرت صلی اللہ علیہ وسلم نے اپنے ہاتھ اٹھائے اور دعا کی ۔ حضرت انس رضی اللہ عنہ نے بیان کیا کہ اس وقت آسمان شیشے کی طرح ( بالکل صاف ) تھا ۔ اتنے میں ہوا چلی ۔ اس نے ابر کو اٹھایا پھر ابر کے بہت سے ٹکڑے جمع ہو گئے اور آسمان نے گویا اپنے دہانے کھول دیئے ۔ ہم جب مسجد سے نکلے تو گھر پہنچتے پہنچتے پانی میں ڈوب چکے تھے ۔ بارش یوں ہی دوسرے جمعہ تک برابر ہوتی رہی ۔ دوسرے جمعہ کو وہی صاحب یا کوئی دوسرے پھر کھڑے ہوئے اور عرض کیا اے اللہ کے رسول ! مکانات گر گئے ۔ دعا فرمائیے کہ اللہ تعالیٰ بارش کو روک دے ۔ آنحضرت صلی اللہ علیہ وسلم مسکرائے اور فرمایا : اے اللہ ! اب ہمارے چاروں طرف بارش برسا ( جہاں اس کی ضرورت ہو ) ہم پر نہ برسا ۔ حضرت انس رضی اللہ عنہ کہتے ہیں کہ میں نے جو نظر اٹھائی تو دیکھا کہ اسی وقت ابر پھٹ کر مدینہ کے ارد گرسر پیچ کی طرح ہو گیا تھا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 132120,
        "last_updated": null
    },
    {
        "urduURN": 4035420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3583,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے ابوغسان یحییٰ بن کثیر نے بیان کیا ، انہوں نے کہا ہم سے ابوحفص نے جن کا نام عمر بن علاء ہے اور جو عمرو بن علاء کے بھائی ہیں ، بیان کیا ، کہا کہ میں نے نافع سے سنا اور انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ایک لکڑی کا سہارا لے کر خطبہ دیا کرتے تھے ، پھر جب منبر بن گیا تو آپ خطبہ کے لیے اس پر تشریف لے گئے ۔ اس پر اس لکڑی نے باریک آواز سے رونا شروع کر دیا ۔ آخر آپ اس کے قریب تشریف لائے اور اپنا ہاتھ اس پر پھیرا اور عبدالحمید نے کہا کہ ہمیں عثمان بن عمر نے خبر دی ، انہیں معاذ بن علاء نے خبر دی اور انہیں نافع نے اسی حدیث کی اور اس کی روایت ابوعاصم نے کی ، ان سے ابورواد نے ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے اور ابن عمر رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 132131,
        "last_updated": null
    },
    {
        "urduURN": 4035430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3584,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے عبدالواحد بن ایمن نے بیان کیا ، کہا کہ میں نے اپنے والد سے سنا اور انہوں نے جابر بن عبداللہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جمعہ کے دن خطبہ کے لیے ایک درخت ( کے تنے ) کے پاس کھڑے ہوتے ، یا ( بیان کیا کہ ) کھجور کے درخت کے پاس ۔ پھر ایک انصاری عورت نے یا کسی صحابی نے کہا : یا رسول اللہ ! کیوں نہ ہم آپ کے لیے ایک منبر تیار کر دیں ؟ آپ نے فرمایا : اگر تمہارا جی چاہے تو کر دو ۔ چنانچہ انہوں نے آپ کے لیے منبر تیار کر دیا ۔ جب جمعہ کا دن ہوا تو آپ اس منبر پر تشریف لے گئے ۔ اس پر اس کھجور کے تنے سے بچے کی طرح رونے کی آواز آنے لگی ۔ آنحضرت صلی اللہ علیہ وسلم منبر سے اترے اور اسے اپنے گلے سے لگا لیا ۔ جس طرح بچوں کو چپ کرنے کے لیے لوریاں دیتے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے بھی اسی طرح اسے چپ کرایا ، پھر آپ نے فرمایا کہ یہ تنا اس لیے رو رہا تھا کہ وہ اللہ کے اس ذکر کو سنا کرتا تھا جو اس کے قریب ہوتا تھا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 132150,
        "last_updated": null
    },
    {
        "urduURN": 4035440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3585,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، کہا کہ مجھ سے میرے بھائی نے بیان کیا ، ان سے سلیمان بن بلال نے ، ان سے یحییٰ بن سعید نے بیان کیا ، انہیں حفص بن عبیداللہ بن انس بن مالک نے خبر دی اور انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "مسجدنبوی کی چھت کھجور کے تنوں پر بنائی گئی تھی ۔ نبی کریم صلی اللہ علیہ وسلم جب خطبہ کے لیے تشریف لاتے تو آپ ان میں سے ایک تنے کے پاس کھڑے ہو جاتے لیکن جب آپ کے لیے منبر بنا دیا گیا تو آپ اس پر تشریف لائے ، پھر ہم نے اس تنے سے اس طرح کی رونے کی آواز سنی جیسی بوقت ولادت اونٹنی کی آواز ہوتی ہے ۔ آخر جب آنحضرت صلی اللہ علیہ وسلم نے اس کے قریب آ کر اس پر ہاتھ رکھا تو وہ چپ ہوا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 132160,
        "last_updated": null
    },
    {
        "urduURN": 4035450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3586,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے ابن ابی عدی نے بیان کیا ، ان سے شعبہ نے ، ( دوسری سند ) کہا مجھ سے بشر بن خالد نے بیان کیا ، کہا ہم سے محمد بن جعفر نے ، ان سے شعبہ نے ، ان سے سلیمان نے ، انہوں نے ابووائل سے سنا ، وہ حذیفہ رضی اللہ عنہ سے بیان کرتے تھے کہ",
        "hadithText": "عمر بن خطاب رضی اللہ عنہ نے پوچھا فتنہ کے بارے میں رسول اللہ صلی اللہ علیہ وسلم کی حدیث کس کو یاد ہے ؟ حذیفہ رضی اللہ عنہ بولے کہ مجھے زیادہ یاد ہے جس طرح رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا ۔ عمر رضی اللہ عنہ نے کہا پھر بیان کرو ( ماشاء اللہ ) تم تو بہت جری ہو ۔ انہوں نے بیان کیا کہ رسول اللہ نے فرمایا : انسان کی ایک آزمائش ( فتنہ ) تو اس کے گھر مال اور پڑوس میں ہوتا ہے جس کا کفارہ ، نماز ، روزہ ، صدقہ اور امر بالمعروف اورنہی عن المنکر جیس نیکیاں بن جاتی ہیں ۔ عمر رضی اللہ عنہ نے کہا کہ میں اس کے متعلق نہیں پوچھتا ، بلکہ میری مراد اس فتنہ سے ہے جو سمندر کی طرح ( ٹھاٹھیں مارتا ) ہو گا ۔ انہوں نے کہا اس فتنہ کا آپ پر کوئی اثر نہیں پڑے گا ۔ آپ کے اور اس فتنہ کے درمیان بند دروازہ ہے حضرت عمر نے پوچھا وہ دروازہ کھولا جائے گا یا توڑا جائے گا ۔ انہوں نے کہا کہ نہیں بلکہ توڑ دیا جائے گا ۔ حضرت عمر نے اس پر فرمایا کہ پھر تو بند نہ ہو سکے گا ۔ ہم نے حذیفہ رضی اللہ عنہ سے پوچھا ، کیا عمر رضی اللہ عنہ اس دروازے کے متعلق جانتے تھے ؟ انہوں نے فرمایا کہ اسی طرح جانتے تھے جیسے دن کے بعد رات کے آنے کو ہر شخص جانتا ہے ۔ میں نے ایسی حدیث بیان کی جو غلط نہیں تھی ۔ ہمیں حضرت حذیفہ رضی اللہ عنہ سے ( دروازہ کے متعلق ) پوچھتے ہوئے ڈر معلوم ہوا ۔ اس لیے ہم نے مسروق سے کہا تو انہوں نے پوچھا کہ وہ دروازہ کون ہیں ؟ تو انہوں نے بتایا کہ وہ خود عمر رضی اللہ عنہ ہی ہیں ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 132170,
        "last_updated": null
    },
    {
        "urduURN": 4035460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3587,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، کہا ہم سے ابوالزناد نے بیان کیاان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، قیامت اس وقت تک نہیں قائم ہو گی جب تک تم ایک ایسی قوم کے ساتھ جنگ نہ کر لو جن کے جوتے بال کے ہوں اور جب تک تم ترکوں سے جنگ نہ کر لو ، جن کی آنکھیں چھوٹی ہوں گی ، چہرے سرخ ہوں گے ، ناک چھوٹی اور چپٹی ہو گی ، چہرے ایسے ہوں گے جیسے تہ بتہ ڈھال ہوتی ہے ۔ \nاور تم حکومت کے لیے سب سے زیادہ بہتر شخص اسے پاؤ گے جو حکومت کرنے کو برا جانے ( یعنی اس منصب کو خود کے لیے ناپسند کرے ) یہاں تک کہ وہ اس میں پھنس جائے ۔ لوگوں کی مثال کان کی سی ہے جو جاہلیت میں شریف تھے ، وہ اسلام لانے کے بعد بھی شریف ہیں ۔ \nاور تم پر ایک ایسا دور بھی آنے والا ہے کہ تم میں سے کوئی اپنے سارے گھربار اور مال و دولت سے بڑھ کر مجھ کو دیکھ لینا زیادہ پسند کرے گا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 132180,
        "last_updated": null
    },
    {
        "urduURN": 4035490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3590,
        "hadithSanad": "مجھ سے یحییٰ نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، ان سے معمر نے اور ان سے ہمام نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا : قیامت اس وقت تک قائم نہ ہو گی جب تک کہ تم ایرانیوں کے شہر خوز اور کرمان والوں سے جنگ نہ کر لو گے ۔ چہرے ان کے سرخ ہوں گے ۔ ناک چپٹی ہو گی ۔ آنکھیں چھوٹی ہوں گی اور چہرے ایسے ہوں گے جیسے تہ بہ تہ ڈھال ہوتی ہے اور ان کے جوتے بالوں والے ہوں گے ۔ یحییٰ کے علاوہ اس حدیث کو اوروں نے بھی عبدالرزاق سے روایت کیا ہے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 132190,
        "last_updated": null
    },
    {
        "urduURN": 4035500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3591,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا کہ اسماعیل نے بیان کیا کہ مجھ کو قیس نے خبر دی ، انہوں نے کہا کہ",
        "hadithText": "ہم ابوہریرہ رضی اللہ عنہ کی خدمت میں حاضر ہوئے تو انہوں نے کہا کہ میں رسول اللہ صلی اللہ علیہ وسلم کی صحبت میں تین سال رہا ہوں ، اپنی پوری عمر میں مجھے حدیث یاد کرنے کا اتنا شوق کبھی نہیں ہوا جتنا ان تین سالوں میں تھا ۔ میں نے آنحضرت صلی اللہ علیہ وسلم کو فرماتے سنا ، آپ نے اپنے ہاتھ سے یوں اشارہ کر کے فرمایا کہ قیامت کے قریب تم لوگ ( مسلمان ) ایک ایسی قوم سے جنگ کرو گے جن کے جوتے بالوں کے ہوں گے ( مراد یہی ایرانی ہیں ) سفیان نے ایک مرتبہ وھو ھذا البارز کے بجائے الفاظ وھم اھل البارزنقل کئے ( یعنی ایرانی ، یا کر دی ، یا دیلم والے لوگ مراد ہیں ) ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 132200,
        "last_updated": null
    },
    {
        "urduURN": 4035510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3592,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے جریر بن حازم نے بیان کیا ، کہا میں نے حسن سے سنا ، انہوں نے بیان کیا کہ ہم سے عمرو بن تغلب رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا ، قیامت کے قریب تم ایک ایسی قوم سے جنگ کرو گے جو بالوں کا جوتا پہنتی ہو گی اور ایک ایسی قوم سے جنگ کرو گے جن کے منہ تہ بہ تہ ڈھالوں کی طرح ہوں گے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 132210,
        "last_updated": null
    },
    {
        "urduURN": 4035520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3593,
        "hadithSanad": "ہم سے حکم بن نافع نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، کہا کہ مجھے سالم بن عبداللہ نے خبر دی کہ عبداللہ بن عمر رضی اللہ عنہما نے بیان کیاکہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے سنا تھا کہ تم یہودیوں سے ایک جنگ کرو گے اور اس میں ان پر غالب آ جاؤ گے ، اس وقت یہ کیفیت ہو گی کہ ( اگر کوئی یہودی جان بچانے کے لیے کسی پہاڑ میں بھی چھپ جائے گا تو ) پتھر بولے گا کہ اے مسلمان ! یہ یہودی میری آڑ میں چھپا ہوا ہے ، اسے قتل کر دے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 132220,
        "last_updated": null
    },
    {
        "urduURN": 4035530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3594,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے عمرو نے ، ان سے جابر بن عبداللہ رضی اللہ عنہما نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا لوگوں پر ایک ایسا زمانہ آئے گا کہ جہاد کے لیے فوج جمع ہو گی ، پوچھا جائے گا کہ فوج میں کوئی ایسے بزرگ بھی ہیں جنہوں نے رسول اللہ صلی اللہ علیہ وسلم کی صحبت اٹھائی ہو ؟ ان سے کہا جائے گا کہ ہاں ہیں تو ان کے ذریعہ فتح کی دعا مانگی جائے گی ، پھر ایک جہاد ہو گا اور پوچھا جائے گا : کیا فوج میں کوئی ایسے شخص ہیں جنہوں نے رسول اللہ صلی اللہ علیہ وسلم کے کسی صحابی کی صحبت اٹھائی ہو ؟ ان سے کہا جائے گا کہ ہاں ہیں تو ان کے ذریعہ فتح کی دعا مانگی جائے گا ۔ پھر ان کی دعا کی برکت سے فتح ہو گی ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 132230,
        "last_updated": null
    },
    {
        "urduURN": 4035540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3595,
        "hadithSanad": "مجھ سے محمد بن حکم نے بیان کیا ، کہا ہم کو نضر نے خبر دی ، کہا ہم کو اسرائیل نے خبر دی ، کہا ہم کو سعد طائی نے خبر دی ، انہیں محل بن خلیفہ نے خبر دی ، ان سے عدی بن حاتم رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر تھا کہ ایک صاحب آئے اور آنحضرت صلی اللہ علیہ وسلم سے فقر و فاقہ کی شکایت کی ، پھر دوسرے صاحب آئے اور راستوں کی بدامنی کی شکایت کی ، اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، عدی ! تم نے مقام حیرہ دیکھا ہے ؟ ( جو کوفہ کے پاس ایک بستی ہے ) میں نے عرض کیا کہ میں نے دیکھا تو نہیں ، البتہ اس کا نام میں نے سنا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا : اگر تمہاری زندگی کچھ اور لمبی ہوئی تو تم دیکھو گے کہ ہودج میں ایک عورت اکیلی حیرہ سے سفر کرے گی اور ( مکہ پہنچ کر ) کعبہ کا طواف کرے گی اور اللہ کے سوا اسے کسی کا بھی خوف نہ ہو گا ۔ میں نے ( حیرت سے ) اپنے دل میں کہا ، پھر قبیلہ طے کے ان ڈاکوؤں کا کیا ہو گا جنہوں نے شہروں کو تباہ کر دیا ہے اور فساد کی آگ سلگار کھی ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا : اگر تم کچھ اور دنوں تک زندہ رہے تو کسریٰ کے خزانے ( تم پر ) کھولے جائیں گے ۔ میں ( حیرت میں ) بول پڑا کسریٰ بن ہرمز ( ایران کا بادشاہ ) کسریٰ آپ نے فرمایا : ہاں کسریٰ بن ہرمز ! اور اگر تم کچھ دنوں تک اور زندہ رہے تو یہ بھی دیکھو گے کہ ایک شخص اپنے ہاتھ میں سونا چاندی بھر کر نکلے گا ، اسے کسی ایسے آدمی کی تلاش ہو گی ( جو اس کی زکوٰۃ ) قبول کر لے لیکن اسے کوئی ایسا آدمی نہیں ملے گا جو اسے قبول کر لے ، اللہ تعالیٰ سے ملاقات کا جو دن مقرر ہے اس وقت تم میں سے ہر کوئی اللہ سے اس حال میں ملاقات کرے گا کہ درمیان میں کوئی ترجمان نہ ہو گا ( بلکہ پروردگار اس سے بلاواسطہ باتیں کرے گا ) اللہ تعالیٰ اس سے دریافت کرے گا ۔ کیا میں نے تمہارے پاس رسول نہیں بھیجے تھے جنہوں نے تم تک میرا پیغام پہنچا دیا ہو ؟ وہ عرض کرے گا بیشک تو نے بھیجا تھا ۔ اللہ تعالیٰ دریافت فرمائے گا کیا میں نے مال اور اولاد تمہیں نہیں دی تھی ؟ کیا میں نے ان کے ذریعہ تمہیں فضیلت نہیں دی تھی ؟ وہ جواب دے گا بیشک تو نے دیا تھا ۔ پھر وہ اپنی داہنی طرف دیکھے گا تو سوا جہنم کے اسے اور کچھ نظر نہ آئے گا پھر وہ بائیں طرف دیکھے گا تو ادھر بھی جہنم کے سوا اور کچھ نظر نہیں آئے گا ، عدی رضی اللہ عنہ نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے کہ جہنم سے ڈرو ، اگرچہ کھجور کے ایک ٹکڑے کے ذریعہ ہو ۔ اگر کسی کو کھجور کا ایک ٹکڑا بھی میسر نہ آ سکے تو ( کسی سے ) ایک اچھا کلمہ ہی کہہ دے ۔ حضرت عدی رضی اللہ عنہ نے بیان کیا کہ میں نے ہودج میں بیٹھی ہوئی ایک اکیلی عورت کو تو خود دیکھ لیا کہ حیرہ سے سفر کے لیے نکلی اور ( مکہ پہنچ کر ) اس نے کعبہ کا طواف کیا اور اسے اللہ کے سوا اور کسی سے ( ڈاکو وغیرہ ) کا ( راستے میں ) خوف نہیں تھا اور مجاہدین کی اس جماعت میں تو میں خود شریک تھا جس نے کسریٰ بن ہرمز کے خزانے فتح کئے ۔ اور اگر تم لوگ کچھ دنوں اور زندہ رہے تو وہ بھی دیکھ لو گے جو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ایک شخص اپنے ہاتھ میں ( زکوٰۃ کا سونا چاندی ) بھر کر نکلے گا ( لیکن اسے لینے والا کوئی نہیں ملے گا ) مجھ سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے ابوعاصم نے بیان کیا ، کہا ہم کو سعد ان بن بشر نے خبر دی ، ان سے ابو مجاہد نے بیان کیا ، ان سے محل بن خلیفہ نے بیان کیا ، اور انہوں نے عدی رضی اللہ سنے سنا کہ میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر تھا ، پھر یہی حدیث نقل کی جو اوپر مذکور ہوئی ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 132240,
        "last_updated": null
    },
    {
        "urduURN": 4035550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3596,
        "hadithSanad": "مجھ سے سعید بن شرحبیل نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے یزید بن حبیب نے ، ان سے ابوالخیر نے ، ان سے عقبہ بن عامر رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ایک دن مدینہ سے باہر نکلے اور شہداء احد پر نماز پڑھی جیسے میت پر پڑھتے ہیں اس کے بعد آپ صلی اللہ علیہ وسلم منبر پر تشریف لائے اور آپ صلی اللہ علیہ وسلم نے فرمایا ، میں ( حوض کوثر پر ) تم سے پہلے پہنچوں گا اور قیامت کے دن تمہارے لیے میر سامان بنوں گا ۔ میں تم پر گواہی دوں گا اور اللہ کی قسم میں اپنے حوض کوثر کو اس وقت بھی دیکھ رہا ہوں ، مجھے روئے زمین کے خزانوں کی کنجیاں دی گئی ہیں اور قسم اللہ کی مجھے تمہارے بارے میں یہ خوف نہیں کہ تم شرک کرنے لگو گے ۔ میں تو اس سے ڈرتا ہوں کہ کہیں دنیا داری میں پڑ کر ایک دوسرے سے رشک و حسد نہ کرنے لگو ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 132260,
        "last_updated": null
    },
    {
        "urduURN": 4035560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3597,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، ان سے سفیان بن عیینہ نے بیان کیا ، ان سے زہری نے ، ان سے عروہ بن زبیر نے اور ان سے اسامہ بن زید رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ایک مرتبہ مدینہ کے ایک بلند ٹیلہ پر چڑھے اور فرمایا ، جو کچھ میں دیکھ رہا ہوں کیا تمہیں بھی نظر آ رہا ہے ؟ میں فتنوں کو دیکھ رہا ہوں کہ تمہارے گھروں میں وہ اس طرح گر رہے ہیں جیسے بارش کی بوندیں گرا کرتیں ہیں ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 132270,
        "last_updated": null
    },
    {
        "urduURN": 4035570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3598,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم سے شعیب نے خبر دی ، انہیں زہری نے ، کہا کہ مجھ سے عروہ بن زبیرنے بیان کیا ، ان سے زینب بنت ابی سلمہ نے بیان کیا ، ان سے ام حبیبہ بنت ابی سفیان رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "ہم کو زینب بنت ابی جحش رضی اللہ عنہا نے خبر دی کہ ایک دن نبی کریم صلی اللہ علیہ وسلم ان کے گھر تشریف لائے تو آپ بہت پریشان نظر آ رہے تھے اور یہ فرما رہے تھے کہ اللہ تعالیٰ کے سوا اور کوئی معبود نہیں ، عرب کے لیے تباہی اس شر سے آئے گی جس کے واقع ہونے کا زمانہ قریب آ گیا ہے ۔ آج یاجوج ماجوج کی دیوار میں اتنا شگاف پیدا ہو گیا ہے اور آپ نے انگلیوں سے حلقہ بنا کر اس کی وضاحت کی ۔ ام المؤمنین زینب رضی اللہ عنہا نے بیان کیا کہ میں نے عرض کیا : یا رسول اللہ ! ہم میں نیک لوگ ہوں گے پھر بھی ہم ہلاک کر دیئے جائیں گے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں جب خباثتیں بڑھ جائیں گی ( تو ایسا ہو گا ) ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 132280,
        "last_updated": null
    },
    {
        "urduURN": 4035580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3599,
        "hadithSanad": "اور زہری سے روایت ہے ، ان سے ہندبنت الحارث نے بیان کیا کہ حضرت ام سلمہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم بیدار ہوئے تو فرمایا : سبحان اللہ ! کیسے کیسے خزانے اترے ہیں ( جو مسلمانوں کو ملیں گے ) اور کیا کیا فتنے و فساد اترے ہیں ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 132290,
        "last_updated": null
    },
    {
        "urduURN": 4035590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3600,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے عبدالعزیز بن ابی سلمہ بن ماجشون نے بیان کیا ، ان سے عبدالرحمٰن بن ابی صعصعہ نے ، ان سے ان کے والد نے کہا ، ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں دیکھ رہا ہوں کہ تمہیں بکریوں سے بہت محبت ہے اور تم انہیں پالتے ہو تو تم ان کی نگہداشت اچھی کیا کرو اور ان کی ناک کی صفائی کا بھی خیال رکھا کرو ۔ کیونکہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا کہ لوگوں پر ایسا زمانہ آئے گا کہ مسلمان کا سب سے عمدہ مال اس کی بکریاں ہوں گی جنہیں لے کر وہ پہاڑ کی چوٹیوں پر چڑھ جائے گا یا ( آپ نے سعف الجبال کے لفظ فرمائے ) وہ بارش گرنے کی جگہ میں چلا جائے گا ۔ اس طرح وہ اپنے دین کو فتنوں سے بچانے کے لیے بھاگتا پھرے گا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 132300,
        "last_updated": null
    },
    {
        "urduURN": 4035600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3601,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا ، انہوں نے کہا ہم سے ابراہیم نے بیان کیا ، ان سے صالح بن کیسان نے بیان کیا ، ان سے ابن شہاب نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، فتنوں کا دور جب آئے گا تو اس میں بیٹھنے والا کھڑا رہنے والے سے بہتر ہو گا ، کھڑا رہنے والا چلنے والے سے بہتر ہو گا اور چلنے والا دوڑ نے والے سے بہتر ہو گا جو اس میں جھانکے گا فتنہ بھی اسے اچک لے گا اور اس وقت جسے جہاں بھی پناہ مل جائے بس وہیں پناہ پکڑ لے تاکہ اپنے دین کو فتنوں سے بچا سکے ۔ \n<span class=urdu_sanad>اور ابن شہاب سے روایت ہے ، ان سے ابوبکر بن عبدالرحمٰن بن حارث نے بیان کیا ، ان سے عبدالرحمٰن بن مطیع بن اسود نے اور ان سے نوفل بن معاویہ نے ابوہریرہ رضی اللہ عنہ کی اسی حدیث کی طرح البتہ ابوبکر ( راوی حدیث ) نے اس روایت میں اتنا اور زیادہ بیان کیا کہ</span> نمازوں میں ایک نماز ایسی ہے کہ جس سے وہ چھوٹ جائے گویا اس کا گھربار سب برباد ہو گئے ۔ ( اور وہ عصر کی نماز ہے ) ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 132311,
        "last_updated": null
    },
    {
        "urduURN": 4035620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3603,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو سفیان نے خبر دی ، انہیں اعمش نے ، انہیں زید بن وہب نے اور انہیں عبداللہ بن مسعود رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میرے بعد تم پر ایک ایسا زمانہ آئے گا جس میں تم پر دوسروں کو مقدم کیا جائے گا اور ایسی باتیں سامنے آئیں گی جن کو تم برا سمجھو گے ، لوگوں نے عرض کیا ، یا رسول اللہ ! اس وقت ہمیں آپ کیا حکم فرماتے ہیں ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جو حقوق تم پر دوسروں کے واجب ہوں انہیں ادا کرتے رہنا اور اپنے حقوق اللہ ہی سے مانگنا ۔ ( یعنی صبر کرنا اور اپنا حق لینے کے لیے خلیفہ اور حاکم وقت سے بغاوت نہ کرنا ) ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 132330,
        "last_updated": null
    },
    {
        "urduURN": 4035630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3604,
        "hadithSanad": "مجھ سے محمد بن عبدالرحیم نے بیان کیا ، کہا ہم سے ابومعمر اسماعیل بن ابراہیم نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ابوالتیاح نے ، ان سے ابوزرعہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اس قبیلہ قریش کے بعض آدمی لوگوں کو ہلاک و برباد کر دیں گے ۔ صحابہ نے عرض کیا : ایسے وقت کے لیے آپ ہمیں کیا حکم فرماتے ہیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا : کاش لوگ ان سے بس الگ ہی رہتے ۔ محمود بن غیلان نے بیان کیا کہ ہم سے ابوداؤد طیالسی نے بیان کیا ، کہا ہم کو شعبہ نے خبر دی ، انہیں ابوالتیاح نے ، انہوں نے ابوزرعہ سے سنا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 132340,
        "last_updated": null
    },
    {
        "urduURN": 4035640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3605,
        "hadithSanad": "مجھ سے احمد محمد مکی نے بیان کیا ، کہا ہم سے عمرو بن یحییٰ بن سعید اموی نے بیان کیا ، ان سے ان کے دادا نے بیان کیا کہ",
        "hadithText": "میں مروان بن حکم اور حضرت ابوہریرہ رضی اللہ عنہ کے ساتھ تھا ، اس وقت میں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے کہا کہ میں نے سچوں کے سچے رسول کریم صلی اللہ علیہ وسلم سے سنا ہے ، آپ فرما رہے تھے کہ میری امت کی بربادی قریش کے چند لڑکوں کے ہاتھوں پر ہو گی ۔ مروان نے پوچھا : نوجوان لڑکوں کے ہاتھ پر ؟ اس پر ابوہریرہ رضی اللہ عنہ نے کہا کہ اگر تم چاہو تو میں ان کے نام بھی لے دوں کہ وہ بنی فلاں اور بنی فلاں ہوں گے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 132350,
        "last_updated": null
    },
    {
        "urduURN": 4035650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3606,
        "hadithSanad": "ہم سے یحییٰ بن موسیٰ نے بیان کیا ، کہا ہم سے ولید نے بیان کیا ، کہا کہ مجھ سے ابن جابر نے ، کہا کہ مجھ سے بسر بن عبیداللہ حضرمی نے ، کہا کہ مجھ سے ابوادریس خولانی نے بیان کیا ، انہوں نے حذیفہ بن یمان رضی اللہ عنہ سے سنا ، وہ بیان کرتے تھے کہ",
        "hadithText": "دوسرے صحابہ کرام تو رسول اللہ صلی اللہ علیہ وسلم سے خیر کے متعلق سوال کیا کرتے تھے لیکن میں شر کے بارے میں پوچھتا تھا اس خوف سے کہ کہیں میں ان میں نہ پھنس جاؤں ۔ تو میں نے ایک مرتبہ رسول کریم صلی اللہ علیہ وسلم سے سوال کیا ، یا رسول اللہ ! ہم جاہلیت اور شر کے زمانے میں تھے ۔ پھر اللہ تعالیٰ نے ہمیں یہ خیر و برکت ( اسلام کی ) عطا فرمائی ، اب کیا اس خیر کے بعد پھر شر کا کوئی زمانہ آئے گا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں ، میں نے سوال کیا ، اور اس شر کے بعد پھر خیر کا کوئی زمانہ آئے گا ؟ آپ نے فرمایا کہ ہاں ، لیکن اس خیر پر کچھ دھواں ہو گا ۔ میں نے عرض کیا وہ دھواں کیا ہو گا ؟ آپ نے جواب دیا کہ ایسے لوگ پیدا ہوں گے جو میری سنت اور طریقے کے علاوہ دوسرے طریقے اختیار کریں گے ۔ ان میں کوئی بات اچھی ہو گی کوئی بری ۔ میں نے سوال کیا : کیا اس خیر کے بعد پھر شر کا کوئی زمانہ آئے گا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں ، جہنم کے دروازوں کی طرف بلانے والے پیدا ہوں گے ، جوان کی بات قبول کرے گا اسے وہ جہنم میں جھونک دیں گے ۔ میں نے عرض کیا : یا رسول اللہ ! ان کے اوصاف بھی بیان فرما دیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ وہ لوگ ہماری ہی قوم و مذہب کے ہوں گے ۔ ہماری ہی زبان بولیں گے ۔ میں نے عرض کیا ، پھر اگر میں ان لوگوں کا زمانہ پاؤں تو میرے لیے آپ کا حکم کیا ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ مسلمانوں کی جماعت اور ان کے امام کو لازم پکڑنا ، میں نے عرض کیا اگر مسلمانوں کی کوئی جماعت نہ ہو اور نہ ان کا کوئی امام ہو ۔ آپ نے فرمایا : پھر ان تمام فرقوں سے اپنے کو الگ رکھنا ۔ اگرچہ تجھے اس کے لیے کسی درخت کی جڑ چبانی پڑے ، یہاں تک کہ تیری موت آ جائے اور تو اسی حالت پر ہو ( تو یہ تیرے حق میں ان کی صحبت میں رہنے سے بہتر ہو گا ) ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 113,
        "matchingArabicURN": 132360,
        "last_updated": null
    },
    {
        "urduURN": 4035660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3607,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا مجھ سے یحییٰ بن سعید نے ، ان سے اسماعیل نے بیان کیا ، کہا مجھ سے قیس نے بیان کیا ، ان سے حذیفہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میرے ساتھیوں نے ( یعنی صحابہ رضی اللہ عنہم نے ) تو آنحضرت صلی اللہ علیہ وسلم سے بھلائی کے حالات سیکھے اور میں نے برائی کے حالات دریافت کئے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 114,
        "matchingArabicURN": 132370,
        "last_updated": null
    },
    {
        "urduURN": 4035670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3608,
        "hadithSanad": "ہم سے حکم بن نافع نے بیان کیا ، کہا ہم سے شعیب نے بیان کیا ، ان سے زہری نے بیان کیا ، کہا مجھے ابوسلمہ نے خبر دی اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، قیامت اس وقت تک قائم نہیں ہو گی جب تک دو جماعتیں ( مسلمانوں کی ) آپس میں جنگ نہ کر لیں اور دونوں کا دعویٰ ایک ہو گا ( کہ وہ حق پر ہیں ) ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 115,
        "matchingArabicURN": 132380,
        "last_updated": null
    },
    {
        "urduURN": 4035680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3609,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں ہمام نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، قیامت اس وقت تک قائم نہ ہو گی جب تک دو جماعتیں آپس میں جنگ نہ کر لیں ۔ دونوں میں بڑی بھاری جنگ ہو گی ۔ حالانکہ دونوں کا دعویٰ ایک ہی ہو گا اور قیامت اس وقت تک قائم نہ ہو گی جب تک تقریباً تیس جھوٹے دجال پیدا نہ ہو لیں ۔ ان میں ہر ایک کا یہی گمان ہو گا کہ وہ اللہ کا نبی ہے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 116,
        "matchingArabicURN": 132390,
        "last_updated": null
    },
    {
        "urduURN": 4035690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3610,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، کہا مجھ کو ابوسلمہ بن عبدالرحمٰن نے خبر دی اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں موجود تھے اور آپ ( جنگ حنین کا مال غنیمت ) تقسیم فرما رہے تھے اتنے میں بنی تمیم کا ایک شخص ذوالخویصرہ نامی آیا اور کہنے لگا کہ یا رسول اللہ ! انصاف سے کام لیجئے ۔ یہ سن کر آنحضرت صلی اللہ علیہ وسلم نے فرمایا : افسوس ! اگر میں ہی انصاف نہ کروں تو دنیا میں پھر کون انصاف کرے گا ۔ اگر میں ظالم ہو جاؤں تب تو میری بھی تباہی اور بربادی ہو جائے ۔ حضرت عمر رضی اللہ عنہ نے عرض کیا حضور ! اس کے بارے میں مجھے اجازت دیں میں اس کی گردن مار دوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اسے چھوڑ دو ۔ اس کے جوڑ کے کچھ لوگ پیدا ہوں گے کہ تم اپنے روزوں کو ان کے روزوں کے مقابل ناچیز سمجھو گے ۔ وہ قرآن کی تلاوت کریں گے لیکن وہ ان کے حلق کے نیچے نہیں اترے گا ۔ یہ لوگ دین سے اس طرح نکل جائیں گے جیسے زوردار تیر جانور سے پار ہو جاتا ہے ۔ اس تیر کے پھل کو اگر دیکھا جائے تو اس میں کوئی چیز ( خون وغیرہ ) نظر نہ آئے گی پھر اس کے پٹھے کو اگر دیکھا جائے تو چھڑ میں اس کے پھل کے داخل ہونے کی جگہ سے اوپر جو لگایا جاتا ہے تو وہاں بھی کچھ نہ ملے گا ۔ اس کے نفی ( نفی تیر میں لگائی جانے والی لکڑی کو کہتے ہیں ) کو دیکھا جائے تو وہاں بھی کچھ نشان نہیں ملے گا ۔ اسی طرح اگر اس کے پر کو دیکھا جائے تو اس میں بھی کچھ نہیں ملے گا ۔ حالانکہ گندگی اور خون سے وہ تیر گزرا ہے ۔ ان کی علامت ایک کالا شخص ہو گا ۔ اس کا ایک بازو عورت کے پستان کی طرح ( اٹھا ہوا ) ہو گا یا گوشت کے لوتھڑے کی طرح ہو گا اور حرکت کر رہا ہو گا ۔ یہ لوگ مسلمانوں کے بہترین گروہ سے بغاوت کریں گے ، حضرت ابو سعید خدری رضی اللہ عنہ نے کہا کہ میں گواہی دیتا ہوں کہ میں نے یہ حدیث رسول اللہ صلی اللہ علیہ وسلم سے سنی تھی اور میں گواہی دیتا ہوں کہ حضرت علی بن ابی طالب رضی اللہ عنہ نے ان سے جنگ کی تھی ( یعنی خوارج سے ) اس وقت میں بھی حضرت علی رضی اللہ عنہ کے ساتھ تھا ۔ اور انہوں نے اس شخص کو تلاش کرایا ( جسے آنحضرت صلی اللہ علیہ وسلم نے اس گروہ کی علامت کے طور پر بتلایا تھا ) آخر وہ لایا گیا ۔ میں نے اسے دیکھا تو اس کا پورا حلیہ بالکل آنحضرت صلی اللہ علیہ وسلم کے بیان کئے ہوئے اوصاف کے مطابق تھا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 117,
        "matchingArabicURN": 132400,
        "last_updated": null
    },
    {
        "urduURN": 4035700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3611,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو سفیان نے خبر دی انہیں اعمش نے ، انہیں خیثمہ نے ، ان سے سوید بن غفلہ نے بیان کیا کہ",
        "hadithText": "حضرت علی رضی اللہ عنہ نے کہا ، جب تم سے کوئی بات رسول اللہ صلی اللہ علیہ وسلم کے حوالہ سے میں بیان کروں تو یہ سمجھو کہ میرے لیے آسمان سے گر جانا اس سے بہتر ہے کہ میں آنحضرت صلی اللہ علیہ وسلم پر کوئی جھوٹ باندھوں البتہ جب میں اپنی طرف سے کوئی بات تم سے کہوں تو لڑائی تو تدبیر اور فریب ہی کا نام ہے ( اس میں کوئی بات بنا کر کہوں تو ممکن ہے ) دیکھو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرماتے تھے کہ آخر زمانہ میں کچھ لوگ ایسے پیداہوں گے جو چھوٹے چھوٹے دانتوں والے ، کم عقل اور بیوقوف ہوں گے ۔ باتیں وہ کہیں گے جو دنیا کی بہترین بات ہو گی ۔ لیکن اسلام سے اس طرح صاف نکل چکے ہوں گے جیسے تیر جانور کے پار نکل جاتا ہے ۔ ان کا ایمان ان کے حلق سے نیچے نہیں اترے گا ، تم انہیں جہاں بھی پاؤ قتل کر دو ، کیونکہ ان کے قتل سے قاتل کو قیامت کے دن ثواب ملے گا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 118,
        "matchingArabicURN": 132410,
        "last_updated": null
    },
    {
        "urduURN": 4035710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3612,
        "hadithSanad": "مجھ سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے یحییٰ بن سعید نے بیان کیا ، ان سے اسماعیل نے ، کہا ہم سے قیس نے بیان کیا ، ان سے حضرت خباب بن ارت رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم نے رسول اللہ صلی اللہ علیہ وسلم سے شکایت کی ۔ آپ اس وقت اپنی ایک چادر پر ٹیک دیئے کعبہ کے سائے میں بیٹھے ہوئے تھے ۔ ہم نے آپ کی خدمت میں عرض کیا کہ آپ ہمارے لیے مدد کیوں نہیں طلب فرماتے ۔ ہمارے لیے اللہ سے دعا کیوں نہیں مانگتے ( ہم کافروں کی ایذادہی سے تنگ آ چکے ہیں ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، ( ایمان لانے کی سزا میں ) تم سے پہلی امتوں کے لوگوں کے لیے گڑھا کھودا جاتا اور انہیں اس میں ڈال دیا جاتا ۔ پھر ان کے سر پر آرا رکھ کر ان کے دو ٹکڑے کر دیئے جاتے پھر بھی وہ اپنے دین سے نہ پھرتے ۔ لوہے کے کنگھے ان کے گوشت میں دھنسا کر ان کی ہڈیوں اور پٹھوں پر پھیرے جاتے پھر بھی وہ اپنا ایمان نہ چھوڑتے ، ۔ اللہ کی قسم یہ امر ( اسلام ) بھی کمال کو پہنچے گا اور ایک زمانہ آئے گا کہ ایک سوار مقام صنعاء سے حضرموت تک سفر کرے گا ( لیکن راستوں کے پرامن ہونے کی وجہ سے اسے اللہ کے سوا اور کسی کا ڈر نہیں ہو گا ۔ یا صرف بھیڑئیے کا خوف ہو گا کہ کہیں اس کی بکریوں کو نہ کھا جائے لیکن تم لوگ جلدی کرتے ہو ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 119,
        "matchingArabicURN": 132420,
        "last_updated": null
    },
    {
        "urduURN": 4035720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3613,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے ازہر بن سعد نے بیان کیا ، کہا ہم سے عبداللہ بن عون نے بیان کیا ، انہیں موسیٰ بن انس نے خبر دی اور انہیں انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کو ایک دن ثابت بن قیس رضی اللہ عنہ نہیں ملے تو ایک صحابی نے کہا ، یا رسول اللہ ! میں آپ کے لیے ان کی خبر لاتا ہوں ۔ چنانچہ وہ ان کے یہاں آئے تو دیکھا کہ اپنے گھر میں سر جھکائے بیٹھے ہیں ، انہوں نے پوچھا کہ کیا حال ہے ؟ انہوں نے کہا کہ برا حال ہے ۔ ان کی عادت تھی کہ نبی کریم صلی اللہ علیہ وسلم کے سامنے آنحضرت صلی اللہ علیہ وسلم سے بھی اونچی آواز میں بولا کرتے تھے ۔ انہوں نے کہا اسی لیے میرا عمل غارت ہو گیا اور میں دوزخیوں میں ہو گیا ہوں ۔ وہ صحابی آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آپ کو اطلاع دی کہ ثابت رضی اللہ عنہ یوں کہہ رہے ہیں ۔ موسیٰ بن انس نے بیان کیا ، لیکن دوسری مرتبہ وہی صحابی ثابت رضی اللہ عنہ کے پاس ایک بڑی خوشخبری لے کر واپس ہوئے ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا تھا کہ ثابت کے پاس جاؤ اور اس سے کہو کہ وہ اہل جہنم میں سے نہیں ہیں بلکہ وہ اہل جنت میں سے ہیں ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 120,
        "matchingArabicURN": 132430,
        "last_updated": null
    },
    {
        "urduURN": 4035730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3614,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے ان سے ابواسحٰق نے اور انہوں نے براء  بن عازب رضی اللہ عنہ سے سنا ۔ انہوں نے بیان کیا کہ",
        "hadithText": "ایک صحابی ( اسید بن حضیر رضی اللہ عنہ ) نے ( نماز میں ) سورۃ الکہف کی تلاوت کی ، اسی گھر میں گھوڑا بندھا ہوا تھا ۔ گھوڑے نے اچھلنا کودنا شروع کر دیا ۔ ( اسید نے ادھر خیال نہ کیا اس کو خدا کے سپرد کیا ) اس کے بعد جب انہوں نے سلام پھیرا تو دیکھا کہ بادل کے ایک ٹکڑے نے ان کے سارے گھر پر سایہ کر رکھا ہے ۔ اس واقعہ کا ذکر انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کیا تو آپ نے فرمایا کہ قرآن پڑھتا ہی رہ کیونکہ یہ سکینہ ہے جو قرآن کی وجہ سے نازل ہوئی یا ( اس کے بجائے راوی نے )تنزلت للقرآن کے الفاظ کہے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 121,
        "matchingArabicURN": 132440,
        "last_updated": null
    },
    {
        "urduURN": 4035740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3615,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے احمد بن یزید بن ابراہیم ابوالحسن حرانی نے ، کہا ہم سے زہیر بن معاویہ نے ، کہا ہم سے ابواسحٰق نے بیان کیا اورا نہوں نے براء  بن عازب رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "ابوبکر رضی اللہ عنہ میرے والد کے پاس ان کے گھر آئے اور ان سے ایک پالان خریدا ۔ پھر انہوں نے میرے والد سے کہا کہ اپنے بیٹے کے ذریعہ اسے میرے ساتھ بھیج دو ، حضرت براء رضی اللہ عنہ نے بیان کیا چنانچہ میں اس کجاوے کو اٹھا کر آپ کے ساتھ چلا اور میرے والد اس کی قیمت کے روپے پرکھوانے لگے ۔ میرے والد نے ان سے پوچھا اے ابوبکر ! مجھے وہ واقعہ سناؤ جب تم نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ غار ثور سے ہجرت کی تھی تو آپ دونوں نے وہ وقت کیسے گزارا تھا ؟ اس پر انہوں نے بیان کیا کہ جی ہاں ، رات بھر تو ہم چلتے رہے اور دوسرے دن صبح کو بھی لیکن جب دوپہر کا وقت ہوا اور راستہ بالکل سنسان پڑ گیا کہ کوئی بھی آدمی گزرتا ہوا دکھائی نہیں دیتا تھا تو ہمیں ایک لمبی چٹان دکھائی دی ، اس کے سائے میں دھوپ نہیں تھی ۔ ہم وہاں اتر گئے اور میں نے خود نبی کریم صلی اللہ علیہ وسلم کے لیے ایک جگہ اپنے ہاتھ سے ٹھیک کر دی اور ایک چادر وہاں بچھا دی ، پھر میں نے عرض کیا یا رسول اللہ ! آپ یہاں آرام فرمائیں میں نگرانی کروں گا ، آنحضرت صلی اللہ علیہ وسلم سو گئے اور میں چاروں طرف حالات دیکھنے کے لیے نکلا ۔ اتفاق سے مجھے ایک چرواہا ملا ۔ وہ بھی اپنی بکریوں کے ریوڑ کو اسی چٹان کے سائے میں لانا چاہتا تھا جس کے تلے میں نے وہاں پڑاو ڈالا تھا ۔ وہی اس کا بھی ارادہ تھا ، میں نے اس سے پوچھا کہ تو کس قبیلے سے ہے ؟ اس نے بتایا کہ مدینہ یا ( راوی نے کہا کہ ) مکہ کے فلاں شخص سے ، میں نے اس سے پوچھا کہ کیا تیری بکریوں سے دودھ مل سکتا ہے ؟ اس نے کہا کہ ہاں ۔ میں نے پوچھا کیا ہمارے لیے تو دودھ نکال سکتا ہے ؟ اس نے کہا کہ ہاں ۔ چنانچہ وہ ایک بکری پکڑ کے لایا ۔ میں نے اس سے کہا کہ پہلے تھن کو مٹی ، بال اور دوسری گندگیوں سے صاف کر لے ۔ ابواسحٰق راوی نے کہا کہ میں نے براء  بن عازب رضی اللہ عنہ کو دیکھا کہ انہوں نے اپنے ایک ہاتھ کو دوسرے پر مار کر تھن کو جھاڑ نے کی صورت بیان کی ۔ اس نے لکڑی کے ایک پیالے میں دودھ نکالا ۔ میں نے آنحضرت صلی اللہ علیہ وسلم کے لیے ایک برتن اپنے ساتھ رکھ لیا تھا ۔ آپ اس سے پانی پیا کرتے تھے اور وضو بھی کر لیتے تھے ۔ پھر میں آنحضرت صلی اللہ علیہ وسلم کے پاس آیا ( آپ سو رہے تھے ) میں آپ کو جگانا پسند نہیں کرتا تھا ۔ لیکن بعد میں جب میں آیا تو آپ بیدار ہو چکے تھے ۔ میں نے پہلے دودھ کے برتن پر پانی بہایا جب اس کے نیچے کا حصہ ٹھنڈا ہو گیا تو میں نے عرض کیا اے اللہ کے رسول ! دودھ پی لیجئے ، انہوں نے بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم نے دودھ نوش فرمایا جس سے مجھے خوشی حاصل ہوئی ۔ پھر آپ نے فرمایا کیا ابھی کوچ کرنے کا وقت نہیں آیا ؟ میں نے عرض کیا کہ آ گیا ہے ۔ انہوں نے کہا جب سورج ڈھل گیا تو ہم نے کوچ کیا ۔ بعد میں سراقہ بن مالک ہمارا پیچھا کرتا ہوا یہیں پہنچا ۔ میں نے کہا : حضور ! اب تو یہ ہمارے قریب ہی پہنچ گیا ہے ۔ آپ نے فرمایا : غم نہ کرو ۔ اللہ ہمارے ساتھ ہے ۔ آپ نے پھر اس کے لیے بددعا کی اور اس کا گھوڑا اسے لیے ہوئے پیٹ تک زمین میں دھنس گیا ۔ میرا خیال ہے کہ زمین بڑی سخت تھی ۔ یہ شک ( راوی حدیث ) زہیر کو تھا ۔ سراقہ نے کہا : میں سمجھتا ہوں کہ آپ لوگوں نے میرے لیے بددعا کی ہے ۔ اگر اب آپ لوگ میرے لیے ( اس مصیبت سے نجات کی ) دعا کر دیں تو اللہ کی قسم میں آپ لوگوں کی تلاش میں آنے والے تمام لوگوں کو واپس لوٹا دوں گا ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم نے پھر دعا کی تو وہ نجات پا گیا ۔ پھر تو جو بھی اسے راستے میں ملتا اس سے وہ کہتا تھا کہ میں بہت تلاش کر چکا ہوں ۔ قطعی طور پر وہ ادھر نہیں ہیں ۔ اس طرح جو بھی ملتا اسے وہ واپس اپنے ساتھ لے جاتا ۔ ابوبکر رضی اللہ عنہ نے کہا کہ اس نے ہمارے ساتھ جو وعدہ کیا تھا اسے پورا کیا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 122,
        "matchingArabicURN": 132450,
        "last_updated": null
    },
    {
        "urduURN": 4035750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3616,
        "hadithSanad": "ہم سے معلی بن اسد نے بیان کیا ، کہا ہم سے عبدالعزیز بن مختار نے بیان کیا ، کہا ہم سے خالد نے بیان کیا ، ان سے عکرمہ نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ایک اعرابی کی عیادت کے لیے تشریف لے گیے ۔ آپ جب بھی کسی مریض کی عیادت کے لیے تشریف لے جاتے تو فرماتے کوئی حرج نہیں ، انشاءاللہ یہ بخار گناہوں کو دھو دے گا ۔ آپ نے اس اعرابی سے بھی یہی فرمایا کہ ” کوئی حرج نہیں انشاءاللہ گناہوں کو دھو دے گا ۔ اس نے اس پر کہا : آپ کہتے ہیں گناہوں کو دھونے والا ہے ۔ ہرگز نہیں ۔ یہ تو نہایت شدید قسم کا بخار ہے یا ( راوی نے ) تثور کہا ( دونوں کا مفہوم ایک ہی ہے ) کہ بخار ایک بوڑھے کھوسٹ پر جوش مار رہا ہے جو قبر کی زیارت کرائے بغیر نہیں چھوڑے گا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اچھا تو پھر یوں ہی ہو گا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 123,
        "matchingArabicURN": 132460,
        "last_updated": null
    },
    {
        "urduURN": 4035760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3617,
        "hadithSanad": "ہم سے ابومعمر نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا کہا ہم سے عبدالعزیز نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک شخص پہلے عیسائی تھا ۔ پھر وہ اسلام میں داخل ہو گیا تھا ۔ اس نے سورۃ البقرہ اور آل عمران پڑھ لی تھی اور وہ نبی کریم صلی اللہ علیہ وسلم کا منشی بن گیا لیکن پھر وہ شخص مرتد ہو کر عیسائی ہو گیا اور کہنے لگا کہ محمد ( صلی اللہ علیہ وسلم ) کے لیے جو کچھ میں نے لکھ دیا ہے اس کے سوا اسے اور کچھ بھی معلوم نہیں ۔ پھر اللہ تعالیٰ کے حکم سے اس کی موت واقع ہو گئی اور اس کے آدمیوں نے اسے دفن کر دیا ، جب صبح ہوئی تو انہوں نے دیکھا کہ اس کی لاش قبر سے نکل کر زمین کے اوپر پڑی ہے ۔ عیسائی لوگوں نے کہا کہ یہ محمد ( صلی اللہ علیہ وسلم ) اور اس کے ساتھیوں کا کام ہے ۔ چونکہ ان کا دین اس نے چھوڑ دیا تھا اس لیے انہوں نے اس کی قبر کھودی ہے اور لاش کو باہر نکال کر پھینک دیا ہے ۔ چنانچہ دوسری قبر انہوں نے کھودی جو بہت زیادہ گہری تھی ۔ لیکن جب صبح ہوئی تو پھر لاش باہر تھی ۔ اس مرتبہ بھی انہوں نے یہی کہا کہ یہ محمد ( صلی اللہ علیہ وسلم ) اور ان کے ساتھیوں کا کام ہے چونکہ ان کا دین اس نے چھوڑ دیا تھا اس لیے اس کی قبر کھود کر انہوں نے لاش باہر پھینک دی ہے ۔ پھر انہوں نے قبر کھودی اور جتنی گہری ان کے بس میں تھی کر کے اسے اس کے اندر ڈال دیا لیکن صبح ہوئی تو پھر لاش باہر تھی ۔ اب انہیں یقین آیا کہ یہ کسی انسان کا کام نہیں ہے ( بلکہ یہ میت عذاب خداوندی میں گرفتار ہے ) چنانچہ انہوں نے اسے یونہی ( زمین پر ) ڈال دیا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 124,
        "matchingArabicURN": 132470,
        "last_updated": null
    },
    {
        "urduURN": 4035770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3618,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے یونس نے ، ان سے ابن شہاب نے بیان کیا ، انہوں نے کہا کہ مجھے سعید بن مسیب نے خبر دی کہ",
        "hadithText": "حضرت ابوہریرہ رضی اللہ عنہ نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب کسریٰ ( شاہ ایران ) ہلاک ہو جائے گا تو پھر کوئی کسریٰ پیدا نہیں ہو گا اور اس ذات کی قسم جس کے قبضہ میں محمد صلی اللہ علیہ وسلم کی جان ہے تم ان کے خزانے اللہ کے راستے میں ضرور خرچ کرو گے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 125,
        "matchingArabicURN": 132480,
        "last_updated": null
    },
    {
        "urduURN": 4035780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3619,
        "hadithSanad": "ہم سے قبیصہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے عبدالملک بن عمیر نے اور ان سے حضرت جابر بن سمرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب کسریٰ ہلاک ہوا تو اس کے بعد کوئی کسریٰ پیدا نہیں ہو گا اور جب قیصر ہلاک ہوا تو کوئی قیصر پھر پیدا نہیں ہو گا اور راوی نے ( پہلی حدیث کی طرح اس حدیث کو بھی بیان کیا اور ) کہا کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا تم ان دونوں کے خزانے اللہ کے راستے میں خرچ کرو گے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 126,
        "matchingArabicURN": 132490,
        "last_updated": null
    },
    {
        "urduURN": 4035790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3620,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، انہیں عبداللہ بن ابی حسین نے ، ان سے نافع بن جبیر نے بیان کیا اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں مسیلمہ کذاب مدینہ میں آیا اور یہ کہنے لگا کہ اگر محمد ( صلی اللہ علیہ وسلم ) ” امر “ ( یعنی خلافت ) کو اپنے بعد مجھے سونپ دیں تو میں ان کی اتباع کے لیے تیار ہوں ۔ مسیلمہ اپنے بہت سے مریدوں کو ساتھ لے کر مدینہ آیا تھا ۔ رسول اللہ صلی اللہ علیہ وسلم اس کے پاس ( اسے سمجھانے کے لیے ) تشریف لے گئے ۔ آپ کے ساتھ ثابت بن قیس بن شماس رضی اللہ عنہ تھے اور آپ کے ہاتھ میں کھجور کی ایک چھڑی تھی ۔ آپ وہاں ٹھہر گئے جہاں مسیلمہ اپنے آدمیوں کے ساتھ موجود تھا ۔ تو آپ نے اس سے فرمایا اگر تو مجھ سے چھڑی بھی مانگے تو میں تجھے نہیں دے سکتا ( خلافت تو بڑی چیز ہے ) اور پروردگار کی مرضی کو تو ٹال نہیں سکتا اگر تو اسلام سے پیٹھ پھیرے گا تو اللہ تجھ کو تباہ کر دے گا ۔ اور میں سمجھتا ہوں کہ تو وہی ہے جو مجھے ( خواب میں ) دکھایا گیا تھا ۔ \n<span class=urdu_sanad>( ابن عباس رضی اللہ عنہما نے کہا کہ ) مجھے ابوہریرہ رضی اللہ عنہ نے خبر دی کہ</span> رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا ، میں سویا ہوا تھا کہ میں نے ( خواب میں ) سونے کے دو کنگن اپنے ہاتھوں میں دیکھے ۔ مجھے اس خواب سے بہت فکر ہوا ، پھر خواب میں ہی وحی کے ذریعہ مجھے بتلایا گیا کہ میں ان پر پھونک ماروں ۔ چنانچہ جب میں نے پھونک ماری تو وہ دونوں اڑ گئے ۔ میں نے اس سے یہ تعبیر لی کہ میرے بعد جھوٹے نبی ہوں گے ۔ پس ان میں سے ایک تو اسودعنسی ہے اور دوسرا یمامہ کا مسیلمہ کذاب تھا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 127,
        "matchingArabicURN": 132501,
        "last_updated": null
    },
    {
        "urduURN": 4035810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3622,
        "hadithSanad": "مجھ سے محمد بن علاء نے بیان کیا ، کہا ہم سے حماد بن اسامہ نے بیان کیا ، ان سے برید بن عبداللہ بن ابی بردہ نے ، ان سے ان کے دادا ابوبردہ نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے ، میں سمجھتا ہوں ( یہ امام بخاری رحمہ اللہ کا قول ہے کہ ) محمد بن علاء نے یوں کہا کہ",
        "hadithText": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا میں نے خواب میں دیکھا تھا کہ میں مکہ سے ایک ایسی زمین کی طرف ہجرت کر رہا ہوں جہاں کھجور کے باغات ہیں ۔ اس پر میرا ذہن ادھر گیا کہ یہ مقام یمامہ یا ہجر ہو گا ۔ لیکن وہ یثرب مدینہ منورہ ہے اور اسی خواب میں میں نے دیکھا کہ میں نے تلوار ہلائی تو وہ بیچ میں سے ٹوٹ گئی ۔ یہ اس مصیبت کی طرف اشارہ تھا جو احد کی لڑائی میں مسلمانوں کو اٹھانی پڑی تھی ۔ پھر میں نے دوسری مرتبہ اسے ہلایا تو وہ پہلے سے بھی اچھی صورت میں ہو گئی ۔ یہ اس واقعہ کی طرف اشارہ تھا کہ اللہ تعالیٰ نے مکہ کی فتح دی اور مسلمان سب اکٹھے ہو گئے ۔ میں نے اسی خواب میں گائیں دیکھیں اور اللہ تعالیٰ کا جو کام ہے وہ بہتر ہے ۔ ان گایوں سے ان مسلمانوں کی طرف اشارہ تھا جو احد کی لڑائی میں شہید کئے گئے اور خیر و بھلائی وہ تھی جو ہمیں اللہ تعالیٰ نے خیر و سچائی کا بدلہ بدر کی لڑائی کے بعد عطا فرمایا تھا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 128,
        "matchingArabicURN": 132520,
        "last_updated": null
    },
    {
        "urduURN": 4035820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3623,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے زکریا نے بیان کیا ، ان سے فراس نے ، ان سے عامر نے ، ان سے مسروق نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "حضرت فاطمہ رضی اللہ عنہا آئیں ، ان کی چال میں نبی کریم صلی اللہ علیہ وسلم کی چال سے بڑی مشابہت تھی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : بیٹی آو مرحبا ! اس کے بعد آپ نے انہیں اپنی دائیں طرف یا بائیں طرف بٹھایا ، پھر ان کے کان میں آپ نے چپکے سے کوئی بات کہی تو وہ رونے لگیں ، میں نے ان سے کہا کہ آپ روتی کیوں ہو ؟ پھر دوبارہ آنحضرت صلی اللہ علیہ وسلم نے ان کے کان میں کچھ کہا تو وہ ہنس دیں ۔ میں نے ان سے کہا آج غم کے فوراً بعد ہی خوشی کی جو کیفیت میں نے آپ کے چہرے پر دیکھی وہ پہلے کبھی نہیں دیکھی تھی ۔ پھر میں نے ان سے پوچھا کہ آنحضرت صلی اللہ علیہ وسلم نے کیا فرمایا تھا ؟ انہوں نے کہا جب تک رسول اللہ صلی اللہ علیہ وسلم زندہ ہیں میں آپ کے راز کو کسی پر نہیں کھول سکتی ۔ چنانچہ میں نے آپ کی وفات کے بعد پوچھا ۔ \nتو انہوں نے بتایا کہ آپ نے میرے کان میں کہا تھا کہ حضرت جبرائیل علیہ السلام ہر سال قرآن مجید کا ایک دور کیا کرتے تھے ، لیکن اس سال انہوں نے دو مرتبہ دور کیا ہے ، مجھے یقین ہے کہ اب میری موت قریب ہے اور میرے گھرانے میں سب سے پہلے مجھ سے آ ملنے والی تم ہو گی ۔ میں ( آپ کی اس خبر پر ) رونے لگی تو آپ نے فرمایا کہ تم اس پر راضی نہیں کہ جنت کی عورتوں کی سردار بنو گی یا ( آپ نے فرمایا کہ ) مومنہ عورتوں کی ، تو اس پر میں ہنسی تھی ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 129,
        "matchingArabicURN": 132531,
        "last_updated": null
    },
    {
        "urduURN": 4035840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3625,
        "hadithSanad": "ہم سے یحییٰ بن قزعہ نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے ان کے والد نے ، ان سے عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے اپنے زمانہ مرض میں اپنی صاحب زادی فاطمہ رضی اللہ عنہا کو بلایا اور چپکے سے کوئی بات ان سے فرمائی تو وہ رونے لگیں ۔ پھر آپ نے انہیں بلایا اور چپکے سے پھر کوئی بات فرمائی تو وہ ہنسیں ۔ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر میں نے حضرت فاطمہ رضی اللہ عنہا سے اس کے متعلق پوچھا ۔ \nتو انہوں نے بتایا کہ پہلی مرتبہ جب آنحضرت صلی اللہ علیہ وسلم نے مجھ سے آہستہ سے گفتگو کی تھی تو اس میں آپ نے فرمایا تھا کہ آپ کی اس مرض میں وفات ہو جائے گی جس میں واقعی آپ کی وفات ہوئی ۔ میں اس پر رو پڑی ۔ پھر دو بارہ آپ نے آہستہ سے مجھ سے جوبات کہی اس میں آپ نے فرمایا کہ آپ کے اہل بیت میں ، میں سب سے پہلے آپ سے جا ملوں گی ۔ میں اس پر ہنسی تھی ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 130,
        "matchingArabicURN": 132551,
        "last_updated": null
    },
    {
        "urduURN": 4035860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3627,
        "hadithSanad": "ہم سے محمد بن عرعرہ نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ابی بشر نے ، ان سے سعید بن جبیر نے ، ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "حضرت عمر بن خطاب ابن عباس رضی اللہ عنہما کو اپنے پاس بٹھاتے تھے ۔ اس پر عبدالرحمٰن بن عوف رضی اللہ عنہ نے حضرت عمر رضی اللہ عنہ سے شکایت کی کہ ان جیسے تو ہمارے لڑکے بھی ہیں ۔ لیکن حضرت عمر رضی اللہ عنہ نے جواب دیا کہ یہ محض ان کے علم کی وجہ سے ہے ۔ پھر حضرت عمر رضی اللہ عنہ نے عبداللہ بن عباس رضی اللہ عنہما سے آیتاذا جاء نصر اللہ والفتح کے متعلق پوچھا تو انہوں نے جواب دیا کہ یہ رسول اللہ صلی اللہ علیہ وسلم کی وفات تھی جس کی خبر اللہ تعالیٰ نے آپ کو دی حضرت عمر رضی اللہ عنہ نے فرمایا جو تم نے سمجھا ہے میں بھی وہی سمجھتا ہوں ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 131,
        "matchingArabicURN": 132570,
        "last_updated": null
    },
    {
        "urduURN": 4035870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3628,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے عبدالرحمٰن بن سلیمان بن حنظلہ بن غسیل نے بیان کیا ، ان سے عکرمہ نے بیان کیا اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "مرض الوفات میں رسول اللہ صلی اللہ علیہ وسلم باہر تشریف لائے ، آپ ایک چکنے کپڑے سے سرمبارک پر پٹی باندھے ہوئے تھے ، آپ مسجدنبوی میں منبر پر تشریف فرما ہوئے پھر جیسے ہونی چاہیے اللہ تعالیٰ کی حمد و ثنا کی ، پھر فرمایا : امابعد : ( آنے والے دور میں ) دوسرے لوگوں کی تعداد بہت بڑھ جائے گی لیکن انصار کم ہوتے جائیں گے اور ایک زمانہ آئے گا کہ دوسروں کے مقابلے میں ان کی تعداد اتنی کم ہو جائے گی جیسے کھانے میں نمک ہوتا ہے ۔ پس اگر تم میں سے کوئی شخص کہیں کا حاکم بنے اور اپنی حکومت کی وجہ سے وہ کسی کو نقصان اور نفع بھی پہنچا سکتا ہو تو اسے چاہیے کہ انصار کے نیکوں ( کی نیکیوں ) کو قبول کرے اور جو برے ہوں ان سے درگزر کر دیا کرے ۔ یہ نبی کریم صلی اللہ علیہ وسلم کی آخری مجلس وعظ تھی ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 132,
        "matchingArabicURN": 132580,
        "last_updated": null
    },
    {
        "urduURN": 4035880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3629,
        "hadithSanad": "مجھ سے عبداللہ بن محمد مسندی نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ بن آدم نے بیان کیا ، انہوں نے کہا ہم سے حسین جعفی نے بیان کیا ، ان سے ابوموسیٰ نے ، ان سے امام حسن بصری نے اور ان سے حضرت ابوبکرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم حسن رضی اللہ عنہ کو ایک دن ساتھ لے کر باہر تشریف لائے اور منبر پر ان کو لے کر چڑھ گئے پھر فرمایا : میرا یہ بیٹا سید ہے اور امید ہے کہ اللہ تعالیٰ اس کے ذریعہ مسلمانوں کی دو جماعتوں میں ملاپ کرا دے گا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 133,
        "matchingArabicURN": 132590,
        "last_updated": null
    },
    {
        "urduURN": 4035890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3630,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب نے ، ان سے حمید بن ہلال نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے جعفر بن ابی طالب اور زید بن حارثہ رضی اللہ عنہما کی شہادت کی خبر پہلے ہی صحابہ کو سنا دی تھی ، اس وقت آپ کی آنکھوں سے آنسو جاری تھے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 134,
        "matchingArabicURN": 132600,
        "last_updated": null
    },
    {
        "urduURN": 4035900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3631,
        "hadithSanad": "ہم سے عمرو بن عباس نے بیان کیا ، کہا ہم سے عبدالرحمٰن بن مہدی نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے محمد بن منکدر نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "( ان کی شادی کے موقع پر ) نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کیا تمہارے پاس قالین ہیں ؟ میں نے عرض کیا ، ہمارے پاس قالین کہاں ؟ ( ہم غریب لوگ ہیں ) اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا یاد رکھو ایک وقت آئے گا کہ تمہارے پاس عمدہ عمدہ قالین ہوں گے ۔ اب جب میں اس سے ( اپنی بیوی سے ) کہتا ہوں کہ اپنے قالین ہٹالے تو وہ کہتی ہے کہ کیا نبی کریم صلی اللہ علیہ وسلم نے تم سے نہیں فرمایا تھا کہ ایک وقت آئے گا جب تمہارے پاس قالین ہوں گے ۔ چنانچہ میں انہیں وہیں رہنے دیتا ہوں ( اور چپ ہو جاتا ہوں ) ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 135,
        "matchingArabicURN": 132610,
        "last_updated": null
    },
    {
        "urduURN": 4035910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3632,
        "hadithSanad": "ہم سے احمد بن اسحٰق نے بیان کیا ، کہا ہم سے عبیداللہ بن موسیٰ نے بیان کیا ، کہا ہم سے اسرائیل نے بیان کیا ، ان سے ابواسحٰق نے ، ان سے عمرو بن میمون نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "حضرت سعد بن معاذ رضی اللہ عنہ عمرہ کی نیت سے ( مکہ ) آئے اور ابوصفوان امیہ بن خلف کے یہاں اترے ۔ امیہ بھی شام جاتے ہوئے ( تجارت وغیرہ کے لیے ) جب مدینہ سے گزرتا تو حضرت سعد بن معاذ رضی اللہ عنہ کے یہاں قیام کیا کرتا تھا ۔ امیہ نے حضرت سعد رضی اللہ عنہ سے کہا ، ابھی ٹھہرو ، جب دوپہر کا وقت ہو جائے اور لوگ غافل ہو جائیں ( تب طواف کرنا کیونکہ مکہ کے مشرک مسلمانوں کے دشمن تھے ) سعد رضی اللہ عنہ کہتے ہیں ، چنانچہ میں نے جا کر طواف شروع کر دیا ۔ حضرت سعد رضی اللہ عنہ ابھی طواف کر ہی رہے تھے کہ ابوجہل آ گیا اور کہنے لگا ، یہ کعبہ کا طواف کون کر رہا ہے ؟ حضرت سعد رضی اللہ عنہ بولے کہ میں سعد ہوں ۔ ابوجہل بولا : تم کعبہ کا طواف خوب امن سے کر رہے ہو حالانکہ محمد صلی اللہ علیہ وسلم اور اس کے ساتھیوں کو پناہ دے رکھی ہے ۔ سعد رضی اللہ عنہ نے کہا : ہاں ٹھیک ہے ۔ اس طرح دونوں میں بات بڑھ گئی ۔ پھر امیہ نے سعد رضی اللہ عنہ سے کہا : ابوالحکم ( ابوجہل ) کے سامنے اونچی آواز سے نہ بولو ۔ وہ اس وادی ( مکہ ) کا سردار ہے ۔ اس پر سعد رضی اللہ عنہ نے کہا : خدا کی قسم اگر تم نے مجھے بیت اللہ کے طواف سے روکا تو میں بھی تمہاری شام کی تجارت خاک میں ملا دوں گا ( کیونکہ شام جانے کا صرف ایک ہی راستہ ہے جو مدینہ سے جاتا ہے ) بیان کیا کہ امیہ برابر سعد رضی اللہ عنہ سے یہی کہتا رہا کہ اپنی آواز بلند نہ کرو اور انہیں ( مقابلہ سے ) روکتا رہا ۔ آخر سعد رضی اللہ عنہ کو اس پر غصہ آ گیا اور انہوں نے امیہ سے کہا ۔ چل پرے ہٹ میں نے حضرت محمد صلی اللہ علیہ وسلم سے تیرے متعلق سنا ہے ۔ آپ نے فرمایا تھا کہ تجھ کو ابوجہل ہی قتل کرائے گا ۔ امیہ نے پوچھا : مجھے ؟ سعد رضی اللہ عنہ کہا : ہاں تجھ کو ۔ تب تو امیہ کہنے لگا ۔ اللہ کی قسم محمد ( صلی اللہ علیہ وسلم ) جب کوئی بات کہتے ہیں تو وہ غلط نہیں ہوتی پھر وہ اپنی بیوی کے پاس آیا اور اس نے اس سے کہا تمہیں معلوم نہیں ، میرے یثربی بھائی نے مجھے کیا بات بتائی ہے ؟ اس نے پوچھا : انہوں نے کیا کہا ؟ امیہ نے بتایا کہ محمد ( صلی اللہ علیہ وسلم ) کہہ چکے ہیں کہ ابوجہل مجھ کو قتل کرائے گا ۔ وہ کہنے لگی ۔ اللہ کی قسم محمد صلی اللہ علیہ وسلم غلط بات زبان سے نہیں نکالتے ۔ پھر ایسا ہوا کہ اہل مکہ بدر کی لڑائی کے لیے روانہ ہونے لگے اور امیہ کو بھی بلانے والا آیا تو امیہ سے اس کی بیوی نے کہا ، تمہیں یاد نہیں رہا تمہارا یثربی بھائی تمہیں کیا خبر دے گیا تھا ۔ بیان کیا کہ اس یاددہانی پر امیہ نے چاہا کہ اس جنگ میں شرکت نہ کرے ۔ لیکن ابوجہل نے کہا : تم وادی مکہ کے رئیس ہو ۔ اس لیے کم از کم ایک یا دو دن کے لیے ہی تمہیں چلنا پڑے گا ۔ اس طرح وہ ان کے ساتھ جنگ میں شرکت کے لیے نکلا اور اللہ تعالیٰ نے اس کو قتل کرا دیا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 136,
        "matchingArabicURN": 132620,
        "last_updated": null
    },
    {
        "urduURN": 4035920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3633,
        "hadithSanad": "ہم سے عباس بن ولید نرسی نے بیان کیا ، کہا ہم سے معتمر بن سلیمان نے بیان کیا کہا کہ میں نے اپنے والد سے سنا ، ان سے ابوعثمان نے بیان کیا کہ",
        "hadithText": "مجھے یہ بات معلوم کرائی گئی کہ حضرت جبرائیل علیہ السلام ایک مرتبہ نبی کریم صلی اللہ علیہ وسلم کے پاس آئے اور آپ سے باتیں کرتے رہے ۔ اس وقت آنحضرت صلی اللہ علیہ وسلم کے پاس ام المؤمنین ام سلمہ رضی اللہ عنہا بیٹھی ہوئی تھیں ۔ جب حضرت جبرائیل علیہ السلام چلے گئے تو آنحضرت صلی اللہ علیہ وسلم نے ام سلمہ سے فرمایا : معلوم ہے یہ کون صاحب تھے ؟ یا ایسے ہی الفاظ ارشاد فرمائے ۔ ابوعثمان نے بیان کیا کہ ام سلمہ نے جواب دیا کہ یہ دحیہ کلبی رضی اللہ عنہ تھے ۔ ام سلمہ نے بیان کیا اللہ کی قسم میں سمجھے بیٹھی تھی کہ وہ دحیہ کلبی رضی اللہ عنہ ہیں ۔ آخر جب میں نے آنحضرت صلی اللہ علیہ وسلم کا خطبہ سنا جس میں آپ حضرت جبرائیل علیہ السلام ( کی آمد ) کی خبر دے رہے تھے تو میں سمجھی کہ وہ حضرت جبرائیل علیہ السلام ہی تھے ۔ یا ایسے ہی الفاظ کہے ۔ بیان کیا کہ میں نے ابوعثمان سے پوچھا کہ آپ نے یہ حدیث کس سے سنی ؟ تو انہوں نے بتایا کہ اسامہ بن زید رضی اللہ عنہ سے سنی ہے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 138,
        "matchingArabicURN": 132630,
        "last_updated": null
    },
    {
        "urduURN": 4035930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3634,
        "hadithSanad": "مجھ سے عبدالرحمٰن بن ابی شیبہ نے بیان کیا ، کہا ہم سے عبدالرحمٰن بن مغیرہ نے بیان کیا ، ان سے ان کے والد نے ، ان سے موسیٰ بن عقبہ نے ، ان سے سالم بن عبداللہ نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : میں نے ( خواب میں ) دیکھا کہ لوگ ایک میدان میں جمع ہو رہے ہیں ۔ ان میں سے حضرت ابوبکر رضی اللہ عنہ اٹھے اور ایک کنویں سے انہوں نے ایک یا دو ڈول پانی بھر کر نکالا ، پانی نکالنے میں ان میں کچھ کمزوری معلوم ہوتی تھی اور اللہ ان کو بخشے ، پھر وہ ڈول حضرت عمر رضی اللہ عنہ نے سنبھالا ۔ ان کے ہاتھ میں جاتے ہی وہ ایک بڑا ڈول ہو گیا میں نے لوگوں میں ان جیسا شہ زور پہلوان اور بہادر انسان ان کی طرح کام کرنے والا نہیں دیکھا ( انہوں نے اتنے ڈول کھینچے ) کہ لوگ اپنے اونٹوں کو بھی پلا پلا کر ان کے ٹھکانوں میں لے گئے ، اور ہمام نے بیان کیا ، کہ میں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا وہ نبی کریم صلی اللہ علیہ وسلم کے واسطے سے بیان کر رہے تھے کہ حضرت ابوبکر رضی اللہ عنہ نے دو ڈول کھینچے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 137,
        "matchingArabicURN": 132640,
        "last_updated": null
    },
    {
        "urduURN": 4035940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3635,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک بن انس نے خبر دی ، انہیں نافع نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "یہود ، رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آپ کو بتایا کہ ان کے یہاں ایک مرد اور ایک عورت نے زنا کیا ہے ۔ آپ نے ان سے فرمایا : رجم کے بارے میں تورات میں کیا حکم ہے ؟ وہ بولے یہ کہ ہم انہیں رسوا کریں اور انہیں کوڑے لگائے جائیں ۔ اس پر عبداللہ بن سلام رضی اللہ عنہ نے کہا کہ تم لوگ جھوٹے ہو ۔ تورات میں رجم کا حکم موجود ہے ۔ تورات لاؤ ۔ پھر یہودی تورات لائے اور اسے کھولا ۔ لیکن رجم سے متعلق جو آیت تھی اسے ایک یہودی نے اپنے ہاتھ سے چھپا لیا اور اس سے پہلے اور اس کے بعد کی عبارت پڑھنے لگا ۔ حضرت عبداللہ بن سلام رضی اللہ عنہ نے کہا کہ ذرا اپنا ہاتھ تو اٹھاؤ جب اس نے ہاتھ اٹھایا تو وہاں آیت رجم موجود تھی ۔ اب وہ سب کہنے لگے کہ اے محمد ! عبداللہ بن سلام نے سچ کہا ۔ بیشک تو رات میں رجم کی آیت موجود ہے ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم کے حکم سے ان دونوں کو رجم کیا گیا ۔ حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ میں نے رجم کے وقت دیکھا ۔ یہودی مرد اس عورت پر جھکا پڑتا تھا ۔ اس کو پتھروں کی مار سے بچاتا تھا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 139,
        "matchingArabicURN": 132650,
        "last_updated": null
    },
    {
        "urduURN": 4035950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3636,
        "hadithSanad": "ہم سے صدقہ بن فضل نے بیان کیا ، انہوں نے کہا ہم کو سفیان بن عیینہ نے خبر دی ، انہیں ابن ابی نجیح نے ، انہیں مجاہد نے ، انہیں ابومعمر نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے زمانے میں چاند کے پھٹ کر دو ٹکڑے ہو گئے تھے اور آنحضرت صلی اللہ علیہ وسلم نے فرمایا تھا کہ لوگو اس پر گواہ رہنا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 140,
        "matchingArabicURN": 132660,
        "last_updated": null
    },
    {
        "urduURN": 4035960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3637,
        "hadithSanad": "مجھ سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے یونس بن یزید نے بیان کیا ، کہا ہم سے شیبان نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے ( دوسری سند ) امام بخاری نے کہا اور مجھ سے خلیفہ بن خیاط نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، ان سے سعید نے بیان کیا ، ان سے قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "مکہ والوں نے رسول کریم صلی اللہ علیہ وسلم سے کہا تھا کہ انہیں کوئی معجزہ دکھائیں تو آپ نے شق قمر کا معجزہ یعنی چاند کا پھٹ جانا ان کو دکھایا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 141,
        "matchingArabicURN": 132670,
        "last_updated": null
    },
    {
        "urduURN": 4035970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3638,
        "hadithSanad": "مجھ سے خلف بن خالد قرشی نے بیان کیا ، کہا ہم سے بکربن مضر نے بیان کیا ، ان سے جعفر بن ربیعہ نے بیان کیا ، ان سے عراق بن مالک نے ، ان سے عبیداللہ بن عبداللہ بن مسعود نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے زمانے میں چاند کے دو ٹکڑے ہو گئے تھے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 142,
        "matchingArabicURN": 132680,
        "last_updated": null
    },
    {
        "urduURN": 4035980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3639,
        "hadithSanad": "مجھ سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے معاذ نے بیان کیا ، کہا کہ مجھ سے میرے والد نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم سے دو صحابی ( اسید بن حضیر رضی اللہ عنہ اور عباد بن بشر رضی اللہ عنہ ) اٹھ کر ( اپنے گھر ) واپس ہوئے ۔ رات اندھیری تھی لیکن دو چراغ کی طرح کی کوئی چیز ان کے آگے روشنی کرتی جاتی تھیں ۔ پھر جب یہ دونوں ( راستے میں ، اپنے اپنے گھر کی طرف جانے کے لیے ) جدا ہوئے تو وہ چیز دونوں کے ساتھ الگ الگ ہو گئی اور اس طرح وہ اپنے گھر والوں کے پاس پہنچ گئے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 143,
        "matchingArabicURN": 132690,
        "last_updated": null
    },
    {
        "urduURN": 4035990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3640,
        "hadithSanad": "مجھ سے عبداللہ بن ابوالاسود نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، کہا ان سے اسماعیل نے بیان کیا ، کہا ہم سے قیس نے بیان کیا کہ میں نے حضرت مغیرہ بن شعبہ رضی اللہ عنہ سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میری امت کے کچھ لوگ ہمیشہ غالب رہیں گے ، یہاں تک کہ قیامت یا موت آئے گی اس وقت بھی وہ غالب ہی ہوں گے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 144,
        "matchingArabicURN": 132700,
        "last_updated": null
    },
    {
        "urduURN": 4036000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3641,
        "hadithSanad": "ہم سے حمیدی نے بیان کیا ، کہا ہم سے ولید نے بیان کیا ، کہا کہ مجھ سے یزید بن جابر نے بیان کیا ، کہا کہ مجھ سے عمیر بن ہانی نے بیان کیا اور انہوں نے معاویہ بن ابی سفیان سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نے رسول کریم صلی اللہ علیہ وسلم سے سنا تھا ۔ آپ فرما رہے تھے کہ میری امت میں ہمیشہ ایک گروہ ایسا موجود رہے گا جو اللہ تعالیٰ کی شریعت پر قائم رہے گا ، انہیں ذلیل کرنے کی کوشش کرنے والے اور اسی طرح ان کی مخالفت کرنے والے انہیں کوئی نقصان نہ پہنچا سکیں گے ، یہاں تک کہ قیامت آ جائے گی اور وہ اسی حالت پر ہیں گے ۔ عمیر نے بیان کیا کہ اس پر مالک بن یخامر نے کہا کہ معاذ بن جبل رضی اللہ عنہ نے کہا تھا کہ ہمارے زمانے میں یہ لوگ شام میں ہیں ۔ امیر معاویہ نے کہا کہ دیکھو یہ مالک بن یخامر یہاں موجود ہیں ، جو کہہ رہے ہیں کہ انہوں نے معاذ رضی اللہ عنہ سے سنا کہ یہ لوگ شام کے ملک میں ہیں ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 145,
        "matchingArabicURN": 132710,
        "last_updated": null
    },
    {
        "urduURN": 4036010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3642,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم کو سفیان بن عیینہ نے خبر دی ، کہا ہم سے شبیب بن غرقدہ نے بیان کیا کہ",
        "hadithText": "میں نے اپنے قبیلہ کے لوگوں سے سنا تھا ، وہ لوگ عروہ سے نقل کرتے تھے ( جو ابوالجعد کے بیٹے اور صحابی تھے ) کہ نبی کریم صلی اللہ علیہ وسلم نے انہیں ایک دینار دیا کہ وہ اس کی ایک بکری خرید کر لے آئیں ۔ انہوں نے اس دینار سے دو بکریاں خریدیں ، پھر ایک بکری کو ایک دینار میں بیچ کر دینار بھی واپس کر دیا ۔ اور بکری بھی پیش کر دی ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر ان کی تجارت میں برکت کی دعا فرمائی ۔ پھر تو ان کا یہ حال ہوا کہ اگر مٹی بھی خریدتے تو اس میں انہیں نفع ہو جاتا ۔ سفیان نے کہا کہ حسن بن عمارہ نے ہمیں یہ حدیث پہنچائی تھی شبیب بن غرقد ہ سے ۔ حسن بن عمارہ نے کہا کہ شبیب نے یہ حدیث خود عروہ رضی اللہ عنہ سے سنی تھی ۔ چنانچہ میں شبیب کی خدمت میں گیا تو انہوں نے بتایا کہ میں نے یہ حدیث خود عروہ سے نہیں سنی تھی ۔ البتہ میں نے اپنے قبیلہ کے لوگوں کو ان کے حوالے سے بیان کرتے سنا تھا ۔ \n<span class=urdu_sanad>البتہ یہ دوسری حدیث خود میں نے عروہ رضی اللہ عنہ سے سنی ہے ، وہ بیان کرتے تھے کہ</span> میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا خیر اور بھلائی گھوڑوں کی پیشانی کے ساتھ قیامت تک کے لیے بندھی ہوئی ہے ، شبیب نے کہا کہ میں نے حضرت عروہ رضی اللہ عنہ کے گھر میں ستر گھوڑے دیکھے ۔ سفیان نے کہا کہ حضرت عروہ رضی اللہ عنہ نے حضور اکرم صلی اللہ علیہ وسلم کے لیے بکری خریدی تھی ۔ شاید وہ قربانی کے لیے ہو گی ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 146,
        "matchingArabicURN": 132721,
        "last_updated": null
    },
    {
        "urduURN": 4036030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3644,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا کہ ہم سے یحییٰ نے بیان کیا ، ان سے عبداللہ نے بیان کیا ، انہیں نافع نے خبر دی اور انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، گھوڑے کی پیشانی کے ساتھ خیر و برکت قیامت تک کے لیے باندھ دی گئی ہے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 147,
        "matchingArabicURN": 132740,
        "last_updated": null
    },
    {
        "urduURN": 4036040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3645,
        "hadithSanad": "ہم سے قیس بن حفص نے بیان کیا ، کہا ہم سے خالد بن حارث نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ابوالتیاح نے بیان کیا ، اور انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا تھا کہ گھوڑے کی پیشانی کے ساتھ برکت باندھ دی گئی ہے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 148,
        "matchingArabicURN": 132750,
        "last_updated": null
    },
    {
        "urduURN": 4036050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3646,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، ان سے امام مالک نے ، ان سے زید بن اسلم نے ، ان سے ابوصالح سمان نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا : گھوڑے تین آدمیوں کے لیے ہیں ۔ ایک کے لیے تو وہ باعث ثواب ہیں اور ایک کے لیے وہ معاف یعنی مباح ہیں اور ایک کے لیے وہ وبال ہیں ۔ جس کے لیے گھوڑا باعث ثواب ہے یہ وہ شخص ہے جو جہاد کے لیے اسے پالے اور چراگاہ یا باغ میں اس کی رسی کو ( جس سے وہ بندھا ہوتا ہے ) خوب دراز کر دے تو وہ اپنے اس طول و عرض میں جو کچھ بھی چرتا ہے وہ سب اس کے مالک کے لیے نیکیاں بن جاتی ہیں اور اگر کبھی وہ اپنی رسی تڑا کر دوچار قدم دوڑ لے تو اس کی لید بھی مالک کے لیے باعث ثواب بن جاتی ہے اور کبھی اگر وہ کسی نہر سے گزرتے ہوئے اس میں سے پانی پی لے اگرچہ مالک کے دل میں اسے پہلے سے پانی پلانے کا خیال بھی نہ تھا ، پھر بھی گھوڑے کا پانی پینا اس کے لیے ثواب بن جاتا ہے ۔ اور ایک وہ آدمی جو گھوڑے کو لوگوں کے سامنے اپنی حاجت ، پردہ پوشی اور سوال سے بچے رہنے کی غرض سے پالے اور اللہ تعالیٰ کا جو حق اس کی گردن اور اس کی پیٹھ میں ہے اسے بھی وہ فراموش نہ کرے تو یہ گھوڑا اس کے لیے ایک طرح کا پردہ ہوتا ہے اور ایک شخص وہ ہے جو گھوڑے کو فخر اور دکھاوے اور اہل اسلام کی دشمنی میں پالے تو وہ اس کے لیے وبال جان ہے اور نبی کریم صلی اللہ علیہ وسلم سے گدھوں کے بارے میں پوچھا گیا تو آپ نے فرمایا کہ اس جامع آیت کے سوا مجھ پر گدھوں کے بارے میں کچھ نازل نہیں ہوا کہ ” جو شخص ایک ذرہ کے برابر بھی نیکی کرے گا تو اس کا بھی وہ بدلہ پائے گا اور جو شخص ایک ذرہ کے برابر بھی برائی کرے گا تو وہ اس کا بھی بدلہ پائے گا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 149,
        "matchingArabicURN": 132760,
        "last_updated": null
    },
    {
        "urduURN": 4036060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3647,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا ہم سے ایوب سختیانی نے بیان کیا ، ان سے محمد بن سیرین نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم خیبر میں صبح سویرے ہی پہنچ گئے ۔ خیبر کے یہودی اس وقت اپنے پھاوڑے لے کر ( کھیتوں میں کام کرنے کے لیے ) جا رہے تھے کہ انہوں نے آپ کو دیکھا اور یہ کہتے ہوئے کہ محمد لشکر لے کر آ گئے ، وہ قلعہ کی طرف بھاگے ، اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے اپنے ہاتھ اٹھا کر فرمایا : اللہ اکبر خیبر تو برباد ہوا کہ جب ہم کسی قوم کے میدان میں ( جنگ کے لیے ) اتر جاتے ہیں تو پھر ڈرائے ہوئے لوگوں کی صبح بری ہو جاتی ہے ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 150,
        "matchingArabicURN": 132770,
        "last_updated": null
    },
    {
        "urduURN": 4036070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 61,
        "bookName": "2566",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3648,
        "hadithSanad": "مجھ سے ابراہیم بن المنذر نے بیان کیا ، کہا مجھ سے محمد بن اسماعیل ابن ابی الفدیک نے بیان کیا ، ان سے محمد بن عبدالرحمٰن ابن ابی ذئب نے ، ان سے سعید مقبری نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے عرض کیا یا رسول اللہ ! میں نے آپ سے بہت سی احادیث اب تک سنی ہیں لیکن میں انہیں بھول جاتا ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اپنی چادر پھیلاؤ ، میں نے چادر پھیلا دی اور آپ نے اپنے ہاتھ سے اس میں ایک لپ بھر کر ڈال دی اور فرمایا کہ اسے اپنے بدن سے لگا لو ۔ چنانچہ میں نے لگا لیا اور اس کے بعد کبھی کوئی حدیث نہیں بھولا ۔</b>",
        "bookID": "61.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 151,
        "matchingArabicURN": 132780,
        "last_updated": null
    }
]