[
    {
        "urduURN": 4037350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3776,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا کہا ہم سے مہدی بن میمون نے ، کہا ہم سے غیلان بن جریر نے بیان کیا",
        "hadithText": "میں نے حضرت انس رضی اللہ عنہ سے پوچھا بتلائیے ( انصار ) اپنا نام آپ لو گوں نے خود رکھ لیا تھا یا آپ لوگوں کا یہ نام اللہ تعالیٰ نے رکھا ؟ انہوں نے کہا نہیں بلکہ ہمارا یہ نام اللہ تعالیٰ نے رکھا ہے ۔ غیلان کی روایت ہے کہ ہم انس رضی اللہ عنہ کی خدمت میں حاضر ہوتے تو آپ ہم سے انصار کی فضیلتیں اور غزوات میں ان کے مجاہدانہ واقعات بیان کیا کرتے پھر میری طرف یا قبیلہ ازد کے ایک شخص کی طرف متوجہ ہو کر کہتے : تمہاری قوم ( انصار ) نے فلاں دن فلاں دن فلاں فلاں کام انجام دیے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 134090,
        "last_updated": null
    },
    {
        "urduURN": 4037360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3777,
        "hadithSanad": "مجھ سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے ، ان سے ہشام نے ، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "بعاث کی جنگ کو ( جو اسلام سے پہلے اوس اور خزرج میں ہوئی تھی ) اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم کے مفاد میں پہلے ہی مقدم کر رکھا تھا چنانچہ جب آپ مدینہ میں تشریف لائے تو یہ قبائل آپس کی پھوٹ کا شکار تھے اور ان کے سردار کچھ قتل کئے جا چکے تھے ، کچھ زخمی تھے ، تو اللہ تعالیٰ نے اس جنگ کو آپ سے پہلے اس لیے مقدم کیا تھا تاکہ وہ آپ کے تشریف لاتے ہی مسلمان ہو جائیں ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 134100,
        "last_updated": null
    },
    {
        "urduURN": 4037370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3778,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ابوالتیاح نے ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "فتح مکہ کے دن جب آنحضرت صلی اللہ علیہ وسلم نے قریش کو ( غزوہ حنین کی ) غنیمت کا سارا مال دے دیا تو بعض نوجوان انصار یوں نے کہا ( اللہ کی قسم ! ) یہ تو عجیب بات ہے ابھی ہماری تلواروں سے قریش کا خون ٹپک رہا ہے اور ہمارا حاصل کیا ہوا مال غنیمت صرف انہیں دیا جا رہا ہے ، اس کی خبر جب آنحضرت صلی اللہ علیہ وسلم کو ملی تو آپ نے انصار کو بلایا ، انس رضی اللہ عنہ نے کہا کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا جو خبر مجھے ملی ہے کیا وہ صحیح ہے ؟ انصار لوگ جھوٹ نہیں بولتے تھے انہوں نے عرض کر دیا کہ آپ کو صحیح اطلاع ملی ہے ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کیا تم اس سے خوش اور راضی نہیں ہو کہ جب سب لوگ غنیمت کا مال لے کر اپنے گھروں کو واپس ہوں اور تم لوگ رسول اللہ صلی اللہ علیہ وسلم کو ساتھ لیے اپنے گھروں کو جاؤ گے ؟ انصار جس نالے یا گھاٹی میں چلیں گے تو میں بھی اسی نالے یا گھاٹی میں چلوں گا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 134110,
        "last_updated": null
    },
    {
        "urduURN": 4037380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3779,
        "hadithSanad": "مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، ہم سے شعبہ نے بیان کیا ، ان سے محمد بن زیاد نے ، ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے یا ( یوں بیان کیا کہ ) ابوالقاسم صلی اللہ علیہ وسلم نے فرمایا : انصار جس وادی یا گھاٹی میں جائیں تو میں بھی انہیں کی وادی میں جاؤں گا ۔ اور اگر میں ہجرت نہ کرتا تو میں انصار کا ایک فرد ہونا پسند کرتا ۔ حضرت ابوہریرہ رضی اللہ عنہ نے کہا آپ پر میرے ماں باپ قربان ہوں آپ نے یہ کوئی ظلم والی بات نہیں فرمائی آپ کو انصار نے اپنے یہاں ٹھہرایا اور آپ کی مدد کی تھی یا حضرت ابوہریرہ رضی اللہ عنہ نے ( اس کے ہم معنی ) اور کوئی دوسرا کلمہ کہا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 134120,
        "last_updated": null
    },
    {
        "urduURN": 4037390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3780,
        "hadithSanad": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے ابراہیم بن سعد نے بیان کیا ، ان سے ان کے والد نے ، ان سے ان کے دادا نے کہ",
        "hadithText": "جب مہاجر لوگ مدینہ میں آئے تو رسول اللہ صلی اللہ علیہ وسلم نے عبدالرحمٰن بن عوف اور سعد بن ربیع کے درمیان بھائی چارہ کرا دیا ۔ سعدر ضی اللہ عنہ نے عبدالرحمٰن بن عوف رضی اللہ عنہ سے کہا کہ میں انصار میں سب سے زیادہ دولت مند ہوں اس لیے آپ میرا آدھامال لے لیں ۔ ، اور میری دوبیویاں ہیں ، آپ انہیں دیکھ لیں جو آپ کو پسند ہو اس کے متعلق مجھے بتائیں میں اسے طلاق دے دوں گا ۔ عدت گزرنے کے بعد آپ اس سے نکاح کر لیں ، اس پر عبدالرحمٰن بن عوف رضی اللہ عنہ نے کہا : اللہ تمہارے اہل اور مال میں برکت عطافرمائے تمہارا بازار کدھر ہے ؟ چنانچہ میں نے بنی قینقاع کا بازار انہیں بتا دیا ، جب وہاں سے کچھ تجارت کر کے لوٹے تو ان کے ساتھ کچھ پنیر اور گھی تھا پھر وہ اسی طرح روزانہ صبح سویرے بازار میں چلے جاتے اور تجارت کرتے آخر ایک دن خدمت نبوی میں آئے تو ان کے جسم پر ( خوشبو کی ) زردی کا نشان تھا آنحضرت صلی اللہ علیہ وسلم نے فرمایا یہ کیا ہے انہوں نے بتایا کہ میں نے شادی کر لی ہے ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا : مہر کتنا ادا کیا ہے ؟ عرض کیا کہ سونے کی ایک گٹھلی یا ( یہ کہا کہ ) ایک گٹھلی کے وزن برابر سونا ادا کیا ہے ، یہ شک ابراہیم راوی کو ہوا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 134130,
        "last_updated": null
    },
    {
        "urduURN": 4037400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3781,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے حمید نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "جب عبدالرحمٰن بن عوف رضی اللہ عنہ ( مکہ سے ہجرت کر کے مدینہ آئے تو ) رسول کریم صلی اللہ علیہ وسلم نے ان کے اور سعد بن ربیع رضی اللہ عنہ کے درمیان بھائی چارہ کرا دیا ، حضرت سعد رضی اللہ عنہ بہت دولت مند تھے ، انہوں نے عبدالرحمٰن بن عوف رضی اللہ عنہ سے کہا : انصار کو معلوم ہے کہ میں ان میں سب سے زیادہ مالدار ہوں اس لیے میں اپنا آدھا آدھا مال اپنے اور آپ کے درمیان بانٹ دینا چاہتا ہوں اور میرے گھر میں دوبیویاں ہیں جو آپ کو پسند ہو میں اسے طلاق دے دوں گا اس کی عدت گزرجانے پر آپ اس سے نکاح کر لیں ، حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ نے کہا اللہ تمہارے اہل و مال میں برکت عطافرمائے ، ( مجھ کو اپنا بازار دکھلادو ) پھر وہ بازار سے اس وقت تک واپس نہیں آئے جب تک کچھ گھی اور پنیر بطور نفع بچا نہیں لیا ، تھوڑے ہی دنوں کے بعد جب رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں وہ حاضر ہوئے تو جسم پر زردی کا نشان تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے پوچھا یہ کیا ہے ؟ بولے کہ میں نے ایک انصاری خاتون سے شادی کر لی ہے ۔ آپ صلی اللہ علیہ وسلم نے پوچھا مہر کیا دیا ہے ؟ بولے ایک گٹھلی کے برابر سونا یا ( یہ کہا کہ ) سونے کی ایک گٹھلی دی ہے ، اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا اچھا اب ولیمہ کرو خواہ ایک بکری ہی سے ہو ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 134140,
        "last_updated": null
    },
    {
        "urduURN": 4037410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3782,
        "hadithSanad": "ہم سے ابوہمام صلت بن محمد نے بیان کیا کہا میں نے مغیرہ بن عبدالرحمٰن سے سنا ، کہا ہم سے ابوالزناد نے بیان کیا ، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "انصار نے کہا یا رسول اللہ ! کھجور کے باغات ہمارے اور مہاجرین کے درمیان تقسیم فرما دیں ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں ایسا نہیں کروں گا اس پر انصار نے ( مہاجرین سے ) کہا پھر آپ ایسا کر لیں کہ کام ہماری طرف سے آپ انجام دیاکریں اور کھجوروں میں آپ ہمارے ساتھی ہو جائیں ، مہاجرین نے کہا ہم نے آپ لوگوں کی یہ بات سنی اور ہم ایسا ہی کریں گے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 134150,
        "last_updated": null
    },
    {
        "urduURN": 4037420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3783,
        "hadithSanad": "ہم سے حجاج بن منہال نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، مجھے عدی بن ثابت نے خبر دی ، کہا کہ میں نے حضرت براء رضی اللہ عنہ سے سنا وہ کہتے تھے کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنایا یوں بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا انصار سے صرف مومن ہی محبت رکھے گا اور ان سے صرف منافق ہی بغض رکھے گا ۔ پس جو شخص ان سے محبت کرے اس سے اللہ محبت کرے گا اور جوان سے بغض رکھے گا اس سے اللہ تعالیٰ بغض رکھے گا ( معلوم ہوا کہ انصار کی محبت نشان ایمان ہے اور ان سے دشمنی رکھنا بے ایمان لوگوں کا کام ہے ۔ )</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 134160,
        "last_updated": null
    },
    {
        "urduURN": 4037430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3784,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عبدالرحمٰن بن عبداللہ بن جبیر نے کہا اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ایمان کی نشانی انصار سے محبت رکھنا ہے اور نفاق کی نشانی انصار سے بغض رکھنا ہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 134170,
        "last_updated": null
    },
    {
        "urduURN": 4037440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3785,
        "hadithSanad": "ہم سے ابومعمر نے بیان کیا ، انہوں نے کہا ہم سے عبدالوارث نے بیان کیا ، کہا ہم سے عبدالعزیز نے بیان کیا اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک مرتبہ نبی کریم صلی اللہ علیہ وسلم نے ( انصار کی ) عورتوں اور بچوں کو میرے گمان کے مطابق کسی شادی سے واپس آتے ہوئے دیکھا تو آپ کھڑے ہو گئے اور فرمایا اللہ ( گواہ ہے ) تم لوگ مجھے سب سے زیادہ عزیز ہو ، تین بار آپ نے ایسا ہی فرمایا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 134180,
        "last_updated": null
    },
    {
        "urduURN": 4037450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3786,
        "hadithSanad": "ہم سے یعقوب بن ابراہیم بن کثیر نے بیان کیا ، کہا ہم سے بہز بن اسد نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا کہ مجھے ہشام بن زید نے خبر دی ، کہا کہ میں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا انہوں نے کہا کہ",
        "hadithText": "انصار کی ایک عورت نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں ۔ ان کے ساتھ ایک ان کا بچہ بھی تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے کلام کیا پھر فرمایا اس ذات کی قسم ! جس کے ہاتھ میں میری جان ہے ۔ تم لوگ مجھے سب سے زیادہ محبوب ہو دو مرتبہ آپ نے یہ جملہ فرمایا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 134190,
        "last_updated": null
    },
    {
        "urduURN": 4037460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3787,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عمرو بن مرہ نے ، انہوں نے ابوحمزہ سے سنا اور انہوں نے حضرت زید بن ارقم رضی اللہ عنہ سے کہ",
        "hadithText": "انصار نے عرض کیا یا رسول اللہ ! ہر نبی کے تابعدار لوگ ہوتے ہیں اور ہم نے آپ کی تابعداری کی ہے ، آپ اللہ سے دعا فرمائیں کہ اللہ ہمارے تابعداروں کو بھی ہم میں شریک کر دے ۔ تو آنحضرت صلی اللہ علیہ وسلم نے اس کی دعا فرمائی ۔ پھر میں نے اس حدیث کا ذکر عبدالرحمٰن ابن ابی لیلیٰ کے سامنے کیا تو انہوں نے کہا کہ حضرت زید بن ارقم رضی اللہ عنہ نے بھی یہ حدیث بیان کی تھی ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 134200,
        "last_updated": null
    },
    {
        "urduURN": 4037470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3788,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے ، کہا ہم سے عمرو بن مرہ نے کہ میں نے انصار کے ایک آدمی ابوحمزہ سے سنا کہ",
        "hadithText": "انصار نے عرض کیا ہرقوم کے تابعدار ( ہالی موالی ) ہوتے ہیں ، ہم تو آپ کے تابعدار بنے آپ دعافرمائیں کہ اللہ تعالیٰ ہمارے تابعداروں کو بھی ہم میں شریک کر دے ۔ پس نبی کریم صلی اللہ علیہ وسلم نے دعا فرمائی ، اے اللہ ! ان کے تابعداروں کو بھی انہیں میں سے کر دے ۔ عمرو نے بیان کیا کہ پھر میں نے اس حدیث کا تذکرہ عبدالرحمٰن بن ابی لیلیٰ سے کیا تو انہوں نے ( تعجب کے طور پر ) کہا زید نے ایسا کہا ؟ شعبہ نے کہا کہ میرا خیال ہے کہ یہ زید ، زید بن ارقم رضی اللہ عنہ ہیں ، ۔ ( نہ اور کوئی زید جیسے زید بن ثابت رضی اللہ عنہ وغیرہ جیسے ابن ابی لیلیٰ نے گمان کیا )</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 134210,
        "last_updated": null
    },
    {
        "urduURN": 4037480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3789,
        "hadithSanad": "مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا کہ میں نے قتادہ سے سنا ، ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا اور ان سے حضرت ابواسید رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، بنو نجار کا گھرانہ انصار میں سے سب سے بہتر گھرانہ ہے پھر بنو عبدالاشہل کا ، پھر بنو الحارث بن خزرج کا ، پھر بنو ساعدہ بن کعب بن خزرج اکبر کا ، ، جو اوس کا بھائی تھا ، خزرج اکبر اور اوس دونوں حارثہ کے بیٹے تھے اور انصار کا ہر گھرانہ عمدہ ہی ہے ۔ سعد بن عبادہ رضی اللہ عنہ نے کہا کہ میرا خیال ہے کہ نبی کریم صلی اللہ علیہ وسلم نے انصار کے کئی قبیلوں کو ہم پر فضیلت دی ہے ، ان سے کسی نے کہا تجھ کو بھی تو بہت سے قبیلوں پر آنحضرت صلی اللہ علیہ وسلم نے فضیلت دی ہے اور عبدالصمد نے کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے بیان کیا ، میں نے حضرت انس رضی اللہ عنہ سے سنا اور ان سے ابواسید رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے یہی حدیث بیان کی ، اس روایت میں سعد کے باپ کا نام عبادہ مذکور ہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 0,
        "last_updated": null
    },
    {
        "urduURN": 4037490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3790,
        "hadithSanad": "ہم سے سعد بن حفص طلحی نے بیان کیا ، کہا ہم سے شیبان نے بیان کیا ، ان سے یحییٰ نے کہ ابوسلمہ نے بیان کیا کہ مجھے حضرت ابواسید رضی اللہ عنہ نے خبر دی اور انہوں نے نبی کریم صلی اللہ علیہ وسلم کو یہ فرماتے سنا کہ",
        "hadithText": "انصار میں سب سے بہتر یا انصارکے گھرانوں میں سب سے بہتر بنو نجار ، بنو عبدالاشھل ، بنو حارث اور بنو ساعدہ کے گھرانے ہیں ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 134240,
        "last_updated": null
    },
    {
        "urduURN": 4037500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3791,
        "hadithSanad": "ہم سے خالد بن مخلد نے بیان کیا ، کہا ہم سے سلیمان نے بیان کیا ، کہا مجھ سے عمرو بن یحییٰ نے بیان کیا ، ان سے عباس بن سہل نے اور ان سے ابو حمید ساعدی نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، انصار کا سب سے بہترین گھرانہ بنو نجار کا گھرانہ ہے پھر عبدالاشھل کا پھر بنی حارث کا ، پھر بنی ساعدہ کا اور انصار کے تمام گھرانوں میں خیر ہے ، پھر ہماری ملاقات سعد بن عبادہ رضی اللہ عنہ سے ہوئی تو وہ ابواسید رضی اللہ عنہ سے کہنے لگے تمہیں معلوم نہیں آنحضرت صلی اللہ علیہ وسلم نے انصار کے بہترین گھرانوں کی تعریف کی اور ہمیں ( بنوساعدہ ) کو سب سے اخیر میں رکھا تو سعد بن عبادہ رضی اللہ عنہ آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور انہوں نے عرض کیا یا رسول اللہ ! انصار کے سب سے بہترین خاندانوں کا بیان ہوا اور ہم سب سے اخیر میں کر دیئے گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کیا تمہارے لیے کافی نہیں کہ تمہارا خاندان بھی بہترین خاندان ہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 134250,
        "last_updated": null
    },
    {
        "urduURN": 4037510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3792,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے کہا کہ میں نے قتادہ سے سنا ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے اور انہوں نے حضرت اسید بن حضیر رضی اللہ عنہ سے کہ",
        "hadithText": "ایک انصاری صحابی نے عرض کیا یا رسول اللہ ! فلاں شخص کی طرح مجھے بھی آپ حاکم بنادیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا میرے بعد ( دنیاوی معاملات میں ) تم پر دوسروں کو ترجیح دی جائے گی اس لیے صبر سے کام لینا ، یہاں تک کہ مجھ سے حوض پر آ ملو ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 134260,
        "last_updated": null
    },
    {
        "urduURN": 4037520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3793,
        "hadithSanad": "مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ہشام نے کہا کہ میں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے کہاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے انصار سے فرمایا : میرے بعد تم دیکھوگے کہ تم پر دوسروں کو فوقیت دی جائے گی ، پس تم صبر کرنا یہاں تک کہ مجھ سے آ ملو اور میری تم سے ملاقات حوض پر ہو گی ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 134270,
        "last_updated": null
    },
    {
        "urduURN": 4037530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3794,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے یحییٰ بن سعید نے ، انہوں نے انس رضی اللہ عنہ سے سنا....",
        "hadithText": "جب وہ انس رضی اللہ عنہ کے ساتھ خلیفہ ولید بن عبدالملک کے یہاں جانے کے لیے نکلے.... نبی کریم صلی اللہ علیہ وسلم نے انصار کو بلایا تاکہ بحرین کا ملک بطور جاگیر انہیں عطا فرما دیں ، انصار نے کہا جب تک آپ ہمارے بھائی مہاجرین کو بھی اسی جیسی جاگیر نہ عطا فرمائیں ہم اسے قبول نہیں کریں گے ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا دیکھو جب آج تم قبول نہیں کرتے ہو تو پھر میرے بعد بھی صبر کرنا یہاں تک کہ مجھ سے آ ملو ، کیونکہ میرے بعد قریب ہی تمہاری حق تلفی ہونے والی ہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 134280,
        "last_updated": null
    },
    {
        "urduURN": 4037540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3795,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے ابوایاس نے بیان کیا ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ( خندق کھودتے وقت ) فرمایا حقیقی زندگی تو صرف آخرت کی زندگی ہے ، پس اے اللہ ! انصار اور مہاجرین پر اپنا کرم فرما اور قتادہ سے روایت ہے ان سے حضرت انس رضی اللہ عنہ نے بیان کیا نبی کریم صلی اللہ علیہ وسلم سے اسی طرح ، اور انہوں نے بیان کیا اس میں یوں ہے ” پس انصار کی مغفرت فرما دے “ ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 134290,
        "last_updated": null
    },
    {
        "urduURN": 4037550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3796,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے حمید طویل نے ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا",
        "hadithText": "آپ نے فرمایا کہ انصار غزوہ خندق کے موقعہ پر ( خندق کھودتے ہوئے ) یہ شعر پڑھتے تھے ” ہم وہ ہیں جنہوں نے حضرت ( صلی اللہ علیہ وسلم ) سے جہاد پر بیعت کی ہے ، جب تک ہماری جان میں جان ہے “ آنحضرت صلی اللہ علیہ وسلم نے ( جب یہ سنا تو ) اس کے جواب میں یوں فرمایا : ” اے اللہ ! آخرت کی زندگی کے سوا اور کوئی زندگی حقیقی زندگی نہیں ہے ، پس انصار اور مہاجرین پر اپنا فضل و کرم فرما ۔ “</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 134300,
        "last_updated": null
    },
    {
        "urduURN": 4037560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3797,
        "hadithSanad": "مجھ سے محمد بن عبیداللہ نے بیان کیا ، کہا ہم سے ابن حازم نے بیان کیا ، ان سے ان کے والد نے اور ان سے حضرت سہل رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس تشریف لائے تو ہم خندق کھود رہے تھے اور اپنے کندھوں پر مٹی اٹھا رہے تھے ۔ اس وقت آپ نے یہ دعا فرمائی ” اے اللہ ! آخرت کی زندگی کے سوا اور کوئی زندگی حقیقی زندگی نہیں ، پس انصار اور مہاجرین کی تو مغفرت فرما ۔ “</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 134310,
        "last_updated": null
    },
    {
        "urduURN": 4037570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3798,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے عبداللہ بن داود نے بیان کیا ، ان سے فضیل بن غزوان نے ، ان سے ابوحازم نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "ایک صاحب ( خود ابوہریرہ رضی اللہ عنہ ہی مراد ہیں ) رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں بھوکے حاضر ہوئے ، آپ نے انہیں ازواج مطہرات کے یہاں بھیجا ۔ ( تاکہ ان کو کھانا کھلادیں ) ازواج مطہرات نے کہلا بھیجا کہ ہمارے پاس پانی کے سوا اور کچھ نہیں ہے ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا : ان کی کون مہمانی کرے گا ؟ ایک انصاری صحابی بولے میں کروں گا ۔ چنانچہ وہ ان کو اپنے گھر لے گئے اور اپنی بیوی سے کہا کہ رسول اللہ صلی اللہ علیہ وسلم کے مہمان کی خاطر تواضع کر ، بیوی نے کہا کہ گھر میںبچوں کے کھانے کے سوا اور کوئی چیز بھی نہیں ہے ، انہوں نے کہا جو کچھ بھی ہے اسے نکال دو اور چراغ جلالو اور بچے اگر کھانا مانگتے ہیں تو انہیں سلادو ۔ بیوی نے کھانا نکال دیا اور چراغ جلادیا اور اپنے بچوں کو ( بھوکا ) سلادیا ، پھر وہ دکھاتو یہ رہی تھیں جیسے چراغ درست کر رہی ہوں لیکن انہوں نے اسے بجھا دیا ، اس کے بعد دونوں میاں بیوی مہمان پر ظاہر کرنے لگے کہ گویا وہ بھی ان کے ساتھ کھا رہے ہیں ، لیکن ان دونوں نے ( اپنے بچوں سمیت رات ) فاقہ سے گزار دی ، صبح کے وقت جب وہ صحابی آنحضرت صلی اللہ علیہ وسلم کی خدمت میں آئے تو آپ صلی اللہ علیہ وسلم نے فرمایا تم دونوں میاں بیوی کے نیک عمل پر رات کو اللہ تعالیٰ ہنس پڑا یا ( یہ فرمایا کہ اسے ) پسند کیا ، اس پر اللہ تعالیٰ نے یہ آیت نازل فرمائی ” اور وہ ( انصار ) ترجیح دیتے ہیں اپنے نفسوں کے اوپر ( دوسرے غریب صحابہ کو ) اگرچہ وہ خود بھی فاقہ ہی میں ہوں اور جو اپنی طبیعت کے بخل سے محفوظ رکھا گیا سو ایسے ہی لوگ فلاح پانے والے ہیں ۔ “</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 134320,
        "last_updated": null
    },
    {
        "urduURN": 4037580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3799,
        "hadithSanad": "مجھ سے ابوعلی محمد بن یحییٰ نے بیان کیا ، کہا ہم سے عبدان کے بھائی شاذان نے بیان کیا ، کہا مجھ سے میرے باپ نے بیان کیا ، ہمیں شعبہ بن حجاج نے خبر دی ، ان سے ہشام بن زید نے بیان کیا کہ میں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "حضرت ابوبکر اور حضرت عباس رضی اللہ عنہما انصار کی ایک مجلس سے گزرے ، دیکھا کہ تمام اہل مجلس رورہے ہیں ، پوچھا آپ لوگ کیوں رورہے ہیں ؟ مجلس والوں نے کہا کہ ابھی ہم رسول اللہ صلی اللہ علیہ وسلم کی مجلس کو یاد کر رہے تھے جس میں ہم بیٹھا کرتے تھے ( یہ آنحضرت صلی اللہ علیہ وسلم کے مرض الوفات کا واقعہ ہے ) اس کے بعد یہ آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آپ کو واقعہ کی اطلاع دی ، بیان کیا کہ اس پر آنحضرت صلی اللہ علیہ وسلم باہر تشریف لائے ، سرمبارک پر کپڑے کی پٹی بندھی ہوئی تھی ، راوی نے بیان کیا کہ پھر آپ منبر پر تشریف لائے اور اس کے بعد پھر کبھی منبر پر آپ تشریف نہ لا سکے ، آپ نے اللہ کی حمد و ثنا کے بعد فرمایا میں تمہیں انصار کے بارے میں وصیت کرتا ہوں کہ وہ میرے جسم و جان ہیں ، انہوں نے اپنی تمام ذمہ داریاں پوری کی ہیں لیکن اس کا بدلہ جو انہیں ملنا چاہیے تھا ، وہ ملنا ابھی باقی ہے ، اس لیے تم لوگ بھی ان کے نیک لوگوں کی نیکیوں کی قدر کرنا اور ان کے خطاکاروں سے درگزر کرتے رہنا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 134330,
        "last_updated": null
    },
    {
        "urduURN": 4037590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3800,
        "hadithSanad": "ہم سے احمد بن یعقوب نے بیان کیا ، انہوں نے کہا ہم سے ابن غسیل نے بیان کیا ، انہوں نے کہا میں نے عکرمہ سے سنا ، کہا کہ میں نے عبداللہ بن عباس رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم باہر تشریف لائے آپ صلی اللہ علیہ وسلم اپنے دونوں شانوں پر چادر اوڑھے ہوئے تھے ، اور ( سرمبارک پر ) ایک سیاہ پٹی ( بندھی ہوئی تھی ) آپ منبرپر بیٹھ گئے اور اللہ تعالیٰ کی حمد و ثنا کے بعد فرمایا : امابعد ا ے لوگو ! دوسروں کی تو بہت کثرت ہو جائے گی لیکن انصار کم ہو جائیں گے اور وہ ایسے ہو جائیں گے جیسے کھانے میں نمک ہوتا ہے ، پس تم میں سے جو شخص بھی کسی ایسے محکمہ میں حاکم ہو جس کے ذریعہ کسی کو نقصان ونفع پہنچا سکتا ہو تو اسے انصار کے نیکوکاروں کی پذیرائی کرنی چاہیے ۔ اور ان کے خطاکاروں سے درگزر کرنا چاہیے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 134340,
        "last_updated": null
    },
    {
        "urduURN": 4037600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3801,
        "hadithSanad": "ہم سے محمد بن بشارنے بیان کیا ، ہم سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا کہ میں نے قتادہ سے سنا اور انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، انصار میرے جسم و جان ہیں ، ایک دور آئے گا کہ دوسرے لوگ تو بہت ہو جائیں گے ، لیکن انصار کم رہ جائیں گے ، اس لیے ان کے نیکوکاروں کی پذیرائی کیا کرنا ، اور خطا کاروں سے درگزر کیا کرنا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 134350,
        "last_updated": null
    },
    {
        "urduURN": 4037610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3802,
        "hadithSanad": "مجھ سے محمد بن بشار نے بیان کیا کہا مجھ سے شعبہ نے بیان کیا ، ان سے ابواسحٰق نے کہا کہ میں نے براء  بن عازب رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے پاس ہدیہ میں ایک ریشمی حلہ آیا تو صحابہ اسے چھونے لگے اور اس کی نرمی اور نزاکت پر تعجب کرنے لگے ، آپ صلی اللہ علیہ وسلم نے اس پر فرمایا تمہیں اس کی نرمی پر تعجب ہے ، سعد بن معاذ رضی اللہ عنہ کے رومال ( جنت میں ) اس سے کہیں بہتر ہیں یا ( آپ صلی اللہ علیہ وسلم نے فرمایا کہ ) اس سے کہیں زیادہ نرم و نازک ہیں ، اس حدیث کی روایت قتادہ اور زہری نے بھی کی ہے ، انہوں نے انس رضی اللہ عنہ سے سنا ، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا ہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 134360,
        "last_updated": null
    },
    {
        "urduURN": 4037620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3803,
        "hadithSanad": "مجھ سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے ابوعوانہ کے داماد فضل بن مساور نے بیان کیا ، کہا ہم سے اعمش نے ، ان سے ابوسفیان نے اور ان سے جابر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ سعد بن معاذ رضی اللہ عنہ کی موت پر عرش ہل گیا اور اعمش سے روایت ہے ، ان سے ابوصالح نے بیان کیا اور ان سے جابر رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے اسی طرح روایت کیا ، ایک صاحب نے جابر رضی اللہ عنہ سے کہا کہ براء رضی اللہ عنہ تو اس طرح بیان کرتے ہیں کہ چارپائی جس پر معاذ رضی اللہ عنہ کی نعش رکھی ہوئی تھی ، ہل گئی تھی ، حضرت جابررضی اللہ عنہ نے کہا ان دونوں قبیلوں ( اوس اور خزرج ) کے درمیان ( زمانہ جاہلیت میں ) دشمنی تھی ، میں نے خود نبی کریم صلی اللہ علیہ وسلم کو یہ فرماتے سنا ہے کہ سعد بن معاذ رضی اللہ عنہ کی موت پر عرش رحمن ہل گیا تھا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 134370,
        "last_updated": null
    },
    {
        "urduURN": 4037630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3804,
        "hadithSanad": "ہم سے محمد بن عر عرہ نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے سعد بن ابراہیم نے ، ان سے ابوامامہ بن سہل بن حنیف نے اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک قوم ( یہود بنی قریظہ ) نے سعد بن معاذ رضی اللہ کو ثالث مان کر ہتھیار ڈال دیئے تو انہیں بلانے کے لیے آدمی بھیجا گیا اور وہ گدھے پر سوار ہو کر آئے ، جب اس جگہ کے قریب پہنچے جسے ( نبی کریم صلی اللہ علیہ وسلم نے ایام جنگ میں ) نماز پڑھنے کے لیے منتخب کیا ہوا تھا تو آنحضرت صلی اللہ علیہ وسلم نے صحابہ سے فرمایا کہ اپنے سب سے بہتر شخص کے لیے یا ( آپ صلی اللہ علیہ وسلم نے یہ فرمایا ) اپنے سردار کو لینے کے لیے کھڑے ہو جاؤ ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا : اے سعد ! انہوں نے تم کو ثالث مان کر ہتھیار ڈال دیئے ہیں ، حضرت سعد رضی اللہ عنہ نے کہا پھر میرا فیصلہ یہ ہے کہ ان کے جو لوگ جنگ کرنے والے ہیں انہیں قتل کر دیا جائے اور ان کی عورتوں ، بچوں کو جنگی قیدی بنا لیا جائے ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا تم نے اللہ کے فیصلے کے مطابق فیصلہ کیا یا ( آپ صلی اللہ علیہ وسلم نے یہ فرمایا کہ ) فرشتے کے حکم کے مطابق فیصلہ کیا ہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 134380,
        "last_updated": null
    },
    {
        "urduURN": 4037640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3805,
        "hadithSanad": "ہم سے علی بن مسلم نے بیان کیا ، کہا ہم سے حبان نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، انہیں قتادہ نے خبر دی اور انہیں حضرت انس رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی مجلس سے اٹھ کر دو صحابی ایک تاریک رات میں ( اپنے گھر کی طرف ) جانے لگے تو ایک غیبی نور ان کے آگے آگے چل رہا تھا ، پھر جب وہ جدا ہوئے تو ان کے ساتھ ساتھ وہ نور بھی الگ الگ ہو گیا اور معمر نے ثابت سے بیان کیا اور ان سے حضرت انس رضی اللہ عنہ نے کہ اسید بن حضیر رضی اللہ عنہ اور ایک دوسرے انصاری صحابی ( کے ساتھ یہ کرامت پیش آئی تھی ) اور حماد نے بیان کیا ، انہیں ثابت نے خبر دی اور انہیں حضرت انس رضی اللہ عنہ نے کہ اسید بن حضیر اور عباد بن بشر رضی اللہ عنہما کے ساتھ یہ کرامت پیش آئی تھی ۔ یہ نبی کریم صلی اللہ علیہ وسلم کے حوالہ سے نقل کیا ہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 134390,
        "last_updated": null
    },
    {
        "urduURN": 4037650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3806,
        "hadithSanad": "مجھ سے محمد بن بشار نے بیان کیا ، انہوں نے کہا ہم سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عمرو نے ، ان سے ابراہیم نے ، ان سے مسروق نے اور ان سے حضرت عبداللہ بن عمرو رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا آپ صلی اللہ علیہ وسلم نے فرمایا قرآن چار ( حضرات صحابہ ) عبداللہ بن مسعود ، ابوحذیفہ کے غلام سالم اور ابی بن کعب اور معاذ بن جبل رضی اللہ عنہم سے سیکھو ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 134400,
        "last_updated": null
    },
    {
        "urduURN": 4037660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3807,
        "hadithSanad": "ہم سے اسحٰق نے بیان کیا ، انہوں نے کہا ہم سے عبدالصمد نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا کہ ہم سے قتادہ نے بیان کیا ، انہوں نے کہا میں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا کہ حضرت ابواسید رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا : انصار کا بہترین گھرانہ بنو نجار کا گھرانہ ہے ، پھر بنو عبدالاشھل کا ، پھر بنو عبدالحارث کا ، پھر بنو ساعدہ کا اور خیر انصار کے تمام گھرانوں میں ہے ، حضرت سعد بن عبادہ رضی اللہ عنہ نے کہا اور وہ اسلام قبول کرنے میں بڑی قدامت رکھتے تھے کہ میرا خیال ہے ، آنحضرت صلی اللہ علیہ وسلم نے ہم پر دوسروں کو فضیلت دے دی ہے ، ان سے کہا گیا کہ آنحضرت صلی اللہ علیہ وسلم نے تم کوبھی تو بہت سے لوگوں پر فضیلت دی ہے ۔ ( اعتراض کی کیا بات ہے )</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 134410,
        "last_updated": null
    },
    {
        "urduURN": 4037670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3808,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عمرو بن مرہ نے ، ان سے ابراہیم نے ، ان سے مسروق نے بیان کیا کہ عبداللہ بن عمرو رضی اللہ عنہما کی مجلس میں حضرت عبداللہ بن مسعود رضی اللہ عنہما کا ذکر آیا تو انہوں نے کہا کہ",
        "hadithText": "اس وقت سے ان کی محبت میرے دل میں بیٹھ گئی جب سے میں نے رسول کریم صلی اللہ علیہ وسلم کو یہ فرماتے سنا کہ قرآن چار آدمیوں سے سیکھو ، عبداللہ بن مسعود رضی اللہ عنہما سے ، آنحضرت صلی اللہ علیہ وسلم نے انہیں کے نام سے ابتداء کی ، اور ابوحذیفہ رضی اللہ عنہ کے غلام سالم سے ، معاذ بن جبل رضی اللہ عنہ سے اور ابی بن کعب رضی اللہ عنہ سے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 134420,
        "last_updated": null
    },
    {
        "urduURN": 4037680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3809,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، کہا کہ میں نے شعبہ سے سنا ، انہوں نے قتادہ سے سنا اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے حضرت ابی بن کعب رضی اللہ عنہ سے فرمایا : اللہ تعالیٰ نے مجھے حکم دیا ہے کہ میں تم کو سورۃ ” لم يكن الذين كفروا‏ “ سناؤں ، حضرت ابی بن کعب رضی اللہ عنہ بولے کیا اللہ تعالیٰ نے میرا نام لیا ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں ، اس پر حضرت ابی بن کعب رضی اللہ عنہ فرط مسرت سے رونے لگے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 134430,
        "last_updated": null
    },
    {
        "urduURN": 4037690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3810,
        "hadithSanad": "مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے زمانے میں چار آدمی جن سب کا تعلق قبیلہ انصار سے تھا ، قرآن مجید جمع کرنے والے تھے ، ابی بن کعب ، معاذ بن جبل ، ابوزید اور زید بن ثابت رضی اللہ عنہم ، میں نے پوچھا : ابوزید کون ہیں ؟ انہوں نے فرمایا کہ وہ میرے ایک چچا ہیں ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 134440,
        "last_updated": null
    },
    {
        "urduURN": 4037700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3811,
        "hadithSanad": "ہم سے ابومعمر نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، کہا ہم سے عبدالعزیز بن صہیب نے بیان کیا اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "احد کی لڑائی کے موقعہ پر جب صحابہ نبی کریم صلی اللہ علیہ وسلم کے قریب سے ادھر ادھر چلنے لگے تو ابوطلحہ رضی اللہ عنہ اس وقت اپنی ایک ڈھال سے آنحضرت صلی اللہ علیہ وسلم کی حفاظت کر رہے تھے حضرت ابوطلحہ بڑے تیرانداز تھے اور خوب کھینچ کر تیر چلایا کرتے تھے ، چنانچہ اس دن دو یا تین کمانیں انہوں نے توڑ دی تھیں ، اس وقت اگر کوئی مسلمان ترکش لیے ہوئے گزرتا تو آنحضرت صلی اللہ علیہ وسلم فرماتے کہ اس کے تیر ابوطلحہ کو دے دو ، آنحضرت صلی اللہ علیہ وسلم حالات معلوم کرنے کے لیے اچک کر دیکھنے لگتے تو ابوطلحہ رضی اللہ عنہ عرض کرتے یا نبی اللہ ! آپ پر میرے ماں باپ قربان ہوں ، اچک کر ملاحظہ نہ فرمائیں ، کہیں کوئی تیر آپ کو نہ لگ جائے ، میرا سینہ آنحضرت صلی اللہ علیہ وسلم کے سینے کی ڈھال بنا رہا اور میں نے عائشہ بنت ابی بکر رضی اللہ عنہا اور ام سلیم ( ابوطلحہ کی بیوی ) کو دیکھا کہ اپنا ازار اٹھائے ہوئے ( غازیوں کی مدد میں ) بڑی تیزی کے ساتھ مشغول تھیں ۔ ( اس خدمت میں ان کے انہماک و استغراق کی وجہ سے انہیں کپڑوں تک کا ہوش نہ تھا یہاں تک کہ ) میں ان کی پنڈلیوں کے زیور دیکھ سکتا تھا ۔ انتہائی جلدی کے ساتھ مشکیزے اپنی پیٹھوں پر لیے جاتی تھیں اور مسلمانوں کو پلا کر واپس آتی تھیں اور پھر انہیں بھر کر لے جاتیں اور ان کا پانی مسلمانوں کو پلاتیں اور ابوطلحہ کے ہاتھ سے اس دن دو یا تین مرتبہ تلوار چھوٹ کر گر پڑی تھی ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 134450,
        "last_updated": null
    },
    {
        "urduURN": 4037710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3812,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا کہ میں نے امام مالک سے سنا ، وہ عمربن عبیداللہ کے مولیٰ ابونضر کے واسطے سے بیان کرتے ہیں ، وہ عامر بن سعد بن ابی وقاص سے اور ان سے ان کے والد ( حضرت سعد بن ابی وقاص رضی اللہ عنہ ) نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے عبداللہ بن سلام رضی اللہ عنہ کے سوا اور کسی کے متعلق یہ نہیں سنا کہ وہ اہل جنت میں سے ہیں ، بیان کیا کہ آیت ( ( وشهد شاهد من بني إسرائيل‏ ) ) ( الاحقاف : 10 ) انہیں کے بارے میں نازل ہوئی تھی ( راوی حدیث عبداللہ بن یوسف نے ) بیان کیا کہ آیت کے نزول کے متعلق مالک کا قول ہے یا حدیث میں اسی طرح تھا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 134460,
        "last_updated": null
    },
    {
        "urduURN": 4037720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3813,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے ازہرسمان نے بیان کیا ، ان سے ابوعوانہ نے ، ان سے محمد نے اور ان سے قیس بن عبادنے بیان کیا کہ",
        "hadithText": "میں مسجدنبوی میں بیٹھا ہوا تھا کہ ایک بزرگ مسجد میں داخل ہوئے جن کے چہرے پرخشوع وخضوع کے آثار ظاہر تھے لوگوں نے کہا کہ یہ بزرگ جنتی لوگوں میں سے ہیں ، پھر انہوں نے دو رکعت نماز مختصرطریقہ پر پڑھی اور باہر نکل گئے میں بھی ان کے پیچھے ہو لیا اور عرض کیا کہ جب آپ مسجد میں داخل ہوئے تھے تو لوگوں نے کہا کہ یہ بزرگ جنت والوں میں سے ہیں ، اس پر انہوں نے کہا خدا کی قسم ! کسی کے لیے ایسی بات زبان سے نکالنا مناسب نہیں ہے جسے وہ نہ جانتا ہو اور میں تمہیں بتاؤں گا کہ ایسا کیوں ہے ، نبی کریم صلی اللہ علیہ وسلم کے زمانے میں ، میں نے ایک خواب دیکھا اور آنحضرت صلی اللہ علیہ وسلم سے اسے بیان کیا میں نے خواب یہ دیکھا تھا کہ جیسے میں ایک باغ میں ہوں ، پھر انہوں نے اس کی وسعت اور اس کے سبزہ زاروں کا ذکر کیا اس باغ کے درمیان میں ایک لوہے کا ستون ہے جس کا نچلاحصہ زمین میں ہے اور اوپر کا آسمان پر اور اس کی چوٹی پر ایک گھنا درخت ہے ، ( العروۃ ) مجھ سے کہا گیا کہ اس پر چڑھ جاؤ میں نے کہا کہ مجھ میں تو اتنی طاقت نہیں ہے اتنے میں ایک خادم آیا اور پیچھے سے میرے کپڑے اس نے اٹھائے تو میں چڑھ گیا اور جب میں اس کی چوٹی پر پہنچ گیا تو میں نے اس گھنے درخت کو پکڑ لیا مجھ سے کہا گیا کہ اس درخت کو پوری مضبوطی کے ساتھ پکڑ لے ، ابھی میں اسے اپنے ہاتھ سے پکڑے ہوئے تھا کہ میری آنکھ کھل گئی ، یہ خواب جب میں نے آنحضرت صلی اللہ علیہ وسلم سے بیان کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو باغ تم نے دیکھا ہے ، وہ تواسلام ہے اور اس میں ستون اسلام کاستون ہے اور عروہ ( گھنادرخت ) العروۃ الوثقی ہے اس لیے تم اسلام پر مرتے دم تک قائم رہو گے ، یہ بزرگ حضرت عبداللہ بن سلام تھے اورمجھ سے خلیفہ نے بیان کیا ان سے معاذ نے بیان کیا ان سے ابن عون نے بیان کیا ان سے محمدنے ان سے قیس بن عباد نے بیان کیا عبداللہ بن سلام رضی اللہ عنہ سے انہوں نے منصف ( خادم ) کے بجائے وصیف کا لفظ ذکر کیا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 134471,
        "last_updated": null
    },
    {
        "urduURN": 4037730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3814,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے ، ان سے سعید بن ابی بردہ نے اور ان سے ان کے والد نے کہ",
        "hadithText": "میں مدینہ منورہ حاضر ہوا تو میں نے عبداللہ بن سلام رضی اللہ عنہ سے ملاقات کی ، انہوں نے کہا ، آو تمہیں میں ستو اور کھجور کھلاؤں گا اور تم ایک ( باعظمت ) مکان میں داخل ہو گے ( کہ رسول صلی اللہ علیہ وسلم بھی اس میں تشریف لے گئے تھے ، پھر آپ صلی اللہ علیہ وسلم نے فرمایا تمہارا قیام ایک ایسے ملک میں ہے جہاں سودی معاملات بہت عام ہیں اگر تمہارا کسی شخص پر کوئی حق ہو اور پھر وہ تمہیں ایک تنکے یا جو کے ایک دانے یا ایک گھاس کے برابربھی ہدیہ دے تو اسے قبول نہ کرنا کیونکہ وہ بھی سود ہے ، نضر ابوداؤد اور وہب نے ( اپنی روایتوں میں ) البیت ( گھر ) کا ذکر نہیں کیا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 134490,
        "last_updated": null
    },
    {
        "urduURN": 4037740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3815,
        "hadithSanad": "مجھ سے محمدنے بیان کیا ، کہا ہم کو خبر دی عبدہ نے ، انہیں ہشام بن عروہ نے ، ان سے ان کے والد نے بیان کیا کہ میں نے عبداللہ بن جعفرسے سنا ، انہوں نے بیان کیا کہ میں نے حضرت علی رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا آپ صلی اللہ علیہ وسلم نے فرمایا ( دوسری سند ) اور مجھ سے صدقہ نے بیان کیا ، کہا ہم کو عبدہ نے خبر دی ، انہیں ہشام نے ان سے ان کے والد نے بیان کیا کہ میں نے عبداللہ بن جعفرسے سنا انہوں نے حضرت علی رضی اللہ عنہ سے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( اپنے زمانے میں ) حضرت مریم علیہاالسلام سب سے افضل عورت تھیں اور ( اس امت میں ) حضرت خدیجہ ( رضی اللہ عنہا ) سب سے افضل ہیں ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 134500,
        "last_updated": null
    },
    {
        "urduURN": 4037750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3816,
        "hadithSanad": "ہم سے سعید بن عفیرنے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، کہا کہ",
        "hadithText": "ہشام نے میرے پاس اپنے والد ( عروہ ) سے لکھ کر بھیجا کہ حضرت عائشہ رضی اللہ عنہا نے کہا نبی کریم صلی اللہ علیہ وسلم کی کسی بیوی کے معاملہ میں ، میں نے اتنی غیرت نہیں محسوس کی جتنی غیرت حضرت خدیجہ رضی اللہ عنہ کے معاملہ ، میں محسوس کرتی تھی ، وہ میرے نکاح سے پہلے ہی وفات پا چکی تھیں لیکن آنحضرت صلی اللہ علیہ وسلم کی زبان سے میں ان کا ذکر سنتی رہتی تھی ، اور اللہ تعالیٰ نے آنحضرت صلی اللہ علیہ وسلم کو حکم دیا تھا کہ انہیں ( جنت میں ) موتی کے محل کی خوش خبر دی سنا دیں ، آنخصرت صلی اللہ علیہ وسلم اگر کبھی بکری ذبح کرتے تو ان سے میل محبت رکھنے والی خواتین کو اس میں سے اتنا ہدیہ بھیجتے جو ان کے لیے کافی ہو جاتا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 134510,
        "last_updated": null
    },
    {
        "urduURN": 4037760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3817,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے حمید بن عبدالرحمٰن نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "حضرت خدیجہ رضی اللہ عنہا کے معاملہ میں ، میں جتنی غیرت محسوس کرتی تھی اتنی کسی عورت کے معاملے میں نہیں کیونکہ رسول اللہ صلی اللہ علیہ وسلم ان کا ذکر اکثر کیا کرتے تھے ، انہوں نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم سے میرا نکاح ان کی وفات کے تین سال بعد ہوا تھا اور اللہ تعالیٰ نے انہیں حکم دیا تھا یا جبرائیل علیہ السلام کے ذریعہ یہ پیغام پہنچایا تھا کہ آنحضرت صلی اللہ علیہ وسلم انہیں جنت میں موتیوں کے ایک محل کی بشارت دے دیں ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 134520,
        "last_updated": null
    },
    {
        "urduURN": 4037770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3818,
        "hadithSanad": "مجھ سے عمربن محمد بن حسن نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، کہا ہم سے حفص نے بیان کیا ، ان سے ہشام نے ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم کی تمام بیویوںمیںجتنی غیرت مجھے حضرت خدیجہ رضی اللہ عنہا سے آتی تھی اتنی کسی اور سے نہیں آتی تھی ، حالانکہ انہیں میں نے دیکھابھی نہیں تھا ، لیکن آنحضرت صلی اللہ علیہ وسلم ان کاذکربکثرت فرمایاکرتے تھے اور اگر کوئی بکری ذبح کرتے تو اس کے ٹکڑے ٹکڑے کر کے حضرت خدیجہ رضی اللہ عنہا کی ملنے والیوں کو بھیجتے تھے میں نے اکثرحضور صلی اللہ علیہ وسلم سے کہا جیسے دنیا میں حضرت خدیجہ رضی اللہ عنہا کے سوا کوئی عورت ہے ہی نہیں ! اس پر آپ صلی اللہ علیہ وسلم فرماتے کہ وہ ایسی تھیں اورایسی تھیں اور ان سے میرے اولاد ہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 134530,
        "last_updated": null
    },
    {
        "urduURN": 4037780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3819,
        "hadithSanad": "ہم سے مسددنے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے اسماعیل نے بیان کیا کہ",
        "hadithText": "میں نے حضرت عبداللہ بن ابی اوفی سے پوچھا رسول اللہ صلی اللہ علیہ وسلم نے حضرت خدیجہ رضی اللہ عنہا کوبشارت دی تھی ؟ انہوں نے فرمایا کہ کہ ہاں ، جنت میں موتیوں کے ایک محل کی بشارت دی تھی ، جہاں نہ کوئی شوروغل ہو گا اور نہ تھکن ہو گی ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 134540,
        "last_updated": null
    },
    {
        "urduURN": 4037790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3820,
        "hadithSanad": "ہم سے قتیبہ بن سعیدنے بیان کیا ، کہا ہم سے محمد بن فضیل نے بیان کیا ، ان سے عمارہ نے ، ان سے ابوزرعہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جبرائیل علیہ السلام رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور کہا یا رسول اللہ صلی اللہ علیہ وسلم ! خدیجہ رضی اللہ عنہا آپ کے پاس ایک برتن لیے آ رہی ہیں جس میں سالن یا ( فرمایا ) کھانایا ( فرمایا ) پینے کی چیز ہے جب وہ آپ کے پاس آئیں تو ان کے رب کی جانب سے انہیں سلام پہنچا دیجئیے گا اور میری طرف سے بھی ! اور انہیں جنت میں موتیوں کے ایک محل کی بشارت دے دیجئیے گا ، جہاں نہ شور و ہنگامہ ہو گا اور نہ تکلیف و تھکن ہو گی ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 134550,
        "last_updated": null
    },
    {
        "urduURN": 4037800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3821,
        "hadithSanad": "اور اسماعیل بن خلیل نے بیان کیا ، انہیں علی بن مسہرنے خبر دی ، انہیں ہشام نے ، انہیں ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "خدیجہ رضی اللہ عنہا کی بہن ہالہ بنت خویلدنے ایک مرتبہ آنحضرت صلی اللہ علیہ وسلم سے اندر آنے کی اجازت چاہی تو آپ صلی اللہ علیہ وسلم کو حضرت خدیجہ رضی اللہ عنہا کی اجازت لینے کی ادا یاد آ گئی ، آپ صلی اللہ علیہ وسلم چونک اٹھے اور فرمایا اللہ ! یہ تو ہالہ ہیں ، حضرت عائشہ رضی اللہ عنہا نے کہا کہ مجھے اس پر بڑی غیرت آئی ، میں نے کہا آپ صلی اللہ علیہ وسلم قریش کی کس بوڑھی کا ذکر کیا کرتے ہیں جس کے مسوڑوں پر بھی دانتوں کے ٹوٹ جانے کی وجہ سے ( صرف سرخی باقی رہ گئی تھی ) اور جسے مرے ہوئے بھی ایک زمانہ گزر چکا ہے ، اللہ تعالیٰ نے آپ کو اس سے بہتر بیوی دے دی ہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 134560,
        "last_updated": null
    },
    {
        "urduURN": 4037810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3822,
        "hadithSanad": "ہم سے اسحاق واسطی نے بیان یا کہا ہم سے خالدنے بیان کیا ، ان سے بیان نے کہ میں نے قیس سے سنا ، انہوں نے بیان کیاکہ",
        "hadithText": "حضرت جریربن عبداللہ رضی اللہ عنہ نے فرمایا ، جب سے میں اسلام میں داخل ہوا رسول اللہ صلی اللہ علیہ وسلم نے مجھے ( گھرکے اندر آنے سے ) نہیں روکا ( جب بھی میں نے اجازت چاہی ) اور جب بھی آپ صلی اللہ علیہ وسلم مجھے دیکھتے تو مسکراتے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 134570,
        "last_updated": null
    },
    {
        "urduURN": 4037820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3823,
        "hadithSanad": "اور قیس سے روایت ہے کہ حضرت جریربن عبداللہ رضی اللہ عنہ نے فرمایا",
        "hadithText": "زمانہ جاہلیت میں ” ذوالخلصہ “ نامی ایک بت کدہ تھا اسے ” الکعبۃ الیمانیۃ یا الکعبۃ الشامیۃ “ بھی کہتے تھے ، آنحضرت صلی اللہ علیہ وسلم نے مجھ سے فرمایا ” ذی الخلصہ “ کے وجودسے میں جس اذیت میں مبتلا ہوں ، کیا تم مجھے اس سے نجات دلا سکتے ہو ؟ انہوں نے بیان کیا کہ پھر قبیلہ احمس کے ڈیڑھ سو سواروں کو میں لے کر چلا ، انہوں نے بیان کیا اور ہم نے بت کدے کو ڈھا دیا اور اس میں جو تھے ان کو قتل کر دیا ، پھر ہم آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آپ صلی اللہ علیہ وسلم کو خبر دی تو آپ صلی اللہ علیہ وسلم نے ہمارے لیے اور قبیلہ احمس کے لیے دعا فرمائی ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 134580,
        "last_updated": null
    },
    {
        "urduURN": 4037830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3824,
        "hadithSanad": "مجھ سے اسماعیل بن خلیل نے بیان کیا ، کہا ہم سے سلمہ بن رجاء نے ، انہیں ہشام بن عروہ نے ، انہیں ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "احدکی لڑائی میں جب مشرکین ہارچکے تو ابلیس نے چلا کر کہا اے اللہ کے بندو ! پیچھے والوں کو ( قتل کرو ) چنانچہ آگے کے مسلمان پیچھے والوں پر پل پڑے اور انہیں قتل کرنا شروع کر دیا ، حذیفہ رضی اللہ عنہ نے جو دیکھا تو ان کے والد ( یمان رضی اللہ عنہ بھی وہیں موجود تھے انہوں نے پکار کر کہا اے اللہ کے بندو یہ تو میرے والد ہیں میرے والد ! عائشہ رضی اللہ عنہا نے بیان کیا اللہ کی قسم ! اس وقت تک لوگ وہاں سے نہیں ہٹے جب تک انہیں قتل نہ کر لیا ، حذیفہ رضی اللہ عنہ نے صرف اتنا کہا اللہ تمہاری مغفرت کرے ، ( ہشام نے بیان کیا کہ ) اللہ کی قسم ! حذیفہ رضی اللہ عنہ برابر یہ کلمہ دعائیہ کہتے رہے ( کہ اللہ ان کے والد پر حملہ کرنے والوں کو بخشے جو کہ محض غلط فہمی کی وجہ سے یہ حرکت کربیٹھے ) یہ دعا مرتے دم تک کرتے رہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 134590,
        "last_updated": null
    },
    {
        "urduURN": 4037840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3825,
        "hadithSanad": "اور عبدان نے بیان کیا ، انہیں عبداللہ نے نے خبر دی انہیں یونس نے خبر دی ، انہیں زہری نے ، ان سے عروہ نے بیان کیا کہ",
        "hadithText": "حضرت عائشہ رضی اللہ عنہا نے بیان کیا ، حضرت ہند بنت عتبہ رضی اللہ عنہا رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں اسلام لانے کے بعد ) حاضر ہوئیں اور کہنے لگیں یا رسول اللہ ! روئے زمین پر کسی گھرانی کی ذلت آپ کی گھرانی کی ذلت سی زیادہ میرے لیے خوشی کا باعث نہیں تھی لیکن آج کسی گھرانے کی عزت روئے زمین پر آپ صلی اللہ علیہ وسلم کے گھر انے کی عزت سے زیادہ میرے لیے خوشی کی وجہ نہیں ہے ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا اس میں ابھی اور ترقی ہو گی اس ذات کی قسم ! جس کے ہاتھ میں میری جان ہے ، پھر ہند نے کہا یا رسول اللہ ! ابوسفیان بہت بخیل ہیں تو کیا اس میں کچھ حرج ہے اگر میں ان کے مال میں سے ( ان کی اجازت کے بغیر ) بال بچوں کو کھلا دیا اور پلا دیا کروں ؟ آپ صلی اللہ علیہ وسلم فرمایا ہاں لیکن میں سمجھتا ہوں کہ یہ دستورکے مطابق ہونا چاہئے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 134600,
        "last_updated": null
    },
    {
        "urduURN": 4037850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3826,
        "hadithSanad": "مجھ سے محمدبن ابی بکر نے بیان کیا ، کہا ہم سے فضیل بن سلیمان نے بیان کیا ، ان سے موسیٰ نے بیان کیا ، ان سے سالم بن عبداللہ نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی زیدبن عمرو بن نفیل رضی اللہ عنہ سے ( وادی ) بلدح کے نشیبی علاقہ میں ملاقات ہوئی ، یہ قصہ نزول وحی سے پہلے کا ہے ، پھرآنحضرت صلی اللہ علیہ وسلم کے سامنے ایک دسترخوان بچھایا گیا تو زید بن عمرو بن نفیل نے کھانے سے انکارکر دیا اور جن لوگوں نے دسترخوان بچھایا تھا ان سے کہا کہ اپنے بتوں کے نام پر جو تم ذبیحہ کرتے ہو میں اسے نہیں کھاتا میں تو بس وہی ذبیحہ کھایا کرتا ہوں جس پر صرف اللہ کا نام لیا گیا ہو ، زید بن عمرو قریش پر ان کے ذبیحے کے بارے میں عیب لگایا کرتے اور کہتے تھے کہ بکری کو پیدا تو کیا اللہ تعالیٰ نے ، ا سی نے اس کے لیے آسمان سے پانی برسایا ہے اسی نے اس کے لیے زمین سے گھاس اگائی ، پھر تم لوگ اللہ کے سوا دوسرے ( بتوں کے ) ناموں پر اسے ذبح کرتے ہو ۔ زید نے یہ کلمات ان کے ان کاموں پر اعتراض کرتے ہوئے اور ان کے اس عمل کو بہت بڑی غلطی قرار دیتے ہوئے کہے تھے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 134610,
        "last_updated": null
    },
    {
        "urduURN": 4037860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3827,
        "hadithSanad": "موسیٰ نے بیان کیا ، ان سے سالم بن عبداللہ نے بیان کیا اور مجھے یقین ہے کہ انہوں نے یہ ابن عمر رضی اللہ عنہماسے بیان کیا تھا کہ",
        "hadithText": "زید بن عمرو بن نفیل شام گئے ، دین ( خالص ) کی تلاش میں نکلے ، وہاں وہ ایک یہودی عالم سے ملے تو انہوں نے ان کے دین کے بارے میں پوچھا اور کہا ممکن ہے کہ میں تمہارا دین اختیارکر لوں ، اس لیے تم مجھے اپنے دین کے متعلق بتاو ، یہودی عالم نے کہا کہ ہمارے دین میں تم اس وقت تک داخل نہیں ہو سکتے جب تک تم اللہ کے غضب کے ایک حصہ کے لیے تیار نہ ہو جاؤ ، اس پر زیدرضی اللہ عنہ نے کہا کہ واہ میں اللہ کے غضب ہی سے بھاگ کر آیا ہوں ، پھر خدا کے غضب کو میں اپنے اوپرکبھی نہ لوں گا اور نہ مجھ کو اسے اٹھانے کی طاقت ہے ! کیا تم مجھے کسی اور دوسرے دین کا کچھ پتہ بتا سکتے ہو ؟ اس عالم نے کہا میں نہیں جانتا ( کوئی دین سچا ہو تو دین حنیف ہو ) زید رضی اللہ عنہ نے پوچھا دین حنیف کیا ہے ؟ اس عالم نے کہا کہ ابراہیم علیہ السلام کا دین جو نہ یہودی تھے اور نہ نصرانی اور وہ اللہ کے سوا کسی کی عبادت نہیں کرتے تھے ، زید وہاں سے چلے آئے اور ایک نصرانی پادری سے ملے ، ان سے بھی اپنا خیال بیان کیا اس نے بھی یہی کہا کہ تم ہمارے دین میں آو گے تو اللہ تعالیٰ کی لعنت میں سے ایک حصہ لو گے ، زیدرضی اللہ عنہ نے کہا میں اللہ کی لعنت سے ہی بچنے کے لیے تو یہ سب کچھ کر رہا ہوں ، اللہ کی لعنت اٹھانے کی مجھ میں طاقت نہیں اور نہ میں اس کا یہ غضب کس طرح اٹھا سکتا ہوں ! کیا تم میرے لیے اس کے سوا کوئی اور دین بتلا سکتے ہو ، پادری نے کہا کہ میری نظر میں ہو تو صرف ایک دین حنیف سچا دین ہے زیدنے پوچھا دین حنیف کیا ہے ؟ کہا کہ وہ دین ابراہیم علیہ السلام ہے جو نہ یہودی تھے اور نہ نصرانی اور اللہ کے سوا وہ کسی کی پوجا نہیں کرتے تھے ، زیدنے جب دین ابراہیم علیہ السلام کے بارے میں ان کی یہ رائے سنی تو وہاں سے روانہ ہو گئے ، اور اس سرزمین سے باہر نکل کر اپنے دونوں ہاتھ آسمان کی طرف اٹھائے اور یہ دعا کی ، اے اللہ ! میں گواہی دیتا ہوں کہ میں دین ابراہیم پر ہوں ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 134620,
        "last_updated": null
    },
    {
        "urduURN": 4037870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3828,
        "hadithSanad": "اورلیث بن سعدنے کہا کہ مجھے ہشام نے لکھا ، اپنے والد ( عروہ بن زبیر ) سے اور انہوں نے کہا کہ ہم سے حضرت اسماء بنت ابی بکر رضی اللہ عنہمانے بیان کیا کہ",
        "hadithText": "میں نے زیدبن عمرو بن نفیل کوکعبہ سے اپنی پیٹھ لگائے ہوئے کھڑے ہو کر یہ کہتے سنا ، اے قریش کے لوگو ! خدا کی قسم میرے سوا اور کوئی تمہارے یہاں دین ابراہیم پر نہیں ہے اور زید بیٹیوں کوزندہ نہیں گاڑتے تھے اور ایسے شخص سے جواپنی بیٹی کو مار ڈالنا چاہتاکہتے اس کی جان نہ لے اس کے تمام اخراجات کاذمہ میں لیتاہوں ، چنانچہ لڑکی کو اپنی پرورش میں رکھ لیتے جب وہ بڑی ہو جاتی تو اس کے باپ سے کہتے اب اگر تم چاہو تو میں تمہاری لڑکی کو تمہارے حوالے کرسکتاہوں اوراگرتمہاری مرضی ہو تو میں اس کے سب کام پورے کر دوں گا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 134630,
        "last_updated": null
    },
    {
        "urduURN": 4037880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3829,
        "hadithSanad": "مجھ سے محمود بن غیلان نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، کہا کہ مجھے ابن جریج نے خبر دی ، کہا کہ مجھے عمرو بن دینار نے خبر دی ، انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "جب کعبہ کی تعمیر ہو رہی تھی تو نبی کریم صلی اللہ علیہ وسلم اور حضرت عباس رضی اللہ عنہ اس کے لیے پتھر ڈھو رہے تھے حضرت عباس رضی اللہ عنہ نے آنحضرت صلی اللہ علیہ وسلم سے کہا اپنا تہبند گردن پر رکھ لو اس طرح پتھر کی ( خراش لگنے سے ) بچ جاؤ گے آپ صلی اللہ علیہ وسلم نے جب ایسا کیا آپ صلی اللہ علیہ وسلم زمین پر گر پڑے اور آپ کی نظر آسمان پر گڑگئی جب ہوش ہوا تو آپ نے چچا سے فرمایا میرا تہبند لاؤ پھر انہوں نے آپ کا تہبند خوب مضبوط باندھ دیا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 134640,
        "last_updated": null
    },
    {
        "urduURN": 4037890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3830,
        "hadithSanad": "ہم سے ابو النعمان نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے عمرو بن دینا ر نے اور عبیداللہ بن ابی زید نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے زمانے میں بیت اللہ کے گرد احاطہٰ کی دیوار نہ تھی لوگ کعبہ کے گرد نماز پڑھتے تھے پھر جب حضرت عمر رضی اللہ عنہ کا دور آیا تو انہوں نے اس کے گرد دیوار بنوائی ۔ عبیداللہ نے بیان کیا کہ یہ دیوار یں بھی پست تھیں عبداللہ بن زبیررضی اللہ عنہما نے ان کو بلند کیا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 134650,
        "last_updated": null
    },
    {
        "urduURN": 4037900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3831,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے یحییٰ قطان نے بیان کیا کہ مجھ سے میرے والد نے بیان کیا اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "عاشورا کا روزہ قریش کے لوگ زمانہ جاہلیت میں رکھتے تھے اور نبی کریم صلی اللہ علیہ وسلم نے بھی اسے باقی رکھا تھا ، جب آپ صلی اللہ علیہ وسلم مدینہ تشریف لائے تو آپ صلی اللہ علیہ وسلم نے خود بھی اس دن روزہ رکھا اور صحابہ رضی اللہ عنہم کو بھی روزہ رکھنے کا حکم دیا لیکن جب رمضان کا روزہ ۲ھ میں فرض ہوا تو اس کے بعد آپ نے حکم دیا کہ جس کا جی چاہے عاشورا کا روزہ رکھے اور جو نہ چاہے نہ رکھے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 134660,
        "last_updated": null
    },
    {
        "urduURN": 4037910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3832,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے وہیب نے بیان کیا ، کہا ہم سے عبداللہ بن طاؤس نے بیان کیا ، ان سے ان کے والدنے اور ان سے حضرت عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "زمانہ جاہلیت میں لوگ حج کے مہینوں میں عمرہ کرنا بہت بڑا گناہ خیال کرتے تھے ۔ وہ محرم کو صفر کہتے ۔ ان کے ہاں یہ مثل تھی کہ اونٹ کی پیٹھ کا زخم جب اچھا ہونے لگے اور ( حاجیوں کے ) نشانات قدم مٹ چکیں تو اب عمرہ کرنے والوں کا عمرہ جائز ہوا ۔ ابن عباس رضی اللہ عنہما نے بیان کیا کہ پھر رسول اللہ صلی اللہ علیہ وسلم اپنے اصحاب کے ساتھ ذی الحجہ کی چوتھی تاریخ کو حج کا احرام باندھے ہوئے ( مکہ ) تشریف لائے تو آپ نے صحابہ کو حکم دیا کہ اپنے حج کو عمرہ کر ڈالیں ( طواف اور سعی کر کے احرام کھول دیں ) صحابہ نے عرض کیا یا رسول اللہ ! ( اس عمرہ اور حج کے دوران میں ) کیا چیز یں حلال ہوں گی ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تمام چیزیں ! جو احرام کی نہ ہونے کی حالت میں حلال تھیں وہ سب حلال ہو جائیں گی ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 134670,
        "last_updated": null
    },
    {
        "urduURN": 4037920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3833,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے ، کہا کہ عمرو بن دینار بیان کیا کرتے تھے کہ ہم سے سعید بن مسیب نے اپنے والد سے بیان کیا ، انہوں نے سعید کے داداحزن سے بیان کیاکہ",
        "hadithText": "زمانہ جاہلیت میں ایک مرتبہ سیلاب آیا کہ ( مکہ کی ) دونوں پہاڑیوں کے درمیان پانی ہی پانی ہو گیا سفیان نے بیان کیا کہ بیان کرتے تھے کہ اس حدیث کا ایک بہت بڑا قصہ ہے</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 134680,
        "last_updated": null
    },
    {
        "urduURN": 4037930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3834,
        "hadithSanad": "ہم سے ابو النعمان نے بیان کیا ، کہا ہم سے ابو عوانہ نے بیان کیا ، ان سے ابو بشر نے اور ان سے قیس بن ابی حازم نے بیان کیا کہ",
        "hadithText": "ابوبکر رضی اللہ عنہ قبیلہ احمس کی ایک عورت سے ملے ان کا نام زینب بنت مہاجر تھا ، آپ رضی اللہ عنہ نے دیکھا کہ وہ بات ہی نہیں کر تیں دریافت فرمایا کیا بات ہے یہ بات کیوں نہیں کرتیں ؟ لوگوں نے بتایا کہ مکمل خاموشی کے ساتھ حج کرنے کی منت مانی ہے ۔ ابوبکر رضی اللہ عنہ نے ان سے فرمایا اجی بات کرو اس طرح حج کر نا تو جاہلیت کی رسم ہے ، چنانچہ اس نے بات کی اور پوچھا آپ کون ہیں ؟ حضرت ابوبکر رضی اللہ عنہ نے کہا کہ میں مہاجرین کا ایک آدمی ہوں ۔ انہوں نے پوچھا کہ مہاجرین کے کس قبیلہ سے ہیں ؟ آپ نے فرمایا کہ قریش سے ، انہوں نے پوچھا قریش کے کس خاندان سے ؟ حضرت ابوبکر رضی اللہ عنہ نے اس پر فرمایا تم بہت پوچھنے والی عورت ہو ، میں ابوبکر ہوں ۔ اس کے بعد انہوں نے پوچھا جاہلیت کے بعد اللہ تعالیٰ نے جو ہمیں یہ دین حق عطافرمایا ہے اس پر ہم ( مسلمان ) کب تک قائم رہ سکیں گے ؟ آپ رضی اللہ عنہ نے فرمایا اس پر تمہار ا قیام اس وقت تک رہے گا جب تک تمہار ے امام حاکم سید ھے رہیں گے ۔ اس خاتون نے پوچھا امام سے کیا مراد ہے آپ نے فرمایا کیا تمہاری قوم میں سردار اور اشراف لوگ نہیں ہیں جو اگر لوگوں کو کوئی حکم دیں تو وہ اس کی اطاعت کریں ؟ اس نے کہا کہ کیوں نہیں ہیں ۔ ابوبکر رضی اللہ عنہ نے کہا کہ امام سے یہی مراد ہیں ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 134690,
        "last_updated": null
    },
    {
        "urduURN": 4037940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3835,
        "hadithSanad": "مجھ سے فروہ بن ابی المغراء نے بیان کیا ، کہا ہم کو علی بن مسہر نے خبر دی ، انہیں ہشام نے ، انہیں ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "ایک کالی عورت جو کسی عرب کی باندی تھی ، اسلام لائی اور مسجد میں اس کے رہنے کے لیے ایک کوٹھری تھی ۔ حضرت عائشہ رضی اللہ عنہا نے بیان کیا وہ ہما رے یہاں آیا کرتی اور باتیں کیا کرتی تھی ، لیکن جب باتوں سے فارغ ہو جاتی تو وہ یہ شعر پڑھتی ” اور ہار والا دن بھی ہمارے رب کے عجائب قدرت میں سے ہے ، کہ اسی نے ( بفضلہ ) کفر کے شہر سے مجھے چھڑایا ۔ “ اس نے جب کئی مرتبہ یہ شعر پڑھا توعائشہ رضی اللہ عنہا نے اس سے دریافت کیا کہ ہار والے دن کاقصہ کیا ہے ؟ اس نے بیان کیا کہ میرے مالکوں کے گھر انے کی ایک لڑکی ( جو نئی دولہن تھی ) لال چمڑے کا ایک ہار باندھے ہوئے تھی ۔ وہ باہر نکلی تو اتفاق سے وہ گر گیا ۔ ایک چیل کی اس پر نظر پڑی اور وہ اسے گوشت سمجھ کر اٹھا لے گئی ۔ لوگوں نے مجھ پر اس کی چوری کی تہمت لگائی اور مجھے سزائیں دینی شروع کیں ۔ یہاں تک کہ میری شرمگاہ کی بھی تلاشی لی ۔ خیر وہ ابھی میرے چاروں طرف جمع ہی تھے اور میں اپنی مصیبت میں مبتلا تھی کہ چیل آئی اور ہمارے سروں کے با لکل اوپر اڑنے لگی ۔ پھر اس نے وہی ہار نیچے گرا دیا ۔ لوگوں نے اسے اٹھا لیا تو میں نے ان سے کہا اسی کے لیے تم لوگ مجھے اتہام لگا رہے تھے حالانکہ میں بےگناہ تھی ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 134700,
        "last_updated": null
    },
    {
        "urduURN": 4037950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3836,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے عبداللہ بن دینار نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ہاں ! اگر کسی کو قسم کھانی ہی ہو تو اللہ کے سوا اور کسی کی قسم نہ کھائے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 134710,
        "last_updated": null
    },
    {
        "urduURN": 4037960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3837,
        "hadithSanad": "مجھ سے یحییٰ بن سلیمان نے بیان کیا ، کہامجھ سے عبداللہ بن وہب نے بیان کیا کہ مجھے عمرو بن حارث نے خبر دی ، ان سے عبدالرحمٰن بن قاسم نے بیان کیا کہ",
        "hadithText": "ان کے والدقاسم بن محمد جنازہ کے آگے آگے چلاکرتے تھے اور جنازہ کو دیکھ کر کھڑے نہیں ہوتے تھے ۔ حضرت عائشہ رضی اللہ عنہا کے حوالے سے وہ بیان کرتے تھے کہ زمانہ جاہلیت میں لوگ جنازہ کے لئے کھڑے ہو جایا کرتے تھے اور اسے دیکھ کر دوبارکہتے تھے کہ ، اے مرنے والے جس طرح اپنی زندگی میں تو اپنے گھر والوں کے ساتھ تھا اب ویسا ہی کسی پرندے کے بھیس میں ہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 134720,
        "last_updated": null
    },
    {
        "urduURN": 4037970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3838,
        "hadithSanad": "مجھ سے عمرو بن عباس نے بیان کیا ، انہوں نے کہا ہم سے عبدالرحمٰن نے بیان کیا ، انہوں نے کہا ہم سے سفیان نے بیان کیا ، ان سے ابواسحاق نے بیان کیا ، ان سے عمرو بن میمون نے بیان کیا کہ",
        "hadithText": "حضرت عمر رضی اللہ عنہ نے کہا جب تک دھوپ ثبیر پہاڑی پر نہ آجاتی قریش ( حج میں ) مزدلفہ سے نہیں نکلا کرتے تھے ۔ نبی کریم صلی اللہ علیہ وسلم نے ان کی مخالفت کی اور سورج نکلنے سے پہلے آپ صلی اللہ علیہ وسلم نے وہاں سے کوچ کیا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 134730,
        "last_updated": null
    },
    {
        "urduURN": 4037980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3839,
        "hadithSanad": "مجھ سے اسحاق بن ابراہیم نے بیان کیا ، کہا کہ میں نے ابواسامہ سے پوچھا ، کیا تم لوگوں سے یحییٰ بن مہلب نے یہ حدیث بیان کی تھی کہ ان سے حصین نے بیان کیا ، ان سے عکرمہ نے ( قرآن مجید کی آیت میں ) کے متعلق فرمایا کہ",
        "hadithText": "اس کے ( معنی ٰ ہیں ) بھرا ہوا پیالہ جس کا مسلسل دور چلے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 134740,
        "last_updated": null
    },
    {
        "urduURN": 4037990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3840,
        "hadithSanad": "عکرمہ نے بیان کیا اور حضرت عبداللہ بن عباس رضی اللہ عنہما نے",
        "hadithText": "بیان کیا کہ میں نے اپنے والد سے سنا ، وہ کہتے تھے کہ زمانہ جاہلیت میں ( یہ لفظ استعمال کرتے تھے ) ’ ’اسقنا کاسا دھاقا “ یعنی ہم کو بھرپور جام شراب پلاتے رہو ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 134750,
        "last_updated": null
    },
    {
        "urduURN": 4038000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3841,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے سفیا ن نے بیان کیا ، ان سے عبدالملک نے ، ان سے ابوسلمہ نے ، ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا سب سے سچی بات جو کوئی شاعر کہہ سکتا تھا وہ لبید شاعر نے کہی ” ہا ں اللہ کے سوا ہرچیز باطل ہے “ اور امیہ بن ابی الصلٹ ( جاہلیت کا ایک شاعر ) مسلمان ہونے کے قریب تھا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 134760,
        "last_updated": null
    },
    {
        "urduURN": 4038010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3842,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، کہا مجھ سے میرے بھائی نے بیان کیا ، ان سے سلیمان نے ، ان سے یحییٰ بن سعید نے ، ان سے عبدالرحمٰن بن قاسم نے ، ان سے قاسم بن محمد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "حضرت ابوبکر رضی اللہ عنہ کا ایک غلام تھا جو روزانہ انہیں کچھ کمائی دیا کرتا تھا اور حضرت ابوبکر رضی اللہ عنہ اسے اپنی ضرورت میں استعمال کیا کرتے تھے ۔ ایک دن وہ غلام کوئی چیز لایا اورحضر ت ابوبکر رضی اللہ عنہ نے بھی اس میں سے کھا لیا ۔ پھر غلام نے کہا آپ کو معلوم ہے ؟ یہ کیسی کمائی سے ہے ؟ آپ نے دریافت فرمایا کیسی ہے ؟ اس نے کہا میں نے زمانہ جاہلیت میں ایک شحص کے لیے کہا نت کی تھی حالانکہ مجھے کہانت نہیں آتی تھی ، میں نے اسے صرف دھوکہ دیا تھالیکن اتفاق سے وہ مجھے مل گیا اور اس نے اس کی اجرت میں مجھ کو یہ چیز دی تھی ، آپ کھا بھی چکے ہیں ۔ حضرت ابوبکر رضی اللہ عنہ نے یہ سنتے ہی اپنا ہاتھ منہ میں ڈالا اور پیٹ کی تمام چیزیں قے کر کے نکال ڈالیں ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 134770,
        "last_updated": null
    },
    {
        "urduURN": 4038020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3843,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے عبیداللہ نے کہا ، مجھ کو نافع نے خبر دی اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "زمانہ جاہلیت کے لوگ ” حبل الحبلہ “ تک قیمت کی ادائیگی کے وعدہ پر ، اونٹ کا گوشت ادھار بیچا کرتے تھے عبداللہ رضی اللہ عنہ نے بیان کیا کہ حبل الحبلۃ کا مطلب یہ ہے کہ کوئی حاملہ اوٹنی اپنا بچہ جنے پھر وہ نوزائیدہ بچہ ( بڑھ کر ) حاملہ ہو ، نبی کریم صلی اللہ علیہ وسلم نے اس طرح کی خریدوفروخت ممنوع قرار دے دی تھی ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 134780,
        "last_updated": null
    },
    {
        "urduURN": 4038030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3844,
        "hadithSanad": "ہم سے ابو النعمان نے بیان کیا ، انہوں نے کہا ہم سے مہدی نے بیان کیا انہوں نے کہا کہ غیلان بن جریر نے بیان کیا کہ",
        "hadithText": "ہم انس بن مالک رضی اللہ عنہ کی خدمت میں حاضر ہوتے تھے ۔ وہ ہم سے انصار کے متعلق بیان فرمایا کرتے تھے اور مجھ سے فرما تے کہ تمہاری قوم نے فلاں موقع پر یہ کا رنامہ انجام دیا ، فلاں موقع پر یہ کارنامہ انجام دیا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 134790,
        "last_updated": null
    },
    {
        "urduURN": 4038040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3845,
        "hadithSanad": "ہم سے ابو معمر نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، کہا ہم سے قطن ابو الہیثم نے کہا ، ہم سے ابو یزید مدنی نے ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا",
        "hadithText": "جاہلیت میں سب سے پہلا قسامہ ہمارے ہی قبیلہ بنو ہاشم میں ہوا تھا ، بنوہاشم کے ایک شخص عمرو بن علقمہ کو قریش کے کسی دوسرے خاندان کے ایک شخص ( خداش بن عبداللہ عامری ) نے نوکری پر رکھا ، اب یہ ہاشمی نوکراپنے صاحب کے ساتھ اس کے اونٹ لے کر شام کی طرف چلا ، وہاں کہیں اس نوکر کے پاس سے ایک دوسرا ہاشمی شخص گزرا ، اس کی بوری کا بندھن ٹوٹ گیا تھا ۔ اس نے اپنے نو کر بھائی سے التجا کی میری مدد کراونٹ باندھنے کی مجھے ایک رسی دیدے ، میں اس سے اپنا تھیلا باندھوں اگر رسی نہ ہو گی تو وہ بھاگ تھوڑے جائے گا ۔ اس نے ایک رسی اسے دے دی اور اس نے اپنی بوری کا منہ اس سے باندھ لیا ( اور چلا گیا ) ۔ پھر جب اس نوکر اور صاحب نے ایک منزل پر پڑاؤ کیا تو تمام اونٹ باندھے گئے لیکن ایک اونٹ کھلا رہا ۔ جس صاحب نے ہاشمی کو نوکری پر اپنے ساتھ رکھاتھا اس نے پو چھا سب اونٹ تو باندھے ، یہ اونٹ کیوں نہیں باندھا گیا کیا بات ہے ؟ نوکرنے کہا اس کی رسی موجود نہیں ہے ۔ صاحب نے پوچھا کیا ہوئی اس کی رسی ؟ اور غصہ میں آ کر ایک لکڑی اس پر پھینک ماری اس کی موت آن پہنچی ۔ اس کے ( مرنے سے پہلے ) وہاں سے ایک یمنی شخص گذر رہا تھا ۔ ہاشمی نوکرنے پوچھا کیا حج کے لیے ہر سال تم مکہ جاتے ہو ؟ اس نے کہا ابھی تو ارادہ نہیں ہے لیکن میں کبھی جاتا رہتا ہوں ۔ اس نوکرنے کہا جب بھی تم مکہ پہنچوکیا میرا ایک پیغام پہنچادوگے ؟ اس نے کہا ہاں پہنچا دوں گا ۔ اس نوکرنے کہا کہ جب بھی تم حج کے لیے جاؤ تو پکار نا اے قریش کے لوگو ! جب وہ تمہارے پاس جمع ہو جائیں تو پکارنا اے بنی ہاشم ! جب وہ تمہارے پاس آ جائیں تو ان سے ابوطالب پو چھنا اور انہیں بتلانا کہ فلاں شخص نے مجھے ایک رسی کے لیے قتل کر دیا ۔ اس وصیت کے بعد وہ نوکر مرگیا ، پھر جب اس کا صاحب مکہ آیا تو ابوطالب کے یہا ں بھی گیا ۔ جناب ابوطالب نے دریافت کیا ہمارے قبیلہ کے جس شخص کو تم اپنے ساتھ نوکری کے لیے لے گئے تھے اس کا کیا ہوا ؟ اس نے کہا کہ وہ بیمار ہو گیا تھا میں نے خدمت کرنے میں کوئی کسر نہیں اٹھا رکھی ( لیکن وہ مرگیاتو ) میں نے اسے دفن کر دیا ۔ ابوطالب نے کہا کہ اس کے لیے تمہاری طر ف سے یہی ہونا چاہئے تھا ۔ ایک مدت کے بعد وہی یمنی شخص جسے ہاشمی نوکرنے پیغام پہنچانے کی وصیت کی تھی ، موسم حج میں آیا اور آواز دی اے قریش کے لوگو ! لوگوں نے بتا دیا کہ یہاں ہیں قریش ۱س نے آواز دی اے بنو ہاشم ! لوگو ں نے بتایا کہ بنوہاشم یہ ہیں اس نے پوچھاابوطالب کہاں ہیں ؟ لوگوں نے بتایا تو اس نے کہا کہ فلاں شخص نے مجھے ایک پیغام پہنچانے کے لیے کہا تھا کہ فلاں شخص نے اسے ایک رسی کی وجہ سے قتل کر دیا ہے ۔ اب جناب ابوطالب اس صاحب کے یہا ں آئے اور کہا کہ ان تین چیزوں میں سے کوئی چیز پسند کر لو اگر تم چاہو تو سو اونٹ دیت میں دے دو کیونکہ تم نے ہمارے قبیلہ کے آدمی کو قتل کیا ہے اور اگر چاہو تو تمہاری قو م کے پچاس آ دمی اس کی قسم کھالیں کہ تم نے اسے قتل نہیں کیا ۔ اگر تم اس پر تیار نہیں تو ہم تمہیں اس کے بدلے میں قتل کر دیں گے ۔ وہ شخص اپنی قوم کے پاس آیا تو وہ اس کے لیے تیار ہو گئے کہ ہم قسم کھا لیں گے ۔ پھر بنو ہاشم کی ایک عورت ابوطالب کے پاس آئی جو اسی قبیلہ کے ایک شخص سے بیاہی ہوئی تھی اور اپنے اس شوہر سے اس کا بچہ بھی تھا ۔ اس نے کہا اے ابوطالب ! آپ مہر بانی کریں اور میرے اس لڑکے کو ان پچاس آدمیوں میں معاف کر دیں اور جہاں قسمیں لی جاتی ہیں ( یعنی رکن اور مقام ابراہیم کے درمیان ) اس سے وہا ں قسم نہ لیں ۔ حضرت ابوطالب نے اسے معاف کر دیا ۔ اس کے بعد ان میں کا ایک اورشخص آیا اور کہا اے ابوطالب ! آپ نے سو اونٹوں کی جگہ پچاس آدمیوں سے قسم طلب کی ہے ، اس طرح ہر شخص پر دو دو اونٹ پڑ تے ہیں ۔ یہ دواونٹ میری طرف سے آپ قبول کر لیں اور مجھے اس مقام پر قسم کھا نے کے لیے مجبور نہ کریں جہاں قسم لی جاتی ہے ۔ حضرت ابوطالب نے اسے بھی منظور کر لیا ۔ اس کے بعد بقیہ جو اڑتالیس آدمی آئے اور انہوں نے قسم کھائی ، ابن عباس رضی اللہ عنہما نے کہا اس ذات کی قسم ! جس کے ہاتھ میں میری جان ہے ابھی اس واقعہ کو پورا سال بھی نہیں گذرا تھا کہ ان اڑتالیس آدمیوں میں سے ایک بھی ایسا نہیں رہا جو آنکھ ہلاتا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 134800,
        "last_updated": null
    },
    {
        "urduURN": 4038050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3846,
        "hadithSanad": "مجھ سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "بعاث کی لڑائی اللہ تعالیٰ نے ( مصلحت کی وجہ سے ) رسول اللہ صلی اللہ علیہ وسلم سے پہلے برپاکرادی تھی ، آنحضرت صلی اللہ علیہ وسلم جب مدینہ تشریف لائے تو یہاں انصار کی جماعت میں پھوٹ پڑ ی ہوئی تھی ۔ ان کے سردار مارے جا چکے تھے یا زخمی ہو چکے تھے ، اللہ تعالیٰ نے اس لڑائی کو اس لیے پہلے برپاکیا تھا کہ انصار اسلام میں داخل ہو جائیں ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 134810,
        "last_updated": null
    },
    {
        "urduURN": 4038060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3847,
        "hadithSanad": "اور عبداللہ بن وہب نے بیان کیا ، انہیں عمرو نے خبر دی ، انہیں بکیر بن اشج نے اور عبداللہ بن عباس رضی اللہ عنہما کے مولا کریب نے ان سے بیان کیا کہ",
        "hadithText": "عبد للہ بن عباس رضی اللہ عنہما نے بتایا صفا اور مروہ کے درمیان نالے کے اندر زور سے دوڑنا سنت نہیں ہے یہا ں جاہلیت کے دور میں لوگ تیزی کے ساتھ دوڑا کرتے تھے اور کہتے تھے کہ ہم تو اس پتھریلی جگہ سے دوڑ ہی کر پار ہوں گے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 134820,
        "last_updated": null
    },
    {
        "urduURN": 4038070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3848,
        "hadithSanad": "ہم سے عبداللہ بن محمد جعفی نے بیان کیا ، انہوں نے کہا ہم سے سفیان نے بیان کیا ، انہوں نے کہا ہم کو مطرف نے خبر دی ، کہا میں نے ابو السفرسے سنا ، وہ بیان کرتے تھے کہ",
        "hadithText": "میں نے عبداللہ بن عباس رضی اللہ عنہما سے سنا انہوں نے کہا اے لوگو ! میری باتیں سنوکہ میں تم سے بیان کرتا ہوں اور ( جو کچھ تم نے سمجھاہے ) وہ مجھے سناؤ ۔ ایسا نہ ہو کہ تم لوگ یہا ں سے اٹھ کر ( بغیر سمجھے ) چلے جاؤ اور پھر کہنے لگو کہ ابن عباس رضی اللہ عنہما نے یوں کہا اور ابن عباس رضی اللہ عنہما نے یوں کہا ۔ جو شخص بھی بیت اللہ کا طواف کرے تو وہ حطیم کے پیچھے سے طواف کرے اور حجر کو حطیم نہ کہا کرو یہ جاہلیت کا نام ہے اس وقت لوگوں میں جب کوئی کسی بات کی قسم کھا تا تو اپنا کوڑا ، جوتا یا کمان وہاں پھینک دیتا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 134830,
        "last_updated": null
    },
    {
        "urduURN": 4038080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3849,
        "hadithSanad": "ہم سے نعیم بن حماد نے بیان کیا ، کہا ہم سے ہشام نے بیان کیا ، ان سے حصین نے ، ان سے عمرو بن میمون نے بیان کیا کہ",
        "hadithText": "میں نے زمانہ جاہلیت میں ایک بندر یا دیکھی اس کے چاروں طرف بہت سے بندر جمع ہو گئے تھے ، اس بندریا نے زنا کرایا تھا اس لیے سبھوں نے مل کر اسے رجم کیا اور ان کے ساتھ میں بھی پتھر مارنے میں شریک ہوا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 134840,
        "last_updated": null
    },
    {
        "urduURN": 4038090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3850,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے عبیداللہ نے اور انہوں نے حضرت عبداللہ بن عباس رضی اللہ عنہما سے سنا ، انہوں نے کہا کہ",
        "hadithText": "جاہلیت کی عادتوں میں سے یہ عادتیں ہیں نسب کے معاملہ میں طعنہ مارنا اور میت پر نوحہ کرنا ، تیسری عادت کے متعلق ( عبیداللہ راوی ) بھول گئے تھے اور سفیا ن نے بیان کیا کہ لوگ کہتے ہیں کہ وہ تیسری بات ستاروں کو بارش کی علت سمجھناہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 134850,
        "last_updated": null
    },
    {
        "urduURN": 4038100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3851,
        "hadithSanad": "ہم سے احمد بن ابی رجاء نے بیان کیا ، کہا ہم سے نضر نے بیان کیا ، کہا ان سے ہشام نے ، ان سے عکرمہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "جب رسول اللہ صلی اللہ علیہ وسلم کی عمرچالیس سال کی ہوئی تو آپ صلی اللہ علیہ وسلم پر وحی نازل ہوئی ، اس کے بعد آنحضرت صلی اللہ علیہ وسلم تیرہ سال مکہ مکرمہ میں رہے پھر آپ صلی اللہ علیہ وسلم کو ہجرت کا حکم ہوا او آپ صلی اللہ علیہ وسلم مدینہ منور ہ ہجرت کر کے چلے گئے ، وہاں دس سال رہے پھر آپ نے وفات فرمائی ( صلی اللہ علیہ وسلم ) اس حسا ب سے کل عمر شریف آپ کی تریسٹھ سال ہوتی ہے اور یہی صحیح ہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 134860,
        "last_updated": null
    },
    {
        "urduURN": 4038110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3852,
        "hadithSanad": "ہم سے حمیدی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا ہم سے بیان بن بشر اور اسماعیل بن ابوخالد نے بیان کیا ، کہا کہ ہم نے قیس بن ابوحازم سے سنا وہ بیان کرتے تھے کہ میں نے خباب بن ارت سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آپ صلی اللہ علیہ وسلم کعبہ کے سائے تلے چادر مبارک پر ٹیک لگائے بیٹھے تھے ۔ ہم لوگ مشرکین سے انتہائی تکالیف اٹھا رہے تھے ۔ میں نے عرض کیا یا رسول اللہ ! اللہ تعالیٰ سے آپ صلی اللہ علیہ وسلم دعاکیوں نہیں فرماتے ؟ اس پر آپ صلی اللہ علیہ وسلم سیدھے بیٹھ گئے ۔ چہرہ مبارک غصہ سے سرخ ہو گیا اور فرمایا تم سے پہلے ایسے لوگ گذر چکے ہیں کہ لوہے کے کنگھوں کو ان کے گوشت اورپٹھوں سے گذار کر ان کی ہڈیوں تک پہنچا دیا گیا اور یہ معاملہ بھی انہیں ان کے دین سے نہ پھیر سکا ، کسی کے سر پر آرا رکھ کر اس کے دو ٹکڑے کر دئیے گئے اور یہ بھی انہیں ان کے دین سے نہ پھیر سکا ، اس دین اسلام کو تو اللہ تعالیٰ خود ہی ایک دن تمام وکمال تک پہنچائے گا کہ ایک سوار صنعاء سے حضرموت تک ( تنہا ) جائے گا اور ( راستے ) میں اسے اللہ کے سوا اور کسی کا خوف تک نہ ہو گا ۔ بیان نے اپنی روایت میں یہ زیادہ کیا کہ ” سوائے بھیڑیئے کے کہ اس سے اپنی بکریوں کے معاملہ میں اسے ڈرہو گا ۔ “</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 134870,
        "last_updated": null
    },
    {
        "urduURN": 4038120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3853,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعیب نے بیان کیا ، ان سے ابواسحاق نے ، ان سے اسودنے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے سورۃ النجم پڑھی اور سجدہ کیا اس وقت آپ صلی اللہ علیہ وسلم کے ساتھ تمام لوگوں نے سجدہ کیا صرف ایک شخص کو میں نے دیکھا کہ اپنے ہاتھ میں اس نے کنکریاں اٹھا کر اس پر اپنا سر رکھ دیا اور کہنے لگا کہ میرے لیے بس اتنا ہی کا فی ہے ۔ میں نے پھر اسے دیکھا کہ کفر کی حالت میں وہ قتل کیا گیا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 134880,
        "last_updated": null
    },
    {
        "urduURN": 4038130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3854,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے ، ان سے ابواسحاق نے ، ان سے عمرو بن میمون نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ( نماز پڑھتے ہوئے ) سجدہ کی حالت میں تھے ، قریش کے کچھ لوگ وہیں اردگرد موجود تھے ۔ اتنے میں عقبہ بن ابی معیط اونٹ کی اوجھڑی بچہ دان لایا اور حضور اکرم صلی اللہ علیہ وسلم کی پیٹھ مبارک پر اسے ڈال دیا ۔ اس کی وجہ سے آپ صلی اللہ علیہ وسلم نے اپنا سر نہیں اٹھایا پھر فاطمہ رضی اللہ عنہا آئیں اور گندگی کو پیٹھ مبارک سے ہٹایا اور جس نے ایسا کیا تھا اسے بددعا دیں ۔ حضور صلی اللہ علیہ وسلم نے بھی ان کے حق میں بددعا کی کہ اے اللہ ! قریش کی اس جماعت کو پکڑلے ۔ ابوجہل بن ہشام ، عتبہ بن ربیعہ ، شیبہ بن ربیعہ اور امیہ بن خلف یا ( امیہ کے بجائے آپ نے بددعا ) ابی بن خلف ( کے حق میں فرمائی ) شبہ راوی حدیث شعبہ کو تھا ۔ عبداللہ بن مسعود رضی اللہ عنہما نے کہا کہ پھر میں نے دیکھا کہ بدرکی لڑائی میں یہ سب لوگ قتل کر دئیے گئے اور ایک کنویں میں ا نہیں ڈال دیا گیا تھاسوائے امیہ یا ابی کے کہ اس کاہر ایک جوڑ الگ الگ ہو گیا تھا اس لئے کنویں میں نہیں ڈالا جا سکا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 134890,
        "last_updated": null
    },
    {
        "urduURN": 4038140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3855,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے منصور نے ، کہا مجھ سے سعید بن جبیر نے بیان کیا یا ( منصور نے ) اس طرح بیان کیا کہ مجھ سے حکم نے بیان کیا ، ان سے سعید بن جبیر نے بیان کیا کہ مجھ سے عبدالرحمٰن بن ابزیٰ رضی اللہ عنہ نے کہا کہ",
        "hadithText": "حضرت ابن عباس رضی اللہ عنہما سے ان دونوں آیتو ں کے متعلق پوچھو کہ ان میں مطابقت کس طرح پیدا کی جائے ( ایک آیت ولا تقتلوا النفس التي حرم الله الا بالحق اور دوسری آیت ومن يقتل مؤمنا متعمدا‏ ہے ابن عباس رضی اللہ عنہما سے میں نے پوچھا تو انہوں نے بتلایا کہ جب سورۃ الفرقا ن کی آیت نازل ہوئی تو مشرکین مکہ نے کہا ہم نے تو ان جانوں کا بھی خون کیا ہے جن کے قتل کو اللہ تعالیٰ نے حرام قرار دیا تھا ہم اللہ کے سوا دوسرے معبودوں کی عبادت بھی کرتے رہے ہیں اور بدکاریوں کا بھی ہم نے ارتکاب کیا ہے ۔ اس پر اللہ تعالیٰ نے آیت نازل فرمائی ” إلا من تاب وآمن‏ “ ( وہ لوگ اس حکم سے الگ ہیں جو توبہ کر لیں اور ایمان لے آ ئیں ) تو یہ آیت ان کے حق میں نہیں ہے لیکن سورۃ النساء کی آیت اس شخص کے بارے میں ہے جو اسلام اور شرائع اسلام کے احکام جان کر بھی کسی کو قتل کرے تو اس کی سزاجہنم ہے ، میں نے عبداللہ بن عباس رضی اللہ عنہما کے اس ارشاد کا ذکر مجاہد سے کیا تو انہوں نے کہا کہ وہ لوگ اس حکم سے الگ ہیں جو توبہ کر لیں ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 134900,
        "last_updated": null
    },
    {
        "urduURN": 4038150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3856,
        "hadithSanad": "ہم سے عیاش بن ولید نے بیان کیا ، کہا ہم سے ولید بن مسلم نے بیان کیا ، کہا مجھ سے اوزاعی نے بیان کیا ، ان سے یحییٰ بن ابی کثیر نے بیان کیا ، ان سے محمد بن ابراہیم تیمی نے بیان کیا کہ مجھ سے عروہ بن زبیر نے بیان کیا کہ میں نے عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے پوچھاکہ",
        "hadithText": "مجھے مشرکیں کے سب سے سخت ظلم کے متعلق بتاؤ جو مشرکین نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ کیا تھا ۔ انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم حطیم میں نماز پڑھ رہے تھے کہ عقبہ بن ابی معیط آیا اور ظالم اپنا کپڑا حضور اکرم صلی اللہ علیہ وسلم کی گردن مبارک میں پھنسا کر زور سے آپ صلی اللہ علیہ وسلم کا گلا گھونٹنے لگا اتنے میں حضرت ابوبکر صدیق رضی اللہ عنہ آ گئے اور انہوں نے اس بدبخت کا کندھا پکڑ کر آنحضرت صلی اللہ علیہ وسلم کے پاس سے اسے ہٹا دیا اور کہا کہ تم لوگ ایک شخص کو صرف اس لئے مار ڈالنا چاہتے ہو کہ وہ کہتا ہے کہ میرا رب اللہ ہے الآیۃ عیاش بن ولید کے ساتھ اس روایت کی متابعت ابن اسحاق نے کی ( اور بیان کیا کہ ) مجھ سے یحییٰ بن عروہ نے بیان کیا اور ان سے عروہ نے کہ میں نے حضرت عبداللہ بن عمرو رضی اللہ عنہما سے پوچھا اور عبدہ نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد نے کہ حضرت عمرو بن عاص رضی اللہ عنہ سے کہا گیا اور محمد بن عمرو نے بیان کیا ، ان سے ابوسلمہ نے ، اس میں یوں ہے کہ مجھ سے حضرت عمرو بن عاص رضی اللہ عنہ نے بیان کیا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 134910,
        "last_updated": null
    },
    {
        "urduURN": 4038160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3857,
        "hadithSanad": "مجھ سے عبداللہ بن حماد آملی نے بیان کیا ، کہا کہ مجھ سے یحییٰ بن معین نے بیان کیا ، کہا ہم سے اسماعیل بن مجالد نے بیان کیا ، ان سے بیان نے ، ان سے وبرہ نے ان سے ہمام بن حارث نے بیان کیا کہ عمار بن یاسر رضی اللہ عنہما نے کہا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو اس حالت میں بھی دیکھا ہے جب آنحضرت صلی اللہ علیہ وسلم کے ساتھ پانچ غلام ، دو عورتوں اور ابوبکر صدیق رضی اللہ عنہم کے سوا اور کوئی ( مسلمان ) نہیں تھا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 134920,
        "last_updated": null
    },
    {
        "urduURN": 4038170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3858,
        "hadithSanad": "مجھ سے اسحاق بن ابراہیم مروزی نے بیان کیا ، انہوں نے کہا ہم کو ابواسامہ نے خبر دی ، انہوں نے کہا ہم سے ہاشم بن ہاشم نے بیان کیا ، کہا کہ میں نے سعد بن مسیب سے سنا ، کہا کہ میں نے ابواسحاق سعد بن ابی وقاص رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "جس دن میں اسلام لایا ہوں دوسرے لوگ بھی اسی دن اسلام لائے اور اسلام میں داخل ہونے والے تیسرے آدمی کی حیثیت سے مجھ پر سات دن گزرے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 134930,
        "last_updated": null
    },
    {
        "urduURN": 4038180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3859,
        "hadithSanad": "مجھ سے عبیداللہ بن سعید نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، کہا ہم سے مسعر نے بیان کیا ، ان سے معن بن عبدالرحمٰن نے بیان کیا ، کہا کہ میں نے اپنے والد سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نے مسروق سے پوچھا کہ جس رات میں جنوں نے قرآن مجید سنا تھا اس کی خبر نبی کریم صلی اللہ علیہ وسلم کو کس نے دی تھی ؟ مسروق نے کہا کہ مجھ سے تمہارے والد عبداللہ بن مسعودرضی اللہ عنہ نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم کو جنوں کی خبر ایک ببول کے درخت نے دی تھی ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 134940,
        "last_updated": null
    },
    {
        "urduURN": 4038190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3860,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے عمرو بن یحییٰ بن سعید نے بیان کیا ، انہوں نے کہا کہ مجھے میرے دادا نے خبر دی اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "وہ رسول اللہ صلی اللہ علیہ وسلم کے وضو اور قضائے حاجت کے لئے ( پانی کا ) ایک برتن لئے ہوئے آپ صلی اللہ علیہ وسلم کے پیچھے پیچھے چل رہے تھے کہ حضور صلی اللہ علیہ وسلم نے فرمایا یہ کون صاحب ہیں ؟ بتایا کہ میں ابوہریرہ رضی اللہ عنہ ہوں آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ استنجے کے لئے چند پتھر تلاش کر لاؤ اور ہاں ہڈی اور لید نہ لا نا ۔ تو میں پتھر لے کر حاضر ہوا ۔ میں انہیں اپنے کپڑے میں رکھے ہوئے تھا اور لاکرمیں نے آپ صلی اللہ علیہ وسلم کے قریب اسے رکھ دیا اور وہاں سے واپس چلا آیا ۔ آپ صلی اللہ علیہ وسلم جب قضائے حاجت سے فارغ ہو گئے تو میں پھر آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور میں نے عرض کیا کہ ہڈی اور گوبر میں کیا بات ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا اس لئے کہ وہ جنوں کی خوراک ہیں ۔ میرے پاس نصیبین کے جنوں کا ایک وفد آیا تھا اور کیا ہی اچھے وہ جن تھے ۔ تو انہوں نے مجھ سے تو شہ مانگا میں نے ان کے لئے اللہ سے یہ دعا کی کہ جب بھی ہڈی یا گوبر پر ان کی نظر پڑے تو ان کے لئے اس چیز سے کھا نا ملے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 134950,
        "last_updated": null
    },
    {
        "urduURN": 4038200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3861,
        "hadithSanad": "مجھ سے عمرو بن عباس نے بیان کیا ، کہا ہم سے عبدالرحمٰن بن مہدی نے ، کہا ہم سے مثنیٰ نے ، ان سے ابوجمرہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "جب ابوذر رضی اللہ عنہ کو رسول اللہ صلی اللہ علیہ وسلم کی نبوت کے بارے میں معلوم ہوا تو انہوں نے اپنے بھائی انیس سے کہا مکہ جانے کے لئے سواری تیار کر اور اس شخص کے متعلق جو نبی ہونے کا مدعی ہے اور کہتا ہے کہ اس کے پاس آسمان سے خبرآتی ہے ۔ میرے لئے خبریں حاصل کر کے لا ۔ اس کی باتوں کو خود غور سے سننا اور پھر میرے پاس آنا ۔ ان کے بھائی وہاں سے چلے اور مکہ حاضر ہو کر آنحضرت صلی اللہ علیہ وسلم کی باتیں خود سنیں پھر واپس ہو کر انہوں نے ابوذر رضی اللہ عنہ کو بتایا کہ میں نے انہیں خود دیکھا ہے ، وہ اچھے اخلاق کا لوگوں کوحکم کرتے ہیں اور میں نے ان سے جو کلام سنا وہ شعر نہیں ہے ۔ اس پر ابو ذررضی اللہ عنہ نے کہا جس مقصد کے لئے میں نے تمہیں بھیجا تھا مجھے اس پر پوری طرح تشفی نہیں ہوئی ، آخر انہوں نے خودتوشہ باندھا ، پانی سے بھر ا ہوا ایک پر انا مشکیزہ ساتھ لیا اور مکہ آئے ، مسجدالحرام میں حاضری دی اور یہاں نبی کریم صلی اللہ علیہ وسلم کو تلاش کیا ۔ ابوذر رضی اللہ عنہ آنحضرت صلی اللہ علیہ وسلم کو پہچانتے نہیں تھے اور کسی سے آپ صلی اللہ علیہ وسلم کے متعلق پو چھنا بھی مناسب نہیں سمجھا ، کچھ رات گزرگئی کہ وہ لیٹے ہوئے تھے ۔ حضرت علی رضی اللہ عنہ نے ان کو اس حالت میں دیکھا اور سمجھ گئے کہ کوئی مسافر ہے ، علی رضی اللہ عنہ نے ان سے کہا کہ آپ میرے گھر پر چل کر آرام کیجئے ۔ ابوذر رضی اللہ عنہ ان کے پیچھے پیچھے چلے گئے لیکن کسی نے ایک دوسرے کے بارے میں بات نہیں کی ۔ جب صبح ہوئی تو ابوذر رضی اللہ عنہ نے اپنا مشکیزہ اور توشہ اٹھایا اور مسجدالحرام میں آ گئے ۔ یہ دن بھی یونہی گزر گیا اور وہ نبی کریم صلی اللہ علیہ وسلم کو نہ دیکھ سکے ۔ شام ہوئی تو سونے کی تیاری کرنے لگے ۔ علی رضی اللہ عنہ پھر وہاں سے گزرے اور سمجھ گئے کہ ابھی اپنے ٹھکانے جانے کا وقت اس شخص پر نہیں آیا ، وہ انہیں وہاں سے پھر اپنے ساتھ لے آئے اور آج بھی کسی نے ایک دوسرے سے بات چیت نہیں کی ، تیسرا دن جب ہوا اور علی رضی اللہ عنہ نے ان کے ساتھ یہی کام کیا اور اپنے ساتھ لے گئے تو ان سے پوچھا کیا تم مجھے بتا سکتے ہو کہ یہاں آنے کا باعث کیا ہے ؟ ابوذررضی اللہ عنہ نے کہا کہ اگر تم مجھ سے پختہ وعدہ کر لو کہ میری راہ نمائی کرو گے تو میں تم کو سب کچھ بتا دوں گا ۔ علی رضی اللہ عنہ نے وعدہ کر لیا تو انہوں نے اپنے خیالات کی خبر دی ۔ علی رضی اللہ عنہ نے فرمایا کہ بلاشبہ وہ حق پر ہیں اور اللہ کے سچے رسول ہیں اچھا صبح کو تم میرے پیچھے پیچھے میرے ساتھ چلنا ۔ اگر میں ( راستے میں ) کوئی ایسی بات دیکھوںگا جس سے مجھے تمہارے بارے میں خطرہ ہو تو میں کھڑا ہو جاؤں گا ۔ ( کسی دیوار کے قریب ) گویا مجھے پیشاب کرنا ہے ، اس وقت تم میرا انتظار نہ کر نا اور جب میں پھر چلنے لگوں تو میرے پیچھے آ جانا تاکہ کوئی سمجھ نہ سکے کہ یہ دونوں ساتھ ہیں اور اس طرح جس گھر میں ، میں داخل ہوں تم بھی داخل ہو جانا ۔ انہوں نے ایسا ہی کیا اور پیچھے پیچھے چلے تاآنکہ علی رضی اللہ عنہ کے ساتھ وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں پہنچ گئے ، آپ کی باتیں سنیں اور وہیں اسلام لے آئے ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا اب اپنی قوم غفار میں واپس جاؤ اور انہیں میرا حال بتاؤ تاآنکہ جب ہمارے غلبہ کا علم تم کو ہو جائے ( تو پھر ہمارے پاس آ جانا ) ابو ذررضی اللہ عنہ نے عرض کیا اس ذات کی قسم جس کے ہاتھ میں میری جان ہے میں ان قریشیوں کے مجمع میں پکا رکر کلمئہ توحید کا اعلان کروں گا ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم کے یہا ں سے واپس وہ مسجدالحرام میں آئے اور بلند آواز سے کہا کہ ” میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں اور یہ کہ محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں “ ۔ یہ سنتے ہی سارا مجمع ان پر ٹوٹ پڑا اور انہیں اتنا مارا کہ زمین پر لٹا دیا اتنے میں عباس رضی اللہ عنہ آ گئے اور ابوذر رضی اللہ عنہ کے اوپر اپنے کو ڈال کر قریش سے کہا افسوس کیا تمہیں معلوم نہیں کہ یہ شخص قبیلہ غفار سے ہے اور شام جانے والے تمہارے تاجروں کا راستہ ادھر ہی سے پڑتاہے اس طرح سے ان سے ان کو بچایا ۔ پھر ابوذر رضی اللہ عنہ دوسرے دن مسجدالحرام میں آئے اور اپنے اسلام کا اظہار کیا ۔ قو م پھر بری طرح ان پر ٹوٹ پڑی اور مارنے لگی اس دن بھی عباس ان پر اوندھے پڑگئے</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 134960,
        "last_updated": null
    },
    {
        "urduURN": 4038210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3862,
        "hadithSanad": "ہم سے قتیبہ بن سعیدنے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے اسماعیل نے ، ان سے قیس نے بیان کیا کہ",
        "hadithText": "میں نے کوفہ کی مسجد میں سعید بن زید بن عمرو بن نفیل رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے کہ ایک وقت تھا جب حضرت عمر رضی اللہ عنہ نے اسلام لانے سے پہلے مجھے اس وجہ سے باندھ رکھا تھا کہ میں نے اسلام کیوں قبول کیا لیکن تم لوگوں نے حضرت عثمان رضی اللہ عنہ کے ساتھ جو کچھ کیا ہے اس کی وجہ سے اگر احد پہاڑبھی اپنی جگہ سے سرک جائے تو اسے ایسا کرنا ہی چا ہئے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 134970,
        "last_updated": null
    },
    {
        "urduURN": 4038220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3863,
        "hadithSanad": "مجھ سے محمد بن کثیر نے بیان کیا ، انہوں نے کہا ہم کو سفیان ثوری نے خبر دی ، انہیں اسماعیل بن ابی خالد نے ، انہیں قیس بن ابی حازم نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "حضرت عمر رضی اللہ عنہ کے اسلام لانے کے بعدہم لوگ ہمیشہ عزت سے رہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 134980,
        "last_updated": null
    },
    {
        "urduURN": 4038230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3864,
        "hadithSanad": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، کہا مجھ سے عبداللہ بن وہب نے بیان کیا ، کہا کہ مجھ سے عمربن محمد نے بیان کیا ، کہامجھ کو میرے دادا زید بن عبداللہ بن عمرو نے خبر دی ، ان سے ان کے والد عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "حضرت عمر رضی اللہ عنہ ( اسلام لانے کے بعد قریش سے ) ڈرے ہوئے گھر میں بیٹھے ہوئے تھے کہ ابوعمرو عاص بن وائل سہمی اندر آیا ، ایک دھاری دار چادر اور ریشمی کرتہ پہنے ہوئے تھا وہ قبیلہ بنوسہم سے تھا جو زمانہ جاہلیت میں ہمارے حلیف تھے ، عاص نے حضرت عمر رضی اللہ عنہ سے کہا کیا بات ہے ؟ عمر رضی اللہ عنہ نے کہا کہ تمہاری قوم بنو سہم والے کہتے ہیں کہ اگر میں مسلمان ہوا تو وہ مجھ کو مارڈالیں گے ۔ عاص نے کہا ” تمہیں کوئی نقصان نہیں پہنچا سکتا “ جب عاص نے یہ کلمہ کہہ دیا تو عمر رضی اللہ عنہ نے کہا کہ پھر میں بھی اپنے کو امان میں سمجھتا ہوں ۔ اس کے بعد عاص باہر نکلا تو دیکھا کہ میدان لوگوںسے بھر گیا ہے ۔ عاص نے پوچھا کدھر کا رخ ہے ؟ لوگوں نے کہا ہم ابن خطاب کی خبر لینے جاتے ہیں جو بےدین ہو گیا ہے ۔ عاص نے کہا اسے کوئی نقصان نہیں پہنچا سکتا ، یہ سنتے ہی لوگ لوٹ گئے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 134990,
        "last_updated": null
    },
    {
        "urduURN": 4038240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3865,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا کہ میں نے عمرو بن دینا ر سے سنا ، انہوں نے بیان کیا کہ عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ",
        "hadithText": "جب عمر رضی اللہ عنہ اسلام لائے تو لوگ ان کے گھر کے قریب جمع ہو گئے اور کہنے لگے کہ عمر بےدین ہو گیا ہے ، میں ان دنوں بچہ تھا اور اس وقت اپنے گھر کی چھت پر چڑھا ہوا تھا ۔ اچانک ایک شخص آیا جو ریشم کی قباء پہنے ہوئے تھا ، اس شخص نے لوگوںسے کہا ٹھیک ہے عمر بےدین ہو گیا لیکن یہ مجمع کیساہے ؟ دیکھو میں عمر کو پناہ دے چکا ہوں ۔ ابن عمر رضی اللہ عنہما نے بیان کیا کہ میں نے دیکھا کہ اس کی یہ بات سنتے ہی لوگ الگ الگ ہو گئے ۔ میں نے پوچھا یہ کون صاحب تھے ؟ عمر رضی اللہ عنہ نے کہا کہ یہ عاص بن وائل ہیں ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 135000,
        "last_updated": null
    },
    {
        "urduURN": 4038250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3866,
        "hadithSanad": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، کہا کہ مجھ سے عبداللہ بن وہب نے بیان کیا ، کہا کہ مجھ سے عمرو بن محمد بن زید نے بیان کیا ، ان سے سالم نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہمانے بیان کیا کہ",
        "hadithText": "جب بھی حضرت عمر رضی اللہ عنہ نے کسی چیز کے متعلق کہا کہ میرا خیال ہے کہ یہ اس طرح ہے تو وہ اسی طرح ہوئی جیسا وہ اس کے متعلق اپنا خیا ل ظاہر کرتے تھے ۔ ایک دن وہ بیٹھے ہوئے تھے کہ ایک خوبصورت شخص وہاں سے گزرا ۔ انہوں نے کہا یا تو میرا گمان غلط ہے یا یہ شخص اپنے جاہلیت کے دین پر اب بھی قائم ہے یا یہ زمانہ جاہلیت میں اپنی قوم کا کاہن رہا ہے ۔ اس شخص کو میرے پاس بلاؤ ۔ وہ شخص بلایا گیا تو حضرت عمر رضی اللہ عنہ نے اس کے سامنے بھی یہی بات دھرائی ۔ اس پر اس نے کہا میں نے تو آج کے دن کا سا معاملہ کبھی نہیں دیکھا جو کسی مسلمان کو پیش آیا ہو ۔ عمر رضی اللہ عنہ نے کہا لیکن میں تمہارے لئے ضروری قرار دیتا ہوں کہ تم مجھے اس سلسلے میں بتاؤ ۔ اس نے اقرار کیا کہ زمانہ جاہلیت میں میں اپنی قوم کا کاہن تھا ۔ حضرت عمر رضی اللہ عنہ نے کہا غیب کی جو خبریں تمہاری جنیہ تمہارے پاس لاتی تھی ، اس کی سب سے حیرت انگیز کوئی بات سناؤ ؟ شخص مذکور نے کہا کہ ایک دن میں بازار میں تھا کہ جنیہ میرے پاس آئی ۔ میں نے دیکھا کہ وہ گھبرائی ہوئی ہے ، پھر اس نے کہا جنوں کے متعلق تمہیں معلوم نہیں ۔ جب سے انہیں آسمانی خبروں سے روک دیا گیا ہے وہ کس درجہ ڈرے ہوئے ہیں ، مایوس ہو رہے ہیں اور اونٹنیوں کے پالان کی کملیوں سے مل گئے ہیں ۔ حضرت عمر رضی اللہ عنہ نے کہا کہ تم نے سچ کہا ۔ ایک مرتبہ میں بھی ان دنوں بتوں کے قریب سویا ہوا تھا ۔ ایک شخص ایک بچھڑا لایا اور اس نے بت پر اسے ذبح کر دیا اس کے اندر سے اس قدر زور کی آواز نکلی کہ میں نے ایسی شدید چیخ کبھی نہیں سنی تھی ۔ اس نے کہا اے دشمن ! ایک بات بتلاتا ہوں جس سے مراد مل جائے ایک فصیح خوش بیان شخص یوں کہتا ہے لا الہٰ الا اللہ یہ سنتے ہی تمام لوگ ( جو وہاں موجود تھے ) چونک پڑے ( چل دئیے ) میں نے کہا میں تو نہیں جانے کا ، دیکھو اس کے بعد کیا ہوتا ہے ۔ پھر یہی آواز آئی ارے دشمن تجھ کو ایک بات بتلاتا ہوں جس سے مراد بر آئے ایک فصیح شخص یوں کہہ رہا ہے لا الہٰ الا اللہ ۔ اس وقت میں کھڑا ہوا اور ابھی کچھ دیر نہیں گزری تھی کہ لوگ کہنے لگے یہ ( حضرت محمد صلی اللہ علیہ وسلم ) اللہ کے سچے رسول ہیں ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 135010,
        "last_updated": null
    },
    {
        "urduURN": 4038260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3867,
        "hadithSanad": "مجھ سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، کہا ہم سے اسماعیل نے بیان کیا ، کہا ہم سے قیس نے ، کہا کہ میں نے سعید بن زید رضی اللہ عنہ سے سنا",
        "hadithText": "انہوں نے مسلمانوں کو مخاطب کر کے کہا ایک وقت تھا کہ عمر رضی اللہ عنہ جب اسلام میں داخل نہیں ہوئے تھے تو مجھے اوراپنی بہن کو اس لئے باندھ رکھا تھا کہ ہم اسلام کیوں لائے ، اور آج تم نے جو کچھ حضرت عثمان رضی اللہ عنہ کے ساتھ برتاؤ کیا ہے ، اگر اس پر احد پہاڑ بھی اپنی جگہ سے سرک جائے تو اسے ایسا ہی کرنا چاہیے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 135020,
        "last_updated": null
    },
    {
        "urduURN": 4038270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3868,
        "hadithSanad": "مجھ سے عبداللہ بن عبدالوہاب نے بیان کیا ، انہوں نے کہا ہم سے بشر بن مفضل نے بیان کیا ، ان سے سعیدبن ابی عروبہ نے بیان کیا ، ان سے قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "کفار مکہ نے رسول اللہ صلی اللہ علیہ وسلم سے کسی نشانی کا مطالبہ کیا تو آنحضرت صلی اللہ علیہ وسلم نے چاند کے دوٹکڑے کر کے دکھا دئیے ۔ یہاں تک کہ انہوں نے حرا پہاڑ کو ان دونوں ٹکڑوں کے بیچ میں دیکھا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 135030,
        "last_updated": null
    },
    {
        "urduURN": 4038280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3869,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، ان سے ابوحمزہ محمد بن میمون نے ، ان سے اعمش نے ، ان سے ابراہیم نخعی نے ، ان سے ابو معمر نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "جس وقت چاند کے دو ٹکڑے ہوئے تو ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ منیٰ کے میدان میں موجودتھے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ لوگو ! گواہ رہنا ، اور چاند کا ایک ٹکڑا دوسرے سے الگ ہو کر پہاڑ کی طرف چلا گیا تھا اور ابو الضحیٰ نے بیان کیا ، ان سے مسروق نے ، ان سے عبداللہ بن مسعود رضی اللہ عنہما نے کہ شق قمر کا معجزہ مکہ میں پیش آیا تھا ۔ ابراہیم نخعی کے ساتھ اس کی متابعت محمد بن مسلم نے کی ہے ، ان سے ابونجیح نے بیان کیا ، ان سے مجاہد نے ، ان سے ابو معمر نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 135040,
        "last_updated": null
    },
    {
        "urduURN": 4038290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3870,
        "hadithSanad": "ہم سے عثمان بن صالح نے بیان کیا ، انہوں نے کہا ہم سے بکر بن مضر نے بیان کیا ، انہوں نے کہا کہ مجھ سے جعفر بن ربیعہ نے بیان کیا ، ان سے عراک بن مالک نے ، ان سے عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے زمانے میں بلا شک وشبہ چاند پھٹ گیا تھا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 135050,
        "last_updated": null
    },
    {
        "urduURN": 4038300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3871,
        "hadithSanad": "ہم سے عمر بنا حفص نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا ہم سے ابراہیم نخعی نے بیان کیا ، ان سے ابو معمر نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "چاند پھٹ گیا تھا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 135060,
        "last_updated": null
    },
    {
        "urduURN": 4038310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3872,
        "hadithSanad": "ہم سے عبداللہ بن محمد جعفی نے بیان کیا ، کہا ہم سے ہشام بن یوسف نے بیان کیا ، انہیں معمر نے خبر دی ، انہیں زہری نے کہا کہ ہم سے عروہ بن زبیر نے بیان کیا ، انہیں عبیداللہ بن عدی بن خیارنے خبر دی ، انہیں مسور بن مخرمہ اور عبد الر حمن بن اسود بن عبد یغوث",
        "hadithText": "ان دونوں نے عبیداللہ بن عدی بن خیار سے کہا تم اپنے ماموں ( امیرالمؤمنین ) عثمان رضی اللہ عنہ سے ان کے بھائی ولید بن عقبہ بن ابی معیط کے باب میں گفتگو کیوں نہیں کرتے ، ( ہوا یہ تھا کہ لوگوں نے اس پر بہت اعتراض کیا تھا جو حضرت عثمان نے ولید کے ساتھ کیا تھا ) ، عبیداللہ نے بیان کیا کہ جب حضرت عثمان رضی اللہ عنہ نماز پڑھنے نکلے تو میں ان کے راستے میں کھڑا ہو گیا اور میں نے عرض کیا کہ مجھے آپ سے ایک ضرورت ہے ، آپ کو ایک خیرخواہانہ مشورہ دینا ہے ۔ اس پر انہوں نے کہا کہ بھلے آدمی ! تم سے تو میں خدا کی پنا ہ مانگتا ہوں ۔ یہ سن کر میں وہاں سے واپس چلا آیا ۔ نماز سے فا رغ ہونے کے بعد میں مسور بن مخرمہ اور ابن عبد یغوث کی خدمت میں حاضر ہوا اور عثمان رضی اللہ عنہ سے جو کچھ میں نے کہا تھا اور انہوں نے اس کا جواب مجھے جودیا تھا ، سب میں نے بیان کر دیا ۔ ان لوگوں نے کہا تم نے اپنا حق ادا کر دیا ۔ ابھی میں اس مجلس میں بیٹھا تھا کہ عثمان رضی اللہ عنہ کا آدمی میرے پاس ( بلانے کے لیے ) آیا ۔ ان لوگوں نے مجھ سے کہا تمہیں اللہ تعالیٰ نے امتحان میں ڈالا ہے ۔ آخر میں وہاں سے چلا اور حضرت عثمان رضی اللہ عنہ کی خدمت میں حاضر ہوا ۔ آپ نے دریافت کیا تم ابھی جس خیرخواہی کا ذکر کر رہے تھے وہ کیاتھی ؟ انہوں نے بیان کیا کہ پھر میں نے کہا اللہ گواہ ہے پھر میں نے کہا اللہ تعالیٰ نے محمد صلی اللہ علیہ وسلم کو مبعوث فرمایا اور ان پر اپنی کتاب نازل فرمائی ، آپ ان لوگوں میں سے تھے جنہوں نے آنحضرت صلی اللہ علیہ وسلم کی دعوت پر لبیک کہا تھا ۔ آپ حضور صلی اللہ علیہ وسلم پر ایمان لائے دو ہجرتیں کیں ( ایک حبشہ کو اور دوسری مدینہ کو ) آپ رسول اللہ صلی اللہ علیہ وسلم کی صحبت سے فیض یاب ہیں اور آنحضرت صلی اللہ علیہ وسلم کے طریقوں کو دیکھا ہے ۔ بات یہ ہے کہ ولید بن عقبہ کے بارے میں لوگوں میں اب بہت چرچا ہونے لگا ہے ۔ اس لئے آپ کے لئے ضروری ہے کہ اس پر ( شراب نوشی کی ) حد قائم کریں ۔ عثمان رضی اللہ عنہ نے فرمایا میرے بھتیجے یا میرے بھانجے کیا تم نے بھی رسول اللہ صلی اللہ علیہ وسلم کودیکھا ہے ؟ میں نے عرض کیا کہ نہیں ۔ لیکن آنحضور صلی اللہ علیہ وسلم کے دین کی باتیں اس طرح میں نے حاصل کی تھیں جو ایک کنوا ری لڑکی کو بھی اپنے پردے میں معلوم ہو چکی ہیں ۔ انہوں نے بیان کیا کہ یہ سن کر پھر عثمان رضی اللہ عنہ نے بھی اللہ کو گواہ کر کے فرمایا بلاشبہ اللہ تعالیٰ نے محمد صلی اللہ علیہ وسلم کو حق کے ساتھ مبعوث کیا اور آپ پر اپنی کتاب نازل کی تھی اور یہ بھی ٹھیک ہے کہ میں ان لوگوں میں سے تھا جنہوں نے اللہ اور اس کے رسول صلی اللہ علیہ وسلم کی دعوت پر ( ابتداء ہی میں ) لبیک کہا تھا ۔ آنحضرت صلی اللہ علیہ وسلم جو شریعت لے کر آئے تھے میں اس پر ایمان لایا اور جیسا کہ تم نے کہا میں نے دو ہجرتیں کیں ۔ میں آنحضرت صلی اللہ علیہ وسلم کی صحبت سے فیض یاب ہوا اور آپ صلی اللہ علیہ وسلم سے بیعت بھی کی ۔ اللہ کی قسم ! میں نے آپ کی نافرمانی نہیں کی اور نہ کبھی خیانت کی آخر اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو وفات دے دی اور حضرت ابوبکر رضی اللہ عنہ خلیفہ منتحب ہوئے ۔ اللہ کی قسم ! میں نے ان کی بھی کبھی نافرمانی نہیں کی اور نہ ان کے کسی معاملہ میں کوئی خیانت کی ۔ ان کے بعد حضرت عمر رضی اللہ عنہ خلیفہ ہوئے میں نے ان کی بھی کبھی نافرمانی نہیں کی اور نہ کبھی خیانت کی ۔ اس کے بعد میں خلیفہ ہوا ۔ کیا اب میرا تم لوگوں پر وہی حق نہیں ہے جو ان کا مجھ پر تھا ؟ عبیداللہ نے عرض کیا یقیناً آپ کا حق ہے پھر انہوں نے کہا پھر ان باتوں کی کیا حقیقت ہے جو تم لوگوں کی طرف سے پہنچ رہی ہیں ؟ جہاں تک تم نے ولید بن عقبہ کے بارے میں ذکر کیا ہے تو ہم انشاءاللہ اس معاملے میں اس کی گرفت حق کے ساتھ کریں گے ۔ راوی نے بیان کیا کہ آخر ( گواہی کے بعد ) ولید بن عقبہ کو چالیس کوڑے لگوائے گئے اور حضرت علی رضی اللہ عنہ کو حکم دیا کہ کوڑے لگائیں ، حضرت علی رضی اللہ عنہ ہی نے اس کو کوڑے مارے تھے ۔ اس حدیث کو یونس اورزہری کے بھتیجے نے بھی زہری سے روایت کیا اس میں عثمان رضی اللہ عنہ کا قول اس طرح بیان کیا ، کیا تم لوگوں پر میرا وہی حق نہیں ہے جو ان لوگوں کا تم پر تھا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 135070,
        "last_updated": null
    },
    {
        "urduURN": 4038320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3873,
        "hadithSanad": "مجھ سے محمد بن مثنیٰ نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے ہشام بن عروہ نے بیان کیا ، کہا ہم سے ہمارے والد ( عروہ بن زبیر ) نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "ام حبیبہ رضی اللہ عنہا اور ام سلمہ رضی اللہ عنہا نے ایک گر جے کا ذکر کیا جسے انہوں نے حبشہ میں دیکھا تھا اس کے اندر تصویریں تھیں ۔ انہوں نے اس کا ذکر نبی کریم صلی اللہ علیہ وسلم کے سامنے کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا جب ان میں کوئی نیک مرد ہوتا اور اس کی وفات ہو جاتی تو اس کی قبر کو وہ لوگ مسجد بناتے اور پھر اس میں اس کی تصویریں رکھتے ۔ یہ لوگ قیامت کے دن اللہ تعالیٰ کی بارگاہ میں بدتر ین مخلوق ہوں گے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 135080,
        "last_updated": null
    },
    {
        "urduURN": 4038330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3874,
        "hadithSanad": "ہم سے حمیدی نے بیان کیا ، انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا ، انہوں نے کہا ہم سے اسحاق بن سعید سعیدی نے بیان کیا ۔ ان سے ان کے والد سعید بن عمرو بن سعید بن عاص نے ، ان سے ام خالد بنت خالد رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میں جب حبشہ سے آئی تو بہت کم عمر تھی ۔ مجھے رسول اللہ صلی اللہ علیہ وسلم نے ایک دھاری دار چادر عنایت فرمائی اور پھر آپ نے اس کی دھاریوں پر اپنا ہاتھ پھیر کر فرمایا سناہ سناہ ۔ حمیدی نے بیان کیا کہ سناہ سناہ حبشی زبان کا لفظ ہے یعنی اچھا اچھا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 135090,
        "last_updated": null
    },
    {
        "urduURN": 4038340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3875,
        "hadithSanad": "ہم سے یحییٰ بن حماد نے بیان کیا ، کہا ہم سے ابو عوانہ نے بیان کیا ، ان سے سلیمان نے ، ان سے ابراہیم نے ، ان سے علقمہ نے اور ان سے عبداللہ نے بیان کیا کہ",
        "hadithText": "( ابتداء اسلام میں ) نبی کریم صلی اللہ علیہ وسلم نماز پڑھتے ہوتے اور ہم آپ کو سلام کرتے تو آپ نماز ہی میں جواب عنایت فرماتے تھے ۔ لیکن جب ہم نجاشی کے ملک حبشہ سے واپس ( مدینہ ) آئے اور ہم نے ( نماز پڑھتے میں ) آپ کو سلام کیا تو آپ نے جواب نہیں دیا ۔ نماز کے بعد ہم نے عرض کیا ، یا رسول اللہ صلی اللہ علیہ وسلم ! ہم پہلے آپ کو سلام کرتے تھے تو آپ نماز ہی میں جواب عنایت فرمایا کرتے تھے ؟ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا ہاں نماز میں آدمی کو دوسرا شغل ہوتا ہے ۔ سلیمان اعمش نے بیان کیا کہ میں نے ابراہیم نخعی سے پوچھا ایسے موقعہ پر آپ کیا کرتے ہیں ؟ انہوں نے کہا کہ میں دل میں جواب دے دیتا ہوں ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 135100,
        "last_updated": null
    },
    {
        "urduURN": 4038350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3876,
        "hadithSanad": "ہم سے محمد بن علاء نے بیان کیا ، ہم سے ابواسامہ نے بیان کیا ، کہا ہم سے برید بن عبداللہ نے بیان کیا ، ان سے ابوبردہ نے اور ان سے حضرت ابوموسیٰ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جب ہمیں رسول اللہ صلی اللہ علیہ وسلم کی ہجرت مدینہ کی اطلاع ملی تو ہم یمن میں تھے ۔ پھر ہم کشتی پر سوار ہوئے لیکن اتفاق سے ہوا نے ہماری کشتی کا رخ نجاشی کے ملک حبشہ کی طرف کر دیا ۔ ہماری ملاقات وہاں جعفر بن ابی طالب رضی اللہ عنہ سے ہوئی ( جو ہجرت کر کے وہاں موجود تھے ) ہم انہیں کے ساتھ وہاں ٹھہرے رہے ، پھر مدینہ کا رخ کیا اور آنحضرت صلی اللہ علیہ وسلم سے اس وقت ملاقات ہوئی جب آپ خیبر فتح کر چکے تھے ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا تم نے اے کشتی والو ! دو ہجرتیں کی ہیں ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 135110,
        "last_updated": null
    },
    {
        "urduURN": 4038360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3877,
        "hadithSanad": "ہم سے ابو ربیع سلیمان بن داؤد نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ابن جریج نے ، ان سے عطاء  بن ابی رباح نے اور ان سے حضرت جابر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جس دن نجاشی ( حبشہ کے بادشاہ ) کی وفات ہوئی تو آنحضر ت صلی اللہ علیہ وسلم نے فرمایا ، آج ایک مردصالح اس دنیا سے چلا گیا ، اٹھو اور اپنے بھائی اصحمہ کی نماز جنازہ پڑھ لو ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 135120,
        "last_updated": null
    },
    {
        "urduURN": 4038370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3878,
        "hadithSanad": "ہم سے عبدالاعلیٰ بن حماد نے بیان کیا ، انہوں نے کہا ہم سے یزید بن زریع نے بیان کیا ، انہوں نے کہا ہم سے سعید بن ابی عروبہ نے بیان کیا ، انہوں نے کہا ہم سے قتادہ نے بیان کیا ، ان سے عطاء  بن ابی رباح نے بیان کیا اور ان سے جابر بن عبداللہ انصاری رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے نجاشی کے جنازہ کی نماز پڑھی تھی اور ہم صف باندھ کر آپ کے پیچھے کھڑے ہوئے ۔ میں دوسری یا تیسری صف میں تھا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 135130,
        "last_updated": null
    },
    {
        "urduURN": 4038380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3879,
        "hadithSanad": "مجھ سے عبداللہ بن ابی شیبہ نے بیان کیا ، کہا ہم سے یزید بن ہارون نے بیان کیا ، ان سے سلیم بن حیان نے ، کہا ہم سے سعید بن میناء نے بیان کیا ، ان سے جابر بن عبداللہ رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے اصحمہ نجاشی کی نماز جنازہ پڑھی اور چار مرتبہ آپ نے نماز میں تکبیر کہی ۔ یزید بن ہارون کے ساتھ اس حدیث کو عبدالصمد بن عبدالوارث نے بھی ( سلیم بن حیان ) سے روایت کیا ہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 135140,
        "last_updated": null
    },
    {
        "urduURN": 4038390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3880,
        "hadithSanad": "ہم سے زہیر بن حرب نے بیان کیا ، کہا ہم سے یعقوب بن ابراہیم نے بیان کیا ، کہا ہم سے ہمارے والد ( ابراہیم بن سعد ) نے بیان کیا ، ان سے صالح بن کیسان نے ، ان سے ابن شہاب نے بیان کیا ، ان سے ابوسلمہ بن عبدالرحمٰن اور سعید بن مسیب نے بیان کیا اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے حبشہ کے بادشاہ نجاشی کی موت کی خبر اسی دن دے دی تھی جس دن ان کا انتقال ہوا تھا اور آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ اپنے بھائی کی مغفرت کے لئے دعا کرو ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 135150,
        "last_updated": null
    },
    {
        "urduURN": 4038400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3881,
        "hadithSanad": "اور صالح سے روایت ہے کہ ابن شہاب نے بیان کیا ، ان سے سعید بن مسیب نے بیان کیا اور انہیں ابوہریرہ رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ( نماز جنازہ کے لئے ) عیدگاہ میں صحابہ رضی اللہ عنہم کو صف بستہ کھڑا کیا اور اس کی نماز جنازہ پڑھی آپ صلی اللہ علیہ وسلم نے چار مرتبہ تکبیر کہی تھی ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 135160,
        "last_updated": null
    },
    {
        "urduURN": 4038410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3882,
        "hadithSanad": "ہم سے عبد العزیز بن عبداللہ اویسی نے بیان کیا ، انہوں نے کہا مجھ سے ابراہیم بن سعد نے بیان کیا ، انہوں نے کہا کہ ہم سے ابن شہاب نے بیان کیا ، ان سے سلمہ بن عبدالرحمٰن نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے جنگ حنین کا قصد کیا تو فرمایا انشاءاللہ کل ہمارا قیام خیف بنی کنانہ میں ہو گا جہاںمشرکین نے کافر ہی رہنے کے لئے عہدو پیمان کیا تھا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 135170,
        "last_updated": null
    },
    {
        "urduURN": 4038420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3883,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے ، ان سے سفیان ثوری نے ، کہا ہم سے عبدالملک بن عمیرنے ، ان سے عبداللہ بن حارث نے بیان کیا ان سے حضرت عباس بن عبدالمطلب رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "انہوں نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا آپ اپنے چچا ( ابوطالب ) کے کیا کام آئے کہ وہ آپ صلی اللہ علیہ وسلم کی حمایت کیا کرتے تھے اور آپ صلی اللہ علیہ وسلم کے لئے غصہ ہوتے تھے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ( اسی وجہ سے ) وہ صرف ٹخنوں تک جہنم میں ہیں اگر میں ان کی سفارش نہ کرتا تو وہ دوزخ کی تہ میں بالکل نیچے ہوتے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 135180,
        "last_updated": null
    },
    {
        "urduURN": 4038430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3884,
        "hadithSanad": "ہم سے محمودبن غیلان نے بیان کیا ، کہا ہم سے عبد الرزق نے بیان کیا ، انہیں معمر نے خبر دی ، انہیں زہری نے ، انہیں سعید بن مسیب نے اور انہیں ان کے والد مسیب بن حزن صحابی رضی اللہ عنہ نے کہ",
        "hadithText": "جب ابوطالب کی وفات کا وقت قریب ہوا تو نبی کریم صلی اللہ علیہ وسلم ان کے پاس تشریف لے گئے ۔ اس وقت وہاں ابوجہل بھی بیٹھا ہوا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا چچا ! کلمہ لا الہٰ الا اللہ ایک مرتبہ کہہ دو ، اللہ کی بارگاہ میں ( آپ کی بخشش کے لئے ) ایک یہی دلیل میرے ہاتھ آ جائے گی ، اس پر ابوجہل اور عبداللہ بن ابی امیہ نے کہا ، اے ابوطالب ! کیا عبدالمطلب کے دین سے تم پھر جاؤ گے ! یہ دونوں ان ہی پر زور دیتے رہے اور آخر ی کلمہ جو ان کی زبان سے نکلا ، وہ یہ تھا کہ میں عبدالمطلب کے دین پر قائم ہوں ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں ان کے لئے اس وقت تک مغفرت طلب کرتا رہوں گا جب تک مجھے اس سے منع نہ کر دیا جائے گا ۔ چنانچہ ( سورۃ براۃ میں ) یہ آیت نازل ہوئی ” نبی کے لئے اور مسلمانوں کے لئے مناسب نہیں ہے کہ مشرکین کے لئے دعا مغفرت کریں خواہ وہ ان کے ناطے والے ہی کیوں نہ ہوں جب کہ ان کے سامنے یہ بات واضح ہو گئی کہ وہ دوزخی ہیں “ اور سورۃ قصص میں یہ آیت نازل ہوئی ” بیشک جسے آپ چاہیں ہدایت نہیں کر سکتے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 135190,
        "last_updated": null
    },
    {
        "urduURN": 4038440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3885,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، کہا ہم سے یزید بن عبداللہ ابن الہاد نے ، ان سے عبداللہ بن خباب نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے کہ",
        "hadithText": "انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم کی مجلس میں آپ صلی اللہ علیہ وسلم کے چچا کا ذکر ہو رہا تھا تو آپ صلی اللہ علیہ وسلم نے فرمایا شاید قیامت کے دن انہیں میری شفاعت کام آ جائے اور انہیں صرف ٹخنوں تک جہنم میں رکھا جائے جس سے ان کا دماغ کھولے گا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 135200,
        "last_updated": null
    },
    {
        "urduURN": 4038450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3886,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، کہ مجھ سے کہا ابوسلمہ بن عبدالرحمٰن نے کہ میں نے حضرت جابر بن عبداللہ رضی اللہ عنہماسے سنا اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ جب قریش نے ( معراج کے واقعہ کے سلسلے میں ) مجھ کو جھٹلایا تو میں حطیم میں کھڑا ہو گیا اور اللہ تعالیٰ نے میرے لئے بیت المقدس کو روشن کر دیا اور میں نے اسے دیکھ کر قریش سے اس کے پتے اور نشان بیان کرنا شروع کر دیئے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 135210,
        "last_updated": null
    },
    {
        "urduURN": 4038460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3887,
        "hadithSanad": "ہم سے ہدبہ بن خالد نے بیان کیا ، انہوں نے کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، ان سے قتادہ نے بیان کیا ، ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا اور ان سے حضرت مالک بن صعصعہ رضی اللہ عنہ نے بیان کیا ، کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ان سے شب معراج کا واقعہ بیان کیا ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں حطیم میں لیٹا ہوا تھا ۔ بعض دفعہ قتادہ نے حطیم کے بجائے حجر بیان کیا کہ میرے پاس ایک صاحب ( جبرائیل علیہ السلام ) آئے اور میر ا سینہ چاک کیا ، قتادہ نے بیان کیا کہ میں نے حضرت انس رضی اللہ عنہ سے سنا ، وہ بیان کرتے تھے کہ یہاں سے یہاں تک ۔ میں نے جارود سے سنا جو میرے قریب ہی بیٹھے تھے ۔ پوچھا کہ حضرت انس رضی اللہ عنہ کی اس لفظ سے کیا مراد تھی ؟ تو انہوں نے کہا کہ حلق سے ناف تک چاک کیا ( قتادہ نے بیان کیا کہ ) میں نے حضرت انس سے سنا ، انہوں نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم کے سینے کے اوپر سے ناف تک چاک کیا ، پھر میرا دل نکالا اور ایک سونے کا طشت لایا گیا جو ایمان سے بھرا ہوا تھا ، اس سے میرا دل دھویا گیا اور پہلے کی طرح رکھ دیا گیا ۔ اس کے بعدایک جانور لایا گیا جو گھوڑے سے چھوٹا اور گدھے سے بڑا تھا اور سفید ! جارود نے حضرت انس رضی اللہ عنہ سے پوچھا ابوحمزہ ! کیا وہ براق تھا ؟ آپ نے فرمایا کہ ہاں ۔ اس کا ہر قدم اس کے منتہائے نظر پر پڑتا تھا ( آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ) مجھے اس پر سوار کیا گیا اور جبرائیل ۔ مجھے لے کر چلے آسمان دنیا پر پہنچے تو دروازہ کھلوایا ، پوچھا گیا کون صاحب ہیں ؟ انہوں نے بتایا کہ جبرائیل ( علیہ السلام ) پوچھا گیا اور آپ کے ساتھ کون ہے ؟ آپ نے بتایا کہ محمد ( صلی اللہ علیہ وسلم ) پوچھا گیا ، کیا انہیں بلانے کے لئے آپ کو بھیجا گیا تھا ؟ انہوں نے جواب دیا کہ ہاں ۔ اس پر آواز آئی انہیں خوش آمدید ! کیا ہی مبارک آنے والے ہیں وہ ۔ اور دروازہ کھول دیا ۔ جب میں اندر گیا تو میں نے وہاں آدم علیہ السلام کو دیکھا ، جبرائیل علیہ السلام نے فرمایا یہ آپ کے جد امجد آدم علیہ السلام ہیں ، انہیں سلام کیجئے ۔ میں نے ان کو سلام کیا اور انہوں نے جواب دیا اور فرمایا خوش آمدید نیک بیٹے اور نیک نبی ! جبرائیل علیہ السلام اوپر چڑھے اور دوسرے آسمان پر آئے وہاں بھی دروازہ کھلوایا آواز آئی کون صاحب آئے ہیں ؟ بتایا کہ جبرائیل ( علیہ السلام ) پوچھا گیا آپ کے ساتھ اور کوئی صاحب بھی ہیں ؟ کہا محمد ( صلی اللہ علیہ وسلم ) پوچھا گیا کیا آپ کو انہیں بلانے کے لئے بھیجا گیا تھا ؟ انہوں نے جواب دیا کہ ہاں ، پھر آواز آئی انہیں خوش آمدید ۔ کیا ہی اچھے آنے والے ہیں وہ ۔ پھر دروازہ کھلا اور میں اندر گیا تو وہاں یحییٰ اور عیسیٰ علیہما السلام موجود تھے ۔ یہ دونوں خالہ زاد بھائی ہیں ۔ جبرائیل علیہ السلام نے فرمایا یہ عیسیٰ اور یحییٰ علیہما السلام ہیں ، انہیں سلام کیجئے میں نے سلام کیا اور ان حضرات نے میرے سلام کا جواب دیا اور فرمایا خوش آمدید نیک نبی اور نیک بھائی ! یہاں سے جبرائیل علیہ السلام مجھے تیسرے آسمان کی طرف لے کر چڑھے اور دروازہ کھلوایا ۔ پوچھا گیا کون صاحب آئے ہیں ؟ جواب دیا کہ جبرائیل ۔ پوچھا گیا اور آپ کے ساتھ کون صاحب آئے ہیں ؟ جواب دیا کہ محمد ( صلی اللہ علیہ وسلم ) پوچھا گیا کیا انہیں لانے کے لئے آپ کو بھیجا گیا تھا ؟ جواب دیا کہ ہاں ۔ اس پر آواز آئی انہیں خوش آمدید ۔ کیا ہی اچھے آنے والے ہیں وہ ، دروازہ کھلااور جب میں اندر داخل ہوا تو وہاں یوسف علیہ السلام موجود تھے ۔ جبرائیل علیہ السلام نے فرمایا یہ یوسف ہیں انہیں سلام کیجئے میں نے سلام کیا تو انہوں نے جواب دیا اور فرمایا خوش آمدید نیک نبی اور نیک بھائی ! پھر حضرت جبرائیل علیہ السلام مجھے لے کر اوپر چڑھے اور چوتھے آسمان پر پہنچے دروازہ کھلوایا تو پوچھا گیا کون صاحب ہیں ؟ بتایا کہ جبرائیل ! پوچھا گیا اور آپ کے ساتھ کون ہے ؟ کہا کہ محمد ( صلی اللہ علیہ وسلم ) پوچھا گیا کیاانہیں بلانے کے لئے آپ کو بھیجاگیا تھا ؟ جواب دیا کہ ہاں کہا کہ انہیں خوش آمدید کیا ہی اچھے آنے والے ہیں وہ ! اب دروازہ کھلا جب میں وہاںادریس علیہ السلام کی خدمت میں پہنچا تو جبرائیل علیہ السلام نے فرمایا یہ ادریس علیہ السلام ہیں انہیں سلام کیجئے میں نے انہیں سلام کیا اور انہوں نے جواب دیا اور فرمایا خوش آمدید پاک بھائی اور نیک نبی ۔ پھر مجھے لے کر پانچویں آسمان پر آئے اور دروازہ کھلوایا پوچھا گیا کون صاحب ہیں ؟ جواب دیا کہ جبرائیل ، پوچھا گیا آپ کے ساتھ کون صاحب آئے ہیں ؟ جواب دیا کہ محمد ( صلی اللہ علیہ وسلم ) پوچھا گیا کہ انہیں بلانے کے لئے آپ کو بھیجا گیا تھا ؟ جواب دیا کہ ہاں اب آواز آئی خوش آمدید کیا ہی اچھے آنے والے ہیں وہ ، یہاں جب میں ہارون علیہ السلام کی خدمت میں حاضر ہوا تو جبرائیل علیہ السلام نے بتایا کہ یہ ہارون ہیں انہیں سلام کیجئے میں نے انہیں سلام کیا انہوں نے جواب کے بعد فرمایا خوش آمدید نیک نبی اور نیک بھائی ! یہاں سے لے کر مجھے آگے بڑھے اور چھٹے آسمان پر پہنچے اور دروازہ کھلوایا پوچھا گیا کون صاحب آئے ہیں ؟ بتایا کہ جبرائیل ، پوچھا گیا آپ کے ساتھ کوئی دوسرے صاحب بھی آئے ہیں ؟ جواب دیا کہ محمد ( صلی اللہ علیہ وسلم ) پوچھا گیا کیا انہیں بلانے کے لئے آپ کو بھیجا گیا تھا ؟ جواب دیا کہ ہاں ۔ پھر کہا انہیں خوش آمدید کیا ہی اچھے آنے والے ہیں وہ ۔ میں جب وہاں موسیٰ علیہ السلام کی خدمت میں حاضر ہوا تو جبرائیل علیہ السلام نے فرمایا کہ یہ موسیٰ علیہ السلام ہیں انہیں سلام کیجئے ، میں نے سلام کیا اور انہوں نے جواب کے بعد فرمایا خوش آمدید نیک نبی اور نیک بھائی ! جب میں آگے بڑھا تو وہ رونے لگے کسی نے پوچھا آپ روکیوں رہے ہیں ؟ تو انہوں نے فرمایا میں اس پر رورہا ہوں کہ یہ لڑکا میرے بعد نبی بنا کر بھیجا گیا لیکن جنت میں اس کی امت کے لوگ میری امت سے زیادہ ہوں گے ۔ پھر جبرائیل علیہ السلام مجھے لے کر ساتویں آسمان کی طرف گئے اور دروازہ کھلوایا ۔ پوچھا گیا کون صاحب آئے ہیں ؟ جواب دیا کہ جبرائیل ۔ پوچھا گیا اور آپ کے ساتھ کون صاحب آئے ہیں ؟ جواب دیا کہ محمد ( صلی اللہ علیہ وسلم ) پوچھا گیا کیا انہیں بلانے کے لئے آپ کو بھیجا گیا تھا ؟ جواب دیا کہ ہاں ۔ کہا کہ انہیں خوش آمدید ، کیا ہی اچھے آنے والے ہیں وہ ، میں جب اندر گیا تو ابراہیم علیہ السلام تشریف رکھتے تھے ۔ جبرائیل علیہ السلام نے فرمایا کہ یہ آپ کے جد امجد ہیں ، انہیں سلام کیجئے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں نے ان کو سلام کیا تو انہوں نے جواب دیا اور فرمایاخوش آمدید نیک نبی اور نیک بیٹے ! پھر سدرۃالمنتہیٰ کو میرے سامنے کر دیا گیا میں نے دیکھا کہ اس کے پھل مقام حجر کے مٹکوں کی طرح ( بڑے بڑے ) تھے اور اس کے پتے ہاتھیوں کے کان کی طرح تھے ۔ جبرائیل علیہ السلام نے فرمایا کہ یہ سدرۃالمنتہیٰ ہے ۔ وہاں میں نے چار نہریں دیکھیں دو باطنی اور دو ظاہری ۔ میں نے پوچھا اے جبرائیل علیہ السلام ! یہ کیا ہیں ؟ انہوں نے بتایا کہ جو دوباطنی نہریں ہیں وہ جنت سے تعلق رکھتی ہیں اور دوظاہری نہریں نیل اور فرات ہیں ۔ پھر میرے سامنے بیت المعمور کو لایا گیا ، وہاں میرے سامنے ایک گلاس میں شراب ایک میں دودھ اور ایک میں شہد لایا گیا ۔ میں نے دودھ کا گلاس لے لیا تو جبرائیل علیہ السلام نے فرمایا یہی فطرت ہے اور آپ اس پر قائم ہیں اور آپ کی امت بھی ! پھر مجھ پر روزانہ پچاس نمازیں فرض کی گئیں میں واپس ہوا اور موسیٰ علیہ السلام کے پاس سے گزراتو انہوں نے پوچھا کس چیز کا آپ کو حکم ہوا ؟ میں نے کہا کہ روزانہ پچاس وقت کی نماز وں کا ، موسیٰ علیہ السلام نے فرمایا لیکن آپ کی امت میں اتنی طاقت نہیں ہے ۔ اس سے پہلے میرا واسطہ لوگوں سے پڑچکا ہے اور بنی اسرائیل کا مجھے تلخ تجربہ ہے ۔ اس لئے آپ اپنے رب کے حضور میں دوبارہ جائیے اور اپنی امت پر تخفیف کے لئے عرض کیجئے ۔ چنانچہ میں اللہ تعالیٰ کے دربار میں دوبارہ حاضر ہوا اور تخفیف کے لئے عرض کی تو دس وقت کی نمازیں کم کر دی گئیں ۔ پھر میں جب واپسی میں موسیٰ علیہ السلام کے پاس سے گزرا تو انہوں نے پھر وہی سوال کیا میں دوبارہ بارگاہ رب تعالیٰ میں حاضر ہوا اور اس مرتبہ بھی دس وقت کی نمازیں کم ہوئیں ۔ پھر میں موسیٰ علیہ السلام کے پاس سے گزرا اور تو انہوں نے وہی مطالبہ کیا میں نے اس مرتبہ بھی بار گاہ رب تعالیٰ میں حاضر ہو کر دس وقت کی نمازیں کم کرائیں ، موسٰی علیہ السلام کے پاس سے پھر گزرا انہوں نے اپنی رائے کا اظہار کیا پھر بارگاہ الٰہی میں حاضر ہوا تو مجھے دس وقت کی نمازوں کا حکم ہوا میں واپس ہونے لگا تو آپ نے پھر وہی کہا اب بارگاہ الٰہی میں حاضرہو اتو روزانہ صرف پانچ وقت کی نمازوں کا حکم باقی رہا ۔ موسیٰ علیہ السلام کے پاس آیا تو آپ نے دریافت فرمایا اب کیاحکم ہوا ؟ میں نے حضرت موسیٰ علیہ السلام کو بتایا کہ روزانہ پانچ وقت کی نمازوں کا حکم ہوا ہے ۔ فرمایا کہ آپ کی امت اس کی بھی طاقت نہیں رکھتی میرا واسطہ آپ سے پہلے لوگوں سے پڑ چکا ہے اور بنی اسرائیل کا مجھے تلخ تجربہ ہے ۔ اپنے رب کے دربار میں پھر حاضر ہو کر تخفیف کے لئے عرض کیجئے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا رب تعالیٰ سے میں بہت سوال کر چکا اور اب مجھے شرم آتی ہے ۔ اب میں بس اسی پر راضی ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر جب میں وہاں سے گزرنے لگا تو ندا آئی ” میں نے اپنا فریضہ جاری کر دیا اور اپنے بندوں پر تخفیف کر چکا ۔ “</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 135220,
        "last_updated": null
    },
    {
        "urduURN": 4038470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3888,
        "hadithSanad": "ہم سے حمیدی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینا رنے بیان کیا ، ان سے عکرمہ نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہمانے",
        "hadithText": "اللہ کے ارشاد وما جعلنا الرؤيا التي أريناك إلا فتنۃ للناس‏ ( اور جو خواب ہم نے آپ کو دکھایا اس سے مقصد صرف لوگوں کا امتحان تھا ) فرمایا کہ اس میں رؤیا سے آنکھ سے دیکھنا ہی مراد ہے ۔ جو رسول اللہ صلی اللہ علیہ وسلم کو اس معراج کی رات میں د کھایا گیا تھا جس میں آپ کو بیت المقدس تک لے جایا گیا تھا اور قرآن مجید میں ” الشجرۃ الملعونۃ “ کا ذکر آیا ہے وہ تھوہڑ کا درخت ہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 113,
        "matchingArabicURN": 135230,
        "last_updated": null
    },
    {
        "urduURN": 4038480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3889,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے بیان کیا ، ان سے ابن شہاب نے ( دوسری سند ) ، امام بخاری نے کہا اور ہم سے احمد بن صالح نے بیان کیا ، کہا ہم سے عنبسہ بن خالد نے بیان کیا ، ہم سے یونس بن یزید نے بیان کیا ، ان سے ابن شہاب نے بیان کیا کہ مجھے عبدالرحمٰن بن عبداللہ بن کعب بن مالک نے خبر دی اور انہیں عبداللہ بن کعب نے جب وہ نابینا ہو گئے تو وہ چلتے پھر تے وقت ان کو پکڑ کر لے چلتے تھے ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نے کعب بن مالک رضی اللہ عنہ سے سنا کہ وہ غزوہ تبوک میں شریک نہ ہونے کا طویل واقعہ بیان کرتے تھے ابن بکیر نے اپنی روایت میں بیان کیا کہ حضرت کعب نے کہا کہ میں نبی کریم صلی اللہ علیہ وسلم کے پاس عقبہ کی رات میں حاضر تھا جب ہم نے اسلام پر قائم رہنے کا پختہ عہد کیا تھا ، میرے نزدیک ( لیلۃالعقبہ کی بیعت ) بدر کی لڑائی میں حاضری سے بھی زیادہ پسندیدہ ہے اگرچہ لوگوں میں بدر کا چرچہ اس سے زیادہ ہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 114,
        "matchingArabicURN": 135240,
        "last_updated": null
    },
    {
        "urduURN": 4038490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3890,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا کہ عمرو بن دینار کہا کرتے تھے کہ میں نے حضرت جابر بن عبداللہ رضی اللہ عنہما سے سنا انہوں نے بیان کیا کہ",
        "hadithText": "میرے دوماموں مجھے بھی بیعت عقبہ میں ساتھ لے گئے تھے ۔ ابوعبداللہ امام بخاری نے کہا کہ ابن عیینہ نے بیان کیا ان میں سے ایک حضرت براء بن معروررضی اللہ عنہ تھے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 115,
        "matchingArabicURN": 135250,
        "last_updated": null
    },
    {
        "urduURN": 4038500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3891,
        "hadithSanad": "مجھ سے ابراہیم بن موسیٰ نے بیان کیا ، کہا ہم کو ہشام بن یوسف نے خبر دی ، انہیں ابن جریج نے خبر دی ، ان سے عطاء نے بیان کیا کہ",
        "hadithText": "حضرت جابر رضی اللہ عنہ نے کہا میں ، میرے والد اور میرے دو ماموں تینوں بیعت عقبہ کرنے والوں میں شریک تھے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 116,
        "matchingArabicURN": 135260,
        "last_updated": null
    },
    {
        "urduURN": 4038510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3892,
        "hadithSanad": "مجھ سے اسحاق بن منصور نے بیان کیا ، انہوں نے کہا ہم کو یعقوب بن ابراہیم نے خبر دی ، انہوں نے کہا ہم سے ہمارے بھتیجے ابن شہاب نے بیان کیا ، ان سے ان کے چچا نے بیان کیا اور انہوں نے کہا کہ",
        "hadithText": "ہمیں ابو ادریس عائذ اللہ بن عبداللہ نے خبر دی کہ حضرت عبادہ بن صامت رضی اللہ عنہ ان صحابہ میں سے تھے جنہوں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ بدر کی لڑائی میں شرکت کی تھی اور عقبہ کی رات آنحضرت صلی اللہ علیہ وسلم سے عہد کیا تھا ، انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اس وقت آپ کے پاس صحابہ کی ایک جماعت تھی ، کہ آؤ مجھ سے اس بات کاعہد کرو کہ اللہ کے ساتھ کسی کو شریک نہ ٹھہراؤگے ، چوری نہ کرو گے ، زنا نہ کرو گے ، اپنی اولاد کو قتل نہ کرو گے ، اپنی طرف سے گھڑ کر کسی پر تہمت نہ لگاؤ گے اور اچھی باتو ں میں میری نافرمانی نہ کرو گے ، پس جو شخص اپنے اس عہد پر قائم رہے گا اس کا اجر اللہ کے ذمہ ہے اور جس شخص نے اس میں کمی کی اور اللہ تعا لیٰ نے اسے چھپارہنے دیا تو اس کا معاملہ اللہ کے اختیار میں ہے ، چاہے تو اس پر سزا دے اور چاہے معاف کر دے ۔ حضرت عبادہ رضی اللہ عنہ نے بیان کیا چنانچہ میں نے آنحضرت صلی اللہ علیہ وسلم سے ان امور پر بیعت کی ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 117,
        "matchingArabicURN": 135270,
        "last_updated": null
    },
    {
        "urduURN": 4038520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3893,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث بن سعید نے ، ان سے یزید بن ابی حبیب نے ، ان سے ابو الخیر مرثد بن عبداللہ نے ، ان سے عبدالرحمٰن صنابحی نے اور ان سے عبادہ بن صامت رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں ان نقیبوں میں سے تھا جنہوں نے ( عقبہ کی رات میں ) رسول اللہ صلی اللہ علیہ وسلم سے بیعت کی تھی ۔ آپ نے بیان کیا کہ ہم نے آنحضرت صلی اللہ علیہ وسلم سے اس کا عہد کیا تھا کہ ہم اللہ کے ساتھ کسی کو شریک نہیں ٹھہرائیں گے ، چوری نہیں کریں گے ، زنا نہیں کریں گے ، کسی ایسے شخص کو قتل نہیں کریں گے جس کا قتل اللہ تعالیٰ نے حرام قرار دیا ہے ، لوٹ مار نہیں کریں گے اور نہ اللہ کی نافرمانی کریں گے جنت کے بدلے میں ، اگر ہم اپنے عہد میں پورے اترے ۔ لیکن اگر ہم نے اس میں کچھ خلاف کیا تو اس کا فیصلہ اللہ پر ہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 118,
        "matchingArabicURN": 135280,
        "last_updated": null
    },
    {
        "urduURN": 4038530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3894,
        "hadithSanad": "مجھ سے فروہ بن ابی المغراء نے بیان کیا ، کہا ہم سے علی بن مسہر نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم سے میرا نکاح جب ہوا تو میری عمر چھ سال کی تھی ، پھر ہم مدینہ ( ہجرت کر کے ) آئے اور بنی حارث بن خزرج کے یہاں قیام کیا ۔ یہاں آ کر مجھے بخار چڑھا اور اس کی وجہ سے میرے بال گرنے لگے ۔ پھر مونڈھوں تک خوب بال ہو گئے پھر ایک دن میری والدہ ام رومان رضی اللہ عنہا آئیں ، اس وقت میں اپنی چند سہیلیوں کے ساتھ جھولا جھول رہی تھی انہوں نے مجھے پکا را تو میں حاضر ہو گئی ۔ مجھے کچھ معلوم نہیں تھا کہ میرے ساتھ ان کا کیا ارادہ ہے ۔ آخر انہوں نے میرا ہاتھ پکڑ کر گھر کے دروازہ کے پاس کھڑا کر دیا اور میرا سانس پھولا جا رہا تھا ۔ تھوڑی دیر میں جب مجھے کچھ سکون ہوا تو انہوں نے تھوڑا سا پانی لے کر میرے منہ اور سر پر پھیرا ۔ پھر گھر کے اندر مجھے لے گئیں ۔ وہاں انصار کی چند عورتیں موجود تھیں ، جنہوںنے مجھے دیکھ کر دعا دی کہ خیر و برکت اور اچھا نصیب لے کر آئی ہو ، میری ماں نے مجھے انہیں کے حوالہ کر دیا اور انہوں نے میری آرائش کی ۔ اس کے بعد دن چڑھے اچانک رسول اللہ صلی اللہ علیہ وسلم میرے پاس تشریف لائے اور انہوں نے مجھے آپ کے سپرد کر دیا میری عمر اس وقت نو سال تھی ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 119,
        "matchingArabicURN": 135290,
        "last_updated": null
    },
    {
        "urduURN": 4038540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3895,
        "hadithSanad": "ہم سے معلی نے بیان کیا ، کہا ہم سے وہیب بن خالد نے بیان کیا ، ان سے ہشام بن عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا تم مجھے دو مرتبہ خواب میں دکھائی گئی ہو ۔ میں نے دیکھا کہ تم ایک ریشمی کپڑے میں لپٹی ہوئی ہو اور کہا جا رہا ہے کہ یہ آپ کی بیوی ہیں ، ان کا چہرہ کھولئے ۔ میں نے چہرہ کھول کردیکھا تو تم تھیں ، میں نے سوچا کہ اگر یہ خواب اللہ تعالیٰ کی جانب سے ہے تو وہ خود اس کو پورا فرمائے گا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 120,
        "matchingArabicURN": 135300,
        "last_updated": null
    },
    {
        "urduURN": 4038550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3896,
        "hadithSanad": "مجھ سے عبید بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد ( عروہ بن زبیر ) نے بیان کیا کہ",
        "hadithText": "حضرت خدیجہ رضی اللہ عنہا کی وفات نبی کریم صلی اللہ علیہ وسلم کی مدینہ کو ہجرت سے تین سال پہلے ہو گئی تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے آپ کی وفات کے تقریباً دو سال بعد حضرت عائشہ رضی اللہ عنہا سے نکاح کیا اس وقت ان کی عمر چھ سال تھی جب رخصتی ہوئی تو وہ نوسال کی تھیں ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 121,
        "matchingArabicURN": 135310,
        "last_updated": null
    },
    {
        "urduURN": 4038560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3897,
        "hadithSanad": "ہم سے ( عبداللہ بن زبیر ) حمیدی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے اعمش نے بیان کیا ، کہا کہ میں نے ابووائل شقیق بن سلمہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "ہم خباب بن ارت رضی اللہ عنہ کی عیادت کے لئے گئے تو انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ ہم نے صرف اللہ کی خوشنودی حاصل کرنے کے لئے ہجرت کی تھی ، اللہ تعالیٰ ہمیں اس کا اجر دے گا ۔ پھر ہمارے بہت سے ساتھی اس دنیا سے اٹھ گئے اور انہوں نے ( دنیا میں ) اپنے اعمال کا پھل نہیں دیکھا ۔ انہیں میں حضرت مصعب بن عمیر رضی اللہ عنہ احد کی لڑائی میں شہید کئے گئے تھے اور صرف ایک دھاری دار چادر چھوڑی تھی ۔ ( کفن دیتے وقت ) جب ہم ان کی چادر سے ان کا سر ڈھانکتے تو پاؤں کھل جاتے اور پاؤں ڈھانکتے تو سر کھل جاتا ۔ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں حکم دیا کہ ان کا سر ڈھانک دیں اور پاؤں پر اذخر گھاس ڈال دیں ۔ ( تاکہ چھپ جائیں ) اور ہم میں ایسے بھی ہیں کہ ( اس دنیا میں بھی ) ان کے اعمال کا میوہ پک گیا ، پس وہ اس کو چن رہے ہیں ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 122,
        "matchingArabicURN": 135320,
        "last_updated": null
    },
    {
        "urduURN": 4038570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3898,
        "hadithSanad": "ہم سے مسدد بن مسر ہد نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے یحییٰ بن سعید انصاری نے ، ان سے محمد بن ابراہیم نے ، ان سے علقمہ بن ابی وقاص نے ، بیان کیا کہ میں نے حضرت عمر رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے کہ اعمال نیت پر موقوف ہیں ۔ پس جس کا مقصد ہجرت سے دنیا کمانا ہو وہ اپنے اسی مقصد کو حاصل کر سکے گا یا مقصد ہجرت سے کسی عورت سے شادی کرنا ہو تو وہ بھی اپنے مقصد تک پہنچ سکے گا ، لیکن جن کا ہجرت سے مقصد اللہ اور اس کے رسول کی رضامندی ہو گی تو اسی کی ہجرت اللہ اور اس کے رسول کے لئے سمجھی جائے گی ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 123,
        "matchingArabicURN": 135330,
        "last_updated": null
    },
    {
        "urduURN": 4038580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3899,
        "hadithSanad": "مجھ سے اسحاق بن یزید دمشقی نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ بن حمزہ نے بیاں کیا ، انہوں نے کہا کہ مجھ سے ابوعمرو اوزاعی نے بیان کیا ، انہوں نے کہا کہ ہم سے عبدہ بن ابی لبابہ نے بیان کیا ، ان سے مجاہد بن جبر مکی نے بیان کیا کہ",
        "hadithText": "حضرت عبداللہ بن عمر رضی اللہ عنہما کہا کرتے تھے کہ فتح مکہ کے بعد ( مکہ سے مدینہ کی طرف ) ہجرت باقی نہیں رہی ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 124,
        "matchingArabicURN": 135340,
        "last_updated": null
    },
    {
        "urduURN": 4038590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3900,
        "hadithSanad": "مجھ سے اوزاعی نے بیان کیا ، ان سے عطاء  بن ابی رباح نے بیان کیا کہ",
        "hadithText": "عبید بن عمیر لیثی کے ساتھ میں حضرت عائشہ رضی اللہ عنہا کی خدمت میں حاضر ہوا اور ہم نے ان سے فتح مکہ کے بعد ہجرت کے متعلق پوچھا ۔ انہوں نے کہا کہ ایک وقت تھا جب مسلمان اپنے دین کی حفاظت کے لئے اللہ تعالیٰ اور اس کے رسول صلی اللہ علیہ وسلم کی طرف عہد کر کے آتا تھا ، اس خطرہ کی وجہ سے کہ کہیں وہ فتنہ میں نہ پڑ جائے لیکن اب اللہ تعالیٰ نے اسلام کو غالب کر دیا ہے اور آ ج ( سرزمین عرب میں ) انسان جہاں بھی چاہے اپنے رب کی عبادت کر سکتا ہے ، البتہ جہاد اور نیت ثواب باقی ہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 125,
        "matchingArabicURN": 135350,
        "last_updated": null
    },
    {
        "urduURN": 4038600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3901,
        "hadithSanad": "مجھ سے زکریابن یحییٰ نے بیان کیا ، کہا ہم سے عبداللہ بن نمیر نے بیان کیا ، کہا کہ ہشام نے بیان کیا کہ انہیں ان کے والد نے خبر دی اور انہیں عائشہ رضی اللہ عنہا نے کہ سعد بن معاذ رضی اللہ عنہ نے کہا کہ",
        "hadithText": "اے اللہ ! تو جانتا ہے کہ اس سے زیادہ مجھے اور کوئی چیز پسندیدہ نہیں کہ تیرے راستے میں ، میں اس قوم سے جہاد کروں جس نے تیرے رسول صلی اللہ علیہ وسلم کی تکذیب کی اور انہیں ( ان کے وطن مکہ سے ) نکالا اے اللہ ! لیکن ایسا معلوم ہوتا ہے کہ تو نے ہمارے اور ان کے درمیان لڑائی کا سلسلہ ختم کر دیا ہے ۔ اور ابان بن یزید نے بیان کیا ، ان سے ہشام نے بیان کیا ، ان سے ان کے والد نے اور انہیں حضرت عائشہ رضی اللہ عنہا نے خبر دی کہ ( یہ الفاظ سعد رضی اللہ عنہ فرماتے تھے ) من قوم کذبوا نبیک اخرجوہ من قریش ۔ یعنی جنہوں نے تیرے رسول صلی اللہ علیہ وسلم کو جھٹلایا ۔ باہر نکال دیا ۔ اس سے قریش کے کافر مراد ہیں ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 126,
        "matchingArabicURN": 135360,
        "last_updated": null
    },
    {
        "urduURN": 4038610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3902,
        "hadithSanad": "ہم سے مطر بن فضل نے بیان کیا ، کہا ہم سے روح نے بیان کیا ، ان سے ہشام نے بیان کیا ، ان سے عکرمہ نے بیان کیا اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کو چالیس سال کی عمر میں رسول بنایا گیا تھا ۔ پھر آپ پر مکہ مکرمہ میں تیرہ سال تک وحی آتی رہی اس کے بعد آپ کو ہجرت کا حکم ہوا اور آپ نے ہجرت کی حالت میں دس سال گزارے ، ( مدینہ میں ) جب آپ کی وفات ہوئی تو آپ کی عمر تریسٹھ سال کی تھی ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 127,
        "matchingArabicURN": 135370,
        "last_updated": null
    },
    {
        "urduURN": 4038620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3903,
        "hadithSanad": "مجھ سے مطر بن فضل نے بیان کیا ، کہا ہم سے روح بن عبادہ نے بیان کیا ، کہا ہم سے زکریابن اسحاق نے بیان کیا ، ان سے عمرو بن دینار نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے نبوت کے بعد مکہ میں تیرہ سال قیام کیا اور جب آپ کی وفات ہوئی تو آپ کی عمر تریسٹھ سال کی تھی ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 128,
        "matchingArabicURN": 135380,
        "last_updated": null
    },
    {
        "urduURN": 4038630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3904,
        "hadithSanad": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے مالک نے بیان کیا ، ان سے عمر بن عبیداللہ کے مولیٰ ابو النضر نے ، ان سے عبید یعنی ابن حنین نے اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم منبر پر بیٹھے ، فرمایا اپنے ایک نیک بندے کو اللہ تعالیٰ نے اختیار دیا کہ دنیا کی نعمتوں میں سے جو وہ چاہے اسے اپنے لئے پسند کر لے یا جو اللہ تعالیٰ کے یہاں ہے ( آخرت میں ) اسے پسند کر لے ۔ اس بندے نے اللہ تعالیٰ کے ہاں ملنے والی چیز کو پسند کر لیا ۔ اس پر حضرت ابوبکر رضی اللہ عنہ رونے لگے اور عرض کیا ہمارے ماں باپ آپ پر فدا ہوں ۔ ( حضرت ابوسعید رضی اللہ عنہ کہتے ہیں ) ہمیں حضرت ابوبکر رضی اللہ عنہ کے اس رونے پر حیرت ہوئی ، بعض لوگوں نے کہا اس بزرگ کو دیکھئیے حضور صلی اللہ علیہ وسلم تو ایک بندے کے متعلق خبر دے رہے ہیں جسے اللہ تعالیٰ نے دنیا کی نعمتوں اور جو اللہ کے پاس ہے اس میں سے کسی کے پسند کرنے کا اختیار دیا تھا اور یہ کہہ رہے ہیں کہ ہمارے ماں باپ حضور پر فدا ہوں ۔ لیکن رسول اللہ صلی اللہ علیہ وسلم ہی کو ان دو چیزوں میں سے ایک کا اختیار دیا گیا اور حضرت ابوبکر رضی اللہ عنہ ہم میں سب سے زیادہ اس بات سے واقف تھے اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا کہ لوگوں میں سب سے زیادہ اپنی صحبت اور مال کے ذریعہ مجھ پراحسان کرنے والے ابوبکر ہیں ۔ اگر میں اپنی امت میں سے کسی کو اپنا خلیل بنا سکتا تو ابوبکر رضی اللہ عنہ کو بناتا البتہ اسلامی رشتہ ان کے ساتھ کافی ہے ۔ مسجد میں کوئی دروازہ اب کھلا ہوا باقی نہ رکھا جائے سوائے ابوبکر رضی اللہ عنہ کے گھر کی طرف کھلنے والے دروازے کے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 129,
        "matchingArabicURN": 135390,
        "last_updated": null
    },
    {
        "urduURN": 4038640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3905,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے کہ ابن شہاب نے بیان کیا ، انہیں عروہ بن زبیر نے خبر دی اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "جب سے میں نے ہوش سنبھالا میں نے اپنے ماں باپ کو دین اسلام ہی پر پایا اور کوئی دن ایسا نہیں گزرتا تھا جس میں رسول کریم صلی اللہ علیہ وسلم ہمارے گھر صبح و شام دونوں وقت تشریف نہ لاتے ہوں ، پھر جب ( مکہ میں ) مسلمانوں کو ستایا جانے لگا تو حضرت ابوبکر رضی اللہ عنہ حبشہ کی ہجرت کا ارادہ کر کے نکلے ۔ جب آپ مقام برک غماد پر پہنچے تو آپ کی ملاقات ابن الدغنہ سے ہوئی جو قبیلہ قارہ کا سردار تھا ۔ اس نے پوچھا ابوبکر ( رضی اللہ عنہ ) ! کہاں کا ارادہ ہے ؟ انہوں نے کہا کہ میری قوم نے مجھے نکال دیا ہے اب میں نے ارادہ کر لیا ہے کہ ملک ملک کی سیاحت کروں ( اور آزادی کے ساتھ ) اپنے رب کی عبادت کروں ۔ ابن الدغنہ نے کہا لیکن ابوبکر ! تم جیسے انسان کو اپنے وطن سے نہ خود نکلنا چاہئے اور نہ اسے نکالا جانا چاہیے ۔ تم محتاجوں کی مدد کرتے ہو ، صلہ رحمی کرتے ہو ۔ بے کسوں کا بوجھ اٹھاتے ہو ، مہمان نوازی کرتے ہو اور حق پر قائم رہنے کی وجہ سے کسی پر آنے والی مصیبتوں میں اس کی مدد کرتے ہو ، میں تمہیں پناہ دیتا ہوں واپس چلو اور اپنے شہر ہی میں اپنے رب کی عبادت کرو ۔ چنانچہ وہ واپس آ گئے اور ابن الدغنہ بھی آپ کے ساتھ واپس آیا ۔ اس کے بعد ابن الدغنہ قریش کے تمام سرداروں کے یہاں شام کے وقت گیا اور سب سے اس نے کہا کہ ابوبکر ( رضی اللہ عنہ ) جیسے شخص کو نہ خود نکلنا چاہیے اور نہ نکالا جانا چا ہیے کیا تم ایسے شخص کو نکال دو گے جو محتاجوں کی امداد کرتا ہے ، صلہ رحمی کرتا ہے ، بے کسوں کا بوجھ اٹھا تا ہے ، مہمان نوازی کرتا ہے اور حق کی وجہ سے کسی پر آنے والی مصیبتوں میں اس کی مدد کرتا ہے ؟ قریش نے ابن الدغنہ کی پناہ سے انکا ر نہیں کیا صرف اتنا کہا کہ ابوبکر رضی اللہ عنہ سے کہہ دو ، کہ اپنے رب کی عبادت اپنے گھر کے اندر ہی کیا کریں ، وہیں نماز پڑھیں اور جو جی چاہے وہیں پڑھیں ، اپنی عبادات سے ہمیں تکلیف نہ پہنچا ئیں ، اس کا اظہار نہ کریں کیونکہ ہمیں اس کا ڈر ہے کہ کہیں ہماری عورتیں اور بچے اس فتنہ میں نہ مبتلا ہو جائیں ۔ یہ باتیں ابن الدغنہ نے حضرت ابوبکر رضی اللہ عنہ سے بھی آ کر کہہ دیں کچھ دنوں تک تو آپ اس پر قائم رہے اور اپنے گھر کے اندر ہی اپنے رب کی عبادت کرتے رہے ، نہ نماز بر سر عام پڑھتے اور نہ گھر کے سوا کسی اورجگہ تلاوت قرآن کرتے تھے لیکن پھر انہوں نے کچھ سوچا اور اپنے گھر کے سامنے نماز پڑھنے کے لئے ایک جگہ بنائی جہاں آپ نے نماز پڑھنی شروع کی اور تلاوت قرآن بھی وہیں کرنے لگے ، نتیجہ یہ ہوا کہ وہاں مشرکین کی عورتوں اور بچوں کا مجمع ہونے لگا ۔ وہ سب حیرت اور پسندیدگی کے ساتھ دیکھتے رہا کرتے تھے ۔ حضرت ابوبکر رضی اللہ عنہ بڑے نرم دل انسان تھے ۔ جب قرآن مجید کی تلاوت کرتے تو آنسو ؤں کو روک نہ سکتے تھے ۔ اس صورت حال سے مشرکین قریش کے سردار گھبراگئے اور انہوں نے ابن الدغنہ کو بلا بھیجا ، جب ابن الدغنہ ان کے پاس آیا تو انہوں نے اس سے کہا کہ ہم نے ابوبکر کے لئے تمہاری پناہ اس شرط کے ساتھ تسلیم کی تھی کہ اپنے رب کی عبادت وہ اپنے گھر کے اندر کیا کریں لیکن انہوں نے شرط کی خلاف ورزی کی ہے اور اپنے گھر کے سامنے نماز پڑھنے کے لئے ایک جگہ بنا کر برسر عام نماز پڑھنے اور تلاوت قرآن کرنے لگے ہیں ۔ ہمیں اس کا ڈر ہے کہ کہیں ہماری عورتیں اور بچے اس فتنے میں نہ مبتلا ہو جائیں اس لئے تم انہیں روک دو ، اگر انہیں یہ شرط منظور ہو کہ اپنے رب کی عبادت صرف اپنے گھر کے اندر ہی کیا کریں تو وہ ایسا کر سکتے ہیں لیکن اگر وہ اظہار ہی کریں تو ان سے کہو کہ تمہاری پناہ واپس دے دیں ، کیونکہ ہمیں یہ پسند نہیں کہ تمہاری دی ہوئی پناہ میں ہم دخل اندازی کریں لیکن ابوبکر کے اس اظہار کو بھی ہم برداشت نہیں کر سکتے ۔ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر ابن الدغنہ ابوبکر رضی اللہ عنہ کے یہاں آیا اور اس نے کہا کہ جس شرط کے ساتھ میں نے آپ کے ساتھ عہد کیا تھا وہ آپ کو معلوم ہے ، اب یا آپ اس شرط پر قائم رہیے یا پھر میرے عہد کو واپس کیجئے کیونکہ یہ مجھے گوار ا نہیں کہ عرب کے کانوں تک یہ بات پہنچے کہ میں نے ایک شخص کو پناہ دی تھی ۔ لیکن اس میں ( قریش کی طرف سے ) دخل اندازی کی گئی ۔ اس پر حضرت ابوبکر رضی اللہ عنہ نے کہا میں تمہاری پناہ واپس کرتا ہوں اور اپنے رب عزوجل کی پناہ پر راضی اور خوش ہوں ۔ حضور صلی اللہ علیہ وسلم ان دنوں مکہ میں تشریف رکھتے تھے ۔ آپ نے مسلمانوں سے فرمایا کہ تمہاری ہجرت کی جگہ مجھے خواب میں دکھائی گئی ہے وہا ں کھجور کے باغات ہیں اور دو پتھریلے میدانوں کے درمیان واقع ہے ، چنانچہ جنہیں ہجرت کرنی تھی انہوں نے مدینہ کی طرف ہجرت کی اور جو لوگ سرزمین حبشہ ہجرت کر کے چلے گئے تھے وہ بھی مدینہ چلے آئے ، حضرت ابوبکر رضی اللہ عنہ نے بھی مدینہ ہجرت کی تیار ی شروع کر دی لیکن حضور صلی اللہ علیہ وسلم نے ان سے فرمایا کہ کچھ دنوں کے لئے توقف کرو ۔ مجھے توقع ہے کہ ہجرت کی اجازت مجھے بھی مل جائے گی ۔ ابوبکر رضی اللہ عنہ نے عرض کیا کیا واقعی آپ کو بھی اس کی توقع ہے ، میرے باپ آپ پر فدا ہوں ۔ حضور صلی اللہ علیہ وسلم نے فرمایا کہ ہاں ۔ حضرت ابوبکر رضی اللہ عنہ نے حضور صلی اللہ علیہ وسلم کی رفاقت سفر کے خیال سے اپنا ارادہ ملتوی کر دیا اور دو اونٹنیوں کو جو ان کے پاس تھیں کیکر کے پتے کھلا کر تیار کرنے لگے چار مہینے تک ۔ ابن شہاب نے بیان کیا ، ان سے عروہ نے کہ حضرت عائشہ رضی اللہ عنہا نے کہا ، ایک دن ہم ابوبکر رضی اللہ عنہ کے گھر بیٹھے ہوئے تھے بھری دوپہر تھی کہ کسی نے حضرت ابوبکر رضی اللہ عنہ سے کہا رسول اللہ صلی اللہ علیہ وسلم سر پر رومال ڈالے تشریف لا رہے ہیں ، حضور صلی اللہ علیہ وسلم کا معمول ہمارے یہاں اس وقت آنے کا نہیں تھا ۔ حضرت ابوبکر رضی اللہ عنہ بولے حضور صلی اللہ علیہ وسلم پر میرے ماں باپ فدا ہوں ۔ ایسے وقت میں آپ کسی خاص وجہ سے ہی تشریف لا رہے ہوں گے ، انہوں نے بیان کیا کہ پھر حضور صلی اللہ علیہ وسلم تشریف لائے اور اندر آنے کی اجازت چاہی ٰ ابوبکر رضی اللہ عنہ نے آپ کو اجازت دی تو آپ اندر داخل ہوئے پھر حضور صلی اللہ علیہ وسلم نے ان سے فرمایا اس وقت یہاں سے تھوڑی دیر کے لئے سب کو اٹھادو ۔ ابوبکر رضی اللہ عنہ نے عرض کیا یہاں اس وقت تو سب گھر کے ہی آدمی ہیں ، میرے باپ آپ پر فدا ہوں ، یا رسول اللہ ! حضور صلی اللہ علیہ وسلم نے اس کے بعد فرمایا کہ مجھے ہجرت کی اجازت دے دی گئی ہے ۔ ابوبکر رضی اللہ عنہ نے عرض کیا میرے ماں باپ آپ پر فدا ہوں یا رسول اللہ ! کیا مجھے رفاقت سفر کا شرف حاصل ہو سکے گا ؟ حضور صلی اللہ علیہ وسلم نے فرمایا کہ ہاں انہوں نے عرض کیا یا رسول اللہ ! میرے ماں باپ آپ پر فدا ہوں ان دونوں میں سے ایک اونٹنی آپ لے لیجئے ! حضور صلی اللہ علیہ وسلم نے فرمایا لیکن قیمت سے ، حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر ہم نے جلدی جلدی ان کے لئے تیاریاں شروع کر دیں اور کچھ توشہ ایک تھیلے میں رکھ دیا ۔ اسماء بنت ابی بکر رضی اللہ عنہا نے اپنے پٹکے کے ٹکڑے کر کے تھیلے کا منہ اس سے باندھ دیا اور اسی وجہ سے انکانام ذات النطاقین ( دوپٹکے والی ) پڑ گیا عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ نے جبل ثور کے غار میں پڑاؤ کیا اور تین راتیں گزاریں عبداللہ بن ابی بکر رضی اللہ عنہما رات وہیں جا کر گزارا کرتے تھے ، یہ نو جوان بہت سمجھدار تھے اور ذہین بےحد تھے ۔ سحر کے وقت وہاں سے نکل آتے اور صبح سویرے ہی مکہ پہنچ جاتے جیسے وہیں رات گزری ہو ۔ پھر جو کچھ یہاں سنتے اور جس کے ذریعہ ان حضرات کے خلاف کاروائی کے لیے کوئی تدبیر کی جاتی تو اسے محفوظ رکھتے اور جب اندھیرا چھا جاتا تو تمام اطلاعات یہاں آ کر پہنچاتے ۔ ابوبکر رضی اللہ عنہ کے غلام عامر بن فہیرہ رضی اللہ عنہ آپ ہر دو کے لئے قریب ہی دودھ دینے والی بکری چرایا کرتے تھے اور جب کچھ رات گزر جاتی تو اسے غار میں لاتے تھے ۔ آپ اسی پر رات گزارتے اس دودھ کو گرم لوہے کے ذریعہ گرم کر لیا جاتا تھا ۔ صبح منہ اندھیرے ہی عامر بن فہیرہ رضی اللہ عنہ غار سے نکل آتے تھے ان تین راتوں میں روزانہ کا ان کا یہی دستور تھا ۔ حضرت ابوبکر رضی اللہ عنہ نے بنی الدیل جو بنی عبد بن عدی کی شاخ تھی ، کے ایک شخص کو راستہ بتانے کے لئے اجرت پر اپنے ساتھ رکھا تھا ۔ یہ شخص راستوں کا بڑا ماہر تھا ۔ آل عاص بن وائل سہمی کا یہ حلیف بھی تھا اور کفار قریش کے دین پر قائم تھا ۔ ان بزرگوں نے اس پر اعتماد کیا اور اپنے دونوں اونٹ اس کے حوالے کر دیئے ۔ قرار یہ پایا تھا کہ تین راتیں گزار کر یہ شخص غار ثور میں ان سے ملاقات کرے ۔ چنانچہ تیسری رات کی صبح کو وہ دونوں اونٹ لے کر ( آ گیا ) اب عامر بن فہیرہ رضی اللہ عنہ اور یہ راستہ بتانے والا ان حضرات کو ساتھ لے کر روانہ ہوئے ساحل کے راستے سے ہوتے ہوئے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 130,
        "matchingArabicURN": 135400,
        "last_updated": null
    },
    {
        "urduURN": 4038650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3906,
        "hadithSanad": "ابن شہاب نے بیان کیا اور مجھے عبدالرحمٰن بن مالک مدلجی نے خبر دی ، وہ سراقہ بن مالک بن جعشم کے بھتیجے ہیں کہ ان کے والد نے انہیں خبر دی اور انہوں نے سراقہ بن جعشم رضی اللہ عنہ کو یہ کہتے سنا کہ",
        "hadithText": "ہمارے پاس کفار قریش کے قاصد آئے اور یہ پیش کش کی کہ رسول اللہ صلی اللہ علیہ وسلم اور حضرت ابوبکر رضی اللہ عنہ کو اگر کوئی شخص قتل کر دے یا قید کر لائے تو اسے ہر ایک کے بدلے میں ایک سو اونٹ دیئے جائیں گے ۔ میں اپنی قوم بنی مدلج کی ایک مجلس میں بیٹھا ہوا تھا کہ ان کا ایک آدمی سامنے آیااور ہمارے قریب کھڑا ہو گیا ۔ ہم ابھی بیٹھے ہوئے تھے ۔ اس نے کہا سراقہ ! ساحل پر میں ابھی چند سائے دیکھ کر آ رہا ہوں میرا خیال ہے کہ وہ محمد اور ان کے ساتھی ہی ہیں ( صلی اللہ علیہ وسلم ) سراقہ رضی اللہ عنہ نے کہا میں سمجھ گیا اس کا خیال صحیح ہے لیکن میں نے اس سے کہا کہ وہ لوگ نہیں ہیں میں نے فلاں فلاں آدمی کو دیکھا ہے ہمارے سامنے سے اسی طرف گئے ہیں ۔ اس کے بعد میں مجلس میں تھوڑی دیر اور بیٹھا رہا اور پھر اٹھتے ہی گھر گیا اور لونڈی سے کہا کہ میرے گھوڑے کو لے کر ٹیلے کے پیچھے چلی جائے اور وہیں میرا انتظار کرے ، اس کے بعد میں نے اپنا نیزہ اٹھایا اور گھر کی پشت کی طرف سے باہر نکل آیا میں نیزے کی نوک سے زمین پر لکیر کھینچتا ہوا چلا گیا اور اوپر کے حصے کو چھپائے ہوئے تھا ۔ ( سراقہ یہ سب کچھ اس لئے کر رہا تھا کہ کسی کو خبر نہ ہو ورنہ وہ بھی میرے انعام میں شریک ہو جائے گا ) میں گھوڑے کے پاس آ کر اس پر سوار ہوا اور صبا رفتاری کے ساتھ اسے لے چلا ، جتنی جلدی کے ساتھ بھی میرے لئے ممکن تھا ، آخر میں نے ان کو پا ہی لیا ۔ اسی وقت گھوڑے نے ٹھو کر کھائی اور مجھے زمین پر گرا دیا ۔ لیکن میں کھڑاہو گیا اور اپنا ہاتھ ترکش کی طرف بڑھایا اس میں سے تیر نکال کر میں نے فال نکالی کہ آیا میں انہیں نقصان پہنچا سکتا ہوں یا نہیں ۔ فال ( اب بھی ) وہ نکلی جسے میں پسند نہیں کرتا تھا ۔ لیکن میں دوبارہ اپنے گھوڑے پر سوار ہو گیا اور تیروں کے فال کی پرواہ نہیں کی ۔ پھر میرا گھوڑا مجھے تیزی کے ساتھ دوڑائے لئے جا رہا تھا ۔ آخر جب میں نے رسول اللہ صلی اللہ علیہ وسلم کی قرا ، ت سنی ، آنحضرت صلی اللہ علیہ وسلم میری طرف کوئی توجہ نہیں کر رہے تھے لیکن حضرت ابوبکر رضی اللہ عنہ باربار مڑ کر دیکھتے تھے ، تو میرے گھوڑے کے آگے کے دونوں پاؤں زمین میں دھنس گئے جب وہ ٹخنوں تک دھنس گیا تو میں اس کے اوپر گر پڑا اور اسے اٹھنے کے لئے ڈانٹا میں نے اسے اٹھا نے کی کوشش کی لیکن وہ اپنے پاؤں زمین سے نہیں نکال سکا ۔ بڑی مشکل سے جب اس نے پوری طرح کھڑے ہونے کی کوشش کی تو اس کے آگے کے پاؤں سے منتشر سا غبار اٹھ کر دھوئیں کی طرح آسمان کی طرف چڑھنے لگا ۔ میں نے تیروں سے فال نکالی لیکن اس مرتبہ بھی وہی فال آئی جسے میں پسند نہیں کرتا تھا ۔ اس وقت میں نے آنحضرت صلی اللہ علیہ وسلم کو امان کے لئے پکارا ۔ میری آواز پر وہ لوگ کھڑے ہو گئے اور میں اپنے گھوڑے پر سوار ہو کر ان کے پاس آیا ۔ ان تک برے ارادے کے ساتھ پہنچنے سے جس طرح مجھے روک دیا گیا تھا ، اسی سے مجھے یقین ہو گیا تھا کہ رسول اللہ صلی اللہ علیہ وسلم کی دعوت غالب آ کر رہے گی ۔ اس لئے میں نے حضور صلی اللہ علیہ وسلم سے کہا کہ آپ کی قوم نے آپ کے مارنے کے لئے سو اونٹوں کے انعام کا اعلان کیا ہے ۔ پھر میں نے آپ کو قریش کے ارادوں کی اطلاع دی ۔ میں نے ان حضرات کی خدمت میں کچھ توشہ اور سامان پیش کیا لیکن حضور صلی اللہ علیہ وسلم نے اسے قبول نہیں فرمایا مجھ سے کسی اور چیز کا بھی مطالبہ نہیں کیا صرف اتنا کہا کہ ہمارے متعلق راز داری سے کام لینا لیکن میں نے عرض کیا کہ آپ میرے لئے ایک امن کی تحریر لکھ دیجئیے ۔ حضور صلی اللہ علیہ وسلم نے عامر بن فہیرہ رضی اللہ عنہ کو حکم دیا اور انہوں نے چمڑے کے ایک رقعہ پر تحریر امن لکھ دی ۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم آگے بڑھے ۔ ابن شہاب نے بیان کیا اور انہیں عروہ بن زبیر نے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم کی ملاقات زبیر رضی اللہ عنہ سے ہوئی جو مسلمانوں کے ایک تجارتی قافلہ کے ساتھ شام سے واپس آ رہے تھے ۔ زبیر رضی اللہ عنہ نے حضور صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ کی خدمت میں سفید پوشاک پیش کی ۔ ادھر مدینہ میں بھی مسلمانوں کو حضور صلی اللہ علیہ وسلم کی مکہ سے ہجرت کی اطلاع ہو چکی تھی اور یہ لوگ روزانہ صبح کو مقام حرہ تک آتے اور انتظار کرتے رہتے لیکن دوپہر کی گرمی کی وجہ سے ( دوپہر کو ) انہیں واپس جانا پڑتا تھا ایک دن جب بہت طویل انتظار کے بعد سب لوگ آ گئے اور اپنے گھر پہنچ گئے تو ایک یہودی اپنے ایک محل پر کچھ دیکھنے چڑھا ۔ اس نے آنحضرت صلی اللہ علیہ وسلم اور آپ کے ساتھیوں کو دیکھا سفید سفید چلے آ رہے ہیں ۔ ( یا تیزی سے جلدی جلدی آ رہے ہیں ) جتنا آپ نزدیک ہو رہے تھے اتنی ہی دور سے پانی کی طرح ریتی کا چمکنا کم ہوتا جاتا ۔ یہودی بے اختیار چلا اٹھا کہ اے عرب کے لوگو ! تمہارے یہ بزرگ سردار آ گئے جن کا تمہیں انتظار تھا ۔ مسلمان ہتھیار لے کر دوڑ پڑے اور حضور صلی اللہ علیہ وسلم کا مقام حرہ پر استقبال کیا ۔ آپ نے ان کے ساتھ داہنی طرف کا راستہ اختیار کیا اور بنی عمرو بن عوف کے محلہ میں قیام کیا ۔ یہ ربیع الاول کا مہینہ اور پیر کا دن تھا ۔ ابوبکر رضی اللہ عنہ لوگوں سے ملنے کے لئے کھڑے ہو گئے اور رسول اللہ صلی اللہ علیہ وسلم خاموش بیٹھے رہے ۔ انصار کے جن لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کو اس سے پہلے نہیں دیکھا تھا ، وہ ابوبکر رضی اللہ عنہ ہی کو سلام کر رہے تھے ۔ لیکن جب حضور صلی اللہ علیہ وسلم پر دھوپ پڑنے لگی تو حضرت ابوبکر رضی اللہ عنہ نے اپنی چادر سے آنحضرت صلی اللہ علیہ وسلم پر سایہ کیا ۔ اس وقت سب لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کو پہچان لیا ۔ حضور صلی اللہ علیہ وسلم نے بنی عمرو بن عوف میں تقریباً دس راتوں تک قیام کیا اور وہ مسجد ( قباء ) جس کی بنیاد تقویٰ پر قائم ہے وہ اسی دوران میں تعمیر ہوئی اور آپ نے اس میں نماز پڑھی پھر ( جمعہ کے دن ) آنحضرت صلی اللہ علیہ وسلم اپنی اونٹنی پر سوار ہوئے اور صحابہ بھی آپ کے ساتھ پیدل روانہ ہوئے ۔ آخر آپ کی سواری مدینہ منورہ میں اس مقام پر آ کر بیٹھ گئی جہاں اب مسجدنبوی ہے ۔ اس مقام پر چند مسلمان ان دنوں نماز ادا کیا کرتے تھے ۔ یہ جگہ سہیل اور سہل ( رضی اللہ عنہما ) دو یتیم بچوں کی تھی اور کھجور کا یہاں کھلیان لگتا تھا ۔ یہ دونوں بچے حضرت اسعد بن زرارہ رضی اللہ عنہ کی پرورش میں تھے جب آپ کی اونٹنی وہاں بیٹھ گئی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ان شاء اللہ یہی ہمارے قیام کی جگہ ہو گی ۔ اس کے بعد آپ نے دونوں یتیم بچوں کو بلایا اور ان سے اس جگہ کا معاملہ کرنا چاہا تاکہ وہاں مسجد تعمیر کی جا سکے ۔ دونوں بچوں نے کہا کہ نہیں یا رسول اللہ صلی اللہ علیہ وسلم ! ہم یہ جگہ آپ کو مفت دے دیں گے ، لیکن حضورصلی اللہ علیہ وسلم نے مفت طور پر قبول کرنے سے انکار کیا ۔ زمین کی قیمت ادا کر کے لے لی اور وہیں مسجد تعمیر کی ۔ اس کی تعمیر کے وقت خود حضور صلی اللہ علیہ وسلم بھی صحابہ رضی اللہ عنہم کے ساتھ اینٹوں کے ڈھونے میں شریک تھے ۔ اینٹ ڈھوتے وقت آپ فرماتے جاتے تھے کہ ” یہ بوجھ خیبر کے بوجھ نہیں ہیں بلکہ اس کا اجر و ثواب اللہ کے یہاں باقی رہنے والا ہے اس میں بہت طہارت اور پاکی ہے “ اور آنحضرت صلی اللہ علیہ وسلم دعا فرما تے تھے کہ ” اے اللہ ! اجر تو بس آخرت ہی کا ہے پس ، تو انصار اور مہاجرین پر اپنی رحمت نازل فرما “ اس طرح آپ نے ایک مسلمان شاعر کا شعر پڑھا جن کا نام مجھے معلوم نہیں ، ابن شہاب نے بیان کیا کہ احادیث سے ہمیں یہ اب تک معلوم نہیں ہوا کہ آنحضرت صلی اللہ علیہ وسلم نے اس شعر کے سوا کسی بھی شاعر کے پورے شعر کو کسی موقعہ پر پڑھا ہو ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 131,
        "matchingArabicURN": 135410,
        "last_updated": null
    },
    {
        "urduURN": 4038660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3907,
        "hadithSanad": "ہم سے عبداللہ بن ابی شیبہ نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے والد اور فاطمہ بنت منذر نے اور ان سے اسماء رضی اللہ عنہا نے کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم اور حضرت ابوبکر رضی اللہ عنہ مدینہ ہجرت کر کے جانے لگے تو میں نے آپ دونوں کے لئے ناشتہ تیار کیا ۔ میں نے اپنے والد ( حضرت ابوبکر رضی اللہ عنہ ) سے کہا کہ میرے پٹکے کے سوا اور کوئی چیز اس وقت میرے پاس ایسی نہیں جس سے میں اس ناشتہ کو باندھ دوں ۔ اس پر انہوں نے کہا کہ پھر اس کے دو ٹکڑے کر لو ۔ چنانچہ میں نے ایسا ہی کیا اور اس وقت سے میرا نام ذات النطاقین ( دو پٹکوں والی ) ہو گیا اور ابن عباس رضی اللہ عنہما نے اسماء کو ذات النطاق کہا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 132,
        "matchingArabicURN": 135420,
        "last_updated": null
    },
    {
        "urduURN": 4038670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3908,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ابواسحاق نے ، کہا میں نے براء  بن عازب رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم مدینہ کے لیے روانہ ہوئے تو سراقہ بن مالک بن جعشم نے آپ کا پیچھا کیا آنحضرت صلی اللہ علیہ وسلم نے اس کے لیے بددعا کی تو اس کا گھوڑا زمین میں دھنس گیا ، اس نے عرض کیا کہ میرے لئے اللہ سے دعا کیجئے ( کہ اس مصیبت سے نجات دے ) میں آپ کا کوئی نقصان نہیں کروں گا ، آپ نے اس کے لیے دعا کی ۔ ( اس کا گھوڑا زمین سے نکل آیا ) رسول اللہ صلی اللہ علیہ وسلم کو ایک مرتبہ راستے میں پیاس معلوم ہوئی اتنے میں ایک چرواہا گزرا ۔ ابوبکر رضی اللہ عنہ نے بیان کیا کہ پھر میں نے ایک پیالہ لیا اور اس میں ( ریوڑ کی ایک بکری کا ) تھوڑا سا دودھ دوہا ، وہ دودھ میں نے آپ کی خدمت میں لا کر پیش کیا جسے آپ نے نوش فرمایا کہ مجھے خوشی حاصل ہوئی ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 133,
        "matchingArabicURN": 135430,
        "last_updated": null
    },
    {
        "urduURN": 4038680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3909,
        "hadithSanad": "مجھ سے زکریابن یحییٰ نے بیان کیا ، ان سے ابواسامہ نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت اسماء رضی اللہ عنہا نے کہ",
        "hadithText": "عبداللہ بن زبیر رضی اللہ عنہما ان کے پیٹ میں تھے ، انہیں دنوں جب حمل کی مدت بھی پوری ہو چکی تھی ، میں مدینہ کے لئے روانہ ہوئی یہاں پہنچ کر میں نے قباء میں پڑاؤ کیا اور یہیں عبداللہ رضی اللہ عنہ پیدا ہوئے ۔ پھر میں انہیں لے کر رسول کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور آپ کی گود میں اسے رکھ دیا ۔ آنحضرت صلی اللہ علیہ وسلم نے ایک کھجور طلب فرمائی اور اسے چبا کر آپ نے عبداللہ رضی اللہ عنہ کے منہ میں اسے رکھ دیا ۔ چنانچہ سب سے پہلی چیز جو عبداللہ رضی اللہ عنہ کے پیٹ میں داخل ہوئی وہ حضور صلی اللہ علیہ وسلم کا مبارک لعاب تھا ۔ اس کے بعد آپ نے ان کے لئے دعا فرمائی اور اللہ سے ان کے لئے برکت طلب کی ۔ عبداللہ رضی اللہ عنہ سب سے پہلے بچے ہیں جن کی پیدائش ہجرت کے بعد ہوئی ۔ زکریا کے ساتھ اس روایت کی متا بعت خالد بن مخلد نے کی ہے ۔ ان سے علی بن مسہرنے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد نے اور ان سے حضرت اسماء رضی اللہ عنہا نے کہ جب نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہونے کو نکلیں تھیں تو وہ حاملہ تھیں ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 134,
        "matchingArabicURN": 135440,
        "last_updated": null
    },
    {
        "urduURN": 4038690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3910,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، ان سے ابواسامہ نے ، ان سے ہشام بن عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "سب سے پہلا بچہ جواسلام میں ( ہجرت کے بعد ) پیدا ہوا ، عبداللہ بن زبیر رضی اللہ عنہما ہیں ، انہیں لوگ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں لائے تو آنحضرت صلی اللہ علیہ وسلم نے ایک کھجور لے کر اسے چبایا پھر اس کو ان کے منہ میں ڈال دیا ۔ اس لئے سب سے پہلی چیز جو ان کے پیٹ میں گئی وہ آنحضرت صلی اللہ علیہ وسلم کا لعاب مبارک تھا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 135,
        "matchingArabicURN": 135450,
        "last_updated": null
    },
    {
        "urduURN": 4038700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3911,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے عبدالصمد نے بیان کیا ، کہا مجھ سے میرے باپ عبدالوارث نے بیان کیا ، ان سے عبد العزیز بن صہیب نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا ، انہوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جب مدینہ تشریف لائے تو حضرت ابوبکر صدیق رضی اللہ عنہ آپ کی سواری پر پیچھے بیٹھے ہوئے تھے ۔ حضرت ابوبکر رضی اللہ عنہ بوڑھے ہو گئے تھے اور ان کو لوگ پہچانتے بھی تھے لیکن حضور صلی اللہ علیہ وسلم ابھی جوان معلوم ہوتے تھے اور آپ کو لوگ عام طور سے پہچانتے بھی نہ تھے ۔ بیان کیا کہ اگر راستہ میں کوئی ملتا اور پوچھتا کہ اے ابوبکر ! یہ تمہارے ساتھ کون صاحب ہیں ؟ تو آپ جواب دیتے کہ یہ میرے ہادی ہیں ، مجھے راستہ بتاتے ہیں پوچھنے والا یہ سمجھتا کہ مدینہ کا راستہ بتلانے والا ہے اور ابوبکر رضی اللہ عنہ کا مطلب اس کلام سے یہ تھا کہ آپ دین وایمان کا راستہ بتلاتے ہیں ۔ ایک مرتبہ حضرت ابوبکر رضی اللہ عنہ پیچھے مڑے تو ایک سوار نظر آیا جو ان کے قریب آچکا تھا ۔ انہوں نے کہا یا رسول اللہ ! یہ سوار آ گیا اور اب ہمارے قریب ہی پہنچنے والا ہے نبی کریم صلی اللہ علیہ وسلم نے بھی اسے مڑ کر دیکھا اور دعا فرمائی کہ اے اللہ ! اسے گرادے چنانچہ گھوڑی نے اسے گرا دیا ۔ پھر جب وہ ہنہناتی ہوئی اٹھی تو سوار ( سراقہ ) نے کہا اے اللہ کے نبی ! آپ جو چاہیں مجھے حکم دیں ۔ حضور صلی اللہ علیہ وسلم نے فرمایا اپنی جگہ کھڑا رہ اور دیکھ کسی کو ہماری طرف نہ آنے دینا ۔ راوی نے بیان کیا کہ وہی شخص جو صبح آپ کے خلاف تھا شام جب ہوئی تو آپ کا وہ ہتھیار تھا دشمن کو آپ سے روکنے لگا ۔ اس کے بعد حضور صلی اللہ علیہ وسلم ( مدینہ پہنچ کر ) حرہ کے قریب اترے اور انصار کو بلابھیجا ۔ اکابر انصار حضور صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور دونوں کو سلام کیا اور عرض کیا آپ سوار ہو جائیں آپ کی حفاظت اور فرمانبرداری کی جائے گی ، چنانچہ حضور صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ سوار ہو گئے اور ہتھیار بند انصار نے آپ دونوں کو حلقہ میں لے لیا ۔ اتنے میں مدینہ میں بھی سب کو معلوم ہو گیا کہ حضور صلی اللہ علیہ وسلم تشریف لا چکے ہیں سب لوگ آپ کو دیکھنے کے لئے بلندی پر چڑھ گئے اور کہنے لگے کہ اللہ کے نبی آ گئے ۔ اللہ کے نبی آ گئے ۔ آنحضرت صلی اللہ علیہ وسلم مدینہ کی طرف چلتے رہے اور ( مدینہ پہنچ کر ) حضرت ابوایوب رضی اللہ عنہ کے گھرکے پاس سواری سے اتر گئے ۔ عبداللہ بن سلام رضی اللہ عنہ ( ایک یہودی عالم نے ) اپنے گھر والوں سے حضور صلی اللہ علیہ وسلم کا ذکر سنا ، وہ اس وقت اپنے ایک کھجور کے باغ میں تھے اور کھجور جمع کر رہے تھے انہوں نے ( سنتے ہی ) بڑی جلدی کے ساتھ جو کچھ کھجور جمع کر چکے تھے اسے رکھ دینا چاہا جب آپ کی خدمت میں وہ حاضر ہوئے تو جمع شدہ کھجوریں ان کے ساتھ ہی تھیں انہوں نے نبی کریم صلی اللہ علیہ وسلم کی باتیں سنیں اور اپنے گھر واپس چلے آئے ۔ حضور صلی اللہ علیہ وسلم نے فرمایا کہ ہمارے ( نانہالی ) اقارب میں کس کا گھر یہاں سے زیادہ قریب ہے ؟ ابوایوب رضی اللہ عنہ نے عرض کیا کہ میرا اے اللہ کے نبی ! یہ میرا گھر ہے اور یہ اس کا دروازہ ہے فرمایا ( اچھا تو جاؤ ) دوپہر کو آرام کرنے کی جگہ ہمارے لئے درست کرو ہم دوپہر کو وہیں آرام کریں گے ۔ ابوایوب رضی اللہ عنہ نے عرض کیا پھر آپ دونوں تشریف لے چلیں ، اللہ مبارک کرے ۔ حضور صلی اللہ علیہ وسلم ابھی ان کے گھر میں داخل ہوئے تھے کہ عبداللہ بن سلام بھی آ گئے اور کہا کہ ” میں گواہی دیتا ہوں کہ آپ صلی اللہ علیہ وسلم اللہ کے رسول ہیں اور یہ کہ آپ حق کے ساتھ مبعوث ہوئے ہیں ، اور یہودی میرے متعلق اچھی طرح جانتے ہیں کہ میں ان کا سردار ہوں اور ان کے سردار کا بیٹا ہوں اور ان میں سب سے زیادہ جاننے والا ہوں اور ان کے سب سے بڑے عالم کا بیٹا ہوں ، اس لئے آپ اس سے پہلے کہ میرے اسلام لانے کا خیال انہیں معلوم ہو ، بلایئے اور ان سے میرے بارے میں دریافت فرما یئے ، کیونکہ انہیں اگر معلوم ہو گیا کہ میں اسلام لاچکا ہوں تو میرے متعلق غلط باتیں کہنی شروع کر دیں گے ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم نے انہیں بلا بھیجا اور جب وہ آپ کی خدمت حاضر ہوئے تو آپ نے ان سے فرمایا اے یہودیو ! افسوس تم پر ، اللہ سے ڈرو ، اس ذات کی قسم ! جس کے سوا کوئی معبود نہیں ، تم لوگ خوب جانتے ہو کہ میں اللہ کا رسول بر حق ہوں اور یہ بھی کہ میں تمہارے پاس حق لے کر آیا ہوں ، پھر اب اسلام میں داخل ہو جاؤ ، انہوں نے کہا کہ ہمیں معلوم نہیں ہے ، نبی کریم صلی اللہ علیہ وسلم نے ان سے اور انہوں نے آنحضرت صلی اللہ علیہ وسلم سے اس طرح تین مرتبہ کہا ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا ۔ اچھا عبداللہ بن سلام تم میں کون صاحب ہیں ؟ انہوں نے کہا ہمارے سردار اور ہمارے سردار کے بیٹے ، ہم میں سب سے زیادہ جاننے والے اور ہمارےسب سے بڑے عالم کے بیٹے ، آپ صلی اللہ علیہ وسلم نے فرمایا اگر وہ اسلام لے آئیں ۔ پھر تمہار ا کیا خیال ہو گا ۔ کہنے لگے اللہ ان کی حفاظت کرے ، وہ اسلام کیوں لانے لگے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ابن سلام ! اب ان کے سامنے آ جاؤ ۔ عبداللہ بن سلام رضی اللہ عنہ باہر آ گئے اور کہا اے یہود ! خدا سے ڈرو اس اللہ کی قسم ! جس کے سوا کوئی معبود نہیں تمہیں خوب معلوم ہے کہ آپ اللہ کے رسول ہیں اور یہ کہ آپ حق کے ساتھ مبعوث ہوئے ہیں ۔ یہودیوں نے کہا تم جھوٹے ہو ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے ان سے باہر چلے جانے کے لئے فرمایا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 136,
        "matchingArabicURN": 135460,
        "last_updated": null
    },
    {
        "urduURN": 4038710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3912,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا ہم کو ہشام نے خبر دی ، ان سے ابن جریج نے بیان کیا ، کہا کہ مجھے عبیداللہ بن عمر نے خبر دی ، انہیں نافع نے یعنی ابن عمر رضی اللہ عنہما سے اور وہ عمر بن خطاب رضی اللہ عنہ سے ، فرمایا",
        "hadithText": "آپ نے تمام مہاجرین اولین کا وظیفہ ( اپنے عہد خلافت میں ) چار چار ہزار چار چار قسطوں میں مقرر کر دیا تھا ، لیکن عبداللہ بن عمر رضی اللہ عنہما کا وظیفہ چار قسطوں میں ساڑھے تین ہزار تھا اس پر ان سے پوچھا گیا کہ عبداللہ بن عمر رضی اللہ عنہما بھی مہاجرین میں سے ہیں ۔ پھر آپ انہیں چار ہزار سے کم کیوں دیتے ہیں ؟ تو حضرت عمر رضی اللہ عنہ نے کہا کہ انہیں ان کے والدین ہجرت کر کے یہاں لائے تھے ۔ اس لئے وہ ان مہاجرین کے برابر نہیں ہو سکتے جنہوں نے خود ہجرت کی تھی ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 137,
        "matchingArabicURN": 135470,
        "last_updated": null
    },
    {
        "urduURN": 4038720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3913,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو سفیان نے خبر دی انہیں اعمش نے ، انہیں ابووائل شقیق بن سلمہ نے اور ان سے خباب رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ہجرت کی تھی ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 138,
        "matchingArabicURN": 135480,
        "last_updated": null
    },
    {
        "urduURN": 4038730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3914,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ان سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے اعمش نے ، انہوں نے شقیق بن سلمہ سے سنا ، کہا کہ ہم سے خباب رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ہجرت کی تو ہمارا مقصد صرف اللہ کی رضا تھی اور اللہ تعالیٰ ہمیں اس کا اجر بھی ضرور دے گا ۔ پس ہم میں سے بعض تو پہلے ہی اس دنیا سے اٹھ گئے ۔ اور یہاں اپنا کوئی بدلہ انہوں نے نہیں پایا ۔ مصعب بن عمیر رضی اللہ عنہ بھی انہیں میں سے ہیں ۔ احد کی لڑائی میں انہوں نے شہادت پائی ۔ اور ان کے کفن کے لئے ہمارے پاس ایک کمبل کے سوا اور کچھ نہیں تھا ۔ اور وہ بھی ایسا کہ اگر اس سے ہم ان کا سر چھپا تے تو ان کے پاؤں کھل جاتے ۔ اور اگر پاؤں چھپاتے تو سر کھلا رہ جاتا ۔ چنانچہ حضور صلی اللہ علیہ وسلم نے حکم دیا کہ ان کا سر چھپا دیا جائے اور پاؤں کو اذخر گھاس سے چھپا دیا جائے ۔ اور ہم میں بعض وہ ہیں جنہوں نے اپنے عمل کا پھل اس دنیا میں پختہ کر لیا ۔ اور اب وہ اس کو خوب چن رہے ہیں ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 139,
        "matchingArabicURN": 135490,
        "last_updated": null
    },
    {
        "urduURN": 4038740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3915,
        "hadithSanad": "ہم سے یحییٰ بن بشر نے بیان کیا ، کہا ہم سے روح نے بیان کیا ، ان سے عوف نے بیان کیا ، ان سے معاویہ بن قرہ نے بیان کیا کہ مجھ سے ابوبردہ بن ابوموسیٰ اشعری نے بیان کیا ، انہوں نے بیان کیا کہ",
        "hadithText": "مجھ سے عبداللہ بن عمر رضی اللہ عنہما نے پوچھا ۔ کیا تم کو معلوم ہے کہ میرے والد عمر رضی اللہ عنہ نے تمہارے والد ابوموسیٰ رضی اللہ عنہ کو کیا جواب دیا تھا ، انہوں نے کہا نہیں ، تو عبداللہ بن عمر نے کہا کہ میرے والد نے تمہارے والد سے کہا اے ابوموسیٰ ! کیا تم اس پر راضی ہو کہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ہمارا اسلام ، آپ کے ساتھ ہماری ہجرت ، آپ کے ساتھ ہمارا جہاد ہمارے تمام عمل جوہم نے آپ کی زندگی میں کئے ہیں ان کے بدلہ میں ہم اپنے ان اعمال سے نجات پا جائیں جو ہم نے آپ کے بعد کئے ہیں گو وہ نیک بھی ہوں بس برابری پر معاملہ ختم ہو جائے ۔ اس پر آپ کے والد نے میرے والد سے کہا خدا کی قسم ! میں اس پر راضی نہیں ہوں ہم نے رسول اللہ صلی اللہ علیہ وسلم کے بعد بھی جہاد کیا ، نمازیں پڑھیں ، روزے رکھے اور بہت سے اعمال خیر کئے اور ہمارے ہاتھ پر ایک مخلوق نے اسلام قبول کیا ، ہم تو اس کے ثواب کی بھی امید رکھتے ہیں اس پر میرے والد نے کہا ( خیر ابھی تم سمجھو ) لیکن جہاں تک میرا سوال ہے تو اس ذات کی قسم ! جس کے ہاتھ میں میری جان ہے میری خواہش ہے کہ حضور صلی اللہ علیہ وسلم کی زندگی میں کئے ہوئے ہمارے اعمال محفوظ رہے ہوں اور جتنے اعمال ہم نے آپ کے بعد کئے ہیں ان سب سے اس کے بدلہ میں ہم نجات پا جائیں اور برابر پر معاملہ ختم ہو جائے ۔ ابوبردہ کہتے ہیں اس پر میں نے کہا اللہ کی قسم آپ کے والد ( حضرت عمر رضی اللہ عنہ ) میرے والد ( ابوموسیٰ رضی اللہ عنہ ) سے بہتر تھے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 140,
        "matchingArabicURN": 135500,
        "last_updated": null
    },
    {
        "urduURN": 4038750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3916,
        "hadithSanad": "مجھ سے محمدبن صباح نے خود بیان کیا یا ان سے کسی اور نے نقل کر کے بیان کیا ، کہا ہم سے اسماعیل بن علیہ نے ، ان سے عاصم احول نے ، ان سے ابوعثمان نے بیان کیا اور انہوں نے کہا کہ",
        "hadithText": "ابن عمر رضی اللہ عنہما سے میں نے سنا کہ جب ان سے کہا جاتا کہ تم نے اپنے والد سے پہلے ہجرت کی تو وہ غصہ ہو جایا کرتے تھے ۔ انہوں نے بیان کیا کہ میں عمر رضی اللہ عنہ کے ساتھ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ، اس وقت آپ صلی اللہ علیہ وسلم آرام فرما رہے تھے ، اس لئے ہم گھر واپس آ گئے پھر عمر رضی اللہ عنہ نے مجھے آپ کی خدمت میں بھیجا اور فرمایا کہ جا کر دیکھ آؤ حضور صلی اللہ علیہ وسلم ابھی بیدار ہوئے یا نہیں چنانچہ میں آیا ( آنحضرت صلی اللہ علیہ وسلم بیدار ہو چکے تھے ) اس لئے اندر چلا گیا اور آپ صلی اللہ علیہ وسلم کے ہاتھ پر بیعت کی پھر میں عمر رضی اللہ عنہ کے پاس آیا اور آپ کو حضور صلی اللہ علیہ وسلم کے بیدار ہونے کی خبر دی ۔ اس کے بعد ہم آپ صلی اللہ علیہ وسلم کی خدمت میں دوڑتے ہوئے حاضر ہوئے عمر رضی اللہ عنہ بھی اندر گئے اور آپ صلی اللہ علیہ وسلم سے بیعت کی اور میں نے بھی ( دوبارہ ) بیعت کی ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 141,
        "matchingArabicURN": 135510,
        "last_updated": null
    },
    {
        "urduURN": 4038760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3917,
        "hadithSanad": "ہم سے احمد بن عثمان نے بیان کیا ، کہا کہ ان سے شریح بن مسلمہ نے بیان کیا ، ان سے ابراہیم بن یوسف نے ، ان سے ان کے والد یوسف بن اسحاق نے ، ان سے ابواسحاق سبیعی نے بیان کیا کہ",
        "hadithText": "میں نے براء  بن عازب رضی اللہ عنہما سے حدیث سنی وہ بیان کرتے تھے کہ ابوبکر رضی اللہ عنہ نے عازب رضی اللہ عنہ سے ایک پالان خریدااور میں ان کے ساتھ اٹھا کر پہنچانے لایا تھا ، انہوں نے بیان کیا کہ ابوبکر رضی اللہ عنہ سے عازب رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کے سفر ہجرت کا حال پوچھا تو انہوں نے بیان کیا کہ چونکہ ہماری نگرانی ہو رہی تھی ( یعنی کفار ہماری تاک میں تھے ) اس لئے ہم ( غار سے ) رات کے وقت باہر آئے اور پوری رات اور دن بھر بہت تیزی کے ساتھ چلتے رہے ، جب دوپہر ہوئی تو ہمیں ایک چٹان دکھائی دی ۔ ہم اس کے قریب پہنچے تو اس کی آڑ میں تھوڑاسا سایہ بھی موجود تھا ، ابوبکر رضی اللہ عنہ نے بیان کیا کہ میں نے حضور صلی اللہ علیہ وسلم کے لئے ایک چمڑا بچھا دیا جو میرے ساتھ تھا آپ اس پر لیٹ گئے ، اور میں قرب وجوار کی گرد جھاڑنے لگا ۔ اتفاق سے ایک چرواہا نظر پڑا جو اپنی بکریوں کے تھوڑے سے ریوڑ کے ساتھ اسی چٹان کی طرف آ رہا تھااس کا مقصد اس چٹان سے وہی تھا جس کے لئے ہم یہاں آئے تھے ( یعنی سایہ حاصل کرنا ) میں نے اس سے پوچھا لڑکے تو کس کا غلام ہے ؟ اس نے بتایا کہ فلاں کا ہوں ۔ میں نے اس سے پوچھا کیا تم اپنی بکریوں سے کچھ دودھ نکال سکتے ہو اس نے کہا کہ ہاں پھر وہ اپنے ریوڑ سے ایک بکری لایا تو میں نے اس سے کہا کہ پہلے اس کا تھن جھاڑ لو ۔ انہوں نے بیان کیا کہ پھر اس نے کچھ دودھ دوہا ۔ میرے ساتھ پانی کا ایک چھاگل تھا ۔ اس کے منہ پرکپڑابندھاہوا تھا ۔ یہ پانی میں نے حضور صلی اللہ علیہ وسلم کے لئے ساتھ لے رکھا تھا ۔ وہ پانی میں نے اس دودھ پر اتنا ڈالا کہ وہ نیچے تک ٹھنڈا ہو گیا تو میں اسے حضور صلی اللہ علیہ وسلم کی خدمت میں لے کر حاضر ہوا اور عرض کیا دودھ نوش فرمایئے یا رسول اللہ ! آپ صلی اللہ علیہ وسلم نے اسے نوش فرمایا جس سے مجھے بہت خوشی حاصل ہوئی ۔ اس کے بعد ہم نے پھر کوچ شروع کیا اور ڈھونڈ نے والے لوگ ہماری تلاش میں تھے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 142,
        "matchingArabicURN": 135520,
        "last_updated": null
    },
    {
        "urduURN": 4038770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3918,
        "hadithSanad": "براء نے بیان کیا کہ",
        "hadithText": "جب میں ابوبکر رضی اللہ عنہ کے ساتھ ان کے گھر میں داخل ہوا تھا تو آپ کی صاحبزادی عائشہ رضی اللہ عنہا لیٹی ہوئی تھیں انہیں بخار آ رہا تھا میں نے ان کے والد کو دیکھا کہ انہوں نے ان کے رخسار پر بوسہ دیا اور دریافت کیا بیٹی ! طبیعت کیسی ہے ؟</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 143,
        "matchingArabicURN": 135530,
        "last_updated": null
    },
    {
        "urduURN": 4038780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3919,
        "hadithSanad": "ہم سے سلیمان بن عبدالرحمٰن نے بیان کیا ، کہا ہم سے محمد بن حمیر نے بیان کیا ، کہا ہم سے ابراہیم بن ابی عبلہ نے بیان کیا ، ان سے عقبہ بن وساج نے بیان کیا اور ان سے نبی کریم صلی اللہ علیہ وسلم کے خادم انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جب حضور صلی اللہ علیہ وسلم ( مدینہ منورہ ) تشریف لائے تو ابوبکر رضی اللہ عنہ کے سوا اور کوئی آپ کے اصحاب میں ایسا نہیں تھا جس کے بال سفید ہو رہے ہوں ، اس لئے آپ نے مہندی اور وسمہ کا خضاب استعمال کیا تھا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 144,
        "matchingArabicURN": 135540,
        "last_updated": null
    },
    {
        "urduURN": 4038790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3920,
        "hadithSanad": "اور دحیم نے بیان کیا ، ان سے ولید نے بیان کیا ، کہا ہم سے اوزاعی نے بیان کیا ، کہا مجھ سے ابو عبید نے بیان کیا ، ان سے عقبہ بن وساج نے انہوں نے کہا کہ مجھ سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم مدینہ تشریف لائے تو آپ صلی اللہ علیہ وسلم کے اصحاب میں سب سے زیادہ عمر ابوبکر رضی اللہ عنہ کی تھی اس لئے انہوں نے مہندی اور وسمہ کا خضاب استعمال کیا ۔ اس سے آپ کے بالوں کا رنگ خوب سرخ مائل بہ سیاہی ہو گیا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 145,
        "matchingArabicURN": 135550,
        "last_updated": null
    },
    {
        "urduURN": 4038800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3921,
        "hadithSanad": "ہم سے اصبغ بن فرج نے بیان کیا ، کہا ہم سے عبداللہ بن وہب نے بیان کیا ، ان سے یونس نے ، ان سے ابن شہاب نے ، ان سے عروہ بن زبیر نے ، ان سے عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "ابوبکر رضی اللہ عنہ نے قبیلہ بنو کلب کی ایک عورت ام بکر نامی سے شادی کر لی تھی ۔ پھر جب انہوں نے ہجرت کی تو اسے طلاق دے آئے ۔ اس عورت سے پھر اس کے چچا زاد بھائی ( ابوبکر شداد بن اسود ) نے شادی کر لی تھی ، یہ شخص شاعر تھا اور اسی نے یہ مشہور مرثیہ کفار قریش کے بارے میں کہا تھا ” مقام بدر کے کنوؤں کو میں کیا کہوں کہ انہوں نے ہمیں در خت شیزیٰ کے بڑے بڑے پیالوں سے محروم کر دیا جو کبھی اونٹ کے کوہان کے گوشت سے بہتر ہوا کرتے تھے ، میں بدر کے کنوؤں کو کیا کہوں ! انہوں نے ہمیں گانے والی لونڈیوں اور اچھے شرابیوں سے محروم کر دیا ام بکر تو مجھے سلامتی کی دعا دیتی رہی لیکن میری قوم کی بربادی کے بعد میرے لئے سلامتی کہاں ہے یہ رسول ہمیں دوبارہ زندگی کی خبریں بیان کرتا ہے ۔ کہیں الو بن جانے کے بعد پھر زندگی کس طرح ممکن ہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 146,
        "matchingArabicURN": 135560,
        "last_updated": null
    },
    {
        "urduURN": 4038810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3922,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، ان سے ثابت نے ، ان سے انس رضی اللہ عنہ نے اور ان سے ابوبکر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ غار میں تھا ۔ میں نے جو سر اٹھایا تو قوم کے چند لوگوں کے قدم ( باہر ) نظر آئے میں نے کہا ، اے اللہ کے نبی ! اگر ان میں سے کسی نے بھی نیچے جھک کر دیکھ لیا تو وہ ہمیں ضرور دیکھ لے گا ۔ حضور صلی اللہ علیہ وسلم نے فرمایا ، ابوبکر ! خاموش رہو ہم ایسے دو ہیں جن کا تیسرا اللہ ہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 147,
        "matchingArabicURN": 135570,
        "last_updated": null
    },
    {
        "urduURN": 4038820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3923,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے ولید بن مسلم دمشقی نے بیان کیا ، کہا ہم سے امام اوزاعی نے بیان کیا ، ( دوسری سند ) اور محمد بن یوسف نے بیان کیا کہ ہم سے ا مام اوزاعی نے بیان کیا ، کہا مجھ سے زہری نے بیان کیا ، کہا کہ مجھ سے عطاء بن یزید لیثی نے بیان کیا ، کہا کہ مجھ سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہا کہ",
        "hadithText": "ایک اعرابی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ صلی اللہ علیہ وسلم سے ہجرت کا حال پوچھنے لگا آپ صلی اللہ علیہ وسلم نے فرمایا تجھ پر افسوس ! ہجرت تو بہت مشکل ہے ۔ تمہارے پاس کچھ اونٹ بھی ہیں ؟ اس نے کہا جی ہاں ہیں ۔ فرمایا کہ تم اس کی زکوٰۃ ادا کرتے ہو ؟ اس نے عرض کیا جی ہاں ادا کرتا ہوں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا اونٹنیوں کا دودھ دوسرے ( محتاجوں ) کو بھی دوہنے کے لئے دے دیا کرتے ہو ؟ اس نے عرض کیا کہ ایسا بھی کرتا ہوں آپ صلی اللہ علیہ وسلم نے فرمایا ، انہیں گھاٹ پر لے جا کر ( محتاجوں کے لئے ) دوہتے ہو ؟ اس نے عرض کیا ایسا بھی کرتا ہوں ۔ اس پر حضور صلی اللہ علیہ وسلم نے فرمایا کہ پھر تم سات سمندر پار عمل کرو ، اللہ تعالیٰ تمہارے کسی عمل کا بھی ثواب کم نہیں کرے گا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 148,
        "matchingArabicURN": 135580,
        "last_updated": null
    },
    {
        "urduURN": 4038830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3924,
        "hadithSanad": "ہم سے ابو الولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا کہ ہمیں ابواسحاق نے خبر دی ، انہوں نے براء  بن عازب رضی اللہ عنہما سے سنا ، انہوں نے یوں بیان کیا کہ",
        "hadithText": "سب سے پہلے ( ہجرت کر کے ) ہمارے یہاں مصعب بن عمیر رضی اللہ عنہ اور ابن ام مکتوم رضی اللہ عنہ آئے پھر عمار بن یاسر رضی اللہ عنہ اور بلال رضی اللہ عنہ آئے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 149,
        "matchingArabicURN": 135590,
        "last_updated": null
    },
    {
        "urduURN": 4038840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3925,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ابواسحاق نے بیان کیا اور انہوں نے براء  بن عازب رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "سب سے پہلے ہمارے یہاں مصعب بن عمیر رضی اللہ عنہ اور ابن ام مکتوم رضی اللہ عنہ ( نابینا ) آئے یہ دونوں ( مدینہ کے ) مسلمانوں کو قرآن پڑھنا سکھاتے تھے ۔ اس کے بعد بلال ، سعداور عمار بن یاسر رضی اللہ عنہم آئے ۔ پھر عمربن خطاب رضی اللہ عنہ حضور صلی اللہ علیہ وسلم کے بیس صحابہ کو ساتھ لے کر آئے اور نبی کریم صلی اللہ علیہ وسلم ( حضرت ابوبکر رضی اللہ عنہ اور عامر بن فہیرہ کو ساتھ لے کر ) تشریف لائے ، مدینہ کے لوگوں کو جتنی خوشی اور مسرت حضور صلی اللہ علیہ وسلم کی تشریف آوری سے ہوئی میں نے کبھی انہیں کسی بات پر اس قدر خوش نہیں دیکھا ۔ لونڈیاں بھی ( خوشی میں ) کہنے لگیں کہ رسول اللہ صلی اللہ علیہ وسلم آ گئے حضور صلی اللہ علیہ وسلم جب تشریف لائے تو اس سے پہلے میں مفصل کی دوسری کئی سورتوں کے ساتھ سبح اسم ربک الاعلی بھی سیکھ چکا تھا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 150,
        "matchingArabicURN": 135600,
        "last_updated": null
    },
    {
        "urduURN": 4038850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3926,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو مالک نے خبر دی ، انہیں ہشام بن عروہ نے ، انہیں ان کے والد عروہ بن زبیر نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "جب رسول اللہ صلی اللہ علیہ وسلم مدینہ تشریف لائے تو ابوبکر اور بلال رضی اللہ عنہما کو بخار چڑھ آیا ، میں ان کی خدمت میں حاضر ہوئی اور عرض کیا والد صاحب ! آپ کی طبیعت کیسی ہے ؟ انہوں نے بیان کیا کہ حضرت ابوبکر رضی اللہ عنہ کو جب بخار چڑھا تو یہ شعر پڑھنے لگے ۔ ( ترجمہ ) ہر شخص اپنے گھر والوں کے ساتھ صبح کرتا ہے اور موت تو جوتی کے تسمے سے بھی زیادہ قریب ہے “ اور بلال رضی اللہ عنہ کے بخار میں جب کچھ تخفیف ہوتی تو زور زور سے روتے اور یہ شعر پڑھتے ” کاش مجھے یہ معلوم ہو جاتا کہ کبھی میں ایک رات بھی وادی مکہ میں گزار سکوں گا جب کہ میرے اردگرد ( خوشبودار گھاس ) اذخر اور جلیل ہوں گی ، اور کیا ایک دن بھی مجھے ایسا مل سکے گا جب میں مقام مجنہ کے پانی پر جاؤں گا اور کیا شامہ اور طفیل کی پہاڑیوں کو ایک نظر دیکھ سکوں گا “ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر میں حضور صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور آپ صلی اللہ علیہ وسلم کو اطلاع دی تو آپ صلی اللہ علیہ وسلم نے دعا کی ، اے اللہ ! مدینہ کی محبت ہمارے دل میں اتنی پیدا کر دے جتنی مکہ کی تھی بلکہ اس سے بھی زیادہ ، یہاں کی آب و ہوا کو صحت بخش بنا ۔ ہمارے لئے یہا ں کے صاع اور مد ( اناج ناپنے کے پیمانے ) میں برکت عنایت فرما اور یہاں کے بخار کو مقام جحفہ میں بھیج دے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 151,
        "matchingArabicURN": 135610,
        "last_updated": null
    },
    {
        "urduURN": 4038860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3927,
        "hadithSanad": "مجھ سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے ہشام بن یوسف نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، کہا مجھ سے عروہ بن زبیر نے بیان کیا ، انہیں عبیداللہ بن عدی نے خبر دی کہ",
        "hadithText": "میں عثمان کی خدمت میں حاضر ہوا ( دوسری سند ) اور بشر بن شعیب نے بیان کیا کہ مجھ سے میرے والد نے بیان کیا ، ا ن سے زہری نے ، کہا مجھ سے عروہ بن زبیر نے بیان کیا اور انہیں عبیداللہ بن عدی بن خیار نے خبر دی کہ میں عثمان رضی اللہ عنہ کی خدمت میں حاضر ہوا تو انہوں نے حمد وشہادت پڑھنے کے بعد فرمایا ، امابعد ! کوئی شک وشبہ نہیں کہ اللہ تعالیٰ نے محمد صلی اللہ علیہ وسلم کو حق کے ساتھ مبعوث کیا ، میں بھی ان لوگوں میں تھا جنہوں نے اللہ اور اس کے رسول کی دعوت پر ( ابتداء ہی میں ) لبیک کہا اور میں ان تمام چیزوں پر ایمان لایا جنہیں لے کر آنحضرت صلی اللہ علیہ وسلم مبعوث ہوئے تھے ، پھر میں نے دو ہجرت کی اور حضور صلی اللہ علیہ وسلم کی دامادی کا شرف مجھے حاصل ہوا اور حضور صلی اللہ علیہ وسلم سے میں نے بیعت کی خدا کی قسم کہ میں نے آپ کی نہ کبھی نافرمانی کی اور نہ کبھی آپ سے دھوکہ بازی کی ، یہاں تک کہ آپ کا انتقال ہو گیا ۔ شعیب کے ساتھ اس روایت کی متابعت اسحاق کلبی نے بھی کی ہے ، ان سے زہری نے اس حدیث کو اسی طرح بیان کیا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 152,
        "matchingArabicURN": 135620,
        "last_updated": null
    },
    {
        "urduURN": 4038870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3928,
        "hadithSanad": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، کہا مجھ سے عبداللہ بن وہب نے بیان کیا ، ان سے امام مالک نے بیان کیا ( دوسری سند ) اور مجھے یونس نے خبر دی ، ان سے ابن شہاب نے بیان کیا ، کہا مجھ کو عبیداللہ بن عبداللہ نے خبر دی اور انہیں ابن عباس رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "عبدالرحمن بن عوف رضی اللہ عنہ منیٰ میں اپنے خیمہ کی طرف واپس آ رہے تھے ، یہ عمر رضی اللہ عنہ کے آخری حج کا واقعہ ہے تو ان کی مجھ سے ملاقات ہو گئی ۔ انہوں نے کہا کہ ( عمر رضی اللہ عنہ حاجیوں کو خطاب کرنے والے تھے اس لئے ) میں نے عرض کیا کہ اے امیرالمؤمنین ! موسم حج میں معمولی سوجھ بوجھ رکھنے والے سب طرح کے لوگ جمع ہوتے ہیں اور شوروغل بہت ہوتا ہے اس لئے میرا خیال ہے کہ آپ اپنا ارادہ موقوف کر دیں اور مدینہ پہنچ کر ( خطاب فرمائیں ) کیونکہ وہ ہجرت اور سنت کا گھر ہے اور وہاں سمجھدار معزز اور صاحب عقل لوگ رہتے ہیں ۔ “ اس پرعمر رضی اللہ عنہ نے کہا کہ تم ٹھیک کہتے ہو ، مدینہ پہنچتے ہی سب سے پہلی فرصت میں لوگوں کو خطاب کرنے کے لئے ضرور کھڑا ہوں گا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 153,
        "matchingArabicURN": 135630,
        "last_updated": null
    },
    {
        "urduURN": 4038880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3929,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، انہیں ابن شہاب نے خبر دی ، انہیں خارجہ بن زید بن ثابت نے کہ ( ان کی والدہ ) ام علاء رضی اللہ عنہا ( ایک انصاری خاتون جنہوں نے نبی کریم سے بیعت کی تھی ) ، نے انہیں خبر دی کہ",
        "hadithText": "جب انصار نے مہاجرین کی میز بانی کے لئے قرعہ ڈالا تو عثمان بن مظعون ان کے گھرانے کے حصے میں آئے تھے ۔ ام علاء رضی اللہ عنہا نے بیان کیا کہ پھر عثمان رضی اللہ عنہ ہمارے یہاں بیمار پڑ گئے ۔ میں نے ان کی پوری طرح تیمارداری کی وہ نہ بچ سکے ۔ ہم نے انہیں ان کے کپڑوں میں لپیٹ دیا تھا ۔ اتنے میں نبی کریم صلی اللہ علیہ وسلم بھی تشریف لائے تو میں نے کہا ابوسائب ! ( عثمان رضی اللہ عنہ کی کنیت ) تم پر اللہ کی رحمتیں ہوں ، میری تمہارے متعلق گواہی ہے کہ اللہ تعالیٰ نے تمہیں اپنے اکرام سے نوازا ہے ۔ یہ سن کر حضور صلی اللہ علیہ وسلم نے فرمایا تمہیں یہ کیسے معلوم ہوا کہ اللہ تعالیٰ نے انہیں اپنے اکرام سے نوازا ہے ؟ میں نے عرض کیا مجھے تو اس سلسلے میں کچھ خبر نہیں ہے ، میرے ماں باپ آپ پر فدا ہوں یا رسول اللہ ! لیکن اور کسے نوازے گا ؟ حضور صلی اللہ علیہ وسلم نے فرمایا اس میں تو واقعی کوئی شک وشبہ نہیں کہ ایک یقینی امر ( موت ) ان کو آ چکا ہے ، خدا کی قسم کہ میں بھی ان کے کئے اللہ تعالیٰ سے خیرخواہی کی امید رکھتا ہوں لیکن میں حالانکہ اللہ کا رسول ہوں خود اپنے متعلق نہیں جان سکتا کہ میرے ساتھ کیا معاملہ ہو گا ۔ ام علا ء رضی اللہ عنہا نے عرض کیا پھر خدا کی قسم کہ اس کے بعد میں اب کسی کے بارے میں اس کی پاکی نہیں کروں گی ۔ انہوں نے بیان کیا کہ اس واقعہ پر مجھے بڑا رنج ہوا ۔ پھر میں سو گئی تو میں نے خواب میں دیکھا کہ عثمان بن مظعون کے لیے ایک بہتا ہوا چشمہ ہے ۔ میں آپ کی خدمت میں حاضر ہوئی اور آپ سے اپنا خواب بیان کیا تو آپ نے فرمایا کہ یہ ان کا عمل تھا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 154,
        "matchingArabicURN": 135640,
        "last_updated": null
    },
    {
        "urduURN": 4038890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3930,
        "hadithSanad": "ہم سے عبیداللہ بن سعید نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "بعاث کی لڑائی کو ( انصار کے قبائل اوس و خزرج کے درمیان ) اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کے مدینہ میں آنے سے پہلے ہی برپا کرا دیا تھا چنانچہ جب آپ مدینہ تشریف لائے تو انصار میں پھوٹ پڑی ہوئی تھی اور ان کے سردار قتل ہو چکے تھے ۔ اس میں اللہ کی یہ حکمت معلوم ہوتی ہے کہ انصار اسلام قبول کر لیں ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 155,
        "matchingArabicURN": 135650,
        "last_updated": null
    },
    {
        "urduURN": 4038900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3931,
        "hadithSanad": "مجھ سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "حضرت ابوبکر صدیق رضی اللہ عنہ ا نکے یہاں آئے تو نبی کریم صلی اللہ علیہ وسلم بھی وہیں تشریف رکھتے تھے عیدالفطر یا عیدالاضحی کا دن تھا ، دو لڑکیاں یوم بعاث کے بارے میں وہ اشعار پڑھ رہی تھیں جو انصار کے شعراء نے اپنے فخر میں کہے تھے ۔ حضرت ابوبکر رضی اللہ عنہ نے کہا یہ شیطانی گانے باجے ! ( آنحضرت صلی اللہ علیہ وسلم کے گھر میں ) دو مرتبہ انہوں نے یہ جملہ دہرایا ، لیکن آپ نے فرمایا ابوبکر ! انہیں چھوڑ دو ۔ ہر قوم کی عید ہوتی ہے اور ہماری عید آج کا یہ دن ہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 156,
        "matchingArabicURN": 135660,
        "last_updated": null
    },
    {
        "urduURN": 4038910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3932,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ( دوسری سند ) اور ہم سے اسحاق بن منصور نے بیان کیا ، کہا ہم کو عبدالصمدنے خبر دی ، کہا کہ میں نے اپنے والد عبدالوارث سے سنا ، انہوں نے بیان کیا کہ ہم سے ا بو التیاح یزید بن حمید ضبعی نے بیان کیا ، کہا کہ مجھ سے انس بن مالک رضی اللہ عنہ نے بیان کیا ، انہوں نے کہا کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم مدینہ تشریف لائے تو مدینہ کے بلند جانب قباء کے ایک محلہ میں آپ نے ( سب سے پہلے ) قیام کیا جسے بنی عمرو بن عوف کا محلہ کہا جاتا تھا ۔ راوی نے بیان کیا کہ حضور صلی اللہ علیہ وسلم نے وہاں چودہ رات قیام کیا پھر آپ نے قبیلہ بنی النجار کے لوگوں کو بلا بھیجا ۔ انہوں نے بیان کیا کہ انصاربنی النجار آپ کی خدمت میں تلواریں لٹکا ئے ہوئے حاضر ہوئے ۔ راوی نے بیان کیا گویا اس وقت بھی وہ منظر میری نظروں کے سامنے ہے کہ آنحضرت صلی اللہ علیہ وسلم اپنی سواری پر سوار ہیں ۔ حضرت ابوبکر صدیق رضی اللہ عنہ اسی سواری پر آپ کے پیچھے سوار ہیں اور بنی النجار کے انصار آپ کے چاروں طرف حلقہ بنائے ہوئے مسلح پیدل چلے جا رہے ہیں ۔ آخر آپ حضرت ابوایوب انصاری کے گھر کے قریب اتر گئے ۔ راوی نے بیان کیا کہ ابھی تک جہاں بھی نماز کا وقت ہو جاتا وہیں آپ نماز پڑھ لیتے تھے ۔ بکریوں کے ریوڑ جہاں رات کو باندھے جاتے وہاں بھی نماز پڑھ لی جاتی تھی ۔ بیان کیا کہ پھر حضور صلی اللہ علیہ وسلم نے مسجد کی تعمیر کا حکم فرمایا ۔ آپ نے اس کے لئے قبیلہ بنی النجار کے لوگوں کو بلا بھیجا ۔ وہ حاضر ہوئے تو آپ نے فرمایا اے بنو النجار ! اپنے اس باغ کی قیمت طے کر لو ۔ انہوں نے عرض کیا نہیں اللہ کی قسم ہم اس کی قیمت اللہ کے سوا اور کسی سے نہیں لے سکتے ۔ راوی نے بیان کیا کہ اس باغ میں وہ چیزیں تھیں جو میں تم سے بیان کروں گا ۔ اس میں مشرکین کی قبریں تھیں ، کچھ اس میں کھنڈر تھا اور کھجور وں کے درخت بھی تھے ۔ آنحضرت صلی اللہ علیہ وسلم کے حکم سے مشرکین کی قبریں اکھاڑ دی گئیں ، جہاں کھنڈر تھا اسے برا بر کیا گیا اور کھجوروں کے درخت کاٹ دیئے گئے ۔ راوی نے بیان کیا کہ کھجور کے تنے مسجد کی طرف ایک قطار میں بطور دیوار رکھ دیئے گئے اور دروازہ میں ( چوکھٹ کی جگہ ) پتھر رکھ دیئے ، حضرت انس رضی اللہ عنہ نے بیان کیا کہ صحابہ جب پتھر لا رہے تھے تو شعر پڑھتے جاتے تھے آنحضرت صلی اللہ علیہ وسلم بھی ان کے ساتھ خود پتھر لاتے اور شعر پڑھتے ۔ صحابہ یہ شعر پڑھتے کہ اے اللہ ! آخرت ہی کی خیر ، خیر ہے ، پس تو انصار اور مہاجرین کی مدد فرما ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 157,
        "matchingArabicURN": 135670,
        "last_updated": null
    },
    {
        "urduURN": 4038920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3933,
        "hadithSanad": "مجھ سے ابراہیم بن حمزہ نے بیان کیا ، کہا ہم سے حاتم بن اسماعیل نے بیان کیا ، ان سے عبدالرحمٰن بن حمید زہری نے بیان کیا ، انہوں نے خلیفہ عمر بن عبد العزیز سے سنا ، وہ نمر کندی کے بھانجے سائب بن یزید سے دریافت کر رہے تھے کہ",
        "hadithText": "تم نے مکہ میں ( مہاجر کے ) ٹھہر نے کے مسئلہ میں کیا سنا ہے ؟ انہوں نے بیان کیا کہ میں نے حضرت علاء بن حضرمی رضی اللہ عنہ سے سنا ۔ وہ بیان کرتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا مہاجر کو ( حج میں ) طواف وداع کے بعد تین دن ٹھہر نے کی اجازت ہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 158,
        "matchingArabicURN": 135680,
        "last_updated": null
    },
    {
        "urduURN": 4038930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3934,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، کہا ہم سے عبدالعزیز بن ابوحازم نے بیان کیا ، ان سے ان کے والد سلمہ بن دینار نے ، ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "تاریخ کا شمار نبی کریم صلی اللہ علیہ وسلم کی نبوت کے سال سے ہوا اور نہ آپ کی وفات کے سال سے بلکہ اس کا شمار مدینہ کی ہجرت کے سال سے ہوا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 159,
        "matchingArabicURN": 135690,
        "last_updated": null
    },
    {
        "urduURN": 4038940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3935,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، کہا ہم سے معمر نے بیان کیا ، ان سے زہری نے ، ان سے عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "( پہلے ) نماز صرف دو رکعت فرض ہوئی تھی پھر نبی کریم صلی اللہ علیہ وسلم نے ہجرت کی تو وہ فرض رکعات چار رکعات ہو گئیں ۔ البتہ سفر کی حالت میں نماز اپنی حالت میں باقی رکھی گئی ۔ اس روایت کی متابعت عبدالرزاق نے معمر سے کی ہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 160,
        "matchingArabicURN": 135700,
        "last_updated": null
    },
    {
        "urduURN": 4038950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3936,
        "hadithSanad": "ہم سے یحییٰ بن قزعہ نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے زہری نے ، ان سے عامر بن سعد بن مالک نے اور ان سے ان کے والد حضرت سعد بن ابی وقاص رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم حجۃ الوداع 10 ھ کے موقع پر میری مزاج پرسی کے لئے تشریف لائے ۔ اس مرض میں میرے بچنے کی کوئی امید نہیں رہی تھی ۔ میں نے عرض کیا یا رسول اللہ ! مرض کی شدت آپ خود ملاحظہ فرما رہے ہیں ، میرے پاس مال بہت ہے اور صرف میری ایک لڑکی وارث ہے تو کیا میں اپنے دو تہائی مال کا صدقہ کر دوں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ۔ میں نے عرض کیا پھر آدھے کا کر دوں ؟ فرمایا کہ سعد ! بس ایک تہائی کا کر دو ، یہ بھی بہت ہے ۔ تو اگر اپنی اولاد کو مالدار چھوڑ کر جائے تو یہ اس سے بہتر ہے کہ انہیں محتاج چھوڑے اور وہ لوگوں کے سامنے ہاتھ پھیلاتے پھریں ۔ احمد بن یونس نے بیان کیا ، ان سے ابراہیم بن سعد نے کہ ” تم اپنی اولاد کو چھوڑ کر جو کچھ بھی خرچ کرو گے اور اس سے اللہ تعالیٰ کی رضامندی مقصود ہو گی تو اللہ تعالیٰ تمہیں اس کا ثواب دے گا ، اللہ تمہیں اس لقمہ پر بھی ثواب دے گا جو تم اپنی بیوی کے منہ میں ڈالو گے ۔ میں نے پوچھا یا رسول اللہ ! کیا میں اپنے ساتھیوں سے پیچھے مکہ میں رہ جاؤں گا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم پیچھے نہیں رہو گے اور تم جو بھی عمل کرو گے اور اس سے مقصود اللہ تعالیٰ کی رضامندی ہو گی تو تمہارا مرتبہ اس کی وجہ سے بلند ہوتا رہے گا اور شاید تم ابھی بہت دنوں تک زندہ رہو گے تم سے بہت سے لوگوں ( مسلمانوں ) کو نفع پہنچے گا اور بہتوں کو ( غیرمسلموں ) نقصان ہو گا اے اللہ ! میرے صحابہ کی ہجرت پوری کر دے اور انہیں الٹے پاؤں واپس نہ کر ( کہ وہ ہجرت کو چھوڑ کر اپنے گھروں کو واپس آ جائیں ) البتہ سعد بن خولہ نقصان میں پڑ گئے اور احمد بن یونس اور موسیٰ بن اسماعیل نے اس حدیث کو ابراہیم بن سعد سے روایت کیا اس میں ( اپنی اولاد ذریت کو چھوڑو ، کے بجائے ) تم اپنے وارثوں کو چھوڑو یہ الفاظ مروی ہیں ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 161,
        "matchingArabicURN": 135710,
        "last_updated": null
    },
    {
        "urduURN": 4038960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3937,
        "hadithSanad": "ہم سے محمدبن یوسف بیکندی نے بیان کیا ، ان سے سفیان بن عیینہ نے بیان کیا ، ان سے حمید طویل نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جب عبدالرحمٰن بن عوف رضی اللہ عنہ ہجرت کر کے آئے تو آنحضرت صلی اللہ علیہ وسلم ان کا بھائی چارہ سعد بن ربیع انصاری رضی اللہ عنہ کے ساتھ کرایا تھا ۔ سعد رضی اللہ عنہ نے ان سے کہا کہ ان کے اہل و مال میں سے آدھا وہ قبول کر لیں لیکن عبدالرحمٰن رضی اللہ عنہ نے کہا کہ اللہ تعالیٰ آپ کے اہل و مال میں برکت دے ۔ آپ تو مجھے بازار کا راستہ بتا دیں ۔ چنانچہ انہوں نے تجارت شروع کر دی اور پہلے دن انہیں کچھ پنیر اور گھی میں نفع ملا ۔ چند دنوں کے بعد انہیں نبی کریم صلی اللہ علیہ وسلم نے دیکھا کہ ان کے کپڑوں پر ( خوشبو کی ) زردی کا نشان ہے تو آپ نے فرمایا عبدالرحمٰن یہ کیا ہے ؟ انہوں نے عرض کیا یا رسول اللہ میں نے ایک انصاری عورت سے شادی کر لی ہے ۔ حضور صلی اللہ علیہ وسلم نے فرمایا کہ انہیں مہر میں تم نے کیا دیا ؟ انہوں نے بتایا کہ ایک گھٹلی برابر سونا ۔ حضور صلی اللہ علیہ وسلم نے فرمایا اب ولیمہ کرو خواہ ایک ہی بکری کاہو ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 162,
        "matchingArabicURN": 135720,
        "last_updated": null
    },
    {
        "urduURN": 4038970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3938,
        "hadithSanad": "مجھ سے حامد بن عمر نے بیان کیا ، کہا ہم سے بشر بن مفضل نے ، ان سے حمید طویل نے بیان کیا اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
        "hadithText": "جب عبداللہ بن سلام رضی اللہ عنہ کو رسول اللہ صلی اللہ علیہ وسلم کے مدینہ آنے کی خبر ہوئی تو وہ آپ سے چند سوال کرنے کے لئے آئے ۔ انہوں نے کہا کہ میں آپ سے تین چیزوں کے متعلق پوچھوں گا جنہیں نبی کے سوا اور کوئی نہیں جانتا ۔ قیامت کی سب سے پہلی نشانی کیا ہو گی ؟ اہل جنت کی ضیافت سب سے پہلے کس کھانے سے کی جائے گی ؟ اور کیا بات ہے کہ بچہ کبھی باپ پر جاتا ہے اور کبھی ماں پر ؟ حضور صلی اللہ علیہ وسلم نے فرمایا کہ جواب ابھی مجھے حضرت جبرائیل نے آ کر بتایا ہے ۔ عبداللہ بن سلام نے کہا کہ یہ ملائکہ میں یہودیوں کے دشمن ہیں ۔ آپ نے فرمایا قیامت کی پہلی نشانی ایک آگ ہے جو انسانوں کو مشرق سے مغرب کی طرف لے جائے گی ۔ جس کھانے سے سب سے پہلے اہل جنت کی ضیافت ہو گی وہ مچھلی کی کلیجی کا بڑھا ہوا ٹکڑا ہو گا ( جو نہایت لذیذ اور زود ہضم ہوتا ہے ) اور بچہ باپ کی صورت پر اس وقت جاتا ہے جب عورت کے پانی پر مرد کا پانی غالب آ جائے اور جب مرد کے پانی پر عورت کا پانی غالب آ جائے تو بچہ ماں پر جاتا ہے ۔ عبداللہ بن سلام رضی اللہ عنہ نے کہا میں گواہی دیتا ہوں کہ اللہ کے سوا اور کوئی معبود نہیں اور گواہی دیتا ہوں کہ آپ اللہ کے رسول ہیں ۔ پھر انہوں نے عرض کیا یا رسول اللہ ! یہودی بڑے بہتان لگانے والے لوگ ہیں ، اس لئے آپ اس سے پہلے کہ میرے اسلام کے بارے میں انہیں کچھ معلوم ہو ، ان سے میرے متعلق دریافت فرمائیں ۔ چنانچہ چند یہودی آئے تو آپ نے ان سے فرمایا کہ تمہاری قوم میں عبداللہ بن سلام کون ہیں ؟ وہ کہنے لگے کہ ہم میں سب سے بہتر اور سب سے بہتر کے بیٹے ہیں ، ہم میں سب سے افضل اور سب سے افضل کے بیٹے ہیں ۔ آپ نے فرمایا تمہارا کیا خیال ہے اگر وہ اسلام لائیں ؟ وہ کہنے لگے اس سے اللہ تعالیٰ انہیں اپنی پناہ میں رکھے ۔ حضور نے دوبارہ ان سے یہی سوال کیا اور انہوں نے یہی جواب دیا ۔ اس کے بعد عبداللہ بن سلام رضی اللہ عنہ باہر آئے اور کہا میں گواہی دیتا ہوں کہ اللہ سوا کوئی معبود نہیں اور محمد ( صلی اللہ علیہ وسلم ) اللہ کے رسول ہیں ۔ اب وہ کہنے لگے یہ تو ہم میں سب سے بد تر آدمی ہیں اور سب سے بد تر باپ کے بیٹے ہیں ۔ فوراً ہی برائی شروع کر دی ، حضرت عبداللہ بن سلام رضی اللہ عنہ نے عرض کیا یا رسول اللہ ً ! اسی کا مجھے ڈر تھا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 163,
        "matchingArabicURN": 135730,
        "last_updated": null
    },
    {
        "urduURN": 4038980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے علی بن عبداللہ المدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے ، انہوں نے ابومنہال ( عبدالرحمٰن بن مطعم ) سے سنا ، عبدالرحمٰن بن مطعم نے بیان کیا کہ",
        "hadithText": "میرے ایک ساجھی نے بازار میں چند درہم ادھار فروخت کیے ، میں نے اس سے کہا سبحان اللہ ! کیا یہ جائز ہے ؟ انہوں نے کہا سبحان اللہ خدا کی قسم کہ میں نے بازار میں اسے بیچا تو کسی نے بھی قابل اعتراض نہیں سمجھا ۔ میں نے براء  بن عازب رضی اللہ عنہ سے اس کے متعلق پوچھا تو انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم جب ( ہجرت کر کے ) تشریف لائے تو اس طرح خریدوفروخت کیا کرتے تھے ۔ حضور صلی اللہ علیہ وسلم نے فرمایا کہ خریدوفروخت کی اس صورت میں اگر معاملہ دست بدست ( نقد ) ہو تو کوئی مضائقہ نہیں لیکن اگر ادھار پر معاملہ کیا تو پھر یہ صورت جائز نہیں اورزید بن ارقم سے بھی مل کر اس کے متعلق پوچھ لو کیونکہ وہ ہم میں بڑے سوداگر تھے ۔ میں نے زید بن ارقم سے پوچھا تو انہوں نے بھی یہی کہا کہ سفیان نے ایک مرتبہ یوں بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم جب ہمارے یہاں مدینہ تشریف لائے تو ہم ( اس طرح کی ) خریدوفروخت کیا کرتے تھے اور بیان کیا کہ ادھار موسم تک کے لئے یا ( یوں بیان کیا کہ ) حج تک کے لیے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 164,
        "matchingArabicURN": 135741,
        "last_updated": null
    },
    {
        "urduURN": 4038990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3941,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے قرہ بن خالد نے بیان کیا ، ان سے محمد بن سیرین نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اگر دس یہودی ( احبار وعلماء ) مجھ پر ایمان لے آتے تو تمام یہود مسلمان ہو جاتے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 165,
        "matchingArabicURN": 135760,
        "last_updated": null
    },
    {
        "urduURN": 4039000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3942,
        "hadithSanad": "مجھ سے احمد یا محمد بن عبیداللہ غدانی نے بیان کیا ، کہا ہم سے حماد بن اسامہ نے بیان کیا کہ انہیں ابو عمیس نے خبر دی ، انہیں قیس بن مسلم نے ، انہیں طارق بن شہاب نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم مدینہ تشریف لائے تو آپ نے دیکھا کہ یہودی عاشوراء کے دن کی تعظیم کرتے ہیں اور اس دن روزہ رکھتے ہیں آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہم اس دن روزہ رکھنے کے زیادہ حقدار ہیں ۔ چنانچہ آپ نے اس دن کے روزے کا حکم دیا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 166,
        "matchingArabicURN": 135770,
        "last_updated": null
    },
    {
        "urduURN": 4039010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3943,
        "hadithSanad": "ہم سے زیاد بن ایوب نے بیان کیا ، انہوں نے کہا ہم سے ہشیم نے بیان کیا ، انہوں نے کہا ہم سے ابو بشر جعفر نے بیان کیا ، ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم مدینہ تشریف لائے تو آپ نے دیکھا کہ یہودی عاشوراء کے دن روزہ رکھتے ہیں ۔ اس کے متعلق ان سے پوچھا گیا تو انہوں نے بتایا کہ یہ وہ دن ہے جس میں اللہ تعالیٰ نے موسیٰ علیہ السلام اور بنی اسرائیل کو فرعوں پر فتح عنایت فرمائی تھی چنانچہ ہم اس دن کی تعظیم میں روزہ رکھتے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہم موسیٰ علیہ السلام سے تمہاری بہ نسبت زیادہ قریب ہیں اور آپ نے اس دن روزہ رکھنے کا حکم دیا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 167,
        "matchingArabicURN": 135780,
        "last_updated": null
    },
    {
        "urduURN": 4039020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3944,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، انہوں نے کہا ہم سے عبداللہ بن مبارک نے بیان کیا ، انہوں نے کہا کہ ہم سے یونس نے ، ان سے زہری نے بیان کیا ، کہا مجھ کو عبیداللہ عبداللہ بن عتبہ نے خبر دی ، ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم سر کے بال کو پیشانی پر لٹکا دیتے تھے اور مشرکین مانگ نکالتے تھے اور اہل کتاب بھی اپنے سروں کے بال پیشانی پر لٹکائے رہنے دیتے تھے ۔ جن امور میں نبی کریم صلی اللہ علیہ وسلم کو ( وحی کے ذریعہ ) کوئی حکم نہیں ہوتا تھا آپ ان میں اہل کتاب کی موافقت پسند کرتے تھے ۔ پھر بعدمیں آنحضرت صلی اللہ علیہ وسلم بھی مانگ نکالنے لگے تھے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 168,
        "matchingArabicURN": 135790,
        "last_updated": null
    },
    {
        "urduURN": 4039030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3945,
        "hadithSanad": "مجھ سے زیاد بن ایوب نے بیان کیا کہا ہم سے ہشیم نے بیان کیا ، کہا ہم کو ابوبشر ( جابر بن ابی وحشیہ ) نے خبر دی ، انہیں سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے کہا کہ",
        "hadithText": "وہ اہل کتاب ہی تو ہیں جنہوں نے آسمانی کتاب کو ٹکڑے ٹکڑے کر ڈالا ، بعض باتوں پر ایمان لائے اور بعض باتوں کا انکار کیا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 169,
        "matchingArabicURN": 135800,
        "last_updated": null
    },
    {
        "urduURN": 4039040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3946,
        "hadithSanad": "مجھ سے حسن بن شقیق نے بیان کیا ، کہا ہم سے معتمر نے بیان کیا کہ میرے والد سلیمان بن طرخان نے بیان کیا ( دوسری سند ) اور ہم سے ابوعثمان نہدی نے بیان کیا کہا میں نے سنا سلمان فارسی رضی اللہ عنہ سے کہ",
        "hadithText": "ان کو کچھ اوپر دس آدمیوں نے ایک مالک سے ان کو دس سے زائد آدمیوں نے لیا ، ایک مالک نے دوسرے مالک سے خریدا ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 170,
        "matchingArabicURN": 135810,
        "last_updated": null
    },
    {
        "urduURN": 4039050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3947,
        "hadithSanad": "ہم سے محمد بن یوسف بیکندی نے بیان کیا کہا ہم سے ابن عیینہ نے بیان کیا ، ان سے عوف اعرابی نے ، ان سے ابوعثمان نہدی نے بیان کیا ، کہا میں نے حضرت سلمان فارسی سے سنا ، وہ بیان کرتے تھے کہ",
        "hadithText": "میں رام ہرمز ( فارس میں ایک مقام ہے ) کا رہنے والا ہوں ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 171,
        "matchingArabicURN": 135820,
        "last_updated": null
    },
    {
        "urduURN": 4039060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 63,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 3948,
        "hadithSanad": "مجھ سے حسن بن مدرک نے بیان کیا ، کہا ہم سے یحییٰ بن حماد نے بیان کیا ، کہا ہم کو ابو عوانہ نے خبر دی ، انہیں عاصم احول نے ، انہیں ابوعثمان نہدی نے اور ان سے حضرت سلمان فارسی رضی اللہ عنہ نے بیان کیا کہ ،",
        "hadithText": "عیسیٰ علیہ السلام اور محمد صلی اللہ علیہ وسلم کے درمیان میں فترت کا زمانہ ( یعنی جس میں کوئی پیغمبر نہیں آیا ) چھ سو برس کا وقفہ گزراہے ۔</b>",
        "bookID": "63.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 172,
        "matchingArabicURN": 135830,
        "last_updated": null
    }
]