[
    {
        "urduURN": 4049910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5063,
        "hadithSanad": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم کو محمد بن جعفر نے خبر دی ، کہا ہم کو حمید بن ابی حمید طویل نے خبر دی ، انہوں نے حضرت انس بن مالک سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "تین حضرات ( علی بن ابی طالب ، عبداللہ بن عمرو بن العاص اور عثمان بن مظعون رضی اللہ عنہم ) نبی کریم صلی اللہ علیہ وسلم کی ازواج مطہرات کے گھروں کی طرف آپ کی عبادت کے متعلق پوچھنے آئے ، جب انہیں حضور اکرم صلی اللہ علیہ وسلم کا عمل بتایا گیاتو جیسے انہوں نے اسے کم سمجھا اور کہا کہ ہمارا آنحضرت صلی اللہ علیہ وسلم سے کیا مقابلہ ! آپ کی تو تمام اگلی پچھلی لغزشیں معاف کر دی گئی ہیں ۔ ان میں سے ایک نے کہا کہ آج سے میں ہمیشہ رات پھر نماز پڑھا کروں گا ۔ دوسرے نے کہا کہ میں ہمیشہ روزے سے رہوں گا اور کبھی ناغہ نہیں ہونے دوں گا ۔ تیسرے نے کہا کہ میں عورتوں سے جدائی اختیار کر لوں گا اور کبھی نکاح نہیں کروں گا ۔ پھر آنحضرت صلی اللہ علیہ وسلم تشریف لائے اور ان سے پوچھا کیا تم نے ہی یہ باتیں کہی ہیں ؟ سن لو ! اللہ تعالیٰ کی قسم ! اللہ رب العالمین سے میں تم سب سے زیادہ ڈرنے والا ہوں ۔ میں تم میں سب سے زیادہ پرہیزگار ہوں لیکن میں اگر روزے رکھتا ہوں تو افطار بھی کرتا ہوں ۔ نماز پڑھتا ہوں ( رات میں ) اور سوتا بھی ہوں اور میں عورتوں سے نکاح کرتا ہوں ۔ میرے طریقے سے جس نے بے رغبتی کی وہ مجھ میں سے نہیں ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 142640,
        "last_updated": null
    },
    {
        "urduURN": 4049920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5064,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، انہوں نے حسان بن ابراہیم سے سنا ، انہوں نے یونس بن یزید ایلی سے ، ان سے زہری نے ، کہا مجھ کو عروہ بن زبیر نے خبر دی",
        "hadithText": "اور انہوں نے عائشہ رضی اللہ عنہا سے اللہ تعالیٰ کے اس ارشاد وإن خفتم أن لا تقسطوا في اليتامى فانكحواء ما طاب لكم من النساء کے متعلق پوچھا ” اور اگر تمہیں اندیشہ ہو کہ تم یتیموں سے انصاف نہ کرسکوگے تو جو عورتیں تمہیں پسند ہوں ان سے نکاح کر لو ۔ دودو سے ، خواہ تین تین سے ، خواہ چار چار سے ، لیکن اگر تمہیں اندیشہ ہو کہ تم انصاف نہیں کر سکوگے تو پھر ایک ہی پر بس کرو یا جو لونڈی تمہاری ملک میں ہو ، اس صورت میں قوی امید ہے کہ تم ظلم وزیادتی نہ کر سکوگے ۔ عائشہ رضی اللہ عنہا نے کہا بھانجے ! آیت میں ایسی یتیم مالدار لڑکی کا ذکر ہے جو اپنے ولی کی پرورش میں ہو ۔ وہ لڑکی کے مال اور اس کے حسن کی وجہ سے اس کی طرف مائل ہو اور اس سے معمولی مہر پر شادی کر نا چاہتا ہو تو ایسے شخص کو اس آیت میں ایسی لڑکی سے نکاح کرنے سے منع کیا گیا ہے ۔ ہا ں اگر اس کے ساتھ انصاف کر سکتا ہو اور پورا مہر ادا کرنے کا ارادہ رکھتا ہو تو اجازت ہے ، ورنہ ایسے لوگوں سے کہا گیا ہے کہ اپنی پرورش میں یتیم لڑکیوں کے سوا اور دوسری لڑکیوں سے شادی کر لیں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 142650,
        "last_updated": null
    },
    {
        "urduURN": 4049930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5065,
        "hadithSanad": "ہم سے عمر بن حفص نے بیان کیا ، مجھ سے ابراہیم نے بیان کیا ، ان سے اعمش نے بیان کیا ، کہا کہ مجھ سے ابراہیم نے بیان کیا ، ان سے علقمہ بن قیس نے بیان کیا کہ",
        "hadithText": "میں حضرت عبداللہ بن مسعود رضی اللہ عنہما کے ساتھ تھا ، ان سے حضرت عثمان رضی اللہ عنہ نے منیٰ میں ملاقات کی اور کہا اے ابوعبدالرحمن ! مجھے آپ سے ایک کام ہے پھر وہ دونوں تنہائی میں چلے گئے ۔ حضرت عثمان رضی اللہ عنہ نے ان سے کہا اے ابوعبدالرحمن ! کیا آپ منظور کریں گے کہ ہم آپ کا نکاح کسی کنواری لڑکی سے کر دیں جو آپ کو گزرے ہوئے ایام یاد دلا دے ۔ چونکہ حضرت عبداللہ رضی اللہ عنہ اس کی ضرورت محسوس نہیں کرتے تھے اس لئے انہوں نے مجھے اشارہ کیا اور کہا علقمہ ! میں جب ان کی خدمت میں پہنچا تو وہ کہہ رہے تھے کہ اگر آپ کا یہ مشورہ ہے تو رسول کریم صلی اللہ علیہ وسلم نے ہم سے فرمایا تھا اے نوجوانو ! تم میں جو بھی شادی کی طاقت رکھتا ہو اسے نکاح کر لینا چاہئے کیونکہ یہ خواہش نفسانی کو توڑ دے گا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 142660,
        "last_updated": null
    },
    {
        "urduURN": 4049940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5066,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا مجھ سے میرے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا کہ مجھ سے عمارہ نے بیان کیا ، ان سے عبدالرحمٰن بن یزید نے بیان کیا ، کہا کہ",
        "hadithText": "میں نے علقمہ اور اسود ( رحمہم اللہ ) کے ساتھ حضرت عبداللہ بن مسعود رضی اللہ عنہما کی خدمت میں حاضر ہوا ، انہوں نے ہم سے کہا کہ ہم نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں نوجوان تھے اور ہمیں کوئی چیز میسر نہیں تھی ۔ حضور اکرم صلی اللہ علیہ وسلم نے ہم سے فرمایا ، نوجوانوں کی جماعت ! تم میں جسے بھی نکاح کرنے کے لئے مالی طاقت ہو اسے نکاح کر لینا چاہئے کیونکہ یہ نظر کو نیچی رکھنے والا اور شرمگاہ کی حفاظت کرنے والا عمل ہے اور جو کوئی نکاح کی بوجہ غربت طاقت نہ رکھتا ہو اسے چاہیے کہ روزہ رکھے کیونکہ روزہ اس کی خواہشات نفسانی کو توڑ دے گا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 142670,
        "last_updated": null
    },
    {
        "urduURN": 4049950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5067,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا کہ ہم کو ہشام بن یوسف نے خبر دی ، انہیں ابن جریج نے خبر دی ، کہا کہ مجھے عطابن ابی رباح نے خبر دی کہا کہ",
        "hadithText": "ہم ابن عباس رضی اللہ عنہما کے ساتھ ام المؤمنین حضرت میمونہ رضی اللہ عنہا کے جنازہ میں شریک تھے ۔ حضرت ابن عباس رضی اللہ عنہما نے کہا کہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ہیں جب تم ان کا جنازہ اٹھاؤ تو زور زور سے حرکت نہ دینا بلکہ آہستہ آہستہ نرمی کے ساتھ جنازہ کو لے کر چلنا ۔ نبی کریم صلی اللہ علیہ وسلم کے پاس آپ صلی اللہ علیہ وسلم کی وفات کے وقت آپ صلی اللہ علیہ وسلم کے نکاح میں نو بیویاں تھیں آٹھ کے لئے تو آپ صلی اللہ علیہ وسلم نے باری مقرر کر رکھی تھی لیکن ایک کی باری نہیں تھی ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 142680,
        "last_updated": null
    },
    {
        "urduURN": 4049960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5068,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ۔ کہا ہم سے یزید بن زریع نے بیان کیا ، کہا ہم سے سعید نے بیان کیا ، ان سے قتادہ نے ، ا ن سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ایک مرتبہ ایک ہی رات میں اپنی تمام بیویوں کے پاس گئے آنحضرت صلی اللہ علیہ وسلم کے پاس نو بیویاں تھیں ۔ حضرت امام بخاری نے کہا کہ مجھ سے خلیفہ ابن خیاط نے بیان کیا ، کہا ہم سے سعید نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا ، انہوں نے آنحضرت صلی اللہ علیہ وسلم سے پھر یہی حدیث بیان کی ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 142691,
        "last_updated": null
    },
    {
        "urduURN": 4049970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5069,
        "hadithSanad": "ہم سے علی بن حکم انصاری نے بیان کیا ، کہا ہم سے ابو عوانہ نے بیان کیا ، ان سے رقبہ نے ، ان سے طلحہ الیامی نے ، ان سے سعید بن جبیر نے بیان کیا کہ مجھ سے ابن عباس رضی اللہ عنہما نے دریافت فرمایا کہ",
        "hadithText": "تم نے شادی کر لی ہے ؟ میں نے عرض کیا کہ نہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا شادی کر لو کیونکہ اس امت کے بہترین شخص جو تھے ( یعنی آنحضرت صلی اللہ علیہ وسلم ) ان کی بہت سی بیویاں تھیں ۔ بعضوں نے یوں ترجمہ کیا ہے کہ اس امت میں اچھے وہی لوگ ہیں جن کی بہت عورتیں ہوں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 142710,
        "last_updated": null
    },
    {
        "urduURN": 4049980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5070,
        "hadithSanad": "ہم سے یحی بن قزعہ نے بیان کیا ، کہا ہم سے امام مالک نے بیان کیا ، ان سے یحی بن سعید نے ، ان سے محمدبن ابراہیم بن حارث نے ، ان سے علقمہ بن وقاص نے اور ان سے عمر بن الخطاب رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا عمل کا دار ومدار نیت پر ہے اور ہر شخص کو وہی ملتا ہے جس کی وہ نیت کرے اس لئے جس کی ہجرت اللہ اور اس کے رسول کی رضا حاصل کرنے کے لیے ہو ، اسے اللہ اور اس کے رسول کی رضا حاصل ہو گی لیکن جس کی ہجرت دنیا حاصل کرنے کی نیت سے یا کسی عورت سے شادی کرنے کے اردہ سے ہو ، اس کی ہجرت اسی کے لئے ہے جس کے لئے اس نے ہجرت کی ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 142720,
        "last_updated": null
    },
    {
        "urduURN": 4049990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5071,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، کہا ہم سے اسماعیل نے بیان کیا ، ان سے قیس نے بیان کیا اور ان سے حضرت ابن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ جہاد کیا کرتے تھے اور ہمار ے ساتھ بیویاں نہیں تھیں ۔ اس لئے ہم نے کہا کہ یا رسول اللہ ! ہم اپنے آپ کو خصی کیوں نہ کر لیں ؟ آپ نے ہمیں اس سے منع فرمایا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 142730,
        "last_updated": null
    },
    {
        "urduURN": 4050000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5072,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے ، ان سے حمید طویل نے بیان کیا کہ میں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، بیان کیا کہ",
        "hadithText": "عبدالرحمن بن عوف رضی اللہ عنہ ( ہجرت کر کے مدینہ ) آئے تو نبی کریم صلی اللہ علیہ وسلم نے ان کے اور سعد بن ربیع انصاری رضی اللہ عنہ کے درمیان بھائی چارہ کرایا ۔ سعد انصاری رضی اللہ عنہ کے نکاح میںدو بیو یاںتھیں ۔ انہوں نے عبدالرحمٰن رضی اللہ عنہ سے کہا کہ وہ ان کے اہل ( بیوی ) اور مال میں سے آدھے لیں ۔ اس پر عبد الر حمن نے کہا کہ اللہ تعا لیٰ آپ کے اہل اور آپ کے مال میں برکت دے ، مجھے تو بازار کا راستہ بتا دو ۔ چنانچہ آپ بازار آئے اور یہاں آپ نے کچھ پنیر اور کچھ گھی کی تجارت کی اور نفع کمایا ۔ چند دنوں کے بعد ان پر زعفران کی زردی لگی ہوئی تھی ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ عبدالرحمٰن یہ کیا ہے ؟ انہوں نے عرض کیا کہ میں نے ایک انصار ی خاتون سے شادی کر لی ہے ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ انہیں مہر میں کیا دیا عرض کیا کہ ایک گٹھلی برابر سونا دیا ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا پھر ولیمہ کر اگرچہ ایک بکری ہی کا ہو ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 142740,
        "last_updated": null
    },
    {
        "urduURN": 4050010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5073,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، کہا ہم کو ابن شہاب نے خبر دی ، انہوں نے سعید بن مسیب سے سنا ، وہ کہتے ہیں کہ",
        "hadithText": "میں نے حضرت سعد بن ابی وقاص رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ رسول کریم صلی اللہ علیہ وسلم نے تبتل یعنی عورتوں سے الگ رہنے کی زندگی سے منع فرمایا تھا ۔ اگر آنحضرت صلی اللہ علیہ وسلم انہیں اجازت دے دیتے تو ہم تو خصی ہی ہو جاتے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 142760,
        "last_updated": null
    },
    {
        "urduURN": 4050020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5074,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، کہا مجھے سعید بن مسیب نے خبر دی اور انہوں نے حضرت سعد بن ابی وقاص رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے حضرت عثمان بن مظعون رضی اللہ عنہ کو عورت سے الگ رہنے کی اجازت نہیں دی تھی ۔ اگر آنحضرت صلی اللہ علیہ وسلم انہیں اس کی اجازت دے دیتے تو ہم بھی اپنے کو خصی بنا لیتے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 142770,
        "last_updated": null
    },
    {
        "urduURN": 4050030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5075,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے جریر نے ، ان سے اسمٰعیل بن ابی خالد بجلی نے ، ان سے قیس بن ابی حازم نے بیان کیا اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جہاد کو جایا کرتے تھے اور ہمارے پاس روپیہ نہ تھا ( کہ ہم شادی کر لیتے ) اس لئے ہم نے عرض کیا ہم اپنے کو خصی کیوں نہ کرالیں لیکن آنحضرت صلی اللہ علیہ وسلم نے ہمیں اس سے منع فرمایا ۔ پھر ہمیں اس کی اجازت دے دی کہ ہم کسی عورت سے ایک کپڑے پر ( ایک مدت تک کے لئے ) نکاح کر لیں ۔ آپ نے ہمیں قرآن مجید کی یہ آیت پڑھ کر سنا ئی کہ ” ایمان لانے والو ! وہ پاکیزہ چیزیں مت حرام کرو جو تمہارے لئے اللہ تعالیٰ نے حلال کی ہیں اور حد سے آگے نہ بڑھو ، بیشک اللہ حد سے آگے بڑھنے والوں کو پسند نہیں کرتا “ ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 142780,
        "last_updated": null
    },
    {
        "urduURN": 4050040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5076,
        "hadithSanad": "اور اصبغ نے کہا کہ مجھے ابن وہب نے خبر دی ، انہیں یونس بن یزید نے ، انہیں ابن شہاب نے ، انہیں ابوسلمہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے رسول کریم صلی اللہ علیہ وسلم سے عرض کیا کہ یا رسول اللہ ! میں نوجوان ہوں اور مجھے اپنے پر زنا کا خوف رہتا ہے ۔ میرے پاس کوئی ایسی چیز نہیں جس پر میں کسی عورت سے شادی کر لوں ۔ آپ میری یہ بات سن کر خاموش رہے ۔ دوبارہ میں نے اپنی یہی بات دہرائی لیکن آپ اس مر تبہ بھی خاموش رہے ۔ سہ بارہ میں نے عرض کیا آپ پھر بھی خاموش رہے ۔ میں نے چو تھی مرتبہ عرض کیا آپ نے فرمایا اے ابوہریرہ ! جو کچھ تم کرو گے اسے ( لوح محفوظ میں ) لکھ کر قلم خشک ہوچکاہے ۔ خواہ اب تم خصی ہو جاؤ یا باز رہو ۔ یعنی خصی ہونا بیکار محض ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 142790,
        "last_updated": null
    },
    {
        "urduURN": 4050050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5077,
        "hadithSanad": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے میرے بھائی عبدالحمید نے بیان کیا ، ان سے سلیمان بن بلال نے ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میں نے عرض کیا یا رسول اللہ ! فرمائیے اگر آپ کسی وادی میں اتریں اور اس میں ایک درخت ایسا ہو جس میں اونٹ چر گئے ہوں اور ایک درخت ایسا ہو جس میں سے کچھ بھی نہ کھایا گیا ہو تو آپ اپنا اونٹ ان درختوںمیں سے کس درخت میں چرائیں گے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس درخت میں جس میں سے ابھی چرا یا نہیں گیا ہو ۔ ان کا اشارہ اس طرف تھا کہ رسول اللہ صلی اللہ علیہ وسلم نے ان کے سوا کسی کنواری لڑکی سے نکاح نہیں کیا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 142800,
        "last_updated": null
    },
    {
        "urduURN": 4050060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5078,
        "hadithSanad": "ہم سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے اسامہ نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا اے عائشہ ! مجھے خواب میں دو مرتبہ تم دکھائی گئیں ۔ ایک شخص ( جبرائیل ) تمہاری صورت حریر کے ایک ٹکڑے میں اٹھائے ہوئے ہے اور کہتا ہے کہ یہ آپ کی بیوی ہے میں نے جو اس کپڑے کو کھولا تو اس میں تم تھیں ۔ میں نے خیا ل کیا کہ اگر یہ خواب اللہ کی طرف سے ہے تو وہ اسے ضرور پورا کر کے رہے گا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 142810,
        "last_updated": null
    },
    {
        "urduURN": 4050070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5079,
        "hadithSanad": "ہم سے ابو النعمان نے بیان کیا ، کہا ہم سے ہشیم نے بیان کیا ، کہا ہم سے سیا ر بن ابی سیار نے بیان کیا ، ان سے عامر شعبی نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک جہاد سے واپس ہو رہے تھے ۔ میں اپنے اونٹ کو ، جو سست تھا تیز چلانے کی کو شش کر رہا تھا ۔ اتنے میں میرے پیچھے سے ایک سوار مجھ سے آکرملا اور اپنا نیزہ میرے اونٹ کو چبھو دیا ۔ اس کی وجہ سے میرا اونٹ تیز چل پڑا جیسا کہ کسی عمدہ قسم کے اونٹ کی چال تم نے دیکھی ہو گی ۔ اچانک نبی کریم صلی اللہ علیہ وسلم مل گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا جلدی کیوں کر رہے ہو ؟ میں نے عرض کیا ابھی میری شادی نئی ہوئی ہے ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایاکنواری سے یا بیوہ سے ؟ میں نے عرض کیا کہ بیوہ سے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ کسی کنواری سے کیوںنہ کی تم اس کے ساتھ کھیل کود کرتے اور وہ تمہارے ساتھ کرتی ۔ بیان کیا کہ پھر جب ہم مدینہ میں داخل ہونے والے تھے تو آپ نے فرمایا کہ تھوڑی دیر ٹھہر جاؤ اور رات ہو جائے تب داخل ہو تاکہ پریشان بالوں والی کنگھا کر لیوے اورجن کے شوہرموجود نہیں تھے وہ اپنے بال صاف کر لیں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 142830,
        "last_updated": null
    },
    {
        "urduURN": 4050080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5080,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے محارب بن دثار نے بیان کیا ، کہا کہ میں نے حضرت جابر بن عبداللہ رضی اللہ عنہما سے سنا ، انہوں نے عرض کیا کہ",
        "hadithText": "میں نے شادی کی تو نبی کریم صلی اللہ علیہ وسلم نے مجھ سے دریافت فرمایا کہ کس سے شادی کی ہے ؟ میں نے عرض کیا کہ ایک عورت سے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کنواری سے کیوں نہ کی کہ اس کے ساتھ تم کھیل کو د کرتے ۔ محارب نے کہا کہ پھر میں نے آنحضرت صلی اللہ علیہ وسلم کا یہ ارشاد عمرو بن دینا ر سے بیان کیا تو انہوں نے کہا کہ میں نے حضرت جابر بن عبداللہ رضی اللہ عنہماسے سناہے ۔ مجھ سے انہوں نے آنحضرت صلی اللہ علیہ وسلم کا فرمان اس طرح بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا تم نے کسی کنواری عورت سے شادی کیوں نہ کی کہ تم اس کے ساتھ کھیل کود کرتے اور وہ تمہارے ساتھ کھیلتی ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 142840,
        "last_updated": null
    },
    {
        "urduURN": 4050090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5081,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا ہم سے لیث بن سعد نے ، ان سے یزید بن حبیب نے ، ان سے عراک بن مالک نے اور ان سے عروہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے عائشہ سے شادی کے لئے ابوبکر صدیق رضی اللہ عنہ سے کہا ۔ ابوبکر رضی اللہ عنہ نے آنحضرت صلی اللہ علیہ وسلم سے عرض کی کہ میں آپ کا بھائی ہوں ۔ ( تو عائشہ کیسے نکاح کریں گے ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کے دین اور اس کی کتاب پر ایمان لانے کے رشتہ سے تم میرے بھائی ہو اور عائشہ میرے لئے حلال ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 142850,
        "last_updated": null
    },
    {
        "urduURN": 4050100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5082,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعبہ نے خبر دی ، ان سے ابوالزناد نے بیان کیا ، ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اونٹ پر سوار ہونے والی ( عرب ) عورتوں میں بہترین عورت قریش کی صالح عورت ہوتی ہے جو اپنے بچے سے بہت زیا دہ محبت کرنے والی اور اپنے شوہر کے مال اسباب میں اس کی بہت عمدہ نگہبان و نگراں ثابت ہوتی ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 142870,
        "last_updated": null
    },
    {
        "urduURN": 4050110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5083,
        "hadithSanad": "ہم سے موسیٰ بن اسمٰعیل نے بیان کیا ، کہا ہم سے عبد الوحد بن زیاد نے ، کہا ہم سے صالح بن صالح ہمدانی نے ، کہا ہم سے عامر شعبی نے ، کہا کہ مجھ سے ابوبردہ نے بیان کیا اپنے والد سے ، انہوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا : جس شخص کے پاس لونڈی ہو وہ اسے تعلیم دے اور خوب اچھی طرح دے ، اسے ادب سکھا ئے اور پوری کوشش اور محنت کے ساتھ سکھائے اور اس کے بعد اسے آزاد کر کے اس سے شادی کر لے تو اسے دہر اثواب ملتا ہے اور اہل کتاب میں سے جو شخص بھی اپنے نبی پر ایمان رکھتا ہو اور مجھ پر ایما ن لائے تو اسے دوہر ا ثواب ملتا ہے اور جو غلام اپنے آقا کے حقوق بھی ادا کرتا ہے اور اپنے رب کے حقوق بھی ادا کرتا ہے اسے دہرا ثواب ملتا ہے عامر شعبی نے ( اپنے شاگرد سے اس حدیث کو سنا نے کے بعد کہا کہ بغیر کسی مشقت اورمحنت کے اسے سیکھ لو ۔ اس سے پہلے طالب علموں کو اس حدیث سے کم کے لئے بھی مدینہ تک کا سفر کرنا پڑتا تھا ۔ اور ابوبکرنے بیان کیا ابو حصین سے ، اس نے ابوبردہ سے ، اس نے اپنے والد سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ ” اس شخص نے باندی کو ( نکاح کرنے کے لئے ) آزادکر دیا اور یہی آزادی اس کا مہر مقرر کی ۔ “</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 142880,
        "last_updated": null
    },
    {
        "urduURN": 4050120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5084,
        "hadithSanad": "ہم سے سعید بن تلید نے بیان کیا ، کہا کہ مجھے عبداللہ بن وہب نے خبر دی ، کہا کہ مجھے جریر بن حازم نے خبرد ی ، انہیں ایوب سختیانی نے ، انہیں محمد بن سیرین نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ ( دوسری سند ) ہم سے سلیمان بن حرب نے بیان کیا ، ان سے حماد بن زید نے ، ان سے ایوب سختیانی نے ، ان سے محمد بن سیرین نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ حضرت ابراہیم علیہ السلام کی زبان سے تین مرتبہ کے سوا کبھی دین میں جھوٹ بات نہیں نکلی ۔ ایک مرتبہ آپ ایک ظالم بادشاہ کی حکومت سے گزر ے آپ کے ساتھ آپ کی بیوی سارہ علیہ السلام تھیں ۔ پھر پورا واقعہ بیان کیا ( کہ باد شاہ کے سامنے ) آپ نے سارہ علیہ السلام کو اپنی بہن ( یعنی دینی بہن ) کہا ۔ پھر اس بادشاہ نے سارہ علیہ السلام کو ہاجرہ ( ہاجرہ ) کو دے دیا ۔ ( بی بی سارہ علیہ السلام نے ابراہیم علیہ السلام سے ) کہا کہ اللہ تعالیٰ نے کافر کے ہاتھ کو روک دیا اور آجر ( ہاجرہ ) کو میری خدمت کے لئے دلوا دیا ۔ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ اے آسمان کے پانی کے بیٹو ! یعنی اے عرب والو ! یہی ہاجرہ علیہ السلام تمہاری ماں ہیں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 142890,
        "last_updated": null
    },
    {
        "urduURN": 4050130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5085,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا کہ ہم سے اسمٰعیل بن جعفر نے بیان کیا ، ان سے حمیدی نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے خیبر اور مدینہ کے درمیان تین دن تک قیام کیا اور یہیں ام المؤمنین حضرت صفیہ بنت حیی رضی اللہ عنہا کے ساتھ خلوت کی ۔ پھر میں نے آنحضرت صلی اللہ علیہ وسلم کے ولیمہ کی مسلمانوں کو دعوت دی ۔ اس دعوت ولیمہ میں نہ تو روٹی تھی اور نہ گوشت تھا ۔ دسترخوان بچھا نے کا حکم ہوا اور اس پر کھجور ، پنیر اور گھی رکھ دیا گیا اور یہی آنحضرت صلی اللہ علیہ وسلم کا ولیمہ تھا ۔ بعض مسلمانوں نے پوچھا کہ حضرت صفیہ امہات المؤمنین میں سے ہیں ( یعنی آنحضرت صلی اللہ علیہ وسلم نے ان سے نکاح کیا ہے ) یا لونڈی کی حیثیت سے آپ نے ان کے ساتھ خلوت کی ہے ؟ اس پرکچھ لوگو ں نے کہا کہ اگر آنحضرت صلی اللہ علیہ وسلم ان کے لئے پردہ کا انتظام فرمائیں تو اس سے ثابت ہو گا کہ وہ امہات المؤمنین میں سے ہیں اور اگر ان کے لئے پردہ کا اہتمام نہ کریں تو اس سے ثابت ہو گا کہ وہ لونڈی کی حیثیت سے آپ کے ساتھ ہیں ۔ پھر جب کوچ کرنے کا وقت ہوا تو آنحضرت صلی اللہ علیہ وسلم نے ان کے لئے اپنی سواری پر بیٹھنے کے لئے جگہ بنا ئی اور ان کے لئے پردہ ڈالا تاکہ لوگوں کو وہ نظر نہ آئیں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 142900,
        "last_updated": null
    },
    {
        "urduURN": 4050140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5086,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ثابت بنانی اورشعیب بن حبحاب نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے حضرت صفیہ رضی اللہ عنہا کو آزاد کیا اور ان کی آزادی کو ان کا مہر قرار دیا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 142910,
        "last_updated": null
    },
    {
        "urduURN": 4050150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5087,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے عبد العزیز بن ابی حازم نے بیان کیا ، ان سے ان کے والد نے اور ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک عورت نبی کریم صلی اللہ علیہ وسلم کی خدمت میں آئی اور عرض کیا کہ یا رسول اللہ ! میں آپ کی خدمت میں اپنے آپ کو آپ کے لئے وقف کرنے حاضر ہوئی ہوں ۔ راوی نے بیان کیا کہ پھر انحضرت صلی اللہ علیہ وسلم نے نظر اٹھا کر اسے دیکھا ۔ پھر آپ نے نظر کو نیچی کر لیا اور پھر اپنا سر جھکا لیا ۔ جب اس عورت نے دیکھا کہ آنحضرت صلی اللہ علیہ وسلم نے ان کے متعلق کوئی فیصلہ نہیں فرمایا تو وہ بیٹھ گئی ۔ اس کے بعد آپ صلی اللہ علیہ وسلم کے ایک صحابی کھڑے ہوئے اور عرض کیا یا رسول اللہ ! اگر آپ کو ان سے نکاح کی ضرورت نہیں ہے تو ان سے میرا نکاح کر دیجئیے ۔ آپ نے دریافت فرمایا تمہارے پاس ( مہر کے لئے ) کوئی چیز ہے ؟ انہوں نے عرض کیا کہ نہیں اللہ کی قسم یا رسول اللہ ! آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ اپنے گھر جا اور دیکھو ممکن ہے تمہیں کوئی چیز مل جائے ۔ وہ گئے اور واپس آ گئے اور عرض کیا اللہ کی قسم میں نے کچھ نہیں پایا ۔ آنحضرت صلی اللہ علیہ وسلم نے فر مایا اگر لوہے کی ایک انگوٹھی بھی مل جائے تو لے آؤ ۔ وہ گئے اور واپس آ گئے اور عرض کیا ۔ اللہ کی قسم ، یا رسول اللہ ! میرے پاس لوہے کی ایک انگوٹھی بھی نہیں البتہ میرے پاس ایک تہمد ہے ۔ انہیں ( خاتون کو ) اس میں سے آدھا دے دیجئیے ۔ حضرت سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ ا ن کے پاس چادر بھی نہیں تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا یہ تمہارے اس تہمد کا کیا کرے گی ۔ اگر تم اسے پہنو گے تو ان کے لئے اس میں سے کچھ نہیں بچے گا اور اگر وہ پہن لے تو تمہارے لئے کچھ نہیں رہے گا ۔ اس کے بعد وہ صحابی بیٹھ گئے ۔ کافی دیر تک بیٹھے رہنے کے بعد جب وہ کھڑے ہوئے تو آنحضرت صلی اللہ علیہ وسلم نے انہیں دیکھا کہ وہ واپس جا رہے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے انہیں بلوایا جب وہ آئے تو آپ نے دریافت فرمایا کہ تمہیں قرآن مجید کتنا یاد ہے ؟ انہوں نے عرض کیا کہ فلاں فلاں سورتیں یاد ہیں ۔ انہوں نے گن کر بتا ئیں ۔ آنحضرت صلی اللہ علیہ وسلم نے پو چھا کیا تم انہیں بغیر دیکھے پڑھ سکتے ہو ؟ انہوں نے عرض کیا کہ جی ہاں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا پھر جاؤ ۔ میں نے انہیں تمہارے نکاح میں دیا ۔ ان سورتوں کے بدلے جو تمہیں یاد ہیں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 142920,
        "last_updated": null
    },
    {
        "urduURN": 4050160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5088,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے ، انہیں عروہ بن زبیرنے خبر دی اور انہیں عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "ابوحذیفہ بن عتبہ بن ربیعہ بن عبد شمس ( مہشم ) نے جو ان صحابہ میں سے تھے جنہوںنے نبی کریم صلی اللہ علیہ وسلم کے ساتھ غزوہ بدر میں شرکت کی تھی ۔ سالم بن معقل رضی اللہ عنہ کو لے پالک بیٹا بنایا ، اور پھر ان کا نکاح اپنے بھائی کی لڑکی ہندہ بنت الولید بن عتبہ بن ربیعہ سے کر دیا ۔ پہلے سالم رضی اللہ عنہ ایک انصاری خاتون ( شبیعہ بنت یعار ) کے آزاد کردہ غلام تھے لیکن حذیفہ نے ان کو اپنا منہ بولا بیٹا بنایا تھا جیسا کہ نبی کریم صلی اللہ علیہ وسلم نے زید کو ( جو آپ ہی کے آزاد کردہ غلام تھے ) اپنا لے پالک بیٹا بنایا تھا جاہلیت کے زمانے میں یہ دستور تھا کہ اگر کوئی شخص کسی کو لے پالک بیٹا بنا لیتا تو لوگ اسے اسی کی طرف نسبت کر کے پکارا کرتے تھے اور لے پالک بیٹا اس کی میراث میں سے بھی حصہ پاتا آخر جب سورۃ الحجرات میں یہ آیت اتری کہ ” انہیں ان کے حقیقی باپوں کی طرف منسوب کر کے پکارو “ اللہ تعالیٰ کے فرمان ” وموالیکم “ تک تو لوگ انہیں ان کے باپوں کی طرف منسوب کر کے پکارنے لگے جس کے باپ کا علم نہ ہوتا تو اسے ” مولی “ اور دینی بھائی کہا جاتا ۔ پھر سہلہ بنت سہیل بن عمرو القرشی ثم العامدی رضی اللہ عنہا جو حضرت ابوحذیفہ رضی اللہ عنہ کی بیوی ہیں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور عرض کیا یا رسول اللہ ! ہم تو سالم کو اپنا حقیقی جیسا بیٹا سمجھتے تھے اب اللہ نے جو حکم اتارا وہ آپ کو معلوم ہے پھر آخر تک حدیث بیان کی ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 142930,
        "last_updated": null
    },
    {
        "urduURN": 4050170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5089,
        "hadithSanad": "ہم سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم ضباعہ بنت زبیر رضی اللہ عنہما کے پاس گئے ( یہ زبیر عبدالمطلب کے بیٹے اور آنحضرت صلی اللہ علیہ وسلم کے چچا تھے ) اور ان سے فرمایا شاید تمہارا ارادہ حج کا ہے ؟ انہوں نے عرض کیا اللہ کی قسم میں تو اپنے آپ کو بیمار پاتی ہوں آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ پھربھی حج کا احرام باندھ لے ۔ البتہ شرط لگا لینا اور یہ کہہ لینا کہ اے اللہ ! میں اس وقت حلال ہو جاؤں گی جب تو مجھے ( مرض کی وجہ سے ) روک لے گا ۔ اور ( ضباعہ بنت زبیر قریشی رضی اللہ عنہا ) مقداد بن اسود رضی اللہ عنہ کے نکاح میں تھیں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 142940,
        "last_updated": null
    },
    {
        "urduURN": 4050180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5090,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے یحی بن سعید قطان نے ، ان سے عبیداللہ عموی نے ، کہ مجھ سے سعید بن ابی سعید نے ، ان سے ان کے والد نے اور ان سے ابوہریرہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، عورت سے نکاح چار چیزوں کی بنیاد پر کیا جاتا ہے اس کے مال کی وجہ سے اور اس کے خاندانی شرف کی وجہ سے اور اس کی خوبصورتی کی وجہ سے اور اس کے دین کی وجہ سے اور تو دیندار عورت سے نکاح کر کے کامیابی حاصل کر ، اگر ایسا نہ کرے تو تیرے ہاتھوں کومٹی لگے گی ( یعنی اخیر میں تجھ کو ندامت ہو گی ) ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 142950,
        "last_updated": null
    },
    {
        "urduURN": 4050190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5091,
        "hadithSanad": "ہم سے ابراہیم بن حمزہ نے بیان کیا ، کہا ہم سے عبد العزیز بن ابی حازم نے ، ان سے ان کے والد سلمہ بن دینار نے ، ان سے سہل بن سعد ساعدی نے بیان کیا کہ",
        "hadithText": "ایک صاحب ( جو مالدار تھے ) رسول اللہ صلی اللہ علیہ وسلم کے سامنے سے گزرے ۔ آنحضرت صلی اللہ علیہ وسلم نے اپنے پاس موجود صحابہ سے پوچھا کہ یہ کیسا شخص ہے ؟ صحابہ نے عرض کیا کہ یہ اس لائق ہے کہ اگر یہ نکاح کا پیغام بھیجے تو اس سے نکاح کیا جائے ، اگر کسی کی سفارش کرے تو اس کی سفارش قبول کی جائے ، اگر کوئی بات کہے تو غور سے سنی جائے ۔ سہل نے بیان کیا کہ حضور اکرم صلی اللہ علیہ وسلم اس پر چپ ہو رہے ۔ پھر ایک دوسرے صاحب گزرے ، جو مسلمانوں کے غریب اور محتاج لوگوں میں شمار کئے جاتے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا کہ اس کے متعلق تمہارا کیا خیال ہے ؟ صحابہ نے عرض کیا کہ یہ اس قابل ہے کہ اگر کسی کے یہاں نکاح کا پیغام بھیجے تو اس سے نکاح نہ کیا جائے اگر کسی کی سفارش کرے تو اس کی سفارش قبول نہ کی جائے ، اگر کوئی بات کہے تو اس کی بات نہ سنی جائے ۔ آپ صلی اللہ علیہ وسلم نے اس پر فرمایا ، یہ شخص اکیلا پہلے شخص کی طرح دنیا بھر سے بہتر ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 142960,
        "last_updated": null
    },
    {
        "urduURN": 4050200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5092,
        "hadithSanad": "مجھ سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے ، ان سے عقیل نے ، ان سے ابن شہاب نے ، انہیں عروہ بن زبیر نے خبر دی کہ",
        "hadithText": "انہوں نے عائشہ رضی اللہ عنہا سے آیت ” اور اگر تمہیں خوف ہو کہ یتیم لڑکیوں کے بارے میں تم انصاف نہیں کر سکو گے ۔ “ ( سورۃ نساء ) کے متعلق سوال کیا ۔ عائشہ رضی اللہ عنہا نے کہا میرے بھانجے اس آیت میں اس یتیم لڑکی کا حکم بیان ہوا ہے جو اپنے ولی کی پرورش میں ہو اور اس کا ولی اس کی خوبصورتی اور مالداری پر ریجھ کر یہ چاہے کہ اس سے نکاح کرے لیکن اس کے مہر میں کمی کرنے کا بھی ارادہ ہو ۔ ایسے ولی کو اپنی زیر پرورش یتیم لڑکی سے نکاح کرنے سے منع کیا گیا ہے جب وہ ان کا مہر انصاف سے پورا ادا کریں گے اگر وہ ایسا نہ کریں تو پھر آیت میں ایسے ولیوں کو حکم دیا گیا کہ وہ اپنی زیر پرورش یتیم لڑکی کے سوا کسی اور سے نکاح کر لیں ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ لوگوں نے رسول اللہ سے اس کے بعد سوال کیا تو اللہ تعالیٰ نے سورۃ نساء میں آیت ویستفتونک فی النساء سے وتر غبون ان تنکحوھن تک نازل کی ۔ اس آیت میں اللہ تعالیٰ نے یہ حکم دیا کہ یتیم لڑکیا ں اگر خوبصورت اور صاحب مال ہوں تو ان کے ولی بھی ان کے ساتھ نکاح کر لینا چاہتے ہیں ، اس کا خاندان پسند کرتے ہیں اور مہر پورا ادا کر کے ان سے نکاح کر لیتے ہیں ۔ لیکن ان میں حسن کی کمی ہو اور مال بھی نہ ہو تو پھر ان کی طرف رغبت نہیں ہو گی اور وہ انہیں چھوڑ کر دوسری عورتوں سے نکاح کر لیتے ہیں ۔ عائشہ رضی اللہ عنہا نے کہا کہ آیت کا مطلب یہ ہے کہ جیسے اس وقت یتیم لڑکی کو چھوڑ دیتے ہیں جب وہ نادار ہو اور خوبصورت نہ ہو ایسے ہی اس وقت بھی چھوڑ دینا چاہئے جب وہ مالدار اور خوبصورت ہو البتہ اگر اس کے حق میں انصاف کریں اور اس کا مہر پورا ادا کریں تب اس سے نکاح کر سکتے ہیں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 142970,
        "last_updated": null
    },
    {
        "urduURN": 4050210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5093,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عبداللہ بن عمر رضی اللہ عنہما کے صاحبزادے حمزہ اور سالم نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا نحوست عورت میں ، گھر میں اور گھوڑے میں ہو سکتی ہے ۔ ( نحوست بے برکتی اگر ہو تو ان میں ہو سکتی ہے ۔ )</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 142980,
        "last_updated": null
    },
    {
        "urduURN": 4050220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5094,
        "hadithSanad": "ہم سے محمد بن منہال نے بیان کیا ، انہوں نے کہا ہم سے یزید بن زریع نے بیان کیا ، ان سے عمر ان بن عسقانی نے بیان کیا ، ان سے ان کے والد اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم کے سامنے نحوست کا ذکر کیا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر نحوست کسی چیز میں ہو تو گھر ، عورت اور گھوڑے میں ہو سکتی ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 142990,
        "last_updated": null
    },
    {
        "urduURN": 4050230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5095,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہیں امام مالک نے خبر دی ، انہیں ابوحازم نے اور انہیں سہل بن سعد ساعدی رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اگر ( نحوست ) کسی چیز میں ہو تو گھوڑے ، عورت اور گھر میں ہو سکتی ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 143000,
        "last_updated": null
    },
    {
        "urduURN": 4050240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5096,
        "hadithSanad": "ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے سلیمان تیمی نے بیان کیا ، انہوں نے ابوعثمان نہدی سے سنا اور انہوں نے اسامہ بن زید رضی اللہ عنہما سے روایت کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا میں نے اپنے بعد مردوںکے لئے عورتوں کے فتنہ سے بڑھ کر نقصان دینے والا اور کوئی فتنہ نہیں چھوڑاہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 143010,
        "last_updated": null
    },
    {
        "urduURN": 4050250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5097,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی انہیں ربیعہ بن ابوعبدالرحمن نے انہیں قاسم بن محمد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیاکہ",
        "hadithText": "بریرہ کے ساتھ تین سنت قائم ہوتی ہیں ، انہیں آزاد کیا اور پھر اختیار دیا گیا ( کہ اگر چاہیں تو اپنے شوہر سابقہ سے اپنا نکاح فسخ کر سکتی ہیں ) اور رسول کریم صلی اللہ علیہ وسلم نے ( حضرت بریرہ رضی اللہ عنہا کے بارے میں ) فرمایا کہ ” ولاء “ آزادکرانے والے کے ساتھ قائم ہوئی ہے اور حضور اکرم صلی اللہ علیہ وسلم گھر میں داخل ہوئے تو ایک ہانڈی ( گوشت کی ) چولہے پر تھی ۔ پھر آنحضرت صلی اللہ علیہ وسلم کے لئے روٹی اور گھر کا سالن لایا گیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ( چولہے پر ) ہانڈی ( گوشت کی ) بھی تو میں نے دیکھی تھی ۔ عرض کیا گیا کہ وہ ہانڈی اس گوشت کی تھی جو بریرہ رضی اللہ عنہا کو صدقہ میں ملاتھااور آپ صلی اللہ علیہ وسلم صدقہ نہیں کھاتے ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا وہ اس کے لئے صدقہ ہے اور اب ہمارے لئے ان کی طرف سے تحفہ ہے ۔ ہم اسے کھا سکتے ہیں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 143020,
        "last_updated": null
    },
    {
        "urduURN": 4050260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5098,
        "hadithSanad": "ہم سے محمد بن سلام بیکندی نے بیان کیا ، کہا ہم کو عبدہ نے خبر دی ، انہیں ہشام نے ، انہیں ان کے والد نے اور انہیں حضرت عائشہ رضی اللہ عنہا نے",
        "hadithText": "اللہ تعالیٰ کے ارشاد ” اور اگر تمہیں خوف ہو کہ تم یتیموں کے بارے میں انصاف نہیں کرسکوگے ۔ “ کے بارے میں فرمایا کہ اس سے مراد یتیم لڑکی ہے جو اپنے ولی کی پرورش میں ہو ۔ ولی اس سے اس کے مال کی وجہ سے شادی کرتے اور اچھی طرح اس سے سلوک نہ کرتے اور نہ اس کے مال کے بارے میں انصاف کرتے ایسے شخصوں کو یہ حکم ہوا کہ اس یتیم لڑکی سے نکاح نہ کریں بلکہ اس کے سوا جو عورتیں بھلی لگیں ان سے نکاح کر لیں ۔ دو دو ، تین تین یا چار چار تک کی اجازت ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 143030,
        "last_updated": null
    },
    {
        "urduURN": 4050270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5099,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے ، ان سے عبداللہ بن ابوبکرنے ، ان سے عمرہ بنت عبدالرحمٰن نے اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے بیان کیاکہ",
        "hadithText": "آنحضرت صلی اللہ علیہ وسلم ان کے یہاں تشریف رکھتے تھے اور آپ نے سنا کہ کوئی صاحب ام المؤمنین حفصہ رضی اللہ عنہا کے گھر میں اندر آنے کی اجازت چاہتے ہیں ۔ بیان کیا کہ میں نے عرض کیا یا رسول اللہ ! یہ شخص آپ کے گھر میں آنے کی اجازت چاہتا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، میرا خیا ل ہے کہ یہ فلاں شخص ہے ، آپ نے حفصہ رضی اللہ عنہا کے ایک دودھ کے چچا کانام لیا ۔ اس پر عائشہ رضی اللہ عنہا نے پوچھا ، کیا فلاں ، جو ان کے دودھ کے چچا تھے ، اگر زند ہ ہوتے تومیر ے یہاں آ جا سکتے تھے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں جیسے خون ملنے سے حرمت ہوتی ہے ، ویسے ہی دودھ پینے سے بھی حرمت ثابت ہو جاتی ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 143040,
        "last_updated": null
    },
    {
        "urduURN": 4050280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5100,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے شعبہ نے ، ان سے قتادہ نے ، ان سے حضرت جابر بن زید نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم سے کہا گیا کہ آنحضور صلی اللہ علیہ وسلم حضرت حمزہ رضی اللہ عنہ کی بیٹی سے نکاح کیوں نہیں کر لیتے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہ میرے دودھ کے بھائی کی بیٹی ہے ۔ اور بشر بن عمر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، انہوں نے قتادہ سے سنا اور انہوں نے اسی طرح جابر بن زید سے سنا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 143050,
        "last_updated": null
    },
    {
        "urduURN": 4050290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5101,
        "hadithSanad": "ہم سے حکم بن نافع نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہیں عروہ بن زبیر نے خبر دی ، انہیں زینب بنت ابی سلمہ نے خبر دی اور انہیں ام المؤمنین ام حبیبہ بنت ابی سفیان نے خبر دی کہ",
        "hadithText": "انہوں نے عرض کیا کہ یا رسول اللہ ! میری بہن ( ابوسفیان کی لڑکی ) سے نکاح کر لیجئے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کیا تم اسے پسند کروگی ( کہ تمہاری سوکن بہن بنے ؟ ) میں نے عرض کیا ہاں میں توپسند کرتی ہوں اگر میں اکیلی آپ کی بیوی ہوتی تو پسند نہ کرتی ۔ پھر میری بہن اگر میرے ساتھ بھلائی میں شریک ہو تو میں کیونکر نہ چاہوںگی ( غیروں سے تو بہن ہی اچھی ہے ) آپ نے فرمایا وہ میرے لئے حلال نہیں ہے ۔ حضرت ام حبیبہ رضی اللہ عنہا نے کہا یا رسول اللہ ! لوگ کہتے ہیں آپ ابوسلمہ کی بیٹی سے جو ام سلمہ کے پیٹ سے ہے ، نکاح کرنے والے ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا اگر وہ میری ربیبہ اور میری پرورش میں نہ ہوتی ( یعنی میری بیوی کی بیٹی نہ ہوتی ) جب بھی میرے لئے حلال نہ ہوتی ، وہ دوسرے رشتے سے میری دودھ بھتیجی ہے ، مجھ کواور ابوسلمہ کے باپ کو دونوںکو ثوبیہ نے دودھ پلایا ہے ۔ دیکھو ، ایسا مت کرو اپنی بیٹیوں اور بہنوں کو مجھ سے نکاح کرنے کے لئے نہ کہو ۔ حضرت عروہ راوی نے کہا ثوبیہ ابولہب کی لونڈی تھی ۔ ابولہب نے اس کوآزاد کر دیا تھا ۔ ( جب اس نے آنحضرت صلی اللہ علیہ وسلم کے پیدا ہونے کی خبر ابولہب کو دی تھی ) پھر اس نے آنحضرت صلی اللہ علیہ وسلم کو دودھ پلایا تھا جب ابولہب مر گیا تو اس کے کسی عزیز نے مرنے کے بعد اس کو خواب میں برے حال میں دیکھا تو پوچھا کیا حال ہے کیا گزری ؟ وہ کہنے لگا جب سے میں تم سے جدا ہوا ہوں کبھی آرام نہیں ملا مگر ایک ذراسا پانی ( پیر کے دن مل جاتا ہے ) ابولہب نے اس گڑھے کی طرف اشارہ کیا جو انگوٹھے اور کلمہ کے انگلی کے بیچ میں ہوتا ہے یہ بھی اس وجہ سے کہ میں نے ثوبیہ کو آزاد کر دیا تھا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 143060,
        "last_updated": null
    },
    {
        "urduURN": 4050300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5102,
        "hadithSanad": "ہم سے ابو الولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے اشعث نے ، ان سے ان کے دادا نے ، ان سے مسروق نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ان کے پاس تشریف لائے تو دیکھا کہ ان کے یہا ں ایک مرد بیٹھا ہوا ہے ۔ آپ صلی اللہ علیہ وسلم کے چہر ے کا رنگ بدل گیا گویاکہ آپ نے اس کو پسند نہیں فرمایا حضرت عائشہ رضی اللہ عنہا نے عرض کیا یا رسول اللہ ! یہ میرے دودھ والے بھائی ہیں آپ نے فرمایا دیکھوسوچ سمجھ کر کہو کون تمہارا بھائی ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 143070,
        "last_updated": null
    },
    {
        "urduURN": 4050310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5103,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں ابن شہاب نے ، انہیں عروہ بن زبیر نے ، اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "ابو قعیس کے بھائی افلح نے ان کے یہاں اندر آنے کی اجازت چاہی ۔ وہ حضرت عائشہ رضی اللہ عنہا کے رضاعی چچا تھے ( یہ واقعہ پردہ کا حکم نازل ہونے کے بعد کا ہے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ ) میں نے انہیں اندر آنے کی اجازت نہیں دی پھر جب رسول کریم صلی اللہ علیہ وسلم تشریف لائے تو میں نے آپ کو ان کے ساتھ اپنے معاملے کو بتایا ، آنحضرت صلی اللہ علیہ وسلم نے مجھے حکم دیا کہ میں انہیں اندر آنے کی اجازت دے دوں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 143080,
        "last_updated": null
    },
    {
        "urduURN": 4050320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5104,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے اسماعیل بن ابراہیم نے ، کہا ہم کو ایوب سختیانی نے خبر دی ، انہیں عبداللہ بن ابی ملیکہ نے ، کہا کہ مجھ سے عبیداللہ بن ابی مریم نے بیان کیا ، ان سے عقبہ بن حارث رضی اللہ عنہ نے ( عبداللہ بن ابی ملیکہ نے ) بیان کیا کہ",
        "hadithText": "میں نے یہ حدیث خود عقبہ سے بھی سنی ہے لیکن مجھے عبید کے واسطے سے سنی ہوئی حدیث زیادہ یاد ہے ۔ عقبہ بن حارث نے بیان کیا کہ میں نے ایک عورت ( ام یحییٰ بن ابی اہاب ) سے نکاح کیا ۔ پھر ایک کالی عورت آئی اور کہنے لگی کہ میں نے تم دونوں ( میاں بیوی ) کو دودھ پلایا ہے ۔ میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا کہ میں نے فلانی بنت فلاںسے نکاح کیا ہے ۔ اس کے بعد ہمارے یہاں ایک کالی عورت آئی اور مجھ سے کہنے لگی کہ میں نے تم دونوں کو دودھ پلایا ہے ، حالانکہ وہ جھوٹی ہے ( آپ صلی اللہ علیہ وسلم کو عقبہ کا یہ کہنا کہ وہ جھوٹی ہے ناگوار گزرا ) آپ نے اس پر اپنا چہرہ مبارک پھیر لیا ۔ پھر میں آپ کے سامنے آیا اور عرض کیا وہ عورت جھوٹی ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ” اس بیوی سے اب کیسے نکاح رہ سکے گا جبکہ یہ عورت یوں کہتی ہے کہ اس نے تم دونوںکو دودھ پلایاہے ، اس عورت کو اپنے سے الگ کر دو ۔ “ ( حدیث کے راوی ) اسماعیل بن علیہ نے اپنی شہادت اور بیچ کی انگلی سے اشارہ کر کے بتایا کہ ایوب نے اس طرح اشارہ کرکے</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 143090,
        "last_updated": null
    },
    {
        "urduURN": 4050330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5105,
        "hadithSanad": "اور امام احمد بن حنبل نے مجھ سے کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا ، انہوں نے سفیا ن ثوری سے ، کہا مجھ سے حبیب بن ابی ثابت نے بیان کیا ، انہوں نے سعید بن جبیر سے ، انہوں نے ابن عباس رضی اللہ عنہما سے ، انہوں نے کہا",
        "hadithText": "خون کی روسے تم پر سات رشتے حرام ہیں اور شادی کی وجہ سے ( یعنی سسرال کی طرف سے ) سات رشتے بھی ۔ انہوں نے یہ آیت پڑھی ۔ حرمت علیکم امہاتکم آخر تک اور عبداللہ بن جعفر بن ابی طالب نے علی رضی اللہ عنہ کی صاحبزادی زینب اور علی کی بی بی ( لیلٰی بنت مسعود ) دونوں سے نکاح کیا ، ان کو جمع کیا اور ابن سیرین نے کہا اس میں کوئی قباحت نہیں ہے اور امام حسن بصری نے ایک بار تو اسے مکروہ کہا پھر کہنے لگے اس میں کوئی قباحت نہیں ہے اور حسن بن حسن بن علی بن ابی طالب نے اپنے دونوں چاچاؤں ( یعنی محمد بن علی اور عمرو بن علی ) کی بیٹیوں کو ایک ساتھ میں نکاح میں لے لیا اور جابر بن زید تابعی نے اس کو مکروہ جانا ، اس خیال سے کہ بہنوںمیں جلا پانہ پیدا ہو مگر یہ کچھ حرام نہیں ہے کیونکہ اللہ تعالیٰ نے فرمایا کہ ان کے سوا اور سب عورتیں تم کو حلال ہیں اور عکرمہ نے ابن عباس رضی اللہ عنہماسے روایت کیا اگر کسی نے اپنی سالی سے زنا کیا تو اس کی بیوی ( سالی کی بہن ) اس پر حرام نہ ہو گی اور یحییٰ بن قیس کندی سے روایت ہے ، انہوں نے شعبی اور جعفر سے ، دونوں نے کہا اگر کوئی شخص لواطت کرے اور کسی لونڈے کے دخول کر دے تو اب اس کی ماں سے نکاح نہ کرے اور یحییٰ راوی مشہور شخص نہیں ہے اور نہ کسی اور نے اس کے ساتھ ہو کر یہ روایت کی ہے اور عکرمہ نے ابن عباس رضی اللہ عنہما سے روایت کی کہ اگر کسی نے اپنی ساس سے زنا کیا تو اس کی بیوی اس پر حرام نہ ہو گی اور ابو نصر نے ابن عباس رضی اللہ عنہما سے روایت کی کہ حرام ہو جائے گی اور اس راوی ابو نصر کا حال معلوم نہیں ۔ اس نے ابن عباس سے سنا ہے یا نہیں ( لیکن ابوزرعہ نے اسے ثقہ کہا ہے ) اور عمر ان بن حصین اور جابر بن زید اور حسن بصری اور بعض عراق والوں ( امام ثوری اوراما م ابوحنیفہ رحمہ اللہ ) کا یہی قول ہے کہ حرام ہو جائے گی اور ابوہریرہ رضی اللہ عنہ نے کہا حرام نہ ہو گی جب تک اس کی ماں ( اپنی خوشدامن ) کو زمین سے نہ لگا دے ( یعنی اس سے جماع نہ کرے ) اور سعید بن مسیب اور عروہ اور زہری نے اس کے متعلق کہا ہے کہ اگر کوئی ساس سے زنا کرے تب بھی اس کی بیٹی یعنی زنا کرنیوالے کی بیوی اس پر حرام نہ ہو گی ( اس کو رکھ سکتا ہے اور زہری نے کہا علی رضی اللہ عنہ نے فرمایا اس کی جورو اس پر حرام نہ ہو گی اور یہ روایت منقطع ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 143100,
        "last_updated": null
    },
    {
        "urduURN": 4050340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5106,
        "hadithSanad": "ہم سے حمیدی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا کہ ہم سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے والد نے اور ان سے زینب بنت ابی سلمہ نے اور ان سے ام حبیبہ نے بیان کیا کہ",
        "hadithText": "میں نے عرض کیا یا رسول اللہ ! آپ صلی اللہ علیہ وسلم ابوسفیان کی صاحبزادی ( غرہ یادرہ یاحمنہ ) کو چاہتے ہیں ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا پھر میں اس کے ساتھ کیا کروں گا ؟ میں نے عرض کیا کہ اس سے آپ نکاح کر لیں ۔ فرمایا کیا تم اسے پسند کروگی ؟ میں نے عرض کیا میں کوئی تنہا تو ہوں نہیں اور میں اپنی بہن کے لئے یہ پسند کرتی ہوں کہ وہ بھی میرے ساتھ آپ کے تعلق میں شریک ہو جائے ۔ اس پر آنحضرت نے فرمایا کہ وہ میرے لئے حلال نہیں ہے میں نے عرض کیا مجھے معلوم ہوا ہے کہ آپ نے ( زینب سے ) نکاح کا پیغام بھیجا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ام سلمہ کی لڑکی کے پاس ؟ میں نے کہا کہ جی ہاں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا واہ واہ اگر وہ میری ربیبہ نہ ہوتی جب بھی وہ میرے لئے حلال نہ ہوتی ۔ مجھے اور اس کے والد ابوسلمہ کو ثویبہ نے دودھ پلایا تھا ۔ دیکھو تم آئندہ میرے نکاح کے لئے اپنی لڑکیوں اور بہنوں کو نہ پیش کیا کرو اور لیث بن سعد نے بھی اس حدیث کو ہشام سے روایت کیا ہے اس میں ابوسلمہ کی بیٹی کا نام درہ مذکور ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 143110,
        "last_updated": null
    },
    {
        "urduURN": 4050350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5107,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، انہیں عروہ بن زبیر نے خبر دی اور انہیں زینب بنت ابی سلمہ رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "حضرت ام حبیبہ رضی اللہ عنہا نے بیان کیا کہ میں نے عرض کیا یا رسول اللہ ! میری بہن ( غرہ ) بنت ابی سفیان سے آپ نکاح کر لیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اور تمہیں بھی پسند ہے ؟ میں نے عرض کیا جی ہاں کوئی میں تنہا تو ہوں نہیں اور میری خواہش ہے کہ آپ کی بھلائی میں میرے ساتھ میری بہن بھی شریک ہو جائے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا یہ میرے لئے حلال نہیں ہے ۔ میں نے عرض کیا یا رسول اللہ ! اللہ کی قسم ، اس طرح کی باتیں سننے میں آتی ہیں کہ آپ ابوسلمہ رضی اللہ عنہ کی صاحبزادی درہ سے نکاح کرنا چاہتے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا ام سلمہ رضی اللہ عنہا کی لڑکی سے ؟ میں نے کہا جی ہاں ۔ فرمایا اللہ کی قسم اگو وہ میری پرورش میں نہ ہوتی جب بھی وہ میرے لئے حلال نہیں تھی کیونکہ وہ میرے رضاعی بھائی کی لڑکی ہے ۔ مجھے اور ابوسلمہ کو ثویبہ نے دودھ پلایا تھا ۔ ( اس لئے وہ میری رضاعی بھتیجی ہو گئی ) تم لوگ میرے نکاح کے لئے اپنی لڑکیوں اور بہنوں کو نہ پیش کیا کرو ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 143120,
        "last_updated": null
    },
    {
        "urduURN": 4050360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5108,
        "hadithSanad": "ہم سے عبدالرحمٰن نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو عاصم نے خبر دی ، انہیں شعبی نے اور انہوں نے حضرت جابر رضی اللہ عنہ سے سنا ، انہوں نے بیان کیاکہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے کسی ایسی عورت سے نکاح کرنے سے منع کیا تھا جس کی پھوپھی یا خالہ اس کے نکاح میں ہو ۔ اور داؤ د بن عون نے شعبی سے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 143130,
        "last_updated": null
    },
    {
        "urduURN": 4050370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5109,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو امام مالک نے خبر دی ، انہیں ابوالزناد نے ، انہیں اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، کسی عورت کواس کی پھوپھی یا اس کی خالہ کے ساتھ نکاح میں جمع نہ کیا جائے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 143140,
        "last_updated": null
    },
    {
        "urduURN": 4050380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5110,
        "hadithSanad": "ہم سے عبداللہ بن مبارک نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا کہ مجھے یونس نے خبر دی ، انہیں زہری نے ، کہا کہ مجھ سے قبیصہ ابن ذویب نے بیان کیا اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، وہ بیان کر رہے تھے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے اس سے منع کیا ہے کہ کسی عورت کو اس کی پھوپھی یا اس کی خالہ کے ساتھ نکاح میں جمع کیا جائے ( زہری نے کہا کہ ) ہم سمجھتے ہیں کہ عورت کے باپ کی خالہ بھی ( حرام ہونے میں ) اسی درجہ میں ہے کیونکہ \n<span class=urdu_sanad>عروہ نے مجھ سے بیان کیا ، ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ</span> رضاعت سے بھی ان تمام رشتوں کو حرام سمجھو جو خون کی وجہ سے حرام ہوتے ہیں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 143151,
        "last_updated": null
    },
    {
        "urduURN": 4050400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5112,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہوں نے کہا ہم کو حضرت امام مالک رحمہ اللہ نے خبر دی ، انہیں نافع نے اور انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ” شغار “ سے منع فرمایا ہے ۔ شغار یہ ہے کہ کوئی شخص اپنی لڑکی یا بہن کا نکاح اس شرط کے ساتھ کرے کہ وہ دوسرا شخص اپنی ( بیٹی یا بہن ) اس کو بیاہ دے اور کچھ مہر نہ ٹھہرے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 143170,
        "last_updated": null
    },
    {
        "urduURN": 4050410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5113,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم سے محمد بن فضیل نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے والد نے بیان کیا کہ",
        "hadithText": "حضرت خولہ بنت حکیم رضی اللہ عنہا ان عورتوں میں سے تھیں جنہوںنے اپنے آپ کو رسول اللہ صلی اللہ علیہ وسلم کے لئے ہبہ کیا تھا ۔ اس پر حضرت عائشہ رضی اللہ عنہا نے کہا کہ ایک عورت اپنے آپ کو کسی مرد کے لئے ہبہ کرتے شرماتی نہیں ۔ پھر جب آیت ترجی من تشاء منھن ( اے پیغمبر ! تو اپنی جس بیوی کو چاہے پیچھے ڈال دے اور جسے چاہے اپنے پاس جگہ دے ) نازل ہوئی تو میں نے کہا ، یا رسول اللہ ! اب میں سمجھی اللہ تعالیٰ جلد جلدآپ کی خوشی کو پورا کرتا ہے ۔ اس حدیث کو ابوسعید ( محمد بن مسلم ) ، مؤدب اور محمد بن بشر اور عبدہ بن سلیمان نے بھی ہشام سے ، انہوں نے اپنے والد سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کیا ہے ۔ ایک نے دوسرے سے کچھ زیادہ مضمون نقل کیا ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 143180,
        "last_updated": null
    },
    {
        "urduURN": 4050420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5114,
        "hadithSanad": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم کو سفیان بن عیینہ نے خبر دی ، کہا ہم کو عمرو بن دینا ر نے خبر دی ، کہا ہم سے جابر بن زید نے بیان کیا ، کہا ہم کو ابن عباس رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ( حضرت میمونہ رضی اللہ عنہا سے ) نکاح کیا اور اس وقت آپ احرام باندھے ہوئے تھے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 143190,
        "last_updated": null
    },
    {
        "urduURN": 4050430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5115,
        "hadithSanad": "ہم سے مالک بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا ، انہوں نے زہری سے سنا ، وہ بیان کرتے تھے کہ مجھے حسن بن محمد بن علی اور ان کے بھائی عبداللہ بن محمد بن علی نے اپنے والد ( محمد بن الحنفیہ ) سے خبر دی کہ",
        "hadithText": "حضرت علی رضی اللہ عنہ نے حضرت عبداللہ بن عباس رضی اللہ عنہما سے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے متعہ اور پالتو گدھے کے گوشت سے جنگ خیبر کے زمانہ میں منع فرمایا تھا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 143200,
        "last_updated": null
    },
    {
        "urduURN": 4050440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5116,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر محمد بن جعفر نے بیان کیا ، کہا ہم سے شعبہ بن حجاج نے بیان کیا ، ان سے ابوجمرہ نے بیان کیا ، کہا میں نے حضرت ابن عباس رضی اللہ عنہما سے سنا ،",
        "hadithText": "ان سے عورتوں کے ساتھ نکاح متعہ کرنے کے متعلق سوال کیا گیا تھا تو انہوں نے اس کی اجازت دی ، پھر ان کے ایک غلام نے ان سے پوچھا کہ اس کی اجازت سخت مجبوری یا عورتوں کی کمی یا اسی جیسی صورتوں میں ہو گی ؟ تو ابن عباس رضی اللہ عنہما نے کہا کہ ہاں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 143210,
        "last_updated": null
    },
    {
        "urduURN": 4050450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینا ر نے بیان کیا ، ان سے حسن بن محمد بن علی بن ابی طالب نے اور ا ن سے جابر بن عبداللہ انصاری اور سلمہ بن الاکوع نے بیان کیا کہ",
        "hadithText": "ہم ایک لشکر میں تھے ۔ پھر رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس تشریف لائے اور فرمایا کہ تمہیں متعہ کرنے کی اجازت دی گئی ہے اس لئے تم نکاح کر سکتے ہو ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 143220,
        "last_updated": null
    },
    {
        "urduURN": 4050460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5119,
        "hadithSanad": "اور ابن ابی ذئب نے بیان کیا کہ مجھ سے ایاس بن سلمہ بن الاکوع نے بیان کیا اور ان سے ان کے والد نے اور ان سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ",
        "hadithText": "جو مرد اور عورت متعہ کر لیں اور کوئی مدت متعین نہ کریں تو ( کم سے کم ) تین دن تین رات مل کر رہیں ، پھر اگر وہ تین دن سے زیادہ اس متعہ کو رکھنا چاہیں یا ختم کرنا چاہیں تو انہیں اس کی اجازت ہے ( سلمہ بن الاکوع کہتے ہیں کہ ) مجھے معلوم نہیں یہ حکم صرف ہمارے ( صحابہ ) ہی کے لئے تھا یا تمام لوگوں کے لئے ہے ابوعبداللہ ( امام بخاری ) کہتے ہیں کہ خود علی رضی اللہ عنہ نے آنحضرت صلی اللہ علیہ وسلم سے ایسی روایت کی جس سے معلوم ہوتا ہے کہ متعہ کی حلت منسوخ ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 143230,
        "last_updated": null
    },
    {
        "urduURN": 4050470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5120,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے مرحوم بن عبدالعزیز بصریٰ نے بیان کیا ، کہا کہ میں نے ثابت بنانی سے سنا ، انہوں نے بیان کیاکہ",
        "hadithText": "میں حضرت انس رضی اللہ عنہ کے پاس تھا اور ان کے پاس ان کی بیٹی بھی تھیں ۔ حضرت انس رضی اللہ عنہ نے بیان کیا کہ ایک خاتون رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں اپنے آپ کو آنحضرت صلی اللہ علیہ وسلم کے لئے پیش کرنے کی غرض سے حاضر ہوئیں اور عرض کیا یا رسول اللہ ! کیا آپ کو میری ضرورت ہے ؟ اس پر حضرت انس رضی اللہ عنہ کی بیٹی بولیں کہ وہ کیسی بےحیاء عورت تھی ۔ ہائے بے شرمی ! ہائے بے شرمی ! حضرت انس رضی اللہ عنہ نے ان سے کہا وہ تم سے بہتر تھیں ، ان کو نبی کریم صلی اللہ علیہ وسلم کی طرف رغبت تھی ، اس لئے انہوں نے اپنے آپ کو آنحضرت صلی اللہ علیہ وسلم کے لئے پیش کیا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 143240,
        "last_updated": null
    },
    {
        "urduURN": 4050480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5121,
        "hadithSanad": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم سے ابو غسان نے بیان کیا کہا کہ مجھ سے ابوحازم نے بیان کیا ، ان سے سہل بن سعد رضی اللہ عنہ نے کہ",
        "hadithText": "ایک عورت نے اپنے آپ کو نبی کریم صلی اللہ علیہ وسلم سے نکاح کے لئے پیش کیا ۔ پھر ایک صحابی نے آنحضرت صلی اللہ علیہ وسلم سے کہا کہ یا رسول اللہ ! ان کا نکاح مجھ سے کرادیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا تمہارے پاس ( مہر کے لئے ) کیا ہے ؟ انہوں نے کہا کہ میرے پاس تو کچھ بھی نہیں ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جاؤ اور تلاش کرو ، خواہ لوہے کی ایک انگوٹھی ہی مل جائے ۔ وہ گئے اور واپس آ گئے اور عرض کیا کہ اللہ کی قسم ، میں نے کوئی چیز نہیں پائی ۔ مجھے لوہے کی انگوٹھی بھی نہیں ملی ، البتہ یہ میرا تہمد میرے پاس ہے اس کا آدھا انہیں دے دیجئیے ۔ حضرت سہل رضی اللہ عنہ نے بیان کیا کہ ان کے پاس چادر بھی نہیں تھی ۔ مگر حضور اکرم صلی اللہ علیہ وسلم نے فرمایا کہ یہ تمہارے اس تہمد کا کیا کرے گی ، اگریہ اسے پہن لے گی تو یہ اس قدر چھوٹا کپڑا ہے کہ پھر تو تمہارے لئے اس میں سے کچھ باقی نہیں بچے گا اور اگر تم پہنو گے تو اس کے لئے کچھ نہیں رہے گا ۔ پھر وہ صاحب بیٹھ گئے ، دیر تک بیٹھے رہنے کے بعد اٹھے ( اور جانے لگے ) تو آنحضرت صلی اللہ علیہ وسلم نے انہیں دیکھا اور بلایا ، یا انہیں بلایا گیا ( راوی کو ان الفاظ میں شک تھا ) پھر آپ نے ان سے پوچھا کہ تمہیں قرآن کتنا یاد ہے ؟ انہوں نے کہا کہ مجھے فلاں فلاں سورتیں یاد ہیں چند سورتیں انہوں نے گنائیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہم نے تمہارے نکاح میں اس کو اس قرآن کے بدلے دے دیا جو تمہیں یاد ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 143250,
        "last_updated": null
    },
    {
        "urduURN": 4050490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5122,
        "hadithSanad": "ہم سے عبد العزیز بن عبداللہ نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے صالح بن کیسان نے ، ان سے ابن شہاب نے بیان کیا کہ مجھے سالم بن عبداللہ نے خبر دی ، انہوں نے عبداللہ بن عمر سے حضرت عمر بن خطاب رضی اللہ عنہم کے متعلق سناکہ",
        "hadithText": "جب ( ان کی صاحبزادی ) حفصہ بنت عمر رضی اللہ عنہا ( اپنے شوہر ) خنیس بن حذافہ سہمی کی وفات کی وجہ سے بیوہ ہو گئیں اور خنیس رسول اللہ صلی اللہ علیہ وسلم کے صحابی تھے اور ان کی وفات مدینہ منورہ میں ہوئی تھی ۔ حضرت عمر بن خطاب رضی للہ عنہ نے بیان کیا کہ میں حضرت عثمان بن عفان رضی اللہ عنہ کے پاس آیا اور ان کے لئے حضرت حفصہ رضی اللہ عنہا کو پیش کیا ۔ انہوں نے کہا کہ میں اس معاملہ میں غور کروں گا ۔ میں نے کچھ دنوں تک انتظار کیا ۔ پھر مجھ سے حضرت ابوبکر رضی اللہ عنہ نے ملاقات کی اور میں نے کہا کہ اگر آپ پسند کریں تو میں آپ کی شادی حفصہ رضی اللہ عنہا سے کر دوں ۔ حضرت ابوبکر رضی اللہ عنہ خاموش رہے اور مجھے کوئی جواب نہیں دیا ۔ ان کی اس بیرخی سے مجھے حضرت عثمان رضی اللہ عنہ کے معاملہ سے بھی زیادہ رنج ہوا ۔ کچھ دنوں تک میں خاموش رہا ۔ پھر حضور صلی اللہ علیہ وسلم نے خود حضرت حفصہ رضی اللہ عنہا سے نکاح کا پیغام بھیجا اور میں نے آنحضرت صلی اللہ علیہ وسلم سے اس کی شادی کر دی ۔ اس کے بعد حضرت ابوبکر رضی اللہ عنہ مجھ سے ملے اور کہا کہ جب تم نے حضرت حفصہ رضی اللہ عنہا کا معاملہ میرے سامنے پیش کیا تھا تو میں اس پر میرے خاموش رہنے سے تمہیں تکلیف ہوئی ہو گی کہ میں نے تمہیں اس کا کوئی جواب نہیں دیا تھا ۔ حضرت عمر رضی اللہ عنہ نے بیان کیا کہ میں نے کہا کہ واقعی ہوئی تھی حضرت ابوبکر رضی اللہ عنہ نے کہا کہ تم نے جو کچھ میرے سامنے رکھا تھا ، اس کا جواب میں نے صرف اس وجہ سے نہیں دیا تھا کہ میرے علم میں تھا کہ رسول اللہ صلی اللہ علیہ وسلم نے خود حضرت حفصہ رضی اللہ عنہا کا ذکر کیا ہے اور میں حضور اکرم صلی اللہ علیہ وسلم کے راز کو ظاہر کرنا نہیں چاہتا تھا اگر آنحضرت صلی اللہ علیہ وسلم چھوڑ دیتے تو میں حضرت حفصہ رضی اللہ عنہا کو اپنے نکاح میں لے آتا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 143260,
        "last_updated": null
    },
    {
        "urduURN": 4050500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5123,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے یزید بن ابی حبیب نے ، ان سے عراک بن مالک نے اور انہیں زینب بنت ابی سلمہ نے خبر دی کہ",
        "hadithText": "حضرت ام حبیبہ رضی اللہ عنہا نے رسول کریم صلی اللہ علیہ وسلم سے کہا کہ ہمیں معلوم ہو اہے کہ آنحضرت صلی اللہ علیہ وسلم درہ بنت ابی سلمہ سے نکاح کرنے والے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کیا میں اس سے اس کے باوجود نکاح کرسکتاہوںکہ ( ان کی ماں ) ام سلمہ رضی اللہ عنہا میرے نکاح میں پہلے ہی سے موجود ہیں اور اگر میں ام سلمہ رضی اللہ عنہا سے نکاح نہ کئے ہوتا جب بھی وہ درہ میرے لئے حلال نہیں تھی ۔ کیونکہ اس کے والد ( ابوسلمہ رضی اللہ عنہ ) میرے رضاعی بھائی تھے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 143270,
        "last_updated": null
    },
    {
        "urduURN": 4050510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5124,
        "hadithSanad": "امام بخاری رحمہ اللہ نے کہامجھ سے طلق بن غنام نے بیان کیا ، کہا ہم سے زائد ہ بن قدام نے بیان کیا ، ان سے منصور بن معتمر نے ، ان سے مجاہد نے کہ",
        "hadithText": "ابن عباس رضی اللہ عنہما نے آیت ” فیما عرضتم “ کی تفسیر میں کہا کہ کوئی شخص کسی ایسی عورت سے جو عدت میں ہو کہے کہ میرا ارادہ نکاح کاہے اور میری خواہش ہے کہ مجھے کوئی نیک بخت عورت میسر آ جائے اور اس نکاح میں قاسم بن محمد نے کہا کہ ( تعریض یہ ہے کہ عدت میں عورت سے کہے کہ تم میری نظر میں بہت اچھی ہو اور میرا خیال نکاح کرنے کاہے اور اللہ تمہیں بھلائی پہنچائے گا یا اسی طرح کے جملے کہے اور عطاء  بن ابی رباح نے کہا کہ تعریض وکنایہ سے کہے ۔ صاف صاف نہ کہے ( مثلاً ) کہے کہ مجھے نکاح کی ضرورت ہے اور تمہیں بشارت ہو اور اللہ کے فضل سے اچھی ہو اور عورت اس کے جواب میں کہے کہ تمہاری بات میں نے سن لی ہے ( بصراحت ) کوئی وعدہ نہ کرے ایسی عورت کا ولی بھی اس کے علم کے بغیر کوئی وعدہ نہ کرے اور اگر عورت نے زمانہ عدت میں کسی مرد سے نکاح کا وعدہ کر لیا اور پھر بعد میں اس سے نکاح کیا تو دونوں میں جدائی نہیں کرائی جائے گی ۔ حسن نے کہا کہ لاتواعدوھن سرا سے یہ مراد ہے کہ عورت سے چھپ کر بدکاری نہ کرو ۔ ابن عباس رضی اللہ عنہما سے منقول ہے کہ ” الکتاب اجلہ “ سے مراد عدت کا پورا کرنا ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 143280,
        "last_updated": null
    },
    {
        "urduURN": 4050520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5125,
        "hadithSanad": "ہم سے مسددنے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد عروہ بن زبیر نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ( نکاح سے پہلے ) میں نے تمہیں خواب میں دیکھا کہ ایک فرشتہ ( جبرائیل علیہ السلام ) ریشم کے ایک ٹکڑے میں تمہیں لپیٹ کر لے آیا ہے اور مجھ سے کہہ رہا ہے کہ یہ تمہاری بیوی ہے ۔ میں نے اس کے چہرے سے کپڑا ہٹایا تو وہ تم تھیں ۔ میں نے کہا کہ اگر یہ خواب اللہ کی طرف سے ہے تو وہ اسے خود ہی پورا کر دے گا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 143290,
        "last_updated": null
    },
    {
        "urduURN": 4050530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5126,
        "hadithSanad": "ہم سے قتیبہ بن سعیدنے بیان کیا ، کہا ہم سے یعقوب بن عبدالرحمٰن نے بیان کیا ، ان سے ابوحازم سلمہ بن دینار نے ، ان سے سہل بن سعد رضی اللہ عنہ نے کہ",
        "hadithText": "ایک خاتون رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور عرض کیا یا رسول اللہ ! میں آپ کی خدمت میں اپنے آپ کو ہبہ کرنے آئی ہوں ۔ حضور اکرم صلی اللہ علیہ وسلم نے ان کی طرف دیکھا اور نظر اٹھا کر دیکھا ، پھر نظر نیچی کر لی اور سر کو جھکا لیا ۔ جب خاتون نے دیکھا کہ حضور اکرم صلی اللہ علیہ وسلم نے ان کے بارے میں کوئی فیصلہ نہیں فرمایا تو بیٹھ گئیں ۔ اس کے بعد آپ کے صحابہ میں سے ایک صاحب کھڑے ہوئے اور عرض کیا کہ یا رسول اللہ ! اگر آپ کو ان کی ضرورت نہیں تو ان کا نکاح مجھ سے کرا دیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تمہارے پاس کوئی چیز ہے ؟ انہوں نے عرض کی کہ نہیں یا رسول اللہ ! اللہ کی قسم ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اپنے گھر جاؤ اور دیکھو شاید کوئی چیز مل جائے ۔ وہ گئے اور واپس آ کر عرض کی کہ نہیں یا رسول اللہ ! میں نے کوئی چیز نہیں پائی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اور دیکھ لو ، اگر ایک لوہے کی انگو ٹھی بھی مل جائے ۔ وہ گئے اور واپس آ کر عرض کیا یا رسول اللہ ! مجھے لوہے کی انگوٹھی بھی نہیں ملی ، البتہ یہ میرا تہمد ہے ۔ سہل رضی اللہ عنہ نے بیان کیا کہ ان کے پاس چادر بھی نہیں تھی ( ان صحابی نے کہا کہ ) ان خاتون کو اس تہمد میں سے آدھا عنایت فرما دیجئیے ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا یہ تمہارے تہمد کا کیا کرے گی اگر تم اسے پہنو گے تو اس کے لئے اس میں سے کچھ باقی نہیں رہے گا ۔ اس کے بعد وہ صاحب بیٹھ گئے اور دیر تک بیٹھے رہے پھر کھڑے ہوئے تو رسول اللہ صلی اللہ علیہ وسلم نے انہیں واپس جاتے ہوئے دیکھا اور انہیں بلانے کے لئے فرمایا ، انہیں بلایا گیا ۔ جب وہ آئے تو آپ نے ان سے دریافت فرمایا تمہارے پاس قرآن مجید کتنا ہے ۔ انہوں نے عرض کیا فلاں فلاں سورتیں ۔ انہوں نے ان سورتوں کو گنا یا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کیا تم ان سورتوں کو زبانی پڑھ لیتے ہو ۔ انہوں نے ہاں میں جواب دیا ۔ آنحضرت صلی اللہ علیہ وسلم نے پھر فرمایا جاؤ میں نے اس خاتون کو تمہارے نکاح میں اس قرآن کی وجہ سے دیا جو تمہارے پاس ہے ۔ ان سورتوں کو اس سے یاد کرا دو ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 143300,
        "last_updated": null
    },
    {
        "urduURN": 4050540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5127,
        "hadithSanad": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، کہا ہم سے عبداللہ بن وہب نے بیان کیا ، ان سے یونس نے ( دوسری سند ) امام بخاری نے کہا ہم سے احمدبن صالح نے بیان کیا ، کہا ہم سے عنبسہ بن خالد نے بیان کیا ، کہا ہم سے یونس نے بیان کیا ، ان سے ابن شہاب نے ، کہا کہ مجھے عروہ بن زبیر نے خبردی",
        "hadithText": "اور انہیں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا نے خبر دی کہ زمانہ جاہلیت میں نکاح چار طرح ہوتے تھے ۔ ایک صورت تو یہی تھی جیسے آج کل لوگ کرتے ہیں ، ایک شخص دوسرے شخص کے پاس اس کی زیر پرورش لڑکی یا اس کی بیٹی کے نکاح کا پیغام بھیجتا اور اس کا مہر دے کر اس سے نکاح کر لیتا ۔ دوسرا نکاح یہ تھا کہ کوئی شوہر اپنی بیوی سے جب وہ حیض سے پاک ہو جاتی تو کہتا تو فلاں شخص کے پاس چلی جا اور اس سے منہ کالا کرا لے اس مدت میں شوہر اس سے جدا رہتا اور اسے چھوتا بھی نہیں ۔ پھر جب اس غیر مرد سے اس کا حمل ظاہر ہو جاتا جس سے وہ عارضی طور پر صحبت کرتی رہتی ، تو حمل کے ظاہر ہونے کے بعد اس کا شوہر اگر چاہتا تو اس سے صحبت کرتا ۔ ایسا اس لئے کرتے تھے تاکہ ان کا لڑکا شریف اور عمدہ پیدا ہو ۔ یہ نکاح ” استبضاع “ کہلاتا تھا ۔ تیسری قسم نکاح کی یہ تھی کہ چند آدمی جو تعداد میں دس سے کم ہوتے کسی ایک عورت کے پاس آنا جانا رکھتے اور اس سے صحبت کرتے ۔ پھر جب وہ عورت حاملہ ہوتی اور بچہ جنتی تو وضع حمل پر چند دن گزرنے کے بعد وہ عورت اپنے ان تمام مردوں کو بلاتی ۔ اس موقع پر ان میں سے کوئی شخص انکا ر نہیں کر سکتا تھا ۔ چنانچہ وہ سب اس عورت کے پاس جمع ہو جاتے اور وہ ان سے کہتی کہ جو تمہارا معاملہ تھا وہ تمہیں معلوم ہے اور اب میں نے یہ بچہ جنا ہے ۔ پھر وہ کہتی کہ اے فلاں ! یہ بچہ تمہارا ہے ۔ وہ جس کا چاہتی نام لے دیتی اور وہ لڑکا اسی کا سمجھا جاتا ، وہ شخص اس سے انکار کی جرات نہیں کر سکتا تھا ۔ چوتھا نکاح اس طور پر تھا کہ بہت سے لوگ کسی عورت کے پاس آیا جایا کرتے تھے ۔ عورت اپنے پاس کسی بھی آنے والے کو روکتی نہیں تھی ۔ یہ کسبیاں ہوتی تھیں ۔ اس طرح کی عورتیں اپنے دروازوں پر جھنڈے لگائے رہتی تھیں جو نشانی سمجھے جاتے تھے ۔ جو بھی چاہتا ان کے پاس جاتا ۔ اس طرح کی عورت جب حاملہ ہوتی اور بچہ جنتی تو اس کے پاس آنے جانے والے جمع ہوتے اور کسی قیافہ جاننے والے کو بلاتے اور بچہ کا ناک نقشہ جس سے ملتا جلتا ہوتا اس عورت کے اس لڑکے کو اسی کے ساتھ منسوب کر دیتے اور وہ بچہ اسی کا بیٹا کہا جا تا ، اس سے کوئی انکار نہیں کرتا تھا ۔ پھر جب حضرت محمد صلی اللہ علیہ وسلم حق کے ساتھ رسول ہو کر تشریف لائے آپ نے جاہلیت کے تمام نکاحوں کو باطل قرار دے دیا صرف اس نکاح کو باقی رکھا جس کا آج کل رواج ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 143310,
        "last_updated": null
    },
    {
        "urduURN": 4050550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5128,
        "hadithSanad": "ہم سے یحییٰ بن سعید نے بیان کیا ، کہا ہم سے وکیع نے بیان کیا ، ان سے ہشام بن عر وہ نے بیان کیا ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "آیت وما یتلیٰ علیکم فی الکتاب الخ یعنی وہ ( آیات بھی ) جو تمہیں کتاب کے اندر ان یتیم لڑکوں کے بارے میں پڑھ کر سنائی جاتی ہیں جنہیں تم وہ نہیں دیتے ہو جو ان کے لئے مقرر ہو چکا ہے اور اس سے بیزار ہو کہ ان کا کسی سے نکاح کرو ۔ ایسی یتیم لڑکی کے بارے میں نازل ہوئی تھی جو کسی شخص کی پر ورش میں ہو ۔ ممکن ہے کہ اس کے مال و جائیداد میں بھی شریک ہو ، وہی لڑکی کا زیادہ حقدار ہے لیکن وہ اس سے نکاح نہیں کر نا چاہتا البتہ اس کے مال کی وجہ سے اسے روکے رکھتا ہے اور کسی دوسرے مرد سے اس کی شادی نہیں ہونے دیتا کیونکہ وہ نہیں چاہتا کہ کوئی دوسرا اس کے مال میں حصہ دار بنے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 143320,
        "last_updated": null
    },
    {
        "urduURN": 4050560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5129,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے ہشام نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، کہا ہم سے زہری نے بیان کیا ، کہا کہ مجھے سالم نے خبر دی ، انہیں عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "جب حفصہ بنت عمر رضی اللہ عنہما ابن حذافہ سہمی سے بیوہ ہوئیں ۔ ابن حذافہ رضی اللہ عنہما نبی کریم صلی اللہ علیہ وسلم کے اصحاب میں سے تھے اور بدر کی جنگ میں شریک تھے ان کی وفات مدینہ منورہ میں ہوئی تھی تو حضرت عمر رضی اللہ عنہ نے بیان کیا کہ میں حضرت عثمان بن عفان رضی اللہ عنہ سے ملااور انہیں پیش کش کی اور کہا کہ اگر آپ چاہیں تو میں حفصہ رضی اللہ عنہا کا نکاح آپ سے کروں ۔ انہوں نے جواب دیا کہ میں اس معاملہ میں غور کروں گا چند دن میں نے انتظار کیا اس کے بعد وہ مجھ سے ملے اور کہا کہ میں اس نتیجہ پر پہنچا ہوں کہ ابھی نکا ح نہ کروں ۔ حضرت عمر رضی اللہ عنہ نے بیان کیا کہ پھر میں حضرت ابوبکر رضی اللہ عنہ سے ملا اور ان سے کہا کہ اگر آپ چاہیں تو میں حفصہ کا نکاح آپ سے کروں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 143330,
        "last_updated": null
    },
    {
        "urduURN": 4050570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5130,
        "hadithSanad": "ہم سے احمد بن عمرو نے بیان کیا ، کہا کہ مجھ سے میرے والد حفص بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے ابراہیم بن طہمان نے بیان کیا ، ان سے یونس نے ، ان سے حسن بصری نے",
        "hadithText": "آیت ” فلا تعضلوھن “ کی تفسیر میں بیان کیا کہ مجھ سے معقل بن یسار رضی اللہ عنہ نے بیان کیا کہ یہ آیت میرے ہی بارے میں نازل ہوئی تھی میں نے اپنی ایک بہن کا نکاح ایک شخص سے کر دیا تھا ۔ اس نے اسے طلاق دے دی لیکن جب عدت پوری ہوئی تو وہ شخص ( ابو البداح ) میری بہن سے پھر نکاح کا پیغام لے کر آیا ۔ میں نے اس سے کہا کہ میں نے تم سے اس کا ( اپنی بہن ) کا نکاح کیا اسے تمہاری بیوی بنایا اور تمہیں عزت دی لیکن تم نے اسے طلاق دیدی اور اب پھر تم نکاح کاپیغام لے کر آئے ہو ۔ ہرگز نہیں اللہ کی قسم ! اب میں تمہیں کبھی اسے نہیں دوں گا ۔ وہ شخص ابو البداح کچھ برا آدمی نہ تھا اور عورت بھی اس کے یہاں واپس جانا چاہتی تھی اس لئے اللہ تعالیٰ نے یہ آیت نازل کی کہ ” تم عورتوں کو مت روکو “ میں نے عرض کیا کہ یا رسول اللہ ! اب میں کر دوں گا ۔ بیان کیا کہ پھر انہوں نے اپنی بہن کا نکاح اس شخص سے کر دیا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 143340,
        "last_updated": null
    },
    {
        "urduURN": 4050580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5131,
        "hadithSanad": "ہم سے ابن سلام نے بیان کیا ، کہا ہم کو ابومعاویہ نے خبر دی ، کہا ہم سے ہشا م نے ، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے",
        "hadithText": "آیت یستفتونک فی النساء الایۃ اور آپ سے عورتوں کے بارے میں مسئلہ پوچھتے ہیں ، آپ کہہ دیجئیے کہ اللہ ان کے بارے میں تمہیں مسئلہ بتاتا ہے آخر آیت تک فرمایا کہ یہ آیت یتیم لڑکی کے بارے میں نازل ہوئی ، جو کسی مرد کی پرورش میں ہو ۔ وہ مرد اس کے مال کے مال میں بھی شریک ہو اور اس سے خود نکاح کرنا چاہتا ہو اور اس کا نکاح کسی دوسرے سے کرنا پسند نہ کرتا ہو کہ کہیں دوسرا شخص اس کے مال میں حصہ دار نہ بن جائے اس غرض سے وہ لڑکی کو روکے رکھے تو اللہ تعالیٰ نے لوگوں کو اس سے منع کیا ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 143350,
        "last_updated": null
    },
    {
        "urduURN": 4050590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5132,
        "hadithSanad": "ہم سے احمد بن مقدام نے بیان کیا ، کہا ہم سے فضیل بن سلیمان نے بیان کیا ، کہا ہم سے ابو حاز م نے بیان کیا ، کہا ہم سے سہل بن سعد رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں بیٹھے ہوئے تھے کہ ایک خاتون آئیں اور اپنے آپ کو آنحضرت صلی اللہ علیہ وسلم کے لئے پیش کیا ۔ آنحضور صلی اللہ علیہ وسلم نے انہیں نظر نیچی او پر کر کے دیکھا اور کوئی جواب نہیں دیا پھر آپ کے صحابہ میں سے ایک صحابی نے عرض کیا یا رسول اللہ ! ان کا نکاح مجھ سے کرا دیجئیے ۔ آنحضور صلی اللہ علیہ وسلم نے دریافت فرمایا ، تمہارے پاس کوئی چیز ہے ؟ انہوں نے عرض کیا کہ میرے پاس تو کچھ نہیں ۔ آنحضور صلی علیہ وسلم نے دریافت فرمایا لوہے کی انگوٹھی بھی نہیں ؟ انہوں نے عرض کیا کہ لوہے کی ایک انگوٹھی بھی نہیں ہے ۔ البتہ میں اپنی یہ چادرپھاڑ کے آدھی انہیں دے دوں گا اور آدھی خود رکھوں گا ۔ آنحضور صلی اللہ علیہ وسلم نے فرمایا نہیں ، تمہارے پاس کچھ قرآن بھی ہے ؟ انہوں نے عرض کیا کہ ہے ۔ آنحضور صلی اللہ علیہ وسلم نے فرمایا کہ پھر جاؤ میں نے تمہارا نکاح ان سے اس قرآن مجید کی وجہ سے کیا جو تمہارے ساتھ ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 143360,
        "last_updated": null
    },
    {
        "urduURN": 4050600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5133,
        "hadithSanad": "ہم سے محمد بن یوسف بیکندی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے جب ان کا نکاح کیا تو ان کی عمر چھ سال تھی اور جب ان سے صحبت کی تو اس وقت ان کی عمر نو برس کی تھی اور وہ نو برس آپ کے پاس رہیں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 143370,
        "last_updated": null
    },
    {
        "urduURN": 4050610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5134,
        "hadithSanad": "ہم سے معلی بن اسد نے بیان کیا ، کہا ہم سے وہب نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ان سے نکاح کیا تو ان کی عمر چھ سال تھی اور جب ان سے صحبت کی تو ان کی عمر نو سال تھی ۔ ہشام بن عروہ نے کہا کہ مجھے خبر دی گئی ہے کہ وہ آنحضرت صلی اللہ علیہ وسلم کے ساتھ نو سال تک رہیں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 143380,
        "last_updated": null
    },
    {
        "urduURN": 4050620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5135,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا ہم سے امام مالک نے خبر دی ، انہیں ابوحازم مسلم بن دینار نے اور ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "ایک عورت رسول اللہ صلی اللہ علیہ وسلم کے پاس آئی اور کہا کہ میں اپنے آپ کو آپ کے لئے ہبہ کرتی ہوں ۔ پھر وہ دیر تک کھڑی رہی ۔ اتنے میں ایک مرد نے کہا کہ اگر آنحضور صلی اللہ علیہ وسلم کو اس کی ضرورت نہ ہو تو اس کا نکاح مجھ سے فرما دیں ۔ آپ نے دریافت فرمایا کہ تمہارے پاس انہیں مہر میں دینے کے لئے کوئی چیز ہے ؟ اس نے کہا کہ میرے پاس اس تہمد کے سوا اور کچھ نہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اگر تم اپنا یہ تہمد اس کو دے دوگے تو تمہارے پاس پہننے کے لئے تہمد بھی نہیں رہے گا ۔ کوئی اور چیز تلاش کر لو ۔ اس مرد نے کہا کہ میرے پاس کچھ بھی نہیں ۔ آپ نے فرمایا کہ کچھ تو تلاش کرو ، ایک لوہے کی انگوٹھی ہی سہی ! اسے وہ بھی نہیں ملی تو آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا ۔ کیا تمہارے پاس کچھ قرآن مجید ہے ؟ انہوں نے عرض کیا کہ جی ہاں ! فلاں فلاں سورتیں ہیں ، ان سورتوں کا انہوں نے نام لیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر ہم نے تیرا نکاح اس عورت سے ان سورتوں کے کے بدلے کیا جو تم کو یاد ہیں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 143390,
        "last_updated": null
    },
    {
        "urduURN": 4050630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5136,
        "hadithSanad": "ہم سے معاذ بن فضالہ نے بیان کیا ، کہا ہم سے ہشام دستوائی نے ، ان سے یحییٰ بن ابی بشیر نے ، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا بیوہ عورت کا نکاح اس وقت تک نہ کیا جائے جب تک اس کی اجاز ت نہ لی جائے اور کنواری عورت کا نکاح اس وقت تک نہ کیا جائے جب تک اس کی اجازت نہ مل جائے ۔ صحابہ نے کہا کہ یا رسول اللہ ! کنواری عورت اذن کیونکر دے گی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اس کی صور ت یہ ہے کہ وہ خاموش رہ جائے ۔ یہ خاموشی اس کا اذن سمجھی جائے گی ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 143400,
        "last_updated": null
    },
    {
        "urduURN": 4050640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5137,
        "hadithSanad": "ہم سے عمرو بن ربیع بن طارق نے بیان کیا ، کہا کہ مجھے لیث بن سعد نے خبر دی ، انہیں ابن ابی ملیکہ نے ، انہیں حضرت عائشہ رضی اللہ عنہا کے غلام ابوعمرو ذکوان نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "انہوں نے عرض کیا یا رسول اللہ ! کنواری لڑکی ( کہتے ہوئے ) شرماتی ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس کا خاموش ہو جانا ہی اس کی رضامندی ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 143410,
        "last_updated": null
    },
    {
        "urduURN": 4050650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5138,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے عبدالرحمٰن بن قاسم نے ، ان سے ان کے والد نے ، ان سے عبدالرحمٰن اورمجمع نے",
        "hadithText": "جو دونوںیزید بن حارثہ کے بیٹے ہیں ، ان سے خنساء بنت خذام انصاریہ رضی اللہ عنہا نے کہ ان کے والد نے ان کا نکاح کر دیا تھا ، وہ ثیبہ تھیں ، انہیں یہ نکاح منظور نہیں تھا ، اس لئے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں ، آنحضرت صلی اللہ علیہ وسلم نے اس نکاح کو فسخ کر دیا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 143420,
        "last_updated": null
    },
    {
        "urduURN": 4050660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5139,
        "hadithSanad": "ہم سے اسحاق بن راہویہ نے بیان کیا ، کہا ہم کو یزید بن ہارون نے خبر دی ، کہا ہم کو یحییٰ بن سعید انصاری نے خبر دی ، ان سے قاسم بن محمد نے بیان کیا ، ان سے عبدالرحمٰن بن یزید اور مجمع بن یزید نے بیان کیا کہ",
        "hadithText": "خذام نامی ایک صحابی نے اپنی لڑکی کا نکاح کر دیا تھا ۔ پھر پچھلی حدیث کی طرح بیان کیا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 143430,
        "last_updated": null
    },
    {
        "urduURN": 4050670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5140,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے اور ( دوسری سند ) اور لیث نے بیان کیا کہ مجھ سے عقیل نے بیان کیا ، ان سے ابن شہاب زہری نے ، کہا مجھ کو عروہ بن زبیر نے خبر دی کہ",
        "hadithText": "انہوں نے حضرت عائشہ رضی اللہ عنہا سے سوال کیا کہ اے ام المؤمنین ! اور اگر تمہیں خوف ہو کہ تم یتیموں کے بارے میں انصاف کرسکوگے تو اسے ” ماملکت ایمانکم “ تک کہ اس آیت میں کیا حکم بیان ہوا ہے ؟ حضرت عائشہ رضی اللہ عنہا نے کہا میرے بھانجے ! اس آیت میں اس یتیم لڑکی کا حکم یبان ہوا ہے جو اپنے ولی کی پرورش میں ہو اور ولی کو اس کے حسن اور اس کے مال کی وجہ سے اس کی طرف توجہ ہو اور وہ اس کا مہر کم کر کے اس سے نکاح کرنا چاہتا ہو تو ایسے لوگوں کو ایسی یتیم لڑکیوں سے نکاح سے ممانعت کی گئی ہے سوائے اس صورت کے کہ وہ ان کے مہر کے بارے میں انصاف کریں ( اور اگر انصاف نہیں کر سکتے تو انہیں ان کے سوادوسری عورتوںسے نکاح کا حکم دیا گیا ہے ۔ حضرت عائشہ رضی اللہ عنہا نے کہا کہ لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کے بعد مسئلہ پوچھا تو اللہ تعالیٰ نے آیت ” اور آپ سے عورتوںکے بارے میں پوچھتے ہیں ، سے “ وترغبون تک نازل کی ۔ اللہ تعالیٰ نے اس آیت میں یہ حکم نازل کیا کہ یتیم لڑکیاں جب صاحب مال اور صاحب جمال ہوتی ہیں تب تو مہر میں کمی کر کے اس سے نکاح کرنا رشتہ لگانا پسند کرتے ہیں اور جب دولت مند ی یا خوبصورتی نہیں رکھتی اس وقت اس کو چھوڑ کر دوسری عورتوں سے نکاح کر دیتے ہیں ( یہ کیا بات ) ان کو چاہئے کہ جیسے مال و دولت اور حسن وجمال نہ ہونے کی صورت میں اس کو چھوڑ دیتے ہیں ایسے ہی اس وقت بھی چھوڑ دیں جب وہ مالدا ر اور خوبصورت ہو البتہ اگر انصاف سے چلیں اور اس کا پورا مہر مقرر کریں تو خیر نکاح کر لیں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 143440,
        "last_updated": null
    },
    {
        "urduURN": 4050680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5141,
        "hadithSanad": "ہم سے ابو النعمان نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ابوحازم نے ، ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے کہ",
        "hadithText": "ایک عورت رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آئی اور اس نے اپنے آپ کوآنحضرت صلی اللہ علیہ وسلم سے نکاح کے لئے پیش کیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ مجھے اب عورت کی ضرورت نہیں ہے ۔ اس پر ایک صحابی نے عرض کیا یا رسول اللہ ! ان کا نکاح مجھ سے کر دیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تمہارے پاس کیا ہے ؟ انہوں نے کہا کہ میرے پاس تو کچھ بھی نہیں ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اس عورت کو کچھ دو خواہ لوہے کی ایک انگوٹھی ہی سہی ۔ انہوں نے کہا کہ حضور ( صلی اللہ علیہ وسلم ) میرے پاس کچھ بھی نہیں ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے پوچھا تمہیں قرآن کتنا یاد ہے ؟ عرض کیا فلاں فلاں سورتیں یاد ہیں آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر میں نے انہیں تمہارے نکاح میں دیا ۔ اس قرآن کے بدلے جو تم کو یاد ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 143450,
        "last_updated": null
    },
    {
        "urduURN": 4050690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5142,
        "hadithSanad": "ہم سے مکی بن ابراہیم نے بیان کیا ، کہا ہم سے جریج نے بیان کیا ، کہا کہ میں نے نافع سے سنا ، انہوں نے بیان کیا کہ عبداللہ بن عمر رضی اللہ عنہما بیان کرتے تھے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے اس سے منع فرمایا ہے کہ ہم کسی کے بھاو پر بھاو لگائیں اور کسی شخص کو اپنے کسی ( دینی ) بھائی کے پیغام نکاح پر پیغام بھیجیں یہاں تک کہ پیغام بھیجنے والا اپنا ارادہ بدل دے یا اسے پیغام نکاح بھیجنے کی اجازت دے د ے تو جائز ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 143460,
        "last_updated": null
    },
    {
        "urduURN": 4050700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5143,
        "hadithSanad": "ہم سے یحی بن بکیر نے بیان کیا ، کہا ہم سے لیس بن سعد نے بیان کیا ، ان سے جعفر بن ربیعہ ، ان سے اعرج نے بیان کیا اور ان سے حضرت ابوہریرہ نے بیان کیا وہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ",
        "hadithText": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ بدگمانی سے بچتے رہو کیونکہ بدگمانی سب سے جھوٹی بات ہے ( اور لوگوں کے رازوں کی ) کھود کرید نہ کیا کرو اور نہ ( لوگوں کی نجی گفتگووں کو ) کان لگا کر سنو ، آپس میں دشمنی نہ پیدا کرو بلکہ بھائی بھائی بن کر رہو ، \n<span class=urdu_sanad></span> اور کوئی شخص اپنے بھائی کے پیغام پر پیغام نہ بھیجے یہاں تک کہ وہ نکاح کرے یا چھوڑدے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 143471,
        "last_updated": null
    },
    {
        "urduURN": 4050720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5145,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زھری نے ، کہا کہ مجھے سالم بن عبداللہ نے خبر دی ، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا ، وہ بیان کرتے تھے کہ",
        "hadithText": "حضرت عمر رضی اللہ عنہ نے بیان کیا کہ میری بیٹی حفصہ رضی اللہ عنہا بیوہ ہوئیں تو میں حضرت ابوبکر صدیق رضی اللہ عنہ سے ملا اور ان سے کہا کہ اگر آپ چاہیں تو میں آپ کا نکاح عزیزہ حفصہ بنت عمر رضی اللہ عنہما سے کر دوں ۔ پھر کچھ دنوں کے بعد رسول کریم صلی اللہ علیہ وسلم نے ان کے نکاح کا پیغام بھیجا اس کے حضرت ابوبکر رضی اللہ عنہ مجھ سے ملے اور کہا آپ نے جو صورت میرے سامنے رکھی تھی اس کا جواب میں نے صرف اس وجہ سے نہیں دیا تھا کہ مجھے معلوم تھا رسول کریم صلی اللہ علیہ وسلم نے ان کا ذکر کیا ہے ۔ میں نہیں چاہتا کہ آپ کا راز کھولوں ہاں آنحضرت صلی اللہ علیہ وسلم انہیں چھوڑ دیتے تو میں ان کو قبول کر لیتا ۔ شعیب کے ساتھ اس حدیث کو یو نس بن یزید اور موسیٰ بن عقبہ اور محمد بن ابی عتیق نے بھی زہری سے ر وایت کیا ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 143480,
        "last_updated": null
    },
    {
        "urduURN": 4050730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5146,
        "hadithSanad": "ہم سے قبیصہ بن عقبہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے زید بن اسلم نے کہا کہ میں نے حضرت ابن عمر رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "دو آدمی مدینہ کے مشرق کی طرف سے آئے ، وہ مسلمان ہو گئے اور خطبہ دیا ، نہایت فصیح و بلیغ ۔ رسول اللہ صلی اللہ علیہ وسلم نے اس پر فرمایا کہ بعض تقریر جادو کی اثر کرتی ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 143490,
        "last_updated": null
    },
    {
        "urduURN": 4050740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5147,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے بشر بن مفضل نے بیان کیا ، کہا ہم سے خالد بن ذکوان نے بیان کیا ، کہ ربیع بنت معوذ ابن عفراء رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم تشریف لائے اور جب میں دلہن بنا کر بٹھائی گئی آنحضرت صلی اللہ علیہ وسلم اندر تشریف لائے اور میر ے بستر پر بیٹھے اسی طرح جیسے تم اس وقت میرے پاس بیٹھے ہوئے ہو ۔ پھر ہمارے یہاں کی کچھ لڑکیاں دف بجانے لگیں اور میرے باپ اور چچا جو جنگ بدر میں شہید ہوئے تھے ، ان کا مرثیہ پڑھنے لگیں ۔ اتنے میں ان میں سے ایک لڑکی نے پڑھا ، اور ہم میں ایک نبی ہے جو ان باتوں کی خبر رکھتا ہے جو کچھ کل ہونے والی ہیں ۔ ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ چھوڑ دو ۔ اس کے سوا جو کچھ تم پڑھ رہی تھیں وہ پڑھو ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 143500,
        "last_updated": null
    },
    {
        "urduURN": 4050750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5148,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عبد العزیز بن صہیب نے بیان کیا اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
        "hadithText": "حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ نے ایک خاتون سے ایک گٹھلی کے وزن کے برابر ( سونے کے مہر پر ) نکاح کیا ۔ پھر نبی کریم صلی اللہ علیہ وسلم شادی کی خوشی ان میں دیکھی تو ان سے پوچھا ۔ انہوں نے عرض کیا کہ میں نے ایک عورت سے ایک گٹھلی کے برابر نکاح کیا ہے اور قتادہ نے حضرت انس رضی اللہ عنہ سے یہ روایت اس طرح نقل کی ہے کہ حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ نے ایک عورت سے ۔ ایک گٹھلی کے وزن کے برابر سونے پر نکاح کیا تھا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 143510,
        "last_updated": null
    },
    {
        "urduURN": 4050760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5149,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے ، کہا میں نے ابوحازم سے سنا ، وہ کہتے تھے کہ میں نے سہل بن سعد ساعدی سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں لوگوں کے ساتھ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر تھا اس میں ایک خاتون کھڑی ہوئیں اور عرض کیا کہ یا رسول اللہ ! میں اپنے آپ کو آپ کے لئے ہبہ کرتی ہوں آپ اب جو چاہیں کریں ۔ حضور اکرم صلی اللہ علیہ وسلم نے انہیں کوئی جواب نہیں دیا ۔ وہ پھر کھڑی ہوئی اور عرض کیا کہ یا رسول اللہ ! میں نے اپنے آپ کو آپ کے لئے ہبہ کر دیا ہے حضور جو چاہیں کریں ۔ حضور اکرم صلی اللہ علیہ وسلم نے اس مرتبہ بھی کوئی جواب نہیں دیا ۔ وہ تیسری مرتبہ کھڑی ہوئیں اور کہا کہ انہوں نے اپنے آپ کوحضور صلی اللہ علیہ وسلم کے لئے ہبہ کر دیا ، حضور جو چاہیں کریں ۔ اس کے بعد ایک صحابی کھڑے ہوئے اور عرض کیا یا رسول اللہ ! ان کا نکاح مجھ سے کر دیجئیے ۔ حضور اکرم صلی اللہ علیہ وسلم نے ان سے دریافت فرمایا تمہارے پاس کچھ ہے ؟ انہوں نے عرض کیا کہ نہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جاؤ اور تلاش کرو ایک لوہے کی انگوٹھی بھی اگر مل جائے لے آؤ ۔ وہ گئے اور تلاش کیا ، پھر واپس آ کر عرض کیا کہ میں نے کچھ نہیں پایا ، لوہے کی ایک انگوٹھی بھی نہیں ملی ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا تمہارے پاس کچھ قرآن ہے ؟ انہوں نے عرض کیا کہ جی ہاں ۔ میرے پاس فلاں فلاں سورتیں ہیں آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر جاؤ میں نے تمہارا نکاح ان سے اس قرآن پر کیا جو تم کو یاد ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 143520,
        "last_updated": null
    },
    {
        "urduURN": 4050770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5150,
        "hadithSanad": "ہم سے یحییٰ نے بیان کیا ، کہا ہم سے وکیع نے بیان کیا ، ان سے سفیان نے ان سے ابوحازم نے اور ان سے صحابی حضرت سہل بن سعد رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک آدمی سے فرمایا نکاح کر ، خواہ لوہے کی ایک انگوٹھی پر ہی ہو ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 143530,
        "last_updated": null
    },
    {
        "urduURN": 4050780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5151,
        "hadithSanad": "ہم سے ابو الولید ہشام بن عبدالملک نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے یزید بن ابی حبیب نے ، ان سے ابو الخیر اور ان سے حضرت عقبہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تمام شرطوں میں وہ شرطیں سب سے زیادہ پوری کی جانے کے لائق ہیں جن کے ذریعہ تم نے شرمگاہوں کو حلال کیا ہے ۔ یعنی نکاح کی شرطیں ضرور پوری کرنی ہو گی ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 143540,
        "last_updated": null
    },
    {
        "urduURN": 4050790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5152,
        "hadithSanad": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا ، کہا ان سے زکریا نے جو ابو زائدہ کے صاحبزادے ہیں ، ان سے سعد بن ابراہیم نے ، ان سے ابوسلمہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کسی عورت کے لئے جائز نہیں کہ اپنی کسی ( سوکن ) بہن کی طلاق کی شرط اس لئے لگائے تاکہ اس کے حصہ کا پیالہ بھی خود انڈیل لے کیونکہ اسے وہی ملے گا جو اس کے مقدر میں ہو گا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 143550,
        "last_updated": null
    },
    {
        "urduURN": 4050800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5153,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، ان کو مالک نے خبر دی ، انہیں حمید طویل نے اور انہیں انس بن مالک نے کہ",
        "hadithText": "عبدالرحمن بن عوف رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو ان کے اوپر زرد رنگ کا نشان تھا ۔ حضور اکرم صلی اللہ علیہ وسلم نے اس کے متعلق پوچھا تو انہوں نے بتایا کہ انہوں نے انصارکی ایک عورت سے نکاح کیا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا اسے مہر کتنا دیا ہے ؟ انہوں نے کہا کہ ایک گٹھلی کے برابر سونا ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا کہ پھر ولیمہ کر خواہ ایک بکری ہی کا ہو ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 143560,
        "last_updated": null
    },
    {
        "urduURN": 4050810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5154,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے حمیدی نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے زینب بنت جحش رضی اللہ عنہا کے ساتھ نکاح پر دعوت ولیمہ کی اور مسلمانوںکے لئے کھانے کا انتظام کیا ۔ ( کھانے سے فراغت کے بعد ) آنحضرت صلی اللہ علیہ وسلم باہر تشریف لے گئے ، جیسا کہ نکاح کے بعد آپ کا دستور تھا ۔ پھر آپ امہات المؤمنین کے حجروں میں تشریف لے گئے ۔ آپ نے ان کے لئے دعا کی اور انہوں نے آپ کے لئے دعا کی ۔ پھر آپ واپس تشریف لائے تو دو صحابہ کو دیکھا ( کہ ابھی بیٹھے ہوئے تھے ) اس لئے آپ پھر تشریف لے گئے ( انس رضی اللہ عنہ نے بیان کیا کہ ) مجھے پوری طرح یاد نہیں کہ میں نے خود آنحضرت صلی اللہ علیہ وسلم کو خبر دی یا کسی اور نے خبر دی کہ وہ دونوں صحابی بھی چلے گئے ہیں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 143570,
        "last_updated": null
    },
    {
        "urduURN": 4050820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5155,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ثابت نے اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے حضرت عبدالرحمٰن بن عوف پر زردی کا نشان دیکھا تو پوچھا کہ یہ کیا ہے ؟ انہوں نے کہا کہ میں نے ایک عورت سے ایک گٹھلی کے وزن کے برابر سونے کے مہر پر نکاح کیا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ تمہیں برکت دے دعوت ولیمہ کر خواہ ایک بکری ہی کی ہو ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 143580,
        "last_updated": null
    },
    {
        "urduURN": 4050830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5156,
        "hadithSanad": "ہم سے فروہ بن ابی المغراء نے بیان کیا ، کہا ہم سے علی بن مسہر نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے جب مجھ سے شادی کی تو میری والدہ ( ام رومان بنت عامر ) میرے پاس آئیں اور مجھے آنحضرت صلی اللہ علیہ وسلم کے گھر کے اندر لے گئیں ۔ گھر کے اندر قبیلہ انصار کی عورتیں موجود تھیں ۔ انہوں نے ( مجھ کو اور میری ماں کو ) یوں دعادی بارک وبارک اللہ اللہ کرے تم اچھی ہو تمہارا نصیبہ اچھا ہو ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 143590,
        "last_updated": null
    },
    {
        "urduURN": 4050840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5157,
        "hadithSanad": "ہم سے محمد بن علاء نے بیان کیا ، کہا ہم سے عبداللہ بن المبارک نے بیان کیا ، ان سے معمربن راشد نے ، ان سے ہمام نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا گزشتہ انبیاء میں سے ایک نبی ( حضرت یوشع علیہ السلام یا حضرت داؤد ) علیہ السلام نے غزوہ کیا اور ( غزوہ سے پہلے ) اپنی قوم سے کہا کہ میرے ساتھ کوئی ایسا شخص نہ چلے جس نے کسی نئی عورت سے شادی کی ہو اور اس کے ساتھ صحبت کرنے کا ارادہ رکھتا ہو اور ابھی صحبت نہ کی ہو ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 143600,
        "last_updated": null
    },
    {
        "urduURN": 4050850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5158,
        "hadithSanad": "ہم سے قبیصہ بن عقبہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے ہشام بن عروہ نے اور ان سے عروہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے حضرت عائشہ رضی اللہ عنہا سے نکاح کیا تو ان کی عمر چھ سال کی تھی اور جب ان کے ساتھ خلوت کی تو ان کی عمر نو سال کی تھی اور وہ آنحضرت صلی اللہ علیہ وسلم کے ساتھ نو سال تک رہیں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 143610,
        "last_updated": null
    },
    {
        "urduURN": 4050860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5159,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے خبر دی ، انہیں حمید نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے مدینہ اور خیبر کے درمیان ( راستہ میں ) تین دن تک قیام کیا اور وہاں ام المؤمنین حضرت صفیہ بنت حیی رضی اللہ عنہا کے ساتھ خلوت کی ۔ میں نے مسلمانوںکو آنحضرت صلی اللہ علیہ وسلم کے ولیمہ پر بلایا لیکن اس دعوت میں روٹی اور گوشت نہیں تھا ۔ آپ نے دسترخوان بچھانے کا حکم دیا اور اس پر کھجور ، پنیر اور گھی رکھ دیا گیا اور یہی آنحضرت صلی اللہ علیہ وسلم کا ولیمہ تھا ۔ مسلمانوں نے حضرت صفیہ رضی اللہ عنہا کے بارے میں ( کہا کہ ) امہات المؤمنین میں سے ہیں یا آنحضرت صلی اللہ علیہ وسلم نے انہیں لونڈی ہی رکھا ہے ( کیونکہ وہ بھی جنگ خیبر کے قیدیوں میں سے تھیں ۔ اس پر بعض نے کہا کہ اگرآنحضرت صلی اللہ علیہ وسلم ان کے لئے پردہ کرائیں پھر تو وہ امہات المؤمنین میں سے ہیں اور اگر آپ ان کے لئے پردہ نہ کرائیں تو پھر وہ لونڈی کی حیثیت سے ہیں ۔ جب سفر ہوا تو آنحضرت صلی اللہ علیہ وسلم نے ان کے لئے اپنی سواری پر پیچھے جگہ بنائی اور لوگوں کے اور ان کے درمیان پردہ ڈلوایا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 143620,
        "last_updated": null
    },
    {
        "urduURN": 4050870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5160,
        "hadithSanad": "مجھ سے فروہ بن ابی المغراء نے بیان کیا ، کہا ہم سے علی بن مسہر نے بیان کیا ، ان سے ہشام بن عروہ نے ، انس سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے مجھ سے شادی کی تھی ۔ میری والدہ میرے پاس آئیں اورتنہا مجھے ایک گھر میں داخل کر دیا ۔ پھر مجھے کسی چیز نے خوف نہیں دلایا سوائے رسول اللہ صلی اللہ علیہ وسلم کے کہ آپ اچانک ہی میرے پاس چاشت کے وقت آ گئے ۔ آپ نے مجھ سے ملاپ فرمایا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 143630,
        "last_updated": null
    },
    {
        "urduURN": 4050880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5161,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا ہم سے محمد بن المنکدر نے بیان کیا ، ان سے حضرت جابربن عبداللہ رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ان سے ( جب انہوں نے شادی کی ) فرمایا تم نے جھالر دار چادریں بھی لی ہیں یا نہیں ؟ انہوں نے عرض کیا یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! ہمارے پاس جھالر دار چادریں کہاں ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جلد ہی میسر ہو جائیں گی ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 143640,
        "last_updated": null
    },
    {
        "urduURN": 4050890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5162,
        "hadithSanad": "ہم سے فضیل بن یعقوب نے بیان کیا ، کہا ہم سے محمد بن سابق نے بیان کیا ، ان سے اسرائیل نے بیان کیا ، ان سے ہشام بن عروہ نے ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "وہ ایک دلہن کو ایک انصاری مرد کے پاس لے گئیں تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا عائشہ ! تمہارے پاس لہو ( دف بجانے والا ) نہیں تھا ، انصار کو دف پسند ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 143650,
        "last_updated": null
    },
    {
        "urduURN": 4050900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5163,
        "hadithSanad": "اور ابراہیم بن طہمان نے ابوعثمان جعدبن دینار سے روایت کیا ، انہوں نے انس بن مالک سے ، ابوعثمان کہتے ہیں کہ",
        "hadithText": "انس رضی اللہ عنہ ہمارے سامنے سے بنی رفاعہ کی مسجد میں ( جو بصرہ میں ہے ) گزرے ۔ میں نے ان سے سنا وہ کہہ رہے تھے کہ آنحضرت صلی اللہ علیہ وسلم کا قاعدہ تھا آپ جب ام سلیم رضی اللہ عنہا کے گھر کی طرف سے گزرتے تو ان کے پاس جاتے ، ان کو سلام کرتے ( وہ آپ کی رضاعی خالہ ہوتی تھیں ) پھر انس رضی اللہ عنہ نے بیان کیا کہ ایک بار ایسا ہوا کہ آنحضرت صلی اللہ علیہ وسلم دولہا تھے ۔ آپ نے زینب رضی اللہ عنہا سے نکا ح کیا تھا تو ام سلیم ( میری ماں ) مجھ سے کہنے لگیں اس وقت ہم آنحضرت صلی اللہ علیہ وسلم کے پاس کچھ تحفہ بھیجیں تو اچھا ہے ۔ میں نے کہا مناسب ہے ۔ انہوں نے کھجور اور گھی اور پنیر ملا کر ایک ہانڈی میں حلوہ بنایا اور میرے ہاتھ میں دے کر آنحضرت صلی اللہ علیہ وسلم کے پاس بھجوایا ، میں لے کر آپ کے پاس چلا ، جب پہنچا تو آپ نے فرمایا رکھ دے اور جا کر فلاں فلاں لوگوں کو بلا لا آپ نے ان کا نام لیا اور جو بھی کوئی تجھ کو راستے میں ملے اس کو بلا لے ۔ انس رضی اللہ عنہ نے کہا کہ میں آپ کے حکم کے موافق لوگوں کو دعوت دینے گیا ۔ لوٹ کر جو آ یا تو کیا دیکھتا ہوں کہ سارا گھر لوگوں سے بھرا ہوا ہے ۔ میں نے دیکھا کہ آنحضرت صلی اللہ علیہ وسلم نے اپنے دونو ں ہاتھ اس حلوے پر رکھے اور جو اللہ کو منظور تھا وہ زبان سے کہا ( برکت کی دعا فرمائی ) پھر دس دس آدمیوں کو کھانے کے لئے بلانا شروع کیا ۔ آپ ان سے فرماتے جاتے تھے اللہ کا نام لو اور ہر ایک آدمی اپنے آگے سے کھائے ۔ ( رکابی کے بیچ میں ہاتھ نہ ڈالے ) یہا ں تک کہ سب لوگ کھا کر گھر کے باہر چل دئیے ۔ تین آدمی گھر میں بیٹھے باتیں کرتے رہے اور مجھ کو ان کے نہ جانے سے رنج پیدا ہوا ( اس خیال سے کہ آنحضرت صلی اللہ علیہ وسلم کو تکلیف ہو گی ) آخر آنحضرت صلی اللہ علیہ وسلم اپنی بیویوں کے حجروں پر گئے میں بھی آپ کے پیچھے پیچھے گیا پھر راستے میں میں نے آپ سے کہا اب وہ تین آدمی بھی چلے گئے ہیں ۔ اس وقت آپ لوٹے اور ( زینب رضی اللہ عنہا کے حجرے میں ) آئے ۔ میں بھی حجرے ہی میں تھا لیکن آپ نے میری اور اپنے بیچ میں پردہ ڈال لیا ۔ آپ سورۃ الاحزاب کی یہ آیت پڑھ رہے تھے ۔ ” مسلمانو ! نبی کے گھروں میں نہ جایا کرومگر جب کھانے کے لئے تم کو اند ر آنے کی اجازت دی جائے اس وقت جا ؤ وہ بھی ایسا ٹھیک وقت دیکھ کر کہ کھانے کے پکنے کا انتظار نہ کرنا پڑے البتہ جب بلائے جاؤ تو اندر آ جاؤ اور کھانے سے فارغ ہوتے ہی چل دو ۔ باتوں میں لگ کر وہا ں بیٹھے نہ رہا کرو ، ایسا کرنے سے پیغمبر کو تکلیف ہوتی تھی ، اس کو تم سے شرم آتی تھی ( کہ تم سے کہے کہ چلے جاؤ ) اللہ تعالیٰ حق بات میں نہیں شرماتا ۔ “ ابوعثمان ( جعدی بن دینار ) کہتے تھے کہ انس رضی اللہ عنہ کہا کرتے تھے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 143660,
        "last_updated": null
    },
    {
        "urduURN": 4050910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5164,
        "hadithSanad": "مجھ سے عبید بن اسمعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "انہوں نے ( اپنی بہن ) حضرت اسماء رضی اللہ عنہا سے ایک ہار عاریۃ ًلے لیا تھا ، راستے میں وہ گم ہو گیا تو رسول اللہ صلی اللہ علیہ وسلم نے اپنے صحابہ میں سے کچھ آدمیوں کو اسے تلاش کرنے کے لئے بھیجا ۔ تلاش کرتے ہوئے نماز کا وقت ہو گیا ( اور پانی نہیں تھا ) اس لئے انہوں نے وضو کے بغیر نماز پڑھی ۔ پھر جب وہ آنحضرت صلی اللہ علیہ وسلم کی خدمت میں واپس ہوئے تو آپ کے سامنے یہ شکوہ کیا ۔ اس پر تیمم کی آیت نازل ہوئی ۔ حضرت اسید بن حضیر رضی اللہ عنہ نے کہا کہ اے عائشہ ! اللہ تمہیں بہتر بدلہ دے ، واللہ ! جب بھی آپ پر کوئی مشکل آن پڑتی ہے تو اللہ تعالیٰ نے تم سے اسے دور کیا اور مزید برآ ں یہ کہ مسلمانوں کے لئے برکت اور بھلائی ہوئی</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 143670,
        "last_updated": null
    },
    {
        "urduURN": 4050920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5165,
        "hadithSanad": "ہم سے سعد بن حفص طلحی نے بیان کیا ، کہا ہم سے شیبان بن عبدالرحمٰن نے ، ان سے منصور بن معتمر نے ، ان سے سالم بن ابی الجعد نے ، ان سے کریب نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ کوئی شخص اپنی بیوی کے پاس ہمبستری کے لئے جب آئے تو یہ دعا پڑھے بسم اللہ اللھم جنبنی الشیطان وجنب الشیطان ما رزقتنا یعنی میں اللہ کے نام سے شروع کرتا ہوں اے اللہ ! شیطان کو مجھ سے دور رکھ اور شیطان کو اس چیز سے بھی دور رکھ جو ( اولاد ) ہمیں تو عطا کرے ۔ پھر اس عرصہ میں ان کے لئے کوئی اولاد نصیب ہو تو اسے شیطان کبھی ضرر نہ پہنچا سکے گا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 143680,
        "last_updated": null
    },
    {
        "urduURN": 4050930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5166,
        "hadithSanad": "ہم سے یحییٰ بن بکیرنے بیان کیا ، کہا کہ مجھ سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے بیان کیا اور انہیں انس بن مالک رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "جب رسول کریم صلی اللہ علیہ وسلم مدینہ منورہ ہجرت کر کے آئے تو ان کی عمر دس برس کی تھی ۔ میری ماں اور بہنیں نبی کریم صلی اللہ علیہ وسلم کی خدمت کے لئے مجھ کو تاکید کرتی رہتی تھیں ۔ چنانچہ میں نے حضور اکرم صلی اللہ علیہ وسلم کی دس برس تک خدمت کی اور جب آپ کی وفات ہوئی تو میں بیس برس کا تھا ۔ پردہ کے متعلق میں سب سے زیادہ جاننے والوں میں سے ہوں کہ کب نازل ہوا ۔ سب سے پہلے یہ حکم اس وقت نازل ہوا تھا جب آنحضرت صلی اللہ علیہ وسلم زینب بنت جحش رضی اللہ عنہما سے نکاح کے بعد انہیں اپنے گھر لائے تھے ، آپ ان کے دولہا بنے تھے ۔ پھر آپ نے لوگوں کو ( دعوت ولیمہ پر ) بلایا ۔ لوگوں نے کھانا کھایا اور چلے گئے ۔ لیکن کچھ لوگ ان میں سے آنحضرت صلی اللہ علیہ وسلم کے گھر میں ( کھا نے کے بعدبھی ) دیر تک وہیں بیٹھے ( باتیں کرتے رہے ) آخر آنحضرت صلی اللہ علیہ وسلم کھڑے ہوئے اور باہر تشریف لے گئے ۔ میں بھی آنحضرت صلی اللہ علیہ وسلم کے ساتھ باہر گیا تاکہ یہ لوگ بھی چلے جائیں ۔ آنحضرت صلی اللہ علیہ وسلم چلتے رہے اور میں بھی آپ کے ساتھ رہا ۔ جب آپ حضرت عائشہ رضی اللہ عنہا کے حجرہ کے پاس دروازے پر آئے تو آپ کو معلوم ہوا کہ وہ لوگ چلے گئے ہیں ۔ اس لئے آپ واپس تشریف لائے اور میں بھی آپ کے ساتھ آیا ۔ جب آپ زینب رضی اللہ عنہا کے گھر میں داخل ہوئے تو دیکھا کہ وہ لوگ ابھی بیٹھے ہوئے ہیں اور ابھی تک نہیں گئے ہیں ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم وہاں سے پھر واپس تشریف لائے اور میں بھی آپ کے ساتھ واپس آ گیا جب آپ عائشہ رضی اللہ عنہا کے حجرہ کے دروازے پر پہنچے اور آپ کو معلوم ہوا کہ وہ لوگ چلے گئے ہیں تو آپ پھر واپس تشریف لائے اور میں بھی آپ کے ساتھ واپس آیا ۔ اب وہ لوگ واقعی جا چکے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس کے بعد اپنے اور میرے بیچ میں پردہ ڈال دیا اور پردہ کی آیت نازل ہوئی ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 143690,
        "last_updated": null
    },
    {
        "urduURN": 4050940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5167,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا کہ مجھ سے حمیدطویل نے بیان کیا اور انہوں نے حضرت انس رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ سے پوچھا ، انہوں نے قبیلہ انصار کی ایک عورت سے شادی کی تھی کہ مہر کتنا دیا ہے ؟ انہوں نے کہا کہ ایک گٹھلی کے وزن کے برابر سونا ۔ اور حمید سے روایت ہے کہ میں نے حضرت انس رضی اللہ عنہ سے سنا اور انہوں نے بیان کیا کہ جب ( آنحضرت صلی اللہ علیہ وسلم اورمہاجرین صحابہ ) مدینہ ہجرت کر کے آئے تو مہاجرین نے انصار کے یہاں قیام کیا عبدالرحمٰن بن عوف رضی اللہ عنہ نے سعد بن ربیع رضی اللہ عنہ کے یہاں قیام کیا ۔ سعد رضی اللہ عنہ نے ان سے کہا کہ میں آپ کو اپنا مال تقسیم کر دوں گا اور اپنی دوبیویوں میں سے ایک کو آپ کے لئے چھوڑ دوں گا ۔ عبدالرحمٰن نے کہا کہ اللہ آپ کے اہل و عیال اور مال میں برکت دے پھر وہ بازار نکل گئے اور وہاں تجارت شروع کی اور پنیر اور گھی نفع میں کمایا ۔ اس کے بعد شادی کی تو نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ دعوت ولیمہ کر خواہ ایک بکری ہی کی ہو ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 143700,
        "last_updated": null
    },
    {
        "urduURN": 4050950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5168,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حما د بن زید نے بیان کیا ، ان سے ثابت بنانی نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے حضرت زینب رضی اللہ عنہا جیسا ولیمہ اپنی بیویوں میں سے کسی کا نہیں کیا ، ان کا ولیمہ آپ نے ایک بکری کا کیا تھا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 143710,
        "last_updated": null
    },
    {
        "urduURN": 4050960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5169,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، ان سے عبدالوارث نے بیان کیا ، ان سے شعیب نے اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے حضرت صفیہ رضی اللہ عنہا کو آزاد کیا اور پھر ان سے نکاح کیا اور ان کی آزادی کو ان کا مہر قرار دیااور ان کا ولیمہ ملیدہ سے کیا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 143720,
        "last_updated": null
    },
    {
        "urduURN": 4050970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5170,
        "hadithSanad": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے زہیر نے بیان کیا ، ان سے بیان بن بشر نے بیان کیا ، انہوں نے کہا کہ میں نے حضرت انس رضی اللہ عنہ سے سنا ، انہوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ایک خاتون ( زینب بن جحش رضی اللہ عنہا ) کو نکاح کر کے لائے تو مجھے بھیجا اور میں نے لوگوں کو ولیمہ کھا نے کے لئے بلایا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 143730,
        "last_updated": null
    },
    {
        "urduURN": 4050980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5171,
        "hadithSanad": "ہم سے مسدد بن مسر ہد نے بیان کیا ، کہا ہم سے حماد بن زید نے ، ان سے ثابت بنانی نے ، کہ انس رضی اللہ عنہ کے سامنے زینب بنت جحش رضی اللہ عنہا کے نکاح کا ذکر کیا گیا تو انہوں نے کہا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو ان کے جیسا اپنی بیویوں میں سے کسی کے لئے ولیمہ کرتے نہیں دیکھا ۔ ا ٓنحضرت صلی اللہ علیہ وسلم نے ان کا ولیمہ ایک بکری سے کیا تھا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 143740,
        "last_updated": null
    },
    {
        "urduURN": 4050990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5172,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے منصور بن صفیہ نے ، ان سے ان کی والدہ حضرت صفیہ بنت شیبہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے اپنی ایک بیوی کا ولیمہ دو مد ( تقریباً پونے دوسیر ) جو سے کیا تھا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 143750,
        "last_updated": null
    },
    {
        "urduURN": 4051000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5173,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم سے مالک نے خبر دی ، انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب تم میں سے کسی کو دعوت ولیمہ پر بلایا جائے تو اسے آنا چاہئے ۔ معلوم ہوا کہ دعوت ولیمہ کاقبول کرنا ضروری ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 143760,
        "last_updated": null
    },
    {
        "urduURN": 4051010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5174,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے یحییٰ بن کثیر نے یبان کیا ، ان سے سفیان ثوری نے ، کہا کہ مجھ سے منصور نے بیان کیا ، ان سے ابووائل نے اور ان سے حضرت ابوموسیٰ اشعری رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا قیدی کو چھڑاؤ ، دعوت کرنے والے کی دعوت قبول کرو اور بیمارکی عیادت کرو ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 143770,
        "last_updated": null
    },
    {
        "urduURN": 4051020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5175,
        "hadithSanad": "ہم سے حسن بن ربیع نے بیان کیا ، کہا ہم سے ابوالاحوص ( سلام بن سلیم ) نے بیان کیا ، ان سے اشعث بن ابی الشعثاء نے ، ان سے معاویہ بن سوید نے کہ براء  بن عازب رضی اللہ عنہ نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ہمیں سات کا موں کا حکم دیا اور سات کامو ں سے منع فرمایا ۔ ہمیں آنحضرت صلی اللہ علیہ وسلم نے بیمارکی عیادت ، جنازہ کے پیچھے چلنے ، چھینکنے والے کے جواب دینے ( یرحمک اللہ یعنی اللہ تم پر رحم کرے ، کہنا ) قسم کو پورا کرنے ، مظلوم کی مدد کرنے ، سب کو سلام کرنے اور دعوت کرنے والے کی دعوت قبول کرنے کاحکم دیا تھا اور ہمیں آنحضرت صلی اللہ علیہ وسلم نے سونے کی انگوٹھی پہننے ، چاندی کے برتن استعمال کرنے ، ریشمی گدے ، قسیہ ( ریشمی کپڑا ) استبرق ( موٹے ریشم کا کپڑا ) اور دیباج ( ایک ریشمی کپڑا ) کے استعمال سے منع فرمایا تھا ۔ ابو عوانہ اور شیبانی نے اشعث کی روایت سے لفظ افشاء السلام میں ابوالاحوص کی متابعت کی ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 143780,
        "last_updated": null
    },
    {
        "urduURN": 4051030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5176,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے عبد العزیز بن ابی حازم نے بیان کیا اور ان سے سہل بن سعد رضی اللہ عنہ نے کہ",
        "hadithText": "حضرت ابوا سید ساعدی رضی اللہ عنہ نے رسول کریم صلی اللہ علیہ وسلم کو اپنی شادی پر دعوت دی ، ان کی دلہن ام اسیدسلامہ بنت وہب ضروری جو کام کا ج کر رہی تھیں اور وہی دلہن بنی تھیں ۔ حضرت سہل رضی اللہ عنہ نے کہا تمہیں معلوم ہے انہوں نے آنحضرت صلی اللہ علیہ وسلم کو اس موقع پر کیا پلایا تھا ؟ رات کے وقت انہوں نے کچھ کھجوریں پانی میں بھگو دی تھیں ( صبح کو ) جب آنحضرت صلی اللہ علیہ وسلم کھانے سے فارغ ہوئے تو آپ کو وہی پلایا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 143790,
        "last_updated": null
    },
    {
        "urduURN": 4051040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5177,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم سے امام مالک نے خبر دی ، انہیں ابن شہاب نے ، انہیں اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ولیمہ کا وہ کھا نا بدترین کھا نا ہے جس میں صرف مالداروں کو اس کی طرف دعوت دی جائے اور محتاجوں کو نہ کھلایا جائے اور جس نے ولیمہ کی دعوت قبول کرنے سے انکار کیا اس نے اللہ اور اس کے رسول کی نافرمانی کی ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 143800,
        "last_updated": null
    },
    {
        "urduURN": 4051050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5178,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، ان سے ابوحمزہ نے ، ا ن سے اعمش نے ، ان سے ابوحازم نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اگر مجھے بکری کے کھر کی دعوت دی جائے تو میں اسے بھی قبول کروں گا اور اگر مجھے وہ کھر بھی ہدیہ میں دیئے جائیں تو میں اسے قبول کروں گا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 113,
        "matchingArabicURN": 143810,
        "last_updated": null
    },
    {
        "urduURN": 4051060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5179,
        "hadithSanad": "ہم سے علی بن عبداللہ بن ابراہیم نے بیان کیا ، انہوں نے کہا ہم سے حجاج بن محمد اعور نے بیان کیا ، انہوں نے کہا کہ ابن جریج نے کہا کہ مجھ کو موسیٰ بن عقبہ نے خبر دی ، انہیں نافع نے ، انہوں نے کہا کہ میں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے سنا ، انہوں نے بیان کیاکہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اس ولیمہ کی جب تمہیں دعوت دی جائے تو قبول کرو ۔ بیان کیا کہ حضرت عبداللہ بن عمر رضی اللہ عنہما اگر روزے سے ہوتے جب بھی ولیمہ کی دعوت یا کسی دوسری دعوت میں شرکت کرتے تھے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 114,
        "matchingArabicURN": 143820,
        "last_updated": null
    },
    {
        "urduURN": 4051070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5180,
        "hadithSanad": "ہم سے عبدالرحمٰن بن المبارک نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، کہا ہم سے عبد العزیز بن صہیب نے بیان کیا ، ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے عورتوں اور بچوں کو کسی شادی سے آتے ہوئے دیکھا تو آپ صلی اللہ علیہ وسلم خوشی کے مارے جلدی سے کھڑے ہو گئے اور فرمایا یا اللہ ! ( تو گواہ رہ ) تم لوگ سب لوگوں سے زیادہ مجھ کو محبوب ہو ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 115,
        "matchingArabicURN": 143830,
        "last_updated": null
    },
    {
        "urduURN": 4051080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5181,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے نافع نے ، ان سے قاسم بن محمد نے اور انہیں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہر ہ حضرت عائشہ رضی اللہ عنہا نے خبر دی کہ",
        "hadithText": "انہوں نے ایک چھوٹا سا گدا خریدا جس میں تصویریں بنی ہوئی تھیں ۔ جب آنحضرت صلی اللہ علیہ وسلم نے اسے دیکھا تو دروازے پر کھڑے ہو گئے اور اندر نہیں آئے ۔ میں نے آنحضرت صلی اللہ علیہ وسلم کے چہرے پر خفگی کے آثار دیکھ لئے اور عرض کیا یا رسول اللہ ! میں اللہ اور اس کے رسول سے توبہ کرتی ہوں ، میں نے کیا غلطی کی ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ گدا یہاں کیسے آیا ؟ بیان کیا کہ میں نے عرض کیا میں نے ہی اسے خریدا ہے تاکہ آپ اس پر بیٹھیں اور اس پر ٹیک لگائیں آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ان تصویروں کے ( بنانے والوں کو ) قیامت کے دن عذاب دیا جائے گا اور ان سے کہا جائے گا کہ جو تم نے تصویر سازی کی ہے اسے زندہ بھی کرو ؟ اور آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جن گھروں میں تصویریں ہوتی ہیں ان میں ( رحمت کے ) فرشتے نہیں آتے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 116,
        "matchingArabicURN": 143840,
        "last_updated": null
    },
    {
        "urduURN": 4051090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5182,
        "hadithSanad": "ہم سے سعید بن ابی مر یم نے بیان کیا ، کہا ہم سے ابو غسان محمد بن مطرف نے بیان کیا ، کہا کہ مجھ سے ابوحازم ( سلمہ بن دینار ) نے بیان کیا ، ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جب حضرت ابواسید ساعدی رضی اللہ عنہ نے شادی کی تو انہوں نے نبی کریم صلی اللہ علیہ وسلم اور آپ کے صحابہ کو دعوت دی ، اس موقعہ پر کھانا ان کی دلہن ام اسید ہی نے تیار کیا تھا اور انہوں نے ہی مردوں کے سامنے کھانا رکھا ۔ انہوں نے پتھر کے ایک بڑے پیالے میں رات کے وقت کھجوریں بھگو دی تھی اور جب آنحضرت صلی اللہ علیہ وسلم کھانے سے فارغ ہوئے تو انہوں نے ہی اس کا شربت بنایا اور آنحضرت صلی اللہ علیہ وسلم کے سامنے ( تحفہ کے طور پر ) پینے کے لئے پیش کیا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 117,
        "matchingArabicURN": 143850,
        "last_updated": null
    },
    {
        "urduURN": 4051100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5183,
        "hadithSanad": "ہم سے یحی بن بکیر نے بیان کیا ، کہا ہم سے یعقوب بن عبدالرحمٰن القاری نے بیان کیا ، ان سے ابو الحازم نے ، کہا کہ میں نے حضرت سہل بن سعد رضی اللہ عنہ سے سنا کہ",
        "hadithText": "حضرت ابواسید ساعدی نے اپنی شادی کے موقع پر رسول اللہ صلی اللہ علیہ وسلم کو دعوت دی ۔ اس دن ان کی بیوی ہی سب کی خدمت کر رہی تھیں ، حالانکہ وہ دلہن تھیں بیوی نے کہا یا سہل نے ( راوی کو شک تھا ) کہ تمہیں معلوم ہے کہ میں نے آنحضرت صلی اللہ علیہ وسلم کے لئے کیا تیار کیا تھا ؟ میں نے آپ کے لئے ایک بڑے پیالے میں رات کے وقت سے کھجور کا شربت تیار کیا تھا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 118,
        "matchingArabicURN": 143860,
        "last_updated": null
    },
    {
        "urduURN": 4051110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5184,
        "hadithSanad": "ہم سے عبد العزیز بن عبداللہ نے بیان کیا ، کہ ہم سے حضرت امام مالک نے بیان کیا ، ان سے ابوالزناد نے ، ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا عورت مثل پسلی کے ہے ، اگر تم اسے سیدھا کرنا چاہو گے تو توڑ دوگے اور اگر اس سے فائدہ حاصل کرنا چاہو گے تو اس کی ٹیڑھ کے ساتھ ہی فائدہ حاصل کرو گے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 119,
        "matchingArabicURN": 143870,
        "last_updated": null
    },
    {
        "urduURN": 4051120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5185,
        "hadithSanad": "ہم سے اسحٰق بن نصر نے بیان کیا ، کہا ہم سے حسین جعفی نے بیان کیا ، ان سے زائدہ نے ، ان سے میسرہ نے ان سے ابو الحازم نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو شخص اللہ اور قیامت کے دن پر ایمان رکھتا ہو وہ اپنے پڑوسی کو تکلیف نہ پہنچائے اور میں تمہیں ۔ \n<span class=urdu_sanad></span> عورتوں کے بارے میں بھلائی کی وصیت کرتا ہوں کیونکہ وہ پسلی سے پیدا کی گئی ہیں اور پسلی میں بھی سب سے زیادہ ٹیڑھا اس کے اوپر کا حصہ ہے ۔ اگر تم اسے سیدھا کرنا چاہو گے تو اسے توڑ ڈالو گے اور اگر اسے چھوڑ دوگے تو وہ ٹیڑھی ہی باقی رہ جائےگی اس لئے میں تمہیں عورتوں کے بارے میں اچھے سلوک کی وصیت کرتا ہوں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 120,
        "matchingArabicURN": 143880,
        "last_updated": null
    },
    {
        "urduURN": 4051140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5187,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے عبداللہ بن دینار نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے وقت میں ہم اپنی بیویوں کے ساتھ گفتگو اور بہت زیادہ بے تکلفی سے اس ڈر کی وجہ سے پرہیز کرتے تھے کہ کہیں کوئی بے اعتدالی ہو جائے اور ہماری برائی میں کوئی حکم نازل نہ ہو جائے پھر جب آنحضرت صلی اللہ علیہ وسلم کی وفات ہو گئی تو ہم نے ان سے خوب کھل کے گفتگو کی اور خوب بے تکلفی کرنے لگے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 121,
        "matchingArabicURN": 143890,
        "last_updated": null
    },
    {
        "urduURN": 4051150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5188,
        "hadithSanad": "ہم سے ابوالنعمان نے بیان کیا ، انہوں نے کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب نے ، ان سے نافع نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہمانے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا تم میں سے ہر ایک حاکم ہے اور ہر ایک سے ( اس کی رعیت کے بارے میں ) سوال ہو گا ۔ پس امام حاکم ہے اس سے سوال ہو گا ۔ مرد اپنی بیوی بچوں کا حاکم ہے اور اس سے سوال ہو گا ۔ عورت اپنے شوہر کے مال کا حاکم ہے اور اس سے سوال ہو گا ۔ غلام اپنے سردار کے مال کا حاکم ہے اور اس سے سوال ہو گا ہاں پس تم میں سے ہر ایک حاکم ہے اور ہر ایک سے سوال ہو گا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 122,
        "matchingArabicURN": 143900,
        "last_updated": null
    },
    {
        "urduURN": 4051160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5189,
        "hadithSanad": "ہم سے سلیمان بن عبدالرحمٰن اور علی بن حجر نے بیان کیا ، ان دونوں نے کہا کہ ہم کو عیسیٰ بن یونس نے خبر دی ، اس نے کہا کہ ہم سے ہشام بن عروہ نے بیان کیا ، انہوں نے اپنے بھائی عبداللہ بن عروہ سے ، انہوں نے اپنے والد عروہ بن زبیر سے ، انہوں نے عائشہ رضی اللہ عنہا سے",
        "hadithText": "انہوں نے کہا کہ گیارہ عورتوں کا ایک اجتماع ہوا جس میں انہوں نے آپس میں یہ طے کیا کہ مجلس میں وہ اپنے اپنے خاوند کا صحیح صحیح حال بیان کریں کوئی بات نہ چھپاویں ۔ چنانچہ پہلی عورت ( نام نامعلوم ) بولی میرے خاوند کی مثال ایسی ہے جیسے دبلے اونٹ کا گوشت جوپہاڑ کی چوٹی پر رکھا ہوا ہو نہ تو وہاں تک جانے کا راستہ صاف ہے کہ آسانی سے چڑھ کر اس کو کوئی لے آوے اور نہ وہ گوشت ہی ایسا موٹا تازہ ہے جسے لانے کے لئے اس پہاڑ پر چڑھنے کی تکلیف گوارا کرے ۔ دوسری عورت ( عمرہ بنت عمرو تمیمی نامی ) کہنے لگی میں اپنے خاوند کا حال بیان کروں تو کہاں تک بیان کروں ( اس میں اتنے عیب ہیں ) میں ڈرتی ہوں کہ سب بیان نہ کر سکوں گی اس پر بھی اگر بیان کروں تو اس کے کھلے اور چھپے سارے عیب بیان کر سکتی ہوں ۔ تیسری عورت ( حیی بنت کعب یمانی ) کہنے لگی ، میرا خاوند کیا ہے ایک تاڑ کا تاڑ ( لمبا تڑنگا ) ہے اگر اس کے عیب بیان کروں تو طلاق تیار ہے اگر خاموش رہوں تو ادھر لٹکی رہوں ۔ چوتھی عورت ( مہدوبنت ابی ہرومہ ) کہنے لگی کہ میراخاوند ملک تہامہ کی رات کی طرح معتدل نہ زیادہ گرم نہ بہت ٹھنڈا نہ اس سے مجھ کو خوف ہے نہ اکتاہٹ ہے ۔ پانچوں عورت ( کبشہ نامی ) کہنے لگی کہ میر ا خاوند ایساہے کہ گھر میں آتا ہے تو وہ ایک چیتا ہے اور جب باہر نکلتاہے تو شیر ( بہادر ) کی طرح ہے ۔ جو چیز گھر میں چھوڑ کر جاتا ہے اس کے بارے میں پوچھتا ہی نہیں ( کہ وہ کہاں گئی ؟ ) اتنا بےپرواہ ہے جو آج کمایا اسے کل کے لئے اٹھا کر رکھتا ہی نہیں اتنا سخی ہے ۔ چھٹی عورت ( ہند نامی ) کہنے لگی کہ میرا خاوند جب کھانے پر آتا ہے تو سب کچھ چٹ کر جاتا ہے اور جب پینے پر آتا ہے تو ایک بوند بھی باقی نہیں چھوڑتا اور جب لیٹتا ہے تو تنہا ہی اپنے اوپر کپڑا لپیٹ لیتا ہے اور الگ پڑکر سو جاتا ہے میرے کپڑے میں کبھی ہاتھ بھی نہیں ڈالتا کہ کبھی میرا دکھ درد کچھ تو معلوم کرے ۔ ساتویں عورت ( حیی بنت علقمہ ) میرا خاوند تو جاہل یا مست ہے ۔ صحبت کے وقت اپنا سینہ میرے سینے سے اوندھا پڑ جاتا ہے ۔ دنیا میں جتنے عیب لوگوں میں ایک ایک کر کے جمع ہیں وہ سب اس کی ذات میں جمع ہیں ( کم بخت سے بات کروں تو ) سر پھوڑ ڈالے یا ہاتھ توڑ ڈالے یا دونوں کام کر ڈالے ۔ آٹھویں عورت ( یاسر بنت اوس ) کہنے لگی میرا خاوند چھونے میں خرگوش کی طرح نرم ہے اور خوشبو میں سونگھو تو زعفران جیسا خوشبودار ہے ۔ نویں عورت ( نام نامعلوم ) کہنے لگی کہ میرے خاوند کا گھر بہت اونچا اور بلند ہے وہ قدآور بہادر ہے ، اس کے یہاں کھانا اس قدر پکتا ہے کہ راکھ کے ڈھیر کے ڈھیر جمع ہیں ۔ ( غریبوں کو خوب کھلاتا ہے ) لوگ جہاں صلاح و مشورہ کے لئے بیٹھتے ہیں ( یعنی پنچائت گھر ) وہاں سے اس کا گھر بہت نزدیک ہے ۔ دسویں عورت ( کبشہ بنت رافع ) کہنے لگی میرے خاوند کا کیا پوچھنا جائیداد والا ہے ، جائیداد بھی کیسی بڑی جائیداد ویسی کسی کے پاس نہیں ہو سکتی بہت سارے اونٹ جو جابجا اس کے گھر کے پاس جٹے رہتے ہیں اور جنگل میں چرنے کم جاتے ہیں ۔ جہاں ان اونٹوں نے باجے کی آوازسنی بس ان کو اپنے ذبح ہونے کا یقین ہو گیا گیارھویں عورت ( ام زرع بنت اکیمل بنت ساعدہ ) کہنے لگی میرا خاوند ابو زرع ہے اس کا کیا کہنا اس نے میرے کانوں کو زیوروں سے بوجھل کر دیا ہے اور میرے دونوں بازو چربی سے پھلا دئیے ہیں مجھے خوب کھلا کر موٹا کر دیا ہے کہ میں بھی اپنے تئیں خوب موٹی سمجھنے لگی ہوں ۔ شادی سے پہلے میں تھوڑی سے بھیڑ بکریوں میں تنگی سے گزر بسر کرتی تھی ۔ ابو زرعہ نے مجھ کو گھوڑوں ، اونٹوں ، کھیت کھلیان سب کا مالک بنا دیا ہے اتنی بہت جائیداد ملنے پر بھی اس کا مزاج اتنا عمدہ ہے کہ بات کہوں تو برا نہیں مانتا مجھ کو کبھی برا نہیں کہتا ۔ سوئی پڑی رہوں تو صبح تک مجھے کوئی نہیں جگاتا ۔ پانی پیوں تو خوب سیراب ہو کر پی لوں رہی ابوزرعہ کی ماں ( میری ساس ) تو میں اس کی کیا خوبیاں بیان کروں اس کا توشہ کھانا مال و اسباب سے بھراہوا ، اس کا گھر بہت ہی کشادہ ۔ ابوزرعہ کا بیٹا وہ بھی کیسا اچھا خوبصورت ( نازک بدن دبلا پتلا ) ہری چھالی یا ننگی تلوار کے برابر اس کے سونے کی جگہ ایسا کم خوراک کہ بکری کے چار ماہ کے بچے کا دست کا گوشت اس کا پیٹ بھردے ۔ ابو زرعہ کی بیٹی وہ بھی سبحان اللہ کیا کہنا اپنے باپ کی پیاری ، اپنی ماں کی پیاری ( تابع فرمان اطاعت گزار ) کپڑا بھرپور پہننے والی ( موٹی تازی ) سوکن کی جلن ابو زرعہ کی لونڈی اس کی بھی کیا پوچھتے ہو کبھی کوئی بات ہماری مشہور نہیں کرتی ( گھر کا بھید ہمیشہ پوشیدہ رکھتی ہے ) کھانے تک نہیں چراتی گھر میں کوڑا کچڑا نہیں چھوڑتی مگر ایک دن ایسا ہوا کہ لوگ مکھن نکالنے کو دودھ متھ رہے تھے ۔ ( صبح ہی صبح ) ابو زرعہ باہر گیا اچانک اس نے ایک عورت دیکھی جس کے دو بچے چیتوں کی طرح اس کی کمر کے تلے دو اناروں سے کھیل رہے تھے ( مراد اس کی دونوں چھاتیاں ہیں جو انار کی طرح تھیں ) ابو زرعہ نے مجھ کو طلاق دے کر اس عورت سے نکاح کر لیا ۔ اس کے بعد میں نے ایک اور شریف سردار سے نکاح کر لیا جو گھوڑے کا اچھا سوار ، عمدہ نیزہ باز ہے ، اس نے بھی مجھ کو بہت سے جانور دے دئیے ہیں اور ہر قسم کے اسباب میں سے ایک ایک جوڑ ا دیا ہوا ہے اور مجھ سے کہا کرتا ہے کہ ام زرع ! خوب کھا پی ، اپنے عزیز و اقرباء کو بھی خوب کھلا پلا تیرے لئے عام اجازت ہے مگر یہ سب کچھ بھی جو میں نے تجھ کو دیا ہوا ہے اگر اکٹھا کروں تو تیرے پہلے خاوند ابو زرعہ نے جوتجھ کو دیا تھا ، اس میں کا ایک چھوٹا برتن بھی نہ بھرے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 123,
        "matchingArabicURN": 143910,
        "last_updated": null
    },
    {
        "urduURN": 4051170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5190,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "کچھ فوجی کھیل کا نیزہ بازی سے مظاہرہ کر رہے تھے ، تو رسول اللہ صلی اللہ علیہ وسلم نے ( اپنے جسم مبارک سے ) میرے لئے پردہ کیا اور میں وہ کھیل دیکھتی رہی ۔ میں نے اسے دیر تک دیکھا اور خود ہی اکتا کر لوٹ آئی ۔ اب تم خود سمجھ لو کہ ایک کم عمر لڑکی کھیل کو کتنی دیر تک دیکھ سکتی ہے اور اس میں دلچسپی لے سکتی ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 124,
        "matchingArabicURN": 143920,
        "last_updated": null
    },
    {
        "urduURN": 4051180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5191,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ، کہا کہ مجھے عبیداللہ بن عبداللہ بن ابی ثور نے خبر دی اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "بہت دنوں تک میرے دل میں خواہش رہی کہ میں عمر بن خطاب رضی اللہ عنہ سے نبی کریم صلی اللہ علیہ وسلم کی ان دو بیویوں کے متعلق پوچھوں جن کے بارے میں اللہ نے یہ آیت نازل کی تھی ۔ ” ان تتوبا الی اللہ فقد صغت قلوبکما “ الخ ۔ ایک مرتبہ انہوں نے حج کی اور ان کے ساتھ میں نے بھی حج کیا ۔ ایک جگہ جب وہ راستہ سے ہٹ کر ( قضائے حاجت کے لئے ) گئے تو میں بھی ایک برتن میں پانی لے کر ان کے ساتھ راستہ سے ہٹ گیا ۔ پھر انہوں نے قضائے حاجت کی اور واپس آئے تو میں نے ان کے ہاتھوں پر پانی ڈالا ۔ پھر انہوں نے وضو کیا تو میں نے اس وقت ان سے پوچھا کہ یا امیرالمؤمنین ! نبی کریم صلی اللہ علیہ وسلم کی بیویوں میں وہ کون ہیں جن کے متعلق اللہ نے یہ ارشاد فرمایا کہ ” ان تتوبا الی اللہ فقد صغت قلوبکما “ عمر بن خطاب رضی اللہ عنہ نے اس پر کہا اے ابن عباس ! تم پر حیرت ہے ۔ وہ عائشہ اور حفصہ ہیں پھر عمر رضی اللہ عنہ نے تفصیل کے ساتھ حدیث بیان کرنے شروع کی ۔ انہوں نے کہا کہ میں اور میرے ایک انصاری پڑوسی جو بنو امیہ بن زید سے تھے اور عوالی مدینہ میں رہتے تھے ۔ ہم نے ( عوالی سے ) رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہونے کے لئے باری مقرر کر رکھی تھی ۔ ایک دن وہ حاضری دیتے اور ایک دن میں حاضری دیتا ، جب میں حاضر ہوتا تو اس دن کی تمام خبریں جو وحی وغیرہ سے متعلق ہوتیں لاتا ( اور اپنے پڑوسی سے بیان کرتا ) اور جس دن وہ حاضر ہوتے تو وہ بھی ایسے کرتے ۔ ہم قریشی لوگ اپنی عورتوں پر غالب تھے لیکن جب ہم مدینہ تشریف آئے تو یہ لوگ ایسے تھے کہ عورتوں سے مغلوب تھے ، ہماری عورتوں نے بھی انصار کی عورتوں کا طریقہ سیکھنا شروع کر دیا ۔ ایک دن میں نے اپنی بیوی کو ڈانٹا تو اس نے بھی میرا ترکی بہ ترکی جواب دیا ۔ میں نے اس کے اس طرح جواب دینے پر ناگواری کا اظہار کیا تو اس نے کہا کہ میرا جواب دینا تمہیں برا کیوں لگتا ہے ، خدا کی قسم نبی کریم صلی اللہ علیہ وسلم کی ازواج بھی ان کو جوابات دے دیتی ہیں اور بعض تو آنحضرت صلی اللہ علیہ وسلم سے ایک دن رات تک الگ رہتی ہیں ۔ میں اس بات پر کانپ اٹھا اور کہا کہ ان میں سے جس نے بھی یہ معاملہ کیا یقیناً وہ نامراد ہو گئی ۔ پھر میں نے اپنے کپڑے پہنے اور ( مدینہ کے لئے ) روانہ ہوا پھر میں حفصہ کے گھر گیا اور میں نے اس سے کہا اے حفصہ ! کیا تم میں سے کوئی بھی نبی کریم صلی اللہ علیہ وسلم سے ایک ایک دن رات تک غصہ رہتی ہے ؟ انہوں نے کہا کہ جی ہاں کبھی ( ایسا ہو جاتا ہے ) میں نے اس پر کہا کہ پھر تم نے اپنے آپ کو خسارہ میں ڈال لیا اور نامراد ہوئی ۔ کیا تمہیں اس کا کوئی ڈر نہیں کہ نبی کریم صلی اللہ علیہ وسلم کے غصہ کی وجہ سے اللہ تم پر غصہ ہو جائے اور پھر تم تنہا ہی ہو جاؤ گی ۔ خبردار ! حضور اکرم صلی اللہ علیہ وسلم سے مطالبات نہ کیا کرو نہ کسی معاملہ میں آنحضرت صلی اللہ علیہ وسلم کو جواب دیا کرو اور نہ آنحضرت صلی اللہ علیہ وسلم کو چھوڑا کرو ۔ اگر تمہیں کوئی ضرورت ہو تو مجھ سے مانگ لیا کرو ۔ تمہاری سوکن جو تم سے زیادہ خوبصورت ہے اور حضور اکرم صلی اللہ علیہ وسلم کو تم سے زیادہ پیاری ہے ، ان کی وجہ سے تم کسی غلط فہمی میں نہ مبتلا ہو جانا ۔ ان کا اشارہ عائشہ رضی اللہ عنہا کی طرف تھا ۔ عمر رضی اللہ عنہ نے بیان کیا کہ ہمیں معلوم ہوا تھا کہ ملک غسان ہم پر حملہ کے لئے فوجی تیاریاں کر رہا ہے ۔ میرے انصاری ساتھی اپنی باری پر مدینہ منورہ گئے ہوئے تھے ۔ وہ رات گئے واپس آئے اور میرے دروازے پر بڑی زور زور سے دستک دی اور کہا کہ کیا عمر رضی اللہ عنہ گھر میں ہیں ۔ میں گھبرا کر باہر نکلا تو انہوں نے کہا کہ آج تو بڑا حادثہ ہو گیا ۔ میں نے کہا کیا بات ہوئی ، کیا غسانی چڑھ آئے ہیں ؟ انہوں نے کہا کہ نہیں ، حادثہ اس سے بھی بڑا اور اس سے بھی زیادہ خوفناک ہے ۔ حضور اکرم صلی اللہ علیہ وسلم نے ازواج مطہرات کو طلاق دے دی ہے ۔ میں نے کہا کہ حفصہ تو خاسر و نامراد ہوئی ۔ مجھے تو اس کا خطرہ لگا ہی رہتا تھا کہ اس طرح کا کوئی حادثہ جلد ہی ہو گا پھر میں نے اپنے تمام کپڑے پہنے ( اور مدینہ کے لئے روانہ ہو گیا ) میں نے فجر کی نماز حضور اکرم صلی اللہ علیہ وسلم کے ساتھ پڑھی ( نماز کے بعد ) حضور اکرم صلی اللہ علیہ وسلم اپنے ایک بالا خانہ میں چلے گئے اور وہاں تنہائی اختیار کر لی ۔ میں حفصہ کے پاس گیا تو وہ رو رہی تھی ۔ میں نے کہا اب روتی کیا ہو ۔ میں نے تمہیں پہلے ہی متنبہ کر دیا تھا ۔ کیا آنحضرت صلی اللہ علیہ وسلم نے تمہیں طلاق دے دی ہے ؟ انہوں نے کہا کہ مجھے معلوم نہیں ۔ حضور اکرم صلی اللہ علیہ وسلم اس وقت بالا خانہ میں تنہا تشریف رکھتے ہیں ۔ میں وہاں سے نکلا اور منبر کے پاس آیا ۔ اس کے گرد کچھ صحابہ کرام موجود تھے اور ان میں سے بعض رو رہے تھے ۔ تھوڑی دیر تک میں ان کے ساتھ بیٹھا رہا ۔ اس کے بعد میرا غم مجھ پر غالب آ گیا اور میں اس بالا خانہ کے پاس آیا ۔ جہاں حضور اکرم صلی اللہ علیہ وسلم تشریف رکھتے تھے ۔ میں نے آنحضرت کے ایک حبشی غلام سے کہا کہ عمر کے لئے اندر آنے کی اجازت لے لو ۔ غلام اندر گیا اور حضور اکرم صلی اللہ علیہ وسلم سے گفتگو کر کے واپس آ گیا ۔ اس نے مجھ سے کہا کہ میں نے آنحضرت صلی اللہ علیہ وسلم سے عرض کی اور آنحضرت صلی اللہ علیہ وسلم سے آپ کا ذکر کیا لیکن آپ خاموش رہے ۔ چنانچہ میں واپس چلا آیا اور پھر ان لوگوں کے ساتھ بیٹھ گیا جو منبر کے پاس موجود تھے ۔ میرا غم مجھ پر غالب آیا اور دوبارہ آ کر میں نے غلام سے کہا کہ عمر رضی اللہ عنہ کے لئے اجازت لے لو ۔ اس غلام نے واپس آ کر پھرکہا کہ میں نے آنحضرت صلی اللہ علیہ وسلم کے سامنے آپ کا ذکر کیا تو آنحضرت صلی اللہ علیہ وسلم خاموش رہے ۔ میں پھر واپس آ گیا اور منبر کے پاس جو لوگ موجود تھے ان کے ساتھ بیٹھ گیا ۔ لیکن میرا غم مجھ پرغالب آیا اور میں نے پھرآ کر غلام سے کہا کہ عمرکے لئے اجازت طلب کرو ۔ غلام اندر گیا اور واپس آ کر جواب دیا کہ میں نے آپ کا ذکرآنحضرت صلی اللہ علیہ وسلم سے کیا اور آنحضرت صلی اللہ علیہ وسلم خاموش رہے ۔ میں وہاں سے واپس آ رہا تھا کہ غلام نے مجھ کوپکار ا اور کہا حضور اکرم صلی اللہ علیہ وسلم نے تمہیں اجازت دے دی ہے ۔ میں آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آپ اس بان کی چارپائی پر جس سے چٹائی بنی جاتی ہے لیٹے ہوئے تھے ۔ اس پر کوئی بستر نہیں تھا ۔ بان کے نشانات آپ کے پہلو مبارک پر پڑے ہوئے تھے ۔ جس تکیہ پر آپ ٹیک لگائے ہوئے تھے اس میں چھال بھری ہوئی تھی ۔ میں نے حضور اکرم صلی اللہ علیہ وسلم کو سلام کیا اور کھڑے ہی کھڑے عرض کیا یا رسول اللہ ! کیا آپ نے اپنی ازواج کو طلاق دے دی ہے ؟ آنحضور صلی اللہ علیہ وسلم نے میری طرف نگاہ اٹھائی اور فرمایا نہیں ۔ میں ( خوشی کی وجہ سے ) کہہ اٹھا ۔ اللہ اکبر ۔ پھر میں نے کھڑے ہی کھڑے آنحضرت صلی اللہ علیہ وسلم کو خوش کرنے کے لئے کہا کہ یا رسول اللہ ! آپ کو معلوم ہے ہم قریش کے لوگ عورتوں پر غالب رہا کرتے تھے ۔ پھر جب ہم مدینہ آئے تو یہاں کے لوگوں پر ان کی عورتیں غالب تھیں ۔ آنحضرت صلی اللہ علیہ وسلم اس پر مسکرادیئے ۔ پھر میں نے عرض کیا یا رسول اللہ ! آپ کو معلوم ہے میں حفصہ کے پاس ایک مرتبہ گیا تھا اور اس سے کہہ آیا تھا کہ اپنی سوکن کی وجہ سے جو تم سے زیادہ خوبصورت اور تم سے زیادہ رسول اللہ صلی اللہ علیہ وسلم کو عزیز ہے ، دھوکا میں مت رہنا ۔ ان کا اشارہ عائشہ رضی اللہ عنہا کی طرف تھا ۔ اس پر حضور اکرم صلی اللہ علیہ وسلم دوبارہ مسکرا دیئے ۔ میں نے آنحضور صلی اللہ علیہ وسلم کو مسکراتے دیکھا تو بیٹھ گیا پھر نظر اٹھا کر میں آنحضور صلی اللہ علیہ وسلم کے گھر کا جائزہ لیا ۔ خدا کی قسم ، میں نے آنحضرت صلی اللہ علیہ وسلم کے گھر میں کوئی ایسی چیز نہیں دیکھی جس پر نظر رکتی ۔ سوا تین چمڑوں کے ( جو وہاں موجود تھے ) میں نے عرض کیا یا رسول اللہ ! اللہ سے دعا فرمائیں کہ وہ آپ کی امت کو فراخی عطا فرمائے ۔ فارس و روم کو فراخی اور وسعت حاصل ہے اور انہیں دنیا دی گئی ہے حالانکہ وہ اللہ کی عبادت نہیں کرتے ۔ آنحضرت صلی اللہ علیہ وسلم ابھی تک ٹیک لگائے ہوئے تھے لیکن اب سیدھے بیٹھ گئے اور فرمایا ابن خطاب ! تمہاری نظر میں بھی یہ چیزیں اہمیت رکھتی ہیں ، یہ تو وہ لوگ ہیں جنہیں جو کچھ بھلائی ملنے والی تھی سب اسی دنیا میں دے دی گئی ہے ۔ میں نے عرض کیا یا رسول اللہ ! میرے لئے اللہ سے مغفرت کی دعا کر دیجئیے ( کہ میں نے دنیاوی شان و شوکت کے متعلق یہ غلط خیال دل میں رکھا ) چنانچہ حضور اکرم صلی اللہ علیہ وسلم نے اپنی ازواج کو اسی وجہ سے انتیس دن تک الگ رکھا کہ حفصہ نے آنحضور صلی اللہ علیہ وسلم کا راز عائشہ سے کہہ دیا تھا ۔ آنحضور صلی اللہ علیہ وسلم نے فرمایا تھا کہ ایک مہینہ تک میں اپنی ازواج کے پاس نہیں جاؤں گا ۔ کیونکہ جب اللہ تعالیٰ نے آنحضرت صلی اللہ علیہ وسلم پر عتاب کیا تو آنحضرت صلی اللہ علیہ وسلم کو اس کا بہت رنج ہوا ( اور آپ نے ازواج سے الگ رہنے کا فیصلہ کیا ) پھر جب انتیسویں رات گزر گئی تو آنحضور عائشہ رضی اللہ عنہا کے گھر تشریف لے گئے اور آپ سے ابتداء کی ۔ عائشہ رضی اللہ عنہا نے عرض کیا کہ یا رسول اللہ ! آپ نے قسم کھائی تھی کہ ہمارے یہاں ایک مہینہ تک تشریف نہیں لائیں گے اور ابھی تو انتیس ہی دن گزرے ہیں میں تو ایک ایک دن گن رہی تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ مہینہ انتیس کا ہے ۔ وہ مہینہ انتیس ہی کا تھا ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر اللہ تعالیٰ نے آیت تخییر نازل کی اور آنحضور صلی اللہ علیہ وسلم اپنی تمام ازواج میں سب سے پہلے میرے پاس تشریف لائے ( اور مجھ سے اللہ کی وحی کا ذکر کیا ) تو میں نے آنحضور صلی اللہ علیہ وسلم کو ہی پسند کیا ۔ اس کے بعد آنحضور صلی اللہ علیہ وسلم نے اپنی تمام دوسری ازواج کو اختیار دیا اور سب نے وہی کہا جو حضرت عائشہ رضی اللہ عنہا کہہ چکی تھیں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 125,
        "matchingArabicURN": 143930,
        "last_updated": null
    },
    {
        "urduURN": 4051190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5192,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو معمر نے خبر دی ، انہیں ہمام بن منبہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اگر شوہر گھر پر موجود ہے تو کوئی عورت اس کی اجازت کے بغیر ( نفلی ) روزہ نہ رکھے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 126,
        "matchingArabicURN": 143940,
        "last_updated": null
    },
    {
        "urduURN": 4051200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5193,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے ابن ابی عدی نے بیان کیا ، ان سے شعبہ نے ، ان سے سلیمان نے ، ان سے ابوحازم نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب شوہر اپنی بیوی کو اپنے بستر پر بلائے اور وہ آنے سے ( ناراضگی کی وجہ سے ) انکار کر دے تو فرشتے صبح تک اس پر لعنت بھیجتے ہیں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 127,
        "matchingArabicURN": 143950,
        "last_updated": null
    },
    {
        "urduURN": 4051210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5194,
        "hadithSanad": "ہم سے محمد بن عرعرہ نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے بیان کیا ، ان سے زرارہ نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اگر عورت اپنے شوہر سے ناراضگی کی وجہ سے اس کے بستر سے الگ تھلگ رات گزارنے تو فرشتے اس پر اس وقت تک لعنت بھیجتے ہیں جب تک وہ اپنی اس حر کت سے باز نہ آ جائے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 128,
        "matchingArabicURN": 143960,
        "last_updated": null
    },
    {
        "urduURN": 4051220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5195,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، کہا ہم سے ابوالزناد نے بیان کیا ، ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا عورت کے لئے جائز نہیں کہ اپنے شوہر کی موجودگی میں اس کی اجازت کے بغیر ( نفلی ) روزہ رکھے اور عورت کسی کو اس کے گھر میں اس کی مرضی کے بغیر آنے کی اجازت نہ دے اور عورت جو کچھ بھی اپنے شوہر کے مال میں سے اس کی صریح اجازت کے بغیر خرچ کر دے تو اسے بھی اس کا آدھا ثواب ملے گا ۔ اس حدیث کو ابوالزناد نے موسیٰ بن ابی عثمان سے بھی اور ان سے ان کے والد نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے روایت کیا ہے اور اس میں صرف روزہ کا ہی ذکر ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 129,
        "matchingArabicURN": 143970,
        "last_updated": null
    },
    {
        "urduURN": 4051230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5196,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے اسما عیل نے بیان کیا ، کہا کہ ہم کو تیمی نے خبر دی ، انہیں ابوعثمان نے ، انہیں حضرت اسامہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ",
        "hadithText": "میں جنت کے دروازہ پر کھڑا ہوا تو اس میں داخل ہونے والوں کی اکثریت غریبوں کی تھی ۔ مالدار ( جنت کے دروازے پر حساب کے لئے ) روک لئے گئے تھے البتہ جہنم والوں کو جہنم میں جانے کا حکم دے دیا گیا تھا اور میں جہنم کے دروازے پر کھڑا ہوا تو اس میں داخل ہونے والی زیادہ عورتیں تھیں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 130,
        "matchingArabicURN": 143980,
        "last_updated": null
    },
    {
        "urduURN": 4051240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5197,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو امام مالک نے خبر دی ، انہیں زیدبن اسلم نے ، انہیں عطاء بن یسار نے اور انہیں حضرت عبداللہ بن عباس رضی اللہ عنہما نے ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں سورج گرہن ہوا تو آنحضرت صلی اللہ علیہ وسلم نے لوگوں کے ساتھ اس کی نماز پڑھی ۔ آپ نے بہت لمبا قیام کی اتنا طویل کہ سورۃ البقرہ پڑھی جا سکے پھر طویل رکوع کیا ۔ رکوع سے سر اٹھا کر بہت دیر تک قیام کیا ۔ یہ قیام پہلے قیام سے کچھ کم تھا ۔ پھر آپ نے دوسراطویل رکوع کیا ۔ یہ رکوع طوالت میں پہلے رکوع سے کچھ کم تھا ۔ پھر سر اٹھایا اور سجدہ کیا ۔ پھر دوبارہ قیام کیا اور بہت دیر تک حالت قیام میں رہے ۔ یہ قیام پہلی رکعت کے قیام سے کچھ کم تھا ۔ پھر طویل رکوع کیا ، یہ رکوع پہلے رکوع سے کچھ کم طویل تھا ۔ پھر سر اٹھایا اور طویل قیام کیا ۔ یہ قیام پہلے قیام سے کچھ کم تھا ۔ پھر رکوع کیا ، طویل رکوع ۔ اور یہ رکوع پہلے رکوع سے کچھ کم طویل تھا ۔ پھر سر اٹھایا اور سجدہ میں گئے ۔ جب آپ نماز سے فارغ ہوئے تو گرہن ختم ہو چکا تھا ۔ اس کے بعد آپ نے فرمایا کہ سورج اور چاند اللہ کی نشانیوں میں سے دو نشانیاں ہیں ، ان میں گرہن کسی کی موت یا کسی کی حیات کی وجہ سے نہیں ہوتا ۔ اس لئے جب تم گرہن دیکھو تو اللہ کو یاد کرو ۔ صحابہ نے عرض کیا یا رسول اللہ ! ہم نے آپ کو دیکھا کہ آپ نے اپنی جگہ سے کوئی چیز بڑھ کر لی ۔ پھر ہم نے دیکھا کہ آپ ہم سے ہٹ گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں نے جنت دیکھی تھی یا ( آنحضور صلی اللہ علیہ وسلم نے فرمایا راوی کو شک تھا ) مجھے جنت دکھائی گئی تھی ۔ میں نے اس کا خوشہ توڑنے کے لئے ہاتھ بڑھایا تھا اور اگر میں اسے توڑ لیتا تو تم رہتی دنیا تک اسے کھاتے اور میں نے دوزخ دیکھی آج کا اس سے زیادہ ہیبت ناک منظر میں نے کبھی نہیں دیکھا اور میں نے دیکھا کہ اس میں عورتوں کی تعداد زیادہ ہے ۔ صحابہ نے عرض کیا یا رسول اللہ ! ایسا کیوں ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا وہ شوہر کی ناشکری کرتی ہے اور ان کے احسان کا انکار کرتی ہیں ، اگر تم ان میں سے کسی ایک کے ساتھ زندگی بھر بھی حسن سلوک کا معاملہ کرو پھر بھی تمہاری طرف سے کوئی چیز اس کے لئے ناگواری خاطر ہوئی تو کہہ دے گی کہ میں نے تو تم سے کبھی بھلا ئی دیکھی ہی نہیں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 131,
        "matchingArabicURN": 143990,
        "last_updated": null
    },
    {
        "urduURN": 4051250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5198,
        "hadithSanad": "ہم سے عثمان بن ہشیم نے بیان کیا ، کہا ہم سے عوف نے بیان کیا ، ان سے ابوحازم نے ، ان سے عمران نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ",
        "hadithText": "میں جنت میں جھانک کر دیکھا تو اس کے اکثر رہنے والے غریب لوگ تھے اور میں نے دوزخ میں جھانک کر دیکھا تو اس کے اندر رہنے والی اکثر عورتیں تھیں ۔ اس روایت کی متابعت ابوایوب اور سلم بن زریر نے کی ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 132,
        "matchingArabicURN": 144000,
        "last_updated": null
    },
    {
        "urduURN": 4051260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5199,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو اوزاعی نے خبر دی ، کہا کہ مجھ سے یحییٰ ابن ابی کثیر نے بیان کیا ، کہا کہ مجھ سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا ، کہا کہ مجھ سے حضرت عبداللہ بن عمرو بن العاص رضی اللہ عنہما نے بیان کیا ، انہوں نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا عبداللہ ! کیا میری یہ اطلاع صحیح ہے کہ تم ( روزانہ ) دن میں روزے رکھتے ہو اور رات بھر عبادت کرتے ہو ؟ میں نے عرض کیا جی ہاں یا رسول اللہ ! آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ایسا نہ کرو ، روزے بھی رکھو اور بلا روزے بھی رہو ۔ رات میں عبادت بھی کرو اور سوؤ بھی ۔ کیونکہ تمہارے بدن کا بھی تم پر حق ہے ، تمہاری آنکھ کا بھی تم پر حق ہے اور تمہاری بیوی کا بھی تم پر حق ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 133,
        "matchingArabicURN": 144010,
        "last_updated": null
    },
    {
        "urduURN": 4051270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5200,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ نے خبر دی ، انہوں نے کہا ہم کو موسیٰ بن عقبہ نے خبر دی ، انہیں نافع نے اور انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا تم میں سے ہر ایک حاکم ہے اور ہر ایک سے اس کی رعیت کے بارے میں سوال ہو گا ۔ امیر ( حاکم ) ہے ، مراد اپنے گھر والوں پر حاکم ہے ۔ عورت اپنے شوہر کے گھر اور اس کے بچوں پر حاکم ہے ۔ تم میں سے ہر ایک حاکم ہے اور ہر ایک سے اس کی رعیت کے بارے میں سوال ہو گا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 134,
        "matchingArabicURN": 144020,
        "last_updated": null
    },
    {
        "urduURN": 4051280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5201,
        "hadithSanad": "ہم سے خالد نے مخلد نے بیان کیا ، انہوں نے کہا ہم سے سلیمان نے بیان کیا ، انہوں نے کہا کہ مجھ سے حمید نے بیان کیا اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم اپنی ازواج مطہرات سے ایک مہینہ تک الگ رہے اور اپنے ایک بالاخانہ میں قیام کیا ۔ پھر آپ انتیس دن کے بعد گھر میں تشریف لائے تو کہا گیا کہ یا رسول اللہ ! آپ نے تو ایک مہینہ کے لئے عہد کیا تھا آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ مہینہ 29 کا ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 135,
        "matchingArabicURN": 144030,
        "last_updated": null
    },
    {
        "urduURN": 4051290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5202,
        "hadithSanad": "ہم سے ابو عاصم نے بیان کیا ، ان سے ابن جریج نے ( دوسری سند ) امام بخاری نے کہا اور مجھ سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو حضرت عبداللہ بن مبارک نے خبر دی ، انہیں ابن جریج نے خبر دی ، کہا کہ مجھے یحییٰ بن عبداللہ بن صیفی نے خبر دی ، انہیں عکرمہ بن عبدالرحمٰن بن حارث نے خبر دی اور انہیں حضرت ام سلمہ رضی اللہ عنہا نے خبر دی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ( ایک واقعہ کی وجہ سے ) قسم کھائی کہ اپنی بعض ازواج کے یہاں ایک مہینہ تک نہیں جائیں گے ۔ پھر جب انتیس دن گزر گئے تو آنحضرت صلی اللہ علیہ وسلم ان کے پاس صبح کے وقت گئے یا شام کے وقت آنحضرت صلی اللہ علیہ وسلم سے عرض کیا گیا کہ آپ نے تو قسم کھائی تھی کہ ایک مہینہ تک نہیں آئیں گے ؟ آپ نے فرمایا کہ مہینہ انتیس دن کا بھی ہوتا ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 136,
        "matchingArabicURN": 144040,
        "last_updated": null
    },
    {
        "urduURN": 4051300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5203,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے مروان بن معاویہ نے ، کہا ہم سے ابو یعفور نے بیان کیا ، کہا کہ ہم سے ابو الضحیٰ کی مجلس میں ( مہینہ پر ) بحث کی تو انہوں نے بیان کیا کہ",
        "hadithText": "ہم سے ابن عباس رضی اللہ عنہما نے بیان کیا ، انہوں نے کہا کہ ایک دن صبح ہوئی تو نبی کریم صلی اللہ علیہ وسلم کی ازواج رو رہی تھیں ، پر زوجہ مطہرہ کے پاس ان کے گھر والے موجود تھے ۔ مسجد کی طرف گیا تو وہ بھی لوگوں سے بھری ہوئی تھی ۔ پھر عمر بن خطاب آئے اورنبی کریم صلی اللہ علیہ وسلم کی خدمت میں اوپر گئے تو آنحضرت صلی اللہ علیہ وسلم اس وقت ایک کمرہ میں تشریف رکھتے تھے ۔ انہوں نے سلام کیا لیکن کسی نے جواب نہیں دیا ۔ انہوں نے پھر سلام کیا لیکن کسی نے جواب نہیں دیا ۔ پھر سلام کیا اور اس مرتبہ بھی کسی نے جواب نہیں دیا تو آواز دی ( بعد میں اجازت ملنے پر ) آنحضرت صلی اللہ علیہ وسلم کی خدمت میں گئے اور عرض کیا کیا آنحضرت صلی اللہ علیہ وسلم نے اپنی ازواج کو طلاق دے دی ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں بلکہ ایک مہینہ تک ان سے الگ رہنے کی قسم کھائی ہے ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم انتیس دن تک الگ رہے اور پھر اپنے بیویوں کے پاس گئے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 137,
        "matchingArabicURN": 144050,
        "last_updated": null
    },
    {
        "urduURN": 4051310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5204,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عبداللہ بن زمعہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا تم میں کوئی شخص اپنی بیوی کو غلاموں کی طرح نہ مارے کہ پھر دوسرے دن اس سے ہمبستر ہو گا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 138,
        "matchingArabicURN": 144060,
        "last_updated": null
    },
    {
        "urduURN": 4051320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5205,
        "hadithSanad": "ہم سے خلاد بن یحییٰ نے بیان کیا ، کہا ہم سے ابراہیم بن نافع نے ، ان سے حسن نے وہ مسلم کے صاحبزادے ہیں ، ان سے صفیہ رضی اللہ عنہا نے ، ان سے عائشہ نے کہ",
        "hadithText": "قبیلہ انصار کی ایک خاتون نے اپنی بیٹی کی شادی کی تھی ۔ اس کے بعد لڑکی کے سر کے بال بیماری کی وجہ سے اڑ گئے تو وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور آپ سے اس کا ذکر کیا اور کہا کہ اس کے شوہر نے اس سے کہا ہے کہ اپنے بالوں کے ساتھ ( دوسرے مصنوعی بال ) جوڑے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ ایسا تو ہرگز مت کرکیونکہ مصنوعی با ل سر پر رکھ کے جو جوڑے تو ایسے بال جوڑنے والیوں پر لعنت کی گئی ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 139,
        "matchingArabicURN": 144070,
        "last_updated": null
    },
    {
        "urduURN": 4051330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5206,
        "hadithSanad": "ہم سے ابن سلام نے بیان کیا ، کہا ہم کو ابومعاویہ نے خبر دی ، انہیں ہشام بن عروہ نے ، انہیں ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے",
        "hadithText": "آیت ” اور اگر کوئی عورت اپنے شوہر کی طرف سے نفرت اور منہ موڑنے کا خوف محسوس کرے ۔ “ کے متعلق فرمایا کہ آیت میں ایسی عورت کا بیان ہے جو کسی مرد کے پاس ہو اور وہ مرد اسے اپنے پاس زیادہ نہ بلاتا ہو بلکہ اسے طلاق دینے کا ارادہ رکھتا ہو اور اس کے بجائے دوسری عورت سے شادی کرنا چاہتا ہو لیکن اس کی موجودہ بیوی اس سے کہے کہ مجھے اپنے ساتھ ہی رکھو اور طلاق نہ دو ۔ تم میرے سوا کسی اور سے شادی کر سکتے ہو ، میرے خرچ سے بھی تم آزاد ہو اور تم پر باری کی بھی کوئی پابندی نہیں تو اس کا ذکر اللہ تعالیٰ کے اس ارشاد میں کہ ” پس ان پر کوئی گناہ نہیں اگر وہ آپس میں صلح کر لیں اور صلح بہرحال بہتر ہے ۔ “</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 140,
        "matchingArabicURN": 144080,
        "last_updated": null
    },
    {
        "urduURN": 4051340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5207,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے یحییٰ بن سعید نے بیان کیا ، ان سے ابن جریج نے ، ان سے عطاء نے اور ان سے جابر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں ہم عزل کیا کرتے تھے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 141,
        "matchingArabicURN": 144090,
        "last_updated": null
    },
    {
        "urduURN": 4051350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5208,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے عمرو بن دینار نے بیان کیا ، انہیں عطاء نے خبر دی ، انہوں نے جابر رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں جب قرآن نازل ہو رہا تھا ہم عزل کرتے تھے ۔ \n<span class=urdu_sanad>اور عمرو بن دینار نے بیان کیاعطاء سے انہوں نے حضرت جابر رضی اللہ عنہ سے کہ</span> قرآن نازل ہو رہا تھا ۔ اور ہم عزل کرتے تھے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 142,
        "matchingArabicURN": 144101,
        "last_updated": null
    },
    {
        "urduURN": 4051370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5210,
        "hadithSanad": "ہم سے عبداللہ بن محمد بن اسماء نے بیان کیا ، کہا ہم سے جویریہ نے بیان کیا ، ان سے امام مالک بن انس نے ، ان سے زہری نے ، ان سے ابن محیریز نے اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "( ایک غزوہ میں ) ہمیں قیدی عورتیں ملیں اور ہم نے ان سے عزل کیا ۔ پھر ہم نے رسول اللہ صلی اللہ علیہ وسلم سے اس کا حکم پوچھا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کیا تم واقعی ایسا کرتے ہو ؟ تین مرتبہ آپ نے یہ فرمایا ( پھر فرمایا ) قیامت تک جو روح بھی پیدا ہونے والی ہے وہ ( اپنے وقت پر ) پیدا ہو کر رہے گی ۔ پس تمہارا عزل کرنا عبث حرکت ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 143,
        "matchingArabicURN": 144120,
        "last_updated": null
    },
    {
        "urduURN": 4051380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5211,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے عبدالواحد بن ایمن نے ، کہا کہ مجھ سے ابن ابی ملیکہ نے ، ان سے قاسم نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم جب سفر کا ارادہ کرتے تو اپنی ازواج کے لئے قرعہ ڈالتے ۔ ایک مرتبہ قرعہ عائشہ اور حفصہ رضی اللہ عنہما کے نام نکلا ۔ حضور اکرم صلی اللہ علیہ وسلم رات کے وقت معمولاً چلتے وقت عائشہ رضی اللہ عنہا کے ساتھ باتیں کرتے ہوئے چلتے ۔ ایک مرتبہ حفصہ رضی اللہ عنہا نے ان سے کہا کہ آج رات کیوں نہ تم میرے اونٹ پر سوار ہو جاؤ اور میں تمہارے اونٹ پر تاکہ تم بھی نئے مناظر دیکھ سکو اور میں بھی ۔ انہوں نے یہ تجویز قبول کر لی اور ( ہر ایک دوسرے کے اونٹ پر ) سوار ہو گئیں ۔ اس کے بعد حضور اکرم صلی اللہ علیہ وسلم عائشہ کے اونٹ کے پاس تشریف لائے ۔ اس وقت اس پر حفصہ رضی اللہ عنہا بیٹھی ہوئی تھیں ۔ آنحضرت صلی اللہ علیہ وسلم نے انہیں سلام کیا ، پھر چلتے رہے ، جب پڑاؤ ہوا تو حضور اکرم صلی اللہ علیہ وسلم کو معلوم ہوا کہ عائشہ رضی اللہ عنہا اس میں نہیں ہیں ( اس غلطی پر عائشہ کو اس درجہ رنج ہوا کہ ) جب لوگ سواریوں سے اتر گئے تو ام المؤمنین نے اپنے پاؤں اذخر گھاس میں ڈال لئے اور دعا کرنے لگی کہ اے میرے رب ! مجھ پر کوئی بچھو یا سانپ مسلط کر دے جو مجھ کو ڈس لے ۔ عائشہ رضی اللہ عنہا کہتی ہیں کہ میں آنحضرت صلی اللہ علیہ وسلم سے تو کچھ کہہ نہیں سکتی تھی کیونکہ یہ حرکت خود میری ہی تھی ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 144,
        "matchingArabicURN": 144130,
        "last_updated": null
    },
    {
        "urduURN": 4051390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5212,
        "hadithSanad": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے زہیر نے بیان کیا ، اس سے ہشام بن عروہ نے ، ان سے ان کے والد نے اورا ن سے عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "سودہ بنت زمعہ نے اپنی باری عائشہ رضی اللہ عنہا کو دے دی تھی اور رسول اللہ صلی اللہ علیہ وسلم عائشہ رضی اللہ عنہا کے یہاں خود ان کی باری کے دن اور سودہ رضی اللہ عنہا کی باری کے دن رہتے تھے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 145,
        "matchingArabicURN": 144140,
        "last_updated": null
    },
    {
        "urduURN": 4051400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5213,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے بشر بن مفضل نے ، ان سے خالد حذاء نے ، ان سے ابوقلابہ نے بیان کیا اور ان سے انس رضی اللہ عنہ نے ( راوی ابوقلابہ یا انس رضی اللہ عنہ نے ) کہا کہ",
        "hadithText": "اگر میں چاہوں تو کہہ سکتاہوں کہ نبی کریم صلی اللہ علیہ وسلم نے ( آنے والی حدیث ) ارشاد فرمائی ۔ لیکن بیان کیا کہ دستور یہ ہے کہ جب کنواری سے شادی کرے تو اس کے ساتھ سات دن تک رہنا چاہئے اور جب بیوہ سے شادی کرے تو اس کے ساتھ تین دن تک رہنا چاہئے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 146,
        "matchingArabicURN": 144150,
        "last_updated": null
    },
    {
        "urduURN": 4051410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5214,
        "hadithSanad": "ہم سے یوسف بن راشد نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے سفیان ثوری نے ، کہا ہم سے ایوب اور خالد نے دونوں نے بیان کیا ، ان سے ابوقلابہ نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ دستور یہ کہ",
        "hadithText": "جب کوئی شخص پہلے سے شادی شدہ بیوی کی موجودگی میں کسی کنواری عورت سے شادی کرے تو اس کے ساتھ سات دن تک قیام کرے اور پھر باری مقرر کرے اور جب کسی کنواری بیوی کی موجودگی میں پہلے سے شادی شدہ عورت سے نکاح کرے تو اس کے ساتھ تین دن تک قیام کرے اور پھر باری مقرر کرے ۔ ابوقلابہ نے بیان کیا کہ اگر میں چاہوں تو کہہ سکتا ہوں کہ حضرت انس رضی اللہ عنہ نے یہ حدیث نبی کریم صلی اللہ علیہ وسلم سے مرفوعاً بیان کی ہے ۔ اور عبدالرزاق نے بیان کیا ، انہیں سفیان نے خبر دی ، انہیں ایوب اور خالد نے کہا کہ اگر میں چاہوں تو کہہ سکتا ہوں کہ حضرت انس رضی اللہ عنہ نے یہ حدیث نبی کریم صلی اللہ علیہ وسلم سے مرفوعاً بیان کی ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 147,
        "matchingArabicURN": 144160,
        "last_updated": null
    },
    {
        "urduURN": 4051420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5215,
        "hadithSanad": "ہم سے عبدالاعلیٰ بن حماد نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، کہا ہم سے سعید نے بیان کیا اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک رات میں نبی کریم صلی اللہ علیہ وسلم اپنی تمام ازواج مطہرات کے پاس گئے ۔ اس وقت آنحضور صلی اللہ علیہ وسلم کے نکاح میں نو بیویاں تھیں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 148,
        "matchingArabicURN": 144170,
        "last_updated": null
    },
    {
        "urduURN": 4051430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5216,
        "hadithSanad": "ہم سے فروہ نے بیان کیا ، کہا ہم سے علی بن مسہر نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے ، کہا",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم عصر کی نماز سے فارغ ہو کر اپنی ازواج مطہرات کے پاس تشریف لے جاتے اور ان میں سے کسی ایک کے قریب بھی بیٹھتے ۔ ایک دن آنحضور صلی اللہ علیہ وسلم حضرت حفصہ رضی اللہ عنہا کے یہاں گئے اور معمول سے زیادہ کافی دیر تک ٹھہرے رہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 149,
        "matchingArabicURN": 144180,
        "last_updated": null
    },
    {
        "urduURN": 4051440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5217,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے سلیمان بن بلال نے بیان کیا ، ان سے ہشام بن عروہ نے بیان کیا ، انہیں ان کے والد نے خبر دی اور انہیں حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کی جس مرض میں وفات ہوئی ، اس میں آپ پوچھا کرتے تھے کہ کل میری باری کس کے یہاں ہے ۔ کل میری باری کس کے یہاں ہے ؟ آپ کو حضرت عائشہ کی باری کا انتظار تھا ۔ چنانچہ آپ کی تمام ازواج نے آپ کو اس کی اجازت دے دی کہ آنحضور جہاں چاہیں بیماری کے دن گزاریں ۔ آنحضور صلی اللہ علیہ وسلم حضرت عائشہ رضی اللہ عنہا کے گھر آ گئے اور یہیں آپ کی وفات ہوئی ۔ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ آنحضور صلی اللہ علیہ وسلم کی اسی دن وفات ہوئی جو میری باری کا دن تھا اور اللہ تعالیٰ کا یہ بھی احسان دیکھو اس نے جب حضور اکرم صلی اللہ علیہ وسلم کو اپنے یہاں بلایا تو آنحضور صلی اللہ علیہ وسلم کا سرمبارک میرے سینے پر تھا اور آنحضرت صلی اللہ علیہ وسلم کا لعاب دہن میرے لعاب دہن سے ملا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 150,
        "matchingArabicURN": 144190,
        "last_updated": null
    },
    {
        "urduURN": 4051450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5218,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا ہم سے سلیمان نے بیان کیا ، ان سے یحییٰ نے ، ان سے عبید بن حنین نے ، انہوں نے حضرت ابن عباس رضی اللہ عنہما سے سنا ، انہوں نے حضرت عمر رضی اللہ عنہ سے کہ آپ حضرت حفصہ کے یہاں گئے اور ان سے کہا کہ",
        "hadithText": "بیٹی اپنی اس سوکن کو دیکھ کر دھوکے میں نہ آ جانا جسے اپنے حسن پر اور رسول اللہ صلی اللہ علیہ وسلم کی محبت پر ناز ہے ۔ آپ کا اشارہ حضرت عائشہ رضی اللہ عنہا کی طرف تھا ( حضرت عمر رضی اللہ عنہ نے بیان کیا ) کہ پھر میں نے یہی بات آپ کے سامنے دہرائی ، آپ مسکرادیئے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 151,
        "matchingArabicURN": 144200,
        "last_updated": null
    },
    {
        "urduURN": 4051460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5219,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ہشام نے ، ان سے فاطمہ بنت منذر نے اور ان سے حضرت اسماء بنت ابی بکر رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے ( دوسری سند ) اور مجھ سے محمد بن مثنٰی نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے ہشام نے ، ان سے فاطمہ بنت منذر نے بیان کیا اور ان سے اسماء بنت ابوبکر صدیق رضی اللہ عنہما نے کہ",
        "hadithText": "ایک خاتون نے عرض کیا یا رسول اللہ ! میری سوکن ہے اگر اپنے شوہر کی طرف سے ان چیزوں کے حاصل ہونے کی بھی داستانیں اسے سناؤں جو حقیقت میں میرا شوہر مجھے نہیں دیتا تو کیا اس میں کوئی حرج ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ جو چیز حاصل نہ ہو اس پر فخر کرنے والا اس شخص جیسا ہے جو فریب کا جوڑا یعنی ( دوسروں کے کپڑے ) مانگ کر پہنے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 152,
        "matchingArabicURN": 144210,
        "last_updated": null
    },
    {
        "urduURN": 4051470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5220,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، ان سے اعمش نے بیان کیا ، ان سے شقیق نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ سے زیادہ غیرت مند اور کوئی نہیں ہے ۔ یہی وجہ ہے کہ اس نے بے حیائی کے کاموں کو حرام کیا ہے اور اللہ سے بڑھ کر کوئی اپنی تعریف پسند کرنے والا نہیں ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 153,
        "matchingArabicURN": 144220,
        "last_updated": null
    },
    {
        "urduURN": 4051480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5221,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، ان سے امام مالک نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد عروہ بن زبیر نے بیان کیا اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اے امت محمد ! اللہ سے بڑھ کر غیرت مند اور کوئی نہیں کہ وہ اپنے بندہ یا بندی کو زنا کرتے ہوئے دیکھے ۔ اے امت محمد ! اگر تمہیں وہ معلوم ہوتا جو مجھے معلوم ہے تو تم ہنستے کم اور روتے زیادہ ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 154,
        "matchingArabicURN": 144230,
        "last_updated": null
    },
    {
        "urduURN": 4051490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5222,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، ان سے یحییٰ بن ابی کثیر نے ، ان سے ابوسلمہ بن عبدالرحمٰن نے ، ان سے عروہ بن زبیر نے بیان کیا اور ان سے ان کی والدہ حضرت اسماء بنت ابی بکر رضی اللہ عنہما نے کہ",
        "hadithText": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم فرما رہے تھے کہ اللہ تعالیٰ سے زیادہ غیرت مند کوئی نہیں اور ( اسی سند سے ) یحییٰ سے روایت ہے کہ ان سے ابوسلمہ نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 155,
        "matchingArabicURN": 144240,
        "last_updated": null
    },
    {
        "urduURN": 4051500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5223,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے شیبان بن عبدالرحمٰن نحوی نے بیان کیا ، ان سے یحییٰ بن ابی کثیر نے ، ان سے ابوسلمہ نے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ کو غیرت آتی ہے اور اللہ تعالیٰ کو غیرت اس وقت آتی ہے جب بندہ مومن وہ کام کرے جسے اللہ نے حرام کیا ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 156,
        "matchingArabicURN": 144250,
        "last_updated": null
    },
    {
        "urduURN": 4051510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5224,
        "hadithSanad": "ہم سے محمود بن غیلان نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، کہا کہ مجھے میرے والد نے خبر دی اور ان سے اسماء بنت ابی بکر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "زبیر رضی اللہ عنہ نے مجھ سے شادی کی تو ان کے پاس ایک اونٹ اور ان کے گھوڑے کے سوا روئے زمین پر کوئی مال ، کوئی غلام ، کوئی چیز نہیں تھی ۔ میں ہی ان کا گھوڑا چراتی ، پانی پلاتی ، ان کا ڈول سیتی اور آٹا گوندھتی ۔ میں اچھی طرح روٹی نہیں پکا سکتی تھی ۔ انصار کی کچھ لڑکیاں میری روٹی پکا جاتی تھیں ۔ یہ بڑی سچی اور با وفا عورتیں تھیں ۔ زبیر رضی اللہ عنہ کی وہ زمین جو رسول اللہ صلی اللہ علیہ وسلم نے انہیں دی تھی ، اس سے میں اپنے سر پر کھجور کیگٹھلیاں گھر لایا کرتی تھی ۔ یہ زمین میرے گھر سے دو میل دور تھی ۔ ایک روز میں آ رہی تھی اور گٹھلیاں میرے سر پر تھیں کہ راستے میں رسول اللہ صلی اللہ علیہ وسلم سے ملاقات ہو گئی ۔ آنحضرت صلی اللہ علیہ وسلم کے ساتھ قبیلہ انصار کے کئی آدمی تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے مجھے بلایا ۔ پھر ( اپنے اونٹ کو بٹھانے کے لئے ) کہا ۔ اخ اخ ، آنحضرت صلی اللہ علیہ وسلم چاہتے تھے کہ مجھے اپنی سواری پر اپنے پیچھے سوار کر لیں لیکن مجھے مردوں کے ساتھ چلنے میں شرم آئی اور زبیر رضی اللہ عنہ کی غیرت کا بھی خیال آیا ۔ زبیر رضی اللہ عنہ بڑے ہی باغیرت تھے ۔ حضور اکرم صلی اللہ علیہ وسلم بھی سمجھ گئے کہ میں شرم محسوس کر رہی ہوں ۔ اس لئے آپ آگے بڑھ گئے ۔ پھر میں زبیر رضی اللہ عنہ کے پاس آئی اور ان سے واقعہ کا ذکر کیا کہ آنحضور صلی اللہ علیہ وسلم سے میری ملاقات ہو گئی تھی ۔ میرے سر پر گٹھلیاںتھیں اور آنحضور صلی اللہ علیہ وسلم کے ساتھ آپ کے چند صحابہ بھی تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے اپنا اونٹ مجھے بٹھا نے کے لئے بٹھایا لیکن مجھے اس سے شرم آئی اور تمہاری غیرت کا بھی خیال آیا ۔ اس پر زبیر نے کہا کہ اللہ کی قسم ! مجھ کو تو اس سے بڑا رنج ہوا کہ تو گٹھلیاں لانے کے لئے نکلے اگر تو آنحضرت صلی اللہ علیہ وسلم کے ساتھ سوار ہو جاتی تو اتنی غیرت کی بات نہ تھی ( کیونکہ اسماء رضی اللہ عنہا آپ کی سالی اور بھاوج دونوں ہوتی تھیں ) اس کے بعد میرے والد ابوبکر رضی اللہ عنہ نے ایک غلام میرے پاس بھیج دیا وہ گھوڑے کا سب کام کرنے لگا اور میں بے فکر ہو گئی گویا والد ماجد ابوبکر رضی اللہ عنہ نے ( غلام بھیج کر ) مجھ کو آزاد کر دیا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 157,
        "matchingArabicURN": 144260,
        "last_updated": null
    },
    {
        "urduURN": 4051520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5225,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے اسماعیل بن علیہ نے ، ان سے حمید نے ، ان سے حضرت انس نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم اپنی ایک زوجہ ( عائشہ رضی اللہ عنہا ) کے یہاں تشریف رکھتے تھے ۔ اس وقت ایک زوجہ ( زینب بنت جحش رضی اللہ عنہا ) نے آنحضرت صلی اللہ علیہ وسلم کے لئے ایک پیالے میں کچھ کھانے کی چیز بھیجی جن کے گھر میں حضور اکرم صلی اللہ علیہ وسلم اس وقت تشریف رکھتے تھے ۔ انہوں نے خادم کے ہاتھ پر ( غصہ میں ) مارا جس کی وجہ سے کٹورہ گر کر ٹوٹ گیا ۔ پھر حضور اکرم صلی اللہ علیہ وسلم نے کٹورا لے کر ٹکڑے جمع کئے اور جو کھانا اس برتن میں تھا اسے بھی جمع کرنے لگے اور ( خادم سے ) فرمایا کہ تمہاری ماں کو غیرت آ گئی ہے ۔ اس کے بعد خادم کو روکے رکھا ۔ آخر جن کے گھر میں وہ کٹورہ ٹوٹا تھا ان کی طرف سے نیا کٹورہ منگایا گیا اور آنحضرت صلی اللہ علیہ وسلم نے وہ نیا کٹورہ ان زوجہ مطہرہ کو واپس کیا جن کا کٹورہ توڑ دیا گیا تھا اور ٹوٹا ہوا کٹورہ ان کے یہا ں رکھ لیا جن کے گھر میں وہ ٹوٹا تھا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 158,
        "matchingArabicURN": 144270,
        "last_updated": null
    },
    {
        "urduURN": 4051530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5226,
        "hadithSanad": "ہم سے محمد بن ابی بکر مقدمی نے بیان کیا ، انہوں نے کہا ہم سے معتمر بن سلیمان نے بیان کیا ، انہوں نے کہا ہم سے عبیداللہ بن عمرعمری نے ، ان سے محمد بن منکدر نے اور ان سے حضرت جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میں جنت میں داخل ہوا یا ( آپ نے یہ فرمایا کہ ) میں جنت میں گیا ، وہاں میں نے ایک محل دیکھا میں نے پوچھا یہ محل کس کاہے ؟ فرشتوں نے بتایا کہ حضرت عمر بن خطاب رضی اللہ عنہ کا میں نے چاہا کہ اس کے اندر جاؤں لیکن رک گیا کیونکہ تمہاری غیرت مجھے معلوم تھی ۔ اس پر حضرت عمر رضی اللہ عنہ نے عرض کیا ۔ یا رسول اللہ ! میرے ماں باپ آپ پر فدا ہوں ، اے اللہ کے نبی ! کیا میں آپ پر غیرت کروں گا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 159,
        "matchingArabicURN": 144280,
        "last_updated": null
    },
    {
        "urduURN": 4051540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5227,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، انہیں یونس نے ، انہیں زہری نے ، کہا کہ مجھے سعید بن مسیب نے خبر دی ، اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس بیٹھے ہوئے تھے آنحضور صلی اللہ علیہ وسلم نے فرمایا خواب میں میں نے اپنے آپ کو جنت میں دیکھا ۔ وہا ں میں نے دیکھا کہ ایک محل کے کنارے ایک عورت وضو کر رہی تھی ۔ میں نے پوچھا کہ یہ محل کس کا ہے ؟ فرشتے نے کہا کہ عمر بن خطاب رضی اللہ عنہ کا ۔ میں ان کی غیرت کا خیال کر کے واپس چلا آیا ۔ حضرت عمر رضی اللہ عنہ نے جو اس وقت مجلس میں موجود تھے اس پر رودیئے اور عرض کیا یا رسول اللہ ! کیا میں آپ پر غیرت کروں گا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 160,
        "matchingArabicURN": 144290,
        "last_updated": null
    },
    {
        "urduURN": 4051550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5228,
        "hadithSanad": "ہم سے عبید بن اسما عیل نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا میں خوب پہچانتا ہوں کہ کب تم مجھ سے خوش ہوتی ہو اور کب تم مجھ پر ناراض ہو جاتی ہو ۔ بیان کیا کہ اس پر میں نے عرض کیا آنحضور صلی اللہ علیہ وسلم یہ بات کس طرح سمجھتے ہیں ؟ آپ نے فرمایا جب تم مجھ سے خوش ہوتی ہو تو کہتی ہو نہیں محمد ( صلی اللہ علیہ وسلم ) کے رب کی قسم ! اور جب تم مجھ سے ناراض ہوتی ہو تو کہتی ہو نہیں ابراہیم علیہ السلام کے رب کی قسم ! بیان کیا کہ میں نے عرض کیا ہاں اللہ کی قسم یا رسول اللہ ! ( غصے میں ) صرف آپ کا نام زبان سے نہیں لیتی ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 161,
        "matchingArabicURN": 144300,
        "last_updated": null
    },
    {
        "urduURN": 4051560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5229,
        "hadithSanad": "مجھ سے احمد بن ابی رجاء نے بیان کیا ، کہا ہم سے نضر بن شمیل نے بیان کیا ، ان سے ہشام بن عروہ نے ، کہا کہ مجھے میرے والد نے خبر دی ، ان سے حضرت عائشہ رضی اللہ عنہا نے ، آپ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے لئے کسی عورت پر مجھے اتنی غیرت نہیں آتی تھی جتنی ام المؤمنین حضرت خدیجہ رضی اللہ عنہا پر آتی تھی کیونکہ حضور اکرم صلی اللہ علیہ وسلم ان کا ذکر بکثرت کیا کرتے تھے اور ان کی تعریف کرتے تھے اور حضور اکرم صلی اللہ علیہ وسلم پر وحی کی گئی تھی کہ آپ حضرت خدیجہ رضی اللہ عنہاکو جنت میں ان کے موتی کے گھر کی بشارت دے دیں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 162,
        "matchingArabicURN": 144310,
        "last_updated": null
    },
    {
        "urduURN": 4051570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5230,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے ابن ابی ملیکہ نے اور ان سے مسور بن مخرمہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم ممبر پر فرما رہے تھے کہ ہشام بن مغیرہ جو ابوجہل کا باپ تھا اس کی اولاد ( حارث بن ہشام اورسلم بن ہشام ) نے اپنی بیٹی کا نکاح علی بن ابی طالب سے کرنے کی مجھ سے اجازت مانگی ہے لیکن میں انہیں ہرگز اجازت نہیں دوں گا یقیناً میں اس کی اجازت نہیں دوں گا ہرگز میں اس کی اجازت نہیں دوں گا ۔ البتہ اگر علی بن ابی طالب میری بیٹی کو طلاق دے کر ان کی بیٹی سے نکاح کرنا چاہیں ( تو میں اس میں رکاوٹ نہیں بنوں گا ) کیونکہ وہ ( فاطمہ رضی اللہ عنہا ) میرے جگر کا ایک ٹکڑا ہے جو اس کو برا لگے وہ مجھ کو بھی برا لگتا ہے اور جس چیز سے اسے تکلیف پہنچتی ہے اس سے مجھے بھی تکلیف پہنچتی ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 163,
        "matchingArabicURN": 144320,
        "last_updated": null
    },
    {
        "urduURN": 4051580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5231,
        "hadithSanad": "ہم سے حفص بن عمر حوضی نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں تم سے وہ حدیث بیان کروں گا جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنی ہے ، میرے سوا یہ حدیث تم سے کوئی اور نہیں بیان کرنے والا ہے ۔ میں نے حضور اکرم صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے کہ قیامت کی نشانیوں میں سے یہ بھی ہے کہ قرآن و حدیث کا علم اٹھا لیا جائے گا اور جہالت بڑھ جائے گی ۔ زنا کی کثرت ہو جائے گی اور شراب لوگ زیادہ پینے لگیں گے ۔ مرد کم ہو جائیں گے اور عورتوں کی تعداد زیادہ ہو جائے گی ۔ حالت یہ ہو جائے گی کہ پچاس پچاس عورتوں کا سنبھالنے والا ( خبر گیر ) ایک مرد ہو گا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 164,
        "matchingArabicURN": 144330,
        "last_updated": null
    },
    {
        "urduURN": 4051590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5232,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے یزید بن ابی حبیب نے ، ان سے ابو الخیر نے اور ان سے عقبہ بن عامر نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا عورتوں میں جانے سے بچتے رہو اس پر قبیلہ انصار کے ایک صحابی نے عرض کیا یا رسول اللہ ! دیور کے متعلق آپ کی کیا رائے ہے ؟ ( وہ اپنی بھاوج کے ساتھ جا سکتا ہے یا نہیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ دیور یا ( جیٹھ ) کا جانا ہی تو ہلاکت ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 165,
        "matchingArabicURN": 144340,
        "last_updated": null
    },
    {
        "urduURN": 4051600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5233,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے بیان کیا ، ان سے ابو معبد نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا محرم کے سوا کوئی مرد کسی عورت کے ساتھ تنہائی میں نہ بیٹھے ۔ اس پر ایک صحابی نے عرض کیا یا رسول اللہ ! میری بیوی حج کرنے گئی ہے اور میرا نام فلاں غزوہ میں لکھا گیا ہے ۔ آنحضور صلی اللہ علیہ وسلم نے فرمایا پھر تو واپس جا اور اپنی بیوی کے ساتھ حج کر ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 166,
        "matchingArabicURN": 144350,
        "last_updated": null
    },
    {
        "urduURN": 4051610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5234,
        "hadithSanad": "ہم سے محمد بن بشار نے حدیث بیان کی ، ان سے غندر نے حدیث بیان کی ، ان سے شعبہ نے حدیث بیان کی ، ان سے ہشام نے بیان کیا ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "قبیلہ انصار کی ایک خاتون نبی کریم صلی اللہ علیہ وسلم کے پاس آئیں اور آنحضور صلی اللہ علیہ وسلم نے اس سے لوگوں سے ایک طرف ہو کر تنہائی میں گفتگو کی ۔ اس کے بعد آنحضور صلی اللہ علیہ وسلم نے فرمایا کہ تم لوگ ( یعنی انصار ) مجھے سب لوگوں سے زیادہ عزیز ہو ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 167,
        "matchingArabicURN": 144360,
        "last_updated": null
    },
    {
        "urduURN": 4051620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5235,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے عبدہ بن سلیمان نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے ، ان سے زینب بنت ام سلمہ رضی اللہ عنہا نے اور ان سے ام المؤمنین حضرت ام سلمہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ان کے یہاں تشریف رکھتے تھے ، گھر میں ایک مغیث نامی مخنث بھی تھا ۔ اس مخنث ( ہیجڑے ) نے حضرت ام سلمہ کے بھائی عبداللہ بن ابی امیہ رضی اللہ عنہ سے کہا کہ اگر کل اللہ نے تمہیں طائف پر فتح عنایت فرمائی تو میں تمہیں غیلان کی بیٹی کو دکھلاؤں گا کیونکہ وہ سامنے آتی ہے تو ( مٹاپے کی وجہ سے ) اس کے چار شکنیں پڑجاتی ہیں اور جب پیچھے پھرتی ہے تو آٹھ ہو جاتی ہیں ۔ اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے ( ام سلمہ سے ) فرمایا کہ یہ ( مخنث ) تمہارے پاس اب نہ آیا کرے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 168,
        "matchingArabicURN": 144370,
        "last_updated": null
    },
    {
        "urduURN": 4051630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5236,
        "hadithSanad": "ہم سے اسحاق بن ابراہیم حنظلی نے بیان کیا ، ان سے عیسیٰ بن یونس نے بیان کیا ، ان سے اوزاعی نے ، ان سے زہری نے ، ان سے عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میں نے دیکھا کہ نبی کریم صلی اللہ علیہ وسلم میرے لئے اپنی چادر سے پردہ کئے ہوئے ہیں ۔ میں حبشہ کے ان لوگوں کو دیکھ رہی تھی جو مسجد میں ( جنگی ) کھیل کا مظا ہرہ کر رہے تھے ، آخر میں ہی اکتا گئی ۔ اب تم سمجھ لو ایک کم عمر لڑکی جس کو کھیل تماشہ دیکھنے کا بڑا شوق ہے کتنی دیر تک دیکھتی رہی ہو گی ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 169,
        "matchingArabicURN": 144380,
        "last_updated": null
    },
    {
        "urduURN": 4051640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5237,
        "hadithSanad": "ہم سے فروہ بن ابی المغراء نے بیان کیا ، کہا ہم سے علی بن مسہر نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "ام المؤمنین حضرت سودہ بنت زمعہ رات کے وقت باہر نکلیں تو حضرت عمر نے انہیں دیکھ لیا اور پہچان گئے ۔ پھر کہا اے سودہ ! اللہ کی قسم ! تم ہم سے چھپ نہیں سکتیں ۔ جب حضرت سودہ واپس نبی کریم صلی اللہ علیہ وسلم کے پاس آئیں تو آنحضرت صلی اللہ علیہ وسلم سے اس کا ذکر کیا ۔ آنحضرت صلی اللہ علیہ وسلم اس وقت میرے حجرے میں شام کا کھانا کھا رہے تھے ۔ آپ کے ہاتھ میں گوشت کی ایک ہڈی تھی ۔ اس وقت آپ پر وحی نازل ہونی شروع ہوئی اور جب نزول وحی کا سلسلہ ختم ہو اتو آپ نے فرمایا کہ تمہیں اجازت دی گئی ہے کہ تم اپنی ضروریات کے لئے باہر نکل سکتی ہو ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 170,
        "matchingArabicURN": 144390,
        "last_updated": null
    },
    {
        "urduURN": 4051650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5238,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، کہا ہم سے زہری نے ، ان سے سالم نے اور ان سے ان کے والد ( حضرت عبداللہ بن عمر رضی اللہ عنہما ) نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے کہ",
        "hadithText": "جب تم میں سے کسی کی بیوی مسجد میں ( نماز پڑھنے کے لئے ) جانے کی اجازت مانگے تو اسے نہ روکو بلکہ اجازت دے دو ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 171,
        "matchingArabicURN": 144400,
        "last_updated": null
    },
    {
        "urduURN": 4051660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5239,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا ، کہا ہم کو امام مالک رحمہ اللہ نے خبر دی ، انہیں ہشام بن عروہ نے ، انہیں ان کے والد عروہ بن زبیر نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میرے دودھ ( رضاعی ) چچا ( افلح ) آئے اور میرے پاس اندر آنے کی اجازت چاہی لیکن میں نے کہا کہ جب تک میں رسول اللہ صلی اللہ علیہ وسلم سے پوچھ نہ لوں ، اجازت نہیں دے سکتی ۔ پھر آپ تشریف لائے تو میں نے آپ سے اس کے متعلق پوچھا ۔ آپ نے فرمایا کہ وہ تمہارے رضاعی چچا ہیں ، انہیں اندر بلا لو ۔ میں نے اس پر کہا کہ یا رسول اللہ ! عورت نے مجھے دودھ پلایا تھا کوئی مرد نے تھوڑا ہی پلایا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ۔ ہیں تو وہ تمہارے چچا ہی ( رضاعی ) اس لئے وہ تمہارے پاس آ سکتے ہیں ، یہ واقعہ ہمارے لئے پردہ کا حکم نازل ہونے کے بعد کا ہے ۔ حضرت عائشہ رضی اللہ عنہا نے کہا کہ خون سے جو چیزیں حرام ہوتی ہیں رضاعت سے بھی وہ حرام ہو جاتی ہیں ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 172,
        "matchingArabicURN": 144410,
        "last_updated": null
    },
    {
        "urduURN": 4051670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5240,
        "hadithSanad": "ہم سے محمد بن یوسف فریابی نے بیان کیا ، کہا ہم سے سفیان ثوری رحمہ اللہ نے بیان کیا ، ان سے منصور بن معتمر نے ، ان سے ابووائل نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کوئی عورت کسی عورت سے ملنے کے بعد اپنے شوہر سے اس کا حلیہ نہ بیان کرے ، گویا کہ وہ اسے دیکھ رہا ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 173,
        "matchingArabicURN": 144420,
        "last_updated": null
    },
    {
        "urduURN": 4051680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5241,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، ان سے اعمش نے بیان کیا ، کہا کہ مجھ سے شقیق نے بیان کیا ، کہا میں نے حضرت عبداللہ بن مسعود رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ کوئی عورت کسی عورت سے مل کر اپنے شوہر سے اس کے حلیہ نہ بیان کرے گویا کہ وہ اسے دیکھ رہا ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 174,
        "matchingArabicURN": 144430,
        "last_updated": null
    },
    {
        "urduURN": 4051690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5242,
        "hadithSanad": "مجھ سے محمود بن غیلان نے بیان کیا ، کہا ہم سے عبدالرزاق نے ، کہا ہم کو معمر نے خبر دی ، انہیں عبداللہ بن طاؤس نے ، انہیں ان کے والد نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "سلیمان بن داؤد علیہاالسلام نے فرمایا کہ آج رات میں اپنی سو بیویوں کے پاس ہو آؤں گا ( اور اس قربت کے نتیجہ میں ) ہر عورت ایک لڑکا جنے گی تو سو لڑکے ایسے پیدا ہوں گے جو اللہ کے راستے میں جہاد کریں گے ۔ فرشتہ نے ان سے کہا کہ انشاءاللہ کہہ لیجئے لیکن انہوں نے نہیں کہا اور بھول گئے ۔ چنانچہ آپ تمام بیویوں کے پاس گئے لیکن ایک کے سوا کسی کے بھی بچہ پیدا نہ ہوا اور اس ایک کے یہاں بھی آدھا بچہ پیدا ہوا ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر انشاءاللہ کہہ لیتے تو ان کی مراد بر آتی اور ان کی خواہش پوری ہونے کی امید زیادہ ہوتی ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 175,
        "matchingArabicURN": 144440,
        "last_updated": null
    },
    {
        "urduURN": 4051700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5243,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے محارب بن دثار نے بیان کیا ، کہا کہ میں نے حضرت جابر بن عبداللہ رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کسی شخص سے رات کے وقت اپنے گھر ( سفر سے اچانک ) آنے پر ناپسندیدگی کا اظہار فرماتے تھے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 176,
        "matchingArabicURN": 144450,
        "last_updated": null
    },
    {
        "urduURN": 4051710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5244,
        "hadithSanad": "ہم سے محمد بن مقاتل مروزی نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو عاصم بن سلیمان نے خبر دی ، انہیں عامر شعبی نے اور ان سے حضرت جابر بن عبداللہ انصاری رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اگر تم میں سے کوئی شخص زیادہ دنوں تک اپنے گھر سے دور ہو تو یکا یک رات کو اپنے گھر میں نہ آ جائے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 177,
        "matchingArabicURN": 144460,
        "last_updated": null
    },
    {
        "urduURN": 4051720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5245,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، ان سے ہشیم بن بشیر نے ، ان سے سیار بن دروان نے ، ان سے عامر شعبی نے اور ان سے حضرت جابر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک جہاد ( تبوک ) میں تھا ، جب ہم واپس ہو رہے تھے تو میں اپنے سست رفتار اونٹ کو تیز چلانے کی کوشش کر رہا تھا ۔ اتنے میں میرے پیچھے سے ایک سوار میرے قریب آئے ۔ میں نے مڑ کر دیکھا تو رسول اللہ صلی اللہ علیہ وسلم تھے ۔ آپ نے فرمایا جلدی کیوں کر رہے ہو ؟ میں نے عرض کیا کہ میری شادی ابھی نئی ہوئی ہے ۔ آپ نے دریافت فرمایا ، کنواری عورت سے تم نے شادی کی یا بیوہ سے ؟ میں نے عرض کیا کہ بیوہ سے ۔ آپ نے اس پر فرمایا ، کنواری سے کیوں نہ کی ؟ تم اس کے ساتھ کھیلتے اور وہ تمہارے سا تھ کھیلتی ۔ جابر نے بیان کیا کہ پھر جب ہم مدینہ پہنچے تو ہم نے چاہا کہ شہر میں داخل ہو جائیں لیکن آپ نے فرمایا : ٹھہر جاؤ ۔ رات ہو جائے پھر داخل ہونا تاکہ تمہاری بیویاں جو پراگندہ بال ہیں وہ کنگھی چوٹی کر لیں اور جن کے خاوند غائب تھے وہ موئے زیر ناف صاف کر لیں ۔ ہشیم نے بیان کیا کہ مجھ سے ایک معتبر راوی نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے یہ بھی فرمایا کہ الکیس الکیس یعنی اے جابر ! جب تو گھر پہنچے تو خوب خوب کیس کیجؤ ( امام بخاری نے کہا ) کیس کا مطلب ہے کہ اولاد ہونے کی خواہش کیجؤ ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 178,
        "matchingArabicURN": 144470,
        "last_updated": null
    },
    {
        "urduURN": 4051730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5246,
        "hadithSanad": "ہم سے محمد بن ولید نے بیان کیا ، کہا ہم سے محمد بن جعفر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے سیار نے ، ان سے شعبی نے اور ان سے حضرت جابر بن عبداللہ رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ( غزوہ تبوک سے واپسی کے وقت ) فرمایا ، جب رات کے وقت تم مدینہ میں پہنچو تو اس وقت تک اپنے گھروں میں نہ جانا جب تک ان کی بیویاں جو مدینہ منورہ میں موجود نہیں تھے ، اپنا موئے زیر ناف صاف نہ کر لیں اورجن کے بال پراگندہ ہوں وہ کنگھا نہ کر لیں ۔ جابر رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، پھر ضروری ہے کہ جب تم گھر پہنچو تو خوب خوب کیس کیجےو ۔ شعبی کے ساتھ اس حدیث کو عبیداللہ نے بھی وہب بن کیسان سے ، انہوں نے جابر رضی اللہ عنہ سے ، انہوں نے آنحضرت صلی اللہ علیہ وسلم سے روایت کیا ، اس میں بھی کیس کا ذکر ہے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 179,
        "matchingArabicURN": 144480,
        "last_updated": null
    },
    {
        "urduURN": 4051740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5247,
        "hadithSanad": "مجھ سے یعقوب بن ابراہیم نے بیان کیا ، کہا ہم سے ہشیم نے بیان کیا ، کہا ہم کو سیار نے خبر دی ، انہیں شعبی نے ، انہیں حضرت جابر بن عبداللہ رضی اللہ عنہما نے ، انہوں نے بیان کیا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک غزوہ ( تبوک ) میں تھے ۔ واپس ہوتے ہوئے جب ہم مدینہ منورہ کے قریب پہنچے تو میں نے اپنے سست رفتار اونٹ کو تیز چلانے لگا ۔ ایک صاحب نے پیچھے سے میرے قریب پہنچ کر میرے اونٹ کو ایک چھڑی سے جو ان کے پاس تھی ، مارا ۔ اس سے اونٹ بڑی اچھی چال چلنے لگا ، جیسا کہ تم نے اچھے اونٹوں کو چلتے ہوئے دیکھا ہو گا ۔ میں نے مڑ کر دیکھا تو رسول اللہ صلی اللہ علیہ وسلم تھے ۔ میں نے عرض کیا یا رسول اللہ ! میری شادی نئی ہوئی ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر پوچھا ، کیا تم نے شادی کر لی ؟ میں نے عرض کیا کہ جی ہاں ۔ دریافت فرمایا ، کنواری سے کی ہے یا بیوہ سے ؟ بیان کیا کہ میں نے عرض کیا کہ بیوہ سے کی ہے آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، کنواری سے کیوں نہ کی ؟ تم اس کے ساتھ کھیلتے اور وہ تمہارے ساتھ کھیلتی ۔ بیان کیا کہ پھر جب ہم مدینہ پہنچے تو شہر میں داخل ہونے لگے لیکن آپ نے فرمایا کہ ٹھہر جاؤ رات ہو جائے پھر داخل ہونا تاکہ پراگندہ بال عورت چوٹی کنگھا کر لے اور جس کا شوہر موجود نہ رہا ہو ، وہ موئے زیر ناف صاف کر لے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 180,
        "matchingArabicURN": 144490,
        "last_updated": null
    },
    {
        "urduURN": 4051750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5248,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے عیینہ نے بیان کیا ، ان سے ابوحازم سلمہ بن دینار نے بیان کیا کہ",
        "hadithText": "اس واقعہ میں لوگوں میں اختلاف تھا کہ احد کی جنگ کے موقع پر رسول اللہ صلی اللہ علیہ وسلم کے لیے کو ن سی دو ا استعمال کی گئی تھی ۔ پھر لوگوں نے حضرت سہل بن سعد ساعدی رضی اللہ عنہ سے سوال کیا ، وہ اس وقت آخری صحابی تھے جو مدینہ منورہ میں موجود تھے ۔ انہوں نے بتلایا کہ اب کوئی شخص ایسا زندہ نہیں جو اس واقعہ کو مجھ سے زیادہ جا نتا ہو ۔ فاطمہ رضی اللہ عنہا حضور اکرم صلی اللہ علیہ وسلم کے چہرہ مبارک سے خون دھورہی تھیں اور حضرت علی رضی اللہ عنہ اپنے ڈھال میں پانی بھر کر لار ہے تھے ۔ ( جب بند نہ ہوا تو ) ایک بوریا جلا کر آپ کے زخم میں بھر دیا گیا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 181,
        "matchingArabicURN": 144500,
        "last_updated": null
    },
    {
        "urduURN": 4051760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5249,
        "hadithSanad": "ہم سے احمد بن محمد نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو سفیان ثوری نے خبر دی ، ان سے عبدالرحمٰن بن عابس نے ، کہا میں نے حضرت ابن عباس رضی اللہ عنہما سے سنا ، ان سے ایک شخص نے یہ سوال کیا تھا کہ",
        "hadithText": "تم بقرعید یا عید کے موقع پر رسول اللہ صلی اللہ علیہ وسلم کے ساتھ موجود تھے ؟ انہوں نے کہا کہ ہاں ۔ اگر میں حضور اکرم صلی اللہ علیہ وسلم کا رشتہ دار نہ ہوتا تو میں اپنی کم سنی کی وجہ سے ایسے موقع پر حاضر نہیں ہو سکتا تھا ۔ ان کا اشارہ ( اس زمانے میں ) اپنے بچپن کی طرف تھا ۔ انہوں نے بیان کیا کہ حضور اکرم صلی اللہ علیہ وسلم باہر تشریف لے گئے اور ( لوگوں کے ساتھ عید کی ) نماز پڑھی اور اس کے بعد خطبہ دیا ۔ ابن عباس رضی اللہ عنہما نے اذان اور اقامت کا ذکر نہیں کیا ، پھر آپ عورتوں کے پاس آئے اور انہیں وعظ و نصیحت کی اور انہیں خیرات دینے کا حکم دیا ۔ میں نے انہیں دیکھا کہ پھر وہ اپنے کانوں اور گلے کی طرف ہاتھ بڑھا بڑھا کر ( اپنے زیورات ) حضرت بلال رضی اللہ عنہ کو دینے لگیں ۔ اس کے بعد حضرت بلال رضی اللہ عنہ کے ساتھ حضور اکرم صلی اللہ علیہ وسلم واپس تشریف لائے ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 182,
        "matchingArabicURN": 144510,
        "last_updated": null
    },
    {
        "urduURN": 4051770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 66,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5250,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں عبدالرحمٰن بن قاسم نے ، انہیں ان کے والد قاسم بن محمد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "( ان کے والد ) حضرت ابوبکر رضی اللہ عنہ ان پر غصہ ہوئے اور میری کوکھ میں ہاتھ سے کچوکے لگانے لگے لیکن میں حرکت اس وجہ سے نہ کر سکی کہ رسول اللہ صلی اللہ علیہ وسلم کا سرمبارک میری ران پر رکھا ہوا تھا ۔</b>",
        "bookID": "67.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 183,
        "matchingArabicURN": 144520,
        "last_updated": null
    }
]