[
    {
        "urduURN": 4051780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5251,
        "hadithSanad": "ہم سے اسماعیل بن عبداللہ اویسی نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے نافع نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "انہوں نے اپنی بیوی ( آمنہ بنت غفار ) کو رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں ( حالت حیض میں ) طلاق دے دی ۔ حضرت عمر بن خطاب رضی اللہ عنہ نے آنحضرت صلی اللہ علیہ وسلم سے اس کے متعلق پوچھا تو آپ نے فرمایا کہ عبداللہ بن عمر رضی اللہ عنہما سے کہو کہ اپنی بیوی سے رجوع کر لیں اور پھر اپنے نکاح میں باقی رکھیں ۔ جب ماہواری ( حیض ) بند ہو جائے ، پھر ماہواری آئے اور پھر بند ہو ، تب اگر چاہیں تو اپنی بیوی کو اپنی نکاح میں باقی رکھیں اور اگر چاہیں تو طلاق دے دیں ( لیکن طلاق اس طہر میں ) ان کے ساتھ ہمبستری سے پہلے ہونا چاہئے ۔ یہی ( طہر کی ) وہ مدت ہے جس میں اللہ تعالیٰ نے عورتوں کو طلاق دینے کا حکم دیا ہے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 144530,
        "last_updated": null
    },
    {
        "urduURN": 4051790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5252,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے ، ان سے انس بن سیرین نے ، کہا کہ میں نے ابن عمر رضی اللہ عنہما سے سنا ، انہوں نے کہاکہ",
        "hadithText": "ابن عمر رضی اللہ عنہما نے اپنی بیوی کو حالت حیض میں طلاق دے دی ۔ پھر عمر رضی اللہ عنہ نے اس کا ذکر نبی کریم صلی اللہ علیہ وسلم سے کیا ، آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ چاہیے کہ رجوع کر لیں ۔ ( انس نے بیان کیا کہ ) میں نے ابن عمر رضی اللہ عنہما سے پوچھا کہ کیا یہ طلاق ، طلاق سمجھی جائے گی ؟ انہوں نے کہا کہ چپ رہ ۔ پھر کیا سمجھی جائے گی ؟ اور قتادہ نے بیان کیا ، ان سے یونس بن جبیر نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا ( کہ آنحضرت صلی اللہ علیہ وسلم نے ابن عمر رضی اللہ عنہما سے ) فرمایا ، اسے حکم دوکہ رجوع کر لے ( یونس بن جبیر نے بیان کیا کہ ) میں نے پوچھا ، کیا یہ طلاق طلاق سمجھی جائے گی ؟ ابن عمر رضی اللہ عنہما نے کہا تو کیا سمجھتا ہے اگر کوئی کسی فرض کے ادا کرنے سے عاجز بن جائے یا احمق ہو جائے ۔ تو وہ فرض اس کے ذمہ سے ساقط ہو جائے گا ؟ ہرگز نہیں</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 144540,
        "last_updated": null
    },
    {
        "urduURN": 4051800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5253,
        "hadithSanad": "حضرت امام بخاری رحمہ اللہ نے کہا اور ابو معمر عبداللہ بن عمرو منقری نے کہا ( یا ہم سے بیان کیا ) کہا ہم سے عبدالوارث بن سعید نے ، کہا ہم سے ایوب سختیانی نے ، انہوں نے سعید بن جبیر سے ، انہوں نے ابن عمر رضی اللہ عنہما سے ، انہوں نے کہا",
        "hadithText": "یہ طلاق جو میں نے حیض میں دی تھی مجھ پر شمار کی گئی ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 144550,
        "last_updated": null
    },
    {
        "urduURN": 4051810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5254,
        "hadithSanad": "ہم سے عبداللہ بن زبیر حمیدی نے بیان کیا ، کہا ہم سے ولید بن مسلم نے بیان کیا ، کہا ہم سے امام اوزاعی نے بیان کیا ، کہا کہ میں نے زہری سے پوچھا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کی کن بیوی نے آنحضرت صلی اللہ علیہ وسلم سے پناہ مانگی تھی ؟ انہوں نے بیان کیا کہ مجھے عروہ بن زبیر نے خبر دی اور انہیں حضرت عائشہ رضی اللہ عنہا نے کہ جون کی بیٹی ( امیمہ یا اسماء ) جب حضور اکرم صلی اللہ علیہ وسلم کے یہاں ( نکاح کے بعد ) لائی گئیں اور آنحضرت صلی اللہ علیہ وسلم ان کے پاس گئے تو اس نے یہ کہہ دیا کہ میں تم سے اللہ کی پناہ مانگتی ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ تم نے بہت بڑی چیز سے پناہ مانگی ہے ، اپنے میکے چلی جاؤ ۔ ابوعبداللہ حضرت امام بخاری رحمہ اللہ نے اس حدیث کو حجاج بن یوسف بن ابی منیع سے ، اس نے بھی اپنے دادا ابو منیع ( عبیداللہ بن ابی زیاد ) سے ، انہوں نے زہری سے ، انہوں نے عروہ سے ، انہوں نے عائشہ رضی اللہ عنہا سے روایت کیا ہے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 144560,
        "last_updated": null
    },
    {
        "urduURN": 4051820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5255,
        "hadithSanad": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، انہوں نے کہا ہم سے عبدالرحمٰن بن غسیل نے بیان کیا ، ان سے حمزہ بن ابی اسید نے اور ان سے ابواسید رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے ساتھ باہر نکلے اور ایک باغ میں پہنچے جس کا نام ” شوط “ تھا ۔ جب وہاں جا کر اور باغوں کے درمیان پہنچے تو بیٹھ گئے ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم لوگ یہیں بیٹھو ، پھر باغ میں گئے ، جو نیہ لائی جا چکی تھیں اور انہیں کھجور کے ایک گھر میں اتارا ۔ اس کا نام امیمہ بنت نعمان بن شراحیل تھا ۔ ان کے ساتھ ایک دایہ بھی ان کی دیکھ بھال کے لیے تھی ۔ جب حضور اکرم صلی اللہ علیہ وسلم ان کے پاس گئے تو فرمایا کہ اپنے آپ کو میرے حوالے کر دے ۔ اس نے کہا کیا کوئی شہزادی کسی عام آدمی کے لیے اپنے آپ کو حوالہ کر سکتی ہے ؟ بیان کیا کہ اس پر حضور صلی اللہ علیہ وسلم نے اپنا شفقت کا ہاتھ ان کی طرف بڑھا کر اس کے سر پر رکھا تو اس نے کہا کہ میں تم سے اللہ کی پناہ مانگتی ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، تم نے اسی سے پناہ مانگی جس سے پناہ مانگی جاتی ہے ۔ اس کے بعد آنحضرت صلی اللہ علیہ وسلم باہر ہمارے پاس تشریف لائے اور فرمایا ، ابواسید ! اسے دو رازقیہ کپڑے پہنا کر اسے اس کے گھر پہنچا آؤ ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 144570,
        "last_updated": null
    },
    {
        "urduURN": 4051830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "اور حسین بن الولید نیساپوری نے بیان کیا کہ ان سے عبدالرحمٰن نے ، ان سے عباس بن سہل نے ، ان سے ان کے والد ( سہل بن سعد ) اور ابواسید رضی اللہ عنہ نے کہا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے امیمہ بنت شراحیل سے نکاح کیا تھا ، پھر جب وہ آنحضرت صلی اللہ علیہ وسلم کے یہاں لائی گئیں ، آنحضرت صلی اللہ علیہ وسلم نے ان کی طرف ہاتھ بڑھایا جسے اس نے ناپسند کیا ۔ اس لئے آنحضرت صلی اللہ علیہ وسلم ابواسید رضی اللہ عنہ سے فرمایا کہ ان کا سامان کر دیں اور رازقیہ کے دو کپڑے انہیں پہننے کے لیے دے دیں ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 144580,
        "last_updated": null
    },
    {
        "urduURN": 4051840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5258,
        "hadithSanad": "ہم سے حجاج بن منہال نے بیان کیا ، کہا ہم سے ہمام بن یحییٰ نے ، ان سے قتادہ نے ، ان سے ابو غالب یونس بن جبیر نے کہ",
        "hadithText": "میں نے ابن عمر رضی اللہ عنہما سے عرض کیا ، ایک شخص نے اپنی بیوی کو اس وقت طلاق دی جب وہ حائضہ تھی ( اس کا کیا حکم ؟ ) اس پر انہوں نے کہا تم ابن عمر رضی اللہ عنہما کو جانتے ہو ؟ ابن عمر رضی اللہ عنہما نے اپنی بیوی کو اس وقت طلاق دی تھی جب وہ حائضہ تھیں ، پھر عمر رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے ، اس کے متعلق آپ سے پوچھا ۔ آنحضور صلی اللہ علیہ وسلم نے انہیں حکم دیا کہ ( ابن عمر رضی اللہ عنہما اس وقت اپنی بیوی سے ) رجعت کر لیں ، پھر جب وہ حیض سے پاک ہو جائیں تو اس وقت اگر ابن عمر رضی اللہ عنہما چاہیں ، انہیں طلاق دیں ۔ میں نے عرض کیا ، کیا اسے بھی آنحضرت صلی اللہ علیہ وسلم نے طلاق شمار کیا تھا ؟ ابن عمر رضی اللہ عنہما نے کہا اگر کوئی عاجز ہے اور حماقت کا ثبوت دے تو اس کا علاج ہے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 144600,
        "last_updated": null
    },
    {
        "urduURN": 4051850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5259,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں ابن شہاب نے اور انہیں سہل بن سعد سا عدی رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "عویمر العجانی رضی اللہ عنہ عاصم بن عدی انصاری رضی اللہ عنہ کے پاس آئے اور ان سے کہا کہ اے عاصم ! تمہارا کیا خیال ہے ، اگر کوئی اپنی بیوی کے ساتھ کسی غیر کو دیکھے تو کیا اسے وہ قتل کر سکتا ہے ؟ لیکن پھر تم قصاص میں اسے ( شوہر کو ) بھی قتل کردوگے یا پھر وہ کیا کرے گا ؟ عاصم میرے لیے یہ مسئلہ آپ رسول اللہ صلی اللہ علیہ وسلم سے پوچھ دیجئیے ۔ عاصم رضی اللہ عنہ نے جب حضور اکرم صلی اللہ علیہ وسلم سے یہ مسئلہ پوچھا تو آنحضرت صلی اللہ علیہ وسلم نے اس سوالات کو ناپسند فرمایا اور اس سلسلے میں حضور اکرم صلی اللہ علیہ وسلم کے کلمات عاصم رضی اللہ عنہ پر گراں گزرے اور جب وہ واپس اپنے گھر آ گئے تو عویمر رضی اللہ عنہ نے آ کر ان سے پوچھا کہ بتائیے آپ سے حضور اکرم صلی اللہ علیہ وسلم نے کیا فرمایا ؟ عاصم نے اس پر کہا تم نے مجھ کو آفت میں ڈالا ۔ جو سوال تم نے پوچھا تھا وہ آنحضرت صلی اللہ علیہ وسلم کو ناگوار گزرا ۔ عویمر نے کہا کہ اللہ کی قسم یہ مسئلہ آنحضور صلی اللہ علیہ وسلم سے پوچھے بغیر میں باز نہیں آؤں گا ۔ چنانچہ وہ روانہ ہوئے اور حضور اکرم صلی اللہ علیہ وسلم کی خدمت میں پہنچے ۔ آنحضرت صلی اللہ علیہ وسلم لوگوں کے درمیان میں تشریف رکھتے تھے ۔ عویمر رضی اللہ عنہ نے عرض کیا یا رسول اللہ ! اگر کوئی شخص اپنی بیوی کے ساتھ کسی غیر کو پا لیتا ہے تو آپ کا کیا خیال ہے ؟ کیا وہ اسے قتل کر دے ؟ لیکن اس صورت میں آپ اسے قتل کر دیں گے یا پھر اسے کیا کرنا چاہیے ؟ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ نے تمہاری بیوی کے بارے میں وحی نازل کی ہے ، اس لیے تم جاؤ اور اپنی بیوی کو بھی ساتھ لاؤ ۔ سہل نے بیان کیا کہ پھر دونوں ( میاں بیوی ) نے لعان کیا ۔ لوگوں کے ساتھ میں بھی رسول اللہ صلی اللہ علیہ وسلم کے ساتھ اس وقت موجود تھا ۔ لعان سے جب دونوں فارغ ہوئے تو حضرت عویمر رضی اللہ عنہ نے عرض کیا یا رسول اللہ ! اگر اس کے بعد بھی میں اسے اپنے پاس رکھوں تو ( اس کا مطلب یہ ہو گا کہ ) میں جھوٹا ہوں ۔ چنانچہ انہوں نے حضور اکرم صلی اللہ علیہ وسلم کے حکم سے پہلے ہی اپنی بیوی کو تین طلاق دی ۔ ابن شہاب نے بیان کیا کہ پھر لعان کرنے والے کے لیے یہی طریقہ جاری ہو گیا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 144610,
        "last_updated": null
    },
    {
        "urduURN": 4051860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5260,
        "hadithSanad": "ہم سے سعید بن عفیر نے بیان کیا ، کہا کہ مجھ سے لیث بن سعد نے بیان کیا ، کہا کہ مجھ سے عقیل نے بیان کیا ، ان سے ابن شہاب نے ، کہا کہ",
        "hadithText": "مجھے عروہ بن زبیر نے خبر دی اور انہیں حضرت عائشہ رضی اللہ عنہا نے خبر دی کہ رفاعہ قرظی رضی اللہ عنہ کی بیوی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور عرض کیا یا رسول اللہ ! رفاعہ نے مجھے طلاق دے دی تھی اور طلاق بھی بائن ، پھر میں نے اس کے بعد عبدالرحمٰن بن زبیر قرظی رضی اللہ عنہ سے نکاح کر لیا لیکن ان کے پاس تو کپڑے کے پلو جیسا ہے ( یعنی وہ نامرد ہیں ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، غالباً تم رفاعہ کے پاس دوبارہ جانا چاہتی ہو لیکن ایسا اس وقت تک نہیں ہو سکتا جب تک تم اپنے موجودہ شوہر کا مزا نہ چکھ لو اور وہ تمہارا مزہ نہ چکھ لے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 144620,
        "last_updated": null
    },
    {
        "urduURN": 4051870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5261,
        "hadithSanad": "مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے عبیداللہ بن عمر عمری نے ، کہا کہ مجھ سے قاسم بن محمد نے بیان کیا اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "ایک صاحب نے اپنی بیوی کو تین طلاق دے دی تھی ۔ ان کی بیوی نے دوسری شادی کر لی ، پھر دوسرے شوہر نے بھی ( ہمبستری سے پہلے ) انہیں طلاق دے دی ۔ رسول اللہ صلی اللہ علیہ وسلم سے سوال کیا گیا کہ کیا پہلا شوہر اب ان کے لئے حلال ہے ( کہ ان سے دوبارہ شادی کر لیں ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ، یہاں تک کہ وہ یعنی شوہر ثانی اس کا مزہ چکھے جیسا کہ پہلے نے مزہ چکھا تھا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 144630,
        "last_updated": null
    },
    {
        "urduURN": 4051880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5262,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا ہم سے مسلم بن صبیح نے بیان کیا ، ان سے مسروق نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ نے ہمیں اختیار دیا تھا اور ہم نے اللہ اور اس کے رسول کو ہی پسند کیا تھا لیکن اس کا ہمارے حق میں کوئی شمار ( طلاق ) میں نہیں ہوا تھا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 144640,
        "last_updated": null
    },
    {
        "urduURN": 4051890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5263,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے یحییٰ بن قطان نے بیان کیا ، ان سے اسماعیل بن ابی خالد نے ، کہا ہم سے عامر نے بیان کیا ، ان سے مسروق نے بیان کیا کہ",
        "hadithText": "میں نے حضرت عائشہ رضی اللہ عنہا سے ” اختیار “ کے متعلق سوال کیا تو انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے ہمیں اختیار دیا تھا تو کیا محض یہ اختیار طلاق بن جاتا ۔ مسروق نے کہا کہ اختیار دینے کے بعد اگر تم مجھے پسند کر لیتی ہو تو اس کی کوئی حیثیت نہیں ، چاہے میں ایک مرتبہ اختیار دوں یا سو مرتبہ ( طلاق نہیں ہو گی ) ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 144650,
        "last_updated": null
    },
    {
        "urduURN": 4051900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5264,
        "hadithSanad": "اور لیث بن سعد نے نافع سے بیان کیا کہ",
        "hadithText": "عبداللہ بن عمر رضی اللہ عنہما سے اگر ایسے شخص کا مسئلہ پوچھا جاتا جس نے اپنی بیوی کو تین طلاق دی ہوتی ، تو وہ کہتے اگر تو ایک بار یا دو بار طلاق دیتا تو رجوع کر سکتا تھا کیونکہ آنحضرت صلی اللہ علیہ وسلم نے مجھ کو ایسا ہی حکم دیا تھا لیکن جب تو نے تین طلاق دے دی تو وہ عورت اب تجھ پر حرام ہو گئی یہاں تک کہ وہ تیرے سوا اورکسی شخص سے نکاح کرے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 144660,
        "last_updated": null
    },
    {
        "urduURN": 4051910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5265,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم سے ابومعاویہ نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "ایک شخص رفاعی نے اپنی بیوی ( تمیمہ بنت وہب ) کو طلاق دے دی ، پھر ایک دوسرے شخص سے ان کی بیوی نے نکاح کیا لیکن انہوں نے بھی ان کو طلاق دے دی ۔ ان دوسرے شوہر کے پاس کپڑے کے پلو کی طرح تھا ۔ عورت کو اس سے پورا مزہ جیسا وہ چاہتی تھی نہیں ملا ۔ آخر عبدالرحمٰن نے تھوڑے ہی دنوں رکھ کر اس کو طلاق دے دی ۔ اب وہ عورت آنحضرت صلی اللہ علیہ وسلم کے پاس آئی اور عرض کیا کہ یا رسول اللہ ! میرے شوہر نے مجھے طلاق دے دی تھی ، پھر میں نے ایک دوسرے مرد سے نکاح کیا ۔ وہ میرے پاس تنہائی میں آئے لیکن ان کے ساتھ تو کپڑے کے پلو کی طرح کے سو ا اور کچھ نہیں ہے ۔ کل ایک ہی بار اس نے مجھ سے صحبت کی وہ بھی بیکار ( دخول ہی نہیں ہوا اوپر ہی اوپر چھو کر رہ گیا ) کیا اب میں اپنے پہلے خاوند کے لیے حلال ہو گئی ؟ آپ نے فرمایا تو اپنے پہلے خاوند کے لیے حلال نہیں ہو سکتی جب تک دوسرا خاوند تیری شیرینی نہ چکھے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 144670,
        "last_updated": null
    },
    {
        "urduURN": 4051920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5266,
        "hadithSanad": "مجھ سے حسن بن الصباح نے بیان کیا ، انہوں نے ربیع بن نافع سے سنا کہ ہم سے معاویہ بن سلام نے بیان کیا ، ان سے یحییٰ بن ابی کثیر نے ، ان سے یعلیٰ بن حکیم نے ، ان سے سعید بن جبیر نے ، انہوں نے انہیں خبر دی کہ انہوں نے ابن عباس رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "اگر کسی نے اپنی بیوی کو اپنے اوپر ” حرام “ کہا تو یہ کوئی چیز نہیں اور فرمایا کہ تمہارے لیے رسول اللہ صلی اللہ علیہ وسلم کی پیروی عمدہ پیروی ہے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 144680,
        "last_updated": null
    },
    {
        "urduURN": 4051930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5267,
        "hadithSanad": "مجھ سے حسن بن محمد بن صباح نے بیان کیا ، کہا ہم سے حجاج بن محمد اعور نے ، ان سے ابن جریج نے کہ عطاء  بن ابی رباح نے یقین کے ساتھ کہا کہ انہوں نے عبید بن عمیر سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نے حضرت عائشہ رضی اللہ عنہا سے سنا ، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم ام المؤمنین زینب بنت جحش رضی اللہ عنہا کے یہاں ٹھہرتے تھے اور ان کے یہاں شہد پیا کرتے تھے ۔ چنانچہ میں نے اور حفصہ رضی اللہ عنہ نے مل کر صلاح کی کہ آنحضرت صلی اللہ علیہ وسلم ہم میں سے جس کے یہاں بھی تشریف لائیں تو آنحضرت سے یہ کہا جائے کہ آپ کے منہ سے مغافیر ( ایک خاص قسم کے بدبودار گوند ) کی آتی ہے ، کیا آپ نے مغافیر کھایا ہے ؟ آنحضرت صلی اللہ علیہ وسلم اس کے بعد ہم میں سے ایک کے یہاں تشریف لائے تو انہوں نے آنحضرت صلی اللہ علیہ وسلم سے یہی بات کہی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں بلکہ میں نے زینب بنت جحش رضی اللہ عنہا کے ہاں شہد پیا ہے ، اب دوبارہ نہیں پیوں گا ۔ اس پر یہ آیت نازل ہوئی کہ اے نبی ! آپ وہ چیز کیوں حرام کرتے ہیں جو اللہ نے آپ کے لیے حلال کی ہے ” تا “ ان تتوبا الی اللہ ، یہ حضرت عائشہ اور حفصہ رضی اللہ عنہما کی طرف خطاب ہے ۔ واذ اسر النبی الی بعض ازواجہ حدیثا میں حدیث سے آپ کا یہی فرمانا مراد ہے کہ میں نے مغافیر نہیں کھایا بلکہ شہد پیا ہے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 144690,
        "last_updated": null
    },
    {
        "urduURN": 4051940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5268,
        "hadithSanad": "ہم سے فروہ بن ابی المغراء نے بیان کیا ، کہا ہم سے علی بن مسہر نے ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم شہد اور میٹھی چیزیں پسند کرتے تھے ۔ آنحضرت صلی اللہ علیہ وسلم عصر کی نماز سے فارغ ہو کر جب واپس آتے تو اپنی ازواج کے پاس واپس تشریف لے جاتے اور بعض سے قریب بھی ہوتے تھے ۔ ایک دن آنحضرت صلی اللہ علیہ وسلم حفصہ بنت عمر رضی اللہ عنہا کے پاس تشریف لے گئے اور معمول سے زیادہ دیر ان کے گھر ٹھہرے ۔ مجھے اس پر غیرت آئی اور میں نے اس کے بارے میں پوچھا تو معلوم ہوا کہ حفصہ رضی اللہ عنہ کو ان کی قوم کی کسی خاتون نے انہیں شہد کا ایک ڈبہ دیا ہے اور انہوں نے اسی کا شربت آنحضرت صلی اللہ علیہ وسلم کے لیے پیش کیا ہے ۔ میں نے اپنے جی میں کہا کہ خدا کی قسم ! میں تو ایک حیلہ کروں گی ، پھر میں نے سودہ بنت زمعہ رضی اللہ عنہا سے کہا کہ آنحضرت صلی اللہ علیہ وسلم تمہارے پاس آئیں گے اور جب آئیں تو کہنا کہ معلوم ہوتا ہے آپ نے مغافیر کھا رکھا ہے ؟ ظاہر ہے کہ آنحضرت صلی اللہ علیہ وسلم اس کے جواب میں انکار کریں گے ۔ اس وقت کہنا کہ پھر یہ بو کیسی ہے جو آپ کے منہ سے معلوم کر رہی ہوں ؟ اس پر آنحضرت صلی اللہ علیہ وسلم کہیں گے کہ حفصہ نے شہد کا شربت مجھے پلایا ہے ۔ تم کہنا کہ غالباً اس شہد کی مکھی نے مغافیر کے درخت کا عرق چو سا ہو گا ۔ میں بھی آنحضرت صلی اللہ علیہ وسلم سے یہی کہوں گی اور صفیہ تم بھی یہی کہنا ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ سودہ رضی اللہ عنہ کہتی تھیں کہ اللہ کی قسم آنحضرت صلی اللہ علیہ وسلم جو نہی دروازے پر آ کر کھڑے ہوئے تو تمہارے خوف سے میں نے ارادہ کیا کہ آنحضرت صلی اللہ علیہ وسلم سے وہ بات کہوں جو تم نے مجھ سے کہی تھی ۔ چنانچہ جب آنحضرت صلی اللہ علیہ وسلم سودہ رضی اللہ عنہا کے قریب تشریف لے گئے تو انہوں نے کہا ، یا رسول اللہ ! کیا آپ نے مغافیر کھایا ہے ؟ آپ نے فرمایا کہ نہیں ۔ انہوں نے کہا ، پھر یہ بوکیسی ہے جو آپ کے منہ سے محسوس کرتی ہوں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ حفصہ نے مجھے شہد کا شربت پلایا ہے ۔ اس پر سودہ رضی اللہ عنہ بولیں اس شہد کی مکھی نے مغافیر کے درخت کا عرق چوسا ہو گا ۔ پھر جب آنحضرت صلی اللہ علیہ وسلم میرے یہاں تشریف لائے تو میں نے بھی یہی بات کہی اس کے بعد جب صفیہ رضی اللہ عنہا کے یہاں تشریف لے گئے تو انہوں نے بھی اسی کو دہرایا ۔ اس کے بعد جب پھر آنحضور صلی اللہ علیہ وسلم حفصہ رضی اللہ عنہا کے یہاں تشریف لے گئے تو انہوں نے عرض کیا یا رسول اللہ ! وہ شہد پھر نوش فرمائیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ مجھے اس کی ضرورت نہیں ہے ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ اس پر سودہ بولیں ، واللہ ! ہم آنحضرت صلی اللہ علیہ وسلم کو روکنے میں کامیاب ہو گئے ، میں نے ان سے کہا کہ ابھی چپ رہو ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 144700,
        "last_updated": null
    },
    {
        "urduURN": 4051950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5269,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا ، ان سے زرارہ بن اوفی نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اللہ تعالیٰ نے میری امت کو خیالات فاسدہ کی حد تک معاف کیا ہے ، جب تک کہ اس پر عمل نہ کرے یا اسے زبان سے ادا نہ کرے ۔ قتادہ رحمہ اللہ نے کہا کہ اگر کسی نے اپنے دل میں طلاق دے دی تو اس کا اعتبار نہیں ہو گا جب تک زبان سے نہ کہے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 144710,
        "last_updated": null
    },
    {
        "urduURN": 4051960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5270,
        "hadithSanad": "ہم سے اصبغ بن فرج نے بیان کیا ، کہا ہم کو عبداللہ بن وہب نے خبر دی ، انہیں یونس نے ، انہیں ابن شہاب نے ، کہا کہ مجھے ابوسلمہ بن عبدالرحمٰن نے خبر دی اور انہیں جابر رضی اللہ عنہ نے کہ",
        "hadithText": "قبیلہ اسلم کے ایک صاحب ماعز نامی مسجد میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا کہ انہوں نے زنا کیا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے منہ موڑ لیا لیکن پھر وہ آنحضرت صلی اللہ علیہ وسلم کے سامنے آ گئے ( اور زنا کا اقرار کیا ) پھر انہوں نے اپنے اوپرچار مرتبہ شہادت دی تو آنحضرت صلی اللہ علیہ وسلم نے انہیں مخاطب کرتے ہوئے فرمایا ، تم پاگل تو نہیں ہو ، کیا واقعی تم نے زنا کیا ہے ؟ انہوں نے عرض کیا کہ جی ہاں ، پھر آپ نے پوچھا کیا تو شادی شدہ ہے ؟ اس نے کہا کہ جی ہاں ہو چکی ہے ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے انہیں عیدگاہ پر رجم کرنے کا حکم دیا ۔ جب انہیں پتھر لگا تو وہ بھاگنے لگے لیکن انہیں حرہ کے پاس پکڑا گیا اور جان سے مار دیا گیا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 144720,
        "last_updated": null
    },
    {
        "urduURN": 4051970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5271,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ، کہا کہ مجھے ابوسلمہ بن عبدالرحمٰن اور سعید بن مسیب نے خبر دی کہ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "قبیلہ اسلم کا ایک شخص رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ، آنحضرت صلی اللہ علیہ وسلم مسجد میں تشریف رکھتے تھے ۔ انہوں نے آنحضرت صلی اللہ علیہ وسلم کو مخاطب کیا اور عرض کیا کہ انہوں نے زنا کر لیا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے منہ موڑ لیا ہے لیکن وہ آدمی آنحضرت صلی اللہ علیہ وسلم کے سامنے اس رخ کی طرف مڑگیا ، جدھر آپ نے چہرہ مبارک پھیر لیا تھا اور عرض کیا کہ یا رسول اللہ ! دوسرے ( یعنی خود ) نے زنا کیا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس مرتبہ بھی منہ موڑ لیا لیکن وہ پھر آنحضرت کے سامنے اس رخ کی طرف آ گیا جدھر آنحضرت صلی اللہ علیہ وسلم نے منہ موڑ لیا تھا اور یہی عرض کیا ۔ آنحضرت صلی اللہ علیہ وسلم نے پھر ان سے منہ موڑ لیا ، پھر جب چوتھی مرتبہ وہ اسی طرح آنحضرت صلی اللہ علیہ وسلم کے سامنے آ گیا اور اپنے اوپر انہوں نے چار مرتبہ ( زنا کی ) شہادت دی تو آنحضرت صلی اللہ علیہ وسلم نے ان سے دریافت فرمایا تم پاگل تو نہیں ہو ؟ انہوں نے عرض کیا کہ نہیں ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے صحابہ سے فرمایا کہ انہیں لے جاؤ اور سنگسار کرو کیونکہ وہ شادی شدہ تھے ۔ \n<span class=urdu_sanad>اور زہری سے روایت ہے انہوں نے بیان کیاکہ</span> مجھے ایک ایسے شخص نے خبر دی جنہوں نے جابر بن عبداللہ انصاری رضی اللہ عنہماسے سنا تھا کہ انہوں نے بیان کیا کہ میں بھی ان لوگوں میں تھا جنہوں نے ان صحابی کو سنگسار کیا تھا ۔ ہم نے مدینہ منورہ کی عیدگاہ پر سنگسار کیا تھا ۔ جب ان پر پتھر پڑا تو وہ بھاگنے لگے لیکن ہم نے انہیں حرہ میں پھر پکڑ لیا اور انہیں سنگسار کیا یہاں تک کہ وہ مر گئے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 144730,
        "last_updated": null
    },
    {
        "urduURN": 4051990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5273,
        "hadithSanad": "ہم سے ازہر بن جمیل نے بیان کیا ، کہا ہم سے عبدالوہاب ثقفی نے بیان کیا ، کہا ہم سے خالد نے بیان کیا ، ان سے عکرمہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "ثابت بن قیس رضی اللہ عنہ کی بیوی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور عرض کیا کہ یا رسول اللہ ! مجھے ان کے اخلاق اور دین کی وجہ سے ان سے کوئی شکایت نہیں ہے ۔ البتہ میں اسلام میں کفر کو پسند نہیں کرتی ۔ ( کیونکہ ان کے ساتھ رہ کر ان کے حقوق زوجیت کو نہیں ادا کر سکتی ) اس پر آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا ، کیا تم ان کا باغ ( جو انہوں نے مہر میں دیا تھا ) واپس کر سکتی ہو ؟ انہوں نے کہا کہ جی ہاں ۔ آنحضرت صلی اللہ علیہ وسلم نے ( ثابت رضی اللہ عنہ سے ) فرمایا کہ باغ قبول کر لو اور انہیں طلاق دے دو ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 144750,
        "last_updated": null
    },
    {
        "urduURN": 4052000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5274,
        "hadithSanad": "ہم سے اسحاق واسطی نے بیان کیا ، کہا ہم سے خالد طحان نے بیان کیا ، ان سے خالد حذاء نے ، ان سے عکرمہ نے کہ عبداللہ بن ابی ( منافق ) کی بہن جمیلہ رضی اللہ عنہا ( جوابی کی بیٹی تھی ) نے یہ بیان کیا",
        "hadithText": "اور رسول اللہ صلی اللہ علیہ وسلم نے ان سے دریافت فرمایا تھا کہ کیا تم ان ( ثابت رضی اللہ عنہ ) کا باغ واپس کر دو گی ؟ انہوں نے عرض کیا ہاں کر دوں گی ۔ چنانچہ انہوں نے باغ واپس کر دیا اور انہوں نے ان کے شوہر کو حکم دیا کہ انہیں طلاق دے دیں ۔ اور ابراہیم بن طہمان نے بیان کیا کہ ان سے خالد نے ، ان سے عکرمہ نے نبی کریم صلی اللہ علیہ وسلم سے اور ( اس روایت میں بیان کیا کہ ) ان کے شوہر ( ثابت رضی اللہ عنہ ) نے انہیں طلاق دے دی ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 144760,
        "last_updated": null
    },
    {
        "urduURN": 4052010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5275,
        "hadithSanad": "اور ابن ابی تمیمہ سے روایت ہے ، ان سے عکرمہ نے ، ان سے حضرت ابن عباس رضی اللہ عنہما نے ، انہوں نے بیان کیا کہ",
        "hadithText": "ثابت بن قیس رضی اللہ عنہ کی بیوی رسول اللہ ( صلی اللہ علیہ وسلم ) ! کی خدمت میں حاضر ہوئیں اور عرض کیا یا رسول اللہ صلی اللہ علیہ وسلم مجھے ثابت کے دین اور ان کے اخلاق کی وجہ سے کوئی شکایت نہیں ہے لیکن میں ان کے ساتھ گزارہ نہیں کر سکتی ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا پھر کیا تم ان کا باغ واپس کر سکتی ہو ؟ انہوں نے عرض کیا جی ہاں ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 144770,
        "last_updated": null
    },
    {
        "urduURN": 4052020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5276,
        "hadithSanad": "ہم سے محمد بن عبداللہ بن مبارک مخری نے کہا ، کہا ہم سے قراد ابو نوح نے بیان کیا ، کہا ہم سے جریر بن حازم نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے عکرمہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ثابت بن قیس بن شماس رضی اللہ عنہ کی بیوی نبی کریم صلی اللہ علیہ وسلم کے پاس آئیں اور عرض کیا یا رسول اللہ ! ثابت رضی اللہ عنہ کے دین اور ان کے اخلاق سے مجھے کوئی شکایت نہیں لیکن مجھے خطرہ ہے ( کہ میں ثابت رضی اللہ عنہ کی ناشکری میں نہ پھنس جاؤں ) آنحضرت صلی اللہ علیہ وسلم نے اس پر ان سے دریافت فرمایا کیا تم ان کا باغ ( جو انہوں نے مہر میں دیا تھا ) واپس کر سکتی ہو ؟ انہوں نے عرض کیا جی ہاں ۔ چنانچہ انہوں نے وہ باغ واپس کر دیا اور آنحضرت صلی اللہ علیہ وسلم کے حکم سے ثابت رضی اللہ عنہ نے انہیں اپنے سے جدا کر دیا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 144780,
        "last_updated": null
    },
    {
        "urduURN": 4052030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5277,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، ان سے حماد بن یزید نے بیان کیا ، ان سے ایوب سختیانی نے",
        "hadithText": "ان سے عکرمہ نے یہی قصہ ( مرسلاً ) نقل کیا اور اس میں خاتون کا نام جمیلہ آیا ہے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 144790,
        "last_updated": null
    },
    {
        "urduURN": 4052040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5278,
        "hadithSanad": "ہم سے ابو الولید نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے ابن ابی ملیکہ نے اور ان سے مسور بن مخرمہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے کہ بنی مغیرہ نے اس کی اجازت مانگی ہے کہ علی رضی اللہ عنہ سے وہ اپنی بیٹی کا نکاح کر لیں لیکن میں انہیں اس کی اجازت نہیں دوں گا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 144800,
        "last_updated": null
    },
    {
        "urduURN": 4052050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5279,
        "hadithSanad": "ہم سے اسماعیل بن عبداللہ اویسی نے بیان کیا ، کہا کہ مجھ سے امام مالک نے ، ان سے ربیعہ بن ابی عبدالرحمٰن نے ، ان سے قاسم بن محمد نے اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "بریرہ رضی اللہ عنہا سے دین کے تین مسئلے معلوم ہو گئے ۔ اول یہ کہ انہیں آزاد کیا گیا اور پھر ان کے شوہر کے بارے میں اختیار دیا گیا ( کہ چاہیں ان کے نکاح میں رہیں ورنہ الگ ہو جائیں ) اور رسول اللہ صلی اللہ علیہ وسلم نے ( انہیں کے بارے میں ) فرمایا کہ ” ولاء “ اسی سے قائم ہوتی ہے جو آزاد کرے اور ایک مرتبہ حضور اکرم صلی اللہ علیہ وسلم گھر میں تشریف لائے تو ایک ہانڈی میں گوشت پکایا جا رہا تھا ، پھر کھانے کے لئے آنحضرت صلی اللہ علیہ وسلم کے سامنے روٹی اور گھر کا سالن پیش کیا گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں نے تو دیکھا کہ ہانڈی میں گوشت بھی پک رہا ہے ؟ عرض کیا گیا کہ جی ہاں لیکن وہ گوشت بریرہ کو صدقہ میں ملا ہے اور آنحضرت صلی اللہ علیہ وسلم صدقہ نہیں کھاتے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ وہ ان کے لیے صدقہ ہے اور ہمارے لئے بریرہ کی طرف سے تحفہ ہے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 144810,
        "last_updated": null
    },
    {
        "urduURN": 4052060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5280,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا ہم سے شعبہ اور ہمام نے بیان کیا ، ان سے قتادہ نے ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "میں نے انہیں غلام دیکھا تھا ۔ آپ کی مراد بریرہ رضی اللہ عنہا کے شوہر ( مغیث ) سے تھی ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 144820,
        "last_updated": null
    },
    {
        "urduURN": 4052070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5281,
        "hadithSanad": "ہم سے عبدالاعلیٰ بن حماد نے بیان کیا ، کہا ہم سے وہیب بن خالد نے بیان کیا ، کہا ہم سے ایوب نے بیان کیا ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "یہ مغیث بنی فلاں کے غلام تھے ۔ آپ کا اشارہ بریرہ رضی اللہ عنہا کے شوہر کی طرف تھا ۔ گویا اس وقت بھی میں انہیں دیکھ رہا ہوں کہ مدینہ کی گلیوں میں وہ بریرہ رضی اللہ عنہ کے پیچھے پیچھے روتے پھر رہے ہیں ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 144830,
        "last_updated": null
    },
    {
        "urduURN": 4052080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5282,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، ان سے عبدالوہاب نے بیان کیا ، ان سے ایوب نے ، ان سے عکرمہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "بریرہ رضی اللہ عنہ کے شوہر ایک حبشی غلام تھے ۔ ان کا مغیث نام تھا ، وہ بنی فلاں کے غلام تھے ۔ جیسے وہ منظر اب بھی میری آنکھوں میں ہے کہ وہ مدینہ کی گلیوں میں بریرہ رضی اللہ عنہا کے پیچھے پیچھے پھر رہے ہیں ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 144840,
        "last_updated": null
    },
    {
        "urduURN": 4052090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5283,
        "hadithSanad": "ہم سے محمد بن سلام بیکندی نے بیان کیا ، کہا ہم کو عبدالوہاب ثقفی نے خبر دی ، کہا ہم سے خالد حذاء نے ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "بریرہ رضی اللہ عنہ کے شوہر غلام تھے اور ان کا نام مغیث تھا ۔ گویا میں اس وقت اس کو دیکھ رہا ہوں جب وہ بریرہ رضی اللہ عنہا کے پیچھے پیچھے روتے ہوئے پھر رہے تھے اور آنسوؤں سے ان کی ڈاڑھی تر ہو رہی تھی ۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے عباس رضی اللہ عنہ سے فرمایا ، عباس ! کیا تمہیں مغیث کی بریرہ سے محبت اور بریرہ کی مغیث سے نفرت پر حیرت نہیں ہوئی ؟ آخر حضور اکرم صلی اللہ علیہ وسلم نے بریرہ رضی اللہ عنہ سے فرمایا کاش ! تم اس کے بارے میں اپنا فیصلہ بدل دیتیں ۔ انہوں نے عرض کیا یا رسول اللہ ! کیا آپ مجھے اس کا حکم فرما رہے ہیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا میں صرف سفارش کر رہا ہوں ۔ انہوں نے اس پر کہا کہ مجھے مغیث کے پاس رہنے کی خواہش نہیں ہے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 144850,
        "last_updated": null
    },
    {
        "urduURN": 4052100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5285,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے نافع نے کہ",
        "hadithText": "ابن عمر رضی اللہ عنہما سے اگر یہودی یا انصاری عورتوں سے نکاح کے متعلق سوال کیا جاتا تو وہ کہتے کہ اللہ تعالیٰ نے مشرک عورتوں سے نکاح مومنوں کے لیے حرام قرار دیا ہے اور میں نہیں سمجھتا کہ اس سے بڑھ کر اور کیا شرک ہو گا کہ ایک عورت یہ کہے کہ اس کے رب حضرت عیسیٰ علیہ السلام ہیں حالانکہ وہ اللہ کے مقبول بندوں میں سے ایک مقبول بندے ہیں ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 144870,
        "last_updated": null
    },
    {
        "urduURN": 4052110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5286,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا ہم کو ہشام بن عروہ نے خبر دی ، انہیں ابن جریج نے کہ عطاء راسانی نے بیان کیا اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم اور مومنین کے لیے مشرکین دو طرح کے تھے ۔ ایک تو مشرکین لڑائی کرنے والوں سے کہ آنحضرت صلی اللہ علیہ وسلم ان سے جنگ کرتے تھے اور وہ آنحضرت صلی اللہ علیہ وسلم سے جنگ کرتے تھے ۔ دوسرے عہد و پیمان کرنے والے مشرکین کہ آنحضرت صلی اللہ علیہ وسلم ان سے جنگ نہیں کرتے تھے اور نہ وہ آنحضرت صلی اللہ علیہ وسلم سے جنگ کرتے تھے اور جب اہل کتاب حرب کی کوئی عورت ( اسلام قبول کرنے کے بعد ) ہجرت کر کے ( مدینہ منورہ ) آتی تو انہیں اس وقت تک پیغام نکاح نہ دیا جاتا یہاں تک کہ انہیں حیض آتا اور پھر وہ اس سے پاک ہوتیں ، پھر جب وہ پاک ہو جاتیں تو ان سے نکاح جائز ہو جاتا ، پھر اگر ان کے شوہر بھی ، ان کے کسی دوسرے شخص سے نکاح کر لینے سے پہلے ہجرت کر کے آ جاتے تو یہ انہیں کو ملتیں اور اگر مشرکین میں سے کوئی غلام یا لونڈی مسلمان ہو کر ہجرت کرتی تو وہ آزاد سمجھے جاتے اور ان کے وہی حقوق ہوتے جو تمام مہاجرین کے تھے ۔ پھر عطاء نے معاہد مشرکین کے سلسلے میں مجاہد کی حدیث کی طرح سے صورت حال بیان کی کہ اگر معاہد مشرکین کی کوئی غلام یا لونڈی ہجرت کر کے آجاتی تو انہیں ان کے مالک مشرکین کو واپس نہیں کیا جاتا تھا ۔ البتہ جو ان کی قیمت ہوتی وہ واپس کر دی جاتی تھی ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 144880,
        "last_updated": null
    },
    {
        "urduURN": 4052120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5287,
        "hadithSanad": "اور عطاء نے حضرت ابن عباس رضی اللہ عنہما سے بیان کیا کہ",
        "hadithText": "قریبہ بنت ابی امیہ عمر بن خطاب رضی اللہ عنہ کے نکاح میں تھیں ، پھر عمر رضی اللہ عنہ نے ( مشرکین سے نکاح کی مخالفت کی آیت کے بعد ) انہیں طلاق دے دی تو معاویہ بن ابی سفیان رضی اللہ عنہ نے ان سے نکاح کر لیا اور ام الحکم بنت ابی سفیان عیاض بن غنم فہری کے نکاح میں تھیں ، اس وقت اس نے انہیں طلاق دے دی ( اور وہ مدینہ ہجرت کر کے آ گئیں ) اورعبداللہ بن عثمان ثقفی نے ان سے نکاح کیا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 144890,
        "last_updated": null
    },
    {
        "urduURN": 4052130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5288,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے اور ابراہیم بن المنذر نے بیان کیا کہ مجھ سے عبداللہ ابن وہب نے بیان کیا ، ان سے یونس نے بیان کیا کہ ابن شہاب نے بیان کیا کہ",
        "hadithText": "مجھے عروہ بن زبیر نے خبر دی اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے بیان کیا کہ مومن عورتیں جب ہجرت کر کے نبی کریم صلی اللہ علیہ وسلم کے پاس آتی تھیں تو آنحضرت صلی اللہ علیہ وسلم انہیں آزماتے تھے بوجہ اللہ تعالیٰ کے اس ارشاد کے کہ ” اے وہ لوگو ! جو ایمان لے آئے ہو ، جب مومن عورتیں تمہارے پاس ہجرت کر کے آئیں تو انہیں آزماؤ آخر آیت تک ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر ان ( ہجرت کرنے والی ) مومن عورتوں میں سے جو اس شرط کا اقرار کر لیتی ( جس کا ذکر اسی سورۃ الممتحنہ میں ہے کہ ” اللہ کا کسی کو شریک نہ ٹھہراؤ گی ) تو وہ آزمائش میں پوری سمجھی جا تی تھی ۔ چنانچہ جب وہ اس کا اپنی زبان سے اقرار کر لیتیں تو رسول اللہ صلی اللہ علیہ وسلم ان سے فرماتے کہ اب جاؤ میں نے تم سے عہد لے لیا ہے ۔ ہرگز نہیں ! واللہ ! آنحضرت صلی اللہ علیہ وسلم کے ہاتھ نے ( بیعت لیتے وقت ) کسی عورت کا ہاتھ کبھی نہیں چھوا ۔ آنحضرت صلی اللہ علیہ وسلم ان سے صرف زبان سے ( بیعت لیتے تھے ) واللہ آنحضرت صلی اللہ علیہ وسلم نے عورتوں سے صرف انہیں چیزوں کا عہد لیا جن کااللہ نے آپ کو حکم دیا تھا ۔ بیعت لینے کے بعد آپ ان سے فرماتے کہ میں نے تم سے عہد لے لیا ہے ۔ یہ آپ صرف زبان سے کہتے کہ میں نے تم سے بیعت لے لی ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 144910,
        "last_updated": null
    },
    {
        "urduURN": 4052140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5289,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، ان سے ان کے بھائی عبدالحمید نے ، ان سے سلیمان بن بلال نے ، ان سے حمید طویل نے کہ انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے اپنی ازواج مطہرات سے ایلاء کیا تھا ۔ آنحضرت صلی اللہ علیہ وسلم کے پاؤںمیں موچ آ گئی تھی ۔ اس لیے آپ نے اپنے بالا خانہ میں انتیس دن تک قیام فرمایا ، پھر آپ وہاں سے اترے ۔ لوگوں نے کہا کہ یا رسول اللہ ! آپ نے ایک مہینہ کا ایلاء کیا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ مہینہ انتیس دن کا بھی ہوتا ہے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 144920,
        "last_updated": null
    },
    {
        "urduURN": 4052150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5290,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے نافع نے کہ",
        "hadithText": "ابن عمر رضی اللہ عنہما اس ایلاء کے بارے میں جس کا ذکر اللہ تعالیٰ نے کیا ہے ، فرماتے تھے کہ مدت پوری ہونے کے بعد کسی کے لیے جائز نہیں ، سوا اس کے کہ قاعدہ کے مطابق ( اپنی بیوی کو ) اپنے پاس ہی روک لے یا پھر طلاق دے ، جیسا کہ اللہ تعالیٰ نے حکم دیا ہے اور حضرت امام بخاری رحمہ اللہ نے کہا کہ مجھ سے اسماعیل نے بیان کیا کہ ان سے امام مالک نے بیان کیا ، ان سے نافع نے اور ان سے حضرت ابن عمر رضی اللہ عنہما نے کہ چار مہینے گزر جائیں تو اسے قاضی کے سامنے پیش کیا جائے گا ، یہاں تک کہ وہ طلاق دیدے اور طلاق اس وقت تک نہیں ہوتی جب تک طلاق دی نہ جائے اور حضرت عثمان ، علی ، ابودرداء اور عائشہ اور بارہ دوسرے صحابہ رضوان اللہ علیہم سے بھی ایسا ہی منقول ہے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 144930,
        "last_updated": null
    },
    {
        "urduURN": 4052160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5291,
        "hadithSanad": "مجھ سے اسماعیل نے بیان کہا کہ ان سے امام مالک نے بیان کیا ، ان سے نافع نے اور ان سے حضرت ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "جب چار مہینے گذر جائیں تو اسے قاضی کے سامنے پیش کیا جائے گا ، یہاں تک کہ وہ طلاق دیدے ، اور طلاق اس وقت تک نہیں ہوتی جب تک طلاق دی نہ جائے ، اور حضرت عثمان ، علی ، ابودرداء اور عائشہ اور بارہ دوسرے صحابہ رضوان اللہ علیہم سے بھی ایسا ہی منقول ہے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 144940,
        "last_updated": null
    },
    {
        "urduURN": 4052170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5292,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے کہا ، ان سے سفیان بن عیینہ نے ، ان سے یحییٰ بن سعید نے ، ان سے منبعث کے مولیٰ یزید نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم سے کھوئی ہوئی بکری کے متعلق سوال کیا گیا تو آپ نے فرمایا کہ اسے پکڑ لو ، کیونکہ یا وہ تمہاری ہو گی ( اگر ایک سال تک اعلان کے بعداس کا مالک نہ ملا ) ۔ تمہارے کسی بھائی کی ہو گی یا پھر بھیڑ یے کی ہو گی ( اگر انہی جنگلوں میں پھرتی رہی ) اور انحضرت صلی اللہ علیہ وسلم سے کھوئے ہوئے اونٹ کے متعلق سوال کیا گیا تو آپ غصہ ہو گئے اور غصہ کی وجہ سے آپ کے دونوں رخسار سرخ ہو گئے اور آپ نے فرمایا ، تمہیں اس سے کیا غرض ! اس کے پاس ( مضبوط ) کھر ہیں ( جس کی وجہ سے چلنے میں اسے کوئی دشواری نہیں ہو گی ) اس کے پاس مشکیزہ ہے جس سے وہ پانی پیتا رہے گا اور درخت کے پتے کھاتا رہے گا ، یہاں تک کہ اس کا مالک اسے پالے گا اور نبی کریم صلی اللہ علیہ وسلم سے لقطہٰ کے متعلق سوال کیا گیا تو آپ نے فرمایا کہ اس کی رسی کا ( جس سے وہ بندھا ہو ) اور اس کے ظرف کا ( جس میں وہ رکھا ہو ) اعلان کرو اور اس کا ایک سال تک اعلان کرو ، پھر اگر کوئی ایسا شخص آ جائے جو اسے پہچانتا ہو ( اور اس کا مالک ہو تو اسے دے دو ) ورنہ اسے اپنے مال کے ساتھ ملا لو ۔ سفیان بن عیینہ نے بیان کیا کہ پھر میں ربیعہ بن عبدالرحمٰن سے ملا اور مجھے ان سے اس کے سوا اور کوئی چیز محفوظ نہیں ہے ۔ میں نے ان سے پوچھا تھا کہ گم شدہ چیزوں کے بارے میں منبعث کے مولیٰ یزید کی حدیث کے بارے میں آپ کا کیا خیال ہے ؟ کیا وہ زید بن خالد سے منقول ہے ؟ تو انہوں نے کہا کہ ہاں ( سفیان نے بیان کیا کہ ہاں ) یحییٰ نے بیان کیا کہ ربیعہ نے منبعث کے مولیٰ یزید سے بیان کیا ، ان سے زید بن خالد نے ۔ سفیان نے بیان کیا کہ پھر میں نے ربیعہ سے ملاقات کی اور ان سے اس کے متعلق پوچھا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 144950,
        "last_updated": null
    },
    {
        "urduURN": 4052180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5293,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے ابوعامر عبدالملک بن عمرو نے بیان کیا ، کہا ہم سے ابراہیم بن طہمان نے بیان کیا ، ان سے خالد حذاء نے ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے بیت اللہ کا طواف اپنے اونٹ پر سوار ہو کر کیا اور آنحضرت صلی اللہ علیہ وسلم جب بھی رکن کے پاس آتے تو اس کی طرف اشارہ کر کے تکبیر کہتے اور زینب بنت جحش رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، یاجوج ماجوج کے دیوار میں اتنا سوراخ ہو گیا ہے اور آپ نے اپنی انگلیوں سے نوے کا عدد بنایا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 144960,
        "last_updated": null
    },
    {
        "urduURN": 4052190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5294,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، ان سے بشر بن مفضل نے بیان کیا ، ان سے سلمہ بن علقمہ نے بیان کیا ، ان سے محمد بن سیرین نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ابوالقاسم صلی اللہ علیہ وسلم نے فرمایا جمعہ میں ایک گھڑی ایسی آتی ہے جو مسلمان بھی اس وقت کھڑا نماز پڑھے اور اللہ سے کوئی خیر مانگے تو اللہ اسے ضرور دے گا ۔ آنحضرت صلی اللہ علیہ وسلم نے ( اس ساعت کی وضاحت کرتے ہوئے ) اپنے دست مبارک سے اشارہ کیا اور اپنی انگلیوں کو درمیانی انگلی اور چھوٹی انگلی کے بیچ میں رکھا جس سے ہم نے سمجھا کہ آپ اس ساعت کو بہت مختصر ہونے کو بتا رہے ہیں ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 144980,
        "last_updated": null
    },
    {
        "urduURN": 4052200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5295,
        "hadithSanad": "اور اویسی نے بیان کیا ، ان سے ابراہیم بن سعد نے بیان کیا ، ان سے شعبہ بن حجاج نے ، ان سے ہشام بن یزید نے ، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں ایک یہودی نے ایک لڑکی پر ظلم کیا ، اس کے چاندی کے زیورات جو وہ پہنے ہوئے تھی چھین لیے اور اس کا سر کچل دیا ۔ لڑکی کے گھر والے اسے آنحضرت صلی اللہ علیہ وسلم کے پاس لائے تو اس کی زندگی کی بس آخری گھڑی باقی تھی اور وہ بول نہیں سکتی تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے اس سے پوچھا کہ تمہیں کس نے مارا ہے ؟ فلاں نے ؟ آنحضرت صلی اللہ علیہ وسلم نے اس واقعہ سے غیر متعلق آدمی کا نام لیا ۔ اس لیے اس نے اپنے سر کے اشارہ سے کہا کہ نہیں ۔ بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم نے ایک دوسرے شخص کا نام لیا اور وہ بھی اس واقعہ سے غیر متعلق تھا تو لڑکی نے سر کے اشارہ سے کہا کہ نہیں ، پھر آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا کہ فلاں نے تمہیں مارا ہے ؟ تو اس لڑکی نے سر کے اشارہ سے ہاں کہا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 144990,
        "last_updated": null
    },
    {
        "urduURN": 4052210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5296,
        "hadithSanad": "ہم سے قبیصہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے عبداللہ بن دینار نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا آپ فرما رہے تھے کہ فتنہ ادھر سے اٹھے گا اور آپ نے مشرق کی طرف اشارہ کیا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 145000,
        "last_updated": null
    },
    {
        "urduURN": 4052220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5297,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے جریر بن عبدالحمید نے بیان کیا ، ان سے ابواسحاق شیبانی نے اور ان سے عبداللہ بن ابی اوفی نے بیان کیا کہ",
        "hadithText": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھے ۔ جب سورج ڈوب گیا تو آنحضرت صلی اللہ علیہ وسلم نے ایک صحابی ( حضرت بلال رضی اللہ عنہ ) سے فرمایا کہ اتر کر میرے لیے ستو گھول ( کیونکہ آپ روزہ سے تھے ) انہوں نے عرض کیا یا رسول اللہ ! اگر اندھیرا ہونے دیں تو بہتر ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے پھر فرمایا کہ اتر کر ستو گھول ۔ انہوں نے عرض کیا یا رسول اللہ ! اگر آپ اور اندھیرا ہو لینے دیں تو بہتر ہے ، ابھی دن باقی ہے ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اتر و اور ستو گھول لو ۔ آخر تیسری مر تبہ کہنے پرانہوں نے اتر کر آنحضرت صلی اللہ علیہ وسلم کا ستو گھولا ۔ آنحضرت صلی اللہ علیہ وسلم نے اسے پیا ، پھر آپ نے اپنے ہاتھ سے مشرق کی طرف اشارہ کیا اور فرمایا کہ جب تم دیکھو کہ رات ادھر سے آ رہی ہے تو روزہ دار کو افطار کر لینا چاہیئے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 145010,
        "last_updated": null
    },
    {
        "urduURN": 4052230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5298,
        "hadithSanad": "ہم سے عبداللہ بن سلمہ نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، ان سے سلیمان تیمی نے ، ان سے ابوعثمان نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، تم میں سے کسی کو ( سحری کھانے سے ) بلال کی پکار نہ روکے ، یا آپ نے فرمایا کہ ” ان کی اذان “ کیونکہ وہ پکارتے ہیں ، یا فرمایا ، اذان دیتے ہیں تاکہ اس وقت نماز پڑھنے والا رک جائے ۔ اس کا اعلان سے یہ مقصود نہیں ہوتا کہ صبح صادق ہو گئی ۔ اس وقت یزید بن زریع نے اپنے دونوں ہاتھ بلند کئے ( صبح کاذب کی صورت بتانے کے لیے ) پھر ایک ہاتھ کو دوسرے پر پھیلایا ( صبح صادق کی صورت کے اظہار کے لیے ) ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 145020,
        "last_updated": null
    },
    {
        "urduURN": 4052240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5299,
        "hadithSanad": "اور لیث نے بیان کیا کہ ان سے جعفر بن ربیعہ نے بیان کیا ، ان سے عبدالرحمٰن بن ہرمز نے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، بخیل اورسخی کی مثال دو آدمیوں جیسی ہے جن پرلو ہے کی دو زرہیں سینے سے گردن تک ہیں ۔ سخی جب بھی کوئی چیز خرچ کرتا ہے تو زرہ اس کے چمڑے پر ڈھیلی ہو جاتی ہے اور اس کے پاؤں کی انگلیوں تک پہنچ جاتی ہے ( اور پھیل کر اتنی بڑھ جاتی ہے کہ ) اس کے نشان قدم کو مٹاتی چلتی ہے لیکن بخیل جب بھی خرچ کا ارادہ کرتا ہے تو اس کی زرہ کا ہر حلقہ اپنی اپنی جگہ چمٹ جاتا ہے ، وہ اسے ڈھیلا کرنا چاہتا ہے لیکن وہ ڈھیلا نہیں ہوتا ۔ اس وقت آپ نے اپنی انگلی سے اپنے حلق کی طرف اشارہ کیا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 145030,
        "last_updated": null
    },
    {
        "urduURN": 4052250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5300,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے یحییٰ بن سعید انصاری نے اور انہوں نے انس بن مالک انصاری رضی اللہ عنہ سے سنا ، بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تمہیں بتاؤں کہ قبیلہ انصار کا سب سے بہتر گھرانہ کو ن سا ہے ؟ صحابہ نے عرض کیا کہ ضرور بتائیے یا رسول اللہ ! آپ نے فرمایا کہ بنو نجار کا ۔ اس کے بعد ان کا مرتبہ ہے جو ان سے قریب ہیں یعنی بنو عبد الاشہل کا ، ان کے بعد وہ ہیں جو ان سے قریب ہیں ، بنی الحارث بن خزرج کا ۔ اس کے بعد وہ ہیں جو ان سے قریب ہیں ، بنو ساعد ہ کا ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے اپنے ہاتھ سے اشارہ کیا اور اپنی مٹھی بند کی ، پھر اسے اس طرح کھولا جیسے کوئی اپنے ہاتھ کی چیز کو پھینکتا ہے پھر فرمایا کہ انصار کے ہر گھرانہ میں خیر ہے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 145040,
        "last_updated": null
    },
    {
        "urduURN": 4052260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5301,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا کہ ابوحازم نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کے صحابی سہل بن سعد ساعدی رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، میری بعثت قیامت سے اتنی قریب ہے جیسے اس کی اس سے ( یعنی شہادت کی انگلی بیچ کی انگلی سے ) یا آنحضرت صلی اللہ علیہ وسلم نے فرمایا ( راوی کو شک تھا ) کہ جیسے یہ دونوں انگلیاں ہیں اور آپ نے شہادت کی اور بیچ کی انگلیوں کو ملا کر بتایا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 145050,
        "last_updated": null
    },
    {
        "urduURN": 4052270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5302,
        "hadithSanad": "ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے جبلہ بن سحیم نے بیان کیا ، انہوں نے حضرت ابن عمر رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، مہینہ اتنے ، اتنے اور اتنے دنوں کا ہوتا ہے ۔ آپ کی مراد تیس دن سے تھی ۔ پھر فرمایا اور اتنے ، اتنے اور اتنے دنوں کا بھی ہوتا ہے ۔ آپ کا اشارہ انتیس دنوں کی طرف تھا ۔ ایک مرتبہ آپ نے تیس کی طرف اشارہ کیا اور دوسری مرتبہ انتیس کی طرف ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 145060,
        "last_updated": null
    },
    {
        "urduURN": 4052280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5303,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے یحییٰ بن سعید نے بیان کیا ، ان سے اسماعیل نے ، ان سے قیس نے اور ان سے ابومسعود رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "اور نبی کریم صلی اللہ علیہ وسلم نے اپنے ہاتھ سے یمن کی طرف اشارہ کر کے فرمایا کہ بر کتیں ادھر ہیں ۔ دو مرتبہ ( آنحضرت صلی اللہ علیہ وسلم نے یہ فرمایا ) ہاں اور سختی اور قساوت قلب ان کی کرخت آواز والوں میں ہے جہاں سے شیطان کی دونوں سینگیں طلوع ہوتی ہیں ۔ یعنی ربیعہ اور مضر میں ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 145070,
        "last_updated": null
    },
    {
        "urduURN": 4052290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5304,
        "hadithSanad": "ہم سے عمرو بن زرارہ نے بیان کیا ، کہا کہ ہم کو عبدالعزیز بن ابی حازم نے خبر دی ، انہیں ان کے والد نے اور ان سے سہل رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، میں اور یتیم کی پر ورش کرنے والا جنت میں اس طرح ہوں گے اور آپ نے شہادت کی انگلی اور بیچ کی انگلی سے اشارہ کیا اور ان دونوں انگلیوں کے درمیان تھوڑی سی جگہ کھلی رکھی ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 145080,
        "last_updated": null
    },
    {
        "urduURN": 4052300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5305,
        "hadithSanad": "ہم سے یحییٰ نے بیان کیا ، ان سے امام مالک نے بیان کیا ، ان سے ابن شہاب نے ، ان سے سعید بن مسیب نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "ایک صحابی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا یا رسول اللہ ! میرے یہاں تو کالا کلوٹا بچہ پیدا ہوا ہے ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا تمہارے پاس کچھ اونٹ بھی ہیں ؟ انہوں نے کہا جی ہاں ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا ، ان کے رنگ کیسے ہیں ؟ انہوں نے کہا کہ سرخ رنگ کے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا ، ان میں کوئی سیاہی مائل سفید اونٹ بھی ہے ؟ انہوں نے کہا کہ جی ہاں ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ پھر یہ کہاں سے آ گیا ؟ انہوں نے کہا کہ اپنی نسل کے کسی بہت پہلے کے اونٹ پر یہ پڑا ہو گا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اسی طرح تمہارا یہ لڑکا بھی اپنی نسل کے کسی دور کے رشتہ دار پر پڑا ہو گا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 145090,
        "last_updated": null
    },
    {
        "urduURN": 4052310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5306,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے جویریہ نے بیان کیا ، ان سے نافع نے بیان کیا اور ان سے عبداللہ نے کہ",
        "hadithText": "قبیلہ انصار کے ایک صحابی نے اپنی بیوی پر تہمت لگائی تو نبی کریم صلی اللہ علیہ وسلم نے دونوں میاں بیوی سے قسم کھلوائی اور پھر دونوں میں جدائی کرا دی ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 145100,
        "last_updated": null
    },
    {
        "urduURN": 4052320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5307,
        "hadithSanad": "مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے ابن ابی عدی نے بیان کیا ، ان سے ہشام بن حسان نے ، کہا کہ ہم سے عکرمہ نے بیان کیا اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "ہلال بن امیہ نے اپنی بیوی پر تہمت لگائی ، پھر وہ آئے اور گواہی دی ۔ نبی کریم صلی اللہ علیہ وسلم نے اس وقت فرمایا ، اللہ خوب جانتا ہے کہ تم میں سے ایک جھوٹا ہے ، تو کیا تم میں سے کوئی ( جو واقعی گناہ کا مرتکب ہوا ہو ) رجوع کرے گا ؟ اس کے بعد ان کی بیوی کھڑی ہوئیں اور انہوں نے گواہی دی ۔ اپنے بری ہونے کی ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 145110,
        "last_updated": null
    },
    {
        "urduURN": 4052330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5308,
        "hadithSanad": "ہم سے اسماعیل بن ابی ایاس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابن شہاب نے اور انہیں سہل بن سعد ساعدی نے خبر دی کہ عویمر عجلانی ، عاصم بن عدی انصاری کے پاس آئے اور ان سے کہا کہ",
        "hadithText": "عاصم آپ کا کیاخیال ہے کہ ایک شخص اگر اپنی بیوی کے ساتھ کسی غیر مرد کو دیکھے تو کیا اسے قتل کر دے گا لیکن پھر آپ لوگ اسے بھی قتل کر دیں گے ۔ آخر اسے کیا کرنا چاہیئے ؟ عاصم ، میرے لیے یہ مسئلہ پوچھ دو ۔ چنانچہ عاصم رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے یہ مسئلہ پوچھا ۔ آنحضرت نے اس طرح کے سوالات کو ناپسند فرمایا اور اظہار نا گواری کیا ۔ عاصم رضی اللہ عنہ نے اس سلسلے میں آنحضرت صلی اللہ علیہ وسلم سے جو کچھ سنا اس کا بہت اثر لیا ۔ پھر جب گھر واپس آئے تو عویمر ان کے پاس آئے اور پوچھا ۔ عاصم ! آپ کو رسول اللہ صلی اللہ علیہ وسلم نے کیا جواب دیا ۔ عاصم رضی اللہ عنہ نے کہا ، عویمر تم نے میرے ساتھ اچھا معاملہ نہیں کیا ، جو مسئلہ تم نے پوچھا تھا ، آنحضرت صلی اللہ علیہ وسلم نے اسے ناپسند فرمایا ۔ عویمر رضی اللہ عنہ نے کہا کہ اللہ کی قسم جب تک میں یہ مسئلہ آنحضرت صلی اللہ علیہ وسلم سے معلوم نہ کر لوں ، باز نہیں آؤں گا ۔ چنانچہ عویمر رضی اللہ عنہ حضور صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے ، آنحضرت صلی اللہ علیہ وسلم اس وقت صحابہ کے درمیان میں موجود تھے ۔ انہوں نے عرض کیا یا رسول اللہ ! آپ کا اس شخص کے متعلق کیا ارشاد ہے جو اپنی بیوی کے ساتھ کسی غیر مرد کو دیکھے ، کیا اسے قتل کر دے ؟ لیکن پھر آپ لوگ اسے ( قصاص ) میں قتل کر دیں گے ، تو پھر اسے کیا کرنا چاہیئے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تمہارے اور تمہاری بیوی کے بارے میں ابھی وحی نازل ہوئی ہے ۔ جاؤ اور اپنی بیوی کو لے کر آؤ ۔ سہل نے بیان کیا کہ پھر ان دونوں نے لعان کیا ۔ میں بھی آنحضرت صلی اللہ علیہ وسلم کے پاس اس وقت موجود تھا ۔ جب لعان سے فارغ ہوئے تو عویمر رضی اللہ عنہ نے کہا کہ یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! اگر اب بھی میں اسے ( اپنی بیوی کو ) اپنے ساتھ رکھتا ہوں تو اس کا مطلب یہ ہے کہ میں جھوٹا ہوں ۔ چنانچہ انہوں نے انہیں تین طلاقیں آنحضرت صلی اللہ علیہ وسلم کے حکم سے پہلے ہی دے دیں ۔ ابن شہاب نے بیان کیا کہ پھر لعان کرنے والوں کے لیے سنت طریقہ مقرر ہو گیا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 145120,
        "last_updated": null
    },
    {
        "urduURN": 4052340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5309,
        "hadithSanad": "ہم سے یحییٰ بن جعفر نے بیان کیا ، کہا ہم کو عبدالرزاق بن ہمام نے خبر دی ، انہیں ابن جریج نے خبر دی ، کہا کہ",
        "hadithText": "مجھے ابن شہاب نے لعان کے بارے میں اور یہ کہ شریعت کی طرف سے اس کا سنت طریقہ کیا ہے ، خبر دی بنی ساعدہ کے سہل بن سعد رضی اللہ عنہ نے ، انہوں نے بیان کیا کہ قبیلہ انصار کے ایک صحابی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! اس شخص کے متعلق آپ کا کیا ارشاد ہے جو اپنی بیوی کے ساتھ کسی غیر مرد کو دیکھے ، کیا وہ اسے قتل کر دے یا اسے کیا کرنا چاہیئے ؟ انہیں کے بارے میں اللہ تعالیٰ نے قرآن مجید کی وہ آیت نازل کی جس میں لعان کرنے والوں کے لیے تفصیلات بیان ہوئی ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ اللہ تعالیٰ نے تمہاری بیوی کے بارے میں فیصلہ کر دیا ہے ۔ بیان کیا کہ پھر دونوں نے مسجد میں لعان کیا ، میں اس وقت وہاں موجود تھا ۔ جب دونوں لعان سے فارغ ہوئے تو انصاری صحابی نے عرض کیا یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! اگر اب بھی میں اسے اپنے نکاح میں رکھوں تو اس کا مطلب یہ ہو گا کہ میں نے اس پر جھوٹی تہمت لگا ئی تھی ۔ چنانچہ لعان سے فارغ ہونے کے بعد انہوں نے آنحضرت صلی اللہ علیہ وسلم کے حکم سے پہلے ہی انہیں تین طلاقیں دے دیں ۔ حضور اکرم صلی اللہ علیہ وسلم کی موجودگی میں ہی انہیں جدا کر دیا ۔ ( سہل نے یا ابن شہاب نے ) کہا کہ ہر لعان کرنے والے میاں بیوی کے درمیان یہی جدائی کا سنت طریقہ مقرر ہوا ۔ ابن جریج نے بیان کیا ، ان سے ابن شہاب نے بیان کیا کہ ان کے بعد شریعت کی طرف سے طریقہ یہ متعین ہوا کہ دو لعان کرنے والوں کے درمیان تفریق کرا دی جایا کرے ۔ اور وہ عورت حاملہ تھی ۔ اور ان کا بیٹا اپنی ماں کی طرف منسوب کیا جاتا تھا ۔ بیان کیا کہ پھر ایسی عورت کے میراث کے بارے میں بھی یہ طریقہ شریعت کی طرف سے مقرر ہو گیا کہ بچہ اس کا وارث ہو گا اور وہ بچہ کی وارث ہو گی ۔ اس کے مطابق جو اللہ تعالیٰ نے وراثت کے سلسلہ میں فرض کیا ہے ۔ ابن جریج نے بیان کیا ، ان سے ابن شہاب نے اور ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے ، اسی حدیث میں کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا تھا کہ اگر ( لعان کرنے والی خاتون ) اس نے سرخ اور پستہ قد بچہ جنا جیسے وحرہ تو میں سمجھوں گا کہ عورت ہی سچی ہے اور اس کے شوہر نے اس پر جھوٹی تہمت لگائی ہے لیکن اگر کالا ، بڑی آنکھوں والا اور بڑے سرینوں والا بچہ جنا تو میں سمجھوں گا کہ شوہر نے اس کے متعلق سچ کہا تھا ۔ ( عورت جھوٹی ہے ) جب بچہ پیدا ہو تو وہ بری شکل کا تھا ( یعنی اس مرد کی صورت پر جس سے وہ بد نام ہوئی تھی ) ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 145130,
        "last_updated": null
    },
    {
        "urduURN": 4052350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5310,
        "hadithSanad": "ہم سے سعید بن عفیر نے بیان کیا ، کہا کہ مجھ سے لیث نے بیان کیا ، ان سے یحییٰ بن سعید نے ، ان سے عبدالرحمٰن بن قاسم نے ، ان سے قاسم بن محمد نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی مجلس میں لعان کا ذکر ہوا اور عاصم رضی اللہ عنہ نے اس سلسلہ میں کوئی بات کہی ( کہ میں اگر اپنی بیوی کے ساتھ کسی غیر مرد کو دیکھ لوں تو وہیں قتل کر دوں ) اور چلے گئے ، پھر ان کی قوم کے ایک صحابی ( عویمر ر ضی اللہ عنہ ) ان کے پاس آئے یہ شکایت لے کر کہ انہوں نے اپنی بیوی کے ساتھ ایک غیر مرد کو پایا ہے ۔ عاصم رضی اللہ عنہ نے کہا کہ مجھے آج یہ ابتلا میری اسی بات کی وجہ سے ہوا ہے ( جو آپ نے آنحضرت صلی اللہ علیہ وسلم کے سامنے کہی تھی ) پھر وہ انہیں لے کر حضور اکرم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آنحضرت صلی اللہ علیہ وسلم کو وہ واقعہ بتایا جس میں ملوث اس صحابی نے اپنی کو پایا تھا ۔ یہ صاحب زرد رنگ ، کم گوشت والے ( پتلے دبلے ) اور سیدھے بال والے تھے اور جس کے متعلق انہوں نے دعویٰ کیا تھا کہ اسے انہوں نے اپنی بیوی کے ساتھ ( تنہائی میں ) پایا ، وہ گھٹے ہوئے جسم کا ، گندمی اور بھر ے گوشت والا تھا ، پھر حضور اکرم صلی اللہ علیہ وسلم نے دعا فرمائی کہ اے اللہ ! اس معاملہ کو صاف کر دے ۔ چنانچہ اس عورت نے بچہ اسی مرد کی شکل کا جنا جس کے متعلق شوہر نے دعویٰ کیا تھا کہ اسے انہوں نے اپنی بیوی کے ساتھ پایا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے میاں بیوی کے درمیان لعان کرایا ۔ ایک شاگرد نے مجلس میں ابن عباس رضی اللہ عنہما سے پوچھا کیا یہی وہ عورت ہے جس کے متعلق حضور اکرم صلی اللہ علیہ وسلم نے فرمایا تھا کہ اگر میں کسی کو بلاشہادت کے سنگسار کر سکتا تو اس عورت کو سنگسار کرتا ۔ ابن عباس رضی اللہ عنہما نے کہا کہ نہیں ( یہ جملہ آنحضرت صلی اللہ علیہ وسلم نے ) اس عورت کے متعلق فرمایا تھا جس کی بدکاری اسلام کے زمانہ میں کھل گئی تھی ۔ ابوصالح اور عبداللہ بن یوسف نے اس حدیث میں بجائے خدلا کے کسرہ کے ساتھ دال خدلا روایت کیا ہے لیکن معنی وہی ہے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 145140,
        "last_updated": null
    },
    {
        "urduURN": 4052360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5311,
        "hadithSanad": "ہم سے عمرو بن زرارہ نے بیان کیا ، کہا ہم کو اسماعیل نے خبر دی ، انہیں ایوب نے ، ان سے سعید بن جبیر نے بیان کیا کہ",
        "hadithText": "میں نے حضرت ابن عباس رضی اللہ عنہما سے ایسے شخص کا حکم پوچھا جس نے اپنی بیوی پر تہمت لگائی ہو تو انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے بنی عجلان کے میاں بیوی کے درمیان ایسی صورت میں جدائی کرا دی تھی اور فرمایا تھا کہ اللہ خوب جانتا ہے کہ تم میں سے ایک جھوٹا ہے ، تو کیا تم میں سے ایک ( جو واقعی گناہ میں مبتلا ہو ) رجو ع کرے گا لیکن ان دونوں نے انکار کیا تو حضور اکرم صلی اللہ علیہ وسلم نے ان میں جدائی کر دی ۔ اور بیان کیا کہ مجھ سے عمرو بن دینار نے فرمایا کہ حدیث کے بعض اجزاء میرا خیال ہے کہ میں نے ابھی تم سے بیان نہیں کئے ہیں ۔ فرمایا کہ ان صاحب نے ( جنہوں نے لعان کیا تھا ) کہا کہ میرے مال کا کیا ہو گا ( جو میں نے مہر میں دیا تھا ) بیان کیا کہ اس پر ان سے کہا گیا کہ وہ مال ( جو عورت کو مہر میں دیا تھا ) اب تمہارا نہیں رہا ۔ اگر تم سچے ہو ( اس تہمت لگانے میں تب بھی کیونکہ ) تم اس عورت کے پاس تنہائی میں جا چکے ہو اور اگر تم جھوٹے ہو تب تو تم کو اور بھی مہر نہ ملنا چاہیئے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 145150,
        "last_updated": null
    },
    {
        "urduURN": 4052370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5312,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا کہ عمرو نے کہا کہ میں نے سعید بن جبیر سے سنا ، انہوں نے بیان کیا کہ میں نے حضرت ابن عمر رضی اللہ عنہما سے لعان کرنے والوں کا حکم پوچھا تو انہوں نے بیان کیا کہ",
        "hadithText": "ان کے متعلق رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا کہ تمہارا حساب تو اللہ تعالیٰ کے ذمہ ہے ، تم میں سے ایک جھوٹا ہے ۔ اب تمہیں تمہاری بیوی پر کوئی اختیار نہیں ۔ ان صحابی نے عرض کیا کہ میرا مال واپس کرا دیجئیے ( جو مہر میں دیا گیا تھا ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اب وہ تمہارا مال نہیں ہے ۔ اگر تم اس کے معاملہ میں سچے ہو تو تمہارا یہ مال اس کے بدلہ میں ختم ہو چکا کہ تم نے اس کی شرمگاہ کو حلال کیا تھا اور اگر تم نے اس پر جھوٹی تہمت لگائی تھی پھر تو وہ تم سے بعید تر ہے ۔ سفیان نے بیان کیا کہ یہ حدیث میں نے عمرو سے یادکی اور ایوب نے بیان کیا کہ میں نے سعید بن جبیر سے سنا ، کہا کہ میں نے ابن عمر رضی اللہ عنہما سے ایسے شخص کے متعلق پوچھا جس نے اپنی بیوی سے لعان کیا ہو تو آپ نے اپنی دو انگلیوں سے اشارہ کیا ۔ سفیان نے اس اشارہ کو اپنی دوشہادت اور بیچ کی انگلیوں کو جداکر کے بتایا کہ نبی کریم صلی اللہ علیہ وسلم نے قبیلہ بنی عجلان کے میاں بیوی کے درمیان جدائی کرائی تھی اور فرمایا تھا کہ اللہ جانتا ہے کہ تم میں سے ایک جھوٹا ہے ، تو کیا وہ رجوع کر لے گا ؟ آپ نے تین مرتبہ یہ فرمایا ۔ علی بن عبداللہ مدینی نے کہا کہ سفیان بن عیینہ نے مجھ سے کہا ، میں نے یہ حدیث جیسے عمرو بن دینار اور ایوب سے سن کر یاد رکھی تھی ویسی ہی تجھ سے بیان کر دی ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 145160,
        "last_updated": null
    },
    {
        "urduURN": 4052380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5313,
        "hadithSanad": "ہم سے ابراہیم بن المنذر نے بیان کیا ، کہا ہم سے انس بن عیاض نے بیان کیا ، ان سے عبیداللہ نے اور ان سے نافع نے کہ",
        "hadithText": "حضرت ابن عمر رضی اللہ عنہما نے انہیں خبر دی کہ نبی کریم صلی اللہ علیہ وسلم نے اس مرد اور اس کی بیوی کے درمیان جدائی کرا دی تھی جنہوں نے اپنی بیوی پر تہمت لگائی تھی اور دونوں سے قسم لی تھی ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 145170,
        "last_updated": null
    },
    {
        "urduURN": 4052390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5314,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے عبیداللہ نے ، کہا مجھے نافع نے خبر دی اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "قبیلہ انصار کے ایک صاحب اور ان کی بیوی کے درمیان رسول اللہ صلی اللہ علیہ وسلم نے لعان کرایا تھا اور دونوں کے درمیان جدائی کرا دی تھی ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 145180,
        "last_updated": null
    },
    {
        "urduURN": 4052400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5315,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہ ہم سے مالک نے ، کہا کہ مجھ سے نافع نے بیان کیا اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک صاحب اور ان کی بیوی کے درمیان لعان کرایا تھا ، پھر ان صاحب نے اپنی بیوی کے لڑکے کا انکار کیا تو آنحضرت صلی اللہ علیہ وسلم نے دونوں کے درمیان جدائی کرا دی اور لڑکا عورت کو دے دیا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 145190,
        "last_updated": null
    },
    {
        "urduURN": 4052410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5316,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، کہا کہ مجھ سے سلیمان بن بلال نے بیان کیا ، ان سے یحییٰ بن سعید نے ، کہا کہ مجھے عبدالرحمٰن بن قاسم نے خبر دی ، انہیں قاسم بن محمد نے اور انہیں ابن عباس رضی اللہ عنہما نے ، انہوں نے بیان کیا کہ",
        "hadithText": "لعان کرنے والوں کا ذکر نبی کریم صلی اللہ علیہ وسلم کی مجلس میں ہو اتو عاصم بن عدی رضی اللہ عنہ نے اس پر ایک بات کہی ( کہ اگر میں اپنی بیوی کے ساتھ کسی کو پاؤں تو وہیں قتل کر ڈالوں ) پھر واپس آئے تو ان کی قوم کے ایک صاحب ان کے پاس آئے اور ان سے کہا کہ میں نے اپنی بیوی کے ساتھ ایک غیر مرد کو پایا ہے ۔ عاصم رضی اللہ عنہ نے کہا کہ اس معاملہ میں میرا یہ ابتلاء میری اس بات کی وجہ سے ہوا ہے ( جس کے کہنے کی جرات میں نے حضور اکرم صلی اللہ علیہ وسلم کے سامنے کی تھی ) پھر وہ ان صاحب کو ساتھ لے کر آنحضرت صلی اللہ علیہ وسلم کے پاس گئے اور آنحضرت صلی اللہ علیہ وسلم کو اس صورت سے مطلع کیا جس میں انہوں نے اپنی بیوی کو پایا تھا ۔ یہ صاحب زرد رنگ ، کم گوشت والے اور سیدھے بالوں والے تھے اور وہ جسے انہوں نے اپنی بیوی کے پاس پایا تھا گندمی گھٹے جسم کا زرد ، بھرے گوشت والا تھا اس کے بال بہت زیادہ گھونگھریالے تھے ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا ، اے اللہ ! معاملہ صاف کر دے چنانچہ ان کی بیوی نے جو بچہ جنا وہ اسی شخص سے مشابہ تھا جس کے متعلق شوہر نے کہا تھا کہ انہوں نے اپنی بیوی کے پاس اسے پایا تھا ۔ پھر حضور اکرم صلی اللہ علیہ وسلم نے دونوں کے درمیان لعان کرایا ۔ ابن عباس رضی اللہ عنہما سے ایک شاگرد نے مجلس میں پوچھا ، کیا یہ وہی عورت ہے جس کے متعلق حضور اکرم صلی اللہ علیہ وسلم نے فرمایا تھا کہ اگر میں کسی کو بلاشہادت سنگسار کرتا تو اسے کرتا ؟ ابن عباس رضی اللہ عنہما نے کہا کہ نہیں ۔ یہ دوسری عورت تھی جو اسلام کے زمانہ میں اعلانیہ بدکاری کیا کرتی تھی ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 145200,
        "last_updated": null
    },
    {
        "urduURN": 4052420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5317,
        "hadithSanad": "ہم سے عمرو بن علی نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، کہا ہم سے ہشام نے بیان کیا ، کہا کہ مجھ سے میرے والد نے بیان کیا اور ان سے حضرت عائشہ رضی اللہ عنہا نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے ( دوسری سند اور حضرت امام بخاری رحمہ اللہ نے کہا کہ ) ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے عبدہ نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "رفاعہ قرظی رضی اللہ عنہ نے ایک خاتون سے نکاح کیا ، پھر انہیں طلاق دے دی ، اس کے بعد ایک دوسرے صاحب نے ان خاتون سے نکاح کر لیا ، پھر وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور اپنے دوسرے شوہر کا ذکر کیا اور کہا کہ وہ تو ان کے پاس آتے ہی نہیں اور یہ کہ ان کے پاس کپڑے کے پلو جیسا ہے ( انہوں نے پہلے شوہر کے ساتھ دوبارہ نکاح کی خواہش ظاہر کی لیکن ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ۔ جب تک تم اس ( دوسرے شوہر ) کا مزا نہ چکھ لو اور یہ تمہارا مزا نہ چکھ لیں ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 145210,
        "last_updated": null
    },
    {
        "urduURN": 4052430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5318,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے جعفربن ربیعہ نے ، ان سے عبدالرحمٰن بن ہرمز نے ، کہا کہ مجھے خبر دی ابوسلمہ بن عبدالرحمٰن نے کہ زینب ام سلمہ رضی اللہ عنہا نے اپنی والدہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ام سلمہ رضی اللہ عنہا سے خبر دی کہ",
        "hadithText": "ایک خاتون جو اسلام لائی تھیں اور جن کا نام سبیعہ تھا ، اپنے شوہر کے ساتھ رہتی تھیں ، شوہر کا جب انتقال ہوا تو وہ حاملہ تھیں ۔ ابو سنان بن بعکک رضی اللہ عنہ نے ان کے پاس نکاح کا پیغام بھیجا لیکن انہوں نے نکاح کرنے سے انکار کیا ۔ ابو السنابل نے کہا کہ اللہ کی قسم ! جب تک عدت کی دو مدتوں میں سے لمبی نہ گزارلوں گی ، تمہارے لیے اس سے ( جس سے نکاح وہ کرنا چاہتی تھیں ) نکاح کرنا صحیح نہیں ہو گا ۔ پھر وہ ( وضع حمل کے بعد ) تقریباً دس دن تک رکی رہیں ۔ اس کے بعد حضور اکرم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اب نکاح کر لو ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 145220,
        "last_updated": null
    },
    {
        "urduURN": 4052440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5319,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، ان سے لیث نے ، ان سے یزید نے کہ ابن شہاب نے انہیں لکھا کہ عبیداللہ بن عبداللہ نے اپنے والد ( عبداللہ بن عتبہ بن مسعود ) سے انہیں خبر دی کہ انہوں نے ابن الارقم کو لکھا کہ سبیعہ اسلمیہ سے پوچھیں کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ان کے متعلق کیا فتویٰ دیا تھا تو انہوں نے فرمایا کہ جب میرے یہاں بچہ پیدا ہو گیا تو آنحضرت نے مجھے فتویٰ دیا کہ اب میں نکاح کر لوں ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 145230,
        "last_updated": null
    },
    {
        "urduURN": 4052450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5320,
        "hadithSanad": "ہم سے یحییٰ بن قزعہ نے بیان کیا ، کہا ہم سے امام مالک نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے ، ان سے مسور بن مخرمہ نے کہ",
        "hadithText": "سبیعہ اسلمیہ اپنے شوہر کی وفات کے بعد چند دنوں تک حالت نفاس میں رہیں ، پھر نبی کریم صلی اللہ علیہ وسلم کے پاس آ کر انہوں نے نکاح کی اجازت مانگی تو آنحضرت صلی اللہ علیہ وسلم نے انہیں اجازت دی اور انہوں نے نکاح کیا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 145240,
        "last_updated": null
    },
    {
        "urduURN": 4052460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا ہم سے امام مالک نے بیان کیا ، کہا ہم سے یحییٰ بن سعید انصاری نے ، ان سے قاسم بن محمد اور سلیمان بن یسار نے ، وہ دونوں بیان کرتے تھے کہ",
        "hadithText": "یحییٰ بن سعید بن العاص نے عبدالرحمٰن بن حکم کی صاحبزادی ( عمرہ ) کو طلاق دے دی تھی اور ان کے باپ عبدالرحمٰن انہیں ان کے ( شوہر کے ) گھر سے لے آئے ( عدت کے ایام گزرنے سے پہلے ) عائشہ رضی اللہ عنہا کو جب معلوم ہوا تو انہوں نے مروان بن حکم کے یہاں ، جو اس وقت مدینہ کا امیر تھا ، کہلوایا کہ اللہ سے ڈرو اور لڑکی کو اس کے گھر ( جہاں اسے طلاق ہوئی ہے ) پہنچا دو ، جیسا کہ سلیمان بن یسار کی حدیث میں ہے ۔ مروان نے اس کو جواب یہ دیا کہ لڑکی کے والد عبدالرحمٰن بن حکم نے میری بات نہیں مانی اور قاسم بن محمد نے بیان کیا کہ ( مروان نے ام المؤمنین کو یہ جواب دیا کہ ) کیا آپ کو فاطمہ بنت قیس رضی اللہ عنہا کے معاملہ کا علم نہیں ہے ؟ ( انہوں نے بھی اپنے شوہر کے گھر عدت نہیں گزاری تھی ) عائشہ رضی اللہ عنہا نے بتلایا کہ اگر تم فاطمہ کے واقعہ کا حوالہ نہ دیتے تب بھی تمہارا کچھ نہ بگڑ تا ( کیونکہ وہ تمہارے لیے دلیل نہیں بن سکتا ) مروان بن حکم نے اس پر کہا کہ اگر آپ کے نزدیک ( فاطمہ رضی اللہ عنہا کا ان کے شوہر کے گھر سے منتقل کرنا ) ان کے اور ان کے شوہر کے رشتہ داری کے درمیان کشیدگی کی وجہ سے تھا تو یہاں بھی یہی وجہ کافی ہے کہ دونوں ( میاں بیوی ) کے درمیان کشیدگی تھی ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 145250,
        "last_updated": null
    },
    {
        "urduURN": 4052470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر محمد بن جعفر نے بیان کیا ، کہا ہم سے شعبہ بن حجاج نے بیان کیا ، ان سے عبدالرحمٰن بن قاسم نے ، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے کہا",
        "hadithText": "فاطمہ بنت قیس خدا سے ڈرتی نہیں ! ان کااشارہ ان کے اس قول کی طرف تھا ( کہ مطلقہ بائنہ کو ) نفقہ وسکنٰی دینا ضروری نہیں جو کہتی ہے کہ طلاق بائن جس عورت پر پڑے اسے مسکن اور خرچہ نہیں ملے گا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 145260,
        "last_updated": null
    },
    {
        "urduURN": 4052480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عمرو بن عباس نے بیان کیا ، کہا ہم سے ابن مہدی نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے عبدالرحمٰن بن قاسم نے ، ان سے ان کے والد نے کہ عروہ بن زبیر نے حضرت عائشہ رضی اللہ عنہا سے کہا کہ",
        "hadithText": "آپ فلانہ ( عمرہ ) بنت حکم کا معاملہ نہیں دیکھتیں ۔ ان کے شوہر نے انہیں طلاق بائنہ دے دی اور وہ وہاں سے نکل آئیں ( عدت گزارے بغیر ) حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ جو کچھ اس نے کیا بہت برا کیا ۔ عروہ نے کہا آپ نے فاطمہ رضی اللہ عنہا کے واقعہ کے متعلق نہیں سنا ۔ بتلایا کہ اس کے لیے اس حدیث کو ذکر کرنے میں کوئی خیرنہیں ہے اورابن ابی زناد نے ہشام سے یہ اضافہ کیا ہے اور ان سے ان کے والد نے بیان کیا کہ حضرت عائشہ رضی اللہ عنہا نے ( عمرہ بنت حکم کے معاملہ پر ) اپنی شدید نا گواری کا اظہار فرمایا اور فرمایا کہ فاطمہ بنت قیس رضی اللہ عنہ تو ایک اجاڑ جگہ میں تھیں اور اس کے چاروں طرف خوف اوروحشت برستی تھی ، اس لیے نبی کریم صلی اللہ علیہ وسلم نے ( وہاں سے منتقل ہونے کی ) انہیں اجازت دے دی تھی ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 145270,
        "last_updated": null
    },
    {
        "urduURN": 4052490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "مجھ سے حبان بن موسیٰ نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو ابن جریج نے خبر دی ، انہیں ابن شہاب نے ، انہیں عروہ نے کہ",
        "hadithText": "عائشہ رضی اللہ عنہا نے فاطمہ بنت قیس رضی اللہ عنہ کی اس بات کا ( کہ مطلقہ بائنہ کو نفقہ وسکنٰی نہیں ملے گا ) انکار کیا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 145290,
        "last_updated": null
    },
    {
        "urduURN": 4052500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5329,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ بن حجاج نے ، ان سے حکم بن عتبہ نے ، ان سے ابراہیم نخعی نے ، ان سے اسود بن یزید نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم نے ( حجۃ الوداع میں ) کوچ کا ارادہ کیا تو دیکھا کہ صفیہ رضی اللہ عنہا اپنے خیمہ کے دروازے پر غمگین کھڑی ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا ” عقریٰ “ یا ( فرمایا راوی کو شک تھا ) ” حلقٰی “ معلوم ہوتا ہے کہ تم ہمیں روک دوگی ، کیا تم نے قربانی کے دن طواف کر لیا ہے ؟ انہوں نے عرض کی کہ جی ہاں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر چلو ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 145300,
        "last_updated": null
    },
    {
        "urduURN": 4052510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5330,
        "hadithSanad": "مجھ سے محمد بن سلام نے بیان کیا ، کہا ہم کو عبدالوہاب ثقفی نے خبر دی ، ان سے یونس بن عبید نے بیان کیا ، ان سے امام حسن بصری نے بیان کیا کہ",
        "hadithText": "معقل بن یسار رضی اللہ عنہ نے اپنی بہن جمیلہ کا نکاح کیا ، پھر ( ان کے شوہر نے ) انہیں ایک طلاق دی ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 145310,
        "last_updated": null
    },
    {
        "urduURN": 4052520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5331,
        "hadithSanad": "مجھ سے محمد بن مثنٰی نے بیان کیا ، کہا ہم سے عبدالاعلیٰ نے بیان کیا ، کہا ہم سے سعید بن ابی عروبہ نے ، ان سے قتادہ نے ، کہا ہم سے امام حسن بصری نے بیان کیا کہ",
        "hadithText": "معقل بن یساررضی اللہ عنہ کی بہن ایک آدمی کے نکاح میں تھیں ، پھر انہوں نے انہیں طلاق دے دی ، اس کے بعد انہوں نے تنہائی میں عدت گزاری ۔ عدت کے دن جب ختم ہو گئے تو ان کے پہلے شوہر نے ہی پھر معقل رضی اللہ عنہ کے پاس ان کے لیے نکاح کا پیغام بھیجا ۔ معقل کو اس پر بڑی غیرت آئی ۔ انہوں نے کہا جب وہ عدت گزار رہی تھی تو اسے اس پر قدرت تھی ( کہ دوران عدت میں رجعت کر لیں لیکن ایسا نہیں کیا ) اور اب میرے پاس نکاح کا پیغام بھیجتا ہے ۔ چنانچہ وہ ان کے اور اپنی بہن کے درمیان میں حائل ہو گئے ۔ اس پر یہ آیت نازل ہوئی ۔ ” اور جب تم اپنی عورتوں کوطلاق دے چکو اور وہ اپنی مدت کو پہنچ چکیں تو تم انہیں مت روکو “ آخر آیت تک “ پھر رسول اللہ صلی اللہ علیہ وسلم نے انہیں بلا کر یہ آیت سنائی تو انہوں نے ضد چھوڑ دی اور اللہ کے حکم کے سامنے جھک گئے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 145320,
        "last_updated": null
    },
    {
        "urduURN": 4052530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5332,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے نافع نے اور ان سے ابن عمر بن خطاب رضی اللہ عنہما نے کہ",
        "hadithText": "انہوں نے اپنی بیوی کو ایک طلاق دی تو اس وقت وہ حائضہ تھیں ۔ رسول اللہ صلی اللہ علیہ وسلم نے ان کو حکم دیا کہ رجعت کر لیں اور انہیں اس وقت تک اپنے ساتھ رکھیں جب تک وہ اس حیض سے پاک ہونے کے بعد پھر دوبارہ حائضہ نہ ہوں ۔ اس وقت بھی ان سے کوئی تعرض نہ کریں اور جب وہ اس حیض سے بھی پاک ہو جائیں تو اگر اس وقت انہیں طلاق دینے کا ارادہ ہو تو طہر میں اس سے پہلے کہ ان سے ہمبستری کریں ، طلاق دیں ۔ پس یہی وہ وقت ہے جس کے متعلق اللہ تعالیٰ نے حکم دیا ہے کہ اس میں عورتوں کو طلاق دی جائے اور عبداللہ بن عمر رضی اللہ عنہما سے اگر اس کے ( مطلقہ ثلاثہ کے ) بارے میں سوال کیا جاتا تو سوال کرنے والے سے وہ کہتے کہ اگر تم نے تین طلاقیں دے دی ہیں تو پھر تمہاری بیوی تم پر حرام ہے ۔ یہاں تک کہ وہ تمہارے سوا دوسرے شوہر سے نکاح کرے ۔ غیر قتیبۃ ( ابو الجہم ) کے اس حدیث میں لیث سے یہ اضافہ کیا ہے کہ ( انہوں نے بیان کیا کہ ) مجھ سے نافع نے بیان کیا اور ان سے ابن عمر رضی اللہ عنہما نے کہا کہ اگر تم نے اپنی بیوی کو ایک یا دو طلاق دے دی ہو ۔ تو تم اسے دوبارہ اپنے نکاح میں لا سکتے ہو ) کیونکہ نبی کریم صلی اللہ علیہ وسلم نے مجھے اس کا حکم دیا تھا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 145330,
        "last_updated": null
    },
    {
        "urduURN": 4052540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5333,
        "hadithSanad": "ہم سے حجاج نے بیان کیا ، کہا ہم سے یزید بن ابراہیم نے بیان کیا ، کہا ہم سے محمد بن سیرین نے بیان کیا ، کہا مجھ سے یونس بن جبیر نے بیان کیا کہ",
        "hadithText": "میں نے ابن عمر رضی اللہ عنہما سے پوچھا تو انہوں نے بتلایا کہ ابن عمر رضی اللہ عنہما نے اپنی بیوی کو طلاق دے دی ، اس وقت وہ حائضہ تھیں ۔ پھر حضرت عمر رضی اللہ عنہ نے اس کے متعلق نبی کریم صلی اللہ علیہ وسلم سے پوچھا تو آنحضرت صلی اللہ علیہ وسلم نے حکم دیا کہ ابن عمر رضی اللہ عنہما اپنی بیوی سے رجوع کر لیں ، پھر جب طلاق کا صحیح وقت آئے تو طلاق دیں ( یونس بن جبیر نے بیان کیا کہ ابن عمر رضی اللہ عنہما سے ) میں نے پوچھا کہ کیا اس طلاق کا بھی شمار ہوا تھا ؟ انہوں نے بتلایا کہ اگر کوئی طلاق دینے والا شرع کے احکام بجا لانے سے عاجز ہو یا احمق بیوقوف ہو ( تو کیا طلاق نہیں پڑے گی ؟ ) ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 145340,
        "last_updated": null
    },
    {
        "urduURN": 4052550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5334,
        "hadithSanad": "زینب رضی اللہ عنہا نے بیان کیاکہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ام حبیبہ رضی اللہ عنہا کے پاس اس وقت گئی جب ان کے والد ابوسفیان بن حرب رضی اللہ عنہ کا انتقال ہوا تھا ۔ ام حبیبہ نے خوشبو منگوائی جس میں خلوق خوشبو کی زردی یا کسی اور چیز کی ملاوٹ تھی ، پھر وہ خوشبو ایک لونڈی نے ان کو لگائی اور ام المؤمنین نے خود اپنے رخساروں پر اسے لگایا ۔ اس کے بعد کہا کہ واللہ ! مجھے خوشبو کے استعمال کی کوئی خواہش نہیں تھی لیکن میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ کسی عورت کے لیے جو اللہ اور آخرت کے دن پر ایمان رکھتی ہو جائز نہیں کہ وہ تین دن سے زیادہ کسی کا سوگ منائے سوا شوہر کے ( کہ اس کا سوگ ) چار مہینے دس دن کا ہے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 145350,
        "last_updated": null
    },
    {
        "urduURN": 4052560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5335,
        "hadithSanad": "حضرت زینب رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "اس کے بعد میں ام المؤمنین زینب بنت جحش رضی اللہ عنہا کے یہاں اس وقت گئی جب ان کے بھائی کا انتقال ہوا ۔ انہوں نے بھی خوشبو منگوائی اور استعمال کیا کہا کہ واللہ ! مجھے خوشبو کے استعمال کی کوئی خواہش نہیں تھی لیکن میں نے رسول اللہ صلی اللہ علیہ وسلم کو برسر منبر یہ فرماتے سنا ہے کہ کسی عورت کے لیے جو اللہ اور آخرت کے دن پر ایمان رکھتی ہو یہ جائز نہیں کہ کسی میت پر تین دن سے زیادہ سوگ منائے ، صرف شوہر کے لیے چار مہینے دس دن کا سوگ ہے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 145360,
        "last_updated": null
    },
    {
        "urduURN": 4052570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5336,
        "hadithSanad": "زینب بنت ام سلمہ رضی اللہ عنہا نے کہا کہ میں نے ام سلمہ رضی اللہ عنہا کو بھی یہ کہتے سنا کہ",
        "hadithText": "ایک خاتون رسول اللہ صلی اللہ علیہ وسلم کے پاس آئیں اور عرض کیا یا رسول اللہ ! میری لڑکی کے شوہر کا انتقال ہو گیا ہے اور اس کی آنکھوں میں تکلیف ہے تو کیا وہ سرمہ لگا سکتی ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ نہیں ، دو تین مرتبہ ( آپ نے یہ فرمایا ) ہر مرتبہ یہ فرماتے تھے کہ نہیں ! پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ ( شرعی عدت ) چار مہینے اور دس دن ہی کی ہے ۔ جاہلیت میں تو تمہیں سال بھر تک مینگنی پھینکنی پڑتی تھی ( جب کہیں عدت سے باہر ہوتی تھی ) ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 145370,
        "last_updated": null
    },
    {
        "urduURN": 4052580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5337,
        "hadithSanad": "حمید نے بیان کیا کہ میں نے زینب بنت ام سلمہ رضی اللہ عنہا سے پوچھا کہ",
        "hadithText": "اس کا کیا مطلب ہے کہ ” سال بھر تک مینگنی پھینکنی پڑتی تھی ؟ “ انہوں نے فرمایا کہ زمانہ جاہلیت میں جب کسی عورت کا شوہر مر جاتا تو وہ ایک نہایت تنگ وتاریک کو ٹھڑی میں داخل ہو جاتی ۔ سب سے برے کپڑے پہنتی اور خوشبو کا استعمال ترک کر دیتی ۔ یہاں تک کہ اسی حالت میں ایک سال گزر جاتا پھر کسی چوپائے گدھے یا بکری یا پرندہ کو اس کے پاس لایا جاتا اور وہ عدت سے باہر آنے کے لیے اس پر ہاتھ پھیرتی ۔ ایسا کم ہوتا تھا کہ وہ کسی جانور پر ہاتھ پھیر دے اور وہ مر نہ جائے ۔ اس کے بعد وہ نکالی جاتی اور اسے مینگنی دی جاتی جسے وہ پھینکتی ۔ اب وہ خوشبو وغیرہ کوئی بھی چیز استعمال کر سکتی تھی ۔ امام مالک سے پوچھا گیا کہ ” تفتض بہ “ کا کیا مطلب ہے تو آپ نے فرمایا وہ اس کا جسم چھوتی تھی ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 145380,
        "last_updated": null
    },
    {
        "urduURN": 4052590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5339,
        "hadithSanad": "sanad",
        "hadithText": "ایک مسلمان عورت جو اللہ اورآخرت کے دن پر ایمان رکھتی ہو ۔ اس کے لیے جائز نہیں کہ وہ کسی ( کی وفات ) کا سوگ تین دن سے زیادہ منائے سوا شوہر کے کہ اس کے لیے چار مہینے دس دن ہیں ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 145400,
        "last_updated": null
    },
    {
        "urduURN": 4052600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5340,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے بشر نے بیان کیا ، کہا ہم سے سلمہ بنت علقمہ نے بیان کیا ، ان سے محمد بن سیرین نے کہ ام عطیہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "ہمیں منع کیا گیا ہے کہ شوہر کے سوا کسی کا سوگ تین دن سے زیادہ منائیں ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 145410,
        "last_updated": null
    },
    {
        "urduURN": 4052610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5341,
        "hadithSanad": "مجھ سے عبداللہ بن عبدالوہاب نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب نے ، ان سے حفصہ نے اور ان سے ام عطیہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "ہمیں اس سے منع کیا گیا کہ کسی میت کا تین دن سے زیادہ سوگ منائیں سوا شوہر کے کہ اس کے لیے چار مہینے دس دن کی عدت تھی ۔ اس عرصہ میں ہم نہ سرمہ لگا تے نہ خوشبو استعمال کرتے اور نہ رنگا کپڑا پہنتے تھے ۔ البتہ وہ کپڑا اس سے الگ تھا جس کا ( دھاگا ) بننے سے پہلے ہی رنگ دیا گیا ہو ۔ ہمیں اس کی اجازت تھی کہ اگر کوئی حیض کے بعد غسل کرے تو اس وقت اظفار کا تھوڑا سا عود استعمال کر لے اور ہمیں جنازہ کے پیچھے چلنے کی بھی ممانعت تھی ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 145420,
        "last_updated": null
    },
    {
        "urduURN": 4052620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5342,
        "hadithSanad": "ہم سے فضل بن دکین نے بیان کیا ، کہا ہم سے عبدالسلام بن حرب نے بیان کیا ، ان سے ہشام بن حسان نے ، ان سے حفصہ بنت سیرین نے اور ان سے ام عطیہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو عورت اللہ اور آخرت کے دن پر ایمان رکھتی ہو اس کے لیے جائز نہیں کہ تین دن سے زیادہ کسی کا سوگ منائے سوا شوہر کے وہ اس کے سوگ میں نہ سرمہ لگائے نہ رنگا ہوا کپڑا پہنے مگر یمن کا دھاری دار کپڑا ( جو بننے سے پہلے ہی رنگا گیا ہو )</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 145430,
        "last_updated": null
    },
    {
        "urduURN": 4052630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5343,
        "hadithSanad": "امام بخاری کے شیخ انصاری نے بیان کیا کہ ہم سے ہشام بن حسان نے بیان کیا ، کہا ہم سے حفصہ بنت سیرین نے اور ان سے ام عطیہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے منع فرمایا ( کسی میت پر ) خاوند کے سوا تین دن سے زیادہ سوگ کرنے سے اور ( فرمایا کہ ) خوشبو کا استعمال نہ کرے ، سوا طہر کے وقت جب حیض سے پاک ہو تو تھوڑا سا عود ( قسط ) اور ( مقام ) اظفار ( کی خوشبو استعمال کر سکتی ہے ) ابوعبداللہ ( حضرت امام بخاری ) کہتے ہیں کہ ” قسط “ اور ” الکست “ ایک ہی چیز ہیں ، جیسے ” کافور “ اور ” قافور “ دونوں ایک ہیں ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 145440,
        "last_updated": null
    },
    {
        "urduURN": 4052640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5344,
        "hadithSanad": "مجھ سے اسحاق بن منصور نے بیان کیا ، کہا ہم کو روح بن عبادہ نے خبر دی ، کہا ہم سے شبل بن عباد نے ، ان سے ابن ابی نجیح نے اور ان سے مجاہد نے",
        "hadithText": "آیت کریمہ ” والذین یتوفون “ الخ ، یعنی اور جو لوگ تم میں سے وفات پا جائیں اور بیویاں چھوڑ جائیں ۔ “ کے متعلق کہا کہ یہ عدت جو شوہر کے گھر والوں کے پاس گزاری جاتی تھی ، پہلے واجب تھی ، اس لیے اللہ تعالیٰ نے یہ آیت اتاری ” والذین یتوفون منکم “ الخ ، یعنی ” اور جو لوگ تم میں سے وفات پا جائیں اور بیویاں چھوڑ جائیں ( ان پر لازم ہے کہ ) اپنی بیویوں کے حق میں نفع اٹھانے کی وصیت کر جائیں کہ وہ ایک سال تک ( گھر سے ) نہ نکالی جائیں لیکن اگر وہ ( خود ) نکل جائیں تو کوئی گناہ تم پر نہیں ۔ “ اس باب میں جسے وہ ( بیویاں ) اپنے بارے میں دستور کے مطابق کریں ۔ مجاہد نے کہا کہ اللہ تعالیٰ نے ایسی بیوہ کے لیے سات مہینے بیس دن سال بھر میں سے وصیت قرار دی ۔ اگر وہ چاہے تو شوہر کی وصیت کے مطابق وہیں ٹھہر ی رہے اور اگر چاہے ( چار مہینے دس دن کی عدت ) پوری کر کے وہاں سے چلی جائے ۔ اللہ تعالیٰ کے ارشاد ” غیر اخراج “ تک یعنی انہیں نکالا نہ جائے ۔ البتہ اگر وہ خود چلی جائیں تو تم پر کوئی گناہ نہیں “ کا یہی منشا ہے ۔ پس عدت تو جیسی کہ پہلی تھی ، اب بھی اس پر واجب ہے ۔ ابن ابی نجیح نے اسے مجاہد سے بیان کیا اور عطاء نے بیان کیا کہ حضرت ابن عباس رضی اللہ عنہما نے کہا کہ اس پہلی آیت نے بیوہ کو خاوند کے گھر میں عدت گزارنے کے حکم کو منسوخ کر دیا ، اس لیے اب وہ جہاں چاہے عدت گزارے اور ( اسی طرح اس آیت نے ) اللہ تعالیٰ کے ارشاد ” غیر اخراج “ یعنی ” انہیں نکالا نہ جائے “ ( کو بھی منسوخ کر دیا ہے ) عطاء نے کہا کہ اگر وہ چاہے تو اپنے ( شوہر کے ) گھر والوں کے یہاں ہی عدت گزارے اور وصیت کے مطابق قیام کرے اور اگر چاہے وہاں سے چلی آئے کیونکہ اللہ تعالیٰ نے فرمایا ہے ۔ فلیس علیکم جناح الخ ، یعنی ” پس تم پر اس کا کوئی گناہ نہیں ، جو وہ اپنی مرضی کے مطابق کریں “ عطاء نے کہا کہ اس کے بعد میراث کا حکم نازل ہوا اور اس نے مکان کے حکم کو منسوخ کر دیا ۔ پس وہ جہاں چاہے عدت گزار سکتی ہے اور اس کے لیے ( شوہر کی طرف سے ) مکان کا انتظام نہیں ہو گا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 145450,
        "last_updated": null
    },
    {
        "urduURN": 4052650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5345,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ، ان سے سفیان ثوری نے بیان کیا ، ان سے عبداللہ بن ابی بکر بن عمرو بن حزم نے بیان کیا ، ان سے حمید بن نافع نے بیان ، ان سے زینب بنت ام سلمہ رضی اللہ عنہما نے بیان کیا اور ان سے ام حبیبہ بنت ابی سفیان رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "جب ان کے والد کی وفات کی خبر پہنچی تو انہوں نے خوشبو منگوائی اور اپنے دونوں بازؤں پر لگائی پھر کہا کہ مجھے خوشبو کی کوئی ضرورت نہ تھی لیکن میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے کہ جو عورت اللہ اور آخرت پر ایمان رکھتی ہو وہ کسی میت کا تین دن سے زیادہ سوگ نہ منائے سوا شوہر کے کہ اس کے لیے چار مہینے دس دن ہیں ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 145460,
        "last_updated": null
    },
    {
        "urduURN": 4052660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5346,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے زہری نے ، ان سے ابوبکر بن عبدالرحمٰن نے اور ان سے ابومسعود رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے کتے کی قیمت ، کاہن کی کمائی اور زانیہ عورت کے زنا کی کمائی کھانے سے منع فرمایا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 145470,
        "last_updated": null
    },
    {
        "urduURN": 4052670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5347,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ بن حجاج نے بیان کیا ، کہا ہم سے عون بن ابی جحیفہ نے بیان کیا ، ان سے ان کے والد نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے گود نے والی اور گدوانے والی ، سود کھانے والے اور کھلانے والے پر لعنت بھیجی اور آپ نے کتے کی قیمت اور زانیہ کی کمائی کھانے سے منع فرمایا اور تصویر بنانے والوں پر لعنت کی ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 145480,
        "last_updated": null
    },
    {
        "urduURN": 4052680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5348,
        "hadithSanad": "ہم سے علی بن جعد نے بیان کیا ، انہوں نے کہا ہم کو شعبہ نے خبر دی ، انہیں محمد بن جحادہ نے ، انہیں ابوحازم نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے لونڈیوں کی زنا کی کمائی سے منع فرمایا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 145490,
        "last_updated": null
    },
    {
        "urduURN": 4052690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5349,
        "hadithSanad": "ہم سے عمرو بن زرارہ نے بیان کیا ، کہا ہم کو اسماعیل بن علیہ نے خبر دی ، انہیں ایوب سختیانی نے اور ان سے سعید بن کبیر نے بیان کیا کہ",
        "hadithText": "میں نے ابن عمر رضی اللہ عنہما سے ایسے شخص کے بارے میں سوال کیا جس نے اپنی بیوی پر تہمت لگائی ہو تو انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے بنی عجلان قبیلہ کے میاں بیوی میں جدائی کرا دی تھی اور فرمایا تھا کہ اللہ خوب جانتا ہے کہ تم میں سے ایک جھوٹا ہے ، تو کیا وہ رجوع کرے گا ؟ لیکن دونوں نے انکار کیا ، آپ نے دوبارہ فرمایا کہ اللہ خوب جانتا ہے اسے جو تم میں سے ایک جھوٹا ہے وہ توبہ کرتا ہے یا نہیں ؟ لیکن دونوں نے پھر توبہ سے انکار کیا ۔ پس آنحضرت صلی اللہ علیہ وسلم نے ان میں جدائی کرا دی ۔ ایوب نے بیان کیا کہ مجھ سے عمرو بن دینار نے کہا کہ یہاں حدیث میں ایک چیز اورہے میں نے تمہیں اسے بیان کرتے نہیں دیکھا ۔ وہ یہ ہے کہ ( تہمت لگانے والے ) شوہر نے کہا تھا کہ میرا مال ( مہر ) دلوا دیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ وہ تمہارا مال ہی نہیں رہا ۔ اگر تم سچے بھی ہو تو تم اس سے خلوت کر چکے ہوا اور اگر جھوٹے ہو تب تو تم کو بطریق اولیٰ کچھ نہ ملنا چاہیئے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 145500,
        "last_updated": null
    },
    {
        "urduURN": 4052700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 67,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5350,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے ، ان سے سعید بن جبیر نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے لعان کرنے والے میاں بیوی سے فرمایا کہ تمہارا حساب اللہ کے یہاں ہو گا ۔ تم میں سے ایک تو یقیناً جھوٹا ہے ۔ تمہارے یعنی ( شوہر کے ) لیے اسے ( بیوی کو ) حاصل کرنے کا اب کوئی راستہ نہیں ہے ۔ شوہر نے عرض کیا یا رسول اللہ ! میرا مال ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اب وہ تمہارا مال نہیں رہا ۔ اگر تم نے اس کے متعلق سچ کہا تھا تو وہ اس کے بدلہ میں ہے کہ تم نے اس کی شرمگاہ اپنے لئے حلال کی تھی اور اگر تم نے اس پر جھوٹی تہمت لگائی تھی تب تو اور زیادہ تجھ کو کچھ نہ ملنا چاہیئے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 145510,
        "last_updated": null
    },
    {
        "urduURN": 4052095,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 68,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5284,
        "hadithSanad": "ہم سے عبداللہ بن رجاء نے بیان کیا ، کہا ہم کو شعبہ نے خبر دی ، انہیں حکم نے ، انہیں ابراہیم نخعی سے اور وہ اسود سے کہ",
        "hadithText": "عائشہ رضی اللہ عنہا نے بریرہ رضی اللہ عنہ کو خریدنے کا ارادہ کیا لیکن ان کے مالکوں نے کہا کہ وہ اسی شرط پر انہیں بیچ سکتے ہیں کہ بریرہ کا ترکہ ہم لیں اور ان کے ساتھ ولاء ( آزادی کے بعد ) انہیں سے قائم ہو ۔ عائشہ رضی اللہ عنہا نے جب اس کا ذکر نبی کریم صلی اللہ علیہ وسلم سے کیا تو آپ نے فرمایا کہ انہیں خریدکر آزاد کر دو ترکہ تو اسی کو ملے گا جو لونڈی غلام کو آزاد کرے اور ولاء بھی اسی کے ساتھ قائم ہو سکتی ہے جو آزاد کرے اور نبی کریم صلی اللہ علیہ وسلم کے سامنے گوشت لایا گیا پھر کہا کہ یہ گوشت بریرہ رضی اللہ عنہا کو صدقہ کیا گیا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ وہ ان کے لیے صدقہ ہے اور ہمارے لیے ان کا تحفہ ہے ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 144860,
        "last_updated": null
    },
    {
        "urduURN": 4052585,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 68,
        "bookName": null,
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5338,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے ، کہا ہم سے حمید بن نافع نے ، ان سے زینب بنت ام سلمہ رضی اللہ عنہا نے اپنی والدہ سے کہ",
        "hadithText": "ایک عورت کے شوہر کا انتقال ہو گیا ، اس کے بعد اس کی آنکھ میں تکلیف ہوئی تو اس کے گھر والے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آپ سے سرمہ لگانے کی اجازت مانگی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ سرمہ ( زمانہ عدت میں ) نہ لگاؤ ۔ ( زمانہ جاہلیت میں ) تمہیں بدترین کپڑے میں وقت گزارنا پڑتا تھا ، یا ( راوی کو شک تھا کہ یہ فرمایا کہ ) بدترین گھر میں وقت ( عدت ) گزارنا پڑتا تھا ۔ جب اس طرح ایک سال پورا ہو جاتا تو اس کے پاس سے کتا گزرتا اور وہ اس پر مینگنی پھینکتی ( جب عدت سے باہر آتی ) پس سرمہ نہ لگاؤ ۔ یہاں تک کہ چار مہینے دس دن گزر جائیں اور میں نے زینب بنت ام سلمہ سے سنا ، وہ ام حبیبہ سے بیان کرتی تھیں کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔</b>",
        "bookID": "68.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 145390,
        "last_updated": null
    }
]