[
    {
        "urduURN": 4052930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5373,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ، انہوں نے کہا ہم کو سفیان ثوری نے خبر دی ، انہیں منصور نے ان سے ابووائل نے بیان کیا ، اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، بھوکے کو کھلاؤ پلاؤ ، بیمار کی مزاج پرسی کرو اور قیدی کو چھڑاؤ ۔ سفیان ثوری نے کہا کہ ( حدیث میں ) لفظ ” عانی “ سے مراد قیدی ہے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 145740,
        "last_updated": null
    },
    {
        "urduURN": 4052940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5374,
        "hadithSanad": "ہم سے یوسف بن عیسیٰ مروزی نے بیان کیا ، کہا ہم سے محمد بن فضیل نے بیان کیا ، ان سے ان کے والد نے ، ان سے ابوحازم ( سلمہ بن اشجعی ) نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "حضور اکرم صلی اللہ علیہ وسلم کی وفات تک آل محمد صلی اللہ علیہ وسلم پر کبھی ایسا زمانہ نہیں گزرا کہ کچھ دن برابر انہوں نے پیٹ بھر کے کھانا کھایا ہو اور اسی سند سے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 145750,
        "last_updated": null
    },
    {
        "urduURN": 4052950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5375,
        "hadithSanad": "ابوحازم سے روایت ہے کہ",
        "hadithText": "ان سے ابوہریرہ رضی اللہ عنہ نے ( بیان کیا کہ فاقہ کی وجہ سے ) میں سخت مشقت میں مبتلا تھا ، پھر میری ملاقات عمر بن خطاب رضی اللہ عنہ سے ہوئی اور ان سے میں نے قرآن مجید کی ایک آیت پڑھنے کے لیے کہا ۔ انہوں نے مجھے وہ آیت پڑھ کر سنائی اور پھر اپنے گھر میں داخل ہو گئے ۔ اس کے بعد میں بہت دور تک چلتا رہا ۔ آخر مشقت اور بھوک کی وجہ سے میں منہ کے بل گر پڑا ۔ اچانک میں نے دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم میرے سر کے پاس کھڑے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، اے ابوہریرہ ! میں نے کہا حاضر ہوں ، یا رسول اللہ ! تیار ہوں ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے میرا ہاتھ پکڑ کر مجھے کھڑا کیا ۔ آپ سمجھ گئے کہ میں کس تکلیف میں مبتلا ہوں ۔ پھر آپ مجھے اپنے گھر لے گئے اور میرے لیے دودھ کا ایک بڑا پیالہ منگوایا ۔ میں نے اس میں دودھ پیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، دوبارہ پیو ( ابوہریرہ ! ) میں نے دوبارہ پیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اور پیو ۔ میں نے اور پیا ۔ یہاں تک کہ میرا پیٹ بھی پیالہ کی طرح بھرپور ہو گیا ۔ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ پھر عمر رضی اللہ عنہ سے ملا اور ان سے اپنا سارا واقعہ بیان کیا اور کہا کہ اے عمر ! اللہ تعالیٰ نے اسے اس ذات کے ذریعہ پورا کرا دیا ، جو آپ سے زیادہ مستحق تھی ۔ اللہ کی قسم ! میں نے تم سے آیت پوچھی تھی حالانکہ میں اسے تم سے بھی زیادہ بہتر طریقہ پر پڑھ سکتا تھا ۔ عمر رضی اللہ عنہ نے کہا اللہ کی قسم ! اگر میں نے تم کو اپنے گھر میں داخل کر لیا ہوتا اور تم کو کھانا کھلادیتا تو لال لال ( عمدہ ) اونٹ ملنے سے بھی زیادہ مجھ کو خوشی ہوتی ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 145760,
        "last_updated": null
    },
    {
        "urduURN": 4052960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5376,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم کوسفیان ثوری نے خبر دی ، کہا کہ مجھے ولید بن کثیر نے خبر دی ، انہوں نے وہب بن کیسان سے سنا ، انہوں نے عمر بن ابی سلمہ رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں بچہ تھا اوررسول اللہ صلی اللہ علیہ وسلم کی پرورش میں تھا اور ( کھاتے وقت ) میرا ہاتھ برتن میں چاروںطرف گھوما کرتا ۔ اس لیے آپ نے مجھ سے فرمایا ، بیٹے ! بسم اللہ پڑھ لیا کر ، داہنے ہاتھ سے کھایا کر اور برتن میں وہاں سے کھایاکر جو جگہ تجھ سے نزدیک ہو ۔ چنانچہ اس کے بعد میں ہمیشہ اسی ہدایت کے مطابق کھاتا رہا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 145770,
        "last_updated": null
    },
    {
        "urduURN": 4052970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5377,
        "hadithSanad": "مجھ سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا ، انہوں نے کہا کہ مجھ سے محمد بن جعفر نے بیان کیا ، ان سے محمد بن عمرو بن حلحلہ دیلی نے بیان کیا ، ان سے وہب بن کیسان ابونعیم نے بیان کیا ، ان سے عمر بن ابی سلمہ رضی اللہ عنہ نے ، وہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ام سلمہ رضی اللہ عنہا کے ( ابوسلمہ سے ) بیٹے ہیں ۔ بیان کیا کہ",
        "hadithText": "ایک دن میں نے رسول اللہ کے ساتھ کھانا کھایا اور برتن کے چاروں طرف سے کھانے لگا تو آنحضرت صلی اللہ علیہ وسلم نے مجھ سے فرمایا کہ اپنے نزدیک سے کھا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 145780,
        "last_updated": null
    },
    {
        "urduURN": 4052980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5378,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، ان سے ابونعیم وہب بن کیسان نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی خدمت میں کھانا لایا گیا ، آپ کے ساتھ آپ کے ربیب عمر بن ابی سلمہ رضی اللہ عنہ بھی تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ بسم اللہ پڑھ اور اپنے سامنے سے کھا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 145790,
        "last_updated": null
    },
    {
        "urduURN": 4052990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5379,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، ان سے امام مالک نے ، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے ، انہوں نے انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "ایک درزی نے رسول اللہ صلی اللہ علیہ وسلم کی کھانے کی دعوت کی جو انہوں نے آنحضرت صلی اللہ علیہ وسلم کے لیے تیار کیا تھا ۔ انس رضی اللہ عنہ نے بیان کیا کہ حضور اکرم صلی اللہ علیہ وسلم کے ساتھ میں بھی گیا ، میں نے دیکھا کہ حضور اکرم صلی اللہ علیہ وسلم پیالہ میں چاروں طرف کدو تلاش کرتے تھے ( کھانے کے لیے ) بیان کیا کہ اسی دن سے کدو مجھ کوبھی بہت بھانے لگا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 145800,
        "last_updated": null
    },
    {
        "urduURN": 4053000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5380,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو شعبہ نے خبر دی ، انہیں اشعث نے ، انہیں ان کے والد نے ، انہیں مسروق نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جہاں تک ممکن ہوتا پاکی حاصل کرنے میں ، جو تا پہننے اور کنگھا کرنے میں داہنی طرف سے ابتداء کرتے ۔ اشعث اس حدیث کا راوی جب واسط شہر میں تھا تو اس نے اس حدیث میںیوں کہا تھا کہ ہر ایک کام میں حضور صلی اللہ علیہ وسلم داہنی طرف سے ابتداء کرتے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 145810,
        "last_updated": null
    },
    {
        "urduURN": 4053010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5381,
        "hadithSanad": "ہم سے اسماعیل بن علیہ نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے ، انہوں نے انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "ابوطلحہ رضی اللہ عنہ نے اپنی بیوی ام سلیم رضی اللہ عنہا سے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کی آواز میں ضعف و نقاہت کو محسوس کیا ہے اور معلوم ہوتا ہے کہ آپ فاقہ سے ہیں ۔ کیا تمہارے پاس کوئی چیز ہے ؟ چنانچہ انہوں نے جو کی چند روٹیاں نکالیں ، پھر اپنا دوپٹہ نکالا اور اس کے ایک حصہ میں روٹیوں کو لپیٹ کر میرے ( یعنی انس رضی اللہ عنہ کے ) کپڑے کے نیچے چھپا دیا اور ایک حصہ مجھے چادر کی طرح اوڑھا دیا ، پھر مجھے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں بھیجا ، بیان کیا کہ میں جب حضور اکرم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آپ کو مسجد میں پایا اور آپ کے ساتھ صحابہ تھے ۔ میں ان سب حضرات کے سامنے جا کر کھڑا ہو گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا ، اے انس ! تمہیں ابوطلحہ نے بھیجا ہو گا ۔ میں نے عرض کی جی ہاں ۔ آنحضرت صلی اللہ علیہ وسلم نے پوچھا کھانے کے ساتھ ؟ میں نے عرض کی ، جی ہاں ۔ اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے اپنے ساتھیوں سے فرمایا کہ کھڑے ہو جاؤ ۔ چنانچہ آپ روانہ ہوئے ۔ میں سب کے آگے آگے چلتا رہا ۔ جب ابوطلحہ رضی اللہ عنہ کے پاس واپس پہنچا تو انہوں نے کہا ام سلیم ! حضور اکرم صلی اللہ علیہ وسلم صحابہ کو ساتھ لے کر تشریف لائے ہیں ، حالانکہ ہمارے پاس کھانے کا اتنا سامان نہیں جو سب کو کافی ہو سکے ۔ ام سلیم رضی اللہ عنہا اس پربولیں کہ اللہ اور اس کا رسول خوب جانتے ہیں ۔ بیان کیا کہ پھر ابوطلحہ رضی اللہ عنہ ( استقبال کے لیے ) نکلے اور آنحضرت صلی اللہ علیہ وسلم سے ملاقات کی ۔ اس کے بعد ابوطلحہ رضی اللہ عنہ اور حضور اکرم صلی اللہ علیہ وسلم گھر کی طرف متوجہ ہوئے اور گھر میں داخل ہو گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ام سلیم ! جو کچھ تمہارے پاس ہے وہ یہاں لاؤ ۔ ام سلیم رضی اللہ عنہا روٹی لائیں ، آنحضرت صلی اللہ علیہ وسلم نے حکم دیا اور اس کا چورا کر لیا گیا ۔ ام سلیم رضی اللہ عنہ نے اپنے گھی کے ڈبہ میں سے گھی نچوڑ کر اس کا ملیدہ بنا لیا ، پھر حضور اکرم صلی اللہ علیہ وسلم نے دعا کی جو کچھ اللہ تعالیٰ نے آپ سے دعا کرانی چاہی ، اس کے بعد فرمایا ان دس دس آدمی کو کھانے کے لیے بلا لو ۔ چنانچہ دس صحابہ کو بلایا ۔ سب نے کھایا اورشکم سیر ہو کر باہر چلے گئے ۔ پھر فرمایا کہ دس کو اوربلالو ، انہیں بلایا گیا اور سب نے شکم سیر ہو کر کھایا اور باہر چلے گئے ۔ پھر آپ نے فرمایا کہ دس صحابہ کو اور بلا لو ، پھر دس صحابہ کو بلایا گیا اور ان لوگوں نے بھی خوب پیٹ بھرکر کھایا اور باہر تشریف لے گئے ۔ اس کے بعد پھر دس صحابہ کو بلایا گیا اس طرح تمام صحابہ نے پیٹ بھر کر کھایا ، اس وقت اسی ( 80 ) صحابہ کی جماعت وہاں موجود تھی ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 145820,
        "last_updated": null
    },
    {
        "urduURN": 4053020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5382,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے معتمر بن سلیمان نے بیان کیا ، ان سے ان کے والد نے بیان کیا ، انہوں نے کہا کہ ابوعثمان نہدی نے بھی بیان کیا اور ان سے حضرت عبدالرحمٰن بن ابی بکر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ہم ایک سو تیس آدمی نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تم میں سے کسی کے پاس کھانا ہے ۔ ایک صاحب نے اپنے پاس سے ایک صاع کے قریب آٹا نکالا ، اسے گوندھ لیا گیا ، پھر ایک مشرک لمبا تڑنگا اپنی بکریاں ہانکتا ہوا ادھر آ گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے اس سے دریافت فرمایا کہ یہ بیچنے کی ہیں یا عطیہ ہیں یا آنحضور صلی اللہ علیہ وسلم نے ( عطیہ کے بجائے ) ” ہبہ “ فرمایا ۔ اس شخص نے کہا کہ نہیں بلکہ بیچنے کی ہیں ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم نے اس سے ایک بکری خریدی پھر ذبح کی گئی اور آپ نے اس کی کلیجی بھونے جانے کا حکم دیا اور قسم اللہ کی ایک سو تیس لوگوں کی جماعت میں کوئی شخص ایسا نہیں رہا جسے آنحضرت صلی اللہ علیہ وسلم نے اس بکری کی کلیجی کا ایک ایک ٹکڑا کاٹ کر نہ دیا ہو مگر وہ موجود تھا تو اسے وہیں دے دیا اور اگر وہ موجودنہیں تھا تو اس کا حصہ محفوظ رکھا ، پھر اس بکری کے گوشت کو پکا کر دو بڑے کونڈوں میں رکھا اور ہم سب نے ان میں سے پیٹ بھر کر کھایا پھر بھی دونوں کونڈوں میں کھانا بچ گیا تو میں نے اسے اونٹ پر لاد لیا عبدالرحمٰن راوی نے ایسا ہی کوئی کلمہ کہا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 145830,
        "last_updated": null
    },
    {
        "urduURN": 4053030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5383,
        "hadithSanad": "ہم سے مسلم بن ابراہیم قصاب نے بیان کیا ، کہا ہم سے وہیب بن خالد نے بیان کیا ، کہا ہم سے منصور بن عبدالرحمٰن نے بیان کیا ، ان سے ان کی والدہ ( صفیہ بن شبیہ ) نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی وفات ہوئی ، ان دنوں ہم پانی اور کھجور سے سیر ہو جانے لگے تھے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 145840,
        "last_updated": null
    },
    {
        "urduURN": 4053040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5384,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا کہا یحییٰ بن سعید انصاری نے بیان کیا ، انہوں نے بشیر بن یسار سے سنا ، کہا کہ ہم سے سوید بن نعمان رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ خیبر کی طرف ( سنہ ۷ھ میں ) نکلے جب ہم مقام صہباء پر پہنچے ۔ یحییٰ نے بیان کیا کہ صہباء خیبر سے دوپہر کی راہ پر ہے تو اس وقت حضور اکرم صلی اللہ علیہ وسلم نے کھانا طلب فرمایا لیکن ستو کے سوا اور کوئی چیز نہیں لائی گئی ، پھر ہم نے اسی کو سوکھا پھانک لیا ، پھر آنحضرت صلی اللہ علیہ وسلم نے پانی طلب فرمایا اور کلی کی ، ہم نے بھی کلی کی ۔ اس کے بعد آپ نے ہمیں مغرب کی نماز پڑھائی اور وضو نہیں کیا ( مغرب کے لیے کیونکہ پہلے سے باوضو تھے ) سفیان نے بیان کیا کہ میں نے یحییٰ سے اس حدیث میں یوں سنا کہ آپ نے نہ ستو کھاتے وقت وضو کیا نہ کھانے سے فارغ ہو کر ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 145850,
        "last_updated": null
    },
    {
        "urduURN": 4053050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5385,
        "hadithSanad": "ہم سے محمد بن سنان نے بیان کیا ، ان سے ہمام نے بیان کیا ، ان سے قتادہ نے ، کہا کہ",
        "hadithText": "ہم حضرت انس رضی اللہ عنہ کی خدمت میں بیٹھے ہوئے تھے ، اس وقت ان کا روٹی پکانے والا خادم بھی موجود تھا ۔ انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے کبھی چپاتی ( میدہ کی روٹی ) نہیں کھائی اور نہ ساری دم پختہ بکری کھائی یہاں تک کہ آپ اللہ سے جا ملے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 145860,
        "last_updated": null
    },
    {
        "urduURN": 4053060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5386,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے معاذ بن ہشام نے بیان کیا ، کہا کہ مجھ سے میرے والد نے بیان کیا ، ان سے یونس نے ، علی بن عبداللہ المدینی نے کہا کہ یہ یونس اسکاف ہیں ( نہ کہ یونس بن عبید بصریٰ ) ان سے قتادہ نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نہیں جانتا کہ نبی کریم صلی اللہ علیہ وسلم نے کبھی تشتری رکھ کر ( ایک وقت مختلف قسم کا ) کھانا کھایا ہو اور نہ کبھی آپ نے پتلی روٹیاں ( چپاتیاں ) کھائیں اور نہ کبھی آپ نے میز پر کھایا ۔ قتادہ سے پوچھا گیا کہ پھر کس چیز پر آپ کھاتے تھے ؟ کہا کہ آپ سفرہ ( عام دسترخوان ) پر کھانا کھایا کرتے تھے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 145870,
        "last_updated": null
    },
    {
        "urduURN": 4053070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5387,
        "hadithSanad": "ہم سے سعید بن مریم نے بیان کیا ، کہا ہم کو محمد بن جعفر نے خبر دی ، کہا مجھ کو حمید نے خبر دی اور انہوں نے حضرت انس رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے حضرت صفیہ رضی اللہ عنہا سے نکاح کے بعد ان کے ساتھ راستے میں قیام کیا اور میں نے مسلمانوں کو آپ کے ولیمہ کی دعوت میں بلایا ۔ آنحضرت صلی اللہ علیہ وسلم نے دسترخوان بچھا نے کا حکم دیا اور وہ بچھایا گیا ، پھر آپ نے اس پر کھجور ، پنیر اور گھی ڈال دیا اور عمرو بن ابی عمرو نے کہا ، ان سے حضرت انس رضی اللہ عنہ نے کہ حضور اکرم صلی اللہ علیہ وسلم نے حضرت صفیہ رضی اللہ عنہا کے ساتھ صحبت کی ، پھر ایک چمڑے کے دسترخوان پر ( کھجور ، گھی ، پنیر ملا کر بنا ہوا ) حلوہ رکھا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 145880,
        "last_updated": null
    },
    {
        "urduURN": 4053080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5388,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو ابومعاویہ نے خبر دی ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے والد نے اور وہب بن کیسان نے بیان کیا کہ",
        "hadithText": "اہل شام ( حجاج بن یوسف کے فوجی ) شام کے لوگ حضرت عبداللہ بن زبیر رضی اللہ عنہما کو عار دلانے کے لیے کہنے لگے ” یا ابن ذات النطاقین “ ( اے دو کمربند والی کے بیٹے اور ان کی والدہ ) حضرت اسماء رضی اللہ عنہا نے کہا ، اے بیٹے ! یہ تمہیں دو کمربند والی کی عار دلاتے ہیں ، تمہیں معلوم ہے وہ کمربند کیا تھے ؟ وہ میرا کمربند تھا جس کے میں نے دو ٹکڑے کر دیئے تھے اور ایک ٹکڑے سے نبی کریم صلی اللہ علیہ وسلم کے بر تن کا منہ باندھا تھا اور دوسرے سے دسترخوان بنایا ( اس میں توشہ لپیٹا ) وہب نے بیان کیا کہ پھر جب حضرت عبداللہ بن زبیر رضی اللہ عنہما کو اہل شام دو کمربند والی کی عار دلاتے تھے ، تو وہ کہتے ہاں ۔ اللہ کی قسم ! یہ بیشک سچ ہے اور وہ یہ مصرعہ پڑھتے تلک شکاۃ ظاھر منک عارھا یہ تو ویسا طعنہ ہے جس میں کچھ عیب نہیں ہے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 145890,
        "last_updated": null
    },
    {
        "urduURN": 4053090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5389,
        "hadithSanad": "ہم سے ابو نعمان نے بیان کیا ، انہوں نے کہا ہم سے ابو عوانہ نے بیان کیا ، ان سے ابو بشر نے ، ان سے سعید بن جبیر نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ابن عباس رضی اللہ عنہما کی خالہ ام حفید بنت حارث بن حزن رضی اللہ عنہا نے نبی کریم صلی اللہ علیہ وسلم کو گھی ، پنیر اور ساہنہ ہدیہ کے طور پر بھیجی ۔ آنحضرت صلی اللہ علیہ وسلم نے عورتوں کو بلایا اور انہوں نے آپ کے دسترخوان پر ساہنہ کو کھایا لیکن آپ نے اسے ہاتھ بھی نہیں لگایا جیسے آپ اسے ناپسند کرتے ہیں لیکن اگر ساہنہ حرام ہوتا تو آپ کے دسترخوان پر کھایا نہ جاتا اور نہ آپ انہیں کھانے کے لیے فرماتے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 145900,
        "last_updated": null
    },
    {
        "urduURN": 4053100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5390,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد نے بیان کیا ، ان سے یحییٰ بن سعید انصاری نے ، ان سے بشیر بن یسار نے ، انہیں سوید بن نعمان رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "وہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ مقام صہبا میں تھے ۔ وہ خیبر سے ایک منزل پر ہے ۔ نماز کا وقت قریب تھا تو آنحضرت صلی اللہ علیہ وسلم نے کھانا طلب فرمایا لیکن ستو کے سوا اور کوئی چیز نہیں لائی گئی ۔ آخر آنحضرت صلی اللہ علیہ وسلم نے اس کو پھانک لیا اور ہم نے بھی پھانکا پھر آپ نے پانی طلب فرمایا اور کلی کی ۔ اس کے بعد آپ نے نماز پڑھائی اور ہم نے بھی آپ کے ساتھ نماز پڑھی اور آپ نے ( اس نماز کے لیے نیا ) وضو نہیں کیا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 145910,
        "last_updated": null
    },
    {
        "urduURN": 4053110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5391,
        "hadithSanad": "ہم سے محمد بن مقاتل ابوالحسن نے بیان کیا ، کہا ہم کو عبداللہ بن یعلیٰ نے خبر دی ، کہا ہم کو یونس نے خبر دی ، ان سے زہری نے بیان کیا کہ",
        "hadithText": "مجھے ابوامامہ بن سہل بن حنیف انصاری نے خبر دی ، انہیں حضرت ابن عباس رضی اللہ عنہما نے خبر دی اور انہیں حضرت خالد بن ولید رضی اللہ عنہ نے جو سیف اللہ ( اللہ کی تلوار ) کے لقب سے مشہور ہیں ، خبر دی کہ وہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ام المؤمنین حضرت میمونہ رضی اللہ عنہا کے گھر میں داخل ہوئے ۔ ام المؤمنین ان کی اور ابن عباس رضی اللہ عنہما کی خالہ ہیں ۔ ان کے یہاں بھنا ہوا ساہنہ موجود تھا جو ان کی بہن حفید ہ بنت الحارث رضی اللہ عنہا نجد سے لائی تھیں ۔ انہوں نے وہ بھنا ہوا ساہنہ حضور اکرم صلی اللہ علیہ وسلم کی خدمت میں پیش کیا ۔ ایسا بہت کم ہوتا تھا حضور اکرم صلی اللہ علیہ وسلم کسی کھانے کے لیے اس وقت تک ہاتھ بڑھائیں جب تک آپ کو اس کے متعلق بتانہ دیا جائے کہ یہ فلاں کھانا ہے لیکن اس دن آپ نے بھنے ہوئے ساہنے کے گوشت کی طرف ہاتھ بڑھایا ۔ اتنے میں وہاں موجود عورتوں میں سے ایک عورت نے کہا کہ آنحضرت صلی اللہ علیہ وسلم کو بتا کیوں نہیں دیتیں کہ اس وقت آپ کے سامنے جو تم نے پیش کیا ہے وہ ساہنہ ہے ، یا رسول اللہ ! ( یہ سن کر ) آپ نے اپنا ہاتھ ساہنہ سے ہٹا لیا ۔ حضرت خالد بن ولید رضی اللہ عنہ بولے کہ یا رسول اللہ ! کیا ساہنہ حرام ہے ؟ آپ نے فرمایا کہ نہیں لیکن یہ میرے ملک میں چونکہ نہیں پایا جاتا ، اس لیے طبیعت پسند نہیں کرتی ۔ حضرت خالد رضی اللہ عنہ نے بیان کیا کہ پھر میں نے اسے اپنی طرف کھینچ لیا اور اسے کھایا ۔ اس وقت حضور اکرم صلی اللہ علیہ وسلم مجھے دیکھ رہے تھے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 145920,
        "last_updated": null
    },
    {
        "urduURN": 4053120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5392,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، ( دوسری سند ) امام بخاری نے کہا کہ ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابوالزناد نے ، ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا دو آدمیوں کا کھانا تین کے لیے کافی ہے اور تین کا چار کے لیے کافی ہے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 145930,
        "last_updated": null
    },
    {
        "urduURN": 4053130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5393,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، ہم سے سے عبدالصمد بن عبدالوارث نے بیان کیا ، کہا ہم سے شعبہ بن حجاج نے بیان کیا ، ان سے واقد بن محمد نے ، ان سے نافع نے بیان کیا کہ",
        "hadithText": "ابن عمر رضی اللہ عنہما اس وقت تک کھانا نہیں کھاتے تھے ، جب تک ان کے ساتھ کھانے کے لیے کوئی مسکین نہ لایا جاتا ۔ ایک مرتبہ میں ان کے ساتھ کھانے کے لیے ایک شخص کو لایا کہ اس نے بہت زیادہ کھانا کھایا ۔ بعد میں حضرت ابن عمر رضی اللہ عنہما نے کہا کہ آئندہ اس شخص کو میرے ساتھ کھانے کے لیے نہ لانا ۔ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے کہ مومن ایک آنت میں کھاتا اور کافر دو آنتیں بھر لیتا ہے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 145940,
        "last_updated": null
    },
    {
        "urduURN": 4053140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5394,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو عبدہ بن سلیمان نے خبر دی ، انہیں عبیداللہ عمری نے خبر دی ، انہیں نافع نے اور ان سے حضرت ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا مومن ایک آنت میں کھاتا ہے اور کافر یا منافق ( عبدہ نے کہا کہ ) مجھے یقین نہیں کہ ان میں سے کس کے متعلق عبیداللہ نے بیان کیا کہ وہ ساتوں آنتیں بھر لیتا ہے اور ابن بکیر نے بیان کیا ، ان سے امام مالک نے بیان کیا ، ان سے نافع نے ، ان سے ابن عمر رضی اللہ عنہما اور ان سے نبی کریم صلی اللہ علیہ وسلم نے اسی حدیث کی طرح بیان فرمایا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 145951,
        "last_updated": null
    },
    {
        "urduURN": 4053150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5395,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے کہ",
        "hadithText": "ابو نہیک بڑے کھانے والے تھے ۔ ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے کہ کافر ساتوں آنتوں میں کھاتا ہے ۔ ابو نہیک نے اس پر عرض کیا کہ میں اللہ اور اس کے رسول پر ایمان رکھتا ہوں ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 145970,
        "last_updated": null
    },
    {
        "urduURN": 4053160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5396,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابوالزناد نے بیان کیا ، ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، مسلمان ایک آنت میں کھاتا ہے اور کافر ساتوں آنتوں میں کھا تا ہے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 145980,
        "last_updated": null
    },
    {
        "urduURN": 4053170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5397,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے عدی بن ثابت نے بیان کیا ، ان سے ابوحازم نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "ایک صاحب بہت زیادہ کھانا کھایا کرتے تھے ، پھر وہ اسلام لائے تو کم کھانے لگے ۔ اس کا ذکر رسول اللہ صلی اللہ علیہ وسلم سے کیا گیا تو آپ نے فرمایا کہ مومن ایک آنت میں کھاتا ہے اور کافر ساتوں آنتوں میں کھاتا ہے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 145990,
        "last_updated": null
    },
    {
        "urduURN": 4053180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5398,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، انہوں نے کہا ہم سے مسعر نے بیان کیا ، ان سے علی ابن الاقمر نے کہ",
        "hadithText": "میں نے ابوجحیفہ رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، میں ٹیک لگا کر نہیں کھاتا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 146000,
        "last_updated": null
    },
    {
        "urduURN": 4053190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5399,
        "hadithSanad": "مجھ سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم کو جریر نے خبر دی ، انہیں منصور نے ، انہیں علی ابن الاقمر نے اور ان سے ابو جحیفہ رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر تھا ۔ آپ نے ایک صحابی سے جو آپ کے پاس موجود تھے فرمایا کہ میں ٹیک لگا کر نہیں کھاتا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 146010,
        "last_updated": null
    },
    {
        "urduURN": 4053200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5400,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے ہشام بن یوسف نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں ابوامامہ بن سہل نے اور انہیں ابن عباس رضی اللہ عنہما نے کہ خالد بن ولید رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے لیے بھنا ہوا ساہنہ پیش کیا گیاتو آپ اسے کھانے کے لیے متوجہ ہوئے ۔ اسی وقت آپ کو بتایا گیا کہ یہ ساہنہ ہے تو آپ نے اپنا ہاتھ روک لیا ۔ حضرت خالد رضی اللہ عنہ نے پوچھا کیا یہ حرام ہے ؟ فرمایا کہ نہیں لیکن چونکہ یہ میرے ملک میں نہیں ہوتا اس لیے طبیعت اسے گوارا نہیں کرتی ۔ پھر خالد رضی اللہ عنہ نے اسے کھایا اور نبی کریم صلی اللہ علیہ وسلم دیکھ رہے تھے ۔ امام مالک نے ابن شہاب سے ” ضب محنوذ “ ( یعنی بھنا ہوا ساہنہ ضب مشوی کی جگہ محنوذ نقل کیا ، دونوں لفظوں کا ایک معنی ہے )</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 146020,
        "last_updated": null
    },
    {
        "urduURN": 4053210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5401,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، ان سے امام لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے بیان کیا ، انہیں محمود بن ربیع انصاری نے خبر دی کہ",
        "hadithText": "عتبان بن مالک رضی اللہ عنہ جو نبی کریم صلی اللہ علیہ وسلم کے صحابہ میں سے تھے اور قبیلہ انصار کے ان لوگوں میں سے تھے جنہوں نے بدر کی لڑائی میں شرکت کی تھی ۔ آپ آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا کہ یا رسول اللہ ! میری آنکھ کی بصارت کمزور ہے اور میں اپنی قوم کو نماز پڑھاتا ہوں ۔ برسات میں وادی جو میرے اور ان کے درمیان حائل ہے ۔ بہنے لگتی ہے اور میرے لیے ان کی مسجد میں جانا اور ان میں نماز پڑھنا ممکن نہیں رہتا ۔ اس لیے یا رسول اللہ ! میری یہ خواہش ہے کہ آپ میرے گھر تشریف لے چلیں اور میرے گھر میں آپ نماز پڑھیں تاکہ میں اسی جگہ کو نماز پڑھنے کی جگہ بنا لوں ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا کہ انشاءاللہ میں جلدی ہی ایسا کروں گا ۔ حضرت عتبان رضی اللہ عنہ نے بیان کیا کہ پھر حضور اکرم صلی اللہ علیہ وسلم حضرت ابوبکر رضی اللہ عنہ کے ساتھ چاشت کے وقت جب سورج کچھ بلند ہو گیا تشریف لائے اور آنحضرت صلی اللہ علیہ وسلم نے اندر آنے کی اجازت چاہی ۔ میں نے آپ کو اجازت دے دی ۔ آپ بیٹھے نہیں بلکہ گھر میں داخل ہو گئے اور دریافت فرمایا کہ اپنے گھر میں کس جگہ تم پسند کرتے ہو کہ میں نماز پڑھوں ؟ میں نے گھر کے ایک کونے کی طرف اشارہ کیا ۔ آنحضرت صلی اللہ علیہ وسلم وہاں کھڑے ہو گئے اور ( نماز کے لیے ) تکبیر کہی ۔ ہم نے بھی ( آپ کے پیچھے ) صف بنا لی ۔ آنحضرت صلی اللہ علیہ وسلم کوخزیرہ ( حریرہ کی ایک قسم ) کے لیے جو آپ کے لیے ہم نے بنایا تھا روک لیا ۔ گھر میں قبیلہ کے بہت سے لوگ آآ کر جمع ہو گئے ۔ ان میں سے ایک صاحب نے کہا مالک بن دخشن رضی اللہ عنہ کہاں ہیں ؟ اس پر کسی نے کہا کہ وہ تو منافق ہے اللہ اور اس کے رسول سے اسے محبت نہیں ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، یہ نہ کہو ، کیا تم نہیں دیکھتے کہ انہوں نے اقرار کیا ہے کہ لا الہٰ الا اللہ یعنی اللہ کے سوا اور کوئی معبود نہیں اور اس سے ان کا مقصد صرف اللہ کی خوشنودی حاصل کرنا ہے ۔ ان صحابی نے کہا کہ اللہ اور اس کے رسول ہی زیادہ جانتے ہیں ۔ راوی نے بیان کیا کہ ہم نے عرض کیا ( یا رسول اللہ ! ) لیکن ہم ان کی توجہ اور ان کا لگاؤ منافقین کے ساتھ ہی دیکھتے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا لیکن اللہ نے دوزخ کی آگ کو اس شخص پر حرام کر دیا ہے جس نے کلمہ لا الہٰ الا اللہ کا اقرار کر لیا ہو اور اس سے اس کا مقصد اللہ کی خوشنودی ہو ۔ ابن شہاب نے بیان کیا کہ پھر میں نے حصین بن محمد انصاری سے جو بنی سالم کے ایک فرد اور ان کے سردار تھے ۔ محمود کی حدیث کے متعلق پوچھا تو انہوں نے اس کی تصدیق کی ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 146030,
        "last_updated": null
    },
    {
        "urduURN": 4053220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5402,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کی ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے ابو بشر نے ، ان سے سعید نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میری خالہ نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ساہنہ کا گوشت ، پنیر اور دودھ ہدیتاً پیش کیا تو ساہنہ کا گوشت آپ کے دسترخوان پررکھاگیا اوراگرساہنہ حرام ہوتا تو آپ کے دسترخوان پر نہیں رکھا جا سکتا تھا لیکن آپ نے دودھ پیااور پنیر کھایا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 146040,
        "last_updated": null
    },
    {
        "urduURN": 4053230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5403,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا ہم سے یعقوب بن عبدالرحمٰن نے بیان کیا ، ان سے ابوحازم نے اور ان سے سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہمیں جمعہ کے دن بڑی خوشی رہتی تھی ۔ ہماری ایک بوڑھی خاتون تھیں وہ چقندر کی جڑ یں لے کر اپنی ہانڈی میں پکاتی تھیں ، اوپر سے کچھ دانے جو کے اس میں ڈال دیتی تھی ۔ ہم جمعہ کی نماز پڑھ کر ان کی ملاقات کو جاتے تو وہ ہمارے سامنے یہ کھانا رکھتی تھی ۔ جمعہ کے دن ہمیں بڑی خوشی اسی وجہ سے رہتی تھی ۔ ہم نماز جمعہ کے بعد ہی کھانا کھایا کرتے تھے ۔ اللہ کی قسم نہ اس میں چربی ہوتی تھی نہ گھی اور جب بھی ہم مزے سے اس کو کھاتے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 146050,
        "last_updated": null
    },
    {
        "urduURN": 4053240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5404,
        "hadithSanad": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، کہا ہم سے ایوب سختیانی نے بیان کیا ، ان سے محمد بن سیرین نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے شانے کی ہڈی کا گوشت کھایا ، پھر کھڑے ہوئے اور نماز پڑھی ۔ آپ نے ( نماز کے لیے نیا ) وضو نہیں کیا اور ( اسی سند سے )</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 146060,
        "last_updated": null
    },
    {
        "urduURN": 4053250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5405,
        "hadithSanad": "ایوب اورعاصم سے روایت ہے ، ان سے عکرمہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے پکتی ہوئی ہنڈیا میں سے ادھ کچی بوٹی نکالی اور اسے کھایا پھر نماز پڑھائی اور نیا وضو نہیں کیا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 146070,
        "last_updated": null
    },
    {
        "urduURN": 4053260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5406,
        "hadithSanad": "مجھ سے محمد بن مثنیٰ نے بیان کیا ، کہا کہ مجھ سے عثمان ابن عمر نے بیان کیا ، ان سے فلیح بن سلیمان نے بیان کیا ، ان سے ابوحازم سلمہ بن دینار مدنی نے ، کہا ہم سے عبداللہ بن ابی قتادہ نے اور ان سے ان کے والد نے بیان کیا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ مکہ کی طرف نکلے ( صلح حدیبیہ کے موقع پر ) دوسری سند ( حدیث دیکھیں 5407 )</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 146080,
        "last_updated": null
    },
    {
        "urduURN": 4053270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5407,
        "hadithSanad": "اور مجھ سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا ، کہا ہم سے محمد بن جعفر نے بیان کیا ، ان سے ابوحازم نے بیان کیا ، ان سے عبداللہ بن ابی قتادہ اسلمی نے ، ان سے ان کے والد نے بیان کیا کہ",
        "hadithText": "میں ایک دن نبی کریم صلی اللہ علیہ وسلم کے چندصحابہ کے ساتھ مکہ کے راستہ میں ایک منزل پر بیٹھا ہوا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے ہمارے آگے پڑاؤ کیا تھا ۔ صحابہ کرام رضی اللہ عنہم احرام کی حالت میں تھے لیکن میں احرام میں نہیں تھا ۔ لوگوں نے ایک گور خر کو دیکھا ۔ میں اس وقت اپنا جوتا ٹانکنے میں مصروف تھا ۔ ان لوگوں نے مجھے اس گور خر کے متعلق بتایا کچھ نہیں لیکن چاہتے تھے کہ میں کسی طرح دیکھ لوں ۔ چنانچہ میں متوجہ ہوا اور میں نے اسے دیکھ لیا ، پھر میں گھوڑے کے پاس گیا اور اسے زین پہنا کر اس پر سوار ہو گیا لیکن کوڑا اور نیزہ بھول گیا تھا ۔ میں نے ان لوگوں سے کہا کہ کوڑا اور نیزہ مجھے دے دو ۔ انہوں نے کہا کہ نہیں خدا کی قسم ہم تمہاری شکار کے معاملہ میں کوئی مدد نہیں کریں گے ۔ ( کیونکہ ہم محرم ہیں ) میں غصہ ہو گیا اور میں نے اترکر خود یہ دونوں چیزیں اٹھائیں پھر سوار ہو کر اس پر حملہ کیا اور ذبح کر لیا ۔ جب وہ ٹھنڈا ہو گیا تو میں اسے ساتھ لایا پھر پکا کر میں نے اور سب نے کھایا لیکن بعد میں انہیں شبہ ہوا کہ احرام کی حالت میں اس ( شکار کا گوشت ) کھانا کیسا ہے ؟ پھر ہم روانہ ہوئے اور میں نے اس کا گوشت چھپا کر رکھا ۔ جب آنحضرت صلی اللہ علیہ وسلم کے پاس آئے تو ہم نے آپ سے اس کے متعلق پوچھا ۔ آپ نے دریافت فرمایا ، تمہارے پاس کچھ بچا ہوا بھی ہے ؟ میں نے وہی دست پیش کیا اور آپ نے بھی اسے کھایا ۔ یہاں تک کہ اس کا گوشت آپ نے اپنے دانتوں سے کھینچ کھینچ کر کھایا اور آپ احرام میں تھے ۔ محمد بن جعفر نے بیان کیا کہ مجھ سے زید بن اسلم نے یہ واقعہ بیان کیا ، ان سے عطاء بن یسار نے اور ان سے حضرت ابوقتادہ رضی اللہ عنہ نے اسی طرح سارا واقعہ بیان کیا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 146090,
        "last_updated": null
    },
    {
        "urduURN": 4053280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5408,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہیں جعفر بن عمرو بن امیہ ضمری نے خبر دی ، انہیں ان کے والد عمرو بن امیہ رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "انہوں نے نبی کریم صلی اللہ علیہ وسلم کو دیکھا آپ اپنے ہاتھ سے بکری کے شانے کا گوشت کاٹ کر کھا رہے تھے ، پھر آپ کو نماز کے لیے بلایا گیا تو آپ نے گوشت اور وہ چھری جس سے گوشت کی بوٹی کاٹ رہے تھے ، ڈال دی اور نماز کے لیے کھڑے ہو گئے ، پھر آپ نے نماز پڑھی اور آپ نے نیا وضو نہیں کیا ( کیونکہ آپ پہلے ہی وضو کئے ہوئے تھے )</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 146100,
        "last_updated": null
    },
    {
        "urduURN": 4053290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5419,
        "hadithSanad": "ہم سے محمد بن کثیرنے بیان کیا ، کہا ہم کو سفیان نے خبر دی ، انہیں اعمش نے ، انہیں ابوحازم نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے کبھی کسی کھانے میں کوئی عیب نہیں نکالا ۔ اگر پسند ہوا تو کھا لیا اور اگر ناپسند ہوا تو چھوڑ دیا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 146110,
        "last_updated": null
    },
    {
        "urduURN": 4053300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5410,
        "hadithSanad": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم سے ابو غسان ( محمد بن مطرف لیثی ) نے بیان کیا ، کہا کہ مجھ سے ابوحازم سلمہ بن دینار نے بیان کیا ، انہوں نے سہل بن سعد ساعدی رضی اللہ عنہ سے پوچھا",
        "hadithText": "کیا تم نے نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں میدہ دیکھا تھا ؟ انہوں نے کہا کہ نہیں ۔ میں نے پوچھا کیا تم جو کے آٹے کو چھانتے تھے ؟ کہا نہیں ، بلکہ ہم اسے صرف پھونک لیا کرتے تھے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 146120,
        "last_updated": null
    },
    {
        "urduURN": 4053310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5411,
        "hadithSanad": "ہم سے ابو النعمان نے بیان کیا ، انہوں نے کہا ہم سے حماد بن زید نے بیان کیا ، ان سے عباس جریری نے بیان کیا ، ان سے ابوعثمان نہدی نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک دن نبی کریم صلی اللہ علیہ وسلم نے اپنے صحابہ کو کھجور تقسیم کی اور ہر شخص کو سات کھجوریں دیں ۔ مجھے بھی سات کھجوریں عنایت فرمائیں ۔ ان میں ایک خراب تھی ( اور سخت تھی ) لیکن مجھے وہی سب سے زیادہ اچھی معلوم ہوئی کیونکہ اس کا چبانا مجھ کو مشکل ہو گیا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 146130,
        "last_updated": null
    },
    {
        "urduURN": 4053320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5412,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے وہب بن جریر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے اسماعیل بن ابی خالد نے ، ان سے قیس بن ابی حازم نے اور ان سے حضرت سعد بن ابی وقاص رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے اپنے آپ کو نبی کریم صلی اللہ علیہ وسلم کے ساتھ ان سات آدمیوں میں سے ساتواں پایا ( جنہوںنے اسلام سب سے پہلے قبول کیا تھا ) اس وقت ہمارے پاس کھانے کے لیے یہی کیکر کے پھل یا پتے کے سوا اور کچھ نہیں ہوتا ۔ یہ کھاتے کھاتے ہم لوگوں کا پا ئخانہ بھی بکری کی مینگنیوں کی طرح ہو گیا تھا یا اب یہ زمانہ ہے کہ نبی اسد قبیلے کے لوگ مجھ کو شریعت کے احکام سکھلاتے ہیں ۔ اگر میں ابھی تک اس حال میں ہوں کہ نبی اسد کے لوگ مجھ کوشریعت کے احکام سکھلائیں تب تو میں تباہ ہی ہو گیا میری محنت برباد ہو گئی ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 146140,
        "last_updated": null
    },
    {
        "urduURN": 4053330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5413,
        "hadithSanad": "سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے یعقوب نے بیان کیا ، ان سے ابوحازم نے بیان کیاکہ",
        "hadithText": "میں نے سہل بن سعد رضی اللہ عنہ سے پوچھا ، کیا نبی کریم صلی اللہ علیہ وسلم نے کبھی میدہ کھایا تھا ؟ انہوں نے کہا کہ جب اللہ تعالیٰ نے حضور اکرم صلی اللہ علیہ وسلم کو نبی بنایا اس وقت سے وفات تک آنحضرت صلی اللہ علیہ وسلم نے میدہ دیکھا بھی نہیں تھا ۔ میں نے پوچھا کیانبی کریم صلی اللہ علیہ وسلم کے زمانہ میں آپ کے پاس چھلنیاں تھیں ۔ کہا کہ جب اللہ تعالیٰ نے حضور اکرم صلی اللہ علیہ وسلم کو نبی بنایا اس وقت سے آپ کی وفات تک آنحضرت صلی اللہ علیہ وسلم نے چھلنی دیکھی بھی نہیں ۔ بیان کیا کہ میں نے پوچھا آپ لوگ پھر بغیر چھنا ہوا جو کس طرح کھاتے تھے ؟ بتلایا ہم اسے پیس لیتے تھے پھر اسے پھونکتے تھے جو کچھ اڑنا ہوتا اڑجاتا اور جو باقی رہ جاتا اسے گوندھ لیتے ( اور پکا کر ) کھالیتے تھے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 146150,
        "last_updated": null
    },
    {
        "urduURN": 4053340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5414,
        "hadithSanad": "مجھ سے اسحاق بن ابراہیم نے بیان کیا ، انہیں روح بن عبادہ نے خبر دی ، ان سے ابن ابی ذئب نے بیان کیا ، ان سے سعید بن مقبری نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "وہ کچھ لوگوں کے پاس سے گزر ے جن کے سامنے بھنی ہوئی بکری رکھی تھی ۔ انہوں نے ان کو کھانے پر بلایا لیکن انہوں نے کھانے سے انکار کر دیا اور کہا کہ رسول اللہ صلی اللہ علیہ وسلم اس دنیا سے رخصت ہو گئے اور آپ نے کبھی جو کی روٹی بھی آسودہ ہو کر نہیں کھائی ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 146160,
        "last_updated": null
    },
    {
        "urduURN": 4053350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5415,
        "hadithSanad": "ہم سے عبداللہ بن ابی الاسود نے بیان کیا ، کہا ہم سے معاذ بن ہشام نے بیان کیا ، ان سے ان کے والد نے بیان کیا ، ان سے یونس بن ابی الفرات نے ، ان سے قتادہ نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے کبھی میز پر کھانا نہیں کھایا اور نہ تشتری میں دو چار قسم کی چیزیں رکھ کر کھائے اور نہ کبھی چپاتی کھائی ۔ میں نے قتادہ سے پوچھا ، پھر آپ کس چیز پر کھانا کھاتے تھے ؟ بتلایا کہ سفرہ ( چمڑے کے دسترخوان ) پر ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 146170,
        "last_updated": null
    },
    {
        "urduURN": 4053360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5416,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے جریر بن عبدالحمید نے بیان کیا ، ان سے منصور نے ، ان سے ابراہیم نخعی نے ، ان سے اسود بن یزید نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "مدینہ ہجرت کرنے کے بعد آل محمد صلی اللہ علیہ وسلم نے کبھی برابر تین دن تک گیہوں کی روٹی پیٹ بھر کر نہیں کھائی یہاں تک کہ آپ دنیا سے تشریف لے گئے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 146180,
        "last_updated": null
    },
    {
        "urduURN": 4053370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5417,
        "hadithSanad": "ہم سے یحییٰ بن بکیرنے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل بن خالد نے ، ان سے ابن شہاب زہری نے ، ان سے عروہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "جب کسی گھر میں کسی کی وفات ہو جاتی اور اس کیوجہ سے عورتیں جمع ہوتیں اور پھر وہ چلی جاتیں ۔ صرف گھر والے اورخاص خاص عورتیں رہ جاتیں تو آپ ہانڈی میں تلبینہ پکانے کا حکم دیتیں ۔ وہ پکایا جاتا پھر ثرید بنایا جاتا اور تلبینہ اس پر ڈالا جاتا ۔ پھر ام المؤمنین حضرت عائشہ رضی اللہ عنہا فرماتیں کہ اسے کھاؤ کیونکہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے آپ فرماتے تھے کہ تلبینہ مریض کے دل کو تسکین دیتا ہے اور اس کا غم دور کرتا ہے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 146190,
        "last_updated": null
    },
    {
        "urduURN": 4053380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5418,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، انہوں نے کہا ہم سے غندر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے عمرو بن مرہ جملی نے بیان کیا ، ان سے مرہ ہمدانی نے ، ان سے حضرت ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، مردوں میں تو بہت سے کامل ہوئے لیکن عورتوں میں حضرت مریم بنت عمران اور فرعون کی بیوی حضرت آسیہ کے سوا اور کوئی کامل نہیں ہوا اور حضرت عائشہ رضی اللہ عنہا کی فضیلت تمام عورتوں پرایسی ہے جیسے تمام کھانوں پر ثرید کی فضیلت ہے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 146200,
        "last_updated": null
    },
    {
        "urduURN": 4053390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5419,
        "hadithSanad": "ہم سے عمرو بن عون نے بیان کیا ، کہا ہم سے خالد بن عبداللہ نے بیان کیا ، ان سے ابو طوالہ نے اور ان سے حضرت انس نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا عورتوں پر حضرت عائشہ رضی اللہ عنہا کی فضیلت ایسی ہے جیسے تمام کھانوں پر ثرید کی فضیلت ہے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 146210,
        "last_updated": null
    },
    {
        "urduURN": 4053400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5420,
        "hadithSanad": "ہم سے عبداللہ بن منیر نے بیان کیا ، انہوں نے ابوحاتم اشہل ابن حاتم سے سنا ، ان سے ابن عون نے بیان کیا ، ان سے شمامہ بن انس نےء اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ آپ کے ایک غلام کے پاس گیا جودرزی تھے ۔ انہوں نے آنحضرت صلی اللہ علیہ وسلم کے سامنے ایک پیالہ پیش کیا جس میں ثرید تھا ۔ بیان کیا کہ پھر وہ اپنے کام میں لگ گئے ۔ بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم اس میں سے کدو تلاش کرنے لگے کہا کہ پھر میں بھی اس میں سے کدو تلاش کر کر کے آنحضرت صلی اللہ علیہ وسلم کے سامنے رکھنے لگا ۔ بیان کیا کہ اس کے بعد سے میں بھی کدو بہت پسند کرتا ہوں ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 146220,
        "last_updated": null
    },
    {
        "urduURN": 4053410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5421,
        "hadithSanad": "ہم سے ہدبہ بن خالد نے بیان کیا ، کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، ان سے قتادہ نے بیان کیاکہ",
        "hadithText": "ہم حضرت انس رضی اللہ عنہ کی خدمت میں حاضر ہوئے تو ان کی روٹی پکانے والا ان کے پاس ہی کھڑا تھا ۔ انہوں نے کہا کہ کھاؤ ۔ میں نہیں جانتا کہ نبی کریم صلی اللہ علیہ وسلم نے کبھی پتلی روٹی ( چپاتی ) دیکھی ہو ۔ یہاں تک کہ آپ اللہ سے جا ملے اور نہ آنحضرت صلی اللہ علیہ وسلم نے کبھی مسلم بھنی ہوئی بکری دیکھی ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 146230,
        "last_updated": null
    },
    {
        "urduURN": 4053420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5422,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں جعفر بن عمر بن امیہ ضمری نے ، انہیں ان کے والد نے ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نے دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم بکری کے شانہ میں سے گوشت کاٹ رہے تھے ، پھر آپ نے اس میں سے کھایا ۔ پھر آپ کو نماز کے لیے بلایا گیا تو آپ کھڑے ہو گئے اور چھری ڈال دی اور نماز پڑھی لیکن نیا وضو نہیں کیا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 146240,
        "last_updated": null
    },
    {
        "urduURN": 4053430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5423,
        "hadithSanad": "ہم سے خلاد بن یحییٰ نے بیان کیا ، کہا ہم سے سفیان نے ، ان سے عبدالرحمٰن بن عابس نے ، ان سے ان کے والد نے بیان کیا کہ",
        "hadithText": "میں نے عائشہ رضی اللہ عنہا سے پوچھا کیا نبی کریم صلی اللہ علیہ وسلم نے تین دن سے زیادہ قربانی کا گوشت کھانے کو منع کیا ہے ؟ انہوں نے کہا کہ آنحضرت صلی اللہ علیہ وسلم نے ایسا کبھی نہیں کیا ۔ صرف ایک سال اس کا حکم دیا تھا جس سال قحط پڑا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے چاہا تھا ( اس حکم کے ذریعہ ) کہ جو مال والے ہیں وہ ( گوشت محفوظ کرنے کے بجائے ) محتاجوں کو کھلادیں اور ہم بکری کے پائے محفوظ رکھ لیتے تھے اور اسے پندرہ پندرہ دن بعد کھاتے تھے ۔ ان سے پوچھا گیا کہ ایسا کرنے کے لیے کیا مجبوری تھی ؟ اس پر ام المؤمنین رضی اللہ عنہا ہنس پڑیں اور فرمایا آل محمد صلی اللہ علیہ وسلم نے سالن کے ساتھ گیہوں کی روٹی تین دن تک برابر کبھی نہیں کھائی یہاں تک کہ آپ اللہ سے جا ملے ۔ اور ابن کثیر نے بیان کیا کہ ہمیں سفیان نے خبر دی ، ان سے عبدالرحمٰن بن عابس نے یہی حدیث بیان کی ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 146250,
        "last_updated": null
    },
    {
        "urduURN": 4053440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5424,
        "hadithSanad": "مجھ سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے عمرونے ، ان سے عطاء نے اور ان سے حضرت جابر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "( مکہ مکرمہ سے حج کی ) قربانی کا گوشت ہم نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں مدینہ منورہ لاتے تھے ۔ اس کی متابعت محمد نے کی ابن عیینہ کے واسطہ سے اور ابن جریج نے بیان کیا کہ میں نے عطاء سے پوچھا کیا حضرت جابر رضی اللہ عنہ نے یہ بھی کہا تھا کہ ” یہاں تک کہ ہم مدینہ منورہ آ گئے ؟ انہوں نے کہا کہ انہوں نے یہ نہیں کہا تھا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 146260,
        "last_updated": null
    },
    {
        "urduURN": 4053450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5425,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے مطلب بن عبداللہ بن حنطب کے غلام عمرو بن ابی عمرو نے ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بیان کیاکہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے حضرت ابوطلحہ رضی اللہ عنہ سے فرمایا کہ اپنے یہاں کے بچوں میں کوئی بچہ تلاش کرلاؤ جو میرے کام کر دیا کرے ۔ چنانچہ حضرت ابوطلحہ رضی اللہ عنہ مجھے اپنی سواری پر اپنے پیچھے بٹھاکر لائے ۔ میں آنحضرت صلی اللہ علیہ وسلم کی جب بھی آپ کہیں پڑاؤ کرتے خدمت کرتا ۔ میں سنا کرتا تھا کہ آنحضرت صلی اللہ علیہ وسلم بکثرت یہ دعا پڑھا کرتے تھے ۔ ” اے اللہ ! میں تیری پناہ مانگتا ہوں غم سے ، رنج سے ، عجز سے ، سستی سے ، بخل سے ، بزدلی سے ، قرض کے بوجھ سے اور لوگوں کے غلبہ سے ۔ “ ( حضرت انس رضی اللہ عنہ نے بیان کیا کہ ) پھر میں اس وقت سے برابر آپ کی خدمت کرتا رہا ۔ یہاں تک کہ ہم خیبر سے واپس ہوئے اور حضرت صفیہ بنت حیی رضی اللہ عنہ بھی ساتھ تھیں ۔ آنحضرت صلی اللہ علیہ وسلم نے انہیں پسند فرمایا تھا ۔ میں دیکھتا تھا کہ آنحضرت صلی اللہ علیہ وسلم نے ان کے لیے اپنی سواری پر پیچھے کپڑے سے پردہ کیا اور پھر انہیں وہاں بٹھایا ۔ آخر جب مقام صہبا میں پہنچے تو آپ نے دسترخوان پر حیس ( کھجور ، پنیر اور گھی وغیرہ کا ملیدہ ) بنایا پھر مجھے بھیجا اور میں نے لوگوں کو بلالایا ، پھر سب لوگوں نے اسے کھایا ۔ یہی آنحضرت صلی اللہ علیہ وسلم کی طرف سے حضرت صفیہ رضی اللہ عنہا سے نکاح کی دعوت ولیمہ تھی ۔ پھر آپ روانہ ہوئے اور جب احد دکھائی دیا تو آپ نے فرمایا کہ یہ پہاڑ ہم سے محبت رکھتا ہے اور ہم اس سے محبت رکھتے ہیں ۔ اس کے بعد جب مدینہ نظر آیا تو فرمایا ” اے اللہ ! میں اس کے دونوں پہاڑوں کے درمیانی علاقے کو اسی طرح حرمت والا علاقہ بناتا ہوں جس طرح حضرت ابراہیم علیہ السلام نے مکہ کو حرمت والا شہر بنایا تھا ۔ اے اللہ ! اس کے رہنے والوں کو برکت عطا فرما ۔ ان کے مد میں اور ان کے صاع میں برکت فرما ۔ “</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 146270,
        "last_updated": null
    },
    {
        "urduURN": 4053460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5426,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے سیف بن ابی سلیمان نے ، کہا کہ میں نے مجاہد سے سنا ، کہا کہ مجھ سے عبدالرحمٰن بن ابی لیلیٰ نے بیان کیا کہ",
        "hadithText": "یہ لوگ حذیفہ بن الیمان رضی اللہ عنہ کی خدمت میں موجود تھے ۔ انہوں نے پانی مانگا تو ایک مجوسی نے ان کو پانی ( چاندی کے پیالے میں ) لا کر دیا ۔ جب اس نے پیالہ ان کے ہاتھ میں دیا تو انہوں نے پیالہ کو اس پر پھینک کر مارا اور کہا اگر میں نے اسے بارہا اس سے منع نہ کیا ہوتا ( کہ چاندی سونے کے برتن میں مجھے کچھ نہ دیا کرو ) آگے وہ یہ فرمانا چاہتے تھے کہ تو میں اس سے یہ معاملہ نہ کرتا لیکن میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے کہ ریشم ودیبانہ پہنو اور نہ سونے چاندی کے برتن میں کچھ پیو اور نہ ان کی پلیٹوں میں کچھ کھاؤ کیونکہ یہ چیزیں ان ( کفار کے لیے ) دنیا میں ہیں اور ہمارے لیے آخرت میں ہیں ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 146280,
        "last_updated": null
    },
    {
        "urduURN": 4053470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5427,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، انہوں نے کہا ہم سے ابوعوانہ نے بیان کیا ، ان سے قتادہ نے بیان کیا ، ان سے حضرت انس رضی اللہ عنہ نے بیان کیا اور ان سے حضرت ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اس مومن کی مثال جو قرآن پڑھتا ہو سنگترے جیسی ہے جس کی خوشبو بھی پاکیزہ ہے اور مزہ بھی پاکیزہ ہے اور اس مومن کی مثال جو قرآن نہیں پڑھتا کھجور جیسی ہے جس میں کوئی خوشبو نہیں ہوتی لیکن مزہ میٹھا ہوتا ہے اور منافق کی مثال جو قرآن پڑھتا ہو ، ریحانہ ( پھول ) جیسی ہے جس کی خوشبو تو اچھی ہوتی ہے لیکن مزہ کڑوا ہوتا ہے اور جو منافق قرآن بھی نہیں پڑھتا اس کی مثال اندرائن جیسی ہے جس میں کوئی خوشبو نہیں ہوتی اور جس کا مزہ بھی کڑوا ہوتا ہے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 146290,
        "last_updated": null
    },
    {
        "urduURN": 4053480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5428,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے خالد نے بیان کیا ، ان سے عبداللہ بن عبدالرحمٰن نے بیان کیا ، ان سے حضرت انس رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، عورتوں پر عائشہ رضی اللہ عنہا کی فضیلت ایسی ہے جیسے تمام کھانوں پر ثرید کی فضیلت ہے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 146300,
        "last_updated": null
    },
    {
        "urduURN": 4053490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5429,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے مالک نے بیان کیا ، ان سے سمی نے ، ان سے صالح نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، سفر عذاب کا ایک ٹکڑا ہے ، جو انسان کوسونے اور کھانے سے روک دیتا ہے ۔ پس جب کسی شخص کی سفری ضرورت حسب منشا پوری ہو جائے تو اسے جلد ہی گھر واپس آ جانا چاہیئے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 146310,
        "last_updated": null
    },
    {
        "urduURN": 4053500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5430,
        "hadithSanad": "ہم سے قتیبہ بن سعیدنے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے ، ان سے ربیعہ نے ، انہوں نے قاسم بن محمد سے سنا ، آپ نے بیان کیا کہ",
        "hadithText": "بریرہ رضی اللہ عنہا کے ساتھ شریعت کی تین سنتیں قائم ہوئیں ۔ حضرت عائشہ رضی اللہ عنہا نے انہیں ( ان کے مالکوں سے ) خرید کر آزاد کرنا چاہا تو ان کے مالکوں نے کہا کہ ولاء کا تعلق ہم سے ہی قائم ہو گا ۔ ( عائشہ رضی اللہ عنہا نے بیان کیا کہ ) میں نے اس کا ذکر رسول اللہ صلی اللہ علیہ وسلم سے کیا تو آپ نے فرمایا کہ اگر تم یہ شرط لگا بھی لو جب بھی ولاء اسی کے ساتھ قائم ہو گا جو آزاد کرے گا ۔ پھر بیان کیا کہ بریرہ آزاد کی گئیں اور انہیں اختیار دیا گیا کہ اگر وہ چاہیں تو اپنے شوہر کے ساتھ رہیں یا ان سے الگ ہو جائیں اور تیسری بات یہ ہے کہ رسول اللہ صلی اللہ علیہ وسلم ایک دن عائشہ رضی اللہ عنہا کے گھر تشریف لائے ، چولھے پر ہانڈی پک رہی تھی ۔ آپ نے دوپہر کا کھانا طلب فرمایا تو روٹی اور گھر میں موجود سالن پیش کیا گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا کیا میں نے گوشت ( پکتے ہوئے ) نہیں دیکھا ہے ؟ عرض کیا کہ دیکھا ہے یا رسول اللہ ! لیکن وہ گوشت تو بریرہ کو صدقہ میں ملا ہے ، انہوں نے ہمیں ہدیہ کے طور پر دیا ہے ۔ آپ نے فرمایا کہ ان کے لیے وہ صدقہ ہے لیکن ہمارے لیے ہدیہ ہے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 146320,
        "last_updated": null
    },
    {
        "urduURN": 4053510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5431,
        "hadithSanad": "مجھ سے اسحاق بن ابراہیم حنظلی نے بیان کیا ، ان سے ابواسامہ نے ، ان سے ہشام نے بیان کیا ، انہوں نے کہا کہ مجھے میرے والد نے خبر دی اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم میٹھی چیز اور شہد پسند فرمایا کرتے تھے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 146330,
        "last_updated": null
    },
    {
        "urduURN": 4053520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5432,
        "hadithSanad": "ہم سے عبدالرحمٰن بن شیبہ نے بیان کیا ، کہا کہ مجھے ابن ابی الفدیک نے خبر دی ، انہیں ابن ابی ذئب نے ، انہیں مقبری نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں پیٹ بھرنے کے بعد ہر وقت نبی کریم صلی اللہ علیہ وسلم کے ساتھ ہی رہا کرتا تھا ۔ اس وقت میں روٹی نہیں کھاتا تھا ۔ نہ ریشم پہنتا تھا ، نہ فلاں اور فلانی میری خدمت کرتے تھے ( بھوک کی شدت کی وجہ سے بعض اوقات ) میں اپنے پیٹ پر کنکریاں لگا لیتا اور کبھی میں کسی سے کوئی آیت پڑھنے کے لیے کہتا حالانکہ وہ مجھے یاد ہوتی ۔ مقصد صرف یہ ہوتا کہ وہ مجھے اپنے ساتھ لے جائے اور کھانا کھلا دے اورمسکینوں کے لیے سب سے بہترین شخص حضرت جعفر بن ابی طالب رضی اللہ عنہ تھے ، ہمیں اپنے گھر ساتھ لے جاتے اور جو کچھ بھی گھر میں ہوتا کھلا دیتے تھے ۔ کبھی تو ایسا ہوتا کہ گھی کا ڈبہ نکال کر لاتے اور اس میں کچھ نہ ہوتا ۔ ہم اسے پھاڑ کراس میں جو کچھ لگا ہوتا چاٹ لیتے تھے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 146340,
        "last_updated": null
    },
    {
        "urduURN": 4053530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5433,
        "hadithSanad": "ہم سے عمرو بن علی نے بیان کیا ، کہا ہم سے ازہر بن سعد نے بیان کیا ، ان سے ابن عون نے ، ان سے شمامہ بن انس نے اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم اپنے ایک درزی غلام کے پاس تشریف لے گئے ، پھر آپ کی خدمت میں ( پکا ہوا ) کدو پیش کیا گیا اور آپ اسے ( رغبت کے ساتھ ) کھانے لگے ۔ اسی وقت سے میں بھی کدو پسند کرتا ہوں کیونکہ حضور اکرم صلی اللہ علیہ وسلم کو اسے میں نے کھاتے ہوئے دیکھا ہے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 146350,
        "last_updated": null
    },
    {
        "urduURN": 4053540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5434,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے اعمش نے ، ان سے ابووائل نے اور ان سے ابومسعود انصاری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جماعت انصار میں ایک صاحب تھے جنہیں ابوشعیب کہا جاتا تھا ۔ ان کے پاس ایک غلام تھا جو گوشت بیچتا تھا ۔ حضرت ابو شعیب رضی اللہ عنہ نے ان غلام سے کہا کہ تم میری طرف سے کھانا تیار کر دو ۔ میں چاہتا ہوں کہ رسول اللہ صلی اللہ علیہ وسلم سمیت پانچ آدمیوں کی دعوت کروں ۔ چنانچہ وہ حضور اکرم صلی اللہ علیہ وسلم کو چار دوسرے آدمیوں کے ساتھ بلا کرلائے ۔ ان کے ساتھ ایک صاحب بھی چلنے لگے تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہم پانچ آدمیوں کی تم نے دعوت کی ہے مگریہ صاحب بھی ہمارے ساتھ آ گئے ہیں ، اگر چاہو تو انہیں اجازت دو اور اگر چاہو منع کر دو ۔ حضرت ابو شعیب رضی اللہ عنہ نے کہا کہ میں نے انہیں بھی اجازت دے دی ۔ محمد بن یوسف نے بیان کیا کہ میں نے محمد بن اسماعیل سے سنا ، وہ بیان کرتے تھے کہ جب لوگ دسترخوان پر بیٹھے ہوں تو انہیں اس کی اجازت نہیں ہے کہ ایک دسترخوان والے دوسرے دسترخوان والوں کو اپنے دسترخوان سے اٹھا کر کوئی چیز دیں ۔ البتہ ایک ہی دسترخوان پر ان کے شرکاء کو اس میں سے کوئی چیز دینے نہ دینے کا اختیار ہے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 146360,
        "last_updated": null
    },
    {
        "urduURN": 4053550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5435,
        "hadithSanad": "مجھ سے عبداللہ بن منیر نے بیان کیا ، انہوں نے نضر سے سنا ، انہیں ابن عون نے خبر دی ، کہا کہ مجھے ثمامہ بن عبداللہ بن انس نے خبر دی اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نوعمر تھا اور رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رہتا تھا ۔ آنحضرت صلی اللہ علیہ وسلم اپنے ایک درزی غلام کے پاس تشریف لے گئے ۔ وہ ایک پیالہ لایا جس میں کھانا تھا اور اوپر کدو کے قتلے تھے ۔ آپ کدو تلاش کرنے لگے ۔ حضرت انس رضی اللہ عنہ نے بیان کیا کہ جب میں نے یہ دیکھا تو کدو کے قتلے آپ کے سامنے جمع کر کے رکھنے لگا ۔ حضرت انس رضی اللہ عنہ نے بیان کیا کہ ( پیالہ آنحضور صلی اللہ علیہ وسلم کے سامنے رکھنے کے بعد ) غلام اپنے کام میں لگ گیا ۔ حضرت انس رضی اللہ عنہ نے بیان کیا کہ اسی وقت سے میں کدو پسند کرنے لگا ، جب میں نے آنحضرت صلی اللہ علیہ وسلم کا یہ عمل دیکھا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 146370,
        "last_updated": null
    },
    {
        "urduURN": 4053560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5436,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، ان سے امام مالک بن انس نے ، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا کہ",
        "hadithText": "ایک درزی نے رسول اللہ صلی اللہ علیہ وسلم کو کھانے کی دعوت دی جو انہوں نے آنحضور صلی اللہ علیہ وسلم کے لیے تیار کیا تھا ۔ میں بھی آپ کے ساتھ گیا ۔ آنحضرت صلی اللہ علیہ وسلم کے سامنے جو کی روٹی اور شوربہ پیش کیا گیا ۔ جس میں کدو اور خشک گوشت کے ٹکڑے تھے ۔ میں نے دیکھا کہ آنحضرت صلی اللہ علیہ وسلم پیالے میں چاروں طرف کدو تلاش کر رہے تھے ۔ اسی دن سے میں بھی کدو پسند کرنے لگا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 146380,
        "last_updated": null
    },
    {
        "urduURN": 4053570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5437,
        "hadithSanad": "ہم سے حکیم ابونعیم نے بیان کیا ، کہا ہم سے مالک بن انس نے ، ان سے اسحاق بن عبداللہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں شوربہ لایا گیا ۔ اس میں کدو اور سوکھے گوشت کے ٹکڑے تھے ، پھر میں نے دیکھا کہ آنحضرت صلی اللہ علیہ وسلم اس میں سے کدو کے قتلے تلاش کر کر کے کھا رہے تھے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 146390,
        "last_updated": null
    },
    {
        "urduURN": 4053580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5438,
        "hadithSanad": "ہم سے قبیصہ نے بیان کیا ، ان سے سفیان نے بیان کیا ، ان سے عبدالرحمٰن بن عابس نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "آنحضرت صلی اللہ علیہ وسلم نے ایسا کبھی نہیں کیا کہ تین دن سے زیادہ گوشت قربانی والا رکھنے سے منع فرمایا ہو ۔ صرف اس سال یہ حکم دیا تھا جس سال قحط کی وجہ سے لوگ فاقے میں مبتلا تھے ۔ مقصد یہ تھا کہ جو لوگ غنی ہیں وہ گوشت محتاجوں کو کھلائیں ( اور جمع کر کے نہ رکھیں ) اور ہم تو بکری کے پائے محفوظ کر کے رکھ لیتے تھے اور پندرہ دن بعد تک ( کھاتے تھے ) اور آل محمد صلی اللہ علیہ وسلم نے کبھی سالن کے ساتھ گیہوں کی روٹی تین دن تک برابر سیر ہو کر نہیں کھائی ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 146400,
        "last_updated": null
    },
    {
        "urduURN": 4053590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5439,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا کہ",
        "hadithText": "ایک درزی نے رسول اللہ صلی اللہ علیہ وسلم کو کھانے کی دعوت دی جو اس نے آنحضرت صلی اللہ علیہ وسلم کے لیے تیار کیا تھا ۔ حضرت انس رضی اللہ عنہ نے بیان کیا کہ میں بھی حضور اکرم صلی اللہ علیہ وسلم کے ساتھ اس دعوت میں گیا ۔ انہوں نے آپ کی خدمت میں جو کی روٹی اور شوربہ ، جس میں کدو اور خشک کیا ہوا گوشت تھا ، پیش کیا ۔ حضرت انس رضی اللہ عنہ نے کہا کہ میں نے دیکھا کہ حضور اکرم صلی اللہ علیہ وسلم پیالہ میں چاروں طرف کدو تلاش کر رہے ہیں ۔ اسی دن سے میں بھی کدو پسند کرنے لگا ۔ شمامہ نے بیان کیا اور ان سے حضرت انس رضی اللہ عنہ نے کہ پھر میں آنحضرت صلی اللہ علیہ وسلم کے سامنے کدو کے قتلے ( تلاش کر کر کے ) اکٹھے کرنے لگا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 146410,
        "last_updated": null
    },
    {
        "urduURN": 4053600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5440,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، انہوں نے کہا کہ مجھ سے ابراہیم بن سعد نے بیان کیا ، ان سے ان کے والد نے اور ان سے عبداللہ بن جعفر بن ابی طالب رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم کو تازہ کھجورککڑی کے ساتھ کھاتے دیکھا ہے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 146420,
        "last_updated": null
    },
    {
        "urduURN": 4053610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5441,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے حماد بن یزید نے بیان کیا ، ان سے عباس جریری نے اور ان سے ابوعثمان نے بیان کیا کہ",
        "hadithText": "میں حضرت ابوہریرہ رضی اللہ عنہ کے یہاں سات دن تک مہمان رہا ، وہ اور ان کی بیوی اور ان کے خادم نے رات میں ( جاگنے کی ) باری مقرر کر رکھی تھی ۔ رات کے ایک تہائی حصہ میں ایک صاحب نماز پڑھتے رہے پھر وہ دوسرے کوجگا دیتے اور میں نے حضرت ابوہریرہ رضی اللہ عنہ کو یہ کہتے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنے صحابہ میں ایک مرتبہ کھجور تقسیم کی اور مجھے بھی سات کھجوریں دیں ، ایک ان میں خراب تھی ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 146430,
        "last_updated": null
    },
    {
        "urduURN": 4053620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن صباح نے بیان کیا ، انہوں نے کہا ہم سے اسماعیل بن زکریا نے بیان کیا ، ان سے عاصم نے ، ان سے ابوعثمان نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ہم میں کھجور تقسیم کی پانچ مجھے عنایت فرمائیں چار تو اچھی کھجوریں تھیں اور ایک خراب تھی جو میرے دانتوں کے لیے سب سے زیادہ سخت تھی ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 146440,
        "last_updated": null
    },
    {
        "urduURN": 4053630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5442,
        "hadithSanad": "اورمحمد بن یوسف نے بیان کیا ، ان سے سفیان نے بیان کیا ، ان سے منصور ابن صفیہ نے ، ان سے ان کی والدہ نے بیان کیا اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کی وفات ہو گئی اور ہم پانی اور کھجور ہی سے ( اکثر دنوں میں ) پیٹ بھرتے رہے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 146450,
        "last_updated": null
    },
    {
        "urduURN": 4053640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5443,
        "hadithSanad": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم سے ابو غسان نے بیان کیا ، کہا کہ مجھ سے ابوحازم نے بیان کیا ، ان سے ابراہیم بن عبدالرحمٰن بن عبداللہ بن ابی ربیعہ نے اور ان سے حضرت جابر بن عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "مدینہ میں ایک یہودی تھا اور وہ مجھے قرض اس شرط پر دیا کرتا تھا کہ میری کھجوریں تیار ہونے کے وقت لے لے گا ۔ حضرت جابر رضی اللہ عنہ کی ایک زمین بئررومہ کے راستہ میں تھی ۔ ایک سال کھجور کے باغ میں پھل نہیں آئے ۔ پھل چنے جانے کا جب وقت آیا تو وہ یہودی میرے پاس آیا لیکن میں نے تو باغ سے کچھ بھی نہیں توڑا تھا ۔ اس لیے میں آئندہ سال کے لیے مہلت مانگنے لگا لیکن اس نے مہلت دینے سے انکار کیا ۔ اس کی خبر جب رسول اللہ صلی اللہ علیہ وسلم کو دی گئی تو آپ نے اپنے صحابہ سے فرمایا کہ چلو ، یہودی سے جابر رضی اللہ عنہ کے لیے ہم مہلت مانگیں گے ۔ چنانچہ یہ سب میرے باغ میں تشریف لائے ۔ آنحضرت صلی اللہ علیہ وسلم اس یہودی سے گفتگو فرماتے رہے لیکن وہ یہی کہتا رہا کہ ابوالقاسم میں مہلت نہیں دے سکتا ۔ جب آنحضرت صلی اللہ علیہ وسلم نے یہ دیکھا تو آپ کھڑے ہو گئے اورکھجور کے باغ میں چاروں طرف پھرے پھر تشریف لائے اور اس سے گفتگو کی لیکن اس نے اب بھی انکار کیا پھر میں کھڑا ہوا اور تھوڑی سی تازہ کھجور لا کر آنحضرت صلی اللہ علیہ وسلم کے سامنے رکھی ۔ آنحضرت صلی اللہ علیہ وسلم نے ان کو تناول فرمایا پھر فرمایا جابر ! تمہاری جھونپڑی کہاں ہے ؟ میں نے آپ کو بتایا تو آپ نے فرمایا کہ اس میں میرے لیے کچھ فرش بچھا دو ۔ میں نے بچھا دیا تو آپ داخل ہوئے اور آرام فرمایا پھر بیدار ہوئے تو میں ایک مٹھی اورکھجور لایا ۔ آنحضرت صلی اللہ علیہ وسلم نے اس میں سے بھی تناول فرمایا پھر آپ کھڑے ہوئے اور یہودی سے گفتگو فرمائی ۔ اس نے اب بھی انکار کیا ۔ آنحضرت صلی اللہ علیہ وسلم دوبارہ باغ میں کھڑے ہوئے پھر فرمایا ، جابر ! جاؤ اب پھل توڑو اور قرض ادا کر دو ۔ آپ کھجوروں کے توڑے جانے کی جگہ کھڑے ہو گئے اور میں نے باغ میں سے اتنی کھجوریں توڑ لیں جن سے میں نے قرض ادا کر دیا اور اس میں سے کھجوریں بچ بھی گئی پھر میں وہاں سے نکلا اورحضور اکرم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر یہ خوشخبری سنائی تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا میں گواہی دیتا ہوں کہ میں اللہ کا رسول ہوں ۔ حضرت ابوعبداللہ امام بخاری رحمہ اللہ نے کہا کہ اس حدیث میں جو عروش کا لفظ ہے ۔ عروش ” اور عریش “ عمارت کی چھت کو کہتے ہیں ۔ حضرت ابن عباس رضی اللہ عنہما نے کہا کہ ( سورۃ الانعام میں لفظ ) ” معروشات “ سے مراد انگور وغیرہ کی ٹٹیاں ہیں ۔ دوسری آیت ( سورۃ البقرہ ) ” خاویۃعلی عروشھا “ یعنی اپنی چھتوں پر گرے ہوئے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 146460,
        "last_updated": null
    },
    {
        "urduURN": 4053650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5444,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، ان سے اعمش نے بیان کیا ، کہا کہ مجھ سے مجاہد نے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں بیٹھے ہوئے تھے کہ کھجور کے درخت کا گابھہ لایا گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا بعض درخت ایسے ہوتے ہیں جن کی برکت مسلمان کی برکت کی طرح ہوتی ہے ۔ میں نے خیال کیا کہ آپ کا اشارہ کھجور کے درخت کی طرف ہے ۔ میں نے سوچا کہ کہہ دوں کہ وہ درخت کھجور کا ہوتا ہے یا رسول اللہ ! لیکن پھر جو میں نے مڑ کر دیکھا تو مجلس میں میرے علاوہ نو آدمی اور تھے اور میں ان میں سب سے چھوٹا تھا ۔ اس لیے میں خاموش رہا پھر آپ نے فرمایا کہ وہ درخت کھجور کا ہے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 146470,
        "last_updated": null
    },
    {
        "urduURN": 4053660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5445,
        "hadithSanad": "ہم سے جمعہ بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے مروان نے بیان کیا ، انہوں نے کہا ہم کو ہاشم بن ہاشم نے خبر دی ، انہوں نے کہا ہم کو عامر بن سعد نے خبر دی اور ان سے ان کے والد سعد بن ابی وقاص رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس نے ہر دن صبح کے وقت سات عجوہ کھجوریں کھالیں ، اسے اس دن نہ زہر نقصان پہنچا سکے گا اور نہ جادو ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 146480,
        "last_updated": null
    },
    {
        "urduURN": 4053670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5446,
        "hadithSanad": "ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے جبلہ بن سحیم نے بیان کیا ، کہا کہ",
        "hadithText": "ہمیں عبداللہ بن زبیر رضی اللہ عنہما کے ساتھ ( جب وہ حجاز کے خلیفہ تھے ) ایک سال قحط کا سامنا کرنا پڑا تو انہوں نے راشن میں ہمیں کھانے کے لیے کھجوریں دیں ۔ عبداللہ بن عمر رضی اللہ عنہما ہمارے پاس سے گزرتے اور ہم کھجور کھاتے ہوتے تو وہ فرماتے کہ دو کھجور وں کو ایک ساتھ ملا کر نہ کھاؤ کیونکہ نبی کریم صلی اللہ علیہ وسلم نے دو کھجور وں کو ایک ساتھ ملا کر کھانے سے منع کیا ہے ، پھر فرمایا سوا اس صورت کے جب اس کو کھانے والا شخص اپنے ساتھی سے ( جو کھانے میں شریک ہے ) اس کی اجازت لے لے ۔ شعبہ نے بیان کیا کہ اجازت والاٹکڑا حضرت ابن عمر رضی اللہ عنہما کا قول ہے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 146490,
        "last_updated": null
    },
    {
        "urduURN": 4053680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5447,
        "hadithSanad": "مجھ سے اسماعیل بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے ابراہیم بن سعد نے بیان کیا ، ان سے ان کے والد نے بیان کیا اور انہوں نے حضرت ابن عمر رضی اللہ عنہما سے سنا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم کو کھجور کو ککڑی کے ساتھ کھاتے ہوئے دیکھا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 146500,
        "last_updated": null
    },
    {
        "urduURN": 4053690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5448,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، انہوں نے کہا ہم سے محمد بن طلحہ نے بیان کیا ، ان سے زبید نے بیان کیا ، ان سے مجاہد نے بیان کیا ، انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ درختوں میں ایک درخت مثل مسلمان کے ہے اور وہ کھجور کا درخت ہے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 146510,
        "last_updated": null
    },
    {
        "urduURN": 4053700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5449,
        "hadithSanad": "ہم سے ابن مقاتل نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ نے خبر دی ، انہوں نے کہا ہم کو ابراہیم بن سعد نے خبر دی ، انہیں ان کے والد نے اور ان سے عبداللہ بن جعفر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو ککڑی کے ساتھ کھجور کھاتے ہوئے دیکھا ہے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 146520,
        "last_updated": null
    },
    {
        "urduURN": 4053710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5450,
        "hadithSanad": "ہم سے صلت بن محمد نے بیان کیا ، کہا ہم سے حماد بن زید نے ، ان سے جعد ابوعثمان نے ان سے انس رضی اللہ عنہ نے اور ( اس کی روایت حماد نے ) ہشام سے بھی کی ، ان سے محمد نے اور ان سے انس رضی اللہ عنہ نے اور سنان ابو ربیعہ سے ( بھی کی ) اور ان سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "ان کی والدہ ام سلیم رضی اللہ عنہا نے ایک مدجو لیا اور ان سے پیس کر اس کا خطیفہ ( آٹے کو دودھ میں ملا کر پکاتے ہیں ) پکایا اور ان کے پاس جو گھی کا ڈبہ تھا اس میں اس پر سے گھی نچوڑا ، پھر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ( بلانے کے لیے ) بھیجا ۔ میں آنحضرت صلی اللہ علیہ وسلم کی خدمت میں گیا تو آپ اپنے صحابہ کے ساتھ تشریف رکھتے تھے ۔ میں نے آپ کو کھانا کھانے کے لیے بلایا ۔ آپ نے دریافت فرمایا اور وہ لوگ بھی جو میرے ساتھ ہیں ؟ چنانچہ میں واپس آیا اور کہا کہ آنحضرت صلی اللہ علیہ وسلم تو فرماتے ہیں کہ جو میرے ساتھ موجود ہیں وہ بھی چلیں گے ۔ اس پر ابوطلحہ آپ کی خدمت میں حاضر ہوئے اور عرض کیا کہ یا رسول اللہ ! وہ تو ایک چیز ہے جو ام سلیم نے آپ کے لیے پکائی ہے ۔ آنحضرت صلی اللہ علیہ وسلم تشریف لائے اور کھانا آپ کے پاس لایا گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ دس آدمیوں کو میرے پاس اندر بلا لو ۔ چنانچہ دس صحابہ داخل ہوئے اور کھانا پیٹ بھر کر کھایا پھر فرمایا دس آدمیوں کو میرے پاس اور بلا لو ۔ یہ دس بھی اندر آئے اور پیٹ بھر کر کھایا پھر فرمایا اور دس آدمیوں کو بلا لو ۔ اس طرح انہوں نے چالیس آدمیوں کا شمار کیا ۔ اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے کھانا کھایا پھر آپ کھڑے ہوئے تو میں دیکھنے لگا کہ کھانے میں سے کچھ بھی کم نہیں ہوا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 146530,
        "last_updated": null
    },
    {
        "urduURN": 4053720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5451,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، ان سے عبدالعزیز نے بیان کیا کہ",
        "hadithText": "حضرت انس رضی اللہ عنہ نے کہا میں نے نبی کریم صلی اللہ علیہ وسلم کو لہسن کے بارے میں کچھ کہتے نہیں سنا ۔ البتہ آپ نے فرمایا کہ جو شخص ( لہسن ) کھائے تو وہ ہماری مسجد کے قریب نہ آئے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 146540,
        "last_updated": null
    },
    {
        "urduURN": 4053730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5452,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے ابوصفوان عبداللہ بن سعید نے بیان کیا ، کہا ہم کو یونس نے خبر دی ، ان سے ابن شہاب نے بیان کیا ، ان سے عطاء نے بیان کیا کہ",
        "hadithText": "حضرت جابر بن عبداللہ رضی اللہ عنہما کہتے تھے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے لہسن یا پیاز کھائی ہو تو اسے چاہئے کہ ہم سے دور رہے ۔ یا یہ فرمایا کہ ہماری مسجد سے دور رہے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 146550,
        "last_updated": null
    },
    {
        "urduURN": 4053740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5453,
        "hadithSanad": "ہم سے سعید بن عفیر نے بیان کیا ، کہا ہم سے ابن وہب نے بیان کیا ، ان سے یونس نے ، ان سے ابن شہاب نے بیان کیا انہیں ابوسلمہ نے خبر دی ، کہا کہ مجھے حضرت جابر بن عبداللہ رضی اللہ عنہما نے خبر دی ، انہوں نے بیان کیا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ مقام مرالظہران پر تھے ، ہم پیلو توڑ رہے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جو خوب کالا ہو وہ تو ڑو کیونکہ وہ زیادہ لذیذ ہوتا ہے ۔ حضرت جابر رضی اللہ عنہ نے عرض کیا آپ نے بکریاں چرائی ہیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں اور کوئی نبی ایسا نہیں گزرا جس نے بکریاںنہ چرائی ہوں ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 146560,
        "last_updated": null
    },
    {
        "urduURN": 4053750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5454,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، انہوں نے یحییٰ بن سعید سے سنا ، انہوں نے بشیر بن یسار سے ، ان سے سوید بن نعمان نے ، کہا کہ",
        "hadithText": "ہم رسول کریم صلی اللہ علیہ وسلم کے ساتھ خیبر روانہ ہوئے ۔ جب ہم مقام صہبا پر پہنچے تو آنحضرت صلی اللہ علیہ وسلم نے کھانا طلب فرمایا ۔ کھانے میں ستو کے سوا اور کوئی چیز نہیں لائی گئی ، پھر ہم نے کھانا کھایا اور آنحضور صلی اللہ علیہ وسلم کلی کر کے نماز کے لیے کھڑے ہو گئے ۔ ہم نے بھی کلی کی ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 146570,
        "last_updated": null
    },
    {
        "urduURN": 4053760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5455,
        "hadithSanad": "یحییٰ نے بیان کیا کہ میں نے بشیر سے سنا ، انہوں نے بیان کیا ہم سے سوید رضی اللہ عنہ نے بیان کیا",
        "hadithText": "ہم رسول اللہ صلی اللہ علیہ و سلم کے ساتھ خیبر کی طرف نکلے جب ہم مقام صہبا پر پہنچے ۔ یحییٰ نے کہا کہ یہ جگہ خیبر سے ایک منزل کی دوری پر ہے تو آنحضرت صلی اللہ علیہ وسلم نے کھانا طلب فرمایا لیکن ستو کے سوا اور کوئی چیز نہیں لائی گئی ۔ ہم نے اسے آپ کے ساتھ کھایا پھر آپ نے ہمیں مغرب کی نماز پڑھائی اور نیا وضو نہیں کیا اور سفیان نے کہا گویا کہ تم یہ حدیث یحییٰ ہی سے سن رہے ہو ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 146580,
        "last_updated": null
    },
    {
        "urduURN": 4053770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5456,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے سفیان نے بیان کیا ، ان سے عمرو بن دینار نے ، ان سے عطاء نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب کوئی شخص کھانا کھائے تو ہاتھ چاٹنے یا کسی کو چٹانے سے پہلے ہاتھ نہ پونچھے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 146590,
        "last_updated": null
    },
    {
        "urduURN": 4053780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5457,
        "hadithSanad": "ہم سے ابراہیم بن المنذر نے بیان کیا ، کہا کہ مجھ سے محمد بن فلیح نے بیان کیا ، کہا کہ مجھ سے میرے والد نے ، ان سے سعیدبن الحارث نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے کہ",
        "hadithText": "سعید بن الحارث نے جابر رضی اللہ عنہ سے ایسی چیز کے ( کھانے کے بعد ) جو آگ پر رکھی ہو وضو کے متعلق پوچھا ( کہ کیا ایسی چیز کھانے سے وضو ٹوٹ جاتا ہے ؟ ) تو انہوں نے کہا کہ نہیں ۔ نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں ہمیں اس طرح کا کھانا ( جو پکا ہوا ہوتا ) بہت کم میسر آتا تھا اور اگر میسر آبھی جاتا تھا تو سوا ہماری ہتھیلیوں بازوؤں اور پاؤں کے کوئی رومال نہیں ہوتا تھا ( اور ہم انہیں سے اپنے ہاتھ صاف کر کے ) نماز پڑھ لیتے تھے اور وضو ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 146600,
        "last_updated": null
    },
    {
        "urduURN": 4053790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5458,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے ثور نے ، ان سے خالد بن معدان نے اور ان سے حضرت ابوامامہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے سامنے سے جب کھانا اٹھایا جاتا تو آپ یہ دعا پڑھتے ۔ تمام تعریفیں اللہ کے لیے ، بہت زیادہ پاکیزہ برکت والی ، ہم اس کھانے کا حق پوری طرح ادا نہ کر سکے اور یہ ہمیشہ کے لیے رخصت نہیں کیا گیا ہے ( اور یہ اس لیے کہا تاکہ ) اس سے ہم کو بےپرواہی کا خیال نہ ہو ، اے ہمارے رب ! “</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 146610,
        "last_updated": null
    },
    {
        "urduURN": 4053800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5459,
        "hadithSanad": "ہم سے ابو عاصم نے بیان کیا ، ان سے ثور بن یزید نے بیان کیا ، ان سے خالدبن معدان نے اور ان سے حضرت ابوامامہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جب کھانے سے فارغ ہوتے اور ایک مرتبہ بیان کیا کہ جب آنحضرت صلی اللہ علیہ وسلم اپنا دسترخوان اٹھاتے یہ دعا پڑھتے ” تمام تعریفیں اس اللہ کے لیے ہیں جس نے ہماری کفایت کی اور ہمیں سیراب کیا ۔ ہم اس کھانے کا حق پوری طرح ادا نہ کر سکے ورنہ ہم اس نعمت کے منکر نہیں ہیں ۔ اور ایک مرتبہ فرمایا ” تیرے ہی لیے تمام تعریفیں ہیں اے ہمارے رب ! اس کا حق ادا نہیں کر سکے اور نہ یہ ہمیشہ کے لیے رخصت کیا گیا ہے ۔ ( یہ اس لیے کہا تاکہ ) اس سے ہم کو بے نیازی کا خیال نہ ہو ۔ اے ہمارے رب ! “</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 146620,
        "last_updated": null
    },
    {
        "urduURN": 4053810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5460,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے محمد نے ، وہ زیاد کے صاحبزادے ہیں ، کہا کہ",
        "hadithText": "میں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جب تم میں کسی شخص کا خادم اس کا کھانا لائے تو اگر وہ اسے اپنے ساتھ نہیں بٹھا سکتا تو کم از کم ایک یا دو لقمہ اس کھانے میں سے اسے کھلا دے ( کیونکہ ) اس نے ( پکاتے وقت ) اس کی گرمی اور تیاری کی مشقت برداشت کی ہے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 146630,
        "last_updated": null
    },
    {
        "urduURN": 4053820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5461,
        "hadithSanad": "ہم سے عبداللہ بن ابی اسود نے بیان کیا ، کہا ہم سے ابواسامہ نے ، ان سے اعمش نے ، ان سے شقیق نے ، اور ان سے ابومسعود انصاری رضی اللہ عنہ نے بیان کیا ، انہوں نے بیان کیا کہ",
        "hadithText": "جماعت انصار کے ایک صحابی ابو شعیب رضی اللہ عنہ کے نام سے مشہور تھے ۔ ان کے پاس ایک غلام تھا جو گوشت بیچا کرتا تھا ۔ وہ صحابی نبی کریم صلی اللہ علیہ وسلم کی مجلس میں حاضر ہوئے تو آنحضرت صلی اللہ علیہ وسلم اپنے صحابہ کے ساتھ تشریف رکھتے تھے ۔ انہوں نے آنحضرت صلی اللہ علیہ وسلم کے چہرہ مبارک سے فاقہ کا اندازہ لگا لیا ۔ چنانچہ وہ اپنے گوشت فروش غلام کے پاس گئے اور کہا کہ میرے لیے پانچ آدمیوں کا کھانا تیار کر دو ۔ میں حضور اکرم صلی اللہ علیہ وسلم کو چار دوسرے آدمیوں کے ساتھ دعوت دوں گا ۔ غلام نے کھانا تیار کر دیا ۔ اس کے بعد ابو شعیب رضی اللہ عنہ آنحضرت صلی اللہ علیہ وسلم کی خدمت میں گئے اور آپ کو کھانے کی دعوت دی ۔ ان کے ساتھ ایک اور صاحب بھی چلنے لگے تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا اے ابو شعیب ! یہ صاحب بھی ہمارے ساتھ آ گئے ہیں ، اگر تم چاہو تو انہیں بھی اجازت دے دو اور اگر چا ہو تو چھوڑ دو ۔ انہوں نے عرض کیا نہیں بلکہ میں انہیں بھی اجازت دیتا ہوں ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 146640,
        "last_updated": null
    },
    {
        "urduURN": 4053830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5462,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے اور لیث نے بیان کیا ، کہا انہوں نے کہ مجھ سے یونس نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، انہیں جعفر بن عمرو بن امیہ رضی اللہ عنہ نے خبر دی ، انہیں ان کے والد عمرو بن امیہ نے خبر دی کہ",
        "hadithText": "انہوں نے دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم اپنے ہاتھ سے بکری کے شانے کا گوشت کاٹ کاٹ کر کھا رہے تھے ، پھر آپ کو نماز کے لیے بلایا گیا تو آپ گوشت اور چھری جس سے آپ کاٹ رہے تھے ، چھوڑ کر کھڑے ہو گئے اور نماز پڑھائی اور اس نماز کے لیے نیا وضو نہیں کیا ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 146650,
        "last_updated": null
    },
    {
        "urduURN": 4053840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5463,
        "hadithSanad": "ہم سے معلی بن اسد نے بیان کیا ، انہوں نے کہا ہم سے وہیب نے بیان کیا ، ان سے ایوب نے ، ان سے ابوقلابہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب رات کا کھانا سامنے رکھ دیا گیا ہو اور نماز بھی کھڑی ہو گئی ہو تو پہلے کھانا کھاؤ ۔ اور ایوب سے روایت ہے ، ان سے نافع نے ، ان سے حضرت ابن عمر رضی اللہ عنہما نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے اسی کے مطابق ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 146660,
        "last_updated": null
    },
    {
        "urduURN": 4053850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5464,
        "hadithSanad": "اور ایوب سے روایت ہے ، ان سے نافع نے کہ",
        "hadithText": "حضرت ابن عمر رضی اللہ عنہما نے ایک مرتبہ رات کا کھانا کھایا اور اس وقت آپ امام کی قرآت سن رہے تھے ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 146670,
        "last_updated": null
    },
    {
        "urduURN": 4053860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5465,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب نماز کھڑی ہو چکے اور رات کا کھانا بھی سامنے ہو تو کھانا کھاؤ ۔ وہیب اور یحییٰ بن سعید نے بیان کیا ، ان سے ہشام نے کہ ” جب رات کا کھانا رکھا جا چکے ۔ “</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 146680,
        "last_updated": null
    },
    {
        "urduURN": 4053870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 69,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5466,
        "hadithSanad": "مجھ سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے یعقوب بن ابراہیم نے بیان کیا ، کہا کہ مجھ سے میرے والد نے بیان کیا ، ان سے صالح نے ، ان سے ابن شہاب نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں پردہ کے حکم کے بارے میں زیادہ جانتا ہوں ۔ ابی بن کعب رضی اللہ عنہ بھی مجھ سے اس کے بارے میں پوچھا کرتے تھے ۔ زینب بنت جحش رضی اللہ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کی شادی کا موقع تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے نکاح مدینہ منورہ میں کیا تھا ۔ دن چڑھنے کے بعد حضور اکرم صلی اللہ علیہ وسلم نے لوگوں کی کھانے کی دعوت کی تھی ۔ آپ بیٹھے ہوئے تھے اور آپ کے ساتھ بعض اور صحابہ بھی بیٹھے ہوئے تھے ۔ اس وقت تک دوسرے لوگ ( کھانے سے فارغ ہو کر ) جا چکے تھے ۔ آخر آپ بھی کھڑے ہو گئے اور چلتے رہے ۔ میں بھی آپ کے ساتھ چلتا رہا ۔ آپ عائشہ رضی اللہ عنہا کے حجرے پر پہنچے پھر آپ نے خیال کیا کہ وہ لوگ ( بھی جو کھانے کے بعد گھر بیٹھے رہ گئے تھے ) جا چکے ہوں گے ( اس لیے آپ واپس تشریف لائے ) میں بھی آپ کے ساتھ واپس آیا لیکن وہ لوگ اب بھی اسی جگہ بیٹھے ہوئے تھے ۔ آپ پھر واپس آ گئے ۔ میں بھی آپ کے ساتھ دوبارہ واپس آیا ۔ آپ عائشہ رضی اللہ عنہا کے حجرہ پر پہنچے پھر آپ وہاں سے واپس ہوئے ۔ میں بھی آپ کے ساتھ تھا ۔ اب وہ لوگ جا چکے تھے ۔ اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے اپنے اور میرے درمیان پردہ لٹکایا اور پردہ کی آیت نازل ہوئی ۔</b>",
        "bookID": "70.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 146690,
        "last_updated": null
    }
]