[
    {
        "urduURN": 4055010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5575,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا ، انہوں نے کہا ہم کو امام مالک نے خبر دی ، انہیں نافع نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس نے دنیا میں شراب پی اور پھر اس نے توبہ نہیں کی تو آخرت میں وہ اس سے محروم رہے گا ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 147810,
        "last_updated": null
    },
    {
        "urduURN": 4055020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5576,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ، کہا مجھ کو حضرت سعید بن مسیب نے خبر دی اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا کہ",
        "hadithText": "جس رات رسول اللہ صلی اللہ علیہ وسلم کو معراج کرائی گئی تو آپ صلی اللہ علیہ وسلم کو ( بیت المقدس کے شہر ) ایلیاء میں شراب اور دودھ دو پیالے پیش کئے گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے انہیں دیکھا پھر آپ صلی اللہ علیہ وسلم نے دودھ کا پیالہ لے لیا ۔ اس پر حضرت جبرائیل علیہ السلام نے کہا اس اللہ کے لیے تمام تعریفیں ہیں جس نے آپ صلی اللہ علیہ وسلم کو دین فطرت کی طرف چلنے کی ہدایت فرمائی ۔ اگر آپ صلی اللہ علیہ وسلم نے شراب کا پیالہ لے لیا ہوتا تو آپ صلی اللہ علیہ وسلم کی امت گمراہ ہو جاتی ۔ شعیب کے ساتھ اس حدیث کو معمر ، ابن الہاد ، عثمان بن عمر اور زبیدی نے زہری سے نقل کیا ہے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 147820,
        "last_updated": null
    },
    {
        "urduURN": 4055030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5577,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے ہشام دستوائی نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے ایک حدیث سنی جو تم سے اب میرے سوا کوئی اور نہیں بیان کرے گا ۔ ( کیونکہ اب میرے سوا کوئی صحابی زندہ موجود نہیں رہا ہے ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ قیامت کی نشانیوں میں سے یہ ہے کہ جہالت غالب ہو جائے گی اور علم کم ہو جائے گا ، زناکاری بڑھ جائے گی ، شراب کثرت سے پی جانے لگے گی ، عورتیں بہت ہو جائیں گی ، یہاں تک کہ پچاس پچاس عورتوں کی نگرانی کرنے والا صرف ایک ہی مرد رہ جائے گا ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 147830,
        "last_updated": null
    },
    {
        "urduURN": 4055040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5578,
        "hadithSanad": "ہم سے احمد بن صالح نے بیان کیا ، کہا ہم سے ابن وہب نے بیان کیا ، کہا کہ مجھے یونس نے خبر دی ، ان سے ابن شہاب نے بیان کیا ، کہا کہ میں نے ابوسلمہ بن عبدالرحمٰن اور ابن مسیب سے سنا ، وہ بیان کرتے تھے کہ حضرت ابوہریرہ رضی اللہ عنہ نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کوئی شخص جب زنا کرتا ہے تو عین زنا کرتے وقت وہ مومن نہیں ہوتا ۔ اسی طرح جب وہ شراب پیتا ہے تو عین شراب پیتے وقت وہ مومن نہیں ہوتا ۔ اسی طرح جب چور چوری کرتا ہے تو اس وقت وہ مومن نہیں ہوتا ۔ اورابن شہاب نے بیان کیا ، انہیں عبدالملک بن ابی بکر بن عبدالرحمٰن بن حارث بن ہشام نے خبر دی ، ان سے حضرت ابوبکر رضی اللہ عنہ بیان کرتے تھے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ پھر انہوں نے بیان کیا کہ حضرت ابوبکر بن عبدالرحمٰن حضرت ابوہریرہ رضی اللہ عنہ کی حدیث میں امور مذکورہ کے ساتھ اتنا اور زیادہ کرتے تھے کہ کوئی شخص ( دن دھاڑے ) اگر کسی بڑی پونجی پر اس طور ڈاکہ ڈالتا ہے کہ لوگ دیکھتے کے دیکھتے رہ جاتے ہیں تو وہ مومن رہتے ہوئے یہ لوٹ مار نہیں کرتا ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 147840,
        "last_updated": null
    },
    {
        "urduURN": 4055050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5579,
        "hadithSanad": "ہم سے حسن بن صباح نے بیان کیا ، کہا ہم سے محمد بن سابق نے بیان کیا ، کہا ہم سے امام مالک نے جو مغول کے صاحبزادے ہیں ، بیان کیا ان سے نافع نے اور ان سے حضرت ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "جب شراب حرام کی گئی تو انگور کی شراب مدینہ منورہ میں نہیں ملتی تھی ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 147850,
        "last_updated": null
    },
    {
        "urduURN": 4055060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5580,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، انہوں نے کہا ہم سے ابو شہاب عبد ربہ بن نافع نے بیان کیا ، انہوں نے کہا کہ",
        "hadithText": "ہم سے یونس نے ، ان سے ثابت بنانی نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ جب شراب ہم پر حرام کی گئی تو مدینہ منورہ میں انگور کی شراب بہت کم ملتی تھی ۔ عام استعمال کی شراب کچی اور پکی کھجور سے تیار کی جاتی تھی</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 147860,
        "last_updated": null
    },
    {
        "urduURN": 4055070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5581,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، کہا ان سے ابو حیان نے ، کہا",
        "hadithText": "ہم سے عامر نے بیان کیا اور ان سے حضرت ابن عمر رضی اللہ عنہما نے کہ حضرت عمر رضی اللہ عنہ ممبر پر کھڑے ہوئے اور کہا امابعد ! جب شراب کی حرمت کا حکم نازل ہوا تو وہ پانچ چیزوں سے بنتی تھی ۔ انگور ، کھجور ، شہد ، گیہوں اور جو اور شراب ( خمر ) وہ ہے جو عقل کو زائل کر دے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 147870,
        "last_updated": null
    },
    {
        "urduURN": 4055080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5582,
        "hadithSanad": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، انہوں نے کہا کہ مجھ سے مالک بن انس نے بیان کیا ، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں ابوعبیدہ ، ابوطلحہ اور ابی بن کعب رضی اللہ عنہم کو کچی اور پکی کھجور سے تیار کی ہوئی شراب پلا رہا تھا کہ ایک آنے والے نے آ کر بتایا کہ شراب حرام کر دی گئی ہے ۔ اس وقت حضرت ابوطلحہ رضی اللہ عنہ نے کہا کہ انس اٹھو اور شراب کو بہا دو ۔ چنانچہ میں نے اسے بہا دیا ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 147880,
        "last_updated": null
    },
    {
        "urduURN": 4055090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5583,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے معمر نے بیان کیا ، ان سے ان کے والد نے کہ میں نے حضرت انس رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "ایک قبیلہ میں کھڑا میں اپنے چچاؤں کو کھجور کی شراب پلا رہا تھا میں ان میں سب سے کم عمر تھا ۔ کسی نے کہا کہ شراب حرام کر دی گئی ۔ ان حضرات نے کہا کہ اب اسے پھینک دو ۔ چنانچہ ہم نے شراب پھینک دی ۔ میں نے انس رضی اللہ عنہ سے پوچھا کہ وہ کس چیز کی شراب بنتی تھی ؟ فرمایا کہ تازہ پکی ہوئی اور کچی کھجوروں کی ۔ ابوبکر بن انس نے کہا کہ ان کی شراب ( کھجور کی ) ہوتی تھی تو حضرت انس رضی اللہ عنہ نے اس کا انکار نہیں کیا اور مجھ سے میرے بعض اصحاب نے بیان کیا کہ انہوں نے حضرت انس رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ اس زمانہ میں ان کی شراب اکثر کچی اور پکی کھجور سے تیار کی جاتی تھی ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 147890,
        "last_updated": null
    },
    {
        "urduURN": 4055100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5584,
        "hadithSanad": "ہم سے محمد بن ابی بکر مقدمی نے بیان کیا ، انہوں نے کہا ہم سے یوسف ابو معشر براء نے بیان کیا ، انہوں نے کہا کہ میں نے سعید بن عبداللہ سے سنا ، انہوں نے کہا کہ مجھ سے بکر بن عبداللہ نے بیان کیا اور انہوں نے کہا کہ",
        "hadithText": "مجھ سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ جب شراب حرام کی گئی تو وہ کچی اور پختہ کھجوروں سے تیار کی جاتی تھی ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 147900,
        "last_updated": null
    },
    {
        "urduURN": 4055110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5585,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں ابن شہاب نے ، انہیں ابوسلمہ بن عبدالرحمٰن نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم سے ” بتع “ کے متعلق پوچھا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو بھی پینے والی چیز نشہ لاوے وہ حرام ہے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 147910,
        "last_updated": null
    },
    {
        "urduURN": 4055120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5586,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہوں نے کہا کہ مجھ کو ابوسلمہ بن عبدالرحمٰن نے خبر دی اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم سے ” بتع “ کے متعلق سوال کیا گیا ۔ یہ مشروب شہد سے تیار کیا جاتا تھا اور یمن میں اس کا عام رواج تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جو چیز بھی نشہ لانے والی ہو وہ حرام ہے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 147920,
        "last_updated": null
    },
    {
        "urduURN": 4055130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5587,
        "hadithSanad": "اور زہری سے روایت ہے ، کہا کہ مجھ سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ” دباء “ اور ” مزفت “ میں نبیذ نہ بنایا کرو اور حضرت ابوہریرہ رضی اللہ عنہ اس کے ساتھ ” حنتم “ اور ” نقیر “ کا بھی اضافہ کیا کرتے تھے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 147930,
        "last_updated": null
    },
    {
        "urduURN": 4055140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5588,
        "hadithSanad": "ہم سے احمد بن ابی رجاء نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے ابو حیان تمیمی نے ، ان سے شعبی نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "حضرت عمر رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کے منبر پر خطبہ دیتے ہوئے کہا جب شراب کی حرمت کا حکم ہوا تو وہ پانچ چیزوں سے بنتی تھی ۔ انگور سے ، کھجور سے ، گیہوں سے ، جو اور شہد سے اور ” خمر “ ( شراب ) وہ ہے جو عقل کو مخمور کر دے اور تین مسائل ایسے ہیں کہ میری تمنا تھی کہ رسول اللہ صلی اللہ علیہ وسلم ہم سے جدا ہونے سے پہلے ہمیں ان کا حکم بتا جاتے ، دادا کا مسئلہ ، کلالہ کا مسئلہ اور سود کے چند مسائل ۔ ابو حیان نے بیان کیا کہ میں نے شعبی سے پوچھا اے ابوعمرو ! ایک شربت سندھ میں چاول سے بنایا جاتا ہے ۔ انہوں نے کہا کہ یہ چیز رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں نہیں پائی جاتی تھی یا کہا کہ حضرت عمر رضی اللہ عنہ کے زمانے میں نہ تھی اور فرج ابن منہال نے بھی اس حدیث کو حماد بن سلمہ سے بیان کیا اور ان سے ابو حیان نے اس میں ” انگور “ کے بجائے ” کشمش “ ہے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 147940,
        "last_updated": null
    },
    {
        "urduURN": 4055150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5589,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے عبداللہ بن ابی السفر نے بیان کیا ، ان سے شعبی نے ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "حضرت عمر رضی اللہ عنہ نے کہا شراب پانچ چیزوں سے بنتی تھی ۔ کشمش ، کھجور اور گیہوں ، جو اور شہدسے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 147950,
        "last_updated": null
    },
    {
        "urduURN": 4055160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5590,
        "hadithSanad": "اور ہشام بن عمار نے بیان کیا کہ ان سے صدقہ بن خالد نے بیان کیا ، ان سے عبدالرحمٰن بن یزید نے ، ان سے عطیہ بن قیس کلابی نے ، ان سے عبدالرحمٰن بن غنم اشعری نے بیان کیا کہا کہ",
        "hadithText": "مجھ سے ابوعامر رضی اللہ عنہ یا ابو مالک اشعری رضی اللہ عنہ نے بیان کیا اللہ کی قسم انہوں نے جھوٹ نہیں بیان کیا کہ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میری امت میں ایسے برے لوگ پیدا ہو جائیں گے جو زناکاری ، ریشم کا پہننا ، شراب پینا اور گانے بجانے کو حلال بنا لیں گے اور کچھ متکبر قسم کے لوگ پہاڑ کی چوٹی پر ( اپنے بنگلوں میں رہائش کرنے کے لیے ) چلے جائیں گے ۔ چرواہے ان کے مویشی صبح و شام لائیں گے اور لے جائیں گے ۔ ان کے پاس ایک فقیر آدمی اپنی ضرورت لے کر جائے گا تو وہ ٹالنے کے لیے اس سے کہیں گے کہ کل آنا لیکن اللہ تعالیٰ رات کو ان کو ( ان کی سرکشی کی وجہ سے ) ہلاک کر دے گا پہاڑ کو ( ان پر ) گرا دے گا اور ان میں سے بہت سوں کو قیامت تک کے لیے بندر اور سور کی صورتوں میں مسخ کر دے گا ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 147960,
        "last_updated": null
    },
    {
        "urduURN": 4055170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5591,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے یعقوب بن عبدالرحمٰن نے بیان کیا ، ان سے ابوحازم سلمہ بن دینار نے بیان کیا کہ میں نے سہل بن سعد ساعدی سے سنا ، انہوں نے کہا کہ",
        "hadithText": "ابواسید مالک بن ربیع آئے اور نبی کریم صلی اللہ علیہ وسلم کو اپنے ولیمہ کی دعوت دی ، ان کی بیوی ہی سب کام کر رہی تھیں حالانکہ وہ نئی دلہن تھیں ۔ حضرت سہل رضی اللہ عنہ نے بیان کیا تمہیں معلوم ہے کہ میں نے آنحضرت صلی اللہ علیہ وسلم کو کیا پلایا تھا ۔ آنحضرت صلی اللہ علیہ وسلم کے لیے انہوں نے پتھر کے کونڈے میں رات کے وقت کھجور بھگو دی تھی ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 147970,
        "last_updated": null
    },
    {
        "urduURN": 4055180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5592,
        "hadithSanad": "ہم سے یوسف بن موسیٰ نے بیان کیا ، کہا ہم سے محمد بن عبداللہ ابو احمد زبیری نے ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے منصور بن معتمر نے ، ان سے سالم بن ابی الجعد نے اور ان سے جابر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے چند برتنوں میں نبیذ بھگونے کی ( جن میں شراب بنتی تھی ) ممانعت کر دی تھی پھر انصار نے عرض کیا کہ ہمارے پاس تو دوسرے برتن نہیں ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا تو خیر پھر اجازت ہے ۔ امام بخاری رحمہ اللہ کہتے ہیں مجھ سے خلیفہ بن خیاط نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے منصور بن معتمر نے اور ان سے سالم بن ابی الجعد نے پھر یہی حدیث روایت کی تھی ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 147980,
        "last_updated": null
    },
    {
        "urduURN": 4055190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5593,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے ، وہ سلیمان بن ابی مسلم احول سے ، وہ مجاہد سے ، وہ ابو عیاض عمرو بن اسود سے اور انہوں نے عبداللہ بن عمرو بن عاص سے روایت کیا کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم نے مشکوں کے سوا اور برتنوں میں نبیذ بھگونے سے منع فرمایا تو لوگوں نے آپ صلی اللہ علیہ وسلم سے عرض کیا یا رسول اللہ ! ہر کسی کو مشک کہاں سے مل سکتی ہے ؟ اس وقت آپ صلی اللہ علیہ وسلم نے بن لاکھ لگے گھڑے میں نبیذ بھگونے کی اجازت دے دی ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 148000,
        "last_updated": null
    },
    {
        "urduURN": 4055200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5594,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے ، کہ ان سے سفیان بن عیینہ نے ، ان سے سفیان ثوری نے ، ان سے ابراہیم تیمی نے ، ان سے حارث بن سوید نے اور ان سے علی رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے دباء اور مزفت ( خاص قسم کے برتن جن میں شراب بنتی تھی ) کے استعمال کی بھی ممانعت کر دی تھی ۔ ہم سے عثمان نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، کہا ان سے اعمش نے یہی حدیث بیان کی ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 148010,
        "last_updated": null
    },
    {
        "urduURN": 4055210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5595,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے جریر بن عبدالحمید نے ، ان سے منصور بن معتمر نے ، ان سے ابراہیم نخعی نے کہ",
        "hadithText": "میں نے اسود بن یزید سے پوچھا کیا تم نے ام المؤمنین عائشہ رضی اللہ عنہا سے پوچھا تھا کہ کس برتن میں نبیذ ( کھجور کا میٹھا شربت ) بنانا مکروہ ہے ۔ انہوں نے کہا کہ ہاں میں نے عرض کیا ام المؤمنین ! کس برتن میں آنحضرت صلی اللہ علیہ وسلم نے نبیذ بنانے سے منع فرمایا تھا ۔ انہوں نے کہا کہ خاص گھر والوں کو کدو کی تو نبی اور لاکھی برتن میں نبیذ بھگونے سے منع فرمایا تھا ۔ ( ابراہیم نخعی نے بیان کیا کہ ) میں نے اسود سے پوچھا انہوں نے گھڑے اور سبز مرتبان کا ذکر نہیں کیا ۔ اس نے کہا کہ میں تم سے وہی بیان کرتا ہوں جو میں نے سنا کیا وہ بھی بیان کر دوں جو میں نے نہ سنا ہو ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 148020,
        "last_updated": null
    },
    {
        "urduURN": 4055220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5596,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے عبدالواحد بن زیاد نے بیان کیا ، کہا ہم سے سلیمان شیبانی نے بیان کیا ، کہا کہ میں نے حضرت عبداللہ بن ابی اوفی سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے سبز گھڑے سے منع فرمایا تھا ، میں نے پوچھا کیا ہم سفید گھڑوں میں پی لیا کریں کہا کہ نہیں ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 148030,
        "last_updated": null
    },
    {
        "urduURN": 4055230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5597,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے یعقوب بن عبدالرحمٰن القاری نے بیان کیا ، ان سے ابوحازم نے ، انہوں نے حضرت سہیل بن سعد سے سنا کہ",
        "hadithText": "حضرت ابواسید ساعدی رضی اللہ عنہ نے اپنے ولیمہ کی دعوت نبی کریم صلی اللہ علیہ وسلم کو دی ، اس دن ان کی بیوی ( ام اسید سلامہ ) ہی مہمانوں کی خدمت کر رہی تھیں ۔ زوجہ ابواسید نے کہا تم جانتے ہو میں نے رسول کریم صلی اللہ علیہ وسلم کے لیے کس چیز کا شربت تیار کیا تھا پتھر کے کونڈے میں رات کے وقت کچھ کھجوریں بھگو دی تھیں اور دوسرے دن صبح کو آپ کو پلادی تھی ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 148040,
        "last_updated": null
    },
    {
        "urduURN": 4055240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5598,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو سفیان ثوری نے خبر دی ، انہیں ابو الجویریہ نے ، کہا کہ",
        "hadithText": "میں نے ابن عباس رضی اللہ عنہما سے باذق ( انگور کا شیرہ ہلکی آنچ دیا ہوا ) کے متعلق پوچھا تو انہوں نے کہا کہ حضرت محمد صلی اللہ علیہ وسلم باذق کے وجود سے پہلے ہی دنیا سے رخصت ہو گئے تھے جو چیز بھی نشہ لایے وہ حرام ہے ۔ ابو الجویریہ نے کہا کہ باذق تو حلال و طیب ہے ۔ ابن عباس رضی اللہ عنہما نے کہا کہ انگور حلال طیب تھا جب اس کی شراب بن گئی تو وہ حرام خبیث ہے ۔ ( نہ کہ حلال طیب )</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 148050,
        "last_updated": null
    },
    {
        "urduURN": 4055250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5599,
        "hadithSanad": "ہم سے عبداللہ بن ابی شیبہ نے بیان کیا ، انہوں نے کہا ہم سے ابواسامہ نے بیان کیا ، انہوں نے کہا ہم سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے باپ ( عروہ بن زبیر ) نے بیان کیا اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم حلوا اور شہد کو دوست رکھتے تھے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 148060,
        "last_updated": null
    },
    {
        "urduURN": 4055260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5600,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے ہشام دستوائی نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا اور ان سے حضرت انس رضی اللہ عنہ نے بیان نے کیا کہ",
        "hadithText": "میں نے حضرت ابوطلحہ ، حضرت ابو دجانہ اور سہیل بن بیضاء رضی اللہ عنہم کو کچی کھجور کی ملی ہوئی نبیذ پلا رہا تھا کہ شراب حرام کر دی گئی اور میں نے موجودہ شراب پھینک دی ۔ میں ہی انہیں پلا رہا تھا میں سب سے کم عمر تھا ۔ ہم اس نبیذ کو اس وقت شراب ہی سمجھتے تھے اور عمرو بن حارث راوی نے بیان کیا کہ ہم سے قتادہ نے بیان کیا ، انہوں نے انس رضی اللہ عنہ سے سنا ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 148070,
        "last_updated": null
    },
    {
        "urduURN": 4055270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5601,
        "hadithSanad": "ہم سے ابو عاصم نے بیان کیا ، ان سے ابن جریج نے ، کہا مجھ کو عطاء  بن ابی رباح نے خبر دی ، انہوں نے حضرت جابر رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے کشمش اور کھجور ( کے شیرہ ) کو اور کچی اور پکی کو ملا کر بھگونے سے منع فرمایا تھا ۔ اس طور اس میں نشہ جلدی پیدا ہو جاتا ہے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 148080,
        "last_updated": null
    },
    {
        "urduURN": 4055280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5602,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے ہشام دستوائی نے بیان کیا ، کہا ہم کو یحییٰ بن ابی کثیر نے خبر دی ، انہیں عبداللہ بن ابی قتادہ نے اور ان سے ان کے والد نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے اس کی ممانعت کی تھی کہ پختہ اور گدرائی ہوئی کھجور ، پختہ کھجور اور کشمش کو ملا کر نبیذ بنایا جائے ۔ آپ صلی اللہ علیہ وسلم نے ہر ایک کو جدا جدا بھگونے کا حکم دیا ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 148090,
        "last_updated": null
    },
    {
        "urduURN": 4055290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5603,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ بن مبارک نے خبر دی ، انہوں نے کہا ہم کو یونس نے خبر دی ، انہیں زہری نے ، انہیں سعید بن مسیب نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "شب معراج میں رسول کریم صلی اللہ علیہ وسلم کو دودھ اور شراب کے دو پیالے پیش کئے گئے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 148100,
        "last_updated": null
    },
    {
        "urduURN": 4055300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5604,
        "hadithSanad": "ہم سے حمیدی نے بیان کیا ، انہوں نے سفیان بن عیینہ سے سنا ، انہوں نے کہا کہ ہم کو سالم ابو النضر نے خبر دی ، انہوں نے ام الفضل ( والدہ عبداللہ بن عباس ) کے غلام عمیر سے سنا ، وہ ام الفضل رضی اللہ عنہا سے بیان کرتے ہیں ، انہوں نے بیان کیا کہ",
        "hadithText": "عرفہ کے دن رسول اللہ صلی اللہ علیہ وسلم کے روزہ کے بارے میں صحابہ کرام رضی اللہ عنہم کو شبہ تھا ۔ اس لیے میں نے آپ کے لیے ایک برتن میں دودھ بھیجا اور آنحضرت صلی اللہ علیہ وسلم نے اسے پی لیا ۔ حمیدی کہتے ہیں کبھی سفیان اس حدیث کو یوں بیان کرتے تھے کہ عرفہ کے دن رسول اللہ صلی اللہ علیہ وسلم کے روزہ کے بارے میں لوگوں کو شبہ تھا اس لیے ام الفضل نے آنحضرت صلی اللہ علیہ وسلم کے لیے ( دودھ ) بھیجا ۔ کبھی سفیان اس حدیث کو مرسلاً ام الفضل سے روایت کرتے تھے سالم اور عمیر کا نام نہ لیتے ۔ جب ان سے پوچھتے کہ یہ حدیث مرسل ہے یا مرفوع متصل تو وہ اس وقت کہتے ( مرفوع متصل ہے ) ام فضل سے مروی ہے ( جو صحابیہ تھیں ) ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 148110,
        "last_updated": null
    },
    {
        "urduURN": 4055310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5605,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے اعمش نے ، ان سے ابوصالح ( ذکوان ) اور ابوسفیان ( طلحہ بن نافع قرشی ) نے اور ان سے حضرت جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ابو حمید ساعدی مقام نقیع سے دودھ کا ایک پیالہ ( کھلا ہوا ) لائے تو آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ اسے ڈھک کر کیوں نہیں لائے ایک لکڑی ہی اس پر رکھ لیتے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 148120,
        "last_updated": null
    },
    {
        "urduURN": 4055320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5606,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا میں نے ابوصالح سے سنا ، جیسا کہ مجھے یاد ہے وہ حضرت جابر بن عبداللہ انصاری رضی اللہ عنہما سے بیان کرتے تھے کہ",
        "hadithText": "انہوں نے بیان کیا کہ ایک انصاری صحابی ابو حمید ساعدی رضی اللہ عنہ مقام نقیع سے ایک برتن میں دودھ نبی کریم صلی اللہ علیہ وسلم کے لیے لائے ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ اسے ڈھک کر کیوں نہیں لائے ، اس پر لکڑی ہی رکھ دیتے ۔ اور اعمش نے کہا کہ مجھ سے ابوسفیان نے بیان کیا ، ان سے حضرت جابر رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے یہی حدیث بیان کی ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 148130,
        "last_updated": null
    },
    {
        "urduURN": 4055330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5607,
        "hadithSanad": "مجھ سے محمود نے بیان کیا ، کہا ہم کوابو النضر نے خبر دی ، کہا ہم کو شعبہ نے خبر دی ، ان سے ابواسحاق نے بیان کیا کہ میں نے براء  بن عازب رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم مکہ مکرمہ سے تشریف لائے تو ابوبکر رضی اللہ عنہ آپ کے ساتھ تھے ۔ ابوبکر رضی اللہ عنہ نے کہا کہ ( راستہ میں ) ہم ایک چرواہے کے قریب سے گزرے ۔ حضور اکرم صلی اللہ علیہ وسلم پیاسے تھے پھر میں نے ایک پیالے میں ( چرواہے سے پوچھ کر ) کچھ دودھ دوہا ۔ آپ نے وہ دودھ پیا اور اس سے مجھے خوشی حاصل ہوئی اور سراقہ بن جعشم گھوڑے پر سوار ہمارے پاس ( تعاقب کرتے ہوئے ) پہنچ گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے اس کے لیے بددعا کی ۔ آخر اس نے کہا کہ آنحضرت صلی اللہ علیہ وسلم اس کے حق میں بددعا نہ کریں اور وہ واپس ہو جائے گا ۔ آنحضرت صلی اللہ علیہ وسلم نے ایسا ہی کیا ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 148140,
        "last_updated": null
    },
    {
        "urduURN": 4055340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5608,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، کہا ہم سے ابوالزناد نے بیان کیا ، ان سے عبدالرحمٰن اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کیا ہی عمدہ صدقہ ہے خوب دودھ دینے والی اونٹنی جو کچھ دنوں کے لیے کسی کو عطیہ کے طور پر دی گئی ہو اور خوب دودھ دینے والی بکری جو کچھ دنوں کے لیے عطیہ کے طور پر دی گئی ہو جس سے صبح و شام دودھ برتن بھربھر کر نکالا جائے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 148150,
        "last_updated": null
    },
    {
        "urduURN": 4055350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5609,
        "hadithSanad": "ہم سے ابو عاصم نے بیان کیا ، ان سے امام اوزاعی نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے عبیداللہ بن عبداللہ نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے دودھ پیا پھر کلی کی اور فرمایا کہ اس میں چکناہٹ ہوتی ہے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 148160,
        "last_updated": null
    },
    {
        "urduURN": 4055360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5610,
        "hadithSanad": "اور ابراہیم بن طہمان نے کہا کہ ان سے شعبہ نے ، ان سے قتادہ نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا ،",
        "hadithText": "ان سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جب مجھے سدرۃالمنتہیٰ تک لے جایا گیا تو وہاں میں نے چار نہریں دیکھیں ۔ دو ظاہری نہریں اور دو باطنی ۔ ظاہری نہریں تو نیل اورفرات ہیں اور باطنی نہریں جنت کی دو نہریں ہیں ۔ پھر میرے پاس تین پیالے لائے گئے ایک پیالے میں دودھ تھا ، دوسرے میں شہد تھا اور تیسرے میں شراب تھی ۔ میں نے وہ پیالہ لیا جس میں دودھ تھا اور پیا ۔ اس پر مجھ سے کہا گیا کہ تم نے اور تمہاری امت نے اصل فطرت کو پا لیا ۔ ہشام اور سعید اور ہمام نے قتادہ سے ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے ، انہوں نے مالک بن صعصعہ رضی اللہ عنہ سے یہ حدیث روایت کی ہے ۔ اس میں ندیوں کا ذکر تو ایسا ہی ہے لیکن تین پیالوں کا ذکر نہیں ہے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 148170,
        "last_updated": null
    },
    {
        "urduURN": 4055370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5611,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، کہا ہم سے امام مالک نے ، ان سے اسحاق بن عبداللہ نے ، انہوں نے انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "ابوطلحہ رضی اللہ عنہ کے پاس مدینہ کے تمام انصار میں سب سے زیادہ کھجور کے باغات تھے اور ان کا سب سے پسندیدہ مال بیرحاء کا باغ تھا ۔ یہ مسجدنبوی کے سامنے ہی تھا اور رسول اللہ صلی اللہ علیہ وسلم وہاں تشریف لے جاتے تھے اور اس کا عمدہ پانی پیتے تھے ۔ انس رضی اللہ عنہ نے بیان کیا کہ پھر جب آیت ” تم ہرگز نیکی نہیں پاؤ گے جب تک وہ مال نہ خرچ کرو جو تمہیں عزیز ہو ۔ “ نازل ہوئی تو ابوطلحہ رضی اللہ عنہ کھڑے ہوئے اور عرض کیا یا رسول اللہ ! اللہ تعالیٰ فرماتا ہے ” تم ہرگز نیکی کو نہیں پاؤ گے جب تک وہ مال نہ خرچ کرو جو تمہیں عزیز ہو ۔ “ اور مجھے اپنے مال میں سب سے زیادہ عزیز بیرحاء کا باغ ہے اور وہ اللہ تعالیٰ کے راستہ میں صدقہ ہے ، اس کا ثواب اور اجر میں اللہ کے یہاں پانے کی امید رکھتا ہوں ، اس لیے یا رسول اللہ ! آپ جہاں اسے مناسب خیال فرمائیں خرچ کریں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ٰخوب یہ بہت ہی فائدہ بخش مال ہے یا ( اس کے بجائے آپ نے ) رابح ( یاء کے ساتھ فرمایا ) راوی حدیث عبداللہ کو اس میں شک تھا ( آنحضرت صلی اللہ علیہ وسلم نے ان سے مزید فرمایا کہ ) جو کچھ تو نے کہا ہے میں نے سن لیا ۔ میرا خیال ہے کہ تم اسے اپنے رشتہ داروں کو دے دو ۔ حضرت ابوطلحہ رضی اللہ عنہ نے عرض کیا کہ ایسا ہی کروں گا یا رسول اللہ ! چنانچہ انہوں نے اپنے رشتہ داروں اپنے چچا کے لڑکوں میں اسے تقسیم کر دیا ۔ اور اسماعیل اور یحییٰ بن یحییٰ نے ” رابح “ کا لفظ نقل کیا ہے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 148180,
        "last_updated": null
    },
    {
        "urduURN": 4055380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5612,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا ہم سے عبداللہ بن مبارک نے خبر دی ، کہا ہم کویونس نے خبر دی ، ان سے زہری نے بیان کیا اور انہیں حضرت انس بن مالک رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو دودھ پیتے دیکھا اور آنحضرت صلی اللہ علیہ وسلم ان کے گھر تشریف لائے تھے ( بیان کیا کہ ) میں نے بکری کادودھ نکالا اور اس میں کنویں کا تازہ پانی ملا کر ( آنحضور صلی اللہ علیہ وسلم کو ) پیش کیا آپ نے پیالہ لے کر پیا ۔ آپ کے بائیں طرف حضرت ابوبکر رضی اللہ عنہ تھے اور دائیں طرف ایک اعرابی تھا آپ نے اپنا باقی دودھ اعرابی کو دیا اور فرمایا کہ پہلے دائیں طرف سے ۔ ہاں دائیں طرف والے کا حق ہے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 148190,
        "last_updated": null
    },
    {
        "urduURN": 4055390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5613,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے ابوعامر نے ، کہا ہم سے فلیح بن سلیمان نے بیان کیا ، ان سے سعید بن حارث نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم قبیلہ انصار کے ایک صحابی کے یہاں تشریف لے گئے آنحضرت صلی اللہ علیہ وسلم کے ساتھ آپ کے ایک رفیق ( ابوبکر رضی اللہ عنہ ) بھی تھے ۔ ان سے آپ نے فرمایا کہ اگر تمہارے یہاں اسی رات کاباسی پانی کسی مشکیزے میں رکھا ہوا ہو ( تو ہمیں پلاؤ ) ورنہ منہ لگاکے پانی پی لیں گے ۔ جابر رضی اللہ عنہ نے بیان کیا کہ وہ صاحب ( جن کے یہاں آپ تشریف لیے گئے تھے ) اپنے باغ میں پانی دے رہے تھے ۔ بیان کیا کہ ان صاحب نے کہا کہ یا رسول اللہ ! میرے پاس رات کا باسی پانی موجود ہے ، آپ چھپر میں تشریف لے چلیں ۔ بیان کیا کہ پھر وہ ان دونوں حضرات کو ساتھ لے کر گئے پھر انہوں نے ایک پیالہ میں پانی لیا اور اپنی ایک دودھ دینے والی بکری کا اس میں دودھ نکالا ۔ بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم نے اسے پیا ، اس کے بعد آپ کے رفیق ابوبکر صدیق رضی اللہ عنہ نے پیا ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 148200,
        "last_updated": null
    },
    {
        "urduURN": 4055400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5614,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، کہا کہ مجھے ہشام نے خبر دی ، انہیں ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم شیرینی اور شہد کو دوست رکھتے تھے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 148210,
        "last_updated": null
    },
    {
        "urduURN": 4055410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5615,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے مسعر نے بیان کیا ، ان سے عبدالملک بن میسرہ نے ، ان سے نزال نے بیان کیا کہ",
        "hadithText": "وہ حضرت علی رضی اللہ عنہ کی خدمت میں مسجد کوفہ کے صحن میں حاضر ہوئے پھر حضرت علی رضی اللہ عنہ نے کھڑے ہو کر پیا اور کہا کہ کچھ لوگ کھڑے ہو کر پانی پینے کو مکروہ سمجھتے ہیں حالانکہ میں نے رسول اللہ صلی اللہ علیہی وسلم کو اس طرح کرتے دیکھا ہے جس طرح تم نے مجھے اس وقت کھڑے ہو کر پانی پیتے دیکھا ہے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 148220,
        "last_updated": null
    },
    {
        "urduURN": 4055420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5616,
        "hadithSanad": "ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے عبدالملک بن میسرہ نے بیان کیا ، انہوں نے نزال بن سبرہ سے سنا ، وہ حضرت علی رضی اللہ عنہ سے بیان کرتے تھے کہ",
        "hadithText": "انہوں نے ظہر کی نماز پڑھی پھر مسجد کوفہ کے صحن میں لوگوں کی ضرورتوں کے لیے بیٹھ گئے ۔ اس عرصہ میں عصر کی نماز کا وقت آ گیا پھر ان کے پاس پانی لایا گیا ۔ انہوں نے پانی پیا اور اپنا چہرہ اور ہاتھ دھوئے ، ان کے سر اور پاؤں ( کے دھونے کا بھی ) ذکر کیا ۔ پھر انہوں نے کھڑے ہو کر وضو کا بچا ہوا پانی پیا ، اس کے بعد کہا کہ کچھ لوگ کھڑے ہو کر پانی پینے کو برا سمجھتے ہیں حالانکہ نبی کریم صلی اللہ علیہ وسلم نے یو نہی کیا تھا جس طرح میں نے کیا ۔ وضو کا پانی کھڑے ہو کر پیا ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 148230,
        "last_updated": null
    },
    {
        "urduURN": 4055430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5617,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے عاصم احول نے ، ان سے شعبی نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے زمزم کا پانی کھڑے ہو کر پیا ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 148240,
        "last_updated": null
    },
    {
        "urduURN": 4055440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5618,
        "hadithSanad": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے عبدالعزیز بن ابی سلمہ نے بیان کیا ، کہا ہم کو ابو النضر نے خبر دی ، انہیں حضرت ابن عباس رضی اللہ عنہما کے غلام عمیر نے اور انہیں ام فضل بنت حارث نے کہ",
        "hadithText": "انہوں نے نبی کریم صلی اللہ علیہ وسلم کے لیے دودھ کا ایک پیالہ بھیجا میدان عرفات میں ۔ وہ عرفہ کے دن کی شام کا وقت تھا اور آنحضرت صلی اللہ علیہ وسلم ( اپنی سواری پر ) سوار تھے ، آپ نے اپنے ہاتھ میں وہ پیالہ لیا اور اسے پی لیا ۔ مالک نے ابو النضر سے اپنے اونٹ پر کے الفاظ زیادہ کئے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 148250,
        "last_updated": null
    },
    {
        "urduURN": 4055450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5619,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابن شہاب نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں پانی ملا ہوا دودھ پیش کیا گیا آنحضرت صلی اللہ علیہ وسلم کے داہنی طرف ایک دیہاتی تھا اور بائیں طرف حضرت ابوبکر رضی اللہ عنہ ۔ آنحضرت صلی اللہ علیہ وسلم نے پی کر باقی دیہاتی کو دیا اور فرمایا کہ دائیں طرف سے پس دائیں طرف سے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 148260,
        "last_updated": null
    },
    {
        "urduURN": 4055460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5620,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابوحازم بن دینار نے اور ان سے حضرت سہل بن سعد رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ایک شربت لایا گیاآنحضرت صلی اللہ علیہ وسلم نے اس میں سے پیا ، آپ کے دائیں طرف ایک لڑکا بیٹھا ہو اتھا اور بائیں طرف بوڑھے لوگ ( حضرت خالد بن ولید رضی اللہ عنہ جیسے بیٹھے ہوئے ) تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے بچے سے کہا کیا تم مجھے اجازت دوگے کہ میں ان ( شیوخ ) کو ( پہلے ) دے دوں ۔ لڑکے نے کہا اللہ کی قسم یا رسول اللہ ! آپ کے جھوٹے میں سے ملنے والے اپنے حصہ کے معاملہ میں میں کسی پر ایثار نہیں کروں گا ۔ راوی نے بیان کیا کہ اس پر آنحضرت صلی اللہ علیہ وسلم نے لڑکے کے ہاتھ میں پیالہ دے دیا ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 148270,
        "last_updated": null
    },
    {
        "urduURN": 4055470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5621,
        "hadithSanad": "ہم سے یحییٰ بن صالح نے بیان کیا ، کہا ہم سے فلیح بن سلیمان نے بیان کیا ، ان سے سعید بن حارث نے اور ان سے حضرت جابر بن عبداللہ انصاری رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم قبیلہ انصار کے ایک صحابی کے یہاں تشریف لے گئے ۔ آنحضرت صلی اللہ علیہ وسلم کے ساتھ آپ کے ایک رفیق بھی تھے ۔ آنحضرت صلی اللہ علیہ وسلم اور آپ کے رفیق نے انہیں سلام کیا اور انہوں نے سلام کا جواب دی ۔ پھر عرض کیا کہ یا رسول اللہ ! میرے ماں باپ آپ صلی اللہ علیہ وسلم پر نثار ہوں یہ بڑی گرمی کا وقت ہے وہ اپنے باغ میں پانی دے رہے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اگر تمہارے پاس مشک میں رات کا رکھا ہوا پانی ہے ( تو وہ پلادو ) ورنہ ہم منہ لگا کر پی لیں گے ( یہیں سے ترجمہ باب نکلتا ہے ) وہ صاحب اس وقت بھی باغ میں پانی دے رہے تھے ۔ انہوں نے عرض کیا یا رسول اللہ ! میرے پاس مشک میں رات کا رکھا ہوا باسی پانی ہے پھر وہ چھپر میں گئے اور ایک پیالے میں باسی پانی لیا پھر اپنی ایک دودھ دینے والی بکری کا دودھ اس میں نکالا ۔ آنحضرت صلی اللہ علیہ وسلم نے اسے پیا پھر وہ دوبارہ لائے اور اس مرتبہ آنحضرت صلی اللہ علیہ وسلم کے رفیق حضرت ابوبکر رضی اللہ عنہ نے پیا ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 148280,
        "last_updated": null
    },
    {
        "urduURN": 4055480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5622,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے معتمر نے ، ان سے ان کے والد نے ، کہ میں نے انس رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں کھڑا ہوا اپنے قبیلہ میں اپنے چچاؤں کو کھجور کی شراب پلا رہا تھا ۔ میں ان میں سے سب سے چھوٹا تھا ، اتنے میں کسی نے کہا کہ شراب حرام کر دی گئی ( ابوطلحہ رضی اللہ عنہ نے ) کہا کہ شراب پھینک دو ۔ چنانچہ ہم نے پھینک دی ۔ سلیمان نے کہا کہ میں نے انس رضی اللہ عنہ سے پوچھا اس وقت لوگ کس چیز کی شراب پیتے تھے کہا کہ پکی اور کچی کھجور کی ۔ ابوبکر بن انس نے کہا کہ یہی ان کی شراب ہوتی تھی انس رضی اللہ عنہ نے اس کا انکار نہیں کیا ، بکر بن عبداللہ مزنی یا قتادہ نے کہا اور مجھ سے بعض لوگوں نے بیان کیا کہ انہوں نے انس رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ ” ان کی ان دنوں یہی ( فضیح ) ان کی شراب تھی ۔ “</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 148290,
        "last_updated": null
    },
    {
        "urduURN": 4055490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5623,
        "hadithSanad": "ہم سے اسحاق بن منصور نے بیان کیا ، انہوں نے کہا ہم کو روح بن عبادہ نے خبر دی ، انہوں نے کہا ہم کو ابن جریج نے خبر دی ، انہوں نے کہا کہ مجھے عطاء نے خبر دی ، انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ رات کی جب ابتداء ہو یا ( آپ نے فرمایا ) جب شام ہو تو اپنے بچوں کو روک لو ( اور گھر سے باہر نہ نکلنے دو ) کیونکہ اس وقت شیطان پھیل جاتے ہیں پھر جب رات کی ایک گھڑی گزرجائے تو انہیں چھوڑ دو اور دروازے بند کر لو اور اس وقت اللہ کا نام لو کیونکہ شیطان بند دروازے کو نہیں کھولتا اور اللہ کا نام لے کر اپنے مشکیزوں کا منہ باندھ دو ۔ اللہ کا نام لے کر اپنے برتنوں کو ڈھک دو ، خواہ کسی چیز کو چوڑائی میں رکھ کر ہی ڈھک سکو اور اپنے چراغ ( سونے سے پہلے ) بجھادیا کرو ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 148300,
        "last_updated": null
    },
    {
        "urduURN": 4055500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5624,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، ان سے عطاء  بن ابی رباح نے اور ان سے حضرت جابر بن عبداللہ انصاری رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تم جب سونے لگو تو چراغ بجھا دو ۔ دروازے بند کر دو ، مشکوں کے منہ باندھ دو اور کھانے پینے کے برتنوں کو ڈھانپ دو ۔ حضرت جابر رضی اللہ عنہ نے کہا کہ میرا خیال ہے کہ یہ بھی کہا خواہ لکڑی ہی کے ذریعہ سے ڈھک سکو جو اس کی چوڑائی میں بسم اللہ کہہ کر رکھ دی جائے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 148310,
        "last_updated": null
    },
    {
        "urduURN": 4055510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5625,
        "hadithSanad": "ہم سے آدم نے بیان کیا ، کہا ہم سے ابن ابی ذئب نے بیان کیا ، ان سے زہری نے ، ان سے عبیداللہ بن عبداللہ بن عتبہ نے اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے مشکوں میں ” اختناث “ سے منع فرمایا مشک کا منہ کھول کر اس میں منہ لگا کر پانی پینے سے روکا ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 148320,
        "last_updated": null
    },
    {
        "urduURN": 4055520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5626,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو یونس نے خبر دی ، ان سے زہری نے بیان کیا کہ مجھ سے عبیداللہ بن عبداللہ نے بیان کیا ، انہوں نے حضرت ابو سعید خدری رضی اللہ عنہ سے سنا ، کہا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا کہ آپ نے مشکوں میں ( اختناث ) سے منع فرمایا ہے ۔ عبداللہ نے بیان کیا کہ معمر نے بیان کیا یا ان کے غیر نے کہ ” اختناث “ مشک سے منہ لگا کر پانی پینے کو کہتے ہیں ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 148330,
        "last_updated": null
    },
    {
        "urduURN": 4055530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5627,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، کہا ہم سے ایوب نے بیان کیا کہ",
        "hadithText": "ہم سے عکرمہ نے کہا ، تمہیں میں چند چھوٹی چھوٹی باتیں نہ بتا دوں جنہیں ہم سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا تھا کہ رسول اللہ صلی اللہ علیہ وسلم نے مشک کے منہ سے منہ لگا کر پانی پینے کی ممانعت کی تھی اور ( اس سے بھی آپ نے منع فرمایا تھا کہ ) کوئی شخص اپنے پڑوس کو اپنی دیوار میں کھونٹی وغیرہ گاڑنے سے روکے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 148340,
        "last_updated": null
    },
    {
        "urduURN": 4055540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5628,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے اسماعیل نے بیان کیا ، کہا ہم کو ایوب نے خبر دی ، انہیں عکرمہ نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے مشک کے منہ سے پانی پینے کی ممانعت فرما دی تھی ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 148350,
        "last_updated": null
    },
    {
        "urduURN": 4055550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5629,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، کہا ہم سے خالد حذاء نے بیان کیا ، ان سے عکرمہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے مشک کے منہ سے پانی پینے کو منع فرمایا تھا ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 148360,
        "last_updated": null
    },
    {
        "urduURN": 4055560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5630,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے شیبان نے بیان کیا ، ان سے یحییٰ بن ابی کثیر نے ، ان سے عبداللہ بن ابی قتادہ نے ، ان سے ان کے والد نے بیان کیا کہ",
        "hadithText": "رسول اللہ علیہ وسلم نے فرمایا جب تم میں سے کوئی شخص پانی پئے تو ( پینے کے ) برتن میں ( پانی پیتے ہوئے ) سانس نہ لے اور جب تم میں سے کوئی شخص پیشاب کرے تو داہنے ہاتھ کو ذکر پر نہ پھیرے اور جب استنجاء کرے تو داہنے ہاتھ سے نہ کرے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 148370,
        "last_updated": null
    },
    {
        "urduURN": 4055570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5631,
        "hadithSanad": "ہم سے ابو عاصم اورا بو نعیم نے بیان کیا ، انہوں نے کہا کہ ہم سے عروہ بن ثابت نے بیان کیا ، انہوں نے کہا کہ مجھے شمامہ بن عبداللہ نے خبر دی ، بیان کیا کہ",
        "hadithText": "حضرت انس رضی اللہ عنہ دو یا تین سانسوں میں پانی پیتے تھے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 148380,
        "last_updated": null
    },
    {
        "urduURN": 4055580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5632,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے حکیم بن ابی لیلیٰ نے ، انہوں نے بیان کیا کہ",
        "hadithText": "حذیفہ بن یمان رضی اللہ عنہ مدائن میں تھے ۔ انہوں نے پانی مانگا تو ایک دیہاتی نے ان کو چاندی کے برتن میں پانی لا کر دیا ، انہوں نے برتن کو اس پرپھینک مارا پھر کہا میں نے برتن صرف اس وجہ سے پھینکا ہے کہ اس شخص کو میں اس سے منع کر چکا تھا لیکن یہ باز نہ آیا اور رسول کریم صلی اللہ علیہ وسلم نے ہمیں ریشم ودیبا کے پہننے سے اور سونے اور چاندی کے برتن میں کھانے پینے سے منع کیا تھا اور آپ نے ارشاد فرمایا تھا کہ یہ چیزیں ان کفار کے لیے دنیا میں ہیں اور تمہیں آخرت میں ملیں گے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 148390,
        "last_updated": null
    },
    {
        "urduURN": 4055590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5633,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، انہوں نے کہا ہم سے ابن ابی عدی نے بیان کیا ، ان سے ابن عون نے بیان کیا ، ان سے مجاہد نے اور ان سے ابن ابی لیلیٰ نے بیان کیا کہ",
        "hadithText": "ہم حضرت حذیفہ رضی اللہ عنہ کے ساتھ نکلے پھر انہوں نے نبی کریم صلی اللہ علیہ وسلم کا ذکر کیا کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا تھا کہ سونے اور چاندی کے پیالہ میں نہ پیا کرو اور نہ ریشم ودیبا پہنا کرو کیونکہ یہ چیزیں ان کے لیے دینا میں ہیں اور تمہارے لیے آخرت میں ہیں ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 148400,
        "last_updated": null
    },
    {
        "urduURN": 4055600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5634,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک بن انس نے بیان کیا ، ان سے نافع نے ، ان سے زید بن عبداللہ بن عمر نے ، ان سے عبداللہ بن عبدالرحمٰن بن ابی بکر صدیق رضی اللہ عنہ نے بیان کیا",
        "hadithText": "اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت ام سلمہ رضی اللہ عنہا نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا جو شخص چاندی کے برتن میں کوئی چیز پیتا ہے تو وہ شخص اپنے پیٹ میں دوزخ کی آگ بھڑ کا رہا ہے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 148410,
        "last_updated": null
    },
    {
        "urduURN": 4055610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5635,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ابو عوانہ نے بیان کیا ، ان سے اشعث بن سلیم نے ، ان سے معاویہ بن سوید بن مقرن نے اور ان سے حضرت براء  بن عازب رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ہمیں سات چیزوں کا حکم دیا تھا اور سات چیزوں سے ہم کو منع فرمایا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے ہمیں بیمار کی عیادت کرنے ، جنازے کے پیچھے چلنے ، چھینکنے والے کے جواب میں ” یرحمک اللہ “ کہنے ، دعوت کرنے والے کی دعوت کو قبول کرنے ، سلام پھیلانے ، مظلوم کی مدد کرنے اور قسم کھانے کے بعد کفارہ ادا کرنے کا حکم فرمایا تھا اور آنحضرت صلی اللہ علیہ وسلم نے ہمیں سونے کی انگوٹھیوں سے ، چاندی میں پینے یا ( فرمایا ) چاندی کے برتن میں پینے سے ، میثر ( زین یا کجاوہ کے اوپر ریشم کا گدا ) کے استعمال کرنے سے اور قسی ( اطراف مصر میں تیار کیا جانے والا ایک کپڑا جس میں ریشم کے دھاگے بھی استعمال ہوتے تھے ) کے استعمال کرنے سے اور ریشم ودیبا اور استبرق پہننے سے منع فرمایا تھا ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 148420,
        "last_updated": null
    },
    {
        "urduURN": 4055620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5636,
        "hadithSanad": "مجھ سے عمرو بن عباس نے بیان کیا ، کہا ہم سے عبدالرحمٰن نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے سالم ابی النضر نے ، ان سے ام فضل کے غلام عمیر نے اور ان سے حضرت ام الفضل رضی اللہ عنہا نے کہ",
        "hadithText": "لوگوں نے عرفہ کے دن نبی کریم صلی اللہ علیہ وسلم کے روزے کے متعلق شبہ کیا تو آنحضرت صلی اللہ علیہ وسلم کی خدمت میں دودھ کا ایک کٹورہ پیش کیا گیا اور آپ نے اسے نوش فرمایا ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 148430,
        "last_updated": null
    },
    {
        "urduURN": 4055630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5637,
        "hadithSanad": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم سے ابو غسان نے بیان کیا ، کہا کہ مجھ سے ابوحازم نے بیان کیا ، ان سے حضرت سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم سے ایک عرب عورت کا ذکر کیا گیا پھر آپ نے حضرت اسید ساعدی رضی اللہ عنہ کو ان کے پاس انہیں لانے کے لیے کسی کو بھیجنے کا حکم دیا چنانچہ انہوں نے بھیجا اور وہ آئیں اور بنی ساعدہ کے قلعہ میں اتریں اور آنحضرت صلی اللہ علیہ وسلم بھی تشریف لائے اور ان کے پاس گئے ۔ آپ نے دیکھا کہ ایک عورت سر جھکائے بیٹھی ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے جب ان سے گفتگو کی تو وہ کہنے لگیں کہ میں تم سے اللہ کی پناہ مانگتی ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ میں نے تجھ کو پناہ دی ! لوگوں نے بعد میں ان سے پوچھا ۔ تمہیں معلوم بھی ہے یہ کون تھے ۔ اس عورت نے جواب دیا کہ نہیں ۔ لوگوں نے کہا کہ یہ تو رسول اللہ صلی اللہ علیہ وسلم تھے تم سے نکاح کے لیے تشریف لائے تھے ۔ اس پر وہ بولیں کہ پھر تو میں بڑی بدبخت ہوں ( کہ آنحضور صلی اللہ علیہ وسلم کوناراض کر کے واپس کر دیا ) اسی دن حضور اکرم صلی اللہ علیہ وسلم تشریف لائے اور سقیفہ بنی ساعدہ میں اپنے صحابی کے ساتھ بیٹھے پھر فرمایا سہل ! پانی پلاؤ ۔ میں نے ان کے لیے یہ پیالہ نکالا اور انہیں اس میں پانی پلایا ۔ حضرت سہل رضی اللہ عنہ ہمارے لیے بھی وہی پیالہ نکال کر لائے اور ہم نے بھی اس میں پانی پیا ۔ راوی نے بیان کیا کہ پھر بعد میں خلیفہ عمر بن عبدالعزیز رحمہ اللہ نے ان سے یہ مانگ لیا تھا اور انہوں نے یہ ان کو ہبہ کر دیا تھا ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 148440,
        "last_updated": null
    },
    {
        "urduURN": 4055640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5638,
        "hadithSanad": "ہم سے حسن بن مدرک نے بیان کیا ، انہوں نے کہا کہ مجھ سے یحییٰ بن حماد نے بیان کیا ، انہوں نے کہا ہم کو ابو عوانہ نے خبر دی ، ان سے عاصم احول نے بیان کیاکہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم کا پیالہ حضرت انس بن مالک رضی اللہ عنہ کے پاس دیکھا ہے وہ پھٹ گیا تھا تو حضرت انس رضی اللہ عنہ نے اسے چاندی سے جوڑدیا ۔ پھر حضرت عاصم نے بیان کیا کہ وہ عمدہ چوڑا پیالہ ہے ۔ چمکدارلکڑی کا بنا ہوا ۔ بیان کیا کہ حضرت انس رضی اللہ عنہ نے بتایا کہ میں نے اس پیالہ سے حضور اکرم صلی اللہ علیہ وسلم کو بارہا پلایا ہے ۔ راوی نے بیان کیا کہ ابن سیرین نے کہا کہ اس پیالہ میں لوہے کا ایک حلقہ تھا ۔ حضرت انس رضی اللہ عنہ نے چاہا کہ اس کی جگہ چاندی یا سونے کا حلقہ جڑوا دیں لیکن ابوطلحہ رضی اللہ عنہ نے ان سے کہا کہ جسے رسول اللہ صلی اللہ علیہ وسلم نے بنایا ہے اس میں ہرگز کوئی تبدیلی نہ کر ۔ چنانچہ انہوں نے یہ ارادہ چھوڑ دیا ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 148450,
        "last_updated": null
    },
    {
        "urduURN": 4055650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 74,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5639,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے اعمش نے بیان کیا ، ان سے سالم بن ابی الجعد نے اور ان سے حضرت جابر بن عبداللہ نے بیان کیا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھا اور عصرکی نماز کا وقت ہو گیا تھوڑے سے بچے ہوئے پانی کے سوا ہمارے پاس اور کوئی پانی نہیں تھا اسے ایک برتن میں رکھ کر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں لایا گیا آنحضرت صلی اللہ علیہ وسلم نے اس میں اپنا ہاتھ ڈالا اوراپنی انگلیاں پھیلا دیں پھر فرمایا آؤ وضو کر لو یہ اللہ کی طرف سے برکت ہے ۔ میں نے دیکھا کہ پانی آنحضرت صلی اللہ علیہ وسلم کی انگلیوں کے درمیان سے پھوٹ پھوٹ کر نکل رہا تھا چنانچہ سب لوگوں نے اس سے وضو کیا اورپیا بھی ۔ میں نے اس کی پرواہ کئے بغیر کہ پیٹ میں کتنا پانی جا رہا ہے خوب پانی پیا کیونکہ مجھے معلوم ہو گیا تھا کہ برکت کا پانی ہے ۔ میں نے حضرت جابر رضی اللہ عنہ سے پوچھا آپ لوگ اس وقت کتنی تعداد میں تھے ؟ بتلایا کہ ایک ہزار چارسو ۔ اس روایت کی متابعت عمرو نے حضرت جابر رضی اللہ عنہ سے کی ہے اور حسین اور عمرو بن مرہ نے سالم سے بیان کیا اور ان سے حضرت جابر رضی اللہ عنہ نے کہ صحابہ کی اس وقت تعداد پندرہ سو تھی ۔ اس کی متابعت سعید بن مسیب نے حضرت جابر رضی اللہ عنہ سے کی ہے ۔</b>",
        "bookID": "74.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 148460,
        "last_updated": null
    }
]