[
    {
        "urduURN": 4055660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5640,
        "hadithSanad": "ہم سے ابو الیمان حکم بن نافع نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہوں نے کہا مجھ کو عروہ بن زبیر نے خبر دی اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ صدیقہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو مصیبت بھی کسی مسلمان کو پہنچتی ہے اللہ تعالیٰ اسے اس کے گناہ کا کفارہ کر دیتا ہے ( کسی مسلمان کے ) ایک کانٹا بھی اگر جسم کے کسی حصہ میں چبھ جائے ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 148470,
        "last_updated": null
    },
    {
        "urduURN": 4055670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، انہوں نے کہا ہم سے عبدالملک بن عمرو نے بیان کیا ، انہوں نے کہا ہم سے زہیر بن محمد نے بیان کیا ، ان سے محمد بن عمرو بن حلحلہ نے ، ان سے عطاء بن یسار نے اور ان سے حضرت ابو سعید خدری اور حضرت ابوہریرہ رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا مسلمان جب بھی کسی پریشانی ، بیماری ، رنج وملال ، تکلیف اور غم میں مبتلا ہو جاتا ہے یہاں تک کہ اگر اسے کوئی کانٹا بھی چبھ جائے تو اللہ تعالیٰ اسے اس کے گناہوں کا کفارہ بنا دیتا ہے ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 148480,
        "last_updated": null
    },
    {
        "urduURN": 4055680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5643,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے سفیان نے ، ان سے سعد نے ، ان سے عبداللہ بن کعب نے اور ان سے ان کے والد نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ مومن کی مثال پودے کی سب سے پہلی نکلی ہوئی ہری شاخ جیسی ہے کہ ہوا اسے کبھی جھکا دیتی ہے اور کبھی برابر کر دیتی ہے اور منافق کی مثال صنوبر کے درخت جیسی ہے کہ وہ سیدھا ہی کھڑا رہتا ہے اور آخر ایک جھوکے میں کبھی اکھڑ ہی جاتا ہے ۔ اور زکریا نے بیان کیا کہ ہم سے سعد نے بیان کیا ، ان سے ابن کعب نے بیان کیا ، ان سے ان کے والد ماجد محترم المقام کعب رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے یہی بیان کیا ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 148491,
        "last_updated": null
    },
    {
        "urduURN": 4055690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5644,
        "hadithSanad": "ہم سے ابراہیم بن المنذر نے بیان کیا ، کہا کہ مجھ سے محمد بن فلیح نے بیان کیا ، کہا کہ مجھ سے میرے والد نے بیان کیا ، ان سے بنی عامر بن لوی کے ایک مرد ہلال بن علی نے ، ان سے عطاء بن یسار نے اور ان سے حضرت ابوہریرہ رضی اللہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا مومن کی مثال پودے کی پہلی نکلی ہوئی ہری شاخ جیسی ہے کہ جب بھی ہوا چلتی ہے اسے جھکا دیتی ہے پھر وہ سیدھا ہو کر مصیبت برداشت کرنے میں کامیاب ہو جاتا ہے اور بدکار کی مثال صنوبر کے درخت جیسی ہے کہ سخت ہوتا ہے اور سیدھا کھڑا رہتا ہے یہاں تک کہ اللہ تعالیٰ جب چاہتا ہے اسے اکھاڑ کر پھینک دیتا ہے ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 148510,
        "last_updated": null
    },
    {
        "urduURN": 4055700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5645,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں محمد بن عبداللہ بن عبدالرحمٰن بن ابی صعصعہ نے ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نے سعید بن یسار ابو الحباب سے سنا ، انہوں نے بیان کیا کہ میں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ جس کے ساتھ خیر و بھلائی کرنا چاہتا ہے اسے بیماری کی تکالیف اور دیگر مصیبتوں میں مبتلا کر دیتا ہے ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 148520,
        "last_updated": null
    },
    {
        "urduURN": 4055710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5646,
        "hadithSanad": "ہم سے قبیصہ نے بیان کیا ، انہوں نے کہا ہم سے سفیان سے بیان کیا ، ان سے اعمش نے ( دوسری سند ) اور حضرت امام بخاری نے کہا کہ مجھ سے بشر بن محمد نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو شعبہ نے خبر دی ، انہیں اعمش نے ، انہیں ابووائل نے ، انہیں مسروق نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میں نے ( مرض وفات کی تکلیف ) رسول اللہ صلی اللہ علیہ وسلم سے زیادہ اور کسی میں نہیں دیکھی ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 148530,
        "last_updated": null
    },
    {
        "urduURN": 4055720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5647,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے اعمش نے ، ان سے ابراہیم تیمی نے ، ان سے حارث بن سوید نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے کہ",
        "hadithText": "میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آپ کے مرض کے زمانہ میں حاضر ہوا آنحضرت صلی اللہ علیہ وسلم اس وقت بڑے تیز بخار میں تھے ۔ میں نے عرض کیا آنحضرت صلی اللہ علیہ وسلم کو بڑا تیز بخار ہے ۔ میں نے یہ بھی کہا کہ یہ بخار آنحضرت صلی اللہ علیہ وسلم کو اس لیے اتنا تیز ہے کہ آپ کا ثواب بھی دو گنا ہے آپ نے فرمایا کہ ہاں جو مسلمان کسی بھی تکلیف میں گرفتار ہوتا ہے تو اللہ تعالیٰ اس کی وجہ سے اس کے گناہ اس طرح جھاڑ دیتا ہے جیسے درخت کے پتے جھڑ جاتے ہیں ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 148540,
        "last_updated": null
    },
    {
        "urduURN": 4055730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5648,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، ان سے ابوحمزہ نے بیان کیا ، ان سے اعمش نے ، ان سے ابراہیم تیمی نے ، ان سے حارث بن سوید نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا آپ کو شدید بخار تھا میں نے عرض کیا یا رسول اللہ ! آپ کو بہت تیز بخار ہے آنحضرت صلی اللہ علیہ وسلم نے فرمایا ہاں مجھے تنہا ایسا بخار ہوتا ہے جتنا تم میں کے دو آدمی کو ہوتا ہے میں نے عرض کیا یہ اس لیے کہ آنحضرت صلی اللہ علیہ وسلم کا ثواب بھی دو گنا ہے ؟ فرمایا کہ ہاں یہی بات ہے ، مسلمان کو جو بھی تکلیف پہنچتی ہے کاٹنا ہو یا اس سے زیادہ تکلیف دینے والی کوئی چیز تو جیسے درخت اپنے پتوں کو گرا تا ہے اسی طرح اللہ پاک اس تکلیف کو اس کے گناہوں کا کفارہ بنا دیتا ہے ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 148550,
        "last_updated": null
    },
    {
        "urduURN": 4055740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5649,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے ابو عوانہ نے بیان کیا ، ان سے منصور نے ، ان سے ابووائل نے اور ان سے حضرت ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا بھوکے کو کھانا کھلاؤ اور مریض کی عیادت یعنی مزاج پرسی کرو اور قیدی کو چھڑاؤ ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 148560,
        "last_updated": null
    },
    {
        "urduURN": 4055750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5650,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا کہ مجھے اشعث بن سلیم نے خبر دی ، کہا کہ میں نے معاویہ بن سوید بن مقرن سے سنا ، ان سے حضرت براء  بن عازب رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ہمیں سات باتوں کا حکم دیا تھا اور سات باتوں سے منع فرمایا تھا ۔ ہمیں آنحضرت صلی اللہ علیہ وسلم نے سونے کی انگوٹھی ، ریشم ، دیبا ، استبرق ( ریشمی کپڑے ) پہننے سے اور قسی اور مثیرہ ( ریشمی ) کپڑوں کی دیگر جملہ قسمیں پہننے سے منع فرمایا تھا اور آپ نے ہمیں یہ حکم دیا تھا کہ ہم جنازہ کے پیچھے چلیں ، مریض کی مزاج پرسی کریں اور سلام کو پھیلائیں ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 148570,
        "last_updated": null
    },
    {
        "urduURN": 4055760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5651,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے ابن المنکدر نے ، انہوں نے حضرت جابر بن عبداللہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں ایک مرتبہ بیمار پڑا تو نبی کریم صلی اللہ علیہ وسلم اور حضرت ابوبکر صدیق رضی اللہ عنہ پیدل میری عیادت کوتشریف لائے ان بزرگوں نے دیکھا کہ مجھ پر بے ہوشی غالب ہے ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم نے وضو کیا اور اپنے وضو کا پانی مجھ پر چھڑکا ، اس سے مجھے ہوش آ گیا تو میں نے دیکھا کہ حضور اکرم صلی اللہ علیہ وسلم تشریف رکھتے ہیں ، میں نے عرض کیا یا رسول اللہ ! میں اپنے مال میں کیا کروں کس طرح اس کا فیصلہ کروں ؟ آنحضرت صلی اللہ علیہ وسلم نے مجھے کوئی جواب نہیں دیا ۔ یہاں تک کہ میراث کی آیت نازل ہوئی ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 148580,
        "last_updated": null
    },
    {
        "urduURN": 4055770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5652,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ بن ابی کثیر نے بیان کیا ، ان سے عمران ابوبکرنے بیان کیا ، ان سے عطاء  بن ابی رباح نے بیان کیا ، کہا کہ",
        "hadithText": "مجھ سے حضرت ابن عباس رضی اللہ عنہما نے کہا ، تمہیں میں ایک جنتی عورت کو نہ دکھا دوں ؟ میں نے عرض کیا کہ ضرور دکھائیں ، کہا کہ ایک سیاہ عورت نبی کریم صلی اللہ علیہ وسلم کی خدمت میں آئی اور کہا کہ مجھے مرگی آتی ہے اور اس کی وجہ سے میرا ستر کھل جاتا ہے ۔ میرے لیے اللہ تعالیٰ سے دعا کر دیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اگر تو چاہے تو صبر کر تجھے جنت ملے گی اور اگر چاہے تو میں تیرے لیے اللہ سے اس مرض سے نجات کی دعا کر دوں ۔ اس نے عرض کیا کہ میں صبر کروں گی پھر اس نے عرض کیا کہ مرگی کے وقت میرا ستر کھل جاتا ہے ۔ آنحضرت صلی اللہ علیہ وسلم اللہ تعالیٰ سے اس کی دعا کر دیں کہ ستر نہ کھلا کرے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس کے لیے دعا فرمائی ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 0,
        "last_updated": null
    },
    {
        "urduURN": 4055780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5653,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، کہا کہ مجھ سے یزید بن عبداللہ بن ہاد نے بیان کیا ، ان سے مطلب بن عبداللہ بن جذب کے غلام عمرو نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا کہ اللہ تعالیٰ کاارشاد ہے کہ جب میں اپنے کسی بندہ کو اس کے دو محبوب اعضاء ( آنکھوں ) کے بارے میں آزماتا ہوں ( یعنی نابینا کر دیتا ہوں ) اور وہ اس پر صبر کرتا ہے تو اس کے بدلے میں اسے جنت دیتا ہوں ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 148610,
        "last_updated": null
    },
    {
        "urduURN": 4055790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5654,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، ان سے امام مالک نے ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "جب رسول اللہ صلی اللہ علیہ وسلم ہجرت کر کے مدینہ تشریف لائے تو ابوبکر رضی اللہ عنہ اور بلال رضی اللہ عنہ کو بخار ہو گیا ۔ بیان کیا کہ پھر میں ان کے پاس ( عیادت کے لیے ) گئی اور پوچھا ، محترم والد بزرگوار آپ کا مزاج کیسا ہے ؟ بلال رضی اللہ عنہ سے بھی پوچھا کہ آپ کا کیا حال ہے ؟ بیان کیا کہ جب حضرت ابوبکر رضی اللہ عنہ کو بخار ہوا تو وہ یہ شعر پڑھا کرتے تھے ” ہر شخص اپنے گھر والوں میں صبح کرتا ہے اور موت اس کے تسمے سے بھی زیادہ قریب ہے ۔ “ اور بلال رضی اللہ عنہ کو جب افاقہ ہوتا تو یہ شعر پڑھتے تھے ” کاش مجھے معلوم ہوتا کہ کیا پھر ایک رات وادی میں گزار سکوں گا اور میرے چاروں طرف اذخر اور جلیل ( مکہ مکرمہ کی گھاس ) کے جنگل ہوں گے اور کیا میں کبھی مجنہ ( مکہ سے چند میل کے فاصلہ پر ایک بازار ) کے پانی پر اترو ں گا اور کیا پھر کبھی شامہ اور طفیل ( مکہ کے قریب دو پہاڑوں ) کو میں اپنے سامنے دیکھ سکوں گا ۔ ” حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت مےںحاضر ہوئی اور آپ کو اس کی اطلاع دی آپ نے دعا فرمائی کہ اے اللہ ! ہمارے دل میں مدینہ کی محبت بھی اتنی ہی کر دے جتنی مکہ کی محبت ہے بلکہ اس سے بھی زیادہ اور اس کی آب و ہوا کو ہمارے موافق کر دے اور ہمارے لیے اس کے مد اور صاع میں برکت عطا فرما ، اللہ اس کا بخار کہیں اور جگہ منتقل کر دے اسے مقام جحفہ میں بھیج دے ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 148620,
        "last_updated": null
    },
    {
        "urduURN": 4055800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5655,
        "hadithSanad": "ہم سے حجاج بن منہال نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا کہ مجھے عاصم نے خبر دی ، کہا کہ میں نے ابوعثمان سے سنا اور انہوں نے اسامہ بن زید رضی اللہ عنہما سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی ایک صاحبزادی ( حضرت زینب رضی اللہ عنہا ) نے آپ کو کہلوا بھیجا ۔ اس وقت حضور اکرم صلی اللہ علیہ وسلم کے ساتھ حضرت سعد رضی اللہ عنہ اور ہمارا خیال ہے کہ حضرت ابی بن کعب رضی اللہ عنہ تھے کہ میری بچی بستر مرگ پر پڑی ہے اس لیے آنحضرت صلی اللہ علیہ وسلم ہمارے یہاں تشریف لائیں ۔ آنحضرت صلی اللہ علیہ وسلم نے انہیں سلام کہلوایا اور فرمایا کہ اللہ تعالیٰ کو اختیار ہے جو چاہے دے اور جو چاہے لے لے ہر چیز اس کے یہاں متعین ومعلوم ہے ۔ اس لیے اللہ سے اس مصبیت پر اجر کی امیدوار رہو اور صبر کرو ۔ صاحبزادی نے پھر دوبارہ قسم دے کر ایک آدمی بلانے کو بھیجا ۔ چنانچہ آپ کھڑے ہوئے اور ہم بھی آپ کے ساتھ کھڑے ہو گئے پھر بچی آنحضرت صلی اللہ علیہ وسلم کی گود میں اٹھا کر رکھی گئی اور وہ جانکنی کے عالم میں پریشان تھی ۔ آپ کی آنکھوں میں آنسو آ گئے ۔ اس پر حضرت سعد رضی اللہ عنہ نے عرض کیا کہ یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! یہ کیا ہے ؟ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا یہ رحمت ہے ۔ اللہ تعالیٰ اپنے بندوں میں سے جس کے دل میں چاہتا ہے رکھتا ہے اور اللہ تعالیٰ بھی اپنے انہیں بندوں پر رحم کرتا ہے جو خود بھی رحم کرنے والے ہوتے ہیں ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 148630,
        "last_updated": null
    },
    {
        "urduURN": 4055810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5656,
        "hadithSanad": "ہم سے معلی بن اسد نے بیان کیا ، کہا ہم سے عبدالعزیز بن مختار نے بیان کیا ، کہا ہم سے خالد نے بیان کیا ، ان سے عکرمہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ایک دیہاتی کے پاس اس کی عیادت کے لیے تشریف لے گئے ۔ راوی نے بیان کیا کہ جب حضور اکرم صلی اللہ علیہ وسلم کسی کی عیادت کو تشریف لے جاتے تو مریض سے فرماتے کوئی فکر کی بات نہیں ۔ انشاءاللہ یہ مرض گناہوں سے پاک کرنے والا ہے لیکن اس دیہاتی نے آپ کے ان مبارک کلمات کے جواب میں کہا کہ آپ کہتے ہیں کہ یہ پاک کرنے والا ہے ہرگز نہیں بلکہ یہ بخار ایک بوڑھے پر غالب آ گیا ہے اور اسے قبر تک پہنچا کے رہے گا ۔ آپ نے فرمایا کہ پھر ایسا ہی ہو گا ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 148640,
        "last_updated": null
    },
    {
        "urduURN": 4055820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5657,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ثابت نے اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
        "hadithText": "ایک یہودی لڑکا ( عبدوس نامی ) نبی کریم صلی اللہ علیہ وسلم کی خدمت کیا کرتا تھا وہ بیمار ہوا تو حضور اکرم صلی اللہ علیہ وسلم اس کی مزاج پرسی کے لیے تشریف لائے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اسلام قبول کر لے چنانچہ اس نے اسلام قبول کر لیا اور سعیدبن مسیب نے بیان کیااپنے والد سے کہ جب ابوطالب کی وفات کا وقت قریب ہوا تو آنحضرت صلی اللہ علیہ وسلم ان کے پاس مزاج پرسی کے لیے تشریف لے گئے ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 148651,
        "last_updated": null
    },
    {
        "urduURN": 4055830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5658,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے یحییٰ بن ابی کثیر نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، کہا کہ مجھے میرے والد نے خبر دی اور انہیں حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "کچھ صحابہ نبی کریم صلی اللہ علیہ وسلم کی آپ کے ایک مرض کے دوران مزاج پرسی کرنے آئے ۔ آنحضرت صلی اللہ علیہ وسلم نے انہیں بیٹھ کر نماز پڑھائی لیکن صحابہ کھڑے ہو کر ہی نماز پڑھ رہے تھے ۔ اس لیے آنحضرت صلی اللہ علیہ وسلم نے انہیں بیٹھنے کا اشارہ کیا ۔ نماز سے فارغ ہونے کے بعد آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ امام اس لیے ہے کہ اس کی اقتداء کی جائے پس جب وہ رکوع کرے تو تم بھی رکوع کرو ، جب وہ سر اٹھائے تو تم ( مقتدی ) بھی اٹھا ؤ اور اگر وہ بیٹھ کر نماز پڑھے تو تم بھی بیٹھ کر پڑھو ۔ ابوعبداللہ حضرت امام بخاری نے کہا کہ مطابق قول حضرت حمیدی یہ حدیث منسوخ ہے کیونکہ نبی کریم صلی اللہ علیہ وسلم نے آخر ( مرض الوفات ) میں نماز بیٹھ کر پڑھائی اور لوگ آپ کے پیچھے کھڑے ہو کر اقتداء کر رہے تھے ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 148670,
        "last_updated": null
    },
    {
        "urduURN": 4055840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5659,
        "hadithSanad": "ہم سے مکی بن ابراہیم نے بیان کیا ، کہا ہم کوجعید بن عبدالرحمٰن نے خبر دی ، انہیں عائشہ بنت سعد نے کہ",
        "hadithText": "ان کے والد ( حضرت سعد بن ابی وقاص رضی اللہ عنہ ) نے بیان کیا کہ میں مکہ میں بہت سخت بیمار پڑ گیا تو رسول اللہ صلی اللہ علیہ وسلم میری مزاج پرسی کے لیے تشریف لائے ۔ میں نے عرض کیا اے اللہ کے نبی ! ( اگر وفات ہو گئی تو ) میں مال چھوڑوں گا اور میرے پاس سوا ایک لڑکی کے اور کوئی وارث نہیں ہے ۔ کیا میں اپنے دو تہائی مال کی وصیت کر دوں اور ایک تہائی چھوڑ دوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں میں نے عرض کیا پھر آدھے کی وصیت کر دوں اورآدھا ( اپنی بچی کے لیے ) چھوڑ دوں فرمایا کہ نہیں پھر میں نے کہا کہ ایک تہائی کی وصیت کر دوں اور باقی دو تہائی لڑکی کے لیے چھوڑ دوں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ایک تہائی کر دو اور ایک تہائی بھی بہت ہے ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے اپنا ہاتھ ان کی پیشانی پر رکھا ( حضرت سعد رضی اللہ عنہ نے بیان کیا ) اور میرے چہرے اور پیٹ پر آپ نے اپنا مبارک ہاتھ پھیرا پھر فرمایا اے اللہ ! سعد کو شفاء عطا فرما اور اس کی ہجرت کو مکمل کر ۔ حضور اکرم صلی اللہ علیہ وسلم کے دست مبارک کی ٹھنڈک اپنے جگر کے حصہ پر میں اب تک پا رہا ہوں ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 148680,
        "last_updated": null
    },
    {
        "urduURN": 4055850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5660,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، انہوں نے کہا ہم سے جریر نے بیان کیا ، ان سے اعمش نے بیان کیا ، ان سے ابراہیم تیمی نے بیان کیا ، ان سے حارث بن سوید نے بیان کیا کہ",
        "hadithText": "حضرت عبداللہ بن مسعود رضی اللہ عنہما نے کہا ، میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آپ کو بخار آیا ہوا تھا میں نے اپنے ہاتھ سے آنحضرت صلی اللہ علیہ وسلم کا جسم چھوا اور عرض کیا یا رسول اللہ ! آپ کو تو بڑا تیز بخار ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ہاں مجھے تم میں کے دو آدمیو ں کے برابر بخار چڑھتا ہے ۔ میں نے عرض کیا یہ اس لیے ہو گا کہ آنحضرت صلی اللہ علیہ وسلم کو دگنا اجر ملتا ہے ۔ آپ نے فرمایا کہ ہاں اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ کسی بھی مسلمان کو مرض کی تکلیف یا کوئی اور کوئی تکلیف ہوتی ہے تو اللہ تعالیٰ اس کے گناہوں کو اس طرح گراتا ہے جیسے درخت اپنے پتوں کو گرادیتا ہے ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 148690,
        "last_updated": null
    },
    {
        "urduURN": 4055860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5661,
        "hadithSanad": "ہم سے قبیصہ نے بیان کیا ، انہوں نے کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے اعمش نے بیان کیا ، ان سے ابراہیم تیمی نے ، ان سے حارث بن سوید نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں جب آپ بیمار تھے حاضر ہوا ۔ میں نے آپ کا جسم چھوا ، آپ کو تیز بخار تھا ۔ میں نے عرض کیا آپ کو تو بڑا تیز بخار ہے یہ اس لیے ہو گا کہ آپ کو دگنا ثواب ملے گا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں اور کسی مسلمان کو بھی جب کوئی تکلیف پہنچتی ہے تو اس کے گناہ اس طرح جھڑ جاتے ہیں جیسے درخت کے پتے جھڑ جاتے ہیں ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 148700,
        "last_updated": null
    },
    {
        "urduURN": 4055870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5662,
        "hadithSanad": "ہم سے اسحاق بن شاہین واسطی نے بیان کیا ، کہا ہم سے خالد بن عبداللہ نے بیان کیا ، ان سے خالد حذاء نے ، ان سے عکرمہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم ایک شخص کی عیادت کے لیے تشریف لے گئے اور ان سے فرمایا کہ کوئی فکر نہیں اگر اللہ نے چاہا ۔ ( یہ مرض ) گناہوں سے پاک کرنے والا ہو گا لیکن اس نے یہ جواب دیا کہ ہرگز نہیں یہ تو ایسا بخار ہے جو ایک بوڑھے پر غالب آ چکا ہے اور اسے قبر تک پہنچا کر ہی رہے گا ، اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر ایسا ہی ہو گا ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 148710,
        "last_updated": null
    },
    {
        "urduURN": 4055880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5663,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے عروہ نے ، انہیں اسامہ بن زید رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم گدھے کی پالان پر فدک کی چادر ڈال کر اس پر سوار ہوئے اور اسامہ بن زید رضی اللہ عنہما کو اپنے پیچھے سوار کیا ، آنحضرت صلی اللہ علیہ وسلم سعد بن عبادہ رضی اللہ عنہ کی عیادت کو تشریف لے جا رہے تھے ، یہ جنگ بدر سے پہلے کا واقعہ ہے ۔ آنحضرت صلی اللہ علیہ وسلم روانہ ہوئے اور ایک مجلس سے گزرے جس میں عبداللہ بن ابی بن سلول بھی تھا ۔ عبداللہ ابھی مسلمان نہیں ہوا تھا اس مجلس میں ہر گروہ کے لوگ تھے مسلمان بھی ، مشرکین بھی یعنی بت پرست اور یہودی بھی ۔ مجلس میں عبداللہ بن رواحہ رضی اللہ عنہ بھی تھے ، سواری کی گرد جب مجلس تک پہنچی تو عبداللہ بن ابی نے اپنی چادر اپنی ناک پر رکھ لی اور کہا کہ ہم پر گرد نہ اڑاؤ ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے انہیں سلام کیا اور سواری روک کر وہاں اترگئے پھر آپ نے انہیں اللہ کے طرف بلایا اور قرآن مجید پڑھ کر سنایا ۔ اس پر عبداللہ بن ابی نے کہا میاں تمہاری باتیں میری سمجھ میں نہیں آتیں اگر حق ہیں تو ہماری مجلس میں انہیں بیان کر کے ہم کو تکلیف نہ پہنچایا کرو ، اپنے گھر جاؤ وہاں جو تمہارے پاس آئے اس سے بیان کرو ۔ اس پر حضرت ابن رواحہ رضی اللہ عنہ نے کہا کیوں نہیں یا رسول اللہ ! آپ ہماری مجلسوں میں ضرور تشریف لائیں کیونکہ ہم ان باتوں کو پسند کرتے ہیں ۔ اس پر مسلمانوں ، مشرکوں اور یہودیوں میں جھگڑ ے بازی ہو گئی اورقریب تھا کہ ایک دوسرے پر حملہ کر بیٹھتے لیکن آپ انہیں خاموش کرتے رہے یہاں تک کہ سب خاموش ہو گئے پھر آنحضرت صلی اللہ علیہ وسلم اپنی سواری پر سوار ہو کر سعد بن عبادہ رضی اللہ عنہ کے یہاں تشریف لے گئے اور ان سے فرمایا سعد ! تم نے سنا نہیں ابوحباب نے کیا کہا ، آپ کا اشارہ عبداللہ بن ابی کی طرف تھا ۔ اس پر حضرت سعد رضی اللہ عنہ بولے کہ یا رسول اللہ ! اسے معاف کر دیجئیے اور اس سے درگزر فرمایئے ۔ اللہ تعالیٰ نے آپ کو وہ نعمت عطا فرما دی جو عطا فرمانی تھی ( آپ کے مدینہ تشریف لانے سے پہلے ) اس بستی کے لوگ اس پر متفق ہو گئے تھے کہ اسے تاج پہنادیں اور اپنا سردار بنا لیں لیکن جب اللہ تعالیٰ نے اس منصوبہ کو اس حق کے ذریعہ جو آپ کو اس نے عطا فرمایا ہے ختم کر دیا تو وہ اس پر بگڑ گیا یہ جو کچھ معاملہ اس نے آپ کے ساتھ کیا ہے اسی کا نتیجہ ہے ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 148720,
        "last_updated": null
    },
    {
        "urduURN": 4055890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5664,
        "hadithSanad": "ہم سے عمرو بن عباس نے بیان کیا ، کہا ہم سے عبدالرحمٰن نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے محمد نے جو منکدر کے بیٹے ہیں اور ان سے حضرت جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم میری عیادت کے لیے تشریف لائے آپ نہ کسی خچر پر سوار تھے نہ کسی گھوڑے پر ۔ ( بلکہ آپ پیدل تشریف لائے تھے ۔ )</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 148730,
        "last_updated": null
    },
    {
        "urduURN": 4055900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5665,
        "hadithSanad": "ہم سے قبیصہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے ابن ابی نجیح اور ایوب نے ، ان سے مجاہد نے ، ان سے عبدالرحمٰن بن ابی لیلیٰ نے اور ان سے کعب بن عجرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم میرے قریب سے گزر ے اور میں ہانڈی کے نیچے آگ سلگا رہا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کیا تمہارے سر کی جوویں تمہیں تکلیف پہنچاتی ہیں ۔ میں نے عرض کیا جی ہاں پھر آپ نے حجام بلوایا اور اس نے میرا سر مونڈ دیا اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے مجھے فدیہ ادا کر دینے کا حکم فرمایا ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 148740,
        "last_updated": null
    },
    {
        "urduURN": 4055910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5666,
        "hadithSanad": "ہم سے یحییٰ بن یحییٰ ابو زکریا نے بیان کیا ، کہا ہم کو سلیمان بن بلال نے خبر دی ، ان سے یحییٰ بن سعید نے ، کہ میں نے قاسم بن محمد سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "( سر کے شدید درد کی وجہ سے ) عائشہ رضی اللہ عنہا نے کہاہائے رے سر ! اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اگر ایسا میری زندگی میں ہو گیا ( یعنی تمہارا انتقال ہو گیا ) تو میں تمہارے لیے استغفار اور دعا کروں گا ۔ عائشہ رضی اللہ عنہا نے کہا افسوس ، اللہ کی قسم ! میرا خیال ہے کہ آپ میرا مرجانا ہی پسند کرتے ہیں اور اگر ایسا ہو گیا تو آپ تو اسی دن رات اپنی کسی بیوی کے یہاں گزاریں گے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا بلکہ میں خود درد سر میں مبتلاہوں ۔ میرا ارادہ ہوتا تھا کہ ابوبکر رضی اللہ عنہ اور ان کے بیٹے کو بلا بھیجوں اور انہیں ( خلافت کی ) وصیت کر دوں ۔ کہیں ایسا نہ ہو کہ میرے بعد کہنے والے کچھ اور کہیں ( کہ خلافت ہمارا حق ہے ) یا آرزو کرنے والے کسی اور بات کی آرزو کریں ( کہ ہم خلیفہ ہو جائیں ) پھر میں نے اپنے جی میں کہا ( اس کی ضرورت ہی کیا ہے ) خود اللہ تعالیٰ ابوبکر رضی اللہ عنہ کے سو اورکسی کو خلیفہ نہ ہونے دے گا نہ مسلمان اور کسی کی خلافت ہی قبول کریں گے ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 148750,
        "last_updated": null
    },
    {
        "urduURN": 4055920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5667,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے عبدالعزیز بن مسلم نے بیان کیا ، کہا ہم سے سلیمان اعمش نے بیان کیا ، ان سے ابراہیم تیمی نے ، ان سے حارث بن سوید نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آپ کو بخار آیا ہوا تھا میں نے آپ کا جسم چھو کر عرض کیا کہ آنحضرت صلی اللہ علیہ وسلم کو بڑا تیز بخار ہے ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا کہ ہاں تم میں کے دو آدمیوں کے برابر ہے ۔ حضرت ابن مسعود رضی اللہ عنہما نے عرض کیا کہ آنحضرت صلی اللہ علیہ وسلم کا اجر بھی دو گنا ہے ۔ کہا ہاں پھر آپ نے فرمایا کہ کسی مسلمان کو بھی جب کسی مرض کی تکلیف یا اور کوئی تکلیف پہنچتی ہے تو اللہ اس کے گناہ کو اس طرح جھاڑ دیتا ہے جس طرح درخت اپنے پتوں کو جھاڑ تا ہے ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 148760,
        "last_updated": null
    },
    {
        "urduURN": 4055930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5668,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے عبدالعزیز بن عبداللہ بن ابی سلمہ نے بیان کیا ، کہا ہم کو زہری نے خبر دی ، انہیں عامر بن سعد بن ابی وقاص نے اور ان سے ان کے والد نے کہ",
        "hadithText": "ہمارے یہاں رسول اللہ صلی اللہ علیہ وسلم میری عیادت کے لیے تشریف لائے میں حجۃ الوداع کے زمانہ میں ایک سخت بیماری میں مبتلا ہو گیا تھا میں نے عرض کیا کہ میری بیماری جس حد کو پہنچ چکی ہے اسے آنحضرت صلی اللہ علیہ وسلم دیکھ رہے ہیں ، میں صاحب دولت ہوں اور میری وارث میری صرف ایک لڑکی کے سوا اور کوئی نہیں تو کیا میں اپنا دو تہائی مال صدقہ کروں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ۔ میں نے عرض کیا پھر آدھا کر دوں ، آپ نے فرمایا کہ نہیں ۔ میں نے عرض کیا ایک تہائی کر دوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تہائی بہت کافی ہے اگر تم اپنے وارثوں کو غنی چھوڑ کر جاؤ یہ اس سے بہتر ہے کہ انہیں محتاج چھوڑو اور وہ لوگوں کے سامنے ہاتھ پھیلاتے پھر یں اور تم جو بھی خرچ کرو گے اور اس سے اللہ کی خوشنودی حاصل کرنا مقصود ہو گا اس پر بھی تمہیں ثواب ملے گا ۔ یہاں تک کہ اس لقمہ پر بھی تمہیں ثواب ملے گا جو تم اپنی بیوی کے منہ میں ڈالتے ہو ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 148770,
        "last_updated": null
    },
    {
        "urduURN": 4055940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5669,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، ان سے معمر نے ( دوسری سند ) اور مجھ سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں عبیداللہ بن عبداللہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "جب رسول اللہ صلی اللہ علیہ وسلم کی وفات کا وقت قریب آیا تو گھر میں کئی صحابہ موجود تھے ۔ حضرت عمر بن خطاب رضی اللہ عنہ بھی وہیں موجود تھے ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا لاؤ میں تمہارے لیے ایک تحریر لکھ دوں تاکہ اس کے بعد تم غلط راہ پر نہ چلو ۔ حضرت عمر رضی اللہ عنہ نے اس پر کہا کہ آنحضرت صلی اللہ علیہ وسلم اس وقت سخت تکلیف میں ہیں اور تمہارے پاس قرآن مجید تو موجود ہے ہی ہمارے لیے اللہ کی کتاب کافی ہے ۔ اس مسئلہ پر گھر میں موجود صحابہ کا اختلاف ہو گیا اور بحث کرنے لگے ۔ بعض صحابہ کہتے تھے کہ آنحضرت صلی اللہ علیہ وسلم کو ( لکھنے کی چیزیں ) دے دو تاکہ آنحضور صلی اللہ علیہ وسلم ایسی تحریر لکھ دیں جس کے بعد تم گمراہ نہ ہو سکو اور بعض صحابہ وہ کہتے تھے جو حضرت عمر رضی اللہ عنہ نے کہا تھا ۔ جب آنحضرت صلی اللہ علیہ وسلم کے پاس اختلاف اور بحث بڑھ گئی تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہاں سے چلے جاؤ ۔ حضرت عبیداللہ نے بیان کیا کہ حضرت ابن عباس رضی اللہ عنہما کہا کرتے تھے کہ سب سے زیادہ افسوس یہی ہے کہ ان کے اختلاف اور بحث کی وجہ سے آنحضرت صلی اللہ علیہ وسلم نے وہ تحریر نہیں لکھی جو آپ مسلمانوں کے لیے لکھنا چاہتے تھے ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 148780,
        "last_updated": null
    },
    {
        "urduURN": 4055950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5670,
        "hadithSanad": "ہم سے ابراہیم بن حمزہ نے بیان کیا ، کہا ہم سے حاتم بن اسماعیل نے بیان کیا ، ان سے جعید بن عبدالرحمٰن نے بیان کیا کہ میں نے حضرت سائب بن یزید رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "مجھے میری خالہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں بچپن میں لے گئیں اور عرض کیا یا رسول اللہ ! میرے بھانجے کو درد ہے ۔ حضور اکرم صلی اللہ علیہ وسلم نے میرے سر پر ہاتھ پھیرا اور میرے لیے برکت کی دعا کی پھر آپ نے وضو کیا اور میں نے آپ کے وضو کا پانی پیا اور میں نے آپ کی پیٹھ کے پیچھے کھڑے ہو کر نبوت کی مہر آپ کے دونوں شانوں کے درمیان دیکھی ۔ یہ مہر نبوت حجلہ عروس کی گھنڈی جیسی تھی ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 148790,
        "last_updated": null
    },
    {
        "urduURN": 4055960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5671,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے ثابت بنانی نے بیان کیا اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کسی تکلیف میں اگر کوئی شخص مبتلا ہو تو اسے موت کی تمنا نہیں کرنی چاہیئے اور اگر کوئی موت کی تمنا کرنے ہی لگے تو یہ کہنا چاہیئے ، اے اللہ ! جب تک زندگی میرے لیے بہتر ہے مجھے زندہ رکھ اور جب موت میرے لیے بہتر ہو تو مجھ کو اٹھالے ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 148800,
        "last_updated": null
    },
    {
        "urduURN": 4055970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5672,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے ، ان سے اسماعیل بن ابی خالد نے اور ان سے قیس بن ابی حازم نے بیان کیا کہ",
        "hadithText": "ہم خباب بن ارت رضی اللہ عنہ کے یہاں ان کی عیادت کو گئے انہوں نے اپنے پیٹ میں سات داغ لگوائے تھے پھر انہوں نے کہا کہ ہمارے ساتھی جو رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں وفات پا چکے وہ یہاں سے اس حال میں رخصت ہوئے کہ دنیا ان کا اجر و ثواب کچھ نہ گھٹا سکی اور ان کے عمل میں کوئی کمی نہیں ہوئی اور ہم نے ( مال و دولت ) اتنی پائی کہ جس کے خرچ کرنے کے لیے ہم نے مٹی کے سوا اور کوئی محل نہیں پایا ( لگے عمارتیں بنوانے ) اور اگر نبی کریم صلی اللہ علیہ وسلم نے ہمیں مو ت کی دعا کرنے سے منع نہ کیا ہوتا تو میں اس کی دعا کرتا پھر ہم ان کی خدمت میں دوبارہ حاضر ہوئے تو وہ اپنی دیوار بنا رہے تھے انہوں نے کہا مسلمان کوہر اس چیز پر ثواب ملتا ہے جسے وہ خرچ کرتا ہے مگر اس ( کم بخت ) عمارت میں خرچ کرنے کا ثواب نہیں ملتا ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 148810,
        "last_updated": null
    },
    {
        "urduURN": 4055980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5673,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، کہا ہمیں عبدالرحمٰن بن عوف رضی اللہ عنہ کے غلام ابوعبیدہ نے خبر دی اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا آپ نے فرمایا کسی شخص کا عمل اسے جنت میں داخل نہیں کر سکے گا ۔ صحابہ کرام رضی اللہ عنہم نے عرض کیا یا رسول اللہ ! آپ کا بھی نہیں ؟ آپ نے فرمایا نہیں ، میرا بھی نہیں ، سوا اس کے کہ اللہ اپنے فضل و رحمت سے مجھے نوازے اس لیے ( عمل میں ) میانہ روی اختیار کرو اورقریب قریب چلو اور تم میں کوئی شخص موت کی تمنا نہ کرے کیونکہ یا وہ نیک ہو گا تو امید ہے کہ اس کے اعمال میں اور اضافہ ہو جائے اور اگر وہ برا ہے تو ممکن ہے وہ توبہ ہی کرے ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 148820,
        "last_updated": null
    },
    {
        "urduURN": 4055990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5674,
        "hadithSanad": "ہم سے عبداللہ بن ابی شیبہ نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام نے ، ان سے عباد بن عبداللہ بن زبیر نے بیان کیا کہ میں نے حضرت عائشہ رضی اللہ عنہا سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم میراسہارا لیے ہوئے تھے ( مرض الموت میں ) اور فرما رہے تھے اے اللہ تعالیٰ ! میری مغفرت فرما مجھ پر رحم کر اور مجھ کو اچھے رفیقوں ( فرشتوں اور پیغمبروں ) کے ساتھ ملادے ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 148830,
        "last_updated": null
    },
    {
        "urduURN": 4056000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5675,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ابو عوانہ نے بیان کیا ، ان سے منصور نے ، ان سے ابراہیم نے ، ان سے مسروق نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم جب کسی مریض کے پاس تشریف لے جاتے یاکوئی مریض آپ کے پاس لایا جاتا تو آپ یہ دعا فرماتے ، اے پروردگار لوگوں کے ! بیماری دور کر دے ، اے انسانوں کے پالنے والے ! شفاء عطا فرما ، تو ہی شفاء دینے والا ہے ۔ تیری شفاء کے سوا اور کوئی شفاء نہیں ، ایسی شفاء دے جس میں مرض بالکل باقی نہ رہے ۔ اور عمرو بن ابی قیس اور ابراہیم بن طہمان نے منصور سے بیان کیا ، انہوں نے ابراہیم اور ابو الضحیٰ سے کہ ” جب کوئی مریض آنحضرت صلی اللہ علیہ وسلم کے پاس لایا جاتا “</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 148840,
        "last_updated": null
    },
    {
        "urduURN": 4056010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5676,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر ( محمد بن جعفر ) نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے محمد بن منکدر نے ، کہا کہ میں نے حضرت جابر بن عبداللہ رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم میرے یہاں تشریف لائے میں بیمار تھا آنحضرت صلی اللہ علیہ وسلم نے وضو کیا اور وضو کا پانی مجھ پر ڈالا یا فرمایا کہ اس پر یہ پانی ڈال دواس سے مجھے ہوش آ گیا ۔ میں نے عرض کیا کہ میں تو کلالہ ہوں ( جس کے والد اور اولاد نہ ہو ) میرے ترکہ میں تقسیم کیسے ہو گی اس پر میراث کی آیت نازل ہوئی ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 148850,
        "last_updated": null
    },
    {
        "urduURN": 4056020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 75,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5677,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، کہا مجھ سے امام مالک نے ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "جب رسول اللہ صلی اللہ علیہ وسلم ہجرت کر کے مدینہ تشریف لائے توحضرت ابوبکر اور حضرت بلال رضی اللہ عنہما کو بخار ہو گیا ۔ بیان کیا کہ پھر میں ان کے پاس ( بیمار پرسی کے لیے ) گئی اور پوچھا کہ محترم والد بزرگوار ! آپ کا کیا حال ہے اور اے بلال رضی اللہ عنہ ! آپ کا کیا حال ہے بیان کیا کہ جب حضرت ابوبکر رضی اللہ عنہ کو بخار ہوتا تو وہ یہ شعر پڑھا کرتے تھے ۔  ” ہر شخص اپنے گھر والوں میں صبح کرتا ہے  اور موت اس کے تسمے سے بھی زیادہ قریب ہے “  اور حضرت بلال رضی اللہ عنہ کا جب بخار اترتا تو بلند آواز سے وہ یہ اشعار پڑھتے ۔ ( ترجمہ ) کاش مجھے معلوم ہوتا کہ میں ایک رات وادی ( مکہ ) میں اس طرح گزار سکوں گا  کہ میرے چاروں طرف اذخر اور جلیل ( گھاس ) کے درخت ہوں گے اور کیا کبھی پھر میں مجنہ کے گھاٹ پر اتر سکوں گا اور کیا کبھی شامہ اور طفیل میں اپنے سامنے دیکھ سکوں گا ۔  راوی نے بیان کیا کہ عائشہ رضی اللہ عنہا نے کہا پھر میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور آنحضرت صلی اللہ علیہ وسلم سے اس کے متعلق کہا تو آپ نے یہ دعا فرمائی اے اللہ ! ہمارے دلوں میں مدینہ کی محبت پیدا کر جیسا کہ ہمیں ( اپنے وطن ) مکہ کی محبت تھی بلکہ اس سے بھی زیادہ مدینہ کی محبت عطا کر اور اس کی آب و ہوا کو صحت بخش بنا دے اور ہمارے لیے اس کے صاع اور مد میں برکت عطا فرما اور اس کے بخار کو کہیں اور جگہ منتقل کر دے اسے جحفہ نامی گاؤں میں بھیج دے ۔</b>",
        "bookID": "75.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 148860,
        "last_updated": null
    }
]