[
    {
        "urduURN": 4056030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5678,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، انہوں نے کہا ہم سے ابو احمد زبیری نے بیان کیا ، ان سے عمر بن سعید بن ابی حسین نے بیان کیا ، انہوں نے کہا کہ مجھ سے عطاء  بن ابی رباح نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ نے کوئی ایسی بیماری نہیں اتاری جس کی دوا بھی نازل نہ کی ہو ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 148870,
        "last_updated": null
    },
    {
        "urduURN": 4056040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5679,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے بشر بن مفضل نے بیان کیا ، ان سے خالد بن ذکوان نے اور ان سے ربیع بنت معوذ بن عفراء رضی اللہ عنہم نے بیان کیا ، انہوں نے کہا",
        "hadithText": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ غزوات میں شریک ہوتی تھیں اور مسلمان مجاہد کو پانی پلاتی ، ان کی خدمت کرتی اور مقتولین اور مجروحین کو مدینہ منورہ لایا کرتی تھیں ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 148880,
        "last_updated": null
    },
    {
        "urduURN": 4056050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5680,
        "hadithSanad": "ہم سے حسین نے بیان کیا ، کہا ہم سے احمد بن منیع نے بیان کیا ، کہا ہم سے مروان بن شجاع نے بیان کیا ، ان سے سالم افطس نے بیان کیا ، ان سے سعید بن جبیر نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیاکہ",
        "hadithText": "شفاء تین چیزوں میں ہے ۔ شہد کے شربت میں ، پچھنا لگوانے میں اور آگ سے داغنے میں لیکن میں امت کوآگ سے داغ کر علاج کرنے سے منع کرتا ہوں ۔ حضرت ابن عباس رضی اللہ عنہما نے اس حدیث کو مرفوعاً نقل کیا ہے اور القمی نے روایت کیا ، ان سے لیث نے ، ان سے مجاہد نے ، ان سے حضرت ابن عباس رضی اللہ عنہما نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے شہد اور پچھنا لگوانے کے بارے میں بیان کیا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 148890,
        "last_updated": null
    },
    {
        "urduURN": 4056060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5681,
        "hadithSanad": "ہم سے محمد بن عبدالرحیم نے بیان کیا ، انہوں نے کہا ہم کو سریج بن یونس ابو حارث نے خبر دی ، انہوں نے کہا ہم سے مروان بن شجاع نے بیان کیا ، ان سے سالم افطس نے بیان کیا ، ان سے سعید بن جبیر نے بیان کیا اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا شفاء تین چیزوں میں ہے پچھنا لگوانے میں ، شہد پینے میں اور آگ سے داغنے میں مگر میں اپنی امت کو آگ سے داغنے سے منع کرتا ہوں ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 148900,
        "last_updated": null
    },
    {
        "urduURN": 4056070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5682,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، کہا کہ",
        "hadithText": "مجھے ہشام نے خبر دی ، انہیں ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کو شیرینی اور شہد پسند تھا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 148910,
        "last_updated": null
    },
    {
        "urduURN": 4056080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5683,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، انہوں نے کہا ہم سے عبدالرحمٰن بن غسیل نے بیان کیا ، ان سے عاصم بن عمیر بن قتادہ نے بیان کیا ، انہوں نے کہا کہ میں نے حضرت جابر بن عبداللہ رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا اگر تمہاری دواؤں میں کسی میں بھلائی ہے یا یہ کہا کہ تمہاری ( ان ) دواؤں میں بھلائی ہے ۔ تو پچھنا لگوانے یا شہد پینے اور آگ سے داغنے میں ہے اگر وہ مرض کے مطابق ہو اور میں آگ سے داغنے کو پسند نہیں کرتا ہوں ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 148920,
        "last_updated": null
    },
    {
        "urduURN": 4056090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5684,
        "hadithSanad": "ہم سے عیاش بن الولید نے بیان کیا ، کہا ہم سے عبدالاعلیٰ نے ، کہا ہم سے سعید نے ، ان سے قتادہ نے ، ان سے ابو المتوکل نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے کہ",
        "hadithText": "ایک صاحب نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا کہ میرا بھائی پیٹ کی تکلیف میں مبتلا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ انہیں شہد پلا پھر دوسری مرتبہ وہی صحابی حاضر ہوئے ۔ آپ نے اسے اس مرتبہ بھی شہد پلانے کے لیے کہا وہ پھر تیسری مرتبہ آیا اور عرض کیا کہ ( حکم کے مطابق ) میں نے عمل کیا ( لیکن شفاء نہیں ہوئی ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ سچا ہے اور تمہارے بھائی کا پیٹ جھوٹا ہے ، انہیں پھر شہد پلا ۔ چنانچہ انہوں نے شہد پھر پلایا اور اسی سے وہ تندرست ہو گیا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 148930,
        "last_updated": null
    },
    {
        "urduURN": 4056100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5685,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے سلام بن مسکین ابو الروح بصریٰ نے بیان کیا ، کہا کہ ہم سے ثابت نے بیان کیا ان سے حضرت انس رضی اللہ عنہ نے کہ",
        "hadithText": "کچھ لوگوں کو بیماری تھی ، انہوں نے کہا یا رسول اللہ ! ہمیں قیام کی جگہ عنایت فرما دیں اور ہمارے کھانے کا انتظام کر دیں پھر جب وہ لوگ تندرست ہو گئے تو انہوں نے کہا کہ مدینہ کی آب و ہوا خراب ہے چنانچہ آنحضرت صلی اللہ علیہ وسلم نے مقام حرہ میں اونٹوں کے ساتھ ان کے قیام کا انتظام کر دیا اور فرمایا کہ ان کا دودھ پیو جب وہ تندرست ہو گئے تو انہوں نے آپ کے چرواہے کو قتل کر دیا اور اونٹوں کوہانک کر لے گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے ان کے پیچھے آدمی دوڑائے اور وہ پکڑ ے گئے ( جیسا کہ انہوں نے چرواہے کے ساتھ کیا تھا ) آپ نے بھی ویسا ہی کیا ان کے ہاتھ پاؤں کٹوادیئے اور ان کی آنکھوں میں سلائی پھر وادی ۔ میں نے ان میں سے ایک شخص کو دیکھا کہ زبان سے زمین چاٹتا تھا اور اسی حالت میں وہ مر گیا ۔ سلام نے بیان کیا کہ مجھے معلوم ہو اکہ حجاج نے حضرت انس رضی اللہ عنہ سے کہا تم مجھ سے وہ سب سے سخت سزا بیان کرو جو رسول اللہ صلی اللہ علیہ وسلم نے کسی کو دی ہو تو انہوں نے یہی واقعہ بیان کیا جب حضرت امام حسن بصری تک یہ بات پہنچی توانہون نے کہا کاش وہ یہ حدیث حجاج سے نہ بیان کرتے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 148940,
        "last_updated": null
    },
    {
        "urduURN": 4056110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5686,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
        "hadithText": "( عرینہ کے ) کچھ لوگوں کو مدینہ منورہ کی آب و ہوا موافق نہیں آئی تھی تو نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ وہ آپ کے چرواہے کے یہاں چلے جائیں یعنی اونٹوں میں اور ان کا دودھ اورپیشاب پئیں ۔ چنانچہ وہ لوگ آنحضرت صلی اللہ علیہ وسلم کے چرواہے کے پاس چلے گئے اور اونٹوں کا دودھ اور پیشاب پیا جب وہ تندرست ہو گئے تو انہوں نے چرواہے کو قتل کر دیا اور اونٹوں کوہانک کر لے گئے ۔ آپ کو جب اس کا علم ہوا تو آپ نے انہیں تلاش کرنے کے لیے لوگوں کو بھیجا جب انہیں لایا گیا تو آنحضرت صلی اللہ علیہ وسلم کے حکم سے ان کے بھی ہاتھ اورپاؤں کاٹ دیئے گئے اور ان کی آنکھوں میں سلائی پھیر دی گئی ( جیسا کہ انہوں نے چرواہے کے ساتھ کیا تھا ) قتادہ نے بیان کیا کہ مجھ سے محمد بن سیرین نے بیان کیا کہ یہ حدود کے نازل ہونے سے پہلے کا واقعہ ہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 148950,
        "last_updated": null
    },
    {
        "urduURN": 4056120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5687,
        "hadithSanad": "ہم سے عبداللہ بن ابی شیبہ نے بیان کیا ، انہوں نے کہا ہم سے عبیداللہ نے بیان کیا ، انہوں نے کہا ہم سے اسرائیل نے بیان کیا ، انہوں نے کہا ان سے منصور نے بیان کیا ، ان سے خالد بن سعد نے بیان کیا کہ",
        "hadithText": "ہم باہر گئے ہوئے تھے اورہمارے ساتھ حضرت غالب بن ابجر رضی اللہ عنہ بھی تھے ۔ وہ راستہ میں بیمار پڑ گئے پھر جب ہم مدینہ واپس آئے اسوقت بھی وہ بیمار ہی تھے ۔ حضرت ابن ابی عتیق ان کی عیادت کے لیے تشریف لائے اور ہم سے کہا کہ انہیں یہ کالے دانے ( کلونجی ) استعمال کراؤ ، اس کے پانچ یا سات دانے لے کرپیس لو اور پھر زیتون کے تیل میں ملا کر ( ناک کے ) اس طرف اور اس طرف اسے قطرہ قطرہ کر کے ٹپکاؤ کیونکہ حضرت عائشہ رضی اللہ عنہا نے مجھ سے بیان کیا کہ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ کلونجی ہر بیماری کی دواہے سوا سام کے ۔ میں نے عرض کیا سام کیا ہے ؟ فرمایا کہ موت ہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 148960,
        "last_updated": null
    },
    {
        "urduURN": 4056130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5688,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، انہوں نے کہا کہ",
        "hadithText": "مجھے ابوسلمہ اور سعید بن مسیب نے خبر دی اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے خبر دی ، انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا کہ سیاہ دانوں میں ہر بیماری سے شفاء ہے سوا سام کے ۔ ابن شہاب نے کہا کہ سام موت ہے اور ” سیاہ دانہ “ کلونجی کو کہتے ہیں ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 148970,
        "last_updated": null
    },
    {
        "urduURN": 4056140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5689,
        "hadithSanad": "ہم سے حبان بن موسیٰ نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، انہیں یونس بن یزید نے خبر دی ، انہیں عقیل نے ، انہیں ابن شہاب نے ، انہیں عروہ نے کہ",
        "hadithText": "حضرت عائشہ رضی اللہ عنہا بیمار کے لیے اور میت کے سوگوار وں کے لیے تلبینہ ( روا ، دودھ اور شہد ملا کر دلیہ ) پکانے کا حکم دیتی تھیں اور فرماتی تھیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا آپ نے فرمایا کہ تلبینہ مریض کے دل کو سکون پہنچاتا ہے اور غم کو دور کرتا ہے ( کیونکہ اسے پینے کے بعد عموماً نیند آجاتی ہے یہ زود ہضم بھی ہے ۔ )</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 148980,
        "last_updated": null
    },
    {
        "urduURN": 4056150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5690,
        "hadithSanad": "ہم سے فروہ بن ابی مغراء نے بیان کیا ، کہا ہم سے علی بن مسہر نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "وہ تلبینہ پکانے کا حکم دیتی تھیں اور فرماتی تھیں کہ اگرچہ وہ ( مریض کو ) ناپسند ہوتا ہے لیکن وہ اس کو فائدہ دیتا ہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 148990,
        "last_updated": null
    },
    {
        "urduURN": 4056160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5691,
        "hadithSanad": "ہم سے معلی بن اسد نے بیان کیا ، کہا ہم سے وہیب بن خالد نے بیان کیا ، ان سے عبداللہ ابن طاؤس نے ، ان سے ان کے والد نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے پچھنا لگوایا اور پچھنا لگانے والے کواس کی مزدوری دی اور ناک میں دوا ڈلوائی ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 149000,
        "last_updated": null
    },
    {
        "urduURN": 4056170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5692,
        "hadithSanad": "ہم سے صدقہ بن فضل نے بیان کیا ، کہا ہم کو ابن عیینہ نے خبر دی ، کہا میں نے زہری سے سنا ، انہوں نے عبیداللہ بن عبداللہ سے کہ حضرت ام قیس بنت محصن رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا آپ نے فرمایا تم لوگ اس عود ہندی ( کست ) کا استعمال کیا کرو کیونکہ اس میں سات بیماریوں کا علاج ہے ۔ حلق کے درد میں اسے ناک میں ڈالا جاتا ہے ، پسلی کے درد میں چبائی جاتی ہے ۔ \n<span class=urdu_sanad></span> اور میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں اپنے ایک شیر خوار لڑکے کو لے کر حاضر ہوئی پھر آنحضرت صلی اللہ علیہ وسلم کے اوپر اس نے پیشاب کر دیا تو آپ نے پانی منگوا کر پیشاب کی جگہ پر چھینٹا دیا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 149011,
        "last_updated": null
    },
    {
        "urduURN": 4056190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5694,
        "hadithSanad": "ہم سے ابو معمر نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، کہا ہم سے ایوب نے بیان کیا ، ان سے عکرمہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ( ایک مرتبہ ) روزہ کی حالت میں پچھنا لگوایا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 149030,
        "last_updated": null
    },
    {
        "urduURN": 4056200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5695,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے ، ان سے طاؤس اور عطاء  بن ابی رباح نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے پچھنا لگوایا جبکہ آپ احرام سے تھے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 149040,
        "last_updated": null
    },
    {
        "urduURN": 4056210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5696,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو حمید الطویل نے خبر دی اور انہیں انس رضی اللہ عنہ نے",
        "hadithText": "ان سے پچھنا لگوانے والے کی مزدوری کے بارے میں پوچھا گیا تھا ۔ انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے پچھنا لگوایا تھا آپ کو ابو طیبہ ( نافع یا میسرہ ) نے پچھنا لگایا تھا آپ نے انہیں دو صاع کھجور مزدوری میں دی تھی اور آپ نے ان کے مالکوں ( بنو حارثہ ) سے گفتگو کی تو انہوں نے ان سے وصول کئے جانے والے لگان میں کمی کر دی تھی اور آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ( خون کے دباؤ کا ) بہترین علاج جو تم کرتے ہو وہ پچھنا لگوانا ہے اورعمدہ دوا عود ہندی کا استعمال کرنا ہے اور فرمایا اپنے بچوں کو عذرہ ( حلق کی بیماری ) میں بچوں کو ان کا تالو دبا کر تکلیف مت دو بلکہ قسط لگا دو اس سے ورم جاتا رہے گا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 149050,
        "last_updated": null
    },
    {
        "urduURN": 4056220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5697,
        "hadithSanad": "ہم سے سعید بن تلید نے بیان کیا ، انہوں نے کہا کہ مجھ سے ابن وہب نے بیان کیا کہ مجھے عمرو وغیرہ نے خبر دی ، ان سے بکیر نے بیان کیا ، ان سے عاصم بن عمرو قتادہ نے بیان کیا کہ",
        "hadithText": "حضرت جابر بن عبداللہ مقنع بن سنان تابعی کی عیادت کے لیے تشریف لائے پھر ان سے کہا کہ جب تک تم پچھنا نہ لگوا لو گے میں یہاں سے نہیں جاؤں گا ، میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس میں شفاء ہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 149060,
        "last_updated": null
    },
    {
        "urduURN": 4056230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5698,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، انہوں نے کہا کہ مجھ سے سلیمان بن بلال نے بیان کیا ، ان سے علقمہ نے ، انہوں نے عبدالرحمٰن اعرج سے سنا ، انہوں نے عبداللہ بن بحینہ رضی اللہ عنہ سے سنا وہ بیان کرتے تھے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے مکہ کے راستے میں مقام لحی جمل میں اپنے سر کے بیچ میں پچھنا لگوایا آنحضرت صلی اللہ علیہ وسلم اس وقت محرم تھے ۔ \n<span class=urdu_sanad>اور محمد بن عبداللہ انصاری نے بیان کیا ، انہوں نے کہا ہم کو ہشام بن حسان نے خبر دی ، ان سے عکرمہ نے بیان کیا اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے کہ</span> رسول اللہ صلی اللہ علیہ وسلم نے اپنے سر میں پچھنا لگوایا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 149071,
        "last_updated": null
    },
    {
        "urduURN": 4056250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5700,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے ابن ابی عدی نے بیان کیا ، ان سے ہشام بن حسان نے ، ان سے عکرمہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے حالت احرام میں اپنے سر میں پچھنا لگوایا ( یہ پچھنا آپ نے سر کے ) درد کی وجہ سے لگوایا تھا جو لحی جمل نامی پانی کے گھاٹ پر آپ کو ہو گیا تھا ۔ \n<span class=urdu_sanad>اور محمد بن سواء نے بیان کیا ، کہا ہم کو ہشام بن حسان نے خبر دی ، انہیں عکرمہ نے اور انہیں حضرت ابن عباس رضی اللہ عنہما نے کہ</span> رسول اللہ صلی اللہ علیہ وسلم نے احرام کی حالت میں اپنے سر میں پچھنا لگوایا ۔ آدھے سر کے درد کی وجہ سے جو آپ کو ہو گیا تھا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 149091,
        "last_updated": null
    },
    {
        "urduURN": 4056270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5702,
        "hadithSanad": "ہم سے اسماعیل بن ابان نے بیان کیا ، انہوں نے کہا ہم سے عبدالرحمٰن بن غسیل نے بیان کیا ، انہوں نے کہا کہ مجھ سے عاصم بن عمر نے بیان کیا ، ان سے حضرت جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا کہ اگر تمہاری دوائیوں میں کوئی بھلائی ہے تو شہد کے شربت میں ہے اور پچھنا لگوانے میں ہے اور آگ سے داغنے میں ہے لیکن میں آگ سے داغ کر علاج کو پسند نہیں کرتا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 149110,
        "last_updated": null
    },
    {
        "urduURN": 4056280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5703,
        "hadithSanad": "ہم سے مسددنے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب سختیانی نے بیان کیا ، کہا کہ میں نے مجاہد سے سنا ، ان سے عبدالرحمٰن بن ابی لیلیٰ نے اور ان سے کعب بن عجرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "صلح حدیبیہ کے موقع پر نبی کریم صلی اللہ علیہ وسلم میرے پاس تشریف لائے میں ایک ہانڈی کے نیچے آگ جلا رہا تھا اور جوویں میرے سر سے گر رہی تھی ( اور میں احرام باندھے ہوئے تھا ) آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا سر کی یہ جوویں تمہیں تکلیف پہنچاتی ہیں ؟ میں نے عرض کیا کہ جی ہاں ۔ فرمایا کہ پھر سر منڈوالے اور ( کفارہ کے طور پر ) تین دن کے روزے رکھ یا چھ مسکینوں کو کھانا کھلایا ایک قربانی کر دے ۔ ایوب نے کہا کہ مجھے یاد نہیں کہ ( ان تین چیزوں میں سے ) کس کا ذکر سب سے پہلے کیا تھا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 149120,
        "last_updated": null
    },
    {
        "urduURN": 4056290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5704,
        "hadithSanad": "ہم سے ابو الولید ہشام بن عبدالملک نے بیان کیا ، انہوں نے کہا ہم سے عبدالرحمٰن بن سلیمان بن غسیل نے بیان کیا ، انہوں نے کہا ہم سے عاصم بن عمر بن قتادہ نے بیان کیا ، انہوں نے کہا کہ",
        "hadithText": "میں نے حضرت جابر بن عبداللہ رضی اللہ عنہما سے سنا ، ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر تمہاری دواؤں میں شفاء ہے تو پچھنا لگوانے اور آگ سے داغنے میں ہے لیکن آگ سے داغ کر علاج کو میں پسند نہیں کرتا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 149130,
        "last_updated": null
    },
    {
        "urduURN": 4056300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5705,
        "hadithSanad": "ہم سے عمران بن میسرہ نے بیان کیا ، کہا ہم سے محمد بن فضیل نے بیان کیا ، ان سے حصین بن عبدالرحمٰن نے بیان کیا ، ان سے عامر شعبی نے اور ان سے حضرت عمران بن حصین رضی اللہ عنہما نے کہا کہ",
        "hadithText": "نظر بد اورزہریلے جانور کے کاٹ کھانے کے سوا اور کسی چیز پر جھاڑ پھونک صحیح نہیں ۔ ( حصین نے بیان کیا کہ ) پھر میں نے اس کا ذکر سعید بن جبیر سے کیا تو انہوں نے بیان کیا کہ ہم سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا میرے سامنے تمام امتیں پیش کی گئیں ایک ایک دو دونبی اور ان کے ساتھ ان کے ماننے والے گزرتے رہے اور بعض نبی ایسے بھی تھے کہ ان کے ساتھ کوئی نہیں تھا آخر میرے سامنے ایک بڑی بھاری جماعت آئی ۔ میں نے پوچھا یہ کون ہیں ، کیایہ میری امت کے لوگ ہیں ؟ کہا گیا کہ یہ حضرت موسیٰ علیہ السلام اور ان کی قوم ہے پھر کہا گیا کہ کناروں کی طرف دیکھو میں نے دیکھا کہ ایک بہت ہی عظیم جماعت ہے جو کناروں پر چھائی ہوئی ہے پھر مجھ سے کہا گیا کہ ادھر دیکھو ادھر دیکھو آسمان کے مختلف کناروں میں میں نے دیکھا کہ جماعت ہے جو تمام افق پر چھائی ہوئی ہے ۔ کہا گیا کہ یہ آپ کی امت ہے اور اس میں سے ستر ہزار حساب کے بغیر جنت میں داخل کر دیئے جائیں گے ۔ اس کے بعد آپ ( اپنے حجرہ میں ) تشریف لے گئے اور کچھ تفصیل نہیں فرمائی لوگ ان جنتیوں کے بارے میں بحث کرنے لگے اور کہنے لگے کہ ہم اللہ پر ایمان لائے ہیں اور اس کے رسول کی اتباع کی ہے ، اس لیے ہم ہی ( صحابہ ) وہ لوگ ہیں یا ہماری وہ اولاد ہیں جو اسلام میں پیدا ہوئے کیونکہ ہم جاہلیت میں پیدا ہوئے تھے ۔ یہ باتیں جب حضور اکرم صلی اللہ علیہ وسلم کو معلوم ہوئیں تو آپ باہر تشریف لائے اور فرمایا یہ وہ لوگ ہوں گے جو جھاڑ پھونک نہیں کراتے ، فال نہیں دیکھتے اور داغ کر علاج نہیں کرتے بلکہ اپنے رب پر بھروسہ کرتے ہیں ۔ اس پر عکاشہ بن محصن رضی اللہ عنہ نے عرض کیا یا رسول اللہ ! کیا میں بھی ان میں سے ہوں آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں ۔ اس کے بعد دوسرے صحابی کھڑے ہوئے اور عرض کیا یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! میں بھی ان میں ہوں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ عکاشہ تم سے بازی لے گئے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 149140,
        "last_updated": null
    },
    {
        "urduURN": 4056310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5706,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ بن سعیدقطان نے بیان کیا ، ان سے شعبہ نے بیان کیا کہ مجھ سے حمید بن نافع نے بیان کیا ، ان سے حضرت زینب رضی اللہ عنہا نے اور ان سے حضرت ام سلمہ رضی اللہ عنہا نے کہ",
        "hadithText": "ایک عورت کے شوہر کا انتقال ہو گیا ( زمانہ عدت میں ) اس عورت کی آنکھ دکھنے لگی تو لوگوں نے اس کا ذکر نبی کریم صلی اللہ علیہ وسلم سے کیا ۔ ان لوگوں نے آنحضرت صلی اللہ علیہ وسلم کے سامنے سرمہ کا ذکر کیا اور یہ کہ ( اگر سرمہ آنکھ میں نہ لگایا تو ) ان کی آنکھ کے متعلق خطرہ ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ( زمانہ جاہلیت میں ) عدت گزارنے والی تم عورتوں کے اپنے گھر میں سب سے بد تر کپڑے میں پڑا رہنا پڑتا تھا یا ( آپ نے یہ فرمایا کہ ) اپنے کپڑوں میں گھر کے سب سے بد تر حصہ میں پڑا رہنا پڑتا تھا پھر جب کوئی کتا گزرتا تو اس پروہ مینگنی پھینک کر مارتی ( تب عدت سے باہر ہوتی ) پس چار مہینے دس دن تک سرمہ نہ لگاؤ ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 149150,
        "last_updated": null
    },
    {
        "urduURN": 4056320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5707,
        "hadithSanad": "اور عفان بن مسلم ( امام بخاری کے شیخ ) نے کہا ( ان کو ابونعیم نے وصل کیا ) ہے کہ ہم سے سلیم بن حیان نے بیان کیا ، ان سے سعید بن میناء نے بیان کیا ، کہا کہ میں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا چھوت لگنا ، بدشگونی لینا ، الو کا منحوس ہونا اور صفر کا منحوس ہونا یہ سب لغو خیالات ہیں البتہ جذامی شخص سے ایسے بھاگتا رہ جیسے کہ شیر سے بھاگتا ہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 149160,
        "last_updated": null
    },
    {
        "urduURN": 4056330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5708,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے غندر نے بیان کیا کہا ہم سے شعبہ نے بیان کیا ، ان سے عبدالملک بن عمیر نے کہا کہ میں نے عمرو بن حریث سے سنا ، کہا کہ میں نے حضرت سعید بن زید رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ کھنبی من میں سے ہے اور اس کا پانی آنکھ کے لیے شفاء ہے ۔ اسی سند سے شعبہ نے بیان کیا کہ مجھے حکم بن عتیبہ نے خبر دی ، انہیں حسن بن عبداللہ عرنی نے ، انہیں عمرو بن حریث نے اور انہیں سعید بن زید رضی اللہ عنہ نے اور انہیں نبی کریم صلی اللہ علیہ وسلم نے یہی حدیث بیان کی ، شعبہ نے کہا کہ جب حکم نے بھی مجھ سے یہ حدیث بیان کر دی تو پھر عبدالملک بن عمیر کی روایت پر مجھکو اعتماد ہو گیا کیونکہ عبدالملک کا حافظہ آخر میں بگڑ گیا تھا شعبہ کو صرف اس کی روایت پر بھروسہ نہ رہا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 149170,
        "last_updated": null
    },
    {
        "urduURN": 4056340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، کہا کہ مجھ سے موسیٰ بن ابی عائشہ نے بیان کیا ، ان سے عبیداللہ بن عبداللہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما اور حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "حضرت ابوبکر رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم کی نعش مبارک کو بوسہ دیا ۔ \n<span class=urdu_sanad>( عبیداللہ نے ) بیان کیا کہ</span> حضرت عائشہ رضی اللہ عنہا نے کہا ہم نے آنحضرت صلی اللہ علیہ وسلم کے مرض ( وفات ) میں دوا آپ کے منہ میں ڈالی تو آپ نے ہمیں اشارہ کیا کہ دو ا منہ میں نہ ڈالو ہم نے خیال کیا کہ مریض کو دوا سے جو نفرت ہوتی ہے اس کی وجہ سے آنحضرت صلی اللہ علیہ وسلم منع فرما رہے ہیں پھر جب آپ کو ہوش ہوا تو آپ نے فرمایا کیوں میں نے تمہیں منع نہیں کیا تھا کہ دوا میرے منہ میں نہ ڈالو ۔ ہم نے عرض کیا کہ یہ شاید آپ نے مریض کی دوا سے طبعی نفرت کی وجہ سے فرمایا ہو گا ۔ اس پرآنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اب گھر میں جتنے لوگ اس وقت موجود ہیں سب کے منہ میں دوا ڈالی جائے اور میں دیکھتا رہوں گا ، البتہ حضرت عباس رضی اللہ عنہ کو چھوڑ دیا جائے کیونکہ وہ میرے منہ میں ڈالتے وقت موجود نہ تھے ، بعد میں آئے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 149181,
        "last_updated": null
    },
    {
        "urduURN": 4056360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5713,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے ، ان سے زہری نے ، کہا مجھ کوعبیداللہ بن عبداللہ بن عتبہ نے خبر دی اور انہیں ام قیس رضی اللہ عنہا نے کہ",
        "hadithText": "میں اپنے ایک لڑکے کو لے کر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی ۔ میں نے اس کی ناک میں بتی ڈالی تھی ، اس کا حلق دبایا تھا چونکہ اس کو گلے کی بیماری ہو گئی تھی آپ نے فرمایاتم اپنے بچوں کو انگلی سے حلق دبا کر کیوںتکلیف دیتی ہو یہ عود ہندی لو اس میں سات بیماریوں کی شفاء ہے ان میں ایک ذات الجنب ( پسلی کا ورم بھی ہے ) اگر حلق کی بیماری ہو تو اس کو ناک میں ڈالو اگر ذات الجنب ہو تو حلق میں ڈالو ( لدود کرو ) سفیان کہتے ہیں کہ میں نے زہری سے سنا ، آنحضرت صلی اللہ علیہ وسلم نے دو بیماریوں کو تو بیان کیا باقی پانچ بیماریوں کو بیان نہیں فرمایا ، علی بن عبداللہ مدینی نے کہا میں نے سفیان سے کہا ، معمر توزہری سے یوں نقل کرتا ہے ” اعلقت عنہ “ انہوں نے کہا کہ معمر نے یاد نہیں رکھا ۔ مجھے یادہے زہری نے یوں کہا تھاا ” اعلقت علیہ “ اورسفیان نے اس تحنیک کو بیان کیا جو بچہ کو پیدائش کے وقت کی جاتی ہے سفیان نے انگلی حلق میں ڈال کر اپنے کو لے کو انگلی سے اٹھایا تو سفیان نے اعلاق کا معنی بچے کے حلق میں انگلی ڈال کرتالو کو اٹھایا انہوں نے یہ نہیں کہا ” اعلقوا عنہ شیئا “ ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 149200,
        "last_updated": null
    },
    {
        "urduURN": 4056370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5714,
        "hadithSanad": "ہم سے بشر بن محمد نے بیان کیا ، کہا ہم کوعبداللہ بن مبارک نے خبر دی ، کہا ہم کو معمر اوریونس نے خبر دی ، ان سے زہری نے بیان کیا کہ",
        "hadithText": "مجھ کو عبیداللہ بن عبداللہ بن عتبہ نے خبر دی اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ جب ( مرض الموت میں ) رسول اللہ صلی اللہ علیہ وسلم کے لیے چلنا پھرنا دشوار ہو گیا اور آپ کی تکلیف بڑھ گئی تو آپ نے بیماری کے دن میرے گھر میں گزارنے کی اجازت اپنی دوسری بیویوں سے مانگی جب اجازت مل گئی تو آنحضرت صلی اللہ علیہ وسلم دواشخاص حضرت عباس رضی اللہ عنہ اور ایک صاحب کے درمیاں ان کا سہارا لے کر باہر تشرےف لائے ، آپ کے مبارک قدم زمین پر گھسٹ رہے تھے ۔ میں نے حضرت ابن عباس رضی اللہ عنہما سے اس کا ذکر کیا تو انہوں نے کہا تمہیں معلوم ہے وہ دوسرے صاحب کون تھے جن کا عائشہ رضی اللہ عنہا نے نام نہیں بتایا ، میں نے کہا کہ نہیں کہا کہ وہ علی رضی اللہ عنہ تھے ۔ حضرت عائشہ رضی اللہ عنہا نے کہا کہ ان کے حجرے میں داخل ہونے کے بعد نبی کریم صلی اللہ علیہ وسلم نے فرمایا جبکہ آپ کا مرض بڑھ گیا تھا کہ مجھ پر سات مشک ڈالو جو پانی سے لبریز ہوں ۔ شاید میں لوگوں کو کچھ نصیحت کر سکوں ۔ بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم کو ہم نے ایک لگن میں بٹھایا جو آنحضرت صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت حفصہ رضی اللہ عنہ کا تھا اور آپ پر حکم کے مطابق مشکوں سے پانی ڈالنے لگے آخر آپ نے ہمیں اشارہ کیا کہ بس ہو چکا ۔ بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم صحابہ کے مجمع میں گئے ، انہیں نماز پڑھائی اور انہیں خطاب فرمایا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 149210,
        "last_updated": null
    },
    {
        "urduURN": 4056380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5715,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے کہا کہ مجھے عبیداللہ بن عبداللہ بن عتبہ نے خبر دی کہ",
        "hadithText": "ام قیس بنت محصن اسدیہ نے انہیں خبر دی ، ان کا تعلق قبیلہ خزیمہ کی شاخ بن اسد سے تھا وہ ان ابتدائی مہاجرات میں سے تھیں جنہوں نے نبی کریم صلی اللہ علیہ وسلم سے بیعت کی تھی ۔ آپ عکاشہ بن محصن رضی اللہ عنہ کی بہن ہیں ( انہوں نے بیان کیا کہ ) وہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں اپنے ایک بیٹے کو لے کر آئیں ۔ انہوں نے اپنے لڑکے کے عذرہ کا علاج تالو دبا کرکیا تھا آنحضرت صلی اللہ علیہ وسلم نے فرمایا آخر تم عورتیں کیوں اپنی اولاد کو یوں تالو دبا کر تکلیف پہنچاتی ہو ۔ تمہیں چاہیئے کہ اس مرض میں عود ہندی کا استعمال کیا کروکیونکہ اس میں سات بیماریوں سے شفاء ہے ۔ ان میں ایک ذات الجنب کی بیماری بھی ہے ( عود ہندی سے ) آنحضرت صلی اللہ علیہ وسلم کی مراد کست تھی یہی عود ہندی ہے ۔ اوریونس اور اسحاق بن راشد نے بیان کیا اور ان سے زہری نے اس روایت میں بجائے اعلقت علیہ کے علقت علیہ نقل کیا ہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 149220,
        "last_updated": null
    },
    {
        "urduURN": 4056390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5716,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے محمد بن جعفر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے قتادہ نے ، ان سے ابو المتوکل نے اور ان سے حضرت ابوسعید رضی اللہ عنہ نے کہ",
        "hadithText": "ایک صاحب رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا کہ میرے بھائی کو دست آ رہے ہیں آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ انہیں شہد پلاؤ ۔ انہوں نے پلایا اور پھر واپس آ کر کہا کہ میں نے انہیں شہد پلایا لیکن ان کے دستوں میں کوئی کمی نہیں ہوئی ۔ آپ نے اس پر فرمایا کہ اللہ تعالیٰ نے سچ فرمایا اور تمہارے بھائی کا پیٹ جھوٹا ہے ( آخر شہد ہی سے اسے شفاء ہوئی ) محمد بن جعفر کے ساتھ اس حدیث کو نضر بن شمیل نے بھی شعبہ سے روایت کیا ہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 149230,
        "last_updated": null
    },
    {
        "urduURN": 4056400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5717,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے صالح نے ، ان سے ابن شہاب نے بیان کیا ، انہیں ابوسلمہ بن عبدالرحمٰن وغیرہ نے خبر دی اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا امراض میں چھوت چھات صفر اور الو کی نحو ست کی کوئی اصل نہیں اس پر ایک اعرابی بولا کہ کہ یا رسول اللہ ! پھر میرے اونٹوں کو کیا ہو گیا کہ وہ جب تک ریگستان میں رہتے ہیں تو ہر نوں کی طرح ( صاف اور خوب چکنے ) رہتے ہیں پھر ان میں ایک خارش والا اونٹ آ جاتا ہے اور ان میں گھس کر انہیں بھی خارش لگا جاتا ہے تو آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا لیکن یہ بتاؤ کہ پہلے اونٹ کو کس نے خارش لگائی تھی ؟ اس کی روایت زہری نے ابوسلمہ اور حضرت سنان بن سنان کے واسطہ سے کی ہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 149240,
        "last_updated": null
    },
    {
        "urduURN": 4056410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5718,
        "hadithSanad": "ہم سے محمد بن یحییٰ نے بیان کیا ، کہا ہم کو عتاب بن بشیر نے خبر دی ، انہیں اسحاق نے ، ان سے زہری نے بیان کیا کہ مجھ کو عبیداللہ بن عبداللہ نے خبر دی کہ",
        "hadithText": "ام قیس بنت محصن جو پہلے پہل ہجرت کرنے والی عورتوں میں سے تھیں جنہوں نے رسول اللہ صلی اللہ علیہ وسلم سے بیعت کی تھی اور وہ حضرت عکاشہ بن محصن رضی اللہ عنہ کی بہن تھیں ، خبر دی کہ وہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں اپنے بیٹے کو لے کر حاضر ہوئیں ۔ انہوں نے اس بچے کا کوا گرنے میں تالو دبا کر علاج کیا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اللہ سے ڈرو کہ تم اپنی اولاد کو اس طرح تالو دبا کر تکلیف پہنچاتی ہو عود ہندی ( کوٹ ) اس میں استعمال کرو کیونکہ اس میں سات بیماریوں کے لیے شفاء ہے جن میں سے ایک نمونیہ بھی ہے ۔ آنحضرت صلی اللہ علیہ وسلم کی مراد عود ہندی سے کست تھی جسے قسط بھی کہتے ہیں یہ بھی ایک لغت ہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 149250,
        "last_updated": null
    },
    {
        "urduURN": 4056420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عارم نے بیان کیا ، کہا ہم سے حماد نے بیان کیا کہ",
        "hadithText": "ایوب سختیانی کے سامنے ابوقلابہ کی لکھی ہوئی احادیث پڑھی گئیں ان میں وہ احادیث بھی تھیں جنہیں ( ایوب نے ابوقلابہ سے ) بیان کیا تھا اور وہ بھی تھیں جو ان کے سامنے پڑھ کر سنائی گئی تھیں ۔ ان لکھی ہوئی احادیث کے ذخیرہ میں انس رضی اللہ عنہ کی یہ حدیث بھی تھی کہ ابوطلحہ اور انس بن نضر نے انس رضی اللہ عنہم کو داغ لگا کر ان کا علاج کیا تھا یا ابوطلحہ رضی اللہ عنہ نے ان کو خود اپنے ہاتھ سے داغا تھا ۔ اور عباد بن منصور نے بیان کیا ، ان سے ایوب نے ، ان سے ابوقلابہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے قبیلہ انصار کے بعض گھرانوں کو زہریلے جانوروں کے کاٹنے اور کان کی تکلیف میں جھاڑنے کی اجازت دی تھی تو انس رضی اللہ عنہ نے بیان کیا کہ ذات الجنب کی بیماری میں مجھے داغا گیا تھا رسول اللہ صلی اللہ علیہ وسلم کی زندگی میں اور اس وقت ابوطلحہ ، انس بن نضر اور زید بن ثابت رضی اللہ عنہم موجود تھے اور ابوطلحہ رضی اللہ عنہ نے مجھے داغا تھا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 149270,
        "last_updated": null
    },
    {
        "urduURN": 4056430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5722,
        "hadithSanad": "مجھ سے سعید بن عفیر نے بیان کیا ، انہوں نے کہا ہم سے یعقوب بن عبدالرحمٰن نے بیان کیا ، ان سے ابوحازم نے بیان کیا ، اور ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جب رسول اللہ صلی اللہ علیہ وسلم کے سر پر ( احد کے دن ) خود ٹوٹ گیا آپ کا مبارک چہرہ خون آلود ہو گیا اور سامنے کے دانت ٹوٹ گئے تو حضرت علی رضی اللہ عنہ ڈھال بھربھر کر پانی لاتے تھے اور حضرت فاطمہ رضی اللہ عنہا آپ کے چہرہ مبارک سے خون دھو رہی تھیں ۔ پھر جب حضرت فاطمہ رضی اللہ عنہا نے دیکھا کہ خون پانی سے بھی زیادہ آ رہا ہے تو انہوں نے ایک بوریا جلا کر رسول اللہ صلی اللہ علیہ وسلم کے زخموں پر لگایا اور اس سے خون رکا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 149280,
        "last_updated": null
    },
    {
        "urduURN": 4056440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5723,
        "hadithSanad": "مجھ سے یحییٰ بن سلیمان نے بیان کیا ، کہا مجھ سے ابن وہب نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے نافع نے اور ان سے حضرت ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا بخار جہنم کی بھاپ میں سے ہے پس اس کی گرمی کو پانی سے بجھاؤ ۔ نافع نے بیان کیا کہ عبداللہ بن عمر رضی اللہ عنہما ( کو جب بخار آتا تو ) یوں دعا کرتے کہ ” اللہ ! ہم سے اس عذاب کو دور کر دے ۔ “</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 149290,
        "last_updated": null
    },
    {
        "urduURN": 4056450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5724,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، انہوں نے کہا ان سے امام مالک نے بیان کیا ، ان سے ہشام نے بیان کیا ، ان سے فاطمہ بنت منذر نے بیان کیا کہ",
        "hadithText": "حضرت اسماء بنت ابی بکر صدیق رضی اللہ عنہما کے ہاں جب کوئی بخار میں مبتلا عورت لائی جاتی تھی تو وہ اس کے لیے دعا کرتیں اور اس کے گریبان میں پانی ڈالتیں وہ بیان کرتی تھیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں حکم دیا تھا کہ بخار کو پانی سے ٹھنڈا کریں ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 149300,
        "last_updated": null
    },
    {
        "urduURN": 4056460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5725,
        "hadithSanad": "مجھ سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، کہا ہم سے ہشام نے بیان کیا ، کہا کہ میرے والد نے مجھ کو خبر دی اور انہیں حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا بخار جہنم کی بھاپ میں سے ہے اس لیے اسے پانی سے ٹھنڈا کرو ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 149310,
        "last_updated": null
    },
    {
        "urduURN": 4056470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5726,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے ابوالاحوص نے بیان کیا ، کہا ہم سے سعید بن مسروق نے بیان کیا ، ان سے عبایہ بن رفاعہ نے ، ان سے ان کے دادا رافع بن خدیج نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا آپ نے فرمایا کہ بخار جہنم کی بھاپ میں سے ہے پس اسے پانی سے ٹھنڈا کر لیا کرو ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 149320,
        "last_updated": null
    },
    {
        "urduURN": 4056480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5727,
        "hadithSanad": "ہم سے عبدالاعلیٰ بن حماد نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، کہا ہم سے سعید نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "قبیلہ عکل اور عرینہ کے کچھ لوگ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اوراسلام کے بارے میں گفتگو کی ۔ انہوں نے کہا کہ اے اللہ کے نبی ! ہم مویشی والے ہیں ہم لوگ اہل مدینہ کی طرح کاشتکار نہیں ہیں ۔ مدینہ کی آب و ہوا انہیں موافق نہیں آئی تھی ، چنانچہ آنحضرت صلی اللہ علیہ نے ان کے لیے چند اونٹوں اور ایک چرواہے کا حکم دیا اور آپ نے فرمایا کہ وہ لوگ ان اونٹوں کے ساتھ باہر چلے جائیں اور ان کا دودھ اور پیشاب پئیں ۔ وہ لوگ چلے گئے لیکن حرہ کے نزدیک پہنچ کر وہ اسلام سے مرتد ہو گئے اور آنحضرت صلی اللہ علیہ وسلم کے چرواہے کو قتل کر ڈالا اور اونٹوں کولے کر بھاگ پڑے جب آنحضرت صلی اللہ علیہ وسلم کو اس کی خبر ملی تو آپ نے ان کی تلاش میں آدمی دوڑائے پھر آپ نے ان کے متعلق حکم دیا اور ان کی آنکھوں میں سلائی پھیر دی گئی ، ان کے ہاتھ کاٹ دئے گئے اور حرہ کے کنارے انہیں چھوڑ دیا گیا ، وہ اسی حالت میں مر گئے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 149330,
        "last_updated": null
    },
    {
        "urduURN": 4056490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5728,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے شعبہ نے کہا کہ مجھے حبیب بن ابی ثابت نے خبر دی ، کہا کہ میں نے ابراہیم بن سعد سے سنا ، کہا کہ میں نے اسامہ بن زید رضی اللہ عنہما سے سنا ، وہ سعد رضی اللہ عنہ سے بیان کرتے تھے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب تم سن لو کہ کسی جگہ طاعون کی وبا پھیل رہی ہے تو وہاں مت جاؤ لیکن جب کسی جگہ یہ وبا پھوٹ پڑے اور تم وہیں موجود ہو تو اس جگہ سے نکلو بھی مت ( حبیب بن ابی ثابت نے بیان کیا کہ میں نے ابراہیم بن سعد سے ) کہا تم نے خود یہ حدیث اسامہ رضی اللہ عنہ سے سنی ہے کہ انہوں نے سعد رضی اللہ عنہ سے بیان کیا اور انہوں نے اس کا انکار نہیں کیا ؟ فرمایا کہ ہاں ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 149340,
        "last_updated": null
    },
    {
        "urduURN": 4056500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5729,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں ابن شہاب نے ، انہیں عبدالحمید بن عبدالرحمٰن بن زید بن خطاب نے ، انہیں عبداللہ بن عبداللہ بن حارث بن نوفل نے اور انہیں حضرت ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "حضرت عمر بن خطاب رضی اللہ عنہ شام تشریف لے جا رہے تھے جب آپ مقام سرغ پر پہنچے تو آپ کی ملاقات فوجوں کے امراء حضرت ابوعبیدہ بن جراح رضی اللہ عنہ اور آپ کے ساتھیوں سے ہوئی ۔ ان لوگوں نے امیرالمؤمنین کو بتایا کہ طاعون کی وبا شام میں پھوٹ پڑی ہے ۔ حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ اس پر حضرت عمر رضی اللہ عنہ نے کہا کہ میرے پاس مہاجرین اولین کو بلا لاؤ ۔ آپ انہیں بلا لائے تو حضرت عمر رضی اللہ عنہ نے ان سے مشورہ کیا اور انہیں بتایا کہ شام میں طاعون کی وبا پھوٹ پڑی ہے ، مہاجرین اولین کی رائیں مختلف ہو گئیں ۔ بعض لوگوں نے کہا کہ صحابہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھیوں کی باقی ماندہ جماعت آپ کے ساتھ ہے اور یہ مناسب نہیں ہے کہ آپ انہیں اس وبا میں ڈال دیں ۔ حضرت عمر رضی اللہ عنہ نے کہا کہ اچھا اب آپ لوگ تشریف لے جائیں پھر فرمایا کہ انصار کو بلاؤ ۔ میں انصار کو بلا کر لایا آپ نے ان سے بھی مشورہ کیا اور انہوں نے بھی مہاجرین کی طرح اختلاف کیا کوئی کہنے لگا چلو ، کوئی کہنے لگا لوٹ جاؤ ۔ امیرالمؤمنین نے فرمایا کہ اب آپ لوگ بھی تشریف لے جائیں پھر فرمایا کہ یہاں پر جو قریش کے بڑے بوڑھے ہیں جو فتح مکہ کے وقت اسلام قبول کر کے مدینہ آئے تھے انہیں بلا لاؤ ، میں انہیں بلا کر لایا ۔ ان لوگوں میں کوئی اختلاف رائے پیدا نہیں ہوا سب نے کہا کہ ہمارا خیال ہے کہ آپ لوگوں کو ساتھ لے کر واپس لوٹ چلیں اور وبائی ملک میں لوگوں کو نہ لے کر جائیں ۔ یہ سنتے ہی حضرت عمر رضی اللہ عنہ نے لوگوں میں اعلان کرا دیا کہ میں صبح کو اونٹ پر سوار ہو کر واپس مدینہ منورہ لوٹ جاؤں گا تم لوگ بھی واپس چلو ۔ صبح کو ایسا ہی ہوا حضرت ابوعبیدہ ابن جراح رضی اللہ عنہ نے کہا کیا اللہ کی تقدیر سے فرار اختیار کیا جائے گا ۔ حضرت عمر رضی اللہ عنہ نے کہا کاش ! یہ بات کسی اورنے کہی ہوتی ہاں ہم اللہ کی تقدیر سے فرار اختیار کر رہے ہیں لیکن اللہ ہی کی تقدیر کی طرف ۔ کیا تمہارے پاس اونٹ ہوں اور تم انہیں لے کر کسی ایسی وادی میں جاؤ جس کے دو کنارے ہوں ایک سرسبز شاداب اور دوسرا خشک ۔ کیا یہ واقعہ نہیں کہ اگر تم سرسبز کنارے پر چراؤ گے تو وہ بھی اللہ کی تقدیر سے ہو گا ۔ اور خشک کنارے پر چراؤ گے تو وہ بھی اللہ کی تقدیر سے ہی ہو گا ۔ بیان کیا کہ پھر حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ آ گئے وہ اپنی کسی ضرورت کی وجہ سے اس وقت موجود نہیں تھے انہوں نے بتایا کہ میرے پاس مسئلہ سے متعلق ایک ” علم “ ہے ۔ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے آپ نے فرمایا کہ جب تم کسی سرزمین میں ( وبا کے متعلق ) سنو تو وہاں نہ جاؤ اور جب ایسی جگہ وبا آ جائے جہاں تم خود موجود ہو تو وہاں سے مت نکلو ۔ راوی نے بیان کیا کہ اس پر عمر رضی اللہ عنہ نے اللہ تعالیٰ کی حمد کی اور پھر واپس ہو گئے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 149350,
        "last_updated": null
    },
    {
        "urduURN": 4056510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5730,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں ابن شہاب نے ، انہیں عبداللہ بن عامر نے کہ",
        "hadithText": "حضرت عمر رضی اللہ عنہ شام کے لیے روانہ ہوئے جب مقام سرغ میں پہنچے تو آپ کو خبر ملی کہ شام میں طاعون کی وبا پھوٹ پڑی ہے ۔ پھر حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ نے ان کو خبر دی کہ رسول کریم صلی اللہ علیہ وسلم نے فرمایا جب تم وبا کے متعلق سنو کہ وہ کسی جگہ ہے تو وہاں نہ جاؤ اور جب کسی ایسی جگہ وبا پھوٹ پڑے جہاں تم موجود ہو تو وہاں سے بھی مت بھاگو ۔ ( وبا میں طاعون ہیضہ وغیرہ سب داخل ہیں ۔ )</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 149360,
        "last_updated": null
    },
    {
        "urduURN": 4056520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5731,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو امام مالک نے خبر دی ، انہیں نعیم مجمر نے اور انہوں نے کہا ہم سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا مدینہ منورہ میں دجال داخل نہیں ہو سکے گا اور نہ طاعون آ سکے گا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 149370,
        "last_updated": null
    },
    {
        "urduURN": 4056530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5732,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے عبدالواحد نے بیان کیا ، کہا ہم سے عاصم نے بیان کیا ، کہا مجھ سے حفصہ بنت سیرین نے بیان کیا ، کہا کہ مجھ سے حضرت انس بن مالک رضی اللہ عنہ نے پوچھا کہ",
        "hadithText": "یحییٰ بن سیرین کاکس بیماری میں انتقال ہوا تھا ۔ میں نے کہا کہ طاعون میں ۔ بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ طاعون ہر مسلمان کے لیے شہادت ہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 149380,
        "last_updated": null
    },
    {
        "urduURN": 4056540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5733,
        "hadithSanad": "ہم سے ابو عاصم نے بیان کیا ، ان سے امام مالک نے ، ان سے سمی نے ، ان سے ابوصالح نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پیٹ کی بیماری میں یعنی ہیضہ سے مرنے والا شہید ہے اور طاعون کی بیماری میں مرنے والا شہید ہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 149390,
        "last_updated": null
    },
    {
        "urduURN": 4056550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5734,
        "hadithSanad": "ہم سے اسحاق بن راہویہ نے بیان کیا ، کہا ہم کو حبان نے خبر دی ، کہا ہم سے داؤد بن ابی الفرت نے بیان کیا ، کہا ہم سے عبداللہ بن بریدہ نے ، ان سے یحییٰ بن عمر نے اور انہیں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے خبر دی کہ",
        "hadithText": "آپ نے رسول اللہ صلی اللہ علیہ وسلم سے طاعون کے متعلق پوچھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ ایک عذاب تھا اللہ تعالیٰ جس پر چاہتا اس پر اس کو بھیجتا تھا پھر اللہ تعالیٰ نے اسے مومنین ( امت محمدیہ کے لیے ) رحمت بنا دیا اب کوئی بھی اللہ کا بندہ اگر صبر کے ساتھ اس شہر میں ٹھہرا رہے جہاں طاعون پھوٹ پڑا ہو اوریقین رکھتا ہے کہ جو کچھ اللہ تعالیٰ نے اس کے لیے لکھ دیا ہے اس کے سوا اس کو اور کوئی نقصان نہیں پہنچ سکتا اور پھر طاعون میں اس کا انتقال ہو جائے تو اسے شہید جیسا ثواب ملے گا ۔ حبان بن حلال کے ساتھ اس حدیث کو نضر بن شمیل نے بھی داؤد سے روایت کیا ہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 149400,
        "last_updated": null
    },
    {
        "urduURN": 4056560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5735,
        "hadithSanad": "مجھ سے ابراہیم بن موسیٰ نے بیان کیا ، کہا ہم کو ہشام نے خبر دی ، انہیں معمر نے ، انہیں زہری نے ، انہیں عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم اپنے مرض الوفات میں اپنے اوپر معوذات ( سورۃ الاخلاص ، الفلق اور الناس ) کا دم کیا کرتے تھے ۔ پھر جب آپ کے لیے دشوار ہو گیا تو میں ان کادم آپ پر کیا کرتی تھی اور برکت کے لیے آنحضرت صلی اللہ علیہ وسلم کاہاتھ آپ کے جسم مبارک پر بھی پھیر لیتی تھی ۔ پھر میں نے اس کے متعلق پوچھا کہ آنحضرت صلی اللہ علیہ وسلم کس طرح دم کرتے تھے ، انہوں نے بتایا کہ اپنے ہاتھ پر دم کر کے ہاتھ کو چہرے پر پھیرا کرتے تھے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 149410,
        "last_updated": null
    },
    {
        "urduURN": 4056570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5736,
        "hadithSanad": "مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے ، ان سے شعبہ نے ، ان سے ابو بشر نے ، ان سے ابو المتوکل نے ، ان سے ابو سعید خدری رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے چند صحابہ در حالت سفر عرب کے ایک قبیلہ پر گزر ے ۔ قبیلہ والوں نے ان کی ضیافت نہیں کی کچھ دیر بعد اس قبیلہ کے سردار کوبچھو نے کاٹ لیا ، اب قبیلہ والوں نے ان صحابہ سے کہا کہ آپ لوگوں کے پاس کوئی دوا یا کوئی جھاڑنے والا ہے ۔ صحابہ نے کہا کہ تم لوگوں نے ہمیں مہمان نہیں بنایا اور اب ہم اس وقت تک دم نہیں کریں گے جب تک تم ہمارے لیے اس کی مزدوری نہ مقرر کر دو ۔ چنانچہ ان لوگوں نے چند بکریاں دینی منظورکر لیں پھر ( ابو سعید خدری رضی اللہ عنہ ) سورۃ الفاتحہ پڑھنے لگے اور اس پر دم کرنے میں منہ کا تھوک بھی اس جگہ پر ڈالنے لگے ۔ اس سے وہ شخص اچھا ہو گیا ۔ چنانچہ قبیلہ والے بکریاں لے کر آئے لیکن صحابہ نے کہا کہ جب تک ہم نبی کریم صلی اللہ علیہ وسلم سے نہ پوچھ لیں یہ بکریاں نہیں لے سکتے پھر جب آنحضرت صلی اللہ علیہ وسلم سے پوچھا تو آپ مسکرائے اور فرمایا تمہیں کیسے معلوم ہو گیا تھا کہ سورۃ الفاتحہ سے دم بھی کیا جا سکتا ہے ، ان بکریوں کو لے لو اور اس میں میرا بھی حصہ لگاؤ ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 149420,
        "last_updated": null
    },
    {
        "urduURN": 4056580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5737,
        "hadithSanad": "ہم سے سیدان بن مضارب ابو محمد باہلی نے بیان کیا ، کہا ہم سے ابو معشر یوسف بن یزید البراء نے بیان کیا ، کہا کہ مجھ سے عبیداللہ بن اخنس ابو مالک نے بیان کیا ، ان سے ابن ابی ملیکہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "چند صحابہ ایک پانی سے گزرے جس کے پاس کے قبیلہ میں بچھو کا کاٹا ہوا ( لدیغ یا سلیم راوی کو ان دونوں الفاظ کے متعلق شبہ تھا ) ایک شخص تھا ۔ قبیلہ کا ایک شخص ان کے پاس آیا اور کہا کیا آپ لوگوں میں کوئی دم جھاڑ کرنے والا ہے ۔ ہمارے قبیلہ میں ایک شخص کو بچھو نے کاٹ لیا ہے چنانچہ صحابہ کی اس جماعت میں سے ایک صحابی اس شخص کے ساتھ گئے اور چند بکریوں کی شرط کے ساتھ اس شخص پر سورۃ الفاتحہ پڑھی ، اس سے وہ اچھا ہو گیا وہ صاحب شرط کے مطابق بکریاں اپنے ساتھیوں کے پاس لائے تو انہوں نے اسے قبول کر لینا پسند نہیں کیا اور کہا کہ اللہ کی کتاب پر تم نے اجرت لے لی ۔ آخر جب سب لوگ مدینہ آئے تو عرض کیا کہ یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! ان صاحب نے اللہ کی کتاب پر اجرت لے لی ہے ۔ آپ نے فرمایا جن چیزوں پر تم اجرت لے سکتے ہو ان میں سے زیادہ اس کی مستحق اللہ کی کتاب ہی ہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 149430,
        "last_updated": null
    },
    {
        "urduURN": 4056590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5738,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو سفیان نے خبر دی ، کہا کہ مجھ سے معبد بن خالد نے بیان کیا ، کہا کہ میں نے عبداللہ بن شداد سے سنا ، ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے مجھے حکم دیا یا ( آپ نے اس طرح بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے ) حکم دیا کہ نظر بد لگ جانے پر معوذتین سے دم کر لیا جائے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 149440,
        "last_updated": null
    },
    {
        "urduURN": 4056600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5739,
        "hadithSanad": "ہم سے محمد بن خالد نے بیان کیا ، کہا ہم سے محمد بن وہب بن عطیہ دمشقی نے بیان کیا ، کہا ہم سے محمد بن حرب نے بیان کیا ، کہا ہم سے محمد بن ولید زبیدی نے بیان کیا ، کہا ہم کو زہری نے خبر دی ، انہیں عروہ بن زبیر نے ، انہیں زینب بنت ابی سلمہ رضی اللہ عنہا نے اور ان سے حضرت ام سلمہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ان کے گھر میں ایک لڑکی دیکھی جس کے چہرے پر ( نظر بد لگنے کی وجہ سے ) کالے دھبے پڑ گئے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس پر دم کرا دو کیونکہ اسے نظر بد لگ گئی ہے ۔ اور عقیل نے کہا ان سے زہری نے ، انہیں عروہ نے خبر دی اور انہوں نے اسے نبی کریم صلی اللہ علیہ وسلم سے مر سلاً روایت کیا ہے ۔ محمد بن حرب کے ساتھ اس حدیث کو عبداللہ بن سالم نے بھی زبیدی سے روایت کیا ہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 149450,
        "last_updated": null
    },
    {
        "urduURN": 4056610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5740,
        "hadithSanad": "ہم سے اسحاق بن نصر نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، ان سے معمر نے ، ان سے ہمام نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا نظر بد لگناحق ہے اور آنحضرت صلی اللہ علیہ وسلم نے جسم پر گودنے سے منع فرمایا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 149460,
        "last_updated": null
    },
    {
        "urduURN": 4056620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5741,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے عبدالواحد نے بیان کیا ، کہا ہم سے سلیمان شیبانی نے بیان کیا ، کہا ہم سے عبدالرحمٰن بن اسود نے اور ان کے والد نے بیان کیا کہ",
        "hadithText": "میں نے حضرت عائشہ رضی اللہ عنہا سے زہریلے جانور کے کاٹنے میں جھاڑ نے کے متعلق پوچھا تو انہوں نے کہا کہ ہر زہریلے جانور کے کاٹنے میں جھاڑنے کی نبی کریم صلی اللہ علیہ وسلم نے اجازت دی ہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 149470,
        "last_updated": null
    },
    {
        "urduURN": 4056630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5742,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے عبدالوارث بن سعید نے بیان کیا ، ان سے عبدالعزیز بن صہیب نے بیان کیا کہ",
        "hadithText": "میں اور ثابت بنانی حضرت انس بن مالک رضی اللہ عنہ کی خدمت میں حاضر ہوئے ، ثابت نے کہا ابوحمزہ ! ( حضرت انس رضی اللہ عنہ کی کنیت ) میری طبیعت خراب ہو گئی ہے ۔ حضرت انس رضی اللہ عنہ نے کہا پھر کیوں نہ میں تم پر وہ دعا پڑھ کر دم کر دوں جسے رسول اللہ صلی اللہ علیہ وسلم پڑھا کرتے تھے ، ثابت نے کہا کہ ضرور کیجئے حضرت انس رضی اللہ عنہ نے اس پر یہ دعا پڑھ کر دم کیا ۔ ” اے اللہ ! لوگوں کے رب ! تکلیف کو دور کر دینے والے ! شفاء عطا فرما ، تو ہی شفاء دینے والا ہے تیرے سوا کوئی شفاء دینے والا نہیں ، ایسی شفاء عطا فرما کہ بیماری بالکل باقی نہ رہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 149480,
        "last_updated": null
    },
    {
        "urduURN": 4056640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5743,
        "hadithSanad": "ہم سے عمرو بن علی فلاس نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے سلیمان اعمش نے ، ان سے مسلم بن صبیح نے ، ان سے مسروق نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم اپنے گھر کے بعض ( بیماروں ) پر یہ دعا پڑھ کر دم کرتے اور اپنا داہنا ہاتھ پھیر تے اور یہ دعا پڑھتے ۔ ” اے اللہ ! لوگوں کے پالنے والے ! تکلیف کو دور کر دے اسے شفاء دیدے تو ہی شفاء دینے والا ہے ۔ تیری شفاء کے سوا کوئی شفاء نہیں ۔ ایسی شفاء ( دے ) کہ کسی قسم کی بیماری باقی نہ رہ جائے ۔ “ سفیان ثوری نے بیان کیا کہ میں نے یہ دعا منصور بن معتمر کے سامنے بیان کی تو انہوں نے مجھ سے یہ ابراہیم نخعی سے بیان کی ، ان سے مسروق نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے اسی طرح بیان کی ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 149490,
        "last_updated": null
    },
    {
        "urduURN": 4056650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5744,
        "hadithSanad": "مجھ سے احمد بن ابی رجاء نے بیان کیا ، کہا ہم سے نضر بن شمیل نے بیان کیا ، ان سے ہشام بن عروہ نے ، انہیں ان کے والد نے خبر دی اور انہیں حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم دم کیا کرتے تھے اور یہ دعا پڑھتے تھے ” تکلیف کو دور کر دے اورلوگوں کے پالنہار ! تیرے ہی ہاتھ میں شفاء ہے ، تیرے سوا تکلیف کو دور کرنے والا کوئی اور نہیں ہے ۔ “</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 149500,
        "last_updated": null
    },
    {
        "urduURN": 4056660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5745,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، کہا کہ مجھ سے عبد ربہ بن سعید نے بیان کیا ، ان سے عمرہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم مریض کے لیے ( کلمے کی انگلی زمین پر لگا کر ) یہ دعا پڑھتے تھے ۔ ” اللہ کے نام کی مدد سے ہماری زمین کی مٹی ہم میں سے کسی کے تھوک کے ساتھ تاکہ ہمارا مریض شفاء پائے ہمارے رب کے حکم سے ۔ “</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 149510,
        "last_updated": null
    },
    {
        "urduURN": 4056670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5746,
        "hadithSanad": "مجھ سے صدقہ بن فضل نے بیان کیا ، کہا ہم کو ابن عیینہ نے خبر دی ، انہیں عبداللہ بن سعید نے ، انہیں عمرہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم دم کرتے وقت یہ دعاپڑھا کرتے تھے ” ہماری زمین کی مٹی اور ہمارا بعض تھوک ہمارے رب کے حکم سے ہمارے مریض کو شفاء ہو ۔ “</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 149520,
        "last_updated": null
    },
    {
        "urduURN": 4056680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5747,
        "hadithSanad": "ہم سے خالد بن مخلد نے بیان کیا ، کہا ہم سے سلیمان بن بلال نے بیان کیا ، ان سے یحییٰ بن سعید انصاری نے بیان کیا کہ میں نے ابوسلمہ بن عبدالرحمٰن بن عوف سے سنا ، کہا کہ میں نے حضرت ابوقتادہ رضی اللہ عنہ سے سنا ، انہوں نے کہا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ بیشک اچھا خواب اللہ کی طرف سے ہوتا ہے ، اور حلم ( برا خواب جس میں گھبراہٹ ہو ) شیطان کی طرف سے ہوتا ہے اس لیے جب تم میں سے کوئی شخص کوئی ایسا خواب دیکھے جو براہو تو جاگتے ہی تین مرتبہ بائیں طرف تھو تھو کرے اور اس خواب کی برائی سے اللہ کی پناہ مانگے ، اس طرح خواب کا اسے نقصان نہیں ہو گا اور ابوسلمہ نے کہا کہ پہلے بعض خواب مجھ پر پہاڑ سے بھی زیادہ بھاری ہوتا تھا جب سے میں نے یہ حدیث سنی اور اس پر عمل کرنے لگا ، اب مجھے کوئی پرواہ نہیں ہوتی ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 149530,
        "last_updated": null
    },
    {
        "urduURN": 4056690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5748,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا ، کہا ہم سے سلیمان بن بلال نے بیان کیا ، ان سے یونس بن یزید ایلی نے ، ان سے ابن شہاب زہری نے ، ان سے عروہ بن زبیر نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم جب اپنے بستر پر آرام فرمانے کے لیے لیٹتے تو اپنی دونوں ہتھیلیوں پر ” قل ھو اللہ احد “ اور ” قل اعوذ برب الناس اور الفلق “ سب پڑھ کر دم کرتے پھر دونوں ہاتھوں کو اپنے چہرہ پر اور جسم کے جس حصہ تک ہاتھ پہنچ پاتا پھیر تے ۔ حضرت عائشہ رضی اللہ عنہا نے کہا کہ پھر جب آپ بیمار ہوتے تو آپ مجھے اسی طرح کرنے کا حکم دیتے تھے ۔ یونس نے بیان کیا کہ میں نے ابن شہاب کو بھی دیکھا کہ وہ جب اپنے بستر پر لیٹتے اسی طرح ان کو پڑھ کر دم کیا کرتے تھے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 149540,
        "last_updated": null
    },
    {
        "urduURN": 4056700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5749,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ابو عوانہ نے بیان کیا ، ان سے ابو بشر ( جعفر ) ان سے ابو المتوکل علی بن داؤد نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے چند صحابہ ( 300 نفر ) ایک سفر کے لیے روانہ ہوئے جسے انہیں طے کرنا تھا راستے میں انہوں نے عرب کے ایک قبیلہ میں پڑاؤ کیا اور چاہا کہ قبیلہ والے ان کی مہمانی کریں لیکن انہوں نے انکار کیا ، پھر اس قبیلہ کے سردار کو بچھو نے کاٹ لیا اسے اچھا کرنے کی ہر طرح کی کوشش انہوں نے کر ڈالی لیکن کسی سے کچھ فائدہ نہیں ہوا ۔ آخر انہیں میں سے کسی نے کہا کہ یہ لوگ جنہوں نے تمہارے قبیلہ میں پڑاؤ کر رکھا ہے ان کے پاس بھی چلو ، ممکن ہے ان میں سے کسی کے پاس کوئی منتر ہو ۔ چنانچہ وہ صحابہ کے پاس آئے اور کہا لوگو ! ہمارے سردار کو بچھو نے کاٹ لیا ہے ہم نے ہر طرح کی بہت کوشش اس کے لیے کر ڈالی لیکن کسی سے کوئی فائدہ نہیں ہوا کیا تم لوگوں میں سے کس کے پاس اس کے لیے منترہے ؟ صحابہ میں سے ایک صاحب ( ابو سعید خدری رضی اللہ عنہ ) نے کہا کہ ہاں واللہ میں جھاڑناجانتا ہوں لیکن ہم نے تم سے کہا تھا کہ ہماری مہمانی کرو ( ہم مسافر ہیں ) تو تم نے انکار کر دیا تھا اس لیے میں بھی اس وقت تک نہیں جھاڑوں گا جب تک تم میرے لیے اس کی مزدوری نہ ٹھہرا دو ۔ چنانچہ ان لوگوں نے کچھ بکریوں ( 30 ) پر معاملہ کر لیا ۔ اب یہ صحابی روانہ ہوئے ۔ یہ زمین پر تھوکتے جاتے اور الحمدللہ رب العالمین پڑھتے جاتے اس کی برکت سے وہ ایسا ہو گیا جیسے اس کی رسی کھل گئی ہو اور وہ اس طرح چلنے لگا جیسے اسے کوئی تکلیف ہی نہ رہی ہو ۔ بیان کیا کہ پھر وعدہ کے مطابق قبیلہ والوں نے ان صحابی کی مزدوری ( 30 بکریاں ) ادا کر دی بعض لوگوں نے کہا کہ ان کو تقسیم کر لو لیکن جنہوں نے جھاڑا تھا انہوں نے کہا کہ ابھی نہیں ، پہلے ہم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوں پوری صورت حال آپ کے سامنے بیان کر دیں پھر دیکھیں آنحضرت صلی اللہ علیہ وسلم ہمیں کیا حکم فرماتے ہیں ۔ چنانچہ سب لوگ آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو آپ سے اس کا ذکر کیا آپ نے فرمایا کہ تمہیں کیسے معلوم ہو گیا تھا کہ اس سے دم کیا جا سکتا ہے ؟ تم نے اچھا کیا جاؤ ان کو تقسیم کر لو اور میرا بھی اپنے ساتھ ایک حصہ لگاؤ ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 149550,
        "last_updated": null
    },
    {
        "urduURN": 4056710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5750,
        "hadithSanad": "ہم سے عبداللہ بن ابی شیبہ نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے سفیان ثوری نے ، ان سے اعمش نے ، ان سے مسلم بن ابو الصبیح نے ، ان سے مسروق نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ( اپنے گھر کے ) بعض لوگوں پر دم کرتے وقت اپنا داہنا ہاتھ پھیر تے ( اور یہ دعا پڑھتے تھے ) ” تکلیف کو دور کر دے اے لوگوںکے رب ! اور شفاء دے ، تو ہی شفاء دینے والا ہے شفاء وہی ہے جو تیری طرف سے ہو ایسی شفاء کہ بیماری ذرا بھی باقی نہ رہ جائے ، ۔ “ ( سفیان نے کہا کہ پھر میں نے یہ منصور سے بیان کیا تو انہوں نے مجھ سے ابراہیم نخعی سے بیان کیا ، ان سے مسروق نے اور ان سے عائشہ رضی اللہ عنہا نے اس ہی کی طرح بیان کیا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 149560,
        "last_updated": null
    },
    {
        "urduURN": 4056720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5751,
        "hadithSanad": "ہم سے عبداللہ بن محمد جعفی نے بیان کیا ، کہا ہم سے ہشام بن یوسف صنعانی نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں عروہ نے اور انہیں حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم اپنے مرض وفات میں معوذات پڑھ کر پھونکتے تھے پھر جب آپ کے لیے یہ دشوار ہو گیا تو میں آپ پردم کیا کرتی تھی اور برکت کے لیے آنحضرت صلی اللہ علیہ وسلم کا ہاتھ آپ کے جسم پر پھیرتی تھی ( معمر نے بیان کیا کہ ) پھر میں نے ابن شہاب سے سوال کیا کہ آنحضرت صلی اللہ علیہ وسلم کس طرح دم کیا کرتے تھے ؟ انہوں نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم پہلے اپنے دونوں ہاتھوں پر پھونک مارتے پھر ان کو چہرے پر پھیر لیتے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 149570,
        "last_updated": null
    },
    {
        "urduURN": 4056730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5752,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے حصین بن نمیر نے بیان کیا ، ان سے حصین بن عبدالرحمٰن نے ، ان سے سعید بن جبیر نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم ایک دن ہمارے پاس باہر تشریف لائے اور فرمایا کہ ( خواب میں ) مجھ پر تمام امتیں پیش کی گئیں ۔ بعض نبی گزرتے اور ان کے ساتھ ( ان کی اتباع کرنے والا ) صرف ایک ہوتا ۔ بعض گزرتے اور ان کے ساتھ دو ہوتے بعض کے ساتھ پوری جماعت ہوتی اور بعض کے ساتھ کوئی بھی نہ ہوتا پھر میں نے ایک بڑی جماعت دیکھی جس سے آسمان کا کنارہ ڈھک گیا تھا میں سمجھا کہ یہ میری ہی امت ہو گی لیکن مجھ سے کہا گیا کہ یہ حضرت موسیٰ علیہ السلام اور ان کی امت کے لوگ ہیں پھر مجھ سے کہا کہ دیکھو میں نے ایک بہت بڑی جماعت دیکھی جس نے آسمانوں کا کنارہ ڈھانپ لیا ہے ۔ پھر مجھ سے کہا گیا کہ ادھر دیکھو ، ادھر دیکھو ، میں نے دیکھا کہ بہت سی جماعتیں ہیں جو تمام افق پر محیط تھیں ۔ کہا گیا کہ یہ تمہاری امت ہے اور اس میں سے ستر ہزار وہ لوگ ہوں گے جو بے حساب جنت میں داخل کئے جائیں گے پھر صحابہ مختلف جگہوں میں اٹھ کر چلے گئے اور آنحضرت صلی اللہ علیہ وسلم نے اس کی وضاحت نہیں کی کہ یہ ستر ہزار کون لوگ ہوں گے ۔ صحابہ کرام رضی اللہ عنہم نے آپس میں اس کے متعلق مذاکرہ کیا اور کہا کہ ہماری پیدائش تو شرک میں ہوئی تھی البتہ بعد میں ہم اللہ اور اس کے رسول پر ایمان لے آئے لیکن یہ ستر ہزار ہمارے بیٹے ہوں گے جو پیدائش ہی سے مسلمان ہیں ۔ جب رسول اللہ صلی اللہ علیہ وسلم کو یہ بات پہنچی تو آپ نے فرمایا کہ یہ ستر ہزار وہ لوگ ہوں گے جو بد فالی نہیں کرتے ، نہ منترسے جھاڑ پھونک کراتے ہیں اور نہ داغ لگاتے ہیں بلکہ اپنے رب پر بھروسہ کرتے ہیں ۔ یہ سن کر حضرت عکاشہ بن محصن رضی اللہ عنہ نے عرض کیا یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! کیا میں بھی ان میں سے ہوں ؟ فرمایا کہ ہاں ۔ ایک دوسرے صاحب حضرت سعد بن عبادہ رضی اللہ عنہ نے کھڑے ہو کر عرض کیا میں بھی ان میں سے ہوں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ عکاشہ تم سے بازی لے گئے کہ تم سے پہلے عکاشہ کے لیے جو ہونا تھا ہو چکا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 149580,
        "last_updated": null
    },
    {
        "urduURN": 4056740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5753,
        "hadithSanad": "مجھ سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے عثمان بن عمر نے ، کہا کہ ہم سے یونس بن یزید ایلی نے ، ان سے سالم نے بیان کیا اور ان سے حضرت ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا امراض میں چھوت چھات کی اور بد شگونی کی کوئی اصل نہیں اور اگر نحوست ہوتی تو یہ صرف تین چیزوں میں ہوتی ہے ۔ عورت میں ، گھر میں اورگھوڑے میں ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 149590,
        "last_updated": null
    },
    {
        "urduURN": 4056750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5754,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، کہا ہم کو عبیداللہ بن عبداللہ بن عتبہ نے خبر دی اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ بد شگونی کی کوئی اصل نہیں البتہ نیک فال لینا کچھ برا نہیں ہے ۔ صحابہ کرام رضی اللہ عنہم نے عرض کیا نیک فال کیا چیز ہے ؟ فرمایا کوئی ایسی بات سننا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 149600,
        "last_updated": null
    },
    {
        "urduURN": 4056760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5755,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، انہوں نے کہا ہم کو ہشام بن یوسف نے خبر دی ، انہوں نے کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں عبیداللہ بن عبداللہ بن عتبہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا بد شگونی کی کوئی اصل نہیں اور اس میں بہتر فال نیک ہے ۔ لوگوں نے پوچھا کہ نیک فال کیا ہے یا رسول اللہ ! فرمایا کلمہ صالحہ ( نیک بات ) جو تم میں سے کوئی سنے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 149610,
        "last_updated": null
    },
    {
        "urduURN": 4056770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5756,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے ہشام دستوائی نے بیان کیا ، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا چھوت لگ جانے کی کوئی اصل نہیں اور نہ بد شگونی کی کوئی اصل ہے اور مجھے اچھی فال پسند ہے یعنی کوئی کلمہ خیر اور نیک بات جو کسی کے منہ سے سنی جائے ( جیسا کہ اوپر بیان ہوا ) ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 149620,
        "last_updated": null
    },
    {
        "urduURN": 4056780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5757,
        "hadithSanad": "ہم سے محمد بن حکم نے بیان کیا ، انہوں نے کہا ہم سے نضر بن شمیل نے بیان کیا ، انہوں نے کہا ہم کو اسرائیل نے خبر دی ، انہوں نے کہا ہم کو ابو حصین ( عثمان بن عاصم اسدی ) نے خبر دی ، انہیں ابوصالح ذکوان نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا چھوت لگ جانا بد شگونی یا الو یا صفر کی نحوست یہ کوئی چیز نہیں ہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 149630,
        "last_updated": null
    },
    {
        "urduURN": 4056790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5758,
        "hadithSanad": "ہم سے سعید بن عفیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، کہا کہ مجھ سے عبدالرحمٰن بن خالد نے بیان کیا ، ان سے ابن شہاب نے ، ان سے ابوسلمہ بن عبدالرحمٰن بن عوف رضی اللہ عنہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "قبیلہ ہذیل کی دو عورتوں کے بارے میں جنہوں نے جھگڑا کیا تھا یہاں تک کہ ان میں سے ایک عورت ( ام عطیف بنت مروح ) نے دوسری کو پتھر پھینک کر مارا ( جس کا نام ملیکہ بنت عویمر تھا ) وہ پتھر عورت کے پیٹ میں جا کر لگا ۔ یہ عورت حاملہ تھی اس لیے اس کے پیٹ کا بچہ ( پتھر کی چوٹ سے ) مرگیا ۔ یہ معاملہ دونوں فریق نبی کریم صلی اللہ علیہ وسلم کے پاس لے گئے تو آپ نے فیصلہ کیا کہ عورت کے پیٹ کے بچہ کی دیت ایک غلام یا باندی آزاد کرنا ہے جس عورت پر تاوان واجب ہوا تھا اس کے ولی ( حمل بن مالک بن نابغہ ) نے کہا یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! میں ایسی چیز کی دیت کیسے دے دوں جس نے کھایا نہ پیا نہ بولا اور نہ ولادت کے وقت اس کی آواز ہی سنائی دی ؟ ایسی صورت میں تو کچھ بھی دیت نہیں ہو سکتی ۔ آپ نے اس پر فرمایا کہ یہ شخص تو کاہنوں کا بھائی معلوم ہوتا ہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 149640,
        "last_updated": null
    },
    {
        "urduURN": 4056800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5759,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، ان سے حضرت امام مالک نے ، ان سے ابن شہاب نے ، ان سے ابوسلمہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "دو عورتیں تھیں ۔ ایک نے دوسری کو پتھر دے مارا جس سے اس کے پیٹ کا حمل گر گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے اس معاملہ میں ایک غلام یا باندی کا دیت میں دیئے جانے کا فیصلہ کیا ۔ \n<span class=urdu_sanad>اور ابن شہاب نے بیان کیا ، ان سے حضرت سعید بن مسیب نے کہ</span> رسول اللہ صلی اللہ علیہ وسلم نے جنین جسے اس کی ماں کے پیٹ میں مار ڈالا گیا ہو ، کی دیت کے طور پر ایک غلام یا ایک باندی دیئے جانے کا فیصلہ کیا تھا جسے دیت دینی تھی اس نے کہا کہ ایسے بچہ کی دیت آخر کیوں دوں جس نے نہ کھایا ، نہ پیا ، نہ بولا اور نہ ولادت کے وقت ہی آوازنکالی ؟ ایسی صورت میں تو دیت نہیں ہو سکتی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ شخص تو کاہنوں کا بھائی معلوم ہوتا ہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 149651,
        "last_updated": null
    },
    {
        "urduURN": 4056820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5761,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے سفیان ابن عیینہ نے بیان کیا ، ان سے زہری نے ، ان سے ابوبکر بن عبدالرحمٰن بن حارث نے اور ان سے ابومسعود رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے کتے کی قیمت ، زنا کی اجرت اور کاہن کی کہا نت کی وجہ سے ملنے والے ہدیہ سے منع فرمایا ہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 149670,
        "last_updated": null
    },
    {
        "urduURN": 4056830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5762,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے ہشام بن یوسف نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں یحییٰ بن عروہ بن زبیر نے ، انہیں عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "کچھ لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے کاہنوں کے متعلق پوچھا آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس کی کوئی بنیاد نہیں ۔ لوگوں نے کہا کہ یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! بعض اوقات وہ ہمیں ایسی چیزیں بھی بتاتے ہیں جو صحیح ہو جاتی ہیں ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا کہ یہ کلمہ حق ہوتا ہے ۔ اسے کاہن کسی جنی سے سن لیتا ہے وہ جنی اپنے دوست کاہن کے کان میں ڈال جاتا ہے اور پھر یہ کاہن اس کے ساتھ سوجھوٹ ملا کر بیان کرتے ہیں ۔ علی بن عبداللہ مدینی نے بیان کیا کہ عبدالرزاق اس کلمہ تلک الکلمۃ من الحق کو مرسلاً روایت کرتے تھے پھر انہوں نے کہا مجھ کو یہ خبر پہنچی کہ عبدالرزاق اس کے بعد اس کو مسنداً حضرت عائشہ رضی اللہ عنہا سے روایت کیا ہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 149680,
        "last_updated": null
    },
    {
        "urduURN": 4056840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5763,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ اشعری نے بیان کیا ، کہا ہم کو عیسیٰ بن یونس نے خبر دی ، انہیں ہشام بن عروہ نے ، انہیں ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "بنی زریق کے ایک شخص یہودی لبید بن اعصم نے رسول اللہ صلی اللہ علیہ وسلم پر جادو کر دیا تھا اور اس کی وجہ سے آنحضرت صلی اللہ علیہ وسلم کسی چیز کے متعلق خیال کرتے کہ آپ نے وہ کام کر لیا ہے حالانکہ آپ نے وہ کام نہ کیا ہوتا ۔ ایک دن یا ( راوی نے بیان کیا کہ ) ایک رات آنحضرت صلی اللہ علیہ وسلم میرے یہاں تشریف رکھتے تھے اورمسلسل دعا کر رہے تھے پھر آپ نے فرمایا عائشہ ! تمہیں معلوم ہے اللہ سے جو بات میں پوچھ رہا تھا ، اس نے اس کا جواب مجھے دے دیا ۔ میرے پاس دو ( فرشتے حضرت جبرائیل وحضرت میکائیل علیہما السلام ) آئے ۔ ایک میرے سر کی طرف کھڑا ہو گیا اور دوسرا میرے پاؤں کی طرف ۔ ایک نے اپنے دوسرے ساتھی سے پوچھا ان صاحب کی بیماری کیا ہے ؟ دوسرے نے کہا کہ ان پر جادو ہوا ہے ۔ اسنے پوچھا کس نے جادو کیا ہے ؟ جواب دیا کہ لبید بن اعصم نے ۔ پوچھا کس چیز میں ؟ جواب دیا کہ کنگھے اور سر کے بال میں جو نر کھجور کے خوشے میں رکھے ہوئے ہیں ۔ سوال کیا اور یہ جادو ہے کہاں ؟ جواب دیا کہ زر وان کے کنویں میں ۔ پھر آنحضرت صلی اللہ علیہ وسلم اس کنویں پر اپنے چند صحابہ کے ساتھ تشریف لے گئے اور جب واپس آئے تو فرمایا عائشہ ! اس کا پانی ایسا ( سرخ ) تھا جیسے مہندی کا نچوڑ ہوتا ہے اور اس کے کھجور کے درختوں کے سر ( اوپر کا حصہ ) شیطان کے سروں کی طرح تھے میں نے عرض کیا یا رسول اللہ صلی اللہ علیہ وسلم آپ نے اس جادو کو باہر کیوں نہیں کر دیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ نے مجھے اس سے عافیت دے دی اس لیے میں نے مناسب نہیں سمجھا کہ اب میں خواہ مخواہ لوگوں میں اس برائی کو پھیلاؤ ں پھر آنحضرت صلی اللہ علیہ وسلم نے اس جادو کا سامان کنگھی بال خرما کا غلاف ہوتے ہیں اسی میں دفن کرا دیا ۔ عیسیٰ بن یونس کے ساتھ اس حدیث کو ابواسامہ اور ابو ضمرہ ( انس بن عیاض ) اورابن ابی الزناد تینوں نے ہشام سے یوں روایت کیا اور لیث بن مسور اور سفیان بن عیینہ نے ہشام سے یوں روایت کیا ہے ۔ ” فی مشط ومشاقۃ مشاطۃ “ اسے کہتے ہیں جوبال کنگھی کرنے میں نکلیں سر یا داڑھی کے اور مشاقہ روئی کے تار یعنی سوت کے تار کو کہتے ہیں ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 149690,
        "last_updated": null
    },
    {
        "urduURN": 4056850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5764,
        "hadithSanad": "مجھ سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا ، کہا مجھ سے سلیمان بن بلال نے بیان کیا ، ان سے ثور بن زید نے ، ان سے ابو الغیث نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تباہ کر دینے والی چیز اللہ کے ساتھ شرک کرنا ہے اس سے بچو اور جادو کرنے کرانے سے بھی بچو ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 149700,
        "last_updated": null
    },
    {
        "urduURN": 4056860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5765,
        "hadithSanad": "مجھ سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا کہ میں نے سفیان بن عیینہ سے سنا ، کہا کہ سب سے پہلے یہ حدیث ہم سے ابن جریج نے بیان کی ، وہ بیان کرتے تھے کہ",
        "hadithText": "مجھ سے یہ حدیث آل عروہ نے عروہ سے بیان کی ، اس لیے میں نے ( عروہ کے بیٹے ) ہشام سے اس کے بارے میں پوچھا تو انہوں نے ہم سے اپنے والد ( عروہ ) سے بیان کیا کہ ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم پر جادو کر دیا گیا تھا اور اس کا آپ پر یہ اثر ہوا تھاآپ کو خیال ہوتا کہ آپ نے ازواج مطہرات میں سے کسی کے ساتھ ہمبستری کی ہے حالانکہ آپ نے کی نہیں ہوتی ۔ سفیان ثوری نے بیان کیا کہ جادو کی یہ سب سے سخت قسم ہے جب اس کا یہ اثر ہو پھر آپ نے فرمایا عائشہ ! تمہیں معلوم ہے اللہ تعالیٰ سے جو بات میں نے پوچھی تھی اس کا جواب اس نے کب کا دے دیا ہے ۔ میرے پاس دو فرشتے آئے ایک میرے سر کے پاس کھڑا ہو گیا اور دوسرا میرے پاؤں کے پاس ۔ جو فرشتہ میرے سر کی طرف کھڑا تھا اس نے دوسرے سے کہا ان صاحب کا کیا حال ہے ؟ دوسرے نے جواب دیا کہ ان پر جادو کر دیا گیا ہے ۔ پوچھا کہ کس نے ان پر جادو کیا ہے ؟ جواب دیا کہ لبید بن اعصم نے یہ یہودیوں کے حلیف بنی زریق کا ایک شخص تھا اور منافق تھا ۔ سوال کیا کہ کس چیز میں ان پر جادو کیا ہے ؟ جواب دیا کہ کنگھے اور بال میں ۔ پوچھا جادو ہے کہاں ؟ جواب دیا کہ نر کھجور کے خوشے میں جو زروان کے کنویں کے اندررکھے ہوئے پتھر کے نیچے دفن ہے ۔ بیان کیا کہ پھر حضور اکرم صلی اللہ علیہ وسلم اس کنویں پر تشریف لے گئے اور جادو اندر سے نکالا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہی وہ کنواں ہے جو مجھے خواب میں دکھایا گیا تھا اس کا پانی مہندی کے عرق جیسا رنگین تھا اور اس کے کھجور کے درختوں کے سر شیطانوں کے سروں جیسے تھے ۔ بیان کیا کہ پھر وہ جادو کنویں میں سے نکالا گیا عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نے کہا آپ نے اس جادو کا توڑ کیوں نہیں کرایا ۔ فرمایا ہاں اللہ تعالیٰ نے مجھے شفادی اب میں لوگوں میں ایک شور ہونا پسند نہیں کرتا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 149710,
        "last_updated": null
    },
    {
        "urduURN": 4056870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5766,
        "hadithSanad": "ہم سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم پر جادو کر دیا گیا تھا اور اس کا اثر یہ تھا کہ آپ کو خیال ہوتا کہ آپ کوئی چیز کر چکے ہیں حالانکہ وہ چیز نہ کی ہوتی ایک دن آنحضرت صلی اللہ علیہ وسلم میرے یہاں تشریف رکھتے تھے اورمسلسل دعائیں کر رہے تھے پھر فرمایا عائشہ ! تمہیں معلوم ہے اللہ تعالیٰ سے جو بات میں نے پوچھی تھی اس کا جواب اس نے مجھے دے دیا ہے ۔ میں نے عرض کی وہ کیا بات ہے یا رسول اللہ ! آپ نے فرمایا میرے پاس دو فرشتے ( حضرت جبرائیل و حضرت میکائیل علیہما السلام ) آئے اور ایک میرے سر کے پاس کھڑا ہو گیا اور دوسرا پاؤں کی طرف پھر ایک نے اپنے دوسرے ساتھی سے کہا ان صاحب کی تکلیف کیا ہے ؟ دوسرے نے جواب دیا کہ ان پر جادو کیا گیا ہے ۔ پوچھا کس نے ان پر جادو کیا ہے ؟ فرمایا بنی زریق کے لبید بن اعصم یہودی نے ، پوچھا کس چیز میں ؟ جواب دیا کہ کنگھے اور بال میں جو نر کھجور کے خوشے میں رکھا ہوا ہے ۔ پوچھا اور وہ جادو رکھا کہاں ہے ؟ جواب دیا کہ ذروان کے کنویں میں ۔ بیان کیا کہ پھر حضور اکرم صلی اللہ علیہ وسلم اپنے چند صحابہ کے ساتھ اس کنویں پر تشریف لے گئے اور اسے دیکھاوہاں کھجور کے درخت بھی تھے پھر آپ واپس حضرت عائشہ رضی اللہ عنہا کے یہاں تشریف لائے اور فرمایا اللہ کی قسم اس کا پانی مہندی کے عرق جیسا ( سرخ ) ہے اور اس کے کھجور کے درخت شیاطین کے سروں جیسے ہیں ۔ میں نے عرض کیا یا رسول اللہ ! وہ کنگھی بال وغیرہ غلاف سے نکلوائے یا نہیں ۔ آپ نے فرمایا نہیں ، سن لے اللہ نے تو مجھ کو شفاء دے دی ، تندرست کر دیا اب میں ڈرا کہیں لوگوں میں ایک شور نہ پھیلے اور آنحضرت صلی اللہ علیہ وسلم نے اس سامان کے گاڑ دینے کا حکم دیا وہ گاڑ دیا گیا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 149720,
        "last_updated": null
    },
    {
        "urduURN": 4056880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5767,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا کہ ہم کو امام مالک نے خبر دی ، انہیں زید بن اسلم نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "دو آدمی پورب کی طرف ( ملک عراق ) سے ( سنہ 9ھ میں ) مدینہ آئے اور لوگوں کو خطاب کیا لوگ ان کی تقریر سے بہت متاثر ہوئے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ بعض تقریریں بھی جادو بھری ہوتی ہیں یا یہ فرمایا کہ بعض تقریر جادو ہوتی ہیں ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 149730,
        "last_updated": null
    },
    {
        "urduURN": 4056890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5768,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے مروان بن معاویہ فزاری نے بیان کیا ، کہا ہم کو ہاشم بن ہاشم بن عقبہ نے خبر دی ، کہا ہم کو عامر بن سعد نے خبر دی اور ان سے ان کے والد ( سعد بن ابی وقاص رضی اللہ عنہ ) نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو شخص روزانہ چند عجوہ کھجوریں کھا لیا کرے اسے اس دن رات تک زہر اور جادو نقصان نہیں پہنچا سکیں گے ۔ علی بن عبداللہ مدینی کے سوا دوسرے راوی نے بیان کیا کہ ” سات کھجوریں “ کھا لیا کرے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 149740,
        "last_updated": null
    },
    {
        "urduURN": 4056900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5769,
        "hadithSanad": "ہم سے اسحاق بن منصور نے بیان کیا ، انہوں نے کہا ہم کو ابواسامہ حماد بن اسامہ نے خبر دی ، انہوں نے کہا ہم سے ہاشم بن ہاشم نے بیان کیاکہ",
        "hadithText": "میں نے عامر بن سعد سے سنا ، انہوں نے حضرت سعد بن ابی وقاص رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا آپ نے فرمایا کہ جس شخص نے صبح کے وقت سات عجوہ کھجوریں کھالیں اس دن اسے نہ زہر نقصان پہنچا سکتا ہے اور نہ جادو ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 149750,
        "last_updated": null
    },
    {
        "urduURN": 4056910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5770,
        "hadithSanad": "مجھ سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے ہشام بن یوسف نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں ابوسلمہ بن عبدالرحمٰن بن عوف نے ، ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا چھوت لگ جانا ، صفر کی نحوست اور الو کی نحوست کوئی چیز نہیں ۔ ایک دیہاتی نے کہا کہ یا رسول اللہ ! پھر اس اونٹ کے متعلق کیا کہا جائے گا جو ریگستان میں ہرن کی طرح صاف چمکدار ہوتا ہے لیکن خارش والا اونٹ اسے مل جاتا ہے اور اسے بھی خارش لگا دیتا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا لیکن پہلے اونٹ کو کس نے خارش لگائی تھی ؟</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 149760,
        "last_updated": null
    },
    {
        "urduURN": 4056920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5771,
        "hadithSanad": "اور ابوسلمہ سے روایت ہے انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا کہ انہوں نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کوئی شخص اپنے بیمار اونٹوں کو کسی کے صحت مند اونٹوں میں نہ لے جائے ۔ حضرت ابوہریرہ رضی اللہ عنہ نے پہلی حدیث کا انکار کیا ۔ ہم نے ( حضرت ابوہریرہ رضی اللہ عنہ سے ) عرض کیا کہ آپ ہی نے ہم سے یہ حدیث نہیں بیان کی ہے کہ چھوت یہ نہیں ہوتا پھر وہ ( غصہ میں ) حبشی زبان بولنے لگے ابوسلمہ بن عبدالرحمٰن نے بیان کیا کہ اس حدیث کے سوا میں نے حضرت ابوہریرہ رضی اللہ عنہ کو اور کوئی حدیث بھولتے نہیں دیکھا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 149770,
        "last_updated": null
    },
    {
        "urduURN": 4056930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5772,
        "hadithSanad": "ہم سے سعید بن عفیر نے بیان کیا ، انہوں نے کہا کہ مجھ سے عبداللہ بن وہب نے بیان کیا ، ان سے یونس بن یزید نے ، ان سے ابن شہاب نے کہا کہ",
        "hadithText": "مجھے سالم بن عبداللہ اور حمزہ نے خبر دی اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا چھوت لگ جانے کی کوئی حقیقت نہیں ہے بد شگونی کی کوئی اصل نہیں ۔ ( اگر ممکن ہوتی تو ) نحوست تین چیزوں میں ہوتی ۔ گھوڑے میں عورت میں اور گھر میں ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 149780,
        "last_updated": null
    },
    {
        "urduURN": 4056940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5773,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، کہا کہ مجھ سے ابوسلمہ بن عبدالرحمٰن بن عوف نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا چھوت کی کوئی حقیقت نہیں ۔ \n<span class=urdu_sanad>ابوسلمہ بن عبدالرحمٰن نے بیان کیا کہ میں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ</span> مریض اونٹوں والا اپنے اونٹ تندرست اونٹوں والے کے اونٹ میں نہ چھوڑے ۔ \n<span class=urdu_sanad>اور زہری سے روایت ہے ، انہوں نے بیان کیا کہ مجھے سنان بن ابی سنان دؤلی نے خبر دی اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ</span> رسول اللہ صلی اللہ علیہ وسلم نے فرمایا چھوت کوئی چیز نہیں ہے ۔ اس پر ایک دیہاتی نے کھڑے ہو کر پوچھا آپ نے دیکھا ہو گا کہ ایک اونٹ ریگستان میں ہرن جیسا صاف رہتا ہے لیکن جب وہی ایک خارش والے اونٹ کے پاس آ جاتا ہے تو اسے بھی خارش ہو جاتی ہے آنحضرت صلی اللہ علیہ وسلم نے فرمایا لیکن پہلے اونٹ کو کس نے خارش لگائی تھی ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 149792,
        "last_updated": null
    },
    {
        "urduURN": 4056970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5776,
        "hadithSanad": "مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے ابن جعفر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، کہا کہ میں نے قتادہ سے سنا اور انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا چھوت لگنا کوئی چیز نہیں ہے اور بد شگونی نہیں ہے البتہ نیک فال مجھے پسند ہے ۔ صحابی نے عرض کیا نیک فال کیا ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اچھی بات منہ سے نکالنا یا کسی سے سن لینا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 149820,
        "last_updated": null
    },
    {
        "urduURN": 4056980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5777,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث بن سعد نے ، ان سے سعید بن ابی سعید نے اور ان سے ابوہریرہ رضی اللہ عنہ نے ، انہوں نے بیان کیا کہ",
        "hadithText": "جب خیبر فتح ہوا تو رسول اللہ صلی اللہ علیہ وسلم کو ایک بکری ہدیہ میں پیش کی گئی ( ایک یہودی عورت زینب بنت حرث نے پیش کی تھی ) جس میں زہر بھرا ہوا تھا ، اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہاں پر جتنے یہودی ہیں انہیں میرے پاس جمع کرو ۔ چنانچہ سب آنحضرت صلی اللہ علیہ وسلم کے پاس جمع کئے گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں تم سے ایک بات پوچھو ں گا کیا تم مجھے صحیح صحیح بات بتا دو گے ؟ انہوں نے کہا کہ ہاں اے ابوالقاسم ! پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا تمہارا پردادا کون ہے ؟ انہوں نے کہا کہ فلاں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم جھوٹ کہتے ہو تمہارا پردادا تو فلاں ہے ۔ اس پر وہ بولے کہ آپ نے سچ فرمایا درست فرمایا پھر آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کیا اگر میں تم سے کوئی بات پوچھوں گا تو تم مجھے سچ سچ بتا دوگے ؟ انہوں نے کہا کہ ہاں اے ابوالقاسم ! اور اگر ہم جھوٹ بولیں بھی تو آپ ہمارا جھوٹ پکڑ لیں گے جیسا کہ ابھی ہمارے پردادا کے متعلق آپ نے ہمارا جھوٹ پکڑ لیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا دوزخ والے کون لوگ ہیں ؟ انہوں نے کہا کہ کچھ دن کے لیے تو ہم اس میں رہیں گے پھر آپ لوگ ہماری جگہ لے لیں گے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا تم اس میں ذلت کے ساتھ پڑے رہو گے ، واللہ ! ہم اس میں تمہاری جگہ کبھی نہیں لیں گے ۔ آپ نے پھر ان سے دریافت فرمایا کیا اگر میں تم سے ایک بات پوچھوں تو تم مجھے اس کے متعلق صحیح صحیح بتا دو گے ؟ انہوں نے کہا کہ ہاں ؟ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا کیا تم نے اس بکری میں زہر ملایا تھا ، انہوں نے کہا کہ ہاں ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تمہیں اس کام پر کس جذبہ نے آمادہ کیا تھا ؟ انہوں نے کہا کہ ہمارا مقصد یہ تھا کہ اگر آپ جھوٹے ہوں گے تو ہمیں آپ سے نجات مل جائے گی اور اگرسچے ہوں گے تو آپ کو نقصان نہیں پہنچا سکے گا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 149830,
        "last_updated": null
    },
    {
        "urduURN": 4056990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5778,
        "hadithSanad": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ، انہوں نے کہا ہم سے خالد بن حارث نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے سلیمان نے بیان کیا ، انہوں نے کہا کہ",
        "hadithText": "میں نے ذکوان سے سنا ، وہ حضرت ابوہریرہ رضی اللہ عنہ سے یہ حدیث بیان کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے پہاڑ سے اپنے آپ کو گرا کر خودکشی کر لی وہ جہنم کی آگ میں ہو گا اور اس میں ہمیشہ پڑا رہے گا اور جس نے زہر پی کر خودکشی کر لی وہ زہر اس کے ساتھ میں ہو گا اور جہنم کی آگ میں وہ اسے اسی طرح ہمیشہ پیتا رہے گا اور جس نے لوہے کے کسی ہتھیار سے خودکشی کر لی تو اس کا ہتھیار اس کے ساتھ میں ہو گا اور جہنم کی آگ میں ہمیشہ کے لیے وہ اسے اپنے پیٹ میں مارتا رہے گا ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 149840,
        "last_updated": null
    },
    {
        "urduURN": 4057000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5779,
        "hadithSanad": "ہم سے محمد بن سلام بیکندی نے بیان کیا ، انہوں نے کہا ہم کو احمد بن بشیر ابوبکرنے خبر دی ، انہوں نے کہا ہم کو ہاشم بن ہاشم نے خبر دی ، کہا کہ مجھے عامر بن سعد نے خبر دی ، انہوں نے کہا کہ میں نے اپنے والد سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص صبح کے وقت سات عجوہ کھجوریں کھا لے اسے اس دن زہر نقصان پہنچا سکے گا اور نہ جادو ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 149850,
        "last_updated": null
    },
    {
        "urduURN": 4057010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5780,
        "hadithSanad": "مجھ سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے زہری نے ، ان سے ابو ادریس خولانی نے اور ان سے ابو ثعلبہ خشنی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ہر دانت سے کھانے والے درندہ جانور ( کے گوشت ) سے منع فرمایا ۔ زہری نے بیان کیا کہ میں نے یہ حدیث اس وقت تک نہیں سنی جب تک شام نہیں آیا ۔ \n<span class=urdu_sanad>اور لیث نے زیادہ کیا ہے کہا کہ مجھ سے یونس نے بیان کیا ، ان سے ابن شہاب زہری نے ، کہ</span> میں نے ابو ادریس سے پوچھا کیا ہم ( دواکے طور پر ) گدھی کے دودھ سے وضو کر سکتے ہیں یا اسے پی سکتے ہیں یا درندہ جانوروں کے پتے استعمال کر سکتے ہیں یا اونٹ کا پیشاب پی سکتے ہیں ۔ ابو ادریس نے کہا کہ مسلمان اونٹ کے پیشاب کو دوا کے طور پر استعمال کرتے تھے اور اس میں کوئی حرج نہیں سمجھتے تھے ۔ البتہ گدھی کے دودھ کے بارے میں ہمیں رسول اللہ صلی اللہ علیہ وسلم کی یہ حدیث پہنچی ہے کہ آنحضرت صلی اللہ علیہ وسلم نے اس کے گوشت سے منع فرمایا تھا ۔ اس کے دودھ کے متعلق ہمیں کوئی حکم یا ممانعت آنحضرت صلی اللہ علیہ وسلم سے معلوم نہیں ہے ۔ البتہ درندوں کے پتے کے متعلق جو ابن شہاب نے بیان کیا کہ مجھے ابو ادریس خولانی نے خبر دی اور انہیں ابو ثعلبہ خشنی رضی اللہ عنہ نے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے ہر دانت والے شکاری درندے کا گوشت کھانے سے منع فرمایا ہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 149861,
        "last_updated": null
    },
    {
        "urduURN": 4057030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 76,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5782,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، انہوں نے کہا ہم سے بنی تمیم کے مولیٰ عتبہ بن مسلم نے بیان کیا ، ان سے بنی زریق کے مولیٰ عبید بن حنین نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب مکھی تم میں سے کسی کے برتن میں پڑ جائے تو پوری مکھی کو برتن میں ڈبو دے اور پھر اسے نکال کر پھینک دے کیونکہ اس کے ایک پر میں شفاء ہے اور دوسرے میں بیماری ہے ۔</b>",
        "bookID": "76.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 149880,
        "last_updated": null
    }
]