[
    {
        "urduURN": 4057040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5783,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا مجھ سے امام مالک نے ، انہوں نے نافع اور عبداللہ بن دینار اور زید بن اسلم سے ، انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ اس کی طرف قیامت کے دن نظر رحمت نہیں کرے گا جو اپنا کپڑا تکبر و غرور سے زمین پر گھسیٹ کر چلتا ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 149890,
        "last_updated": null
    },
    {
        "urduURN": 4057050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5784,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، کہا ہم سے زہیر نے بیان کیا ، کہا ہم سے موسیٰ بن عقبہ نے ، ان سے سالم بن عبداللہ نے اور ان سے ان کے والد نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو شخص تکبر کی وجہ سے تہبند گھسیٹتا ہوا چلے گا تو اللہ پاک اس کی طرف قیامت کے دن نظر بھی نہیں کرے گا ۔ حضرت ابوبکر رضی اللہ عنہ نے عرض کیا یا رسول اللہ ! میرے تہمد کا ایک حصہ کبھی لٹک جاتا ہے مگر یہ کہ خاص طورسے اس کا خیال رکھا کروں ؟ آپ نے فرمایا تم ان لوگوں میں سے نہیں ہو جو ایسا تکبر سے کرتے ہیں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 149900,
        "last_updated": null
    },
    {
        "urduURN": 4057060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5785,
        "hadithSanad": "مجھ سے بیکندی محمد بن سلام نے بیان کیا ، کہا ہم کو عبدالاعلیٰ نے خبر دی ، انہیں یونس نے ، انہیں امام حسن بصری نے اور ان سے ابوبکرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "سورج گرہن ہوا تو ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھے ۔ آپ جلدی میں کپڑا گھسیٹتے ہوئے مسجد میں تشریف لائے لوگ بھی جمع ہو گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے دو رکعت نماز پڑھائی ، گرہن ختم ہو گیا ، تب آپ ہماری طرف متوجہ ہوئے اور فرمایا سورج اور چاند اللہ کی نشانیوں میں سے دو نشانیاں ہیں اس لیے جب تم ان نشانیوں میں سے کوئی نشانی دیکھو تو نماز پڑھو اور اللہ سے دعا کرو یہاں تک کہ وہ ختم ہو جائے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 149910,
        "last_updated": null
    },
    {
        "urduURN": 4057070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5786,
        "hadithSanad": "مجھ سے اسحاق بن راہویہ نے بیان کیا ، کہا ہم کو ابن شمیل نے خبر دی ، کہا ہم کو عمر بن ابی زائدہ نے خبر دی ، کہا ہم کو عون بن ابی جحیفہ نے خبر دی ، ان سے ان کے والد ابو جحیفہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "پھر میں نے دیکھا کہ حضرت بلال رضی اللہ عنہ ایک نیزہ لے کر آئے اور اسے زمین میں گاڑ دیا پھر نماز کے لیے تکبیر کہی گئی ۔ میں نے دیکھا کہ رسول کریم صلی اللہ علیہ وسلم ایک جوڑا پہنے ہوئے باہر تشریف لائے جسے آپ نے سمیٹ رکھا تھا ۔ پھر آپ نے نیزہ کے سامنے کھڑے ہو کر دو رکعت نمازعید پڑھائی اور میں نے دیکھا کہ انسان اور جانور آنحضرت صلی اللہ علیہ وسلم کے سامنے نیزہ کے باہر کی طرف سے گزر رہے تھے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 149920,
        "last_updated": null
    },
    {
        "urduURN": 4057080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5787,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، انہوں نے کہا ہم سے سعید بن ابی سعید مقبری نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا تہبند کا جو حصہ ٹخنوں سے نیچے لٹکا ہو وہ جہنم میں ہو گا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 149930,
        "last_updated": null
    },
    {
        "urduURN": 4057090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5788,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں ابوالزناد نے ، انہیں اعرج نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو شخص اپنا تہمد غرور کی وجہ سے گھسیٹتا ہے ، اللہ تعالیٰ قیامت کے دن اس کی طرف دیکھے گا نہیں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 149940,
        "last_updated": null
    },
    {
        "urduURN": 4057100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5789,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے محمد بن زیاد نے بیان کیا ، کہا کہ میں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی یا ( یہ بیان کیا کہ ) ابوالقاسم صلی اللہ علیہ وسلم نے فرمایا ( بنی اسرائیل میں ) ایک شخص ایک جوڑا پہن کر کبر وغرور میں سر مست سرکے بالوں میں کنگھی کئے ہوئے اکڑ کر اتراتا جا رہا تھا کہ اللہ تعالیٰ نے اسے زمین میں دھنسا دیا اب وہ قیامت تک اس میں تڑپتا رہے گا یا دھنستا رہے گا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 149950,
        "last_updated": null
    },
    {
        "urduURN": 4057110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5790,
        "hadithSanad": "ہم سے سعید بن عفیر نے بیان کیا ، کہا کہ مجھ سے لیث بن سعد نے بیان کیا ، کہا کہ مجھ سے عبدالرحمٰن بن خالد نے بیان کیا ، ان سے ابن شہاب نے ، ان سے سالم بن عبداللہ نے اور ان سے ان کے والد نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ایک شخص غرور میں اپنا تہمد گھسیٹتا ہوا چل رہا تھا کہ اسے زمین میں دھنسا دیا گیا اور وہ اسی طرح قیامت تک زمین میں دھنستا ہی رہے گا ۔ اس کی متابعت یونس نے زہری سے کی ہے ۔ انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے ، اسے مرفوعاً نہیں بیان کیا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 149961,
        "last_updated": null
    },
    {
        "urduURN": 4057120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5791,
        "hadithSanad": "ہم سے مطر بن فضل نے بیان کیا ، کہا ہم سے شبابہ نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہاکہ",
        "hadithText": "میں نے محارب بن دثار قاضی سے ملاقات کی ، وہ گھوڑے پر سوار تھے اورمکان عدالت میں آ رہے تھے جس میں وہ فیصلہ کیا کرتے تھے ۔ میں نے ان سے یہی حدیث پوچھی تو انہوں نے مجھ سے بیان کیا ، کہا کہ میں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو آپ اپنا کپڑا غرور کی وجہ سے گھسیٹتا ہوا چلے گا ، قیامت کے دن اس کی طرف اللہ تعالیٰ نظر نہیں کرے گا ۔ ( شعبہ نے کہا کہ ) میں نے محارب سے پوچھا کیا حضرت ابن عمر رضی اللہ عنہما نے تہمد کا ذکر کیا تھا ؟ انہوں نے فرمایا کہ تہمد یاقمیص کسی کی انہوں نے تخصیص نہیں کی تھی ۔ محارب کے ساتھ اس حدیث کو جبلہ بن سحیم اورزید بن اسلم اور زید بن عبداللہ نے بھی حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت کیا ، انہوں نے آنحضرت صلی اللہ علیہ وسلم سے ۔ اورلیث نے نافع سے ، انہوں نے ابن عمر رضی اللہ عنہما سے ایسی ہی روایت کی اورنافع کے ساتھ اس کو موسیٰ بن عقبہ اورعمر بن محمد اور قدامہ بن موسیٰ نے بھی سالم سے ، انہوں نے ابن عمر رضی اللہ عنہما سے ، انہوں نے آنحضرت صلی اللہ علیہ وسلم سے روایت کی اس میں یوں ہے کہ جو شخص اپناکپڑا ( ازراہ تکبر ) لٹکائے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 149980,
        "last_updated": null
    },
    {
        "urduURN": 4057130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5792,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے کہا کہ مجھ کو عروہ بن زبیر اور انہیں",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ رفاعہ قرظی رضی اللہ عنہ کی بیوی رسول اللہ صلی اللہ علیہ وسلم کے پاس آئیں ۔ میں بھی بیٹھی ہوئی تھی اور آنحضرت صلی اللہ علیہ وسلم کے پاس حضرت ابوبکر رضی اللہ عنہ موجود تھے ۔ انہوں نے کہا یا رسول اللہ ! میں رفاعہ کے نکاح میں تھی لیکن انہوں نے مجھے تین طلاق دے دی ہیں ۔ ( مغلظہ ) اس کے بعد میں نے عبدالرحمٰن بن زبیر رضی اللہ عنہ سے نکاح کر لیا اور اللہ کی قسم کہ ان کے ساتھ یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! صرف اس جھالر جیسا ہے ۔ انہوں نے اپنی چادر کے جھالر کو اپنے ہاتھ میں لے کر اشارہ کیا ۔ حضرت خالد بن سعید رضی اللہ عنہ جو دروازے پر کھڑے تھے اور انہیں ابھی اندر آنے کی اجازت نہیں ہوئی تھی ، اس نے بھی ان کی بات سنی ۔ بیان کیا کہ حضرت خالد رضی اللہ عنہ ( وہیں سے ) بولے ۔ ابوبکر ! آپ اس عورت کو روکتے نہیں کہ کس طرح کی بات رسول اللہ صلی اللہ علیہ وسلم کے سامنے کھول کر بیان کرتی ہے لیکن اللہ کی قسم اس بات پر حضور اکرم صلی اللہ علیہ وسلم کا تبسم اور بڑھ گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا غالباً تم دوبارہ رفاعہ کے پاس جانا چاہتی ہو ؟ لیکن ایسا اس وقت تک ممکن نہیں جب تک وہ ( تمہارے دوسرے شوہر عبدالرحمٰن بن زبیر رضی اللہ عنہ ) تمہارا مزا نہ چکھ لیں اور تم ان کا مزا نہ چکھ لو پھر بعد میں یہی قانون بن گیا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 149990,
        "last_updated": null
    },
    {
        "urduURN": 4057140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5793,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو یونس نے ، انہیں زہری نے ، انہیں علی بن حسین نے خبر دی ، انہیں حسین بن علی رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "علی رضی اللہ عنہ نے بیان کیا ( کہ حمزہ رضی اللہ عنہ نے حرمت شراب سے پہلے شراب کے نشہ میں جب ان کی اونٹنی ذبح کر دی اور انہوں نے آنحضرت صلی اللہ علیہ وسلم سے آ کر اس کی شکایت کی تو ) آنحضرت صلی اللہ علیہ وسلم نے اپنی چادر منگوائی اور اسے اوڑھ کر تشریف لے چلنے لگے ۔ میں اور زید بن حارثہ رضی اللہ عنہ آپ کے پیچھے پیچھے تھے ۔ آخر آپ اس گھر میں پہنچے جس میں حمزہ رضی اللہ عنہ تھے ، آپ نے اندر آنے کی اجازت مانگی اور انہوں نے آپ حضرات کو اجازت دی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 150000,
        "last_updated": null
    },
    {
        "urduURN": 4057150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5794,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے حماد بن سلمہ نے بیان کیا ، ان سے ایوب سختیانی نے بیان کیا ، ان سے نافع نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "ایک صاحب نے عرض کیا یا رسول اللہ ! محرم کس طرح کا کپڑا پہنے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ محرم قمیص ، پاجامہ ، برنس ( ٹوپی یا سر پر پہننے کی کوئی چیز ) اور موزے نہیں پہنے گا البتہ اگراسے چپل نہ ملیں تو موزوں ہی کو ٹخنوں تک کاٹ کر پہن لے ۔ وہ ہی جوتی کی طرح ہو جائیں گے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 150010,
        "last_updated": null
    },
    {
        "urduURN": 4057160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5795,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم کو ابن عیینہ نے خبر دی ، انہیں عمرو نے اور انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم عبداللہ بن ابی ( منافق ) کے پاس جب اسے قبر میں داخل کیا جا چکا تھا تشریف لائے پھر آپ کے حکم سے اس کی لاش نکالی گئی اور حضور اکرم صلی اللہ علیہ وسلم کے گھٹنوں پر اسے رکھا گیا آنحضرت صلی اللہ علیہ وسلم نے اس پر دم کرتے ہوئے اپنی قمیص پہنائی اور اللہ ہی خوب جاننے والا ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 150020,
        "last_updated": null
    },
    {
        "urduURN": 4057170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5796,
        "hadithSanad": "ہم سے صدقہ بن فضل نے بیان کیا ، کہا ہم کو یحییٰ بن سعید نے خبر دی ، ان سے عبیداللہ نے بیان کیا ، کہا مجھ کو نافع نے خبر دی ، ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "جب عبداللہ بن ابی کی وفات ہوئی تو اس کے لڑکے ( حضرت عبداللہ ) جو مخلص اور اکابر صحابہ میں تھے رسول اللہ صلی اللہ علیہ وسلم ! کی خدمت میں حاضر ہوئے اور عرض کیا یا رسول اللہ ! اپنی قمیص مجھے عطا فرمایئے تاکہ میں اپنے باپ کو اس کا کفن دوں اور آپ ان کی نماز جنازہ پڑھا دیں اور ان کے لیے دعائے مغفرت کریں چنانچہ آنحضرت صلی اللہ علیہ وسلم نے اپنی قمیص انہیں عطا فرمائی اور فرمایا کہ نہلادھلا کر مجھے اطلاع دینا ۔ چنانچہ جب نہلادھلا لیا تو آنحضرت صلی اللہ علیہ وسلم کواطلاع دی آنحضور صلی اللہ علیہ وسلم تشریف لائے تاکہ اس کی نماز جنازہ پڑھائیں لیکن حضرت عمر رضی اللہ عنہ نے آپ کو پکڑ لیا اور عرض کیایا رسول اللہ ! کیا اللہ تعالیٰ نے آپ کو منافقین پر نماز جنازہ پڑھنے سے منع نہیں فرمایا ہے ؟ اور فرمایا ہے کہ ان کے لیے مغفرت کی دعا کرویا مغفرت کی دعا نہ کرو اگر تم ستر مرتبہ بھی ان کے لیے مغفرت کی دعا کرو گے تب بھی اللہ انہیں ہرگز نہیں بخشے گا ۔ “ پھر یہ آیت نازل ہوئی کہ ” اور ان میں سے کسی پر بھی جو مرگیا ہو ہرگز نماز نہ پڑھئے ۔ “ اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے ان کی نماز جنازہ پڑھنی چھوڑ دی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 150030,
        "last_updated": null
    },
    {
        "urduURN": 4057180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5797,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، انہوں نے کہا ہم سے ابوعامر نے بیان کیا ، کہا ہم سے ابراہیم بن نافع نے بیان کیا ، ان سے امام حسن بصری نے ، ان سے طاؤس نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے بخیل اور صدقہ دینے والے کی مثال بیان کیا کہ دو آدمیوں جیسی ہے جو لوہے کے جبے ہاتھ ، سینہ اور حلق تک پہنے ہوئے ہیں ۔ صدقہ دینے والا جب بھی صدقہ کرتا ہے تو اس کے جبہ میں کشادگی ہو جاتی ہے اور وہ اس کی انگلیوں تک بڑھ جاتا ہے اور قدم کے نشانات کو ڈھک لیتا ہے اور بخیل جب بھی کبھی صدقہ کا ارادہ کرتا ہے تو اس کا جبہ اسے اورچمٹ جاتا ہے اورہر حلقہ اپنی جگہ پر جم جاتا ہے ۔ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ میں نے دیکھا کہ حضور اکرم صلی اللہ علیہ وسلم اس طرح اپنی مبارک انگلیوں سے اپنے گریبان کی طرف اشارہ کر کے بتا رہے تھے کہ تم دیکھو گے کہ وہ اس میں وسعت پیدا کرنا چاہے گا لیکن وسعت پیدا نہیں ہو گی ۔ اس کی متابعت ابن طاؤس نے اپنے والد سے کی ہے اور ابوالزناد نے اعرج سے کی ۔ ” دو جبوں “ کے ذکر کے ساتھ اور حنظلہ نے بیان کیا کہ میں نے طاؤس سے سنا ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے کہا ” جبتان “ اور جعفر نے اعرج کے واسطہ سے ” جنتان “ کا لفظ بیان کیا ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 150040,
        "last_updated": null
    },
    {
        "urduURN": 4057190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5798,
        "hadithSanad": "ہم سے قیس بن حفص نے بیان کیا ، انہوں نے کہا ہم سے عبدالواحد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، انہوں نے کہا کہ مجھ سے ابو الضحیٰ نے بیان کیا ، انہوں نے کہا کہ مجھ سے مسروق نے بیان کیا ، انہوں نے کہا کہ مجھ سے مغیرہ بن شعبہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم قضائے حاجت کے لیے باہر تشریف لے گئے پھر واپس آئے تو میں پانی لے کر حاضر تھا ۔ آپ نے وضو کیا آپ شامی جبہ پہنے ہوئے تھے ، آپ نے کلی کی اور ناک میں پانی ڈالا اور اپنا چہرہ دھویا پھر اپنی آستینیں چڑھانے لگے لیکن وہ تنگ تھی اس لیے آپ نے اپنے ہاتھ جبہ کے نیچے سے نکالے اور انہیں دھویا اور سر پر اور موزوں پر مسح کیا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 150050,
        "last_updated": null
    },
    {
        "urduURN": 4057200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5799,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے زکریا نے بیان کیا ، ان سے عامر نے ، ان سے عروہ بن مغیرہ نے اور ان سے ان کے والد حضرت مغیرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں ایک رات سفر میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھا آپ نے دریافت فرمایا تمہارے پاس پانی ہے ؟ میں نے عرض کیا کہ جی ہاں ۔ آنحضرت صلی اللہ علیہ وسلم اپنی سواری سے اترے اور چلتے رہے یہاں تک کہ رات کی تاریکی میں آپ چھپ گئے پھر واپس تشریف لائے تو میں نے برتن کا پانی آپ کو استعمال کرایا آنحضرت صلی اللہ علیہ وسلم نے اپنا چہرہ دھویا ، ہاتھ دھوئے آپ اون کاجبہ پہنے ہوئے تھے جس کی آستین چڑھانی آپ کے لیے دشوار تھی چنانچہ آپ نے اپنے ہاتھ جبہ کے نیچے سے نکالے اور بازوؤ ں کو ( کہنیوں تک ) دھویا ۔ پھر سر پر مسح کیا پھر میں بڑھا کہ آنحضرت صلی اللہ علیہ وسلم کے موزے اتاردوں لیکن آپ نے فرمایا کہ رہنے دو میں نے طہارت کے بعد انہیں پہنا تھا چنانچہ آپ نے ان پر مسح کیا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 150060,
        "last_updated": null
    },
    {
        "urduURN": 4057210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5800,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے ابن ابی ملیکہ نے اور ان سے حضرت مسور بن مخرمہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے چند قبائیں تقسیم کیں اور حضرت مخرمہ رضی اللہ عنہ کو کچھ نہیں دیا تو حضرت مخرمہ رضی اللہ عنہ نے کہا بیٹے ہمیں رسول اللہ صلی اللہ علیہ وسلم کے پاس لے چلو چنانچہ میں اپنے والد کو ساتھ لے کر چلا ، انہوں نے مجھ سے کہا کہ اندر جاؤ اور آنحضرت صلی اللہ علیہ وسلم سے میرا ذکر کر دو ۔ میں نے آنحضرت صلی اللہ علیہ وسلم سے حضرت مخرمہ رضی اللہ عنہ کا ذکر کیا تو آپ باہر تشریف لائے آنحضرت صلی اللہ علیہ وسلم انہیں قباؤں میں سے ایک قباء لیے ہوئے تھے ۔ آپ نے فرمایا کہ یہ میں نے تمہارے ہی لیے رکھ چھوڑی تھی ۔ مسور نے بیان کیا کہ مخرمہ رضی اللہ عنہ نے آنحضرت صلی اللہ علیہ وسلم کی طرف دیکھا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ مخرمہ خوش ہو گئے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 150070,
        "last_updated": null
    },
    {
        "urduURN": 4057220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5801,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے یزید بن ابی حبیب نے ، ان سے ابو الخیر نے اور ان سے حضرت عقبہ بن عامر رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کو ریشم کی فروج ( قباء ) ہدیہ میں دی گئی ۔ آنحضرت صلی اللہ علیہ وسلم نے اسے پہنا ( ریشم مردوں کے لیے حرمت کے حکم سے پہلے ) اور اسی کو پہنے ہوئے نماز پڑھی ۔ پھر آپ نے اسے بڑی تیزی کے ساتھ اتار ڈالا جیسے آپ اس سے ناگواری محسوس کرتے ہوں پھر فرمایا کہ یہ متقیوں کے لیے مناسب نہیں ہے ۔ اس روایت کی متابعت عبداللہ بن یوسف نے کی ان سے لیث نے اور عبداللہ بن یوسف کے علاوہ دوسروں نے کہا کہ ” فروج حریر “ ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 150080,
        "last_updated": null
    },
    {
        "urduURN": 4057230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5802,
        "hadithSanad": "اور کہا مجھ سے مسدد نے اور کہا ہم سے معتمر نے کہ میں نے اپنے باپ سے سنا ، کہا انہوں نے کہ",
        "hadithText": "میں نے حضرت انس رضی اللہ عنہ پر ریشمی زرد ٹوپی کو دیکھا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 150090,
        "last_updated": null
    },
    {
        "urduURN": 4057240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5803,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے نافع نے بیان کیا ، ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ایک شخص نے عرض کیا یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! محرم کس طرح کا کپڑا پہنے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ( محرم کے لیے ) کہ قمیص نہ پہنو نہ عمامے نہ پاجامے نہ برنس اور نہ موزے البتہ اگر کسی کو چپل نہ ملے تو وہ ( چمڑے کے ) موزوں کو ٹخنہ سے نیچے تک کاٹ کر انہیں پہن سکتا ہے اور نہ کوئی ایسا کپڑا پہنو جس میں زعفران یا ورس لگایا گیا ہو ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 150100,
        "last_updated": null
    },
    {
        "urduURN": 4057250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5804,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے عمرو نے ، ان سے جابر بن زید نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ( محرم کے بارے میں ) فرمایا جسے تہمد نہ ملے وہ پاجامہ پہنے اور جسے چپل نہ ملیں وہ موزے پہنیں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 150110,
        "last_updated": null
    },
    {
        "urduURN": 4057260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5805,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے جویریہ نے بیان کیا ، ان سے نافع نے اور ان سے حضرت عبداللہ نے بیان کیا کہ",
        "hadithText": "ایک صاحب نے کھڑے ہو کر عرض کیا یا رسول اللہ ! احرام باندھنے کے بعد ہمیں کس چیز کے پہننے کا حکم ہے ؟ فرمایا کہ قمیص نہ پہنو نہ پاجامے ، نہ عمامے ، نہ برنس اور نہ موزے پہنو ۔ البتہ اگر کسی کے پاس چپل نہ ہوں تو وہ چمڑے کے ایسے موزے پہنے جو ٹخنوں سے نیچے ہوں اور کوئی ایسا کپڑا نہ پہنو جس میں زعفران اور ورس لگا ہوا ہو ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 150120,
        "last_updated": null
    },
    {
        "urduURN": 4057270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5806,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، انہوں نے کہا ہم سے سفیان ثوری نے بیان کیا ، انہوں نے کہا کہ میں نے زہری سے سنا ، انہوں نے کہا کہ مجھے سالم نے خبر دی ، انہیں ان کے والد ( حضرت عبداللہ بن عمر رضی اللہ عنہما ) نے خبر دی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ محرم قمیص نہ پہنے نہ عمامہ پہنے نہ پاجامہ نہ برنس اور نہ کوئی ایسا کپڑا پہنے جس میں زعفران اور ورس لگا ہو اور نہ موزے پہنے البتہ اگر کسی کو چپل نہ ملیں تو موزوں کو ٹخنوں کے نیچے تک کاٹ دے ۔ ( پھر پہنے )</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 150130,
        "last_updated": null
    },
    {
        "urduURN": 4057280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5807,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا ہم کو ہشام بن عروہ نے خبر دی ، انہیں معمر نے ، انہیں زہری نے ، انہیں عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "بہت سے مسلمان حبشہ ہجرت کر کے چلے گئے اور ابوبکر رضی اللہ عنہ بھی ہجرت کی تیاریاں کرنے لگے لیکن نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ابھی ٹھہر جاؤ کیونکہ مجھے بھی امید ہے کہ مجھے ( ہجرت کی ) اجازت دی جائے گی ۔ ابوبکر رضی اللہ عنہ نے عرض کیا کیا آپ کو بھی امید ہے ؟ میرا باپ آپ پر قربان ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں ۔ چنانچہ ابوبکر رضی اللہ عنہ آنحضرت صلی اللہ علیہ وسلم کے ساتھ رہنے کے خیال سے رک گئے اور اپنی دو اونٹنیوں کو ببول کے پتے کھلا کر چار مہینے تک انہیں خوب تیار کرتے رہے ۔ عروہ نے بیان کیا کہ عائشہ رضی اللہ عنہا نے کہا ہم ایک دن دوپہر کے وقت اپنے گھر میں بیٹھے ہوئے تھے کہ ایک شخص نے ابوبکر رضی اللہ عنہ سے کہا رسول اللہ صلی اللہ علیہ وسلم سر ڈھکے ہوئے تشریف لا رہے ہیں ۔ اس وقت عموماً آنحضرت صلی اللہ علیہ وسلم ہمارے یہاں تشریف نہیں لاتے تھے ۔ ابوبکر رضی اللہ عنہ نے کہا میرے ماں باپ آنحضور صلی اللہ علیہ وسلم پر قربان ہوں ، آنحضور صلی اللہ علیہ وسلم ایسے وقت کسی وجہ ہی سے تشریف لا سکتے ہیں ۔ آنحضور صلی اللہ علیہ وسلم نے مکان پرپہنچ کر اجازت چاہی اور ابوبکر صدیق رضی اللہ عنہ نے انہیں اجازت دی ۔ آنحضور صلی اللہ علیہ وسلم اندر تشریف لائے اور اندر داخل ہوتے ہی ابوبکر رضی اللہ عنہ سے فرمایا کہ جو لوگ تمہارے پاس اس وقت ہیں انہیں اٹھا دو ۔ ابوبکر صدیق رضی اللہ عنہ نے عرض کی میرا باپ آپ پر قربان ہو یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! یہ سب آپ کے گھر ہی کے افراد ہیں ۔ آنحضور صلی اللہ علیہ وسلم نے فرمایا کہ مجھے ہجرت کی اجازت مل گئی ہے ۔ ابوبکر صدیق رضی اللہ عنہ نے عرض کی پھر یا رسول اللہ ! مجھے رفاقت کا شرف حاصل رہے گا ؟ آپ نے فرمایا کہ ہاں ۔ عرض کی یا رسول اللہ ! میرے باپ آپ پر قربان ہوں ان دو اونٹنیوں میں سے ایک آپ لے لیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا لیکن قیمت سے ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر ہم نے بہت جلدی جلدی سامان سفر تیار کیا اور سفر کا ناشتہ ایک تھیلے میں رکھا ۔ اسماء بنت ابی بکر رضی اللہ عنہ نے اپنے پٹکے کے ایک ٹکڑے سے تھیلہ کے منہ کو باندھا ۔ اسی وجہ سے انہیں ” ذات النطاق “ ( پٹکے والی ) کہنے لگے ۔ پھر آنحضرت صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ ثور نامی پہاڑ کی ایک غار میں جا کر چھپ گئے اور تین دن تک اسی میں ٹھہرے رہے ۔ عبداللہ بن ابی بکر رضی اللہ عنہما رات آپ حضرات کے پاس ہی گزارتے تھے ۔ وہ نو جوان ذہین اور سمجھدار تھے ۔ صبح تڑ کے میں وہاں سے چل دیتے تھے اور صبح ہوتے ہوتے مکہ کے قریش میں پہنچ جاتے تھے ۔ جیسے رات میں مکہ ہی میں رہے ہوں ۔ مکہ مکرمہ میں جو بات بھی ان حضرات کے خلاف ہوتی اسے محفوظ رکھتے اور جوں ہی رات کا اندھیرا چھا جاتا غار ثور میں ان حضرات کے پاس پہنچ کر تمام تفصیلات کی اطلاع دیتے ۔ ابوبکر رضی اللہ عنہ کے مولیٰ عامر بن فہیرہ رضی اللہ عنہ دودھ دینے والی بکریاں چراتے تھے اور جب رات کا ایک حصہ گزر جاتا تو ان بکریوں کو غار ثور کی طرف ہانک لاتے تھے ۔ آپ حضرات بکریوں کے دودھ پر رات گزارتے اور صبح کی پوپھٹتے ہی عامر بن فہیرہ رضی اللہ عنہ وہاں سے روانہ ہو جاتے ۔ ان تین راتوں میں انہوں نے ہر رات ایسا ہی کیا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 150140,
        "last_updated": null
    },
    {
        "urduURN": 4057290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5808,
        "hadithSanad": "ہم سے ابو الولید نے بیان کیا ، کہا ہم سے امام مالک نے بیان کیا ، ان سے زہری نے اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم فتح مکہ کے سال ( مکہ مکرمہ میں ) داخل ہوئے تو آپ کے سر پر خود تھی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 150150,
        "last_updated": null
    },
    {
        "urduURN": 4057300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5809,
        "hadithSanad": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ چل رہا تھا ۔ آنحضرت صلی اللہ علیہ وسلم کے جسم مبارک پر ( یمن کے ) نجران کی بنی ہوئی موٹے حاشیے کی ایک چادر تھی ۔ اتنے میں ایک دیہاتی آ گیا اور اس نے آنحضرت صلی اللہ علیہ وسلم کی چادر کو پکڑ کر اتنی زور سے کھینچا کہ میں نے حضور اکرم صلی اللہ علیہ وسلم کے مونڈھے پر دیکھا کہ اس کے زورسے کھینچنے کی وجہ سے نشان پڑ گیا تھا ۔ پھر اس نے کہا اے محمد ( صلی اللہ علیہ وسلم ) ! مجھے اس مال میں سے دیئے جانے کا حکم کیجیئے جو اللہ کا مال آپ کے پاس ہے ۔ آنحضرت صلی اللہ علیہ وسلم اس کی طرف متوجہ ہوئے اور مسکرائے اور آپ نے اسے دیئے جانے کا حکم فرمایا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 150160,
        "last_updated": null
    },
    {
        "urduURN": 4057310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5810,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے یعقوب بن عبدالرحمٰن نے بیان کیا ، ان سے ابوحازم نے اور ان سے حضرت سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک عورت ایک چادر لے کر آئیں ( جو اس نے خود بنی تھی ) حضرت سہل رضی اللہ عنہ نے کہا تمہیں معلوم ہے وہ پردہ کیا تھا پھر بتلایا کہ یہ ایک اونی چادرتھی جس کے کناروں پر حاشیہ ہوتا ہے ۔ ان خاتون نے حاضر ہو کر عرض کیا یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! یہ چادر میں نے خاص آپ کے اوڑھنے کے لیے بنی ہے ۔ حضور اکرم صلی اللہ علیہ وسلم نے وہ چادر ان سے اس طرح لی گویا آپ کو اس کی ضرورت ہے ۔ پھر آنحضرت صلی اللہ علیہ وسلم اسے تہمد کے طور پر پہن کر ہمارے پاس تشریف لائے ۔ جماعت صحابہ میں سے ایک صاحب ( عبدالرحمٰن بن عوف ) نے اس چادر کو چھوا اور عرض کی یا رسول اللہ ! یہ مجھے عنایت فرما دیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اچھا ۔ جتنی دیر اللہ نے چاہا آپ مجلس میں بیٹھے رہے پھر تشریف لے گئے اور اس چادر کو لپیٹ کر ان صاحب کے پاس بھجوادیا ۔ صحابہ نے اس پر ان سے کہا تم نے اچھی بات نہیں کی کہ آنحضرت صلی اللہ علیہ وسلم سے وہ چادر مانگ لی ۔ تمہیں معلوم ہے کہ آنحضرت صلی اللہ علیہ وسلم کبھی سائل کو محروم نہیں فرماتے ۔ ان صاحب نے کہا اللہ کی قسم میں نے تو صرف آنحضرت سے یہ اس لیے مانگی ہے کہ جب میں مروں تو یہ میرا کفن ہو ۔ حضرت سہل رضی اللہ عنہ نے بیان کیا چنانچہ وہ چادر اس صحابی کے کفن ہی میں استعمال ہوئی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 150170,
        "last_updated": null
    },
    {
        "urduURN": 4057320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5811,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، کہا مجھ سے حضرت سعید بن مسیب نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا میری امت میں سے جنت میں ستر ہزار کی ایک جماعت داخل ہو گی ان کے چہرے چاند کی طرح چمک رہے ہوں گے ۔ حضرت عکاشہ بن محصن اسدی رضی اللہ عنہ اپنی دھاری دار چادر سنبھالتے ہوئے اٹھے اور عرض کیا یا رسول اللہ ! میرے لیے بھی دعا کیجئے کہ اللہ تعالیٰ مجھے انہیں میں سے بنا دے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اے اللہ ! عکاشہ کو بھی انہیں میں سے بنا دے ۔ اس کے بعد قبیلہ انصار کے ایک صحابی سعد بن عبادہ رضی اللہ عنہ کھڑے ہوئے اور عرض کیا یا رسول اللہ ! دعا فرمائیں کہ اللہ تعالیٰ مجھے بھی ان میں سے بنا دے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم سے پہلے عکاشہ دعا کرا چکا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 150180,
        "last_updated": null
    },
    {
        "urduURN": 4057330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5812,
        "hadithSanad": "ہم سے عمرو بن عاصم نے بیان کیا ، کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا ، قتادہ نے بیان کیا کہ میں نے انس رضی اللہ عنہ سے پوچھا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کو کس طرح کا کپڑا زیادہ پسند تھا بیان کیا کہ حبرۃ کی سبز یمنی چادر ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 150190,
        "last_updated": null
    },
    {
        "urduURN": 4057340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5813,
        "hadithSanad": "مجھ سے عبداللہ بن ابی الاسود نے بیان کیا ، انہوں نے کہا ہم سے معاذ دستوائی نے بیان کیا ، انہوں نے کہا کہ مجھ سے میرے والد نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کو تمام کپڑوں میں یمنی سبز چادر پہننا بہت پسند تھی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 150200,
        "last_updated": null
    },
    {
        "urduURN": 4057350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5814,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ، انہوں نے کہا کہ مجھے ابوسلمہ بن عبدالرحمٰن بن عوف رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا نے انہیں خبر دی کہ جب رسول اللہ صلی اللہ علیہ وسلم کی وفات ہوئی تو آپ کی نعش مبارک پر ایک سبز یمنی چادر ڈال دی گئی تھی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 150210,
        "last_updated": null
    },
    {
        "urduURN": 4057360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "مجھ سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا ہم سے لیث بن سعدنے بیان کیا ، ان سے عقیل نے بیان کیا ، ان سے ابن شہاب نے بیان کیا کہ مجھے عبیداللہ بن عبداللہ بن عتبہ نے خبر دی ، ان سے حضرت عائشہ اور حضرت عبداللہ بن عباس رضی اللہ عنہم نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم پر جب آخری مرض طاری ہوا تو آپ اپنی کملی چہرہ مبارک پر ڈالتے تھے اور جب سانس گھٹنے لگتا تو چہرہ کھول لیتے اور اسی حالت میں فرماتے ” یہود و نصاریٰ اللہ تعالیٰ کی رحمت سے دور ہو گئے کہ انہوں نے اپنے انبیاء کی قبروں کو سجدہ گاہ بنا لیا ۔ “ آنحضرت صلی اللہ علیہ وسلم ان کے عمل بد سے ( مسلمانوں کو ) ڈرا رہے تھے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 150220,
        "last_updated": null
    },
    {
        "urduURN": 4057370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5817,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے ابراہیم بن سعد نے بیان کیا ، انہوں نے کہا ہم سے ابن شہاب نے بیان کیا ، ان سے عروہ بن زبیر نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے اپنی ایک نقشی چادر میں نماز پڑھی اور اس کے نقش ونگار پر نماز ہی میں ایک نظر ڈالی ۔ پھر سلام پھیر کر فرمایا کہ میری یہ چادر ابوجہم کو واپس دے دو ۔ اس نے ابھی مجھے میری نماز سے غافل کر دیا تھا اور ابوجہم کی سادی چادر لیتے آؤ ۔ یہ ابوجہم بن حذیفہ بن غانم بنی عدی بن کعب قبیلے میں سے تھے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 150230,
        "last_updated": null
    },
    {
        "urduURN": 4057380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5818,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے اسماعیل بن علیہ نے بیان کیا ، ان سے ایوب سختیانی نے بیان کیا ، ان سے حمید بن ہلال نے اور ان سے ابوبردہ نے بیان کیا کہ",
        "hadithText": "حضرت عائشہ رضی اللہ عنہا نے ہمیں ایک موٹی کملی ( کساء ) اور ایک موٹی ازار نکال کر دکھائی اور کہا کہ رسول اللہ صلی اللہ علیہ وسلم کی روح ان ہی دو کپڑوں میں قبض ہوئی تھی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 150240,
        "last_updated": null
    },
    {
        "urduURN": 4057390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5819,
        "hadithSanad": "مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے عبدالوہاب بن عبدالمجید ثقفی نے بیان کیا ، کہا ہم سے عبیداللہ عمری نے بیان کیا ، ان سے خبیب بن عبدالرحمٰن نے ، ان سے حفص بن عاصم نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے بیع ملامسہ اورمنابذہ سے منع فرمایا اور دو وقت نمازوں سے بھی آپ نے منع فرمایا نماز فجر کے بعد سورج بلند ہونے تک اور عصر کے بعد سورج غروب ہونے تک اور اس سے منع فرمایا کہ کوئی شخص صرف ایک کپڑا جسم پر لپیٹ کر گھٹنے اوپر اٹھا کر اس طرح بیٹھ جائے کہ اس کی شرمگاہ پر آسمان و زمین کے درمیان کوئی چیز نہ ہو ۔ اور اشتمال صماء سے منع فرمایا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 150250,
        "last_updated": null
    },
    {
        "urduURN": 4057400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5820,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے یونس نے ، ان سے ابن شہاب نے بیان کیا ، انہیں عامر بن سعد نے خبر دی ، اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے دو طرح کے پہناوے اور دو طرح کی خریدوفروخت سے منع فرمایا ۔ خرید فروخت میں ملامسہ اور منابذہ سے منع فرمایا ۔ ملامسہ کی صورت یہ تھی کہ ایک شخص ( خریدار ) دوسرے ( بیچنے والے ) کے کپڑے کو رات یا دن میں کسی بھی وقت بس چھو دیتا ( اور دیکھے بغیر صرف چھونے سے بیع ہو جاتی ) صرف چھونا ہی کافی تھا کھول کردیکھا نہیں جاتا تھا ۔ منابذہ کی صورت یہ تھی کہ ایک شخص اپنی ملکیت کا کپڑا دوسرے کی طرف پھینکتا اور دوسرا اپنا کپڑا پھینکتا اور بغیر دیکھے اور بغیر باہمی رضامندی کے صرف اسی سے بیع منعقد ہو جاتی اور دو کپڑے ( جن سے آنحضور صلی اللہ علیہ وسلم نے منع فرمایا انہیں میں سے ایک ) اشتمال صماء ہے ۔ صماء کی صورت یہ تھی کہ اپنا کپڑا ( ایک چادر ) اپنے ایک شانے پر اس طرح ڈالا جاتا کہ ایک کنارہ سے ( شرمگاہ ) کھل جاتی اور کوئی دوسرا کپڑا وہاں نہیں ہوتا تھا ۔ دوسرے پہناوے کا طریقہ یہ تھا کہ بیٹھ کر اپنے ایک کپڑے سے کمر اور پنڈلی باندھ لیتے تھے اور شرمگاہ پر کوئی کپڑا نہیں ہوتا تھا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 150260,
        "last_updated": null
    },
    {
        "urduURN": 4057410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5821,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابوالزناد نے بیان کیا ، ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے دو طرح کے پہناوے سے منع فرمایا یہ کہ کوئی شخص ایک ہی کپڑے سے اپنی کمر اورپنڈلی کو ملا کر باندھ لے اور شرمگاہ پر کوئی دوسرا کپڑا نہ ہو اور یہ کہ کوئی شخص ایک کپڑے کو اس طرح جسم پر لپیٹے کہ ایک طرف کپڑے کا کوئی حصہ نہ ہو اور آپ نے ملامسہ اور منابذہ سے منع فرمایا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 150270,
        "last_updated": null
    },
    {
        "urduURN": 4057420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5822,
        "hadithSanad": "مجھ سے محمد نے بیان کیا ، انہوں نے کہا ہم کو مخلد نے خبر دی ، انہوں نے کہا ہم کو ابن جریح نے خبر دی ، انہوں نے کہا کہ مجھے ابن شہاب نے خبر دی ، انہوں نے کہا ہمیں عبیداللہ بن عبداللہ نے اور انہیں حضرت ابو سعید خدری رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے اشتمال صماء سے منع فرمایا اور اس سے بھی کہ کوئی شخص ایک کپڑے سے پنڈلی اور کمر کوملا لے اورشرمگاہ پر کوئی دوسرا کپڑا نہ ہو ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 150280,
        "last_updated": null
    },
    {
        "urduURN": 4057430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5823,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے اسحاق بن سعید نے بیان کیا ، ان سے ان کے والد نے ، ان سے سعید بن فلاں یعنی عمرو بن سعید بن عاص نے اور ان سے ام خالد بنت خالد رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی خدمت میں کچھ کپڑے لائے گئے جس میں ایک چھوٹی کالی کملی بھی تھی ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا تمہارا کیاخیال ہے یہ چادر کسے دی جائے ؟ صحابہ کرام رضی اللہ عنہم خاموش رہے پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا ام خالد کو میرے پاس بلا لاؤ ۔ انہیں گود میں اٹھا کر لایا گیا ( کیونکہ بچی تھیں ) اور آنحضرت صلی اللہ علیہ وسلم نے وہ چادر اپنے ہاتھ میں لی اور انہیں پہنایا اور دعا دی کہ جیتی رہو ۔ اس چادر میں ہرے اور زرد نقش و نگار تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ام خالد ! یہ نقش ونگار ” سناہ “ ہیں ۔ ” سناہ “ حبشی زبان میں خوب اچھے کے معنی میں آتا ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 150290,
        "last_updated": null
    },
    {
        "urduURN": 4057440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5824,
        "hadithSanad": "مجھ سے محمد بن مثنیٰ نے بیان کیا ، کہا کہ مجھ سے ابن ابی عدی نے بیان کیا ، ان سے ابن عون نے ، ان سے محمد نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جب حضرت ام سلیم رضی اللہ عنہا کے یہاں بچہ پیدا ہوا تو انہوں نے مجھ سے کہا کہ انس اس بچہ کو دیکھتے رہو کوئی چیز اس کے پیٹ میں نہ جائے اور جا کر نبی کریم صلی اللہ علیہ وسلم کو اپنے ساتھ لاؤ تاکہ آنحضرت صلی اللہ علیہ وسلم اپنا جھوٹا اس کے منہ میں ڈالیں ۔ چنانچہ میں آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا آنحضرت صلی اللہ علیہ وسلم اس وقت ایک باغ میں تھے اور آپکے جسم پر قبیلہ بنی حریث کی بنی ہوئی چادر ( خمیصۃ حریثیۃ ) تھی اور آپ اس سواری پر نشان لگا رہے تھے جس پر آپ فتح مکہ کے موقع پر سوار تھے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 150300,
        "last_updated": null
    },
    {
        "urduURN": 4057450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5825,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے عبدالوہاب بن عبدالمجید ثقفی نے ، کہا ہم کو ایوب سختیانی نے خبر دی ، انہیں عکرمہ نے اور انہیں رفاعہ رضی اللہ عنہ نے کہ",
        "hadithText": "انہوں نے اپنی بیوی کو طلاق دے دی تھی ۔ پھر ان سے عبدالرحمٰن بن زبیر قرظی رضی اللہ عنہ نے نکاح کر لیا تھا ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ وہ خاتون سبز اوڑھنی اورڑھے ہوئے تھیں ، انہوں نے عائشہ رضی اللہ عنہا سے ( اپنے شوہر کی ) شکایت کی اور اپنے جسم پر سبز نشانات ( چوٹ کے ) دکھائے پھر جب رسول اللہ صلی اللہ علیہ وسلم تشریف لائے تو ( جیسا کہ عادت ہے ) عکرمہ نے بیان کیا کہ عورتیں آپس میں ایک دوسرے کی مددکرتی ہیں ۔ عائشہ رضی اللہ عنہا نے ( آنحضرت صلی اللہ علیہ وسلم سے ) کہا کہ کسی ایمان والی عورت کا میں نے اس سے زیادہ برا حال نہیں دیکھا ان کا جسم ان کے کپڑے سے بھی زیادہ برا ہو گیا ہے ۔ بیان کیا کہ ان کے شوہر نے بھی سن لیا تھا کہ بیوی حضور اکرم صلی اللہ علیہ وسلم کے پاس گئی ہیں چنانچہ وہ بھی آ گئے اور ان کے ساتھ ان کے دو بچے ان سے پہلی بیوی کے تھے ان کی بیوی نے کہا اللہ کی قسم مجھے ان سے کوئی اورشکایت نہیں البتہ ان کے ساتھ اس سے زیادہ اور کچھ نہیں جس سے میرا کچھ نہیں ہوتا ۔ انہوں نے اپنے کپڑے کا پلو پکڑ کر اشارہ کیا ( یعنی ان کے شوہر کمزور ہیں ) اس پر ان کے شوہر نے کہا یا رسول اللہ ! واللہ یہ جھوٹ بولتی ہے میں تو اس کو ( جماع کے وقت ) چمڑے کی طرح ادھیڑ کر رکھ دیتا ہوں مگر یہ شریر ہے یہ مجھے پسند نہیں کرتی اور رفاعہ کے یہاں دوبارہ جانا چاہتی ہے ۔ حضور اکرم صلی اللہ علیہ وسلم نے اس پر فرمایا کہ اگر یہ بات ہے تو تمہارے لیے وہ ( رفاعہ ) اس وقت تک حلال نہیں ہوں گے جب تک یہ ( عبدالرحمٰن دوسرے شوہر ) تمہارا مزا نہ چکھ لیں ۔ بیان کیا کہ حضور اکرم صلی اللہ علیہ وسلم نے عبدالرحمٰن کے ساتھ دو بچے بھی دیکھے تو دریافت فرمایا کیا یہ تمہارے بچے ہیں ؟ انہوں نے عرض کیاجی ہاں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اچھا ، اس وجہ سے تم یہ باتیں سوچتی ہو ۔ اللہ کی قسم یہ بچے ان سے اتنے ہی مشابہ ہیں جتنا کہ کوا کوے سے مشابہ ہوتا ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 150310,
        "last_updated": null
    },
    {
        "urduURN": 4057460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5826,
        "hadithSanad": "ہم سے اسحاق بن ابراہیم حنظلی نے بیان کیا ، کہا ہم کو محمدبن بشر نے خبر دی ، کہا ہم سے معمر نے بیان کیا ، ان سے سعد بن ابی وقاص رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جنگ احدکے موقع پر میں نے نبی کریم صلی اللہ علیہ وسلم کے دائیں بائیں دو آدمیوں کو ( جو فرشتے تھے ) دیکھا وہ سفید کپڑے پہنے ہوئے تھے میں نے انہیں نہ اس سے پہلے دیکھا اور نہ اس کے بعد کبھی دیکھا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 150320,
        "last_updated": null
    },
    {
        "urduURN": 4057470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5827,
        "hadithSanad": "ہم سے ابو معمر نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، ان سے حسین نے ، ان سے عبداللہ بن بریدہ نے ، ان سے یحییٰ بن یعمر نے بیان کیا ، ان سے ابو اسود دیلی نے بیان کیا اور ان سے حضرت ابوذر رضی اللہ عنہ نے بیان کیا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو جسم مبارک پر سفید کپڑاتھا اور آپ سورہے تھے پھر دوبارہ حاضر ہوا تو آپ بیدار ہو چکے تھے پھر آپ نے فرمایا جس بندہ نے بھی کلمہ لا الہٰ الا اللہ ( اللہ کے سوا کوئی معبود نہیں ) کو مان لیا اور پھر اسی پر وہ مرا تو جنت میں جائے گا ۔ میں نے عرض کیا چاہے اس نے زنا کیا ہو ، چاہے اس نے چوری کی ہو ، آپ نے فرمایا کہ چاہے اس نے زنا کیا ہو چاہے اس نے چوری کی ہو ، میں نے پھر عرض کیا چاہے اس نے زنا کیا ہو چاہے اس نے چوری کی ہو ۔ فرمایا چاہے اس نے زنا کیا ہو چاہے اس نے چوری کی ہو ۔ میں نے ( حیرت کی وجہ سے پھر ) عرض کیا چاہے اس زنا کیا ہو یا اس نے چوری کی ہو ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا چاہے اس نے زنا کیا ہوچا ہے اس نے چوری کی ہو ۔ ابوذر کی ناک خاک آلود ہو ۔ حضرت ابوذر رضی اللہ عنہ بعد میں جب بھی یہ حدیث بیان کرتے تو آنحضرت صلی اللہ علیہ وسلم کے الفاظ ابوذر کے علی الرغم ( وان رغم انف ابی ذر ) ضرور بیان کرتے ۔ ابوعبداللہ حضرت امام بخاری نے کہا یہ صورت کہ ( صرف کلمہ سے جنت میں داخل ہو گا ) یہ اس وقت ہو گی جب موت کے وقت یا اس سے پہلے ( گناہوں سے ) توبہ کی اور کہا کہ لا الہٰ الا اللہ ، اس کی مغفرت ہو جائے گی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 150330,
        "last_updated": null
    },
    {
        "urduURN": 4057480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5828,
        "hadithSanad": "ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے ، کہا ہم سے قتادہ نے ، کہا کہ میں نے ابوعثمان نہدی سے سنا کہ",
        "hadithText": "ہمارے پاس عمر رضی اللہ عنہ کا مکتوب آیا ہم اس وقت عتبہ بن فرقد رضی اللہ عنہ کے ساتھ آذر بائیجان میں تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے ریشم کے استعمال سے ( مردوں کو ) منع کیا ہے سوا اتنے کے اور آنحضرت صلی اللہ علیہ وسلم نے انگوٹھے کے قریب کی اپنی دونوں انگلیوں کے اشارے سے اس کی مقدار بتائی ۔ ابوعثمان نہدی نے بیان کیا کہ ہماری سمجھ میں آنحضور صلی اللہ علیہ وسلم کی مراد اس سے ( کپڑے وغیرہ ریشم کے ) پھول بوٹے بنانے سے تھی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 150340,
        "last_updated": null
    },
    {
        "urduURN": 4057490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5829,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، کہا ہم سے زہیر نے بیان کیا ، ان سے عاصم نے بیان ، ان سے ابوعثمان نے بیان کیا کہ",
        "hadithText": "ہمیں حضرت عمر رضی اللہ عنہ نے لکھا اس وقت ہم آذر بائیجان میں تھے کہ نبی کریم صلی اللہ علیہ وسلم نے ریشم پہننے سے منع فرمایا تھا سوا اتنے کے اور اس کی وضاحت نبی کریم صلی اللہ علیہ وسلم نے دو انگلیوںکے اشارے سے کی تھی ۔ زہیر ( راوی حدیث ) نے بیچ کی اورشہادت کی انگلیاں اٹھا کر بتایا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 150350,
        "last_updated": null
    },
    {
        "urduURN": 4057500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5830,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ نے بیان کیا ، انہوں نے کہا ہم سے تیمی نے بیان کیا اور ان سے ابوعثمان نے بیان کیا کہ",
        "hadithText": "ہم حضرت عتبہ رضی اللہ عنہ کے ساتھ تھے ۔ حضرت عمر رضی اللہ عنہ نے انہیں لکھا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا دنیا میں ریشم جو شخص بھی پہنے گا اسے آخر ت میں نہیں پہنایا جائے گا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 150360,
        "last_updated": null
    },
    {
        "urduURN": 4057510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5831,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے حکم نے ، ان سے ابن ابی لیلیٰ نے بیان کیا کہ",
        "hadithText": "حضرت حذیفہ رضی اللہ عنہ مدائن میں تھے ۔ انہوں نے پانی مانگا ۔ ایک دیہاتی چاندی کے برتن میں پانی لایا ۔ انہوں نے اسے پھینک دیا اور کہا کہ میں نے صرف اسے اس لیے پھینکا ہے کہ میں اس شخص کو منع کر چکا ہوں ( کہ چاندی کے برتن میں مجھے کھانا اور پانی نہ دیا کرو ) لیکن وہ نہیں مانا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے کہ سونا ، چاندی ، ریشم اور دیبا ان ( کفار ) کے لیے دنیا میں ہے اور تمہارے ( مسلمانوں ) کے لیے آخرت میں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 150380,
        "last_updated": null
    },
    {
        "urduURN": 4057520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5832,
        "hadithSanad": "ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے عبدالعزیز بن صہیب نے بیان کیا ، کہا کہ میں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، شعبہ نے بیان کیا کہ",
        "hadithText": "اس پر میں نے پوچھا کیا یہ روایت نبی کریم صلی اللہ علیہ وسلم سے ہے ؟ عبدالعزیز نے بیان کیا کہ قطعاً نبی کریم صلی اللہ علیہ وسلم سے مروی ہے ۔ آپ نے فرمایا کہ جومرد ریشمی لباس دنیا میں پہنے گا وہ آخرت میں اسے ہرگز نہیں پہن سکے گا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 150390,
        "last_updated": null
    },
    {
        "urduURN": 4057530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5833,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ثابت نے بیان کیا کہ میں نے ابن زبیر رضی اللہ عنہ سے سنا ، انہوں نے خطبہ دیتے ہوئے کہا کہ",
        "hadithText": "حضرت محمد صلی اللہ علیہ وسلم نے فرمایا ہے کہ جس مرد نے دنیا میں ریشم پہنا وہ آخرت میں اسے نہیں پہن سکے گا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 150400,
        "last_updated": null
    },
    {
        "urduURN": 4057540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5834,
        "hadithSanad": "ہم سے علی بن جعد نے بیان کیا ، کہا ہم کو شعبہ نے خبر دی ، انہیں ابو ذہبان خلیفہ بن کعب نے ، کہا کہ میں نے حضرت عبداللہ بن زبیر رضی اللہ عنہما سے سنا ، کہا کہ میں نے حضرت عمر رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس مردنے دنیا میں ریشم پہنا وہ اسے آخرت میں نہیں پہن سکے گا ۔ اور ہم سے ابو معمر نے بیان کیا ، ان سے عبدالوارث نے بیان کیا ، ان سے یزید نے کہ معاذ نے بیان کیا کہ مجھے ام عمرو بنت عبداللہ نے خبر دی ، انہوں نے حضرت عبداللہ بن زبیر رضی اللہ عنہما سے سنا ، انہوں نے حضرت عمر رضی اللہ عنہ سے سنا اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 150411,
        "last_updated": null
    },
    {
        "urduURN": 4057550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5835,
        "hadithSanad": "مجھ سے محمد بن بشار نے بیان کیا ، انہوں نے کہا ہم سے عثمان بن عمر نے بیان کیا ، انہوں نے کہا ہم سے علی مبارک نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ بن ابی کثیر نے بیان کیا ، ان سے عمران بن حطان نے بیان کیا کہ",
        "hadithText": "میں نے حضرت عائشہ رضی اللہ عنہا سے ریشم کے متعلق پوچھا تو انہوں نے بتلایا کہ حضرت عبداللہ بن عباس رضی اللہ عنہما کے پاس جاؤ اور ان سے پوچھو ۔ بیان کی کہ میں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے پوچھا تو انہوں نے بیان کیا کہ مجھے ابو حفص یعنی حضرت عمر بن خطاب رضی اللہ عنہ نے خبر دی کہ رسول کریم صلی اللہ علیہ وسلم نے فرمایا دنیا میں ریشم تو وہی مرد پہنے گا جس کا آخرت میں کوئی حصہ نہ ہو ۔ میں نے اس پر کہا کہ سچ کہا اور ابو حفص رسول کریم صلی اللہ علیہ وسلم کی طرف کوئی جھوٹی بات نسبت نہیں کر سکتے اور عبداللہ بن رجاء نے بیان کیا کہ ہم سے جریر نے بیان کیا ، ان سے یحییٰ نے اور ان سے عمران نے اورپوری حدیث بیان کی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 150430,
        "last_updated": null
    },
    {
        "urduURN": 4057560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5836,
        "hadithSanad": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا ، ان سے اسرائیل نے بیان کیا ، ان سے ابواسحاق نے بیان کیا اور ان سے حضرت براء رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کو ریشم کا ایک کپڑا ہدیہ میں پیش ہوا تو ہم اسے چھونے لگے اور اس کی ( نرمی و ملائمت پر ) حیرت زدہ ہو گئے تو آپ نے فرمایا کہ کیا تمہیں اس پر حیرت ہے ۔ ہم نے عرض کیا جی ہاں فرمایا جنت میں سعد بن معاذ کے رومال اس سے بھی اچھے ہیں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 150440,
        "last_updated": null
    },
    {
        "urduURN": 4057570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5837,
        "hadithSanad": "ہم سے علی نے بیان کیا ، انہوں نے کہا ہم سے وہب بن جریر نے بیان کیا ، انہوں نے کہا کہ ہم سے ان کے والد نے بیان کیا ، انہوں نے کہا کہ میں نے ابن ابی نجیح سے سنا ، انہوں نے مجاہد سے ، انہوں نے ابن ابی لیلیٰ سے اور ان سے حضرت حذیفہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ہمیں سونے اور چاندی کے برتن میں پینے اور کھانے سے منع فرمایا تھا اور ریشم اور دیبا ج پہننے اور اس پر بیٹھنے سے منع فرمایا تھا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 150450,
        "last_updated": null
    },
    {
        "urduURN": 4057580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5838,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کوسفیان نے خبر دی ، انہیں اشعث بن ابی شعثاء نے ، ان سے معاویہ بن سوید بن مقرن نے بیان کیا اور ان سے حضرت ابن عازب رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ہمیں سرخ ” میثرہ “ اور ” قسی “ کے پہننے سے منع فرمایا ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 150460,
        "last_updated": null
    },
    {
        "urduURN": 4057590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5839,
        "hadithSanad": "ہم سے محمد نے بیان کیا ، کہا ہم کو شعبہ نے خبر دی ، انہیں قتادہ نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے حضرت زبیر اور حضرت عبدالرحمٰن رضی اللہ عنہما کو ، کیونکہ انہیں خارش ہو گئی تھی ، ریشم پہننے کی اجازت دی تھی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 150470,
        "last_updated": null
    },
    {
        "urduURN": 4057600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5840,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ( دوسری سند ) اور حضرت امام بخاری نے کہا کہ مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عبدالملک بن میسرہ نے اور ان سے زید بن وہب نے کہ حضرت علی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے مجھے ریشمی دھاریوں والا ایک جوڑا حلہ عنایت فرمایا ۔ میں اسے پہن کر نکلا تو میں نے آنحضرت صلی اللہ علیہ وسلم کے چہرہ مبارک پر غصہ کے آثار دیکھے ۔ چنانچہ میں نے اس کے ٹکڑے کر کے اپنی عزیزعورتوں میں بانٹ دیئے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 150480,
        "last_updated": null
    },
    {
        "urduURN": 4057610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5841,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ مجھ سے جویریہ نے بیان کیا ، ان سے نافع نے ، ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "حضرت عمر رضی اللہ عنہ نے ریشمی دھاریوں والا ایک جوڑا فروخت ہوتے دیکھا تو عرض کیا کہ یا رسول اللہ ! بہتر ہے کہ آپ اسے خرید لیں اور وفود سے ملاقت کے وقت اور جمعہ کے دن اسے زیب تن کیا کریں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اسے وہ پہنتا ہے جس کا ( آخرت میں ) کوئی حصہ نہیں ہوتا ۔ اس کے بعد حضور اکرم صلی اللہ علیہ وسلم نے خود حضرت عمر رضی اللہ عنہ کے پاس ریشم کی دھاریوں والا ایک جوڑا حلہ بھیجا ، ہدیہ کے طور پر ۔ حضرت عمر رضی اللہ عنہ نے عرض کیا آپ نے مجھے یہ جوڑا حلہ عنایت فرمایا ہے حالانکہ میں خود آپ سے اس کے بارے میں وہ بات سن چکا ہوں جو آپ نے فرمائی تھی ۔ آپ نے فرمایا کہ میں نے تمہیں یہ کپڑا اس لیے دیا ہے کہ اسے بیچ دو یا ( عورتوں وغیرہ میں سے ) کسی کو پہنا دو ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 150490,
        "last_updated": null
    },
    {
        "urduURN": 4057620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5842,
        "hadithSanad": "ہم سے ابوا لیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہیں حضرت انس بن مالک رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم کی صاحبزادی ام کلثوم رضی اللہ عنہا کو زرد دھاری دار ریشمی جوڑا پہنے دیکھا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 150500,
        "last_updated": null
    },
    {
        "urduURN": 4057630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5843,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد بن زید نے ، ان سے یحییٰ بن سعید نے ، ان سے عبید بن حنین نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں عمر رضی اللہ عنہ سے ان عورتوں کے بارے میں جنہوں نے نبی کریم صلی اللہ علیہ وسلم کے معاملہ میں اتفاق کر لیا تھا ، پوچھنے کاارادہ کرتا رہا لیکن ان کا رعب سامنے آ جاتا تھا ۔ ایک دن ( مکہ کے راستہ میں ) ایک منزل پرقیام کیا اور پیلو کے درختوں میں ( وہ قضائے حاجت کے لیے ) تشریف لے گئے ۔ جب قضائے حاجت سے فارغ ہو کر واپس تشریف لائے تو میں نے پوچھا انہوں نے بتلایا کہ عائشہ اور حفصہ رضی اللہ عنہما ہیں پھر کہا کہ جاہلیت میں ہم عورتوں کو کوئی حیثیت نہیں دیتے تھے ۔ جب اسلام آیا اور اللہ تعالیٰ نے ان کا ذکر کیا ( اور ان کے حقوق ) مردوں پر بتائے تب ہم نے جانا کہ ان کے بھی ہم پر کچھ حقوق ہیں لیکن اب بھی ہم اپنے معاملات میں ان کا دخیل بننا پسند نہیں کرتے تھے ۔ میرے اور میری بیوی میں کچھ گفتگو ہو گئی اور اس نے تیز وتند جواب مجھے دیاتو میں نے اس سے کہا اچھا اب نوبت یہاں تک پہنچ گئی ۔ اس نے کہا تم مجھے یہ کہتے ہو اورتمہاری بیٹی نبی کریم صلی اللہ علیہ وسلم کوبھی تکلیف پہنچاتی ہے ۔ میں ( اپنی بیٹی ام المؤمنین ) حفصہ کے پاس آیا اور اس سے کہا میں تجھے تنبیہ کرتا ہوں کہ اللہ اور اس کے رسول کی نافرمانی کرے ۔ حضور اکرم صلی اللہ علیہ وسلم کو تکلیف پہنچانے کے معاملہ میں سب سے پہلے میں ہی حفصہ کے یہاں گیا پھر میں حضرت ام سلمہ کے پاس آیا اور ان سے بھی یہی بات کہی لیکن انہوں نے کہا کہ حیرت ہے تم پر عمر ! تم ہمارے معاملات میں دخیل ہو گئے ہو ۔ صرف رسول اللہ صلی اللہ علیہ وسلم اور آپ کی ازواج کے معاملات میں دخل دینا باقی تھا ۔ ( سو اب وہ بھی شروع کر دیا ) انہوں نے میری بات رد کر دی ۔ قبیلہ انصار کے ایک صحابی تھے جب وہ حضور اکرم صلی اللہ علیہ وسلم کی صحبت میں موجود نہ ہوتے اور میں حاضر ہوتا تو تمام خبریں ان سے آ کر بیان کرتا تھا اور جب میں آنحضرت صلی اللہ علیہ وسلم کی صحبت سے غیرحاضر ہوتا اور وہ موجود ہوتے تو وہ آنحضرت صلی اللہ علیہ وسلم کے متعلق تمام خبریں مجھے آ کر سناتے تھے ۔ آپ کے چاروں طرف جتنے ( بادشاہ وغیرہ ) تھے ان سب سے آپ کے تعلقات ٹھیک تھے ۔ صرف شام کے ملک غسان کا ہمیں خوف رہتا تھا کہ وہ کہیں ہم پر حملہ نہ کر دے ۔ میں نے جو ہوش وحواس درست کئے تو وہی انصاری صحابی تھے اور کہہ رہے تھے کہ ایک حادثہ ہو گیا ۔ میں نے کہا کیا بات ہوئی ۔ کیا غسان چڑھ آیا ہے ۔ انہوں نے کہا کہ اس سے بھی بڑا حادثہ کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی ازواج کو طلاق دے دی ۔ میں جب ( مدینہ ) حاضر ہوا تو تمام ازواج کے حجروں سے رونے کی آواز آ رہی تھی ۔ حضور اکرم صلی اللہ علیہ وسلم اپنے بالا خانہ پر چلے گئے تھے اور بالا خانہ کے دروازہ پر ایک نو جوان پہرے دار موجود تھا میں نے اس کے پاس پہنچ کر اس سے کہا کہ میرے لیے حضور اکرم صلی اللہ علیہ وسلم سے اندر حاضر ہونے کی اجازت مانگ لو پھر میں اندر گیا تو آپ ایک چٹائی پر تشریف رکھتے تھے جس کے نشانات آپ کے پہلو پر پڑے ہوئے تھے اور آپ کے سرکے نیچے ایک چھوٹا سا چمڑے کاتکیہ تھا ۔ جس میں کھجور کی چھال بھری ہوئی تھی ۔ چند کچی کھالیں لٹک رہی تھیں اور ببول کے پتے تھے ۔ میں نے آنحضرت صلی اللہ علیہ وسلم سے اپنی ان باتوں کا ذکر کیا جو میں نے حفصہ اور ام سلمہ سے کہی تھیں اور وہ بھی جو ام سلمہ نے میری بات رد کرتے ہوئے کہا تھا ۔ حضور اکرم صلی اللہ علیہ وسلم اس پر مسکرادیئے ۔ آپ نے اس بالا خانہ میں انتیس دن تک قیام کیا پھر آپ وہاں سے نیچے اتر آئے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 150510,
        "last_updated": null
    },
    {
        "urduURN": 4057640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5844,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، انہوں نے کہا ہم سے ہشام بن یوسف صنعانی نے بیان کیا ، انہوں نے کہا ہم کو معمر بن راشد نے خبر دی ، انہیں زہری نے خبر دی ، انہیں ہندہ بنت حارث نے خبر دی اور ان سے حضرت ام سلمہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم رات کے وقت بیدار ہوئے اور کہا اللہ کے سوا کوئی معبود نہیں کیسی کیسی بلائیں اس رات میں نازل ہو رہی ہیں اور کیا کیا رحمتیں اس کے خزانوں سے اتر رہی ہیں ۔ کوئی ہے جو ان حجرہ والیوں کو بیدار کر دے ۔ دیکھو بہت سی دنیا میں پہننے اوڑھنے والیاں آخرت میں ننگی ہوں گی ۔ زہری نے بیان کیا کہ ہندہ اپنی آستینوں میں انگلیوں کے درمیان گھنڈیاں لگا تی تھیں ۔ تاکہ صرف انگلیاں کھلیں اس سے آگے نہ کھلے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 150520,
        "last_updated": null
    },
    {
        "urduURN": 4057650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5845,
        "hadithSanad": "ہم سے ابو الولید نے بیان کیا ، کہا ہم سے اسحاق بن سعید بن عمرو بن سعید بن عاص نے بیان کیا ، کہا کہ مجھ سے میرے والد نے بیان کیا ، کہا کہ مجھ سے ام خالد بنت خالد رضی اللہ عنہا نے بیان کیا ، انہوں نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے پاس کچھ کپڑے آئے جن میں ایک کالی چادر بھی تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تمہاراکیا خیال ہے ، کسے یہ چادر دی جائے صحابہ کرام رضی اللہ عنہم خاموش رہے پھر آپ نے فرمایا ام خالد رضی اللہ عنہ کو بلا لاؤ ۔ چنانچہ مجھے آنحضرت صلی اللہ علیہ وسلم کی خدمت میں لایا گیا اور مجھے وہ چادر آنحضرت صلی اللہ علیہ وسلم نے اپنے ہاتھ سے عنایت فرمائی اور فرمایا دیر تک جیتی رہو ۔ دو مرتبہ آپ نے فرمایا پھر آپ اس چادر کے نقش ونگار کو دیکھنے لگے اور اپنے ہاتھ سے میری طرف اشارہ کر کے فرمایا ام خالد ! ” سناہ ، سناہ “ یہ حبشی زبان کا لفظ ہے یعنی واہ کیا زیب دیتی ہے ۔ اسحاق بن سعید نے بیان کیا کہ مجھ سے میرے گھر کی ایک عورت نے بیان کیا کہا کہ انہوں نے وہ چادر حضرت ام خالد رضی اللہ عنہا کے پاس دیکھی تھی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 150530,
        "last_updated": null
    },
    {
        "urduURN": 4057660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5846,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے عبدالوارث بن سعید نے بیان کیا ، ان سے عبدالعزیز نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے اس سے منع فرمایا کہ کوئی مرد زعفران کے رنگ کا استعمال کرے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 150540,
        "last_updated": null
    },
    {
        "urduURN": 4057670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5847,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عبداللہ بن دینار نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے منع کیا تھا کہ کوئی محرم ورس یا زعفران سے رنگا ہوا کپڑاپہنے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 150550,
        "last_updated": null
    },
    {
        "urduURN": 4057680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5848,
        "hadithSanad": "ہم سے ابو الولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ابواسحاق نے اور انہوں نے حضرت براء رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم میانہ قد تھے اور میں نے حضور اکرم کو سرخ جوڑے میں دیکھا آپ سے زیادہ خوبصورت کوئی چیز میں نے نہیں دیکھی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 150560,
        "last_updated": null
    },
    {
        "urduURN": 4057690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5849,
        "hadithSanad": "ہم سے قبیصہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے اشعث نے ، ان سے معاویہ بن سوید بن مقرن نے اور ان سے حضرت براء رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہمیں رسول اللہ صلی اللہ علیہ وسلم نے سات چیزوں کا حکم دیا تھا ۔ بیمار کی عیادت کا ، جنازہ کے پیچھے چلنے کا ، چھینکنے والے کا جواب ( یرحمک اللہ سے ) دینے کا اور آنحضرت صلی اللہ علیہ وسلم نے ہمیں ریشم ، دیبا ، قسی ، استبرق اور سرخ زین پوشوں کے استعمال سے بھی منع فرمایا تھا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 150570,
        "last_updated": null
    },
    {
        "urduURN": 4057700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5850,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد نے بیان کیا ، ان سے سعید بن ابی مسلمہ نے ، انہوں نے کہا میں نے حضرت انس رضی اللہ عنہ سے پوچھا کیا",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جوتے پہنے ہوئے نماز پڑھتے تھے تو انہوں نے کہا کہ ہاں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 150580,
        "last_updated": null
    },
    {
        "urduURN": 4057710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5851,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، ان سے امام مالک نے ، ان سے مقبری نے ، ان سے عبید بن جریج نے کہ انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے عرض کیا کہ",
        "hadithText": "میں آپ کو چار ایسی چیزیں کرتے دیکھتا ہوں جو میں نے آپ کے کسی ساتھی کو کرتے نہیں دیکھا ۔ حضرت ابن عمر رضی اللہ عنہما نے کہا ابن جریج ! وہ کیا چیزیں ہیں ؟ انہوں نے کہا کہ میں نے آپ کو دیکھا ہے کہ آپ ( خانہ کعبہ کے ) کسی کو نے کو طواف میں ہاتھ نہیں لگاتے صرف دو ارکان یمانی ( یعنی صرف رکن یمانی اور حجراسود ) کو چھوتے ہیں اور میں نے آپ کو دیکھا ہے کہ آپ صاف زین کے چمڑے کا جوتا پہنتے ہیں اور میں نے آپ کود یکھا کہ آپ اپنا کپڑا زرد رنگ سے رنگتے ہیں یا زرد خضاب لگاتے ہیں اور میں نے آپ کو دیکھا کہ جب مکہ میں ہوتے ہیں تو سب لوگ تو ذی الحجہ کا چاند دیکھ کر احرام باندھ لیتے ہیں لیکن آپ احرام نہیں باندھتے بلکہ ترویہ کے دن ( 8 ذی الحجہ کو ) کو احرام باندھتے ہیں ۔ ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ خانہ کعبہ کے ارکان کے متعلق جو تم نے کہا تو میں نے رسول اللہ صلی اللہ علیہ وسلم کو ہمیشہ صرف حجراسود اور رکن یمانی کو چھوتے دیکھا ، صاف تری کے چمڑے کے جوتوں کے متعلق جو تم نے پوچھا تو میں نے دیکھا ہے کہ حضور اکرم صلی اللہ علیہ وسلم اسی چمڑے کا جوتا پہنتے تھے جس میں بال نہیں ہوتے تھے اور آپ اس کو پہنے ہوئے وضو کرتے تھے اس لیے میں بھی پسند کرتا ہوں کہ ایسا ہی جوتا استعمال کروں ۔ زرد رنگ کے متعلق تم نے جو کہا ہے تو میں نے حضور اکرم صلی اللہ علیہ وسلم کو اس سے خضاب کرتے یا کپڑے رنگتے دیکھا ہے اس لیے میں بھی اس زرد رنگ کو پسند کرتا ہوں اور رہا احرام باندھنے کا مسئلہ تو میں نے آنحضرت صلی اللہ علیہ وسلم کو دیکھا کہ آپ اسی وقت احرام باندھتے جب اونٹ پر سوار ہو کر جانے لگتے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 150590,
        "last_updated": null
    },
    {
        "urduURN": 4057720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5852,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا ، انہوں نے کہا ہم کو امام مالک نے خبر دی ، انہوں نے کہا ہمیں عبداللہ بن دینار نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے محرم کو زعفران یا ورس سے رنگا ہوا کپڑا پہننے سے منع فرمایا تھا اور آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جسے جوتے نہ ملیں وہ موزے ہی پہن لیں لیکن ان کو ٹخنے کے نیچے تک کاٹ دیں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 150600,
        "last_updated": null
    },
    {
        "urduURN": 4057730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5853,
        "hadithSanad": "ہم سے محمد بن یوسف فریابی نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے عمرو بن دینار نے ، ان سے جابر بن زید نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس کے پاس احرام باندھنے کے لیے تہبند نہ ہو وہ پاجامہ پہن لے ( اس کا کاٹنا ضروری نہیں ہے ) اور جس کے پاس جوتے نہ ہوں وہ موزے ہی پہن لے لیکن ٹخنوں کے نیچے تک ان کو کاٹ ڈالے جیسا کہ پچھلی حدیث میں ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 150610,
        "last_updated": null
    },
    {
        "urduURN": 4057740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5854,
        "hadithSanad": "ہم سے حجاج بن منہال نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، انہوں نے کہا کہ مجھے اشعث بن سلیم نے خبر دی کہ میں نے اپنے والد سے سنا ، وہ مسروق سے بیان کرتے تھے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم طہارت میں کنگھا کرنے میں اور جوتا پہننے میں داہنی طرف سے شروع کرنے کو پسند فرماتے تھے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 150620,
        "last_updated": null
    },
    {
        "urduURN": 4057750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5855,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، ان سے امام مالک نے ، ان سے ابوالزناد نے ، ان سے اعرج نے اور ا ن سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب تم میں سے کوئی شخص جوتا پہنے تو دائیں طرف سے شروع کرے اور جب اتارے تو بائیں طرف سے اتارے تاکہ داہنی جانب پہننے میں اول ہو اور اتارنے میں آخر ہو ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 150630,
        "last_updated": null
    },
    {
        "urduURN": 4057760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5856,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، ان سے امام مالک نے ، ان سے ابوالزناد نے ، ان سے اعرج نے ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا تم میں کوئی شخص صرف ایک پاؤں میں جوتا پہن کر نہ چلے یا دونوں پاؤں ننگا رکھے یا دونوں میں جوتا پہنے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 150640,
        "last_updated": null
    },
    {
        "urduURN": 4057770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5857,
        "hadithSanad": "ہم سے حجاج بن منہال نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے چپل میں دو تسمے تھے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 150650,
        "last_updated": null
    },
    {
        "urduURN": 4057780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5858,
        "hadithSanad": "مجھ سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو حضرت عبداللہ بن مبارک نے خبر دی ، انہیں عیسیٰ بن طہمان نے خبر دی ، بیان کیا کہ",
        "hadithText": "حضرت انس بن مالک رضی اللہ عنہ دو جوتے لے کر ہمارے پاس باہر آئے جس میں دو تسمے لگے ہوئے تھے ۔ ثابت بنانی نے کہا کہ یہ نبی کریم صلی اللہ علیہ وسلم کے جوتے ہیں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 150660,
        "last_updated": null
    },
    {
        "urduURN": 4057790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5859,
        "hadithSanad": "ہم سے محمد بن عرعرہ نے بیان کیا ، کہا کہ مجھ سے عمر بن ابی زائدہ نے بیان کیا ، ان سے عون بن ابی جحیفہ نے اور ان سے ان کے والد وہب بن عبداللہ سوائی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں ( حجۃ الوداع کے موقع پر ) خدمت نبوی میں حاضر ہوا تو آپ چمڑے کے ایک سرخ خیمہ میں تشریف رکھے ہوئے تھے اور میں نے حضرت بلال رضی اللہ عنہ کو دیکھا کہ آنحضرت صلی اللہ علیہ وسلم کے وضو کا پانی لیے ہوئے ہیں اور صحابہ کرام رضی اللہ عنہم آنحضرت صلی اللہ علیہ وسلم کے وضو کے پانی کو لے لینے میں ایک دوسرے کے آگے بڑھنے کی کوشش کر رہے ہیں ۔ اگر کسی کو کچھ پانی مل جاتا ہے تو وہ اسے اپنے بدن پر لگا لیتا ہے اور جسے کچھ نہیں ملتا وہ اپنے ساتھی کے ہاتھ کی تری ہی کو لگانے کی کوشش کرتا ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 150670,
        "last_updated": null
    },
    {
        "urduURN": 4057800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5860,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے اور انہیں حضرت انس بن مالک رضی اللہ عنہ نے خبر دی ( دوسری سند ) اور لیث بن سعد نے کہا کہ مجھ سے یونس نے بیان کیا ، ان سے ابن شہاب نے کہا کہ مجھ سے حضرت انس بن مالک رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے انصار کو بلوایا اور انہیں لال چمڑے کے ایک خیمہ میں جمع کیا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 150680,
        "last_updated": null
    },
    {
        "urduURN": 4057810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5861,
        "hadithSanad": "مجھ سے محمدبن ابی بکر نے بیان کیا ، انہوں نے کہا ہم سے معتمر نے بیان کیا ، ان سے عبیداللہ نے بیان کیا ، ان سے سعید بن ابی سعید نے بیان کیا ، ان سے ابوسلمہ بن عبدالرحمٰن نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم رات میں چٹائی کا گھیرا بنا لیتے تھے اور ان گھیرے میں نماز پڑھتے تھے اور اسی چٹائی کو دن میں بچھاتے تھے اور اس پر بیٹھتے تھے پھر لوگ ( رات کی نماز کے وقت ) نبی کریم صلی اللہ علیہ وسلم کے پاس جمع ہونے لگے اور آنحضرت صلی اللہ علیہ وسلم کی نماز کی اقتداء کرنے لگے جب مجمع زیادہ بڑھ گیا تو آنحضرت صلی اللہ علیہ وسلم متوجہ ہوئے اور فرمایا لوگو ! عمل اتنے ہی کیا کروجتنی کہ تم میں طاقت ہو کیونکہ اللہ تعالیٰ نہیں تھکتا جب تک تم ( عمل سے ) نہ تھک جاؤ اور اللہ کی بارگاہ میں سب سے زیادہ پسند وہ عمل ہے جسے پابندی سے ہمیشہ کیا جائے ، خواہ وہ کم ہی ہو ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 150690,
        "last_updated": null
    },
    {
        "urduURN": 4057820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5862,
        "hadithSanad": "اور لیث بن سعد نے کہا کہ مجھ سے ابن ابی ملیکہ نے بیان کیا ، ان سے حضرت مسور بن مخرمہ رضی اللہ عنہ نے کہ ان سے ان کے والد حضرت مخرمہ رضی اللہ عنہ نے کہا بیٹے مجھے معلوم ہوا ہے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے پاس کچھ قبائیں آئی ہیں اور آپ انہیں تقسیم فرما رہے ہیں ۔ ہمیں بھی آنحضرت صلی اللہ علیہ وسلم کے پاس لے چلو ۔ چنانچہ ہم گئے اور آنحضرت صلی اللہ علیہ وسلم کو آپ کے گھر ہی میں پایا ۔ والد نے مجھ سے کہا بیٹے میرا نام لے کر آنحضرت صلی اللہ علیہ وسلم کو بلاؤ ۔ میں نے اسے بہت بڑی توہین آمیز بات سمجھا ( کہ آنحضرت صلی اللہ علیہ وسلم کو اپنے والد کے لیے بلا کر تکلیف دوں ) چنانچہ میں نے والد صاحب سے کہا کہ میں آپ کے لیے آنحضرت صلی اللہ علیہ وسلم کو بلاؤں ! انہوں نے کہا کہ بیٹے ہاں ۔ آپ کوئی جابر صفت انسان نہیں ہیں ۔ چنانچہ میں نے بلایا تو آنحضرت صلی اللہ علیہ وسلم باہر تشریف لے آئے ۔ آپ صلی اللہ علیہ وسلم کے اوپر دیبا کی ایک قباء تھی جس میں سونے کی گھنڈیاں لگی ہوئی تھیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، مخرمہ اسے میں نے تمہارے لیے چھپا کے رکھا ہوا تھا ۔ چنانچہ آپ صلی اللہ علیہ وسلم نے وہ قباء انہیں عنایت فرما دی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 150700,
        "last_updated": null
    },
    {
        "urduURN": 4057830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5863,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم کو اشعث بن سلیم نے کہا کہ میں نے معاویہ بن سوید بن مقرن سے سنا ، انہوں نے کہا کہ میں نے حضرت براء  بن عازب رضی اللہ عنہ سے سنا ، انہوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ہمیں سات چیزوں سے روکا تھا ۔ آپ صلی اللہ علیہ وسلم نے ہمیں سونے کی انگوٹھی سے یا راوی نے کہا کہ سونے کے چھلے سے ، ریشم سے ، استبرق سے ، دیبا سے ، سرخ میثرہ سے ، قسی سے اور چاندی کے برتن سے منع فرمایا تھا اور ہمیں آپ نے سات چیزوں یعنی بیمار کی مزاج پرسی کرنے ، جنازہ کے پیچھے چلنے ، چھینکنے والے کا جواب دینے ، سلام کے جواب دینے ، دعوت کرنے والے کی دعوت قبول کرنے ( کسی بات پر ) قسم کھا لینے والے قسم پوری کرانے اور مظلوم کی مدد کرنے کا حکم فرمایا تھا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 150710,
        "last_updated": null
    },
    {
        "urduURN": 4057840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5864,
        "hadithSanad": "مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے ، ان سے نضر بن انس نے ، ان سے بشیر بن نہیک نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے سونے کی انگوٹھی کے پہننے سے مردوں کو منع فرمایا تھا ۔ اور عمرو نے بیان کیا ، کہا ہم کو شعبہ نے خبر دی ، انہیں قتادہ نے ، انہوں نے نضر سے سنا اور انہوں نے بشیر سے سنا ۔ آگے اسی طرح روایت بیان کی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 150720,
        "last_updated": null
    },
    {
        "urduURN": 4057850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5865,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ بن ابی کثیر نے بیان کیا ، ان سے عبیداللہ نے بیان کیا ، کہا کہ مجھ سے نافع نے بیان کیا اور ا ن سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے سونے کی ایک انگوٹھی بنوائی اور اس کا نگینہ ہتھیلی کی جانب رکھا پھر کچھ دوسرے لوگوں نے بھی اسی طرح کی انگوٹھیاں بنوالیں ۔ آخر آنحضرت صلی اللہ علیہ وسلم نے اسے پھینک دیا اور چاندی کی انگوٹھی بنوالی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 150730,
        "last_updated": null
    },
    {
        "urduURN": 4057860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5866,
        "hadithSanad": "ہم سے یوسف بن موسیٰ نے بیان کیا ، کہا ہم سے ابو اسا مہ نے بیان کیا ، کہا ہم سے عبیداللہ نے بیان کیا ، ان سے نافع نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے سونے یاچاندی کی انگوٹھی بنوائی اور اس کا نگینہ ہتھیلی کی طرف رکھا اور اس پر ” محمدرسول اللہ “ کے الفاظ کھدوائے پھر دوسرے لوگوں نے بھی اسی طرح کی انگوٹھیاں بنوالیں ۔ جب آنحضرت صلی اللہ علیہ وسلم نے دیکھا کہ کچھ دوسرے لوگوں نے بھی اس طرح کی انگوٹھیاں بنوالی تو آپ نے اسے پھینک دیا اور فرمایا کہ اب میں اسے کبھی نہیں پہنوں گا ۔ پھر آپ نے چاندی کی انگوٹھی بنوائی اور دوسرے لوگوں نے بھی چاندی کی انگو ٹھیاں بنوالیں ۔ حضرت ابن عمر رضی اللہ عنہما نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم کے بعد اس انگوٹھی کو حضرت ابوبکر رضی اللہ عنہ نے پہنا پھر حضرت عمر رضی اللہ عنہ اور پھر حضرت عثمان نے پہنا ۔ آخر حضرت عثمان رضی اللہ عنہ کے عہد خلافت میں وہ انگوٹھی اریس کے کنویں میں گر گئی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 150740,
        "last_updated": null
    },
    {
        "urduURN": 4057870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5867,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، کہا ہم سے امام مالک نے ، ان سے عبداللہ بن دینار نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم ( حرمت سے پہلے ) سونے کی انگوٹھی پہنتے تھے پھر حرمت کا حکم آنے پر آپ نے اسے پھینک دیا اور فرمایا کہ میں اب سے کبھی نہیں پہنوں گا اور لوگوں نے بھی اپنی انگوٹھیاں پھینک دیں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 150750,
        "last_updated": null
    },
    {
        "urduURN": 4057880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5868,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، انہوں نے کہا ان سے یونس نے ، ان سے ابن شہاب نے انہوں نے کہا کہ مجھ سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "انہوں نے نبی کریم صلی اللہ علیہ وسلم کے ہاتھ میں ایک دن چاندی کی انگوٹھی دیکھی پھر دوسرے لوگوں نے بھی چاندی کی انگوٹھیاں بنوانی شروع کر دیں اور پہننے لگے تو آنحضرت صلی اللہ علیہ وسلم نے اپنی انگوٹھی پھینک دیں اور دوسرے لوگوں نے بھی اپنی انگوٹھیاں پھینک دی ۔ اس روایت کی متابعت ابراہیم بن سعد ، زیاد اور شعیب نے زہری سے کی ہے اور ابن مسافر نے زہری سے بیان کیا کہ میرا خیال ہے کہ ” خاتما من ورق “ بیان کیا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 150760,
        "last_updated": null
    },
    {
        "urduURN": 4057890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5869,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا ہم کو یزید بن زریع نے خبر دی ، کہا ہم کو حمید نے خبر دی ، کہا انہوں نے کہ حضرت انس رضی اللہ عنہ سے پوچھا گیا",
        "hadithText": "کیا نبی کریم صلی اللہ علیہ وسلم نے انگوٹھی بنوائی تھی ۔ انہوں نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے ایک رات عشاء کی نماز آدھی رات میں پڑھائی ۔ پھر چہرہ مبارک ہماری طرف کیا ، جیسے اب بھی میں آنحضرت صلی اللہ علیہ وسلم کی انگوٹھی کی چمک دیکھ رہا ہوں ۔ فرمایا کہ بہت سے لوگ نماز پڑھ کر سو چکے ہوں گے لیکن تم اس وقت بھی نماز میں ہو جب تک تم نماز کا انتظار کرتے رہے ہو ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 150770,
        "last_updated": null
    },
    {
        "urduURN": 4057900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5870,
        "hadithSanad": "ہم سے اسحاق نے بیان کیا ، کہا ہم کو معتمر نے خبر دی ، کہا کہ میں نے حمید سے سنا ، وہ حضرت انس رضی اللہ عنہ سے بیان کرتے تھے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی انگوٹھی چاندی کی تھی اور اس کا نگینہ بھی اسی کا تھا اور یحییٰ بن ایوب نے بیان کیا کہ مجھ سے حمید نے بیان کیا ، انہوں نے حضرت انس رضی اللہ عنہ سے سنا ، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے اسی طرح بیان کیا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 150780,
        "last_updated": null
    },
    {
        "urduURN": 4057910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5871,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، کہا ہم سے عبدالعزیز بن ابی حازم نے بیان کیا ، ان سے ان کے والد نے اور انہوں نے حضرت سہل رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "ایک عورت نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور عرض کی کہ میں اپنے آپ کو ہبہ کرنے آئی ہوں ، دیر تک وہ عورت کھڑٰی رہی ۔ آنحضرت صلی اللہ علیہ وسلم نے انہیں دیکھا اور پھر سر جھکا لیا جب دیر تک وہ وہیں کھڑی رہیں تو ایک صاحب نے اٹھ کر عرض کیا اگر آنحضرت صلی اللہ علیہ وسلم کو ان کی ضرورت نہیں ہے تو ان کا نکاح مجھ سے کر دیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا تمہارے پاس کوئی چیز ہے جو مہر میں انہیں دے سکو ، انہوں نے کہا کہ نہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ دیکھ لو ۔ وہ گئے اور واپس آ کر عرض کیا کہ واللہ ! مجھے کچھ نہیں ملا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جاؤ تلاش کرو ، لوہے کی ایک انگوٹھی ہی سہی ۔ وہ گئے اور واپس آ کر عرض کیا کہ وہ مجھے لوہے کی ایک انگوٹھی بھی نہیں ملی ۔ وہ ایک تہمد پہنے ہوئے تھے اور ان کے جسم پر ( کرتے کی جگہ ) چادر بھی نہیں تھی ۔ انہوں نے عرض کیا کہ میں انہیں اپنا تہمد مہر میں دے دوں گا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر تمہارا تہمد یہ پہن لیں گی تو تمہارے لیے کچھ باقی نہیں رہے گا ۔ اور اگر تم اسے پہن لو گے تو ان کے لیے کچھ نہیں رہے گا ۔ وہ صاحب اس کے بعد ایک طرف بیٹھ گئے پھر جب آنحضرت صلی اللہ علیہ وسلم نے انہیں جاتے دیکھا تو آپ نے انہیں بلوایا اور فرمایا تمہیں قرآن کتنا یادہے ؟ انہوں نے عرض کیا کہ فلاں فلاں سورتیں ۔ انہوں نے سورتوں کو شمار کیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جا میں نے اس عورت کو تمہارے نکاح میں اس قرآن کے عوض میں دے دیا جو انہیں یاد ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 150790,
        "last_updated": null
    },
    {
        "urduURN": 4057920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5872,
        "hadithSanad": "ہم سے عبدالاعلیٰ بن حماد نے بیان کیا ، انہوں نے کہا ہم سے یزید بن زریع نے بیان کیا ، انہوں نے کہا ہم سے سعید بن ابی عروبہ نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے عجم کے کچھ لوگوں ( شاہان عجم ) کے پاس خط لکھنا چاہا تو آپ سے کہا گیا کہ عجم کے لوگ کوئی خط اس وقت تک نہیں قبول کرتے جب تک اس پر مہر لگی ہوئی نہ ہو ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم نے چاندی کی ایک انگوٹھی بنوائی ۔ جس پر یہ کندہ تھا ” محمد رسول اللہ “ گویا اس وقت آنحضرت صلی اللہ علیہ وسلم کی انگلی یا آپ کی ہتھیلی میں اس کی چمک دیکھ رہا ہوں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 150800,
        "last_updated": null
    },
    {
        "urduURN": 4057930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5873,
        "hadithSanad": "ہم سے محمد بن سلام بیکندی نے بیان کیا ، کہا ہم کو عبداللہ بن نمیر نے خبر دی ، انہیں عبیداللہ عمری نے ، انہیں نافع نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے چاندی کی ایک انگوٹھی بنوائی ۔ وہ انگوٹھی آپ کے ہاتھ میں ، اس کے بعد حضرت عمر رضی اللہ عنہ کے ہاتھ میں ، اس کے بعد حضرت عثمان رضی اللہ عنہ کے ہاتھ میں رہتی تھی لیکن ان کے زمانہ میں وہ اریس کے کنویں میں گر گئی اس کا نقش ” محمد رسول اللہ “ تھا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 150810,
        "last_updated": null
    },
    {
        "urduURN": 4057940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5874,
        "hadithSanad": "ہم سے ابو معمر نے بیان کیا ، کہا ہم سے عبدالوارث بن سعید نے بیان کیا ، کہا ہم سے عبدالعزیز بن صہیب نے بیان کیا ، ان سے حضرت انس رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ایک انگوٹھی بنوائی اور فرمایا کہ ہم نے ایک انگوٹھی بنوائی ہے اس پر لفظ ( محمد رسول اللہ ) کندہ کرایا ہے اس لیے انگوٹھی پرکوئی شخص یہ نقش نہ کندہ کرائے ۔ انس نے بیان کیا کہ جیسے اس انگوٹھی کی چمک آنحضرت صلی اللہ علیہ وسلم کی چھنگلیاں میں اب بھی میں دیکھ رہا ہوں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 150820,
        "last_updated": null
    },
    {
        "urduURN": 4057950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5875,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم نے روم ( کے بادشاہ کو ) خط لکھانا چاہا تو آپ سے کہا گیا کہ اگر آپ کے خط پر مہر نہ ہوئی تو وہ خط نہیں پڑھتے ۔ چنانچہ آپ نے چاندی کی ایک انگوٹھی بنوائی اس پر لفظ ” محمد رسول اللہ “ کندہ کرایا ۔ جیسے آنحضرت صلی اللہ علیہ وسلم کے ہاتھ میں اس کی سفیدی اب بھی میں دیکھ رہا ہوں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 150830,
        "last_updated": null
    },
    {
        "urduURN": 4057960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5876,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے جویریہ نے بیان کیا ، ان سے نافع نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے پہلے ایک سونے کی انگوٹھی بنوائی اور پہننے میں آپ اس کا رنگ اندر کی طرف رکھتے تھے ۔ آپ کی دیکھا دیکھی لوگوں نے بھی سونے کی انگوٹھیاں بنا لیں تو حضور اکرم صلی اللہ علیہ وسلم منبر پر تشریف لائے اور اللہ کی حمد و ثنا کی اور فرمایا میں نے بھی سونے کی انگوٹھی بنوائی تھی ( حرمت نازل ہونے کے بعد ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ اب میں اسے نہیں پہنوں گا ۔ پھر آپ نے وہ انگوٹھی پھینک دی اور لوگوں نے بھی اپنی سونے کی انگوٹھیوں کو پھینک دیا ۔ جویریہ نے بیان کیا کہ مجھے یہی یاد ہے کہ نافع نے ” داہنے ہاتھ میں “ بیان کیا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 150840,
        "last_updated": null
    },
    {
        "urduURN": 4057970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5877,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے حماد بن زید نے بیان کیا ، ان سے عبدالعزیز بن صہیب نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے چاندی کی ایک انگوٹھی بنوائی اور اس میں یہ نقش کھدوایا ” محمد رسول اللہ “ اور لوگوں سے کہہ دیا کہ میں نے چاندی کی ایک انگوٹھی بنوا کر اس پر محمد رسول اللہ نقش کروایا ہے ۔ اس لیے اب کوئی شخص یہ نقش اپنی انگوٹھی پر نہ کھدوائے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 150850,
        "last_updated": null
    },
    {
        "urduURN": 4057980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5878,
        "hadithSanad": "مجھ سے عبداللہ انصاری نے بیان کیا ، کہا کہ مجھ سے میرے والد عبداللہ بن مثنیٰ نے بیان کیا ، ان سے ثمامہ بن عبداللہ بن انس نے اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
        "hadithText": "حضرت ابوبکر رضی اللہ عنہ جب خلیفہ ہوئے تو انہوں نے مجھ کو زکوٰۃ کے مسائل لکھوا دیئے اور انگوٹھی ( مہر ) کا نقش تین سطروں میں تھا ایک سطر میں ” محمد “ دوسری سطر میں ” رسول “ اور تیسری سطر میں ” اللہ “ ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 150860,
        "last_updated": null
    },
    {
        "urduURN": 4057990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5879,
        "hadithSanad": "حضرت امام بخاری نے کہا کہ مجھ سے امام احمد بن حنبل نے اتنا اور روایت کیا ، کہا مجھ سے محمد بن عبداللہ انصاری نے ، کہا کہ مجھ سے میرے والد نے ، ان سے ثمامہ بن عبداللہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی انگوٹھی وفات تک آپ کے ہاتھ میں رہی ۔ آپ کے بعد ابوبکر رضی اللہ عنہ کے ہاتھ میں اور ابوبکر رضی اللہ عنہ کے بعد عمر رضی اللہ عنہ کے ہاتھ میں رہی پھر جب عثمان رضی اللہ عنہ کی خلافت کا زمانہ آیا تو وہ اریس کے کنویں پر ایک مرتبہ بیٹھے ، بیان کیا کہ پھر انگوٹھی نکالی اور اسے الٹنے پلٹنے لگے کہ اتنے میں وہ ( کنویں میں ) گر گئی ۔ انس رضی اللہ عنہ نے بیان کیا کہ پھر عثمان رضی اللہ عنہ کے ساتھ ہم تین دن تک اسے ڈھونڈتے رہے اور کنویں کا سارا پانی بھی کھینچ ڈالا لیکن وہ انگوٹھی نہیں ملی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 150870,
        "last_updated": null
    },
    {
        "urduURN": 4058000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5880,
        "hadithSanad": "ہم سے ابو عاصم نبیل نے بیان کیا ، انہوں نے کہا ہم کوابن جریج نے خبر دی ، انہوں نے کہا ہم کو حسن بن مسلم نے خبر دی ، انہیں طاؤس نے اور انہیں حضرت ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "میں عیدالفطر کی نماز میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ موجود تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے خطبہ سے پہلے نماز پڑھائی اور ابن وہب نے جریج سے یہ لفظ بڑھائے کہ پھر آنحضرت صلی اللہ علیہ وسلم عورتوں کے مجمع کی طرف گئے ( اور صدقہ کی ترغیب دلائی ) تو عورتیں حضرت بلال رضی اللہ عنہ کے کپڑے میں چھلے دار انگوٹھیاں ڈالنے لگیں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 150880,
        "last_updated": null
    },
    {
        "urduURN": 4058010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5881,
        "hadithSanad": "ہم سے محمد بن عرعرہ نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عدی بن ثابت نے ، ان سے سعید بن جبیر نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم عیدالفطر کے دن ( آبادی سے باہر ) گئے اور دو رکعت نماز پڑھائی آپ نے اس سے پہلے اور اس کے بعد کوئی دوسری نفل نمازنہیں پڑھی پھر آپ عورتوں کے مجمع کی طرف آئے اور انہیں صدقہ کا حکم فرمایا ۔ چنانچہ عورتیں اپنی بالیاں اور خوشبو اور مشک کے ہار صدقہ میں دینے لگیں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 150890,
        "last_updated": null
    },
    {
        "urduURN": 4058020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5882,
        "hadithSanad": "ہم سے اسحاق بن ابراہیم نے بیان کیا ، کہا ہم سے عبدہ بن سلیمان نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "حضرت اسماء رضی اللہ عنہا کا ہار ( جو ام المؤمنین رضی اللہ عنہا نے عاریت پر لیا تھا ) گم ہو گیا تو آنحضرت صلی اللہ علیہ وسلم نے اسے تلاش کرنے کے لیے چند صحابہ کو بھیجا اسی دوران میں نماز کا وقت ہو گیا اور لوگ بلا وضو تھے چونکہ پانی بھی موجود نہیں تھا ، اس لئے سب نے بلا وضو نماز پڑھی پھر آنحضرت صلی اللہ علیہ وسلم سے اس کا ذکر کیا تو تیمم کی آیت نازل ہوئی ۔ ابن نمیر نے یہ اضافہ کیا ، ان سے ہشام نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ وہ ہار انہوں نے حضرت اسماء سے عاریتاً لیا تھا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 150900,
        "last_updated": null
    },
    {
        "urduURN": 4058030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5883,
        "hadithSanad": "ہم سے حجاج بن منہال نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا کہ مجھے عدی بن ثابت نے خبر دی ، کہا کہ میں نے سعید بن جبیر سے سنا اور انہوں نے حضرت ابن عباس رضی اللہ عنہما سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے عید کے دن دو رکعتیں پڑھا ئیں نہ اس کے پہلے کوئی نماز پڑھی اور نہ اس کے بعدپھر آپ عورتوں کی طرف تشریف لائے ، آپ کے ساتھ حضرت بلال رضی اللہ عنہ تھے ۔ آپ نے عورتوں کو صدقہ کا حکم فرمایا تو وہ اپنی بالیاں حضرت بلال رضی اللہ عنہ کی جھولی میں ڈالنے لگیں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 150910,
        "last_updated": null
    },
    {
        "urduURN": 4058040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5884,
        "hadithSanad": "مجھ سے اسحاق بن ابراہیم حنظلی نے بیان کیا ، کہا ہم کو یحییٰ بن آدم نے خبر دی ، کہا ہم سے ورقاء بن عمر نے بیان کیا ، ان سے عبیداللہ بن ابی یزید نے ، ان سے نافع بن جبیر نے بیان ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں مدینہ کے بازاروں میں سے ایک بازار میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھا ۔ آنحضرت صلی اللہ علیہ وسلم واپس ہوئے تو میں پھر آپ صلی اللہ علیہ وسلم کے ساتھ واپس ہوا ، پھر آپ صلی اللہ علیہ وسلم نے فرمایا بچہ کہاں ہے ۔ یہ آپ نے تین مرتبہ فرمایا ۔ حسن بن علی کو بلاؤ ۔ حسن بن علی رضی اللہ عنہما آ رہے تھے اور ان کی گردن میں ( خوشبودار لونگ وغیرہ کا ) ہار پڑا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے اپنا ہاتھ اس طرح پھیلا یا کہ ( آپ حضرت حسن رضی اللہ عنہ کو گلے سے لگانے کے لیے ) اور حضرت حسن رضی اللہ عنہ نے بھی اپنا ہاتھ پھیلایا اور وہ آنحضرت صلی اللہ علیہ وسلم سے لپٹ گئے ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا اے اللہ ! میں اس سے محبت کرتا ہوں تو بھی اس سے محبت کر اور ان سے بھی محبت کر جو اس سے محبت رکھیں ۔ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم کے اس ارشاد کے بعد کوئی شخص بھی حضرت حسن بن علی رضی اللہ عنہما سے زیادہ مجھے پیارا نہیں تھا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 150920,
        "last_updated": null
    },
    {
        "urduURN": 4058050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5885,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے قتادہ نے ، ان سے عکرمہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ان مرودوں پر لعنت بھیجی جو عورتوں جیسا چال چلن اختیار کریں اور ان عورتوں پر لعنت بھیجی جو مردوں جیسا چال چلن اختیار کریں ۔ غندر کے ساتھ اس حدیث کو عمرو بن مرزوق نے بھی شعبہ سے روایت کیا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 150930,
        "last_updated": null
    },
    {
        "urduURN": 4058060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5886,
        "hadithSanad": "ہم سے معاذ بن فضالہ نے بیان کیا ، کہا ہم سے ہشام دستوائی نے ، ان سے یحییٰ بن ابی کثیر نے ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے مخنث مردوں پر اور مردوں کی چال چلن اختیار کرنے والی عورتوں پر لعنت بھیجی اور فرمایا کہ ان زنانہ بننے والے مردوں کو اپنے گھروں سے باہر نکال دو ۔ ابن عباس رضی اللہ عنہما نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے فلاں ہیجڑے کونکالاتھا اور عمر رضی اللہ عنہ نے فلاں ہیجڑے کو نکالا تھا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 150940,
        "last_updated": null
    },
    {
        "urduURN": 4058070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5887,
        "hadithSanad": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے زہیر نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، انہیں عروہ نے خبر دی ، انہیں زینب بنت ابی سلمہ رضی اللہ عنہا نے خبر دی اور انہیں حضرت ام سلمہ رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ان کے پاس تشریف رکھتے تھے ۔ گھر میں ایک مخنث بھی تھا ، اس نے ام سلمہ رضی اللہ عنہما کے بھائی عبداللہ رضی اللہ عنہ سے کہا عبداللہ ! اگر کل تمہیں طائف پر فتح حاصل ہو جائے تو میں تمہیں بنت غیلان ( بادیہ نامی ) کو دکھلاؤں گا وہ جب سامنے آتی ہے تو ( اس کے موٹاپے کی وجہ سے ) چار سلوٹیں دکھائی دیتی ہیں اور جب پیٹھ پھیر تی ہے تو آٹھ سلوٹیں دکھائی دیتی ہیں ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا اب یہ شخص تم لوگوں کے پاس نہ آیا کرے ۔ ابوعبداللہ ( حضرت امام بخاری ) نے کہا کہ سامنے سے چارسلوٹوں کا مطلب یہ ہے کہ ( موٹے ہونے کی وجہ سے ) اس کے پیٹ میں چار سلوٹیں پڑی ہوئی ہیں اور جب وہ سامنے آتی ہے تو وہ دکھائی دیتی ہیں اور آٹھ سلوٹوں سے پیچھے پھرتی ہے کا مفہوم ہے ( آگے کی ) ان چاروں سلوٹوں کے کنارے کیونکہ یہ دونوں پہلوؤں کو گھیرے ہوئے ہوتے ہیں اور پھر وہ مل جاتی ہیں اور حدیث میں ” بثمان “ کا لفظ ہے حالانکہ از روئے قائدہ نحو کے ” بثمانیۃ “ ہونا تھا کیونکہ مراد آٹھ اطراف یعنی کنارے ہیں اور اطراف طرف کی جمع ہے اور طرف کا لفظ مذکر ہے ۔ مگر چونکہ اطراف کا لفظ مذکور نہ تھا اس لیے بثمان بھی کہنا درست ہوا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 150950,
        "last_updated": null
    },
    {
        "urduURN": 4058080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5888,
        "hadithSanad": "ہم سے مکی بن ابراہیم نے بیان کیا ، ان سے حنظلہ بن ابی ہانی نے ، ان سے نافع نے بیان کیا ، ( مصنف حضرت امام بخاری نے ) کہا کہ اس حدیث کو ہمارے اصحاب نے مکی سے روایت کیا ، انہوں نے بحوالہ ابن عمر رضی اللہ عنہما کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا مونچھ کے بال کتروانا پیدائشی سنت ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 150960,
        "last_updated": null
    },
    {
        "urduURN": 4058090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5889,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا کہ زہری نے ہم سے بیان کیا ( سفیان نے کہا ) ہم سے زہری نے سعید بن مسیب سے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے ( نبی کریم صلی اللہ علیہ وسلم سے ) روایت کیاکہ",
        "hadithText": "پانچ چیزیں ( فرمایا کہ ) پانچ چیزیں ختنہ کرانا ، موئے زیر ناف مونڈنا ، بغل کے بال نوچنا ، ناخن ترشوانا اور مونچھ کم کرانا پیدائشی سنتوں میں سے ہیں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 150970,
        "last_updated": null
    },
    {
        "urduURN": 4058100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5890,
        "hadithSanad": "ہم سے احمد بن ابی رجاء نے بیان کیا ، انہوں نے کہا ہم سے اسحاق بن سلیمان نے بیان کیا ، انہوں نے کہا کہ میں نے حنظلہ سے سنا ، انہوں نے نافع سے بیان کیا اور انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا موئے زیر ناف مونڈنا ، ناخن ترشوانا اور مونچھ کترانا پیدائشی سنتیں ہیں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 150980,
        "last_updated": null
    },
    {
        "urduURN": 4058110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5891,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، انہوں نے کہا ہم سے ابراہیم بن سعد نے بیان کیا ، انہوں نے کہا ہم سے ابن شہاب نے بیان کیا ، ان سے سعید بن مسیب نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سناآپ نے فرمایا کہ پانچ چیزیں ختنہ کرانا ، زیر ناف مونڈنا ، مونچھ کترانا ، ناخن ترشوانا اور بغل کے بال نوچنا پیدائشی سنتیں ہیں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 150990,
        "last_updated": null
    },
    {
        "urduURN": 4058120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5892,
        "hadithSanad": "ہم سے محمد بن منہال نے بیان کیا ، انہوں نے کہا ہم سے یزید بن زریع نے ، انہوں نے کہا ہم سے عمر بن محمد بن زید نے بیان کیا ، ان سے نافع نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تم مشرکین کے خلاف کرو ، داڑھی چھوڑ دو اور مونچھیں کترواؤ ۔ عبداللہ بن عمر رضی اللہ عنہما جب حج یا عمرہ کرتے تو اپنی داڑھی ( ہاتھ سے ) پکڑ لیتے اور ( مٹھی ) سے جو بال زیادہ ہوتے انہیں کتروا دیتے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 151000,
        "last_updated": null
    },
    {
        "urduURN": 4058130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5893,
        "hadithSanad": "مجھ سے محمد نے حدیث بیان کی ، انہوں نے کہا ہمیں عبدہ نے خبر دی ، انہیں عبیداللہ بن عمر نے خبر دی ، انہیں نافع نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، مونچھیں خوب کتروایا لیا کرو اورداڑھی کو بڑھاؤ ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 151010,
        "last_updated": null
    },
    {
        "urduURN": 4058140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5894,
        "hadithSanad": "ہم سے معلی بن اسد نے بیان کیا ، کہا ہم سے وہیب نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے محمد بن سیرین نے بیان کیا کہ",
        "hadithText": "میں نے حضرت انس رضی اللہ عنہ سے پوچھا کیا نبی کریم صلی اللہ علیہ وسلم نے خضاب استعمال کیا تھا ۔ بولے کہ آنحضرت صلی اللہ علیہ وسلم کے بال ہی بہت کم سفید ہوئے تھے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 151020,
        "last_updated": null
    },
    {
        "urduURN": 4058150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5895,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ثابت نے بیان کیا کہ",
        "hadithText": "حضرت انس رضی اللہ عنہ سے نبی کریم صلی اللہ علیہ وسلم کے خضاب کے متعلق سوال کیا گیا تو احول نے کہا کہ آنحضرت صلی اللہ علیہ وسلم کو خضاب کی نوبت ہی نہیں آئی تھی اگر میں آپ کی داڑھی کے سفید بال گننا چاہتا تو گن سکتا تھا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 151030,
        "last_updated": null
    },
    {
        "urduURN": 4058160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5896,
        "hadithSanad": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے اسرائیل نے بیان کیا ، ان سے عثمان بن عبداللہ بن وہب نے بیان کیا کہ",
        "hadithText": "میرے گھر والوں نے حضرت ام سلمہ رضی اللہ عنہا کے پاس پانی کا ایک پیالہ لے کر بھیجا ( راوی حدیث ) اسرائیل راوی نے تین انگلیاں بند کر لیں یعنی وہ اتنی چھوٹی پیالی تھی اس پیالی میں بالوں کا ایک گچھا تھا جس میں نبی کریم صلی اللہ علیہ وسلم کے بالوں میں سے کچھ بال تھے ۔ عثمان نے کہا جب کسی شخص کو نظر لگ جاتی یا اور کوئی بیماری ہوتی تو وہ اپنا برتن پانی کا بی بی حضرت ام سلمہ رضی اللہ عنہا کے پاس بھیج دیتا ۔ ( وہ اس میں آنحضرت صلی اللہ علیہ وسلم کے بال ڈبو دیتیں ) عثمان نے کہا کہ میں نلکی کو دیکھا ( جس میں موئے مبارک رکھے ہوئے تھے ) تو سرخ سرخ بال دکھائی دیئے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 113,
        "matchingArabicURN": 151040,
        "last_updated": null
    },
    {
        "urduURN": 4058170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5897,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے سلام بن ابی مطیع نے بیان کیا ، ان سے عثمان بن عبداللہ بن موہب نے کہ",
        "hadithText": "میں حضرت ام سلمہ رضی اللہ عنہا کی خدمت میں حاضر ہوا تو انہوں نے ہمیں نبی کریم صلی اللہ علیہ وسلم کے چند بال نکال کر دکھائے جن پر خضاب لگا ہوا تھا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 114,
        "matchingArabicURN": 151050,
        "last_updated": null
    },
    {
        "urduURN": 4058180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5898,
        "hadithSanad": "اور ہم سے ابونعیم نے بیان کیا ، ان سے نصیر بن ابی الاشعث نے بیان کیا ، ان سے عبداللہ بن موہب نے کہ",
        "hadithText": "حضرت ام سلمہ رضی اللہ عنہا نے انہیں نبی کریم صلی اللہ علیہ وسلم کا بال دکھایاجو سرخ تھا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 115,
        "matchingArabicURN": 151060,
        "last_updated": null
    },
    {
        "urduURN": 4058190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5899,
        "hadithSanad": "ہم سے عبداللہ بن زبیر حمیدی نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، کہا ہم سے زہری نے بیان کیا ان سے ابوسلمہ اور سلیمان بن یسار نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "یہود و نصاریٰ خضاب نہیں لگاتے تم ان کے خلاف کرو یعنی خضاب کیا کرو ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 116,
        "matchingArabicURN": 151070,
        "last_updated": null
    },
    {
        "urduURN": 4058200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5900,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک بن انس نے بیان کیا ، ان سے ربیعہ بن عبدالرحمٰن نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے ، انہوں نے ان سے سنا کہ وہ بیان کر رہے تھے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم بہت لمبے نہیں تھے اور نہ آپ چھوٹے قد کے ہی تھے ( بلکہ آپ کا بیچ والا قد تھا ) نہ آپ بالکل سفید بھورے تھے اور نہ گندم گوں ہی تھے ، آپ کے بال گھونگھر یالے الجھے ہوئے نہیں تھے اور نہ بالکل سیدھے لٹکے ہوئے تھے ۔ اللہ تعالیٰ نے آپ کو چالیس سال کی عمر میں رسول بنایا دس سال آپ نے ( نبوت کے بعد ) مکہ مکرمہ میں قیام کیا اور دس سال مدینہ منورہ میں اور تقریباً ساٹھ سا ل کی عمر میں اللہ تعالیٰ نے آپ کو وفات دی ۔ وفات کے وقت آپ کے سر اور داڑھی میں بیس بال بھی سفید نہیں تھے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 117,
        "matchingArabicURN": 151080,
        "last_updated": null
    },
    {
        "urduURN": 4058210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5901,
        "hadithSanad": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے اسرائیل نے ، ان سے ابواسحاق نے ، کہا میں براء رضی اللہ عنہ سے سنا ، انہوں نے بیان کہا کہ",
        "hadithText": "میں نے سرخ حلہ میں نبی کریم صلی اللہ علیہ وسلم سے زیادہ کسی کو خوبصورت نہیں دیکھا ( امام بخاری نے کہا کہ ) مجھ سے میرے بعض اصحاب نے امام مالک سے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم کے سر کے بال شانہ مبارک کے قریب تک تھے ۔ ابواسحاق نے بیان کیا کہ میں نے براء رضی اللہ عنہ کو ایک مرتبہ سے زیادہ یہ حدیث بیان کرتے سنا جب بھی وہ یہ حدیث بیان کرتے تو مسکراتے ۔ اس روایت کی متابعت شعبہ نے کی کہ آنحضرت صلی اللہ علیہ وسلم کے بال آپ کے کانوں کی لو تک تھے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 118,
        "matchingArabicURN": 151090,
        "last_updated": null
    },
    {
        "urduURN": 4058220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5902,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں نافع نے اور انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا رات کعبہ کے پاس مجھے دیکھایا گیا ، میں نے دیکھا کہ ایک صاحب ہیں گندمی رنگ ، گندمی رنگ کے لوگوں میں سب سے زیادہ خوبصورت ، ان کے شانوں تک لمبے لمبے بال ہیں ایسے بال والے لوگوں میں سب سے زیادہ خوبصورت ، انہوں نے بالوں میں کنگھا کر رکھا ہے اور اس کی وجہ سے سر سے پانی ٹپک رہا ہے ۔ دو آدمیوں کا سہارا لئے ہوئے ہیں یا دو آدمیوں کے شانوں کا سہارا لئے ہوئے ہیں اور خانہ کعبہ کا طواف کر رہے ہیں ، میں نے پوچھا کہ یہ کون بزرگ ہیں تو مجھے بتایا گیا کہ یہ حضرت عیسیٰ ابن مریم علیہ السلام ہیں پھر اچانک میں نے ایک الجھے ہوئے گھونگھریالے بال والے شخص کو دیکھا ، دائیں آنکھ سے کانا تھا گویا انگور ہے جو ابھرا ہوا ہے ۔ میں نے پوچھا یہ کانا کون ہے ؟ مجھے بتایا گیا کہ یہ مسیح دجال ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 119,
        "matchingArabicURN": 151100,
        "last_updated": null
    },
    {
        "urduURN": 4058230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5903,
        "hadithSanad": "ہم سے اسحاق بن منصور نے بیان کیا ، کہا ہم کو حبان نے خبر دی ، کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، کہا ہم سے قتادہ نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم کے بال مونڈھوں تک پہنچتے تھے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 120,
        "matchingArabicURN": 151110,
        "last_updated": null
    },
    {
        "urduURN": 4058240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5904,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
        "hadithText": "بنی کریم صلی اللہ علیہ وسلم کے ( سر کے ) بال مونڈھوں تک پہنچتے تھے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 121,
        "matchingArabicURN": 151120,
        "last_updated": null
    },
    {
        "urduURN": 4058250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5905,
        "hadithSanad": "مجھ سے عمرو بن علی نے بیان کیا ، کہا ہم سے وہب بن جریر نے ، کہا کہ مجھ سے میرے والد نے بیان کیا ، ان سے قتادہ نے بیان کیا کہ",
        "hadithText": "میں نے حضرت انس بن مالک رضی اللہ عنہ سے رسول اللہ صلی اللہ علیہ وسلم کے بالوں کے متعلق پوچھا تو انہوں نے کہا کہ آپ کے بال درمیانہ تھے ، نہ بالکل سیدھے لٹکے ہوئے اور نہ گھونگھر یالے اور وہ کانوں اور مونڈھوں کے بیچ تک تھے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 122,
        "matchingArabicURN": 151130,
        "last_updated": null
    },
    {
        "urduURN": 4058260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5906,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے ہاتھ بھرے ہوئے تھے میں نے آنحضرت صلی اللہ علیہ وسلم کے بعد آپ جیسا ( خوبصورت کوئی آدمی ) نہیں دیکھا آپکے سر کے بال میانہ تھے نہ گھونگھر یالے اور نہ بالکل سیدھے لٹکے ہوئے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 123,
        "matchingArabicURN": 151140,
        "last_updated": null
    },
    {
        "urduURN": 4058270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5907,
        "hadithSanad": "ہم سے ابو النعمان نے بیان کیا ، کہا ہم سے جریر بن حازم نے بیان کی ، ان سے قتادہ نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے ہاتھ اور پاؤں بھرے ہوئے تھے ۔ چہرہ حسین و جمیل تھا ، میں نے آپ جیسا خوبصورت کوئی نہ پہلے دیکھا اور نہ بعد میں ، آپ کی ہتھیلیاں کشادہ تھیں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 124,
        "matchingArabicURN": 151150,
        "last_updated": null
    },
    {
        "urduURN": 4058280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عمرو بن علی نے بیان کیا ، کہا ہم سے معاذ بن ہانی نے بیان کیا ، کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے یا ایک آدمی نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم بھرے ہوئے قدموں والے تھے ۔ نہایت ہی حسین و جمیل ۔ آپ جیسا خوبصورت میں نے آپ کے بعد کسی کو نہیں دیکھا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 125,
        "matchingArabicURN": 151161,
        "last_updated": null
    },
    {
        "urduURN": 4058290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5910,
        "hadithSanad": "اور ہشام نے بیان کیا ، ان سے معمر نے ، ان سے قتادہ نے اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
        "hadithText": "بنی کریم صلی اللہ علیہ وسلم کے قدم اور ہتھیلیاں بھری ہوئی اور گداز تھیں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 126,
        "matchingArabicURN": 151180,
        "last_updated": null
    },
    {
        "urduURN": 4058300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "اور ابوہلال نے بیان کیا ، ان سے قتادہ نے بیان کیا اور ان سے حضرت انس رضی اللہ عنہ یا حضرت جابر بن عبداللہ رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی ہتھیلیاں اور قدم بھرے ہوئے تھے آپ جیسا پھر میں نے کوئی خوبصورت آدمی نہیں دیکھا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 127,
        "matchingArabicURN": 151191,
        "last_updated": null
    },
    {
        "urduURN": 4058310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5913,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا کہ مجھ سے ابن ابی عدی نے بیان کیا ، ان سے ابن عون نے اور ان سے مجاہد نے بیان کیا کہ",
        "hadithText": "ہم حضرت ابن عباس رضی اللہ عنہما کے پاس بیٹھے ہوئے تھے ۔ لوگوں نے دجال کا ذکر کیا اور کسی نے کہا کہ اس کی دونوں آنکھوں کے درمیان لفظ ” کافر “ لکھا ہو گا ۔ اس پر حضرت ابن عباس رضی اللہ عنہما نے کہا کہ رسول کریم صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے میں نے تو نہیں سنا البتہ آپ نے یہ فرمایا تھا کہ اگر تمہیں حضرت ابراہیم علیہ السلام کو دیکھنا ہو تو اپنے صاحب ( خود آنحضرت صلی اللہ علیہ وسلم ) کو دیکھو ( کہ آپ بالکل ان کے ہم شکل ہیں ) اور حضرت موسیٰ علیہ السلام گندمی رنگ کے ہیں بال گھونگھریالے جیسے اس وقت بھی میں انہیں دیکھ رہا ہوں کہ وہ اس نالے وادی ازرق نامی میں لبیک کہتے ہوئے اتر رہے ہیں ان کے سرخ اونٹ کی نکیل کی رسی کھجور کی چھال کی ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 128,
        "matchingArabicURN": 151210,
        "last_updated": null
    },
    {
        "urduURN": 4058320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5914,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے کہا کہ مجھے سالم بن عبداللہ نے خبر دی اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نے حضرت عمر رضی اللہ عنہ سے سنا ، انہوں نے کہا کہ جو شخص سر کے بالوں کو گوندلے ( وہ حج یا عمرے سے فارغ ہو کر سر منڈائے ) اور جیسے احرام میں بالوں کو جمالیتے ہیں غیر احرام میں نہ جماؤ اور حضرت ابن عمر رضی اللہ عنہما کہتے تھے میں نے تو آنحضرت صلی اللہ علیہ وسلم کو بال جماتے دیکھا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 129,
        "matchingArabicURN": 151220,
        "last_updated": null
    },
    {
        "urduURN": 4058330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5915,
        "hadithSanad": "مجھ سے حبان بن موسیٰ اور احمد بن محمد نے بیان کیا ، انہوں نے کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی ، انہوں نے کہا ہم کو یونس نے خبر دی ، انہیں زہری نے ، انہیں سالم نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ نے اپنے بال جمالیے تھے اور احرام کے وقت یوں آپ لبیک کہہ رہے تھے ۔ ” لبیک اللھم لبیک لبیک لا شریک لک لبیک ان الحمد والنعمۃ لک والملک لا شریک لک “ ان کلمات کے اوپر اور کچھ آپ نہیں بڑھاتے تھے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 130,
        "matchingArabicURN": 151230,
        "last_updated": null
    },
    {
        "urduURN": 4058340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5916,
        "hadithSanad": "مجھ سے اسماعیل بن ابن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے نافع نے ، ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت حفصہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میں نے عرض کیا یا رسول اللہ ! کیا بات ہے کہ لوگ عمرہ کر کے احرام کھول چکے ہیں حالانکہ آپ نے احرام نہیں کھولا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کیونکہ میں نے اپنے سر کے بال جمالیے ہیں اور اپنی ہدی ( قربانی کے جانور ) کے گلے میں قلادہ ڈال دیا ہے ۔ اس لیے جب تک میری قربانی کا نحر نہ ہولے میں احرام نہیں کھول سکتا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 131,
        "matchingArabicURN": 151240,
        "last_updated": null
    },
    {
        "urduURN": 4058350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5917,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، انہوں نے کہا ہم سے ابراہیم بن سعد نے بیان کیا ، انہوں نے کہا ہم سے شہاب نے بیان کیا ، ان سے عبیداللہ بن عبداللہ نے بیان کیا اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کو اگر کسی مسئلہ میں کوئی حکم معلوم نہ ہوتا تو آپ اس میں اہل کتاب کے عمل کو اپناتے تھے ۔ اہل کتاب اپنے سر کے بال لٹکائے رکھتے اور مشرکین مانگ نکالتے تھے ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم بھی ( اہل کتاب کی موافقت میں ) پہلے سر کے بال پیشانی کی طرف لٹکاتے لیکن بعد میں آپ بیچ میں سے مانگ نکالنے لگے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 132,
        "matchingArabicURN": 151250,
        "last_updated": null
    },
    {
        "urduURN": 4058360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5918,
        "hadithSanad": "ہم سے ابو الولید اور عبداللہ بن رجاء نے بیان کیا ، ان دونوں نے کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے حکم بن عتیبہ نے ، ان سے ابراہیم نخعی نے ، ان سے اسود نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا",
        "hadithText": "جیسے میں اب بھی آنحضرت صلی اللہ علیہ وسلم کی مانگ میں احرام کی حالت میں خوشبو کی چمک دیکھ رہی ہوں ۔ حضرت عبداللہ بن رجاء نے ( اپنی روایت میں ) ” مفرق النبی کریم صلی اللہ علیہ وسلم “ ( واحد کے صیغہ کے ساتھ ) بیان کیا یعنی مانگوں کی جگہ صرف لفظ مانگ استعمال کیا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 133,
        "matchingArabicURN": 151260,
        "last_updated": null
    },
    {
        "urduURN": 4058370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5919,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے فضل بن عنبسہ نے بیان کیا ، کہا ہم کو ہشیم بن بشیر نے خبر دی ، کہا ہم کو ابوالبشر جعفر نے خبر دی ( دوسری سند ) امام بخاری نے کہا اور ہم سے قریبہ بن سعید نے کہا کہ ہم سے ہشیم نے بیان کیا ، ان سے ابو بشر نے ، ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نے ایک رات اپنی خالہ ام المؤمنین میمونہ بنت حارث رضی اللہ عنہا کے گھر گزاری ، رسول اللہ صلی اللہ علیہ وسلم کے لیے اس رات انہیں کے ہاں باری تھی ۔ ابن عباس رضی اللہ عنہما نے بیان کیا کہ پھر حضور اکرم صلی اللہ علیہ وسلم رات کی نماز پڑھنے کھڑے ہوئے تو میں بھی آپ کے بائیں کھڑا ہو گیا ۔ ابن عباس رضی اللہ عنہما نے بیان کیا کہ اس پر آنحضرت صلی اللہ علیہ وسلم نے میرے سرکے بالوں کی ایک لٹ پکڑی اور مجھے اپنی داہنی طرف کر دیا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 134,
        "matchingArabicURN": 151271,
        "last_updated": null
    },
    {
        "urduURN": 4058380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5920,
        "hadithSanad": "مجھ سے محمد بن سلام نے بیان کیا ، کہا کہ مجھے مخلد بن یزید نے خبر دی ، کہا کہ مجھے ابن جریج نے خبر دی ، کہا کہ مجھے عبیداللہ بن حفص نے خبر دی ، انہیں عمرو بن نافع نے خبر دی ، انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما کے غلام نافع نے کہ انہوں نے حضرت ابن عمر رضی اللہ عنہما سے سنا ، وہ بیان کرتے تھے کہ",
        "hadithText": "میں نے رسول کریم صلی اللہ علیہ وسلم سے سنا ہے آپ نے ” قزع “ سے منع فرمایا ، عبیداللہ کہتے ہیں کہ میں نے نافع سے پوچھا کہ قزع کیا ہے ؟ پھر عبیداللہ نے ہمیں اشارہ سے بتایا کہ نافع نے کہا کہ بچہ کا سر منڈاتے وقت کچھ یہاں چھوڑدے اور کچھ بال وہاں چھوڑ دے ۔ ( تو اسے قزع کہتے ہیں ) اسے عبیداللہ نے پیشانی اورسرکے دونوں کناروں کی طرف اشارہ کر کے ہمیں اس کی صورت بتائی ۔ عبیداللہ نے اس کی تفسیر ےوں بیان کی یعنی پیشانی پر کچھ بال چھوڑ دیئے جائیں اور سر کے دونوں کونوں پر کچھ بال چھوڑ دیئے جائیں پھر عبیداللہ سے پوچھا گیا کہ اس میں لڑکا اورلڑکی دونوں کا ایک ہی حکم ہے ؟ فرمایا کہ مجھے معلوم نہیں ۔ نافع نے صرف لڑکے کا لفظ کہا تھا ۔ عبیداللہ نے بیان کیا کہ میں نے عمرو بن نافع سے دوبارہ اس کے متعلق پوچھا تو انہوں نے کہا کہ لڑکے کی کنپٹی یا گدی پر چوٹی کے بال اگر چھوڑ دیئے جائیں تو کوئی حرج نہیں ہے لیکن ” قزع “ یہ ہے کہ پیشانی پر بال چھوڑ دیئے جائیں اورباقی سب منڈوائے جائیں اسی طرح سر کے اس جانب میں اور اس جانب میں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 135,
        "matchingArabicURN": 151290,
        "last_updated": null
    },
    {
        "urduURN": 4058390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5921,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، انہوں نے کہا ہم سے عبداللہ بن مثنیٰ بن عبداللہ بن انس بن مالک نے بیان کیا ، انہوں نے کہا ہم سے عبداللہ بن دینار نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے ” قزع “ سے منع فرمایا تھا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 136,
        "matchingArabicURN": 151300,
        "last_updated": null
    },
    {
        "urduURN": 4058400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5922,
        "hadithSanad": "مجھ سے احمد بن محمد مروزی نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو یحییٰ بن سعید انصاری نے خبر دی ، انہیں عبدالرحمٰن بن قاسم نے خبر دی ، انہیں ان کے والد قاسم بن محمد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم کو آپ کے احرام میں رہنے کے لیے اپنے ہاتھ سے خوشبو لگائی میں نے اسی طرح ( دسویں تاریخ کو ) منیٰ میں طواف زیارت کرنے سے پہلے اپنے ہاتھ سے آپ کو خوشبو لگائی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 137,
        "matchingArabicURN": 151310,
        "last_updated": null
    },
    {
        "urduURN": 4058410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5923,
        "hadithSanad": "ہم سے اسحاق بن نصر نے بیان کیا ، کہا ہم سے یحییٰ بن آدم نے بیان کیا ، کہا ہم سے اسرائیل نے بیان کیا ، ان سے ابواسحاق نے ، انہیں عبدالرحمٰن بن اسود نے ، انہیں ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کو سب سے عمدہ خوشبو لگایا کرتی تھی ۔ یہا ں تک کہ خوشبو کی چمک میں آپ کے سراور آپ کی داڑھی میں دیکھتی تھی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 138,
        "matchingArabicURN": 151320,
        "last_updated": null
    },
    {
        "urduURN": 4058420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5924,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے ابن ابی ذئب نے بیان کیا ، ان سے زہری نے ، ان سے سہل بن سعد رضی اللہ عنہ نے کہ",
        "hadithText": "ایک صاحب نے نبی کریم صلی اللہ علیہ وسلم کے دیوار کے ایک سوراخ سے گھر کے اندر دیکھا آنحضرت صلی اللہ علیہ وسلم اس وقت اپنا سر کنگھے سے کھجلا رہے تھے پھر آپ نے فرمایا کہ اگرمجھے معلوم ہوتا کہ تم جھانک رہے ہو تو میں تمہاری آنکھ پھوڑ دیتا ارے اذن لینا تو اس کے لیے ہے کہ آدمی کی نظر ( کسی کے ) ستر پر نہ پڑے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 139,
        "matchingArabicURN": 151330,
        "last_updated": null
    },
    {
        "urduURN": 4058430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5925,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا ، انہوں نے کہا ہم کو امام مالک نے خبر دی ، انہیں ابن شہاب نے خبر دی ، انہیں عروہ بن زبیر نے اور ان سے ام المؤمنین حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میں حالت حیض کے باوجود آنحضرت صلی اللہ علیہ وسلم کے سر میں کنگھا کرتی تھی ۔ ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں ہشام نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے اسی طرح یہ حدیث بیان کی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 140,
        "matchingArabicURN": 151341,
        "last_updated": null
    },
    {
        "urduURN": 4058440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5926,
        "hadithSanad": "ہم سے ابو الولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے اشعث بن سلیم نے ، ان سے ان کے والد نے ، ان سے مسروق نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ہر کام میں جہاں تک ممکن ہوتاداہنی طرف سے شروع کرنے کو پسند فرماتے تھے ، کنگھا کرنے اوروضو کرنے میں بھی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 141,
        "matchingArabicURN": 151360,
        "last_updated": null
    },
    {
        "urduURN": 4058450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5927,
        "hadithSanad": "مجھ سے عبداللہ بن محمد ہمدانی نے بیان کیا ، کہا ہم سے ہشام بن یوسف صنعانی نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں سعید بن المسیب نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( کہ اللہ تعالیٰ نے فرمایا ) ابن آدم کا ہر عمل اس کا ہے سوا روزہ کے کہ یہ میرا ہے اور میں خود اس کا بدلہ دوں گا اور روزہ دار کے منہ کے خوشبو اللہ کے نزدیک مشک کی خوشبو سے بھی بڑھ کر ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 142,
        "matchingArabicURN": 151370,
        "last_updated": null
    },
    {
        "urduURN": 4058460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5928,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے وہیب نے بیان کیا ، ان سے ہشام بن عروہ نے بیان کیا ، ان سے عثمان بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میں نے رسول کریم صلی اللہ علیہ وسلم کو آپ کے احرام کے وقت عمدہ سے عمدہ دخوشبو جو مل سکتی تھی ، وہ لگاتی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 143,
        "matchingArabicURN": 151380,
        "last_updated": null
    },
    {
        "urduURN": 4058470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5929,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے عروہ بن ثابت انصاری نے بیان کیا ، کہا کہ مجھ سے ثمامہ بن عبداللہ نے بیان کیا اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
        "hadithText": "( جب ان کو ) خوشبو ( ہدیہ کی جاتی تو ) آپ وہ واپس نہیں کیا کرتے تھے اور کہتے کہ نبی کریم صلی اللہ علیہ وسلم بھی خوشبو کو واپس نہیں فرمایا کرتے تھے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 144,
        "matchingArabicURN": 151390,
        "last_updated": null
    },
    {
        "urduURN": 4058480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5930,
        "hadithSanad": "ہم سے عثمان بن ہشیم نے بیان کیا یا محمد بن یحییٰ دیلی نے ، انہیں عثمان بن ہشیم نے ( امام بخاری کو شک ہے ) ان سے ابن جریج نے انہوں نے کہا مجھ کو عمر بن عبداللہ بن عروہ بن شہر نے خبر دی ، انہوں نے عروہ اور قاسم دونوں سے سنا ، وہ دونوں ام المؤمنین حضرت عائشہ رضی اللہ عنہا سے نقل کرتے تھے کہ انہوں نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو حجۃ الوداع کے موقع پر احرام کھولنے اور احرام باندھنے کے وقت اپنے ہاتھ سے ذریرہ ( ایک قسم کی مرکب ) خوشبو لگائی تھی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 145,
        "matchingArabicURN": 151400,
        "last_updated": null
    },
    {
        "urduURN": 4058490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5931,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے جریر بن عبدالحمید نے بیان کیا ، ان سے منصور بن معتمر نے ، ان سے ابراہیم نخعی نے ، ان سے علقمہ نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے کہ",
        "hadithText": "اللہ تعالیٰ نے حسن کے لیے گودنے والیوں ، گدوانے والیوں پر اور چہرے کے بال اکھاڑنے والیوں پر اور دانتوں کے درمیان کشادگی پیدا کرنے والیوں پر ، جو اللہ کی خلقت کو بدلیں ان سب پر لعنت بھیجی ہے ، میں بھی کیوں نہ ان لوگوں پر لعنت کروں جن پر رسول کریم صلی اللہ علیہ وسلم نے لعنت کی ہے اور اس کی دلیل کہ آنحضرت صلی اللہ علیہ وسلم کی لعنت خود قرآن مجید میں موجود ہے ۔ آیت ” وما اتٰکم الرسول فخذوہ “ ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 146,
        "matchingArabicURN": 151410,
        "last_updated": null
    },
    {
        "urduURN": 4058500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5932,
        "hadithSanad": "ہم سے اسماعیل بن ابی شیبہ نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابن شہاب نے ، ان سے حمید بن عبدالرحمٰن بن عوف اور انہوں نے",
        "hadithText": "حضرت معاویہ بن ابی سفیان رضی اللہ عنہ سے حج کے سال میں سنا وہ مدینہ منورہ میں منبر پر یہ فرما رہے تھے انہوں نے بالوں کی ایک چوٹی جو ان کے چوکیدار کے ہاتھ میں تھی لے کر کہا کہاں ہیں تمہارے علماء میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے آپ اس طرح بال بنانے سے منع فرما رہے تھے اور فرما رہے تھے کہ بنی اسرائیل اس وقت تباہ ہو گئے جب ان کی عورتوں نے اس طرح اپنے بال سنو ارنے شروع کر دیئے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 147,
        "matchingArabicURN": 151420,
        "last_updated": null
    },
    {
        "urduURN": 4058510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5933,
        "hadithSanad": "اور ابن ابی شیبہ نے بیان کیا ، ان سے یونس بن محمد نے بیان کیا ، ان سے فلیح نے بیان کیا ، ان سے زید بن اسلم نے ، ان سے عطاء بن یسار نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا سرکے قدرتی بالوں میں مصنوعی بال لگانے والیوں پر اور لگوانے والیوں پر اور گودنے والیوں پر اور گدوانے والیوں پر اللہ نے لعنت بھیجی ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 148,
        "matchingArabicURN": 151430,
        "last_updated": null
    },
    {
        "urduURN": 4058520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5934,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عمرو بن مرہ نے بیان کیا کہ میں نے حسن بن مسلم بن نیاق سے سنا ، وہ صفیہ بنت شیبہ سے بیان کرتے تھے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "انصار کی ایک لڑکی نے شادی کی ۔ اس کے بعد وہ بیمار ہو گئی اور اس کے سرکے بال جھڑگئے ، اس کے گھر والوں نے چاہا کہ اس کے بالوں میں مصنوعی بال لگادیں ۔ اس لئے انہوں نے نبی کریم صلی اللہ علیہ وسلم سے اس کے متعلق پوچھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ نے مصنوعی بال جوڑنے والی اور جوڑوانے والی دونوں پر لعنت بھیجی ہے ۔ شعبہ کے ساتھ اس حدیث کو محمد بن اسحاق نے بھی ابان بن صالح سے ، انہوں نے حسن بن مسلم سے ، انہوں نے صفیہ سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 149,
        "matchingArabicURN": 151440,
        "last_updated": null
    },
    {
        "urduURN": 4058530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5935,
        "hadithSanad": "مجھ سے احمد بن مقدام نے بیان کیا ، کہا ہم سے فضل بن سلیمان نے بیان کیا ، کہا ہم سے منصور بن عبدالرحمٰن نے بیان کیا ، کہا کہ مجھ سے میری والدہ صفیہ بنت شیبہ نے بیان کیا ، ان سے حضرت اسماء بنت ابی بکر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ایک خاتون نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور کہا کہ میں نے اپنی لڑکی کی شادی کی ہے اس کے بعد وہ بیمار ہو گئی اور اس کے سر کے بال جھڑگئے اور اس کا شوہر مجھ پر اس کے معاملہ میں زور دیتا ہے ۔ کیا میں اس کے سر میں مصنوعی بال لگا دوں ؟ اس پر آنحضرت صلی اللہ علیہ وسلم نے مصنوعی بال جوڑنے والیوں اور جڑوانے والیوں کو برا کہا ۔ ان پر لعنت بھیجی ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 150,
        "matchingArabicURN": 151450,
        "last_updated": null
    },
    {
        "urduURN": 4058540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5936,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کی بیوی فاطمہ نے ، ان سے اسماء بنت ابی بکر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے مصنوعی بال لگانے والی اور لگوانے والی پر لعنت بھیجی ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 151,
        "matchingArabicURN": 151460,
        "last_updated": null
    },
    {
        "urduURN": 4058550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5937,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو حضرت عبداللہ بن مبارک نے خبر دی ، کہا ہم کو عبیداللہ عمری نے خبر دی ، انہیں نافع نے اور انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اللہ نے مصنوعی بال جوڑنے والیوں پر ، جڑوانے والیوں پر ، گودنے والیوں پر اور گدوانے والیوں پر لعنت بھیجی ہے ۔ نافع نے کہا کہ ” گودنا کبھی مسوڑے پر بھی گودا جاتا ہے ۔ “</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 152,
        "matchingArabicURN": 151470,
        "last_updated": null
    },
    {
        "urduURN": 4058560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5938,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے عمرو بن مرہ نے بیان کیا کہ میں نے سعید بن مسیب سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "حضرت معاویہ رضی اللہ عنہ آخری مرتبہ مدینہ منورہ تشریف لائے اور ہمیں خطبہ دیا ۔ آپ نے بالوں کا ایک گچھا نکال کے کہا کہ یہ یہودیوں کے سوا اور کوئی نہیں کرتا تھا ۔ نبی کریم صلی اللہ علیہ وسلم نے اسے ” زور “ یعنی فریبی فرمایا یعنی جو بالوں میں جوڑ لگائے تو ایسا آدمی مردہو یا عورت وہ مکار ہے جو اپنے مکروفریب پر اس طور پر پردہ ڈالتا ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 153,
        "matchingArabicURN": 151480,
        "last_updated": null
    },
    {
        "urduURN": 4058570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5939,
        "hadithSanad": "ہم سے اسحاق بن ابراہیم بن راہویہ نے بیان کیا ، کہا ہم کو جریر نے خبر دی ، انہیں منصور نے ، انہیں ابراہیم نخعی نے اور ان سے علقمہ نے کہ",
        "hadithText": "عبداللہ بن مسعود رضی اللہ عنہما نے خوبصورتی کے لیے گودنے والیوں ، چہرے کے بال اکھاڑ نے والیوں اورسامنے کے دانتوں کے درمیان کشادگی پیدا کرنے والیوں جو اللہ کی پیدائش میں تبدیلی کرتی ہیں ، ان سب پر لعنت بھیجی تو ام یعقوب نے کہا کہ یہ کیا بات ہوئی ۔ عبداللہ بن مسعود رضی اللہ عنہما نے کہا آخر میں کیوں نہ ان پر لعنت بھیجوں جن پر رسول اللہ صلی اللہ علیہ وسلم نے لعنت بھیجی ہے اور کتاب اللہ میں اس پر لعنت موجود ہے ۔ ام یعقوب نے کہا کہ اللہ کی قسم میں نے پورا قرآن مجید پڑھ ڈالا اور کہیں بھی ایسی کوئی آیت مجھے نہیں ملی ۔ عبداللہ بن مسعود رضی اللہ عنہما نے کہا اللہ کی قسم اگر تم نے پڑھا ہوتا تو تمہیں ضرور مل جاتا کیا تم کو یہ آیت معلوم نہیں ” وما اتا کم الرسول فخذوہ وما نھا کم عنہ فانتھوا “ یعنی ” اور جو کچھ رسول تمہیں دیں اسے لے لو اور جس سے بھی تمہیں منع کریں اس سے رک جاؤ ۔ “</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 154,
        "matchingArabicURN": 151490,
        "last_updated": null
    },
    {
        "urduURN": 4058580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5940,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، ان سے عبدہ نے بیان کیا ، ان سے عبیداللہ نے بیان کیا ، ان سے نافع نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے مصنوعی بال جوڑنے والی اور جڑوانے والی ، گودنے والی اور گدوانے والی پر لعنت بھیجی ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 155,
        "matchingArabicURN": 151500,
        "last_updated": null
    },
    {
        "urduURN": 4058590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5941,
        "hadithSanad": "ہم سے امام حمیدی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے ، ان سے ہشام بن عروہ نے بیان کیا ، انہوں نے فاطمہ بنت منذر سے سنا ، انہوں نے بیان کیا کہ میں نے اسماء بنت ابوبکر رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "ایک عورت نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا کہ یا رسول اللہ ! میری لڑکی کو خسرے کا بخار ہو گیا اور اس سے اس کے بال جھڑ گئے ۔ میں اس کی شادی بھی کر چکی ہوں تو کیا اس کے مصنوعی بال لگا دوں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ نے مصنوعی بال لگانے والی اور جس کے لگایا جائے ، دونوں پر لعنت بھیجی ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 156,
        "matchingArabicURN": 151510,
        "last_updated": null
    },
    {
        "urduURN": 4058600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5942,
        "hadithSanad": "مجھ سے یونس بن موسیٰ نے بیان کیا ، انہوں نے کہا ہم سے فضل بن دکین نے بیان کیا ، انہوں نے کہا ہم سے صخر بن جویریہ نے بیان کیا ، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، یا ( راوی نے اس طرح بیان کیا کہ ) نبی کریم صلی اللہ علیہ وسلم نے فرمایا گودنے والی ، گدوانے والی ، مصنوعی بال جوڑنے والی اور جڑوانے والی یعنی آنحضرت صلی اللہ علیہ وسلم نے ان سب پر لعنت بھیجی ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 157,
        "matchingArabicURN": 151520,
        "last_updated": null
    },
    {
        "urduURN": 4058610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5943,
        "hadithSanad": "مجھ سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو سفیان بن عیینہ نے خبر دی ، انہیں منصور نے ، انہیں ابراہیم نخعی نے ، انہیں علقمہ نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "اللہ تعالیٰ نے گودنے والیوں پر اور گدوانے والیوں پر اورچہرے کے بال اکھاڑنے والیوں پر اور خوبصورتی پیدا کرنے کے لیے سامنے کے دانتوں کے درمیان کشادگی کرنے والیوں پر جو اللہ کی پیدائش میں تبدیلی کرتی ہیں ، لعنت بھیجی ہے پھر میں کیوں نہ ان پر لعنت بھیجوں جن پر رسول اللہ صلی اللہ علیہ وسلم نے لعنت بھیجی ہے اور وہ اللہ کی کتاب میں موجود ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 158,
        "matchingArabicURN": 151530,
        "last_updated": null
    },
    {
        "urduURN": 4058620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5944,
        "hadithSanad": "مجھ سے یحییٰ بن ابی بشیر نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، ان سے معمر نے ، ان سے ہمام نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا نظر لگ جاناحق ہے اور آنحضرت صلی اللہ علیہ وسلم نے گودنے سے منع فرمایا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 159,
        "matchingArabicURN": 151540,
        "last_updated": null
    },
    {
        "urduURN": 4058630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5945,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عون بن ابی حجیفہ نے بیان کیا کہ میں نے اپنے والد ( ابوحجیفہ رضی اللہ عنہ ) کو دیکھا ، انہوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے خون کی قیمت ، کتے کی قیمت کھانے سے منع فرمایا اور سود لینے والے اور دینے والے ، گودنے والی اور گودانے والی ( پر لعنت بھیجی ) ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 161,
        "matchingArabicURN": 151560,
        "last_updated": null
    },
    {
        "urduURN": 4058640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5946,
        "hadithSanad": "ہم سے زہیر بن حرب نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے عمارہ نے ، ان سے ابو زرعہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "عمر رضی اللہ عنہ کے پاس ایک عورت لائی گئی جو گودنے کا کام کرتی تھی ۔ عمر رضی اللہ عنہ کھڑے ہو گئے ( اور اس وقت موجود صحابہ سے ) کہا میں تمہیں اللہ کا واسطہ دیتا ہوں کسی نے کچھ نبی کریم صلی اللہ علیہ وسلم سے گودنے کے متعلق سنا ہے ۔ ابوہریرہ رضی اللہ عنہ نے کہا کہ میں نے کھڑے ہو کر عرض کیا امیرالمؤمنین ! میں نے سنا ہے ۔ عمر رضی اللہ عنہ نے پوچھا کیا سنا ہے ؟ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے کہ گودنے کا کام نہ کرو اور نہ گدواؤ ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 162,
        "matchingArabicURN": 151570,
        "last_updated": null
    },
    {
        "urduURN": 4058650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5947,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ بن سعید نے بیان کیا ، انہیں عبیداللہ نے خبر دی ، کہا مجھ کو خبر دی نافع نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے مصنوعی بال لگانے والی اورلگوانے والی اور گودنے والی اور گدوانے والی پر لعنت بھیجی ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 163,
        "matchingArabicURN": 151580,
        "last_updated": null
    },
    {
        "urduURN": 4058660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5948,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے عبدالرحمٰن نے بیان کیا ، ان سے سفیان بن عیینہ نے ، ان سے منصور نے ، ان سے ابراہیم نے ، ان سے علقمہ نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے کہ",
        "hadithText": "گودنے والیوں پر اور گدوانے والیوں پر ، بال اکھاڑنے والیوں پر اور خوبصورتی کے لیے دانتوں کے درمیان کشادگی کرنے والیوں پر جو اللہ کی پیدائش میں تبدیلی کرتی ہیں ، اللہ تعالیٰ نے لعنت بھیجی ہے پھر میں بھی کیوں نہ ان پر لعنت بھیجوں جن پر رسول اللہ صلی اللہ علیہ وسلم نے لعنت بھیجی ہے اور وہ کتاب اللہ میں بھی موجود ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 164,
        "matchingArabicURN": 151590,
        "last_updated": null
    },
    {
        "urduURN": 4058670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5949,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے ابن ابی ذئب نے بیان کیا ، ان سے زہری نے ، ان سے عبیداللہ بن عبداللہ بن عتبہ نے ، ان سے حضرت ابن عباس رضی اللہ عنہما نے اور ان سے حضرت ابوطلحہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا رحمت کے فرشتے اس گھر میں داخل نہیں ہوتے جس میں کتا یا مورتیں ہوں ۔ اور لیث بن سعد نے بیان کیا ، ان سے یونس بن یزید نے ، ان ابن شہاب نے کہا کہ مجھ کو عبیداللہ بن عبداللہ بن عتبہ نے خبر دی ، انہوں نے ابن عباس رضی اللہ عنہما سے سنا ، وہ کہتے تھے کہ میں نے ابوطلحہ رضی اللہ عنہ سے سنا ، پھر انہوں نے نبی کریم صلی اللہ علیہ وسلم سے یہی حدیث نقل کی ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 165,
        "matchingArabicURN": 151601,
        "last_updated": null
    },
    {
        "urduURN": 4058680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5950,
        "hadithSanad": "ہم سے حمیدی عبداللہ بن زبیر نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے اعمش نے بیان کیا اور ان سے مسلم بن صبیحہ نے بیان کیا کہ",
        "hadithText": "ہم مسروق بن اجدع کے ساتھ یسار بن نمیر کے گھر میں تھے ۔ مسروق نے ان کے گھر کے سائبان میں تصویر یں دیکھیں تو کہا کہ میں نے حضرت عبداللہ بن مسعود رضی اللہ عنہما سے سنا ہے ، انہوں نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا اللہ کے پاس قیامت کے دن تصویر بنانے والوں کو سخت سے سخت تر عذاب ہو گا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 166,
        "matchingArabicURN": 151620,
        "last_updated": null
    },
    {
        "urduURN": 4058690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5951,
        "hadithSanad": "ہم سے ابراہیم بن المنذر نے بیان کیا ، انہوں نے کہا ہم سے انس بن عیاض نے بیان کیا ، انہوں نے کہا ہم سے عبیداللہ عمری نے بیان کیا ، ان سے نافع نے بیان کیا اور انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو لوگ یہ مورتیں بناتے ہیں انہیں قیامت کے دن عذاب کیا جائے گا اور ان سے کہا جائے گا کہ جس کو تم نے بنایا ہے اب اس میں جان بھی ڈالو ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 167,
        "matchingArabicURN": 151630,
        "last_updated": null
    },
    {
        "urduURN": 4058700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5952,
        "hadithSanad": "ہم سے معاذ بن فضالہ نے بیان کیا ، ان سے ہشام دستوائی نے بیان کیا ، ان سے یحییٰ بن ابی کثیر نے ، ان سے عمران بن حطان نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کو اپنے گھر میں جب بھی کوئی چیز ایسی ملتی جس پر صلیب کی مورت بنی ہو ( جیسے نصاریٰ رکھتے ہیں ) تو اس کو توڑ ڈالتے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 168,
        "matchingArabicURN": 151640,
        "last_updated": null
    },
    {
        "urduURN": 4058710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5953,
        "hadithSanad": "ہم سے موسیٰ نے بیان کیا ، کہا کہ ہم سے عبدالواحد نے ، کہا ہم سے عمارہ نے ، کہا ہم سے ابو زرعہ نے ، کہا کہ",
        "hadithText": "میں ابوہریرہ رضی اللہ عنہ کے ساتھ مدینہ منورہ میں ( مروان بن حکم کے گھر میں ) گیا تو انہوں نے چھت پر ایک مصور کو دیکھا جو تصویر بنا رہا تھا ، انہوں نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ( اللہ تعالیٰ ارشاد فرماتا ہے ) اس شخص سے بڑھ کر ظالم کون ہو گا جو میری مخلوق کی طرح پیدا کرنے چلا ہے اگر اسے یہی گھمنڈ ہے تو اسے چاہیئے کہ ایک دانہ پیدا کرے ، ایک چیونٹی پیداکرے ۔ پھر انہوں نے پانی کا ایک طشت منگوایا اور اپنے ہاتھ اس میں دھوئے ۔ جب بغل دھونے لگے تو میں نے عرض کیا ابوہریرہ ! کیا ( بغل تک دھونے کے بارے میں ) تم نے رسول اللہ صلی اللہ علیہ وسلم سے کچھ سنا ہے انہوں نے کہا میں نے جہاں تک زیور پہنا جا سکتا ہے وہاں تک دھویا ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 169,
        "matchingArabicURN": 151650,
        "last_updated": null
    },
    {
        "urduURN": 4058720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5954,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا کہ میں نے عبدالرحمٰن بن قاسم سے سنا ، ان دنوں مدینہ منورہ میں ان سے بڑھ کر عالم فاضل نیک کوئی آدمی نہیں تھا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نے اپنے والد ( قاسم بن ابی بکر ) سے سنا ، انہوں نے بیان کیا کہ میں نے حضرت عائشہ رضی اللہ عنہا سے سنا کہ رسول کریم صلی اللہ علیہ وسلم سفر ( غزوہ تبوک ) سے تشریف لائے تو میں نے اپنے گھر کے سائبان پر ایک پردہ لٹکا دیا تھا ، اس پر تصویریں تھیں جب آپ نے دیکھا تو اسے کھینچ کر پھینک دیا اور فرمایا کہ قیامت کے دن سب سے زیادہ سخت عذاب میں وہ لوگ گرفتار ہوں گے جو اللہ کی مخلوق کی طرح خود بھی بناتے ہیں ۔ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر میں نے پھاڑ کر اس پردہ کی ایک یا دو توشک بنا لیں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 170,
        "matchingArabicURN": 151660,
        "last_updated": null
    },
    {
        "urduURN": 4058730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5955,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے عبداللہ بن داؤد نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم سفر سے آئے اور میں نے پردہ لٹکا رکھا تھا جس میں تصویریں تھیں ، آنحضرت صلی اللہ علیہ وسلم نے مجھے اس کے اتار لینے کا حکم دیا تو میں نے اسے اتارلیا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 171,
        "matchingArabicURN": 151670,
        "last_updated": null
    },
    {
        "urduURN": 4058740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5956,
        "hadithSanad": "sanad",
        "hadithText": "اور میں اور نبی کریم صلی اللہ علیہ وسلم ایک ہی برتن میں غسل جنابت کیا کرتے تھے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 172,
        "matchingArabicURN": 151680,
        "last_updated": null
    },
    {
        "urduURN": 4058750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5957,
        "hadithSanad": "ہم سے حجاج بن منہال نے بیان کیا ، کہا ہم سے جویریہ نے بیان کیا ، ان سے نافع نے ، ان سے قاسم بن محمد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "انہوں نے ایک گدا خریدا جس پر تصویر یں تھیں ۔ رسول اللہ صلی اللہ علیہ وسلم ( اسے دیکھ کر ) دروازے پر کھڑے ہو گئے اور اندر نہیں تشریف لائے ۔ میں نے عرض کیا کہ یا رسول اللہ صلی اللہ علیہ وسلم میں نے جو غلطی کی ہے اس سے میں اللہ سے معافی مانگتی ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ گدا کس لیے ہے ؟ میں نے عرض کیا کہ آپ کے بیٹھنے اور اس پر ٹیک لگانے کے لیے ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ان مورت کے بنانے والوں کو قیامت کے دن عذاب دیا جائے گا اور ان سے کہا جائے گا کہ جو تم نے پیدا کیا ہے اسے زندہ بھی کر کے دکھاؤ اور فرشتے اس گھر میں نہیں داخل ہوتے جس میں مورت ہو ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 173,
        "matchingArabicURN": 151690,
        "last_updated": null
    },
    {
        "urduURN": 4058760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5958,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے بکیر بن عبداللہ نے ، ان سے بسر بن سعید نے اور ان سے زید بن خالد رضی اللہ عنہ نے اور ان سے رسول اللہ صلی اللہ علیہ وسلم کے صحابی ابوطلحہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا فرشتے اس گھر میں نہیں داخل ہوتے جس میں تصویریں ہوں ۔ بسر نے بیان کیا کہ ( اس حدیث کو روایت کرنے کے بعد ) پھر زید رضی اللہ عنہ بیمار پڑے تو ہم ان کی مزاج پرسی کے لیے گئے ۔ ہم نے دیکھا کہ ان کے دروازہ پر ایک پردہ پڑا ہوا ہے جس پر تصویر ہے ۔ میں نے ام المؤمنین میمونہ رضی اللہ عنہا کے ربیب عبیداللہ بن اسود سے کہا کہ زید بن خالد رضی اللہ عنہ نے ہمیں اس سے پہلے ایک مرتبہ تصویروں کے متعلق حدیث سنائی تھی ۔ عبیداللہ نے کہا کہ کیا تم نے سنا نہیں تھا ، حدیث بیان کرتے ہوئے انہوں نے یہ بھی کہا تھا کہ جو مورت کپڑے میں ہو وہ جائز ہے ( بشر طیکہ غیر ذی روح کی ہو ) اور عبداللہ بن وہب نے کہا ، انہیں عمرو نے خبر دی وہ ابن حارث ہیں ، ان سے بکیر نے بیان کیا ، ان سے بسر نے بیان کیا ، ان سے زید نے بیان کیا ، ان سے حضرت ابوطلحہ رضی اللہ عنہ نے بیان کیا اور ان سے نبی کریم صلی اللہ علیہ وسلم نے بیان فرمایا جیسا کہ اوپر مذکور ہوا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 174,
        "matchingArabicURN": 151701,
        "last_updated": null
    },
    {
        "urduURN": 4058770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5959,
        "hadithSanad": "ہم سے عمران بن میسرہ نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، کہا ہم سے عبدالعزیز بن صہیب نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "حضرت عائشہ رضی اللہ عنہا کے پاس ایک پردہ تھا ۔ اسے انہوں نے گھر کے ایک کنارے پر لٹکا دیا تھا تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ پردہ نکال ڈال ، اس کی مورت اس نماز میں میرے سامنے آتی ہیں ۔ اور دل اچاٹ ہوتا ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 175,
        "matchingArabicURN": 151720,
        "last_updated": null
    },
    {
        "urduURN": 4058780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5960,
        "hadithSanad": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، کہا کہ مجھ سے عبداللہ بن وہب نے ، کہا کہ مجھ سے عمر بن محمد نے بیان کیا ، ان سے سالم نے اور ان سے ان کے والد ( ابن عمر رضی اللہ عنہما ) نے بیان کیا کہ",
        "hadithText": "ایک وقت پر جبرائیل علیہ السلام نے نبی کریم صلی اللہ علیہ وسلم کے یہاں آنے کا وعدہ کیا لیکن آنے میں دیر ہوئی ۔ اس وقت پر نہیں آئے تو آنحضرت صلی اللہ علیہ وسلم سخت پریشان ہوئے پھر آپ باہر نکلے تو جبرائیل علیہ السلام سے ملا قات ہوئی ۔ آنحضرت صلی اللہ علیہ وسلم ان سے شکایت کی تو انہوں نے کہا کہ ہم ( فرشتے ) کسی ایسے گھر میں نہیں جاتے جس میں مورت یا کتا ہو ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 176,
        "matchingArabicURN": 151730,
        "last_updated": null
    },
    {
        "urduURN": 4058790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5961,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، ان سے امام مالک نے ، ان سے نافع نے ، ان سے قاسم بن محمد نے اور انہیں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا نے خبر دی کہ",
        "hadithText": "انہوں نے ایک گدا خریدا جس میں مورتیں تھیں جب رسول اللہ صلی اللہ علیہ وسلم نے اسے دیکھا تو آپ دروازے پر کھڑے ہو گئے اور اندر نہیں آئے ۔ میں آپ کے چہرے سے ناراضگی پہچان گئی ۔ میں نے عرض کیا یا رسول اللہ ! میں اللہ سے اس کے رسول کے سامنے توبہ کرتی ہوں ، میں نے کیا غلطی کی ہے ؟ آپ نے فرمایا کہ گدا کیسا ہے ؟ میں نے عرض کیا کہ میں نے ہی اسے خریدا ہے تاکہ آپ اس پر بیٹھیں اور ٹیک لگائیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ان مورتوں کے بنانے والوں کو قیامت کے دن عذاب دیا جائے گا اور ان سے کہا جائے گا کہ جو تم نے پیدا کیا ہے اب ان میں جان بھی ڈالو اور آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جس گھر میں مورت ہوتی ہے اس میں ( رحمت کے ) فرشتے نہیں داخل ہوتے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 177,
        "matchingArabicURN": 151740,
        "last_updated": null
    },
    {
        "urduURN": 4058800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5962,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا کہ مجھ سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عون بن ابی جحیفہ نے اور ان سے ان کے والد ( وہب بن عبداللہ ) نے کہ",
        "hadithText": "انہوں نے ایک غلام خریدا جو پچھنا لگا تا تھا پھر فرمایا کہ نبی کریم صلی اللہ علیہ وسلم نے خون نکالنے کی اجرت ، کتے کی قیمت اور رنڈی کی کمائی کھانے سے منع فرمایا ہے اور آپ نے سود لینے والے ، دینے والے ، گودنے والی ، گدوانے والی اور مورت بنانے والے پر لعنت بھیجی ہے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 178,
        "matchingArabicURN": 151750,
        "last_updated": null
    },
    {
        "urduURN": 4058810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5963,
        "hadithSanad": "ہم سے عیاش بن ولید نے بیان کیا ، کہا ہم سے عبدالاعلیٰ نے بیان کیا ، کہا ہم سے سعید بن ابی عروبہ نے بیان کیا ، انہوں نے کہا کہ میں نے نضر بن مالک سے سنا ، وہ قتادہ سے بیان کرتے تھے کہ",
        "hadithText": "میں ابن عباس رضی اللہ عنہما کے پاس تھا لوگ ان سے مختلف مسائل پوچھ رہے تھے ۔ جب تک ان سے خاص طور سے پوچھا نہ جاتا وہ نبی کریم صلی اللہ علیہ وسلم کا حوالہ نہیں دیتے تھے پھر انہوں نے کہا کہ میں نے حضرت محمد صلی اللہ علیہ وسلم سے سنا ہے آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص دنیا میں مورت بنائے گا قیامت کے دن اس پر زور ڈالا جائے گا کہ اسے وہ زندہ بھی کرے حالانکہ وہ اسے زندہ نہیں کر سکتا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 179,
        "matchingArabicURN": 151760,
        "last_updated": null
    },
    {
        "urduURN": 4058820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5964,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے ابوصفوان نے بیان کیا ، ان سے یونس بن یزید ایلی نے ، ان سے ابن شہاب نے ، ان سے عروہ نے اور ان سے حضرت اسامہ بن زید رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم ایک گدھے پر سوار ہوئے جس پر فدک کی بنی ہوئی کملی پڑی ہوئی تھی آپ نے حضرت اسامہ رضی اللہ عنہ کو اسی پر اپنے پیچھے بٹھا لیا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 180,
        "matchingArabicURN": 151770,
        "last_updated": null
    },
    {
        "urduURN": 4058830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5965,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، کہا ہم سے خالد حذاء نے بیان کیا ، ان سے عکرمہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم مکہ مکرمہ تشریف لائے ( فتح کے موقع پر ) تو عبدالمطلب کی اولاد نے ( جو مکہ میں تھی ) آپ کا استقبال کیا ۔ ( یہ سب بچے ہی تھے ) آپ نے از راہ محبت ایک بچے کو اپنے سامنے اور ایک کو اپنے پیچھے بٹھا لیا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 181,
        "matchingArabicURN": 151780,
        "last_updated": null
    },
    {
        "urduURN": 4058840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5966,
        "hadithSanad": "مجھ سے محمدبن بشار نے بیان کیا ، کہا ہم سے عبدالوہاب نے ، کہا ہم سے ایوب سختیانی نے کہ",
        "hadithText": "عکرمہ کے سامنے یہ ذکر آیا کہ تین آدمی جو ایک جانور پر چڑھیں اس میں کون بہت برا ہے ۔ انہوں نے بیان کیا کہ ابن عباس رضی اللہ عنہما نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم ( مکہ مکرمہ ) تشریف لائے تو آپ قثم بن عباس کو اپنی سواری پر آگے اور فضل بن عباس کو پیچھے بٹھا ئے ہوئے تھے ۔ یا قثم پیچھے تھے اور فضل آگے تھے ( رضی اللہ عنہم ) اب تم ان میں سے کسے برا کہو گے اور کسے اچھا ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 182,
        "matchingArabicURN": 151790,
        "last_updated": null
    },
    {
        "urduURN": 4058850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5967,
        "hadithSanad": "ہم سے ہدبہ بن خالد نے بیان کیا ، کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا ، کہا ہم سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا ، ان سے حضرت معاذ بن جبل نے بیان کیا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کی سواری پر آپ کے پیچھے بیٹھا ہوا تھا اور میرے اور آنحضرت صلی اللہ علیہ وسلم کے درمیان کجاوہ کی پچھلی لکڑی کے سوا اور کوئی چیز حائل نہیں تھی اسی حالت میں آنحضرت صلی اللہ علیہ وسلم نے فرمایا یامعاذ ! میں بولا یا رسول اللہ صلی اللہ علیہ وسلم حاضر ہوں ، آپ کی اطاعت اور فرمابرداری کے لیے تیار ہوں ۔ پھر آپ نے تھوڑی دیر تک چلتے رہے ۔ اس کے بعد فرمایا یا معاذ ! میں بولا ، یا رسول اللہ ! حاضر ہوں آپ کی اطاعت کے لیے تیار ہوں ۔ پھر آپ تھوڑی دیر چلتے رہے اس کے بعد فرمایا ، یا معاذ ! میں نے عرض کیا حاضر ہوں ، یا رسول اللہ ! آپ کی اطاعت کے لیے تیار ہوں ۔ اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے فرمایا تمہیں معلوم ہے اللہ کے اپنے بندوں پر کیا حق ہیں ؟ میں نے عرض کیا اللہ اور اس کے رسول ہی کو زیادہ علم ہے حضور اکرم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ کے بندوں پرحق یہ ہیں کہ بندے خاص اس کی عبادت کریں اور اس کے ساتھ کسی کو شریک نہ بنائیں پھر آپ تھوڑی دیر چلتے رہے ۔ اس کے بعد فرمایا معاذ ! میں نے عرض کیا حاضر ہوں یا رسول اللہ ! آپ کی اطاعت کے لیے تیارہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا تمہیں معلوم ہے بندوں کا اللہ پر کیا حق ہے ۔ جب کہ وہ یہ کام کر لیں ۔ میں نے عرض کیا اللہ اور اس کے رسول کو زیادہ علم ہے ۔ فرمایا کہ پھر بندوں کا اللہ پر حق ہے کہ وہ انہیں عذاب نہ کرے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 183,
        "matchingArabicURN": 151800,
        "last_updated": null
    },
    {
        "urduURN": 4058860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5968,
        "hadithSanad": "ہم سے حسن بن محمد بن صباح نے بیان کیا ، کہا ہم سے یحییٰ بن عباد نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، انہیں یحییٰ بن ابی اسحاق نے خبر دی ، کہا کہ میں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ خیبر سے واپس آ رہے تھے اور میں حضرت ابوطلحہ رضی اللہ عنہ کی سواری پر آپ کے پیچھے بیٹھا ہوا تھا اور چل رہے تھے ۔ آنحضرت صلی اللہ علیہ وسلم کی بعض بیوی حضرت صفیہ رضی اللہ عنہا آنحضرت صلی اللہ علیہ وسلم کی سواری پر آپ کے پیچھے تھیں کہ اچانک اونٹنی نے ٹھوکر کھائی ، میں نے کہا عورت کی خبرگیری کرو پھر میں اتر پڑا ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا یہ تمہاری ماں ہیں پھر میں نے کجاوہ مضبوط باندھا اور آنحضرت صلی اللہ علیہ وسلم سوار ہو گئے پھر جب مدینہ منورہ کے قریب ہوئے یا ( راوی نے بیان کیا کہ ) مدینہ منورہ دیکھا تو فرمایا ہم واپس ہونے والے ہیں اللہ تعالیٰ کی طرف رجوع ہونے والے ہیں ، اسی کو پوجنے والے ہیں ، اپنے مالک کی تعریف کرنے والے ہیں ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 184,
        "matchingArabicURN": 151810,
        "last_updated": null
    },
    {
        "urduURN": 4058870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 77,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5969,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، کہا ہم سے ابن شہاب نے بیان کیا ، ان سے عبادہ بن تمیم نے ، ان سے ان کے چچا ( عبداللہ بن زید انصاری رضی اللہ عنہ ) نے کہ",
        "hadithText": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو مسجد میں ( چت ) لیٹے ہوئے دیکھا کہ آپ ایک پاؤں کو دوسرے پاؤں پر اٹھا کر رکھے ہوئے تھے ۔</b>",
        "bookID": "77.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 185,
        "matchingArabicURN": 151820,
        "last_updated": null
    }
]