[
    {
        "urduURN": 4058880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5970,
        "hadithSanad": "ہم سے ابو الولید ہشام نے بیان کیا ، کہا ہم سے شعبہ نے ، انہوں نے کہا کہ مجھے ولید بن عیزار نے خبر دی ، کہا کہ میں نے ابوعمرو شیبانی سے سنا ، کہا کہ",
        "hadithText": "ہمیں اس گھر والے نے خبر دی اور انہوں نے اپنے ہاتھ سے عبداللہ بن مسعود رضی اللہ عنہما کے گھر کی طرف اشارہ کیا ، انہوں نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا اللہ تعالیٰ کے نزدیک کو ن سا عمل سب سے زیادہ پسند ہے ؟ آپ نے فرمایا کہ وقت پر نماز پڑھنا ۔ پوچھا کہ پھر کون سا ؟ فرمایا کہ والدین کے سا تھ اچھا سلوک کرنا ، پوچھا پھر کون سا ؟ فرمایا کہ اللہ کے راستے میں جہاد کرنا ۔ عبداللہ رضی اللہ عنہ نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے مجھ سے ان کاموں کے متعلق بیان کیا اور اگر میں اسی طرح سوال کرتا رہتا تو آپ جواب دیتے رہتے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 172740,
        "last_updated": null
    },
    {
        "urduURN": 4058890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5971,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے عمارہ بن قعقاع بن شبرمہ نے ، ان سے ابو زرعہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک صحابی رسول کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا کہ یا رسول اللہ ! میرے اچھے سلوک کا سب سے زیادہ حقدار کون ہے ؟ فرمایا کہ تمہاری ماں ہے ۔ پوچھااس کے بعد کون ہے ؟ فرمایا کہ تمہاری ماں ہے ۔ انہوں نے پھر پوچھا اس کے بعد کون ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تمہاری ماں ہے ۔ انہوں نے پوچھا اس کے بعد کون ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا پھر تمہارا باپ ہے ۔ ابن شبرمہ اور یحییٰ بن ایوب نے بیان کیا ، کہا ہم سے ابو زرعہ نے اسی کے مطابق بیان کیا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 172750,
        "last_updated": null
    },
    {
        "urduURN": 4058900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5972,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے سفیان اور شعبہ نے بیان کیا کہ ہم سے حبیب نے بیان کیا ( دوسری سند ) امام بخاری نے کہا اور ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو سفیان نے خبر دی ، انہیں حبیب نے ، انہیں ابوعباس نے اور ان سے عبداللہ بن عمرو نے بیان کیا کہ",
        "hadithText": "ایک صحابی نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا کیا میں بھی جہاد میں شریک ہو جاؤں ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا تمہارے ماں باپ موجود ہیں انہوں نے کہا کہ ہاں موجود ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر انہیں میں جہاد کرو ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 172760,
        "last_updated": null
    },
    {
        "urduURN": 4058910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5973,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے ان کے والدنے ، ان سے حمید بن عبدالرحمٰن نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا یقیناً سب سے بڑے گناہوں میں سے یہ ہے کہ کوئی شخص اپنے والدین پر لعنت بھیجے ۔ پوچھا گیا یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! کوئی شخص اپنے ہی والدین پر کیسے لعنت بھیجے گا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ وہ شخص دوسرے کے باپ کو برا بھلا کہے گا تودوسرا بھی اس کے باپ کو اور اس کی ماں کو برا بھلا کہے گا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 172770,
        "last_updated": null
    },
    {
        "urduURN": 4058920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5974,
        "hadithSanad": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم سے اسماعیل بن ابراہیم بن عقبہ نے بیان کیا ، کہا کہ مجھے نافع نے خبر دی ، انہیں حضرت ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تین آدمی چل رہے تھے کہ بارش نے انہیں آ لیا اور انہوں نے مڑ کر پہاڑی کی غار میں پناہ لی ۔ اس کے بعد ان کے غار کے منہ پر پہاڑ کی ایک چٹان گری اور اس کا منہ بند ہو گیا ۔ اب بعض نے بعض سے کہا کہ تم نے جو نیک کام کئے ہیں ان میں سے ایسے کام کو دھیان میں لاؤ جو تم نے خالص اللہ کے لیے کیا ہو تاکہ اللہ سے اس کے ذریعہ دعا کرو ممکن ہے وہ غار کو کھول دے ۔ اس پر ان میں سے ایک نے کہا اے اللہ ! میرے والدین تھے ان کے لیے بکریاں چراتا تھا اور واپس آ کر دودھ نکالتا تو سب سے پہلے اپنے والدین کو پلاتا تھا اپنے بچوں سے بھی پہلے ۔ ایک دن چار ے کے تلاش نے مجھے بہت دور لے جا ڈالا چنانچہ میں رات گئے واپس آیا ۔ میں نے دیکھا کہ میرے والدین سو چکے ہیں ۔ میں نے معمول کے مطابق دودھ نکالا پھر میں دوھا ہوا دودھ لے کر آیا اور ان کے سرہانے کھڑا ہو گیا میں گوارا نہیں کر سکتا تھا کہ انہیں سونے میں جگاؤں اور یہ بھی مجھ سے نہیں ہو سکتا تھا کہ والدین سے پہلے بچوں کو پلاؤں ۔ بچے بھوک سے میرے قدموں پر لوٹ رہے تھے اور اسی کشمکش میں صبح ہو گئی ۔ پس اے اللہ ! اگر تیرے علم میں بھی یہ کام میں نے صرف تیری رضا حاصل کرنے کے لیے کیا تھا تو ہمارے لیے کشادگی پیدا کر دے کہ ہم آسمان دیکھ سکیں ۔ اللہ تعالیٰ نے ( دعا قبول کی اور ) ان کے لیے اتنی کشادگی پیدا کر دی کہ وہ آسمان دیکھ سکتے تھے ۔ دوسرے شخص نے کہا اے اللہ ! میری ایک چچا زاد بہن تھی اور میں اس سے محبت کرتا تھا ، وہ انتہائی محبت جو ایک مرد ایک عورت سے کر سکتا ہے ۔ میں نے اس سے اسے مانگا تو اس نے انکار کیا اور صرف اس شرط پر راضی ہوئی کہ میں اسے سو دینار دوں ۔ میں نے دوڑ دھوپ کی اور سو دینار جمع کر لایا پھر اس کے پاس انہیں لے کر گیا پھر جب میں اس کے دونوں پاؤں کے درمیان میں بیٹھ گیا تو اس نے کہا کہ اے اللہ کے بندے ! اللہ سے ڈر اور مہر کو مت توڑ ۔ میں یہ سن کر کھڑا ہو گیا ( اور زنا سے باز رہا ) پس اگر تیرے علم میں بھی میں نے یہ کام تیری رضا وخوشنودی حاصل کرنے کے لیے کیا تھا تو ہمارے لیے کچھ اور کشادگی ( چٹان کو ہٹا کر ) پیدا کر دے ۔ چنانچہ ان کے لیے تھوڑی سی اور کشادگی ہو گئی ۔ تیسرے شخص نے کہا اے اللہ ! میں نے ایک مزدور ایک فرق چاول کی مزدوری پر رکھا تھا اس نے اپنا کام پورا کر کے کہا کہ میری مزدوری دو ۔ میں نے اس کی مزدوری دے دی لیکن وہ چھوڑ کر چلا گیا اور اس کے ساتھ بے تو جہی کی ۔ میں اس کے اس بچے ہوئے دھان کو بوتا رہا اور اس طرح میں نے اس سے ایک گائے اور اس کاچرواہا کر لیا ( پھر جب وہ آیا تو ) میں نے اس سے کہا کہ یہ گائے اور چرواہا لے جاؤ ۔ اس نے کہا اللہ سے ڈرو اور میرے ساتھ مذاق نہ کرو ۔ میں نے کہا کہ میں تمہارے ساتھ مذاق نہیں کرتا ۔ اس گائے اورچرواہے کو لے جاؤ ۔ چنانچہ وہ انہیں لے کر چلا گیا ۔ پس اگر تیرے علم میں بھی میں نے یہ کام تیری رضا وخوشنودی حاصل کرنے کے لیے کیا تھا تو ( چٹان کی وجہ سے غارسے نکلنے میں جو رکاوٹ باقی رہ گئی ہے اسے بھی کھول دے ۔ چنانچہ اللہ تعالیٰ نے ان کے لیےپوری طرح کشادگی کر دی جس سے وہ باہر آ گئے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 172780,
        "last_updated": null
    },
    {
        "urduURN": 4058930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5975,
        "hadithSanad": "ہم سے سعدبن حفص نے بیان کیا ، کہا ہم سے شیبان نے بیان کیا ، ان سے منصور نے ، ان سے مسیب نے ان سے وراد نے اور ان سے حضرت مغیرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ نے تم پر ماں کی نافرمانی حرام قرار دی ہے اور ( والدین کے حقوق ) نہ دینا اور ناحق ان سے مطالبات کرنا بھی حرام قرار دیا ہے ، لڑکیوں کو زندہ دفن کرنا ( بھی حرام قرار دیا ہے ) اور قیل وقال ( فضول باتیں ) کثرت سوال اور مال کی بربادی کو بھی ناپسند کیا ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 172790,
        "last_updated": null
    },
    {
        "urduURN": 4058940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5976,
        "hadithSanad": "مجھ سے اسحاق بن شاہین واسطی نے بیان کیا ، کہا ہم سے خالد واسطی نے بیان کیا ، ان سے جریری نے ، ان سے عبدالرحمٰن بن ابی بکرہ نے اور ان سے ان کے والد رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، کیا میں تمہیں سب سے بڑا گناہ نہ بتاؤں ؟ ہم نے عرض کیا ضرور بتا یئے یا رسول اللہ ! آنحضر ت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کے ساتھ شرک کرنا اور والدین کی نافرمانی کرنا ۔ آنحضرت صلی اللہ علیہ وسلم اس وقت ٹیک لگائے ہوئے تھے اب آپ سیدھے بیٹھ گئے اور فرمایا آگاہ ہو جاؤ جھوٹی بات بھی اور جھوٹی گواہی بھی ( سب سے بڑے گناہ ہیں ) آگاہ ہو جاؤ جھوٹی بات بھی اور جھوٹی گواہی بھی ۔ آنحضرت صلی اللہ علیہ وسلم اسے مسلسل دہراتے رہے اور میں نے سوچا کہ آنحضرت صلی اللہ علیہ وسلم خاموش نہیں ہوں گے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 172800,
        "last_updated": null
    },
    {
        "urduURN": 4058950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5977,
        "hadithSanad": "مجھ سے محمد بن ولید نے بیان کیا ، انہوں نے کہا ہم سے محمد بن جعفر نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، انہوں نے کہا کہ",
        "hadithText": "مجھ سے عبیداللہ بن ابی بکر نے بیان کیا ، انہوں نے کہا کہ میں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے کبائر کا ذکر کیا یا ( انہوں نے کہا کہ ) آنحضرت صلی اللہ علیہ وسلم سے کبائر کے متعلق پوچھا گیا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کے ساتھ شرک کرنا ، کسی کی ( ناحق ) جان لینا ، والدین کی نافرمانی کرنا پھر فرمایا کیا میں تمہیں سب سے بڑا گناہ نہ بتادوں ؟ فرمایا کہ جھوٹی بات فرمایا کہ جھوٹی شہادت ( سب سے بڑا گناہ ہے ) شعبہ نے بیان کیا کہ میرا غالب گمان یہ ہے کہ آنحضرت صلی اللہ علیہ وسلم نے جھوٹی گواہی فرمایا تھا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 172810,
        "last_updated": null
    },
    {
        "urduURN": 4058960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5978,
        "hadithSanad": "ہم سے عبداللہ بن زبیر حمیدی نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، کہا مجھ کو میرے والد نے خبر دی ، انہیں اسماء بنت ابی بکر رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "میری والدہ نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں میرے پاس آئیں ، وہ اسلام سے منکر تھیں ۔ میں نے آنحضرت صلی اللہ علیہ وسلم سے پوچھا کیا میں اس کے ساتھ صلہ رحمی کر سکتی ہوں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں ۔ اس کے بعد اللہ تعالیٰ نے یہ آیت نازل کی ” لا ینھا کم اللہ عن الذین لم یقاتلوکم فی الدین “ یعنی اللہ پاک تم کو ان لوگوں کے ساتھ نیک سلوک کرنے سے منع نہیں کرتا جو تم سے ہمارے دین کے متعلق کوئی لڑائی جھگڑا نہیں کرتے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 172820,
        "last_updated": null
    },
    {
        "urduURN": 4058970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5979,
        "hadithSanad": "اور لیث نے بیان کیا کہ مجھ سے ہشام نے بیان کیا ، ان سے عروہ نے اور ان سے حضرت اسماء رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میری والدہ مشرکہ تھیں وہ نبی کریم صلی اللہ علیہ وسلم کے قریش کے ساتھ صلح کے زمانہ میں اپنے والد کے ساتھ ( مدینہ منورہ ) آئیں ۔ میں نے آنحضرت صلی اللہ علیہ وسلم سے ان کے متعلق پوچھا کہ میری والدہ آئی ہیں اور وہ اسلام سے الگ ہیں ( کیا میں ان کے ساتھ صلہ رحمی کر سکتی ہوں ؟ ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں اپنے والدہ کے ساتھ صلہ رحمی کرو ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 172830,
        "last_updated": null
    },
    {
        "urduURN": 4058980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5980,
        "hadithSanad": "ہم سے یحییٰ نے بیان کیا ، انہوں نے کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے عبیداللہ بن عبداللہ نے اور انہیں حضرت عبداللہ بن عباس رضی اللہ عنہما نے خبر دی اور انہیں حضرت ابوسفیان رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "ہرقل نے انہیں بلا بھیجا تو انہوں نے اسے بتایا کہ وہ یعنی نبی کریم صلی اللہ علیہ وسلم ہمیں نماز ، صدقہ ، پاک دامنی اور صلہ رحمی کا حکم فرماتے ہیں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 172840,
        "last_updated": null
    },
    {
        "urduURN": 4058990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5981,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے عبدالعزیز بن مسلم نے بیان کیا ، کہا ہم سے عبداللہ بن دینار نے بیان کیا ، کہا کہ میں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "عمر رضی اللہ عنہ نے سیراء کا ( ایک ریشمی ) حلہ بکتے دیکھا تو عرض کیا یا رسول اللہ ! آپ اسے خرید لیں اور جمعہ کے دن اور جب آپ کے پاس وفود آئیں تو اسے پہنا کریں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اسے تو وہی پہن سکتا ہے جس کا ( آخرت میں ) کوئی حصہ نہ ہو ۔ اس کے بعد آنحضرت صلی اللہ علیہ وسلم کے پاس اسی قسم کے کئی حلے آئے تو آنحضرت صلی اللہ علیہ وسلم نے اس میں سے ایک حلہ عمر رضی اللہ عنہ کے لیے بھیجا ۔ عمر رضی اللہ عنہ نے عرض کیا کہ میں اسے کیسے پہن سکتا ہوں جبکہ آنحضرت صلی اللہ علیہ وسلم اس کے متعلق پہلے ممانعت فرما چکے ہیں ؟ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا کہ میں نے اسے تمہیں پہننے کے لیے نہیں دیا بلکہ اس لیے دیا ہے کہ تم اسے بیچ دو یا کسی دوسرے کو پہنا دو چنانچہ عمر رضی اللہ عنہ نے وہ حلہ اپنے ایک بھائی کو بھیج دیا جو مکہ مکرمہ میں تھے اور اسلام نہیں لائے تھے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 172850,
        "last_updated": null
    },
    {
        "urduURN": 4059000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5982,
        "hadithSanad": "ہم سے ابو الولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا کہ مجھے ابن عثمان نے خبر دی ، کہا کہ",
        "hadithText": "میں نے موسیٰ بن طلحہ سے سنا اور ان سے حضرت ابوایوب رضی اللہ عنہ نے بیان کیا ، کہا گیا کہ یا رسول اللہ ! کوئی ایسا عمل بتائیں جو مجھے جنت میں لے جائے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 172860,
        "last_updated": null
    },
    {
        "urduURN": 4059010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5983,
        "hadithSanad": "( دوسری سند ) امام بخاری نے کہا کہ مجھ سے عبدالرحمٰن بن بشر نے بیان کیا ، ان سے بہزبن اسد بصریٰ نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے ابن عثمان بن عبداللہ بن موہب اور ان کے والد عثمان بن عبداللہ نے بیان کیا کہ",
        "hadithText": "انہوں نے موسیٰ بن طلحہ سے سنا اور انہوں نے حضرت ابوایوب انصاری رضی اللہ عنہ سے کہ ایک صاحب نے کہا یا رسول اللہ ! کوئی ایسا عمل بتائیں جو مجھے جنت میں لے جائے ۔ اس پر لوگوں نے کہا کہ اسے کیا ہو گیا ہے ، اسے کیا ہو گیا ہے ، حضور اکرم صلی اللہ علیہ وسلم نے فرمایا کہ کیوں ہو کیا گیا ہے اجی اس کو ضرورت ہے بچارہ اس لیے پوچھتا ہے ۔ اس کے بعد آپ نے ان سے فرمایا کہ اللہ کی عبادت کر اور اس کے ساتھ کسی اورکو شریک نہ کر ، نماز قائم کر ، زکوٰۃ دیتے رہو اور صلہ رحمی کرتے رہو ۔ ( بس یہ اعمال تجھ کو جنت میں لے جائیں گے ۔ ) چل اب نکیل چھوڑدے ۔ راوی نے کہا شاید اس وقت آنحضرت صلی اللہ علیہ وسلم اپنی اونٹنی پر سوار تھے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 172870,
        "last_updated": null
    },
    {
        "urduURN": 4059020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5984,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے محمد بن جبیر بن مطعم نے بیان کیا اور انہیں ان کے والد جبیر بن مطعم رضی اللہ عنہ نے خبر دی",
        "hadithText": "انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ قطعی رحمی کرنے والا جنت میں نہیں جائے گا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 172880,
        "last_updated": null
    },
    {
        "urduURN": 4059030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5985,
        "hadithSanad": "مجھ سے ابراہیم بن المنذر نے بیان کیا ، انہوں نے کہا ہم سے محمد بن معن نے بیان کیا ، انہوں نے کہا کہ مجھ سے میرے والد نے بیان کیا ، انہوں نے کہا ہم سے سعید بن ابی سعید نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جسے پسند ہے کہ اس کی روزی میں فراخی ہو اور اس کی عمردراز کی جائے تو وہ صلہ رحمی کیا کرے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 172890,
        "last_updated": null
    },
    {
        "urduURN": 4059040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5986,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے بیان کیا ، کہا کہ مجھے حضرت انس بن مالک ر ضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو چاہتا ہو کہ اس کے رزق میں فراخی ہو اور اس کی عمردراز ہو تو وہ صلہ رحمی کیا کرے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 172900,
        "last_updated": null
    },
    {
        "urduURN": 4059050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5987,
        "hadithSanad": "مجھ سے بشر بن محمد نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو معاویہ بن ابی مزرد نے خبر دی ، کہا کہ میں نے اپنے چچا سعید بن یسار سے سنا ، وہ حضرت ابوہریرہ رضی اللہ عنہ سے بیان کرتے تھے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ نے فرمایا اللہ تعالیٰ نے مخلوق پیدا کی اور جب اس سے فراغت ہوئی تو رحم نے عرض کیا کہ یہ اس شخص کی جگہ ہے جو قطع رحمی سے تیری پناہ مانگے ۔ اللہ تعالیٰ نے فرمایا کہ ہاں کیا تم اس پر راضی نہیں کہ میں اس سے جوڑوں گا جو تم سے اپنے آپ کو جوڑے اور اس سے توڑلوں گا جو تم سے اپنے آپ کو توڑلے ؟ رحم نے کہا کیوں نہیں ، اے رب ! اللہ تعالیٰ نے فرمایا کہ پس یہ تجھ کو دیا ۔ رسول اللہ صلی اللہ علیہ وسلم نے اس کے بعد فرمایا کہ اگر تمہاراجی چاہے تو یہ آیت پڑھ لو ۔ ( ( فھل عسیتم ان تولیتم ان تفسدوا فی الارض وتقطعوا ارحامکم ) ) ( سورۃ محمد ) یعنی کچھ عجیب نہیں کہ اگر تم کو حکومت مل جائے تو تم ملک میں فساد برپا کرو اور رشتے ناطے توڑ ڈالو ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 172910,
        "last_updated": null
    },
    {
        "urduURN": 4059060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5988,
        "hadithSanad": "ہم سے خالد بن مخلد نے بیان کیا ، کہا ہم سے سلیمان بن بلال نے بیان کیا ، کہا ہم سے عبداللہ بن دینار نے ، ان سے ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا رحم کا تعلق رحمن سے جڑا ہوا ہے پس جو کوئی اس سے اپنے آپ کو جوڑتا ہے اللہ پاک نے فرمایا کہ میں بھی اس کو اپنے سے جوڑ لیتا ہوں اور جو کوئی اسے توڑ تا ہے میں بھی اپنے آپ کو اس سے توڑ لیتا ہوں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 172920,
        "last_updated": null
    },
    {
        "urduURN": 4059070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5989,
        "hadithSanad": "ہم سے سعید بن ابی مریم نے بیان کیا ، انہوں نے کہا ہم سے سلیمان بن بلال نے ، انہوں نے کہا مجھ کو معاویہ بن ابی مزرد نے خبر دی ، انہوں نے یزید بن رومان سے ، انہوں نے عروہ سے ، ام المؤمنین انہوں نے حضرت عائشہ رضی اللہ عنہا سے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا رحم ( رشتہ داری رحمن سے ملی ہوئی ) شاخ ہے جو شخص اس سے ملے میں اس سے ملتا ہوں اور جو اس سے قطع تعلق کرے میں اس سے قطع تعلق کرتا ہوں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 172930,
        "last_updated": null
    },
    {
        "urduURN": 4059080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5990,
        "hadithSanad": "ہم سے عمرو بن عباس نے بیان کیا ، انہوں نے کہا مجھ سے محمد بن جعفر نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے اسماعیل بن ابی خالد نے بیان کیا ، ان سے قیس بن ابی حازم نے بیان کیا ، ان سے عمرو بن عاص رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا کہ فلاں کی اولاد ( یعنی ابوسفیان بن حکم بن عاص یا ابولہب کی ) یہ عمرو بن عباس نے کہا کہ محمد بن جعفر کی کتاب میں اس وہم پر سفید جگہ خالی تھی ( یعنی تحریر نہ تھی ) میرے عزیز نہیں ہیں ( گو ان سے نسبی رشتہ ہے ) میرا ولی تو اللہ ہے اور میرے عزیز تو ولی ہیں جو مسلمانوں میں نیک اور پرہیزگار ہیں ( گو ان سے نسبی رشتہ بھی نہ ہو ) عنبسہ بن عبدالواحد نے بیان بن بشر سے ، انہوں نے قیس سے ، انہوں نے عمرو بن عاص سے اتنا بڑھایا ہے کہ میں نے آنحضرت صلی اللہ علیہ وسلم سے سنا ، آپنے فرمایا کہ البتہ ان سے میرا رشتہ ناطہٰ ہے اگر وہ تر رکھیں گے تو میں بھی تر رکھوں گا یعنی وہ ناطہٰ جوڑیں گے تو میں بھی جوڑوں گا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 172940,
        "last_updated": null
    },
    {
        "urduURN": 4059090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5991,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو سفیان ثوری نے خبر دی ، انہیں اعمش اور حسن بن عمرو اور فطربن خلیفہ نے ، ان سے مجاہد بن جبیر نے اور ان سے عبداللہ بن عمرو رضی اللہ عنہما نے سفیان سے ، کہا کہ",
        "hadithText": "اعمش نے یہ حدیث نبی کریم صلی اللہ علیہ وسلم تک مرفوع نہیں بیان کی لیکن حسن اور فطر نے نبی کریم صلی اللہ علیہ وسلم سے مرفوعاً بیان کیا فرمایا کہ کسی کام کا بدلہ دینا صلہ رحمی نہیں ہے بلکہ صلہ رحمی کرنے والا وہ ہے کہ جب اس کے ساتھ صلہ رحمی کا معاملہ نہ کیا جا رہا ہو تب بھی وہ صلہ رحمی کرے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 172950,
        "last_updated": null
    },
    {
        "urduURN": 4059100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5992,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے کہا کہ مجھے عروہ بن زبیر نے خبر دی اور انہیں حکیم بن حزام نے خبر دی ، انہوں نے عرض کیا کہ",
        "hadithText": "یا رسول اللہ ! آنحضرت صلی اللہ علیہ وسلم کا ان کاموں کے بارے میں کیا خیال ہے جنہیں میں عبادت سمجھ کر زمانہ جاہلیت میں کرتا تھا مثلاً صلہ رحمی ، غلام کی آزادی ، صدقہ ، کیا مجھے ان پر ثواب ملے گا ؟ حضرت حکیم رضی اللہ عنہ نے بیان کیا کہ حضور اکرم صلی اللہ علیہ وسلم نے فر مایا ہے تم ان تمام اعمال خیر کے ساتھ اسلام لائے ہو جو پہلے کر چکے ہو ۔ اور بعضوں نے ابو الیمان سے بجائے اتحنث کے اتحنت ( تاء کے ساتھ ) روایت کیا ہے اور معمر اور صالح اور ابن مسافر نے بھی اتحنت روایت کیا ہے ۔ ابن اسحاق نے کہا اتحنث تحنث سے نکلا ہے اس کے معنی مثل اور عبادت کرنا ۔ ہشام نے بھی اپنے والد عروہ سے ان لوگوں کی متابعت کی ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 172960,
        "last_updated": null
    },
    {
        "urduURN": 4059110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5993,
        "hadithSanad": "ہم سے حبان بن موسیٰ نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، انہیں خالد بن سعید نے ، انہیں ان کے والد نے ، ان سے حضرت ام خالد بنت سعید رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں اپنے والد کے ساتھ حاضر ہوئی ۔ میں ایک زرد قمیص پہنے ہوئے تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ” سنہ سنہ “ عبداللہ بن مبارک نے کہا کہ یہ حبشی زبان میں ” اچھا “ کے معنی میں ہے ۔ ام خالد نے بیان کیا کہ پھر میں آنحضرت صلی اللہ علیہ وسلم کی خاتم نبوت سے کھیلنے لگی تو میرے والد نے مجھے ڈانٹا لیکن آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اسے کھیلنے دو پھر آپ نے فرمایا کہ تم ایک زمانہ تک زندہ رہو گی اللہ تعالیٰ تمہاری عمر خوب طویل کرے ، تمہاری زندگی دراز ہو ۔ عبداللہ نے بیان کیا چنانچہ انہوں نے بہت ہی طویل عمر پائی اور ان کی طول عمر کے چر چے ہونے لگے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 172970,
        "last_updated": null
    },
    {
        "urduURN": 4059120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5994,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے مہدی نے بیان کیا ، کہا ہم سے ابن یعقوب نے بیان کیا ، ان سے ابونعیم نے بیان کیا کہ",
        "hadithText": "میں حضرت ابن عمر رضی اللہ عنہما کی خدمت میں موجود تھا ان سے ایک شخص نے ( حالت احرام میں ) مچھر کے مارنے کے متعلق پوچھا ( کہ اس کا کیا کفارہ ہو گا ) حضرت ابن عمر رضی اللہ عنہما نے دریافت فرمایا کہ تم کہاں کے ہو ؟ اس نے بتایا کہ عراق کا ، فرمایا کہ اس شخص کو دیکھو ، ( مچھر کی جان لینے کے تاوان کا مسئلہ پوچھتا ہے ) حالانکہ اس کے ملک والوں نے رسول اللہ صلی اللہ علیہ وسلم کے نواسہ کو ( بے تکلف قتل کر ڈالا ) میں نے آنحضرت صلی اللہ علیہ وسلم سے سنا آپ فرما رہے تھے کہ یہ دونوں ( حضرت حسن اور حضرت حسین رضی اللہ عنہما ) دنیا میں میرے دو پھول ہیں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 172980,
        "last_updated": null
    },
    {
        "urduURN": 4059130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5995,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، کہا مجھ سے عبداللہ بن ابی بکر نے بیان کیا ، انہیں عروہ بن زبیر نے خبر دی اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میرے یہاں ایک عورت اس کے ساتھ دو بچیاں تھیں ، وہ مانگنے آئی تھی ۔ میرے پاس سے سوا ایک کھجور کے اسے اور کچھ نہ ملا ۔ میں نے اسے وہ کھجور دے دی اور اس نے وہ کھجور اپنے دونوں لڑکیوں کو تقسیم کر دی ۔ پھر اٹھ کر چلی گئی اس کے بعد حضور اکرم صلی اللہ علیہ وسلم تشریف لائے تو میں نے آپ سے اس کا ذکر کیا تو آپ نے فرمایا کہ جو شخص بھی اس طرح کی لڑکیوں کی پرورش کرے گا اور ان کے ساتھ اچھا معاملہ کرے گا تو یہ اس کے لیے جہنم سے پردہ بن جائیں گی ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 172990,
        "last_updated": null
    },
    {
        "urduURN": 4059140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5996,
        "hadithSanad": "ہم سے ابو الولید نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، کہا ہم سے سعید مقبری نے بیان کیا ، کہا ہم سے عمرو بن سلیم نے بیان کیا ، کہا ہم سے ابوقتادہ رضی اللہ عنہ نے بیان کیا ، کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم باہر تشریف لائے اور امامہ بنت ابی العاص ( جو بچی تھیں ) وہ آپ کے شانہ مبارک پر تھیں پھر آنحضرت صلی اللہ علیہ وسلم نے نماز پڑھی جب آپ رکوع کرتے تو انہیں اتار دیتے اور جب کھڑے ہوتے تو پھر اٹھا لیتے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 173000,
        "last_updated": null
    },
    {
        "urduURN": 4059150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5997,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے خبر دی ، ان سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے حسن بن علی رضی اللہ عنہ کو بوسہ دیا ۔ آنحضرت صلی اللہ علیہ وسلم کے پاس حضرت اقرع بن حابس رضی اللہ عنہ بیٹھے ہوئے تھے ۔ حضرت اقرع رضی اللہ عنہ نے اس پر کہا کہ میرے دس لڑکے ہیں اور میں نے ان میں سے کسی کو بوسہ نہیں دیا ۔ آنحضرت صلی اللہ علیہ وسلم نے ان کی طرف دیکھا اور فرمایا کہ جو مخلوق خدا پر رحم نہیں کرتا اس پر بھی رحم نہیں کیا جاتا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 173010,
        "last_updated": null
    },
    {
        "urduURN": 4059160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5998,
        "hadithSanad": "ہم سے محمدبن یوسف نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے ہشام نے ، ان سے عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "ایک دیہاتی نبی کریم صلی اللہ علیہ وسلم کی خد مت میں حاضر ہوا اور کہا آپ لوگ بچوں کو بوسہ دیتے ہیں ، ہم تو انہیں بوسہ نہیں دیتے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اگر اللہ نے تمہارے دل سے رحم نکال دیا ہے تو میں کیا کر سکتا ہوں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 173020,
        "last_updated": null
    },
    {
        "urduURN": 4059170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 5999,
        "hadithSanad": "ہم سے ابن ابی مریم نے بیان کیا ، کہا ہم سے ابو غسان نے ، کہا کہ مجھ سے زید بن اسلم نے ، ان سے ان کے والد نے اور ان سے عمر بن خطاب رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے پاس کچھ قیدی آئے قیدیوں میں ایک عورت تھی جس کا پستان دودھ سے بھرا ہوا تھا اور وہ دوڑ رہی تھی ، اتنے میں ایک بچہ اس کو قیدیوں میں ملا اس نے جھٹ اپنے پیٹ سے لگا لیا اور اس کو دودھ پلانے لگی ۔ ہم سے حضور اکرم صلی اللہ علیہ وسلم نے فرمایا کہ کیا تم خیال کر سکتے ہو کہ یہ عورت اپنے بچہ کو آگ میں ڈال سکتی ہے ہم نے عرض کیا کہ نہیں جب تک اس کو قدرت ہو گی یہ اپنے بچہ کو آگ میں نہیں پھینک سکتی ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ اللہ اپنے بندوں پر اس سے بھی زیادہ رحم کرنے والا ہے ۔ جتنا یہ عورت اپنے بچہ پر مہربان ہو سکتی ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 173030,
        "last_updated": null
    },
    {
        "urduURN": 4059180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6000,
        "hadithSanad": "ہم سے حکم بن نافع نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ، کہا ہم کو سعید بن مسیب نے خبر دی کہ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ نے رحمت کے سو حصے بنائے اور اپنے پاس ان میں سے ننانوے حصے رکھے صرف ایک حصہ زمین پر اتارا اور اسی کی وجہ سے تم دیکھتے ہو کہ مخلوق ایک دوسرے پر رحم کرتی ہے ، یہاں تک کہ گھوڑی بھی اپنے بچہ کو اپنے سم نہیں لگنے دیتی بلکہ سموں کواٹھا لیتی ہے کہ کہیں اس سے اس بچہ کو تکلیف نہ پہنچے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 173040,
        "last_updated": null
    },
    {
        "urduURN": 4059190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6001,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو سفیان ثوری نے خبر دی ، انہیں منصور بن معتمر نے ، انہیں ابووائل نے ، انہیں عمرو بن شرحبیل نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نے کہا یا رسول اللہ ! کون سا گناہ سب سے بڑا ہے ۔ فرمایا یہ کہ تم اللہ تعالیٰ کا کسی کو شریک بناؤ حالانکہ اسی نے تمہیں پیدا کیا ہے ۔ انہوں نے کہا پھر اس کے بعد فرمایا یہ کہ تم اپنے لڑکے کو اس خوف سے قتل کرو کہ اگر زندہ رہا تو تمہاری روزی میں شریک ہو گا ۔ انہوں نے کہا اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے فرمایا یہ کہ تم اپنے پڑوسی کی بیوی سے زنا کرو ۔ چنانچہ اللہ تعالیٰ نے بھی آنحضرت صلی اللہ علیہ وسلم کے اس ارشاد کی تائید میں یہ آیت ” والذین لا یدعون مع اللہ الھا آخر “ الخ ، نازل کی کہ ” اور وہ لوگ جو اللہ کے سوا کسی دوسرے معبود کو نہیں پکارتے اور نہ وہ ناحق کسی کو قتل کرتے ہیں اور نہ وہ زنا کرتے ہیں ۔ “</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 173050,
        "last_updated": null
    },
    {
        "urduURN": 4059200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6002,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے یحییٰ بن سعید نے بیان کیا ، ان سے ہشام نے بیان کیا ، کہا مجھ کو میرے والد عروہ نے خبر دی اور انہیں حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک بچہ ( عبداللہ بن زبیر ) کو اپنی گود میں بٹھلایا اور کھجور چبا کر اس کے منہ میں دی ، اس نے آپ پر پیشاب کر دیا آپ نے پانی منگوا کر اس پر بہا دیا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 173060,
        "last_updated": null
    },
    {
        "urduURN": 4059210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6003,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، انہوں نے کہا ہم سے عارم محمد بن فضل نے بیان کیا ، کہا ہم سے معتمر بن سلیمان نے بیان کیا ، کہا کہ ا ن سے ان کے والد نے بیان کیا ، کہا کہ میں نے ابو تمیمہ سے سنا ، وہ ابوعثمان نہدی سے بیان کرتے تھے اورابوعثمان نہدی نے کہا کہ ان سے حضرت اسامہ بن زید رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم مجھے اپنی ایک ران پر بٹھا تے تھے اور حضرت حسن رضی اللہ عنہ کو دوسری ران پر بٹھلا تے تھے ۔ پھر دونو ں کو ملاتے اور فرماتے ، اے اللہ ! ان دونوں پر رحم کر کہ میں بھی ان پر رحم کرتا ہوں اور علی بن عبداللہ مدینی نے بیان کیا کہ ہم سے یحییٰ نے بیان کیا ، کہا ہم سے سلیمان تیمی نے بیان کیا ، ان سے ابوعثمان نہدی نے اسی حدیث کو بیان کیا ۔ سلیمان تیمی نے کہا جب ابو تمیمہ نے یہ حدیث مجھ سے بیان کی ابوعثمان نہدی سے تو میرے دل میں شک پیدا ہوا ۔ میں نے ابوعثمان سے بہت سی احادیث سنی ہیں پر یہ حدیث کیوں نہیں سنی پھر میں نے اپنی احادیث کی کتاب دیکھی تو اس میں یہ حدیث ابوعثمان نہدی سے لکھی ہوئی تھی ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 173071,
        "last_updated": null
    },
    {
        "urduURN": 4059220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6004,
        "hadithSanad": "ہم سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "مجھے کسی عورت پر اتنا رشک نہیں آتا تھا جتنا حضرت خدیجہ رضی اللہ عنہا پر آتا تھا حالانکہ وہ آنحضرت صلی اللہ علیہ وسلم کی مجھ سے شادی سے تین سال پہلے وفات پا چکی تھیں ۔ ( رشک کی وجہ یہ تھی ) کہ آنحضرت صلی اللہ علیہ وسلم کو میں کثرت سے ان کا ذکر کرتے سنتی تھی اور آنحضرت صلی اللہ علیہ وسلم کو ان کے رب نے حکم دیا تھا کہ حضرت خدیجہ رضی اللہ عنہا کو جنت میں ایک خولدار موتیوں کے گھر کی خوشخبری سنا دیں ۔ آنحضرت صلی اللہ علیہ وسلم کبھی بکری ذبح کرتے پھر اس میں سے حضرت خدیجہ رضی اللہ عنہ کی سہیلیوں کو حصہ بھیجتے تھے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 173090,
        "last_updated": null
    },
    {
        "urduURN": 4059230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6005,
        "hadithSanad": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ، کہا کہ مجھ سے عبدالعزیز بن ابی حازم نے بیان کیا ، کہا کہ مجھ سے میرے والد نے بیان کیا ، کہا کہ میں نے حضرت سہل بن سعد رضی اللہ عنہ سے سنا ، ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ",
        "hadithText": "میں اوریتیم کی پرورش کرنے والا جنت میں اس طرح ہوں گے اور آپ نے شہادت اور درمیانی انگلیوں کے اشارہ سے ( قرب کو ) بتایا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 173100,
        "last_updated": null
    },
    {
        "urduURN": 4059240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6006,
        "hadithSanad": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے صفوان بن سلیم تابعی اس حدیث کو مرسلاً روایت کرتے تھے کہ",
        "hadithText": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا بیواؤں اور مسکینوں کے لیے کوشش کرنے والا اللہ کے راستہ میں جہاد کرنے والے کی طرح ہے یا اس شخص کی طرح ہے جو دن میں روزے رکھتا ہے اور رات کو عبادت کرتا ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 173111,
        "last_updated": null
    },
    {
        "urduURN": 4059250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6007,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، کہا ہم سے امام مالک نے بیان کیا ، ان سے ثور بن زید نے ، ان سے ابو الغیث نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا بیواؤں او مسکینوں کے لیے کوشش کرنے والا اللہ کے راستے میں جہاد کرنے والے کی طرح ہے ۔ عبداللہ قعنبی کو اس میں شک ہے ۔ امام مالک نے اس حدیث میں یہ بھی کہا تھا ” اس شخص کے برابر ثواب ملتا ہے جو نماز میں کھڑا رہتا ہے تھکتا ہی نہیں اور اس شخص کے برابر جو روزے برابر رکھے چلا جاتا ہے ۔ افطار ہی نہیں کرتا ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 173130,
        "last_updated": null
    },
    {
        "urduURN": 4059260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6008,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے اسماعیل بن علیہ نے بیان کیا ، کہا ہم سے ایوب سختیانی نے بیان کیا ، ان سے ابوقلابہ نے ، ان سے ابو سلیمان مالک بن حویرث رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں مدینہ حاضر ہوئے اور ہم سب نوجوان اور ہم عمر تھے ۔ ہم آنحضرت کے ساتھ بیس دنوں تک رہے ۔ پھر آنحضرت صلی اللہ علیہ وسلم کو خیال ہو کہ ہمیں اپنے گھر کے لوگ یادآ رہے ہوں گے اور آنحضرت صلی اللہ علیہ وسلم نے ہم سے ان کے متعلق پوچھا جنہیں ہم اپنے گھروں پر چھوڑ کر آئے تھے ہم نے آنحضرت صلی اللہ علیہ وسلم کو سارا حال سنا دیا ۔ آپ بڑے ہی نرم خو اوربڑے رحم کرنے والے تھے ۔ آپ نے فرمایا کہ تم اپنے گھروں کوواپس جاؤ اور اپنے ملک والوں کودین سکھاؤ اور بتاؤ اور تم اس طرح نماز پڑھو جس طرح تم نے مجھے نماز پڑھتے دیکھا ہے اور جب نماز کا وقت آ جائے تو تم میں سے ایک شخص تمہارے لیے اذان دے پھر جو تم میں بڑا ہو وہ امامت کرائے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 173140,
        "last_updated": null
    },
    {
        "urduURN": 4059270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6009,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا مجھ سے امام مالک نے بیان کیا ، ان سے ابوبکر کے غلام سمی نے ، ان سے ابوصالح سمان نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ایک شخص راستہ میں چل رہا تھا کہ اسے شدت کی پیاس لگی اسے ایک کنواں ملا اور اس نے اس میں اتر کر پانی پیا ۔ جب باہر نکلا تو وہاں ایک کتا دیکھا جو ہانپ رہا تھا اور پیاس کی وجہ سے تری کو چاٹ رہا تھا ۔ اس شخص نے کہا کہ یہ کتا بھی اتنا ہی زیادہ پیاسا معلوم ہو رہا ہے جتنا میں تھا ۔ چنانچہ وہ پھر کنویں میں اترا اور اپنے جوتے میں پانی بھرا اور منہ سے پکڑ کر اوپر لایا اور کتے کو پانی پلایا ۔ اللہ تعالیٰ نے اس کے اس عمل کو پسند فرمایا اور اس کی مغفرت کر دی ۔ صحابہ کرام نے عرض کیا کہ یا رسول اللہ ! کیا ہمیں جانوروں کے ساتھ نیکی کرنے میں بھی ثواب ملتا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تمہیں ہر تازہ کلیجے والے پر نیکی کرنے میں ثواب ملتا ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 173150,
        "last_updated": null
    },
    {
        "urduURN": 4059280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6010,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، کہا کہ مجھے ابوسلمہ بن عبدالرحمٰن نے خبر دی اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم ایک نماز کے لیے کھڑے ہوئے اور ہم بھی آنحضرت صلی اللہ علیہ وسلم کے ساتھ کھڑے ہوئے ۔ نماز پڑھتے ہی ایک دیہاتی نے کہا اے اللہ ! مجھ پر رحم کر اور محمد ( صلی اللہ علیہ وسلم ) پراور ہمارے ساتھ کسی اور پر رحم نہ کر ۔ جب محمد صلی اللہ علیہ وسلم نے سلام پھیرا تو دیہاتی سے فرمایا کہ تم نے ایک وسیع چیز کو تنگ کر دیا آپ کی مراد اللہ کی رحمت سے تھی ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 173160,
        "last_updated": null
    },
    {
        "urduURN": 4059290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6011,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے زکریانے بیان کیا ، ان سے عامر نے کہا کہ میں نے انہیں یہ کہتے سنا ہے کہ میں نے نعمان بن بشیر سے سنا ، وہ بیان کرتے تھے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تم مومنوں کو آپس میں ایک دوسرے کے ساتھ رحمت ومحبت کا معاملہ کرنے اور ایک دوسرے کے ساتھ لطف ونرم خوئی میں ایک جسم جیسا پاؤ گے کہ جب اس کا کوئی ٹکڑا بھی تکلیف میں ہوتا ہے ، تو سارا جسم تکلیف میں ہوتا ہے ۔ ایسا کہ نیند اڑ جاتی ہے اور جسم بخار میں مبتلا ہو جاتا ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 173170,
        "last_updated": null
    },
    {
        "urduURN": 4059300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6012,
        "hadithSanad": "ہم سے ابو الولید نے بیان کیا ، کہا ہم سے ابو عوانہ نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اگر کوئی مسلمان کسی درخت کا پودا لگاتا ہے اور اس درخت سے کوئی انسان یا جانور کھاتا ہے تو لگانے والے کے لیے وہ صدقہ ہوتا ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 173180,
        "last_updated": null
    },
    {
        "urduURN": 4059310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6013,
        "hadithSanad": "ہم سے عمر بن حفص نے بیان کیا ، انہوں نے کہا ہم سے ہمارے والد نے بیان کیا ، ان سے اعمش نے بیان کیا ، انہوں نے کہا کہ مجھ سے زید بن وہب نے بیان کیا ، انہوں نے کہا کہ میں نے جریر بن عبداللہ رضی اللہ عنہ سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو رحم نہیں کرتا اس پر رحم نہیں کیا جاتا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 173190,
        "last_updated": null
    },
    {
        "urduURN": 4059320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6014,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے یحییٰ بن سعید نے کہا کہ مجھے ابوبکر بن محمد نے خبر دی ، انہیں عمرہ نے اور انہیں حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا حضرت جبرائیل علیہ السلام مجھے پڑوسی کے بارے میں باربار اس طرح وصیت کرتے رہے کہ مجھے خیال گزرا کہ شاید پڑوسی کو وراثت میں شریک نہ کر دیں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 173200,
        "last_updated": null
    },
    {
        "urduURN": 4059330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6015,
        "hadithSanad": "ہم سے محمد بن منہال نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، ان سے عمر بن محمد نے ، ان سے ان کے والد نے اور ان سے حضرت ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ حضرت جبرائیل علیہ السلام مجھے اس طرح باربار پڑوسی کے حق میں وصیت کرتے رہے کہ مجھے خیال گزرا کہ شاید پڑوسی کو وراثت میں شریک نہ کر دیں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 173210,
        "last_updated": null
    },
    {
        "urduURN": 4059340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6016,
        "hadithSanad": "ہم سے عاصم بن علی نے بیان کیا ، انہوں نے کہا ہم سے ابن ابی ذئب نے بیان کیا ، ان سے سعید نے بیان کیا ، ان سے ابوشریح نے بیان کیا",
        "hadithText": "اور ان سے نبی کریم صلی اللہ علیہ وسلم نے بیان کیا واللہ ! وہ ایمان والا نہیں ، واللہ ! وہ ایمان والا نہیں ۔ واللہ ! وہ ایمان والا نہیں ۔ عرض کیا گیا کون یا رسول اللہ ؟ فرمایا وہ جس کے شر سے اس کا پڑوسی محفوظ نہ ہو ۔ اس حدیث کو شبابہ اوراسد بن موسیٰ نے بھی روایت کیا ہے اورحمید بن اسود اورعثمان بن عمر اور ابوبکر بن عیاش اورشعیب بن اسحاق نے اس حدیث کو ابن ابی ذئب سے یوں روایت کیا ہے ، انہوں نے مقبری سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 173221,
        "last_updated": null
    },
    {
        "urduURN": 4059350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6017,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، کہا ہم سے سعید نے بیان کیا وہ سعید مقبری ہیں ، ان سے ان کے والد نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم فرمایا کرتے تھے کہ اے مسلمان عورتو ! تم میں سے کوئی عورت اپنی کسی پڑوسن کے لیے کسی بھی چیز کو ( ہدیہ میں ) دینے کے لیے حقیر نہ سمجھے خواہ بکری کا پایہ ہی کیوں نہ ہو ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 173240,
        "last_updated": null
    },
    {
        "urduURN": 4059360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6018,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے ابوالاحوص نے بیان ، ان سے ابو حصین نے ، ان سے ابوصالح نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو کوئی اللہ اور آخرت کے دن پر ایمان رکھتا ہو وہ اپنے پڑوسی کو تکلیف نہ پہنچائے اور جو کوئی اللہ اور آخرت کے دن پر ایمان رکھتا ہو وہ اپنے مہمان کی عزت کرے اور جو کوئی اللہ اور آخرت کے دن پر ایمان رکھتا ہو وہ اچھی بات زبان سے نکالے ورنہ خاموش رہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 173250,
        "last_updated": null
    },
    {
        "urduURN": 4059370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6019,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، انہوں نے کہا کہ مجھ سے سعید مقبری نے بیان کیا ، ان سے ابوشریح عدوی رضی اللہ عنہ نے بیان کیا انہوں نے کہا کہ",
        "hadithText": "میرے کانوں نے سنا اور میری آنکھوں نے دیکھا جب رسول اللہ صلی اللہ علیہ وسلم گفتگو فرما رہے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہو وہ اپنے پڑوسی کا اکرام کرے اور جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہو وہ اپنے مہمان کی دستور کے موافق ہر طرح سے عزت کرے ۔ پوچھا یا رسول اللہ ! دستور کے موافق کب تک ہے ۔ فرمایا ایک دن اور ایک رات اور میزبانی تین دن کی ہے اور جو اس کے بعد ہو وہ اس کے لیے صدقہ ہے اور جو اللہ اورآخرت کے دن پر ایمان رکھتا ہو وہ بہتر بات کہے یا خاموش رہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 173260,
        "last_updated": null
    },
    {
        "urduURN": 4059380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6020,
        "hadithSanad": "ہم سے حجاج بن منہال نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا کہ مجھے ابو عمران نے خبر دی ، کہا کہ میں نے طلحہ سے سنا اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میں نے عرض کیا یا رسول اللہ ! میری پڑوسنیں ہیں ( اگر ہدیہ ایک ہو تو ) میں ان میں سے کس کے پاس ہدیہ بھیجوں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا جس کا دروازہ تم سے ( تمہارے دروازے سے ) زیادہ قریب ہو ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 173270,
        "last_updated": null
    },
    {
        "urduURN": 4059390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6021,
        "hadithSanad": "ہم سے علی بن عیاش نے بیان کیا ، انہوں نے کہا ہم سے ابو غسان نے بیان کیا ، انہوں نے کہا مجھ سے محمد بن منکدر نے بیان کیا ، ان سے حضرت جابر بن عبداللہ رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ہر نیک کام صدقہ ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 173280,
        "last_updated": null
    },
    {
        "urduURN": 4059400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6022,
        "hadithSanad": "ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے ، ان سے سعید بن ابی بردہ بن ابی موسیٰ اشعری نے بیان کیا ، ان سے ان کے والد نے اور ان سے ان کے دادا ( ابوموسیٰ اشعری رضی اللہ عنہ ) نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ہر مسلمان پر صدقہ کرنا ضروری ہے ۔ صحابہ کرام رضی اللہ عنہم نے عرض کیا اگر کوئی چیز کسی کو ( صدقہ کے لیے ) جو میسر نہ ہو ۔ آپ صلی اللہ علیہ وسلم نے فرمایا پھر اپنے ہاتھ سے کام کرے اور اس سے خود کو بھی فائدہ پہنچائے اورصدقہ بھی کرے ۔ صحابہ کرام رضی اللہ عنہم نے عرض کی اگر اس میں اس کی طاقت نہ ہو یا کہا کہ نہ کر سکے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر کسی حاجت مند پریشان حال کی مدد کرے ۔ صحابہ کرام رضی اللہ عنہم نے عرض کیا اگر وہ یہ بھی نہ کر سکے ۔ فرمایا کہ پھر بھلائی کی طرف لوگوں کو رغبت دلائے یا ” امر بالمعروف “ کا کرنا عرض کیا اور اگر یہ بھی نہ کر سکے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر برائی سے رکا رہے کہ یہ بھی اس کے لیے صدقہ ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 173290,
        "last_updated": null
    },
    {
        "urduURN": 4059410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6023,
        "hadithSanad": "ہم سے ابو الولید نے بیان کیا ، کہا ہم سے شعبہ نے ، کہا کہ مجھے عمرو نے خبر دی ، انہیں خیثمہ نے اور ان سے عدی بن حاتم رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے جہنم کا ذکر کیا اور اس سے پناہ مانگی اور چہرے سے اعراض و ناگواری کا اظہار کیا ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے جہنم کا ذکر کیا اور اس سے پناہ مانگی اور چہرے سے اعراض و ناگواری کا اظہار کیا ، شعبہ نے بیان کیا کہ دو مرتبہ آنحضرت صلی اللہ علیہ وسلم کے جہنم سے پناہ مانگنے کے سلسلے میں مجھے کوئی شک نہیں ہے ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جہنم سے بچو ۔ خواہ آدھی کھجور ہی ( کسی کو ) صدقہ کر کے ہو سکے اور اگر کسی کو یہ بھی میسر نہ ہو تو اچھی بات کر کے ہی ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 173300,
        "last_updated": null
    },
    {
        "urduURN": 4059420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6024,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے ابراہیم بن سعید نے بیان کیا ، ان سے صالح نے ، ان سے ابن شہاب نے اور ان سے عروہ بن زبیر نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ کچھ یہودی رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور کہا ” السام علیکم “ ( تمہیں موت آئے ) حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ میں اس کا مفہوم سمجھ گئی اور میں نے ان کا جواب دیا کہ وعلیکم السام واللعنۃ “ ( یعنی تمہیں موت آئے اورلعنت ہو ) بیان کیا کہ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ٹھہرو ، اے عائشہ ! اللہ تعالیٰ تمام معاملات میں نرمی اور ملائمت کو پسند کرتا ہے ۔ میں نے عرض کیا یا رسول اللہ ! کیا آپ نے سنا نہیں انہوں نے کیا کہا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں نے اس کا جواب دے دیا تھا کہ وعلیکم ( اور تمہیں بھی ) ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 173310,
        "last_updated": null
    },
    {
        "urduURN": 4059430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6025,
        "hadithSanad": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ثابت نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہا کہ",
        "hadithText": "ایک دیہاتی نے مسجد میں پیشاب کر دیا تھا ۔ صحابہ کرام ان کی طرف دوڑے لیکن رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اس کے پیشاب کو مت روکو ۔ پھر آپ نے پانی کا ڈول منگوایا اور وہ پیشاب کی جگہ پر بہا دیا گیا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 173320,
        "last_updated": null
    },
    {
        "urduURN": 4059440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6026,
        "hadithSanad": "ہم سے محمدبن یونس نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے ابوبردہ برید بن ابی بردہ نے کہا کہ مجھے میرے دادا ابوبردہ نے خبر دی ، ان سے ان کے والد ابوموسیٰ اشعری رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ایک مومن دوسرے مومن کے لیے اس طرح ہے جیسے عمارت کہ اس کا ایک حصہ دوسرے حصے کو تھامے رہتا ہے ( گرنے نہیں دیتا ) پھر آپ نے اپنی انگلیوں کو قینچی کی طرح کر لیا ۔ \n<span class=urdu_sanad></span> اور ایسا ہو اکہ آنحضور صلی اللہ علیہ وسلم اس وقت بیٹھے ہوئے تھے کہ ایک صاحب نے آ کر سوال کیا یا کوئی ضرورت پوری کرانی چاہی ۔ آنحضرت صلی اللہ علیہ وسلم ہماری طرف متوجہ ہوئے اور فرمایا کہ تم خاموش کیوں بیٹھے رہتے ہو بلکہ اس کی سفارش کرو تاکہ تمہیں بھی اجر ملے اور اللہ جو چاہے گا اپنے نبی کی زبان پر جاری کرے گا ( تم اپنا ثواب کیوں کھوؤ ) ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 173331,
        "last_updated": null
    },
    {
        "urduURN": 4059460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6028,
        "hadithSanad": "ہم سے محمد بن العلاء نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے برید نے ، ان سے ابوبردہ نے اور ان سے حضرت ابوموسیٰ اشعری رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے پاس جب کوئی مانگنے والا یا ضرورت مند آتا تو آپ فرماتے کہ لوگو ! تم سفارش کرو تاکہ تمہیں بھی ثواب ملے اور اللہ اپنے نبی کی زبان پر جو چاہے گا فیصلہ کرائے گا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 173350,
        "last_updated": null
    },
    {
        "urduURN": 4059470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6029,
        "hadithSanad": "ہم سے حفص بن عمر بن حارث ابوعمرو حوش نے بیان کیا ، کہا ہم سے شعبہ بن حجاج نے بیان کیا ، ان سے سلیمان نے ، انہوں نے ابووائل شقیق بن سلمہ سے سنا ، انہوں نے مسروق سے سنا ، انہوں نے بیان کیا کہ عمر رضی اللہ عنہ نے کہا ( دوسری سند ) امام بخاری نے کہا ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے اعمش نے ، ان سے شقیق بن سلمہ نے اور ان سے مسروق نے بیان کیا کہ",
        "hadithText": "جب معاویہ رضی اللہ عنہ کے ساتھ عبداللہ بن عمر و بن عاص کوفہ تشریف لائے تو ہم ان کی خدمت میں حاضر ہوئے ۔ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کا ذکر کیا اور بتلایا کہ حضور اکرم صلی اللہ علیہ وسلم بد گو نہ تھے اور نہ آپ بدزبان تھے اور انہوں نے یہ بھی بیان کیا کہ آپ نے فرمایا کہ تم میں سب سے بہتر وہ آدمی ہے ، جس کے اخلاق سب سے اچھے ہوں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 173360,
        "last_updated": null
    },
    {
        "urduURN": 4059480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6030,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو عبدالوہاب ثقفی نے خبر دی ، انہیں ایوب سختیانی نے ، انہیں عبداللہ بن ابی ملیکہ نے اور انہیں حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "کچھ یہودی رسول اللہ صلی اللہ علیہ وسلم کے یہاں آئے اور کہا ” السام علیکم “ ( تم پر موت آئے ) اس پر حضرت عائشہ رضی اللہ عنہا نے کہا کہ تم پر بھی موت آئے اور اللہ کی تم پر لعنت ہو اور اس کا غضب تم پر نازل ہو ۔ لیکن آنحضرت صلی اللہ علیہ وسلم نے فرمایا ( ٹھہرو ) عائشہ رضی اللہ عنہا ! تمہیں نرم خوئی اختیار کرنے چاہیے سختی اور بدزبانی سے بچنا چاہیئے ۔ حضرت عائشہ رضی اللہ عنہا نے عرض کیا ، حضور آپ نے ان کی بات نہیں سنی ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا تم نے انہیں میرا جواب نہیں سنا ، میں نے ان کی بات انہیں پر لوٹا دی اور ان کے حق میں میری بددعا قبول ہو جائے گی ۔ لیکن میرے حق میں ان کی بددعا قبول ہی نہ ہو گی ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 173370,
        "last_updated": null
    },
    {
        "urduURN": 4059490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6031,
        "hadithSanad": "ہم سے اصبغ بن فرج نے بیان کیا ، انہوں نے کہا کہ مجھے عبداللہ بن وہب نے خبر دی انہوں نے کہا ہم کو ابو یحییٰ فلیح بن سلیمان نے خبر دی ، انہیں ہلال بن اسامہ نے بیان کیا اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نہ گالی دیتے تھے نہ بدگو تھے نہ بدخو تھے اور نہ لعنت ملامت کرتے تھے ۔ اگر ہم میں سے کسی پر ناراض ہوتے اتنا فرماتے اسے کیا ہو گیا ہے ۔ اس کی پیشانی میں خاک لگے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 173380,
        "last_updated": null
    },
    {
        "urduURN": 4059500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6032,
        "hadithSanad": "ہم سے عمرو بن عیسیٰ نے بیان کیا ، کہا ہم سے محمد بن سواء نے بیان کیا ، کہا ہم سے روح ابن قاسم نے بیان کیا ، ان سے محمد بن منکدر نے ، ان سے عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم سے ایک شخص نے اندر آنے کی اجازت چاہی ۔ آنحضرت صلی اللہ علیہ وسلم نے اسے دیکھ کر فرمایا کہ برا ہے فلاں قبیلہ کا بھائی ۔ یا ( آپ نے فرمایا ) کہ برا ہے فلاں قبیلہ کا بیٹا ۔ پھر جب وہ آنحضرت صلی اللہ علیہ وسلم کے پاس آبیٹھا تو آپ اس کے ساتھ بہت خوش خلقی کے ساتھ پیش آئے ۔ وہ شخص جب چلا گیا تو حضرت عائشہ رضی اللہ عنہا نے آپ سے عرض کیا یا رسول اللہ ! جب آپ نے اسے دیکھا تھا تو اس کے متعلق یہ کلمات فرمائے تھے ، جب آپ اس سے ملے تو بہت ہی خندہ پیشانی سے ملے ۔ آنحضرت نے فرمایا اے عائشہ ! تم نے مجھے بدگو کب پایا ۔ اللہ کے یہاں قیامت کے دن وہ لوگ بدترین ہوں گے جن کے شر کے ڈر سے لوگ اس سے ملنا چھوڑ دیں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 173390,
        "last_updated": null
    },
    {
        "urduURN": 4059510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6033,
        "hadithSanad": "ہم سے عمرو بن عون نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ثابت نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم سب سے زیادہ خوبصورت سب سے زیادہ سخی اور سب سے زیادہ بہادر تھے ۔ ایک رات مدینہ والے ( شہر کے باہر شورسن کر ) گھبرا گئے ۔ ( کہ شاید دشمن نے حملہ کیا ہے ) سب لوگ اس شور کی طرف بڑھے ۔ لیکن آنحضرت صلی اللہ علیہ وسلم آواز کی طرف بڑھنے والوں میں سب سے آگے تھے اورفرماتے جاتے تھے کہ کوئی ڈر کی بات نہیں ، کوئی ڈر کی بات نہیں ، آنحضرت صلی اللہ علیہ وسلم اس وقت ابوطلحہ کے ( مندوب نامی ) گھوڑے کی ننگی پیٹھ پر سوار تھے ، اس پر کوئی زین نہیں تھی اور گلے میں تلوار لٹک رہی تھی ۔ آپ نے فرمایا کہ میں نے اس گھوڑے کو سمندر پایا ۔ یا فرمایا کہ یہ تیز دوڑنے میں سمندر کی طرح تھا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 173400,
        "last_updated": null
    },
    {
        "urduURN": 4059520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6034,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو سفیان نے خبر دی ، ان سے ابن منکدر نے بیان کیا ، انہوں نے حضرت جابر رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "کبھی ایسا نہیں ہوا کہ رسول اللہ صلی اللہ علیہ وسلم سے کسی نے کوئی چیز مانگی ہو اور آپ نے اس کے دینے سے انکار کیا ہو ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 173410,
        "last_updated": null
    },
    {
        "urduURN": 4059530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6035,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا مجھ سے میرے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا مجھ سے شفیق نے بیان کیا ، ان سے مسروق نے بیان کیا کہ",
        "hadithText": "ہم عبداللہ بن عمرو کے پاس بیٹھے ہوئے تھے ، وہ ہم سے باتیں کر رہے تھے اسی دوران انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نہ بدگو تھے نہ بد زبانی کرتے تھے ( کہ منہ سے گالیاں نکالیں ) بلکہ آپ فرمایا کرتے تھے کہ تم میں سب سے زیادہ بہتر وہ ہے جس کے اخلاق سب سے اچھے ہوں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 173420,
        "last_updated": null
    },
    {
        "urduURN": 4059540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6036,
        "hadithSanad": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم سے ابو غسان ( محمد بن مطرف ) نے بیان کیا کہ کہا مجھ سے ابوحازم نے بیان کیا ، ان سے سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک خاتون نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ” بردہ “ لے کر ائیں پھر حضرت سہل نے موجود لوگوں سے کہا تمہیں معلوم ہے ، کہ بردہ کیا چیز ہے ؟ لوگوں نے کہا کہ بردہ شملہ کو کہتے ہیں ۔ سہل رضی اللہ عنہ نے کہا کہ ہاں لنگی جس میں حاشیہ بنا ہوا ہوتا ہے تو اس خاتون نے عرض کیا کہ یا رسول اللہ ! میں یہ لنگی آپ کے پہننے کے لئے لائی ہوں ۔ حضور اکرم صلی اللہ علیہ وسلم نے وہ لنگی ان سے قبول کر لی ۔ اس وقت آپ کو اس کی ضرورت بھی تھی پھر آپ نے پہن لیا ۔ صحابہ میں سے ایک صحابی عبدالرحمٰن بن عوف رضی اللہ عنہ نے آنحضرت صلی اللہ علیہ وسلم کے بدن پروہ لنگی دیکھی تو عرض کیا یا رسول اللہ ! یہ بڑی عمدہ لنگی ہے ، آپ مجھے اس کو عنایت فرما دیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ لے لو ، جب آنحضرت صلی اللہ علیہ وسلم وہاں سے اٹھ کر تشریف لے گئے تو اندر جا کر وہ لنگی بدل کرتہہ کر کے عبدالرحمٰن کو بھیج دی تو لوگوں نے ان صاحب کو ملامت سے کہا کہ تم نے آنحضرت صلی اللہ علیہ وسلم سے لنگی مانگ کر اچھا نہیں کیا ، تم نے دیکھ لیا تھا کہ آنحضرت صلی اللہ علیہ وسلم نے اسے اس طرح قبول کیا تھا گویا آپ کو اس کی ضرورت تھی ۔ اس کے باوجود تم نے لنگی آنحضرت صلی اللہ علیہ وسلم سے مانگی ، حالانکہ تمہیں معلوم ہے کہ آنحضرت صلی اللہ علیہ وسلم سے جب بھی کوئی چیز مانگی جاتی ہے تو آپ انکار نہیں کرتے ۔ اس صحابی نے عرض کیا کہ میں تو صرف اس کی برکت کا امیدوار ہوں کہ آنحضرت صلی اللہ علیہ وسلم اسے پہن چکے تھے میری غرض یہ تھی کہ میں اس لنگی میں کفن دیا جاؤں گا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 173430,
        "last_updated": null
    },
    {
        "urduURN": 4059550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6037,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے کہا کہ مجھے حمید بن عبدالرحمٰن نے خبر دی اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا زمانہ جلدی جلدی گزر ے گا اور دین کا علم دنیا میں کم ہو جائے گا اور دلوں میں بخیلی سما جائے گی اور لڑائی بڑھ جائے گی ۔ صحابہ رضی اللہ عنہم نے عرض کیا ” ہرج “ کیا ہوتا ہے ؟ فرمایا قتل خون ریزی ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 173440,
        "last_updated": null
    },
    {
        "urduURN": 4059560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6038,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے سلام بن مسکین سے سنا ، کہا کہ میں نے ثابت سے سنا ، کہا کہ ہم سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کی دس سال تک خدمت کی لیکن آپ نے کبھی مجھے اف تک نہیں کہا اور نہ کبھی یہ کہا کہ فلاں کام کیوں کیا اور فلاں کام کیوں نہیں کیا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 173450,
        "last_updated": null
    },
    {
        "urduURN": 4059570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6039,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے حکم نے ، ان سے ابراہیم نخعی نے ، ان سے اسود نے بیان کیا کہ میں نے حضرت عائشہ رضی اللہ عنہا سے پوچھا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم اپنے گھر میں کیا کرتے تھے ؟ فرمایا آنحضرت صلی اللہ علیہ وسلم اپنے گھر کے کام کاج کرتے اور جب نماز کاوقت ہو جاتا تو نماز کے لئے مسجد تشریف لے جاتے تھے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 173460,
        "last_updated": null
    },
    {
        "urduURN": 4059580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6040,
        "hadithSanad": "ہم سے عمرو بن علی نے بیان کیا ، کہا ہم سے ابو عاصم نے ، ان سے ابن جریج نے ، کہا مجھ کو موسیٰ بن عقبہ نے خبر دی ، انہیں نافع نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جب اللہ کسی بندہ سے محبت کرتا ہے تو جبرائیل علیہ السلام کو آواز دیتا ہے کہ اللہ فلاں بندہ سے محبت کرتا ہے تم بھی اس سے محبت کرو ۔ جبرائیل علیہ السلام بھی اس سے محبت کرنے لگتے ہیں ، پھر وہ تمام آسمان والوں میں آواز دیتے ہیں کہ اللہ فلاں بندہ سے محبت کرتا ہے ۔ تم بھی اس سے محبت کرو ۔ پھر تمام آسمان والے اس سے محبت کرنے لگتے ہیں ۔ اس کے بعد وہ زمین میں بھی ( بندگان خدا کا ) مقبول اورمحبوب بن جاتا ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 173470,
        "last_updated": null
    },
    {
        "urduURN": 4059590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6041,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کوئی شخص ایمان کی حلاوت ( مٹھاس ) اس وقت تک نہیں پا سکتا جب تک وہ کسی شخص سے محبت کرئے تو صرف اللہ کے لئے کرے اور اس کو آگ میں ڈالا جانا اچھا لگے لیکن ایمان کے بعد کفر میں جانا اسے پسند نہ ہو ، اور جب تک اللہ اور اس کے رسول سے اسے ان کے سوا دوسری تمام چیزوں کے مقابلے میں زیادہ محبت نہ ہو ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 173480,
        "last_updated": null
    },
    {
        "urduURN": 4059600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6042,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے عبداللہ بن زمعہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے کسی کی ریح خارج ہونے پر ہنسنے سے منع فرمایا اور آپ نے یہ بھی فرمایا کہ تم میں سے کس طرح ایک شخص اپنی بیوی کو زور سے مارتا ہے جیسے اونٹ ، حالانکہ اس کی پوری امید ہے کہ شام میں اسے وہ گلے لگائے گا ۔ اور ثوری ، وہیب اور ابومعاویہ نے ہشام سے بیان کیا کہ ( جانور کی طرح ) کے بجائے لفظ غلام کی طرح کا استعمال کیا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 173490,
        "last_updated": null
    },
    {
        "urduURN": 4059610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6043,
        "hadithSanad": "مجھ سے محمد بن مثنیٰ نے بیان کیا ، انہوں نے کہا ہم سے یزید بن ہارون نے بیان کیا ، انہوں نے کہا ہم کو عاصم بن محمد بن زید نے خبر دی ، انہوں نے کہا مجھے میرے والد اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ( حجۃ الوداع ) کے موقع پر منیٰ میں فرمایا تم جانتے ہو یہ کون سا دن ہے ؟ صحابہ بولے اللہ اور اس کے رسول کو زیادہ علم ہے ۔ فرمایا یہ حرمت والا دن ہے ” تم جانتے ہو یہ کون سا شہر ہے ؟ صحابہ بولے اللہ اور اس رسول کو زیادہ علم ہے ، فرمایا یہ حرمت والا شہر ہے ۔ تم جانتے ہو یہ کون سا مہینہ ہے ؟ صحابہ بولے اللہ اور اس کے رسول کو زیادہ علم ہے فرمایا یہی حرمت والا مہینہ ہے ۔ پھر فرمایا بلاشبہ اللہ نے تم پر تمہارا ( ایک دوسرے کا ) خون ، مال اور عزت اسی طرح حرام کیا ہے جیسے اس دن کواس نے تمہارے اس مہینہ میں اور تمہارے اس شہر میں حرمت والا بنایا ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 173500,
        "last_updated": null
    },
    {
        "urduURN": 4059620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6044,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے منصور نے بیان کیا ، کہا میں نے ابووائل سے سنا اور وہ عبداللہ بن مسعود رضی اللہ عنہما سے بیان کرتے تھے کہ انہوں نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا مسلمان کو گالی دینا گناہ ہے اور اس کو قتل کرنا کفر ہے ۔ غندر نے شعبہ سے روایت کرنے میں سلیمان کی متابعت کی ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 173510,
        "last_updated": null
    },
    {
        "urduURN": 4059630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6045,
        "hadithSanad": "ہم سے ابو معمر عبداللہ بن عمرو نے بیان کیا ، انہوں نے کہا ہم سے عبدالوارث نے بیان کیا ، ان سے حسین بن ذکوان معلم نے بیان کیا ، ان سے عبداللہ بن بریدہ نے بیان کیا ، انہوں نے کہا مجھ سے یحییٰ بن یعمر نے بیان کیا ، ان سے ابوالاسود دیلی نے بیان کیا اور ان سے حضرت ابوذر غفاری رضی اللہ عنہ نے کہ",
        "hadithText": "انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اگر کوئی شخص کسی شخص کو کافر یا فاسق کہے اور وہ درحقیقت کافر یا فاسق نہ ہو تو خود کہنے والا فاسق اورکافر ہو جائے گا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 173520,
        "last_updated": null
    },
    {
        "urduURN": 4059640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6046,
        "hadithSanad": "ہم سے محمد بن سنان نے بیان کیا ، کہا ہم سے فلیح بن سلیمان نے بیان کیا کہا ہم سے ہلال بن علی نے بیان کیا اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم فحش گو نہیں تھے ، نہ آپ لعنت ملامت کرنے والے تھے اور نہ گالی دیتے تھے ، آپ کو بہت غصہ آتا تو صرف اتنا کہہ دیتے ، اسے کیا ہو گیا ہے ، اس کی پیشانی پہ خاک لگے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 173530,
        "last_updated": null
    },
    {
        "urduURN": 4059650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6047,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے عثمان بن عمر نے ، کہا ہم سے علی بن مبارک نے بیان کیا ، ان سے یحییٰ بن ابی کثیر نے ، ان سے ابوقلابہ نے کہ",
        "hadithText": "ثابت بن ضحاک رضی اللہ عنہ اصحاب شجر ( بیعت رضوان کرنے والوں ) میں سے تھے ، انہوں نے ان سے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو اسلام کے سوا کسی اور مذہب پر قسم کھائے ( کہ اگر میں نے فلاں کام کیا تو میں نصرانی ہوں ، یہودی ہوں ) تو وہ ایسا ہو جائے گا جیسے کہ اس نے کہا اور کسی انسان پر ان چیزوں کی نذر صحیح نہیں ہوتی جو اس کے اختیار میں نہ ہوں اور جس نے دنیا میں کسی چیز سے خودکشی کر لی اسے اسی چیز سے آخرت میں عذاب ہو گا اور جس نے کسی مسلمان پر لعنت بھیجی تو یہ اس کے خون کرنے کے برابر ہے اور جو شخص کسی مسلمان کو کافر کہے تو وہ ایسا ہے جیسے اس کا خون کیا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 173540,
        "last_updated": null
    },
    {
        "urduURN": 4059660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6048,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا کہ مجھ سے عدی بن ثابت نے بیان کیا کہ",
        "hadithText": "میں نے سلیمان بن صرد سے سنا وہ نبی کریم صلی اللہ علیہ وسلم کے صحابی ہیں ، انہوں نے کہا کہ حضور اکرم صلی اللہ علیہ وسلم کے سامنے دو آدمیوں نے آپس میں گالی گلوچ کی ایک صاحب کو غصہ آ گیا اور بہت زیادہ آیا ، ان کا چہرہ پھول گیا اوررنگ بدل دیا گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے اس وقت فرمایا کہ مجھے ایک کلمہ معلوم ہے کہ اگر ( غصہ کرنے والا شخص ) اسے کہہ لے تو اس کا غصہ دور ہو جائے گا ۔ چنانچہ ایک صاحب نے جا کر غصہ ہونے والے کو آنحضرت صلی اللہ علیہ وسلم کا ارشاد سنایا اور کہا شیطان سے اللہ کی پناہ مانگ وہ کہنے لگا کیا تم مجھ کو روگی سمجھتے ہو یا دیوانہ ؟ جا اپنا راستہ لے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 173550,
        "last_updated": null
    },
    {
        "urduURN": 4059670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6049,
        "hadithSanad": "ہم سے مسددنے بیان کیا ، کہا ہم سے بشر بن مفضل نے بیان کیا ، ان سے حمید نے بیان کیا ، ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "مجھ سے عبادہ بن صامت رضی اللہ عنہ نے کہا ، نبی کریم صلی اللہ علیہ وسلم لوگوں کو لیلۃالقدر کی بشارت دینے کے لئے حجرے سے باہر تشریف لائے ، لیکن مسلمانوں کے دو آدمی اس وقت آپس میں کسی بات پر لڑنے لگے ۔ آپ نے فرمایا کہ میں تمہیں ( لیلۃالقدر کے متعلق ) بتانے کے لئے نکلا تھا لیکن فلاں فلاں آپس میں لڑنے لگے اور ( میرے علم سے ) وہ اٹھالی گئی ۔ ممکن ہے کہ یہی تمہارے لئے اچھا ہو ۔ اب تم اسے 29 رمضان اور 27 رمضان اور 25 رمضان کی راتوں میں تلاش کرو ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 173560,
        "last_updated": null
    },
    {
        "urduURN": 4059680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6050,
        "hadithSanad": "مجھ سے عمر بن حفص بن غیاث نے بیان کیا ، کہا مجھ سے میرے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، ان سے معرور نے اور ان سے حضرت ابوذر رضی اللہ عنہ نے ، معرور نے بیان کیا کہ",
        "hadithText": "میں نے ابوذر رضی اللہ عنہ کے جسم پر ایک چادر دیکھی اور ان کے غلام کے جسم پر بھی ایک ویسی ہی چادر تھی ، میں نے عرض کیا اگر اپنے غلام کی چادر لے لیں اور اسے بھی پہن لیں تو ایک رنگ کا جوڑا ہو جائے غلام کو دوسرا کپڑا دے دیں ۔ حضرت ابوذر رضی اللہ عنہ نے اس پر کہا کہ مجھ میں اور ایک صاحب ( بلال رضی اللہ عنہ ) میں تکرار ہو گئی تھی تو ان کی ماں عجمی تھیں ، میں نے اس بارے میں ان کو طعنہ دے دیا انہوں نے جا کر یہ بات نبی کریم صلی اللہ علیہ وسلم سے کہہ دی ۔ آنحضرت صلی اللہ علیہ وسلم نے مجھ سے دریافت فرمایا کیا تم نے اس سے جھگڑا کیا ہے ؟ میں نے عرض کیا جی ہاں ۔ دریافت کی تم نے اسے اس کی ماں کی وجہ سے طعنہ دیا ہے ؟ میں نے عرض کیا جی ہاں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تمہارے اندر ابھی جاہلیت کی بو باقی ہے ۔ میں نے عرض کیا یا رسول اللہ ! اس بڑھاپے میں بھی ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں یاد رکھو یہ ( غلام بھی ) تمہارے بھائی ہیں ، اللہ تعالیٰ نے انہیں تمہاری ما تحتیٰ میں دیا ہے ، پس اللہ تعالیٰ جس کی ما تحتیٰ میں بھی اس کے بھائی کو رکھے اسے چاہئے کہ جو وہ کھائے اسے بھی کھلائے اور جو وہ پہنے اسے بھی پہنائے اور اسے ایسا کام کرنے کے لیے نہ کہے ، جو اس کے بس میں نہ ہو اگر اسے کوئی ایسا کام کرنے کے لئے کہنا ہی پڑے تو اس کام میں اس کی مدد کرے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 173570,
        "last_updated": null
    },
    {
        "urduURN": 4059690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6051,
        "hadithSanad": "ہم سے حفص بن عمر حوضی نے بیان کیا ، کہا ہم سے یزید بن ابراہیم نے بیان کیا ، کہا ہم سے محمد بن سیرین نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ہمیں ظہر کی نماز دو رکعت پڑھائی اور سلام پھیر دیا اس کے بعد آپ مسجد کے آگے کے حصہ یعنی دالان میں ایک لکڑی پر سہارا لے کر کھڑے ہو گئے اور اس پر اپنا ہاتھ رکھا ، حاضرین میں حضرت ابوبکر اور عمر بھی موجود تھے مگر آپ کے دبدبے کی وجہ سے کچھ بول نہ سکے اور جلد باز لوگ مسجد سے باہر نکل گئے آپس میں صحابہ نے کہا کہ شاید نماز میں رکعات کم ہو گئیں ہیں اسی لیے آنحضرت صلی اللہ علیہ وسلم نے ظہر کی نماز چار کے بجائے صرف دو ہی رکعات پڑھائیں ہیں ۔ حاضرین میں ایک صحابی تھے جنہیں آپ ” ذوالیدین “ ( لمبے ہاتھوںوالا ) کہہ کر مخاطب فرمایا کرتے تھے ، انہوں نے عرض کیا اے اللہ کے نبی ! نماز کی رکعات کم ہو گئیں ہیں یا آپ بھول گئے ہیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، نہ میں بھولا ہوں اور نہ نماز کی رکعات کم ہوئیں ہیں ۔ صحابہ نے عرض کیا نہیں یا رسول اللہ ! آپ بھول گئے ہیں ، چنانچہ آپ نے یاد کر کے فرمایا کہ ذوالیدین نے صحیح کہا ہے ۔ پھر آپ کھڑے ہوئے اور دو رکعات اور پڑھائیں پھر سلام پھیرا اور تکبیر کہہ کر سجدہ ( سہو ) میں گئے ، نماز کے سجدہ کی طرح بلکہ اس سے بھی زیادہ لمبا سجدہ کیا پھر سر اٹھایا اور تکبیر کہہ کر پھر سجدہ میں گئے پہلے سجدہ کی طرح یا اس سے بھی لمبا ۔ پھر سر اٹھایا اور تکبیر کہی ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 173580,
        "last_updated": null
    },
    {
        "urduURN": 4059700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6052,
        "hadithSanad": "ہم سے یحییٰ بن موسیٰ بلخی نے بیان کیا ، کہا ہم سے وکیع نے بیان کیا ، ان سے اعمش نے بیان کیا ، انہوں نے مجاہد سے سنا ، وہ طاؤس سے بیان کرتے تھے اور وہ حضرت ابن عباس رضی اللہ عنہما سے ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم دو قبروں کے پاس سے گزرے اور فرمایا کہ ان دونوں مردوں کو عذاب ہو رہا ہے اور یہ کسی بڑے گناہ کی وجہ سے عذاب میں گرفتار نہیں ہیں بلکہ یہ ( ایک قبر کا مردہ ) اپنے پیشاب کی چھینٹوں سے نہیں بچتا تھا ( یا پیشاب کرتے وقت پردہ نہیں کرتا تھا ) اور یہ ( دوسری قبر والا مردہ ) چغل خور تھا ، پھر آپ نے ایک ہری شاخ منگائی اور اسے دو ٹکڑوں میں توڑ کر دونوں قبروں پر گاڑ دیا اس کے بعد فرمایا کہ جب تک یہ شاخیں سوکھ نہ جائیں اس وقت تک شاید ان دونوں کا عذاب ہلکا رہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 173590,
        "last_updated": null
    },
    {
        "urduURN": 4059710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6053,
        "hadithSanad": "ہم سے قبیصہ بن عقبہ نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ابوالزناد نے ، ان سے ابوسلمہ نے اور ان سے حضرت ابواسید ساعدی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، قبیلہ انصار میں سب سے بہتر گھرانہ بنو نجار کا گھرانہ ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 173600,
        "last_updated": null
    },
    {
        "urduURN": 4059720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6054,
        "hadithSanad": "ہم سے صدقہ بن فضل نے بیان کیا ، انہوں نے کہا ہم کو سفیان بن عیینہ نے خبر دی ، انہوں نے محمد بن منکدر سے سنا ، انہوں نے عروہ بن زبیر سے سنا اور انہیں ام المؤمنین حضرت عائشہ رضی اللہ عنہا نے خبر دی ، انہوں نے بیان کیا کہ",
        "hadithText": "ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم سے اندر آنے کی اجازت چاہی تو آپ نے فرمایا کہ اسے اجازت دے دو ، فلاں قبیلہ کا یہ برا آدمی ہے جب وہ شخص اندر آیا تو آپ نے اس کے ساتھ بڑی نرمی سے گفتگو کی ، میں نے عرض کیا یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! آپ کو اس کے متعلق جو کچھ کہنا تھا وہ ارشاد فرمایا اور پھر اس کے ساتھ نرم گفتگو کی ۔ آپ نے فرمایا ، عائشہ ! وہ بدترین آدمی ہے جسے اس کی بدکلامی کے ڈر سے لوگ چھوڑ دیں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 173610,
        "last_updated": null
    },
    {
        "urduURN": 4059730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6055,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو عبیدہ بن عبدالرحمٰن نے خبر دی ، انہیں منصور بن معمر نے ، انہیں مجاہد نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم مدینہ منورہ کے کسی باغ سے تشریف لائے تو آپ نے دو ( مردہ ) انسانوں کی آواز سنی جنہیں ان کی قبر وں میں عذاب دیا جا رہا تھا پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا انہیں عذاب ہو رہا ہے اور کسی بڑے گناہ کی وجہ سے انہیں عذاب نہیں ہو رہا ہے ۔ ان میں سے ایک شخص پیشاب کے چھینٹوں سے نہیں بچتا تھا اور دوسرا چغل خور تھا ۔ پھر آپ نے کھجور کی ایک ہری شاخ منگوائی اور اسے دو حصوں میں توڑ ا اور ایک ٹکڑا ایک کی قبر پر اور دوسرا دوسرے کی قبر پر گاڑ دیا ۔ پھر فرمایا شاید کہ ان کے عذاب میں اس وقت تک کے لیے کمی کر دی جائے ، جب تک یہ سوکھ نہ جائیں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 173620,
        "last_updated": null
    },
    {
        "urduURN": 4059740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6056,
        "hadithSanad": "ہم سے ابونعیم ( فضل بن دکین ) نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے منصور بن معمر نے ، ان سے ابراہیم نخعی نے ، ان سے ہمام بن حارث نے بیان کیا کہ",
        "hadithText": "ہم حضرت حذیفہ رضی اللہ عنہ کے پاس موجود تھے ، ان سے کہا گیا کہ ایک شخص ایسا ہے جو یہاں کی باتیں حضرت عثمان سے جا لگا تا ہے ۔ اس پر حضرت حذیفہ رضی اللہ عنہ نے کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے آپ نے بتلایا کہ جنت میں چغل خور نہیں جائے گا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 173630,
        "last_updated": null
    },
    {
        "urduURN": 4059750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6057,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، کہا ہم سے ابن ابی ذئب نے بیان کیا ، ان سے سعید مقبری نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جو شخص ( روزہ کی حالت میں ) جھوٹ بات کرنا اور فریب کرنا اور جہالت کی باتوں کو نہ چھوڑے تو اللہ کو اس کی کوئی ضرورت نہیں کہ وہ اپنا کھانا پینا چھوڑے ۔ احمد بن یونس نے کہا یہ حدیث میں نے سنی تو تھی مگر میں اس کی سند بھول گیا تھا جو مجھ کو ایک شخص ( ابن ابی ذئب ) نے بتلادی ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 173640,
        "last_updated": null
    },
    {
        "urduURN": 4059760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6058,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، انہوں نے کہا مجھ سے میرے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا ہم سے ابوصالح نے بیان کیا ، ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، تم قیامت کے دن اللہ کے ہاں اس شخص کو سب سے بد تر پاؤ گے جو کچھ لوگوں کے سامنے ایک رخ سے آتا ہے اور دوسروں کے سامنے دوسرے رخ سے جاتا ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 173650,
        "last_updated": null
    },
    {
        "urduURN": 4059770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6059,
        "hadithSanad": "ہم سے محمد بن یوسف فریابی نے بیان کیا ، کہا ہم کو سفیان ثوری نے خبر دی ، انہیں اعمش نے ، انہیں ابووائل نے اور ان سے حضرت ابن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے کچھ مال تقسیم کیا تو انصار میں سے ایک شخص نے کہا کہ اللہ کی قسم محمد صلی اللہ علیہ وسلم کو اس تقسیم سے اللہ کی رضا مقصود نہ تھی ۔ میں نے آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر اس شخص کی یہ بات آپ کو سنائی تو آنحضرت صلی اللہ علیہ وسلم کے چہرے کا رنگ بدل گیا اور آپ نے فرمایا اللہ موسیٰ علیہ السلام پر رحم کرے ، انہیں اس سے بھی زیادہ ایذا دی گئی ، لیکن انہوں نے صبر کیا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 173660,
        "last_updated": null
    },
    {
        "urduURN": 4059780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6060,
        "hadithSanad": "ہم سے محمد بن صباح نے بیان کیا ، کہا ہم سے اسماعیل بن زکریا نے بیان کیا ، انہوں نے کہا کہ ہم سے برید بن عبداللہ بن ابی بردہ نے بیان کیا ، ان سے ابوبردہ نے اور ان سے حضرت ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے سنا کہ ایک شخص دوسرے شخص کی تعریف کر رہا ہے اور تعریف میں بہت مبالغہ سے کام لے رہا تھا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا تم نے اسے ہلاک کر دیا یا ( یہ فرمایا کہ ) تم نے اس شخص کی کمر کوتوڑ دیا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 173670,
        "last_updated": null
    },
    {
        "urduURN": 4059790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6061,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے خالد نے ، ان سے عبدالرحمٰن بن ابی بکرہ نے ، ان سے ان کے والد نے",
        "hadithText": "نبی کریم کی مجلس میں ایک شخص کا ذکر آیا تو ایک دوسرے شخص نے ان کی مبالغہ سے تعریف کی تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ افسوس تم نے اپنے ساتھی کی گردن تو ڑ دی ۔ آنحضرت صلی اللہ علیہ وسلم نے یہ جملہ کئی بار فرمایا ، اگر تمہارے لئے کسی کی تعریف کرنی ضروری ہو تو یہ کہنا چاہیئے کہ میں اس کے متعلق ایسا خیال کرتا ہوں ، باقی علم اللہ کو ہے وہ ایسا ہے ۔ اگر اس کو یہ معلوم ہو کہ وہ ایسا ہی ہے اور یوں نہ کہے کہ وہ اللہ کے نزدیک اچھا ہی ہے ۔ اور وہیب نے اسی سند کے ساتھ خالد سے یوں روایت کی ” ارے تیری خرابی تو نے اس کی گردن کاٹ ڈالی یعنی لفظ ویحک کے بجائے لفظ ویلک بیان کیا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 173680,
        "last_updated": null
    },
    {
        "urduURN": 4059800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6062,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا ہم سے موسیٰ بن عقبہ نے بیان کیا ، ان سے سالم نے اور ان سے ان کے والد عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کو ازار لٹکا نے کے بارے میں جو کچھ فرمانا تھا جب آپ نے فرمایا تو ابوبکر رضی اللہ عنہ نے عرض کیا کہ یا رسول اللہ ! میرا تہمد ایک طرف سے لٹکنے لگتا ہے ، تو آپ نے فرمایا کہ تم ان تکبر کرنے والوں میں سے نہیں ہو ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 173690,
        "last_updated": null
    },
    {
        "urduURN": 4059810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6063,
        "hadithSanad": "ہم سے عبداللہ بن زبیر حمیدی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم اتنے اتنے دنوں تک اس حال میں رہے کہ آپ کو خیال ہوتا تھا کہ جیسے آپ اپنی بیوی کے پاس جا رہے ہیں حالانکہ ایسا نہیں تھا ۔ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم نے مجھ سے ایک دن فرمایا ، عائشہ ! میں نے اللہ تعالیٰ سے ایک معاملہ میں سوال کیا تھا اور اس نے وہ بات مجھے بتلادی ، دو فرشتے میرے پاس آئے ، ایک میرے پاؤں کے پاس بیٹھ گیا اور دوسرا سرکے پاس بیٹھ گیا ۔ اس نے اس سے کہا کہ جو میرے سر کے پاس تھا ان صاحب ( آنحضرت صلی اللہ علیہ وسلم ) کا کیا حال ہے ؟ دوسرے نے جواب دیا کہ ان پر جادو کر دیا گیا ہے ۔ پوچھا ، کس نے ان پر جادو کیا ہے ؟ جواب دیا کہ لبید بن اعصم نے ، پوچھا ، کس چیز میں کیا ہے ، جواب دیا کہ نر کھجور کے خوشہ کے غلاف میں ، اس کے اندر کنگھی ہے اور کتان کے تار ہیں ۔ اور یہ ذروان کے کنویں میں ایک چٹان کے نیچے دبا دیا ہے ۔ اس کے بعد آنحضرت صلی اللہ علیہ وسلم تشریف لے گئے اور فرمایا کہ یہی وہ کنواں ہے جو مجھے خواب میں دکھلایا گیا تھا ، اس کے باغ کے درختوں کے پتے سانپوں کے پھن جیسے ڈراؤ نے معلوم ہوتے ہیں اور اس کا پانی مہندی کے نچوڑ ے ہوئے پانی کی طرح سرخ تھا ۔ پھر آنحضرت صلی اللہ علیہ وسلم کے حکم سے وہ جادو نکالا گیا ۔ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نے عرض کیا یا رسول اللہ ! پھر کیوں نہیں ، ان کی مراد یہ تھی کہ آنحضرت صلی اللہ علیہ وسلم نے اس واقعہ کو شہرت کیوں نہ دی ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ مجھے اللہ نے شفاء دے دی ہے اور میں ان لوگوں میں خواہ مخواہ برائی کے پھیلانے کو پسند نہیں کرتا ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ لبید بن اعصم یہود کے حلیف بنی زریق سے تعلق رکھتا تھا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 173700,
        "last_updated": null
    },
    {
        "urduURN": 4059820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6064,
        "hadithSanad": "ہم سے بشر بن محمد نے بیان کیا ، کہا ہم کو حضرت عبداللہ بن مبارک نے خبر دی ، کہا ہم کو معمر نے خبر دی ، انہیں ہمام بن منبہ نے خبر دی اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا بدگمانی سے بچتے رہو کیونکہ بدگمانی کی باتیں اکثر جھوٹی ہوتی ہیں ، لوگوں کے عیوب تلاش کرنے کے پیچھے نہ پڑو ، آپس میں حسد نہ کرو ، کسی کی پیٹھ پیچھے برائی نہ کرو ، بغض نہ رکھو ، بلکہ سب اللہ کے بندے آپس میں بھائی بھائی بن کر رہو ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 173720,
        "last_updated": null
    },
    {
        "urduURN": 4059830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6065,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا انہوں نے کہا کہ مجھ سے حضرت انس مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا آپس میں بغض نہ رکھو ، حسد نہ کرو ، پیٹھ پیچھے کسی کی برائی نہ کرو ، بلکہ اللہ کے بندے آپس میں بھائی بھائی بن کر رہو اور کسی مسلمان کے لئے جائز نہیں کہ ایک بھائی کسی بھائی سے تین دن سے زیادہ سلام کلام چھوڑ کر رہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 173730,
        "last_updated": null
    },
    {
        "urduURN": 4059840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6066,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا ، کہا ہم کو امام مالک رحمہ اللہ نے خبر دی ، ابوالزناد سے وہ اعرج سے اور وہ حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، بدگمانی سے بچتے رہو ، بدگمانی اکثر تحقیق کے بعد جھوٹی بات ثابت ہوتی ہے اور کسی کے عیوب ڈھونڈ نے کے پیچھے نہ پڑو ، کسی کا عیب خواہ مخواہ مت ٹٹولواور کسی کے بھاؤ پر بھاؤ نہ بڑھاؤ اور حسد نہ کرو ، بغض نہ رکھو ، کسی کی پیٹھ پیچھے برائی نہ کرو بلکہ سب اللہ کے بندے آپس میں بھائی بھائی بن کر رہو ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 173750,
        "last_updated": null
    },
    {
        "urduURN": 4059850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6067,
        "hadithSanad": "ہم سے سعید بن عفیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میں گمان کرتا ہوں کہ فلاں اور فلاں ہمارے دین کی کوئی بات نہیں جانتے ہیں ۔ لیث بن سعد نے بیان کیا کہ یہ دونوں آدمی منافق تھے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 173770,
        "last_updated": null
    },
    {
        "urduURN": 4059860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6068,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے کیا ، کہا ہم سے لیث بن سعد نے یہی حدیث نقل کی اور ( اس میں یوں ہے کہ ) حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "ایک دن نبی کریم صلی اللہ علیہ وسلم میرے یہاں تشریف لائے اور فرمایا عائشہ میں گمان کرتا ہوں کہ فلاں فلاں لوگ ہم جس دین پر ہیں اس کو نہیں پہچانتے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 173780,
        "last_updated": null
    },
    {
        "urduURN": 4059870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6069,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے ، ان سے ان کے بھتیجے ابن شہاب نے ، ان سے ابن شہاب ( محمد بن مسلم ) نے ، ان سے سالم بن عبداللہ نے بیان کیا کہ",
        "hadithText": "میں نے ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا میری تمام امت کو معاف کیا جائے گا سوا گناہوں کو کھلم کھلا کرنے والوں کے اور گناہوں کو کھلم کھلا کرنے میں یہ بھی شامل ہے کہ ایک شخص رات کو کوئی ( گناہ کا ) کام کرے اور اس کے باوجود کہ اللہ نے اس کے گناہ کو چھپا دیا ہے مگر صبح ہونے پر وہ کہنے لگے کہ اے فلاں ! میں نے کل رات فلاں فلاں برا کام کیا تھا ۔ رات گزر گئی تھی اور اس کے رب نے اس کا گناہ چھپائے رکھا ، لیکن جب صبح ہوئی تو وہ خود اللہ کے پردے کو کھولنے لگا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 173800,
        "last_updated": null
    },
    {
        "urduURN": 4059880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6070,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے ابو عوانہ نے ، انہوں نے قتادہ سے ، انہوں نے صفوان بن محرز سے کہ",
        "hadithText": "ایک شخص نے ابن عمر رضی اللہ عنہما سے پوچھا تم نے آنحضرت صلی اللہ علیہ وسلم سے کانا پھوسی کے بارے میں کیا سناہے ؟ ( یعنی سرگوشی کے بارے میں ) انہوں نے کہا آنحضرت فرماتے تھے ( قیامت کے دن تم مسلمانوں ) میں سے ایک شخص ( جو گنہگار ہو گا ) اپنے پروردگار سے نزدیک ہو جائے گا ۔ پروردگار اپنا بازو اس پر رکھ دے گا اور فرمائے گا تو نے ( فلاں دن دنیا میں ) یہ یہ برے کام کئے تھے ، وہ عرض کرے گا ۔ بیشک ( پروردگار مجھ سے خطائیں ہوئی ہیں پر تو غفور رحیم ہے ) غرض ( سارے گناہوں کا ) اس سے ( پہلے ) اقرار کرا لے گا پھر فرمائے گا دیکھ میں نے دنیا میں تیرے گناہ چھپائے رکھے تو آج میں ان گناہوں کو بخش دیتا ہوں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 173810,
        "last_updated": null
    },
    {
        "urduURN": 4059890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6071,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ، انہوں نے کہا ہم کو سفیان بن عیینہ نے خبر دی ، انہوں نے کہا ہم سے معبد بن خالد قیسی نے بیان کیا ، ان سے حارثہ بن وہب خزاعی رضی اللہ عنہ نے بیان کیا",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کیا میں تمہیں جنت والوں کی خبر نہ دوں ۔ ہر کمزور و تواضع کرنے والا اگر وہ ( اللہ کا نام لے کر ) قسم کھا لے تو اللہ اس کی قسم پوری کر دے ۔ کیا میں تمہیں دوزخ والوں کی خبر نہ دوں ۔ ہر تند خو ، اکڑ کر چلنے والا اور متکبر ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 173830,
        "last_updated": null
    },
    {
        "urduURN": 4059900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6072,
        "hadithSanad": "اور محمد بن عیسیٰ نے بیان کیا کہ ہم سے ہشیم نے بیان کیا ، کہا ہم کو حمید طویل نے خبر دی ، کہا ہم سے انس بن مالک نے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم کے اخلاق فاضلہ کا یہ حال تھا کہ ایک لونڈی مدینہ کی لونڈیوں میں سے آپ کا ہاتھ پکڑ لیتی اور اپنے کسی بھی کام کے لئے جہاں چاہتی آپ کو لے جاتی تھی ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 173840,
        "last_updated": null
    },
    {
        "urduURN": 4059910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے ، کہا مجھ سے عوف بن مالک بن طفیل نے بیان کیا",
        "hadithText": "وہ رسول اللہ صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا کے مادری بھتیجے تھے ، انہوں نے کہا کہ عائشہ رضی اللہ عنہا نے کوئی چیز بھیجی یا خیرات کی تو عبداللہ بن زبیر جوان کے بھانجے تھے کہنے لگے کہ عائشہ رضی اللہ عنہا کو ایسے معاملوں سے باز رہنا چاہیئے نہیں تو اللہ کی قسم میں ان کے لئے حجر کا حکم جاری کر دوں گا ۔ ام المؤمنین نے کہا کیا اس نے یہ الفاظ کہے ہیں ؟ لوگوں نے بتایا کہ جی ہاں ۔ فرمایا پھر میں اللہ سے نذر کرتی ہوں کہ ابن زبیر رضی اللہ عنہما سے اب کبھی نہیں بولوں گی ۔ اس کے بعد جب ان کے قطع تعلقی پر عرصہ گزر گیا ۔ تو عبداللہ بن زبیر رضی اللہ عنہما کے لئے ان سے سفارش کی گئی ( کہ انہیں معاف فرما دیں ) ام المؤمنین نے کہا ہرگز نہیں اللہ کی قسم اس کے بارے میں کوئی سفارش نہیں مانوں گی اور اپنی نذر نہیں توڑوں گی ۔ جب یہ قطعی تعلق عبداللہ بن زبیر رضی اللہ عنہما کے لئے بہت تکلیف دہ ہو گئی تو انہوں نے مسور بن مخرمہ اور عبدالرحمٰن بن اسود بن عبد یغوث رضی اللہ عنہم سے اس سلسلے میں بات کی وہ دونوں بنی زہرہ سے تعلق رکھتے تھے ۔ انہوں نے ان سے کہا کہ میں تمہیں اللہ کا واسطہ دیتا ہوں کسی طرح تم لوگ مجھے عائشہ رضی اللہ عنہا کے حجرہ میں داخل کرا دو کیونکہ ان کے لئے یہ جائز نہیں کہ میرے ساتھ صلہ رحمی کو توڑنے کی قسم کھائیں چنانچہ مسور اور عبدالرحمٰن دونوں اپنی چادروں میں لپٹے ہوئے عبداللہ بن زبیر رضی اللہ عنہما کو اس میں ساتھ لے کر آئے اور عائشہ رضی اللہ عنہا سے اندر آنے کی اجازت چاہی اور عرض کی السلام علیکم ورحمۃ اللہ وبرکاتہ ، کیا ہم اندر آ سکتے ہیں ؟ عائشہ رضی اللہ عنہا نے کہا آ جاؤ ۔ انہوں نے عرض کیا ہم سب ؟ کہا ہاں ، سب آ جاؤ ۔ ام المؤمنین کو اس کا علم نہیں تھا کہ عبداللہ بن زبیر رضی اللہ عنہما بھی ان کے ساتھ ہیں ۔ جب یہ اندر گئے تو عبداللہ بن زبیر رضی اللہ عنہما پردہ ہٹا کر اندر چلے گئے اور ام المؤمنین رضی اللہ عنہا سے لپٹ کر اللہ کا واسطہ دینے لگے اور رونے لگے ( کہ معاف کر دیں ، یہ ام المؤمنین کے بھانجے تھے ) مسور اور عبدالرحمٰن بھی ام المؤمنین کو اللہ کا واسطہ دینے لگے کہ عبداللہ بن زبیر رضی اللہ عنہما سے بولیں اور انہیں معاف کر دیں ان حضرات نے یہ بھی عرض کیا کہ جیسا کہ تم کو معلوم ہے نبی کریم صلی اللہ علیہ وسلم نے تعلق توڑنے سے منع کیا ہے کہ کسی مسلمان کے لئے جائز نہیں کہ کسی اپنے بھائی سے تین دن سے زیادہ والی حدیث یاد دلانے لگے اور یہ کہ اس میں نقصان ہے تو ام المؤمنین بھی انہیں یاد دلانے لگیں اوررونے لگیں اور فرمانے لگیں کہ میں نے تو قسم کھا لی ہے ؟ اور قسم کا معاملہ سخت ہے لیکن یہ بزرگ لوگ برا بر کوشش کرتے رہے ، یہاں تک کہ ام المؤمنین نے عبداللہ بن زبیر رضی اللہ عنہما سے بات کر لی اور اپنی قسم ( توڑ نے ) کی وجہ سے چالیس غلام آزاد کئے ۔ اس کے بعدجب بھی آپ یہ قسم یاد کرتیں تو رونے لگتیں اور آپ کا دوپٹہ آنسوؤں سے تر ہو جاتا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 173850,
        "last_updated": null
    },
    {
        "urduURN": 4059920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6076,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا انہیں امام مالک رحمہ اللہ نے خبر دی ، انہیں ابن شہاب نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، آپس میں بغض نہ رکھو اور ایک دوسرے سے حسد نہ کرو ، پیٹھ پیچھے کسی کی برائی نہ کرو ، بلکہ اللہ کے بندے اور آپس میں بھائی بھائی بن کر رہو اورکسی مسلمان کے لئے جائز نہیں کہ کسی بھائی سے تین دن سے زیادہ تک بات چیت بند کرے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 173860,
        "last_updated": null
    },
    {
        "urduURN": 4059930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6077,
        "hadithSanad": "ہم سے عبدالرحمٰن بن یوسف نے بیان کیا ، کہا ہم کو امام مالک رحمہ اللہ نے خبر دی ، انہیں ابن شہاب نے ، انہیں عطاء بن یزید لیثی نے اور انہیں حضرت ابوایوب انصاری رضی اللہ عنہ نے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا کسی شخص کے لئے جائز نہیں کہ اپنے کسی بھائی سے تین دن سے زیادہ کے لیے ملاقات چھوڑے ، اس طرح کہ جب دونوں کا سامنا ہو جائے تو یہ بھی منہ پھیر لے اور وہ بھی منہ پھیر لے اور ان دونوں میں بہتر وہ ہے جو سلام میں پہل کرے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 173870,
        "last_updated": null
    },
    {
        "urduURN": 4059940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6078,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو عبدہ بن سلیمان نے خبر دی ، انہیں ہشام بن عروہ نے ، انہیں ان کے والدنے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا میں تمہاری ناراضگی اورخوشی کو خوب پہنچانتا ہوں ۔ ام المؤمنین نے بیان کیا کہ میں نے عرض کیا یا رسول اللہ ! آپ کس طرح سے پہنچانتے ہیں ؟ فرمایا کہ جب تم خوش ہوتی ہو کہتی ہو ، ہاں محمد کے رب کی قسم ، اور جب ناراض ہوتی ہو تو کہتی ہو نہیں ، ابراہیم کے رب کی قسم ۔ بیان کیا کہ میں نے عرض کیا ، جی ہاں آپ کا فرمانا بالکل صحیح ہے میں صرف آپ کا نام لینا چھوڑتی دیتی ہوں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 173880,
        "last_updated": null
    },
    {
        "urduURN": 4059950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6079,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا ہم کو ہشام بن عروہ نے خبر دی ، انہیں معمر نے ، ان سے زہری نے ( دوسری سند ) اور لیث بن سعد نے بیان کیا کہ مجھے عقیل نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، انہیں عروہ بن زبیر نے خبر دی اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "جب میں نے ہوش سنبھالا تو اپنے والدین کو دین اسلام کا پیرو پایا اور کوئی دن ایسانہیں گزرتا تھا کہ جس میں رسول اللہ صلی اللہ علیہ وسلم ان کے پاس صبح و شام تشریف نہ لاتے ہوں ، ایک دن ابوبکر رضی اللہ عنہ ( والد ماجد ) گھر میں بھری دوپہر میں بیٹھے ہوئے تھے کہ ایک شخص نے کہا یہ رسول اللہ صلی اللہ علیہ وسلم تشریف لا رہے ہیں ، یہ ایسا وقت تھا کہ اس وقت ہمارے یہاں آنحضرت صلی اللہ علیہ وسلم کے آنے کا معمول نہیں تھا ، ابوبکر رضی اللہ عنہ بولے کہ اس وقت آنحضرت صلی اللہ علیہ وسلم کا تشریف لانا کسی خاص وجہ ہی سے ہو سکتا ہے ، پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا مجھے مکہ چھوڑنے کی اجازت مل گئی ہے ۔ ( ورنہ میرے دل میں آپ کے بارے میں کوئی غلط بات نہیں ہوتی ) ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 173890,
        "last_updated": null
    },
    {
        "urduURN": 4059960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6080,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو عبدالوہاب ثقفی نے خبر دی ، انہیں خالد حذاء نے ، انہیں انس بن سیرین نے اور انہیں انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم قبیلہ انصار کے گھرانہ میں ملاقات کے لئے تشریف لے گئے اور انہیں کے یہاں کھانا کھایا ، جب آپ واپس تشریف لانے لگے تو آپ کے حکم سے ایک چٹائی پر پانی چھڑکا گیا اور آنحضرت صلی اللہ علیہ وسلم نے اس پر نماز پڑھی اور گھر والوں کے لئے دعا کی ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 173900,
        "last_updated": null
    },
    {
        "urduURN": 4059970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6081,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے عبدالصمد بن عبدالوارث نے ، کہا کہ مجھ سے میرے والد نے بیان کیا ، کہا کہ مجھ سے یحییٰ بن ابی اسحاق نے ، کہا کہ",
        "hadithText": "مجھ سے سالم بن عبداللہ نے پوچھا کہ استبرق کیا چیز ہے ؟ میں نے کہا کہ دیبا سے بنا ہوا دبیز اور کھردرا کپڑا پھر انہوں نے بیان کیا کہ میں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ عمر رضی اللہ عنہ نے ایک شخص کو استبرق کا جوڑا پہنے ہوئے دیکھا تو نبی کریم صلی اللہ علیہ وسلم کی خدمت میں اسے لے کر حاضر ہوئے اور عرض کیا کہ یا رسول اللہ ! اسے آپ خرید لیں اور وفد جب آپ سے ملاقات کے لئے آئیں تو ان کی ملاقات کے وقت اسے پہن لیا کریں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ریشم تو وہی پہن سکتا ہے جس کا ( آخرت میں ) کوئی حصہ نہ ہو خیر اس بات پر ایک مدت گزر گئی پھر ایسا ہوا کہ ایک دن آنحضرت صلی اللہ علیہ وسلم نے خود انہیں ایک جوڑا بھیجا تو وہ اسے لے کر آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا آنحضرت صلی اللہ علیہ وسلم نے یہ جوڑا میرے لئے بھیجا ہے ، حالانکہ اس کے بارے میں آپ اس سے پہلے ایسا ارشاد فرما چکے ہیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ میں نے تمہارے پاس اس لئے بھیجا ہے تاکہ تم اس کے ذریعہ ( بیچ کر ) مال حاصل کرو ۔ چنانچہ ابن عمر رضی اللہ عنہما اسی حدیث کی وجہ سے کپڑے میں ( ریشم کے ) بیل بوٹوں کو بھی مکروہ جانتے تھے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 173910,
        "last_updated": null
    },
    {
        "urduURN": 4059980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6082,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے حمید طویل نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جب عبدالرحمٰن بن عوف ہمارے یہاں آئے تو نبی کریم صلی اللہ علیہ وسلم نے ان میں اور سعد بن ربیع میں بھائی چارگی کرائی تو پھر ( جب عبدالرحمٰن بن عوف نے نکاح کیا تو ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اب ولیمہ کر خواہ ایک بکری کا ہو ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 173920,
        "last_updated": null
    },
    {
        "urduURN": 4059990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6083,
        "hadithSanad": "ہم سے محمد بن صباح نے بیان کیا ، کہا ہم سے اسماعیل بن زکریا نے بیان کیا ، کہا ہم سے عاصم بن سلیمان احول نے بیان کیا ، کہا کہ میں نے حضرت انس بن مالک رضی اللہ عنہ سے پوچھا ، کیا تم کو یہ بات معلوم ہے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اسلام میں معاہدہ ( حلف ) کی کوئی اصل نہیں ؟ انس رضی اللہ عنہ نے فرمایا کہ آنحضور صلی اللہ علیہ وسلم نے خود قریش اور انصار کے درمیان میرے گھر میں حلف کرائی تھی ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 173930,
        "last_updated": null
    },
    {
        "urduURN": 4060000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6084,
        "hadithSanad": "ہم سے حبان بن موسیٰ نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں عروہ نے اور انہیں حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "رفاعہ قرظی نے اپنی بیوی کو طلاق دے دی اور طلاق رجعی نہیں دی ۔ اس کے بعد ان سے عبدالرحمٰن بن زبیر رضی اللہ عنہما نے نکاح کر لیا ، لیکن وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور عرض کیا ، یا رسول اللہ ! میں رفاعہ رضی اللہ عنہ کے نکاح میں تھی لیکن انہوں نے مجھے تین طلاقیں دے دیں ۔ پھر مجھ سے عبدالرحمٰن بن زبیر رضی اللہ عنہما نے نکاح کر لیا ، لیکن اللہ کی قسم ان کے پاس تو پلو کی طرح کے سوا اور کچھ نہیں ۔ ( مراد یہ کہ وہ نامرد ہیں ) اور انہوں نے اپنے چادر کا پلو پکڑ کر بتایا ( راوی نے بیان کیا کہ ) حضرت ابوبکر رضی اللہ عنہ آنحضرت صلی اللہ علیہ وسلم کے پاس بیٹھے ہوئے تھے اور سعید بن العاص کے لڑکے خالد حجرہ کے دروازے پر تھے اور اندر داخل ہونے کی اجازت کے منتظر تھے ۔ خالد بن سعید اس پر حضرت ابوبکر رضی اللہ عنہ کو آواز دے کر کہنے لگے کہ آپ اس عورت کو ڈانتے نہیں کہ آنحضرت صلی اللہ علیہ وسلم کے سامنے کس طرح کی بات کہتی ہے اور حضور اکرم صلی اللہ علیہ وسلم نے تبسم کے سوا اور کچھ نہیں فرمایا ۔ پھر فرمایا غالباً تم رفاعہ کے پاس دوبارہ جانا چاہتی ہو لیکن یہ اس وقت تک ممکن نہیں ہے جب تک تم ان کا ( عبدالرحمٰن رضی اللہ عنہ کا ) مزا نہ چکھ لو اور وہ تمہارا مزہ نہ چکھ لیں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 173940,
        "last_updated": null
    },
    {
        "urduURN": 4060010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6085,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، کہا ہم سے ابراہیم نے بیان کیا ، ان سے صالح بن کیسان نے ، ان سے ابن شہاب نے ، ان سے عبدالحمید بن عبدالرحمٰن بن زید بن خطاب نے ، ان سے محمد بن سعد نے اور ان سے ان کے والد نے بیان کیا کہ",
        "hadithText": "حضرت عمر بن خطاب رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہونے کی اجازت چاہی ۔ اس وقت آنحضرت صلی اللہ علیہ وسلم کے پاس آپ کی کئی بیویاں جو قریش سے تعلق رکھتی تھیں آپ سے خرچ دینے کے لیے تقاضا کر رہی تھیں اور اونچی آواز میں باتیں کر رہی تھیں ۔ جب حضرت عمر رضی اللہ عنہ نے اجازت چاہی تو وہ جلدی سے بھاگ کر پردے کے پیچھے چلی گئیں ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے ان کو اجازت دی اور وہ داخل ہوئے ۔ آنحضرت صلی اللہ علیہ وسلم اس وقت ہنس رہے تھے ۔ حضرت عمر رضی اللہ عنہ نے عرض کیا اللہ آپ کو خوش رکھے ، یا رسول اللہ ! میرے ماں باپ آپ پر قربان ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ان پر مجھے حیرت ہوئی ، جو ابھی میرے پاس تقاضا کر رہی تھیں ، جب انہوں نے تمہاری آواز سنی تو فوراً بھاگ کر پردے کے پیچھے چلی گئیں ۔ حضرت عمر رضی اللہ عنہ نے اس پر عرض کیا ، یا رسول اللہ ! آپ اس کے زیادہ مستحق ہیں کہ آپ سے ڈرا جائے ، پھر عورتوں کو مخاطب کر کے انہوں نے کہا ، اپنی جانوں کی دشمن ! مجھ سے تو تم ڈرتی ہو او اللہ کے رسول صلی اللہ علیہ وسلم سے نہیں ڈرتیں ۔ انہوں نے عرض کیا آپ رضی اللہ عنہ آنحضرت صلی اللہ علیہ وسلم سے زیادہ سخت ہیں ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا ہاں اے ابن خطاب ! اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ، اگر شیطان بھی تمہیں راستے پر آتا ہوا دیکھے گا تو تمہارا راستہ چھوڑ کر دوسرے راستے پر چلا جائے گا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 113,
        "matchingArabicURN": 173950,
        "last_updated": null
    },
    {
        "urduURN": 4060020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6086,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے ، ان سے ابو العباس سائب نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "جب رسول اللہ صلی اللہ علیہ وسلم طائف میں تھے ( فتح مکہ کے بعد ) تو آپ نے فرمایا کہ اگر اللہ نے چاہا تو ہم یہاں سے کل واپس ہوں گے ۔ آپ کے بعض صحابہ نے کہا کہ ہم اس وقت تک نہیں جائیں گے جب تک اسے فتح نہ کر لیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اگر یہی بات ہے تو کل صبح لڑائی کرو ۔ بیان کیا کہ دوسرے دن صبح کو صحابہ نے گھمسان کی لڑائی لڑی اور بکثرت صحابہ زخمی ہوئے ۔ آنحضرت صلی اللہ علیہ سلم نے فرمایا کہ انشاءاللہ ہم کل واپس ہوں گے ، بیان کیا کہ اب سب لوگ خاموش رہے ۔ اس پر آنحضرت صلی اللہ علیہ وسلم ہنس پڑے ۔ حمیدی نے بیان کیا کہ ہم سے سفیان نے پوری سند خبر کے لفظ کے ساتھ بیان کی ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 114,
        "matchingArabicURN": 173960,
        "last_updated": null
    },
    {
        "urduURN": 4060030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6087,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، کہا ہم کو ابن شہاب نے خبر دی ، انہیں حمید بن عبدالرحمٰن نے ، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک صاحب رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا میں تو تباہ ہو گیا اپنی بیوی کے ساتھ رمضان میں ( روزہ کی حالت میں ) ہمبستری کر لی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر ایک غلام آزاد کر ۔ انہوں نے عرض کیا میرے پاس کوئی غلام نہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر دو مہینے کے روزے رکھ ۔ انہوں نے عرض کیا اس کی مجھ میں طاقت نہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا پھر ساٹھ مسکینوں کو کھانا کھلا ۔ انہوں نے عرض کیا کہ اتنا بھی میرے پاس نہیں ہے ۔ بیان کیا کہ پھر کھجور کا ایک ٹوکرا لایا گیا ۔ ابراہیم نے بیان کیا کہ ” عرق “ ایک طرح کا ( نو کلوگرام کا ) ایک پیمانہ تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، پوچھنے والا کہاں ہے ؟ لو اسے صدقہ کر دینا ۔ انہوں نے عرض کی مجھ سے جو زیادہ محتاج ہو اسے دوں ؟ اللہ کی قسم مدینہ کے دونوں میدانوں کے درمیان کوئی گھرانہ بھی ہم سے زیادہ محتاج نہیں ہے ۔ اس پر آنحضرت صلی اللہ علیہ وسلم ہنس دیئے اور آپ کے سامنے کے دندان مبارک کھل گئے ، اس کے بعد فرمایا ، اچھا پھر تو تم میاں بیوی ہی اسے کھا لو ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 115,
        "matchingArabicURN": 173970,
        "last_updated": null
    },
    {
        "urduURN": 4060040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6088,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا ، کہا ہم سے امام مالک رحمہ اللہ نے بیان کیا ، ان سے اسحاق بن عبداللہ ابن ابی طلحہ نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ چل رہا تھا ۔ آپ کے جسم پر ایک نجرانی چادر تھی ، جس کا حاشیہ موٹاتھا ۔ اتنے میں ایک دیہاتی آپ کے پاس آیا اور اس نے آپ کی چادر بڑے زور سے کھینچی ۔ حضرت انس رضی اللہ عنہ نے بیان کیا کہ میں نے آنحضرت صلی اللہ علیہ وسلم کے شانے کو دیکھا کہ زور سے کھینچنے کی وجہ سے ، اس پر نشان پڑ گئے ۔ پھر اس نے کہا اے محمد ! اللہ کا جو مال آپ کے پاس ہے اس میں سے مجھے دیئے جانے کا حکم فرما یئے ۔ اس وقت میں نے آنحضرت صلی اللہ علیہ وسلم کو مڑ کر دیکھا تو آپ مسکرادیئے پھر آپ نے اسے دیئے جانے کا حکم فرمایا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 116,
        "matchingArabicURN": 173980,
        "last_updated": null
    },
    {
        "urduURN": 4060050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6089,
        "hadithSanad": "ہم سے ابن نمیر نے بیان کیا ، کہا ہم سے ابن ادریس نے بیان کیا ، ان سے اسماعیل نے ، ان سے قیس نے اور ان سے حضرت جریر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جب سے میں نے اسلام قبول کیا آنحضرت صلی اللہ علیہ وسلم نے ( اپنے پاس آنے سے ) کبھی نہیں روکا اور جب بھی آپ نے مجھے دیکھا تو مسکرائے ۔ \n<span class=urdu_sanad>میں نے آنحضرت صلی اللہ علیہ وسلم سے شکایت کی کہ</span> میں گھوڑے پر جم کر نہیں بیٹھ پاتا تو آنحضرت صلی اللہ علیہ وسلم نے اپنا ہاتھ میرے سینے پر مارا اور دعا کی کہ اے اللہ ! اسے ثبات فرمایا اسے ہدایت کرنے والا اور خود ہدایت پایا ہوا بنا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 117,
        "matchingArabicURN": 173991,
        "last_updated": null
    },
    {
        "urduURN": 4060070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6091,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے یحییٰ قطان نے بیان کیا ، ان سے ہشام بن عروہ نے بیان کیا ، انہیں ان کے والد نے خبر دی ، انہیں زینب بنت ام سلمہ رضی اللہ عنہما نے ، انہیں ام سلمہ رضی اللہ عنہا نے کہ",
        "hadithText": "ام سلیم رضی اللہ عنہا نے عرض کیا یا رسول اللہ ! اللہ حق سے نہیں شرماتا ، کیا عورت کو جب احتلام ہو تو اس پر غسل واجب ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں جب عورت پانی دیکھے ( تو اس پر غسل واجب ہے ) اس پر ام سلمہ رضی اللہ عنہا ہنسیں اور عرض کیا ، کیا عورت کو بھی احتلام ہوتا ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا پھر بچہ کی صورت ماں سے کیوں ملتی ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 118,
        "matchingArabicURN": 174010,
        "last_updated": null
    },
    {
        "urduURN": 4060080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6092,
        "hadithSanad": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، انہوں نے کہا کہ مجھ سے ابن وہب نے بیان کیا ، انہوں نے کہا ہم کو عمرو نے خبر دی ، ان سے ابوالنضر نے بیان کیا ، ان سے سلیمان بن یسار نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ کو اس طرح کھل کر کبھی ہنستے نہیں دیکھا کہ آپ کے حلق کاکوا نظر آنے لگتا ہو ، آپ صرف مسکراتے تھے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 119,
        "matchingArabicURN": 174020,
        "last_updated": null
    },
    {
        "urduURN": 4060090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6093,
        "hadithSanad": "ہم سے محمد بن محبوب نے بیان کیا ، کہا ہم سے ابو عوانہ نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس رضی اللہ عنہ نے ( دوسری سند ) اور مجھ سے خلیفہ نے بیان کیا ، کہا ہم کو یزید بن زریع نے بیان کیا ، ان سے سعید نے بیان کیا ، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "ایک صاحب جمعہ کے دن نبی کریم صلی اللہ علیہ وسلم کے پاس آئے آنحضرت صلی اللہ علیہ وسلم اس وقت مدینہ میں جمعہ کا خطبہ دے رہے تھے ، انہوں نے عرض کیا بارش کا قحط پڑ گیا ہے ، آپ اپنے رب سے بارش کی دعا کیجئے ۔ آنحضرت صلی اللہ علیہ وسلم نے آسمان کی طرف دیکھا کہیں ہمیں بادل نظر نہیں آ رہا تھا ۔ پھر آپ نے بارش کی دعا کی ، اتنے میں بادل اٹھا اور بعض ٹکڑے بعض کی طرف بڑھے اور بارش ہونے لگی ، یہاں تک کہ مدینہ کے نالے بہنے لگے ۔ اگلے جمعہ تک اسی طرح بارش ہوتی رہی سلسلہ ٹوٹتا ہی نہ تھا چنانچہ وہی صاحب یا کوئی دوسرے ( اگلے جمعہ کو ) کھڑے ہوئے ، آنحضرت صلی اللہ علیہ وسلم خطبہ دے رہے تھے اور انہوں نے عرض کیا ہم ڈوب گئے ، اپنے رب سے دعا کریں کہ اب بارش بند کر دے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اے اللہ ! ہمارے چاروں طرف بارش ہو ، ہم پر نہ ہو ۔ دو یا تین مرتبہ آپ نے یہ فرمایا ، چنانچہ مدینہ منورہ سے بادل چھٹنے لگے ، بائیں اور دائیں ، ہمارے چاروں طرف دوسرے مقامات پر بارش ہونے لگی اور ہمارے یہاں بارش یکدم بند ہو گئی ۔ یہ اللہ نے لوگوں کو آنحضرت صلی اللہ علیہ وسلم کا معجزہ اور اپنے پیغمبر صلی اللہ علیہ وسلم کی کرامت اور دعا کی قبولیت بتلائی ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 120,
        "matchingArabicURN": 174030,
        "last_updated": null
    },
    {
        "urduURN": 4060100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6094,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، انہوں نے کہا ہم سے جریر نے بیان کیا ، ان سے منصور نے بیان کیا ، ان سے ابووائل نے بیان کیا اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، بلاشبہ سچ آدمی کو نیکی کی طرف بلاتا ہے اور نیکی جنت کی طرف لے جاتی ہے اور ایک شخص سچ بولتا رہتا ہے یہاں تک کہ وہ صدیق کالقب اور مرتبہ حاصل کر لیتا ہے اور بلاشبہ جھوٹ برائی کی طرف لے جاتا ہے اور برائی جہنم کی طرف اور ایک شخص جھوٹ بولتا رہتا ہے ، یہان تک کہ وہ اللہ کے یہاں بہت جھوٹا لکھ دیا جاتا ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 121,
        "matchingArabicURN": 174040,
        "last_updated": null
    },
    {
        "urduURN": 4060110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6095,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے ابی سہیل نافع بن مالک بن ابی عامر نے ، ان سے ان کے والد مالک بن ابی عامر نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا منافق کی تین نشانیاں ہیں ، جب بولتا ہے جھوٹ بولتا ہے ، جب وعدہ کرتا ہے خلاف کرتا ہے اور جب اسے امین بنایا جاتا ہے تو خیانت کرتا ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 122,
        "matchingArabicURN": 174050,
        "last_updated": null
    },
    {
        "urduURN": 4060120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6096,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے جریر نے بیان کیا ، انہوں نے کہا ہم سے ابو رجاء نے بیان کیا ، ان سے سمرہ بن جندب رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میرے پاس گذشتہ رات خواب میں دو آدمی آئے انہوں نے کہا کہ جسے آپ نے دیکھا کہ اس کا جبڑا چیرا جا رہا تھا وہ بڑا ہی جھوٹا تھا ، جو ایک بات کو لیتا اور ساری دنیا میں پھیلا دیتا تھا ، قیامت تک اس کو یہی سزا ملتی رہے گی ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 123,
        "matchingArabicURN": 174060,
        "last_updated": null
    },
    {
        "urduURN": 4060130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6097,
        "hadithSanad": "ہم سے اسحاق بن ابراہیم راہویہ نے بیان کیا ، کہا کہ میں نے ابواسامہ سے پوچھا کیا تم سے اعمش نے یہ بیان کیا کہ میں نے شقیق سے سنا ، کہا میں نے حضرت حذیفہ رضی اللہ عنہ سے سنا ، وہ بیان کرتے تھے کہ",
        "hadithText": "بلا شبہ سب لوگوں سے اپنی چال ڈھال اور وضع اور سیرت میں رسول اللہ صلی اللہ علیہ وسلم سے سب سے زیادہ مشابہ حضرت عبداللہ بن مسعود رضی اللہ عنہما ہیں ۔ جب وہ اپنے گھر سے باہر نکلتے اور اس کے بعد دوبارہ اپنے گھر واپس آنے تک ان کا یہی حال رہتا ہے لیکن جب وہ اکیلے گھر میں رہتے تو معلوم نہیں کیا کرتے رہتے ہیں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 124,
        "matchingArabicURN": 174080,
        "last_updated": null
    },
    {
        "urduURN": 4060140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6098,
        "hadithSanad": "ہم سے ابو الولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے مخارق نے ، انہوں نے کہا میں نے طارق سے سنا ، کہا کہ",
        "hadithText": "عبداللہ بن مسعود رضی اللہ عنہما نے کہا بلاشبہ سب سے اچھا کلام اللہ کی کتاب ہے اور سب سے اچھا طریقہ چال چلن حضرت محمد صلی اللہ علیہ وسلم کا طریقہ ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 125,
        "matchingArabicURN": 174090,
        "last_updated": null
    },
    {
        "urduURN": 4060150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6099,
        "hadithSanad": "ہم سے مسددبن مسرہدنے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے سفیان ثوری نے بیان کیا ، کہا مجھ سے اعمش نے بیان کیا ، ان سے سعید بن جبیر نے ، ان سے ابوعبدالرحمن سلمی نے ، ان سے حضرت ابوموسیٰ اشعری رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کوئی شخص بھی یا کوئی چیز بھی تکلیف برداشت کرنے والی ، جو اسے کسی چیز کو سن کر ہوئی ہو ، اللہ سے زیادہ ( صبر کرنے والا ) نہیں ہے ۔ لوگ اس کے لئے اولاد ٹھہرا تے ہیں اور وہ انہیں تندرستی دیتا ہے بلکہ انہیں روزی بھی دیتا ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 126,
        "matchingArabicURN": 174110,
        "last_updated": null
    },
    {
        "urduURN": 4060160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6100,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا کہ میں نے ان سے سنا وہ بیان کرتے تھے کہ عبداللہ بن مسعود نے کہا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ( جنگ حنین ) میں کچھ مال تقسیم کیا جیسا کہ آپ ہمیشہ تقسیم کیا کرتے تھے ۔ اس پر قبیلہ انصار کے ایک شخص نے کہا کہ اللہ کی قسم اس تقسیم سے اللہ کی رضامندی حاصل کرنا مقصود نہیں تھا ۔ میں نے کہا کہ یہ بات میں ضرور رسول اللہ صلی اللہ علیہ وسلم سے کہوں گا ۔ چنانچہ میں آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا آنحضرت صلی اللہ علیہ وسلم اپنے صحابہ کے ساتھ تشریف رکھتے تھے ، میں نے چپکے سے یہ بات آپ سے کہی ۔ آنحضرت صلی اللہ علیہ وسلم کو اس کی یہ بات بڑی ناگوار گزری اور آپ کے چہرہ کا رنگ بدل گیا اور آپ غصہ ہو گئے یہاں تک کہ میرے دل میں یہ خواہش پیدا ہوئی کہ کاش میں نے آنحضرت صلی اللہ علیہ وسلم کو اس بات کی خبر نہ دی ہوتی پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایاموسیٰ علیہ السلام کو اس سے بھی زیادہ تکلیف پہنچائی گئی تھی لیکن انہوں نے صبر کیا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 127,
        "matchingArabicURN": 174120,
        "last_updated": null
    },
    {
        "urduURN": 4060170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6101,
        "hadithSanad": "ہم سے عمرو بن حفص بن غیاث نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا ہم سے مسلم نے بیان کیا ، ان سے مسروق نے بیان کیا اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک کام کیا اور لوگوں کو بھی اس کی اجازت دے دی لیکن کچھ لوگوں نے اس کا نہ کرنا اچھا جانا ۔ جب آنحضرت صلی اللہ علیہ وسلم کو اس کی اطلاع ہوئی تو آپ نے خطبہ دیا اور اللہ کی حمد کے بعد فرمایا ان لوگوں کو کیا ہو گیا ہے جو اس کام سے پرہیز کرتے ہیں ، جو میں کرتا ہوں ، اللہ کی قسم میں اللہ کو ان سب سے زیادہ جانتا ہوں اور ان سب سے زیادہ اللہ سے ڈرنے والا ہوں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 128,
        "matchingArabicURN": 174140,
        "last_updated": null
    },
    {
        "urduURN": 4060180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6102,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا ہم سے عبداللہ بن مبارک نے ، کہا ہم کو شعبہ نے خبر دی ، انہیں قتادہ نے ، کہا میں نے عبداللہ بن عتبہ سے سنا ، جو حضرت انس رضی اللہ عنہ کے غلام ہیں کہ",
        "hadithText": "حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کنواری لڑکیوں سے بھی زیادہ شرمیلے تھے ، جب آپ کوئی ایسی چیز دیکھتے جو آپ کو ناگوار ہوتی تو ہم آپ کے چہرے مبارک سے سمجھ جاتے تھے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 129,
        "matchingArabicURN": 174150,
        "last_updated": null
    },
    {
        "urduURN": 4060190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6103,
        "hadithSanad": "ہم سے محمد بن یحییٰ ذہلی ( یا محمد بن بشار ) اور احمد بن سعید دارمی نے بیان کیا ، انہوں نے کہا کہ ہم سے عثمان بن عمر نے بیان کیا ، کہا ہم کو علی بن مبارک نے خبر دی ، انہیں یحییٰ بن ابی کثیر نے ، انہیں ابوسلمہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جب کوئی شخص اپنے کسی بھائی کو کہتا ہے کہ اے کافر ! تو ان دونوں میں سے ایک کافر ہو گیا ۔ اور عکرمہ بن عمار نے یحییٰ سے بیان کیا کہ ان سے عبداللہ بن یزید نے کہا ، انہوں نے ابوسلمہ سے سنا اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا انہوں نے نبی کریم صلی اللہ علیہ وسلم سے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 130,
        "matchingArabicURN": 174171,
        "last_updated": null
    },
    {
        "urduURN": 4060200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6104,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک رحمہ اللہ نے بیان کیا ، ان سے عبداللہ بن دینار نے ، ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس شخص نے بھی اپنے کسی بھائی کو کہا کہ اے کافر ! تو ان دونوں میں سے ایک کافر ہو گیا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 131,
        "matchingArabicURN": 174190,
        "last_updated": null
    },
    {
        "urduURN": 4060210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6105,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے وہیب نے بیان کیا ، کہا ہم سے ایوب سختیانی نے بیان کیا ، ان سے ابوقلابہ نے ، ان سے ثابت بن ضحاک رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ",
        "hadithText": "جس نے اسلام کے سوا کسی اورمذہب کی جھوٹ موٹ قسم کھائی تو وہ ویسا ہی ہو جاتا ہے ، جس کی اس نے قسم کھائی ہے اور جس نے کسی چیز سے خودکشی کر لی تو اسے جہنم میں اسی سے عذاب دیا جائے گا اور مومن پر لعنت بھیجنا اسے قتل کرنے کے برابر ہے اور جس نے کسی مومن پر کفر کی تہمت لگائی تو یہ اس کے قتل کے برابر ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 132,
        "matchingArabicURN": 174200,
        "last_updated": null
    },
    {
        "urduURN": 4060220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6106,
        "hadithSanad": "ہم سے محمد بن عبادہ نے بیان کیا ، کہا ہم کو یزید نے خبر دی ، کہا ہم کو سلیم نے خبر دی ، کہا ہم سے عمرو بن دینار نے بیان کیا ، ان سے حضرت جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "معاذ بن جبل رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتے ، پھر اپنی قوم میں آتے اور انہیں نماز پڑھاتے ۔ انہوں نے ( ایک مرتبہ ) نماز میں سورۃ البقرہ پڑھی ۔ اس پر ایک صاحب جماعت سے الگ ہو گئے اور ہلکی نماز پڑھی ۔ جب اس کے متعلق معاذ کو معلوم ہوا تو کہا وہ منافق ہے ۔ معاذ کی یہ بات جب ان کو معلوم ہوئی تو وہ آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا یا رسول اللہ ! ہم لوگ محنت کا کام کرتے ہیں اور اپنی اونٹنیوں کو خود پانی پلاتے ہیں حضرت معاذ نے کل رات ہمیں نماز پڑھائی اور سورۃ البقرہ پڑھنی شروع کر دی ۔ اس لئے میں نماز توڑ کر الگ ہو گیا ، اس پر وہ کہتے ہیں کہ میں منافق ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایااے معاذ ! تم لوگوں کو فتنہ میں مبتلا کرتے ہو ، تین مرتبہ آپ نے یہ فرمایا ( جب امام ہو تو ) سورۃ اقراء ، والشمس وضحھا اور سبح اسم ربک الاعلیٰ جیسی سورتیں پڑھا کرو ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 133,
        "matchingArabicURN": 174210,
        "last_updated": null
    },
    {
        "urduURN": 4060230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6107,
        "hadithSanad": "مجھ سے اسحاق بن راہویہ نے بیان کیا ، کہا ہم کو ابو المغیرہ نے خبر دی ، کہا ہم سے امام اوزاعی نے بیان کیا انہوں نے کہا ہم سے زہری نے بیان کیا ، انہوں نے کہا ہم سے حمید بن عبدالرحمٰن بن عوف نے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تم میں سے جس نے لات عزیٰ کی ( یا دوسرے بتوں کی ) قسم کھائی تو اسے لا الہٰ الا اللہ پڑھنا چاہیئے اور جس نے اپنے ساتھی سے کہا کہ آؤ جوا کھیلیں تو اسے بطور کفارہ صدقہ دینا چاہیئے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 134,
        "matchingArabicURN": 174220,
        "last_updated": null
    },
    {
        "urduURN": 4060240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6108,
        "hadithSanad": "ہم سے قتیبہ بن سعیدنے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے نافع نے ، ان سے ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "وہ حضرت عمر بن خطاب رضی اللہ عنہ کے پاس پہنچے جو چند سواروں کے ساتھ تھے ، اس وقت حضرت عمر رضی اللہ عنہ اپنے والد کی قسم کھا رہے تھے ۔ اس پر رسول کریم صلی اللہ علیہ وسلم نے انہیں پکار کر کہا ، خبردار ! یقیناً اللہ پاک تمہیں منع کرتا ہے کہ تم اپنے باپ دادوں کی قسم کھاؤ ، پس اگر کسی کو قسم ہی کھا نی ہے تو اللہ کی قسم کھائے ، ورنہ چپ رہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 135,
        "matchingArabicURN": 174230,
        "last_updated": null
    },
    {
        "urduURN": 4060250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6109,
        "hadithSanad": "ہم سے بسرہ بن صفوان نے بیان کیا ، انہوں نے کہا ہم سے ابراہیم نے بیان کیا ، ان سے زہری نے بیان کیا ، ان سے قاسم نے بیان کیا اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم اندر تشریف لائے اور گھر میں ایک پردہ لٹکا ہوا تھا جس پر تصویریں تھیں ۔ آنحضرت صلی اللہ علیہ وسلم کے چہرے کا رنگ بدل گیا ۔ پھر آپ نے پردہ پکڑا اور اسے پھاڑ دیا ۔ ام المؤمنین نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، قیامت کے دن ان لوگوں پر سب سے زیادہ عذاب ہو گا ، جو یہ صورتیں بناتے ہیں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 136,
        "matchingArabicURN": 174240,
        "last_updated": null
    },
    {
        "urduURN": 4060260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6110,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے اسماعیل بن ابی خالد نے بیان کیا ، کہا ہم سے قیس بن ابی حازم نے اور ان سے ابومسعود نے بیان کیا کہ",
        "hadithText": "ایک شخص نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا میں صبح کی نماز جماعت سے فلاں امام کی وجہ سے نہیں پڑھتا کیونکہ وہ بہت لمبی نماز پڑھاتے ہیں ۔ انہوں نے کہا کہ اس دن ان امام صاحب کو نصیحت کرنے میں آنحضرت صلی اللہ علیہ وسلم کو میں نے جتنا غصہ میں دیکھا ایسا میں نے آپ کو کبھی نہیں دیکھا تھا ، پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا اے لوگو ! تم میں سے کچھ لوگ ( نماز با جماعت پڑھنے سے ) لوگوں کو دور کرنے والے ہیں ، پس جو شخص بھی لوگوں کو نماز پڑھائے مختصر پڑھائے ، کیونکہ نمازیوں میں کوئی بیمار ہوتا ہے کوئی بوڑھا کوئی کام کاج والا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 137,
        "matchingArabicURN": 174250,
        "last_updated": null
    },
    {
        "urduURN": 4060270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6111,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے جویریہ نے بیان کیا ، ان سے نافع نے بیان کیا اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نماز پڑھ رہے تھے کہ آپ نے مسجد میں قبلہ کی جانب منہ کا تھوک دیکھا ۔ پھر آپ نے اسے اپنے ہاتھ سے صاف کیا اور غصہ ہوئے پھر فرمایا جب تم میں سے کوئی شخص نماز میں ہوتا ہے اللہ تعالیٰ اس کے سامنے ہوتا ہے ۔ اس لیے کوئی شخص نماز میں اپنے سامنے نہ تھوکے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 138,
        "matchingArabicURN": 174260,
        "last_updated": null
    },
    {
        "urduURN": 4060280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6112,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو اسماعیل بن جعفر نے خبر دی ، کہا ہم کو ربیعہ بن ابی عبدالرحمٰن نے خبر دی ، انہیں زید بن خالد جہنی نے کہ",
        "hadithText": "ایک صاحب نے رسول اللہ صلی اللہ علیہ وسلم سے لقطہٰ ( راستہ میں گری پڑی چیز جسے کسی نے اٹھا لیا ہو ) کے متعلق پوچھا تو آپ نے فرمایا سال بھر لوگوں سے پوچھتے رہو پھر اس کا سر بند ھن اور ظرف پہچان کے رکھ اور خرچ کر ڈال ۔ پھر اگر اس کے بعد اس کا مالک آ جائے تو وہ چیز اسے آپس کر دے ۔ پوچھا یا رسول اللہ ! بھولی بھٹکی بکری کے متعلق کیا حکم ہے ؟ آپ نے فرمایا کہ اسے پکڑ لا کیونکہ وہ تمہارے بھائی کی ہے یا پھر بھیڑ یئے کی ہو گی ۔ پوچھا یا رسول اللہ ! اور کھویا ہوا اونٹ ؟ بیان کیا کہ اس پر آنحضرت صلی اللہ علیہ وسلم ناراض ہو گئے اور آپ کے دونوں رخسار سرخ ہو گئے ، یا راوی نے یوں کہا کہ آپ کا چہرہ سرخ ہو گیا ، پھر آپ نے فرمایا تمہیں اس اونٹ سے کیا غرض ہے اس کے سا تھ تو اس کے پاؤں ہیں اور اس کا پانی ہے وہ کبھی نہ کبھی اپنے مالک کو پا لے گا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 139,
        "matchingArabicURN": 174270,
        "last_updated": null
    },
    {
        "urduURN": 4060290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6113,
        "hadithSanad": "اور مکی بن ابراہیم نے بیان کیا انہوں نے کہا کہ ہم سے عبداللہ بن سعید نے بیان کیا ( دوسری سند ) حضرت امام بخاری نے کہا اورمجھ سے محمد بن زیاد نے بیان کیا ، انہوں نے کہا ہم سے محمد بن جعفر نے بیان کیا ، انہوں نے کہا ہم سے عبداللہ بن سعید نے بیان کیا ، انہوں نے کہا کہ مجھ سے عمر بن عبیداللہ کے غلام سالم ابو النضر نے بیان کیا ، ان سے بسر بن سعید نے بیان کیا اور ان سے زید بن ثابت رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے کھجور کی شاخوں یا بوریئے سے ایک مکان چھوٹے سے حجرے کی طرح بنا لیا تھا ۔ وہاں آ کر آپ تہجد کی نماز پڑھا کرتے تھے ، چند لوگ بھی وہاں آ گئے اور انہوں نے آپ کی اقتداء میں نماز پڑھی پھر سب لوگ دوسری رات بھی آ گئے اور ٹھہرے رہے لیکن آپ گھر ہی میں رہے اور باہر ان کے پاس تشریف نہیں لائے ۔ لوگ آواز بلند کرنے لگے اور دروازے پر کنکریاں ماریں تو آنحضرت صلی اللہ علیہ وسلم غصہ کی حالت میں باہر تشریف لائے اور فرمایا تم چاہتے ہو کہ ہمیشہ یہ نماز پڑھتے رہو تاکہ تم پر فرض ہو جائے ( اس وقت مشکل ہو ) دیکھو تم نفل نمازیں اپنے گھروں میں ہی پڑھا کرو ۔ کیونکہ فرض نمازوں کے سوا آدمی کی بہترین نفل نماز وہ ہے جو گھر میں پڑھی جائے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 140,
        "matchingArabicURN": 174280,
        "last_updated": null
    },
    {
        "urduURN": 4060300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6114,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو امام مالک نے خبر دی ، انہیں ابن شہاب نے ، انہیں سعید بن مسیب نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا پہلوان وہ نہیں ہے جو کشتی لڑنے میں غالب ہو جائے بلکہ اصلی پہلوان تو وہ ہے جو غصہ کی حالت میں اپنے آپ پر قابو پائے ۔ بے قابو نہ ہو جائے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 141,
        "matchingArabicURN": 174290,
        "last_updated": null
    },
    {
        "urduURN": 4060310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6115,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے اعمش نے ، ان سے عدی بن ثابت نے ، ان سے سلیمان بن صرد رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "دو آدمیوں نے نبی کریم صلی اللہ علیہ وسلم کی موجودگی میں جھگڑا کیا ، ہم بھی آنحضرت صلی اللہ علیہ وسلم کی خدمت میں بیٹھے ہوئے تھے ۔ ایک شخص دوسرے کو غصہ کی حالت میں گالی دے رہا تھا اور اس کا چہرہ سرخ تھا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں ایک ایسا کلمہ جانتا ہوں کہ اگر یہ شخص اسے کہہ لے تو اس کا غصہ دور ہو جائے ۔ اگر یہ ” اعوذ باللہ من الشیطان الرجیم “ کہہ لے ۔ صحابہ نے اس سے کہا کہ سنتے نہیں ، حضور اکرم صلی اللہ علیہ وسلم کیا فرما رہے ہیں ؟ اس نے کہا کہ کیا میں دیوانہ ہوں ؟</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 142,
        "matchingArabicURN": 174300,
        "last_updated": null
    },
    {
        "urduURN": 4060320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6116,
        "hadithSanad": "مجھ سے یحییٰ بن یوسف نے بیان کیا ، کہا ہم کو ابوبکرنے خبر دی جو ابن عیاش ہیں ، انہیں ابو حصین نے ، انہیں ابوصالح نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "ایک شخص نے نبی کریم صلی اللہ علیہ وسلم سے عرض کیا کہ مجھے آپ کوئی نصیحت فرما دیجئیے آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ غصہ نہ ہوا کر ۔ انہوں نے کئی مرتبہ یہ سوال کیا اور آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ غصہ نہ ہوا کر ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 143,
        "matchingArabicURN": 174310,
        "last_updated": null
    },
    {
        "urduURN": 4060330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6117,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے ان سے ابو السوا ر عدوی نے بیان کیا ، کہا کہ میں نے عمران بن حصین سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا حیاء سے ہمیشہ بھلائی پیدا ہوتی ہے ۔ اس پر بشیر بن کعب نے کہا کہ حکمت کی کتابوں میں لکھا ہے کہ حیاء سے وقار حاصل ہوتا ہے ، حیاء سے سکینت حاصل ہوتی ہے ۔ عمران نے ان سے کہا میں تجھ سے رسول اللہ صلی اللہ علیہ وسلم کی حدیث بیان کرتا ہوں اور تو اپنی ( دو ورقی ) کتاب کی باتیں مجھ کو سناتا ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 144,
        "matchingArabicURN": 174320,
        "last_updated": null
    },
    {
        "urduURN": 4060340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6118,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، انہوں نے کہا ہم سے عبدالعزیز بن ابوسلمہ نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے سالم نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کا گزر ایک شخص پر سے ہوا جو اپنے بھائی پر حیاء کی وجہ سے ناراض ہو رہا تھا اور کہہ رہا تھا کہ تم بہت شرماتے ہو ، گویا وہ کہہ رہا تھا کہ تم اس کی وجہ سے اپنا نقصان کر لیتے ہو ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ اسے چھوڑ دو کہ حیاء ایمان میں سے ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 145,
        "matchingArabicURN": 174330,
        "last_updated": null
    },
    {
        "urduURN": 4060350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6119,
        "hadithSanad": "ہم سے علی بن الجعد نے بیان کیا ، کہا ہم کو شعبہ نے خبر دی ، انہیں قتادہ نے ، انہیں انس رضی اللہ عنہ کے غلام قتادہ نے ، ابوعبداللہ حضرت امام بخاری رحمہ اللہ نے کہا کہ ان کا نام عبداللہ بن ابی عتبہ ہے ، میں نے ابوسعید سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم پردہ میں رہنے والی کنواری لڑکی سے بھی زیادہ حیاء والے تھے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 146,
        "matchingArabicURN": 174340,
        "last_updated": null
    },
    {
        "urduURN": 4060360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6120,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، انہوں نے کہا ہم سے زہیر نے بیان کیا ، انہوں نے کہا ہم سے منصور نے بیان کیا ، ان سے ربعی بن خراش نے بیان کیا ، ان سے ابومسعود انصاری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اگلے پیغمبروں کا کلام جو لوگوں کو ملا اس میں یہ بھی ہے کہ جب شرم ہی نہ رہی تو پھر جو جی چاہے وہ کرے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 147,
        "matchingArabicURN": 174350,
        "last_updated": null
    },
    {
        "urduURN": 4060370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6121,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا مجھ سے امام مالک نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے ، ان سے زینب بنت ابی سلمہ رضی اللہ عنہا نے اور ان سے ام سلمہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "حضرت ام سلیم رضی اللہ عنہا رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور عرض کیا یا رسول اللہ ! اللہ حق بات سے حیاء نہیں کرتاکیا عورت کو جب احتلام ہو تو اس پر غسل واجب ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں اگر عورت منی کی تری دیکھے تو اس پر بھی غسل واجب ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 148,
        "matchingArabicURN": 174360,
        "last_updated": null
    },
    {
        "urduURN": 4060380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6122,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے محارب بن دثار نے ، کہا کہ میں نے حضرت ابن عمر رضی اللہ عنہا سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، مومن کی مثال اس سرسبز درخت کی ہے ، جس کے پتے نہیں چھڑتے ۔ صحابہ نے کہا کہ یہ فلاں درخت ہے ۔ یہ فلاں درخت ہے ۔ میرے دل میں آیا کہ کہوں کہ یہ کھجور کا درخت ہے لیکن چونکہ میں نوجوان تھا ، اس لئے مجھ کو بولتے ہوئے حیاء آئی ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ وہ کھجور کا درخت ہے ۔ اور اسی سند سے شعبہ سے روایت ہے کہ کہا ہم سے خبیب بن عبدالرحمٰن نے ، ان سے حفص بن عاصم نے اور ان سے ابن عمر رضی اللہ عنہما نے اسی طرح بیان کیا اور یہ اضافہ کیا کہ پھر میں نے اس کا ذکر عمر رضی اللہ عنہ سے کیا تو انہوں نے کہا اگر تم نے کہہ دیا ہوتا تو مجھے اتنا اتنا مال ملنے سے بھی زیادہ خوشی حاصل ہوتی ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 149,
        "matchingArabicURN": 174370,
        "last_updated": null
    },
    {
        "urduURN": 4060390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6123,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے مرحوم بن عبدالعزیز نے بیان کیا ، انہوں نے کہا کہ میں نے کہا کہ میں نے ثابت سے سنا اور انہوں نے انس رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "ایک خاتون نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور اپنے آپ کو آنحضرت صلی اللہ علیہ وسلم کے نکاح کے لئے پیش کیا اور عرض کیا ، کیا آنحضرت صلی اللہ علیہ وسلم کو مجھ سے نکاح کی ضرورت ہے ؟ اس پر انس رضی اللہ عنہ کی صاحبزادی بولیں ، وہ کتنی بے حیاتھی ، انس رضی اللہ عنہ نے کہا کہ وہ تم سے تو اچھی تھیں انہوں نے اپنے آپ کو آنحضرت صلی اللہ علیہ وسلم کے نکاح کے لئے پیش کیا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 150,
        "matchingArabicURN": 174380,
        "last_updated": null
    },
    {
        "urduURN": 4060400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6124,
        "hadithSanad": "مجھ سے اسحاق نے بیان کیا ، کہا ہم سے نضر نے بیان کیا ، کہا ہم کو شعبہ نے خبر دی ، انہیں سعید بن ابی بردہ نے ، انہیں ان کے والد نے اور ان سے ان کے دادا نے بیان کیا کہ",
        "hadithText": "جب رسول اللہ صلی اللہ علیہ وسلم نے انہیں ( ابوموسیٰ اشعری رضی اللہ عنہ ) اورمعاذ بن جبل کو ( یمن ) بھیجا تو ان سے فرمایا کہ ( لوگوں کے لئے ) آسانیاں پیدا کرنا ، تنگی میں نہ ڈالنا ، انہیں خوشخبری سنانا ، دین سے نفرت نہ دلانا اور تم دونوں آپس میں اتفاق سے کام کرنا ، ابوموسیٰ رضی اللہ عنہ نے عرض کیا ، یا رسول اللہ ! ہم ایسی سرزمین میں جا رہے ہیں جہاں شہد سے شراب بنائی جاتی ہے اور اسے ” تبع “ کہا جاتا ہے اور جو سے شراب بنائی جاتی ہے اور اسے ” مزر “ کہا جاتا ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہرنشہ لانے والی چیز حرام ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 151,
        "matchingArabicURN": 174390,
        "last_updated": null
    },
    {
        "urduURN": 4060410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6125,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے ابو التیاح نے بیان کیا ، انہوں نے انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، آسانی پیدا کرو ، تنگی نہ پیدا کرو ، لوگوں کو تسلی اور تشفی دو نفرت نہ دلاؤ ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 152,
        "matchingArabicURN": 174400,
        "last_updated": null
    },
    {
        "urduURN": 4060420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6126,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، ان سے مالک نے ، ان سے ابن شہاب نے ، ان سے عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "جب بھی رسول اللہ صلی اللہ علیہ وسلم کو دو چیزوں میں سے ایک کو اختیار کرنے کا اختیار دیا گیا تو آپ نے ہمیشہ ان میں آسان چیزوں کو اختیار فرمایا ، بشرطیکہ اس میں گناہ کا کوئی پہلو نہ ہوتا ۔ اگر اس میں گناہ کا کوئی پہلو ہوتا تو آنحضرت اس سے سب سے زیادہ دور رہتے اور حضور اکرم صلی اللہ علیہ وسلم نے اپنی ذات کے لئے کسی سے بدلہ نہیں لیا ، البتہ اگر کوئی شخص اللہ کی حرمت وحد کو توڑ تا تو آنحضرت صلی اللہ علیہ وسلم ان سے تو محض اللہ کی رضامندی کے لئے بدلہ لیتے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 153,
        "matchingArabicURN": 174410,
        "last_updated": null
    },
    {
        "urduURN": 4060430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6127,
        "hadithSanad": "ہم سے ابو النعمان بن محمد بن فضل سدوسی نے بیان کیا ، کہا ہم سے حمادبن زید نے بیان کیا ، ان سے ازرق بن قیس نے کہ",
        "hadithText": "اہواز نامی ایرانی شہر میں ہم ایک نہر کے کنارے تھے جو خشک پڑی تھی ، پھر ابوبرزہ اسلمی صحابی گھوڑے پر تشریف لائے اور نماز پڑھی اور گھوڑا چھوڑ دیا ۔ گھوڑا بھاگنے لگا تو آپ نے نماز توڑ دی اور اس کا پیچھا کیا ، آخر اس کے قریب پہنچے اور اسے پکڑ لیا ۔ پھر واپس آ کر نماز قضاء کی ، وہاں ایک شخص خارجی تھا ، وہ کہنے لگا کہ اس بوڑھے کو دیکھو اس نے گھوڑے کے لئے نماز توڑ ڈالی ۔ ابوبرزہ اسلمی رضی اللہ عنہ نماز سے فارغ ہو کر آئے اور کہا جب سے میں رسول اللہ صلی اللہ علیہ وسلم سے جدا ہوا ہوں ، کسی نے مجھ کو ملامت نہیں کی اور انہوں نے کہا کہ میرا گھر یہاں سے دور ہے ، اگر میں نماز پڑھتا رہتا اور گھوڑے کو بھاگنے دیتا تو اپنے گھر رات تک بھی نہ پہنچ پاتا اور انہوں نے بیان کیا کہ وہ آنحضرت صلی اللہ علیہ وسلم کی صحبت میں رہے ہیں اور میں نے آنحضرت صلی اللہ علیہ وسلم کو آسان صورتوں کو اختیار کرتے دیکھا ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 154,
        "matchingArabicURN": 174420,
        "last_updated": null
    },
    {
        "urduURN": 4060440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6128,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ( دوسری سند ) اورلیث بن سعد نے بیان کیا کہ مجھ سے یونس نے بیان کیا ، ان سے ابن شہاب نے ، انہیں عبیداللہ بن عبداللہ بن عتبہ نے خبر دی اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "ایک دیہاتی نے مسجد میں پیشاب کر دیا ، لوگ اس کی طرف مارنے کو بڑھے ، لیکن رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اسے چھوڑ دو اور جہاں اس نے پیشاب کیا ہے اس جگہ پر پانی کا ایک ڈول بھرا ہوا بہادو ، کیونکہ تم آسانی کرنے والے بنا کر بھیجے گئے ہو ۔ تنگی کرنے والے بنا کر نہیں بھیجے گئے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 155,
        "matchingArabicURN": 174430,
        "last_updated": null
    },
    {
        "urduURN": 4060450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6129,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے ابو التیاح نے ، کہا میں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ہم بچوں سے بھی دل لگی کرتے ، یہاں تک کہ میرے چھوٹے بھائی ابو عمیر نامی سے ( مزاحاً ) فرماتے ” یا ابا عمیر ما فعل النغیر “ سے ابو عمیر ! تیری ، نغیر نامی چڑیا تو بخیر ہے ؟</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 156,
        "matchingArabicURN": 174440,
        "last_updated": null
    },
    {
        "urduURN": 4060460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6130,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو ابومعاویہ نے خبر دی ، کہا ہم سے ہشام نے ، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کے یہاں لڑکیوں کے ساتھ کھیلتی تھی ، میری بہت سی سہیلیاں تھیں جو میرے ساتھ کھیلا کرتی تھیں ، جب آنحضرت اندر تشریف لاتے تو وہ چھپ جاتیں پھر آنحضرت صلی اللہ علیہ وسلم انہیں میرے پاس بھیجتے اور وہ میرے ساتھ کھیلتیں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 157,
        "matchingArabicURN": 174450,
        "last_updated": null
    },
    {
        "urduURN": 4060470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6131,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے ، ان سے ابن المنکدر نے ، ان سے عروہ بن زبیر نے اور انہیں حضرت عائشہ رضی اللہ عنہا نے خبر دی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم سے ایک شخص نے اندر آنے کی اجازت چاہی تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اسے اندر بلا لو ، یہ اپنی قوم کا بہت ہی برا آدمی ہے ، جب وہ شخص اندر آ گیا تو آنحضرت صلی اللہ علیہ وسلم نے اس کے ساتھ نرمی کے ساتھ گفتگو فرمائی ۔ میں نے عرض کیا یا رسول اللہ ! آپ نے ابھی اس کے متعلق کیا فرمایا تھا اور پھر اتنی نرمی کے ساتھ گفتگو فرمائی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، عائشہ اللہ کے نزدیک ایک مرتبہ کے اعتبار سے وہ شخص سب سے برا ہے جسے لوگ اس کی بد خلقی کی وجہ سے چھوڑدیں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 158,
        "matchingArabicURN": 174460,
        "last_updated": null
    },
    {
        "urduURN": 4060480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6132,
        "hadithSanad": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ، کہا ہم کو ابن علیہ نے خبر دی ، کہا ہم کو ایوب نے خبر دی ، انہیں عبداللہ بن ابی ملیکہ نے خبر دی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے پاس ہدیہ میں دیبا کی چند قبائیں آئیں ، ان میں سونے کے بٹن لگے ہوئے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے وہ قبائیں اپنے صحابہ میں تقسیم کر دیں اورمخرمہ کے لئے باقی رکھی ، جب مخرمہ آیا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ میں نے تمہارے لئے چھپا رکھی تھی ۔ ایوب نے کہا یعنی اپنے کپڑے میں چھپا رکھی تھی آپ مخرمہ کو خوش کرنے کے لئے اس کے تکمے یا گھنڈی کو دکھلا رہے تھے کیونکہ وہ ذرا سخت مزاج آدمی تھے ۔ اس حدیث کو حماد بن زید نے بھی ایوب کے واسطہ سے روایت کیا مرسلات میں اور حاتم بن وردان نے کہا ہم سے ایوب نے بیان کیا ، ان سے ابی ملیکہ نے اور ان سے مسور بن مخرمہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم کے پاس چند قبائیں تحفہ میں آئیں پھر ایسی ہی حدیث بیان کی ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 159,
        "matchingArabicURN": 174471,
        "last_updated": null
    },
    {
        "urduURN": 4060490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6133,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، انہوں نے کہا ان سے عقیل نے بیان کیا ، ان سے زہری نے ، ان سے ابن مسیب نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا مومن کوایک سوراخ سے دوبارہ ڈنگ نہیں لگ سکتا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 160,
        "matchingArabicURN": 174490,
        "last_updated": null
    },
    {
        "urduURN": 4060500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6134,
        "hadithSanad": "ہم سے اسحاق بن منصور نے بیان کیا ، کہا ہم سے روح بن عبادہ نے ، کہا ہم سے حسین نے ، ان سے یحییٰ بن ابی بکر نے ، ان سے ابوسلمہ بن عبدالرحمٰن نے اور ان سے عبداللہ بن عمرو رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم میرے پاس تشریف لائے اور فرمایا ، کیا یہ میری خبر صحیح ہے کہ تم رات بھر عبادت کرتے رہتے ہو اور دن میں روزے رکھتے ہو ؟ میں نے کہا کہ جی ہاں یہ صحیح ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ایسا نہ کرو ، عبادت بھی کرو اور سو بھی ، روزے بھی رکھ اور بلا روزے بھی رہ ، کیونکہ تمہارے جسم کا بھی تم پر حق ہے ، تمہاری آنکھوں کا بھی تم پر حق ہے ، تم سے ملاقات کے لئے آنے والوں کا بھی تم پر حق ہے ، تمہاری بیوی کا بھی تم پر حق ہے ، امید ہے کہ تمہاری عمر لمبی ہو گی ، تمہارے لئے یہی کافی ہے کہ ہرمہینہ میں تین روزے رکھو ، کیونکہ ہر نیکی کا بدلہ دس گناہ ملتا ہے ، اس طرح زندگی بھر کا روزہ ہو گا ۔ انہوں نے بیان کیا کہ میں نے سختی چاہی تو آپ نے میرے اوپر سختی کر دی ، میں نے عرض کیا کہ میں اس سے زیادہ کی طاقت رکھتا ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر ہر ہفتے تین روزہ رکھا کر ، بیان کیا کہ میں نے اور سختی چاہی اور آپ نے میرے اوپر سختی کر دی ۔ میں نے عرض کیا کہ میں اس سے بھی زیادہ کی طاقت رکھتا ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھراللہ کے نبی داؤد علیہ السلام جیسا روزہ رکھ ۔ میں نے پوچھا ، اللہ کے نبی داؤد علیہ السلام کا روزہ کیسا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ایک دن روزہ ایک دن افطار گویا آدھی عمر کے روزے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 161,
        "matchingArabicURN": 174500,
        "last_updated": null
    },
    {
        "urduURN": 4060510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6135,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں سعید بن ابی سعید مقبری نے ، انہیں ابوشریح کعبی رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہو اسے اپنے مہمان کی عزت کرنا چاہیئے ۔ اس کی خاطر داری بس ایک دن اوررات کی ہے مہمانی تین دن اور راتوں کی ۔ اس کے بعد جو ہو وہ صدقہ ہے اور مہمان کے لئے جائز نہیں کہ وہ اپنے میزبان کے پاس اتنے دن ٹھہرجائے کہ اسے تنگ کر ڈالے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 162,
        "matchingArabicURN": 174511,
        "last_updated": null
    },
    {
        "urduURN": 4060520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6136,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا کہ ہم سے ابن مہندی نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے ابو حصین نے ، ان سے ابوصالح نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہو ، اس پر لازم ہے کہ اپنے پڑوسی کو تکلیف نہ دے ، جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہو ، اس پر لازم ہے کہ اپنے مہمان کی عزت کرے اور جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہو ، اس پر لازم ہے کہ بھلی بات کہے ورنہ چپ رہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 163,
        "matchingArabicURN": 174530,
        "last_updated": null
    },
    {
        "urduURN": 4060530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6137,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، ہم سے لیث بن سعد نے ، ان سے یزید بن ابی حبیب نے ، ان سے ابو الخیر نے اور ان سے عقبہ بن عامر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم نے عرض کیا ، یا رسول اللہ ! آپ ہمیں ( تبلیغ وغیرہ کے لئے ) بھیجتے ہیں اور راستے میں ہم بعض قبیلوں کے گاؤںمیں قیام کرتے ہیں لیکن وہ ہماری مہمانی نہیں کرتے ، آنحضرت صلی اللہ علیہ وسلم کا اس سلسلے میں کیا اشارہ ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے اس پر ہم سے فرمایا کہ جب تم ایسے لوگوں کے پاس جا کر اترو اور وہ جیسا دستور ہے مہمانی کے طور پرتم کو کچھ دیں تو اسے منظور کر لو اگر نہ دیں تو مہمانی کا حق قاعدے کے موافق ان سے وصول کر لو ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 164,
        "matchingArabicURN": 174540,
        "last_updated": null
    },
    {
        "urduURN": 4060540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6138,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے ہشام بن یوسف نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے انہیں ابوسلمہ نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جو شخص اللہ پر اور آخرت کے دن پر ایمان رکھتا ہو اسے اپنے مہمان کی عزت کرنی چاہیئے اور جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہو اسے چاہئے کہ وہ صلہ رحمی کرے ، جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہو ، اسے چاہیئے کہ اچھی بات زبان سے نکالے ورنہ چپ رہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 165,
        "matchingArabicURN": 174550,
        "last_updated": null
    },
    {
        "urduURN": 4060550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6139,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے جعفر بن عون نے بیان کیا ، کہا ہم ابو العمیس ( عتبہ بن عبداللہ ) نے بیان کیا ، ان سے عون بن ابی جحیفہ نے اور ان سے ان کے والد نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے سلمان فارسی اور ابودرداء رضی اللہ عنہما کو بھائی بھائی بنا دیا ۔ ایک مرتبہ سلمان ابودرداء رضی اللہ عنہما کی ملاقات کے لئے تشریف لائے اور ام الدرداء رضی اللہ عنہا کو بڑی خستہ حالت میں دیکھا اور پوچھا کیا حال ہے ؟ وہ بولیں تمہارے بھائی ابودرداء کو دنیا سے کوئی سروکار نہیں ۔ پھر ابودرداء تشریف لائے تو سلمان رضی اللہ عنہ نے ان کے سامنے کھانا پیش کیا ۔ انہوں نے کہا کہ آپ کھایئے ، میں روزے سے ہوں ۔ سلمان فارسی رضی اللہ عنہ بولے کہ میں اس وقت تک نہیں کھاؤں گا ۔ جب تک آپ بھی نہ کھائیں ۔ چنانچہ ابودرداء نے بھی کھایا رات ہوئی تو ابودرداء رضی اللہ عنہ نماز پڑھنے کی تیاری کرنے لگے ۔ سلمان نے کہا کہ سو جایئے ، پھر جب آخر رات ہوئی تو ابودرداء نے کہا ا ب اٹھئے ، بیان کیا کہ پھر دونوں نے نماز پڑھی ۔ اس کے بعد سلمان رضی اللہ عنہ نے کہا کہ بلاشبہ تمہارے رب کا تم پر حق ہے اور تمہاری جان کا بھی تم پر حق ہے ، تمہاری بیوی کا بھی تم پر حق ہے ، پس سارے حق داروں کے حقوق ادا کرو ۔ پھر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آپ سے اس کا ذکر کیا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ سلمان نے سچ کہا ہے ۔ ابو جحیفہ کا نام وہب السوائی ہے ، جسے وہب الخیر بھی کہتے ہیں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 166,
        "matchingArabicURN": 174560,
        "last_updated": null
    },
    {
        "urduURN": 4060560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6140,
        "hadithSanad": "ہم سے عیاش بن ولید نے بیان کیا ، کہا ہم سے عبدالاعلیٰ نے بیان کیا ، کہا ہم سے سعید الجریری نے بیان کیا ، ان سے ابوعثمان نہدی نے ، ان سے عبدالرحمٰن بن ابی بکر رضی اللہ عنہما نے کہ",
        "hadithText": "حضرت ابوبکر رضی اللہ عنہ نے کچھ لوگوں کی میزبانی کی اور عبدالرحمٰن سے کہا کہ مہمانوں کا پوری طرح خیال رکھنا کیونکہ میں نبی کریم صلی اللہ علیہ وسلم کے پاس جاؤں گا ، میرے آنے سے پہلے انہیں کھانا کھلادینا ۔ چنانچہ عبدالرحمٰن کھانا مہمانوں کے پاس لائے اور کہا کہ کھانا کھایئے ۔ انہوں نے پوچھا کہ ہمارے گھر کے مالک کہاں ہیں ؟ انہوں نے عرض کیا کہ آپ لوگ کھانا کھالیں ۔ مہمانوں نے کہا کہ جب تک ہمارے میزبان نہ آ جائیں ہم کھانا نہیں کھائیں گے ۔ عبدالرحمٰن رضی اللہ عنہ نے عرض کیا کہ ہماری درخواست قبول کر لیجئے کیونکہ حضرت ابوبکر رضی اللہ عنہ کے آنے تک اگر آپ لوگ کھانے سے فارغ نہیں ہو گئے توہمیں ان کی خفگی کاسامنا ہو گا ۔ انہوں نے اس پر بھی انکارکیا ۔ میں جانتا تھا کہ ابوبکر رضی اللہ عنہ مجھ پر ناراض ہوں گے ۔ اس لئے جب وہ آئے میں ان سے بچنے لگا ۔ انہوں نے پوچھا ، تم لوگوں نے کیا کیا ؟ گھر والوں نے انہیں بتایا تو انہوں نے عبدالرحمٰن رضی اللہ عنہ کوپکارا ! میں خاموش رہا ۔ پھر انہوں نے پکارا ! عبدالرحمٰن ! میں اس مرتبہ بھی خاموش رہا ۔ پھر انہوں نے کہا ارے پاجی میں تجھ کوقسم دیتا ہوں کہ اگر تو میری آواز سن رہا ہے تو باہر آ جا ، میں باہر نکلا اور عرض کیا کہ آپ اپنے مہمانوں سے پوچھ لیں ۔ مہمانوں نے بھی کہا عبدالرحمٰن سچ کہہ رہا ہے ۔ وہ کھانا ہمارے پاس لائے تھے ۔ آخر والد رضی اللہ عنہ نے کہا کہ تم لوگوں نے میرا انتظار کیا ، اللہ کی قسم میں آج رات کھانا نہیں کھاؤں گا ۔ مہمانوں نے بھی قسم کھا لی اللہ کی قسم جب تک آپ نہ کھائیں ہم بھی نہ کھائیں گے ۔ ابوبکر رضی اللہ عنہ نے کہا بھائی میں نے ایسی خراب بات کبھی نہیں دیکھی ۔ مہمانو ! تم لوگ ہماری میزبانی سے کیوں انکار کرتے ہو ۔ خیر عبدالرحمٰن کھانا لا ، وہ کھانا لائے تو آپ نے اس پر اپنا ہاتھ رکھ کر کہا ، اللہ کے نام سے شروع کرتا ہوں ، پہلی حالت ( کھانا نہ کھانے کی قسم ) شیطان کی طرف سے تھی ۔ چنانچہ انہوں نے کھانا کھایا اور ان کے ساتھ مہمانوں نے بھی کھایا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 167,
        "matchingArabicURN": 174570,
        "last_updated": null
    },
    {
        "urduURN": 4060570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6141,
        "hadithSanad": "مجھ سے محمدبن مثنیٰ نے بیان کیا ، کہا ہم سے ابن ابی عدی نے بیان کیا ، ان سے سلیمان ابن طرفان نے ، ان سے ابوعثمان نہدی نے کہ عبدالرحمٰن بن ابی بکر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "حضرت ابوبکر رضی اللہ عنہ اپنا ایک مہمان یا کئی مہمان لے کر گھر آئے ۔ پھر آپ شام ہی سے نبی کریم صلی اللہ علیہ وسلم کے پاس چلے گئے ، جب وہ لوٹ کر آئے تو میری والدہ نے کہا کہ آج اپنے مہمانوں کو چھوڑ کر آپ کہاں رہ گئے تھے ۔ ابوبکر رضی اللہ عنہ نے پوچھا کیا تم نے ان کوکھانا نہیں کھلایا ۔ انہوں نے کہا کہ ہم نے تو کھانا ان کے سامنے پیش کیا لیکن انہوں نے انکار کیا ۔ یہ سن کر ابوبکر رضی اللہ عنہ کو غصہ آیا اور انہوں نے ( گھر والوںکو ) برا بھلا کہا اور دکھ کا اظہار کیا اور قسم کھا لی کہ میں کھانا نہیں کھاؤں گا ۔ عبدالرحمٰن کہتے ہیں کہ میں توڈر کے مارے چھپ گیا تو آپ نے پکارا کہ اے پاجی ! کدھر ہے تو ادھر آ ۔ میری والدہ نے بھی قسم کھا لی کہ اگر وہ کھانا نہیں کھائیں گے تو وہ بھی نہیں کھائیں گی ۔ اس کے بعد مہمانوں نے بھی قسم کھا لی کہ اگر ابوبکر نہیں کھائیں گے تو وہ بھی نہیں کھائیں گے ۔ آخر حضرت ابوبکر رضی اللہ عنہ نے کہا کہ یہ غصہ کرنا شیطانی کام تھا ، پھر آپ نے کھانا منگوایا اور خود بھی مہمانوں کے ساتھ کھایا ( اس کھانے میں یہ برکت ہوئی ) جب یہ لوگ ایک لقمہ اٹھاتے تو نیچے سے کھانا اور بھی بڑھ جاتا تھے ۔ ابوبکر رضی اللہ عنہ نے کہا اے بنی فراس کی بہن ! یہ کیا ہو رہا ہے ، کھاناتواور بڑھ گیا ۔ انہوں نے کہا کہ میری آنکھوں کی ٹھنڈک ! اب یہ اس سے بھی زیادہ ہو گیا ۔ جب ہم نے کھانا کھایا بھی نہیں تھا ۔ پھر سب نے کھایا اور اس میں سے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں بھیجا ، کہتے ہیں کہ آنحضرت صلی اللہ علیہ وسلم نے بھی اس کھانے میں سے کھایا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 168,
        "matchingArabicURN": 174580,
        "last_updated": null
    },
    {
        "urduURN": 4060580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد نے بیان کیا ، وہ ابن زید ہیں ، ان سے یحییٰ بن سعید نے ، ان سے انصار کے غلام بشیر بن یسار نے ، ان سے رافع بن خدیج اورسہل بن ابی حثمہ نے بیان کیا کہ",
        "hadithText": "عبداللہ بن سہل اورمحیصہ بن مسعود خیبر سے آئے اور کھجور کے باغ میں ایک دوسرے سے جدا ہو گئے ۔ عبداللہ بن سہل وہیں قتل کر دیئے گئے ۔ پھر عبدالرحمٰن بن سہل اورمسعود کے دونوں بیٹے حویصہ اورمحیصہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اپنے مقتول ساتھی ( عبداللہ رضی اللہ عنہ ) کے مقدمہ میں گفتگو کی ۔ پہلے عبدالرحمٰن نے بولنا چاہا جو سب سے چھوٹے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ بڑے کی بڑائی کرو ۔ ( ابن سعید نے اس کا مقصد یہ ) بیان کیا کہ جو بڑاہے وہ گفتگو کرے ، پھر انہوں نے اپنے ساتھی کے مقدمہ میں گفتگو کی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اگر تم میں سے 50 آدمی قسم کھالیں کہ عبداللہ کویہودیوں نے مارا ہے تو تم دیت کے مستحق ہو جاؤ گے ۔ انہوں نے عرض کیا یا رسول اللہ ! ہم نے خود تو اسے دیکھا نہیں تھا ( پھر اس کے متعلق قسم کیسے کھا سکتے ہیں ؟ ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا پھر یہود اپنے پچاس آدمیوں سے قسم کھلوا کرتم سے چھٹکارا پا لیں گے ۔ انہوں نے عرض کیا یا رسول اللہ ! یہ کافر لوگ ہیں ( ان کی قسم کاکیا بھروسہ ) چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے عبداللہ بن سہل کے وارثوں کو دیت خود اپنی طرف سے ادا کر دی ۔ حضرت سہل رضی اللہ عنہ نے بیان کیا کہ ان اونٹوں میں سے ( جو آنحضرت صلی اللہ علیہ وسلم نے انہیں دیت میں دئیے تھے ) ایک اونٹنی کو میں نے پکڑا وہ تھان میں گھس گئی ، اس نے ایک لات مجھ کو لگائی ۔ اور لیث نے کہا مجھ سے یحییٰ نے بیان کیا ، ان سے بشیر نے اور ان سے سہل نے ، یحییٰ نے یہاں بیان کیا کہ میں سمجھتا ہوں کہ بشیر نے ” مع رافع بن خدیج “ کے الفاظ کہے تھے ۔ اور سفیان بن عیینہ نے بیان کیا ، ان سے یحییٰ نے بیان کیا ، ان سے بشیر نے اور انہوں نے صرف سہل سے روایت کی ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 169,
        "matchingArabicURN": 174590,
        "last_updated": null
    },
    {
        "urduURN": 4060590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6144,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ بن کثیر نے بیان کیا ، ان سے عبیداللہ نے کہا کہ مجھ سے نافع نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیاکہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، مجھے اس درخت کا نام بتاؤ ، جس کی مثال مسلمان کی سی ہے ۔ وہ ہمیشہ اپنے رب کے حکم سے پھل دیتا ہے اور اس کے پتے نہیں جھڑا کرتے ۔ میرے دل میں آیا کہ کہہ دوں کہ وہ کھجور کا درخت ہے لیکن میں نے کہنا پسند نہیں کیا ۔ کیونکہ مجلس میں حضرات ابوبکر اور عمر رضی اللہ عنہما جیسے اکابر بھی موجود تھے ۔ پھر جب ان دونوں بزرگوں نے کچھ نہیں کہا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ کھجور کا درخت ہے ۔ جب میں اپنے والد کے ساتھ نکلا تو میں نے عرض کیا کہ میرے دل میں آیا کہ کہہ دوں یہ کھجور کا درخت ہے ، انہوں نے کہا پھر تم نے کہا کیوں نہیں ؟ اگر تم نے کہہ دیا ہوتا میرے لئے اتنا مال اور اسباب ملنے سے بھی زیادہ خوشی ہوتی ۔ ابن عمر رضی اللہ عنہما نے بیان کیا کہ ( میں نے عرض کیا ) صرف اس وجہ سے میں نے نہیں کہا کہ جب میں نے آپ کو اور حضرت ابوبکر رضی اللہ عنہ جیسے بزرگ کو خاموش دیکھا تو میں نے آپ بزرگوں کے سامنے بات کرنا برا جانا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 170,
        "matchingArabicURN": 174610,
        "last_updated": null
    },
    {
        "urduURN": 4060600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6145,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہوں نے کہا مجھ کو ابوبکر بن عبدالرحمٰن نے خبر دی ، انہیں مروان بن حکم نے خبر دی ، انہیں عبدالرحمٰن بن اسود بن عبد یغوث نے خبر دی ، انہیں ابی بن کعب رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، بعض شعروں میں دانائی ہوتی ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 171,
        "matchingArabicURN": 174620,
        "last_updated": null
    },
    {
        "urduURN": 4060610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6146,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے اسود بن قیس نے ، انہوں نے کہا کہ میں نے جندب بن عبداللہ بجلی سے سنا ، انہوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم چل رہے تھے کہ آپ کو پتھر سے ٹھوکر لگی اور آپ گر پڑے ، اس سے آپ کی انگلی سے خون بہنے لگا ، آپ نے یہ شعر پڑھا ۔  تو تو اک انگلی ہے اور کیا ہے جو زخمی ہو گئی کیا ہوا اگر راہ مولیٰ میں تو زخمی ہو گئی</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 172,
        "matchingArabicURN": 174630,
        "last_updated": null
    },
    {
        "urduURN": 4060620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6147,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، انہوں نے کہا ہم سے عبدالرحمٰن بن مہدی نے بیان کیا ، ان سے سفیان نے بیان کیا ، ا ن سے عبدالملک نے ، انہوں نے کہا ہم سے ابوسلمہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، شعراء کے کلام میں سے سچا کلمہ لبید کا مصرعہ ہے جو یہ ہے کہ ! ” اللہ کے سوا جو کچھ ہے سب معدوم وفنا ہونے والا ہے ۔ “ امیہ بن ابی الصلت شاعر تو قریب تھا کہ مسلمان ہو جائے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 173,
        "matchingArabicURN": 174640,
        "last_updated": null
    },
    {
        "urduURN": 4060630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6148,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے حاتم بن اسماعیل نے ، ان سے برید ابن ابی عبید نے اور ان سے سلمہ بن اکوع رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جنگ خیبر میں گئے اور ہم نے رات میں سفر کیا ، اتنے میں مسلمانوں کے آدمی نے عامر بن اکوع رضی للہ عنہ سے کہا کہ اپنے کچھ شعر اشعار سناؤ ۔ راوی نے بیان کیا کہ عامر شاعر تھے ۔ وہ لوگوں کو اپنی حدی سنانے لگے ۔ ” اے اللہ ! اگر تونہ ہوتا تو ہم ہدایت نہ پاتے نہ ہم صدقہ نہ دے سکتے اور نہ نماز پڑھ سکتے ۔ ہم تجھ پر فدا ہوں ، ہم نے جو کچھ پہلے گناہ کئے ان کو تو معاف کر دے اور جب ( دشمن سے ) ہمارا سامنا ہو تو ہمیں ثابت قدم رکھ اور ہم پر سکون نازل فرما ۔ جب ہمیں جنگ کے لئے بلایا جاتا ہے ، تو ہم موجود ہو جاتے ہیں اور دشمن نے بھی پکارکر ہم سے نجات چاہی ہے ۔ “ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا یہ کون اونٹوں کو ہانک رہا ہے جو حدی گا رہا ہے ؟ صحابہ نے عرض کیا کہ عامر بن اکوع ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اللہ پاک اس پر رحم کرے ۔ ایک صحابی یعنی عمر رضی اللہ عنہ نے کہا ، یا رسول اللہ ! اب تو عامر شہید ہوئے ۔ کاش اور چند روز آپ ہم کو عامر سے فائدہ اٹھانے دیتے ۔ راوی نے بیان کیا کہ پھر ہم خیبر آئے اور اس کو گھیر لیا اس گھراؤ میں ہم شدید فاقوں میں مبتلا ہوئے ، پھر اللہ تعالیٰ نے خیبر والوں پر ہم کو فتح عطافرمائی جس دن ان پر فتح ہوئی اس کی شام کو لوگوں نے جگہ جگہ آگ جلائی ۔ آنحضرت صلی اللہ علیہ وسلم نے پوچھا کہ یہ آگ کیسی ہے ، کس کام کے لئے تم لوگوں نے یہ آگ جلائی ہے ؟ صحابہ نے عرض کیا کہ گوشت پکانے کے لئے ۔ اس پر آپ نے دریافت فرمایا کس چیز کے گوشت کے لئے ؟ صحابہ نے کہا کہ بستی کے پالتو گدھوں کا گوشت پکانے کے لیے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، گوشت کو برتنوں میں سے پھینک دو اور برتنوں کو توڑ دو ۔ ایک صحابی نے عرض کیا یا رسول اللہ ! ہم گوشت تو پھینک دیں گے ، مگر برتن توڑنے کے بجائے اگر دھو لیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اچھا یوں ہی کر لو ۔ جب لوگوں نے جنگ کی صف بندی کر لی تو عامر ( ابن اکوع شاعر ) نے اپنی تلوار سے ایک یہودی پر وار کیا ، ان کی تلوار چھوٹی تھی اس کی نوک پلٹ کر خود ان کے گھٹنوں پر لگی اور اس کی وجہ سے ان کی شہادت ہو گئی ۔ جب لوگ واپس آنے لگے تو سلمہ ( عامر کے بھائی ) نے بیان کیا کہ مجھے آنحضرت صلی اللہ علیہ وسلم نے دیکھا کہ میرے چہرے کا رنگ بدلا ہوا ہے ۔ دریافت فرمایا کہ کیا بات ہے ؟ میں نے عرض کیا آنحضرت صلی اللہ علیہ وسلم پر میرے ماں اور باپ فدا ہوں ، لوگ کہہ رہے ہیں کہ عامر کے اعمال برباد ہو گئے ۔ ( کیونکہ ان کی موت خود ان کی تلوار سے ہوئی ہے ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا یہ کس نے کہا ؟ میں نے عرض کیا ، فلاں ، فلاں ، فلاں اور اسید بن حضیر انصاری نے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، جس نے یہ بات کہی اس نے جھوٹ کہا ہے انہیں تو دوہرا اجر ملے گا ۔ آنحضرت صلی اللہ علیہ وسلم نے اپنی دو انگلیوں کو ملا کر اشارہ کیا کہ وہ عابد بھی تھا اور مجاہد بھی ( توعبادت اور جہاد دونوں کا ثواب اس نے پایا ) عامرکی طرح تو بہت کم بہادر عرب میں پیدا ہوئے ہیں ( وہ ایسا بہادر اور نیک آدمی تھا )</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 174,
        "matchingArabicURN": 174650,
        "last_updated": null
    },
    {
        "urduURN": 4060640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6149,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے اسماعیل نے بیان کیا ، کہا ہم سے ایوب سختیانی نے بیان کیا ، ان سے ابوقلابہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ( ایک سفر میں کے موقع پر ) اپنی عورتوں کے پاس آئے جو اونٹوں پر سوار جا رہی تھیں ، ان کے ساتھ ام سلیم رضی اللہ عنہا انس کی والدہ بھی تھیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، افسوس ، انجشہ ! شیشوں کو آہستگی سے لے چل ۔ ابوقلابہ نے کہا کہ آنحضرت نے عورتوں سے متعلق ایسے الفاظ کا استعمال فرمایا کہ اگر تم میں کوئی شخص استعمال کرے تو تم اس پر عیب جوئی کرو ۔ یعنی آنحضرت صلی اللہ علیہ وسلم کا یہ ارشاد کہ شیشوں کو نرمی سے لے چل ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 175,
        "matchingArabicURN": 174660,
        "last_updated": null
    },
    {
        "urduURN": 4060650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6150,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم سے عبدہ نے بیان کیا ، کہا ہم کو ہشام بن عروہ نے خبر دی ، انہیں ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہا کہ",
        "hadithText": "حضرت حسان بن ثابت رضی اللہ عنہ نے مشرکین کی ہجو کرنے کی اجازت چاہی تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ان کا اور میرا خاندان تو ایک ہی ہے ( پھر تو میں بھی اس ہجو میں شریک ہو جاؤں گا ) حسان رضی اللہ عنہ نے کہا کہ میں ہجو سے آپ کو اس طرح صاف نکال دوں گا جس طرح گندھے ہوئے آٹے سے بال نکال لیا جاتا ہے ۔ اور ہشام بن عروہ سے روایت ہے ، ان سے ان کے والد نے بیان کیا کہ میں حسان بن ثابت رضی اللہ عنہ کو حضرت عائشہ رضی اللہ عنہا کی مجلس میں برا کہنے لگا تو انہوں نے کہا کہ حسان کو برا بھلا نہ کہو ، وہ نبی کریم صلی اللہ علیہ وسلم کی طرف سے مشرکوں کوجواب دیتا تھا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 176,
        "matchingArabicURN": 174670,
        "last_updated": null
    },
    {
        "urduURN": 4060660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6151,
        "hadithSanad": "ہم سے اصبغ بن فرج نے بیان کیا ، کہا کہ مجھ سے عبداللہ بن وہب نے بیان کیا ، کہا کہ مجھے یونس نے خبر دی ، انہیں ابن شہاب نے ، انہیں ہشیم بن ابی سنان نے خبر دی کہ",
        "hadithText": "انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا وہ حالات اور قصص کے تحت رسول کریم صلی اللہ علیہ وسلم کا تذکرہ کر رہے تھے ۔ کہ ایک دفعہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا تمہارے ایک بھائی نے کوئی بری بات نہیں کہی ۔ آپ کا اشارہ ابن رواحہ کی طرف تھا ( اپنے اشعار میں ) انہوں نے یوں کہا تھا : ” اور ہم میں اللہ کے رسول ہیں جو اس کی کتاب کی تلاوت کرتے ہیں ، اس وقت جب فجر کی روشنی پھوٹ کر پھیل جاتی ہے ۔ ہمیں انہوں نے گمراہی کے بعد ہدایت کا راستہ دکھایا ۔ پس ہمارے دل اس امر پر یقین رکھتے ہیں کہ آنحضرت صلی اللہ علیہ وسلم نے جو کچھ فرمایا وہ ضرور واقع ہو گا ۔ آپ رات اس طرح گزارتے ہیں کہ ان کا پہلو بستر سے جدا رہتا ہے ( یعنی جاگ کر ) جب کہ کافروں کے بوجھ سے ان کی خواب گاہیں بوجھل ہوئی رہتی ہیں ۔ “ یونس کے ساتھ اس حدیث کو عقیل نے بھی زہری سے روایت کیا اور محمد بن ولید زبیدی نے زہری سے ، انہوں نے سعید بن مسیب سے اور عبدالرحمٰن اعرج سے انہوں نے ابوہریرہ رضی اللہ عنہ سے اس حدیث کو روایت کیا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 177,
        "matchingArabicURN": 174680,
        "last_updated": null
    },
    {
        "urduURN": 4060670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6152,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے ( دوسری سند ) امام بخاری نے کہا اور ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے میرے بھائی عبدالحمید نے بیان کیا ، ان سے سلیمان نے ، ان سے محمد بن ابی عتیق نے ، ان سے ابن شہاب نے ، ان سے ابوسلمہ بن عبدالرحمٰن بن عوف نے ، انہوں نے حسان بن ثابت انصاری رضی اللہ عنہ سے سنا ، وہ حضرت ابوہریرہ رضی اللہ عنہ کو گواہ بنا کر کہہ رہے تھے کہ",
        "hadithText": "اے ابوہریرہ ! میں آپ کو اللہ کی قسم دے کر پوچھتا ہوں ، کیا تم نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اے حسان ! اللہ کے رسول کی طرف سے مشرکوں کوجواب دو ، اے اللہ ! روح القدس کے ذریعہ ان کی مدد کر ۔ حضرت ابوہریرہ رضی اللہ عنہ نے کہا کہ ہاں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 178,
        "matchingArabicURN": 174690,
        "last_updated": null
    },
    {
        "urduURN": 4060680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6153,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عدی بن ثابت نے اور ان سے حضرت براء  بن عازب رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے حسان رضی اللہ عنہ سے فرمایا ان کی ہجو کرو ۔ ( یعنی مشرکین قریش کی ) یا آنحضرت صلی اللہ علیہ وسلم نے ( ھاجھم کے الفاظ فرمائے ) حضرت جبرائیل علیہ السلام تیرے ساتھ ہیں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 179,
        "matchingArabicURN": 174700,
        "last_updated": null
    },
    {
        "urduURN": 4060690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6154,
        "hadithSanad": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا ، انہوں نے کہا ہم کو حنظلہ نے خبر دی ، انہیں سالم نے اور انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ اگر تم میں سے کوئی شخص اپنا پیٹ پیپ سے بھرے تو یہ اس سے بہتر ہے کہ وہ اسے شعر سے بھرے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 180,
        "matchingArabicURN": 174710,
        "last_updated": null
    },
    {
        "urduURN": 4060700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6155,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، انہوں نے کہا مجھ سے میرے والد نے بیان کیا ، انہوں کہا ہم سے اعمش نے بیان کیا ، کہاکہ",
        "hadithText": "میں نے ابوصالح سے سنا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم سے فرمایا ، اگر تم میں سے کوئی شخص اپنا پیٹ پیپ سے بھرلے تو یہ اس سے بہتر ہے کہ وہ شعروں سے بھرجائے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 181,
        "matchingArabicURN": 174720,
        "last_updated": null
    },
    {
        "urduURN": 4060710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6156,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا کہا ہم سے لیث بن سعد نے بیان ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "ابو قعیس کے بھائی افلح ( میرے رضاعی چچانے ) مجھ سے پردہ کا حکم نازل ہونے کے بعد اندر آنے کی اجازت چاہی ، میں نے کہا کہ اللہ کی قسم جب تک آنحضرت صلی اللہ علیہ وسلم اجازت نہ دیں گے میں اندر آنے کی اجازت نہیں دوں گی ۔ کیونکہ ابو قعیس کے بھائی نے مجھے دودھ نہیں پلایا بلکہ ابو القعیس کی بیوی نے دودھ پلایا ہے ۔ پھر جب رسول اللہ صلی اللہ علیہ وسلم تشریف لائے تو میں نے عرض کیا یا رسول اللہ ! مرد نے تو مجھے دودھ نہیں پلایا تھا ، دودھ تو ان کی بیوی نے پلایا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ انہیں اندر آنے کی اجازت دے دو ، کیونکہ وہ تمہارے چچا ہیں ، تمہارے ہاتھ میں مٹی لگے ۔ عروہ نے کہا کہ اسی وجہ سے حضرت عائشہ رضی اللہ عنہا کہتی تھیں کہ جتنے رشتے خون کی وجہ سے حرام ہوتے ہیں وہ رضاعت سے بھی حرام ہی سمجھو ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 182,
        "matchingArabicURN": 174730,
        "last_updated": null
    },
    {
        "urduURN": 4060720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6157,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، انہوں نے کہا ہم سے حکم بن عتیبہ نے بیان کیا ، ان سے ابراہیم نخعی نے ، ان سے اسود نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ( حج سے ) واپسی کا ارادہ کیا تو دیکھا کہ صفیہ رضی اللہ عنہا اپنے خیمے کے دروازہ پر رنجیدہ کھڑی ہیں کیونکہ وہ حائضہ ہو گئی تھیں ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا ۔ عقریٰ حلقیٰ ۔ یہ قریش کامحاورہ ہے ۔ اب تم ہمیں رو کو گی ! پھر دریافت فرمایا کیا تم نے قربانی کے دن طواف افاضہ کر لیا تھا ؟ انہوں نے کہا کہ ہاں ۔ فرمایا کہ پھر چلو ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 183,
        "matchingArabicURN": 174740,
        "last_updated": null
    },
    {
        "urduURN": 4060730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6158,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، کہا ہم سے امام مالک نے ، ان سے عمر بن عبیداللہ کے غلام ابو النضر نے ، ان سے ام ہانی بنت ابی طالب کے غلام ابو مرہ نے خبر دی کہ انہوں نے ام ہانی بنت ابی طالب سے سنا ۔ انہوں نے بیان کیا کہ",
        "hadithText": "فتح مکہ کے موقع پر میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی ۔ میں نے دیکھا کہ آپ غسل کر رہے ہیں اور آپ کی صاحبزادی فاطمہ رضی اللہ عنہا نے پردہ کر دیا ہے ۔ میں نے سلام کیا تو آنحضرت صلی اللہ علیہ وسلم نے دریافت کیا کہ یہ کون ہیں ؟ میں نے کہا کہ ام ہانی بنت ابی طالب ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، ام ہانی ! مرحبا ہو ۔ جب آپ غسل کر چکے تو کھڑے ہو کر آٹھ رکعات پڑھیں ۔ آپ اس وقت ایک کپڑے میں جسم مبارک کو لپیٹے ہوئے تھے ۔ جب نماز سے فارغ ہو گئے تو میں نے عرض کیا یا رسول اللہ ! میرے بھائی ( علی بن ابی طالب رضی اللہ عنہ ) کا خیال ہے کہ وہ ایک ایسے شخص کو قتل کریں گے جسے میں نے امان دے رکھی ہے ۔ یعنی فلاں بن ہبیرہ کو ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، ام ہانی جسے تم نے امان دی اسے ہم نے بھی امان دی ۔ ام ہانی نے بیان کیا کہ یہ نماز چاست کی تھی ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 184,
        "matchingArabicURN": 174750,
        "last_updated": null
    },
    {
        "urduURN": 4060740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6159,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک شخص کو دیکھا کہ قربانی کے لئے ایک اونٹنی ہانکے لئے جا رہا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس پر سوار ہو کر جا ۔ انہوں نے کہا کہ یہ تو قربانی کا جانور ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ سوار ہو جا ، افسوس ( ویلک ) دوسری یا تیسری مرتبہ یہ فرمایا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 185,
        "matchingArabicURN": 174760,
        "last_updated": null
    },
    {
        "urduURN": 4060750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6160,
        "hadithSanad": "مجھ سے قتیبہ بن سعید نے بیان کیا ، وہ امام مالک سے روایت کرتے ہیں ، وہ ابوالزناد سے ، وہ اعرج سے ، وہ حضرت ابوہریرہ رضی اللہ عنہ سے روایت کرتے ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کودیکھا کہ قربانی کا اونٹ ہنکا ئے جا رہا ہے ۔ آپ نے اس سے کہا کہ تو اس پر سوار ہو جا ۔ اس نے عرض کیا کہ یا رسول اللہ ! یہ تو قربانی کا اونٹ ہے ۔ آپ نے دوسری بار یا تیسری بار فرمایا کہ تیری خرابی ہو ، تو سوار ہو جا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 186,
        "matchingArabicURN": 174770,
        "last_updated": null
    },
    {
        "urduURN": 4060760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6161,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ثابت بنانی نے اور ان سے انس بن مالک رضی اللہ عنہ نے ( دوسری سند ) اور اس حدیث کو حماد نے ایوب سختیانی سے اور ایوب نے ابوقلابہ سے روایت کیا اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم ایک سفر میں تھے اور آپ کے ساتھ آپ کا ایک حبشی غلام تھا ۔ ان کا نام انجشہ تھا وہ حدی پڑھ رہا تھا ۔ ( جس کی وجہ سے سواری تیز چلنے لگی ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، افسوس ( ویحک ) اے انجشہ شیشوں کے ساتھ آہستہ آہستہ چل ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 187,
        "matchingArabicURN": 174780,
        "last_updated": null
    },
    {
        "urduURN": 4060770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6162,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے وہیب نے بیان کیا ، ان سے خالد نے ، ان سے عبدالرحمٰن بن ابی بکرہ نے اور ان سے ان کے والد نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے سامنے ایک شخص نے دوسرے شخص کی تعریف کی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا افسوس ( ویلک ) تم نے اپنے بھائی کی گردن کاٹ دی ۔ تین مرتبہ ( یہ فرمایا ) اگر تمہیں کسی کی تعریف ہی کرنی پڑ جائے تو یہ کہے کہ فلاں کے متعلق میرا یہ خیال ہے ۔ اگر وہ بات اس کے متعلق جانتا ہو اور اللہ اس کا نگراں ہے میں تو اللہ کے مقابلے میں کسی کو نیک نہیں کہہ سکتا ۔ یعنی یوں نہیں کہہ سکتا کہ وہ اللہ کے علم میں بھی نیک ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 188,
        "matchingArabicURN": 174790,
        "last_updated": null
    },
    {
        "urduURN": 4060780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6163,
        "hadithSanad": "مجھ سے عبدالرحمٰن بن ابراہیم نے بیان کیا ، کہا ہم سے ولید نے بیان کیا ، ان سے امام اوزاعی نے ، ان سے زہری نے ، ان سے ابوسلمہ اور ضحاک نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک دن نبی کریم صلی اللہ علیہ وسلم کچھ تقسیم کر رہے تھے ۔ بنی تمیم کے ایک شخص ذوالخویصرۃ نے کہا یا رسول اللہ ! انصاف سے کام لیجئے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا افسوس ! اگر میں ہی انصاف نہیں کروں گا تو پھر کون کرے گا ۔ حضرت عمر رضی اللہ عنہ نے کہا ، آنحضرت صلی اللہ علیہ وسلم مجھے اجازت دیں تو میں اس کی گردن مار دوں ۔ آپ نے فرمایا کہ نہیں ۔ اس کے کچھ ( قبیلہ والے ) ایسے لوگ پیدا ہوں گے کہ تم ان کی نماز کے مقابلہ میں اپنی نماز کومعمولی سمجھو گے اور ان کے روزوں کے مقابلہ میں اپنے روزے کو معمولی سمجھو گے لیکن وہ دین سے اس طرح نکل چکے ہوں گے جس طرح تیر شکار سے نکل جاتا ہے ۔ تیرکے پھل میں دیکھا جائے تو اس پر بھی کوئی نشان نہیں ملے گا ۔ اس کی لکڑی پر دیکھا جائے تو اس پر بھی کوئی نشان نہیں ملے گا ۔ پھر اس کے دندانوں میں دیکھا جائے اور اس میں بھی کچھ نہیں ملے گا پھر اس کے پر میں دیکھا جائے تو اس میں بھی کچھ نہیں ملے گا ۔ ( یعنی شکار کے جسم کو پار کرنے کا کوئی نشان ) تیر لید اور خون کو پار کر کے نکل چکا ہو گا ۔ یہ لوگ اس وقت پیدا ہوں گے جب لوگوں میں پھوٹ پڑ جائے گی ۔ ( ایک خلیفہ پر متفق نہ ہوں گے ) ان کی نشانی ان کا ایک مرد ( سردار لشکر ) ہو گا ۔ جس کا ایک ہاتھ عورت کے پستان کی طرح ہو گا یا ( فرمایا ) گوشت کے لوتھڑے کی طرح تھل تھل ہل رہا ہو گا ۔ ابوسعید رضی اللہ عنہ نے بیان کیا کہ میں گواہی دیتا ہوں کہ میں نے رسول اللہ سے یہ حدیث سنی اور میں گواہی دیتا ہوں کہ میں حضرت علی رضی اللہ عنہ کے ساتھ تھا ۔ جب انہوں نے ان خارجیوں سے ( نہروان میں ) جنگ کی تھی ۔ مقتولین میں تلاش کی گئی توایک شخص انہیں صفات کالا یا گیا جو حضور اکرم صلی اللہ علیہ وسلم نے بیان کی تھیں ۔ اس کا ایک ہاتھ پستان کی طرح کا تھا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 189,
        "matchingArabicURN": 174800,
        "last_updated": null
    },
    {
        "urduURN": 4060790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6164,
        "hadithSanad": "ہم سے محمد بن مقاتل ابوالحسن نے بیان کیا ، کہا ہم کو حضرت عبداللہ بن مبارک نے خبر دی ، کہا ہم کو امام اوزاعی نے خبر دی ، کہا کہ مجھ کو ابن شہاب نے خبر دی ، بیان کیا ان سے حمید بن عبدالرحمٰن نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "ایک صحابی رسول کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا یا رسول اللہ ! میں تو تباہ ہو گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، افسوس ( کیا بات ہوئی ؟ ) انہوں نے کہا کہ میں نے رمضان میں اپنی بیوی سے صحبت کر لی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر ایک غلام آزاد کر ۔ انہوں نے عرض کیا کہ میرے پاس غلام ہے ہی نہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر دو مہینے متواتر روزے رکھ ۔ اس نے کہا کہ اس کی مجھ میں طاقت نہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر ساٹھ مسکینوں کو کھانا کھلا ۔ کہا کہ اتنا بھی میں اپنے پاس نہیں پاتا ۔ اس کے بعد کھجور کا ایک ٹوکرا آیا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اسے لے اور صدقہ کر دے ۔ انہوں نے عرض کیا ، یا رسول اللہ ! کیا اپنے گھر والوں کے سوا کسی اور کو ؟ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ! سارے مدینہ کے دونوں طنابوں یعنی دونوں کناروںمیں مجھ سے زیادہ کوئی محتاج نہیں ۔ آنحضرت صلی اللہ علیہ وسلم اس پر اتنا ہنس دیئے کہ آپ کے آگے کے دندان مبارک دکھائی دینے لگے ۔ فرمایا کہ جاؤتم ہی لے لو ۔ اوازاعی کے ساتھ اس حدیث کو یونس نے بھی زہری سے روایت کیا اور عبدالرحمٰن بن خالد نے زہری سے اس حدیث میں بجائے لفظ ویحک کے لفظ ویلک روایت کیا ہے ( معنی دونوں کے ایک ہی ہیں )</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 190,
        "matchingArabicURN": 174810,
        "last_updated": null
    },
    {
        "urduURN": 4060800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6165,
        "hadithSanad": "ہم سے سلیمان بن عبدالرحمٰن نے بیان کیا ، انہوں نے کہا ہم سے ولید نے بیان کیا ، انہوں نے کہا ہم سے ابوعمرو اوزاعی نے بیان کیا ، کہا کہ مجھ سے ابن شہاب زہری نے بیان کیا ، ان سے عطاء بن یزید لیثی نے اور ان سے ابو سعید خدری نے کہ",
        "hadithText": "ایک دیہاتی نے کہا ، یا رسول اللہ ! ہجرت کے بارے میں مجھے کچھ بتائیے ( اس کی نیت ہجرت کی تھی ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، تجھ پر افسوس ! ہجرت کو تو نے کیا سمجھا ہے یہ بہت مشکل ہے ۔ تمہارے پاس کچھ اونٹ ہیں ۔ انہوں نے عرض کیا کہ جی ہاں ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا کیا تم ان کی زکوٰۃ ادا کرتے ہو ؟ انہوں نے عرض کیا کہ جی ہاں ۔ فرمایا کہ پھر سات سمندر پار عمل کرتے رہو ۔ اللہ تمہارے کسی عمل کے ثواب کوضائع نہ کرے گا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 191,
        "matchingArabicURN": 174820,
        "last_updated": null
    },
    {
        "urduURN": 4060810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6166,
        "hadithSanad": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ، انہوں نے کہا ہم سے خالد بن حارث نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے واقد بن محمد بن زید نے بیان کیا ، انہوں نے ان کے والد سے سنا اور انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، افسوس ( ویلکم یا ویحکم ) شعبہ نے بیان کیا کہ شک ان کے شیخ ( واقد بن محمد کو ) تھا ۔ میرے بعد تم کافر نہ ہو جانا کہ ایک دوسرے کی گردن مارنے لگو ۔ اور نضر نے شعبہ سے بیان کیا ” ویحکم “ اور عمر بن محمد نے اپنے والد سے ” ویلکم یا ویحکم “ کے لفظ نقل کئے ہیں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 192,
        "matchingArabicURN": 174830,
        "last_updated": null
    },
    {
        "urduURN": 4060820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6167,
        "hadithSanad": "ہم سے عمرو ابن عاصم نے بیان کیا ، کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس نے کہ",
        "hadithText": "ایک بدوی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ا ورپوچھا یا رسول اللہ قیامت کب آئے گی ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا افسوس ( ویلک ) تم نے اس قیامت کے لئے کیا تیاری کر لی ہے ؟ انہوں نے عرض کیا میں نے اس کے لئے توکوئی تیاری نہیں کی ہے البتہ میں اللہ اور اس کے رسول سے محبت رکھتا ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، پھر تم قیامت کے دن ان کے ساتھ ہو ، جس سے تم محبت رکھتے ہو ۔ ہم نے عرض کیا اور ہمارے ساتھ بھی یہی معاملہ ہو گا ؟ فرمایا کہ ہاں ۔ ہم اس دن بہت زیادہ خوش ہوئے ۔ پھر مغیرہ کے ایک غلام وہاں سے گزرے وہ میرے ہم عمر تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اگر یہ بچہ زندہ رہا تو اس کے بڑھاپا آنے سے پہلے قیامت قائم ہو جائے گی ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 193,
        "matchingArabicURN": 174840,
        "last_updated": null
    },
    {
        "urduURN": 4060830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6168,
        "hadithSanad": "ہم سے بشر بن خالد نے بیان کیا ، انہوں نے کہا ہم سے محمد بن جعفر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے سلیمان نے ، ان سے ابووائل نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، انسان اس کے ساتھ ہے جس سے وہ محبت رکھتا ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 194,
        "matchingArabicURN": 174850,
        "last_updated": null
    },
    {
        "urduURN": 4060840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6169,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے جریر بن عبدالحمید نے بیان کیا ، ان سے اعمش نے ، ان سے ابووائل نے اور ان سے عبداللہ بن مسعود نے کہ",
        "hadithText": "ایک شخص رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا یا رسول اللہ ! آپ کا اس شخص کے بارے میں کیا ارشاد ہے جو ایک جماعت سے محبت رکھتا ہے لیکن ان سے میل نہیں ہو سکا ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کی انسان اس کے ساتھ ہے جس سے وہ محبت رکھتاہے ۔ اس روایت کی متابعت جریر بن حازم ، سلیمان بن قرم اور ابو عوانہ نے اعمش سے کی ، ان سے ابووائل نے ، ان سے عبداللہ بن مسعود نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 195,
        "matchingArabicURN": 174860,
        "last_updated": null
    },
    {
        "urduURN": 4060850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6170,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے اعمش نے ، ان سے ابووائل نے اور ان سے حضرت ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم سے عرض کیا گیا ایک شخص ایک جماعت سے محبت رکھتا ہے لیکن اس سے مل نہیں سکا ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ انسان اس کے ساتھ ہے جس سے وہ محبت رکھتا ہے ۔ سفیان کے ساتھ اس روایت کی متابعت ابومعاویہ اورمحمد بن عبید نے کی ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 196,
        "matchingArabicURN": 174870,
        "last_updated": null
    },
    {
        "urduURN": 4060860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6171,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا ہم کو ہمارے والد عثمان مروزی نے خبر دی ، انہیں شعبہ نے ، انہیں عمرو بن مرہ نے ، انہیں سالم بن ابی الجعد نے اور انہیں حضرت انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "ایک شخص نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا ، یا رسول اللہ ! قیامت کب قائم ہو گی ؟ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا تم نے اس کے لئے کیا تیاری کی ہے ؟ انہوں نے عرض کیا کہ میں نے اس کے لئے بہت ساری نمازیں ، روزے اور صدقے نہیں تیار کر رکھے ہیں ، لیکن میں اللہ اور اس کے رسول سے محبت رکھتا ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم اس کے ساتھ ہو جس سے تم محبت رکھتے ہو ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 197,
        "matchingArabicURN": 174880,
        "last_updated": null
    },
    {
        "urduURN": 4060870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6172,
        "hadithSanad": "ہم سے ابو الولید نے بیان کیا ، کہا ہم سے مسلم بن زریر نے بیان کیا ، کہا میں نے ابو رجاء سے سنا اور انہوں نے حضرت ابن عباس رضی اللہ عنہما سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ابن صیاد سے فرمایا ، میں نے اس وقت اپنے دل میں ایک بات چھپا رکھی ہے ، وہ کیا ہے ؟ وہ بولا ” الدخ “ آنحضرت صلی اللہ علیہ وسلم نے فرمایا چل دور ہو جا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 198,
        "matchingArabicURN": 174890,
        "last_updated": null
    },
    {
        "urduURN": 4060880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6173,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے کہا کہ مجھے سالم بن عبداللہ نے خبر دی ، انہیں عبداللہ بن عمر رضی اللہ عنہما نے خبر دی ، کہ",
        "hadithText": "عمر بن خطاب رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ابن صیاد کی طرف گئے ۔ بہت سے دوسرے صحابہ بھی ساتھ تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے دیکھا کہ وہ چند بچوں کے ساتھ بنی مغالہ کے قلعہ کے پاس کھیل رہا ہے ۔ ان دنوں ابن صیاد بلوغ کے قریب تھا ۔ آنحضرت صلی اللہ علیہ وسلم کی آمد کا اسے احساس نہیں ہوا ۔ یہاں تک کہ آپ نے اس کی پیٹھ پر اپنا ہاتھ مارا ۔ پھر فرمایا کیا تو گواہی دیتا ہے کہ میں اللہ کا رسول ہوں ؟ اس نے آنحضرت صلی اللہ علیہ وسلم کی طرف دیکھ کر کہا ۔ میں گواہی دیتا ہوں کہ آپ امیوں کے یعنی ( عربوں کے ) رسول ہیں ۔ پھر ابن صیاد نے کہا کیا آپ گواہی دیتے ہیں کہ میں اللہ کا رسول ہوں ؟ آنحضرت صلی اللہ علیہ وسلم نے اس پر اسے دفع کر دیا اور فرمایا ، میں اللہ اور اس کے رسول پر ایمان لایا ۔ پھر ابن صیاد سے آپ نے پوچھا ، تم کیا دیکھتے ہو ؟ اس نے کہا کہ میرے پاس سچا اور جھوٹا دونوں آتے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا تمہارے لئے معاملہ کومشتبہ کر دیا گیا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا میں نے تمہارے لئے ایک بات اپنے دل میں چھپا رکھی ہے ؟ اس نے کہا کہ وہ ” الدخ “ ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا دور ہو ، اپنی حیثیت سے آگے نہ بڑھ ۔ عمر رضی اللہ عنہ نے عرض کیا یا رسول اللہ ! کیا آپ مجھے اجازت دیں گے کہ اسے قتل کر دوں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، اگر یہ وہی ( دجال ) ہے تو اس پر غالب نہیں ہوا جا سکتا اور اگر یہ دجال نہیں ہے تو اسے قتل کرنے میں کوئی خیر نہیں ۔ \n<span class=urdu_sanad>سالم نے بیان کیا کہ میں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ</span> اس کے بعد رسول اللہ صلی اللہ علیہ وسلم ابی بن کعب انصاری رضی اللہ عنہ کو ساتھ لے کر اس کھجور کے باغ کی طرف روانہ ہوئے جہاں ابن صیاد رہتا تھا ۔ جب آنحضرت صلی اللہ علیہ وسلم باغ میں پہنچے تو آپ نے کھجور کی ٹہنیوں میں چھپنا شروع کیا ۔ آنحضرت صلی اللہ علیہ وسلم چاہتے تھے کہ اس سے پہلے کہ وہ دیکھے چھپ کر کسی بہانے ابن صیاد کی کوئی بات سنیں ۔ ابن صیاد ایک مخملی چادر کے بستر پر لیٹا ہوا تھا اور کچھ گنگنارہا تھا ۔ ابن صیاد کی ماں نے آنحضرت صلی اللہ علیہ وسلم کو کھجور کے تنوں سے چھپ کر آتے ہوئے دیکھ لیا اور اسے بتا دیا کہ اے صاف ! ( یہ اس کا نام تھا ) محمد آ رہے ہیں ۔ چنانچہ وہ متنبہ ہو گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اگر اس کی ماں اسے متنبہ نہ کرتی تو بات صاف ہو جاتی ۔ \n<span class=urdu_sanad>سالم نے بیان کیا کہ عبداللہ نے بیان کیاکہ</span> آنحضرت صلی اللہ علیہ وسلم لوگوں کے مجمع میں کھڑے ہوئے اور اللہ کی اس کی شان کے مطابق تعریف کرنے کے بعد آپ نے دجال کا ذکر کیا اور فرمایا کہ میں تمہیں اس سے ڈراتا ہوں ۔ کوئی نبی ایسا نہیں گزرا جس نے اپنی قوم کو اس سے نہ ڈرایا ہو ۔ نوح علیہ السلام نے اپنی قوم کو اس سے ڈرایا لیکن میں اس کی تمہیں ایک ایسی نشانی بتاؤں گا جو کسی نبی نے اپنی قوم کو نہیں بتائی ۔ تم جانتے ہو کہ وہ کانا ہو گا اور اللہ کانا نہیں ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 199,
        "matchingArabicURN": 174902,
        "last_updated": null
    },
    {
        "urduURN": 4060910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6176,
        "hadithSanad": "ہم سے عمران بن میسرہ نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، ان سے ابو التیاح یزید بن حمید نے بیان کیا ، ان سے ابوحمزہ نے اور ا ن سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "جب قبیلہ عبدالقیس کا وفد نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ مرحبا ان لوگوں کو جو آن پہنچے تو وہ ذلیل ہوئے نہ شرمندہ ( خوشی سے مسلمان ہو گئے ورنہ مارے جاتے شرمندہ ہوتے ) انہوں نے عرض کی یا رسول اللہ ! ہم قبیلہ ربیع کی شاخ سے تعلق رکھتے ہیں اور چونکہ ہمارے اور آپ کے درمیان قبیلہ مضر کے کافر لوگ حائل ہیں اس لئے ہم آپ کی خدمت میں صرف حرمت والے مہینوں ہی میں حاضر ہو سکتے ہیں ( جن میں لوٹ کھسوٹ نہیں ہوتی ) آپ کچھ ایسی جچی تلی بات بتا دیں جس پر عمل کرنے سے ہم جنت میں داخل ہو جائیں اور جو لوگ نہیں آ سکے ہیں انہیں بھی اس کی دعوت پہنچائیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ چار چار چیزیں ہیں ۔ نماز قائم کرو ، زکوٰۃ دو ، رمضان کے روزے رکھو اورغنیمت کا پانچواں حصہ ( بیت المال کو ) ادا کرو اور دباء ، حنتم ، نقیر اور مزفت میں نہ پیو ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 200,
        "matchingArabicURN": 174930,
        "last_updated": null
    },
    {
        "urduURN": 4060920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6177,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے عبیداللہ عمری نے ، ان سے نافع نے ان سے حضرت ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، عہد توڑنے والے کے لئے قیامت میں ایک جھنڈا اٹھایا جائے گا اور پکاردیا جائے گا کہ یہ فلاںبن فلاں کی دغابازی کا نشان ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 201,
        "matchingArabicURN": 174940,
        "last_updated": null
    },
    {
        "urduURN": 4060930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6178,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، ان سے امام مالک نے ، ان سے عبداللہ بن دینار نے اور ان سے حضرت ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا عہد توڑنے والے کے لئے قیامت میں ایک جھنڈا اٹھایا جائے گا اور پکارا جائے گا کہ یہ فلاں بن فلاں کی دغابازی کا نشان ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 202,
        "matchingArabicURN": 174950,
        "last_updated": null
    },
    {
        "urduURN": 4060940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6179,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، تم میں کوئی شخص یہ نہ کہے کہ میرا نفس پلید ہو گیا ہے بلکہ یہ کہے کہ میرا دل خراب یا پریشان ہو گیا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 203,
        "matchingArabicURN": 174960,
        "last_updated": null
    },
    {
        "urduURN": 4060950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6180,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا ہم کو حضرت عبداللہ بن مبارک نے خبر دی ، وہ یونس سے روایت کرتے ہیں ، وہ زہری سے ، وہ ابوامامہ بن سہل سے ، وہ اپنے باپ سے ،",
        "hadithText": "وہ نبی کریم صلی اللہ علیہ وسلم سے ، آپ نے فرمایا تم میں سے کوئی ہرگز یوں نہ کہے کہ میرا نفس پلید ہو گیا لیکن یوں کہہ سکتا ہے کہ میرا دل خراب یا پریشان ہو گیا ۔ اس حدیث کو عقیل نے بھی ابن شہاب سے روایت کیا ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 204,
        "matchingArabicURN": 174970,
        "last_updated": null
    },
    {
        "urduURN": 4060960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6181,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے یونس نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، انہیں ابوسلمہ نے خبر دی ، انہوں نے کہا کہ",
        "hadithText": "ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ فرماتا ہے کہ انسان زمانہ کو گالی دیتا ہے حالانکہ میں ہی زمانہ ہوں ، میرے ہی ہاتھ میں رات اور دن ہیں</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 205,
        "matchingArabicURN": 174980,
        "last_updated": null
    },
    {
        "urduURN": 4060970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6182,
        "hadithSanad": "ہم سے عیاش بن ولید نے بیان کیا ، کہا ہم سے عبدالاعلیٰ نے بیان کیا ، کہا ہم سے معمر نے بیان کیا ، ان سے زہری نے ، ان سے ابوسلمہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، انگور عنب کو ” کرم “ نہ کہو اور یہ نہ کہو کہ ہائے زمانہ کی نامرادی ۔ کیونکہ زمانہ تو اللہ ہی کے اختیار میں ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 206,
        "matchingArabicURN": 174990,
        "last_updated": null
    },
    {
        "urduURN": 4060980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6183,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے زہری نے بیان کیا ، ان سے سعید بن مسیب نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، لوگ ( انگور کو ) ” کرم “ کہتے ہیں ، کرم تو مومن کا دل ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 207,
        "matchingArabicURN": 175000,
        "last_updated": null
    },
    {
        "urduURN": 4060990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6184,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ قطان نے بیان کیا ، ان سے سفیان ثوری نے ، ان سے سعد بن ابراہیم نے ، ان سے عبداللہ بن شداد نے اور ان سے حضرت علی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو کسی کے لئے اپنے آپ کو قربان کرنے کا لفظ کہتے نہیں سنا ، سوا سعد بن ابی وقاص کے ۔ میں نے آنحضرت صلی اللہ علیہ وسلم سے سنا آپ فرما رہے تھے ۔ تیر مار اے سعد ! میرے ماں باپ تم پر قربان ہوں ، میرا خیال ہے کہ یہ غزوہ احد کے موقع پر فرمایا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 208,
        "matchingArabicURN": 175010,
        "last_updated": null
    },
    {
        "urduURN": 4061000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6185,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے بشر بن مفضل نے بیان کیا ، کہا ہم سے یحییٰ بن ابی اسحاق نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "وہ اور ابوطلحہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ ( مدینہ منورہ کے لئے ) روانہ ہوئے ۔ ام المؤمنین حضرت صفیہ رضی اللہ عنہا آنحضرت صلی اللہ علیہ وسلم کی سواری پر آپ کے پیچھے تھیں ، راستہ میں کسی جگہ اونٹنی کاپاؤں پھسل گیا اور آنحضرت صلی اللہ علیہ وسلم اور ام المؤمنین گر گئے ۔ انس رضی اللہ عنہ نے بیان کیا کہ میرا خیال ہے ابوطلحہ نے اپنی سواری سے فوراً اپنے کو گرا دیا اور آنحضرت صلی اللہ علیہ وسلم کی خدمت میں پہنچ گئے اور عرض کیا یا نبی اللہ ! اللہ آپ پر مجھے قربان کرے کیا آپ کو کوئی چوٹ آئی ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ، البتہ عورت کو دیکھو ۔ چنانچہ ابوطلحہ رضی اللہ عنہ نے کپڑا اپنے چہرے پر ڈال لیا ، پھر ام المؤمنین کی طرف بڑھے اور اپنا کپڑا ان کے اوپر ڈال دیا ۔ اس کے بعد وہ کھڑی ہو گئیں اور آنحضرت صلی اللہ علیہ وسلم اور ام المؤمنین کے لئے ابوطلحہ نے پالان مضبوط باندھا ۔ اب آپ نے سوار ہو کر پھر سفر شروع کیا ، جب مدینہ منورہ کے قریب پہنچے ( یا یوں کہا کہ مدینہ دکھائی دینے لگا ) تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ” ہم لوٹنے والے ہیں توبہ کرتے ہوئے اپنے رب کی عبادت کرتے ہوئے اور اس کی حمد بیان کرتے ہوئے “ آنحضرت صلی اللہ علیہ وسلم اسے برابر کہتے رہے یہاں تک کہ مدینہ میں داخل ہو گئے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 209,
        "matchingArabicURN": 175020,
        "last_updated": null
    },
    {
        "urduURN": 4061010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6186,
        "hadithSanad": "ہم سے صدقہ بن فضل نے بیان کیا ، کہا ہم کو سفیان بن عیینہ نے خبر دی ، ان سے ابن المنکدر نے بیان کیا اور ان سے حضرت جابر رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "ہم میں سے ایک صاحب کے یہاں بچہ پیدا ہوا تو انہوں نے اس کانام ” قاسم “ رکھا ۔ ہم نے ان سے کہا کہ ہم تم کو ابوالقاسم کہہ کر نہیں پکاریں گے ( کیونکہ ابوالقاسم آنحضرت صلی اللہ علیہ وسلم کی کنیت تھی ) اور نہ ہم تمہاری عزت کے لئے ایسا کریں گے ۔ ان صاحب نے اس کی خبر آنحضرت صلی اللہ علیہ وسلم کو دی ، تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اپنے بیٹے کا نام عبدالرحمٰن رکھ لے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 210,
        "matchingArabicURN": 175030,
        "last_updated": null
    },
    {
        "urduURN": 4061020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6187,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے خالد نے بیان کیا ، کہا ہم سے حصین نے بیان کیا ، ان سے سالم نے اور ان سے حضرت جابر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم میں سے ایک شخص کے یہاں بچہ پیدا ہوا تو انہوں نے اس کا نام قاسم رکھا ۔ صحابہ نے ان سے کہا کہ جب تک ہم آنحضرت صلی اللہ علیہ وسلم سے نہ پوچھ لیں ۔ ہم اس نام پر تمہاری کنیت نہیں ہونے دیں گے ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میرے نام پر نام رکھو لیکن میری کنیت نہ اختیار کرو ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 211,
        "matchingArabicURN": 175040,
        "last_updated": null
    },
    {
        "urduURN": 4061030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6188,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے محمد بن سیرین نے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا کہ",
        "hadithText": "ابوالقاسم صلی اللہ علیہ وسلم نے فرمایا میرے نام پر نام رکھو لیکن میری کنیت نہ رکھو ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 212,
        "matchingArabicURN": 175050,
        "last_updated": null
    },
    {
        "urduURN": 4061040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6189,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، کہا کہ میں نے محمد بن المنکدر سے سنا کہ کہا کہ میں نے جابر بن عبداللہ انصاری رضی اللہ عنہما سے سنا کہ",
        "hadithText": "ہم میں سے ایک آدمی کے یہاں بچہ پیدا ہو اتو انہوں نے اس کا نام قاسم رکھا ۔ صحابہ نے کہا کہ ہم تمہاری کنیت ابوالقاسم نہیں رکھیں گے اور نہ تیری آنکھ اس کنیت سے پکار کر ٹھنڈی کریں گے ۔ وہ شخص نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ سے اس کا ذکر کیا ۔ آپ نے فرمایا کہ اپنے لڑ کے کا نام عبدالرحمٰن رکھ لو ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 213,
        "matchingArabicURN": 175060,
        "last_updated": null
    },
    {
        "urduURN": 4061050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6190,
        "hadithSanad": "ہم سے اسحاق بن نصر نے بیان کیا ، انہوں نے نے کہا ہم سے عبدالرزاق نے بیان کیا ، انہوں نے کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں سعید بن مسیب نے اور انہیں ان کے والد مسیب رضی اللہ عنہ نے کہ",
        "hadithText": "ان کے والد ( حزن بن ابی وہب ) نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تمہارا نام کیا ہے ؟ انہوں نے بتایا کہ حزن ( بمعنی سختی ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم سہل ( بمعنی نرمی ) ہو ، پھر انہوں نے کہا کہ میرا نام میرے والد رکھ گئے ہیں اسے میں نہیں بدلوں گا ۔ حضرت ابن مسیب رحمہ اللہ بیان کرتے تھے کہ چنانچہ ہمارے خاندان میں بعد تک ہمیشہ سختی اور مصیبت کا دور رہا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 214,
        "matchingArabicURN": 175071,
        "last_updated": null
    },
    {
        "urduURN": 4061060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6191,
        "hadithSanad": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم سے ابو غسان نے بیان کیا ، کہا کہ مجھ سے ابوحازم نے بیان کیا اور ان سے سہل رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "منذر بن ابی اسید رضی اللہ عنہ کی ولادت ہوئی تو انہیں نبی کریم صلی اللہ علیہ وسلم کے پاس لایا گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے بچہ کو اپنی ران پر رکھ لیا ۔ ابواسید رضی اللہ عنہ بیٹھے ہوئے تھے ۔ حضور اکرم صلی اللہ علیہ وسلم کسی چیز میں جو سامنے تھی مصروف ہو گئے ( اور بچہ کی طرف توجہ ہٹ گئی ) ابواسید رضی اللہ عنہ نے بچہ کے متعلق حکم دیا اور آنحضرت صلی اللہ علیہ وسلم کی ران سے ا ٹھا لیا گیا ۔ پھر جب آنحضرت صلی اللہ علیہ وسلم متوجہ ہوئے تو فرمایا ، بچہ کہاں ہے ؟ ابواسید رضی اللہ عنہ نے عرض کیا ، یا رسول اللہ ! ہم نے اسے گھر بھیج دیا ۔ آنحضرت صلی اللہ علیہ وسلم نے پوچھا ۔ اس کانام کیا ہے ؟ عرض کیا کہ فلاں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، بلکہ اس کا نام ” منذر “ ہے ۔ چنانچہ اسی دن آنحضور صلی اللہ علیہ وسلم نے ان کا یہی نام منذر رکھا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 215,
        "matchingArabicURN": 175090,
        "last_updated": null
    },
    {
        "urduURN": 4061070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6192,
        "hadithSanad": "ہم سے صدقہ بن فضل نے بیان کیا ، انہوں نے کہا ہم کو محمد بن جعفر نے خبر دی ، انہیں شعبہ نے ، انہیں عطاء بن ابی میمونہ نے ، انہیں ابورافع نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "ام المؤمنین زینب رضی اللہ عنہا کا نام ” برہ “ تھا ، کہا جانے لگا کہ وہ اپنی پاکی ظاہر کرتی ہیں ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم نے ان کا نام زینب رکھا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 216,
        "matchingArabicURN": 175100,
        "last_updated": null
    },
    {
        "urduURN": 4061080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6193,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا ہم سے ہشام بن یوسف نے بیان کیا ، انہیں ابن جریج نے خبر دی ، کہا مجھ کو عبدالحمید بن جبیر بن شیبہ نے خبر دی ، کہا کہ",
        "hadithText": "میں سعید بن مسیب کے پاس بیٹھا ہوا تھا تو انہوں نے مجھ سے بیان کیا کہ ان کے دادا ” حزن “ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو آنحضر ت صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تمہارا نام کیا ہے ؟ انہوں نے کہا کہ میرانام ” حزن “ ہے ۔ آنحضرت صلی اللہ علیہی وسلم نے فرمایا کہ تم ” سہل “ ہو ، انہوں نے کہا کہ میں تو اپنے باپ کا رکھا ہوا نام نہیں بدلوں گا ۔ سعید بن مسیب نے کہا اس کے بعد سے اب تک ہمارے خاندان میں سختی اورمصیبت ہی رہی ۔ حزونۃ سے صعوبت مراد ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 217,
        "matchingArabicURN": 175110,
        "last_updated": null
    },
    {
        "urduURN": 4061090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6194,
        "hadithSanad": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا ، کہا ہم سے محمدبن بشر نے ، ان سے اسماعیل بن ابی خالد بجلی نے ، کہ",
        "hadithText": "میں نے ابن ابی اوفی ٰ سے پوچھا ۔ تم نے نبی کریم صلی اللہ علیہ وسلم کے صاحبزادے ابراہیم کو دیکھا تھا ؟ بیان کیا کہ ان کی وفات بچپن ہی میں ہو گئی تھی اور اگر آنحضرت صلی اللہ علیہ وسلم کے بعد کسی نبی کی آمد ہوتی تو آنحضرت صلی اللہ علیہ وسلم کے صاحبزادے زندہ رہتے لیکن آنحضرت صلی اللہ علیہ وسلم کے بعد کوئی نبی نہیں آئے گا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 218,
        "matchingArabicURN": 175120,
        "last_updated": null
    },
    {
        "urduURN": 4061100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6195,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم کو شعبہ نے خبر دی ، انہیں عدی بن ثابت نے کہا کہ میں نے حضرت براء رضی اللہ عنہ سے سنا ۔ بیان کیا کہ",
        "hadithText": "جب آپ کے فرزند ابراہیم علیہ السلام کا انتقال ہوا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اس کے لئے جنت میں ایک دودھ پلانے والی دایہ مقرر ہو گئی ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 219,
        "matchingArabicURN": 175130,
        "last_updated": null
    },
    {
        "urduURN": 4061110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6196,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے حصین بن عبدالرحمٰن نے ، ان سے سالم بن ابی الجعد نے اور ان سے جریر بن عبداللہ انصاری نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا میرے نام پر نام رکھو ، لیکن میری کنیت نہ اختیار کرو کیونکہ میں قاسم ( تقسیم کرنے والا ) ہوں اور تمہارے درمیان ( علوم دین کو ) تقسیم کرتا ہوں ۔ اور اس روایت کو انس رضی اللہ عنہ نے بھی نبی کریم صلی اللہ علیہ وسلم سے نقل کیا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 220,
        "matchingArabicURN": 175140,
        "last_updated": null
    },
    {
        "urduURN": 4061120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6197,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے ابوعوانہ نے بیان کیا ، انہوں نے کہا ہم سے ابو حصین نے بیان کیا ، ان سے ابوصالح نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا تم میرے نام پر نام رکھو لیکن تم میری کنیت نہ اختیار کرو اور جس نے مجھے خواب میں دیکھا تو اس نے مجھے ہی دیکھا کیونکہ شیطان میری صورت میں نہیں آ سکتا اور جس نے قصداً میری طرف کوئی جھوٹ بات منسوب کی اس نے اپنا ٹھکانا جہنم میں بنا لیا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 221,
        "matchingArabicURN": 175150,
        "last_updated": null
    },
    {
        "urduURN": 4061130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6198,
        "hadithSanad": "ہم سے محمد علاء نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے برید بن عبداللہ بن ابی بردہ نے ، ان سے ابوبردہ نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "میرے یہاں ایک بچہ پیدا ہوا تو میں اسے لے کر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ آنحضرت صلی اللہ علیہ وسلم نے اس کا نام ابراہیم رکھا اور ایک کھجور اپنے د ہان مبارک میں نرم کر کے اس کے منہ میں ڈالی اور اس کے لئے برکت کی دعا کی ۔ پھر اسے مجھے دے دیا ۔ یہ ابوموسیٰ کی بڑی اولاد تھی ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 222,
        "matchingArabicURN": 175160,
        "last_updated": null
    },
    {
        "urduURN": 4061140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6199,
        "hadithSanad": "ہم سے ابو الولید نے بیان کیا ، کہا ہم سے زائدہ نے ، کہا ہم سے زیاد بن علاقہ نے ، کہا ہم نے مغیرہ بن شعبہ رضی اللہ عنہ سے سنا ، بیان کیا کہ",
        "hadithText": "جس دن حضرت ابراہیم رضی اللہ عنہ کی وفات ہوئی اس دن سورج گرہن ہوا تھا ۔ اس کو ابو بکرہ نے بھی نبی کریم صلی اللہ علیہ وسلم سے روایت کیا ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 223,
        "matchingArabicURN": 175170,
        "last_updated": null
    },
    {
        "urduURN": 4061150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6200,
        "hadithSanad": "ہم سے ابونعیم فضل بن دکین نے خبر دی ، انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے زہری نے بیان کیا ، ان سے سعید نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم نے سرمبارک رکوع سے اٹھایا تو یہ دعا کی ۔ ” اے اللہ ! ولید بن ولید ، سلمہ بن ہشام ، عیاش بن ابی ربیعہ اور مکہ میں دیگر موجود کمزور مسلمانوں کو نجات دیدے ۔ اے اللہ ! قبیلہ مضر کے کفاروں کوسخت پکڑ ۔ اے اللہ ! ان پر یوسف علیہ السلام کے زمانہ جیسا قحط نازل فرما ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 224,
        "matchingArabicURN": 175180,
        "last_updated": null
    },
    {
        "urduURN": 4061160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6201,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہوں نے کہا کہ مجھ سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا یاعائش ! یہ جبرائیل علیہ السلام ہیں اور تمہیں سلام کہتے ہیں ۔ میں نے کہا اور ان پر بھی سلام اور اللہ کی رحمت ہو ۔ بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم وہ چیزیں دیکھتے تھے جو ہم نہیں دیکھتے تھے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 225,
        "matchingArabicURN": 175190,
        "last_updated": null
    },
    {
        "urduURN": 4061170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6202,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے وہیب نے بیان کیا ، کہا ہم سے ایوب نے بیان کیا ، ان سے ابوقلابہ نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "حضرت ام سلیم رضی اللہ عنہا مسافروں کے سامان کے ساتھ تھیں اور نبی کریم صلی اللہ علیہ وسلم کے غلام انجشہ عورتوں کے اونٹ کو ہانک رہے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا انجش ! ذرا اس طرح آہستگی سے لے چل جیسے شیشوں کو لے کر جاتا ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 226,
        "matchingArabicURN": 175200,
        "last_updated": null
    },
    {
        "urduURN": 4061180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6203,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، ان سے ابو التیاح نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم حسن اخلاق میں سب لوگوں سے بڑھ کر تھے ، میرا ایک بھائی ابو عمیر نامی تھا ۔ بیان کیا کہ میرا خیال ہے کہ بچہ کا دودھ چھوٹ چکا تھا ۔ آنحضرت صلی اللہ علیہ وسلم جب تشریف لاتے تو اس سے مزاحاً فرماتے یا ابا عمیر مافعل النغیر اکثر ایسا ہوتا کہ نماز کا وقت ہو جاتا اور آنحضرت صلی اللہ علیہ وسلم ہمارے گھر میں ہوتے ۔ آپ اس بستر کو بچھانے کا حکم دیتے جس پر آپ بیٹھے ہوئے ہوتے ، چنانچہ اسے جھاڑ کر اس پر پانی چھڑک دیا جاتا ۔ پھر آپ کھڑے ہوتے اور ہم آپ کے پیچھے کھڑے ہوتے اور آپ ہمیں نماز پڑھاتے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 227,
        "matchingArabicURN": 175210,
        "last_updated": null
    },
    {
        "urduURN": 4061190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6204,
        "hadithSanad": "ہم سے خالد بن مخلد نے بیان کیا ، انہوں نے کہا ہم سے سلیمان نے بیان کیا ، انہوں نے کہا کہ مجھے ابوحازم نے بیان کیا ، ان سے سہل بن سعد نے کہ",
        "hadithText": "حضرت علی رضی اللہ عنہ کو ان کی کنیت ” ابوتراب “ سب سے زیادہ پیاری تھی اور اس کنیت سے انہیں پکارا جاتا تو بہت خوش ہوتے تھے کیونکہ یہ کنیت ابوتراب خود رسول کریم صلی اللہ علیہ وسلم نے رکھی تھی ۔ ایک دن حضرت فاطمہ رضی اللہ عنہا سے خفا ہو کر وہ باہر چلے آئے اور مسجد کی دیوار کے پاس لیٹ گئے ۔ آنحضرت صلی اللہ علیہ وسلم ان کے پیچھے آئے اور فرمایا کہ یہ تو دیوار کے پاس لیٹے ہوئے ہیں ۔ جب آنحضرت صلی اللہ علیہ وسلم تشریف لائے تو حضرت علی رضی اللہ عنہ کی پیٹھ مٹی سے بھر چکی تھی ۔ آنحضرت صلی اللہ علیہ وسلم ان کی پیٹھ سے مٹی جھاڑتے ہوئے ( پیار سے ) فرمانے لگے ” ابوتراب “ اٹھ جاؤ ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 228,
        "matchingArabicURN": 175220,
        "last_updated": null
    },
    {
        "urduURN": 4061200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6205,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، کہا ہم سے ابوالزناد نے بیان کیا ، ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا قیامت کے دن اللہ کے نزدیک سب سے بدترین نام اس کا ہو گا جو اپنا نام ملک الاملاک ( شہنشاہ ) رکھے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 229,
        "matchingArabicURN": 175230,
        "last_updated": null
    },
    {
        "urduURN": 4061210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6206,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ابوالزناد نے ، ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے وہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ",
        "hadithText": "اللہ کے نزدیک سب سے بدترین نام ۔ اور کبھی سفیان نے ایک سے زیادہ مرتبہ یہ روایت اس طرح بیان کیا کہ اللہ کے نزدیک سب سے بدترین ناموں ( جمع کے صیغے کے ساتھ ) میں اس کا نام ہو گا جو ” ملک الاملاک “ اپنا نام رکھے گا ۔ سفیان نے بیان کیا کہ ابوالزناد کے غیر نے کہا کہ اس کا مفہوم ہے ” شاہان شاہ “ ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 230,
        "matchingArabicURN": 175240,
        "last_updated": null
    },
    {
        "urduURN": 4061220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6207,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ( دوسری سند ) اور ہم سے اسماعیل بن ابی اویس نے بیان کیا ، انہوں نے کہا کہ مجھ سے میرے بھائی عبدالحمید نے بیان کیا ، ان سے سلیمان نے بیان کیا ، ان سے محمد بن ابی عتیق نے بیان کیا ، ان سے ابن ابی شہاب نے بیان کیا ، ان سے عروہ بن زبیر نے اور انہیں اسامہ بن زید رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم ایک گدھے پر سوار ہوئے جس پر فدک کا بنا ہوا ایک کپڑا بچھا ہوا تھا ، اسامہ آپ کے پیچھے سوار تھے ۔ آنحضرت صلی اللہ علیہ وسلم بنی حارث بن خزرج میں سعد بن عبادہ رضی اللہ عنہ کی عیادت کے لئے تشریف لے جا رہے تھے ، یہ واقعہ غزوہ بدر سے پہلے کا ہے یہ دونوں روانہ ہوئے اور راستے میں ایک مجلس سے گزرے جس میں عبداللہ بن ابی ابن سلول بھی تھا ۔ عبداللہ نے ابھی تک اپنے اسلام کا اعلان نہیں کیا تھا ۔ اس مجلس میں کچھ مسلمان بھی تھے ۔ بتوں کی پرستش کرنے والے کچھ مشرکین بھی تھے اور کچھ یہودی بھی تھے ۔ مسلمان شرکاء میں عبداللہ بن رواحہ بھی تھے ۔ جب مجلس پر ( آنحضور صلی اللہ علیہ وسلم کی ) سواری کا غبار اڑ کر پڑا تو عبداللہ بن ابی نے اپنی چادر ناک پر رکھ لی اور کہنے لگا کہ ہم پر غبار نہ اڑاؤ ، اس کے بعد حضور صلی اللہ علیہ وسلم نے ( قریب پہنچنے کے بعد ) انہیں سلام کیا اور کھڑے ہو گئے ۔ پھر سواری سے اتر کر انہیں اللہ کی طرف بلایا اور قران مجید کی آیتیں انہیں پڑھ کر سنائیں ۔ اس پر عبداللہ بن ابی ابن سلول نے کہا کہ بھلے آدمی جو کلام تم نے پڑھا اس سے بہتر کلام نہیں ہو سکتا ۔ اگرچہ واقعی یہ حق ہے مگر ہماری مجلسوں میں آ کر اس کی وجہ سے ہمیں تکلیف نہ دیا کرو ۔ جو تمہارے پاس جائے بس اس کو یہ قصے سنا دیا کرو ۔ عبداللہ بن رواحہ رضی اللہ عنہ نے عرض کیا ضرور یا رسول اللہ ! آپ ہماری مجلسوں میں بھی تشریف لایا کریں کیونکہ ہم اسے پسند کرتے ہیں ۔ اس معاملہ پر مسلمانوں ، مشرکوں اور یہودیوں کا جھگڑا ہو گیا اور قریب تھا کہ ایک دوسرے کے خلاف ہاتھ اٹھا دیں ۔ لیکن آنحضرت صلی اللہ علیہ وسلم انہیں خاموش کرتے رہے آخر جب سب لوگ خاموش ہو گئے تو آنحضرت صلی اللہ علیہ وسلم اپنی سواری پر بیٹھے اور روانہ ہوئے ۔ جب سعد بن عبادہ کے یہاں پہنچے تو ان سے فرمایا کہ اے سعد ! تم نے نہیں سنا آج ابو حباب نے کس طرح باتیں کی ہیں ۔ آپ کا اشارہ عبداللہ بن ابی کی طرف تھا کہ اس نے یہ باتیں کہی ہیں سعد بن عبادہ رضی اللہ عنہ بولے ، میرا باپ آپ پر صدقے ہوا یا رسول اللہ ! آپ اسے معاف فرما دیں اور اس سے در گذر فرمائیں ، اس ذات کی قسم جس نے آپ پر کتاب نازل کی ہے اللہ نے آپ کو سچا کلام دے کر یہاں بھیجا جو آپ پر اتارا ۔ آپ کے تشریف لانے سے پہلے اس شہر ( مدینہ منورہ ) کے باشندے اس پر متفق ہو گئے تھے کہ اسے ( عبداللہ بن ابی کو ) شاہی تاج پہنادیں اور شاہی عمامہ باندھ دیں لیکن اللہ نے سچا کلام دے کر آپ کو یہاں بھیج دیا اور یہ تجویز موقوف رہی تو وہ اس کی وجہ سے چڑ گیا اور جو کچھ آپ نے آج ملاحظہ کیا ، وہ اسی جلن کی وجہ سے ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے عبداللہ بن ابی کو معاف کر دیا ۔ آنحضرت صلی اللہ علیہ وسلم اور آپ کے صحابہ مشرکین اور اہل کتاب سے جیسا کہ انہیں اللہ تعالیٰ نے حکم دیا تھا ۔ درگزر کیا کرتے تھے اور ان کی طرف سے پہنچنے والی تکلیفوں پر صبر کیا کرتے تھے ، اللہ تعالیٰ نے بھی ارشاد فرمایا ہے کہ ” تم ان لوگوں سے جنہیں کتاب دی گئی ہے ( اذیت دہ باتیں ) سنو گے “ دوسرے موقع پر ارشاد فرمایا بہت سے اہل کتاب خواہش رکھتے ہیں الخ ۔ چنانچہ حضور اکرم صلی اللہ علیہ وسلم انہیں معاف کرنے کے لئے اللہ کے حکم کے مطابق توجیہ کیا کرتے تھے ۔ بالآخر آپ کو ( جنگ کی ) اجازت دی گئی ۔ جب آنحضرت صلی اللہ علیہ وسلم نے غزوہ بدر کیا اور اللہ کے حکم سے اس میں کفار کے بڑے بڑے بہادر اور قریش کے سردار قتل کئے گئے تو آنحضرت صلی اللہ علیہ وسلم اپنے صحابہ کے ساتھ فتح مند اورغنیمت کا مال لئے ہوئے واپس ہوئے ، ان کے ساتھ کفار قریش کے کتنے ہی بہادر سردار قید بھی کر کے لائے تو اس وقت عبداللہ بن ابی بن سلول اور اس کے بت پرست مشرک ساتھی کہنے لگے کہ اب ان کا کام جم گیا تو آنحضرت صلی اللہ علیہ وسلم سے بیعت کر لو ، اس وقت انہوں نے اسلام پر بیعت کی اور بظاہر مسلمان ہو گئے ( مگر دل میں نفاق رہا )</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 231,
        "matchingArabicURN": 175250,
        "last_updated": null
    },
    {
        "urduURN": 4061230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6208,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ابو عوانہ نے بیان کیا ، کہا ہم سے عبدالملک نے بیان کیا ، ان سے عبداللہ بن حارث بن نوفل نے اور ان سے حضرت عباس بن عبدالمطلب رضی اللہ عنہ نے کہ",
        "hadithText": "انہوں نے عرض کیا کہ یا رسول اللہ ! آپ نے جناب ابوطالب کو ان کی وفات کے بعد کوئی فائدہ پہنچایا ، وہ آپ کی حفاظت کیا کرتے تھے اور آپ کے لئے لوگوں پر غصہ ہوا کرتے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں وہ دوزخ میں اس جگہ پر ہیں جہاں ٹخنوں تک آگ ہے اگر میں نہ ہوتا تو وہ دوزخ کے نیچے کے طبقے میں رہتے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 232,
        "matchingArabicURN": 175260,
        "last_updated": null
    },
    {
        "urduURN": 4061240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6209,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے ، ان سے ثابت بنانی نے ، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ایک سفر میں تھے ، راستہ میں حدی خواں نے حدی پڑھی تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا اے انجشہ ! شیشوں کو آہستہ آہستہ لے کر چل ، تجھ پر افسوس ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 233,
        "matchingArabicURN": 175270,
        "last_updated": null
    },
    {
        "urduURN": 4061250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6210,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، انہوں نے کہا ہم سے حماد نے بیان کیا ، ان سے ثابت بنانی نے بیان کیا ، ان سے انس وایوب نے ، ان سے ابوقلابہ نے اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ایک سفر میں تھے ۔ انجشہ نامی غلام عورتوں کی سواریوں کو حدی پڑھتا لے کر چل رہا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے اس سے فرمایا ، انجشہ ! شیشوں کو آہستہ لے چل ۔ ابوقلابہ نے بیان کیا کہ مراد عورتیں تھیں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 234,
        "matchingArabicURN": 175280,
        "last_updated": null
    },
    {
        "urduURN": 4061260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6211,
        "hadithSanad": "ہم سے اسحاق نے بیان کیا ، کہا ہم کو حبان نے خبر دی ، کہا ہم سے ہمام نے بیان کیا ، ان سے قتادہ نے بیان کیا ، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے ایک حدی خواں تھے انجشہ نامی تھے ان کی آواز بڑی اچھی تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا ، انجشہ آہستہ چال اختیار کر ۔ ان شیشوں کو مت توڑ ۔ قتادہ نے بیان کیا کہ مراد کمزور عورتیں تھیں ۔ ( کہ سواری سے گر نہ جائیں ۔ )</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 235,
        "matchingArabicURN": 175290,
        "last_updated": null
    },
    {
        "urduURN": 4061270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6212,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے شعبہ نے ، ان سے قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "مدینہ منورہ پر ( ایک رات نامعلوم آواز کی وجہ سے ) ڈرطاری ہو گیا ۔ چنانچہ رسول اللہ صلی اللہ علیہ وسلم ابوطلحہ کے ایک گھوڑے پر سوار ہوئے ۔ پھر ( واپس آ کر ) فرمایا ہمیں تو کوئی ( خوف کی ) چیز نظر نہ آئی ۔ البتہ یہ گھوڑا تو گویا دریا تھا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 236,
        "matchingArabicURN": 175300,
        "last_updated": null
    },
    {
        "urduURN": 4061280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6213,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو مخلد بن یزید نے خبر دی ، کہا ہم کو ابن جریج نے خبر دی کہ ابن شہاب نے بیان کیا کہ مجھ کو یحییٰ بن عروہ نے خبر دی ، انہوں نے عروہ سے سنا ، کہا کہ عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "کچھ لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے کاہنوں کے بارے میں پوچھا ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ ان کی ( پیشین گوئیوں کی ) کوئی حیثیت نہیں ۔ صحابہ نے عرض کیا یا رسول اللہ ! لیکن وہ بعض اوقات ایسی باتیں کرتے ہیں جو صحیح ثابت ہوتی ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ وہ بات سچی بات ہوتی ہے جسے جن فرشتوں سے سن کر اڑا لیتا ہے اور پھر اسے اپنے ولی ( کاہن ) کے کان میں مرغ کی آواز کی طرح ڈالتا ہے ۔ اس کے بعد کاہن اس ( ایک سچی بات میں ) سو سے زیادہ جھوٹ ملا دیتے ہیں ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 237,
        "matchingArabicURN": 175310,
        "last_updated": null
    },
    {
        "urduURN": 4061290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6214,
        "hadithSanad": "ہم سے ابن بکیر نے بیان کیا ، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے کہ میں نے ابوسلمہ بن عبدالرحمٰن سے سنا ، وہ بیان کرتے تھے کہ",
        "hadithText": "مجھے جابر بن عبداللہ نے خبر دی ، انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر میرے پاس وحی آنے کا سلسلہ بند ہو گیا ۔ ایک دن میں چل رہا تھا کہ میں نے آسمان کی طرف سے ایک آواز سنی ، میں نے آسمان کی طرف نظر اٹھائی تو میں نے پھر اس فرشتہ کو دیکھا جو میرے پاس غار حرا میں آیا تھا ۔ وہ آسمان و زمین کے درمیان کرسی پر بیٹھا ہوا تھا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 238,
        "matchingArabicURN": 175320,
        "last_updated": null
    },
    {
        "urduURN": 4061300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6215,
        "hadithSanad": "ہم سے ابن ابی مریم نے بیان کیا ، کہا ہم سے محمد بن جعفرنے بیان کیا ، کہا کہ مجھے شریک نے خبر دی ، انہیں کریب نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نے ایک رات میمونہ ( خالہ ) کے گھر گزاری ، نبی کریم صلی اللہ علیہ وسلم بھی اس رات وہیں ٹھہرے ہوئے تھے ۔ جب رات کا آخری تہائی حصہ ہوا یا اس کا بعض حصہ رہ گیا تو آنحضرت صلی اللہ علیہ وسلم اٹھ بیٹھے اورآسمان کی طرف دیکھا پھر اس آیت کی تلاوت کی ۔ ” بلاشبہ آسمان کی اور زمین کی پیدائش میں اور دن رات کے بدلتے رہنے میں عقل والوں کے لئے نشانیاں ہیں ۔ “</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 239,
        "matchingArabicURN": 175330,
        "last_updated": null
    },
    {
        "urduURN": 4061310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6216,
        "hadithSanad": "ہم سے مسدد نے کہا ، کہا ہم سے یحییٰ قطان نے بیان کیا ، ان سے عثمان بن غیاث نے ، کہا ہم سے ابوعثمان نہدی نے بیان کیا اور ان سے ابوموسیٰ اشعری نے کہ",
        "hadithText": "وہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ مدینہ کے باغوں میں سے ایک باغ میں تھے ۔ آنحضرت صلی اللہ علیہ وسلم کے ہاتھ میں ایک لکڑی تھی ، آپ اس کو پانی اور کیچڑ میں مار رہے تھے ۔ اس دوران میں ایک صاحب نے باغ کا دروازہ کھلوانا چاہا ۔ آنحضرت صلی اللہ علیہ وسلم نے مجھ سے فرمایا کہ اس کے لئے دروازہ کھول دے اور انہیں جنت کی خوشخبری سنا دے ۔ میں گیا تو وہاں حضرت ابوبکر رضی اللہ عنہ موجود تھے ، میں نے ان کے لئے دروازہ کھولا اور انہیں جنت کی خوشخبری سنائی پھر ایک اور صاحب نے دروازہ کھلوایا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ دروازہ کھول دے اور انہیں جنت کی خوشخبری سنا دے اس مرتبہ حضرت عمر رضی اللہ عنہ تھے ۔ میں نے ان کے لئے بھی دروازہ کھولا اور انہیں بھی جنت کی خوشخبری سنا دی ۔ پھر ایک تیسرے صاحب نے دروازہ کھلوایا ۔ آنحضرت صلی اللہ علیہ وسلم اس وقت ٹیک لگائے ہوئے تھے اب سیدھے بیٹھ گئے ۔ پھر فرمایا دروازہ کھول دے اور جنت کی خوشخبری سنا دے ، ان آزمائشوں کے ساتھ جس سے ( دنیا میں ) انہیں دوچار ہونا پڑے گا ۔ میں گیا تو وہاں حضرت عثمان رضی اللہ عنہ تھے ۔ ان کے لیے بھی میں نے دروازہ کھولا اور انہیں جنت کی خوشخبری سنائی اور وہ بات بھی بتادی جو آنحضرت صلی اللہ علیہ وسلم نے فرمائی تھی ۔ عثمان رضی اللہ عنہ نے کہا خیر اللہ مددگار ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 240,
        "matchingArabicURN": 175340,
        "last_updated": null
    },
    {
        "urduURN": 4061320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6217,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا کہا ہم سے ابن ابی عدی نے بیان کیا ، ان سے شعبہ نے ، ان سے سلیمان ومنصور نے ، ان سے سعد بن عبیدہ نے ان سے ابوعبدالرحمن سلمی نے اور ان سے حضرت علی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک جنازہ میں شریک تھے ۔ آنحضرت صلی اللہ علیہ وسلم کے ہاتھ میں ایک چھڑی تھی اس کو آپ زمین پر مار رہے تھے پھر آپ نے فرمایا تم میں کوئی ایسا نہیں ہے جس کا جنت یا دوزخ کا ٹھکانا طے نہ ہو چکا ہو ۔ صحابہ نے عرض کیا ، پھر کیوں نہ ہم اس پر بھروسہ کر لیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، عمل کرتے رہو کیونکہ ہر شخص جس ٹھکانے کے لیے پیدا کیا گیا ہے اس کو ویسی ہی توفیق دی جائے گی ۔ جیسا کہ قرآن شریف کے سورۃ واللیل میں ہے کہ جس نے للہ خیرات کی اور اللہ تعالیٰ سے ڈر ا ، آخر تک ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 241,
        "matchingArabicURN": 175350,
        "last_updated": null
    },
    {
        "urduURN": 4061330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6218,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ، ان سے ہند بن حارث نے بیان کیا کہ ام سلمہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ( رات میں ) بیدار ہوئے اور فرمایا ، سبحان اللہ ! اللہ کی رحمت کے کتنے خزانے آج نازل کئے گئے ہیں اور کس طرح کے فتنے بھی اتارے گئے ہیں ۔ کون ہے ! جو ان حجرہ والیوں کو جگائے ۔ آنحضرت صلی اللہ علیہ وسلم کی مراد ازواج مطہرات سے تھی تاکہ وہ نماز پڑھ لیں کیونکہ بہت سی دنیا میں کپڑے پہننے والیاں آخرت میں ننگی ہوں گی ۔ اور ابن ابی ثور نے بیان کیا ، ان سے حضرت ابن عباس رضی اللہ عنہما نے اور ان سے حضرت عمر رضی اللہ عنہ نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا ، کیا آپ نے ازواج مطہرات کو طلاق دے دی ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ۔ میں نے کہااللہ اکبر !</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 242,
        "matchingArabicURN": 175361,
        "last_updated": null
    },
    {
        "urduURN": 4061340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6219,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ( دوسری سند ) اور ہم سے اسماعیل بن ابی اویس نے بیان کیا ، انہوں نے کہا کہ مجھ سے میرے بھائی عبدالحمید نے بیان کیا ، ان سے سلیمان نے بیان کیا ، ان سے محمد بن ابی عتیق نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے امام زین العابدین علی بن حسین نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت صفیہ بنت حی رضی اللہ عنہا نے انہیں خبر دی کہ وہ آنحضرت صلی اللہ علیہ وسلم کے پاس ملنے آئیں ۔ آنحضرت صلی اللہ علیہ وسلم اس وقت مسجد میں رمضان کے آخری عشرہ میں اعتکاف کئے ہوئے تھے ۔ عشاء کے وقت تھوڑی دیر انہوں نے نے آنحضرت صلی اللہ علیہ وسلم سے باتیں کیں اورواپس لوٹنے کے لئے اٹھیں تو آنحضرت صلی اللہ علیہ وسلم بھی انہیں چھوڑآنے کے لئے کھڑے ہو گئے ۔ جب وہ مسجد کے اس دروازہ کے پاس پہنچیں جہاں آنحضرت صلی اللہ علیہ وسلم کی زوجہ مطہرہ ام سلمہ رضی اللہ عنہا کا حجرہ تھا ، تو ادھر سے دو انصاری صحابی گزرے اور آنحضرت صلی اللہ علیہ وسلم کو سلام کیا اور آگے بڑھ گئے ۔ لیکن آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ تھوڑی دیر کے لئے ٹھہر جاؤ ۔ یہ صفیہ بنت حی رضی اللہ عنہا میری بیوی ہیں ۔ ان دونوں صحابہ نے عرض کیا ۔ سبحان اللہ ، یا رسول اللہ ۔ ان پر بڑا شاق گزرا ۔ لیکن آپ نے فرمایا کہ شیطان انسان کے اندر خون کی طرح دوڑتا رہتا ہے ، اس لئے مجھے خوف ہوا کہ کہیں وہ تمہارے دل میں کوئی شبہ نہ ڈال دے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 243,
        "matchingArabicURN": 175380,
        "last_updated": null
    },
    {
        "urduURN": 4061350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6220,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے ، انہوں نے عقبہ بن صہبان ازدی سے سنا ، وہ عبداللہ بن مغفل مزنی سے نقل کرتے تھے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے کنکری پھینکنے سے منع کیا تھا اور فرمایا تھا کہ وہ نہ شکار مار سکتی ہے اور نہ دشمن کو کوئی نقصان پہنچا سکتی ہے ، البتہ آنکھ پھوڑ سکتی ہے اور دانت توڑ سکتی ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 244,
        "matchingArabicURN": 175390,
        "last_updated": null
    },
    {
        "urduURN": 4061360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6221,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے پاس دو اصحاب چھینکے ۔ آنحضرت صلی اللہ علیہ وسلم نے ایک کا جواب یرحمک اللہ ( اللہ تم پر رحم کرے ) سے دیا اور دوسرے کا نہیں ۔ آنحضرت صلی اللہ علیہ وسلم سے اس کی وجہ پوچھی گئی تو فرمایا کہ اس نے الحمدللہ کہا تھا ( اس لئے اس کا جواب دیا ) اور دوسرے نے الحمدللہ نہیں کہا تھا ۔ چھینکنے والے کو الحمدللہ ضرور کہنا چاہئے اور سننے والوں کویرحمک اللہ ۔ ( سے جواب دینا اسلامی تہذیب ہے )</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 245,
        "matchingArabicURN": 175400,
        "last_updated": null
    },
    {
        "urduURN": 4061370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6222,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے اشعث بن سلیم نے کہ میں نے معاویہ بن سوید بن مقرن سے سنا اور ان سے حضرت براء رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہمیں نبی کریم صلی اللہ علیہ وسلم نے سات باتوں کا حکم دیا تھا اور سات کاموں سے روکا تھا ، ہمیں آنحضرت صلی اللہ علیہ وسلم نے بیمار کی مزاج پرسی کرنے ، جنازہ کے پیچھے چلنے ، چھینکنے والے کے جواب دینے ، دعوت کرنے والے کی دعوت قبول کرنے ، سلام کا جواب دینے ، مظلوم کی مدد کرنے اور قسم کھا لینے والے کی قسم پوری کرنے میں مدد دینے کا حکم دیا تھا اور آنحضرت صلی اللہ علیہ وسلم نے ہمیں سات کاموں سے روکا تھا ، سونے کی انگوٹھی سے ، یا بیان کیا کہ سونے کے چھلے سے ، ریشم اوردیبا اور سندس ( دیبا سے باریک ریشمی کپڑا ) پہننے سے اور ریشمی زین سے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 246,
        "matchingArabicURN": 175410,
        "last_updated": null
    },
    {
        "urduURN": 4061380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6223,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انہوں نے کہا ہم سے ابن ابی ذئب نے بیان کیا ، ان سے سعید مقبری نے بیان کیا ، ان سے ان کے والد نے ، ان سے حضرت ابوہریرہ رضی اللہ عنہ نے",
        "hadithText": "اور ان سے نبی کریم صلی اللہ علیہ وسلم نے ( فرمایا کہ ) اللہ تعالیٰ چھینک کو پسند کرتا ہے اور جمائی کو ناپسند کرتا ہے ۔ اس لئے جب تم میں سے کوئی شخص چھینکے اور الحمدللہ کہے تو ہر مسلمان پر جو اسے سنے ، حق ہے کہ اس کاجواب یرحمک اللہ سے دے ۔ لیکن جمائی شیطان کی طرف سے ہوتی ہے اس لئے جہاں تک ہو سکے اسے روکے کیونکہ جب وہ منہ کھول کر ہاہاہا کہتا ہے تو شیطان اس پر ہنستا ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 247,
        "matchingArabicURN": 175420,
        "last_updated": null
    },
    {
        "urduURN": 4061390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6224,
        "hadithSanad": "ہم سے مالک بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے عبدالعزیز بن ابی سلمہ نے بیان کیا ، انہیں عبداللہ بن دینار نے خبر دی ، وہ ابوصالح سے اور وہ حضرت ابوہریرہ رضی اللہ عنہ سے روایت کرتے ہیں کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب تم میں سے کوئی چھینکے تو الحمدللہ کہے اور اس کا بھائی یا اس کا ساتھی ( راوی کو شبہ تھا ) ” یرحمک اللہ “ کہے ۔ جب ساتھی یرحمک اللہ کہے تو اس کے جواب میں چھینکنے والا ” یھدیکم اللہ ویصلح بالکم “</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 248,
        "matchingArabicURN": 175430,
        "last_updated": null
    },
    {
        "urduURN": 4061400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6225,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے سلیمان تیمی نے بیان کیا ، کہا کہ میں نے حضرت انس رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی موجودگی میں دو آدمیوں نے چھینکا ۔ لیکن آنحضرت صلی اللہ علیہ وسلم نے ان میں سے ایک کی چھینک پر یرحمک اللہ کہا اور دوسرے کی چھینک پر نہیں کہا ۔ اس پر دوسرا شخص بولا کہ یا رسول اللہ ، آپ نے ان کی چھینک پر یرحمک اللہ فرمایا ۔ لیکن میری چھینک پر نہیں فرمایا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ انہوں نے الحمدللہ کہا تھا اور تم نے نہیں کہا تھا ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 249,
        "matchingArabicURN": 175440,
        "last_updated": null
    },
    {
        "urduURN": 4061410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 78,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6226,
        "hadithSanad": "ہم سے عاصم بن علی نے بیان کیا ، انہوں نے کہا ہم سے ابن ابی ذئب نے بیان کیا ، انہوں نے کہا کہ ہم سے سعید مقبری نے بیان کیا ، ان سے ان کے والد نے بیان کیا ، ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا اور ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ",
        "hadithText": "اللہ تعالیٰ چھینک کو پسند کرتا ہے کیونکہ وہ بعض دفعہ صحت کی علامت ہے اور جمائی کو ناپسند کرتا ہے ۔ اس لئے جب تم میں سے کوئی شخص چھینکے تو وہ الحمدللہ کہے لیکن جمائی لینا شیطان کی طرف سے ہوتا ہے ۔ اس لئے جب تم میں سے کسی کو جمائی آئے تو وہ اپنی قوت وطاقت کے مطابق اسے رو کے ۔ اس لئے کہ جب تم میں سے کوئی جمائی لیتا ہے تو شیطان ہنستا ہے ۔</b>",
        "bookID": "78.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 250,
        "matchingArabicURN": 175450,
        "last_updated": null
    }
]