[
    {
        "urduURN": 4061420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6227,
        "hadithSanad": "ہم سے یحییٰ بن جعفر نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، ان سے معمر نے ، ان سے ہمام نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ نے آدم کو اپنی صورت پر بنایا ، ان کی لمبائی ساٹھ ہاتھ تھی ۔ جب انہیں پیدا کر چکا تو فرمایا کہ جاؤ اور ان فرشتوں کو جو بیٹھے ہوئے ہیں ، سلام کرو اور سنو کہ تمہارے سلام کا کیا جواب دیتے ہیں ، کیونکہ یہی تمہارا اور تمہاری اولاد کا سلام ہو گا ۔ آدم علیہ السلام نے کہا السلام علیکم ! فرشتوں نے جواب دیا ، السلام علیک ورحمۃ اللہ ، انہوں نے آدم کے سلام پر ” ورحمۃ اللہ “ بڑھا دیا ۔ پس جو شخص بھی جنت میں جائے گا حضرت آدم علیہ السلام کی صورت کے مطابق ہو کر جائے گا ۔ اس کے بعد سے پھر خلقت کا قد وقامت کم ہوتا گیا ۔ اب تک ایسا ہی ہوتا رہا ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 153300,
        "last_updated": null
    },
    {
        "urduURN": 4061430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6228,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہیں سلیمان بن یسار نے خبر دی اور انہیں حضرت عبداللہ بن عباس رضی اللہ عنہما نے خبر دی ، انہوں نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے حضرت فضل بن عباس رضی اللہ عنہماکو قربانی کے دن اپنی سواری پر اپنے پیچھے بٹھایا ۔ وہ خوبصورت گورے مرد تھے ۔ حضور اکرم صلی اللہ علیہ وسلم لوگو ں کو مسائل بتانے کے لئے کھڑے ہو گئے ۔ اسی دوران میں قبیلہ خثعم کی ایک خوبصورعورت بھی آنحضرت صلی اللہ علیہ وسلم سے مسئلہ پوچھنے آئی ۔ فضل بھی اس عورت کو دیکھنے لگے ۔ اس کا حسن وجمال ان کو بھلامعلوم ہوا ۔ آنحضرت صلی اللہ علیہ وسلم نے مڑکر دیکھا تو فضل اسے دیکھ رہے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے اپناہاتھ پیچھے لے جا کر فضل کی ٹھوڑی پکڑی اور ان کا چہرہ دوسری طرف کر دیا ۔ پھر اس عورت نے کہا ، یا رسول اللہ حج کے بارے میں اللہ کا جو اپنے بندوں پر فریضہ ہے وہ میرے والد پر لاگوہوتا ہے ، جو بہت بوڑھے ہو چکے ہیں اور سواری پر سیدھے نہیں بیٹھ سکتے ۔ کیا اگر میں ان کی طرف سے حج کر لو ں تو ان کا حج ادا ہو جائے گا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں ہو جائے گا ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 153310,
        "last_updated": null
    },
    {
        "urduURN": 4061440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6229,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، انہوں نے کہا ہم کو ابوعامر نے خبر دی ، انہوں نے کہا ہم سے زہیر نے بیان کیا ، ان سے زید بن اسلم نے بیان کیا ، ان سے عطاء بن یسار نے بیان کیا اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا راستوں پر بیٹھنے سے بچو ! صحابہ نے عرض کیا یا رسول اللہ ! ہماری یہ مجلس تو بہت ضروری ہیں ، ہم وہیں روزمرہ گفتگو کیا کرتے ہیں ۔ آپ نے فرمایا کہ اچھا جب تم ان مجلسوں میں بیٹھنا ہی چاہتے ہو تو راستے کا حق ادا کیا کرویعنی راستے کو اس کا حق دو ۔ صحابہ نے عرض کیا ، راستے کا حق کیا ہے یا رسول اللہ ! فرمایا ( غیرمحرم عورتوں کو دیکھنے سے ) نظرنیچی رکھنا ، راہ گیروں کو نہ ستانا ، سلام کا جواب دینا ، بھلائی کا حکم دینا اور برائی سے روکنا ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 153320,
        "last_updated": null
    },
    {
        "urduURN": 4061450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6230,
        "hadithSanad": "ہم سے عمر بن حفص نے بیان کیا ، انہوں نے کہا ہم سے ہمارے والد نے بیان کیا ، انہوں نے کہا ہم سے اعمش نے بیان کیا ، انہوں نے کہا کہ مجھ سے شقیق نے بیان کیا اور ان سے عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جب ہم ( ابتداء اسلام میں ) نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتے تو کہتے ” سلام ہو اللہ پر اس کے بندوں سے پہلے ، سلام ہو جبرائیل پر ، سلام ہو میکائیل پر ، سلام ہو فلاں پر ، پھر ( ایک مرتبہ ) جب آنحضرت صلی اللہ علیہ وسلم نماز سے فارغ ہوئے تو ہماری طرف متوجہ ہو کر فرمایا کہ اللہ ہی سلام ہے ۔ اس لئے جب تم میں سے کوئی نماز میں بیٹھے تو ” التحیات للہ والصلوات والطیبات السلام علیک ایھا النبی ورحمۃ اللہ وبرکاتہ السلام علیناوعلی عباد اللہ الصالحین ۔ “ الخ پڑھا کرے ۔ کیونکہ جب وہ یہ دعا پڑہے گا تو آسمان و زمین کے ہر صالح بندے کو اس کی یہ دعا پہنچے گی ۔ ” اشہد ان لا ا\u0004\bلٰہ ا\u0004\bلا اللہ واشہد ان محمد ا عبدہ ورسولہ “ اس کے بعد اسے اختیار ہے جو دعا چاہے پڑھے ۔ ( مگر یہ درود شریف پڑھنے کے بعد ہے )</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 153330,
        "last_updated": null
    },
    {
        "urduURN": 4061460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6231,
        "hadithSanad": "ہم سے محمد بن مقاتل ابوالحسن نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ نے خبر دی ، انہوں نے کہا ہم کومعمر نے خبر دی ، انہیں ہمام بن منبہ نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا چھوٹا بڑے کو سلام کرے ، گزرنے والا بیٹھنے والے کو سلام کرے اور چھوٹی جماعت بڑی جماعت کو پہلے سلام کرے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 153340,
        "last_updated": null
    },
    {
        "urduURN": 4061470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6232,
        "hadithSanad": "ہم سے محمد نے بیان کیا ، انہوں نے کہا ہم کو مخلد نے خبر دی ، انہوں نے کہا ہم کو ابن جریج نے خبر دی ، انہوں نے کہا کہ مجھے زیاد نے خبر دی ، انہوں نے عبدالرحمٰن بن زید کے غلام ثابت سے سنا ، اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ۔ انہوں نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا سوار پیدل چلنے والے کو سلام کرے ، پیدل چلنے والا بیٹھے ہوئے کو اورکم تعداد والے بڑی تعدا د والوں کو ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 153350,
        "last_updated": null
    },
    {
        "urduURN": 4061480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6233,
        "hadithSanad": "ہم سے اسحاق بن ابراہیم نے بیان کیا ، انہوں نے کہا ہم کوروح بن عبادہ نے خبر دی ، انہوں نے کہا ہم سے ابن جریج نے بیان کیا ، انہوں نے کہا کہ",
        "hadithText": "مجھے زیاد نے خبر دی ، انہیں ثابت نے خبر دی جو عبدالرحمٰن بن زید کے غلام ہیں ۔ اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، سوار پیدل چلنے والے کو سلام کرے ، پیدل چلنے والا بیٹھے ہوئے شخص کو اور چھوٹی جماعت پہلے بڑی جماعت کو سلام کرے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 153360,
        "last_updated": null
    },
    {
        "urduURN": 4061490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6234,
        "hadithSanad": "اور ابراہیم بن طہمان نے بیان کیا ، انہوں نے کہا کہ ہم سے موسیٰ بن عقبہ نے بیان کیا ، ان سے صفوان بن سلیم نے بیان کیا ، ان سے عطاء بن یسار نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا چھوٹا بڑے کو سلام کرے ، گزرنے والا بیٹھنے والے کواور کم تعدا د والے بڑی تعداد والوں کو ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 153370,
        "last_updated": null
    },
    {
        "urduURN": 4061500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6235,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے شیبانی نے ، ان سے اشعث بن ابی الشعثاء نے ، ان سے معاویہ بن سوید بن مقرن نے اور ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ہمیں سات باتوں کاحکم دیا تھا ۔ بیمار کی مزاج پرسی کرنے کا ، جنازے کے پیچھے چلنے کا ، چھینکنے والے کے جواب دینے کا ۔ کمزور کی مدد کرنے کا ، مظلوم کی مدد کرنے کا ، افشاء سلام ( سلام کا جواب دینے اور بکثرت سلام کرنے ) کا قسم ( حق ) کھانے والے کی قسم پوری کرنے کا ، اور آنحضرت صلی اللہ علیہ وسلم نے چاندی کے برتن میں پینے سے منع فرمایا تھا اور سونے کی انگوٹھی پہننے سے ہمیں منع فرمایا تھا ۔ میثر ( ریشم کی زین ) پر سوار ہونے سے ، ریشم اور دیباج پہننے ، قسی ( ریشمی کپڑا ) اور استبرق پہننے سے ( منع فرمایا تھا ) ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 153380,
        "last_updated": null
    },
    {
        "urduURN": 4061510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6236,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، کہا کہ مجھ سے یزید نے بیان کیا ، ان سے ابوالخیر نے ، ان سے عبداللہ بن عمر و رضی اللہ عنہ نے کہ",
        "hadithText": "ایک صاحب نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا اسلام کی کون سی حالت افضل ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا یہ کہ ( مخلوق خدا کو ) کھا نا کھلاؤاورسلام کرو ، اسے بھی جسے تم پہچانتے ہو اور اسے بھی جسے نہیں پہچانتے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 153390,
        "last_updated": null
    },
    {
        "urduURN": 4061520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6237,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے سفیان نے بیان کیا ، ان سے زہری نے بیان کیا ، ان سے عطاء بن یزید لیثی نے اور ان سے ابوایوب رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کسی مسلمان کے لئے جائز نہیں کہ وہ اپنے کسی ( مسلمان ) بھائی سے تین دن سے زیادہ تعلق کاٹے کہ جب وہ ملیں تو یہ ایک طرف منہ پھیرلے اور دوسرا دوسری طرف اور دونوں میں اچھا وہ ہے جو سلام پہلے کرے ۔ اور سفیان نے کہا کہ انہوں نے یہ حدیث زہری سے تین مرتبہ سنی ہے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 153400,
        "last_updated": null
    },
    {
        "urduURN": 4061530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6238,
        "hadithSanad": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، کہا ہم سے ابن وہب نے بیان کیا ، کہا مجھ کو یونس نے خبر دی ، انہیں ابن شہاب نے کہا کہ مجھے انس بن مالک رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "جب رسول اللہ صلی اللہ علیہ وسلم مدینہ منورہ ( ہجرت کر کے ) تشریف لائے تو ان کی عمر دس سال تھی ۔ پھر میں نے آنحضرت صلی اللہ علیہ وسلم کی زندگی کے باقی دس سالوںمیں آپ کی خدمت کی اور میں پردہ کے حکم کے متعلق سب سے زیادہ جانتا ہوں کہ کب نازل ہوا تھا ۔ ابی بن کعب رضی اللہ عنہ مجھ سے اس کے بارے میں پوچھا کرتے تھے ۔ پردہ کے حکم کانزول سب سے پہلے اس رات ہوا جس میں رسول اللہ صلی اللہ علیہ وسلم نے زینب بنت جحش ر ضی اللہ عنہا سے نکاح کے بعد ان کے ساتھ پہلی خلوت کی تھی ۔ آنحضرت صلی اللہ علیہ وسلم ان کے دولہا تھے اور آپ نے صحابہ کو دعوت ولیمہ پر بلایا تھا ۔ کھانے سے فارغ ہو کر سب لوگ چلے گئے لیکن چند آدمی آپ کے پاس بیٹھے رہ گئے اور بہت دیر تک وہیں ٹھہرے رہے ۔ آنحضرت صلی اللہ علیہ وسلم اٹھ کر باہر تشریف لے گئے اور میں بھی آنحضرت صلی اللہ علیہ وسلم کے ساتھ چلا گیا تاکہ وہ لوگ بھی چلے جائیں ۔ آنحضرت چلتے رہے اور میں بھی آنحضرت صلی اللہ علیہ وسلم کے ساتھ چلتا رہا اور سمجھا کہ وہ لوگ اب چلے گئے ہیں ۔ اس لئے واپس تشریف لائے اور میں بھی آنحضرت صلی اللہ علیہ وسلم کے ساتھ واپس آیا لیکن آپ جب زینب رضی اللہ عنہا کے حجرے میں داخل ہوئے تو وہ لوگ ابھی بیٹھے ہوئے تھے اور ابھی تک واپس نہیں گئے تھے ۔ آنحضرت صلی اللہ علیہ وسلم دوبارہ وہاں سے لوٹ گئے اور میں بھی آپ کے ساتھ لوٹ گیا ۔ جب آپ عائشہ رضی اللہ عنہا کے حجرہ کی چوکھٹ تک پہنچے تو آپ نے سمجھا کہ وہ لوگ نکل چکے ہوں گے ۔ پھر آپ لوٹ کر آئے اور میں بھی آپ کے ساتھ لوٹ آیا تو واقعی وہ لوگ جا چکے تھے ۔ پھر پردہ کی آیت نازل ہوئی اور آنحضرت صلی اللہ علیہ وسلم نے میرے اور اپنے درمیان پردہ لٹکا لیا ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 153410,
        "last_updated": null
    },
    {
        "urduURN": 4061540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6239,
        "hadithSanad": "ہم سے ابو النعمان نے بیان کیا ، کہا ہم سے معتمر نے بیان کیا ، کہامجھ سے میرے والد نے بیان کیا کہ ان سے ابو مجلز نے بیان کیا اور ان سے انس رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم نے زینب رضی اللہ عنہا سے نکاح کیا تو لوگ اندر آئے اور کھانا کھایا پھر بیٹھ کے باتیں کرتے رہے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس طرح اظہار کیا گویا آپ کھڑے ہونا چاہتے ہیں ۔ لیکن وہ کھڑے نہیں ہوئے جب آنحضرت صلی اللہ علیہ وسلم نے یہ دیکھا تو کھڑے ہو گئے ۔ آپ کے کھڑے ہونے پر قوم کے جن لوگوں کوکھڑا ہونا تھا وہ بھی کھڑے ہو گئے لیکن بعض لوگ اب بھی بیٹھے رہے اور جب آنحضرت صلی اللہ علیہ وسلم اندر داخل ہونے کے لئے تشریف لائے توکچھ لوگ بیٹھے ہوئے تھے ( آپ واپس ہو گئے ) اور پھر جب وہ لوگ بھی کھڑے ہوئے اور چلے گئے تو میں نے آنحضرت صلی اللہ علیہ وسلم کو اس کی اطلاع دی ۔ آنحضرت صلی اللہ علیہ وسلم تشریف لائے اور اندر داخل ہو گئے ۔ میں نے بھی اندر جانا چاہا لیکن آنحضرت صلی اللہ علیہ وسلم نے میرے اور اپنے درمیان پردہ ڈال لیا ۔ اور اللہ تعالیٰ نے یہ آیت نازل کی ۔ ” اے ایمان والو ! نبی کے گھر میں نہ داخل ہو “ آخر تک ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 153420,
        "last_updated": null
    },
    {
        "urduURN": 4061550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6240,
        "hadithSanad": "ہم سے اسحاق نے بیان کیا ، کہا ہم کو یعقوب نے خبر دی ، مجھ سے میرے والد نے بیان کیا ، ا ن سے صالح نے ، ان سے ابن شہاب نے بیان کیا ، کہا کہ مجھے عروہ بن زبیر نے خبر دی اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے بیان کیاکہ",
        "hadithText": "عمر بن خطاب رضی اللہ عنہ آنحضرت صلی اللہ علیہ وسلم سے کہا کرتے تھے کہ آنحضور صلی اللہ علیہ وسلم ازواج مطہرا ت کا پردہ کرائیں ۔ بیان کیا کہ آنحضور صلی اللہ علیہ وسلم نے ایسا نہیں کیا اور ازواج مطہرات رفع حاجت کے لئے صرف رات ہی کے وقت نکلتی تھیں ( اس وقت گھروں میں بیت الخلاء نہیں تھے ) ایک مرتبہ سودہ بنت زمعہ رضی اللہ عنہاباہر گئی ہوئی تھیں ۔ ان کا قد لمبا تھا ۔ حضرت عمر بن خطاب رضی اللہ عنہ نے انہیں دیکھا ۔ اس وقت وہ مجلس میں بیٹھے ہوئے تھے ۔ انہوں نے کہا سودہ میں نے آپ کوپہچان لیا یہ انہوں نے اس لئے کہا کیونکہ وہ پردہ کے حکم نازل ہونے کے بڑے متمنی تھے ۔ بیان کیا کہ پھر اللہ تعالیٰ نے پردہ کی آیت نازل کی ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 153430,
        "last_updated": null
    },
    {
        "urduURN": 4061560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6241,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے ، ان سے زہری نے بیان کیا ( سفیان نے کہا کہ ) میں نے یہ حدیث زہری سے سن کراس طرح یاد کی ہے کہ جیسے تو اس وقت یہاں موجود ہو اور ان سے سہل بن سعد نے کہ",
        "hadithText": "ایک شخص نے نبی کریم صلی اللہ علیہ وسلم کے کسی حجرہ میں سوراخ سے دیکھا ، آنحضرت صلی اللہ علیہ وسلم کے پاس اس وقت ایک کنگھاتھاجس سے آپ سرمبارک کھجا رہے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس سے فرمایا کہ اگر مجھے معلوم ہوتا کہ تم جھانک رہے ہو تو یہ کنگھا تمہاری آنکھ میں چبھو دیتا ( اندر داخل ہونے سے پہلے ) اجازت مانگنا توہے ہی اسلئے کہ ( اندر کی کوئی ذاتی چیز ) نہ دیکھی جائے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 153440,
        "last_updated": null
    },
    {
        "urduURN": 4061570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6242,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے حما د بن زید نے بیان کیا ، ان سے عبیداللہ بن ابی بکر نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "ایک صاحب نبی کریم صلی اللہ علیہ وسلم کے کسی حجرہ میں جھانک کر دیکھنے لگے تو آنحضرت صلی اللہ علیہ وسلم ان کی طرف تیر کا پھل یا بہت سے پھل لے کر بڑھے ، گویا میں آنحضرت صلی اللہ علیہ وسلم کو دیکھ رہا ہوں ان صاحب کی طرف اس طرح چپکے چپکے تشریف لائے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 153450,
        "last_updated": null
    },
    {
        "urduURN": 4061580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6243,
        "hadithSanad": "ہم سے حمیدی نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے ابن طاؤس نے ، ان سے ان کے والد نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیاکہ",
        "hadithText": "ابوہریرہ رضی اللہ عنہ کی حدیث سے زیادہ صغیرہ گناہوں سے مشابہ میں نے اور کوئی چیز نہیں دیکھی ۔ ( حضرت ابوہریرہ رضی اللہ عنہ نے جو باتیں بیان کی ہیں وہ مراد ہیں ) مجھ سے محمود نے بیان کیا ، کہا ہم سے عبدالرزاق نے خبر دی ، کہا ہم کو معمر نے خبر دی ، انہیں ابن طاؤس نے ، انہیں ان کے والد نے اور ان سے ابن عباس رضی اللہ عنہمانے کہ میں نے کوئی چیز صغیرہ گناہوں سے مشابہ اس حدیث کے مقابلہ میں نہیں دیکھی جسے ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے نقل کیا ہے کہ اللہ تعالیٰ نے انسانوں کے معاملہ میں زنا میں سے اس کا حصہ لکھ دیا ہے جس سے وہ لامحالہ دوچار ہو گا پس آنکھ کا زنا دیکھنا ہے ، زبان کا زنا بولنا ہے ، دل کا زنا یہ ہے کہ وہ خواہش اور آرزو کرتا ہے پھر شرمگاہ اس خواہش کو سچا کرتی ہے یا جھٹلا دیتی ہے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 153460,
        "last_updated": null
    },
    {
        "urduURN": 4061590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6244,
        "hadithSanad": "ہم سے اسحٰق نے بیان کیا کہا ہم کو عبدالصمد نے خبر دی ، انہیں عبداللہ بن مثنی نے خبر دی ان سے ثمامہ بن عبداللہ نے بیان کیا اور ان سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم جب کسی کو سلام کرتے ( اور جواب نہ ملتا ) تو تین مرتبہ سلام کرتے تھے اور جب آپ کوئی بات فرماتے تو ( زیادہ سے زیادہ ) تین مرتبہ اسے دہراتے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 153470,
        "last_updated": null
    },
    {
        "urduURN": 4061600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6245,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، کہا ہم سے یزید بن خصیفہ نے بیان کیا ان سے بسر بن سعید اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں انصار کی ایک مجلس میں تھا کہ ابوموسیٰ رضی اللہ عنہ تشریف لائے جیسے گھبرائے ہوئے ہوں ۔ انہوں نے کہا کہ میں عمر رضی اللہ عنہ کے یہاں تین مرتبہ اندر آنے کی اجازت چاہی لیکن مجھے کوئی جواب نہیں ملا ، اس لئے واپس چلا آیا ( حضرت عمر رضی اللہ عنہ کو معلوم ہوا ) تو انہوں نے دریافت کیا کہ ( اندر آنے میں ) کیا بات مانع تھی ؟ میں نے کہا کہ میں نے تین مرتبہ اندر آنے کی اجازت مانگی اور جب مجھے کوئی جواب نہیں ملا تو واپس چلا گیا اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے کہ : جب تم میں سے کوئی کسی سے تین مرتبہ اجازت چاہے اور اجا زت نہ ملے تو واپس چلاجانا چاہئے حضرت عمر رضی اللہ عنہ نے کہا واللہ ! تمہیں اس حدیث کی صحت کے لئے کوئی گوا ہ لاناہو گا ۔ ( ابوموسیٰ رضی اللہ عنہ نے مجلس والوں سے پوچھا ) کیا تم میں کوئی ایسا ہے جس نے آنحضرت صلی اللہ علیہ وسلم سے یہ حدیث سنی ہو ؟ ابی بن کعب رضی اللہ عنہ نے کہا کہ اللہ کی قسم ! تمہارے ساتھ ( اس کی گواہی دینے کے سوا ) جماعت میں سب سے کم عمر شخص کے کوئی اور نہیں کھڑا ہو گا ۔ ابوسعید نے کہا اور میں ہی جماعت کا وہ سب سے کم عمر آدمی تھا میں ان کے ساتھ اٹھ کھڑا ہو گیا اور عمر رضی اللہ عنہ سے کہا کہ واقعی نبی کریم صلی اللہ علیہ وسلم نے ایسا فرمایا ہے ۔ اور ابن مبارک نے بیان کیا کہ مجھ کو سفیان بن عیینہ نے خبر دی ، کہا مجھ سے یزید بن خصیفہ نے بیان کیا ، انہوں نے بسر بن سعید سے ، کہا میں نے ابوسعید رضی اللہ عنہ سے سنا پھر یہی حدیث نقل کی ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 153480,
        "last_updated": null
    },
    {
        "urduURN": 4061610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6246,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے عمر بن ذر نے بیان کیا ( دوسری سند ) اور ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو مجاہد نے خبر دی ، اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( آپ کے گھر میں ) داخل ہوا آنحضرت صلی اللہ علیہ وسلم نے ایک بڑے پیا لے میں دودھ پایا تو فرمایا ، ابوہریرہ ! اہل صفہ کے پاس جا اور انہیں میرے پاس بلا لا ۔ میں ان کے پاس آیا اور انہیں بلا لایا ۔ وہ آئے اور ( اندر آنے کی ) اجازت چاہی پھر جب ا جازت دی گئی تو داخل ہوئے ۔ باب اور حدیث میں مطابقت ظاہر ہے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 153500,
        "last_updated": null
    },
    {
        "urduURN": 4061620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6247,
        "hadithSanad": "ہم سے علی بن الجعد نے بیان کیا ، انہوں نے کہا ہم کوشعبہ نے خبر دی ، انہیں سیار نے انہوں نے ثابت بنانی سے روایت کی ، انہیں انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "آپ بچوں کے پاس سے گزرے تو انہیں سلام کیا اور فرمایا کہ نبی کریم صلی اللہ علیہ وسلم بھی ایسا ہی کرتے تھے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 153510,
        "last_updated": null
    },
    {
        "urduURN": 4061630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6248,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، کہا ہم سے ابن ابی حازم نے ان سے ان کے والد نے اور ان سے سہل رضی اللہ عنہ نے کہ",
        "hadithText": "ہم جمعہ کے دن خوش ہوا کرتے تھے ۔ میں نے عرض کی کس لئے ؟ فرمایا کہ ہماری ایک بڑھیا تھیں جو مقا م بضاعہ جایا کرتی تھیں ۔ ابن سلمہ نے کہا کہ بضاعہ مدینہ منورہ کا کھجور کا ایک باغ تھا ۔ پھر وہ وہاں سے چقندر لایا کرتی تھیں اور اسے ہانڈی میں ڈالتی تھیں اور جو کے کچھ دانے پیس کر ( اس میں ملاتی تھیں ) جب ہم جمعہ کی نماز پڑھ کر واپس ہوتے تو انہیں سلام کرنے آتے اور وہ یہ چقندر کی جڑ میں آٹا ملی ہوئی دعوت ہمارے سامنے رکھتی تھیں ہم اس وجہ سے جمعہ کے دن خوش ہوا کرتے تھے اور قیلولہ یا دوپہر کا کھانا ہم جمعہ کے بعد کرتے تھے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 153520,
        "last_updated": null
    },
    {
        "urduURN": 4061640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6249,
        "hadithSanad": "ہم سے ابن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو معمر نے خبر دی انہیں زہری نے انہیں ابوسلمہ بن عبدالرحمٰن نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، اے عائشہ ! یہ جبرائیل ہیں تمہیں سلام کہتے ہیں بیان کیا کہ میں نے عرض کیا وعلیہ السلا م و رحمت اللہ ، آپ دیکھتے ہیں جو ہم نہیں دیکھ سکتے ام المؤمنین کا اشارہ آنحضرت صلی اللہ علیہ وسلم کی طرف تھا ۔ معمر کے ساتھ اس حدیث کو شعیب اور یونس اور نعمان نے بھی زہری سے روایت کیا ہے یونس اور نعمان کی روایتوں میں و برکاتہ کا لفظ زیادہ ہے</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 153530,
        "last_updated": null
    },
    {
        "urduURN": 4061650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6250,
        "hadithSanad": "ہم سے ابو الولید ہشام بن عبدالملک نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے محمد بن منکدر نے کہا کہ میں نے حضرت جابر رضی اللہ عنہ سے سنا ، وہ بیان کرتے تھے کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں اس قرض کے بارے میں حاضر ہوا جو میرے والد پر تھا ۔ میں دروازہ کھٹکھٹایا ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا ، کون ہیں ؟ میں نے کہا ” میں “ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ” میں “ ” میں “ جیسے آپ نے اس جواب کو ناپسند فرمایا ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 153540,
        "last_updated": null
    },
    {
        "urduURN": 4061660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6251,
        "hadithSanad": "ہم سے اسحٰق بن منصور نے بیان کیا انہوں نے کہا ہم کو عبداللہ بن نمیر نے خبر دی ، ان سے عبیداللہ نے بیان کیا ، ان سے سعید بن ابی سعید مقبری نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک شخص مسجد میں داخل ہوا ، رسول اللہ صلی اللہ علیہ وسلم مسجد کے کنارے بیٹھے ہوئے تھے ۔ اس نے نماز پڑھی اور پھر حاضر ہو کر آنحضرت صلی اللہ علیہ وسلم کو سلام کیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فر مایا ” علیک السلام “ واپس جا اور دوبارہ نماز پڑھ ، کیو نکہ تم نے نماز نہیں پڑھی ۔ وہ واپس گئے اور نماز پڑھی ۔ پھر ( نبی کریم صلی اللہ علیہ وسلم ) کے پاس آئے اور سلام کیا آپ نے فرمایا وعلیک السلام ۔ واپس جاؤ پھر نماز پڑھو ۔ کیو نکہ تم نے نماز نہیں پڑھی ۔ وہ واپس گیا اور اس نے پھر نماز پڑھی ۔ پھر واپس آیا اور نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں سلام عرض کیا ۔ آپ صلی اللہ علیہ وسلم نے جواب میں فر مایا وعلیکم السلام ۔ واپس جاؤ اور دو بارہ نمازپڑھو ۔ کیو نکہ تم نے نماز نہیں پڑھی ۔ ان صاحب نے دوسر ی مرتبہ ، یا اس کے بعد ، عرض کیا یا رسول اللہ ! مجھے نماز پڑھنی سکھا دیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے فر مایا جب نماز کے لیے کھڑے ہواکرو تو پہلے پو ری طرح وضو کیا کرو ، پھر قبلہ رو ہو کر تکبیر ( تحریمہ ) کہو ، اس کے بعد قر آن مجید میں سے جو تمہارے لئے آسان ہو وہ پڑھو ، پھر رکوع کرو اور جب رکوع کی حالت میں برابر ہو جاؤ تو سر اٹھاؤ ۔ جب سیدھے کھڑے ہو جاؤ تو پھر سجدہ میں جاؤ ، جب سجدہ پو ری طرح کر لو تو سر اٹھاؤ اور اچھی طرح سے بیٹھ جاؤ ۔ یہی عمل اپنی ہر رکعت میں کرو ۔ اور ابواسامہ راوی نے دوسرے سجدہ کے بعد یوں کہا پھر سر اٹھا یہاں تک کہ سید ھا کھڑا ہو جا ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 153550,
        "last_updated": null
    },
    {
        "urduURN": 4061670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6252,
        "hadithSanad": "ہم سے ابن بشار نے بیان کیا ، کہا کہ مجھ سے یحییٰ نے بیان کیا ، ان سے عبیداللہ نے ، ان سے سعید نے بیان کیا ، ان سے ان کے والد نے اور ان سے حضر ت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فر مایا ، پھر سر سجدہ سے اٹھا اور اچھی طرح بیٹھ جا ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 153560,
        "last_updated": null
    },
    {
        "urduURN": 4061680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6253,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے زکریا نے بیان کیا ، کہا کہ میں نے عامر سے سنا ، انہوں نے بیان کیا کہ مجھ سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے اس سے فرمایا کہ جبرائیل علیہ السلام تمہیں سلام کہتے ہیں ۔ عائشہ رضی اللہ عنہا نے کہا کہ ” وعلیہ السلام ورحمۃ اللہ ۔ ان پر بھی اللہ کی طرف سے سلامتی اور اس کی رحمت نازل ہو ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 153570,
        "last_updated": null
    },
    {
        "urduURN": 4061690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6254,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا ہم کو ہشام بن عروہ نے خبر دی ، انہیں معمر نے ، انہیں زہری نے ، ان سے عروہ بن زبیر نے بیان کیا کہ مجھے اسامہ بن زید رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ایک گدھے پر سوار ہوئے جس پر پالان بندھا ہوا تھا اور نیچے فد ک کی بنی ہوئی ایک مخملی چادر بچھی ہوئی تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے سواری پر اپنے پیچھے اسامہ بن زید رضی اللہ عنہ کو بٹھایا تھا ۔ آپ بنی حارث بن خزرج میں حضرت سعد بن عبادہ رضی اللہ عنہ کی عیادت کے لئے تشریف لے جا رہے تھے ۔ یہ جنگ بدر سے پہلے کا واقعہ ہے ۔ آنحضرت صلی اللہ علیہ وسلم ایک مجلس پر سے گزرے جس میں مسلمان بت پرست مشرک اور یہودی سب ہی شریک تھے ۔ عبداللہ بن ابی ابن سلول بھی ان میں تھا ۔ مجلس میں عبداللہ بن رواحہ بھی موجود تھے ۔ جب مجلس پر سواری کا گرد پڑا تو عبداللہ نے اپنی چادر سے اپنی ناک چھپا لی اور کہا کہ ہمارے اوپر غبار نہ اڑاؤ ۔ پھر حضور اکرم صلی اللہ علیہ وسلم نے سلام کیا اور وہاں رک گئے اور اتر کر انہیں اللہ کی طرف بلایا اور ان کے لئے قرآن مجید کی تلاو ت کی ۔ عبداللہ بن ابی ابن سلول بولا ، میاں میں ان باتوں کے سمجھنے سے قاصر ہوں اگر وہ چیز حق ہے جو تم کہتے ہو تو ہماری مجلسوں میں آ کر ہمیں تکلیف نہ دیا کرو ۔ اس پر ابن رواحہ نے کہا آنحضرت صلی اللہ علیہ وسلم ہماری مجلسوں میں تشریف لایا کریں کیونکہ ہم اسے پسند کرتے ہیں ۔ پھر مسلمانوں مشرکوں اور یہودیوں میں اس بات پر تو تو میں میں ہونے لگی اور قریب تھا کہ وہ کوئی ارادہ کربیٹھیں اور ایک دوسرے پر حملہ کر دیں ۔ لیکن آنحضرت صلی اللہ علیہ وسلم انہیں برابر خاموش کراتے رہے اور جب وہ خاموش ہو گئے تو آنحضرت صلی اللہ علیہ وسلم اپنی سواری پر بیٹھ کر سعد بن عبادہ رضی اللہ عنہ کے یہاں گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا ، سعد تم نے نہیں سنا کہ ابو حباب نے آج کیا بات کہی ہے ۔ آپ کا اشارہ عبداللہ بن ابی کی طرف تھا کہ اس نے یہ یہ باتیں کہی ہیں ۔ حضرت سعد نے عرض کیا کہ یا رسول اللہ ! اسے معاف کر دیجئیے اور درگزر فرمائیے ۔ اللہ تعالیٰ نے وہ حق آپ کو عطا فرمایا ہے جو عطا فرمانا تھا ۔ اس بستی ( مدینہ منورہ ) کے لوگ ( آپ کی تشریف آوری سے پہلے ) اس پر متفق ہو گئے تھے کہ اسے تاج پہنا دیں اور شاہی عمامہ اس کے سر پر باندھ دیں لیکن جب اللہ تعالیٰ نے اس منصوبہ کو اس حق کی وجہ سے ختم کر دیا جو اس نے آپ کو عطا فرمایا ہے تو اسے حق سے حسد ہو گیا اور اسی وجہ سے اس نے یہ معاملہ کیا ہے جو آپ نے دیکھا ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم نے اسے معاف کر دیا ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 153580,
        "last_updated": null
    },
    {
        "urduURN": 4061700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6255,
        "hadithSanad": "ہم سے ابن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے عبدالرحمٰن بن عبداللہ نے اور ان سے عبداللہ بن کعب نے بیان کیا کہ میں نے کعب بن مالک سے سنا ، وہ بیان کرتے تھے کہ",
        "hadithText": "جب وہ غزوہ تبوک میں شریک نہیں ہو سکے تھے اور نبی کریم صلی اللہ علیہ وسلم نے ہم سے بات چیت کرنے کی ممانعت کر دی تھی اور میں آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر سلام کرتا تھا اور یہ اندازہ لگاتاتھا کہ آنحضرت صلی اللہ علیہ وسلم نے جواب سلام میں ہونٹ مبارک ہلائے یا نہیں ، آخر پچاس دن گزرگئے اور آنحضرت صلی اللہ علیہ وسلم نے اللہ کی بارگاہ میں ہماری توبہ کے قبول کئے جانے کا نماز فجر کے بعد اعلان کیا ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 153590,
        "last_updated": null
    },
    {
        "urduURN": 4061710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6256,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ، انہوں نے کہا کہ مجھے عروہ نے خبر دی ، اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیاکہ",
        "hadithText": "کچھ یہودی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور کہا کہ ” السام علیک “ ( تمہیں موت آئے ) میں ان کی بات سمجھ گئی اور میں نے جواب دیا ” علیکم السام واللعنۃ “ آنحضرت صلی اللہ علیہ وسلم نے فرمایا عائشہ صبر سے کام لے کیونکہ اللہ تعالیٰ تمام معاملات میں نرمی کو پسند کرتا ہے ، میں نے عرض کیا یا رسول اللہ ! کیا آپ نے نہیں سنا کہ انہوں نے کیا کہا تھا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں نے ان کو جواب دے دیا تھا کہ ” وعلیکم “ ( اور تمہیں بھی )</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 153600,
        "last_updated": null
    },
    {
        "urduURN": 4061720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6257,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو امام مالک نے خبر دی ، انہیں عبداللہ بن دینار نے اور ان سے عبداللہ بن عمر رضی اللہ عنہمانے بیان کیاکہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب تمہیں یہودی سلام کریں اور اگر ان میں سے کوئی ” السام علیک “ کہے تو تم اس کے جواب میں صرف ” وعلیک “ ( اور تمہیں بھی ) کہہ دیا کرو ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 153610,
        "last_updated": null
    },
    {
        "urduURN": 4061730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6258,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، انہوں نے کہا ہم سے ہشم نے بیان کیا ، انہیں عبداللہ بن ابی بکر بن انس نے خبر دی ، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب اہل کتاب تمہیں سلام کریں تو تم اس کے جواب میں صرف ” وعلیکم “ کہو ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 153620,
        "last_updated": null
    },
    {
        "urduURN": 4061740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6259,
        "hadithSanad": "ہم سے یوسف بن بہلول نے بیان کیا ، کہا ہم سے ابن ادریس نے بیان کیا ، کہا کہ مجھ سے حصین بن عبدالرحمٰن نے بیان کیا ، ان سے سعد بن عبیدہ نے ، ان سے ابوعبدالرحمن سلمی نے اور ان سے حضرت علی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے مجھے زبیر بن عوام اور ابو مرثد غنوی کو بھیجا ۔ ہم سب گھوڑ سوار تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جاؤ اور جب ” روضہ خاخ “ ( مکہ اور مدینہ کے درمیان ایک مقام ) پر پہنچو تو وہاں تمہیں مشرکین کی ایک عورت ملے گی اس کے پاس حاطب بن ابی بلتعہ کا ایک خط ہے جو مشرکین کے پاس بھیجا گیا ہے ( اسے لے آؤ ) بیان کیا کہ ہم نے اس عورت کو پا لیا وہ اپنے اونٹ پر جا رہی تھی اور وہیں پر ملی ( جہاں ) آنحضرت صلی اللہ علیہ وسلم نے بتایا تھا ۔ بیان کیا کہ ہم نے اس سے کہا کہ خط جو تم ساتھ لے جا رہی ہو وہ کہاں ہے ؟ اس نے کہا کہ میرے پاس کوئی خط نہیں ہے ۔ ہم نے اس کے اونٹ کو بٹھایا اور اس کے کجاوہ میں تلاشی لی لیکن ہمیں کوئی چیز نہیں ملی ۔ میرے دونوں ساتھیوں نے کہا کہ ہمیں کوئی خط تو نظر آتا نہیں ۔ بیان کیا کہ میں نے کہا ، مجھے یقین ہے کہ حضور اکرم صلی اللہ علیہ وسلم نے غلط بات نہیں کہی ہے ۔ قسم ہے اس کی جس کی قسم کھائی جاتی ہے ، تم خط نکالوورنہ میں تمہیں ننگا کر دوں گا ۔ بیان کیا کہ جب اس عورت نے دیکھا کہ میں واقعی اس معاملہ میں سنجیدہ ہوں تو اس نے ازارباندھنے کی جگہ کی طرف ہاتھ بڑھایا ، وہ ایک چادر ازار کے طور پر باندھے ہوئے تھی اور خط نکالا ۔ بیان کیا کہ ہم اسے لے کر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا ، حاطب تم نے ایسا کیوں کیا ؟ انہوں نے کہا کہ میں اب بھی اللہ اور اس کے رسول پرایمان رکھتاہوں ۔ میرے اندر کوئی تغیر وتبدیلی نہیں آئی ہے ، میرا مقصد ( خط بھیجنے سے ) صرف یہ تھا کہ ( قریش پر آپ کی فوج کشی کی اطلاع دوں اور اس طرح ) میرا ان لوگوں پر احسان ہو جائے اور اس کی وجہ سے اللہ میرے اہل اور مال کی طرف سے ( ان سے ) مدافعت کرائے ۔ آپ کے جتنے مہاجر صحابہ ہیں ان کے مکہ مکرمہ میں ایسے افرادہیں جن کے ذریعہ اللہ ان کے مال اور ان کے گھر والوں کی حفاظت کرائے گا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا انہوں نے سچ کہ دیا ہے اب تم لوگ ان کے بارے میں سوا بھلائی کے اور کچھ نہ کہو بیان کیا کہ اس پر عمر بن خطاب رضی اللہ عنہ نے فرمایا کہ اس شخص نے اللہ اور اس کے رسول اور مومنوں کے ساتھ خیانت کی مجھے اجازت دیجئیے کہ میں اس کی گردن مار دوں بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا عمر ! تمہیں کیا معلوم ، اللہ تعالیٰ بدر کی لڑائی میں شریک صحابہ کی زندگی پر مطلع تھا اور اس کے با وجود کہا کہ تم جو چاہو کرو ، تمہارے لئے جنت لکھ دی گئی ہے ؛؛ بیان کیا کہ اس پر عمر رضی اللہ عنہ کی آنکھیں اشک آلود ہو گئیں اور عرض کیا اللہ اور اس کے رسول ہی زیادہ جاننے والے ہیں</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 153630,
        "last_updated": null
    },
    {
        "urduURN": 4061750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6260,
        "hadithSanad": "ہم سے محمد بن مقاتل ابوالحسن نے بیان کیا انہوں نے کہا ہم کو عبداللہ نے خبر دی انہوں نے کہا ہم کو یونس نے خبر دی اور ان سے زہری نے بیان کیا انہیں عبیداللہ بن عبداللہ بن عتبہ نے خبر دی انہیں حضرت عبداللہ بن عباس رضی اللہ عنہما نے خبر دی اور انہیں ابوسفیان بن حرب رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "ہرقل نے قریش کے چند افراد کے ساتھ انہیں بھی بلا بھیجا یہ لوگ شام تجارت کی غرض سے گئے تھے سب لوگ ہرقل کے پاس آئے پھر انہوں نے واقعہ بیان کیا کہ پھر ہرقل نے رسول اللہ صلی اللہ علیہ وسلم کا خط منگوایا اور وہ پڑھا گیا خط میں یہ لکھا ہوا تھا ۔ بسم اللہ الرحمن الرحیم محمد کی طرف سے جو اللہ کا بندہ اور اس کا رسول ہے ( صلی اللہ علیہ وسلم ) ہرقل عظیم روم کی طرف ، سلام ہو ان پر جنہوں نے ہدایت کی اتباع کی ۔ امابعد !</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 153640,
        "last_updated": null
    },
    {
        "urduURN": 4061760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6261,
        "hadithSanad": "لیث نے بیان کیا کہ مجھ سے جعفر بن ربیع نے بیان کیا ان سے عبدالرحمٰن بن ہرمز نے اور ان سے ابوہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "آنحضرت صلی اللہ علیہ وسلم نے بنی اسرائیل کے ایک شخص کا ذکر کیا کہ انہوں نے لکڑ ی کا ایک لٹھا لیا اور اس میں سوراخ کر کے ایک ہزار دینار اور خط رکھ دیا وہ ان کی طرف سے ان کے ساتھی ( قرض خواہ کی طرف تھا اور عمر بن ابی سلمہ نے بیان کیا کہ ان سے ان کے والد نے اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انہوں نے لکڑی کے ایک لٹھے میں سوراخ کیا اور مال اس کے اندر رکھ دیااوار ان کے پاس ایک خط لکھا ، فلاں کی طرف سے فلاں کو ملے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 153650,
        "last_updated": null
    },
    {
        "urduURN": 4061770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6262,
        "hadithSanad": "ہم سے ابو الولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ان سے سعد بن ابراہیم نے ان سے ابوامامہ بن سہل بن حنیف نے اور ان سے ابو سعید خدری نے کہ",
        "hadithText": "قریظہ کے یہودی حضرت سعد بن معاذرضی اللہ عنہ کو ثالث بنانے پر تیار ہو گئے تو رسول اللہ صلی اللہ علیہ وسلم نے انہیں بلا بھیجا جب وہ آئے تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اپنے سردار کے لینے کو اٹھو یا یوں فرمایا کہ اپنے میں سب سے بہتر کو لینے کے لئے اٹھو ۔ پھر وہ حضور اکرم صلی اللہ علیہ وسلم کے پاس بیٹھ گئے اور آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ بنی قریظہ کے لوگ تمہارے فیصلے پر راضی ہو کر ( قلعہ سے ) اتر آئے ہیں ( اب تم کیا فیصلہ کرتے ہو ۔ ) حضرت سعد رضی اللہ عنہ نے کہا کہ پھر میں یہ فیصلہ کرتا ہوں کہ ان میں جو جنگ کے قابل ہیں انہیں قتل کر دیا جائے اور ان کے بچوں اور عورتوں کو قید کر لیا جائے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ آپ نے وہی فیصلہ فرمایا جس فیصلہ کو فرشتہ لے کر آیا تھا ۔ ابوعبداللہ ! ( مصنف ) نے بیان کیا کہ مجھے میرے بعض اصحاب نے ابو الولید کے واسطہ سے ابوسعید رضی اللہ عنہ کا قول ( علی کے بجائے بصلہ ” الی “ حکمک نقل کیا ہے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 153660,
        "last_updated": null
    },
    {
        "urduURN": 4061780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6263,
        "hadithSanad": "ہم سے عمرو بن عاصم نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ان سے قتادہ نے کہ",
        "hadithText": "میں نے حضرت انس رضی اللہ عنہ سے پوچھا ، کیامصافحہ کا دستور نبی کریم صلی اللہ علیہ وسلم کے صحابہ میں تھا ؟ انہوں نے کہا کہ ہاں ضرور تھا ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 153670,
        "last_updated": null
    },
    {
        "urduURN": 4061790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6264,
        "hadithSanad": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، انہوں نے کہا کہ مجھ سے ابن وہب نے بیان کیا ، انہوں نے کہا کہ مجھے حیوہ نے خبر دی ، کہا کہ مجھ سے ابو عقیل زہرہ بن معبد نے بیان کیا ، انہوں نے اپنے دادا عبداللہ بن ہشام رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھے اور آنحضرت صلی اللہ علیہ وسلم عمر بن خطا ب رضی اللہ عنہ کا ہاتھ پکڑے ہوئے تھے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 153680,
        "last_updated": null
    },
    {
        "urduURN": 4061800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6265,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے سیف نے بیان کیا ، انہوں نے کہا کہ میں نے مجاہد سے سنا ، انہوں نے کہا کہ مجھ سے عبداللہ بن بخرہ ابو معمر نے بیان کیا کہ میں نے حضرت عبداللہ بن مسعود رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے مجھے تشہد سکھایا ، اس وقت میر اہاتھ آنحضرت صلی اللہ علیہ وسلم کی ہتھیلیوں کے درمیان میں تھا ( اس طرح سکھایا ) جس طرح آپ قرآن کی سورت سکھا یا کرتے تھے ۔ التحیات للہ والصلوات والطیبات السلام علیک ایھا النبی ورحمۃ اللہ وبرکاتہ السلام علینا وعلی عباداللہ الصالحین اشہد ان لا الٰہ الا اللہ واشہد ان محمدا عبدہ ورسولہ ۔ آنحضرت صلی اللہ علیہ وسلم اس وقت حیات تھے ۔ جب آپ کی وفات ہو گئی تو ہم ( خطاب کا صیغہ کے بجائے ) اس طرح پڑھنے لگے ۔ ” السلام علی النبی “ یعنی نبی کریم صلی اللہ علیہ وسلم پر سلام ہو ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 153690,
        "last_updated": null
    },
    {
        "urduURN": 4061810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6266,
        "hadithSanad": "ہم سے اسحاق بن راہویہ نے بیان کیا ، کہا ہم کو بشر بن شعیب نے خبر دی ، کہا مجھ سے میرے والد نے بیان کیا ، ان سے زہری نے ، کہا مجھ کو عبداللہ بن کعب نے خبر دی اور ان کو عبداللہ بن عباس رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "حضرت علی ابن ابی طالب رضی اللہ عنہ ( مرض الموت میں ) نبی کریم صلی اللہ علیہ وسلم کے پاس سے نکلے ( دوسری سند ) بخاری نے کہا اور ہم سے احمد بن صالح نے بیان کیا ، کہا ہم سے عنبسہ بن خالد نے بیان کیا ، کہا ہم سے یونس بن یزید نے بیان کیا ، ان سے ابن شہاب زہری نے بیان کیا ، کہا مجھ کو عبداللہ بن کعب بن مالک نے خبر دی اور انہیں عبداللہ بن عباس رضی اللہ عنہما نے خبر دی کہ حضرت علی بن ابی طالب رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کے یہاں سے نکلے ، یہ اس مرض کا واقعہ ہے جس میں آنحضرت صلی اللہ علیہ وسلم کی وفات ہوئی تھی ۔ لوگوں نے پوچھا اے ابو لحسن ! حضور اکرم صلی اللہ علیہ وسلم نے صبح کیسی گزاری ؟ انہوں نے کہا کہ بحمدللہ آپ کو سکون رہا ہے ۔ پھر حضرت علی رضی اللہ عنہ کا ہاتھ حضرت عباس رضی اللہ عنہ نے پکڑ کر کہا ۔ کیا تم آنحضرت صلی اللہ علیہ وسلم کو دیکھتے نہیں ہو ۔ ( واللہ ) تین دن کے بعد تمہیں لاٹھی کا بندہ بننا پڑے گا ۔ واللہ میں سمجھتا ہوں کہ اس مرض میں آپ وفات پا جائیں گے ۔ میں بنی عبدالمطلب کے چہروں پر موت کے آثار کو خوب پہچانتا ہوں ، اس لئے ہمارے ساتھ تم آپ کے پاس چلو ۔ تاکہ پوچھا جائے کہ آنحضرت صلی اللہ علیہ وسلم کے بعد خلافت کس کے ہاتھ میں رہے گی اگر وہ ہمیں لوگوں کو ملتی ہے تو ہمیں معلوم ہو جائے گا اور اگر دوسروں کے پاس جائے گی تو ہم عرض کریں گے تاکہ آنحضرت صلی اللہ علیہ وسلم ہمارے بارے میں کچھ وصیت کریں ۔ حضرت علی رضی اللہ عنہ نے کہا کہ واللہ ! اگر ہم نے آنحضرت صلی اللہ علیہ وسلم سے خلافت کی درخواست کی اور آنحضرت صلی اللہ علیہ وسلم نے انکار کر دیا تو پھر لوگ ہمیں کبھی نہیں دیں گے میں تو آنحضرت صلی اللہ علیہ وسلم سے کبھی نہیں پوچھوں گا کہ آپ کے بعد کون خلیفہ ہو ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 153700,
        "last_updated": null
    },
    {
        "urduURN": 4061820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6267,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، ان سے قتادہ نے ، ان سے انس رضی اللہ عنہ نے اور ان سے معاذ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں رسول اللہ صلی اللہ علیہ وسلم کی سواری پر آنحضرت صلی اللہ علیہ وسلم کے پیچھے سوار تھا آپ نے فرمایا اے معاذ ! میں نے کہا ۔ ” لبیک وسعدیک “ ( حاضر ہوں ) پھر آنحضرت صلی اللہ علیہ وسلم نے تین مرتبہ مجھے اسی طرح مخاطب کیا اس کے بعد فرمایا تمہیں معلوم ہے کہ بندوںپر اللہ کاکیا حق ہے ؟ ( پھر خود ہی جواب دیا ) کہ یہ کہ اسی کی عبادت کریں اور اس کے ساتھ کسی کو شریک نہ ٹھہرائیں پھر آپ تھوڑی دیر چلتے رہے اور فرمایا اے معاذ ! میں نے عرض کی ” لبیک وسعدیک “ فرمایا تمہیں معلوم ہے کہ جب وہ یہ کر لیں تو اللہ پر بندوں کا کیا حق ہے ؟ یہ کہ انہیں عذاب نہ دے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 153710,
        "last_updated": null
    },
    {
        "urduURN": 4061830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6268,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا مجھ سے میرے والد نے بیان کیا کہا ہم سے اعمش نے بیان کیا ، کہا ہم سے زید بن وہب نے بیان کیا ( کہا کہ )",
        "hadithText": "واللہ ہم سے ابوذر رضی اللہ عنہ نے مقام ربذہ میں بیان کیا کہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رات کے وقت مدینہ منورہ کی کالی پتھروں والی زمین پر چل رہا تھا کہ احد پہاڑ دکھائی دیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اے ابوذر ! مجھے پسند نہیں کہ اگر احد پہاڑکے برابر بھی میرے پاس سونا ہو اور مجھ پر ایک رات بھی اس طرح گذرجائے یا تین رات کہ اس میں سے ایک دینا ر بھی میرے پاس باقی بچے ۔ سوائے اس کے جو میں قرض کی ادائیگی کے لئے محفوظ رکھ لوں میں اس سارے سونے کو اللہ کی مخلوق میں اس اس طرح تقسیم کر دوں گا ۔ ابوذر رضی اللہ عنہ نے اس کی کیفیت ہمیں اپنے ہاتھ سے لپ بھر کردکھائی پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا اے ابوذر ! میں نے عرض کیا لبیک وسعدیک یا رسول اللہ ! آنحضرت صلی اللہ علیہ وسلم نے فرمایا زیادہ جمع کرنے والے ہی ( ثواب کی حیثیت سے ) کم حاصل کرنے والے ہوں گے ۔ سوائے اس کے جو اللہ کے بندوں پر مال اس اس طرح یعنی کثرت کے ساتھ خرچ کرے ۔ پھر فرمایا یہیں ٹھہرے رہو ابوذر ! یہاں سے اس وقت تک نہ ہٹنا جب تک میں واپس نہ آ جاؤں ۔ پھرآنحضرت صلی اللہ علیہ وسلم تشریف لے گئے اور نظروں سے اوجھل ہو گئے ۔ اس کے بعد میں نے آواز سنی اور مجھے خطرہ ہوا کہ کہیں حضور اکرم صلی اللہ علیہ وسلم کو کوئی پریشانی نہ پیش آ گئی ہو ۔ اس لئے میں نے ( آنحضرت صلی اللہ علیہ وسلم کو دیکھنے کے لئے ) جانا چاہا لیکن فوراً ہی آنحضور صلی اللہ علیہ وسلم کا یہ ارشاد یاد آیا کہ یہاں سے نہ ہٹنا ۔ چنانچہ میں وہیں رک گیا ( جب آپ تشریف لائے تو ) میں نے عرض کی ۔ میں نے آواز سنی تھی اور مجھے خطرہ ہو گیا تھا کہ کہیں آپ کو کوئی پریشانی نہ پیش آ جائے پھر مجھے آپ کا ارشاد یاد آیا اس لئے میں یہیں ٹھہر گیا ۔ آنحضر ت صلی اللہ علیہ وسلم نے فرمایا یہ جبرائیل علیہ السلام تھے ۔ میرے پاس آئے تھے اور مجھے خبر دی ہے کہ میری امت کا جو شخص بھی اس حال میں مرے گا کہ اللہ کے ساتھ کسی چیز کو شریک نہ ٹھہر اتا ہو تو وہ جنت میں جائے گا ۔ میں نے عرض کیا یا رسول اللہ ! اگرچہ اس نے زنا اور چوری کی ہو ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں اگر اس نے زنا اور چوری بھی کی ہو ۔ ( اعمش نے بیان کیا کہ ) میں نے زید بن وہب سے کہا کہ مجھے معلوم ہوا ہے کہ اس حدیث کے راوی ابودرداء رضی اللہ عنہ ہیں ؟ حضرت زید نے فرمایا میں گواہی دیتا ہوں کہ یہ حدیث مجھ سے ابو ذررضی اللہ عنہ نے مقام ربذہ میں بیان کی تھی ۔ اعمش نے بیان کیا کہ مجھ سے ابوصالح نے حدیث بیان کی اور ان سے ابو الدرداء رضی اللہ عنہ نے اسی طرح بیان کیا اور ابو شہاب نے اعمش سے بیان کیا ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 153730,
        "last_updated": null
    },
    {
        "urduURN": 4061840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6269,
        "hadithSanad": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے نافع نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کوئی شخص کسی دوسرے شخص کو اس کے بیٹھنے کی جگہ سے نہ اٹھائے کہ خود وہاں بیٹھ جائے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 153740,
        "last_updated": null
    },
    {
        "urduURN": 4061850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6270,
        "hadithSanad": "ہم سے خلاد بن یحییٰ نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے عبداللہ عمری نے ، ان سے نافع اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے اس سے منع فرمایا تھا کہ کسی شخص کو اس کی جگہ سے اٹھایا جائے تاکہ دوسرا اس کی جگہ بیٹھے ، البتہ ( آنے والے کو مجلس میں ) جگہ دے دیا کرو اور فراخی کر دیا کرو اور حضرت ابن عمر رضی اللہ عنہما ناپسند کرتے تھے کہ کوئی شخص مجلس میں سے کسی کو اٹھا کر خود اس کی جگہ بیٹھ جائے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 153750,
        "last_updated": null
    },
    {
        "urduURN": 4061860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6271,
        "hadithSanad": "ہم سے حسن بن عمر نے بیان کیا ، کہا ہم سے معتمر بن سلیمان نے ، کہا میں نے اپنے والد سے سنا ، وہ ابو مجلز ( حق بن حمید ) سے بیان کرتے تھے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جب رسول اللہ صلی اللہ علیہ وسلم نے زینب بنت جحش رضی اللہ عنہ سے نکاح کیا تو لوگوں کو ( دعوت ولیمہ پر ) بلایا ۔ لوگوں نے کھانا کھایا پھر بیٹھ کر باتیں کرتے رہے بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم نے ایسا کیا گویا آپ اٹھنا چاہتے ہیں ۔ لیکن لوگ ( بےحد بیٹھے ہوئے تھے ) پھر بھی کھڑے نہیں ہوئے ۔ جب آنحضرت صلی اللہ علیہ وسلم نے یہ دیکھا تو آپ کھڑے ہو گئے جب آنحضرت صلی اللہ علیہ وسلم کھڑے ہوئے تو آپ کے ساتھ اور بھی بہت سے صحابہ کھڑے ہو گئے لیکن تین آدمی اب بھی باقی رہ گئے ۔ اس کے بعد حضور اکرم صلی اللہ علیہ وسلم اندر جانے کے لئے تشریف لائے لیکن وہ لوگ اب بھی بیٹھے ہوئے تھے ۔ اس کے بعد وہ لوگ بھی چلے گئے ۔ انس رضی اللہ عنہ نے بیان کیا کہ پھر میں آیا اور میں نے آنحضرت صلی اللہ علیہ وسلم کو اطلاع دی کہ وہ ( تین آدمی ) بھی جا چکے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم تشریف لائے اور اندر داخل ہو گئے ۔ میں نے بھی اند ر جانا چاہا لیکن آنحضرت صلی اللہ علیہ وسلم نے میرے اور اپنے درمیان پردہ ڈال لیا اور اللہ تعالیٰ نے یہ آیت نازل کی ۔ اے ایمان والو ! نبی کے گھر میں اس وقت تک داخل نہ ہو جب تک تمہیں اجازت نہ دی جائے ۔ ارشادہوا ” ان ذالکم عند اللہ اجرا عظیماً “ تک ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 153760,
        "last_updated": null
    },
    {
        "urduURN": 4061870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6272,
        "hadithSanad": "ہم سے محمد بن ابی غالب نے بیان کیا ، کہا ہم کو ابراہیم بن المنذر حزامی نے خبر دی ، کہا ہم سے محمد بن فلیح نے بیان کیا ، ان سے ان کے باپ نے ، ان سے نافع نے اور ان سے حضرت ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو صحن کعبہ میں دیکھا کہ آپ سرین پر بیٹھے ہوئے دونوں رانیں شکم مبارک سے ملائے ہوئے ہاتھوں سے پنڈلی پکڑے ہوئے بیٹھے تھے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 153770,
        "last_updated": null
    },
    {
        "urduURN": 4061880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6273,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے بشر بن مفضل نے بیان کیا ، کہا ہم سے سعید بن ایاس جریر ی نے بیان کیا ، ان سے عبدالرحمٰن بن ابی بکرہ نے اور ان سے ان کے باپ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کیا میں تمہیں سب سے بڑے گناہ کی خبر نہ دوں ۔ صحابہ رضی اللہ عنہم نے عرض کیا کیوں نہیں یا رسول اللہ ! آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کے ساتھ شرک کرنا اور والدین کی نافرمانی کرنا ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 153780,
        "last_updated": null
    },
    {
        "urduURN": 4061890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6274,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے بشر بن مفضل نے اسی طرح مثال بیان کیا ، ( اور یہ بھی بیان کیا کہ )",
        "hadithText": "آنحضرت صلی اللہ علیہ وسلم ٹیک لگائے ہوئے تھے پھر آپ سیدھے بیٹھ گئے اور فرمایا ہاں اور جھوٹی بات بھی ۔ آنحضرت صلی اللہ علیہ وسلم اسے اتنی مرتبہ باربار دہر ا تے رہے کہ ہم نے کہا ، کاش آپ خاموش ہو جاتے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 153790,
        "last_updated": null
    },
    {
        "urduURN": 4061900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6275,
        "hadithSanad": "ہم سے ابو عاصم نے بیان کیا ، ان سے عمر بن سعید نے بیان کیا ، ان سے ابن ابی ملیکہ نے اور ان سے عقبہ بن حارث رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ہمیں عصر کی نماز پڑھائی اور پھر بڑی تیزی کے ساتھ چل کر آپ گھر میں داخل ہو گئے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 153800,
        "last_updated": null
    },
    {
        "urduURN": 4061910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6276,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے اعمش نے ، ان سے ابو الضحیٰ نے ، ان سے مسروق نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم تخت کے وسط میں نماز پڑھتے تھے اور میں آنحضرت صلی اللہ علیہ وسلم اور قبلہ کے درمیان لیٹی رہتی تھی مجھے کوئی ضرورت ہوتی لیکن مجھ کو کھڑے ہو کر آپ کے سامنے آنا برا معلوم ہوتا ۔ البتہ آپ کی طرف رخ کر کے میں آہستہ سے کھسک جاتی تھی ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 153810,
        "last_updated": null
    },
    {
        "urduURN": 4061920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6277,
        "hadithSanad": "ہم سے اسحاق بن شاہین واسطی نے بیان کیا ، کہا ہم سے خالد نے بیان کیا ( دوسری سند ) حضرت امام بخاری رحمہ اللہ نے کہا اور مجھ سے عبداللہ بن محمد مسندی نے بیان کیا ، ان سے عمرو بن عون نے بیان کیا ، ان سے خالد ( بن عبداللہ طحان ) نے بیان کیا ، ان سے خالد ( حذاء ) نے ، ان سے ابوقلابہ نے بیان کیا ، کہا کہ مجھے ابوالملیح عامربن زید نے خبر دی ، انہوں نے ( ابوقلابہ ) کو ( خطاب کر کے ) کہا کہ",
        "hadithText": "میں تمہارے والد زید کے ساتھ حضرت عبداللہ بن عمر رضی اللہ عنہما کی خدمت میں حاضر ہوا ، انہوں نے ہم سے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم سے میرے روزے کا ذکر کیا گیا ۔ آنحضرت صلی اللہ علیہ وسلم میرے یہاں تشریف لائے میں نے آپ کے لئے چمڑے کا ایک گدا ، جس میں کھجو ر کی چھا ل بھری ہوئی تھی بچھادیا ۔ آنحضرت صلی اللہ علیہ وسلم زمین پر بیٹھے اور گدا میرے اور آنحضرت صلی اللہ علیہ وسلم کے درمیان ویساہی پڑا رہا ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے مجھ سے فرمایا کیا تمہارے لئے ہر مہینے میں تین دن کے ( روزے ) کافی نہیں ؟ میں نے عرض کیا یا رسول اللہ ! آنحضرت صلی اللہ علیہ وسلم نے فرمایا پھر پانچ دن رکھا کر ۔ میں نے عرض کیا یا رسول اللہ ! فرمایا سات دن ۔ میں نے عرض کیا یا رسول اللہ ! فرمایا نودن ۔ میں نے عرض کیا یا رسول اللہ ! فرمایا گیارہ دن ۔ میں نے عرض کیا یا رسول اللہ ! فرمایا حضرت داؤ د علیہ السلام کے روزے سے زیادہ کوئی روزہ نہیں ہے ۔ زندگی کے نصف ایام ، ایک دن کا روزہ اور ایک دن بغیر روزہ کے رہنا ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 153820,
        "last_updated": null
    },
    {
        "urduURN": 4061930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6278,
        "hadithSanad": "مجھ سے یحییٰ بن جعفر نے بیان کیا ، کہا ہم سے یزید بن ہارون نے بیان کیا ، ان سے شعبہ نے ، ان سے مغیرہ بن مقسم نے ، ان سے ابراہیم نخعی نے اور ان سے علقمہ بن قیس نے کہ",
        "hadithText": "آپ ملک شام میں پہنچے ( دوسری سند ) امام بخاری نے کہا کہ اور مجھ سے ابوالولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے مغیرہ نے اور ان سے ابراہیم نے بیان کیا کہ علقمہ ملک شام گئے اور مسجد میں جا کر دو رکعت نماز پڑھی پھر یہ دعا کی اے اللہ ! مجھے ایک ہم نشین عطا فرما ۔ چنانچہ وہ ابودرداء رضی اللہ عنہ کی مجلس میں جابیٹھے ۔ ابودرداء رضی اللہ عنہ نے دریافت کیا ۔ تمہارا تعلق کہاں سے ہے ؟ کہا کہ اہل کوفہ سے ۔ پوچھا کیا تمہارے یہاں ( نفاق اور منافقین کے ) بھیدوں کے جاننے والے وہ صحابی نہیں ہیں جن کے سوا کوئی اور ان سے واقف نہیں ہے ۔ ان کااشارہ حذیفہ رضی اللہ عنہ کی طرف تھا ۔ کیا تمہارے یہاں وہ نہیں ہیں ( یا یوں کہا کہ ) تمہارے وہ جنہیں اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم کی زبانی شیطان سے پنا ہ دی تھی ۔ اشارہ عمار رضی اللہ عنہ کی طرف تھا ۔ کیا تمہارے یہاں مسواک اور گدے والے نہیں ہیں ؟ ان کا اشارہ ابن مسعود رضی اللہ عنہما کی طرف تھا ۔ عبداللہ بن مسعود رضی اللہ عنہما سورۃ ” واللیل اذا یغشیٰ “ کس طرح پڑھتے تھے ۔ علقمہ رضی اللہ عنہ نے کہا کہ وہ ” والذکر والانثیٰ “ پڑھتے تھے ۔ ابودرداء رضی اللہ عنہ نے اس پر کہا کہ یہ لوگ کوفہ والے اپنے مسلسل عمل سے قریب تھا کہ مجھے شبہ میں ڈال دیتے حالانکہ میں نے نبی کریم سے خود اسے سنا تھا ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 153830,
        "last_updated": null
    },
    {
        "urduURN": 4061940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6279,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے ابوحازم نے اور ان سے حضرت سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم کھانا اور قیلولہ نماز جمعہ کے بعد کیا کرتے تھے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 153840,
        "last_updated": null
    },
    {
        "urduURN": 4061950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6280,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے عبد العزیز بن حازم نے بیان کیا ، ان سے حضرت سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "حضرت علی رضی اللہ عنہ کو کوئی نام ” ابوتراب “ سے زیادہ محبوب نہیں تھا ۔ جب ان کو اس نام سے بلایا جاتا تو وہ خوش ہوتے تھے ۔ ایک مرتبہ رسول اللہ صلی اللہ علیہ وسلم حضرت فاطمہ علیہا السلام کے گھر تشریف لائے تو حضرت علی رضی اللہ عنہ کو گھر میں نہیں پایا تو فرمایا کہ بیٹی تمہارے چچا کے لڑکے ( اور شوہر ) کہاں گئے ہیں ؟ انہوں نے کہا میرے اور ان کے درمیان کچھ تلخ کلامی ہو گئی تھی وہ مجھ پر غصہ ہو کر باہر چلے گئے اور میرے یہاں ( گھر میں ) قیلولہ نہیں کیا ۔ آنحضرت صلی اللہ علیہ وسلم نے ایک شخص سے کہا کہ دیکھو وہ کہاں ہیں ۔ وہ صحابی واپس آئے اور عرض کیا یا رسول اللہ ! وہ تو مسجد میں سوئے ہوئے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم مسجد میں تشریف لائے تو حضرت علی رضی اللہ عنہ لیٹے ہوئے تھے اور چادر آپ کے پہلو سے گر گئی تھی اور گرد آلود ہو گئی تھی آنحضرت صلی اللہ علیہ وسلم اس سے مٹی صاف کرنے لگے اور فرمانے لگے ، ابوتراب ! ( مٹی والے ) اٹھو ، ابوتراب ! اٹھو ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 153850,
        "last_updated": null
    },
    {
        "urduURN": 4061960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6281,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے محمد بن عبداللہ انصاری نے ، کہا کہ مجھ سے میرے والد نے ، ان سے ثمامہ نے اور ان سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "( ان کی والدہ ) ام سلیم نبی کریم صلی اللہ علیہ وسلم کے لئے چمڑے کا فرش بچھا دیتی تھیں اور آنحضرت صلی اللہ علیہ وسلم ان کے یہاں اسی پرقیلولہ کر لیتے تھے ۔ بیان کیا پھر جب آنحضرت صلی اللہ علیہ وسلم سو گئے ( اور بیدار ہوئے ) تو ام سلیم رضی اللہ عنہا نے آنحضرت صلی اللہ علیہ وسلم کا پسینہ اور ( جھڑے ہوئے ) آپ کے بال لے لئے اور ( پسینہ کو ) ایک شیشی میں جمع کیا اور پھر سک ( ایک خوشبو ) میں اسے ملا لیا ۔ بیان کیا ہے کہ پھر جب انس بن مالک رضی اللہ عنہ کی وفات کا وقت قریب ہوا تو انہوں نے وصیت کی کہ اس سک ( جس میں آنحضرت صلی اللہ علیہ وسلم کا پسینہ ملاہوا تھا ) میں سے ان کے حنوط میں ملا دیا جائے ۔ بیان کیا ہے کہ پھر ان کے حنوط میں اسے ملا یا گیا ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 153860,
        "last_updated": null
    },
    {
        "urduURN": 4061970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام ما لک نے ، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے ۔ عبداللہ بن ابی طلحہ نے ان سے سناوہ بیان کرتے تھے کہ",
        "hadithText": "جب رسول اللہ صلی اللہ علیہ وسلم قباء تشریف لے جاتے تھے تو ام حرام بنت ملحان رضی اللہ عنہا کے گھر بھی جاتے تھے اور وہ آنحضرت صلی اللہ علیہ وسلم کو کھانا کھلاتی تھیں پھر آنحضرت صلی اللہ علیہ وسلم سو گئے اور بیدار ہوئے تو آپ ہنس رہے تھے ۔ ام حرام رضی اللہ عنہا نے بیان کیا کہ میں نے پوچھا یا رسول اللہ ! آپ کس بات پر ہنس رہے ہیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میری امت کے کچھ لوگ اللہ کے راستے میں غزوہ کرتے ہوئے میرے سامنے ( خواب میں ) پیش کئے گئے ، جو اس سمندر کے اوپر ( کشتیوں میں ) سوار ہوں گے ( جنت میں وہ ایسے نظر آئے ) جیسے بادشاہ تخت پر ہوتے ہیں ، یا بیان کیا کہ بادشاہوں کی طرح تخت پر ۔ اسحاق کو ان لفظوں میں ذرا شبہ تھا ( ام حرام رضی اللہ عنہا نے بیان کیا کہ ) میں نے عرض کیا آنحضرت صلی اللہ علیہ وسلم دعا کریں کہ اللہ مجھے بھی ان میں سے بنائے ۔ آنحضرت صلی اللہ علیہ وسلم نے دعا کی پھر آنحضرت صلی اللہ علیہ وسلم اپنا سر رکھ کر سو گئے اور جب بیدا ر ہوئے تو ہنس رہے تھے ۔ میں نے کہا یا رسول اللہ ! آپ کس بات پر ہنس رہے ہیں ؟ فرمایا کہ میری امت کے کچھ لوگ اللہ کے راستہ میں غزوہ کرتے ہوئے میرے سامنے پیش کئے گئے جو اس سمند ر کے اوپر سوار ہوں گے جیسے بادشاہ تحت پر ہوتے ہیں یا مثل بادشاہوں کے تخت پر ۔ میں نے عرض کیا کہ اللہ سے میرے لئے دعا کیجئے کہ مجھے بھی ان میں سے کر دے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تو اس گروہ کے سب سے پہلے لوگوں میں ہو گی چنانچہ ام حرام رضی اللہ عنہا نے ( معاویہ رضی اللہ عنہ کی شام پر گورنری کے زمانہ میں ) سمندری سفر کیا اور خشکی پر اترنے کے بعد اپنی سواری سے گر پڑیں اور وفات پا گئیں ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 153870,
        "last_updated": null
    },
    {
        "urduURN": 4061980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6284,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، انہوں نے کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے زہری نے بیان کیا ، ان سے عطاء بن یزید لیثی نے اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے دو طرح کے پہناوے سے اور دو طرح کی خریدوفروخت سے منع فرمایا تھا ۔ اشتمال صماء اور ایک کپڑے میں اس طرح احتباء کرنے سے کہ انسان کی شرمگاہ پر کوئی چیز نہ ہو اور ملامست اور منابذت سے ۔ اس روایت کی متابعت معمر ، محمد بن ابی حفصہ اور عبداللہ بن بدیل نے زہری سے کی ہے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 153880,
        "last_updated": null
    },
    {
        "urduURN": 4061990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ابو عوانہ وضاح نے ، کہا ہم سے فراس بن یحییٰ نے بیان کیا ، ان سے عامر شعبی نے ، ان سے مسروق نے کہ مجھ سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "یہ تمام ازواج مطہرات ( حضو ر اکرم صلی اللہ علیہ وسلم کے مرض وفات میں ) آنحضرت صلی اللہ علیہ وسلم کے پاس تھیں ، کوئی وہاں سے نہیں ہٹا تھا کہ حضرت فاطمہ رضی اللہ عنہا چلتی ہوئی آئیں ۔ خدا کی قسم ان کی چال رسول اللہ صلی اللہ علیہ وسلم کی چال سے الگ نہیں تھی ( بلکہ بہت ہی مشابہ تھی ) جب حضور اکرم صلی اللہ علیہ وسلم نے انہیں دیکھا تو خوش آمدید کہا ۔ فرمایا بیٹی ! مرحبا ! پھر آنحضرت صلی اللہ علیہ وسلم نے اپنی دائیں طرف یا بائیں طرف انہیں بٹھایا ۔ اس کے بعد آہستہ سے ان سے کچھ کہا اور حضرت فاطمہ رضی اللہ عنہا بہت زیادہ رونے لگیں ۔ جب آنحضرت صلی اللہ علیہ وسلم نے ان کا غم دیکھا تو دوبارہ ان سے سرگوشی کی اس پر وہ ہنسنے لگیں ۔ تمام ازواج میں سے میں نے ان سے کہا کہ حضور اکرم صلی اللہ علیہ وسلم نے ہم میں صرف آپ کو سرگوشی کی خصوصیت بخشی ۔ پھر رونے لگیں ۔ جب آنحضرت صلی اللہ علیہ وسلم اٹھے تو میں نے ان سے پوچھا کہ آپ کے کان میں آنحضرت صلی اللہ علیہ وسلم نے کیا فرمایا تھا انہوں نے کہا کہ میں آنحضرت صلی اللہ علیہ وسلم کا راز نہیں کھول سکتی ۔ پھر جب آپ کی وفات ہو گئی تو میں نے حضرت فاطمہ رضی اللہ عنہا سے کہا کہ میرا جو حق آپ پر ہے اس کا واسطہ دیتی ہوں کہ آپ مجھے وہ بات بتا دیں ۔ انہوں نے کہا کہ اب بتا سکتی ہوں چنانچہ انہوں نے مجھے بتایا کہ جب آنحضور صلی اللہ علیہ وسلم نے مجھ سے پہلی سرگوشی کی تھی تو فرمایا تھا کہ ” جبرائیل علیہ السلام ہر سال مجھ سے سال میں ایک مرتبہ دور کیا کرتے تھے لیکن اس سال مجھ سے انہوں نے دو مرتبہ دور کیا اور میرا خیال ہے کہ میری وفات کا وقت قریب ہے ، اللہ سے ڈرتی رہنا اور صبر کرنا کیونکہ میں تمہارے لئے ایک اچھا آگے جانے والا ہوں “ بیان کیا کہ اس وقت میرا رونا جو آپ نے دیکھا تھا اس کی وجہ یہی تھی ۔ جب آنحضرت صلی اللہ علیہ وسلم نے میری پریشانی دیکھی تو آپ نے دوبارہ مجھ سے سرگوشی کی ، فرمایا ” فاطمہ بیٹی ! کیا تم اس پر خوش نہیں ہو کہ جنت میں تم مومنوں کی عورتوں کی سردار ہو گی ، یا ( فرمایا کہ ) اس امت کی عورتوں کی سردارہو گی ۔ “</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 153891,
        "last_updated": null
    },
    {
        "urduURN": 4062000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6287,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، کہا ہم سے زہری نے بیان کیا ، کہا کہ مجھے عباد بن تمیم نے خبر دی ، ان سے ان کے چچا نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کومسجد میں چت لیٹے دیکھا آپ ایک پاؤ ں دوسرے پر رکھے ہوئے تھے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 153910,
        "last_updated": null
    },
    {
        "urduURN": 4062010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6288,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام ما لک نے خبر دی ( دوسری سند ) حضرت امام بخاری نے کہا کہ ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے نافع نے اور ان سے حضرت عبداللہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب تین آدمی ساتھ ہوں تو تیسرے ساتھی کو چھوڑ کر دو آپس میں کانا پھوسی نہ کریں ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 153920,
        "last_updated": null
    },
    {
        "urduURN": 4062020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6289,
        "hadithSanad": "ہم سے عبداللہ بن صباح نے بیان کیا ، کہا ہم سے معتمر بن سلیمان نے بیان کیا ، کہا کہ میں نے اپنے والد سے سنا کہ میں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے ایک راز کی بات کہی تھی اور میں نے وہ راز کسی کو نہیں بتایا ( ان کی والدہ ) حضرت ام سلیم رضی اللہ عنہا نے بھی مجھ سے اس کے متعلق پوچھا لیکن میں نے انہیں بھی نہیں بتایا ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 153930,
        "last_updated": null
    },
    {
        "urduURN": 4062030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6290,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے جریر بن عبدالحمید نے بیان کیا ، ان سے منصور بن معتمر نے ، ان سے ابووائل نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب تین آدمی ہو تو تیسرے ساتھی کو چھوڑ کر تم آپس میں کانا پھونسی نہ کیا کرو ۔ اس لئے کہ لوگو ں کو رنج ہو گا البتہ اگر دوسرے آدمی بھی ہوں تو مضائقہ نہیں ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 153940,
        "last_updated": null
    },
    {
        "urduURN": 4062040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6291,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، ان سے ابوحمزہ محمد بن میمون نے ، ان سے اعمش نے ، ان سے شقیق نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک مرتبہ کچھ مال تقسیم فرمایا اس پر انصار کے ایک شخص نے کہا کہ یہ ایسی تقسیم ہے جس سے اللہ کی خوشنودی مقصود نہ تھی میں نے کہا کہ ہاں ! اللہ کی قسم میں حضور اکرم صلی اللہ علیہ وسلم کی خدمت میں جاؤں گا ۔ چنانچہ میں گیا آنحضرت صلی اللہ علیہ وسلم اس وقت مجلس میں بیٹھے ہوئے تھے میں نے آنحضرت صلی اللہ علیہ وسلم کے کان میں چپکے سے یہ بات کہی تو آپ غصہ ہو گئے اور آپ کا چہرہ سرخ ہوگیاپھر آپ نے فرمایا کہ موسیٰ علیہ السلام پر اللہ کی رحمت ہو انہیں اس سے بھی زیادہ تکلیف پہنچا ئی گئی لیکن انہوں نے صبر کیا ( پس میں بھی صبر کروں گا )</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 153950,
        "last_updated": null
    },
    {
        "urduURN": 4062050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6292,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے محمد بن جعفر نے بیان کیا ، ہم سے شعبہ نے بیان کیا ، ان سے عبد العزیز بن صہیب اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "نماز کی تکبیر کہی گئی اور ایک صحابی رسول صلی اللہ علیہ وسلم سے سرگوشی کرتے رہے ، پھر وہ دیر تک سرگوشی کرتے رہے یہاں تک کہ آپ کے صحابہ سونے لگے اس کے بعد آپ اٹھے اور نماز پڑھائی ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 153960,
        "last_updated": null
    },
    {
        "urduURN": 4062060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6293,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے زہری نے ، ان سے سالم نے ، ان سے ان کے والد نے",
        "hadithText": "اور ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب سونے لگو تو گھر میں آگ نہ چھوڑو ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 153970,
        "last_updated": null
    },
    {
        "urduURN": 4062070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6294,
        "hadithSanad": "ہم سے محمد بن علاء نے بیان کیا ، انہوں نے کہا ہم سے ابواسامہ نے بیان کیا ، ہم سے بریدبن عبداللہ نے بیان کیا ، ان سے ابو بر دہ نے بیان کیا اور ان سے حضرت ابو مو سیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "مدینہ منورہ میں ایک گھر رات کے وقت جل گیا ۔ نبی کریم صلی اللہ علیہ وسلم سے اس کے متعلق کہا گیا تو آپ نے فر مایا کہ آ گ تمہاری دشمن ہے اس لئے جب سو نے لگو تو اسے بجھا دیا کرو ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 153980,
        "last_updated": null
    },
    {
        "urduURN": 4062080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6295,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے حماد بن زید نے بیان کیا ، ان سے کثیر بن شنطیرنے بیان کیا ، ان سے عطاء  بن ابی رباح نے بیان کیا ، ان سے حضرت جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا ، کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فر مایا ( سو تے وقت ) بر تن ڈھک لیا کرو ورنہ دروازے بند کر لیا کرو اور چراغ بجھا لیا کرو کیو نکہ یہ چوہا بعض اوقات چراغ کی بتی کھینچ لیتا ہے اور گھر والوں کو جلا دیتا ہے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 153990,
        "last_updated": null
    },
    {
        "urduURN": 4062090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6296,
        "hadithSanad": "ہم سے حسان بن ابی عباد نے بیان کیا ، انہوں نے کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، ان سے عطاء بن ابی رباح نے اور ان سے حضرت جابر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب رات میں سونے لگو تو چراغ بجھا دیا کرو اور دروازے بند کر لیا کرو اور مشکیزوں کا منہ باندھ دیا کرو اور کھانے پینے کی چیزیں ڈھک دیا کرو ۔ حماد نے کہا کہ میرا خیال ہے کہ یہ بھی فرمایا کہ ” اگرچہ ایک لکڑی سے ہی ہو “</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 154000,
        "last_updated": null
    },
    {
        "urduURN": 4062100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6297,
        "hadithSanad": "ہم سے یحییٰ بن قزعہ نے بیان کیا ، انہوں نے کہا ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے ابن شہاب نے ، ان سے سعید بن مسیب نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا پانچ چیزیں فطرت سے ہیں ، ختنہ کرنا ، زیرناف کے بال بنانا ، بغل کے بال صاف کرنا ، مونچھ چھوٹی کرانا اور ناخن کاٹنا ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 154010,
        "last_updated": null
    },
    {
        "urduURN": 4062110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6298,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب بن ابی حمزہ نے خبر دی ، انہوں نے کہا ہم سے ابوالزناد نے بیان کیا ، ان سے اعرج نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا حضرت ابراہیم علیہ السلام نے اسی ( 80 ) سال کی عمر میں ختنہ کرایا اور آپ نے قدوم ( تخفیف کے ساتھ ) ( کلہاڑی ) سے ختنہ کیا ۔ ہم سے قتیبہ نے بیان کیا ، کہا ہم سے مغیرہ نے بیان کیا اور ان سے بو الزناد نے بالقدوم ( تشدید کے ساتھ بیان کیا )</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 154020,
        "last_updated": null
    },
    {
        "urduURN": 4062120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6299,
        "hadithSanad": "ہم سے محمد بن عبد الرحیم نے بیان کیا ، کہا ہم کو عباد بن موسیٰ نے خبر دی ، کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، کہا ہم سے اسرائیل نے ، ان سے ابواسحاق نے ، ان سے سعید بن جبیر نے کہ",
        "hadithText": "حضرت ابن عباس رضی اللہ عنہما سے پوچھا گیا کہ جب نبی کریم صلی اللہ علیہ وسلم کی وفات ہوئی تو آپ کی عمر کیا تھی ؟ کہا کہ ان دنوں میرا ختنہ ہو چکا تھا اور عرب لوگوں کی عادت تھی جب تک لڑکا جوانی کے قریب نہ ہوتا اس کا ختنہ نہ کرتے تھے</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 154030,
        "last_updated": null
    },
    {
        "urduURN": 4062130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6300,
        "hadithSanad": "اور عبداللہ ابن ادریس بن یزید نے اپنے والد سے بیان کیا ، ان سے ابواسحاق نے ، ان سے سعید بن جبیر نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم کی وفات ہوئی تو میرا ختنہ ہو چکا تھا ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 154040,
        "last_updated": null
    },
    {
        "urduURN": 4062140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6301,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے بیان کیا ، کہا کہ مجھے حمید بن عبدالرحمٰن نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تم میں سے جس نے قسم کھائی اور کہا کہ ” لات وعزیٰ کی قسم ، تو پھر وہ لا الٰہ الا اللہ کہے اور جس نے اپنے ساتھی سے کہا کہ آؤ جوا کھیلیں تو اسے صدقہ کر دینا چاہئے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 154050,
        "last_updated": null
    },
    {
        "urduURN": 4062150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6302,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے اسحاق نے بیان کیا وہ سعید کے بیٹے ہیں ، ان سے سعید نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں اپنے ہاتھوں سے ایک گھر بنایا تاکہ بارش سے حفاظت رہے اور دھوپ سے سایہ حاصل ہواللہ کی مخلوق میں سے کسی نے اس کام میں میری مدد نہیں کی ۔ معلوم ہوا کہ ضرورت کے لائق گھر بنانا درست ہے ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 154060,
        "last_updated": null
    },
    {
        "urduURN": 4062160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 79,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6303,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے ابوسفیان ثوری نے ، ان سے عمرو بن نشارنے اور ان سے ابن عمر رضی اللہ عنہما نے کہا کہ",
        "hadithText": "واللہ نبی کریم صلی اللہ علیہ وسلم کی وفات کے بعد نہ میں نے کوئی اینٹ کسی اینٹ پر رکھی اور نہ کوئی باغ لگایا ۔ سفیان نے بیان کیا کہ جب میں نے اس کا ذکر ابن عمر رضی اللہ عنہما کے بعض گھرانوں کے سامنے کیا تو انہوں نے کہا کہ اللہ کی قسم انہوں نے گھر بنایا تھا ۔ سفیان نے بیان کیا کہ میں نے کہا پھر یہ بات ابن عمر رضی اللہ عنہما نے گھر بنانے سے پہلے کہی ہو گی ۔</b>",
        "bookID": "79.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 154070,
        "last_updated": null
    }
]