[
    {
        "urduURN": 4003500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 349,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انھوں نے کہا ہم سے لیث بن سعد نے یونس کے واسطہ سے بیان کیا ، انھوں نے ابن شہاب سے ، انھوں نے انس بن مالک سے ، انھوں نے فرمایا کہ ابوذر غفاری رضی اللہ عنہ یہ حدیث بیان کرتے تھے کہ",
        "hadithText": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میرے گھر کی چھت کھول دی گئی ، اس وقت میں مکہ میں تھا ۔ پھر جبرائیل علیہ السلام اترے اور انھوں نے میرا سینہ چاک کیا ۔ پھر اسے زمزم کے پانی سے دھویا ۔ پھر ایک سونے کا طشت لائے جو حکمت اور ایمان سے بھرا ہوا تھا ۔ اس کو میرے سینے میں رکھ دیا ، پھر سینے کو جوڑ دیا ، پھر میرا ہاتھ پکڑا اور مجھے آسمان کی طرف لے کر چلے ۔ جب میں پہلے آسمان پر پہنچا تو جبرائیل علیہ السلام نے آسمان کے داروغہ سے کہا کھولو ۔ اس نے پوچھا ، آپ کون ہیں ؟ جواب دیا کہ جبرائیل ، پھر انھوں نے پوچھا کیا آپ کے ساتھ کوئی اور بھی ہے ؟ جواب دیا ، ہاں میرے ساتھ محمد ( صلی اللہ علیہ وسلم ) ہیں ۔ انھوں نے پوچھا کہ کیا ان کے بلانے کے لیے آپ کو بھیجا گیا تھا ؟ کہا ، جی ہاں ! پھر جب انھوں نے دروازہ کھولا تو ہم پہلے آسمان پر چڑھ گئے ، وہاں ہم نے ایک شخص کو بیٹھے ہوئے دیکھا ۔ ان کے داہنی طرف کچھ لوگوں کے جھنڈ تھے اور کچھ جھنڈ بائیں طرف تھے ۔ جب وہ اپنی داہنی طرف دیکھتے تو مسکرا دیتے اور جب بائیں طرف نظر کرتے تو روتے ۔ انھوں نے مجھے دیکھ کر فرمایا ، آؤ اچھے آئے ہو ۔ صالح نبی اور صالح بیٹے ! میں نے جبرائیل علیہ السلام سے پوچھا یہ کون ہیں ؟ انھوں نے کہا کہ یہ آدم علیہ السلام ہیں اور ان کے دائیں بائیں جو جھنڈ ہیں یہ ان کے بیٹوں کی روحیں ہیں ۔ جو جھنڈ دائیں طرف ہیں وہ جنتی ہیں اور بائیں طرف کے جھنڈ دوزخی روحیں ہیں ۔ اس لیے جب وہ اپنے دائیں طرف دیکھتے ہیں تو خوشی سے مسکراتے ہیں اور جب بائیں طرف دیکھتے ہیں تو ( رنج سے ) روتے ہیں ۔ پھر جبرائیل مجھے لے کر دوسرے آسمان تک پہنچے اور اس کے داروغہ سے کہا کہ کھولو ۔ اس آسمان کے داروغہ نے بھی پہلے کی طرح پوچھا پھر کھول دیا ۔ حضرت انس نے کہا کہ ابوذر نے ذکر کیا کہ آپ صلی اللہ علیہ وسلم یعنی نبی کریم صلی اللہ علیہ وسلم نے آسمان پر آدم ، ادریس ، موسیٰ ، عیسیٰ اور ابراہیم علیہم السلام کو موجود پایا ۔ اور ابوذر رضی اللہ عنہ نے ہر ایک کا ٹھکانہ نہیں بیان کیا ۔ البتہ اتنا بیان کیا کہ آنحضور صلی اللہ علیہ وسلم نے حضرت آدم کو پہلے آسمان پر پایا اور حضرت ابراہیم علیہ السلام کو چھٹے آسمان پر ۔ انس نے بیان کیا کہ جب جبرائیل علیہ السلام نبی کریم صلی اللہ علیہ وسلم کے ساتھ ادریس علیہ السلام پر گزرے ۔ تو انھوں نے فرمایا کہ آؤ اچھے آئے ہو صالح نبی اور صالح بھائی ۔ میں نے پوچھا یہ کون ہیں ؟ جواب دیا کہ یہ ادریس علیہ السلام ہیں ۔ پھر موسیٰ علیہ السلام تک پہنچا تو انھوں نے فرمایا آؤ اچھے آئے ہو صالح نبی اور صالح بھائی ۔ میں نے پوچھا یہ کون ہیں ؟ جبرائیل علیہ السلام نے بتایا کہ موسیٰ علیہ السلام ہیں ۔ پھر میں عیسیٰ علیہ السلام تک پہنچا ، انھوں نے کہا آؤ اچھے آئے ہو صالح نبی اور صالح بھائی ۔ میں نے پوچھا یہ کون ہیں ؟ جبرائیل علیہ السلام نے بتایا کہ یہ عیسیٰ علیہ السلام ہیں ۔ پھر میں ابراہیم علیہ السلام تک پہنچا ۔ انھوں نے فرمایا آؤ اچھے آئے ہو صالح نبی اور صالح بیٹے ۔ میں نے پوچھا یہ کون ہیں ؟ جبرائیل علیہ السلام نے بتایا کہ یہ حضرت ابراہیم علیہ السلام ہیں ۔ ابن شہاب نے کہا کہ مجھے ابوبکر بن حزم نے خبر دی کہ عبداللہ بن عباس اور ابوحبۃ الانصاری رضی اللہ عنہم کہا کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، پھر مجھے جبرائیل علیہ السلام لے کر چڑھے ، اب میں اس بلند مقام تک پہنچ گیا جہاں میں نے قلم کی آواز سنی ( جو لکھنے والے فرشتوں کی قلموں کی آواز تھی ) ابن حزم نے ( اپنے شیخ سے ) اور انس بن مالک نے ابوذر رضی اللہ عنہ سے نقل کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ پس اللہ تعالیٰ نے میری امت پر پچاس وقت کی نمازیں فرض کیں ۔ میں یہ حکم لے کر واپس لوٹا ۔ جب موسیٰ علیہ السلام تک پہنچا تو انھوں نے پوچھا کہ آپ کی امت پر اللہ نے کیا فرض کیا ہے ؟ میں نے کہا کہ پچاس وقت کی نمازیں فرض کی ہیں ۔ انھوں نے فرمایا آپ واپس اپنے رب کی بارگاہ میں جائیے ۔ کیونکہ آپ کی امت اتنی نمازوں کو ادا کرنے کی طاقت نہیں رکھتی ہے ۔ میں واپس بارگاہ رب العزت میں گیا تو اللہ نے اس میں سے ایک حصہ کم کر دیا ، پھر موسیٰ علیہ السلام کے پاس آیا اور کہا کہ ایک حصہ کم کر دیا گیا ہے ، انھوں نے کہا کہ دوبارہ جائیے کیونکہ آپ کی امت میں اس کے برداشت کی بھی طاقت نہیں ہے ۔ پھر میں بارگاہ رب العزت میں حاضر ہوا ۔ پھر ایک حصہ کم ہوا ۔ جب موسیٰ علیہ السلام کے پاس پہنچا تو انھوں نے فرمایا کہ اپنے رب کی بارگاہ میں پھر جائیے ، کیونکہ آپ کی امت اس کو بھی برداشت نہ کر سکے گی ، پھر میں باربار آیا گیا پس اللہ تعالیٰ نے فرمایا کہ یہ نمازیں ( عمل میں ) پانچ ہیں اور ( ثواب میں ) پچاس ( کے برابر ) ہیں ۔ میری بات بدلی نہیں جاتی ۔ اب میں موسیٰ علیہ السلام کے پاس آیا تو انھوں نے پھر کہا کہ اپنے رب کے پاس جائیے ۔ لیکن میں نے کہا مجھے اب اپنے رب سے شرم آتی ہے ۔ پھر جبرائیل مجھے سدرۃالمنتہیٰ تک لے گئے جسے کئی طرح کے رنگوں نے ڈھانک رکھا تھا ۔ جن کے متعلق مجھے معلوم نہیں ہوا کہ وہ کیا ہیں ۔ اس کے بعد مجھے جنت میں لے جایا گیا ، میں نے دیکھا کہ اس میں موتیوں کے ہار ہیں اور اس کی مٹی مشک کی ہے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 103500,
        "last_updated": null
    },
    {
        "urduURN": 4003510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 350,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انھوں نے کہا ہمیں خبر دی امام مالک نے صالح بن کیسان سے ، انھوں نے عروہ بن زبیر سے ، انھوں نے ام المؤمنین حضرت عائشہ رضی اللہ عنہا سے ، آپ نے فرمایا کہ",
        "hadithText": "اللہ تعالیٰ نے پہلے نماز میں دو دو رکعت فرض کی تھی ۔ سفر میں بھی اور اقامت کی حالت میں بھی ۔ پھر سفر کی نماز تو اپنی اصلی حالت پر باقی رکھی گئی اور حالت اقامت کی نمازوں میں زیادتی کر دی گئی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 103510,
        "last_updated": null
    },
    {
        "urduURN": 4003520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 351,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے یزید بن ابراہیم نے بیان کیا ، وہ محمد سے ، وہ ام عطیہ سے ، انھوں نے فرمایا کہ",
        "hadithText": "ہمیں حکم ہوا کہ ہم عیدین کے دن حائضہ اور پردہ نشین عورتوں کو بھی باہر لے جائیں ۔ تاکہ وہ مسلمانوں کے اجتماع اور ان کی دعاؤں میں شریک ہو سکیں ۔ البتہ حائضہ عورتوں کو نماز پڑھنے کی جگہ سے دور رکھیں ۔ ایک عورت نے کہا یا رسول اللہ ! ہم میں بعض عورتیں ایسی بھی ہوتی ہیں جن کے پاس ( پردہ کرنے کے لیے ) چادر نہیں ہوتی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کی ساتھی عورت اپنی چادر کا ایک حصہ اسے اڑھا دے ۔ اور عبداللہ بن رجاء نے کہا ہم سے عمران قطان نے بیان کیا ، کہا ہم سے محمد بن سیرین نے ، کہا ہم سے ام عطیہ نے ، میں نے آنحضرت صلی اللہ علیہ وسلم سے سنا اور یہی حدیث بیان کی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 103521,
        "last_updated": null
    },
    {
        "urduURN": 4003530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 352,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، انھوں نے کہا ہم سے عاصم بن محمد نے بیان کیا ، انھوں نے کہا کہ مجھ سے واقد بن محمد نے محمد بن منکدر کے حوالہ سے بیان کیا ، انھوں نے کہا کہ",
        "hadithText": "حضرت جابر بن عبداللہ رضی اللہ عنہ نے تہبند باندھ کر نماز پڑھی ۔ جسے انھوں نے سر تک باندھ رکھا تھا اور آپ کے کپڑے کھونٹی پر ٹنگے ہوئے تھے ۔ ایک کہنے والے نے کہا کہ آپ ایک تہبند میں نماز پڑھتے ہیں ؟ آپ نے جواب دیا کہ میں نے ایسا اس لیے کیا کہ تجھ جیسا کوئی احمق مجھے دیکھے ۔ بھلا رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں دو کپڑے بھی کس کے پاس تھے ؟</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 103540,
        "last_updated": null
    },
    {
        "urduURN": 4003540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 353,
        "hadithSanad": "ہم سے ابومصعب بن عبداللہ مطرف نے بیان کیا ، انھوں نے کہا ہم سے عبدالرحمٰن بن ابی الموالی نے بیان کیا ، انھوں نے محمد بن منکدر سے ، انھوں نے کہا کہ",
        "hadithText": "میں نے جابر رضی اللہ عنہ کو ایک کپڑے میں نماز پڑھتے دیکھا اور انھوں نے بتلایا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو بھی ایک ہی کپڑے میں نماز پڑھتے دیکھا تھا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 103550,
        "last_updated": null
    },
    {
        "urduURN": 4003550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 354,
        "hadithSanad": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے اپنے والد کے حوالہ سے بیان کیا ، وہ عمر بن ابی سلمہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک کپڑے میں نماز پڑھی اور آپ نے کپڑے کے دونوں کناروں کو مخالف طرف کے کاندھے پر ڈال لیا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 103560,
        "last_updated": null
    },
    {
        "urduURN": 4003560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 355,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، انھوں نے کہا ہم سے یحییٰ نے بیان کیا ، انھوں نے کہا کہ ہم سے ہشام نے بیان کیا ، انھوں نے کہا کہ مجھ سے میرے والد نے عمر بن ابی سلمہ سے نقل کر کے بیان کیا کہ",
        "hadithText": "انھوں نے نبی کریم صلی اللہ علیہ وسلم کو ام سلمہ کے گھر میں ایک کپڑے میں نماز پڑھتے دیکھا ، کپڑے کے دونوں کناروں کو آپ نے دونوں کاندھوں پر ڈال رکھا تھا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 103570,
        "last_updated": null
    },
    {
        "urduURN": 4003570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 356,
        "hadithSanad": "ہم سے عبید بن اسماعیل نے بیان کیا ، انھوں نے کہا کہ ہم سے ابواسامہ نے ہشام کے واسطے سے بیان کیا ، وہ اپنے والد سے جن کو عمر بن ابی سلمہ نے خبر دی ، انھوں نے کہا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو حضرت ام سلمہ رضی اللہ عنہا کے گھر میں ایک کپڑے میں نماز پڑھتے ہوئے دیکھا ۔ آپ اسے لپیٹے ہوئے تھے اور اس کے دونوں کناروں کو دونوں کاندھوں پر ڈالے ہوئے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 103580,
        "last_updated": null
    },
    {
        "urduURN": 4003580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 357,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا مجھ سے امام مالک بن انس نے عمر بن عبیداللہ کے غلام ابونضر سالم بن امیہ سے کہ ام ہانی بنت ابی طالب کے غلام ابومرہ یزید نے بیان کیا کہ انھوں نے ام ہانی بنت ابی طالب سے یہ سنا ۔ وہ فرماتی تھیں کہ",
        "hadithText": "میں فتح مکہ کے موقع پر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی ۔ میں نے دیکھا کہ آپ غسل کر رہے ہیں اور آپ کی صاحبزادی فاطمہ رضی اللہ عنہا پردہ کئے ہوئے ہیں ۔ انھوں نے کہا کہ میں نے آنحضور صلی اللہ علیہ وسلم کو سلام کیا ۔ آپ صلی اللہ علیہ وسلم نے پوچھا کہ کون ہے ؟ میں نے بتایا کہ ام ہانی بنت ابی طالب ہوں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا اچھی آئی ہو ، ام ہانی ۔ پھر جب آپ صلی اللہ علیہ وسلم نہانے سے فارغ ہو گئے تو اٹھے اور آٹھ رکعت نماز پڑھی ، ایک ہی کپڑے میں لپٹ کر ۔ جب آپ صلی اللہ علیہ وسلم نماز پڑھ چکے تو میں نے عرض کی کہ یا رسول اللہ ! میری ماں کے بیٹے ( حضرت علی بن ابی طالب ) کا دعویٰ ہے کہ وہ ایک شخص کو ضرور قتل کرے گا ۔ حالانکہ میں نے اسے پناہ دے رکھی ہے ۔ یہ ( میرے خاوند ) ہبیرہ کا فلاں بیٹا ہے ۔ رسول کریم صلی اللہ علیہ وسلم نے فرمایا کہ ام ہانی جسے تم نے پناہ دے دی ، ہم نے بھی اسے پناہ دی ۔ ام ہانی نے کہا کہ یہ نماز چاشت تھی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 103590,
        "last_updated": null
    },
    {
        "urduURN": 4003590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 358,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انھوں نے کہا ہمیں امام مالک نے ابن شہاب کے حوالہ سے خبر دی ، وہ سعید بن مسیب سے نقل کرتے ہیں ، وہ حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "ایک پوچھنے والے نے رسول اللہ صلی اللہ علیہ وسلم سے ایک کپڑے میں نماز پڑھنے کے متعلق پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا ( کچھ برا نہیں ) بھلا کیا تم سب میں ہر شخص کے پاس دو کپڑے ہیں ؟</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 103600,
        "last_updated": null
    },
    {
        "urduURN": 4003600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 359,
        "hadithSanad": "ہم سے ابوعاصم ضحاک بن مخلد نے امام مالک رحمہ اللہ کے حوالہ سے بیان کیا ، انھوں نے ابوالزناد سے ، انھوں نے عبدالرحمٰن اعرج سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ کسی شخص کو بھی ایک کپڑے میں نماز اس طرح نہ پڑھنی چاہیے کہ اس کے کندھوں پر کچھ نہ ہو ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 103610,
        "last_updated": null
    },
    {
        "urduURN": 4003610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 360,
        "hadithSanad": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، کہا ہم سے شیبان بن عبدالرحمٰن نے یحییٰ بن ابی کثیر کے واسطہ سے ، انھوں نے عکرمہ سے ، یحییٰ نے کہا میں نے عکرمہ سے سنایا میں نے ان سے پوچھا تھا تو عکرمہ نے کہا کہ",
        "hadithText": "میں نے ابوہریرہ رضی اللہ عنہ سے سنا ، وہ فرماتے تھے ۔ میں اس کی گواہی دیتا ہوں کہ رسول اللہ صلی اللہ علیہ وسلم کو میں نے یہ ارشاد فرماتے سنا تھا کہ جو شخص ایک کپڑے میں نماز پڑھے اسے کپڑے کے دونوں کناروں کو اس کے مخالف سمت کے کندھے پر ڈال لینا چاہیے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 103620,
        "last_updated": null
    },
    {
        "urduURN": 4003620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 361,
        "hadithSanad": "ہم سے یحییٰ بن صالح نے بیان کیا ، کہا ہم سے فلیح بن سلیمان نے ، وہ سعید بن حارث سے ، کہا ہم نے جابر بن عبداللہ سے ایک کپڑے میں نماز پڑھنے کے بارے میں پوچھا ۔ تو آپ نے فرمایا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک سفر ( غزوہ بواط ) میں گیا ۔ ایک رات میں کسی ضرورت کی وجہ سے آپ کے پاس آیا ۔ میں نے دیکھا کہ آپ صلی اللہ علیہ وسلم نماز میں مشغول ہیں ، اس وقت میرے بدن پر صرف ایک ہی کپڑا تھا ۔ اس لیے میں نے اسے لپیٹ لیا اور آپ کے بازو میں ہو کر میں بھی نماز میں شریک ہو گیا ۔ جب آپ نماز سے فارغ ہوئے تو دریافت فرمایا جابر اس رات کے وقت کیسے آئے ؟ میں نے آپ صلی اللہ علیہ وسلم سے اپنی ضرورت کے متعلق کہا ۔ میں جب فارغ ہو گیا تو آپ صلی اللہ علیہ وسلم نے پوچھا کہ یہ تم نے کیا لپیٹ رکھا تھا جسے میں نے دیکھا ۔ میں نے عرض کی کہ ( ایک ہی ) کپڑا تھا ( اس طرح نہ لپیٹتا تو کیا کرتا ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر وہ کشادہ ہو تو اسے اچھی طرح لپیٹ لیا کر اور اگر تنگ ہو تو اس کو تہبند کے طور پر باندھ لیا کر ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 103630,
        "last_updated": null
    },
    {
        "urduURN": 4003630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 362,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے ، انھوں نے سفیان ثوری سے ، انھوں نے کہا مجھ سے ابوحازم سلمہ بن دینار نے بیان کیا سہل بن سعد ساعدی سے ، انھوں نے کہا کہ",
        "hadithText": "کئی آدمی نبی کریم صلی اللہ علیہ وسلم کے ساتھ بچوں کی طرح اپنی گردنوں پر ازاریں باندھے ہوئے نماز پڑھتے تھے اور عورتوں کو ( آپ کے زمانے میں ) حکم تھا کہ اپنے سروں کو ( سجدے سے ) اس وقت تک نہ اٹھائیں جب تک مرد سیدھے ہو کر بیٹھ نہ جائیں ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 103640,
        "last_updated": null
    },
    {
        "urduURN": 4003640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 363,
        "hadithSanad": "ہم سے یحییٰ بن موسیٰ نے بیان کیا ، کہا ہم سے ابومعاویہ نے اعمش کے واسطہ سے ، انھوں نے مسلم بن صبیح سے ، انھوں نے مسروق بن اجدع سے ، انھوں نے مغیرہ بن شعبہ سے ، آپ نے فرمایا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک سفر ( غزوہ تبوک ) میں تھا ۔ آپ نے ایک موقع پر فرمایا ۔ مغیرہ ! پانی کی چھاگل اٹھا لے ۔ میں نے اسے اٹھا لیا ۔ پھر رسول اللہ صلی اللہ علیہ وسلم چلے اور میری نظروں سے چھپ گئے ۔ آپ نے قضائے حاجت کی ۔ اس وقت آپ شامی جبہ پہنے ہوئے تھے ۔ آپ ہاتھ کھولنے کے لیے آستین اوپر چڑھانی چاہتے تھے لیکن وہ تنگ تھی اس لیے آستین کے اندر سے ہاتھ باہر نکالا ۔ میں نے آپ کے ہاتھوں پر پانی ڈالا ۔ آپ صلی اللہ علیہ وسلم نے نماز کے وضو کی طرح وضو کیا اور اپنے خفین پر مسح کیا ۔ پھر نماز پڑھی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 103650,
        "last_updated": null
    },
    {
        "urduURN": 4003650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 364,
        "hadithSanad": "ہم سے مطر بن فضل نے بیان کیا انھوں نے کہا ہم سے روح بن عبادہ نے بیان کیا ، انھوں نے کہا ہم سے زکریابن اسحاق نے بیان کیا ، انھوں نے کہا ہم سے عمرو بن دینار نے ، انھوں نے کہا کہ میں نے جابر بن عبداللہ انصاری رضی اللہ عنہما سے سنا ، وہ بیان کرتے تھے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم ( نبوت سے پہلے ) کعبہ کے لیے قریش کے ساتھ پتھر ڈھو رہے تھے ۔ اس وقت آپ تہبند باندھے ہوئے تھے ۔ آپ صلی اللہ علیہ وسلم کے چچا عباس نے کہا کہ بھتیجے کیوں نہیں تم تہبند کھول لیتے اور اسے پتھر کے نیچے اپنے کاندھے پر رکھ لیتے ( تاکہ تم پر آسانی ہو جائے ) حضرت جابر نے کہا کہ آپ صلی اللہ علیہ وسلم نے تہبند کھول لیا اور کاندھے پر رکھ لیا ۔ اسی وقت غشی کھا کر گر پڑے ۔ اس کے بعد آپ کبھی ننگے نہیں دیکھے گئے ۔ ( صلی اللہ علیہ وسلم )</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 103660,
        "last_updated": null
    },
    {
        "urduURN": 4003660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 365,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا کہ کہا ہم سے حماد بن زید نے ایوب کے واسطہ سے ، انھوں نے محمد سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے ، آپ نے فرمایا کہ",
        "hadithText": "ایک شخص نبی کریم صلی اللہ علیہ وسلم کے سامنے کھڑا ہوا اور اس نے صرف ایک کپڑا پہن کر نماز پڑھنے کے بارے میں سوال کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ کیا تم سب ہی لوگوں کے پاس دو کپڑے ہو سکتے ہیں ؟ پھر ( یہی مسئلہ ) حضرت عمر رضی اللہ عنہ سے ایک شخص نے پوچھا تو انھوں نے کہا جب اللہ تعالیٰ نے تمہیں فراغت دی ہے تو تم بھی فراغت کے ساتھ رہو ۔ آدمی کو چاہیے کہ نماز میں اپنے کپڑے اکٹھا کر لے ، کوئی آدمی تہبند اور چادر میں نماز پڑھے ، کوئی تہبند اور قمیص ، کوئی تہبند اور قباء میں ، کوئی پاجامہ اور چادر میں ، کوئی پاجامہ اور قمیص میں ، کوئی پاجامہ اور قباء میں ، کوئی جانگیا اور قباء میں ، کوئی جانگیا اور قمیص میں نماز پڑھے ۔ ابوہریرہ رضی اللہ عنہ نے کہا کہ مجھے یاد آتا ہے کہ آپ نے یہ بھی کہا کہ کوئی جانگیا اور چادر میں نماز پڑھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 103670,
        "last_updated": null
    },
    {
        "urduURN": 4003670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 366,
        "hadithSanad": "ہم سے عاصم بن علی نے بیان کیا ، انھوں نے کہا ہم سے ابن ابی ذئب نے زہری کے حوالہ سے بیان کیا ، انھوں نے سالم سے ، انھوں نے ابن عمر رضی اللہ عنہما سے ، انھوں نے فرمایا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم سے ایک آدمی نے پوچھا کہ احرام باندھنے والے کو کیا پہننا چاہیے ۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہ قمیص پہنے نہ پاجامہ ، نہ باران کوٹ اور نہ ایسا کپڑا جس میں زعفران لگا ہوا ہو اور نہ ورس لگا ہوا کپڑا ، پھر اگر کسی شخص کو جوتیاں نہ ملیں ( جن میں پاؤں کھلا رہتا ہو ) وہ موزے کاٹ کر پہن لے تاکہ وہ ٹخنوں سے نیچے ہو جائیں اور ابن ابی ذئب نے اس حدیث کو نافع سے بھی روایت کیا ، انھوں نے ایسا ہی آنحضرت صلی اللہ علیہ وسلم سے بھی روایت کیا ہے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 103680,
        "last_updated": null
    },
    {
        "urduURN": 4003680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 367,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث نے ابن شہاب سے بیان کیا ، انھوں نے عبیداللہ بن عبداللہ بن عتبہ سے ، انھوں نے ابو سعید خدری سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے صماء کی طرح کپڑا بدن پر لپیٹ لینے سے منع فرمایا اور اس سے بھی منع فرمایا کہ آدمی ایک کپڑے میں احتباء کرے اور اس کی شرمگاہ پر علیحدہ کوئی دوسرا کپڑا نہ ہو ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 103690,
        "last_updated": null
    },
    {
        "urduURN": 4003690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 368,
        "hadithSanad": "ہم سے قبیصہ بن عقبہ نے بیان کیا ، انھوں نے کہا کہ ہم سے سفیان نے بیان کیا ، جو ابوالزناد سے نقل کرتے ہیں ، وہ اعرج سے ، وہ حضرت ابوہریرہ رضی اللہ عنہ سے",
        "hadithText": "کہ نبی کریم صلی اللہ علیہ وسلم نے دو طرح کی بیع و فروخت سے منع فرمایا ۔ ایک تو چھونے کی بیع سے ، دوسرے پھینکنے کی بیع سے اور اشتمال صماء سے ( جس کا بیان اوپر گزرا ) اور ایک کپڑے میں گوٹ مار کر بیٹھنے سے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 103700,
        "last_updated": null
    },
    {
        "urduURN": 4003700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 369,
        "hadithSanad": "ہم سے اسحاق نے بیان کیا ، انھوں نے کہا ہم سے یعقوب بن ابراہیم نے بیان کیا ، انھوں نے کہا مجھے میرے بھائی ابن شہاب نے اپنے چچا کے واسطہ سے ، انھوں نے کہا مجھے حمید بن عبدالرحمٰن بن عوف نے خبر دی کہ",
        "hadithText": "حضرت ابوہریرہ رضی اللہ عنہ نے فرمایا کہ اس حج کے موقع پر مجھے حضرت ابوبکر رضی اللہ عنہ نے یوم نحر ( ذی الحجہ کی دسویں تاریخ ) میں اعلان کرنے والوں کے ساتھ بھیجا ۔ تاکہ ہم منیٰ میں اس بات کا اعلان کر دیں کہ اس سال کے بعد کوئی مشرک حج نہیں کر سکتا اور کوئی شخص ننگے ہو کر بیت اللہ کا طواف نہیں کر سکتا ۔ حمید بن عبدالرحمٰن نے کہا اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے حضرت علی رضی اللہ عنہ کو حضرت ابوبکر رضی اللہ عنہ کے پیچھے بھیجا اور انہیں حکم دیا کہ وہ سورۃ برات پڑھ کر سنا دیں اور اس کے مضامین کا عام اعلان کر دیں ۔ ابوہریرہ رضی اللہ عنہ فرماتے ہیں کہ حضرت علی رضی اللہ عنہ نے ہمارے ساتھ نحر کے دن منیٰ میں دسویں تاریخ کو یہ سنایا کہ آج کے بعد کوئی مشرک نہ حج کر سکے گا اور نہ بیت اللہ کا طواف کوئی شخص ننگے ہو کر کر سکے گا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 103710,
        "last_updated": null
    },
    {
        "urduURN": 4003710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 370,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا ، کہا مجھ سے عبدالرحمٰن بن ابی الموال نے محمد بن منکدر سے ، کہا",
        "hadithText": "میں جابر بن عبداللہ انصاری کی خدمت میں حاضر ہوا ۔ وہ ایک کپڑا اپنے بدن پر لپیٹے ہوئے نماز پڑھ رہے تھے ، حالانکہ ان کی چادر الگ رکھی ہوئی تھی ۔ جب آپ نماز سے فارغ ہوئے تو ہم نے کہا اے ابوعبداللہ ! آپ کی چادر رکھی ہوئی ہے اور آپ ( اسے اوڑھے بغیر ) نماز پڑھ رہے ہیں ۔ انھوں نے فرمایا ، میں نے چاہا کہ تم جیسے جاہل لوگ مجھے اس طرح نماز پڑھتے دیکھ لیں ، میں نے بھی نبی کریم صلی اللہ علیہ وسلم کو اسی طرح ایک کپڑے میں نماز پڑھتے دیکھا تھا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 103720,
        "last_updated": null
    },
    {
        "urduURN": 4003720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 371,
        "hadithSanad": "ہم سے یعقوب بن ابراہیم نے بیان کیا ، کہا ہم سے اسماعیل بن علیہ نے کہ کہا ہمیں عبدالعزیز بن صہیب نے انس بن مالک رضی اللہ عنہ سے روایت کر کے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم غزوہ خبیر میں تشریف لے گئے ۔ ہم نے وہاں فجر کی نماز اندھیرے ہی میں پڑھی ۔ پھر نبی کریم صلی اللہ علیہ وسلم سوار ہوئے ۔ اور ابوطلحہ بھی سوار ہوئے ۔ میں ابوطلحہ کے پیچھے بیٹھا ہوا تھا ۔ نبی کریم صلی اللہ علیہ وسلم نے اپنی سواری کا رخ خیبر کی گلیوں کی طرف کر دیا ۔ میرا گھٹنا نبی کریم صلی اللہ علیہ وسلم کی ران سے چھو جاتا تھا ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے اپنی ران سے تہبند کو ہٹایا ۔ یہاں تک کہ میں نبی کریم صلی اللہ علیہ وسلم کی شفاف اور سفید رانوں کی سفیدی اور چمک دیکھنے لگا ۔ جب آپ خیبر کی بستی میں داخل ہوئے ، تو آپ صلی اللہ علیہ وسلم نے فرمایا «الله اكبر» اللہ سب سے بڑا ہے ، خیبر برباد ہو گیا ، جب ہم کسی قوم کے آنگن میں اتر جائیں تو ڈرائے ہوئے لوگوں کی صبح منحوس ہو جاتی ہے ۔ آپ نے یہ تین مرتبہ فرمایا ، اس نے کہا کہ خیبر کے یہودی لوگ اپنے کاموں کے لیے باہر نکلے ہی تھے کہ وہ چلا اٹھے محمد ( صلی اللہ علیہ وسلم ) آن پہنچے ۔ اور عبدالعزیز راوی نے کہا کہ بعض حضرت انس رضی اللہ عنہ سے روایت کرنے والے ہمارے ساتھیوں نے «والخميس‏» کا لفظ بھی نقل کیا ہے ( یعنی وہ چلا اٹھے کہ محمد صلی اللہ علیہ وسلم لشکر لے کر پہنچ گئے ) پس ہم نے خیبر لڑ کر فتح کر لیا اور قیدی جمع کئے گئے ۔ پھر دحیہ رضی اللہ عنہ آئے اور عرض کی کہ یا رسول اللہ ! قیدیوں میں سے کوئی باندی مجھے عنایت کیجیئے ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ جاؤ کوئی باندی لے لو ۔ انھوں نے صفیہ بنت حیی کو لے لیا ۔ پھر ایک شخص نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کی یا رسول اللہ ! صفیہ جو قریظہ اور نضیر کے سردار کی بیٹی ہیں ، انہیں آپ نے دحیہ کو دے دیا ۔ وہ تو صرف آپ ہی کے لیے مناسب تھیں ۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ دحیہ کو صفیہ کے ساتھ بلاؤ ، وہ لائے گئے ۔ جب نبی کریم صلی اللہ علیہ وسلم نے انہیں دیکھا تو فرمایا کہ قیدیوں میں سے کوئی اور باندی لے لو ۔ راوی نے کہا کہ پھر نبی کریم صلی اللہ علیہ وسلم نے صفیہ کو آزاد کر دیا اور انہیں اپنے نکاح میں لے لیا ۔ ثابت بنانی نے حضرت انس رضی اللہ عنہ سے پوچھا کہ ابوحمزہ ! ان کا مہر آنحضور صلی اللہ علیہ وسلم نے کیا رکھا تھا ؟ حضرت انس رضی اللہ عنہ نے فرمایا کہ خود انہیں کی آزادی ان کا مہر تھا اور اسی پر آپ نے نکاح کیا ۔ پھر راستے ہی میں ام سلیم رضی اللہ عنہا ( حضرت انس رضی اللہ عنہ کی والدہ ) نے انہیں دلہن بنایا اور نبی کریم صلی اللہ علیہ وسلم کے پاس رات کے وقت بھیجا ۔ اب نبی کریم صلی اللہ علیہ وسلم دولہا تھے ، اس لیے آپ صلی اللہ علیہ وسلم نے فرمایا کہ جس کے پاس بھی کچھ کھانے کی چیز ہو تو یہاں لائے ۔ آپ نے ایک چمڑے کا دسترخوان بچھایا ۔ بعض صحابہ کھجور لائے ، بعض گھی ، عبدالعزیز نے کہا کہ میرا خیال ہے حضرت انس رضی اللہ عنہ نے ستو کا بھی ذکر کیا ۔ پھر لوگوں نے ان کا حلوہ بنا لیا ۔ یہ رسول اللہ صلی اللہ علیہ وسلم کا ولیمہ تھا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 103730,
        "last_updated": null
    },
    {
        "urduURN": 4003730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 372,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، انھوں نے کہا کہ ہم کو شعیب نے زہری سے خبر دی ، کہا کہ مجھے عروہ بن زبیر نے خبر دی کہ حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم فجر کی نماز پڑھتے اور آپ صلی اللہ علیہ وسلم کے ساتھ نماز میں کئی مسلمان عورتیں اپنی چادریں اوڑھے ہوئے شریک نماز ہوتیں ۔ پھر اپنے گھروں کو واپس چلی جاتی تھیں ۔ اس وقت انہیں کوئی پہچان نہیں سکتا تھا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 103740,
        "last_updated": null
    },
    {
        "urduURN": 4003740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 373,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، انھوں نے کہا کہ ہمیں ابراہیم بن سعد نے خبر دی ، انھوں نے کہا کہ ہم سے ابن شہاب نے بیان کیا ، انھوں نے عروہ سے ، انھوں نے ام المؤمنین حضرت عائشہ رضی اللہ عنہا سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک چادر میں نماز پڑھی ۔ جس میں نقش و نگار تھے ۔ آپ صلی اللہ علیہ وسلم نے انہیں ایک مرتبہ دیکھا ۔ پھر جب نماز سے فارغ ہوئے تو فرمایا کہ میری یہ چادر ابوجہم ( عامر بن حذیفہ ) کے پاس لے جاؤ اور ان کی انبجانیہ والی چادر لے آؤ ، کیونکہ اس چادر نے ابھی نماز سے مجھ کو غافل کر دیا ۔ اور ہشام بن عروہ نے اپنے والد سے روایت کی ، انھوں نے عائشہ رضی اللہ عنہا سے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا میں نماز میں اس کے نقش و نگار دیکھ رہا تھا ، پس میں ڈرا کہ کہیں یہ مجھے غافل نہ کر دے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 103750,
        "last_updated": null
    },
    {
        "urduURN": 4003750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 374,
        "hadithSanad": "ہم سے ابومعمر عبداللہ بن عمرو نے بیان کیا کہ کہا ہم سے عبدالوارث بن سعید نے بیان کیا ، انھوں نے کہا کہ ہم سے عبدالعزیز بن صہیب نے انس رضی اللہ عنہ سے نقل کیا کہ",
        "hadithText": "حضرت عائشہ رضی اللہ عنہا کے پاس ایک رنگین باریک پردہ تھا جسے انھوں نے اپنے گھر کے ایک طرف پردہ کے لیے لٹکا دیا تھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میرے سامنے سے اپنا یہ پردہ ہٹا دو ۔ کیونکہ اس پر نقش شدہ تصاویر برابر میری نماز میں خلل انداز ہوتی رہی ہیں ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 103760,
        "last_updated": null
    },
    {
        "urduURN": 4003760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 375,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم سے لیث بن سعد نے یزید بن حبیب سے بیان کیا ، انھوں نے ابوالخیر مرثد سے ، انھوں نے عقبہ بن عامر سے ، انھوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کو ایک ریشم کی قباء تحفہ میں دی گئی ۔ اسے آپ صلی اللہ علیہ وسلم نے پہنا اور نماز پڑھی لیکن آپ صلی اللہ علیہ وسلم جب نماز سے فارغ ہوئے تو بڑی تیزی کے ساتھ اسے اتار دیا ۔ گویا آپ صلی اللہ علیہ وسلم اسے پہن کر ناگواری محسوس کر رہے تھے ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا یہ پرہیزگاروں کے لائق نہیں ہے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 103770,
        "last_updated": null
    },
    {
        "urduURN": 4003770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 376,
        "hadithSanad": "ہم سے محمد بن عرعرہ نے بیان کیا ، کہا کہ مجھ سے عمر ابن ابی زائدہ نے بیان کیا عون بن ابی حجیفہ سے ، انھوں نے اپنے والد ابوحجیفہ وہب بن عبداللہ سے کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو ایک سرخ چمڑے کے خیمہ میں دیکھا اور میں نے یہ بھی دیکھا کہ بلال رضی اللہ عنہ آنحضور صلی اللہ علیہ وسلم کو وضو کرا رہے ہیں اور ہر شخص آپ کے وضو کا پانی حاصل کرنے کے لیے ایک دوسرے سے آگے بڑھنے کی کوشش کر رہا ہے ۔ اگر کسی کو تھوڑا سا بھی پانی مل جاتا تو وہ اسے اپنے اوپر مل لیتا اور اگر کوئی پانی نہ پا سکتا تو اپنے ساتھی کے ہاتھ کی تری ہی حاصل کرنے کی کوشش کرتا ۔ پھر میں نے بلال رضی اللہ عنہ کو دیکھا کہ انھوں نے اپنی ایک برچھی اٹھائی جس کے نیچے لوہے کا پھل لگا ہوا تھا اور اسے انھوں نے گاڑ دیا ۔ نبی کریم صلی اللہ علیہ وسلم ( ڈیرے میں سے ) ایک سرخ پوشاک پہنے ہوئے تہبند اٹھائے ہوئے باہر تشریف لائے اور برچھی کی طرف منہ کر کے لوگوں کو دو رکعت نماز پڑھائی ، میں نے دیکھا کہ آدمی اور جانور برچھی کے پرے سے گزر رہے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 103780,
        "last_updated": null
    },
    {
        "urduURN": 4003780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 377,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، کہا کہ ہم سے ابوحازم سلمہ بن دینار نے بیان کیا ۔ کہا کہ لوگوں نے سہل بن سعد ساعدی سے پوچھا کہ",
        "hadithText": "منبرنبوی کس چیز کا تھا ۔ آپ نے فرمایا کہ اب ( دنیائے اسلام میں ) اس کے متعلق مجھ سے زیادہ جاننے والا کوئی باقی نہیں رہا ہے ۔ منبر غابہ کے جھاؤ سے بنا تھا ۔ فلاں عورت کے غلام فلاں نے اسے رسول اللہ صلی اللہ علیہ وسلم کے لیے بنایا تھا ۔ جب وہ تیار کر کے ( مسجد میں ) رکھا گیا تو رسول اللہ صلی اللہ علیہ وسلم اس پر کھڑے ہوئے اور آپ نے قبلہ کی طرف اپنا منہ کیا اور تکبیر کہی اور لوگ آپ کے پیچھے کھڑے ہو گئے ۔ پھر آپ نے قرآن مجید کی آیتیں پڑھیں اور رکوع کیا ۔ آپ کے پیچھے تمام لوگ بھی رکوع میں چلے گئے ۔ پھر آپ نے اپنا سر اٹھایا ۔ پھر اسی حالت میں آپ الٹے پاؤں پیچھے ہٹے ۔ پھر زمین پر سجدہ کیا ۔ پھر منبر پر دوبارہ تشریف لائے اور قرآت رکوع کی ، پھر رکوع سے سر اٹھایا اور قبلہ ہی کی طرف رخ کئے ہوئے پیچھے لوٹے اور زمین پر سجدہ کیا ۔ یہ ہے منبر کا قصہ ۔ امام ابوعبداللہ بخاری نے کہا کہ علی بن عبداللہ مدینی نے کہا کہ مجھ سے امام احمد بن حنبل نے اس حدیث کو پوچھا ۔ علی نے کہا کہ میرا مقصد یہ ہے کہ نبی کریم صلی اللہ علیہ وسلم نماز میں لوگوں سے اونچے مقام پر کھڑے ہوئے تھے اس لیے اس میں کوئی حرج نہ ہونا چاہیے کہ امام مقتدیوں سے اونچی جگہ پر کھڑا ہو ۔ علی بن مدینی کہتے ہیں کہ میں نے امام احمد بن حنبل سے کہا کہ سفیان بن عیینہ سے یہ حدیث اکثر پوچھی جاتی تھی ، آپ نے بھی یہ حدیث ان سے سنی ہے تو انھوں نے جواب دیا کہ نہیں ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 103790,
        "last_updated": null
    },
    {
        "urduURN": 4003790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 378,
        "hadithSanad": "ہم سے محمد بن عبدالرحیم نے بیان کیا کہ کہا ہم سے یزید بن ہارون نے ، کہا ہم کو حمید طویل نے خبر دی انس بن مالک رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ( 5 ھ میں ) اپنے گھوڑے سے گر گئے تھے ۔ جس سے آپ کی پنڈلی یا کندھا زخمی ہو گئے اور آپ نے ایک مہینے تک اپنی بیویوں کے پاس نہ جانے کی قسم کھائی ۔ آپ اپنے بالاخانہ پر بیٹھ گئے ۔ جس کے زینے کھجور کے تنوں سے بنائے گئے تھے ۔ صحابہ رضی اللہ عنہم مزاج پرسی کو آئے ۔ آپ نے انہیں بیٹھ کر نماز پڑھائی اور وہ کھڑے تھے ۔ جب آپ نے سلام پھیرا تو فرمایا کہ امام اس لیے ہے کہ اس کی پیروی کی جائے ۔ پس جب وہ تکبیر کہے تو تم بھی تکبیر کہو اور جب وہ رکوع میں جائے تو تم بھی رکوع میں جاؤ اور جب وہ سجدہ کرے تو تم بھی سجدہ کرو اور اگر کھڑے ہو کر تمہیں نماز پڑھائے تو تم بھی کھڑے ہو کر نماز پڑھو اور آپ انتیس دن بعد نیچے تشریف لائے ، تو لوگوں نے کہا یا رسول اللہ ! آپ نے تو ایک مہینہ کے لیے قسم کھائی تھی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ مہینہ انتیس دن کا ہے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 103800,
        "last_updated": null
    },
    {
        "urduURN": 4003800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 379,
        "hadithSanad": "ہم سے مسدد نے بیان کیا خالد سے ، کہا کہ ہم سے سلیمان شیبانی نے بیان کیا عبداللہ بن شداد سے ، انھوں نے حضرت میمونہ رضی اللہ عنہ سے ، آپ نے فرمایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نماز پڑھتے اور حائضہ ہونے کے باوجود میں ان کے سامنے ہوتی ، اکثر جب آپ صلی اللہ علیہ وسلم سجدہ کرتے تو آپ صلی اللہ علیہ وسلم کا کپڑا مجھے چھو جاتا ۔ انھوں نے کہا کہ آپ صلی اللہ علیہ وسلم ( کھجور کے پتوں سے بنے ہوئے ایک چھوٹے سے ) مصلے پر نماز پڑھتے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 103810,
        "last_updated": null
    },
    {
        "urduURN": 4003810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 380,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا کہا کہ ہمیں امام مالک نے خبر دی اسحاق بن عبداللہ بن ابی طلحہ سے ، انھوں نے انس بن مالک رضی اللہ عنہ سے کہ ان کی نانی ملیکہ نے",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کو کھانا تیار کر کے کھانے کے لیے بلایا ۔ آپ صلی اللہ علیہ وسلم نے کھانے کے بعد فرمایا کہ آو تمہیں نماز پڑھا دوں ۔ انس رضی اللہ عنہ نے کہا کہ میں نے اپنے گھر سے ایک بوریا اٹھایا جو کثرت استعمال سے کالا ہو گیا تھا ۔ میں نے اس پر پانی چھڑکا ۔ پھر رسول اللہ صلی اللہ علیہ وسلم نماز کے لیے ( اسی بورئیے پر ) کھڑے ہوئے اور میں اور ایک یتیم ( کہ رسول اللہ صلی اللہ علیہ وسلم کے غلام ابوضمیرہ کے لڑکے ضمیرہ ) آپ کے پیچھے صف باندھ کر کھڑے ہو گئے اور بوڑھی عورت ( انس کی نانی ملیکہ ) ہمارے پیچھے کھڑی ہوئیں ۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے ہمیں دو رکعت نماز پڑھائی اور واپس گھر تشریف لے گئے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 103820,
        "last_updated": null
    },
    {
        "urduURN": 4003820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 381,
        "hadithSanad": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا ، کہ کہا ہم سے شعبہ نے ، کہا ہم سے سلیمان شیبانی نے عبداللہ بن شداد کے واسطے سے ، انھوں نے ام المؤمنین میمونہ رضی اللہ عنہا سے ، انھوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم سجدہ گاہ ( یعنی چھوٹے مصلے ) پر نماز پڑھا کرتے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 103830,
        "last_updated": null
    },
    {
        "urduURN": 4003830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 382,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہ کہا مجھ سے امام مالک نے عمر بن عبیداللہ کے غلام ابوالنضر سالم کے حوالہ سے ، انھوں نے ابوسلمہ بن عبدالرحمٰن سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا سے ۔ آپ نے بتلایا کہ",
        "hadithText": "میں رسول اللہ صلی اللہ علیہ وسلم کے آگے سو جاتی اور میرے پاؤں آپ صلی اللہ علیہ وسلم کے قبلہ میں ہوتے ۔ جب آپ صلی اللہ علیہ وسلم سجدہ کرتے ، تو میرے پاؤں کو آہستہ سے دبا دیتے ۔ میں اپنے پاؤں سمیٹ لیتی اور آپ جب کھڑے ہو جاتے تو میں انہیں پھر پھیلا دیتی ۔ ان دنوں گھروں میں چراغ بھی نہیں ہوا کرتے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 103840,
        "last_updated": null
    },
    {
        "urduURN": 4003840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 383,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے عقیل سے ، انھوں نے ابن شہاب سے ، ان کو عروہ نے خبر دی کہ حضرت عائشہ رضی اللہ عنہا نے انہیں بتایا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم اپنے گھر کے بچھونے پر نماز پڑھتے اور حضرت عائشہ رضی اللہ عنہا آپ صلی اللہ علیہ وسلم کے اور قبلہ کے درمیان اس طرح لیٹی ہوتیں جیسے ( نماز کے لیے ) جنازہ رکھا جاتا ہے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 103850,
        "last_updated": null
    },
    {
        "urduURN": 4003850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 384,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا کہا ہم سے لیث بن سعد نے حدیث بیان کی یزید سے ، انھوں نے عراک سے ، انھوں نے عروہ بن زبیر سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم اس بچھونے پر نماز پڑھتے جس پر آپ صلی اللہ علیہ وسلم اور حضرت عائشہ رضی اللہ عنہا سوتے اور حضرت عائشہ رضی اللہ عنہا آپ صلی اللہ علیہ وسلم کے اور قبلہ کے درمیان اس بستر پر لیٹی رہتیں ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 103860,
        "last_updated": null
    },
    {
        "urduURN": 4003860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 385,
        "hadithSanad": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا ، انھوں نے کہا ہم سے بشر بن مفضل نے بیان کیا ، انھوں نے کہا مجھے غالب قطان نے بکر بن عبداللہ کے واسطے سے بیان کیا ، انھوں نے انس بن مالک رضی اللہ عنہ سے کہا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتے تھے ۔ پھر سخت گرمی کی وجہ سے کوئی کوئی ہم میں سے اپنے کپڑے کا کنارہ سجدے کی جگہ رکھ لیتا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 103870,
        "last_updated": null
    },
    {
        "urduURN": 4003870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 386,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انھوں نے کہا کہ ہم سے شعبہ نے بیان کیا ، انھوں نے کہا ہم سے ابومسلمہ سعید بن یزید ازدی نے بیان کیا ، کہا میں نے انس بن مالک رضی اللہ عنہ سے پوچھا کہ",
        "hadithText": "کیا نبی کریم صلی اللہ علیہ وسلم اپنی جوتیاں پہن کر نماز پڑھتے تھے ؟ تو انھوں نے فرمایا کہ ہاں ! ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 103880,
        "last_updated": null
    },
    {
        "urduURN": 4003880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 387,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے اعمش کے واسطہ سے ، اس نے کہا کہ میں نے ابراہیم نخعی سے سنا ۔ وہ ہمام بن حارث سے روایت کرتے تھے ، انھوں نے کہا کہ",
        "hadithText": "میں نے جریر بن عبداللہ رضی اللہ عنہ کو دیکھا ، انھوں نے پیشاب کیا پھر وضو کیا اور اپنے موزوں پر مسح کیا ۔ پھر کھڑے ہوئے اور ( موزوں سمیت ) نماز پڑھی ۔ آپ سے جب اس کے متعلق پوچھا گیا ، تو فرمایا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو ایسا ہی کرتے دیکھا ہے ۔ ابراہیم نخعی نے کہا کہ یہ حدیث لوگوں کی نظر میں بہت پسندیدہ تھی کیونکہ جریر رضی اللہ عنہ آخر میں اسلام لائے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 103890,
        "last_updated": null
    },
    {
        "urduURN": 4003890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 388,
        "hadithSanad": "ہم سے اسحاق بن نصر نے بیان کیا کہ کہا ہم سے ابواسامہ نے بیان کیا اعمش کے واسطہ سے ، انھوں نے مسلم بن صبیح سے ، انھوں نے مسروق بن اجدع سے ، انھوں نے مغیرہ بن شعبہ سے ، انھوں نے کہا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم کو وضو کرایا ۔ آپ صلی اللہ علیہ وسلم نے اپنے موزوں پر مسح کیا اور نماز پڑھی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 103900,
        "last_updated": null
    },
    {
        "urduURN": 4003900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 389,
        "hadithSanad": "ہمیں صلت بن محمد نے بیان کیا ، کہا ہم سے مہدی بن میمون نے واصل کے واسطہ سے ، وہ ابووائل شقیق بن سلمہ سے ، وہ حذیفہ رضی اللہ عنہ سے کہ",
        "hadithText": "انھوں نے ایک شخص کو دیکھا جو رکوع اور سجدہ پوری طرح نہیں کرتا تھا ۔ جب اس نے اپنی نماز پوری کر لی تو حذیفہ رضی اللہ عنہ نے فرمایا کہ تم نے نماز ہی نہیں پڑھی ۔ ابووائل راوی نے کہا ، میں خیال کرتا ہوں کہ حضرت حذیفہ رضی اللہ عنہ نے یہ بھی فرمایا کہ اگر تو ایسی ہی نماز پر مر جاتا تو آنحضرت صلی اللہ علیہ وسلم کی سنت پر نہیں مرتا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 103910,
        "last_updated": null
    },
    {
        "urduURN": 4003910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 390,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا مجھ سے حدیث بیان کی بکر بن مضر نے جعفر سے ، وہ ابن ہرمز سے ، انھوں نے عبداللہ بن مالک بن بحینہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جب نماز پڑھتے تو اپنے بازوؤں کے درمیان اس قدر کشادگی کر دیتے کہ دونوں بغلوں کی سفیدی ظاہر ہونے لگتی تھی اور لیث نے یوں کہا کہ مجھ سے جعفر بن ربیعہ نے اسی طرح حدیث بیان کی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 103920,
        "last_updated": null
    },
    {
        "urduURN": 4003920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 391,
        "hadithSanad": "ہم سے عمرو بن عباس نے بیان کیا ، انھوں نے کہا ہم سے ابن مہدی نے بیان کیا ، انھوں نے کہا ہم سے منصور بن سعد نے میمون بن سیاہ کے واسطہ سے بیان کیا ، انھوں نے انس بن مالک رضی اللہ عنہ سے ، انھوں نے کہا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جس نے ہماری طرح نماز پڑھی اور ہماری طرح قبلہ کی طرف منہ کیا اور ہمارے ذبیحہ کو کھایا تو وہ مسلمان ہے جس کے لیے اللہ اور اس کے رسول کی پناہ ہے ۔ پس تم اللہ کے ساتھ اس کی دی ہوئی پناہ میں خیانت نہ کرو ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 103930,
        "last_updated": null
    },
    {
        "urduURN": 4003930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 392,
        "hadithSanad": "ہم سے نعیم بن حماد نے بیان کیا ، کہا ہم سے عبداللہ ابن مبارک نے حمید طویل کے واسطہ سے ، انھوں نے روایت کیا انس بن مالک رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا مجھے حکم دیا گیا ہے کہ میں لوگوں کے ساتھ جنگ کروں یہاں تک کہ وہ «لا إله إلا الله» کہیں ۔ پس جب وہ اس کا اقرار کر لیں اور ہماری طرح نماز پڑھنے لگیں اور ہمارے قبلہ کی طرف نماز میں منہ کریں اور ہمارے ذبیحہ کو کھانے لگیں تو ان کا خون اور ان کے اموال ہم پر حرام ہو گئے ۔ مگر کسی حق کے بدلے اور ( باطن میں ) ان کا حساب اللہ پر رہے گا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 103940,
        "last_updated": null
    },
    {
        "urduURN": 4003940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 393,
        "hadithSanad": "علی بن عبداللہ بن مدینی نے فرمایا کہ ہم سے خالد بن حارث نے بیان کیا ، انھوں نے کہا ہم سے حمید طویل نے بیان کیا ، انھوں نے کہا کہ میمون بن سیاہ نے حضرت انس بن مالک رضی اللہ عنہ سے پوچھا کہ",
        "hadithText": "اے ابوحمزہ ! آدمی کی جان اور مال پر زیادتی کو کیا چیزیں حرام کرتی ہیں ؟ تو انھوں نے فرمایا کہ جس نے گواہی دی کہ اللہ کے سوا کوئی معبود نہیں اور ہمارے قبلہ کی طرف منہ کیا اور ہماری نماز کی طرح نماز پڑھی اور ہمارے ذبیحہ کو کھایا تو وہ مسلمان ہے ۔ پھر اس کے وہی حقوق ہیں جو عام مسلمانوں کے ہیں اور اس کی وہی ذمہ داریاں ہیں جو عام مسلمانوں پر ہیں اور ابن ابی مریم نے کہا ، ہمیں یحییٰ بن ایوب نے خبر دی ، انھوں نے کہا ہم سے حمید نے حدیث بیان کیا ، انھوں نے کہا ہم سے انس بن مالک رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے نقل کر کے حدیث بیان کی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 103950,
        "last_updated": null
    },
    {
        "urduURN": 4003950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 394,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان نے ، کہا ہم سے زہری نے عطاء بن یزید لیثی کے واسطہ سے ، انھوں نے ابوایوب انصاری رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب تم قضائے حاجت کے لیے جاؤ تو اس وقت نہ قبلہ کی طرف منہ کرو اور نہ پیٹھ کرو ۔ بلکہ مشرق یا مغرب کی طرف اس وقت اپنا منہ کر لیا کرو ۔ ابوایوب نے فرمایا کہ ہم جب شام میں آئے تو یہاں کے بیت الخلاء قبلہ رخ بنے ہوئے تھے ( جب ہم قضائے حاجت کے لیے جاتے ) تو ہم مڑ جاتے اور اللہ عزوجل سے استغفار کرتے تھے اور زہری نے عطاء سے اس حدیث کو اسی طرح روایت کیا ۔ اس میں یوں ہے کہ عطاء نے کہا میں نے ابوایوب سے سنا ، انھوں نے اسی طرح آنحضرت صلی اللہ علیہ وسلم سے سنا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 103960,
        "last_updated": null
    },
    {
        "urduURN": 4003960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 395,
        "hadithSanad": "ہم سے حمیدی نے بیان کیا ، انھوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا ہم سے عمرو بن دینار نے ، کہا ہم نے عبداللہ بن عمر رضی اللہ عنہما سے",
        "hadithText": "ایک ایسے شخص کے بارے میں پوچھا جس نے بیت اللہ کا طواف عمرہ کے لیے کیا لیکن صفا اور مروہ کی سعی نہیں کی ، کیا ایسا شخص ( بیت اللہ کے طواف کے بعد ) اپنی بیوی سے صحبت کر سکتا ہے ؟ آپ نے جواب دیا کہ نبی کریم صلی اللہ علیہ وسلم تشریف لائے آپ نے سات مرتبہ بیت اللہ کا طواف کیا اور مقام ابراہیم کے پاس دو رکعت نماز پڑھی ، پھر صفا اور مردہ کی سعی کی اور تمہارے لیے نبی کریم صلی اللہ علیہ وسلم کی زندگی بہترین نمونہ ہے ۔ “ ( الاحزاب : 21 )\nبھی یہ مسئلہ پوچھا تو آپ نے بھی یہی فرمایا کہ وہ بیوی کے قریب بھی اس وقت تک نہ جائے جب تک صفا اور مروہ کی سعی نہ کر لے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 103971,
        "last_updated": null
    },
    {
        "urduURN": 4003980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 397,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا سیف ابن ابی سلیمان سے ، انھوں نے کہا میں نے مجاہد سے سنا ، انھوں نے کہا کہ",
        "hadithText": "ابن عمر رضی اللہ عنہما کی خدمت میں ایک آدمی آیا اور کہنے لگا ، اے لو یہ رسول اللہ صلی اللہ علیہ وسلم آن پہنچے اور آپ کعبہ کے اندر داخل ہو گئے ۔ ابن عمر رضی اللہ عنہما نے کہا کہ میں جب آیا تو نبی کریم صلی اللہ علیہ وسلم کعبہ سے نکل چکے تھے ، میں نے دیکھا کہ بلال دونوں دروازوں کے سامنے کھڑے ہیں ۔ میں نے بلال سے پوچھا کہ کیا نبی کریم صلی اللہ علیہ وسلم نے کعبہ کے اندر نماز پڑھی ہے ؟ انھوں نے کہا کہ ہاں ! دو رکعت ان دو ستونوں کے درمیان پڑھی تھیں ، جو کعبہ میں داخل ہوتے وقت بائیں طرف واقع ہیں ۔ پھر جب باہر تشریف لائے تو کعبہ کے سامنے دو رکعت نماز ادا فرمائی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 103990,
        "last_updated": null
    },
    {
        "urduURN": 4003990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 398,
        "hadithSanad": "ہم سے اسحاق بن نصر نے بیان کیا ، انھوں نے کہا ہم سے عبدالرزاق بن ہمام نے بیان کیا ، انھوں نے کہا ہمیں ابن جریج نے خبر پہنچائی عطاء ابن ابی رباح سے ، انھوں نے کہا میں نے ابن عباس رضی اللہ عنہما سے سنا کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم کعبہ کے اندر تشریف لے گئے تو اس کے چاروں کونوں میں آپ صلی اللہ علیہ وسلم نے دعا کی اور نماز نہیں پڑھی ۔ پھر جب باہر تشریف لائے تو دو رکعت نماز کعبہ کے سامنے پڑھی اور فرمایا کہ یہی قبلہ ہے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 104000,
        "last_updated": null
    },
    {
        "urduURN": 4004000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 399,
        "hadithSanad": "ہم سے عبداللہ بن رجاء نے بیان کیا ، انھوں نے کہا ہم سے اسرائیل بن یونس نے بیان کیا ، کہا انھوں نے ابواسحاق سے بیان کیا ، کہا انھوں نے حضرت براء بن عازب رضی اللہ عنہما سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے سولہ یا سترہ ماہ تک بیت المقدس کی طرف منہ کر کے نمازیں پڑھیں اور رسول صلی اللہ علیہ وسلم ( دل سے ) چاہتے تھے کہ کعبہ کی طرف منہ کر کے نماز پڑھیں ۔ آخر اللہ تعالیٰ نے یہ آیت نازل فرمائی ’’ ہم آپ کا آسمان کی طرف باربار چہرہ اٹھانا دیکھتے ہیں ۔ پھر آپ نے کعبہ کی طرف منہ کر لیا اور احمقوں نے جو یہودی تھے کہنا شروع کیا کہ انہیں اگلے قبلہ سے کس چیز نے پھیر دیا ۔ آپ فرما دیجیئے کہ اللہ ہی کی ملکیت ہے مشرق اور مغرب ، اللہ جس کو چاہتا ہے سیدھے راستے کی ہدایت کر دیتا ہے ۔ ‘‘ ( جب قبلہ بدلا تو ) ایک شخص نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی پھر نماز کے بعد وہ چلا اور انصار کی ایک جماعت پر اس کا گزر ہوا جو عصر کی نماز بیت المقدس کی طرف منہ کر کے پڑھ رہے تھے ۔ اس شخص نے کہا کہ میں گواہی دیتا ہوں کہ میں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ وہ نماز پڑھی ہے جس میں آپ نے موجودہ قبلہ ( کعبہ ) کی طرف منہ کر کے نماز پڑھی ہے ۔ پھر وہ جماعت ( نماز کی حالت میں ہی ) مڑ گئی اور کعبہ کی طرف منہ کر لیا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 104010,
        "last_updated": null
    },
    {
        "urduURN": 4004010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 400,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے ہشام بن عبداللہ دستوائی نے ، کہا ہم سے یحییٰ بن ابی کثیر نے محمد بن عبدالرحمٰن کے واسطہ سے ، انھوں نے جابر بن عبداللہ سے ، انھوں نے فرمایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم اپنی سواری پر خواہ اس کا رخ کسی طرف ہو ( نفل ) نماز پڑھتے تھے لیکن جب فرض نماز پڑھنا چاہتے تو سواری سے اتر جاتے اور قبلہ کی طرف منہ کر کے نماز پڑھتے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 104020,
        "last_updated": null
    },
    {
        "urduURN": 4004020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 401,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے جریر نے منصور کے واسطے سے ، انھوں نے ابراہیم سے ، انھوں نے علقمہ سے ، کہ عبداللہ بن مسعود رضی اللہ عنہما نے فرمایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے نماز پڑھائی ۔ ابراہیم نے کہا مجھے نہیں معلوم کہ نماز میں زیادتی ہوئی یا کمی ۔ پھر جب آپ صلی اللہ علیہ وسلم نے سلام پھیرا تو آپ صلی اللہ علیہ وسلم سے کہا گیا کہ یا رسول اللہ ! کیا نماز میں کوئی نیا حکم آیا ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا آخر کیا بات ہے ؟ لوگوں نے کہا آپ نے اتنی اتنی رکعتیں پڑھی ہیں ۔ یہ سن کر آپ صلی اللہ علیہ وسلم نے اپنے دونوں پاؤں پھیرے اور قبلہ کی طرف منہ کر لیا اور ( سہو کے ) دو سجدے کئے اور سلام پھیرا ۔ پھر ہماری طرف متوجہ ہوئے اور فرمایا کہ اگر نماز میں کوئی نیا حکم نازل ہوا ہوتا تو میں تمہیں پہلے ہی ضرور کہہ دیتا لیکن میں تو تمہارے ہی جیسا آدمی ہوں ، جس طرح تم بھولتے ہو میں بھی بھول جاتا ہوں ۔ اس لیے جب میں بھول جایا کروں تو تم مجھے یاد دلایا کرو اور اگر کسی کو نماز میں شک ہو جائے تو اس وقت ٹھیک بات سوچ لے اور اسی کے مطابق نماز پوری کرے پھر سلام پھیر کر دو سجدے ( سہو کے ) کر لے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 104030,
        "last_updated": null
    },
    {
        "urduURN": 4004040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 403,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انھوں نے کہا ہمیں امام مالک نے عبداللہ بن دینار کے واسطہ سے ، انھوں نے عبداللہ بن عمر سے ، آپ نے فرمایا کہ",
        "hadithText": "لوگ قباء میں فجر کی نماز پڑھ رہے تھے کہ اتنے میں ایک آنے والا آیا ۔ اس نے بتایا کہ رسول اللہ صلی اللہ علیہ وسلم پر کل وحی نازل ہوئی ہے اور انہیں کعبہ کی طرف ( نماز میں ) منہ کرنے کا حکم ہو گیا ہے ۔ چنانچہ ان لوگوں نے بھی کعبہ کی جانب منہ کر لیے جب کہ اس وقت وہ شام کی جانب منہ کئے ہوئے تھے ، اس لیے وہ سب کعبہ کی جانب گھوم گئے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 104060,
        "last_updated": null
    },
    {
        "urduURN": 4004050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 404,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا کہ کہا ہم سے یحییٰ بن سعید بن قطان نے شعبہ کے واسطے سے ، انھوں نے ابراہیم سے ، انھوں نے علقمہ سے انھوں نے عبداللہ سے ، انھوں نے فرمایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ( بھولے سے ) ظہر کی نماز ( ایک مرتبہ ) پانچ رکعت پڑھی ہیں ۔ عبداللہ بن مسعود رضی اللہ عنہما نے فرمایا کہ پھر آپ نے اپنے پاؤں موڑ لیے اور ( سہو کے ) دو سجدے کئے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 104070,
        "last_updated": null
    },
    {
        "urduURN": 4004060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 405,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا کہ کہا ہم سے اسماعیل بن جعفر نے حمید کے واسطہ سے ، انھوں نے انس بن مالک رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے قبلہ کی طرف ( دیوار پر ) بلغم دیکھا ، جو آپ صلی اللہ علیہ وسلم کو ناگوار گزرا اور یہ ناگواری آپ صلی اللہ علیہ وسلم کے چہرہ مبارک پر دکھائی دینے لگی ۔ پھر آپ صلی اللہ علیہ وسلم اٹھے اور خود اپنے ہاتھ سے اسے کھرچ ڈالا اور فرمایا کہ جب کوئی شخص نماز کے لیے کھڑا ہوتا ہے تو گویا وہ اپنے رب کے ساتھ سرگوشی کرتا ہے ، یا یوں فرمایا کہ اس کا رب اس کے اور قبلہ کے درمیان ہوتا ہے ۔ اس لیے کوئی شخص ( نماز میں اپنے ) قبلہ کی طرف نہ تھوکے ۔ البتہ بائیں طرف یا اپنے قدموں کے نیچے تھوک سکتا ہے ۔ پھر آپ نے اپنی چادر کا کنارہ لیا ، اس پر تھوکا پھر اس کو الٹ پلٹ کیا اور فرمایا ، یا اس طرح کر لیا کرو ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 104080,
        "last_updated": null
    },
    {
        "urduURN": 4004070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 406,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انھوں نے کہا ہم سے امام مالک نے نافع کے واسطہ سے روایت کیا ، کہا انھوں نے عبداللہ بن عمر رضی اللہ عنہما کے واسطہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے قبلے کی دیوار پر تھوک دیکھا ، آپ صلی اللہ علیہ وسلم نے اسے کھرچ ڈالا پھر ( آپ صلی اللہ علیہ وسلم نے ) لوگوں سے خطاب کیا اور فرمایا کہ جب کوئی شخص نماز میں ہو تو اپنے منہ کے سامنے نہ تھوکے کیونکہ نماز میں منہ کے سامنے اللہ عزوجل ہوتا ہے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 104090,
        "last_updated": null
    },
    {
        "urduURN": 4004080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 407,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انھوں نے کہا کہ ہمیں امام مالک نے ہشام بن عروہ کے واسطہ سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت عائشہ ام المؤمنین رضی اللہ عنہا سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے قبلہ کی دیوار پر رینٹ یا تھوک یا بلغم دیکھا تو اسے آپ صلی اللہ علیہ وسلم نے کھرچ ڈالا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 104100,
        "last_updated": null
    },
    {
        "urduURN": 4004090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے سعید بن اسماعیل نے بیان کیا ، انھوں نے کہا ہم سے ابراہیم بن سعد نے بیان کیا ، انھوں نے کہا ہمیں ابن شہاب نے حمید بن عبدالرحمٰن کے واسطہ سے بیان کیا کہ حضرت ابوہریرہ اور حضرت ابو سعید خدری رضی اللہ عنہما نے انہیں خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے مسجد کی دیوار پر بلغم دیکھا ، پھر رسول اللہ صلی اللہ علیہ وسلم نے ایک کنکری لی اور اسے صاف کر دیا ۔ پھر فرمایا کہ جب تم میں سے کوئی شخص تھوکے تو اسے اپنے منہ کے سامنے یا دائیں طرف نہیں تھوکنا چاہیے ، البتہ بائیں طرف یا اپنے پاؤں کے نیچے تھوک لے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 104110,
        "last_updated": null
    },
    {
        "urduURN": 4004100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انھوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، انھوں نے عقیل بن خالد کے واسطے سے ، انھوں نے ابن شہاب سے ، انھوں نے حمید بن عبدالرحمٰن سے کہ حضرت ابوہریرہ اور حضرت ابو سعید خدری رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ایک کنکری سے اسے کھرچ ڈالا اور فرمایا اگر تم میں سے کسی کو تھوکنا ہو تو اسے اپنے چہرے کے سامنے یا اپنے دائیں طرف نہ تھوکا کرو ، البتہ اپنے بائیں طرف یا اپنے بائیں قدم کے نیچے تھوک سکتے ہو ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 104120,
        "last_updated": null
    },
    {
        "urduURN": 4004110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 412,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، انھوں نے کہا ہم سے شعبہ نے بیان کیا ، انھوں نے کہا کہ مجھے قتادہ نے خبر دی ، انھوں نے کہا",
        "hadithText": "میں نے انس بن مالک رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، تم اپنے سامنے یا اپنی دائیں طرف نہ تھوکا کرو ، البتہ بائیں طرف یا بائیں قدم کے نیچے تھوک سکتے ہو ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 104130,
        "last_updated": null
    },
    {
        "urduURN": 4004120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 413,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انھوں نے کہا ہم سے شعبہ نے بیان کیا ، انھوں نے کہا ہم سے قتادہ نے بیان کیا ، انھوں نے کہا کہ میں نے انس بن مالک رضی اللہ عنہ سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا مومن جب نماز میں ہوتا ہے تو وہ اپنے رب سے سرگوشی کرتا ہے ۔ اس لیے وہ اپنے سامنے یا دائیں طرف نہ تھوکے ، ہاں بائیں طرف یا پاؤں کے نیچے تھوک لے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 104140,
        "last_updated": null
    },
    {
        "urduURN": 4004130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 414,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے ، کہا ہم سے امام زہری نے حمید بن عبدالرحمٰن سے ، انھوں نے ابو سعید خدری سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے مسجد کے قبلہ کی دیوار پر بلغم دیکھا تو آپ صلی اللہ علیہ وسلم نے اسے کنکری سے کھرچ ڈالا ۔ پھر فرمایا کہ کوئی شخص سامنے یا دائیں طرف نہ تھوکے ، البتہ بائیں طرف یا بائیں پاؤں کے نیچے تھوک لینا چاہیے ۔ دوسری روایت میں زہری سے یوں ہے کہ انھوں نے حمید بن عبدالرحمٰن سے ابو سعید خدری کے واسطہ سے اسی طرح یہ حدیث سنی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 104150,
        "last_updated": null
    },
    {
        "urduURN": 4004140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 415,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے ، کہا ہم سے قتادہ نے کہا کہ میں نے انس بن مالک رضی اللہ عنہ سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ مسجد میں تھوکنا گناہ ہے اور اس کا کفارہ اسے ( زمین میں ) چھپا دینا ہے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 104160,
        "last_updated": null
    },
    {
        "urduURN": 4004150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 416,
        "hadithSanad": "ہم سے اسحاق بن نصر نے بیان کیا ، انھوں نے کہا ہمیں عبدالرزاق نے معمر بن راشد سے ، انھوں نے ہمام بن منبہ سے ، انھوں نے ابوہریرہ رضی اللہ عنہ سے سنا وہ نبی کریم صلی اللہ علیہ وسلم سے نقل کرتے ہیں کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا جب کوئی شخص نماز کے لیے کھڑا ہو تو سامنے نہ تھوکے کیونکہ وہ جب تک اپنی نماز کی جگہ میں ہوتا ہے تو اللہ تعالیٰ سے سرگوشی کرتا رہتا ہے اور دائیں طرف بھی نہ تھوکے کیونکہ اس طرف فرشتہ ہوتا ہے ، ہاں بائیں طرف یا قدم کے نیچے تھوک لے اور اسے مٹی میں چھپا دے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 104170,
        "last_updated": null
    },
    {
        "urduURN": 4004160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 417,
        "hadithSanad": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا کہ ہم سے زہیر بن معاویہ نے ، کہا ہم سے حمید نے انس بن مالک سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے قبلہ کی طرف ( دیوار پر ) بلغم دیکھا تو آپ صلی اللہ علیہ وسلم نے خود اسے کھرچ ڈالا اور آپ صلی اللہ علیہ وسلم کی ناخوشی کو محسوس کیا گیا یا ( راوی نے اس طرح بیان کیا کہ ) اس کی وجہ سے آپ صلی اللہ علیہ وسلم کی شدید ناگواری کو محسوس کیا گیا ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب کوئی شخص نماز کے لیے کھڑا ہوتا ہے تو وہ اپنے رب سے سرگوشی کرتا ہے ، یا یہ کہ اس کا رب اس کے اور قبلہ کے درمیان ہوتا ہے ۔ اس لیے قبلہ کی طرف نہ تھوکا کرو ، البتہ بائیں طرف یا قدم کے نیچے تھوک لیا کرو ۔ پھر آپ صلی اللہ علیہ وسلم نے اپنی چادر کا ایک کونا ( کنارہ ) لیا ، اس میں تھوکا اور چادر کی ایک تہہ کو دوسری تہہ پر پھیر لیا اور فرمایا ، یا اس طرح کر لیا کرے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 104180,
        "last_updated": null
    },
    {
        "urduURN": 4004170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 418,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انھوں نے کہا کہ ہمیں امام مالک نے ابوالزناد سے خبر دی ، انھوں نے اعرج سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کیا تمہارا یہ خیال ہے کہ میرا منہ ( نماز میں ) قبلہ کی طرف ہے ، اللہ کی قسم مجھ سے نہ تمہارا خشوع چھپتا ہے نہ رکوع ، میں اپنی پیٹھ کے پیچھے سے تم کو دیکھتا رہتا ہوں ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 104190,
        "last_updated": null
    },
    {
        "urduURN": 4004180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 419,
        "hadithSanad": "ہم سے یحییٰ بن صالح نے بیان کیا ، انھوں نے کہا ہم سے فلیح بن سلیمان نے ہلال بن علی سے ، انھوں نے انس بن مالک رضی اللہ عنہ سے ، وہ کہتے ہیں کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ہمیں ایک مرتبہ نماز پڑھائی ، پھر آپ صلی اللہ علیہ وسلم منبر پر چڑھے ، پھر نماز کے باب میں اور رکوع کے باب میں فرمایا میں تمہیں پیچھے سے بھی اسی طرح دیکھتا رہتا ہوں جیسے اب سامنے سے دیکھ رہا ہوں ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 104200,
        "last_updated": null
    },
    {
        "urduURN": 4004190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 420,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انھوں نے کہا کہ ہمیں امام مالک نے خبر دی ، انھوں نے نافع کے واسطہ سے بیان کیا ، انھوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ان گھوڑوں کی جنھیں ( جہاد کے لیے ) تیار کیا گیا تھا مقام حفیاء سے دوڑ کرائی ، اس دوڑ کی حد ثنیۃ الوداع تھی اور جو گھوڑے ابھی تیار نہیں ہوئے تھے ان کی دوڑ ثنیۃ الوداع سے مسجد بنی زریق تک کرائی ۔ عبداللہ بن عمر رضی اللہ عنہما نے بھی اس گھوڑ دوڑ میں شرکت کی تھی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 104210,
        "last_updated": null
    },
    {
        "urduURN": 4004200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 421,
        "hadithSanad": "ابراہیم بن طہمان نے کہا ، عبدالعزیز بن صہیب سے ، انھوں نے حضرت انس رضی اللہ عنہ سے روایت کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے پاس بحرین سے رقم آئی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے مسجد میں ڈال دو اور یہ رقم اس تمام رقم سے زیادہ تھی جو اب تک آپ صلی اللہ علیہ وسلم کی خدمت میں آ چکی تھی ۔ پھر آپ صلی اللہ علیہ وسلم نماز کے لیے تشریف لائے اور اس کی طرف کوئی توجہ نہیں فرمائی ، جب آپ صلی اللہ علیہ وسلم نماز پوری کر چکے تو آ کر مال ( رقم ) کے پاس بیٹھ گئے اور اسے تقسیم کرنا شروع فرما دیا ۔ اس وقت جسے بھی آپ صلی اللہ علیہ وسلم دیکھتے اسے عطا فرما دیتے ۔ اتنے میں حضرت عباس رضی اللہ عنہ حاضر ہوئے اور بولے کہ یا رسول اللہ ! مجھے بھی عطا کیجیئے کیونکہ میں نے ( غزوہ بدر میں ) اپنا بھی فدیہ دیا تھا اور عقیل کا بھی ( اس لیے میں زیر بار ہوں ) رسول کریم صلی اللہ علیہ وسلم نے فرمایا کہ لے لیجیئے ۔ انھوں نے اپنے کپڑے میں روپیہ بھر لیا اور اسے اٹھانے کی کوشش کی لیکن ( وزن کی زیادتی کی وجہ سے ) وہ نہ اٹھا سکے اور کہنے لگے یا رسول اللہ ! کسی کو فرمائیے کہ وہ اٹھانے میں میری مدد کرے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا نہیں ( یہ نہیں ہو سکتا ) انھوں نے کہا کہ پھر آپ ہی اٹھوا دیجیئے ۔ آپ صلی اللہ علیہ وسلم نے اس پر بھی انکار کیا ، تب حضرت عباس رضی اللہ عنہ نے اس میں سے تھوڑا سا گرا دیا اور باقی کو اٹھانے کی کوشش کی ، ( لیکن اب بھی نہ اٹھا سکے ) پھر فرمایا کہ یا رسول اللہ ! کسی کو میری مدد کرنے کا حکم دیجیئے ۔ آپ صلی اللہ علیہ وسلم نے انکار فرمایا تو انھوں نے کہا کہ پھر آپ ہی اٹھوا دیجیئے ۔ لیکن آپ صلی اللہ علیہ وسلم نے اس سے بھی انکار کیا ، تب انھوں نے اس میں سے تھوڑا سا روپیہ گرا دیا اور اسے اٹھا کر اپنے کاندھے پر رکھ لیا اور چلنے لگے ، رسول اللہ صلی اللہ علیہ وسلم کو ان کی اس حرص پر اتنا تعجب ہوا کہ آپ صلی اللہ علیہ وسلم اس وقت تک ان کی طرف دیکھتے رہے جب تک وہ ہماری نظروں سے غائب نہیں ہو گئے اور آپ صلی اللہ علیہ وسلم بھی وہاں سے اس وقت تک نہ اٹھے جب تک کہ ایک چونی بھی باقی رہی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 104220,
        "last_updated": null
    },
    {
        "urduURN": 4004210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 422,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم سے مالک نے اسحاق بن عبداللہ سے انھوں نے انس رضی اللہ عنہ سے سنا ، وہ کہتے ہیں کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو مسجد میں پایا ، آپ صلی اللہ علیہ وسلم کے پاس اور بھی کئی لوگ تھے ۔ میں کھڑا ہو گیا تو آنحضرت صلی اللہ علیہ وسلم نے مجھ سے پوچھا کہ کیا تجھ کو ابوطلحہ نے بھیجا ہے ؟ میں نے کہا جی ہاں آپ صلی اللہ علیہ وسلم نے پوچھا کھانے کے لیے ؟ ( بلایا ہے ) میں نے عرض کی کہ جی ہاں ! تب آپ صلی اللہ علیہ وسلم نے اپنے قریب موجود لوگوں سے فرمایا کہ چلو ، سب حضرات چلنے لگے اور میں ان کے آگے آگے چل رہا تھا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 104230,
        "last_updated": null
    },
    {
        "urduURN": 4004220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 423,
        "hadithSanad": "ہم سے یحییٰ بن موسیٰ نے بیان کیا ، کہا ہم سے عبدالرزاق نے ، کہا ہم کو ابن جریج نے ، کہا ہمیں ابن شہاب نے سہل بن سعد ساعدی سے کہ",
        "hadithText": "ایک شخص نے کہا ، یا رسول اللہ ! اس شخص کے بارہ میں فرمائیے جو اپنی بیوی کے ساتھ کسی غیر مرد کو ( بدفعلی کرتے ہوئے ) دیکھتا ہے ، کیا اسے مار ڈالے ؟ آخر اس مرد نے اپنی بیوی کے ساتھ مسجد میں لعان کیا اور اس وقت میں موجود تھا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 104240,
        "last_updated": null
    },
    {
        "urduURN": 4004230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 424,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، انھوں نے کہا ہم سے ابراہیم بن سعد نے ابن شہاب کے واسطہ سے بیان کیا ، انھوں نے محمود بن ربیع سے انھوں نے عتبان بن مالک سے ( جو نابینا تھے ) کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ان کے گھر تشریف لائے ۔ آپ صلی اللہ علیہ وسلم نے پوچھا کہ تم اپنے گھر میں کہاں پسند کرتے ہو کہ تمہارے لیے نماز پڑھوں ۔ عتبان نے بیان کیا کہ میں نے ایک جگہ کی طرف اشارہ کیا ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے تکبیر کہی اور ہم نے آپ صلی اللہ علیہ وسلم کے پیچھے صف باندھی پھر آپ صلی اللہ علیہ وسلم نے دو رکعت نماز ( نفل ) پڑھائی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 104250,
        "last_updated": null
    },
    {
        "urduURN": 4004240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 425,
        "hadithSanad": "ہم سے سعید بن عفیر نے بیان کیا ، انھوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، انھوں نے کہا کہ مجھ سے عقیل نے ابن شہاب کے واسطہ سے بیان کیا کہ مجھے محمود بن ربیع انصاری نے کہ",
        "hadithText": "عتبان بن مالک انصاری رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے صحابی اور غزوہ بدر کے حاضر ہونے والوں میں سے تھے ، وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور کہا یا رسول اللہ ! میری بینائی میں کچھ فرق آ گیا ہے اور میں اپنی قوم کے لوگوں کو نماز پڑھایا کرتا ہوں لیکن جب برسات کا موسم آتا ہے تو میرے اور میری قوم کے درمیان جو وادی ہے وہ بھر جاتی ہے اور بہنے لگ جاتی ہے اور میں انہیں نماز پڑھانے کے لیے مسجد تک نہیں جا سکتا یا رسول اللہ ! میری خواہش ہے کہ آپ میرے گھر تشریف لائیں اور ( کسی جگہ ) نماز پڑھ دیں تاکہ میں اسے نماز پڑھنے کی جگہ بنا لوں ۔ راوی نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے عتبان سے فرمایا ، انشاء اللہ تعالیٰ میں تمہاری اس خواہش کو پورا کروں گا ۔ عتبان نے کہا کہ ( دوسرے دن ) رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر صدیق رضی اللہ عنہ جب دن چڑھا تو دونوں تشریف لے آئے اور رسول اللہ صلی اللہ علیہ وسلم نے اندر آنے کی اجازت چاہی ، میں نے اجازت دے دی ۔ جب آپ گھر میں تشریف لائے تو بیٹھے بھی نہیں اور پوچھا کہ تم اپنے گھر کے کس حصہ میں مجھ سے نماز پڑھنے کی خواہش رکھتے ہو ۔ عتبان نے کہا کہ میں نے گھر میں ایک کونے کی طرف اشارہ کیا ، تو رسول اللہ صلی اللہ علیہ وسلم ( اس جگہ ) کھڑے ہوئے اور تکبیر کہی ہم بھی آپ کے پیچھے کھڑے ہو گئے اور صف باندھی پس آپ نے دو رکعت ( نفل ) نماز پڑھائی پھر سلام پھیرا ۔ عتبان نے کہا کہ ہم نے آپ کو تھوڑی دیر کے لیے روکا اور آپ کی خدمت میں حلیم پیش کیا جو آپ ہی کے لیے تیار کیا گیا تھا ۔ عتبان نے کہا کہ محلہ والوں کا ایک مجمع گھر میں لگ گیا اور مجمع میں سے ایک شخص بولا کہ مالک بن دخشن یا ( یہ کہا ) ابن دخشن دکھائی نہیں دیتا ۔ اس پر کسی دوسرے نے کہہ دیا کہ وہ تو منافق ہے جسے خدا اور رسول سے کوئی محبت نہیں رسول اللہ صلی اللہ علیہ وسلم نے یہ سن کر فرمایا ایسا مت کہو ، کیا تم دیکھتے نہیں کہ اس نے «لا إله إلا الله» کہا ہے اور اس سے مقصود خالص خدا کی رضامندی حاصل کرنا ہے ۔ تب منافقت کا الزام لگانے والا بولا کہ اللہ اور اس کے رسول کو زیادہ علم ہے ہم تو بظاہر اس کی توجہات اور دوستی منافقوں ہی کے ساتھ دیکھتے ہیں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ نے «لا إله إلا الله» کہنے والے پر اگر اس کا مقصد خالص خدا کی رضا حاصل کرنا ہو دوزخ کی آگ حرام کر دی ہے ۔ ابن شہاب نے کہا کہ پھر میں نے محمود سے سن کر حصین بن محمد انصاری سے جو بنوسالم کے شریف لوگوں میں سے ہیں ( اس حدیث ) کے متعلق پوچھا تو انھوں نے اس کی تصدیق کی اور کہا کہ محمود سچا ہے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 104260,
        "last_updated": null
    },
    {
        "urduURN": 4004250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 426,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم کو شعبہ نے خبر دی اشعث بن سلیم کے واسطہ سے ، انھوں نے مسروق سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے ، آپ فرماتی ہیں کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم اپنے تمام کاموں میں جہاں تک ممکن ہوتا دائیں طرف سے شروع کرنے کو پسند فرماتے تھے ۔ طہارت کے وقت بھی ، کنگھا کرنے اور جوتا پہننے میں بھی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 104270,
        "last_updated": null
    },
    {
        "urduURN": 4004260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 427,
        "hadithSanad": "ہم سے محمد بن مثنی نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے ہشام بن عروہ کے واسطہ سے بیان کیا ، کہا کہ مجھے میرے باپ نے حضرت عائشہ رضی اللہ عنہا سے یہ خبر پہنچائی کہ",
        "hadithText": "ام حبیبہ اور ام سلمہ رضی اللہ عنہما دونوں نے ایک کلیسا کا ذکر کیا جسے انھوں نے حبشہ میں دیکھا تو اس میں مورتیں ( تصویریں ) تھیں ۔ انھوں نے اس کا تذکرہ نبی کریم صلی اللہ علیہ وسلم سے بھی کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ان کا یہ قاعدہ تھا کہ اگر ان میں کوئی نیکوکار ( نیک ) شخص مر جاتا تو وہ لوگ اس کی قبر پر مسجد بناتے اور اس میں یہی مورتیں ( تصویریں ) بنا دیتے پس یہ لوگ خدا کی درگاہ میں قیامت کے دن تمام مخلوق میں برے ہوں گے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 104280,
        "last_updated": null
    },
    {
        "urduURN": 4004270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 428,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، انھوں نے کہا ہم سے عبدالوارث نے بیان کیا ، انھوں نے ابوالتیاح کے واسطہ سے بیان کیا ، انھوں نے انس بن مالک رضی اللہ عنہ سے ، انھوں نے کہا کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم مدینہ تشریف لائے تو یہاں کے بلند حصہ میں بنی عمرو بن عوف کے یہاں آپ اترے اور یہاں چوبیس راتیں قیام فرمایا ۔ پھر آپ صلی اللہ علیہ وسلم نے بنونجار کو بلا بھیجا ، تو وہ لوگ تلواریں لٹکائے ہوئے آئے ۔ انس نے کہا ، گویا میری نظروں کے سامنے نبی کریم صلی اللہ علیہ وسلم اپنی سواری پر تشریف فرما ہیں ، جبکہ ابوبکر صدیق رضی اللہ عنہ آپ صلی اللہ علیہ وسلم کے پیچھے بیٹھے ہوئے ہیں اور بنو نجار کے لوگ آپ صلی اللہ علیہ وسلم کے چاروں طرف ہیں ۔ یہاں تک کہ آپ صلی اللہ علیہ وسلم ابوایوب کے گھر کے سامنے اترے اور آپ صلی اللہ علیہ وسلم یہ پسند کرتے تھے کہ جہاں بھی نماز کا وقت آ جائے فوراً نماز ادا کر لیں ۔ آپ بکریوں کے باڑوں میں بھی نماز پڑھ لیتے تھے ، پھر آپ نے یہاں مسجد بنانے کے لیے حکم فرمایا ۔ چنانچہ بنو نجار کے لوگوں کو آپ صلی اللہ علیہ وسلم نے بلوا کر فرمایا کہ اے بنو نجار ! تم اپنے اس باغ کی قیمت مجھ سے لے لو ۔ انھوں نے جواب دیا نہیں یا رسول اللہ ! اس کی قیمت ہم صرف اللہ سے مانگتے ہیں ۔ انس رضی اللہ عنہ نے بیان کیا کہ میں جیسا کہ تمہیں بتا رہا تھا یہاں مشرکین کی قبریں تھیں ، اس باغ میں ایک ویران جگہ تھی اور کچھ کھجور کے درخت بھی تھے پس نبی کریم صلی اللہ علیہ وسلم نے مشرکین کی قبروں کو اکھڑوا دیا ویرانہ کو صاف اور برابر کرایا اور درختوں کو کٹوا کر ان کی لکڑیوں کو مسجد کے قبلہ کی جانب بچھا دیا اور پتھروں کے ذریعہ انہیں مضبوط بنا دیا ۔ صحابہ پتھر اٹھاتے ہوئے رجز پڑھتے تھے اور نبی کریم صلی اللہ علیہ وسلم بھی ان کے ساتھ تھے اور یہ کہہ رہے تھے کہ اے اللہ ! آخرت کے فائدہ کے علاوہ اور کوئی فائدہ نہیں پس انصار و مہاجرین کی مغفرت فرمانا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 104290,
        "last_updated": null
    },
    {
        "urduURN": 4004280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 429,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، انھوں نے کہا ہم سے شعبہ نے ابوالتیاح کے واسطے سے ، انھوں نے انس بن مالک رضی اللہ عنہ سے ، انھوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم بکریوں کے باڑوں میں نماز پڑھتے تھے ، ابوالتیاح یا شعبہ نے کہا ، پھر میں نے انس کو یہ کہتے ہوئے سنا کہ نبی کریم صلی اللہ علیہ وسلم بکریوں کے باڑہ میں مسجد کی تعمیر سے پہلے نماز پڑھا کرتے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 104300,
        "last_updated": null
    },
    {
        "urduURN": 4004290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 430,
        "hadithSanad": "ہم سے صدقہ بن فضل نے بیان کیا ، انھوں نے کہا ہم سے سلیمان بن حیان نے ، کہا ہم سے عبیداللہ نے نافع کے واسطہ سے ، انھوں نے کہا کہ",
        "hadithText": "میں نے ابن عمر رضی اللہ عنہما کو اپنے اونٹ کی طرف نماز پڑھتے دیکھا اور انھوں نے فرمایا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو اسی طرح پڑھتے دیکھا تھا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 104310,
        "last_updated": null
    },
    {
        "urduURN": 4004300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 431,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، انھوں نے امام مالک کے واسطہ سے بیان کیا ، انھوں نے زید بن اسلم سے ، انھوں نے عطاء بن یسار سے ، انھوں نے عبداللہ بن عباس رضی اللہ عنہما سے ، انھوں نے فرمایا کہ",
        "hadithText": "سورج گہن ہوا تو نبی کریم صلی اللہ علیہ وسلم نے نماز پڑھی اور فرمایا کہ مجھے ( آج ) دوزخ دکھائی گئی ، اس سے زیادہ بھیانک منظر میں نے کبھی نہیں دیکھا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 104320,
        "last_updated": null
    },
    {
        "urduURN": 4004310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 432,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، انھوں نے کہا ہم سے یحییٰ نے بیان کیا ، انھوں نے عبیداللہ بن عمر کے واسطہ سے بیان کیا ، انھوں نے کہا کہ مجھے نافع نے عبداللہ بن عمر رضی اللہ عنہما کے واسطہ سے خبر دی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اپنے گھروں میں بھی نمازیں پڑھا کرو اور انہیں بالکل مقبرہ نہ بنا لو ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 104330,
        "last_updated": null
    },
    {
        "urduURN": 4004320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 433,
        "hadithSanad": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، انھوں نے کہا کہ مجھ سے امام مالک رحمہ اللہ نے بیان کیا ، انھوں نے عبداللہ بن دینار کے واسطہ سے بیان کیا ، انھوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، ان عذاب والوں کے آثار سے اگر تمہارا گزر ہو تو روتے ہوئے گزرو ، اگر تم اس موقع پر رو نہ سکو تو ان سے گزرو ہی نہیں ۔ ایسا نہ ہو کہ تم پر بھی ان کا سا عذاب آ جائے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 104340,
        "last_updated": null
    },
    {
        "urduURN": 4004330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 434,
        "hadithSanad": "ہم سے محمد بن سلام بیکندی نے بیان کیا ، انھوں نے کہا ہم کو عبدہ بن سلیمان نے خبر دی ، انھوں نے ہشام بن عروہ سے ، انھوں نے اپنے باپ عروہ بن زبیر سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے کہ",
        "hadithText": "حضرت ام سلمہ رضی اللہ عنہا نے آنحضرت صلی اللہ علیہ وسلم سے ایک گرجا کا ذکر کیا جس کو انھوں نے حبش کے ملک میں دیکھا اس کا نام ماریہ تھا ۔ اس میں جو مورتیں دیکھی تھیں وہ بیان کیں ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ یہ ایسے لوگ تھے کہ اگر ان میں کوئی نیک بندہ ( یا یہ فرمایا کہ ) نیک آدمی مر جاتا تو اس کی قبر پر مسجد بناتے اور اس میں یہ بت رکھتے ۔ یہ لوگ اللہ کے نزدیک ساری مخلوقات سے بدتر ہیں ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 104350,
        "last_updated": null
    },
    {
        "urduURN": 4004340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، انھوں نے کہا ہم کو شعیب نے خبر دی زہری سے ، انھوں نے کہا کہ مجھے عبیداللہ بن عبداللہ بن عتبہ نے خبر دی کہ حضرت عائشہ اور حضرت عبداللہ بن عباس رضی اللہ عنہم نے بیان کیا کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم مرض الوفات میں مبتلا ہوئے تو آپ صلی اللہ علیہ وسلم اپنی چادر کو باربار چہرے پر ڈالتے ۔ جب کچھ افاقہ ہوتا تو اپنے مبارک چہرے سے چادر ہٹا دیتے ۔ آپ صلی اللہ علیہ وسلم نے اسی اضطراب و پریشانی کی حالت میں فرمایا ، یہود و نصاریٰ پر اللہ کی پھٹکار ہو کہ انھوں نے اپنے انبیاء کی قبروں کو مسجد بنا لیا ۔ آپ صلی اللہ علیہ وسلم یہ فرما کر امت کو ایسے کاموں سے ڈراتے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 104360,
        "last_updated": null
    },
    {
        "urduURN": 4004350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 437,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، انھوں نے مالک کے واسطے سے ، انھوں نے ابن شہاب سے ، انھوں نے سعید بن مسیب سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، یہودیوں پر اللہ کی لعنت ہو انھوں نے اپنے انبیاء کی قبروں کو مساجد بنا لیا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 104370,
        "last_updated": null
    },
    {
        "urduURN": 4004360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 438,
        "hadithSanad": "ہم سے محمد بن سنان نے بیان کیا ، انھوں نے کہا ہم سے ہشیم نے بیان کیا ، انھوں نے کہا ہم سے ابوالحکم سیار نے بیان کیا ، انھوں نے کہا ہم سے یزید فقیر نے ، کہا ہم سے جابر بن عبداللہ رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ مجھے پانچ ایسی چیزیں عطا کی گئی ہیں جو مجھ سے پہلے انبیاء کو نہیں دی گئی تھیں ۔ ( 1 ) ایک مہینے کی راہ سے میرا رعب ڈال کر میری مدد کی گئی ۔ ( 2 ) میرے لیے تمام زمین میں نماز پڑھنے اور پاکی حاصل کرنے کی اجازت ہے ۔ اس لیے میری امت کے جس آدمی کی نماز کا وقت ( جہاں بھی ) آ جائے اسے ( وہیں ) نماز پڑھ لینی چاہیے ۔ ( 3 ) میرے لیے مال غنیمت حلال کیا گیا ۔ ( 4 ) پہلے انبیاء خاص اپنی قوموں کی ہدایت کے لیے بھیجے جاتے تھے ۔ لیکن مجھے دنیا کے تمام انسانوں کی ہدایت کے لیے بھیجا گیا ہے ۔ ( 5 ) مجھے شفاعت عطا کی گئی ہے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 104380,
        "last_updated": null
    },
    {
        "urduURN": 4004370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 439,
        "hadithSanad": "ہم سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے ہشام کے واسطہ سے ، انھوں نے اپنے باپ سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے کہ",
        "hadithText": "عرب کے کسی قبیلہ کی ایک کالی لونڈی تھی ۔ انھوں نے اسے آزاد کر دیا تھا اور وہ انہیں کے ساتھ رہتی تھی ۔ اس نے بیان کیا کہ ایک دفعہ ان کی ایک لڑکی ( جو دلہن تھی ) نہانے کو نکلی ، اس کا کمربند سرخ تسموں کا تھا اس نے وہ کمربند اتار کر رکھ دیا یا اس کے بدن سے گر گیا ۔ پھر اس طرف سے ایک چیل گزری جہاں کمربند پڑا تھا ۔ چیل اسے ( سرخ رنگ کی وجہ سے ) گوشت سمجھ کر جھپٹ لے گئی ۔ بعد میں قبیلہ والوں نے اسے بہت تلاش کیا ، لیکن کہیں نہ ملا ۔ ان لوگوں نے اس کی تہمت مجھ پر لگا دی اور میری تلاشی لینی شروع کر دی ، یہاں تک کہ انھوں نے اس کی شرمگاہ تک کی تلاشی لی ۔ اس نے بیان کیا کہ اللہ کی قسم میں ان کے ساتھ اسی حالت میں کھڑی تھی کہ وہی چیل آئی اور اس نے ان کا وہ کمربند گرا دیا ۔ وہ ان کے سامنے ہی گرا ۔ میں نے ( اسے دیکھ کر ) کہا یہی تو تھا جس کی تم مجھ پر تہمت لگاتے تھے ۔ تم لوگوں نے مجھ پر اس کا الزام لگایا تھا حالانکہ میں اس سے پاک تھی ۔ یہی تو ہے وہ کمربند ! اس ( لونڈی ) نے کہا کہ اس کے بعد میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور اسلام لائی ۔ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ اس کے لیے مسجدنبوی میں ایک بڑا خیمہ لگا دیا گیا ۔ ( یا یہ کہا کہ ) چھوٹا سا خیمہ لگا دیا گیا ۔ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ وہ لونڈی میرے پاس آتی اور مجھ سے باتیں کیا کرتی تھی ۔ جب بھی وہ میرے پاس آتی تو یہ ضرور کہتی کہ کمربند کا دن ہمارے رب کی عجیب نشانیوں میں سے ہے ۔ اسی نے مجھے کفر کے ملک سے نجات دی ۔ حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ میں نے اس سے کہا ، آخر بات کیا ہے ؟ جب بھی تم میرے پاس بیٹھتی ہو تو یہ بات ضرور کہتی ہو ۔ آپ نے بیان کیا کہ پھر اس نے مجھے یہ قصہ سنایا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 104390,
        "last_updated": null
    },
    {
        "urduURN": 4004380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 440,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، انھوں نے کہا کہ ہم سے یحییٰ نے عبیداللہ کے واسطہ سے بیان کیا ، انھوں نے کہا کہ مجھ کو نافع نے بیان کیا ، کہا کہ مجھے عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "وہ اپنی نوجوانی میں جب کہ ان کے بیوی بچے نہیں تھے نبی کریم صلی اللہ علیہ وسلم کی مسجد میں سویا کرتے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 104400,
        "last_updated": null
    },
    {
        "urduURN": 4004390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 441,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے عبدالعزیز بن ابی حازم نے بیان کیا ، انھوں نے اپنے باپ ابوحازم سہل بن دینار سے ، انھوں نے سہل بن سعد رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم فاطمہ رضی اللہ عنہا کے گھر تشریف لائے دیکھا کہ حضرت علی رضی اللہ عنہ گھر میں موجود نہیں ہیں ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تمہارے چچا کے بیٹے کہاں ہیں ؟ انھوں نے بتایا کہ میرے اور ان کے درمیان کچھ ناگواری پیش آ گئی اور وہ مجھ پر خفا ہو کر کہیں باہر چلے گئے ہیں اور میرے یہاں قیلولہ بھی نہیں کیا ہے ۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص سے کہا کہ علی رضی اللہ عنہ کو تلاش کرو کہ کہاں ہیں ؟ وہ آئے اور بتایا کہ مسجد میں سوئے ہوئے ہیں ۔ پھر نبی کریم صلی اللہ علیہ وسلم تشریف لائے ۔ حضرت علی رضی اللہ عنہ لیٹے ہوئے تھے ، چادر آپ صلی اللہ علیہ وسلم کے پہلو سے گر گئی تھی اور جسم پر مٹی لگ گئی تھی ۔ رسول اللہ صلی اللہ علیہ وسلم جسم سے دھول جھاڑ رہے تھے اور فرما رہے تھے اٹھو ابوتراب اٹھو ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 104410,
        "last_updated": null
    },
    {
        "urduURN": 4004400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 442,
        "hadithSanad": "ہم سے یوسف بن عیسیٰ نے بیان کیا ، کہا ہم سے ابن فضیل نے اپنے والد کے واسطہ سے ، انھوں نے ابوحازم سے ، انھوں نے ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "آپ نے فرمایا کہ میں نے ستر اصحاب صفہ کو دیکھا کہ ان میں کوئی ایسا نہ تھا جس کے پاس چادر ہو ۔ فقط تہہ بند ہوتا ، یا رات کو اوڑھنے کا کپڑا جنھیں یہ لوگ اپنی گردنوں سے باندھ لیتے ۔ یہ کپڑے کسی کے آدھی پنڈلی تک آتے اور کسی کے ٹخنوں تک ۔ یہ حضرات ان کپڑوں کو اس خیال سے کہ کہیں شرمگاہ نہ کھل جائے اپنے ہاتھوں سے سمیٹے رہتے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 104420,
        "last_updated": null
    },
    {
        "urduURN": 4004410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 443,
        "hadithSanad": "ہم سے خلاد بن یحییٰ نے بیان کیا ، کہا ہم سے مسعر نے ، کہا ہم سے محارب بن دثار نے جابر بن عبداللہ کے واسطہ سے ، وہ کہتے ہیں کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ آپ صلی اللہ علیہ وسلم اس وقت مسجد میں تشریف فرما تھے ۔ مسعر نے کہا میرا خیال ہے کہ محارب نے چاشت کا وقت بتایا تھا ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا کہ ( پہلے ) دو رکعت نماز پڑھ اور میرا آنحضرت صلی اللہ علیہ وسلم پر کچھ قرض تھا ۔ جسے آپ صلی اللہ علیہ وسلم نے ادا کیا اور زیادہ ہی دیا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 104430,
        "last_updated": null
    },
    {
        "urduURN": 4004420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 444,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا انھوں نے کہا کہ ہمیں امام مالک نے عامر بن عبداللہ بن زبیر سے یہ خبر پہنچائی ، انھوں نے عمرو بن سلیم زرقی کے واسطہ سے بیان کیا ، انھوں نے ابوقتادہ سلمی رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب تم میں سے کوئی شخص مسجد میں داخل ہو تو بیٹھنے سے پہلے دو رکعت نماز پڑھ لے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 104440,
        "last_updated": null
    },
    {
        "urduURN": 4004430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 445,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا کہ کہا ہمیں مالک نے ابوالزناد سے ، انھوں نے اعرج سے ، انھوں نے ابوہریرہ رضی اللہ عنہ اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب تک تم اپنے مصلے پر جہاں تم نے نماز پڑھی تھی ، بیٹھے رہو اور ریاح خارج نہ کرو تو ملائکہ تم پر برابر درود بھیجتے رہتے ہیں ۔ کہتے ہیں «اللهم اغفر له اللهم ارحمه» ’’ اے اللہ ! اس کی مغفرت کیجیئے ، اے اللہ ! اس پر رحم کیجیئے ۔‘‘</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 104450,
        "last_updated": null
    },
    {
        "urduURN": 4004440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 446,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، انھوں نے کہا ہم سے یعقوب بن ابراہیم بن سعید نے بیان کیا ، انھوں نے کہا مجھ سے میرے والد ابراہیم بن سعید نے صالح بن کیسان کے واسطے سے ، ہم سے نافع نے ، عبداللہ بن عمر رضی اللہ عنہما کے واسطہ سے خبر دی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں مسجدنبوی کچی اینٹوں سے بنائی گئی تھی ۔ اس کی چھت کھجور کی شاخوں کی تھی اور ستون اسی کی کڑیوں کے ۔ حضرت ابوبکر رضی اللہ عنہ نے اس میں کسی قسم کی زیادتی نہیں کی ۔ البتہ حضرت عمر رضی اللہ عنہ نے اسے بڑھایا اور اس کی تعمیر رسول اللہ صلی اللہ علیہ وسلم کی بنائی ہوئی بنیادوں کے مطابق کچی اینٹوں اور کھجوروں کی شاخوں سے کی اور اس کے ستون بھی کڑیوں ہی کے رکھے ۔ پھر حضرت عثمان رضی اللہ عنہ نے اس کی عمارت کو بدل دیا اور اس میں بہت سی زیادتی کی ۔ اس کی دیواریں منقش پتھروں اور گچھ سے بنائیں ۔ اس کے ستون بھی منقش پتھروں سے بنوائے اور چھت ساگوان سے بنائی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 104460,
        "last_updated": null
    },
    {
        "urduURN": 4004450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 447,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے عبدالعزیز بن مختار نے بیان کیا ، کہا کہ ہم سے خالد حذاء نے عکرمہ سے ، انھوں نے بیان کیا کہ مجھ سے اور اپنے صاحبزادے علی سے ابن عباس رضی اللہ عنہما نے کہا کہ",
        "hadithText": "ابو سعید خدری رضی اللہ عنہ کی خدمت میں جاؤ اور ان کی احادیث سنو ۔ ہم گئے ۔ دیکھا کہ ابوسعید رضی اللہ عنہ اپنے باغ کو درست کر رہے تھے ۔ ہم کو دیکھ کر آپ نے اپنی چادر سنبھالی اور گوٹ مار کر بیٹھ گئے ۔ پھر ہم سے حدیث بیان کرنے لگے ۔ جب مسجدنبوی کے بنانے کا ذکر آیا تو آپ نے بتایا کہ ہم تو ( مسجد کے بنانے میں حصہ لیتے وقت ) ایک ایک اینٹ اٹھاتے ۔ لیکن عمار دو دو اینٹیں اٹھا رہے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے انہیں دیکھا تو ان کے بدن سے مٹی جھاڑنے لگے اور فرمایا ، افسوس ! عمار کو ایک باغی جماعت قتل کرے گی ۔ جسے عمار جنت کی دعوت دیں گے اور وہ جماعت عمار کو جہنم کی دعوت دے رہی ہو گی ۔ ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ حضرت عمار رضی اللہ عنہ کہتے تھے کہ میں فتنوں سے خدا کی پناہ مانگتا ہوں ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 104470,
        "last_updated": null
    },
    {
        "urduURN": 4004460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 448,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا کہ کہا ہم سے عبدالعزیز نے ابوحازم کے واسطہ سے ، انھوں نے سہل رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک عورت کے پاس ایک آدمی بھیجا کہ وہ اپنے بڑھئی غلام سے کہے کہ میرے لیے ( منبر ) لکڑیوں کے تختوں سے بنا دے جن پر میں بیٹھا کروں ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 104480,
        "last_updated": null
    },
    {
        "urduURN": 4004470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 449,
        "hadithSanad": "ہم سے خلاد بن یحییٰ نے بیان کیا ، انھوں نے کہا کہ ہم سے عبدالواحد بن ایمن نے اپنے والد کے واسطے سے بیان کیا ، انھوں نے جابر بن عبداللہ رضی اللہ عنہما سے کہ",
        "hadithText": "ایک عورت نے کہا یا رسول اللہ صلی اللہ علیہ وسلم ! کیا میں آپ کے لیے کوئی ایسی چیز نہ بنا دوں جس پر آپ صلی اللہ علیہ وسلم بیٹھا کریں ۔ میرا ایک بڑھئی غلام بھی ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا اگر تو چاہے تو منبر بنوا دے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 104490,
        "last_updated": null
    },
    {
        "urduURN": 4004480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 450,
        "hadithSanad": "ہم سے یحییٰ بن سلیمان نے بیان کیا انھوں نے کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا ، انھوں نے کہا کہ مجھ سے عمرو بن حارث نے بیان کیا ، انھوں نے کہا ہم سے بکیر بن عبداللہ نے بیان کیا ، ان سے عاصم بن عمرو بن قتادہ نے بیان کیا ، انھوں نے عبیداللہ بن اسود خولانی سے سنا ، انھوں نے حضرت عثمان بن عفان رضی اللہ عنہ سے سنا کہ",
        "hadithText": "مسجدنبوی کی تعمیر کے متعلق لوگوں کی باتوں کو سن کر آپ نے فرمایا کہ تم لوگوں نے بہت زیادہ باتیں کی ہیں ۔ حالانکہ میں نے نبی اکرم صلی اللہ علیہ وسلم سے سنا ہے کہ جس نے مسجد بنائی بکیر ( راوی ) نے کہا میرا خیال ہے کہ آپ نے یہ بھی فرمایا کہ اس سے مقصود اللہ تعالیٰ کی رضا ہو ، تو اللہ تعالیٰ ایسا ہی ایک مکان جنت میں اس کے لیے بنائے گا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 104500,
        "last_updated": null
    },
    {
        "urduURN": 4004490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 451,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے ، انھوں نے کہا کہ میں نے عمرو بن دینار سے پوچھا کیا تم نے جابر بن عبداللہ سے یہ حدیث سنی ہے کہ",
        "hadithText": "ایک شخص مسجدنبوی میں آیا اور وہ تیر لیے ہوئے تھا ، رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا کہ ان کی نوکیں تھامے رکھو ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 104510,
        "last_updated": null
    },
    {
        "urduURN": 4004500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 452,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہ کہا ہم سے عبدالواحد بن زیاد نے کہ کہا ہم سے ابوبردہ بن عبداللہ نے ۔ انھوں نے کہا کہ میں نے اپنے والد ( ابوموسیٰ اشعری صحابی ) سے سنا وہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے تھے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا اگر کوئی شخص ہماری مساجد یا ہمارے بازاروں میں تیر لیے ہوئے چلے تو ان کے پھل تھامے رہے ، ایسا نہ ہو کہ اپنے ہاتھوں سے کسی مسلمان کو زخمی کر دے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 104520,
        "last_updated": null
    },
    {
        "urduURN": 4004510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 453,
        "hadithSanad": "ہم سے ابوالیمان حکم بن نافع نے بیان کیا کہ ہمیں شعیب بن ابی حمزہ نے زہری کے واسطے سے کہا کہ مجھے ابوسلمہ ( اسماعیل یا عبداللہ ) ابن عبدالرحمٰن بن عوف نے ، انھوں نے حسان بن ثابت انصاری رضی اللہ عنہ سے سنا ، وہ حضرت ابوہریرہ رضی اللہ عنہ کو اس بات پر گواہ بنا رہے تھے کہ",
        "hadithText": "میں تمہیں اللہ کا واسطہ دیتا ہوں کہ کیا تم نے رسول اللہ صلی اللہ علیہ وسلم کو یہ کہتے ہوئے نہیں سنا تھا کہ اے حسان ! اللہ کے رسول صلی اللہ علیہ وسلم کی طرف سے ( مشرکوں کو اشعار میں ) جواب دو اور اے اللہ ! حسان کی روح القدس کے ذریعہ مدد کر ۔ ابوہریرہ رضی اللہ عنہ نے فرمایا ، ہاں ( میں گواہ ہوں ۔ بیشک میں نے حضور صلی اللہ علیہ وسلم سے یہ سنا ہے ) ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 104530,
        "last_updated": null
    },
    {
        "urduURN": 4004520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 454,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، انھوں نے کہا ہم سے ابراہیم بن سعد نے بیان کیا ، انھوں نے کہا ہم سے صالح بن کیسان نے بیان کیا ، انھوں نے کہا ہم سے ابن شہاب نے بیان کیا ، انھوں نے کہا کہ مجھے عروہ بن زبیر نے خبر دی کہ حضرت عائشہ رضی اللہ عنہا نے کہا",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم کو ایک دن اپنے حجرہ کے دروازے پر دیکھا ۔ اس وقت حبشہ کے کچھ لوگ مسجد میں ( نیزوں سے ) کھیل رہے تھے ( ہتھیار چلانے کی مشق کر رہے تھے ) رسول اللہ صلی اللہ علیہ وسلم نے مجھے اپنی چادر میں چھپا لیا تاکہ میں ان کا کھیل دیکھ سکوں ۔\n\nابراہیم بن المنذر سے روایت میں یہ زیادتی منقول ہے کہ انھوں نے کہا ہم سے ابن وہب نے بیان کیا ، کہا کہ مجھے یونس نے ابن شہاب کے واسطے سے خبر دی ، انھوں نے عروہ سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے کہمیں نے نبی کریم صلی اللہ علیہ وسلم کو دیکھا جب کہ حبشہ کے لوگ چھوٹے نیزوں ( بھالوں ) سے مسجد میں کھیل رہے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 104541,
        "last_updated": null
    },
    {
        "urduURN": 4004540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 456,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا کہ کہا ہم سے سفیان بن عیینہ نے یحییٰ بن سعید انصاری کے واسطہ سے ، انھوں نے عمرہ بنت عبدالرحمٰن سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے ۔ آپ نے فرمایا کہ",
        "hadithText": "بریرہ رضی اللہ عنہ ( لونڈی ) ان سے اپنی کتابت کے بارے میں مدد لینے آئیں ۔ حضرت عائشہ رضی اللہ عنہا نے کہا تم چاہو تو میں تمہارے مالکوں کو یہ رقم دے دوں ( اور تمہیں آزاد کرا دوں ) اور تمہارا ولاء کا تعلق مجھ سے قائم ہو ۔ اور بریرہ کے آقاؤں نے کہا ( عائشہ رضی اللہ عنہا سے ) کہ اگر آپ چاہیں تو جو قیمت باقی رہ گئی ہے وہ دے دیں اور ولاء کا تعلق ہم سے قائم رہے گا ۔ رسول اللہ صلی اللہ علیہ وسلم جب تشریف لائے تو میں نے آپ صلی اللہ علیہ وسلم سے اس امر کا ذکر کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم بریرہ کو خرید کر آزاد کرو اور ولاء کا تعلق تو اسی کو حاصل ہو سکتا ہے جو آزاد کرائے ۔ پھر رسول اللہ صلی اللہ علیہ وسلم منبر پر تشریف لائے ۔ سفیان نے ( اس حدیث کو بیان کرتے ہوئے ) ایک مرتبہ یوں کہا کہ پھر رسول اللہ صلی اللہ علیہ وسلم منبر پر چڑھے اور فرمایا ۔ ان لوگوں کا کیا حال ہو گا جو ایسی شرائط کرتے ہیں جن کا تعلق کتاب اللہ سے نہیں ہے ۔ جو شخص بھی کوئی ایسی شرط کرے جو کتاب اللہ میں نہ ہو اس کی کوئی حیثیت نہیں ہو گی ، اگرچہ وہ سو مرتبہ کر لے ۔ اس حدیث کی روایت مالک نے یحییٰ کے واسطہ سے کی ، وہ عمرہ سے کہ بریرہ اور انھوں نے منبر پر چڑھنے کا ذکر نہیں کیا الخ ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 104560,
        "last_updated": null
    },
    {
        "urduURN": 4004550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 457,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، انھوں نے کہا ہم سے عثمان بن عمر عبدی نے بیان کیا ، انھوں نے کہا کہ مجھے یونس بن یزید نے زہری کے واسطہ سے ، انھوں نے عبداللہ بن کعب بن مالک سے ، انھوں نے اپنے باپ کعب بن مالک سے کہ",
        "hadithText": "انھوں نے مسجدنبوی میں عبداللہ ابن ابی حدرد سے اپنے قرض کا تقاضا کیا اور دونوں کی گفتگو بلند آوازوں سے ہونے لگی ۔ یہاں تک کہ رسول اللہ صلی اللہ علیہ وسلم نے بھی اپنے حجرے سے سن لیا ۔ آپ پردہ ہٹا کر باہر تشریف لائے اور پکارا ۔ کعب ، کعب ( رضی اللہ عنہ ) بولے ، جی حضور فرمائیے کیا ارشاد ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم اپنے قرض میں سے اتنا کم کر دو ۔ آپ کا اشارہ تھا کہ آدھا کم کر دیں ۔ انھوں نے کہا یا رسول اللہ ! میں نے ( بخوشی ) ایسا کر دیا ۔ پھر آپ نے ابن ابی حدرد سے فرمایا اچھا اب اٹھو اور اس کا قرض ادا کرو ۔ ( جو آدھا معاف کر دیا گیا ہے ) ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 104570,
        "last_updated": null
    },
    {
        "urduURN": 4004560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 458,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، انھوں نے کہا ہم سے حماد بن زید نے بیان کیا ، انھوں نے ثابت سے ، انھوں نے ابورافع سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "ایک حبشی مرد یا حبشی عورت مسجدنبوی میں جھاڑو دیا کرتی تھی ۔ ایک دن اس کا انتقال ہو گیا تو رسول اللہ صلی اللہ علیہ وسلم نے اس کے متعلق دریافت فرمایا ۔ لوگوں نے بتایا کہ وہ تو انتقال کر گئی ۔ آپ صلی اللہ علیہ وسلم نے اس پر فرمایا کہ تم نے مجھے کیوں نہ بتایا ، پھر آپ صلی اللہ علیہ وسلم قبر پر تشریف لائے اور اس پر نماز پڑھی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 104580,
        "last_updated": null
    },
    {
        "urduURN": 4004570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 459,
        "hadithSanad": "ہم سے عبدان بن عبداللہ بن عثمان نے ابوحمزہ محمد بن میمون کے واسطہ سے بیان کیا ، انھوں نے اعمش سے ، انھوں نے مسلم سے ، انھوں نے مسروق سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے ۔ آپ فرماتی ہیں کہ",
        "hadithText": "جب سورۃ البقرہ کی سود سے متعلق آیات نازل ہوئیں تو نبی کریم صلی اللہ علیہ وسلم مسجد میں تشریف لے گئے اور ان آیات کی لوگوں کے سامنے تلاوت فرمائی ۔ پھر فرمایا کہ شراب کی تجارت حرام ہے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 107,
        "matchingArabicURN": 104590,
        "last_updated": null
    },
    {
        "urduURN": 4004580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 460,
        "hadithSanad": "ہم سے احمد بن واقد نے بیان کیا کہ ، کہا ہم سے حماد بن زید نے ثابت بنانی کے واسطہ سے ، انھوں نے ابورافع سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "ایک عورت یا مرد مسجد میں جھاڑو دیا کرتا تھا ۔ ابورافع نے کہا ، میرا خیال ہے کہ وہ عورت ہی تھی ۔ پھر انھوں نے نبی کریم صلی اللہ علیہ وسلم کی حدیث نقل کی کہ آپ صلی اللہ علیہ وسلم نے اس کی قبر پر نماز پڑھی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 108,
        "matchingArabicURN": 104600,
        "last_updated": null
    },
    {
        "urduURN": 4004590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 461,
        "hadithSanad": "ہم سے اسحاق بن ابراہیم نے بیان کیا ، انھوں نے کہا ہم سے روح بن عبادہ اور محمد بن جعفر نے شعبہ کے واسطہ سے بیان کیا ، انھوں نے محمد بن زیاد سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے انھوں نے نبی کریم صلی اللہ علیہ وسلم سے",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ گذشتہ رات ایک سرکش جن اچانک میرے پاس آیا ۔ یا اسی طرح کی کوئی بات آپ نے فرمائی ، وہ میری نماز میں خلل ڈالنا چاہتا تھا ۔ لیکن اللہ تبارک و تعالیٰ نے مجھے اس پر قابو دے دیا اور میں نے سوچا کہ مسجد کے کسی ستون کے ساتھ اسے باندھ دوں تاکہ صبح کو تم سب بھی اسے دیکھو ۔ پھر مجھے اپنے بھائی سلیمان کی یہ دعا یاد آ گئی ( جو سورۃ ص میں ہے ) ’’ اے میرے رب ! مجھے ایسا ملک عطا کرنا جو میرے بعد کسی کو حاصل نہ ہو ‘‘ ۔ راوی حدیث روح نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے اس شیطان کو ذلیل کر کے دھتکار دیا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 109,
        "matchingArabicURN": 104610,
        "last_updated": null
    },
    {
        "urduURN": 4004600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 462,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انھوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، انھوں نے کہا مجھ سے سعید بن ابی سعید مقبری نے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے کچھ سوار نجد کی طرف بھیجے ( جو تعداد میں تیس تھے ) یہ لوگ بنو حنیفہ کے ایک شخص کو جس کا نام ثمامہ بن اثال تھا پکڑ کر لائے ۔ انھوں نے اسے مسجد کے ایک ستون میں باندھ دیا ۔ پھر رسول اللہ صلی اللہ علیہ وسلم تشریف لائے ۔ اور ( تیسرے روز ثمامہ کی نیک طبیعت دیکھ کر ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ ثمامہ کو چھوڑ دو ۔ ( رہائی کے بعد ) وہ مسجدنبوی سے قریب ایک کھجور کے باغ تک گئے ۔ اور وہاں غسل کیا ۔ پھر مسجد میں داخل ہوئے اور کہا «أشهد أن لا إله إلا الله وأن محمدا رسول الله‏» میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں اور یہ کہ محمد اللہ کے سچے رسول ہیں ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 110,
        "matchingArabicURN": 104620,
        "last_updated": null
    },
    {
        "urduURN": 4004610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 463,
        "hadithSanad": "ہم سے زکریابن یحییٰ نے بیان کیا کہ کہا ہم سے عبداللہ بن نمیر نے کہ کہا ہم سے ہشام بن عروہ نے اپنے باپ عروہ بن زبیر کے واسطہ سے بیان کیا ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے آپ نے فرمایا کہ",
        "hadithText": "غزوہ خندق میں سعد ( رضی اللہ عنہ ) کے بازو کی ایک رگ ( اکحل ) میں زخم آیا تھا ۔ ان کے لیے نبی کریم صلی اللہ علیہ وسلم نے مسجد میں ایک خیمہ نصب کرا دیا تاکہ آپ قریب رہ کر ان کی دیکھ بھال کیا کریں ۔ مسجد ہی میں بنی غفار کے لوگوں کا بھی ایک خیمہ تھا ۔ سعد رضی اللہ عنہ کے زخم کا خون ( جو رگ سے بکثرت نکل رہا تھا ) بہہ کر جب ان کے خیمہ تک پہنچا تو وہ ڈر گئے ۔ انھوں نے کہا کہ اے خیمہ والو ! تمہاری طرف سے یہ کیسا خون ہمارے خیمہ تک آ رہا ہے ۔ پھر انہیں معلوم ہوا کہ یہ خون سعد رضی اللہ عنہ کے زخم سے بہہ رہا ہے ۔ حضرت سعد رضی اللہ عنہ کا اسی زخم کی وجہ سے انتقال ہو گیا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 111,
        "matchingArabicURN": 104630,
        "last_updated": null
    },
    {
        "urduURN": 4004620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 464,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہمیں امام مالک رحمہ اللہ علیہ نے محمد بن عبدالرحمٰن بن نوفل سے خبر دی ، انھوں نے عروہ بن زبیر سے ۔ انھوں نے زینب بنت ابی سلمہ سے ، انھوں نے ام المؤمنین ام سلمہ سے ، وہ کہتی ہیں کہ",
        "hadithText": "میں نے رسول کریم صلی اللہ علیہ وسلم سے ( حجۃ الوداع میں ) اپنی بیماری کا شکوہ کیا ( میں نے کہا کہ میں پیدل طواف نہیں کر سکتی ) تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ لوگوں کے پیچھے رہ اور سوار ہو کر طواف کر ۔ پس میں نے طواف کیا اور رسول اللہ صلی اللہ علیہ وسلم اس وقت بیت اللہ کے قریب نماز میں آیت «والطور و کتاب مسطور» کی تلاوت کر رہے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 112,
        "matchingArabicURN": 104640,
        "last_updated": null
    },
    {
        "urduURN": 4004630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 465,
        "hadithSanad": "ہم سے محمد بن مثنی نے بیان کیا انھوں نے کہا ہم سے معاذ بن ہشام نے بیان کیا ، انھوں نے کہا مجھ سے میرے والد نے قتادہ کے واسطہ سے بیان کیا ، کہا ہم سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "دو شخص نبی کریم صلی اللہ علیہ وسلم کے پاس سے نکلے ، ایک عباد بن بشر اور دوسرے صاحب میرے خیال کے مطابق اسید بن حضیر تھے ۔ رات تاریک تھی اور دونوں اصحاب کے پاس روشن چراغ کی طرح کوئی چیز تھی جس سے ان کے آگے آگے روشنی پھیل رہی تھی پس جب وہ دونوں اصحاب ایک دوسرے سے جدا ہوئے تو ہر ایک کے ساتھ ایک ایک چراغ رہ گیا جو گھر تک ساتھ رہا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 113,
        "matchingArabicURN": 104650,
        "last_updated": null
    },
    {
        "urduURN": 4004640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 466,
        "hadithSanad": "ہم سے محمد بن سنان نے بیان کیا ، کہ کہا ہم سے فلیح بن سلیمان نے ، کہا ہم سے ابونضر سالم بن ابی امیہ نے عبید بن حنین کے واسطہ سے ، انھوں نے بسر بن سعید سے ، انھوں نے ابو سعید خدری رضی اللہ عنہ سے ، انھوں نے بیان کیا کہ",
        "hadithText": "ایک دفعہ رسول کریم صلی اللہ علیہ وسلم نے خطبہ میں فرمایا کہ اللہ تعالیٰ نے اپنے ایک بندے کو دنیا اور آخرت کے رہنے میں اختیار دیا ( کہ وہ جس کو چاہے اختیار کرے ) بندے نے وہ پسند کیا جو اللہ کے پاس ہے یعنی آخرت ۔ یہ سن کر ابوبکر رضی اللہ عنہ رونے لگے ، میں نے اپنے دل میں کہا کہ اگر خدا نے اپنے کسی بندے کو دنیا اور آخرت میں سے کسی کو اختیار کرنے کو کہا اور اس بندے نے آخرت پسند کر لی تو اس میں ان بزرگ کے رونے کی کیا وجہ ہے ۔ لیکن یہ بات تھی کہ بندے سے مراد رسول اللہ صلی اللہ علیہ وسلم ہی تھے اور ابوبکر رضی اللہ عنہ ہم سب سے زیادہ جاننے والے تھے ۔ آنحضور صلی اللہ علیہ وسلم نے ان سے فرمایا ۔ ابوبکر آپ روئیے مت ۔ اپنی صحبت اور اپنی دولت کے ذریعہ تمام لوگوں سے زیادہ مجھ پر احسان کرنے والے آپ ہی ہیں اور اگر میں کسی کو خلیل بناتا تو ابوبکر کو بناتا ۔ لیکن ( جانی دوستی تو اللہ کے سوا کسی سے نہیں ہو سکتی ) اس کے بدلہ میں اسلام کی برادری اور دوستی کافی ہے ۔ مسجد میں ابوبکر رضی اللہ عنہ کی طرف کے دروازے کے سوا تمام دروازے بند کر دئیے جائیں ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 114,
        "matchingArabicURN": 104660,
        "last_updated": null
    },
    {
        "urduURN": 4004650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 467,
        "hadithSanad": "ہم سے عبداللہ بن محمد جعفی نے بیان کیا ، انھوں نے کہا ہم سے وہب بن جریر نے بیان کیا ، انھوں نے کہا مجھ سے میرے باپ جریر بن حازم نے بیان کیا ، انھوں نے کہا میں نے یعلیٰ بن حکیم سے سنا ، وہ عکرمہ سے نقل کرتے تھے ، وہ حضرت عبداللہ بن عباس رضی اللہ عنہما سے ، انھوں نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم اپنے مرض وفات میں باہر تشریف لائے ۔ سر پہ پٹی بندھی ہوئی تھی ۔ آپ صلی اللہ علیہ وسلم منبر پر بیٹھے ، اللہ کی حمد و ثنا کی اور فرمایا ، کوئی شخص بھی ایسا نہیں جس نے ابوبکر بن ابوقحافہ سے زیادہ مجھ پر اپنی جان و مال کے ذریعہ احسان کیا ہو اور اگر میں کسی کو انسانوں میں سے جانی دوست بناتا تو ابوبکر ( رضی اللہ عنہ ) کو بناتا ۔ لیکن اسلام کا تعلق افضل ہے ۔ دیکھو ابوبکر ( رضی اللہ عنہ ) کی کھڑکی چھوڑ کر اس مسجد کی تمام کھڑکیاں بند کر دی جائیں ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 115,
        "matchingArabicURN": 104670,
        "last_updated": null
    },
    {
        "urduURN": 4004660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 468,
        "hadithSanad": "ہم سے ابوالنعمان محمد بن فضل اور قتیبہ بن سعید نے بیان کیا کہ ہم سے حماد بن زید نے ایوب سختیانی کے واسطہ سے ، انھوں نے نافع سے ، انھوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جب مکہ تشریف لائے ( اور مکہ فتح ہوا ) تو آپ نے عثمان بن طلحہ رضی اللہ عنہ کو بلوایا ۔ ( جو کعبہ کے متولی ، چابی بردار تھے ) انھوں نے دروازہ کھولا تو نبی کریم صلی اللہ علیہ وسلم ، بلال ، اسامہ بن زید اور عثمان بن طلحہ چاروں اندر تشریف لے گئے ۔ پھر دروازہ بند کر دیا گیا اور وہاں تھوڑی دیر تک ٹھہر کر باہر آئے ۔ ابن عمر رضی اللہ عنہما نے فرمایا کہ میں نے جلدی سے آگے بڑھ کر بلال سے پوچھا ( کہ آنحضرت صلی اللہ علیہ وسلم نے کعبہ کے اندر کیا کیا ) انھوں نے بتایا کہ آنحضرت صلی اللہ علیہ وسلم نے اندر نماز پڑھی تھی ۔ میں نے پوچھا کس جگہ ؟ کہا کہ دونوں ستونوں کے درمیان ۔ عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ یہ پوچھنا مجھے یاد نہ رہا کہ آپ نے کتنی رکعتیں پڑھی تھیں ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 116,
        "matchingArabicURN": 104680,
        "last_updated": null
    },
    {
        "urduURN": 4004670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 469,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انھوں نے کہا کہ ہم سے لیث بن سعد نے سعید بن ابی سعید مقبری کے واسطہ سے بیان کیا انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے کچھ سواروں کو نجد کی طرف بھیجا تھا ۔ وہ لوگ بنو حنیفہ کے ایک شخص ثمامہ بن اثال کو ( بطور جنگی قیدی ) پکڑ لائے اور مسجد میں ایک ستون سے باندھ دیا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 117,
        "matchingArabicURN": 104690,
        "last_updated": null
    },
    {
        "urduURN": 4004680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 470,
        "hadithSanad": "ہم سے علی بن عبداللہ بن جعفر نے بیان کیا ، انھوں نے کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا ، انھوں نے کہا کہ ہم سے جعید بن عبدالرحمٰن نے بیان کیا ، انھوں نے کہا مجھ سے یزید بن خصیفہ نے بیان کیا ، انھوں نے سائب بن یزید سے بیان کیا ، انھوں نے بیان کیا کہ",
        "hadithText": "میں مسجدنبوی میں کھڑا ہوا تھا ، کسی نے میری طرف کنکری پھینکی ۔ میں نے جو نظر اٹھائی تو دیکھا کہ حضرت عمر بن خطاب رضی اللہ عنہ سامنے ہیں ۔ آپ نے فرمایا کہ یہ سامنے جو دو شخص ہیں انہیں میرے پاس بلا کر لاؤ ۔ میں بلا لایا ۔ آپ نے پوچھا کہ تمہارا تعلق کس قبیلہ سے ہے یا یہ فرمایا کہ تم کہاں رہتے ہو ؟ انھوں نے بتایا کہ ہم طائف کے رہنے والے ہیں ۔ آپ نے فرمایا کہ اگر تم مدینہ کے ہوتے تو میں تمہیں سزا دئیے بغیر نہ چھوڑتا ۔ رسول کریم صلی اللہ علیہ وسلم کی مسجد میں آواز اونچی کرتے ہو ؟</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 118,
        "matchingArabicURN": 104700,
        "last_updated": null
    },
    {
        "urduURN": 4004690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 471,
        "hadithSanad": "ہم سے احمد بن صالح نے بیان کیا ، انھوں نے کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا ، انھوں نے کہا مجھے یونس بن یزید نے خبر دی ، انھوں نے ابن شہاب زہری کے واسطہ سے بیان کیا ، انھوں نے کہا کہ مجھ سے عبداللہ بن کعب بن مالک نے بیان کیا ، ان کو ان کے باپ کعب بن مالک رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "انھوں نے عبداللہ ابن ابی حدرد رضی اللہ عنہ سے اپنے ایک قرض کے سلسلے میں رسول اللہ صلی اللہ علیہ وسلم کے دور میں مسجدنبوی کے اندر تقاضا کیا ۔ دونوں کی آواز کچھ اونچی ہو گئی یہاں تک کہ رسول اللہ صلی اللہ علیہ وسلم نے بھی اپنے حجرہ سے سن لیا ۔ آپ اٹھے اور حجرہ پر پڑے ہوئے پردہ کو ہٹایا ۔ آپ نے کعب بن مالک کو آواز دی ، اے کعب ! کعب بولے ۔ یا رسول اللہ ! حاضر ہوں ۔ آپ نے اپنے ہاتھ کے اشارے سے بتایا کہ وہ اپنا آدھا قرض معاف کر دے ۔ حضرت کعب نے عرض کی یا رسول اللہ ! میں نے معاف کر دیا ۔ آپ نے ابن ابی حدرد سے فرمایا اچھا اب چل اٹھ اس کا قرض ادا کر ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 119,
        "matchingArabicURN": 104710,
        "last_updated": null
    },
    {
        "urduURN": 4004700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 472,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا کہ کہا ہم سے بشر بن مفضل نے عبیداللہ بن عمر سے ، انھوں نے نافع سے ، انھوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ",
        "hadithText": "ایک شخص نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا ( جبکہ ) اس وقت آپ صلی اللہ علیہ وسلم منبر پر تھے کہ رات کی نماز ( یعنی تہجد ) کس طرح پڑھنے کے لیے آپ فرماتے ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ دو دو رکعت کر کے پڑھ اور جب صبح قریب ہونے لگے تو ایک رکعت پڑھ لے ۔ یہ ایک رکعت اس ساری نماز کو طاق بنا دے گی اور آپ صلی اللہ علیہ وسلم فرمایا کرتے تھے کہ رات کی آخری نماز کو طاق رکھا کرو کیونکہ نبی کریم صلی اللہ علیہ وسلم نے اس کا حکم دیا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 120,
        "matchingArabicURN": 104720,
        "last_updated": null
    },
    {
        "urduURN": 4004710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 473,
        "hadithSanad": "ہم سے ابوالنعمان محمد بن فضل نے بیان کیا کہ کہا ہم سے حماد بن زید نے ، انھوں نے ایوب سختیانی سے ، انھوں نے ابن عمر رضی اللہ عنہما سے کہ",
        "hadithText": "ایک شخص نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ آپ صلی اللہ علیہ وسلم اس وقت خطبہ دے رہے تھے آنے والے نے پوچھا کہ رات کی نماز کس طرح پڑھی جائے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا دو دو رکعت پھر جب طلوع صبح صادق کا اندیشہ ہو تو ایک رکعت وتر کی پڑھ لے تاکہ تو نے جو نماز پڑھی ہے اسے یہ رکعت طاق بنا دے اور امام بخاری نے فرمایا کہ ولید بن کثیر نے کہا کہ مجھ سے عبیداللہ بن عبداللہ عمری نے بیان کیا ، عبداللہ بن عمر رضی اللہ عنہما نے ان سے بیان کیا کہ ایک شخص نے نبی کریم صلی اللہ علیہ وسلم کو آواز دی جب کہ آپ صلی اللہ علیہ وسلم مسجد میں تشریف فرما تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 121,
        "matchingArabicURN": 104730,
        "last_updated": null
    },
    {
        "urduURN": 4004720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 474,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا کہ کہا ہمیں امام مالک نے خبر دی اسحاق بن عبداللہ ابن ابی طلحہ کے واسطے سے کہ عقیل بن ابی طالب کے غلام ابومرہ نے انہیں خبر دی ابوواقد لیثی حارث بن عوف صحابی کے واسطہ سے ، انھوں نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم مسجد میں تشریف فرما تھے کہ تین آدمی باہر سے آئے ۔ دو تو رسول اللہ صلی اللہ علیہ وسلم کی مجلس میں حاضری کی غرض سے آگے بڑھے لیکن تیسرا چلا گیا ۔ ان دو میں سے ایک نے درمیان میں خالی جگہ دیکھی اور وہاں بیٹھ گیا ۔ دوسرا شخص پیچھے بیٹھ گیا اور تیسرا تو واپس ہی جا رہا تھا ۔ جب رسول اللہ صلی اللہ علیہ وسلم وعظ سے فارغ ہوئے تو آپ صلی اللہ علیہ وسلم نے فرمایا کیا میں تمہیں ان تینوں کے متعلق ایک بات نہ بتاؤں ۔ ایک شخص تو خدا کی طرف بڑھا اور خدا نے اسے جگہ دی ( یعنی پہلا شخص ) رہا دوسرا تو اس نے ( لوگوں میں گھسنے سے ) شرم کی ، اللہ نے بھی اس سے شرم کی ، تیسرے نے منہ پھیر لیا ۔ اس لیے اللہ نے بھی اس کی طرف سے منہ پھیر لیا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 122,
        "matchingArabicURN": 104740,
        "last_updated": null
    },
    {
        "urduURN": 4004730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 475,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا امام مالک کے واسطہ سے ، انھوں نے ابن شہاب زہری سے ، انھوں نے عباد بن تمیم سے ، انھوں نے اپنے چچا ( عبداللہ بن زید بن عاصم مازنی رضی اللہ عنہ ) سے کہ",
        "hadithText": "انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو چت لیٹے ہوئے دیکھا ۔ آپ صلی اللہ علیہ وسلم اپنا ایک پاؤں دوسرے پر رکھے ہوئے تھے ۔ ابن شہاب زہری سے مروی ہے ، وہ سعید بن مسیب سے روایت کرتے ہیں کہ عمر اور عثمان رضی اللہ عنہما بھی اسی طرح لیٹتے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 123,
        "matchingArabicURN": 104750,
        "last_updated": null
    },
    {
        "urduURN": 4004740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 476,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انھوں نے کہا ہم سے لیث بن سعد نے عقیل کے واسطہ سے بیان کیا ، انھوں نے ابن شہاب زہری سے ، انھوں نے کہا مجھے عروہ بن زبیر نے خبر دی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ام المؤمنین حضرت عائشہ رضی اللہ عنہا نے بتلایا کہ میں نے جب سے ہوش سنبھالا تو اپنے ماں باپ کو مسلمان ہی پایا اور ہم پر کوئی دن ایسا نہیں گزرا جس میں رسول اللہ صلی اللہ علیہ وسلم صبح و شام دن کے دونوں وقت ہمارے گھر تشریف نہ لائے ہوں ۔ پھر ابوبکر رضی اللہ عنہ کی سمجھ میں ایک ترکیب آئی تو انھوں نے گھر کے سامنے ایک مسجد بنا لی ، وہ اس میں نماز پڑھتے اور قرآن مجید کی تلاوت کرتے ۔ مشرکین کی عورتیں اور ان کے بچے وہاں تعجب سے سنتے اور کھڑے ہو جاتے اور آپ کی طرف دیکھتے رہتے ۔ حضرت ابوبکر رضی اللہ عنہ بڑے رونے والے آدمی تھے ۔ جب قرآن کریم پڑھتے تو آنسوؤں پر قابو نہ رہتا ، قریش کے مشرک سردار اس صورت حال سے گھبرا گئے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 124,
        "matchingArabicURN": 104760,
        "last_updated": null
    },
    {
        "urduURN": 4004750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 477,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے ابومعاویہ نے اعمش کے واسطہ سے ، انھوں نے ابوصالح ذکوان سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انھوں نے رسول کریم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا ، جماعت کے ساتھ نماز پڑھنے میں گھر کے اندر یا بازار ( دوکان وغیرہ ) میں نماز پڑھنے سے پچیس گنا ثواب زیادہ ملتا ہے ۔ کیونکہ جب کوئی شخص تم میں سے وضو کرے اور اس کے آداب کا لحاظ رکھے پھر مسجد میں صرف نماز کی غرض سے آئے تو اس کے ہر قدم پر اللہ تعالیٰ ایک درجہ اس کا بلند کرتا ہے اور ایک گناہ اس سے معاف کرتا ہے ۔ اس طرح وہ مسجد کے اندر آئے گا ۔ مسجد میں آنے کے بعد جب تک نماز کے انتظار میں رہے گا ۔ اسے نماز ہی کی حالت میں شمار کیا جائے گا اور جب تک اس جگہ بیٹھا رہے جہاں اس نے نماز پڑھی ہے تو فرشتے اس کے لیے رحمت خداوندی کی دعائیں کرتے ہیں «اللهم اغفر له ،‏‏‏‏ ‏‏‏‏اللهم ارحمه» اے اللہ ! اس کو بخش دے ، اے اللہ ! اس پر رحم کر ۔ جب تک کہ ریح خارج کر کے ( وہ فرشتوں کو ) تکلیف نہ دے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 125,
        "matchingArabicURN": 104770,
        "last_updated": null
    },
    {
        "urduURN": 4004760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے حامد بن عمر نے بشر بن مفضل کے واسطہ سے بیان کیا ، کہا ہم سے عاصم بن محمد نے ، کہا ہم سے واقد بن محمد نے اپنے باپ محمد بن زید کے واسطہ سے ، انھوں نے عبداللہ بن عمر یا عبداللہ بن عمرو بن عاص رضی اللہ عنہم سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے اپنی انگلیوں کو ایک دوسرے میں داخل کیا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 126,
        "matchingArabicURN": 104780,
        "last_updated": null
    },
    {
        "urduURN": 4004770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 480,
        "hadithSanad": "اور عاصم بن علی نے کہا ، ہم سے عاصم بن محمد نے بیان کیا کہ میں نے اس حدیث کو اپنے باپ محمد بن زید سے سنا ۔ لیکن مجھے حدیث یاد نہیں رہی تھی ۔ تو میرے بھائی واقد نے اس کو درستی سے اپنے باپ سے روایت کر کے مجھے بتایا ۔ وہ کہتے ہیں کہ",
        "hadithText": "عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ عبداللہ بن عمرو تمہارا کیا حال ہو گا جب تم برے لوگوں میں رہ جاؤ گے اس طرح ( یعنی آپ صلی اللہ علیہ وسلم نے ایک ہاتھ کی انگلیاں دوسرے ہاتھ میں کر کے دکھلائیں ) ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 127,
        "matchingArabicURN": 104790,
        "last_updated": null
    },
    {
        "urduURN": 4004780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 481,
        "hadithSanad": "ہم سے خلاد بن یحییٰ نے بیان کیا ، کہا ہم سے سفیان ثوری نے ابی بردہ بن عبداللہ بن ابی بردہ سے ، انھوں نے اپنے دادا ( ابوبردہ ) سے ، انھوں نے ابوموسیٰ اشعری رضی اللہ عنہ سے ۔ انھوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا ایک مومن دوسرے مومن کے لیے عمارت کی طرح ہے کہ اس کا ایک حصہ دوسرے حصہ کو قوت پہنچاتا ہے ۔ اور آپ صلی اللہ علیہ وسلم نے ایک ہاتھ کی انگلیوں کو دوسرے ہاتھ کی انگلیوں میں داخل کیا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 128,
        "matchingArabicURN": 104800,
        "last_updated": null
    },
    {
        "urduURN": 4004790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 482,
        "hadithSanad": "ہم سے اسحاق بن منصور نے بیان کیا ، کہا ہم سے نضر بن شمیل نے ، انھوں نے کہا کہ ہمیں عبداللہ ابن عون نے خبر دی ، انھوں نے محمد بن سیرین سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انھوں نے کہا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے ہمیں دوپہر کے بعد کی دو نمازوں میں سے کوئی نماز پڑھائی ۔ ( ظہر یا عصر کی ) ابن سیرین نے کہا کہ حضرت ابوہریرہ رضی اللہ عنہ نے اس کا نام تو لیا تھا ۔ لیکن میں بھول گیا ۔ حضرت ابوہریرہ رضی اللہ عنہ نے بتلایا کہ آپ صلی اللہ علیہ وسلم نے ہمیں دو رکعت نماز پڑھا کر سلام پھیر دیا ۔ اس کے بعد ایک لکڑی کی لاٹھی سے جو مسجد میں رکھی ہوئی تھی آپ صلی اللہ علیہ وسلم ٹیک لگا کر کھڑے ہو گئے ۔ ایسا معلوم ہوتا تھا کہ جیسے آپ بہت ہی خفا ہوں اور آپ صلی اللہ علیہ وسلم نے اپنے دائیں ہاتھ کو بائیں ہاتھ پر رکھا اور ان کی انگلیوں کو ایک دوسرے میں داخل کیا اور آپ نے اپنے دائیں رخسار مبارک کو بائیں ہاتھ کی ہتھیلی سے سہارا دیا ۔ جو لوگ نماز پڑھ کر جلدی نکل جایا کرتے تھے وہ مسجد کے دروازوں سے پار ہو گئے ۔ پھر لوگ کہنے لگے کہ کیا نماز کم کر دی گئی ہے ۔ حاضرین میں ابوبکر اور عمر ( رضی اللہ عنہما ) بھی موجود تھے ۔ لیکن انہیں بھی آپ سے بولنے کی ہمت نہ ہوئی ۔ انہیں میں ایک شخص تھے جن کے ہاتھ لمبے تھے اور انہیں ذوالیدین کہا جاتا تھا ۔ انھوں نے پوچھا یا رسول اللہ ! کیا آپ صلی اللہ علیہ وسلم بھول گئے یا نماز کم کر دی گئی ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہ میں بھولا ہوں اور نہ نماز میں کوئی کمی ہوئی ہے ۔ پھر آپ صلی اللہ علیہ وسلم نے لوگوں سے پوچھا ۔ کیا ذوالیدین صحیح کہہ رہے ہیں ۔ حاضرین بولے کہ جی ہاں ! یہ سن کر آپ صلی اللہ علیہ وسلم آگے بڑھے اور باقی رکعتیں پڑھیں ۔ پھر سلام پھیرا پھر تکبیر کہی اور سہو کا سجدہ کیا ۔ معمول کے مطابق یا اس سے بھی لمبا سجدہ ۔ پھر سر اٹھایا اور تکبیر کہی ۔ پھر تکبیر کہی اور دوسرا سجدہ کیا ۔ معمول کے مطابق یا اس سے بھی طویل پھر سر اٹھایا اور تکبیر کہی ، لوگوں نے باربار ابن سیرین سے پوچھا کہ کیا پھر سلام پھیرا تو وہ جواب دیتے کہ مجھے خبر دی گئی ہے کہ عمران بن حصین کہتے تھے کہ پھر سلام پھیرا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 129,
        "matchingArabicURN": 104810,
        "last_updated": null
    },
    {
        "urduURN": 4004800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 483,
        "hadithSanad": "ہم سے محمد بن ابی بکر مقدمی نے بیان کیا کہا ہم سے فضیل بن سلیمان نے ، کہا ہم سے موسیٰ بن عقبہ نے ، کہا میں نے سالم بن عبداللہ بن عمر رضی اللہ عنہما کو دیکھا کہ",
        "hadithText": "وہ ( مدینہ سے مکہ تک ) راستے میں کئی جگہوں کو ڈھونڈھ کر وہاں نماز پڑھتے اور کہتے کہ ان کے باپ حضرت عبداللہ بن عمر رضی اللہ عنہما بھی ان مقامات پر نماز پڑھا کرتے تھے ۔ اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو ان مقامات پر نماز پڑھتے ہوئے دیکھا ہے اور موسیٰ بن عقبہ نے کہا کہ مجھ سے نافع نے ابن عمر رضی اللہ عنہما کے متعلق بیان کیا کہ وہ ان مقامات پر نماز پڑھا کرتے تھے ۔ اور میں نے سالم سے پوچھا تو مجھے خوب یاد ہے کہ انھوں نے بھی نافع کے بیان کے مطابق ہی تمام مقامات کا ذکر کیا ۔ فقط مقام شرف روحاء کی مسجد کے متعلق دونوں نے اختلاف کیا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 130,
        "matchingArabicURN": 104820,
        "last_updated": null
    },
    {
        "urduURN": 4004810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 484,
        "hadithSanad": "ہم سے ابراہیم بن المنذر حزامی نے بیان کیا ، کہا ہم سے انس بن عیاض نے ، کہا ہم سے موسیٰ بن عقبہ نے نافع سے ، ان کو عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "آنحضرت صلی اللہ علیہ وسلم جب عمرہ کے قصد سے تشریف لے گئے اور حجۃ الوداع کے موقعہ پر جب حج کے لیے نکلے تو آپ صلی اللہ علیہ وسلم نے ذوالحلیفہ میں قیام فرمایا ۔ ذوالحلیفہ کی مسجد کے قریب آپ صلی اللہ علیہ وسلم ایک ببول کے درخت کے نیچے اترے اور جب آپ کسی جہاد سے واپس ہوتے اور راستہ ذوالحلیفہ سے ہو کر گزرتا یا حج یا عمرہ سے واپسی ہوتی تو آپ وادی عتیق کے نشیبی علاقہ میں اترتے ، پھر جب وادی کے نشیب سے اوپر چڑھتے تو وادی کے بالائی کنارے کے اس مشرقی حصہ پر پڑاؤ ہوتا جہاں کنکریوں اور ریت کا کشادہ نالا ہے ۔ ( یعنی بطحاء میں ) یہاں آپ صلی اللہ علیہ وسلم رات کو صبح تک آرام فرماتے ۔ یہ مقام اس مسجد کے قریب نہیں ہے جو پتھروں کی بنی ہے ، آپ اس ٹیلے پر بھی نہیں ہوتے جس پر مسجد بنی ہوئی ہے ۔ وہاں ایک گہرا نالہ تھا عبداللہ بن عمر رضی اللہ عنہما وہیں نماز پڑھتے ۔ اس کے نشیب میں ریت کے ٹیلے تھے اور رسول اللہ صلی اللہ علیہ وسلم وہاں نماز پڑھا کرتے تھے ۔ کنکریوں اور ریت کے کشادہ نالہ کی طرف سے سیلاب نے آ کر اس جگہ کے آثار و نشانات کو پاٹ دیا ہے ، جہاں حضرت عبداللہ بن عمر رضی اللہ عنہما نماز پڑھا کرتے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 131,
        "matchingArabicURN": 104830,
        "last_updated": null
    },
    {
        "urduURN": 4004820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 485,
        "hadithSanad": "اور عبداللہ بن عمر رضی اللہ عنہما نے نافع سے یہ بھی بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے اس جگہ نماز پڑھی جہاں اب شرف روحاء کی مسجد کے قریب ایک چھوٹی مسجد ہے ، عبداللہ بن عمر رضی اللہ عنہما اس جگہ کی نشاندہی کرتے تھے جہاں نبی کریم صلی اللہ علیہ وسلم نے نماز پڑھی تھی ۔ کہتے تھے کہ یہاں تمہارے دائیں طرف جب تم مسجد میں ( قبلہ رو ہو کر ) نماز پڑھنے کے لیے کھڑے ہوتے ہو ۔ جب تم ( مدینہ سے ) مکہ جاؤ تو یہ چھوٹی سی مسجد راستے کے دائیں جانب پڑتی ہے ۔ اس کے اور بڑی مسجد کے درمیان ایک پتھر کی مار کا فاصلہ ہے یا اس سے کچھ کم زیادہ ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 132,
        "matchingArabicURN": 104840,
        "last_updated": null
    },
    {
        "urduURN": 4004830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 486,
        "hadithSanad": "اور عبداللہ بن عمر رضی اللہ عنہما",
        "hadithText": "اس چھوٹی پہاڑی کی طرف نماز پڑھتے جو روحاء کے آخر کنارے پر ہے اور یہ پہاڑی وہاں ختم ہوتی ہے جہاں راستے کا کنارہ ہے ۔ اس مسجد کے قریب جو اس کے اور روحاء کے آخری حصے کے بیچ میں ہے مکہ کو جاتے ہوئے ۔ اب وہاں ایک مسجد بن گئی ہے ۔ عبداللہ بن عمر رضی اللہ عنہما اس مسجد میں نماز نہیں پڑھتے تھے بلکہ اس کو اپنے بائیں طرف مقابل میں چھوڑ دیتے اور آگے بڑھ کر خود پہاڑی عرق الطبیہ کی طرف نماز پڑھتے تھے ۔ عبداللہ بن عمر رضی اللہ عنہما جب روحاء سے چلتے تو ظہر اس وقت تک نہ پڑھتے جب تک اس مقام پر نہ پہنچ جاتے ۔ جب یہاں آ جاتے تو ظہر پڑھتے ، اور اگر مکہ سے آتے ہوئے صبح صادق سے تھوڑی دیر پہلے یا سحر کے آخر میں وہاں سے گزرتے تو صبح کی نماز تک وہیں آرام کرتے اور فجر کی نماز پڑھتے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 133,
        "matchingArabicURN": 104850,
        "last_updated": null
    },
    {
        "urduURN": 4004840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 487,
        "hadithSanad": "اور عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم راستے کے دائیں طرف مقابل میں ایک گھنے درخت کے نیچے وسیع اور نرم علاقہ میں قیام فرماتے جو قریہ رویثہ کے قریب ہے ۔ پھر آپ اس ٹیلہ سے جو رویثہ کے راستے سے تقریباً دو میل کے فاصلے پر ہے چلتے تھے ۔ اب اس درخت کا اوپر کا حصہ ٹوٹ گیا ہے ۔ اور درمیان میں سے دوہرا ہو کر جڑ پر کھڑا ہے ۔ اس کی جڑ میں ریت کے بہت سے ٹیلے ہیں ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 134,
        "matchingArabicURN": 104860,
        "last_updated": null
    },
    {
        "urduURN": 4004850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 488,
        "hadithSanad": "اور عبداللہ بن عمر رضی اللہ عنہما نے نافع سے یہ بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے قریہ عرج کے قریب اس نالے کے کنارے نماز پڑھی جو پہاڑ کی طرف جاتے ہوئے پڑتا ہے ۔ اس مسجد کے پاس دو یا تین قبریں ہیں ، ان قبروں پر اوپر تلے پتھر رکھے ہوئے ہیں ، راستے کے دائیں جانب ان بڑے پتھروں کے پاس جو راستے میں ہیں ۔ ان کے درمیان میں ہو کر نماز پڑھی ، عبداللہ بن عمر رضی اللہ عنہما قریہ عرج سے سورج ڈھلنے کے بعد چلتے اور ظہر اسی مسجد میں آ کر پڑھا کرتے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 135,
        "matchingArabicURN": 104870,
        "last_updated": null
    },
    {
        "urduURN": 4004860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 489,
        "hadithSanad": "اور عبداللہ بن عمر رضی اللہ عنہما نے نافع سے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے راستے کے بائیں طرف ان گھنے درختوں کے پاس قیام فرمایا جو ہرشی پہاڑ کے نزدیک نشیب میں ہیں ۔ یہ ڈھلوان جگہ ہرشی کے ایک کنارے سے ملی ہوئی ہے ۔ یہاں سے عام راستہ تک پہنچنے کے لیے تیر کی مار کا فاصلہ ہے ۔ عبداللہ بن عمر رضی اللہ عنہما اس بڑے درخت کی طرف نماز پڑھتے تھے جو ان تمام درختوں میں راستے سے سب سے زیادہ نزدیک ہے اور سب سے لمبا درخت بھی یہی ہے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 136,
        "matchingArabicURN": 104880,
        "last_updated": null
    },
    {
        "urduURN": 4004870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 490,
        "hadithSanad": "اور عبداللہ بن عمر رضی اللہ عنہما نے نافع سے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم اس نالے میں اترا کرتے تھے جو وادی مرالظہران کے نشیب میں ہے ۔ مدینہ کے مقابل جب کہ مقام صفراوات سے اترا جائے ۔ نبی کریم صلی اللہ علیہ وسلم اس ڈھلوان کے بالکل نشیب میں قیام کرتے تھے ۔ یہ راستے کے بائیں جانب پڑتا ہے جب کوئی شخص مکہ جا رہا ہو ( جس کو اب بطن مرو کہتے ہیں ) راستے اور رسول اللہ صلی اللہ علیہ وسلم کی منزل کے درمیان صرف ایک پتھر ہی کے مار کا فاصلہ ہوتا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 137,
        "matchingArabicURN": 104890,
        "last_updated": null
    },
    {
        "urduURN": 4004880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 491,
        "hadithSanad": "اور عبداللہ بن عمر رضی اللہ عنہما نے نافع سے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم مقام ذی طویٰ میں قیام فرماتے اور رات یہیں گزارا کرتے تھے اور صبح ہوتی تو نماز فجر یہیں پڑھتے ۔ مکہ جاتے ہوئے ۔ یہاں نبی کریم صلی اللہ علیہ وسلم کے نماز پڑھنے کی جگہ ایک بڑے سے ٹیلے پر تھی ۔ اس مسجد میں نہیں جواب وہاں بنی ہوئی ہے بلکہ اس سے نیچے ایک بڑا ٹیلا تھا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 138,
        "matchingArabicURN": 104900,
        "last_updated": null
    },
    {
        "urduURN": 4004890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 492,
        "hadithSanad": "اور عبداللہ بن عمر رضی اللہ عنہما نے حضرت نافع سے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے اس پہاڑ کے دونوں کونوں کا رخ کیا جو اس کے اور جبل طویل کے درمیان کعبہ کی سمت ہیں ۔ آپ صلی اللہ علیہ وسلم اس مسجد کو جو اب وہاں تعمیر ہوئی ہے اپنی بائیں طرف کر لیتے ٹیلے کے کنارے ۔ اور نبی کریم صلی اللہ علیہ وسلم کے نماز پڑھنے کی جگہ اس سے نیچے سیاہ ٹیلے پر تھی ٹیلے سے تقریباً دس ہاتھ چھوڑ کر پہاڑ کی دونوں گھاٹیوں کی طرف رخ کر کے نماز پڑھتے جو تمہارے اور کعبہ کے درمیان ہے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 139,
        "matchingArabicURN": 104910,
        "last_updated": null
    },
    {
        "urduURN": 4004900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 493,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انھوں نے کہا کہ ہم سے امام مالک نے ابن شہاب کے واسطے سے بیان کیا ، انھوں نے عبیداللہ بن عبداللہ بن عتبہ سے کہ عبداللہ بن عباس رضی اللہ عنہما نے فرمایا کہ",
        "hadithText": "میں ایک گدھی پر سوار ہو کر آیا ۔ اس زمانہ میں بالغ ہونے والا تھا ۔ رسول اللہ صلی اللہ علیہ وسلم منیٰ میں لوگوں کو نماز پڑھا رہے تھے ۔ لیکن دیوار آپ صلی اللہ علیہ وسلم کے سامنے نہ تھی ۔ میں صف کے بعض حصے سے گزر کر سواری سے اترا اور میں نے گدھی کو چرنے کے لیے چھوڑ دیا اور صف میں داخل ہو گیا ۔ پس کسی نے مجھ پر اعتراض نہیں کیا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 140,
        "matchingArabicURN": 104920,
        "last_updated": null
    },
    {
        "urduURN": 4004910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 494,
        "hadithSanad": "ہم سے اسحاق بن منصور نے بیان کیا ، کہا ہم سے عبداللہ بن نمیر نے کہا کہ ہم سے عبیداللہ بن عمر نے نافع کے واسطہ سے بیان کیا ۔ انھوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم جب عید کے دن ( مدینہ سے ) باہر تشریف لے جاتے تو چھوٹے نیزہ ( برچھا ) کو گاڑنے کا حکم دیتے وہ جب آپ صلی اللہ علیہ وسلم کے آگے گاڑ دیا جاتا تو آپ صلی اللہ علیہ وسلم اس کی طرف رخ کر کے نماز پڑھتے اور لوگ آپ صلی اللہ علیہ وسلم کے پیچھے کھڑے ہوتے ۔ یہی آپ صلی اللہ علیہ وسلم سفر میں بھی کیا کرتے تھے ۔ ( مسلمانوں کے ) خلفاء نے اسی وجہ سے برچھا ساتھ رکھنے کی عادت بنا لی ہے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 141,
        "matchingArabicURN": 104930,
        "last_updated": null
    },
    {
        "urduURN": 4004920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 495,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا عون بن ابی حجیفہ سے ، کہا میں نے اپنے باپ ( وہب بن عبداللہ ) سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے لوگوں کو بطحاء میں نماز پڑھائی ۔ آپ صلی اللہ علیہ وسلم کے سامنے عنزہ ( ڈنڈا جس کے نیچے پھل لگا ہوا ہو ) گاڑ دیا گیا تھا ۔ ( چونکہ آپ صلی اللہ علیہ وسلم مسافر تھے اس لیے ) ظہر کی دو رکعت اور عصر کی دو رکعت ادا کیں ۔ آپ صلی اللہ علیہ وسلم کے سامنے سے عورتیں اور گدھے گزر رہے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 142,
        "matchingArabicURN": 104940,
        "last_updated": null
    },
    {
        "urduURN": 4004930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 496,
        "hadithSanad": "ہم سے عمرو بن زرارہ نے بیان کیا ، کہا کہ ہم سے عبدالعزیز بن ابی حازم نے اپنے باپ ابوحازم سلمہ بن دینار سے بیان کیا ، انھوں نے سہل بن سعد سے ، انھوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے سجدہ کرنے کی جگہ اور دیوار کے درمیان ایک بکری کے گزر سکنے کا فاصلہ رہتا تھا ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 143,
        "matchingArabicURN": 104950,
        "last_updated": null
    },
    {
        "urduURN": 4004940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 497,
        "hadithSanad": "ہم سے مکی بن ابراہیم نے بیان کیا ، کہا کہ ہم سے یزید بن ابی عبید نے ، انھوں نے سلمہ بن اکوع رضی اللہ عنہ سے بیان کیا ، انھوں نے فرمایا کہ",
        "hadithText": "مسجد کی دیوار اور منبر کے درمیان بکری کے گزر سکنے کے فاصلے کے برابر جگہ تھی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 144,
        "matchingArabicURN": 104960,
        "last_updated": null
    },
    {
        "urduURN": 4004950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 498,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے عبیداللہ کے واسطے سے بیان کیا ، کہا مجھے نافع نے عبداللہ بن عمر رضی اللہ عنہما کے واسطہ سے خبر دی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے لیے برچھا گاڑ دیا جاتا آپ صلی اللہ علیہ وسلم اس کی طرف نماز پڑھتے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 145,
        "matchingArabicURN": 104970,
        "last_updated": null
    },
    {
        "urduURN": 4004960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 499,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا کہ ہم سے عون بن ابی حجیفہ نے بیان کیا ، کہا کہ میں نے اپنے باپ ابوحجیفہ وہب بن عبداللہ سے سنا انھوں نے کہا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم دوپہر کے وقت باہر تشریف لائے ۔ آپ صلی اللہ علیہ وسلم کی خدمت میں وضو کا پانی پیش کیا گیا ، جس سے آپ صلی اللہ علیہ وسلم نے وضو کیا ۔ پھر ہمیں آپ صلی اللہ علیہ وسلم نے ظہر کی نماز پڑھائی اور عصر کی ، آپ صلی اللہ علیہ وسلم کے سامنے عنزہ گاڑ دیا گیا تھا اور عورتیں اور گدھے پر سوار لوگ اس کے پیچھے سے گزر رہے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 146,
        "matchingArabicURN": 104980,
        "last_updated": null
    },
    {
        "urduURN": 4004970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 500,
        "hadithSanad": "ہم سے محمد بن حاتم بن بزیع نے بیان کیا ، کہا کہ ہم سے شاذان بن عامر نے شعبہ بن حجاج کے واسطہ سے بیان کیا ، انھوں نے عطاء بن ابی میمونہ سے ، انھوں نے کہا کہ میں نے انس بن مالک رضی اللہ عنہ سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جب رفع حاجت کے لیے نکلتے تو میں اور ایک اور لڑکا آپ صلی اللہ علیہ وسلم کے پیچھے پیچھے جاتے ۔ ہمارے ساتھ عکازہ ( ڈنڈا جس کے نیچے لوہے کا پھل لگا ہوا ہو ) یا چھڑی یا عنزہ ہوتا ۔ اور ہمارے ساتھ ایک چھاگل بھی ہوتا تھا ۔ جب آنحضور صلی اللہ علیہ وسلم حاجت سے فارغ ہو جاتے تو ہم آپ صلی اللہ علیہ وسلم کو وہ چھاگل دے دیتے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 147,
        "matchingArabicURN": 104990,
        "last_updated": null
    },
    {
        "urduURN": 4004980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 501,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے حکم بن عیینہ سے ، انھوں نے ابوحجیفہ سے ، انھوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ہمارے پاس دوپہر کے وقت تشریف لائے اور آپ صلی اللہ علیہ وسلم نے بطحاء میں ظہر اور عصر کی دو دو رکعتیں پڑھیں ۔ آپ صلی اللہ علیہ وسلم کے سامنے عنزہ گاڑ دیا گیا تھا اور جب آپ صلی اللہ علیہ وسلم نے وضو کیا تو لوگ آپ صلی اللہ علیہ وسلم کے وضو کے پانی کو اپنے بدن پر لگا رہے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 148,
        "matchingArabicURN": 105000,
        "last_updated": null
    },
    {
        "urduURN": 4004990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 502,
        "hadithSanad": "ہم سے مکی بن ابراہیم نے بیان کیا ، کہا ہم سے یزید بن ابی عبید نے بیان کیا ، کہا کہ",
        "hadithText": "میں سلمہ بن اکوع رضی اللہ عنہ کے ساتھ ( مسجدنبوی میں ) حاضر ہوا کرتا تھا ۔ سلمہ رضی اللہ عنہ ہمیشہ اس ستون کو سامنے کر کے نماز پڑھتے جہاں قرآن شریف رکھا رہتا تھا ۔ میں نے ان سے کہا کہ اے ابومسلم ! میں دیکھتا ہوں کہ آپ ہمیشہ اسی ستون کو سامنے کر کے نماز پڑھتے ہیں ۔ انھوں نے فرمایا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو دیکھا آپ صلی اللہ علیہ وسلم خاص طور سے اسی ستون کو سامنے کر کے نماز پڑھا کرتے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 149,
        "matchingArabicURN": 105010,
        "last_updated": null
    },
    {
        "urduURN": 4005000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 503,
        "hadithSanad": "ہم سے قبیصہ بن عقبہ نے بیان کیا ، کہا ہم سے سفیان ثوری نے عمرو بن عامر سے بیان کیا ، انھوں نے انس بن مالک رضی اللہ عنہ سے ، انھوں نے کہا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم کے بڑے بڑے صحابہ رضوان اللہ علیہم اجمعین کو دیکھا کہ وہ مغرب ( کی اذان ) کے وقت ستونوں کی طرف لپکتے ۔ اور شعبہ نے عمرو بن عامر سے انھوں نے حضرت انس رضی اللہ عنہ سے ( اس حدیث میں ) یہ زیادتی کی ہے ۔ ’’ یہاں تک کہ نبی کریم صلی اللہ علیہ وسلم حجرے سے باہر تشریف لاتے ۔ ‘‘</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 150,
        "matchingArabicURN": 105020,
        "last_updated": null
    },
    {
        "urduURN": 4005010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 504,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے جویریہ بن اسماء نے نافع سے ، انھوں نے عبداللہ بن عمر رضی اللہ عنہما سے ، انھوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم بیت اللہ کے اندر تشریف لے گئے اور اسامہ بن زید عثمان بن طلحہ اور بلال رضی اللہ عنہم بھی آپ کے ساتھ تھے ۔ آپ صلی اللہ علیہ وسلم دیر تک اندر رہے ۔ پھر باہر آئے ۔ اور میں سب لوگوں سے پہلے آپ صلی اللہ علیہ وسلم کے پیچھے ہی وہاں آیا ۔ میں نے بلال رضی اللہ عنہ سے پوچھا کہ نبی کریم صلی اللہ علیہ وسلم نے کہاں نماز پڑھی تھی ۔ انھوں نے بتایا کہ آگے کے دو ستونوں کے بیچ میں آپ صلی اللہ علیہ وسلم نے نماز پڑھی تھی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 151,
        "matchingArabicURN": 105030,
        "last_updated": null
    },
    {
        "urduURN": 4005020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 505,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا ہمیں امام مالک بن انس نے خبر دی نافع سے ، انھوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ",
        "hadithText": "آنحضرت صلی اللہ علیہ وسلم کعبہ کے اندر تشریف لے گئے اور اسامہ بن زید ، بلال اور عثمان بن طلحہ حجبی بھی آپ صلی اللہ علیہ وسلم کے ساتھ تھے ۔ پھر عثمان رضی اللہ عنہ نے کعبہ کا دروازہ بند کر دیا ۔ اور آپ صلی اللہ علیہ وسلم اس میں ٹھہرے رہے ۔ جب آپ صلی اللہ علیہ وسلم باہر نکلے تو میں نے بلال رضی اللہ عنہ سے پوچھا کہ نبی کریم صلی اللہ علیہ وسلم نے اندر کیا کیا ؟ انھوں نے کہا کہ آپ نے ایک ستون کو تو بائیں طرف چھوڑا اور ایک کو دائیں طرف اور تین کو پیچھے اور اس زمانہ میں خانہ کعبہ میں چھ ستون تھے ۔ پھر آپ صلی اللہ علیہ وسلم نے نماز پڑھی ۔ امام بخاری نے کہا کہ ہم سے اسماعیل بن ابی ادریس نے کہا ، وہ کہتے ہیں کہ مجھ سے امام مالک نے یہ حدیث یوں بیان کی کہ آپ صلی اللہ علیہ وسلم نے اپنے دائیں طرف دو ستون چھوڑے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 152,
        "matchingArabicURN": 105040,
        "last_updated": null
    },
    {
        "urduURN": 4005030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 506,
        "hadithSanad": "ہم سے ابراہیم بن المنذر نے بیان کیا ، کہا کہ ہم سے ابوضمرہ انس بن عیاض نے بیان کیا ، کہا ہم سے موسیٰ بن عقبہ نے بیان کیا انھوں نے نافع سے کہ",
        "hadithText": "عبداللہ بن عمر رضی اللہ عنہما جب کعبہ میں داخل ہوتے تو سیدھے منہ کے سامنے چلے جاتے ۔ دروازہ پیٹھ کی طرف ہوتا اور آپ آگے بڑھتے جب ان کے اور سامنے کی دیوار کا فاصلہ قریب تین ہاتھ کے رہ جاتا تو نماز پڑھتے ۔ اس طرح آپ اس جگہ نماز پڑھنا چاہتے تھے جس کے متعلق حضرت بلال رضی اللہ عنہ نے آپ کو بتایا تھا کہ نبی کریم صلی اللہ علیہ وسلم نے یہیں نماز پڑھی تھی ۔ آپ فرماتے تھے کہ بیت اللہ میں جس کونے میں ہم چاہیں نماز پڑھ سکتے ہیں ۔ اس میں کوئی قباحت نہیں ہے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 153,
        "matchingArabicURN": 105050,
        "last_updated": null
    },
    {
        "urduURN": 4005040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 507,
        "hadithSanad": "ہم سے محمد بن ابی بکر مقدمی بصریٰ نے بیان کیا ، کہا کہ ہم سے معتمر بن سلیمان نے بیان کیا عبیداللہ بن عمر سے ، وہ نافع سے ، انھوں نے عبداللہ بن عمر رضی اللہ عنہما سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم اپنی سواری کو سامنے عرض میں کر لیتے اور اس کی طرف منہ کر کے نماز پڑھتے تھے ، عبیداللہ بن عمر نے نافع سے پوچھا کہ جب سواری اچھلنے کودنے لگتی تو اس وقت آپ کیا کیا کرتے تھے ؟ نافع نے کہا کہ آپ اس وقت کجاوے کو اپنے سامنے کر لیتے اور اس کے آخری حصے کی ( جس پر سوار ٹیک لگاتا ہے ایک کھڑی سی لکڑی کی ) طرف منہ کر کے نماز پڑھتے اور عبداللہ بن عمر رضی اللہ عنہما بھی اسی طرح کیا کرتے تھے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 154,
        "matchingArabicURN": 105060,
        "last_updated": null
    },
    {
        "urduURN": 4005050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 508,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے جریر بن عبدالحمید نے بیان کیا منصور بن معتمر سے ، انھوں نے ابراہیم نخعی سے ، انھوں نے اسود بن یزید سے ، انھوں نے عائشہ رضی اللہ عنہا سے",
        "hadithText": "آپ نے فرمایا تم لوگوں نے ہم عورتوں کو کتوں اور گدھوں کے برابر بنا دیا ۔ حالانکہ میں چارپائی پر لیٹی رہتی تھی ۔ اور نبی کریم صلی اللہ علیہ وسلم تشریف لائے اور چارپائی کے بیچ میں آ جاتے ( یا چارپائی کو اپنے اور قبلے کے بیچ میں کر لیتے ) پھر نماز پڑھتے ۔ مجھے آپ صلی اللہ علیہ وسلم کے سامنے پڑا رہنا برا معلوم ہوتا ، اس لیے میں پائینتی کی طرف سے کھسک کے لحاف سے باہر نکل جاتی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 155,
        "matchingArabicURN": 105070,
        "last_updated": null
    },
    {
        "urduURN": 4005060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 509,
        "hadithSanad": "ہم سے ابومعمر نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، کہا کہ ہم سے یونس بن عبید نے حمید بن ہلال کے واسطے سے بیان کیا ، انھوں نے ابوصالح ذکوان سمان سے کہ ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( دوسری سند ) اور ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے سلیمان بن مغیرہ نے ، کہا ہم سے حمید بن ہلال عدوی نے ، کہا ہم سے ابوصالح سمان نے ، کہا میں نے ابو سعید خدری رضی اللہ عنہ کو جمعہ کے دن نماز پڑھتے ہوئے دیکھا ۔ آپ کسی چیز کی طرف منہ کئے ہوئے لوگوں کے لیے اسے آڑ بنائے ہوئے تھے ۔ ابومعیط کے بیٹوں میں سے ایک جوان نے چاہا کہ آپ کے سامنے سے ہو کر گزر جائے ۔ ابوسعید رضی اللہ عنہ نے اس کے سینہ پر دھکا دے کر باز رکھنا چاہا ۔ جوان نے چاروں طرف نظر دوڑائی لیکن کوئی راستہ سوائے سامنے سے گزرنے کے نہ ملا ۔ اس لیے وہ پھر اسی طرف سے نکلنے کے لیے لوٹا ۔ اب ابوسعید رضی اللہ عنہ نے پہلے سے بھی زیادہ زور سے دھکا دیا ۔ اسے ابوسعید رضی اللہ عنہ سے شکایت ہوئی اور وہ اپنی یہ شکایت مروان کے پاس لے گیا ۔ اس کے بعد ابوسعید رضی اللہ عنہ بھی تشریف لے گئے ۔ مروان نے کہا اے ابوسعید رضی اللہ عنہ آپ میں اور آپ کے بھتیجے میں کیا معاملہ پیش آیا ۔ آپ نے فرمایا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ جب کوئی شخص نماز کسی چیز کی طرف منہ کر کے پڑھے اور اس چیز کو آڑ بنا رہا ہو پھر بھی اگر کوئی سامنے سے گزرے تو اسے روک دینا چاہیے ۔ اگر اب بھی اسے اصرار ہو تو اسے لڑنا چاہیے ۔ کیونکہ وہ شیطان ہے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 156,
        "matchingArabicURN": 105080,
        "last_updated": null
    },
    {
        "urduURN": 4005070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 510,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا ، انھوں نے کہا ہم سے امام مالک نے عمر بن عبیداللہ کے غلام ابونضر سالم بن ابی امیہ سے خبر دی ۔ انھوں نے بسر بن سعید سے کہ",
        "hadithText": "زید بن خالد نے انہیں ابوجہیم عبداللہ انصاری رضی اللہ عنہ کی خدمت میں ان سے یہ بات پوچھنے کے لیے بھیجا کہ انھوں نے نماز پڑھنے والے کے سامنے سے گزرنے والے کے متعلق نبی کریم صلی اللہ علیہ وسلم سے کیا سنا ہے ۔ ابوجہیم نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا کہ اگر نمازی کے سامنے سے گزرنے والا جانتا کہ اس کا کتنا بڑا گناہ ہے تو اس کے سامنے سے گزرنے پر چالیس تک وہیں کھڑے رہنے کو ترجیح دیتا ۔ ابوالنضر نے کہا کہ مجھے یاد نہیں کہ بسر بن سعید نے چالیس دن کہا یا مہینہ یا سال ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 157,
        "matchingArabicURN": 105090,
        "last_updated": null
    },
    {
        "urduURN": 4005080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 511,
        "hadithSanad": "ہم سے اسماعیل بن خلیل نے بیان کیا ، کہا ہم سے علی بن مسہر نے بیان کیا سلیمان اعمش کے واسطہ سے ، انھوں نے مسلم بن صبیح سے ، انھوں نے مسروق سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے کہ",
        "hadithText": "ان کے سامنے ذکر ہوا کہ نماز کو کیا چیزیں توڑ دیتی ہیں ، لوگوں نے کہا کہ کتا ، گدھا اور عورت ( بھی ) نماز کو توڑ دیتی ہے ۔ ( جب سامنے آ جائے ) حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ تم نے ہمیں کتوں کے برابر بنا دیا ۔ حالانکہ میں جانتی ہوں کہ نبی کریم صلی اللہ علیہ وسلم نماز پڑھ رہے تھے ۔ میں آپ صلی اللہ علیہ وسلم کے اور آپ صلی اللہ علیہ وسلم کے قبلہ کے درمیان ( سامنے ) چارپائی پر لیٹی ہوئی تھی ۔ مجھے ضرورت پیش آتی تھی اور یہ بھی اچھا نہیں معلوم ہوتا تھا کہ خود کو آپ صلی اللہ علیہ وسلم کے سامنے کر دوں ۔ اس لیے میں آہستہ سے نکل آتی تھی ۔ اعمش نے ابراہیم سے ، انھوں نے اسود سے ، انھوں نے عائشہ سے اسی طرح یہ حدیث بیان کی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 158,
        "matchingArabicURN": 105100,
        "last_updated": null
    },
    {
        "urduURN": 4005090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 512,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا ، کہا کہ ہم سے ہشام بن عروہ نے بیان کیا ، کہا مجھ سے میرے باپ نے حضرت عائشہ رضی اللہ عنہا کے واسطے سے بیان کیا ، وہ فرماتی تھیں کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نماز پڑھتے رہتے اور میں ( آپ صلی اللہ علیہ وسلم کے سامنے ) بچھونے پڑ آڑی سوتی ہوئی پڑی ہوتی ۔ جب آپ صلی اللہ علیہ وسلم وتر پڑھنا چاہتے تو مجھے بھی جگا دیتے اور میں بھی وتر پڑھ لیتی تھی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 159,
        "matchingArabicURN": 105110,
        "last_updated": null
    },
    {
        "urduURN": 4005100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 513,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا ، کہا کہ ہمیں امام مالک نے خبر دی عمر بن عبیداللہ کے غلام ابوالنضر سے ، انھوں نے ابوسلمہ عبداللہ بن عبدالرحمٰن سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا سے کہ",
        "hadithText": "آپ رضی اللہ عنہا نے فرمایا ، میں رسول اللہ صلی اللہ علیہ وسلم کے سامنے سو جایا کرتی تھی ۔ میرے پاؤں آپ صلی اللہ علیہ وسلم کے سامنے ( پھیلے ہوئے ) ہوتے ۔ جب آپ صلی اللہ علیہ وسلم سجدہ کرتے تو پاؤں کو ہلکے سے دبا دیتے اور میں انہیں سکیڑ لیتی پھر جب قیام فرماتے تو میں انہیں پھیلا لیتی تھی اس زمانہ میں گھروں کے اندر چراغ نہیں ہوتے تھے ۔ ( معلوم ہوا کہ ایسا کرنا بھی جائز ہے ) ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 160,
        "matchingArabicURN": 105120,
        "last_updated": null
    },
    {
        "urduURN": 4005110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 514,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا کہا ، کہ مجھ سے میرے باپ نے بیان کیا ، کہا کہ ہم سے اعمش نے بیان کیا ، کہا کہ ہم سے ابراہیم نے اسود کے واسطہ سے بیان کیا ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے ( دوسری سند ) اور اعمش نے کہا کہ مجھ سے مسلم بن صبیح نے مسروق کے واسطہ سے بیان کیا ، انھوں نے عائشہ رضی اللہ عنہا سے کہ",
        "hadithText": "ان کے سامنے ان چیزوں کا ذکر ہوا ۔ جو نماز کو توڑ دیتی ہیں یعنی کتا ، گدھا اور عورت ۔ اس پر حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ تم لوگوں نے ہمیں گدھوں اور کتوں کے برابر کر دیا ۔ حالانکہ خود نبی کریم صلی اللہ علیہ وسلم اس طرح نماز پڑھتے تھے کہ میں چارپائی پر آپ صلی اللہ علیہ وسلم کے اور قبلہ کے بیچ میں لیٹی رہتی تھی ۔ مجھے کوئی ضرورت پیش آئی اور چونکہ یہ بات پسند نہ تھی کہ آپ صلی اللہ علیہ وسلم کے سامنے ( جب کہ آپ صلی اللہ علیہ وسلم نماز پڑھ رہے ہوں ) بیٹھوں اور اس طرح آپ صلی اللہ علیہ وسلم کو تکلیف ہو ۔ اس لیے میں آپ صلی اللہ علیہ وسلم کے پاؤں کی طرف سے خاموشی کے ساتھ نکل جاتی تھی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 161,
        "matchingArabicURN": 105130,
        "last_updated": null
    },
    {
        "urduURN": 4005120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 515,
        "hadithSanad": "ہم سے اسحاق بن ابراہیم نے بیان کیا ، کہا کہ ہمیں یعقوب بن ابراہیم نے خبر دی ، کہا کہ مجھ سے میرے بھتیجے ابن شہاب نے بیان کیا ، انھوں نے اپنے چچا سے پوچھا کہ",
        "hadithText": "کیا نماز کو کوئی چیز توڑ دیتی ہے ؟ تو انھوں نے فرمایا کہ نہیں ، اسے کوئی چیز نہیں توڑتی ۔ کیونکہ مجھے عروہ بن زبیر رضی اللہ عنہ نے خبر دی ہے کہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم کھڑے ہو کر رات کو نماز پڑھتے اور میں آپ صلی اللہ علیہ وسلم کے سامنے آپ صلی اللہ علیہ وسلم کے اور قبلہ کے درمیان عرض میں بستر پر لیٹی رہتی تھی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 162,
        "matchingArabicURN": 105140,
        "last_updated": null
    },
    {
        "urduURN": 4005130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 516,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انھوں نے کہا کہ ہمیں امام مالک نے عامر بن عبداللہ بن زبیر رضی اللہ عنہما سے خبر دی ، انھوں نے عمرو بن سلیم زرقی سے ، انھوں نے ابوقتادہ انصاری رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم امامہ بنت زینب بنت رسول اللہ صلی اللہ علیہ وسلم کو ( بعض اوقات ) نماز پڑھتے وقت اٹھائے ہوتے تھے ۔ ابوالعاص بن ربیعہ بن عبدشمس کی حدیث میں ہے کہ سجدہ میں جاتے تو اتار دیتے اور جب قیام فرماتے تو اٹھا لیتے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 163,
        "matchingArabicURN": 105150,
        "last_updated": null
    },
    {
        "urduURN": 4005140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 517,
        "hadithSanad": "ہم سے عمرو بن زرارہ نے بیان کیا ، کہا کہ ہم سے ہشیم نے شیبانی کے واسطے سے بیان کیا ، انھوں نے عبداللہ بن شداد بن ہاد سے ، کہا مجھے میری خالہ میمونہ بنت الحارث رضی اللہ عنہا نے خبر دی کہ",
        "hadithText": "میرا بستر نبی کریم صلی اللہ علیہ وسلم کے مصلے کے برابر میں ہوتا تھا ۔ اور بعض دفعہ آپ صلی اللہ علیہ وسلم کا کپڑا ( نماز پڑھتے میں ) میرے اوپر آ جاتا اور میں اپنے بستر پر ہی ہوتی تھی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 164,
        "matchingArabicURN": 105160,
        "last_updated": null
    },
    {
        "urduURN": 4005150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 518,
        "hadithSanad": "ہم سے ابوالنعمان محمد بن فضل نے بیان کیا ، کہا کہ ہم سے عبدالواحد بن زیاد نے بیان کیا ، کہا ہم سے شیبانی سلیمان نے بیان کیا ، کہا کہ ہم سے عبداللہ بن شداد بن ہاد نے بیان کیا ، کہا ہم نے حضرت میمونہ رضی اللہ عنہا سے سنا ، وہ فرماتی تھیں کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نماز پڑھتے ہوتے اور میں آپ صلی اللہ علیہ وسلم کے برابر میں سوتی رہتی ۔ جب آپ صلی اللہ علیہ وسلم سجدہ میں جاتے تو آپ صلی اللہ علیہ وسلم کا کپڑا مجھے چھو جاتا حالانکہ میں حائضہ ہوتی تھی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 165,
        "matchingArabicURN": 105170,
        "last_updated": null
    },
    {
        "urduURN": 4005160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 519,
        "hadithSanad": "ہم سے عمرو بن علی نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا ، کہا کہ ہم سے عبیداللہ عمری نے بیان کیا ، کہا کہ ہم سے قاسم بن محمد نے بیان کیا ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے ، آپ نے فرمایا کہ",
        "hadithText": "تم نے برا کیا کہ ہم کو کتوں اور گدھوں کے حکم میں کر دیا ۔ خود نبی کریم صلی اللہ علیہ وسلم نماز پڑھ رہے تھے ۔ میں آپ صلی اللہ علیہ وسلم کے سامنے لیٹی ہوئی تھی ۔ جب سجدہ کرنا چاہتے تو میرے پاؤں کو چھو دیتے اور میں انہیں سکیڑ لیتی تھی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 166,
        "matchingArabicURN": 105180,
        "last_updated": null
    },
    {
        "urduURN": 4005170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 520,
        "hadithSanad": "ہم سے احمد بن اسحاق سرماری نے بیان کیا ، انھوں نے کہا کہ ہم سے اسرائیل نے ابواسحاق کے واسطہ سے بیان کیا ۔ انھوں نے عمرو بن میمون سے ، انھوں نے عبداللہ بن مسعود رضی اللہ عنہما سے ، کہا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کعبہ کے پاس کھڑے نماز پڑھ رہے تھے ۔ قریش اپنی مجلس میں ( قریب ہی ) بیٹھے ہوئے تھے ۔ اتنے میں ان میں سے ایک قریشی بولا اس ریاکار کو نہیں دیکھتے ؟ کیا کوئی ہے جو فلاں قبیلہ کے ذبح کئے ہوئے اونٹ کا گوبر ، خون اور اوجھڑی اٹھا لائے ۔ پھر یہاں انتظار کرے ۔ جب یہ ( آنحضور صلی اللہ علیہ وسلم ) سجدہ میں جائے تو گردن پر رکھ دے ( چنانچہ اس کام کو انجام دینے کے لیے ) ان میں سے سب سے زیادہ بدبخت شخص اٹھا اور جب آپ صلی اللہ علیہ وسلم سجدہ میں گئے تو اس نے آپ صلی اللہ علیہ وسلم کی گردن مبارک پر یہ غلاظتیں ڈال دیں ۔ آنحضور صلی اللہ علیہ وسلم سجدہ ہی کی حالت میں سر رکھے رہے ۔ مشرکین ( یہ دیکھ کر ) ہنسے اور مارے ہنسی کے ایک دوسرے پر لوٹ پوٹ ہونے لگے ۔ ایک شخص ( غالباً ابن مسعود رضی اللہ عنہما ) حضرت فاطمہ رضی اللہ عنہا کے پاس آئے ۔ وہ ابھی بچہ تھیں ۔ آپ رضی اللہ عنہا دوڑتی ہوئی آئیں ۔ حضور صلی اللہ علیہ وسلم اب بھی سجدہ ہی میں تھے ۔ پھر ( حضرت فاطمہ رضی اللہ عنہا نے ) ان غلاظتوں کو آپ صلی اللہ علیہ وسلم کے اوپر سے ہٹایا اور مشرکین کو برا بھلا کہا ۔ آنحضور صلی اللہ علیہ وسلم نے نماز پوری کر کے فرمایا ’’ یا اللہ قریش پر عذاب نازل کر ۔ یا اللہ قریش پر عذاب نازل کر ۔ یا اللہ قریش پر عذاب نازل کر ۔ ‘‘ پھر نام لے کر کہا خدایا ! عمرو بن ہشام ، عتبہ بن ربیعہ ، شیبہ بن ربیعہ ، ولید بن عتبہ ، امیہ بن خلف ، عقبہ بن ابی معیط اور عمارہ ابن ولید کو ہلاک کر ۔ عبداللہ بن مسعود رضی اللہ عنہما نے کہا ، خدا کی قسم ! میں نے ان سب کو بدر کی لڑائی میں مقتول پایا ۔ پھر انہیں گھسیٹ کر بدر کے کنویں میں پھینک دیا گیا ۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ کنویں والے خدا کی رحمت سے دور کر دئیے گئے ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 167,
        "matchingArabicURN": 105190,
        "last_updated": null
    },
    {
        "urduURN": 4004031,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 402,
        "hadithSanad": "",
        "hadithText": "ہم سے عمرو بن عون نے بیان کیا ، کہا ہم سے ہشیم نے حمید کے واسطہ سے ، انھوں نے انس بن مالک رضی اللہ عنہ کے واسطہ سے کہ عمر رضی اللہ عنہ نے فرمایا کہمیری تین باتوں میں جو میرے منہ سے نکلا میرے رب نے ویسا ہی حکم فرمایا ۔ میں نے کہا تھا کہ یا رسول اللہ ! اگر ہم مقام ابراہیم کو نماز پڑھنے کی جگہ بنا سکتے تو اچھا ہوتا ۔ اس پر یہ آیت نازل ہوئی ۔ ’’ اور تم مقام ابراہیم کو نماز پڑھنے کی جگہ بنا لو ‘‘ دوسری آیت پردہ کے بارے میں ہے ۔ میں نے کہا تھا کہ یا رسول اللہ کاش ! آپ اپنی عورتوں کو پردہ کا حکم دیتے ، کیونکہ ان سے اچھے اور برے ہر طرح کے لوگ بات کرتے ہیں ۔ اس پر پردہ کی آیت نازل ہوئی اور ایک مرتبہ آنحضور صلی اللہ علیہ وسلم کی بیویاں جوش و خروش میں آپ کی خدمت میں اتفاق کر کے کچھ مطالبات لے کر حاضر ہوئیں ۔ میں نے ان سے کہا کہ ہو سکتا ہے کہ اللہ پاک تمہیں طلاق دلا دیں اور تمہارے بدلے تم سے بہتر مسلمہ بیویاں اپنے رسول صلی اللہ علیہ وسلم کو عنایت کریں ، تو یہ آیت نازل ہوئی «عسى ربه إن طلقكن أن يبدله أزواجا خيرا منكن‏»</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 104040,
        "last_updated": null
    },
    {
        "urduURN": 4004032,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 8,
        "bookName": "کتاب نماز کے احکام و مسائل",
        "babNumber": null,
        "babName": "",
        "hadithNumber": 402,
        "hadithSanad": "",
        "hadithText": "اور سعید ابن ابی مریم نے کہا کہ مجھے یحییٰ بن ایوب نے خبر دی ، کہا کہ ہم سے حمید نے بیان کیا ، کہا میں نے حضرت انس رضی اللہ عنہ سے یہ حدیث سنی ۔</b>",
        "bookID": "8.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 104050,
        "last_updated": null
    }
]