[
    {
        "urduURN": 4062170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6304,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابوالزناد نے ، ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہر نبی کو ایک دعا حاصل ہوتی ہے ( جو قبو ل کی جاتی ہے ) اور میں چاہتا ہوں کہ میں اپنی دعا کو آخرت میں اپنی امت کی شفاعت کے لئے محفوظ رکھوں ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 154080,
        "last_updated": null
    },
    {
        "urduURN": 4062180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6305,
        "hadithSanad": "اور معتمر نے بیان کیا ، انہوں نے اپنے والد سے سنا ، انہوں نے حضرت انس رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ہر نبی نے کچھ چیزیں مانگیں یا فرمایا کہ ہر نبی کو ایک دعا دی گئی جس چیز کی اس نے دعا مانگی پھر اسے قبول کیا گیا لیکن میں نے اپنی دعا قیامت کے دن اپنی امت کی شفاعت کے لئے محفوظ رکھی ہوئی ہے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 154090,
        "last_updated": null
    },
    {
        "urduURN": 4062190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6306,
        "hadithSanad": "ہم سے ابو معمر نے بیان کیا ، کہا ہم سے عبدالوارث بن سعید نے بیان کیا ، کہا ہم سے حسین بن ذکوان معلم نے بیان کیا ، کہا ہم سے عبداللہ بن بریدہ نے بیان کیا ان سے بشیر بن کعب عدوی نے کہا کہ مجھ سے شداد بن اوس رضی اللہ عنہ نے بیان کیا",
        "hadithText": "اور ان سے رسول اللہ صلی اللہ علیہ وسلم نے کہ سیدالاستغفار ۔ ( مغفرت مانگنے کے سب کلمات کا سردار ) یہ ہے یوں کہے ، ‏ اے اللہ ! تو میرا رب ہے ، تیرے سوا کوئی معبود نہیں ۔ تو نے ہی مجھے پیدا کیا اور میں تیرا ہی بندہ ہوں میں اپنی طاقت کے مطابق تجھ سے کئے ہوئے عہد اور وعدہ پرقائم ہوں ۔ ان بری حرکتوں کے عذاب سے جو میں نے کی ہیں تیری پناہ مانگتا ہوں مجھ پر نعمتیں تیری ہیں اس کااقرار کرتا ہوں ۔ میری مغفرت کر دے کہ تیرے سوا اور کوئی بھی گناہ نہیں معاف کرتا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جس نے اس دعا کے الفاظ پر یقین رکھتے ہوئے دل سے ان کو کہہ لیا اور اسی دن اس کا انتقال ہو گیا شام ہونے سے پہلے تو وہ جنتی ہے اور جس نے اس دعا کے الفاظ پر یقین رکھتے ہوئے رات میں ان کو پڑھ لیا اور پھر اس کاصبح ہونے سے پہلے انتقال ہو گیا تو وہ جنتی ہے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 154100,
        "last_updated": null
    },
    {
        "urduURN": 4062200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6307,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے کہا کہ مجھے ابوسلمہ بن عبدالرحمٰن نے خبر دی ، انہوں نے کہا کہ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کی قسم میں دن میں ستر مرتبہ سے زیادہ اللہ سے استغفار اور اس سے توبہ کرتا ہوں ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 154110,
        "last_updated": null
    },
    {
        "urduURN": 4062210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6308,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، کہا ہم سے ابو شہاب نے ، ان سے اعمش نے ، ان سے عمارہ بن عمیر نے ، ان سے حارث بن سوید اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے دو احادیث ( بیان کیں )",
        "hadithText": "ایک نبی کریم صلی اللہ علیہ وسلم سے اور دوسری خود اپنی طرف سے کہا کہ مومن اپنے گناہوں کو ایسا محسوس کرتا ہے جیسے وہ کسی پہاڑ کے نیچے بیٹھا ہے اور ڈرتا ہے کہ کہیں وہ اس کے اوپر نہ گر جائے اور بدکار اپنے گناہوں کو مکھی کی طرح ہلکا سمجھتا ہے کہ وہ اس کے ناک کے پاس سے گزری اور اس نے اپنے ہاتھ سے یوں اس طرف اشارہ کیا ۔ ابو شہاب نے ناک پر اپنے ہاتھ کے اشارہ سے اس کی کیفیت بتائی پھر انہوں نے رسول اللہ صلی اللہ علیہ وسلم کی یہ حدیث بیان کی ۔ اللہ تعالیٰ اپنے بندہ کی توبہ سے اس شخص سے بھی زیادہ خوش ہوتا ہے جس نے کسی پر خطر جگہ پڑاؤ کیا ہو اس کے ساتھ اس کی سواری بھی ہو اور اس پر کھانے پینے کی چیزیں موجود ہوں ۔ وہ سررکھ کر سوگیا ہو اور جب بیدا ر ہوا ہو تو اس کی سواری غائب رہی ہو ۔ آخر بھوک وپیاس یا جو کچھ اللہ نے چاہا اسے سخت لگ جائے وہ اپنے دل میں سوچے کہ مجھے اب گھر واپس چلا جانا چاہئے اور جب وہ واپس ہوا اور پھر سوگیا لیکن اس نیند سے جو سر اٹھایا تو اس کی سواری وہاں کھانا پینا لئے ہوئے سامنے کھڑی ہے تو خیال کرو اس کو کس قدر خوشی ہو گی ۔ ابوشہاب کے ساتھ اس حدیث کو ابو عوانہ اور جریر نے بھی اعمش سے روایت کیا ، اور شعبہ اور ابومسلم ( عبیداللہ بن سعید ) نے اس کو اعمش سے روایت کیا ، انہوں نے ابراہیم تیمی سے ، انہوں نے حارث بن سویدسے اور ابومعاویہ نے یوں کہا ہم سے اعمش نے بیان کیا ، انہوں نے عمارہ سے انہوں نے اسود بن یزید سے ، انہوں نے عبداللہ بن مسعود رضی اللہ عنہما سے ۔ اور ہم سے اعمش نے بیان کیا انہوں نے ابراہیم تیمی سے ، انہوں نے حارث بن سوید سے ، انہوں نے عبداللہ بن مسعود رضی اللہ عنہما سے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 154130,
        "last_updated": null
    },
    {
        "urduURN": 4062220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6309,
        "hadithSanad": "ہم سے اسحاق بن منصور نے بیان کیا ، کہا ہم کو حبان بن ہلال نے خبر دی ، کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا اور ان سے نبی کریم صلی اللہ علیہ وسلم نے ( دوسری سند ) امام بخاری نے کہا کہ ہم سے ہدبہ نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا ، ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ اللہ تعالیٰ اپنے بندے کی توبہ سے تم میں سے اس شخص سے بھی زیادہ خوش ہوتا ہے جس کا اونٹ مایوسی کے بعد اچانک اسے مل گیا ہو حالانکہ وہ ایک چٹیل میدان میں گم ہوا تھا ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 154140,
        "last_updated": null
    },
    {
        "urduURN": 4062230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6310,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، انہوں نے کہا ہم سے ہشام بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں عروہ نے اور انہیں حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم رات میں ( تہجدکی ) گیارہ رکعات پڑھتے تھے پھر جب فجر طلوع ہو جاتی تو دوہلکی رکعات ( سنت فجر ) پڑھتے ۔ اس کے بعد آپ دائیں پہلو لیٹ جاتے آخر مؤذن آتا اور آنحضرت صلی اللہ علیہ وسلم کو اطلاع دیتا ۔ تو آپ فجر کی نماز پڑھاتے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 154150,
        "last_updated": null
    },
    {
        "urduURN": 4062240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6311,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے معتمر بن سلیمان نے بیان کیا ، کہا کہ میں نے منصور سے سنا ، ان سے سعد بن عبیدہ نے بیان کیا کہ مجھ سے براء  بن عازب رضی اللہ عنہ نے بیان کیا ، انہوں نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب تو سونے لگے تو نماز کے وضو کی طرح وضو کرپھر دائیں کروٹ لیٹ جا اور یہ دعا پڑھ ۔ ” اے اللہ ! میں نے اپنے آپ کو تیر ی اطاعت میں دے دیا ۔ اپنا سب کچھ تیرے سپرد کر دیا ۔ اپنے معاملات تیرے حوالے کر دئیے ۔ خوف کی وجہ سے اور تیری ( رحمت و ثواب کی ) امید میں کوئی پناہ گا ہ کوئی مخلص تیرے سوا نہیں میں تیری کتاب پر ایمان لایا جو تو نے نازل کی ہے اور تیرے نبی پر جن کو تو نے بھیجاہے “ اس کے بعد اگر تم مرگئے تو فطرت ( دین اسلام پر مروگے پس ان کلمات کو ( رات کی ) سب سے آخری با ت بناؤ جنہیں تم اپنی زبان سے اداکرو ( حضرت براء  بن عازب رضی اللہ عنہ نے بیان کیا ) میں نے عرض کی ” وبر سولک الذی ارسلت “ کہنے میں کیا وجہ ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں وبنبیک الذی ارسلت کہو ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 154160,
        "last_updated": null
    },
    {
        "urduURN": 4062250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6312,
        "hadithSanad": "ہم سے قبیصہ بن عقبہ نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے عبدالملک بن عمیر نے ، ان سے ربعی بن حراش نے اور ان سے حضرت حذیفہ بن یمان رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جب اپنے بستر پر لیٹتے تو یہ کہتے ” تیرے ہی نام کے ساتھ میں مردہ اور زندہ رہتا ہوں اور جب بیدار ہوتے تو کہتے اسی اللہ کے لئے تمام تعریفیں ہیں جس نے ہمیں زندہ کیا ۔ اس کے بعد کہ اس نے موت طاری کر دی تھی اور اسی کی طرف لوٹنا ہے ۔ قرآن شریف میں جو لفظ ننشزھا ہے اس کا بھی یہی معنی ہے کہ ہم اس کو نکال کر اٹھاتے ہیں ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 154170,
        "last_updated": null
    },
    {
        "urduURN": 4062260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6313,
        "hadithSanad": "ہم سے سعید بن ربیع اور محمد بن عرعرہ نے بیان کیا ، ان دونوں نے کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے ابواسحاق نے بیان کیا ، انہوں نے حضرت براء بن عاب رضی اللہ عنہما سے سناکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک صحابی کو حکم دیا ( دوسری سند ) حضرت امام بخاری رحمہ اللہ نے کہا کہ ہم سے آدم نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیاان سے ابواسحاق ہمدانی نے بیان کیا ، اور ان سے حضرت براء  بن عازب رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ایک صحابی کو وصیت کی اور فرمایا کہ جب بستر پر جانے لگو تو یہ دعا پڑھا کرو ۔ “ اے اللہ ! میں نے اپنی جان تیرے سپرد کی اور اپنا معاملہ تجھے سونپا اور اپنے آپ کو تیری طرف متوجہ کیا او تجھ پر بھروسہ کیا ، تیری طرف رغبت ہے تیرے خوف کی وجہ سے ، تجھ سے تیرے سوا کوئی جائے پناہ نہیں ، میں تیری کتاب پر ایمان لایا جو تو نے نازل کی اور تیرے نبی پر جنہیں تو نے بھیجا ۔ “ پھر اگر وہ مراتو فطرت ( اسلام ) پر مرے گا ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 154180,
        "last_updated": null
    },
    {
        "urduURN": 4062270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6314,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ابو عوانہ نے بیان کیا ، ان سے عبدالملک بن عمیر نے ، ان سے ربعی نے اور ان سے حضرت حذیفہ رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جب رات میں بستر پر لیٹتے تو اپنا ہاتھ اپنے رخسار کے نیچے رکھتے اور یہ کہتے ” اے اللہ ! تیرے نام کے ساتھ مرتا ہوں اور زندہ ہوتا ہوں ۔ “ اور جب آپ بیدار ہوتے تو کہتے ۔ ” تمام تعریفیں اس اللہ کے لئے ہیں جس نے ہمیں زندہ کیا اس کے بعد کہ ہمیں موت ( مراد نیند ہے ) دے دی تھی اور تیری ہی طرف جانا ہے ۔ “</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 154190,
        "last_updated": null
    },
    {
        "urduURN": 4062280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6315,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے عبد الواحد نے بیان کیا ، انہوں نے کہا ہم سے علاء بن مسیب نے بیان کیا ، انہوں نے کہا کہ مجھ سے میرے باپ نے بیان کیا اور ان سے حضر ت براء  بن عازب رضی اللہ عنہما نے بیان کیاکہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم جب اپنے بستر پر لیٹتے تو دائیں پہلو پر لیٹتے اور پھر کہتے اللهم أسلمت نفسي إليك ، ‏‏‏‏ ووجهت وجهي إليك ، ‏‏‏‏ وفوضت أمري إليك ، ‏‏‏‏ وألجأت ظهري إليك ، ‏‏‏‏ رغبۃ ورهبۃ إليك ، ‏‏‏‏ لا ملجأ ولا منجا منك إلا إليك ، ‏‏‏‏ آمنت بكتابك الذي أنزلت ، ‏‏‏‏ ونبيك الذي أرسلت‏‏ ۔ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جس شخص نے یہ دعا پڑھی اور پھر اس رات اگر اس کی وفات ہو گئی تو اس کی وفات فطرت پر ہو گی ۔ قرآن مجید میں جو استرهبوهم‏ کا لفظ آیا ہے یہ بھی رھبت سے نکالا ہے ( رھبت کے معنی ڈر کے ہیں ) ملکوت کا معنی ملک یعنی سلطنت جیسے کہتے ہیں کہ رهبوت رحموت سے بہتر ہے یعنی ڈرانا رحم کرنے سے بہتر ہے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 154200,
        "last_updated": null
    },
    {
        "urduURN": 4062290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6316,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے عبدالرحمٰن ابن مہدی نے ، ان سے سفیان ثوری نے ، ان سے سلمہ بن کہیل نے ، ان سے کریب نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں میمونہ ( رضی اللہ عنہا ) کے یہاں ایک رات سویا تو نبی کریم صلی اللہ علیہ وسلم اٹھے اور آپ نے اپنی حوائج ضرورت پوری کرنے کے بعد اپنا چہرہ دھویا ، پھر دونوں ہاتھ دھوئے اور پھر سو گئے اس کے بعد آپ کھڑے ہو گئے اور مشکیزہ کے پاس گئے اور آپ نے اس کا منہ کھولا پھر درمیانہ وضو کیا ( نہ مبالغہ کے ساتھ نہ معمولی اور ہلکے قسم کا ، تین تین مرتبہ سے ) کم دھویا ۔ البتہ پانی ہرجگہ پہنچا دیا ۔ پھر آپ نے نماز پڑھی ۔ میں بھی کھڑا ہوا اور آپ کے پیچھے ہی رہا کیونکہ میں اسے پسند نہیں کرتا تھا کہ آنحضرت صلی اللہ علیہ وسلم یہ سمجھیں کہ میں آپ کا انتظار کر رہا تھا ۔ میں نے بھی وضو کر لیا تھا ۔ آنحضور صلی اللہ علیہ وسلم جب کھڑے ہو کر نماز پڑھنے لگے تو میں بھی آپ کے بائیں طرف کھڑا ہو گیا ۔ آپ نے میرا کان پکڑ کر دائیں طرف کر دیا ، میں نے آنحضرت صلی اللہ علیہ وسلم ( کی اقتداء میں ) تیرہ رکعت نماز مکمل کی ۔ اس کے بعد آپ سو گئے اور آپ کی سانس میں آواز پیدا ہونے لگی ۔ آنحضرت صلی اللہ علیہ وسلم جب سوتے تھے تو آپ کی سانس میں آواز پیدا ہونے لگتی تھی ۔ اس کے بعد بلال رضی اللہ عنہ نے آپ کو نماز کی اطلاع دی چنانچہ آپ نے ( نیا وضو ) کئے بغیر نماز پڑھی ۔ آنحضرت صلی اللہ علیہ وسلم اپنی دعا میں یہ کہتے تھے “ اے اللہ ! میرے دل میں نور پیدا کر ، میری نظر میں نور پیدا کر ، میرے کان میں نور پیدا کر ، میرے دائیں طرف نور پیدا کر ، میرے بائیں طرف نور پیدا کر ، میرے اوپر نور پیدا کر ، میرے نیچے نور پیدا کر میرے آگے نور پیدا کر ، میرے پیچھے نور پیدا کر اور مجھے نور عطا فرما ۔ کریب ( راوی حدیث ) نے بیان کیا کہ میرے پاس مزید سات لفظ محفوظ ہیں ۔ پھر میں نے عباس رضی اللہ عنہما کے ایک صاحب زاد ے سے ملاقات کی تو انہوں نے مجھ سے ان کے متعلق بیان کیا کہ ” میرے پٹھے ، میرا گوشت ، میرا خون ، میرے بال اور میرا چمڑا ان سب میں نور بھر دے “ اور دو چیزوں کا اور بھی ذکر کیا ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 154210,
        "last_updated": null
    },
    {
        "urduURN": 4062300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6317,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا ، انہوں نے کہا میں نے سلیمان بن ابی مسلم سے سنا ، انہوں نے طاؤس سے روایت کیا اور انہوں نے حضرت ابن عباس رضی اللہ عنہما سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جب رات میں تہجد کے لئے کھڑے ہوتے تو یہ دعا کرتے ۔ ” اے اللہ ! تیرے ہی لئے تمام تعریفیں ہیں تو آسمان و زمین اور ان میں موجود تمام چیزوں کا نور ہے ، تیرے ہی لئے تمام تعریفیں ہیں تو آسمان اور زمین اور ان میں موجود تمام چیزوں کا قائم رکھنے والا ہے اور تیرے ہی لئے تمام تعریفیں ہیں ، تو حق ہے ، تیرا وعدہ حق ہے ، تیراقول حق ہے ، تجھ سے ملناحق ہے ، جنت حق ہے ، دوزخ حق ہے ، قیامت حق ہے ، انبیاء حق ہیں اور محمدرسول اللہ صلی اللہ علیہ وسلم حق ہیں ۔ اے اللہ ! تیرے سپر د کیا ، تجھ پر بھروسہ کیا ، تجھ پر ایمان لایا ، تیری طرف رجوع کیا ، دشمنوں کا معاملہ تیرے سپرد کیا ، فیصلہ تیرے سپرد کیا ، پس میری اگلی پچھلی خطائیں معاف کر ۔ وہ بھی جو میں نے چھپ کر کی ہیں اور وہ بھی جو کھل کر کی ہیں تو ہی سب سے پہلے ہے اور تو ہی سب سے بعد میں ہے ، صرف تو ہی معبود ہے اور تیرے سوا کوئی معبو د نہیں ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 154220,
        "last_updated": null
    },
    {
        "urduURN": 4062310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6318,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ بن حجاج نے بیان کیا ، ان سے حکم بن عیینہ نے ، ان سے ابن ابی لیلی ٰ نے ، ان سے علی رضی اللہ عنہ نے کہ",
        "hadithText": "فاطمہ رضی اللہ عنہا نے چکی پیسنے کی تکلیف کی وجہ سے کہ ان کے مبارک ہاتھ کو صدمہ پہنچتا ہے تو نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ایک خادم مانگنے کے لئے حاضر ہوئیں ۔ آنحضرت صلی اللہ علیہ وسلم گھر میں موجود نہیں تھے ۔ اس لئے انہوں نے حضرت عائشہ رضی اللہ عنہا سے ذکر کیا ۔ جب آپ تشریف لائے تو حضرت عائشہ رضی اللہ عنہا نے آپ سے اس کا ذکر کیا ۔ حضرت علی رضی اللہ عنہ نے بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم ہمارے یہاں تشریف لائے ہم اس وقت تک اپنے بستروں پر لیٹ چکے تھے میں کھڑا ہونے لگا تو آپ نے فرمایا کہ کیا میں تم دونوں کو وہ چیز نہ بتادوں جو تمہارے لئے خادم سے بھی بہتر ہو ۔ جب تم اپنے بسترپر جانے لگو تو تینتیس ( 33 ) مرتبہ اللہ اکبر کہو ، تینتیس ( 33 ) مرتبہ سبحان اللہ کہو اور تینتیس ( 33 ) مرتبہ الحمدللہ کہو ، یہ تمہارے لئے خادم سے بہتر ہے اور شعبہ سے روایت ہے ان سے خالد نے ، ان سے ابن سیرین نے بیان کیا کہ سبحان اللہ چونتیس مرتبہ کہو ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 154230,
        "last_updated": null
    },
    {
        "urduURN": 4062320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6319,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، انہوں نے کہا کہ مجھ سے عقیل نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، انہیں عروہ نے خبر دی اور انہیں ام المؤمنین حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "جب رسول اللہ صلی اللہ علیہ وسلم لیٹتے تو اپنے ہاتھوں پر پھونکتے اور معوذات پڑھتے اوردونوں ہاتھ اپنے جسم پر پھیر تے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 154240,
        "last_updated": null
    },
    {
        "urduURN": 4062330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6320,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، کہا ہم سے زہیر نے بیان کیا ، کہا ہم سے عبیداللہ بن عمرنے بیان کیا ، کہامجھ سے سعید بن ابی سعید مقبری نے بیان کیا ، ان سے ان کے باپ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب تم میں سے کوئی شخص بستر پر لیٹے تو پہلے اپنا بستر اپنے ازار کے کنارے سے جھاڑ لے کیونکہ وہ نہیں جانتا کہ اس کی بےخبر دی میں کیا چیز اس پر آ گئی ہے ۔ پھر یہ دعا پڑھے ” میرے پالنے والے ! تیرے نام سے میں نے اپنا پہلو رکھا ہے اور تیرے ہی نام سے اٹھا ؤں گا اگر تو نے میری جان کو روک لیا تو اس پر رحم کرنا اور اگر چھوڑ دیا ( زندگی باقی رکھی ) تو اس کی اس طرح حفاظت کرنا جس طرح تو صالحین کی حفاظت کرتا ہے ۔ “ اس کی روایت ابو ضمرہ اور اسماعیل بن زکریا نے عبیداللہ کے حوالے سے کی اور یحییٰ اور بشر نے بیان کیا ، ان سے عبیداللہ نے ، ان سے سعید نے ، ان سے ابوہریرہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے اور اس کی روایت امام مالک اور ابن عجلان نے کی ہے ۔ ان سے سعید نے ، ان سے ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے اس طرح روایت کی ہے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 154250,
        "last_updated": null
    },
    {
        "urduURN": 4062340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6321,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا ہم سے امام مالک نے بیان کیا ، ان سے ابن شہاب نے ، ان سے ابوعبداللہ الاغر اور ابوسلمہ بن عبدالرحمٰن نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ہمارا رب تبارک وتعالیٰ ہر رات آسمان دنیا کی طرف نزول فرماتا ہے ، اس وقت جب رات کا آخری تہائی حصہ باقی رہ جاتا ہے اور فرماتا ہے کون ہے جو مجھ سے دعا کرتا ہے کہ میں اس کی دعا قبول کروں ، کون ہے جو مجھ سے مانگتا ہے کہ میں اسے دوں ، کون ہے جو مجھ سے بخشش طلب کرتا ہے کہ میں اس کی بخشش کروں ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 154260,
        "last_updated": null
    },
    {
        "urduURN": 4062350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6322,
        "hadithSanad": "ہم سے محمد بن عرعرہ نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے عبدالعزیز بن صہیب نے بیان کیا اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جب بیت الخلاء جاتے تو یہ دعا پڑھتے ” اللهم إني أعوذ بك من الخبث والخبائث “ ” اے اللہ ! میں خبیث جنوں اور جنیوں کی برائی سے تیری پناہ مانگتا ہوں ۔ “</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 154270,
        "last_updated": null
    },
    {
        "urduURN": 4062360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6323,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، کہا ہم سے حسین نے بیان کیا ، کہا ہم سے عبداللہ بن بریدہ نے بیان کیا ، ان سے بشیر بن کعب نے اور ان سے شداد بن اوس رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا سب سے عمدہ استغفار یہ ہے ۔ اللهم أنت ربي لا إله إلا أنت ، ‏‏‏‏ خلقتني وأنا عبدك ، ‏‏‏‏ وأنا على عهدك ووعدك ما استطعت ، ‏‏‏‏ أبوء لك بنعمتك ، ‏‏‏‏ وأبوء لك بذنبي ، ‏‏‏‏ فاغفر لي ، ‏‏‏‏ فإنه لا يغفر الذنوب إلا أنت ، ‏‏‏‏ أعوذ بك من شر ما صنعت‏ ” اے اللہ ! تو میرا پالنے والا ہے تیرے سوا کوئی معبود نہیں تو نے مجھے پیدا کیا اور میں تیرا بندہ ہوں اور میں تیرے عہد پر قائم ہوں اور تیرے وعدہ پر ۔ جہاں تک مجھ سے ممکن ہے ۔ تیری نعمت کا طالب ہو کر تیری پناہ میں آتا ہوں اور اپنے گناہوں سے تیری پناہ چاہتا ہوں ، پس تو میری مغفرت فرماکیونکہ تیرے سوا گناہ اور کوئی نہیں معاف کرتا ۔ میں تیری پناہ مانگتا ہوں اپنے برے کاموں سے ۔ اگر کسی نے رات ہوتے ہی یہ کہہ لیااور اسی رات اس کاانتقال ہو گیا تو وہ جنت میں جائے گا ۔ یا ( فر مایا کہ ) وہ اہل جنت میں ہو گا اور اگر یہ دعا صبح کے وقت پڑھی اور اسی دن اس کی وفات ہو گئی تو بھی ایسا ہی ہو گا ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 154280,
        "last_updated": null
    },
    {
        "urduURN": 4062370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6324,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عبدالملک بن عمیر نے ، ان سے ربعی بن حراش نے اور ان سے حضرت حذیفہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جب سو نے کا ارادہ کرتے تو کہتے باسمك اللهم أموت وأحيا ” تیر ے نام کے ساتھ اے اللہ ! میں مر تا اور تیر ے ہی نام سے جیتا ہوں “ اور جب بیدار ہوتے تو یہ دعا پڑھتے ۔ الحمد لله الذي أحيانا بعد ما أماتنا ، ‏‏‏‏ ‏‏‏‏ وإليه النشور ‏ ” تمام تعریفیں اس اللہ کے لئے ہیں جس نے ہمیں موت کے بعد زند گی بخشی اور اسی کی طرف ہم کو لوٹناہے ۔ “</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 154290,
        "last_updated": null
    },
    {
        "urduURN": 4062380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6325,
        "hadithSanad": "ہم سے عبداللہ نے بیان کیا ، ان سے ابوحمزہ محمد بن میمون نے ، ان سے منصور بن معمر نے ، ان سے ربعی بن حراش نے ، ان سے خرشہ بن الحر نے اور ان سے حضرت ابوذر غفاری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جب رسول اللہ رات میں اپنی خواب گاہ پر جاتے تو کہتے للهم باسمك أموت وأحيا ” اے اللہ ! میں تیر ے ہی نام سے مر تا ہوں اور تیرے ہی نام سے زندہ ہوتا ہوں “ اور جب بیدار ہوتے تو فر ماتے الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏ ” تمام تعریفیں اس اللہ کے لئے ہیں جس نے ہمیں موت کے بعد زندگی بخشی اور اسی کی طرف ہم کو جانا ہے “</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 154300,
        "last_updated": null
    },
    {
        "urduURN": 4062390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6326,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا ہم کو لیث بن سعد نے خبر دی ، کہا کہ مجھ سے یزید بن ابی حبیب نے بیان کیا ، ان سے ابو الخیر مرثدبن عبداللہ نے ، ان سے عبداللہ بن عمر وبن عاص رضی اللہ عنہما نے اور ان سے حضرت ابوبکر صدیق رضی اللہ عنہ نے کہ",
        "hadithText": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے کہا کہ مجھے ایسی دعا سکھا دیجئیے جسے میں اپنی نماز میں پڑھا کروں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ کہا کر قل : اللهم إني ظلمت نفسي ظلما كثيرا ، ‏‏‏‏ ولا يغفر الذنوب إلا أنت ، ‏‏‏‏ فاغفر لي مغفرۃ من عندك ، ‏‏‏‏ وارحمني ، ‏‏‏‏ إنك أنت الغفور الرحيم ” اے اللہ ! میں نے اپنی جان پر بہت ظلم کیا ہے اور گناہوں کوتیرے سوا کوئی معاف نہیں کرتا پس میری مغفرت کر ، ایسی مغفرت جو تیرے پاس سے ہو اور مجھ پر رحم کر بلاشبہ تو بڑا مغفرت کرنے ولا ، بڑا رحم کرنے والا ہے ۔ “ اور عمرو بن حارث نے بھی اس حدیث کو یزید سے ، انہوں نے ابوالخیر سے ، انہوں نے حضرت عبداللہ بن عمر ورضی اللہ عنہ سے سنا کہ حضرت ابوبکر صدیق رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے عرض کیا آخر تک ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 154311,
        "last_updated": null
    },
    {
        "urduURN": 4062400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6327,
        "hadithSanad": "ہم سے علی نے بیان کیا ، کہا ہم سے مالک بن سعیر نے بیان کیا ، ان سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "” ولا تجھر بصلٰوتک ولاتخافت بھا “ دعا کے بارے میں نازل ہوئی ( کہ نہ بہت زور زور سے اور نہ بالکل آہستہ آہستہ ) بلکہ درمیانی راستہ اختیار کرو ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 154330,
        "last_updated": null
    },
    {
        "urduURN": 4062410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6328,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، انہوں نے کہا ہم سے جریر بن عبدالحمید نے بیان کیا ، انہوں نے کہا ہم سے منصور بن معتمر نے بیان کیا ، ان سے ابووائل نے بیان کیا اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیاکہ",
        "hadithText": "ہم نماز میں یہ کہا کرتے تھے کہ اللہ پر سلام ہو ، فلاں پر سلام ہو ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے ہم سے ایک دن فرمایا کہ اللہ خود سلام ہے اس لئے جب تم نماز میں بیٹھوتو یہ پڑھا کرو ۔ ” التحيات لله “ ارشاد ” الصالحين‏ “ تک اس لئے کہ جب تم یہ کہو گے تو آسمان و زمین میں موجود اللہ تبارک وتعالیٰ کے ہر صالح بندہ کو پہنچے گا ۔ أشهد أن لا إله إلا الله ، ‏‏‏‏ وأشهد أن محمدا عبده ورسوله‏ ۔ اس کے بعد ثنا میں اختیار ہے جو دعا چاہو پڑھو ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 154340,
        "last_updated": null
    },
    {
        "urduURN": 4062420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6329,
        "hadithSanad": "مجھ سے اسحاق بن منصور نے بیان کیا ، کہا ہم کو زید بن ہارون نے خبر دی ، کہا ہم کو ورقاء نے خبر دی ، انہیں سمی نے ، انہیں ابوصالح ذکوان نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "صحابہ کرام نے عرض کیا یا رسول اللہ ! مالدار لوگ بلند درجات اور ہمیشہ رہنے والی جنت کی نعمتوں کو حاصل کر لے گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ کیسے ؟ صحابہ کرام نے عرض کیا جس طرح ہم نماز پڑھتے ہیں وہ بھی پڑھتے ہیں اور جس طرح ہم جہاد کرتے ہیں وہ بھی جہاد کرتے ہیں اور اس کے ساتھ وہ اپنا زائد مال بھی ( اللہ کے راستہ میں ) خرچ کرتے ہیں اور ہمارے پاس مال نہیں ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایاکیا میں تمہیں ایک ایسا عمل نہ بتلاؤں جس سے تم اپنے آگے کے لوگوں کے ساتھ ہو جاؤ اور اپنے پیچھے آنے والوں سے آگے نکل جاؤ اور کوئی شخص اتنا ثواب نہ حاصل کر سکے جتنا تم نے کیا ہو ، سوا اس صورت کے جب کہ وہ بھی وہی عمل کرے جو تم کرو گے ( اور وہ عمل یہ ہے ) کہ ہر نماز کے بعد دس مرتبہ سبحان اللہ پڑھا کرو ، دس مرتبہ الحمدللہ پڑھا کرو اور دس مرتبہ اللہ اکبر پڑھا کرو ۔ اس کی روایت عبیداللہ بن عمر نے سمی اور رجاء بن حیوہ سے کی اور اس کی روایت جریر نے عبد العزیز بن رفیع سے کی ، ان سے ابوصالح نے اور ان سے حضرت ابودرداء رضی اللہ عنہ نے ۔ اور اس کی روایت سہیل نے اپنے والد سے کی ، ان سے حضرت ابوہریرہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 154350,
        "last_updated": null
    },
    {
        "urduURN": 4062430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6330,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے جریربن عبدالحمید نے بیان کیا ، ان سے منصور بن معتمر نے ، ان سے مسیب بن رافع نے ، ان سے حضرت مغیرہ بن شعبہ رضی اللہ عنہ کے مولا وراد نے بیان کیاکہ",
        "hadithText": "حضرت مغیرہ بن شعبہ نے حضرت معاویہ بن ابی سفیان رضی اللہ عنہما کو لکھا کہ رسول اللہ صلی اللہ علیہ وسلم ہرنماز کے بعد جب سلام پھیرتے تو یہ کہا کرتے تھے کہ لا إله إلا الله ، ‏‏‏‏ ‏‏‏‏ وحده لا شريك له ، ‏‏‏‏ ‏‏‏‏ له الملك ، ‏‏‏‏ ‏‏‏‏ وله الحمد ، ‏‏‏‏ ‏‏‏‏ وهو على كل شىء قدير ، ‏‏‏‏ ‏‏‏‏ اللهم لا مانع لما أعطيت ، ‏‏‏‏ ‏‏‏‏ ولا معطي لما منعت ، ‏‏‏‏ ‏‏‏‏ ولا ينفع ذا الجد منك الجد اللہ کے سوا کوئی معبود نہیں وہ تنہاء ہے اس کا کوئی شریک نہیں ، ملک اسی کے لئے ہے اور اسی کے لئے تمام تعریفیں ہیں اور وہ ہر چیز پر قدرت رکھنے والا ہے ۔ اے اللہ ! جو کچھ تو نے دیا ہے اسے کوئی روکنے والا نہیں اور جو کچھ تو نے روک دیا اسے کوئی دینے والا نہیں اور کسی مالدار اور نصیبہ ور ( کوتیری بارگاہ میں ) اس کا مال نفع نہیں پہنچا سکتا ۔ اور شعبہ نے بیان کیا ، ان سے منصور نے بیان کیا کہ میں نے حضرت مسیب رضی اللہ عنہ سے سنا ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 154360,
        "last_updated": null
    },
    {
        "urduURN": 4062440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6331,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے مسلم کے مولیٰ یزید بن ابی عبیدہ نے اور ان سے سلمہ بن الاکوع رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ خیبر گئے ( راستہ میں ) مسلمانوں میں سے کسی شخص نے کہا عامر ! اپنی حدی سناؤ ۔ وہ حدی پڑھنے لگے اور کہنے لگے ۔ ” خدا کی قسم اگر اللہ نہ ہوتا تو ہم ہدایت نہ پاتے “ اس کے علاوہ دوسرے اشعاربھی انہوں نے پڑھے مجھے وہ یاد نہیں ہیں ۔ ( اونٹ حدی سن کر تیز چلنے لگے تو ) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ یہ سواریوں کو کون ہنکا رہا ہے ، لوگوں نے کہا کہ عامر بن اکوع ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ اس پر رحم کرے ۔ مسلمانوں میں سے ایک شخص نے عرض کیا یا رسول اللہ ! کاش ابھی آپ ان سے ہمیں اور فائدہ اٹھانے دیتے ۔ پھر جب صف بندی ہوئی تو مسلمانوں نے کافروں سے جنگ کی اور حضرت عامر رضی اللہ عنہ کی تلوار چھوٹی تھی جو خود ان کے پاؤں پر لگ گئی اور ان کی موت ہو گئی ۔ شام ہوئی تو لوگوں نے جگہ جگہ آگ جلائی ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا یہ آگ کیسی ہے ، اسے کیوں جلایا گیا ہے ؟ صحابہ نے کہا کہ پالتو گدھوں ( کا گوشت پکانے ) کے لئے آنحضرت صلی اللہ علیہ وسلم نے فرمایا جو کچھ ہانڈیوں میں گوشت ہے اسے پھینک دو اور ہانڈیوں کو توڑ دو ۔ ایک صحابی نے عرض کیا کہ یا رسول اللہ ! اجازت ہو تو ایسا کیوں نہ کر لیں کہ ہانڈیوں میں جو کچھ ہے اسے پھینک دیں اور ہانڈیوں کو دھو لیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اچھا یہی کر لو ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 154370,
        "last_updated": null
    },
    {
        "urduURN": 4062450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6332,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عمرو بن مرہ نے ، کہا میں نے عبداللہ بن ابی اوفی رضی اللہ عنہما سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی خدمت میں اگر کوئی شخص صدقہ لاتا تو آنحضرت صلی اللہ علیہ وسلم فرماتے کہ اے اللہ ! فلاں کی آل اولاد پر اپنی رحمتیں نازل فرما ۔ میرے والد صدقہ لائے تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اے اللہ ! ابی اوفی ٰ کی آل اولاد پر رحمتیں نازل فرما ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 154380,
        "last_updated": null
    },
    {
        "urduURN": 4062460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6333,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے اسماعیل بن ابی خالد نے ، ان سے قیس نے کہ میں نے جریر بن عبداللہ بجلی سے سنا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کوئی ایسا مرد مجاہد ہے جو مجھ کو ذی الخلصہ بت سے آرام پہنچائے وہ ایک بت تھا جس کو جاہلیت میں لوگ پوجاکرتے تھے اور اس کو کعبہ کہا کرتے تھے ۔ میں نے کہا یا رسول اللہ ! اس خدمت کے لئے میں تیار ہوں لیکن میں گھوڑے پر ٹھیک جم کر بیٹھ نہیں سکتا ہوں آپ نے میرے سینہ پر ہاتھ مبارک پھیر کر دعا فرمائی کہ اے اللہ ! اسے ثابت قدمی عطا فرما اور اس کو ہدایت کرنے والا اور نور ہدایت پانے والا بنا ۔ جریر نے کہا کہ پھر میں اپنی قوم احمس کے پچاس آدمی لے کر نکلا اور ابی سفیان نے یوں نقل کیا کہ میں اپنی قوم کی ایک جماعت لے کر نکلا اور میں وہاں گیا اور اسے جلا دیا پھر میں نبی کریم صلی اللہ علیہ وسلم کے پاس آیا اور میں نے کہا اے اللہ کے رسول ! اللہ کی قسم میں آپ کے پاس نہیں آیاجب تک میں نے اسے جلے ہوئے خارش زدہ اونٹ کی طرح سیاہ نہ کر دیا ۔ پس آپ نے قبیلہ احمس اور اس کے گھوڑوں کے لئے دعا فرمائی ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 154390,
        "last_updated": null
    },
    {
        "urduURN": 4062470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6334,
        "hadithSanad": "ہم سے سعید بن ربیع نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے کہا کہ میں نے حضرت انس رضی اللہ عنہ سے سنا ، کہا کہ ام سلیم رضی اللہ عنہا نے رسول اللہ صلی اللہ علیہ وسلم سے کہا کہ",
        "hadithText": "انس آپ کا خادم ہے اس کے حق میں دعا فرمائیے ۔ آنحضرت صلی اللہ علیہ وسلم نے دعا فرمائی اللهم أكثر ماله وولده ، ‏‏‏‏ ‏‏‏‏ وبارك له فيما أعطيته یا اللہ ! اس کے مال واولاد کوزیادہ کر اور جو کچھ تو نے اسے دیا ہے ، اس میں اسے برکت عطا فرمائیو ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 154400,
        "last_updated": null
    },
    {
        "urduURN": 4062480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6335,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے عبدہ بن سلیمان نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے ایک صحابی کو مسجد میں قرآن پڑھتے سنا تو فرمایا اللہ اس پر رحم فرمائے اس نے مجھے فلاں فلاں آیتیں یاد دلا دیں جو میں فلاں فلاں سورتوں سے بھول گیا تھا ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 154410,
        "last_updated": null
    },
    {
        "urduURN": 4062490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6336,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے شعبہ بن حجاج نے ، کہا مجھ کو سلیمان بن مہران نے خبر دی ، انہیں ابووائل نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے کوئی چیز تقسیم فر مائی تو ایک شخص بولا کہ یہ ایسی تقسیم ہے کہ اس سے اللہ کی رضا مقصود نہیں ہے ۔ میں نے نبی کریم صلی اللہ علیہ وسلم کو اس کی خبر دی تو آپ اس پر غصہ ہوئے اور میں نے خفگی کے آثار آپ کے چہرہ مبارک پر دیکھے اور آپ نے فریا کہ اللہ مو سیٰ علیہ السلام پر رحم فرمائے ، انہیں اس سے بھی زیادہ تکلیف دی گئی ۔ لیکن انہوں نے صبرکیا ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 154420,
        "last_updated": null
    },
    {
        "urduURN": 4062500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6337,
        "hadithSanad": "ہم سے یحییٰ بن محمد بن سکن نے بیان کیا ، انہوں نے کہا ہم سے حبان بن ہلال ابو حبیب نے بیان کیا ، کہا ہم سے ہارون مقر ی نے بیان ، کہا ہم سے زبیر بن خر یت نے بیان کیا ، ان سے عکرمہ نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے کہاکہ",
        "hadithText": "لوگوں کو وعظ ہفتہ میں صرف ایک دن جمعہ کو کیا کر ، اگر تم اس پر تیار نہ ہو تو دو مرتبہ اگر تم زیادہ ہی کرنا چاہتے ہو تو پس تین دن اور لوگوں کو اس قرآن سے اکتانہ دینا ، ایسا نہ ہو کہ تم کچھ لوگوں کے پاس پہنچو ، وہ اپنی باتوں میں مصروف ہوں اور تم پہنچتے ہی ان سے اپنی بات ( بشکل وعظ ) بیان کرنے لگو اور ان کی آپس کی گفتگو کو کاٹ دو کہ اس طرح وہ اکتا جائیں ، بلکہ ( ایسے مقام پر ) تمہیں خاموش رہنا چاہئے ۔ جب وہ تم سے کہیں تو پھر تم انہیں اپنی باتیں سناؤ ۔ اس طرح کہ وہ بھی اس تقریر کے خواہشمند ہوں اور دعا میں قافیہ بند ی سے پرہیز کرتے رہنا ، کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم اور آپ کے صحابہ کو دیکھا ہے کہ وہ ہمیشہ ایسا ہی کرتے تھے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 154430,
        "last_updated": null
    },
    {
        "urduURN": 4062510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6338,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے اسماعیل بن علیہ نے بیان کیا ، کہا ہم کو عبد العزیز بن صہیب نے خبر دی ، ان سے حضرت انس رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب تم میں سے کوئی دعا کرے تو اللہ سے قطعی طور پر مانگے اور یہ نہ کہے کہ اے اللہ ! اگر تو چاہے تو مجھے عطا فرما کیونکہ اللہ پر کوئی زبردستی کرنے والا نہیں ہے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 154440,
        "last_updated": null
    },
    {
        "urduURN": 4062520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6339,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، ان سے امام مالک نے ، ان سے ابوالزناد نے ، ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا تم میں سے کوئی شخص اس طرح نہ کہے کہ ” یا اللہ ! اگر تو چاہے تو مجھے معا ف کر دے ۔ میرے مغفرت کر دے “ بلکہ یقین کے ساتھ دعا کرے کیونکہ اللہ پر کوئی زبردستی کرنے والا نہیں ہے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 154450,
        "last_updated": null
    },
    {
        "urduURN": 4062530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6340,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں ابن شہاب نے ، انہیں عبدالرحمٰن بن ازہر کے غلام ابوعبید نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا بندہ کی دعا قبول ہوتی ہے جب تک کہ وہ جلدی نہ کرے کہ کہنے لگے کہ میں نے دعا کی تھی اور میری دعا قبول نہیں ہوئی ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 154460,
        "last_updated": null
    },
    {
        "urduURN": 4062540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6341,
        "hadithSanad": "حضرت ابوعبداللہ امام بخاری نے کہا اور عبد العزیز بن عبداللہ اویسی نے کہا مجھ سے محمد بن جعفر نے بیان کیا ، ان سے یحییٰ بن سعید اور شریک بن ابی نمر نے ، انہوں نے حضرت انس رضی اللہ عنہ سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے اپنے ہاتھ اتنے اٹھائے کہ میں نے آپ کی بغلوں کی سفیدی دیکھی ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 154470,
        "last_updated": null
    },
    {
        "urduURN": 4062550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6342,
        "hadithSanad": "ہم سے محمد بن محبوب نے بیان کیا ، کہا ہم سے ابو عوانہ نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جمعہ کے دن خطبہ دے رہے تھے کہ ایک آدمی کھڑا ہوا اور کہا کہ یا رسول اللہ ! اللہ سے دعا فرما دیجئیے کہ ہمارے لئے بارش برسائے ( آنحضرت صلی اللہ علیہ وسلم نے دعا فرمائی ) اور آسمان پر بادل چھا گیا اور بارش برسنے لگی ، یہ حال ہو گیا کہ ہمارے لئے گھر تک پہنچنا مشکل تھا ۔ یہ بارش اگلے جمعہ تک ہوتی رہی پھر وہی صحابی یا کوئی دوسرے صحابی اس دوسرے جمعہ کو کھڑے ہوئے اور کہا کہ اللہ سے دعا فرمائیے کہ اب بارش بند کر دے ہم تو ڈوب گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے دعا کی کہ اے اللہ ! ہمارے چاروں طرف بستیوں کو سیراب کر اور ہم پر بارش بند کر دے ۔ چنانچہ بادل ٹکڑے ہو کر مدینہ کے چاروں طرف بستیوں میں چلا گیا اور مدینہ والوں پر بارش رک گئی ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 154480,
        "last_updated": null
    },
    {
        "urduURN": 4062560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6343,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے وہیب بن خالد نے بیان کیا ، انہوں نے کہا ہم سے عمرو بن یحییٰ نے بیان کیا ، ان سے عبادہ بن تمیم نے بیان کیا اور ان سے عبداللہ بن زید انصاری رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم اس عیدگاہ میں استسقاء کی دعا کے لئے نکلے اوربارش کی دعا کی ، پھر آپ قبلہ رخ ہو گئے اور اپنی چادر کو پلٹا ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 154490,
        "last_updated": null
    },
    {
        "urduURN": 4062570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6344,
        "hadithSanad": "ہم سے عبداللہ بن ابی الاسود نے بیان کیا ، کہا ہم سے حرمی بن عمارہ نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "میری والدہ ( ام سلیم رضی اللہ عنہ ) نے کہا یا رسول اللہ ! انس رضی اللہ عنہ آپ کاخادم ہے اس کے لئے دعا فرما دیں ۔ آنحضرت صلی اللہ علیہ وسلم نے دعا کی کہ اے اللہ ! اس کے مال واولاد کو زیادہ کر اور جو کچھ تو نے اسے دیا ہے اس میں برکت عطا فرما ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 154500,
        "last_updated": null
    },
    {
        "urduURN": 4062580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6345,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، انہوں نے کہا ہم سے ہشام بن عروہ نے بیان کیا ، انہوں نے کہا ہم سے قتادہ نے بیان کیا ، ان سے ابو العالیہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم پریشانی کے وقت یہ دعا کرتے تھے لا إله إلا الله العظيم الحليم ، ‏‏‏‏ لا إله إلا الله رب السموات والأرض ، ‏‏‏‏ رب العرش العظيم ‏ ” اللہ کے سوا کوئی معبودنہیں جو بہت عظمت والا ہے اور برد بار ہے ، اللہ کے سوا کوئی معبود نہیں جو آسمانوں اور زمین کا رب اور بڑے بھاری عرش کارب ہے ۔ “</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 154510,
        "last_updated": null
    },
    {
        "urduURN": 4062590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6346,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ بن ابی کثیر نے بیان کیا ، ان سے ہشام بن ابی عبداللہ نے بیان کیا ، ان سے قتادہ نے ، ان سے ابوالعالیہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ کریم صلی اللہ علیہ وسلم حالت پریشانی میں یہ دعا کیا کرتے تھے لا إله إلا الله العظيم الحليم ، ‏‏‏‏ لا إله إلا الله رب العرش العظيم ، ‏‏‏‏ لا إله إلا الله رب السموات ، ‏‏‏‏ ورب الأرض ، ‏‏‏‏ ورب العرش الكريم ‏ ” اللہ صاحب عظمت اور بردبار کے سوا کوئی معبود نہیں ، اللہ کے سوا کوئی معبود نہیں جو عرش عظیم کا رب ہے ، اللہ کے سوا کوئی معبود نہیں جو آسمانوں اور زمینوں کا رب ہے اور عرش عظیم کا رب ہے ۔ “ اور وہب نے بیان کیا کہ ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے اس طرح بیان کیا ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 154520,
        "last_updated": null
    },
    {
        "urduURN": 4062600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6347,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہامجھ سے سمی نے بیان کیا ، ان سے ابوصالح نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم مصیبت کی سختی ، تباہی تک پہنچ جانے ، قضاء و قدر کی برائی اور دشمنوں کے خوش ہونے سے پناہ مانگتے تھے اور سفیان نے کہا کہ حدیث میں تین صفات کا بیان تھا ۔ ایک میں نے بھلا دی تھی اور مجھے یاد نہیں کہ وہ ایک کون سی صفت ہے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 154530,
        "last_updated": null
    },
    {
        "urduURN": 4062610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6348,
        "hadithSanad": "ہم سے سعید بن عفیر نے بیان کیا ، کہا کہ مجھ سے لیث بن سعد نے بیان کیا ، کہا کہ مجھ سے عقیل نے ، ان سے ابن شہاب نے ، انہیںسعید بن مسیب اور عروہ بن زبیر نے بہت سے علم والوں کے سامنے خبر دی کہ",
        "hadithText": "عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول کریم صلی اللہ علیہ وسلم جب بیمار نہیں تھے تو فرمایا کرتے تھے کہ جب بھی کسی نبی کی روح قبض کی جاتی تو پہلے جنت میں اس کا ٹھکانا دکھا دیا جاتا ہے ، اس کے بعد اسے اختیار دیا جاتا ہے ( کہ چاہیں دنیا میں رہیں یا جنت میں چلیں ) چنانچہ جب آنحضرت صلی اللہ علیہ وسلم بیمار ہوئے اور سرمبارک میری ران پر تھا ۔ اس وقت آپ پر تھوڑی دیر کے لئے غشی طاری ہوئی ۔ پھر جب آپ کو اس سے کچھ ہوش ہوا تو چھت کی طرف ٹکٹکی باندھ کر دیکھنے لگے ، پھر فرمایااللهم الرفيق الأعلى ” اے اللہ ! رفیق اعلیٰ کے ساتھ ملا دے ۔ “ میں نے سمجھ لیا کہ آنحضرت صلی اللہ علیہ وسلم اب ہمیں اختیار نہیں کر سکتے ۔ میں سمجھ گئی کہ جو بات آنحضرت صلی اللہ علیہ وسلم صحت کے زمانے میں بیان فرمایا کرتے تھے ، یہ وہی بات ہے ۔ بیان کیا کہ یہ آنحضرت صلی اللہ علیہ وسلم کا آخری کلمہ تھا جو آپ نے زبان سے ادا فرمایا کہاللهم الرفيق الأعلى ” اے اللہ ! رفیق اعلیٰ کے ساتھ ملا دے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 154540,
        "last_updated": null
    },
    {
        "urduURN": 4062620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6349,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے اسماعیل بن ابی خالد نے بیان کیا ، ان سے قیس بن ابی حازم نے بیان کیا ، کہاکہ",
        "hadithText": "میں خباب بن ارت رضی اللہ عنہ کی خدمت میں حاضر ہوا انہوں نے سات داغ ( کسی بیماری کے علاج کے لئے ) لگوائے تھے ۔ انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے اگر ہمیں موت کی دعا کرنے سے منع نہ کیا ہوتا تو میں ضرور اس کی دعا کرتا ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 154550,
        "last_updated": null
    },
    {
        "urduURN": 4062630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6350,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے یحییٰ قطان نے بیان کیا ، ان سے اسماعیل بن ابی خالد نے بیان کیا ، ان سے قیس بن ابی حازم نے بیان کیا ، کہاکہ",
        "hadithText": "میں خباب بن ارت رضی اللہ عنہ کی خدمت میں حاضر ہوا انہوں نے اپنے پیٹ پر سات داغ لگوا رکھے تھے ، میں نے سنا کہ وہ کہہ رہے تھے کہ اگر نبی کریم صلی اللہ علیہ وسلم نے ہمیں موت کی دعا کرنے سے منع نہ کیا ہوتا تو میں اس کی ضرور دعا کر لیتا ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 154560,
        "last_updated": null
    },
    {
        "urduURN": 4062640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6351,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، انہوں نے کہا ہم کو اسماعیل بن علیہ نے خبر دی ، انہوں نے کہا ہمیں عبد العزیز بن صہیب نے بتایا اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا تم میں سے کوئی شخص کسی تکلیف کی وجہ سے جو اسے ہونے لگی ہو ، موت کی تمنا نہ کرے ۔ اگر موت کی تمنا ضروری ہی ہو جائے تو یہ کہے کہ اے اللہ ! جب تک میرے لئے زندگی بہتر ہے مجھے زندہ رکھیو اور جب میرے لئے موت بہتر ہو تو مجھے اٹھا لیجیو ۔ “</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 154570,
        "last_updated": null
    },
    {
        "urduURN": 4062650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6352,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے حاتم بن اسماعیل نے بیان کیا ، ان سے جعد بن عبد الرحمان نے بیان کیا کہ میں نے حضرت سائب بن یزید رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میری خالہ مجھے لے کر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور عرض کیا یا رسول اللہ ! میرا یہ بھانجا بیمار ہے ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم نے میرے سر پر ہاتھ پھیرا اور میرے لئے برکت کی دعا کی ۔ پھر آپ نے وضو کیا اور میں نے آپ کے وضو کا پانی پیا ۔ اس کے بعد میں آپ کی پشت کی طرف کھڑا ہو گیا اور میں نے مہر نبوت دیکھی جو دونوں شانوں کے درمیان میں تھی جیسے چھپر کھٹ کی گھنڈی ہوتی ہے یا حجلہ کا انڈہ ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 154580,
        "last_updated": null
    },
    {
        "urduURN": 4062660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6353,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا ہم سے عبداللہ بن وہب نے بیان کیا ، کہا ہم سے سعید بن ابی ایوب نے بیان کیا ، ان سے ابوعقیل ( زہرہ بن معبد ) نے کہ",
        "hadithText": "انہیں ان کے دادا عبداللہ بن ہشام رضی اللہ عنہ ساتھ لے کر بازار سے نکلتے یا بازار جاتے اور کھانے کی کوئی چیز خرید تے ، پھر اگر عبداللہ بن زبیر یا عبداللہ بن عمر رضی اللہ عنہم کی ان سے ملاقات ہو جاتی تو وہ کہتے کہ ہمیں بھی اس میں شریک کیجئے کہ رسول اللہ صلی اللہ علیہ وسلم نے آپ کے لئے برکت کی دعا فرمائی تھی ۔ بعض دفعہ تو ایک اونٹ کے بوجھ کا پورا غلہ نفع میں آ جاتا اور وہ اسے گھر بھیج دیتے تھے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 154590,
        "last_updated": null
    },
    {
        "urduURN": 4062670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6354,
        "hadithSanad": "ہم سے عبد العزیز بن عبداللہ اویسی نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے صالح بن کیسان نے ، ان سے ابن شہاب نے بیان کیا ، انہیں محمود بن ربیع رضی اللہ عنہ نے خبر دی",
        "hadithText": "یہ محمود وہ بزرگ ہیں جن کے منہ میں رسول اللہ صلی اللہ علیہ وسلم نے جس وقت وہ بچے تھے ، انہیں کے کنوئیں سے پانی لے کر کلی کر لی تھی ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 154600,
        "last_updated": null
    },
    {
        "urduURN": 4062680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6355,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو ہشام بن عروہ نے خبر دی ، انہیں ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے پاس بچوں کو لایا جاتا تو آپ ان کے لئے دعا کرتے تھے ۔ ایک مرتبہ ایک بچہ لایا گیا اور اس نے آپ کے کپڑے پر پیشاب کر دیا ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے پانی منگایا اور پیشاب کی جگہ پر اسے ڈالا ۔ کپڑے کو دھویا نہیں ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 154610,
        "last_updated": null
    },
    {
        "urduURN": 4062690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6356,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ، کہا کہ مجھے عبداللہ بن ثعلبہ بن صعیر رضی اللہ عنہ نے خبردی",
        "hadithText": "اور رسول اللہ صلی اللہ علیہ وسلم نے ان کی آنکھ یا منہ پر ہاتھ پھیرا تھا ۔ انہوں نے حضرت سعد بن ابی وقاص رضی اللہ عنہ کو ایک رکعت وتر نماز پڑھتے دیکھا تھا ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 154620,
        "last_updated": null
    },
    {
        "urduURN": 4062700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6357,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ بن حجاج نے بیان کیا ، کہا ہم سے حکم بن عتبہ نے بیان کیا ، کہا کہ میں نے عبدالرحمٰن بن ابی لیلیٰ سے سنا ، کہا کہ کعب بن عجرہ رضی اللہ عنہ مجھ سے ملے اور کہاکہ",
        "hadithText": "میں تمہیں ایک تحفہ نہ دوں ؟ ( یعنی ایک عمدہ حدیث نہ سناؤں ) نبی کریم صلی اللہ علیہ وسلم ہم لو گوں میں تشریف لائے تو ہم نے کہا یا رسول اللہ ! یہ تو ہمیں معلوم ہو گیا ہے کہ ہم آپ کو سلام کس طرح کریں ، لیکن آپ پر درود ہم کس طرح بھیجیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس طرح کہو ۔ اللهم صل على محمد ، ‏‏‏‏ وعلى آل محمد ، ‏‏‏‏ كما صليت على آل إبراهيم ، ‏‏‏‏ إنك حميد مجيد ، ‏‏‏‏ اللهم بارك على محمد ، ‏‏‏‏ وعلى آل محمد ، ‏‏‏‏ كما باركت على آل إبراهيم ، ‏‏‏‏ إنك حميد مجيد ‏ ” اے اللہ ! محمد ( صلی اللہ علیہ وسلم ) پر اپنی رحمت نازل کر اور آل محمد صلی اللہ علیہ وسلم پر ، جیسا کہ تو نے ابراہیم پر رحمت نازل کی ، بلاشبہ تو تعریف کیا ہوا اور پاک ہے ۔ اے اللہ ! محمد پر اور آل محمد پر بر کت نازل کر جیسا کہ تو نے ابراہیم اور آل ابراہیم پر برکت نازل کی ، بلاشبہ تو تعریف کیا ہوا اور پاک ہے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 154630,
        "last_updated": null
    },
    {
        "urduURN": 4062710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6358,
        "hadithSanad": "ہم سے ابراہیم بن حمزہ زبیری نے بیان کیا ، انہوں نے کہا ہم سے ابن ابی حازم اور دراوردی نے بیان کیا ، ان سے یزید بن عبداللہ بن اسامہ نے بیان کیا ، ان سے عبداللہ بن خباب نے بیان کیا اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم نے کہا اے اللہ کے رسول ! آپ کو سلام اس طرح کیا جاتا ہے ، لیکن آپ پر درود کس طرح بھیجا جاتاہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس طرح کہو اللهم صل على محمد عبدك ورسولك ، ‏‏‏‏ كما صليت على إبراهيم ، ‏‏‏‏ وبارك على محمد وعلى آل محمد ، ‏‏‏‏ كما باركت على إبراهيم وآل إبراهيم اے اللہ ! اپنی رحمت نازل کرحضرت محمد ( صلی اللہ علیہ وسلم ) پر جو تیرے بندے ہیں اور تیرے رسول ہیں جس طرح تو نے رحمت نازل کی ابراہیم پر اور برکت بھیج محمد ( صلی اللہ علیہ وسلم ) پر اور ان کی آل پر جس طرح برکت بھیجی تو نے ابراہم پر اور آل ابراہیم پر ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 154640,
        "last_updated": null
    },
    {
        "urduURN": 4062720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6359,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے یبان کیا ، ان سے عمرو بن مرہ نے اور ان سے ابن ابی اوفی رضی اللہ عنہ نے بیان کیا",
        "hadithText": "جب رسول اللہ صلی اللہ علیہ وسلم کے پاس کوئی شخص اپنی زکوٰۃ لے کر آتا تو آپ فرماتے ” اللهم صل عليه‏ “ ( اے اللہ ! اس پر اپنی رحمت نازل فرما ) میرے والد بھی اپنی زکوٰۃ لے کر آئے تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اے اللہ ! آل ابی اوفی پر اپنی رحمت نازل فرما ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 154650,
        "last_updated": null
    },
    {
        "urduURN": 4062730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6360,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، ان سے امام مالک نے ، ان سے عبداللہ بن ابی بکر نے ، ان سے ان کے والد نے اور ان سے عمرو بن سلیم زرقی نے بیان کیا کہ ہم کو ابو حمید ساعدی رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "صحابہ نے عرض کیا یا رسول اللہ ! ہم آپ پر کس طرح درود بھیجیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس طرح کہو اللهم صل على محمد وأزواجه وذريته ، ‏‏‏‏ كما صليت على آل إبراهيم ، ‏‏‏‏ وبارك على محمد وأزواجه وذريته ، ‏‏‏‏ كما باركت على آل إبراهيم ، ‏‏‏‏ إنك حميد مجيد ” اے اللہ ! محمد اور آپ کی ازواج اور آپ کی اولاد پر اپنی رحمت نازل کر جیسا کہ تو نے ابرہیم اور آل ابراہیم پر رحمت نازل کی اور محمد اور ان کی ازواج اور ان کی اولاد پر برکت نازل کر ، جیسا کہ تو نے ابراہیم اور آل ابراہیم پر برکت نازل کی ۔ بلاشبہ تو تعریف کیا گیا شان وعظمت والا ہے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 154660,
        "last_updated": null
    },
    {
        "urduURN": 4062740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6361,
        "hadithSanad": "ہم سے احمد بن صالح نے بیان کیا ، کہا ہم سے عبداللہ بن وہب نے بیان کیا ، کہا کہ مجھے یونس نے خبر دی ، انہیں ابن شہاب نے ، کہا کہ مجھ کو سعید بن مسیب نے خبر دی اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اے اللہ ! میں نے جس مومن کو بھی برا بھلا کہا ہو تو اس کے لئے اسے قیامت کے دن اپنی قربت کا ذریعہ بنا دے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 154670,
        "last_updated": null
    },
    {
        "urduURN": 4062750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6362,
        "hadithSanad": "ہم سے حفص بن عمر حوضی نے بیان کیا ، کہا ہم سے ہشام دستوائی نے بیان کیا ، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "صحابہ نے رسول اللہ صلی اللہ علیہ وسلم سے سوا لات کئے اور جب بہت زیادہ کئے تو آنحضرت صلی اللہ علیہ وسلم کو ناگواری ہوئی ، پھر آپ صلی اللہ علیہ وسلم ممبر پر تشریف لائے اور فرمایا ، آج تم مجھ سے جو بات پوچھو گے میں بتاؤں گا ۔ اس وقت میں نے دائیں بائیں دیکھا تو تمام صحابہ سر اپنے کپڑوں میں لپیٹے ہوئے رو رہے تھے ، ایک صاحب جن کا اگر کسی سے جھگڑا ہوتا تو انہیں ان کے باپ کے سوا کسی اور کی طرف ( طعنہ کے طور پر ) منسوب کیا جاتا تھا ۔ انہوں نے پوچھا یا رسول اللہ ! میرے باپ کون ہیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ حذافہ ۔ اس کے بعد عمر رضی اللہ عنہ اٹھے اور عرض کیا ہم اللہ سے راضی ہیں کہ ہمارا رب ہے ، اسلام سے کہ وہ دین ہے ، محمد صلی اللہ علیہ وسلم سے کہ وہ سچے رسول ہیں ، ہم فتنوں سے اللہ کی پناہ مانگتے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، آج کی طرح خیروشر کے معاملہ میں میں نے کوئی دن نہیں دیکھا ، میرے سامنے جنت اور دوزخ کی تصویر لائی گئی اور میں نے انہیں دیوار کے اوپر دیکھا ۔ قتادہ اس حدیث کو بیان کرتے وقت ( سورۃ المائدہ کی ) اس آیت کا ذکر کیا کرتے تھے ” اے ایمان والو ! ایسی چیزوں کے متعلق نہ سوال کرو کہ اگر تمہارے سامنے ان کا جواب ظاہرہو جائے تو تم کو برا لگے ۔ “</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 154680,
        "last_updated": null
    },
    {
        "urduURN": 4062760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6363,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے عمرو بن ابی عمرو ، مطلب بن عبداللہ بن حنطب کے غلام نے بیان کیا ، انہوں نے انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بیان کیاکہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ابوطلحہ رضی اللہ عنہ سے فرمایا اپنے یہاں کے لڑکوں میں سے کوئی بچہ تلاش کر جو میرا کام کر دیا کرے ۔ چنانچہ ابوطلحہ رضی اللہ عنہ مجھے اپنی سواری پر پیچھے بیٹھا کر لے گئے آنحضرت صلی اللہ علیہ وسلم جب بھی گھر ہوتے تو میں آپ کی خدمت کیا کرتا تھا ۔ میں نے سنا کہ آنحضر ت صلی اللہ علیہ وسلم یہ دعا اکثر پڑھا کرتے تھے ” اے اللہ ! میں تیری پناہ مانگتا ہوں غم والم سے ، عاجزی وکمزوری سے اور بخل سے اور بزدلی سے اور قرض کے بوجھ سے اور انسانوں کے غلبہ سے ۔ “ میں آنحضرت صلی اللہ علیہ وسلم کی خدمت کرتا رہا ۔ پھر ہم خیبر سے واپس آئے اور آنحضرت صلی اللہ علیہ وسلم ام المؤمنین صفیہ بنت حیی رضی اللہ عنہا کے ساتھ واپس ہوئے ۔ آنحضرت صلی اللہ علیہ وسلم نے انہیں اپنے لئے منتخب کیا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے ان کے لئے عبا یا چادر سے پردہ کیا اور انہیں اپنی سواری پر اپنے پیچھے بٹھایا ۔ جب ہم مقام صہبا پہنچے تو آپ نے ایک چرمی دسترخوان پر کچھ مالیدہ تیار کرا کے رکھوایا پھر مجھے بھیجا اور میں کچھ صحابہ کو بلا لایا اور سب نے اسے کھایا ، یہ آپ کی دعوت ولیمہ تھی ۔ اس کے بعد آپ آگے بڑھے اور احد پہاڑ دکھائی دیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا یہ پہاڑ ہم سے محبت کرتا ہے اور ہم اس سے محبت کرتے ہیں ۔ آپ جب مدینہ منورہ پہنچے تو فرمایا ” اے اللہ ! میں اس شہر کے دونوں پہاڑو ں کے درمیانی علاقہ کو اس طرح حرمت والا قرار دیتا ہوں جس طرح ابراہیم علیہ السلام نے مکہ کو حرمت والا قرار دیا تھا ۔ اے اللہ ! یہاں والوں کے مد میں اور ان کے صاع میں برکت عطا فرما ۔ “</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 154690,
        "last_updated": null
    },
    {
        "urduURN": 4062770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6364,
        "hadithSanad": "ہم سے عبداللہ بن زبیر حمیدی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے ، کہا ہم سے موسیٰ بن عقبہ نے بیان کیا ، کہا کہ میں نے ام خالد بنت خالد بن سعید رضی اللہ عنہما سے سنا ( موسیٰ نے ) بیان کیا کہ",
        "hadithText": "میں نے کسی سے نہیں سنا کہ ان کی بیان کی ہوئی حدیث سے مختلف کسی نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہو ، انہوں نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا کہ آپ قبر کے عذاب سے اللہ کی پناہ مانگتے تھے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 154700,
        "last_updated": null
    },
    {
        "urduURN": 4062780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6365,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے عبدالملک بن عمیر نے بیان کیا ، ان سے مصعب بن سعد بن ابی وقاص نے کہ",
        "hadithText": "سعد رضی اللہ عنہ پانچ باتوں کاحکم دیتے تھے او انہیں نبی کریم صلی اللہ علیہ وسلم کے حوالہ سے ذکرکرتے تھے کہ آنحضرت صلی اللہ علیہ وسلم ان سے پناہ مانگنے کا حکم کرتے تھے کہ اللهم إني أعوذ بك من البخل ، ‏‏‏‏ وأعوذ بك من الجبن ، ‏‏‏‏ وأعوذ بك أن أرد إلى أرذل العمر ، ‏‏‏‏ وأعوذ بك من فتنۃ الدنيا يعني فتنۃ الدجال وأعوذ بك من عذاب القبر ‏ ” اے اللہ ! میں تیری پناہ مانگتا ہوں اس سے کہ بدترین بڑھاپا مجھ پر آ جائے اور تجھ سے پناہ مانگتا ہوں دنیا کے فتنہ سے ، اس سے مراد دجال کا فتنہ ہے اور تجھ سے پناہ مانگتا ہوں قبر کے عذاب سے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 154710,
        "last_updated": null
    },
    {
        "urduURN": 4062790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6366,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے جریربن عبدالحمید نے بیان کیا ، ان سے ابووائل نے ، ان سے مسروق نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیاکہ",
        "hadithText": "مدینہ کے یہود یوں کی دو بوڑھی عورتیں میرے پاس آئیں اور انہوں نے مجھ سے کہا کہ قبر والوں کو ان کی قبر میں عذاب ہو گا ۔ لیکن میں نے انہیں جھٹلایا اور ان کی تصدیق نہیں کر سکی ۔ پھر وہ دونوں عورتیں چلی گئیں اور نبی کریم صلی اللہ علیہ وسلم تشریف لائے تو میں نے عرض کیا یا رسول اللہ ! دو بوڑھی عورتیں تھیں ، پھر میں آپ سے واقعہ کا ذکر کیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ انہوں نے صحیح کہا ، قبر والوں کو عذاب ہو گا اور ان کے عذاب کو تمام چوپائے سنیں گے ۔ پھر میں نے دیکھا کہ آنحضرت صلی اللہ علیہ وسلم ہر نماز میں قبر کے عذاب سے اللہ کی پناہ مانگنے لگے تھے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 154720,
        "last_updated": null
    },
    {
        "urduURN": 4062800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6367,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے معتمر بن سلیمان نے بیان کیا ، کہا کہ میں نے اپنے والد سے سنا ، بیان کیا کہ میں نے انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کہا کرتے تھے اللهم إني أعوذ بك من العجز والكسل ، ‏‏‏‏ والجبن والهرم ، ‏‏‏‏ وأعوذ بك من عذاب القبر ، ‏‏‏‏ وأعوذ بك من فتنۃ المحيا والممات ” اے اللہ ! میں تیری پنا ہ مانگتا ہوں عاجزی سے ، سستی سے ، بزدلی سے اور بہت زیادہ بڑھاپے سے اور میں تیری پناہ مانگتا ہوں زندگی اور موت کی آزمائشوں سے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 154730,
        "last_updated": null
    },
    {
        "urduURN": 4062810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6368,
        "hadithSanad": "ہم سے معلی بن اسد نے بیان کیا ، انہوں نے کہا ہم سے وہیب نے بیان کیا ، ان سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے والد عروہ بن زبیر نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کہا کرتے تھے اللهم إني أعوذ بك من الكسل والهرم ، ‏‏‏‏ والمأثم والمغرم ، ‏‏‏‏ ومن فتنۃ القبر وعذاب القبر ، ‏‏‏‏ ومن فتنۃ النار وعذاب النار ، ‏‏‏‏ ومن شر فتنۃ الغنى ، ‏‏‏‏ وأعوذ بك من فتنۃ الفقر ، ‏‏‏‏ وأعوذ بك من فتنۃ المسيح الدجال ، ‏‏‏‏ اللهم اغسل عني خطاياى بماء الثلج والبرد ، ‏‏‏‏ ونق قلبي من الخطايا ، ‏‏‏‏ كما نقيت الثوب الأبيض من الدنس ، ‏‏‏‏ وباعد بيني وبين خطاياى كما باعدت بين المشرق والمغرب ‏ ” اے اللہ ! میں تیری پناہ مانگتا ہوں سستی سے ، بہت زیادہ بڑھاپے سے ، گناہ سے ، قرض سے اور قبر کی آزمائش سے اور قبرکے عذاب سے اور دوزخ کی آزمائش سے اور دزخ کے عذاب سے اور مالدا ری کی آزمائش سے اور تیری پناہ مانگتا ہوں محتاجی کی آزمائش سے اور تیری پناہ مانگتا ہوں مسیح دجال کی آزمائش سے ۔ اے اللہ ! مجھ سے میرے گناہوں کو برف اور اولے کے پانی سے دھودے اور میرے دل کو خطاؤں سے اس طرح پاک و صاف کر دے جس طرح تو نے سفید کپڑے کو میل سے پاک صاف کر دیا اور مجھ میں اور میرے گناہوں میں اتنی دوری کر دے جتنی مشرق اورمغرب میں دوری ہے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 154740,
        "last_updated": null
    },
    {
        "urduURN": 4062820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6369,
        "hadithSanad": "ہم سے خالد بن مخلد نے بیان کیا ، انہوں نے کہا ہم سے سلیمان نے بیان کیا ، انہوں نے کہا کہ مجھ سے عمرو بن ابی عمرو نے بیان کیا ، انہوں نے کہا کہ میں نے انس بن مالک رضی اللہ عنہ سے سنا ، کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کہتے تھے اللهم إني أعوذ بك من الهم والحزن ، ‏‏‏‏ والعجز والكسل ، ‏‏‏‏ والجبن والبخل ، ‏‏‏‏ وضلع الدين ، ‏‏‏‏ وغلبۃ الرجال ‏ ” اے اللہ ! میں تیری پناہ مانگتا ہوں غم والم سے ، عاجزی سے ، سستی سے ، بزدلی سے ، بخل ، قرض چڑھ جانے اور لوگوں کے غلبہ سے ۔ “</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 154750,
        "last_updated": null
    },
    {
        "urduURN": 4062830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6370,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، انہوں نے کہامجھ سے غندر نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے عبدالملک بن عمیر نے بیان کیا ، ان سے مصعب بن سعد نے بیان کیا اور ان سے سعد بن ابی وقاص رضی اللہ عنہ نے کہ",
        "hadithText": "وہ ان پانچ باتوں سے پناہ مانگنے کا حکم دیتے تھے اور انہیں نبی کریم صلی اللہ علیہ وسلم کے حوالہ سے بیان کرتے تھے کہ اللهم إني أعوذ بك من البخل ، ‏‏‏‏ وأعوذ بك من الجبن ، ‏‏‏‏ وأعوذ بك أن أرد إلى أرذل العمر ، ‏‏‏‏ وأعوذ بك من فتنۃ الدنيا ، ‏‏‏‏ وأعوذ بك من عذاب القبر ‏ ” اے اللہ ! میں تیری پناہ مانگتا ہوں بخل سے ، میں تیری پناہ مانگتا ہوں بزدلی سے ، میں تیری پناہ مانگتا ہوں اس سے کہ ناکارہ عمر میں پہنچا دیا جاؤں ، میں تیری پناہ مانگتا ہوں دنیا کی آزمائش سے اور میں تیری پناہ مانگتا ہوں قبر کے عذاب سے ۔ “</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 154760,
        "last_updated": null
    },
    {
        "urduURN": 4062840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6371,
        "hadithSanad": "ہم سے اس حدیث کو ابو معمر نے بیان کیا ، انہوں نے کہا ہم سے عبدالوارث بن سعید نے بیان کیا ، ان سے عبد العزیز بن صہیب نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم پناہ مانگتے تھے اور کہتے تھے کہ اللهم إني أعوذ بك من الكسل ، ‏‏‏‏ وأعوذ بك من الجبن ، ‏‏‏‏ وأعوذ بك من الهرم ، ‏‏‏‏ وأعوذ بك من البخل ‏” اے اللہ ! میں تیری پناہ مانگتا ہوں سستی سے اور تیری پناہ مانگتا ہوں بزدلی سے اور تیری پناہ مانگتا ہوں ناکارہ بڑھاپے سے اور تیری پناہ مانگتا ہوں بخل سے ۔ “</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 154770,
        "last_updated": null
    },
    {
        "urduURN": 4062850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6372,
        "hadithSanad": "ہم سے محمد بن یو سف فریابی نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللهم حبب إلينا المدينۃ ، ‏‏‏‏ ‏‏‏‏ كما حببت إلينا مكۃ أو أشد ، ‏‏‏‏ ‏‏‏‏ وانقل حماها إلى الجحفۃ ، ‏‏‏‏ ‏‏‏‏ اللهم بارك لنا في مدنا وصاعنا ” اے اللہ ! ہمارے دل میں مدینہ کی ایسی ہی محبت پیداکر دے جیسی تو نے مکہ کی محبت ہمارے دل میں پیدا کی ہے بلکہ اس سے بھی زیادہ اور اس کے بخار کو جحفہ میں منتقل کر دے ۔ اے اللہ ! ہمارے لئے ہمارے مداور صاع میں برکت عطا فرما ۔ “</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 154780,
        "last_updated": null
    },
    {
        "urduURN": 4062860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6373,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے ، کہا ہم کو ابن شہاب نے خبر دی ، انہیں عامر بن سعد نے اور ان سے ان کے والد نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم حجۃ الوداع کے موقع پر میری عیادت کے لئے تشریف لائے ۔ میر ی اس بیماری نے مجھے موت سے قریب کر دیا تھا ۔ میں نے عرض کیا یا رسول اللہ ! آپ خود مشاہدہ فر مارہے ہیں کہ بیماری نے مجھے کہاں پہنچا دیا ہے اور میرے پاس مال و دولت ہے اور سوا ایک لڑکی کے اس کا اور کوئی وارث نہیں ، کیا میں اپنی دولت کا دو تہائی صدقہ کر دوں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ۔ میں نے عرض کیا پھر آدھی کا کر دوں ؟ فرمایا کہ ایک تہائی بہت ہے اگر تم اپنے وارثوں کو مالدار چھوڑو تو یہ اس سے بہتر ہے کہ انہیں محتاج چھوڑو اور وہ لوگوں کے سامنے ہاتھ پھیلاتے پھریں اور یقین رکھو کہ تم جو کچھ بھی خرچ کرو گے اور اس سے مقصود اللہ کی خوشنودی ہوئی تمہیں تو اس پر ثواب ملے گا ، یہاں تک کہ اگر تم اپنی بیوی کے منہ میں لقمہ رکھو ( تو اس پر بھی ثواب ملے گا ) میں نے عرض کیا میں اپنے ساتھیوں سے پیچھے چھوڑ دیا جاؤں گا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اگر تم پیچھے چھوڑ دئیے جاؤ اور پھر کوئی عمل کرو جس سے مقصود اللہ کی رضا ہو تو تمہارا مرتبہ بلند ہو گا اور امید ہے کہ تم ابھی زندہ رہو گے اور کچھ قومیں تم سے فائدہ اٹھا ئیں گی اور کچھ نقصان اٹھائیں گی ۔ اے اللہ ! میرے صحابہ کی ہجرت کو کامیاب فرما اور انہیں الٹے پاؤں واپس نہ کر ، البتہ افسوس سعد بن خولہ کا ہے ۔ سعد نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے ان پر افسوس کا اظہار اس وجہ سے کیا تھا کہ ان کا انتقال مکہ معظمہ میں ہو گیا تھا ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 154790,
        "last_updated": null
    },
    {
        "urduURN": 4062870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6374,
        "hadithSanad": "ہم سے اسحاق بن ابراہیم نے بیان کیا ، کہا ہم کو حسین بن علی جعفی نے خبر دی ، انہیں زائدہ بن قدامہ نے ، انہیں عبدالملک بن عمیر نے ، انہیں مصعب بن سعد نے اور ان سے ان کے والد نے بیان کیاکہ",
        "hadithText": "ان کلمات کے ذریعہ اللہ کی پناہ مانگوجن کے ذریعہ نبی کریم صلی اللہ علیہ وسلم پناہ مانگتے تھے اللهم إني أعوذ بك من الجبن ، ‏‏‏‏ وأعوذ بك من البخل ، ‏‏‏‏ وأعوذ بك من أن أرد إلى أرذل العمر ، ‏‏‏‏ وأعوذ بك من فتنۃ الدنيا ، ‏‏‏‏ وعذاب القبر ” اے اللہ ! میں تیری پناہ مانگتا ہوں بزدلی سے ، تیری پناہ مانگتا ہوں بخل سے ، اس سے کہ ناکارہ عمر کو پہنچوں ، تیری پناہ مانگتا ہوں دنیا کی آزمائش سے اور قبر کے عذاب سے ۔ “</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 154800,
        "last_updated": null
    },
    {
        "urduURN": 4062880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6375,
        "hadithSanad": "ہم سے یحییٰ بن موسیٰ نے بیان کیا ، انہوں نے کہا ہم سے وکیع نے بیان کیا ، ان سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے والد عروہ بن زبیر نے بیان کیا اور ان سے ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم دعا کیا کرتے تھے کہاللهم إني أعوذ بك من الكسل والهرم والمغرم والمأثم ، ‏‏‏‏ اللهم إني أعوذ بك من عذاب النار وفتنۃ النار وعذاب القبر ، ‏‏‏‏ وشر فتنۃ الغنى ، ‏‏‏‏ وشر فتنۃ الفقر ، ‏‏‏‏ ومن شر فتنۃ المسيح الدجال ، ‏‏‏‏ اللهم اغسل خطاياى بماء الثلج والبرد ، ‏‏‏‏ ونق قلبي من الخطايا ، ‏‏‏‏ كما ينقى الثوب الأبيض من الدنس ، ‏‏‏‏ وباعد بيني وبين خطاياى كما باعدت بين المشرق والمغرب ‏ ” اے اللہ ! میں تیری پناہ مانگتا ہوں سستی سے ، ناکارہ عمر سے ، بڑھاپے سے ، قرض سے اور گناہ سے ۔ اے اللہ ! میں تیری پناہ مانگتا ہوں دوزخ کے عذاب سے ، دوزخ کی آزمائش سے ، قبر کے عذاب سے ، مالداری کی بری آزمائش سے ، محتاجی کی بری آزمائش سے اور مسیح دجال کی بری آزمائش سے ۔ اے اللہ ! میرے گناہوںکو برف اور اولے کے پانی سے دھودے اور میرے دل کو خطاؤں سے پاک کر دے ، جس طرح سفید کپڑا میل سے صاف کر دیا جاتا ہے اور میرے اور میرے گناہوں کے درمیان اتنا فاصلہ کر دے جتنا فاصلہ مشرق و مغرب میں ہے ۔ “</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 154810,
        "last_updated": null
    },
    {
        "urduURN": 4062890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6376,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے سلام بن ابی مطیع نے بیان کیا ، ان سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے والد عروہ بن زبیر نے اور ان سے ان کی خالہ ( ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا ) نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم پناہ مانگا کرتے تھے کہاللهم إني أعوذ بك من فتنۃ النار ومن عذاب النار ، ‏‏‏‏ وأعوذ بك من فتنۃ القبر ، ‏‏‏‏ وأعوذ بك من عذاب القبر ، ‏‏‏‏ وأعوذ بك من فتنۃ الغنى ، ‏‏‏‏ وأعوذ بك من فتنۃ الفقر ، ‏‏‏‏ وأعوذ بك من فتنۃ المسيح الدجال ” اے اللہ ! میں تیری پناہ مانگتا ہوں دوزخ کی آزمائش سے ، دوزخ کے عذاب سے اور تیری پناہ مانگتا ہوں قبر کی آزمائش سے اور تیری پناہ مانگتا ہوں قبر کے عذاب سے اور تیری پناہ مانگتا ہوں مالداری کی آزمائش سے اور تیری پناہ مانگتا ہوں مسیح دجال کی آزمائش سے ۔ “</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 154820,
        "last_updated": null
    },
    {
        "urduURN": 4062900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6377,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، انہوں نے کہا ہم کو ابومعاویہ نے خبر دی ، انہوں نے کہا ہم کو ہشام بن عروہ نے خبر دی ، انہیں ان کے والد عروہ بن زبیر نے اور ان سے ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلمیہ دعا کیا کرتے تھے ۔اللهم إني أعوذ بك من فتنۃ النار وعذاب النار ، ‏‏‏‏ وفتنۃ القبر وعذاب القبر ، ‏‏‏‏ وشر فتنۃ الغنى وشر فتنۃ الفقر ، ‏‏‏‏ اللهم إني أعوذ بك من شر فتنۃ المسيح الدجال ، ‏‏‏‏ اللهم اغسل قلبي بماء الثلج والبرد ، ‏‏‏‏ ونق قلبي من الخطايا كما نقيت الثوب الأبيض من الدنس ، ‏‏‏‏ وباعد بيني وبين خطاياي ، ‏‏‏‏ كما باعدت بين المشرق والمغرب ، ‏‏‏‏ اللهم إني أعوذ بك من الكسل ، ‏‏‏‏ والمأثم والمغرم ” اے اللہ ! میں تیری پناہ مانگتا ہوں دوزخ کے فتنہ سے اور دوزخ کے عذاب سے اور قبر کی آزمائش سے اور قبر کے عذاب سے اور مال داری کی بری آزمائش سے اور محتاجی کی بری آزمائش سے اور مسیح دجال کی بری آزمائش سے ۔ اے اللہ ! میرے دل کو برف اور اولے کے پانی سے دھو دے اور میرے دل کو خطاؤں سے صاف کر دے جیسا کہ سفید کپڑے کو میل سے صاف کرتا ہے اور میرے اور میری خطاؤں کے درمیان اتنی دوری کر دے جتنی دوری مشرق و مغرب میں ہے ۔ اے اللہ ! میں تیری پناہ مانگتا ہوں سستی سے ، گناہ سے اور قرض سے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 154830,
        "last_updated": null
    },
    {
        "urduURN": 4062910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "مجھ سے محمد بن بشارنے بیان کیا ، کہا ہم سے غندر ( محمد بن جعفر ) نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا کہ میں نے قتادہ سے سنا ، ان سے انس رضی اللہ عنہ نے بیان کیا اور ان سے ام سلیم رضی اللہ عنہا نے کہا کہ",
        "hadithText": "انہوں نے کہا یا رسول اللہ ! انس آپ صلی اللہ علیہ وسلم کا خادم ہے اس کے لئے اللہ سے دعا کیجئے ۔ آنحضرت صلی اللہ علیہ وسلم نے دعا فرمائی اللهم أكثر ماله ، ‏‏‏‏ وولده ، ‏‏‏‏ وبارك له فيما أعطيته اے اللہ ! اس کے مال واولاد میں زیادتی کر اور جو کچھ تو اسے دے اس میں برکت عطا فرما ۔ اور ہشام بن زید سے روایت ہے کہ انہوں نے انس بن مالک رضی اللہ عنہ سے اسی طرح سنا ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 154841,
        "last_updated": null
    },
    {
        "urduURN": 4062920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ابوزید سعید بن ربیع نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے ، انہوں نے کہامیں نے انس رضی اللہ عنہ سے سنا کہ",
        "hadithText": "ام سلیم رضی اللہ عنہا نے عرض کیا کہ حضور ! انس رضی اللہ عنہ آپ کا خادم ہے اس کے لئے دعا فرمائیے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایااللهم أكثر ماله وولده ، ‏‏‏‏ وبارك له فيما أعطيته ” اے اللہ ! اس کے مال واولاد میں زیادتی کر اور جو کچھ تودے اس میں برکت عطا فرما ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 154860,
        "last_updated": null
    },
    {
        "urduURN": 4062930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6382,
        "hadithSanad": "ہم سے ابو مصعب مطرف بن عبداللہ نے بیان کیا ، کہا ہم سے عبدالرحمٰن بن ابی الموال نے بیان کیا ، ان سے محمد بن منکدر نے اور ان سے جابر رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم ہمیں تمام معاملات میں استخارہ کی تعلیم دیتے تھے ، قرآن کی سورت کی طرح ( نبی اکرم صلی اللہ علیہ وسلم نے فرمایا ) جب تم میں سے کوئی شخص کسی ( مباح ) کام کا ارادہ کرے ( ابھی پکا عزم نہ ہوا ہو ) تو دو رکعات ( نفل ) پڑھے اس کے بعد یوں دعا کرے ” اے اللہ ! میں بھلائی مانگتا ہوں ( استخارہ ) تیری بھلائی سے ، تو علم والا ہے ، مجھے علم نہیں اور تو تمام پوشید ہ باتوں کو جاننے والا ہے ، اے اللہ ! اگر تو جانتا ہے کہ یہ کام میرے لئے بہتر ہے ، میرے دین کے اعتبار سے ، میری معاش اور میرے انجام کار کے اعتبار سے یا دعا میں یہ الفاظ کہے ” فی عاجل امری وآجلہ “ تو اسے میرے لئے مقدر کر دے اور اگر تو جانتا ہے کہ یہ کام میرے لئے برا ہے میرے دین کے لئے ، میری زندگی کے لئے اور میرے انجام کار کے لئے یا یہ الفاظ فرمائے ” فی عاجل امری وآجلہ “ تو اسے مجھ سے پھیر دے اور مجھے اس سے پھیر دے اور میرے لئے بھلائی مقدر کر دے جہاں کہیں بھی وہ ہو اور پھر مجھے اس سے مطمئن کر دے ( یہ دعا کرتے وقت ) اپنی ضرورت کا بیان کر دینا چاہئے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 154870,
        "last_updated": null
    },
    {
        "urduURN": 4062940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6383,
        "hadithSanad": "ہم سے محمد بن علاء نے بیان کیا ، کہا ہم سے اسامہ نے بیان کیا ، ان سے برید بن عبداللہ نے ، ان سے ابوبردہ نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے پانی مانگا ، پھر آپ صلی اللہ علیہ وسلم نے وضو کیا ، پھر ہاتھ اٹھا کر یہ دعا کی ۔ ” اے اللہ ! عبید ابوعامر کی مغفرت فرما ۔ “ میں نے اس وقت آنحضرت صلی اللہ علیہ وسلم کی بغل کی سفیدی دیکھی ۔ پھر آپ صلی اللہ علیہ وسلم نے دعا کی ۔ ” اے اللہ ! قیامت کے دن اسے اپنی بہت سی انسانی مخلوق سے بلند مرتبہ عطا فرمائیو ۔ “</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 154880,
        "last_updated": null
    },
    {
        "urduURN": 4062950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6384,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، انہوں نے کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ابوایوب سختیانی نے بیان کیا ، ان سے ابوعثمان نہدی نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھے جب ہم کسی بلند جگہ پر چڑھتے تو تکبیر کہتے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا لوگو ! اپنے اوپر رحم کرو ، تم کسی بہرے غائب خدا کو نہیں پکارتے ہو تم تو اس ذات کو پکارتے ہو جو بہت زیادہ سننے والا ، بہت زیادہ دیکھنے والا ہے ۔ پھر آنحضرت صلی اللہ علیہ وسلم میرے پاس تشریف لائے ۔ میں اس وقت زیر لب کہہ رہا تھا ۔ ” لا حول ولا قوۃ إلا بالله “ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، عبداللہ بن قیس کہو ” لا حول ولا قوۃ إلا بالله “ کیونکہ یہ جنت کے خزانوں میں سے ایک خزانہ ہے ، یا آنحضرت صلی اللہ علیہ وسلم نے یہ فرمایا میں تمہیں ایک ایسا کلمہ نہ بتا دوں جو جنت کے خزانوں میں سے ایک خزانہ ہے ۔ لا حول ولا قوۃ إلا بالله ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 154890,
        "last_updated": null
    },
    {
        "urduURN": 4062960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6385,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا ، انہوں نے کہا ہم سے نافع نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیاکہ",
        "hadithText": "رسول اللہ کریم صلی اللہ علیہ وسلم جب کسی غزوہ یا حج یا عمرہ سے واپس ہوتے تو زمین سے ہر بلند چیز پر چڑھتے وقت تین تکبیر یں کہا کرتے تھے ۔ پھر دعا کرتے ” اللہ کے سوا کوئی معبود نہیں ، تنہا ہے اس کا کوئی شریک نہیں ، اس کے لئے بادشاہی ہے اور اسی کے لئے تمام تعریفیں ہیں اور وہ ہر چیز پر قدرت رکھنے والا ہے ۔ لوٹتے ہیں ہم توبہ کرتے ہوئے اپنے رب کی عبادت کرتے ہوئے اور حمد بیان کرتے ہوئے ۔ اللہ نے اپنا وعدہ سچ کر دکھایا ، اپنے بندہ کی مدد کی اور تنہا تمام لشکر کو شکست دی ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 154900,
        "last_updated": null
    },
    {
        "urduURN": 4062970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6386,
        "hadithSanad": "ہم سے مسددنے بیان کیا ، انہوں نے کہا ہم سے حماد بن زید رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے عبدالرحمٰن بن عوف رضی اللہ عنہ پر زردی کا اثر دیکھا تو فرمایا یہ کیا ہے ؟ کہا کہ میں نے ایک عورت سے ایک گٹھلی کے برابرسونے پر شادی کی ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تمہیں برکت عطا فرمائے ، ولیمہ کر ، چاہے ایک بکری کا ہی ہو ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 154910,
        "last_updated": null
    },
    {
        "urduURN": 4062980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6387,
        "hadithSanad": "ہم سے ابو النعمان نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے عمرو نے اور ان سے جابر رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "میرے والد شہید ہوئے تو انہوں نے سات یانو لڑکیاں چھوڑی تھیں ( راوی کو تعداد میں شبہ تھا ) پھر میں نے ایک عورت سے شادی کی تو رسول اللہ صلی اللہ علیہ وسلم نے دریافت فرمایا ، جابر کیا تم نے شادی کر لی ہے ؟ میں نے کہا جی ہاں ۔ فرمایا کنواری سے یا بیوہ سے ؟ میں نے کہا بیاہی سے ۔ فرمایا ، کسی لڑکی سے کیوں نہ کی ۔ تم اس کے ساتھ کھیلتے اور وہ تمہارے ساتھ کھیلتی یا ( انحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ) تم اسے ہنساتے اور وہ تمہیں ہنساتی ۔ میں نے عرض کی ، میرے والد ( حضرت عبداللہ ) شہید ہوئے اور سات یا نو لڑکیاں چھوڑی ہیں ۔ اس لئے میں نے پسند نہیں کیا کہ میں ان کے پاس انہی جیسی لڑکی لاؤں ۔ چنانچہ میں نے ایسی عورت سے شادی کی جو ان کی نگرانی کر سکے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، اللہ تمہیں برکت عطا فرمائے ۔ ابن عیینہ اور محمد بن مسلمہ نے عمروسے روایت میں ۔ ” اللہ تمہیں برکت عطا فرمائے “ کے الفاظ نہیں کہے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 154920,
        "last_updated": null
    },
    {
        "urduURN": 4062990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6388,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے منصور نے ، ان سے سالم نے ، ان سے کریب نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اگر کوئی شخص اپنی بیوی کے پاس آنے کا ارادہ کرے تو یہ دعا پڑھے ۔ باسم الله ، ‏‏‏‏ اللهم جنبنا الشيطان ، ‏‏‏‏ وجنب الشيطان ما رزقتنا ” اللہ کے نام سے ، اے اللہ ! ہمیں شیطان سے دور رکھ اور جو کچھ تو ہمیں عطا فرمائے اسے بھی شیطان سے دور رکھ ۔ “ تو اگر اس صحبت سے کوئی اولاد مقدر میں ہو گی تو شیطان اسے کچھ بھی نقصان نہیں پہنچا سکے گا ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 154930,
        "last_updated": null
    },
    {
        "urduURN": 4063000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6389,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے عبدالوارث نے بیان کیا ، ان سے عبد العزیز نے بیان کیا اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی اکثر یہ دعا ہوا کرتی تھی اللهم ربنا آتنا في الدنيا حسنۃ ، ‏‏‏‏ وفي الآخرۃ حسنۃ ، ‏‏‏‏ وقنا عذاب النار ” اے اللہ ! ہمیں دنیا میں بھلائی ( حسنہ ) عطا کر اور آخرت میں بھلائی عطاکر اور ہمیں دوزخ سے بچا ۔ “</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 154940,
        "last_updated": null
    },
    {
        "urduURN": 4063010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6390,
        "hadithSanad": "ہم سے فروہ بن ابی المغراء نے بیان کیا ، انہوں نے کہا ہم سے عبیدہ بن حمیدنے بیان کیا ، ان سے عبدالملک بن عمیر نے بیان کیا ، ان سے مصعب بن سعدبن ابی وقاص رضی اللہ عنہ نے بیان کیا اور ان سے ان کے والد حضرت سعد بن ابی وقاص رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم ہمیں یہ کلمات اس طرح سکھاتے تھے جیسے لکھنا سکھاتے تھے ۔ اللهم إني أعوذ بك من البخل ، ‏‏‏‏ وأعوذ بك من الجبن ، ‏‏‏‏ وأعوذ بك أن نرد إلى أرذل العمر ، ‏‏‏‏ وأعوذ بك من فتنۃ الدنيا ، ‏‏‏‏ وعذاب القبر ” اے اللہ ! میں تیری پناہ مانگتا ہوں بخل سے اور تیری پناہ مانگتا ہوں دنیا کی آزمائش سے اور قبر کے عذاب سے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 154950,
        "last_updated": null
    },
    {
        "urduURN": 4063020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6391,
        "hadithSanad": "ہم سے ابراہیم بن المنذر نے بیان کیا ، کہا ہم سے انس بن عیاض نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم پر جادو کیا گیا اور کیفیت یہ ہوئی کہ آنحضرت صلی اللہ علیہ وسلم سمجھنے لگے کہ فلاں کام آپ نے کر لیا ہے حالانکہ وہ کام آپ نے نہیں کیا تھا اور آنحضرت صلی اللہ علیہ وسلم نے اپنے رب سے دعا کی تھی ، پھر آپ نے فرمایا ، تمہیں معلوم ہے ، اللہ نے مجھے وہ وہ بات بتادی ہے جو میں نے اس سے پوچھی تھی ۔ عائشہ رضی اللہ عنہا نے پوچھا ، یا رسول اللہ ! وہ خواب کیا ہے ؟ فرمایا میرے پاس دومرد آئے اور ایک میرے سر کے پاس بیٹھ گیا اور دوسرا پاؤں کے پاس ۔ پھر ایک نے اپنے دوسرے ساتھی سے کہا ، ان صاحب کی بیماری کیا ہے ؟ دوسرے نے جواب دیا ، ان پر جادو ہوا ہے ۔ پہلے نے پوچھا کس نے جادو کیا ہے ؟ جواب دیا کہ لبید بن اعصم نے ۔ پوچھا وہ جادو کس چیز میں ہے ؟ جواب دیا کہ کنگھی پر کھجور کے خوشہ میں ۔ پوچھا وہ ہے کہاں ؟ کہا کہ ذروان میں اور ذروان بنی زریق کا ایک کنواں ہے ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم اس کنویں پر تشریف لے گئے اور جب عائشہ رضی اللہ عنہا کے پاس دوبارہ واپس آئے تو فرمایا واللہ ! اس کا پانی مہدی سے نچوڑے ہوئے پانی کی طرح تھا اور وہاں کے کھجور کے درخت شیطان کے سر کی طرح تھے ۔ بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم تشریف لائے اور انہیں کنویں کے متعلق بتایا ۔ میں نے کہا ، یا رسول اللہ ! پھر آپ نے اسے نکا لا کیوں نہیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ مجھے اللہ تعالیٰ نے شفاء دے دی اور میں نے یہ پسند نہیں کیا کہ لوگوں میں ایک بری چیز پھیلاؤں ۔ عیسیٰ بن یونس اور لیث نے ہشام سے اضافہ کیا کہ ان سے ان کے والد نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم پر جادو کیا گیا تو آپ برابر دعا کرتے رہے اور پھر پوری حدیث کو بیان کیا ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 154960,
        "last_updated": null
    },
    {
        "urduURN": 4063030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6392,
        "hadithSanad": "ہم سے ابن سلام نے بیان کیا ، کہا ہم کو وکیع نے خبر دی ، انہیں ابن ابی خالد نے ، کہامیں نے ابن ابی اوفی رضی اللہ عنہما سے سنا ، کہاکہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے احزاب کے لئے بددعا کی ۔ ” اے اللہ ! کتا ب کے نازل کرنے والے ! حساب جلدی لینے والے ! احزاب کو ( مشرکین کی جماعتوں کو ، غزوہ احزاب میں ) شکست دے ، انہیں شکست دیدے اور انہیں جھنجوڑ دے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 154970,
        "last_updated": null
    },
    {
        "urduURN": 4063040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6393,
        "hadithSanad": "ہم سے معاذ بن فضالہ نے بیان کیا ، ان سے ہشام نے بیان کیا ، ان سے یحییٰ نے ، ان سے ابوسلمہ نے بیان کیا ، اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جب عشاء کی آخر رکعت میں ( رکوع سے اٹھتے ہوئے ) سمع اللہ لمن حمدہ کہتے تھے تو دعائے قنوت پڑھتے تھے ۔ ” اے اللہ ! عیاش بن ابی ربیعہ کو نجات دے ۔ اے اللہ ! ولید بن ولید کو نجات دے ۔ اے اللہ ! سلمہ بن ہشام کو نجات دے ۔ اے اللہ ! کمزور ناتواںمومنوں کو نجات دے ۔ اے اللہ ! اے اللہ ! قبیلہ مضر پر اپنی پکڑ کو سخت کر دے ۔ اے اللہ ! وہاں ایسا قحط پیدا کر دے جیسا یوسف علیہ السلام کے زمانہ میں ہوا تھا ۔ “</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 154980,
        "last_updated": null
    },
    {
        "urduURN": 4063050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6394,
        "hadithSanad": "ہم سے حسن بن ربیع نے بیان کیا ، کہا ہم سے ابوالاحوص نے بیان کیا ، ان سے عاصم نے اور ان سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک مہم بھیجی ، جس میں شریک لوگوں کو قراء ( یعنی قرآن مجید کے قاری ) کہا جاتا تھا ۔ ان سب کو شہید کر دیا گیا ۔ میں نے نہیں دیکھا کہ نبی کریم صلی اللہ علیہ وسلم کو کبھی کسی چیز کا اتنا غم ہوا ہو جتنا آپ کو ان کی شہادت کا غم ہوا تھا ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم نے ایک مہینے تک فجر کی نماز میں ان کے لئے بددعا کی ۔ آپ کہتے کہ عصیہ نے اللہ اور اس کے رسول کی نافرمانی کی ۔ “</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 154990,
        "last_updated": null
    },
    {
        "urduURN": 4063060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6395,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، انہوں نے کہا ہم سے ہشام نے بیان کیا ، انہیں معمر نے خبر دی ، انہیں زہری نے ، انہیں عروہ بن زبیر نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیاکہ",
        "hadithText": "یہود نبی کریم صلی اللہ علیہ وسلم کو سلام کرتے تو کہتے السام علیک ( آپ کو موت آئے ) عائشہ رضی اللہ عنہا ان کا مقصد سمجھ گئیں اور جو اب دیا کہ” عليكم السام واللعنۃ‏ “ ( تمہیں موت آئے اور تم پر لعنت ہو ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، ٹھہرو عائشہ ! اللہ تمام امور میں نرمی کو پسند کرتا ہے ۔ عائشہ رضی اللہ عنہا نے عرض کیا اے اللہ کے نبی ! کیا آپ نے نہیں سنا یہ لوگ کیا کہتے ہیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا تم نے نہیں سنا کہ میں انہیں کس طرح جواب دیتا ہوں ۔ میں کہتا ہوں ” وعلیکم “ ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 155000,
        "last_updated": null
    },
    {
        "urduURN": 4063070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6396,
        "hadithSanad": "ہم سے محمد بن مثنی ٰ نے بیان کیا ، انہوں نے کہا ہم سے انصاری نے بیان کیا ، ان سے ہشام بن حسان نے بیان کیا ، کہا ہم سے محمد بن سیرین نے بیان کیا ، ان سے عبیدہ نے بیان کیا ، کہا ہم سے حضرت علی بن ابی طالب رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "غزوہ خندق کے موقع پر ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اللہ ان کی قبروں اور ان کے گھر وں کو آگ سے بھر دے ۔ انہوں نے ہمیں ( عصر کی نماز ) صلاۃ وسطیٰ نہیں پڑھنے دی ۔ جب تک کہ سورج غروب ہو گیا اور یہ عصر کی نماز تھی ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 155010,
        "last_updated": null
    },
    {
        "urduURN": 4063080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6397,
        "hadithSanad": "ہم سے علی نے بیان کیا ، ان سے سفیان نے کہا ، ان سے ابوالزناد نے ، ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "طفیل بن عمر و رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا یا رسول اللہ ! قبیلہ دوس نے نافرمانی اور سرکشی کی ہے ، آپ ان کے لئے بددعا کیجئے ۔ لوگوں نے سمجھا کہ آنحضرت صلی اللہ علیہ وسلم ان کے لئے بددعا ہی کریں گے لیکن آنحضرت صلی اللہ علیہ وسلم نے دعا کی کہ ” اے اللہ ! قبیلہ دوس کو ہدایت دے اور انہیں ( میرے پاس ) بھیج دے “ ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 155020,
        "last_updated": null
    },
    {
        "urduURN": 4063090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6398,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے عبدالملک بن صباح نے بیان کیا ، ان سے شعبہ نے ، ان سے ابواسحاق نے ، ان سے ابن ابی موسیٰ نے ، ان سے ان کے والد نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلمیہ دعا کرتے تھے ” میرے رب ! میری خطا ، میری نادانی اور تمام معاملات میں میرے حدسے تجاوز کرنے میں میری مغفرت فرما اور وہ گناہ بھی جن کو تو مجھ سے زیادہ جاننے والا ہے ۔ اے اللہ ! میری مغفرت کر ، میری خطاؤں میں ، میرے بالا ارادہ اور بلا ارادہ کاموں میں اور میرے ہنسی مزاح کے کاموں میں اور یہ سب میری ہی طرف سے ہیں ۔ اے اللہ ! میری مغفرت کر ان کاموں میں جو میں کر چکا ہوں اور انہیں جو کروں گا اور جنہیں میں نے چھپایا اور جنہیں میں نے ظاہر کیا ہے ، تو سب سے پہلے ہے اور تو ہی سب سے بعد میں ہے اور تو ہر چیز پر قدرت رکھنے والا ہے “ اور عبیداللہ بن معاذ ( جو امام بخاری کے شیخ ہیں ) نے بیان کیا کہ ہم سے میرے والد نے بیان کیا کہا ہم سے شعبہ نے بیان کیا ، ان سے ابواسحاق نے ، ان سے ابوبردہ بن ابی موسیٰ نے اور ان سے ان کے والد نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 155031,
        "last_updated": null
    },
    {
        "urduURN": 4063100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6399,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے عبیداللہ بن عبد المجید نے بیان کیا ، کہا ہم سے اسرائیل نے بیان کیا ، ان سے ابواسحاق نے بیان کیا ،",
        "hadithText": "ان سے ابوبکر بن ابی موسیٰ اور ابوبردہ نے میرا خیال ہے کہ ابوموسیٰ اشعری رضی اللہ عنہ کے حوالہ سے کہ نبی کریم صلی اللہ علیہ وسلم یہ دعا کیا کرتے تھے اللهم اغفرلي خطيئتي وجهلي وإسرافي في أمري ، ‏‏‏‏ وما أنت أعلم به مني ، ‏‏‏‏ اللهم اغفر لي هزلي وجدي وخطاى وعمدي ، ‏‏‏‏ وكل ذلك عندي ” اے اللہ ! میری مغفرت فرما میری خطاؤں میں ، میری نادانی میں اور میری کسی معاملہ میں زیادتی میں ، ان باتوں میں جن کا تو مجھ سے زیادہ جاننے والا ہے ۔ اے اللہ ! میری مغفرت کر میرے ہنسی مزاح اور سنجیدگی میں اور میرے ارادہ میں اور یہ سب کچھ میری ہی طرف سے ہیں ۔ “</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 155050,
        "last_updated": null
    },
    {
        "urduURN": 4063110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6400,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے اسماعیل بن ابراہیم نے ، انہیں ایوب نے خبر دی ، انہیں محمد نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "ابوالقاسم صلی اللہ علیہ وسلم نے فرمایا ، جمعہ کے دن ایک ایسی گھڑی آتی ہے جس میں اگر کوئی مسلمان اس حال میں پالے کہ وہ کھڑا نماز پڑھ رہا ہو تو جو بھلائی بھی وہ مانگے گا اللہ عنایت فرمائے گا اور آپ نے اپنے ہاتھ سے اشاہ فرمایا اور ہم نے اس سے یہ سمجھا کہ آنحضور صلی اللہ علیہ وسلم اس گھڑی کے مختصر ہونے کی طرف اشارہ کر رہے ہیں ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 155060,
        "last_updated": null
    },
    {
        "urduURN": 4063120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6401,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے عبدالوہاب نے بیان کیا ، انہوں نے کہا ہم سے ایوب نے بیان کیا ، ان سے ابن ابی ملیکہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "یہود نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور کہا ” السام علیکم “ آنحضرت صلی اللہ علیہ وسلم نے جواب دیا ” وعلیکم “ لیکن عائشہ رضی اللہ عنہا نے کہا ” السام عليكم ، ‏‏‏‏ ولعنكم الله وغضب عليكم‏ “ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ٹھہر ، عائشہ ! نرم خوئی اختیار کر اور سختی اور بدکلامی سے ہمیشہ پرہیز کر ۔ انہوں نے کہا کیا آپ نے نہیں سنا کہ یہودی کیا کہہ رہے تھے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا تم نے نہیں سنا کہ میں نے انہیں کیا جواب دیا ، میں نے ان کی بات انہیں پر لوٹا دی اور میری ان کے بدلے میں دعا قبول کی گئی اور ان کی میرے بارے میں قبول نہیں کی گئی ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 155070,
        "last_updated": null
    },
    {
        "urduURN": 4063130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6402,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا کہ زہری نے بیان کیا کہ ہم سے سعید بن مسیب نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب پڑھنے والا آمین کہے تو تم بھی آمین کہو کیونکہ اس وقت ملائکہ بھی آمین کہتے ہیں اور جس کی آمین ملائکہ کیآمین کے ساتھ ہوتی ہے اس کے پچھلے گناہ معاف کر دئیے جاتے ہیں ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 155080,
        "last_updated": null
    },
    {
        "urduURN": 4063140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6403,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، ان سے امام مالک نے بیان کیا ، ان سے سمی نے ، ان سے ابوصالح نے ، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس نے یہ کلمہ کہ اللہ کے سوا کوئی معبود نہیں ، تنہا ہے اس کا کوئی شریک نہیں ، اسی کے لئے بادشاہی ہے اور اسی کے لئے تعریفیں ہیں اور وہ ہر چیز پر قدرت رکھنے والا ہے “ دن میں سو دفعہ پڑھا اسے دس غلاموں کو آزاد کرنے کا ثواب ملے گا اور اس کے لئے سو نیکیاں لکھ دی جائیں گی اور اس کی سو برائیاں مٹا دی جائیں گی اور اس دن وہ شیطان کے شرسے محفوظ رہے گا شام تک کے لئے اور کوئی شخص اس دن اس سے بہتر کام کرنے والا نہیں سمجھا جائے گا ، سوا اس کے جو اس سے زیادہ کرے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 98,
        "matchingArabicURN": 155090,
        "last_updated": null
    },
    {
        "urduURN": 4063150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6404,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے عبدالملک بن عمر و نے ، کہا کہ ہم سے عمر بن ابی زائد نے ، ان سے ابواسحاق سبیعی نے ، ان سے عمرو بن میمون نے بیان کیاکہ",
        "hadithText": "جس نے یہ کلمہ دس مرتبہ پڑھ لیا وہ ایسا ہو گا جیسے اس نے ایک عربی غلام آزاد کیا ۔ اسی سند سے عمر بن ابی زائدہ نے بیان کیا کہ ہم سے عبداللہ بن ابی السفر نے بیان کیا ، ان سے شعبی نے ، ان سے ربیع بن خثیم نے یہی مضمون تو میں نے ربیع بن خثیم سے پوچھا کہ تم نے کس سے یہ حدیث سنی ہے ؟ انہوں نے کہا کہ عمرو بن میمون اودی سے ۔ پھر میں عمرو بن میمون کے پاس آیا اور ان سے دریافت کیا کہ تم نے یہ حدیث کس سے سنی ہے ؟ انہوں نے کہا کہ ابن ابی لیلیٰ سے ۔ ابن ابی لیلیٰ کے پاس آیا اور پوچھا کہ تم نے یہ حدیث کس سے سنی ہے ؟ انہوں نے کہا کہ ابوایوب انصاری رضی اللہ عنہ سے ، وہ یہ حدیث نبی کریم صلی اللہ علیہ وسلم سے بیان کرتے تھے اور ابراہیم بن یوسف نے بیان کیا ، ان سے ان کے والد یوسف بن اسحاق نے ، ان سے ابواسحاق سبیعی نے ، انہوں نے کہا کہ مجھ سے عمرو بن میمون اودی نے بیان کیا ، ان سے عبدالرحمٰن بن ابی لیلیٰ نے اور ان سے ابوایوب انصاری رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے یہی حدیث نقل کی ۔ اور موسیٰ بن اسماعیل نے بیان کیا کہ ہم سے وہیب بن خالد نے بیان کیا ، ان سے داؤد بن ابی ہند نے ، ، ان سے عامر شعبی نے ، ان سے عبدالرحمٰن بن ابی لیلیٰ نے اور ان سے ابوایوب رضی اللہ عنہ نے ، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے ۔ اور اسماعیل بن ابی خالد نے بیان کیا ، ان سے شعبی نے ، ان سے ربیع نے موقوفاً ان کا قول نقل کیا ۔ اور آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے عبدالملک بن میسرہ نے بیان کیا ، کہا میں نے ہلال بن یساف سے سنا ، ان سے ربیع بن خثیم اور عمرو بن میمون دونوں نے اور ان سے ابن مسعود رضی اللہ عنہما نے ۔ اور اعمش اور حصین دونوں نے ہلال سے بیان کیا ، ان سے ربیع بن خثیم نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے ، یہی حدیث روایت کی ۔ اور ابو محمد حضرمی نے ابوایوب رضی اللہ عنہ سے ، انہوں نبی کریم صلی اللہ علیہ وسلم سے مرفوعاً اسی حدیث کو روایت کیا ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 99,
        "matchingArabicURN": 155101,
        "last_updated": null
    },
    {
        "urduURN": 4063160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6405,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، ان سے امام مالک نے بیان کیا ، ان سے سمی نے بیان کیا ، ان سے ابوصالح نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جس نےسبحان اللہ وبحمدہ دن میں سو مرتبہ کہا ، اس کے گناہ معاف کر دئیے جاتے ہیں ، خواہ سمندر کی جھاگ کے برابر ہی کیوں نہ ہوں ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 100,
        "matchingArabicURN": 155120,
        "last_updated": null
    },
    {
        "urduURN": 4063170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6406,
        "hadithSanad": "ہم سے زہیر بن حرب نے بیان کیا ، انہوں نے کہا ہم سے ابن فضیل نے بیان کیا ، ان سے عمارہ نے ، ان سے ابو زرعہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا دو کلمے جو زبان پر ہلکے ہیں ترازومیں بہت بھاری اور رحمان کو عزیز ہیں ۔ سبحان الله العظيم ، ‏‏‏‏ سبحان الله وبحمده ‏ ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 101,
        "matchingArabicURN": 155130,
        "last_updated": null
    },
    {
        "urduURN": 4063180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6407,
        "hadithSanad": "ہم سے محمد بن علاء نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے یزید بن عبداللہ نے ، ان سے ابوبردہ نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اس شخص کی مثال جو اپنے رب کو یاد کرتا ہے اور اس کی مثال جواپنے رب کو یاد نہیں کرتا زندہ اور مردہ جیسی ہے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 102,
        "matchingArabicURN": 155140,
        "last_updated": null
    },
    {
        "urduURN": 4063190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6408,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے جریر بن عبدالحمید نے بیان کیا ، ان سے اعمش نے ، ان سے ابوصالح نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیاکہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اللہ کے کچھ فرشتے ایسے ہیں جو راستوں میں پھرتے رہتے ہیں اور اللہ کی یاد کرنے والوں کو تلاش کرتے رہتے ہیں ۔ پھر جہاں وہ کچھ ایسے لوگوں کو پالیتے ہیں کہ جو اللہ کا ذکر کرتے ہوتے ہیں تو ایک دوسرے کو آواز دیتے ہیں کہ آؤ ہمارا مطلب حاصل ہو گیا ۔ پھر وہ پہلے آسمان تک اپنے پروں سے ان پر امنڈتے رہتے ہیں ۔ پھر ختم پر اپنے رب کی طرف چلے جاتے ہیں ۔ پھر ان کا رب ان سے پوچھتا ہے .... حالانکہ وہ اپنے بندوں کے متعلق خوب جانتا ہے .... کہ میرے بندے کیا کہتے تھے ؟ وہ جواب دیتے ہیں کہ وہ تیری تسبیح پڑھتے تھے ، تیری کبریائی بیان کرتے تھے ، تیری حمد کرتے تھے اور تیری بڑائی کرتے تھے ۔ پھر اللہ تعالیٰ پوچھتا ہے کیا انہوں نے مجھے دیکھا ہے ؟ کہا کہ وہ جواب دیتے ہیں نہیں ، واللہ ! انہوں نے تجھے نہیں دیکھا ۔ اس پر اللہ تعالیٰ فرماتا ہے ، پھر ان کا اس وقت کیا حال ہوتا جب وہ مجھے دیکھے ہوئے ہوتے ؟ وہ جواب دیتے ہیں کہ اگر وہ تیرا دیدار کر لیتے تو تیری عبادت اور بھی بہت زیادہ کرتے ، تیری بڑائی سب سے زیادہ بیان کرتے ، تیری تسبیح سب سے زیادہ کرتے ۔ پھر اللہ تعالیٰ دریافت کرتا ہے ، پھر وہ مجھ سے کیا مانگتے ہیں ؟ فرشتے کہتے ہیں کہ وہ جنت مانگتے ہیں ۔ بیان کیا کہ اللہ تعالیٰ دریافت کرتا ہے ان کا اس وقت کیا عالم ہوتا اگر انہوں نے جنت کو دیکھا ہوتا ؟ فرشتے جواب دیتے ہیں کہ اگر انہوں نے جنت کو دیکھا ہوتا تو وہ اس سے اور بھی زیادہ خواہشمند ہوتے ، سب سے بڑھ کر اس کے طلب گار ہوتے ۔ پھر اللہ تعالیٰ پوچھتاہے کہ وہ کس چیز سے پناہ مانگتے ہیں ؟ فرشتے جواب دیتے ہیں ، دوزخ سے ۔ اللہ تعالیٰ پوچھتا ہے کیا انہوں نے جہنم دیکھا ہے ؟ وہ جواب دیتے ہیں نہیں ، واللہ ، انہوں نے جہنم کو دیکھا نہیں ہے ۔ اللہ تعالیٰ فرماتا ہے ، پھر اگر انہوں نے اسے دیکھا ہوتا تو ان کا کیا حال ہوتا ؟ وہ جواب دیتے ہیں کہ اگر انہوں نے اسے دیکھا ہوتا تو اس سے بچنے میں وہ سب سے آگے ہوتے اور سب سے زیادہ اس سے خوف کھاتے ۔ اس پر اللہ تعالیٰ فرماتا ہے کہ میں تمہیں گواہ بناتا ہوں کہ میں نے ان کی مغفرت کی ۔ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا کہ اس پر ان میں سے ایک فرشتے نے کہا کہ ان میں فلاں بھی تھا جو ان ذاکرین میں سے نہیں تھا ، بلکہ وہ کسی ضرورت سے آ گیا تھا ۔ اللہ تعالیٰ ارشاد فرماتاہے کہ یہ ( ذاکرین ) وہ لوگ ہیں جن کی مجلس میں بیٹھنے والا بھی نامراد نہیں رہتا ۔ اس حدیث کو شعبہ نے بھی اعمش سے روایت کیا لیکن اس کو مرفوع نہیں کیا ۔ اور سہیل نے بھی اس کو اپنے والدین ابوصالح سے روایت کیا ، انہوں نے ابوہریرہ رضی اللہ عنہ سے ، انہوں نے آنحضرت صلی اللہ علیہ وسلم سے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 103,
        "matchingArabicURN": 155150,
        "last_updated": null
    },
    {
        "urduURN": 4063200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6409,
        "hadithSanad": "ہم سے ابوالحسن محمد بن مقاتل نے بیان کیا ، انہوں نے کہا ہم کو حضرت عبداللہ بن مبارک نے خبر دی ، انہوں نے کہا ہم کو سلیمان بن طرخان تیمی نے خبر دی ، انہیں ابوعثمان نہدی نے اور ان سے حضرت ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم ایک گھاٹی یا درے میں گھسے ۔ بیان کیا کہ جب ایک اور صحابی بھی اس پر چڑھ گئے تو انہوں نے بلند آواز سے ” لا إله إلا الله والله أكبر‏ “ کہا ۔ راوی نے بیان کیا کہ اس وقت آنحضرت صلی اللہ علیہ وسلم اپنے خچر پر سوار تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم لوگ کسی بہرے یا غائب کو نہیں پکارتے ۔ پھر فرمایا ، ابوموسیٰ یا تو یوں ( فرمایا ) اے عبداللہ بن قیس ! کیا میں تمہیں ایک کلمہ نہ بتا دوں جو جنت کے خزانوں میں سے ہے ۔ میں نے عرض کیا ، ضرور ارشاد فرمائیں فرمایا کہ ” لا حول ولا قوۃ إلا بالله “ ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 104,
        "matchingArabicURN": 155160,
        "last_updated": null
    },
    {
        "urduURN": 4063210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6410,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے سفیان نے بیان کیا ، انہوں نے کہا کہ ہم نے یہ حدیث ابوالزناد سے یاد کی ، ان سے اعرج نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے روایتاًبیان کیاکہ",
        "hadithText": "اللہ تعالیٰ کے ننانوے نام ہیں ، ایک کم سو ، جو شخص بھی انہیں یاد کر لے گا جنت میں جائے گا ۔ اللہ طاق ہے اور طاق کو پسند کرتا ہے ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 105,
        "matchingArabicURN": 155170,
        "last_updated": null
    },
    {
        "urduURN": 4063220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 80,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6411,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہامجھ سے میرے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا کہ مجھ سے شقیق نے بیان کیا ، کہاکہ",
        "hadithText": "ہم عبداللہ بن مسعود رضی اللہ عنہما کا انتظار کر رہے تھے کہ یزید بن معاویہ آئے ۔ ہم نے کہا ، تشریف رکھئے لیکن انہوں نے جواب دیا کہ نہیں ، میں اندر جاؤں گا اور تمہارے ساتھ ( عبداللہ بن مسعود رضی اللہ عنہما ) کو باہر لاؤں گا ۔ اگر وہ نہ آئے تو میں ہی تنہا آ جاؤں گا اور تمہارے ساتھ بیٹھوں گا ۔ پھر عبداللہ بن مسعود رضی اللہ عنہما باہر تشریف لائے اور وہ یزید بن معاویہ کا ہاتھ پکڑے ہوئے تھے پھر ہمارے سامنے کھڑے ہوئے کہنے لگے میں جان گیا تھا کہ تم یہاں موجود ہو ۔ پس میں جو نکلا تو اس وجہ سے کہ میں نے آنحضرت صلی اللہ علیہ وسلم کو دیکھا آپ مقررہ دنوں میں ہم کو وعظ فرمایا کرتے تھے ۔ ( فاصلہ دے کر ) آپ کا مطلب یہ ہوتا تھا کہ کہیں ہم اکتا نہ جائیں ۔</b>",
        "bookID": "80.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 106,
        "matchingArabicURN": 155180,
        "last_updated": null
    }
]