[
    {
        "urduURN": 4065050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6594,
        "hadithSanad": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا مجھ کو سلیمان اعمش نے خبر دی ، کہا کہ میں نے زید بن وہب سے سنا ، ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ہم کو رسول اللہ نے بیان سنایا اور آپ سچوں کے سچے تھے اور آپ کی سچائی کی زبردست گواہی دی گئی ۔ فرمایا کہ تم میں سے ہر شخص پہلے اپنی ماں کے پیٹ میں چالیس دن تک نطفہ ہی رکھا جاتا ہے ۔ پھر اتنی ہی مدت میں ” علقہ “ یعنی خون کی پھٹکی ( بستہ خون ) بنتا ہے پھر اتنے ہی عرصہ میں ” مضغہ “ ( یعنی گوشت کا لوتھڑا ) پھر چار ماہ بعد اللہ تعالیٰ ایک فرشتہ بھیجتا ہے اور اس کے بارے میں ( ماں کے پیٹ ہی میں ) چار باتوں کے لکھنے کا حکم دیا جاتا ہے ۔ اس کی روزی کا ، اس کی موت کا ، اس کا کہ وہ بدبخت ہے یا نیک بخت ۔ پس واللہ ، تم میں سے ایک شخص دوزخ والوں کے سے کام کرتا رہتا ہے اور جب اس کے اور دوزخ کے درمیان صرف ایک بالشت کا فاصلہ یا ایک ہاتھ کا فاصلہ باقی رہ جاتا ہے تو اس کی تقدیر اس پر غالب آتی ہے اور وہ جنت والوں کے سے کام کرنے لگتا ہے اور جنت میں جاتا ہے ۔ اسی طرح ایک شخص جنت والوں کے سے کام کرتا رہتا ہے اور جب اس کے اور جنت کے درمیان ایک ہاتھ کا فاصلہ باقی رہ جاتا ہے تو اس کی تقدیر اس پر غالب آتی ہے اور وہ دوزخ والوں کے کام کرنے لگتا ہے اور دوزخ میں جاتا ہے ۔ امام بخاری رحمہ اللہ کہتے ہیں کہ آدم بن ابی ایاس نے اپنی روایت میں یوں کہا کہ جب ایک ہاتھ کا فاصلہ رہ جاتا ہے ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 157060,
        "last_updated": null
    },
    {
        "urduURN": 4065060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6595,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد نے بیان کیا ، ان سے عبیداللہ بن ابوبکر بن انس نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اللہ تعالیٰ نے رحم مادر پر ایک فرشتہ مقرر کر دیا ہے اور وہ کہتا رہتا ہے کہ اے رب ! یہ نطفہ قرار پایا ہے ۔ اے رب ! اب علقہ یعنی جما ہوا خون بن گیا ہے ۔ اے رب ! اب مضغہ ( گوشت کا لوتھڑا ) بن گیا ہے ۔ پھر جب اللہ تعالیٰ چاہتا ہے کہ اس کی پیدائش پوری کرے تو وہ پوچھتا ہے اے رب لڑکا ہے یا لڑکی ؟ نیک ہے یا برا ؟ اس کی روزی کیا ہو گی ؟ اس کی موت کب ہو گی ؟ اسی طرح یہ سب باتیں ماں کے پیٹ ہی میں لکھ دی جاتی ہیں ۔ دنیا میں اسی کے مطابق ظاہر ہوتا ہے ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 157070,
        "last_updated": null
    },
    {
        "urduURN": 4065070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6596,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے یزید رشک نے بیان کیا ، انہوں نے مطرف بن عبداللہ بن شخیر سے سنا ، وہ عمران بن حصین رضی اللہ عنہما سے بیان کرتے تھے ، انہوں نے کہا کہ",
        "hadithText": "ایک صاحب نے ( یعنی خود انہوں نے ) عرض کیا یا رسول اللہ ! کیا جنت کے لوگ جہنمیوں میں سے پہچانے جا چکے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ” ہاں “ انہوں نے کہا کہ پھر عمل کرنے والے کیوں عمل کریں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہر شخص وہی عمل کرتا ہے جس کے لیے وہ پیدا کیا گیا ہے یا جس کے لیے اسے سہولت دی گئی ہے ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 157080,
        "last_updated": null
    },
    {
        "urduURN": 4065080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6597,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر محمد بن جعفر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ابوبشر نے ، ان سے سعید بن جبیر نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم سے مشرکین کی اولاد کے بارے میں سوال کیا گیا تو آپ نے فرمایا کہ اللہ کو خوب معلوم ہے کہ وہ ( بڑے ہو کر ) کیا عمل کرتے ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 157090,
        "last_updated": null
    },
    {
        "urduURN": 4065090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6598,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے یونس نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، انہوں نے کہا کہ مجھے عطابن یزید نے خبر دی ، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم سے مشرکین کی اولاد کے متعلق پوچھا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ خوب جانتا ہے کہ وہ کیا عمل کرتے ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 157100,
        "last_updated": null
    },
    {
        "urduURN": 4065100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6599,
        "hadithSanad": "مجھ سے اسحاق نے بیان کیا ، انہوں نے کہا ہم کو عبدالرزاق نے خبر دی ، کہا ہم کو معمر نے خبر دی ، انہیں ہمام نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کوئی بچہ ایسا نہیں ہے جو فطرت پر نہ پیدا ہوتا ہو ۔ لیکن اس کے والدین اسے یہودی یا نصرانی بنا دیتے ہیں جیسا کہ تمہارے جانوروں کے بچے پیدا ہوتے ہیں ۔ کیا ان میں کوئی کن کٹا پیدا ہوتا ہے ؟ وہ تو تم ہی اس کا کان کاٹ دیتے ہو ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 157111,
        "last_updated": null
    },
    {
        "urduURN": 4065110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6601,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں ابوالزناد نے ، انہیں اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کوئی عورت اپنی کسی ( دینی ) بہن کی طلاق کا مطالبہ ( شوہر سے ) نہ کرے کہ اس کے گھر کو اپنے ہی لیے خاص کر لینا چاہے ۔ بلکہ اسے نکاح ( دوسری عورت کی موجودگی میں بھی ) کر لینا چاہئے کیونکہ اسے اتنا ہی ملے گا جتنا اس کے مقدر میں ہو گا ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 157130,
        "last_updated": null
    },
    {
        "urduURN": 4065120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6602,
        "hadithSanad": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے اسرائیل نے بیان کیا ، ان سے عاصم نے ، ان سے ابوعثمان نے اور ان سے اسامہ رضی اللہ عنہ نے بیان کیا کہ میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں موجود تھا کہ",
        "hadithText": "آنحضرت صلی اللہ علیہ وسلم کی صاحبزادیوں میں سے ایک کا بلاوا آیا ۔ آنحضرت صلی اللہ علیہ وسلم کی خدمت میں سعد ، ابی بن کعب اور معاذ رضی اللہ عنہم موجود تھے ۔ بلانے والے نے آ کر کہا کہ ان کا بچہ ( آنحضرت صلی اللہ علیہ وسلم کا نواسہ ) نزع کی حالت میں ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے کہلابھیجا کہ اللہ ہی کا ہے جو وہ لیتا ہے ، اس لیے وہ صبر کریں اور اللہ سے اجر کی امید رکھیں ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 157140,
        "last_updated": null
    },
    {
        "urduURN": 4065130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6603,
        "hadithSanad": "ہم سے حبان بن موسیٰ نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ بن مبارک نے خبر دی ، انہوں نے کہا ہم کو یونس نے خبر دی ، انہیں زہری نے کہا کہ ہم کو عبداللہ بن محیریز جمحی نے خبر دی ، انہیں ابو سعید خدری رضی اللہ عنہ نے کہ",
        "hadithText": "وہ نبی کریم صلی اللہ علیہ وسلم کے پاس بیٹھے ہوئے تھے کہ قبیلہ انصار کا ایک آدمی آیا اور عرض کیا یا رسول اللہ ! ہم لونڈیوں سے ہمبستری کرتے ہیں اورمال سے محبت کرتے ہیں ۔ آپ کا عزل کے بارے میں کیا خیال ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اچھا تم ایسا کرتے ہو ، تمہارے لیے کچھ قباحت نہیں اگر تم ایسا نہ کرو ، کیونکہ جس جان کی بھی پیدائش اللہ نے لکھ دی ہے وہ ضرور پیدا ہو کر رہے گی ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 157150,
        "last_updated": null
    },
    {
        "urduURN": 4065140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6604,
        "hadithSanad": "ہم سے موسیٰ بن مسعود نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے اعمش نے بیان کیا ، ان سے ابووائل نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ہمیں ایک خطبہ دیا اور قیامت تک کوئی ( دینی ) چیز ایسی نہیں چھوڑی جس کا بیان نہ کیا ہو ، جسے یاد رکھنا تھا اس نے یاد رکھا اور جسے بھولنا تھا وہ بھول گیا ، جب میں ان کی کوئی چیز دیکھتا ہوں جسے میں بھول چکا ہوں تو اس طرح اسے پہچان لیتا ہوں جس طرح وہ شخص جس کی کوئی چیز گم ہو گئی ہو کہ جب وہ اسے دیکھتا ہے تو فوراً پہچان لیتا ہے ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 157160,
        "last_updated": null
    },
    {
        "urduURN": 4065150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6605,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، ان سے ابوحمزہ نے ، ان سے اعمش نے ، ان سے سعد بن عبیدہ نے ، ان سے ابوعبدالرحمن سلمی نے اور ان سے حضرت علی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ بیٹھے ہوئے تھے اور آنحضرت صلی اللہ علیہ وسلم کے ہاتھ میں ایک لکڑی تھی جس سے آپ زمین کرید رہے تھے اور آپ نے ( اسی اثناء میں ) فرمایا کہ تم میں سے ہر شخص کا جہنم کا یا جنت کا ٹھکانا لکھا جا چکا ہے ، ایک مسلمان نے اس پر عرض کیا یا رسول اللہ ! پھر کیوں نہ ہم اس پر بھروسہ کر لیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں عمل کرو کیونکہ ہر شخص ( اپنی تقدیر کے مطابق ) عمل کی آسانی پاتا ہے ۔ پھر آپ نے اس آیت کی تلاوت کی ۔ ” فاما من اعطی واتقیٰ “ الآیہ ۔ ( پس جس نے راہ للہ دیا اور تقویٰ اختیار کیا ....الخ )</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 157170,
        "last_updated": null
    },
    {
        "urduURN": 4065160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6606,
        "hadithSanad": "ہم سے حبان بن موسیٰ نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ بن مبارک نے خبر دی ، انہوں نے کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں سعید بن مسیب نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ خیبر کی لڑائی میں موجود تھے ، آنحضرت صلی اللہ علیہ وسلم نے ایک شخص کے بارے میں جو آپ کے ساتھ شریک جہاد تھا اور اسلام کا دعویدار تھا فرمایا کہ یہ جہنمی ہے ۔ جب جنگ ہونے لگی تو اس شخص نے بہت جم کر لڑائی میں حصہ لیا اور بہت زیادہ زخمی ہو گیا پھر بھی وہ ثابت قدم رہا ۔ آنحضرت صلی اللہ علیہ وسلم کے ایک صحابی نے آ کر عرض کیا یا رسول اللہ ! اس شخص کے بارے میں آپ کو معلوم ہے جس کے بارے میں ابھی آپ نے فرمایا تھا کہ وہ جہنمی ہے وہ تو اللہ کے راستے میں بہت جم کر لڑا ہے اور بہت زیادہ زخمی ہو گیا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے اب بھی یہی فرمایا کہ وہ جہنمی ہے ۔ ممکن تھا کہ بعض مسلمان شبہ میں پڑجاتے لیکن اس عرصہ میں اس شخص نے زخموں کی تاب نہ لا کر اپنا ترکش کھولا اور اس میں سے ایک تیر نکال کر اپنے آپ کو ذکر کر لیا ۔ پھر بہت سے مسلمان آنحضرت صلی اللہ علیہ وسلم کی خدمت میں دوڑتے ہوئے پہنچے اور عرض کیا یا رسول اللہ ! اللہ تعالیٰ نے آپ کی بات سچ کردکھائی ۔ اس شخص نے اپنے آپ کو ہلاک کر کے اپنی جان خود ہی ختم کرڈالی ۔ آنحضرت صلی اللہ علیہ وسلم نے اس موقع پر فرمایا کہ اے بلال ! اٹھو اور لوگوں میں اعلان کر دو کہ جنت میں صرف مومن ہی داخل ہو گا اور یہ کہ اللہ تعالیٰ نے اس دین کی خدمت و مدد بےدین آدمی سے بھی کراتا ہے ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 157180,
        "last_updated": null
    },
    {
        "urduURN": 4065170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6607,
        "hadithSanad": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم سے ابوغسان نے بیان کیا ، کہا مجھ سے ابوحازم نے بیان کیا اور ان سے سہل بن سعد رضی اللہ عنہ نے کہ",
        "hadithText": "ایک شخص جو مسلمانوں کی طرف سے بڑی بہادری سے لڑرہا تھا اور اس غزوہ میں نبی کریم صلی اللہ علیہ وسلم بھی موجود تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے دیکھا اور فرمایا کہ جو کسی جہنمی شخص کو دیکھنا چاہتا ہے وہ اس شخص کو دیکھ لے چنانچہ وہ شخص جب اسی طرح لڑنے میں مصروف تھا اور مشرکین کو اپنی بہادری کی وجہ سے سخت تر تکالیف میں مبتلا کر رہا تھا تو ایک مسلمان اس کے پیچھے پیچھے چلا ، آخر وہ شخص زخمی ہو گیا اور جلدی سے مرجانا چاہا ، اس لیے اس نے اپنی تلوار کی دھار اپنے سینے پر لگالی اور تلوار اس کے شانوں کو پار کرتی ہوئی نکل گئی ۔ اس کے بعد پیچھا کرنے والا شخص آنحضرت صلی اللہ علیہ وسلم کی خدمت میں دوڑتا ہوا حاضر ہوا اور عرض کیا ، میں گواہی دیتا ہوں کہ آپ اللہ کے رسول ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا بات کیا ہے ؟ ان صاحب نے کہا کہ آپ نے فلاں شخص کے بارے میں فرمایا تھا کہ جو کسی جہنمی کو دیکھنا چاہتا ہے وہ اس شخص کو دیکھ لے حالانکہ وہ شخص مسلمانوں کی طرف سے بڑی بہادری سے لڑرہا تھا ۔ میں سمجھا کہ وہ اس حالت میں نہیں مرے گا ۔ لیکن جب وہ زخمی ہو گیا تو جلدی سے مرجانے کی خواہش میں اس نے خودکشی کر لی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ بندہ دوزخیوں کے سے کام کرتا رہتا ہے حالانکہ وہ جنتی ہوتا ہے ( اسی طرح دوسرا بندہ ) جنتیوں کے کام کرتا رہتا ہے حالانکہ وہ دوزخی ہوتا ہے ، بلاشبہ عملوں کا اعتبار خاتمہ پر ہے ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 157190,
        "last_updated": null
    },
    {
        "urduURN": 4065180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6608,
        "hadithSanad": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے منصور بن معتمر نے ، ان سے عبداللہ بن مرہ نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے نذر ماننے سے منع کیا تھا اور فرمایا تھا کہ نذر کسی چیزکو نہیں لوٹاتی ، نذر صرف بخیل کے دل سے پیسہ نکالتی ہے ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 157200,
        "last_updated": null
    },
    {
        "urduURN": 4065190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6609,
        "hadithSanad": "ہم سے بشر بن محمد نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو معمر نے خبر دی ، انہیں ہمام بن منبہ نے ، انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا نذر ( منت ) انسان کو کوئی چیز نہیں دیتی جو میں ( رب ) نے اس کی تقدیر میں نہ لکھی ہو بلکہ وہ تقدیر دیتی ہے جو میں ( رب ) نے اس کے لیے مقرر کر دی ہے ، البتہ اس کے ذریعہ میں بخیل کا مال نکلوالیتا ہوں ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 157210,
        "last_updated": null
    },
    {
        "urduURN": 4065200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6610,
        "hadithSanad": "مجھ سے ابوالحسن محمد بن مقاتل نے بیان کیا ، انہوں نے کہا ہم کو حضرت عبداللہ بن مبارک نے خبر دی ، انہوں نے کہا ہم کو خالد حذاء نے خبر دی ، انہیں ابوعثمان نہدی نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک غزوہ میں تھے اور جب بھی ہم کسی بلندی پر چڑھتے یا کسی نشیبی علاقہ میں اترتے تو تکبیر بلند آواز سے کہتے ۔ بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم ہمارے قریب آئے اور فرمایا اے لوگو ! اپنے آپ پر رحم کرو ، کیونکہ تم کسی بہرے یا غیر موجود کو نہیں پکارتے بلکہ تم اس ذات کو پکارتے ہو جو بہت زیادہ سننے والا بڑا دیکھنے والا ہے ۔ پھر فرمایا اے عبداللہ بن قیس ! ( ابوموسیٰ اشعری رضی اللہ عنہ ) کیا میں تمہیں ایک کلمہ نہ سکھادوں جو جنت کے خزانوں میں سے ہے ۔ ( وہ کلمہ ہے ) لاحول ولا قوۃ الا باﷲ ( طاقت و قوت اللہ کے سوا اور کسی کے پاس نہیں )</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 157220,
        "last_updated": null
    },
    {
        "urduURN": 4065210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6611,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو یونس نے خبر دی ، ان سے زہری نے بیان کیا ، کہا مجھ سے ابوسلمہ نے بیان کیا ، ان سے ابو سعید خدری رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب بھی کوئی شخص حاکم ہوتا ہے تو اس کے صلاح کار اور مشیر دو طرح کے ہوتے ہیں ایک تو وہ جو اسے نیکی اوربھلائی کا حکم دیتے ہیں اور اس پر ابھارتے رہتے ہیں اور دوسرے وہ جو اسے برائی کا حکم دیتے ہیں اور اس پر اسے ابھارتے رہتے ہیں اور معصوم وہ ہے جسے اللہ محفوظ رکھے ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 157230,
        "last_updated": null
    },
    {
        "urduURN": 4065220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6612,
        "hadithSanad": "مجھ سے محمود بن غیلان نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں ابن طاؤس نے ، انہیں ان کے والد نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "یہ جو لمم کا لفظ قرآن میں آیا ہے تو میں لمم کے مشابہ اس بات سے زیادہ کوئی بات نہیں جانتا جو ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے بیان کی ہے کہ اللہ تعالیٰ نے انسان کے لیے زنا کا کوئی نہ کوئی حصہ لکھ دیا ہے جس سے اسے لامحالہ گزرنا ہے ، پس آنکھ کا زنا ( غیرمحرم کو ) دیکھناہے ، زبان کا زنا غیرمحرم سے گفتگو کرناہے ، دل کا زنا خواہش اور شہوت ہے اور شرمگاہ اس کی تصدیق کر دیتی ہے یا اسے جھٹلادیتی ہے ۔ اور شبابہ نے بیان کیا کہ ہم سے ورقاء نے بیان کیا ، ان سے ابن طاؤس نے ، ان سے ان کے والد نے ، ان سے حضرت ابوہریرہ رضی اللہ عنہ نے ، انہوں نے آنحضرت صلی اللہ علیہ وسلم سے پھر اس حدیث کو نقل کیا ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 157240,
        "last_updated": null
    },
    {
        "urduURN": 4065230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6613,
        "hadithSanad": "ہم سے حمیدی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے بیان کیا ، ان سے عکرمہ نے",
        "hadithText": "اور ان سے ابن عباس رضی اللہ عنہما نے ” آیت “ اور وہ رؤیا جو ہم نے تمہیں دکھایا ہے اسے ہم نے صرف لوگوں کے لیے آزمائش بنایا ہے “ کے متعلق کہا کہ اس سے مراد آنکھ کا دیکھنا ہے جو رسول اللہ صلی اللہ علیہ وسلم کو اس معراج کی رات دکھایا گیا تھا ۔ جب آپ کو بیت المقدس تک رات کو لے جایاگیا تھا ۔ کہا کہ قرآن مجید میں ” الشجرۃ الملعونۃ “ سے مراد ” زقوم “ کا درخت ہے ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 157260,
        "last_updated": null
    },
    {
        "urduURN": 4065240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6614,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، کہا کہ ہم نے عمرو سے اس حدیث کو یاد کیا ، ان سے طاؤس نے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ارشاد فرمایا ” آدم اور موسیٰ نے مباحثہ کیا ۔ موسیٰ علیہ السلام نے آدم علیہ السلام سے کہا آدم ! آپ ہمارے باپ ہیں مگر آپ ہی نے ہمیں محروم کیا اور جنت سے نکالا ۔ آدم علیہ السلام نے موسیٰ علیہ السلام سے کہا موسیٰ آپ کو اللہ تعالیٰ نے ہم کلامی کے لیے برگزیدہ کیا اور اپنے ہاتھ سے آپ کے لیے تورات کو لکھا ۔ کیا آپ مجھے ایک ایسے کام پر ملامت کرتے ہیں جو اللہ تعالیٰ نے مجھے پیدا کرنے سے چالیس سال پہلے میری تقدیر میں لکھ دیا تھا ۔ آخر آدم علیہ السلام بحث میں موسیٰ علیہ السلام پر غالب آئے ۔ تین مرتبہ آنحضرت صلی اللہ علیہ وسلم نے یہ جملہ فرمایا ۔ سفیان نے اسی اسناد سے بیان کیا ، کہا ہم سے ابوالزناد نے بیان کیا ، ان سے اعرج نے ، ان سے ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے پھر یہی حدیث نقل کی ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 157271,
        "last_updated": null
    },
    {
        "urduURN": 4065250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6615,
        "hadithSanad": "ہم سے محمد بن سنان نے بیان کیا ، کہا ہم سے فلیح نے بیان کیا ، کہا ہم سے عبدہ بن ابی لبابہ نے بیان کیا ، ان سے مغیرہ بن شعبہ کے غلام وردا نے بیان کیا کہ",
        "hadithText": "معاویہ رضی اللہ عنہ نے مغیرہ بن شعبہ رضی اللہ عنہ کو لکھا مجھے رسول اللہ صلی اللہ علیہ وسلم کی وہ دعا لکھ کر بھیجو جو تم نے آنحضرت صلی اللہ علیہ وسلم کو نماز کے بعد کرتے سنی ہے ۔ چنانچہ مغیرہ رضی اللہ عنہ نے مجھ کو لکھوایا ۔ انہوں نے کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے آنحضرت صلی اللہ علیہ وسلم ہر فرض نماز کے بعد یہ دعا کیا کرتے تھے ۔ ” اللہ کے سوا کوئی معبود نہیں وہ ایک ہے اس کا کوئی شریک نہیں ، اے اللہ ! جو تو دینا چاہے اسے کوئی روکنے والا نہیں اور جو تو روکنا چاہے اسے کوئی دینے والا نہیں اور تیرے سامنے دولت والے کی دولت کچھ کام نہیں دے سکتی ۔ اور ابن جریج نے کہا کہ مجھ کو عبدہ نے خبر دی اور انہیں وردا نے خبر دی ، پھر اس کے بعد میں معاویہ رضی اللہ عنہ کے یہاں گیا تو میں نے دیکھا کہ وہ لوگوں کو اس دعا کے پڑھنے کا حکم دے رہے تھے ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 157290,
        "last_updated": null
    },
    {
        "urduURN": 4065260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6616,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے سفیان نے بیان کیا ، ان سے سمی نے بیان کیا ، ان سے ابوصالح نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اللہ سے پناہ مانگا کرو آزمائش کرو آزمائش کی مشقت ، بدبختی کی پستی ، برے خاتمے اور دشمن کے ہنسنے سے ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 157300,
        "last_updated": null
    },
    {
        "urduURN": 4065270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6617,
        "hadithSanad": "ہم سے ابوالحسن محمد بن مقاتل نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ نے خبر دی ، انہوں نے کہا ہم کو موسیٰ بن عقبہ نے خبر دی ، ان سے سالم نے بیان کیا اور ان سے عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "اکثرنبی کریم صلی اللہ علیہ وسلم قسم کھایا کرتے تھے کہ ” نہیں “ دلوں کو پھیرنے والے کی قسم ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 157310,
        "last_updated": null
    },
    {
        "urduURN": 4065280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6618,
        "hadithSanad": "ہم سے علی بن حفص اور بشر بن محمد نے بیان کیا ، ان دونوں نے کہا کہ عبداللہ نے ہمیں خبر دی ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں سالم نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ابن صیاد سے فرمایا کہ میں نے تیرے لیے ایک بات دل میں چھپارکھی ہے ( بتا وہ کیا ہے ؟ ) اس نے کہا کہ ” دھواں “ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، بدبخت ! اپنی حیثیت سے آگے نہ بڑھ ۔ عمر رضی اللہ عنہ نے عرض کیا ، آپ مجھے اجازت دیں تو میں اس کی گردن مار دوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اسے چھوڑ دو ، اگر یہ وہی ( دجال ) ہوا تو تم اس پر قابو نہیں پا سکتے اور اگر یہ وہ نہ ہوا تو اسے قتل کرنے میں تمہارے لیے کوئی بھلائی نہیں ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 157320,
        "last_updated": null
    },
    {
        "urduURN": 4065290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6619,
        "hadithSanad": "مجھ سے اسحاق بن ابراہیم حنظلی نے بیان کیا ، انہوں نے کہا مجھ کو نضر نے خبر دی ، انہوں نے کہا ہم سے داؤد بن ابی الفرات نے بیان کیا ، ان سے عبداللہ بن بریدہ نے بیان کیا ، ان سے یحییٰ بن یعمر نے بیان کیا اور انہیں عائشہ رضی اللہ عنہا نے خبر دی کہ",
        "hadithText": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے طاعون کے متعلق پوچھا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ عذاب تھا اور اللہ تعالیٰ جس پر چاہتا ہے اسے بھیجتا تھا ۔ پھر اللہ تعالیٰ نے اسے مومنوں کے لیے رحمت بنا دیا ، کوئی بھی بندہ اگر کسی ایسے شہرمیں ہے جس میں طاعون کی وبا پھوٹی ہوئی ہے اور اس میں ٹھہرا ہے اور اس شہر سے بھاگا نہیں صبر کئے ہوئے ہے اور اس پر اجر کا امیدوار ہے اور یقین رکھتا ہے کہ اس تک صرف وہی چیز پہنچ سکتی ہے جو اللہ نے اس کی تقدیر میں لکھ دی ہے تو اسے شہید کے برابر ثواب ملے گا ۔</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 157330,
        "last_updated": null
    },
    {
        "urduURN": 4065300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 82,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6620,
        "hadithSanad": "ہم سے ابوالنعمان نے بیان کیا ، انہوں نے کہا کہ ہم کو جریر نے خبر دی جو ابن حازم ہیں ، انہیں ابواسحاق نے ، ان سے براء  بن عازب رضی اللہ عنہ نے کہا کہ",
        "hadithText": "میں نے غزوہ خندق کے دن رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ ہمارے ساتھ مٹی اٹھا رہے تھے اور یہ کہتے جاتے تھے ۔ ” واللہ ، اگر اللہ نہ ہوتا تو ہم ہدایت نہ پا سکتے ۔ نہ روزہ رکھ سکتے اور نہ نماز پڑھ سکتے ۔ پس اے اللہ ! ہم پر سکینت نازل فرما ۔ اور جب سامنا ہو تو ہمیں ثابت قدم رکھ ۔ اور مشرکین نے ہم پر زیادتی کی ہے ۔ جب وہ کسی فتنہ کا ارادہ کرتے ہیں تو ہم انکار کرتے ہیں ۔ “</b>",
        "bookID": "82.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 157340,
        "last_updated": null
    }
]